Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/PerformanceSensitiveAnalyzers/CSharp/Analyzers/xlf/AnalyzersResources.*.xlf
Languages: cs, de, ja, pt_br, zh_hans, zh_hant

# ClosureCaptureRuleMessage
source: The compiler will emit a class that will hold this as a field to allow capturing of this closure
cs: Kompilátor vygeneruje třídu, která toto bude uchovávat jako pole, aby se toto uzavření dalo zachytit.
de: Der Compiler gibt eine Klasse aus, in der diese Daten als Feld gespeichert werden, um eine Erfassung dieses Abschlusses zuzulassen.
ja: コンパイラは、このクロージャのキャプチャを可能にするフィールドとしてこれを保持するクラスを生成します
pt_br: O compilador emitirá uma classe que manterá isso como um campo para permitir a captura desse fechamento
zh_hans: 编译器将发出将此内容作为字段保存的类，以允许捕获此闭包
zh_hant: 編譯器會發出類別，其會保留該項目做為欄位以允許擷取此結束

# ClosureCaptureRuleTitle
source: Display class allocation to capture closure
cs: Zobrazit přidělení třídy, aby se zachytilo uzavření
de: Klassenzuordnung zu Abschlusserfassung anzeigen
ja: クラスの割り当てを表示してクロージャをキャプチャする
pt_br: Exibir a alocação de classe para capturar o fechamento
zh_hans: 显示类分配以捕获闭包
zh_hant: 顯示類別配置以擷取結束

# ClosureDriverRuleMessage
source: Heap allocation of closure Captures: {0}
cs: Přidělení haldy zachycení uzavření: {0}
de: Heapzuordnung von Abschlusserfassungen: {0}
ja: クロージャのヒープ割り当ては次をキャプチャします: {0}
pt_br: Alocação de heap de Capturas de fechamento: {0}
zh_hans: 闭包捕获的堆分配: {0}
zh_hant: 結束擷取的堆積配置: {0}

# ClosureDriverRuleTitle
source: Closure Allocation Source
cs: Zdroj přidělení uzavření
de: Quelle für Abschlusszuordnung
ja: クロージャ割り当てソース
pt_br: Origem da Alocação de Fechamento
zh_hans: 闭包分配源
zh_hant: 結束配置來源

# DelegateOnStructInstanceRuleMessage
source: Struct instance method being used for delegate creation, this will result in a boxing instruction
cs: Instanční metoda struct, pomocí které se deleguje vytváření. Toto způsobí instrukci zabalení.
de: Strukturinstanzmethode wird zur Delegaterstellung verwendet. Dies führt zu einer Boxinganweisung.
ja: デリゲートの作成に使用されている構造体インスタンス メソッドで、これはボックス化命令になります
pt_br: Um método de instância de struct está sendo usado para a criação de delegado. Isso resultará em uma instrução de conversão boxing
zh_hans: 结构实例方法正用于委托创建，这将导致装箱指令
zh_hant: 用於建立委派的結構執行個體方法，其會產生 Boxing 指示

# DelegateOnStructInstanceRuleTitle
source: Delegate on struct instance caused a boxing allocation
cs: Delegát v instanci struktury způsobil přidělení zabalení
de: Boxingzuordnung verursacht durch Delegat in Strukturinstanz
ja: 構造体インスタンスでのデリゲートが、ボックス化の割り当てを引き起こしました
pt_br: O delegado na instância do struct causou uma alocação de conversão boxing
zh_hans: 导致装箱分配的结构实例上的委托
zh_hant: 在結構執行個體上進行委派導致了 Boxing 配置

# LambaOrAnonymousMethodInGenericMethodRuleMessage
source: Considering moving this out of the generic method
cs: Zvažte možnost přesunout to mimo obecnou metodu.
de: Es wird erwogen, dieses Element aus der generischen Methode zu verschieben.
ja: これをジェネリック メソッドから移行することを検討します
pt_br: Considerar a retirada disso do método genérico
zh_hans: 考虑将此项移出泛型方法范围
zh_hant: 考慮將此移出泛型方法

# LambaOrAnonymousMethodInGenericMethodRuleTitle
source: Lambda or anonymous method in a generic method allocates a delegate instance
cs: Lambda nebo anonymní metoda v obecné metodě přidělují instanci delegáta
de: Lambdafunktion oder anonyme Methode in generischer Methode ordnet eine Delegatinstanz zu
ja: ジェネリック メソッド内のラムダ式または匿名メソッドは、デリゲート インスタンスを割り当てます
pt_br: O método lambda ou anônimo em um método genérico aloca uma instância delegada
zh_hans: Lambda 或泛型方法中的匿名方法会分配委托实例
zh_hant: 泛型方法中的 Lambda 或匿名方法，配置了委派執行個體

# MethodGroupAllocationRuleMessage
source: This will allocate a delegate instance
cs: Tato operace přidělí instanci delegáta.
de: Hiermit wird eine Delegatinstanz zugeordnet.
ja: これにより、デリゲート インスタンスが割り当てられます
pt_br: Essa opção alocará uma instância delegada
zh_hans: 这将会分配一个委托实例
zh_hant: 如此將會配置委派執行個體

# MethodGroupAllocationRuleTitle
source: Delegate allocation from a method group
cs: Přidělení delegáta ze skupiny metod
de: Delegatzuordnung aus einer Methodengruppe
ja: メソッド グループからのデリゲート割り当て
pt_br: Alocação de delegado de um grupo de métodos
zh_hans: 从方法组委托分配
zh_hant: 從方法群組委派配置

# ParamsParameterRuleMessage
source: This call site is calling into a function with a 'params' parameter. This results in an array allocation.
cs: Tato lokalita volání volá funkci s parametrem params. Výsledkem je přidělení pole.
de: Diese Aufrufsite ruft eine Funktion mit einem params-Parameter auf. Dies führt zu einer Arrayzuordnung.
ja: この呼び出しサイトは 'params' パラメーターを持つ関数を呼び出しています。結果として、配列が割り当てられます。
pt_br: Este site de chamada está chamando uma função com um parâmetro 'params'. Isso resulta em uma alocação de matriz.
zh_hans: 此调用站点正在调用带有 "params" 参数的函数。这会导致数组分配。
zh_hant: 此呼叫位置正在呼叫具有 'params' 參數的函式。這會產生陣列配置。

# ParamsParameterRuleTitle
source: Array allocation for params parameter
cs: Přidělení pole pro parametr params
de: Arrayzuordnung für params-Parameter
ja: params パラメーターの配列の割り当て
pt_br: Alocação de matriz para o parâmetro params
zh_hans: Params 参数的数组分配
zh_hant: params 參數的陣列配置

# ReadonlyMethodGroupAllocationRuleMessage
source: This will allocate a delegate instance
cs: Tato operace přidělí instanci delegáta.
de: Hiermit wird eine Delegatinstanz zugeordnet.
ja: これにより、デリゲート インスタンスが割り当てられます
pt_br: Essa opção alocará uma instância delegada
zh_hans: 这将会分配一个委托实例
zh_hant: 如此將會配置委派執行個體

# ReadonlyMethodGroupAllocationRuleTitle
source: Delegate allocation from a method group
cs: Přidělení delegáta ze skupiny metod
de: Delegatzuordnung aus einer Methodengruppe
ja: メソッド グループからのデリゲート割り当て
pt_br: Alocação de delegado de um grupo de métodos
zh_hans: 从方法组委托分配
zh_hant: 從方法群組委派配置

# ReferenceTypeEnumeratorRuleMessage
source: Non-ValueType enumerator may result in a heap allocation
cs: Enumerátor, který není ValueType, může způsobit přidělení haldy.
de: Nicht-ValueType-Enumerator kann zu einer Heapzuweisung führen.
ja: 非 ValueType 列挙子は、ヒープの割り当てを発生させる可能性があります
pt_br: Um enumerador que não seja ValueType poderá resultar em uma alocação de heap
zh_hans: 非 ValueType 枚举器可能会导致堆分配
zh_hant: 在堆積配置中會產生非 ValueType 列舉程式

# ReferenceTypeEnumeratorRuleTitle
source: Possible allocation of reference type enumerator
cs: Možné přidělení enumerátoru typů odkazů
de: Mögliche Zuordnung von Verweistypenumerator
ja: 参照型列挙子の可能な割り当て
pt_br: Alocação possível do enumerador de tipo de referência
zh_hans: 引用类型枚举器的可能分配
zh_hant: 參考型別列舉程式的可能配置情況

# StringConcatenationAllocationRuleMessage
source: Considering using StringBuilder
cs: Zvažte možnost použít StringBuilder.
de: Die Verwendung von StringBuilder wird in Betracht gezogen.
ja: StringBuilder の使用を検討します
pt_br: Considerar o uso de StringBuilder
zh_hans: 考虑使用 StringBuilder
zh_hant: 考慮使用 StringBuilder

# StringConcatenationAllocationRuleTitle
source: Implicit string concatenation allocation
cs: Implicitní přidělení zřetězení řetězců
de: Implizite Zuordnung von Zeichenfolgenverkettungen
ja: 暗黙的な文字列連結の割り当て
pt_br: Alocação implícita de concatenação de cadeia de caracteres
zh_hans: 隐式字符串串联分配
zh_hant: 隱含字串串連配置

# ValueTypeNonOverridenCallRuleMessage
source: Non-overridden virtual method call on a value type adds a boxing or constrained instruction
cs: Volání nepřepsané virtuální metody pro typ hodnoty přidává instrukci zabalení nebo omezenou instrukci.
de: Durch einen nicht außer Kraft gesetzten Aufruf einer virtuellen Methode für einen Werttyp wird eine Boxing- oder eingeschränkte Anweisung hinzugefügt.
ja: 値の型へのオーバーロードされていない仮想メソッド呼び出しにより、ボックス化または制限付きの命令が追加されます
pt_br: A chamada de método virtual não substituído em um tipo de valor adiciona uma instrução restrita ou de conversão boxing
zh_hans: 值类型上的非替代虚拟方法调用会添加装箱或受约束的指令
zh_hant: 在實值型別上呼叫非覆寫虛擬方法，會新增 Boxing 或限制指令

# ValueTypeNonOverridenCallRuleTitle
source: Non-overridden virtual method call on value type
cs: Volání nepřepsané virtuální metody pro typ hodnoty
de: Nicht außer Kraft gesetzter Aufruf einer virtuellen Methode für Werttyp
ja: 値の型へのオーバーライドされていない仮想メソッド呼び出し
pt_br: Chamada de método virtual não substituído no tipo de valor
zh_hans: 值类型上的非替代虚拟方法调用
zh_hant: 在實值型別上呼叫非覆寫虛擬方法

# ValueTypeToReferenceTypeConversionRuleMessage
source: Value type to reference type conversion causes boxing at call site (here), and unboxing at the callee-site. Consider using generics if applicable.
cs: Typ hodnoty pro převod typu odkazu způsobuje zabalení v lokalitě volání (tady) a rozbalení v lokalitě volajícího. Zvažte možnost použít obecné typy, pokud je to možné.
de: Der Werttyp für die Verweistypkonvertierung verursacht Boxing in der Aufrufsite (hier) und Unboxing in der Site der aufgerufenen Funktion. Verwenden Sie ggf. Generics.
ja: 値の型から参照型への変換は、呼び出しサイト (ここ) でのボックス化と、呼び出し先サイトでのボックス化解除につながります。該当する場合は、ジェネリックの使用を検討してください。
pt_br: O tipo de valor para a conversão de tipo de referência causa a conversão boxing no site de chamada (aqui) e a conversão unboxing no site do receptor. Considere o uso de genéricos, caso seja aplicável.
zh_hans: 值类型到引用类型的转换将导致在调用站点处(此处)装箱和在被调用方站点处取消装箱。如果适用，请考虑使用泛型
zh_hant: 將實值型別轉換為參考型別，導致在呼叫站台 (此處) 發生 Boxing，而在被呼叫站台則出現 Unboxing。如果可行的話，請考慮使用泛型。

# ValueTypeToReferenceTypeConversionRuleTitle
source: Value type to reference type conversion causing boxing allocation
cs: Typ hodnoty pro převod typů odkazů způsobuje přidělení zabalení
de: Werttyp für Verweistypkonvertierung verursacht Boxingzuordnung
ja: ボックス化割り当ての原因となる、値の型から参照型への変換
pt_br: Tipo de valor para a conversão de tipo de referência causando uma alocação de conversão boxing
zh_hans: 引用类型转换的值类型导致装箱分配
zh_hant: 將實值型別轉換為參考型別，會導致 Boxing 配置

# ValueTypeToReferenceTypeInAStringConcatenationRuleMessage
source: Value type ({0}) is being boxed to a reference type for a string concatenation
cs: Typ hodnoty ({0}) se balí do typu odkazu pro zřetězení řetězců.
de: Für den Werttyp ({0}) wird ein Boxing in einen Verweistyp für eine Zeichenfolgenverkettung durchgeführt.
ja: 値の型 ({0}) は、文字列連結のための参照型にボックス化されています
pt_br: O tipo de valor ({0}) está passando por uma conversão boxing, tornando-se um tipo de referência de uma concatenação de cadeia de caracteres
zh_hans: 值类型({0})正在装箱到引用类型以便进行字符串串联
zh_hant: 實值型別 ({0}) 正 Box 為參考型別，以進行字串串連

# ValueTypeToReferenceTypeInAStringConcatenationRuleTitle
source: Value type to reference type conversion allocation for string concatenation
cs: Přidělení typu hodnoty pro převod typů odkazů pro řetězení řetězců
de: Werttyp für Zuordnung der Verweistypkonvertierung für Zeichenfolgenverkettung
ja: 文字列連結のための、値の型から参照型への変換割り当て
pt_br: Tipo de valor para a alocação de conversão de tipo de referência de uma concatenação de cadeia de caracteres
zh_hans: 字符串串联的引用类型转换分配的值类型
zh_hant: 將實值型別轉換為參考型別的配置，以進行字串串連
