Repository: dotnet/roslyn
Catalog: src/Analyzers/CSharp/CodeFixes/xlf/CSharpCodeFixesResources.*.xlf
Languages: cs, de, ko, pl, pt_br, tr, zh_hant

source: Add [Obsolete]
cs: Přidat [Obsolete]
de: Hinzufügen [veraltet]
ko: [Obsolete] 추가
pl: Dodaj [przestarzałe]
pt_br: Adicionar [Obsolete]
tr: Ekle [Eski]
zh_hant: 新增 [Obsolete]

source: Add 'await'
cs: Přidat await
de: "await" hinzufügen
ko: 'await' 추가
pl: Dodaj operator „await”
pt_br: Adicionar 'await'
tr: 'await' ekleyin
zh_hant: 新增 'await'

# Add_parentheses_around_conditional_expression_in_interpolated_string
source: Add parentheses
cs: Přidat závorky
de: Klammern hinzufügen
ko: 괄호 추가
pl: Dodaj nawiasy
pt_br: Adicionar parênteses
zh_hant: 新增括弧

source: Add 'this.'
cs: Přidejte položku this.
de: "this." hinzufügen
ko: this'를 추가합니다.
pl: Dodaj „this.”
pt_br: Adicionar 'isso.'
tr: this' ekleyin.
zh_hant: 新增 'this.'

source: Allow unsafe code in this project
cs: Povolit v tomto projektu nezabezpečený kód
de: Unsicheren Code in diesem Projekt zulassen
ko: 이 프로젝트에서 안전하지 않은 코드 허용
pl: Zezwalaj na niebezpieczny kod w tym projekcie
pt_br: Permitir código não seguro neste projeto
zh_hant: 在此專案中允許不安全的程式碼

source: Assign 'out' parameters
cs: Přiřadit parametry out
de: out-Parameter zuweisen
ko: 'out' 매개 변수 할당
pl: Przypisz parametry „out”
pt_br: Atribuir parâmetros 'out'
zh_hant: 指派 'out' 參數

source: Assign 'out' parameters (at start)
cs: Přiřadit parametry out (při spuštění)
de: out-Parameter zuweisen (beim Start)
ko: 'out' 매개 변수 할당(시작 시)
pl: Przypisz parametry „out” (na początku)
pt_br: Atribuir parâmetros 'out' (no início)
zh_hant: 指派 'out' 參數 (開始時)

source: Assign to '{0}'
cs: Přiřadit k {0}
de: "{0}" zuweisen
ko: '{0}'에 할당
pl: Przypisz do „{0}”
pt_br: Atribuir a '{0}'
tr: '{0}' öğesine ata
zh_hant: 指派給 '{0}'

source: Change return type from {0} to {1}
cs: Změnit typ návratové hodnoty z: {0} na: {1}
de: Rückgabetyp von "{0}" in "{1}" ändern
ko: 반환 형식을 {0}에서 {1}(으)로 변경
pl: Zmień zwracany typ z {0} na {1}
pt_br: Alterar tipo de retorno de {0} para {1}
tr: Dönüş türünü {0} değerinden {1} olarak değiştir
zh_hant: 將傳回類型從 {0} 變更為 {1}

source: Compare to '{0}'
cs: Porovnat s {0}
de: Mit "{0}" vergleichen
ko: '{0}'과(와) 비교
pl: Porównaj z „{0}”
pt_br: Comparar a '{0}'
tr: '{0}' ile karşılaştır
zh_hant: 與 '{0}' 比較

source: Convert to positional record
cs: Převést na poziční záznam(record)
de: In positionellen record konvertieren
ko: 위치 record로 변환
pl: Konwertuj na pozycyjny record
pt_br: Converter em record posicional
zh_hant: 轉換為位置 record

source: Convert 'typeof' to 'nameof'
cs: Převést typeof na nameof
de: "typeof" in "nameof" konvertieren
ko: 'typeof'를 'nameof'로 변환
pl: Konwertuj element „typeof” na element „nameof”
pt_br: Converter 'typeof' em 'nameof'
tr: 'Typeof' metodunu 'nameof' metoduna dönüştürün
zh_hant: 將 'typeof' 轉換為 'nameof'

source: Fix constraint
cs: Opravit omezení
de: Einschränkung korrigieren
ko: 제약 조건 수정
pl: Dodaj ograniczenie
pt_br: Corrigir restrição
tr: Kısıtlamayı düzelt
zh_hant: 修正限制式

source: Declare as nullable
cs: Deklarovat jako s možnou hodnotou null
de: Als für NULL-Werte zulässig deklarieren
ko: Nullable로 선언
pl: Zadeklaruj jako dopuszczający wartość null
pt_br: Declarar como anulável
tr: Olarak null olabilecek ilan
zh_hant: 宣告為可為 Null

source: Explicitly inherit documentation
cs: Explicitně dědit dokumentaci
de: Dokumentation explizit erben
ko: 명시적으로 상속 문서
pl: Wyraźnie dziedziczona dokumentacja
pt_br: Herdar explicitamente a documentação
tr: Belgeleri açıkça devral
zh_hant: 明確繼承文件

source: Fix record declaration
cs: Opravit deklaraci záznamu
de: Korrigieren der Datensatzdeklaration
ko: 레코드 선언 수정
pl: Napraw deklarację rekordu
pt_br: Correção do registro de declaração
tr: Kayıt bildirimini düzelt
zh_hant: 修正記錄宣告

source: Fix return type
cs: Opravit návratový typ
de: Rückgabetyp korrigieren
ko: 반환 형식 수정
pl: Napraw zwracany typ
pt_br: Corrigir o tipo de retorno
tr: Dönüş türünü düzelt
zh_hant: 修正傳回型別

source: Hide base member
cs: Skrýt základního člena
de: Basismember ausblenden
ko: 기본 멤버 숨기기
pl: Ukryj składową bazową
pt_br: Ocultar o membro base
tr: Temel üyeyi gizle
zh_hant: 隱藏基底成員

source: Make {0} return Task instead of void.
cs: Nastavit, že {0} má místo hodnoty typu Void vracet hodnotu Task
de: "{0}" in Rückgabeaufgabe umwandeln, statt leer zu lassen.
ko: {0}에서 void 대신 Task를 반환하도록 설정합니다.
pl: Ustaw element {0}, aby zwracał zadanie zamiast elementu void.
pt_br: Fazer com que {0} retorne Tarefa em vez de nulo.
zh_hant: 使 {0} 傳回 Task 而不是 void。

source: Make field 'required'
cs: Nastavit pole jako „required“
de: Feld als 'required' festlegen
ko: 필드 'required' 만들기
pl: Ustaw pole jako „required”
pt_br: Torne o campo 'obrigatório' (required)
zh_hant: 將欄位設為 'required'

source: Make method async
cs: Převést metodu na asynchronní
de: Methode als asynchron definieren
ko: 메서드를 비동기로 설정
pl: Ustaw metodę jako asynchroniczną
pt_br: Tornar método assíncrono
zh_hant: 讓方法非同步

# Make_method_async_remain_void
source: Make method async (stay void)
cs: Převést metodu na asynchronní (ponechat neplatné)
de: Methode als asynchron definieren ("void" beibehalten)
ko: 메서드를 비동기로 설정(void 유지)
pl: Ustaw metodę jako asynchroniczną (pozostaw jako unieważnioną)
pt_br: Tornar o método assíncrono (permanecer nulo)
zh_hant: 讓方法不同步 (仍為 void)

source: Make property 'required'
cs: Nastavit vlastnost jako „required“
de: Eigenschaft als 'required' festlegen
ko: 속성 'required' 만들기
pl: Ustaw właściwość jako „required”
pt_br: Tornar a propriedade 'obrigatória' (required)
zh_hant: 將屬性設為 'required'

source: Make 'ref struct'
cs: Nastavit jako ref struct
de: "ref struct" erstellen
ko: 'ref struct'로 지정
pl: Ustaw jako „ref struct”
pt_br: Alterar 'ref struct'
zh_hant: 設為 'ref struct'

source: Pass in captured variables as arguments
cs: Předat zachycené proměnné jako argumenty
de: Erfasste Variablen als Argumente übergeben
ko: 캡처된 변수를 인수로 전달
pl: Przekaż przechwycone zmienne jako argumenty
pt_br: Passar variáveis capturadas como argumentos
tr: Yakalanan değişkenleri bağımsız değişken olarak geçir
zh_hant: 以引數形式傳入擷取到的變數

source: Place statement on following line
cs: Umístit příkaz na následující řádek
de: Anweisung in folgender Zeile platzieren
ko: 다음 줄에 문 배치
pl: Umieść instrukcję w następnym wierszu
pt_br: Colocar a instrução na linha seguinte
tr: Aşağıdaki satıra ifadeyi yerleştirin
zh_hant: 將陳述式放在下一行

source: Place token on following line
cs: Umístit token na následující řádek.
de: Token in der folgenden Zeile platzieren
ko: 다음 줄에 토큰 배치
pl: Umieść token w następnym wierszu
pt_br: Colocar token na linha a seguir
zh_hant: 將權杖放在下一行

# Remove_blank_lines_between_braces
source: Remove blank line between braces
cs: Odebrat prázdný řádek mezi závorkami
de: Leerzeile zwischen geschweiften Klammern entfernen
ko: 중괄호 사이의 빈 줄 제거
pl: Usuń pusty wiersz w nawiasach klamrowych
pt_br: Remover a linha em branco entre chaves
tr: Küme ayraçları arasındaki boş satırı kaldır
zh_hant: 移除大括弧之間的空白行

source: Remove 'in' keyword
cs: Odebrat klíčové slovo in
de: Schlüsselwort "in" entfernen
ko: 'in' 키워드 제거
pl: Usuń słowo kluczowe „in”
pt_br: Remover palavra-chave 'in'
zh_hant: 移除 'in' 關鍵字

source: Remove 'new' modifier
cs: Odebrat modifikátor new
de: new-Modifizierer entfernen
ko: 'new' 한정자 제거
pl: Usuń modyfikator „new”
pt_br: Remover modificador 'novo'
zh_hant: 移除 'new' 修飾詞

source: Remove unnecessary usings
cs: Odebrat nepotřebné direktivy using

source: Remove unreachable code
cs: Odebrat nedosažitelný kód
de: Nicht erreichbaren Code entfernen
ko: 접근할 수 없는 코드 제거
pl: Usuń nieosiągalny kod
pt_br: Remover código inacessível
tr: Erişilemeyen kodları kaldır
zh_hant: 移除執行不到的程式碼

source: Remove unused function
cs: Odebrat nepoužitou funkci
de: Nicht verwendete Funktion entfernen
ko: 사용하지 않는 함수 제거
pl: Usuń nieużywaną funkcję
pt_br: Remover função não utilizada
zh_hant: 移除未使用的函式

source: Replace return with yield return
cs: Nahradit příkaz return příkazem yield return
de: "return" durch "yield return" ersetzen
ko: return을 yield return으로 바꾸기
pl: Zamień instrukcję return na instrukcję yield return
pt_br: Substituir return por yield return
tr: Dönüşü, bırakma dönüşüyle değiştir
zh_hant: 使用 yield return 取代 return

source: Unseal class '{0}'
cs: Rozpečetit třídu {0}
de: Versiegelung der Klasse "{0}" aufheben
ko: '{0}' 클래스 봉인 해제
pl: Odpieczętuj klasę „{0}”
pt_br: Desselar a classe '{0}'
tr: '{0}' sınıfının mührünü aç
zh_hant: 為類別 '{0}' 解密

# Upgrade_all_csharp_projects_to_language_version_0
source: Upgrade all C# projects to language version '{0}'
cs: Upgradovat všechny projekty jazyka C# na jazykovou verzi {0}
de: Upgrade für alle C#-Projekte auf Sprachversion "{0}" durchführen
ko: 모든 C# 프로젝트를 언어 버전 '{0}'(으)로 업그레이드
pl: Uaktualnij wszystkie projekty C# do wersji „{0}” języka
pt_br: Atualizar todos os projetos C# para a versão de linguagem '{0}'
zh_hant: 將所有 C# 專案升級為語言版本 '{0}'

# Upgrade_this_project_to_csharp_language_version_0
source: Upgrade this project to C# language version '{0}'
cs: Upgradovat tento projekt na jazykovou verzi C# {0}
de: Upgrade für dieses Projekt auf C#-Sprachversion "{0}" durchführen
ko: 이 프로젝트를 C# 언어 버전 '{0}'(으)로 업그레이드
pl: Uaktualnij ten projekt do wersji „{0}” języka C#
pt_br: Atualizar este projeto para versão de linguagem C# '{0}'
zh_hant: 將此專案升級為 C# 語言版本 '{0}'

source: Use '{0}'
cs: Použít {0}
de: "{0}" verwenden
ko: '{0}' 사용
pl: Użyj elementu „{0}”
pt_br: Usar '{0}'
zh_hant: 使用 '{0}'

source: Use collection expression
cs: Použít výraz kolekce
de: Sammlungsausdruck verwenden
ko: 컬렉션 식 사용
pl: Użyj wyrażenia kolekcji
pt_br: Usar expressão de coleção
zh_hant: 使用集合運算式

source: Use interpolated verbatim string
cs: Použít interpolovaný doslovný řetězec
de: Interpolierte ausführliche Zeichenfolge verwenden
ko: 보간된 축자 문자열 사용
pl: Użyj interpolowanego ciągu dosłownego wyrażenia
pt_br: Usar cadeia de caracteres verbatim interpolada
tr: Enterpolasyonlu kelimesi kelimesine dizeyi kullanın
zh_hant: 使用插入的逐字字串

source: Use primary constructor (and remove fields)
cs: Použít primární konstruktor (a odebrat pole)
de: Primären Konstruktor verwenden (und Felder entfernen)
ko: 기본 생성자 사용(및 필드 제거)
pl: Użyj konstruktora podstawowego (i usuń pola)
pt_br: Usar construtor primário (e remover campos)
zh_hant: 使用主要建構函式 (並移除欄位)

source: Use primary constructor (and remove members)
cs: Použít primární konstruktor (a odebrat členy)
de: Primären Konstruktor verwenden (und Member entfernen)
ko: 기본 생성자 사용(및 멤버 제거)
pl: Użyj konstruktora podstawowego (i usuń elementy członkowskie)
pt_br: Usar construtor primário (e remover membros)
zh_hant: 使用主要建構函式 (並移除成員)

source: Use primary constructor (and remove properties)
cs: Použít primární konstruktor (a odebrat vlastnosti)
de: Primären Konstruktor verwenden (und Eigenschaften entfernen)
ko: 기본 생성자 사용(및 속성 제거)
pl: Użyj konstruktora podstawowego (i usuń właściwości)
pt_br: Usar construtor primário (e remover propriedades)
zh_hant: 使用主要建構函式 (並移除屬性)

source: Warning: Adding parameters to local function declaration may produce invalid code.
cs: Upozornění: Když se do deklarace místní funkce přidají parametry, může to vytvořit neplatný kód.
de: Warnung: Das Hinzufügen von Parametern zur Deklaration einer lokalen Funktion kann zu ungültigem Code führen.
ko: 경고: 로컬 함수 선언에 매개 변수를 추가할 경우 잘못된 코드가 생성될 수 있습니다.
pl: Ostrzeżenie: Dodanie parametrów do deklaracji funkcji lokalnej może prowadzić do powstania nieprawidłowego kodu.
pt_br: Aviso: a adição de parâmetros à declaração de função local pode produzir um código inválido.
tr: Uyarı: Yerel işlev bildirimine parametre eklendiğinde geçersiz kod üretilebilir.
zh_hant: 警告: 新增參數到區域函式宣告可能會產生無效的程式碼。

source: Place colon on following line
tr: Aşağıdaki satıra iki noktayı yerleştirin

source: Remove Unnecessary Usings
tr: Gereksiz Kullanımları Kaldır
