Repository: dotnet/roslyn
Catalog: src/ExpressionEvaluator/Core/Source/ResultProvider/Portable/xlf/Resources.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

source: Dynamic View
cs: Dynamické zobrazení
de: Dynamische Ansicht
fr: Affichage dynamique
it: Visualizzazione dinamica
ja: 動的ビュー
ko: 동적 뷰
pl: Widok dynamiczny
pt_br: Modo de Exibição Dinâmico
tr: Dinamik Görünüm
zh_hans: 动态视图
zh_hant: 動態檢視

# DynamicViewNotDynamic
source: Only COM or Dynamic objects can have Dynamic View
cs: Jenom COM nebo dynamické objekty můžou mít dynamické zobrazení
de: Nur COM-Objekte oder dynamische Objekte können eine dynamische Ansicht besitzen.
fr: Seuls les objets COM ou dynamiques peuvent avoir un affichage dynamique
it: La Visualizzazione dinamica è consentita solo per oggetti COM o dinamici
ja: 動的ビューは、COM オブジェクトまたは動的なオブジェクトでのみ使用できます
ko: COM 또는 동적 개체에만 동적 뷰가 있을 수 있습니다.
pl: Tylko obiekty COM lub dynamiczne mogą mieć widok dynamiczny
pt_br: Somente objetos COM ou Dinâmicos podem ter um Modo de Exibição Dinâmico
tr: Sadece COM ya da Dinamik nesnelerde Dinamik Görünüm olabilir
zh_hans: 只有 COM 或动态对象可以具有动态视图
zh_hant: 只有 COM 或 Dynamic 物件可以有動態檢視

# DynamicViewValueWarning
source: Expanding the Dynamic View will get the dynamic members for the object
cs: Rozbalení dynamického zobrazení získá dynamické členy objektu
de: Durch Aufklappen der dynamischen Ansicht werden die dynamischen Elemente für das Objekt abgerufen.
fr: Le développement de l'affichage dynamique permet d'obtenir les membres dynamiques pour l'objet
it: Se si espande la Visualizzazione dinamica, si otterranno i membri dinamici per l'oggetto
ja: 動的ビューを展開すると、オブジェクトの動的メンバーが取得されます
ko: 동적 뷰를 확장하면 개체의 동적 멤버를 가져옵니다.
pl: Rozwinięcie widoku dynamicznego spowoduje wyświetlenie dynamicznych składowych dla obiektu
pt_br: Ao expandir o Modo de Exibição Dinâmico, você receberá os membros dinâmicos do objeto
tr: Dinamik Görünümü genişletmek nesne için dinamik üyeler alacak
zh_hans: 展开动态视图将获得对象的动态成员
zh_hant: 展開動態檢視會取得物件的動態成員

# ErrorName
source: Error
cs: Chyba
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pl: Błąd
pt_br: Erro
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# ExceptionThrown
source: '{0}' threw an exception of type '{1}'
cs: {0} – došlo k výjimce typu {1}.
de: '{0}' löste eine Ausnahme des Typs '{1}' aus
fr: '{0}' a levé une exception de type '{1}'
it: '{0}' ha generato un'eccezione di tipo '{1}'
ja: '{0}' は型 '{1}' の例外をスローしました
ko: '{0}'이(가) '{1}' 형식의 예외를 throw했습니다.
pl: '„{0}”: zwrócono wyjątek typu „{1}”
pt_br: '{0}' gerou uma exceção do tipo '{1}'
tr: '{0}', '{1}' türünde bir özel durum oluşturdu
zh_hans: '“{0}”引发了类型“{1}”的异常
zh_hant: '{0}' 擲回 '{1}' 類型的例外狀況

# HostValueNotFound
source: Cannot provide the value: host value not found
cs: Nejde zadat hodnotu: hodnota hosta se nenašla.
de: Der Wert kann nicht bereitgestellt werden: Der Hostwert wurde nicht gefunden.
fr: Impossible de fournir la valeur : valeur d'hôte introuvable
it: Non è possibile specificare il valore: il valore host non è stato trovato
ja: 値を指定できません: ホスト値が見つかりません
ko: 값을 제공할 수 없음: 호스트 값을 찾을 수 없음
pl: Nie można podać wartości: nie znaleziono wartości hosta
pt_br: Não é possível fornecer o valor: valor do host não encontrado
zh_hans: 无法提供值: 未找到主机值

# InvalidPointerDereference
source: Cannot dereference '{0}'. The pointer is not valid.
cs: Nejde přistoupit přes ukazatel na: {0}. Ukazatel není platný.
de: Dereferenzieren von '{0}' ist nicht möglich. Der Pointer ist ungültig.
fr: Impossible de déréférencer '{0}'. Le pointeur n'est pas valide.
it: Non è possibile dereferenziare '{0}'. Il puntatore non è valido.
ja: '{0}' を逆参照できません。ポインターが無効です。
ko: {0}'을(를) 역참조할 수 없습니다. 포인터가 잘못되었습니다.
pl: Nie można usunąć odwołania do elementu „{0}”. Wskaźnik jest nieprawidłowy.
pt_br: Não é possível cancelar a referência '{0}'. O ponteiro não é válido.
tr: {0}' başvurusu çözülemiyor. İşaretçi geçerli değil.
zh_hans: 无法取消引用“{0}”。指针无效。
zh_hant: 無法取值 '{0}'。指標無效。

source: Native View
cs: Nativní zobrazení
de: Native Ansicht
fr: Vue native
it: Visualizzazione nativa
ja: ネイティブ ビュー
ko: 네이티브 뷰
pl: Widok natywny
pt_br: Exibição Nativa
tr: Yerel Görünüm
zh_hans: 本机视图
zh_hant: 原生檢視

# NativeViewNotNativeDebugging
source: To inspect the native object, enable native code debugging.
cs: Pokud chcete prozkoumat nativní objekt, povolte ladění nativního kódu.
de: Aktivieren Sie das native Codedebugging, um das native Objekt zu inspizieren.
fr: Pour inspecter l'objet natif, activez le débogage du code natif.
it: Per ispezionare l'oggetto nativo, abilitare il debug del codice nativo.
ja: ネイティブ オブジェクトを検査するには、ネイティブ コードのデバックを有効にする必要があります。
ko: 네이티브 개체를 검사하려면 네이티브 코드 디버깅을 사용하세요.
pl: Aby sprawdzić obiekt natywny, włącz debugowanie kodu natywnego.
pt_br: Para inspecionar o objeto nativo, habilite a depuração de código nativo.
tr: Yerel nesneyi incelemek için yerel kod hata ayıklamasını etkinleştirin.
zh_hans: 要检查本机对象，请启用本机代码调试。
zh_hant: 若要檢查原生物件，請啟用機器碼偵錯。

source: Non-Public members
cs: Neveřejné členy
de: Nicht öffentliche Member
fr: Membres non publics
it: Membri non pubblici
ja: パブリックでないメンバー
ko: public이 아닌 멤버
pl: Niepubliczne składowe
pt_br: Membros não públicos
tr: Ortak Olmayan üyeler
zh_hans: 非公共成员
zh_hant: 非公用成員

source: Raw View
cs: Nezpracované zobrazení
de: Rohdatenansicht
fr: Affichage brut
it: Visualizzazione non elaborata
ja: 生ビュー
ko: Raw 뷰
pl: Pierwotny widok
pt_br: Modo de Exibição Bruto
tr: Ham Görünüm
zh_hans: 原始视图
zh_hant: 未經處理的檢視

source: Results View
cs: Zobrazení výsledků
de: Ergebnisansicht
fr: Affichage des résultats
it: Visualizzazione risultati
ja: 結果ビュー
ko: 결과 뷰
pl: Widok wyników
pt_br: Visualização dos Resultados
tr: Sonuçlar Görünümü
zh_hans: 结果视图
zh_hant: 結果檢視

# ResultsViewNoSystemCore
source: Results View requires System.Core.dll to be referenced
cs: Zobrazení výsledku požaduje odkazování na System.Core.dll
de: Die Ergebnisansicht erfordert einen Verweis auf "System.Core.dll".
fr: L'affichage des résultats nécessite le référencement de System.Core.dll
it: La Visualizzazione risultati richiede il riferimento a System.Core.dll
ja: 結果ビューは System.Core.dll を参照する必要があります。
ko: 결과 뷰를 사용하려면 System.Core.dll을 참조해야 합니다.
pl: Widok wyników wymaga odwołania do biblioteki System.Core.dll
pt_br: A Visualização dos Resultados exige que o System.Core.dll seja referenciado
tr: Sonuçlar Görünümü'ne başvurulabilmesi için System.Core.dll gerekir.
zh_hans: 结果视图要求引用 System.Core.dll
zh_hant: 結果檢視必須參考 System.Core.dll

# ResultsViewNotEnumerable
source: Only Enumerable types can have Results View
cs: Jenom výčtové typy můžou mít Zobrazení výsledků.
de: Eine Ergebnisansicht kann nur für Enumerable-Typen festgelegt werden.
fr: Seuls les types énumérables peuvent avoir un affichage des résultats
it: Solo i tipi Enumerable possono disporre di una Visualizzazione risultati
ja: 結果ビューを含むことができるのは、列挙可能な型だけです
ko: Enumerable 형식만 결과 뷰를 가질 수 있습니다.
pl: Tylko elementy typu Enumerable mogą mieć widok wyników
pt_br: Somente tipos Enumeráveis podem ter Visualização dos Resultados
tr: Sadece Listelenebilir türlerde Sonuçlar Görünümü olabilir
zh_hans: 只有可枚举类型才能具有结果视图
zh_hant: 只有可列舉類型才能有結果檢視

# ResultsViewValueWarning
source: Expanding the Results View will enumerate the IEnumerable
cs: Při rozbalení zobrazení výsledků se vytvoří výčet IEnumerable.
de: Beim Aufklappen der Ergebnisansicht wird IEnumerable aufgeführt.
fr: Le développement de l'affichage des résultats permet d'énumérer IEnumerable
it: L'espansione della Visualizzazione risultati enumera IEnumerable
ja: 結果ビューを展開すると、IEnumerable が列挙されます
ko: 결과 뷰를 확장하면 IEnumerable이 열거됩니다.
pl: Rozwinięcie widoku wyników spowoduje wyliczenie interfejsów IEnumerable
pt_br: Expandir a Visualização dos Resultados vai enumerar o IEnumerable
tr: Sonuçlar Görünümü'nü genişletmek IEnumerable'ı listeleyecek
zh_hans: 展开结果视图将会枚举 IEnumerable
zh_hant: 展開結果檢視時將會列舉 IEnumerable

source: Shared members
cs: Sdílené členy
de: Freigegebene Member
fr: Membres partagés
it: Membri condivisi
ja: 共有メンバー
ko: 공유 멤버
pl: Udostępnione składowe
pt_br: Membros compartilhados
tr: Paylaşılan üyeler
zh_hans: 共享成员
zh_hant: 共用的成員

source: Static members
cs: Statické členy
de: Statische Member
fr: Membres statiques
it: Membri statici
ja: 静的メンバー
ko: 정적 멤버
pl: Statyczne składowe
pt_br: Membros estáticos
tr: Statik üyeler
zh_hans: 静态成员
zh_hant: 靜態成員

# TypeVariablesName
source: Type variables
cs: Typové proměnné
de: Typvariablen
fr: Variables de type
it: Variabili di tipo
ja: Type 変数
ko: 형식 변수
pl: Zmienne typu
pt_br: Variáveis de tipo
tr: Tür değişkenleri
zh_hans: 类型变量
zh_hant: 類型變數
