Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/PublicApiAnalyzers/Core/Analyzers/xlf/PublicApiAnalyzerResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddAllItemsInDocumentToTheApiTitle
source: Add all items in document '{0}' to the API
cs: Přidat všechny položky v dokumentu {0} do rozhraní API
de: Alle Elemente im Dokument „{0}“ der API hinzufügen
es: Agregue todos los elementos del documento "{0}" a la API
fr: Ajouter tous les éléments du document «{0}» à l’API
it: Aggiungi tutti gli elementi del documento '{0}' all'API
ja: ドキュメント '{0}' 内のすべての項目を API へ追加
ko: 문서 '{0}'의 모든 항목을 API에 추가
pl: Dodaj wszystkie elementy w dokumencie „{0}” do interfejsu API
pt_br: Adicione todos os itens do documento '{0}' à API
ru: Добавить все элементы документа "{0}" в API
tr: '{0}' belgesindeki tüm öğeleri API'ye ekle
zh_hans: 将文档“{0}”中的所有项添加到 API
zh_hant: 將文件 '{0}' 中的所有項目新增至 API

# AddAllItemsInProjectToTheApiTitle
source: Add all items in project '{0}' to the API
cs: Přidat všechny položky v projektu {0} do rozhraní API
de: Alle Elemente im Projekt „{0}“ der API hinzufügen
es: Agregue todos los elementos del proyecto "{0}" a la API
fr: Ajouter tous les éléments du projet «{0}» à l’API
it: Aggiungi tutti gli elementi del progetto '{0}' all'API
ja: プロジェクト '{0}' 内のすべての項目を API へ追加
ko: 프로젝트 '{0}'의 모든 항목을 API에 추가
pl: Dodaj wszystkie elementy w projekcie „{0}” do interfejsu API
pt_br: Adicione todos os itens do projeto '{0}' à API
ru: Добавить все элементы проекта "{0}" в API
tr: '{0}' projesindeki tüm öğeleri API'ye ekle
zh_hans: 将项目“{0}”中的所有项添加到 API
zh_hant: 將專案 '{0}' 中的所有項目新增至 API

# AddAllItemsInTheSolutionToTheApiTitle
source: Add all items in the solution to the API
cs: Přidat všechny položky v řešení do rozhraní API
de: Alle Elemente in der Lösung der API hinzufügen
es: Agregar todos los elementos de la solución a la API pública
fr: Ajouter tous les éléments de la solution à l’API
it: Aggiungi tutti gli elementi della soluzione all'API
ja: ソリューション内のすべての項目を API へ追加
ko: API에 솔루션의 모든 항목 추가
pl: Dodaj wszystkie elementy w rozwiązaniu interfejsu API
pt_br: Adicione todos os itens da solução à API
ru: Добавить все элементы решения в API
tr: Çözümdeki tüm öğeleri API'ye ekleyin
zh_hans: 将解决方案中的所有项添加到 API
zh_hant: 將解決方案中的所有項目新增至 API

# AnnotateInternalApiDescription
source: All internal types and members should be declared with nullability annotations in InternalAPI.txt. This draws attention to API nullability changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny interní typy a členy by se měly deklarovat s anotacemi o možnosti použití hodnoty null v souboru InternalAPI.txt. To přitáhne pozornost ke změnám možnosti použití hodnoty null u rozhraní API při revizích a v historii správy zdrojového kódu a pomůže předejít změnám způsobujícím chybu.
de: Alle internen Typen und Member müssen in InternalAPI.txt mit Anmerkungen zur NULL-Zulässigkeit deklariert werden. Dadurch wird die Aufmerksamkeit auf Änderungen an der NULL-Zulässigkeit der API in den Code Reviews und im Quellcodeverwaltungsverlauf gelenkt, und Breaking Changes werden verhindert.
es: Todos los tipos y miembros internos deben declararse con anotaciones de nulabilidad en InternalAPI.txt. Esto atrae la atención a los cambios de nulabilidad de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Tous les types et membres internes doivent être déclarés avec des annotations de nullabilité dans InternalAPI.txt. Cela attire l’attention sur les modifications de nullabilité de l’API dans les révisions de code et l’historique du contrôle de code source, et permet d’éviter les changements cassants.
it: Tutti i tipi e i membri interni devono essere dichiarati con annotazioni di supporto dei valori Null in InternalAPI.txt. In questo modo si richiama l'attenzione sulle modifiche del supporto dei valori Null all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e si contribuisce a evitare modifiche che causano un'interruzione.
ja: すべての内部の型とメンバーは、NULL 値許容の注釈を付けて、InternalAPI.txt で宣言する必要があります。これにより、コード レビューとソース管理履歴で API の NULL 値の許容の変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: 모든 내부 형식 및 구성원은 InternalAPI.txt에서 Null 허용 여부 주석을 포함하여 선언되어야 합니다. 그러면 코드 검토 및 소스 제어 기록에서 API Null 허용 여부 변경 내용을 쉽게 확인할 수 있고 호환성이 손상되는 변경을 방지할 수 있습니다.
pl: Wszystkie wewnętrzne typy i składowe powinny być zadeklarowane w pliku PublicAPI.txt z adnotacjami opcji dopuszczania wartości null. To zwraca uwagę na zmiany opcji dopuszczania wartości null interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym nieprawidłowe działanie.
pt_br: Todos os tipos e membros internos devem ser declarados com anotações de nulidade em InternalAPI.txt. Isso chama a atenção para as alterações de nulidade da API nas revisões de código e no histórico de controle do código-fonte e ajuda a evitar alterações significativas.
ru: Все внутренние типы и элементы должны быть объявлены в InternalAPI.txt. с заметками допустимости значений NULL. Это привлекает внимание к изменениям допустимости значений NULL в API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm genel türler ve üyeler PublicAPI.txt içinde null atanabilirlik ek açıklamalarıyla tanımlanmalıdır. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API null atanabilirlik değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 应在 InternalAPI.txt 中使用为 Null 性注释声明所有内部类型和成员。这将关注代码评审和源代码管理历史记录中的 API 为 Null 性更改，并有助于防止中断性变更。
zh_hant: 應在 InternalAPI.txt 中宣告所有內部類型與成員並加上可 NULL 性註釋。這麼做會讓您注意到程式碼檢閱與原始檔控制歷程記錄中的 API 可 NULL 性變更，同時有助於避免重大變更。

# AnnotateInternalApiMessage
source: Symbol '{0}' is missing nullability annotations in the declared API
cs: U symbolu {0} chybí v deklarovaném rozhraní API anotace o možnosti použití hodnoty null.
de: Für das Symbol "{0}" fehlen Anmerkungen zur NULL-Zulässigkeit in der deklarierten API.
es: El símbolo "{0}" no tiene anotaciones de nulabilidad en la API declarada.
fr: Il manque des annotations de nullabilité pour le symbole '{0}' dans l'API déclarée
it: Nel simbolo '{0}' mancano le annotazioni di supporto dei valori Null nell'API dichiarata
ja: シンボル '{0}' では、宣言された API に NULL 許容の注釈がありません
ko: 선언된 API에서 '{0}' 기호에 Null 허용 여부 주석이 없습니다.
pl: Symbol „{0}” nie ma adnotacji opcji dopuszczania wartości null w zadeklarowanym interfejsie API
pt_br: O símbolo '{0}' não tem anotações de nulidade na API declarada
ru: В объявленном API для символа "{0}" отсутствуют заметки о допустимости значений NULL.
tr: '{0}' sembolünde, bildirilen API'deki null atanabilirlik ek açıklamaları eksik
zh_hans: 符号“{0}”在声明的 API 中缺少为 Null 性注释
zh_hant: 在宣告的 API 中，符號 '{0}' 缺少可為 Null 的註釋

# AnnotateInternalApiTitle
source: Annotate nullability of internal types and members in the declared API
cs: Přidat anotace o možnosti použití hodnoty null u interních typů a členů v deklarovaném rozhraní API
de: NULL-Zulässigkeit von internen Typen und Member in der deklarierten API anmerken
es: Anotar la nulabilidad de los miembros y tipos en la API declarada
fr: Annoter la nullabilité des types internes et des membres dans l’API déclarée
it: Annota il supporto dei valori Null di tipi interni e membri nell'API dichiarata
ja: 宣言された内部 API の型とメンバーの NULL 値許容の注釈を付ける
ko: 선언된 API에서 내부 형식 및 구성원의 Null 허용 여부 주석 추가
pl: Dodawanie adnotacji opcji dopuszczania wartości null typów i składowych w zadeklarowanym interfejsie API
pt_br: Anote a nulidade de tipos e membros internos na API declarada
ru: Добавлять заметки о допустимости значений NULL для типов и элементов в объявленном API
tr: Tanımlanan API'deki dahili türlerin ve üyelerin null atanabilirliğine not ekleyin
zh_hans: 在声明的 API 中对内部类型和成员的为 Null 性进行批注
zh_hant: 標註已宣告 API 中內部類型和成員的可 NULL 性

# AnnotatePublicApiDescription
source: All public types and members should be declared with nullability annotations in PublicAPI.txt. This draws attention to API nullability changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny veřejné typy a členy by se měly deklarovat s anotacemi o možnosti použití hodnoty null v souboru PublicAPI.txt. To přitáhne pozornost ke změnám možnosti použití hodnoty null u rozhraní API při revizích a v historii správy zdrojového kódu a pomůže předejít změnám způsobujícím chybu.
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" mit Anmerkungen zur NULL-Zulässigkeit deklariert werden. Dadurch wird die Aufmerksamkeit auf Änderungen an der NULL-Zulässigkeit der API in den Code Reviews und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
es: Todos los tipos y miembros públicos deben declararse con anotaciones de nulabilidad en PublicAPI.txt. Esto atrae la atención a los cambios de nulabilidad de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Tous les types et membres publics doivent être déclarés avec des annotations de nullabilité dans PublicAPI.txt. Cela permet d'attirer l'attention sur les changements apportés à la nullabilité de l'API dans les revues de code et l'historique de contrôle de code source. Cela permet également d'éviter les changements cassants.
it: Tutti i tipi e i membri public devono essere dichiarati con annotazioni di supporto dei valori Null in PublicAPI.txt. In questo modo si richiama l'attenzione sulle modifiche del supporto dei valori Null all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e si contribuisce a evitare modifiche che causano un'interruzione.
ja: すべてのパブリックの型とメンバーは、NULL 許容の注釈を付けて、PublicAPI.txt で宣言する必要があります。これにより、コード レビューとソース管理履歴で API の NULL 許容の変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: 모든 public 형식 및 멤버는 PublicAPI.txt에서 Null 허용 여부 주석을 포함하여 선언되어야 합니다. 그러면 코드 검토 및 소스 제어 기록에서 API Null 허용 여부 변경 내용을 쉽게 확인할 수 있고 호환성이 손상되는 변경을 방지할 수 있습니다.
pl: Wszystkie publiczne typy i składowe powinny być zadeklarowane w pliku PublicAPI.txt z adnotacjami opcji dopuszczania wartości null. To przyciąga uwagę do zmian opcji dopuszczania wartości null interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym nieprawidłowe działanie.
pt_br: Todos os tipos e membros públicos devem ser declarados com anotações de nulidade no PublicAPI.txt. Isso chama a atenção para as alterações de nulidade da API no histórico de revisões de código e de controle do código-fonte e ajuda a evitar alterações interruptivas.
ru: Все открытые типы и элементы должны быть объявлены в PublicAPI.txt с заметками допустимости значений NULL. Это привлекает внимание к изменениям допустимости значений NULL в API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm genel türler ve üyeler PublicAPI.txt içinde null atanabilirlik ek açıklamalarıyla bildirilmelidir. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API null atanabilirlik değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 应在 PublicAPI.txt 中使用为 Null 性注释声明所有公共类型和成员。这将关注代码评审和源代码管理历史记录中的 API 为 Null 性更改，并有助于防止中断性变更。
zh_hant: 在 PublicAPI.txt 中宣告所有公用類型與成員時，應提供可 NULL 性註釋。此動作會引起對程式碼檢閱與原始檔控制記錄中 API 可 NULL 性變更的注意，有助於避免發生中斷性變更。

# AnnotatePublicApiMessage
source: Symbol '{0}' is missing nullability annotations in the declared API
cs: U symbolu {0} chybí v deklarovaném rozhraní API anotace o možnosti použití hodnoty null.
de: Für das Symbol "{0}" fehlen Anmerkungen zur NULL-Zulässigkeit in der deklarierten API.
es: El símbolo "{0}" no tiene anotaciones de nulabilidad en la API declarada.
fr: Il manque des annotations de nullabilité pour le symbole '{0}' dans l'API déclarée
it: Nel simbolo '{0}' mancano le annotazioni di supporto dei valori Null nell'API dichiarata
ja: シンボル '{0}' では、宣言された API に NULL 許容の注釈がありません
ko: 선언된 API에서 '{0}' 기호에 Null 허용 여부 주석이 없습니다.
pl: Symbol „{0}” nie ma adnotacji opcji dopuszczania wartości null w zadeklarowanym interfejsie API
pt_br: O símbolo '{0}' não tem anotações de nulidade na API declarada
ru: В объявленном API для символа "{0}" отсутствуют заметки о допустимости значений NULL.
tr: '{0}' sembolünde, bildirilen API'deki null atanabilirlik ek açıklamaları eksik
zh_hans: 符号“{0}”在声明的 API 中缺少为 Null 性注释
zh_hant: 在宣告的 API 中，符號 '{0}' 缺少可為 Null 的註釋

# AnnotatePublicApiTitle
source: Annotate nullability of public types and members in the declared API
cs: Přidat anotace o možnosti použití hodnoty null u veřejných typů a členů v deklarovaném rozhraní API
de: NULL-Zulässigkeit öffentlicher Typen und Member in der deklarierten API anmerken
es: Anotar la nulabilidad de los miembros y tipos públicos en la API declarada
fr: Annoter la nullabilité des types et des membres publics dans l'API déclarée
it: Annota il supporto dei valori Null di tipi e membri public nell'API dichiarata
ja: 宣言された API のパブリックの型とメンバーの NULL 許容に注釈を付ける
ko: 선언된 API에서 public 형식 및 멤버의 Null 허용 여부 주석 추가
pl: Dodawanie adnotacji opcji dopuszczania wartości null publicznych typów i składowych w zadeklarowanym interfejsie API
pt_br: Anotar a nulidade de tipos e membros públicos na API declarada
ru: Аннотирование допустимости значений NULL для открытых типов и элементов в объявленном API
tr: Bildirilen API'deki genel türlerin ve üyelerin null atanabilirliğine not ekle
zh_hans: 在声明的 API 中对公共类型和成员的为 Null 性进行批注
zh_hant: 標註已宣告 API 中公用類型和成員的可 NULL 性

# AvoidMultipleOverloadsWithOptionalParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Do not add multiple overloads with optional parameters'. See '{1}' for details.
cs: Symbol {0} porušuje požadavek na zpětnou kompatibilitu: Nepřidávat více přetížení s nepovinnými parametry. Podrobnosti najdete tady: {1}
de: Das Symbol "{0}" verletzt die backcompat-Anforderung: Nicht mehrere Überladungen mit optionalen Parametern hinzufügen. Details finden Sie unter "{1}".
es: El símbolo "{0}" infringe el requisito de compatibilidad con versiones anteriores: "No agregar varias sobrecargas con los parámetros opcionales". Consulte "{1}" para obtener más detalles.
fr: Le symbole '{0}' viole l'exigence de compatibilité descendante : 'Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels'. Pour plus d'informations, consultez '{1}'.
it: Il simbolo '{0}' viola il requisito di compatibilità con le versioni precedenti: 'Non aggiungere più overload public con parametri facoltativi'. Per dettagli, vedere '{1}'.
ja: シンボル '{0}' は下位互換性の要件、「省略可能なパラメーターを持つ複数のオーバーロードを追加しない」に違反しています。詳細は '{1}' を参照してください。
ko: '{0}' 기호가 backcompat 요구 사항인 '선택적 매개 변수가 있는 여러 오버로드를 추가하지 마세요.'를 위반합니다. 자세한 내용은 '{1}'을(를) 참조하세요.
pl: Symbol „{0}” narusza wymaganie wstecznej zgodności: „Nie dodawaj wielu przeciążeń z opcjonalnymi parametrami”. Zobacz „{1}”, aby uzyskać szczegółowe informacje.
pt_br: O símbolo '{0}' viola o requisito de backcompat: 'Não adicione várias sobrecargas com parâmetros opcionais'. Confira '{1}' para obter detalhes.
ru: Символ "{0}" нарушает требование обратной совместимости: "Не добавляйте несколько перегрузок с необязательными параметрами". Дополнительные сведения см. в "{1}" .
tr: '{0}' sembolü geriye dönük uyumluluk gereksinimini ihlal ediyor: 'İsteğe bağlı parametreleri olan birden fazla aşırı yükleme eklemeyin'. Ayrıntılar için bkz. '{1}'.
zh_hans: 符号“{0}”违反了 backcompat 要求:“请勿添加具有可选参数的多个重载”。有关详细信息，请参阅“{1}”。
zh_hant: 符號 '{0}' 違反回溯相容性需求:「請勿新增具備選擇性參數的多項多載」。請參閱 '{1}' 以取得詳細資料。

# AvoidMultipleOverloadsWithOptionalParametersTitle
source: Do not add multiple public overloads with optional parameters
cs: Nepřidávat více přetížení s nepovinnými parametry
de: Nicht mehrere Überladungen mit optionalen Parametern hinzufügen
es: No agregar varias sobrecargas públicas con los parámetros opcionales
fr: Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels
it: Non aggiungere più overload public con parametri facoltativi
ja: 省略可能なパラメーターを持つ複数のパブリック オーバーロードを追加しない
ko: 선택적 매개 변수가 있는 여러 공용 오버로드를 추가하지 마세요.
pl: Nie dodawaj wielu przeciążeń publicznych z opcjonalnymi parametrami
pt_br: Não adicione várias sobrecargas públicas com parâmetros opcionais
ru: Не добавляйте несколько общедоступных перегрузок с необязательными параметрами
tr: İsteğe bağlı parametreleri olan birden fazla genel aşırı yükleme eklemeyin
zh_hans: 请勿添加具有可选参数的多个公共重载
zh_hant: 無法新增多個具有選擇性參數的公用多載

# DeclareInternalApiDescription
source: All internal types and members should be declared in InternalAPI.txt. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny interní typy a členy by se měly deklarovat v souboru InternalAPI.txt. To přivádí pozornost ke změnám rozhraní API v revizích a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Alle internen Typen und Member müssen in InternalAPI.txt deklariert werden. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Code Reviews und im Quellcodeverwaltungsverlauf gelenkt, und Breaking Changes werden verhindert.
es: Todos los tipos y miembros internos deben declararse en PublicAPI.txt. Esto atrae la atención a los cambios de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Tous les types et membres internes doivent être déclarés dans InternalAPI.txt. Cela attire l’attention sur les modifications d’API dans les révisions de code et l’historique du contrôle de code source, et permet d’éviter les changements cassants.
it: Tutti i tipi e i membri interni devono essere dichiarati in InternalAPI.txt. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e contribuisce a evitare modifiche che causano un'interruzione.
ja: すべての内部の型とメンバーは、 InternalAPI.txt で宣言する必要があります。これにより、コード レビューとソース管理履歴で API 変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: 모든 내부 형식 및 구성원은 InternalAPI.txt에서 선언해야 합니다. 이로 인해 코드 검토 및 소스 제어 기록에서 API 변경 내용을 쉽게 확인할 수 있고 큰 변경을 방지할 수 있습니다.
pl: Wszystkie typy wewnętrzne i składowe powinny być zadeklarowane w pliku InternalAPI.txt. Zwraca to uwagę na zmiany interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym niezgodność.
pt_br: Todos os tipos e membros internos devem ser declarados em InternalAPI.txt. Isso chama a atenção para as alterações da API nas revisões de código e no histórico de controle do código-fonte e ajuda a evitar alterações significativas.
ru: Все внутренние типы и элементы должны быть объявлены в InternalAPI.txt.. Это привлекает внимание к изменениям API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm dahili türler ve üyeler InternalAPI.txt içinde tanımlanmalıdır. Bu, kod incelemelerindeki ve kaynak kontrol geçmişindeki API değişikliklerine dikkat çeker ve hataya neden olan değişiklikleri önlemeye yardımcı olur.
zh_hans: 应在 InternalAPI.txt 中声明所有内部类型和成员。这将关注代码评审和源代码管理历史记录中的 API 更改，并有助于防止重大更改。
zh_hant: 應在 InternalAPI.txt 中宣告所有內部類型與成員。這麼做會讓您注意到程式碼檢閱與原始檔控制歷程記錄中的 API 變更，同時有助於避免重大變更。

# DeclareInternalApiMessage
source: Symbol '{0}' is not part of the declared API
cs: Symbol {0} není součástí deklarovaného rozhraní API.
de: Das Symbol "{0}" ist nicht Teil der deklarierten API.
es: El símbolo "{0}" no forma parte de la API declarada.
fr: Le symbole '{0}' ne fait pas partie de l'API déclarée
it: Il simbolo '{0}' non fa parte dell'API dichiarata
ja: シンボル '{0}' は宣言された API の一部ではありません
ko: '{0}' 기호가 선언된 API에 포함되지 않습니다.
pl: Symbol „{0}” nie jest częścią zadeklarowanego interfejsu API
pt_br: O símbolo '{0}' não faz parte da API declarada
ru: Символ "{0}" не является частью объявленного API.
tr: '{0}' sembolü bildirilen API'nin bir parçası değil
zh_hans: 符号“{0}”不是已声明 API 的一部分
zh_hant: 符號 '{0}' 並非宣告 API 的一部分

# DeclareInternalApiTitle
source: Add internal types and members to the declared API
cs: Přidat interní typy a členy do deklarovaného rozhraní API
de: Interne Typen und Member der deklarierten API hinzufügen
es: Agregue miembros y tipos internos a la API declarada
fr: Ajouter des types et des membres internes à l’API déclarée
it: Aggiungere tipi e membri interni all'API dichiarata
ja: 宣言された API に内部の型とメンバーを追加する
ko: 선언된 API에 내부 형식 및 구성원 추가
pl: Dodaj publiczne typy i składowe do zadeklarowanego interfejsu API
pt_br: Adicionar tipos e membros internos à API declarada
ru: Добавить открытые типы и элементы в объявленный API
tr: Tanımlanan API'ye dahili türler ve üyeler ekleyin
zh_hans: 向已内部 API 添加公共类型和成员
zh_hant: 為宣告的 API 新增公用類型與成員

# DeclarePublicApiDescription
source: All public types and members should be declared in PublicAPI.txt. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny veřejné typy a členy by se měly deklarovat v souboru PublicAPI.txt. To přivádí pozornost ke změnám rozhraní API v revizích a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" deklariert werden. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Codeüberprüfungen und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
es: Todos los tipos y miembros públicos deben declararse en PublicAPI.txt. Esto atrae la atención a los cambios de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Tous les types et membres publics doivent être déclarés dans PublicAPI.txt. Cela permet d'attirer l'attention sur les changements apportés à l'API dans les revues de code et l'historique de contrôle de code source. Cela permet également d'éviter les changements cassants.
it: Tutti i tipi e i membri public devono essere dichiarati in PublicAPI.txt. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e contribuisce a evitare modifiche che causano un'interruzione.
ja: すべてのパブリックの型とメンバーは、PublicAPI.txt で宣言する必要があります。これにより、コード レビューとソース管理履歴で API 変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: 모든 public 형식 및 멤버는 PublicAPI.txt에서 선언해야 합니다. 이로 인해 코드 검토 및 소스 제어 기록에서 API 변경 내용을 쉽게 확인할 수 있고 큰 변경을 방지할 수 있습니다.
pl: Wszystkie publiczne typy i składowe powinny być zadeklarowane w pliku PublicAPI.txt. To przyciąga uwagę do zmian interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym nieprawidłowe działanie.
pt_br: Todos os tipos e membros públicos devem ser declarados no PublicAPI.txt. Isso chama a atenção para as alterações da API no histórico de revisões de código e de controle do código-fonte e ajuda a evitar alterações interruptivas.
ru: Все открытые типы и элементы должны быть объявлены в PublicAPI.txt. Это привлекает внимание к изменениям API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm genel türler ve üyeler PublicAPI.txt içinde bildirilmelidir. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 应在 PublicAPI.txt 中声明所有公共类型和成员。这将关注代码评审和源代码管理历史记录中的 API 更改，并有助于防止重大更改。
zh_hant: 應在 PublicAPI.txt 中宣告所有公用類型與成員。此舉會讓您注意到程式碼檢閱與原始檔控制歷程記錄中的 API 變更，同時有助於避免發生中斷性變更。
