Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/PublicApiAnalyzers/Core/Analyzers/xlf/PublicApiAnalyzerResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# OverloadWithOptionalParametersShouldHaveMostParametersTitle
source: API with optional parameter(s) should have the most parameters amongst its public overloads
cs: Rozhraní API s nepovinnými parametry by mělo mít ze všech veřejných přetížení nejvíce parametrů
de: Die API mit optionalen Parametern sollte die meisten Parameter bei den öffentlichen Überladungen aufweisen
es: La API con parámetros opcionales debe tener la mayoría de los parámetros entre sus sobrecargas públicas
fr: L’API avec des paramètres facultatifs doit avoir le plus de paramètres parmi ses surcharges publiques
it: L'API con parametri facoltativi deve includere la maggior parte dei parametri tra i relativi overload public
ja: 省略可能なパラメーターを持つ API は、そのパブリック オーバーロード内のほとんどのパラメーターを持つ必要がある
ko: 선택적 매개 변수가 있는 API에는 공개 오버로드 중에서 가장 많은 매개 변수가 있어야 합니다.
pl: Publiczny interfejs API z opcjonalnymi parametrami powinien mieć najwięcej parametrów spośród jego przeciążeń publicznych
pt_br: API com parâmetro(s) opcional deve ter o maior número de parâmetros entre suas sobrecargas públicas
ru: Большинство параметров открытого API с необязательными параметрами должны находиться среди его общедоступных перегрузок.
tr: İsteğe bağlı parametrelere sahip API, genel aşırı yüklemeleri arasında en fazla parametreye sahip olmalıdır
zh_hans: 具有可选参数的 API 应在其公共重载中具有最多参数
zh_hant: 具有選擇性參數的 API，大部分的參數應位於其公用多載之間

# PublicApiFileMissingMessage
source: Public API file '{0}' is missing or not marked as an additional analyzer file
cs: Soubor veřejného rozhraní API {0} chybí nebo není označený jako doplňkový soubor analyzátoru.
de: Die öffentliche API-Datei "{0}" fehlt oder ist nicht als zusätzliche Analysedatei gekennzeichnet.
es: El archivo de API pública "{0}" falta o no está marcado como archivo de analizador adicional.
fr: Le fichier d'API publique '{0}' est manquant ou n'est pas marqué en tant que fichier d'analyseur supplémentaire
it: Il file di API pubblica '{0}' manca o non è contrassegnato come file aggiuntivo dell'analizzatore
ja: パブリック API ファイル '{0}' が存在しないか、追加のアナライザー ファイルとしてマークされていません
ko: 퍼블릭 API 파일 '{0}'이(가) 없거나 추가 분석기 파일로 표시되지 않았습니다.
pl: Brak pliku publicznego interfejsu API „{0}” lub nie jest on oznaczony jako dodatkowy plik analizatora
pt_br: O arquivo de API pública '{0}' está ausente ou não está marcado como um arquivo do analisador adicional
ru: Файл общедоступного API "{0}" отсутствует или не помечен как дополнительный файл анализатора.
tr: '{0}' genel API dosyası eksik veya ek bir çözümleyici dosyası olarak işaretlenmemiş
zh_hans: 缺少公共 API 文件“{0}”，或者未将它标记为附加分析器文件
zh_hant: 遺失公用 API 檔案 '{0}'，或未將其標示為額外的分析器檔案

# PublicApiFileMissingTitle
source: Missing shipped or unshipped public API file
cs: Chybí vydaný nebo nevydaný soubor veřejného rozhraní API
de: Fehlende versandte oder nicht versandte öffentliche API-Datei
es: Falta un archivo de API pública enviado o con envío anulado
fr: Absence du fichier d'API publique fournie ou non fournie
it: File di API pubblica distribuito o non distribuito mancante
ja: 出荷済みまたは未出荷のパブリック API ファイルがありません
ko: 제공되거나 제공되지 않은 퍼블릭 API 파일이 없음
pl: Brak wysłanego lub niewysłanego pliku publicznego interfejsu API
pt_br: Arquivo de API pública enviado ou não enviado ausente
ru: Отсутствует отправленный или неотправленный файл общедоступного API
tr: Gönderilmiş veya gönderilmemiş genel API dosyası eksik
zh_hans: 缺少附带/未附带的公共 API 文件
zh_hant: 遺失隨附或未隨附的公用 API 檔案

# PublicApiFilesInvalidMessage
source: The contents of the public API files are invalid: {0}
cs: Obsah souborů veřejných rozhraní API není platný: {0}
de: Die Inhalte der öffentlichen API-Dateien sind ungültig: {0}
es: El contenido de los archivos de la API pública no es válido: {0}
fr: Le contenu des fichiers de l'API publique est non valide : {0}
it: Il contenuto dei file dell'API pubblica non è valido: {0}
ja: パブリック API ファイルのコンテンツが無効です: {0}
ko: 공용 API 파일의 콘텐츠가 유효하지 않습니다. {0}
pl: Zawartość plików publicznego interfejsu API jest nieprawidłowa: {0}
pt_br: O conteúdo dos arquivos da API pública é inválido: {0}
ru: Недопустимое содержимое файлов открытого API: {0}
tr: Genel API dosyalarının içerikleri geçersiz: {0}
zh_hans: 公共 API 文件的内容无效: {0}
zh_hant: 公用 API 檔案的內容無效: {0}

# PublicApiFilesInvalidTitle
source: The contents of the public API files are invalid
cs: Obsah souborů veřejných rozhraní API není platný
de: Inhalte der öffentlichen API-Dateien sind ungültig
es: El contenido de los archivos de la API pública no es válido
fr: Le contenu des fichiers de l'API publique est non valide
it: Il contenuto dei file dell'API pubblica non è valido
ja: パブリック API ファイルのコンテンツが無効です
ko: 공용 API 파일의 콘텐츠가 유효하지 않습니다.
pl: Zawartość plików publicznego interfejsu API jest nieprawidłowa
pt_br: O conteúdo dos arquivos da API pública é inválido
ru: Недопустимое содержимое файлов открытого API
tr: Genel API dosyalarının içerikleri geçersiz
zh_hans: 公共 API 文件的内容无效
zh_hant: 公用 API 檔案的內容無效

# RemoveDeletedInternalApiDescription
source: When removing a internal type or member, put that entry in InternalAPI.Unshipped.txt with '*REMOVED*' prefix. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Když se odebírá interní typ nebo člen, vložte tuto položku do souboru InternalAPI.Unshipped.txt s předponou *REMOVED*. To upozorňuje na změny rozhraní API v revizích kódu a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Wenn Sie einen internen Typ oder ein internes Member entfernen, fügen Sie diesen Eintrag in InternalAPI.Unshipped.txt mit dem Präfix „*REMOVED*“ ein. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Code Reviews und dem Quellcodeverwaltungsverlauf gelenkt,und Breaking Changes werden verhindert.
es: Al quitar un tipo o miembro público, coloque esa entrada en InternalAPI.Unshipped.txt con el prefijo "*REMOVED*". Esto atrae la atención a los cambios de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Lors de la suppression d’un type ou d’un membre interne, placez cette entrée dans InternalAPI.Unshipped.txt avec le préfixe '*REMOVED*'. Cela attire l’attention sur les modifications d’API dans les révisions de code et l’historique du contrôle de code source, et permet d’éviter les changements cassants.
it: Quando si rimuove un tipo o un membro interno, è necessario inserire questa voce in InternalAPI.Unshipped.txt con prefisso '*REMOVED*’. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia dei controlli del codice sorgente, e si contribuisce a evitare modifiche che causano un'interruzione.
ja: 内部の型またはメンバーを削除する際、その項目を InternalAPI.Unshipped.txt に '*REMOVED*' プレフィックスを付けて記入する必要があります。これにより、コード レビューとソース管理履歴で API の変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: 내부 형식 또는 구성원을 제거할 때 해당 항목을 InternalAPI.Unshipped.txt에 '*REMOVED*' 접두어를 추가합니다. 이는 코드 검토 및 소스 제어 기록의 API 변경 내용에 주의를 기울이고 주요 변경 내용을 방지하는 데 도움이 됩니다.
pl: W przypadku usunięcia typu wewnętrznego lub składowej należy usunąć także powiązany wpis w pliku PublicAPI.Unshipped.txt. z prefiksem ’*REMOVED*’. To przyciąga uwagę do zmian interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym nieprawidłowe działanie.
pt_br: Ao remover um tipo ou membro interno, coloque essa entrada em InternalAPI.Unshipped.txt com o prefixo '*REMOVED*'. Isso chama a atenção para as alterações da API nas revisões de código e no histórico de controle do código-fonte e ajuda a evitar alterações significativas.
ru: При удалении внутреннего типа или элемента поместите эту запись в файл InternalAPI.Unshipped.txt с префиксом "*REMOVED*". Это привлекает внимание к изменениям API в проверках кода и журнала управления версиями и помогает предотвратить критические изменения.
tr: Bir dahili türü veya üyeyi kaldırırken, o girişi '*REMOVED*' önekiyle InternalAPI.Unshipped.txt dosyasına koyun. Bu, kod incelemelerindeki ve kaynak denetimi geçmişindeki API değişikliklerine dikkat çeker ve değişikliklerin bozulmasını önlemeye yardımcı olur.
zh_hans: 删除内部类型或成员时，将其项输入 InternalAPI.Unshipped.txt 中，并附上前缀 "*REMOVED*"。这样能够在代码评审和源代码管理历史记录中引起对 API 更改的注意，有助于防止中断性更改。
zh_hant: 移除內部類型或成員時，請將該項目放在 InternalAPI.Unshipped.txt 中並包含 '*REMOVED*' 前置詞。這麼做會讓您注意到程式碼檢閱與原始檔控制歷程記錄中的 API 變更，同時有助於避免重大變更。

# RemoveDeletedInternalApiMessage
source: Symbol '{0}' is part of the declared internal API, but is either not internal or could not be found
cs: Symbol {0} je součástí deklarovaného interního rozhraní API, ale buď není vnitřní, nebo se ho nepovedlo najít.
de: Das Symbol „{0}“ ist Teil der deklarierten internen API, ist jedoch entweder nicht intern oder wurde nicht gefunden.
es: El símbolo "{0}" forma parte de la API interna declarada, pero no es interna o no se encontró.
fr: Le symbole '{0}' fait partie de l’API interne déclarée, mais n’est pas interne ou est introuvable
it: Il simbolo '{0}' fa parte dell'API interna dichiarata, ma non è interno oppure non è stato possibile trovarlo
ja: シンボル '{0}' は宣言された内部 API の一部ですが、内部ではないか、見つかりませんでした
ko: 기호 '{0}'은(는) 선언된 내부 API의 일부이지만 내부가 아니거나 찾을 수 없습니다.
pl: Symbol „{0}” jest częścią zadeklarowanego wewnętrznego interfejsu API, ale nie jest wewnętrzny lub nie można go znaleźć
pt_br: O símbolo '{0}' faz parte da API interna declarada, mas não é interno ou não foi encontrado
ru: Символ "{0}" является частью объявленного внутреннего API, но не является внутренним или не найден
tr: '{0}' sembolü tanımlanan dahili API'nin parçası, ancak dahili değil veya bulunamadı
zh_hans: 符号“{0}”是已声明内部 API 的一部分，但此符号不是内部符号或无法找到
zh_hant: 符號 '{0}' 是宣告的內部 API 的一部分，但可能非內部或找不到

# RemoveDeletedInternalApiTitle
source: Remove deleted types and members from the declared internal API
cs: Odebrat odstraněné typy a členy z deklarovaného interního rozhraní API
de: Gelöschte Typen und Member aus der deklarierten internen API entfernen
es: Quitar tipos y miembros eliminados de la API interna declarada
fr: Supprimer les types et membres supprimés de l’API interne déclarée
it: Rimuovere tipi e membri eliminati dall'API interna dichiarata
ja: 削除された型とメンバーを、宣言された内部 API から削除する
ko: 선언된 내부 API에서 삭제된 형식 및 구성원 제거
pl: Usuń skasowane typy i składowe ze zadeklarowanego wewnętrznego interfejsu API
pt_br: Remova tipos e membros excluídos da API interna declarada
ru: Удалить удаленные типы и элементы из объявленного API
tr: Silinen türleri ve üyeleri tanımlanan dahili API'den kaldırın
zh_hans: 从已声明内部 API 中删除已删除的类型和成员
zh_hant: 從宣告的內部 API 移除已刪除的類型和成員

# RemoveDeletedPublicApiDescription
source: When removing a public type or member, put that entry in PublicAPI.Unshipped.txt with '*REMOVED*' prefix. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Když se odebírá veřejný typ nebo člen, vložte tuto položku do souboru PublicAPI.Unshipped.txt s předponou *REMOVED*. To upozorňuje na změny rozhraní API v revizích kódu a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Wenn Sie einen öffentlichen Typ oder Member entfernen, fügen Sie diesen Eintrag in "PublicAPI.Unshipped.txt" mit dem Präfix "*REMOVED*" ein. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Codeüberprüfungen und dem Quellcodeverwaltungsverlauf gelenkt und trägt dazu bei, Breaking Changes zu verhindern.
es: Al quitar un tipo o miembro público, coloque esa entrada en PublicAPI.Unshipped.txt con el prefijo "*REMOVED*". Esto atrae la atención a los cambios de la API en las revisiones de código y el historial de control de código fuente; además, ayuda a evitar cambios importantes.
fr: Lorsque vous supprimez un type ou un membre public, placez cette entrée dans PublicAPI.Unshipped.txt avec le préfixe « *REMOVED* ». Cela permet d'attirer l'attention sur les modifications de l'API dans les revues de code et l'historique du contrôle de la source, et d'éviter les modifications de rupture.
it: Quando si rimuove un tipo o un membro pubblico, è necessario inserire questa voce in PublicAPI.Unshipped.txt con prefisso '*REMOVED*’. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia dei controlli del codice sorgente, e si contribuisce a evitare modifiche che causano un'interruzione.
ja: パブリックの型またはメンバーを削除する際、その項目を PublicAPI.Unshipped.txt に '*REMOVED*' プレフィックスを付けて記入する必要があります。これにより、コード レビューとソース管理履歴で API の変更に注意を引くことができ、破壊的変更を防ぐことができます。
ko: public 형식 및 멤버를 제거할 경우 해당 항목을 '*REMOVED*' 접두사를 사용해 PublicAPI.Unshipped.txt에 넣습니다. 이렇게 하면 코드 검토와 원본 제어 기록에서 API 변경 내용에 주의를 기울이게 하고, 호환성이 손상되는 변경을 방지할 수 있습니다.
pl: W przypadku usunięcia typu publicznego lub składowej należy usunąć także powiązany wpis w pliku PublicAPI.Unshipped.txt. z prefiksem ’*REMOVED*’. To przyciąga uwagę do zmian interfejsu API w przeglądach kodu i historii kontroli źródła oraz pomaga zapobiegać zmianom powodującym nieprawidłowe działanie.
pt_br: Ao remover um tipo ou membro público, coloque essa entrada em PublicAPI.Unshipped.txt com o prefixo '*REMOVED*'. Isso chama a atenção para as alterações da API nas revisões de código e no histórico de controle de origem e ajuda a evitar alterações significativas.
ru: При удалении открытого типа или элемента поместите эту запись в файл PublicAPI.Unshipped.txt с префиксом "*REMOVED*". Это привлечет внимание к изменениями API при проверке кода и в истории управления версиями, а также поможет предотвратить критические изменения.
tr: Bir genel türü veya üyeyi kaldırırken, bu girişi PublicAPI.Unshipped.txt dosyasına '*REMOVED*' önekiyle birlikte yerleştirin. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 删除公共类型或成员时，将其项输入 PublicAPI.Unshipped.txt 中，并附上前缀 "*REMOVED*"。这样能够在代码评审和源代码管理历史记录中引起对 API 更改的注意，有助于防止中断性更改。
zh_hant: 移除公用類型或成員時，請將該項目放在 PublicAPI.Unshipped.txt 中並包含 '*REMOVED*' 前置詞。如此會讓您注意到在程式碼檢閱以及原始檔控制歷程記錄中 API 的變更，同時有助於避免發生中斷性變更。

# RemoveDeletedPublicApiMessage
source: Symbol '{0}' is part of the declared API, but is either not public or could not be found
cs: Symbol {0} je součástí deklarovaného rozhraní API, ale buď není veřejný, nebo se ho nepovedlo najít.
de: Das Symbol "{0}" ist Teil der deklarierten API, aber entweder nicht öffentlich oder nicht auffindbar.
es: El símbolo "{0}" forma parte de la API declarada, pero no es pública o no se encontró.
fr: Le symbole '{0}' fait partie de l'API déclarée, mais il n'est pas public ou est introuvable
it: Il simbolo '{0}' fa parte dell'API dichiarata, ma non è public oppure non è stato possibile trovarlo
ja: シンボル '{0}' は宣言された API の一部ですが、パブリックではないか、見つかりませんでした
ko: '{0}' 기호가 선언된 API의 일부이지만, 공용이 아니거나 찾을 수 없습니다.
pl: Symbol „{0}” jest częścią zadeklarowanego interfejsu API, ale nie jest publiczny lub nie można go odnaleźć
pt_br: O símbolo '{0}' faz parte da API declarada, mas não é público ou não pôde ser encontrado
ru: Символ "{0}" является частью объявленного API, однако не является открытым либо не был найден
tr: '{0}' sembolü bildirilen API'nin parçası, ancak genel değil veya bulunamadı
zh_hans: 符号“{0}”是已声明 API 的一部分，但此符号不是公共符号或无法找到
zh_hant: 符號 '{0}' 是宣告 API 的一部分，但可能找不到或並非公用

# RemoveDeletedPublicApiTitle
source: Remove deleted types and members from the declared API
cs: Odebrat odstraněné typy a členy z deklarovaného rozhraní API
de: Gelöschte Typen und Member aus der deklarierten API entfernen
es: Quitar tipos y miembros eliminados de la API declarada
fr: Enlever les types et membres supprimés de l'API déclarée
it: Rimuovere tipi e membri eliminati dall'API dichiarata
ja: 削除された型とメンバーを、宣言された API から削除する
ko: 선언된 API에서 삭제된 형식 및 멤버 제거
pl: Usuń usunięte typy i składowe z zadeklarowanego interfejsu API
pt_br: Remova os tipos e membros excluídos da API declarada
ru: Удалите удаленные типы и элементы из объявленного API
tr: Silinen türleri ve üyeleri bildirilen API'den kaldırın
zh_hans: 从已声明 API 中删除已删除的类型和成员
zh_hant: 從宣告的 API 移除已刪除的類型與成員

# RemovedApiIsNotActuallyRemovedMessage
source: Symbol '{0}' is marked as removed but it isn't deleted in source code
cs: Symbol {0} se označil jako odebraný, ale neodstranil se ze zdrojového kódu.
de: Das Symbol ‚{0}‘ ist als entfernt markiert, wird jedoch im Quellcode nicht gelöscht.
es: El símbolo ' {0} ' está marcado como retirado, pero no se elimina en el código fuente
fr: Le symbole « {0} » est marqué comme supprimé, mais il n’est pas supprimé dans le code source
it: Il simbolo '{0}' è contrassegnato come rimosso, ma non è stato eliminato nel codice sorgente
ja: 記号 '{0}' が削除済みとしてマークされていますが、ソース コードでは削除されていません
ko: '{0}' 기호가 제거됨으로 표시되지만 소스 코드에서는 삭제되지 않습니다.
pl: Symbol „{0}” został oznaczony jako usunięty, ale nie jest usuwany w kodzie źródłowym
pt_br: Símbolo "{0}" está marcado como removido, mas não é excluído no código-fonte
ru: Символ "{0}" помечен как удаленный, но он не удален в исходном коде
tr: '{0}' sembolü kaldırıldı olarak işaretlenmiş ancak kaynak kodunda silinmemiş
zh_hans: 符号“{0}”标记为已删除，但未在源代码中删除
zh_hant: 符號 '{0}' 標記為已移除，但未在原始程式碼中刪除

# RemovedApiIsNotActuallyRemovedTitle
source: API is marked as removed but it exists in source code
cs: Rozhraní API se označilo jako odebrané, ale existuje ve zdrojovém kódu.
de: Die API ist als entfernt markiert, ist jedoch im Quellcode vorhanden.
es: La API se marcó como quitada, pero existe en el código fuente
fr: L’API est marquée comme supprimée, mais elle existe dans le code source
it: L'API è contrassegnata come rimossa, ma è presente nel codice sorgente
ja: API が削除済みとマークされているが、ソース コード内に存在する
ko: API가 제거된 것으로 표시되지만 소스 코드에 존재합니다.
pl: Publiczny interfejs API został oznaczony jako usunięty, ale istnieje w kodzie źródłowym
pt_br: A API está marcada como removida, mas existe no código-fonte
ru: API помечен как удаленный, но существует в исходном коде
tr: API kaldırıldı olarak işaretlendi ancak kaynak kodunda mevcut
zh_hans: API 标记为已删除，但它存在于源代码中
zh_hant: API 標記為已移除，但存在於原始程式碼中

# ShouldAnnotateInternalApiFilesDescription
source: InternalAPI.txt files should have `#nullable enable` to track nullability information, or this diagnostic should be suppressed. With nullability enabled, InternalAPI.txt records which types are nullable (suffix `?` on type) or non-nullable (suffix `!`). It also tracks any API that is still using an oblivious reference type (prefix `~` on line).
cs: Soubory InternalAPI.txt by měly mít #nullable enable, aby se sledovala informace o možné hodnotě null, nebo by se tato diagnostika měla potlačit. Když se možnost nastavit hodnotu null povolí, InternalAPI.txt bude uchovávat informace o tom, které typy bude možné nastavit na null (přípona typu ?) a které ne (přípona !). Kromě toho sleduje všechna rozhraní API, která stále používá typ odkazu, který se nepoužívá (předpona ~na řádku).
de: Für InternalAPI.txt-Dateien muss „#nullable enable“ festgelegt sein, um Informationen zur NULL-Zulässigkeit nachzuverfolgen. Andernfalls sollte diese Diagnose unterdrückt werden. Bei aktivierter NULL-Zulässigkeit zeichnet InternalAPI.txt auf, welche Typen Nullwerte zulassen (Suffix „?“ für den Typ) bzw. keine Nullwerte zulassen (Suffix „!“). Zudem werden alle APIs verfolgt, die noch immer einen nicht bewussten Verweistyp verwenden (Präfix „~“ in der Zeile).
es: Los archivos InternalAPI.txt deben tener "#nullable enable" para hacer un seguimiento de la información de nulabilidad, o bien se debe suprimir este diagnóstico. Con la nulabilidad habilitada, InternalAPI.txt registra los tipos que se pueden anular (sufijo "?" en el tipo) o que no se pueden anular (sufijo "!"). También realiza el seguimiento de cualquier API que aún use un tipo de referencia obvio (prefijo "~;" en la línea).
fr: Les fichiers InternalAPI.txt doivent avoir « #nullable activé » pour suivre les informations de nullabilité, ou ce diagnostic doit être supprimé. Une fois la possibilité de valeur Null activée, InternalAPI.txt enregistre les types qui sont nullables (suffixe « ? » sur le type) ou non Nullable (suffixe « ! »). Il effectue également le suivi de toute API qui utilise toujours un type référence obondant (préfixe « ~ » sur la ligne).
it: I file InternalAPI.txt devono includere `#nullable enable` per tenere traccia delle informazioni sul supporto dei valori Null, in caso contrario questa diagnostica deve essere eliminata. Se il supporto dei valori Null è abilitato, InternalAPI.txt registra i tipi nullable (suffisso `?` nel tipo) o non nullable (suffisso `!`). Tiene inoltre traccia di eventuali API che usano ancora un tipo riferimento senza annotazioni nullable (prefisso `~` nella riga).
ja: InternalAPI.txt ファイルでは、NULL 値の許容情報を追跡するために `#nullable enable` を指定する必要があります。指定されていない場合は、この診断を中止する必要があります。NULL 値の許容を有効にすると、InternalAPI.txt は、どの型が null 許容 (型にサフィックス `?` を含む) または null 非許容 (サフィックス '!') かを記録します。また、oblivious 参照型 (行にプレフィックス `~` を含む) を使用している API を追跡します。
ko: InternalAPI.txt 파일에는 Null 허용 여부 정보를 추적하기 위해 `#nullable enable`이 있어야 합니다. 그렇지 않으면 이 진단이 억제되어야 합니다. Null 허용 여부를 사용하도록 설정하면 InternalAPI.txt는 Null을 허용(형식의 접미사 `?`)하거나 null을 허용하지 않는(접미사 `!`) 형식을 기록합니다. 또한 여전히 인식 불가능한 참조 형식(접두사 `~` 온라인)을 사용하는 모든 API를 추적합니다.
pl: Pliki PublicAPI.txt powinny zawierać wartość „#nullable enable” na potrzeby śledzenia informacji o dopuszczaniu wartości null lub należy pominąć tę diagnostykę. W przypadku włączenia informacji o dopuszczaniu wartości null plik PublicAPI.txt rejestruje typy dopuszczające wartość null (sufiks „?” dla typu) i niedopuszczające wartości null (sufiks „!”). Śledzi on również wszelkie interfejsy API, które nadal korzystają z nieświadomego typu odwołania (prefiks „~007E;” w wierszu).
pt_br: Os arquivos InternalAPI.txt devem ter `#nullable enable` para rastrear informações de nulidade ou esse diagnóstico deve ser suprimido. Com a nulidade habilitada, InternalAPI.txt registra quais tipos são anuláveis ​​(sufixo `?` no tipo) ou não anuláveis ​​(sufixo `!`). Ele também rastreia qualquer API que ainda esteja usando um tipo de referência inconsciente (prefixo `~` on line).
ru: Для файлов InternalAPI.txt необходимо установить директиву "#nullable enable", чтобы отслеживать сведения о допустимости значений NULL или отключить этот параметр диагностики. Если значения NULL являются допустимыми, в файлах InternalAPI.txt записываются типы, допускающие значения NULL (суффикс "?" типа) или не допускают значения NULL (суффикс "!"). Также отслеживаются все API, в которых все еще используется ссылочный тип без заметок о допустимости значений NULL (префикс "~" в строке).
tr: InternalAPI.txt dosyalarında null atanabilirlik bilgilerini izlemek için `#nullable enable` bulunmalıdır veya bu tanılama gizlenmelidir. Null atanabilirlik etkin olduğunda InternalAPI.txt, null atanabilir (türde `?` soneki) veya null atanamaz (`!` soneki) türleri kaydeder. Ayrıca, hala bir habersiz başvuru türünü (satırda `~` ön eki) kullanan tüm API'leri de izler.
zh_hans: InternalAPI.txt 文件应具有 "#nullable enable" 以跟踪为 Null 性信息，或者应取消显示此诊断。如果启用了为 Null 性，则 InternalAPI.txt 会记录哪些类型可为 Null (类型上带后缀 "?")而哪些不可为 Null (带后缀 "!")。它还会跟踪所有仍在使用不带此信息的引用类型(行上带前缀 "~007E;")的 API。
zh_hant: InternalAPI.txt 檔案應該具備 `#nullable enable`，才能追蹤可為 NULL 的資訊，否則應隱藏此診斷。若啟用可為 NULL，InternalAPI.txt 便能記錄可為 Null (類型的尾碼為 `?`) 或不可為 Null (尾碼為 `!`) 的類型。其也會追蹤仍在使用無警示參考類型的任何 API (行的首碼為 `~`)。
