Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/PublicApiAnalyzers/Core/Analyzers/xlf/PublicApiAnalyzerResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DeclarePublicApiMessage
source: Symbol '{0}' is not part of the declared public API
cs: Symbol {0} není součástí deklarovaného veřejné rozhraní API.
de: Das Symbol „{0}“ ist nicht Teil der deklarierten öffentlichen API.
es: El símbolo "{0}" no forma parte de la API pública declarada.
fr: Le symbole '{0}' ne fait pas partie de l’API publique déclarée
it: Il simbolo '{0}' non fa parte dell'API pubblica dichiarata
ja: シンボル '{0}' は宣言されたパブリック API の一部ではありません
ko: 기호 '{0}'은(는) 선언된 공개 API의 일부가 아닙니다.
pl: Symbol „{0}” nie jest częścią zadeklarowanego publicznego interfejsu API
pt_br: O símbolo '{0}' não faz parte da API pública declarada
ru: Символ "{0}" не является частью объявленного общедоступного API.
tr: '{0}' sembolü, tanımlanan genel API'nin bir parçası değil
zh_hans: 符号“{0}”不是已声明公共 API 的一部分
zh_hant: 符號 '{0}' 並非宣告的公用 API 的一部分

# DeclarePublicApiTitle
source: Add public types and members to the declared API
cs: Přidat veřejné typy a členy do deklarovaného rozhraní API
de: Öffentliche Typen und Member der deklarierten API hinzufügen
es: Agregar miembros y tipos públicos a la API declarada
fr: Ajouter des types et membres publics à l'API déclarée
it: Aggiungere tipi e membri public all'API dichiarata
ja: 宣言された API にパブリックの型とメンバーを追加する
ko: 선언된 API에 공용 형식 및 멤버 추가
pl: Dodaj publiczne typy i składowe do zadeklarowanego interfejsu API
pt_br: Adicionar membros e tipos públicos à API declarada
ru: Добавьте открытые типы и элементы в объявленный API
tr: Genel türleri ve üyeleri bildirilen API'ye ekleyin
zh_hans: 向已声明 API 添加公共类型和成员
zh_hant: 為宣告的 API 新增公用類型與成員

# DuplicateSymbolsInInternalApiFilesMessage
source: The symbol '{0}' appears more than once in the internal API files
cs: Symbol {0} se v souborech interního rozhraní API vyskytuje více než jednou.
de: Das Symbol „{0}“ erscheint mehr als einmal in den internen API-Dateien
es: El símbolo "{0}" aparece más de una vez en los archivos internos de la API.
fr: Le symbole «{0}» apparaît plusieurs fois dans les fichiers d’API internes
it: Il simbolo '{0}' è presente più volte nei file dell'API interna
ja: シンボル '{0}' が、内部 API ファイルに複数含まれています
ko: 내부 API 파일에 '{0}' 기호가 두 번 이상 나타납니다.
pl: Symbol „{0}” występuje więcej niż raz w plikach wewnętrznego interfejsu API
pt_br: O símbolo '{0}' aparece mais de uma vez nos arquivos internos da API
ru: Символ "{0}" встречается больше одного раза в файлах внутреннего API.
tr: '{0}' sembolü, dahili API dosyalarında birden çok kez görünüyor
zh_hans: 符号“{0}”多次出现在内部 API 文件中
zh_hant: 內部 API 檔案中出現多次符號 '{0}'

# DuplicateSymbolsInInternalApiFilesTitle
source: Do not duplicate symbols in internal API files
cs: Neduplikovat symboly v souborech interního rozhraní API
de: Symbole in internen API-Dateien nicht duplizieren
es: No duplique símbolos en los archivos internos de la API
fr: Ne pas dupliquer les symboles dans les fichiers d’API internes
it: Non duplicare simboli nei file API interni
ja: 内部 API ファイル内でシンボルを重複させない
ko: 내부 API 파일에서 기호를 복제하지 마세요.
pl: Nie duplikuj symboli w plikach wewnętrznego interfejsu API
pt_br: Não duplique símbolos em arquivos de API internos
ru: Не дублировать символы во внутренних файлах API
tr: Sembolleri dahili API dosyalarında çoğaltmayın
zh_hans: 请勿在内部 API 文件中复制符号
zh_hant: 不要複製內部 API 檔案中的符號

# DuplicateSymbolsInPublicApiFilesMessage
source: The symbol '{0}' appears more than once in the public API files
cs: Symbol {0} se v souborech veřejného rozhraní API vyskytuje více než jednou.
de: Das Symbol "{0}" wird in den öffentlichen API-Dateien mehrmals aufgeführt.
es: El símbolo "{0}" aparece más de una vez en los archivos de la API pública.
fr: Le symbole '{0}' apparaît plusieurs fois dans les fichiers de l'API publique
it: Il simbolo '{0}' è presente più volte nei file dell'API pubblica
ja: シンボル '{0}' が、パブリック API ファイルに複数含まれています
ko: '{0}' 기호가 퍼블릭 API 파일에 두 번 이상 나타납니다.
pl: Symbol „{0}” występuje więcej niż raz w plikach publicznego interfejsu API
pt_br: O símbolo '{0}' aparece mais de uma vez nos arquivos da API pública
ru: Символ "{0}" встречается больше одного раза в файлах открытого API.
tr: '{0}' sembolü, genel API dosyalarında birden çok kez görünüyor
zh_hans: 符号“{0}”多次出现在公共 API 文件中
zh_hant: 公用 API 檔案中出現多次符號 '{0}'

# DuplicateSymbolsInPublicApiFilesTitle
source: Do not duplicate symbols in public API files
cs: Neduplikovat symboly v souborech veřejných rozhraní API
de: Symbole in öffentlichen API-Dateien nicht duplizieren
es: No duplicar símbolos en los archivos de la API pública
fr: Ne pas dupliquer les symboles dans les fichiers d'une API publique
it: Non duplicare simboli nei file dell'API pubblica
ja: パブリック API ファイル内でシンボルを重複させない
ko: 공용 API 파일에서 기호를 복제하지 마세요.
pl: Nie duplikuj symboli w plikach publicznego interfejsu API
pt_br: Não duplique símbolos em arquivos de API pública
ru: Не дублируйте символы в файлах открытого API
tr: Genel API dosyalarında sembolleri yinelemeyin
zh_hans: 请勿在公共 API 文件中复制符号
zh_hant: 請勿在公用 API 檔案中使用重複的符號

# EnableNullableInProjectToTheApiTitle
source: Enable nullability annotations in the API for project '{0}'
cs: Povolit anotace o možnosti použití hodnoty null v rozhraní API pro projekt {0}
de: Anmerkungen zur NULL-Zulässigkeit in der API für das Projekt „{0}“ aktivieren
es: Habilite las anotaciones de nulabilidad en la API para el proyecto "{0}"
fr: Activer les annotations de nullabilité dans l’API pour le projet «{0}»
it: Abilita le annotazioni di supporto dei valori Null nell'API per il progetto '{0}'
ja: プロジェクト '{0}' の API で、NULL 値許容の注釈を有効にする
ko: API에서 프로젝트 '{0}'에 Null 허용 여부 주석 사용
pl: Włącz adnotacje dopuszczające wartość null w interfejsie API dla projektu „{0}”
pt_br: Habilitar anotações de nulidade na API para o projeto '{0}'
ru: Включить заметки о допустимости значений NULL в API для проекта "{0}"
tr: '{0}' projesi için API'de null atanabilirlik ek açıklamalarını etkinleştir
zh_hans: 在项目“{0}”的 API 中启用为 Null 性注释
zh_hant: 啟用 API 中專案 '{0}' 的可 NULL 性註釋

# EnableNullableInTheSolutionToTheApiTitle
source: Enable nullability annotations in the API for the solution
cs: Povolit anotace o možnosti použití hodnoty null v rozhraní API pro řešení
de: Anmerkungen zur NULL-Zulässigkeit in der API für die Lösung aktivieren
es: Habilite las anotaciones de nulabilidad en la API para la solución
fr: Activer les annotations de nullabilité dans l’API pour la solution
it: Abilita le annotazioni di supporto dei valori Null nell'API per la soluzione
ja: ソリューションの API で、NULL 値許容の注釈を有効にする
ko: 솔루션에 대한 API에서 null 허용 여부 주석 사용
pl: Włącz adnotacje opcji dopuszczania wartości null w publicznym interfejsie API dla rozwiązania
pt_br: Ativar anotações de nulidade na API para a solução
ru: Включить аннотации, допускающие значение NULL, в API для решения.
tr: Çözüm için API'de geçersizlik ek açıklamalarını etkinleştirin
zh_hans: 在解决方案的 API 中启用为 Null 性注释
zh_hant: 啟用 API 中解決方案的可 NULL 性註釋

# ExposedNoninstantiableTypeMessage
source: Constructor makes its noninheritable base class inheritable, thereby exposing its protected members
cs: Konstruktor nastavuje základní třídu, ze které se nedá dědit, na třídu, ze které se dědit dá, čímž zpřístupňuje své chráněné členy.
de: Der Konstruktor legt die nicht vererbbare Basisklasse als vererbbar fest und macht damit deren geschützte Member verfügbar.
es: El constructor convierte su clase base no heredable en heredable, por lo que expone sus miembros protegidos.
fr: Le constructeur fait de sa classe de base non héritable une classe héritable, exposant ainsi ses membres protégés
it: Il costruttore rende ereditabile la relativa classe di base non ereditabile, esponendone in tal modo i membri protetti
ja: コンストラクターは、その継承不可能な基底クラスを継承可能にすることで、保護されたメンバーを公開します
ko: 생성자는 상속할 수 없는 기본 클래스를 상속할 수 있도록 만들어 보호된 멤버를 공개합니다.
pl: Konstruktor umożliwia dziedziczenie klasy podstawowej nieprzeznaczonej do dziedziczenia, tym samym ujawniając jej składowe chronione
pt_br: O construtor faz com que sua classe base não herdável seja herdável, expondo seus membros protegidos
ru: Конструктор делает свой ненаследуемый базовый класс наследуемым, ставя под угрозу его защищенные элементы.
tr: Oluşturucu, devralınamaz temel sınıfını devralınabilir hale getirir, böylece sınıfın korumalı üyelerini kullanıma sunar
zh_hans: 构造函数使其不可继承的基类变为可继承，从而暴露其受保护的成员
zh_hant: 建構函式會讓無法繼承的基底類別變成可繼承，進而會公開其受保護的成員

# ExposedNoninstantiableTypeTitle
source: Constructor make noninheritable base class inheritable
cs: Konstruktor činí z nedědičné základní třídy dědičnou.
de: Konstruktor macht nicht vererbbare Basisklasse vererbbar
es: El constructor convierte en heredable su clase base no heredable
fr: Le constructeur fait de la classe de base noninheritable une classe inheritable
it: Il costruttore rende ereditabile la classe di base non ereditabile
ja: コンストラクターにより、継承不可能な基底クラスが継承可能になります
ko: 생성자가 상속할 수 없는 기본 클래스를 상속할 수 있도록 만듭니다.
pl: Konstruktor umożliwia dziedziczenie klasy podstawowej nieprzeznaczonej do dziedziczenia
pt_br: O construtor transforma a classe base não herdável em herdável
ru: Конструктор делает ненаследуемый базовый класс наследуемым
tr: Oluşturucu, devralınamayan temel sınıfı devralınabilir hale getirir
zh_hans: 构造函数使不可继承的基类可以继承
zh_hant: 建構函式可將無法繼承的基底類別變成為可繼承

# ImplicitConstructorErrorMessageName
source: implicit constructor for '{0}'
cs: implicitní konstruktor pro {0}
de: Impliziter Konstruktor für "{0}"
es: constructor implícito para "{0}"
fr: constructeur implicite pour '{0}'
it: costruttore implicito per '{0}'
ja: '{0}' の暗黙的なコンストラクター
ko: '{0}'의 암시적 생성자
pl: niejawny konstruktor dla elementu „{0}”
pt_br: construtor implícito para '{0}'
ru: неявный конструктор для "{0}"
tr: '{0}' için örtük oluşturucu
zh_hans: “{0}”的隐式构造函数
zh_hant: '{0}' 的隱含建構函式

# ImplicitGetAccessor
source: implicit get-accessor for '{0}'
cs: implicitní přístupový objekt get pro {0}
de: Impliziter get-Accessor für "{0}"
es: descriptor de acceso get implícito para "{0}"
fr: accesseur get implicite pour '{0}'
it: funzione di accesso get implicita per '{0}'
ja: '{0}' の暗黙的な get アクセサー
ko: '{0}'의 암시적 get 접근자
pl: niejawna metoda dostępu get dla elementu „{0}”
pt_br: acessador get implícito para '{0}'
ru: неявный метод доступа get для "{0}"
tr: '{0}' için örtük get erişimcisi
zh_hans: “{0}”的隐式 get 访问器
zh_hant: '{0}' 的隱含 get 存取子

# ImplicitSetAccessor
source: implicit set-accessor for '{0}'
cs: implicitní přístupový objekt set pro {0}
de: Impliziter set-Accessor für "{0}"
es: descriptor de acceso set implícito para "{0}"
fr: accesseur set implicite pour '{0}'
it: funzione di accesso set implicita per '{0}'
ja: '{0}' の暗黙的な set アクセサー
ko: '{0}'의 암시적 set 접근자
pl: niejawna metoda dostępu set dla elementu „{0}”
pt_br: acessador set implícito para '{0}'
ru: неявный метод доступа set для "{0}"
tr: '{0}' için örtük set erişimcisi
zh_hans: “{0}”的隐式 set 访问器
zh_hant: '{0}' 的隱含 set 存取子

# InternalApiFileMissingMessage
source: Internal API file '{0}' is missing or not marked as an additional analyzer file
cs: Soubor interního rozhraní API {0} chybí nebo není označený jako doplňkový soubor analyzátoru.
de: Die interne API-Datei „{0}“ fehlt oder ist nicht als zusätzliche Analysetooldatei gekennzeichnet.
es: El archivo interno de la API "{0}" falta o no está marcado como archivo de analizador adicional.
fr: Le fichier d’API interne «{0}» est manquant ou n’est pas marqué comme fichier d’analyseur supplémentaire
it: Il file di API interna '{0}' manca o non è contrassegnato come file aggiuntivo dell'analizzatore
ja: 内部 API ファイル '{0}' が存在しないか、追加のアナライザー ファイルとしてマークされていません
ko: 내부 API 파일 '{0}'이(가) 누락되었거나 추가 분석기 파일로 표시되지 않았습니다.
pl: Brak pliku wewnętrznego interfejsu API „{0}” lub nie jest on oznaczony jako dodatkowy plik analizatora
pt_br: O arquivo de API interno '{0}' está ausente ou não está marcado como um arquivo de analisador adicional
ru: Файл внутреннего API "{0}" отсутствует или не помечен как дополнительный файл анализатора.
tr: '{0}' dahili API dosyası eksik veya ek bir çözümleyici dosyası olarak işaretlenmemiş
zh_hans: 缺少内部 API 文件“{0}”，或者未将它标记为附加分析器文件
zh_hant: 遺失內部 API 檔案 '{0}'，或未將其標示為額外的分析器檔案

# InternalApiFileMissingTitle
source: Missing shipped or unshipped internal API file
cs: Chybí vydaný nebo nevydaný soubor interního rozhraní API
de: Fehlende versandte oder nicht versandte interne API-Datei
es: Falta un archivo interno de la API pública enviado o con envío anulado
fr: Fichier d’API interne non expédié ou non expédié manquant
it: File di API interno distribuito o non distribuito mancante
ja: 出荷済みまたは未出荷の内部 API ファイルがない
ko: 배송되거나 배송되지 않은 내부 API 파일 누락
pl: Brak dostarczonego lub niewysłanego pliku wewnętrznego interfejsu API
pt_br: Arquivo de API interno enviado ou não enviado ausente
ru: Отсутствует отправленный или неотправленный файл общедоступного API
tr: Gönderilen veya gönderilmeyen dahili API dosyası eksik
zh_hans: 缺少附带/未附带的内部 API 文件
zh_hant: 遺失隨附或未隨附的內部 API 檔案

# InternalApiFilesInvalidMessage
source: The contents of the internal API files are invalid: {0}
cs: Obsah souborů interních rozhraní API není platný: {0}
de: Die Inhalte der internen API-Dateien sind ungültig: {0}
es: El contenido de los archivos internos de la API no es válido: {0}
fr: Le contenu des fichiers d’API internes n’est pas valide : {0}
it: Il contenuto dei file dell'API interna non è valido: {0}
ja: 内部 API ファイルのコンテンツが無効です: {0}
ko: 내부 API 파일의 내용이 잘못되었습니다. {0}
pl: Zawartość plików wewnętrznego interfejsu API jest nieprawidłowa: {0}
pt_br: O conteúdo dos arquivos internos da API é inválido: {0}
ru: Недопустимое содержимое внутренних файлов API: {0}
tr: Dahili API dosyalarının içerikleri geçersiz: {0}
zh_hans: 内部 API 文件的内容无效: {0}
zh_hant: 內部 API 檔案的內容無效: {0}

# InternalApiFilesInvalidTitle
source: The contents of the internal API files are invalid
cs: Obsah souborů interních rozhraní API není platný
de: Die Inhalte der internen API-Dateien sind ungültig
es: El contenido de los archivos internos de la API no es válido
fr: Le contenu des fichiers d’API internes n’est pas valide
it: Il contenuto dei file dell'API interna non è valido:
ja: 内部 API ファイルのコンテンツが無効
ko: 내부 API 파일의 내용이 잘못되었습니다.
pl: Zawartość plików wewnętrznego interfejsu API jest nieprawidłowa
pt_br: O conteúdo dos arquivos internos da API é inválido
ru: Недопустимое содержимое внутренних файлов API
tr: Dahili API dosyalarının içeriği geçersiz
zh_hans: 内部 API 文件的内容无效
zh_hant: 內部 API 檔案的內容無效

# ObliviousInternalApiDescription
source: All internal members should use either nullable or non-nullable reference types, but no oblivious reference types.
cs: Všechny interní členové by měly používat odkazové typy s možnou hodnotou null, nebo bez ní, ale ne odkazové typy bez určení možnosti použití hodnoty null.
de: Alle internen Member sollten Verweistypen verwenden, die Nullwerte zulassen oder nicht zulassen, aber keine nicht bewussten Verweistypen.
es: Todos los miembros públicos deben usar tipos de referencia que se puedan o no anular, pero no tipos de referencia inconscientes.
fr: Tous les membres internes doivent utiliser des types référence nullables ou non nullables, mais aucun type référence inconscient.
it: Tutti i membri interni devono usare tipi riferimento nullable o non nullable, ma non tipi riferimento oblivious.
ja: すべての内部メンバーは、Null 許容参照型と null 非許容参照型のいずれかを使用する必要がありますが、oblivious 参照型は使用しません。
ko: 모든 내부 구성원은 null을 허용하거나 null을 허용하지 않는 참조 형식을 사용해야 하지만, 인식 불가능한 참조 형식은 사용하면 안 됩니다.
pl: Wszystkie publiczne składowe powinny używać typów referencyjnych dopuszczających wartość null lub nie dopuszczających jej, ale nie nieświadomych typów referencyjnych.
pt_br: Todos os membros internos devem usar tipos de referência anuláveis ​​ou não anuláveis, mas nenhum tipo de referência inconsciente.
ru: Все внутренние элементы должны использовать ссылочные типы, допускающие или не допускающие значение NULL, но не игнорируемые ссылочные типы.
tr: Tüm dahili üyeler, null atanabilir veya null atanamaz başvuru türleri kullanmalı, ancak habersiz başvuru türleri kullanmamalıdır.
zh_hans: 所有内部成员都应使用可以为 null 或不可为 null 的引用类型，但不能使用未知引用类型。
zh_hant: 所有內部成員都應使用可為 Null 或不可為 Null 的參考類型，但不可使用無警示的參考類型。

# ObliviousInternalApiMessage
source: Symbol '{0}' uses some oblivious reference types
cs: Symbol {0} používá některé odkazové typy bez určení možnosti použití hodnoty null.
de: Das Symbol "{0}" verwendet einige nicht beachtende Verweistypen.
es: El símbolo "{0}" usa algunos tipos de referencia ajenos.
fr: Le symbole '{0}' utilise des types référence inconscients
it: Il simbolo '{0}' usa alcuni tipi di riferimento oblivious
ja: シンボル '{0}' ではいくつかの oblivious 参照型が使用されています
ko: '{0}' 기호는 일부 인식 불가능한 참조 형식을 사용합니다.
pl: Symbol „{0}” używa pewnych nieświadomych typów referencyjnych
pt_br: O símbolo '{0}' usa alguns tipos de referência vagos
ru: Символ "{0}" использует некоторые игнорируемые ссылочные типы.
tr: '{0}' sembolü uyarısız atanabilen bazı başvuru türlerini kullanıyor
zh_hans: 符号“{0}”使用了一些未知引用类型
zh_hant: 符號 '{0}' 使用了部分無必要的參考型別

# ObliviousInternalApiTitle
source: Internal members should not use oblivious types
cs: Interní členové by neměly používat typy bez určení možnosti použití hodnoty null
de: Interne Member dürfen keine nicht bewussten Typen verwenden.
es: Los miembros internos no deben usar tipos inconscientes
fr: Les membres internes ne doivent pas utiliser de types inconscients
it: I membri interni non devono usare tipi oblivious
ja: 内部メンバーによる oblivious 型の使用禁止
ko: 내부 구성원은 인식 불가능한 형식을 사용하면 안 됩니다.
pl: Publiczne składowe nie powinny używać typów obojętnych
pt_br: Membros internos não devem usar tipos alheios
ru: Внутренние элементы не должны использовать игнорируемые типы
tr: Dahili üyeler habersiz türleri kullanmamalıdır
zh_hans: 内部成员不得使用未知类型
zh_hant: 內部成員不應使用無警示的類型

# ObliviousPublicApiDescription
source: All public members should use either nullable or non-nullable reference types, but no oblivious reference types.
cs: Všechny veřejné členy by měly používat odkazové typy s možnou hodnotou null, nebo bez ní, ale ne odkazové typy bez určení možnosti použití hodnoty null.
de: Alle öffentlichen Member sollten Verweistypen, die NULL-Werte zulassen oder nicht zulassen, aber keine nicht beachtenden Verweistypen verwenden.
es: Todos los miembros públicos deben usar tipos de referencia que acepten o no valores NULL, pero no tipos de referencia inconscientes.
fr: Tous les membres publics doivent utiliser des types référence nullables ou non nullables, mais aucun type référence inconscient.
it: Tutti i membri pubblici devono usare tipi riferimento nullable o non nullable, ma non tipi riferimento oblivious.
ja: すべてのパブリック メンバーは、Null 許容参照型と null 非許容参照型のいずれかを使用する必要がありますが、oblivious 参照型は使用しません。
ko: 모든 public 멤버는 nullable 또는 nullable이 아닌 참조 형식을 사용해야 하지만, 인식 불가능한 참조 형식은 사용하면 안 됩니다.
pl: Wszystkie publiczne składowe powinny używać typów referencyjnych dopuszczających wartość null lub nie dopuszczających jej, ale nie nieświadomych typów referencyjnych.
pt_br: Todos os membros públicos devem usar tipos de referência que permitem valor nulo ou não anuláveis, mas nenhum tipo de referência inconsistente.
ru: Все открытые элементы должны использовать ссылочные типы, допускающие или не допускающие значение null, но не игнорируемые ссылочные типы.
tr: Tüm genel üyeler null atanabilir veya null atanamaz başvuru türleri kullanmalıdır ancak uyarısız atanabilen başvuru türü içermemelidir.
zh_hans: 所有公共成员都应使用可以为 null 或不可为 null 的引用类型，但不能使用未知引用类型。
zh_hant: 所有公開成員都應使用可為 Null 或不可為 Null 的參考型別，但不可使用無警示的參考型別。

# ObliviousPublicApiMessage
source: Symbol '{0}' uses some oblivious reference types
cs: Symbol {0} používá některé odkazové typy bez určení možnosti použití hodnoty null.
de: Das Symbol "{0}" verwendet einige nicht beachtende Verweistypen.
es: El símbolo "{0}" usa algunos tipos de referencia ajenos.
fr: Le symbole '{0}' utilise des types référence inconscients
it: Il simbolo '{0}' usa alcuni tipi di riferimento oblivious
ja: シンボル '{0}' ではいくつかの oblivious 参照型が使用されています
ko: '{0}' 기호는 일부 인식 불가능한 참조 형식을 사용합니다.
pl: Symbol „{0}” używa pewnych nieświadomych typów referencyjnych
pt_br: O símbolo '{0}' usa alguns tipos de referência vagos
ru: Символ "{0}" использует некоторые игнорируемые ссылочные типы.
tr: '{0}' sembolü uyarısız atanabilen bazı başvuru türlerini kullanıyor
zh_hans: 符号“{0}”使用了一些未知引用类型
zh_hant: 符號 '{0}' 使用了部分無必要的參考型別

# ObliviousPublicApiTitle
source: Public members should not use oblivious types
cs: Veřejné členy by neměly používat typy bez určení možnosti použití hodnoty null
de: Öffentliche Member dürfen keine nicht beachtenden Typen verwenden.
es: Los miembros públicos no deben usar tipos inconscientes
fr: Les membres publics ne doivent pas utiliser de types inconscients
it: I membri pubblici non devono usare tipi oblivious
ja: パブリック メンバーによる oblivious 型の使用禁止
ko: public 멤버는 인식 불가능한 형식을 사용하면 안 됨
pl: Publiczne składowe nie powinny używać typów nieświadomych
pt_br: Os membros públicos não devem usar tipos inconsistentes
ru: Открытые элементы не должны использовать игнорируемые типы
tr: Genel üyeler uyarısız atanabilen türler kullanmamalıdır
zh_hans: 公共成员不得使用未知类型
zh_hant: 公開成員不應使用無警示類型

# OverloadWithOptionalParametersShouldHaveMostParametersMessage
source: '{0}' violates the backcompat requirement: 'API with optional parameter(s) should have the most parameters amongst its public overloads'. See '{1}' for details.
cs: {0} porušuje požadavek na zpětnou kompatibilitu: Rozhraní API s nepovinnými parametry by mělo mít ze všech veřejných přetížení nejvíce parametrů. Podrobnosti najdete tady: {1}
de: „{0}“ verletzt die Anforderungen der Rückwärtskompatibilität: Die API mit optionalen Parametern sollte die meisten Parameter bei den öffentlichen Überladungen aufweisen. Details finden Sie unter „{1}“.
es: "{0}" infringe el requisito de compatibilidad con versiones anteriores: "La API con parámetros opcionales debe tener la mayoría de los parámetros entre sus sobrecargas públicas". Consulte "{1}" para conocer más detalles.
fr: «{0}» ne respecte pas l’exigence de compatibilité descendante : « L’API avec le ou les paramètres facultatifs doit avoir le plus de paramètres parmi ses surcharges publiques ». Pour plus d’informations, consultez «{1}».
it: '{0}' viola il requisito di compatibilità con le versioni precedenti: 'L'API con parametri facoltativi deve includere la maggior parte dei parametri tra i relativi overload public'. Per dettagli, vedere '{1}'.
ja: '{0}' は下位互換性の要件、「省略可能なパラメーターを持つ API は、そのパブリック オーバーロード内のほとんどのパラメーターを持つ必要がある」に違反しています。詳細は '{1}' を参照してください。
ko: '{0}'이(가) backcompat 요구 사항인 '선택적 매개 변수가 있는 API는 공용 오버로드 중 가장 많은 매개 변수를 보유해야 합니다'를 위반합니다. 자세한 내용은 '{1}'을(를) 참조하세요.
pl: „{0}” narusza wymaganie dotyczące zgodności z kopią zapasową: „Interfejs API z opcjonalnymi parametrami powinien mieć najwięcej parametrów spośród przeciążeń publicznych”. Aby uzyskać szczegółowe informacje, zobacz „{1}”.
pt_br: '{0}' viola o requisito de backcompat: 'API com parâmetro(s) opcional deve ter o maior número de parâmetros entre suas sobrecargas públicas'. Veja '{1}' para detalhes.
ru: "{0}" нарушает требование обратной совместимости: "большинство параметров открытого API с необязательными параметрами должны находиться среди его общедоступных перегрузок". Дополнительные сведения см. в "{1}".
tr: '{0}', geri uyumluluk gereksinimini ihlal ediyor: 'İsteğe bağlı parametre(ler) içeren API, genel aşırı yüklemeleri arasında en fazla parametreye sahip olmalıdır'. Ayrıntılar için '{1}' bölümüne bakın.
zh_hans: “{0}”违反了 backcompat 要求:“具有可选参数的 API 应在其公共重载中具有最多参数”。有关详细信息，请参阅“{1}”。
zh_hant: '{0}' 違反回溯相容性需求:「具有選擇性參數的 API，大部分的參數應位於其公用多載之間」。請參閱 '{1}' 以取得詳細資料。
