Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/CSharpVSResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

source: Add missing using directives on paste
cs: Při vložení přidat chybějící direktivy using
de: Beim Einfügen fehlende using-Anweisungen hinzufügen
fr: Ajouter les directives using manquantes au moment du collage
it: Aggiungi direttive using mancanti dopo operazione Incolla
pl: Dodaj brakujące dyrektywy using przy wklejaniu
pt_br: Adicionar as diretivas using ausentes ao colar
tr: Yapıştırırken eksik using yönergelerini ekle
zh_hant: 在貼上時新增缺少的 using 指示詞

source: Allow blank line after colon in constructor initializer
de: Leere Zeile nach Doppelpunkt in Konstruktorinitialisierer zulassen
fr: Autoriser une ligne vide après le signe des deux-points dans l'initialiseur du constructeur
pl: Zezwalaj na pusty wiersz po dwukropku w inicjatorze konstruktora
pt_br: Permitir uma linha em branco após os dois-pontos no inicializador do construtor
tr: Oluşturucu başlatıcıda iki noktadan sonra boş satıra izin ver

source: Allow blank line after token in arrow expression clause
de: Leere Zeile nach Token in Pfeilausdrucksklausel zulassen
fr: Autoriser une ligne vide après le jeton dans la clause d’expression fléchée
pl: Zezwalaj na pusty wiersz po tokenie w klauzuli wyrażenia strzałki
pt_br: Permitir linha em branco após o token na cláusula de expressão de seta
tr: Ok ifadesi yan tümcesinde belirteçten sonra boş satıra izin ver

source: Allow blank line after token in conditional expression
de: Leere Zeile nach Token im bedingten Ausdruck zulassen
fr: Autoriser une ligne vide après le jeton dans une expression conditionnelle
pl: Zezwalaj na pusty wiersz po tokenie w wyrażeniu warunkowym
pt_br: Permitir linha em branco após o token na expressão condicional
tr: Koşullu ifadede belirteçten sonra boş satıra izin ver

source: Allow blank lines between consecutive braces
cs: Povolit prázdné řádky mezi po sobě jdoucími závorkami
de: Leere Zeilen zwischen aufeinanderfolgenden geschweiften Klammern zulassen
fr: Autoriser les lignes vides entre les accolades consécutives
it: Consenti righe vuote tra parentesi graffe consecutive
pl: Zezwalaj na puste wiersze między kolejnymi nawiasami klamrowymi
pt_br: Permitir linhas em branco entre chaves consecutivas
tr: Ardışık küme ayraçları arasında boş satırlara izin ver
zh_hant: 允許在連續的大括弧之間使用空白行

source: Allow embedded statements on same line
cs: Povolit vložené příkazy na stejném řádku
de: Eingebettete Anweisungen in derselben Zeile zulassen
fr: Autoriser les instructions imbriquées sur la même ligne
it: Consenti istruzioni incorporate sulla stessa riga
pl: Zezwalaj na osadzone instrukcje w tym samym wierszu
pt_br: Permitir instruções inseridas na mesma linha
tr: Aynı satırda katıştırılmış ifadelere izin ver
zh_hant: 允許在同一行使用內嵌陳述式

# Apply_all_csharp_formatting_rules_indentation_wrapping_spacing
source: Apply all C# formatting rules (indentation, wrapping, spacing)
cs: Použít všechna formátovací pravidla jazyka C# (odsazení, zabalení, mezery)
de: Alle C#-Formatierungsregeln anwenden (Einzug, Umbruch, Abstand)
es: Aplicar todas las reglas de formato de C# (sangría, ajuste, espaciado)
it: Applica tutte le regole di formattazione di C# (rientro, ritorno a capo, spaziatura)
ko: 모든 C# 서식 규칙 적용(들여쓰기, 줄 바꿈, 간격 조정)
pt_br: Aplicar todas as regras de formatação de C# (recuo, quebra de linha, espaçamento)
zh_hans: 应用所有 C# 格式规则(缩进、换行、间隔)
zh_hant: 套用所有 C# 格式化規則 (縮排、換行、間距)

source: Automatically complete statement on semicolon
cs: Automaticky dokončit příkaz středníkem
de: Anweisung bei Semikolon automatisch abschließen
fr: Effectuer la complétion automatique de l'instruction après l'entrée d'un point-virgule
it: Completa automaticamente istruzione dopo punto e virgola
pl: Automatyczne uzupełniaj instrukcje po naciśnięciu średnika
pt_br: Concluir a instrução automaticamente no ponto e vírgula
tr: Deyimi noktalı virgülle otomatik olarak tamamla
zh_hant: 在遇到分號時自動完成陳述式

source: Automatically show completion list in argument lists
cs: Automaticky zobrazovat seznam dokončení v seznamech argumentů
de: Vervollständigungsliste in Argumentlisten automatisch anzeigen
fr: Afficher automatiquement la liste de complétion dans les listes d'arguments
it: Mostra automaticamente l'elenco di completamento negli elenchi di argomenti
pl: Automatycznie pokaż listę uzupełniania na listach argumentów
pt_br: Mostrar automaticamente a lista de conclusão nas listas de argumentos
tr: Bağımsız değişken listelerinde tamamlama listesini otomatik olarak göster
zh_hant: 自動在引數清單中顯示自動完成清單

source: Block scoped
cs: Obor bloku
de: Blockbereich
fr: Bloc inclus dans l'étendue
it: Con ambito blocco
pl: Blok objęty zakresem
pt_br: Escopo de bloco
tr: Blok kapsama alındı
zh_hant: 封鎖已設定範圍

source: Collapse usings on file open
de: Reduzieren von Usings beim Öffnen einer Datei
fr: Réduire les utilisations sur le fichier ouvert
pl: Zwiń użycia przy otwieraniu pliku
pt_br: Recolher os usos no arquivo aberto
tr: Dosya açıkken using'leri daralt

source: Completion
cs: Dokončení
de: Abschluss
fr: Complétion
it: Completamento
pl: Uzupełnianie
pt_br: Conclusão
tr: Tamamlama
zh_hant: 完成

source: Discard
cs: Proměnná typu discard
de: Ausschussvariable
es: Descartar
it: Variabile discard
ko: 폐기
pl: Odrzuć
pt_br: Descartar
tr: At
zh_hans: 放弃
zh_hant: 捨棄

source: Edit color scheme
cs: Upravit barevné schéma
de: Farbschema bearbeiten
fr: Modifier le modèle de couleurs
it: Modifica combinazione colori
pl: Edytuj schemat kolorów
pt_br: Editar o esquema de cores
tr: Renk düzenini düzenle
zh_hant: 編輯色彩配置

source: File scoped
cs: Obor souboru
de: Dateibereich
fr: Fichier inclus dans l'étendue
it: Con ambito file
pl: Plik objęty zakresem
pt_br: Escopo do arquivo
tr: Dosya kapsama alındı
zh_hant: 檔案已設定範圍

# Format_document_settings
source: Format Document Settings (Experiment)
cs: Nastavení formátování dokumentu (experiment)
de: Einstellungen zur Dokumentformatierung (experimentell)
es: Configuración de “Dar formato al documento” (experimento)
it: Impostazioni formattazione documento (sperimentale)
ko: 문서 서식 설정(실험)
pt_br: Formatar Configurações do Documento (Experimento)
zh_hans: 设定文档设置的格式(试验)
zh_hant: 格式化文件設定 (實驗)

source: General
cs: Obecné
de: Allgemein
fr: Général
it: Generale
ko: 일반
pl: Ogólne
pt_br: Geral
tr: Genel
zh_hans: 常规
zh_hant: 一般

# In_relational_binary_operators
source: In relational operators: < > <= >= is as == !=
cs: V relačních operátorech: < > <= >= is as == !=
de: In relationalen Operatoren: < > <= >= is as == !=
es: En los operadores relacionales: < > <= >= is as == !=
fr: Dans les opérateurs relationnels : < > <= >= is as == !=
it: In operatori relazionali: < > <= >= is as == !=
ko: 관계 연산자: < > <= >= is as == !=
pl: W operatorach relacyjnych: < > <= >= is as == !=
pt_br: Em operadores relacionais: < > <= >= is as == !=
tr: İlişkisel işleçleri içinde: <> = <> = == gibi! =
zh_hans: 在关系运算符中: < > <= >= 等同于 == !=
zh_hant: 在關係運算子中: < > <= >= 如同 == !=

# Insert_slash_slash_at_the_start_of_new_lines_when_writing_slash_slash_comments
source: Insert // at the start of new lines when writing // comments
cs: Při psaní komentářů // na začátek řádku vkládat //
de: Fügen Sie beim Schreiben von //-Kommentaren zwei Schrägstriche (//) am Anfang der neuen Zeilen ein.
fr: Insérer // au début des nouvelles lignes pour l'écriture de commentaires //
it: Inserisci * all'inizio di nuove righe quando si scrivono commenti //
pl: Wstaw znaki // na początku nowych wierszy podczas pisania komentarzy ze znakami //
pt_br: Inserir // no início de novas linhas ao escrever comentários de //
tr: // açıklamaları yazılırken yeni satırların başlangıcına // ekle
zh_hant: 撰寫 // 註解時，於新行開頭插入 //

source: Insert space between called method name and its opening parenthesis
de: Leerzeichen zwischen aufgerufenem Methodennamen und ihrer runden Klammer links einfügen
fr: Insérer un espace entre le nom de la méthode appelée et sa parenthèse ouvrante
pl: Wstaw spację między nazwą wywołanej metody a jej nawias otwierający
pt_br: Inserir espaço entre o nome do método chamado e seu parêntese de abertura
tr: Metodun adı ile açma ayracı arasına boşluk ekle

source: Insert space between method name and its opening parenthesis
de: Leerzeichen zwischen Methodenname und öffnender runder Klammer einfügen
fr: Insérer un espace entre le nom de la méthode et sa parenthèse ouvrante
pl: Wstaw spację między nazwę metody i jej nawias otwierający
pt_br: Inserir espaço entre o nome do método e o parêntese inicial
tr: Metot adı ile metodun açma ayracı arasına boşluk ekle

source: Inside namespace
cs: Uvnitř namespace
de: Innerhalb des Namespaces
es: namespace interior
fr: Dans le namespace
it: All'interno di namespace
ko: namespace 내부
pl: W elemencie namespace
pt_br: Namespace interno
tr: namespace içinde
zh_hans: 在命名空间中
zh_hant: 位於 namespace 內

source: Outside namespace
cs: Vně namespace
de: Außerhalb des Namespaces
es: namespace exterior
fr: Hors du namespace
it: All'esterno di namespace
ko: 외부 namespace
pl: Poza elementem namespace
pt_br: Namespace externo
tr: namespace dışında
zh_hans: 命名空间外
zh_hant: 位於 namespace 外

# Pattern_matching_preferences_colon
source: Pattern matching preferences:
cs: Předvolby porovnávání vzorů:
de: Einstellungen für den Musterabgleich:
fr: Préférences relatives aux critères spéciaux :
it: Preferenze per criteri di ricerca:
pl: Preferencje dopasowywania wzorca:
pt_br: Preferências de correspondência de padrões:
tr: Desen eşleştirme tercihleri:
zh_hant: 模式比對喜好設定:

source: Perform additional code cleanup during formatting
cs: Při formátování provést dodatečné vyčištění kódu
de: Zusätzliche Codebereinigung während der Formatierung durchführen
es: Realizar limpieza de código adicional durante la aplicación de formato
it: Esegui la pulizia del codice aggiuntiva durante la formattazione
ko: 서식을 지정하는 동안 추가 코드 정리 수행
pt_br: Executar limpeza de código adicional durante a formatação
zh_hans: 在格式设置期间执行其他代码清理
zh_hant: 在格式化期間執行額外程式碼清除

source: Place open brace on new line for object, collection, array, and with initializers
cs: Pro objekty, kolekce, pole a inicializátory with umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für Objekt-, Sammlungs-, Array- und with-Initialisierer in neue Zeile einfügen
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les initialiseurs d'objets, de collections, de tableaux et with
it: Inserisci parentesi graffa di apertura in una nuova riga per oggetto, raccolta, matrice e inizializzatori with
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla inicjatorów obiektów, kolekcji, tablic i with
pt_br: Colocar uma chave de abertura em uma nova linha para inicializadores de objeto, coleção, matriz e with
tr: Nesne, koleksiyon, dizi ve with başlatıcıları için açma küme ayracını yeni satıra yerleştir
zh_hant: 在物件、集合、陣列以及 with 初始設定式的新行上放上左大括弧

source: Prefer extended property pattern
cs: Upřednostňovat rozšířený vzor vlastností
de: Muster für erweiterte Eigenschaften bevorzugen
fr: Préférer le modèle de propriété étendue
it: Preferisci il modello di proprietà estesa
pl: Preferuj wzorzec właściwości rozszerzonej
pt_br: Prefere o padrão de propriedade estendida
tr: Genişletilmiş özellik desenini tercih et
zh_hant: 偏好擴充屬性模式

source: Prefer implicit object creation when type is apparent
cs: Upřednostňovat implicitní vytvoření objektu, pokud je typ zřejmý
de: Implizite Objekterstellung bevorzugen, wenn der Typ offensichtlich ist
fr: Préférer la création d'objets implicites quand le type est apparent
it: Preferisci la creazione implicita di oggetti quando il tipo è apparente
pl: Preferuj niejawne tworzenie obiektu, gdy typ jest oczywisty
pt_br: Preferir a criação de objeto implícito quando o tipo for aparente
tr: Tür görünür olduğunda örtük nesne oluşturmayı tercih et
zh_hant: 當類型為實際型態時，建議建立隱含物件

source: Prefer 'is null' for reference equality checks
cs: U kontrol rovnosti odkazů dávat přednost možnosti is null
de: "is null" für Verweisübereinstimmungsprüfungen vorziehen
es: Preferir “is null” para comprobaciones de igualdad de referencias
fr: Préférer 'is nul' pour les vérifications d'égalité de référence
it: Preferisci 'is null' per i controlli di uguaglianza dei riferimenti
ko: 참조 같음 검사에 대해 'is null' 선호
pl: Preferuj wyrażenie „is null” w przypadku sprawdzeń odwołań pod kątem równości
pt_br: Preferir 'is null' para as verificações de igualdade de referência
tr: Başvuru eşitliği denetimleri için 'is null'ı tercih et
zh_hans: 引用相等检查偏好 “is null”
zh_hant: 參考相等檢查最好使用 'is null'

source: Prefer 'null' check over type check
cs: Upřednostňovat kontrolu hodnoty null před kontrolou typu
de: "NULL"-Überprüfung vor Typüberprüfung bevorzugen
fr: Préférer la vérification « null » à la vérification de type
it: Preferisci il controllo 'null' al controllo del tipo
pl: Ustaw preferencje na sprawdzanie wartości „null” zamiast sprawdzania typu
pt_br: Preferir a verificação 'nula' à verificação de tipo
tr: Tür denetimi yerine 'null' denetimini tercih edin
zh_hant: 建議使用 'null' 檢查而非鍵入檢查

source: Prefer pattern matching
cs: Upřednostňovat porovnávání vzorů
de: Musterabgleich bevorzugen
fr: Préférer les critères spéciaux
it: Preferisci i criteri di ricerca
pl: Preferuj dopasowywanie do wzorca
pt_br: Preferir a correspondência de padrões
tr: Desen eşleştirmeyi tercih et
zh_hans: 首选模式匹配
zh_hant: 建議使用模式比對

source: Prefer pattern matching over mixed type check
cs: Upřednostňovat porovnávání vzorů nad kontrolou kombinovaných typů
de: Musterabgleich gegenüber der Überprüfung gemischter Typen bevorzugen
fr: Préférer les critères spéciaux à la vérification de type mixte
it: Preferisci criteri di ricerca al controllo dei tipi misti
pl: Preferuj sprawdzanie dopasowania wzorca do typów mieszanych
pt_br: Preferir a correspondência de padrões em vez da verificação de tipo misto
tr: Karışık tür denetimi yerine desen eşleştirmeyi tercih edin
zh_hant: 建議使用模式比對而非混合類型檢查

source: Prefer switch expression
cs: Preferovat výraz switch
de: Switch-Ausdruck bevorzugen
es: Preferir expresión switch
fr: Préférer l'expression switch
it: Preferisci espressione switch
ko: switch 식 선호
pl: Preferuj wyrażenie switch
pt_br: Preferir a expressão switch
tr: Switch ifadesini tercih et
zh_hans: 首选 switch 表达式
zh_hant: 建議使用 switch 運算式

source: Preferred 'using' directive placement
cs: Preferované umístění direktivy using
de: Bevorzugte Platzierung der using-Anweisung
es: Selección de ubicación de directiva "using" preferida
fr: Emplacement par défaut de la directive 'using'
it: Posizione preferita della direttiva 'using'
ko: 선호하는 'using' 지시문 배치
pl: Preferowane położenie dyrektywy „using”
pt_br: Posicionamento da diretiva 'using' preferencial
tr: Tercih edilen 'using' yönergesi yerleştirmesi
zh_hans: 首选 "using" 指令放置
zh_hant: 優先使用的 'using' 指示詞位置

source: Remove unnecessary usings
cs: Odebrat nepotřebné direktivy using
de: Nicht benötigte Using-Direktiven entfernen
es: Eliminar instrucciones Using innecesarias
fr: Supprimer les Usings inutiles
it: Rimuovi istruzioni using non necessarie
ko: 불필요한 Using 제거
pl: Usuń niepotrzebne użycia
pt_br: Remover Usos Desnecessários
tr: Gereksiz Kullanımları Kaldır
zh_hans: 删除不必要的 Using
zh_hant: 移除不必要的 Using

source: Show hints for 'new' expressions
cs: Zobrazit nápovědy pro výrazy new
de: Hinweise für new-Ausdrücke anzeigen
fr: Afficher les indicateurs pour les expressions 'new'
it: Mostra suggerimenti per le espressioni 'new'
pl: Pokaż wskazówki dla wyrażeń „new”
pt_br: Mostrar as dicas para as expressões 'new'
tr: 'new' ifadeleri için ipuçlarını göster
zh_hant: 顯示 'new' 運算式的提示

source: Show items from unimported namespaces
cs: Zobrazit položky z neimportovaných oborů názvů
de: Elemente aus nicht importierten Namespaces anzeigen
fr: Afficher les éléments des espaces de noms qui ne sont pas importés
it: Mostra elementi da spazi dei nomi non importati
pl: Pokaż elementy z nieimportowanych przestrzeni nazw
pt_br: Mostrar os itens de namespaces não importados
tr: İçeri aktarılmayan ad alanlarındaki öğeleri göster
zh_hant: 顯示來自未匯入命名空間的項目

source: Show new snippet experience (experimental)
de: Neue Ausschnittsoberfläche anzeigen (experimentell)
fr: Afficher une nouvelle expérience d’extrait de code (expérimental)
pl: Pokaż nowe środowisko fragmentu kodu (eksperymentalne)
pt_br: Mostrar nova experiência de snippet de código (experimental)
tr: Yeni kod parçacığı deneyimini göster (deneysel)

source: Show remarks in Quick Info
cs: Zobrazit poznámky v Rychlých informacích
de: Hinweise in QuickInfo anzeigen
es: Mostrar comentarios en Información rápida
fr: Afficher les notes dans Info express
it: Mostra i commenti in Informazioni rapide
pl: Pokaż uwagi w szybkich podpowiedziach
pt_br: Mostrar os comentários nas Informações Rápidas
tr: Hızlı Bilgi notlarını göster
zh_hans: 在快速信息中显示备注
zh_hant: 在快速諮詢中顯示備註

source: Sort usings
cs: Seřadit direktivy using
de: Using-Direktiven sortieren
es: Ordenar instrucciones Using
it: Ordina using
ko: Using 정렬
pt_br: Classificar usos
zh_hans: 对 using 排序
zh_hant: 排序 Using

# Suggest_usings_for_types_in_dotnet_framework_assemblies
source: Suggest usings for types in .NET Framework assemblies
cs: Navrhnout použití typů v sestaveních .NET Framework
de: Using-Anweisungen für Typen in .NET Framework-Assemblys vorschlagen
es: Sugerir usos para tipos en ensamblados .NET Framework
fr: Suggérer des using pour les types dans les assemblys .NET Framework
it: Suggerisci le direttive using per i tipi in assembly .NET Framework
ko: .NET Framework 어셈블리의 형식에 using 제안
pl: Sugeruj dyrektywy using dla typów w zestawach platformy .NET Framework
pt_br: Sugerir usings para tipos nos assemblies do .NET Framework
tr: .NET Framework bütünleştirilmiş kodlarında türler için using öner
zh_hans: 建议对 .NET Framework 程序集中的类型使用 using
zh_hant: 為 .NET Framework 組件中的類型建議 using

source: Surround With
cs: Obklopit s
de: Umschließen mit
es: Rodear con
fr: Entourer de
it: Racchiudi tra
ko: 코드 감싸기
pl: Otocz przez
pt_br: Envolver com
tr: Şununla Çevrele
zh_hans: 外侧代码
zh_hant: 範圍陳述式

source: Insert Snippet
cs: Vložit fragment
de: Schnipsel einfügen
es: Insertar fragmento de código
fr: Insérer un extrait
it: Inserisci frammento
ko: 조각 삽입
pl: Wstaw fragment kodu
pt_br: Inserir Snippet
tr: Kod Parçacığı Ekle
zh_hans: 插入片段
zh_hant: 插入程式碼片段

# Automatically_format_block_on_close_brace
source: Automatically format _block on }
cs: Automaticky formátovat _blok při znaku }
de: Beim Eingeben von } _Block automatisch formatieren
es: Dar formato automáticamente al _bloque al introducir }
fr: Mise en forme automatique du _bloc lors de la saisie d'une }
it: Formatta automaticamente _blocco dopo }
ko: } 입력 시 블록 서식 자동 지정(_B)
pl: Automatycznie formatuj _blok w pozycji znaku }
pt_br: Formatar automaticamente _bloco em }
tr: } girildiğinde _bloğu otomatik biçimlendir
zh_hans: 在 } 后自动格式化程序块(_B)
zh_hant: 於 } 處將區塊自動格式化(_B)

source: Automatically format on _paste
cs: Automaticky formátovat _při vložení ze schránky
de: Beim _Einfügen automatisch formatieren
es: Dar formato automáticamente al _pegar
fr: Mise en forme automati_que lors du collage
it: Formatta automaticamente dopo _operazione Incolla
ko: 붙여넣을 때 서식 자동 지정(_P)
pl: Automatycznie formatuj przy _wklejeniu
pt_br: Formatar automaticamente após _colar
tr: _Yapıştırırken otomatik olarak biçimlendir
zh_hans: 粘贴时自动设置格式(_P)
zh_hant: 貼上時自動格式化(_P)

# Automatically_format_statement_on_semicolon
source: Automatically format _statement on ;
cs: Automaticky formátovat _příkaz při znaku ;
de: Bei Eingabe von ; _Anweisung automatisch formatieren
es: Dar formato automáticamente _a la instrucción al introducir ;
fr: Mise en forme automatique de l'in_struction lors de la saisie d'un ;
it: Formatta automaticamente i_struzione dopo ;
ko: ; 입력 시 문 서식 자동 지정(_S)
pl: Automatycznie formatuj _instrukcję w pozycji znaku ;
pt_br: Formatar automaticamente _instrução em;
tr: ; girildiğinde _deyimi otomatik biçimlendir
zh_hans: 输入 ; 时自动设置语句格式(_S)
zh_hant: 於 ; 處將陳述式自動格式化(_S)

source: Place members in anonymous types on new line
cs: Umístit členy anonymních typů na nový řádek
de: Member in anonymen Typen in neue Zeile setzen
es: Colocar miembros en tipos anónimos en nueva línea
fr: Placer les membres dans les types anonymes sur une nouvelle ligne
it: Inserisci membri di tipi anonimi in una nuova riga
ko: 익명 형식의 멤버를 새 줄에 배치
pl: Umieść składowe typów anonimowych w nowym wierszu
pt_br: Colocar membros em tipos anônimos em nova linha
tr: Anonim türlerdeki üyeleri yeni satıra yerleştir
zh_hans: 将匿名类型中的成员置于新行
zh_hant: 將匿名類型的成員置於新行

source: Leave block on single line
cs: Nechat blok na jednom řádku
de: Block auf einzelner Zeile belassen
es: Mantener bloque en una sola línea
fr: Laisser un bloc sur une seule ligne
it: Lascia blocco su una sola riga
ko: 블록을 한 줄에 유지
pl: Pozostaw blok w pojedynczym wierszu
pt_br: Deixar bloco em uma linha única
tr: Bloğu tek satır olarak bırak
zh_hans: 将块保留在一行上
zh_hant: 讓區塊維持在同一行

source: Place "catch" on new line
cs: Umístit klíčové slovo catch na nový řádek
de: catch-Anweisung in neue Zeile setzen
es: Colocar "catch" en nueva línea
fr: Placer "catch" sur une nouvelle ligne
it: Inserisci "catch" in una nuova riga
ko: "catch"를 새 줄에 배치
pl: Umieść element „catch” w nowym wierszu
pt_br: Colocar "catch" em nova linha
tr: "catch" anahtar sözcüğünü yeni satıra yerleştir
zh_hans: 将“catch”置于新行
zh_hant: 將 "catch" 置於新行

source: Place "else" on new line
cs: Umístit klíčové slovo else na nový řádek
de: else-Anweisung in neue Zeile setzen
es: Colocar "else" en nueva línea
fr: Placer "else" sur une nouvelle ligne
it: Inserisci "else" in una nuova riga
ko: "else"를 새 줄에 배치
pl: Umieść element „else” w nowym wierszu
pt_br: Colocar "else" em nova linha
tr: "else" anahtar sözcüğünü yeni satıra yerleştir
zh_hans: 将“else”置于新行
zh_hant: 將 "else" 置於新行

source: Indent block contents
cs: Odsadit obsah bloku
de: Blockinhalte einziehen
es: Aplicar sangría al contenido del bloque
fr: Mettre en retrait le contenu d'un bloc
it: Rientra contenuto blocco
ko: 블록 내용 들여쓰기
pl: Wcięcie zawartości bloku
pt_br: Recuar conteúdo do bloco
tr: Blok içeriğini girintile
zh_hans: 缩进块内容
zh_hant: 縮排區塊內容

source: Indent open and close braces
cs: Odsadit levé a pravé složené závorky
de: Öffnende und schließende geschweifte Klammern einziehen
es: Aplicar sangría a llaves de apertura y cierre
fr: Mettre en retrait les accolades ouvrantes et fermantes
it: Rientra parentesi graffe di apertura e chiusura
ko: 여는 중괄호 및 닫는 중괄호 들여쓰기
pl: Wcięcie otwierających i zamykających nawiasów klamrowych
pt_br: Recuar chaves de abertura e fechamento
tr: Açma ve kapama küme ayraçlarını girintile
zh_hans: 缩进左大括号和右大括号
zh_hant: 縮排左括號及右括號

source: Indent case contents
cs: Odsadit obsah příkazu case
de: case-Inhalte einziehen
es: Aplicar sangría al contenido de case
fr: Mettre en retrait le contenu de case
it: Rientra contenuto case
ko: case 내용 들여쓰기
pl: Wcięcie zawartości elementu case
pt_br: Recuar conteúdo de case
tr: Case içeriğini girintile
zh_hans: 缩进 case 内容
zh_hant: 縮排 case 內容

source: Indent case labels
cs: Odsadit návěští case
de: case-Bezeichnungen einziehen
es: Aplicar sangría a etiquetas case
fr: Mettre en retrait des étiquettes case
it: Rientra etichette case
ko: case 레이블 들여쓰기
pl: Wcięcie etykiet elementu case
pt_br: Recuar rótulos case
tr: Case etiketlerini girintile
zh_hans: 缩进 case 标签
zh_hant: 縮排 case 標籤

source: Place "finally" on new line
cs: Umístit klíčové slovo finally na nový řádek
de: finally-Anweisung in neue Zeile setzen
es: Colocar "finally" en nueva línea
fr: Placer "finally" sur une nouvelle ligne
it: Inserisci "finally" in una nuova riga
ko: "finally"를 새 줄에 배치
pl: Umieść element „finally” w nowym wierszu
pt_br: Colocar "finally" em nova linha
tr: "finally" anahtar sözcüğünü yeni satıra yerleştir
zh_hans: 将“finally”置于新行
zh_hant: 將 "finally" 置於新行
