Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/CSharpVSResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

source: _Only add new line on enter after end of fully typed word
cs: _Při stisku Enter přidat nový řádek jenom po dopsání celého slova
de: Neue _Zeile beim Drücken der EINGABETASTE nur nach einem vollständig eingegebenen Wort einfügen
es: _Agregar solo una nueva línea con Entrar al final de palabras
fr: Aj_outer uniquement une nouvelle ligne après Entrée à la fin d'un mot complet tapé
it: Aggi_ungi una nuova riga dopo INVIO alla fine della parola digitata
ko: 단어를 모두 입력한 후 <Enter> 키를 누르면 새 줄 추가(_O)
pl: _Dodaj nowy wiersz po naciśnięciu klawisza Enter tylko po zakończeniu pełnego wpisanego wyrazu
pt_br: _Só adicionar nova linha ao inserir depois do final de uma palavra totalmente digitada
tr: _Enter tuşuna basıldığında yalnızca tam bir kelime yazılmışsa sonuna yeni satır ekle
zh_hans: _只有在完整键入的单词结尾后按下回车键时才添加新行
zh_hant: 僅在完整輸入的字結尾處按 Enter 鍵時加入新行(_O)

source: _Always add new line on enter
cs: _Při stisku Enter vždy přidat nový řádek
de: _Immer neue Zeile beim Drücken der EINGABETASTE einfügen
es: _Agregar siempre una nueva línea al presionar Entrar
fr: Toujours _ajouter une nouvelle ligne après Entrée
it: _Aggiungi sempre una nuova riga dopo INVIO
ko: <Enter> 키를 누르면 항상 새 줄 추가(_A)
pl: _Zawsze dodawaj nowy wiersz po naciśnięciu klawisza Enter
pt_br: _Sempre adicionar nova linha ao inserir
tr: _Enter tuşuna basıldığında her zaman yeni satır ekle
zh_hans: 按下 Enter 时始终添加新行(_A)
zh_hant: 一律在按下 Enter 鍵時加入新行(_A)

source: _Never add new line on enter
cs: _Při stisku Enter nikdy nepřidávat nový řádek
de: _Nie neue Zeile beim Drücken der EINGABETASTE einfügen
es: _No agregar nunca una nueva línea al presionar Entrar
fr: _Ne jamais ajouter de nouvelle ligne après Entrée
it: _Non aggiungere mai una nuova riga dopo INVIO
ko: <Enter> 키를 누르면 새 줄 추가 안 함(_N)
pl: _Nigdy nie dodawaj nowego wiersza po naciśnięciu klawisza Enter
pt_br: _Nunca adicionar nova linha ao inserir
tr: Enter tuşuna basıldığında _hiçbir zaman yeni satır ekleme
zh_hans: 按下 Enter 时不添加新行(_N)
zh_hant: 永不在按下 Enter 鍵時加入新行(_N)

source: Always include snippets
cs: Vždy zahrnovat fragmenty
de: Schnipsel immer einschließen
es: Incluir siempre fragmentos de código
fr: Toujours inclure les extraits de code
it: Includi sempre i frammenti
ko: 코드 조각 항상 포함
pl: Zawsze dołączaj fragmenty kodu
pt_br: Sempre incluir snippets
tr: Kod parçacıklarını her zaman dahil et
zh_hans: 始终包含片段
zh_hant: 一律包含程式碼片段

source: Include snippets when ?-Tab is typed after an identifier
cs: Zahrnovat fragmenty po zadání ?-Tab za identifikátor
de: Schnipsel einschließen, wenn ?-TAB nach einem Bezeichner eingegeben wird
es: Incluir fragmentos de código cuando ?-Tab se escriba después de un identificador
fr: Inclure les extraits de code quand ?-Tab est typé après un identificateur
it: Includi i frammenti quando si digita ?+TAB dopo un identificatore
ko: 식별자 뒤에 ?-Tab을 입력하면 코드 조각 포함
pl: Dołącz fragmenty kodu po wpisaniu znaku ? po identyfikatorze i naciśnięciu klawisza Tab
pt_br: Incluir snippets quando ?-Tab for digitado após um identificador
tr: Bir tanımlayıcıdan sonra ?-Tab yazılırsa kod parçacıklarını dahil et
zh_hans: 在标识符后键入 ?-Tab 时包含片段
zh_hant: 在識別碼後輸入 ?-Tab 時包含程式碼片段

source: Never include snippets
cs: Nikdy nezahrnovat fragmenty
de: Schnipsel nie einschließen
es: No incluir nunca fragmentos de código
fr: Ne jamais inclure d'extrait de code
it: Non includere mai i frammenti
ko: 코드 조각 포함 안 함
pl: Nigdy nie dołączaj fragmentów kodu
pt_br: Nunca incluir snippets
tr: Kod parçacıklarını hiçbir zaman dahil etme
zh_hans: 从不包含片段
zh_hant: 一律不包含程式碼片段

source: Snippets behavior
cs: Chování fragmentů
de: Schnipselverhalten
es: Comportamiento de los fragmentos de código
fr: Comportement des extraits de code
it: Comportamento dei frammenti
ko: 코드 조각 동작
pl: Zachowanie fragmentów kodu
pt_br: Comportamento de snippets
tr: Kod parçacığı davranışı
zh_hans: 片段行为
zh_hant: 程式碼片段行為

source: Show completion list after a character is _deleted
cs: _Zobrazit seznam dokončení po odstranění znaku
de: Vervollstän_digungsliste nach Löschen eines Zeichens anzeigen
es: Mostrar lista de finalización después de _eliminar un carácter
fr: Afficher la liste de saisie semi-automatique après la suppression d'un _caractère
it: Mostra _elenco di completamento dopo l'eliminazione di un carattere
ko: 문자를 삭제하면 완성 목록 표시(_D)
pl: Pokaż listę _uzupełniania po usunięciu znaku
pt_br: Mostrar lista de conclusão após um caractere ser _excluído
tr: Bir karakter _silindikten sonra tamamlanma listesini göster
zh_hans: 删除字符后显示完成列表(_D)
zh_hant: 刪除一個字元後顯示完成清單(_D)

# null_checking_colon
source: 'null' checking:
cs: 'Kontrola hodnoty null:
de: 'NULL-Überprüfung:
es: 'Comprobación de "null":
fr: 'vérification de valeur 'null' :
it: 'Controllo 'null':
ko: 'null' 확인:
pl: 'sprawdzanie wartości „null”:
pt_br: 'verificação 'null':
tr: 'null' denetleniyor:
zh_hans: '"null" 检查:
zh_hant: 'null' 檢查:

source: Prefer throw-expression
cs: Preferovat výraz throw
de: throw-Ausdruck bevorzugen
es: Preferir expresión throw
fr: Préférer l'expression throw
it: Preferisci l'espressione throw
ko: throw 식 기본 사용
pl: Preferuj wyrażenie throw
pt_br: Preferir expressão throw
tr: Throw ifadesini tercih et
zh_hans: 更喜欢 throw 表达式
zh_hant: 建議使用 throw 運算式

source: Prefer conditional delegate call
cs: Preferovat podmíněné delegované volání
de: Bedingten Delegataufruf bevorzugen
es: Preferir llamada de delegado condicional
fr: Préférer l'appel de délégué conditionnel
it: Preferisci la chiamata al delegato condizionale
ko: 조건부 대리자 호출 기본 사용
pl: Preferuj warunkowe wywołanie delegowane
pt_br: Preferir chamada de representante condicional
tr: Koşullu temsilci aramasını tercih et
zh_hans: 更喜欢有条件的委托调用
zh_hant: 建議使用條件式委派呼叫

source: Prefer pattern matching over 'is' with 'cast' check
cs: Preferovat porovnávání vzorů přes prvek is s kontrolou hodnot cast
de: Bei der cast-Überprüfung Musterabgleich gegenüber "is" bevorzugen
es: Preferir coincidencia de patrones en lugar de "is" con comprobación de "cast"
fr: Préférer les critères spéciaux à 'is' avec le contrôle de 'cast'
it: Preferisci criteri di ricerca a 'is' con controllo 'cast'
ko: 캐스트' 검사에서 'is'보다 패턴 일치 기본 사용
pl: Preferuj dopasowywanie wzorców względem klauzuli „Is” podczas sprawdzania „cast”
pt_br: Preferir a correspondência de padrões 'is' com a seleção 'cast'
tr: 'cast' ile 'is' denetimi yerine desen eşleştirme kullan
zh_hans: 使用 "cast" 检查时首选模式匹配而不是 "is"
zh_hant: 建議使用 'cast' 檢查對 'is' 進行模式比對

source: Prefer pattern matching over 'as' with 'null' check
cs: Preferovat porovnávání vzorů přes prvek as s kontrolou hodnot null
de: Bei der NULL-Überprüfung Musterabgleich gegenüber "as" bevorzugen
es: Preferir coincidencia de patrones en lugar de "as" con comprobación de "null"
fr: Préférer les critères spéciaux à 'as' avec le contrôle de 'null'
it: Preferisci criteri di ricerca a 'as' con controllo 'null'
ko: null' 검사에서 'as'보다 패턴 일치 기본 사용
pl: Preferuj dopasowywanie wzorców względem klauzuli „As” podczas testu na obecność wartości „null”
pt_br: Preferir a correspondência de padrões 'as' com a seleção 'null'
tr: 'null' ile 'as' denetimi yerine desen eşleştirme kullan
zh_hans: 使用 "null" 检查时首选模式匹配而不是 "as"
zh_hant: 建議使用 'null' 檢查對 'as' 進行模式比對

source: Prefer block body
cs: Dávat přednost textu bloku
de: Blocktextkörper bevorzugen
es: Preferir cuerpo del bloque
it: Preferisci corpo del blocco
ko: 블록 본문 기본 사용
pt_br: Preferir o corpo do bloco
zh_hans: 选择程序块主体
zh_hant: 偏好區塊主體

source: Prefer expression body
cs: Dávat přednost textu výrazu
de: Ausdruckskörper bevorzugen
es: Preferir cuerpo de expresiones
it: Preferisci corpo dell'espressione
ko: 식 본문 기본 사용
pt_br: Preferir o corpo da expressão
zh_hans: 选择表达式主体
zh_hant: 偏好運算式主體

source: Automatically format on return
cs: Automaticky formátovat při stisknutí klávesy Enter
de: Bei Verwendung der EINGABETASTE automatisch formatieren
es: Dar formato automáticamente al volver
fr: Mise en forme automatique au retour
it: Formatta automaticamente dopo INVIO
ko: 반환할 때 서식 자동 지정
pl: Formatuj automatycznie po przejściu do nowego wiersza
pt_br: Formatar automaticamente no retorno
tr: Return tuşuna basıldığında otomatik biçimlendir
zh_hans: 返回时自动格式化
zh_hant: 在傳回時自動格式化

source: Automatically format when typing
cs: Automaticky formátovat při psaní
de: Automatisch während der Eingabe formatieren
es: Dar formato automáticamente al escribir
fr: Mise en forme automatique en cours de frappe
it: Formatta automaticamente durante la digitazione
ko: 입력할 때 서식 자동 지정
pl: Formatuj automatycznie podczas pisania
pt_br: Formatar automaticamente ao digitar
tr: Yazarken otomatik biçimlendir
zh_hans: 键入时自动格式化
zh_hant: 於輸入時自動格式化

source: Never
cs: Nikdy
de: Nie
es: Nunca
fr: Jamais
it: Mai
ko: 안 함
pl: Nigdy
pt_br: Nunca
tr: Hiçbir zaman
zh_hans: 从不
zh_hant: 永不

source: When on single line
cs: Pokud je na jednom řádku
de: In einzelner Zeile
es: Cuando esté en una sola línea
fr: Sur une seule ligne
it: Se su riga singola
ko: 한 줄에 있는 경우
pl: W pojedynczym wierszu
pt_br: Quando em linha única
tr: Tek satırdayken
zh_hans: 处于单行上时
zh_hant: 在單行上時

source: When possible
cs: Pokud je to možné
de: Wenn möglich
es: Cuando sea posible
fr: Quand cela est possible
it: Quando possibile
ko: 가능한 경우
pl: Gdy jest to możliwe
pt_br: Quando possível
tr: Mümkün olduğunda
zh_hans: 在可能的情况下
zh_hant: 在可行的情況下

source: Indent case contents (when block)
cs: Odsazovat obsah příkazu case (když je v bloku)
de: Case-Inhalte einziehen (bei Block)
es: Aplicar sangría al contenido de case (cuando esté bloqueado)
fr: Mettre en retrait le contenu de case (dans un bloc)
it: Imposta rientro per contenuto case (quando è un blocco)
ko: case 내용 들여쓰기(블록)
pl: Wcięcie zawartości elementu case (w przypadku bloku)
pt_br: Recuar conteúdo de caso (quando bloquear)
tr: Case içeriklerini girintile (engelliyken)
zh_hans: 缩进 case 内容(阻止时)
zh_hant: 縮排 case 內容 (當封鎖時)

source: Fade out unused usings
cs: Zesvětlit nepoužité direktivy using
de: Nicht verwendete Using-Anweisungen ausblenden
es: Atenuar directivas using no usadas
fr: Supprimer les instructions using inutilisées
it: Applica dissolvenza a direttive using non usate
ko: 사용하지 않는 using 페이드 아웃
pl: Zanikanie nieużywanych dyrektyw using
pt_br: Esmaecer usos não utilizados
tr: Etkin olmayan kullanımları soluklaştır
zh_hans: 淡出未使用的 using
zh_hant: 淡出未使用的 Using

# Report_invalid_placeholders_in_string_dot_format_calls
source: Report invalid placeholders in 'string.Format' calls
cs: Oznamovat neplatné zástupné symboly ve voláních „String.Format“
de: Ungültige Platzhalter in String.Format-Aufrufen melden
es: Informar sobre marcadores de posición no válidos en llamadas a "String.Format"
fr: Signaler les espaces réservés non valides dans les appels de 'String.Format'
it: Segnala segnaposto non validi in chiamate 'String.Format'
ko: String.Format' 호출에서 잘못된 자리 표시자 보고
pl: Zgłaszaj nieprawidłowe symbole zastępcze w wywołaniach metody „String.Format”
pt_br: Relatar espaços reservados inválidos em chamadas 'String.Format'
tr: 'string.Format' çağrılarındaki geçersiz yer tutucuları bildir
zh_hans: 报告 "String.Format" 调用中无效的占位符
zh_hant: 報告 'String.Format' 呼叫中無效的預留位置

source: Separate using directive groups
cs: Oddělovat skupiny direktiv using
de: Using-Anweisungsgruppen trennen
es: Separar grupos de directivas using
fr: Séparer les groupes de directives using
it: Separa gruppi di direttive using
ko: using 지시문 그룹 구분
pl: Oddziel grupy dyrektywy using
pt_br: Separar usando grupos de diretiva
tr: Yönerge gruplarını kullanarak ayır
zh_hans: 单独的 using 指令组
zh_hant: 使用指示詞群組來分隔

source: Show name s_uggestions
cs: Zobrazovat návr_hy názvů
de: Namensv_orschläge anzeigen
es: Mostrar s_ugerencias de nombres
fr: Afficher les s_uggestions de nom
it: Mostra s_uggerimenti per nomi
ko: 이름 제안 표시(_U)
pl: Pokaż s_ugestie dotyczące nazwy
pt_br: Mostrar s_ugestões de nomes
tr: Ad ö_nerilerini göster
zh_hans: 显示名称建议(_U)
zh_hant: 顯示名稱建議(_U)

# In_arithmetic_binary_operators
source: In arithmetic operators: * / % + - << >> & ^ |
cs: V aritmetických operátorech: * / % + - << >> & ^ |
de: In arithmetische Operatoren: * / % + - << >> & ^ |
es: En operadores aritméticos: * / % + - << >> & ^ |
fr: Dans les opérateurs arithmétiques : * / % + - << >> & ^ |
it: In operatori aritmetici: * / % + - << >> & ^ |
ko: 산술 연산자: * / % + - << >> & ^ |
pl: W operatorach arytmetycznych: * / % + - << >> & ^ |
pt_br: Em operadores aritméticos: * / % + - << >> & ^ |
tr: Aritmetik işleçleri içinde: * / % + - <> <>& ^ |
zh_hans: 在算术运算符中: * / % + - << >> & ^ |
zh_hant: 算術運算子: * / % + - << >> & ^ |

# In_other_binary_operators
source: In other binary operators: && || ?? and or
cs: V jiných binárních operátorech: && || ?? and or
de: In anderen binären Operatoren: && || ?? and or
es: En otros operadores binarios: && || ??
fr: Dans d'autres opérateurs binaires : && || ?? and or
it: In altri operatori binari: && || ?? and or
pl: W innych operatorach binarnych: && || ?? and or
pt_br: Em outros operadores binários: && || ?? and or
tr: Diğer ikili işleçler içinde: && || ?? and or
zh_hans: 在其他二进制运算符中: && || ?? and or
zh_hant: 在其他二進位運算子中: && || ?? and or

# Allow_bank_line_after_colon_in_constructor_initializer
source: Allow blank line after colon in constructor initializer
cs: Povolit prázdný řádek za dvojtečkou v inicializátoru konstruktoru
it: Consenti riga vuota dopo i due punti nell'inizializzatore del costruttore
zh_hant: 允許在建構函式初始設定式的冒號後面加上空白行

# CSharp_Coding_Conventions
source: C# Coding Conventions
cs: Konvence kódování v C#
es: Convenciones de código de C#
it: Convenzioni di scrittura codice C#
ko: C# 코딩 규칙
zh_hans: c# 编码约定
zh_hant: C# 編碼慣例

# CSharp_Formatting_Rules
source: C# Formatting Rules
cs: Pravidla formátování jazyka C#
es: Reglas de formato de C#
it: Regole di formattazione C#
ko: C# 서식 설정 규칙
zh_hans: C# 格式规则
zh_hant: C# 格式化規則

source: Prefer parameter null checking
cs: Preferovat kontrolu hodnoty null parametru
it: Preferisci il controllo dei parametri Null
zh_hant: 建議使用參數 Null 檢查

# Insert_space_between_method_name_and_its_opening_parenthesis1
source: Insert space between method name and its opening parenthesis
cs: Vložit mezeru mezi název metody a její levou kulatou závorkou
es: Insertar espacio entre el nombre del método y el paréntesis de apertura
it: Inserisci spazio tra il nome del metodo e la parentesi di apertura corrispondente
ko: 메서드 이름과 여는 괄호 사이에 공백 삽입
zh_hans: 在方法名称与其左括号之间插入空格
zh_hant: 在方法名稱和左括號之間插入空格

# Insert_space_between_method_name_and_its_opening_parenthesis2
source: Insert space between method name and its opening parenthesis
cs: Vložit mezeru mezi název metody a její levou kulatou závorkou
es: Insertar espacio entre el nombre del método y el paréntesis de apertura
it: Inserisci spazio tra il nome del metodo e la parentesi di apertura corrispondente
ko: 메서드 이름과 여는 괄호 사이에 공백 삽입
zh_hans: 在方法名称与其左括号之间插入空格
zh_hant: 在方法名稱和左括號之間插入空格

# CSharp_Interactive
source: C# Interactive
tr: C# Etkileşimli

source: Cancel Query
fr: Annuler la requête
pl: Anuluj zapytanie
tr: Sorguyu İptal Et

# CancelQueryCommandToolTip
source: Cancel (Escape)
fr: Annuler (Échap)
pl: Anuluj (klawisz Escape)
tr: İptal (Escape)

source: Run Query
fr: Exécuter une requête
pl: Uruchom zapytanie
tr: Sorguyu Çalıştır

# RunQueryCommandToolTip
source: Run (Ctrl+Enter)
fr: Exécuter (Ctrl+Entrée)
pl: Uruchom (Ctrl+Enter)
tr: Çalıştır (Ctrl+Enter)

source: Semantic Search
fr: Recherche sémantique
pl: Wyszukiwanie semantyczne
tr: Anlamsal Arama

# Automatically_show_completion_list_in_argument_lists
source: Automatically show completion list in argument lists (experimental)
es: Mostrar automáticamente la lista de finalización en las listas de argumentos (experimental)
zh_hans: 自动显示参数列表中的完成列表(实验性)

source: Generate Event Subscription
es: Generar suscripción de eventos
ko: 이벤트 구독 생성
zh_hans: 生成事件订阅

# Show_items_from_unimported_namespaces
source: Show items from unimported namespaces (experimental)
es: Mostrar elementos de espacios de nombres no importados (experimental)
ko: 가져오지 않은 네임스페이스의 항목 표시(실험적)
zh_hans: 显示 unimported 命名空间中的项(实验)

source: Place open brace on new line for object, collection and array initializers
es: Colocar llave de apertura en la nueva línea para los inicializadores de objeto, colección y matriz
ko: 개체, 컬렉션 및 배열 이니셜라이저의 여는 중괄호를 새 줄에 배치
zh_hans: 将对象、集合和数组初始值设定项的左大括号置于新行

source: Completion Lists
es: Listas de finalización
ko: 완성 목록
zh_hans: 完成列表

source: _Move local declaration to the extracted method if it is not used elsewhere
ko: 다른 위치에서 사용되지 않는 로컬 선언을 추출된 메서드로 이동(_M)

source: In other binary operators: && || ??
ko: 기타 이항 연산자: && || ??
