Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/CSharpVSResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

source: Insert space before open square bracket
cs: Vložit mezeru před levou hranatou závorku
de: Leerzeichen vor öffnender eckiger Klammer einfügen
es: Insertar espacio delante de corchete de apertura
fr: Insérer un espace avant un crochet ouvrant
it: Inserisci spazio prima della parentesi quadra di apertura
ko: 여는 대괄호 앞에 공백 삽입
pl: Wstaw spację przed otwierającym nawiasem kwadratowym
pt_br: Inserir espaço antes do colchete de abertura
tr: Açma köşeli ayracından önce boşluk ekle
zh_hans: 在左方括号前插入空格
zh_hant: 在左方括號前面插入空格

source: Insert space within empty square brackets
cs: Vložit mezeru mezi prázdné hranaté závorky
de: Leerzeichen zwischen leeren eckigen Klammern einfügen
es: Insertar espacio entre corchetes vacíos
fr: Insérer un espace dans des crochets vides
it: Inserisci spazio tra parentesi quadre vuote
ko: 빈 대괄호의 내부에 공백 삽입
pl: Wstaw spację wewnątrz pustych nawiasów kwadratowych
pt_br: Inserir espaço dentro de colchetes vazios
tr: Boş köşeli ayraçların içine boşluk ekle
zh_hans: 在空方括号中插入空格
zh_hant: 在空的方括號中插入空格

source: New line options for braces
cs: Možnosti nového řádku pro závorky
de: Zeilenwechseloptionen für geschweifte Klammern
es: Opciones de nueva línea para llaves
fr: Nouvelles options de ligne pour les accolades
it: Opzioni relative alla nuova riga per parentesi graffe
ko: 중괄호에 대한 줄 바꿈 옵션
pl: Opcje nowego wiersza dla nawiasów klamrowych
pt_br: Novas opções de linha para chaves
tr: Küme ayraçları için yeni satır seçenekleri
zh_hans: 大括号的新行选项
zh_hant: 括號的新行選項

source: New line options for expressions
cs: Volby nových řádků pro výrazy
de: Zeilenwechseloptionen für Ausdrücke
es: Opciones de nueva línea para expresiones
fr: Nouvelles options de lignes pour expressions
it: Opzioni relative alla nuova riga per espressioni
ko: 식에 대한 줄 바꿈 옵션
pl: Opcje nowego wiersza dla wyrażeń
pt_br: Novas opções de linha para expressões
tr: İfadeler için yeni satır seçenekleri
zh_hans: 表达式的新行选项
zh_hant: 運算式的新行選項

source: New line options for keywords
cs: Možnosti nových řádků pro klíčová slova
de: Zeilenwechseloptionen für Schlüsselwörter
es: Opciones de nueva línea para palabras clave
fr: Nouvelles options de ligne pour les mots clés
it: Opzioni relative alla nuova riga per parole chiave
ko: 키워드에 대한 줄 바꿈 옵션
pl: Opcje nowego wiersza dla słów kluczowych
pt_br: Novas opções de linha para palavras-chaves
tr: Anahtar sözcükler için yeni satır seçenekleri
zh_hans: 关键字的新行选项
zh_hant: 關鍵字的新行選項

source: Unused local
cs: Nepoužitá místní
de: Nicht verwendete lokale Variable
es: Local sin uso
fr: Local inutilisé
it: Variabile locale inutilizzata
ko: 사용하지 않는 로컬
pl: Nieużywane zmienne lokalne
pt_br: Local não usado
tr: Kullanılmayan yerel
zh_hans: 未使用的本地
zh_hant: 未使用的區域函式

source: Use 'var' when generating locals
cs: Při generování lokálních proměnných použijte var.
de: Beim Generieren lokaler Variablen "var" verwenden.
es: Usar 'var' al generar variables locales
it: Usa 'var' durante la generazione di variabili locali
ko: 지역 변수를 생성할 때 'var'을 사용합니다.
pt_br: Usar "var" ao gerar locais
zh_hans: 生成局部变量时，使用“var”
zh_hant: 產生區域變數時，請使用 'var'

source: _Show procedure line separators
cs: Zob_razit oddělovače řádků procedur
de: _Zeilentrennzeichen in Prozeduren anzeigen
es: Mo_strar separadores de líneas de procedimientos
fr: _Afficher les séparateurs de ligne de procédure
it: _Mostra separatori di riga routine
ko: 프로시저 줄 구분선 표시(_S)
pl: _Pokaż separatory wierszy procedury
pt_br: _Mostrar separadores de linha de procedimento
tr: Yordam satır ayıraçlarını _göster
zh_hans: 显示过程行分隔符(_S)
zh_hant: 顯示程序行分隔符號(_S)

source: _Don't put ref or out on custom struct
cs: Nevklá_dat odkaz nebo výstup do vlastní struktury
de: _Nicht ref oder out auf benutzerdefinierte Struktur legen
es: _No colocar 'out' o 'ref' en estructura personalizada
fr: _Ne pas ajouter ref ou out dans un struct personnalisé
it: _Non inserire out o ref in struct personalizzato
ko: 사용자 지정 구조체에 ref 또는 out 추가 안 함(_D)
pl: _Nie umieszczaj parametrów ref i out w strukturze niestandardowej
pt_br: _Não colocar ref nem out no struct personalizado
tr: Özel struct'a ref veya out koy_ma
zh_hans: 不要在自定义结构上放置 ref 或 out(_D)
zh_hant: 請勿將 ref 或 out 置於自訂結構上(_D)

source: Editor Help
cs: Nápověda k editoru
de: Editor-Hilfe
es: Ayuda de editor
fr: Aide de l'éditeur
it: Guida Editor
ko: 편집기 도움말
pl: Pomoc edytora
pt_br: Ajuda do Editor
tr: Düzenleyici Yardımı
zh_hans: 编辑器帮助
zh_hant: 編輯器說明

source: Highlight related _keywords under cursor
cs: Zvýrazňovat související _klíčová slova pod kurzorem
de: Verwandte _Schlüsselbegriffe unter Cursor anzeigen
es: Resaltar palabras cla_ve relacionadas bajo el cursor
fr: Surligner les mots clés liés sous le _curseur
it: Evidenzia _parole chiave correlate sotto il cursore
ko: 커서 아래의 관련 키워드 강조(_K)
pl: Wyróżnij powiązane _słowa kluczowe pod kursorem
pt_br: Realçar _palavras-chave relacionadas usando o cursor
tr: İmlecin altında ilgili ana_htar sözcükleri vurgula
zh_hans: 突出显示光标下相关的关键字(_K)
zh_hant: 反白資料指標下的相關關鍵字(_K)

source: _Highlight references to symbol under cursor
cs: Z_výrazňovat odkazy na symbol pod kurzorem
de: _Verweise auf Symbol unter Cursor hervorheben
es: _Resaltar referencias al símbolo bajo el cursor
fr: _Surligner les références jusqu'au symbole sous le curseur
it: _Evidenzia riferimenti a simbolo sotto il cursore
ko: 커서 아래의 기호에 대한 참조 강조(_H)
pl: _Wyróżnij odwołania do symbolu pod kursorem
pt_br: _Realçar referências a símbolo sob o cursor
tr: İmlecin altındaki sembole başvuruları _vurgula
zh_hans: 突出显示对光标下符号的引用(_H)
zh_hant: 反白顯示資料指標下符號的參考項目(_H)

source: Enter _outlining mode when files open
cs: P_o otevření souborů vejít do režimu osnovy
de: _Gliederungsmodus eingeben, wenn Dateien offen sind
es: Entrar en m_odo de esquematización al abrir archivos
fr: Passer en m_ode Plan à l'ouverture des fichiers
it: _Attiva modalità struttura all'apertura del file
ko: 개요 모드로 파일 열기(_O)
pl: Przejdź _do trybu konspektu przy otwieraniu plików
pt_br: Entrar no modo de _estrutura de tópicos ao abrir arquivos
tr: Dosyalar açıldığında a_na hat oluşturma moduna gir
zh_hans: 打开文件时进入大纲模式(_O)
zh_hant: 當檔案開啟時進入大綱模式(_O)

source: Extract Method
cs: Extrahovat metodu
de: Methode extrahieren
es: Extraer método
fr: Extraire la méthode
it: Estrai metodo
ko: 메서드 추출
pl: Wyodrębnianie metody
pt_br: Extrair Método
tr: Metodu Ayıkla
zh_hans: 提取方法
zh_hant: 擷取方法

source: _Generate XML documentation comments for ///
cs: _Generovat komentáře dokumentace XML pro ///
de: _XML-Dokumentationskommentare für /// eingeben
es: _Generar comentarios de documentación XML con ///
fr: _Générer des commentaires de documentation XML pour ///
it: _Genera commenti in formato documentazione XML per ///
ko: ///에 대해 XML 문서 주석 생성(_G)
pl: _Generuj komentarze dokumentacji XML dla ///
pt_br: _Gerar comentário da documentação XML ///
tr: /// için _XML belge açıklamaları üret
zh_hans: 为 /// 生成 XML 文档注释(_G)
zh_hant: 產生 /// 的 XML 文件註解(_G)

source: Highlighting
cs: Zvýraznění
de: Hervorheben
es: Resaltar
fr: Mise en surbrillance
it: Evidenziazione
ko: 강조 표시
pl: Wyróżnianie
pt_br: Destaque
tr: Vurgulama
zh_hans: 突出显示
zh_hant: 反白

source: _Insert * at the start of new lines when writing /* */ comments
cs: Při psaní _komentářů /* */ vkládat na začátek nových řádků hvězdičku (*)
de: Be_im Schreiben von Kommentaren (/* */) * am Beginn neuer Zeilen einfügen
es: _Insertar * al comienzo de nuevas líneas al escribir comentarios /* */
fr: _Insérer * au début des nouvelles lignes pour l'écriture de commentaires /* */
it: _Inserisci * all'inizio di nuove righe quando si scrivono commenti /* */
ko: /* */ 주석을 작성할 때 새 줄의 시작 부분에 * 삽입(_I)
pl: _Wstawiaj znak * na początku nowych wierszy podczas pisania komentarzy (/* */)
pt_br: _Insira um * no início das novas linhas ao escrever /* */ comentários
tr: _/* */ açıklamaları yazarken her yeni satırın başına _ekle *
zh_hans: 编写 /* */ 注释时，请在新行的开头插入 *(_I)
zh_hant: 在寫入 /* */ 時，於新行開頭插入 *(_I)

source: Optimize for solution size
cs: Optimalizovat pro velikost řešení
de: Für Lösungsgröße optimieren
es: Optimizar para tamaño de la solución
fr: Optimiser pour la taille de la solution
it: Ottimizza in base alle dimensioni della soluzione
ko: 솔루션 크기에 맞게 최적화
pl: Optymalizuj pod kątem rozmiaru rozwiązania
pt_br: Otimizar para o tamanho de solução
tr: Çözüm boyutunu iyileştir
zh_hans: 优化解决方案大小
zh_hant: 最佳化方案大小

source: Large
cs: Velké
de: Groß
es: Grande
fr: Grande
it: Grande
ko: 크게
pl: Duży
pt_br: Grande
tr: Büyük
zh_hans: 大
zh_hant: 大

source: Regular
cs: Normální
de: Regulär
es: Normal
fr: Normal
it: Normale
ko: 일반
pl: Standardowy
pt_br: Normal
tr: Normal
zh_hans: 常规
zh_hant: 一般

source: Small
cs: Malé
de: Klein
es: Pequeño
fr: Petite
it: Piccola
ko: 작게
pl: Mały
pt_br: Pequeno
tr: Küçük
zh_hans: 小
zh_hant: 小

source: Using Directives
cs: Direktivy using
de: Using-Direktiven
es: Directivas Using
fr: Directives Using
it: Direttive using
ko: Using 지시문
pl: Dyrektywy using
pt_br: Usando Diretivas
tr: Using Yönergeleri
zh_hans: Using 指令
zh_hant: Using 指示詞

source: Performance
cs: Výkon
de: Leistung
es: Rendimiento
fr: Performances
it: Prestazioni
ko: 성능
pl: Wydajność
pt_br: Desempenho
tr: Performans
zh_hans: 性能
zh_hant: 效能

source: _Place 'System' directives first when sorting usings
cs: _Při řazení direktiv using umístit nejdřív direktivy System
de: System-Anweisungen beim Sortieren von using-Anweisungen an erster Stelle _platzieren
es: Al ordenar instrucciones Using, _colocar primero las directivas 'System'
fr: _Placer les directives 'System' en premier lors du tri des usings
it: _Inserisci prima le direttive 'System' durante l'ordinamento delle direttive using
ko: using 정렬 시 'System' 지시문 먼저 배치(_P)
pl: _Umieść dyrektywy „System” jako pierwsze podczas sortowania użyć
pt_br: _Colocar as diretivas 'System' primeiro ao classificar usos
tr: using deyimlerini sıralarken 'System' yönergelerini ilk sıraya _yerleştir
zh_hans: 对 using 排序时将“System”指令排在第一位(_P)
zh_hant: 排序 Using 時先放置 'System' 指示詞(_P)

source: _Show completion list after a character is typed
cs: _Zobrazovat seznam dokončení po zadání znaku
de: _Vervoll­ständigungsliste nach Eingabe eines Zeichens anzeigen
es: _Mostrar lista de finalización después de escribir un carácter
fr: _Afficher la liste de saisie semi-automatique après la saisie d'un caractère
it: Mo_stra elenco di completamento dopo la digitazione di un carattere
ko: 문자를 입력하면 완성 목록 표시(_S)
pl: _Pokaż listę uzupełniania po wpisaniu znaku
pt_br: _Mostrar lista de conclusão depois que um caractere é digitado
tr: Bir karakter yazıldıktan sonra tamamlanma listesini _göster
zh_hans: 键入字符后显示完成列表(_S)
zh_hant: 輸入一個字元後顯示完成清單(_S)

source: Place _keywords in completion lists
cs: Umístit _klíčová slova do seznamů dokončení
de: _Schlüsselwörter ebenfalls in Vervollständigungslisten aufnehmen
es: Colocar _palabras clave en listas de finalización
fr: Placer les mots _clés dans les listes de saisie semi-automatique
it: Inserisci parole c_hiave in elenchi di completamento
ko: 완성 목록에 키워드 배치(_K)
pl: Umieść słowa _kluczowe na listach uzupełniania
pt_br: Colocar _palavras-chave em listas de conclusão
tr: A_nahtar sözcükleri tamamlama listelerine yerleştir
zh_hans: 将关键字放入完成列表(_K)
zh_hant: 將關鍵字置於完成清單中(_K)

source: Place _code snippets in completion lists
cs: Umístit _fragmenty kódu do seznamu dokončení
de: _Codeschnipsel in Vervollständigungslisten anordnen
es: Colocar _fragmentos de código en listas de finalización
fr: Placer les extraits de _code dans les listes de saisie semi-automatique
it: Inserisci _frammenti di codice in elenchi di completamento
ko: 완성 목록에 코드 조각 배치(_C)
pl: Umieść _fragmenty kodu na listach uzupełniania
pt_br: Colocar snippets de _código em listas de conclusão
tr: _Kod parçacıklarını tamamlama listelerine yerleştir
zh_hans: 将片段放入完成列表(_C)
zh_hant: 將程式碼片段置於完成清單中(_C)

source: Selection In Completion List
cs: Výběr v seznamu dokončení
de: Auswahl in Vervollständigungsliste
es: Selección en la lista de finalización
fr: Sélection dans la liste de saisie semi-automatique
it: Selezione in elenco di completamento
ko: 완성 목록에서 선택
pl: Wybór na liście uzupełniania
pt_br: Seleção na Lista de Conclusão
tr: Tamamlama Listesinden Seçim
zh_hans: 完成列表中的选定内容
zh_hant: 完成清單中的選取範圍

source: Show preview for rename _tracking
cs: Zobrazit náhled pro sledování _rename
de: Vorschau für Nachverfolgung beim _Umbenennen anzeigen
es: Mostrar vista previa para _seguimiento de cambio de nombre
fr: Affiche_r un aperçu pour le suivi des renommages
it: Mostra anteprima per verifica _ridenominazione
ko: 이름 바꾸기 추적 미리 보기 표시(_T)
pl: Pokaż podgląd śledzenia _zmian nazw
pt_br: Mostrar visualização para acompanhamento de _renomeação
tr: Yeniden adlandırma i_zlemesi için önizleme göster
zh_hans: 显示重命名跟踪的预览(_T)
zh_hant: 顯示預覽以追蹤重新命名(_T)

source: Place open brace on new line for property, indexer, and event accessors
cs: Vloží levou složenou závorku na nový řádek pro přistupující objekty vlastností, indexerů a událostí.
de: Fügt eine öffnende geschweifte Klammer für eine Eigenschaft, den Indexer und Ereignisaccessor in einer neuen Zeile ein.
es: Colocar llave de apertura para descriptores de acceso de eventos, indizadores y propiedades en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les accesseurs de propriété, d'indexeur et d'événement
it: Inserisci parentesi graffa di apertura in una nuova riga per funzioni di accesso a proprietà, indicizzatori ed eventi
ko: 속성, 인덱서 및 이벤트 접근자의 여는 중괄호를 새 줄에 배치합니다.
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla metod dostępu właściwości, indeksatora i zdarzenia
pt_br: Colocar chave de abertura em nova linha para acessadores de eventos, propriedades e indexadores
tr: Özellik, dizin oluşturucusu ve olay erişimcileri için yeni satıra açık ayraç yerleştir
zh_hans: 将左大括号放置在新行中，以表示属性、索引器和事件访问器
zh_hant: 將屬性、索引子及事件存取子的左邊大括號放在新行

source: Place open brace on new line for properties, indexers, and events
cs: Vloží levou složenou závorku na nový řádek pro vlastnosti, indexery a události.
de: Fügt eine öffnende geschweifte Klammer für Eigenschaften, Indexer und Ereignisse in einer neuen Zeile ein.
es: Colocar llave de apertura para propiedades, indizadores y eventos en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les propriétés, indexeurs et événements
it: Inserisci parentesi graffa di apertura in una nuova riga per proprietà, indicizzatori ed eventi
ko: 속성, 인덱서 및 이벤트의 여는 중괄호를 새 줄에 배치합니다.
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla właściwości, indeksatorów i zdarzeń
pt_br: Colocar chave de abertura em nova linha para propriedades, indexadores e eventos
tr: Özellikler, dizin oluşturucular ve olaylar için yeni satıra açık ayraç yerleştir
zh_hans: 将左大括号放置在新行中，以表示属性、索引器和事件
zh_hant: 將屬性、索引子及事件的左邊大括號放在新行

source: Suggest usings for types in _NuGet packages
cs: Navrhnout použití typů v balíčcích _NuGet
de: Using-Direktiven für Typen in _NuGet-Paketen vorschlagen
es: Sugerir usos para tipos de paquetes _NuGet
fr: Suggérer des usings pour les types dans les packages _NuGet
it: Suggerisci le direttive using per i tipi in pacchetti _NuGet
ko: NuGet 패키지의 형식에 대한 using 제안(_N)
pl: Sugeruj dyrektywy using dla typów w pakietach _NuGet
pt_br: Sugerir usos para tipos nos pacotes _NuGet
tr: _NuGet paketlerinde türler için using öner
zh_hans: 建议对 NuGet 包中的类型使用 using(_N)
zh_hant: 為 NuGet 封裝中的類型建議 Using(_N)

# Type_Inference_preferences_colon
source: Type Inference preferences:
cs: Předvolby odvození typu proměnné:
de: Typrückschlusseinstellungen:
es: Preferencias de inferencia de tipo:
it: Preferenze per inferenza del tipo:
ko: 형식 유추 기본 설정:
pt_br: Preferências de Inferência de Tipos:
zh_hans: 类型推理首选项:
zh_hant: 型別推斷喜好設定:

source: For built-in types
cs: Pro předdefinované typy
de: Für integrierte Typen
es: Para tipos integrados
fr: Pour les types intégrés
it: Per tipi predefiniti
ko: 기본 제공 형식인 경우
pl: Dla typów wbudowanych
pt_br: Para tipos internos
tr: Yerleşik türler için
zh_hans: 对于内置类型
zh_hant: 適用於內建類型

source: Elsewhere
cs: Kdekoli jinde
de: Anderswo
es: En otro lugar
fr: Ailleurs
it: Altrove
ko: 다른 곳
pl: W innych miejscach
pt_br: Em outro lugar
tr: Başka bir yerde
zh_hans: 其他位置
zh_hant: 其他地方

source: When on multiple lines
cs: Když je na více řádcích
de: Bei mehreren Zeilen
es: Cuando se usan varias líneas
fr: Si plusieurs lignes
it: In presenza di più righe
ko: 여러 줄일 때
pl: Gdy dotyczy wielu wierszy
pt_br: Quando estiver em várias linhas
tr: Birden çok satırdaysa
zh_hans: 在多行上时
zh_hant: 在多行上時

source: When variable type is apparent
cs: Když je typ proměnné zjevný
de: Wenn der Variablentyp offensichtlich ist
es: Cuando el tipo de variable es aparente
fr: Quand le type de variable est apparent
it: Quando il tipo della variabile è apparente
ko: 변수 형식이 명백한 경우
pl: Gdy typ zmiennej jest oczywisty
pt_br: Quando o tipo de variável é aparente
tr: Değişken türü görünür olduğunda
zh_hans: 当变量类型明显时
zh_hant: 當變數類型為實際型態時

source: Qualify event access with 'this'
cs: Kvalifikovat přístup k události pomocí „this“
de: Ereigniszugriff mit "this" qualifizieren
es: Calificar acceso a evento con 'this'
fr: Qualifier l'accès à l'événement avec 'this'
it: Qualifica l'accesso agli eventi con 'this'
ko: this'를 사용하여 이벤트 액세스를 한정합니다.
pl: Kwalifikuj dostęp do zdarzenia przy użyciu elementu „this”
pt_br: Qualificar acesso do evento com 'this'
tr: Olay erişimini 'this' ile nitele
zh_hans: 使用 "this" 限定事件访问
zh_hant: 以 'this' 限定事件存取

source: Qualify field access with 'this'
cs: Kvalifikovat přístup k poli pomocí „this“
de: Feldzugriff mit "this" qualifizieren
es: Calificar acceso a campo con 'this'
fr: Qualifier l'accès au champ avec 'this'
it: Qualifica l'accesso ai campi con 'this'
ko: this'를 사용하여 필드 액세스를 한정합니다.
pl: Kwalifikuj dostęp do pola przy użyciu elementu „this”
pt_br: Qualificar acesso do campo com 'this'
tr: Alan erişimini 'this' ile nitele
zh_hans: 使用 "this" 限定字段访问
zh_hant: 以 'this' 限定欄位存取

source: Qualify method access with 'this'
cs: Kvalifikovat přístup k metodě pomocí „this“
de: Methodenzugriff mit "this" qualifizieren
es: Calificar acceso a método con 'this'
fr: Qualifier l'accès à la méthode avec 'this'
it: Qualifica l'accesso ai metodi con 'this'
ko: this'를 사용하여 메서드 액세스를 한정합니다.
pl: Kwalifikuj dostęp do metody przy użyciu elementu „this”
pt_br: Qualificar acesso do método com 'this'
tr: Metot erişimini 'this' ile nitele
zh_hans: 使用 "this" 限定方法访问
zh_hant: 以 'this' 限定方法存取

source: Qualify property access with 'this'
cs: Kvalifikovat přístup k vlastnosti pomocí „this“
de: Eigenschaftenzugriff mit "this" qualifizieren
es: Calificar acceso a propiedad con 'this'
fr: Qualifier l'accès à la propriété avec 'this'
it: Qualifica l'accesso alle proprietà con 'this'
ko: this'를 사용하여 속성 액세스를 한정합니다.
pl: Kwalifikuj dostęp do właściwości przy użyciu elementu „this”
pt_br: Qualificar acesso da propriedade com 'this'
tr: Özellik erişimini 'this' ile nitele
zh_hans: 使用 "this" 限定属性访问
zh_hant: 以 'this' 限定屬性存取

source: Prefer explicit type
cs: Preferovat explicitní typ
de: Expliziten Typ bevorzugen
es: Preferir tipo explícito
fr: Préférer un type explicite
it: Preferisci tipo esplicito
ko: 명시적 형식 기본 사용
pl: Preferuj jawny typ
pt_br: Preferir tipo explícito
tr: Açık türü tercih et
zh_hans: 首选显式类型
zh_hant: 建議使用明確類型

source: Prefer 'this.'
cs: Preferovat „this.“
de: "this." bevorzugen
es: Preferir "this."
fr: Préférer 'this.'
it: Preferisci 'this.'
ko: this'를 기본으로 사용합니다.
pl: Preferuj element „this.”
pt_br: Preferir 'this'.
tr: This' öğesini tercih et.
zh_hans: 首选 "this."
zh_hant: 建議使用 'this.'

source: Prefer 'var'
cs: Preferovat „var“
de: "var" bevorzugen
es: Preferir 'var'
fr: Préférer 'var'
it: Preferisci 'var'
ko: var'을 기본으로 사용합니다.
pl: Preferuj element „var”
pt_br: Preferir 'var'
tr: 'var' tercih et
zh_hans: 首选 "var"
zh_hant: 建議使用 'var'

# this_preferences_colon
source: 'this.' preferences:
cs: 'Předvolby pro „this.“:
de: 'this.-Einstellungen:
es: 'Preferencias de "this.":
fr: 'Préférences 'this.' :
it: 'Preferenze per 'this.':
ko: 'this.' 기본 설정:
pl: 'Preferencje dotyczące elementu „this.”:
pt_br: 'Preferências de 'this.':
tr: 'This' tercihleri:
zh_hans: '"this." 首选项:
zh_hant: 'this.' 喜好設定:

# using_preferences_colon
source: 'using' preferences:
cs: Předvolby pro using:
de: using-Einstellungen:
es: Preferencias de "using":
fr: Préférences pour 'using' :
it: Preferenze per 'using':
ko: 'using' 기본 설정:
pl: Preferencje dyrektywy „using”:
pt_br: Preferências de 'using':
tr: 'using' tercihleri:
zh_hans: "using" 首选项:
zh_hant: 'using' 喜好設定:

# var_preferences_colon
source: 'var' preferences:
cs: 'Předvolby pro „var“:
de: 'var-Einstellungen:
es: 'Preferencias de 'var':
fr: 'Préférences 'var' :
it: 'Preferenze per 'var':
ko: 'var' 기본 설정:
pl: 'Preferencje elementu „var”:
pt_br: 'Preferências de 'var':
tr: 'var' tercihleri:
zh_hans: '"var" 首选项:
zh_hant: 'var' 喜歡設定:

source: Do not prefer 'this.'
cs: Nepreferovat „this.“
de: "this." nicht bevorzugen
es: No preferir "this."
fr: Ne pas préférer 'this.'
it: Non preferire 'this.'
ko: this'를 기본으로 사용하지 마세요.
pl: Nie preferuj kwalifikatora „this.”
pt_br: Não preferir 'this'.
tr: 'This' tercih edersiniz
zh_hans: 请勿首选 "this."
zh_hant: 不建議使用 'this.'

# predefined_type_preferences_colon
source: predefined type preferences:
cs: Předdefinované předvolby typů:
de: Vordefinierte Typeinstellungen:
es: Preferencias de tipos predefinidos:
fr: Préférences de types prédéfinies :
it: Preferenze per tipi predefiniti:
ko: 미리 정의된 형식 기본 설정:
pl: Preferencje wstępnie zdefiniowanego typu:
pt_br: Preferências de tipo predefinidas:
tr: Önceden tanımlanmış tür tercihleri:
zh_hans: 预定义类型首选项:
zh_hant: 預先定義的類型喜好設定:

source: Split string literals on _enter
cs: Rozdělit literály řetězců u _enter
de: _Zeichenfolgenliterale bei Eingabe teilen
es: Dividir literales de cadena al presionar _Entrar
fr: Fractionner les littéraux de chaîne avec _Entrée
it: Dividi valori letterali stringa dopo _INVIO
ko: <Enter> 키를 누르면 문자열 리터럴 분할(_E)
pl: Dziel literały ciągów po _wpisaniu
pt_br: Dividir sequências literais em _enter
tr: _Enter tuşuna basıldığında dize değişmez değerlerini böl
zh_hans: 输入时拆分字符串文本(_E)
zh_hant: 在 Enter 字元處分隔字串文字(_E)

source: _Highlight matching portions of completion list items
cs: _Zvýraznit odpovídající části položek seznamu dokončení
de: _Übereinstimmende Teile der Vervollständigungslistenelemente anzeigen
es: _Resaltar partes coincidentes de elementos de lista de finalización
fr: _Mettre en surbrillance les parties correspondantes des éléments de liste de saisie semi-automatique
it: _Evidenzia le parti corrispondenti di voci dell'elenco di completamento
ko: 완성 목록 항목에서 일치하는 부분 강조 표시(_H)
pl: _Wyróżnij pasujące fragmenty elementów listy uzupełniania
pt_br: _Realçar partes correspondentes dos itens da lista de conclusão
tr: Tamamlanma listesi öğelerinin eşleşen bölümlerini _vurgula
zh_hans: 突出显示完成列表项的匹配部分(_H)
zh_hant: 反白完成清單項目的相符部分(_H)

source: Show completion item _filters
cs: Zobrazit _filtry položek dokončení
de: Vervollständigungselement_filter anzeigen
es: Mostrar _filtros de elementos de finalización
fr: Afficher les _filtres d'éléments de saisie semi-automatique
it: Mostra i _filtri per le voci di completamento
ko: 완성 항목 필터 표시(_F)
pl: Pokaż _filtry elementów uzupełniania
pt_br: Mostrar _filtros de itens de conclusão
tr: Tamamlanma öğesi _filtrelerini göster
zh_hans: 显示完成项筛选器(_F)
zh_hant: 顯示完成項目篩選(_F)

# Enter_key_behavior_colon
source: Enter key behavior:
cs: Chování klávesy Enter:
de: Verhalten der EINGABETASTE:
es: Comportamiento de la tecla Entrar:
fr: Comportement de la touche Entrée :
it: Comportamento del tasto INVIO:
ko: <Enter> 키 기능:
pl: Zachowanie klawisza Enter:
pt_br: Insira o comportamento da tecla:
tr: Enter tuşu davranışı:
zh_hans: 输入关键行为:
zh_hant: Enter 鍵行為:
