Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/CSharpVSResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

source: Place goto labels in leftmost column
cs: Umístit návěští goto do sloupce nejvíce vlevo
de: goto-Bezeichnungen in Spalte ganz links platzieren
es: Colocar etiquetas goto en primera columna de la izquierda
fr: Placer des étiquettes goto dans la colonne située le plus à gauche
it: Inserisci etichette goto nella colonna più a sinistra
ko: 맨 왼쪽 열에 goto 레이블을 배치합니다.
pl: Umieść etykiety instrukcji goto w kolumnie z lewej strony
pt_br: Posicionar rótulos goto na coluna mais à esquerda
tr: Goto etiketlerini en soldaki sütuna yerleştir
zh_hans: 将 goto 标签置于最左侧的列中
zh_hant: 將 goto 標籤置於最左欄

source: Indent labels normally
cs: Odsadit návěští normálně
de: Bezeichnungen normal einziehen
es: Aplicar sangría normal a etiquetas
fr: Mettre en retrait normalement les étiquettes
it: Rientra etichette normalmente
ko: 보통 수준으로 레이블을 들여씁니다.
pl: Normalne wcięcie etykiet
pt_br: Recuar rótulos normalmente
tr: Etiketleri normal şekilde girintile
zh_hans: 正常缩进标签
zh_hant: 以一般方式縮排標籤

source: Place goto labels one indent less than current
cs: Umístit návěští goto o jedno odsazení méně než je aktuální
de: goto-Bezeichnungen um eine Einzugsebene weiter links als die aktuelle Position platzieren
es: Reducir una sangría para las etiquetas goto
fr: Placer les étiquettes goto d'un niveau inférieur au niveau actuel
it: Inserisci etichette goto con un livello di rientro inferiore al corrente
ko: goto 레이블을 현재 수준보다 한 수준 더 들여씁니다.
pl: Umieść etykiety instrukcji goto o jedno wcięcie bliżej niż bieżący element
pt_br: Colocar rótulos goto um recuo a menos do que o atual
tr: Goto etiketlerinin girintisi geçerli düzeyden bir düzey az olsun
zh_hans: 将 goto 标签置于比当前位置缩进一个缩进级别的位置
zh_hant: 為 goto 標籤目前的位置減少一個縮排層次

source: Label Indentation
cs: Odsazení návěští
de: Bezeichnungseinzug
es: Sangría de etiquetas
fr: Mise en retrait d'étiquette
it: Rientro etichetta
ko: 레이블 들여쓰기
pl: Wcięcia etykiet
pt_br: Recuo do Rótulo
tr: Etiket Girintileme
zh_hans: 标签缩进
zh_hant: 標籤縮排

source: Place members in object initializers on new line
cs: Umístit členy v inicializátorech objektů na nový řádek
de: Elemente in Objektinitialisierern in neue Zeile setzen
es: Colocar miembros de inicializadores de objetos en nueva línea
fr: Placer les membres dans les initialiseurs d'objets sur une nouvelle ligne
it: Inserisci membri di inizializzatori di oggetto in una nuova riga
ko: 개체 이니셜라이저의 멤버를 새 줄에 배치
pl: Umieść składowe w inicjatorach obiektów w nowym wierszu
pt_br: Colocar membros em inicializadores de objetos em nova linha
tr: Nesne başlatıcısındaki üyeleri yeni satıra yerleştir
zh_hans: 将对象初始值设定项中的成员置于新行
zh_hant: 將物件初始設定式中的成員置於新行

source: Place open brace on new line for anonymous methods
cs: Pro anonymní metody umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für anonyme Methoden in neuer Zeile platzieren
es: Colocar llave de apertura para métodos anónimos en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les méthodes anonymes
it: Inserisci parentesi graffa di apertura in una nuova riga per i metodi anonimi
ko: 무명 메서드의 여는 중괄호를 새 줄에 배치
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla metod anonimowych
pt_br: Colocar chave de abertura em nova linha para métodos anônimos
tr: Anonim metotlar için açma küme ayracını yeni satıra yerleştir
zh_hans: 将匿名方法的左大括号置于新行
zh_hant: 將匿名方法的左括號置於新行

source: Place open brace on new line for anonymous types
cs: Pro anonymní typy umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für anonyme Typen in neuer Zeile platzieren
es: Colocar llave de apertura para tipos anónimos en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour des types anonymes
it: Inserisci parentesi graffa di apertura in una nuova riga per i tipi anonimi
ko: 익명 형식의 여는 중괄호를 새 줄에 배치
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla typów anonimowych
pt_br: Colocar chave de abertura em nova linha para tipos anônimos
tr: Anonim türler için açma küme ayracını yeni satıra yerleştir
zh_hans: 将匿名类型的左大括号置于新行
zh_hant: 將匿名類型的左括號置於新行

source: Place open brace on new line for control blocks
cs: Pro řídicí bloky umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für Kontrollblöcke in neuer Zeile platzieren
es: Colocar llave de apertura para bloques de control en nueva línea
fr: Placer l'accolade ouvrante sur une nouvelle ligne pour les blocs de contrôle
it: Inserisci parentesi graffa di apertura su nuova riga per i blocchi di controllo
ko: 제어 블록의 여는 중괄호를 새 줄에 배치
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla bloków sterowania
pt_br: Colocar chave de abertura em nova linha para blocos de controle
tr: Denetim blokları için açma küme ayracını yeni satıra yerleştir
zh_hans: 将控制块的左大括号置于新行
zh_hant: 將控制區塊的左括號置於新行

source: Place open brace on new line for lambda expression
cs: Pro lambda výraz umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für Lambdaausdruck in neue Zeile setzen
es: Colocar llave de apertura para expresión lambda en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour une expression lambda
it: Inserisci parentesi graffa di apertura in una nuova riga per espressioni lambda
ko: 람다 식의 여는 중괄호를 새 줄에 배치
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla wyrażenia lambda
pt_br: Colocar chave de abertura em nova linha para expressão lambda
tr: Lambda ifadesi için açma küme ayracını yeni satıra yerleştir
zh_hans: 将 lambda 表达式的左大括号置于新行
zh_hant: 將 Lambda 運算式的左括號置於新行

# Place_open_brace_on_new_line_for_methods_local_functions
source: Place open brace on new line for methods and local functions
cs: Pro metody a lokální funkce umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer in neuer Zeile für Methoden und lokale Funktionen einfügen
es: Poner la llave de apertura en una línea nueva para los métodos y las funciones locales
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les méthodes et les fonctions locales
it: Inserisci parentesi graffa di apertura su nuova riga per metodi e funzioni locali
ko: 메서드 및 로컬 함수의 여는 중괄호를 새 줄에 배치합니다.
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla metod i funkcji lokalnych
pt_br: Colocar chave de abertura na nova linha para métodos e funções locais
tr: Metotlar ve yerel işlemler için yeni satıra açma küme ayracı yerleştirin
zh_hans: 将方法和本地函数的左大括号置于新行
zh_hant: 將左大括號置於方法與區域函式的新行上

source: Place open brace on new line for types
cs: Pro typy umístit levou složenou závorku na nový řádek
de: Öffnende geschweifte Klammer für Typen in neuer Zeile platzieren
es: Colocar llave de apertura para tipos en nueva línea
fr: Placer une accolade ouvrante sur une nouvelle ligne pour les types
it: Inserisci parentesi graffa di apertura in una nuova riga per i tipi
ko: 형식의 여는 중괄호를 새 줄에 배치
pl: Umieść otwierający nawias klamrowy w nowym wierszu dla typów
pt_br: Colocar chave de abertura em nova linha para tipos
tr: Türler için açma küme ayracını yeni satıra yerleştir
zh_hans: 将类型的左大括号置于新行
zh_hant: 將類型的左括號置於新行

source: Place query expression clauses on new line
cs: Umístit klauzule dotazového výrazu na nový řádek
de: Klauseln von Abfrageausdrücken in neuer Zeile platzieren
es: Colocar cláusulas de expresiones de consulta en nueva línea
fr: Placer les clauses d'expression de requête sur une nouvelle ligne
it: Inserisci clausole di espressione di query in una nuova riga
ko: 쿼리 식의 절을 새 줄에 배치
pl: Umieść klauzule wyrażenia zapytania w nowym wierszu
pt_br: Colocar cláusulas de expressão de consulta na nova linha
tr: Sorgu ifadesi yan tümcesini yeni satıra yerleştir
zh_hans: 将查询表达式子句置于新行
zh_hant: 將查詢運算式子句置於新行

source: Leave statements and member declarations on the same line
cs: Nechat příkazy a deklarace členů na stejném řádku
de: Anweisungen und Memberdeklarationen auf der gleichen Zeile belassen
es: Mantener instrucciones y declaraciones de miembros en la misma línea
fr: Laisser les instructions et les déclarations de membre sur la même ligne
it: Lascia istruzioni e dichiarazioni di membri sulla stessa riga
ko: 문과 멤버 선언을 같은 줄에 유지
pl: Pozostaw instrukcje i deklaracje składowych w tym samym wierszu
pt_br: Deixar instruções e declarações de membros na mesma linha
tr: Deyimleri ve üye bildirimlerini aynı satırda bırak
zh_hans: 将语句和成员声明保留在同一行上
zh_hant: 讓陳述式與成員宣告維持在同一行

source: Insert space before and after binary operators
cs: Vložit mezeru před a za binární operátory
de: Leerzeichen vor und nach binären Operatoren einfügen
es: Insertar espacio delante y detrás de operadores binarios
fr: Insérer un espace avant et après les opérateurs binaires
it: Inserisci spazio prima e dopo gli operatori binari
ko: 이항 연산자의 앞뒤에 공백 삽입
pl: Wstaw spację przed operatorami binarnymi i po nich
pt_br: Inserir espaço antes e depois de operadores binários
tr: İkili operatörlerden önce ve sonra boşluk ekle
zh_hans: 在二元运算符前后插入空格
zh_hant: 在二元運算子前後插入空格

source: Ignore spaces around binary operators
cs: Ignorovat mezery okolo binárních operátorů
de: Leerzeichen um binäre Operatoren ignorieren
es: Omitir espacios alrededor de operadores binarios
fr: Ignorer les espaces autour des opérateurs binaires
it: Ignora spazi intorno agli operatori binari
ko: 이항 연산자 주위의 공백 무시
pl: Ignoruj spacje dookoła operatorów binarnych
pt_br: Ignorar espaços em torno de operadores binários
tr: İkili operatörlerin çevresindeki boşlukları yoksay
zh_hans: 忽略二元运算符前后的空格
zh_hant: 忽略二元運算子前後空格

source: Remove spaces before and after binary operators
cs: Odebrat mezery před a po binárních operátorech
de: Leerzeichen vor und nach binären Operatoren entfernen
es: Quitar espacios delante y detrás de operadores binarios
fr: Supprimer les espaces avant et après les opérateurs binaires
it: Rimuovi gli spazi prima e dopo gli operatori binari
ko: 이항 연산자 앞뒤의 공백 제거
pl: Usuń spacje przed operatorami binarnymi i po nich
pt_br: Remover espaços antes e depois de operadores binários
tr: İkili operatörlerden önce ve sonra boşlukları kaldır
zh_hans: 删除二元运算符前后的空格
zh_hant: 移除二元運算子前後空格

source: Insert space after colon for base or interface in type declaration
cs: Vložit mezeru po dvojtečce pro základní typ nebo rozhraní v deklaraci typu
de: In Typdeklarationen Leerzeichen nach Doppelpunkt für Basis oder Schnittstelle einfügen
es: Insertar espacio tras dos puntos para base o interfaz en una declaración de tipo
fr: Insérer un espace après le signe deux-points pour base ou interface dans une déclaration de type
it: Inserisci spazio dopo i due punti per base o interfaccia nella dichiarazione di tipo
ko: 형식 선언의 기본 또는 인터페이스에 대한 콜론 뒤에 공백 삽입
pl: Wstaw spację po dwukropku dla elementu base lub interface w deklaracji typu
pt_br: Inserir espaço após dois-pontos para base ou interface na declaração de tipo
tr: Tür bildiriminde base veya interface için iki noktadan sonra boşluk ekle
zh_hans: 在类型声明中的“base”或接口的冒号后插入空格
zh_hant: 在類型宣告中的基底或介面冒號後面插入空格

source: Insert space after comma
cs: Vložit mezeru za čárku
de: Leerzeichen nach Komma einfügen
es: Insertar espacio tras coma
fr: Insérer un espace après la virgule
it: Inserisci spazio dopo la virgola
ko: 쉼표 뒤에 공백 삽입
pl: Wstaw spację po przecinku
pt_br: Inserir espaço após vírgula
tr: Virgülden sonra boşluk ekle
zh_hans: 在逗号后插入空格
zh_hant: 在逗號後面插入空格

source: Insert space after dot
cs: Vložit mezeru za tečku
de: Leerzeichen nach Punkt einfügen
es: Insertar espacio tras punto
fr: Insérer un espace après le point
it: Inserisci spazio dopo il punto
ko: 점 뒤에 공백 삽입
pl: Wstaw spację po kropce
pt_br: Inserir espaço após ponto
tr: Noktadan sonra boşluk ekle
zh_hans: 在点后插入空格
zh_hant: 在點 (.) 後面插入空格

source: Insert space after semicolon in "for" statement
cs: Vložit mezeru za středníkem v příkazu for
de: In for-Anweisung Leerzeichen nach Semikolon einfügen
es: Insertar espacio tras punto y coma en instrucción "for"
fr: Insérer un espace après le point-virgule dans une instruction "for"
it: Inserisci spazio dopo il punto e virgola nell'istruzione "for"
ko: "for" 문의 세미콜론 뒤에 공백 삽입
pl: Wstaw spację po średniku w instrukcji „for”
pt_br: Inserir espaço após ponto e vírgula em instruções "for"
tr: "for" deyiminde noktalı virgülden sonra boşluk ekle
zh_hans: 在“for”语句中的分号后插入空格
zh_hant: 在 "for" 陳述式中的分號後面插入空格

source: Insert space before colon for base or interface in type declaration
cs: Vložit mezeru před dvojtečku pro základní typ nebo rozhraní v deklaraci typu
de: In Typdeklarationen Leerzeichen vor Doppelpunkt für Basis oder Schnittstelle einfügen
es: Insertar espacio delante de dos puntos para base o interfaz en una declaración de tipo
fr: Insérer un espace avant le signe deux-points pour base ou interface dans une déclaration de type
it: Inserisci spazio prima dei due punti per base o interfaccia nella dichiarazione di tipo
ko: 형식 선언의 기본 또는 인터페이스에 대한 콜론 앞에 공백 삽입
pl: Wstaw spację przed dwukropkiem dla elementu base lub interface w deklaracji typu
pt_br: Inserir espaço antes de dois-pontos para base ou interface na declaração de tipo
tr: Tür bildiriminde base veya interface için iki noktadan önce boşluk ekle
zh_hans: 在类型声明中的“base”或接口的冒号前插入空格
zh_hant: 在類型宣告中的基底或介面冒號前面插入空格

source: Insert space before comma
cs: Vložit mezeru před čárku
de: Leerzeichen vor Komma einfügen
es: Insertar espacio delante de coma
fr: Insérer un espace avant la virgule
it: Inserisci spazio prima della virgola
ko: 쉼표 앞에 공백 삽입
pl: Wstaw spację przed przecinkiem
pt_br: Inserir espaço antes da vírgula
tr: Virgülden önce boşluk ekle
zh_hans: 在逗号前插入空格
zh_hant: 在逗號前面插入空格

source: Insert space before dot
cs: Vložit mezeru před tečku
de: Leerzeichen vor Punkt einfügen
es: Insertar espacio delante de punto
fr: Insérer un espace avant le point
it: Inserisci spazio prima del punto
ko: 점 앞에 공백 삽입
pl: Wstaw spację przed kropką
pt_br: Inserir espaço antes do ponto
tr: Noktadan önce boşluk ekle
zh_hans: 在点前插入空格
zh_hant: 在點 (.) 前面插入空格

source: Insert space before semicolon in "for" statement
cs: Vložit mezeru před středník v příkazu for
de: In for-Anweisung Leerzeichen vor Semikolon einfügen
es: Insertar espacio delante de punto y coma en instrucciones "for"
fr: Insérer un espace avant le point-virgule dans une instruction "for"
it: Inserisci spazio prima del punto e virgola nell'istruzione "for"
ko: "for" 문의 세미콜론 앞에 공백 삽입
pl: Wstaw spację przed średnikiem w instrukcji „for”
pt_br: Inserir espaço antes de ponto e vírgula em instruções "for"
tr: "for" deyiminde noktalı virgülden önce boşluk ekle
zh_hans: 在“for”语句中的分号前插入空格
zh_hant: 在 "for" 陳述式中的分號前面插入空格

source: Insert space within argument list parentheses
cs: Vložit mezeru mezi kulaté závorky seznamu argumentů
de: Leerzeichen zwischen runden Klammern um Argumentliste einfügen
es: Insertar espacio entre paréntesis de la lista de argumentos
fr: Insérer un espace dans les parenthèses de la liste d'arguments
it: Inserisci spazio tra le parentesi dell'elenco di argomenti
ko: 인수 목록 괄호의 내부에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów listy argumentów
pt_br: Inserir espaço dentro dos parênteses da lista de argumentos
tr: Bağımsız değişken listesi ayraçları içine boşluk ekle
zh_hans: 在参数列表的括号中插入空格
zh_hant: 在引數清單括號內插入空格

source: Insert space within empty argument list parentheses
cs: Vložit mezeru mezi kulaté závorky prázdného seznamu argumentů
de: Leerzeichen zwischen runden Klammern um leere Argumentliste einfügen
es: Insertar espacio entre paréntesis vacíos de la lista de argumentos
fr: Insérer un espace dans les parenthèses de la liste d'arguments vide
it: Inserisci spazio tra le parentesi dell'elenco di argomenti vuoto
ko: 빈 인수 목록 괄호 내부에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów pustej listy argumentów
pt_br: Inserir espaço dentro dos parênteses da lista de argumentos vazia
tr: Boş bağımsız değişken listesi ayraçları içine boşluk ekle
zh_hans: 在空参数列表的括号中插入空格
zh_hant: 在空的引數清單括號內插入空格

source: Insert space within empty parameter list parentheses
cs: Vložit mezeru mezi kulaté závorky prázdného seznamu parametrů
de: Leerzeichen zwischen runden Klammern in leere Parameterliste einfügen
es: Insertar espacio entre paréntesis vacíos de la lista de parámetros
fr: Insérer un espace dans les parenthèses vides de la liste de paramètres
it: Inserisci spazio tra le parentesi dell'elenco di parametri vuoto
ko: 빈 매개 변수 목록 괄호 내에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów pustej listy parametrów
pt_br: Inserir espaço no parênteses da lista de parâmetros vazia
tr: Boş parametre listesi ayraçları içine boşluk ekle
zh_hans: 在空参数列表的括号中插入空格
zh_hant: 在空白參數清單括號內插入空格

source: Insert space within parameter list parentheses
cs: Vložit mezeru mezi kulaté závorky seznamu parametrů
de: Leerzeichen zwischen runden Klammern in Parameterliste einfügen
es: Insertar espacio entre paréntesis de la lista de parámetros
fr: Insérer un espace dans les parenthèses de la liste de paramètres
it: Inserisci spazio tra le parentesi dell'elenco di parametri
ko: 매개 변수 목록 괄호 내에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów listy parametrów
pt_br: Inserir espaço dentro dos parênteses da lista de parâmetros
tr: Parametre listesi ayraçları içine boşluk ekle
zh_hans: 在参数列表的括号中插入空格
zh_hant: 在參數清單括號內插入空格

source: Insert space after keywords in control flow statements
cs: Vkládat mezeru po klíčových slovech v příkazech toku řízení
de: Leerzeichen nach Schlüsselwörtern in Anweisungen für die Ablaufsteuerung einfügen
es: Insertar espacio después de las palabras clave en instrucciones de flujo de control
fr: Insérer un espace après les mots clés dans les instructions de flux de contrôle
it: Inserisci spazio dopo le parole chiave nelle istruzioni del flusso di controllo
ko: 제어 흐름 문의 키워드 뒤에 공백 삽입
pl: Wstaw spację po słowach kluczowych w instrukcjach przepływu sterowania
pt_br: Inserir espaço após palavras-chave em instruções de fluxo de controle
tr: Denetim akışı deyimlerinde anahtar sözcüklerden sonra boşluk ekle
zh_hans: 在控制流语句中的关键字后面插入空格
zh_hant: 在控制流程陳述式中的關鍵字後面插入空格

source: Insert space within parentheses of expressions
cs: Vložit mezeru mezi kulaté závorky výrazů
de: Leerzeichen zwischen runden Klammern von Ausdrücken einfügen
es: Insertar espacio entre paréntesis de expresiones
fr: Insérer un espace dans les parenthèses d'expressions
it: Inserisci spazio tra le parentesi delle espressioni
ko: 식의 괄호 내부에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów wyrażeń
pt_br: Inserir espaços dentro dos parênteses das expressões
tr: İfadelerin ayraçları içine boşluk ekle
zh_hans: 在表达式的括号中插入空格
zh_hant: 在運算式的括號內插入空格

source: Insert space after cast
cs: Vložit mezeru po přetypování
de: Leerzeichen nach Umwandlung einfügen
es: Insertar espacio tras conversión
fr: Insérer un espace après le cast
it: Inserisci spazio dopo il cast
ko: 캐스트 뒤에 공백 삽입
pl: Wstaw spację po rzutowaniu
pt_br: Inserir espaço após conversão
tr: Atamadan sonra boşluk ekle
zh_hans: 在强制转换后插入空格
zh_hant: 在轉換後面插入空格

source: Insert spaces within parentheses of control flow statements
cs: Vložit mezery mezi kulaté závorky příkazů řízení toku
de: Leerzeichen zwischen den Klammern von Ablaufsteuerungsanweisungen einfügen
es: Insertar espacios entre paréntesis de instrucciones de flujo de control
fr: Insérer des espaces à l'intérieur des parenthèses des instructions de flux de contrôle
it: Inserisci spazi all'interno delle parentesi delle istruzioni del flusso di controllo
ko: 제어 흐름 문의 괄호 내부에 공백 삽입
pl: Wstaw spacje wewnątrz nawiasów instrukcji przepływu sterowania
pt_br: Inserir espaços dentro dos parênteses das instruções de fluxo de controle
tr: Denetim akışı deyimlerinin ayraçları içine boşluk ekle
zh_hans: 在控制流语句的括号中插入空格
zh_hant: 在控制流程陳述式的括號內插入空格

source: Insert space within parentheses of type casts
cs: Vložit mezeru mezi kulaté závorky přetypování
de: Leerzeichen zwischen runde Klammern für Typumwandlungen einfügen
es: Insertar espacio entre paréntesis de conversiones de tipo
fr: Insérer un espace dans les parenthèses de casts de type
it: Inserisci spazio tra le parentesi dei cast di tipo
ko: 형식 캐스팅의 괄호 내부에 공백 삽입
pl: Wstaw spację wewnątrz nawiasów rzutowania typu
pt_br: Inserir espaço dentro dos parênteses das conversões de tipo
tr: Tür atamalarının ayraçları içine boşluk ekle
zh_hans: 在类型转换的括号中插入空格
zh_hant: 在類型轉換的括號內插入空格

source: Ignore spaces in declaration statements
cs: Ignorovat mezery ve výpisech deklarací
de: Leerzeichen um Deklarationsanweisungen ignorieren
es: Omitir espacios en instrucciones de declaración
fr: Ignorer les espaces dans les instructions de déclaration
it: Ignora gli spazi nelle istruzioni di dichiarazione
ko: 선언문의 공백 무시
pl: Ignoruj spacje w instrukcjach deklaracji
pt_br: Ignorar espaços em instruções de declaração
tr: Bildirim deyimlerindeki boşlukları yoksay
zh_hans: 忽略声明语句中的空格
zh_hant: 忽略宣告陳述式中的空格

source: Set other spacing options
cs: Nastavit další možnosti mezer
de: Weitere Abstandsoptionen festlegen
es: Establecer otras opciones de espaciado
fr: Définir d'autres options d'espacement
it: Imposta altre opzioni di spaziatura
ko: 기타 간격 옵션을 설정합니다.
pl: Ustaw inne opcje odstępów
pt_br: Definir outras opções de espaçamento
tr: Diğer boşluk seçeneklerini ayarla
zh_hans: 设置其他间距选项
zh_hant: 設定其他間距選項

source: Set spacing for brackets
cs: Nastavit mezery pro hranaté závorky
de: Abstände für eckige Klammern festlegen
es: Establecer espaciado para corchetes
fr: Définir l'espacement des crochets
it: Imposta spaziatura per parentesi quadre
ko: 대괄호의 간격을 설정합니다.
pl: Ustaw odstępy dla nawiasów
pt_br: Definir espaçamento para colchetes
tr: Köşeli ayraçlar için boşlukları ayarla
zh_hans: 设置中括号的间距
zh_hant: 設定括號間距

source: Set spacing for delimiters
cs: Nastavit mezery pro oddělovače
de: Abstand für Trennzeichen
es: Establecer espaciado para delimitadores
fr: Définir l'espacement des délimiteurs
it: Imposta spaziatura per delimitatori
ko: 구분 기호의 간격을 설정합니다.
pl: Ustaw odstępy dla ograniczników
pt_br: Definir espaçamento para delimitadores
tr: Sınırlayıcılar için boşlukları ayarla
zh_hans: 设置分隔符的间距
zh_hant: 設定分隔符號的間距

source: Set spacing for method calls
cs: Nastavit mezery pro volání metod
de: Abstände für Methodenaufrufe festlegen
es: Establecer espaciado para llamadas a métodos
fr: Définir l'espacement des appels de méthode
it: Imposta spaziatura per le chiamate a un metodo
ko: 메서드 호출의 간격을 설정합니다.
pl: Ustaw odstępy dla wywołań metod
pt_br: Definir espaçamento para chamadas de método
tr: Metot çağrıları için boşlukları ayarla
zh_hans: 设置方法调用的间距
zh_hant: 設定方法呼叫間距

source: Set spacing for method declarations
cs: Nastavit mezery pro deklarace metod
de: Abstände für Methodendeklarationen festlegen
es: Establecer espaciado para declaraciones de método
fr: Définir l'espacement des déclarations de méthode
it: Imposta spaziatura per dichiarazioni di metodi
ko: 메서드 선언의 간격을 설정합니다.
pl: Ustaw odstępy dla deklaracji metod
pt_br: Definir espaçamento para declarações de método
tr: Metot bildirimleri için boşlukları ayarla
zh_hans: 设置方法声明的间距
zh_hant: 設定方法宣告間距

source: Set spacing for operators
cs: Nastavit mezery pro operátory
de: Abstände für Operatoren festlegen
es: Establecer espaciado para operadores
fr: Définir l'espacement des opérateurs
it: Imposta spaziatura per operatori
ko: 연산자의 간격을 설정합니다.
pl: Ustaw odstępy dla operatorów
pt_br: Definir espaçamento para operadores
tr: Operatörler için boşlukları ayarla
zh_hans: 设置运算符的间距
zh_hant: 設定運算子間距

source: Insert spaces within square brackets
cs: Vložit mezery mezi hranaté závorky
de: Leerzeichen zwischen eckigen Klammern einfügen
es: Insertar espacios entre corchetes
fr: Insérer des espaces dans des crochets
it: Inserisci spazi tra parentesi quadre
ko: 대괄호 내부에 공백 삽입
pl: Wstaw spacje wewnątrz nawiasów kwadratowych
pt_br: Inserir espaços dentro de colchetes
tr: Köşeli ayraçlar içine boşluk ekle
zh_hans: 在方括号中插入空格
zh_hant: 在方括號中插入空格
