Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Change completion list settings;Pre-select most recently used member; Completion Lists; Show completion list after a character is typed; Show completion list after a character is deleted; Automatically show completion list in argument lists (experimental); Highlight matching portions of completion list items; Show completion item filters; Automatically complete statement on semicolon; Snippets behavior; Never include snippets; Always include snippets; Include snippets when ?-Tab is typed after an identifier; Enter key behavior; Never add new line on enter; Only add new line on enter after end of fully typed word; Always add new line on enter; Show name suggestions; Show items from unimported namespaces (experimental);
cs: Změnit nastavení pro seznam dokončení;Předvolit naposledy použitou položku; Seznamy dokončení; Po zadání znaku zobrazit seznam dokončení; Po odstranění znaku zobrazit seznam dokončení; Automaticky zobrazovat seznam dokončení v seznamech argumentů (experimentální); Zvýraznit odpovídající části položek seznamu dokončení; Zobrazit filtry položek dokončení; Automaticky dokončit příkaz středníkem; Chování fragmentů; Nikdy nezahrnovat fragmenty; Vždy zahrnovat fragmenty; Zahrnovat fragmenty po zadání ?-Tab za identifikátor; Chování klávesy Enter; Při stisknutí klávesy Enter nikdy nepřidávat nový řádek; Při stisknutí klávesy Enter přidat nový řádek jenom po dopsání celého slova; Při stisknutí klávesy Enter vždy přidat nový řádek; Zobrazovat návrhy názvů; Zobrazit položky z neimportovaných oborů názvů (experimentální);
fr: Changer les paramètres de la liste de complétion;Présélectionner le dernier membre utilisé récemment;Listes de complétion; Afficher la liste de complétion une fois qu'un caractère a été tapé ; Afficher la liste de complétion après la suppression d'un caractère ; Afficher automatiquement la liste de complétion dans les listes d'arguments (expérimental) ; Mettre en surbrillance les parties correspondantes des éléments de liste de complétion ; Afficher les filtres d'éléments de complétion ; Effectuer la complétion automatique de l'instruction après l'entrée d'un point-virgule ; Comportement des extraits ; Ne jamais inclure d'extraits ; Toujours inclure les extraits ; Inclure les extraits quand ?-Tab est tapé après un identificateur ; Comportement de la touche Entrée ; Ne jamais ajouter de nouvelle ligne après Entrée ; Ajouter uniquement une nouvelle ligne une fois que la touche Entrée a été enfoncée à la fin du mot complet tapé ; Toujours ajouter une nouvelle ligne après Entrée ; Afficher les suggestions de nom ; Afficher les éléments des espaces de noms qui ne sont pas importés (expérimental) ;
it: Modifica impostazioni dell'elenco di completamento;Preseleziona membri usati di recente; Elenchi di completamento; Mostra elenco di completamento dopo la digitazione di un carattere; Mostra elenco di completamento dopo l'eliminazione di un carattere; Mostra automaticamente l'elenco di completamento negli elenchi di argomenti (sperimentale); Evidenzia le parti corrispondenti di voci dell'elenco di completamento; Mostra i filtri per le voci di completamento; Completa automaticamente istruzione dopo punto e virgola; Comportamento dei frammenti; Non includere mai i frammenti; Includi sempre i frammenti; Includi i frammenti quando si digita ?+TAB dopo un identificatore; Comportamento del tasto INVIO; Non aggiungere mai una nuova riga dopo INVIO; Aggiungi una nuova riga dopo INVIO solo alla fine della parola digitata; Aggiungi sempre una nuova riga dopo INVIO; Mostra suggerimenti per nomi; Mostra elementi da spazi dei nomi non importati (sperimentale);
ja: 入力候補一覧の設定を変更する;最近使用されたメンバーをあらかじめ選択する; 入力候補一覧; 文字が入力された後に入力候補一覧を表示する; 文字が削除された後に入力候補一覧を表示する; 引数リストに入力候補一覧を自動的に表示する (試験段階); 入力候補一覧の項目の一致している部分を強調表示する; 入力候補の項目フィルターを表示する; セミコロンでステートメントをオートコンプリートに設定する; スニペットの動作; スニペットを含めない; 常にスニペットを含める; 識別子の後に ? Tab を入力したときにスニペットを含める; Enter キー入力時動作; Enter キーで新しい行を追加しない; 単語を完全に入力した後のみ、Enter キーで新しい行を追加する; Enter キーで常に新しい行を追加する; 名前の提案を表示する; 未インポートの名前空間からの項目を表示する (試験段階);
ko: 완성 목록 설정 변경;가장 최근에 사용한 멤버 미리 선택; 완성 목록; 문자를 입력하면 완성 목록 표시; 문자를 삭제하면 완성 목록 표시; 인수 목록에 자동으로 완성 목록 표시(실험적); 완성 목록 항목에서 일치하는 부분 강조 표시; 완성 항목 필터 표시; 세미콜론 입력 시 자동으로 문 완성; 코드 조각 동작; 코드 조각 포함 안 함; 코드 조각 항상 포함; 식별자 뒤에 ?-Tab을 입력하면 코드 조각 포함; <Enter> 키 동작; <Enter> 키를 누를 때 새 줄 추가 안 함; 단어를 모두 입력한 후 <Enter> 키를 누를 때만 새 줄 추가; <Enter> 키를 누를 때 항상 새 줄 추가; 이름 제안 표시; 가져오지 않은 네임스페이스의 항목 표시(실험적);
tr: Tamamlama listesi ayarlarını değiştir;Son kullanılan üyeyi önceden seç; Tamamlama Listeleri; Bir karakter yazıldıktan sonra tamamlama listesini göster; Bir karakter silindikten sonra tamamlama listesini göster; Bağımsız değişken listelerinde tamamlama listelerini otomatik olarak göster (deneysel); Tamamlama listesi öğelerinin eşleşen kısımlarını vurgula; Tamamlama öğesi filtrelerini göster; Deyimi noktalı virgülle otomatik olarak tamamla; Kod parçacığı davranışı; Kod parçacıklarını hiçbir zaman dahil etme; Kod parçacıklarını her zaman dahil et; Bir tanımlayıcıdan sonra ?- yazılıp Sekme tuşuna basılırsa kod parçacıklarını dahil et; Enter tuşu davranışı; Enter tuşuna basıldığında hiçbir zaman yeni satır ekleme; Enter tuşuna basıldığında yalnızca tam bir kelime yazılmışsa sonuna yeni satır ekle; Enter tuşuna basıldığında her zaman yeni satır ekle; Ad önerilerini göster; İçeri aktarılmamış ad alanlarındaki öğeleri göster (deneysel);

source: Formatting
cs: Formátování
de: Formatierung
es: Formato
fr: Mise en forme
it: Formattazione
ja: 書式設定
ko: 서식
pl: Formatowanie
pt_br: Formatação
ru: Форматирование
tr: Biçimlendirme
zh_hans: 格式设置
zh_hant: 格式化

source: General
cs: Obecné
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pl: Ogólne
pt_br: Geral
ru: Общие
tr: Genel
zh_hans: 常规
zh_hant: 一般

source: Indentation
cs: Odsazení
de: Einzug
es: Sangría
fr: Retrait
it: Rientro
ja: インデント
ko: 들여쓰기
pl: Wcięcia
pt_br: Recuo
ru: Отступ
tr: Girinti
zh_hans: 缩进
zh_hant: 縮排

source: Wrapping
cs: Zalamování
de: Umbruch
es: Ajuste
fr: Enveloppement
it: Ritorno a capo
ja: 折り返し
ko: 래핑
pl: Zawijanie
pt_br: Quebra de linha
ru: Перенос по словам
tr: Kaydırma
zh_hans: 换行
zh_hant: 換行

source: New Lines
cs: Nové řádky
de: Neue Zeilen
es: Nuevas líneas
fr: Nouvelles lignes
it: Nuove righe
ja: 改行
ko: 줄 추가
pl: Nowe wiersze
pt_br: Novas Linhas
ru: Новые строки
tr: Yeni Satırlar
zh_hans: 新行
zh_hant: 新行

source: Spacing
cs: Mezery
de: Abstand
es: Espaciado
fr: Espacement
it: Spaziatura
ja: スペース
ko: 간격
pl: Odstępy
pt_br: Espaçamento
ru: Интервалы
tr: Boşluklar
zh_hans: 间距
zh_hant: 間距

source: C# Editor
cs: Editor C#
es: Editor de C#
fr: C# - Éditeur
it: Editor C#
ja: C# エディター
ko: C# 편집기
pl: Edytor C#
pt_br: Editor C#
ru: Редактор C#
tr: C# Düzenleyicisi
zh_hans: C# 编辑器
zh_hant: C# 編輯器

source: C# Editor with Encoding
cs: Editor C# s kódováním
de: C#-Editor mit Codierung
es: Editor de C# con Encoding
fr: Éditeur C# avec encodage
it: Editor C# con codifica
ja: エンコード付き C# エディター
ko: C# 편집기(인코딩 사용)
pl: Edytor C# z kodowaniem
pt_br: Editor C# com Codificação
ru: Редактор C# с кодировкой
tr: Kodlamalı C# Düzenleyicisi
zh_hans: 带编码功能的 C# 编辑器
zh_hant: 具備編碼功能的 C# 編輯器

source: Code Style
cs: Styl kódu
de: Codeformat
es: Estilo de código
fr: Style de code
it: Stile codice
ja: コード スタイル
ko: 코드 스타일
pl: Styl kodu
pt_br: Estilo do Código
ru: Стиль кода
tr: Kod Stili
zh_hans: 代码样式
zh_hant: 程式碼樣式

source: Style;Qualify;This;Code Style;var;member access;locals;parameters;var preferences;predefined type;framework type;built-in types;when variable type is apparent;elsewhere;qualify field access;qualify property access; qualify method access;qualify event access;
cs: Styl;Kvalifikovat;This;Styl kódu;var;přístup člena;lokální;parametry;předvolby pro var;předdefinovaný typ;typ platformy;vestavěné typy;pokud je typ proměnné zřejmý;jinde;kvalifikovat přístup k poli;kvalifikovat přístup k vlastnosti;kvalifikovat přístup k metodě;kvalifikovat přístup k události;
de: Stil;Qualifizieren;This;Codestil;var;Memberzugriff;lokale Variablen;Parameter;var-Einstellungen;vordefinierter Typ;Frameworktyp;integrierte Typen;wenn der Variablentyp offensichtlich ist;elsewhere;Feldzugriff qualifizieren;Eigenschaftenzugriff qualifizieren; Methodenzugriff qualifizieren;Ereigniszugriff qualifizieren;
es: Estilo;Calificar;This;Estilo de código;var;acceso a miembros;variables locales;parámetros;preferencias para var;tipo predefinido;tipo de marco;tipos integrados;cuando el tipo de variable es evidente;en cualquier otro lugar;calificar acceso a campos;calificar acceso a propiedades;calificar acceso a métodos;calificar acceso a eventos;
fr: Style;Qualifier;This;Style de code;var;accès au membre;variables locales;paramètres;préférences de variable;type prédéfini;type d'infrastructure;types intégrés;quand le type de variable est apparent;ailleurs;qualifier l'accès aux champs;qualifier l'accès aux propriétés; qualifier l'accès aux méthodes;qualifier l'accès aux événements;
it: Stile;Qualifica;This;Stile codice;var;accesso ai membri;variabili locali;parametri;preferenze var;tipo predefinito;tipo di framework;tipi predefiniti;quando il tipo della variabile è apparente;altrove;qualifica l'accesso ai campi;qualifica l'accesso alle proprietà; qualifica l'accesso ai metodi;qualifica l'accesso agli eventi;
ja: スタイル;修飾;This;コード スタイル;var;メンバー アクセス;ローカル;パラメーター;var の設定;事前定義された型;フレームワーク型;ビルトイン型;変数の型が明確な場合;他の場合;フィールド アクセスの修飾;プロパティ アクセスの修飾; メソッド アクセスの修飾;イベント アクセスの修飾;
ko: 스타일;한정;This;코드 스타일;var;멤버 액세스;로컬;매개 변수;var 기본 설정;미리 정의된 형식;프레임워크 형식;기본 제공 형식;변수 형식이 명백한 경우;다른 위치;필드 액세스 한정;속성 액세스 한정; 메서드 액세스 한정;이벤트 액세스 한정;
pl: Styl;Kwalifikuj;This;Styl kodu;var;dostęp do składowej;zmienne lokalne;parametry;preferencje zmiennej;wstępnie zdefiniowany typ;typ platformy;typy wbudowane;gdy typ zmiennej jest znany;w innym miejscu;kwalifikator dostępu do pola;kwalifikator dostępu do właściwości;kwalifkator dostępu do metody;kwalifikator dostępu do zdarzenia;
pt_br: Estilo;Qualificar;Esse;Código Estilo;var;acesso de membro;locais;parâmetro;var preferências;tipo predefinido;tipo de estrutura;tipos internos;quando o tipo de variável é aparente;outro lugar;qualificar acesso ao campo;qualificar acesso à propriedade; qualificar método de acesso;qualificar acesso ao evento;
ru: Стиль;Соответствовать;Этот;Стиль кода;переменная;доступ к члену;локальные переменные;параметры;предпочтения переменных;предопределенный тип;тип платформы;встроенные типы;когда тип переменной является вероятным;в другом месте;определение доступа к полям;определение доступа к свойствам; определение доступа к методам;определение доступа к событиям;
tr: Stil;Nitele;This;Kod Stili;var;üye erişimi;yerel öğeler;parametreler;var tercihleri;önceden tanımlanmış tür;çerçeve türü;yerleşik türler;değişken türü belirgin olduğunda;başka bir yerde;alan erişimini nitele;özellik erişimini nitele; metot erişimini nitele;olay erişimini nitele;
zh_hans: 样式;限定;This;代码样式;var;成员访问;局部变量;参数;var 首选项;预定义类型;框架类型;内置类型;当变量类型明显时;别处;限定字段访问;限定属性访问;限定方法访问;限定事件访问;
zh_hant: 樣式;限定;此;程式碼樣式;var;成員存取權;本機;參數;var 偏好;預先定義的類型;架構類型;內建類型;當變數類型明顯時;其他地方;限定欄位存取權;限定屬性存取權;限定方法存取權;限定事件存取權;

source: Naming
cs: Pojmenování
de: Benennung
es: Nomenclatura
fr: Affectation de noms
it: Denominazione
ja: 名前指定
ko: 명명
pl: Nazewnictwo
pt_br: Nomenclatura
ru: Именование
tr: Adlandırma
zh_hans: 命名
zh_hant: 命名

source: Naming Style;Name Styles;Naming Rule;Naming Conventions
cs: Styl pojmenování;Styly názvů;Pravidlo pojmenování;Konvence pojmenování
de: Benennungsstil;Namenstile;Benennungsregel;Namenskonventionen
es: Estilo de nomenclatura;Estilos de nombre;Regla de nomenclatura;Convenciones de nomenclatura
fr: Style de nommage;Styles de nom;Règle de nommage;Conventions de nommage
it: Stile di denominazione;Stili nomi;Regola di denominazione;Convenzioni di denominazione
ja: 名前付けのスタイル;名前のスタイル;名前付けルール;名前付けの規則
ko: 명명 스타일;이름 스타일;명명 규칙;명명 규칙
pl: Styl nazewnictwa;Style nazw;Reguła nazewnictwa;Konwencje nazewnictwa
pt_br: Estilo de Nomenclatura;Estilos de Nome;Regra de Nomenclatura;Convenções de Nomenclatura
ru: Стиль именования;стили имен;правило именования;соглашения об именовании
tr: Adlandırma Stili;Adlandırma Stilleri;Adlandırma Kuralı;Adlandırma Kuralları
zh_hans: 命名样式;名称样式;命名规则;命名约定
zh_hant: 命名樣式;命名樣式;命名規則;命名慣例

source: C# Tools
cs: Nástroje C#
es: Herramientas de C#
fr: Outils C#
it: Strumenti C#
ja: C# ツール
ko: C# 도구
pl: Narzędzia języka C#
pt_br: Ferramentas C#
ru: Инструменты C#
tr: C# Araçları
zh_hans: C# 工具
zh_hant: C# 工具

source: C# components used in the IDE. Depending on your project type and settings, a different version of the compiler may be used.
cs: Komponenty C# použité v IDE. V závislosti na typu vašeho projektu a nastavení se může použít jiná verze kompilátoru.
de: C#-Komponenten, die in der IDE verwendet werden. Abhängig von Ihrem Projekttyp und den zugehörigen Einstellungen kann eine andere Version des Compilers verwendet werden.
es: Los componentes de C# utilizados en el IDE. En función del tipo de proyecto y la configuración, se podría utilizar una versión diferente del compilador.
fr: Composants C# utilisés dans l'IDE. Selon votre type de projet et vos paramètres, une version différente du compilateur peut être utilisée.
it: Componenti di C# usati nell'IDE. A seconda del tipo e delle impostazioni del processo, è possibile che venga usata una versione diversa del compilatore.
ja: IDE で使用する C# コンポーネント。プロジェクトの種類や設定に応じて、異なるバージョンのコンパイラを使用できます。
ko: IDE에서 사용되는 C# 구성 요소입니다. 프로젝트 형식 및 설정에 따라 다른 버전의 컴파일러를 사용할 수 있습니다.
pl: Składniki języka C# używane w środowisku IDE. Zależnie od typu projektu i jego ustawień może być używana inna wersja kompilatora.
pt_br: Componentes de C# usados no IDE. Dependendo do seu tipo de projeto e configurações, uma versão diferente do compilador poderá ser usada.
ru: Компоненты C#, используемые в интегрированной среде разработки. В зависимости от типа и настроек проекта могут использоваться различные версии компилятора.
tr: IDE’de kullanılan C# bileşenleri. Projenizin türüne ve ayarlarına bağlı olarak, derleyicinin farklı bir sürümü kullanılabilir.
zh_hans: IDE 中使用的 C# 组件。可能使用其他版本的编译器，具体取决于你的项目类型和设置。
zh_hant: 在 IDE 中使用的 C# 元件。根據您的專案類型與設定，可能會使用其他版本的編譯器。

source: Always add new line on enter
cs: Při stisku Enter vždy přidat nový řádek
de: Nach Drücken der EINGABETASTE immer neue Zeile hinzufügen
it: Aggiungi sempre una nuova riga dopo INVIO
ko: 입력 시 새 줄 항상 추가
tr: Enter'a basıldığında her zaman yeni satır ekle

source: Always include snippets
cs: Vždy zahrnovat fragmenty
de: Schnipsel immer einschließen
it: Includi sempre i frammenti
ko: 코드 조각 항상 포함
tr: Kod parçacıklarını her zaman dahil et

source: Default
cs: Výchozí
de: Standard
it: Predefinito
ko: 기본값
tr: Varsayılan

source: Include snippets when Tab is typed after an identifier
cs: Zahrnout fragmenty kódu při zadání tabulátoru za identifikátor
de: Ausschnitte einschließen, wenn Tab nach einem Bezeichner eingegeben wird
it: Includi i frammenti quando si digita Tab dopo un identificatore
ko: 식별자 뒤에 Tab을 입력하면 코드 조각 포함
tr: Bir tanımlayıcıdan sonra Tab yazılırsa kod parçacıklarını dahil et

source: Never add new line on enter
cs: Při stisku Enter nikdy nepřidávat nový řádek
de: Nach Drücken der EINGABETASTE niemals neue Zeile hinzufügen
it: Non aggiungere mai una nuova riga dopo INVIO
ko: 입력 시 새 줄 추가 안 함
tr: Enter'a basıldığında hiçbir zaman yeni satır ekleme

source: Never include snippets
cs: Nikdy nezahrnovat fragmenty
de: Schnipsel nie einschließen
it: Non includere mai i frammenti
ko: 코드 조각 포함 안 함
tr: Kod parçacıklarını hiçbir zaman dahil etme

source: Only add new line on enter after end of fully typed word
cs: Při stisku Enter přidat nový řádek jenom po dopsání celého slova
it: Aggiungi una nuova riga dopo INVIO solo alla fine della parola digitata
ko: 단어를 모두 입력하고 <Enter> 키를 누르면 새 줄 추가
tr: Yalnızca tam olarak yazılmış bir kelimeden sonra Enter'a basıldığında yeni satır ekle

source: Underline reassigned variables; Display inline hints; Display inlay hints; Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Always use default symbol servers for navigation; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Collapse #regions on file open; Collapse usings on file open; Collapse metadata implementations on file open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Colorize regular expressions; Highlight related components under cursor; Report invalid regular expressions; JSON; Colorize JSON strings; Report invalid JSON strings; Detect and offer editor features for JSON strings; Use enhanced colors; Editor Color Scheme; Inheritance Margin;
ko: 다시 할당된 변수에 밑줄 긋기; 인라인 힌트 표시; 닫힌 파일에 대한 진단 표시; 정규식 색 지정; 커서 아래의 관련 구성 요소 강조 표시; 잘못된 정규식 보고; 전체 솔루션 분석 사용; 외부 프로세스에서 편집기 기능 분석 수행; 디컴파일된 원본 탐색 사용; 탐색 시 항상 기본 기호 서버 사용; using 지시문; using 정렬 시 system 지시문 먼저 배치; using 지시문 그룹 구분; 참조 어셈블리의 형식에 using 제안; NuGet 패키지의 형식에 using 제안; 강조 표시; 커서 아래의 기호에 대한 참조 강조 표시; 커서 아래의 관련 키워드 강조 표시; 개요; 개요 모드로 파일 열기; 파일을 열 때 #regions 축소; 파일을 열 때 사용 축소; 파일을 열 때 메타데이터 구현 축소; 프로시저 줄 구분선 표시; 선언 수준 구문에 대한 개요 표시; 코드 수준 구문에 대한 개요 표시; 설명 및 전처리기 영역에 대한 개요 표시; 정의로 축소할 때 영역 축소; 페이딩; 사용하지 않는 using 페이드 아웃; 접근할 수 없는 코드 페이드 아웃; 블록 구문 가이드; 선언 수준 구문에 대한 가이드 표시; 코드 수준 구문에 대한 가이드 표시; 편집기 도움말; ///에 대해 XML 문서 주석 생성; /* */ 주석을 작성할 때 새 줄의 시작 부분에 * 삽입; 이름 바꾸기 추적 미리 보기 표시; Enter 키를 누르면 문자열 리터럴 분할; string.Format 호출에서 잘못된 자리 표시자 보고; 메서드 추출; 사용자 지정 구조체에 ref 또는 out 추가 안 함; 인터페이스 또는 추상 클래스 구현; 속성, 이벤트 및 메서드 삽입 시 다음과 같이 배치; 같은 종류의 다른 구성원와 함께; 끝에; 속성 생성 시; throw되는 속성 선호; 자동 속성 선호; regex; 정규식; 정규식 색 지정; 커서 아래의 관련 구성 요소 강조; 잘못된 정규식 보고; JSON; JSON 문자열 색 지정; 잘못된 JSON 문자열 보고; JSON 문자열용 편집기 기능 탐지 및 제안; 향상된 색 사용; 편집기 색 구성표; 상속 여백;
