Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Underline reassigned variables; Display inline hints; Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Always use default symbol servers for navigation; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Colorize regular expressions; Highlight related components under cursor; Report invalid regular expressions; JSON; Colorize JSON strings; Report invalid JSON strings; Detect and offer editor features for JSON strings; Use enhanced colors; Editor Color Scheme; Inheritance Margin;
fr: Souligner les variables réaffectées; Afficher les indicateurs inline; Afficher les diagnostics pour les fichiers fermés; Mettre en couleurs l'expression régulière; Surligner les composants liés sous le curseur; Signaler les expressions régulières non valides; Activer l'analyse complète de la solution; Effectuer l'analyse des fonctionnalités de l'éditeur dans un processus externe; Activer la navigation vers les sources décompilées; Directives using; Placer en premier les directives system au moment du tri des using; Séparer les groupes de directives using; Suggérer des using pour les types dans les assemblys de référence; Suggérer des using pour les types dans les packages NuGet; Mise en surbrillance; Mettre en surbrillance les références au symbole sous le curseur; Mettre en surbrillance les mots clés liés sous le curseur; Mode Plan; Passer en mode Plan à l'ouverture des fichiers; Afficher les séparateurs de ligne de procédure; Afficher le mode Plan pour les constructions au niveau des déclarations; Afficher le mode Plan pour les constructions au niveau du code; Afficher le mode Plan pour les commentaires et les régions du préprocesseur; Réduire les régions au moment de la réduction aux définitions; Atténuation; Atténuer les using inutilisés; Atténuer le code inaccessible; Repères de structure de bloc; Afficher les repères pour les constructions au niveau des déclarations; Afficher les repères pour les constructions au niveau du code; Aide de l'éditeur; Générer des commentaires de documentation XML pour ///; Insérer * au début des nouvelles lignes pour l'écriture de commentaires /* */; Afficher un aperçu pour le suivi des renommages; Diviser les littéraux de chaîne avec Entrée; Signaler les espaces réservés non valides dans les appels de string.Format; Extraire la méthode; Ne pas placer ref ou out dans un struct personnalisé; Implémenter une interface ou une classe abstraite; Au moment d'insérer des propriétés, des événements et des méthodes, les placer; avec d'autres membres du même genre; à la fin; Durant la génération de propriétés; préférer les propriétés de levée d'exceptions; préférer les propriétés automatiques; regex; expression régulière; Utiliser des couleurs améliorées; Modèle de couleurs de l'éditeur; Marge d'héritage;
ja: 再割り当てされる変数に下線を引く; インラインのヒントを表示する; 閉じているファイルの診断結果を表示する; 正規表現をカラー化する; カーソルの下にある関連コンポーネントを強調表示する; 無効な正規表現を報告する; 完全ソリューション解析を有効にする; 外部プロセスでエディター機能解析を実行する; 逆コンパイルされたソースへのナビゲーションを有効にする; ディレクティブを使用する; using を並べ替える際に、system ディレクティブを先頭に配置する; using ディレクティブ グループを分離する; 参照アセンブリの型に using を提案する; NuGet パッケージの型に using を提案する; 強調表示; カーソルの下にあるシンボルへの参照を強調表示する; カーソルの下にある関連キーワードを強調表示する; アウトライン; ファイルを開くときにアウトライン モードに入る; プロシージャ行の区切り記号を表示する; 宣言レベルのコンストラクトのアウトラインを表示する; コード レベルのコンストラクトのアウトラインを表示する; コメントとプリプロセッサ領域のアウトラインを表示する; 定義を折りたたむときに regions を折りたたむ; フェード; 未使用の using をフェードアウトする; 到達できないコードをフェードアウトする; ブロック構造のガイド; 宣言レベルのコンストラクトのガイドを表示する; コード レベルのコンストラクトのガイドを表示する; エディターのヘルプ; /// が入力されたとき、XML ドキュメント コメントを生成する; /* */ コメントを記述する際、新しい行の先頭に * を挿入する; 名前変更追跡のプレビューを表示する; Enter で文字列リテラルを分割する; string.Format の呼び出しで無効なプレースホルダーをレポートする; メソッドを抽出する; カスタム構造体に ref または out を設定しない; インターフェイスまたは抽象クラスを実装する; プロパティ、イベント、メソッドを挿入する際には、次の場所に挿入する; 同じ種類の他のメンバーと共に; 末尾; プロパティの生成時; スロー プロパティを優先する; 自動プロパティを優先する; RegEx; 正規表現; 拡張された色を使用する; エディターの配色; 継承余白;

# An_empty_CSharp_script_file
source: An empty C# script file.
es: Archivo de script de C# vacío.
fr: Fichier de script C# vide.
ja: 空の C# スクリプト ファイルです。
pl: Pusty plik skryptu C#.
pt_br: Um arquivo de script C# vazio.
ru: Пустой файл скрипта C#.
zh_hans: 一个空的 C# 脚本文件。
zh_hant: 空白的 C# 指令碼檔。

# Visual_CSharp_Script
source: Visual C# Script
es: Script de Visual C#
fr: Script Visual C#
ja: Visual C# スクリプト
pl: Skrypt Visual C# Script
pt_br: Script do Visual C#
ru: Скрипт Visual C#
zh_hans: Visual C# 脚本
zh_hant: Visual C# 指令碼

source: Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Use enhanced colors; Editor Color Scheme;
pl: Pokaż dane diagnostyczne dla zamkniętych plików; Koloruj wyrażenia regularne; Wyróżnij powiązane składniki pod kursorem; Raportuj nieprawidłowe wyrażenia regularne; Włącz pełną analizę rozwiązania; Wykonaj analizę funkcji edytora w procesie zewnętrznym; Włącz nawigowanie do dekompilowanych źródeł; Dyrektywy using; Umieść najpierw dyrektywy system podczas sortowania deklaracji using; Oddziel grupy dyrektywy using; Sugeruj dyrektywy using dla typów w zestawach odwołania; Sugeruj dyrektywy using dla typów w pakietach NuGet; Wyróżnianie; Wyróżnij odwołania do symbolu pod kursorem; Wyróżnij pokrewne słowa kluczowe pod kursorem; Konspekt; Przejdź do trybu konspektu przy otwieraniu plików; Pokaż separatory wierszy procedury; Pokaż konspekt dla konstrukcji na poziomie deklaracji; Pokaż konspekt dla konstrukcji na poziomie kodu; Pokaż konspekt dla regionów komentarzy i preprocesora; Zwiń regiony podczas zwijania do definicji; Zanikanie; Zanikanie nieużywanych dyrektyw using; Zanikanie nieosiągalnego kodu; Prowadnice struktury blokowej; Pokaż prowadnice dla konstrukcji na poziomie deklaracji; Pokaż prowadnice dla konstrukcji na poziomie kodu; Pomoc edytora; Generuj komentarze dokumentacji XML dla elementów ///; Wstaw znak * na początku nowych wierszy podczas pisania komentarzy (/* */); Pokaż podgląd śledzenia zmian nazw; Dziel literały ciągów po naciśnięciu klawisza Enter; Zgłaszaj nieprawidłowe symbole zastępcze w wywołaniach metody string.Format; Wyodrębnianie metody; Nie umieszczaj parametrów ref i out w strukturze niestandardowej; Implementuj interfejs lub klasę abstrakcyjną; W przypadku wstawiania właściwości, zdarzeń i metod umieszczaj je; razem z innymi składowymi tego samego rodzaju; na końcu; Podczas generowania właściwości; preferuj właściwości przerzucane; preferuj właściwości automatyczne; wyrażenie regularne; wyrażenie regularne; Użyj ulepszonych kolorów; Schemat kolorów edytora;

source: Change completion list settings;Pre-select most recently used member; Completion Lists; Show completion list after a character is typed; Show completion list after a character is deleted; Automatically show completion list in argument lists (experimental); Highlight matching portions of completion list items; Show completion item filters; Snippets behavior; Never include snippets; Always include snippets; Include snippets when ?-Tab is typed after an identifier; Enter key behavior; Never add new line on enter; Only add new line on enter after end of fully typed word; Always add new line on enter; Show name suggestions; Show items from unimported namespaces (experimental);
es: Cambiar configuración de la lista de finalización;Preseleccionar el miembro usado recientemente; Listas de finalización; Mostrar lista de finalización después de escribir un carácter; Mostrar lista de finalización después de eliminar un carácter; Mostrar lista de finalización en las listas de argumentos automáticamente (experimental); Resaltar partes coincidentes de elementos de la lista de finalización; Mostrar filtros de elementos de finalización; Comportamiento de los fragmentos de código; No incluir nunca fragmentos de código; Incluir siempre fragmentos de código; Incluir fragmentos de código cuando ?-Tab se escriba después de un identificador; Comportamiento de la tecla Entrar; No agregar nunca una línea nueva al presionar Entrar; Agregar solo una nueva línea con Entrar al final de palabras; Agregar siempre una línea nueva al presionar Entrar; Mostrar sugerencias de nombre; Mostrar elementos de espacios de nombres no importados (experimental);
pl: Zmień ustawienia listy uzupełniania;Wybierz wstępnie ostatnio używaną składową; Listy uzupełniania; Pokaż listę uzupełniania po wpisaniu znaku; Pokaż listę uzupełniania po usunięciu znaku; Wyróżnij pasujące fragmenty elementów listy uzupełniania; Pokaż filtry elementów uzupełniania; Zachowanie fragmentów kodu; Nigdy nie dołączaj fragmentów kodu; Zawsze dołączaj fragmenty kodu; Dołącz fragmenty kodu po wpisaniu znaku ? po identyfikatorze i naciśnięciu klawisza Tab; Zachowanie klawisza Enter; Nigdy nie dodawaj nowego wiersza po naciśnięciu klawisza Enter; Dodaj nowy wiersz po naciśnięciu klawisza Enter tylko po zakończeniu pełnego wpisanego wyrazu; Zawsze dodawaj nowy wiersz po naciśnięciu klawisza Enter; Pokaż sugestie dotyczące nazwy;
ru: Изменить параметры списка завершения;Предварительно выбрать наиболее часто используемый элемент; Списки завершения; Показывать список завершения после ввода символа; Показывать список завершения после удаления символа; Автоматически показывать список завершения в списках аргументов (экспериментальная функция); Выделять совпадающие части элементов списка завершения; Показывать фильтры элементов завершения; Поведение фрагментов кода; Никогда не включать фрагменты кода; Всегда включать фрагменты кода; Включать фрагменты кода, когда после идентификатора указывается ?-Tab; Поведение при нажатии клавиши ВВОД; Никогда не добавлять новую строку при нажатии клавиши ВВОД; Добавлять новую строку при нажатии клавиши ВВОД только в конце полностью введенного слова; Всегда добавлять новую строку при нажатии клавиши ВВОД; Показывать варианты имен; Показывать элементы из неимпортированных пространств имен (экспериментальная функция);
zh_hans: 更改完成列表设置;预先选择最近使用过的成员;完成列表; 在键入字符后显示完成列表; 在删除字符后显示完成列表; 自动显示参数列表中的完成列表(实验性); 突出显示完成列表项的匹配部分; 显示完成项筛选器; 片段行为; 永不包含片段; 总是包含片段; 在标识符后键入 ?-Tab 时包含片段; 输入键行为; 永不在按 Enter 时添加新行; 仅在完整键入的字词结尾后按 Enter 时才添加新行; 总是在按 Enter 时添加新行; 显示名称建议; 显示未导入的命名空间中的项(实验性);
zh_hant: 變更自動完成清單設定;預先選取最近使用的成員; 自動完成清單; 在鍵入字元後顯示自動完成清單; 在刪除字元後顯示自動完成清單; 自動在引數清單中顯示自動完成清單 (實驗性); 醒目提示自動完成清單項目的相符部分; 顯示完成項目篩選; 程式碼片段行為; 永不包含程式碼片段; 永遠包含程式碼片段; 在識別碼後鍵入 ?-Tab 時包含程式碼片段; Enter 鍵行為; 永不在按下 enter 鍵時新增一行程式碼; 只在按下 enter 鍵時，於完整鍵入的文字結尾後新增一行程式碼; 永遠在按下 enter 鍵時新增一行程式碼; 顯示名稱建議; 顯示未匯入命名空間中的項目 (實驗性);

source: Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Use enhanced colors;
pt_br: Mostrar diagnósticos de arquivos fechados; Colorir a expressão regular; Realçar os componentes relacionados sob o cursor; Relatar expressões regulares inválidas; Habilitar a análise completa da solução; Executar análise de recurso do editor em processo externo; Habilitar a navegação para fontes decompiladas; Diretivas using; Colocar as diretivas do sistema primeiro ao classificar usings; Separar grupos de diretiva using; Sugerir usings para tipos em assemblies de referência; Sugerir usings para tipos em pacotes NuGet; Realce; Realçar as referências a símbolo sob o cursor; Realçar as palavras-chave relacionadas sob o cursor; Estrutura de tópicos; Inserir modo de estrutura de tópicos quando os arquivos são abertos; Mostrar separadores de linha de procedimento; Mostrar estrutura de tópicos para constructos de nível de declaração; Mostrar estrutura de tópicos para constructos de nível de código; Mostrar estrutura de tópicos para comentários e regiões de pré-processador; Recolher regiões ao recolher definições; Esmaecendo; Esmaecer usings não usadas; Esmaecer código inacessível; Bloquear Guias de Estrutura; Mostrar guias para constructos de nível de declaração; Mostrar guias de constructos de nível de código; Ajuda do Editor; Gerar comentários da documentação XML para ///; Inserir * no início de novas linhas ao escrever /* */ comentários; Mostrar visualização para acompanhamento de renomeação; Dividir literais de cadeia de caracteres ao pressionar Enter; Relatar espaços reservados inválidos nas chamadas a string.Format; Extrair Método; Não colocar ref ou out na estrutura personalizada; Implementar a Classe Interface ou Abstrata; Ao inserir propriedades, eventos e métodos, colocá-los; com outros membros do mesmo tipo; no fim; Ao gerar propriedade; preferir propriedades de lançamento; preferir propriedades automáticas; regex; expressão regular; Usar cores avançadas;

source: Change completion list settings;Pre-select most recently used member; Completion Lists; Show completion list after a character is typed; Show completion list after a character is deleted; Highlight matching portions of completion list items; Show completion item filters; Snippets behavior; Never include snippets; Always include snippets; Include snippets when ?-Tab is typed after an identifier; Enter key behavior; Never add new line on enter; Only add new line on enter after end of fully typed word; Always add new line on enter; Show name suggestions;
pt_br: Alterar configurações da lista de conclusão;Pré-selecionar o membro usado mais recentemente; Listas de conclusão; Mostrar lista de conclusão após um caractere ser digitado; Mostrar lista de conclusão após um caractere ser excluído; Realçar as partes correspondentes dos itens da lista de conclusão; Mostrar filtros de itens de conclusão; Comportamento de trechos; Nunca incluir trechos; Sempre incluir trechos; Incluir trechos quando? –Tab é digitado após um identificador; Inserir o comportamento chave; Nunca adicionar nova linha ao inserir; Apenas adicionar uma nova linha ao inserir após o final da palavra totalmente digitada; Sempre adicionar nova linha ao inserir; Mostrar sugestões de nomes;
