Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Display inline hints; Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Use enhanced colors; Editor Color Scheme;
es: Mostrar sugerencias insertadas; Mostrar diagnóstico para archivos cerrados; Colorear expresión regular; Resaltar componentes relacionados bajo el cursor; Informar sobre expresiones regulares no válidas; Habilitar análisis de la solución completa; Realizar el análisis de características del editor en proceso externo; Habilitar la navegación a orígenes descompilados; Directivas Using; Poner directivas del sistema primero cuando se organicen instrucciones Using; Separar grupos de directivas using; Sugerir directivas using para los tipos en los ensamblados de referencia; Sugerir directivas using para los tipos en los paquetes NuGet; Resaltar; Resaltar referencias al símbolo bajo el cursor; Resaltar palabras clave relacionadas bajo el cursor; Esquematización; Especificar el modo de esquematización al abrir los archivos; Mostrar separadores de líneas de procedimientos; Mostrar esquematización para construcciones a nivel de declaración; Mostrar esquematización para construcciones a nivel de código; Mostrar esquematización para regiones de preprocesador y comentarios; Contraer regiones cuando se contraiga a las definiciones; Atenuación; Atenuar directivas using no usadas; Atenuar código inaccesible; Guías de estructura de bloque; Mostrar guías para construcciones a nivel de declaración; Mostrar guías para construcciones a nivel de código; Ayuda del editor; Generar comentarios de documentación XML para ///; Insertar * al comienzo de las nuevas líneas al escribir comentarios /* */; Mostrar vista previa para seguimiento de cambio de nombre; Dividir literales de cadena al presionar Entrar; Informar sobre marcadores de posición no válidos en llamadas a string.Format; Extraer método; No colocar "out" o "ref" en estructura personalizada; Implementar interfaz o clase abstracta; Al insertar propiedades, eventos y métodos, colóquelos; con otros miembros de la misma clase; al final; Al generar una propiedad; preferir propiedades de lanzamiento; preferir propiedades automáticas; regex; expresión regular; Usar colores mejorados; Combinación de colores del editor;
ru: Отображать встроенные подсказки; Отображать диагностику для закрытых файлов; Выделять регулярные выражения цветом; Выделять связанные компоненты под курсором; Сообщать о недопустимых регулярных выражениях; Включить полный анализ решения; Выполнять анализ функций редактора во внешнем процессе; Включить переход к декомпилированным источникам; Директивы using; Располагать директивы system первыми при сортировке using; Разделять группы директив using; Предлагать директивы using для типов в базовых сборках; Предлагать директивы using для типов в пакетах NuGet; Выделение; Выделять ссылки на символ под курсором; Выделить связанные ключевые слова под курсором; Структурирование; Включать режим редактирования структуры при открытии файлов; Показывать разделители строк процедур; Показывать структуру для конструкций уровня объявления; Показывать структуру для конструкций уровня кода; Показывать структуру для комментариев и областей препроцессора; Сворачивать области при сворачивании в определения; Скрытие; Скрывать неиспользуемые директивы using; Скрывать недостижимый код; Направляющие для структуры блоков; Показывать направляющие для конструкций уровня объявления; Показывать направляющие для конструкций уровня кода; Справка по редактору; Создавать комментарии XML-документации для ///; Вставлять "*" в начале новой строки при написании комментариев "/* */"; Отображать предварительный просмотр для отслеживания переименований; Разделять строковые литералы при нажатии клавиши ВВОД; Сообщать о недопустимых заполнителях в вызовах string.Format; Извлечение метода; Не помещать ref или out в настраиваемую структуру; Реализовать интерфейс или абстрактный класс; При вставке свойств, методов и событий помещать их; вместе с другими элементами того же типа; в конец; При создании свойства; предпочитать свойства, создающие исключения; предпочитать автоматические свойства; регулярное выражение; регулярное выражение; Использовать расширенные цвета; Цветовая схема редактора;
zh_hans: 显示内联提示; 显示对已关闭文件的诊断; 对正则表达式着色; 突出显示游标下的相关组件; 报告无效的正则表达式; 启用完整解决方案分析; 在外部进程中执行编辑器功能分析; 对反编译的源启用导航; Using 指令; 对 using 进行排序时将系统指令放在开头; 将 using 指令组分隔开来; 建议对引用程序集中的类型使用 using; 建议对 NuGet 包中的类型使用 using; 突出显示; 突出显示对游标下的符号的引用; 突出显示游标下的相关关键字; 大纲; 在文件打开时输入大纲模式; 显示流程行分隔符; 显示声明级别构造的大纲; 显示代码级别构造的大纲; 显示注释和预处理器区域的大纲; 在折叠到定义时折叠区域; 淡出; 未使用的 using 淡出; 不可访问的代码淡出; 块结构指南; 显示声明级别构造的指南; 显示代码级别构造的指南; 编辑器帮助; 为 /// 生成 XML 文档注释; 在写入 /* */ 注释时在新行开头插入 *; 显示重命名跟踪的预览; 在按 Enter 时拆分字符串文本; 报告 string.Format 调用中的无效占位符; 提取方法; 不要在自定义结构上放置 ref 或 out; 实现接口或抽象类; 插入属性、事件和方法时，放置它们; 具有相同类型的其他成员; 位于末尾; 在生成属性时; 首选引发属性; 首选自动属性; regex; 正则表达式; 使用增强色; 编辑器配色方案;
