Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Set spacing for method declarations; Insert space between method name and its opening parenthesis; Insert space within parameter list parentheses; Insert space within empty parameter list parentheses; Set spacing for method calls; Insert space within argument list parentheses; Insert space within empty argument list parentheses; Set other spacing options; Insert space after keywords in control flow statements; Insert space within parentheses of expressions; Insert space within parentheses of type casts; Insert spaces within parentheses of control flow statements; Insert space after cast; Ignore spaces in declaration statements; Set spacing for brackets; Insert space before open square bracket; Insert space within empty square brackets; Insert spaces within square brackets; Set spacing for delimiters; Insert space after colon for base or interface in type declaration; Insert space after comma; Insert space after dot; Insert space after semicolon in for statement; Insert space before colon for base or interface in type declaration; Insert space before comma; Insert space before dot; Insert space before semicolon in for statement; Set spacing for operators; Ignore spaces around binary operators; Remove spaces before and after binary operators; Insert space before and after binary operators;
cs: Nastavit mezery pro deklarace metod; Vložit mezeru mezi název metody a její levou kulatou závorkou; Vložit mezeru mezi kulaté závorky seznamu parametrů; Vložit mezeru mezi kulaté závorky prázdného seznamu parametrů; Nastavit mezery pro volání metod; Vložit mezeru mezi kulaté závorky seznamu argumentů; Vložit mezeru mezi kulaté závorky prázdného seznamu argumentů; Nastavit další možnosti mezer; Vkládat mezeru po klíčových slovech v příkazech toku řízení; Vložit mezeru mezi kulaté závorky výrazů; Vložit mezeru mezi kulaté závorky přetypování; Vložit mezery mezi kulaté závorky příkazů řízení toku; Vložit mezeru po přetypování; Ignorovat mezery ve výpisech deklarací; Nastavit mezery pro hranaté závorky; Vložit mezeru před levou hranatou závorku; Vložit mezeru mezi prázdné hranaté závorky; Vložit mezery mezi hranaté závorky; Nastavit mezery pro oddělovače; Vložit mezeru po dvojtečce pro základní typ nebo rozhraní v deklaraci typu; Vložit mezeru za čárku; Vložit mezeru za tečku; Vložit mezeru za středník v příkazu for; Vložit mezeru před dvojtečku pro základní typ nebo rozhraní v deklaraci typu; Vložit mezeru před čárku; Vložit mezeru před tečku; Vložit mezeru před středník v příkazu for; Nastavit mezery pro operátory; Ignorovat mezery okolo binárních operátorů; Odebrat mezery před a po binárních operátorech; Vložit mezeru před a za binární operátory;
de: Abstände für Methodendeklarationen festlegen; Leerzeichen zwischen Methodenname und öffnender runder Klammer einfügen; Leerzeichen zwischen runden Klammern in Parameterliste einfügen; Leerzeichen zwischen runden Klammern in leere Parameterliste einfügen; Abstände für Methodenaufrufe festlegen; Leerzeichen zwischen runden Klammern um Argumentliste einfügen; Leerzeichen zwischen runden Klammern um leere Argumentliste einfügen; Weitere Abstandsoptionen festlegen; Leerzeichen nach Schlüsselwörtern in Anweisungen für die Ablaufsteuerung einfügen; Leerzeichen zwischen runden Klammern von Ausdrücken einfügen; Leerzeichen zwischen runde Klammern für Typumwandlungen einfügen; Leerzeichen zwischen den Klammern von Ablaufsteuerungsanweisungen einfügen; Leerzeichen nach Umwandlung einfügen; Leerzeichen um Deklarationsanweisungen ignorieren; Abstände für eckige Klammern festlegen; Leerzeichen vor öffnender eckiger Klammer einfügen; Leerzeichen zwischen leeren eckigen Klammern einfügen; Leerzeichen zwischen eckigen Klammern einfügen; Abstand für Trennzeichen; In Typdeklarationen Leerzeichen nach Doppelpunkt für Basis oder Schnittstelle einfügen; Leerzeichen nach Komma einfügen; Leerzeichen nach Punkt einfügen; In for-Anweisung Leerzeichen nach Semikolon einfügen; In Typdeklarationen Leerzeichen vor Doppelpunkt für Basis oder Schnittstelle einfügen; Leerzeichen vor Komma einfügen; Leerzeichen vor Punkt einfügen; In for-Anweisung Leerzeichen vor Semikolon einfügen; Abstände für Operatoren festlegen; Leerzeichen um binäre Operatoren ignorieren; Leerzeichen vor und nach binären Operatoren entfernen; Leerzeichen vor und nach binären Operatoren einfügen;
es: Establecer espaciado para declaraciones de método; Insertar espacio entre el nombre del método y el paréntesis de apertura; Insertar espacio entre paréntesis de la lista de parámetros; Insertar espacio entre paréntesis vacíos de la lista de parámetros; Establecer espaciado para llamadas a métodos; Insertar espacio entre paréntesis de la lista de agumentos; Insertar espacio entre paréntesis vacíos de la lista de argumentos; Establecer otras opciones de espaciado; Insertar espacio después de las palabras clave en instrucciones de flujo de control; Insertar espacio entre paréntesis de expresiones; Insertar espacio entre paréntesis de conversiones de tipo; Insertar espacio entre paréntesis de instrucciones de flujo de control; Insertar espacio tras conversión; Omitir espacios en instrucciones de declaración; Establecer espaciado para corchetes; Insertar espacio delante de corchetes de apertura; Insertar espacio entre corchetes vacíos; Insertar espacios entre corchetes; Establecer espaciado para delimitadores; Insertar espacio tras dos puntos para base o interfaz en una declaración de tipo; Insertar espacio tras coma; Insertar espacio tras punto; Insertar espacio tras punto y coma en instrucciones "for"; Insertar espacio delante de dos puntos para base o interfaz en una declaración de tipo; Insertar espacio delante de coma; Insertar espacio delante de punto; Insertar espacio delante de punto y coma en instrucciones "for"; Establecer espaciado para operadores; Omitir espacios alrededor de operadores binarios; Quitar espacios delante y detrás de operadores binarios; Insertar espacio delante y detrás de operadores binarios;
fr: Définir l'espacement des déclarations de méthode ; Insérer un espace entre le nom de la méthode et sa parenthèse ouvrante ; Insérer un espace dans les parenthèses de la liste de paramètres ; Insérer un espace dans les parenthèses de la liste de paramètres vide ; Définir l'espacement des appels de méthode ; Insérer un espace dans les parenthèses de la liste d'arguments ; Insérer un espace dans les parenthèses de la liste d'arguments vide ; Définir d'autres options d'espacement ; Insérer un espace après les mots clés dans les instructions de flux de contrôle ; Insérer un espace dans les parenthèses d'expressions ; Insérer un espace dans les parenthèses de casts de type ; Insérer des espaces à l'intérieur des parenthèses des instructions de flux de contrôle ; Insérer un espace après cast ; Ignorer les espaces dans les instructions de déclaration ; Définir l'espacement des crochets ; Insérer un espace avant un crochet ouvrant ; Insérer un espace dans des crochets vides ; Insérer des espaces dans des crochets ; Définir l'espacement des délimiteurs ; Insérer un espace après le signe deux-points pour base ou interface dans une déclaration de type ; Insérer un espace après la virgule ; Insérer un espace après le point ; Insérer un espace après le point-virgule dans une instruction for ; Insérer un espace avant le signe deux-points pour base ou interface dans une déclaration de type ; Insérer un espace avant la virgule ; Insérer un espace avant le point ; Insérer un espace avant le point-virgule dans une instruction for ; Définir l'espacement des opérateurs ; Ignorer les espaces autour des opérateurs binaires ; Supprimer les espaces avant et après les opérateurs binaires ; Insérer un espace avant et après les opérateurs binaires ;
it: Imposta spaziatura per le dichiarazioni di metodi; Inserisci spazio tra il nome del metodo e la parentesi di apertura corrispondente; Inserisci spazio tra le parentesi dell'elenco di parametri; Inserisci spazio tra le parentesi dell'elenco di parametri vuoto; Imposta spaziatura per le chiamate a un metodo; Inserisci spazio tra le parentesi dell'elenco di argomenti; Inserisci spazio tra le parentesi dell'elenco di argomenti vuoto; Imposta altre opzioni di spaziatura; Inserisci spazio dopo le parole chiave nelle istruzioni del flusso di controllo; Inserisci spazio tra le parentesi delle espressioni; Inserisci spazio tra le parentesi dei cast di tipo; Inserisci spazio tra le parentesi delle istruzioni del flusso di controllo; Inserisci spazio dopo il cast; Ignora spazi nelle istruzioni di dichiarazione; Imposta spaziatura per le parentesi quadre; Inserisci spazio prima della parentesi quadra di apertura; Inserisci spazio tra parentesi quadre vuote; Inserisci spazi tra parentesi quadre; Imposta spaziatura per delimitatori; Inserisci spazio dopo i due punti per base o interfaccia nella dichiarazione di tipo; Inserisci spazio dopo la virgola; Inserisci spazio dopo il punto; Inserisci spazio dopo il punto e virgola nell'istruzione for; Inserisci spazio prima dei due punti per base o interfaccia nella dichiarazione di tipo; Inserisci spazio prima della virgola; Inserisci spazio prima del punto; Inserisci spazio prima del punto e virgola nell'istruzione for; Imposta spaziatura per gli operatori; Ignora spazi prima e dopo gli operatori binari; Rimuovi spazi prima e dopo gli operatori binari; Inserisci spazio prima e dopo gli operatori binari;
ja: メソッド宣言子のスペースを設定する; メソッド名と始めかっこの間にスペースを挿入する; パラメーター リストのかっこ内にスペースを挿入する; 空のパラメーター リストのかっこ内にスペースを挿入する; メソッド呼び出しのスペースを設定する; 引数リストのかっこ内にスペースを挿入する; 空の引数リストのかっこ内にスペースを挿入する; その他のスペース オプションを設定する; 制御フロー ステートメント内のキーワードの後にスペースを挿入する; 式のかっこ内にスペースを挿入する; 型キャストのかっこ内にスペースを挿入する; 制御フロー ステートメントのかっこ内にスペースを挿入する; キャストの後にスペースを挿入する; 宣言ステートメント内のスペースを無視する; 角かっこのスペースを設定する; 始め角かっこの前にスペースを挿入する; 空の角かっこ内にスペースを挿入する; 角かっこ内にスペースを挿入する; 区切り記号のスペースを設定する; 型宣言で、基本またはインターフェイス用のコロンの後にスペースを配置する; コンマの後にスペースを追加する; ピリオドの後にスペースを追加する; for ステートメントで、セミコロンの後にスペースを挿入する; 型宣言で、基本またはインターフェイス用のコロンの前にスペースを挿入する; コンマの前にスペースを挿入する; ピリオドの前にスペースを挿入する; for ステートメントで、セミコロンの前にスペースを挿入する; 演算子のスペースを設定する; バイナリ演算子の前後のスペースを無視する; バイナリ演算子の前後のスペースを削除する; バイナリ演算子の前後にスペースを挿入する;
ko: 메서드 선언의 간격 설정; 메서드 이름과 여는 괄호 사이에 공백 삽입; 매개 변수 목록 괄호 내에 공백 삽입; 빈 매개 변수 목록 괄호 내에 공백 삽입; 메서드 호출의 간격 설정; 인수 목록 괄호 내부에 공백 삽입; 빈 인수 목록 괄호 내부에 공백 삽입; 기타 간격 옵션 설정; 제어 흐름 문의 키워드 뒤에 공백 삽입; 식의 괄호 내부에 공백 삽입; 형식 캐스트의 괄호 내부에 공백 삽입; 제어 흐름 문의 괄호 내부에 공백 삽입; 캐스트 뒤에 공백 삽입; 선언문의 공백 무시; 대괄호의 간격 설정; 여는 대괄호 앞에 공백 삽입; 빈 대괄호 내부에 공백 삽입; 대괄호 내부에 공백 삽입; 구분 기호의 간격 설정; 형식 선언의 기본 또는 인터페이스에 대한 콜론 뒤에 공백 삽입; 쉼표 뒤에 공백 삽입; 점 뒤에 공백 삽입; for 문의 세미콜론 뒤에 공백 삽입; 형식 선언의 기본 또는 인터페이스에 대한 콜론 앞에 공백 삽입; 쉼표 앞에 공백 삽입; 점 앞에 공백 삽입; for 문의 세미콜론 앞에 공백 삽입; 연산자의 간격 설정; 이항 연산자 주위의 공백 무시; 이항 연산자 앞뒤의 공백 제거; 이항 연산자 앞뒤에 공백 삽입;
pl: Ustaw odstępy dla deklaracji metod; Wstaw spację między nazwę metody i jej nawias otwierający; Wstaw spację wewnątrz nawiasów listy parametrów; Wstaw spację wewnątrz nawiasów pustej listy parametrów; Ustaw odstępy dla wywołań metod; Wstaw spację wewnątrz nawiasów listy argumentów; Wstaw spację wewnątrz nawiasów pustej listy argumentów; Ustaw inne opcje odstępów; Wstaw spację po słowach kluczowych w instrukcjach przepływu sterowania; Wstaw spację wewnątrz nawiasów wyrażeń; Wstaw spację wewnątrz nawiasów rzutowania typu; Wstaw spacje wewnątrz nawiasów instrukcji przepływu sterowania; Wstaw spację po rzutowaniu; Ignoruj spacje w instrukcjach deklaracji; Ustaw odstępy dla nawiasów; Wstaw spację przed otwierającym nawiasem kwadratowym; Wstaw spację wewnątrz pustych nawiasów kwadratowych; Wstaw spacje wewnątrz nawiasów kwadratowych; Ustaw odstępy dla ograniczników; Wstaw spację po dwukropku dla elementu base lub interface w deklaracji typu; Wstaw spację po przecinku; Wstaw spację po kropce; Wstaw spację po średniku w instrukcji for; Wstaw spację przed dwukropkiem dla elementu base lub interface w deklaracji typu; Wstaw spację przed przecinkiem; Wstaw spację przed kropką; Wstaw spację przed średnikiem w instrukcji for; Ustaw odstępy dla operatorów; Ignoruj spacje dookoła operatorów binarnych; Usuń spacje przed operatorami binarnymi i po nich; Wstaw spację przed operatorami binarnymi i po nich;
pt_br: Definir espaçamento para declarações de métodos; Inserir espaço entre o nome do método e seus parênteses de abertura; Inserir espaço nos parênteses da lista de parâmetros; Inserir espaço nos parênteses da lista de parâmetros vazia; Definir espaçamento para chamadas de método; Inserir espaço nos parênteses da lista de argumentos; Inserir espaço nos parênteses da lista de argumentos vazia; Definir outras opções de espaçamento; Inserir espaço após palavras-chave em instruções de fluxo de controle; Inserir espaço entre parênteses de expressões; Inserir espaço entre parênteses de tipos de conversão; Inserir espaços entre parênteses das instruções de fluxo de controle; Inserir espaço após conversão; Ignorar espaços em declarações de declaração; Definir espaçamento para colchetes; Inserir o espaço antes de abrir o colchete; Inserir espaço dentro de colchetes vazios; Inserir espaços entre colchetes; Definir espaçamento para delimitadores; Inserir espaço após dois pontos para base ou interface na declaração de tipo; Inserir espaço após vírgula; Inserir espaço após o ponto; Inserir espaço após ponto e vírgula para instrução; Inserir espaço antes dos dois pontos para base ou interface na declaração de tipo; Inserir espaço antes da vírgula; Inserir espaço antes do ponto; Inserir espaço antes do ponto e vírgula para instrução; Definir espaçamento para operadores; Ignorar espaços ao redor de operadores binários; Remover espaços antes e depois dos operadores binários; Inserir espaço antes e depois dos operadores binários;
ru: Задать интервал для объявлений методов; Вставлять пробел между именем метода и открывающей скобкой; Вставлять пробел между скобками со списком параметров; Вставлять пробел между скобками с пустым списком параметров; Задать интервал для вызова методов; Вставлять пробел между скобками со списком аргументов; Вставлять пробел между скобками с пустым списком аргументов; Задать другие параметры интервалов; Вставлять пробел после ключевых слов в операторах потока управления; Вставлять пробел между скобками для выражений; Вставлять пробел между скобками для приведения типа; Вставлять пробел между скобками в операторах потока управления; Вставлять пробел после приведения; Игнорировать пробелы в операторах объявления; Задать интервал для скобок; Вставлять пробел перед открывающей квадратной скобкой; Вставлять пробел между пустыми квадратными скобками; Вставлять пробелы между квадратными скобками; Задать интервал для разделителей; Вставлять пробел после двоеточия для базового типа или интерфейса в объявлениях типов; Вставлять пробел после запятой; Вставлять пробел после точки; Вставлять пробел после точки с запятой в операторе for; Вставлять пробел перед двоеточием для базового типа или интерфейса в объявлениях типов; Вставлять пробел перед запятой; Вставлять пробел перед точкой; Вставлять пробел перед точкой с запятой в операторе for; Задать интервал для операторов for; Игнорировать пробелы вокруг бинарных операторов; Удалять пробелы до и после бинарных операторов; Вставлять пробел до и после бинарных операторов;
tr: Metot bildirimleri için boşlukları ayarla; Metot adı ile metodun açma ayracı arasına boşluk ekle; Parametre listesi ayraçları içine boşluk ekle; Boş parametre listesi ayraçları içine boşluk ekle; Metot çağrıları için boşlukları ayarla; Bağımsız değişken listesi ayraçları içine boşluk ekle; Boş bağımsız değişken listesi ayraçları içine boşluk ekle; Diğer boşluk seçeneklerini ayarla; Denetim akışı deyimlerinde anahtar sözcüklerden sonra boşluk ekle; İfadelerin ayraçları içine boşluk ekle; Tür atamalarının ayraçları içine boşluk ekle; Denetim akışı deyimlerinin ayraçları içine boşluk ekle; Atamadan sonra boşluk ekle; Bildirim deyimlerindeki boşlukları yoksay; Köşeli ayraçlar için boşlukları ayarla; Açma köşeli ayracından önce boşluk ekle; Boş köşeli ayraçların içine boşluk ekle; Köşeli ayraçlar içine boşluk ekle; Sınırlayıcılar için boşlukları ayarla; Tür bildiriminde base veya interface için iki noktadan sonra boşluk ekle; Virgülden sonra boşluk ekle; Noktadan sonra boşluk ekle; for deyiminde noktalı virgülden sonra boşluk ekle; Tür bildiriminde base veya interface için iki noktadan önce boşluk ekle; Virgülden önce boşluk ekle; Noktadan önce boşluk ekle; for deyiminde noktalı virgülden önce boşluk ekle; İşleçler için boşlukları ayarla; İkili işleçlerin çevresindeki boşlukları yoksay; İkili işleçlerden önceki ve sonraki boşlukları kaldır; İkili işleçlerden önce ve sonra boşluk ekle;
zh_hans: 设置方法声明的间距; 在方法名称与其左括号之间插入空格; 在参数列表括号内插入空格; 在空参数列表括号内插入空格; 设置方法调用的间距; 在实参列表括号内插入空格; 在空实参列表括号内插入空格; 设置其他间距选项; 在控件流语句中的关键字后插入空格; 在表达式的括号内插入空格; 在类型转换的括号内插入空格; 在控件流语句的括号内插入空格; 在转换后插入空格; 忽略声明语句中的空格; 设置圆括号的间距; 在左方括号的前面插入空格; 在空方括号内插入空格; 在方括号内插入空格; 设置定界符的间距; 对于类型声明中的基数或接口，在冒号后插入空格; 在逗号后插入空格; 在句点后插入空格; 在 for 语句中的分号后插入空格; 对于类型声明中的基数或接口，在冒号后插入空格; 在逗号后插入空格; 在句点后插入空格; 在 for 语句中的分号后插入空格; 设置运算符的间距; 忽略二进制运算符两侧的空格; 删除二进制运算符两侧的空格; 在二进制运算符两侧插入空格;
zh_hant: 設定方法宣告的間距; 在方法名稱及其左括號間插入空格; 在參數清單括號內插入空格; 在空白參數清單括號內插入空格; 設定方法呼叫的間距; 在引數清單括號內插入空格; 在空白引數清單括號內插入空格; 設定其他間距選項; 在控制流程陳述式中的關鍵字後插入空格; 在運算式的括號內插入空格; 在類型轉換的括號內插入空格; 在控制流程陳述式的括號內插入空格; 在轉換後插入空格; 略過宣告陳述式中的空格; 設定中括號的空格; 在左方括號前插入空格; 在空白方括號內插入空格; 在方括號內插入空格; 設定分隔符號的空格; 針對類型宣告中的基底或介面在冒號後插入空格; 在逗號後插入空格; 在點號後插入空格; 在 for 陳述式內的分號後插入空格; 針對類型宣告中的基底或介面在冒號前插入空格; 在逗號前插入空格; 在點號前插入空格; 在 for 陳述式內的分號前插入空格; 設定運算子的間距; 略過二元運算子周圍的空格; 移除二元運算子前後的空格; 在二元運算子前後插入空格;

source: Change formatting options for wrapping;leave block on single line;leave statements and member declarations on the same line
cs: Změnit možnosti formátování pro obtékání;ponechat blok na stejném řádku;ponechat příkazy a deklarace členu na stejném řádku
de: Formatierungsoptionen für Umbruch ändern;Block auf einzelner Zeile belassen;Anweisungen und Memberdeklarationen auf der gleichen Zeile belassen
es: Cambiar opciones de formato de ajuste;Mantener bloque en una sola línea;Mantener instrucciones y declaraciones de miembros en la misma línea
fr: Changer les options de mise en forme pour l'enveloppement ; Laisser un bloc sur une seule ligne ; Laisser les instructions et les déclarations de membre sur la même ligne
it: Modifica opzioni di formattazione per ritorno a capo;Lascia blocco su una sola riga;Lascia istruzioni e dichiarazioni di membri sulla stessa riga
ja: 折り返しの書式オプションを変更する;ブロックを単一行に配置する;1 行に複数のステートメントとメンバー宣言を表示する
ko: 래핑 서식 옵션 변경;블록 한 줄에 두기;문과 멤버 선언을 같은 줄에 두기
pl: Zmień opcje formatowania dla zawijania;pozostaw blok w pojedynczym wierszu;pozostaw instrukcje i deklaracje składowych w tym samym wierszu
pt_br: Alterar opções de formatação para quebra automática; deixar bloco na linha; deixar instruções e declarações de membro na mesma linha
ru: Изменение параметров форматирования для переноса по словам; оставить блок в одной строке; оставить запросы и объявления членов в той же строке
tr: Sarmalama için biçimlendirme seçeneklerini değiştir;bloğu tek satırda bırak;ifadeleri ve üye bildirimlerini aynı satırda bırak
zh_hans: 更改换行的格式选项;将块保留在一行上;将语句和成员声明保留在同一行上
zh_hant: 變更換行的格式化選項;將區塊保留在同一行;將陳述式與成員宣告保留在同一行
