Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Advanced
cs: Upřesnit
de: Erweitert
es: Avanzadas
fr: Avancé
it: Avanzate
ja: 詳細
ko: 고급
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительно
tr: Gelişmiş
zh_hans: 高级
zh_hant: 進階

source: C# Editor
cs: Editor C#
es: Editor de C#
fr: C# - Éditeur
it: Editor C#
ja: C# エディター
ko: C# 편집기
pl: Edytor C#
pt_br: Editor C#
ru: Редактор C#
tr: C# Düzenleyicisi
zh_hans: C# 编辑器
zh_hant: C# 編輯器

source: Settings for the C# editor found under the Advanced, Formatting, and IntelliSense nodes in the Tools/Options dialog box.
cs: Nastavení editoru jazyka C# nalezené pod uzly Upřesnit, Formátování a IntelliSense v dialogovém okně Nástroje/Možnosti.
de: Einstellungen für den C#-Editor, die sich unter "Tools" im Dialogfeld "Optionen" unter den Knoten "Erweitert", "Formatierung" und "IntelliSense" befinden.
es: Configuración del editor de C#; se encuentra en los nodos Avanzadas, Formato e IntelliSense del cuadro de diálogo Herramientas - Opciones.
fr: Paramètres de l'Éditeur C# accessibles à partir des noeuds Avancé, Mise en forme et IntelliSense via la boîte de dialogue Outils/Options.
it: Impostazioni per l'editor C# trovate nei nodi Avanzate, Formattazione e IntelliSense della finestra di dialogo Strumenti/Opzioni.
ja: C# エディターの設定は、[ツール] メニューから [オプション] ダイアログ ボックスを開いた、[詳細設定]、[書式設定]、[IntelliSense] ノードにあります。
ko: C# 편집기에 대한 설정은 [도구]/[옵션] 대화 상자의 [고급], [서식] 및 [IntelliSense] 노드에 있습니다.
pl: Ustawienia edytora C# znajdujące się w węzłach Zaawansowane, Formatowanie i IntelliSense w oknie dialogowym Narzędzia/Opcje.
pt_br: Configurações para o editor C# localizadas nos nós Avançado, Formatação e IntelliSense, na caixa de diálogo Ferramentas/Opções.
ru: Параметры для редактора C# находятся во вкладках "Дополнительно", "Форматирование " и "IntelliSense" в диалоговом окне "Сервис/Параметры".
tr: C# düzenleyicisi için ayarlar Araçlar/Seçenekler iletişim kutusu içinde Gelişmiş, Biçimlendirme ve IntelliSense düğümleri altında bulunur.
zh_hans: 在“工具/选项”对话框中的“高级”、“格式设置”和“IntelliSense”节点下找到了 C# 编辑器的设置。
zh_hant: 在 [工具]/[選項] 對話方塊中的 [進階]、[格式化] 和 [IntelliSense] 節點下，所找到的 C# 編輯器設定。

source: Settings for general C# options found under the General and Tabs nodes in the Tools/Options dialog box.
cs: Nastavení pro obecné volby jazyka C# nalezené pod Obecné a Tabulátory v dialogovém okně Nástroje/Možnosti.
de: Einstellungen für allgemeine C#-Optionen, die sich unter "Tools" im Dialogfeld "Optionen" unter den Knoten "Allgemein" und "Tabstopps" befinden.
es: Configuración de opciones de C#; se encuentra en los nodos General y Tabulaciones del cuadro de diálogo Herramientas - Opciones.
fr: Paramètres des options C# générales accessibles à partir des noeuds Général et Tabulations via la boîte de dialogue Outils/Options.
it: Impostazioni per le opzioni generali di C# disponibili nei nodi Generale e Tabulazioni della finestra di dialogo Strumenti/Opzioni.
ja: 一般的な C# オプションの設定は、[ツール] メニューから [オプション] ダイアログ ボックスを開いた、[全般] ノードおよび [タブ] ノードにあります。
ko: 일반적인 C# 옵션에 대한 설정은 [도구]/[옵션] 대화 상자의 [일반] 및 [탭] 노드에 있습니다.
pl: Ustawienia ogólnych opcji C# znajdujące się w węzłach Ogólne i Karty w oknie dialogowym Narzędzia/Opcje.
pt_br: Configurações para opções gerais C# localizadas nos nós Geral e Guias, na caixa de diálogo Ferramentas/Opções.
ru: Общие параметры C# находятся во вкладках "Общие" и "Табуляция" в диалоговом окне "Сервис/Параметры".
tr: Genel C# seçenekleri için ayarlar Araçlar/Seçenekler iletişim kutusu içinde Genel ve Sekmeler düğümleri altında bulunur.
zh_hans: 在“工具/选项”对话框中的“常规”和“标签”节点下找到了常规 C# 选项的设置。
zh_hant: 在 [工具]/[選項] 對話方塊中的 [一般] 及 [定位點] 節點下，所找到的一般 C# 選項設定。

source: Underline reassigned variables; Display inline hints; Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Always use default symbol servers for navigation; Using directives; Place system directives first when sorting usings; Separate using directive groups; Suggest usings for types in reference assemblies; Suggest usings for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Collapse #regions on file open; Collapse usings on file open; Collapse metadata implementations on file open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused usings; Fade out unreachable code; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for ///; Insert * at the start of new lines when writing /* */ comments; Show preview for rename tracking; Split string literals on Enter; Report invalid placeholders in string.Format calls; Extract Method; Don't put ref or out on custom struct; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Colorize regular expressions; Highlight related components under cursor; Report invalid regular expressions; JSON; Colorize JSON strings; Report invalid JSON strings; Detect and offer editor features for JSON strings; Use enhanced colors; Editor Color Scheme; Inheritance Margin;
cs: Podtrhnout znovu přiřazené proměnné; Zobrazovat vložené nápovědy; Zobrazit diagnostiku pro zavřené soubory; Vybarvit regulární výraz; Zvýrazňovat související komponenty pod kurzorem; Nahlásit neplatné regulární výrazy; Povolit úplnou analýzu řešení; Provést analýzu funkcí editoru v externím procesu; Povolit navigaci na dekompilované zdroje; Pro navigaci vždy používat výchozí servery symbolů; Direktivy using; Při řazení direktiv using umístit systémové direktivy jako první; Oddělovat skupiny direktiv using; Navrhnout použití typů v sestaveních reference; Navrhnout použití typů v balíčcích NuGet; Zvýrazňování; Zvýrazňovat odkazy na symbol pod kurzorem; Zvýrazňovat související klíčová slova pod kurzorem; Sbalení; Po otevření souborů přejít do režimu osnovy; Sbalit #regions při otevření souboru; Sbalit použití při otevření souboru; Sbalit implementace metadat při otevření souboru; Zobrazovat oddělovače řádků procedur; Zobrazit sbalení pro konstrukty na úrovni deklarace; Zobrazit sbalení pro konstrukty na úrovni kódu; Zobrazit sbalení pro komentáře a oblasti pro preprocesor; Při sbalování na definice sbalovat oblasti; Zesvětlení; Zesvětlit nepoužité direktivy using; Zesvětlit nedosažitelný kód; Vodítka pro strukturu bloku; Zobrazit vodítka pro konstrukty na úrovni deklarace; Zobrazit vodítka pro konstrukty na úrovni kódu; Nápověda k editoru; Generovat komentáře dokumentace XML pro ///; Při psaní komentářů /* */ vkládat na začátek nových řádků hvězdičku (*); Zobrazovat náhled pro sledování přejmenování; Rozdělit literály řetězců u Enter; Oznamovat neplatné zástupné symboly ve voláních string.Format; Extrahovat metodu; Nevkládat odkaz nebo výstup do vlastní struktury; Implementovat rozhraní nebo abstraktní třídu; Vlastnosti, události a metody při vkládání umístit; s ostatními členy stejného druhu; na konec; Při generování vlastnosti; preferovat vyvolávací vlastnosti; preferovat automatické vlastnosti; regex; regulární výraz; Obarvit regulární výrazy; Zvýraznit související komponenty pod kurzorem; Nahlásit neplatné regulární výrazy; JSON; Obarvit řetězce JSON; Nahlásit neplatné řetězce JSON; Rozpoznat a nabízet funkce editoru pro řetězce JSON; rozšířené barvy; Barevné schéma editoru; Okraj dědičnosti;
de: Neu zugewiesene Variablen unterstreichen; Inlinehinweise anzeigen; Diagnoseinformationen für geschlossene Dateien anzeigen; Reguläre Ausdrücke farbig hervorheben; Zugehörige Komponenten unter dem Cursor hervorheben; Ungültige reguläre Ausdrücke melden; Vollständige Lösungsanalyse aktivieren; Editor-Funktionsanalyse in externem Prozess ausführen; Navigation zu dekompilierten Quellen aktivieren; Immer Standardsymbolserver für die Navigation verwenden; Verarbeitungsanweisungen; Systemanweisungen beim Sortieren von Verarbeitungen an erster Stelle platzieren; Verarbeitungsrichtliniengruppen aufteilen; Verarbeitungen für Typen in Verweisassemblys vorschlagen; Verarbeitungen für Typen in NuGet-Paketen vorschlagen; Hervorhebung; Verweise auf Symbol unter Cursor hervorheben; Verwandte Schlüsselbegriffe unter Cursor hervorheben; Gliederung; Gliederungsmodus beim Öffnen von Dateien starten; #regions beim Öffnen der Datei reduzieren; Verarbeitungen beim Öffnen von Dateien reduzieren; Metadatenimplementierungen beim Öffnen von Dateien reduzieren; Vorgangsreihentrenner anzeigen; Übersicht für Konstrukte auf Deklarationsebene anzeigen; Übersicht auf Codeebene anzeigen; Übersicht für Kommentare und Präprozessorregionen anzeigen; Regionen ausblenden, wenn Definitionen ausgeblendet werden; Ausblenden; Ungenutzte Verarbeitungen ausblenden; Unerreichbaren Code ausblenden; Strukturleitfäden sperren; Leitfäden für Konstrukte auf Deklarationsebene anzeigen; Leitfäden für Konstrukte auf Codeebene anzeigen; Editor-Hilfe; XML-Dokumentationskommentare für /// generieren; * Zu Beginn jeder neuen Zeile beim Schreiben von /* */-Kommentaren einfügen; Vorschau zur Nachverfolgung von Umbenennungen anzeigen; Zeichenfolgenliterale bei Eingabe trennen; Ungültige Platzhalter in Zeichenfolgen melden, Formataufrufe; Methode extrahieren; Keine Verwendung von „ref“ oder „out“ bei benutzerdefinierten Strukturen; Oberfläche oder abstrakte Klasse implementieren; Beim Einfügen von Eigenschaften, Ereignissen und Methoden, platzieren Sie sie; mit anderen gleichartigen Mitgliedern; zum Schluss; Beim Generieren einer Eigenschaft; bevorzugen Sie Wurf-Eigenschaften; bevorzugen Sie automatische Eigenschaften; regex; Regulärer Ausdruck; Reguläre Ausdrücke farbig markieren; Hervorheben ähnlicher Komponenten unter dem Cursor; Melden ungültiger regulärer Ausdrücke; JSON; JSON-Zeichenfolgen farbig machen; Ungültige JSON-Zeichenfolgen melden; Erkennen und Anbieten von Editor-Features für JSON-Zeichenfolgen; Verwenden verstärkter Farben; Editor-Farbschema; Vererbungsspielraum;
it: Sottolinea variabili riassegnate; Visualizza suggerimenti inline; Mostra diagnostica per i file chiusi; Colora espressione regolare; Evidenzia i componenti correlati sotto il cursore; Segnala espressioni regolari non valide; Abilita analisi della soluzione completa; Esegui analisi delle funzionalità dell'editor in processo esterno; Abilita spostamento a origini decompilate; Usa sempre i server con simboli predefiniti per lo spostamento; Direttive using; Inserisci prima le direttive system nell'ordinamento delle direttive using; Separa gruppi di direttive using; Suggerisci le direttive using per i tipi in assembly di riferimento; Suggerisci le direttive using per i tipi in pacchetti NuGet; Evidenziazione; Evidenzia riferimenti al simbolo sotto il cursore; Evidenzia parole chiave correlate sotto il cursore; Struttura; Attiva la modalità struttura all'apertura del file; Comprimi #regions all’apertura del file Comprimi gli utilizzi all’apertura del file; Comprimi le implementazioni dei metadati all’apertura del file; Mostra separatori di riga routine; Mostra la struttura per i costrutti a livello di dichiarazione; Mostra la struttura per i costrutti a livello di codice; Mostra la struttura per i commenti e le regioni del preprocessore; Comprimi regioni durante la compressione delle definizioni; Dissolvenza; Applica dissolvenza a direttive using non usate; Applica dissolvenza a codice non eseguibile; Guide per strutture a blocchi; Mostra le guide per i costrutti a livello di dichiarazione; Mostra le guide per i costrutti a livello di codice; Guida dell'editor; Genera commenti relativi alla documentazione XML per ///; Inserisci * all'inizio di nuove righe quando si scrivono commenti /* */; Mostra anteprima per verifica ridenominazione; Dividi valori letterali stringa dopo INVIO; Segnala segnaposto non validi in chiamate string.Format; Estrai metodo; Non inserire out o ref in uno struct personalizzato; Implementa interfaccia o classe astratta; Posiziona proprietà, eventi e metodi inseriti; con altri membri dello stesso tipo; alla fine; Durante la generazione della proprietà; preferisci proprietà generate; preferisci proprietà automatiche; regex; espressione regolare; Colora espressioni regolari; Evidenzia componenti correlati sotto il cursore; Segnala espressioni regolari non valide; JSON; Colora le stringhe JSON; Segnala stringhe JSON non valide; Rileva e offri funzionalità dell'editor per le stringhe JSON; Usa colori migliorati; Combinazione colori editor; Margine di ereditarietà;
tr: Yeniden atanan değişkenlerin altını çiz; Satır içi ipuçlarını görüntüleme; Kapatılan dosyalara ilişkin tanılamaları göster; Normal ifadeyi renklendir; İmlecin altındaki ilgili bileşenleri vurgula; Geçersiz normal ifadeleri bildir; Tam çözüm analizini etkinleştir; Dış işlemde düzenleyici özellik analizi gerçekleştir; Kaynak koda dönüştürülen kaynaklar için gezintiyi etkinleştir; Gezinti için her zaman varsayılan sembol sunucularını kullan; Using yönergeleri; Using yönergelerini sıralarken sistem yönergelerini en başa yerleştir; Using yönerge gruplarını ayır; Başvuru bütünleştirilmiş kodlarında türler için using yönergeleri öner; NuGet paketlerinde türler için using yönergeleri öner; Vurgulama; İmlecin altındaki sembole yönelik başvuruları vurgula; İmlecin altındaki ilgili anahtar sözcükleri vurgula; Ana Hat Oluşturma; Dosyalar açılırken ana hat oluşturma moduna gir; Dosya açılırken #regions daralt; Dosya açılırken using yönergelerini daralt; Dosya açılırken meta veri uygulamalarını daralt; Yordam satır ayırıcılarını göster; Bildirim düzeyinde yapılar için ana hattı göster; Kod düzeyinde yapılar için ana hattı göster; Açıklamalar ve ön işlemci bölgeleri için ana hattı göster; Tanımlara daraltırken bölgeleri daralt; Soluklaştırma; Kullanılmayan using yönergelerini soluklaştır; Erişilemeyen kodu soluklaştır; Blok Yapısı Kılavuzları; Bildirim düzeyinde yapılar için kılavuzları göster; Kod düzeyinde yapılar için kılavuzları göster; Düzenleyici Yardımı; /// için XML belge açıklamaları oluştur; /* */ açıklamaları yazılırken her yeni satırın başına * ekle; Yeniden adlandırma izlemesi için önizleme göster; Enter tuşuna basıldığında sabit değerli dizeleri böl; string.Format çağrılarındaki geçersiz yer tutucuları bildir; Ayıklama Metodu; Özel yapıya ref veya out koyma; Arabirim veya Soyut Sınıfı uygula; Özellik, olay ve metot eklerken bunları; aynı türdeki başka üyelerle birlikte; sona yerleştir; Özellik oluştururken; oluşturma özelliklerini tercih et; otomatik özellikleri tercih et; normal ifade; normal ifade; Normal ifadeleri renklendir; İmleç altındaki ilgili bileşenleri vurgula; Geçersiz normal ifadeleri bildir; JSON; JSON dizelerini renklendir; Geçersiz JSON dizelerini bildir; JSON dizeleri için düzenleyici özelliklerini algıla ve sun; Gelişmiş renkleri kullan; Düzenleyici Renk Düzeni; Devralma Kenar Boşluğu;

source: Automatically format when typing; Automatically format statement on semicolon ; Automatically format block on end brace; Automatically format on return; Automatically format on paste;
cs: Automaticky formátovat při psaní; Automaticky formátovat příkaz při středníku; Automaticky formátovat blok při koncové složené závorce; Automaticky formátovat při stisknutí klávesy Enter; Automaticky formátovat při vložení;
de: Automatisch während der Eingabe formatieren; Anweisung bei Semikolon automatisch formatieren; Block bei schließender geschweifter Klammer automatisch formatieren; Bei Verwendung der EINGABETASTE automatisch formatieren; Beim Einfügen automatisch formatieren;
es: Dar formato automáticamente al escribir; Dar formato automáticamente a la instrucción al introducir punto y coma; Dar formato automáticamente al bloque al introducir llave final; Dar formato automáticamente al volver; Dar formato automáticamente al pegar;
fr: Mettre en forme automatiquement en cours de frappe ; Mettre en forme automatiquement l'instruction quand un point-virgule est entré ; Mettre en forme automatiquement le bloc quand une accolade de fin est entrée ; Mettre en forme automatiquement au retour ; Mettre en forme automatiquement au moment du collage ;
it: Formatta automaticamente durante la digitazione; Formatta automaticamente istruzione dopo punto e virgola; Formatta automaticamente blocco dopo parentesi graffa finale; Formatta automaticamente dopo INVIO; Formatta automaticamente dopo operazione Incolla;
ja: 入力時にオートフォーマットする; セミコロンでステートメントをオートフォーマットする; 終わり中かっこでブロックをオートフォーマットする; 戻り時にオートフォーマットする; 貼り付け時にオートフォーマットする;
ko: 입력할 때 서식 자동 지정; 세미콜론 입력 시 문 서식 자동 지정; 닫는 중괄호 입력 시 블록 서식 자동 지정; 반환할 때 서식 자동 지정; 붙여넣을 때 서식 자동 지정;
pl: Formatuj automatycznie podczas pisania; Automatycznie sformatuj instrukcję w pozycji średnika ; Automatycznie sformatuj blok w pozycji nawiasu klamrowego; Formatuj automatycznie po przejściu do nowego wiersza; Automatycznie sformatuj przy wklejeniu;
pt_br: Formatar automaticamente ao digitar; Formatar automaticamente a instrução no ponto e vírgula; Formatar automaticamente o bloco na chave de fechamento; Formatar automaticamente na devolução; Formatar automaticamente na pasta;
ru: Автоматически форматировать при вводе; Автоматически форматировать оператор при вводе точки с запятой; Автоматически форматировать блок при вводе закрывающей фигурной скобки; Автоматически форматировать при возврате; Автоматически форматировать при вставке;
tr: Yazarken otomatik biçimlendir; Noktalı virgül girildiğinde deyimi otomatik biçimlendir; Kapama küme ayracı girildiğinde otomatik biçimlendir; Return tuşuna basıldığında otomatik biçimlendir; Yapıştırma sonrasında otomatik biçimlendir;
zh_hans: 键入时自动设置格式; 输入分号时自动设置语句的格式; 输入右大括号时自动设置块的格式; 返回时自动设置格式; 粘贴时自动设置格式;
zh_hant: 在鍵入時自動格式化; 在分號處自動將陳述式格式化; 在右大括號處自動將區塊格式化; 在換行時自動格式化; 在貼上時自動格式化;

source: Indent block contents; indent open and close braces; indent case contents; indent case contents (when block); indent case labels; label indentation; place goto labels in leftmost column; indent labels normally; place goto labels one indent less than current;
cs: Odsadit obsah bloku; odsadit levé a pravé složené závorky; odsadit obsah příkazu case; odsazovat obsah příkazu case (když je v bloku); odsadit návěští case; odsazení návěští; umístit návěští goto do sloupce nejvíce vlevo; odsadit návěští normálně; umístit návěští goto o jedno odsazení méně než je aktuální;
de: Blockinhalte einziehen; Öffnende und schließende geschweifte Klammern einziehen; case-Inhalte einziehen; case-Inhalte einziehen (bei Block); case-Bezeichnungen einziehen; Bezeichnungseinzug; goto-Bezeichnungen in Spalte ganz links platzieren; Bezeichnungen normal einziehen; goto-Bezeichnungen um eine Einzugsebene weiter links als die aktuelle Position platzieren;
es: Aplicar sangría al contenido del bloque; aplicar sangría a llaves de apertura y de cierre; aplicar sangría al contenido de case; aplicar sangría al contenido de case (cuando está bloqueado); aplicar sangría a etiquetas case; sangría de etiquetas; colocar etiquetas goto en primera columna de la izquierda; aplicar sangría normal a etiquetas; reducir una sangrí­a para las etiquetas goto;
fr: Mettre en retrait le contenu d'un bloc ; mettre en retrait les accolades ouvrantes et fermantes ; mettre en retrait le contenu de case ; mettre en retrait le contenu de case (dans un bloc) ; mettre en retrait les étiquettes case ; mise en retrait d'étiquette ; placer des étiquettes goto dans la colonne située le plus à gauche ; mettre en retrait normalement les étiquettes ; placer les étiquettes goto en retrait d'un niveau par rapport au niveau actuel ;
it: Imposta rientro per contenuto del blocco; imposta rientro per parentesi graffe di apertura e chiusura; imposta rientro per contenuto case; imposta rientro per contenuto case (quando è un blocco); imposta rientro per etichette case; imposta rientro per etichetta; inserisci etichette goto nella colonna più a sinistra; imposta rientro per etichette normalmente; inserisci etichette goto con un livello di rientro inferiore al corrente;
ja: ブロックの内容をインデントする; 始めと終わりの中かっこをインデントする; case の内容をインデントする; case の内容をインデントする (ブロックする場合); case ラベルをインデントする; ラベル インデント; goto ラベルを左端の列に配置する; ラベルを標準にインデントする; goto ラベルを現在より 1 インデントだけ下げて配置する;
ko: 블록 내용 들여쓰기; 여는 중괄호 및 닫는 중괄호 들여쓰기; case 내용 들여쓰기; case 내용 들여쓰기(블록); case 레이블 들여쓰기; 레이블 들여쓰기; 맨 왼쪽 열에 goto 레이블 배치; 보통 수준으로 레이블 들여쓰기; goto 레이블을 현재 수준보다 한 수준 더 들여쓰기;
pl: Wcięcie zawartości bloku; wcięcie otwierających i zamykających nawiasów klamrowych; wcięcie zawartości elementu case; wcięcie zawartości elementu case (w przypadku bloku); wcięcie etykiet elementu case; wcięcia etykiet; umieść etykiety instrukcji goto w kolumnie z lewej strony; normalne wcięcie etykiet; umieść etykiety instrukcji goto o jedno wcięcie bliżej niż bieżący element;
pt_br: Conteúdo do bloqueio de recuo; recuo aberto e fechamento de chaves; recuo do conteúdo do caso; recuo do conteúdo do caso (ao bloquear); rótulos de caso de recuo; recuo de rótulo; coloque os rótulos goto na coluna mais à esquerda; rótulos de recuo normalmente; coloque os rótulos goto um recuo menor que o atual;
ru: Делать отступ перед блоком комментариев; Делать отступ для открывающих и закрывающих фигурных скобок; Делать отступ в содержимом case; Делать отступ в содержимом case (для блока); Делать отступ меток case; Отступ для меток; Помещать метки goto в самый левый столбец; Делать нормальный отступ для меток; Помещать метки goto на один отступ меньше, чем текущие;
tr: Blok içeriğini girintile; açma ve kapama küme ayraçlarını girintile; case içeriğini girintile; case içeriğini girintile (engelliyken); case etiketlerini girintile; etiket girintileme; goto etiketlerini en soldaki sütuna yerleştir; etiketleri normal şekilde girintile; goto etiketlerinin girintisi geçerli düzeyden bir düzey az olsun;
zh_hans: 缩进块内容; 缩进左大括号和右大括号; 缩进 case 内容; 缩进 case 内容(阻止时); 缩进 case 标签; 标签缩进; 将 goto 标签置于最左侧的列中; 正常缩进标签; 将 goto 标签置于比当前位置缩进一个缩进级别的位置;
zh_hant: 將區塊內容縮排; 將左右大括號縮排; 將 case 內容縮排; 將 case 內容 (若為區塊) 縮排; 將 case 標籤縮排; 標籤縮排; 將 goto 標籤放入最左方欄位; 將標籤正常縮排; 將 goto 標籤在目前的位置凸出一排;
