Repository: dotnet/roslyn
Catalog: src/VisualStudio/CSharp/Impl/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: New line formatting option for braces;New line formatting options for keywords;New line options for braces; Place open brace on new line for types; Place open brace on new line for methods and local functions; Place open brace on new line for properties, indexers, and events; Place open brace on new line for property, indexer, and event accessors; Place open brace on new line for anonymous methods; Place open brace on new line for control blocks; Place open brace on new line for anonymous types; Place open brace on new line for object, collection and array initializers; New line options for keywords; Place else on new line; Place catch on new line; Place finally on new line; New line options for expression; Place members in object initializers on new line; Place members in anonymous types on new line; Place query expression clauses on new line;
cs: Možnost formátování nového řádku pro složené závorky;Možnosti formátování nového řádku pro klíčová slova;Možnosti nového řádku pro složené závorky; Pro typy umístit levou složenou závorku na nový řádek; Pro metody a lokální funkce umístit levou složenou závorku na nový řádek; Pro vlastnosti, indexery a události umístit levou složenou závorku na nový řádek; Pro přistupující objekty vlastností, indexerů a událostí umístit levou složenou závorku na nový řádek; Pro anonymní metody umístit levou složenou závorku na nový řádek; Pro řídicí bloky umístit levou složenou závorku na nový řádek; Pro anonymní typy umístit levou složenou závorku na nový řádek; Pro inicializátory objektů, kolekcí a polí umístit levou složenou závorku na nový řádek; Možnosti nového řádku pro klíčová slova; Umístit klíčové slovo else na nový řádek; Umístit klíčové slovo catch na nový řádek; Umístit klíčové slovo finally na nový řádek; Možnosti nového řádku pro výraz; Umístit členy v inicializátorech objektů na nový řádek; Umístit členy v anonymních typech na nový řádek; Umístit klauzule dotazového výrazu na nový řádek;
de: Zeilenwechsel-Formatierungsoption für geschweifte Klammern;Zeilenwechsel-Formatierungsoptionen für Schlüsselwörter;Zeilenwechseloptionen für geschweifte Klammern; Öffnende geschweifte Klammer für Typen in neuer Zeile platzieren; Öffnende geschweifte Klammer in neuer Zeile für Methoden und lokale Funktionen einfügen; Öffnende geschweifte Klammer für Eigenschaften, Indexer und Ereignisse in einer neuen Zeile einfügen; Öffnende geschweifte Klammer für eine Eigenschaft, den Indexer und Ereignisaccessor in einer neuen Zeile einfügen; Öffnende geschweifte Klammer für anonyme Methoden in neuer Zeile platzieren; Öffnende geschweifte Klammer für Kontrollblöcke in neuer Zeile platzieren; Öffnende geschweifte Klammer für anonyme Typen in neuer Zeile platzieren; Öffnende geschweifte Klammer für Objekt-, Sammlungs- und Arrayinitialisierer in neue Zeile einfügen; Zeilenwechseloptionen für Schlüsselwörter; else-Anweisung in neue Zeile setzen; catch-Anweisung in neue Zeile setzen; finally-Anweisung in neue Zeile setzen; Zeilenwechseloptionen für Ausdrücke; Member in Objektinitialisierern in neue Zeile setzen; Member in anonymen Typen in neue Zeile setzen; Klauseln von Abfrageausdrücken in neuer Zeile platzieren;
es: Opción de formato de nueva línea para llaves;Opciones de formato de nueva línea para palabras clave;Opciones de nueva línea para llaves; Colocar llave de apertura para tipos en nueva línea; Poner la llave de apertura en una línea nueva para los métodos y las funciones locales; Colocar llave de apertura para propiedades, indizadores y eventos en nueva línea; Colocar llave de apertura para descriptores de acceso de eventos, indizadores y propiedades en nueva línea; Colocar llave de apertura para métodos anónimos en nueva línea; Colocar llave de apertura para bloques de control en nueva línea; Colocar llave de apertura para tipos anónimos en nueva línea; Colocar llave de apertura en la nueva línea para los inicializadores de objeto, colección y matriz; Opciones de nueva línea para palabras clave; Colocar "else" en nueva línea; Colocar "catch" en nueva línea; Colocar "finally" en nueva línea; Opciones de nueva línea para expresiones; Colocar miembros de inicializadores de objetos en nueva línea; Colocar miembros en tipos anónimos en nueva línea; Colocar cláusulas de expresiones de consulta en nueva línea;
fr: Nouvelle option de mise en forme de ligne pour les accolades;Nouvelles options de mise en forme de ligne pour les mots clés;Nouvelles options de ligne pour les accolades; Placer une accolade ouvrante sur une nouvelle ligne pour les types ; Placer une accolade ouvrante sur une nouvelle ligne pour les méthodes et les fonctions locales ; Placer une accolade ouvrante sur une nouvelle ligne pour les propriétés, indexeurs et événements ; Placer une accolade ouvrante sur une nouvelle ligne pour les accesseurs de propriété, d'indexeur et d'événement ; Placer une accolade ouvrante sur une nouvelle ligne pour les méthodes anonymes ; Placer l'accolade ouvrante sur une nouvelle ligne pour les blocs de contrôle ; Placer une accolade ouvrante sur une nouvelle ligne pour les types anonymes ; Placer une accolade ouvrante sur une nouvelle ligne pour les initialiseurs d'objet, de collection et de tableau ; Nouvelles options de ligne pour les mots clés ; Placer else sur une nouvelle ligne ; Placer catch sur une nouvelle ligne ; Placer finally sur une nouvelle ligne ; Nouvelles options de lignes pour expressions ; Placer les membres dans les initialiseurs d'objets sur une nouvelle ligne ; Placer les membres dans les types anonymes sur une nouvelle ligne ; Placer les clauses d'expression de requête sur une nouvelle ligne ;
it: Opzione relativa alla nuova riga per parentesi graffe;Opzioni relative alla formattazione nuova riga per parole chiave;Opzioni di nuova riga per parentesi graffe; Inserisci parentesi graffa di apertura in una nuova riga per i tipi; Inserisci parentesi graffa di apertura in una nuova riga per metodi e funzioni locali; Inserisci parentesi graffa di apertura in una nuova riga per proprietà, indicizzatori ed eventi; Inserisci parentesi graffa di apertura in una nuova riga per funzioni di accesso a proprietà, indicizzatori ed eventi; Inserisci parentesi graffa di apertura in una nuova riga per i metodi anonimi; Inserisci parentesi graffa di apertura in una nuova riga per i blocchi di controllo; Inserisci parentesi graffa di apertura in una nuova riga per i tipi anonimi; Inserisci parentesi graffa di apertura in una nuova riga per inizializzatori di oggetto, raccolta e matrice; Opzioni di nuova riga per parole chiave; Inserisci "else" in una nuova riga; Inserisci "catch" in una nuova riga; Inserisci "finally" in una nuova riga; Opzioni di nuova riga per espressioni; Inserisci membri di inizializzatori di oggetto in una nuova riga; Inserisci membri di tipi anonimi in una nuova riga; Inserisci clausole di espressione di query in una nuova riga;
ja: 中かっこの改行書式オプション;キーワードの改行オプション;中かっこの改行オプション; 型の新しい行に始めかっこを配置する; メソッドとローカル関数の新しい行に始めかっこを配置する; プロパティ、インデクサー、イベントの新しい行に始めかっこを配置する; プロパティ、インデクサー、イベント アクセサーの新しい行に始めかっこを配置する; 匿名メソッドの新しい行に始めかっこを配置する; コントロール ブロックの新しい行に始めかっこを配置する; 匿名型の新しい行に始めかっこを配置する; オブジェクト、コレクション、および配列初期化子の新しい行に始めかっこを配置する; キーワードの改行オプション; 新しい行に else を配置する; 新しい行に catch を配置する; 新しい行に finally を配置する; 式の改行オプション; 新しい行にオブジェクト初期化子のメンバーを配置する; 新しい行に匿名型のメンバーを配置する; 新しい行にクエリ式の句を配置する;
ko: 중괄호에 대한 줄 바꿈 서식 옵션;키워드에 대한 줄 바꿈 서식 옵션;중괄호에 대한 줄 바꿈 옵션; 형식의 여는 중괄호를 새 줄에 배치; 메서드 및 로컬 함수의 여는 중괄호를 새 줄에 배치; 속성, 인덱서 및 이벤트의 여는 중괄호를 새 줄에 배치; 속성, 인덱서 및 이벤트 접근자의 여는 중괄호를 새 줄에 배치; 무명 메서드의 여는 중괄호를 새 줄에 배치; 제어 블록의 여는 중괄호를 새 줄에 배치; 무명 형식의 여는 중괄호를 새 줄에 배치; 개체, 컬렉션 및 배열 이니셜라이저의 여는 중괄호를 새 줄에 배치; 키워드에 대한 줄 바꿈 옵션; 새 줄에 else 배치; 새 줄에 catch 배치; 새 줄에 finally 배치; 식에 대한 줄 바꿈 옵션; 개체 이니셜라이저의 멤버를 새 줄에 배치; 무명 형식의 멤버를 새 줄에 배치; 쿼리 식의 절을 새 줄에 배치;
pl: Opcja formatowania nowego wiersza dla nawiasów;Opcje formatowania nowego wiersza dla słów kluczowych;Opcje nowego wiersza dla nawiasów klamrowych; Umieść otwierający nawias klamrowy w nowym wierszu dla typów; Umieść otwierający nawias klamrowy w nowym wierszu dla metod i funkcji lokalnych; Umieść otwierający nawias klamrowy w nowym wierszu dla właściwości, indeksatorów i zdarzeń; Umieść otwierający nawias klamrowy w nowym wierszu dla metod dostępu właściwości, indeksatora i zdarzenia; Umieść otwierający nawias klamrowy w nowym wierszu dla metod anonimowych; Umieść otwierający nawias klamrowy w nowym wierszu dla bloków sterowania; Umieść otwierający nawias klamrowy w nowym wierszu dla typów anonimowych; Umieść otwierający nawias klamrowy w nowym wierszu dla inicjatorów obiektów, kolekcji i tablic; Opcje nowego wiersza dla słów kluczowych; Umieść element else w nowym wierszu; Umieść element catch w nowym wierszu; Umieść element finally w nowym wierszu; Opcje nowego wiersza dla wyrażenia; Umieść składowe w inicjatorach obiektów w nowym wierszu; Umieść składowe typów anonimowych w nowym wierszu; Umieść klauzule wyrażenia zapytania w nowym wierszu;
pt_br: Nova opção de formatação de linha para chaves;Novas opções de formatação de linha para palavras-chave;Novas opções de linha para chaves; Colocar a chave aberta na nova linha para tipos; Colocar a chave aberta na nova linha para métodos e funções locais; Colocar a chave aberta na nova linha para propriedades, indexadores e eventos; Colocar a chave aberta na nova linha para os acessadores de propriedade, indexador e evento; Colocar a chave aberta na nova linha para métodos anônimos; Colocar a chave aberta na nova linha para os blocos de controle; Colocar a chave aberta na nova linha para tipos anônimos; Colocar a chave aberta na nova linha para inicializadores de objeto, coleção e matriz; Novas opções de linha para palavras-chave; Colocar outro na nova linha; Colocar variável na nova linha; Colocar finalmente na nova linha; Novas opções de linha para expressão; Colocar membros em inicializadores de objeto na nova linha; Colocar membros em tipos anônimos na nova linha; Colocar cláusulas de expressão de consulta na nova linha;
ru: Параметры форматирования новой строки для фигурных скобок;Параметры форматирования новой строки для ключевых слов;Параметры новых строк для фигурных скобок; Располагать открывающую фигурную скобку на новой строке для типов; Располагать открывающую фигурную скобку на новой строке для методов и локальных функций; Располагать открывающую фигурную скобку на новой строке для свойств, индексаторов и событий; Располагать открывающую фигурную скобку на новой строке для методов доступа к свойству, индексатору или событию; Располагать открывающую скобку на новой строке для анонимных методов; Располагать открывающую фигурную скобку на новой строке для блоков управления; Располагать открывающую скобку на новой строке для анонимных типов; Располагать открывающую скобку на новой строке для объекта, коллекции и инициализаторов массива; Параметры новых строк для ключевых слов; Располагать else на новой строке; Располагать catch на новой строке; Располагать finally на новой строке; Параметры новых строк для выражения; Располагать члены инициализаторов объекта на новой строке; Располагать члены в анонимных типах на новой строке; Располагать выражения запроса на новой строке;
tr: Küme ayraçları için yeni satır biçimlendirme seçeneği;Anahtar sözcükler için yeni satır biçimlendirme seçenekleri;Küme ayraçları için yeni satır seçenekleri; Türler için yeni satıra açma küme ayracı yerleştir; Metotlar ve yerel işlemler için yeni satıra açma küme ayracı yerleştir; Özellikler, dizin oluşturucular ve olaylar için yeni satıra açma küme ayracı yerleştir; Özellik, dizin oluşturucusu ve olay erişimcileri için yeni satıra açma küme ayracı yerleştir; Anonim metotlar için yeni satıra açma küme ayracı yerleştir; Denetim blokları için yeni satıra açma küme ayracı yerleştir; Anonim türler için yeni satıra açma küme ayracı yerleştir; Nesne, koleksiyon ve dizi başlatıcıları için yeni satıra açma küme ayracı yerleştir; Anahtar sözcükler için yeni satır seçenekleri; Else anahtar sözcüğünü yeni satıra yerleştir; Catch anahtar sözcüğünü yeni satıra yerleştir; Finally anahtar sözcüğünü yeni satıra yerleştir; İfade için yeni satır seçenekleri; Nesne başlatıcısındaki üyeleri yeni satıra yerleştir; Anonim türlerdeki üyeleri yeni satıra yerleştir; Sorgu ifadesi yan tümcelerini yeni satıra yerleştir;
zh_hans: 针对大括号的新行格式选项;针对关键字的新行格式选项;针对大括号的新行选项; 在类型的新行上放置左大括号; 在方法和本地函数的新行上放置左大括号; 在属性、索引器和事件的新行上放置左大括号; 在属性、索引器和事件访问器的新行上放置左大括号; 在匿名方法的新行上放置左大括号; 在控制块的新行上放置左大括号; 在匿名类型的新行上放置左大括号; 在对象、集合和数组初始值设定像的新行上放置左大括号; 针对关键字的新行选项; 在新行上放置 else; 在新行上放置 catch; 在新行上放置 finally; 针对表达式的新行选项; 在新行上的对象初始值设定项中放置成员; 在新行上的匿名类型中放置类型; 在新行上放置查询表达式子句;
zh_hant: 大括號的新行格式化選項;關鍵字的新行格式化選項;大括號的新行選項; 針對類型將左大括號換到新行; 針對方法和區域函式將左大括號換到新行; 針對屬性、索引子和事件將左大括號換到新行; 針對屬性、索引子和事件存取子將左大括號換到新行; 針對匿名方法將左大括號換到新行; 針對控制區塊將左大括號換到新行; 針對匿名類型將左大括號換到新行; 針對物件、集合和陣列初始設定式將左大括號換到新行; 關鍵字的新行選項; 將 else 換到新行; 將 catch 換到新行; 將 finally 換到新行; 運算式的新行選項; 將物件初始設定式中的成員換到新行; 將匿名類型中的成員換到新行; 將查詢運算式子句換到新行;
