Repository: dotnet/roslyn
Catalog: src/Compilers/Core/MSBuildTask/xlf/ErrorString.*.xlf
Languages: cs, de, fr, it, ko, pl, pt_br, ru, tr, zh_hant

# Compiler_UnexpectedException
source: MSB3883: Unexpected exception:
cs: MSB3883: Neočekávaná výjimka:
de: MSB3883: Unerwartete Ausnahme:
fr: MSB3883: Exception inattendue :
it: MSB3883: Eccezione imprevista:
ko: MSB3883: 예기치 않은 예외:
pl: MSB3883: Nieoczekiwany wyjątek:
pt_br: MSB3883: Exceção inesperada:
ru: MSB3883: непредвиденное исключение:
tr: MSB3883: Beklenmeyen özel durum:
zh_hant: MSB3883: 未預期的例外狀況:

# CopyRefAssembly_Changed
source: Source reference assembly "{0}" (timestamp "{1}", MVID "{2}") differs from destination "{3}" (timestamp "{4}", MVID "{5}").
cs: Zdrojové referenční sestavení {0} (časové razítko {1}, MVID {2}) se liší od cíle {3} (časové razítko {4}, MVID {5}).
ko: 원본 참조 어셈블리 "{0}"(타임스탬프 "{1}", MVID "{2}")이(가) 대상 "{3}"(타임스탬프 "{4}", MVID "{5}")과(와) 다릅니다.
pt_br: A fonte de assembly de referência “{0}” (carimbo de data/hora “{1}”, MVID "{2}") difere do destino “{3}”(carimbo de data/hora “{4}”, MVID "{5}").
ru: Исходная базовая сборка "{0}" (метка времени "{1}", MVID "{2}") отличается от целевой "{3}" (метка времени "{4}", MVID "{5}").
tr: "{0}" kaynak başvuru bütünleştirilmiş kodu (zaman damgası: "{1}", MVID: "{2}") "{3}" hedefinden (zaman damgası: "{4}", MVID: "{5}") farklı.
zh_hant: 來源參考組件 "{0}" (時間戳記 "{1}"，MVID "{2}") 與目的地 "{3}" (時間戳記 "{4}"，MVID "{5}") 不同。

# CopyRefAssembly_Copying
source: Copying reference assembly from "{0}" to "{1}".
cs: Kopíruje se referenční sestavení z {0} do {1}.
ko: "{0}"에서 "{1}"(으)로 참조 어셈블리를 복사하는 중입니다.
pt_br: Copiando assembly de referência de "{0}" para "{1}".
ru: Копирование эталонной сборки из "{0}" в "{1}".
tr: Başvuru bütünleştirilmiş kodu "{0}" konumundan "{1}" konumuna kopyalanıyor.
zh_hant: 正在將參考組件從 "{0}" 複製到 "{1}"。

# Csc_AssemblyAliasContainsIllegalCharacters
source: MSB3053: The assembly alias "{1}" on reference "{0}" contains illegal characters.
cs: MSB3053: Alias sestavení {1} odkazu {0} obsahuje neplatné znaky.
de: MSB3053: Der Assemblyalias "{1}" für den Verweis "{0}" enthält ungültige Zeichen.
fr: MSB3053: L'alias de l'assembly "{1}" sur la référence "{0}" contient des caractères non conformes.
it: MSB3053: l'alias dell'assembly "{1}" nel riferimento "{0}" contiene caratteri non ammessi.
ko: MSB3053: "{0}" 참조의 어셈블리 별칭 "{1}"에 잘못된 문자가 포함되어 있습니다.
pl: MSB3053: Alias zestawu „{1}” w odwołaniu „{0}” zawiera niedozwolone znaki.
pt_br: MSB3053: O alias do assembly "{1}" na referência "{0}" contém caracteres inválidos.
ru: MSB3053: псевдоним сборки "{1}" для ссылки "{0}" содержит недопустимые знаки.
tr: MSB3053: "{0}" başvurusundaki "{1}" derleme diğer adında geçersiz karakterler var.
zh_hant: MSB3053: 參考 "{0}" 上的組件別名 "{1}" 包含不合法的字元。

# Csc_InvalidParameter
source: MSB3051: The parameter to the compiler is invalid. {0}
cs: MSB3051: Parametr kompilátoru je neplatný. {0}
de: MSB3051: Der Parameter für den Compiler ist ungültig. {0}
fr: MSB3051: Le paramètre du compilateur n'est pas valide. {0}
it: MSB3051: parametro del compilatore non valido. {0}
ko: MSB3051: 컴파일러에 대한 매개 변수가 잘못되었습니다. {0}
pl: MSB3051: Parametr podany w kompilatorze jest nieprawidłowy. {0}
pt_br: MSB3051: O parâmetro para o compilador é inválido. {0}
ru: MSB3051: недопустимый параметр для компилятора. {0}
tr: MSB3051: Derleyici parametresi geçersiz. {0}
zh_hant: MSB3051: 編譯器的參數無效。{0}

# Csc_InvalidParameterWarning
source: MSB3052: The parameter to the compiler is invalid, '{0}{1}' will be ignored.
cs: MSB3052: Parametr kompilátoru je neplatný, {0}{1} se bude ignorovat.
de: MSB3052: Der Parameter für den Compiler ist ungültig. "{0}{1}" wird ignoriert.
fr: MSB3052: Le paramètre du compilateur n'est pas valide. '{0}{1}' sera ignoré.
it: MSB3052: il parametro per il compilatore non è valido. '{0}{1}' verrà ignorato.
ko: MSB3052: 컴파일러에 대한 매개 변수가 잘못되었습니다. '{0}{1}'이(가) 무시됩니다.
pl: MSB3052: Parametr podany w kompilatorze jest nieprawidłowy, element „{0}{1}” zostanie zignorowany.
pt_br: MSB3052: O parâmetro para o compilador é inválido; "{0}{1}" será ignorado.
ru: MSB3052: недопустимый параметр для компилятора. "{0}{1}" будет пропущен.
tr: MSB3052: Derleyici parametresi geçersiz. '{0}{1}' yoksayılacak.
zh_hant: MSB3052: 編譯器的參數無效，將忽略 '{0}{1}'。

# General_CannotConvertStringToBool
source: The string "{0}" cannot be converted to a boolean (true/false) value.
cs: Řetězec {0} nejde převést na logickou hodnotu (true/false).
de: Die Zeichenfolge "{0}" kann nicht in einen booleschen Wert (true/false) konvertiert werden.
fr: Impossible de convertir la chaîne "{0}" en valeur booléenne (true/false).
it: Non è possibile convertire la stringa "{0}" in un valore booleano (true/false).
ko: "{0}" 문자열을 부울 값(true/false)으로 변환할 수 없습니다.
pl: Ciągu „{0}” nie można przekonwertować na wartość logiczną (true/false).
pt_br: A cadeia de caracteres "{0}" não pode ser convertida em um valor booliano (true/false).
ru: Строка "{0}" не может быть преобразована в логическое значение (истина/ложь).
tr: "{0}" dizesi bir boole (doğru/yanlış) değerine dönüştürülemiyor.
zh_hant: 無法將字串 "{0}" 轉換成布林值 (true/false)。

# General_CouldNotSetHostObjectParameter
source: MSB3081: A problem occurred while trying to set the "{0}" parameter for the IDE's in-process compiler. {1}
cs: MSB3081: Při pokusu o nastavení parametru {0} pro vnitroprocesový kompilátor prostředí IDE došlo k potížím. {1}
de: MSB3081: Problem beim Festlegen des Parameters "{0}" für den In-Process-Compiler der IDE. {1}
fr: MSB3081: Un problème s'est produit durant la tentative de définition du paramètre "{0}" pour le compilateur in-process de l'IDE. {1}
it: MSB3081: si è verificato un problema durante il tentativo di impostare il parametro "{0}" per il compilatore in-process dell'IDE. {1}
ko: MSB3081: IDE의 In-Process 컴파일러에 "{0}" 매개 변수를 설정하는 동안 문제가 발생했습니다. {1}
pl: MSB3081: Wystąpił problem podczas próby ustawienia parametru „{0}” dla wewnątrzprocesowego kompilatora programu IDE. {1}
pt_br: MSB3081: Ocorreu um problema durante a tentativa de definir o parâmetro "{0}" para o compilador em processo do IDE. {1}
ru: MSB3081: возникла проблема при установке параметра "{0}" для компилятора интегрированной среды разработки внутри процесса. {1}
tr: MSB3081: IDE'nin işlem içi derleyicisi için "{0}" parametresi ayarlanmaya çalışılırken bir sorunla karşılaşıldı. {1}
zh_hant: MSB3081: 嘗試設定 IDE 同處理序編譯器的 "{0}" 參數時發生問題。{1}

# General_DuplicateItemsNotSupported
source: MSB3105: The item "{0}" was specified more than once in the "{1}" parameter. Duplicate items are not supported by the "{1}" parameter.
cs: MSB3105: Položka {0} byla v parametru {1} uvedená víc než jednou. Parametr {1} nepodporuje duplicitní položky.
de: MSB3105: Das Element "{0}" wurde im Parameter "{1}" mehrmals angegeben. Doppelte Elemente werden vom Parameter "{1}" nicht unterstützt.
fr: MSB3105: L'élément "{0}" a été spécifié plus d'une fois dans le paramètre "{1}". Les éléments dupliqués ne sont pas pris en charge par le paramètre "{1}".
it: MSB3105: l'elemento "{0}" è stato specificato più di una volta nel parametro "{1}", ma il parametro "{1}" non supporta gli elementi duplicati.
ko: MSB3105: "{0}" 항목을 "{1}" 매개 변수에 두 번 이상 지정했습니다. "{1}" 매개 변수는 중복 항목을 지원하지 않습니다.
pl: MSB3105: Element „{0}” został określony wielokrotnie w parametrze „{1}”. Zduplikowane elementy nie są obsługiwane przez parametr „{1}”.
pt_br: MSB3105: O item "{0}" foi especificado mais de uma vez no parâmetro "{1}". O parâmetro "{1}" não dá suporte a itens duplicados.
ru: MSB3105: элемент "{0}" указан в параметре "{1}" более одного раза. Дублированные элементы не поддерживаются параметром "{1}".
tr: MSB3105: "{0}" öğesi, "{1}" parametresinde bir kereden fazla belirtildi. "{1}" parametresi yinelenen öğeleri desteklemez.
zh_hant: MSB3105: 項目 "{0}" 在 "{1}" 參數中指定了一次以上。"{1}" 參數不支援重複的項目。

# General_DuplicateItemsNotSupportedWithMetadata
source: MSB3083: The item "{0}" was specified more than once in the "{1}" parameter and both items had the same value "{2}" for the "{3}" metadata. Duplicate items are not supported by the "{1}" parameter unless they have different values for the "{3}" metadata.
cs: MSB3083: Položka {0} byla v parametru {1} uvedená víc než jednou a oba výskyty obsahují stejnou hodnotu {2} metadat {3}. Duplicitní položky se u parametru {1} nepodporují, pokud neobsahují různé hodnoty metadat {3}.
de: MSB3083: Das Element "{0}" wurde im Parameter "{1}" mehrmals angegeben, und beide Elemente enthalten den Wert "{2}" für die {3}-Metadaten. Doppelte Elemente werden vom Parameter "{1}" nur unterstützt, wenn sie unterschiedliche Werte für die {3}-Metadaten enthalten.
fr: MSB3083: L'élément "{0}" a été spécifié plusieurs fois dans le paramètre "{1}". Les deux éléments avaient la même valeur "{2}" pour les métadonnées "{3}". Les éléments dupliqués ne sont pas pris en charge par le paramètre "{1}" à moins qu'ils n'aient des valeurs différentes pour les métadonnées "{3}".
it: MSB3083: l'elemento "{0}" è stato specificato più di una volta nel parametro "{1}" ed entrambi gli elementi hanno lo stesso valore "{2}" per i metadati di "{3}". Il parametro "{1}" non supporta gli elementi duplicati a meno che non includano valori diversi per i metadati di "{3}".
ko: MSB3083: "{0}" 항목이 "{1}" 매개 변수에 두 번 이상 지정되었으며 두 항목이 "{3}" 메타데이터에 대해 동일한 값 "{2}"을(를) 가지고 있습니다. "{3}" 메타데이터에 대한 값이 같으면 "{1}" 매개 변수는 중복 항목을 지원하지 않습니다.
pl: MSB3083: Element „{0}” został określony więcej niż raz w parametrze „{1}” i oba elementy miały tę samą wartość „{2}” metadanych „{3}”. Zduplikowane elementy w parametrze „{1}” nie są obsługiwane, jeśli nie mają różnych wartości metadanych „{3}”.
pt_br: MSB3083: O item "{0}" foi especificado mais de uma vez no parâmetro "{1}" e ambos os itens tinham o mesmo valor "{2}" para os metadados "{3}". O parâmetro "{1}" não dá suporte a itens duplicados, a menos que eles tenham valores diferentes para os metadados "{3}".
ru: MSB3083: элемент "{0}" указан в параметре "{1}" более одного раза, и оба элемента имеют одинаковое значение "{2}" для метаданных "{3}". Дублирование элементов с одинаковыми значениями для метаданных "{3}" в параметре "{1}" не поддерживается.
tr: MSB3083: "{1}" parametresinde "{0}" öğesi birden çok kez belirtildi ve her iki öğe de "{3}" meta verisi için aynı "{2}" değerini içeriyordu. "{1}" parametresi, "{3}" meta verisi için farklı değerlere sahip olmayan yinelenen öğeleri desteklemez.
zh_hant: MSB3083: 項目 "{0}" 在 "{1}" 參數中指定了一次以上，而且這兩個項目對於 "{3}" 中繼資料都擁有相同的值 "{2}"。"{1}" 參數不支援重複的項目，除非它們對於 "{3}" 中繼資料擁有不同的值。

# General_ExpectedFileMissing
source: Expected file "{0}" does not exist.
cs: Očekávaný soubor {0} neexistuje.
de: Die erwartete Datei "{0}" ist nicht vorhanden.
fr: Le fichier attendu "{0}" n'existe pas.
it: Il file previsto "{0}" non esiste.
ko: 필요한 "{0}" 파일이 없습니다.
pl: Oczekiwany plik „{0}” nie istnieje.
pt_br: O arquivo esperado "{0}" não existe.
ru: Ожидаемый файл "{0}" не существует.
tr: Beklenen "{0}" dosyası yok.
zh_hant: 預期的檔案 "{0}" 不存在。

# CopyRefAssembly_SkippingCopy1
source: Reference assembly "{0}" already has latest information. Leaving it untouched.
cs: Referenční sestavení {0} už má nejnovější informace. Nic se v něm nezmění.
de: Die Referenzassembly "{0}" verfügt bereits über die neuesten Informationen. Bleibt unverändert.
fr: L'assembly de référence "{0}" a déjà les informations les plus récentes. Aucun changement ne sera apporté.
it: Le informazioni nell'assembly di riferimento "{0}" sono già le più recenti. Non verranno modificate.
ko: 참조 어셈블리 "{0}"에 이미 최신 정보가 있습니다. 그대로 유지합니다.
pl: Zestaw odwołania „{0}” już zawiera najnowsze informacje. Nie modyfikuj go.
pt_br: O assembly de referência "{0}" já tem as informações mais recentes. Ele será mantido inalterado.
ru: Базовая сборка "{0}" уже содержит актуальные сведения. Изменения не требуются.
tr: "{0}" başvuru bütünleştirilmiş kodu zaten son bilgileri içeriyor. Olduğu gibi bırakılıyor.
zh_hant: 參考組件 "{0}" 已有最新資訊。請勿更動。

# CopyRefAssembly_SourceNotRef1
source: Could not extract the MVID from "{0}". Are you sure it is a reference assembly?
cs: Nepovedlo se extrahovat MVID z {0}. Jste si jistí, že je to referenční sestavení?
de: Von "{0}" konnte keine MVID extrahiert werden. Sind Sie sicher, dass es sich dabei um eine Referenzassembly handelt?
fr: Impossible d'extraire le MVID à partir de "{0}". Êtes-vous sûr qu'il s'agit d'un assembly de référence ?
it: Non è stato possibile estrarre il MVID da "{0}". Si è sicuri che si tratti di un assembly di riferimento?
ko: "{0}"에서 MVID를 추출할 수 없습니다. 참조 어셈블리가 맞는지 확인하세요.
pl: Nie można wyodrębnić identyfikatora MVID z elementu „{0}”. Czy to na pewno jest zestaw odwołania?
pt_br: Não foi possível extrair o MVID de "{0}". Tem certeza de que este é um assembly de referência?
ru: Не удалось извлечь MVID из "{0}". Вы уверены, что это ссылочная сборка?
tr: "{0}" öğesinden MVID ayıklanamadı. Bunun bir başvuru bütünleştirilmiş kodu olduğundan emin misiniz?
zh_hant: 無法從 "{0}" 擷取 MVID。確定其為參考組件嗎?

# CopyRefAssembly_BadSource3
source: Failed to check the content hash of the source ref assembly '{0}': {1} {2}
cs: Nepovedlo se zkontrolovat hodnotu hash obsahu zdrojového referenčního sestavení {0}: {1} {2}
de: Fehler beim Überprüfen des Inhaltshashs der Quellreferenzassembly "{0}": {1} {2}
fr: Échec de la vérification du hachage de contenu de l'assembly de référence source '{0}' : {1} {2}
it: Non è stato possibile verificare l'hash del contenuto dell'assembly di riferimento di origine '{0}': {1} {2}
ko: 소스 참조 어셈블리 '{0}'의 콘텐츠 해시를 확인하지 못했습니다. {1} {2}
pl: Nie można sprawdzić skrótu zawartości docelowego zestawu odwołania „{0}”: {1} {2}
pt_br: Falha ao verificar o hash de conteúdo do assembly de referência de origem '{0}': {1} {2}
ru: Не удалось проверить хеш содержимого для исходной базовой сборки "{0}": {1} {2}
tr: Kaynak ürün kodu derleme '{0}' içerik karma denetlemek başarısız oldu: {1} {2}
zh_hant: 無法檢查來源參考組件 '{0}' 的內容雜湊: {1} {2}

# CopyRefAssembly_BadDestination1
source: Failed to check the content hash of the destination ref assembly '{0}'. It will be overwritten.
cs: Nepovedlo se zkontrolovat hodnotu hash obsahu cílového referenčního sestavení {0}. Přepíše se.
de: Fehler beim Überprüfen des Inhaltshashs der Zielreferenzassembly "{0}". Er wird überschrieben.
fr: Échec de la vérification du hachage de contenu de l'assembly de référence de destination '{0}'. Il sera remplacé.
it: Non è stato possibile verificare l'hash del contenuto dell'assembly di riferimento di destinazione '{0}'. Verrà sovrascritto.
ko: 대상 참조 어셈블리 '{0}'의 콘텐츠 해시를 확인하지 못했으므로 이 대상 참조 어셈블리를 덮어씁니다.
pl: Nie można sprawdzić skrótu zawartości docelowego zestawu odwołania „{0}”. Zostanie on zastąpiony.
pt_br: Falha ao verificar o hash de conteúdo do assembly de referência de destino '{0}'. Ele será substituído.
ru: Не удалось проверить хеш содержимого для конечной базовой сборки "{0}". Он будет перезаписан.
tr: Hedef ürün kodu derleme '{0}' içerik karma denetlemek başarısız oldu. O-ecek var overwritten.
zh_hant: 無法檢查目的地參考組件 '{0}' 的內容雜湊。其將被覆寫。

# General_ToolFileNotFound
source: MSB3082: Task failed because "{0}" was not found.
cs: MSB3082: Úloha nebyla úspěšná, protože nešlo najít {0}.
de: MSB3082: Aufgabe fehlgeschlagen, da "{0}" nicht gefunden wurde.
fr: MSB3082: Échec de la tâche, car "{0}" est introuvable.
it: MSB3082: l'attività non è riuscita perché "{0}" non è stato trovato.
ko: MSB3082: "{0}"을(를) 찾을 수 없어서 작업에 실패했습니다.
pl: MSB3082: Zadanie zakończyło się niepowodzeniem, ponieważ nie można znaleźć elementu „{0}”.
pt_br: MSB3082: a tarefa falhou porque "{0}" não foi encontrado.
ru: MSB3082: сбой задачи, так как не удалось найти "{0}".
tr: MSB3082: "{0}" bulunamadığı için görev başarısız oldu.
zh_hant: MSB3082: 因為找不到 "{0}"，所以工作失敗。

# General_IncorrectHostObject
source: MSB3087: An incompatible host object was passed into the "{0}" task. The host object for this task must implement the "{1}" interface.
cs: MSB3087: Úloze {0} se předal nekompatibilní objekt hostitele. Objekt hostitele pro tuto úlohu musí implementovat rozhraní {1}.
de: MSB3087: Ein inkompatibles Hostobjekt wurde an die Aufgabe "{0}" übergeben. Das Hostobjekt für diese Aufgabe muss die {1}-Schnittstelle implementieren.
fr: MSB3087: Un objet hôte incompatible a été passé à la tâche "{0}". L'objet hôte pour cette tâche doit implémenter l'interface "{1}".
it: MSB3087: all'attività "{0}" è stato passato un oggetto host incompatibile. L'oggetto host di questa attività deve implementare l'interfaccia "{1}".
ko: MSB3087: 호환되지 않는 호스트 개체가 "{0}" 작업에 전달되었습니다. 이 작업의 호스트 개체는 "{1}" 인터페이스를 구현해야 합니다.
pl: MSB3087: Do zadania „{0}” przekazano niezgodny obiekt hosta. Obiekt hosta tego zadania musi implementować interfejs „{1}”.
pt_br: MSB3087: Foi passado um objeto de host incompatível para a tarefa "{0}". O objeto de host desta tarefa deve implementar a interface "{1}".
ru: MSB3087: в задачу "{0}" передан несовместимый объект базовой среды. В объекте базовой среды для этой задачи должен быть реализован интерфейс "{1}".
tr: MSB3087: "{0}" görevine uyumlu olmayan bir ana nesnesi geçirildi. Bu görevin ana nesnesi "{1}" arabirimini uygulamalıdır.
zh_hant: MSB3087: "{0}" 工作中已傳入不相容的主物件。這項工作的主物件必須實作 "{1}" 介面。

# General_InvalidAttributeMetadata
source: Item "{0}" has attribute "{1}" with value "{2}" that could not be converted to "{3}".
cs: Položka {0} má atribut {1} s hodnotou {2}, kterou nebylo možné převést na hodnotu {3}.
de: Das Element "{0}" enthält das {1}-Attribut mit dem Wert "{2}", der nicht in "{3}" konvertiert werden konnte.
fr: L'élément "{0}" a l'attribut "{1}" avec la valeur "{2}", qui n'a pas pu être convertie en "{3}".
it: L'elemento "{0}" contiene l'attributo "{1}" con valore "{2}" che non è stato possibile convertire in "{3}".
ko: "{0}" 항목에 "{3}"(으)로 변환할 수 없는 "{2}" 값이 있는 "{1}" 특성이 있습니다.
pl: Element „{0}” ma atrybut „{1}” o wartości „{2}”, którego nie można przekonwertować na „{3}”.
pt_br: O item "{0}" tem atributo "{1}" com valor "{2}" que não pôde ser convertido para "{3}".
ru: У элемента "{0}" имеется атрибут "{1}" со значением "{2}", который не удалось преобразовать в "{3}".
tr: "{0}" öğesinin, "{3}" değerine dönüştürülemeyen "{2}" değerine sahip "{1}" özniteliği var.
zh_hant: 項目 "{0}" 的屬性 "{1}" 的值為 "{2}"，不能轉換為 "{3}"。

# General_ParameterUnsupportedOnHostCompiler
source: The IDE's in-process compiler does not support the specified values for the "{0}" parameter. Therefore, this task will fallback to using the command-line compiler.
cs: Vnitroprocesový kompilátor prostředí IDE nepodporuje zadané hodnoty pro parametr {0}. U této úlohy se proto přepne na používání kompilátoru příkazového řádku.
de: Der In-Process-Compiler der IDE unterstützt die für den Parameter "{0}" angegebenen Werte nicht. Aus diesem Grund weicht diese Aufgabe auf den Befehlszeilencompiler aus.
fr: Le compilateur in-process de l'IDE ne prend pas en charge les valeurs spécifiées pour le paramètre "{0}". Cette tâche utilisera donc le compilateur de ligne de commande.
it: Il compilatore in-process dell'IDE non supporta i valori specificati per il parametro "{0}", di conseguenza per questa attività verrà usato in sostituzione il compilatore da riga di comando.
ko: IDE의 In-Process 컴파일러에서는 "{0}" 매개 변수에 지정한 값이 지원되지 않으므로 대신 명령줄 컴파일러에서 이 작업을 처리합니다.
pl: Wewnątrzprocesowy kompilator środowiska IDE nie obsługuje określonych wartości dla parametru „{0}”. Dlatego to zadanie powróci do używania kompilatora wiersza polecenia.
pt_br: O compilador em processo do IDE não dá suporte aos valores especificados para o parâmetro "{0}". Portanto, essa tarefa fará fallback para o uso do compilador linha de comando.
ru: Внутрипроцессный компилятор интегрированной среды разработки не поддерживает указанные значения параметра "{0}". Поэтому задача будет использовать компилятор командной строки.
tr: IDE'nin işlem içi derleyicisi, "{0}" parametresi için belirtilen değerleri desteklemiyor. Bu nedenle, bu görev komut satırı derleyicisini kullanmak için geri dönecek.
zh_hant: IDE 的同處理序編譯器不支援 "{0}" 參數的指定值。因此，這項工作將改為使用命令列編譯器。

# General_ReferenceDoesNotExist
source: MSB3104: The referenced assembly "{0}" was not found. If this assembly is produced by another one of your projects, please make sure to build that project before building this one.
cs: MSB3104: Odkazované sestavení {0} se nenašlo. Pokud je toto sestavení vytvořené jiným projektem, je třeba daný projekt sestavit před sestavením tohoto projektu.
de: MSB3104: Die referenzierte Assembly "{0}" wurde nicht gefunden. Falls diese Assembly von einem anderen Projekt erstellt wird, muss dieses Projekt vor diesem Projekt erstellt werden.
fr: MSB3104: L'assembly référencé "{0}" est introuvable. Si cet assembly est produit par l'un de vos projets, assurez-vous de générer ce projet avant de générer celui-ci.
it: MSB3104: il modello "{0}" a cui si fa riferimento non è stato trovato. Se l'assembly è prodotto da un altro progetto, assicurarsi di compilare tale progetto prima di compilare quello corrente.
ko: MSB3104: 참조된 어셈블리 "{0}"을(를) 찾을 수 없습니다. 다른 프로젝트에서 이 어셈블리를 생성한 경우 이 어셈블리를 빌드하기 전에 해당 프로젝트를 빌드해야 합니다.
pl: MSB3104: Nie można odnaleźć przywoływanego zestawu „{0}”. Jeżeli zestaw jest tworzony przez inny projekt, upewnij się, że przed skompilowaniem tego zestawu został skompilowany ten inny projekt.
pt_br: MSB3104: O assembly usado como referência "{0}" não foi encontrado. Se esse assembly tiver sido produzido por um outro projeto, compile aquele projeto antes de compilar este.
ru: MSB3104: не удалось найти сборку "{0}", на которую указывает ссылка. Если эта сборка создана другим вашим проектом, убедитесь, что сборка того проекта выполнена перед сборкой этого.
tr: MSB3104: Başvurulan "{0}" derlemesi bulunamadı. Bu derleme başka bir projeniz tarafından üretildiyse, lütfen bunu oluşturmadan önce ilgili projeyi oluşturduğunuzdan emin olun.
zh_hant: MSB3104: 找不到參考組件 "{0}"。如果這個組件是由您的其他專案所產生的，請務必先建置該專案，才能建置此專案。

# General_UnableToReadFile
source: File "{0}" could not be read: {1}
cs: Soubor {0} se nepovedlo přečíst: {1}
de: Die Datei "{0}" konnte nicht gelesen werden: {1}
fr: Impossible de lire le fichier "{0}" : {1}
it: Non è stato possibile leggere il file "{0}": {1}
ko: "{0}" 파일을 읽을 수 없습니다. {1}
pl: Nie można odczytać pliku „{0}”: {1}
pt_br: Não foi possível ler o arquivo "{0}": {1}
ru: Не удалось считать файл "{0}": {1}
tr: "{0}" dosyası okunamadı: {1}
zh_hant: 無法讀取檔案 "{0}": {1}

# ImplicitlySkipAnalyzersMessage
source: Skipping analyzers to speed up the build. You can execute 'Build' or 'Rebuild' command to run analyzers.
cs: Přeskočení analyzátorů za účelem zrychlení buildu. Analyzátory můžete spustit spuštěním příkazu Build nebo Rebuild.
ko: 분석기를 건너뛰어 빌드 속도를 높입니다. 'Build' 또는 'Rebuild' 명령을 실행하여 분석기를 실행할 수 있습니다.
pt_br: Ignorando analisadores para acelerar a construção. Você pode executar o comando 'Build' ou 'Rebuild' para executar os analisadores.
ru: Анализаторы пропускаются для ускорения сборки. Для запуска анализаторов можно выполнить команды "Собрать" или "Пересобрать".
tr: Yapıyı hızlandırmak için çözümleyiciler atlanıyor. Çözümleyicileri çalıştırmak için 'Oluştur' veya 'Yeniden Oluştur' komutunu çalıştırabilirsiniz.
zh_hant: 略過分析器以加速組建。您可以執行「組建」或「重建」命令來執行分析器。

# SharedCompilationFallback
source: Shared compilation failed; falling back to tool: {0}
cs: Sdílená kompilace se nepovedla, použije se znovu nástroj: {0}
de: Fehler bei der freigegebenen Kompilierung. Fallback auf folgendes Tool: {0}
fr: Échec de la compilation partagée ; retour à l'outil : {0}
it: La compilazione condivisa non è riuscita. Verrà eseguito il fallback allo strumento: {0}
ko: 공유 컴파일 실패, 다음 도구로 변경 중: {0}
pl: Udostępniona kompilacja nie powiodła się; nastąpi powrót do narzędzia: {0}
pt_br: Compilação compartilhada com falha; fazendo fallback para a ferramenta: {0}
ru: Сбой общей компиляции; возврат к средству {0}
tr: Paylaşılan derleme başarısız oldu; önceki araca dönülüyor: {0}
zh_hant: 共用編譯失敗; 將回到工具: {0}
