Repository: dotnet/roslyn
Catalog: src/Compilers/Core/MSBuildTask/xlf/ErrorString.*.xlf
Languages: cs, de, fr, it, ko, pl, pt_br, ru, tr, zh_hant

# UsingSharedCompilation
source: Using shared compilation with compiler from directory: {0}
cs: Používá se sdílená kompilace s kompilátorem z adresáře: {0}
de: Freigegebene Kompilierung mit dem Compiler aus dem Verzeichnis wird verwendet: {0}
fr: Utilisation de la compilation partagée avec le compilateur du répertoire : {0}
it: Verrà usata la compilazione condivisa con il compilatore della directory: {0}
ko: 디렉터리의 컴파일러로 공유 컴파일 사용: {0}
pl: Używana jest udostępniona kompilacja z kompilatorem z katalogu: {0}
pt_br: Usando compilação compartilhada com o compilador do diretório: {0}
ru: Использование общей компиляции с компилятором из каталога {0}
tr: Şu dizindeki derleyici ile paylaşılan derleme kullanılıyor: {0}
zh_hant: 搭配來自目錄的編譯器使用共用編譯: {0}

# Vbc_EnumParameterHasInvalidValue
source: MSB3401: "{1}" is an invalid value for the "{0}" parameter. The valid values are: {2}
cs: MSB3401: {1} je neplatná hodnota parametru {0}. Platné hodnoty: {2}
de: MSB3401: "{1}" ist ein ungültiger Wert für den Parameter "{0}". Gültige Werte sind: {2}
fr: MSB3401: "{1}" n'est pas une valeur valide pour le paramètre "{0}". Les valeurs valides sont : {2}
it: MSB3401: "{1}" è un valore non valido per il parametro "{0}". I valori validi sono: {2}
ko: MSB3401: "{1}"은(는) "{0}" 매개 변수에 사용할 수 없는 값입니다. 유효한 값은 {2}입니다.
pl: MSB3401: „{1}” jest nieprawidłową wartością parametru „{0}”. Prawidłowe wartości: {2}
pt_br: MSB3401: "{1}" é um nome inválido para o parâmetro "{0}". Os valores válidos são: {2}
ru: MSB3401: "{1}" — недопустимое значение для параметра "{0}". Допустимые значения: {2}
tr: MSB3401: "{1}" değeri, "{0}" parametresi için geçersiz. Geçerli değerler şunlardır: {2}
zh_hant: MSB3401: "{1}" 對 "{0}" 參數而言是無效值。有效值為: {2}

# Vbc_ParameterHasInvalidValue
source: "{1}" is an invalid value for the "{0}" parameter.
cs: {1} je neplatná hodnota parametru {0}.
de: "{1}" ist ein ungültiger Wert für den Parameter "{0}".
fr: "{1}" n'est pas une valeur valide pour le paramètre "{0}".
it: "{1}" non è un valore valido per il parametro "{0}".
ko: "{1}"은(는) "{0}" 매개 변수에 사용할 수 없는 값입니다.
pl: „{1}” jest nieprawidłową wartością parametru „{0}”.
pt_br: "{1}" é um valor inválido para o parâmetro "{0}".
ru: "{1}" — недопустимое значение для параметра "{0}".
tr: "{1}" değeri "{0}" parametresi için geçersiz bir değer.
zh_hant: "{1}" 對 "{0}" 參數而言是無效值。

# Vbc_RenamePDB
source: MSB3402: There was an error creating the pdb file "{0}". {1}
cs: MSB3402: Při vytváření souboru PDB {0} došlo k chybě. {1}
de: MSB3402: Fehler beim Erstellen der PDB-Datei "{0}". {1}
fr: MSB3402: Une erreur s'est produite durant la création du fichier pdb "{0}". {1}
it: MSB3402: si è verificato un errore durante la creazione del file PDB "{0}". {1}
ko: MSB3402: pdb 파일 "{0}"을(를) 만드는 동안 오류가 발생했습니다. {1}
pl: MSB3402: Wystąpił błąd podczas tworzenia pliku pdb „{0}”. {1}
pt_br: MSB3402: houve um erro na criação do arquivo pdb "{0}". {1}
ru: MSB3402: ошибка создания PDB-файла "{0}". {1}
tr: MSB3402: "{0}" pdb dosyası oluşturulurken hata oluştu. {1}
zh_hant: MSB3402: 建立 PDB 檔案 "{0}" 時發生錯誤。{1}

# MapSourceRoots.ContainsDuplicate
source: {0} contains duplicate items '{1}' with conflicting metadata '{2}': '{3}' and '{4}'
cs: {0} obsahuje duplicitní položky {1} s konfliktními metadaty {2}: {3} a {4}
de: "{0}" enthält doppelte Elemente "{1}" mit widersprüchlichen Metadaten "{2}": "{3}" und "{4}".
fr: {0} contient des éléments dupliqués '{1}' avec des métadonnées en conflit '{2}' : '{3}' et '{4}'
it: {0} contiene elementi duplicati '{1}' con metadati in conflitto '{2}': '{3}' e '{4}'
ko: 충돌 메타데이터 '{2}'이(가) 있는 중복 항목 '{1}'이(가) {0}에 포함되어 있습니다. '{3}' 및 '{4}'
pl: Element {0} zawiera zduplikowane elementy „{1}” z metadanymi powodującymi konflikt „{2}”: „{3}” i „{4}”
pt_br: {0} contém itens duplicados '{1}' com metadados conflitantes'{2}': '{3}' e '{4}'
ru: {0} содержит повторяющиеся элементы "{1}" с конфликтующими метаданными "{2}": "{3}" и "{4}"
tr: {0}, çakışan '{2}' meta verileriyle birlikte yinelenen '{1}' öğelerini içeriyor: '{3}' ve '{4}'
zh_hant: {0} 包含具衝突中繼資料 '{2}' 的重複項目 '{1}': '{3}' 和 '{4}'

# MapSourceRoots.PathMustEndWithSlashOrBackslash
source: {0} paths are required to end with a slash or backslash: '{1}'
cs: Cesty {0} musí končit lomítkem nebo zpětným lomítkem: {1}
de: {0}-Pfade müssen mit einem Schrägstrich oder einem umgekehrten Schrägstrich enden: '{1}'
fr: Les chemins {0} doivent finir par une barre oblique ou une barre oblique inverse : '{1}'
it: {0} percorsi devono terminare con una barra o una barra rovesciata: '{1}'
ko: {0} 경로는 슬래시 또는 백슬래시로 끝나야 합니다. '{1}'
pl: Ścieżki {0} muszą kończyć się ukośnikiem lub ukośnikiem odwrotnym: „{1}”
pt_br: {0} caminhos precisam ser terminados com uma barra ou uma barra invertida: '{1}'
ru: Пути {0} должны заканчиваться прямой или обратной косой чертой: "{1}"
tr: {0} yolunun sonunda eğik çizgi veya ters eğik çizgi olması gerekir: '{1}'
zh_hant: {0} 個路徑必須以斜線或反斜線作為結尾: '{1}'

# MapSourceRoots.NoTopLevelSourceRoot
source: {0} items must include at least one top-level (not nested) item when {1} is true
cs: Položky {0} musí zahrnovat nejméně jednu položku nejvyšší úrovně (nevnořenou), pokud {1} má hodnotu true.
de: {0}-Elemente müssen mindestens ein Element der obersten Ebene (nicht geschachtelt) enthalten, wenn "{1}" auf TRUE festgelegt ist.
fr: Les éléments {0} doivent inclure au moins un élément de niveau supérieur (non imbriqué) quand {1} a la valeur true
it: {0} elementi devono includere almeno un elemento di primo livello (non annidato) quando {1} è true
ko: {0} 항목은 {1}이(가) true인 경우 최상위(중첩되지 않은) 항목을 하나 이상 포함해야 합니다.
pl: Elementy {0} muszą zawierać co najmniej jeden niezagnieżdżony element najwyższego poziomu, gdy właściwość {1} ma wartość true
pt_br: {0} itens precisam incluir pelo menos um item de nível superior (não aninhado) quando {1} é verdadeiro
ru: Элементы {0} должны включать по меньшей мере один элемент верхнего уровня (невложенный), когда {1} имеет значение "true"
tr: {1} true olduğunda {0} öğe en az bir üst düzey (iç içe geçmemiş) öğe içermelidir
zh_hant: 在 {1} 為 true 的情況下，{0} 個項目必須包含至少一個高層級 (非巢狀) 項目

# MapSourceRoots.NoSuchTopLevelSourceRoot
source: The value of {0} not found in {1} items, or the corresponding item is not a top-level source root: '{2}'
cs: Hodnota {0} nebyla v položkách {1} nalezena nebo odpovídající položka není zdrojový kořen nejvyšší úrovně: {2}
de: Der Wert von "{0}" wurde in {1} Elementen nicht gefunden, oder das entsprechende Element ist kein Quellstamm der obersten Ebene: {2}
fr: La valeur de {0} est introuvable dans les éléments {1}, ou l'élément correspondant n'est pas une racine source de niveau supérieur : '{2}'
it: Il valore di {0} non è stato trovato negli elementi {1} oppure l'elemento corrispondente non è una radice di origine di primo livello: '{2}'
ko: {1} 항목에서 {0}의 값을 찾을 수 없거나 해당 항목이 최상위 소스 루트가 아닙니다. '{2}'
pl: Nie odnaleziono wartości {0} w elementach {1} bądź odpowiadający element nie jest źródłowym elementem głównym najwyższego poziomu: „{2}”
pt_br: Valor de {0} não encontrado em {1} itens ou o item correspondente não é uma raiz de origem de nível superior: '{2}'
ru: Значение объекта {0} не найдено в элементах {1}, либо соответствующий элемент не является исходным корнем верхнего уровня: "{2}"
tr: {0} değeri, {1} öğede bulunamadı veya karşılık gelen öğe, üst düzey kaynak kökü değil: '{2}'
zh_hant: {1} 個項目中找不到 {0} 的值，或相對應項目不是高階層來源根目錄: '{2}'
