Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Text.Analyzers/Core/xlf/TextAnalyzersResources.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, tr

# FlagsEnumsShouldHavePluralNamesDescription
source: A public enumeration has the System.FlagsAttribute attribute, and its name does not end in ""s"". Types that are marked by using FlagsAttribute have names that are plural because the attribute indicates that more than one value can be specified.
cs: Veřejný výčet obsahuje atribut System.FlagsAttribute, ale jeho název nekončí na s. Typy, které jsou označené atributem FlagsAttribute, mají názvy v množném čísle, protože tento atribut označuje, že se dá zadat více než jedna hodnota.
de: Eine öffentliche Enumeration weist das System.FlagsAttribute-Attribut auf, und der Name endet nicht auf ""s"". Mit FlagsAttribute markierte Typen besitzen Namen in Pluralform, weil das Attribut darauf hinweist, dass mehrere Werte angegeben werden können.
fr: Une énumération publique a l'attribut System.FlagsAttribute, et son nom finit par ""s"". Les types marqués à l'aide de FlagsAttribute ont des noms au pluriel, car l'attribut indique que plusieurs valeurs peuvent être spécifiées.
it: Un'enumerazione public include l'attributo System.FlagsAttribute e il relativo nome non termina con ""s"". Ai tipi contrassegnati con FlagsAttribute sono assegnati nomi plurali perché tale attributo indica che è possibile specificare più valori.
ja: パブリック列挙型に System.FlagsAttribute 属性があり、その名前の末尾に ""s"" がありません。FlagsAttribute を使用してマークされた型には複数形の名前が付きます。これは、この属性に複数の値を指定できることを示すためです。
ko: Public 열거형에는 System.FlagsAttribute 특성이 있으며 이 특성의 이름이 ""s""로 끝나지 않습니다. FlagsAttribute를 사용하여 표시되는 형식의 경우 이 특성이 하나 이상의 값이 지정될 수 있을 나타내므로 복수형의 이름을 사용합니다.
pl: Wyliczenie publiczne ma atrybut System.FlagsAttribute, lecz jego nazwa nie kończy się literą „s”. Nazwy typów oznaczonych atrybutem FlagsAttribute mają nazwy w liczbie mnogiej, ponieważ ten atrybut wskazuje, że można określić więcej niż jedną wartość.
pt_br: Uma enumeração pública tem o atributo System.FlagsAttribute e seu nome não termina em ""s"". Tipos marcados usando FlagsAttribute têm nomes no plural, porque o atributo indica que mais de um valor pode ser especificado.
ru: Общее перечисление имеет атрибут System.FlagsAttribute, а его имя не заканчивается на ""s"". Типы, помеченные с помощью FlagsAttribute, имеют имена во множественном числе, так как атрибут указывает, что можно задать несколько значений.
tr: Bir genel sabit listesi System.FlagsAttribute özniteliğine sahip ve adı ""s"" ile bitmiyor. FlagsAttribute kullanılarak işaretlenen türler, öznitelik birden fazla değerin belirtilebileceğini gösterdiğinden çoğul olan adlara sahip olur.

# FlagsEnumsShouldHavePluralNamesMessage
source: Flags enums should have plural names
cs: Výčty příznaků mají mít názvy v množném čísle.
de: Flags-Enumerationen müssen Pluralnamen aufweisen
fr: Les noms des enums Flags doivent être au pluriel
it: Alle enumerazioni con Flags devono essere assegnati nomi plurali
ja: フラグ列挙型は、複数形の名前を含んでいなければなりません
ko: 플래그 열거형에는 복수형 이름을 사용해야 합니다.
pl: Wyliczenia z flagami powinny mieć nazwy w liczbie mnogiej
pt_br: Enumerações Flags devem ter nomes no plural
ru: У перечислений флагов должны быть имена во множественном числе
tr: Bayrak sabit listeleri çoğul adlara sahip olmalıdır

# FlagsEnumsShouldHavePluralNamesTitle
source: Flags enums should have plural names
cs: Výčty příznaků mají mít názvy v množném čísle.
de: Flags-Enumerationen müssen Pluralnamen aufweisen
fr: Les noms des enums Flags doivent être au pluriel
it: Alle enumerazioni con Flags devono essere assegnati nomi plurali
ja: フラグ列挙型は、複数形の名前を含んでいなければなりません
ko: 플래그 열거형에는 복수형 이름을 사용해야 합니다.
pl: Wyliczenia z flagami powinny mieć nazwy w liczbie mnogiej
pt_br: Enumerações Flags devem ter nomes no plural
ru: У перечислений флагов должны быть имена во множественном числе
tr: Bayrak sabit listeleri çoğul adlara sahip olmalıdır

# IdentifiersShouldBeSpelledCorrectlyFileParse
source: Error parsing dictionary '{0}': {1}
cs: Chyba při parsování slovníku {0}: {1}
de: Fehler beim Analysieren des Wörterbuchs "{0}": {1}
fr: Erreur durant l'analyse du dictionnaire '{0}' : {1}
it: Si è verificato un errore durante l'analisi del dizionario '{0}': {1}
ja: ディクショナリ '{0}' の解析でエラーが発生しました: {1}
ko: 사전 '{0}'을(를) 구문 분석하는 동안 오류 발생: {1}
pl: Wystąpił błąd podczas analizowania słownika „{0}”: {1}
pt_br: Erro ao analisar o dicionário '{0}': {1}
ru: Ошибка при синтаксическом анализе словаря "{0}": {1}
tr: '{0}' sözlüğünü ayrıştırma hatası: {1}

# IdentifiersShouldBeSpelledCorrectlyMessageVariable
source: Correct the spelling of '{0}' in variable name '{1}'
cs: Opravte pravopis slova {0} v názvu proměnné {1}.
de: Korrigieren Sie die Schreibweise von "{0}" im Variablennamen "{1}".
fr: Corrigez l'orthographe de '{0}' dans le nom de variable '{1}'
it: Correggere l'ortografia di '{0}' nel nome di variabile '{1}'
ja: 変数名 '{1}' の '{0}' のスペルを訂正してください
ko: 변수 이름 '{1}'에서 '{0}'의 맞춤법을 수정하세요.
pl: Popraw pisownię wyrazu „{0}” w nazwie zmiennej „{1}”
pt_br: Corrija a ortografia de '{0}' no nome da variável '{1}'
ru: Исправьте написание "{0}" в имени переменной "{1}".
tr: '{1}' bütünleştirilmiş kod adındaki '{0}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyTitle
source: Identifiers should be spelled correctly
cs: Identifikátory nesmí obsahovat pravopisné chyby
de: Bezeichner müssen richtig geschrieben werden
fr: L'orthographe des identificateurs doit être correcte
it: L'ortografia degli identificatori deve essere corretta
ja: 識別子は正しく入力されなければなりません
ko: 식별자의 맞춤법이 정확해야 합니다.
pl: Pisownia identyfikatorów powinna być poprawna
pt_br: Identificadores devem ter grafia correta
ru: Идентификаторы должны иметь правильное правописание
tr: Tanımlayıcıların doğru yazılması gerekir

# IdentifiersShouldBeSpelledCorrectlyDescription
source: The name of an externally visible identifier contains one or more words that are not recognized by the Microsoft spelling checker library.
cs: Název externě viditelného identifikátoru obsahuje minimálně jedno slovo, které knihovna kontroly pravopisu Microsoft nerozpozná.
de: Der Name eines extern sichtbaren Bezeichners enthält mindestens ein Wort, das von der Bibliothek der Microsoft-Rechtschreibprüfung nicht erkannt wird.
fr: Le nom d'un identificateur visible de manière externe contient un ou plusieurs mots qui ne sont pas reconnus par la bibliothèque du vérificateur d'orthographe Microsoft.
it: Il nome di un identificatore visibile esternamente contiene una o più parole che non sono riconosciute dalla libreria del correttore ortografico Microsoft.
ja: 外部から参照可能な識別子の名前に、Microsoft スペル チェック ライブラリによって認識されない単語が 1 つ以上含まれています。
ko: 외부에 표시되는 식별자의 이름에 Microsoft 맞춤법 검사기 라이브러리에서 인식할 수 없는 단어가 1개 이상 포함되어 있습니다.
pl: Nazwa identyfikatora widocznego zewnętrznie zawiera co najmniej jeden wyraz, który nie został rozpoznany przez bibliotekę sprawdzania pisowni Microsoft.
pt_br: O nome de um identificador visível externamente contém uma ou mais palavras não reconhecidas pela biblioteca do verificador ortográfico da Microsoft.
ru: Имя видимого извне идентификатора содержит одно или несколько слов, не распознаваемых библиотекой средства проверки орфографии Майкрософт.
tr: Dışarıdan görünebilir tanımlayıcı adı, Microsoft yazım denetimi kitaplığı tarafından desteklenmeyen bir veya daha fazla sözcük içeriyor.

# IdentifiersShouldBeSpelledCorrectlyMessageAssembly
source: Correct the spelling of '{0}' in assembly name '{1}'
cs: Opravte pravopis slova {0} v názvu sestavení {1}.
de: Korrigieren Sie die Schreibweise von "{0}" im Assemblynamen "{1}".
fr: Corrigez l'orthographe de '{0}' dans le nom d'assembly '{1}'
it: Correggere l'ortografia di '{0}' nel nome di assembly '{1}'
ja: アセンブリ名 '{1}' の '{0}' のスペルを訂正してください
ko: 어셈블리 이름 {1}에서 '{0}'의 맞춤법을 수정하세요.
pl: Popraw pisownię wyrazu „{0}” w nazwie zestawu „{1}”
pt_br: Corrija a ortografia de '{0}' no nome do assembly '{1}'
ru: Исправьте правописание "{0}" в имени сборки {1}.
tr: '{1}' bütünleştirilmiş kod adındaki '{0}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyMessageNamespace
source: Correct the spelling of '{0}' in namespace name '{1}'
cs: Opravte pravopis slova {0} v názvu oboru názvů {1}.
de: Korrigieren Sie die Schreibweise von "{0}" im Namespacenamen "{1}".
fr: Corrigez l'orthographe de '{0}' dans le nom d'espace de noms '{1}'
it: Correggere l'ortografia di '{0}' nel nome di spazio dei nomi '{1}'
ja: 名前空間名 '{1}' の '{0}' のスペルを訂正してください
ko: 네임스페이스 이름 '{1}'에서 '{0}'의 맞춤법을 수정하세요.
pl: Popraw pisownię wyrazu „{0}” w nazwie przestrzeni nazw „{1}”
pt_br: Corrija a ortografia de '{0}' no nome do namespace '{1}'
ru: Исправьте правописание "{0}" в имени пространства имен "{1}".
tr: {1} ad alanı adındaki '{0}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyMessageType
source: Correct the spelling of '{0}' in type name '{1}'
cs: Opravte pravopis slova {0} v názvu typu {1}.
de: Korrigieren Sie die Schreibweise von "{0}" im Typnamen "{1}".
fr: Corrigez l'orthographe de '{0}' dans le nom de type '{1}'
it: Correggere l'ortografia di '{0}' nel nome di tipo '{1}'
ja: 型名 '{1}' の '{0}' のスペルを訂正してください
ko: 형식 이름 {1}에서 '{0}'의 맞춤법을 수정하세요.
pl: Popraw pisownię wyrazu „{0}” w nazwie typu „{1}”
pt_br: Corrija a ortografia de '{0}' no nome do tipo '{1}'
ru: Исправьте правописание "{0}" в имени типа {1}.
tr: '{1}' tür adındaki '{0}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyMessageMember
source: Correct the spelling of '{0}' in member name '{1}' or remove it entirely if it represents any sort of Hungarian notation
cs: Opravte pravopis slova {0} v názvu členu {1}, nebo ho úplně odeberte, pokud představuje jakýkoli druh maďarské notace.
de: Korrigieren Sie die Schreibweise von "{0}" im Membernamen "{1}", oder entfernen Sie das Element ganz, wenn es einen beliebigen Typ ungarischer Notation darstellt.
fr: Corrigez l'orthographe de '{0}' dans le nom de membre '{1}', ou supprimez-le intégralement s'il représente une forme quelconque de notation hongroise
it: Correggere l'ortografia di '{0}' nel nome di membro '{1}' oppure rimuoverlo completamente se rappresenta un qualsiasi tipo di notazione ungherese
ja: メンバー名 '{1}' の '{0}' のスペルを訂正するか、または、それが何らかのハンガリアン記法を表す場合はその全体を削除してください
ko: 멤버 이름 {1}에서 '{0}'의 맞춤법을 수정하거나, 헝가리 표기법을 나타내는 경우 완전히 제거하세요.
pl: Popraw pisownię wyrazu „{0}” w nazwie składowej „{1}” lub usuń go całkowicie, jeśli reprezentuje dowolny rodzaj notacji węgierskiej
pt_br: Corrija a ortografia de '{0}' no nome do membro '{1}' ou remova-o inteiramente caso ele represente algum tipo de notação húngara
ru: Исправьте правописание "{0}" в имени элемента {1} или удалите его целиком, если используется венгерская нотация.
tr: '{1}' üye adındaki '{0}' yazımını düzeltin ya da herhangi bir Macar gösterimini temsil ediyorsa tamamen kaldırın

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameter
source: In method '{0}', correct the spelling of '{1}' in parameter name '{2}' or remove it entirely if it represents any sort of Hungarian notation
cs: V metodě {0} opravte pravopis slova {1} v názvu parametru {2}, nebo ho úplně odeberte, pokud představuje jakýkoli druh maďarské notace.
de: Korrigieren Sie in der Methode "{0}" die Schreibweise von "{1}" im Parameternamen "{2}", oder entfernen Sie das Element ganz, wenn es einen beliebigen Typ ungarischer Notation darstellt.
fr: Dans la méthode '{0}', corrigez l'orthographe de '{1}' dans le nom de paramètre '{2}', ou supprimez-le intégralement s'il représente une forme quelconque de notation hongroise
it: Nel metodo '{0}' correggere l'ortografia di '{1}' nel nome di parametro '{2}' oppure rimuoverlo completamente se rappresenta un qualsiasi tipo di notazione ungherese
ja: メソッド '{0}' で、パラメーター名 '{2}' の '{1}' のスペルを訂正するか、または、それが何らかのハンガリアン記法を表す場合はその全体を削除してください
ko: {0} 메서드의 매개 변수 이름 {2}에서 '{1}'의 맞춤법을 수정하거나, 헝가리 표기법을 나타내는 경우 완전히 제거하세요.
pl: W metodzie „{0}” popraw pisownię wyrazu „{1}” w nazwie parametru „{2}” lub usuń go całkowicie, jeśli reprezentuje dowolny rodzaj notacji węgierskiej
pt_br: No método '{0}', corrija a ortografia de '{1}' no nome do parâmetro '{2}' ou remova-o inteiramente caso ele represente algum tipo de notação húngara
ru: В методе {0} исправьте правописание "{1}" в имени параметра {2} или удалите его целиком, если используется венгерская нотация.
tr: '{0}' metodunda, '{2}' parametre adındaki '{1}' yazımını düzeltin ya da herhangi bir Macar gösterimini temsil ediyorsa tamamen kaldırın

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameter
source: In delegate '{0}', correct the spelling of '{1}' in parameter name '{2}' or remove it entirely if it represents any sort of Hungarian notation
cs: V delegátovi {0} opravte pravopis slova {1} v názvu parametru {2}, nebo ho úplně odeberte, pokud představuje jakýkoli druh maďarské notace.
de: Korrigieren Sie im Delegaten "{0}" die Schreibweise von "{1}" im Parameternamen "{2}", oder entfernen Sie das Element ganz, wenn es einen beliebigen Typ ungarischer Notation darstellt.
fr: Dans le délégué '{0}', corrigez l'orthographe de '{1}' dans le nom de paramètre '{2}', ou supprimez-le intégralement s'il représente une forme quelconque de notation hongroise
it: Nel delegato '{0}' correggere l'ortografia di '{1}' nel nome di parametro '{2}' oppure rimuoverlo completamente se rappresenta un qualsiasi tipo di notazione ungherese
ja: デリゲート '{0}' で、パラメーター名 '{2}' の '{1}' のスペルを訂正するか、または、それが何らかのハンガリアン記法を表す場合はその全体を削除してください
ko: {0} 대리자의 매개 변수 이름 {2}에서 '{1}'의 맞춤법을 수정하거나, 헝가리 표기법을 나타내는 경우 완전히 제거하세요.
pl: W delegacie „{0}” popraw pisownię wyrazu „{1}” w nazwie parametru „{2}” lub usuń go całkowicie, jeśli reprezentuje dowolny rodzaj notacji węgierskiej
pt_br: No delegado '{0}', corrija a ortografia de '{1}' no nome do parâmetro '{2}' ou remova-o inteiramente caso ele represente algum tipo de notação húngara
ru: В делегате {0} исправьте правописание "{1}" в имени параметра {2} или удалите его целиком, если используется венгерская нотация.
tr: '{0}' temsilcisinde, '{2}' parametre adındaki '{1}' yazımını düzeltin ya da herhangi bir Macar gösterimini temsil ediyorsa tamamen kaldırın

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameter
source: On type '{0}', correct the spelling of '{1}' in generic type parameter name '{2}'
cs: U typu {0} opravte pravopis slova {1} v názvu parametru obecného typu {2}.
de: Korrigieren Sie für den Typ "{0}" die Schreibweise von "{1}" im Namen des generischen Typparameters ({2}).
fr: Dans le type '{0}', corrigez l'orthographe de '{1}' dans le nom de paramètre de type générique '{2}'
it: Nel tipo '{0}' correggere l'ortografia di '{1}' nel nome di parametro di tipo generico '{2}'
ja: 型 '{0}' で、ジェネリック型パラメーター名 '{2}' の '{1}' のスペルを訂正してください
ko: {0} 형식의 제네릭 형식 매개 변수 이름 {2}에서 '{1}'의 맞춤법을 수정하세요.
pl: W typie „{0}” popraw pisownię wyrazu „{1}” w nazwie parametru typu ogólnego „{2}”
pt_br: No tipo '{0}', corrija a ortografia de '{1}' no nome do parâmetro de tipo genérico '{2}'
ru: В типе {0} исправьте правописание "{1}" в имени параметра универсального типа {2}.
tr: '{0}' türünde, '{2}' genel tür parametre adındaki '{1}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameter
source: On method '{0}', correct the spelling of '{1}' in generic type parameter name '{2}'
cs: U metody {0} opravte pravopis slova {1} v názvu parametru obecného typu {2}.
de: Korrigieren Sie für die Methode "{0}" die Schreibweise von "{1}" im Namen des generischen Typparameters ({2}).
fr: Dans la méthode '{0}', corrigez l'orthographe de '{1}' dans le nom de paramètre de type générique '{2}'
it: Nel metodo '{0}' correggere l'ortografia di '{1}' nel nome di parametro di tipo generico '{2}'
ja: メソッド '{0}' で、ジェネリック型パラメーター名 '{2}' の '{1}' のスペルを訂正してください
ko: {0} 메서드의 제네릭 형식 매개 변수 이름 {2}에서 '{1}'의 맞춤법을 수정하세요.
pl: W metodzie {0} popraw pisownię wyrazu „{1}” w nazwie parametru typu ogólnego „{2}”
pt_br: No método '{0}', corrija a ortografia de '{1}' no nome do parâmetro de tipo genérico '{2}'
ru: В методе {0} исправьте правописание "{1}" в имени параметра универсального типа {2}.
tr: '{0}' metodunda, '{2}' genel tür parametre adındaki '{1}' yazımını düzeltin

# IdentifiersShouldBeSpelledCorrectlyMessageAssemblyMoreMeaningfulName
source: Consider providing a more meaningful name than assembly name '{0}'
cs: Zvažte zadání výstižnějšího názvu, než je název sestavení {0}.
de: Geben Sie einen aussagekräftigeren Namen als den Assemblynamen "{0}" an.
fr: Si possible, indiquez un nom plus significatif que le nom d'assembly '{0}'
it: Provare a specificare un nome più significativo del nome di assembly '{0}'
ja: アセンブリ名 '{0}' よりも意味のある名前を指定することを検討してください
ko: 어셈블리 이름 {0}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: Rozważ podanie bardziej zrozumiałej nazwy niż nazwa zestawu „{0}”
pt_br: Considere fornecer um nome mais significativo do que o nome do assembly '{0}'
ru: Подберите более значимое имя для сборки {0}.
tr: '{0}' bütünleştirilmiş kod adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageNamespaceMoreMeaningfulName
source: Consider providing a more meaningful name than namespace name '{0}'
cs: Zvažte zadání výstižnějšího názvu, než je název oboru názvů {0}.
de: Geben Sie ggf. einen aussagekräftigeren Namen als den Namespacenamen "{0}" an.
fr: Indiquez éventuellement un nom plus significatif que le nom d'espace de noms '{0}'
it: Provare a specificare un nome più significativo del nome di spazio dei nomi '{0}'
ja: 名前空間名 '{0}' よりも意味のある名前を指定することを検討してください
ko: 네임스페이스 이름 {0}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: Rozważ podanie bardziej zrozumiałej nazwy niż nazwa przestrzeni nazw „{0}”
pt_br: Considere fornecer um nome mais relevante do que o nome de namespace '{0}'
ru: Подберите более значимое имя для пространства имен {0}.
tr: '{0}' ad alanı adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageTypeMoreMeaningfulName
source: Consider providing a more meaningful name than type name '{0}'
cs: Zvažte zadání výstižnějšího názvu, než je název typu {0}.
de: Geben Sie einen aussagekräftigeren Namen als den Typnamen "{0}" an.
fr: Si possible, indiquez un nom plus significatif que le nom de type '{0}'
it: Provare a specificare un nome più significativo del nome di tipo '{0}'
ja: 型名 '{0}' よりも意味のある名前を指定することを検討してください
ko: 형식 이름 {0}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: Rozważ podanie bardziej zrozumiałej nazwy niż nazwa typu „{0}”
pt_br: Considere fornecer um nome mais significativo do que o nome do tipo '{0}'
ru: Подберите более значимое имя для типа {0}.
tr: '{0}' tür adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageMemberMoreMeaningfulName
source: Consider providing a more meaningful name than member name '{0}'
cs: Zvažte zadání výstižnějšího názvu, než je název členu {0}.
de: Geben Sie ggf. einen aussagekräftigeren Namen als den Membernamen "{0}" an.
fr: Si possible, indiquez un nom plus significatif que le nom de membre '{0}'
it: Provare a specificare un nome più significativo del nome di membro '{0}'
ja: メンバー名 '{0}' よりも意味のある名前を指定することを検討してください
ko: 멤버 이름 {0}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: Rozważ podanie bardziej zrozumiałej nazwy niż nazwa składowej „{0}”
pt_br: Considere fornecer um nome mais significativo do que o nome do membro '{0}'
ru: Подберите более значимое имя для элемента "{0}".
tr: '{0}' üye adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameterMoreMeaningfulName
source: In method '{0}', consider providing a more meaningful name than parameter name '{1}'
cs: V metodě {0} zvažte zadání výstižnějšího názvu, než je název parametru {1}.
de: Geben Sie in der Methode "{0}" einen aussagekräftigeren Namen als den Parameternamen "{1}" an.
fr: Dans la méthode '{0}', si possible, indiquez un nom plus significatif que le nom de paramètre '{1}'
it: Nel metodo '{0}' provare a specificare un nome più significativo del nome di parametro '{1}'
ja: メソッド '{0}' で、パラメーター名 '{1}' よりも意味のある名前を指定することを検討してください
ko: {0} 메서드에서 매개 변수 이름 {1}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: W metodzie „{0}” rozważ podanie bardziej zrozumiałej nazwy niż nazwa parametru „{1}”
pt_br: No método '{0}', considere fornecer um nome mais significativo do que o nome do parâmetro '{1}'
ru: В методе "{0}" подберите более значимое имя для параметра "{1}".
tr: '{0}' metodunda, '{1}' parametre adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameterMoreMeaningfulName
source: In delegate '{0}', consider providing a more meaningful name than parameter name '{1}'
cs: V delegátovi {0} zvažte zadání výstižnějšího názvu, než je název parametru {1}.
de: Geben Sie im Delegaten "{0}" einen aussagekräftigeren Namen als den Parameternamen "{1}" an.
fr: Dans le délégué '{0}', si possible, indiquez un nom plus significatif que le nom de paramètre '{1}'
it: Nel delegato '{0}' provare a specificare un nome più significativo del nome di parametro '{1}'
ja: デリゲート '{0}' で、パラメーター名 '{1}' よりも意味のある名前を指定することを検討してください
ko: {0} 대리자에서 매개 변수 이름 {1}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: W delegacie „{0}” rozważ podanie bardziej zrozumiałej nazwy niż nazwa parametru „{1}”
pt_br: No delegado '{0}', considere fornecer um nome mais significativo do que o nome do parâmetro '{1}'
ru: В делегате "{0}" подберите более значимое имя для параметра "{1}".
tr: '{0}' temsilcisinde, '{1}' parametre adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameterMoreMeaningfulName
source: On type '{0}', consider providing a more meaningful name than generic type parameter name '{1}'
cs: U typu {0} zvažte zadání výstižnějšího názvu, než je název parametru obecného typu {1}.
de: Geben Sie für den Typ "{0}" einen aussagekräftigeren Namen als den Namen des generischen Typparameters ({1}) an.
fr: Dans le type '{0}', si possible, indiquez un nom plus significatif que le nom de paramètre de type générique '{1}'
it: Nel tipo '{0}' provare a specificare un nome più significativo del nome di parametro di tipo generico '{1}'
ja: 型 '{0}' で、ジェネリック型パラメーター名 '{1}' よりも意味のある名前を指定することを検討してください
ko: {0} 형식에서 제네릭 형식 매개 변수 이름 {1}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: W typie „{0}” rozważ podanie bardziej zrozumiałej nazwy niż nazwa parametru typu ogólnego „{1}”
pt_br: No tipo '{0}', considere fornecer um nome mais significativo do que o nome do parâmetro de tipo genérico '{1}'
ru: В типе "{0}" подберите более значимое имя для параметра универсального типа "{1}".
tr: '{0}' türünde, '{1}' genel tür parametre adı yerine daha anlamlı bir ad sağlamayı deneyin

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameterMoreMeaningfulName
source: On method '{0}', consider providing a more meaningful name than generic type parameter name '{1}'
cs: U metody {0} zvažte zadání výstižnějšího názvu, než je název parametru obecného typu {1}.
de: Geben Sie für die Methode "{0}" einen aussagekräftigeren Namen als den Namen des generischen Typparameters ({1}) an.
fr: Dans la méthode '{0}', si possible, indiquez un nom plus significatif que le nom de paramètre de type générique '{1}'
it: Nel metodo '{0}' provare a specificare un nome più significativo del nome di parametro di tipo generico '{1}'
ja: メソッド '{0}' で、ジェネリック型パラメーター名 '{1}' よりも意味のある名前を指定することを検討してください
ko: {0} 메서드에서 제네릭 형식 매개 변수 이름 {1}보다 더 의미 있는 이름을 제공하는 것이 좋습니다.
pl: W metodzie „{0}” rozważ podanie bardziej zrozumiałej nazwy niż nazwa parametru typu ogólnego „{1}”
pt_br: No método '{0}', considere fornecer um nome mais significativo do que o nome do parâmetro de tipo genérico '{1}'
ru: В методе "{0}" подберите более значимое имя для параметра универсального типа "{1}".
tr: '{0}' metodunda, '{1}' genel tür parametre adı yerine daha anlamlı bir ad sağlamayı deneyin

# CategoryNaming
source: Naming
cs: Pojmenování
de: Benennung
fr: Nommage
it: Denominazione
ja: 名前付け
ko: 명명
pl: Nazewnictwo
pt_br: Nomenclatura
ru: Именование
tr: Adlandırma
