Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Text.Analyzers/Core/xlf/TextAnalyzersResources.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, tr

# OnlyFlagsEnumsShouldHavePluralNamesDescription
source: Naming conventions dictate that a plural name for an enumeration indicates that more than one value of the enumeration can be specified at the same time.
cs: Názvy v množném čísle podle zásad vytváření názvů označují, že lze současně zadat více než jednu hodnotu výčtu.
de: Die Namenskonventionen schreiben vor, dass ein Pluralname für eine Enumeration darauf hinweist, dass mehrere Werte der Enumeration gleichzeitig angegeben werden können.
fr: Conformément aux conventions de nommage, l'utilisation d'un nom pluriel pour une énumération indique que plusieurs valeurs de l'énumération peuvent être spécifiées en même temps.
it: In base alle convenzioni di denominazione, un nome plurale in un'enumerazione indica che è possibile specificare contemporaneamente più valori dell'enumerazione.
ja: 名前付け規則では、列挙型の複数形の名前は同時に複数の列挙型を指定できることを意味します。
ko: 명명 규칙은 열거형의 복수형 이름이 하나 이상의 열거형 값이 동시에 지정될 수 있다는 것을 표시함을 나타냅니다.
pl: Konwencje nazewnictwa określają, że nazwa wyliczenia w liczbie mnogiej wskazuje, iż jednocześnie można określić wiele wartości wyliczenia.
pt_br: As convenções de nomenclatura ditam que um nome no plural para uma enumeração indica que mais de um valor da enumeração pode ser especificado ao mesmo tempo.
ru: По соглашениям об именовании имя перечисления во множественном числе указывает, что одновременно можно задать несколько значений этого перечисления.
tr: Adlandırma kurallarına göre bir sabit listesinin çoğul ada sahip olması, aynı anda birden çok sabit listesi değeri belirtilebileceğini gösterir.

# OnlyFlagsEnumsShouldHavePluralNamesMessage
source: Only FlagsAttribute enums should have plural names
cs: Názvy v množném čísle mají mít jenom výčty FlagsAttribute.
de: Nur FlagsAttribute-Enumerationen dürfen Pluralnamen aufweisen
fr: Seuls les noms des enums FlagsAttribute doivent être au pluriel
it: I nomi plurali devono essere assegnati solo alle enumerazioni con FlagsAttribute
ja: FlagsAttribute 列挙型のみが複数形の名前を含んでいなければなりません
ko: FlagsAttribute 열거형만 복수형 이름을 사용할 수 있습니다.
pl: Tylko wyliczenia z atrybutem FlagsAttribute powinny mieć nazwy w liczbie mnogiej
pt_br: Apenas enumerações FlagsAttribute devem ter nomes no plural
ru: Только перечисления FlagsAttribute должны иметь имена во множественном числе
tr: Yalnızca FlagsAttribute sabit listeleri çoğul adlara sahip olmalıdır

# OnlyFlagsEnumsShouldHavePluralNamesTitle
source: Only FlagsAttribute enums should have plural names
cs: Názvy v množném čísle mají mít jenom výčty FlagsAttribute.
de: Nur FlagsAttribute-Enumerationen dürfen Pluralnamen aufweisen
fr: Seuls les noms des enums FlagsAttribute doivent être au pluriel
it: I nomi plurali devono essere assegnati solo alle enumerazioni con FlagsAttribute
ja: FlagsAttribute 列挙型のみが複数形の名前を含んでいなければなりません
ko: FlagsAttribute 열거형만 복수형 이름을 사용할 수 있습니다.
pl: Tylko wyliczenia z atrybutem FlagsAttribute powinny mieć nazwy w liczbie mnogiej
pt_br: Apenas enumerações FlagsAttribute devem ter nomes no plural
ru: Только перечисления FlagsAttribute должны иметь имена во множественном числе
tr: Yalnızca FlagsAttribute sabit listeleri çoğul adlara sahip olmalıdır
