Repository: dotnet/roslyn
Catalog: src/LanguageServer/Protocol/xlf/LanguageServerProtocolResources.*.xlf
Languages: ko, pl, ru, tr

# DocumentUriSerializationError
source: Unable to deserialize Uri. Unexpected value encountered: {0}
ko: URI를 역직렬화할 수 없습니다. 예기치 않은 값 {0}이(가) 있습니다.
pl: Nie można zdeserializować identyfikatora Uri. Napotkano nieoczekiwaną wartość: {0}
ru: Не удалось десериализовать URI. Возникло непредвиденное значение: {0}
tr: URI seri durumdan çıkarılamıyor. Beklenmeyen değerle karşılaşıldı: {0}

# FormattingOptionsEncounteredInvalidToken
source: Unable to deserialize FormattingOptions. Invalid token: {0}
ko: FormattingOptions를 역직렬화할 수 없습니다. 잘못된 토큰: {0}
pl: Nie można deserializować elementu FormattingOptions. Nieprawidłowy token: {0}
ru: Не удалось выполнить десериализацию FormattingOptions. Недопустимый маркер: {0}
tr: FormattingOptions seri durumdan çıkarılamıyor. Geçersiz belirteç: {0}

# FormattingOptionsEndedUnexpectedly
source: Unable to deserialize FormattingOptions as it ended unexpectedly
ko: FormattingOptions가 예기치 않게 종료되어 역직렬화할 수 없습니다.
pl: Nie można deserializować elementu FormattingOptions, ponieważ został on nieoczekiwanie zakończony
ru: Не удалось выполнить десериализацию FormattingOptions из-за ее непредвиденного завершения
tr: Beklenmedik bir şekilde sonlandırıldığından FormattingOptions seri durumdan çıkarılamıyor

# FormattingOptionsMissingRequiredProperty
source: Unable to deserialize FormattingOptions. Missing required property: {0}
ko: FormattingOptions를 역직렬화할 수 없습니다. 누락된 필수 속성: {0}
pl: Nie można deserializować elementu FormattingOptions. Brakuje wymaganej właściwości: {0}
ru: Не удалось выполнить десериализацию FormattingOptions. Отсутствует обязательное свойство: {0}
tr: FormattingOptions seri durumdan çıkarılamıyor. Gerekli özellik eksik: {0}

# MarkupContentSerializationError
source: Unable to deserialize MarkupContent. Unexpected value encountered: {0}
ko: MarkupContent를 역직렬화할 수 없습니다. 예기치 않은 값 {0}이(가) 있습니다.
pl: Nie można zdeserializować elementu MarkupContent. Napotkano nieoczekiwaną wartość: {0}
ru: Не удалось десериализовать MarkupContent. Возникло непредвиденное значение: {0}
tr: MarkupContent seri durumdan çıkarılamıyor. Beklenmeyen değerle karşılaşıldı: {0}

# NestedSumType
source: A SumType cannot have another SumType as type parameter.
ko: SumType에는 다른 SumType을 형식 매개 변수로 사용할 수 없습니다.
pl: Typ SumType nie może mieć innego typu SumType jako parametru typu.
ru: SumType не может иметь другой SumType в качестве параметра типа.
tr: SumType, tür parametresi olarak başka bir SumType'a sahip olamaz.

# NoSumTypeMatch
source: None of the SumType type parameters could be deserialized
ko: SumType 형식 매개 변수를 역직렬화할 수 없습니다.
pl: Nie można zdeserializować żadnego z parametrów typu SumType
ru: Невозможно десериализировать ни один из параметров типа SumType
tr: SumType tür parametrelerinin hiçbiri seri durumdan çıkarılamadı

# StringEnumMissingConstructor
source: Type {0} is missing a contructor that takes a single string as parameter.
ko: {0} 유형에 단일 문자열을 매개 변수로 사용하는 생성자가 없습니다.
pl: W typie {0} brakuje konstruktora, który przyjmuje pojedynczy ciąg jako parametr.
ru: В типе {0} отсутствует конструктор, принимающий одну строку в качестве параметра.
tr: {0} türünde parametre olarak tek bir dize alan bir yapıcı yok.

# StringEnumSerializationError
source: Unable to deserialize string-based enum. Unexpected data encountered: {0}
ko: 문자열 기반 열거형을 역직렬화할 수 없습니다. 예상치 못한 데이터 발생: {0}
pl: Nie można zdeserializować wyliczenia opartego na ciągach. Napotkano nieoczekiwane dane: {0}
ru: Не удалось десериализовать перечисление на основе строк. Обнаружены непредвиденные данные: {0}
tr: Dize tabanlı sabit listesi seri durumdan çıkarılamıyor. Beklenmeyen veriyle karşılaşıldı: {0}

# TextDocumentSyncSerializationError
source: Unable to deserialize TextDocumentSyncOptions. Unexpected value encountered: {0}
ko: TextDocumentSyncOptions를 역직렬화할 수 없습니다. 예기치 않은 값 {0}이(가) 있습니다.
pl: Nie można zdeserializować elementu TextDocumentSyncOptions. Napotkano nieoczekiwaną wartość: {0}
ru: Не удалось десериализовать TextDocumentSyncOptions. Возникло непредвиденное значение: {0}
tr: TextDocumentSyncOptions seri durumdan çıkarılamıyor. Beklenmeyen değerle karşılaşıldı: {0}
