Repository: dotnet/roslyn
Catalog: src/Interactive/EditorFeatures/Core/xlf/InteractiveEditorFeaturesResources.*.xlf
Languages: pt_br

source: Building Project
pt_br: Projeto de Compilação

source: Copying selection to Interactive Window.
pt_br: Copiando seleção para a Janela Interativa.

source: Executing selection in Interactive Window.
pt_br: Executando seleção na Janela Interativa.

source: Print a list of referenced assemblies.
pt_br: Imprima uma lista de assemblies referenciados.

source: The references command is not supported in this Interactive Window implementation.
pt_br: O comando de referências não tem suporte nessa implementação de Janela Interativa.

source: Reset the execution environment to the initial state, keep history.
pt_br: Redefina o ambiente de execução para o estado inicial e mantenha o histórico.

source: Reset to a clean environment (only mscorlib referenced), do not run initialization script.
pt_br: Redefina para um ambiente limpo (apenas mscorlib referenciado) e não execute o script de inicialização.

source: Resetting execution engine.
pt_br: Redefinindo o mecanismo de execução.

source: Resetting Interactive
pt_br: Redefinindo Interativo

source: The CurrentWindow property may only be assigned once.
pt_br: A propriedade CurrentWindow deve ser atribuído apenas uma vez.
