Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core.Wpf/Interactive/xlf/InteractiveEditorFeaturesResources.*.xlf
Languages: es

source: Building Project
es: Generando proyecto

source: Copying selection to Interactive Window.
es: Copiando selección en ventana interactiva.

source: Executing selection in Interactive Window.
es: Ejecutando selección en ventana interactiva.

source: Interactive host process platform
es: Plataforma de proceso de host interactiva

source: Print a list of referenced assemblies.
es: Imprima una lista de ensamblados de referencia.

source: The references command is not supported in this Interactive Window implementation.
es: No se admite el comando de referencias en esta implementación de ventana interactiva.

source: Reset the execution environment to the initial state, keep history.
es: Restablecer el entorno de ejecución al estado inicial, conservar el historial.

source: Reset to a clean environment (only mscorlib referenced), do not run initialization script.
es: Restablecer a un entorno limpio (referencia exclusiva a mscorlib), no ejecutar el script de inicialización.

source: Resetting execution engine.
es: Restableciendo el motor de ejecución.

source: Resetting Interactive
es: Restableciendo interactivo

source: The CurrentWindow property may only be assigned once.
es: La propiedad CurrentWindow solo se puede asignar una vez.
