Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Specifies that a property or procedure can be overridden by an identically named property or procedure in a derived class.
cs: Určuje, že se může vlastnost nebo procedura přepsat identicky pojmenovanou vlastností nebo procedurou v odvozené třídě.
de: Gibt an, dass eine Eigenschaft oder Prozedur von einer Eigenschaft oder Prozedur mit dem gleichen Namen in einer abgeleiteten Klasse überschrieben werden kann.
es: Especifica que una propiedad o un procedimiento pueden ser invalidados por una propiedad o procedimiento del mismo nombre en una clase derivada.
fr: Spécifie qu'une propriété ou procédure peut être substituée par une propriété ou procédure ayant un nom identique dans une classe dérivée.
it: Specifica che una proprietà o una routine può essere sottoposta a override da una proprietà o una routine con nome identico in una classe derivata.
ja: プロパティまたはプロシージャが派生クラスで同じ名前のプロパティまたはプロシージャによってオーバーライドできることを示します。
ko: 속성 또는 프로시저가 파생 클래스의 이름이 같은 속성 또는 프로시저로 재정의될 수 있도록 지정합니다.
pl: Określa, że właściwość lub procedura może być przesłoniona przez właściwość lub procedurę o identycznej nazwie w klasie pochodnej.
pt_br: Especifica se uma propriedade ou procedimento pode ser substituído por uma propriedade nomeada de forma idêntica ou procedimento derivado de uma classe base.
ru: Указывает, что свойство или процедура могут быть переопределены свойством или процедурой с идентичным названием в производном классе.
tr: Bir özellik ya da yordamın, türetilmiş sınıf içinde aynı adlı bir özellik veya yordam tarafından geçersiz kılınabileceğini belirtir.
zh_hans: 指定某一属性或过程可由派生类中具有相同名称的属性或过程重写。
zh_hant: 指定屬性或程序可由衍生類別中的同名屬性或程序覆寫。

source: Specifies that a property or procedure overrides an identically named property or procedure inherited from a base class.
cs: Určuje, že vlastnost nebo procedura přepisuje identicky pojmenovanou vlastnost nebo proceduru zděděnou ze základní třídy.
de: Gibt an, dass eine Eigenschaft oder Prozedur eine Eigenschaft oder Prozedur mit dem gleichen Namen überschreibt, die von einer Basisklasse geerbt wurde.
es: Especifica que una propiedad o procedimiento invalida una propiedad o procedimiento del mismo nombre heredado de una clase base.
fr: Spécifie qu'une propriété ou procédure substitue une propriété ou procédure ayant un nom identique et ayant été héritée d'une classe de base.
it: Specifica che una proprietà o una routine esegue l'override di una proprietà o una routine con nome identico ereditata da una classe di base.
ja: プロパティまたはプロシージャが基本クラスから継承された同じ名前のプロパティまたはプロシージャをオーバーライドすることを示します。
ko: 속성 또는 프로시저가 기본 클래스에서 상속된 이름이 같은 속성 또는 프로시저를 재정의하도록 지정합니다.
pl: Określa, że właściwość lub procedura przesłania właściwość lub procedurę o identycznej nazwie odziedziczoną z klasy bazowej.
pt_br: Especifica que uma propriedade ou procedimento substitui uma propriedade nomeada de forma idêntica ou procedimento herdado de uma classe base.
ru: Указывает, что свойство или процедура переопределяет свойство или процедуру с идентичным названием, унаследованную от базового класса.
tr: Bir özellik ya da yordamın, temel sınıftan devralınmış aynı adlı bir özellik veya yordamı geçersiz kıldığını belirtir.
zh_hans: 指定某一属性或过程可重写从基类中继承的具有相同名称的属性或过程。
zh_hant: 指定屬性或程序會覆寫繼承自基底類別的同名屬性或程序。

source: Specifies that a procedure parameter takes an optional array of elements of the specified type.
cs: Určuje, že parametr procedury přijímá volitelné pole prvků zadaného typu.
de: Gibt an, dass ein Prozedurparameter ein optionales Array von Elementen vom angegebenen Typ annimmt.
es: Especifica que el parámetro de un procedimiento toma una matriz opcional de elementos del tipo especificado.
fr: Spécifie qu'un paramètre de procédure accepte un tableau d'éléments facultatif du type spécifié.
it: Specifica che un parametro di routine accetta una matrice facoltativa di elementi del tipo specificato.
ja: プロシージャのパラメーターが、指定された型の、省略可能な要素の配列を受け取ることを示します。
ko: 프로시저 매개 변수가 지정된 형식의 선택적인 요소 배열을 사용하도록 지정합니다.
pl: Określa, że parametr procedury przyjmuje opcjonalną tablicę elementów określonego typu.
pt_br: Especifica que um parâmetro de procedimento leva uma matriz opcional de elementos do tipo especificado.
ru: Указывает, что параметр процедуры принимает необязательный массив элементов заданного типа.
tr: Bir yordam parametresinin, belirtilen türde öğelere sahip isteğe bağlı bir dizi aldığını belirtir.
zh_hans: 指定过程参数可采用指定类型的可选元素数组。
zh_hant: 指定程序參數可會接受指定類型的選擇性元素陣列。

source: Indicates that a method, class, or structure declaration is a partial definition of the method, class, or structure.
cs: Označuje, že deklarace metody, třídy nebo struktury je částečnou definicí metody, třídy nebo struktury.
de: Gibt an, dass es sich bei der Deklaration einer Methode, Klasse oder Struktur um eine teilweise Definition der Methode, Klasse oder Struktur handelt.
es: Indica que una declaración de método, clase o estructura es una definición parcial del método, clase o estructura.
fr: Indique qu'une déclaration de méthode, de classe ou de structure est une définition partielle de la méthode, de la classe ou de la structure.
it: Indica che una dichiarazione di metodo, di classe o di struttura è una definizione parziale del metodo, della classe o della struttura.
ja: メソッド、クラス、または構造体の宣言が、メソッド、クラス、または構造体の部分定義であることを示します。
ko: 메서드, 클래스 또는 구조체 선언이 메서드, 클래스 또는 구조체의 부분 정의임을 나타냅니다.
pl: Wskazuje, że metoda, klasa lub deklaracja struktury jest częściową definicją metody, klasy lub struktury.
pt_br: Indica que um declaração de método, classe ou estrutura é uma definição parcial do método, classe ou estrutura.
ru: Указывает, что метод, класс или структура объявления является частичным определением метода, класса или структуры.
tr: Bir yöntem, sınıf ya da yapı bildiriminin; yöntem, sınıf veya yapının kısmi tanımı olduğunu gösterir.
zh_hans: 指示某一方法、类或结构声明是其他方法、类或结构的分部定义。
zh_hant: 表示方法、類別或結構宣告，為方法、類別或結構的部分定義。

source: Returns the sum of two numbers, or the positive value of a numeric expression.
cs: Vrací součet dvou čísel nebo kladnou hodnotu číselného výrazu.
de: Gibt die Summe zweier Zahlen oder den positiven Wert eines numerischen Ausdrucks zurück.
es: Devuelve la suma de dos números o el valor positivo de una expresión numérica.
fr: Retourne la somme de deux nombres, ou la valeur positive d'une expression numérique.
it: Restituisce la somma di due numeri o il valore positivo di un'espressione numerica.
ja: 2 つの数値の合計、または数値式の正の値を返します。
ko: 두 수의 합계를 반환하거나 숫자 식의 양의 값을 반환합니다.
pl: Zwraca sumę dwóch liczb lub wartość dodatnią wyrażenia liczbowego.
pt_br: Retorna a soma de dois números ou o valor positivo de uma expressão numérica.
ru: Возвращает сумму двух чисел или положительное значение числового выражения.
tr: İki sayının toplamını ya da sayısal bir ifadenin pozitif değerini döndürür.
zh_hans: 返回两个数之和，或数值表达式的正值。
zh_hant: 傳回兩個數值的和，或數值運算式的正值。

source: Prevents the contents of an array from being cleared when the dimensions of the array are changed.
cs: Zabraňuje vymazání obsahu pole, když se změní rozměry pole.
de: Verhindert, dass der Inhalt eines Arrays gelöscht wird, wenn die Dimensionen des Arrays geändert werden.
es: Impide que el contenido de una matriz se borre cuando cambian sus dimensiones.
fr: Empêche le contenu d'un tableau d'être effacé lorsque les dimensions de ce dernier changent.
it: Impedisce che il contenuto di una matrice venga cancellato quando vengono modificate le dimensioni della matrice.
ja: 配列の次元が変更されるときに配列の内容が消去されないようにします。
ko: 배열 차원을 변경할 때 배열 내용이 지워지지 않도록 합니다.
pl: Zapobiega wyczyszczeniu zawartości tablicy przy zmianie jej wymiarów.
pt_br: Impede que o conteúdo de uma matriz seja apagado quando as dimensões da matriz são alteradas.
ru: Защищает содержимое массива от очистки при изменении размеров массива.
tr: Bir dizinin boyutları değiştirildiğinde içeriğinin silinmesini engeller.
zh_hans: 防止在数组维数发生变化时清除数组的内容。
zh_hant: 避免在變更陣列維度時，清除陣列內容。

source: Specifies that one or more declared programming elements are accessible only from within their module, class, or structure.
cs: Určuje, že nejmíň jeden deklarovaný programový prvek je přístupný jenom zevnitř svého vlastního modulu, třídy nebo struktury.
de: Gibt an, dass auf ein oder mehrere deklarierte Programmierelemente nur aus dem eigenen Modul, der Klasse oder Struktur zugegriffen werden kann.
es: Especifica que solo se puede obtener acceso a uno o varios elementos de programación declarados desde dentro de su módulo, clase o estructura.
fr: Spécifie qu'un ou plusieurs éléments de programmation déclarés sont accessibles uniquement à partir de leur module, classe ou structure.
it: Specifica che uno o più elementi di programmazione dichiarati sono accessibili solo dal relativo modulo o dalla relativa classe o struttura.
ja: 1 つ以上の宣言されたプログラミング要素が、モジュール内、クラス内、または構造体内からのみアクセスできることを示します。
ko: 프로그래밍 요소를 선언한 모듈, 클래스 또는 구조체에서만 해당 프로그래밍 요소를 액세스할 수 있도록 지정합니다.
pl: Określa, że co najmniej jeden zadeklarowany element programistyczny jest dostępny tylko w obrębie swojego modułu, klasy lub struktury.
pt_br: Especifica que um ou mais elementos de programação declarados são acessíveis somente de dentro do seu módulo, classe ou estrutura.
ru: Указывает, что один или несколько объявленных программных элементов доступны только внутри модуля, класса или структуры.
tr: Bir ya da daha fazla bildirilmiş programlama öğesine, sadece kendi modül, sınıf ya da yapısı içinden erişilebileceğini belirtir.
zh_hans: 指定只能从所声明的编程元素的模块、类或结构内部来访问一个或多个这样的编程元素。
zh_hant: 指定一或多個宣告的程式設計元素，只能從其模組、類別或結構加以存取。

source: Declares the name of a property, and the property procedures used to store and retrieve the value of the property.
cs: Deklaruje název vlastnosti a procedury vlastnosti používané k ukládání a načítání hodnoty vlastnosti.
de: Deklariert den Namen einer Eigenschaft sowie die Eigenschaftenprozeduren zum Speichern und Abrufen des Werts der Eigenschaft.
es: Declara el nombre de una propiedad y los procedimientos de propiedad utilizados para almacenar y recuperar el valor de la propiedad.
fr: Déclare le nom d'une propriété, ainsi que les procédures de propriété utilisées pour stocker et récupérer la valeur de la propriété.
it: Dichiara il nome di una proprietà e le routine della proprietà usate per archiviare e recuperare il valore della proprietà.
ja: プロパティの名前、およびプロパティの値を格納して取得するために使用されるプロパティ プロシージャを宣言します。
ko: 속성 이름과 속성 값을 저장하고 검색하는 데 사용되는 속성 프로시저를 선언합니다.
pl: Deklaruje nazwę właściwości i procedury właściwości używane do przechowywania i pobierania wartości właściwości.
pt_br: Declara o nome de uma propriedade e os procedimentos de propriedade usados para armazenar e recuperar o valor da propriedade.
ru: Объявляет имя свойства и процедуры свойства, используемые для хранения и извлечения значения свойства.
tr: Bir özelliğin adını ve özellik değerini depolamak ve almak için kullanılan özellik yordamlarını bildirir.
zh_hans: 声明用于存储和检索属性值的属性名称和属性过程。
zh_hant: 宣告屬性的名稱，以及用以儲存及擷取屬性值的屬性程序。

source: Specifies that one or more declared members of a class are accessible from anywhere in the same assembly, their own classes, and derived classes.
cs: Určuje, že nejmíň jeden deklarovaný člen třídy je přístupný odkudkoli ve stejném sestavení, z jeho vlastní třídy a z odvozených tříd.
de: Gibt an, dass auf ein oder mehrere deklarierte Member einer Klasse überall in der gleichen Assembly, in der eigenen Klasse und in abgeleiteten Klassen zugegriffen werden kann.
es: Especifica que se puede obtener acceso a uno o varios miembros declarados de una clase desde cualquier lugar del mismo ensamblado, desde sus propias clases y desde las clases derivadas.
fr: Spécifie qu'un ou plusieurs membres déclarés d'une classe sont accessibles à partir de n'importe quel emplacement dans le même assembly, leurs propres classes et les classes dérivées.
it: Specifica che uno o più membri dichiarati di una classe sono accessibili da qualsiasi punto nello stesso assembly, nelle relative classi e nelle classi derivate.
ja: クラスの1 つ以上の宣言されたメンバーが同じアセンブリ、独自のクラス、および派生クラス内のいずれかからアクセスできることを示します。
ko: 키워드 클래스 멤버를 선언한 어셈블리, 해당 어셈블리의 클래스 및 파생 클래스 어디에서나 선언된 클래스 멤버를 액세스할 수 있도록 지정합니다.
pl: Określa, że co najmniej jedna zadeklarowana składowa klasy jest dostępna z każdego miejsca w tym samym zestawie, swojej klasie i klasach pochodnych.
pt_br: Especifica que um ou mais membros declarados de uma classe são acessíveis a partir de qualquer lugar no mesmo assembly, suas próprias classes e classes derivadas.
ru: Указывает, что один или несколько объявленных членов класса доступны из любой точки в той же сборке, собственных классах и производных классах.
tr: Bir sınıfın bir ya da daha fazla bildirilmiş üyesine aynı derleme, kendi sınıfları ve türetilmiş sınıflar içinde her yerden erişilebileceğini belirtir.
zh_hans: 指定可以从所声明的类成员所在的程序集、其自己的类和派生类中的任何位置来访问一个或多个这样的类成员。
zh_hant: 指定類別的一或多個宣告成員，可從相同的組件、其本身的類別以及衍生類別中的任何位置加以存取。

source: Specifies that one or more declared programming elements are accessible only from within their own class or from a derived class.
cs: Určuje, že nejmíň jeden deklarovaný programový prvek je přístupný jenom ze své vlastní třídy nebo z odvozené třídy.
de: Gibt an, dass auf ein oder mehrere deklarierte Programmierelemente nur aus ihrer eigenen Klasse oder aus einer abgeleiteten Klasse zugegriffen werden kann.
es: Especifica que solo se puede obtener acceso a uno o varios elementos de programación declarados desde dentro de su propia clase o desde una clase derivada.
fr: Spécifie qu'un ou plusieurs éléments de programmation déclarés sont accessibles uniquement à partir de leur propre classe ou d'une classe dérivée.
it: Specifica che uno o più elementi di programmazione dichiarati sono accessibili solo dalla relativa classe o da una classe derivata.
ja: 1 つ以上の宣言されたプログラミング要素が、独自のクラス内または派生クラスからのみアクセスできることを示します。
ko: 프로그래밍 요소를 선언한 클래스 또는 파생 클래스에서만 해당 프로그래밍 요소를 액세스할 수 있도록 지정합니다.
pl: Określa, że co najmniej jeden zadeklarowany element programistyczny jest dostępny tylko w obrębie swojej klasy lub z klasy pochodnej.
pt_br: Especifica que um ou mais elementos de programação declarados são acessíveis somente de dentro da sua própria classe ou de uma classe derivada.
ru: Указывает, что один или несколько объявленных программных элементов доступны только внутри собственного класса или производного класса.
tr: Bir ya da daha fazla bildirilmiş programlama öğesine sadece kendi sınıfı veya türetilmiş sınıf içinden erişilebileceğini belirtir.
zh_hans: 指定只能从所声明的编程元素自己的类内部或者从派生类来访问一个或多个这样的编程元素。
zh_hant: 指定一或多個宣告的程式設計元素，只能從其本身的類別或從衍生的類別加以存取。

source: Specifies that one or more declared programming elements have no access restrictions.
cs: Určuje, že nejmíň jeden deklarovaný programový prvek nemá žádné omezení přístupu.
de: Gibt an, dass ein oder mehrer deklarierte Programmierelemente über keine Zugriffseinschränkungen verfügen.
es: Especifica que uno o varios elementos de programación declarados no tienen restricciones de acceso.
fr: Spécifie qu'un ou plusieurs éléments de programmation déclarés n'ont pas de restrictions d'accès.
it: Specifica che a uno o più elementi di programmazione dichiarati non è applicata alcuna restrizione di accesso.
ja: 1 つ以上の宣言されたプログラミング要素にアクセス制限がないことを示します。
ko: 선언된 프로그래밍 요소에 대한 액세스를 제한하지 않도록 지정합니다.
pl: Określa, że co najmniej jeden zadeklarowany element programistyczny nie ma ograniczeń dostępu.
pt_br: Especifica que um ou mais elementos de programação declarados não têm restrições de acesso.
ru: Указывает, что один или несколько объявленных программных элементов не имеют ограничений доступа.
tr: Bir ya da daha fazla bildirilmiş programlama öğesinin hiçbir erişim kısıtlamasına sahip olmadığını belirtir.
zh_hans: 指定一个或多个所声明的编程元素均没有访问限制。
zh_hant: 指定一或多個宣告的程式設計元素，沒有存取限制。

source: Specifies that a variable or property can be read but not written to.
cs: Určuje, že se proměnná nebo vlastnost může číst, ale nemůže se do ní zapisovat.
de: Gibt an, dass eine Variable oder Eigenschaft gelesen werden kann, jedoch kein Schreibvorgang möglich ist.
es: Especifica que se puede leer una variable o propiedad, pero que no se puede escribir en ella.
fr: Spécifie qu'une variable ou une propriété peut être accessible en lecture mais pas en écriture.
it: Specifica che una variabile o una proprietà è di sola lettura e non è possibile scrivervi.
ja: 変数またはプロパティを読み込めるが、書き込みはできないことを示します。
ko: 변수 또는 속성을 읽을 수 있지만 쓸 수는 없도록 지정합니다.
pl: Określa, że zmienna lub właściwość może być dostępna do odczytu, ale nie do zapisu.
pt_br: Especifica que uma variável ou propriedade pode ser lida mas não gravada.
ru: Указывает, что переменная или свойство можно записать, но не читать.
tr: Bir değişken ya da özelliğin okunabileceğini ancak üzerine yazılamayacağını belirtir.
zh_hans: 指定只能读取但不能写入某一变量或属性。
zh_hant: 指定可讀取但無法寫入的變數或屬性。

source: Reallocates storage space for an array variable.
cs: Opětovně přiděluje místo pro uložení proměnné typu pole.
de: Reserviert Speicherplatz für eine Arrayvariable neu.
es: Reasigna espacio de almacenamiento a una variable de matriz.
fr: Réalloue l'espace de stockage d'une variable tableau.
it: Rialloca lo spazio di archiviazione per una variabile di matrice.
ja: 配列変数の記憶域を再割り当てします。
ko: 배열 변수의 스토리지 공간을 다시 할당합니다.
pl: Przydziela ponownie obszar przechowywania dla zmiennej tablicowej.
pt_br: Realoca espaço de armazenamento para uma variável de matriz.
ru: Перераспределяет область хранения для переменной массива.
tr: Bir dizi değişkeni için depolama alanını yeniden ayırır.
zh_hans: 为数组变量重新分配存储空间。
zh_hant: 重新配置陣列變數的儲存空間。

source: Performs an arithmetic right shift on a bit pattern
cs: Provede aritmetický bitový posun vpravo.
de: Führt eine arithmetische Rechtsverschiebung in einem Bitmuster aus
es: Realiza un desplazamiento aritmético a la derecha en un patrón de bits
fr: Effectue un décalage arithmétique vers la droite au niveau du bit
it: Esegue uno scorrimento aritmetico a destra in uno schema di bit.
ja: ビット パターンに対して算術右シフトを実行します。
ko: 비트 패턴의 산술 오른쪽 시프트 연산을 수행합니다.
pl: Wykonuje arytmetyczne przesunięcie w prawo na ciągu bitowym
pt_br: Executa um deslocamento aritmético para a direita em um padrão de bit
ru: Выполняет арифметическое смещение вправо для битового шаблона
tr: Bir bit deseninde aritmetik sağa kaydırma gerçekleştirir
zh_hans: 对位模式执行算术右移位运算
zh_hant: 在位元模式上執行算術右位移

source: Declares a Set property procedure that is used to assign a value to a property.
cs: Deklaruje proceduru vlastnosti Set, která se používá pro přiřazení hodnoty k vlastnosti.
de: Deklariert eine Set-Eigenschaftenprozedur, mit der einer Eigenschaft ein Wert zugewiesen wird.
es: Declara un procedimiento de propiedad Set que se utiliza para asignar un valor a una propiedad.
fr: Déclare une procédure de propriété Set qui sert à assigner une valeur à une propriété.
it: Dichiara una routine di proprietà Set usata per assegnare un valore a una proprietà.
ja: 値をプロパティに割り当てるのに使用する Set プロパティ プロシージャを宣言します。
ko: 속성에 값을 할당하는 데 사용되는 Set 속성 프로시저를 선언합니다.
pl: Deklaruje procedurę właściwości Set używaną do przypisywania wartości do właściwości.
pt_br: Declara um procedimento de propriedade Set que é usado para atribuir valor a uma propriedade.
ru: Объявляет процедуру свойства Set, которая используется для присвоения значения свойства.
tr: Bir özelliğe değer atamak için kullanılan bir Set özelliği yordamı bildirir.
zh_hans: 声明用于向属性赋值的 Set 属性过程。
zh_hant: 宣告用以為屬性指派值的 Set 屬性程序。

source: Specifies that a declared programming element redeclares and hides an identically named element in a base class.
cs: Určuje, že deklarovaný programový prvek znovu deklaruje a skryje identicky pojmenovaný prvek základní třídy.
de: Gibt an, dass ein deklariertes Programmierelement ein Element mit dem gleichen Namen in einer Basisklasse erneut deklariert und verbirgt.
es: Especifica que un elemento de programación declarado vuelve a declarar y oculta un elemento del mismo nombre en una clase base.
fr: Spécifie qu'un élément de programmation déclaré redéclare et masque un élément ayant un nom identique dans une classe de base.
it: Specifica che un elemento di programmazione dichiarato ridichiara e nasconde un elemento con nome identico in una classe di base.
ja: 宣言されたプログラミング要素が、基本クラスにある、同じ名前を持つ要素を宣言し直して非表示にすることを示します。
ko: 선언된 프로그래밍 요소가 기본 클래스의 이름이 같은 요소를 다시 선언하고 숨깁니다.
pl: Określa, że zadeklarowany element programistyczny ponownie deklaruje i ukrywa element o identycznej nazwie w klasie bazowej.
pt_br: Especifica que um elemento de programação declarado redeclara e oculta um elemento de nome idêntico em uma classe base.
ru: Указывает, что объявленный программный элемент объявляется повторно, и скрывает одинаково названные элементы в базовом классе.
tr: Bildirilmiş bir programlama öğesinin, temel sınıf içinde aynı adlı bir öğeyi yeniden bildirdiğini ve gizlediğini belirtir.
zh_hans: 指定已声明的编程元素重新声明并隐藏基类中具有相同名称的元素。
zh_hant: 指定宣告的程式設計項目會重新宣告並隱藏基底類別中的同名項目。

source: Specifies that one or more declared programming elements are associated with all instances of a class or structure.
cs: Určuje, že nejmíň jeden deklarovaný programový prvek je spojený se všemi instancemi třídy nebo struktury.
de: Gibt an, dass ein oder mehrere Programmierelemente allen Instanzen einer Klasse oder Struktur zugeordnet sind.
es: Especifica que uno o varios elementos de programación declarados están asociados a todas las instancias de una clase o estructura.
fr: Spécifie qu'un ou plusieurs éléments de programmation déclarés sont associés à toutes les instances d'une classe ou d'une structure.
it: Specifica che uno o più elementi di programmazione dichiarati sono associati a tutte le istanze di una classe o una struttura.
ja: 1 つ以上の宣言されたプログラミング要素がクラスまたは構造体のすべてのインスタンスに関連付けられていることを示します。
ko: 선언된 프로그래밍 요소가 클래스 또는 구조체의 모든 인스턴스와 연결되도록 지정합니다.
pl: Określa, że co najmniej jeden element programistyczny może być skojarzony ze wszystkimi wystąpieniami klasy lub struktury.
pt_br: Especifica que um ou mais elementos de programação declarados estão associados a todas as instâncias de uma classe ou estrutura.
ru: Указывает, что один или несколько объявленных программных элементов связаны со всеми элементами класса или структуры.
tr: Bir ya da daha fazla bildirilmiş programlama öğesinin, bir sınıf veya yapının tüm örnekleri ile ilişkili olduğunu belirtir.
zh_hans: 指定与某一类或结构的所有实例关联的一个或多个所声明的编程元素。
zh_hant: 指定一或多個宣告的程式設計元素，其會與類別或結構的所有執行個體相關聯。
