Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Specifies that one or more declared local variables are to remain in existence and retain their latest values after the procedure in which they are declared terminates.
cs: Určuje, že nejmíň jedna z deklarovaných lokálních proměnných si zachová existenci a svou poslední hodnotu potom, co se ukončí procedura, ve které jsou deklarované.
de: Gibt an, dass eine oder mehrere deklarierte Variablen beibehalten werden und den letzten Wert behalten sollen, wenn die Prozedur beendet wird, in der sie deklariert wurden.
es: Especifica que una o varias variables locales declaradas deben conservarse, así como sus últimos valores, una vez terminado el procedimiento en el que se declaran.
fr: Spécifie qu'une ou plusieurs variables locales déclarées doivent continuer à exister et conserver leurs toutes dernières valeurs, une fois terminée la procédure dans laquelle elles sont déclarées.
it: Specifica che una o più variabili locali dichiarate devono rimanere presenti e mantenere i valori più recenti al termine della routine in cui vengono dichiarate.
ja: 1 つ以上の宣言されているローカル変数が残存し、ローカル変数を宣言するプロシージャが終了した後もその最新の値が保持されるように指定します。
ko: 지역 변수가 선언된 프로시저가 종료된 후에도 선언된 지역 변수를 하나 이상 유지하고, 최신 값을 그대로 보존하도록 지정합니다.
pl: Określa, że co najmniej jedna zadeklarowana zmienna lokalna będzie istnieć i zachowywać swoje ostatnie wartości po zakończeniu procedury, w której była zadeklarowana.
pt_br: Especifica que uma ou mais variáveis locais declaradas devem permanecer e manter seus valores mais recentes apó a finalização do procedimento em que elas são declaradas.
ru: Указывает, что одна или несколько объявленных локальных переменных должны сохранять свои последние значения после процедуры, в которой они были объявлены прерванными.
tr: Bir ya da daha fazla bildirilmiş yerel değişkenin varlıklarını sürdüreceğini ve bildirildikleri yordam sonlandıktan sonra en yeni değerlerini koruyacağını belirtir.
zh_hans: 指定在声明一个或多个局部变量的过程终止后，这些已声明的局部变量将继续存在并保留其最新值。
zh_hant: 指定一或多個宣告的區域變數在宣告該變數的程序結束後，仍會持續存在且保留最後的值。

source: Declares the name of a structure and introduces the definition of the variables, properties, events, and procedures that make up the structure.
cs: Deklaruje název struktury a zavádí definice proměnných, vlastností, událostí a procedur, které tvoří strukturu.
de: Deklariert den Namen einer Struktur und führt die Definitionen der Variablen, Eigenschaften, Ereignisse und Prozeduren ein, aus denen die Struktur besteht.
es: Declara el nombre de una estructura e introduce la definición de las variables, propiedades, eventos y procedimientos que la componen.
fr: Déclare le nom d'une structure et introduit la définition des variables, propriétés, événements et procédures qui constituent la structure.
it: Dichiara il nome di una struttura e introduce la definizione di variabili, proprietà, eventi e routine che costituiscono la struttura.
ja: 構造体の名前を宣言し、その構造体を構成する変数、プロパティ、イベント、プロシージャの定義を示します。
ko: 구조체의 이름을 선언하고 해당 구조체를 구성하는 변수, 속성, 이벤트 및 프로시저의 정의를 지정합니다.
pl: Deklaruje nazwę struktury i wprowadza definicje zmiennych, właściwości, zdarzeń i procedur tworzących strukturę.
pt_br: Declara o nome de uma estrutura e apresenta a definição das variáveis, propriedades, eventos e procedimentos que formam a estrutura.
ru: Объявляет имя структуры и вводит определение переменных, свойств, событий и процедур, которые составляют структуру.
tr: Bir yapının adını bildirir ve yapıyı oluşturan değişkenler, özellikler, olaylar ve yordamların tanımını ortaya çıkarır.
zh_hans: 声明结构名称，并引入组成结构的变量、属性、事件和过程的定义。
zh_hant: 宣告結構的名稱，並引進組成結構之變數、屬性、事件與程序的定義。

source: Declares the name, parameters, and code that define a Sub procedure, that is, a procedure that does not return a value to the calling code.
cs: Deklaruje název, parametry a kód, které definují proceduru Sub, která je procedurou nevracející hodnotu volajícímu kódu.
de: Deklariert den Namen, die Parameter und den Code, mit denen eine Sub-Prozedur definiert wird, d. h. eine Prozedur, die keinen Wert an den aufrufenden Code zurückgibt.
es: Declara el nombre, los parámetros y el código que definen un procedimiento Sub, es decir, un procedimiento que no devuelve un valor al código de llamada.
fr: Déclare le nom, les paramètres et le code qui définissent une procédure Sub, en d'autres termes, une procédure qui ne retourne pas de valeur au code appelant.
it: Dichiara il nome, i parametri e il codice che definiscono una routine Sub, ovvero una routine che non restituisce un valore al codice chiamante.
ja: Sub プロシージャ (呼び出しコードに値を返さないプロシージャ) を定義する名前、パラメーター、およびコードを宣言します。
ko: 호출 코드에 값을 반환하지 않는 프로시저인 Sub 프로시저를 정의하는 이름, 매개 변수 및 코드를 선언합니다.
pl: Deklaruje nazwę, parametry i kod definiujący procedurę Sub, która jest procedurą niezwracającą wartości do wywołującego kodu.
pt_br: Declara o nome, parâmetros e código que definem um procedimento Sub, ou seja, um procedimento que não retorna um valor para o código de chamada.
ru: Объявляет имя, параметры и код, которые определяют подпроцедуру, то есть процедуру, которая не возвращает значение вызывающему коду.
tr: Bir Sub yordamını (çağrıldığı koda bir değer döndürmeyen yordam) tanımlayan adı, parametreleri ve kodu bildirir.
zh_hans: 声明用于定义 Sub 过程(即不会将值返回到调用代码的过程)的名称、参数和代码。
zh_hant: 宣告定義 Sub 程序的名稱、參數與程式碼; 也就是說，這種程序不會對呼叫的程式碼傳回值。

source: Separates the beginning and ending values of a loop counter or array bounds or that of a value match range.
cs: Odděluje počáteční a koncové hodnoty čítače cyklů, hranic pole nebo rozsahu shodných hodnot.
de: Trennt Beginn- und Endwerte von einem Schleifenzähler oder Arraygrenzen oder einem Wertübereinstimmungsbereich.
es: Separa los valores de inicio y final de un contador de bucle o los límites de una matriz o los de un intervalo coincidente de valores.
fr: Sépare les valeurs de début et de fin d'un compteur de boucles, de limites d'index de tableau ou d'une plage de correspondance de valeurs.
it: Separa i valori iniziale e finale di un contatore di cicli o dei limiti di matrice oppure quello di un intervallo di corrispondenza valori.
ja: ループ カウンター、配列の範囲、または値が一致する範囲の開始値と終了値を分割します。
ko: 루프 카운터나 배열 범위, 범위와 일치하는 값의 시작 값과 끝 값을 구분합니다.
pl: Oddziela początkowe i końcowe wartości licznika pętli, granic tablicy lub zakresu dopasowania wartości.
pt_br: Separa os valores de início e de fim de um contador de loops ou associações de matriz ou de um intervalo de valores correspondentes.
ru: Разделяет начальные и конечные значения счетчика цикла или границ массива или диапазона совпадения значений.
tr: Bir döngü sayacının veya dizi sınırlarının ya da değer eşleşme aralığının başlangıç ve bitiş değerlerini ayırır.
zh_hans: 分隔循环计数器、数组绑定或值匹配范围的起始值和终止值。
zh_hant: 分隔迴圈計數器或陣列界限的起始值與結束值，或值比對範圍的起始值與結束值。

source: Determines the run-time type of an object reference variable and compares it to a data type. Returns True or False depending, on whether the two types are compatible. <result> = TypeOf <objectExpression> Is <typeName>
cs: Určuje za běhu typ proměnné odkazu na objekt a porovná ho s datovým typem. Vrací True nebo False podle toho, jestli jsou tyto dva typy kompatibilní. <result> = TypeOf <objectExpression> Is <typeName>
de: Bestimmt den Laufzeittyp einer Objektverweisvariablen und vergleicht ihn mit einem Datentyp. Gibt True oder False zurück, abhängig davon, ob die beiden Typen kompatibel sind. <result> = TypeOf <objectExpression> Is <typeName>
es: Determina el tipo en tiempo de ejecución de una variable de referencia de objetos y lo compara con un tipo de datos. Devuelve True o False dependiendo de si los dos tipos son compatibles. <result> = TypeOf <objectExpression> Is <typeName>
fr: Détermine le type au moment de l'exécution d'une variable de référence d'objet et le compare à un type de données. Retourne True ou False selon que les deux types sont compatibles ou non. <result> = TypeOf <objectExpression> Is <typeName>
it: Determina il tipo in fase di esecuzione di una variabile di riferimento a un oggetto e lo confronta con un tipo di dati. Restituisce True o False a seconda che i due tipi siano o meno compatibili. <result> = TypeOf <objectExpression> Is <typeName>
ja: オブジェクト参照変数の実行時の型を判断して、データ型と比較します。2 つの型に互換性があるかどうかに応じて、True または False を返します。 <result> = TypeOf <objectExpression> Is <typeName>
ko: 개체 참조 변수의 런타임 형식을 확인한 후 데이터 형식과 비교합니다. 두 형식의 호환 여부에 따라 True 또는 False를 반환합니다. <result> = TypeOf <objectExpression> Is <typeName>
pl: Określa typ zmiennej odwołania do obiektu w czasie wykonywania i porównuje go z typem danych. Zwraca wartość True lub False w zależności od tego, czy typy są zgodne. <result> = TypeOf <objectExpression> Is <typeName>
pt_br: Determina o tipo de tempo de execução de uma variável de referência de objeto e o compara a um tipo de dados. Retorna Verdadeiro ou Falso dependendo se os dois tipos são compatíveis. <result> = TypeOf <objectExpression> Is <typeName>
ru: Определяет тип времени выполнения объектной ссылки для переменной и сравнивает с типом данных. Возвращает True или False в зависимости от того, совместимы ли оба типа. <result> = TypeOf <objectExpression> Is <typeName>
tr: Bir nesne başvuru değişkeninin çalışma zamanı türünü belirler ve bunu bir veri türü ile karşılaştırır. İki türün uyumlu olma durumuna göre True ya da False değer döndürür. <result> = TypeOf <objectExpression> Is <typeName>
zh_hans: 确定对象引用变量的运行时类型并将它与某个数据类型进行比较。根据这两个数据类型是否兼容来返回 True 或 False。 <result> = TypeOf <objectExpression> Is <typeName>
zh_hant: 判斷物件參考變數的執行階段類型，並與資料類型進行比較。依兩種類型是否相容，而傳回 True 或 False。 <result> = TypeOf <objectExpression> Is <typeName>

source: Used in a Declare statement. Specifies that Visual Basic should marshal all strings to Unicode values in a call into an external procedure, and should look up the procedure without modifying its name.
cs: Používá se v příkazu Declare. Určuje, jestli by měl Visual Basic zařazovat všechny řetězce k hodnotám Unicode ve volání do externí procedury a jestli by měl vyhledávat proceduru bez úpravy jejího názvu.
de: Wird in einer Declare-Anweisung verwendet. Gibt an, dass Visual Basic alle Zeichenfolgen in Unicode-Werte in einem Aufruf in einer externen Prozedur marshallen und die Prozedur suchen soll, ohne ihren Namen zu ändern.
es: Se utiliza en una instrucción Declare. Especifica que Visual Basic debe serializar todas las cadenas como valores Unicode en una llamada a un procedimiento externo, y debe buscar el procedimiento sin modificar su nombre.
fr: Utilisé dans une instruction Declare. Spécifie que Visual Basic doit marshaler toutes les chaînes en valeurs Unicode lors d'un appel d'une procédure externe, et qu'il doit rechercher la procédure sans modifier son nom.
it: Usata in un'istruzione Declare. Specifica che Visual Basic deve eseguire il marshalling di tutte le stringhe in valori Unicode in una chiamata in una routine esterna, nonché cercare la routine senza modificarne il nome.
ja: Declare ステートメントで使用されます。Visual Basic が外部プロシージャ呼び出しのすべての文字列を Unicode 値にマーシャリングし、その名前を変更せずにプロシージャを検索することを指定します。
ko: Declare 문에 사용됩니다. Visual Basic에서 외부 프로시저 호출 시 모든 문자열을 Unicode 값으로 마샬링하고 프로시저 이름을 수정하지 않고 프로시저를 조회하도록 지정합니다.
pl: Używane w instrukcji Declare. Określa, że język Visual Basic powinien kierować wszystkie ciągi jako wartości Unicode przy wywołaniu zewnętrznej procedury i sprawdzić procedurę bez modyfikowania jej nazwy.
pt_br: Usado em uma instrução Declare. Especifica se o Visual Basic deve fazer marshaling de todas as cadeias de caracteres para valores Unicode em uma chamada para um procedimento externo e deve consultar o procedimento sem modificar seu nome.
ru: Используемый в операторе Declare. Указывает, что Visual Basic должен маршалировать все строки в значениях Юникод в вызове на внешнюю процедуру и должен найти процедуру без изменения ее имени.
tr: Declare deyimi içinde kullanılır. Visual Basic'in bir dış yordam çağrısı içindeki tüm dizeleri Unicode değerleri olarak sıralaması ve yordamı, adını değiştirmeden araması gerektiğini belirtir.
zh_hans: 用在 Declare 语句中。指定 Visual Basic 应将外部过程中调用中的所有字符串封送为 Unicode 值，并应查找相应的过程，但不修改该过程的名称。
zh_hant: 用於 Declare 陳述式中。指定 Visual Basic 應在呼叫外部程序中，將所有字串封送處理成 Unicode 值，且應在不修改程序名稱的情況下，查詢該程序。

source: Indicates that a conversion operator (CType) converts a class or structure to a type that can hold all possible values of the original class or structure.
cs: Označuje, že operátor převodu (CType) převede třídu nebo strukturu na typ, který může uchovat všechny možné hodnoty původní třídy nebo struktury.
de: Gibt an, dass ein Konvertierungsoperator (CType) eine Klasse oder Struktur in einen Typ konvertiert, der alle der möglichen Werte der ursprünglichen Klasse oder Struktur aufweisen kann.
es: Indica que un operador de conversión (CType) convierte una clase o estructura en un tipo que puede contener todos los valores posibles de la clase o estructura original.
fr: Indique qu'un opérateur de conversion (CType) convertit une classe ou une structure en un type qui peut contenir toutes les valeurs possibles de la classe ou structure d'origine.
it: Indica che un operatore di conversione (CType) converte una classe o una struttura in un tipo in grado di contenere tutti i possibili valori della classe o struttura originale.
ja: 変換演算子 (CType) が、クラスまたは構造体を、元のクラスまたは構造体のすべての使用可能な値を保持できる型に変換することを示します。
ko: 변환 연산자(CType)가 클래스 또는 구조체를 원래 클래스 또는 구조체에서 사용되던 모든 값을 보유할 수 있는 형식으로 변환함을 나타냅니다.
pl: Wskazuje, że operator konwersji (CType) konwertuje klasę lub strukturę do typu, który może posiadać wszystkie możliwe wartości oryginalnej klasy lub struktury.
pt_br: Indica que um operador de conversão (CType) converte uma classe ou estrutura para um tipo que pode conter todos os valores possíveis da estrutura ou classe original.
ru: Указывает, что оператор преобразования (CType) преобразует класс или структуру к типу, который может содержать все возможные значения исходного класса или структуры.
tr: Bir dönüştürme operatörünün (CType), bir sınıf ya da yapıyı özgün sınıf veya yapının tüm olası değerlerini tutabilecek bir türe dönüştürdüğünü gösterir.
zh_hans: 指示转换运算符(CType)将类或结构转换为可以保存原始类或结构的所有可能值的类型。
zh_hant: 表示轉換運算子 (CType) 會將類別或結構，轉換成可容納原始類別或結構之所有可能值的類型。

source: Specifies that one or more declared member variables refer to an instance of a class that can raise events
cs: Určuje, že nejmíň jedna deklarovaná členská proměnná odkazuje na instanci třídy, která může vyvolat události.
de: Gibt an, dass eine oder mehrere Membervariablen auf eine Instanz einer Klasse verweisen, die Ereignisse auslösen kann
es: Especifica que una o varias variables de miembro declaradas hacen referencia a una instancia de una clase que puede desencadenar eventos
fr: Spécifie qu'une ou plusieurs variables membres déclarées font référence à une instance d'une classe qui peut déclencher des événements
it: Specifica che una o più variabili di membro dichiarate fanno riferimento a un'istanza di una classe che può generare eventi
ja: 1 つ以上の宣言されたメンバー変数が、イベントを発生させる可能性のあるクラスのインスタンスを参照していることを示します
ko: 선언된 멤버 변수가 이벤트를 발생시킬 수 있는 클래스의 인스턴스를 참조하도록 지정합니다.
pl: Określa, że co najmniej jedna zadeklarowana zmienna składowej odnosi się do wystąpienia klasy, które może wywoływać zdarzenia
pt_br: Especifica que uma ou mais variáveis de membro declaradas referem-se a uma instância de uma classe que pode gerar eventos
ru: Указывает, что один или несколько объявленных переменных-членов относятся к экземпляру класса, который может создавать события.
tr: Bir ya da daha fazla bildirilmiş üye değişkeninin, olayları tetikleyebilen bir sınıf örneğine başvurduğunu belirtir
zh_hans: 指定一个或多个所声明的成员变量引用可引发事件的类的实例
zh_hant: 指定一或多個宣告的成員變數會參考可能引發事件的類別執行個體

source: Specifies that a property can be written to but not read.
cs: Určuje, že se do vlastnosti dá zapisovat, ale nedá se číst.
de: Gibt an, dass eine Eigenschaft geschrieben, jedoch nicht gelesen werden kann.
es: Especifica que se puede escribir en una propiedad, pero no se puede leer.
fr: Spécifie qu'une propriété peut être accessible en écriture mais pas en lecture.
it: Specifica che una proprietà è di sola scrittura e non può essere letta.
ja: プロパティに書き込みはできるが、読み込みはできないことを示します。
ko: 속성을 쓸 수 있지만 읽을 수 없도록 지정합니다.
pl: Określa, że właściwość może być dostępna do zapisu, ale nie do odczytu.
pt_br: Especifica que uma propriedade pode ser escrita mas não lida.
ru: Указывает, что свойство можно записать, но не читать.
tr: Bir özelliğin üzerine yazılabileceğini ancak okunamayacağını belirtir.
zh_hans: 指定只能写入但不能读取某一属性。
zh_hant: 指定可寫入但無法讀取的屬性。

source: Performs a logical exclusion on two Boolean expressions, or a bitwise exclusion on two numeric expressions. For Boolean expressions, returns True if exactly one of the expressions evaluates to True. Both expressions are always evaluated. <result> = <expression1> Xor <expression2>
cs: Vykoná logickou operaci nonekvivalence dvou logických výrazů nebo bitovou operaci nonekvivalence dvou číselných výrazů. Pro logické výrazy vrací True, pokud se přesně jeden z nich vyhodnotí jako True. Vždycky se vyhodnotí oba výrazy. <výsledek> = <výraz1> XOr <výraz2>
de: Führt einen logischen Ausschluss für zwei boolesche Ausdrücke oder einen bitweisen Ausschluss für zwei numerische Ausdrücke durch. Gibt bei booleschen Ausdrücken True zurück, wenn genau ein Operand als True ausgewertet wird. Beide Ausdrücke werden immer ausgewertet. <Ergebnis> = <Ausdruck1> Xor <Ausdruck2>
es: Realiza una exclusión lógica en dos expresiones Boolean o una exclusión bit a bit en dos expresiones numéricas. Para las expresiones Boolean, devuelve True si solo una de las expresiones se evalúa como True. Ambas expresiones siempre se evalúan. <resultado> = <expresión1> Xor <expresión2>
fr: Effectue une exclusion logique sur deux expressions Boolean ou une exclusion d'opérations de bits sur deux expressions numériques. Pour les expressions Boolean, retourne True si une seule des expressions a la valeur True. Les deux expressions sont toujours évaluées. <result> = <expression1> Xor <expression2>
it: Esegue un'esclusione logica su due espressioni booleane oppure un'esclusione bit per bit su due espressioni numeriche. Per le espressioni booleane, restituisce True se solo una delle espressioni viene valutata True. Entrambe le espressioni vengono sempre valutate. <risultato> = <espressione1> XOr <espressione2>
ja: 2 つのブール式の場合は排他的論理演算、2 つの数値式の場合はビットごとの排他を求めます。ブール式の場合、2 つの式のうち 1 つのみが True と評価されたときは True を返します。常に両方の式が評価されます。 <result> = <expression1> Xor <expression2>
ko: 두 Boolean 식의 배타적 논리합 연산을 수행하거나 두 숫자 식의 배타적 비트 연산을 수행합니다. Boolean 식의 경우 두 식 중 하나가 True이면 True를 반환합니다. 항상 두 식을 계산합니다. <result> = <expression1> Xor <expression2>
pl: Wykonuje logiczne wykluczenie na dwóch wyrażeniach logicznych lub bitowe wykluczenie na dwóch wyrażeniach liczbowych. Dla wyrażeń logicznych zwraca wartość True, jeśli dokładnie jedno z wyrażeń daje w wyniku wartość True. Oba wyrażenia są zawsze obliczane. <wynik> = <wyrażenie1> Xor <wyrażenie2>
pt_br: Executa uma exclusão lógica em duas expressões Booleanas ou uma exclusão bit a bit em duas expressões numéricas. Para expressões Booleanas, retorna Verdadeiro se exatamente uma das expressões for avaliada como Verdadeiro. As duas expressões são sempre avaliadas. <result> = <expression1> Xor <expression2>
ru: Выполняет логическое вычитание для двух логических выражений или побитовое вычитание двух числовых выражений. Возвращает значение True для логических выражений, если только одно из выражений имеет значение True. Всегда вычисляются оба выражения. <result> = <expression1> Xor <expression2>
tr: İki Boolean ifadede mantıksal dışlama ya da iki sayısal ifadede bit tabanlı dışlama gerçekleştirir. Boolean ifadeler için, eğer sadece bir ifade True değerlendiriliyorsa True değer döndürür. Her iki ifade de her zaman değerlendirilir. <result> = <expression1> Xor <expression2>
zh_hans: 对两个布尔表达式执行逻辑异或运算，或对两个数值表达式执行位异或运算。对于布尔表达式，当只有一个表达式的计算结果为 True 时才返回 True。始终对这两个表达式进行计算。 <result> = <expression1> Xor <expression2>
zh_hant: 在兩個布林運算式上執行邏輯排除，或在兩個數值運算式上執行位元排除。對於布林運算式而言，若剛好有一個運算元評估為 True，即傳回 True。兩個運算式都會進行評估。 <result> = <expression1> Xor <expression2>

source: Applies an aggregation function, such as Sum, Average, or Count to a sequence.
cs: Použije u sekvence agregační funkci, jako je Součet, Průměr nebo Počet.
de: Wendet eine Aggregatfunktion wie "Sum", "Average" oder "Count" auf eine Sequenz an.
es: Aplica una función de agregación, como Sum, Average o Count a una secuencia.
fr: Applique une fonction d'agrégation, par exemple Sum, Average ou Count, à une séquence.
it: Applica una funzione di aggregazione, ad esempio Sum, Average o Count, a una sequenza.
ja: Sum、Average、Count などの集計関数をシーケンスに適用します。
ko: Sum, Average, Count 등의 집계 함수를 시퀀스에 적용합니다.
pl: Stosuje funkcję agregacji, na przykład Sum, Average, lub Count do sekwencji.
pt_br: Aplica uma função de agregação, como Soma, Média ou Contagem a uma sequência.
ru: Применяет к последовательности агрегатную функцию, например Sum, Average или Count.
tr: Bir sıra için toplama işlevi uygular, örneğin; Sum, Average ya da Count.
zh_hans: 向序列应用聚合函数(如 Sum、Average 或 Count)。
zh_hant: 套用彙總函式 (如 Sum、Average 或 Count) 到序列。

source: Specifies the sort order for an Order By clause in a query. The smallest element will appear first.
cs: Určuje pořadí řazení pro klauzuli Order By v dotazu. Jako první se objeví nejmenší element.
de: Gibt die Sortierreihenfolge für eine Order By-Klausel in einer Abfrage an. Das kleinste Element wird zuerst aufgeführt.
es: Especifica el criterio de ordenación de una cláusula Order By en una consulta. Aparece primero el elemento más pequeño.
fr: Spécifie l'ordre de tri d'une clause Order By dans une requête. Le plus petit élément apparaît en premier.
it: Specifica l'ordinamento per una clausola Order By in una query. L'elemento più piccolo verrà visualizzato per primo.
ja: クエリの Order By 句の並べ替え順序を指定します。最小の要素が最初に表示されます。
ko: 쿼리의 Order By 절에 사용할 정렬 순서를 지정합니다. 가장 작은 요소가 가장 먼저 표시됩니다.
pl: Określa porządek sortowania dla klauzuli Order By w zapytaniu. Najmniejszy element będzie wyświetlany jako pierwszy.
pt_br: Especifica a ordem de classificação para uma cláusula Classificar Por em uma consulta. O menor elemento aparecerá primeiro.
ru: Определяет порядок сортировки для предложения Order By в запросе. Первым будет указан наименьший элемент.
tr: Bir sorgu içinde Order By yan tümcesi için sıralama düzeni belirtir. En küçük öğe ilk görünür.
zh_hans: 指定查询中 Order By 子句的排序顺序。最小的元素将首先出现。
zh_hant: 指定查詢中 Order By 子句的排序順序。最小的元素最先出現。

source: Asynchronously waits for the task to finish.
cs: Asynchronně čeká na dokončení úlohy.
de: Wartet asynchron darauf, dass die Aufgabe fertig ist.
es: Espera de forma asincrónica a que termine la tarea.
fr: Attend de façon asynchrone que la tâche soit terminée.
it: Attende in modalità asincrona il completamento dell'attività.
ja: タスクの完了を非同期に待機します。
ko: 작업이 완료될 때까지 비동기적으로 기다립니다.
pl: Asynchronicznie oczekuje na zakończenie zadania.
pt_br: Assincronamente aguarda a conclusão da tarefa.
ru: Асинхронно ожидает окончания задачи.
tr: Zaman uyumsuz olarak görevin tamamlanmasını bekler.
zh_hans: 异步等待任务完成。
zh_hant: 以非同步方式等候工作完成。
