Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Specifies a condition for Skip and Take operations. Elements will be bypassed or included as long as the condition is true.
cs: Určuje podmínku pro operace Skip a Take. Prvky se bude vynechávat nebo zahrnovat, dokud bude podmínka pravdivá.
de: Gibt eine Bedingung für die Skip-Operation und die Take-Operation an. Elemente werden umgangen oder eingeschlossen, solange die Bedingung erfüllt wird.
es: Especifica una condición para las operaciones Skip y Take. Los elementos se omitirán o incluirán siempre que la condición sea true.
fr: Spécifie une condition pour les opérations Skip et Take. Les éléments sont ignorés ou inclus tant que la condition a la valeur True.
it: Specifica una condizione per le operazioni Skip e Take. Gli elementi verranno ignorati o inclusi purché la condizione è True.
ja: Skip および Take 操作の条件を指定します。条件が true である限り、要素はバイパスされるか含まれます。
ko: Skip 및 Take 작업에 사용할 조건을 지정합니다. 조건이 True인 동안 요소를 건너뛰거나 포함합니다.
pl: Określa warunek dla operacji Skip i Take. Elementy będą pominięte lub uwzględnione tak długo, jak długo będzie spełniony warunek.
pt_br: Especifica uma condição para operações Skip e Take. Elementos serão desviados ou incluídos desde que a condição seja verdadeira.
ru: Задает условие для операций Skip и Take. Элементы будут пропущены или не включены, если условие является истинным.
tr: Skip ve Take işlemleri için koşul belirtir. Koşul true olduğu sürece öğeler atlanır ya da dahil edilir.
zh_hans: 为 Skip 和 Take 运算指定条件。只要条件为 true，就将跳过或包含相关元素。
zh_hant: 指定 Skip 和 Take 作業的條件。只要條件為 True，就會略過或包含這些項目。

source: Specifies the declaration of property initializations in an object initializer. New <typeName> With {[.<property> = <expression>][,...]}
cs: Určuje deklaraci inicializací vlastností v inicializátoru objektu. New <typeName> With {[.<property> = <expression>][,...]}
de: Gibt die Deklaration von Eigenschafteninitialisierungen in einem Objektinitialisierer an. New <typeName> With {[.<property> = <expression>][,...]}
es: Especifica la declaración de inicialización de propiedades en un inicializador de objetos. New <typeName> With {[.<property> = <expression>][,...]}
fr: Spécifie la déclaration des initialisations de propriétés dans un initialiseur d'objet. New <typeName> With {[.<property> = <expression>][,...]}
it: Specifica la dichiarazione delle inizializzazioni delle proprietà in un inizializzatore di oggetto. New <typeName> With {[.<property> = <expression>][,...]}
ja: オブジェクト初期化子のプロパティ初期化の宣言を指定します。 New <typeName> With {[.<property> = <expression>][,...]}
ko: 속성 초기화 선언을 개체 이니셜라이저에 지정합니다. New <typeName> With {[.<property> = <expression>][,...]}
pl: Określa deklarację inicjowania właściwości w inicjatorze obiektów. New <typeName> With {[.<property> = <expression>][,...]}
pt_br: Especifica a declaração de inicializações de propriedade em um inicializador de objeto. Novo <typeName> Com {[.<property> = <expression>][,...]}
ru: Указывает объявление инициализации свойства для инициализатора объекта. Новое <typeName> с {[.<property> = <expression>][,...]}
tr: Bir nesne başlatıcısında, özellik başlatmalarının bildirimini belirtir. New <typeName> With {[.<property> = <expression>][,...]}
zh_hans: 指定对象初始值设定项中属性初始化的声明。 New <typeName> With {[.<property> = <expression>][,...]}
zh_hant: 指定物件初始設定式中屬性初始設定的宣告。 New <typeName> With {[.<property> = <expression>][,...]}

source: Runs a series of statements that refer to a single object or structure. With <object>...End With
cs: Spustí řadu příkazů, které odkazují na jeden objekt nebo strukturu. With <object>...End With
de: Gibt eine Reihe von Anweisungen zurück, die auf ein Objekt oder eine Struktur verweisen. With <object>...End With
es: Ejecuta una serie de instrucciones que hacen referencia a un único objeto o estructura. With <object>...End With
fr: Exécute une série d'instructions qui font référence à un objet ou une structure unique. With <object>...End With
it: Esegue una serie di istruzioni che fanno riferimento a un singolo oggetto o struttura. With <object>...End With
ja: 1 つのオブジェクトまたは構造体を参照する一連のステートメントを実行します。 With <object>...End With
ko: 단일 개체 또는 구조체를 참조하는 일련의 문을 실행합니다. With <object>...End With
pl: Uruchamia serię instrukcji odwołujących się do pojedynczego obiektu lub struktury. With <object>...End With
pt_br: Executa uma série de instruções que fazem referência a um único objeto ou estrutura. Com <object>...Terminar Com
ru: Выполняет ряд операторов, которые относятся к одному объекту или структуре. With <object>...End With
tr: Tek bir nesne ya da yapıya başvuran bir deyimler serisini çalıştırır. With <object>...End With
zh_hans: 运行引用单个对象或结构的一系列语句。 With <object>...End With
zh_hant: 執行一系列參考單一物件或結構的陳述式。 With <object>...End With

source: Produces an element of an IEnumerable or IEnumerator.
cs: Vytvoří element rozhraní IEnumerable nebo IEnumerator.
de: Produziert ein Element eines IEnumerable oder IEnumerator.
es: Produce un elemento de IEnumerable o IEnumerator.
fr: Produit un élément d'un IEnumerable ou IEnumerator.
it: Produce un elemento di un oggetto IEnumerable o IEnumerator.
ja: IEnumerable または IEnumerator の要素を生成します。
ko: IEnumerable 또는 IEnumerator의 요소를 생성합니다.
pl: Tworzy element interfejsu IEnumerable lub IEnumerator.
pt_br: Produz um elemento de um IEnumerable ou IEnumerator.
ru: Создает элемент IEnumerable или IEnumerator.
tr: IEnumerable veya IEnumerator öğesi üretir.
zh_hans: 生成 IEnumerable 或 IEnumerator 的一个元素。
zh_hant: 產生 IEnumerable 或 IEnumerator 的元素。

source: Defines an asynchronous lambda expression that can use the Await operator. Can be used wherever a delegate type is expected. Async Sub/Function(<parameterList>) <expression>
cs: Definuje asynchronní lambda výraz, který může používat operátor Await. Může se použít pokaždé, kdy se očekává typ delegáta. Async Sub/Function(<seznam_parametrů>) <výraz>
de: Gibt einen asynchronen Lambdaausdruck an, der den Await-Operator verwenden kann. Kann immer verwendet werden, wenn ein Delegattyp erwartet wird. Async-Unter-/Funktion(<Parameterliste>) <Ausdruck>
es: Define una expresión lambda asincrónica que puede usar el operador Await. Se puede usar siempre que se espere un tipo delegado. Sub/función asincrónica(<listaDeParámetros>) <expresión>
fr: Définit une expression lambda asynchrone pouvant utiliser l'opérateur Await. S'utilise lorsqu'un type délégué est attendu. Async Sub/Function(<parameterList>) <expression>
it: Definisce un'espressione lambda asincrona che può usare l'operatore Await. Può essere usato ovunque sia previsto un tipo delegato. Funzione/Sub Async(<elencoParametri>) <espressione>
ja: Await 演算子を使用できる非同期ラムダ式を定義します。デリゲート型が想定される場所であれば使用できます。 Async Sub/Function(<parameterList>) <expression>
ko: Await 연산자를 사용할 수 있는 비동기 람다 식을 정의합니다. 대리자 형식이 필요할 때마다 사용할 수 있습니다. Async Sub/Function(<parameterList>) <expression>
pl: Określa asynchroniczne wyrażenie lambda, w którym można używać operatora Await. Może zostać użyte wszędzie, gdzie jest oczekiwany typ obiektu delegowanego. Async Sub/Function(<listaParametrów>) <wyrażenie>
pt_br: Define uma expressão lambda assíncrona que pode usar o operador Await. Pode ser usada sempre que um tipo delegado for esperado. Async Sub/Function (<parameterList>) <expression>
ru: Определяет асинхронное лямбда-выражение, которое может использовать оператор Await. Может использоваться везде, где ожидается тип делегата. Async Sub/Function(<parameterList>) <expression>
tr: Await operatörünü kullanabilen zaman uyumsuz lambda ifadesini tanımlar. Bir temsilci türü beklenen her yerde kullanılabilir. Async Sub/Function(<parameterList>) <expression>
zh_hans: 定义可使用 Await 运算符的异步 lambda 表达式。可用于需要委托类型的任何情况。 Async Sub/Function(<parameterList>) <expression>
zh_hant: 定義可以使用 Await 運算子的非同步 Lambda 運算式。可用於必須是委派類型時。 Async Sub/Function(<parameterList>) <expression>

source: Defines a lambda expression that calculates and returns a single value. Can be used wherever a delegate type is expected. Function(<parameterList>) <expression>
cs: Definuje lambda výraz, který vypočítává a vrací jednu hodnotu. Dá se použít, kdykoli se očekává typ delegáta. Function(<seznam_parametrů>) <výraz>
de: Definiert einen Lambdaausdruck, der einen einzelnen Wert berechnet und zurückgibt. Kann immer verwendet werden, wenn ein Delegattyp erwartet wird. Function(<Parameterlist>) <Ausdruck>
es: Define una expresión lambda que calcula y devuelve un único valor. Se puede utilizar donde se espere un tipo delegado. Function(<listaDeParámetros>) <expresión>
fr: Définit une expression lambda qui calcule et retourne une valeur unique. S'utilise lorsqu'un type délégué est attendu. Function(<parameterList>) <expression>
it: Definisce un'espressione lambda che calcola e restituisce un valore singolo. Può essere usata ovunque è previsto un tipo delegato. Function(<elencoParametri>) <espressione>
ja: 計算を行い、1 つの値を返すラムダ式を定義します。デリゲート型が想定される場所であれば使用できます。 Function(<parameterList>) <expression>
ko: 단일 값을 계산하고 반환하는 람다 식을 정의합니다. 대리자 형식이 필요한 곳마다 사용할 수 있습니다. Function(<parameterList>) <expression>
pl: Definiuje wyrażenie lambda, które wylicza i zwraca pojedynczą wartość. Może być używane tam, gdzie oczekiwany jest typ delegowany. Function(<listaParametrów>) <wyrażenie>
pt_br: Define uma expressão lambda que calcula e retorna um único valor. Pode ser usada sempre que um tipo delegado é esperado. Função(<parameterList>) <expressão>
ru: Определяет лямбда-выражение, которое вычисляет и возвращает одно значение. Может использоваться везде, где ожидается тип делегата. Function(<parameterList>) <expression>
tr: Tek bir değer hesaplayan ve döndüren bir lambda ifadesi tanımlar. Bir temsilci türünün beklendiği her yerde kullanılabilir. Function(<parameterList>) <expression>
zh_hans: 定义用于计算并返回单个值的 lambda 表达式。可用于需要委托类型的任何情况。 Function(<parameterList>) <expression>
zh_hant: 定義計算並傳回單一值的 Lambda 運算式。可用於必須是委派類型時。 Function(<parameterList>) <expression>

source: Defines a lambda expression that can execute statements and does not return a value. Can be used wherever a delegate type is expected. Sub(<parameterList>) <statement>
cs: Definuje výraz lambda, který může provádět příkazy a nevrací hodnotu. Dá se použít, kdykoli se očekává typ delegáta. Sub(<seznam_parametrů>) <výraz>
de: Definiert einen Lambdaausdruck, der Anweisungen ausführen kann und keinen Wert zurückgibt. Kann immer verwendet werden, wenn ein Delegattyp erwartet wird. Sub(<Parameterliste>) <Ausdruck>
es: Define una expresión lambda que puede ejecutar instrucciones y no devuelve un valor. Se puede usar dondequiera que se espere un tipo de delegado. Sub(<listaDeParámetros>) <instrucción>
fr: Définit une expression lambda qui exécute des instructions, mais qui ne retourne aucune valeur. S'utilise lorsqu'un type délégué est attendu. Sub(<parameterList>) <statement>
it: Definisce un'espressione lambda che può eseguire istruzioni e non restituisce un valore. Può essere usata ovunque è previsto un tipo delegato. Sub(<elencoParametri>) <istruzione>
ja: ステートメントを実行でき、値を返さないラムダ式を定義します。デリゲート型が想定される場所であれば使用できます。 Sub(<parameterList>) <statement>
ko: 문을 실행할 수 있고 값을 반환하지 않는 람다 식을 정의합니다. 대리자 형식이 필요한 곳마다 사용할 수 있습니다. Sub(<parameterList>) <statement>
pl: Definiuje wyrażenie lambda, które może wykonać instrukcję i nie zwraca wartości. Można go używać tam, gdzie oczekiwany jest typ delegatu. Sub(<listaParametrów>) <instrukcja>
pt_br: Define uma expressão lambda que pode executar instruções e não retorna um valor. Pode ser usada sempre que um tipo delegado é esperado. Sub(<parameterList>) <statement>
ru: Определяет лямбда-выражение, которое может выполнить операторы и не возвращает значение. Может использоваться везде, где ожидается тип делегата. Sub(<parameterList>) <statement>
tr: Deyimleri yürütebilen ve değer döndürmeyen bir lambda ifadesini tanımlar. Bir temsilci türünün beklendiği her yerde kullanılabilir. Sub(<parameterList>) <statement>
zh_hans: 定义用于执行语句且不返回值的 lambda 表达式。可用于需要委托类型的任何情况。 Sub(<parameterList>) <statement>
zh_hant: 定義可執行陳述式但不傳回值的 Lambda 運算式。可用於必須是委派類型時。 Sub(<parameterList>) <statement>

source: Disables reporting of specified warnings in the portion of the source file below the current line.
cs: Zakáže hlášení určených upozornění v části zdrojového souboru pod aktuálním řádkem.
de: Deaktiviert die Berichterstattung angegebener Warnungen im Teil der Quelldatei unter der aktuellen Zeile.
es: Deshabilita la creación de informes de advertencias concretas en la parte del archivo de código fuente situada debajo de la línea actual.
fr: Désactive la création de rapports des avertissements spécifiés dans la partie du fichier source en dessous de la ligne active.
it: Disabilita la segnalazione di avvisi specificati nella parte del file di origine sotto la riga corrente.
ja: 現在の行以降のソース ファイルの部分で指定された警告のレポートを無効にします。
ko: 현재 줄 아래의 소스 파일 부분에서 지정한 경고를 보고하지 않습니다.
pl: Wyłącza raportowanie określonych ostrzeżeń we fragmencie pliku źródłowego poniżej bieżącego wiersza.
pt_br: Desabilita a emissão de relatórios de avisos especificados na parte do arquivo de origem abaixo da linha atual.
ru: Выключает отчетность для указанных предупреждений в части исходного файла ниже текущей строки.
tr: Geçerli satır altındaki kaynak dosyasının bir bölümünde belirtilen uyarıların raporlamasını devre dışı bırakır.
zh_hans: 在当前行下方的源文件部分中禁用指定警告的报告。
zh_hant: 停用目前這一行下方原始程式檔部分中，指定之警告的回報功能。

source: Enables reporting of specified warnings in the portion of the source file below the current line.
cs: Povolí hlášení určených upozornění v části zdrojového souboru pod aktuálním řádkem.
de: Aktiviert die Berichterstattung angegebener Warnungen im Teil der Quelldatei unter der aktuellen Zeile.
es: Habilita la creación de informes de advertencias concretas en la parte del archivo de código fuente situada debajo de la línea actual.
fr: Active la création de rapports des avertissements spécifiés dans la partie du fichier source en dessous de la ligne active.
it: Abilita la segnalazione di avvisi specificati nella parte del file di origine sotto la riga corrente.
ja: 現在の行以降のソース ファイルの部分で指定された警告のレポートを有効にします。
ko: 현재 줄 아래의 소스 파일 부분에서 지정한 경고를 보고합니다.
pl: Włącza raportowanie określonych ostrzeżeń we fragmencie pliku źródłowego poniżej bieżącego wiersza.
pt_br: Habilita a emissão de relatórios de avisos especificados na parte do arquivo de origem abaixo da linha atual.
ru: Включает отчетность для указанных предупреждений в части исходного файла ниже текущей строки.
tr: Geçerli satır altındaki kaynak dosyasının bir bölümünde belirtilen uyarıların raporlamasını etkinleştirir.
zh_hans: 在当前行下方的源文件部分中启用指定警告的报告。
zh_hant: 啟用目前這一行下方原始程式檔部分中，指定之警告的回報功能。

source: Insert 'Await'.
cs: Vlož "Await".
de: "Await" einfügen
es: Inserte "Await".
fr: Insérez 'Await'.
it: Inserire 'Await'.
ja: Await' を挿入します。
ko: Await'를 삽입합니다.
pl: Wstaw element „Await”.
pt_br: Inserir 'Aguardar'.
ru: Вставить "Await".
tr: Await' ekleyin.
zh_hans: 插入“Await”。
zh_hant: 插入 'Await'。

source: Make {0} an Async Function.
cs: Převeď {0} na asynchronní funkci Async.
de: "{0}" in eine Async-Funktion umwandeln.
es: Convertir {0} en una función Async.
fr: Faire de {0} une fonction Async.
it: Trasformare {0} in una funzione asincrona.
ja: {0} を Async Function にします。
ko: {0}을(를) 비동기 함수로 설정합니다.
pl: Ustaw funkcję {0} jako funkcję asynchroniczną.
pt_br: Tornar {0} uma Função Assíncrona.
ru: Сделать {0} асинхронной функцией.
tr: {0} öğesini bir Zaman Uyumsuz İşlev yap.
zh_hans: 使 {0} 为异步函数。
zh_hant: 讓 {0} 成為非同步函式。

source: Insert Missing Cast
cs: Vložit chybějící přetypování
de: Fehlende Umwandlung einfügen
es: Insertar conversión que falta
it: Inserisci cast mancante
ja: 不足しているキャストを挿入
ko: 누락된 캐스트 삽입
pl: Wstaw brakujące rzutowanie
pt_br: Inserir Coversão ausente
tr: Eksik İşlem Ekle
zh_hans: 插入丢失的转换
zh_hant: 插入遺漏的 Cast

source: Convert {0} to Iterator
cs: Převést {0} na iterátor
de: {0} in Iterator konvertieren
es: Convertir {0} en Iterador
fr: Convertir {0} en itérateur
it: Converti {0} in iteratore
ja: {0} を反復子に変換
ko: 반복기로 {0} 변환
pl: Konwertuj element {0} na iterator
pt_br: Converter {0} para Iterador
ru: Преобразовать {0} в итератор
tr: {0} öğesini Yineleyici'ye dönüştür
zh_hans: 将{0}转换为迭代器
zh_hant: 將 {0} 轉換為 Iterator

source: Replace 'Return' with 'Yield
cs: Nahradit příkaz Return příkazem Yield
de: "Return" durch "Yield" ersetzen
es: Reemplazar "Return" por "Yield
fr: Remplacer 'Return' par 'Yield
it: Sostituisci 'Return' con 'Yield'
ja: Return' を 'Yield' に置き換える
ko: Return'을 'Yield'로 바꾸기
pl: Zamień instrukcję „Return” na instrukcję „Yield”
pt_br: Substituir "Return" por "Yield"
ru: Замените "Return" на "Yield
tr: Return' değerini 'Yield' ile değiştir
zh_hans: 将 "Return" 替换为 "Yield
zh_hant: 以 'Yield' 取代 'Return'

source: Use the correct control variable
cs: Použít správnou řídicí proměnnou
de: Richtige Steuervariable verwenden
es: Utilizar la variable de control correcta
fr: Utiliser la variable de contrôle correcte
it: Usa la variabile di controllo corretta
ja: 正しい制御変数を使用する
ko: 올바른 제어 변수 사용
pl: Użyj poprawnej zmiennej sterującej
pt_br: Usar a variável de controle correta
ru: Используйте правильную переменную элемента управления
tr: Doğru denetim değişkenini kullanın
zh_hans: 使用正确的控制变量
zh_hant: 使用正確的控制變數

source: NameOf function
cs: Funkce NameOf
de: NameOf-Funktion
es: Función NameOf
fr: Fonction NameOf
it: Funzione NameOf
ja: NameOf 関数
ko: 함수 이름
pl: Funkcja NameOf
pt_br: Função NameOf
ru: Имя функции
tr: İşlev adı
zh_hans: NameOf 函数
zh_hant: NameOf 函式

source: Generate narrowing conversion in '{0}'
cs: Generovat zužující převod v {0}
de: Einschränkende Konvertierung in "{0}" generieren
es: Generar conversión de restricción en "{0}"
fr: Générer une conversion restrictive dans '{0}'
it: Genera la conversione verso un tipo di dati più piccolo in '{0}'
ja: {0}' で縮小変換を生成する
ko: {0}'에서 축소 변환 생성
pl: Generuj konwersję zawężającą w elemencie „{0}”
pt_br: Gerar conversão de restrição no '{0}'
ru: Создайте сужающее преобразование в "{0}"
tr: '{0}' öğesinde daraltma dönüştürmesi oluştur
zh_hans: 在“{0}”中生成收缩转换
zh_hant: 在 '{0}' 中產生縮小轉換

source: Generate widening conversion in '{0}'
cs: Generovat rozšiřující konverzi v {0}
de: Erweiternde Konvertierung in "{0}" generieren
es: Generar conversión de ampliación en "{0}"
fr: Générer une conversation étendue dans '{0}'
it: Genera la conversione verso un tipo di dati più grande in '{0}'
ja: {0}' で拡大変換を生成する
ko: {0}'에서 확대 변환 생성
pl: Generuj konwersję rozszerzającą w elemencie „{0}”
pt_br: Gerar conversão de expansão no '{0}'
ru: Создайте расширяющееся преобразование в "{0}"
tr: {0}' öğesinde genişletme dönüşümü oluştur
zh_hans: 在“{0}”中生成扩大转换
zh_hant: 在 '{0}' 中產生擴展轉換

source: Do not change this code. Put cleanup code in Dispose(disposing As Boolean) above.
de: Ändern Sie diesen Code nicht. Fügen Sie Bereinigungscode in Dispose(disposing As Boolean) weiter oben ein.
es: No cambie este código. Coloque el código de limpieza en el anterior Dispose(disposing As Boolean).
it: Non modificare questo codice. Inserire sopra il codice di pulizia in Dispose(disposing As Boolean).
ja: このコードを変更しないでください。クリーンアップ コードを上の Dispose(disposing As Boolean) に記述します。
ko: 이 코드를 변경하지 마세요. 위의 Dispose(disposing As Boolean)에 정리 코드를 입력하세요.
pt_br: Não altere este código. Coloque o código de limpeza em Dispose(disposing As Boolean) acima.
tr: Bu kodu değiştirmeyin. Temizleme kodunu yukarıdaki Dispose(disposing As Boolean) ifadesine yerleştirin.
zh_hant: 請勿變更這個程式碼。請將清除程式碼放在上方的 Dispose(disposing As Boolean) 中。

source: TODO: free unmanaged resources (unmanaged objects) and override Finalize() below.
de: TODO: nicht verwaltete Ressourcen (nicht verwaltete Objekte) freigeben und Finalize() weiter unten überschreiben.
es: TODO: libere los recursos no administrados (objetos no administrados) y reemplace Finalize() a continuación.
it: TODO: liberare risorse non gestite (oggetti non gestiti) ed eseguire sotto l'override di Finalize().
ja: TODO: アンマネージ リソース (アンマネージ オブジェクト) を解放し、下の Finalize() をオーバーライドします。
ko: TODO: 관리되지 않는 리소스(관리되지 않는 개체)를 해제하고 아래의 Finalize()를 재정의합니다.
pt_br: TODO: liberar recursos não gerenciados (objetos não gerenciados) e substituir um Finalize() abaixo.
tr: TODO: yönetilmeyen kaynakları (yönetilmeyen nesneleri) serbest bırakın ve aşağıda Finalize() ifadesini geçersiz kılın.
zh_hant: TODO: 釋放 Unmanaged 資源 (Unmanaged 物件) 並覆寫下方的 Finalize()。

source: TODO: override Finalize() only if Dispose(disposing As Boolean) above has code to free unmanaged resources.
de: TODO: Finalize() nur überschreiben, wenn Dispose(disposing As Boolean) weiter oben Code zur Bereinigung nicht verwalteter Ressourcen enthält.
es: TODO: reemplace Finalize() solo si el anterior Dispose(disposing As Boolean) tiene código para liberar recursos no administrados.
it: TODO: eseguire l'override di Finalize() solo se Dispose(disposing As Boolean) include il codice per liberare risorse non gestite.
ja: TODO: 上の Dispose(disposing As Boolean) にアンマネージド リソースを解放するコードが含まれる場合にのみ Finalize() をオーバーライドします。
ko: TODO: 위의 Dispose(disposing As Boolean)에 관리되지 않는 리소스를 해제하기 위한 코드가 있는 경우에만 Finalize()를 재정의합니다.
pt_br: TODO: substituir Finalize() somente se Dispose(disposing As Boolean) acima tiver o código para liberar recursos não gerenciados.
tr: TODO: Finalize() ifadesini yalnızca yukarıdaki Dispose(disposing As Boolean) yönetilmeyen kaynakları serbest bırakacak koda sahipse geçersiz kılın.
zh_hant: TODO: 只有當上方的 Dispose(disposing As Boolean) 具有要釋放 Unmanaged 資源的程式碼時，才覆寫 Finalize()。

source: This code added by Visual Basic to correctly implement the disposable pattern.
de: Dieser Code wird von Visual Basic hinzugefügt, um das Dispose-Muster richtig zu implementieren.
es: Visual Basic agrega este código para implementar correctamente el patrón descartable.
it: Questo codice viene aggiunto da Visual Basic per implementare in modo corretto il criterio Disposable.
ja: このコードは、破棄可能なパターンを正しく実装できるように Visual Basic によって追加されました。
ko: 삭제 가능한 패턴을 올바르게 구현하기 위해 Visual Basic에서 추가한 코드입니다.
pt_br: Código adicionado pelo Visual Basic para implementar corretamente o padrão descartável.
tr: Tek kullanımlık deseni doğru uygulamak için bu kod Visual Basic tarafından eklendi.
zh_hant: Visual Basic 加入這個程式碼的目的，在於能正確地實作可處置的模式。

# TODO_colon_uncomment_the_following_line_if_Finalize_is_overridden_above
source: TODO: uncomment the following line if Finalize() is overridden above.
de: TODO: Auskommentierung der folgenden Zeile aufheben, wenn Finalize() oben überschrieben wird.
es: TODO: quite la marca de comentario de la siguiente línea si Finalize() se ha reemplazado antes.
it: TODO: rimuovere il commento dalla riga seguente se è stato eseguito l'override di Finalize().
ja: TODO: 上の Finalize() がオーバーライドされている場合は、次の行のコメントを解除してください。
ko: TODO: 위의 Finalize()가 재정의된 경우 다음 줄의 주석 처리를 제거합니다.
pt_br: TODO: remover marca de comentário da linha a seguir se Finalize() for substituído acima.
tr: TODO: Finalize() yukarıda geçersiz kılınırsa aşağıdaki satırın açıklamasını kaldırın.
zh_hant: TODO: 覆寫上列 Finalize() 時，取消下行的註解狀態。

source: Imports statement is unnecessary.
de: Imports-Anweisung ist unnötig.
es: La declaración de importaciones no es necesaria.
it: L'istruzione Imports non è necessaria.
ja: Imports ステートメントは不要です。
ko: Imports 문은 필요하지 않습니다.
pt_br: A instrução Imports é desnecessária.
tr: Imports deyimi gerekli değildir.
zh_hant: 無須 Imports 陳述式。

source: Try block
cs: Blok Try
es: Bloque Try
fr: Bloc Try
it: blocco Try
ja: Try ブロック
ko: Try 블록
pl: Blok Try
pt_br: Bloco Try
ru: Блок Try
tr: Try bloğu
zh_hans: Try 块
zh_hant: Try 區塊

source: Catch clause
cs: Klauzule Catch
de: Catch-Klausel
es: Cláusula Catch
fr: Clause Catch
it: clausola Catch
ja: Catch 句
ko: Catch 절
pl: Klauzula Catch
pt_br: Cláusula Catch
ru: Предложение Catch
tr: Catch yan tümcesi
zh_hans: Catch 子句
zh_hant: Catch 子句

source: Finally clause
cs: Klauzule Finally
de: Finally-Klausel
es: Cláusula Finally
fr: Clause Finally
it: clausola Finally
ja: Finally 句
ko: Finally 절
pl: Klauzula Finally
pt_br: Cláusula Finally
ru: Предложение Finally
tr: Finally yan tümcesi
zh_hans: Finally 子句
zh_hant: Finally 子句
