Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: can't determine valid range of statements to extract out
cs: nemůže určit platný rozsah příkazů k extrakci ven
de: gültiger Bereich der zu extrahierenden Anweisungen kann nicht bestimmt werden
es: no se puede determinar el intervalo válido de instrucciones para extraer
fr: impossible de déterminer la plage valide d'instructions à extraire
it: non è possibile determinare l'intervallo valido di istruzioni da estrarre
ja: 抽出するステートメントの有効な範囲を決定できません
ko: 추출할 문에 유효한 범위를 결정할 수 없습니다.
pl: nie można określić prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: não pode determinar o intervalo válido de instruções para extrair
ru: Невозможно определить допустимый диапазон операторов для извлечения.
tr: Dışarıya ayıklanacak deyimlerin geçerli aralığı belirlenemiyor
zh_hans: 无法确定要提取的语句的有效范围
zh_hant: 無法決定要擷取的有效陳述式範圍

source: Not all code paths return
cs: Ne všechny cesty kódu vracejí
de: Nicht alle Codepfadrückgaben
es: No todas las rutas de acceso de código vuelven
fr: Tous les chemins du code n'ont pas été retournés
it: Non vengono restituiti tutti i percorsi del codice
ja: 返されないコード パスがあります
ko: 일부 코드 경로가 반환됩니다.
pl: Nie wszystkie ścieżki w kodzie zwracają wartość
pt_br: Nem todos os caminhos de código são retornados
ru: Не все пути к коду возвращают значения
tr: Kod yollarından bazıları dönmüyor
zh_hans: 未返回所有代码路径
zh_hant: 未傳回所有程式碼路徑

source: contains invalid selection
cs: obsahuje neplatný výběr
de: enthält ungültige Auswahl
es: contiene una selección no válida
fr: contient une sélection non valide
it: contiene una selezione non valida
ja: 無効な選択が含まれています
ko: 선택 영역이 잘못되었습니다.
pl: zawiera nieprawidłowe zaznaczenie
pt_br: contém seleção inválida
ru: содержит недопустимый выделенный фрагмент
tr: Geçersiz seçim içeriyor
zh_hans: 包含无效的选择
zh_hant: 包含無效的選取範圍

source: the selection contains syntactic errors
cs: výběr obsahuje syntaktické chyby
de: die Auswahl enthält Syntaxfehler
es: la selección contiene errores sintácticos
fr: la sélection contient des erreurs syntaxiques
it: la selezione contiene errori di sintassi
ja: 選択範囲に構文エラーが含まれています
ko: 선택 영역에 구문 오류가 포함되어 있습니다.
pl: zaznaczenie zawiera błędy składni
pt_br: a seleção contém erros sintáticos
ru: в выделенном фрагменте есть синтаксические ошибки
tr: Seçim söz dizimsel hatalar içeriyor
zh_hans: 所选内容包含语法错误
zh_hant: 選取範圍包含語法錯誤

source: Selection can't be crossed over preprocessors
cs: Výběr nejde křížit přes preprocesory.
de: Auswahl kann nicht mit Vorprozessoren überkreuzt werden
es: Selection no puede ser cruzada por preprocesadores
fr: La sélection ne peut pas traverser plusieurs préprocesseurs
it: La selezione non può intersecare i preprocessori
ja: 選択範囲はプリプロセッサと交差することはできません
ko: 선택 영역은 전처리기를 벗어날 수 없습니다.
pl: Zaznaczenie nie może zawierać preprocesorów
pt_br: A seleção não pode ser cruzada em pré-processadores
ru: Выделенные фрагменты нельзя использовать на уровне директив препроцессоров
tr: Seçim, ön işlemciler üzerinden geçirilemez
zh_hans: 选择不能跨预处理器
zh_hant: 選取範圍不可跨多部前置處理器

source: Selection can't contain throw without enclosing catch block
cs: Výběr nemůže obsahovat throw bez koncového bloku catch.
de: Auswahl kann keinen Wurf ohne einschließenden Erfassungsblock enthalten
es: Selection no puede contener Throw sin incluir un bloque Catch
fr: La sélection ne peut pas contenir throw sans englober le bloc catch
it: La selezione non può contenere throw senza il blocco catch di inclusione
ja: 選択範囲に外側の catch ブロックのない throw を含めることはできません
ko: 선택 영역은 바깥쪽 catch 블록 없이 throw를 포함할 수 없습니다.
pl: Zaznaczenie nie może zawierać wyrażenia Throw bez obejmującego bloku Catch
pt_br: A seleção não pode conter posição sem embutir o bloco catch
ru: Выделенный фрагмент не может содержать выражение throw без вложенного блока catch
tr: Seçim, kapsayan catch bloğu olmadan oluşum içeremez
zh_hans: 所选内容不能包含没有封闭 catch 块的 throw
zh_hant: 選取範圍不可包含未納入 catch 區塊的 Throw

source: Selection can't be parts of constant initializer expression
cs: Výběr nemůže být součástí konstantního výrazu inicializátoru.
de: Auswahl kann nicht Teil von konstantem Initialisierungsausdruck sein
es: Selection no puede ser partes de una expresión constante del inicializador
fr: La sélection ne peut pas faire partie d'une expression d'initialiseur de constante
it: La selezione non può essere composta da parti dell'espressione costante dell'inizializzatore
ja: 選択範囲は定数の初期化子式の一部にすることはできません
ko: 선택 영역은 상수 이니셜라이저 식의 일부일 수 없습니다.
pl: Zaznaczenie nie może być częścią wyrażenia inicjalizatora stałej
pt_br: A seleção não pode ter partes de expressão de incializador de constantes
ru: Выделенные фрагменты не могут быть частями выражения константного инициализатора
tr: Seçim, sabit başlatıcı ifadesinin parçası olamaz
zh_hans: 所选内容不能是常量初始值设定项表达式的一部分
zh_hant: 選取範圍不可為常數初始設定式運算式的任何部分

source: Argument used for ByRef parameter can't be extracted out
cs: Argument použitý pro parametr ByRef se nedá extrahovat.
de: Für ByRef-Parameter verwendetes Argument kann nicht extrahiert werden
es: Argumento usado por el parámetro ByRef; no se puede extraer
fr: Impossible d'extraire l'argument utilisé pour le paramètre ByRef
it: Non è possibile estrarre l'argomento usato per il parametro ByRef
ja: ByRef パラメーターに対して使用される引数は抽出できません
ko: ByRef 매개 변수에 사용되는 인수는 추출할 수 없습니다.
pl: Nie można wyodrębnić argumentu użytego dla parametru ByRef
pt_br: Argumento usado para o parâmetro ByRef não pode ser extraído
ru: Аргумент, используемый для параметра ByRef, не может быть извлечен
tr: ByRef parametresi için kullanılan bağımsız değişken dışarıya ayıklanamaz
zh_hans: 无法提取用于 ByRef 形参的实参
zh_hant: 無法擷取用於 ByRef 參數的引數

source: all static local usages defined in the selection must be included in the selection
cs: Do výběru musí být zahrnutá všechna statická místní použití definovaná ve výběru.
de: alle statischen lokalen Verwendungen, die in der Auswahl definiert sind, müssen in der Auswahl enthalten sein
es: todos los usos locales estáticos definidos en la selección tienen que incluirse en ella
fr: toutes les utilisations locales statiques définies dans la sélection doivent être incluses dans la sélection
it: la selezione deve includere tutti gli utilizzi locali statici definiti nella selezione stessa
ja: 選択範囲で定義されているすべてのスタティック ローカルの使用法は、選択範囲に含める必要があります。
ko: 선택 영역에 정의된 모든 고정 로컬 사용 내역은 선택 영역에 포함되어야 합니다.
pl: wszystkie statyczne użycia zdefiniowane w zaznaczeniu muszą być uwzględnione w zaznaczeniu
pt_br: todos os usos locais estáticos definidos na seleção devem ser incluídos na seleção
ru: Все статические локальные использования, заданные в выделенном фрагменте, должны быть включены в выделенный фрагмент.
tr: Seçimde tanımlanan tüm statik yerel kullanımlar seçime dahil edilmelidir
zh_hans: 选择中必须包括该选择中定义的所有静态局部用法
zh_hant: 選取範圍中必須包含選取範圍中所定義的所有靜態區域使用方式

source: Implicit member access can't be included in the selection without containing statement
cs: Implicitní přístup pro člen nejde do výběru zahrnout bez nadřazeného příkazu.
de: Impliziter Memberzugriff kann in der Auswahl nicht ohne enthaltene Anweisung enthalten sein
es: El acceso implícito a miembros no se puede incluir en la selección sin incluir una instrucción
fr: Impossible d'inclure l'accès au membre dans la sélection sans instruction contenante
it: Non è possibile includere nella selezione l'accesso implicito ai membri senza l'istruzione che lo contiene
ja: 暗黙的なメンバー アクセスは、ステートメントを含まずに選択に入れることはできません
ko: 문이 없는 선택 영역에 암시적 멤버 액세스를 포함할 수 없습니다.
pl: Niejawny dostęp do składowych nie może zostać dołączony do zaznaczenia bez instrukcji zawierającej
pt_br: O acesso de membro implícito não pode ser incluído na seleção sem conter uma instrução
ru: Неявный доступ члена не может быть включен в выделение, не содержащее оператора
tr: Örtük üye erişimi, deyimi içermeden seçime eklenemez
zh_hans: 不具有包含语句的选择中不可包括隐式成员访问
zh_hant: 沒有包含陳述式的選取範圍中，不可包含隱含成員存取。

source: Selection must be part of executable statements
cs: Výběr musí být součástí spustitelných příkazů.
de: Auswahl muss Teil ausführbarer Anweisungen sein
es: Selection debe ser parte de instrucciones ejecutables
fr: La sélection doit faire partie d'instructions exécutables
it: La selezione deve fare parte di istruzioni eseguibili
ja: 選択範囲は実行可能なステートメントの一部にする必要があります
ko: 선택 영역은 실행 가능 문의 일부여야 합니다.
pl: Zaznaczenie musi być częścią wykonywanych instrukcji
pt_br: A seleção deve ser parte de instruções executáveis
ru: Выделенный фрагмент должен быть частью исполняемых операторов
tr: Seçim, yürütülebilir deyimlerin parçası olmalıdır
zh_hans: 所选内容必须是可执行语句的一部分
zh_hant: 選取範圍必須是可執行之陳述式的一部分

source: next statement control variable doesn't have matching declaration statement
cs: další řídicí proměnná příkazu nemá odpovídající příkaz deklarace
de: Die Steuervariable der next-Anweisung besitzt keine übereinstimmende Deklarationsanweisung.
es: la siguiente variable de control de instrucción no tiene una instrucción de declaración coincidente
fr: la variable de contrôle de l'instruction Next ne possède pas d'instruction declaration correspondante
it: non esiste un'istruzione di dichiarazione corrispondente per la variabile di controllo dell'istruzione successiva
ja: 次のステートメントの制御変数に一致する宣言ステートメントがありません
ko: next 문 제어 변수에 일치하는 declaration 문이 없습니다.
pl: kolejna zmienna sterująca instrukcji nie ma pasującej instrukcji deklaracji
pt_br: a variável de controle da instrução next não corresponde a nenhuma instrução de declaração
ru: следующая переменная цикла оператора не имеет соответствующего оператора объявления.
tr: Sonraki deyim denetimi değişkeni eşleşen bildirim deyimine sahip değil
zh_hans: 下一个语句控制变量没有匹配的声明语句
zh_hant: 下一個陳述式控制變數沒有相符的宣告陳述式

source: Selection doesn't contain any valid node
cs: Výběr nemůže obsahovat žádný platný uzel.
de: Auswahl enthält keinen gültigen Knoten
es: Selection no contiene ningún nodo válido
fr: La sélection ne contient aucun nœud valide
it: La selezione non contiene nodi validi
ja: 選択範囲に有効なノードが含まれていません
ko: 선택 영역에 유효한 노드가 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera prawidłowych węzłów
pt_br: A seleção não contém qualquer nó válido
ru: Выделенный фрагмент не содержит допустимый узел
tr: Seçim geçerli düğüm içermiyor
zh_hans: 所选内容不包含任何有效的节点
zh_hant: 選取範圍不包含任何有效的節點

source: no valid statement range to extract out
cs: žádný platný rozsah příkazů pro extrakci ven
de: kein gültiger Anweisungsbereich für die Extraktion
es: ningún intervalo de instrucciones válido para extraer
fr: Aucune plage d'instructions valides à extraire
it: l'intervallo di istruzioni non è valido per l'estrazione
ja: 抽出する有効なステートメントの範囲がありません
ko: 추출하는 데 유효한 문 범위가 없습니다.
pl: brak prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: nenhum intervalo de instrução válido para extrair
ru: Отсутствует допустимый диапазон оператора для извлечения.
tr: Dışarıya ayıklanacak geçerli deyim aralığı yok
zh_hans: 没有可供提取的有效语句范围
zh_hant: 沒有可擷取內容的有效陳述式範圍

source: Invalid selection
cs: Neplatný výběr
de: Ungültige Auswahl
es: Selección no válida
fr: Sélection non valide
it: Selezione non valida
ja: 無効な選択
ko: 잘못된 선택 영역입니다.
pl: Nieprawidłowy wybór
pt_br: Seleção inválida
ru: Недопустимый выделенный фрагмент
tr: Geçersiz seçim
zh_hans: 无效选择
zh_hant: 選取範圍無效

source: Selection doesn't contain any valid token
cs: Výběr nemůže obsahovat žádný platný token.
de: Auswahl enthält keinen gültigen Token
es: Selection no contiene ningún token válido
fr: La sélection ne contient aucun jeton valide
it: La selezione non contiene token validi
ja: 選択範囲に有効なトークンが含まれていません
ko: 선택 영역에 유효한 토큰이 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera prawidłowych tokenów
pt_br: A seleção não contém qualquer token válido
ru: Выделенный фрагмент не содержит допустимый маркер
tr: Seçim geçerli belirteç içermiyor
zh_hans: 所选内容不包含任何有效的标记
zh_hant: 選取範圍不包含任何有效的語彙基元

source: No valid selection to perform extraction
cs: Žádný platný výběr k provedení extrakce
de: Keine gültige Auswahl für die Druckführung der Extraktion
es: Ninguna selección válida para realizar la extracción
fr: Pas de sélection valide pour procéder à l'extraction
it: La selezione non è valida per eseguire l'estrazione
ja: 抽出を実行する有効な選択がありません
ko: 추출하는 데 유효한 선택 영역이 없습니다.
pl: Brak prawidłowego zaznaczenia do wyodrębnienia
pt_br: Nenhuma seleção válida para realizar a extração
ru: Отсутствует допустимый выбор для выполнения извлечения.
tr: Ayıklamayı gerçekleştirmek için geçerli seçim yok
zh_hans: 没有用于执行提取的有效选择
zh_hant: 無任何有效的選取範圍可執行擷取

source: No common root node for extraction
cs: Žádný společný kořenový uzel pro extrakci
de: Es ist kein gemeinsamer Stammknoten für die Extraktion vorhanden.
es: No hay nodo raíz común para la extracción.
fr: Aucun nœud racine commun pour l'extraction
it: Non esiste un nodo radice comune per l'estrazione
ja: 抽出するための一般的なルート ノードがありません。
ko: 추출에 필요한 일반 루트 노드가 없습니다.
pl: Brak wspólnego węzła głównego do wyodrębnienia
pt_br: Não há um nó raiz comum para extração
ru: Нет стандартного корневого узла для извлечения.
tr: Ayıklama için ortak kök düğümü yok
zh_hans: 没有可用于提取的公共根节点
zh_hant: 沒有一般根節點可供擷取

source: Deprecated
cs: Zastaralé
de: Veraltet
es: En desuso
fr: Déconseillé
it: Deprecato
ja: 非推奨
ko: 사용되지 않음
pl: Przestarzały
pt_br: Preterido
ru: Нерекомендуемый
tr: Kullanım Dışı
zh_hans: 已弃用
zh_hant: 取代

source: Extension
cs: Rozšíření
de: Erweiterung
es: Extensión
it: Estensione
ja: 拡張
ko: 확장
pl: Rozszerzenie
pt_br: Extensão
ru: Расширение
tr: Uzantı
zh_hans: 扩展
zh_hant: 擴充功能

source: Awaitable
cs: Očekávatelný
es: Admite await
fr: Pouvant être attendu(e)
ja: 待機可能
ko: 대기 가능
pl: Oczekujący
pt_br: Aguardável
ru: Поддерживает ожидание
tr: Beklenebilir
zh_hans: 可等待
zh_hant: 可等候

source: Awaitable, Extension
cs: Očekávatelný, rozšíření
de: Awaitable, Erweiterung
es: Admite await, extensión
it: Awaitable, estensione
ja: 待機可能、拡張子
ko: 대기 가능, 확장
pl: Oczekujący, rozszerzenie
pt_br: Aguardável, Extensão
ru: Поддерживает ожидание, расширение
tr: Beklenebilir, Uzantı
zh_hans: 可等待，扩展
zh_hant: 可等候的擴充功能

source: <new variable>
cs: <nová proměnná>
de: <neue Variable>
es: <nueva variable>
fr: <nouvelle variable>
it: <nuova variabile>
ja: <新しい変数>
ko: <새 변수>
pl: <nowa zmienna>
pt_br: <nova variável>
ru: <новая переменная>
zh_hans: <新变量>
zh_hant: <新變數>

source: R&emove and Sort Imports
es: Quitar y ord&enar instrucciones Import
zh_hant: 移除及排序匯入(&E)

source: Creates a delegate procedure instance that references the specified procedure. AddressOf <procedureName>
cs: Vytvoří instanci procedury delegáta, která odkazuje na určenou proceduru. AddressOf <procedureName>
de: Erstellt eine Delegatprozedurinstanz, die auf die angegebene Prozedur verweist. AddressOf <procedureName>
es: Crea una instancia del procedimiento delegado que hace referencia al procedimiento especificado. AddressOf <procedureName>
fr: Crée une instance de procédure de délégué qui référence la procédure spécifiée. AddressOf <procedureName>
it: Crea un'istanza di routine delegata che fa riferimento alla routine specificata. AddressOf <procedureName>
ja: 指定されたプロシージャを参照するデリゲート プロシージャ インスタンスを作成します。 AddressOf <procedureName>
ko: 지정한 프로시저를 참조하는 대리자 프로시저 인스턴스를 만듭니다. AddressOf <procedureName>
pl: Tworzy delegowaną instancję procedury, która odwołuje się do określonej procedury. AddressOf <procedureName>
pt_br: Cria uma instância de procedimento delegado que faz referência ao procedimento especificado. AddressOf <procedureName>
ru: Создает экземпляр процедуры делегата, который ссылается на указанную процедуру. AddressOf <procedureName>
tr: Belirtilen yordama başvuran bir temsilci yordam örneği oluşturur. AddressOf <procedureName>
zh_hans: 创建一个引用指定过程的委托过程实例。 AddressOf <procedureName>
zh_hant: 建立會參考指定程序的委派程序執行個體。 AddressOf <procedureName>

source: Indicates that an external procedure has another name in its DLL.
cs: Indikuje, že externí procedura má jiný název ve své DLL.
de: Gibt an, dass eine externe Prozedur in der entsprechenden DLL einen anderen Namen hat.
es: Indica que un procedimiento externo tiene otro nombre en su DLL.
fr: Indique qu'une procédure externe a un autre nom dans sa DLL.
it: Indica che una routine esterna ha un altro nome nella relativa DLL.
ja: 外部プロシージャが DLL の中では別の名前を持つことを示します。
ko: 외부 프로시저의 DLL에 다른 이름이 있음을 나타냅니다.
pl: Wskazuje, że procedura zewnętrzna ma inną nazwę w bibliotece DLL.
pt_br: Indica que um procedimento externo tem outro nome em sua DLL.
ru: Указывает, что внешняя процедура имеет другое имя в файле DLL.
tr: Bir dış yordamın, kendi DLL'i içinde başka ada sahip olduğunu gösterir.
zh_hans: 指示外部过程在其 DLL 中还有其他名称。
zh_hant: 表示外部程序在其 DLL 中有另一個名稱。

source: Performs a short-circuit logical conjunction on two expressions. Returns True if both operands evaluate to True. If the first expression evaluates to False, the second is not evaluated. <result> = <expression1> AndAlso <expression2>
cs: Vykoná zkrácenou logickou operaci konjunkce dvou výrazů. Vrací hodnotu True, pokud mají oba operandy hodnotu True. Pokud je první výraz nepravdivý, druhý se už nevyhodnocuje. < výsledek> = <výraz1> AndAlso <výraz2>
de: Führt eine verkürzte logische Konjunktion für zwei Ausdrücke durch. Gibt True zurück, wenn beide Operanden als True ausgewertet werden. Wenn der erste Ausdruck als False ausgewertet wird, wird der zweite Ausdruck nicht ausgewertet. < Ergebnis> = <Ausdruck1> AndAlso < Ausdruck2>
es: Realiza una conjunción lógica de cortocircuito en dos expresiones. Devuelve True si ambos operandos se evalúan como True. Si la primera expresión se evalúa como False, la segunda no se evalúa. <resultado> = <expresión1> AndAlso <expresión2>
fr: Effectue une conjonction logique de court-circuit sur deux expressions. Retourne True si les deux opérandes ont la valeur True. Si la première expression a la valeur False, la seconde n'est pas évaluée. <result> = <expression1> AndAlso <expression2>
it: Esegue una congiunzione logica di corto circuito su due espressioni. Restituisce True se entrambi gli operandi vengono valutati True. Se la prima espressione viene valutata False, la seconda non viene valutata. <risultato> = <espressione1> AndAlso <espressione2>
ja: 2 つの式のショートサーキット論理積を求めます。両方のオペランドが True と評価された場合は True を返します。最初の式が False と評価された場合、2 番目の式は評価されません。 <result> = <expression1> AndAlso <expression2>
ko: 두 식의 단락(short-circuit) 논리곱 연산을 수행합니다. 두 피연산자가 모두 True인 경우 True를 반환합니다. 첫 번째 식이 False인 경우 두 번째 식은 계산하지 않습니다. <result> = <expression1> AndAlso <expression2>
pl: Wykonuje logiczną koniunkcję typu „sprzężenie” na dwóch wyrażeniach. Zwraca wartość True, jeśli oba argumenty operacji dają w wyniku wartość True. Jeśli pierwsze wyrażenie zwraca wynik False, drugie nie jest obliczane. <wynik> = <wyrażenie1> AndAlso <wyrażenie2>
pt_br: Executa uma conjunção lógica de circuito pequeno em duas expressões. Retorna Verdadeiro se ambos operandos forem avaliados como Verdadeiro. Se a primeira expressão for avaliada como Falso, a segunda não será avaliada. <result> = <expression1> AndAlso <expression2>
ru: Выполняет логическое умножение краткой записи двух выражений. Возвращает значение True, если оба операнда принимают значение True. Если первое выражение принимает значение False, то второе выражение не вычисляется. <result> = <expression1> AndAlso <expression2>
tr: İki ifadede bir kısa devre mantıksal VE işlecini gerçekleştirir. Eğer her iki işlenen de True değerlendiriliyorsa True değer döndürür. Eğer ilk işlenen False değerlendiriliyorsa, ikinci ifade değerlendirilmez. <result> = <expression1> AndAlso <expression2>
zh_hans: 对两个表达式执行短路逻辑与运算。如果这两个操作数的计算结果均为 True，则返回 True。如果第一个表达式的计算结果为 False，则将不计算第二个表达式。 <result> = <expression1> AndAlso <expression2>
zh_hant: 在兩個運算式上執行最少運算邏輯結合。若兩個運算元都評估為 True，即傳回 True。若第一個運算式評估為 False，則不會評估第二個運算式。 <result> = <expression1> AndAlso <expression2>

source: Performs a logical conjunction on two Boolean expressions, or a bitwise conjunction on two numeric expressions. For Boolean expressions, returns True if both operands evaluate to True. Both expressions are always evaluated. <result> = <expression1> And <expression2>
cs: Vykoná logickou operaci konjunkce dvou logických výrazů nebo bitovou operaci konjunkce dvou číselných výrazů. Pro logické výrazy platí, že vrací hodnotu True, pokud mají oba operandy hodnotu True. Vždycky se vyhodnocují oba výrazy. <výsledek> = <výraz1> And <výraz2>
de: Führt eine logische Konjunktion für zwei boolesche Ausdrücke oder eine bitweise Konjunktion für zwei numerische Ausdrücke durch. Gibt bei booleschen Ausdrücken True zurück, wenn beide Operanden als True ausgewertet werden. Beide Ausdrücke werden immer ausgewertet. <Ergebnis> = <Ausdruck1> And <Ausdruck2>
es: Realiza una conjunción lógica de dos expresiones booleanas o una conjunción bit a bit de dos expresiones numéricas. Para las expresiones booleanas, devuelve True si ambos operandos se evalúan como True. Ambas expresiones se evalúan siempre. <resultado> = <expresión1> And <expresión2>
fr: Effectue une conjonction logique sur deux expressions Boolean ou une conjonction d'opérations de bits sur deux expressions numériques. Pour les expressions Boolean, retourne True si les deux opérandes ont la valeur True. Les deux expressions sont toujours évaluées. <result> = <expression1> And <expression2>
it: Esegue una congiunzione logica su due espressioni Boolean o una congiunzione bit per bit su due espressioni numeriche. Per le espressioni Boolean, restituisce True se entrambi gli operandi vengono valutati True. Entrambe le espressioni vengono sempre valutate. <risultato> = <espressione1> And <espressione2>
ja: 2 つのブール式の場合は論理積、2 つの数値式の場合はビットごとの積を求めます。ブール式の場合、両方の式が True と評価されたときは True を返します。常に両方の式が評価されます。 <result> = <expression1> And <expression2>
ko: 두 Boolean 식의 논리곱 연산을 수행하거나 두 숫자 식의 비트 논리곱 연산을 수행합니다. Boolean 식의 경우 두 피연산자가 모두 True이면 True를 반환합니다. 항상 두 식을 모두 계산합니다. <result> = <expression1> And <expression2>
pl: Wykonuje koniunkcję logiczną na dwóch wyrażeniach logicznych lub koniunkcję bitową na dwóch wyrażeniach numerycznych. W przypadku wyrażeń logicznych zwraca wartość True, jeśli oba operatory zwracają wartość True. Oba wyrażenia są zawsze obliczane. <wynik> = <wyrażenie1> And <wyrażenie2>
pt_br: Executa uma conjunção lógica em duas expressões booleanas ou uma conjunção bit a bit em duas expressões numéricas. Para expressões booleanas, retorna Falso se ambos operandos forem avaliados como Verdadeiro. As duas expressões são sempre avaliadas. <result> = <expression1> And <expression2>
ru: Выполняет логическое умножение двух логических выражений или побитовое умножение двух числовых выражений. Возвращает значение True для логических выражений, если оба операнда принимают значение True. Всегда вычисляются оба выражения. <result> = <expression1> And <expression2>
tr: İki Boolean ifadesinde mantıksal VE işlecini ya da iki sayısal ifadede bit tabanlı VE işlecini gerçekleştirir. Boolean ifadeler için, eğer her iki işlenen de True değerlendiriliyorsa True değer döndürür. Her iki ifade de her zaman değerlendirilir. <result> = <expression1> And <expression2>
zh_hans: 对两个布尔表达式执行逻辑与运算，或对两个数值表达式执行位与运算。对于布尔表达式，如果这两个操作数的计算结果均为 True，则返回 True。始终对这两个表达式进行计算。 <result> = <expression1> And <expression2>
zh_hant: 在兩布林運算式上執行邏輯結合，或在兩個數值運算式上執行位元結合。對於布林運算式而言，若兩個運算元都評估為 True，即傳回 True。兩個運算式都會進行評估。 <result> = <expression1> And <expression2>
