Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Specifies the sort order for an Order By clause in a query. The largest element will appear first.
cs: Určuje pořadí řazení pro klauzuli Order By v dotazu. Jako první se objeví největší element.
de: Gibt die Sortierreihenfolge für eine Order By-Klausel in einer Abfrage an. Das größte Element wird zuerst aufgeführt.
es: Especifica el criterio de ordenación de una cláusula Order By en una consulta. Aparece primero el elemento más grande.
fr: Spécifie l'ordre de tri d'une clause Order By dans une requête. Le plus grand élément apparaît en premier.
it: Specifica l'ordinamento per una clausola Order By in una query. L'elemento più grande verrà visualizzato per primo.
ja: クエリの Order By 句の並べ替え順序を指定します。最大の要素が最初に表示されます。
ko: 쿼리의 Order By 절에 사용할 정렬 순서를 지정합니다. 가장 큰 요소가 가장 먼저 표시됩니다.
pl: Określa porządek sortowania dla klauzuli Order By w zapytaniu. Największy element będzie wyświetlany jako pierwszy.
pt_br: Especifica a ordem de classificação para uma cláusula Classificar Por em uma consulta. O maior elemento aparecerá primeiro.
ru: Определяет порядок сортировки для предложения Order By в запросе. Первым будет указан самый большой элемент.
tr: Bir sorgu içinde Order By yan tümcesi için sıralama düzeni belirtir. En büyük öğe ilk görünür.
zh_hans: 指定查询中 Order By 子句的排序顺序。最大的元素将首先出现。
zh_hant: 指定查詢中 Order By 子句的排序順序。最大的元素最先出現。

source: Restricts the values of a query result to eliminate duplicate values.
cs: Omezí hodnoty výsledku dotazu, aby se eliminovaly duplicitní hodnoty.
de: Schränkt die Werte eines Abfrageergebnisses ein, um doppelte Werte zu entfernen.
es: Restringe los valores de los resultados de una consulta para eliminar valores duplicados.
fr: Restreint les valeurs du résultat d'une requête afin d'éliminer les valeurs dupliquées.
it: Limita i valori del risultato di una query per eliminare quelli duplicati.
ja: 重複した値がなくなるようにクエリ結果の値を制限します。
ko: 쿼리 결과 값을 제한하여 중복 값을 제거합니다.
pl: Ogranicza wartości wyniku zapytania w celu wyeliminowania zduplikowanych wartości.
pt_br: Restringe os valores do resultado de uma consulta para eliminar valores duplicados.
ru: Ограничивает значения в результатах запроса, чтобы исключить дублирующиеся значения.
tr: Sorgu sonuç değerlerini yineleme olmayacak şekilde kısıtlar.
zh_hans: 制查询结果的值以消除重复值。
zh_hant: 限制查詢結果的值，以去除重複的值。

source: Repeats a block of statements while a Boolean condition is true, or until the condition becomes true. Do...Loop {While | Until} <condition>
cs: Opakuje blok příkazů, dokud je logická podmínka pravdivá nebo dokud se podmínka nestane pravdivou. Do...Loop {While | Until} <podmínka>
de: Wiederholt einen Anweisungsblock, solange eine boolesche Bedingung erfüllt wird oder bis die Bedingung erfüllt wird. Do...Loop {While | Until} <Bedingung>
es: Repite un bloque de instrucciones mientras una condición Boolean es true o hasta que pasa a ser true. Do...Loop {While | Until} <condición>
fr: Répète un bloc d'instructions tant qu'une condition Boolean a la valeur True ou jusqu'à ce que la condition devienne True. Do...Loop {While | Until} <condition>
it: Ripete un blocco di istruzioni fintanto che una condizione Boolean è True o fino a quando la condizione non diventa True. Do...Loop {While | Until} <condizione>
ja: ブール条件が true である間、または条件が true になるまで、ステートメント ブロックを繰り返します。 Do...Loop {While | Until} <condition>
ko: Boolean 조건이 true이거나 조건이 true가 될 때까지 문 블록을 반복합니다. Do...Loop {While | Until} <condition>
pl: Powtarza blok instrukcji, dopóki spełniony jest warunek typu Boolean lub do momentu spełnienia warunku. Do...Loop {While | Until} <warunek>
pt_br: Repete um bloco de instruções até que uma condição Booleana seja verdadeira ou até que a condição se torne verdadeira. Do...Loop {While | Until} <condition>
ru: Повторяет блок операторов, пока логическое условие истинно или условие не принимает значение True. Do...Loop {While | Until} <condition>
tr: Bir Boolean koşulu true olduğu sürece ya da koşul true olana kadar bir deyimler bloğunu tekrar eder. Do...Loop {While | Until} <condition>
zh_hans: 在布尔条件为 true 时或条件变为 true 之前重复语句块。 Do...Loop {While | Until} <condition>
zh_hant: 在布林條件為 True 的情況下，或是在條件變成 True 之前，持續重複陳述式區塊。 Do...Loop {While | Until} <condition>

source: Repeats a block of statements until a Boolean condition becomes true. Do Until <condition>...Loop
cs: Opakuje blok příkazů, dokud se logická podmínka nestane pravdivou. Do Until <podmínka>...Loop
de: Wiederholt einen Anweisungsblock, bis eine boolesche Bedingung erfüllt wird. Do Until <Bedingung>...Loop
es: Repite un bloque de instrucciones hasta que una condición Boolean pasa a ser true. Do Until <condición>...Loop
fr: Répète un bloc d'instructions jusqu'à ce qu'une condition Boolean devienne True. Do Until <condition>...Loop
it: Ripete un blocco di istruzioni fino a quando una condizione booleana non diventa True. Do Until <condizione>...Loop
ja: ブール条件が true になるまでステートメント ブロックを繰り返します。 Do Until <condition>...Loop
ko: Boolean 조건이 true가 될 때까지 문 블록을 반복합니다. Do Until <condition>...Loop
pl: Powtarza blok instrukcji do momentu, gdy zostanie spełniony warunek typu Boolean. Do Until <warunek>...Loop
pt_br: Repete um bloco de instruções até que uma condição Booleana se torne verdadeira. Do Until <condition>...Loop
ru: Повторяет блок операторов, когда логическое условие становится истинно. Do Until <condition>...Loop
tr: Bir Boolean koşulu true olana kadar bir deyimler bloğunu tekrar eder. Do Until <condition>...Loop
zh_hans: 在布尔条件变为 true 之前重复语句块。 Do Until <condition>...Loop
zh_hant: 持續重複陳述式區塊，直到布林條件變成 True 為止。 Do Until <condition>...Loop

source: Repeats a block of statements while a Boolean condition is true. Do While <condition>...Loop
cs: Opakuje blok příkazů, dokud je logická podmínka pravdivá. Do While <podmínka>...Loop
de: Wiederholt einen Anweisungsblock, solange eine boolesche Bedingung erfüllt wird. Do While <Bedingung>...Loop
es: Repite un bloque de instrucciones mientras una condición Boolean es true. Do While <condición>...Loop
fr: Répète un bloc d'instructions tant qu'une condition Boolean a la valeur True. Do While <condition>...Loop
it: Ripete un blocco di istruzioni fintanto che una condizione booleana è True. Do While <condizione>...Loop
ja: ブール条件が true である間、ステートメント ブロックを繰り返します。 Do While <condition>...Loop
ko: Boolean 조건이 ture인 경우 문 블록을 반복합니다. Do While <condition>...Loop
pl: Powtarza blok instrukcji, dopóki spełniony jest warunek typu Boolean. Do While <warunek>...Loop
pt_br: Repete um bloco de instruções enquanto uma condição Booleana é verdadeira. Do While <condition>...Loop
ru: Повторяет блок операторов, пока логическое условие истинно. Do While <condition>...Loop
tr: Bir Boolean koşulu true olduğu sürece bir deyimler bloğunu tekrar eder. Do While <condition>...Loop
zh_hans: 在布尔条件为 true 时重复语句块。 Do While <condition>...Loop
zh_hant: 在布林條件為 True 的情況下，持續重複陳述式區塊。 Do While <condition>...Loop

source: Introduces a group of statements in an #If statement that is compiled if no previous condition evaluates to True.
cs: Zavede skupinu příkazů v příkazu #If, který se zkompiluje, pokud se žádná z předchozích podmínek nevyhodnotí jako True.
de: Führt eine Gruppe von Anweisungen in einer #If-Anweisung ein, die kompiliert wird, wenn keine vorhergehende Bedingung als True ausgewertet wird.
es: Introduce un grupo de instrucciones en una instrucción #If que se ejecuta si ninguna condición anterior se evalúa como True.
fr: Introduit un groupe d'instructions dans une instruction #If qui est compilée si aucune condition précédente n'a la valeur True.
it: Introduce un gruppo di istruzioni in un'istruzione #If che viene compilata se nessuna condizione precedente restituisce True.
ja: 前の条件が True として評価されていない場合にコンパイルされる #If ステートメントにステートメント グループを導入します。
ko: #If 문에서 이전 조건이 True가 아닌 경우 컴파일할 문 그룹을 지정합니다.
pl: Wprowadza grupę instrukcji w instrukcji #If, która jest kompilowana, jeśli żaden z poprzednich warunków nie daje w wyniku wartości True.
pt_br: Apresenta um grupo de instruções em uma instrução #If que é compilada se nenhuma condição anterior for avaliada como Verdadeiro.
ru: Вводит группу операторов в операторе #If, который компилируется, если предыдущее условие принимает значение True.
tr: Bir #If deyimi içinde, eğer kendisinden önce True değerlendirilen koşul yoksa derlenecek bir deyim grubunu ortaya çıkarır.
zh_hans: 在 #If 句中引入一组要在前面所有条件的计算结果都不是 True 时编译的语句。
zh_hant: 在 #If 陳述式中引進引進若之前沒有條件評估為 True 時，就會編譯的一組陳述式。

source: Introduces a condition in an #If statement that is tested if the previous conditional test evaluates to False.
cs: Zavede podmínku v příkazu #If, který se testuje, pokud se předchozí podmíněný test vyhodnotí jako False.
de: Führt eine Bedingung in einer #If-Anweisung ein, die geprüft wird, wenn die vorhergehende Prüfung der Bedingungen als False ausgewertet wird.
es: Introduce una condición en una instrucción #If que se comprueba si la prueba condicional anterior se evalúa como False.
fr: Introduit une condition dans une instruction #If qui est testée si le précédent test conditionnel a la valeur False.
it: Introduce una condizione in un'istruzione #If che viene testata se il test condizionale precedente restituisce False.
ja: 前の条件テストが False として評価されている場合にテストされる #If ステートメントの条件を導入します。
ko: #If 문에서 이전 조건 테스트가 False인 경우 테스트할 조건을 지정합니다.
pl: Wprowadza warunek w instrukcji #If, który jest testowany, jeśli poprzedni test warunkowy daje w wyniku wartość False.
pt_br: Apresenta uma condição em uma instrução #If que é testada se o teste condicional anterior for avaliado como Falso.
ru: Вводит условие в операторе #If, который должен быть протестирован, если предыдущая проверка условия принимает значение False.
tr: Bir #If deyimi içinde, eğer kendisinden önceki koşul testi False değerlendirilirse test edilecek koşulu ortaya çıkarır.
zh_hans: 在 #If 语句中引入一个要在前面条件测试的计算结果为 False 时测试的条件。
zh_hant: 在 #If 陳述式中引進若之前的條件測試評估為 False 時，就會測試的條件。

source: Introduces a condition in an If statement that is to be tested if the previous conditional test fails.
cs: Zavede podmínku v příkazu If, který se má testovat, pokud je předchozí podmíněný test neúspěšný.
de: Führt eine Bedingung in einer If-Anweisung ein, die geprüft wird, wenn der vorhergehende bedingte Test nicht erfolgreich ist.
es: Introduce una condición en una instrucción If que se debe comprobar si no se supera la prueba condicional anterior.
fr: Introduit une condition dans une instruction If qui doit être testée en cas d'échec du précédent test conditionnel.
it: Introduce una condizione in un'istruzione If da testare se il test condizionale precedente ha esito negativo.
ja: 前の条件テストが失敗した場合にテストされる If ステートメントの条件を導入します。
ko: If 문에서 이전 조건 테스트가 실패할 경우 테스트할 조건을 지정합니다.
pl: Wprowadza warunek do instrukcji If, który jest sprawdzany, jeśli poprzedni warunek nie był spełniony.
pt_br: Apresenta uma condição em uma instrução If que deve ser testada se o teste condicional anterior falhar.
ru: Вводит условие в операторе If, который должен быть протестирован, если предыдущая проверка условия не удалась.
tr: Bir If deyimi içinde, önceki koşul testi başarısız olursa test edilecek koşulu ortaya çıkarır.
zh_hans: 在 If 语句中引入一个要在前面的条件测试失败时测试的条件。
zh_hant: 在 If 陳述式中引進若之前的條件測試失敗，就會測試的條件。

source: Introduces a group of statements in an If statement that is executed if no previous condition evaluates to True.
cs: Zavede skupinu příkazů v příkazu If, který se provede, pokud se žádná z předchozích podmínek nevyhodnotí jako True.
de: Führt eine Gruppe von Anweisungen in einer If-Anweisung ein, die ausgeführt wird, wenn keine vorhergehende Bedingung als True ausgewertet wird.
es: Introduce un grupo de instrucciones en una instrucción If que se ejecuta si ninguna condición anterior se evalúa como True.
fr: Introduit un groupe d'instructions dans une instruction If qui est exécutée si aucune condition précédente n'a la valeur True.
it: Introduce un gruppo di istruzioni in un'istruzione If eseguita se nessuna condizione precedente restituisce True.
ja: 前の条件が True として評価されていない場合に実行される If ステートメントにステートメント グループを導入します。
ko: If 문에서 이전 조건이 True가 아닌 경우 실행할 문 그룹을 지정합니다.
pl: Wprowadza grupę instrukcji do instrukcji If, które są wykonywane, jeśli żaden poprzedni warunek nie ma wartości True.
pt_br: Apresenta um grupo de instruções em uma instrução If que é executada se nenhuma condição anterior for avaliada como Verdadeiro.
ru: Вводит группу операторов в операторе If, который выполняется, если предыдущее условие не принимает значение True.
tr: Bir If deyimi içinde, eğer kendisinden önce True değerlendirilen koşul yoksa yürütülecek bir deyim grubunu ortaya çıkarır.
zh_hans: 在 If 语句中引入一组要在前面所有条件的计算结果都不是 True 时执行的语句。
zh_hant: 在 If 陳述式中引進若之前沒有條件評估為 True 時，就會執行的一組陳述式。

# Terminates_the_definition_of_an_SharpIf_block
source: Terminates the definition of an #If block.
cs: Ukončí definici bloku #If.
de: Beendet die Definition eines #If-Block.
es: Termina la definición de un bloque #If.
fr: Termine la définition d'un bloc #If.
it: Termina la definizione di un blocco #If.
ja: #If ブロックの定義を終了します。
ko: #If 블록의 정의를 종료합니다.
pl: Kończy definicję bloku #If.
pt_br: Finaliza a definição de um bloco #If.
ru: Завершает определение блока #If.
tr: Bir #If bloğunun tanımını sonlandırır.
zh_hans: 终止 #If 块的定义。
zh_hant: 結束 #If 區塊的定義。

source: Stops execution immediately.
cs: Okamžitě zastaví provádění.
de: Beendet sofort die Ausführung.
es: Detiene inmediatamente la ejecución.
fr: Arrête l'exécution immédiatement.
it: Arresta l'esecuzione immediatamente.
ja: 実行を直ちに停止します。
ko: 바로 실행을 중지합니다.
pl: Zatrzymuje wykonywanie natychmiast.
pt_br: Interrompe a execução imediatamente.
ru: Немедленно останавливает выполнение.
tr: Yürütmeyi hemen durdurur.
zh_hans: 立即停止执行。
zh_hant: 立即停止執行。

# Terminates_a_SharpRegion_block
source: Terminates a #Region block.
cs: Ukončí blok #Region.
de: Beendet einen #Region-Block.
es: Termina un bloque #Region.
fr: Termine un bloc #Region.
it: Termina un blocco #Region.
ja: #Region ブロックを終了します。
ko: #Region 블록을 종료합니다.
pl: Kończy blok #Region.
pt_br: Finaliza um bloco #Region.
ru: Заканчивает блок #Region.
tr: Bir #Region bloğunu sonlandırır.
zh_hans: 终止 #Region 块。
zh_hant: 結束 #Region 區塊。

source: Specifies the relationship between element keys to use as the basis of a join operation.
cs: Určuje vztah mezi klíči elementů, který se má použít jako základ operace spojení.
de: Gibt die Beziehung zwischen Elementschlüsseln an, die als Grundlage eines Beitrittsvorgangs verwendet werden sollen.
es: Especifica la relación entre las claves de elemento que se utilizan como base de una operación de unión.
fr: Spécifie la relation qui existe entre les clés d'éléments à utiliser comme base d'une opération de jointure.
it: Specifica la relazione tra chiavi di elementi da usare come base di un'operazione di unione.
ja: 結合操作の基準として使用する要素キー間の関係を指定します。
ko: 조인 연산의 기준으로 사용할 요소 키 사이의 관계를 지정합니다.
pl: Określa relację między kluczami elementów używaną jako podstawa operacji złączenia.
pt_br: Especifica o relacionamento entre chaves de elemento a usar como a base de uma operação join.
ru: Определяет отношение между ключами элемента для использования в качестве основы для операции соединения.
tr: Bir birleştirme işleminde temel olarak kullanmak üzere, öğe anahtarları arasındaki ilişkiyi belirtir.
zh_hans: 指定元素键之间的关系，该关系要用作联接运算的基础。
zh_hant: 指定元素索引鍵之間的關聯性，以用做為聯結作業的基礎。

source: Simulates the occurrence of an error.
cs: Simuluje výskyt chyby.
de: Simuliert das Auftreten eines Fehlers.
es: Simula la aparición de un error.
fr: Simule la présence d'une erreur.
it: Simula il verificarsi di un errore.
ja: エラーの発生をシミュレートします。
ko: 오류 항목을 시뮬레이션합니다.
pl: Symuluje wystąpienie błędu.
pt_br: Simula a ocorrência de um erro.
ru: Имитирует возникновение ошибки.
tr: Bir hatanın oluşum benzetimini gerçekleştirir.
zh_hans: 模拟错误的出现情况。
zh_hant: 模擬錯誤的發生。

source: Exits a Do loop and transfers execution immediately to the statement following the Loop statement.
cs: Ukončí smyčku Do a okamžitě přenese provádění do příkazu za příkazem Loop.
de: Beendet eine Do-Schleife und überträgt die Ausführung direkt an die Anweisung nach der Loop-Anweisung.
es: Sale de un bucle Do y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la instrucción Loop.
fr: Quitte une boucle Do et transfère immédiatement l'exécution à l'instruction qui suit l'instruction Loop.
it: Esce da un ciclo Do e trasferisce immediatamente l'esecuzione all'istruzione successiva all'istruzione Loop.
ja: Do ループを終了し、その実行を Loop ステートメントに続くステートメントに直ちに転送します。
ko: Do 루프를 끝내고 Loop 문 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza pętlę Do i natychmiast przenosi wykonanie do instrukcji następującej po instrukcji Loop.
pt_br: Sai de um loop Do e transfere a execução imediatamente para a instrução após a instrução Loop.
ru: Выходит из цикла Do и немедленно передает выполнение оператору после окончания процедуры Loop.
tr: Bir Do döngüsünden çıkıp yürütmeyi Loop deyiminin sonrasındaki deyime hemen aktarır.
zh_hans: 退出 Do 循环，并将执行过程立即转移到 Loop 语句后面的语句。
zh_hant: 結束 Do 迴圈，將執行立即轉移到接在 Loop 陳述式之後的陳述式。

source: Exits a For loop and transfers execution immediately to the statement following the Next statement.
cs: Ukončí smyčku For a okamžitě přenese provádění do příkazu za příkazem Next.
de: Beendet eine For-Schleife und überträgt die Ausführung direkt an die Anweisung nach der Next-Anweisung.
es: Sale de un bucle For y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la instrucción Next.
fr: Quitte une boucle For et transfère immédiatement l'exécution à l'instruction qui suit l'instruction Next.
it: Esce da un ciclo For e trasferisce immediatamente l'esecuzione all'istruzione successiva all'istruzione Next.
ja: For ループを終了し、その実行を Next ステートメントに続くステートメントに直ちに転送します。
ko: For 루프를 끝내고 Next 문 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza pętlę For i natychmiast przenosi wykonanie do instrukcji następującej po instrukcji Next.
pt_br: Sai de um loop For e transfere a execução imediatamente para a instrução após a instrução Next.
ru: Выходит из цикла For и немедленно передает выполнение оператору после окончания процедуры Next.
tr: Bir For döngüsünden çıkıp yürütmeyi Next deyiminin sonrasındaki deyime hemen aktarır.
zh_hans: 退出 For 循环，并将执行过程立即转移到 Next 语句后面的语句。
zh_hant: 結束 For 迴圈，並將執行立即轉移到接在 Next 陳述式之後的陳述式。

source: Exits a procedure or block and transfers execution immediately to the statement following the procedure call or block definition. Exit {Do | For | Function | Property | Select | Sub | Try | While}
cs: Ukončí proceduru nebo blok a okamžitě přenese provádění do příkazu za voláním procedury nebo definicí bloku. Exit {Do | For | Function | Property | Select | Sub | Try | While}
de: Beendet eine Prozedur oder einen Block und überträgt die Ausführung direkt an die Anweisung nach dem Prozeduraufruf oder der Blockdefinition. Exit {Do | For | Function | Property | Select | Sub | Try | While}
es: Sale de un procedimiento o bloque y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la llamada al procedimiento o de la definición del bloque. Exit {Do | For | Function | Property | Select | Sub | Try | While}
fr: Quitte une procédure ou un bloc, puis transfère immédiatement l'exécution à l'instruction qui suit l'appel de procédure ou la définition de bloc. Exit {Do | For | Function | Property | Select | Sub | Try | While}
it: Esce da una routine o un blocco e trasferisce immediatamente l'esecuzione all'istruzione successiva alla chiamata di routine o alla definizione di blocco. Exit {Do | For | Function | Property | Select | Sub | Try | While}
ja: プロシージャまたはブロックを終了し、その実行をプロシージャ呼び出しまたはブロック定義に続くステートメントに直ちに転送します。 Exit {Do | For | Function | Property | Select | Sub | Try | While}
ko: 프로시저 또는 블록을 끝내고 프로시저 호출 또는 블록 정의 다음에 오는 문으로 실행을 즉시 이동합니다. Exit {Do | For | Function | Property | Select | Sub | Try | While}
pl: Opuszcza procedurę lub blok i natychmiast przenosi wykonanie do instrukcji następującej po wywołaniu procedury lub definicji bloku. Exit {Do | For | Function | Property | Select | Sub | Try | While}
pt_br: Sai de um procedimento ou bloco e transfere a execução imediatamente para a instrução após a chamada de procedimento ou bloco de definição. Sair {Do | For | Function | Property | Select | Sub | Try | While}
ru: Выходит из процедуры или блока и немедленно передает выполнение оператору после окончания определения вызова или блока. Exit {Do | For | Function | Property | Select | Sub | Try | While}
tr: Bir yordam ya da bloktan çıkıp yürütmeyi, yordam çağrısının ya da blok tanımının sonrasındaki deyime hemen aktarır. Exit {Do | For | Function | Property | Select | Sub | Try | While}
zh_hans: 退出当前的过程或块，并将执行过程立即转移到该过程调用或块定义后面的语句。 Exit{Do | For | Function | Property | Select | Sub | Try | While}
zh_hant: 結束程序或區塊，並將執行立即轉移到接在程序呼叫或區塊定義之後的陳述式。 Exit {Do | For | Function | Property | Select | Sub | Try | While}

source: Exits a Select block and transfers execution immediately to the statement following the End Select statement.
cs: Ukončí blok Select a okamžitě přenese provádění do příkazu za příkazem End Select.
de: Beendet einen Select-Block und überträgt die Ausführung direkt an die Anweisung nach der End Select-Anweisung.
es: Sale de un bloque Select y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la instrucción End Select.
fr: Quitte un bloc Select et transfère immédiatement l'exécution à l'instruction qui suit l'instruction End Select.
it: Esce da un blocco Select e trasferisce immediatamente l'esecuzione all'istruzione successiva all'istruzione End Select.
ja: Select ブロックを終了し、その実行を End Select ステートメントに続くステートメントに直ちに転送します。
ko: Select 블록을 끝내고 End Select 문 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza blok Select i natychmiast przenosi wykonanie do instrukcji następującej po instrukcji End Select.
pt_br: Sai de um bloco Select e transfere a execução imediatamente para a instrução após a instrução End Select.
ru: Выходит из блока Select и немедленно передает выполнение оператору после окончания процедуры End Select.
tr: Bir Select bloğundan çıkıp yürütmeyi End Select deyiminin sonrasındaki deyime hemen aktarır.
zh_hans: 退出 Select 块，并将执行过程立即转移到 End Select 语句后面的语句。
zh_hant: 結束 Select 區塊，並將執行立即轉移到接在 End Select 陳述式之後的陳述式。

source: Exits a Try block and transfers execution immediately to the statement following the End Try statement.
cs: Ukončí blok Try a okamžitě přenese provádění do příkazu za příkazem End Try.
de: Beendet einen Try-Block und überträgt die Ausführung direkt an die Anweisung nach der End Try-Anweisung.
es: Sale de un bloque Try y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la instrucción End Try.
fr: Quitte un bloc Try et transfère immédiatement l'exécution à l'instruction qui suit l'instruction End Try.
it: Esce da un blocco Try e trasferisce immediatamente l'esecuzione all'istruzione successiva all'istruzione End Try.
ja: Try ブロックを終了し、その実行を End Try ステートメントに続くステートメントに直ちに転送します。
ko: Try 블록을 끝내고 End Try 문 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza blok Try i natychmiast przenosi wykonanie do instrukcji następującej po instrukcji End Try.
pt_br: Sai de um bloco Try e transfere a execução imediatamente para a instrução após a instrução End Try.
ru: Выходит из блока Try и немедленно передает выполнение оператору после окончания процедуры End Try.
tr: Bir Try bloğundan çıkıp yürütmeyi End Try deyiminin sonrasındaki deyime hemen aktarır.
zh_hans: 退出 Try 块，并将执行过程立即转移到 End Try 语句后面的语句。
zh_hant: 結束 Try 區塊，將執行立即轉移到接在 End Try 陳述式之後的陳述式。
