Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Exits a While loop and transfers execution immediately to the statement following the End While statement.
cs: Ukončí smyčku While a okamžitě přenese provádění do příkazu za příkazem End While.
de: Beendet eine While-Schleife und überträgt die Ausführung direkt an die Anweisung nach der End While-Anweisung.
es: Sale de un bucle While y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la instrucción End While.
fr: Quitte une boucle While et transfère immédiatement l'exécution à l'instruction qui suit l'instruction End While.
it: Esce da un ciclo While e trasferisce immediatamente l'esecuzione all'istruzione successiva all'istruzione End While.
ja: While ループを終了し、その実行を End While ステートメントに続くステートメントに直ちに転送します。
ko: While 루프를 끝내고 End While 문 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza pętlę While i natychmiast przenosi wykonanie do instrukcji następującej po instrukcji End While.
pt_br: Sai de um loop While e transfere a execução imediatamente para a instrução após a instrução End While.
ru: Выходит из цикла While и немедленно передает выполнение оператору после окончания процедуры End While.
tr: Bir While döngüsünden çıkıp yürütmeyi End While deyiminin sonrasındaki deyime hemen aktarır.
zh_hans: 退出 While 循环，并将执行过程立即转移到 End While 语句后面的语句。
zh_hant: 結束 While 迴圈，將執行立即轉移到接在 End While 陳述式之後的陳述式。

source: When set to On, requires explicit declaration of all variables, using a Dim, Private, Public, or ReDim statement. Option Explicit {On | Off}
cs: Pokud je tato možnost zapnutá (On), vyžaduje explicitní deklaraci všech proměnných, pomocí příkazu Dim, Private, Public nebo ReDim. Option Explicit {On | Off}
de: Bei der Festlegung auf "On" ist eine explizite Deklaration aller Variablen mit der Anweisung "Dim", "Private", "Public" oder "ReDim" erforderlich. Option Explicit {On | Off}
es: Cuando se establece en On, requiere que se declaren explícitamente todas las variables mediante una instrucción Dim, Private, Public o ReDim. Option Explicit {On | Off}
fr: Lorsqu'il a la valeur On, il requiert une déclaration explicite de toutes les variables, à l'aide de l'instruction Dim, Private, Public ou ReDim. Option Explicit {On | Off}
it: Se impostato su On, richiede la dichiarazione esplicita di tutte le variabili tramite un'istruzione Dim, Private, Public o ReDim. Option Explicit {On | Off}
ja: On に設定されている場合は、Dim、Private、Public、または ReDim ステートメントを使用したすべての変数の明示的な宣言が必要です。 Option Explicit {On | Off}
ko: On으로 설정하면 Dim, Private, Public 또는 ReDim 문을 사용하여 모든 변수를 명시적으로 선언해야 합니다. Option Explicit {On | Off}
pl: Gdy ustawiono na wartość On, wymaga jawnej deklaracji wszystkich zmiennych, przy użyciu instrukcji Dim, Private, Public lub ReDim. Option Explicit {On | Off}
pt_br: Quando definido como Ativado, exige a declaração explícita de todas as variáveis, usando uma instrução Dim, Private, Public ou ReDim. Opção Explicit {On | Off}
ru: Если установлено значение On, требуется явное объявление всех переменных с использованием оператора Dim, Private, Public или ReDim. Option Explicit {On | Off}
tr: Etkin olarak ayarlandığında, tüm değişkenlerin kesinlikle bir Dim, Private, Public ya da ReDim deyimi kullanılarak bildirilmesini gerekli kılar. Option Explicit {On | Off}
zh_hans: 设置为 On 时，要求使用 Dim、Private、Public 或 ReDim 语句显式声明所有的变量。 Option Explicit {On | Off}
zh_hant: 若設定為 On，則必須使用 Dim、Private、Public 或 ReDim 陳述式，明確地宣告所有變數。 Option Explicit {On | Off}

source: Represents a Boolean value that fails a conditional test.
cs: Představuje logickou hodnotu, která neprojde podmíněným testem.
de: Stellt einen booleschen Wert dar, für den ein bedingter Test nicht erfolgreich durchgeführt wurde.
es: Representa un valor Boolean que no supera una prueba condicional.
fr: Représente une valeur Boolean qui ne réussit pas un test conditionnel.
it: Rappresenta un valore booleano che produce l'esito negativo di un test condizionale.
ja: 条件テストを満たさないブール値を表します。
ko: 조건 테스트에 실패하는 Boolean 값을 나타냅니다.
pl: Reprezentuje wartość logiczną niespełniającą testu warunkowego.
pt_br: Representa um valor Booleano que falha em um teste condicional.
ru: Представляет логическое значение, которое не проходит проверку условия.
tr: Koşul testinde başarısız olan bir Boolean değeri temsil eder.
zh_hans: 表示未通过条件测试的布尔值。
zh_hant: 代表條件測試失敗的布林值。

source: Introduces a statement block to be run before exiting a Try structure.
cs: Zavede blok příkazů, který se má spustit před ukončením struktury Try.
de: Führt einen Anweisungsblock ein, der vor dem Beenden einer Try-Struktur ausgeführt werden soll.
es: Introduce un bloque de instrucciones que se ejecuta antes de salir de una estructura Try.
fr: Introduit un bloc d'instructions à exécuter avant de quitter une structure Try.
it: Introduce un blocco di istruzioni da eseguire prima di uscire da una struttura Try.
ja: Try 構造を終了する前に実行されるステートメント ブロックを導入します。
ko: Try 구조체를 끝내기 전에 실행할 문 블록을 지정합니다.
pl: Wprowadza blok instrukcji do uruchomienia przed opuszczeniem struktury Try.
pt_br: Apresenta um bloco de instruções a ser executado antes de sair de uma estrutura Try.
ru: Вводит блок операторов, который будет запущен перед выходом из структуры Try.
tr: Try yapısından çıkmadan önce çalıştırılacak deyim bloğunu ortaya çıkarır.
zh_hans: 引入一个要在退出 Try 结构之前运行的语句块。
zh_hant: 引進結束 Try 結構之前，所要執行的陳述式區塊。

source: Introduces a loop that is repeated for each element in a collection.
cs: Zavede smyčku, která se opakuje pro každý element v kolekci.
de: Führt eine Schleife ein, die für jedes Element in einer Sammlung wiederholt wird.
es: Introduce un bucle que se repite para cada elemento de una colección.
fr: Introduit une boucle qui se répète pour chaque élément d'une collection.
it: Introduce un ciclo ripetuto per ciascun elemento in una raccolta.
ja: コレクション内の要素ごとに繰り返されるループを導入します。
ko: 컬렉션의 for each 요소에 대해 반복되는 루프를 지정합니다.
pl: Wprowadza pętlę powtarzaną dla każdego elementu w kolekcji.
pt_br: Introduz um loop que é repetido para cada elemento em uma coleção.
ru: Вводит цикл, который повторяется для каждого элемента коллекции.
tr: Bir koleksiyon içindeki her öğe için tekrar eden bir döngüyü ortaya çıkarır.
zh_hans: 引入一个针对集合中的每个元素重复的循环。
zh_hant: 引進為集合中每個元素重複運算的迴圈。

source: Introduces a loop that is iterated a specified number of times.
cs: Zavede smyčku, která se iteruje podle určeného počtu opakování.
de: Führt eine Schleife ein, die eine angegebene Anzahl von Iterationen durchläuft.
es: Introduce un bucle que se repite un número de veces especificado.
fr: Introduit une boucle qui est itérée un nombre spécifique de fois.
it: Introduce un ciclo iterato per un numero specificato di volte.
ja: 指定された回数反復されるループを導入します。
ko: 지정한 횟수만큼 반복되는 루프를 지정합니다.
pl: Wprowadza pętlę iterowaną określoną liczbę razy.
pt_br: Introduz um loop que é repetido um número especificado de vezes.
ru: Вводит цикл, который повторяется заданное число раз.
tr: Belirtilen sayı kadar yinelenen döngüyü ortaya çıkarır.
zh_hans: 引入一个迭代指定次数的循环。
zh_hant: 引進會重複指定次數的迴圈。

source: Identifies a list of values as a collection initializer
cs: Určuje seznam hodnot jako inicializátor kolekce.
de: Identifiziert eine Liste von Werten als Sammlungsinitialisierer.
es: Identifica una lista de valores como un inicializador de colección
fr: Identifie une liste de valeurs en tant qu'initialiseur de collection
it: Identifica un elenco di valori come inizializzatore di raccolta
ja: コレクション初期化子として値一覧を識別します
ko: 값 목록을 컬렉션 이니셜라이저로 식별합니다.
pl: Określa listę wartości jako inicjator kolekcji
pt_br: Identifica uma lista de valores como um inicializador de coleção
ru: Определяет список значений в качестве инициализатора набора.
tr: Koleksiyon başlatıcısı olarak bir değerler listesi tanımlar
zh_hans: 将值列表标识为集合初始值设定项
zh_hant: 將值的清單指定為集合初始設定式

source: Branches unconditionally to a specified line in a procedure.
cs: Rozvětví se nepodmíněně na určený řádek v proceduře.
de: Brancht ohne Bedingungen in eine angegebene Zeile in einer Prozedur.
es: Crea una rama a partir de la ejecución incondicionalmente a una línea especificada de un procedimiento.
fr: Crée une branche inconditionnelle vers une ligne spécifiée d'une procédure.
it: Crea un ramo senza condizioni in una riga specificata di una routine.
ja: プロシージャ内の指定した行に無条件に分岐します。
ko: 프로시저에 지정된 줄로 무조건 분기합니다.
pl: Przechodzi bezwarunkowo do określonego wiersza procedury.
pt_br: Branch incondicionalmente para uma linha especificada em um procedimento.
ru: Использует команду branch без ограничений относительно заданной строки в процедуре.
tr: Bir yordam içinde belirtilen satıra koşulsuz dallanır.
zh_hans: 无条件地分支到过程中的指定行。
zh_hant: 無條件分支到程序中的指定行。

source: Groups elements that have a common key.
cs: Seskupí elementy, které mají společný klíč.
de: Gruppiert Elemente mit einem gemeinsamen Schlüssel.
es: Agrupa los elementos que tienen una clave común.
fr: Regroupe les éléments qui ont une clé commune.
it: Raggruppa gli elementi con una chiave comune.
ja: 共通のキーを持つ要素をグループ化します。
ko: 공통 키를 포함된 요소를 그룹화합니다.
pl: Grupuje elementy, które mają wspólny klucz.
pt_br: Agrupa elementos que têm uma chave em comum.
ru: Группирует элементы, которые имеют общий ключ.
tr: Ortak anahtara sahip öğeleri gruplandırır.
zh_hans: 对具有公共键的元素进行分组。
zh_hant: 將具有共同索引鍵的元素分在一組。

source: Combines the elements of two sequences and groups the results. The join operation is based on matching keys.
cs: Sloučí elementy dvou sekvencí a seskupí výsledky. Operace spojení je založená na shodujících se klíčích.
de: Verbindet die Elemente in zwei Sequenzen und gruppiert die Ergebnisse. Der Beitrittsvorgang erfolgt auf Grundlage übereinstimmender Schlüssel.
es: Combina los elementos de dos secuencias y agrupa los resultados. La operación de unión se basa en las claves coincidentes.
fr: Combine les éléments de deux séquences et regroupe les résultats. L'opération de jointure est basée sur les clés correspondantes.
it: Combina gli elementi di due sequenze e raggruppa i risultati. L'operazione di unione è basata su chiavi corrispondenti.
ja: 2 つのシーケンスの要素を組み合わせて、結果をグループ化します。結合操作は一致するキーに基づきます。
ko: 두 시퀀스의 요소를 결합하고 결과를 그룹화합니다. 조인 연산은 일치하는 키를 기준으로 합니다.
pl: Łączy elementy dwóch sekwencji i grupuje wyniki. Operacja łączenia jest oparta na zgodności kluczy.
pt_br: Combina os elementos de duas sequências e agrupa os resultados. A operação de junção é baseada em chaves correspondentes.
ru: Объединяет элементы двух последовательностей и группирует результаты. Операция соединения основана на сопоставлении ключей.
tr: İki sıranın öğelerini birleştirir ve sonuçları gruplandırır. Birleştirme işlemi anahtarların eşleşmesi temeline göre yapılır.
zh_hans: 组合两个序列的元素并对结果进行分组。联接运算基于匹配键。
zh_hant: 結合兩個序列的元素，並將結果分組。聯結作業會以相符的索引鍵為依據。

source: Use 'Group' to specify that a group named '{0}' should be created.
cs: Příkazem Group určíte, že se má vytvořit skupina s názvem {0}.
de: Verwenden Sie "Group", um festzulegen, dass eine Gruppe namens "{0}" erstellt werden soll.
es: Use "Group" para especificar que se debería crear un grupo denominado "{0}".
fr: Utilisez 'Group' pour spécifier qu'un groupe nommé '{0}' doit être créé.
it: Usare 'Group' per specificare che è necessario creare un gruppo denominato '{0}'.
ja: Group' を使用して、'{0}' という名前のグループが作成されるように指定します。
ko: Group'을 사용하여 이름이 '{0}'인 그룹을 만들도록 지정합니다.
pl: Użyj słowa Group, aby utworzyć grupę o nazwie {0}.
pt_br: Use "Grupo" para especificar que um grupo nomeado "{0}" deve ser criado.
ru: Использовать "Group", чтобы указать, что должна быть создана группа под названием "{0}".
tr: {0}' adında bir grubun oluşturulması gerektiğini belirtmek için 'Group' kullanın.
zh_hans: 使用“Group”指定应当创建名为“{0}”的组。
zh_hant: Group' 可用以指定應建立名為 '{0}' 的群組。

source: Use 'Group' to specify that a group named 'Group' should be created.
cs: Příkazem Group určíte, že se má vytvořit skupina s názvem Group.
de: Verwenden Sie "Group", um festzulegen, dass eine Gruppe namens "Group" erstellt werden soll.
es: Use "Group" para especificar que se debería crear un grupo denominado "Group".
fr: Utilisez 'Group' pour spécifier qu'un groupe nommé 'Group' doit être créé.
it: Usare 'Group' per specificare che è necessario creare un gruppo denominato 'Group'.
ja: Group' を使用して、'Group' という名前のグループが作成されるように指定します。
ko: Group'을 사용하여 이름이 'Group'인 그룹을 만들도록 지정합니다.
pl: Użyj słowa Group, aby utworzyć grupę o nazwie Group.
pt_br: Use "Group" para especificar que um grupo nomeado "Group" deve ser criado.
ru: Использовать "Group", чтобы указать, что должна быть создана группа под названием "Group".
tr: Group' adında bir grubun oluşturulması gerektiğini belirtmek için 'Group' kullanın.
zh_hans: 使用“Group”指定应当创建名为“Group”的组。
zh_hant: Group' 可用以指定應建立名為 'Group' 的群組。

source: Conditionally compiles selected blocks of code, depending on the value of an expression.
cs: Podmíněně zkompiluje vybrané bloky kódu, a to v závislosti na hodnotě výrazu.
de: Kompiliert bedingt ausgewählte Codeblöcke, abhängig vom Wert eines Ausdrucks.
es: Compila condicionalmente bloques seleccionados de código en función del valor de una expresión.
fr: Effectue une compilation conditionnelle des blocs de code sélectionnés, en fonction de la valeur d'une expression.
it: Compila in base a determinate condizioni i blocchi di codice selezionati, a seconda del valore di un'espressione.
ja: 式の値に応じて、選択したコード ブロックを条件付きでコンパイルします。
ko: 식의 값에 따라 선택한 코드 블록을 조건부로 컴파일합니다.
pl: Kompiluje warunkowo wybrane bloki kodu w zależności od wartości wyrażenia.
pt_br: Compila condicionalmente blocos de código selecionados, dependendo do valor de uma expressão.
ru: Условно компилирует выбранные блоки кода в зависимости от значения выражения.
tr: Bir ifadenin değerine bağlı olarak seçili kod bloklarını koşullu biçimde derler.
zh_hans: 根据表达式的值有条件地编译选定的代码块。
zh_hant: 根據運算式的值，有條件地編譯選取的程式碼區塊。

source: Conditionally executes a group of statements, depending on the value of an expression.
cs: Podmíněně provede skupinu příkazů, a to v závislosti na hodnotě výrazu.
de: Führt bedingt eine Gruppe von Anweisungen aus, abhängig vom Wert eines Ausdrucks.
es: Ejecuta condicionalmente un grupo de instrucciones en función del valor de una expresión.
fr: Exécute un groupe d'instructions soumises à une condition, en fonction de la valeur d'une expression.
it: Esegue un gruppo di istruzioni in base a determinate condizioni, a seconda del valore di un espressione.
ja: 式の値に応じて、ステートメント グループを条件付きで実行します。
ko: 식의 값에 따라 문 그룹을 조건부로 실행합니다.
pl: Warunkowo wykonuje grupę instrukcji w zależności od wartości wyrażenia.
pt_br: Executa condicionalmente um grupo de instruções, dependendo do valor de uma expressão.
ru: Условно выполняет группу операторов в зависимости от значения выражения.
tr: Bir ifadenin değerine bağlı olarak bir deyim grubunu koşullu biçimde yürütür.
zh_hans: 根据表达式的值有条件地执行一组语句。
zh_hant: 根據運算式的值，有條件地執行陳述式群組。

source: When set to On, allows the use of local type inference in declaring variables. Option Infer {On | Off}
cs: Pokud je tato možnost zapnutá (On), umožňuje použití odvození místního typu v deklarujících proměnných. Option Infer {On | Off}
de: Bei der Festlegung auf "On" wird die Verwendung des lokalen Typrückschlusses beim Deklarieren von Variablen zugelassen. Option Infer {On | Off}
es: Cuando se establece en On, permite el uso de la inferencia de tipo de variable local al declarar las variables. Option Infer {On | Off}
fr: Lorsqu'il a la valeur On, il autorise l'utilisation d'une inférence de type locale lors de la déclaration de variables. Option Infer {On | Off}
it: Se impostata su On, consente l'uso dell'inferenza dei tipi locali nelle variabili dichiaranti. Option Infer {On | Off}
ja: On に設定されている場合は、変数の宣言においてローカル型の推論を使用できます。 Option Infer {On | Off}
ko: On으로 설정하면 변수를 선언할 때 지역 형식을 유추할 수 있습니다. Option Infer {On | Off}
pl: Gdy ustawiono na wartość On, pozwala na użycie wnioskowania o typie lokalnym przy deklaracji zmiennych. Option Infer {On | Off}
pt_br: Quando definido como Ativado, permite o uso de inferência de tipos locais ao declarar variáveis. Opção Infer {On | Off}
ru: Если установлено значение On, то возможно использование вывода локального типа в объявлении переменных. Option Infer {On | Off}
tr: Etkin olarak ayarlandığında, değişken bildiriminde yerel tür çıkarımı kullanımına izin verir. Option Infer {On | Off}
zh_hans: 设置为 On 时，允许在声明变量时使用局部类型推断。 Option Infer {On | Off}
zh_hant: 若設定為 On，則可以在宣告變數中使用區域類型推斷。 Option Infer {On | Off}

source: Specifies an identifier that can serve as a reference to the results of a join or grouping subexpression.
cs: Určuje identifikátor, který může sloužit jako odkaz na výsledky sjednocení nebo podvýrazu seskupování.
de: Gibt einen Bezeichner an, der als Verweis auf die Ergebnisse eines Unterausdrucks zum Verknüpfen oder Gruppieren verwendet werden kann.
es: Especifica un identificador que puede servir como referencia a los resultados de una subexpresión de unión o agrupación.
fr: Spécifie un identificateur qui peut servir de référence aux résultats d'une sous-expression de jointure ou de regroupement.
it: Specifica un identificatore che può fungere da riferimento ai risultati di una sottoespressione di join o di raggruppamento.
ja: 結合またはグループ化サブ式の結果への参照として使用できる識別子を指定します。
ko: 조인 또는 그룹화 하위 식의 결과에 대한 참조로 사용할 수 있는 식별자를 지정합니다.
pl: Określa identyfikator, który może służyć jako odwołanie do wyniku łączenia lub podwyrażenia grupującego.
pt_br: Especifica um identificador que pode servir como uma referência para os resultados de uma subexpressão de junção ou de agrupamento.
ru: Задает идентификатор, который может служить в качестве ссылки на результаты соединения или группировки части выражения.
tr: Birleştirme ya da gruplandırma alt ifadesinin sonuçlarına başvuru olarak hizmet edebilecek bir tanıtıcı belirtir.
zh_hans: 指定一个标识符来充当对联接或分组子表达式的结果的引用。
zh_hant: 指定可做為聯結或分組子運算式結果參考的識別項。

source: Combines the elements of two sequences. The join operation is based on matching keys.
cs: Kombinuje prvky dvou sekvencí. Operace sjednocení je založená na přiřazování shodných klíčů.
de: Verbindet die Elemente in zwei Sequenzen. Der Beitrittsvorgang erfolgt auf Grundlage übereinstimmender Schlüssel.
es: Combina los elementos de dos secuencias. La operación de unión se basa en las claves coincidentes.
fr: Combine les éléments de deux séquences. L'opération de jointure est basée sur les clés correspondantes.
it: Combina gli elementi di due sequenze. L'operazione di unione è basata su chiavi corrispondenti.
ja: 2 つのシーケンスの要素を組み合わせます。結合操作は一致するキーに基づきます。
ko: 두 시퀀스의 요소를 결합합니다. 조인 연산은 일치하는 키를 기준으로 합니다.
pl: Łączy elementy dwóch sekwencji. Operacja łączenia jest oparta na zgodności kluczy.
pt_br: Combina os elementos de duas sequências. A operação de junção é baseada em chaves correspondentes.
ru: Объединяет элементы двух последовательностей. Операция соединения основана на сопоставлении ключей.
tr: İki sıranın öğelerini birleştirir. Birleştirme işlemi anahtarların eşleşmesi temeline göre yapılır.
zh_hans: 组合两个序列的元素。联接运算基于匹配键。
zh_hant: 結合兩個序列的元素。聯結作業會以相符的索引鍵為依據。

source: Identifies a key field in an anonymous type definition.
cs: Identifikuje pole klíče v definici anonymního typu.
de: Gibt ein Schlüsselfeld in der Definition eines anonymen Typs an.
es: Identifica un campo de clave en una definición de tipo anónimo.
fr: Identifie un champ clé dans une définition de type anonyme.
it: Identifica un campo chiave in una definizione di tipo anonimo.
ja: 匿名型の定義のキー フィールドを識別します。
ko: 익명 형식 정의의 키 필드를 식별합니다.
pl: Identyfikuje pole kluczowe w definicji typu anonimowego.
pt_br: Identifica um campo de chave em uma definição de tipo anônimo.
ru: Определяет ключевое поле при анонимном определении типа.
tr: Bir anonim tür tanımında anahtar alanı tanımlar.
zh_hans: 标识匿名类型定义中的键字段。
zh_hant: 指出匿名類型定義中的索引鍵欄位。

source: Computes a value for each item in the query, and assigns the value to a new range variable.
cs: Vypočítá hodnotu pro každou položku v dotazu a přiřadí hodnotu nové proměnné rozsahu.
de: Berechnet einen Wert für jedes Element in der Abfrage und weist den Wert einer neuen Bereichsvariablen zu.
es: Calcula un valor para cada elemento de la consulta y lo asigna a una nueva variable de rango.
fr: Calcule une valeur pour chaque élément de la requête, puis assigne la valeur à une nouvelle variable de plage.
it: Calcola un valore per ogni elemento nella query e assegna il valore a una nuova variabile di intervallo.
ja: クエリ内の各項目の値をコンピューティングし、新しい範囲変数に値を割り当てます。
ko: 쿼리의 각 항목에 사용할 값을 계산한 후 해당 값을 새 범위 변수에 할당합니다.
pl: Oblicza wartość dla każdego elementu zapytania i przypisuje wartość do nowej zmiennej zakresu.
pt_br: Calcula um valor para cada item na consulta e atribui o valor a uma nova variável de intervalo.
ru: Вычисляет значение для каждого элемента запроса и присваивает значение новой переменной диапазона.
tr: Sorgudaki her öğe için bir değer hesaplar ve bu değeri yeni bir aralık değişkenine atar.
zh_hans: 为查询中的各项计算值，并将该值赋给新的范围变量。
zh_hant: 計算查詢中每個項目的值，並將值指派給新的範圍變數。

source: Terminates a loop that is introduced with a Do statement.
cs: Ukončuje smyčku, která je zavedená příkazem Do.
de: Beendet eine Schleife, die mit einer Do-Anweisung eingeführt wird.
es: Termina un bucle introducido con una instrucción Do.
fr: Termine une boucle introduite avec une instruction Do.
it: Termina un ciclo introdotto con un'istruzione Do.
ja: Do ステートメントで導入されるループを終了します。
ko: Do 문으로 지정한 루프를 종료합니다.
pl: Kończy pętlę rozpoczynającą się od instrukcji Do.
pt_br: Finaliza um loop que é introduzido com uma instrução Do.
ru: Завершает цикл, который вводится оператором Do.
tr: Do deyimi ile ortaya çıkarılmış bir döngüyü sonlandırır.
zh_hans: 终止 Do 语句引入的循环。
zh_hant: 結束利用 Do 陳述式所引進的迴圈。

source: Repeats a block of statements until a Boolean condition becomes true. Do...Loop Until <condition>
cs: Opakuje blok příkazů, dokud se logická podmínka nestane pravdivou. Do...Loop Until <podmínka>
de: Wiederholt einen Anweisungsblock, bis eine boolesche Bedingung erfüllt wird. Do...Loop Until <Bedingung>
es: Repite un bloque de instrucciones hasta que una condición Boolean pasa a ser true. Do...Loop Until <condición>
fr: Répète un bloc d'instructions jusqu'à ce qu'une condition Boolean devienne True. Do...Loop Until <condition>
it: Ripete un blocco di istruzioni fino a quando una condizione booleana non diventa True. Do...Loop Until <condizione>
ja: ブール条件が true になるまでステートメント ブロックを繰り返します。 Do...Loop Until <condition>
ko: Boolean 조건이 true가 될 때까지 문 블록을 반복합니다. Do...Loop Until <condition>
pl: Powtarza blok instrukcji do momentu, gdy zostanie spełniony warunek logiczny. Do...Loop Until <warunek>
pt_br: Repete um bloco de instruções até que uma condição Booleana se torne verdadeira. Do...Loop Until <condition>
ru: Повторяет блок операторов, когда логическое условие становится истинно. Do...Loop Until <condition>
tr: Bir Boolean koşulu true olana kadar bir deyimler bloğunu tekrar eder. Do...Loop Until <condition>
zh_hans: 在布尔条件变为 true 之前重复语句块。 Do...Loop Until <condition>
zh_hant: 持續重複陳述式區塊，直到布林條件變成 True 為止。 Do...Loop Until <condition>
