Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Declares a reference to a procedure implemented in an external file.
cs: Deklaruje odkaz na proceduru implementovanou v externím souboru.
de: Deklariert einen Verweis auf eine Prozedur, die in einer externen Datei implementiert ist.
es: Declara una referencia a un procedimiento implementado en un archivo externo.
fr: Déclare une référence à une procédure implémentée dans un fichier externe.
it: Dichiara un riferimento a una routine implementata in un file esterno.
ja: 外部ファイルに実装されているプロシージャへの参照を宣言します。
ko: 외부 파일에 구현된 프로시저에 대한 참조를 선언합니다.
pl: Deklaruje odwołanie do procedury zaimplementowanej w zewnętrznym pliku.
pt_br: Declara uma referência a um procedimento implementado em um arquivo externo.
ru: Объявляет ссылку на процедуру, реализованную во внешнем файле.
tr: Bir dış dosya içinde uygulanmış yordama başvuru bildirir.
zh_hans: 声明一个对外部文件中所实现过程的引用。
zh_hant: 宣告實作在外部檔案中之程序的參考。

source: Identifies a property as the default property of its class, structure, or interface.
cs: Identifikuje vlastnost jako výchozí vlastnost své třídy, struktury nebo rozhraní.
de: Gibt eine Eigenschaft als Standardeigenschaft ihrer Klasse, Struktur oder Schnittstelle an.
es: Identifica una propiedad como la propiedad predeterminada de su clase, estructura o interfaz.
fr: Identifie une propriété en tant que propriété par défaut de sa classe, structure ou interface.
it: Identifica una proprietà come proprietà predefinita della relativa classe, struttura o interfaccia.
ja: クラス、構造体、またはインターフェイスの既定のプロパティとしてプロパティを識別します。
ko: 속성을 클래스, 구조체 또는 인터페이스의 기본 속성으로 식별합니다.
pl: Identyfikuje właściwość jako domyślną właściwość klasy, struktury lub interfejsu.
pt_br: Identifica uma propriedade como a propriedade padrão da sua classe, estrutura ou interface.
ru: Определяет свойство как свойство по умолчанию для класса, структуры или интерфейса.
tr: Sınıf, yapı ya da arabirim için varsayılan özelliği tanımlar.
zh_hans: 将一个属性标识为其类、结构或接口的默认属性。
zh_hant: 找出為其類別、結構或介面之預設屬性的屬性。

source: Used to declare a delegate. A delegate is a reference type that refers to a shared method of a type or to an instance method of an object. Any procedure that is convertible, or that has matching parameter types and return type may be used to create an instance of this delegate class.
cs: Používá se pro deklaraci delegáta. Delegát je odkazový typ, který odkazuje na sdílenou metodu typu nebo na instanční metodu objektu. Každá procedura, která je převoditelná nebo která má shodné typy parametrů a návratový typ, se může použít pro vytvoření instance této třídy delegáta.
de: Wird zum Deklarieren eines Delegaten verwendet. Bei einem Delegaten handelt es sich um einen Referenztyp, der auf eine freigegebene Methode eines Typs oder auf eine Instanzmethode eines Objekts verweist. Zum Erstellen einer Instanz dieser Delegatklasse kann jede konvertierbare Prozedur oder jede Prozedur verwendet werden, deren Parameter- und Rückgabetypen übereinstimmen.
es: Se utiliza para declarar un delegado. Un delegado es un tipo de referencia a un método compartido de un tipo o a un método de instancia de un objeto. Para crear una instancia de esta clase delegada se puede utilizar cualquier procedimiento que se pueda convertir o que tenga tipos de parámetros coincidentes y un tipo de valor devuelto.
fr: Permet de déclarer un délégué. Un délégué est un type référence qui fait référence à une méthode partagée d'un type ou à une méthode d'instance d'un objet. Toute procédure susceptible d'être convertie, ou ayant des types de paramètres et un type de retour correspondants, peut être utilisée pour créer une instance de cette classe déléguée.
it: Usata per dichiarare un delegato. Un delegato è un tipo riferimento che fa riferimento a un metodo condiviso di un tipo o a un metodo di istanza di un oggetto. Qualsiasi routine convertibile o che abbia tipi di parametro corrispondenti e tipi restituiti può essere usata per creare un'istanza di questa classe delegata.
ja: デリゲートの宣言に使用します。デリゲートとは、型の共有メソッドまたはオブジェクトのインスタンス メソッドを参照する参照型です。変換可能なプロシージャ、またはパラメーターの型と戻り値の型が一致するプロシージャを使用して、このデリゲート クラスのインスタンスを作成できます。
ko: 대리자를 선언하는 데 사용됩니다. 대리자는 형식의 공유 메서드 또는 개체의 인스턴스 메서드를 참조하는 참조 형식입니다. 변환 가능한 프로시저 또는 일치하는 매개 변수 형식과 반환 형식이 있는 프로시저는 이 대리자 클래스의 인스턴스를 만드는 데 사용할 수 있습니다.
pl: Używane do deklarowania delegatu. Delegat jest typem referencyjnym, który odwołuje się do udostępnionych metod typu lub metod wystąpień obiektu. Każda procedura podlegająca konwersji lub mająca zgodne typy parametrów i typ zwracany może być użyta do utworzenia wystąpienia tej klasy delegatu.
pt_br: Usado para declarar um delegado. Um delegado é um tipo de referência que refere-se a um método compartilhado de um tipo ou a um método de instância de um objeto. Qualquer procedimento que é conversível ou que tenha tipos de parâmetro e tipo de retorno correspondentes podem ser usados para criar uma instância desta classe delegate.
ru: Используется для объявления делегата. Делегат — это ссылочный тип, который ссылается на общий метод типа или метод экземпляра объекта. Любая процедура, которая является конвертируемой или имеет соответствующие типы параметров и возвращаемый тип, может быть использована для создания экземпляра этого класса делегата.
tr: Temsilci bildirimi için kullanılır. Temsilci bir başvuru türüdür; bir türün paylaşılan bir yöntemine ya da bir nesnenin yöntem örneğine başvurur. Dönüştürülebilen ya da eşleşen parametre türlerine ve dönüş türüne sahip her yordam, bu temsilci sınıfı örneğini oluşturmak için kullanılabilir.
zh_hans: 用于声明委托。委托是引用某一类型的共享方法或某一对象的实例方法的引用类型。任何可转换的过程或具有匹配参数类型和返回类型的过程均可用于创建此委托类的实例。
zh_hant: 用於宣告委派。委派是一種參考類型，其會參考類型的共用方法，或物件的執行個體方法。任何可轉換的程序，或是參數類型與傳回類型相符的程序，都可用以建立此委派類別的執行個體。

source: Declares and allocates storage space for one or more variables. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
cs: Deklaruje a přiděluje místo pro uložení nejmíň jedné proměnné. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
de: Deklariert eine oder mehrere Variablen und weist Speicherplatz zu. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
es: Declara y asigna espacio de almacenamiento para una o varias variables. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
fr: Déclare et alloue de l'espace de stockage pour une ou plusieurs variables. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
it: Dichiara e alloca spazio di archiviazione per una o più variabili. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
ja: 記憶域を宣言し、1 つ以上の変数に割り当てます。 Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
ko: 하나 이상의 변수에 사용할 스토리지 공간을 선언하고 할당합니다. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
pl: Deklaruje i alokuje magazyn przechowywania dla co najmniej jednej zmiennej. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
pt_br: Declara e aloca espaço de armazenamento para uma ou mais variáveis. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
ru: Объявляет и выделяет область хранения для одной или нескольких переменных. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
tr: Bir veya daha fazla değişken için depolama alanı bildirir ve ayırır. Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
zh_hans: 为一个或多个变量声明和分配存储空间。 Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]
zh_hant: 宣告一或多個變數，並為其配置儲存空間。 Dim {<var> [As [New] dataType [(boundList)]][= initializer]}[, var2]

source: Divides two numbers and returns a floating-point result.
cs: Vydělí dvě čísla a vrátí výsledek s plovoucí desetinnou čárkou.
de: Dividiert zwei Zahlen und gibt ein Gleitkommaergebnis zurück.
es: Divide dos números y devuelve un resultado de coma flotante.
fr: Effectue la division de deux nombres et retourne un résultat à virgule flottante.
it: Divide due numeri e restituisce un risultato a virgola mobile.
ja: 2 つの数値を除算して、浮動小数点の結果を返します。
ko: 두 수를 나누고 부동 소수점 결과를 반환합니다.
pl: Dzieli dwie liczby i zwraca wynik zmiennoprzecinkowy.
pt_br: Divide dois números e retorna um resultado de ponto flutuante.
ru: Делит два числа и возвращает результат с плавающей точкой.
tr: İki sayıyı böler ve kayan noktalı bir sonuç döndürür.
zh_hans: 使两个数字相除，返回浮点结果。
zh_hant: 將兩個數值相除，傳回浮點結果。

source: Terminates a {0} block.
cs: Ukončí blok {0}.
de: Beendet einen {0}-Block.
es: Termina un bloque {0}.
fr: Termine un bloc {0}.
it: Termina un blocco {0}.
ja: {0} ブロックを終了します。
ko: {0} 블록을 종료합니다.
pl: Kończy blok {0}.
pt_br: Finaliza um bloco {0}.
ru: Заканчивает блок {0}.
tr: Bir {0} bloğunu sonlandırır.
zh_hans: 终止 {0} 块。
zh_hant: 結束 {0} 區塊。

source: Terminates an {0} block.
cs: Ukončí blok {0}.
de: Beendet einen {0}-Block.
es: Termina un bloque {0}.
fr: Termine un bloc {0}.
it: Termina un blocco {0}.
ja: {0} ブロックを終了します。
ko: {0} 블록을 종료합니다.
pl: Kończy blok {0}.
pt_br: Finaliza um bloco {0}.
ru: Заканчивает блок {0}.
tr: Bir {0} bloğunu sonlandırır.
zh_hans: 终止 {0} 块。
zh_hant: 結束 {0} 區塊。

source: Terminates the definition of a {0} statement.
cs: Ukončí definici příkazu {0}.
de: Beendet die Definition einer {0}-Anweisung.
es: Termina la definición de una instrucción {0}.
fr: Termine la définition d'une instruction {0}.
it: Termina la definizione di un'istruzione {0}.
ja: {0} ステートメントの定義を終了します。
ko: {0} 문의 정의를 종료합니다.
pl: Kończy definicję instrukcji {0}.
pt_br: Finaliza a definição de uma instrução {0}.
ru: Завершает определение оператора {0}.
tr: Bir {0} deyiminin tanımını sonlandırır.
zh_hans: 终止 {0} 语句的定义。
zh_hant: 結束 {0} 陳述式的定義。

source: Terminates the definition of an {0} statement.
cs: Ukončí definici příkazu {0}.
de: Beendet die Definition einer {0}-Anweisung.
es: Termina la definición de una instrucción {0}.
fr: Termine la définition d'une instruction {0}.
it: Termina la definizione di un'istruzione {0}.
ja: {0} ステートメントの定義を終了します。
ko: {0} 문의 정의를 종료합니다.
pl: Kończy definicję instrukcji {0}.
pt_br: Finaliza a definição de uma instrução {0}.
ru: Завершает определение оператора {0}.
tr: Bir {0} deyiminin tanımını sonlandırır.
zh_hans: 终止 {0} 语句的定义。
zh_hant: 結束 {0} 陳述式的定義。

source: Declares an enumeration and defines the values of its members.
cs: Deklaruje výčet a definuje hodnoty jeho členů.
de: Deklariert eine Enumeration und definiert die Werte ihrer Member.
es: Declara una enumeración y define los valores de sus miembros.
fr: Déclare une énumération et définit les valeurs de ses membres.
it: Dichiara un'enumerazione e definisce i valori dei relativi membri.
ja: 列挙体を宣言し、そのメンバーの値を定義します。
ko: 열거형을 선언하고 열거형의 멤버 값을 정의합니다.
pl: Deklaruje wyliczenie i definiuje wartości jego składowych.
pt_br: Declara uma enumeração e define os valores de seus membros.
ru: Объявляет перечисление и определяет значения его членов.
tr: Bir sabit listesi bildirir ve üyelerinin değerlerini tanımlar.
zh_hans: 声明枚举并定义其成员的值。
zh_hant: 宣告列舉，並定義其成員的值。

source: Compares two expressions and returns True if they are equal. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud jsou stejné. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn sie gleich sind. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si son iguales. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si elles sont égales. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se sono uguali. In caso contrario, restituisce False.
ja: 2 つの式を比較し、両者が等しい場合は True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 같으면 True를 반환하고, 같지 않으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli są równe. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se forem iguais. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если они равны. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve bu iki ifade eşitse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果相等则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若兩者相等，即傳回 True; 否則傳回 False。

source: Used to release array variables and deallocate the memory used for their elements.
cs: Používá se pro uvolnění proměnných pole a navrácení paměti používané pro jejich elementy.
de: Wird zum Freigeben von Arrayvariablen und zum Freigeben des Speicherplatzes für ihre Elemente verwendet.
es: Se utiliza para liberar variables de matriz y anular la asignación de la memoria utilizada para sus elementos.
fr: Sert à libérer des variables tableau ainsi que la mémoire utilisée pour leurs éléments.
it: Usata per rilasciare le variabili di matrice e deallocare la memoria usata per i relativi elementi.
ja: 配列変数を解放し、それらの要素に使用されるメモリの割り当てを解除します。
ko: 배열 변수를 해제하고 해당 요소에 사용되는 메모리 할당을 해제하는 데 사용됩니다.
pl: Używane do zwalniania zmiennych tablicowych i cofnięcia przydzielenia pamięci używanej dla elementów tablicy.
pt_br: Usado para liberar variáveis de matriz e desalocar a memória usada para seus elementos.
ru: Используется для выпуска переменных массива и освобождения памяти, используемой для их элементов.
tr: Dizi değişkenlerini serbest bırakmak ve öğeleri tarafından kullanılan belleği geri vermek için kullanılır.
zh_hans: 用于释放数组变量，和解除分配用于其元素的内存。
zh_hant: 用以釋放陣列變數，並取消配置其元素所使用的記憶體。

source: Declares a user-defined event.
cs: Deklaruje uživatelem definovanou událost.
de: Deklariert ein benutzerdefiniertes Ereignis.
es: Declara un evento definido por el usuario.
fr: Déclare un événement défini par l'utilisateur.
it: Dichiara un evento definito dall'utente.
ja: ユーザー定義イベントを宣言します。
ko: 사용자 정의된 이벤트를 선언합니다.
pl: Deklaruje zdarzenie zdefiniowane przez użytkownika.
pt_br: Declara um evento definido pelo usuário.
ru: Объявляет пользовательское событие.
tr: Kullanıcı tanımlı bir olay bildirir.
zh_hans: 声明用户定义的事件。
zh_hant: 宣告使用者定義的事件。

source: Exits a Sub procedure and transfers execution immediately to the statement following the call to the Sub procedure.
cs: Ukončí proceduru Sub a okamžitě přenese provádění do příkazu za voláním procedury Sub.
de: Beendet eine Sub-Prozedur und überträgt die Ausführung direkt an die Anweisung nach dem Aufruf der Sub-Prozedur.
es: Sale de un procedimiento Sub y transfiere la ejecución inmediatamente a la instrucción que aparece detrás de la llamada al procedimiento Sub.
fr: Quitte une procédure Sub et transfère immédiatement l'exécution à l'instruction qui suit l'appel de la procédure Sub.
it: Esce da una routine Sub e trasferisce immediatamente l'esecuzione all'istruzione successiva alla chiamata alla routine Sub.
ja: Sub プロシージャを終了し、その実行を Sub プロシージャへの呼び出しに続くステートメントに直ちに転送します。
ko: Sub 프로시저를 끝내고 Sub 프로시저 호출 다음에 오는 문으로 실행을 즉시 이동합니다.
pl: Opuszcza procedurę Sub i natychmiast przenosi wykonanie do instrukcji następującej po wywołaniu procedury Sub.
pt_br: Sai de um procedimento Sub e transfere a execução imediatamente para a instrução após a chamada ao procedimento Sub.
ru: Выходит из процедуры Sub и немедленно передает выполнение оператору после окончания процедуры Sub.
tr: Bir Alt yordamdan çıkıp yürütmeyi Alt yordam çağrısının sonrasındaki deyime hemen aktarır.
zh_hans: 退出 Sub 过程，并将执行过程立即转移到该 Sub 过程调用后面的语句。
zh_hant: 結束 Sub 程序，並將執行立即轉移到接在 Sub 程序呼叫之後的陳述式。

source: Raises a number to the power of another number.
cs: Umocní číslo na mocninu určenou jiným číslem.
de: Potenziert eine Zahl mit einer anderen Zahl.
es: Eleva un número a la potencia de otro número.
fr: Élève un nombre à la puissance d'un autre nombre.
it: Eleva un numero alla potenza di un altro numero.
ja: 数値を別の数値のべき乗値に指定します。
ko: 특정 수를 다른 수의 승수로 거듭제곱합니다.
pl: Podnosi liczbę do potęgi określonej przez inną liczbę.
pt_br: Eleva um número à potência de outro número.
ru: Возводит число в степень другого числа.
tr: Bir sayıyı, başka bir sayı ile üst alma işlemine sokar.
zh_hans: 以一个数字为底、另一数字为幂求值。
zh_hant: 將數字的次方指定為另一個數字。

source: Specifies that the external procedure being referenced in the Declare statement is a Function.
cs: Určuje, že externí procedura, na kterou se odkazuje v příkazu Declare, je Function.
de: Gibt an, dass es sich bei der externen Prozedur, auf die in der Declare-Anweisung verwiesen wird, um eine Function handelt.
es: Especifica que el procedimiento externo al que se hace referencia en la instrucción Declare es un procedimiento Function.
fr: Spécifie que la procédure externe référencée dans l'instruction Declare est une procédure Function.
it: Specifica che la routine esterna a cui si fa riferimento nell'istruzione Declare è Function.
ja: Declare ステートメントで参照されている外部プロシージャが Function であることを指定します。
ko: Declare 문에서 참조하는 외부 프로시저가 Function임을 지정합니다.
pl: Określa, że procedura zewnętrzna, do której istnieje odwołanie w instrukcji Declare, jest funkcją.
pt_br: Especifica se o procedimento externo sendo referenciado na instrução Declare é uma Função.
ru: Указывает, что внешняя процедура, на которую ссылается оператор Declare, является Function.
tr: Declare deyimi içinde başvurulan dış yordamın bir İşlev olduğunu belirtir.
zh_hans: 指定 Declare 语句中所引用的外部过程是 Function 过程。
zh_hant: 指定 Declare 陳述式中所參考的外部程序是 Function。

source: Specifies that the external procedure being referenced in the Declare statement is a Sub.
cs: Určuje, že externí procedura, na kterou se odkazuje v příkazu Declare, je Sub.
de: Gibt an, dass es sich bei der externen Prozedur, auf die in der Declare-Anweisung verwiesen wird, um ein Sub handelt.
es: Especifica que el procedimiento externo al que se hace referencia en la instrucción Declare es un procedimiento Sub.
fr: Spécifie que la procédure externe référencée dans l'instruction Declare est une procédure Sub.
it: Specifica che la routine esterna a cui si fa riferimento nell'istruzione Declare è Sub.
ja: Declare ステートメントで参照されている外部プロシージャを Sub として指定します。
ko: Declare 문에서 참조하는 외부 프로시저가 Sub임을 지정합니다.
pl: Określa, że procedura zewnętrzna, do której istnieje odwołanie w instrukcji Declare, jest podprocedurą Sub.
pt_br: Especifica se o procedimento externo sendo referenciado na instrução Declare é um Sub.
ru: Указывает, что внешняя процедура, на которую ссылается оператор Declare, является Sub.
tr: Declare deyimi içinde başvurulan dış yordamın bir Alt Yordam olduğunu belirtir.
zh_hans: 指定 Declare 语句中所引用的外部过程是 Sub 过程。
zh_hant: 指定 Declare 陳述式中所參考的外部程序是 Sub。

source: Specifies that one or more declared programming elements are accessible only from within the assembly that contains their declaration.
cs: Určuje, že nejmíň jeden deklarovaný programovací element je přístupný jen ze sestavení, které obsahuje jeho deklaraci.
de: Gibt an, dass auf ein oder mehrere deklarierte Programmierelemente nur aus der Assembly mit der Deklaration zugegriffen werden kann.
es: Especifica que solo se puede obtener acceso a uno o varios elementos de programación declarados desde dentro del ensamblado que contiene su declaración.
fr: Spécifie qu'un ou plusieurs éléments de programmation déclarés sont accessibles uniquement à partir de l'assembly qui contient leur déclaration.
it: Specifica che uno o più elementi di programmazione sono accessibili solo dall'assembly che ne contiene la dichiarazione.
ja: 1 つ以上の宣言されたプログラミング要素が、その宣言を含むアセンブリ内からのみアクセス可能であることを示します。
ko: 프로그래밍 요소를 선언한 어셈블리에서만 해당 프로그래밍 요소를 하나 이상 액세스할 수 있도록 지정합니다.
pl: Określa, że jeden lub więcej zadeklarowanych elementów programistycznych jest dostępny tylko w obrębie zestawu, który zawiera jego deklarację.
pt_br: Especifica que um ou mais elementos de programação declarados são acessíveis somente a partir de dentro do assembly que contém sua declaração.
ru: Указывает, что один или несколько объявленных программных элементов доступны только внутри сборки, которая содержит объявление.
tr: Bir ya da daha fazla bildirilmiş programlama öğesine, sadece bildirimlerini içeren derleme içinden erişilebileceğini belirtir.
zh_hans: 指定只能从包含其声明的程序集内部来访问一个或多个所声明的编程元素。
zh_hant: 指定一或多個宣告的程式設計元素，只能從包含其宣告的組件加以存取。

source: Specifies a collection and a range variable to use in a query.
cs: Určuje kolekci a proměnnou rozsahu, která se má použít v dotazu.
de: Gibt eine Sammlung und eine Bereichsvariable für die Verwendung in einer Abfrage an.
es: Especifica una colección y una variable de rango que se utiliza en una consulta.
fr: Spécifie une collection et une variable de plage à utiliser dans une requête.
it: Specifica una raccolta e una variabile di intervallo da usare in una query.
ja: クエリで使用するコレクションと範囲変数を指定します。
ko: 쿼리에 사용할 컬렉션과 범위 변수를 지정합니다.
pl: Określa kolekcję i zmienną zakresu do używania w zapytaniu.
pt_br: Especifica uma coleção e uma variável de intervalo para usar em uma consulta.
ru: Определяет коллекцию и переменную диапазона для использования в запросе.
tr: Bir sorgu içinde kullanılacak koleksiyon ve aralık değişkenini belirtir.
zh_hans: 指定要用在查询中的集合及范围变量。
zh_hant: 指定查詢中所使用的集合與範圍變數。

source: Declares the name, parameters, and code that define a Function procedure, that is, a procedure that returns a value to the calling code.
cs: Deklaruje název, parametry a kód, které definují proceduru Function, tzn. proceduru, která vrací hodnotu volajícímu kódu.
de: Deklariert den Namen, die Parameter und den Code, mit denen eine Function-Prozedur definiert wird, d. h. eine Prozedur, die einen Wert an den aufrufenden Code zurückgibt.
es: Declara el nombre, los parámetros y el código que definen un procedimiento Function, es decir, un procedimiento que devuelve un valor al código de llamada.
fr: Déclare le nom, les paramètres et le code qui définissent une procédure Function, en d'autres termes, une procédure qui retourne une valeur au code appelant.
it: Dichiara il nome, i parametri e il codice che definiscono una routine Function, ovvero una routine che restituisce un valore al codice chiamante.
ja: Function プロシージャ (呼び出し元のコードに値を返すプロシージャ) を定義する名前、パラメーター、コードを宣言します。
ko: 호출 코드에 값을 반환하는 Function 프로시저를 정의하는 이름, 매개 변수 및 코드를 선언합니다.
pl: Deklaruje nazwę, parametry i kod, który definiuje procedurę Function, tj. procedurę zwracającą wartość do wywołującego kodu.
pt_br: Declara o nome, parâmetros e código que definem um procedimento Function, ou seja, um procedimento que retorna um valor para o código de chamada.
ru: Объявляет имя, параметры и код, которые определяют процедуру Function, то есть процедуру, которая возвращает значение вызывающему коду.
tr: Bir Function yordamını (çağrıldığı koda bir değer döndüren yordam) tanımlayan adı, parametreleri ve kodu bildirir.
zh_hans: 声明用于定义 Function 过程(即，将值返回到调用代码的过程)的名称、参数和代码。
zh_hant: 宣告定義 Function 程序的名稱、參數與程式碼; 也就是説，這種程序會對呼叫的程式碼傳回值。
