Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Compares two object reference variables and returns True if the objects are equal. <result> = <object1> Is <object2>
cs: Porovná dvě proměnné odkazu na objekt a vrátí True, pokud se objekty rovnají. <výsledek> = <objekt1> Is <objekt2>
de: Vergleicht zwei Objektverweisvariablen und gibt True zurück, wenn die Objekte gleich sind. <Ergebnis> = <Objekt1> Is <Objekt2>
es: Compara dos variables de referencia de objetos y devuelve True si los objetos son iguales. <resultado> = <objeto1> Is <objeto2>
fr: Compare deux variables de référence d'objet et retourne True si les objets sont équivalents. <result> = <object1> Is <object2>
it: Confronta due variabili di riferimento a oggetti e restituisce True se gli oggetti sono uguali. <risultato> = <oggetto1> Is <oggetto2>
ja: 2 つのオブジェクト参照変数を比較し、オブジェクトが等しい場合は True を返します <result> = <object1> Is <object2>
ko: 두 개체 참조 변수를 비교하여 개체가 같은 경우 True를 반환합니다. <result> = <object1> Is <object2>
pl: Porównuje dwie zmienne odwołujące się do obiektu i zwraca wartość True, jeśli obiekty są równe. <wynik> = <obiekt1> Is <obiekt2>
pt_br: Compara duas variáveis de referência de objeto e retorna Verdadeiro se os objetos forem iguais. <result> = <object1> Is <object2>
ru: Сравнивает две переменные объектной ссылки и возвращает True, если они равны. <result> = <object1> Is <object2>
tr: İki nesne başvurusu değişkenini karşılaştırır, eğer nesneler eşitse True değer döndürür. <result> = <object1> Is <object2>
zh_hans: 对两个对象引用变量进行比较，如果这两个对象相等，则返回 True。 <result> = <object1> Is <object2>
zh_hant: 比較兩個物件參考變數，若物件相等，即傳回 True。 <result> = <object1> Is <object2>

source: Compares two object reference variables and returns True if the objects are not equal. <result> = <object1> IsNot <object2>
cs: Porovná dvě proměnné odkazu na objekt a vrátí True, pokud se objekty nerovnají. <výsledek> = <objekt1> IsNot <objekt2>
de: Vergleicht zwei Objektverweisvariablen und gibt True zurück, wenn die Objekte nicht gleich sind. <Ergebnis> = <Objekt1> IsNot <Objekt2>
es: Compara dos variables de referencia de objetos y devuelve True si los objetos no son iguales. <resultado> = <objeto1> IsNot <objeto2>
fr: Compare deux variables de référence d'objet et retourne True si les objets ne sont pas équivalents. <result> = <object1> IsNot <object2>
it: Confronta due variabili di riferimento a oggetti e restituisce True se gli oggetti non sono uguali. <risultato> = <oggetto1> IsNot <oggetto2>
ja: 2 つのオブジェクト参照変数を比較し、オブジェクトが等しくない場合は True を返します <result> = <object1> IsNot <object2>
ko: 두 개체 참조 변수를 비교하여 개체가 다르면 True를 반환합니다. <result> = <object1> IsNot <object2>
pl: Porównuje dwie zmienne odwołujące się do obiektu i zwraca wartość True, jeśli obiekty nie są równe. <wynik> = <obiekt1> IsNot <obiekt2>
pt_br: Compara duas variáveis de referência de objeto e retorna Verdadeiro se os objetos não forem iguais. <result> = <object1> IsNot <object2>
ru: Сравнивает две переменные объектной ссылки и возвращает значение True, если они не равны. <result> = <object1> IsNot <object2>
tr: İki nesne başvurusu değişkenini karşılaştırır, eğer nesneler eşit değilse True değer döndürür. <result> = <object1> IsNot <object2>
zh_hans: 对两个对象引用变量进行比较，如果这两个对象不相等，则返回 True。 <result> = <object1> IsNot <object2>
zh_hant: 比較兩個物件參考變數，若物件不相等，即傳回 True。 <result> = <object1> IsNot <object2>

source: Determines whether an expression is true. If instances of any class or structure will be used in an OrElse clause, you must define IsTrue on that class or structure.
cs: Vyhodnotí, jestli je výraz pravdivý. Pokud se instance libovolné třídy nebo struktury použijí v klauzuli OrElse, musíte definovat v této třídě nebo struktuře operátor IsTrue.
de: Bestimmt, ob ein Ausdruck wahr ist. Wenn in einer OrElse-Klausel Instanzen einer beliebigen Klasse oder Struktur verwendet werden, müssen Sie "IsTrue" für diese Klasse oder Struktur definieren.
es: Determina si una expresión es true. Si se van a utilizar instancias de alguna clase o estructura en una cláusula OrElse, debe definir IsTrue en esa clase o estructura.
fr: Détermine si une expression a la valeur True. Si les instances d'une classe ou d'une structure sont utilisées dans une clause OrElse, vous devez définir IsTrue dans cette classe ou structure.
it: Determina se un'espressione è True. Se istanze di una qualunque classe o struttura verranno usate in una clausola OrElse, è necessario definire IsTrue nella classe o struttura.
ja: 式が true であるかどうかを判断します。クラスまたは構造体のインスタンスが OrElse 句で使用される場合は、そのクラスまたは構造体で IsTrue を定義する必要があります。
ko: 식이 true인지 확인합니다. 클래스 또는 구조체의 인스턴스가 OrElse 절에 사용되면 해당 클래스 또는 구조체에서 IsTrue를 정의해야 합니다.
pl: Określa, czy wyrażenie jest prawdziwe. Jeśli w klauzuli OrElse będą używane wystąpienia klasy lub struktury, należy dla tej klasy lub struktury zdefiniować operator IsTrue.
pt_br: Determina se uma expressão é verdadeira. Se instâncias de qualquer classe ou estrutura forem usadas em uma cláusula OrElse, você deve definir IsTrue nessa classe ou estrutura.
ru: Определяет, является ли выражение истинным. Если экземпляры любого класса или структуры будут использоваться в предложении OrElse, необходимо определить IsTrue для этого класса или структуры.
tr: Bir ifadenin true olup olmadığını belirler. Eğer herhangi bir sınıfın veya yapının örneği bir OrElse yan tümcesi içinde kullanılacaksa, bu sınıf ya da yapı üzerinde IsTrue tanımlamalısınız.
zh_hans: 确定表达式是否为 true。如果将在 OrElse 子句中使用任何类或结构的实例，则必须在该类或结构上定义 IsTrue。
zh_hant: 判斷運算式是否為 True。若在 OrElse 子句會出現任何類別或結構，則必須在該類別或結構上定義 IsTrue。

source: Indicates an iterator method that can use the Yield statement.
cs: Označuje iterační metodu, která může použít operátor Yield.
de: Weist auf eine Iteratormethode hin, welche die Yield-Anweisung verwenden kann.
es: Indica un método Iterator que puede usar la instrucción Yield.
fr: Indique une méthode Iterator pouvant utiliser l'instruction Yield.
it: Indica un metodo iteratore che può usare l'istruzione Yield.
ja: Yield ステートメントを使用できる反復子メソッドを示します。
ko: Yield 문을 사용할 수 있는 반복기 메서드를 나타냅니다.
pl: Wskazuje metodę iteratora mogącą użyć instrukcji Yield.
pt_br: Indica um método iterador que pode usar a instrução Yield.
ru: Определяет итератор для метода, который может использовать оператор Yield.
tr: Yield ifadesi kullanabilen bir yineleyici yöntem gösterir.
zh_hans: 指示可使用 Yield 语句的迭代器方法。
zh_hant: 指出可以使用 Yield 陳述式的 Iterator 方法。

source: Defines an iterator lambda expression that can use the Yield statement. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
cs: Definuje asynchronní iterační lambda výraz, který může používat operátor Await. Iterator Function(<seznam_parametrů>) As IEnumerable(Of <T>)
de: Definiert einen Iterator-Lambdaausdruck, der die Yield-Anweisung verwenden kann. Iterator Function(<Parameterliste>) As IEnumerable(Of <T>)
es: Define una expresión lambda de iteración que puede usar la instrucción Yield. Iterator Function(<listaDeParámetros>) As IEnumerable(Of <T>)
fr: Définit une expression lambda Iterator pouvant utiliser l'instruction Yield. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
it: Definisce un'espressione lambda iteratore che può usare l'istruzione Yield. Iterator Function(<elencoParametri>) As IEnumerable(Of <T>)
ja: Yield ステートメントを使用できる反復子ラムダ式を定義します。 Iterator Function(<parameterList>) As IEnumerable(Of <T>)
ko: Yield 문을 사용할 수 있는 반복기 람다 식을 정의합니다. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
pl: Określa wyrażenie lambda iteratora mogące używać instrukcji Yield. Iterator Function(<listaParametrów>) As IEnumerable(Of <T>)
pt_br: Define uma expressão lambda de iterador que pode usar a instrução Yield. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
ru: Определяет итератор для лямбда-выражения, которое может использовать оператор Yield. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
tr: Yield ifadesi kullanabilen bir yineleyici lambda ifadesi tanımlar. Iterator Function(<parameterList>) As IEnumerable(Of <T>)
zh_hans: 定义可使用 Yield 语句的迭代器 lambda 表达式。 Iterator Function(<parameterList>) As IEnumerable(Of <T>)
zh_hant: 定義可以使用 Yield 陳述式的 Iterator Lambda 運算式。 Iterator Function(<parameterList>) As IEnumerable(Of <T>)

source: Performs an arithmetic left shift on a bit pattern.
cs: Provede aritmetický bitový posun vlevo.
de: Führt eine arithmetische Linksverschiebung in einem Bitmuster aus.
es: Realiza un desplazamiento aritmético a la izquierda en un patrón de bits.
fr: Effectue un décalage arithmétique vers la gauche au niveau du bit.
it: Esegue uno scorrimento aritmetico a sinistra in uno schema di bit.
ja: ビット パターンに対して算術左シフトを実行します。
ko: 비트 패턴의 산술 왼쪽 시프트 연산을 수행합니다.
pl: Wykonuje arytmetyczne przesunięcie w lewo na ciągu bitowym.
pt_br: Executa um deslocamento aritmético para a esquerda em um padrão de bit.
ru: Выполняет арифметическое смещение влево для битового шаблона.
tr: Bir bit deseninde aritmetik sola kaydırma gerçekleştirir.
zh_hans: 对位模式执行算术左移位运算。
zh_hant: 在位元模式上執行算術左位移。

source: Compares two expressions and returns True if the first is less than the second. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud je první menší než druhý. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn der erste Ausdruck kleiner als der zweite ist. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si la primera es menor que la segunda. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si la première expression est inférieure à la seconde. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se la prima è minore della seconda. In caso contrario, restituisce False.
ja: 2 つの式を比較し、最初の式が 2 番目より小さい場合は、True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 첫 번째 값이 두 번째 값보다 작으면 True를 반환하고, 그렇지 않으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli pierwsze jest mniejsze od drugiego. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se a primeira for menor do que a segunda. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если первое меньше, чем второе. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve ilk ifade ikinciden küçükse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果第一个表达式小于第二个表达式则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若第一個運算式小於第二個運算式，即傳回 True; 否則傳回 False。

source: Compares two expressions and returns True if the first is less than or equal to the second. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud je první menší než nebo rovný druhému. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn der erste Ausdruck kleiner oder gleich dem zweiten ist. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si la primera es menor o igual que la segunda. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si la première expression est inférieure ou égale à la seconde. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se la prima è minore o uguale alla seconda. In caso contrario, restituisce False.
ja: 2 つの式を比較し、最初の式が 2 番目以下の場合は、True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 첫 번째 값이 두 번째 값보다 작거나 같으면 True를 반환하고, 그렇지 않으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli pierwsze jest mniejsze lub równe drugiemu. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se a primeira for menor ou igual à segunda. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если первое меньше или равно второму. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve ilk ifade ikinciden küçükse veya ikinciye eşitse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果第一个表达式小于或等于第二个表达式则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若第一個運算式小於或等於第二個運算式，即傳回 True; 否則傳回 False。

source: Introduces a clause that identifies the external file (DLL or code resource) containing an external procedure.
cs: Zavádí klauzuli, která identifikuje externí soubor (knihovna DLL nebo prostředek kódu) obsahující externí proceduru.
de: Führt eine Klausel ein, die die externe Datei (DLL- oder Coderessource) mit einer externen Prozedur angibt.
es: Introduce una cláusula que identifica un archivo externo (DLL o recurso de código) que contiene un procedimiento externo.
fr: Introduit une clause qui identifie le fichier externe (DLL ou ressource de code) contenant une procédure externe.
it: Introduce una clausola che identifica il file esterno (DLL o risorsa codice) contenente una routine esterna.
ja: 外部プロシージャを含む外部ファイル (DLL またはコード リソース) を識別する句を導入します。
ko: 외부 프로시저가 포함된 외부 파일(DLL 또는 코드 리소스)을 식별하는 절을 지정합니다.
pl: Wprowadza klauzulę identyfikującą zewnętrzny plik (DLL lub zasób kodu) zawierający zewnętrzną procedurę.
pt_br: Apresenta uma cláusula que identifica o arquivo externo (DLL ou recurso de código) contendo um procedimento externo.
ru: Вводит предложение, которое идентифицирует внешний файл (DLL или код ресурса), содержащий внешнюю процедуру.
tr: Bir dış yordam içeren dış dosyayı (DLL veya kod kaynağı) tanımlayan bir yan tümce ortaya çıkarır.
zh_hans: 引入一个用于标识外部文件(DLL 或代码资源)的子句，该外部文件包含外部过程。
zh_hant: 引進能找出包含外部程序之外部檔案 (DLL 或程式碼資源) 的子句。

source: Compares a string against a pattern. Wildcards available include ? to match 1 character and * to match 0 or more characters. <result> = <string> Like <pattern>
cs: Porovná řetězec oproti vzoru. Dostupné zástupné znaky zahrnují znak ? pro porovnání 1 znaku a znak * pro porovnání 0 a více znaků. <výsledek> = <řetězec> Like <vzor>
de: Vergleicht eine Zeichenfolge mit einem Muster. Die verfügbaren Platzhalter umfassen "?" für ein Zeichen und "*" für 0 oder mehrere Zeichen. <Ergebnis> = <Zeichenfolge> Like <Muster>
es: Compara una cadena con un modelo. Los caracteres comodín disponibles son ?, que coincide con un carácter y *, que coincide con cero o más caracteres. <resultado> = <cadena> Like <modelo>
fr: Compare une chaîne à un modèle. Les caractères génériques disponibles sont ? pour correspondre à 1 caractère et * pour correspondre à 0 ou plusieurs caractères. <result> = <string> Like <pattern>
it: Confronta una stringa rispetto a un modello. Tra i caratteri jolly disponibili sono inclusi ? per la corrispondenza a 1 carattere e * per la corrispondenza a 0 o più caratteri. <risultato> = <stringa> Like <modello>
ja: 文字列をパターンと比較します。利用できるワイルドカードには、1 文字に一致する ?、および 0 文字以上に一致する * があります。 <result> = <string> Like <pattern>
ko: 문자열을 패턴과 비교합니다. 사용 가능한 와일드카드에는 ?(단일 문자와 일치)와 *(0개 이상의 문자와 일치)가 있습니다. <result> = <string> Like <pattern>
pl: Przyrównuje ciąg do wzorca. Dostępne są symbole wieloznaczne, takie jak: ? do dopasowania 1 znaku i * do dopasowania 0 lub więcej znaków. <wynik> = <ciąg> Like <wzorzec>
pt_br: Compara uma cadeia de caracteres com um padrão. Os curingas disponíveis incluem ? para corresponder a 1 caractere e * para corresponder a 0 ou mais characters. <result> = <string> Like <padrão>
ru: Сравнивает строку с шаблоном. Доступные подстановочные знаки включают "?" для поиска соответствия для 1 символа и "*" для поиска соответствия любого количества символов. <result> = <string> Like <pattern>
tr: Bir dizeyi bir desen ile karşılaştırır. Joker karakterler ? için 1 karakter ve * için 0 ya da daha fazla karakter dahil etmeye olanak sağlar. <result> = <string> Like <pattern>
zh_hans: 根据模式来比较字符串。可用的通配符包括 ? 和 *，前者用来匹配 1 个字符，后者用来匹配 0 个或多个字符。 <result> = <string> Like <pattern>
zh_hant: 將字串與模式相比。可用的萬用字元包括 ? (與 1 個字元相符) 以及 * (與 0 或多個字元相符)。 <result> = <string> Like <pattern>

source: Returns the difference between two numeric expressions, or the negative value of a numeric expression.
cs: Vrací rozdíl mezi dvěma číselnými hodnotami nebo zápornou hodnotu číselného výrazu.
de: Gibt die Differenz zwischen zwei numerischen Ausdrücken oder den negativen Wert eines numerischen Ausdrucks zurück.
es: Devuelve la diferencia entre dos expresiones numéricas o el valor negativo de una expresión numérica.
fr: Retourne la différence entre deux expressions numériques, ou la valeur négative d'une expression numérique.
it: Restituisce la differenza tra due espressioni numeriche o il valore negativo di un'espressione numerica.
ja: 2 つの数値式の差、または数値式の負の値を返します。
ko: 두 숫자 식의 차이를 반환하거나 숫자 식의 음의 값을 반환합니다.
pl: Zwraca różnicę między dwoma wyrażeniami liczbowymi lub wartość ujemną wyrażenia liczbowego.
pt_br: Retorna a diferença entre duas expressões numéricas ou o valor negativo de uma expressão numérica.
ru: Возвращает разницу двух числовых выражений или отрицательное значение числового выражения.
tr: İki sayısal ifade arasındaki farkı ya da bir sayısal ifadenin negatif değerini döndürür.
zh_hans: 返回两个数值表达式之差，或数值表达式的负值。
zh_hant: 傳回兩個數值運算式的差，或一個數值運算式的負值。

source: Divides two numbers and returns only the remainder. <number1> Mod <number2>
cs: Vydělí dvě čísla a vrátí jenom zbytek. <číslo1> Mod <číslo2>
de: Dividiert zwei Zahlen und gibt nur den Restwert zurück. <Zahl1> Mod <Zahl2>
es: Divide dos números y devuelve solo el resto. <número1> Mod <número2>
fr: Divise deux nombres et retourne uniquement le reste. <nombre1> Mod <nombre2>
it: Divide due numeri e restituisce solo il resto. <numero1> Mod <numero2>
ja: 2つの数値を除算し、剰余のみを返します。 <数値1> Mod <数値2>
ko: 두 숫자를 나누고 나머지만 반환합니다 <number1> Mod <number2>
pl: Dzieli dwie liczby i zwraca wartość reszty. <number1> Mod <number2>
pt_br: Divide os dois números e retorna apenas o resultado. <number1> Mod <number2>
ru: Делит два числа и возвращает остаток. <число1> Mod <число2>
tr: İki sayıyı birbirine böler ve yalnızca kalan değeri döndürür. <number1> Mod <number2>
zh_hans: 将两个数字相除，并只返回余数。 <number1> Mod <number2>
zh_hant: 將兩個數字相除，然後只傳回餘數。 <數字 1> Mod <數字 2>

source: Specifies that an attribute at the beginning of a source file applies to the entire module. Otherwise the attribute will apply only to an individual programming element, such as a class or property.
cs: Určuje, že atribut na začátku zdrojového souboru se vztahuje na celý modul. Jinak se bude atribut vztahovat jenom na jednotlivý programový element, jako je třída nebo vlastnost.
de: Gibt an, dass ein Attribut am Anfang einer Quelldatei für das ganze Modul gilt. Andernfalls wird das Attribut nur auf ein bestimmtes Programmierelement angewendet, z.B. eine Klasse oder Eigenschaft.
es: Especifica que un atributo al principio de un archivo de código fuente se aplica a todo el módulo. En caso contrario, el atributo solo se aplica a un elemento de programación individual, como una clase o propiedad.
fr: Spécifie qu'un attribut situé au début d'un fichier source s'applique à l'intégralité du module. Sinon, l'attribut s'applique uniquement à un élément de programmation individuel, par exemple une classe ou une propriété.
it: Specifica che un attributo all'inizio di un file di origine deve essere applicato all'intero modulo. In caso contrario, l'attributo verrà applicato solo a un singolo elemento di programmazione, ad esempio una classe o una proprietà.
ja: ソース ファイルの冒頭にある属性がモジュール全体に適用されることを示します。これを示さない場合、属性はクラスやプロパティなどの個別のプログラミング要素にのみ適用されます。
ko: 소스 파일의 시작 부분에 있는 특성이 전체 모듈에 적용되도록 지정합니다. 그렇게 하지 않으면 특성이 클래스나 속성 같은 개별 프로그래밍 요소에만 적용됩니다.
pl: Określa, że atrybut znajdujący się na początku pliku źródłowego dotyczy całego modułu. W przeciwnym wypadku atrybut będzie dotyczył tylko pojedynczego elementu programistycznego, takiego jak klasa lub właściwość.
pt_br: Especifica que um atributo no início de um arquivo de origem se aplica ao módulo inteiro. Caso contrário, o atributo se aplicará somente a um elemento de programação individual, como uma classe ou propriedade.
ru: Указывает, что атрибут в начале исходного файла применяется ко всему модулю. В противном случае атрибут будет применяться только к отдельному программному элементу, например классу или свойству.
tr: Bir kaynak dosyasının başında, tüm modüle uygulanacak bir öznitelik belirtir. Aksi durumda; öznitelik yalnızca tek programlama öğesine uygulanır, örneğin bir sınıf ya da özellik.
zh_hans: 指定源文件开头的属性(attribute)应用于整个模块。否则该属性(attribute)将仅应用于单个编程元素，如类或属性(property)。
zh_hant: 指定在原始程式檔開頭的屬性，會套用到整個模組。否則，屬性將只會套用到個別的程式設計元素，例如類別或屬性。

source: Multiplies two numbers and returns the product.
cs: Vrací součin dvou čísel.
de: Multipliziert zwei Zahlen und gibt das Produkt zurück.
es: Multiplica dos números y devuelve el producto.
fr: Multiplie deux nombres et retourne le produit.
it: Moltiplica due numeri e restituisce il prodotto.
ja: 2 つの数値を乗算して積を返します。
ko: 두 수를 곱하고 그 결과를 반환합니다.
pl: Mnoży dwie liczby i zwraca iloczyn.
pt_br: Multiplica dois números e retorna o produto.
ru: Умножает два числа и возвращает произведение.
tr: İki sayıyı çarpar ve çarpımı döndürür.
zh_hans: 对两个数进行乘法运算并返回结果。
zh_hant: 將兩個數值相乘，然後傳回乘積。

source: Specifies that a class can be used only as a base class, and that you cannot create an object directly from it.
cs: Určuje, že třídu jde použít jenom jako základní třídu a že přímo z ní nejde vytvořit objekt.
de: Gibt an, dass eine Klasse nur als Basisklasse verwendet werden kann und dass nicht direkt ein Objekt daraus erstellt werden kann.
es: Especifica que una clase solo se puede usar como clase base y que no se puede crear un objeto directamente a partir de ella.
fr: Spécifie qu'une classe ne peut être utilisée que comme classe de base, et que vous ne pouvez pas créer d'objet directement à partir de celle-ci.
it: Specifica che una classe può essere usata solo come classe di base e che non è possibile creare un oggetto direttamente da tale classe.
ja: クラスが基本クラスとしてのみ使用でき、オブジェクトを直接作成できないことを示します。
ko: 클래스를 기본 클래스로만 사용할 수 있고 클래스에서 개체를 직접 만들 수 없도록 지정합니다.
pl: Określa, że klasa może być używana tylko jako klasa bazowa i że nie można bezpośrednio z niej tworzyć obiektów.
pt_br: Especifica que uma classe só pode ser usada como classe base e que você não pode criar um objeto diretamente dela.
ru: Указывает, что класс может быть использован только в качестве базового класса и что нельзя с помощью него напрямую создать объект.
tr: Bir sınıfın sadece temel sınıf olarak kullanılabileceğini ve bu sınıftan doğrudan nesne oluşturulamayacağını belirtir.
zh_hans: 指定类只能作为基类使用，并且不能直接从其中创建对象。
zh_hant: 指定類別只可用做為基底類別，且您無法直接從它建立物件。
