Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Specifies that a property or procedure is not implemented in the class and must be overridden in a derived class before it can be used.
cs: Určuje, že se vlastnost nebo procedura neimplementuje ve třídě a musí se přepsat v odvozené třídě dřív, než se použije.
de: Gibt an, dass eine Eigenschaft oder Prozedur nicht in der Klasse implementiert wird und in einer abgeleiteten Klasse überschrieben werden muss, damit sie verwendet werden kann.
es: Especifica que una propiedad o procedimiento no se implementa en la clase y que debe invalidarse en una clase derivada para poder utilizarlo.
fr: Spécifie qu'une propriété ou procédure n'est pas implémentée dans la classe et qu'elle doit être substituée dans une classe dérivée pour pouvoir être utilisée.
it: Specifica che una proprietà o una routine non è implementata nella classe e deve essere sottoposta a override in una classe derivata prima che sia possibile usarla.
ja: プロパティやプロシージャがこのクラスで実装されておらず、派生クラスでオーバーライドされないと使用できないことを示します。
ko: 속성 또는 프로시저가 클래스에서 구현되지 않고 파생 클래스에서 재정의한 후 사용할 수 있도록 지정합니다.
pl: Określa, że właściwość lub procedura nie jest zaimplementowana w klasie i musi zostać przesłonięta w klasie pochodnej, zanim będzie mogła zostać użyta.
pt_br: Especifica que uma propriedade ou procedimento não está implementado na classe e deve ser substituído em uma classe derivada antes que possa ser usado.
ru: Указывает, что свойство или процедура не реализованы в классе и должны быть переопределены в производном классе перед использованием.
tr: Bir özelliğin ya da yordamın bir sınıf içinde uygulanmadığını ve kullanmadan önce türetilmiş sınıf içinde geçersiz kılınması gerektiğini belirtir.
zh_hans: 指定某一属性或过程未在类中实现，并且在使用之前必须在派生类中重写。
zh_hant: 指定未在類別中實作的屬性或程序，在使用之前必須於衍生的類別中加以覆寫。

source: Declares the name of a namespace, and causes the source code following the declaration to be compiled within that namespace.
cs: Deklaruje název oboru názvů a způsobí, že se zdrojový kód následující za deklarací zkompiluje uvnitř tohoto oboru názvů.
de: Deklariert den Namen eines Namespace und führt dazu, dass der Quellcode nach der Deklaration in diesem Namespace kompiliert wird.
es: Declara el nombre de un espacio de nombres y permite que el código fuente incluido detrás de la declaración se compile dentro de ese espacio de nombres.
fr: Déclare le nom d'un espace de noms et oblige le code source qui suit la déclaration à être compilé dans cet espace de noms.
it: Dichiara il nome di uno spazio dei nomi e implica la compilazione nello spazio dei nomi del codice sorgente che segue la dichiarazione.
ja: 名前空間の名前を宣言し、宣言に続くソース コードがその名前空間内でコンパイルされるようにします。
ko: 네임스페이스의 이름을 선언하고 이 선언 뒤에 오는 소스 코드가 해당 네임스페이스에서 컴파일되도록 합니다.
pl: Deklaruje nazwę przestrzeni nazw i powoduje, że kod źródłowy następujący po tej deklaracji jest kompilowany w obrębie tej przestrzeni nazw.
pt_br: Declara o nome de um namespace e faz com que o código fonte após a declaração seja compilado dentro desse namespace.
ru: Объявляет имя пространства имен и вызывает компиляцию исходного кода после объявления в пределах этого пространства имен.
tr: Bir ad alanının adını bildirir ve bildirimi takip eden kaynak kodunun bu ad alanı içinde derlenmesini sağlar.
zh_hans: 声明命名空间的名称，并导致在该命名空间中编译声明之后的源代码。
zh_hant: 宣告命名空間的名稱，並讓接在宣告後的原始程式碼，會於該命名空間中編譯。

source: Indicates that a conversion operator (CType) converts a class or structure to a type that might not be able to hold some of the possible values of the original class or structure.
cs: Označuje, že operátor převodu (CType) převede třídu nebo strukturu na typ, který nemusí být schopný uchovat některou z možných hodnot původní třídy nebo struktury.
de: Gibt an, dass ein Konvertierungsoperator (CType) eine Klasse oder Struktur in einen Typ konvertiert, der möglicherweise einige der möglichen Werte der ursprünglichen Klasse oder Struktur nicht aufweisen kann.
es: Indica que un operador de conversión (CType) convierte una clase o estructura en un tipo que puede contener todos los valores posibles de la clase o estructura original.
fr: Indique qu'un opérateur de conversion (CType) convertit une classe ou une structure en un type susceptible de ne pas pouvoir contenir certaines des valeurs possibles de la classe ou structure d'origine.
it: Indica che un operatore di conversione (CType) converte una classe o una struttura in un tipo che potrebbe non essere in grado di contenere alcuni dei possibili valori della classe o della struttura originale.
ja: 変換演算子 (CType) が、クラスまたは構造体を、元のクラスまたは構造体のいくつかの使用可能な値を保持できない可能性がある型に変換することを示します。
ko: 변환 연산자(CType)가 클래스 또는 구조체를 원래 클래스 또는 구조체에서 사용되던 값 중 일부를 보유할 수 없는 형식으로 변환함을 나타냅니다.
pl: Wskazuje, że operator konwersji (CType) konwertuje klasę lub strukturę do typu, który może nie posiadać pewnych możliwych wartości oryginalnej klasy lub struktury.
pt_br: Indica que um operador de conversão (CType) converte uma classe ou estrutura em um tipo que pode não ser capaz de conter alguns dos valores possíveis da classe ou estrutura original.
ru: Указывает, что оператор преобразования (CType) преобразует класс или структуру к типу, который может не содержать возможные значения исходного класса или структуры.
tr: Bir dönüştürme operatörünün (CType) bir sınıf ya da yapıyı, özgün sınıf veya yapının bazı mümkün değerlerini tutamayacak bir türe dönüştürdüğünü gösterir.
zh_hans: 指示转换运算符(CType)将类或结构转换为可能无法保存原始类或结构的某些可能值的类型。
zh_hant: 表示轉換運算子 (CType) 會將類別或結構轉換成可能無法容納原始類別或結構之某些可能值的類型。

source: Compares two expressions and returns True if they are not equal. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud nejsou stejné. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn sie nicht gleich sind. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si no son iguales. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si elles ne sont pas égales. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se non sono uguali. In caso contrario, restituisce False.
ja: 2 つの式を比較し、両者が等しくない場合は True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 같지 않으면 True를 반환하고, 같으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli nie są równe. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se não forem iguais. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если они не равны. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve bu iki ifade eşit değilse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果不相等则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若兩者不相等，即傳回 True; 否則傳回 False。

source: Specifies that a class cannot be used as a base class.
cs: Určuje, že třída se nedá použít jako základní třída.
de: Gibt an, dass eine Klasse nicht als Basisklasse verwendet werden kann.
es: Especifica que una clase no se puede usar como clase base.
fr: Spécifie qu'une classe ne peut pas être utilisée en tant que classe de base.
it: Specifica che una classe non può essere usata come classe di base.
ja: クラスが基本クラスとして使用できないことを指定します。
ko: 클래스를 기본 클래스로 사용할 수 없도록 지정합니다.
pl: Określa, że klasa nie może być używana jako klasa bazowa.
pt_br: Especifica se uma classe não pode ser usada como um classe base.
ru: Указывает, что класс нельзя использовать в качестве базового класса
tr: Bir sınıfın temel sınıf olarak kullanılamayacağını belirtir.
zh_hans: 指定某一类不能作为基类使用。
zh_hant: 指定類別不能用做為基底類別。

source: Performs logical negation on a Boolean expression, or bitwise negation on a numeric expression. <result> = Not <expression>
cs: Vykoná logickou negaci logického výrazu nebo bitovou negaci číselného výrazu. <výsledek> = Not <výraz>
de: Führt eine logische Negation eines booleschen Ausdrucks oder eine bitweise Negation eines numerischen Ausdrucks aus. <Ergebnis> = Not <Ausdruck>
es: Realiza una negación lógica de una expresión booleana o una negación bit a bit de una expresión numérica. <resultado> = Not <expresión>
fr: Effectue une négation logique sur une expression Boolean ou une négation d'opération de bits sur une expression numérique. <result> = Not <expression>
it: Esegue una negazione logica su un'espressione booleana oppure una negazione bit per bit su un'espressione numerica. <risultato> = Not <espressione>
ja: ブール式で論理否定を実行するか、数値式でビット否定を実行します。 <result> = Not <expression>
ko: Boolean 식의 논리 부정 연산을 수행하거나 숫자 식의 비트 부정 연산을 수행합니다. <result> = Not <expression>
pl: Wykonuje logiczną negację na wyrażeniu logicznym lub bitową negację na wyrażeniu liczbowym. <wynik> = Not <wyrażenie>
pt_br: Realiza negação lógica em uma expressão Booleana ou negação bit a bit em uma expressão numérica. <result> = Not <expression>
ru: Выполняет логическое отрицание для логического выражения или побитовое отрицание числового выражения. <result> = Not <expression>
tr: Boolean ifadelerde mantıksal değilleme ya da sayısal ifadelerde bit düzeyinde değilleme gerçekleştirir. <result> = Not <expression>
zh_hans: 对布尔表达式执行逻辑非运算，或对数值表达式执行位求反运算。 <result> = Not <expression>
zh_hant: 在布林運算式上執行邏輯否定運算，或是在數值運算式上執行位元否定運算。 <result> = Not <expression>

source: Specifies that a property or procedure cannot be overridden in a derived class.
cs: Určuje, že se vlastnost nebo procedura nedá přepsat v odvozené třídě.
de: Gibt an, dass eine Eigenschaft oder Prozedur in einer abgeleiteten Klasse nicht überschrieben werden kann.
es: Especifica que una propiedad o procedimiento no se puede invalidar en una clase derivada.
fr: Spécifie qu'une propriété ou procédure ne peut pas être substituée dans une classe dérivée.
it: Specifica che una proprietà o una routine non può essere sottoposta a override in una classe derivata.
ja: プロパティまたはプロシージャが派生クラスでオーバーライドできないことを示します。
ko: 속성 또는 프로시저를 파생 클래스에서 재정의할 수 없도록 지정합니다.
pl: Określa, że właściwość lub procedura nie może być przesłoniona w klasie pochodnej.
pt_br: Especifica que uma propriedade ou procedimento não pode ser substituído em uma classe derivada.
ru: Указывает, что свойство или процедура не могут быть переопределены в производном классе.
tr: Bir özellik ya da yordamın, türetilmiş sınıf içinde geçersiz kılınamayacağını belirtir.
zh_hans: 指定不能在派生类中重写属性或过程。
zh_hant: 指定在衍生類別中不可覆寫屬性或程序。

source: Identifies a type parameter on a generic class, structure, interface, delegate, or procedure.
cs: Identifikuje parametr typu pro obecnou třídu, strukturu, rozhraní, delegáta nebo proceduru.
de: Gibt einen Typparameter für eine generische Klasse, Struktur, Schnittstelle, einen Delegaten oder eine Prozedur an.
es: Identifica un parámetro de tipo en una clase genérica, estructura, interfaz, delegado o procedimiento.
fr: Identifie un paramètre de type dans une classe, une structure, une interface, un délégué ou une procédure générique.
it: Identifica un parametro di tipo in una classe, una struttura, un'interfaccia o una routine generica o in un delegato generico.
ja: ジェネリック クラス、構造体、インターフェイス、デリゲート、またはプロシージャの型パラメーターを識別します。
ko: 제네릭 클래스, 구조체, 인터페이스, 대리자 또는 프로시저에서 형식 매개 변수를 식별합니다.
pl: Określa parametr typu klasy ogólnej, struktury, interfejsu, delegatu lub procedury.
pt_br: Identifica um parâmetro de tipo em uma classe genérica, estrutura, interface, delegado ou procedimento.
ru: Определяет тип параметра для универсального класса, структуры, интерфейса, делегата или процедуры.
tr: Bir genel sınıf, yapı, arabirim, temsilci ya da yordam üzerinde tür parametresi tanımlar.
zh_hans: 标识泛型类、结构、接口、委托或过程中的类型形参。
zh_hant: 識別泛型類別、結構、介面、委派或程序的類型參數。

source: Declares the operator symbol, operands, and code that define an operator procedure on a class or structure.
cs: Deklaruje symbol operátoru, operandy a kód, který definuje proceduru operátoru pro třídu nebo strukturu.
de: Deklariert das Operatorsymbol, die Operanden und den Code zum Definieren einer Operatorprozedur für eine Klasse oder eine Struktur.
es: Declara el símbolo del operador, los operandos y el código que definen un procedimiento de operador en una clase o estructura.
fr: Déclare le symbole, les opérandes et le code qui définissent une procédure d'opérateur dans une classe ou une structure.
it: Dichiara il simbolo dell'operatore, gli operandi e il codice che definiscono una routine di operatore in una classe o una struttura.
ja: クラスまたは構造体に演算子プロシージャを定義する演算子記号、オペランド、およびコードを宣言します。
ko: 클래스 또는 구조체에서 연산자 프로시저를 정의하는 연산자 기호, 피연산자 및 코드를 선언합니다.
pl: Deklaruje symbol operatora, argumenty operacji i kod, który definiuje procedurę operatora w klasie lub strukturze.
pt_br: Declara o símbolo do operador, operandos e código que definem um procedimento de operador em uma classe ou estrutura.
ru: Объявляет символ оператора, операнды и код, которые определяют процедуру оператора для класса или структуры.
tr: Bir sınıf ya da yapı üzerinde operatör yordamını tanımlayan operatör sembolünü, işlenenleri ve kodu bildirir.
zh_hans: 声明用于定义类或结构中的运算符过程的运算符符号、操作数和代码。
zh_hant: 宣告運算子符號、運算元與程式碼，以定義類別或結構的運算子程序。

source: Specifies that a procedure argument can be omitted when the procedure is called.
cs: Určuje, že se argument procedury může při volání procedury vynechat.
de: Gibt an, dass ein Prozedurargument beim Aufrufen der Prozedur ausgelassen werden kann.
es: Especifica que, al llamar a un procedimiento, se puede omitir su argumento.
fr: Spécifie qu'un argument de procédure peut être omis lorsque la procédure est appelée.
it: Specifica che un argomento di routine può essere omesso quando la routine viene chiamata.
ja: プロシージャが呼び出されるときにプロシージャ引数が省略可能であることを指定します。
ko: 프로시저를 호출할 때 프로시저 인수를 생략할 수 있도록 지정합니다.
pl: Określa, że argument procedury może zostać pominięty, gdy procedura jest wywoływana.
pt_br: Especifica que um argumento de procedimento pode ser omitido quando o procedimento é chamado.
ru: Указывает, что аргумент процедуры может быть опущен, если вызвана процедура.
tr: Bir yordam bağımsız değişkeninin, yordam çağrılırken atlanabileceğini belirtir.
zh_hans: 指定在调用过程时可以省略过程参数。
zh_hant: 指定呼叫程序時，可以省略程序引數。

source: Introduces a statement that specifies a compiler option that applies to the entire source file.
cs: Zavádí příkaz, který určuje možnost kompilátoru, která se vztahuje k celému zdrojovému souboru.
de: Führt eine Anweisung ein, die eine Compileroption angibt, die für eine ganze Quelldatei gilt.
es: Introduce una instrucción que especifica una opción del compilador que se aplica a todo el archivo de código fuente.
fr: Introduit une instruction qui spécifie une option du compilateur s'appliquant à l'intégralité du fichier source.
it: Introduce un'istruzione che specifica un'opzione del compilatore da applicare all'intero file di origine.
ja: ソース ファイル全体に適用されるコンパイラ オプションを指定するステートメントを導入します。
ko: 전체 소스 파일에 적용할 컴파일러 옵션을 지정하는 문을 지정합니다.
pl: Wprowadza instrukcję określającą opcję kompilatora, która jest stosowana do całego pliku źródłowego.
pt_br: Apresenta uma declaração que especifica uma opção de compilador que se aplica a todo o arquivo de origem.
ru: Вводит оператор, который определяет параметр компилятора, применяемого ко всему исходному файлу.
tr: Kaynak dosyanın tümüne uygulanan derleyici seçeneğini belirten bir deyimi ortaya çıkarır.
zh_hans: 引入用于指定编译器选项的语句，该编译器选项适用于整个源文件。
zh_hant: 引進指定套用到整個原始程式檔之編譯器選項的陳述式。

source: Performs short-circuit inclusive logical disjunction on two expressions. Returns True if either operand evaluates to True. If the first expression evaluates to True, the second expression is not evaluated. <result> = <expression1> OrElse <expression2>
cs: Vykonává zkrácenou inkluzivní logickou disjunkci dvou výrazů. Vrací True, pokud se jeden z operandů vyhodnotí jako True. Pokud se první výraz vyhodnotí jako True, druhý výraz se už nevyhodnocuje. <výsledek> = <výraz1> OrElse <výraz2>
de: Führt eine verkürzte einschließende logische Disjunktion für zwei Ausdrücke durch. Gibt True zurück, wenn einer der Operanden als True ausgewertet wird. Wenn der erste Ausdruck als True ausgewertet wird, wird der zweite Ausdruck nicht ausgewertet. <Ergebnis> = <Ausdruck1> OrElse <Ergebnis2>
es: Realiza una disyunción lógica inclusiva de cortocircuito en dos expresiones. Devuelve True si alguno de los operandos se evalúa como True. Si la primera expresión se evalúa como True, la segunda expresión no se evalúa. <resultado> = <expresión1> OrElse <expresión2>
fr: Effectue une disjonction logique inclusive de court-circuit sur deux expressions. Retourne True si l'un des opérandes a la valeur True. Si la première expression a la valeur True, la seconde expression n'est pas évaluée. <result> = <expression1> OrElse <expression2>
it: Esegue una disgiunzione logica inclusiva di corto circuito su due espressioni. Restituisce True se uno dei due operandi viene valutato True. Se la prima espressione viene valutata True, la seconda non viene valutata. <risultato> = <espressione1> OrElse <espressione2>
ja: 2 つの式の包括的ショートサーキット論理和を求めます。少なくとも 1 つのオペランドが True と評価された場合は True を返します。最初の式が True と評価された場合、2 番目の式は評価されません。 <result> = <expression1> OrElse <expression2>
ko: 두 식의 단락(short-circuit) 포함 논리합 연산을 수행합니다. 두 피연산자 중 하나가 True이면 True를 반환합니다. 첫 번째 식이 True이면 두 번째 식을 계산하지 않습니다. <result> = <expression1> OrElse <expression2>
pl: Wykonuje logiczną łączną sumę typu „sprzężenie” na dwóch wyrażeniach. Zwraca wartość True, jeśli którykolwiek argument operacji daje w wyniku wartość True. Jeśli pierwsze wyrażenie daje w wyniku wartość True, drugie wyrażenie nie jest obliczane. <wynik> = <wyrażenie1> OrElse <wyrażenie2>
pt_br: Executa uma disjunção lógica inclusiva de circuito pequeno em duas expressões. Retorna Verdadeiro se ambos operandos forem avaliados como Verdadeiro. Se a primeira expressão for avaliada como Verdadeiro, a segunda não será avaliada. <result> = <expression1> OrElse <expression2>
ru: Выполняет включающее логическое сложение краткой записи для двух выражений. Возвращает значение True, если операнд имеет значение True. Если первое выражение истинно, то второе выражение не вычисляется. <result> = <expression1> OrElse <expression2>
tr: İki ifadede kısa devre kapsamlı mantıksal VEYA işlecini gerçekleştirir. Eğer iki işlenenden biri True değerlendiriliyorsa True değer döndürür. Eğer ilk ifade True değerlendiriliyorsa, ikinci ifade değerlendirilmez. <result> = <expression1> OrElse <expression2>
zh_hans: 对两个表达式执行短路逻辑或运算。如果任一操作数的计算结果为 True，则返回 True。如果第一个表达式的计算结果为 True，则将不计算第二个表达式。 <result> = <expression1> OrElse <expression2>
zh_hant: 在兩個運算式上執行最少運算的內含邏輯分離。若任一運算元評估為 True，即傳回 True。若第一個運算式評估為 True，則不會評估第二個運算式。 <result> = <expression1> OrElse <expression2>

source: Performs an inclusive logical disjunction on two Boolean expressions, or a bitwise disjunction on two numeric expressions. For Boolean expressions, returns True if at least one operand evaluates to True. Both expressions are always evaluated. <result> = <expression1> Or <expression2>
cs: Vykonává inkluzivní logickou disjunkci dvou logických výrazů nebo bitovou disjunkci dvou číselných výrazů. Pro logické výrazy vrací True, pokud se aspoň jeden operand vyhodnotí jako True. Vždycky se vyhodnocují oba výrazy. <výsledek> = <výraz1> Or <výraz2>
de: Führt eine einschließende logische Disjunktion für zwei boolesche Ausdrücke oder eine bitweise Disjunktion für zwei numerische Ausdrücke durch. Gibt bei booleschen Ausdrücken True zurück, wenn mindestens ein Operand als True ausgewertet wird. Beide Ausdrücke werden immer ausgewertet. <Ergebnis> = <Ausdruck1> Or <Ausdruck2>
es: Realiza una disyunción lógica inclusiva en dos expresiones Boolean o una disyunción bit a bit en dos expresiones numéricas. Para las expresiones Boolean, devuelve True si al menos un operando se evalúa como True. Ambas expresiones siempre se evalúan. <resultado> = <expresión1> Or <expresión2>
fr: Effectue une disjonction logique inclusive sur deux expressions Boolean ou une disjonction d'opérations de bits sur deux expressions numériques. Pour les expressions Boolean, retourne True si au moins un opérande a la valeur True. Les deux expressions sont toujours évaluées. <result> = <expression1> Or <expression2>
it: Esegue una disgiunzione logica inclusiva su due espressioni booleane oppure una disgiunzione bit per bit su due espressioni numeriche. Per le espressioni booleane, restituisce True se almeno un operando viene valutato True. Entrambe le espressioni vengono sempre valutate. <risultato> = <espressione1> Or <espressione2>
ja: 2 つのブール式の包括的論理和または 2 つの数値式のビットごとの和を求めます。ブール式の場合、少なくとも 1 つのオペランドが True と評価された場合は True を返します。常に両方のオペランドが評価されます。 <result> = <expression1> Or <expression2>
ko: 두 Boolean 식의 포함 논리합 연산을 수행하거나 두 숫자 식의 비트 논리합 연산을 수행합니다. Boolean 식의 경우 하나 이상의 피연산자가 True이면 True를 반환합니다. 항상 두 식을 모두 계산합니다. <result> = <expression1> Or <expression2>
pl: Wykonuje łączną sumę logiczną na dwóch wyrażeniach logicznych lub sumę bitową na dwóch wyrażeniach liczbowych. Dla wyrażeń logicznych zwraca wartość True, jeśli przynajmniej jeden argument logiczny daje w wyniku wartość True. Oba wyrażenia są zawsze obliczane. <wynik> = <wyrażenie1> Or <wyrażenie2>
pt_br: Executa uma disjunção lógica inclusiva em duas expressões Booleanas ou uma disjunção bit a bit em duas expressões numéricas. Para expressões booleanas, retorna Verdadeiro se pelo menos um operando é avaliado como Verdadeiro. Ambas as expressões são sempre avaliadas. <result> = <expression1> Or <expression2>
ru: Выполняет логическое сложение двух логических выражений или побитовое сложение двух числовых выражений. Возвращает значение True для логических выражений, если хотя бы одно из выражений имеет значение True. Всегда вычисляются оба выражения. <result> = <expression1> Or <expression2>
tr: İki Boolean ifadesinde kapsamlı mantıksal VEYA işlecini ya da iki sayısal ifadede bit tabanlı VEYA işlecini gerçekleştirir. Boolean ifadeler için, en az bir işlenen True değerlendiriliyorsa True değer döndürür. Her iki ifade de her zaman değerlendirilir. <result> = <expression1> Or <expression2>
zh_hans: 对两个布尔表达式执行逻辑或运算，或对两个数值表达式执行位或运算。对于布尔表达式，如果至少有一个操作数的计算结果为 True，则返回 True。始终对这两个表达式进行计算。 <result> = <expression1> Or <expression2>
zh_hant: 在兩個布林運算式上執行內含邏輯分離，或在兩個數值運算式上執行位元分離。對於布林運算式而言，若至少有一個運算元評估為 True，即傳回 True。兩個運算式都會進行評估。 <result> = <expression1> Or <expression2>

source: Specifies that a property or procedure re-declares one or more existing properties or procedures with the same name.
cs: Určuje, že vlastnost nebo procedura znovu deklaruje nejmíň jednu z existujících vlastností nebo procedur se stejným názvem.
de: Gibt an, dass eine Eigenschaft oder Prozedur eine Eigenschaft oder Prozedur bzw. mehrere mit dem gleichen Namen neu deklariert.
es: Especifica que una propiedad o procedimiento vuelve a declarar una o varias propiedades o procedimientos existentes con el mismo nombre.
fr: Spécifie qu'une propriété ou procédure redéclare une ou plusieurs propriétés ou procédures existantes avec le même nom.
it: Specifica che una proprietà o una routine ridichiara una o più proprietà o routine esistenti con lo stesso nome.
ja: プロパティまたはプロシージャが、同じ名前の 1 つ以上の既存のプロパティまたはプロシージャを再度宣言することを示します。
ko: 속성 또는 프로시저에서 하나 이상의 기존 속성 또는 프로시저를 같은 이름으로 다시 선언할 수 있도록 지정합니다.
pl: Określa, że właściwość lub procedura ponownie co najmniej jedną istniejącą właściwość lub procedurę o tej samej nazwie.
pt_br: Especifica que uma propriedade ou procedimento redeclara uma ou mais propriedades ou procedimentos existentes com o mesmo nome.
ru: Указывает, что свойство или процедура повторно определяет одно или несколько существующих свойств или процедур с таким же именем.
tr: Bir özelliğin ya da yordamın, var olan bir veya daha fazla aynı ada sahip özellik ya da yordamı yeniden bildirdiğini belirtir.
zh_hans: 指定某一属性或过程重新声明一个或多个具有相同名称的现有属性或过程。
zh_hant: 指定屬性或程序會重新宣告一或多個同名的現有屬性或程序。
