Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Add Await
cs: Přidat Await
de: "Await" hinzufügen
es: Agregar await
fr: Ajouter Await
it: Aggiungi Await
ja: Await の追加
ko: Await 추가
pl: Dodaj operator Await
pt_br: Adicionar Await
ru: Добавить Await
tr: Await ekle
zh_hans: 添加 Await

source: Add Await and 'ConfigureAwait(false)'
cs: Přidat Await a ConfigureAwait(false)
de: "Await" und "ConfigureAwait(false)" hinzufügen
es: Agregar await y "ConfigureAwait(false)"
fr: Ajouter Await et 'ConfigureAwait(false)'
it: Aggiungi Await a 'ConfigureAwait(false)'
ja: Await と 'ConfigureAwait(false)' の追加
ko: Await 및 'ConfigureAwait(false)' 추가
pl: Dodaj operator Await i wywołanie „ConfigureAwait(false)”
pt_br: Adicionar Await e 'ConfigureAwait(false)'
ru: Добавить Await и "ConfigureAwait(false)"
tr: Await ve 'ConfigureAwait(false)' ekle
zh_hans: 添加 Await 和 “ConfigureAwait(false)”

source: Add <Obsolete>
cs: Přidat <Obsolete>
de: <Veraltet> hinzufügen
es: Agregar <obsoleto>
fr: Ajouter <Obsolete>
it: Aggiungi <Obsolete>
ja: <Obsolete> の追加
ko: <Obsolete> 추가
pl: Dodaj oznaczenie <Obsolete>
pt_br: Adicionar <Obsolete>
ru: Добавить <Obsolete>
tr: <Obsolete> ekle
zh_hans: 添加 <Obsolete>

source: Add missing Imports
cs: Přidat chybějící Importy
de: Fehlende Importe hinzufügen
es: Agregar instancias de Import que faltan
fr: Ajouter les Import manquants
it: Aggiungi Import mancanti
ja: 欠落している Import の追加
ko: 누락된 Imports 추가
pl: Dodaj brakujące instrukcje Imports
pt_br: Adicionar Importações ausentes
ru: Добавить отсутствующий оператор Imports
tr: Eksik Import'ları ekle
zh_hans: 添加缺少的 Import

source: Add 'Shadows'
cs: Přidat Shadows
de: "Shadows" hinzufügen
es: Agregar "Shadows"
fr: Ajouter 'Shadows'
it: Aggiungi 'Shadows'
ja: 'Shadows' の追加
ko: 'Shadows' 추가
pl: Dodaj modyfikatory „Shadows”
pt_br: Adicionar 'Shadows'
ru: Добавить "Shadows"
tr: 'Shadows' ekle
zh_hans: 添加 “Shadows”

source: 'If' statement can be simplified
cs: Příkaz if lze zjednodušit.
de: Die If-Anweisung kann vereinfacht werden.
es: La instrucción "if" se puede simplificar
it: L'istruzione 'If' può essere semplificata
ja: 'if' ステートメントは簡素化できます
ko: 'if' 문을 간단하게 줄일 수 있습니다.
pl: Instrukcja „if” może zostać uproszczona
pt_br: A instrução 'If' pode ser simplificada
tr: 'If' deyimi basitleştirilebilir
zh_hans: 可简化“If”语句
zh_hant: 'If' 陳述式可簡化

source: Insert '{0}'.
cs: Vložit {0}
de: "{0}" einfügen.
es: Inserte "{0}".
fr: Insérer '{0}'.
it: Inserisci '{0}'.
ja: {0} の挿入
ko: {0}'을(를) 삽입합니다.
pl: Wstaw element {0}.
pt_br: Inserir "{0}".
ru: Вставка "{0}"
tr: {0}' öğesini ekleyin.
zh_hans: 插入“{0}”。
zh_hant: 插入 '{0}'。

# Delete_the_0_statement1
source: Delete the '{0}' statement.
cs: Odstraní příkaz {0}.
de: Löschen der "{0}"-Anweisung.
es: Elimine la instrucción "{0}".
fr: Supprimez l'instruction '{0}'.
it: Eliminare l'istruzione '{0}'.
ja: {0}' ステートメントを削除します。
ko: {0}' 문을 삭제합니다.
pl: Usuń instrukcję „{0}”.
pt_br: Exclua a instrução "{0}".
ru: Удалить оператор "{0}".
tr: {0}' deyimini silin.
zh_hans: 删除“{0}”语句。
zh_hant: 刪除 '{0}' 陳述式。

source: Create event {0} in {1}
cs: Vytvořit událost {0} v: {1}
de: Ereignis {0} in {1} erstellen
es: Crear el evento {0} en {1}
fr: Créer un événement {0} dans {1}
it: Crea l'evento {0} in {1}
ja: イベント {0} を {1} に作成する
ko: {1}에서 {0} 이벤트를 만들기
pl: Utwórz zdarzenie {0} w elemencie {1}
pt_br: Criar evento {0} em {1}
ru: Создайте событие {0} в {1}
tr: {1} içinde {0} olayını oluşturun
zh_hans: 在{1}中创建事件{0}
zh_hant: 在 {1} 中建立事件 {0}

source: Insert the missing 'End Property' statement.
cs: Vložte chybějící příkaz End Property.
de: Fügen Sie die fehlende "End Property"-Anweisung ein.
es: Inserte la instrucción "End Property" que falta.
fr: Insérez l'instruction 'End Property' manquante.
it: Inserire l'istruzione 'End Property' mancante.
ja: 不足している ' End Property' ステートメントを挿入します。
ko: 없는 'End Property' 문을 삽입합니다.
pl: Wstaw brakującą instrukcję End Property.
pt_br: Insira a instrução "End Property" ausente.
ru: Вставить отсутствующее заявление "End Property".
tr: Eksik 'End Property' deyimini ekleyin.
zh_hans: 插入缺少的“End Property”语句。
zh_hant: 插入遺漏的 'End Property' 陳述式。

source: Insert the missing '{0}'.
cs: Vložte chybějící {0}.
de: Fügen Sie das fehlende "{0}" ein.
es: Inserte el "{0}" que falta.
fr: Insérez le '{0}' manquant.
it: Inserire l'elemento '{0}' mancante.
ja: 不足している '{0}' を挿入します。
ko: 누락된 '{0}'을(를) 삽입합니다.
pl: Wstaw brakujący element „{0}”.
pt_br: Inserir '{0}' ausente.
ru: Вставьте отсутствующий "{0}".
tr: Eksik '{0}' öğesini ekleyin.
zh_hans: 插入缺少的“{0}”。
zh_hant: 插入遺漏的 '{0}'。

source: Inline temporary variable
cs: Dočasná vložená proměnná
de: Inline temporär variabel
es: Variable temporal en línea
fr: Variable temporaire inline
it: Variabile temporanea inline
ja: インラインの一時変数
ko: 인라인 임시 변수
pl: Wstawiona zmienna tymczasowa
pt_br: Variável temporária embutida
ru: Встроенная временная переменная
tr: Satır içi geçici değişken
zh_hans: 内联临时变量
zh_hant: 內嵌暫存變數

source: Conflict(s) detected.
cs: Zjistily se konflikty.
de: Konflikt(e) erkannt.
es: Conflicto(s) detectado(s).
fr: Conflit(s) détecté(s).
it: Sono stati rilevati conflitti
ja: 競合が検出されました。
ko: 충돌이 감지되었습니다.
pl: Wykryto konflikty.
pt_br: Conflito(s) detectado(s).
ru: Обнаружены конфликты.
tr: Çakışmalar algılandı.
zh_hans: 检测到冲突。
zh_hant: 偵測到衝突。

source: Introduce 'Using' statement
cs: Zavést příkaz Using
de: Using-Anweisung einführen
es: Introducir instrucción "Using"
fr: Introduire l'instruction 'Using'
it: Introduci istruzioni 'Using'
ja: ’Using’ ステートメントの導入
ko: 'Using' 문 지정
pl: Wprowadź instrukcję „Using”
pt_br: Apresente a instrução 'Using'
ru: Ввести оператор "Using"
tr: 'Using' deyimi ekle
zh_hans: 引入 “Using” 语句

source: Make '{0}' inheritable
cs: Nastavit dědičnost pro {0}
de: "{0}" als vererbbar festlegen
es: Hacer "{0}" heredable
fr: Rendre '{0}' héritable
it: Imposta '{0}' come ereditabile
ja: '{0}' を継承可能にします
ko: '{0}'을(를) 상속 가능으로 지정
pl: Ustaw element „{0}” jako dziedziczony
pt_br: Alterar '{0}' para herdável
ru: Сделать "{0}" наследуемым
tr: '{0}' öğesini devralınabilir hale getir
zh_hans: 使 "{0}" 可继承

source: Move the '{0}' statement to line {1}.
cs: Přesuňte příkaz {0} na řádek {1}.
de: Verschieben Sie die "{0}"-Anweisung zu Zeile {1}.
es: Mueva la instrucción "{0}" a la línea {1}.
fr: Déplacez l'instruction '{0}' à la ligne {1}.
it: Spostare l'istruzione '{0}' alla riga {1}.
ja: {0}' ステートメントを行 {1} に移動します。
ko: {0}' 문을 {1} 줄로 이동합니다.
pl: Przenieś instrukcję „{0}” do wiersza {1}.
pt_br: Mova a instrução "{0}" para a linha {1}.
ru: Перемещение оператора "{0}" в строку {1}.
tr: {0}' deyimini {1} satırına taşıyın.
zh_hans: 将“{0}”语句移动到第 {1} 行。
zh_hant: 將 '{0}' 陳述式移至行 {1}。

# Delete_the_0_statement2
source: Delete the '{0}' statement.
cs: Odstraní příkaz {0}.
de: Löschen der "{0}"-Anweisung.
es: Elimine la instrucción "{0}".
fr: Supprimez l'instruction '{0}'.
it: Eliminare l'istruzione '{0}'.
ja: {0}' ステートメントを削除します。
ko: {0}' 문을 삭제합니다.
pl: Usuń instrukcję „{0}”.
pt_br: Exclua a instrução "{0}".
ru: Удалить оператор "{0}".
tr: {0}' deyimini silin.
zh_hans: 删除“{0}”语句。
zh_hant: 刪除 '{0}' 陳述式。

source: <Multiple Types>
cs: <Víc typů>
de: <Mehrere Typen>
es: <Varios tipos>
fr: <Plusieurs types>
it: <Più tipi>
ja: <複数の種類>
ko: <여러 형식>
pl: <Wiele typów>
pt_br: <Vários Tipos>
ru: <Несколько типов>
zh_hans: <多种类型>
zh_hant: <多項類型>

source: Remove Unnecessary Imports
de: Unnötige Import-Direktiven entfernen
es: Quitar instrucciones Import innecesarias
it: Rimuovi Import non necessari
ja: 不要なインポートの削除
ko: 불필요한 Imports 제거
pt_br: Remover Importações Desnecessárias
tr: Gereksiz İçeri Aktarmaları Kaldır
zh_hant: 移除不必要的匯入

source: &Sort Imports
es: Orde&nar instrucciones Import

source: Type a name here to declare a new field.
cs: Sem vložte název, kterým deklarujete novou položku.
de: Geben Sie hier einen Namen ein, um ein neues Feld zu deklarieren.
es: Escriba aquí un nombre para declarar un nuevo campo.
fr: Tapez un nom ici pour déclarer un nouveau champ.
it: Digitare qui un nome per dichiarare un nuovo campo.
ja: 新しいフィールドを宣言するには、ここに名前を入力します。
ko: 여기에 이름을 입력하여 새 필드를 선언하세요.
pl: Wpisz tutaj nazwę, aby utworzyć deklarację nowego pola.
pt_br: Digite um nome aqui para declarar um novo campo.
ru: Введите здесь имя для объявления нового поля.
tr: Yeni bir alan bildirmek için buraya bir ad yazın.
zh_hans: 请在此处键入名称以声明新字段。
zh_hant: 於此輸入名稱以宣告新的欄位。

source: Note: Space completion is disabled to avoid potential interference. To insert a name from the list, use tab.
cs: Poznámka: Dokončení mezerou je zakázané, aby se předešlo možné kolizi. Pro vložení názvu ze seznamu použijte tabulátor.
de: Hinweis: Die Vervollständigung mit der LEERTASTE wurde deaktiviert, um Probleme zu vermeiden. Verwenden Sie zum Einfügen eines Namens aus der Liste die TAB-TASTE.
es: Nota: La inclusión de espacios está deshabilitada para evitar posibles interferencias. Para insertar un nombre de la lista, utilice el carácter de tabulación.
fr: Remarque : la saisie semi-automatique à l'aide de l'espace est désactivée pour éviter toute interférence éventuelle. Pour insérer un nom de la liste, utilisez la touche Tab.
it: Nota: il completamento tramite la barra spaziatrice è disabilitato per evitare possibili interferenze. Per inserire un nome dall'elenco, usare TAB.
ja: 注: 潜在的な干渉を避けるため、スペースの補完は無効になっています。リストから名前を挿入するには、タブを使用します。
ko: 참고: 입력을 방해하지 않으려면 공백 완성 기능을 사용하지 않도록 설정합니다. 목록에서 이름을 삽입하려면 탭을 사용하세요.
pl: Uwaga: Uzupełnianie za pomocą spacji jest wyłączone w celu uniknięcia potencjalnych konfliktów. Aby wstawić nazwę z listy, użyj klawisza Tab.
pt_br: Observação: o preenchimento de espaço está desabilitado para evitar interferências em potencial. Para inserir um nome da lista, use tab.
ru: Примечание. Завершение по нажатию клавиши ПРОБЕЛ отключено во избежание возникновения взаимных помех. Для вставки имени из списка используйте клавишу TAB.
tr: Not: Mümkün engellemelerden kaçınmak için boşluk tamamlama devre dışı bırakıldı. Listeden bir ad eklemek için sekmeyi kullanın.
zh_hans: 注意: 禁用空格结束字符以避免潜在干扰。若要从列表中插入名称，请使用制表符。
zh_hant: 注意: 空格完成的功能已停用，以免造成可能的干擾。若要插入清單中的名稱，請使用 Tab 鍵。

source: <new field>
cs: <nová položka>
de: <neues Feld>
es: <nuevo campo>
fr: <nouveau champ>
it: <nuovo campo>
ja: <新しいフィールド>
ko: <새 필드>
pl: <nowe pole>
pt_br: <novo campo>
ru: <новое поле>
zh_hans: <新字段>
zh_hant: <新欄位>

source: Type a name here to declare a parameter. If no preceding keyword is used; 'ByVal' will be assumed and the argument will be passed by value.
cs: Sem vložte název, kterým deklarujete parametr. Pokud není použité žádné předcházející klíčové slovo, vloží se podle výchozího chování klíčové slovo ByVal a argument se předá podle hodnoty.
de: Geben Sie hier einen Namen zum Deklarieren eines Parameters ein. Wenn kein vorhergehendes Schlüsselwort verwendet wird, wird von "ByVal" ausgegangen, und das Argument wird nach Wert übergeben.
es: Escriba aquí un nombre para declarar un parámetro. Si no se incluye delante ninguna palabra clave, se asumirá "ByVal" y el argumento se pasará por valor.
fr: Tapez un nom ici pour déclarer un paramètre. Si aucun mot clé ne précède, 'ByVal' est utilisé par défaut et l'argument est passé par valeur.
it: Digitare qui un nome per dichiarare un parametro. Se non è stata usata una parola chiave precedente, verrà usata 'ByVal' e l'argomento verrà passato per valore.
ja: パラメーターを宣言するには、ここに名前を入力します。先行するキーワードが使用されない場合は、'ByVal' と見なされ、引数が値によって渡されます。
ko: 여기에 이름을 입력하여 매개 변수를 선언하세요. 선행 키워드를 사용하지 않으면 'ByVal'이 가정되고 인수가 값으로 전달됩니다.
pl: Wpisz tutaj nazwę, aby zadeklarować parametr. Jeśli nie zostanie użyte żadne z poprzedzających słów kluczowych, domyślnie zostanie użyte słowo ByVal i argument zostanie przekazany przez wartość.
pt_br: Digite um nome aqui para declarar um parâmetro. Se nenhuma palavra-chave anterior for usada; "ByVal" será assumido e o argumento será passado pelo valor.
ru: Введите здесь имя для объявления параметра. Если не используется предшествующее ключевое слово, будет допускаться "ByVal" и аргумент будет передаваться по значению.
tr: Parametre bildirmek için buraya bir ad yazın. Önceden anahtar sözcük kullanılmamışsa 'ByVal' olarak kabul edilir ve bağımsız değişken değere göre geçirilir.
zh_hans: 请在此处键入一个名称以声明形参。如果未使用前面的关键字，将假定“ByVal”，并且将按值传递实参。
zh_hant: 於此輸入名稱以宣告參數。若之前未出現任何關鍵字，將假設使用 'ByVal'，且引數將依值傳遞。

source: <parameter name>
cs: <název parametru>
es: <nombre de parámetro>
fr: <nom de paramètre>
it: <nome parametro>
ja: <パラメーター名>
ko: <매개 변수 이름>
pl: <nazwa parametru>
pt_br: <nome do parâmetro>
ru: <имя параметра>
zh_hans: <参数名称>
zh_hant: <參數名稱>

source: Type a new name for the column, followed by '='. Otherwise, the original column name with be used.
cs: Vložte nový název sloupce následovaný znakem =. Jinak se použije původní název sloupce.
de: Geben Sie einen neuen Namen für die Spalte und anschließend "=" ein. Andernfalls wird der ursprüngliche Spaltenname verwendet.
es: Escriba un nuevo nombre para la columna seguido de "=". En caso contrario, se utilizará el nombre de columna original.
fr: Tapez un nouveau nom pour la colonne, suivi de '='. Sinon, le nom de colonne d'origine sera utilisé.
it: Digitare un nuovo nome per la colonna, seguito da '='. In caso contrario, verrà usato il nome di colonna originale.
ja: 列の新しい名前 (名前の後に '=' が続く) を入力します。これを入力しない場合、元の列名が使用されます。
ko: 열의 새 이름을 입력하고 뒤에 '='를 입력하세요. 그렇게 하지 않으면 원래 열 이름이 사용됩니다.
pl: Wpisz nową nazwę dla kolumny, a po niej znak „=”. W przeciwnym wypadku zostanie użyta oryginalna nazwa kolumny.
pt_br: Digite um novo nome para a coluna, seguido de "=". Caso contrário, o nome da coluna original será usado.
ru: Введите новое имя для столбца, за которым должен следовать "=". В противном случае используется первоначальное имя столбца.
tr: =' ile takip edilen sütun için yeni bir ad yazın. Aksi durumda, özgün sütun adı kullanılacak.
zh_hans: 为列键入一个新名称，后跟“=”。否则，将使用原始的列名称。
zh_hant: 輸入資料行的新名稱，其後接著 '='。否則將會使用原始的資料行名稱。

source: Note: Use tab for automatic completion; space completion is disabled to avoid interfering with a new name.
cs: Poznámka: Pro automatické dokončení použijte tabulátor; dokončení mezerou je zakázané, aby se předešlo kolizi s novým názvem.
de: Hinweis: Verwenden Sie die TAB-TASTE für die automatische Vervollständigung. Die Vervollständigung mit der LEERTASTE wurde deaktiviert, um die problemlose Eingabe neuer Namen zu gestatten.
es: Nota: Use el carácter de tabulación para el autocompletado; la inclusión de espacios está deshabilitada para evitar interferencias con un nuevo nombre.
fr: Remarque : utilisez la touche Tab pour effectuer une saisie semi-automatique ; la saisie semi-automatique à l'aide de l'espace est désactivée pour éviter toute interférence avec un nouveau nom.
it: Nota: usare TAB per il completamento automatico. Il completamento tramite la barra spaziatrice è disabilitato per evitare interferenze durante l'immissione di un nuovo nome.
ja: 注: タブを使用すると自動補完されます。新しい名前への干渉を避けるために、スペースの補完は無効になっています。
ko: 참고: 자동으로 완성되게 하려면 탭을 사용하세요. 새 이름의 입력을 방해하지 않으려면 공백 완성 기능을 사용하지 않도록 설정합니다.
pl: Uwaga: Użyj klawisza Tab do automatycznego uzupełniania; uzupełnianie za pomocą spacji jest wyłączone w celu uniknięcia konfliktu z nową nazwą.
pt_br: Observação: use tab para preenchimento automático; o preenchimento de espaço está desabilitado para evitar interferência com um nome novo.
ru: Примечание. Используйте клавишу TAB для автоматического завершения; завершение по нажатию клавиши ПРОБЕЛ отключено, чтобы избежать конфликта с новым именем.
tr: Not: Otomatik tamamlama için sekme kullanın; yeni adla karışmasından kaçınmak için boşluk tamamlama devre dışı bırakıldı.
zh_hans: 注意: 请使用制表符以便自动结束；禁用空格结束字符以避免干扰新名称。
zh_hant: 注意: 若要自動完成可使用 Tab 鍵; 而空格完成功能已停用，以免干擾新名稱。

source: <result alias>
cs: <alias výsledku>
de: <Ergebnisalias>
es: <alias de resultados>
fr: <alias de résultat>
it: <alias risultato>
ja: <結果のエイリアス>
ko: <결과 별칭>
pl: <alias wyniku>
pt_br: <alias de resultado>
ru: <псевдоним результата>
zh_hans: <结果别名>
zh_hant: <結果別名>

source: Type a new variable name
cs: Vložte nový název proměnné.
de: Geben Sie einen neuen Variablennamen ein
es: Escriba un nuevo nombre de variable
fr: Tapez un nouveau nom de variable
it: Digitare un nuovo nome di variabile
ja: 新しい変数の名前を入力します
ko: 새 변수 이름 입력
pl: Wpisz nową nazwę zmiennej
pt_br: Digite um novo nome de variável
ru: Введите новое имя переменной
tr: Yeni bir değişken adı yaz
zh_hans: 键入新变量名称
zh_hant: 輸入新的變數名稱

source: Note: Space and '=' completion are disabled to avoid potential interference. To insert a name from the list, use tab.
cs: Poznámka: Dokončení mezerou a znakem = je zakázané, aby se předešlo možné kolizi. Pro vložení názvu ze seznamu použijte tabulátor.
de: Hinweis: Die Vervollständigung mit der LEERTASTE und mit " =" wurde deaktiviert, um Probleme zu vermeiden. Verwenden Sie zum Einfügen eines Namens aus der Liste die TAB-TASTE.
es: Nota: La inclusión de espacios y "=" está deshabilitada para evitar posibles interferencias. Para insertar un nombre de la lista, utilice el carácter de tabulación.
fr: Remarque : les saisies semi-automatiques à l'aide de l'espace et de '=' sont désactivées pour éviter toute interférence éventuelle. Pour insérer un nom de la liste, utilisez la touche Tab.
it: Nota: il completamento tramite la barra spaziatrice e '=' è disabilitato per evitare possibili interferenze. Per inserire un nome dall'elenco, usare TAB.
ja: 注: 潜在的な干渉を避けるため、スペースと '=' の補完は無効になっています。リストから名前を挿入するには、タブを使用します。
ko: 참고: 입력을 방해하지 않으려면 공백 및 '=' 완성 기능을 사용하지 않도록 설정합니다. 목록에서 이름을 삽입하려면 탭을 사용하세요.
pl: Uwaga: Uzupełnianie za pomocą spacji i znaku „=” jest wyłączone w celu uniknięcia potencjalnych konfliktów. Aby wstawić nazwę z listy, użyj klawisza Tab.
pt_br: Observação: o preenchimento de espaço e "=" está desabilidado para evitar interferência em potencial. Para inserir um nome da lista, use tab.
ru: Примечание. Завершение по нажатию клавиши ПРОБЕЛ и "=" отключены во избежание возникновения потенциальных помех. Для вставки имени из списка используйте клавишу TAB.
tr: Not: Mümkün engellemelerden kaçınmak için boşluk ve '=' tamamlama devre dışı bırakıldı. Listeden bir ad eklemek için sekmeyi kullanın.
zh_hans: 注意: 禁用空格和“=”结束字符以避免潜在干扰。若要从列表中插入名称，请使用制表符。
zh_hant: 注意: 空格和 '=' 完成的功能已停用，以免造成可能的干擾。若要插入清單中的名稱，請使用 Tab 鍵。

source: <new resource>
cs: <nový zdroj>
de: <neue Ressource>
es: <nuevo recurso>
fr: <nouvelle ressource>
it: <nuova risorsa>
ja: <新しいリソース>
ko: <새 리소스>
pl: <nowy zasób>
pt_br: <novo recurso>
ru: <новый ресурс>
zh_hans: <新资源>
zh_hant: <新資源>

source: AddHandler statement
cs: Příkaz AddHandler
de: AddHandler-Anweisung
es: Instrucción AddHandler
fr: Instruction AddHandler
it: Istruzione AddHandler
ja: AddHandler ステートメント
ko: AddHandler 문
pl: Instrukcja AddHandler
pt_br: Instrução AddHandler
ru: Оператор AddHandler
tr: AddHandler deyimi
zh_hans: AddHandler 语句
zh_hant: AddHandler 陳述式

source: RemoveHandler statement
cs: Příkaz RemoveHandler
de: RemoveHandler-Anweisung
es: Instrucción RemoveHandler
fr: Instruction RemoveHandler
it: Istruzione RemoveHandler
ja: RemoveHandler ステートメント
ko: RemoveHandler 문
pl: Instrukcja RemoveHandler
pt_br: Instrução RemoveHandler
ru: Оператор RemoveHandler
tr: RemoveHandler deyimi
zh_hans: RemoveHandler 语句
zh_hant: RemoveHandler 陳述式

source: {0} function
cs: Funkce {0}
de: {0}-Funktion
es: Función {0}
fr: Fonction {0}
it: Funzione {0}
ja: {0} 関数
ko: {0} 함수
pl: Funkcja {0}
pt_br: {0} função
ru: функция {0}
tr: {0} işlevi
zh_hans: {0} 函数
zh_hant: {0} 函式

source: CType function
cs: Funkce CType
de: CType-Funktion
es: Función CType
fr: Fonction CType
it: Funzione CType
ja: CType 関数
ko: CType 함수
pl: Funkcja CType
pt_br: Função CType
ru: Функция CType
tr: CType işlevi
zh_hans: CType 函数
zh_hant: CType 函式

source: DirectCast function
cs: Funkce DirectCast
de: DirectCast-Funktion
es: Función DirectCast
fr: Fonction DirectCast
it: Funzione DirectCast
ja: DirectCast 関数
ko: DirectCast 함수
pl: Funkcja DirectCast
pt_br: Função DirectCast
ru: Функция DirectCast
tr: DirectCast işlevi
zh_hans: DirectCast 函数
zh_hant: DirectCast 函式

source: TryCast function
cs: Funkce TryCast
de: TryCast-Funktion
es: Función TryCast
fr: Fonction TryCast
it: Funzione TryCast
ja: TryCast 関数
ko: TryCast 함수
pl: Funkcja TryCast
pt_br: Função TryCast
ru: Функция TryCast
tr: TryCast işlevi
zh_hans: TryCast 函数
zh_hant: TryCast 函式

source: GetType function
cs: Funkce GetType
de: GetType-Funktion
es: Función GetType
fr: Fonction GetType
it: Funzione GetType
ja: GetType 関数
ko: GetType 함수
pl: Funkcja GetType
pt_br: Função GetType
ru: Функция GetType
tr: GetType işlevi
zh_hans: GetType 函数
zh_hant: GetType 函式

source: GetXmlNamespace function
cs: Funkce GetXmlNamespace
de: GetXmlNamespace-Funktion
es: Función GetXmlNamespace
fr: Fonction GetXmlNamespace
it: Funzione GetXmlNamespace
ja: GetXmlNamespace 関数
ko: GetXmlNamespace 함수
pl: Funkcja GetXmlNamespace
pt_br: Função GetXmlNamespace
ru: Функция GetXmlNamespace
tr: GetXmlNamespace işlevi
zh_hans: GetXmlNamespace 函数
zh_hant: GetXmlNamespace 函式

source: Mid statement
cs: Příkaz Mid
de: Mid-Anweisung
es: Instrucción Mid
fr: Instruction Mid
it: Istruzione Mid
ja: Mid ステートメント
ko: Mid 문
pl: Instrukcja Mid
pt_br: Instrução Mid
ru: Оператор Mid
tr: Mid deyimi
zh_hans: Mid 语句。
zh_hant: Mid 陳述式

source: Fix Incorrect Function Return Type
cs: Opravit nesprávný návratový typ funkce
de: Rückgabetyp für unzulässige Funktion beheben
es: Corregir tipo devuelto de función incorrecto
fr: Corriger le type de retour de fonction incorrect
it: Correggi tipo errato restituito da funzione
ja: 無効な関数の戻り値の型を修正する
ko: 잘못된 함수 반환 형식 수정
pl: Napraw nieprawidłowy typ zwracany funkcji
pt_br: Corrigir Tipo de Retorno de Função Incorreta
ru: Исправить неверный тип возвращения функции
tr: Hatalı İşlev Dönüş Türünü Düzelt
zh_hans: 修复不正确的函数返回类型
zh_hant: 修正不正確的函式傳回類型

source: Simplify name '{0}'
cs: Zjednodušit název {0}
de: Namen "{0}" vereinfachen
es: Simplificar nombre "{0}"
fr: Simplifier le nom '{0}'
it: Semplifica il nome '{0}'
ja: 名前 '{0}' の単純化
ko: {0}' 이름 단순화
pl: Uprość nazwę „{0}”
pt_br: Simplificar nome '{0}'
ru: Упрощение имени "{0}"
tr: {0}' adını basitleştir
zh_hans: 简化名称“{0}”
zh_hant: 簡化名稱 '{0}'

source: Simplify member access '{0}'
cs: Zjednodušit přístup ke členu {0}
de: Memberzugriff "{0}" vereinfachen
es: Simplificar acceso a miembros "{0}"
fr: Simplifier l'accès au membre '{0}'
it: Semplifica l'accesso dei membri '{0}'
ja: メンバーのアクセス '{0}' を単純化します
ko: 멤버 액세스 '{0}' 단순화
pl: Uprość dostęp do składowej „{0}”
pt_br: Simplificar acesso do membro '{0}'
ru: Упрощение доступа для членов "{0}"
tr: {0}' üye erişimini basitleştir
zh_hans: 简化成员访问“{0}”
zh_hant: 簡化成員存取 '{0}'

source: Remove 'Me' qualification
cs: Odebrat kvalifikaci Me
de: Qualifikation "Me" entfernen
es: Quitar calificación "Me"
fr: Supprimer la qualification 'Me'
it: Rimuovi qualificazione 'Me'
ja: 修飾子 'Me' を削除します
ko: Me' 한정자 제거
pl: Usuń kwalifikację „Me”
pt_br: Remover qualificação 'Me'
ru: Удаление квалификации Me
tr: Me' nitelemesini kaldır
zh_hans: 删除 "Me" 资格
zh_hant: 移除 'Me' 限定性條件

source: Name can be simplified
cs: Název se dá zjednodušit.
de: Der Name kann vereinfacht werden
es: El nombre se puede simplificar
fr: Le nom peut être simplifié
it: Il nome può essere semplificato
ja: 名前を簡略化できます
ko: 이름은 간단하게 줄일 수 있습니다.
pl: Nazwę można uprościć
pt_br: O nome pode ser simplificado
ru: Имя может быть упрощено
tr: Ad basitleştirilebilir
zh_hans: 可简化名称
zh_hant: 可以簡化名稱
