Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Used in a Declare statement. The Ansi modifier specifies that Visual Basic should marshal all strings to ANSI values, and should look up the procedure without modifying its name during the search. If no character set is specified, ANSI is the default.
cs: Používá se v příkazu Declare. Modifikátor Ansi určuje, že by měl Visual Basic zařazovat všechny řetězce na hodnoty ANSI a vyhledávat proceduru bez úpravy jejího názvu během vyhledávání. Pokud není zadaná žádná znaková sada, použije se jako výchozí nastavení ANSI.
de: Wird in einer Declare-Anweisung verwendet. Der Ansi-Modifizierer gibt an, dass Visual Basic alle Zeichenfolgen in ANSI-Werte marshallen und die Prozedur suchen soll, ohne ihren Namen bei der Suche zu ändern. Wenn kein Zeichensatz angegeben wird, ist ANSI der Standardwert.
es: Se utiliza en una instrucción Declare. El modificador Ansi especifica que Visual Basic debe serializar todas las cadenas como valores ANSI y buscar el procedimiento sin modificar su nombre durante la búsqueda. Si no se especifica ningún juego de caracteres, ANSI es el predeterminado.
fr: S'utilise dans une instruction Declare. Le modificateur Ansi spécifie que Visual Basic doit marshaler toutes les chaînes en valeurs ANSI et rechercher la procédure sans modifier son nom durant la recherche. Si aucun jeu de caractères n'est spécifié, ANSI est la valeur par défaut.
it: Usata in un'istruzione Declare. Il modificatore Ansi specifica che Visual Basic deve eseguire il marshalling di tutte le stringhe in valori ANSI e cercare la routine senza modificarne il nome durante la ricerca. Se non si specifica alcun set di caratteri, per impostazione predefinita viene usato il set ANSI.
ja: Declare ステートメントで使用されます。Ansi 修飾子は Visual Basic がすべての文字列を ANSI 値にマーシャリングし、検索中にその名前を変更せずにプロシージャを調べることを指定します。文字が指定されていない場合の既定値は、ANSI です。
ko: Declare 문에 사용됩니다. Ansi 한정자는 Visual Basic에서 모든 문자열을 ANSI 값으로 마샬링하고 프로시저를 검색하는 동안 프로시저 이름을 수정하지 않고 프로시저를 조회하도록 지정합니다. 문자 집합을 지정하지 않으면 ANSI가 기본값으로 사용됩니다.
pl: Używane w instrukcji Declare. Modyfikator Ansi określa, że język Visual Basic powinien kierować wszystkie ciągi jako wartości ANSI i sprawdzić procedurę bez modyfikowania jej nazwy podczas wyszukiwania. Jeśli nie ustawiono zestawu znaków, ANSI jest domyślnym zestawem.
pt_br: Usado em uma instrução Declare. O modificador Ansi especifica se o Visual Basic deve realizar marshaling de todas as cadeias de caracteres para valores ANSI e deve consultar o procedimento sem modificar seu nome durante a pesquisa. Se nenhum conjunto de caracteres for especificado, o padrão é ANSI.
ru: Используемый в операторе Declare. Модификатор Ansi указывает, что Visual Basic должен маршалировать все строки в значения ANSI и выполнить поиск процедуры без изменения имени во время поиска. Если набор символов не указан, то по умолчанию используется ANSI.
tr: Declare deyimi içinde kullanılır. Ansi değiştiricisi, Visual Basic'in tüm dizeleri ANSI değerleri olarak sıralaması ve yordamı, arama sırasında adını değiştirmeden araması gerektiğini belirtir. Eğer karakter kümesi belirtilmemişse, varsayılan ANSI'dir.
zh_hans: 用在 Declare 语句中。Ansi 修饰符指定 Visual Basic 应当将所有的字符串封送为 ANSI 值，并应查找相应的过程，但在搜索期间不修改该过程的名称。如果未指定字符集，则在默认情况下使用 ANSI。
zh_hant: 用在 Declare 陳述式中。Ansi 修飾詞會指定 Visual Basic 應將所有字串封送處理成 ANSI 值，且在搜尋期間，應查詢程序但不要修改其名稱。若未指定字元集，預設值就是 ANSI。

source: Specifies a data type in a declaration statement.
cs: Určuje datový typ v příkazu deklarace.
de: Gibt einen Datentyp in einer Deklarationsanweisung an.
es: Especifica un tipo de datos en una instrucción de declaración.
fr: Spécifie un type de données dans une instruction declaration.
it: Specifica un tipo di dati in un'istruzione della dichiarazione.
ja: 宣言ステートメントのデータ型を指定します。
ko: 선언 문의 데이터 형식을 지정합니다.
pl: Określa typ danych w instrukcji deklaracji.
pt_br: Especifica um tipo de dados em uma instrução de declaração.
ru: Задает тип данных в операторе объявления.
tr: Bir bildirim deyiminde veri türü belirtir.
zh_hans: 指定声明语句中的数据类型。
zh_hant: 在宣告陳述式中指定資料類型。

source: Specifies that an attribute at the beginning of a source file applies to the entire assembly. Otherwise the attribute will apply only to an individual programming element, such as a class or property.
cs: Určuje, že atribut na začátku zdrojového souboru se vztahuje na celé sestavení. Jinak se bude atribut vztahovat jenom na jednotlivý programový element, jako je třída nebo vlastnost.
de: Gibt an, dass ein Attribut am Anfang einer Quelldatei für die gesamte Assembly gilt. Andernfalls wird das Attribut nur auf ein bestimmtes Programmierelement angewendet, z.B. eine Klasse oder Eigenschaft.
es: Especifica que un atributo al principio de un archivo de código fuente se aplica a todo el ensamblado. En caso contrario, el atributo solo se aplica a un elemento de programación individual, como una clase o propiedad.
fr: Spécifie qu'un attribut situé au début d'un fichier source s'applique à l'intégralité de l'assembly. Sinon, l'attribut s'applique uniquement à un élément de programmation individuel, par exemple une classe ou une propriété.
it: Specifica che un attributo all'inizio di un file di origine deve essere applicato all'intero assembly. In caso contrario, l'attributo verrà applicato solo a un singolo elemento di programmazione, ad esempio una classe o una proprietà.
ja: ソース ファイルの冒頭にある属性がアセンブリ全体に適用されることを示します。これを示さない場合、属性はクラスやプロパティなどの個別のプログラミング要素にのみ適用されます。
ko: 소스 파일의 시작 부분에 있는 특성이 전체 어셈블리에 적용되도록 지정합니다. 그렇게 하지 않으면 특성이 클래스나 속성 같은 개별 프로그래밍 요소에만 적용됩니다.
pl: Określa, że atrybut znajdujący się na początku pliku źródłowego dotyczy całego zestawu. W przeciwnym wypadku atrybut będzie dotyczył tylko pojedynczego elementu programistycznego, takiego jak klasa lub właściwość.
pt_br: Especifica que um atributo no início de um arquivo de origem se aplica ao assembly inteiro. Caso contrário, o atributo será aplicado apenas a um elemento de programação específico, como uma classe ou propriedade.
ru: Указывает, что атрибут в начале исходного файла применяется ко всей сборке. В противном случае атрибут будет применяться только к отдельному программному элементу, например классу или свойству.
tr: Bir kaynak dosyasının başında, tüm derlemeye uygulanacak bir öznitelik belirtir. Aksi durumda; öznitelik yalnızca tek programlama öğesine uygulanır, örneğin bir sınıf ya da özellik.
zh_hans: 指定源文件开头的特性应用于整个程序集。否则，该特性将仅应用于单个编程元素，如类或属性。
zh_hant: 指定在原始程式檔開頭的屬性，會套用到整個組件。否則，屬性將只會套用到個別的程式設計元素，例如類別或屬性。

source: Indicates an asynchronous method that can use the Await operator.
cs: Označuje asynchronní metodu, která může použít operátor Await.
de: Zeigt eine asynchronone Methode an, die den Await-Operator verwenden kann.
es: Indica un método asincrónico que puede usar el operador Await.
fr: Indique une méthode asynchrone pouvant utiliser l'opérateur Await.
it: Indica un metodo asincrono che può usare l'operatore Await.
ja: Await 演算子を使用できる非同期メソッドを示します。
ko: Await 연산자를 사용할 수 있는 비동기 메서드를 나타냅니다.
pl: Oznacza metodę asynchroniczną, w której można używać operatora Await.
pt_br: Indica um método assíncrono que pode usar o operador Await.
ru: Указывает асинхронный метод, который может использовать оператор Await.
tr: Await operatörünü kullanabilen zaman uyumsuz yöntemi gösterir.
zh_hans: 指示可使用 Await 运算符的异步方法。
zh_hant: 指出可以使用 Await 運算子的非同步方法。

source: Used in a Declare statement. The Auto modifier specifies that Visual Basic should marshal strings according to .NET Framework rules, and should determine the base character set of the run-time platform and possibly modify the external procedure name if the initial search fails.
cs: Používá v příkazu Declare. Modifikátor Auto určuje, že by měl Visual Basic zařazovat řetězce podle pravidel rozhraní .NET Framework a stanovit základní znakovou sadu pro běhovou platformu a případně upravit název externí procedury, pokud selže počáteční vyhledávání.
de: Wird in einer Declare-Anweisung verwendet. Der Auto-Modifizierer gibt an, dass Visual Basic die Zeichenfolge gemäß der .NET Framework-Regeln marshallen, den Basiszeichensatz der Laufzeitplattform ermitteln und möglicherweise den externen Prozedurnamen ändern soll, wenn bei der ersten Suche ein Fehler auftritt.
es: Se utiliza en una instrucción Declare. El modificador Auto especifica que Visual Basic debe serializar las cadenas de acuerdo con las reglas de .NET Framework, y debe determinar el juego de caracteres base de la plataforma en tiempo de ejecución y, posiblemente, modificar el nombre del procedimiento externo si la búsqueda inicial produce un error.
fr: S'utilise dans une instruction Declare. Le modificateur Auto spécifie que Visual Basic doit marshaler les chaînes selon les règles du .NET Framework, déterminer le jeu de caractères de base de la plateforme d'exécution et éventuellement modifier le nom de la procédure externe en cas d'échec de la recherche initiale.
it: Usata in un'istruzione Declare. Il modificatore Auto specifica che Visual Basic deve eseguire il marshalling delle stringhe in base alle regole di .NET Framework, nonché determinare il set di caratteri di base della piattaforma di esecuzione e, se possibile, modificare il nome della routine esterna se la ricerca iniziale ha esito negativo.
ja: Declare ステートメントで使用されます。Auto 修飾子は Visual Basic が .NET Framework の規則に従って文字列をマーシャリングし、実行時プラットフォームの基本文字セットを決定して、最初の検索が失敗した場合には外部プロシージャ名を変更することを指定します。
ko: Declare 문에 사용됩니다. Auto 한정자는 Visual Basic에서 .NET Framework 규칙에 따라 문자열을 마샬링하고 런타임 플랫폼의 기본 문자 집합을 결정하고 초기 검색에 실패할 경우 외부 프로시저 이름을 수정하도록 지정합니다.
pl: Używane w instrukcji Declare. Modyfikator Auto określa, że język Visual Basic powinien kierować wszystkie ciągi zgodnie z regułami programu .NET Framework i powinien ustalić podstawowy zestaw znaków platformy uruchomieniowej i możliwie zmodyfikować nazwę procedury zewnętrznej, jeśli początkowe wyszukiwanie się nie powiedzie.
pt_br: Usado em uma instrução Declare. O modificador Auto especifica que o Visual Basic deve fazer marshaling de cadeias de caracteres de acordo com as regras do .NET Framework e deve determinar o conjunto de caracteres base da plataforma de tempo de execução e possivelmente modificar o nome do procedimento externo se a pesquisa inicial falhar.
ru: Используемый в операторе Declare. Модификатор Auto указывает, что Visual Basic должен маршалировать строки в соответствии с правилами .NET Framework и определить базовый набор символов платформы во время выполнения и, возможно, изменить имя внешней процедуры, если начальный поиск не удается.
tr: Declare deyimi içinde kullanılır. Auto değiştiricisi, Visual Basic'in dizeleri .NET Framework kurallarına göre sıralaması ve çalışma zamanı platformunun temel karakter kümesini belirlemesi ve ilk arama başarısız olursa dış yordam adının değiştirilmesi gerektiğini belirtir.
zh_hans: 用在 Declare 语句中。Auto 修饰符指定 Visual Basic 应按照 .NET Framework 规则封送字符串，并指定 Visual Basic 应确定运行时平台的基字符集，而且在最初搜索失败的情况下，修改外部过程的名称(如果可能的话)。
zh_hant: 用在 Declare 陳述式中。Auto 修飾詞可指定 Visual Basic 應該根據 .NET Framework 規則封送處理字串，且應判斷執行階段平台的基礎字元集，若初始搜尋失敗，還可能修改外部程序名稱。

source: Specifies that an argument is passed in such a way that the called procedure can change the underlying value of the argument in the calling code.
cs: Určuje, že argument se předává takovým způsobem, že volaná procedura může změnit nadřazenou hodnotu argumentu ve volajícím kódu.
de: Gibt an, dass ein Argument so übergeben wird, dass die aufgerufene Prozedur den zugrunde liegenden Wert des Arguments im aufrufenden Code ändern kann.
es: Especifica que un argumento se pasa de manera que el procedimiento al que se llama puede cambiar el valor subyacente del argumento en el código de llamada.
fr: Spécifie qu'un argument est passé de sorte que la procédure appelée peut modifier la valeur sous-jacente de l'argument dans le code appelant.
it: Specifica che un argomento viene passato in modo tale che la routine chiamata possa modificare il valore sottostante dell'argomento nel codice chiamante.
ja: 呼び出されたプロシージャが、呼び出しコードの引数の基になる値を変更できるように引数を渡すことを指定します。
ko: 호출된 프로시저가 호출 코드의 내부 인수 값을 변경할 수 있는 방식으로 인수가 전달되도록 지정합니다.
pl: Określa, że argument jest przekazywany w taki sposób, że wywoływana procedura może zmienić podstawową wartość argumentu w wywoływanym kodzie.
pt_br: Especifica se um argumento é passado de tal forma que o procedimento chamado pode alterar o valor subjacente do argumento no código de chamada.
ru: Указывает, что аргумент передается таким образом, что в вызываемой процедуре невозможно изменить базовое значение аргумента в вызывающем коде.
tr: Bir bağımsız değişkenin, çağıran koddaki bağımsız değişkenin temel alınan değerinin çağrılan yordam tarafından değiştirilebilecek şekilde geçirildiğini belirtir.
zh_hans: 指定按被调用过程可以更改调用代码中参数的基础值的方式来传递参数。
zh_hant: 將引數的傳遞方式，指定為可讓呼叫的程序能變更呼叫程式碼中引數的基礎值。

source: Specifies that an argument is passed in such a way that the called procedure or property cannot change the underlying value of the argument in the calling code.
cs: Určuje, že argument se předává takovým způsobem, že volaná procedura nebo vlastnost nemůže změnit nadřazenou hodnotu argumentu ve volajícím kódu.
de: Gibt an, dass ein Argument so übergeben wird, dass die aufgerufene Prozedur oder Eigenschaft den zugrunde liegenden Wert des Arguments im aufrufenden Code nicht ändern kann.
es: Especifica que un argumento se pasa de manera que la propiedad o el procedimiento al que se llama no puede cambiar el valor subyacente del argumento en el código de llamada.
fr: Spécifie qu'un argument est passé de sorte que la procédure ou propriété appelée ne peut pas modifier la valeur sous-jacente de l'argument dans le code appelant.
it: Specifica che un argomento viene passato in modo tale che la routine o proprietà chiamata non possa modificare il valore sottostante dell'argomento nel codice chiamante.
ja: 呼び出されたプロシージャまたはプロパティが、呼び出しコードの引数の基になる値を変更できないように引数を渡すことを指定します。
ko: 호출된 프로시저 또는 속성이 호출 코드의 내부 인수 값을 변경할 수 없는 방식으로 인수가 전달되도록 지정합니다.
pl: Określa, że argument jest przekazywany w taki sposób, że wywoływana procedura lub właściwość nie może zmienić podstawowej wartości argumentu w wywoływanym kodzie.
pt_br: Especifica se um argumento é passado de tal forma que o procedimento ou propriedade chamados não pode alterar o valor subjacente do argumento no código de chamada.
ru: Указывает, что аргумент передается таким образом, что в вызываемой процедуре или свойстве невозможно изменить базовое значение аргумента в вызывающем коде.
tr: Bir bağımsız değişkenin, çağıran koddaki bağımsız değişkenin temel alınan değerinin çağrılan yordam veya özellik tarafından değiştirilemeyecek şekilde geçirildiğini belirtir.
zh_hans: 指定按被调用过程或属性无法更改调用代码中参数的基础值的方式来传递参数。
zh_hant: 將引數的傳遞方式，指定為可讓呼叫的程序或屬性無法變更呼叫程式碼中引數的基礎值。

source: Declares the name of a class and introduces the definitions of the variables, properties, and methods that make up the class.
cs: Deklaruje název třídy a zavádí definici proměnných, vlastností a metod, které tvoří třídu.
de: Deklariert den Namen einer Klasse und führt die Definitionen der Variablen, Eigenschaften und Methoden ein, aus denen die Klasse besteht.
es: Declara el nombre de una clase e introduce las definiciones de las variables, propiedades y métodos que la componen.
fr: Déclare le nom d'une classe et introduit les définitions des variables, propriétés et méthodes qui constituent la classe.
it: Dichiara il nome di una classe e introduce le definizioni delle variabili, delle proprietà e dei metodi che costituiscono la classe.
ja: クラスの名前を宣言し、そのクラスを構成する変数、プロパティ、メソッドの定義を示します。
ko: 클래스 이름을 선언하고 클래스를 구성하는 변수, 속성 및 메서드의 정의를 지정합니다.
pl: Deklaruje nazwę klasy i wprowadza definicje zmiennych, właściwości i metod, które tworzą klasę.
pt_br: Declara o nome de uma classe e apresenta as definições de variáveis, propriedades e métodos que formam a classe.
ru: Объявляет имя класса и вводит определение переменных, свойств и методов, которые составляют класс.
tr: Bir sınıfın adını bildirir ve sınıfı oluşturan değişkenler, özellikler ve yöntemlerin tanımlarını ortaya çıkarır.
zh_hans: 声明类名称，并引入组成类的变量、属性和方法的定义。
zh_hant: 宣告類別的名稱，並引進組成類別之變數、屬性與方法的定義。

source: Generates a string concatenation of two expressions.
cs: Generuje řetězec vzniklý zřetězením dvou výrazů.
de: Generiert eine Zeichenfolgenverkettung aus zwei Ausdrücken.
es: Genera una concatenación de dos expresiones.
fr: Génère une concaténation de chaîne de deux expressions.
it: Genera una concatenazione di stringa di due espressioni.
ja: 2 つの式の文字列連結を生成します。
ko: 두 식의 문자열 연결을 생성합니다.
pl: Generuje złączony ciąg dla dwóch wyrażeń.
pt_br: Gera uma concatenação de cadeia de caracteres de duas expressões.
ru: Создает конкатенацию строк для двух выражений.
tr: İki ifade birleşiminden bir dize üretir.
zh_hans: 生成两个表达式的字符串串联。
zh_hant: 產生兩個運算式的字串串連。

source: Declares and defines one or more constants.
cs: Deklaruje a definuje nejmíň jednu konstantu.
de: Deklariert und definiert eine oder mehrere Konstanten.
es: Declara y define una o varias constantes.
fr: Déclare et définit une ou plusieurs constantes.
it: Dichiara e definisce una o più costanti.
ja: 1 つ以上の定数を宣言して定義します。
ko: 하나 이상의 상수를 선언하고 정의합니다.
pl: Deklaruje i definiuje co najmniej jedną stałą.
pt_br: Declara e define uma ou mais constantes.
ru: Объявляет и определяет одно или несколько констант.
tr: Bir ya da daha fazla sabiti bildirir ve tanımlar.
zh_hans: 声明和定义一个或多个常量。
zh_hant: 宣告並定義一或多個常數。

source: Use 'In' for a type that will only be used for ByVal arguments to functions.
cs: Klíčové slovo In použijte pro typ, který se bude používat jenom jako argument ByVal do funkcí.
de: Verwenden Sie "In" für einen Typen, der nur für ByVal-Argumente in Funktionen verwendet wird.
es: Use "In" para un tipo que se usará solo para argumentos ByVal para funciones.
fr: Utilisez 'In' pour un type qui ne sera utilisé que pour les arguments ByVal transmis à des fonctions.
it: Usare 'In' per un tipo che verrà usato solo per for argomenti ByVal di funzioni.
ja: 関数への引数 ByVal としてのみ使用される型には 'In' を使用します。
ko: 함수의 ByVal 인수에만 사용되는 형식에 'In'을 사용하세요.
pl: Użyj słowa In dla typów używanych tylko dla argumentów ByVal dla funkcji.
pt_br: Use "In" para um tipo que somente será usado para os argumentos de ByVal para funções.
ru: Используйте "In" для типа, который будет использоваться только для аргументов функций ByVal.
tr: İşlevlere sadece ByVal bağımsız değişkenleri ile geçirilecek bir tür için 'In' kullanın.
zh_hans: 对仅用于函数的 ByVal 参数的类型使用“In”。
zh_hant: 針對只用於函式中 ByVal 引數的類型，使用 'In'。

source: Use 'Out' for a type that will only be used as a return from functions.
cs: Klíčové slovo Out použijte pro typ, který se bude používat jenom jako návratový typ z funkcí.
de: Verwenden Sie "Out" für einen Typen, der nur als Rückgabe von Funktionen verwendet wird.
es: Use "Out" para un tipo que se usará solo como dato devuelto por funciones.
fr: Utilisez 'Out' pour un type qui ne sera utilisé que comme un retour de fonctions.
it: Usare 'Out' per un tipo che verrà usato solo come tipo restituito da funzioni.
ja: 関数の戻り値としてのみ使用される型には 'Out' を使用します。
ko: 함수에서의 반환 형식으로만 사용되는 형식에 'Out'을 사용하세요.
pl: Użyj słowa Out dla typów używanych tylko jako typ zwracany funkcji.
pt_br: Use "Out" para um tipo que somente será usado como um retorno de funções.
ru: Используйте "Out" для типа, который будет использоваться только как возврат из функций.
tr: İşlevlerde sadece geri döndürme işlevi için kullanılacak türler için 'Out' kullanın.
zh_hans: 对仅用作函数的返回值的类型使用“Out”。
zh_hant: 針對只用做為函式傳回值的類型，使用 'Out'。

source: Returns the result of explicitly converting an expression to a specified data type, object, structure, class, or interface. CType(Object As Expression, Object As Type) As Type
cs: Vrací výsledek explicitně převedeného výrazu na zadaný datový typ, objekt, strukturu, třídu nebo rozhraní. CType(Object As Expression, Object As Type) As Type
de: Gibt das Ergebnis einer expliziten Konvertierung eines Ausdrucks in einen angegebenen Datentyp, ein Objekt, eine Struktur, Klasse oder Schnittstelle zurück. CType(Object As Expression, Object As Type) As Type
es: Devuelve el resultado de convertir explícitamente una expresión en un tipo de datos, objeto, estructura, clase o interfaz especificados. CType(Object As Expression, Object As Type) As Type
fr: Retourne le résultat d'une conversion explicite d'une expression en un type de données, objet, structure, classe ou interface spécifié. CType(Object As Expression, Object As Type) As Type
it: Restituisce il risultato della conversione esplicita di un'espressione in un tipo di dati, una struttura, una classe, un'interfaccia o un oggetto specificato. CType(Object As Expression, Object As Type) As Type
ja: 指定されたデータ型、オブジェクト、構造体、クラス、またはインターフェイスに式を明示的に変換した結果を返します。 CType(Object As Expression, Object As Type) As Type
ko: 식을 지정한 데이터 형식, 개체, 구조체, 클래스 또는 인터페이스로 명시적으로 변환한 결과를 반환합니다. CType(Object As Expression, Object As Type) As Type
pl: Zwraca wynik jawnej konwersji wyrażenia do określonego typu danych, obiektu, struktury lub interfejsu. CType(Object As Expression, Object As Type) As Type
pt_br: Retorna o resultado da conversão explícita de uma expressão para um tipo de dados, objeto, estrutura, classe ou interface especificados. CType(Object As Expression, Object As Type) As Type
ru: Возвращает результат явного преобразования выражения в указанный тип данных, объект, структуру, класс или интерфейс. CType(Object As Expression, Object As Type) As Type
tr: Bir ifadenin belirtilen bir veri türüne, nesneye, yapıya, sınıfa ya da arabirime açıkça dönüştürülme sonucunu döndürür. CType(Object As Expression, Object As Type) As Type
zh_hans: 返回表达式显式转换为指定的数据类型、对象、结构、类或接口的结果。 CType(Object As Expression, Object As Type) As Type
zh_hant: 傳回運算式明確轉換成指定之資料類型、物件、結構、類別或介面的結果。 CType(Object As Expression, Object As Type) As Type

source: Specifies that an event has additional, specialized code for adding handlers, removing handlers, and raising events.
cs: Určuje, že událost má další, speciální kód pro přidávání a odebírání obslužných rutin a vyvolávání událostí.
de: Gibt an, dass ein Ereignis über zusätzlichen speziellen Code zum Hinzufügen von Handlern, Entfernen von Handlern und Auslösen von Ereignissen verfügt.
es: Especifica que un evento tiene código adicional especializado para agregar controladores, quitar controladores y generar eventos.
fr: Spécifie qu'un événement dispose d'un code spécialisé supplémentaire pour l'ajout de gestionnaires, la suppression de gestionnaires et le déclenchement d'événements.
it: Specifica che un evento ha codice aggiuntivo specifico per l'aggiunta di gestori, la rimozione di gestori e la generazione di eventi.
ja: イベントに対してハンドラーの追加、ハンドラーの削除、イベントの発生に関する追加の特定コードが記述されていることを示します。
ko: 처리기 추가, 처리기 제거, 이벤트 발생 등의 특수화된 추가 코드를 사용하는 이벤트를 지정합니다.
pl: Określa, że zdarzenie ma dodatkowy, wyspecjalizowany kod do dodawania procedur obsługi, usuwania procedur obsługi i wywoływania zdarzeń.
pt_br: Especifica se um evento tem um código especializado adicional para adicionar manipuladores, remover manipuladores e gerar eventos.
ru: Указывает, что событие имеет дополнительный, специализированный код для добавления обработчиков, удаления обработчиков и вызова событий.
tr: Bir olayın işleyici ekleme, işleyici kaldırma ve olay tetikleme için ek, nitelikli koda sahip olduğunu belirtir.
zh_hans: 指定事件具有附加专用代码来添加处理程序、删除处理程序和引发事件。
zh_hant: 指定事件有額外的特定程式碼，可加入處理常式、移除處理常式，以及引發事件。
