Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Sets the string comparison method specified in Option Compare to a strict binary sort order.
cs: Nastaví metodu porovnání řetězce, určenou v příkazu Option Compare, na striktní binární řazení.
de: Legt die in "Option Compare" angegebene Zeichenfolgenvergleichsmethode auf eine streng binäre Sortierreihenfolge fest.
es: Establece el método de comparación de cadenas especificado en Option Compare en un criterio de ordenación binario estricto.
fr: Définit la méthode de comparaison de chaînes spécifiée dans Option Compare selon un ordre de tri binaire strict.
it: Imposta il metodo di confronto tra stringhe specificato in Option Compare su un ordinamento binario ridotto.
ja: Option Compare で指定する文字列の比較方法を、厳密なバイナリの並べ替え順序に設定します。
ko: Option Compare에 지정된 문자열 비교 메서드를 엄격한 이진 정렬 순서로 설정합니다.
pl: Ustawia metodę porównywania ciągów określoną w opcji Option Compare na ścisły binarny porządek sortowania.
pt_br: Define o método de comparação de cadeia de caracteres especificado na Opção Compare como uma ordem de classificação binária estrita.
ru: Устанавливает метод сравнения строк, указанных в параметре Option Compare для строгого двоичного порядка сортировки.
tr: Option Compare içinde belirtilen dize karşılaştırma yöntemini katı ikili sıralama olarak ayarlar.
zh_hans: 将 Option Compare 中所指定的字符串比较方法设置为严格的二进制排序顺序。
zh_hant: 將 Option Compare 中指定的字串比較方法，設定為嚴格的二進位排序順序。

source: Specifies the element keys used for grouping (in Group By) or sort order (in Order By).
cs: Určuje klíče prvků použité pro seskupování (v Group By) nebo třízení (v Order By).
de: Gibt die Elementschlüssel zum Gruppieren (bei "Group By") oder für die Sortierreihenfolge an (bei "Order By").
es: Especifica las claves de elemento utilizadas para la agrupación (en Group By) o para el criterio de ordenación (en Order By).
fr: Spécifie les clés d'éléments utilisées pour le regroupement (dans Group By) ou l'ordre de tri (dans Order By).
it: Specifica le chiavi di elementi usate per il raggruppamento (in Group By) o l'ordinamento (in Order By).
ja: グループ化 (Group By) または並べ替え順序 (Order By) に対して使用される要素キーを指定します。
ko: 그룹화(Group By) 또는 정렬 순서(Order By)에 사용할 요소 키를 지정합니다.
pl: Określa klucze elementów używane do grupowania (w klauzuli Group By) lub do sortowania (w klauzuli Order By).
pt_br: Especifica as chaves de elemento usadas para agrupamento (em Agrupar Por) ou ordem de classificação (em Classificar Por).
ru: Определяет ключи элемента, используемые для группировки (в Group By) или порядка сортировки (в Order By).
tr: Gruplama (Group By içinde) ya da sıralama düzeni (Order By içinde) için kullanılan öğe anahtarlarını belirtir.
zh_hans: 指定用于分组(在 Group By 中)或排序顺序(在 Order By 中)的元素键。
zh_hant: 指定用於分組 (Group By 中) 或排序順序 (Order By 中) 的元素索引鍵。

source: Transfers execution to a Function, Sub, or dynamic-link library (DLL) procedure. [Call] <procedureName> [(<argumentList>)]
cs: Přenese vykonávání na Function, Sub nebo proceduru knihovny DLL. [Call] <název_procedury> [(<seznam_argumentů>)]
de: Überträgt die Ausführung an die Function-Prozedur, Sub-Prozedur oder DLL-Prozedur (Dynamic-Link Library). [Call] <Prozedurname> [(<Argumentliste>)]
es: Transfiere la ejecución a un procedimiento Function, Sub o de biblioteca de vínculos dinámicos (DLL). [Call] <nombreDeProcedimiento> [(<listaDeArgumentos>)]
fr: Transfère l'exécution vers une procédure Function, Sub ou de bibliothèque de liens dynamiques (DLL). [Call] <procedureName> [(<argumentList>)]
it: Trasferisce l'esecuzione a una routine Function, Sub o DLL (libreria a collegamento dinamico). [Call] <nomeRoutine> [(<elencoArgomenti>)]
ja: Function、Sub、またはダイナミック リンク ライブラリ (DLL) プロシージャに実行を移します。 [Call] <procedureName> [(<argumentList>)]
ko: Function, Sub 또는 DLL(동적 연결 라이브러리) 프로시저로 실행을 이동합니다. [Call] <procedureName> [(<argumentList>)]
pl: Przenosi wykonanie do procedury Function, Sub lub do procedury biblioteki dołączanej dynamicznie (DLL). [Call] <nazwaProcedury> [(<listaArgumentów>)]
pt_br: Transfere a execução para um procedimento Function, Sub ou biblioteca de vínculo dinâmico (DLL). [Call] <procedureName> [(<argumentList>)]
ru: Передает выполнение Function, Sub или процедуре библиотеки динамической компоновки (DLL). [Call] <procedureName> [(<argumentList>)]
tr: Yürütmeyi bir İşlev, Alt Yordam ya da dinamik bağlantı kitaplığı (DLL) yordamına aktarır. [Call] <procedureName> [(<argumentList>)]
zh_hans: 将执行过程转移到 Function、Sub 或动态链接库(DLL)过程。 [Call] <procedureName> [(<argumentList>)]
zh_hant: 將執行轉移到 Function、Sub 或動態連結程式庫 (DLL) 程序。 [Call] <procedureName> [(<argumentList>)]

source: Introduces the statements to run if none of the previous cases in the Select Case statement returns True.
cs: Zavádí příkazy ke spuštění, pokud žádný z předchozích případů příkazu Select Case nevrací hodnotu True.
de: Führt die auszuführenden Anweisungen ein, wenn keiner der vorhergehenden Fälle in der Select Case-Anweisung True zurückgibt.
es: Introduce las instrucciones que se ejecutan si ninguno de los casos anteriores de la instrucción Select Case devuelve True.
fr: Introduit les instructions à exécuter si aucun des cas précédents de l'instruction Select Case ne retourne la valeur True.
it: Introduce le istruzioni da eseguire se nessuno dei casi precedenti nell'istruzione Select Case restituisce True.
ja: Select Case ステートメントの前述のケースのいずれも True を返さない場合に実行するステートメントを導入します。
ko: Select Case 문에서 이전 조건이 True를 반환하지 않을 경우 실행할 문을 지정합니다.
pl: Wprowadza instrukcje do uruchomienia, jeśli żaden z poprzednich przypadków w instrukcji Select Case nie zwraca wartości True.
pt_br: Apresenta as instruções a serem executadas se nenhum dos casos anteriores na instrução Select Case retornar Verdadeiro.
ru: Вводит операторы, которые выполняются, если ни одно из предыдущих случаев для оператора Select Case не возвращает значение True.
tr: Select Case deyimi içinde, kendinden önceki hiçbir durum True değer döndürmezse çalıştırılacak deyimleri ortaya çıkarır.
zh_hans: 引入一些要在 Select Case 语句中前面所有的情况都不返回 True 时运行的语句。
zh_hant: 引進在 Select Case 陳述式中先前的案例都未傳回 True 時，會執行的陳述式。

source: Followed by a comparison operator and then an expression, Case Is introduces the statements to run if the Select Case expression combined with the Case Is expression evaluates to True.
cs: Příkaz Case Is, za kterým následuje operátor porovnání a pak výraz, zavádí příkazy, které se spustí, pokud se výraz příkazu Select Case v kombinaci s výrazem příkazu Case Is vyhodnotí jako True.
de: Wenn danach ein Vergleichsoperator und ein Ausdruck folgen, führt "Case Is" die auszuführenden Anweisungen ein, wenn der Select Case-Ausdruck kombiniert mit dem Case Is-Ausdruck als True ausgewertet wird.
es: Seguida de un operador de comparación y luego de una expresión, Case Is introduce las instrucciones que se ejecutan si la expresión Select Case combinada con la expresión Case Is se evalúa como True.
fr: Suivi d'un opérateur de comparaison et d'une expression, Case Is introduit les instructions à exécuter si l'expression Select Case combinée avec l'expression Case Is a la valeur True.
it: Seguita da un operatore di confronto e quindi da un'espressione, Case Is introduce le istruzioni da eseguire se l'espressione Select Case combinata con l'espressione Case Is restituisce True.
ja: 後ろに比較演算子と式を付加すると、 Case Is 式と組み合わされた Select Case 式が True と評価された場合に実行されるステートメントを導入します。
ko: 이 키워드 뒤에는 비교 연산자와 식이 차례로 나옵니다. Case Is는 Case Is 식과 함께 사용하는 Select Case 식이 True인 경우 실행할 문을 지정합니다.
pl: Słowo kluczowe Case Is, po którym następuje operator porównania i wyrażenie, wprowadza instrukcje do uruchomienia, jeśli wyrażenie Select Case w połączeniu z wyrażeniem Case Is daje w wyniku wartość True.
pt_br: Seguido por um operador de comparação e depois uma expressão, Case Is apresenta as instruções a serem executadas se a expressão Select Case combinada com a expressão Case Is for avaliada como Verdadeiro.
ru: Далее следует оператор сравнения, а затем выражение, Case Is вводит операторы, которые выполняются, если выражение Select Case и выражение Case Is имеют значение True.
tr: Ardından bir karşılaştırma operatörü ve ifade gelen Case Is, Select Case ifadesi ile Case Is ifadesinin birleşimi True değerlendiriliyorsa çalıştırılacak olan deyimleri ortaya çıkarır.
zh_hans: 后跟一个比较运算符，再后面是一个表达式。Case Is 引入一些要在与 Case Is 表达式结合使用的 Select Case 表达式的计算结果为 True 时运行的语句。
zh_hant: 其後接著比較運算子，再接著運算式，Case Is 會引進當 Select Case 運算式與 Case Is 運算式組合在一起若評估為 True 時，所要執行的陳述式。

source: Introduces a value, or set of values, against which the value of an expression in a Select Case statement is to be tested. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
cs: Zavádí hodnotu nebo množinu hodnot, oproti kterým se má testovat hodnota výrazu příkazu Select Case. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
de: Führt einen Wert oder eine Gruppe von Werten ein, anhand derer der Wert eines Ausdrucks in einer Select Case-Anweisung geprüft werden soll. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
es: Introduce un valor o un conjunto de valores con el que se comprueba el valor de una expresión en una instrucción Select Case. Case {<expresión>|<expresión1> To <expresión2>|[Is] <operadorDeComparación> <expresión>}
fr: Introduit une valeur ou un ensemble de valeurs à tester par rapport à la valeur d'une expression dans une instruction Select Case. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
it: Introduce un valore o un set di valori rispetto a cui deve essere testato il valore di un'espressione in un'istruzione Select Case. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
ja: Select Case ステートメントの式の値がテストされる値または値のセットを導入します。 Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
ko: Case 문 Select Case 문에서 식의 값을 테스트할 대상 값 또는 값 집합을 지정합니다. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
pl: Wprowadza wartość lub zbiór wartości, z którymi ma być porównywana wartość wyrażenia w instrukcji Select Case. Case {<wyrażenie>|<wyrażenie1> To <wyrażenie2>|[Is] <operatorPorównania> <wyrażenie>}
pt_br: Apresenta um valor ou conjunto de valores, em relação ao qual o valor de uma expressão em uma instrução Select Case deve ser testado. Caso {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
ru: Вводит значение или набор значений, относительно которых происходит проверка значения выражения оператора Select Case. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
tr: Select Case deyimi içindeki ifadenin değeri ile test edilecek bir değer ya da değerler kümesi ortaya çıkarır. Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
zh_hans: 引入一个或一组值，要对照这些值来测试 Select Case 语句中表达式的值。 Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}
zh_hant: 引進一個值或一組值，並利用該值或該組值來測試 Select Case 陳述式中運算式的值。 Case {<expression>|<expression1> To <expression2>|[Is] <comparisonOperator> <expression>}

source: Introduces a statement block to be run if the specified exception occurs inside a Try block.
cs: Zavádí blok příkazů ke spuštění, pokud nastane uvnitř bloku Try zadaná výjimka.
de: Führt einen auszuführenden Anweisungsblock ein, wenn die angegebene Ausnahme in einem Try-Block auftritt.
es: Introduce un bloque de instrucciones que se ejecuta si la excepción especificada se produce dentro de un bloque Try.
fr: Introduit un bloc d'instructions à exécuter si l'exception spécifiée se produit à l'intérieur d'un bloc Try.
it: Introduce un blocco di istruzioni da eseguire se l'eccezione specificata si verifica all'interno di un blocco Try.
ja: 指定された例外が Try ブロックの内部で発生した場合に実行されるステートメント ブロックを導入します。
ko: 지정한 예외가 Try 블록 안에서 발생할 경우 실행할 문 블록을 지정합니다.
pl: Wprowadza blok instrukcji do uruchomienia, jeśli określony wyjątek wystąpi wewnątrz bloku Try.
pt_br: Apresenta um bloco de instruções a ser executado se a exceção especificada ocorrer dentro de um bloco Try.
ru: Вводит блок операторов, который будет запущен, если указанное исключение относится к блоку Try.
tr: Bir Try bloğu içinde belirtilen özel durum oluşursa çalıştırılacak ifade bloğunu ortaya çıkarır.
zh_hans: 引入一个要在 Try 块内部发生指定异常时运行的语句块。
zh_hant: 引進在 Try 區塊內發生指定的例外狀況時，所要執行的陳述式區塊。

source: Sets the default comparison method to use when comparing string data. When set to Text, uses a text sort order that is not case sensitive. When set to Binary, uses a strict binary sort order. Option Compare {Binary | Text}
cs: Nastaví výchozí metodu porovnání pro použití při porovnávání řetězcových dat. Při nastavení na Text použije textové řazení, které nerozlišuje malá a velká písmena. Při nastavení na Binary použije striktní binární řazení. Option Compare {Binary | Text}
de: Legt die Standardvergleichsmethode fest, die beim Vergleichen von Zeichenfolgendaten verwendet werden soll. Bei der Festlegung auf "Text" wird eine Textsortierreihenfolge verwendet, bei der Groß- und Kleinschreibung nicht beachtet werden. Bei "Binary" wird streng binär sortiert. Option Compare {Binary | Text}
es: Establece el método de comparación predeterminado que se utiliza al comparar datos de cadenas. Cuando se establece en Text, utiliza un criterio de ordenación de texto sin distinción entre mayúsculas y minúsculas. Cuando se establece en Binary, utiliza un criterio de ordenación binario estricto. Option Compare {Binary | Text}
fr: Définit la méthode de comparaison par défaut à utiliser pour comparer des données de type chaîne. Lorsqu'il a la valeur Text, il utilise un ordre de tri alphabétique sans respect de la casse. Lorsqu'il a la valeur Binary, il utilise un ordre de tri binaire strict. Option Compare {Binary | Text}
it: Imposta il metodo di confronto predefinito da usare per il confronto di dati stringa. Se impostata su Text, usa un ordinamento testo che rileva la distinzione tra maiuscole e minuscole. Se impostata su Binary, usa un ordinamento binario ridotto. Option Compare {Binary | Text}
ja: 文字列のデータを比較するときに使用する、既定の比較方法を設定します。Text に設定する場合は、大文字と小文字を区別しないテキストの並べ替え順序を使用します。Binary に設定する場合は、厳密なバイナリ並べ替え順序を使用します。 Option Compare {Binary | Text}
ko: 문자열 데이터를 비교할 때 사용할 기본 비교 메서드를 설정합니다. Text로 설정하면 대/소문자를 구분하지 않는 텍스트 정렬 순서를 사용하고, Binary로 설정하면 엄격한 이진 정렬 순서를 사용합니다. Option Compare {Binary | Text}
pl: Ustawia domyślną metodę porównywania do używania przy porównywaniu danych ciągów. Gdy ustawiona jest opcja Text, używany jest tekstowy porządek sortowania nieuwzględniający wielkości liter. Gdy ustawiona jest opcja Binary, używany jest ścisły binarny porządek sortowania. Option Compare {Binary | Text}
pt_br: Define o método padrão de comparação a usar ao comparar dados de cadeia de caracteres. Quando definido como Text, usa uma ordem de classificação de texto que não diferencia maiúsculas e minúsculas. Quando definido como Binary, usa uma ordem de classificação binária estrita. Opção Compare {Binary | Text}
ru: Устанавливает метод сравнения по умолчанию, используемый при сравнения строковых данных. При установке как Text использует порядок сортировки текста, который не учитывает регистр. При установке как Binary использует строгий двоичный порядок сортировки. Option Compare {Binary | Text}
tr: Dize verileri karşılaştırılırken kullanılan varsayılan karşılaştırma yöntemini ayarlar. Text olarak ayarlandığında, büyük/küçük harfe duyarlı olmayan metin sıralama düzeni kullanır. Binary olarak ayarlandığında, katı ikili sıralama düzeni kullanır. Option Compare {Binary | Text}
zh_hans: 设置在比较字符串数据时使用的默认比较方法。设置为 Text 时，使用不区分大小写的文本排序顺序。设置为 Binary 时，使用严格的二进制排序顺序。 Option Compare{Binary | Text}
zh_hant: 設定比較字串資料時所用的預設比較方法。若設定為 Text，請使用不區分大小寫的文字排序順序。若設定為 Binary，請使用嚴格的二進位排序順序。 Option Compare {Binary | Text}

source: Defines a conditional compiler constant. Conditional compiler constants are always private to the file in which they appear. The expressions used to initialize them can contain only conditional compiler constants and literals.
cs: Definuje podmíněnou konstantu kompilátoru. Podmíněné konstanty kompilátoru jsou vždycky soukromé vzhledem k souboru, ve kterém se objeví. Výraz použitý k jejich inicializaci může obsahovat jenom podmíněné konstanty kompilátoru a literály.
de: Definiert eine bedingte Compilerkonstante. Bedingte Compilerkonstanten sind immer privat für die Datei, in der sie angezeigt werden. Die zum Initialisieren verwendeten Ausdrücke dürfen nur bedingte Compilerkonstanten und Literale enthalten.
es: Define una constante de compilador condicional. Las constantes de compilador condicionales son siempre privadas en el archivo en el que aparecen. Las expresiones utilizadas para inicializarlas solo pueden contener constantes de compilador condicionales y literales.
fr: Définit une constante de compilation conditionnelle. Les constantes de compilation conditionnelle sont toujours privées pour le fichier dans lequel elles figurent. Les expressions servant à les initialiser ne peuvent contenir que des littéraux et des constantes de compilation conditionnelle.
it: Definisce una costante del compilatore condizionale. Le costanti del compilatore condizionale sono sempre costanti private del file in cui si trovano. Le espressioni usate per inizializzarle possono contenere solo costanti e valori letterali del compilatore condizionale.
ja: 条件付きコンパイラ定数を定義します。条件付きコンパイラ定数は、表示されるファイルに対しては常にプライベートです。初期化に使用される式には、条件付きコンパイラ定数とリテラルのみを含めることができます。
ko: 조건부 컴파일러 상수를 정의합니다. 조건부 컴파일러 상수는 이 상수가 사용된 파일에 대해 항상 Private입니다. 조건부 컴파일러 상수를 초기화하는 데 사용되는 식에는 조건부 컴파일러 상수와 리터럴만 사용할 수 있습니다.
pl: Definiuje warunkową stałą kompilatora. Warunkowe stałe kompilatora są zawsze prywatne dla pliku, w którym występują. Wyrażenia używane do ich inicjowania mogą zawierać tylko warunkowe stałe kompilatora i literały.
pt_br: Define uma constante condicional de compilador. Constantes condicionais de compilador são sempre privadas ao arquivo em que aparecem. As expressões usadas para inicializá-las podem conter apenas literais e constantes condicionais de compilador.
ru: Определяет условную константу компилятора. Условные константы компилятора всегда являются закрытыми для файла, в котором они появляются. Выражения, используемые для их инициализации, могут содержать только условные константы и литералы компилятора.
tr: Koşullu derleyici sabiti tanımlar. Koşullu derleyici sabitleri, göründükleri dosyada her zaman özeldir. Bunları başlatmak için kullanılan ifadeler yalnızca koşullu derleyici sabitlerini ve sabit değerleri içerebilir.
zh_hans: 定义条件编译器常量。条件编译器常量总是专用于其所在的文件。用来初始化这些常量的表达式只能包含条件编译器常量和文本。
zh_hant: 定義條件式編譯器常數。條件式編譯器常數在其所在之檔案中，一定會是私用常數。用於初始設定這類常數的運算式，只能包含條件式編譯器常數與常值。

source: Transfers execution immediately to the next iteration of the Do loop.
cs: Okamžitě přenese vykonávání na další iteraci smyčky Do.
de: Überträgt die Ausführung direkt an die nächste Iteration der Do-Schleife.
es: Transfiere la ejecución inmediatamente a la siguiente iteración del bucle Do.
fr: Transfère immédiatement l'exécution à la prochaine itération de la boucle Do.
it: Trasferisce immediatamente l'esecuzione all'iterazione successiva del ciclo Do.
ja: 実行を Do ループの次の反復処理に直ちに移します。
ko: Do 루프의 다음 반복으로 실행을 즉시 이동합니다.
pl: Natychmiast przenosi wykonanie do następnej iteracji pętli Do.
pt_br: Transfere a execução imediatamente para a próxima iteração do loop Do.
ru: Немедленно передает исполнение в следующую итерацию цикла Do.
tr: Yürütmeyi hemen Do döngüsünün bir sonraki yinelemesine aktarır.
zh_hans: 将执行过程立即转移到 Do 循环的下一个迭代中。
zh_hant: 將執行立即轉移到 Do 迴圈的下一個反覆運算。

source: Transfers execution immediately to the next iteration of the For loop.
cs: Okamžitě přenese vykonávání na další iteraci smyčky For.
de: Überträgt die Ausführung direkt an die nächste Iteration der For-Schleife.
es: Transfiere la ejecución inmediatamente a la siguiente iteración del bucle For.
fr: Transfère immédiatement l'exécution à la prochaine itération de la boucle For.
it: Trasferisce immediatamente l'esecuzione all'iterazione successiva del ciclo For.
ja: 実行を For ループの次の反復処理に直ちに移します。
ko: For 루프의 다음 반복으로 실행을 즉시 이동합니다.
pl: Natychmiast przenosi wykonanie do następnej iteracji pętli For.
pt_br: Transfere a execução imediatamente para a próxima iteração do loop For.
ru: Немедленно передает исполнение в следующую итерацию цикла For.
tr: Yürütmeyi hemen For döngüsünün bir sonraki yinelemesine aktarır.
zh_hans: 将执行过程立即转移到 For 循环的下一个迭代中。
zh_hant: 將執行立即轉移到 For 迴圈的下一個反覆運算。

source: Transfers execution immediately to the next iteration of the loop. Can be used in a Do loop, a For loop, or a While loop.
cs: Okamžitě přenese vykonávání na další iteraci smyčky. Může se použít ve smyčce Do, For nebo While.
de: Überträgt die Ausführung direkt an die nächste Iteration der Schleife. Kann in einer Do-Schleife, For-Schleife oder While-Schleife verwendet werden.
es: Transfiere la ejecución inmediatamente a la siguiente iteración del bucle. Se puede utilizar en un bucle Do, en un bucle For o en un bucle While.
fr: Transfère immédiatement l'exécution à la prochaine itération de la boucle. S'utilise dans une boucle Do, For ou While.
it: Trasferisce immediatamente l'esecuzione all'iterazione successiva nel ciclo. Può essere usata in un ciclo Do, For o While.
ja: 実行をループの次の反復処理に直ちに移します。Do ループ、For ループ、または While ループで使用できます。
ko: 루프의 다음 반복으로 실행을 즉시 이동합니다. Do 루프, For 루프 또는 While 루프에 사용할 수 있습니다.
pl: Natychmiast przenosi wykonanie do następnej iteracji pętli. Może być używana w pętli Do, For lub While.
pt_br: Transfere a execução imediatamente para a próxima iteração do loop. Pode ser usada em um loop Do, um loop For ou um loop While.
ru: Немедленно передает исполнение в следующую итерацию цикла. Может использоваться в цикле Do, For или While.
tr: Yürütmeyi hemen döngünün bir sonraki yinelemesine aktarır. Bir Do döngüsü, For döngüsü ya da While döngüsü içinde kullanılabilir.
zh_hans: 将执行过程立即转移到循环的下一个迭代中。可以用在 Do 循环、For 循环或 While 循环中。
zh_hant: 將執行立即轉移到迴圈的下一個反覆運算。可用在 Do 迴圈、For 迴圈或 While 迴圈中。

source: Transfers execution immediately to the next iteration of the While loop.
cs: Okamžitě přenese vykonávání na další iteraci smyčky While.
de: Überträgt die Ausführung direkt an die nächste Iteration der While-Schleife.
es: Transfiere la ejecución inmediatamente a la siguiente iteración del bucle While.
fr: Transfère immédiatement l'exécution à la prochaine itération de la boucle While.
it: Trasferisce immediatamente l'esecuzione all'iterazione successiva del ciclo While.
ja: 実行を While ループの次の反復処理に直ちに移します。
ko: While 루프의 다음 반복으로 실행을 즉시 이동합니다.
pl: Natychmiast przenosi wykonanie do następnej iteracji pętli While.
pt_br: Transfere a execução imediatamente para a próxima iteração do loop While.
ru: Немедленно передает исполнение в следующую итерацию цикла While.
tr: Yürütmeyi hemen While döngüsünün bir sonraki yinelemesine aktarır.
zh_hans: 将执行过程立即转移到 While 循环的下一个迭代中。
zh_hant: 將執行立即轉移到 While 迴圈的下一個反覆運算。
