Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Constrains a generic type parameter to require that any type argument passed to it be a reference type.
cs: Omezuje obecný parametr typu tím, že vyžaduje, aby libovolný do něho předaný argument typu představoval typ Odkaz.
de: Schränkt einen generischen Typparameter so ein, dass es sich bei jedem daran übergebenen Typargument um einen Referenztyp handeln muss.
es: Restringe un parámetro de tipo genérico para exigir que cualquier argumento de tipo pasado a dicho parámetro sea un tipo de referencia.
fr: Contraint un paramètre de type générique à exiger que tout argument de type soit passé en tant que type référence.
it: Vincola un parametro di tipo generico per richiedere che qualsiasi argomento di tipo passato sia un tipo riferimento.
ja: 参照型の型引数のみがジェネリック型パラメーターに渡されるように制約します。
ko: 제네릭 형식 매개 변수에 전달된 형식 인수가 참조 형식이 되도록 제한합니다.
pl: Ogranicza parametr typu ogólnego, aby wymagał przekazywania wszystkich argumentów typu jako typów referencyjnych.
pt_br: Restringe um parâmetro de tipo genérico para exigir que qualquer argumento de tipo passado para ele seja um tipo de referência.
ru: Ограничивает требование к универсальному типу параметра, чтобы любой передаваемый тип аргумента был ссылочным типом.
tr: Geçirilen her tür bağımsız değişkenin bir başvuru türü olmasını gerekli kılmak için genel tür parametresi kısıtlaması uygular.
zh_hans: 约束泛型类型形参以要求传递到该形参的任何类型实参均为引用类型。
zh_hant: 將泛型類型參數限制為傳遞給它的所有類型引數，都必須要是參考類型。

source: Specifies a constructor constraint on a generic type parameter.
cs: Určuje omezení konstruktoru u obecného parametru typu.
de: Gibt eine Konstruktoreinschränkung für einen generischen Typparameter an.
es: Especifica una restricción de constructor en un parámetro de tipo genérico.
fr: Spécifie une contrainte de constructeur sur un paramètre de type générique.
it: Specifica un vincolo del costruttore in un parametro di tipo generico.
ja: ジェネリック型パラメーターにコンス トラクター制約を指定します。
ko: 제네릭 형식 매개 변수에 생성자 제약 조건을 지정합니다.
pl: Określa ograniczenie konstruktora dla parametru typu ogólnego.
pt_br: Especifica uma restrição de construtor em um parâmetro de tipo genérico.
ru: Задает ограничение конструктору по параметру универсального типа.
tr: Bir genel tür parametresinde oluşturucu kısıtlaması belirtir.
zh_hans: 指定对泛型类型形参的构造函数约束。
zh_hant: 指定泛型類型參數的建構函式條件約束。

source: Constrains a generic type parameter to require that any type argument passed to it be a value type.
cs: Omezuje obecný parametr typu tím, že vyžaduje, aby libovolný do něho předaný argument typu představoval typ Hodnota.
de: Schränkt einen generischen Typparameter so ein, dass es sich bei jedem daran übergebenen Typargument um einen Werttyp handeln muss.
es: Restringe un parámetro de tipo genérico para exigir que cualquier argumento de tipo pasado a dicho parámetro sea un tipo de valor.
fr: Contraint un paramètre de type générique à exiger que tout argument de type soit passé en tant que type valeur.
it: Vincola un parametro di tipo generico per richiedere che qualsiasi argomento di tipo passato sia un tipo valore.
ja: 値型の型引数のみがジェネリック型パラメーターに渡されるように制約します。
ko: 제네릭 형식 매개 변수에 전달된 형식 인수가 참조 형식이 되도록 제한합니다.
pl: Ogranicza parametr typu ogólnego, aby wymagał przekazywania wszystkich argumentów typu jako typów wartości.
pt_br: Restringe um parâmetro de tipo genérico para exigir que qualquer argumento de tipo passado a ele seja um tipo de valor.
ru: Ограничивает требование к универсальному типу параметра, чтобы любой передаваемый тип аргумента был типом значения.
tr: Geçirilen her tür bağımsız değişkenin bir değer türü olmasını gerekli kılmak için genel tür parametresi kısıtlaması uygular.
zh_hans: 约束泛型类型形参以要求传递到该形参的任何类型实参均为值类型。
zh_hant: 將泛型類型參數限制為傳遞給它的所有類型引數，都必須要是實值類型。

source: Declares a Get property procedure that is used to return the current value of a property.
cs: Deklaruje proceduru vlastnosti Get, která se používá k vrácení aktuální hodnoty vlastnosti.
de: Deklariert eine Get-Eigenschaftenprozedur, mit der der aktuelle Wert einer Eigenschaft zurückgegeben wird.
es: Declara un procedimiento de propiedad Get que se utiliza para devolver el valor actual de una propiedad.
fr: Déclare une procédure de propriété Get qui sert à retourner la valeur actuelle d'une propriété.
it: Dichiara una routine di proprietà Get usata per restituire il valore corrente di una proprietà.
ja: プロパティの現在の値を返すために使用される Get プロパティ プロシージャを宣言します。
ko: 속성의 현재 값을 반환하는 데 사용되는 Get 속성 프로시저를 선언합니다.
pl: Deklaruje procedurę pobierania właściwości używaną do zwracania bieżącej wartości właściwości.
pt_br: Declara um procedimento de propriedade Get que é usado para retornar o valor atual de uma propriedade.
ru: Объявляет процедуру свойства Get, которая используется для возврата текущего значения свойства.
tr: Bir özelliğin geçerli değerini döndürmek için kullanılan Get özelliğini bildirir.
zh_hans: 声明用于返回属性的当前值的 Get 属性过程。
zh_hant: 宣告用以傳回屬性目前值的 Get 屬性程序。

source: Compares two expressions and returns True if the first is greater than the second. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud je první větší než druhý. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn der erste Ausdruck größer als der zweite ist. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si la primera es mayor que la segunda. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si la première expression est supérieure à la seconde. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se la prima è maggiore della seconda. In caso contrario, restituisce False.
ja: 2 つの式を比較し、最初の式が 2 番目より大きい場合は、True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 첫 번째 값이 두 번째 값보다 크면 True를 반환하고, 그렇지 않으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli pierwsze jest większe od drugiego. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se a primeira for maior do que a segunda. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если первое больше, чем второе. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve ilk ifade ikinciden büyükse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果第一个表达式大于第二个表达式则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若第一個運算式大於第二個運算式，即傳回 True; 否則傳回 False。

source: Compares two expressions and returns True if the first is greater than or equal to the second. Otherwise, returns False.
cs: Porovná dva výrazy a vrátí True, pokud je první větší než nebo rovný druhému. Jinak vrátí False.
de: Vergleicht zwei Ausdrücke und gibt True zurück, wenn der erste Ausdruck größer oder gleich dem zweiten ist. Gibt andernfalls False zurück.
es: Compara dos expresiones y devuelve True si la primera es mayor o igual que la segunda. En caso contrario, devuelve False.
fr: Compare deux expressions et retourne la valeur True si la première expression est supérieure ou égale à la seconde. Sinon, retourne la valeur False.
it: Confronta due espressioni e restituisce True se la prima è maggiore o uguale alla seconda. In caso contrario, restituisce False.
ja: 2 つの式を比較し、最初の式が 2 番目以上の場合は、True を返します。それ以外の場合は False を返します。
ko: 두 식을 비교한 후 첫 번째 값이 두 번째 값보다 크거나 같으면 True를 반환하고, 그렇지 않으면 False를 반환합니다.
pl: Porównuje dwa wyrażenia i zwraca wartość True, jeśli pierwsze jest większe lub równe drugiemu. W przeciwnym wypadku zwraca wartość False.
pt_br: Compara duas expressões e retorna Verdadeiro se a primeira for maior ou igual à segunda. Caso contrário, retorna Falso.
ru: Сравнивает два выражения и возвращает значение True, если первое меньше или равно второму. В противном случае возвращает значение False.
tr: İki ifadeyi karşılaştırır ve ilk ifade ikinciden büyükse veya ikinciye eşitse True değer döndürür. Aksi durumda False değer döndürür.
zh_hans: 比较两个表达式，如果第一个表达式大于或等于第二个表达式则返回 True，否则返回 False。
zh_hant: 比較兩個運算式，若第一個運算式大於或等於第二個運算式，即傳回 True; 否則傳回 False。

source: Declares that a procedure handles a specified event.
cs: Deklaruje, že procedura zpracovává určenou událost.
de: Deklariert, dass eine Prozedur ein angegebenes Ereignis behandelt.
es: Declara que un procedimiento controla un evento especificado.
fr: Déclare qu'une procédure gère un événement spécifié.
it: Dichiara che una routine gestisce un evento specificato.
ja: プロシージャが指定されたイベントを処理することを宣言します。
ko: 지정된 이벤트를 처리하는 프로시저를 선언합니다.
pl: Deklaruje, że procedura obsługuje określone zdarzenie.
pt_br: Declara se um procedimento manipula um evento especificado.
ru: Заявляет, что процедура обрабатывает указанное событие.
tr: Bir yordamın belirtilmiş bir olayı işlediğini bildirir.
zh_hans: 声明某一过程可处理指定的事件。
zh_hant: 宣告程序會處理指定的事件。

source: Indicates that a class or structure member is providing the implementation for a member defined in an interface.
cs: Indikuje, že člen třídy nebo struktury poskytuje implementaci pro člena definovaného v rozhraní.
de: Gibt an, dass ein Klassen- oder Strukturmember die Implementierung für einen in einer Schnittstelle definierten Member bereitstellt.
es: Indica que el miembro de una clase o estructura proporciona la implementación de un miembro definido en una interfaz.
fr: Indique qu'un membre de classe ou de structure fournit l'implémentation d'un membre défini dans une interface.
it: Indica che un membro di classe o di struttura fornisce l'implementazione per un membro definito in un'interfaccia.
ja: クラスまたは構造体のメンバーがインターフェイスで定義されているメンバーの実装を提供していることを示します。
ko: 클래스 또는 구조체 멤버가 인터페이스에 정의된 멤버를 구현함을 나타냅니다.
pl: Wskazuje, że składowa klasy lub struktury dostarcza implementację dla składowej zdefiniowanej w interfejsie.
pt_br: Indica que um membro de classe ou estrutura está fornecendo a implementação para um membro definido em uma interface.
ru: Указывает, что член класса или структуры предоставляет реализацию для члена, определенного в интерфейсе.
tr: Bir sınıf ya da yapı üyesinin, arabirim içinde tanımlanmış bir üye için uygulama sağladığını gösterir.
zh_hans: 指示某一类或结构成员将为接口中定义的成员提供实现。
zh_hant: 表示類別或結構成員將提供介面中定義之成員的實作。

source: Specifies one or more interfaces, or interface members, that must be implemented in the class or structure definition in which the Implements statement appears.
cs: Určuje nejmíň jedno rozhraní nebo člen rozhraní, které je třeba implementovat v definici třídy nebo struktury, v níž se objevuje příkaz Implements.
de: Gibt eine oder mehrere Schnittstellen oder Schnittstellenmember an, die in der Klassen- oder Strukturdefinition implementiert werden müssen, in der die Implements-Anweisung enthalten ist.
es: Especifica una o varias interfaces o miembros de interfaz que se deben implementar en la definición de clase o estructura en la que aparece la instrucción Implements.
fr: Spécifie une ou plusieurs interfaces, ou un ou plusieurs membres d'interface, à implémenter dans la définition de classe ou de structure qui contient l'instruction Implements.
it: Specifica una o più interfacce o membri di interfaccia che devono essere implementati nella definizione di classe o di struttura in cui è inclusa l'istruzione Implements.
ja: Implements ステートメントが使用されるクラスまたは構造体の定義に実装する必要のある、1 つ以上のインターフェイス、またはインターフェイス メンバーを指定します。
ko: Implements 문이 표시되는 클래스 또는 구조체 정의에 구현해야 하는 인터페이스 또는 인터페이스 멤버를 하나 이상 지정합니다.
pl: Określa jeden lub więcej interfejsów lub składowych interfejsu, które muszą zostać zaimplementowane w definicji klasy lub struktury, w której występuje instrukcja Implements.
pt_br: Especifica uma ou mais interfaces, ou membros de inteface, que devem ser implementados na definição de classe ou estrutura na qual a instrução Implements aparece.
ru: Задает один или несколько интерфейсов или членов интерфейса, которые должны быть реализованы в определении класса или структуры, в которых появляется оператор Implements.
tr: İçinde Implements deyiminin göründüğü sınıf veya yapı tanımında uygulanması gereken bir ya da daha fazla arabirimi veya arabirim üyesini belirtir.
zh_hans: 指定必须在 Implements 语句出现的类或结构定义中实现的一个或多个接口或接口成员。
zh_hant: 指定必須在出現 Implements 陳述式的類別或結構定義中實作的一或多個介面或介面成員。

source: Imports all or specified elements of a namespace into a file.
cs: Importuje všechny nebo určené elementy oboru názvů do souboru.
de: Importiert alle oder die angegebenen Elemente eines Namespace in eine Datei.
es: Importa todos los elementos o los elementos especificados de un espacio de nombres en un archivo.
fr: Importe une partie spécifique ou l'ensemble des éléments d'un espace de noms dans un fichier.
it: Importa tutti gli elementi o gli elementi specificati di uno spazio dei nomi in un file.
ja: 名前空間のすべてまたは指定された要素をファイルにインポートします。
ko: 네임스페이스의 모든 요소 또는 지정한 요소를 파일로 가져옵니다.
pl: Importuje wszystkie lub określone elementy przestrzeni nazw do pliku.
pt_br: Importa todos os elementos ou os elementos especificados de um namespace para um arquivo.
ru: Импортирует все или указанные элементы пространства имен в файл.
tr: Bir ad alanının tümünü ya da belirtilmiş öğelerini bir dosya içine aktarır.
zh_hans: 将命名空间的所有或指定元素导入到一个文件中。
zh_hant: 將命名空間的所有元素或指定元素，匯入至檔案。

source: Specifies the group that the loop variable in a For Each statement is to traverse.
cs: Určuje skupinu, kterou má projít proměnná smyčky v příkazu For Each.
de: Gibt die Gruppe an, die die Schleifenvariable in einer For Each-Anweisung durchlaufen soll.
es: Especifica el grupo que la variable de bucle de una instrucción For Each tiene que atravesar.
fr: Spécifie le groupe que la variable de boucle doit parcourir dans une instruction For Each.
it: Specifica il gruppo che deve essere attraversato dalla variabile di ciclo in un'istruzione For Each.
ja: ループ変数が For Each ステートメント内で繰り返し処理するグループを指定します。
ko: For Each 문에서 루프 변수가 트래버스하는 그룹을 지정합니다.
pl: Określa grupę, przez którą ma przejść zmienna pętli For Each.
pt_br: Especifica o grupo que a variável de loop em uma instrução For Each deve percorrer.
ru: Определяет группу, которую будет проходить переменная цикла в операторе For Each.
tr: Bir For Each deyimi içinde, döngü değişkeninin içinde gezeceği grubu belirtir.
zh_hans: 指定 For Each 语句中循环变量要遍历的组。
zh_hant: 指定 For Each 陳述式中迴圈變數要周遊的群組。

source: Specifies the group that the loop variable is to traverse in a For Each statement, or specifies the range variable in a query.
cs: Určuje skupinu, kterou má proměnná smyčky projít v příkazu For Each, nebo určuje proměnnou rozsahu v příkazu.
de: Gibt die Gruppe an, die die Schleifenvariable in einer For Each-Anweisung durchlaufen soll, oder gibt die Bereichsvariable in einer Abfrage an.
es: Especifica el grupo que la variable de bucle debe atravesar en una instrucción For Each o especifica la variable de rango de una consulta.
fr: Spécifie le groupe que la variable de boucle doit parcourir dans une instruction For Each, ou spécifie la variable de plage dans une requête.
it: Specifica il gruppo che deve essere attraversato dalla variabile di ciclo in un'istruzione For Each oppure specifica la variabile di intervallo in una query.
ja: ループ変数が For Each ステートメントで繰り返し処理するグループを指定するか、クエリ内の範囲変数を指定します。
ko: For Each 문에서 루프 변수가 트래버스하는 그룹을 지정하거나 쿼리의 범위 변수를 지정합니다.
pl: Określa grupę, przez którą ma przejść zmienna pętli For Each, lub określa zmienną zakresu w zapytaniu.
pt_br: Especifica o grupo que a variável de loop deve percorrer em uma instrução For Each ou especifica a variável de intervalo em uma consulta.
ru: Определяет группу, которую будет проходить переменная цикла для оператора For Each, или определяет переменную диапазона в запросе.
tr: Bir For Each deyimi içinde, döngü değişkeninin gezeceği grubu belirtir ya da bir sorgu içinde aralık değişkenini belirtir.
zh_hans: 指定 For Each 语句中循环变量要遍历的组，或者指定查询中的范围变量。
zh_hant: 指定 For Each 陳述式中迴圈變數要周遊的群組，或指定查詢中的範圍變數。

source: Causes the current class or interface to inherit the attributes, variables, properties, procedures, and events from another class or set of interfaces.
cs: Způsobí, že aktuální třída nebo rozhraní zdědí atributy, proměnné, vlastnosti, procedury a události z jiné třídy nebo sady rozhraní.
de: Führt dazu, dass die aktuelle Klasse oder Schnittstelle die Attribute, Variablen, Eigenschaften, Prozeduren und Ereignisse von einer anderen Klasse oder Gruppe von Schnittstellen erbt.
es: Permite que la clase o interfaz actual herede los atributos, variables, propiedades, procedimientos y eventos de otra clase o conjunto de interfaces.
fr: Oblige la classe ou l'interface actuelle à hériter des attributs, variables, propriétés, procédures et événements d'une autre classe ou d'un autre ensemble d'interfaces.
it: Fa sì che la classe o l'interfaccia corrente erediti gli attributi, le variabili, le proprietà, le procedure e gli eventi da un'altra classe o un altro set di interfacce.
ja: 現在のクラスまたはインターフェイスが、属性、変数、プロパティ、プロシージャ、およびイベントを別のクラスまたは一連のインターフェイスから継承するようにします。
ko: 현재 클래스 또는 인터페이스가 다른 클래스나 인터페이스 집합에서 특성, 변수, 속성, 프로시저 및 이벤트를 상속하도록 합니다.
pl: Powoduje dziedziczenie przez bieżącą klasę lub interfejs atrybutów, zmiennych, właściwości, procedur i zdarzeń z innej klasy lub zestawu interfejsów.
pt_br: Faz com que a classe ou interface atual herde os atributos, variáveis, propriedades, procedimentos e eventos de outra classe ou conjunto de interfaces.
ru: Приводит к унаследованию атрибутов, переменных, свойств, процедур и событий из другого класса или набора интерфейсов для текущего класса или интерфейса.
tr: Geçerli sınıfın ya da arabirimin öznitelikleri, değişkenleri, özellikleri, yordamları ve olayları başka bir sınıf veya arabirim kümesinden devralmasına neden olur.
zh_hans: 导致当前类或接口继承其他类或接口集的属性(attribute)、变量、属性(property)、过程和事件。
zh_hant: 讓目前的類別或介面，從另一個類別或介面集合繼承屬性 (Attribute)、變數、屬性 (Property)、程序及事件。

source: Specifies the group that the range variable is to traverse in a query.
cs: Určuje skupinu, kterou má procházet proměnná rozsahu v dotazu.
de: Gibt die Gruppe an, die die Bereichsvariable in einer Abfrage durchlaufen soll.
es: Especifica el grupo que la variable de rango tiene que atravesar en una consulta.
fr: Spécifie le groupe que la variable de plage doit parcourir dans une requête.
it: Specifica il gruppo che deve essere attraversato dalla variabile di intervallo in una query.
ja: 範囲変数がクエリでスキャンするグループを指定します。
ko: 쿼리에서 범위 변수가 트래버스하는 그룹을 지정합니다.
pl: Określa grupę, dla której zmienna zakresu ma wykonać zapytanie.
pt_br: Especifica o grupo que a variável de intervalo deve percorrer em uma consulta.
ru: Определяет группу, которую будет проходить переменная диапазона в запросе.
tr: Aralık değişkeninin bir sorgu içinde gezeceği grubu belirtir.
zh_hans: 指定范围变量将在查询中遍历的组。
zh_hant: 指定查詢中範圍變數要周遊的群組。

source: Divides two numbers and returns an integer result.
cs: Vydělí dvě čísla a vrátí celočíselný výsledek.
de: Dividiert zwei Zahlen und gibt ein ganzzahliges Ergebnis zurück.
es: Divide dos números y devuelve un resultado entero.
fr: Effectue la division de deux nombres et retourne un résultat sous forme d'entier.
it: Divide due numeri e restituisce un risultato intero.
ja: 2 つの数値を除算して、整数の結果を返します。
ko: 두 수를 나누고 정수 결과를 반환합니다.
pl: Dzieli dwie liczby i zwraca wynik w postaci liczby całkowitej.
pt_br: Divide dois números e retorna um resultado inteiro.
ru: Делит два числа и возвращает целочисленный результат.
tr: İki sayıyı böler ve sonucu tam sayı olarak döndürür.
zh_hans: 使两个数字相除，返回整数结果。
zh_hant: 將兩個數值相除，傳回整數結果。

source: Declares the name of an interface and the definitions of the members of the interface.
cs: Deklaruje název rozhraní a definice členů rozhraní.
de: Deklariert den Namen einer Schnittstelle und die Definitionen der Member der Schnittstelle.
es: Declara el nombre de una interfaz y las definiciones de los miembros de la interfaz.
fr: Déclare le nom d'une interface et les définitions des membres de l'interface.
it: Dichiara il nome di un'interfaccia e le definizioni dei membri dell'interfaccia.
ja: インターフェイスの名前と、インターフェイスのメンバーの定義を宣言します。
ko: 인터페이스 이름과 인터페이스 멤버의 정의를 선언합니다.
pl: Deklaruje nazwę interfejsu i definicje składowych interfejsu.
pt_br: Declara o nome de uma interface e as definições dos membros da interface.
ru: Объявляет имя интерфейса и определения членов интерфейса.
tr: Bir arabirimin adını ve üyelerinin tanımlarını bildirir.
zh_hans: 声明某一接口的名称以及接口成员的定义。
zh_hant: 宣告介面的名稱與介面成員的定義。

source: Determines whether an expression is false. If instances of any class or structure will be used in an OrElse clause, you must define IsFalse on that class or structure.
cs: Vyhodnotí, jestli je výraz nepravdivý. Pokud se instance libovolné třídy nebo struktury použijí v klauzuli OrElse, musíte definovat v této třídě nebo struktuře operátor IsFalse.
de: Bestimmt, ob ein Ausdruck falsch ist. Wenn in einer OrElse-Klausel Instanzen einer beliebigen Klasse oder Struktur verwendet werden, müssen Sie "IsFalse" für diese Klasse oder Struktur definieren.
es: Determina si una expresión es false. Si se van a utilizar instancias de alguna clase o estructura en una cláusula OrElse, debe definir IsFalse en esa clase o estructura.
fr: Détermine si une expression a la valeur False. Si les instances d'une classe ou d'une structure sont utilisées dans une clause OrElse, vous devez définir IsFalse dans cette classe ou structure.
it: Determina se un'espressione è False. Se istanze di una qualunque classe o struttura verranno usate in una clausola OrElse, è necessario definire IsFalse nella classe o struttura.
ja: 式が false であるかどうかを判断します。クラスまたは構造体のインスタンスが OrElse 句で使用される場合は、そのクラスまたは構造体で IsFalse を定義する必要があります。
ko: 식이 false인지 확인합니다. 클래스 또는 구조체의 인스턴스가 OrElse 절에 사용되면 해당 클래스 또는 구조체에서 IsFalse를 정의해야 합니다.
pl: Określa, czy wyrażenie jest fałszywe. Jeśli w klauzuli OrElse będą używane wystąpienia klasy lub struktury, należy dla tej klasy lub struktury zdefiniować operator IsFalse.
pt_br: Determina se uma expressão é falsa. Se instâncias de qualquer classe ou estrutura forem usadas em uma cláusula OrElse, você deve definir IsFalse nessa classe ou estrutura.
ru: Определяет, является ли выражение ложным. Если экземпляры любого класса или структуры будут использоваться в предложении OrElse, необходимо определить IsFalse для этого класса или структуры.
tr: Bir ifadenin false olup olmadığını belirler. Eğer herhangi bir sınıfın veya yapının örneği bir OrElse yan tümcesi içinde kullanılacaksa, bu sınıf ya da yapı üzerinde IsFalse tanımlamalısınız.
zh_hans: 确定表达式是否为 false。如果将在 OrElse 子句中使用任何类或结构的实例，则必须在该类或结构上定义 IsFalse。
zh_hant: 判斷運算式是否為 False。若在 OrElse 子句中會出現任何類別或結構，您必須在該類別或結構上定義 IsFalse。
