Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Using statement
cs: Příkaz Using
de: Using-Anweisung
es: Instrucción Using
fr: Instruction Using
it: istruzione Using
ja: Using ステートメント
ko: Using 문
pl: Instrukcja Using
pt_br: Instrução Using
ru: Оператор Using
tr: Using deyimi
zh_hans: Using 语句
zh_hant: Using 陳述式

source: Using block
cs: Blok Using
es: Bloque Using
fr: Bloc Using
it: blocco Using
ja: Using ブロック
ko: Using 블록
pl: Blok Using
pt_br: Bloco Using
ru: Блок Using
tr: Using bloğu
zh_hans: Using 块
zh_hant: Using 區塊

source: With statement
cs: Příkaz With
de: With-Anweisung
es: Instrucción With
fr: Instruction With
it: istruzione With
ja: With ステートメント
ko: With 문
pl: Instrukcja With
pt_br: Instrução With
ru: Оператор With
tr: With deyimi
zh_hans: With 语句
zh_hant: With 陳述式

source: With block
cs: Blok With
es: Bloque With
fr: Bloc With
it: blocco With
ja: With ブロック
ko: With 블록
pl: Blok With
pt_br: Bloco With
ru: Блок With
tr: With bloğu
zh_hans: With 块
zh_hant: With 區塊

source: SyncLock statement
cs: Příkaz SyncLock
de: SyncLock-Anweisung
es: Instrucción SyncLock
fr: Instruction SyncLock
it: istruzione SyncLock
ja: SyncLock ステートメント
ko: SyncLock 문
pl: Instrukcja SyncLock
pt_br: Instrução SyncLock
ru: Оператор SyncLock
tr: SyncLock deyimi
zh_hans: SyncLock 语句
zh_hant: SyncLock 陳述式

source: SyncLock block
cs: Blok SyncLock
es: Bloque SyncLock
fr: Bloc SyncLock
it: blocco SyncLock
ja: SyncLock ブロック
ko: SyncLock 블록
pl: Blok SyncLock
pt_br: Bloco SyncLock
ru: Блок SyncLock
tr: SyncLock bloğu
zh_hans: SyncLock 块
zh_hant: SyncLock 區塊

source: For Each statement
cs: Příkaz For Each
de: For Each-Anweisung
es: instrucción For Each
fr: Instruction For Each
it: istruzione For Each
ja: For Each ステートメント
ko: For Each 문
pl: Instrukcja For Each
pt_br: Instrução For Each
ru: Оператор For Each
tr: For Each ifadesi
zh_hans: For Each 语句
zh_hant: For Each 陳述式

source: For Each block
cs: Blok For Each
es: bloque For Each
fr: Bloc For Each
it: blocco For Each
ja: For Each ブロック
ko: For Each 블록
pl: Blok For Each
pt_br: Bloco For Each
ru: Блок For Each
tr: For Each bloğu
zh_hans: For Each 块
zh_hant: For Each 區塊

source: On Error statement
cs: Příkaz On Error
de: On Error-Anweisung
es: Instrucción On Error
fr: Instruction On Error
it: istruzione On Error
ja: On Error ステートメント
ko: On Error 문
pl: Instrukcja On Error
pt_br: Instrução On Error
ru: Оператор On Error
tr: On Error deyimi
zh_hans: On Error 语句
zh_hant: On Error 陳述式

source: Resume statement
cs: Příkaz Resume
de: Resume-Anweisung
es: Instrucción Resume
fr: Instruction Resume
it: istruzione Resume
ja: Resume ステートメント
ko: Resume 문
pl: Instrukcja Resume
pt_br: Instrução Resume
ru: Оператор Resume
tr: Resume deyimi
zh_hans: Resume 语句
zh_hant: Resume 陳述式

source: Yield statement
cs: Příkaz Yield
de: Yield-Anweisung
es: Instrucción Yield
fr: Instruction Yield
it: istruzione Yield
ja: Yield ステートメント
ko: Yield 문
pl: Instrukcja Yield
pt_br: Instrução Yield
ru: Оператор Yield
tr: Yield deyimi
zh_hans: Yield 语句
zh_hant: Yield 陳述式

source: Await expression
cs: Výraz Await
de: Await-Ausdruck
es: Expresión Await
fr: Expression Await
it: espressione Await
ja: Await 式
ko: Await 식
pl: Wyrażenie Await
pt_br: Expressão Await
ru: Выражение Await
tr: Await ifadesi
zh_hans: Await 表达式
zh_hant: Await 運算式

source: Where clause
cs: Klauzule Where
de: Where-Klausel
es: Cláusula Where
fr: Clause Where
it: clausola Where
ja: Where 句
ko: Where 절
pl: Klauzula Where
pt_br: Cláusula Where
ru: Предложение Where
tr: Where yan tümcesi
zh_hans: Where 子句
zh_hant: Where 子句

source: Select clause
cs: Klauzule Select
de: Select-Klausel
es: Cláusula Select
fr: Clause Select
it: clausola Select
ja: Select 句
ko: Select 절
pl: Klauzula Select
pt_br: Cláusula Select
ru: Предложение Select
tr: Select yan tümcesi
zh_hans: Select 子句
zh_hant: Select 子句

source: From clause
cs: Klauzule From
de: From-Klausel
es: Cláusula From
fr: Clause From
it: clausola From
ja: From 句
ko: From 절
pl: Klauzula From
pt_br: Cláusula From
ru: Предложение From
tr: From yan tümcesi
zh_hans: From 子句
zh_hant: From 子句

source: Aggregate clause
cs: Klauzule Aggregate
de: Aggregate-Klausel
es: Cláusula Aggregate
fr: Clause Aggregate
it: clausola Aggregate
ja: Aggregate 句
ko: Aggregate 절
pl: Klauzula Aggregate
pt_br: Cláusula Aggregate
ru: Предложение Aggregate
tr: Aggregate yan tümcesi
zh_hans: Aggregate 子句
zh_hant: Aggregate 子句

source: Let clause
cs: Klauzule Let
de: Let-Klausel
es: Cláusula Let
fr: Clause Let
it: clausola Let
ja: Let 句
ko: Let 절
pl: Klauzula Let
pt_br: Cláusula Let
ru: Предложение Let
tr: Let yan tümcesi
zh_hans: Let 子句
zh_hant: Let 子句

source: Join clause
cs: Klauzuje Join
de: Join-Klausel
es: Cláusula Join
fr: Clause Join
it: clausola Join
ja: Join 句
ko: Join 절
pl: Klauzula Join
pt_br: Cláusula Join
ru: Предложение Join
tr: Join yan tümcesi
zh_hans: Join 子句
zh_hant: Join 子句

source: Group Join clause
cs: Klauzule Group Join
de: Group Join-Klausel
es: Cláusula Group Join
fr: Clause Group Join
it: clausola Group Join
ja: Group Join 句
ko: Group Join 절
pl: Klauzula Group Join
pt_br: Cláusula Group Join
ru: Предложение Group Join
tr: Group Join yan tümcesi
zh_hans: Group Join 子句
zh_hant: Group Join 子句

source: Group By clause
cs: Klauzule Group By
de: Group By-Klausel
es: Cláusula Group By
fr: Clause Group By
it: clausola Group By
ja: Group By 句
ko: Group By 절
pl: Klauzula Group By
pt_br: Cláusula Group By
ru: Предложение Group By
tr: Group By yan tümcesi
zh_hans: Group By 子句
zh_hant: Group By 子句

source: Function aggregation
cs: Agregace funkce
de: Fuktionsaggregation
es: Agregación de función
fr: Agrégation de fonction
it: Aggregazione di funzioni
ja: 関数集約
ko: 함수 집계
pl: Agregacja funkcji
pt_br: Agregação de função
ru: Агрегация функции
tr: İşlev toplama
zh_hans: 函数聚合
zh_hant: 函式彙總

source: Take While clause
cs: Klauzule Take While
de: Take While-Klausel
es: Cláusula Take While
fr: Clause Take While
it: clausola Take While
ja: Take While 句
ko: Take While 절
pl: Klauzula Take While
pt_br: Cláusula Take While
ru: Предложение Take While
tr: Take While yan tümcesi
zh_hans: Take While 子句
zh_hant: Take While 子句

source: Skip While clause
cs: Klauzule Skip While
de: Skip While-Klausel
es: Cláusula Skip While
fr: Clause Skip While
it: clausola Skip While
ja: Skip While 句
ko: Skip While 절
pl: Klauzula Skip While
pt_br: Cláusula Skip While
ru: Предложение Skip While
tr: Skip While yan tümcesi
zh_hans: Skip While 子句
zh_hant: Skip While 子句

source: Ordering clause
cs: Klauzule Ordering
de: Ordering-Klausel
es: Cláusula Ordering
fr: Clause Ordering
it: clausola Ordering
ja: Ordering 句
ko: Ordering 절
pl: Klauzula Ordering
pt_br: Cláusula Ordering
ru: Предложение Ordering
tr: Ordering yan tümcesi
zh_hans: Ordering 子句
zh_hant: Ordering 子句

source: Join condition
cs: Podmínka Join
de: Join-Bedingung
es: condición Join
fr: Condition Join
it: condizione di Join
ja: Join 条件
ko: Join 조건
pl: Warunek Join
pt_br: Condição Join
ru: Условие Join
tr: Join koşulu
zh_hans: Join 条件
zh_hant: 聯結條件

source: WithEvents field
cs: Pole WithEvents
de: WithEvents-Feld
es: Campo WithEvents
fr: Champ WithEvents
it: campo WithEvents
ja: WithEvents フィールド
ko: WithEvents 필드
pl: Pole WithEvents
pt_br: Campo de WithEvents
ru: Поле WithEvents
tr: WithEvents alanı
zh_hans: WithEvents 字段
zh_hant: WithEvents 欄位

source: property accessor
cs: Přistupující objekt vlastnosti
de: Eigenschaftenaccessor
es: descriptor de acceso de propiedades
fr: accesseur de propriété
it: funzione di accesso proprietà
ja: プロパティ アクセサー
ko: 속성 접근자
pl: metoda dostępu do właściwości
pt_br: acessador de propriedade
ru: метод доступа к свойству
tr: özellik erişeni
zh_hans: 属性访问器
zh_hant: 屬性存取子

source: as clause
cs: Klauzule as
de: as-Klausel
es: cláusula as
fr: Clause as
it: clausola as
ja: as 句
ko: as 절
pl: klauzula as
pt_br: cláusula as
ru: предложение as
tr: as yan tümcesi
zh_hans: as 子句
zh_hant: As 子句

source: type parameters
cs: parametry typu
de: Typparameter
es: parámetros de tipo
fr: paramètres de type
it: parametri di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: parametry typów
pt_br: parâmetros de tipo
ru: параметры типов
tr: tür parametreleri
zh_hans: 类型参数
zh_hant: 類型參數

source: parameters
cs: parametry
de: Parameter
es: parámetros
fr: paramètres
it: parametri
ja: パラメーター
ko: 매개 변수
pl: parametry
pt_br: parâmetros
ru: параметры
tr: parametreler
zh_hans: 参数
zh_hant: 參數

source: attributes
cs: atributy
de: Attribute
es: atributos
fr: attributs
it: attributi
ja: 属性
ko: 특성
pl: atrybuty
pt_br: atributos
ru: атрибуты
tr: öznitelikler
zh_hans: 属性
zh_hant: 屬性

source: Too many arguments to '{0}'.
cs: {0} má moc argumentů.
de: Zu viele Argumente für "{0}".
es: Demasiados argumentos para "{0}".
fr: Arguments trop nombreux pour '{0}'.
it: Il numero di argomenti per '{0}' è eccessivo.
ja: {0}' の引数が多すぎます。
ko: {0}'에 대한 인수가 너무 많습니다.
pl: Za dużo argumentów elementu „{0}”.
pt_br: Muitos argumentos para "{0}".
ru: Слишком много аргументов для "{0}".
tr: {0}' için çok fazla bağımsız değişken var.
zh_hans: “{0}”的参数太多。
zh_hant: {0}' 的引數太多。

source: Type '{0}' is not defined.
cs: Typ {0} není definovaný.
de: Der Typ "{0}" ist nicht definiert.
es: No está definido el tipo '{0}'.
fr: Le type '{0}' n'est pas défini.
it: Il tipo '{0}' non è definito.
ja: 型 '{0}' は定義されていません。
ko: {0}' 형식이 정의되지 않았습니다.
pl: Typ „{0}” nie został zdefiniowany.
pt_br: O tipo '{0}' não está definido.
ru: Тип "{0}" не определен.
tr: {0}' türü tanımlı değil.
zh_hans: 未定义类型“{0}”。
zh_hant: 類型 '{0}' 未定義。

source: Add 'Overloads'
cs: Přidat Overloads
de: "Overloads" hinzufügen
es: Agregar "Overloads"
fr: Ajouter 'Overloads'
it: Aggiungi 'Overloads'
ja: 'Overloads' の追加
ko: 'Overloads' 추가
pl: Dodaj modyfikatory „Overloads”
pt_br: Adicionar 'Overloads'
ru: Добавить "Overloads"
tr: 'Overloads' ekle
zh_hans: 添加 “Overloads”
zh_hant: 加入多載

source: Add a metadata reference to specified assembly and all its dependencies, e.g. #r "myLib.dll".
cs: Přidá odkaz na metadata k určenému sestavení a všem jeho závislostem, třeba #r "myLib.dll".
de: Fügt der angegebenen Assembly und allen ihren Abhängigkeiten einen Metadatenverweis hinzu. Beispiel: #r "myLib.dll".
es: Agregue una referencia de metadatos al ensamblado especificado y todas sus dependencias, p. ej. #r "myLib.dll".
fr: Permet d'ajouter une référence de métadonnées à l'assembly spécifié et toutes ses dépendances. Exemple : #r "myLib.dll".
it: Aggiunge un riferimento ai metadati all'assembly specificato e a tutte le relative dipendenze, ad esempio #r "myLib.dll".
ja: 指定されたアセンブリとそのすべての依存関係へのメタデータ参照を追加します (例: #r "myLib.dll")。
ko: 지정한 어셈블리 및 모든 해당 종속성에 대한 메타데이터 참조를 추가합니다(예: #r "myLib.dll").
pl: Dodaj odwołanie do metadanych do określonego zestawu i wszystkich jego zależności, np. #r "myLib.dll".
pt_br: Adicione uma referência de metadados para o assembly especificado e a todas as suas dependências, por ex., #r "myLib.dll".
ru: Добавляет ссылку на метаданные в указанную сборку и все ее зависимости, например #r myLib.dll.
tr: Belirtilen bütünleştirilmiş koda ve tüm bağımlılıklarına bir meta veri başvurusu ekleyin örn. #r "myLib.dll".
zh_hans: 添加对指定程序集及其所有依赖项的元数据引用，例如 #r "myLib.dll"。
zh_hant: 將中繼資料參考加入指定的組件及其所有相依性中，例如 #r "myLib.dll"。

source: Properties
cs: Vlastnosti
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pl: Właściwości
pt_br: Propriedades
ru: Свойства
tr: Özellikler
zh_hans: 属性
zh_hant: 屬性

source: <namespace name>
cs: <název oboru názvů>
es: <nombre del espacio de nombres>
fr: <nom de l'espace de noms>
it: <nome dello spazio dei nomi>
ja: <名前空間名>
ko: <네임스페이스 이름>
pl: <nazwa przestrzeni nazw>
pt_br: <nome do namespace>
ru: <имя пространства имен>
zh_hans: <命名空间名称>
zh_hant: <命名空間名稱>

source: Type a name here to declare a namespace.
cs: Sem zadejte název k deklarování oboru názvů.
de: Geben Sie hier einen Namen ein, um einen Namespace zu deklarieren.
es: Escriba aquí un nombre para declarar un espacio de nombres.
fr: Tapez un nom ici pour déclarer un espace de noms.
it: Digitare qui un nome per dichiarare uno spazio dei nomi.
ja: 名前空間を宣言するには、ここに名前を入力してください。
ko: 네임스페이스를 선언하려면 여기에 이름을 입력하세요.
pl: Wpisz tutaj nazwę, aby utworzyć deklarację przestrzeni nazw.
pt_br: Digite um nome aqui para declarar um namespace.
ru: Введите имя для объявления пространства имен.
tr: Bir ad alanı bildirmek için buraya bir ad girin.
zh_hans: 在此处键入名称来声明命名空间。
zh_hant: 在此輸入名稱以宣告命名空間。

source: Type a name here to declare a partial class.
cs: Zadáním názvu na toto místo deklarujte částečnou třídu.
de: Geben Sie hier einen Namen ein, um eine partielle Klasse zu deklarieren.
es: Escriba aquí un nombre para declarar una clase parcial.
fr: Tapez un nom ici pour déclarer une classe partielle.
it: Digitare qui un nome per dichiarare una classe parziale.
ja: 部分クラスを宣言する名前をここに入力します。
ko: Partial 클래스를 선언하려면 여기에 이름을 입력하세요.
pl: Wpisz tutaj nazwę, aby zadeklarować klasę częściową.
pt_br: Digite um nome aqui para declarar uma classe parcial.
ru: Введите имя для объявления частичного класса.
tr: Kısmi bir sınıf tanımlamak için buraya bir ad girin.
zh_hans: 在此处键入名称以声明分部类。
zh_hant: 在這裡鍵入名稱以宣告部分類別。

source: <class name>
cs: <název třídy>
de: <Klassenname>
es: <nombre de clase>
fr: <nom de la classe>
it: <nome della classe>
ja: <クラス名>
ko: <클래스 이름>
pl: <nazwa klasy>
pt_br: <nome de classe>
ru: <имя класса>
tr: <sınıf adı>
zh_hans: <类名>
zh_hant: <類別名稱>

source: <interface name>
cs: <název rozhraní>
de: <Schnittstellenname>
es: <nombre de interfaz>
fr: <nom de l'interface>
it: <nome dell'interfaccia>
ja: <インターフェイス名>
ko: <인터페이스 이름>
pl: <nazwa interfejsu>
pt_br: <nome da interface>
ru: <имя интерфейса>
tr: <arabirim adı>
zh_hans: <接口名称>
zh_hant: <介面名稱>

source: <module name>
cs: <název modulu>
de: <Modulname>
es: <nombre de módulo>
fr: <nom du module>
it: <nome del modulo>
ja: <モジュール名>
ko: <모듈 이름>
pl: <nazwa modułu>
pt_br: <nome do módulo>
ru: <имя модуля>
tr: <modül adı>
zh_hans: <模块名>
zh_hant: <模組名稱>

source: <structure name>
cs: <název struktury>
de: <Strukturname>
es: <nombre de estructura>
fr: <nom de la structure>
it: <nome della struttura>
ja: <構造体名>
ko: <구조체 이름>
pl: <nazwa struktury>
pt_br: <nome da estrutura>
ru: <имя структуры>
tr: <yapı adı>
zh_hans: <结构名>
zh_hant: <結構名稱>

source: Type a name here to declare a partial interface.
cs: Zadáním názvu na toto místo deklarujte částečné rozhraní.
de: Geben Sie hier einen Namen ein, um eine partielle Schnittstelle zu deklarieren.
es: Escriba aquí un nombre para declarar una interfaz parcial.
fr: Tapez un nom ici pour déclarer une interface partielle.
it: Digitare qui un nome per dichiarare un'interfaccia parziale.
ja: 部分インターフェイスを宣言する名前をここに入力します。
ko: Partial 인터페이스를 선언하려면 여기에 이름을 입력하세요.
pl: Wpisz tutaj nazwę, aby zadeklarować interfejs częściowy.
pt_br: Digite um nome aqui para declarar uma interface parcial.
ru: Введите имя для объявления частичного интерфейса.
tr: Kısmi bir arabirim tanımlamak için buraya bir ad girin.
zh_hans: 在此处键入名称以声明分部接口。
zh_hant: 在這裡鍵入名稱以宣告部分類型。

source: Type a name here to declare a partial module.
cs: Zadáním názvu na toto místo deklarujte částečný modul.
de: Geben Sie hier einen Namen ein, um ein partielles Modul zu deklarieren.
es: Escriba aquí un nombre para declarar un módulo parcial.
fr: Tapez un nom ici pour déclarer un module partiel.
it: Digitare qui un nome per dichiarare un modulo parziale.
ja: 部分モジュールを宣言する名前をここに入力します。
ko: Partial 모듈을 선언하려면 여기에 이름을 입력하세요.
pl: Wpisz tutaj nazwę, aby zadeklarować moduł częściowy.
pt_br: Digite um nome aqui para declarar um módulo parcial.
ru: Введите имя для объявления частичного модуля.
tr: Kısmi bir modül tanımlamak için buraya bir ad girin.
zh_hans: 在此处键入名称以声明分部模块。
zh_hant: 在這裡鍵入名稱以宣告部分類型。

source: Type a name here to declare a partial structure.
cs: Zadáním názvu na toto místo deklarujte částečnou strukturu.
de: Geben Sie hier einen Namen ein, um eine partielle Struktur zu deklarieren.
es: Escriba aquí un nombre para declarar una estructura parcial.
fr: Tapez un nom ici pour déclarer une structure partielle.
it: Digitare qui un nome per dichiarare una struttura parziale.
ja: 部分構造体を宣言する名前をここに入力します。
ko: Partial 구조체를 선언하려면 여기에 이름을 입력하세요.
pl: Wpisz tutaj nazwę, aby zadeklarować strukturę częściową.
pt_br: Digite um nome aqui para declarar uma estrutura parcial.
ru: Введите имя для объявления частичной структуры.
tr: Kısmi bir yapı tanımlamak için buraya bir ad girin.
zh_hans: 在此处键入名称以声明分部结构。
zh_hant: 在這裡鍵入名稱以宣告部分類型。

source: Make Async Function
cs: Převést na asynchronní funkci
de: Funktion als asynchron definieren
es: Convertir función en asincrónica
fr: Rendre la fonction asynchrone
it: Rendi asincrona la funzione
ja: Async Function を作成する
ko: 비동기 함수로 설정
pl: Ustaw funkcję jako asynchroniczną
pt_br: Tornar a função assíncrona
ru: Сделать функцию асинхронной
tr: Zaman Uyumsuz İşlev Yap
zh_hans: 使成为异步函数
zh_hant: 讓非同步函式

source: Make Async Sub
cs: Převést na asynchronní proceduru Sub
de: Sub als asynchron definieren
es: Convertir Sub en asincrónico
fr: Rendre le Sub asynchrone
it: Rendi asincrona la funzione sub
ja: Async Sub にする
ko: 비동기 Sub로 설정
pl: Ustaw podprocedurę jako asynchroniczną
pt_br: Tornar Sub Assíncrona
ru: Сделать Sub асинхронной
tr: Zaman Uyumsuz Alt Yap
zh_hans: 使成为异步 Sub
zh_hant: 轉換為非同步 Sub

source: Add 'Me.'
de: "Me." hinzufügen
es: Agregar "Me."
it: Aggiungi 'Me.'
ja: Me' を追加します。
ko: Me'를 추가하세요.
pt_br: Adicionar 'Me.'
tr: Me' ekleyin.
zh_hant: 新增 'Me.'

source: Use 'Is Nothing' check
cs: Použít kontrolu „Is Nothing“
de: Prüfung "Is Nothing" verwenden
es: Usar comprobación "Is Nothing"
it: Usa controllo 'Is Nothing'
ja: Is Nothing' チェックを使用します
ko: Is Nothing' 검사 사용
pl: Użyj sprawdzania „Is Nothing”
pt_br: Usar a verificação 'Is Nothing'
tr: Is Nothing' denetimi kullan
zh_hans: 使用 "Is Nothing" 检查
zh_hant: 使用 'Is Nothing' 檢查

source: Use 'IsNot Nothing' check
cs: Použít kontrolu „IsNot Nothing“
de: Prüfung "IsNot Nothing" verwenden
es: Usar comprobación "IsNot Nothing"
it: Usa controllo 'IsNot Nothing'
ja: IsNot Nothing' チェックを使用します
ko: IsNot Nothing' 검사 사용
pl: Użyj sprawdzania „IsNot Nothing”
pt_br: Usar a verificação 'IsNot Nothing'
tr: IsNot Nothing' denetimi kullan
zh_hans: 使用 "IsNot Nothing" 检查
zh_hant: 使用 'IsNot Nothing' 檢查

source: Convert to 'Select Case'
cs: Převést na Select Case
de: In "Select Case" konvertieren
es: Convertir a "Select Case"
fr: Convertir en 'Select Case'
it: Converti in 'Select Case'
ja: 'Select Case' に変換する
ko: 'Select Case'로 변환
pl: Konwertuj na wyrażenie „Select Case”
pt_br: Converter em 'Select Case'
ru: Преобразовать в "Select Case"
tr: 'Select Case' deyimine dönüştür
zh_hans: 转换为“Select Case”
zh_hant: 轉換為 'Select Case'

source: Convert to 'For Each'
cs: Převést na For Each
de: In "For Each" konvertieren
es: Convertir a "For Each"
fr: Convertir en 'For Each'
it: Converti in 'For Each'
ja: 'For Each' に変換する
ko: 'For Each'로 변환
pl: Konwertuj na wyrażenie „For Each”
pt_br: Converter em 'For Each'
ru: Преобразовать в "For Each"
tr: 'For Each' deyimine dönüştür
zh_hans: 转换为“For Each”
zh_hant: 轉換為 'For Each'

source: Convert to 'For'
cs: Převést na For
de: In "For" konvertieren
es: Convertir a "For"
fr: Convertir en 'For'
it: Converti in 'For'
ja: 'For' に変換する
ko: 'For'로 변환
pl: Konwertuj na wyrażenie „For”
pt_br: Converter em 'For'
ru: Преобразовать в "For"
tr: 'For' deyimine dönüştür
zh_hans: 转换为“For”
zh_hant: 轉換為 'For'

source: Invert If
cs: Invertovat If
de: "If" umkehren
es: Invertir If
fr: Inverser If
it: Inverti If
ja: if を反転する
ko: if 반전
pl: Odwróć instrukcję if
pt_br: Inverter If
ru: Инвертировать оператор if
tr: If ifadesini tersine çevir
zh_hans: 反转 If
zh_hant: 反轉 IF

source: Lambda
de: Lambdafunktion
ja: ラムダ
ko: 람다
ru: Лямбда
