Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Repeats a block of statements while a Boolean condition is true. Do...Loop While <condition>
cs: Opakuje blok příkazů, dokud je logická podmínka pravdivá. Do...Loop While <podmínka>
de: Wiederholt einen Anweisungsblock, solange eine boolesche Bedingung erfüllt wird. Do...Loop While <Bedingung>
es: Repite un bloque de instrucciones mientras una condición Boolean es true. Do...Loop While <condición>
fr: Répète un bloc d'instructions tant qu'une condition Boolean a la valeur True. Do...Loop While <condition>
it: Ripete un blocco di istruzioni fintanto che una condizione booleana è True. Do...Loop While <condizione>
ja: ブール条件が true である間、ステートメント ブロックを繰り返します。 Do...Loop While <condition>
ko: Boolean 조건이 ture인 경우 문 블록을 반복합니다. Do...Loop While <condition>
pl: Powtarza blok instrukcji, dopóki spełniony jest warunek logiczny. Do...Loop While <warunek>
pt_br: Repete um bloco de instruções enquanto uma condição Booleana é verdadeira. Do...Loop While <condition>
ru: Повторяет блок операторов, пока логическое условие истинно. Do...Loop While <condition>
tr: Bir Boolean koşulu true olduğu sürece bir deyimler bloğunu tekrar eder. Do...Loop While <condition>
zh_hans: 在布尔条件为 true 时重复语句块。 Do...Loop While <condition>
zh_hant: 在布林條件為 True 的情況下，持續重複陳述式區塊。 Do...Loop While <condition>

source: Provides a way to refer to the current instance of a class or structure, that is, the instance in which the code is running.
cs: Poskytuje způsob, jak odkazovat na aktuální instanci třídy nebo struktury, to je instanci, ve které kód běží.
de: Stellt eine Möglichkeit zum Verweisen auf die aktuelle Instanz einer Klasse oder Struktur bereit, d. h. die Instanz, in der der Code ausgeführt wird.
es: Proporciona un modo de hacer referencia a la instancia actual de una clase o estructura, es decir, la instancia en la que se ejecuta el código.
fr: Permet de faire référence à l'instance actuelle d'une classe ou d'une structure, en d'autres termes, l'instance dans laquelle le code s'exécute.
it: Consente di fare riferimento all'istanza corrente di una classe o una struttura, ovvero all'istanza in cui viene eseguito il codice.
ja: クラスまたは構造体の現在の (コードが実行されている) インスタンスを参照する方法を提供します。
ko: 코드를 실행 중인 클래스 또는 구조체의 현재 인스턴스를 참조할 수 있도록 합니다.
pl: Zapewnia sposób odwołania do bieżącego wystąpienia klasy lub struktury, tj. do wystąpienia, w którym uruchomiony jest kod.
pt_br: Fornece uma maneira de referir-se à instância atual de uma classe ou estrutura, ou seja, a instância na qual o código está executando.
ru: Предлагает ссылку на текущий экземпляр класса или структуры, то есть экземпляр, в котором выполняется код.
tr: Bir sınıf ya da yapının geçerli örneğine (kod bu örnek içinde çalışır) başvuru için bir yol sağlar.
zh_hans: 提供了一种引用某个类或结构的当前实例的方式(即在其中运行代码的实例)。
zh_hant: 提供一種方法，來參考類別或結構目前的執行個體，也就是執行此程式碼的執行個體。

source: Provides a way to refer to the base class of the current class instance. You cannot use MyBase to call MustOverride base methods.
cs: Poskytuje způsob, jak odkazovat na základní třídu aktuální instance třídy. Pro volání základních metod MustOverride nemůžete použít MyBase.
de: Stellt eine Möglichkeit zum Verweisen auf die Basisklasse der aktuellen Klasseninstanz bereit. Sie können mit "MyBase" keine MustOverride-Basismethoden aufrufen.
es: Proporciona un modo de hacer referencia a la clase base de la instancia de clase actual. No puede usar MyBase para llamar a los métodos base MustOverride.
fr: Permet de faire référence à la classe de base de l'instance de classe actuelle. Vous ne pouvez pas utiliser MyBase pour appeler les méthodes de base MustOverride.
it: Consente di fare riferimento alla classe di base dell'istanza di classe corrente. Non è possibile usare MyBase per chiamare i metodi di base MustOverride.
ja: 現在のクラス インスタンスの基本クラスを参照する方法を提供します。MyBase を使用して、MustOverride 基本メソッドを呼び出すことはできません。
ko: 현재 클래스 인스턴스의 기본 클래스를 참조할 수 있도록 합니다. MyBase를 사용하여 MustOverride 기본 메서드를 호출할 수 없습니다.
pl: Zapewnia sposób odwołania do klasy bazowej bieżącego wystąpienia klasy. Nie można użyć konstrukcji MyBase do wywołania metod bazowych MustOverride.
pt_br: Fornece uma maneira para fazer referência à classe base da instância de classe atual. Você não pode usar MyBase para chamar métodos base MustOverride.
ru: Предлагает ссылку на базовый класс текущего экземпляра класса. Нельзя использовать MyBase для вызова базовых методов MustOverride.
tr: Geçerli sınıf örneğinin temel sınıfına başvuru için bir yol sağlar. MustOverride temel yöntemlerini çağırmak için MyBase kullanamazsınız.
zh_hans: 提供了一种引用当前类实例的基类的方式。不能使用 MyBase 调用 MustOverride 基方法。
zh_hant: 提供一種方法，來參考目前類別執行個體的基底類別。您無法使用 MyBase 呼叫 MustOverride 基底方法。

source: Provides a way to refer to the class instance members as originally implemented, ignoring any derived class overrides.
cs: Poskytuje způsob, jak odkazovat na členy instance třídy, jak byly původně implementované, bez ohledu na přepsání v odvozené třídě.
de: Stellt eine Möglichkeit bereit, so auf die Klasseninstanzmember zu verweisen, wie sie ursprünglich implementiert wurden. Dabei werden alle abgeleiteten Klassenüberschreibungen ignoriert.
es: Proporciona un modo de hacer referencia a los miembros de instancia de clase como se implementaron originalmente, sin tener en cuenta las invalidaciones de clases derivadas.
fr: Permet de faire référence aux membres d'instance de classe implémentés à l'origine, en ignorant toute substitution de classe dérivée.
it: Consente di fare riferimento ai membri dell'istanza di classe come implementati originariamente, ignorando eventuali override di classi derivate.
ja: 最初に実装されたときの状態のクラスのインスタンス メンバーを参照する (派生クラスのオーバーライドをすべて無視する) 方法を提供します。
ko: 파생 클래스 재정의를 무시하면서 원래 구현된 클래스 인스턴스 멤버를 참조할 수 있도록 합니다.
pl: Zapewnia sposób odwołania do pierwotnie zaimplementowanych składowych wystąpienia klasy przez zignorowanie wszystkich pochodnych przesłonięć klasy.
pt_br: Fornece uma maneira para referir-se a membros de instância de classe como originalmente implementados, ignorando quaisquer substituições de classes derivadas.
ru: Предлагает ссылку на членов экземпляров класса, как это было реализовано первоначально, игнорируя любые производные переопределения класса.
tr: Türetilmiş sınıf geçersiz kılmalarını yoksayarak, özgün olarak uygulandığı biçimde sınıf örneği üyelerine başvuru için bir yol sağlar.
zh_hans: 提供了一种引用类实例成员的方式(与最初实现类实例成员的方法相似)，并忽略任何派生类重写。
zh_hant: 提供一種方法，在忽略任何衍生之類別覆寫的情況下，以原始實作方式參考類別執行個體成員。

source: Creates a new object instance.
cs: Vytvoří novou instanci objektu.
de: Erstellt eine neue Objektinstanz.
es: Crea una nueva instancia de objeto.
fr: Crée une instance d'objet.
it: Crea una nuova istanza dell'oggetto.
ja: 新しいオブジェクト インスタンスを作成します。
ko: 새 개체 인스턴스를 만듭니다.
pl: Tworzy nowe wystąpienie obiektu.
pt_br: Cria uma nova instância de objeto.
ru: Создание нового экземпляра объекта.
tr: Yeni bir nesne örneği oluşturur.
zh_hans: 创建新的对象实例。
zh_hant: 建立新的物件執行個體。

source: Terminates a loop that iterates through the values of a loop variable.
cs: Ukončuje smyčku, která iteruje skrz hodnoty proměnné smyčky.
de: Beendet eine Schleife, die die Werte einer Schleifenvariablen durchläuft.
es: Termina un bucle que recorre en iteración los valores de una variable de bucle.
fr: Termine une boucle qui itère au sein des valeurs d'une variable de boucle.
it: Termina un ciclo che esegue l'iterazione dei valori di una variabile di ciclo.
ja: ループ変数の値を反復処理するループを終了します。
ko: 루프 변수 값을 통해 반복하는 루프를 종료합니다.
pl: Kończy pętlę iterującą przez wartości zmiennej pętli.
pt_br: Finaliza um loop que repete através dos valores de uma variável de loop.
ru: Завершает цикл, который выполняет итерацию значений переменной цикла.
tr: Bir döngü değişkeninin değerleri üzerinden yinelenen bir döngüyü sonlandırır.
zh_hans: 终止以循环变量的不同值进行迭代的循环。
zh_hant: 反覆執行迴圈變數所指定的次數後，結束迴圈。

source: Represents the default value of any data type.
cs: Představuje výchozí hodnotu libovolného datového typu.
de: Stellt den Standardwert jedes Datentyps dar.
es: Representa el valor predeterminado de cualquier tipo de datos.
fr: Représente la valeur par défaut d'un type de données quelconque.
it: Rappresenta il valore predefinito di qualsiasi tipo di dati.
ja: 任意のデータ型の既定値を表します。
ko: 모든 데이터 형식의 기본값을 나타냅니다.
pl: Reprezentuje wartość domyślną każdego typu danych.
pt_br: Representa o valor padrão de qualquer tipo de dados.
ru: Представляет значение по умолчанию для любого типа данных.
tr: Herhangi bir veri türünün varsayılan değerini temsil eder.
zh_hans: 表示任意数据类型的默认值。
zh_hant: 代表任何資料類型的預設值。

source: Turns a compiler option off.
cs: Vypne možnost kompilátoru.
de: Deaktiviert eine Compileroption.
es: Deshabilita una opción del compilador.
fr: Désactive une option du compilateur.
it: Disattiva un'opzione del compilatore.
ja: コンパイラ オプションをオフにします。
ko: 컴파일러 옵션을 해제합니다.
pl: Wyłącza opcję kompilatora.
pt_br: Desativa uma opção do compilador.
ru: Выключает параметр компилятора.
tr: Bir derleyici seçeneğini kapatır.
zh_hans: 关闭编译器选项。
zh_hant: 關閉編譯器選項。

source: Enables the error-handling routine that starts at the line specified in the line argument. The specified line must be in the same procedure as the On Error statement. On Error GoTo [<label> | 0 | -1]
cs: Povoluje rutinu pro ošetření chyb, která začíná na řádku zadaném v argumentu řádku. Zadaný řádek musí být ve stejné proceduře jako příkaz On Error. On Error GoTo [<návěští> | 0 | -1]
de: Aktiviert die Fehlerbehandlungsroutine, die in der im Zeilenargument angegebenen Zeile beginnt. Die angegebene Zeile muss sich in der gleichen Prozedur wie die On Error-Anweisung befinden. On Error GoTo [<Bezeichnung> | 0 | -1]
es: Habilita la rutina de control de errores que comienza en la línea especificada en el argumento de línea. La línea especificada debe estar en el mismo procedimiento que la instrucción On Error. On Error GoTo [<etiqueta> | 0 | -1]
fr: Active la routine de gestion des erreurs qui démarre à la ligne spécifiée dans l'argument de ligne. La ligne spécifiée doit se trouver dans la même procédure que l'instruction On Error. On Error GoTo [<label> | 0 | -1]
it: Abilita la routine di gestione degli errori avviata alla riga specificata nell'argomento della riga di comando. La riga specificata deve essere presente nella stessa routine dell'istruzione On Error. On Error GoTo [<etichetta> | 0 | -1]
ja: 行引数で指定された行から開始されるエラー処理ルーチンを有効にします。 指定された行は On Error ステートメントと同じプロシージャにする必要があります。 On Error GoTo [<label> | 0 | -1]
ko: 줄 인수에 지정한 줄에서 시작하는 오류 처리 루틴을 활성화합니다. 지정한 줄은 On Error 문과 같은 프로시저에 있어야 합니다. On Error GoTo [<label> | 0 | -1]
pl: Włącza procedurę obsługi błędu, która rozpoczyna się w wierszu określonym w argumencie wiersza. Określony wiersz musi być w tej samej procedurze co instrukcja On Error. On Error GoTo [<etykieta> | 0 | -1]
pt_br: Habilita a rotina de tratamento de erros que começa na linha especificada no argumento de linha. A linha especificada deve estar no mesmo procedimento da instrução On Error. On Error GoTo [<label> | 0 | -1]
ru: Включает процедуру обработки ошибок, которая начинается в строке указанной в аргументе строки. Указанная строка должна относиться к той же процедуре, что и оператор On Error. On Error GoTo [<label> | 0 | -1]
tr: Satır bağımsız değişkeninde belirtilen satırda başlatılan hata işleme yordamını etkinleştirir. Belirtilen satır, On Error deyimi ile aynı yordam içinde olmalıdır. On Error GoTo [<label> | 0 | -1]
zh_hans: 启用从行参数中所指定的行开始的错误处理例程。 所指定的行必须与 On Error 语句在同一个过程中。 On Error GoTo [<label> | 0 | -1]
zh_hant: 啟用錯誤處理常式，於行引數中所指定的行開始。 指定的行與 On Error 陳述式必須在同一個程序中。 On Error GoTo [<label> | 0 | -1]

source: When a run-time error occurs, execution transfers to the statement following the statement or procedure call that resulted in the error.
cs: Pokud nastane chyba za běhu, vykonávání se přenese na příkaz následující po příkazu nebo volání procedury, které vedlo k chybě.
de: Wenn ein Laufzeitfehler auftritt, wird die Ausführung an die Anweisung nach der Anweisung oder dem Prozeduraufruf übergeben, die bzw. der den Fehler verursacht hat.
es: Cuando se produce un error en tiempo de ejecución, la ejecución se transfiere a la instrucción que aparece detrás de la instrucción o llamada a procedimiento en la que se ha producido el error.
fr: Lorsqu'une erreur d'exécution se produit, l'exécution est transférée à l'instruction qui suit l'appel de l'instruction ou de la procédure ayant entraîné l'erreur.
it: Quando si verifica un errore di runtime, l'esecuzione viene trasferita all'istruzione successiva all'istruzione o alla chiamata di routine che ha restituito l'errore.
ja: ランタイム エラーが発生すると、エラーが発生したステートメントまたはプロシージャ呼び出しに続くステートメントに実行が移ります。
ko: 런타임 오류가 발생하면 오류가 발생한 문 또는 프로시저 호출 다음에 오는 문으로 실행을 이동합니다.
pl: Gdy wystąpi błąd czasu wykonania, wykonanie przenoszone jest do instrukcji następującej po wywołaniu instrukcji lub procedury, której wynikiem był błąd.
pt_br: Quando ocorre um erro de tempo de execução, a execução é transferida para a instrução após a chamada de instrução ou procedimento que resultou no erro.
ru: Если возникает ошибка во время выполнения, выполнение передается к оператору, который следует за вызовом оператора или процедуры, который привел к ошибке.
tr: Bir çalışma zamanı hatası oluştuğunda; yürütme, hataya sebep olan deyim ya da yordam çağrısından sonraki deyime aktarılır.
zh_hans: 当发生运行时错误时，执行过程会转移到导致该错误的语句或过程调用后面的语句。
zh_hant: 發生執行階段錯誤時，執行會轉移到接著造成錯誤之陳述式或程序呼叫後的陳述式。

source: Turns a compiler option on.
cs: Zapne možnost kompilátoru.
de: Aktiviert eine Compileroption.
es: Habilita una opción del compilador.
fr: Active une option du compilateur.
it: Attiva un'opzione del compilatore.
ja: コンパイラ オプションをオンにします。
ko: 컴파일러 옵션을 설정합니다.
pl: Włącza opcję kompilatora.
pt_br: Ativa uma opção do compilador.
ru: Включает параметр компилятора.
tr: Bir derleyici seçeneğini açar.
zh_hans: 打开编译器选项。
zh_hant: 開啟編譯器選項。

source: Specifies the element keys used to correlate sequences for a join operation.
cs: Určuje klíče prvků použité pro sladění sekvencí pro operaci sjednocení.
de: Gibt die Elementschlüssel an, mit denen Sequenzen für einen Beitrittsvorgang korreliert werden.
es: Especifica las claves de elemento que se utilizan para relacionar secuencias para una operación de unión.
fr: Spécifie les clés d'éléments utilisées pour mettre en corrélation les séquences d'une opération de jointure.
it: Specifica le chiavi di elemento usate per correlare sequenze di un'operazione di unione.
ja: 結合操作でシーケンスを関連付けるために使用される要素キーを指定します。
ko: 조인 연산의 시퀀스를 서로 관련시키는 데 사용할 요소 키를 지정합니다.
pl: Określa klucze elementów używane do korelacji sekwencji operacji łączenia.
pt_br: Especifica as chaves de elemento usadas para correlacionar sequências para uma operação de junção.
ru: Определяет ключи элемента, используемые для согласования последовательности операции соединения.
tr: Birleştirme işleminde sıralar arasında ilişki kurmak için kullanılan öğe anahtarlarını belirtir.
zh_hans: 指定用来将不同序列关联起来以执行联接运算的元素键。
zh_hant: 指定用以將聯結作業的序列相互關聯的元素索引鍵。

source: Specifies the sort order for columns in a query. Can be followed by either the Ascending or the Descending keyword. If neither is specified, Ascending is used.
cs: Určuje pořadí řazení pro sloupce v dotazu. Může po ní následovat buď klíčové slovo Ascending, nebo Descending. Pokud není určené žádné z nich, použije se Ascending.
de: Gibt die Sortierreihenfolge für Spalten in einer Abfrage an. Danach kann das Ascending-Schlüsselwort oder das Descending-Schlüsselwort folgen. Wenn kein Schlüsselwort angegeben wird, wird "Ascending" verwendet.
es: Especifica el criterio de ordenación de las columnas de una consulta. Puede ir seguida de la palabra clave Ascending o Descending. Si no se especifica ninguna, se utiliza Ascending.
fr: Spécifie l'ordre de tri des colonnes dans une requête. Cette clause peut être suivie du mot clé Ascending ou Descending. Si aucun mot clé n'est spécifié, Ascending est utilisé.
it: Specifica l'ordinamento delle colonne in una query. Può essere seguita dalla parola chiave Ascending o Descending. Se non si specifica alcuna parola chiave, verrà usata la parola chiave Ascending.
ja: クエリにおける列の並べ替え順序を指定します。Ascending キーワードまたは Descending キーワードの前に指定できます。いずれも指定されていない場合は、Ascending が使用されます。
ko: 쿼리에서 열의 정렬 순서를 지정합니다. 뒤에 Ascending 또는 Descending 키워드가 올 수 있습니다. 아무 값도 지정하지 않으면 Ascending이 사용됩니다.
pl: Określa porządek sortowania dla kolumn w zapytaniu. Może po niej wystąpić słowo kluczowe Ascending lub Descending. Jeśli żadne z nich nie jest określone, używane jest słowo kluczowe Ascending.
pt_br: Especifica a ordem de classificação para colunas em uma consulta. Pode ser seguido pela palavra-chave Ascending ou Descending. Se nenhuma for especificada, Ascending é usada.
ru: Определяет порядок сортировки для столбцов в запросе. Может сопровождаться ключевым словом с сортировкой по возрастанию или убыванию. Если ничего не указано, то используется сортировка по возрастанию.
tr: Bir sorgudaki sütunlar için sıralama düzenini belirtir. Sonrasında Ascending veya Descending anahtar sözcüğü gelir. Eğer belirtilmemişse Ascending kullanılır.
zh_hans: 指定查询中列的排序顺序。后面可以跟 Ascending 或 Descending 关键字。如果未指定关键字，则使用 Ascending。
zh_hant: 指定查詢中資料行的排序順序。其後可接著 Ascending 或 Descending 關鍵字，若都未指定，則會使用 Ascending。

source: Specifies the statements to run when the event is raised by the RaiseEvent statement. RaiseEvent(<delegateSignature>)...End RaiseEvent
cs: Určuje příkazy ke spuštění, když se vyvolá událost příkaz RaiseEvent. RaiseEvent(<signatura_delegáta>)...End RaiseEvent
de: Gibt die beim Auslösen des Ereignisses durch die RaiseEvent-Anweisung auszuführenden Anweisungen an. RaiseEvent(<Delegatsignatur>)...End RaiseEvent
es: Especifica las instrucciones que se ejecutan cuando la instrucción RaiseEvent desencadena el evento. RaiseEvent(<firmaDeDelegado>)...End RaiseEvent
fr: Spécifie les instructions à exécuter lorsque l'événement est déclenché par l'instruction RaiseEvent. RaiseEvent(<delegateSignature>)...End RaiseEvent
it: Specifica le istruzioni da eseguire quando l'evento viene generato dall'istruzione RaiseEvent. RaiseEvent(<firmaDelegato>)...End RaiseEvent
ja: イベントを RaiseEvent ステートメントによって発生させる場合に実行するステートメントを指定します。 RaiseEvent(<delegateSignature>)...End RaiseEvent
ko: RaiseEvent 문으로 이벤트가 발생될 때 실행할 문을 지정합니다. RaiseEvent(<delegateSignature>)...End RaiseEvent
pl: Określa instrukcje, które mają być uruchomione, gdy zdarzenie zostanie wywołane przez instrukcję RaiseEvent. RaiseEvent(<sygnaturaDelegata>)...End RaiseEvent
pt_br: Especifica as instruções a executar quando o evento é elevado pela instrução RaiseEvent. RaiseEvent(<delegateSignature>)...End RaiseEvent
ru: Задает операторы, которые выполняются при возникновении события RaiseEvent. RaiseEvent(<delegateSignature>)...End RaiseEvent
tr: Bir olay RaiseEvent deyimi ile tetiklendiğinde çalıştırılacak deyimleri belirtir. RaiseEvent(<delegateSignature>)...End RaiseEvent
zh_hans: 指定要在 RaiseEvent 语句引发事件时运行的语句。 RaiseEvent(<delegateSignature>)...End RaiseEvent
zh_hant: 指定當 RaiseEvent 陳述式引發事件時，所要執行的陳述式。 RaiseEvent(<delegateSignature>)...End RaiseEvent

source: Triggers an event declared at module level within a class, form, or document. RaiseEvent <eventName> [(<argumentList>)]
cs: Spustí událost deklarovanou na úrovni modulu uvnitř třídy, formuláře nebo dokumentu. RaiseEvent <název_události> [(<seznam_argumentů>)]
de: Löst ein auf Modulebene in einer Klasse, einem Formular oder Dokument deklariertes Ereignis aus. RaiseEvent <Ereignisname> [(<argumentList>)]
es: Desencadena un evento declarado en el nivel de módulo dentro de una clase, formulario o documento. RaiseEvent <nombreDeEvento> [(<listaDeArgumentos>)]
fr: Déclenche un événement déclaré au niveau du module dans une classe, un formulaire ou un document. RaiseEvent <eventName> [(<argumentList>)]
it: Attiva un evento dichiarato a livello di modulo in una classe, un form o un documento. RaiseEvent <nomeEvento> [(<elencoArgomenti>)]
ja: モジュール レベルで宣言されたイベントをクラス、フォーム、またはドキュメントで発生させます。 RaiseEvent <eventName> [(<argumentList>)]
ko: 클래스, 폼 또는 문서의 모듈 수준에서 선언한 이벤트를 트리거합니다. RaiseEvent <eventName> [(<argumentList>)]
pl: Wyzwala zdarzenie zadeklarowane na poziomie modułu w obrębie klasy, formularza lub dokumentu. RaiseEvent <nazwaZdarzenia> [(<listaArgumentów>)]
pt_br: Dispara um evento declarado no nível de módulo em uma classe, formulário ou documento. RaiseEvent <eventName> [(<argumentList>)]
ru: Инициирует событие, объявленное на уровне модуля в классе, форме или документе. RaiseEvent <eventName> [(<argumentList>)]
tr: Bir sınıf, form ya da belge içinde modül düzeyinde bildirilmiş bir olayı tetikler. RaiseEvent <eventName> [(<argumentList>)]
zh_hans: 触发类、窗体或文档中在模块级声明的事件。 RaiseEvent <eventName> [(<argumentList>)]
zh_hant: 觸發於類別、表單或文件內的模組層級，所宣告的事件。 RaiseEvent <eventName> [(<argumentList>)]

source: Collapses and hides sections of code in Visual Basic files.
cs: Sbalí a skryje části kódu v souborech Visual Basicu.
de: Klappt Codeabschnitte in Visual Basic-Dateien zu und blendet sie aus.
es: Contrae y oculta secciones de código en archivos de Visual Basic.
fr: Réduit et masque des sections de code dans des fichiers Visual Basic.
it: Comprime e nasconde sezioni di codice in file di Visual Basic.
ja: Visual Basic ファイルのコードのセクションを折りたたんで非表示にします。
ko: Visual Basic 파일에서 코드 섹션을 축소하고 숨깁니다.
pl: Zwija i ukrywa sekcje kodu w plikach języka Visual Basic.
pt_br: Recolhe e oculta seções de código em arquivos do Visual Basic.
ru: Сворачивает и скрывает разделы кода в файлах Visual Basic.
tr: Visual Basic dosyalarında kod bölümlerini daraltır ve gizler.
zh_hans: 折叠并隐藏 Visual Basic 文件中的代码段。
zh_hant: 摺疊並隱藏 Visual Basic 檔案中的程式碼區段。

source: Returns execution to the code that called the Function, Sub, Get, Set, or Operator procedure. Return -or- Return <expression>
cs: Vrátí vykonávání do kódu, který volal proceduru Function, Sub, Get, Set nebo Operator. Return -or- Return <výraz>
de: Gibt die Ausführung an den Code zurück, der die Prozedur "Function", "Sub", "Get", "Set" oder "Operator" aufgerufen hat. Return -oder- Return <Ausdruck>
es: Devuelve la ejecución al código que llamó el procedimiento Function, Sub, Get, Set u Operator Return -o bien- Return <expresión>
fr: Retourne l'exécution au code qui a appelé la procédure Function, Sub, Get, Set ou Operator. Return -ou- Return <expression>
it: Restituisce l'esecuzione al codice che ha chiamato la routine Function, Sub, Get, Set o Operator. Return -oppure- Return <espressione>
ja: Function、Sub、Get、Set、または Operator プロシージャを呼び出したコードに実行を戻します。 Return -or- Return <expression>
ko: Function, Sub, Get, Set, Operator 프로시저 등을 호출한 코드로 실행을 반환합니다. Return -or- Return <expression>
pl: Zwraca wykonanie do kodu, który wywołał procedurę Function, Sub, Get, Set lub Operator. Return -lub- Return <wyrażenie>
pt_br: Retorna a execução para o código que chamou o procedimento Function, Sub, Get, Set ou Operator. Return -or- Return <expression>
ru: Возвращает выполнение коду, который вызывает процедуру Function, Sub, Get, Set или Operator. Return -или- Return <expression>
tr: Yürütmeyi Function, Sub, Get, Set ya da Operator yordamları çağrılarının yapıldığı koda döndürür. Return -or- Return <expression>
zh_hans: 将执行过程返回到调用 Function、Sub、Get、Set 或 Operator 过程的代码。 Return -or- Return <expression>
zh_hant: 將執行傳回呼叫 Function、Sub、Get、Set 或 Operator 程序的程式碼。 Return -或- Return <expression>
