Repository: dotnet/roslyn
Catalog: src/Features/VisualBasic/Portable/xlf/VBFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Runs one of several groups of statements, depending on the value of an expression.
cs: Spustí jednu z několika skupin příkazů, závisí na hodnotě výrazu.
de: Führt eine von mehreren Anweisungsgruppen aus, abhängig vom Wert eines Ausdrucks.
es: Ejecuta uno de varios grupos de instrucciones en función del valor de una expresión.
fr: Exécute l'un des multiples groupes d'instructions, en fonction de la valeur d'une expression.
it: Esegue uno dei numerosi gruppi di istruzioni, a seconda del valore di un'espressione.
ja: 式の値に応じて、いくつかのステートメント グループのいずれかを実行します。
ko: 식의 값에 따라 여러 문 그룹 중 하나를 실행합니다.
pl: Uruchamia jedną lub kilka grup instrukcji w zależności od wartości wyrażenia.
pt_br: Executa um dos vários grupos de instruções, dependendo do valor de uma expressão.
ru: Выполняет одну из нескольких групп операторов в зависимости от значения выражения.
tr: Bir ifadenin değerine bağlı olarak çeşitli deyim gruplarından birini çalıştırır.
zh_hans: 根据表达式的值运行若干组语句中的一组语句。
zh_hant: 根據運算式的值，執行幾組陳述式中的一組。

source: Specifies which columns to include in the result of a query.
cs: Určuje, které sloupce se zahrnou do výsledku dotazu.
de: Gibt an, welche Spalten in das Ergebnis einer Abfrage eingeschlossen werden sollen.
es: Especifica las columnas que se incluyen en los resultados de una consulta.
fr: Spécifie les colonnes à inclure dans le résultat d'une requête.
it: Specifica le colonne da includere nel risultato di una query.
ja: クエリの結果に含める列を指定します。
ko: 쿼리 결과에 포함할 열을 지정합니다.
pl: Określa, które kolumny mają być zawarte w wyniku zapytania.
pt_br: Especifica quais colunas incluir no resultado de uma consulta.
ru: Указывает, какие столбцы включать в результат запроса.
tr: Bir sorgu sonucuna hangi sütunların dahil edileceğini belirtir.
zh_hans: 指定要包括在查询结果中的列。
zh_hant: 指定查詢結果中要包含的資料行。

source: Skips elements up to a specified position in the collection.
cs: Přeskočí elementy v kolekci až do zadané pozice.
de: Überspringt Elemente bis zu einer angegebenen Position in der Sammlung.
es: Omite elementos hasta una posición especificada de la colección.
fr: Ignore des éléments jusqu'à une position spécifique dans la collection.
it: Ignora elementi fino a una posizione specificata nella raccolta.
ja: コレクション内の指定された位置までの要素をスキップします。
ko: 컬렉션에서 지정한 위치까지 요소를 건너뜁니다.
pl: Pomija elementy do określonej pozycji w kolekcji.
pt_br: Ignora elementos até uma posição especificada na coleção.
ru: Пропускает элементы до указанной позиции в коллекции.
tr: Bir koleksiyon içinde, belirtilen konuma kadar olan öğeleri atlar.
zh_hans: 跳过元素以定位到集合中的指定位置。
zh_hant: 略過集合中最多到指定位置為止的元素。

source: Specifies how much to increment between each loop iteration.
cs: Určuje, jak velký bude přírůstek mezi každou iterací smyčky.
de: Gibt an, wie die Erhöhung zwischen jeder Schleifeniteration sein soll.
es: Especifica cuánto incrementar entre cada iteración de bucle.
fr: Spécifie la valeur à ajouter à chaque itération de boucle.
it: Specifica l'incremento tra ciascuna iterazione del ciclo.
ja: ループの反復処理のたびにインクリメントする量を指定します。
ko: 각 루프 반복 간에 증가하는 크기를 지정합니다.
pl: Określa przyrost między poszczególnymi iteracjami pętli.
pt_br: Especifica quanto incrementar entre cada iteração de loop.
ru: Определяет, какое приращение задать между каждой итерацией цикла.
tr: Her döngü yinelemesi arasında ne kadar artım yapılacağını belirtir.
zh_hans: 指定每个循环迭代之间的增量。
zh_hant: 指定每個迴圈反覆運算之間的增量。

source: Suspends program execution.
cs: Pozastaví vykonávání programu.
de: Hält die Ausführung des Programms an.
es: Suspende la ejecución del programa.
fr: Suspend l'exécution du programme.
it: Sospende l'esecuzione del programma.
ja: プログラムの実行を中断します。
ko: 프로그램 실행을 일시 중단합니다.
pl: Wstrzymuje wykonywanie programu.
pt_br: Suspende a execução do programa.
ru: Приостанавливает выполнение программы.
tr: Program yürütmesini askıya alır.
zh_hans: 挂起程序的执行操作。
zh_hant: 暫停程式的執行。

source: When set to On, restricts implicit data type conversions to only widening conversions. Option Strict {On | Off}
cs: Pokud je tato možnost zapnutá (On), omezí implicitní převody typů dat jenom na rozšiřující konverze. Option Strict {On | Off}
de: Bei der Festlegung auf "On" werden implizite Datentypkonvertierungen auf erweiternde Konvertierungen eingeschränkt. Option Strict {On | Off}
es: Cuando se establece en On, restringe las conversiones de tipos de datos implícitos a conversiones de ampliación únicamente. Option Strict {On | Off}
fr: Lorsqu'il a la valeur On, il restreint les conversions de types de données implicites à des conversions étendues uniquement. Option Strict {On | Off}
it: Se impostata su On, limita le conversioni dei tipi di dati impliciti alle sole conversioni verso un tipo di dati più grande. Option Strict {On | Off}
ja: On に設定されている場合は、 暗黙的なデータ型の変換を拡大変換のみに制限します。 Option Strict {On | Off}
ko: On으로 설정하면 암시적 데이터 형식 변환을 확대 변환으로만 제한합니다. Option Strict {On | Off}
pl: Gdy ustawiono na wartość On, ogranicza niejawne konwersje typów danych tylko do konwersji rozszerzających. Option Strict {On | Off}
pt_br: Quando definido como Ativado, restringe conversões de tipo de dados implícitos para somente conversões de expansão. Opção Strict {On | Off}
ru: Если установлено значение On, то это ограничивает неявное преобразование типов данных только до расширяющегося преобразования. Option Strict {On | Off}
tr: Etkin olarak ayarlandığında, örtük veri türü dönüşümünü sadece genişletme dönüşümü olabilecek şekilde kısıtlar. Option Strict {On | Off}
zh_hans: 设置为 On 时，使隐式数据类型转换仅限于进行扩大转换。 Option Strict {On | Off}
zh_hant: 若設定為 On，則隱含資料類型轉換將會限制為只有擴展轉換。 Option Strict {On | Off}

source: Ensures that multiple threads do not execute the statement block at the same time. SyncLock <object>...End Synclock
cs: Zajistí, že víc vláken nebude vykonávat blok příkazů ve stejném čase. SyncLock <object>...End Synclock
de: Stellt sicher, dass der Anweisungsblock nicht von mehreren Threads gleichzeitig ausgeführt wird. SyncLock <object>...End Synclock
es: Garantiza que varios subprocesos no ejecuten el bloque de instrucciones al mismo tiempo. SyncLock <object>...End Synclock
fr: S'assure que plusieurs threads n'exécutent pas le bloc d'instructions en même temps. SyncLock <object>...End Synclock
it: Impedisce l'esecuzione simultanea del blocco di istruzioni da parte di più thread. SyncLock <object>...End Synclock
ja: 複数のスレッドがステートメント ブロックを同時に実行しないようにします。 SyncLock <object>...End Synclock
ko: 여러 스레드가 동시에 문 블록을 실행하지 않도록 합니다. SyncLock <object>...End Synclock
pl: Gwarantuje, że wiele wątków nie wykonuje bloku instrukcji w tym samym czasie. SyncLock <object>...End Synclock
pt_br: Garante que vários threads não executam o bloco de instruções ao mesmo tempo. SyncLock <object>...End Synclock
ru: Гарантирует, что несколько потоков не выполняют блок операторов одновременно. SyncLock <object>...End Synclock
tr: Deyim bloğunu birden fazla iş parçacığının aynı anda yürütmemesini sağlar. SyncLock <object>...End Synclock
zh_hans: 确保多个线程不会同时执行语句块。 SyncLock <object>...End Synclock
zh_hant: 確定不會有多個執行緒同時執行此陳述式區塊。 SyncLock <object>...End Synclock

source: Includes elements up to a specified position in the collection.
cs: Zahrne elementy v kolekci až do zadané pozice.
de: Schließt Elemente bis zu einer angegebenen Position in der Sammlung ein.
es: Incluye elementos hasta una posición especificada de la colección.
fr: Inclut des éléments jusqu'à une position spécifique dans la collection.
it: Include elementi fino a una posizione specificata della raccolta.
ja: コレクション内の指定された位置までの要素が含まれます。
ko: 컬렉션에서 지정한 위치까지 요소를 포함합니다.
pl: Zawiera elementy do określonej pozycji w kolekcji.
pt_br: Inclui elementos até uma posição especificada na coleção.
ru: Включает элементы до указанной позиции в коллекции.
tr: Bir koleksiyon içinde, belirtilen konuma kadar olan öğeleri dahil eder.
zh_hans: 将元素包含在集合中的指定位置。
zh_hant: 包含集合中最多到指定位置為止的元素。

source: Sets the string comparison method specified in Option Compare to a text sort order that is not case sensitive.
cs: Nastaví metodu porovnání řetězce určenou v příkazu Option Compare na textové řazení, které nerozlišuje malá a velká písmena.
de: Legt die in "Option Compare" angegebene Zeichenfolgenvergleichsmethode auf eine Textsortierreihenfolge fest, bei der Groß- und Kleinschreibung nicht beachtet werden.
es: Establece el método de comparación de cadenas especificado en Option Compare en un criterio de ordenación de texto sin distinción entre mayúsculas y minúsculas.
fr: Définit la méthode de comparaison de chaînes spécifiée dans Option Compare selon un ordre de tri alphabétique sans respect de la casse.
it: Imposta il metodo di confronto tra stringhe specificato in Option Compare su un ordinamento testo che non rileva la distinzione tra maiuscole e minuscole.
ja: Option Compare で指定する文字列の比較方法を、大文字と小文字を区別しないテキストの並べ替え順序に設定します。
ko: Option Compare에 지정된 문자열 비교 메서드를 대/소문자를 구분하지 않는 텍스트 정렬 순서로 설정합니다.
pl: Ustawia metodę porównywania ciągów określoną w opcji Option Compare na tekstowy porządek sortowania nieuwzględniający wielkości liter.
pt_br: Define o método de comparação de cadeia de caracteres especificado na Opção Compare com uma ordem de classificação de texto que não diferencia maiúsculas e minúsculas.
ru: Устанавливает метод сравнения строк, указанных в параметре Option Compare, в порядке сортировки текста без учета регистра.
tr: Option Compare içinde belirtilen dize karşılaştırma yöntemini büyük/küçük harfe duyarlı olmayan metin sıralama düzeni olarak ayarlar.
zh_hans: 将 Option Compare 中所指定的字符串比较方法设置为不区分大小写的文本排序顺序。
zh_hant: 將 Option Compare 中指定的字串比較方法，設定為不區分大小寫的文字排序順序。

source: Introduces a statement block to be compiled or executed if a tested condition is true.
cs: Zavádí blok příkazů, který se má zkompilovat nebo provést, pokud je testovaná podmínka pravdivá.
de: Führt einen Anweisungsblock ein, der kompiliert oder ausgeführt wird, wenn eine getestete Bedingung wahr ist.
es: Introduce un bloque de instrucciones que se compilará o ejecutará si una condición probada es true.
fr: Introduit un bloc d'instructions à compiler ou à exécuter si une condition testée a la valeur True.
it: Introduce un blocco di istruzioni da compilare o eseguire se la condizione testata è True.
ja: テストされた条件が True の場合にコンパイルまたは実行されるステートメント ブロックを導入します。
ko: 테스트한 조건이 true일 때 컴파일하거나 실행할 문 블록을 지정합니다.
pl: Wprowadza blok instrukcji do kompilacji lub wykonania, jeśli testowany warunek zostaje spełniony.
pt_br: Apresenta um bloco de instruções a ser compilado ou executado se uma condição testada for verdadeira.
ru: Вводит блок операторов для компиляции или выполнения в случае, если условие истинно.
tr: Test edilen koşul true ise derlenecek veya yürütülecek olan bir deyim bloğunu ortaya çıkarır.
zh_hans: 引入要在测试的条件为 true 时编译或执行的语句块。
zh_hant: 引進在測試的條件為 True 時，所要編譯或執行的陳述式區塊。

source: Throws an exception within a procedure so that you can handle it with structured or unstructured exception-handling code.
cs: Generuje výjimku uvnitř procedury tak, že ji můžete zpracovat strukturovaným nebo nestrukturovaným kódem pro ošetření výjimky.
de: Löst eine Ausnahme in einer Prozedur aus, damit Sie diese mit strukturiertem oder unstrukturiertem Code zur Behandlung von Ausnahmen behandeln können.
es: Produce una excepción en un procedimiento para que pueda controlarla con código de control de excepciones estructurado o no estructurado.
fr: Lève une exception dans une procédure de sorte que vous puissiez la gérer avec du code de gestion des exceptions structurée ou non structurée.
it: Genera un'eccezione all'interno di una routine per consentirne la gestione con codice di gestione delle eccezioni strutturato o non strutturato.
ja: 構造化例外処理コード、または非構造化例外処理コードで処理できるように、プロシージャ内で例外をスローします。
ko: 구조적 또는 비구조적 예외 처리 코드로 처리할 수 있도록 프로시저에서 에외를 throw합니다.
pl: Zgłasza wyjątek w obrębie procedury, aby można było go obsłużyć za pomocą kodu obsługi błędu ze strukturą lub bez struktury.
pt_br: Gera uma exceção dentro de um procedimento para que você possa tratá-la com o código de tratamento de exceção estruturado ou não estruturado.
ru: Выдает исключение в процедуре, чтобы его можно было обработать, используя структурированный или неструктурированный код обработки исключений.
tr: Yapılandırılmış ya da yapılandırılmamış özel durum işleme kodu ile işleyebilmeniz için, bir yordam içinde özel durum oluşturur.
zh_hans: 在某个过程内引发异常，以便可以使用结构化或非结构化的异常处理代码来处理该异常。
zh_hant: 在程序中擲回例外狀況，使您能夠以結構化或無結構的例外狀況處理程式碼，來處理該例外狀況。

source: Represents a Boolean value that passes a conditional test.
cs: Představuje logickou hodnotu, která projde podmíněným testem.
de: Stellt einen booleschen Wert dar, für den ein bedingter Test erfolgreich durchgeführt wurde.
es: Representa un valor Boolean que supera una prueba condicional.
fr: Représente une valeur Boolean qui réussit un test conditionnel.
it: Rappresenta un valore booleano che produce l'esito positivo di un test condizionale.
ja: 条件テストを満たすブール値を表します。
ko: 조건 테스트를 통과하는 Boolean 값을 나타냅니다.
pl: Reprezentuje wartość logiczną spełniającą test warunkowy.
pt_br: Representa um valor Booleano que passa em um teste condicional.
ru: Представляет логическое значение, которое проходит проверку условия.
tr: Koşul testinde başarılı olan bir Boolean değeri temsil eder.
zh_hans: 表示通过条件测试的布尔值。
zh_hant: 代表通過條件測試的布林值。

source: Provides a way to handle some or all possible errors that might occur in a given block of code, while still running the code. Try...[Catch]...{Catch | Finally}...End Try
cs: Poskytuje způsob, jak ošetřit některé nebo všechny možné chyby, které můžou v daném bloku kódu nastat, zatímco kód dál běží. Try...[Catch]...{Catch | Finally}...End Try
de: Stellt eine Möglichkeit zum Behandeln einiger oder aller Fehler dar, die in einem bestimmten Codeblock auftreten können, während der Code weiter ausgeführt wird. Try...[Catch]...{Catch | Finally}...End Try
es: Proporciona un modo de tratar algunos o todos los errores posibles que se pueden producir en un bloque de código dado mientras se ejecuta el código. Try...[Catch]...{Catch | Finally}...End Try
fr: Permet de traiter une partie ou l'ensemble des erreurs possibles pouvant se produire dans un bloc de code donné, tout en continuant à exécuter le code. Try...[Catch]...{Catch | Finally}...End Try
it: Offre un modo per gestire alcuni tra tutti i possibili errori che si verificano in un blocco di codice specifico durante l'esecuzione del codice stesso. Try...[Catch]...{Catch | Finally}...End Try
ja: コードの実行中に、指定のコード ブロックで発生する可能性のあるエラーの一部またはすべてを処理する方法を提供します。 Try...[Catch]...{Catch | Finally}...End Try
ko: 코드를 계속 실행하면서 지정한 코드 블록에서 발생할 수 있는 오류의 일부 또는 전체를 처리할 방법을 제공합니다. Try...[Catch]...{Catch | Finally}...End Try
pl: Zapewnia sposób obsługi pewnych lub wszystkich możliwych błędów, które mogą wystąpić w danym bloku kodu w trakcie wykonywania kodu. Try...[Catch]...{Catch | Finally}...End Try
pt_br: Fornece uma maneira de lidar com alguns ou todos os erros possíveis que podem ocorrer em um determinado bloco de códigos, enquanto ainda estiver executando o código. Try...[Catch]...{Catch | Finally}...End Try
ru: Предлагает способ обработки некоторых или всех возможных ошибок, которые могут возникнуть в данном блоке кода в процессе его выполнения. Try...[Catch]...{Catch | Finally}...End Try
tr: Kod hala çalıştırılırken, verilen kod bloğunda oluşabilen bazı ya da tüm hataların işlenebilmesi için bir yol sağlar. Try...[Catch]...{Catch | Finally}...End Try
zh_hans: 提供一种方法，用于在代码仍保持运行的情况下，处理给定代码块中可能出现的部分或全部错误。 Try...[Catch]...{Catch | Finally}...End Try
zh_hant: 提供一種方法，在仍然繼續執行程式碼的情況下，處理指定程式碼區塊中可能發生的一些或所有錯誤。 Try...[Catch]...{Catch | Finally}...End Try

source: A Using block does three things: it creates and initializes variables in the resource list, it runs the code in the block, and it disposes of the variables before exiting. Resources used in the Using block must implement System.IDisposable. Using <resource1>[, <resource2>]...End Using
cs: Blok Using dělá tři věci: vytvoří a inicializuje proměnné v seznamu zdrojů, spustí kód v bloku a před ukončením uvolní proměnné. Zdroje použité v bloku Using musí implementovat System.IDisposable. Using <zdroj1>[, <zdroj2>]...End Using
de: Ein Using-Block führt drei Aufgaben aus: er erstellt und initialisiert Variablen in der Ressourcenliste, führt den Code im Block aus und verwirft die Variablen vor dem Beenden. Im Using-Block verwendete Ressourcen müssen "System.IDisposable" implementieren. Using <Ressource1>[, <Ressource2>]...End Using
es: Un bloque Using realiza tres operaciones: crea e inicializa variables en la lista de recursos, ejecuta el código del bloque y elimina las variables antes de terminar. Los recursos utilizados en el bloque Using deben implementar System.IDisposable. Using <recurso1>[, <recurso2>]...End Using
fr: Un bloc Using effectue trois actions : il crée et initialise des variables dans la liste des ressources, il exécute le code du bloc et supprime les variables avant de quitter. Les ressources utilisées dans le bloc Using doivent implémenter System.IDisposable. Using <resource1>[, <resource2>]...End Using
it: Un blocco Using effettua tre operazioni: crea e inizializza variabili nell'elenco di risorse, esegue il codice nel blocco ed elimina le variabili prima di uscire. Le risorse usate nel blocco Using devono implementare System.IDisposable. Using <risorsa1>[, <risorsa2>]...End Using
ja: Using ブロックは、リソース リストの変数を作成して初期化する、ブロックのコードを実行する、終了する前に変数を破棄する、という 3 つのことをします。Using ブロックで使用されるリソースは、System.IDisposable を実装する必要があります。 Using <resource1>[, <resource2>]...End Using
ko: Using 블록은 다음과 같은 세 가지 작업을 합니다. 리소스 목록의 변수를 만들어 초기화하고, 블록의 코드를 실행하며, 종료하기 전에 변수를 삭제합니다. Using 블록에 사용되는 리소스는 System.IDisposable을 구현해야 합니다. Using <resource1>[, <resource2>]...End Using
pl: Blok Using odpowiada za trzy elementy: tworzy i inicjuje zmienne na listach zasobów, uruchamia kod w bloku i rozporządza zmiennymi przed zakończeniem. Zasoby używane w bloku Using muszą implementować interfejs System.IDisposable. Using <zasób1>[, <zasób2>]...End Using
pt_br: Um bloco Using faz três coisas: cria e inicializa variáveis na lista de recursos, executa o código no bloco e descarta as variáveis antes de sair. Recursos usados no bloco Using devem implementar System.IDisposable. Using <resource1>[, <resource2>]...End Using
ru: Блок Using позволяет сделать три вещи: создать и инициализировать переменные в списке ресурсов, выполнить код в блоке и удалить переменные перед выходом. Ресурсы, используемые в блоке Using, должны реализовать System.IDisposable. Using <resource1>[, <resource2>]...End Using
tr: Bir Using bloğu üç iş yapar: Kaynak listesinde değişkenler oluşturur ve başlatır, blok içindeki kodu çalıştırır ve çıkmadan önce değişkenleri bırakır. Using bloğunda kullanılan kaynaklar şunu uygulamalıdır: System.IDisposable. Using <resource1>[, <resource2>]...End Using
zh_hans: Using 块用于执行下列三个操作: 在资源列表中创建并初始化变量、在块中运行代码并在退出之前释放变量。Using 块中使用的资源必须实现 System.IDisposable。 Using <resource1>[, <resource2>]...End Using
zh_hant: Using 區塊有以下三個作用: 建立及初始設定資源清單中的變數、執行區塊中的程式碼，以及在結束前處置變數。Using 區塊中使用的資源，必須實作 System.IDisposable。 Using <resource1>[, <resource2>]...End Using

source: Adds a conditional test to a Catch statement. Exceptions are caught by that Catch statement only when the conditional test that follows the When keyword evaluates to True.
cs: Přidá podmíněný test k příkazu Catch. Výjimky se tímto příkazem Catch zachycují, jenom když se podmíněný test, který následuje po klíčovém slově When, vyhodnotí jako True.
de: Fügt einer Catch-Anweisung einen bedingten Test hinzu. Ausnahmen werden von dieser Catch-Anweisung nur aufgefangen, wenn der bedingte Test nach dem When-Schlüsselwort als True ausgewertet wird.
es: Agrega una prueba condicional a una instrucción Catch. La instrucción Catch solo captura las excepciones cuando la prueba condicional incluida detrás de la palabra clave When se evalúa como True.
fr: Ajoute un test conditionnel à une instruction Catch. Les exceptions sont interceptées par cette instruction Catch uniquement lorsque le test conditionnel qui suit le mot clé When a la valeur True.
it: Aggiunge un test condizionale a un'istruzione Catch. Le eccezioni vengono individuate dall'istruzione Catch solo quando il test condizionale successivo alla parola chiave When restituisce True.
ja: Catch ステートメントに条件テストを追加します。When キーワードの後に続く条件テストが True に評価されるときにのみ、その Catch ステートメントによって例外がキャッチされます。
ko: 조건 테스트를 Catch 문에 추가합니다. 예외는 When 키워드 다음에 오는 조건 테스트가 True인 경우에만 이 Catch 문에서 catch됩니다.
pl: Dodaje test warunkowy do instrukcji Catch. Wyjątki są przechwytywane przez instrukcję Catch tylko wtedy, gdy test warunkowy następujący po słowie kluczowym When daje w wyniku wartość True.
pt_br: Adiciona um teste condicional a uma instrução Catch. As exceções são detectadas por essa instrução Catch somente quando o teste condicional que segue a palavra-chave When é avaliado como Verdadeiro.
ru: Добавляет проверку условия к оператору конструкции Catch. Исключения перехватываются оператором Catch только тогда, когда проверка условия, следующая за ключевым словом When, имеет значение True.
tr: Catch deyimine koşul testi ekler. Özel durumlar sadece When anahtar sözcüğünü takip eden koşul testi True olarak değerlendirildiğinde Catch deyimi tarafından yakalanır.
zh_hans: 向 Catch 语句添加条件测试。只有当 When 关键字后面条件测试的计算结果为 True 时，该 Catch 语句才能捕获到异常。
zh_hant: 在 Catch 陳述式中加入條件測試。只有接在 When 關鍵字之後的條件測試，評估為 True 時，Catch 陳述式才會捕捉到例外狀況。

source: Specifies the filtering condition for a range variable in a query.
cs: Určuje podmínku filtrování pro proměnnou rozsahu v dotazu.
de: Gibt die Filterbedingung für eine Bereichsvariable in einer Abfrage an.
es: Especifica la condición de filtro de una variable de rango en una consulta.
fr: Spécifie la condition de filtrage d'une variable de plage dans une requête.
it: Specifica la condizione relativa ai filtri per una variabile di intervallo in una query.
ja: クエリで範囲変数のフィルター条件を指定します。
ko: 쿼리의 범위 변수에 사용할 필터링 조건을 지정합니다.
pl: Określa warunek filtrowania dla zmiennej zakresu w zapytaniu.
pt_br: Especifica a condição de filtragem para uma variável de intervalo em uma consulta.
ru: Определяет условия фильтрации для переменной диапазона в запросе.
tr: Bir sorguda aralık değişkeni için filtreleme koşulunu belirtir.
zh_hans: 指定查询中范围变量的筛选条件。
zh_hant: 指定查詢中範圍變數的篩選條件。

source: Runs a series of statements as long as a given condition is true.
cs: Spouští sérii příkazů, dokud bude podmínka pravdivá.
de: Führt eine Reihe von Anweisungen aus, solange eine bestimmte Bedingung erfüllt wird.
es: Ejecuta una serie de instrucciones siempre que una condición dada sea true.
fr: Exécute une série d'instructions tant qu'une condition donnée a la valeur True.
it: Esegue una serie di istruzioni purché una determinata condizione sia True.
ja: 指定された条件が true である限り、一連のステートメントを実行します。
ko: 지정한 조건이 true인 동안 일련의 문을 실행합니다.
pl: Uruchamia serię instrukcji tak długo, jak długo prawdziwy jest dany warunek.
pt_br: Executa uma série de instruções desde que a condição determinada seja verdadeira.
ru: Выполняет серию операторов, пока заданное условие является истинным.
tr: Verilen koşul true olduğu sürece bir deyimler serisini çalıştırır.
zh_hans: 只要给定条件为 true，则运行一系列语句。
zh_hant: 在指定的條件為 True 的情況下，執行一系列的陳述式。
