Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_OperatorMustBeShared
source: Operators must be declared 'Shared'.
cs: Operátory je nutné deklarovat jako Shared.
de: Operatoren müssen als "Shared" deklariert werden.
es: Los operadores se deben declarar como 'Shared'.
fr: Les opérateurs doivent être déclarés 'Shared'.
it: Gli operatori devono essere dichiarati come 'Shared'.
ja: 演算子は 'Shared' として宣言されなければなりません。
ko: 연산자를 'Shared'로 선언해야 합니다.
pl: Operatory należy zadeklarować jako „Shared”.
pt_br: Operadores devem ser declarados 'Shared'.
ru: Операторы необходимо объявить как "Shared".
tr: İşleçler 'Shared' olarak bildirilmelidir.
zh_hans: 运算符必须声明为 "Shared"。
zh_hant: 運算子必須宣告為 'Shared'。

# ERR_BadOperatorFlags1
source: Operators cannot be declared '{0}'.
cs: Operátory nejde deklarovat jako {0}.
de: Operatoren können nicht als "{0}" deklariert werden.
es: Los operadores no se pueden declarar como '{0}'.
fr: Les opérateurs ne peuvent pas être déclarés '{0}'.
it: Gli operatori non possono essere dichiarati come '{0}'.
ja: 演算子は '{0}' として宣言できません。
ko: 연산자는 '{0}'(으)로 선언할 수 없습니다.
pl: Operatorów nie można zadeklarować jako „{0}”.
pt_br: Operadores não podem ser declarados "{0}".
ru: Операторы не могут быть объявлены "{0}".
tr: İşleçler '{0}' olarak bildirilemez.
zh_hans: 运算符不能声明为“{0}”。
zh_hant: 運算子不可宣告為 '{0}'。

# ERR_OneParameterRequired1
source: Operator '{0}' must have one parameter.
cs: Operátor {0} musí mít jeden parametr.
de: Der {0}-Operator muss einen Parameter haben.
es: El operador '{0}' debe tener un parámetro.
fr: L'opérateur '{0}' doit avoir un paramètre.
it: L'operatore '{0}' deve avere un parametro.
ja: 演算子 '{0}' には、1 個のパラメーターを指定しなければなりません。
ko: '{0}' 연산자에는 매개 변수를 한 개만 사용할 수 있습니다.
pl: Operator „{0}” musi mieć jeden parametr.
pt_br: Operador "{0}" deve ter um parâmetro.
ru: Оператор "{0}" должен иметь один параметр.
tr: '{0}' işlecinde bir parametre olmalıdır.
zh_hans: 运算符“{0}”必须有一个参数。
zh_hant: 運算子 '{0}' 必須要有一個參數。

# ERR_TwoParametersRequired1
source: Operator '{0}' must have two parameters.
cs: Operátor {0} musí mít dva parametry.
de: Der {0}-Operator muss zwei Parameter haben.
es: El operador '{0}' debe tener dos parámetros.
fr: L'opérateur '{0}' doit avoir deux paramètres.
it: L'operatore '{0}' deve avere due parametri.
ja: 演算子 '{0}' には、2 個のパラメーターを指定しなければなりません。
ko: '{0}' 연산자에는 두 가지 매개 변수를 사용해야 합니다.
pl: Operator „{0}” musi mieć dwa parametry.
pt_br: Operador "{0}" deve ter dois parâmetros.
ru: Оператор "{0}" должен иметь два параметра.
tr: '{0}' işlecinin iki parametresi olmalıdır.
zh_hans: 运算符“{0}”必须有两个参数。
zh_hant: 運算子 '{0}' 必須要有兩個參數。

# ERR_OneOrTwoParametersRequired1
source: Operator '{0}' must have either one or two parameters.
cs: Operátor {0} musí mít jeden nebo dva parametry.
de: Der {0}-Operator muss entweder einen oder zwei Parameter aufweisen.
es: El operador '{0}' debe tener uno o dos parámetros.
fr: L'opérateur '{0}' doit avoir un ou deux paramètres.
it: L'operatore '{0}' deve avere uno o due parametri.
ja: 演算子 '{0}' には、1 個または 2 個のパラメーターを指定しなければなりません。
ko: '{0}' 연산자에는 매개 변수를 한 개 또는 두 개만 사용할 수 있습니다.
pl: Operator „{0}” musi mieć jeden lub dwa parametry.
pt_br: Operador "{0}" deve ter um ou dois parâmetros.
ru: Оператор "{0}" должен иметь один или два параметра.
tr: '{0}' işlecinde bir veya iki parametre olmalıdır.
zh_hans: 运算符“{0}”必须有一个两个参数。
zh_hant: 運算子 '{0}' 必須要有一個或兩個參數。

# ERR_ConvMustBeWideningOrNarrowing
source: Conversion operators must be declared either 'Widening' or 'Narrowing'.
cs: Operátory převodu musí být deklarované jako Widening nebo Narrowing.
de: Konvertierungsoperatoren müssen entweder als "Widening" oder als "Narrowing" deklariert werden.
es: Los operadores de conversión se deben declarar como 'Widening' o 'Narrowing'.
fr: Les opérateurs de conversion doivent être déclarés 'Widening' ou 'Narrowing'.
it: Gli operatori di conversione devono essere dichiarati come 'Widening' o 'Narrowing'.
ja: 変換演算子は、'Widening' または 'Narrowing' のいずれかとして宣言されなければなりません。
ko: 변환 연산자를 'Widening' 또는 'Narrowing'으로 선언해야 합니다.
pl: Operatory konwersji muszą być zadeklarowane jako Widening lub Narrowing.
pt_br: Operadores de conversão devem ser declarados 'Widening' ou 'Narrowing'.
ru: Операторы преобразования должны быть объявлены как Widening или Narrowing.
tr: Dönüştürme işleçleri 'Widening' veya 'Narrowing' olarak bildirilmelidir.
zh_hans: 转换运算符必须声明为“Widening”或者“Narrowing”。
zh_hant: 轉換運算子必須宣告為 'Widening' 或 'Narrowing'。

# ERR_OperatorDeclaredInModule
source: Operators cannot be declared in modules.
cs: Operátory nejde deklarovat v modulech.
de: Operatoren können nicht in Modulen deklariert werden.
es: Los operadores no se pueden declarar en los módulos.
fr: Les opérateurs ne peuvent pas être déclarés dans des modules.
it: Gli operatori non possono essere dichiarati nei moduli.
ja: 演算子をモジュール内で宣言することはできません。
ko: 모듈에는 연산자를 선언할 수 없습니다.
pl: Nie można zadeklarować operatorów w modułach.
pt_br: Os operadores não podem ser declarados em módulos.
ru: Операторы нельзя объявлять в модулях.
tr: İşleçler modüllerde bildirilemez.
zh_hans: 运算符不能在模块中声明。
zh_hant: 不能在模組中宣告運算子。

# ERR_InvalidSpecifierOnNonConversion1
source: Only conversion operators can be declared '{0}'.
cs: Jenom operátory převodu jde deklarovat jako {0}.
de: Nur Konvertierungsoperatoren können als "{0}" deklariert werden.
es: Solo los operadores de conversión se pueden declarar como '{0}'.
fr: Seuls les opérateurs de conversion peuvent être déclarés '{0}'.
it: Solo gli operatori di conversione possono essere dichiarati come '{0}'.
ja: 変換演算子のみが '{0}' として宣言できます。
ko: 변환 연산자만 '{0}'(으)로 선언할 수 있습니다.
pl: Tylko operatory konwersji można zadeklarować jako „{0}”.
pt_br: Somente operadores de conversão podem ser declarados "{0}".
ru: Только операторы преобразования могут быть объявлены как "{0}".
tr: Yalnızca dönüştürme işleçleri '{0}' olarak bildirilebilir.
zh_hans: 只有转换运算符可以声明为“{0}”。
zh_hant: 只有轉換運算子可宣告為 '{0}'。

# ERR_UnaryParamMustBeContainingType1
source: Parameter of this unary operator must be of the containing type '{0}'.
cs: Parametr tohoto unárního operátoru musí být nadřazeného typu {0}.
de: Der Parameter dieses unären Operators muss den enthaltenden Typ "{0}" aufweisen.
es: El parámetro de este operador unario debe ser del tipo contenedor '{0}'.
fr: Le paramètre de cet opérateur unaire doit être du type conteneur '{0}'.
it: Il parametro dell'operatore unario deve essere del tipo '{0}' che lo contiene.
ja: 単項演算子のパラメーターの型は、それを含む型 '{0}' でなければなりません。
ko: 이 단항 연산자의 매개 변수는 포함하는 형식 '{0}'이어야 합니다.
pl: Parametr tego operatora jednoargumentowego musi być typu zawierającego „{0}”.
pt_br: Parâmetro desse operador unário deve ser do tipo recipiente "{0}".
ru: Тип параметра унарного оператора должен быть вмещающим "{0}".
tr: Bu birli işlecin parametresi '{0}' kapsayıcı türünde olmalıdır.
zh_hans: 此一元运算符的参数必须属于包含类型“{0}”。
zh_hant: 此一元運算子的參數必須屬於包含類型 '{0}'。

# ERR_BinaryParamMustBeContainingType1
source: At least one parameter of this binary operator must be of the containing type '{0}'.
cs: Nejmíň jeden parametr tohoto binárního operátoru musí být nadřazeného typu {0}.
de: Mindestens ein Parameter dieses binären Operators muss den enthaltenden Typ "{0}" aufweisen.
es: Al menos un parámetro de este operador binario debe ser del tipo contenedor '{0}'.
fr: Au moins un paramètre de cet opérateur binaire doit être du type conteneur '{0}'.
it: Almeno un parametro di questo operatore binario deve essere del tipo '{0}' che lo contiene.
ja: このバイナリ演算子のパラメーターのうち、少なくとも 1 つが型 '{0}' を含んでいなければなりません。
ko: 이 이항 연산자의 매개 변수 중 하나 이상은 포함하는 형식 '{0}'이어야 합니다.
pl: Co najmniej jeden parametr tego operatora binarnego musi być typu zawierającego „{0}”.
pt_br: Pelo menos um parâmetro deste operador binário deve ser do tipo recipiente "{0}".
ru: По крайней мере один из параметров данного бинарного оператора должен иметь вмещающий тип "{0}".
tr: Bu ikili işlecin en az bir parametresi '{0}' kapsayan türünde olmalıdır.
zh_hans: 此二元运算符的至少一个参数必须属于包含类型“{0}”。
zh_hant: 此二元運算子至少必須要有一個參數屬於包含類型 '{0}'。

# ERR_ConvParamMustBeContainingType1
source: Either the parameter type or the return type of this conversion operator must be of the containing type '{0}'.
cs: Typ parametru nebo typ vrácené hodnoty tohoto operátoru převodu musí mít obsahující typ {0}.
de: Entweder der Parametertyp oder der Rückgabetyp dieses Konvertierungsoperators muss dem enthaltenden {0}-Typ entsprechen.
es: El tipo de parámetro o el tipo de valor devuelto de este operador de conversión debe ser del tipo contenedor '{0}'.
fr: Le type de paramètre ou le type de retour de cet opérateur de conversion doit être du type conteneur '{0}'.
it: Il tipo di parametro o il tipo restituito di questo operatore di conversione deve essere il tipo '{0}' che lo contiene.
ja: この変換演算子のパラメーター型または戻り値の型は、含んでいる型 '{0}' でなければなりません。
ko: 이 변환 연산자의 매개 변수 형식 또는 반환 형식은 포함하는 '{0}' 형식이어야 합니다.
pl: Typ parametru lub typ zwracany tego operatora konwersji muszą być typu zawierającego „{0}”.
pt_br: O tipo de parâmetro ou o tipo de retorno desse operador de conversão deve ser do tipo recipiente "{0}".
ru: Тип параметр или возвращаемый тип данного оператора преобразования должны иметь вмещающий тип "{0}".
tr: Bu dönüştürme işlecinin parametre türü veya dönüş türü '{0}' kapsayan türünde olmalıdır.
zh_hans: 此转换运算符的参数类型或返回类型必须属于包含类型“{0}”。
zh_hant: 此轉換運算子的參數類型或傳回類型，必須屬於包含類型 '{0}'。

# ERR_OperatorRequiresBoolReturnType1
source: Operator '{0}' must have a return type of Boolean.
cs: Operátor {0} musí mít typ vrácené hodnoty Logická hodnota.
de: Der {0}-Operator muss den Rückgabetyp "Boolean" haben.
es: El operador '{0}' debe tener un tipo de valor devuelto Boolean.
fr: L'opérateur '{0}' doit avoir un type de retour Boolean.
it: L'operatore '{0}' deve avere come tipo restituito un valore booleano.
ja: 演算子 '{0}' には、ブール型の戻り値の型を指定しなければなりません。
ko: '{0}' 연산자의 반환 형식은 Boolean이어야 합니다.
pl: Operator „{0}” musi mieć typ zwracany Boolean.
pt_br: Operador "{0}" deve ter um tipo de retorno booleano.
ru: Оператор "{0}" должен иметь логический возвращаемый тип.
tr: '{0}' işlecinin dönüş türü Boole olmalıdır.
zh_hans: 运算符“{0}”必须具有 Boolean 返回类型。
zh_hant: 運算子 '{0}' 必須要有布林的傳回類型。

# ERR_ConversionToSameType
source: Conversion operators cannot convert from a type to the same type.
cs: Operátory převodu nejde převést z typu na stejný typ.
de: Konvertierungsoperatoren können keine Konvertierung eines Typs in den gleichen Typ durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo al mismo tipo.
fr: Les opérateurs de conversion ne peuvent pas convertir d'un type en un type identique.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo allo stesso tipo.
ja: 変換演算子によって、ある型から同じ型に変換することはできません。
ko: 변환 연산자는 특정 형식에서 동일한 형식으로 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu na ten sam typ.
pt_br: Os operadores de conversão não podem converter de um tipo no mesmo.
ru: Операторы преобразования не могут приводить тип к этому же типу.
tr: Dönüştürme işleçleri bir türden aynı türe dönüştürülemez.
zh_hans: 转换运算符不能从某一类型转换为相同的类型。
zh_hant: 轉換運算子無法從類型轉換為相同的類型。

# ERR_ConversionToInterfaceType
source: Conversion operators cannot convert to an interface type.
cs: Operátory převodu nejde převést na typ rozhraní.
de: Konvertierungsoperatoren können keine Konvertierung in einen Schnittstellentyp durchführen.
es: Los operadores de conversión no se pueden convertir en un tipo de interfaz.
fr: Les opérateurs de conversion ne peuvent pas convertir en un type interface.
it: Gli operatori di conversione non possono eseguire conversioni in un tipo interfaccia.
ja: 変換演算子によってインターフェイス型に変換することはできません。
ko: 변환 연산자는 인터페이스 형식으로 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować na typ interfejsu.
pt_br: Os operadores de conversão não podem converter em um tipo de interface.
ru: Операторы преобразования не могут приводить к типу интерфейса.
tr: Dönüştürme işleçleri arabirim türüne dönüştürülemez.
zh_hans: 转换运算符不能转换为接口类型。
zh_hant: 轉換運算子無法轉換為介面類型。

# ERR_ConversionToBaseType
source: Conversion operators cannot convert from a type to its base type.
cs: Operátory převodu nejde převést z typu na jeho základní typ.
de: Konvertierungsoperatoren können keine Konvertierung eines Typs in den Basistyp durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo a su tipo base.
fr: Les opérateurs de conversion ne peuvent pas convertir d'un type en son type de base.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo al relativo tipo di base.
ja: 変換演算子によって、ある型からその基本型に変換することはできません。
ko: 변환 연산자는 특정 형식에서 해당 형식의 기본 형식으로 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu na jego typ podstawowy.
pt_br: Os operadores de conversão não podem converter de um tipo no seu tipo base.
ru: Операторы преобразования не могут приводить тип к его базовому типу.
tr: Dönüştürme işleçleri bir türden bu türün temel türüne dönüştürülemez.
zh_hans: 转换运算符不能从某一类型转换为它的基类型。
zh_hant: 轉換運算子無法從類型轉換為其基底類型。

# ERR_ConversionToDerivedType
source: Conversion operators cannot convert from a type to its derived type.
cs: Operátory převodu nejde převést z typu na jeho odvozený typ.
de: Konvertierungsoperatoren können keine Konvertierung eines Typs in den abgeleiteten Typ durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo a su tipo derivado.
fr: Les opérateurs de conversion ne peuvent pas convertir à partir d'un type en son type dérivé.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo al relativo tipo derivato.
ja: 変換演算子によって、ある型からその派生型に変換することはできません。
ko: 변환 연산자는 특정 형식에서 해당 형식의 파생 형식으로 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu na typ, który od niego pochodzi.
pt_br: Os operadores de conversão não podem converter de um tipo no seu tipo derivado.
ru: Операторы преобразования не могут приводить тип к его производному типу.
tr: Dönüştürme işleçleri bir türden bu türün türetilen türüne dönüştürülemez.
zh_hans: 转换运算符不能从某一类型转换为它的派生类型。
zh_hant: 轉換運算子無法從類型轉換為其衍生類型。

# ERR_ConversionToObject
source: Conversion operators cannot convert to Object.
cs: Operátory převodu nejde převést na typ Object.
de: Konvertierungsoperatoren können keine Konvertierung in "Object" durchführen.
es: Los operadores de conversión no se pueden convertir en Object.
fr: Les opérateurs de conversion ne peuvent pas convertir en Object.
it: Gli operatori di conversione non possono eseguire conversioni in Object.
ja: 変換演算子によって Object に変換することはできません。
ko: 변환 연산자는 Object로 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować na element Object.
pt_br: Os operadores de conversão não podem converter em Object.
ru: Операторы преобразования не могут приводить к объекту.
tr: Dönüştürme işleçleri Object türüne dönüştürülemez.
zh_hans: 转换运算符不能转换为 Object。
zh_hant: 轉換運算子無法轉換為物件。

# ERR_ConversionFromInterfaceType
source: Conversion operators cannot convert from an interface type.
cs: Operátory převodu nejde převést z typu rozhraní.
de: Konvertierungsoperatoren können keine Konvertierung eines Schnittstellentyps durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo de interfaz.
fr: Les opérateurs de conversion ne peuvent pas convertir à partir d'un type interface.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo interfaccia.
ja: 変換演算子によってインターフェイス型から変換することはできません。
ko: 변환 연산자는 인터페이스 형식에서 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu interfejsu.
pt_br: Os operadores de conversão não podem converter de um tipo de interface.
ru: Исходным типом оператора преобразования не может быть тип интерфейса.
tr: Dönüştürme işleçleri arabirim türünden dönüştürülemez.
zh_hans: 转换运算符不能从接口类型转换。
zh_hant: 轉換運算子無法從介面類型進行轉換。

# ERR_ConversionFromBaseType
source: Conversion operators cannot convert from a base type.
cs: Operátory převodu nejde převést ze základního typu.
de: Konvertierungsoperatoren können keine Konvertierung eines Basistyps durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo base.
fr: Les opérateurs de conversion ne peuvent pas convertir à partir d'un type de base.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo di base.
ja: 変換演算子によって基本型から変換することはできません。
ko: 변환 연산자는 기본 형식에서 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu podstawowego.
pt_br: Os operadores de conversão não podem converter de um tipo base.
ru: Исходным типом оператора преобразования не может быть базовый тип.
tr: Dönüştürme işleçleri temel türden dönüştürülemez.
zh_hans: 转换运算符不能从基类型转换。
zh_hant: 轉換運算子無法從基底類型進行轉換。

# ERR_ConversionFromDerivedType
source: Conversion operators cannot convert from a derived type.
cs: Operátory převodu nejde převést z odvozeného typu.
de: Konvertierungsoperatoren können keine Konvertierung eines abgeleiteten Typs durchführen.
es: Los operadores de conversión no pueden convertir a partir de un tipo derivado.
fr: Les opérateurs de conversion ne peuvent pas convertir à partir d'un type dérivé.
it: Gli operatori di conversione non possono eseguire conversioni da un tipo derivato.
ja: 変換演算子によって派生型から変換することはできません。
ko: 변환 연산자는 파생 형식에서 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z typu pochodnego.
pt_br: Os operadores de conversão não podem converter de um tipo derivado.
ru: Исходным типом оператора преобразования не может быть производный тип.
tr: Dönüştürme işleçleri türetilen türden dönüştürülemez.
zh_hans: 转换运算符不能从派生类型转换。
zh_hant: 轉換運算子無法從衍生類型進行轉換。

# ERR_ConversionFromObject
source: Conversion operators cannot convert from Object.
cs: Operátory převodu nejde převést z typu Object.
de: Konvertierungsoperatoren können keine Konvertierung von "Object" durchführen.
es: Los operadores de conversión no pueden convertir a partir de Object.
fr: Les opérateurs de conversion ne peuvent pas convertir à partir d'Object.
it: Gli operatori di conversione non possono eseguire conversioni da Object.
ja: 変換演算子によって Object から変換することはできません。
ko: 변환 연산자는 Object에서 변환할 수 없습니다.
pl: Operatory konwersji nie mogą konwertować z elementu Object.
pt_br: Os operadores de conversão não podem converter de Object.
ru: Исходным типом оператора преобразования не может быть объект.
tr: Dönüştürme işleçleri Object türünden dönüştürülemez.
zh_hans: 转换运算符不能从 Object 转换。
zh_hant: 轉換運算子無法從物件進行轉換。

# ERR_MatchingOperatorExpected2
source: Matching '{0}' operator is required for '{1}'.
cs: Vyžaduje se odpovídající operátor {0} pro {1}.
de: Ein entsprechender {0}-Operator ist für "{1}" erforderlich.
es: Se requiere un operador '{0}' coincidente para '{1}'.
fr: Un opérateur '{0}' correspondant est requis pour '{1}'.
it: L'operatore '{0}' corrispondente è obbligatorio per '{1}'.
ja: '{1}' には対応する '{0}' 演算子が必要です。
ko: 짝이 되는 '{0}' 연산자가 '{1}'에 필요합니다.
pl: Wymagany pasujący operator „{0}” dla elementu „{1}”.
pt_br: Operador "{0}" correspondente é necessário para "{1}".
ru: Соответствующий оператор "{0}" требуется для "{1}".
tr: '{1}' için eşleşen '{0}' işleci gerekir.
zh_hans: “{1}”需要匹配“{0}”运算符。
zh_hant: '{1}' 必須要有對稱的 '{0}' 運算子。

# ERR_UnacceptableLogicalOperator3
source: Return and parameter types of '{0}' must be '{1}' to be used in a '{2}' expression.
cs: Typy vrácených hodnot a parametrů pro {0} musí být {1}, aby je bylo možné použít ve výrazu {2}.
de: Rückgabe- und Parametertypen von "{0}" müssen "{1}" sein, damit sie in einem {2}-Ausdruck verwendet werden können.
es: Los tipos de valor devuelto y de parámetro de '{0}' deben ser '{1}' para usarse en una expresión '{2}'.
fr: Les types de retour et de paramètres de '{0}' doivent être '{1}' pour être utilisés dans une expression '{2}'.
it: I tipi restituiti e i tipi di parametro di '{0}' devono essere '{1}' per poter essere usati in un'espressione '{2}'.
ja: '{0}' の戻り値およびパラメーターの型を '{2}' 式で使用するには、'{1}' にしなければなりません。
ko: '{0}'의 반환 및 매개 변수 형식은 '{2}' 식에서 사용할 '{1}'이어야 합니다.
pl: Typy zwracane i typy parametrów „{0}” muszą być typu „{1}”, aby można było ich używać w wyrażeniu „{2}”.
pt_br: Tipos de retorno e de parâmetro de "{0}" devem ser "{1}" para serem usados em uma instrução "{2}".
ru: Типы возврата и параметров "{0}" должны быть "{1}" для использования в выражении "{2}".
tr: '{2}' ifadesinde kullanılabilmesi için, '{0}' parametre türleri '{1}' olmalıdır.
zh_hans: “{0}”的返回类型和参数类型必须是“{1}”，才能在“{2}”表达式中使用。
zh_hant: '{0}' 的傳回類型與參數類型必須是 '{1}'，才可用在 '{2}' 運算式中。

# ERR_ConditionOperatorRequired3
source: Type '{0}' must define operator '{1}' to be used in a '{2}' expression.
cs: Typ {0} musí definovat operátor {1}, aby ho bylo možné použít ve výrazu {2}.
de: Der Typ "{0}" muss den {1}-Operator für die Verwendung in einem {2}-Ausdruck definieren.
es: El tipo '{0}' debe definir el operador '{1}' que se va a usar en una expresión '{2}'.
fr: Le type '{0}' doit définir l'opérateur '{1}' à utiliser dans une expression '{2}'.
it: Il tipo '{0}' deve definire l'operatore '{1}' per poter essere usato in un'espressione '{2}'.
ja: 型 '{0}' を '{2}' 式で使用するには、演算子 '{1}' を定義しなければなりません。
ko: '{0}' 형식은 '{2}' 식에서 사용할 '{1}' 연산자를 정의해야 합니다.
pl: Typ „{0}” musi definiować operator „{1}”, aby mógł zostać użyty w wyrażeniu „{2}”.
pt_br: Tipo "{0}" deve definir o operador "{1}" a ser usado em uma "{2}" expressão.
ru: Тип "{0}" должен указывать оператор "{1}" для использования в выражении "{2}".
tr: '{0}' türü, '{2}' ifadesinde kullanılmak üzere '{1}' işlecini tanımlamalıdır.
zh_hans: 类型“{0}”必须定义运算符“{1}”，才能在“{2}”表达式中使用。
zh_hant: 類型 '{0}' 必須定義要用於 '{2}' 運算式中的運算子 '{1}'。

# ERR_CopyBackTypeMismatch3
source: Cannot copy the value of 'ByRef' parameter '{0}' back to the matching argument because type '{1}' cannot be converted to type '{2}'.
cs: Nejde zkopírovat hodnotu parametru ByRef {0} zpátky na odpovídající argument, protože typ {1} nejde převést na typ {2}.
de: Der Wert des ByRef-Parameters "{0}" kann nicht in das entsprechende Argument zurückkopiert werden, da der Typ "{1}" nicht in Typ "{2}" konvertiert werden kann.
es: No se puede volver a copiar el valor del parámetro 'ByRef' '{0}' en el argumento correspondiente porque el tipo '{1}' no se puede convertir en el tipo '{2}'.
fr: Impossible de recopier la valeur du paramètre 'ByRef' '{0}' dans l'argument correspondant, car le type '{1}' ne peut pas être converti en type '{2}'.
it: Non è possibile copiare il valore del parametro '{0}' di 'ByRef' nell'argomento corrispondente perché il tipo '{1}' non può essere convertito nel tipo '{2}'.
ja: 型 '{1}' は型 '{2}' に変換できないため、'ByRef' パラメーター '{0}' の値を、一致する引数に戻してコピーすることはできません。
ko: '{1}' 형식은 '{2}' 형식으로 변환할 수 없으므로 'ByRef' 매개 변수 '{0}'의 값을 해당 인수에 다시 복사할 수 없습니다.
pl: Nie można skopiować wartości parametru „ByRef” „{0}” z powrotem do zgodnego argumentu, ponieważ typu „{1}” nie można przekonwertować na typ „{2}”.
pt_br: Não é possível copiar o valor do parâmetro "ByRef" "{0}" de volta para o argumento correspondente porque o tipo "{1}" não pode ser convertido para o tipo "{2}".
ru: Не удается скопировать значение параметра "ByRef" "{0}" обратно в соответствующий аргумент, поскольку тип "{1}" невозможно преобразовать в тип "{2}".
tr: '{1}' türü '{2}' türüne dönüştürülemediğinden, 'ByRef' parametresinin '{0}' değeri eşleşen bağımsız değişkene geri kopyalanamıyor.
zh_hans: 由于类型“{1}”不能转换为类型“{2}”，因此无法将“ByRef”参数“{0}”的值复制回匹配的参数。
zh_hant: 無法將 'ByRef' 參數的值 '{0}' 複製回相對應的引數，因為類型 '{1}' 無法轉換成類型 '{2}'。
