Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RefReturningCallInExpressionTree
source: An expression tree may not contain a call to a method or property that returns by reference.
cs: Strom výrazů nesmí obsahovat volání metody nebo vlastnosti vrácených pomocí odkazu.
de: Ein Ausdrucksbaum darf keinen Aufruf einer Methode oder Eigenschaft enthalten, deren Rückgabe als Verweis erfolgt.
es: Un árbol de expresión no puede contener una llamada a un método o una propiedad que devuelve por referencia.
fr: Une arborescence de l'expression ne peut pas contenir un appel à une méthode ou une propriété qui effectue un retour par référence.
it: Un albero delle espressioni non può contenere una chiamata a un metodo o a una proprietà che viene restituito per riferimento.
ja: 式のツリーは、参照渡しで返すメソッドまたはプロパティの呼び出しを含むことはできません。
ko: 식 트리에는 참조로 반환하는 메서드 또는 속성에 대한 호출을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać wywołania metody lub właściwości zwracanego przez referencję.
pt_br: Uma árvore de expressão não pode conter uma chamada para um método ou propriedade que essa árvore retorna por referência.
ru: Дерево выражений не может содержать вызов метода или свойства, которые возвращают данные по ссылке.
tr: İfade ağacı, başvuru ile döndürülen bir metot veya özellik çağrısı içeremez.
zh_hans: 表达式树不能包含对引用所返回的方法或属性的调用。
zh_hant: 運算式樹狀架構不能包含藉傳址所傳回的方法或屬性呼叫。

# ERR_CannotEmbedWithoutPdb
source: /embed switch is only supported when emitting a PDB.
cs: Přepínač /embed je podporovaný jen při vydávání souboru PDB.
de: Die Option "/embed" wird nur beim Ausgeben einer PDB unterstützt.
es: El modificador /embed solo se admite al emitir un PDB.
fr: Le commutateur /embed est uniquement pris en charge durant l'émission d'un fichier PDB.
it: L'opzione /embed è supportata solo quando si crea un file PDB.
ja: /embed スイッチは、PDB を生成する場合にのみサポートされます。
ko: /embed 스위치는 PDB를 내보낼 때만 지원됩니다.
pl: Przełącznik /embed jest obsługiwany tylko w przypadku emitowania pliku PDB.
pt_br: A opção /inserir tem suporte apenas ao emitir um PDB.
ru: Параметр /embed поддерживается только при создании PDB-файла.
tr: /embed anahtarı yalnızca PDB yayınlanırken desteklenir.
zh_hans: 仅在发出 PDB 时才支持 /embed 开关。
zh_hant: 只有在發出 PDB 時才支援 /embed 參數。

# ERR_InvalidInstrumentationKind
source: Invalid instrumentation kind: {0}
cs: Neplatný typ instrumentace: {0}
de: Ungültiger Instrumentierungstyp: {0}
es: Clase de instrumentación no válida: {0}
fr: Genre d'instrumentation non valide : {0}
it: Il tipo di strumentazione non è valido: {0}
ja: 無効なインストルメンテーションの種類: {0}
ko: 잘못된 계측 종류: {0}
pl: Nieprawidłowy rodzaj instrumentacji: {0}
pt_br: Variante de instrumentação inválida: {0}
ru: Недопустимый тип инструментирования: {0}
tr: Geçersiz izleme türü: {0}
zh_hans: 无效的检测类型: {0}
zh_hant: 檢測設備種類無效: {0}

# ERR_DocFileGen
source: Error writing to XML documentation file: {0}
cs: Chyba při zápisu do souboru dokumentace XML: {0}
de: Fehler beim Schreiben in XML-Dokumentationsdatei: {0}
es: Error al escribir en el archivo de documentación XML: {0}
fr: Erreur d'écriture dans le fichier de documentation XML : {0}
it: Si è verificato un errore durante la scrittura nel file di documentazione XML: {0}
ja: XML ドキュメント ファイル {0} の書き込み中にエラーが発生しました
ko: XML 문서 파일 쓰기 오류: {0}
pl: Błąd zapisu w pliku dokumentacji XML: {0}
pt_br: Erro gravando no arquivo de documentação XML: {0}
ru: Ошибка при записи в XML-файл документации: {0}
tr: XML belgeleri dosyasına yazılamadı: {0}
zh_hans: 写入 XML 文档文件时出错: {0}
zh_hant: 寫入 XML 文件檔案時發生錯誤: {0}

# ERR_BadAssemblyName
source: Invalid assembly name: {0}
cs: Neplatný název sestavení: {0}
de: Ungültiger Assemblyname: "{0}"
es: Nombre de ensamblado no válido: {0}
fr: Nom d'assembly non valide : {0}
it: Il nome di assembly {0} non è valido
ja: 無効なアセンブリ名: {0}
ko: 잘못된 어셈블리 이름: {0}
pl: Nieprawidłowa nazwa zestawu: {0}
pt_br: Nome de assembly inválido: {0}
ru: Недопустимое имя сборки: {0}
tr: Bütünleştirilmiş kod adı geçersiz: {0}
zh_hans: 无效的程序集名称: {0}
zh_hant: 組件名稱 {0} 無效

# ERR_TypeForwardedToMultipleAssemblies
source: Module '{0}' in assembly '{1}' is forwarding the type '{2}' to multiple assemblies: '{3}' and '{4}'.
cs: Modul {0} v sestavení {1} předává typ {2} několika sestavením: {3} a {4}.
de: Das Modul "{0}" in der Assembly "{1}" leitet den Typ "{2}" an mehrere Assemblys weiter: "{3}" und "{4}".
es: El módulo "{0}" del ensamblado "{1}" va a reenviar el tipo "{2}" a varios ensamblados: "{3}" y "{4}".
fr: Le module '{0}' dans l'assembly '{1}' transfère le type '{2}' à plusieurs assemblys : '{3}' et '{4}'.
it: Il modulo '{0}' nell'assembly '{1}' inoltra il tipo '{2}' a più assembly '{3}' e '{4}'.
ja: アセンブリ '{1}' のモジュール '{0}' によって、型 '{2}' が複数のアセンブリ '{3}' および '{4}' に転送されています。
ko: '{1}' 어셈블리의 '{0}' 모듈이 여러 어셈블리 '{3}' 및 '{4}'에 '{2}' 형식을 전달하고 있습니다.
pl: Moduł „{0}” w zestawie „{1}” przekazuje typ „{2}” do wielu zestawów: „{3}” i „{4}”.
pt_br: O módulo '{0}' no assembly '{1}' está encaminhando o tipo '{2}' para vários assemblies: '{3}' e '{4}'.
ru: Модуль "{0}" в сборке "{1}" перенаправляет тип "{2}" в несколько сборок: "{3}" и "{4}".
tr: '{1}' bütünleştirilmiş kodundaki '{0}' modülü, '{2}' türünü birden çok bütünleştirilmiş koda iletiyor: '{3}' ve '{4}'.
zh_hans: 程序集“{1}”中的模块“{0}”将类型“{2}”转发到多个程序集: “{3}”和“{4}”。
zh_hant: 組件 '{1}' 中的模組 '{0}' 正在將類型 '{2}' 轉送給多個組件: '{3}' 及 '{4}'。

# ERR_Merge_conflict_marker_encountered
source: Merge conflict marker encountered
cs: Byla zjištěna značka konfliktu sloučení.
de: Mergekonfliktmarker gefunden
es: Se encontró un marcador de conflicto de fusión mediante combinación
fr: Marqueur de conflit de fusion rencontré
it: È stato rilevato un marcatore di conflitti di merge
ja: マージ競合マーカーが検出されました
ko: 병합 충돌 표식을 발견했습니다.
pl: Napotkano znacznik konfliktu scalania
pt_br: Marcador de conflito de mesclagem encontrado
ru: Встретилась отметка о конфликте слияния
tr: Birleştirme çakışması işaretçisiyle karşılaşıldı
zh_hans: 遇到合并冲突标记
zh_hant: 偵測到合併衝突標記

# ERR_NoRefOutWhenRefOnly
source: Do not use refout when using refonly.
cs: Když používáte refonly, nepoužívejte refout.
de: Verwenden Sie "refout" nicht, wenn Sie "refonly" verwenden.
es: No use refout si utiliza refonly.
fr: N'utilisez pas refout quand vous utilisez refonly.
it: Non usare refout quando si usa refonly.
ja: refonly を使用する場合は、refout を使用しないでください。
ko: refonly를 사용할 때 refout을 사용하면 안 됩니다.
pl: Nie używaj opcji refout, gdy używana jest opcja refonly.
pt_br: Não use refout ao usar refonly.
ru: Не используйте refout при использовании refonly.
tr: refonly kullanılırken refout kullanmayın.
zh_hans: 不要在使用 refonly 时使用 refout。
zh_hant: 使用 refonly 時，請勿使用 refout。

# ERR_NoNetModuleOutputWhenRefOutOrRefOnly
source: Cannot compile net modules when using /refout or /refonly.
cs: Když se používá přepínač /refout nebo /refonly, nejde zkompilovat síťové moduly.
de: Netzmodule können nicht mithilfe von "/refout" oder "/refonly" kompiliert werden.
es: No se pueden compilar módulos al usar /refout o /refonly.
fr: Impossible de compiler les modules net en utilisant /refout ou /refonly.
it: Non è possibile compilare i moduli .NET quando si usa /refout o /refonly.
ja: /refout または /refonly を使用する場合は、ネット モジュールをコンパイルできません。
ko: /refout 또는 /refonly를 사용할 때 NET 모듈을 컴파일할 수 없습니다.
pl: Nie można skompilować modułów sieciowych, gdy używana jest opcja /refout lub /refonly.
pt_br: Não é possível compilar módulos de rede ao usar /refout ou /refonly.
ru: Не удается скомпилировать сетевые модули при использовании /refout или /refonly.
tr: /refout veya /refonly kullanılırken net modülleri derlenemez.
zh_hans: 无法在使用 /refout 或 /refonly 时编译 Net 模块。
zh_hant: 使用 /refout 或 /refonly 時無法編譯網路模組。

# ERR_BadNonTrailingNamedArgument
source: Named argument '{0}' is used out-of-position but is followed by an unnamed argument
cs: Pojmenovaný argument {0} se používá mimo pozici, je ale následovaný nepojmenovaným argumentem.
de: Das benannte Argument "{0}" wird außerhalb der Position verwendet, wird jedoch von einem unbenannten Argument gefolgt.
es: El argumento "{0}" con nombre se usa fuera de posición, pero va seguido de un argumento sin nombre.
fr: L'argument nommé '{0}' est utilisé hors-position mais est suivi d'un argument sans nom
it: L'argomento denominato '{0}' viene usato nella posizione errata ma è seguito da un argomento non denominato
ja: 名前付き引数 '{0}' の場所が正しくありません。後ろに名前なし引数があります
ko: 명명된 인수 '{0}'은(는) 잘못된 위치에 사용되었지만 뒤에 명명되지 않은 인수가 옵니다.
pl: Nazwany argument „{0}” jest używany poza pozycją, ale następuje po nim nienazwany argument
pt_br: O argumento nomeado '{0}' é usado fora de posição, mas é seguido por um argumento sem nome
ru: Именованный аргумент "{0}" используется не на своем месте, но за ним следует неименованный аргумент
tr: '{0}' adlandırılmış bağımsız değişkeni, pozisyonu dışında kullanıldı ancak ardından adlandırılmamış bir bağımsız değişken geliyor
zh_hans: 命名参数“{0}”的使用位置不当，但后跟一个未命名参数
zh_hant: 具名引數 '{0}' 未用在正確的位置，但後面接著未命名引數

# ERR_BadDocumentationMode
source: Provided documentation mode is unsupported or invalid: '{0}'.
cs: Zadaný režim dokumentace je nepodporovaný nebo neplatný: {0}.
de: Der angegebene Dokumentationsmodus wird nicht unterstützt oder ist ungültig: "{0}".
es: El modo de documentación proporcionado no se admite o no es válido: "{0}".
fr: Le mode de documentation fourni n'est pas pris en charge ou est non valide : '{0}'.
it: La modalità di documentazione specificata non è supportata o non è valida: '{0}'.
ja: 指定されたドキュメント モードがサポートされていないか無効です: '{0}'。
ko: 제공한 문서 모드가 지원되지 않거나 잘못되었습니다. '{0}'.
pl: Podany tryb dokumentacji jest nieobsługiwany lub nieprawidłowy: „{0}”.
pt_br: O modo de documentação fornecido não tem suporte ou é inválido: '{0}'.
ru: Указанный режим документации не поддерживается или недопустим: "{0}".
tr: Sağlanan belge modu desteklenmiyor veya geçersiz: '{0}'.
zh_hans: 提供的文档模式不受支持或无效:“{0}”。
zh_hant: 提供的文件模式不受支援或無效: '{0}'。

# ERR_BadLanguageVersion
source: Provided language version is unsupported or invalid: '{0}'.
cs: Zadaná verze jazyka je nepodporovaná nebo neplatná: {0}.
de: Die angegebene Sprachversion wird nicht unterstützt oder ist ungültig: "{0}".
es: La versión de lenguaje proporcionada no se admite o no es válida: "{0}".
fr: La version de langage fournie n'est pas prise en charge ou est non valide : '{0}'.
it: La versione del linguaggio specificata non è supportata o non è valida: '{0}'.
ja: 指定された言語バージョンがサポートされていないか無効です: '{0}'。
ko: 제공한 언어 버전이 지원되지 않거나 잘못되었습니다. '{0}'.
pl: Podana wersja języka jest nieobsługiwana lub nieprawidłowa: „{0}”.
pt_br: A versão de linguagem fornecida não tem suporte ou é inválida: '{0}'.
ru: Указанная версия языка не поддерживается или недопустима: "{0}".
tr: Sağlanan dil sürümü desteklenmiyor veya geçersiz: '{0}'.
zh_hans: 提供的语言版本不受支持或无效:“{0}”。
zh_hant: 提供的語言版本不受支援或無效: '{0}'。

# ERR_BadSourceCodeKind
source: Provided source code kind is unsupported or invalid: '{0}'
cs: Zadaný druh zdrojového kódu je nepodporovaný nebo neplatný: {0}.
de: Der angegebene Quellcodetyp wird nicht unterstützt oder ist ungültig: "{0}".
es: El tipo de código fuente proporcionado no se admite o no es válido: "{0}"
fr: Le genre de code source fourni n'est pas pris en charge ou est non valide : '{0}'
it: Il tipo del codice sorgente specificato non è supportato o non è valido: '{0}'
ja: 指定されたソース コードの種類がサポートされていないか無効です: '{0}'
ko: 제공된 소스 코드 종류가 지원되지 않거나 잘못되었습니다. '{0}'
pl: Podany rodzaj kodu źródłowego jest nieobsługiwany lub nieprawidłowy: „{0}”
pt_br: O tipo de código-fonte fornecido não tem suporte ou é inválido: '{0}'
ru: Указанный тип исходного кода не поддерживается или недопустим: "{0}"
tr: Sağlanan kaynak kodu türü desteklenmiyor veya geçersiz: '{0}'
zh_hans: 提供的源代码类型不受支持或无效:“{0}”
zh_hant: 提供的原始程式碼類型不受支援或無效: '{0}'

# ERR_TupleInferredNamesNotAvailable
source: Tuple element name '{0}' is inferred. Please use language version {1} or greater to access an element by its inferred name.
cs: Název elementu řazené kolekce členů {0} je odvozený. Pokud k elementu chcete získat přístup pomocí jeho odvozeného názvu, použijte prosím jazyk verze {1} nebo vyšší.
de: Der Tupelelementname "{0}" ist abgeleitet. Verwenden Sie Sprachversion {1} oder höher, um nach dem abgeleiteten Namen auf ein Element zuzugreifen.
es: El nombre "{0}" del elemento de tupla se ha deducido. Use la versión {1} del lenguaje, o una versión posterior, para acceder a un elemento por el nombre deducido.
fr: Le nom d'élément de tuple '{0}' est déduit. Utilisez la version de langage {1} ou une version supérieure pour accéder à un élément par son nom déduit.
it: Il nome '{0}' dell'elemento di tupla è dedotto. Usare la versione {1} o una versione successiva del linguaggio per accedere a un elemento in base al relativo nome dedotto.
ja: タプル要素名 '{0}' と推測されます。推測される名前で要素にアクセスするには、言語バージョン {1} 以上をお使いください。
ko: 튜플 요소 이름 '{0}'이(가) 유추됩니다. 언어 버전 {1} 이상을 사용하여 유추된 이름으로 요소에 액세스하세요.
pl: Nazwa elementu krotki „{0}” została wywnioskowana. Użyj wersji języka {1} lub nowszej, aby uzyskać dostęp do elementu według jego wywnioskowanej nazwy.
pt_br: O nome do elemento de tupla '{0}' é deduzido. Use a versão de idioma {1} ou posterior para acessar um elemento pelo nome deduzido.
ru: Имя элемента кортежа "{0}" является выведенным. Для обращения к элементу по выведенному имени используйте версию языка {1} или более позднюю.
tr: '{0}' demet öğesi adı çıkarsandı. Bir öğeye çıkarsanan adıyla erişmek için lütfen {1} veya üzeri dil sürümünü kullanın.
zh_hans: 推断出元组元素名称“{0}”。请使用语言版本 {1} 或更高版本按推断名称访问元素。
zh_hant: 元組項目名稱 '{0}' 從推斷而來。請使用語言版本 {1} 或更新版本，依推斷名稱存取項目。

# WRN_Experimental
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates.
cs: '{0} slouží jen pro účely vyhodnocení a v budoucích aktualizacích může dojít ke změně nebo odebrání.
de: '"{0}" dient nur zu Testzwecken und kann in zukünftigen Aktualisierungen geändert oder entfernt werden.
es: "{0}" se incluye con fines de evaluación y está sujeto a cambios o a que se elimine en próximas actualizaciones.
fr: '{0}' est utilisé à des fins d'évaluation uniquement. Il sera peut-être changé ou supprimé au cours des prochaines mises à jour.
it: '{0}' viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri.
ja: '{0}' は、評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。
ko: '{0}'은(는) 평가 목적으로 제공되며, 이후 업데이트에서 변경되거나 제거될 수 있습니다.
pl: 'Element „{0}” jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach.
pt_br: '{0}' é para fins de avaliação somente e está sujeito a alterações ou remoções em atualizações futuras.
ru: "{0}" предназначен только для оценки и может быть изменен или удален в будущих обновлениях.
tr: '{0}' yalnızca değerlendirme amaçlıdır ve gelecekteki güncelleştirmelerde değiştirilebilir veya kaldırılabilir.
zh_hans: '“{0}”仅用于评估，在将来的更新中可能会被更改或删除。
zh_hant: '{0}' 僅供評估之用。後續更新時可能會有所變更或移除。

# WRN_Experimental_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates.
cs: Typ slouží jen pro účely vyhodnocení a v budoucích aktualizacích může dojít ke změnám nebo odebrání.
de: Der Typ dient nur zu Testzwecken und kann in zukünftigen Aktualisierungen geändert oder entfernt werden.
es: Este tipo se incluye solo con fines de evaluación y está sujeto a cambios o a que se elimine en próximas actualizaciones.
fr: Le type est utilisé à des fins d'évaluation uniquement. Il sera peut-être changé ou supprimé au cours des prochaines mises à jour.
it: Type viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri.
ja: 型は評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。
ko: 형식은 평가 목적으로 제공되며, 이후 업데이트에서 변경되거나 제거될 수 있습니다.
pl: Typ jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach.
pt_br: O tipo destina-se somente para fins de avaliação e está sujeito a alterações ou remoções em atualizações futuras.
ru: Тип предназначен только для оценки и может быть изменен или удален в будущих обновлениях.
tr: Tür, yalnızca değerlendirme amaçlıdır ve gelecekteki güncelleştirmelerde değiştirilebilir veya kaldırılabilir.
zh_hans: 类型仅用于评估，在将来的更新中可能会被更改或删除。
zh_hant: 類型僅供評估之用。後續更新時可能會有所變更或移除。

# ERR_InvalidDebugInfo
source: Unable to read debug information of method '{0}' (token 0x{1:X8}) from assembly '{2}': {3}
es: No se puede leer la información de depuración del método '{0}' (token 0x{1:X8}) del ensamblado '{2}': {3}
zh_hant: 無法從組件 '{2}' 讀取方法 '{0}' (權杖 0x{1:X8}) 的偵錯資訊: {3}

# IConversionExpressionIsNotVisualBasicConversion
source: {0} is not a valid Visual Basic conversion expression
cs: {0} není platný výraz převodu jazyka Visual Basic.
de: "{0}" ist kein gültiger Visual Basic-Konvertierungsausdruck.
es: {0} no es una expresión de conversión válida de Visual Basic.
fr: {0} n'est pas une expression de conversion Visual Basic valide
it: {0} non è un'espressione di conversione di Visual Basic valida
ja: {0} は Visual Basic の有効な変換式ではありません
ko: {0}은(는) 유효한 Visual Basic 변환 식이 아닙니다.
pl: {0} nie jest prawidłowym wyrażeniem konwersji języka Visual Basic
pt_br: {0} não é uma expressão de conversão válida do Visual Basic
ru: {0} не является допустимым выражением преобразования Visual Basic
tr: {0}, geçerli bir Visual Basic dönüştürme ifadesi değil
zh_hans: {0} 不是有效的 Visual Basic 转换表达式
zh_hant: {0} 不是有效的 Visual Basic 轉換運算式

# IArgumentIsNotVisualBasicArgument
source: {0} is not a valid Visual Basic argument
cs: {0} není platný argument jazyka Visual Basic.
de: "{0}" ist kein gültiges Visual Basic-Argument.
es: {0} no es un argumento válido de Visual Basic.
fr: {0} n'est pas un argument Visual Basic valide
it: {0} non è un argomento di Visual Basic valido
ja: {0} は Visual Basic の有効な引数ではありません
ko: {0}은(는) 유효한 Visual Basic 인수가 아닙니다.
pl: {0} nie jest prawidłowym argumentem języka Visual Basic
pt_br: {0} não é um argumento válido do Visual Basic
ru: {0} не является допустимым аргументом Visual Basic
tr: {0}, geçerli bir Visual Basic bağımsız değişkeni değil
zh_hans: {0} 不是有效的 Visual Basic 参数
zh_hant: {0} 不是有效的 Visual Basic 引數

# FEATURE_LeadingDigitSeparator
source: leading digit separator
cs: oddělovač úvodní číslice
de: Trennzeichen für vorangestellte Ziffern
es: separador de dígito inicial
fr: séparateur numérique de début
it: separatore di cifra iniziale
ja: 先頭の桁区切り記号
ko: 선행 숫자 구분 기호
pl: wiodący separator cyfr
pt_br: separador de dígito à esquerda
ru: разделитель начальных цифр
tr: ilk basamak ayıracı
zh_hans: 前导数字分隔符
zh_hant: 前置數字分隔符號

# ERR_ValueTupleResolutionAmbiguous3
source: Predefined type '{0}' is declared in multiple referenced assemblies: '{1}' and '{2}'
cs: Předdefinovaný typ {0} je deklarovaný v několika odkazovaných sestaveních: {1} a {2}.
de: Der vordefinierte Typ "{0}" wurde in mehreren referenzierten Assemblys deklariert: "{1}" und "{2}"
es: El tipo "{0}" predefinido se declara en varios ensamblados a los que se hace referencia: "{1}" y "{2}"
fr: Le type prédéfini '{0}' est déclaré dans plusieurs assemblys référencés : '{1}' et '{2}'
it: Il tipo predefinito '{0}' è dichiarato in più assembly di riferimento: '{1}' e '{2}'
ja: 定義済みの型 '{0}' が複数の参照先アセンブリで宣言されています: '{1}' と '{2}'
ko: 미리 정의된 형식 '{0}'이(가) 여러 참조된 어셈블리('{1}' 및 '{2}')에서 선언되었습니다.
pl: Wstępnie zdefiniowany typ „{0}” jest zadeklarowany w wielu przywoływanych zestawach: „{1}” i „{2}”
pt_br: O tipo predefinido ‘{0}’ é declarado em vários assemblies referenciados: ‘{1}’ e ‘{2}’
ru: Предопределенный тип "{0}" объявлен в нескольких сборках, на которые имеются ссылки: "{1}" и "{2}"
tr: Önceden tanımlı '{0}' türü birden çok başvurulan bütünleştirilmiş kodda bildirildi: '{1}' ve '{2}'
zh_hans: 已在多个引用的程序集(“{1}”和“{2}”)中声明了预定义类型“{0}”。
zh_hant: 在多個參考組件中宣告了預先定義的類型 '{0}': '{1}' 與 '{2}'

# ICompoundAssignmentOperationIsNotVisualBasicCompoundAssignment
source: {0} is not a valid Visual Basic compound assignment operation
cs: {0} není platná operace složeného přiřazení Visual Basicu.
de: "{0}" ist kein gültiger Visual Basic-Verbundzuweisungsvorgang.
es: {0} no es una operación de asignación compuesta de Visual Basic válida
fr: {0} n'est pas une opération d'assignation composée Visual Basic valide
it: {0} non è un'operazione valida di assegnazione composta Visual Basic
ja: {0} は有効な Visual Basic 複合代入操作ではありません
ko: {0}은(는) 유효한 Visual Basic 복합 할당 연산이 아닙니다.
pl: {0} nie jest prawidłową złożoną operacją przypisania w języku Visual Basic
pt_br: {0} não é uma operação de atribuição composta de Visual Basic válida
ru: {0} не является допустимой операцией составного назначения Visual Basic
tr: {0} geçerli bir Visual Basic bileşik atama işlemi değil
zh_hans: {0} 不是有效的 Visual Basic 复合赋值运算
zh_hant: {0} 不是有效的 Visual Basic 複合指派作業

# ERR_InvalidHashAlgorithmName
source: Invalid hash algorithm name: '{0}'
cs: Neplatný název algoritmu hash: {0}
de: Ungültiger Name für Hashalgorithmus: "{0}"
es: Nombre de algoritmo hash no válido: "{0}"
fr: Nom d'algorithme de hachage non valide : '{0}'
it: Il nome dell'algoritmo hash non è valido: '{0}'
ja: 無効なハッシュ アルゴリズム名: '{0}'
ko: 잘못된 해시 알고리즘 이름: '{0}'
pl: Nieprawidłowa nazwa algorytmu wyznaczania wartości skrótu: „{0}”
pt_br: Nome de algoritmo de hash inválido: '{0}'
ru: Недопустимое имя хэш-алгоритма: "{0}"
tr: Geçersiz karma algoritması adı: '{0}'
zh_hans: 无效的哈希算法名称:“{0}”
zh_hant: 雜湊演算法名稱無效: '{0}'

# FEATURE_InterpolatedStrings
source: interpolated strings
cs: interpolované řetězce
de: Interpolierte Zeichenfolgen
es: cadenas interpoladas
fr: chaînes interpolées
it: stringhe interpolate
ja: 補間された文字列
ko: 보간된 문자열
pl: ciągi interpolowane
pt_br: cadeias de caracteres interpoladas
ru: интерполированные строки
tr: aradeğerlendirme dizeleri
zh_hans: 内插字符串
zh_hant: 內插字串

# FTL_InvalidInputFileName
source: File name '{0}' is empty, contains invalid characters, has a drive specification without an absolute path, or is too long
cs: Název souboru {0} je prázdný, obsahuje neplatné znaky, má specifikaci jednotky bez absolutní cesty nebo je moc dlouhý.
de: Der Dateiname "{0}" ist leer, enthält ungültige Zeichen, weist eine Laufwerkangabe ohne absoluten Pfad auf oder ist zu lang.
es: El nombre de archivo '{0}' está vacío, contiene caracteres no válidos, tiene una especificación de unidad sin ruta de acceso absoluta o es demasiado largo
fr: Le nom de fichier '{0}' est vide, contient des caractères non valides, spécifie un lecteur sans chemin d'accès absolu ou est trop long
it: Il nome file '{0}' è vuoto, contiene caratteri non validi, include una specifica di unità senza percorso assoluto oppure è troppo lungo
ja: ファイル名 '{0}' は、空である、無効な文字を含んでいる、絶対パスが指定されていないドライブ指定がある、または長すぎるかのいずれかです
ko: '{0}' 파일 이름이 비어 있거나, 잘못된 문자가 있거나, 절대 경로가 없는 드라이브 사양이 있거나, 너무 깁니다.
pl: Nazwa pliku „{0}” jest pusta, zawiera nieprawidłowe znaki, zawiera specyfikację dysku bez bezwzględnej ścieżki lub jest za długa
pt_br: Nome do arquivo "{0}" está vazio, contém caracteres inválidos, tem uma especificação de unidade sem um caminho absoluto ou é muito longo
ru: Имя файла "{0}" пустое, содержит недопустимые символы, имеет имя диска без абсолютного пути или слишком длинное.
zh_hans: 文件名“{0}”为空、包含无效字符、未使用绝对路径指定驱动器或太长
zh_hant: 檔案名稱 '{0}' 是空的、包含了無效字元、指定了磁碟機但不是絕對路徑，或太長了

# WRN_AttributeNotSupportedInVB
source: '{0}' is not supported in VB.
cs: Atribut {0} není v jazyce VB podporovaný.
de: "{0}" wird in VB nicht unterstützt.
es: No se admite "{0}" en VB.
it: '{0}' non è supportato in VB.
ja: '{0}' は VB ではサポートされていません。
ko: '{0}'은(는) VB에서 지원되지 않습니다.
pl: Element „{0}” nie jest obsługiwany w języku VB.
pt_br: Não há suporte para '{0}' no VB.
ru: "{0}" не поддерживается в VB.
tr: '{0}', VB'de desteklenmiyor.
zh_hans: VB 中不支持“{0}”。
zh_hant: VB 中不支援 '{0}'。
