Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvInsideEndsInterface
source: Statement cannot appear within an interface body. End of interface assumed.
cs: Příkaz se nemůže objevit v těle rozhraní. Předpokládá se konec rozhraní.
de: Die Anweisung kann nicht innerhalb des Schnittstellentexts verwendet werden. Das Ende der Schnittstelle wird angenommen.
es: La instrucción no puede aparecer dentro del cuerpo de una interfaz. Se supone el final de la interfaz.
fr: L'instruction ne peut pas apparaître dans le corps d'une interface. Elle est interprétée comme la fin de l'interface.
it: L'istruzione non può essere specificata all'interno di un corpo di interfaccia. Verrà interpretata come fine dell'interfaccia.
ja: ステートメントをインターフェイス本体内部に記述することはできません。インターフェイスの終わりと見なされます。
ko: 인터페이스 본문 안에는 문을 사용할 수 없습니다. 인터페이스의 끝으로 간주합니다.
pl: Instrukcja nie może wystąpić w treści interfejsu. Założono koniec interfejsu.
pt_br: A instrução não pode aparecer dentro do corpo de uma interface. Fim da interface assumido.
ru: Оператор не может присутствовать в теле интерфейса. Предполагается конец интерфейса.
tr: Arabirim gövdesi içinde deyim bulunamaz. Arabirim sonu varsayıldı.
zh_hans: 语句不能出现在接口体内。假定为接口末尾。
zh_hant: 陳述式不可以在介面主體中出現。已假設是介面結尾。

# ERR_BadFlagsInNotInheritableClass1
source: 'NotInheritable' classes cannot have members declared '{0}'.
cs: 'Třídy NotInheritable nemůžou obsahovat členy s deklarací {0}.
de: 'NotInheritable-Klassen können keine als "{0}" deklarierten Member haben.
es: 'Las clases 'NotInheritable' no pueden tener miembros declarados como '{0}'.
fr: 'Les classes 'NotInheritable' ne peuvent pas avoir de membres déclarés '{0}'.
it: 'Le classi 'NotInheritable' non possono avere membri dichiarati come '{0}'.
ja: 'NotInheritable' クラスに、'{0}' として宣言されたメンバーを指定することはできません。
ko: 'NotInheritable' 클래스에는 '{0}'(으)로 선언된 멤버를 포함할 수 없습니다.
pl: 'Klasy „NotInheritable” nie mogą mieć składowych zadeklarowanych jako „{0}”.
pt_br: 'Classes "NotInheritable" não podem ter membros declarados "{0}".
ru: 'Классы "NotInheritable" не могут содержать членов, объявленных как "{0}".
tr: 'NotInheritable' sınıflarında '{0}' olarak bildirilen üyeler olamaz.
zh_hans: '“NotInheritable”类不能有声明为“{0}”的成员。
zh_hant: 'NotInheritable' 類別不可有宣告為 '{0}' 的成員。

# ERR_BaseOnlyClassesMustBeExplicit2
source: Class '{0}' must either be declared 'MustInherit' or override the following inherited 'MustOverride' member(s): {1}.
cs: Třída {0} buď musí mít deklaraci MustInherit, nebo musí přepsat následující zděděné členy MustOverride: {1}.
de: Die {0}-Klasse muss als "MustInherit" deklariert werden oder folgende geerbte MustOverride-Member überschreiben: {1}.
es: La clase '{0}' debe declararse como 'MustInherit' o invalidar los siguientes miembros 'MustOverride' heredados: {1}.
fr: La classe '{0}' doit être déclarée 'MustInherit' ou se substituer aux membres 'MustOverride' hérités suivants : {1}.
it: La classe '{0}' deve essere dichiarata come 'MustInherit' oppure eseguire l'override dei seguenti membri 'MustOverride' ereditati: {1}.
ja: クラス '{0}' は、'MustInherit' として宣言するか、または以下の継承 'MustOverride' メンバーをオーバーライドしなければなりません: {1}。
ko: '{0}' 클래스를 'MustInherit'으로 선언하거나, 상속된 'MustOverride' 멤버인 '{1}'을(를) 재정의해야 합니다.
pl: Klasa „{0}” musi być zadeklarowana jako „MustInherit” lub przesłaniać następujące dziedziczone składowe „MustOverride”: {1}.
pt_br: Classe "{0}" deve ser ou declarada "MustInherit" ou substituir o(s) seguinte(s) membro(s) "MustOverride" herdado(s): {1}.
ru: Класс "{0}" должен либо быть объявлен как "MustInherit", либо переопределять следующие члены, помеченные как "MustOverride": {1}"
tr: '{0}' sınıfı 'MustInherit' olarak bildirilmeli veya devralınmış şu 'MustOverride' üyelerini geçersiz kılmalıdır: {1}.
zh_hans: 类“{0}”必须声明为“MustInherit”或重写以下继承的“MustOverride”成员: {1}。
zh_hant: 類別 '{0}' 必須宣告為 'MustInherit'，或是覆寫下列繼承的 'MustOverride' 成員: {1}。

# ERR_MustInheritEventNotOverridden
source: '{0}' is a MustOverride event in the base class '{1}'. Visual Basic does not support event overriding. You must either provide an implementation for the event in the base class, or make class '{2}' MustInherit.
cs: '{0} je událost třídy MustOverride v základní třídě {1}. Visual Basic nepodporuje přepisování událostí. Buď musíte zadat implementaci události v základní třídě, nebo vytvořit třídu {2} MustInherit.
de: '"{0}" ist ein MustOverride-Ereignis in der Basisklasse "{1}". Das Überschreiben von Ereignissen wird in Visual Basic nicht unterstützt. Sie müssen entweder eine Implementierung für das Ereignis in der Basisklasse bereitstellen oder die Klasse "{2}" als MustInherit definieren.
es: '{0}' es un evento MustOverride en la clase base '{1}'. Visual Basic no admite la invalidación de eventos. Proporcione una implementación para el evento en la clase base o convierta la clase '{2}' en MustInherit.
fr: '{0}' est un événement MustOverride dans la classe de base '{1}'. Visual Basic ne prend pas en charge pas la surcharge des événements. Vous devez fournir une implémentation pour l'événement dans la classe de base ou bien rendre la classe '{2}' MustInherit.
it: '{0}' è un evento MustOverride nella classe di base '{1}'. Visual Basic non supporta l'override di eventi. È necessario fornire un'implementazione per l'evento nella classe di base oppure impostare la classe '{2}' come MustInherit.
ja: '{0}' は基底クラス '{1}' の MustOverride イベントです。Visual Basic はイベント オーバーライドをサポートしません。基底クラスでイベントの実装を行うか、クラス '{2}' を MustInherit にする必要があります。
ko: '{0}'은(는) 기본 클래스 '{1}'의 MustOverride 이벤트입니다. Visual Basic은 이벤트 재정의를 지원하지 않습니다. 기본 클래스에서 해당 이벤트를 위한 구현을 제공하거나 클래스 '{2}' MustInherit를 만들어야 합니다.
pl: „{0}” jest zdarzeniem MustOverride w klasie bazowej „{1}”. Język Visual Basic nie obsługuje przesłaniania zdarzeń. Musisz określić implementację zdarzenia w klasie bazowej lub ustawić klasę „{2}” jako zdarzenie MustInherit.
pt_br: '{0}' é um evento MustOverride na classe base'{1}'. O Visual Basic não dá suporte à substituição de eventos. Você deve fornecer uma implantação para o evento na classe base ou tornar a classe '{2}' MustInherit.
ru: "{0}" является событием MustOverride в базовом классе "{1}". Visual Basic не поддерживает переопределение событий. Необходимо предоставить реализацию события в базовом классе или задать для класса "{2}" значение MustInherit.
tr: '{0}', '{1}' temel sınıflı bir MustOverride etkinliğidir. Visual Basic etkinlik geçersiz kılmayı desteklemez. Temel sınıfta etkinlik içi bir uygulama sağlamalı veya '{2}' sınıfını MustInherit yapmalısınız.
zh_hans: '“{0}”是基类“{1}” 中的 MustOverride 事件。Visual Basic 不支持事件替代。必须提供基类中事件的实现或让类“{2}“成为 MustInherit。
zh_hant: '{0}' 是基底類別 '{1}' 中的 MustOverride 事件。Visual Basic 不支援事件覆寫。您必須提供基底類別中的事件實作，或將類別 '{2}' 設為 MustInherit。

# ERR_NegativeArraySize
source: Array dimensions cannot have a negative size.
cs: Rozměry pole nemůžou být záporná čísla.
de: Arraydimensionen können keine negative Größe haben.
es: Las dimensiones de matriz no pueden tener un tamaño negativo.
fr: Les dimensions d'un tableau ne peuvent pas être de taille négative.
it: Le dimensioni di una matrice non possono essere negative.
ja: 配列の次元を、負の値のサイズに設定することはできません。
ko: 배열 차원의 크기는 음수일 수 없습니다.
pl: Wymiary tablicy nie mogą mieć rozmiaru ujemnego.
pt_br: As dimensões de matriz não podem ter tamanho negativo.
ru: Размерности массива не могут иметь отрицательные значения.
tr: Dizi boyutları negatif olamaz.
zh_hans: 数组维数的大小不能为负。
zh_hant: 陣列維度大小不可以是負數。

# ERR_MyClassAbstractCall1
source: 'MustOverride' method '{0}' cannot be called with 'MyClass'.
cs: 'Metodu {0} typu MustOverride nejde volat pomocí klíčového slova MyClass.
de: 'Die MustOverride-Methode "{0}" kann nicht mit "MyClass" aufgerufen werden.
es: 'No se puede llamar al método 'MustOverride' '{0}' con 'MyClass'.
fr: 'La méthode 'MustOverride' '{0}' ne peut pas être appelée par 'MyClass'.
it: 'Il metodo 'MustOverride' '{0}' non può essere chiamato con 'MyClass'.
ja: 'MustOverride' メソッド '{0}' を、'MyClass' で呼び出すことはできません。
ko: 'MustOverride' 메서드 '{0}'은(는) 'MyClass'로 호출할 수 없습니다.
pl: Nie można wywołać metody „{0}” typu „MustOverride” przy użyciu elementu „MyClass”.
pt_br: 'Método "MustOverride" "{0}" não pode ser chamado com "MyClass".
ru: 'Метод "{0}", помеченный как "MustOverride", не может вызываться с помощью "MyClass".
tr: '{0}' 'MustOverride' yöntemi 'MyClass' ile çağrılamaz.
zh_hans: '无法用“MyClass”调用“MustOverride”方法“{0}”。
zh_hant: '無法以 'MyClass' 呼叫 'MustOverride' 方法 '{0}'。

# ERR_EndDisallowedInDllProjects
source: 'End' statement cannot be used in class library projects.
cs: 'Příkaz End nejde použít v projektech knihoven tříd.
de: 'Die End-Anweisung kann nicht in Klassenbibliothekprojekten verwendet werden.
es: 'La instrucción 'End' no se puede usar en proyectos de biblioteca de clases.
fr: 'L'instruction 'End' ne peut pas être utilisée dans les projets de bibliothèque de classes.
it: 'L'istruzione 'End' non può essere usata nei progetti di tipo libreria di classi.
ja: 'クラス ライブラリ プロジェクトで 'End' ステートメントを使用することはできません。
ko: 'End' 문은 클래스 라이브러리 프로젝트에 사용할 수 없습니다.
pl: 'Nie można użyć instrukcji End w projektach biblioteki klas.
pt_br: 'A instrução 'End' não pode ser usada em projetos de biblioteca de classes.
ru: 'Оператор "End" не может использоваться в проектах библиотек классов.
tr: 'End' deyimi, sınıf kitaplığı projelerinde kullanılamaz.
zh_hans: '在类库项目中不能使用 "End" 语句。
zh_hant: '不可以在類別庫專案中使用 'End' 陳述式。

# ERR_BlockLocalShadowing1
source: Variable '{0}' hides a variable in an enclosing block.
cs: Proměnná {0} skrývá proměnnou z vnějšího bloku.
de: Die Variable "{0}" verbirgt eine Variable in einem einschließenden Block.
es: La variable '{0}' oculta una variable en un bloque de inclusión.
fr: La variable '{0}' masque une variable dans un bloc englobant.
it: La variabile '{0}' nasconde una variabile in un blocco di inclusione.
ja: 変数 '{0}' は、それを囲むブロック内の変数を隠ぺいします。
ko: '{0}' 변수는 바깥쪽 블록에 있는 변수를 숨깁니다.
pl: Zmienna „{0}” ukrywa zmienną w otaczającym bloku.
pt_br: Variável "{0}" oculta uma variável em um bloco delimitador.
ru: Переменная "{0}" скрывает переменную во внешнем блоке.
tr: '{0}' değişkeni kapsayan bir blokta bir değişkeni gizliyor.
zh_hans: 变量“{0}”在封闭块中隐藏变量。
zh_hant: 變數 '{0}' 在封閉區塊中隱藏了變數。

# ERR_ModuleNotAtNamespace
source: 'Module' statements can occur only at file or namespace level.
cs: 'Příkazy Module jde používat jenom na úrovni souboru nebo oboru názvů.
de: 'Module-Anweisungen können nur auf Namespace- oder Dateiebene verwendet werden.
es: 'Las instrucciones 'Module' solo pueden ocurrir en el nivel de archivo o de espacio de nombres.
fr: 'Les instructions 'Module' ne peuvent intervenir qu'au niveau du fichier ou de l'espace de noms.
it: 'Le istruzioni 'Module' possono essere specificate solo a livello di file o di spazio dei nomi.
ja: 'Module' ステートメントは、ファイル レベルまたは名前空間レベルでしか指定できません。
ko: 'Module' 문은 파일이나 네임스페이스 수준에서만 사용할 수 있습니다.
pl: 'Instrukcje Module mogą wystąpić tylko na poziomie pliku lub przestrzeni nazw.
pt_br: 'Instruções 'Module' só podem ocorrer em nível de arquivo ou namespace.
ru: 'Операторы "Module" могут использоваться только на уровне файлов и пространств имен.
tr: 'Module' deyimleri yalnızca dosya veya ad uzayı düzeyinde bulunabilir.
zh_hans: '"Module" 语句只能出现在文件级或命名空间级。
zh_hant: 'Module' 陳述式只可以發生在檔案或命名空間層級。

# ERR_NamespaceNotAtNamespace
source: 'Namespace' statements can occur only at file or namespace level.
cs: 'Příkazy Namespace jde používat jenom na úrovni souboru nebo oboru názvů.
de: 'Namespace-Anweisungen können nur auf Namespace- oder Dateiebene verwendet werden.
es: 'Las instrucciones 'Namespace' solo pueden ocurrir en el nivel de archivo o de espacio de nombres.
fr: 'Les instructions 'Namespace' ne peuvent intervenir qu'au niveau du fichier ou de l'espace de noms.
it: 'Le istruzioni 'Namespace' possono essere specificate solo a livello di file o di spazio dei nomi.
ja: 'Namespace' ステートメントは、ファイル レベルまたは名前空間レベルでしか指定できません。
ko: 'Namespace' 문은 파일이나 네임스페이스 수준에서만 사용할 수 있습니다.
pl: 'Instrukcje Namespace mogą wystąpić tylko na poziomie pliku lub przestrzeni nazw.
pt_br: 'Instruções 'Namespace' só podem ocorrer em nível de arquivo ou namespace.
ru: 'Операторы "Namespace" могут использоваться только на уровне файлов и пространств имен.
tr: 'Namespace' deyimleri yalnızca dosya veya ad uzayı düzeyinde bulunabilir.
zh_hans: '"Namespace" 语句只能出现在文件级或命名空间级。
zh_hant: 'Namespace' 陳述式只可以發生在檔案或命名空間層級。

# ERR_InvInsideEnum
source: Statement cannot appear within an Enum body.
cs: Příkaz se nedá použít v těle výčtu.
de: Eine Anweisung kann nicht innerhalb eines Enumerationstexts verwendet werden.
es: La instrucción no puede aparecer dentro del cuerpo de una enumeración.
fr: L'instruction ne peut pas apparaître dans le corps d'un Enum.
it: L'istruzione non può essere presente nel corpo di un'enumerazione.
ja: ステートメントは、Enum 本体内部には記述できません。
ko: 열거형 본문 안에는 문을 사용할 수 없습니다.
pl: Instrukcja nie może wystąpić w treści wyliczenia.
pt_br: A instrução não pode aparecer em um corpo de Enum.
ru: Оператор не может присутствовать в теле перечисления.
tr: Sabit listesi gövdesi içinde deyim bulunamaz.
zh_hans: 语句不能出现在枚举体内。
zh_hant: 陳述式不可出現在列舉主體中。

# ERR_InvInsideEndsEnum
source: Statement cannot appear within an Enum body. End of Enum assumed.
cs: Příkaz se nemůže objevit v těle výčtu. Předpokládá se konec výčtu.
de: Die Anweisung kann nicht innerhalb des Enumerationstexts verwendet werden. Enumerationsende wird angenommen.
es: La instrucción no puede aparecer dentro del cuerpo de una enumeración. Se supone el final de la enumeración.
fr: Cette instruction ne peut pas apparaître dans le corps d'un Enum. Elle est interprétée comme la fin de l'Enum.
it: L'istruzione non può trovarsi nel corpo di un'enumerazione. Verrà interpretata come fine dell'enumerazione.
ja: ステートメントは、Enum 本体内部には記述できません。Enum の終わりと見なします。
ko: 열거형 본문 안에는 문을 사용할 수 없습니다. 열거형의 끝으로 간주합니다.
pl: Instrukcja nie może wystąpić w treści wyliczenia. Założono koniec wyliczenia.
pt_br: A instrução não pode aparecer dentro do corpo de Enum. Fim de Enum assumido.
ru: Оператор не может присутствовать в теле перечисления. Предполагается, что перечисление завершено.
tr: Sabit listesi gövdesi içinde deyim bulunamaz. Sabit listesi sonu varsayıldı.
zh_hans: 语句不能出现在枚举体内。假定已到达枚举末尾。
zh_hant: 陳述式不可以在列舉主體中出現。已假設是列舉結尾。

# ERR_InvalidOptionStrict
source: 'Option Strict' can be followed only by 'On' or 'Off'.
cs: 'Za klíčovým slovem Option Strict může následovat jenom klíčové slovo On nebo Off.
de: 'Auf "Option Strict" kann nur "On" oder "Off" folgen.
es: 'Option Strict' solo puede ir seguida de 'On' u 'Off'.
fr: 'Option Strict' ne peut être suivi que de 'On' ou 'Off'.
it: 'Option Strict' può essere seguito solo da 'On' o da 'Off'.
ja: 'Option Strict' の後には、'On' または 'Off' のみ指定できます。
ko: 'Option Strict' 뒤에는 'On' 또는 'Off'만 올 수 있습니다.
pl: 'Po instrukcji Option Strict może wystąpić jedynie opcja On lub Off.
pt_br: 'Option Strict' só pode ser seguido por 'On' ou 'Off'.
ru: 'За "Option Strict" может следовать только "On" или "Off".
tr: 'Option Strict' öğesinin ardından yalnızca 'On' veya 'Off' gelebilir.
zh_hans: '"Option Strict" 的后面只能跟 "On" 或 "Off"。
zh_hant: 'Option Strict' 之後只能是 'On' 或 'Off'。

# ERR_EndStructureNoStructure
source: 'End Structure' must be preceded by a matching 'Structure'.
cs: 'Příkazu End Structure musí předcházet párový příkaz Structure.
de: '"End Structure" muss ein entsprechendes "Structure" voranstehen.
es: 'End Structure' debe ir precedida de la instrucción 'Structure' correspondiente.
fr: 'End Structure' doit être précédé d'un 'Structure' correspondant.
it: 'End Structure' deve essere preceduto da uno 'Structure' corrispondente.
ja: 'End Structure' の前には、対応する 'Structure' を指定しなければなりません。
ko: 'End Structure'는 짝이 되는 'Structure' 뒤에 와야 합니다.
pl: 'Instrukcja End Structure musi być poprzedzona odpowiadającą jej instrukcją Structure.
pt_br: 'End Structure' deve ser precedido por 'Structure' correspondente.
ru: 'Оператору "End Structure" должен предшествовать соответствующий оператор "Structure".
tr: 'End Structure' öncesinde eşleşen bir 'Structure' olmalıdır.
zh_hans: '"End Structure" 前面必须是匹配的 "Structure"。
zh_hant: 'End Structure' 之前必須搭配相對應的 'Structure'。

# ERR_EndModuleNoModule
source: 'End Module' must be preceded by a matching 'Module'.
cs: 'Příkazu End Module musí předcházet párový příkaz Module.
de: '"End Module" muss ein entsprechendes "Module" voranstehen.
es: 'End Module' debe ir precedida de la instrucción 'Module' correspondiente.
fr: 'End Module' doit être précédé d'un 'Module' correspondant.
it: 'End Module' deve essere preceduto da un 'Module' corrispondente.
ja: 'End Module' の前には、対応する 'Module' を指定しなければなりません。
ko: 'End Module'은 짝이 되는 'Module' 뒤에 와야 합니다.
pl: 'Instrukcja End Module musi być poprzedzona odpowiadającą jej instrukcją Module.
pt_br: 'End Module' deve ser precedido por 'Module' correspondente.
ru: 'Оператору "End Module" должен предшествовать соответствующий оператор "Module".
tr: 'End Module' öncesinde eşleşen bir 'Module' olmalıdır.
zh_hans: '"End Module" 前面必须是匹配的 "Module"。
zh_hant: 'End Module' 之前必須搭配相對應的 'Module'。

# ERR_EndNamespaceNoNamespace
source: 'End Namespace' must be preceded by a matching 'Namespace'.
cs: 'Příkazu End Namespace musí předcházet párový příkaz Namespace.
de: '"End Namespace" muss ein entsprechendes "Namespace" voranstehen.
es: 'End Namespace' debe ir precedida de la instrucción 'Namespace' correspondiente.
fr: 'End Namespace' doit être précédé d'un 'Namespace' correspondant.
it: 'End Namespace' deve essere preceduto da un 'Namespace' corrispondente.
ja: 'End Namespace' の前には、対応する 'Namespace' を指定しなければなりません。
ko: 'End Namespace'는 짝이 되는 'Namespace' 뒤에 와야 합니다.
pl: 'Instrukcja End Namespace musi być poprzedzona odpowiadającą jej instrukcją Namespace.
pt_br: 'End Namespace' deve ser precedido por 'Namespace' correspondente.
ru: 'Оператору "End Namespace" должен предшествовать соответствующий оператор "Namespace".
tr: 'End Namespace' öncesinde eşleşen bir 'Namespace' olmalıdır.
zh_hans: '"End Namespace" 前面必须是匹配的 "Namespace"。
zh_hant: 'End Namespace' 之前必須搭配相對應的 'Namespace'。

# ERR_ExpectedEndStructure
source: 'Structure' statement must end with a matching 'End Structure'.
cs: 'Příkaz Structure musí být ukončený párovým příkazem End Structure.
de: '"Structure" muss mit einem entsprechenden "End Structure" abgeschlossen werden.
es: 'La instrucción 'Structure' debe terminar con la instrucción 'End Structure' correspondiente.
fr: 'L'instruction 'Structure' doit se terminer par un 'End Structure' correspondant.
it: 'L'istruzione 'Structure' deve terminare con un elemento 'End Structure' corrispondente.
ja: 'Structure' ステートメントの終わりには、対応する 'End Structure' を指定しなければなりません。
ko: 'Structure' 문은 짝이 되는 'End Structure'로 끝나야 합니다.
pl: 'Instrukcja Structure musi być zakończona odpowiadającą jej instrukcją End Structure.
pt_br: 'A instrução 'Structure' deve terminar com um 'End Structure' correspondente.
ru: 'Оператор "Structure" должен заканчиваться соответствующим оператором "End Structure".
tr: 'Structure' deyimi eşleşen bir 'End Structure' ile bitmelidir.
zh_hans: '“Structure”语句必须以匹配的“End Structure”结束。
zh_hant: 'Structure' 陳述式之後必須搭配相對應的 'End Structure'。

# ERR_ExpectedEndModule
source: 'Module' statement must end with a matching 'End Module'.
cs: 'Příkaz Module musí být ukončený párovým příkazem End Module.
de: '"Module" muss mit einem entsprechenden "End Module" abgeschlossen werden.
es: 'La instrucción 'Module' debe terminar con la instrucción 'End Module' correspondiente.
fr: 'L'instruction 'Module' doit se terminer par un 'End Module' correspondant.
it: 'L'istruzione 'Module' deve terminare con un elemento 'End Module' corrispondente.
ja: 'Module' ステートメントの終わりには、対応する 'End Module' を指定しなければなりません。
ko: 'Module' 문은 짝이 되는 'End Module'로 끝나야 합니다.
pl: 'Instrukcja Module musi być zakończona odpowiadającą jej instrukcją End Module.
pt_br: 'A instrução 'Module' deve terminar com um 'End Module' correspondente.
ru: 'Оператор "Module" должен заканчиваться соответствующим оператором "End Module".
tr: 'Module' deyimi eşleşen bir 'End Module' ile bitmelidir.
zh_hans: '“Module”语句必须以匹配的“End Module”结束。
zh_hant: 'Module' 陳述式之後必須搭配相對應的 'End Module'。

# ERR_ExpectedEndNamespace
source: 'Namespace' statement must end with a matching 'End Namespace'.
cs: 'Příkaz Namespace musí být ukončený párovým příkazem End Namespace.
de: '"Namespace" muss mit einem entsprechenden "End Namespace" abgeschlossen werden.
es: 'La instrucción 'Namespace' debe terminar con la instrucción 'End Namespace' correspondiente.
fr: 'L'instruction 'Namespace' doit se terminer par un 'End Namespace' correspondant.
it: 'L'istruzione 'Namespace' deve terminare con un elemento 'End Namespace' corrispondente.
ja: 'Namespace' ステートメントの終わりには、対応する 'End Namespace' を指定しなければなりません。
ko: 'Namespace' 문은 짝이 되는 'End Namespace'로 끝나야 합니다.
pl: 'Instrukcja Namespace musi być zakończona odpowiadającą jej instrukcją End Namespace.
pt_br: 'A instrução 'Namespace' deve terminar com um 'End Namespace' correspondente.
ru: 'Оператор "Namespace" должен заканчиваться соответствующим оператором "End Namespace".
tr: 'Namespace' deyimi eşleşen bir 'End Namespace' ile bitmelidir.
zh_hans: '“Namespace”语句必须以匹配的“End Namespace”结束。
zh_hant: 'Namespace' 陳述式之後必須搭配相對應的 'End Namespace'。

# ERR_OptionStmtWrongOrder
source: 'Option' statements must precede any declarations or 'Imports' statements.
cs: 'Příkazy Option musí předcházet před všemi deklaracemi a příkazy Imports.
de: 'Option-Anweisungen müssen vor allen Deklarationen oder Imports-Anweisungen stehen.
es: 'Las instrucciones 'Option' deben preceder a las declaraciones o instrucciones 'Imports'.
fr: 'Toutes les déclarations et instructions 'Imports' doivent être précédées d'instructions 'Option'.
it: 'Le istruzioni 'Option' devono precedere tutte le dichiarazioni o le istruzioni 'Imports'.
ja: 'Option' ステートメントは、宣言や 'Imports' ステートメントの前に記述しなければなりません。
ko: 'Option' 문은 모든 선언 또는 'Imports' 문 앞에 와야 합니다.
pl: 'Instrukcje Option muszą występować przed wszelkimi deklaracjami i instrukcjami Imports.
pt_br: 'Instruções 'Option' devem preceder qualquer declaração ou instrução 'Imports'.
ru: 'Оператор "Option" должен находиться перед любыми объявлениями или операторами "Imports".
tr: 'Option' deyimleri tüm bildirimlerden ve 'Imports' deyimlerinden önce olmalıdır.
zh_hans: '"Option" 语句必须位于任何声明或 "Imports" 语句之前。
zh_hant: 'Option' 陳述式必須在所有的宣告或 'Imports' 陳述式之前。

# ERR_StructCantInherit
source: Structures cannot have 'Inherits' statements.
cs: Příkazy Inherits nejde použít ve strukturách.
de: Strukturen können keine Inherits-Anweisungen verwenden.
es: Las estructuras no pueden tener instrucciones 'Inherits'.
fr: Les structures ne peuvent pas utiliser d'instructions 'Inherits'.
it: Le strutture non possono contenere istruzioni 'Inherits'.
ja: 構造体に 'Inherits' ステートメントを指定することはできません。
ko: 구조체에는 'Inherits' 문을 사용할 수 없습니다.
pl: Struktury nie mogą mieć instrukcji Inherits.
pt_br: Estruturas não podem ter instruções 'Inherits'.
ru: Структуры не могут содержать операторов "Inherits".
tr: Yapılar 'Inherits' deyimleri içeremez.
zh_hans: 结构不能有 "Inherits" 语句。
zh_hant: 結構不可出現 'Inherits' 陳述式。
