Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_TypeCharOnSub
source: Type character cannot be used in a 'Sub' declaration because a 'Sub' doesn't return a value.
cs: Znak typu nejde použít v deklaraci procedury Sub, protože procedura Sub nevrací hodnotu.
de: Typzeichen können nicht in einer Sub-Deklaration verwendet werden, da eine "Sub" keinen Wert zurückgibt.
es: El carácter de tipo no se puede usar en una declaración 'Sub' porque 'Sub' no devuelve un valor.
fr: Un caractère de type ne peut pas être utilisé dans une déclaration 'Sub', car un 'Sub' ne retourne pas de valeur.
it: Non è possibile usare un carattere tipo in una dichiarazione 'Sub' perché 'Sub' non restituisce alcun valore.
ja: Sub' は値を返さないため、'Sub' 宣言で型文字を使用することはできません。
ko: Sub'는 값을 반환하지 않으므로 'Sub' 선언에 형식 문자를 사용할 수 없습니다.
pl: Nie można użyć znaku typu w deklaracji Sub, ponieważ procedura Sub nie zwraca wartości.
pt_br: O caractere de tipo não pode ser usado em uma declaração 'Sub' porque 'Sub' não retorna um valor.
ru: Символ типа не может использоваться в объявлении "Sub", так как "Sub" не возвращает значение.
tr: Sub' bildirimi değer döndürmediğinden, tür karakteri 'Sub' bildiriminde kullanılamaz.
zh_hans: "Sub" 不返回值，因此在 "Sub" 声明中不能使用类型字符。
zh_hant: 由於 'Sub' 不會傳回值，類型字元不可以在 'Sub' 宣告中使用。

# ERR_OverloadWithDefault2
source: '{0}' and '{1}' cannot overload each other because they differ only by the default values of optional parameters.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom výchozími hodnotami nepovinných parametrů.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sich nur die Standardwerte der optionalen Parameter unterscheiden.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro porque solo se diferencian en los valores predeterminados de los parámetros opcionales.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seules les valeurs par défaut des paramètres optionnels les différencient.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per i valori predefiniti dei parametri facoltativi.
ja: '{0}' と '{1}' では、省略可能なパラメーターの既定値のみが異なるため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 선택적 매개 변수의 기본값만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie wartościami domyślnymi parametrów opcjonalnych.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque diferem somente pelos valores padrões de parâmetros opcionais.
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по значениям по умолчанию необязательных параметров.
tr: 'Yalnızca isteğe bağlı parametrelerinin varsayılan değerleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}”和“{1}”的差异仅在于可选参数的默认值，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於選擇性參數的預設值不同而已。

# ERR_MissingSubscript
source: Array subscript expression missing.
cs: Výraz dolního indexu pole se nenašel.
de: Fehlender Arraysubscriptausdruck
es: Falta la expresión de subíndice de matriz.
fr: Expression d'indice de tableau manquante.
it: Manca l'espressione di indice inferiore della matrice.
ja: 配列インデックス式が見つかりません。
ko: 배열 첨자식이 없습니다.
pl: Brak wyrażenia indeksu tablicy.
pt_br: Expressão de subscrito de matriz ausente.
ru: Отсутствует выражение для индексов массива.
tr: Dizi alt indis ifadesi eksik.
zh_hans: 缺少数组下标表达式。
zh_hant: 遺漏陣列註標運算式。

# ERR_OverrideWithDefault2
source: '{0}' cannot override '{1}' because they differ by the default values of optional parameters.
cs: '{0} nemůže přepsat {1}, protože se liší výchozími hodnotami nepovinných parametrů.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch Standardwerte optionaler Parameter unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en los valores predeterminados de los parámetros opcionales.
fr: '{0}' ne peut pas se substituer à '{1}', car seules les valeurs par défaut des paramètres optionnels les différencient.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i valori predefiniti dei parametri facoltativi.
ja: '省略可能なパラメーターの既定値のみが異なるため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '선택적 매개 변수의 기본값이 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się wartościami domyślnymi parametrów opcjonalnych.
pt_br: "{0}" não pode substituir "{1}" porque diferem pelos valores padrões de parâmetros opcionais.
ru: "{0}" не может переопределить "{1}", так как они отличаются по значениям по умолчанию необязательных параметров.
tr: 'İsteğe bağlı parametrelerinin varsayılan değerleri farklı olduğundan '{0}', '{1}' öğesini geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在可选参数的默认值上存在差异。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其選擇性參數的預設值不同。

# ERR_OverrideWithOptional2
source: '{0}' cannot override '{1}' because they differ by optional parameters.
cs: '{0} nemůže přepsat {1}, protože se liší nepovinnými parametry.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch optionale Parameter unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en los parámetros opcionales.
fr: '{0}' ne peut pas se substituer à '{1}', car les paramètres optionnels les différencient.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i parametri facoltativi.
ja: '省略可能なパラメーターのみが異なるため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '선택적 매개 변수가 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się parametrami opcjonalnymi.
pt_br: "{0}" não pode substituir "{1}" porque diferem por parâmetros opcionais.
ru: "{0}" не может переопределить "{1}", так как они отличаются по необязательным параметрам.
tr: 'İsteğe bağlı parametreleri farklı olduğundan '{0}', '{1}' öğesini geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在可选参数上存在差异。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其選擇性參數不同。

# ERR_FieldOfValueFieldOfMarshalByRef3
source: Cannot refer to '{0}' because it is a member of the value-typed field '{1}' of class '{2}' which has 'System.MarshalByRefObject' as a base class.
cs: Na člen {0} nejde odkazovat, protože se jedná o člen pole typu hodnota {1} třídy {2}, jehož základní třídou je třída System.MarshalByRefObject.
de: Auf "{0}" kann nicht verwiesen werden, da es ein Member des auf Werttypen basierenden Felds "{1}" der Klasse "{2}" ist, die System.MarshalByRefObject als Basisklasse hat.
es: No se puede hacer referencia a '{0}' porque es un miembro del campo de tipo de valor '{1}' de la clase '{2}', que tiene 'System.MarshalByRefObject' como clase base.
fr: Impossible de faire référence à '{0}', car il est membre du champ de valeurs '{1}' de la classe '{2}', qui a 'System.MarshalByRefObject' comme classe de base.
it: Non è possibile fare riferimento a '{0}' perché è un membro del campo di valori '{1}' della classe '{2}' che ha 'System.MarshalByRefObject' come classe di base.
ja: '{0}' は、'System.MarshalByRefObject' を基本クラスとして持つクラス '{2}' の値付きフィールド '{1}' のメンバーであるため、参照できません。
ko: '{0}'은(는) 'System.MarshalByRefObject'를 기본 클래스로 사용하는 '{2}' 클래스의 값 형식 필드 '{1}'의 멤버이므로 참조할 수 없습니다.
pl: Nie można odwołać się do elementu „{0}”, ponieważ jest to element członkowski pola „{1}” o typie wartości klasy „{2}”, której klasą bazową jest „System.MarshalByRefObject”.
pt_br: Não é possível referenciar "{0}" porque ele é um membro do campo com tipo de valor "{1}" da classe "{2}" que tem "System. MarshalByRefObject" como uma classe base.
ru: Невозможно обратиться к "{0}", так как он является членом поля типа значения "{1}" класса "{2}", базовым классом которого является "System.MarshalByRefObject".
tr: Temel sınıfı 'System.MarshalByRefObject' olan '{2}' sınıfında bulunan '{1}' değer türündeki alanın bir üyesi olduğundan, '{0}' öğesine başvurulamaz.
zh_hans: “{0}”，是使用“System.MarshalByRefObject”作为基类的类“{2}”的值类型字段“{1}”的成员，无法引用。
zh_hant: 無法參考 '{0}'，因為其為類別 '{2}' 之實值類型欄位 '{1}' 的成員，其基底類別為 'System.MarshalByRefObject'。

# ERR_TypeMismatch2
source: Value of type '{0}' cannot be converted to '{1}'.
cs: Hodnotu typu {0} nejde převést na {1}.
de: Der Wert vom Typ "{0}" kann nicht in "{1}" konvertiert werden.
es: El valor de tipo '{0}' no se puede convertir en '{1}'.
fr: Impossible de convertir une valeur de type '{0}' en '{1}'.
it: Non è possibile convertire il valore di tipo '{0}' in '{1}'.
ja: 型 '{0}' の値を '{1}' に変換できません。
ko: '{0}' 형식의 변수는 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości typu „{0}” na „{1}”.
pt_br: Valor de tipo "{0}" não pode ser convertido em "{1}".
ru: Значение типа "{0}" невозможно преобразовать в "{1}".
tr: '{0}' türündeki değer '{1}' olarak dönüştürülemez.
zh_hans: 类型“{0}”的值无法转换为“{1}”。
zh_hant: 類型 '{0}' 的值無法轉換成 '{1}'。

# ERR_CaseAfterCaseElse
source: 'Case' cannot follow a 'Case Else' in the same 'Select' statement.
cs: 'Klíčové slovo Case nemůže následovat za klíčovým slovem Case Else v rámci téhož příkazu Select.
de: '"Case" kann nicht auf "Case Else" in derselben Select-Anweisung folgen.
es: 'Case' no puede seguir a 'Case Else' en la misma instrucción 'Select'.
fr: 'Case' ne peut pas suivre 'Case Else' dans la même instruction 'Select'.
it: 'Case' non può seguire 'Case Else' nella stessa istruzione 'Select'.
ja: 'Case' を、同一の 'Select' ステートメント内で 'Case Else' の後に置くことはできません。
ko: 'Case'는 같은 'Select'에서 'Case Else' 뒤에 올 수 없습니다.
pl: 'Instrukcja Case nie może wystąpić po instrukcji Case Else w tej samej instrukcji Select.
pt_br: 'Case' não pode seguir um 'Case Else' na mesma instrução 'Select'.
ru: 'В операторе "Select" блок "Case" не может задаваться после "Case Else".
tr: 'Aynı 'Select' deyiminde 'Case Else' öğesinin ardından 'Case' gelemez.
zh_hans: '在同一“Select”语句中，“Case”不能位于“Case Else”之后。
zh_hant: '在相同的 'Select' 陳述式中，'Case' 不可接在 'Case Else' 之後。

# ERR_ConvertArrayMismatch4
source: Value of type '{0}' cannot be converted to '{1}' because '{2}' is not derived from '{3}'.
cs: Hodnotu typu {0} nejde převést na typ {1}, protože třída {2} není odvozená od třídy {3}.
de: Der Wert des Typs "{0}" kann nicht in "{1}" konvertiert werden, da "{2}" nicht von "{3}" abgeleitet ist.
es: El valor de tipo '{0}' no se puede convertir en '{1}' porque '{2}' no se deriva de '{3}'.
fr: Impossible de convertir une valeur de type '{0}' en '{1}', car '{2}' n'est pas dérivé de '{3}'.
it: Non è possibile convertire il valore di tipo '{0}' in '{1}' perché '{2}' non è derivato da '{3}'.
ja: '{2}' は '{3}' から派生していないため、型 '{0}' の値を '{1}' に変換できません。
ko: '{2}'이(가) '{3}'에서 파생되지 않으므로 '{0}' 형식의 값을 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości typu „{0}” na „{1}”, ponieważ element „{2}” nie pochodzi od elementu „{3}”.
pt_br: Valor de tipo "{0}" não pode ser convertido em "{1}" porque "{2}" não é derivado de "{3}".
ru: Значение типа "{0}" невозможно преобразовать в "{1}", поскольку "{2}" не является производным от "{3}".
tr: '{2}' '{3}' türünden türetilmediğinden, '{0}' türünün değeri '{1}' olarak dönüştürülemez.
zh_hans: 类型“{0}”的值无法转换为“{1}”，因为“{2}”不是从“{3}”派生的。
zh_hant: 類型 '{0}' 的值無法轉換成 '{1}'，因為 '{2}' 並非衍生自 '{3}'。

# ERR_ConvertObjectArrayMismatch3
source: Value of type '{0}' cannot be converted to '{1}' because '{2}' is not a reference type.
cs: Hodnotu typu {0} nejde převést na typ {1}, protože {2} není typ odkazu.
de: Der Wert des Typs "{0}" kann nicht in "{1}" konvertiert werden, da "{2}" kein Referenztyp ist.
es: El valor de tipo '{0}' no se puede convertir en '{1}' porque '{2}' no es un tipo de referencia.
fr: Impossible de convertir une valeur de type '{0}' en '{1}', car '{2}' n'est pas un type référence.
it: Non è possibile convertire il valore di tipo {0} in {1} perché '{2}' non è un tipo riferimento.
ja: '{2}' が参照型でないため、'{0}' 型の値を '{1}' に変換できません。
ko: '{2}'이(가) 참조 형식이 아니므로 '{0}' 형식의 값을 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości typu „{0}” na „{1}”, ponieważ element „{2}” nie jest typem referencyjnym.
pt_br: Valor de tipo "{0}" não pode ser convertido em "{1}" porque "{2}" não é um tipo de referência.
ru: Значение типа "{0}" невозможно преобразовать в "{1}", поскольку "{2}" не является ссылочным типом.
tr: '{2}' bir başvuru türü olmadığından '{0}' türünün değeri '{1}' olarak dönüştürülemez.
zh_hans: 类型“{0}”的值无法转换为“{1}”，因为“{2}”不是引用类型。
zh_hant: 類型 '{0}' 的值無法轉換成 '{1}'，因為 '{2}' 不是參考類型。

# ERR_ForLoopType1
source: 'For' loop control variable cannot be of type '{0}' because the type does not support the required operators.
cs: 'Řídicí proměnná cyklu For nemůže být typu {0}, protože tento typ nepodporuje potřebné operátory.
de: 'Die For-Schleifensteuervariable darf nicht vom Typ "{0}" sein, da der Typ die erforderlichen Operatoren nicht unterstützt.
es: 'La variable de control del bucle 'For' no puede ser de tipo '{0}' porque el tipo no admite los operadores requeridos
fr: 'La variable de contrôle de boucle 'For' ne peut pas être de type '{0}', car le type ne prend pas en charge les opérateurs requis.
it: 'Il tipo della variabile di controllo ciclo 'For' non può essere '{0}' perché non supporta gli operatori richiesti.
ja: '{0}' 型は必要な演算子をサポートしていないため、'For' ループ制御変数には使えません。
ko: 'For' 루프 제어 변수는 '{0}' 형식일 수 없습니다. 이 형식은 필요한 연산자를 지원하지 않습니다.
pl: 'Zmienna sterująca pętli „For” nie może być zmienną typu „{0}”, ponieważ ten typ nie obsługuje wymaganych operatorów.
pt_br: 'Variável de controle de loop "For" não pode ser do tipo "{0}" porque o tipo não suporta os operadores necessários.
ru: 'Управляющая переменная цикла "For" не может быть типа "{0}", так как этот тип не поддерживают требуемые операторы.
tr: 'For' döngü denetim değişkeni '{0}' türünde olamaz çünkü bu tür gereken işleçleri desteklemiyor.
zh_hans: '“For”循环控制变量的类型不能是“{0}”，因为该类型不支持所需的运算符。
zh_hant: 'For' 迴圈控制變數不可為類型 '{0}'，因為此類型不支援所需的運算子。

# ERR_OverloadWithByref2
source: '{0}' and '{1}' cannot overload each other because they differ only by parameters declared 'ByRef' or 'ByVal'.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom parametry deklarovanými jako ByRef nebo ByVal.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sie sich nur durch Parameter unterscheiden, die als "ByRef" oder "ByVal" deklariert sind.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro porque solo se diferencian en parámetros declarados como 'ByRef' o 'ByVal'.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seuls les paramètres déclarés 'ByRef' ou 'ByVal' les différencient.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per i parametri dichiarati come 'ByRef' o 'ByVal'.
ja: '{0}' と '{1}' では、パラメーターが 'ByRef' と 'ByVal' のどちらに設定されているかのみが異なるため、お互いにオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 'ByRef' 또는 'ByVal'로 선언된 매개 변수만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie parametrami zadeklarowanymi jako „ByRef” lub „ByVal”.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque diferem somente por parâmetros declarados "ByRef" ou "ByVal".
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по параметрам, объявленным "ByRef" или "ByVal".
tr: 'Yalnızca 'ByRef' veya 'ByVal' olarak bildirilen parametreleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}”和“{1}”的差异仅在于声明为“ByRef”或“ByVal”的参数，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於宣告為 'ByRef' 或 'ByVal' 的參數不同而已。

# ERR_InheritsFromNonInterface
source: Interface can inherit only from another interface.
cs: Rozhraní může dědit jenom od jiného rozhraní.
de: Eine Schnittstelle kann nur von einer anderen Schnittstelle erben.
es: Una interfaz solo puede heredarse de otra interfaz.
fr: Une interface ne peut hériter que d'une autre interface.
it: L'interfaccia può ereditare solo da un'altra interfaccia.
ja: インターフェイスは、別のインターフェイスからのみ継承できます。
ko: 인터페이스는 다른 인터페이스에서만 상속할 수 있습니다.
pl: Interfejs może dziedziczyć tylko po innym interfejsie.
pt_br: Interface só pode herdar de outra interface.
ru: Интерфейс может наследовать только от другого интерфейса.
tr: Arabirim yalnızca başka bir arabirimden devralabilir.
zh_hans: 接口只能从其他接口继承。
zh_hant: 介面只可以繼承自另一個介面。

# ERR_BadInterfaceOrderOnInherits
source: 'Inherits' statements must precede all declarations in an interface.
cs: 'Příkazy Inherits musí předcházet před všemi deklaracemi v rozhraní.
de: 'Inherits-Anweisungen müssen vor allen Deklarationen in einer Schnittstelle stehen.
es: 'Las instrucciones 'Inherits' deben preceder a todas las declaraciones de una interfaz.
fr: 'Les instructions 'Inherits' doivent précéder toutes les déclarations dans une interface.
it: 'Le istruzioni 'Inherits' devono precedere tutte le dichiarazioni in un'interfaccia.
ja: 'Inherits' ステートメントは、インターフェイス内のすべての宣言の前に記述しなければなりません。
ko: 'Inherits' 문은 인터페이스의 모든 선언 앞에 와야 합니다.
pl: 'Instrukcje „Inherits” muszą znajdować się przed wszystkimi deklaracjami w interfejsie.
pt_br: 'Instruções 'Inherits' devem preceder todas as declarações em uma interface.
ru: 'Операторы "Inherits" должны предшествовать всем объявлениям в интерфейсе.
tr: 'Inherits' deyimleri arabirimdeki tüm bildirimlerden önce gelmelidir.
zh_hans: '“Inherits”语句必须位于接口中的所有声明之前。
zh_hant: 'Inherits' 陳述式必須位於介面中的所有宣告之前。

# ERR_DuplicateDefaultProps1
source: 'Default' can be applied to only one property name in a {0}.
cs: 'Klíčové slovo Default jde použít jenom pro jeden název vlastnosti v rámci typu {0}.
de: '"Default" kann nur auf einen Eigenschaftennamen in {0} angewendet werden.
es: 'Default' solo se puede aplicar a un nombre de propiedad en un {0}.
fr: 'Default' ne peut être appliqué qu'à un seul nom de propriété dans un {0}.
it: 'Default' può essere applicato solo a un nome di proprietà in un elemento {0}.
ja: 'Default' は、{0} 内で 1 つのプロパティ名にのみ適用できます。
ko: '{0}에서 'Default'를 하나의 속성 이름에만 적용할 수 있습니다.
pl: 'Element „Default” można stosować tylko do jednej nazwy właściwości w elemencie {0}.
pt_br: "Default" pode ser aplicado a somente um nome de propriedade em um {0}.
ru: '"Default" может указываться только для одного имени свойства в {0}.
tr: {0} içinde tek bir özellik adına 'Default' uygulanabilir.
zh_hans: '“Default”只可应用于“{0}”中的一个属性名称。
zh_hant: 'Default' 只可以套用至 {0} 中的一個屬性名稱。

# ERR_DefaultMissingFromProperty2
source: '{0}' and '{1}' cannot overload each other because only one is declared 'Default'.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože jenom v jedné deklaraci je uvedené klíčové slovo Default.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da nur eine als "Default" deklariert ist.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro debido a que solo uno está marcado como 'Default'.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seul l'un d'entre eux est déclaré 'Default'.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché solo uno è dichiarato come 'Default'.
ja: '{0}' と '{1}' では、一方のみが 'Default' に宣言されているため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}' 중 하나만 'Default'로 선언되었으므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ tylko jeden z nich jest zadeklarowany jako „Default”.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque somente um está declarado como "Default".
ru: "{0}" и "{1}" не могут перегружать друг друга, т. к. только один из них объявлен как "Default".
tr: 'Yalnızca biri 'Default' olarak bildirildiğinden, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}”和“{1}”中只有一个声明为“Default”，因此它们无法相互重载。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為只有一個宣告為 'Default'。

# ERR_OverridingPropertyKind2
source: '{0}' cannot override '{1}' because they differ by 'ReadOnly' or 'WriteOnly'.
cs: '{0} nemůže přepsat {1}, protože se liší příznakem ReadOnly nebo WriteOnly.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch "ReadOnly" oder "WriteOnly" unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en 'ReadOnly' o 'WriteOnly'.
fr: '{0}' ne peut pas se substituer à '{1}', car 'ReadOnly' ou 'WriteOnly' les différencie.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per 'ReadOnly' o 'WriteOnly'.
ja: '{0}' と '{1}' は、'ReadOnly' であるか、または 'WriteOnly' であるかのみが異なるため、オーバーライドすることはできません。
ko: 'ReadOnly' 또는 'WriteOnly'만 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się ustawieniem „ReadOnly” lub „WriteOnly”.
pt_br: "{0}" não pode substituir "{1}" porque diferem por "ReadOnly" ou "WriteOnly".
ru: "{0}" не может переопределить "{1}", так как они отличаются по типу "ReadOnly" или "WriteOnly".
tr: 'ReadOnly' veya 'WriteOnly' özellikleri farklı olduğundan '{0}', '{1}' öğesini geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在是“ReadOnly”还是“WriteOnly”上不同。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其出現 'ReadOnly' 或 'WriteOnly' 的差異。

# ERR_NewInInterface
source: 'Sub New' cannot be declared in an interface.
cs: 'Procedura Sub New nemůže být deklarovaná v rozhraní.
de: '"Sub New" kann nicht in einer Schnittstelle deklariert werden.
es: 'Sub New' no se puede declarar en una interfaz.
fr: 'Sub New' ne peut pas être déclaré dans une interface.
it: 'Sub New' non può essere dichiarato in un'interfaccia.
ja: 'Sub New' をインターフェイスで宣言することはできません。
ko: 'Sub New'는 인터페이스에 선언할 수 없습니다.
pl: 'Nie można zadeklarować elementu Sub New w interfejsie.
pt_br: 'Sub New' não pode ser declarado em uma interface.
ru: '"Sub New" нельзя объявлять в интерфейсе.
tr: 'Sub New' bir arabirimde bildirilemez.
zh_hans: '"Sub New" 不能在接口中声明。
zh_hant: '無法在介面中宣告 'Sub New'。

# ERR_BadFlagsOnNew1
source: 'Sub New' cannot be declared '{0}'.
cs: 'Pro proceduru Sub New nejde použít deklaraci {0}.
de: '"Sub New" kann nicht als "{0}" deklariert werden.
es: 'Sub New' no se puede declarar como '{0}'.
fr: 'Sub New' ne peut pas être déclaré '{0}'.
it: 'Sub New' non può essere dichiarato come '{0}'.
ja: 'Sub New' を '{0}' として宣言することはできません。
ko: 'Sub New'는 '{0}'(으)로 선언할 수 없습니다.
pl: 'Nie można zadeklarować elementu „Sub New” jako „{0}”.
pt_br: "Sub New" não pode ser declarados "{0}".
ru: '"Sub New" нельзя объявить как "{0}".
tr: 'Sub New' '{0}' olarak bildirilemez.
zh_hans: '“Sub New”不能声明为“{0}”。
zh_hant: 'Sub New' 不可宣告為 '{0}'。

# ERR_OverloadingPropertyKind2
source: '{0}' and '{1}' cannot overload each other because they differ only by 'ReadOnly' or 'WriteOnly'.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom příznakem ReadOnly nebo WriteOnly.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sie sich nur durch "ReadOnly" oder "WriteOnly" unterscheiden.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro debido a que solo se diferencian en 'ReadOnly' o 'WriteOnly'.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seul 'ReadOnly' ou 'WriteOnly' les différencie.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per 'ReadOnly' o 'WriteOnly'.
ja: '{0}' と '{1}' では、'ReadOnly' であるか、または 'WriteOnly' であるかのみが異なるため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 'ReadOnly' 또는 'WriteOnly'만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie ustawieniem „ReadOnly” lub „WriteOnly”.
pt_br: "{0}" e "{1}" não pode sobrecarregar um ao outro porque diferem apenas por "ReadOnly" ou "WriteOnly".
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по "ReadOnly" или "WriteOnly".
tr: 'Yalnızca 'ReadOnly' veya 'WriteOnly' özellikleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}” 和“{1}”的差异仅在于“ReadOnly”和“WriteOnly”，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於 'ReadOnly' 或 'WriteOnly' 不同而已。
