Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_PartialTypeTypeParamNameMismatch3
source: Type parameter name '{0}' does not match the name '{1}' of the corresponding type parameter defined on one of the other partial types of '{2}'.
cs: Název parametru typu {0} neodpovídá názvu {1} odpovídajícího parametru typu definovaného u jednoho z ostatních částečných typů {2}.
de: Der Typparametername "{0}" stimmt nicht mit dem Namen "{1}" des entsprechenden Typparameters überein, der für einen der anderen partiellen Typen von "{2}" definiert wurde.
es: El nombre de parámetro de tipo '{0}' no coincide con el nombre '{1}' del parámetro de tipo correspondiente definido en uno de los otros tipos parciales de '{2}'.
fr: Le nom du paramètre de type '{0}' ne correspond pas au nom '{1}' du paramètre de type correspondant défini pour l'un des autres types partiels de '{2}'.
it: Il nome '{0}' del parametro di tipo non corrisponde al nome '{1}' del corrispondente parametro di tipo definito in uno degli altri tipi parziali di '{2}'.
ja: 型パラメーター名 '{0}' は、'{2}' のその他の partial 型の 1 つに対して定義されている、対応する型パラメーターの名前 '{1}' と一致しません。
ko: '{0}' 형식 매개 변수 이름이 '{2}'의 다른 부분 형식(Partial Type) 중 하나에 정의된 해당 '{1}' 형식 매개 변수의 이름과 일치하지 않습니다.
pl: Nazwa parametru typu „{0}” nie jest zgodna z nazwą „{1}” odpowiedniego parametru typu zdefiniowanego w jednym z innych typów częściowych elementu „{2}”.
pt_br: Nome do parâmetro de tipo "{0}" não corresponde ao nome "{1}" do parâmetro de tipo correspondente definido em um dos outros tipos parciais de "{2}".
ru: Имя параметра типа "{0}" не соответствует имени "{1}" параметра соответствующего типа, определенного на одном из других разделяемых типов "{2}".
tr: '{0}' tür parametre adı, '{2}' öğesinin diğer kısmi türlerinden birinde tanımlanan ilgili tür parametresinin '{1}' adıyla eşleşmiyor.
zh_hans: 类型参数名“{0}”与在“{2}”的某个其他分部类型上定义的相应类型参数的名称“{1}”不匹配。
zh_hant: 對於 '{2}' 的某個其他部分類型所定義之對應類型參數的 '{1}' 名稱而言，類型參數名稱 '{0}' 不相符。

# ERR_PartialTypeConstraintMismatch1
source: Constraints for this type parameter do not match the constraints on the corresponding type parameter defined on one of the other partial types of '{0}'.
cs: Omezení pro tento parametr neodpovídá omezením u odpovídajícího parametru typu definovaného u jednoho z ostatních částečných typů {0}.
de: Die Einschränkungen für diesen Typparameter stimmen nicht mit den Einschränkungen für den entsprechenden Typparameter überein, der für einen der anderen partiellen Typen von "{0}" definiert wurde.
es: Las restricciones de este parámetro de tipo no coinciden con las restricciones del parámetro de tipo correspondiente definido en uno de los otros tipos parciales de '{0}'.
fr: Les contraintes pour ce paramètre de type ne correspondent pas aux contraintes du paramètre de type correspondant défini pour l'un des autres types partiels de '{0}'.
it: I vincoli per questo parametro di tipo non corrispondono ai vincoli nel corrispondente parametro di tipo definito in uno degli altri tipi parziali di '{0}'.
ja: この型パラメーターの制約は、'{0}' のその他の partial 型の 1 つに対して定義されている、対応する型パラメーターの制約と一致しません。
ko: 이 형식 매개 변수에 대한 제약 조건이 '{0}'의 다른 부분 형식(Partial Type) 중 하나에 정의된 해당 형식 매개 변수의 제약 조건과 일치하지 않습니다.
pl: Ograniczenia dla tego parametru typu nie są zgodne z ograniczeniami w odpowiednim parametrze typu zdefiniowanym w jednym z innych typów częściowych elementu „{0}”.
pt_br: As restrições para este parâmetro de tipo não coincidem as restrições no parâmetro de tipo correspondente definido em um dos outros tipos parciais de "{0}".
ru: Ограничения для этого параметра типа не соответствуют ограничениям для соответствующего типа параметра, определенного на одном из других разделяемых типов "{0}".
tr: Bu tür parametresindeki kısıtlamalar '{0}' öğesinin diğer kısmi türlerinden birinde tanımlanan ilgili tür parametresindeki kısıtlamalarla eşleşmiyor.
zh_hans: 此类型参数的约束与在“{0}”的某个其他分部类型上定义的相应类型参数的约束不匹配。
zh_hant: 對於 '{0}' 的某個其他部分類型所定義之相對應類型參數的條件約束而言，此類型參數的條件約束不相符。

# ERR_LateBoundOverloadInterfaceCall1
source: Late bound overload resolution cannot be applied to '{0}' because the accessing instance is an interface type.
cs: Rozpoznání přetížené procedury s pozdní vazbou nejde použít pro {0}, protože přistupující instance je typu rozhraní.
de: Die spät gebundene Überladungsauflösung kann nicht auf "{0}" angewendet werden, da die zugreifende Instanz ein Schnittstellentyp ist.
es: La resolución de sobrecarga enlazada en tiempo de ejecución no se puede aplicar a '{0}' porque la instancia a la que se obtiene acceso es un tipo de interfaz.
fr: La résolution de surcharge à liaison tardive ne peut pas être appliquée à '{0}', car l'instance d'accès est un type interface.
it: Non è possibile applicare la risoluzione dell'overload con associazione tardiva a '{0}' perché l'istanza di accesso è un tipo interfaccia.
ja: アクセスするインスタンスがインターフェイス型であるため、遅延バインドされたオーバーロードの解決は '{0}' に適用されません。
ko: 액세스하는 인스턴스가 인터페이스 형식이라 바인딩 오버로드 확인을 '{0}'에 적용할 수 없습니다.
pl: Ustalanie przeciążenia późnego wiązania nie może zostać zastosowane w elemencie „{0}”, ponieważ wystąpienie uzyskujące dostęp jest typem interfejsu.
pt_br: Resolução de sobrecarga de limite atrasada não pode ser aplicada a "{0}" porque a instância de acesso é um tipo de interface.
ru: Разрешение перегрузки позднего связывания нельзя применить к "{0}", поскольку экземпляр, к которому осуществляется доступ, является типом интерфейса.
tr: Erişen örnek bir arabirim türü olduğundan, '{0}' öğesine geç bağlanan aşırı yük çözümü uygulanamıyor.
zh_hans: 后期绑定重载决策不能应用于“{0}”，因为访问实例是一个接口类型。
zh_hant: 因為進行存取的執行個體為介面類型，所以晚期繫結多載解析無法套用至 '{0}'。

# ERR_RequiredAttributeConstConversion2
source: Conversion from '{0}' to '{1}' cannot occur in a constant expression used as an argument to an attribute.
cs: V konstantním výrazu použitém jako argument pro atribut nemůže dojít k převodu z typu {0} na {1}.
de: Eine Konvertierung von "{0}" in "{1}" kann nicht in einem konstanten Ausdruck durchgeführt werden, der als Argument für ein Attribut verwendet wird.
es: No se puede realizar una conversión de '{0}' a '{1}' en una expresión constante que se usa como argumento de un atributo.
fr: La conversion de '{0}' en '{1}' ne peut pas se produire dans une expression constante utilisée en tant qu'argument d'un attribut.
it: In un'espressione costante usata come argomento di un attributo non può verificarsi la conversione da '{0}' a '{1}'.
ja: 属性に対する引数として使用される定数式において、'{0}' から '{1}' への変換は発生しません。
ko: 특성에 대한 인수로 사용된 상수 식에서는 '{0}'에서 '{1}'(으)로 변환할 수 없습니다.
pl: Konwersja z elementu „{0}” na element „{1}” nie może wystąpić w wyrażeniu stałym używanym jako argument atrybutu.
pt_br: Conversão de "{0}" para "{1}" não pode ocorrer em uma expressão constante usada como um argumento para um atributo.
ru: Преобразование "{0}" в "{1}" не может происходить в константном выражении, используемом в качестве аргумента атрибута.
tr: Bir öznitelik için bağımsız değişken olarak kullanılan sabit ifadede '{0}' - '{1}' dönüşümü yapılamaz.
zh_hans: 在用作属性参数的常量表达式中不能发生从“{0}”到“{1}”的转换。
zh_hant: 用做為屬性的引數之常數運算式中，不可進行從 '{0}' 到 '{1}' 的轉換。

# ERR_AmbiguousOverrides3
source: Member '{0}' that matches this signature cannot be overridden because the class '{1}' contains multiple members with this same name and signature: {2}
cs: Člen {0} odpovídající tomuto podpisu nejde přepsat, protože třída {1} obsahuje víc členů s týmž názvem a podpisem: {2}
de: Member "{0}", der mit dieser Signatur übereinstimmt, kann nicht überschrieben werden, weil die Klasse "{1}" mehrere Member mit diesem Namen und dieser Signatur enthält: {2}
es: No se puede invalidar el miembro '{0}' que coincide con esta firma porque la clase {1} contiene varios miembros que tienen un nombre y una firma iguales a estos: {2}
fr: Le membre '{0}' qui correspond à cette signature ne peut pas être remplacé, car la classe '{1}' contient plusieurs membres avec ce nom et cette signature : {2}
it: Non è possibile eseguire l'override del membro '{0}' corrispondente alla firma perché la classe '{1}' contiene più membri con nome e firma uguali: {2}
ja: クラス '{1}' は同じ名前とシグネチャが指定された複数のメンバーを含むため、このシグネチャに一致するメンバー '{0}' をオーバーライドすることはできません: {2}
ko: '{1}' 클래스에 이름과 시그니처가 같은 여러 멤버가 포함되어 있으므로 이 시그니처와 일치하는 '{0}' 멤버를 재정의할 수 없습니다({2}).
pl: Składowa „{0}” zgodna z sygnaturą nie może zostać przesłoniona, ponieważ klasa „{1}” zawiera wiele składowych o tej samej nazwie i sygnaturze: {2}.
pt_br: Membro "{0}" que corresponde a esta assinatura não pode ser substituída porque a classe "{1}" contém vários membros com este mesmo nome e assinatura: {2}
ru: Член "{0}", соответствующий данной сигнатуре, не может быть переопределен, поскольку класс "{1}" содержит несколько членов с таким же именем и сигнатурой: {2}
tr: '{1}' sınıfı aynı ada ve imzaya sahip birden çok üye içerdiğinden, bu imzayla eşleşen '{0}' üyesi geçersiz kılınamıyor: {2}
zh_hans: 无法重写与此签名匹配的成员“{0}”，因为类“{1}”包含多个具有此相同名称和签名的成员: {2}
zh_hant: 無法覆寫與此簽章相符的成員 '{0}'，因為類別 '{1}' 包含多位具有此相同名稱與簽章的成員: {2}

# ERR_AmbiguousImplements3
source: Member '{0}.{1}' that matches this signature cannot be implemented because the interface '{2}' contains multiple members with this same name and signature: '{3}' '{4}'
cs: Člen {0}.{1} odpovídající tomuto podpisu nejde implementovat, protože rozhraní {2} obsahuje víc členů s týmž názvem a podpisem: {3} {4}
de: Member "{0}.{1}", der mit dieser Signatur übereinstimmt, kann nicht implementiert werden, da die Schnittstelle "{2}" mehrere Member mit diesem Namen und dieser Signatur enthält: "{3}" "{4}"
es: No se puede implementar el miembro '{0}.{1}' que coincide con esta firma porque la interfaz '{2}' contiene varios miembros que tienen un nombre y una firma iguales a estos: '{3}' '{4}'
fr: Le membre '{0}.{1}' qui correspond à cette signature ne peut pas être implémenté, car l'interface '{2}' contient plusieurs membres avec ce nom et cette signature : '{3}' '{4}'
it: Non è possibile implementare il membro '{0}.{1}' corrispondente alla firma perché l'interfaccia '{2}' contiene più membri con nome e firma uguali: '{3}' '{4}'
ja: インターフェイス '{2}' は同じ名前とシグネチャが指定された複数のメンバーを含むため、このシグネチャに一致するメンバー '{0}.{1}' を実装することはできません: '{3}' '{4}'
ko: '{2}' 인터페이스에 이름과 시그니처가 같은 여러 멤버가 포함되어 있으므로 이 시그니처와 일치하는 '{0}.{1}' 멤버를 구현할 수 없습니다. '{3}' '{4}'
pl: Składowa „{0}.{1}” zgodna z tą sygnaturą nie może zostać zaimplementowana, ponieważ interfejs „{2}” zawiera wiele składowych o tej samej nazwie i sygnaturze: „{3}” „{4}”
pt_br: Membro "{0}.{1}" que corresponde a esta assinatura não pode ser implementado porque a interface "{2}" contém vários membros com este mesmo nome e assinatura: "{3}" "{4}"
ru: Член "{0}.{1}", соответствующий данной сигнатуре, не может быть реализован, поскольку интерфейс "{2}" содержит несколько членов с таким же именем и сигнатурой: "{3}" "{4}"
tr: '{2}' arabirimi aynı ada ve imzaya sahip birden çok üye içerdiğinden, bu imzayla eşleşen '{0}.{1}' üyesi uygulanamıyor: '{3}' '{4}'
zh_hans: 无法实现与此签名匹配的成员“{0}.{1}”，因为接口“{2}”包含多个具有此相同名称和签名的成员: '{3}' '{4}'
zh_hant: 無法實作與此簽章相符的成員 '{0}.{1}'，因為介面 '{2}' 包含多位具有此相同名稱與簽章的成員: '{3}' '{4}'

# ERR_AddressOfNotCreatableDelegate1
source: 'AddressOf' expression cannot be converted to '{0}' because type '{0}' is declared 'MustInherit' and cannot be created.
cs: 'Výraz AddressOf nejde převést na typ {0}, protože typ {0} není deklarovaný jako MustInherit a nejde jej vytvořit.
de: 'AddressOf-Ausdruck kann nicht in "{0}" konvertiert werden, da der Typ "{0}" als "MustInherit" deklariert ist und nicht erstellt werden kann.
es: 'La expresión 'AddressOf' no se puede convertir en '{0}' porque el tipo '{0}' se declaró como 'MustInherit' y no se puede crear.
fr: 'Une expression 'AddressOf' ne peut pas être convertie en '{0}', car le type '{0}' est déclaré 'MustInherit' et ne peut pas être créé.
it: 'Non è possibile convertire l'espressione 'AddressOf' in '{0}' perché il tipo '{0}' è dichiarato come 'MustInherit' e non è possibile crearlo.
ja: '型 '{0}' は 'MustInherit' として宣言されていて作成することができないので、'AddressOf' 式を '{0}' に変換することはできません。
ko: '{0}' 형식이 'MustInherit'으로 선언되어 있어 만들 수 없으므로 'AddressOf' 식을 '{0}'(으)로 변환할 수 없습니다.
pl: 'Nie można przekonwertować wyrażenia „AddressOf” na typ „{0}”, ponieważ typ „{0}” został zadeklarowany jako „MustInherit” i nie można go utworzyć.
pt_br: 'Expressão "AddressOf" não pode ser convertido em "{0}" porque o tipo "{0}" é declarado "MustInherit" e não pode ser criado.
ru: 'Выражение "AddressOf" нельзя преобразовать в "{0}", поскольку тип "{0}" объявлен как "MustInherit" и не может быть создан.
tr: '{0}' türü 'MustInherit' olarak bildirildiğinden ve oluşturulamadığından, 'AddressOf' ifadesi '{0}' türüne dönüştürülemez.
zh_hans: '“AddressOf”表达式无法转换为“{0}”，因为类型“{0}”已声明为“MustInherit”，无法创建。
zh_hant: '因為類型 '{0}' 宣告為 'MustInherit' 但卻無法建立，所以 'AddressOf' 運算式無法轉換成 '{0}'。

# ERR_ComClassGenericMethod
source: Generic methods cannot be exposed to COM.
cs: Obecné metody nemůžou být vystaveny objektům modelu COM.
de: Generische Methoden können nicht für COM verfügbar gemacht werden.
es: Los métodos genéricos no se pueden exponer a COM.
fr: Les méthodes génériques ne peuvent pas être exposées à COM.
it: I metodi generici non possono essere esposti a COM.
ja: ジェネリック メソッドは COM に公開できません。
ko: 제네릭 메서드를 COM에 노출할 수 없습니다.
pl: Metod ogólnych nie można ujawniać modelowi COM.
pt_br: Não é possível expor métodos genéricos a COM.
ru: Обобщенные методы не могут быть предоставлены в COM.
tr: Genel yöntemler COM'a sunulamaz.
zh_hans: 泛型方法不能向 COM 公开。
zh_hant: 泛型方法不可以公開至 COM。

# ERR_SyntaxInCastOp
source: Syntax error in cast operator; two arguments separated by comma are required.
cs: Operátor přetypování obsahuje chybu syntaxe. Musí být zadané dva argumenty oddělené čárkou.
de: Syntaxfehler in Umwandlungsoperator; zwei durch Komma getrennte Argumente sind erforderlich.
es: Error de sintaxis en el operador de conversión; se necesitan dos argumentos separados por coma.
fr: Erreur de syntaxe dans l'opérateur de cast ; deux arguments séparés par une virgule sont requis.
it: Errore di sintassi nell'operatore di cast. Sono necessari due argomenti separati da virgola.
ja: キャスト演算子の構文エラーです。コンマで区切られた 2 つの引数が必要です。
ko: 캐스트 연산자에 구문 오류가 있습니다. 쉼표로 구분된 인수 두 개가 필요합니다.
pl: Błąd składni w operatorze rzutowania. Wymagane są dwa argumenty rozdzielone przecinkiem.
pt_br: Erro de sintaxe no operador de conversão; são necessários dois argumentos separados por vírgulas.
ru: Синтаксическая ошибка в операторе приведения; требуются два аргумента, разделенные запятой.
tr: Atama işleneninde söz dizimi hatası; virgülle ayrılmış iki bağımsız değişken gerekiyor.
zh_hans: 强制转换运算符中有语法错误；需要两个用逗号分隔的参数。
zh_hant: 轉型運算子中的語法錯誤; 兩個引數之間必須以逗號分隔。

# ERR_ArrayInitializerForNonConstDim
source: Array initializer cannot be specified for a non constant dimension; use the empty initializer '{}'.
cs: Inicializátor pole nejde zadat pro nekonstantní dimenzi; použijte prázdný inicializátor {}.
de: Der Arrayinitialisierer kann nicht für eine nicht konstante Dimension angegeben werden. Verwenden Sie den leeren Initialisierer "{}".
es: No se puede especificar el inicializador de matriz para una dimensión no constante; use el inicializador vacío '{}'.
fr: Un initialiseur de tableau ne peut pas être spécifié pour une dimension non constante ; utilisez l'initialiseur vide '{}'.
it: Non è possibile specificare l'inizializzatore di matrice per una dimensione non costante. Usare l'inizializzatore vuoto '{}'.
ja: 非定数の次元の配列に初期化子を指定することはできません。空の初期化子 '{}' を使用してください。
ko: 비상수 차원에는 배열 이니셜라이저를 지정할 수 없습니다. 빈 이니셜라이저 '{}'를 사용하세요.
pl: Inicjatora tablicy nie można określić dla niestałego wymiaru; użyj pustego inicjatora „{}”.
pt_br: Não é possível especificar o inicializador de matriz para uma dimensão não constante; use o inicializador vazio '{}'.
ru: Инициализатор массива не может быть задан для переменной размерности; используйте пустой инициализатор "{}".
tr: Sabit olmayan bir boyut için dizi başlatıcı belirtilemez; '{}' boş başlatıcıyı kullanın.
zh_hans: 无法为不定维度指定数组初始值设定项；请使用空初始值设定项“{}”。
zh_hant: 無法指定非常數維度的陣列初始設定式; 請使用空的初始設定式 '{}'。

# ERR_DelegateBindingFailure3
source: No accessible method '{0}' has a signature compatible with delegate '{1}':{2}
cs: Žádná přístupná metoda {0} nemá podpis kompatibilní s delegátem {1}:{2}.
de: Keine zugreifbare {0}-Methode hat eine Signatur, die mit dem Delegaten "{1}" kompatibel ist: {2}
es: Ningún método accesible '{0}' tiene una firma compatible con el delegado '{1}':{2}
fr: Aucune méthode accessible '{0}' n'a de signature compatible avec le délégué '{1}':{2}
it: Nessun metodo accessibile '{0}' ha una firma compatibile con il delegato '{1}':{2}
ja: デリゲート '{1}':{2} と互換性のあるシグネチャを持つアクセス可能なメソッド '{0}' がありません
ko: '{1}':{2} 대리자와 호환되는 시그니처를 포함하는 액세스 가능한 '{0}' 메서드가 없습니다.
pl: Żadna z dostępnych metod „{0}” nie ma sygnatury zgodnej z delegatem „{1}”:{2}.
pt_br: Nenhum método acessível "{0}" tem uma assinatura compatível com o delegado "{1}":{2}
ru: Нет доступного метода "{0}" с сигнатурой, совместимой с делегатом "{1}": {2}
tr: '{1}':{2} temsilcisiyle uyumlu imzaya sahip bir erişilebilir '{0}' yöntemi yok
zh_hans: 没有任何可访问的方法“{0}”具有与委托“{1}”兼容的签名: {2}
zh_hant: 沒有任何可存取的方法 '{0}' 具備與委派 '{1}' 相容的簽章: {2}

# ERR_StructLayoutAttributeNotAllowed
source: Attribute 'StructLayout' cannot be applied to a generic type.
cs: Pro obecný typ nejde použít atribut StructLayout.
de: Das StructLayout-Attribut kann nicht auf einen generischen Typ angewendet werden.
es: No se puede aplicar el atributo 'StructLayout' a un tipo genérico.
fr: L'attribut 'StructLayout' ne peut pas être appliqué à un type générique.
it: Non è possibile applicare l'attributo 'StructLayout' a un tipo generico.
ja: 属性 'StructLayout' はジェネリック型に適用できません。
ko: StructLayout' 특성은 제네릭 형식에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „StructLayout” do typu ogólnego.
pt_br: Não é possível aplicar o atributo 'StructLayout' para um tipo genérico.
ru: Атрибут "StructLayout" нельзя применять к универсальному типу.
tr: StructLayout' özniteliği genel bir türe uygulanamaz.
zh_hans: 特性 "StructLayout" 不能应用于泛型类型。
zh_hant: 屬性 'StructLayout' 不能套用到泛型類型。

# ERR_IterationVariableShadowLocal1
source: Range variable '{0}' hides a variable in an enclosing block or a range variable previously defined in the query expression.
cs: Proměnná rozsahu {0} skrývá proměnnou v nadřazeném bloku nebo proměnnou rozsahu definovanou dříve ve výrazu dotazu.
de: Die Bereichsvariable "{0}" verbirgt eine Variable in einem einschließenden Block oder eine zuvor im Abfrageausdruck definierte Bereichsvariable.
es: La variable de rango '{0}' oculta una variable en un bloque envolvente o una variable de rango definida previamente en la expresión de consulta.
fr: La variable de portée '{0}' masque une variable dans un bloc englobant ou une variable de portée précédemment définie dans l'expression de requête.
it: La variabile di intervallo '{0}' nasconde una variabile in un blocco di inclusione o una variabile di intervallo definita in precedenza nell'espressione di query.
ja: 範囲変数 '{0}' により、それを囲むブロック内の変数、または以前にクエリ式で定義された範囲変数が隠ぺいされます。
ko: '{0}' 범위 변수가 바깥쪽 블록의 변수를 숨기거나 이전에 쿼리 식에 정의한 범위 변수를 숨깁니다.
pl: Zmienna zakresu „{0}” ukrywa zmienną w otaczającym bloku lub zmiennej zakresu wcześniej zdefiniowanej w wyrażeniu zapytania.
pt_br: A variável de intervalo "{0}" oculta uma variável em um bloco delimitador ou uma variável de intervalo definida anteriormente na expressão de consulta.
ru: Переменная диапазона "{0}" скрывает переменную во внешнем блоке или ранее определенную переменную в выражении запроса.
tr: '{0}' aralık değişkeni kapsayan bir blok içinde bir değişkeni gizliyor veya daha önce sorgu ifadesinde aralık değişkeni tanımlandı.
zh_hans: 范围变量“{0}”隐藏封闭块中的某个变量或以前在查询表达式中定义的某个范围变量。
zh_hant: 範圍變數 '{0}' 可隱藏封閉區塊中的變數，或查詢運算式中預先定義的範圍變數。

# ERR_InvalidOptionInfer
source: 'Option Infer' can be followed only by 'On' or 'Off'.
cs: 'Za možností Infer můžou následovat jenom klíčová slova On nebo Off.
de: 'Auf "Option Infer" kann nur "On" oder "Off" folgen.
es: 'Option Infer' solo puede ir seguido de 'On' u 'Off'.
fr: 'Option Infer' ne peut être suivi que par 'On' ou 'Off'.
it: 'Option Infer' può essere seguito solo da 'On' o 'Off'.
ja: 'Option Infer' の後には、'On' または 'Off' のみを指定できます。
ko: 'Option Infer' 뒤에는 'On' 또는 'Off'만 올 수 있습니다.
pl: 'Po instrukcji „Option Infer” może wystąpić jedynie opcja „On” lub „Off”.
pt_br: 'Option Infer' só pode ser seguido por 'On' ou 'Off'.
ru: 'За "Option Infer" может следовать только "On" или "Off".
tr: 'Option Infer' öğesinin ardından yalnızca 'On' veya 'Off' gelebilir.
zh_hans: '"Option Infer" 后面只能跟 "On" 或 "Off"。
zh_hant: 'Option Infer' 之後只能是 'On' 或 'Off'。

# ERR_CircularInference1
source: Type of '{0}' cannot be inferred from an expression containing '{0}'.
cs: Typ {0} nejde odvodit z výrazu obsahujícího {0}.
de: Der Typ "{0}" kann nicht von einem Ausdruck abgeleitet werden, der "{0}" enthält.
es: No se puede inferir el tipo de '{0}' a partir de una expresión que contenga '{0}'.
fr: Le type de '{0}' ne peut pas être déduit à partir d'une expression contenant '{0}'.
it: Non è possibile dedurre il tipo di '{0}' da un'espressione contenente '{0}'.
ja: '{0}' の型を '{0}' を含んでいる式から推論することはできません。
ko: '{0}'이(가) 포함된 식에서 '{0}' 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu elementu „{0}” na podstawie wyrażenia zawierającego element „{0}”.
pt_br: Tipo de "{0}" não pode ser inferido de uma expressão que contém "{0}".
ru: Не удается получить тип "{0}" из выражения, содержащего "{0}".
tr: '{0}' türü '{0}' içeren bir ifadeden çıkarsanamaz.
zh_hans: 无法从包含“{0}”的表达式中推断“{0}”的类型。
zh_hant: 無法從包含 '{0}' 的運算式推斷 '{0}' 的類型。

# ERR_InAccessibleOverridingMethod5
source: '{0}' in class '{1}' cannot override '{2}' in class '{3}' because an intermediate class '{4}' overrides '{2}' in class '{3}' but is not accessible.
cs: '{0} ve třídě {1} nemůže potlačovat {2} ve třídě {3}, protože zprostředkující třída {4} potlačuje {2} ve třídě {3}, ale není dostupná.
de: '"{0}" in der {1}-Klasse kann "{2}" in der {3}-Klasse nicht überschreiben, weil "{2}" von der Zwischenklasse "{4}" in der {3}-Klasse überschrieben wird, auf die aber nicht zugegriffen werden kann.
es: 'El elemento '{0}' de la clase '{1}' no puede invalidar el elemento '{2}' de la clase '{3}' porque una clase '{4}' intermedia invalida '{2}' en la clase '{3}' pero no es accesible.
fr: '{0}' dans la classe '{1}' ne peut pas se substituer à '{2}' dans la classe '{3}', car une classe intermédiaire '{4}' se substitue à '{2}' dans la classe '{3}', mais n'est pas accessible.
it: '{0}' nella classe '{1}' non può eseguire l'override di '{2}' nella classe '{3}' perché una classe intermedia '{4}' esegue l'override di '{2}' nella classe '{3}' ma non è accessibile.
ja: 'クラス '{1}' の '{0}' がクラス '{3}' の '{2}' をオーバーライドできません。これは中間クラス '{4}' によってクラス '{3}' の '{2}' がオーバーライドされますが、その中間クラスにアクセスできないためです。
ko: '중간 클래스 '{4}'이(가) '{3}' 클래스의 '{2}'을(를) 재정의하지만 이 중간 클래스에 액세스할 수 없으므로 '{1}' 클래스의 '{0}'이(가) '{3}' 클래스의 '{2}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” w klasie „{1}” nie może przesłonić elementu „{2}” w klasie „{3}”, ponieważ klasa pośrednicząca „{4}”, która przesłania element „{2}” w klasie „{3}”, jest niedostępna.
pt_br: "{0}" na classe "{1}" não pode substituir "{2}" na classe "{3}" porque uma classe intermediária "{4}" substitui "{2}" na classe "{3}", mas não está acessível.
ru: "{0}" в классе "{1}" не может переопределять "{2}" в классе "{3}", поскольку недоступен промежуточный класс "{4}", переопределяющий "{2}" в классе "{3}".
tr: 'Bir ara '{4}' sınıfı '{3}' sınıfında '{2}' öğesini geçersiz kıldığından ancak erişilebilir olmadığından, '{1}' sınıfındaki '{0}' öğesi '{3}' sınıfındaki '{2}' öğesini geçersiz kılamıyor.
zh_hans: '类“{1}”中的“{0}”不能重写类“{3}”中的“{2}”，因为中间类“{4}”重写了类“{3}”中的“{2}”，但不可访问。
zh_hant: '類別 '{1}' 中的 '{0}' 無法覆寫類別 '{3}' 中的 '{2}'，因為中繼類別 '{4}' 會覆寫類別 '{3}' 中的 '{2}'，但無法存取。
