Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidVersionFormat
source: The specified version string does not conform to the required format - major[.minor[.build|*[.revision|*]]]
cs: Zadaný řetězec verze není v souladu s požadovaným formátem – hlavní_verze[.dílčí_verze[.build|*[.revize|*]]].
de: Die angegebene Versionszeichenfolge weist nicht das erforderliche Format auf: Hauptversion[.Nebenversion[.Build|*[.Revision|*]]]
es: La cadena de versión especificada no se ajusta al formato requerido: principal[,secundaria[,compilación|*[, revisión|*]]]
fr: Le format de la chaîne de version spécifiée n'est pas conforme au format requis - major[.minor[.build|*[.revision|*]]]
it: La stringa di versione specificata non è conforme al formato richiesto: principale[.secondaria[.build|*[.revisione|*]]]
ja: 指定されたバージョン文字列が必要な形式 (major[.minor[.build|*[.revision|*]]]) に従っていません。
ko: 지정한 버전 문자열이 필요한 형식 major[.minor[.build|*[.revision|*]]]을 따르지 않습니다.
pl: Określony ciąg wersji nie jest zgodny z wymaganym formatem: wersja_główna[.wersja_podrzędna[.kompilacja|*[.poprawka|*]]].
pt_br: A cadeia de caracteres da versão especificada não está de acordo com o formato necessário - major[.minor[.build|*[.revision|*]]]
ru: Указанная строка версии не соответствует требуемому формату: основной номер[.дополнительный номер[.сборка|*[.редакция|*]]]
tr: Belirtilen sürüm dizesi gerekli biçime uygun değil - ana[.alt[.yapı|*[.düzeltme|*]]]
zh_hans: 指定的版本字符串不符合所需格式 - major[.minor[.build|*[.revision|*]]]
zh_hant: 指定的版本字串不符合所需的格式 - major[.minor[.build|*[.revision|*]]]

# WRN_InvalidVersionFormat
source: The specified version string does not conform to the recommended format - major.minor.build.revision
cs: Zadaný řetězec verze není v souladu s doporučeným formátem – hlavní_verze.dílčí_verze.build.revize.
de: Die angegebene Versionszeichenfolge entspricht nicht dem empfohlenen Format: Hauptversion.Nebenversion.Build.Revision
es: La cadena de versión especificada no se ajusta al formato recomendado: principal,secundaria,compilación,revisión
fr: Le format de la chaîne de version spécifiée n'est pas conforme au format requis - major.minor.build.revision
it: La stringa di versione specificata non è conforme al formato consigliato: principale.secondaria.build.revisione
ja: 指定したバージョン文字列は、推奨される形式 (major.minor.build.revision) に従っていません
ko: 지정한 버전 문자열이 권장 형식 major.minor.build.revision을 따르지 않습니다.
pl: Określony ciąg wersji nie jest zgodny z zalecanym formatem — wersja_główna.wersja_pomocnicza.kompilacja.poprawka
pt_br: A cadeia de caracteres de versão especificada não está de acordo com o formato recomendado - major.minor.build.revision
ru: Указанная строка версии не соответствует рекомендованному формату — основной номер.дополнительный номер.сборка.редакция
tr: Belirtilen sürüm dizesi önerilen biçime uymuyor - major.minor.build.revision
zh_hans: 指定版本字符串不符合建议格式 - major.minor.build.revision
zh_hant: 指定的版本字串不符合建議的格式 - major.minor.build.revision

# WRN_InvalidVersionFormat_Title
source: The specified version string does not conform to the recommended format
cs: Zadaný řetězec verze neodpovídá doporučenému formátu.
de: Die angegebene Versionszeichenfolge entspricht nicht dem empfohlenen Format.
es: La cadena de versión especificada no es compatible con el formato recomendado
fr: La chaîne de version spécifiée n’est pas conforme au format recommandé
it: La stringa di versione specificata non è conforme al formato consigliato
ja: 指定されたバージョン文字列が、推奨される形式に準拠していません
ko: 지정한 버전 문자열이 권장 형식을 따르지 않음
pl: Określony ciąg wersji jest niezgodny z zalecanym formatem
pt_br: A cadeia de caracteres de versão especificada não está de acordo com o formato recomendado
ru: Указанная строка версии не соответствует рекомендуемому формату
tr: Belirtilen sürüm dizesi önerilen biçim ile uyumlu değil
zh_hans: 指定的版本字符串不符合建议的格式
zh_hant: 指定的版本字串不符合建議的格式

# ERR_InvalidVersionFormat2
source: The specified version string does not conform to the recommended format - major.minor.build.revision (without wildcards)
es: La cadena de versión especificada no es compatible con el formato recomendado - major.minor.build.revision (sin caracteres comodín)
zh_hant: 指定的版本字串不符合建議的格式: major.minor.build.revision (不含萬用字元)

# ERR_InvalidAssemblyCultureForExe
source: Executables cannot be satellite assemblies; culture should always be empty
cs: Spustitelné soubory nemůžou být satelitními sestaveními; jazyková verze by vždy měla být prázdná.
de: Ausführbare Dateien können keine Satellitenassemblys sein. Kulturen sollten immer leer sein.
es: Los archivos ejecutables no pueden ser ensamblados satélite y no deben tener referencia cultural
fr: Les exécutables ne peuvent pas être des assemblys satellites ; la culture doit toujours être vide
it: I file eseguibili non possono essere assembly satellite. Il campo relativo alle impostazioni cultura deve essere sempre vuoto
ja: 実行可能ファイルをサテライト アセンブリにできません。カルチャは常に空でなければなりません
ko: 실행 파일은 위성 어셈블리일 수 없습니다. 문화권은 항상 비워 두어야 합니다.
pl: Pliki wykonywalne nie mogą być zestawami satelity, element Culture powinien zawsze być pusty
pt_br: Executáveis não podem ser assemblies satélites; cultura deve estar sempre vazia
ru: Исполняемые файлы не могут быть вспомогательными сборками; язык и региональные параметры должны быть пустыми.
tr: Yürütülebilir dosyalar yardımcı derleme olamaz; kültür her zaman boş olmalıdır
zh_hans: 可执行文件不能是附属程序集；区域性应始终为空
zh_hant: 可執行檔不可為附屬組件; 文化特性需保留為空白

# WRN_MainIgnored
source: The entry point of the program is global script code; ignoring '{0}' entry point.
cs: Vstupní bod programu je globální kód skriptu; vstupní bod se bude ignorovat {0}.
de: Der Einstiegspunkt des Programms ist globaler Skriptcode. Der Einstiegspunkt "{0}" wird ignoriert.
es: El punto de entrada del programa es código de script global: se omite el punto de entrada '{0}'.
fr: Le point d'entrée du programme est du code de script global ; point d'entrée '{0}' ignoré.
it: Il punto di ingresso del programma è codice script globale. Il punto di ingresso '{0}' verrà ignorato.
ja: プログラムのエントリ ポイントは、グローバル スクリプト コードです。エントリ ポイント '{0}' を無視します。
ko: 프로그램의 진입점은 전역 스크립트 코드이므로 '{0}' 진입점을 무시합니다.
pl: Punkt wejścia programu to kod skryptu globalnego. Punkt wejścia „{0}” został zignorowany.
pt_br: O ponto de entrada do programa é o código de script global; ignorando "{0}" ponto de entrada.
ru: Точкой входа программы является глобальный код скрипта; игнорируйте точку входа "{0}".
tr: Programın giriş noktası genel betik kodudur; '{0}' giriş noktası yoksayılıyor.
zh_hans: 程序的入口点是全局脚本代码；正在忽略“{0}”入口点。
zh_hant: 程式的進入點為全域指令碼; 將略過 '{0}' 進入點。

# WRN_MainIgnored_Title
source: The entry point of the program is global script code; ignoring entry point
cs: Vstupním bodem programu je globální kód skriptu. Vstupní bod se ignoruje.
de: Der Einstiegspunkt des Programms ist globaler Skriptcode; der Einstiegspunkt wird ignoriert.
es: El punto de entrada del programa es código de script global. Ignorando punto de entrada
fr: Le point d'entrée du programme est du code de script global ; ce point d'entrée est ignoré
it: Il punto di ingresso del programma è codice script globale. Il punto di ingresso verrà ignorato
ja: プログラムのエントリ ポイントは、グローバル スクリプト コードです。エントリ ポイントを無視します
ko: 프로그램의 진입점이 전역 스크립트 코드이며 진입점을 무시함
pl: Punkt wejścia programu to kod skryptu globalnego. Punkt wejścia został zignorowany
pt_br: O ponto de entrada do programa é o código de script global; ignorando o ponto de entrada
ru: Точка входа в программе является глобальным кодом скрипта; выполняется пропуск точки входа
tr: Programın giriş noktası genel betik kodudur, giriş noktası yoksayılıyor
zh_hans: 程序的入口点是全局脚本代码；正在忽略入口点
zh_hant: 程式的進入點是全域指令碼; 將忽略進入點

# WRN_EmptyPrefixAndXmlnsLocalName
source: The xmlns attribute has special meaning and should not be written with a prefix.
cs: Atribut xmlns má zvláštní význam a neměl by být zapsaný s prefixem.
de: Das xmlns-Attribut hat eine bestimmte Bedeutung und darf nicht mit einem Präfix verwendet werden.
es: El atributo xmlns tiene un significado especial y no se debe escribir con un prefijo.
fr: L’attribut xmlns a une signification particulière et ne doit pas être écrit avec un préfixe.
it: L'attributo xmlns ha un significato speciale e non deve essere scritto con un prefisso.
ja: xmlns 属性には特別な意味があるため、プレフィックスを付けて記述してはなりません。
ko: xmlns 특성은 특별한 의미가 있으므로 접두사를 사용하여 쓰면 안 됩니다.
pl: Atrybut xmlns ma specjalne znaczenie i nie powinien być zapisywany z prefiksem.
pt_br: O atributo xmlns tem um significado especial e não deve ser escrito com um prefixo.
ru: Атрибут xmlns имеет особое значение и не должен быть написан с префиксом.
tr: xmlns özniteliğinin özel bir anlamı vardır ve ön ekle yazılmamalıdır.
zh_hans: xmlns 特性具有特殊含义，不应使用前缀进行编写。
zh_hant: xmlns 屬性具有特殊意義，寫入時不應該有前置詞。

# WRN_EmptyPrefixAndXmlnsLocalName_Title
source: The xmlns attribute has special meaning and should not be written with a prefix
cs: Atribut xmlns má zvláštní význam a neměl by být zapsaný s předponou.
de: Das xmlns-Attribut hat eine bestimmte Bedeutung und darf nicht mit einem Präfix verwendet werden.
es: El atributo xmlns tiene un significado especial y no se debe escribir con un prefijo
fr: L’attribut xmlns a une signification particulière et ne doit pas être écrit avec un préfixe
it: L'attributo xmlns ha un significato speciale e non deve essere scritto con un prefisso
ja: xmlns 属性には特別な意味があるため、プレフィックスを付けて記述してはなりません
ko: xmlns 특성은 특별한 의미가 있으므로 접두사를 사용하여 쓰면 안 됨
pl: Atrybut xmlns ma specjalne znaczenie i nie powinien być zapisywany z prefiksem
pt_br: O atributo xmlns tem um significado especial e não deve ser escrito com um prefixo
ru: Атрибут xmlns имеет особое значение и не должен быть записан с префиксом
tr: xmlns özniteliğinin özel bir anlamı vardır ve ön ekle yazılmamalıdır
zh_hans: xmlns 特性具有特殊含义，不应使用前缀进行编写
zh_hant: xmlns 屬性具有特殊意義，寫入時不應該有前置詞

# WRN_PrefixAndXmlnsLocalName
source: It is not recommended to have attributes named xmlns. Did you mean to write 'xmlns:{0}' to define a prefix named '{0}'?
cs: Nedoporučují se atributy s názvem xmlns. Měli jste v úmyslu napsat xmlns:{0}, abyste definovali prefix s názvem {0}?
de: Die Verwendung von Attributen namens "xmlns" wird nicht empfohlen. Wollten Sie "xmlns:{0}" schreiben, um ein Präfix namens "{0}" zu definieren?
es: No se recomienda tener atributos con el nombre xmlns. ¿Quería escribir 'xmlns:{0}' para definir un prefijo con el nombre '{0}'?
fr: Il n'est pas recommandé de nommer des attributs xmlns. Vouliez-vous écrire 'xmlns:{0}' pour définir un préfixe nommé '{0}' ?
it: Non è consigliabile avere attributi denominati xmlns. Si intendeva scrivere 'xmlns:{0}' per definire un prefisso denominato '{0}'?
ja: 属性に xmlns という名前を付けることは勧められていません。'xmlns:{0}' と記述して '{0}' という名前のプレフィックスを定義するつもりでしたか?
ko: 특성 이름으로 xmlns를 지정하지 않는 것이 좋습니다. 명명된 접두사 '{0}'을(를) 정의하는 데 'xmlns:{0}'을 쓰려고 했습니까?
pl: Zaleca się, aby atrybuty nie miały nazwy xmlns. Czy w celu zdefiniowania prefiksu o nazwie „{0}” nie miał zostać wprowadzony ciąg „xmlns:{0}”?
pt_br: Não é recomendável ter atributos nomeados xmlns. Você pretendia escrever "xmlns:{0}" para definir um prefixo nomeado "{0}"?
ru: Не рекомендуется иметь атрибуты с именем xmlns. Имелось в виду написание "xmlns:{0}" для определения префикса с именем "{0}"?
tr: Adı xmlns olan özniteliklerin kullanılmaması önerilir. '{0}' adlı bir ön eki tanımlamak için 'xmlns:{0}' yazmak mı istiyordunuz?
zh_hans: 建议不要将特性命名为 xmlns。是否有意编写“xmlns:{0}”以定义名为“{0}”的前缀?
zh_hant: 不建議使用名為 xmlns 的屬性。是否原本希望寫入 'xmlns:{0}' 以定義名為 '{0}' 的前置詞?

# WRN_PrefixAndXmlnsLocalName_Title
source: It is not recommended to have attributes named xmlns
cs: Nedoporučuje se mít atributy s názvem xmlns.
de: Attribute mit dem Namen "xmlns" werden nicht empfohlen.
es: No se recomienda tener atributos denominados xmlns
fr: Il n’est pas recommandé de nommer des attributs xmlns
it: Si consiglia di non usare attributi denominati xmlns
ja: xmlns という名前の属性を設定しないでください
ko: 이름이 xmlns인 특성을 사용하지 않는 것이 좋음
pl: Zaleca się, aby atrybuty nie miały nazwy xmlns
pt_br: Não é recomendável ter atributos chamados xmlns
ru: Атрибуты не рекомендуется называть "xmlns"
tr: Öznitelik adında xmlns kullanılması önerilmez
zh_hans: 不建议拥有名为 xmlns 的属性
zh_hant: 不建議將屬性命名為 xmlns

# ERR_ExpectedSingleScript
source: Expected a single script (.vbx file)
cs: Očekával se jeden skript (soubor .vbx)
de: Erwartet wurde ein einzelnes Skript (VBX-Datei).
es: Se esperaba un script único (archivo .vbx)
fr: Un seul script est attendu (fichier .vbx)
it: È previsto un singolo script (file con estensione vbx)
ja: 単一のスクリプトが必要です(.vbx ファイル)
ko: 단일 스크립트(.vbx 파일) 필요
pl: Oczekiwano pojedynczego skryptu (plik VBX)
pt_br: Espera-se um único script (arquivo .vbx)
ru: Ожидался отдельный скрипт (VBX-файл)
tr: Tek bir betik (.vbx dosyası) bekleniyordu
zh_hans: 需要一个脚本 (.vbx 文件)
zh_hant: 必須是單一指令碼 (.vbx 檔)

# ERR_ReservedAssemblyName
source: The assembly name '{0}' is reserved and cannot be used as a reference in an interactive session
cs: Název sestavení {0} je rezervovaný a nedá se použít jako odkaz v interaktivní relaci.
de: Der Assemblyname "{0}" ist reserviert und kann nicht als Verweis in einer interaktiven Sitzung verwendet werden.
es: El nombre de ensamblado '{0}' está reservado y no se puede usar como referencia en una sesión interactiva
fr: Le nom d'assembly '{0}' est réservé et ne peut pas servir de référence dans une session interactive
it: Il nome di assembly '{0}' è riservato e non può essere usato come riferimento in una sessione interattiva
ja: アセンブリ名 '{0}' は予約されており、対話形式のセッションで参照として使用することはできません
ko: '{0}' 어셈블리 이름은 예약된 것이므로 대화형 세션에 참조로 사용할 수 없습니다.
pl: Nazwa zestawu „{0}” jest zarezerwowana i nie można jej użyć jako odwołania w sesji interaktywnej
pt_br: O nome do assembly "{0}" é reservado e não pode ser usado como uma referência em uma sessão interativa
ru: Имя сборки "{0}" зарезервировано и не может использоваться как ссылка в интерактивном сеансе.
tr: '{0}' derleme adı ayrıldı ve etkileşimli bir oturumda başvuru olarak kullanılamıyor
zh_hans: 程序集名“{0}”保留名称，不能在交互会话中用作引用
zh_hant: 組件名稱 '{0}' 已保留，不可用做為互動工作階段中的參考

# ERR_ReferenceDirectiveOnlyAllowedInScripts
source: #R is only allowed in scripts
cs: #R je povolený jenom ve skriptech.
de: #R ist nur in Skripts zulässig.
es: #R solo se permite en scripts
fr: #R n'est autorisé que dans les scripts
it: #R è consentito solo negli script
ja: #R はスクリプトのみで使用できます
ko: #R은 스크립트에서만 허용됩니다.
pl: Element #R jest dozwolony tylko w skryptach
pt_br: #R é somente permitido em scripts
ru: #R допускается только в скриптах
tr: #R için yalnızca betiklerde izin verilir
zh_hans: 仅在脚本中允许 #R
zh_hant: #R 只可用於指令碼中

# ERR_NamespaceNotAllowedInScript
source: You cannot declare Namespace in script code
cs: Obor názvů nemůžeme deklarovat v kódu skriptu.
de: Das Deklarieren eines Namespace in Skriptcode ist nicht möglich.
es: No puede declarar Espacio de nombres en código de script
fr: Impossible de déclarer un espace de noms dans le code de script
it: Non è possibile dichiarare lo spazio dei nomi nel codice script
ja: スクリプトコードでは名前空間を宣言できません
ko: 스크립트 코드에서 네임스페이스를 선언할 수 없습니다.
pl: W kodzie skryptu nie można zadeklarować przestrzeni nazw
pt_br: Você não pode declarar o Namespace no código de script
ru: Нельзя объявить пространство имен в коде скрипта
tr: Betik kodunda Namespace bildiremezsiniz
zh_hans: 不能在脚本代码中声明命名空间
zh_hant: 您無法在指令碼中宣告 Namespace

# ERR_KeywordNotAllowedInScript
source: You cannot use '{0}' in top-level script code
cs: {0} nemůžete použít v kódu skriptu na nejvyšší úrovni.
de: "{0}" kann in Skriptcode der obersten Ebene nicht verwendet werden.
es: No puede usar '{0}' en código de script de nivel superior
fr: Vous ne pouvez pas utiliser '{0}' dans du code de script de premier niveau
it: Non è possibile usare '{0}' nel codice script di primo livello
ja: トップ レベル スクリプト コードでは '{0}' を使用できません
ko: 최상위 스크립트 코드에서 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można używać słowa kluczowego „{0}” w kodzie skryptu najwyższego poziomu
pt_br: Você não pode usar "{0}" no código de script de nível superior
ru: Нельзя использовать "{0}" в коде скрипта верхнего уровня.
tr: Üst düzey betik kodunda '{0}' kullanamazsınız
zh_hans: 您不能使用顶级脚本代码中的“{0}”
zh_hant: 您無法在最上層指令碼中使用 '{0}'

# ERR_LambdaNoType
source: Cannot infer a return type. Consider adding an 'As' clause to specify the return type.
cs: Návratový typ nejde odvodit. Zvažte určení návratového typu přidáním klauzule As.
de: Es kann kein Rückgabetyp abgeleitet werden. Fügen Sie eine As-Klausel hinzu, um den Rückgabetyp anzugeben.
es: No se puede inferir un tipo devuelto. Puede agregar una cláusula 'As' para especificar el tipo devuelto.
fr: Impossible de déduire un type de retour. Ajoutez une clause 'As' pour spécifier le type de retour.
it: Non è possibile dedurre un tipo restituito. Provare ad aggiungere una clausola 'As' per specificare il tipo restituito.
ja: 戻り値の型を推論できません。'As' 句を追加して戻り値の型を指定することを検討してください。
ko: 반환 형식을 유추할 수 없습니다. 'As' 절을 추가하여 반환 형식을 지정하세요.
pl: Nie można wywnioskować zwracanego typu. Rozważ dodanie klauzuli „As” w celu określenia zwracanego typu.
pt_br: Não é possível deduzir o tipo de retorno. Considere adicionar uma cláusula 'As' para especificar o tipo de retorno.
ru: Не удалось определить возвращаемый тип. Для указания возвращаемого типа рекомендуется добавлять предложение "As".
tr: Dönüş türü çıkarsanamıyor. Dönüş türünü belirtmek için bir 'As' yan tümcesi ekleyebilirsiniz.
zh_hans: 无法推断返回类型。请考虑添加一个“As”子句来指定返回类型。
zh_hant: 無法推斷傳回類型。請考慮加入 'As' 子句來指定傳回類型。

# WRN_LambdaNoTypeObjectAssumed
source: Cannot infer a return type; 'Object' assumed.
cs: Návratový typ nejde odvodit; předpokládá se typ Object.
de: Es kann kein Rückgabetyp abgeleitet werden. "Object" wird angenommen.
es: No se puede inferir un tipo devuelto; se supone 'Object'.
fr: Impossible de déduire un type de retour ; type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo restituito. Verrà usato 'Object'.
ja: 戻り値の型を推論できません。'Object' と見なされます。
ko: 반환 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować zwracanego typu; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo de retorno; 'Object' presumido.
ru: Не удается определить тип возвращаемого значения; предполагаемый тип — "Object".
tr: Dönüş türü çıkarsanamıyor; 'Object' varsayıldı.
zh_hans: 无法推断返回类型；假定为 "Object"。
zh_hant: 無法推斷傳回類型; 假設是 'Object'。

# WRN_LambdaNoTypeObjectAssumed_Title
source: Cannot infer a return type
cs: Nedá se odvodit návratový typ.
de: Es kann kein Rückgabetyp abgeleitet werden.
es: No se puede inferir un tipo de retorno
fr: Impossible de déduire un type de retour
it: Non è possibile dedurre un tipo restituito
ja: 戻り値の型を推論できません
ko: 반환 형식을 유추할 수 없음
pl: Nie można wywnioskować zwracanego typu
pt_br: Não é possível deduzir um tipo de retorno
ru: Невозможно определить тип возвращаемого значения
tr: Dönüş türü çıkarsanamıyor
zh_hans: 无法推断返回类型
zh_hant: 無法推斷傳回類型

# WRN_LambdaTooManyTypesObjectAssumed
source: Cannot infer a return type because more than one type is possible; 'Object' assumed.
cs: Návratový typ nejde odvodit, protože je přípustný více než jeden typ; předpokládá se typ Object.
de: Es kann kein Rückgabetyp abgeleitet werden, weil mehrere Typen möglich sind. "Object" wird angenommen.
es: No se puede inferir un tipo devuelto porque es posible más de un tipo; se supone 'Object'.
fr: Impossible de déduire un type de retour, car plusieurs types sont possibles. Type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo restituito perché sono possibili più tipi. Verrà usato 'Object'.
ja: 複数の型が考えられるため、戻り値の型を推論できません。'Object' と見なされます。
ko: 두 개 이상의 형식이 가능하므로 반환 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować zwracanego typu, ponieważ jest możliwy więcej niż jeden typ; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo de retorno porque mais de um tipo é possível; 'Object' presumido.
ru: Не удается получить тип возвращаемого значения, так как возможно больше одного типа; предполагаемый тип — "Object".
tr: Birden fazla tür olasılığı olduğu için dönüş türü çıkarsanamıyor; 'Object' varsayıldı.
zh_hans: 无法推断返回类型，因为可能存在多个类型；假定为 "Object"。
zh_hant: 無法推斷傳回類型，因為可能有一個以上的類型; 假設是 'Object'。

# WRN_LambdaTooManyTypesObjectAssumed_Title
source: Cannot infer a return type because more than one type is possible
cs: Nedá se odvodit návratový typ, protože je možný víc než jeden typ.
de: Es kann kein Rückgabetyp abgeleitet werden, da mehrere Typen möglich sind.
es: No se puede inferir un tipo de retorno porque es posible más de un tipo
fr: Impossible de déduire un type de retour car plusieurs types sont possibles
it: Non è possibile dedurre un tipo restituito perché sono possibili più tipi
ja: 複数の型が考えられるため、戻り値の型を推論できません
ko: 두 개 이상의 형식이 가능하므로 반환 형식을 유추할 수 없음
pl: Nie można wywnioskować zwracanego typu, ponieważ możliwe jest użycie więcej niż jednego typu
pt_br: Não é possível deduzir um tipo de retorno porque mais de um tipo é possível
ru: Невозможно определить тип возвращаемого значения, так как возможно больше одного типа
tr: Birden çok tür mümkün olduğu için dönüş türü çıkarsanamıyor
zh_hans: 无法推断返回类型，原因是可能存在多个类型
zh_hant: 無法推斷傳回類型，因為可能的類型不止一種

# ERR_LambdaNoTypeObjectDisallowed
source: Cannot infer a return type. Consider adding an 'As' clause to specify the return type.
cs: Návratový typ nejde odvodit. Zvažte určení návratového typu přidáním klauzule As.
de: Es kann kein Rückgabetyp abgeleitet werden. Fügen Sie eine As-Klausel hinzu, um den Rückgabetyp anzugeben.
es: No se puede inferir un tipo devuelto. Puede agregar una cláusula 'As' para especificar el tipo devuelto.
fr: Impossible de déduire un type de retour. Ajoutez une clause 'As' pour spécifier le type de retour.
it: Non è possibile dedurre un tipo restituito. Provare ad aggiungere una clausola 'As' per specificare il tipo restituito.
ja: 戻り値の型を推論できません。'As' 句を追加して戻り値の型を指定することを検討してください。
ko: 반환 형식을 유추할 수 없습니다. 'As' 절을 추가하여 반환 형식을 지정하세요.
pl: Nie można wywnioskować zwracanego typu. Rozważ dodanie klauzuli „As” w celu określenia zwracanego typu.
pt_br: Não é possível deduzir o tipo de retorno. Considere adicionar uma cláusula 'As' para especificar o tipo de retorno.
ru: Не удалось определить возвращаемый тип. Для указания возвращаемого типа рекомендуется добавлять предложение "As".
tr: Dönüş türü çıkarsanamıyor. Dönüş türünü belirtmek için bir 'As' yan tümcesi ekleyebilirsiniz.
zh_hans: 无法推断返回类型。请考虑添加一个 "As" 子句来指定返回类型。
zh_hant: 無法推斷傳回類型。請考慮加上 'As' 子句來指定傳回類型。
