Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AssignmentInitOnly
source: Init-only property '{0}' can only be assigned by an object member initializer, or on 'Me', 'MyClass` or 'MyBase' in an instance constructor.
es: Solo un inicializador de miembro de objeto puede asignar la propiedad de solo inicio "{0}", o bien en "Me", "MyClass" o "MyBase" en un constructor de instancia.
it: La proprietà di sola inizializzazione '{0}' può essere assegnata solo da un inizializzatore di membro di oggetto oppure in 'Me', 'MyClass' o 'MyBase' in un costruttore di istanza.
ja: 初期化専用プロパティ '{0}' は、オブジェクト メンバー初期化子を使用する場合か、インスタンス コンストラクター内の 'Me'、'MyClass'、'MyBase' でのみ割り当てることができます。
ko: 초기값 전용 속성 '{0}'은(는) 개체 멤버 이니셜라이저에 의해서나 인스턴스 생성자의 'Me', 'MyClass` 또는 'MyBase'에만 할당할 수 있습니다.
pl: Właściwość tylko do inicjowania „{0}” może być przypisana tylko przez inicjatora składowej obiektu lub w elemencie „Me”, „MyClass” lub „MyBase” w konstruktorze wystąpień.
pt_br: A propriedade apenas para inicialização '{0}' só pode ser atribuída por um inicializador de membro de objeto ou em 'Me', 'MyClass` ou 'MyBase' em um construtor de instância.
ru: Свойство "{0}", доступное только для инициализации, можно назначать только c помощью инициализатора элемента объекта или для "Me", "MyClass" или "MyBase" в конструкторе экземпляра.
tr: '{0}' init-only özelliği yalnızca nesne üyesi başlatıcısı tarafından veya örnek oluşturucudaki 'Me', 'MyClass' veya 'MyBase' üzerinde atanabilir.
zh_hant: 只有物件成員初始設定式，或在執行個體建構函式中的 'Me'、'MyClass' 或 'MyBase'，才可指派僅限初始化的屬性 '{0}'。

# ERR_AttributeCannotBeAppliedManually
source: '{0}' cannot be applied manually.
es: “{0}” no se puede aplicar manualmente.

# ERR_BadAbstractStaticMemberAccess
source: A shared abstract or virtual interface member cannot be accessed.
es: No se puede tener acceso a un miembro de interfaz virtual o abstracto compartido.
it: Impossibile accedere a un membro di interfaccia astratto o virtuale condiviso.
ja: 共有された抽象または仮想インターフェイスメンバーにアクセスできません。
ko: 공유 추상 또는 가상 인터페이스 구성원에 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do współużytkowanego abstrakcyjnego elementu członkowskiego interfejsu.
pt_br: Um membro de interface com abstrato compartilhado ou virtual não pode ser acessado.
ru: Нет доступа к общему абстрактному или виртуальному элементу интерфейса.
tr: Paylaşılan bir soyut veya sanal arabirim üyesine erişilemiyor.
zh_hant: 無法存取共用摘要或虛擬介面成員。

# ERR_BadSwitchValue
source: Command-line syntax error: '{0}' is not a valid value for the '{1}' option. The value must be of the form '{2}'.
cs: Chyba syntaxe příkazového řádku: {0} není platná hodnota možnosti {1}. Hodnota musí mít tvar {2}.
de: Fehler in der Befehlszeilensyntax: "{0}" ist kein gültiger Wert für die Option "{1}". Der Wert muss im Format "{2}" vorliegen.
es: Error de sintaxis de la línea de comandos: "{0}" no es un valor válido para la opción "{1}". El valor debe tener el formato "{2}".
it: Errore di sintassi della riga di comando: '{0}' non è un valore valido per l'opzione '{1}'. Il valore deve essere espresso nel formato '{2}'.
ja: コマンドライン構文エラー: '{0}' は、'{1}' オプションの有効な値ではありません。値は '{2}' の形式にする必要があります。
ko: 명령줄 구문 오류: '{0}'은(는) '{1}' 옵션에 유효한 값이 아닙니다. 값은 '{2}' 형식이어야 합니다.
pl: Błąd składni wiersza polecenia: „{0}” nie jest prawidłową wartością dla opcji „{1}”. Wartość musi mieć postać „{2}”.
pt_br: Erro de sintaxe de linha de comando: '{0}' não é um valor válido para a opção '{1}'. O valor precisa estar no formato '{2}'.
ru: Ошибка в синтаксисе командной строки: "{0}" не является допустимым значением для параметра "{1}". Значение должно иметь форму "{2}".
tr: Komut satırı söz dizimi hatası: '{0}', '{1}' seçeneği için geçerli bir değer değil. Değer '{2}' biçiminde olmalıdır.
zh_hans: 命令行语法错误:“{0}”不是“{1}”选项的有效值。值的格式必须为 "{2}"。
zh_hant: 命令列語法錯誤: '{0}' 對 '{1}' 選項而言不是有效的值。此值的格式必須是 '{2}'。

# ERR_CannotApplyOverloadResolutionPriorityToMember
source: Cannot use 'OverloadResolutionPriorityAttribute' on this member.
es: No se puede usar "OverloadResolutionPriorityAttribute" en este miembro.
zh_hant: 無法在此成員上使用 'OverloadResolutionPriorityAttribute'。

# ERR_CannotApplyOverloadResolutionPriorityToOverride
source: Cannot use 'OverloadResolutionPriorityAttribute' on an overriding member.
es: No se puede usar "OverloadResolutionPriorityAttribute" en un miembro de reemplazo.
zh_hant: 無法在覆寫成員上使用 'OverloadResolutionPriorityAttribute'。

# ERR_CannotInheritFromTypeWithRequiredMembers
source: Cannot inherit from '{0}' because it has required members.
es: No se puede heredar de '{0}' porque tiene miembros necesarios.
it: Non è possibile ereditare da '{0}' perché contiene membri obbligatori.
ko: 필요한 멤버가 있어 '{0}'에서 상속할 수 없습니다.
pl: Nie można dziedziczyć z elementu „{0}”, ponieważ zawiera wymagane elementy członkowskie.
ru: Не удалось наследование от "{0}", так как в нем есть обязательные элементы.
tr: Gerekli üyelere sahip olduğu için '{0}' öğesinden devralınamaz.
zh_hant: '{0}' 具有必要的成員，因此無法從其繼承。

# ERR_CommentsAfterLineContinuationNotAvailable1
source: Please use language version {0} or greater to use comments after line continuation character.
cs: Použijte prosím verzi jazyka {0} nebo vyšší, abyste mohli používat komentáře za znakem pro pokračování řádku.
de: Verwenden Sie Sprachversion {0} oder höher, um Kommentare nach dem Zeilenfortsetzungszeichen zu verwenden.
es: Use la versión de lenguaje {0} o superior para usar los comentarios después del carácter de continuación de línea.
fr: Utilisez la version de langage {0} ou une version ultérieure pour utiliser des commentaires après le caractère de continuation de la ligne.
it: Usare la versione {0} o versioni successive del linguaggio per usare commenti dopo il carattere di continuazione di riga.
ja: 行連結文字の後のコメントを使用するには、言語バージョン {0} 以上をご使用ください。
ko: 줄 연속 문자 뒤에 주석을 사용하려면 언어 버전 {0} 이상을 사용하세요.
pl: Użyj wersji języka {0} lub nowszej, aby stosować komentarze po znaku kontynuacji wiersza.
pt_br: Use a versão de linguagem {0} ou posterior para usar comentários após o caractere de continuação de linha.
ru: Используйте версию языка {0} или более позднюю, чтобы использовать комментарии после символа продолжения строки.
tr: Lütfen satır devamı karakterinden sonra açıklama kullanmak için {0} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 请使用语言版本 {0} 或更高版本，以在行继续符后使用注释。
zh_hant: 若要在行接續字元後使用註解，請使用 {0} 或更高的語言版本。

# ERR_DefaultInterfaceImplementationInNoPIAType
source: Type '{0}' cannot be embedded because it has a non-abstract member. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože má neabstraktní člen. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Typ "{0}" kann nicht eingebettet werden, weil er einen nicht abstrakten Member aufweist. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf FALSE fest.
es: El tipo "{0}" no se puede incrustar porque tiene un miembro no abstracto. Puede establecer la propiedad "Incrustar tipos de interoperabilidad" en false.
it: Non è possibile incorporare il tipo '{0}' perché contiene un membro non astratto. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' には非抽象メンバーがあるため、この型を埋め込むことはできません。'相互運用型の埋め込み' プロパティを false に設定することをご検討ください。
ko: '{0}' 형식에는 비추상 멤버가 있으므로 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정해보세요.
pl: Nie można osadzić typu „{0}”, ponieważ ma nieabstrakcyjną składową. Rozważ ustawienie wartości false dla właściwości „Osadź typy międzyoperacyjne”.
pt_br: O tipo '{0}' não pode ser inserido porque tem um membro que não é abstrato. Considere a definição da propriedade 'Inserir Tipos de Interoperabilidade' como false.
ru: Не удается внедрить тип "{0}", так как он имеет неабстрактный член. Попробуйте задать для свойства "Внедрить типы взаимодействия" значение false.
tr: '{0}' türünün soyut olmayan bir üyesi olduğundan bu tür eklenemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入类型“{0}”，因为它有非抽象成员。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 因為類型 '{0}' 有非抽象成員，所以無法內嵌。請考慮將 [內嵌 Interop 類型] 屬性設為 false。

# ERR_DoNotUseCompilerFeatureRequired
source: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' is reserved for compiler usage only.
es: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' está reservado solo para el uso del compilador.
it: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' è riservato all'utilizzo esclusivo del compilatore.
ja: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' は、コンパイラのみで使用するために予約されています。
ko: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute'는 컴파일러 용도로만 예약되어 있습니다.
pl: Element „System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute” jest zarezerwowany tylko do użycia przez kompilator.
pt_br: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' é reservado apanas para uso do compilador.
ru: "System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute" зарезервирован для использования только компилятором.
tr: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' yalnızca derleyici kullanımı için ayrılmıştır.
zh_hant: 'System.Runtime.CompilerServices.CompilerFeatureRequiredAttribute' 僅保留給編譯器使用。

# ERR_DoNotUseRequiredMember
source: 'System.Runtime.CompilerServices.RequiredMemberAttribute' is reserved for compiler usage only.
es: 'System.Runtime.CompilerServices.RequiredMemberAttribute' está reservado solo para uso del compilador.
it: 'System.Runtime.CompilerServices.RequiredMemberAttribute' è riservato solo all’uso del compilatore.
ko: 'System.Runtime.CompilerServices.RequiredMemberAttribute'는 컴파일러 용도로만 예약되어 있습니다.
pl: Element „System.Runtime.CompilerServices.RequiredMemberAttribute” jest zarezerwowany tylko do użycia przez kompilator.
ru: "System.Runtime.CompilerServices.RequiredMemberAttribute" зарезервирован только для использования компилятором.
tr: 'System.Runtime.CompilerServices.RequiredMemberAttribute' yalnızca derleyici kullanımı için ayrılmıştır.
zh_hant: 'System.Runtime.CompilerServices.RequiredMemberAttribute' 僅保留給編譯器使用。

# ERR_EncUpdateFailedMissingSymbol
source: Cannot update '{0}'; attribute '{1}' is missing.
es: No se puede actualizar '{0}'; falta el atributo '{1}'.
zh_hant: 無法更新 '{0}'; 缺少屬性 '{1}'。

source: Update requires emitting explicit interface implementation, which is not supported by the runtime without restarting the application.
es: La actualización requiere emitir una implementación explícita de interfaz, lo cual no es compatible con el runtime sin reiniciar la aplicación.

# ERR_InvalidExperimentalDiagID
source: The diagnosticId argument to the 'Experimental' attribute must be a valid identifier
es: El argumento diagnosticId del atributo "Experimental" debe ser un identificador válido.
it: L'argomento diagnosticId dell'attributo 'Experimental' deve essere un identificatore valido
ko: 'Experimental' 특성에 대한 diagnosticId 인수는 유효한 식별자여야 합니다.
tr: 'Experimental' özniteliğinin diagnosticId bağımsız değişkeni geçerli bir tanımlayıcı olmalıdır
zh_hant: 'Experimental' 屬性的 diagnosticId 引數必須是有效的識別碼

# ERR_RuntimeDoesNotSupportExtendedLayoutTypes
source: The target runtime does not support extended layout types.
es: El runtime de destino no admite tipos con diseño extendido.

# ERR_InvalidVersionFormatDeterministic
source: The specified version string contains wildcards, which are not compatible with determinism. Either remove wildcards from the version string, or disable determinism for this compilation
es: La versión especificada contiene comodines, que no son compatibles con la determinación. Quite los comodines de la cadena de versión o deshabilite la determinación para esta compilación.
zh_hant: 指定的版本字串包含萬用字元，但這與確定性不相容。請移除版本字串中的萬用字元，或停用此編譯的確定性。

# ERR_LockTypeUnsupported
source: A value of type 'System.Threading.Lock' is not supported in SyncLock. Consider manually calling 'Enter' and 'Exit' methods in a Try/Finally block instead.
es: SyncLock no admite un valor de tipo 'System.Threading.Lock'. Considere la posibilidad de llamar manualmente a los métodos 'Enter' y 'Exit' en un bloque Try/Finally en su lugar.
it: Un valore di tipo 'System.Threading.Lock' non è supportato in SyncLock. Prendi in considerazione di chiamare manualmente i metodi 'Enter' e 'Exit' in un blocco Try/Finally.
ko: SyncLock에서는 'System.Threading.Lock' 형식의 값이 지원되지 않습니다. 대신 Try/Finally 블록에서 'Enter' 및 'Exit' 메서드를 수동으로 호출하는 것이 좋습니다.
tr: SyncLock'ta 'System.Threading.Lock' türünde bir değer desteklenmiyor. Bunun yerine Try/Finally bloğunda 'Enter' ve 'Exit' yöntemlerini el ile çağırmayı düşünün.
zh_hant: SyncLock 不支援型別 'System.Threading.Lock' 的值。請考慮改為在 Try/Finally 區塊中手動呼叫 'Enter' 和 'Exit' 方法。

# ERR_MethodImplAttributeAsyncCannotBeUsed
source: 'MethodImplAttribute.Async' cannot be manually applied to methods.
es: “MethodImplAttribute.Async” no se puede aplicar manualmente a los métodos.

# ERR_MultipleAnalyzerConfigsInSameDir
source: Multiple analyzer config files cannot be in the same directory ('{0}').
cs: Ve stejném adresáři nemůže být více konfiguračních souborů analyzátoru ({0}).
de: Dasselbe Verzeichnis ({0}) darf nicht mehrere Konfigurationsdateien des Analysetools enthalten.
es: No es posible que un mismo directorio ("{0}") contenga varios archivos de configuración del analizador.
fr: Plusieurs fichiers config d'analyseur ne peuvent pas figurer dans le même répertoire ('{0}').
it: La stessa directory ('{0}') non può contenere più file di configurazione dell'analizzatore.
ja: 複数のアナライザー構成ファイルを同じディレクトリに入れることはできません ('{0}')。
ko: 분석기 구성 파일 여러 개가 동일한 디렉터리('{0}')에 있을 수 없습니다.
pl: Wiele plików konfiguracji analizatora nie może znajdować się w tym samym katalogu („{0}”).
pt_br: Não é possível que haja vários arquivos de configuração do analisador no mesmo diretório ('{0}').
ru: В одном каталоге ("{0}") не может находиться несколько файлов конфигурации анализатора.
tr: Birden çok çözümleyici yapılandırma dosyası aynı dizinde ('{0}') olamaz.
zh_hans: 多个分析器配置文件不能位于同一目录({0})中。
zh_hant: 多個分析器組態檔無法處於相同目錄 ('{0}') 中。

# ERR_NewConstraintCannotHaveRequiredMembers
source: '{2}' cannot satisfy the 'New' constraint on parameter '{1}' in the generic type or or method '{0}' because '{2}' has required members.
es: '{2}' no puede satisfacer la restricción 'New' en el parámetro '{1}' en el tipo o método genérico '{0}' porque '{2}' tiene miembros necesarios.
it: '{2}' non può soddisfare il vincolo 'New' nel parametro '{1}' nel tipo generico o nel metodo '{0}' perché '{2}' contiene membri obbligatori.
ko: '{2}'에 필수 멤버가 있으므로 '{2}'은(는) 제네릭 형식 또는 메서드 '{0}'의 '{1}' 매개 변수에 대한 'New' 제약 조건을 충족할 수 없습니다.
pl: „{2}” nie może spełnić ograniczenia „New” dla parametru „{1}” w typie ogólnym lub metodzie „{0}”, ponieważ „{2}” ma wymagane elementy członkowskie.
ru: "{2}" не соответствует ограничению "New" параметра "{1}" в универсальном типе или методе "{0}", поскольку у "{2}" есть обязательные элементы.
tr: '{2}' gerekli üyelere sahip olduğundan '{2}', '{0}' genel türünde veya metodunda bulunan '{1}' parametresindeki 'new()' kısıtlamasını karşılayamıyor.
zh_hant: '{2}' 無法滿足泛型型別或方法 '{0}' 中參數 '{1}' 的 'New' 限制式，因為 '{2}' 具有必要的成員。

# ERR_OverridingInitOnlyProperty
source: '{0}' cannot override init-only '{1}'.
es: "{0}" no puede sobrescribir la propiedad init-only "{1}".
it: '{0}' non può eseguire l'override della proprietà di sola inizializzazione '{1}'.
ja: '{0}' では、初期化専用 '{1}' をオーバーライドできません。
ko: '{0}'은(는) 초기값 전용 '{1}'을(를) 재정의할 수 없습니다.
pl: Właściwość „{0}” nie może przesłonić właściwości tylko do inicjowania „{1}”.
pt_br: A propriedade '{0}' não pode substituir a propriedade '{1}' apenas para inicialização.
ru: "{0}" не может переопределить свойство "{1}", предназначенное только для инициализации.
tr: '{0}', '{1}' init-only özelliğini geçersiz kılamaz.
zh_hant: '{0}' 無法覆寫僅限初始化的 '{1}'。

# ERR_PropertyDoesntImplementInitOnly
source: Init-only '{0}' cannot be implemented.
es: La propiedad Init-only "{0}" no se puede implementar.
it: Non è possibile implementare la proprietà di sola inizializzazione '{0}'.
ja: 初期化専用 '{0}' を実装することはできません。
ko: 초기값 전용 '{0}'을(를) 구현할 수 없습니다.
pl: Nie można zaimplementować właściwości tylko do inicjowania „{0}”.
pt_br: A propriedade '{0}' apenas para inicialização não pode ser implementada.
ru: Невозможно реализовать свойство "{0}", предназначенное только для инициализации.
tr: '{0}' init-only özelliği uygulanamaz.
zh_hant: 無法實作僅限初始化的 '{0}'。

# ERR_ReAbstractionInNoPIAType
source: Type '{0}' cannot be embedded because it has a re-abstraction of a member from base interface. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože má reabstrakci člena ze základního rozhraní. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Typ "{0}" kann nicht eingebettet werden, weil er eine Neuabstraktion eines Members aus der Basisschnittstelle aufweist. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf FALSE fest.
es: El tipo "{0}" no se puede insertar porque tiene una reabstracción de un miembro de la interfaz base. Puede establecer la propiedad "Incrustar tipos de interoperabilidad" en false.
it: Non è possibile incorporare il tipo '{0}' perché contiene una nuova astrazione di un membro dell'interfaccia di base. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' には基底インターフェイスからのメンバーの再抽象化があるため、この型を埋め込むことはできません。'相互運用型の埋め込み' プロパティを false に設定することをご検討ください。
ko: '{0}' 형식에는 기본 인터페이스 멤버의 재추상화가 있으므로 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정해 보세요.
pl: Nie można osadzić typu „{0}”, ponieważ zawiera ponowną abstrakcję składowej z interfejsu podstawowego. Rozważ ustawienie właściwości „Osadź typy międzyoperacyjne” na wartość false.
pt_br: O tipo '{0}' não pode ser inserido porque tem uma nova abstração de um membro da interface base. Considere a configuração da propriedade 'Embed Interop Types' como false.
ru: Невозможно внедрить тип "{0}", так как он переопределяет абстракцию элемента базового интерфейса. Попробуйте задать для свойства "Внедрить типы взаимодействия" значение false (ложь).
tr: '{0}' türünün temel arabirimden yeniden soyutlanmış bir üyesi olduğundan bu tür eklenemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入类型“{0}”，因为它有基本接口成员的重新抽象。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 因為類型 '{0}' 有重新抽象成員 (來自基底介面)，所以無法內嵌。請考慮將 [內嵌 Interop 類型] 屬性設為 false。

# ERR_RequiredMemberMustBeSet
source: Required member '{0}' must be set in the object initializer or attribute arguments.
es: El miembro requerido '{0}' debe establecerse en el inicializador de objeto o en los argumentos de atributo.
it: Il membro obbligatorio '{0}' deve essere impostato nell'inizializzatore di oggetto o negli argomenti dell'attributo.
ko: 필수 멤버 '{0}'은(는) 개체 이니셜라이저 또는 특성 인수에서 설정해야 합니다.
pl: Wymagana składowa „{0}” musi być ustawiona w inicjatorze obiektu lub argumentach atrybutów.
ru: Обязательный элемент "{0}" должен быть установлен в инициализаторе объекта или аргументах атрибута.
tr: Gerekli '{0}' üyesi nesne başlatıcısında veya öznitelik bağımsız değişkeninde ayarlanmış olmalıdır.
zh_hant: 必要成員 '{0}' 必須在物件初始設定式或屬性引數中進行設定。

# ERR_RequiredMembersInvalid
source: The required members list for '{0}' is malformed and cannot be interpreted.
es: La lista de miembros necesarios para '{0}' tiene un formato incorrecto y no se puede interpretar.
it: L'elenco dei membri obbligatori per '{0}' non è valido e non può essere interpretato.
ko: '{0}'에 대한 필수 구성원 목록 형식이 잘못되어 해석할 수 없습니다.
pl: Lista wymaganych składowych dla „{0}” jest źle sformułowana i nie można jej zinterpretować.
ru: Неправильный формат списка обязательных элементов для "{0}", его не удается интерпретировать.
tr: '{0}' için gerekli üye listesi hatalı biçimlendirilmiş ve yorumlanamıyor.
zh_hant: '{0}' 的必要成員清單格式錯誤，無法解譯。

# ERR_EmbeddedAttributeMustFollowPattern
source: The type 'Microsoft.CodeAnalysis.EmbeddedAttribute' must be non-generic, Friend, NotInheritable, have a Public parameterless constructor, inherit from System.Attribute, and be able to be applied to any type
es: El tipo 'Microsoft.CodeAnalysis.EmbeddedAttribute' debe ser no genérico, Friend, NotInheritable, tener un constructor sin parámetros Public, heredar de System.Attribute y poder aplicarse a cualquier tipo
zh_hant: 類型 'Microsoft.CodeAnalysis.EmbeddedAttribute' 必須是非泛型、好友、NotInheritable、具有公用無參數建構函式、繼承自 System.Attribute，而且可以套用到任何類型

# ERR_RuntimeDoesNotSupportDefaultInterfaceImplementation
source: Target runtime doesn't support default interface implementation.
cs: Cílový modul runtime nepodporuje implementaci výchozího rozhraní.
de: Die Standardschnittstellenimplementierung wird von der Zielruntime nicht unterstützt.
es: El tiempo de ejecución de destino no admite la implementación de interfaz predeterminada.
it: Il runtime di destinazione non supporta l'implementazione di interfaccia predefinita.
ja: ターゲット ランタイムは、既定のインターフェイスの実装をサポートしていません。
ko: 대상 런타임이 기본 인터페이스 구현을 지원하지 않습니다.
pl: Docelowe środowisko uruchomieniowe nie obsługuje domyślnej implementacji interfejsu.
pt_br: O runtime de destino não é compatível com a implementação de interface padrão.
ru: Целевая среда выполнения не поддерживает реализацию интерфейса по умолчанию.
tr: Hedef çalışma zamanı varsayılan arabirim uygulamasını desteklemiyor.
zh_hans: 目标运行时不支持默认接口实现。
zh_hant: 目標執行階段不支援預設介面實作。

# ERR_RuntimeDoesNotSupportProtectedAccessForInterfaceMember
source: Target runtime doesn't support 'Protected', 'Protected Friend', or 'Private Protected' accessibility for a member of an interface.
cs: Cílový modul runtime nepodporuje přístupnost Protected, Protected Friend nebo Private Protected pro člena rozhraní.
de: Die Zielruntime bietet keine Unterstützung für die Zugriffsmöglichkeiten "Protected", "Protected Friend" oder "Private Protected" für einen Member einer Schnittstelle.
es: El entorno de ejecución de destino no admite la accesibilidad de tipo "Protected", "Protected Friend" o "Private Protected" para un miembro de una interfaz.
it: Il runtime di destinazione non supporta l'accessibilità 'Protected', 'Protected Friend' o 'Private Protected' per un membro di un'interfaccia.
ja: ターゲット ランタイムは、インターフェイスのメンバーの 'Protected'、'Protected Friend'、'Private Protected' のアクセシビリティをサポートしていません。
ko: 대상 런타임은 인터페이스의 멤버에 대해 'Protected', 'Protected Friend' 또는 'Private Protected' 접근성을 지원하지 않습니다.
pl: Docelowe środowisko uruchomieniowe nie obsługuje poziomu dostępu „Protected”, „Protected Friend” ani „Private Protected” dla składowej interfejsu.
pt_br: O tempo de execução de destino não dá suporte à acessibilidade 'Protected', 'Protected Friend' ou 'Private Protected' para um membro de uma interface.
ru: Целевая среда выполнения не поддерживает доступ "Protected", "Protected Friend" или "Private Protected" для элемента интерфейса.
tr: Hedef çalışma zamanı, bir arabirimin üyesi için 'Protected', 'Protected Friend' veya 'Private Protected' erişilebilirliğini desteklemez.
zh_hans: 目标运行时不支持对接口的成员使用 "Protected"、"Protected Friend" 或 "Private Protected" 辅助功能。
zh_hant: 目標執行階段不支援對介面成員的 'Protected'、'Protected Friend' 或 'Private Protected' 存取範圍。
