Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NameNotMember2
source: '{0}' is not a member of '{1}'.
cs: '{0} není člen u {1}.
de: '"{0}" ist kein Member von "{1}".
es: '{0}' no es un miembro de '{1}'.
fr: '{0}' n'est pas un membre de '{1}'.
it: '{0}' non è un membro di '{1}'.
ja: '{0}' は '{1}' のメンバーではありません。
ko: '{0}'은(는) '{1}'의 멤버가 아닙니다.
pl: 'Element „{0}” nie jest składową elementu „{1}”.
pt_br: "{0}" não é um membro de "{1}".
ru: "{0}" не является членом "{1}".
tr: '{0}', bir '{1}' üyesi değil.
zh_hans: '“{0}”不是“{1}”的成员。
zh_hant: '{0}' 不是 '{1}' 的成員。

# ERR_EndClassNoClass
source: 'End Class' must be preceded by a matching 'Class'.
cs: 'Klíčovému slovu End Class musí předcházet párové klíčové slovo Class.
de: '"End Class" muss ein entsprechendes "Class" voranstehen.
es: 'End Class' debe ir precedida de una instrucción 'Class' correspondiente.
fr: 'End Class' doit être précédé d'un 'Class' correspondant.
it: 'End Class' deve essere preceduto da un 'Class' corrispondente.
ja: 'End Class' の前には、対応する 'Class' を指定しなければなりません。
ko: 'End Class'는 짝이 되는 'Class' 뒤에 와야 합니다.
pl: 'Instrukcja End Class musi być poprzedzona odpowiadającą jej instrukcją Class.
pt_br: 'End Class' deve ser precedido por 'Class' correspondente.
ru: 'Оператору "End Class" должен предшествовать соответствующий оператор "Class".
tr: 'End Class' öncesinde eşleşen bir 'Class' olmalıdır.
zh_hans: '"End Class" 前面必须是匹配的 "Class"。
zh_hant: 'End Class' 之前必須搭配相對應的 'Class'。

# ERR_BadClassFlags1
source: Classes cannot be declared '{0}'.
cs: Pro třídy nejde použít deklaraci {0}.
de: Klassen können nicht als "{0}" deklariert werden.
es: Las clases no se pueden declarar como '{0}'.
fr: Les classes ne peuvent pas être déclarées '{0}'.
it: Le classi non possono essere dichiarate come '{0}'.
ja: クラスを '{0}' として宣言することはできません。
ko: 클래스는 '{0}'(으)로 선언할 수 없습니다.
pl: Klas nie można deklarować jako „{0}”.
pt_br: Classes não podem ser declaradas "{0}".
ru: Классы не могут быть объявлены "{0}".
tr: Sınıflar '{0}' olarak bildirilemez.
zh_hans: 类不能声明为“{0}”。
zh_hant: 類別不可宣告為 '{0}'。

# ERR_ImportsMustBeFirst
source: 'Imports' statements must precede any declarations.
cs: 'Příkazy Imports musí předcházet před všemi deklaracemi.
de: 'Imports-Anweisungen müssen vor Deklarationen stehen.
es: 'Las instrucciones 'Imports' deben preceder a las declaraciones.
fr: 'Des instructions 'Imports' doivent précéder toutes les déclarations.
it: 'Le istruzioni 'Imports' devono precedere qualsiasi dichiarazione.
ja: 'Imports' ステートメントは、宣言の前に記述しなければなりません。
ko: 'Imports' 문은 모든 선언의 앞에 와야 합니다.
pl: 'Instrukcje Imports muszą znajdować się przed wszelkimi deklaracjami.
pt_br: 'Instruções 'Imports' devem preceder qualquer declaração.
ru: 'Операторы "Imports" должны указываться до любых объявлений.
tr: 'Imports' deyimleri tüm bildirimlerden önce gelmelidir.
zh_hans: '“Imports”语句前面必须是声明。
zh_hant: 'Imports' 陳述式必須在任何宣告之前。

# ERR_NonNamespaceOrClassOnImport2
source: '{1}' for the Imports '{0}' does not refer to a Namespace, Class, Structure, Enum or Module.
cs: '{1} importů {0} neodkazuje na obor názvů, třídu, strukturu, výčet ani modul.
de: '"{1}" für Imports "{0}" verweist weder auf einen Namespace noch auf eine Klasse, Struktur, Enumeration oder ein Modul.
es: '{1}' para la instrucción Imports '{0}' no hace referencia a un espacio de nombres, una clase, una estructura, una enumeración ni un módulo.
fr: '{1}' pour les Imports '{0}' ne fait pas référence à un Namespace, Class, Structure, Enum ou Module.
it: '{1}' per l'istruzione Imports '{0}' non si riferisce a uno spazio dei nomi, a una classe, a una struttura, a un'enumerazione o a un modulo.
ja: 'インポート '{0}' の '{1}' は、Namespace、Class、Structure、Enum、または Module を参照していません。
ko: 'Imports '{0}'의 '{1}'은(는) Namespace, Class, Structure, Enum 또는 Module을 참조하지 않습니다.
pl: Element „{1}” dla operacji importu „{0}” nie odwołuje się do przestrzeni nazw, klasy, struktury, wyliczenia ani modułu.
pt_br: "{1}" para Imports "{0}" não se refere a um Namespace, Classe, Estrutura, Enum ou Módulo.
ru: "{1}" для Imports "{0}" не ссылается на Namespace, Class, Structure, Enum или Module.
tr: 'Imports '{0}' için '{1}', bir Namespace, Class, Structure, Enum veya Module başvurusu yapmıyor.
zh_hans: 'Imports “{0}”的“{1}”不引用命名空间、类、结构、枚举或模块。
zh_hant: 'Imports '{0}' 的 '{1}' 並未參考 Namespace、Class、Structure、Enum 或 Module。

# ERR_TypecharNotallowed
source: Type declaration characters are not valid in this context.
cs: Znaky deklarace typů nejsou v tomto kontextu platné.
de: Typendeklarationszeichen sind in diesem Kontext nicht gültig.
es: Los caracteres de declaración de tipos no son válidos en este contexto.
fr: Les caractères de déclaration de type ne sont pas valides dans ce contexte.
it: I caratteri di dichiarazione tipo non sono validi in questo contesto.
ja: 型宣言文字は、このコンテキストでは有効ではありません。
ko: 이 컨텍스트에서는 형식 선언 문자를 사용할 수 없습니다.
pl: Znaki deklaracji typu nie są prawidłowe w tym kontekście.
pt_br: Caracteres de declaração de tipo não são válidos neste contexto.
ru: Символы объявления типа недопустимы в этом контексте.
tr: Tür bildirim karakterleri bu bağlamda geçerli değil.
zh_hans: 类型声明字符在此上下文中无效。
zh_hant: 類型宣告字元在此內容中無效。

# ERR_ObjectReferenceNotSupplied
source: Reference to a non-shared member requires an object reference.
cs: Odkaz na nesdíleného člena vyžaduje odkaz na objekt.
de: Der Verweis auf einen nicht freigegebenen Member erfordert einen Objektverweis.
es: La referencia a un miembro no compartido requiere una referencia de objeto.
fr: Une référence à un membre non partagé requiert une référence d'objet.
it: Il riferimento a un membro non condiviso richiede un riferimento a un oggetto.
ja: 非共有メンバーを参照するには、オブジェクト参照が必要です。
ko: 공유되지 않는 멤버에 대한 참조에 개체 참조가 필요합니다.
pl: Odwołanie do nieudostępnionej składowej wymaga odwołania do obiektu.
pt_br: Referência para um membro não compartilhado requer uma referência de objeto.
ru: Для ссылки на член, не используемый совместно, требуется ссылка на объект.
tr: Paylaşılmayan bir üyeye başvuru, nesne başvurusu gerektirir.
zh_hans: 对非共享成员的引用要求对象引用。
zh_hant: 參考非共用成員需要物件參考。

# ERR_MyClassNotInClass
source: 'MyClass' cannot be used outside of a class.
cs: 'Klíčové slovo MyClass nejde použít vně třídy.
de: '"MyClass" kann nicht außerhalb einer Klasse verwendet werden.
es: 'MyClass' no se puede usar fuera de una clase.
fr: 'MyClass' ne peut pas être utilisé à l'extérieur d'une classe.
it: 'MyClass' non può essere usato all'esterno di una classe.
ja: 'MyClass' をクラスの外で使用することはできません。
ko: 'MyClass'는 클래스 외부에 사용할 수 없습니다.
pl: 'Nie można użyć instrukcji MyClass poza klasą.
pt_br: 'MyClass' não pode ser usado fora de uma classe.
ru: '"MyClass" не может использоваться вне класса.
tr: 'MyClass' sınıf dışında kullanılamaz.
zh_hans: '"MyClass" 不能在类的外部使用。
zh_hant: 'MyClass' 無法在類別外使用。

# ERR_IndexedNotArrayOrProc
source: Expression is not an array or a method, and cannot have an argument list.
cs: Výraz není pole ani metoda, a proto nemůže mít seznam argumentů.
de: Der Ausdruck ist kein Array oder keine Methode und kann keine Argumentliste haben.
es: La expresión no es una matriz ni un método y no puede tener una lista de argumentos.
fr: L'expression n'est pas un tableau ni une méthode et ne peut pas avoir de liste d'arguments.
it: L'espressione non è una matrice o un metodo e non può avere un elenco di argomenti.
ja: 式は、配列またはメソッドではありません。引数リストを指定することはできません。
ko: 식이 배열 또는 메서드가 아니므로 인수 목록을 사용할 수 없습니다.
pl: Wyrażenie nie jest tablicą ani metodą i nie może mieć listy argumentów.
pt_br: Expressão não é matriz ou método, e não pode ser lista de argumentos.
ru: Выражение не является массивом или методом и не может иметь список аргументов.
tr: İfade bir dizi veya yöntem değil; ifadenin bir bağımsız değişken listesi olamaz.
zh_hans: 表达式不是数组或方法，不能具有参数列表。
zh_hant: 運算式不是陣列或方法，所以不可以有引數清單。

# ERR_EventSourceIsArray
source: 'WithEvents' variables cannot be typed as arrays.
cs: 'Proměnné s deklarací WithEvents nemůžou být typu pole.
de: 'WithEvents-Variablen können nicht als Arrays typisiert werden.
es: 'Las variables 'WithEvents' no se pueden escribir como matrices.
fr: 'Les variables 'WithEvents' ne peuvent pas être de type tableau.
it: 'Le variabili 'WithEvents' non possono essere tipizzate come matrici.
ja: 'WithEvents' 変数を配列として型指定することはできません。
ko: 'WithEvents' 변수는 배열로 형식화할 수 없습니다.
pl: 'Zmienne WithEvents nie mogą być zmiennymi typu tablicowego.
pt_br: 'Variáveis 'WithEvents' não podem ser digitadas como matrizes.
ru: 'Переменные с модификатором "WithEvents" не могут являться массивами.
tr: 'WithEvents' değişkenlerine dizi türü verilemez.
zh_hans: '“WithEvents”变量不能类型化为数组。
zh_hant: 'WithEvents' 變數的類型不可以是陣列。

# ERR_SharedConstructorWithParams
source: Shared 'Sub New' cannot have any parameters.
cs: Sdílená procedura Sub New nemůže mít žádné parametry.
de: Shared "Sub New" kann keine Parameter haben.
es: El constructor 'Sub New' compartido no puede tener ningún parámetro.
fr: Un 'Sub New' partagé ne peut pas avoir de paramètre.
it: Sub New' condiviso non può accettare parametri.
ja: 共有 'Sub New' にパラメーターを指定することはできません。
ko: Shared 'Sub New'에는 매개 변수를 사용할 수 없습니다.
pl: Udostępniony element Sub New nie może mieć żadnych parametrów.
pt_br: Sub New' compartilhado não pode ter nenhum parâmetro.
ru: Общий конструктор "Sub New" не может иметь параметров.
tr: Paylaşılan 'Sub New' parametre içeremez.
zh_hans: 共享的 "Sub New" 不能具有任何参数。
zh_hant: 共用的 'Sub New' 不可以有任何參數。

# ERR_SharedConstructorIllegalSpec1
source: Shared 'Sub New' cannot be declared '{0}'.
cs: Pro sdílenou proceduru Sub New nejde použít deklaraci {0}.
de: Shared "Sub New" kann nicht als "{0}" deklariert werden.
es: El 'Sub New' compartido no se puede declarar como '{0}'.
fr: Un 'Sub New' partagé ne peut pas être déclaré '{0}'.
it: L'elemento 'Sub New' condiviso non può essere dichiarato come '{0}'.
ja: 共有 'Sub New' を '{0}' として宣言することはできません。
ko: 공유 'Sub New'는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować udostępnianego elementu „Sub New” jako „{0}”.
pt_br: "Sub New" compartilhado não pode ser declarado "{0}".
ru: Невозможно объявить общий "Sub New" как "{0}".
tr: Paylaşılan 'Sub New' '{0}' olarak bildirilemez.
zh_hans: 共享的“Sub New”不能声明为“{0}”。
zh_hant: 共用的 'Sub New' 不可宣告為 '{0}'。

# ERR_ExpectedEndClass
source: 'Class' statement must end with a matching 'End Class'.
cs: 'Klíčové slovo Class musí být ukončené párovým klíčovým slovem End Class.
de: '"Class" muss mit einem entsprechenden "End Class" abgeschlossen werden.
es: 'La instrucción 'Class' debe terminar con la instrucción 'End Class' correspondiente.
fr: 'Une instruction 'Class' doit se terminer par un 'End Class' correspondant.
it: 'L'istruzione 'Class' deve terminare con un elemento 'End Class' corrispondente.
ja: 'Class' ステートメントの終わりには、対応する 'End Class' を指定しなければなりません。
ko: 'Class' 문은 짝이 되는 'End Class'로 끝나야 합니다.
pl: 'Instrukcja Class musi być zakończona odpowiadającą jej instrukcją End Class.
pt_br: 'Instrução 'Class' deve terminar com um 'End Class' correspondente.
ru: 'Блок Class должен заканчиваться соответствующим оператором End Class.
tr: 'Class' deyimi eşleşen bir 'End Class' ile bitmelidir.
zh_hans: '“Class”语句必须以匹配的“End Class”结束。
zh_hant: 'Class' 陳述式之後必須搭配相對應的 'End Class'。

# ERR_UnaryOperand2
source: Operator '{0}' is not defined for type '{1}'.
cs: Operátor {0} není definovaný pro typ {1}.
de: Der {0}-Operator ist für den Typ "{1}" nicht definiert.
es: El operador '{0}' no está definido para el tipo '{1}'.
fr: L'opérateur '{0}' n'est pas défini pour le type '{1}'.
it: L'operatore '{0}' non è definito per il tipo '{1}'.
ja: 演算子 '{0}' は型 '{1}' に対して定義されていません。
ko: '{1}' 형식에 대한 '{0}' 연산자가 정의되지 않았습니다.
pl: Operator „{0}” nie jest zdefiniowany dla typu „{1}”.
pt_br: O operador "{0}" não está definido para o tipo "{1}".
ru: Оператор "{0}" не определен для типа "{1}".
tr: '{0}' işleci '{1}' türü için tanımlı değil.
zh_hans: 没有为类型“{1}”定义运算符“{0}”。
zh_hant: 未對類型 '{1}' 定義運算子 '{0}'。

# ERR_BadFlagsWithDefault1
source: 'Default' cannot be combined with '{0}'.
cs: 'Klíčové slovo Default nejde kombinovat se specifikátorem {0}.
de: '"{0}" kann nicht mit "Default" kombiniert werden.
es: 'Default' no se puede combinar con '{0}'.
fr: 'Default' ne peut pas être combiné avec '{0}'.
it: 'Non è possibile combinare 'Default' con '{0}'.
ja: 'Default' を '{0}' と組み合わせて使用することはできません。
ko: 'Default'는 '{0}'과(와) 함께 사용할 수 없습니다.
pl: 'Nie można łączyć instrukcji „Default” z elementem „{0}”.
pt_br: "Default" não pode ser combinado com "{0}".
ru: '"Default" не может использоваться вместе с "{0}".
tr: 'Default', '{0}' ile birleştirilemez.
zh_hans: '“Default”不能与“{0}”组合。
zh_hant: 'Default' 無法和 '{0}' 相結合。

# ERR_VoidValue
source: Expression does not produce a value.
cs: Výsledkem výrazu není hodnota.
de: Der Ausdruck ergibt keinen Wert.
es: La expresión no genera un valor.
fr: Cette expression ne produit pas de valeur.
it: L'espressione non produce un valore.
ja: 式は値を生成しません。
ko: 식이 값을 산출하지 않습니다.
pl: Wyrażenie nie zwraca wartości.
pt_br: Expressão não produz um valor.
ru: Выражение не порождает значение.
tr: İfade bir değer üretmiyor.
zh_hans: 表达式不产生值。
zh_hant: 運算式沒有產生值。

# ERR_ConstructorFunction
source: Constructor must be declared as a Sub, not as a Function.
cs: Pro konstruktor se musí použít deklarace Sub, nikoli Function.
de: Ein Konstruktor muss als "Sub" und nicht als "Function" deklariert werden.
es: El constructor debe declararse como Sub y no como Function.
fr: Le constructeur doit être déclaré en tant que Sub, et non Function.
it: Il costruttore deve essere dichiarato come Sub e non come Function.
ja: コンストラクターは、Function ではなく Sub として宣言しなければなりません。
ko: 생성자는 Function이 아니라 Sub로 선언되어야 합니다.
pl: Konstruktor musi być zadeklarowany jako procedura, a nie funkcja.
pt_br: O construtor deve ser declarado como um Sub, não com uma Function.
ru: Конструктор должен объявляться как подпрограмма (Sub), а не как функция (Function).
tr: Oluşturucu Function olarak değil, Sub olarak bildirilmelidir.
zh_hans: 构造函数必须声明为 Sub，而不是 Function。
zh_hant: 建構函式必須宣告為 Sub，而不是 Function。

# ERR_InvalidLiteralExponent
source: Exponent is not valid.
cs: Exponent není platný.
de: Der Exponent ist ungültig.
es: El exponente no es válido.
fr: Exposant non valide.
it: L'esponente non è valido.
ja: 指数が有効ではありません。
ko: 지수가 잘못되었습니다.
pl: Wykładnik nie jest prawidłowy.
pt_br: Expoente inválido.
ru: Показатель степени является недопустимым.
tr: Üs geçerli değil.
zh_hans: 指数无效。
zh_hant: 指數無效。

# ERR_NewCannotHandleEvents
source: 'Sub New' cannot handle events.
cs: 'Procedura Sub New nemůže zpracovávat události.
de: '"Sub New" kann keine Ereignisse behandeln.
es: 'Sub New' no puede administrar eventos.
fr: 'Sub New' ne peut pas gérer d'événements.
it: 'Sub New' non può gestire eventi.
ja: 'Sub New' でイベントを処理することはできません。
ko: 'Sub New'는 이벤트를 처리할 수 없습니다.
pl: 'Element Sub New nie może obsługiwać zdarzeń.
pt_br: 'Sub New' não pode manipular eventos.
ru: 'Конструктор "Sub New" не может обрабатывать события.
tr: 'Sub New' olay işleyemez.
zh_hans: '"Sub New" 无法处理事件。
zh_hant: 'Sub New' 無法處理事件。

# ERR_CircularEvaluation1
source: Constant '{0}' cannot depend on its own value.
cs: Konstanta {0} nemůže záviset na vlastní hodnotě.
de: Die Konstante "{0}" kann nicht von ihrem eigenen Wert abhängen.
es: La constante '{0}' no puede depender de su propio valor.
fr: La constante '{0}' ne peut pas dépendre de sa propre valeur.
it: La costante '{0}' non può dipendere dal proprio valore.
ja: 定数 '{0}' が、それ自体の値に依存することはできません。
ko: '{0}' 상수는 자신의 값에 종속될 수 없습니다.
pl: Stała „{0}” nie może zależeć od własnej wartości.
pt_br: Constante "{0}" não pode depender do seu próprio valor.
ru: Константа "{0}" не может зависеть от своего собственного значения.
tr: '{0}' sabiti kendi değerine bağımlı olamaz.
zh_hans: 常量“{0}”不能依赖自身的值。
zh_hant: 常數 '{0}' 無法相依其本身的值。

# ERR_BadFlagsOnSharedMeth1
source: 'Shared' cannot be combined with '{0}' on a method declaration.
cs: 'Klíčové slovo Shared nejde kombinovat se specifikátorem {0} v deklaraci metody.
de: '"{0}" kann in einer Methodendeklaration nicht mit "Shared" kombiniert werden.
es: 'Shared' no se puede combinar con '{0}' en una declaración de método.
fr: 'Shared' ne peut pas être combiné avec '{0}' pour une déclaration de méthode.
it: 'Non è possibile combinare 'Shared' con '{0}' in una dichiarazione di metodo.
ja: 'メソッド宣言で、'Shared' を '{0}' と組み合わせて使用することはできません。
ko: 'Shared'는 메서드 선언에서 '{0}'과(와) 함께 사용할 수 없습니다.
pl: 'Nie można łączyć instrukcji „Shared” z elementem „{0}” w deklaracji metody.
pt_br: "Shared" não pode ser combinado com "{0}" em uma declaração de método.
ru: '"Shared" не может использоваться вместе с "{0}" в объявлении метода.
tr: 'Yöntem bildiriminde 'Shared' '{0}' ile birleştirilemez.
zh_hans: '“Shared”不能与方法声明上的“{0}”组合。
zh_hant: 'Shared' 無法在方法宣告上和 '{0}' 相結合。

# ERR_BadFlagsOnSharedProperty1
source: 'Shared' cannot be combined with '{0}' on a property declaration.
cs: 'Klíčové slovo Shared nejde kombinovat se specifikátorem {0} v deklaraci vlastnosti.
de: '"{0}" kann in einer Eigenschaftendeklaration nicht mit "Shared" kombiniert werden.
es: 'Shared' no se puede combinar con '{0}' en una declaración de propiedad.
fr: 'Shared' ne peut pas être combiné avec '{0}' pour une déclaration de propriété.
it: 'Non è possibile combinare 'Shared' con '{0}' in una dichiarazione di proprietà.
ja: 'プロパティ宣言で、'Shared' を '{0}' と組み合わせて使用することはできません。
ko: 'Shared'는 속성 선언에서 '{0}'과(와) 함께 사용할 수 없습니다.
pl: 'Nie można łączyć instrukcji „Shared” z elementem „{0}” w deklaracji właściwości.
pt_br: "Shared" não pode ser combinado com "{0}" em uma declaração de propriedade.
ru: '"Shared" не может использоваться вместе с "{0}" в объявлении свойства.
tr: 'Özellik bildiriminde 'Shared' '{0}' ile birleştirilemez.
zh_hans: '“Shared”不能与属性声明上的“{0}”组合。
zh_hant: 'Shared' 無法在屬性宣告上與 '{0}' 相結合。

# ERR_BadFlagsOnStdModuleProperty1
source: Properties in a Module cannot be declared '{0}'.
cs: Pro vlastnosti v modulu nejde použít deklaraci {0}.
de: Eigenschaften in einem Modul können nicht als "{0}" deklariert werden.
es: Las propiedades de un módulo no se pueden declarar como '{0}'.
fr: Les propriétés d'un module ne peuvent pas être déclarées '{0}'.
it: Le proprietà in un modulo non possono essere dichiarate come '{0}'.
ja: モジュールのプロパティを '{0}' として宣言することはできません。
ko: 모듈의 속성은 '{0}'(으)로 선언할 수 없습니다.
pl: Właściwości w module nie mogą być zadeklarowane jako „{0}”.
pt_br: Propriedades em um Módulo não podem ser declaradas "{0}".
ru: Свойства в модуле не могут объявляться как "{0}".
tr: Modül içindeki özellikler '{0}' olarak bildirilemez.
zh_hans: 模块中的属性不能声明为“{0}”。
zh_hant: 模組中的屬性不可宣告為 '{0}'。

# ERR_SharedOnProcThatImpl
source: Methods or events that implement interface members cannot be declared 'Shared'.
cs: Pro metody nebo události, které implementují členy rozhraní, nejde použít deklaraci Shared.
de: Methoden oder Ereignisse, die Schnittstellenmember implementieren, können nicht als "Shared" deklariert werden.
es: Los métodos o eventos que implementan miembros de interfaz no se pueden declarar como 'Shared'.
fr: Les méthodes ou événements qui implémentent des membres d'interface ne peuvent pas être déclarés 'Shared'.
it: I metodi o gli eventi che implementano membri di interfaccia non possono essere dichiarati come 'Shared'.
ja: インターフェイス メンバーを実装するメソッドまたはイベントを、'Shared' として宣言することはできません。
ko: 인터페이스 멤버를 구현하는 메서드 또는 이벤트는 'Shared'로 선언할 수 없습니다.
pl: Metody lub zdarzenia, które implementują składowe interfejsu, nie mogą być zadeklarowane jako Shared.
pt_br: Métodos ou eventos que implementam membros de interface não podem ser declarados 'Shared'.
ru: Методы или события, которые реализуют члены интерфейса, не могут объявляться как "Shared".
tr: Arabirim üyelerini uygulayan yöntemler veya olaylar 'Shared' olarak bildirilemez.
zh_hans: 实现接口成员的方法或事件不能声明为 "Shared"。
zh_hant: 實作介面成員的方法或事件不可以宣告為 'Shared'。

# ERR_NoWithEventsVarOnHandlesList
source: Handles clause requires a WithEvents variable defined in the containing type or one of its base types.
cs: Klauzule Handles vyžaduje proměnnou WithEvents definovanou v nadřazeném typu nebo v některém z jeho základních typů.
de: Die Handles-Klausel erfordert eine WithEvents-Variable, die im enthaltenden Typ oder einem seiner Basistypen definiert wird.
es: La cláusula Handles requiere una variable WithEvents definida en el tipo contenedor o en uno de sus tipos base.
fr: La clause Handles requiert une variable WithEvents définie dans le type conteneur ou l'un de ses types de base.
it: La clausola Handles richiede una variabile WithEvents definita nel tipo che la contiene o in uno dei suoi tipi di base.
ja: Handles 句には、それを含む型または基本型の 1 つで定義された WithEvents 変数が必要です。
ko: Handles 절에는 포함하는 형식 또는 해당 형식의 기본 형식 중 하나에 정의된 WithEvents 변수가 필요합니다.
pl: Klauzula Handles wymaga zmiennej WithEvents zdefiniowanej w zawierającym ją typie lub jednym z jej typów podstawowych.
pt_br: A cláusula de identificadores requer uma variável WithEvents definida no tipo recipiente ou em um de seus tipos base.
ru: Для предложения Handles требуется переменная с модификатором WithEvents, определенная во вмещающем типе или в одном из его базовых типов.
tr: Handles yan tümcesi, kapsayan türde veya temel türlerinden birinde tanımlanan WithEvents değişkeni gerektirir.
zh_hans: Handles 子句要求一个在包含类型或它的某个基类型中定义的 WithEvents 变量。
zh_hant: Handles 子句需要 WithEvents 變數，該變數定義於包含類型或它的一種基底類型中。

# ERR_InheritanceAccessMismatch5
source: '{0}' cannot inherit from {1} '{2}' because it expands the access of the base {1} to {3} '{4}'.
cs: '{0} nemůže dědit z {1} - {2}, protože rozšiřuje přístup základní třídy {1} na {3} - {4}.
de: '"{0}" erweitert den Zugriff der Basis {1} auf {3} "{4}" und kann daher nicht von {1} "{2}" erben.
es: '{0}' no puede heredar de {1} '{2}' porque expande el acceso de la base {1} a {3} '{4}'.
fr: '{0}' ne peut pas hériter de {1} '{2}', car il étend l'accès du {1} de base à {3} '{4}'.
it: '{0}' non può ereditare da {1} '{2}' perché espande l'accesso dell'elemento {1} base a {3} '{4}'.
ja: 'ベース {1} のアクセスを {3} '{4}' へ展開しているため、'{0}' は {1} '{2}' から継承できません。
ko: '{0}'은(는) 기본 {1}의 액세스를 {3} '{4}'(으)로 확장하므로 {1} '{2}'에서 상속할 수 없습니다.
pl: 'Element „{0}” nie może dziedziczyć po elemencie {1} „{2}”, ponieważ rozszerza on dostęp podstawowego elementu {1} do {3} „{4}”.
pt_br: "{0}" não pode herdar de {1} "{2}" porque ele expande o acesso da base {1} para {3} "{4}".
ru: "{0}" не может наследовать от {1} "{2}", поскольку он расширяет доступ базы {1} до {3} "{4}".
tr: 'Temel {1} erişimini {3} '{4}' olarak genişlettiğinden '{0}', {1} '{2}' öğesinden özellik devralamaz.
zh_hans: '“{0}”将对基 {1} 的访问扩展到 {3}“{4}”，因此无法从 {1}“{2}”继承。
zh_hant: '{0}' 無法繼承自 {1} '{2}'，因為它會將基底 {1} 的存取展開至 {3} '{4}'。

# ERR_NarrowingConversionDisallowed2
source: Option Strict On disallows implicit conversions from '{0}' to '{1}'.
cs: Direktiva Option Strict On nepovoluje implicitní převod typu {0} na typ {1}.
de: "Option Strict On" lässt keine impliziten Konvertierungen von "{0}" in "{1}" zu.
es: Option Strict On no permite conversiones implícitas de '{0}' a '{1}'.
fr: Option Strict On interdit les conversions implicites de '{0}' en '{1}'.
it: Option Strict On non consente conversioni implicite da '{0}' a '{1}'.
ja: Option Strict On では '{0}' から '{1}' への暗黙的な変換は許可されていません。
ko: Option Strict On에서는 '{0}'에서 '{1}'(으)로 암시적으로 변환할 수 없습니다.
pl: Ustawienie „Option Strict On” uniemożliwia niejawne konwersje z elementu „{0}” na „{1}”.
pt_br: Opção Strict On não permite conversões implícitas de "{0}" para "{1}".
ru: Option Strict On не разрешает неявные преобразования "{0}" к "{1}".
tr: Option Strict On, '{0}' - '{1}' örtük dönüştürmesine izin vermiyor.
zh_hans: Option Strict On 不允许从“{0}”到“{1}”的隐式转换。
zh_hant: Option Strict 為 On 時，不可進行 '{0}' 至 '{1}' 的隱含轉換。
