Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidAttributeValue2
source: Attribute value is not valid; expecting '{0}' or '{1}'.
cs: Hodnota atributu není platná; očekávalo se: {0} nebo {1}.
de: Ungültiger Attributwert, "{0}" oder "{1}" erwartet.
es: El valor del atributo no es válido; se espera '{0}' o '{1}'.
fr: Valeur d'attribut non valide ; '{0}' ou '{1}' attendu.
it: Il valore di attributo non è valido. È previsto '{0}' o '{1}'.
ja: 属性の値が無効です。'{0}' または '{1}' である必要があります。
ko: 특성 값이 잘못되었습니다. '{0}'또는 '{1}'이(가) 필요합니다.
pl: Wartość atrybutu jest nieprawidłowa, oczekiwano „{0}” lub „{1}”.
pt_br: O valor do atributo não é válido; esperando "{0}" ou "{1}".
ru: Недопустимое значение атрибута; ожидается значение "{0}" или "{1}".
tr: Öznitelik değeri geçerli değil; '{0}' veya '{1}' bekleniyor.
zh_hans: 属性值无效；应为“{0}”或“{1}”。
zh_hant: 屬性值無效，必須是 '{0}' 或 '{1}'。

# ERR_ReservedXmlNamespace
source: Prefix '{0}' cannot be bound to namespace name reserved for '{1}'.
cs: Předponu {0} nejde svázat s názvem oboru názvů rezervovaným pro {1}.
de: Das Präfix "{0}" kann nicht an den für "{1}" reservierten Namespacenamen gebunden werden.
es: El prefijo '{0}' no se puede enlazar al nombre de un espacio de nombres reservado para '{1}'.
fr: Le préfixe '{0}' ne peut pas être lié au nom d'espace de noms réservé pour '{1}'.
it: Non è possibile associare il prefisso '{0}' al nome dello spazio dei nomi riservato per '{1}'.
ja: プレフィックス '{0}' は、'{1}' に予約されている名前空間の名前にバインドできません。
ko: '{0}' 접두사는 '{1}'에 사용하도록 예약된 네임스페이스 이름에 바인딩할 수 없습니다.
pl: Nie można powiązać prefiksu „{0}” z nazwą przestrzeni nazw zastrzeżoną dla elementu „{1}”.
pt_br: Prefixo "{0}" não pode ser associado ao nome do namespace reservado para "{1}".
ru: Префикс "{0}" не может быть привязан к имени пространства имен, зарезервированных для "{1}".
tr: '{0}' ön eki '{1}' için ayrılmış ad alanı adına bağımlı olamaz.
zh_hans: 不能将前缀“{0}”绑定到为“{1}”保留的命名空间名称。
zh_hant: 前置詞 '{0}' 無法繫結至為 '{1}' 保留的命名空間名稱。

# ERR_IllegalDefaultNamespace
source: Namespace declaration with prefix cannot have an empty value inside an XML literal.
cs: Deklarace oboru názvů s předponou nemůže obsahovat prázdnou hodnotu uvnitř literálu XML.
de: Eine Namespacedeklaration mit Präfix darf keinen leeren Wert in einem XML-Literal haben.
es: Una declaración de espacio de nombres con prefijo no puede tener un valor vacío en un literal XML.
fr: Une déclaration d'espace de noms avec préfixe ne peut pas avoir une valeur vide dans un littéral XML.
it: La dichiarazione dello spazio dei nomi con prefisso non può avere un valore vuoto all'interno di un valore letterale XML.
ja: プレフィックスを持つ名前空間宣言では、XML リテラル内に空の値を含めることはできません。
ko: 접두사가 있는 네임스페이스 선언에는 XML 리터럴 내에 빈 값을 사용할 수 없습니다.
pl: Deklaracja przestrzeni nazw z prefiksem nie może mieć wartości pustej wewnątrz literału XML.
pt_br: A declaração do namespace com prefixo não pode ter um valor vazio dentro de um literal XML.
ru: Объявление пространства имен вместе с префиксом не может иметь пустое значение внутри XML-литерала.
tr: Önek içeren ad uzayı bildiriminde bir XML sabit değerinde boş değer olamaz.
zh_hans: 带前缀的命名空间声明在 XML 文本中不能有空值。
zh_hant: 具有前置字元的命名空間宣告在 XML 常值中不能有空值。

# ERR_QualifiedNameNotAllowed
source: ':' is not allowed. XML qualified names cannot be used in this context.
cs: 'Znak : není povolený. V tomto kontextu nejde používat kvalifikované názvy XML.
de: '":" ist nicht zulässig. In diesem Kontext können keine qualifizierten XML-Namen verwendet werden.
es: 'No se permite ':'. No se pueden usar nombres XML completos en este contexto.
fr: ':' n'est pas autorisé. Les noms qualifiés XML ne peuvent pas être utilisés dans ce contexte.
it: 'Il segno ':' non è consentito. Non è possibile usare nomi completi XML in questo contesto.
ja: ':' は使用できません。XML 修飾名をこのコンテキストで使用することはできません。
ko: ':'을 사용할 수 없습니다. 이 컨텍스트에서는 정규화된 XML 이름을 사용할 수 없습니다.
pl: 'Znak „:” jest niedozwolony. Nie można używać kwalifikowanych nazw XML w tym kontekście.
pt_br: ':' não é permitido. Não é possível usar nomes qualificados XML neste contexto.
ru: 'Символ ":" не допустим. Не удается использовать уточненные XML-имена в этом контексте.
tr: ':' karakterine izin verilmez. XML tam adları bu bağlamda kullanılamaz.
zh_hans: '不允许使用 ":"。不能在此上下文中使用 XML 限定名称。
zh_hant: '不允許 ':'。XML 限定名稱不能用在此內容中。

# ERR_ExpectedXmlns
source: Namespace declaration must start with 'xmlns'.
cs: Deklarace oboru názvů musí začínat řetězcem xmlns.
de: Die Namespacedeklaration muss mit "xmlns" beginnen.
es: Una declaración de espacio de nombres debe comenzar con 'xmlns'.
fr: Une déclaration d'espace de noms doit commencer par 'xmlns'.
it: La dichiarazione dello spazio dei nomi deve iniziare con 'xmlns'.
ja: 名前空間宣言は 'xmlns' で始まらなければなりません。
ko: 네임스페이스 선언은 'xmlns'로 시작해야 합니다.
pl: Deklaracja przestrzeni nazw musi zaczynać się elementem „xmlns”.
pt_br: A declaração de namespace deve começar com 'xmlns'.
ru: Объявление пространства имен должно начинаться с "xmlns".
tr: Ad alanı bildirimi 'xmlns' ile başlamalıdır.
zh_hans: 命名空间声明必须以“xmlns”开头。
zh_hant: 命名空間宣告必須要使用 'xmlns' 開頭。

# ERR_IllegalXmlnsPrefix
source: Element names cannot use the 'xmlns' prefix.
cs: Názvy prvků nemůžou používat předponu xmlns.
de: In Elementnamen darf das Präfix "xmlns" nicht verwendet werden.
es: Los nombres de elemento no pueden usar el prefijo 'xmlns'.
fr: Les noms d'éléments ne peuvent pas utiliser le préfixe 'xmlns'.
it: Non è possibile usare il prefisso 'xmlns' nei nomi di elemento.
ja: 要素名で 'xmlns' プレフィックスを使用することはできません。
ko: 요소 이름에는 'xmlns' 접두사를 사용할 수 없습니다.
pl: W nazwach elementów nie można używać prefiksu „xmlns”.
pt_br: Nomes de elementos não podem usar o prefixo 'xmlns'.
ru: В именах элементов не может использоваться префикс "xmlns".
tr: Öğe adlarında 'xmlns' öneki kullanılamaz.
zh_hans: 元素名不能使用“xmlns”前缀。
zh_hant: 項目名稱不能使用 'xmlns' 前置字元。

# ERR_XmlFeaturesNotAvailable
source: XML literals and XML axis properties are not available. Add references to System.Xml, System.Xml.Linq, and System.Core or other assemblies declaring System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute and System.Xml.Linq.XNamespace types.
cs: Literály XML a vlastnosti os XML nejsou k dispozici. Přidejte odkazy do System.Xml, System.Xml.Linq a System.Core nebo jiná sestavení deklarující typy System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute a System.Xml.Linq.XNamespace.
de: XML-Literale und XML-Achseneigenschaften sind nicht verfügbar. Fügen Sie Verweise auf System.Xml, System.Xml.Linq und System.Core oder andere Assemblys hinzu, die System.Linq.Enumerable-, System.Xml.Linq.XElement-, System.Xml.Linq.XName-, System.Xml.Linq.XAttribute- und System.Xml.Linq.XNamespace-Typen deklarieren.
es: No hay literales XML ni propiedades de eje XML disponibles. Agregue referencias a System.Xml, System.Xml.Linq, and System.Core u otros ensamblados que declaren tipos System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute y System.Xml.Linq.XNamespace.
fr: Les littéraux XML et les propriétés d'axe XML ne sont pas disponibles. Ajoutez des références à System.Xml, System.Xml.Linq et System.Core ou d'autres assemblys qui déclarent des types System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute et System.Xml.Linq.XNamespace.
it: I valori letterali XML e le proprietà degli assi XML non sono disponibili. Aggiungere i riferimenti a System.Xml, System.Xml.Linq e System.Core o altri assembly che dichiarano i tipi System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute e System.Xml.Linq.XNamespace.
ja: XML リテラルおよび XML 軸のプロパティは使用できません。System.Xml、System.Xml.Linq、System.Core への参照、または System.Linq.Enumerable、System.Xml.Linq.XElement、System.Xml.Linq.XName、System.Xml.Linq.XAttribute、System.Xml.Linq.XNamespace 型を宣言する他のアセンブリへの参照を追加してください。
ko: XML 리터럴 및 XML 축 속성을 사용할 수 없습니다. System.Xml, System.Xml.Linq 및 System.Core에 참조를 추가하거나 System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute 및 System.Xml.Linq.XNamespace 형식을 선언하는 기타 어셈블리에 참조를 추가하세요.
pl: Literały XML i właściwości osi XML są niedostępne. Dodaj odwołania do zestawów System.Xml, System.Xml.Linq i System.Core lub innych zestawów deklarujących typy System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute i System.Xml.Linq.XNamespace.
pt_br: Literais XML e propriedades de eixo XML não estão disponíveis. Adicione referências a System.Xml, System.Xml.Linq e System.Core, ou outros assemblies declarando os tipos System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute e System.Xml.Linq.XNamespace.
ru: Литералы XML и свойства оси XML недоступны. Добавьте ссылки на System.Xml, System.Xml.Linq и System.Core или другие сборки, объявляющие типы System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute и System.Xml.Linq.XNamespace.
tr: XML sabit değerleri ve XML eksen özellikleri yok. System.Xml, System.Xml.Linq ve System.Core ya da System.Linq.Enumerable, System.Xml.Linq.XElement, System.Xml.Linq.XName, System.Xml.Linq.XAttribute ve System.Xml.Linq.XNamespace türlerini bildiren diğer derlemeler için başvurular ekleyin.
zh_hans: XML 文本和 XML 轴属性不可用。添加对 System.Xml、System.Xml.Linq 和 System.Core 的引用，或其他声明 System.Linq.Enumerable、System.Xml.Linq.XElement、System.Xml.Linq.XName、System.Xml.Linq.XAttribute 和 System.Xml.Linq.XNamespace 类型的程序集。
zh_hant: 無法使用 XML 常值與 XML 軸屬性。請將參考加入 System.Xml、System.Xml.Linq、System.Core，或其他宣告 System.Linq.Enumerable、System.Xml.Linq.XElement、System.Xml.Linq.XName、System.Xml.Linq.XAttribute 和 System.Xml.Linq.XNamespace 類型的組件。

# ERR_UnableToReadUacManifest2
source: Unable to open Win32 manifest file '{0}' : {1}
cs: Nejde otevřít soubor manifestu Win32 {0} : {1}.
de: Die Win32-Manifestdatei "{0}" kann nicht geöffnet werden: {1}
es: No se puede abrir el archivo de manifiesto de Win32 '{0}' : {1}
fr: Impossible d'ouvrir le fichier manifeste Win32 '{0}' : {1}
it: Non è possibile aprire il file manifesto Win32 '{0}': {1}
ja: Win32 マニフェスト ファイル '{0}' を開くことができません: {1}
ko: '{0}' Win32 매니페스트 파일을 열 수 없습니다({1}).
pl: Nie można otworzyć pliku manifestu Win32 „{0}”: {1}.
pt_br: Não é possível abrir o arquivo de manifesto Win32 "{0}" : {1}
ru: Не удалось открыть файл манифеста Win32 "{0}": {1}
tr: '{0}' Win32 bildirim dosyası açılamadı: {1}
zh_hans: 无法打开 Win32 清单文件“{0}”: {1}
zh_hant: 無法開啟 Win32 資訊清單檔 '{0}': {1}

# WRN_UseValueForXmlExpression3
source: Cannot convert '{0}' to '{1}'. You can use the 'Value' property to get the string value of the first element of '{2}'.
cs: Nejde převést {0} na {1}. K získání řetězcové hodnoty prvního prvku {2} můžete použít vlastnost Value.
de: "{0}" kann nicht in "{1}" konvertiert werden. Rufen Sie mit der Value-Eigenschaft den Zeichenfolgenwert des ersten Elements von "{2}" ab.
es: No se puede convertir '{0}' en '{1}'. Use la propiedad 'Value' para obtener el valor de cadena del primer elemento de '{2}'.
fr: Impossible de convertir '{0}' en '{1}'. Vous pouvez utiliser la propriété 'Value' pour obtenir la valeur de chaîne du premier élément de '{2}'.
it: Non è possibile convertire '{0}' in '{1}'. Si può usare la proprietà 'Value' per ottenere il valore stringa del primo elemento di '{2}'.
ja: '{0}' を '{1}' に変換できません。'{2}' の最初の要素の文字列値は、'Value' プロパティを使用して取得できます。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. 'Value' 속성을 사용하여 '{2}'의 첫 번째 요소의 문자열 값을 가져올 수 있습니다.
pl: Nie można przekonwertować elementu „{0}” na „{1}”. Przy użyciu właściwości „Value” można uzyskać wartość ciągu pierwszego elementu obiektu „{2}”.
pt_br: Não é possível converter "{0}" para "{1}". Você pode usar a propriedade "Value" para obter o valor de cadeia de caracteres do primeiro elemento de "{2}".
ru: Не удается преобразовать "{0}" в "{1}". Вы можете использовать свойство "Value", чтобы получить строковое значение первого элемента "{2}".
tr: '{0}' - '{1}' dönüştürmesi yapılamıyor. İlk '{2}' öğesinin dize değerini almak için 'Value' özelliğini kullanabilirsiniz.
zh_hans: 无法将“{0}”转换为“{1}”。可使用“Value”属性来获取“{2}”的第一个元素的字符串值。
zh_hant: 無法將 '{0}' 轉換成 '{1}'。您可使用 'Value' 屬性來取得 '{2}' 第一個元素之字串值。

# WRN_UseValueForXmlExpression3_Title
source: Cannot convert IEnumerable(Of XElement) to String
cs: IEnumerable (XElement) se nedá převést na řetězec.
de: IEnumerable(Of XElement) kann nicht in eine Zeichenfolge konvertiert werden
es: No se puede convertir IEnumerable(Of XElement) en una cadena
fr: Impossible de convertir IEnumerable(Of XElement) en String
it: Non è possibile convertire IEnumerable(Of XElement) in String
ja: IEnumerable(Of XElement) は文字列に変換できません
ko: IEnumerable(Of XElement)을 문자열로 변환할 수 없습니다.
pl: Nie można przekonwertować interfejsu IEnumerable(Of XElement) na ciąg
pt_br: Não é possível converter IEnumerable(Of XElement) para a cadeia de caracteres
ru: Невозможно преобразовать IEnumerable(XElement) в строку
tr: IEnumerable(Of XElement) dizeye dönüştürülemiyor
zh_hans: 无法将 IEnumerable(Of XElement) 转换为字符串
zh_hant: 無法將 IEnumerable(Of XElement) 轉換成字串

# ERR_TypeMismatchForXml3
source: Value of type '{0}' cannot be converted to '{1}'. You can use the 'Value' property to get the string value of the first element of '{2}'.
cs: Hodnotu typu {0} nejde převést na {1}. K získání řetězcové hodnoty prvního prvku {2} můžete použít vlastnost Value.
de: Der Wert vom Typ "{0}" kann nicht in "{1}" konvertiert werden. Rufen Sie mit der Value-Eigenschaft den Zeichenfolgenwert des ersten Elements von "{2}" ab.
es: El valor de tipo '{0}' no se puede convertir en '{1}'. Use la propiedad 'Value' para obtener el valor de cadena del primer elemento de '{2}'.
fr: Impossible de convertir une valeur de type '{0}' en '{1}'. Vous pouvez utiliser la propriété 'Value' pour obtenir la valeur de chaîne du premier élément de '{2}'.
it: Non è possibile convertire il valore di tipo '{0}' in '{1}'. Usare la proprietà 'Value' per ottenere il valore stringa del primo elemento di '{2}'.
ja: 型 '{0}' の値を '{1}' に変換できません。'{2}' の最初の要素の文字列値は、'Value' プロパティを使用して取得できます。
ko: '{0}' 형식의 값을 '{1}'(으)로 변환할 수 없습니다. 'Value' 속성을 사용하여 '{2}'의 첫 번째 요소의 문자열 값을 가져올 수 있습니다.
pl: Nie można przekonwertować wartości typu „{0}” na „{1}”. Przy użyciu właściwości „Value” można uzyskać wartość ciągu pierwszego elementu „{2}”.
pt_br: Valor de tipo "{0}" não pode ser convertido para "{1}". Você pode usar a propriedade "Value" para obter o valor da cadeia de caracteres do primeiro elemento de "{2}".
ru: Значение типа "{0}" невозможно преобразовать в "{1}". Вы можете использовать свойство "Value", чтобы получить строковое значение первого элемента "{2}".
tr: '{0}' türündeki değer '{1}' olarak dönüştürülemez. İlk '{2}' öğesinin dize değerini almak için 'Value' özelliğini kullanabilirsiniz.
zh_hans: 类型“{0}”的值无法转换为“{1}”。可使用“Value”属性来获取“{2}”的第一个元素的字符串值。
zh_hant: 類型 '{0}' 的值無法轉換成 '{1}'。您可以使用 'Value' 屬性，取得 '{2}' 第一個元素的字串值。

# ERR_BinaryOperandsForXml4
source: Operator '{0}' is not defined for types '{1}' and '{2}'. You can use the 'Value' property to get the string value of the first element of '{3}'.
cs: Operátor {0} není definovaný pro typy {1} a {2}. K získání řetězcové hodnoty prvního prvku {3} můžete použít vlastnost Value.
de: Der {0}-Operator ist für die Typen "{1}" und "{2}" nicht definiert. Rufen Sie mit der Value-Eigenschaft den Zeichenfolgenwert des ersten Elements von "{3}" ab.
es: El operador '{0}' no está definido por los tipos '{1}' y '{2}'. Use la propiedad 'Value' para obtener el valor de cadena del primer elemento de '{3}'.
fr: L'opérateur '{0}' n'est pas défini pour les types '{1}' et '{2}'. Vous pouvez utiliser la propriété 'Value' pour obtenir la valeur de chaîne du premier élément de '{3}'.
it: L'operatore '{0}' non è definito per i tipi '{1}' e '{2}'. È possibile usare la proprietà 'Value' per ottenere il valore stringa del primo elemento di '{3}'.
ja: 演算子 '{0}' は、型 '{1}' および '{2}' に対して定義されていません。'{3}' の最初の要素の文字列値は、'Value' プロパティを使用して取得できます。
ko: '{1}' 및 '{2}' 형식에 대한 '{0}' 연산자가 정의되지 않았습니다. 'Value' 속성을 사용하여 첫 번째 '{3}' 요소의 문자열 값을 가져올 수 있습니다.
pl: Operator „{0}” nie jest zdefiniowany dla typów „{1}” i „{2}”. Przy użyciu właściwości „Value” można uzyskać wartość ciągu pierwszego elementu obiektu „{3}”.
pt_br: Operador "{0}" não está definido para tipos "{1}" e "{2}". Você pode usar a propriedade "Value" para obter o valor de cadeia de caracteres do primeiro elemento de "{3}".
ru: Оператор "{0}" не определен для типов "{1}" и "{2}". Вы можете использовать свойство "Value", чтобы получить строковое значение первого элемента "{3}".
tr: '{0}' işleci '{1}' ve '{2}' türleri için tanımlanmadı. İlk '{3}' öğesinin dize değerini almak için 'Value' özelliğini kullanabilirsiniz.
zh_hans: 没有为类型“{1}”和“{2}”定义运算符“{0}”。可使用“Value”属性来获取“{3}”的第一个元素的字符串值。
zh_hant: 未對類型 '{1}' 和 '{2}' 定義運算子 '{0}'。您可使用 'Value' 屬性取得 '{3}' 第一個元素的字串值。

# ERR_FullWidthAsXmlDelimiter
source: Full width characters are not valid as XML delimiters.
cs: Znaky s plnou šířkou nejde použít jako platné oddělovače XML.
de: Zeichen mit voller Breite können nicht als XML-Trennzeichen verwendet werden.
es: No se pueden usar caracteres de ancho completo como delimitadores XML.
fr: Les caractères à pleine chasse ne sont pas valides en tant que délimiteurs XML.
it: I caratteri a larghezza intera non sono validi come delimitatori XML.
ja: 全角文字は、XML の区切り記号としては無効です。
ko: 전자 문자는 XML 구분 기호로 사용할 수 없습니다.
pl: Znaki o pełnej szerokości nie mogą być ogranicznikami XML.
pt_br: Caracteres de largura total não são válidos como delimitadores XML.
ru: Широкие символы не допускаются в качестве разделителей XML.
tr: Tam genişlikli karakterler XML ayırıcısı olarak geçerli değildir.
zh_hans: 全角字符不能用作 XML 分隔符。
zh_hant: 全形字元不能做為 XML 分隔符號。

# ERR_InvalidSubsystemVersion
source: The value '{0}' is not a valid subsystem version. The version must be 6.02 or greater for ARM or AppContainerExe, and 4.00 or greater otherwise.
cs: Hodnota {0} není platná hodnota pro verzi subsystému. Verze musí být 6.02 nebo větší pro ARM a AppContainerExe, v jiných případech musí být větší než 4.00.
de: Der Wert "{0}" ist keine gültige Subsystemversion. Die Version muss 6.02 oder höher für ARM oder AppContainerExe sein, andernfalls 4.00 oder höher.
es: El valor '{0}' no es una versión de subsistema válida. La versión debe ser 6.02 o posterior para ARM o AppContainerExe, y 4.00 o posterior de lo contrario.
fr: La valeur '{0}' n'est pas une version de sous-système valide. La version doit être 6.02 ou supérieure pour ARM ou AppContainerExe, et 4.00 ou supérieure dans les autres cas.
it: Il valore '{0}' non è una versione del sottosistema valida. La versione deve essere 6.02 o successiva per ARM o AppContainerExe e 4.00 o successiva negli altri casi.
ja: '{0}' は有効なサブシステム バージョンの値ではありません。バージョンは、ARM または AppContainerExe では 6.02 以上、その他の場合は 4.00 以上であることが必要です。
ko: '{0}' 값이 유효한 하위 시스템 버전이 아닙니다. 버전은 ARM 또는 AppContainerExe의 경우 6.02 이상이어야 하고, 그 외의 경우 4.00 이상이어야 합니다.
pl: Wartość „{0}” nie jest prawidłową wersją podsystemu. Wersja musi mieć wartość 6.02 lub wyższą dla elementu ARM lub AppContainerExe oraz 4.00 lub wyższą w innych przypadkach.
pt_br: O valor "{0}" não é uma versão de subsistema válido. A versão deve ser 6.02 ou mais recente para ARM ou AppContainerExe e 4.00 ou mais recente caso contrário.
ru: Значение "{0}" не является допустимой версией подсистемы. Для ARM или AppContainerExe должна быть указана версия 6.02 или выше, в остальных случаях — версия 4.00 или выше.
tr: '{0}' değeri geçerli bir alt sistem sürümü değil. Sürüm, ARM veya AppContainerExe için 6.02 veya daha büyük, bunun dışındaki durumlarda 4.00 veya daha büyük olmalıdır.
zh_hans: 值“{0}”不是有效的子系统版本。对于 ARM 或 AppContainerExe，版本必须为 6.02 或更高版本，对于其他内容，版本必须为 4.00 或更高版本。
zh_hant: 值 '{0}' 不是有效的子系統版本。ARM 或 AppContainerExe 的版本必須是 6.02 (含) 以上，而其他則必須是 4.00 (含) 以上。

# ERR_InvalidFileAlignment
source: Invalid file section alignment '{0}'
cs: Neplatný argument výběru souboru {0}
de: Ungültige Dateiabschnittausrichtung "{0}"
es: Alineación de sección de archivo no válida "{0}"
fr: Alignement de section de fichier non valide '{0}'
it: L'allineamento '{0}' della sezione del file non è valido
ja: '{0}' は無効なファイル セクションの配置です
ko: 잘못된 파일 섹션 맞춤 '{0}'
pl: Nieprawidłowe wyrównanie sekcji pliku „{0}”
pt_br: Alinhamento de seção de arquivo inválido '{0}'
ru: Недопустимое выравнивание разделов файла "{0}"
tr: Geçersiz dosya bölümü hizalaması '{0}'
zh_hans: 无效的文件节对齐方式“{0}”
zh_hant: 無效的檔案區段記憶體對齊 '{0}'

# ERR_InvalidOutputName
source: Invalid output name: {0}
cs: Neplatný název výstupu: {0}
de: Ungültiger Ausgabename: {0}
es: Nombre de archivo salida no válido: {0}
fr: Nom de sortie non valide : {0}
it: Nome di output non valido: {0}
ja: 無効な出力名: {0}
ko: 잘못된 출력 이름: {0}
pl: Nieprawidłowa nazwa wyjścia: {0}
pt_br: Nome de saída inválido: {0}
ru: Недопустимое имя выходных данных: {0}
tr: Geçersiz çıkış adı: {0}
zh_hans: 无效输出名: {0}
zh_hant: 無效的輸出名稱: {0}

# ERR_InvalidDebugInformationFormat
source: Invalid debug information format: {0}
cs: Neplatný formát informací o ladění: {0}
de: Ungültiges Format für Debuginformationen: {0}
es: Formato de la información de depuración no válido: {0}
fr: Format des informations de débogage non valide : {0}
it: Formato delle informazioni di debug non valido: {0}
ja: 無効なデバッグ情報の形式: {0}
ko: 잘못된 디버그 정보 형식: {0}
pl: Nieprawidłowy format informacji debugowania: {0}
pt_br: Formato de informações de depuração inválidas: {0}
ru: Недопустимый формат отладочной информации: {0}
tr: Geçersiz hata ayıklama bilgisi biçimi: {0}
zh_hans: 无效的调试信息格式: {0}
zh_hant: 無效的偵錯資訊格式: {0}

# ERR_LibAnycpu32bitPreferredConflict
source: /platform:anycpu32bitpreferred can only be used with /t:exe, /t:winexe and /t:appcontainerexe.
cs: Parametr /platform:anycpu32bitpreferred jde použít jenom s parametry /t:exe, /t:winexe a /t:appcontainerexe.
de: /platform:anycpu32bitpreferred kann nur mit /t:exe, /t:winexe und /t:appcontainerexe verwendet werden.
es: /platform:anycpu32bitpreferred solamente se puede usar con /t:exe, /t:winexe y /t:appcontainerexe.
fr: /platform:anycpu32bitpreferred peut uniquement être utilisé avec /t:exe, /t:winexe et /t:appcontainerexe.
it: /platform:anycpu32bitpreferred può essere usato solo con /t:exe, /t:winexe e /t:appcontainerexe.
ja: /platform:anycpu32bitpreferred は、/t:exe、/t:winexe、および /t:appcontainerexe でのみ使用できます。
ko: /platform:anycpu32bitpreferred는 /t:exe, /t:winexe 및 /t:appcontainerexe하고만 사용할 수 있습니다.
pl: Polecenia /platform:anycpu32bitpreferred można używać tylko z przełącznikami /t:exe, /t:winexe i /t:appcontainerexe.
pt_br: /platform:anycpu32bitpreferred só pode ser usado com /t:exe, /t:winexe e /t:appcontainerexe.
ru: Параметр /platform:anycpu32bitpreferred можно использовать только вместе с параметрами /t:exe, /t:winexe и /t:appcontainerexe.
tr: /platform:anycpu32bitpreferred yalnızca /t:exe, /t:winexe ve /t:appcontainerexe ile kullanılabilir.
zh_hans: /platform:anycpu32bitpreferred 只能与 /t:exe、/t:winexe 和 /t:appcontainerexe 一起使用。
zh_hant: /platform:anycpu32bitpreferred 只能搭配 /t:exe、/t:winexe 和 /t:appcontainerexe 一起使用。
