Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoPartialMethodInAddressOf1
source: 'AddressOf' cannot be applied to '{0}' because '{0}' is a partial method without an implementation.
cs: 'Pro {0} nejde použít operátor AddressOf, protože {0} je částečná metoda bez implementace.
de: 'AddressOf kann nicht auf "{0}" angewendet werden, da "{0}" eine partielle Methode ohne Implementierung ist.
es: 'AddressOf' no se puede aplicar a '{0}' porque '{0}' es un método parcial sin implementación.
fr: 'AddressOf' ne peut pas être appliqué à '{0}', car '{0}' est une méthode partielle sans implémentation.
it: 'Non è possibile applicare 'AddressOf' a '{0}' perché '{0}' è un metodo parziale senza un'implementazione.
ja: '{0}' は実装されていない部分メソッドであるため、'AddressOf' を '{0}' に適用することはできません。
ko: '{0}'은(는) 구현하지 않은 부분 메서드(Partial Method)이므로 'AddressOf'를 '{0}'에 적용할 수 없습니다.
pl: 'Nie można zastosować wyrażenia „AddressOf” do metody „{0}”, ponieważ „{0}” jest metodą częściową bez implementacji.
pt_br: "AddressOf" não pode ser aplicado a "{0}" porque "{0}" é um método parcial sem uma implementação.
ru: '"AddressOf" не может быть применен к "{0}", так как "{0}" является разделяемым методом без реализации.
tr: '{0}', uygulaması olmayan kısmi bir yöntem olduğundan, '{0}' yöntemine 'AddressOf' uygulanamaz.
zh_hans: '“AddressOf”不能应用于“{0}”，因为“{0}”是不包含实现的分部方法。
zh_hant: 'AddressOf' 無法套用至 '{0}'，因為 '{0}' 是沒有實作的部分方法。

# ERR_ImplementationMustBePrivate2
source: Method '{0}' must be declared 'Private' in order to implement partial method '{1}'.
cs: V deklaraci metody {0} musí být použité klíčové slovo Private, aby mohla implementovat částečnou metodu {1}.
de: Die {0}-Methode muss als "Private" deklariert werden, um die partielle {1}-Methode zu implementieren.
es: El método '{0}' se debe declarar como 'Private' para poder implementar el método parcial '{1}'.
fr: La méthode '{0}' doit être déclarée 'Private' pour implémenter la méthode partielle '{1}'.
it: Il metodo '{0}' deve essere dichiarato come 'Private' per implementare il metodo parziale '{1}'.
ja: 部分メソッド '{1}' を実装するためには、メソッド '{0}' は 'Private' として宣言されなければなりません。
ko: '{1}' 부분 메서드(Partial Method)를 구현하려면 '{0}' 메서드를 'Private'으로 선언해야 합니다.
pl: Metoda „{0}” musi być zadeklarowana jako „Private”, aby mogła implementować metodę częściową „{1}”.
pt_br: Método "{0}" deve ser declarado como "Private" para implementar o método parcial "{1}".
ru: Метод "{0}" должен быть объявлен как "Private", чтобы реализовать частичный метод "{1}".
tr: '{1}' kısmi yönteminin uygulanması için '{0}' yönteminin 'Private' olarak bildirilmesi gerekir.
zh_hans: 方法“{0}”必须声明为“Private”，以便实现分部方法“{1}”。
zh_hant: 方法 '{0}' 必須宣告為 'Private'，才能實作部分方法 '{1}'。

# ERR_PartialMethodParamNamesMustMatch3
source: Parameter name '{0}' does not match the name of the corresponding parameter, '{1}', defined on the partial method declaration '{2}'.
cs: Název parametru {0} neodpovídá názvu příslušného parametru {1} definovaného v deklaraci částečné metody {2}.
de: Der Parametername "{0}" stimmt nicht mit dem Namen "{1}" des entsprechenden Parameters überein, der für die Deklaration der partiellen {2}-Methode definiert wurde.
es: El nombre de parámetro '{0}' no coincide con el nombre del parámetro correspondiente, '{1}', definido en la declaración de método parcial '{2}'.
fr: Le nom de paramètre '{0}' ne correspond pas au nom du paramètre correspondant, '{1}', défini dans la déclaration de méthode partielle '{2}'.
it: Il nome di parametro '{0}' non corrisponde al nome del parametro corrispondente '{1}', definito nella dichiarazione del metodo parziale '{2}'.
ja: パラメーター名 '{0}' は、部分メソッドの宣言 '{2}' で定義された、対応するパラメーターの名前 '{1}' と一致しません。
ko: '{0}' 매개 변수 이름이 '{2}' 부분 메서드(Partial Method) 선언에 정의된 해당 '{1}' 매개 변수의 이름과 일치하지 않습니다.
pl: Nazwa parametru „{0}” nie jest zgodna z nazwą odpowiadającego mu parametru „{1}” zdefiniowanego w deklaracji metody częściowej „{2}”.
pt_br: Nome do parâmetro "{0}" não corresponde ao nome do parâmetro correspondente "{1}", definido na declaração de método parcial "{2}".
ru: Имя параметра "{0}" не соответствует имени соответствующего параметра "{1}", определенного для объявления разделяемого метода "{2}".
tr: '{0}' parametre adı, '{2}' kısmi yöntem bildiriminde tanımlanan karşılık gelen '{1}' parametresinin adıyla eşleşmiyor.
zh_hans: 参数名“{0}”与在分部方法声明“{2}”上定义的相应参数的名称“{1}”不匹配。
zh_hant: 參數名稱 '{0}' 與部分方法宣告 '{2}' 中所定義之對應參數 '{1}' 的名稱不相符。

# ERR_PartialMethodTypeParamNameMismatch3
source: Name of type parameter '{0}' does not match '{1}', the corresponding type parameter defined on the partial method declaration '{2}'.
cs: Název parametru {0} neodpovídá názvu parametru {1}, příslušného parametru definovaného v deklaraci částečné metody {2}.
de: Der Typparametername "{0}" stimmt nicht mit "{1}" des entsprechenden Typparameters überein, der für die Deklaration der partiellen {2}-Methode definiert wurde.
es: El nombre del parámetro de tipo '{0}' no coincide con '{1}', que es el parámetro de tipo correspondiente definido en la declaración del método parcial '{2}'.
fr: Le nom du paramètre de type '{0}' ne correspond pas à '{1}', le paramètre de type correspondant défini dans la déclaration de méthode partielle '{2}'.
it: Il nome del parametro di tipo '{0}' non corrisponde a '{1}', il parametro di tipo corrispondente definito nella dichiarazione del metodo parziale '{2}'.
ja: 型パラメーター '{0}' の名前は、部分メソッドの宣言 '{2}' で定義された、対応する型パラメーター '{1}' と一致しません。
ko: '{0}' 형식 매개 변수의 이름이 '{2}' 부분 메서드(Partial Method) 선언에 정의된 해당 '{1}' 형식 매개 변수와 일치하지 않습니다.
pl: Nazwa parametru typu „{0}” nie jest zgodna z odpowiadającym mu parametrem typu „{1}” zdefiniowanego w deklaracji metody częściowej „{2}”.
pt_br: Nome do parâmetro de tipo "{0}" não corresponde a "{1}", o parâmetro de tipo correspondente definido na declaração de método parcial "{2}".
ru: Имя параметра типа "{0}" не соответствует "{1}", соответствующий параметр типа, определенный для объявления разделяемого метода "{2}".
tr: '{0}' parametresinin adı, '{2}' kısmi yöntem bildiriminde tanımlanmış, buna karşılık gelen '{1}' tür parametresiyle eşleşmiyor.
zh_hans: 类型参数“{0}”的名称与在分部方法声明“{2}”上定义的相应类型参数“{1}”不匹配。
zh_hant: 類型參數 '{0}' 的名稱，與部分方法宣告 '{2}' 中所定義的對應類型參數 '{1}' 不相符。

# ERR_BadAttributeSharedProperty1
source: 'Shared' attribute property '{0}' cannot be the target of an assignment.
cs: 'Atribut Shared vlastnosti {0} nemůže být cílem přiřazení.
de: 'Die Shared-Attributeigenschaft "{0}" kann nicht das Ziel einer Zuweisung sein.
es: 'La propiedad de atributo 'Shared' '{0}' no puede ser el destino de una asignación.
fr: 'La propriété d'attribut 'Shared' '{0}' ne peut pas être la cible d'une assignation.
it: 'La proprietà '{0}' dell'attributo 'Shared' non può essere la destinazione di un'assegnazione.
ja: 'Shared' 属性プロパティ '{0}' を代入式のターゲットにすることはできません。
ko: 'Shared' 특성의 속성 '{0}'은(는) 할당 대상일 수 없습니다.
pl: 'Właściwość „{0}” atrybutu „Shared” nie może być elementem docelowym przypisania.
pt_br: 'Propriedade de atributo "Shared" "{0}" não pode ser o destino de uma atribuição.
ru: 'Свойству атрибута "Shared" "{0}" нельзя присваивать значение.
tr: '{0}' 'Shared' öznitelik özelliği atama işleminin hedefi olamaz.
zh_hans: '“Shared”特性属性“{0}”不能作为赋值的目标。
zh_hant: 'Shared' 屬性 (Attribute) 的屬性 (Property) '{0}'，不可是指派的目標。

# ERR_BadAttributeReadOnlyProperty1
source: 'ReadOnly' attribute property '{0}' cannot be the target of an assignment.
cs: 'Atribut ReadOnly vlastnosti {0} nemůže být cílem přiřazení.
de: 'Die ReadOnly-Attributeigenschaft "{0}" kann nicht das Ziel einer Zuweisung sein.
es: 'La propiedad de atributo 'ReadOnly' '{0}' no puede ser el destino de una asignación.
fr: 'La propriété d'attribut 'ReadOnly' '{0}' ne peut pas être la cible d'une assignation.
it: 'La proprietà '{0}' dell'attributo 'ReadOnly' non può essere la destinazione di un'assegnazione.
ja: 'ReadOnly' 属性プロパティ '{0}' を代入式のターゲットにすることはできません。
ko: 'ReadOnly' 특성의 속성 '{0}'은(는) 할당 대상일 수 없습니다.
pl: 'Właściwość „{0}” atrybutu „ReadOnly” nie może być elementem docelowym przypisania.
pt_br: 'Propriedade de atributo "ReadOnly" "{0}" não pode ser o destino de uma atribuição.
ru: 'Свойству атрибута "ReadOnly" "{0}" нельзя присваивать значение.
tr: '{0}' 'ReadOnly' öznitelik özelliği atama işleminin hedefi olamaz.
zh_hans: '“ReadOnly”特性属性“{0}”不能作为赋值的目标。
zh_hant: 'ReadOnly' 屬性 (Attribute) 的屬性 (Property) '{0}'，不可是指派的目標。

# ERR_DuplicateResourceName1
source: Resource name '{0}' cannot be used more than once.
cs: Název prostředku {0} nejde použít víc než jednou.
de: Der Ressourcenname "{0}" kann nicht mehrmals verwendet werden.
es: El nombre de recurso '{0}' no se puede usar más de una vez.
fr: Le nom de ressource '{0}' ne peut pas être utilisé plusieurs fois.
it: Il nome di risorsa '{0}' non può essere usato più di una volta.
ja: リソース名 '{0}' を複数回使用することはできません。
ko: 리소스 이름 '{0}'은(는) 두 번 이상 사용할 수 없습니다.
pl: Nie można użyć nazwy zasobu „{0}” więcej niż raz.
pt_br: Nome do recurso "{0}" não pode ser usado mais de uma vez.
ru: Имя ресурса "{0}" не может использоваться более одного раза.
tr: '{0}' kaynak adı birden çok kez kullanılamaz.
zh_hans: 资源名称“{0}”不能多次使用。
zh_hant: 資源名稱 '{0}' 不可重複使用。

# ERR_DuplicateResourceFileName1
source: Each linked resource and module must have a unique filename. Filename '{0}' is specified more than once in this assembly.
cs: Každý propojený prostředek a modul musí mít jedinečný název souboru, ale {0} se v tomto sestavení objevuje víc než jednou.
de: Alle verknüpften Ressourcen und Module müssen einen eindeutigen Dateinamen haben. Der Dateiname "{0}" ist in dieser Assembly mehrmals vorhanden.
es: Todos los recursos y módulos vinculados deben tener un nombre de archivo único. El nombre de archivo '{0}' se ha especificado más de una vez en este ensamblado.
fr: Chaque ressource et module liés doivent avoir un nom de fichier unique. Le nom de fichier '{0}' est indiqué plusieurs fois dans cet assembly.
it: Ogni risorsa e ogni modulo collegato devono avere un nome file univoco. Il nome file '{0}' è specificato più di una volta in questo assembly.
ja: リンクされた各リソースおよびモジュールには一意のファイル名を指定しなければなりません。ファイル名 '{0}' はこのアセンブリ内で複数回指定されています。
ko: 링크된 각 리소스와 모듈에는 고유한 파일 이름이 있어야 합니다. '{0}' 파일 이름은 이 어셈블리에 두 번 이상 지정되었습니다.
pl: Każdy połączony zasób oraz moduł muszą mieć unikatową nazwę pliku. Nazwa pliku „{0}” jest określona więcej niż jeden raz w tym zestawie.
pt_br: Cada módulo ou recurso vinculado deve ter um nome de arquivo exclusivo. Nome de arquivo "{0}" é especificado mais de uma vez neste assembly.
ru: Каждый связанный ресурс и модуль должны иметь уникальное имя файла. Имя файла "{0}" определено более одного раза в этой сборке.
tr: Bağlantılı her kaynak ve modülün benzersiz bir dosya adı olmalıdır. '{0}' dosya adı bu derlemede birden çok kez belirtildi.
zh_hans: 每个链接的资源和模块都必须有唯一的文件名。此程序集中多次指定了文件名“{0}”。
zh_hant: 每個連結的資源與模組，都必須要有不重複的檔名。檔名 '{0}' 在此組件中指定了一次以上。

# ERR_AttributeMustBeClassNotStruct1
source: '{0}' cannot be used as an attribute because it is not a class.
cs: 'Prvek {0} nejde použít jako atribut, protože se nejedná o třídu.
de: '"{0}" kann nicht als Attribut verwendet werden, da es keine Klasse ist.
es: '{0}' no se puede usar como atributo porque no es una clase.
fr: '{0}' ne peut pas être utilisé en tant qu'attribut, car ce n'est pas une classe.
it: 'Non è possibile usare '{0}' come attributo perché non è una classe.
ja: '{0}' はクラスではないため、属性として使用できません。
ko: '{0}'은(는) 클래스가 아니므로 특성으로 사용할 수 없습니다.
pl: 'Nie można użyć elementu „{0}” jako atrybutu, ponieważ nie jest on klasą.
pt_br: "{0}" não pode ser usado como um atributo porque não é uma classe.
ru: "{0}" нельзя использовать как атрибут, поскольку он не является классом.
tr: '{0}' bir sınıf olmadığından öznitelik olarak kullanılamaz.
zh_hans: '“{0}”不是类，因此不能用作属性。
zh_hant: '無法將 '{0}' 用做為屬性，因為其非類別。

# ERR_AttributeMustInheritSysAttr
source: '{0}' cannot be used as an attribute because it does not inherit from 'System.Attribute'.
cs: 'Prvek {0} nejde použít jako atribut, protože nedědí od atributu System.Attribute.
de: '"{0}" kann nicht als Attribut verwendet werden, da es nicht von "System.Attribute" erbt.
es: '{0}' no se puede usar como atributo porque no se hereda de 'System.Attribute'.
fr: '{0}' ne peut pas être utilisé en tant qu'attribut, car il n'hérite pas de 'System.Attribute'.
it: 'Non è possibile usare '{0}' come attributo perché non eredita da 'System.Attribute'.
ja: '{0}' は 'System.Attribute' から継承していないため、属性として使用できません。
ko: '{0}'은(는) 'System.Attribute'에서 상속하지 않으므로 특성으로 사용할 수 없습니다.
pl: 'Nie można użyć elementu „{0}” jako atrybutu, ponieważ nie dziedziczy on po klasie „System.Attribute”.
pt_br: "{0}" não pode ser usado como um atributo porque não herda de "System.Attribute".
ru: "{0}" нельзя использовать как атрибут, так как он не является производным от "System.Attribute".
tr: 'System.Attribute' öğesinden devralınmadığından '{0}' öznitelik olarak kullanılamaz.
zh_hans: '“{0}”不从“System.Attribute”继承，因此不能用作属性。
zh_hant: '無法將 '{0}' 用做為屬性，因為其非繼承自 'System.Attribute'。

# ERR_AttributeCannotBeAbstract
source: '{0}' cannot be used as an attribute because it is declared 'MustInherit'.
cs: 'Prvek {0} nejde použít jako atribut, protože se deklaruje pomocí modifikátoru MustInherit.
de: '"{0}" kann nicht als Attribut verwendet werden, da es als "MustInherit" deklariert ist.
es: '{0}' no se puede usar como atributo porque se ha declarado como 'MustInherit'.
fr: '{0}' ne peut pas être utilisé en tant qu'attribut, car il est déclaré 'MustInherit'.
it: 'Non è possibile usare '{0}' come attributo perché è dichiarato come 'MustInherit'.
ja: '{0}' は 'MustInherit' と宣言されているため、属性として使用できません。
ko: '{0}'은(는) 'MustInherit'으로 선언되었으므로 특성으로 사용할 수 없습니다.
pl: 'Nie można użyć elementu „{0}” jako atrybutu, ponieważ jest on zadeklarowany jako „MustInherit”.
pt_br: "{0}" não pode ser usado como um atributo porque é declarado como "MustInherit".
ru: "{0}" не может использоваться как атрибут, поскольку он объявлен как "MustInherit".
tr: 'MustInherit' olarak bildirildiğinden '{0}' öznitelik olarak kullanılamaz.
zh_hans: '“{0}”已声明为“MustInherit”，因此不能用作属性。
zh_hant: '無法將 '{0}' 用做為屬性，因為其宣告為 'MustInherit'。

# ERR_UnableToOpenResourceFile1
source: Unable to open resource file '{0}': {1}
cs: Soubor prostředků {0} nejde otevřít: {1}.
de: Die Ressourcendatei "{0}" kann nicht geöffnet werden: {1}
es: No se puede abrir el archivo de recursos '{0}': {1}
fr: Impossible d'ouvrir le fichier de ressources '{0}' : {1}
it: Non è possibile aprire il file di risorse '{0}': {1}
ja: リソース ファイル '{0}' を開くことができません: {1}
ko: '{0}' 리소스 파일을 열 수 없습니다({1}).
pl: Nie można otworzyć pliku zasobów „{0}”: {1}.
pt_br: Não é possível abrir o arquivo de recurso "{0}": {1}
ru: Не удалось открыть файл ресурсов "{0}". {1}
tr: '{0}' kaynak dosyası açılamadı: {1}
zh_hans: 无法打开资源文件“{0}”: {1}
zh_hant: 無法開啟資源檔 '{0}': {1}

# ERR_BadAttributeNonPublicProperty1
source: Attribute member '{0}' cannot be the target of an assignment because it is not declared 'Public'.
cs: Člen atributu {0} nemůže být cílem přiřazení, protože není deklararovaný jako Public.
de: Der Attributmember "{0}" kann nicht das Ziel einer Zuweisung sein, da er nicht als "Public" deklariert ist.
es: El miembro de atributo '{0}' no puede ser el destino de una asignación porque no está declarado como 'Public'.
fr: Le membre d'attribut '{0}' ne peut pas être la cible d'une assignation, car il n'est pas déclaré 'Public'.
it: Il membro di attributo '{0}' non può essere la destinazione di un'assegnazione perché non è dichiarato come 'Public'.
ja: 属性メンバー '{0}' は 'Public' と宣言されていないため、代入式のターゲットにすることはできません。
ko: 특성 멤버 '{0}'은(는) 'Public'으로 선언되지 않았으므로 할당 대상일 수 없습니다.
pl: Składowa atrybutu „{0}” nie może być elementem docelowym przypisania, ponieważ nie jest zadeklarowana jako „Public”.
pt_br: Membro de atributo "{0}" não pode ser o destino de uma atribuição porque não é declarado "Public".
ru: Члену атрибута "{0}" нельзя присваивать значение, поскольку он не объявлен как "Public".
tr: Public' olarak bildirilmediğinden, '{0}' öznitelik üyesi atama işleminin hedefi olamaz.
zh_hans: 特性成员“{0}”未声明为“Public”，因此不能作为赋值的目标。
zh_hant: 屬性成員 '{0}' 不可是指派的目標，因為其未宣告為 'Public'。

# ERR_STAThreadAndMTAThread0
source: 'System.STAThreadAttribute' and 'System.MTAThreadAttribute' cannot both be applied to the same method.
cs: 'Atributy System.STAThreadAttribute a System.MTAThreadAttribute nejde současně použít pro tutéž metodu.
de: 'System.STAThreadAttribute und System.MTAThreadAttribute können nicht zusammen auf dieselbe Methode angewendet werden.
es: 'System.STAThreadAttribute' y 'System.MTAThreadAttribute' no se pueden aplicar a la vez al mismo método.
fr: 'Impossible d'appliquer à la fois 'System.STAThreadAttribute' et 'System.MTAThreadAttribute' à la même méthode.
it: 'Non è possibile applicare sia 'System.STAThreadAttribute' che 'System.MTAThreadAttribute' allo stesso metodo.
ja: 'System.STAThreadAttribute' および 'System.MTAThreadAttribute' の両方を同じメソッドに適用することはできません。
ko: 'System.STAThreadAttribute'와 'System.MTAThreadAttribute'를 같은 메서드에 함께 적용할 수 없습니다.
pl: 'Nie można zastosować elementów System.STAThreadAttribute i System.MTAThreadAttribute do tej samej metody.
pt_br: 'System.STAThreadAttribute' e 'System.MTAThreadAttribute' não podem ambos ser aplicados ao mesmo método.
ru: 'Атрибуты "System.STAThreadAttribute" и "System.MTAThreadAttribute" не могут вместе использоваться для одного метода.
tr: 'Aynı yönteme hem 'System.STAThreadAttribute' hem de 'System.MTAThreadAttribute' uygulanamaz.
zh_hans: '"System.STAThreadAttribute" 和 "System.MTAThreadAttribute" 不能同时应用于同一方法。
zh_hant: 'System.STAThreadAttribute' 和 'System.MTAThreadAttribute' 無法同時套用至同一個方法。

# ERR_IndirectUnreferencedAssembly4
source: Project '{0}' makes an indirect reference to assembly '{1}', which contains '{2}'. Add a file reference to '{3}' to your project.
cs: Projekt {0} vytváří nepřímý odkaz na sestavení {1}, které obsahuje prvek {2}. Přidejte do projektu odkaz na sestavení {3}.
de: Das Projekt "{0}" verweist indirekt auf die Assembly "{1}", die "{2}" enthält. Fügen Sie dem Projekt einen Dateiverweis auf "{3}" hinzu.
es: El proyecto '{0}' hace una referencia indirecta al ensamblado '{1}', que contiene '{2}'. Agregue una referencia de archivo a '{3}' a su proyecto.
fr: Le projet '{0}' établit une référence indirecte à l'assembly '{1}', qui contient '{2}'. Ajoutez une référence de fichier pour '{3}' dans votre projet.
it: Il progetto '{0}' include un riferimento indiretto all'assembly '{1}' che contiene '{2}'. Aggiungere al progetto un riferimento file a '{3}'.
ja: プロジェクト '{0}' は、'{2}' を含むアセンブリ '{1}' への間接的な参照を生じさせます。'{3}' へのファイル参照をプロジェクトに追加してください。
ko: '{0}' 프로젝트는 '{2}'을(를) 포함하는 '{1}' 어셈블리에 대한 간접 참조를 만듭니다. '{3}'에 대한 파일 참조를 프로젝트에 추가하세요.
pl: Projekt „{0}” wykonuje pośrednie odwołanie do zestawu „{1}”, który zawiera element „{2}”. Dodaj do projektu odwołanie pliku do elementu „{3}”.
pt_br: Projeto "{0}" faz uma referência indireta ao assembly "{1}", que contém "{2}". Adicione uma referência de arquivo a "{3}" ao seu projeto.
ru: В проекте "{0}" имеется косвенная ссылка на сборку "{1}", которая содержит "{2}". Добавьте к проекту ссылку на файл "{3}".
tr: '{0}' projesi '{2}' içeren '{1}' derlemesine dolaylı başvuruda bulunuyor. Projenizde '{3}' için bir dosya başvurusu ekleyin.
zh_hans: 项目“{0}”间接引用包含“{2}”的程序集“{1}”。请在您的项目中添加对“{3}”的文件引用。
zh_hant: 專案 '{0}' 會間接參考含有 '{2}' 的組件 '{1}'。請在您的專案中加入 '{3}' 的檔案參考。

# ERR_BadAttributeNonPublicType1
source: Type '{0}' cannot be used in an attribute because it is not declared 'Public'.
cs: Typ {0} nejde použít v atributu, protože není deklararovaný jako Public.
de: Der Typ "{0}" kann nicht in einem Attribut verwendet werden, da er nicht als "Public" deklariert ist.
es: No se puede usar el tipo '{0}' en un atributo porque no está declarado como 'Public'.
fr: Impossible d'utiliser le type '{0}' dans un attribut, car il n'est pas déclaré 'Public'.
it: Non è possibile usare il tipo '{0}' in un attributo perché non è dichiarato come 'Public'.
ja: 型 '{0}' は 'Public' と宣言されていないため、属性で使用することはできません。
ko: '{0}' 형식은 'Public'으로 선언되지 않았으므로 특성에 사용할 수 없습니다.
pl: Nie można użyć typu „{0}” w atrybucie, ponieważ nie jest on zadeklarowany jako „Public”.
pt_br: Tipo "{0}" não pode ser usado em um atributo porque não está declarado como "Public".
ru: Тип "{0}" нельзя использовать в атрибуте, поскольку он не объявлен как "Public".
tr: Public' olarak bildirilmediğinden '{0}' türü öznitelik içinde kullanılamaz.
zh_hans: 类型“{0}”未声明为“Public”，因此不能用在特性中。
zh_hant: 無法在屬性中使用類型 '{0}'，因為其未宣告為 'Public'。

# ERR_BadAttributeNonPublicContType2
source: Type '{0}' cannot be used in an attribute because its container '{1}' is not declared 'Public'.
cs: Typ {0} nejde použít v atributu, protože jeho kontejner {1} není deklararovaný jako Public.
de: Der Typ "{0}" kann nicht in einem Attribut verwendet werden, da sein Container "{1}" nicht als "Public" deklariert ist.
es: No se puede usar el tipo '{0}' en un atributo porque su contenedor '{1}' no está declarado como 'Public'.
fr: Impossible d'utiliser le type '{0}' dans un attribut, car son conteneur '{1}' n'est pas déclaré 'Public'.
it: Non è possibile usare il tipo '{0}' perché il relativo contenitore '{1}' non è dichiarato come 'Public'.
ja: 型 '{0}' のコンテナー '{1}' が 'Public' と宣言されていないため、この型は属性では使用できません。
ko: '{0}' 형식의 컨테이너 '{1}'이(가) 'Public'으로 선언되지 않았으므로 이 형식을 특성에 사용할 수 없습니다.
pl: Nie można użyć typu „{0}” w atrybucie, ponieważ jego kontener „{1}” nie jest zadeklarowany jako „Public”.
pt_br: Tipo "{0}" não pode ser usado em um atributo porque seu contêiner "{1}" não está declarado como "Public".
ru: Тип "{0}" нельзя использовать в атрибуте, поскольку его контейнер "{1}" не объявлен как "Public".
tr: Kapsayıcısı olan '{1}' 'Public' olarak bildirilmediğinden '{0}' türü öznitelik içinde kullanılamaz.
zh_hans: 类型“{0}”的容器“{1}”未声明为“Public”，因此不能用在特性中。
zh_hant: 無法在屬性中使用類型 '{0}'，因為其容器 '{1}' 未宣告為 'Public'。

# ERR_DllImportOnNonEmptySubOrFunction
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to a Sub, Function, or Operator with a non-empty body.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro proceduru Sub, Function nebo Operator, která nemá prázdné tělo.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf "Sub", "Function" oder "Operator" angewendet werden, die Text enthalten.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a Sub, Function u Operator con un cuerpo no vacío.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à un Sub, Function ou Operator avec un corps non vide.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a Sub, Function o Operator con un corpo non vuoto.
ja: 'System.Runtime.InteropServices.DllImportAttribute' を、空でない本体を持つ Sub、Function、または Operator に適用することはできません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 본문이 비어 있는 Sub, Function 또는 Operator에만 적용할 수 있습니다.
pl: 'Elementu „System.Runtime.InteropServices.DllImportAttribute” nie można zastosować do elementu Sub, Function lub Operator z niepustą treścią.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicado a um Sub, Function, ou Operator com um corpo não vazio.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не может применяться к блоку Sub, Function или Operator с непустым телом.
tr: 'System.Runtime.InteropServices.DllImportAttribute' gövdesi boş olmayan bir Sub, Function veya Operator üzerine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于带有非空体的 Sub、Function 或 Operator。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至非空白主體的 Sub、Function 或 Operator。
