Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ComClassRequiresPublicClass2
source: 'Microsoft.VisualBasic.ComClassAttribute' cannot be applied to '{0}' because its container '{1}' is not declared 'Public'.
cs: 'Atribut Microsoft.VisualBasic.ComClassAttribute nejde uplatnit na třídu {0}, protože její kontejner {1} není deklarovaný jako Public.
de: 'Microsoft.VisualBasic.ComClassAttribute kann nicht auf "{0}" angewendet werden, da sein Container "{1}" nicht als "Public" deklariert ist.
es: 'Microsoft.VisualBasic.ComClassAttribute' no se puede aplicar a '{0}' porque su contenedor '{1}' no está declarado como 'Public'.
fr: 'Impossible d'appliquer 'Microsoft.VisualBasic.ComClassAttribute' à '{0}', car son conteneur '{1}' n'est pas déclaré 'Public'.
it: 'Non è possibile applicare 'Microsoft.VisualBasic.ComClassAttribute' a '{0}' perché il relativo contenitore '{1}' non è dichiarato 'come Public'.
ja: 'Microsoft.VisualBasic.ComClassAttribute' は、そのコンテナー '{1}' が 'Public' と宣言されていないため、'{0}' に適用できません。
ko: '해당 컨테이너 '{1}'가 'Public'으로 선언되지 않았으므로 'Microsoft.VisualBasic.ComClassAttribute'를 '{0}'에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „Microsoft.VisualBasic.ComClassAttribute” do elementu „{0}”, ponieważ jego kontener „{1}” nie jest zadeklarowany jako „Public”.
pt_br: "Microsoft.VisualBasic.ComClassAttribute" não pode ser aplicado a "{0}" porque seu contêiner "{1}" não está declarado como "Public".
ru: '"Microsoft.VisualBasic.ComClassAttribute" нельзя использовать для "{0}", так как контейнер "{1}" не объявлен как "Public".
tr: '{1}' kapsayıcısı 'Public' olarak bildirilmediğinden, 'Microsoft.VisualBasic.ComClassAttribute' '{0}' için uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”的容器“{1}”未声明为“Public”，因此不能应用于“{0}”。
zh_hant: 'Microsoft.VisualBasic.ComClassAttribute' 無法套用至 '{0}'，因為其容器 '{1}' 未宣告為 'Public'。

# ERR_ComClassReservedDispIdZero1
source: 'System.Runtime.InteropServices.DispIdAttribute' cannot be applied to '{0}' because 'Microsoft.VisualBasic.ComClassAttribute' reserves zero for the default property.
cs: 'Atribut System.Runtime.InteropServices.DispIdAttribute nejde použít na třídu {0}, protože atribut Microsoft.VisualBasic.ComClassAttribute má vyhrazenou nulu pro výchozí vlastnost.
de: 'System.Runtime.InteropServices.DispIdAttribute kann nicht auf "{0}" angewendet werden, da Microsoft.VisualBasic.ComClassAttribute Null für die Standardeigenschaft reserviert.
es: 'System.Runtime.InteropServices.DispIdAttribute' no se puede aplicar a '{0}' porque 'Microsoft.VisualBasic.ComClassAttribute' reserva el cero para la propiedad predeterminada.
fr: 'System.Runtime.InteropServices.DispIdAttribute' ne peut pas être appliqué à '{0}', car 'Microsoft.VisualBasic.ComClassAttribute' réserve zéro pour la propriété par défaut.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DispIdAttribute' a '{0}' perché 'Microsoft.VisualBasic.ComClassAttribute' riserva il valore zero per la proprietà predefinita.
ja: 'Microsoft.VisualBasic.ComClassAttribute' は、既定のプロパティに対して 0 を予約するため、'System.Runtime.InteropServices.DispIdAttribute' を '{0}' に適用できません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'는 기본 속성으로 0을 예약하므로 'System.Runtime.InteropServices.DispIdAttribute'를 '{0}'에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „System.Runtime.InteropServices.DispIdAttribute” do elementu „{0}”, ponieważ element „Microsoft.VisualBasic.ComClassAttribute” rezerwuje zero jako właściwość domyślną.
pt_br: "System.Runtime.InteropServices.DispIdAttribute" não pode ser aplicado a "{0}" porque "Microsoft.VisualBasic.ComClassAttribute" reserva para a propriedade padrão.
ru: '"System.Runtime.InteropServices.DispIdAttribute" нельзя использовать для "{0}", так как "Microsoft.VisualBasic.ComClassAttribute" резервирует нулевое значение для свойства по умолчанию.
tr: 'Microsoft.VisualBasic.ComClassAttribute' sıfır değerini varsayılan özellik için ayırdığından 'System.Runtime.InteropServices.DispIdAttribute' '{0}' için uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”为默认属性保留的值为零，因此“System.Runtime.InteropServices.DispIdAttribute”不能应用于“{0}”。
zh_hant: 'System.Runtime.InteropServices.DispIdAttribute' 無法套用至 '{0}'，因為 'Microsoft.VisualBasic.ComClassAttribute' 為預設屬性保留的值為零。

# ERR_ComClassReservedDispId1
source: 'System.Runtime.InteropServices.DispIdAttribute' cannot be applied to '{0}' because 'Microsoft.VisualBasic.ComClassAttribute' reserves values less than zero.
cs: 'Atribut System.Runtime.InteropServices.DispIdAttribute nejde použít na třídu {0}, protože atribut Microsoft.VisualBasic.ComClassAttribute má vyhrazené hodnoty menší než nula.
de: 'System.Runtime.InteropServices.DispIdAttribute kann nicht auf "{0}" angewendet werden, da Microsoft.VisualBasic.ComClassAttribute Werte reserviert, die kleiner als Null sind.
es: 'System.Runtime.InteropServices.DispIdAttribute' no se puede aplicar a '{0}' porque 'Microsoft.VisualBasic.ComClassAttribute' reserva valores inferiores a cero.
fr: 'System.Runtime.InteropServices.DispIdAttribute' ne peut pas être appliqué à '{0}', car 'Microsoft.VisualBasic.ComClassAttribute' réserve des valeurs inférieures à zéro.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DispIdAttribute' a '{0}' perché 'Microsoft.VisualBasic.ComClassAttribute' riserva valori minori di zero.
ja: 'Microsoft.VisualBasic.ComClassAttribute' は 0 より小さい値を予約するため、'System.Runtime.InteropServices.DispIdAttribute' を '{0}' に適用できません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'는 0보다 작은 값을 예약하므로 'System.Runtime.InteropServices.DispIdAttribute'를 '{0}'에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „System.Runtime.InteropServices.DispIdAttribute” do elementu „{0}”, ponieważ element „Microsoft.VisualBasic.ComClassAttribute” rezerwuje wartości mniejsze od zera.
pt_br: "System.Runtime.InteropServices.DispIdAttribute" não pode ser aplicado a "{0}" porque "Microsoft.VisualBasic.ComClassAttribute" reserva valores menores que zero.
ru: '"System.Runtime.InteropServices.DispIdAttribute" нельзя использовать для "{0}", так как "Microsoft.VisualBasic.ComClassAttribute" резервирует значения меньше нуля.
tr: 'Microsoft.VisualBasic.ComClassAttribute' sıfırdan küçük değerleri ayırdığından, 'System.Runtime.InteropServices.DispIdAttribute' '{0}' için uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”保留的值小于零，因此“System.Runtime.InteropServices.DispIdAttribute”不能应用于“{0}”。
zh_hant: 'System.Runtime.InteropServices.DispIdAttribute' 無法套用至 '{0}'，因為 'Microsoft.VisualBasic.ComClassAttribute' 保留的值小於零。

# ERR_ComClassDuplicateGuids1
source: 'InterfaceId' and 'EventsId' parameters for 'Microsoft.VisualBasic.ComClassAttribute' on '{0}' cannot have the same value.
cs: 'Parametry InterfaceId a EventsId pro atribut Microsoft.VisualBasic.ComClassAttribute třídy {0} nemůžou mít stejnou hodnotu.
de: 'Die Parameter "InterfaceId" und "EventsId" für Microsoft.VisualBasic.ComClassAttribute auf "{0}" können nicht denselben Wert haben.
es: 'Los parámetros 'InterfaceId' y 'EventsId' para 'Microsoft.VisualBasic.ComClassAttribute' en '{0}' no pueden tener el mismo valor.
fr: 'Les paramètres 'InterfaceId' et 'EventsId' pour 'Microsoft.VisualBasic.ComClassAttribute' pour '{0}' ne peuvent pas avoir la même valeur.
it: 'I parametri 'InterfaceId' e 'EventsId' per 'Microsoft.VisualBasic.ComClassAttribute' in '{0}' non possono avere lo stesso valore.
ja: '{0}' の 'Microsoft.VisualBasic.ComClassAttribute' で 'InterfaceId' および 'EventsId' パラメーターに同じ値を指定することはできません。
ko: '{0}'의 'Microsoft.VisualBasic.ComClassAttribute'에 대한 'InterfaceId' 및 'EventsId' 매개 변수에는 같은 값을 사용할 수 없습니다.
pl: 'Parametry „InterfaceId” i „EventsId” dla elementu „Microsoft.VisualBasic.ComClassAttribute” w elemencie „{0}” nie mogą mieć tej samej wartości.
pt_br: 'Parâmetros "InterfaceId" e "EventsId" para "Microsoft.VisualBasic.ComClassAttribute" em "{0}" não podem ter o mesmo valor.
ru: 'Значения параметров "InterfaceId" и "EventsId" для "Microsoft.VisualBasic.ComClassAttribute" в "{0}" не могут совпадать.
tr: '{0}' üzerinde 'Microsoft.VisualBasic.ComClassAttribute' için 'InterfaceId' ve 'EventsId' parametrelerinin değeri aynı olamaz.
zh_hans: '“{0}”上“Microsoft.VisualBasic.ComClassAttribute”的“InterfaceId”和“EventsId”参数的值不能相同。
zh_hant: '位於 '{0}' 的 'Microsoft.VisualBasic.ComClassAttribute' 之 'InterfaceId' 與 'EventsId' 參數，不可有相同的值。

# ERR_ComClassCantBeAbstract0
source: 'Microsoft.VisualBasic.ComClassAttribute' cannot be applied to a class that is declared 'MustInherit'.
cs: 'Atribut Microsoft.VisualBasic.ComClassAttribute nejde použít pro třídu s deklarací MustInherit.
de: 'Microsoft.VisualBasic.ComClassAttribute kann nicht auf eine Klasse angewendet werden, die als "MustInherit" deklariert ist.
es: 'Microsoft.VisualBasic.ComClassAttribute' no se puede aplicar a una clase declarada como 'MustInherit'.
fr: 'Microsoft.VisualBasic.ComClassAttribute' ne peut pas être appliqué à une classe qui est déclarée 'MustInherit'.
it: 'Non è possibile applicare 'Microsoft.VisualBasic.ComClassAttribute' a una classe dichiarata come 'MustInherit'.
ja: 'Microsoft.VisualBasic.ComClassAttribute' を、'MustInherit' に宣言されているクラスに適用することはできません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'는 'MustInherit'으로 선언된 클래스에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „Microsoft.VisualBasic.ComClassAttribute” do klasy, która jest zadeklarowana jako „MustInherit”.
pt_br: 'Não é possível aplicar 'Microsoft.VisualBasic.ComClassAttribute' a uma classe declarada 'MustInherit'.
ru: 'Атрибут Microsoft.VisualBasic.ComClassAttribute не может применяться к классу, объявленному с модификатором MustInherit.
tr: 'Microsoft.VisualBasic.ComClassAttribute' 'MustInherit' olarak bildirilen bir sınıfa uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”不能应用于被声明为“MustInherit”的类。
zh_hant: 'Microsoft.VisualBasic.ComClassAttribute' 無法套用至宣告為 'MustInherit' 的類別。

# ERR_ComClassRequiresPublicClass1
source: 'Microsoft.VisualBasic.ComClassAttribute' cannot be applied to '{0}' because it is not declared 'Public'.
cs: 'Atribut Microsoft.VisualBasic.ComClassAttribute nejde použít pro {0}, protože nemá nastavenou deklaraci Public.
de: 'Microsoft.VisualBasic.ComClassAttribute kann nicht auf "{0}" angewendet werden, da es nicht als "Public" deklariert ist.
es: 'Microsoft.VisualBasic.ComClassAttribute' no se puede aplicar a '{0}' porque no está declarado como 'Public'.
fr: 'Microsoft.VisualBasic.ComClassAttribute' ne peut pas être appliqué à '{0}', car il n'est pas déclaré 'Public'.
it: 'Non è possibile applicare 'Microsoft.VisualBasic.ComClassAttribute' a '{0}' perché non è dichiarato come 'Public'.
ja: 'Microsoft.VisualBasic.ComClassAttribute' は、'Public' と宣言されていないため、'{0}' に適用できません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'는 'Public'으로 선언되지 않았으므로 '{0}'에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „Microsoft.VisualBasic.ComClassAttribute” do elementu „{0}”, ponieważ nie jest on zadeklarowany jako „Public”.
pt_br: "Microsoft.VisualBasic.ComClassAttribute" não pode ser aplicado a "{0}" porque não está declarado como "Public".
ru: '"Microsoft.VisualBasic.ComClassAttribute" нельзя использовать для "{0}", так как он не объявлен как "Public".
tr: 'Public' olarak bildirildiğinden, 'Microsoft.VisualBasic.ComClassAttribute' '{0}' için uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”未声明为“Public”，因此不能应用于“{0}”。
zh_hant: 'Microsoft.VisualBasic.ComClassAttribute' 無法套用至 '{0}'，因為其未宣告為 'Public'。

# ERR_UnknownOperator
source: Operator declaration must be one of: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
cs: Operátor musí být deklarovaný jako +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue nebo IsFalse.
de: Folgende Operatordeklarationen sind zulässig: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
es: La declaración del operador debe ser uno de los siguientes valores: +, -, *, \\, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
fr: La déclaration d'opérateur doit être l'une des suivantes : +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
it: La dichiarazione dell'operatore deve essere una delle seguenti: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
ja: 演算子宣言は次のいずれかでなければなりません: +、-、*、\、/、^、&、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue、IsFalse。
ko: 연산자 선언은 +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse 중 하나여야 합니다.
pl: Deklaracja operatora musi mieć jedną z następujących wartości: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
pt_br: A declaração de operador deve ser um destes itens: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
ru: В объявлении оператора должен использоваться один из следующих операторов: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
tr: İşleç bildirimi şunlardan biri olmalıdır: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<,>>, =, <>, <, <=,>,>=, CType, IsTrue, IsFalse.
zh_hans: 运算符声明必须是以下符号之一: +、-、*、\、/、^、&,、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue 和 IsFalse。
zh_hant: 運算子宣告必須為下列其中之一: +、-、*、\、/、^、&、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue、IsFalse。

# ERR_DuplicateConversionCategoryUsed
source: 'Widening' and 'Narrowing' cannot be combined.
cs: 'Možnosti Widening a Narrowing nejde kombinovat.
de: "Widening" und "Narrowing" können nicht kombiniert werden.
es: 'Widening' y 'Narrowing' no se pueden combinar.
fr: 'Widening' et 'Narrowing' ne peuvent pas être combinés.
it: 'Non è possibile combinare 'Widening' e 'Narrowing'.
ja: 'Widening' と 'Narrowing' を組み合わせて使用することはできません。
ko: 'Widening'과 'Narrowing'은 함께 사용할 수 없습니다.
pl: 'Nie można łączyć elementów Widening i Narrowing.
pt_br: 'Não é possível combinar 'Widening' e 'Narrowing'.
ru: '"Widening" и "Narrowing" нельзя использовать вместе.
tr: 'Widening' ile 'Narrowing' birleştirilemez.
zh_hans: '"Widening" 不能与 "Narrowing" 组合。
zh_hant: '無法合併 'Widening' 和 'Narrowing'。

# ERR_OperatorNotOverloadable
source: Operator is not overloadable. Operator declaration must be one of: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
cs: Operátor nejde přetěžovat. Musí být deklarován jako +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue nebo IsFalse.
de: Der Operator kann nicht überladen werden. Folgende Operatordeklarationen sind zulässig: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
es: El operador no se puede sobrecargar. La declaración del operador debe tener uno de los siguientes valores: +, -, *, \\, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
fr: L'opérateur n'est pas surchargeable. La déclaration d'opérateur doit être l'une des suivantes : +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
it: L'operatore non supporta l'overload. La dichiarazione dell'operatore deve essere una delle seguenti: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
ja: 演算子はオーバーロードできません。演算子宣言は次のいずれかでなければなりません: +、-、*、\、/、^、&、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue、IsFalse.
ko: 연산자를 오버로드할 수 없습니다. 연산자 선언은 +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse 중 하나여야 합니다.
pl: Operatora nie można przeciążyć. Deklaracja operatora musi mieć jedną z następujących wartości: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
pt_br: O operador não é sobrecarregável. A declaração do operador deve ser um destes itens: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
ru: Оператор не поддерживает перегрузку. В объявлении оператора должен использоваться один из следующих операторов: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<, >>, =, <>, <, <=, >, >=, CType, IsTrue, IsFalse.
tr: İşleç aşırı yüklenebilir değil. İşleç bildirimi şunlardan biri olmalıdır: +, -, *, \, /, ^, &, Like, Mod, And, Or, Xor, Not, <<,>>, =, <>, <, <=,>,>=, CType, IsTrue, IsFalse.
zh_hans: 运算符不可重载。运算符声明必须是以下符号之一: +、-、*、\、/、^、&,、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue 和 IsFalse。
zh_hant: 運算子不可多載。運算子宣告必須為下列其中之一: +、-、*、\、/、^、&、Like、Mod、And、Or、Xor、Not、<<、>>、=、<>、<、<=、>、>=、CType、IsTrue、IsFalse。

# ERR_InvalidHandles
source: 'Handles' is not valid on operator declarations.
cs: 'Handles není platná deklarace operátoru.
de: '"Handles" ist für Operatordeklarationen nicht gültig.
es: 'Handles' no es válido en declaraciones de operadores.
fr: 'Handles' n'est pas valide pour les déclarations d'opérateur.
it: 'Handles' non è valido nelle dichiarazioni di operatore.
ja: 'Handles' は演算子の宣言で有効ではありません。
ko: '연산자 선언에는 'Handles'를 사용할 수 없습니다.
pl: 'Element Handles nie jest prawidłowy w deklaracjach operatora.
pt_br: 'Handles' não é válido em declarações de operador.
ru: 'Недопустимое использование "Handles" в объявлении оператора.
tr: 'Handles' işleç bildirimlerinde geçerli değil.
zh_hans: '“Handles”在运算符声明上无效。
zh_hant: 'Handles' 在運算子宣告中無效。

# ERR_InvalidImplements
source: 'Implements' is not valid on operator declarations.
cs: 'Implements není platná deklarace operátoru.
de: '"Implements" ist für Operatordeklarationen nicht gültig.
es: 'Implements' no es válido en declaraciones de operadores.
fr: 'Implements' n'est pas valide pour les déclarations d'opérateur.
it: 'Implements' non è valido nelle dichiarazioni di operatore.
ja: 'Implements' は演算子の宣言で有効ではありません。
ko: '연산자 선언에는 'Implements'를 사용할 수 없습니다.
pl: 'Element Implements nie jest prawidłowy w deklaracjach operatora.
pt_br: 'Implements' não é válido em declarações de operador.
ru: 'Недопустимое использование "Implements" в объявлении оператора.
tr: 'Implements' işleç bildirimlerinde geçerli değil.
zh_hans: '“Implements”在运算符声明上无效。
zh_hant: 'Implements' 在運算子宣告中無效。

# ERR_EndOperatorExpected
source: 'End Operator' expected.
cs: 'Očekával se příkaz End Operator.
de: '"End Operator" erwartet.
es: 'Se esperaba 'End Operator'.
fr: 'End Operator' attendu.
it: 'È previsto 'End Operator'.
ja: 'End Operator' が必要です。
ko: 'End Operator'가 필요합니다.
pl: 'Oczekiwano elementu „End Operator”.
pt_br: 'End Operator' esperado.
ru: 'Требуется оператор "End Operator".
tr: 'End Operator' bekleniyor.
zh_hans: '应为 "End Operator"。
zh_hant: '必須是 'End Operator'。

# ERR_EndOperatorNotAtLineStart
source: 'End Operator' must be the first statement on a line.
cs: 'Příkaz End Operator musí být prvním příkazem na řádku.
de: '"End Operator" muss die erste Anweisung der Zeile sein.
es: 'End Operator' debe ser la primera instrucción de una línea.
fr: 'End Operator' doit être la première instruction sur une ligne.
it: 'End Operator' deve essere la prima istruzione di una riga.
ja: 'End Operator' は、行の最初のステートメントでなければなりません。
ko: 'End Operator'는 줄의 첫 번째 문이어야 합니다.
pl: 'Element End Operator musi być pierwszą instrukcją w wierszu.
pt_br: 'End Operator' deve ser a primeira instrução em uma linha.
ru: 'Оператор "End Operator" должен быть первым выражением в строке.
tr: 'End Operator' satırdaki ilk deyim olmalıdır.
zh_hans: '“End Operator”必须是一行中的第一条语句。
zh_hant: 'End Operator' 必須是該行的第一個陳述式。

# ERR_InvalidEndOperator
source: 'End Operator' must be preceded by a matching 'Operator'.
cs: 'Příkazu End Operator musí předcházet párový příkaz Operator.
de: '"End Operator" muss eine entsprechendes "Operator" voranstehen.
es: 'End Operator' debe ir precedida de una instrucción 'Operator' correspondiente.
fr: 'End Operator' doit être précédé d'un 'Operator' correspondant.
it: 'End Operator' deve essere preceduto da un elemento 'Operator' corrispondente.
ja: 'End Operator' の前には、対応する 'Operator' を指定しなければなりません。
ko: 'End Operator'는 짝이 되는 'Operator' 뒤에 와야 합니다.
pl: 'Element „End Operator” musi być poprzedzony odpowiadającym mu elementem „Operator”.
pt_br: 'End Operator' deve ser precedido por um 'Operator' correspondente.
ru: 'Оператору "End Operator" должен предшествовать соответствующий оператор "Operator".
tr: 'End Operator' öncesinde eşleşen bir 'Operator' olmalıdır.
zh_hans: '“End Operator”前面必须是匹配的“Operator”。
zh_hant: 'End Operator' 之前必須搭配相對應的 'Operator'。

# ERR_ExitOperatorNotValid
source: 'Exit Operator' is not valid. Use 'Return' to exit an operator.
cs: 'Příkaz Exit Operator není platný. K ukončení operátoru použijte příkaz Return.
de: '"Exit Operator" ist nicht gültig. Verwenden Sie "Return", um einen Operator zu beenden.
es: 'Exit Operator' no es válido. Use 'Return' para salir de un operador.
fr: 'Exit Operator' n'est pas valide. Utilisez 'Return' pour quitter un opérateur.
it: 'Exit Operator' non è valido. Usare 'Return' per uscire da un operatore.
ja: 'Exit Operator' は有効ではありません。演算を終了するには、'Return' を使用してください。
ko: 'Exit Operator'가 잘못되었습니다. 연산자를 종료하려면 'Return'을 사용하세요.
pl: 'Element Exit Operator jest nieprawidłowy. Użyj elementu Return, aby wyjść z operatora.
pt_br: 'Exit Operator' não é válido. Use 'Return' para sair de um operador.
ru: 'Недопустимое применение оператора Exit Operator. Используйте "Return", чтобы выйти из оператора.
tr: 'Exit Operator' geçerli değil. İşleçten çıkmak için 'Return' kullanın.
zh_hans: '"Exit Operator" 无效。请使用 "Return" 从运算符中退出。
zh_hant: 'Exit Operator' 無效。請使用 'Return' 結束運算子。

# ERR_ParamArrayIllegal1
source: '{0}' parameters cannot be declared 'ParamArray'.
cs: 'Pro parametry ({0}) nejde použít deklaraci ParamArray.
de: '{0}-Parameter können nicht als ParamArray deklariert werden.
es: 'Los parámetros '{0}' no se pueden declarar como 'ParamArray'.
fr: 'Les paramètres '{0}' ne peuvent pas être déclarés 'ParamArray'.
it: 'I parametri '{0}' non possono essere dichiarati come 'ParamArray'.
ja: '{0}' パラメーターを 'ParamArray' として宣言することはできません。
ko: '{0}' 매개 변수는 'ParamArray'로 선언할 수 없습니다.
pl: 'Parametrów „{0}” nie można zadeklarować jako „ParamArray”.
pt_br: "{0}" parâmetros não podem ser declarados "ParamArray".
ru: '"Параметры {0}" не могут быть объявлены "ParamArray".
tr: '{0}' parametreleri 'ParamArray' olarak bildirilemez.
zh_hans: “{0}”参数不能声明为 "ParamArray"。
zh_hant: '{0}' 參數不可宣告為 'ParamArray'。

# ERR_OptionalIllegal1
source: '{0}' parameters cannot be declared 'Optional'.
cs: 'Pro parametry ({0}) nejde použít deklaraci Optional.
de: '{0}-Parameter können nicht als "Optional" deklariert werden.
es: 'Los parámetros '{0}' no se pueden declarar como 'Optional'.
fr: 'Les paramètres '{0}' ne peuvent pas être déclarés 'Optional'.
it: 'I parametri di '{0}' non possono essere dichiarati come 'Optional'.
ja: '{0}' パラメーターを 'Optional' として宣言することはできません。
ko: '{0}' 매개 변수는 'Optional'로 선언할 수 없습니다.
pl: 'Parametrów „{0}” nie można zadeklarować jako „Optional”.
pt_br: "{0}" parâmetros não podem ser declarados "Optional".
ru: "{0}" не могут быть объявлены "Optional".
tr: '{0}' parametreleri 'Optional' olarak bildirilemez.
zh_hans: '“{0}”参数不能声明为“Optional”。
zh_hant: '{0}' 參數不可宣告為 'Optional'。

# ERR_OperatorMustBePublic
source: Operators must be declared 'Public'.
cs: Operátory je nutné deklarovat jako Public.
de: Operatoren müssen als "Public" deklariert werden.
es: Los operadores se deben declarar como 'Public'.
fr: Les opérateurs doivent être déclarés 'Public'.
it: Gli operatori devono essere dichiarati come 'Public'.
ja: 演算子は 'Public' として宣言されなければなりません。
ko: 연산자를 'Public'으로 선언해야 합니다.
pl: Operatory należy zadeklarować jako „Public”.
pt_br: Operadores devem ser declarados 'Public'.
ru: Операторы необходимо объявить как "Public".
tr: İşleçler 'Public' olarak bildirilmelidir.
zh_hans: 运算符必须声明为 "Public"。
zh_hant: 運算子必須宣告為 'Public'。
