Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_LoopControlMustNotBeProperty
source: Loop control variable cannot be a property or a late-bound indexed array.
cs: Řídicí proměnnou smyčky nemůže být vlastnost ani indexované pole s pozdní vazbou.
de: Eine Schleifensteuervariable kann keine Eigenschaft und kein spät gebundenes indiziertes Array sein.
es: La variable de control Loop no puede ser una propiedad o una matriz indizada enlazada en tiempo de ejecución.
fr: Une variable de contrôle de boucle ne peut pas être une propriété ni un tableau indexé à liaison tardive.
it: La variabile di controllo ciclo non può essere una proprietà o una matrice indicizzata per cui è prevista l'associazione tardiva.
ja: プロパティや遅延バインディングされたインデックス付き配列をループ制御変数にすることはできません。
ko: 루프 제어 변수는 속성 또는 런타임에 바인딩된 인덱스 배열일 수 없습니다.
pl: Zmienna sterująca pętli nie może być właściwością ani tablicą indeksowaną z późnym wiązaniem.
pt_br: Variável de controle de loop não pode ser propriedade ou matriz indexada de associação tardia.
ru: Переменной цикла не может являться свойство или проиндексированный массив с поздним связыванием.
tr: Döngü denetim değişkeni bir özellik veya geç bağlanan dizine alınmış bir dizi olamaz.
zh_hans: 循环控制变量不能是属性或后期绑定索引数组。
zh_hant: 迴圈控制變數不可以是屬性或晚期繫結索引陣列。

# ERR_MethodBodyNotAtLineStart
source: First statement of a method body cannot be on the same line as the method declaration.
cs: První příkaz těla metody nemůže být na stejném řádku jako deklarace metody.
de: Die erste Anweisung eines Methodenkörpers darf sich nicht in derselben Zeile wie die Methodendeklaration befinden.
es: La primera instrucción de un cuerpo de método no puede estar en la misma línea que la declaración del método.
fr: La première instruction du corps d'une méthode ne peut pas se trouver sur la même ligne que la déclaration de la méthode.
it: La prima istruzione di un corpo del metodo non può essere sulla stessa riga della dichiarazione del metodo.
ja: メソッド本体の最初のステートメントをメソッド宣言と同じ行に記述することはできません。
ko: 메서드 본문의 첫째 문은 메서드 선언과 같은 줄에 있을 수 없습니다.
pl: Pierwsza instrukcja treści metody nie może znajdować się w tym samym wierszu co deklaracja metody.
pt_br: A primeira instrução do corpo de um método não pode estar na mesma linha da declaração de método.
ru: Первый оператор тела метода не может находиться на одной строке с объявлением этого метода.
tr: Yöntem gövdesinin ilk deyimi yöntem bildirimiyle aynı satırda olamaz.
zh_hans: 方法主体的第一条语句和方法声明不能位于同一行。
zh_hant: 方法主體的第一個陳述式不可以和方法宣告在同一行上。

# ERR_MaximumNumberOfErrors
source: Maximum number of errors has been exceeded.
cs: Je překročený maximální počet chyb.
de: Die maximale Fehleranzahl wurde überschritten.
es: Se ha superado el número máximo de errores.
fr: Le nombre maximal d'erreurs est dépassé.
it: È stato superato il numero massimo di errori consentiti.
ja: エラーの最大数の制限を超えました。
ko: 최대 오류 개수를 초과했습니다.
pl: Przekroczono maksymalną liczbę błędów.
pt_br: Número máximo de erros excedido.
ru: Превышено допустимое число ошибок.
tr: Hata sayısı üst sınırı aşıldı.
zh_hans: 已超出最大错误数。
zh_hant: 已超過錯誤上限數。

# ERR_UseOfKeywordNotInInstanceMethod1
source: '{0}' is valid only within an instance method.
cs: 'Prvek {0} je platný jenom v rámci instanční metody.
de: '"{0}" ist nur innerhalb einer Instanzmethode gültig.
es: '{0}' solo es válido en un método de instancia.
fr: '{0}' est valide uniquement dans une méthode d'instance.
it: '{0}' è valido solo all'interno di un metodo di istanza.
ja: '{0}' は、インスタンス メソッド内でのみ有効です。
ko: '{0}'은(는) 인스턴스 메서드 내에서만 유효합니다.
pl: 'Element „{0}” jest prawidłowy tylko wewnątrz metody wystąpienia.
pt_br: "{0}" é válido somente em um método de instância.
ru: "{0}" допускается только в методе экземпляра.
tr: '{0}' yalnızca bir örnek yöntemi içinde geçerli.
zh_hans: '“{0}”仅在实例方法中有效。
zh_hant: '{0}' 只在執行個體方法中有效。

# ERR_UseOfKeywordFromStructure1
source: '{0}' is not valid within a structure.
cs: 'Prvek {0} není platný v rámci struktury.
de: '"{0}" ist innerhalb einer Struktur ungültig.
es: '{0}' no es válido dentro de una estructura.
fr: '{0}' n'est pas valide dans une structure.
it: '{0}' non è valido all'interno di una struttura.
ja: '{0}' は、構造体内では有効ではありません。
ko: '구조체 내에서는 {0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w ramach struktury.
pt_br: "{0}" não é válido dentro de uma estrutura.
ru: "{0}" не является допустимым в структуре.
tr: '{0}', yapı içinde geçerli değil.
zh_hans: '“{0}”在结构中无效。
zh_hant: '{0}' 在結構中無效。

# ERR_BadAttributeConstructor1
source: Attribute constructor has a parameter of type '{0}', which is not an integral, floating-point or Enum type or one of Object, Char, String, Boolean, System.Type or 1-dimensional array of these types.
cs: Konstruktor atributů používá parametr typu {0}, který není celočíselný ani s plovoucí desetinnou čárkou, výčtového typu ani jednoho z typů Object, Char, String, Boolean, System.Type či jednorozměrných polí těchto typů.
de: Der Attributkonstruktor hat einen Parameter vom Typ "{0}", der kein integraler Typ, kein Gleitkomma- oder Enumerationstyp und nicht "Object", "Char", "String", "Boolean", "System.Type" oder ein eindimensionales Array dieser Typen ist.
es: El constructor de atributos tiene un parámetro de tipo '{0}', que no es de tipo integral, punto flotante o enumeración, ni de tipo Object, Char, String, Boolean o System.Type, ni una matriz unidimensional de estos tipos.
fr: Le constructeur d'attribut a un paramètre de type '{0}', qui n'est pas un type intégral, virgule flottante ni Enum, ni encore Object, Char, String, Boolean, System.Type ou un tableau unidimensionnel de ces types.
it: Il costruttore di attributo ha un parametro di tipo '{0}', che non è di tipo integrale, a virgola mobile o enumerazione e neppure di tipo Object, Char, String, Boolean, System.Type, né una matrice unidimensionale di tali tipi.
ja: Attribute コンストラクターに、型 '{0}' のパラメーターが指定されていますが、整数型、浮動小数点型、列挙型、あるいは Object, Char、String、Boolean、System.Type のいずれかまたはこれらの型の 1 次元配列のどれにも該当しません。
ko: 특성 생성자의 매개 변수 형식은 '{0}'입니다. 이 형식이 정수 계열, 부동 소수점 또는 열거형이 아니거나, Object, Char, String, Boolean, System.Type 또는 이러한 형식의 1차원 배열이 아닙니다.
pl: Konstruktor atrybutu ma parametr typu „{0}”, który nie jest typem całkowitym, zmiennoprzecinkowym ani wyliczeniowym, jak również żadnym z typów Object, Char, String, Boolean lub System.Type ani jednowymiarową tablicą składającą się z tych typów.
pt_br: Construtor de atributos tem um parâmetro de tipo "{0}", o qual não é um tipo integral, ponto flutuante ou Enum ou um de Object, Char, String, Boolean, System.Type ou matriz unidimensional desses tipos.
ru: Конструктор атрибута имеет параметр типа "{0}", который не является ни целым числом или числом с плавающей запятой, ни перечислением, ни параметром одного из следующих типов: Object, Char, String, Boolean или System.Type, ни одномерным массивом этих типов.
tr: Öznitelik oluşturucusunda bulunan '{0}' türündeki parametre tam sayı, kayan noktalı veya Sabit Listesi türünde değil ya da bu türlerin Object, Char, String, Boolean, System.Type veya 1 boyutlu dizisi değil.
zh_hans: 特性构造函数具有“{0}”类型的参数，此参数不是整型、浮点型或枚举类型，也不是 Object、Char、String、Boolean、System.Type 之一或这些类型的一维数组。
zh_hant: 屬性建構函式的參數類型為 '{0}'，其非整數、浮點或列舉類型，也不是 Object、Char、String、Boolean、System.Type 或這些類型的一維陣列。

# ERR_ParamArrayWithOptArgs
source: Method cannot have both a ParamArray and Optional parameters.
cs: Metoda nemůže mít současně parametr ParamArray i Optional.
de: Die Methode kann nicht über einen ParamArray-Parameter und einen Optional-Parameter verfügen.
es: El método no puede tener los parámetros ParamArray y Optional.
fr: La méthode ne peut pas comporter simultanément des paramètres ParamArray et Optional.
it: Il metodo non può accettare entrambi i parametri ParamArray e Optional.
ja: メソッドに ParamArray と省略可能なパラメーターの両方を指定することはできません。
ko: 메서드에는 ParamArray 매개 변수와 Optional 매개 변수를 함께 사용할 수 없습니다.
pl: Metoda nie może mieć zarówno parametru ParamArray, jak i Optional.
pt_br: Método não pode possuir ambos os parâmetros ParamArray e Optional.
ru: Метод не может одновременно иметь параметры ParamArray и Optional.
tr: Yöntemde hem ParamArray hem de Optional parametreleri olamaz.
zh_hans: 方法不能同时具有 ParamArray 和 Optional 参数。
zh_hant: 方法不可以同時有 ParamArray 和 Optional 引數。

# ERR_ExpectedArray1
source: '{0}' statement requires an array.
cs: 'Příkaz {0} vyžaduje pole.
de: '{0}-Anweisung erfordert ein Array.
es: 'La instrucción '{0}' requiere una matriz.
fr: 'L'instruction '{0}' requiert un tableau.
it: 'Nell'istruzione '{0}' è richiesta una matrice.
ja: '{0}' ステートメントには配列が必要です。
ko: '{0}' 문은 배열이 필요합니다.
pl: 'Instrukcja „{0}” wymaga tablicy.
pt_br: "{0}" instrução requer uma matriz.
ru: 'Оператор "{0}" требует массив.
tr: '{0}' deyimi için bir dizi gerekiyor.
zh_hans: '“{0}”语句需要数组。
zh_hant: '{0}' 陳述式需要陣列。

# ERR_ParamArrayNotArray
source: ParamArray parameter must be an array.
cs: Parametrem ParamArray musí být pole.
de: ParamArray-Parameter muss ein Array sein.
es: El parámetro ParamArray debe ser una matriz.
fr: Le paramètre ParamArray doit être un tableau.
it: Il parametro ParamArray deve essere una matrice.
ja: ParamArray パラメーターは配列でなければなりません。
ko: ParamArray 매개 변수는 배열이어야 합니다.
pl: Parametr ParamArray musi być tablicą.
pt_br: O parâmetro ParamArray deve ser uma matriz.
ru: Параметр ParamArray должен быть массивом.
tr: ParamArray parametresi bir dizi olmalı.
zh_hans: ParamArray 参数必须是一个数组。
zh_hant: ParamArray 參數必須為陣列。

# ERR_ParamArrayRank
source: ParamArray parameter must be a one-dimensional array.
cs: Parametrem ParamArray musí být jednorozměrné pole.
de: ParamArray-Parameter muss ein eindimensionales Array sein.
es: El parámetro ParamArray debe ser una matriz unidimensional.
fr: Le paramètre ParamArray doit être un tableau unidimensionnel.
it: Il parametro ParamArray deve essere una matrice unidimensionale.
ja: ParamArray パラメーターは 1 次元配列でなければなりません。
ko: ParamArray 매개 변수는 1차원 배열이어야 합니다.
pl: Parametr ParamArray musi być tablicą jednowymiarową.
pt_br: O parâmetro ParamArray deve ser uma matriz unidimensional.
ru: Параметр ParamArray должен быть одномерным массивом.
tr: ParamArray parametresi tek boyutlu bir dizi olmalı.
zh_hans: ParamArray 参数必须是一维数组。
zh_hant: ParamArray 參數必須是一維陣列。

# ERR_ArrayRankLimit
source: Array exceeds the limit of 32 dimensions.
cs: Pole překračuje omezení 32 rozměrů.
de: Arrays können nicht mehr als 32 Dimensionen aufweisen.
es: La matriz supera el límite de 32 dimensiones.
fr: Le tableau dépasse le nombre de 32 dimensions autorisées.
it: La matrice supera il limite di 32 dimensioni.
ja: 配列が、制限の 32 次元を超えています。
ko: 배열이 한계인 32차원을 초과합니다.
pl: Liczba wymiarów tablicy przekracza 32.
pt_br: A matriz excede o limite de 32 dimensões.
ru: Число измерений массива превышает максимально допустимое значение 32.
tr: Dizinin boyutu, 32 olan boyut sınırını aşıyor.
zh_hans: 数组超过了 32 维数限制。
zh_hant: 陣列超過 32 個維度的限制。

# ERR_AsNewArray
source: Arrays cannot be declared with 'New'.
cs: Pole nemůžou být deklarovaná pomocí klíčového slova New.
de: Arrays können nicht mit "New" deklariert werden.
es: Las matrices no se pueden declarar con 'New'.
fr: Les tableaux ne peuvent pas être déclarés avec 'New'.
it: Le matrici non possono essere dichiarate con 'New'.
ja: 配列を 'New' で宣言することはできません。
ko: 배열은 'New'로 선언할 수 없습니다.
pl: Nie można deklarować tablic przy użyciu instrukcji New.
pt_br: Matrizes não podem ser declaradas com 'New'.
ru: Массивы не могут объявляться с помощью ключевого слова "New".
tr: Diziler 'New' kullanılarak bildirilemez.
zh_hans: 不能用 "New" 声明数组。
zh_hant: 不可使用 'New' 宣告陣列。

# ERR_TooManyArgs1
source: Too many arguments to '{0}'.
cs: {0} má moc argumentů.
de: Zu viele Argumente für "{0}".
es: Demasiados argumentos para '{0}'.
fr: Arguments trop nombreux pour '{0}'.
it: Il numero di argomenti per '{0}' è eccessivo.
ja: '{0}' の引数が多すぎます。
ko: '{0}'에 대한 인수가 너무 많습니다.
pl: Za dużo argumentów elementu „{0}”.
pt_br: Muitos argumentos para "{0}".
ru: Слишком много аргументов для "{0}".
tr: '{0}' için çok fazla bağımsız değişken var.
zh_hans: “{0}”的参数太多。
zh_hant: '{0}' 的引數太多。

# ERR_ExpectedCase
source: Statements and labels are not valid between 'Select Case' and first 'Case'.
cs: Příkazy a návěstí nejsou platné mezi klíčovým slovem Select Case a prvním klíčovým slovem Case.
de: Anweisungen und Bezeichnungen sind zwischen "Select Case" und dem ersten Vorkommen von "Case" nicht gültig.
es: Las instrucciones y etiquetas no son válidas entre 'Select Case' y la primera instrucción 'Case'.
fr: Instructions et étiquettes non valides entre 'Select Case' et la première occurrence de 'Case'.
it: Istruzioni ed etichette non sono valide tra 'Select Case' e la prima clausola 'Case'.
ja: ステートメントおよびラベルは、'Select Case' と最初の 'Case' の間では有効ではありません。
ko: Select Case'와 첫 번째 'Case' 사이에는 문 및 레이블을 사용할 수 없습니다.
pl: Instrukcje i etykiety nie są prawidłowe między instrukcją Select Case a pierwszą instrukcją Case.
pt_br: Instruções e rótulos não são válidos entre 'Select Case' e o primeiro 'Case'.
ru: Операторы и метки между "Select Case" и первым блоком "Case" недопустимы.
tr: Select Case' ve ilk 'Case' arasında deyim ve etiketler geçerli değil.
zh_hans: 位于 "Select Case" 与第一个 "Case" 之间的语句和标签无效。
zh_hant: 在 'Select Case' 與第一個 'Case' 間，不可以使用陳述式和標籤。

# ERR_RequiredConstExpr
source: Constant expression is required.
cs: Vyžaduje se konstantní výraz.
de: Konstanter Ausdruck erforderlich.
es: Se requiere una expresión constante.
fr: Une expression constante est requise.
it: È necessaria l'espressione costante.
ja: 定数式が必要です。
ko: 상수 식이 필요합니다.
pl: Wymagane jest wyrażenie stałe.
pt_br: Expressão de constante necessária.
ru: Требуется константное выражение.
tr: Sabit ifade gerekli.
zh_hans: 要求常量表达式。
zh_hant: 必須是常數運算式。

# ERR_RequiredConstConversion2
source: Conversion from '{0}' to '{1}' cannot occur in a constant expression.
cs: V konstantním výrazu se nemůže použít převod z typu {0} na {1}.
de: Eine Konvertierung von "{0}" in "{1}" kann in einem konstanten Ausdruck nicht durchgeführt werden.
es: No se puede realizar una conversión de '{0}' a '{1}' en una expresión constante.
fr: Une conversion de '{0}' en '{1}' ne peut pas avoir lieu dans une expression constante.
it: In un'espressione costante non può verificarsi una conversione da '{0}' a '{1}'.
ja: 定数式において '{0}' から '{1}' への変換は発生しません。
ko: 상수 식에서는 '{0}'에서 '{1}'(으)로 변환할 수 없습니다.
pl: Konwersja z „{0}” na „{1}” nie może wystąpić w wyrażeniu stałym.
pt_br: Conversão de "{0}" para "{1}" não pode ocorrer em uma expressão constante.
ru: Преобразование "{0}" в "{1}" не может происходить в константном выражении.
tr: Sabit ifadede '{0}' - '{1}' dönüşümü yapılamaz.
zh_hans: 常量表达式中不能发生从“{0}”到“{1}”的转换。
zh_hant: 常數運算式中不可進行從 '{0}' 到 '{1}' 的轉換。

# ERR_InvalidMe
source: 'Me' cannot be the target of an assignment.
cs: 'Klíčové slovo Me nemůže být cílem přiřazení.
de: '"Me" kann nicht das Ziel einer Zuweisung sein.
es: 'Me' no puede ser el destino de una asignación.
fr: 'Me' ne peut pas être la cible d'une assignation.
it: 'Me' non può essere la destinazione di un'assegnazione.
ja: 'Me' を代入式のターゲットにすることはできません。
ko: 'Me'는 할당 대상일 수 없습니다.
pl: 'Element Me nie może być elementem docelowym przypisania.
pt_br: 'Me' não pode ser o destino de uma atribuição.
ru: '"Me" не может присваиваться значение.
tr: 'Me' bir atamanın hedefi olamaz.
zh_hans: '"Me" 不能作为赋值目标。
zh_hant: 'Me' 不可以是指派的目標。

# ERR_ReadOnlyAssignment
source: 'ReadOnly' variable cannot be the target of an assignment.
cs: 'Proměnná typu ReadOnly nemůže být cílem přiřazení.
de: 'ReadOnly-Variable kann nicht das Ziel einer Zuweisung sein.
es: 'La variable 'ReadOnly' no puede ser el destino de una asignación.
fr: 'Une variable 'ReadOnly' ne peut pas être la cible d'une assignation.
it: 'La variabile 'ReadOnly' non può essere la destinazione di un'assegnazione.
ja: 'ReadOnly' 変数を代入式のターゲットにすることはできません。
ko: 'ReadOnly' 변수는 할당 대상일 수 없습니다.
pl: 'Zmienna typu ReadOnly nie może być elementem docelowym przypisania.
pt_br: 'Variável 'ReadOnly' não pode ser destino de uma atribuição.
ru: 'Доступной только для чтения (ReadOnly) переменной нельзя присвоить значение.
tr: 'ReadOnly' değişken, bir atamanın hedefi olamaz.
zh_hans: '"ReadOnly" 变量不能作为赋值目标。
zh_hant: 'ReadOnly' 變數不可以是指派的目標。

# ERR_ExitSubOfFunc
source: 'Exit Sub' is not valid in a Function or Property.
cs: 'Klíčové slovo Exit Sub není platné v proceduře Function ani Property.
de: '"Exit Sub" ist ungültig in "Function" oder "Property".
es: 'La instrucción 'Exit Sub' no es válida en Function o Property.
fr: 'Exit Sub' n'est pas valide dans un Function ni un Property.
it: 'Exit Sub' non è valido in Function o Property.
ja: 'Exit Sub' は、Function または Property では有効ではありません。
ko: 'Function 또는 Property에서는 'Exit Sub'를 사용할 수 없습니다.
pl: 'Instrukcja Exit Sub nie jest prawidłowa w przypadku funkcji lub właściwości.
pt_br: 'Exit Sub' não é válida em uma Function ou Property.
ru: 'Использование оператора "Exit Sub" в функциях и свойствах недопустимо.
tr: 'Exit Sub', Function veya Property içinde geçerli değildir.
zh_hans: '"Exit Sub" 在函数或属性中无效。
zh_hant: 'Function 或 Property 中的 'Exit Sub' 無效。

# ERR_ExitPropNot
source: 'Exit Property' is not valid in a Function or Sub.
cs: 'Klíčové slovo Exit Property není platné v proceduře Function ani Sub.
de: '"Exit Property" ist ungültig in "Function" oder "Sub".
es: 'La instrucción 'Exit Property' no es válida en Function o Sub.
fr: 'Exit Property' n'est pas valide dans un Function ni un Sub.
it: 'Exit Property' non è valido in Function o Sub.
ja: 'Exit Property' は、Function または Sub では有効ではありません。
ko: 'Function 또는 Sub에서는 'Exit Property'를 사용할 수 없습니다.
pl: 'Instrukcja Exit Property nie jest prawidłowa w przypadku funkcji lub procedury.
pt_br: 'Exit Property' não é válida em uma Function ou Sub.
ru: 'Использование оператора "Exit Property" в функциях и подпрограммах недопустимо.
tr: 'Exit Property', Function veya Sub içinde geçerli değildir.
zh_hans: '“Exit Property”在函数或 Sub 中无效。
zh_hant: 'Function 或 Sub 中的 'Exit Property' 無效。

# ERR_ExitFuncOfSub
source: 'Exit Function' is not valid in a Sub or Property.
cs: 'Klíčové slovo Exit Function není platné v proceduře Sub ani Property.
de: '"Exit Function" ist ungültig in "Sub" oder "Property".
es: 'La instrucción 'Exit Function' no es válida en Sub o Property.
fr: 'Exit Function' n'est pas valide dans un Sub ni un Property.
it: 'Exit Function' non è valido in Sub o Property.
ja: 'Exit Function' は、Sub または Property では有効ではありません。
ko: 'Sub 또는 Property에서는 'Exit Function'을 사용할 수 없습니다.
pl: 'Instrukcja Exit Function nie jest prawidłowa w przypadku procedury lub właściwości.
pt_br: 'Exit Function' não é válida em uma Sub ou Property.
ru: 'Использование оператора "Exit Function" в подпрограммах и свойствах недопустимо.
tr: 'Exit Function', Sub veya Property içinde geçerli değildir.
zh_hans: '"Exit Function" 在 Sub 或属性中无效。
zh_hant: 'Sub 或 Property 中的 'Exit Function' 無效。

# ERR_LValueRequired
source: Expression is a value and therefore cannot be the target of an assignment.
cs: Výraz je hodnota, a proto nemůže být cílem přiřazení.
de: Der Ausdruck ist ein Wert und kann nicht als Ziel einer Zuweisung verwendet werden.
es: La expresión es un valor y, por tanto, no puede ser destino de una asignación.
fr: Cette expression est une valeur et ne peut donc pas être la cible d'une assignation.
it: L'espressione è un valore, quindi non può essere la destinazione di un'assegnazione.
ja: 式が値であるため、代入式のターゲットにすることはできません。
ko: 식이 값이므로 할당 대상일 수 없습니다.
pl: Wyrażenie jest wartością i dlatego nie może być elementem docelowym przypisania.
pt_br: Expressão é um valor e por isso não pode ser destino de uma atribuição.
ru: Выражение является значением, поэтому ему нельзя ничего присваивать.
tr: İfade bir değer olduğundan bir atamanın hedefi olamaz.
zh_hans: 表达式是一个值，因此不能作为赋值目标。
zh_hant: 運算式是一個數值，不可以是指派的目標。

# ERR_ForIndexInUse1
source: For loop control variable '{0}' already in use by an enclosing For loop.
cs: Řídicí proměnná cyklu For {0} se už používá v nadřazeném cyklu For.
de: Die For-Schleifensteuervariable "{0}" wird bereits von einer einschließenden For-Schleife verwendet.
es: El bucle For envolvente ya está usando la variable de control de bucle For '{0}'.
fr: Variable de contrôle de boucle For '{0}' déjà utilisée par une boucle For englobante.
it: La variabile di controllo ciclo For '{0}' è già usata in un ciclo For di inclusione.
ja: For ループ制御変数 '{0}' は、それを囲む For Loop によって既に使用されています。
ko: For 루프 제어 변수 '{0}'이(가) 바깥쪽 For 루프에 이미 사용되고 있습니다.
pl: Zmienna „{0}” sterująca pętlą For jest już używana przez otaczającą pętlę For.
pt_br: A variável de controle de loop For "{0}" já está em uso por um loop For delimitador.
ru: Управляющая переменная цикла For "{0}" уже используется вложенным циклом For.
tr: '{0}' For döngü denetim değişkeni zaten kapsayan bir For döngüsü tarafından kullanılıyor.
zh_hans: For 循环控制变量“{0}”已由封闭 For 循环使用。
zh_hant: For 迴圈控制變數 '{0}' 已由封閉式 For 迴圈所使用。

# ERR_NextForMismatch1
source: Next control variable does not match For loop control variable '{0}'.
cs: Řídicí proměnná příkazu Next neodpovídá řídicí proměnné cyklu For: {0}.
de: Die Next-Steuervariable stimmt nicht mit der For-Schleifensteuerungsvariablen "{0}" überein.
es: La variable de control Next no coincide con la variable de control de bucle For '{0}'.
fr: La variable de contrôle Next ne correspond pas à la variable de contrôle de boucle For '{0}'.
it: La variabile di controllo Next non corrisponde alla variabile di controllo ciclo For '{0}'.
ja: Next 制御変数が For ループ制御変数 '{0}' と一致しません。
ko: Next 제어 변수가 For 루프 제어 변수 '{0}'과(와) 일치하지 않습니다.
pl: Zmienna sterująca w instrukcji Next nie pasuje do zmiennej „{0}” sterującej pętlą For.
pt_br: Variável de controle Next não coincide com variável de controle de loop For "{0}".
ru: Следующая переменная элемента управления не соответствует переменной "{0}" цикла For.
tr: Next denetim değişkeni, '{0}' For döngüsü denetim değişkeniyle eşleşmiyor.
zh_hans: Next 控制变量与 For 循环控制变量“{0}”不匹配。
zh_hant: Next 控制變數與 For 迴圈控制變數 '{0}' 不相符。

# ERR_CaseElseNoSelect
source: 'Case Else' can only appear inside a 'Select Case' statement.
cs: 'Klíčové slovo Case Else se dá použít jenom uvnitř příkazu Select Case.
de: '"Case Else" kann nur innerhalb einer "Select Case"-Anweisung verwendet werden.
es: 'Case Else' solo puede aparecer dentro de una instrucción 'Select Case'.
fr: 'Case Else' ne peut apparaître qu'à l'intérieur d'une instruction 'Select Case'.
it: 'Case Else' può essere specificato all'interno di un'istruzione 'Select Case'.
ja: 'Case Else' は、'Select Case' ステートメント内でのみ使用できます。
ko: 'Case Else'는 'Select Case' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Case Else może wystąpić tylko wewnątrz instrukcji Select Case.
pt_br: 'Case Else' só pode aparecer dentro de uma instrução 'Select Case'.
ru: '"Case Else" может использоваться только в теле оператора "Select Case".
tr: 'Case Else' yalnızca bir 'Select Case' deyimi içinde bulunabilir.
zh_hans: '“Case Else”只能出现在“Select Case”语句内。
zh_hant: 'Case Else' 只可出現在 'Select Case' 陳述式中。

# ERR_CaseNoSelect
source: 'Case' can only appear inside a 'Select Case' statement.
cs: 'Klíčové slovo Case se dá použít jenom uvnitř příkazu Select Case.
de: '"Case" kann nur innerhalb einer "Select Case"-Anweisung verwendet werden.
es: 'Case' solo puede aparecer dentro de una instrucción 'Select Case'.
fr: 'Case' ne peut apparaître qu'à l'intérieur d'une instruction 'Select Case'.
it: 'Case' può essere specificato solo all'interno di un'istruzione 'Select Case'.
ja: 'Case' は、'Select Case' ステートメント内でのみ使用できます。
ko: 'Case'는 'Select Case' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Case może wystąpić tylko wewnątrz instrukcji Select Case.
pt_br: 'Case' só pode aparecer dentro de uma instrução 'Select Case'.
ru: '"Case" может использоваться только в теле оператора "Select Case".
tr: 'Case' yalnızca bir 'Select Case' deyimi içinde bulunabilir.
zh_hans: '“Case”只能出现在“Select Case”语句内。
zh_hant: 'Case' 只可出現在 'Select Case' 陳述式中。
