Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadInterfaceStructSpecifier1
source: Structure in an interface cannot be declared '{0}'.
cs: Pro strukturu v rozhraní nejde použít deklaraci {0}.
de: Eine Struktur in einer Schnittstelle kann nicht als "{0}" deklariert werden.
es: Una estructura de una interfaz no se puede declarar como '{0}'.
fr: Une structure dans une interface ne peut pas être déclarée '{0}'.
it: La struttura in un'interfaccia non può essere dichiarata come '{0}'.
ja: インターフェイス内の構造体を '{0}' と宣言することはできません。
ko: 인터페이스의 구조체는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować struktury w interfejsie jako „{0}”.
pt_br: Estrutura em uma interface não pode ser declarada "{0}".
ru: Структура в интерфейсе не может объявляться как "{0}".
tr: Arabirim içindeki yapı '{0}' olarak bildirilemez.
zh_hans: 接口中的结构不能声明为“{0}”。
zh_hant: 介面中的結構不可宣告為 '{0}'。

# ERR_BadInterfaceInterfaceSpecifier1
source: Interface in an interface cannot be declared '{0}'.
cs: Pro rozhraní v rozhraní nejde použít deklaraci {0}.
de: Eine Schnittstelle in einer Schnittstelle kann nicht als "{0}" deklariert werden.
es: Una interfaz de una interfaz no se puede declarar como '{0}'.
fr: Une interface dans une interface ne peut pas être déclarée '{0}'.
it: L'interfaccia in un'interfaccia non può essere dichiarata come '{0}'.
ja: インターフェイス内の Interface を '{0}' と宣言することはできません。
ko: 인터페이스의 인터페이스는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować interfejsu w interfejsie jako „{0}”.
pt_br: Interface em uma interface não pode ser declarada "{0}".
ru: Интерфейс в интерфейсе не может объявляться как "{0}".
tr: Bir arabirim içindeki arabirim '{0}' olarak bildirilemez.
zh_hans: 接口中的接口不能声明为“{0}”。
zh_hant: 介面中的介面不可宣告為 '{0}'。

# ERR_UseOfObsoleteSymbolNoMessage1
source: '{0}' is obsolete.
cs: 'Prvek {0} je zastaralý.
de: '"{0}" ist veraltet.
es: '{0}' está obsoleto.
fr: '{0}' est obsolète.
it: '{0}' è obsoleto.
ja: '{0}' は廃止されています。
ko: '{0}'은(는) 사용되지 않습니다.
pl: 'Element „{0}” jest przestarzały.
pt_br: "{0}" está obsoleto.
ru: "{0}" является устаревшим.
tr: '{0}' artık kullanılmıyor.
zh_hans: '“{0}”已过时。
zh_hant: '{0}' 已經過時。

# ERR_MetaDataIsNotAssembly
source: '{0}' is a module and cannot be referenced as an assembly.
cs: '{0} je modul a nejde na něho odkazovat jako na sestavení.
de: '"{0}" ist ein Modul und kann nicht als Assembly referenziert werden.
es: '{0}' es un módulo y no se puede hacer referencia a él como ensamblado.
fr: '{0}' est un module et ne peut pas être référencé en tant qu'assembly.
it: '{0}' è un modulo e non è possibile farvi riferimento come assembly.
ja: '{0}' はモジュールであるため、アセンブリとして参照できません。
ko: '{0}'은(는) 모듈이며 어셈블리로 참조할 수 없습니다.
pl: 'Element „{0}” jest modułem i nie można się do niego odwoływać jako do zestawu.
pt_br: "{0}" é um módulo e não pode ser referenciado como um assembly.
ru: "{0}" является модулем и не может указываться в ссылках как сборка.
tr: '{0}' bir modüldür, derleme olarak başvurulamaz.
zh_hans: '“{0}”是一个模块，不能作为程序集引用。
zh_hant: '{0}' 是一個模組，且無法當做組件來參考。

# ERR_MetaDataIsNotModule
source: '{0}' is an assembly and cannot be referenced as a module.
cs: '{0} je sestavení a nejde na něho odkazovat jako na modul.
de: '"{0}" ist eine Assembly und kann nicht als Modul referenziert werden.
es: '{0}' es un ensamblado y no se puede hacer referencia a él como módulo.
fr: '{0}' est un assembly et ne peut pas être référencé en tant que module.
it: '{0}' è un assembly e non è possibile farvi riferimento come modulo.
ja: '{0}' はアセンブリであるため、モジュールとして参照できません。
ko: '{0}'은(는) 어셈블리이며 모듈로 참조할 수 없습니다.
pl: 'Element „{0}” jest zestawem i nie można się do niego odwoływać jako do modułu.
pt_br: "{0}" é um assembly e não pode ser referenciado como um módulo.
ru: "{0}" является сборкой и не может указываться в ссылках как модуль.
tr: '{0}' bir derlemedir, modül olarak başvurulamaz.
zh_hans: '“{0}”是一个程序集，不能作为模块引用。
zh_hant: '{0}' 是一個組件，且無法當做模組來參考。

# ERR_ReferenceComparison3
source: Operator '{0}' is not defined for types '{1}' and '{2}'. Use 'Is' operator to compare two reference types.
cs: Operátor {0} není definovaný pro typy {1} a {2}. K porovnání typů odkazů použijte operátor Is.
de: Der {0}-Operator ist für die Typen "{1}" und "{2}" nicht definiert. Verwenden Sie den Is-Operator, um zwei Referenztypen zu vergleichen.
es: El operador '{0}' no está definido para los tipos '{1}' y '{2}'. Use el operador 'Is' para comparar dos tipos de referencia.
fr: L'opérateur '{0}' n'est pas défini pour les types '{1}' et '{2}'. Utilisez 'Is' pour comparer deux types référence.
it: L'operatore {0} non è definito per i tipi {1} e '{2}'. Usare l'operatore 'Is' per confrontare due tipi riferimento.
ja: 型 '{1}' および '{2}' に対して演算子 '{0}' は定義されていません。2 つの参照型を比較するには、'Is' 演算子を使用してください。
ko: '{1}' 및 '{2}' 형식에 대한 '{0}' 연산자가 정의되지 않았습니다. 두 참조 형식을 비교하려면 'Is' 연산자를 사용하세요.
pl: Operator „{0}” nie jest zdefiniowany dla typów „{1}” i „{2}”. Użyj operatora „Is”, aby porównać dwa typy referencyjne.
pt_br: Operador "{0}" não está definido para tipos "{1}" e "{2}". Use o operador "Is" para comparar dois tipos de referência.
ru: Оператор "{0}" не определен для типов "{1}" и "{2}". Используйте оператор "Is" для сравнения двух ссылочных типов.
tr: '{0}' işleci '{1}' ve '{2}' türleri için tanımlı değil. İki başvuru türünü karşılaştırmak için 'Is' işlecini kullanın.
zh_hans: 没有为类型“{1}”和“{2}”定义运算符“{0}”。请使用“Is”运算符比较两个引用的类型。
zh_hant: 未定義類型 '{1}' 和 '{2}' 的運算子 '{0}'。請使用 'Is' 運算子比較兩個參考類型。

# ERR_CatchVariableNotLocal1
source: '{0}' is not a local variable or parameter, and so cannot be used as a 'Catch' variable.
cs: '{0} není lokální proměnná ani parametr, a proto se nedá použít jako proměnná Catch.
de: '"{0}" ist weder eine lokale Variable noch ein Parameter und kann daher nicht als Catch-Variable verwendet werden.
es: '{0}' no es una variable local ni un parámetro y, por tanto, no se puede usar como variable 'Catch'.
fr: '{0}' ne peut pas être utilisé en tant que variable 'Catch', car ce n'est ni une variable locale ni un paramètre.
it: '{0}' non è una variabile locale o un parametro e non può essere usato come una variabile 'Catch'.
ja: '{0}' はローカル変数またはパラメーターでないため、'Catch' 変数として使うことはできません。
ko: '{0}'은(는) 지역 변수 또는 매개 변수가 아니므로 'Catch' 변수로 사용할 수 없습니다.
pl: 'Element „{0}” nie jest zmienną lokalną ani parametrem i w związku z tym nie można go użyć jako zmiennej instrukcji „Catch”.
pt_br: "{0}" não é uma variável local ou parâmetro e, portanto, não pode ser usado como uma variável "Catch".
ru: "{0}" не является локальной переменной или параметром и поэтому не может использоваться как переменная оператора "Catch".
tr: '{0}' bir yerel değişken veya parametre olmadığından, 'Catch' değişkeni olarak kullanılamaz.
zh_hans: '“{0}”不是局部变量或参数，因此不能用作“Catch”变量。
zh_hant: '{0}' 不是區域變數或參數，所以不能用做為 'Catch' 變數。

# ERR_ModuleMemberCantImplement
source: Members in a Module cannot implement interface members.
cs: Členy v modulu nemůžou implementovat členy rozhraní.
de: Member in einem Modul können keine Schnittstellenmember implementieren.
es: Los miembros de un módulo no pueden implementar miembros de interfaz.
fr: Les membres d'un module ne peuvent pas implémenter des membres d'interface.
it: I membri di un modulo non possono implementare i membri di interfaccia.
ja: モジュールのメンバーはインターフェイス メンバーを実装できません。
ko: 모듈의 멤버는 인터페이스 멤버를 구현할 수 없습니다.
pl: Składowe w module nie mogą implementować składowych interfejsu.
pt_br: Membros em um módulo não podem implementar membros de interface.
ru: Методы в модуле не могут содержать реализацию членов интерфейса.
tr: Modül içindeki üyeler arabirim üyelerini uygulayamaz.
zh_hans: 模块中的成员无法实现接口成员。
zh_hant: 模組中的成員不可以實作介面成員。

# ERR_EventDelegatesCantBeFunctions
source: Events cannot be declared with a delegate type that has a return type.
cs: Události nejde deklarovat s typem delegáta, který má typ vrácené hodnoty.
de: Ereignisse können nicht mit einem Delegattyp deklariert werden, der einen Rückgabetyp hat.
es: Los eventos no se pueden declarar con un tipo delegado que tenga un tipo de valor devuelto.
fr: Les événements ne peuvent pas être déclarés avec un type délégué ayant un type de retour.
it: Non è possibile dichiarare gli eventi con un tipo delegato che ha un tipo restituito.
ja: 戻り値の型を持つデリゲート型でイベントを宣言することはできません。
ko: 이벤트는 반환 형식이 있는 대리자 형식으로 선언할 수 없습니다.
pl: Zdarzenia nie mogą być zadeklarowane z typem delegata, który ma zwracany typ.
pt_br: Eventos não podem ser declarados com um tipo delegate que tenha um tipo de retorno.
ru: События не могут объявляться типом делегата, обладающим возвращаемым типом.
tr: Olaylar, dönüş türü olan bir temsilci türüyle bildirilemez.
zh_hans: 事件不能用具有返回类型的委托类型声明。
zh_hant: 事件不可以宣告為具有傳回類型的委派類型。

# ERR_InvalidDate
source: Date constant is not valid.
cs: Datová konstanta není platná.
de: Ungültige Datumskonstante.
es: La constante de fecha no es válida.
fr: Constante de date non valide.
it: La costante di data non è valida.
ja: 日付定数が有効ではありません。
ko: 날짜 상수가 잘못되었습니다.
pl: Stała daty jest nieprawidłowa.
pt_br: Constante de data inválida.
ru: Константа даты является недействительной.
tr: Tarih sabiti geçerli değil.
zh_hans: 日期常量无效。
zh_hant: 日期常數無效。

# ERR_CantOverride4
source: '{0}' cannot override '{1}' because it is not declared 'Overridable'.
cs: '{0} nemůže přepsat {1}, protože není deklarovaná jako Overridable.
de: '"{0}" kann "{1}" nicht überschreiben, da es nicht als "Overridable" deklariert ist.
es: '{0}' no puede invalidar '{1}' porque no está declarado como 'Overridable'.
fr: '{0}' ne peut pas se substituer à '{1}', car il n'est pas déclaré 'Overridable'.
it: '{0}' non può eseguire l'override di '{1}' perché non è dichiarato come 'Overridable'.
ja: 'Overridable' として宣言されていないため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '{0}'은(는) 'Overridable'로 선언되지 않았으므로 '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ nie jest on zadeklarowany jako „Overridable”.
pt_br: "{0}" não pode substituir "{1}" porque não está declarado como "Overridable".
ru: "{0}" не может переопределить "{1}", поскольку он не объявлен как "Overridable".
tr: 'Overridable' olarak bildirilmediğinden '{0}' '{1}' öğesini geçersiz kılamıyor.
zh_hans: '“{0}”无法重写“{1}”，因为后者未声明为“Overridable”。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其未宣告為 'Overridable'。

# ERR_CantSpecifyArraysOnBoth
source: Array modifiers cannot be specified on both a variable and its type.
cs: Modifikátory polí nejde zadat pro proměnnou a její typ současně.
de: Arraymodifizierer können nicht für Variable und Typ gleichzeitig festgelegt werden.
es: No se pueden especificar los modificadores de matriz en una variable y en su tipo al mismo tiempo.
fr: Impossible de spécifier des modificateurs de tableau pour la variable et son type.
it: Non è possibile specificare modificatori di matrici sia nella variabile che nel tipo.
ja: 変数とその型の両方で、配列修飾子を指定することはできません。
ko: 변수와 그 형식 모두에 배열 한정자를 지정할 수 없습니다.
pl: Modyfikatory tablicy nie mogą być określone jednocześnie w zmiennej i jej typie.
pt_br: Modificadores de matriz não podem ser especificados em uma variável e seu tipo.
ru: Модификаторы массива не могут задаваться одновременно для переменной и ее типа.
tr: Dizi değiştiriciler, hem değişken hem de değişkenin türü üzerinde belirtilemez.
zh_hans: 不能在变量及其类型上同时指定数组修饰符。
zh_hant: 無法同時在變數及其類型上指定陣列修飾元。

# ERR_NotOverridableRequiresOverrides
source: 'NotOverridable' cannot be specified for methods that do not override another method.
cs: 'Klíčové slovo NotOverridable nejde zadat pro metody, které nepřepisují jinou metodu.
de: '"NotOverridable" kann nicht für Methoden angegeben werden, die keine andere Methode überschreiben.
es: 'NotOverridable' no se puede especificar para métodos que no invalidan otro método.
fr: 'NotOverridable' ne peut pas être spécifié pour les méthodes qui ne se substituent pas à une autre méthode.
it: 'Non è possibile specificare 'NotOverridable' per metodi che non eseguono l'override di un altro metodo.
ja: '別のメソッドをオーバーライドしていないメソッドに 'NotOverridable' を指定することはできません。
ko: 'NotOverridable'은 다른 메서드를 재정의하지 않는 메서드에 지정할 수 없습니다.
pl: 'Dla metod, które nie przesłaniają innej metody, nie można określić słowa kluczowego „NotOverridable”.
pt_br: 'NotOverridable' não pode ser especificado para métodos que não substituem outro método.
ru: '"NotOverridable" не может назначаться для методов, не переопределяющих другие методы.
tr: 'Başka bir yöntemi geçersiz kılmayan yöntemler için 'NotOverridable' belirtilemez.
zh_hans: '不能为不重写另一个方法的方法指定 "NotOverridable"。
zh_hant: 'NotOverridable' 無法指定給不覆寫其他方法的方法。

# ERR_PrivateTypeOutsideType
source: Types declared 'Private' must be inside another type.
cs: Typy s deklarací Private musí být uvnitř jiného typu.
de: Typen, die als "Private" deklariert sind, müssen sich innerhalb eines anderen Typs befinden.
es: Los tipos declarados como 'Private' deben estar dentro de otro tipo.
fr: Les types déclarés 'Private' doivent se trouver à l'intérieur d'un autre type.
it: I tipi dichiarati 'Private' devono essere specificati all'interno di un altro tipo.
ja: Private' と宣言された型は、別の型の内部になければなりません。
ko: 'Private'으로 선언된 형식은 다른 형식의 내부에 있어야 합니다.
pl: Typy zadeklarowane jako Private muszą znajdować się wewnątrz innego typu.
pt_br: Tipos declarados 'Private' devem estar dentro de outro tipo.
ru: Типы, объявленные как "Private", должны находиться внутри других типов.
tr: Private' olarak bildirilen türler başka bir türün içinde olmalıdır.
zh_hans: 声明为 "Private" 的类型必须在另一个类型内。
zh_hant: 宣告為 'Private' 的類型必須在另一個類型內。

# ERR_TypeRefResolutionError3
source: Import of type '{0}' from assembly or module '{1}' failed.
cs: Import typu {0} ze sestavení nebo modulu {1} se nezdařil.
de: Fehler beim Importieren des Typs "{0}" aus der Assembly oder dem Modul "{1}".
es: Error al importar el tipo '{0}' del ensamblado o módulo '{1}'.
fr: Échec de l'importation du type '{0}' à partir de l'assembly ou du module '{1}'.
it: L'importazione del tipo '{0}' dall'assembly o dal modulo '{1}' non è riuscita.
ja: 型 '{0}' を、アセンブリまたはモジュール '{1}' からインポートできませんでした。
ko: '{1}' 어셈블리 또는 모듈에서 '{0}' 형식을 가져오지 못했습니다.
pl: Importowanie typu „{0}” z zestawu lub modułu „{1}” nie powiodło się.
pt_br: Importação do tipo "{0}" do assembly ou módulo "{1}" falhou.
ru: Импортирование типа "{0}" из сборки или модуля "{1}" невозможно.
tr: '{1}' derleme veya modülünden '{0}' türünü içeri aktarma işlemi başarısız oldu.
zh_hans: 从程序集或模块“{1}”导入类型“{0}”失败。
zh_hant: 從組件或模組 '{1}' 匯入類型 '{0}' 失敗。

# ERR_ValueTupleTypeRefResolutionError1
source: Predefined type '{0}' is not defined or imported.
cs: Předdefinovaný typ {0} není nadefinovaný ani naimportovaný.
de: Der vordefinierte Typ "{0}" wurde nicht definiert oder importiert.
es: El tipo predefinido '{0}' no está definido o importado.
fr: Le type prédéfini '{0}' n'est pas défini ou importé.
it: Il tipo predefinito '{0}' non è definito né importato.
ja: 定義済みの型 '{0}' は、定義、またはインポートされていません。
ko: 미리 정의된 형식 '{0}'을(를) 정의하지 않았거나 가져오지 않았습니다.
pl: Wstępnie zdefiniowany typ „{0}” nie jest zdefiniowany ani zaimportowany.
pt_br: O tipo predefinido '{0}' não foi definido nem importado.
ru: Предопределенный тип "{0}" не определен и не импортирован.
tr: Önceden tanımlı '{0}' türü tanımlanmamış veya içeri aktarılmamış.
zh_hans: 预定义的类型“{0}”未定义或未导入。
zh_hant: 預先定義的類型 '{0}' 未經定義或匯入。

# ERR_ParamArrayWrongType
source: ParamArray parameters must have an array type.
cs: Parametry ParamArray musí být typu pole.
de: ParamArray-Parameter müssen einen Arraytyp haben.
es: Los parámetros ParamArray deben tener un tipo de matriz.
fr: Les paramètres ParamArray doivent avoir un type tableau.
it: I parametri ParamArray devono contenere un tipo matrice.
ja: ParamArray パラメーターには、配列型を指定しなければなりません。
ko: ParamArray 매개 변수에는 배열 형식이 있어야 합니다.
pl: Parametry ParamArray muszą być typu tablicowego.
pt_br: Parâmetros ParamArray devem ter um tipo de matriz.
ru: Параметры ParamArray должны быть массивами.
tr: ParamArray parametreleri dizi türünde olmalıdır.
zh_hans: ParamArray 参数必须有数组类型。
zh_hant: ParamArray 參數必須有陣列類型。

# ERR_CoClassMissing2
source: Implementing class '{0}' for interface '{1}' cannot be found.
cs: Implementující třída {0} pro rozhraní {1} se nenašla.
de: Die implementierende Klasse {0} für die Schnittstelle {1} wurde nicht gefunden.
es: No se encontró la clase '{0}' que realiza la implementación para la interfaz '{1}'.
fr: La classe d'implémentation '{0}' pour l'interface '{1}' est introuvable.
it: La classe di implementazione '{0}' per l'interfaccia '{1}' non è stata trovata.
ja: インターフェイス '{1}' を実装するクラス '{0}' が見つかりません。
ko: '{1}' 인터페이스에 대한 '{0}' 구현 클래스를 찾을 수 없습니다.
pl: Nie można znaleźć implementującej klasy „{0}” dla interfejsu „{1}”.
pt_br: Classe de implementação "{0}" para a interface "{1}" não pode ser encontrada.
ru: Не удается найти класс реализации "{0}" для интерфейса "{1}".
tr: '{1}' arabirimi için '{0}' uygulama sınıfı bulunamadı.
zh_hans: 无法找到接口“{1}”的实现类“{0}”。
zh_hant: 找不到介面 '{1}' 的實作類別 '{0}'。

# ERR_InvalidCoClass1
source: Type '{0}' cannot be used as an implementing class.
cs: Typ {0} se nedá použít jako implementující třída.
de: Typ "{0}" kann nicht als implementierende Klasse verwendet werden.
es: El tipo '{0}' no se puede usar como clase de implementación.
fr: Impossible d'utiliser le type '{0}' comme classe d'implémentation.
it: Non è possibile usare il tipo '{0}' come classe di implementazione.
ja: 型 '{0}' は実装するクラスとして使用できません。
ko: '{0}' 형식은 클래스를 구현하는 데 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako klasa implementująca.
pt_br: Tipo "{0}" não pode ser usado como uma classe de implementação.
ru: Тип "{0}" не может использоваться как класс реализации.
tr: '{0}' türü uygulayan sınıfı olarak kullanılamaz.
zh_hans: 类型“{0}”不能用作实现类。
zh_hant: 類型 '{0}' 無法用做為實作類別。

# ERR_InvalidMeReference
source: Reference to object under construction is not valid when calling another constructor.
cs: Odkaz na vytvářený objekt není platný při volání jiného konstruktoru.
de: Ein Verweis auf ein Objekt, das bearbeitet wird, ist nicht gültig, wenn ein anderer Konstruktor aufgerufen wird.
es: La referencia a un objeto en construcción no es válida mientras se llama a otro constructor.
fr: Toute référence à un objet en construction n'est pas valide lors de l'appel d'un autre constructeur.
it: Il riferimento all'oggetto in fase di creazione non è valido durante la chiamata a un altro costruttore.
ja: 別のコンストラクターを呼び出している間は、作成中のオブジェクトへの参照は有効ではありません。
ko: 다른 생성자를 호출하는 동안에는 생성 중인 개체를 참조할 수 없습니다.
pl: Odwołanie do właśnie konstruowanego obiektu nie jest prawidłowe podczas wywoływania innego konstruktora.
pt_br: A referência ao objeto em construção não é válida ao chamar outro construtor.
ru: При вызове другого конструктора ссылки на объект, находящийся в процессе построения, недопустимы.
tr: Başka bir oluşturucu çağrılırken, oluşturulmakta olan nesneye yapılan başvuru geçerli değildir.
zh_hans: 调用另一个构造函数时引用尚未完成的对象是无效的。
zh_hant: 呼叫其他建構函式時，參考建構中的物件是無效的。

# ERR_InvalidImplicitMeReference
source: Implicit reference to object under construction is not valid when calling another constructor.
cs: Implicitní odkaz na vytvářený objekt není platný při volání jiného konstruktoru.
de: Ein impliziter Verweis auf ein Objekt, das bearbeitet wird, ist nicht gütig, wenn ein anderer Konstruktor aufgerufen wird.
es: La referencia implícita a un objeto en construcción no es válida mientras se llama a otro constructor.
fr: Toute référence implicite à un objet en construction n'est pas valide lors de l'appel d'un autre constructeur.
it: Il riferimento implicito all'oggetto in fase di creazione non è valido durante la chiamata a un altro costruttore.
ja: 別のコンストラクターを呼び出している間は、作成中のオブジェクトへの暗黙的な参照は有効ではありません。
ko: 다른 생성자를 호출하는 동안에는 생성 중인 개체를 암시적으로 참조할 수 없습니다.
pl: Niejawne odwołanie do właśnie konstruowanego obiektu nie jest prawidłowe podczas wywoływania innego konstruktora.
pt_br: A referência implícita ao objeto em construção não é válida ao chamar outro construtor.
ru: При вызове другого конструктора неявные ссылки на объект, находящийся в процессе построения, недопустимы.
tr: Başka bir oluşturucu çağrılırken, oluşturulmakta olan nesneye yapılan örtük başvuru geçerli değildir.
zh_hans: 调用另一个构造函数时隐式引用尚未完成的对象是无效的。
zh_hant: 呼叫其他建構函式時，隱含參考建構中的物件是無效的。

# ERR_RuntimeMemberNotFound2
source: Member '{0}' cannot be found in class '{1}'. This condition is usually the result of a mismatched 'Microsoft.VisualBasic.dll'.
cs: Člen {0} se ve třídě {1} nenašel. Tento stav je zpravidla výsledkem neodpovídající knihovny Microsoft.VisualBasic.dll.
de: Der Member "{0}" wurde in der {1}-Klasse nicht gefunden. Dieser Zustand ist normalerweise auf eine "Microsoft.VisualBasic.dll" zurückzuführen, die nicht übereinstimmt.
es: No se encuentra el miembro '{0}' en la clase '{1}'. Este problema suele ser el resultado de un 'Microsoft.VisualBasic.dll' no coincidente.
fr: Le membre '{0}' est introuvable dans la classe '{1}'. Cette condition est le résultat d'un fichier 'Microsoft.VisualBasic.dll' incompatible.
it: Il membro '{0}' non è stato trovato nella classe '{1}'. Questa condizione è in genere il risultato di un elemento 'Microsoft.VisualBasic.dll' non corrispondente.
ja: クラス '{1}' の中にメンバー '{0}' が見つかりません。通常、このエラーは 'Microsoft.VisualBasic.dll' が適切でない場合に発生します。
ko: '{0}' 멤버가 '{1}' 클래스에 없습니다. 일반적으로 'Microsoft.VisualBasic.dll'이 일치하는 않은 결과로 발생하는 조건입니다.
pl: Nie można odnaleźć składowej „{0}” w klasie „{1}”. Ta sytuacja jest zazwyczaj wynikiem niedopasowania biblioteki „Microsoft.VisualBasic.dll”.
pt_br: Membro "{0}" não pode ser encontrado na classe "{1}". Esta condição é normalmente o resultado de uma "Microsoft.VisualBasic.dll" incompatível.
ru: Член "{0}" не может быть найден в классе "{1}". Это условие, как правило, является результатом несоответствия "Microsoft.VisualBasic.dll".
tr: '{0}' üyesi '{1}' sınıfı içinde bulunamadı. Bu durum genellikle 'Microsoft.VisualBasic.dll' uyuşmazlığından kaynaklanır.
zh_hans: 类“{1}”中找不到成员“{0}”。此情况通常是由于不匹配的“Microsoft.VisualBasic.dll”造成的。
zh_hant: 在類別 '{1}' 中找不到成員 '{0}'。這種情況通常是 'Microsoft.VisualBasic.dll' 不相符的結果。

# ERR_BadPropertyAccessorFlags
source: Property accessors cannot be declared '{0}'.
cs: Pro přistupující objekty vlastnosti nejde použít deklaraci {0}.
de: Eigenschaftenaccessoren können nicht als "{0}" deklariert werden.
es: Los descriptores de acceso de la propiedad no se pueden declarar como '{0}'.
fr: Les accesseurs de propriété ne peuvent pas être déclarés '{0}'.
it: Le funzioni di accesso alle proprietà non possono essere dichiarate come '{0}'.
ja: プロパティ アクセサーを '{0}' として宣言できません。
ko: 속성 접근자는 '{0}'(으)로 선언할 수 없습니다.
pl: Metod dostępu do właściwości nie można deklarować jako „{0}”.
pt_br: Acessadores de propriedade não podem ser declarados "{0}".
ru: Методы доступа к свойствам нельзя объявить как "{0}".
tr: Özellik erişimcisi '{0}' olarak bildirilemez.
zh_hans: 不能将属性访问器声明为“{0}”。
zh_hant: 屬性存取子不可宣告為 '{0}'。
