Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidEndAddHandler
source: 'End AddHandler' must be preceded by a matching 'AddHandler' declaration.
cs: 'Deklaraci End AddHandler musí předcházet párová deklarace AddHandler.
de: '"End AddHandler" muss eine entsprechende AddHandler-Deklaration voranstehen.
es: 'End AddHandler' debe ir precedida de una declaración 'AddHandler' correspondiente.
fr: 'End AddHandler' doit être précédé d'une déclaration 'AddHandler' correspondante.
it: 'End AddHandler' deve essere preceduto da una dichiarazione 'AddHandler' corrispondente.
ja: 'End AddHandler' の前には、対応する 'AddHandler' 宣言を指定しなければなりません。
ko: 'End AddHandler'는 짝이 되는 'AddHandler' 선언 뒤에 와야 합니다.
pl: 'Element „End AddHandler” musi być poprzedzony odpowiadającą mu deklaracją „AddHandler”.
pt_br: 'End AddHandler' deve ser precedido por 'AddHandler' correspondente.
ru: 'Оператору "End AddHandler "должно предшествовать соответствующее объявление "AddHandler".
tr: 'End AddHandler' öncesinde eşleşen bir 'AddHandler' bildirimi olmalıdır.
zh_hans: '“End AddHandler”前面必须是匹配的“AddHandler”声明。
zh_hant: 'End AddHandler' 之前必須搭配相對應的 'AddHandler' 宣告。

# ERR_InvalidEndRemoveHandler
source: 'End RemoveHandler' must be preceded by a matching 'RemoveHandler' declaration.
cs: 'Deklaraci End RemoveHandler musí předcházet párová deklarace RemoveHandler.
de: '"End RemoveHandler" muss eine entsprechende RemoveHandler-Deklaration voranstehen.
es: 'End RemoveHandler' debe ir precedida de una declaración 'RemoveHandler' correspondiente.
fr: 'End RemoveHandler' doit être précédé d'une déclaration 'RemoveHandler' correspondante.
it: 'End RemoveHandler' deve essere preceduto da una dichiarazione 'RemoveHandler' corrispondente.
ja: 'End RemoveHandler' の前には、対応する 'RemoveHandler' 宣言を指定しなければなりません。
ko: 'End RemoveHandler'는 짝이 되는 'RemoveHandler' 선언 뒤에 와야 합니다.
pl: 'Element „End RemoveHandler” musi być poprzedzony odpowiadającą mu deklaracją „RemoveHandler”.
pt_br: 'End RemoveHandler' deve ser precedido por uma declaração 'RemoveHandler' correspondente.
ru: 'Оператору "End RemoveHandler" должно предшествовать соответствующее объявление "RemoveHandler".
tr: 'End RemoveHandler' öncesinde eşleşen bir 'RemoveHandler' bildirimi olmalıdır.
zh_hans: '“End RemoveHandler”前面必须是匹配的“RemoveHandler”声明。
zh_hant: 'End RemoveHandler' 之前必須搭配相對應的 'RemoveHandler' 宣告。

# ERR_InvalidEndRaiseEvent
source: 'End RaiseEvent' must be preceded by a matching 'RaiseEvent' declaration.
cs: 'Deklaraci End RaiseEvent musí předcházet párová deklarace RaiseEvent.
de: 'End RaiseEvent muss eine entsprechende RaiseEvent-Deklaration voranstehen.
es: 'End RaiseEvent' debe ir precedida de una declaración 'RaiseEvent' correspondiente.
fr: 'End RaiseEvent' doit être précédé d'une déclaration 'RaiseEvent' correspondante.
it: 'End RaiseEvent' deve essere preceduto da una dichiarazione 'RaiseEvent' corrispondente.
ja: 'End RaiseEvent' の前には、対応する 'RaiseEvent' 宣言を指定しなければなりません。
ko: 'End RaiseEvent'는 짝이 되는 'RaiseEvent' 선언 뒤에 와야 합니다.
pl: 'Element „End RaiseEvent” musi być poprzedzony odpowiadającą mu deklaracją „RaiseEvent”.
pt_br: 'End RaiseEvent' deve ser precedido por uma declaração 'RaiseEvent' correspondente.
ru: 'Оператору "End RaiseEvent" должно предшествовать соответствующее объявление "RaiseEvent".
tr: 'End RaiseEvent' öncesinde eşleşen bir 'RaiseEvent' bildirimi olmalıdır.
zh_hans: '“End RaiseEvent”前面必须是匹配的“RaiseEvent”声明。
zh_hant: 'End RaiseEvent' 之前必須搭配相對應的 'RaiseEvent' 宣告。

# ERR_DuplicateAddHandlerDef
source: 'AddHandler' is already declared.
cs: 'Metoda AddHandler už je deklarovaná.
de: 'AddHandler wurde bereits deklariert.
es: 'Ya se declaró 'AddHandler'.
fr: 'AddHandler' est déjà déclaré.
it: 'AddHandler' è già dichiarato.
ja: 'AddHandler' は既に宣言されています。
ko: 'AddHandler'가 이미 선언되었습니다.
pl: 'Element „AddHandler” jest już zadeklarowany.
pt_br: 'AddHandler' já está declarado.
ru: '"AddHandler" уже объявлен.
tr: 'AddHandler' önceden bildirildi.
zh_hans: '已经声明 "AddHandler"。
zh_hant: 'AddHandler' 已宣告。

# ERR_DuplicateRemoveHandlerDef
source: 'RemoveHandler' is already declared.
cs: 'Metoda RemoveHandler už jsou deklarovaná.
de: 'RemoveHandler wurde bereits deklariert.
es: 'Ya se declaró 'RemoveHandler'.
fr: 'RemoveHandler' est déjà déclaré.
it: 'RemoveHandler' è già dichiarato.
ja: 'RemoveHandler' は既に宣言されています。
ko: 'RemoveHandler'가 이미 선언되었습니다.
pl: 'Element „RemoveHandler” jest już zadeklarowany.
pt_br: 'RemoveHandler' já está declarado.
ru: 'Процедура "RemoveHandler" уже объявлена.
tr: 'RemoveHandler' zaten bildirildi.
zh_hans: '已经声明 "RemoveHandler"。
zh_hant: 'RemoveHandler' 已宣告。

# ERR_DuplicateRaiseEventDef
source: 'RaiseEvent' is already declared.
cs: 'Metoda RaiseEvent už je deklarovaná.
de: 'RaiseEvent wurde bereits deklariert.
es: 'Ya se declaró 'RaiseEvent'.
fr: 'RaiseEvent' est déjà déclaré.
it: 'RaiseEvent' è già dichiarato.
ja: 'RaiseEvent' は既に宣言されています。
ko: 'RaiseEvent'가 이미 선언되었습니다.
pl: 'Element „RaiseEvent” jest już zadeklarowany.
pt_br: 'RaiseEvent' já está declarado.
ru: 'Процедура "RaiseEvent" уже объявлена.
tr: 'RaiseEvent' zaten bildirildi.
zh_hans: '已经声明 "RaiseEvent"。
zh_hant: 'RaiseEvent' 已宣告。

# ERR_MissingAddHandlerDef1
source: 'AddHandler' definition missing for event '{0}'.
cs: 'V definici AddHandler chybí událost {0}.
de: 'Die AddHandler-Definition fehlt für das {0}-Ereignis.
es: 'Falta la definición de 'AddHandler' para el evento '{0}'.
fr: 'La définition 'AddHandler' est manquante pour l'événement '{0}'.
it: 'Manca la definizione di 'AddHandler' per l'evento '{0}'.
ja: 'イベント '{0}' に対して、'AddHandler' 定義がありません。
ko: '{0}' 이벤트에 대한 'AddHandler' 정의가 없습니다.
pl: 'Brak definicji elementu „AddHandler” dla zdarzenia „{0}”.
pt_br: 'Definição de "AddHandler" ausente para o evento "{0}".
ru: 'Отсутствует определение "AddHandler" события "{0}".
tr: '{0}' olayı için 'AddHandler' tanımı eksik.
zh_hans: '缺少事件“{0}”的“AddHandler”定义。
zh_hant: '事件 '{0}' 遺漏 'AddHandler' 定義。

# ERR_MissingRemoveHandlerDef1
source: 'RemoveHandler' definition missing for event '{0}'.
cs: 'V definici RemoveHandler chybí událost {0}.
de: 'Die RemoveHandler-Definition fehlt für das Ereignis "{0}".
es: 'Falta la definición de 'RemoveHandler' para el evento '{0}'.
fr: 'La définition 'RemoveHandler' est manquante pour l'événement '{0}'.
it: 'Manca la definizione di 'RemoveHandler' per l'evento '{0}'.
ja: 'イベント '{0}' に対して 'RemoveHandler' 定義が指定されていません。
ko: '{0}' 이벤트에 대한 'RemoveHandler' 정의가 없습니다.
pl: 'Brak definicji elementu „RemoveHandler” dla zdarzenia „{0}”.
pt_br: 'Definição de "RemoveHandler" ausente para o evento "{0}".
ru: 'Отсутствует определение "RemoveHandler" события "{0}".
tr: '{0}' olayı için 'RemoveHandler' tanımı eksik.
zh_hans: '缺少事件“{0}”的“RemoveHandler”定义。
zh_hant: '事件 '{0}' 遺漏 'RemoveHandler' 定義。

# ERR_MissingRaiseEventDef1
source: 'RaiseEvent' definition missing for event '{0}'.
cs: 'V definici RaiseEvent chybí událost {0}.
de: 'Die RaiseEvent-Definition fehlt für das Ereignis "{0}".
es: 'Falta la definición de 'RaiseEvent' para el evento '{0}'.
fr: 'La définition 'RaiseEvent' est manquante pour l'événement '{0}'.
it: 'Manca la definizione di 'RaiseEvent' per l'evento '{0}'.
ja: 'イベント '{0}' に対して 'RaiseEvent' 定義が指定されていません。
ko: '{0}' 이벤트에 대한 'RaiseEvent' 정의가 없습니다.
pl: 'Brak definicji elementu „RaiseEvent” dla zdarzenia „{0}”.
pt_br: 'Definição de "RaiseEvent" ausente para o evento "{0}".
ru: 'Отсутствует определение "RaiseEvent" события "{0}".
tr: '{0}' olayı için 'RaiseEvent' tanımı eksik.
zh_hans: '缺少事件“{0}”的“RaiseEvent”定义。
zh_hant: '事件 '{0}' 遺漏 'RaiseEvent' 定義。

# ERR_EventAddRemoveHasOnlyOneParam
source: 'AddHandler' and 'RemoveHandler' methods must have exactly one parameter.
cs: 'Metody AddHandler a RemoveHandler musí mít právě jeden parametr.
de: 'Die AddHandler-Methode und die RemoveHandler-Methode müssen genau einen Parameter aufweisen.
es: 'Los métodos 'AddHandler' y 'RemoveHandler' deben tener exactamente un parámetro.
fr: 'Les méthodes 'AddHandler' et 'RemoveHandler' doivent avoir exactement un paramètre.
it: 'I metodi 'AddHandler' e 'RemoveHandler' devono avere esattamente un parametro.
ja: 'AddHandler' および 'RemoveHandler' メソッドには、パラメーターを 1 つだけ指定しなければなりません。
ko: 'AddHandler' 및 'RemoveHandler' 메서드에는 매개 변수를 하나만 사용해야 합니다.
pl: 'Metody „AddHandler” i „RemoveHandler” muszą mieć dokładnie jeden parametr.
pt_br: 'Os métodos 'AddHandler' e 'RemoveHandler' devem ter exatamente um parâmetro.
ru: 'У методов "AddHandler" и "RemoveHandler" должен быть ровно один параметр.
tr: 'AddHandler' ve 'RemoveHandler' yöntemlerinde tam olarak bir parametre bulunmalıdır.
zh_hans: '“AddHandler”和“RemoveHandler”方法必须正好有一个参数。
zh_hant: 'AddHandler' 和 'RemoveHandler' 方法必須剛好有一個參數。

# ERR_EventAddRemoveByrefParamIllegal
source: 'AddHandler' and 'RemoveHandler' method parameters cannot be declared 'ByRef'.
cs: 'Parametry metody AddHandler a RemoveHandler nemůžou být deklarované jako ByRef.
de: 'Die AddHandler- und RemoveHandler-Methodenparameter können nicht als ByRef deklariert werden.
es: 'Los parámetros de método 'AddHandler' y 'RemoveHandler' no se pueden declarar como 'ByRef'.
fr: 'Les paramètres de méthode 'AddHandler' et 'RemoveHandler' ne peuvent pas être déclarés 'ByRef'.
it: 'I parametri dei metodi 'AddHandler' e 'RemoveHandler' non possono essere dichiarati come 'ByRef'.
ja: 'AddHandler' および 'RemoveHandler' メソッドのパラメーターは 'ByRef' として宣言できません。
ko: 'AddHandler' 및 'RemoveHandler' 메서드 매개 변수는 'ByRef'로 선언할 수 없습니다.
pl: 'Parametrów metody „AddHandler” i „RemoveHandler” nie można deklarować jako „ByRef”.
pt_br: 'Não é possível declarar os parâmetros de método 'AddHandler' e 'RemoveHandler' como 'ByRef'.
ru: 'Параметры методов "AddHandler" и "RemoveHandler" не могут быть объявлены как "ByRef".
tr: 'AddHandler' ve 'RemoveHandler' yöntem parametreleri 'ByRef' ile bildirilemez.
zh_hans: '“AddHandler”和“RemoveHandler”方法参数不能声明为“ByRef”。
zh_hant: 'AddHandler' 和 'RemoveHandler' 方法參數不可以宣告為 'ByRef'。

# ERR_SpecifiersInvOnEventMethod
source: Specifiers are not valid on 'AddHandler', 'RemoveHandler' and 'RaiseEvent' methods.
cs: Specifikátory nejsou platné pro metody AddHandler, RemoveHandler a RaiseEvent.
de: Spezifizierer sind für AddHandler-, RemoveHandler- und RaiseEvent-Methoden nicht zulässig.
es: Los especificadores no son válidos en los métodos 'AddHandler', 'RemoveHandler' y 'RaiseEvent'.
fr: Les spécificateurs ne sont pas valides pour les méthodes 'AddHandler', 'RemoveHandler' et 'RaiseEvent'.
it: Gli identificatori non sono validi nei metodi 'AddHandler', 'RemoveHandler' e 'RaiseEvent'.
ja: AddHandler'、'RemoveHandler'、および 'RaiseEvent' メソッドでは、指定子は有効ではありません。
ko: AddHandler', 'RemoveHandler' 및 'RaiseEvent' 메서드에는 지정자를 사용할 수 없습니다.
pl: Specyfikatory w metodach „AddHandler”, „RemoveHandler” i „RaiseEvent” są nieprawidłowe.
pt_br: Especificadores não são válidos em métodos 'AddHandler', 'RemoveHandler' e 'RaiseEvent'.
ru: Спецификаторы не применимы к методам "AddHandler", "RemoveHandler" и "RaiseEvent".
tr: AddHandler', 'RemoveHandler' ve 'RaiseEvent' yöntemlerinde tanımlayıcılar geçerli değil.
zh_hans: 说明符在 "AddHandler"、"RemoveHandler" 和 "RaiseEvent" 方法上无效。
zh_hant: AddHandler'、'RemoveHandler' 和 'RaiseEvent' 方法上的規範無效。

# ERR_AddRemoveParamNotEventType
source: 'AddHandler' and 'RemoveHandler' method parameters must have the same delegate type as the containing event.
cs: 'Parametry metody AddHandler a RemoveHandler musí mít stejný typ delegáta jako událost, která je obsahuje.
de: 'AddHandler- und RemoveHandler-Methodenparameter müssen den gleichen Delegattyp wie das enthaltende Ereignis aufweisen.
es: 'Los parámetros de método 'AddHandler' y 'RemoveHandler' deben tener el mismo tipo delegado que el evento que los contiene.
fr: 'Les paramètres de méthode 'AddHandler' et 'RemoveHandler' doivent avoir le même type délégué que l'événement conteneur.
it: 'Il tipo delegato dei parametri dei metodi 'AddHandler' e 'RemoveHandler' deve essere uguale a quello dell'evento che li contiene.
ja: 'AddHandler' および 'RemoveHandler' メソッドのパラメーターには、それを含むイベントと同じデリゲート型を指定しなければなりません。
ko: 'AddHandler' 및 'RemoveHandler' 메서드 매개 변수의 대리자 형식은 포함하는 이벤트의 대리자 형식과 같아야 합니다.
pl: 'Parametry metody „AddHandler” i „RemoveHandler” muszą mieć ten sam typ delegata co zawierające je zdarzenie.
pt_br: 'Os parâmetros de métodos 'AddHandler' e 'RemoveHandler' devem ter o mesmo tipo delegado como o evento recipiente.
ru: 'Параметры методов "AddHandler" и "RemoveHandler" должны иметь такой же тип делегата, как содержащее их событие.
tr: 'AddHandler' ve 'RemoveHandler' yöntem parametrelerinin temsilci türüyle kapsayan olayın temsilci türü aynı olmalıdır.
zh_hans: '“AddHandler”和“RemoveHandler”方法参数必须与包含事件具有相同的委托类型。
zh_hant: 'AddHandler' 和 'RemoveHandler' 方法參數必須與包含事件擁有相同的委派類型。

# ERR_RaiseEventShapeMismatch1
source: 'RaiseEvent' method must have the same signature as the containing event's delegate type '{0}'.
cs: 'Metoda RaiseEvent musí mít stejný podpis jako typ delegáta události, která ji obsahuje {0}.
de: 'Die RaiseEvent-Methode muss die gleiche Signatur wie der Delegattyp "{0}" des enthaltenden Ereignisses aufweisen.
es: 'El método 'RaiseEvent' debe tener la misma firma que el tipo delegado '{0}' del evento que lo contiene.
fr: 'La méthode 'RaiseEvent' doit avoir la même signature que le type délégué de l'événement conteneur '{0}'.
it: 'Il metodo 'RaiseEvent' deve avere la stessa firma del tipo delegato '{0}' dell'evento che lo contiene.
ja: 'RaiseEvent' メソッドには、含んでいるイベントのデリゲート型 '{0}' として同じシグネチャを指定しなければなりません。
ko: 'RaiseEvent' 메서드의 시그니처는 포함하는 이벤트의 대리자 형식 '{0}'의 시그니처와 같아야 합니다.
pl: 'Metoda „RaiseEvent” musi mieć taką samą sygnaturę jak typ delegowany „{0}” zdarzenia zawierającego.
pt_br: 'O método "RaiseEvent" deve ter a mesma assinatura do tipo delegado do evento recipiente "{0}".
ru: 'Метод "RaiseEvent" должен иметь одинаковую сигнатуру с типом делегата содержащегося события "{0}".
tr: 'RaiseEvent' yönteminin imzası, kapsayıcı olayın '{0}' temsilci türünün imzasıyla aynı olmalıdır.
zh_hans: '“RaiseEvent”方法必须具有与包含事件的委托类型“{0}”相同的签名。
zh_hant: 'RaiseEvent' 方法必須與包含的事件委派類型 '{0}'，擁有相同的簽章。

# ERR_EventMethodOptionalParamIllegal1
source: 'AddHandler', 'RemoveHandler' and 'RaiseEvent' method parameters cannot be declared '{0}'.
cs: 'Parametry metody AddHandler, RemoveHandler a RaiseEvent nemůžou být deklarované jako {0}.
de: 'Die AddHandler-, RemoveHandler- und RaiseEvent-Methodenparameter können nicht als "{0}" deklariert werden.
es: 'Los parámetros de método 'AddHandler', 'RemoveHandler' y 'RaiseEvent' no se pueden declarar como '{0}'.
fr: 'Les paramètres de méthode 'AddHandler', 'RemoveHandler' et 'RaiseEvent' ne peuvent pas être déclarés '{0}'.
it: 'I parametri dei metodi 'AddHandler', 'RemoveHandler' e 'RaiseEvent' non possono essere dichiarati come '{0}'.
ja: 'AddHandler'、'RemoveHandler'、'RaiseEvent' メソッド パラメーターは '{0}' として宣言できません。
ko: 'AddHandler', 'RemoveHandler' 및 'RaiseEvent' 메서드 매개 변수는 '{0}'(으)로 선언할 수 없습니다.
pl: 'Parametrów metod „AddHandler”, „RemoveHandler” i „RaiseEvent” nie można zadeklarować jako „{0}”.
pt_br: 'Parâmetros de método "AddHandler", "RemoveHandler" e "RaiseEvent" não podem ser declarados "{0}".
ru: 'Параметры методов "AddHandler", "RemoveHandler" и "RaiseEvent" не могут быть объявлены "{0}".
tr: 'AddHandler', 'RemoveHandler' ve 'RaiseEvent' yöntem parametreleri '{0}' olarak bildirilemez.
zh_hans: '“AddHandler”、“RemoveHandler”和“RaiseEvent”方法参数不能声明为“{0}”。
zh_hant: 'AddHandler'、'RemoveHandler' 和 'RaiseEvent' 方法參數不可宣告為 '{0}'。

# ERR_CantReferToMyGroupInsideGroupType1
source: '{0}' cannot refer to itself through its default instance; use 'Me' instead.
cs: '{0} nemůže odkazovat sama na sebe prostřednictvím výchozí instance; místo toho použijte možnost Me.
de: '"{0}" kann nicht durch die Standardinstanz auf sich selbst verweisen. Verwenden Sie stattdessen "Me".
es: '{0}' no puede hacer referencia a sí mismo a través de su instancia predeterminada; use 'Me' en su lugar.
fr: '{0}' ne peut pas faire référence à lui-même via son instance par défaut ; utilisez 'Me' à la place.
it: '{0}' non può fare riferimento a se stesso mediante la sua istanza predefinita. Usare 'Me'.
ja: '{0}' は、既定のインスタンスからそれ自体を参照できません。'Me' を使用してください。
ko: '{0}'은(는) 기본 인스턴스를 통해 자신을 참조할 수 없습니다. 대신 'Me'를 사용하세요.
pl: 'Element „{0}” nie może odwoływać się do siebie samego za pomocą domyślnego wystąpienia; zamiast tego użyj konstrukcji „Me”.
pt_br: "{0}" não pode referir-se a si mesmo por meio de sua instância padrão; ao invés disso, use "Me".
ru: "{0}" не может ссылаться на себя с помощью экземпляра по умолчанию; вместо этого используйте "Me".
tr: '{0}' varsayılan örneği aracılığıyla kendi kendine başvuramaz; bunun yerine 'Me' kullanın.
zh_hans: '“{0}”不能通过其默认实例指代自身；请改用“Me”。
zh_hant: '{0}' 不可透過其預設執行個體參考本身; 請改用 'Me'。

# ERR_InvalidUseOfCustomModifier
source: 'Custom' modifier can only be used immediately before an 'Event' declaration.
cs: 'Modifikátor Custom jde použít jenom bezprostředně před deklarací Event.
de: 'Der Custom-Modifizierer kann nur unmittelbar vor einer Ereignisdeklaration verwendet werden.
es: 'El modificador 'Custom' solo se puede usar inmediatamente antes de una declaración 'Event'.
fr: 'Un modificateur 'Custom' ne peut être utilisé qu'immédiatement avant une déclaration 'Event'.
it: 'Il modificatore 'Custom' può essere usato solo subito prima di una dichiarazione 'Event'.
ja: 'Custom' 修飾子は 'Event' 宣言の直前にのみ使用することができます。
ko: 'Custom' 한정자는 'Event' 선언 바로 앞에만 사용할 수 있습니다.
pl: 'Modyfikatora „Custom” można używać tylko bezpośrednio przed deklaracją „Event”.
pt_br: 'O modificador 'Custom' só pode ser usado imediatamente antes de uma declaração de 'Event'.
ru: 'Модификатор "Custom" может использоваться только непосредственно перед объявлением "Event".
tr: 'Custom' değiştiricisi yalnızca 'Event' bildiriminden hemen önce kullanılabilir.
zh_hans: '"Custom" 修饰符只能在紧靠 "Event" 声明之前使用。
zh_hant: 'Custom' 修飾元只能緊接地用於 'Event' 宣告的前面。

# ERR_InvalidOptionStrictCustom
source: Option Strict Custom can only be used as an option to the command-line compiler (vbc.exe).
cs: Možnost Option Strict Custom jde použít jenom jako parametr kompilátoru příkazového řádku (vbc.exe).
de: "Option Strict Custom" kann nur als Option für den Befehlszeilencompiler (vbc.exe) verwendet werden.
es: Option Strict Custom solo se puede usar como una opción del compilador de la línea de comandos (vbc.exe).
fr: Option Strict Custom ne peut être utilisé qu'en tant qu'option du compilateur de ligne de commande (vbc.exe).
it: Option Strict Custom può essere usato solo come opzione del compilatore della riga di comando (vbc.exe).
ja: Option Strict Custom は、コマンド ライン コンパイラ (vbc.exe) へのオプションとしてのみ使用することができます。
ko: Option Strict Custom은 명령줄 컴파일러(vbc.exe)에 대한 옵션으로만 사용할 수 있습니다.
pl: Elementu Option Strict Custom można użyć tylko jako opcji dla kompilatora wiersza polecenia (vbc.exe).
pt_br: Option Strict Custom só pode ser usada como opção para o compilador de linha de comando (vbc.exe).
ru: Option Strict Custom может использоваться только как параметр компилятора командной строки (vbc.exe).
tr: Option Strict Custom yalnızca komut satırı derleyicisi (vbc.exe) için bir seçenek olarak kullanılabilir.
zh_hans: Option Strict Custom 只能用作命令行编译器(vbc.exe)的选项。
zh_hant: Option Strict Custom 只能當做命令列編譯器 (vbc.exe) 選項使用。

# ERR_ObsoleteInvalidOnEventMember
source: '{0}' cannot be applied to the 'AddHandler', 'RemoveHandler', or 'RaiseEvent' definitions. If required, apply the attribute directly to the event.
cs: '{0} nejde použít pro definice AddHandler, RemoveHandler nebo RaiseEvent. V případě potřeby použijte atribut přímo pro událost.
de: '"{0}" kann nicht auf die Definitionen AddHandler, RemoveHandler oder RaiseEvent angewendet werden. Wenden Sie das Attribut, falls erforderlich, direkt auf das Ereignis an.
es: '{0}' no se puede aplicar a las definiciones de 'AddHandler', 'RemoveHandler' o 'RaiseEvent'. Si es necesario, aplique el atributo directamente al evento.
fr: '{0}' ne peut pas être appliqué aux définitions 'AddHandler', 'RemoveHandler', or 'RaiseEvent'. Si nécessaire, appliquez l'attribut directement à l'événement.
it: 'Non è possibile applicare '{0}' alle definizioni di 'AddHandler', 'RemoveHandler' o 'RaiseEvent'. Se necessario, applicare l'attributo direttamente all'evento.
ja: '{0}' を 'AddHandler'、'RemoveHandler'、または 'RaiseEvent' 定義に適用できません。必要であれば、属性をイベントに直接適用してください。
ko: '{0}'은(는) 'AddHandler', 'RemoveHandler' 또는 'RaiseEvent' 정의에 적용할 수 없습니다. 필요한 경우 특성을 이벤트에 직접 적용하세요.
pl: 'Elementu „{0}” nie można stosować do definicji „AddHandler”, „RemoveHandler” ani „RaiseEvent”. Jeśli jest to wymagane, zastosuj atrybut bezpośrednio do zdarzenia.
pt_br: "{0}" não pode ser aplicado às definições "AddHandler", "RemoveHandler" ou "RaiseEvent". Se necessário, aplique o atributo diretamente ao evento.
ru: "{0}" не может быть применен к определениям "AddHandler", "RemoveHandler" или "RaiseEvent". При необходимости примените атрибут непосредственно к событию.
tr: 'AddHandler', 'RemoveHandler' veya 'RaiseEvent' tanımlarına '{0}' uygulanamaz. Gerekirse, özniteliği olaya doğrudan uygulayın.
zh_hans: '“{0}”不能应用于“'AddHandler”、“RemoveHandler”或“'RaiseEvent”定义。如有必要，请将该属性直接应用于事件。
zh_hant: '{0}' 無法套用至 'AddHandler'、'RemoveHandler' 或 'RaiseEvent' 定義。必要時，請將屬性直接套用至事件。

# ERR_DelegateBindingIncompatible2
source: Method '{0}' does not have a signature compatible with delegate '{1}'.
cs: Podpis metody {0} není kompatibilní s delegátem {1}.
de: Die Signatur der {0}-Methode ist mit dem Delegaten "{1}" nicht kompatibel.
es: El método '{0}' no tiene una firma compatible con el delegado '{1}'.
fr: La méthode '{0}' n'a pas de signature compatible avec le délégué '{1}'.
it: La firma del metodo '{0}' non è compatibile con il delegato '{1}'.
ja: メソッド '{0}' に、デリゲート '{1}' と互換性があるシグネチャがありません。
ko: '{0}' 메서드에 '{1}' 대리자와 호환되는 시그니처가 없습니다.
pl: Metoda „{0}” nie ma sygnatury zgodnej z delegatem „{1}”.
pt_br: Método "{0}" não tem uma assinatura compatível com o delegado "{1}".
ru: Метод расширения "{0}" не имеет сигнатуры, совместимой с делегатом "{1}".
tr: '{0}' yönteminin '{1}' temsilcisiyle uyumlu bir imzası yok.
zh_hans: 方法“{0}”没有与委托“{1}”兼容的签名。
zh_hant: 方法 '{0}' 沒有與委派 '{1}' 相容的簽章。

# ERR_ExpectedXmlName
source: XML name expected.
cs: Očekával se název XML.
de: XML-Name erwartet.
es: Se esperaba un nombre XML.
fr: Nom XML attendu.
it: È previsto il nome XML.
ja: XML 名が必要です。
ko: XML 이름이 필요합니다.
pl: Oczekiwano nazwy XML.
pt_br: Nome XML esperado.
ru: Ожидалось XML-имя.
tr: XML adı bekleniyor.
zh_hans: 应为 XML 名称。
zh_hant: 必須是 XML 名稱。

# ERR_UndefinedXmlPrefix
source: XML namespace prefix '{0}' is not defined.
cs: Není definovaná předpona názvu XML {0}.
de: Das XML-Namespacepräfix "{0}" ist nicht definiert.
es: El prefijo '{0}' del espacio de nombres XML no está definido.
fr: Le préfixe de l'espace de noms XML '{0}' n'est pas défini.
it: Il prefisso dello spazio dei nomi XML '{0}' non è definito.
ja: XML 名前空間プレフィックス '{0}' が定義されていません。
ko: XML 네임스페이스 접두사 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano prefiksu przestrzeni nazw XML „{0}”.
pt_br: O prefixo do namespace XML "{0}" não está definido.
ru: Префикс пространства имен XML "{0}" не определен.
tr: '{0}' XML ad alanı ön eki tanımlanmadı.
zh_hans: 未定义 XML 命名空间前缀“{0}”。
zh_hant: XML 命名空間前置詞 '{0}' 未定義。

# ERR_DuplicateXmlAttribute
source: Duplicate XML attribute '{0}'.
cs: Duplicitní atribut XML {0}
de: Doppeltes XML-Attribut "{0}".
es: Atributo XML '{0}' duplicado.
fr: Attribut XML '{0}' en double.
it: L'attributo XML '{0}' è duplicato.
ja: XML 属性 '{0}' が重複しています。
ko: '{0}' XML 특성이 중복되었습니다.
pl: Zduplikowany atrybut XML „{0}”.
pt_br: Atributo XML duplicado "{0}".
ru: Повторяющийся атрибут XML "{0}".
tr: Yinelenen '{0}' XML özniteliği.
zh_hans: 重复的 XML 属性“{0}”。
zh_hant: 重複的 XML 屬性 '{0}'。
