Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadAwaitInNonAsyncVoidMethod
source: 'Await' can only be used within an Async method. Consider marking this method with the 'Async' modifier and changing its return type to 'Task'.
cs: 'Operátor Await jde použít jenom v asynchronní metodě. Zvažte označení této metody pomocí modifikátoru Async a změnu jejího návratového typu na Task.
de: '"Await" kann nur innerhalb einer Async-Methode verwendet werden. Markieren Sie ggf. diese Methode mit dem Async-Modifizierer, und ändern Sie ihren Rückgabetyp in "Task".
es: 'Await' solo se puede usar dentro de un método Async. Marque este método con el modificador 'Async' y cambie su tipo de valor devuelto a 'Task'.
fr: 'Await' peut uniquement être utilisé dans une méthode Async. Marquez cette méthode avec le modificateur 'Async' et changez son type de retour en 'Task'.
it: 'Await' può essere usato solo all'interno di un metodo asincrono. Provare a contrassegnare il metodo con il modificatore 'Async' e impostare il tipo restituito su 'Task'.
ja: 'Await' は、非同期メソッド内でのみ使用できます。このメソッドに 'Async' 修飾子を指定して、その戻り値の型を 'Task' に変更することを検討してください。
ko: 'Await'는 비동기 메서드 내에서만 사용할 수 있습니다. 'Async' 한정자로 이 메서드를 표시하고 해당 반환 형식을 'Task'로 변경하세요.
pl: 'Słowo kluczowe „Await” może zostać użyte tylko wewnątrz metody asynchronicznej. Rozważ oznaczenie tej metody za pomocą modyfikatora „Async” i zmianę zwracanego przez nią typu na „Task”.
pt_br: 'Await' só pode ser usado em um método Async. Considere a marcação desse método com o modificador 'Async' e a alteração do tipo de retorno para 'Task'.
ru: 'Оператор await можно использовать только в методах с модификатором async. Попробуйте пометить этот метод модификатором async и изменить тип его возвращаемого значения на Task.
tr: 'Await' yalnızca Zaman Uyumsuz bir yöntemde kullanılabilir. Bu yöntemi 'Async' değiştiricisiyle işaretleyebilir ve dönüş türünü 'Task' olarak değiştirebilirsiniz.
zh_hans: '“Await”只能用于异步方法中。请考虑用“Async”修饰符标记此方法，并将其返回类型更改为“Task”。
zh_hant: 'Await' 只能在非同步方法使用。請考慮以 'Async' 修飾元標記此方法，並將它的傳回類型變更為 'Task'。

# ERR_BadAwaitInNonAsyncLambda
source: 'Await' can only be used within an Async lambda expression. Consider marking this lambda expression with the 'Async' modifier.
cs: 'Operátor Await jde použít jenom v asynchronním výrazu lambda. Zvažte označení tohoto výrazu lambda pomocí modifikátoru Async.
de: '"Await" kann nur in einem Async-Lambdaausdruck verwendet werden. Markieren Sie ggf. diesen Lambdaausdruck mit dem Async-Modifizierer
es: 'Await' solo se puede usar dentro de una expresión lambda. Marque esta expresión lambda con el modificador 'Async'.
fr: 'Await' peut uniquement être utilisé dans une expression lambda Async. Marquez cette expression lambda avec le modificateur 'Async'.
it: 'Await' può essere usato solo all'interno di un'espressione lambda asincrona. Provare a contrassegnare l'espressione lambda con il modificatore 'Async'.
ja: 'Await' は、非同期ラムダ式内でのみ使用できます。このラムダ式に 'Async' 修飾子を指定することを検討してください。
ko: 'Await'는 Async 람다 식 내에서만 사용할 수 있습니다. 'Async' 한정자로 이 람다 식을 표시하세요.
pl: 'Słowo kluczowe „Await” może zostać użyte tylko wewnątrz wyrażenia lambda. Rozważ oznaczenie tego wyrażenia lambda za pomocą modyfikatora „Async”.
pt_br: 'Await' só pode ser usado com uma expressão lambda Async. Considere a marcação dessa expressão lambda com o modificador 'Async'.
ru: 'Оператор await можно использовать только в лямбда-выражениях с модификатором async. Попробуйте пометить это лямбда-выражение модификатором async.
tr: 'Await' yalnızca Zaman Uyumsuz lambda ifadesinde kullanılabilir. Bu lambda ifadesini 'Async' değiştiricisiyle işaretleyebilirsiniz.
zh_hans: '“Await”只能用于异步 lambda 表达式中。请考虑用“Async”修饰符标记此 lambda 表达式。
zh_hant: 'Await' 只能在非同步 Lambda 運算式使用。請考慮以 'Async' 修飾元標記此 Lambda 運算式。

# ERR_BadAwaitNotInAsyncMethodOrLambda
source: 'Await' can only be used when contained within a method or lambda expression marked with the 'Async' modifier.
cs: 'Operátor Await jde použít, jenom pokud je obsažen v metodě nebo výrazu lambda označeném pomocí modifikátoru Async.
de: '"Await" kann nur verwendet werden, wenn es in einer Methode oder einem Lambdaausdruck enthalten ist, die bzw. der mit dem Async-Modifizierer markiert ist.
es: 'Await' solo se puede usar cuando está contenido dentro de un método o expresión lambda marcada con el modificador 'Async'.
fr: 'Await' peut uniquement être utilisé lorsqu'il est contenu dans une méthode ou une expression lambda marquée avec le modificateur 'Async'.
it: 'Await' può essere usato solo se contenuto in un metodo o un'espressione lambda contrassegnata con il modificatore 'Async'.
ja: 'Await' は、'Async' 修飾子が設定されているメソッドまたはラムダ式に含まれている場合にのみ使用できます。
ko: 'Await'는 'Async' 한정자로 표시된 메서드나 람다 식 내에 포함된 경우에만 사용할 수 있습니다.
pl: 'Słowo kluczowe „Await” może zostać użyte tylko wewnątrz metody lub wyrażenia lambda oznaczonego modyfikatorem „Async”.
pt_br: 'Await' só poderá ser usado quando contido em um método ou expressão lambda marcada com o modificador 'Async'.
ru: 'Оператор await можно использовать, только если он содержится в методе или лямбда-выражении, помеченном модификатором async.
tr: 'Await' yalnızca bir yöntemde veya 'Async' değiştiricisiyle işaretlenen lambda ifadesinde yer aldığında kullanılabilir.
zh_hans: '仅当其包含方法或 lambda 表达式用“Async”修饰符标记时，才能使用“Await”。
zh_hant: 'Await' 只有在包含於以 'Async' 修飾元標記的方法或 Lambda 運算式時才能使用。

# ERR_StatementLambdaInExpressionTree
source: Statement lambdas cannot be converted to expression trees.
cs: Výrazy lambda příkazů nejde převést na stromy výrazů.
de: Anweisungslambdafunktionen können nicht in Ausdrucksbäume konvertiert werden.
es: Las expresiones lambda de instrucción no se pueden convertir en árboles de expresión.
fr: Des lambda-instructions ne peuvent pas être converties en arborescences de l'expression.
it: Non è possibile convertire espressioni lambda di istruzioni in alberi delle espressioni.
ja: ステートメント形式のラムダを式ツリーに変換することはできません。
ko: 문 람다를 식 트리로 변환할 수 없습니다.
pl: Instrukcji lambda nie można konwertować na drzewa wyrażeń.
pt_br: Não é possível converter lambdas de instruções em árvores de expressão.
ru: Лямбды оператора невозможно преобразовать в деревья выражений.
tr: Deyim lambdaları ifade ağaçlarına dönüştürülemez.
zh_hans: 语句 lambda 不能转换为表达式树。
zh_hant: 陳述式 Lambda 無法轉換成運算式樹狀結構。

# WRN_UnobservedAwaitableExpression
source: Because this call is not awaited, execution of the current method continues before the call is completed. Consider applying the Await operator to the result of the call.
cs: Protože se toto volání neočekávalo, vykonávání aktuální metody pokračuje před dokončením volání. Zvažte použití operátoru Await na výsledek volání.
de: Da auf diesen Aufruf nicht gewartet wird, wird die Ausführung der aktuellen Methode vor Abschluss des Aufrufs fortgesetzt. Ziehen Sie ein Anwenden des Await-Operators auf das Ergebnis des Aufrufs in Betracht.
es: Como esta llamada no es 'awaited', la ejecución del método actual continuará antes de que se complete la llamada. Puede aplicar el operador Await al resultado de la llamada.
fr: Dans la mesure où cet appel n'est pas attendu, l'exécution de la méthode actuelle continue avant la fin de l'appel. Envisagez d'appliquer l'opérateur Await au résultat de l'appel.
it: Non è possibile attendere la chiamata, pertanto l'esecuzione del metodo corrente continuerà prima del completamento della chiamata. Provare ad applicare l'operatore 'Await' al risultato della chiamata.
ja: この呼び出しは待機されなかったため、現在のメソッドの実行は呼び出しの完了を待たずに続行されます。呼び出しの結果に Await 演算子を適用することを検討してください。
ko: 이 호출이 대기되지 않으므로 호출이 완료되기 전에 현재 메서드가 계속 실행됩니다. 호출 결과에 Await 연산자를 적용해 보세요.
pl: Ponieważ to wywołanie nie jest oczekiwane, wykonywanie bieżącej metody będzie kontynuowane do czasu ukończenia wywołania. Rozważ zastosowanie operatora Await do wyniku wywołania.
pt_br: Como esta chamada não é aguardada, a execução do método atual continua antes da conclusão da chamada. Considere aplicar o operador Await ao resultado da chamada.
ru: Поскольку этот вызов не ожидается, выполнение текущего метода продолжается до завершения вызова. Попробуйте применить оператор Await к результату вызова.
tr: Bu çağrı beklenmediğinden, çağrı tamamlanmadan geçerli yöntemin yürütülmesine devam edilir. Çağrının sonucuna Await işlecini ekleyebilirsiniz.
zh_hans: 由于此调用不会等待，因此在调用完成前将继续执行当前方法。请考虑对调用结果应用 Await 运算符。
zh_hant: 因為未等候此呼叫，所以在呼叫完成之前會繼續執行目前方法。請考慮將 Await 運算子套用至呼叫的結果。

# WRN_UnobservedAwaitableExpression_Title
source: Because this call is not awaited, execution of the current method continues before the call is completed
cs: Protože se toto volání neočekává, vykonávání aktuální metody pokračuje před dokončením volání.
de: Da auf diesen Aufruf nicht gewartet wird, wird die Ausführung der aktuellen Methode vor Abschluss des Aufrufs fortgesetzt.
es: Dado que no se esperaba esta llamada, la ejecución del método actual continuará antes de que se complete la llamada
fr: Dans la mesure où cet appel n'est pas attendu, l'exécution de la méthode actuelle continue avant la fin de l'appel
it: Non è possibile attendere la chiamata, pertanto l'esecuzione del metodo corrente continuerà prima del completamento della chiamata
ja: この呼び出しは待機されなかったため、現在のメソッドの実行は呼び出しの完了を待たずに続行されます
ko: 이 호출을 대기하지 않으므로 호출이 완료되기 전에 현재 메서드가 계속 실행됩니다.
pl: To wywołanie nie jest oczekiwane, dlatego wykonywanie bieżącej metody będzie kontynuowane do czasu ukończenia wywołania
pt_br: Como esta chamada não é esperada, a execução do método atual continua antes de a chamada ser concluída
ru: Так как этот вызов не ожидается, выполнение существующего метода продолжается до тех пор, пока вызов не будет завершен
tr: Bu çağrı beklenmediği için, çağrı tamamlanmadan önce geçerli yöntemin yürütülmesine devam ediliyor
zh_hans: 由于此调用不会等待，因此在调用完成前将继续执行当前方法
zh_hant: 因為未等待此呼叫，所以在完成呼叫之前會繼續執行目前方法

# ERR_LoopControlMustNotAwait
source: Loop control variable cannot include an 'Await'.
cs: Řídicí proměnná smyčky nemůže obsahovat operátor Await.
de: Eine Schleifensteuervariable kann kein "Await" enthalten.
es: La variable de control de bucle no puede incluir 'Await'.
fr: La variable de contrôle de boucle ne peut pas inclure un 'Await'.
it: Non è possibile includere 'Await' in una variabile di controllo ciclo.
ja: ループ制御変数に 'Await' を含めることはできません。
ko: 루프 제어 변수에는 'Await'를 포함할 수 없습니다.
pl: Zmienna sterująca pętli nie może zawierać słowa kluczowego „Await”.
pt_br: A variável de controle de loop não pode incluir um 'Await'.
ru: Управляющая переменная цикла не может содержать "Await".
tr: Döngü denetim değişkeni 'Await' içeremez.
zh_hans: 循环控制变量不可包含 "Await"。
zh_hant: 迴圈控制變數不可包含 'Await'。

# ERR_BadStaticInitializerInResumable
source: Static variables cannot appear inside Async or Iterator methods.
cs: Uvnitř asynchronních metod nebo iterátorů se nemůžou vyskytovat statické proměnné.
de: Statische Variablen können in Async- oder Iterator-Methoden nicht verwendet werden.
es: Las variables estáticas no pueden aparecer dentro de los métodos Async ni Iterator.
fr: Les méthodes Async et Iterator ne peuvent pas contenir de variables statiques.
it: Gli inizializzatori statici non possono essere specificati all'interno di metodi Async o Iterator.
ja: Static 変数は、Async メソッドまたは Iterator メソッドの内部では使用できません。
ko: 정적 변수는 비동기 또는 리터럴 메서드 내에 나타날 수 없습니다.
pl: Zmienne statyczne nie mogą być używane w metodach Async lub Iterator.
pt_br: Variáveis estáticas não podem aparecer dentro dos métodos Assíncrono ou Iterador.
ru: В методах Async или Iterator нельзя использовать статические переменные.
tr: Zaman Uyumsuz veya Yineleyici yöntemlerin içinde statik değişkenler bulunamaz.
zh_hans: 静态变量不能出现在异步方法或迭代器方法内。
zh_hant: 靜態變數不可出現在 Async 或 Iterator 方法中。

# ERR_RestrictedResumableType1
source: '{0}' cannot be used as a parameter type for an Iterator or Async method.
cs: '{0} nejde použít jako typ parametru pro metodu iterátoru nebo asynchronní metodu.
de: '"{0}" kann nicht als Parametertyp einer Iterator- oder Async-Methode verwendet werden.
es: '{0}' no se puede usar como tipo de parámetro para un método Iterator o Async.
fr: '{0}' ne peut pas être utilisé en tant que type de paramètre pour une méthode Iterator ou Async.
it: '{0}' non può essere usato come tipo di parametro per un metodo Iterator o Async.
ja: '{0}' を Iterator メソッドまたは Async メソッドのパラメーター型として使用することはできません。
ko: '{0}'은(는) 반복기 또는 비동기 메서드의 매개 변수 형식으로 사용할 수 없습니다.
pl: 'Typ „{0}” nie może być używany jako parametr typu dla metody Iterator lub Async.
pt_br: "{0}" não pode ser usado como um tipo de parâmetro para um método Iterador ou Assíncrono.
ru: "{0}" не может быть использовано в качестве типа параметра для метода Iterator или Async.
tr: '{0}' bir Yineleyici veya Zaman Uyumsuz metot için parametre türü olarak kullanılamaz.
zh_hans: '“{0}”不能用作 Iterator 或 Async 方法的参数类型。
zh_hant: '{0}' 不能用做為 Iterator 或 Async 方法的參數類型。

# ERR_ConstructorAsync
source: Constructor must not have the 'Async' modifier.
cs: Konstruktor nesmí mít modifikátor Async.
de: Der Konstruktor darf nicht über den Async-Modifizierer verfügen.
es: El constructor no debe tener el modificador 'Async'.
fr: Le constructeur doit être associé au modificateur 'Async'.
it: Il costruttore non può avere un modificatore 'Async'.
ja: コンストラクターに 'Async' 修飾子を指定することはできません。
ko: 생성자에는 'Async' 한정자를 사용하면 안 됩니다.
pl: Konstruktor nie może zawierać modyfikatora „Async”.
pt_br: O construtor não deve ter o modificador 'Async'.
ru: Конструктор не должен иметь модификатор "Async".
tr: Oluşturucuda 'Async' değiştiricisi bulunmamalıdır.
zh_hans: 构造函数不得包含“Async”修饰符。
zh_hant: 建構函式不可以有 'Async' 修飾元。

# ERR_PartialMethodsMustNotBeAsync1
source: '{0}' cannot be declared 'Partial' because it has the 'Async' modifier.
cs: 'Metodu {0} nejde deklarovat s použitím modifikátoru Partial, protože se pro ni už používá modifikátor Async.
de: '"{0}" kann nicht als "Partial" deklariert werden, da es über den Async-Modifizierer verfügt.
es: '{0}' no se puede declarar como 'Partial' porque tiene el modificador 'Async'.
fr: '{0}' ne peut pas être déclaré comme 'Partial', car son modificateur est de type 'Async'.
it: 'Non è possibile dichiarare '{0}' come 'Partial' poiché ha il modificatore 'Async'.
ja: 'Async' 修飾子があるため、'{0}' は 'Partial' として宣言できません。
ko: '{0}'은(는) 'Async' 한정자가 있으므로 'Partial'로 선언할 수 없습니다.
pl: 'Nie można zadeklarować metody „{0}” jako „Partial”, ponieważ ma ona modyfikator „Async”.
pt_br: "{0}" não pode ser declarado como "Parcial" porque ele tem o modificador "Async".
ru: "{0}" не может быть объявлен "Partial", так как имеет модификатор "Async".
tr: 'Async' değiştiricisine sahip olduğundan '{0}' 'Partial' olarak bildirilemiyor.
zh_hans: '“{0}”不能声明为“Partial”，因为它具有“Async”修饰符。
zh_hant: '{0}' 不可宣告為 'Partial'，因為其具有 'Async' 修飾元。

# ERR_ResumablesCannotContainOnError
source: 'On Error' and 'Resume' cannot appear inside async or iterator methods.
cs: 'Uvnitř asynchronních metod nebo iterátorů se nemůžou vyskytovat příkazy On Error nebo Resume.
de: '"On Error" und "Resume" können nicht in Async- oder Iterator-Methoden verwendet werden.
es: 'On Error' y 'Resume' no pueden aparecer dentro de métodos asincrónicos o iteradores.
fr: 'Les méthodes Async et Iterator ne peuvent pas contenir d'instructions 'On Error' et 'Resume' .
it: 'On Error' e 'Resume' non possono essere specificati all'interno di metodi async o iterator.
ja: 'On Error' および 'Resume' は、Async または Iterator メソッドの内部では使用できません。
ko: 'On Error' 및 'Resume'은 비동기 또는 반복기 메서드 내에 표시될 수 없습니다.
pl: 'W metodach asynchronicznych i iteracyjnych nie mogą występować instrukcje „On Error” ani „Resume”.
pt_br: 'On Error' e 'Resume' não podem aparecer em métodos async ou iterator.
ru: 'В методах, помеченных модификатором "Async" или "Iterator", не могут возникать события "On Error" и "Resume".
tr: 'Zaman uyumsuz veya yineleyici yöntemlerin içinde 'On Error' ve 'Resume' bulunamaz.
zh_hans: '"On Error" 和 "Resume" 不能出现在异步方法或迭代器方法内。
zh_hant: 'On Error' 和 'Resume' 不可以出現在 async 或 iterator 方法內。

# ERR_ResumableLambdaInExpressionTree
source: Lambdas with the 'Async' or 'Iterator' modifiers cannot be converted to expression trees.
cs: Výrazy lambda s modifikátory Async nebo Iterator nejde převést na stromy výrazů.
de: Lambdafunktionen mit dem Async- oder Iterator-Modifizierer können nicht in Ausdrucksbäume konvertiert werden.
es: Las expresiones lambda con los modificadores 'Async' o 'Iterator' no se pueden convertir en árboles de expresión.
fr: Les expressions lambda avec un modificateur 'Async' ou 'Iterator' ne peuvent pas être converties en arborescences d'expression.
it: Non è possibile convertire espressioni lambda con modificatori 'Async' o 'Iterator' in alberi delle espressioni.
ja: Async' 修飾子または 'Iterator' 修飾子を含むラムダを式ツリーに変換することはできません。
ko: Async' 또는 'Iterator' 한정자가 있는 람다는 식 트리로 변환할 수 없습니다.
pl: Wyrażeń lambda z modyfikatorami „Async” i „Iterator” nie można konwertować na drzewa wyrażeń.
pt_br: Não é possível converter lambdas com os modificadores 'Async' ou 'Iterator' em árvores de expressões.
ru: Лямбда-выражения с модификаторами "Async" и "Iterator" нельзя преобразовать в деревья выражений.
tr: Async' veya 'Iterator' değiştiricilerine sahip olan lambdalar ifade ağacına dönüştürülemez.
zh_hans: 无法将带 "Async" 或 "Iterator" 修饰符的 lambda 转换为表达式树。
zh_hant: 具有 'Async' 或 'Iterator' 修飾元的 Lambda，無法轉換為運算式樹狀結構。

# ERR_CannotLiftRestrictedTypeResumable1
source: Variable of restricted type '{0}' cannot be declared in an Async or Iterator method.
cs: V asynchronní metodě nebo iterátoru nejde deklarovat proměnnou omezeného typu {0}.
de: Eine Variable des eingeschränkten Typs "{0}" kann in einer Async- oder Iterator-Methode nicht deklariert werden.
es: La variable del tipo restringido '{0}' no se puede declarar en un método Async o Iterator.
fr: Les variables du type restreint '{0}' ne peuvent pas être déclarées dans les méthodes Async ou Iterator.
it: Non è possibile dichiarare la variabile di tipo limitato '{0}' in un metodo Async o Iterator.
ja: 制限がある型 '{0}' の変数を Async メソッドまたは Iterator メソッドで宣言することはできません。
ko: 제한된 '{0}' 형식의 변수는 비동기 또는 반복기 메서드에서 선언할 수 없습니다.
pl: Zmienna ograniczonego typu „{0}” nie może zostać zadeklarowana w metodzie asynchronicznej lub iteratora.
pt_br: Variável de tipo restrito "{0}" não pode ser declarada em um método Assíncrono ou Iterador.
ru: Переменную ограниченного типа "{0}" нельзя объявить в методе, помеченном модификатором Async или Iterator.
tr: Zaman Uyumsuz veya Yineleyici yöntemlerde kısıtlanmış '{0}' türünün değişkeni bildirilemez.
zh_hans: 不能在异步方法或迭代器方法中声明受限类型“{0}”的变量。
zh_hant: 無法在 Async 或 Iterator 方法中宣告受限制之類型 '{0}' 的變數。

# ERR_BadAwaitInTryHandler
source: 'Await' cannot be used inside a 'Catch' statement, a 'Finally' statement, or a 'SyncLock' statement.
cs: 'Operátor Await nejde použít uvnitř příkazu Catch nebo Finally nebo uvnitř příkazu SyncLock.
de: '"Await" kann nicht innerhalb einer Catch-, Finally- oder SyncLock-Anweisung verwendet werden.
es: 'Await' no se puede usar dentro de una instrucción 'Catch', 'Finally' ni 'SyncLock'.
fr: 'Await' ne peut pas être utilisé dans une instruction 'Catch', 'Finally' ou 'SyncLock'.
it: 'Await' non può essere usato all'interno di un'istruzione 'Catch', 'Finally' o 'SyncLock'.
ja: 'Await' は、'Catch' ステートメント、'Finally' ステートメント、または 'SyncLock' ステートメントの内部では使用できません。
ko: 'Await'는 'Catch' 문, 'Finally' 문 또는 'SyncLock' 문 내에서 사용할 수 없습니다.
pl: 'Operator „Await” nie może być używany wewnątrz instrukcji „Catch”, „Finally” ani „SyncLock”.
pt_br: 'Não é possível usar 'Await' em uma instrução 'Catch', em uma instrução 'Finally' ou em uma instrução 'SyncLock'.
ru: 'Оператор Await нельзя использовать в операторах Catch, Finally и SyncLock.
tr: 'Await' bir 'Catch' deyimi, 'Finally' deyimi veya 'SyncLock' deyimi içinde kullanılamaz.
zh_hans: '不能在“Catch”语句、“Finally”语句或“SyncLock”语句内使用“Await”。
zh_hant: 'Await' 不能用在 'Catch' 陳述式、'Finally' 陳述式或 'SyncLock' 陳述式內。

# WRN_AsyncLacksAwaits
source: This async method lacks 'Await' operators and so will run synchronously. Consider using the 'Await' operator to await non-blocking API calls, or 'Await Task.Run(...)' to do CPU-bound work on a background thread.
cs: V této asynchronní metodě chybí operátory Await, a proto se spustí synchronně. Zvažte použití operátoru Await pro čekání na neblokující volání rozhraní API nebo vykonání činnosti vázané na procesor ve vlákně na pozadí pomocí výrazu Await Task.Run(...).
de: In dieser asynchronen Methode fehlen Await-Operatoren. Sie wird daher synchron ausgeführt. Ziehen Sie die Verwendung des Await-Operators zum Warten auf nicht blockierende API-Aufrufe in Betracht, oder verwenden Sie "Await Task.Run(...)", um die CPU-gebundene Verarbeitung in einem Hintergrundthread auszuführen.
es: A este método asincrónico le faltan operadores 'Await' y se ejecutará de forma sincrónica. Puede usar el operador 'Await' para esperar llamadas API que no sean de bloqueo o 'Await Task.Run(...)' para realizar tareas enlazadas a la CPU en un subproceso en segundo plano.
fr: Aucun opérateur 'Await' ne se trouve dans cette méthode Async, par conséquent, elle sera exécutée de façon synchrone. Utilisez un opérateur 'Await' pour attendre les appels non bloquants d'API, ou un opérateur 'Await Task.Run(...)' pour les tâches utilisant le processeur de façon intensive effectuées sur un thread d'arrière-plan.
it: Questo metodo asincrono non contiene operatori 'Await', pertanto verrà eseguito in modo sincrono. Provare a usare l'operatore 'Await' per attendere chiamate ad API non di blocco oppure 'Await Task.Run(...)' per effettuare elaborazioni basate sulla CPU in un thread in background.
ja: この Async メソッドには 'Await' 演算子がないため、同期で実行されます。ブロック不可の API 呼び出しを待つには 'Await' 演算子を、バックグラウンド スレッドに CPU 主体の操作をするには 'Await Task.Run(...)' を使用することを検討してください。
ko: 이 비동기 메서드에는 'Await' 연산자가 없으며 메서드가 동시에 실행됩니다. 'Await' 연산자를 사용하여 비블로킹 API 호출을 대기하거나 'Await Task.Run(...)'을 사용하여 백그라운드 스레드에서 CPU 바인딩된 작업을 수행하세요.
pl: W tej metodzie asynchronicznej brakuje operatorów „Await”, dlatego będzie wykonywana synchronicznie. Rozważ użycie operatora „Await” w celu zdefiniowania oczekiwania na nieblokujące wywołania interfejsów API albo wyrażenia „Await Task.Run(...)” w celu przeniesienia wykonywania zadań intensywnie angażujących procesor do wątku w tle.
pt_br: Este método assíncrono não tem operadores 'Await' e será executado de modo síncrono. Considere o uso do operador 'Await' para aguardar chamadas à API não bloqueadoras ou 'Await Task.Run(...)' para fazer trabalhos associados à CPU em um thread em segundo plano.
ru: В данном асинхронном методе отсутствуют операторы "Await", поэтому метод будет выполняться синхронно. Воспользуйтесь оператором "Await" для ожидания неблокирующих вызовов API или оператором "Await Task.Run(...)" для выполнения связанных с ЦП заданий в фоновом потоке.
tr: Bu zaman uyumsuz yöntemde 'Await' işleçleri olmadığından, zaman uyumlu çalışacak. 'Await' işlecini kullanarak engelleyici olmayan API çağrılarını bekleyebilir veya 'Await Task.Run(...)' kullanarak bir arka plan iş parçacığında CPU bağlantılı iş yapabilirsiniz.
zh_hans: 此异步方法缺少 "Await" 运算符，因此它将同步运行。请考虑使用 "Await" 运算符等待非阻止 API 调用，或使用 "Await Task.Run(...)" 利用后台线程执行占用大量 CPU 的工作。
zh_hant: 這個 async 方法缺少 'Await' 運算子，因此將以同步方式執行。請考慮使用 'Await' 運算子等候未封鎖的應用程式開發介面呼叫，或使用 'Await Task.Run(...)' 在背景執行緒上執行 CPU-bound 工作。
