Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_SharedEventNeedsHandlerInTheSameType
source: Events of shared WithEvents variables cannot be handled by methods in a different type.
es: Los métodos no pueden controlar los eventos de variables WithEvents compartidas en un tipo distinto.
it: Gli eventi di variabili WithEvents condivise non possono essere gestiti da metodi in un tipo diverso.
ja: 共有された WithEvents 変数のイベントを、別の種類のメソッドで処理することはできません。
ko: 공유 WithEvents 변수의 이벤트는 다른 형식의 메서드에서 처리할 수 없습니다.
pl: Zdarzenia udostępnionych zmiennych WithEvents nie mogą zostać obsłużone przez metody w innym typie.
pt_br: Os eventos das variáveis WithEvents compartilhadas não podem ser manipulados por métodos em um tipo diferente.
ru: События общих переменных WithEvents не могут обрабатывать методы другого типа.
tr: Paylaşılan WithEvents değişkenlerinin olayları farklı türdeki metotlar tarafından işlenemez.
zh_hant: 無法使用其他類型的方法，處理共用 WithEvents 變數的事件。

# ERR_StructLayoutAndExtendedLayout
source: Use of 'StructLayoutAttribute' and 'ExtendedLayoutAttribute' on the same type is not allowed.
es: No está permitido usar “StructLayoutAttribute” y “ExtendedLayoutAttribute” en el mismo tipo.

# ERR_SymbolDefinedInAssembly
source: '{0}' is defined in assembly '{1}'.
es: '{0}' se define en el ensamblado '{1}'.
it: '{0}' è definito nell'assembly '{1}'.
ko: '{0}'은(는) '{1}' 어셈블리에 정의되어 있습니다.
pl: „{0}” jest zdefiniowany w zestawie „{1}”.
ru: '{0}' определен в сборке '{1}'.
tr: '{0}', '{1}' derlemesinde tanımlı.
zh_hant: '{0}' 於組件 '{1}' 中定義。

# ERR_TooManyUserStrings_RestartRequired
source: Combined length of user strings used by the program exceeds allowed limit. Adding a string or XML literal requires restarting the application.
es: La longitud combinada de las cadenas de usuario que el programa utiliza supera el límite permitido. Para agregar una cadena o un literal XML, es necesario reiniciar la aplicación.

# ERR_TypeReserved
source: The type name '{0}' is reserved to be used by the compiler.
es: El nombre de tipo "{0}" está reservado para uso del compilador.
zh_hant: 類型名稱 '{0}' 保留供編譯器使用。

# ERR_UnimplementedSharedMember
source: {0} '{1}' cannot implement interface '{3}' because it contains shared abstract or virtual '{2}'.
es: {0} '{1}' no puede implementar la interfaz '{3}' porque contiene abstracto compartido o '{2}' virtual.
it: {0} '{1}' non può implementare l'interfaccia '{3}' perché contiene '{2}' condiviso astratto o virtuale.
ja: {0} '{1}' には、共有された抽象または仮想 '{2}' が含まれているため、インターフェイス '{3}' を実装できません。
ko: {0} '{1}'은(는) 공유 추상 또는 가상 '{2}'이(가) 포함되어 있으므로 '{3}' 인터페이스를 구현할 수 없습니다.
pl: {0}„{1}” nie może zaimplementować interfejsu „{3}”, ponieważ zawiera udostępnioną abstrakcyjną lub wirtualną „{2}”.
pt_br: {0} '{1}' não é possível implementar a interface '{3}' porque ela contém um abstrato compartilhado ou virtual '{2}'.
ru: {0} "{1}" не может реализовать интерфейс "{3}", поскольку он содержит общий абстрактный или виртуальный элемент "{2}".
tr: {0} '{1}', paylaşılan soyut veya sanal '{2}' içerdiğinden '{3}' arabirimini uygulayamıyor.
zh_hant: {0} '{1}' 無法實作介面 '{3}' 因為其包含共用摘要或虛擬效果 '{2}'。

# ERR_UnmanagedCallersOnlyNotSupported
source: 'UnmanagedCallersOnly' attribute is not supported.
es: No se admite el atributo "UnmanagedCallersOnly".
it: L'attributo 'UnmanagedCallersOnly' non è supportato.
ja: 'UnmanagedCallersOnly' 属性はサポートされていません。
ko: 'UnmanagedCallersOnly' 특성은 지원되지 않습니다.
pl: Atrybut „UnmanagedCallersOnly” jest nieobsługiwany.
pt_br: Não há suporte para o atributo 'UnmanagedCallersOnly'.
ru: Атрибут "UnmanagedCallersOnly" не поддерживается.
tr: 'UnmanagedCallersOnly' özniteliği desteklenmez.
zh_hant: 不支援 'UnmanagedCallersOnly' 屬性。

# ERR_UnmanagedConstraintNotSatisfied
source: Type argument '{0}' must be a non-nullable value type, along with all fields at any level of nesting, in order to use it as type parameter '{1}'.
es: El argumento de tipo '{0}' debe ser un tipo de valor que no acepta valores NULL, junto con todos los campos en cualquier nivel de anidamiento, para usarlo como parámetro de tipo '{1}'.
zh_hant: 型別引數 '{0}' 及任何巢狀層級的所有欄位必須是不可為 null 的值類型，如此才能將其作爲型別參數 '{1}' 使用。

# ERR_UnsupportedCompilerFeature
source: '{0}' requires compiler feature '{1}', which is not supported by this version of the Visual Basic compiler.
es: '{0}' requiere la característica del compilador '{1}', que no es compatible con esta versión del compilador de Visual Basic.
it: '{0}' richiede la funzionalità del compilatore '{1}', che non è supportata da questa versione del compilatore Visual Basic.
ja: '{0}' にはコンパイラ機能 '{1}' が必要ですが、このバージョンのVisual Basic コンパイラではサポートされていません。
ko: '{0}'에는 이 버전의 Visual Basic 컴파일러에서 지원하지 않는 컴파일러 기능 '{1}'이(가) 필요합니다.
pl: „{0}” wymaga funkcji kompilatora „{1}”, która nie jest obsługiwana przez tę wersję kompilatora języka Visual Basic.
pt_br: '{0}' requer o recurso de compilador '{1}', o que não é suportado por esta versão do compilador do Visual Basic.
ru: Для "{0}" требуется функция компилятора "{1}", которая не поддерживается в этой версии компилятора Visual Basic.
tr: '{0}', Visual Basic derleyicisinin bu sürümü tarafından desteklenmeyen '{1}' derleyici özelliğini gerektirir.
zh_hant: '{0}' 需要編譯器功能 '{1}'，此版本的 Visual Basic 編譯器不支援此功能。

# ERR_UnsupportedRefReturningCallInWithStatement
source: A call to a method or property that returns by reference may not be used as 'With' statement expression in an async or iterator method, or if referenced implicitly in a lambda.
es: Una llamada a un método o propiedad que devuelve por referencia no se puede usar como expresión de instrucción 'With' en un método asincrónico o iterador, o si se hace referencia implícitamente en una expresión lambda.
it: Una chiamata a un metodo o a una proprietà che restituisce un riferimento non può essere usata come espressione 'With' in un metodo asincrono o iteratore, o se implicitamente di riferimento in un’espressione lambda.
ko: 참조로 반환하는 메서드 또는 속성에 대한 호출은 비동기 메서드나 반복기 메서드에서 또는 람다에서 암시적으로 참조되는 경우 'With' 문 식으로 사용할 수 없습니다.
pl: Wywołanie metody lub właściwości zwracanej przez odwołanie nie może być używane jako wyrażenie instrukcji „With” w metodzie asynchronicznej lub iteratora albo w przypadku niejawnego odwołania w wyrażeniu lambda.
ru: Вызов метода или свойства, возвращаемого по ссылке, нельзя использовать в качестве выражения оператора With в асинхронном методе или методе итератора, а также при неявной ссылке в лямбда-выражении.
tr: Başvuruya göre dönen bir yönteme veya özelliğe yapılan çağrı, bir zaman uyumsuz veya yineleyici yöntemde veya bir lambda'da dolaylı olarak başvuruluyorsa 'With' deyimi olarak kullanılamaz.
zh_hant: 針對會藉傳址傳回的方法或屬性所進行的呼叫，不可在 Async 或 Iterator 方法中作為 'With' 陳述式運算式使用，也不可在 Lambda 中隱含參考。

# FEATURE_CallerArgumentExpression
source: caller argument expression
es: expresión de argumento de autor de llamada
it: espressione passata come argomento del chiamante
ja: 呼び出し元の引数式
ko: 호출자 인수 표현식
pl: wyrażenie argumentu wywołującego
pt_br: expressão do argumento do chamador
ru: выражение аргумента вызывающего
tr: çağıran bağımsız değişken ifadesi
zh_hant: 呼叫者引數運算式

# FEATURE_CommentsAfterLineContinuation
source: comments after line continuation
cs: komentáře po pokračování řádku
de: Kommentare nach Zeilenfortsetzung
es: comentarios después de la continuación de línea
fr: commentaires après la continuation de la ligne
it: commenti dopo la continuazione di riga
ja: 行連結後のコメント
ko: 줄 연속 뒤 주석
pl: komentarze po kontynuacji wiersza
pt_br: comentários após a continuação da linha
ru: комментарии после продолжения строки
tr: satır devamı sonrası açıklamalar
zh_hans: 行继续符之后的注释
zh_hant: 行接續符號後註解

# FEATURE_InitOnlySettersUsage
source: assigning to or passing 'ByRef' properties with init-only setters
es: se asigna a propiedades "ByRef" o se pasa a estas con establecedores init-only
it: assegnazione o passaggio di proprietà 'ByRef' con i setter di sola inizializzazione
ja: 初期化専用セッターを使用して、'ByRef' プロパティに割り当てるか、そのプロパティを渡します
ko: 초기값 전용 setter를 사용하여 'ByRef' 속성에 할당 또는 이 속성을 전달
pl: przypisywanie lub przekazywanie właściwości „ByRef” za pomocą metod ustawiających tylko do inicjowania
pt_br: atribuindo ou passando as propriedades 'ByRef' com setters apenas para inicialização
ru: назначение свойств "ByRef" или их передача с помощью методов задания, предназначенных только для инициализации
tr: init-only ayarlayıcıları ile 'ByRef' özelliklerine atama veya geçirme
zh_hant: 使用僅限初始化的 setter，指派或傳遞 'ByRef' 屬性

# FEATURE_OverloadResolutionPriority
source: overload resolution priority
es: prioridad de resolución de sobrecarga
zh_hant: 多載解析優先順序

# FEATURE_UnconstrainedTypeParameterInConditional
source: unconstrained type parameters in binary conditional expressions
cs: parametry neomezeného typu v binárních podmíněných výrazech
de: Nicht eingeschränkte Typparameter in binären bedingten Ausdrücken
es: parámetros de tipo sin restricciones en expresiones condicionales binarias
fr: paramètres de type sans contrainte dans les expressions conditionnelles binaires
it: parametri di tipo non senza vincoli in espressioni condizionali binarie
ja: バイナリ条件式での非制約型パラメーター
ko: 이진 조건식의 비제한 형식 매개 변수
pl: parametry typu bez ograniczeń w binarnych wyrażeniach warunkowych
pt_br: parâmetros de tipo irrestritos em expressões condicionais binárias
ru: параметры неограниченного типа в двоичных условных выражениях
tr: ikili koşullu ifadelerde kısıtlanmamış tür parametreleri
zh_hans: 二进制条件表达式中的无约束类型参数
zh_hant: 二進位條件運算式中的非限制式型別參數

# FEATURE_UnmanagedConstraint
source: recognizing 'unmanaged' constraint
es: reconocimiento de la restricción 'unmanaged'
zh_hant: 辨識 'unmanaged' 條件約束
