Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_VariancePreventsSynthesizedEvents2
source: Event definitions with parameters are not allowed in an interface such as '{0}' that has 'In' or 'Out' type parameters. Consider declaring the event by using a delegate type which is not defined within '{0}'. For example, 'Event {1} As Action(Of ...)'.
cs: Události definované s parametry nejsou dovolené v rozhraní jako {0}, které má parametry typu In nebo Out. Zvažte deklarování události použitím typu delegáta, který není definovaný v rámci {0}. Například: Event {1} As Action(Of ...).
de: Ereignisdefinitionen mit Parametern sind in einer Schnittstelle wie "{0}", die Parameter vom Typ "In" oder "Out" hat, nicht zulässig. Deklarieren Sie das Ereignis mit einem Delegattyp, der nicht innerhalb von "{0}" definiert ist. Beispiel: "Event {1} As Action(Of ...)".
es: No se permiten definiciones de evento con parámetros en una interfaz como '{0}' que tenga parámetros de tipo 'In' o 'Out'. Puede declarar el evento usando un tipo delegado que no esté definido en '{0}'. Por ejemplo, 'Event {1} As Action(Of ...)'.
fr: Les définitions d'événement avec des paramètres ne sont pas autorisées dans une interface '{0}' qui a des paramètres de type 'In' ou 'Out'. Déclarez l'événement à l'aide d'un type délégué qui n'est pas défini dans '{0}'. Par exemple, 'Event {1} As Action(Of ...)'.
it: Le definizioni di evento con parametri non sono consentite in un'interfaccia quale '{0}' che dispone di parametri di tipo 'In' o 'Out'. Provare a dichiarare l'evento usando un tipo delegato non definito in '{0}', ad esempio 'Event '{1}' As Action(Of ...)'.
ja: In' または 'Out' 型のパラメーターを持つ '{0}' のようなインターフェイスでは、パラメーターを使用したイベント定義は許可されません。'{0}' 内で定義されていないデリゲート型を使用してイベントを宣言することを検討してください (例: 'Event {1} As Action(Of ...)')。
ko: In' 또는 'Out' 형식 매개 변수가 있는 '{0}'과(와) 같은 인터페이스에는 매개 변수가 있는 이벤트 정의를 사용할 수 없습니다. '{0}' 내에 정의되지 않은 대리자 형식을 사용하여 이벤트를 선언하세요(예: 'Event {1} As Action(Of ...)').
pl: Definicje zdarzeń z parametrami nie są dozwolone w interfejsie takim jak „{0}”, który ma parametry typu „In” lub „Out”. Rozważ zadeklarowanie zdarzenia przy użyciu typu delegowanego, który nie jest zdefiniowany w obrębie elementu „{0}”. Na przykład „Event {1} As Action(Of ...)”.
pt_br: Definições de evento com parâmetros não são permitidas em uma interface, como "{0}" que tem parâmetros de tipo "In" ou "Out". Considere declarar o evento usando um tipo delegado que não está definido em "{0}". Por exemplo, "Event {1} As Action(Of ...)".
ru: Определения событий с параметрами не допускается в интерфейсе, например "{0}", который имеет параметры "In" или "Out". Попробуйте объявить событие с помощью делегата, который не определен в "{0}". Например, "Event {1} As Action(Of ...)".
tr: In' veya 'Out' tür parametreleri olan '{0}' gibi arabirimlerde, parametreleri olan olay tanımlarına izin verilmez. Olayı '{0}' içinde tanımlanmayan bir temsilci türü kullanarak bildirebilirsiniz. Örneğin, 'Event {1} As Action(Of ...)'.
zh_hans: 在“{0}”这样的含有“In”或“Out”类型参数的接口中，不允许带参数的事件定义。考虑使用不在“{0}”中定义的委托类型来声明事件。例如，“Event {1} As Action(Of ...)”。
zh_hant: 具有 'In' 或 'Out' 類型參數的介面 (例如 '{0}') 中，不可使用參數進行事件定義。請考慮使用未定義於 '{0}' 內的委派類型，來宣告事件。例如 'Event {1} As Action(Of ...)'。

# ERR_VarianceInByRefDisallowed1
source: Type '{0}' cannot be used in this context because 'In' and 'Out' type parameters cannot be used for ByRef parameter types, and '{0}' is an 'In' type parameter.
cs: Typ {0} nejde v tomto kontextu použít, protože parametry typu In a Out se nedají použít pro typy parametru ByRef a {0} je parametr typu In.
de: Der Typ "{0}" kann nicht in diesem Kontext verwendet werden, weil Parameter vom Typ "In" und "Out" nicht für ByRef-Parametertypen verwendet werden können und "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' en este contexto porque los parámetros de tipo 'In' y 'Out' no se pueden usar para tipos de parámetro ByRef, y '{0}' es un parámetro de tipo 'In'
fr: Le type '{0}' ne peut pas être utilisé dans ce contexte, car les paramètres de type 'In' et 'Out' ne peuvent pas être utilisés pour les types de paramètre ByRef et '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' in questo contesto perché i parametri di tipo 'In' e 'Out' non possono essere usati per i tipi di parametro ByRef e '{0}' è un parametro di tipo 'In'.
ja: In' および 'Out' 型パラメーターを ByRef パラメーター型に使用することはできず、'{0}' は 'In' 型パラメーターであるため、型 '{0}' をこのコンテキストで使用することはできません。
ko: ByRef 매개 변수 형식에는 'In' 및 'Out' 형식 매개 변수를 사용할 수 없고 '{0}'이(가) 'In' 형식 매개 변수이므로, '{0}' 형식을 이 컨텍스트에서 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany w tym kontekście, ponieważ parametry typu „In” i „Out” nie mogą być używane dla typów parametrów ByRef, a „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado neste contexto porque parâmetros de tipo "In" e "Out" não podem ser usados para tipos de parâmetro ByRef e "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в этом контексте, так как параметры "In" и "Out" нельзя использовать для параметра ByRef и "{0}" является параметром типа "In".
tr: ByRef parametre türleri için 'In' ve 'Out' tür parametreleri kullanılamadığından ve '{0}' bir 'In' tür parametresi olduğundan, bu bağlamda '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用于此上下文，因为“In”和“Out”类型参数不能用于 ByRef 参数类型，且“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 無法用於此內容中，因為 'In' 和 'Out' 類型參數無法用於 ByRef 參數類型，且 '{0}' 是 'In' 類型參數。

# ERR_VarianceInNullableDisallowed2
source: Type '{0}' cannot be used in '{1}' because 'In' and 'Out' type parameters cannot be made nullable, and '{0}' is an 'In' type parameter.
cs: Typ {0} nejde použít v {1}, protože parametry typu In a Out se nedají změnit na parametry připouštějící hodnotu Null a {0} je parametr typu In.
de: Der Typ "{0}" kann nicht in "{1}" verwendet werden, weil Parameter vom Typ "In" und "Out" nicht in Typen umgewandelt werden können, die NULL-Werte zulassen, und "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' en '{1}' porque no se puede hacer que los parámetros de tipo 'In' y 'Out' acepten valores NULL y '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' dans '{1}', car les paramètres de type 'In' et 'Out' ne peuvent pas être rendus Nullable et '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' in '{1}' perché i parametri di tipo 'In' e 'Out' non possono essere resi nullable e '{0}' è un parametro di tipo 'In'.
ja: 型 '{0}' は '{1}' 内では使用できません。'{0}' は 'In' 型のパラメーターですが、'In' および 'Out' 型のパラメーターは Null 許容型にはできません。
ko: In' 및 'Out' 형식 매개 변수를 null 허용 형식으로 만들 수 없고 '{0}'이(가) 'In' 형식 매개 변수이므로, '{0}' 형식을 '{1}'에 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany w elemencie „{1}”, ponieważ parametry typu „In” i „Out” nie mogą dopuszczać wartości null, a „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado em "{1}" porque parâmetros de tipo "In" e "Out" não podem ser tornados anuláveis e "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в "{1}" так как параметры "In" и "Out" не допускают значение Null и "{0}" является параметром типа "In".
tr: 'In' ve 'Out' tür parametreleri null yapılabilir duruma getirilemediğinden ve '{0}' bir 'In' tür parametresi olduğundan, '{1}' içinde '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用于“{1}”，因为“In”和“Out”类型参数不能设置为可以为 null，并且“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 無法用於 '{1}' 中，因為 'In' 和 'Out' 類型參數不可變成可為 Null，且 '{0}' 是 'In' 類型參數。

# ERR_VarianceInParamDisallowed1
source: Type '{0}' cannot be used in this context because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde použít v tomto kontextu, protože {0} je parametr typu In.
de: Der Typ "{0}" kann nicht in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' en este contexto porque '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' dans ce contexte, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' in questo contesto perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、このコンテキストでは型 '{0}' を使用できません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty w tym kontekście, ponieważ „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado neste contexto porque "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в этом контексте, так как "{0}" является параметром "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, bu bağlamda '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用于此上下文，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 無法用在此內容中，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceInParamDisallowedForGeneric3
source: Type '{0}' cannot be used for the '{1}' in '{2}' in this context because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde v tomto kontextu použít pro {1} v {2}, protože {0} je parametr typu In.
de: Der Typ "{0}" kann nicht für "{1}" in "{2}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' para el '{1}' de '{2}' en este contexto porque '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' pour le '{1}' dans '{2}' dans ce contexte, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' per '{1}' in '{2}' in questo contesto perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、このコンテキストで '{2}' の '{1}' に対して型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{2}'에 있는 '{1}'에는 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty dla elementu „{1}” w „{2}” w tym kontekście, ponieważ „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado para o "{1}" em "{2}" neste contexto porque "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать для "{1}" в "{2}" в этом контексте, так как "{0}" является параметром "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, bu bağlamda '{2}' içindeki '{1}' için '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{2}”中的“{1}”，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{2}' 中的 '{1}'，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceInParamDisallowedHere2
source: Type '{0}' cannot be used in '{1}' in this context because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde v tomto kontextu použít v {1}, protože {0} je parametrem typu In.
de: Der Typ "{0}" kann nicht in "{1}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' en '{1}' en este contexto porque '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' dans '{1}' dans ce contexte, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' in '{1}' in questo contesto perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、このコンテキストの '{1}' で型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{1}'에 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty w elemencie „{1}” w tym kontekście, ponieważ „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado em "{1}" neste contexto porque "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в "{1}" в этом контексте, так как "{0}" является параметром "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, bu bağlamda '{1}' içinde '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{1}”，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{1}'，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceInParamDisallowedHereForGeneric4
source: Type '{0}' cannot be used for the '{2}' of '{3}' in '{1}' in this context because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde v tomto kontextu použít pro {2} – {3} v {1}, protože {0} je parametrem typu In.
de: Der Typ "{0}" kann nicht für "{2}" von "{3}" in "{1}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' para el '{2}' de '{3}' en '{1}' en este contexto porque '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' pour le '{2}' de '{3}' dans '{1}' dans ce contexte, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' per '{2}' di '{3}' in '{1}' in questo contesto perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、このコンテキストで '{1}' 内の '{3}' の '{2}' に対して型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{1}'에 있는 '{3}'의 '{2}'에는 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty dla elementu „{2}” należącego do „{3}” w elemencie „{1}” w tym kontekście, ponieważ „{0}” jest parametrem typu „In”.
pt_br: O tipo '{0}' não pode ser usado para o '{2}' de '{3}' em '{1}' neste contexto porque "{0}" é um parâmetro de tipo 'In'.
ru: Тип "{0}" нельзя использовать для "{2}" "{3}" в "{1}" в этом контексте, так как "{0}" является параметром "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, bu bağlamda '{1}' içinde '{2}' / '{3}' için '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{1}”中“{3}”的“{2}”，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{1}' 中 '{3}' 的 '{2}'，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceInPropertyDisallowed1
source: Type '{0}' cannot be used as a property type in this context because '{0}' is an 'In' type parameter and the property is not marked WriteOnly.
cs: Typ {0} se nemůže v tomto kontextu použít jako typ vlastnosti, protože {0} je parametr typu In a vlastnost není označená klíčovým slovem WriteOnly.
de: Der Typ "{0}" kann nicht als Eigenschaftentyp in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist und die Eigenschaft nicht als "WriteOnly" markiert ist.
es: No se puede usar el tipo '{0}' como un tipo de propiedad en este contexto porque '{0}' es un parámetro de tipo 'In' y la propiedad no está marcada como WriteOnly.
fr: Impossible d'utiliser le type '{0}' en tant que type de propriété dans ce contexte, car '{0}' est un paramètre de type 'In' et la propriété n'est pas marquée WriteOnly.
it: Non è possibile usare il tipo '{0}' come tipo di proprietà in questo contesto perché '{0}' è un parametro di tipo ''In' e la proprietà non è contrassegnata come WriteOnly.
ja: '{0}' は 'In' 型パラメーターであり、プロパティは WriteOnly として指定されていないため、このコンテキストでは型 '{0}' をプロパティ型として使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이며 속성이 WriteOnly로 표시되어 있지 않으므로 '{0}' 형식을 이 컨텍스트에서 속성 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako typ właściwości w tym kontekście, ponieważ „{0}” jest parametrem typu „In”, a właściwość nie jest oznaczona jako WriteOnly.
pt_br: Tipo "{0}" não pode ser usado como um tipo de propriedade neste contexto porque "{0}" é um parâmetro de tipo "In" e a propriedade não é marcado como WriteOnly.
ru: Тип "{0}" не может быть использован в качестве типа свойства в данном контексте, так как "{0}" является параметром типа "In" и свойство не помечено как WriteOnly.
tr: '{0}' bir 'In' tür parametresi olduğundan ve özellik WriteOnly olarak işaretlenmediğinden, bu bağlamda özellik türü olarak '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用作属性类型，因为“{0}”是“In”类型参数，且该属性未标记为 WriteOnly。
zh_hant: 類型 '{0}' 在此內容中不能用做為屬性類型，因為 '{0}' 是 'In' 類型參數且屬性未標記為 WriteOnly。

# ERR_VarianceInReadOnlyPropertyDisallowed1
source: Type '{0}' cannot be used as a ReadOnly property type because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde použít jako typ vlastnosti ReadOnly, protože {0} je parametr typu In.
de: Der Typ "{0}" kann nicht als ReadOnly-Eigenschaftentyp verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' como un tipo de propiedad ReadOnly porque '{0}' es un parámetro de tipo.
fr: Impossible d'utiliser le type '{0}' en tant que type de propriété ReadOnly, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' come tipo di proprietà ReadOnly perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、型 '{0}' を ReadOnly プロパティ型として使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 ReadOnly 속성 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako typ właściwości ReadOnly, ponieważ „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado como tipo de propriedade ReadOnly porque "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в качестве свойства ReadOnly, так как "{0}" является параметром типа "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, ReadOnly özellik türü olarak '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用作 ReadOnly 属性类型，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 不能用做為 ReadOnly 屬性類型，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceInReturnDisallowed1
source: Type '{0}' cannot be used as a return type because '{0}' is an 'In' type parameter.
cs: Typ {0} nejde použít jako návratový typ, protože {0} je parametr typu In.
de: Der Typ "{0}" kann nicht als Rückgabetyp verwendet werden, weil "{0}" ein Parameter vom Typ "In" ist.
es: No se puede usar el tipo '{0}' como tipo de valor devuelto porque '{0}' es un parámetro de tipo 'In'.
fr: Impossible d'utiliser le type '{0}' en tant que type de retour, car '{0}' est un paramètre de type 'In'.
it: Non è possibile usare il tipo '{0}' come tipo restituito perché '{0}' è un parametro di tipo 'In'.
ja: '{0}' は 'In' 型パラメーターであるため、型 '{0}' を戻り値の型として使用することはできません。
ko: '{0}'이(가) 'In' 형식 매개 변수이므로 '{0}' 형식을 반환 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako typ zwracany, ponieważ „{0}” jest parametrem typu „In”.
pt_br: Tipo "{0}" não pode ser usado como um tipo de retorno porque "{0}" é um parâmetro de tipo "In".
ru: Тип "{0}" нельзя использовать в качестве возвращаемого типа, так как "{0}" является параметром типа "In".
tr: '{0}' bir 'In' tür parametresi olduğundan, dönüş türü olarak '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用作返回类型，因为“{0}”是“In”类型参数。
zh_hant: 類型 '{0}' 不能用做為傳回類型，因為 '{0}' 是 'In' 類型參數。

# ERR_VarianceOutByRefDisallowed1
source: Type '{0}' cannot be used in this context because 'In' and 'Out' type parameters cannot be used for ByRef parameter types, and '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde v tomto kontextu použít, protože parametry typu In a Out nejde použít pro typy parametrů ByRef a {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht in diesem Kontext verwendet werden, weil Parameter vom Typ "In" und "Out" nicht für ByRef-Parametertypen verwendet werden können und "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' en este contexto porque los parámetros de tipo 'In' y 'Out' no se pueden usar para tipos de parámetro ByRef, y '{0}' es un parámetro de tipo 'Out'.
fr: Le type '{0}' ne peut pas être utilisé dans ce contexte, car les paramètres de type 'In' et 'Out' ne peuvent pas être utilisés pour les types de paramètre ByRef et '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' in questo contesto perché i parametri di tipo 'In' e 'Out' non possono essere usati per i tipi di parametro ByRef e '{0}' è un parametro di tipo 'Out'.
ja: In' および 'Out' 型パラメーターを ByRef パラメーター型に使用することはできず、'{0}' は 'Out' 型パラメーターであるため、型 '{0}' をこのコンテキストで使用することはできません。
ko: ByRef 매개 변수 형식에는 'In' 및 'Out' 형식 매개 변수를 사용할 수 없고 '{0}'이(가) 'Out' 형식 매개 변수이므로, '{0}' 형식을 이 컨텍스트에서 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany w tym kontekście, ponieważ parametry typu „In” i „Out” nie mogą być używane dla typów parametrów ByRef, a „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado neste contexto porque parâmetros de tipo "In" e "Out" não podem ser usados para tipos de parâmetro ByRef e "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться в этом контексте, потому что тип параметров "In" и "Out" нельзя использовать для типов параметра ByRef и "{0}" является параметром типа "Out".
tr: ByRef parametre türleri için 'In' ve 'Out' tür parametreleri kullanılamadığından ve '{0}' bir 'Out' tür parametresi olduğundan, '{0}' türü bu bağlamda kullanılamaz.
zh_hans: 类型“{0}”不能用于此上下文，因为“In”和“Out”类型参数不能用于 ByRef 参数类型，且“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 無法用於此內容中，因為 'In' 和 'Out' 類型參數無法用於 ByRef 參數類型，且 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutByValDisallowed1
source: Type '{0}' cannot be used as a ByVal parameter type because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde použít jako parametr typu ByVal, protože {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht als ByVal-Parametertyp verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' como un tipo de parámetro ByVal porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' en tant que type de paramètre ByVal, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' come tipo di parametro ByVal perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、型 '{0}' を ByVal パラメーター型として使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 ByVal 매개 변수 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako parametr typu ByVal, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado como tipo de parâmetro ByVal porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" нельзя использовать в качестве типа параметра ByVal, так как "{0}" является параметром типа "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, ByVal parametre türü olarak '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用作 ByVal 参数类型，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 不能用做為 ByVal 參數類型，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutConstraintDisallowed1
source: Type '{0}' cannot be used as a generic type constraint because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde použít jako konstantu obecného typu, protože {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht als generische Typeneinschränkung verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' como una restricción de tipo genérico porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' en tant que contrainte de type générique, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' come vincolo di tipo generico perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、型 '{0}' をジェネリック型の制約として使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 제네릭 형식 제약 조건으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako ograniczenie typu ogólnego, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado como uma restrição de tipo genérico porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может быть использован в качестве типа ограничения, так как "{0}" является параметром типа "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, genel tür kısıtlaması olarak '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用作泛型类型约束，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 不能用做為泛型類型條件約束，因為 '{0}' 是 'Out' 類型參數。
