Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ValueAndClassTypeConstrCombined
source: 'Structure' constraint and a specific class type constraint cannot be combined.
cs: 'Omezení Structure a specifické omezení typu třídy nejde kombinovat.
de: 'Die Structure-Einschränkung und eine Einschränkung für einen spezifischen Klassentyp können nicht kombiniert werden.
es: 'La restricción 'Structure' no se puede combinar con una restricción de tipo de clase específica.
fr: 'Une contrainte 'Structure' et une contrainte de type classe spécifique ne peuvent pas être combinées.
it: 'Non è possibile combinare il vincolo 'Structure' e uno specifico vincolo di tipo classe.
ja: 'Structure' 制約と特定のクラス型は、組み合わせて使用できません。
ko: 'Structure' 제약 조건과 특정 클래스 형식 제약 조건은 함께 사용할 수 없습니다.
pl: 'Nie można łączyć ograniczenia Structure i określonego ograniczenia typu klasy.
pt_br: 'Restrição de 'Structure' e uma restrição de tipo de classe específica não podem ser combinadas.
ru: 'Ограничение "Structure" и ограничение c указанием конкретного типа класса нельзя использовать вместе.
tr: 'Structure' kısıtlaması ile belirtilmiş bir sınıf türü kısıtlaması birleştirilemez.
zh_hans: '"Structure" 约束不能与特定的类类型约束组合。
zh_hant: '無法合併 'Structure' 條件約束和特定類別的類型條件約束。

# ERR_ConstraintClashIndirectIndirect4
source: Indirect constraint '{0}' obtained from the type parameter constraint '{1}' conflicts with the indirect constraint '{2}' obtained from the type parameter constraint '{3}'.
cs: Nepřímé omezení {0} získané z omezení parametru typu {1} je v konfliktu s nepřímým omezením {2} získaným z omezení parametru typu {3}.
de: Die indirekte Einschränkung "{0}" der Typparametereinschränkung "{1}" verursacht einen Konflikt mit der indirekten Einschränkung "{2}" der Typparametereinschränkung "{3}".
es: La restricción '{0}' indirecta obtenida de la restricción '{1}' del parámetro de tipo entra en conflicto con la restricción '{2}' indirecta obtenida de la restricción '{3}' del parámetro de tipo.
fr: La contrainte indirecte '{0}' obtenue de la contrainte de paramètre de type '{1}' est en conflit avec la contrainte indirecte '{2}' obtenue de la contrainte de paramètre de type '{3}'.
it: Il vincolo indiretto '{0}' ottenuto dal vincolo del parametro di tipo '{1}' è in conflitto con il vincolo indiretto '{2}' ottenuto dal vincolo del parametro di tipo '{3}'.
ja: 型パラメーター制約 '{1}' から取得された間接的な制約 '{0}' は、型パラメーター制約 '{3}' から取得された間接的な制約 '{2}' と競合しています。
ko: 형식 매개 변수 제약 조건 '{1}'에서 가져온 간접 제약 조건 '{0}'이(가) 형식 매개 변수 제약 조건 '{3}'에서 가져온 간접 제약 조건 '{2}'과(와) 충돌합니다.
pl: Ograniczenie pośrednie „{0}” uzyskane z ograniczenia parametru typu „{1}” powoduje konflikt z ograniczeniem pośrednim „{2}” uzyskanym z ograniczenia parametru typu „{3}”.
pt_br: A restrição indireta "{0}" obtida da restrição de parâmetro de tipo "{1}" está em conflito com a restrição "{2}" obtida da restrição de parâmetro de tipo "{3}".
ru: Косвенное ограничение "{0}", полученное из ограничения параметра типа "{1}", конфликтует с косвенным ограничением "{2}", полученным из ограничения параметра типа "{3}".
tr: '{1}' tür parametresi kısıtlamasından elde edilen dolaylı '{0}' kısıtlaması, '{3}' tür parametresi kısıtlamasından elde edilen dolaylı '{2}' kısıtlamasıyla çakışıyor.
zh_hans: 从类型参数约束“{1}”获得的间接约束“{0}”与从类型参数约束“{3}”获得的间接约束“{2}”冲突。
zh_hant: 從類型參數條件約束 '{1}' 取得的間接條件約束 '{0}'，與從類型參數條件約束 '{3}' 取得的間接條件約束 '{2}'，互相衝突。

# ERR_ConstraintClashDirectIndirect3
source: Constraint '{0}' conflicts with the indirect constraint '{1}' obtained from the type parameter constraint '{2}'.
cs: Omezení {0} je v konfliktu s nepřímým omezením {1} získaným z omezení parametru typu {2}.
de: Die Einschränkung "{0}" verursacht einen Konflikt mit der indirekten Einschränkung "{1}" der Typparametereinschränkung "{2}".
es: La restricción '{0}' entra en conflicto con la restricción indirecta '{1}' obtenida de la restricción de parámetro de tipo '{2}'.
fr: La contrainte '{0}' est en conflit avec la contrainte indirecte '{1}' obtenue de la contrainte de paramètre de type '{2}'.
it: Il vincolo '{0}' è in conflitto con il vincolo indiretto '{1}' ottenuto dal vincolo del parametro di tipo '{2}'.
ja: 制約 '{0}' は、型パラメーター制約 '{2}' から取得された間接的な制約 '{1}' と競合しています。
ko: 형식 매개 변수 제약 조건 '{2}'에서 가져온 간접 제약 조건 '{1}'이(가) '{0}' 제약 조건과 충돌합니다.
pl: Ograniczenie „{0}” powoduje konflikt z ograniczeniem pośrednim „{1}” uzyskanym z ograniczenia parametru typu „{2}”.
pt_br: Restrição "{0}" está em conflito com a restrição indireta "{1}" obtida da restrição de parâmetro de tipo "{2}".
ru: Ограничение "{0}" конфликтует с косвенным ограничением "{1}", полученным из ограничения параметра типа "{2}".
tr: '{0}' kısıtlaması, '{2}' tür parametresi kısıtlamasından elde edilen dolaylı '{1}' kısıtlamasıyla çakışıyor.
zh_hans: 约束“{0}”与从类型参数约束“{2}”获得的间接约束“{1}”冲突。
zh_hant: 條件約束 '{0}' 與從類型參數條件約束 '{2}' 取得的間接條件約束 '{1}' 互相衝突。

# ERR_ConstraintClashIndirectDirect3
source: Indirect constraint '{0}' obtained from the type parameter constraint '{1}' conflicts with the constraint '{2}'.
cs: Nepřímé omezení {0} získané z omezení parametru typu {1} je v konfliktu s omezením {2}.
de: Die indirekte Einschränkung "{0}" der Typparametereinschränkung "{1}" verursacht einen Konflikt mit der Einschränkung "{2}".
es: La restricción '{0}' indirecta obtenida de la restricción '{1}' del parámetro de tipo entra en conflicto con la restricción '{2}'.
fr: La contrainte indirecte '{0}' obtenue à partir de la contrainte de paramètre de type '{1}' est en conflit avec la contrainte '{2}'.
it: Il vincolo indiretto '{0}' ottenuto dal vincolo del parametro di tipo '{1}' è in conflitto con il vincolo '{2}'.
ja: 型パラメーター制約 '{1}' から取得された間接的な制約 '{0}' は、制約 '{2}' と競合しています。
ko: 형식 매개 변수 제약 조건 '{1}'에서 가져온 간접 제약 조건 '{0}'이(가) '{2}' 제약 조건과 충돌합니다.
pl: Ograniczenie pośrednie „{0}” uzyskane z ograniczenia parametru typu „{1}” powoduje konflikt z ograniczeniem „{2}”.
pt_br: A restrição indireta "{0}" obtida da restrição de parâmetro de tipo "{1}" está em conflito com a restrição "{2}".
ru: Косвенное ограничение "{0}", полученное из ограничения параметра типа "{1}", конфликтует с ограничением "{2}".
tr: '{1}' tür parametresi kısıtlamasından elde edilen dolaylı '{0}' kısıtlaması, '{2}' kısıtlamasıyla çakışıyor.
zh_hans: 从类型参数约束“{1}”获得的间接约束“{0}”与约束“{2}”冲突。
zh_hant: 從類型參數條件約束 '{1}' 取得的間接條件約束 '{0}'，與條件約束 '{2}' 互相衝突。

# ERR_ConstraintCycleLink2
source: '{0}' is constrained to '{1}'.
cs: {0} je omezené na {1}.
de: "{0}" ist beschränkt auf "{1}".
es: '{0}' se restringe a '{1}'.
fr: '{0}' est limité à '{1}'.
it: '{0}' è vincolato a '{1}'.
ja: '{0}' は '{1}' に制約されています。
ko: '{0}'은(는) '{1}'의 제약을 받습니다.
pl: Element „{0}” jest ograniczony do elementu „{1}”.
pt_br: "{0}" é restrito para "{1}".
ru: "{0}' ограничен значением "{1}".
tr: '{0}', '{1}' ile kısıtlanmıştır.
zh_hans: “{0}”被约束为“{1}”。
zh_hant: '{0}' 已限制為 '{1}'。

# ERR_ConstraintCycle2
source: Type parameter '{0}' cannot be constrained to itself: {1}
cs: Parametr typu {0} nemůže být omezený sám na sebe: {1}.
de: Der Typparameter "{0}" kann nicht auf sich selbst beschränkt werden: {1}
es: El parámetro de tipo '{0}' no se puede restringir a sí mismo: {1}
fr: Le paramètre de type '{0}' ne peut pas être limité par lui-même : {1}
it: Il parametro di tipo '{0}' non può essere vincolato a se stesso: {1}
ja: 型パラメーター '{0}' は、それ自体に制約されることはできません: {1}
ko: '{0}' 형식 매개 변수는 자신의 제약을 받을 수 없습니다({1}).
pl: Parametru typu „{0}” nie można ograniczyć do niego samego: {1}.
pt_br: Parâmetro de tipo "{0}" não pode ser restrito a si mesmo: {1}
ru: Параметр типа "{0}" не может быть ограничен самим собой: {1}
tr: '{0}' tür parametresi kendi kendini kısıtlayamaz: {1}
zh_hans: 类型参数“{0}”不能约束为自身: {1}
zh_hant: 類型參數 '{0}' 不可限制為其本身: {1}

# ERR_TypeParamWithStructConstAsConst
source: Type parameter with a 'Structure' constraint cannot be used as a constraint.
cs: Parametr typu s omezením Structure nejde použít jako omezení.
de: Ein Typparameter mit einer Structure-Einschränkung kann nicht als Einschränkung verwendet werden.
es: El parámetro de tipo con una restricción 'Structure' no se puede usar como restricción.
fr: Un paramètre de type avec une contrainte 'Structure' ne peut pas être utilisé en tant que contrainte.
it: Non è possibile usare come vincolo il parametro di tipo con un vincolo 'Structure'.
ja: Structure' 制約が指定された型パラメーターを制約として使用することはできません。
ko: Structure' 제약 조건이 있는 형식 매개 변수는 제약 조건으로 사용할 수 없습니다.
pl: Parametru typu z ograniczeniem „Structure” nie można używać jako ograniczenia.
pt_br: Não é possível usar o parâmetro de tipo com uma restrição 'Structure' como uma restrição.
ru: Параметр-тип с ограничением "Structure" нельзя использовать в качестве ограничения.
tr: Structure' kısıtlamasına sahip tür parametresi kısıtlama olarak kullanılamaz.
zh_hans: 具有 "Structure" 约束的类型参数不能用作约束。
zh_hant: 具有 'Structure' 條件約束的類型參數不可以當做條件約束使用。

# ERR_NullableDisallowedForStructConstr1
source: 'System.Nullable' does not satisfy the 'Structure' constraint for type parameter '{0}'. Only non-nullable 'Structure' types are allowed.
cs: 'System.Nullable nevyhovuje podmínkám omezení Structure pro parametr typu {0}. Povolené jsou jenom typy Structure, které nemůžou mít hodnotu null.
de: System.Nullable erfüllt die Structure-Einschränkung für den {0}-Typparameter nicht. Es sind nur Non-Nullable-Structure-Typen zulässig.
es: 'System.Nullable' no satisface la restricción 'Structure' del parámetro de tipo '{0}'. Solo se permiten tipos 'Structure' que no acepten valores NULL.
fr: 'System.Nullable' ne satisfait pas la contrainte 'Structure' pour le paramètre de type '{0}'. Seuls les types 'Structure' non Nullable sont autorisés.
it: 'System.Nullable' non soddisfa il vincolo 'Structure' per il parametro di tipo '{0}'. Sono consentiti solo i tipi 'Structure' che non ammettono i valori Null.
ja: 'System.Nullable' は、型パラメーター '{0}' の 'Structure' 制約を満たしていません。Null 非許容の 'Structure' 型のみが許可されています。
ko: 'System.Nullable'은 형식 매개 변수 '{0}'에 대한 'Structure' 제약 조건을 만족하지 않습니다. null을 허용하지 않는 'Structure' 형식만 사용할 수 있습니다.
pl: Element „System.Nullable” nie spełnia warunków ograniczenia „Structure” dla parametru typu „{0}”. Dozwolone są tylko nienullowalne typy „Structure”.
pt_br: "System. Nullable" não satisfaz a restrição "Structure" para parâmetro de tipo "{0}". Somente tipos "Structure" não anuláveis são permitidos.
ru: '"System.Nullable" не удовлетворяет ограничению "Structure" для параметра типа "{0}". Разрешены только типы "Structure", не допускающие значения Null.
tr: 'System.Nullable', '{0}' tür parametresi için 'Structure' kısıtlamasını karşılamıyor. Yalnızca null yapılamayan 'Structure' türlerine izin veriliyor.
zh_hans: '“System.Nullable”不满足类型参数“{0}”的“Structure”约束。仅允许不可为 null 的“Structure”类型。
zh_hant: 'System.Nullable' 不符合類型參數 '{0}' 的 'Structure' 條件約束。只可使用不可為 null 的 'Structure' 類型。

# ERR_ConflictingDirectConstraints3
source: Constraint '{0}' conflicts with the constraint '{1}' already specified for type parameter '{2}'.
cs: Omezení {0} je v konfliktu s omezením {1}, které je už zadané pro parametr typu {2}.
de: Die Einschränkung "{0}" verursacht einen Konflikt mit der bereits für den {2}-Typparameter angegebenen Einschränkung "{1}".
es: La restricción '{0}' entra en conflicto con la restricción '{1}' especificada para el parámetro de tipo '{2}'.
fr: La contrainte '{0}' est en conflit avec la contrainte '{1}' déjà spécifiée pour le paramètre de type '{2}'.
it: Il vincolo '{0}' è in conflitto con il vincolo '{1}' già specificato per il parametro di tipo '{2}'.
ja: 制約 '{0}' が、型パラメーター '{2}' に対して既に指定されている制約 '{1}' と競合しています。
ko: 제약 조건 '{0}'이(가) 형식 매개 변수 '{2}'에 이미 지정된 제약 조건 '{1}'과(와) 충돌합니다.
pl: Ograniczenie „{0}” powoduje konflikt z ograniczeniem „{1}” już określonym dla parametru typu „{2}”.
pt_br: Restrição "{0}" está em conflito com a restrição "{1}" já especificada para o parâmetro de tipo "{2}".
ru: Ограничение "{0}" конфликтует с ограничением "{1}", уже указанным для параметра типа "{2}".
tr: '{0}' kısıtlaması, '{2}' tür parametresi için zaten belirtilmiş olan '{1}' kısıtlamasıyla çakışıyor.
zh_hans: 约束“{0}”与已为类型参数“{2}”指定的约束“{1}”冲突。
zh_hant: 條件約束 '{0}' 與已經指定給類型參數 '{2}' 的條件約束 '{1}' 互相衝突。

# ERR_InterfaceUnifiesWithInterface2
source: Cannot inherit interface '{0}' because it could be identical to interface '{1}' for some type arguments.
cs: Nejde zdědit rozhraní {0}, protože by mohlo být u některých argumentů identické s rozhraním {1}.
de: Die Schnittstelle "{0}" kann nicht geerbt werden, da sie bei manchen Typargumenten mit der Schnittstelle "{1}" identisch sein könnte.
es: No se puede heredar la interfaz '{0}' porque podría ser idéntica a la interfaz '{1}' para algunos argumentos de tipo.
fr: Impossible d'hériter de l'interface '{0}', car elle peut être identique à l'interface '{1}' pour certains arguments de type.
it: Non è possibile ereditare l'interfaccia '{0}' perché potrebbe essere identica all'interfaccia '{1}' per alcuni argomenti di tipo.
ja: いくつかの型引数のインターフェイス '{1}' と同一である可能性があるため、インターフェイス '{0}' を継承できません。
ko: '{0}' 인터페이스가 일부 형식 인수에 대해 '{1}' 인터페이스와 동일할 수 있으므로 인터페이스를 상속할 수 없습니다.
pl: Nie można dziedziczyć interfejsu „{0}”, ponieważ może być on taki sam jak interfejs „{1}” dla niektórych argumentów typu.
pt_br: Não é possível herdar a interface "{0}" porque ela poderia ser idêntica à interface "{1}" para alguns argumentos de tipo.
ru: Невозможно наследовать интерфейс "{0}", поскольку он может совпадать с интерфейсом "{1}" для некоторых аргументов типа.
tr: Bazı tür bağımsız değişkenleri için '{1}' arabirimiyle özdeş olabileceğinden, '{0}' arabirimi devralamıyor.
zh_hans: 无法继承接口“{0}”，因为对于某些类型参数，该接口与接口“{1}”相同。
zh_hant: 無法繼承介面 '{0}'，因為它可能與某些類型引數的介面 '{1}' 相同。

# ERR_BaseUnifiesWithInterfaces3
source: Cannot inherit interface '{0}' because the interface '{1}' from which it inherits could be identical to interface '{2}' for some type arguments.
cs: Nejde zdědit rozhraní {0}, protože rozhraní {1}, ze kterého se dědí, by mohlo být u některých argumentů identické s rozhraním {2}.
de: Die Schnittstelle "{0}" kann nicht geerbt werden, da die Schnittstelle "{1}", von der geerbt wird, bei manchen Typargumenten möglicherweise mit der Schnittstelle "{2}" identisch ist.
es: No se puede heredar la interfaz '{0}' porque la interfaz '{1}' de la que hereda podría ser idéntica a la interfaz '{2}' para algunos argumentos de tipo.
fr: Impossible d'hériter de l'interface '{0}', car l'interface '{1}' dont elle hérite peut être identique à l'interface '{2}' pour certains arguments de type.
it: Non è possibile ereditare l'interfaccia '{0}' perché l'interfaccia '{1}' da cui eredita potrebbe essere identica all'interfaccia '{2}' per alcuni argomenti di tipo.
ja: 継承元のインターフェイス '{1}' がインターフェイス '{2}' と、いくつかの型引数において同一である可能性があるため、インターフェイス '{0}' を継承できません。
ko: '{0}' 인터페이스를 상속할 수 없습니다. 이 인터페이스가 상속된 '{1}' 인터페이스가 일부 형식 인수에 대해 '{2}' 인터페이스와 동일할 수 있습니다.
pl: Nie można dziedziczyć interfejsu „{0}”, ponieważ interfejs „{1}”, po którym ten interfejs dziedziczy, może być taki sam jak interfejs „{2}” dla niektórych argumentów typu.
pt_br: Não é possível herdar a interface "{0}" porque a interface "{1}" da qual ela herda poderia ser idêntica à interface "{2}" para alguns argumentos de tipo.
ru: Невозможно наследовать интерфейс "{0}", поскольку интерфейс "{1}", от которого он наследуется, может совпадать с интерфейсом "{2}" для некоторых аргументов типа.
tr: Devraldığı '{1}' arabirimi bazı tür bağımsız değişkenleri için '{2}' arabirimiyle aynı olabileceğinden, '{0}' arabirimini devralamıyor.
zh_hans: 无法继承接口“{0}”，因为对于某些类型参数，它所继承的接口“{1}”可能与接口“{2}”相同。
zh_hant: 無法繼承介面 '{0}'，因為它所繼承的介面 '{1}' 可能與某些類型引數之介面 '{2}' 相同。

# ERR_InterfaceBaseUnifiesWithBase4
source: Cannot inherit interface '{0}' because the interface '{1}' from which it inherits could be identical to interface '{2}' from which the interface '{3}' inherits for some type arguments.
cs: Nejde zdědit rozhraní {0}, protože rozhraní {1}, ze kterého se dědí, by mohlo být u některých argumentů typů identické s rozhraním {2}, ze kterého dědí rozhraní {3}.
de: Die Schnittstelle "{0}" kann nicht geerbt werden, da die Schnittstelle "{1}", von der geerbt wird, möglicherweise mit der Schnittstelle "{2}" identisch ist, von der die Schnittstelle "{3}" bei manchen Typargumenten erbt.
es: No se puede heredar la interfaz '{0}' porque la interfaz '{1}' de la que hereda podría ser idéntica a la interfaz '{2}' de la que la interfaz '{3}' hereda para algunos argumentos de tipo.
fr: Impossible d'hériter de l'interface '{0}', car l'interface '{1}' dont elle hérite peut être identique à l'interface '{2}' dont l'interface '{3}' hérite pour certains arguments de type.
it: Non è possibile ereditare l'interfaccia '{0}' perché l'interfaccia '{1}' da cui eredita potrebbe essere identica all'interfaccia '{2}' da cui eredita l'interfaccia '{3}' per alcuni argomenti di tipo.
ja: 継承元のインターフェイス '{1}' が、インターフェイス '{3}' の継承元であるインターフェイス '{2}' と、いくつかの型引数において同一である可能性があるため、インターフェイス '{0}' を継承できません。
ko: '{0}' 인터페이스를 상속할 수 없습니다. 이 인터페이스가 상속된 '{1}' 인터페이스가 일부 형식 인수에 대해 '{3}' 인터페이스가 상속된 '{2}' 인터페이스와 동일할 수 있습니다.
pl: Nie można dziedziczyć interfejsu „{0}”, ponieważ interfejs „{1}”, po którym ten interfejs dziedziczy, może być taki sam jak interfejs „{2}”, po którym dziedziczy interfejs „{3}” dla niektórych argumentów typu.
pt_br: Não é possível herdar a interface "{0}" porque a interface "{1}" da qual ela herda poderia ser idêntica à interface "{2}" da qual a interface "{3}" herda para alguns argumentos de tipo.
ru: Невозможно наследовать интерфейс "{0}", поскольку интерфейс "{1}", от которого он наследуется, может совпадать с интерфейсом "{2}", от которого наследуется интерфейс "{3}" для некоторых аргументов типа.
tr: Devralındığı '{1}' arabirimi bazı tür bağımsız değişkenleri için '{3}' arabiriminin devralındığı '{2}' arabirimiyle özdeş olabileceğinden, '{0}' arabirimi devralınamıyor.
zh_hans: 无法继承接口“{0}”，因为对于某些类型参数，继承的接口“{1}”可能与接口“{3}”继承的接口“{2}”相同。
zh_hant: 無法繼承介面 '{0}'，因為它所繼承的介面 '{1}' 可能與某些類型引數的介面 '{3}' 所繼承之介面 '{2}' 相同。

# ERR_InterfaceUnifiesWithBase3
source: Cannot inherit interface '{0}' because it could be identical to interface '{1}' from which the interface '{2}' inherits for some type arguments.
cs: Nejde zdědit rozhraní {0}, protože by mohlo být u některých argumentů typu identické s rozhraním {1}, ze kterého dědí rozhraní {2}.
de: Die Schnittstelle "{0}" kann nicht geerbt werden, da sie möglicherweise mit der Schnittstelle "{1}" identisch ist, von der die Schnittstelle "{2}" bei manchen Typargumenten erbt.
es: No se puede heredar la interfaz '{0}' porque podría ser idéntica a la interfaz '{1}' de la que la interfaz '{2}' hereda para algunos argumentos de tipo.
fr: Impossible d'hériter de l'interface '{0}', car elle peut être identique à l'interface '{1}' dont l'interface '{2}' hérite pour certains arguments de type.
it: Non è possibile ereditare l'interfaccia '{0}' perché potrebbe essere identica all'interfaccia '{1}' da cui eredita l'interfaccia '{2}' per alcuni argomenti di tipo.
ja: 継承元のインターフェイス '{1}' がインターフェイス '{2}' と、いくつかの型引数において同一である可能性があるため、インターフェイス '{0}' を継承できません。
ko: '{0}' 인터페이스를 상속할 수 없습니다. 이 인터페이스가 일부 형식 인수에 대해 '{2}' 인터페이스가 상속된 '{1}' 인터페이스와 동일할 수 있습니다.
pl: Nie można dziedziczyć interfejsu „{0}”, ponieważ może on być taki sam jak interfejs „{1}”, po którym dziedziczy interfejs „{2}” dla niektórych argumentów typu.
pt_br: Não é possível herdar a interface "{0}" porque ela poderia ser idêntica à interface "{1}" da qual a interface "{2}" herda para alguns argumentos de tipo.
ru: Невозможно наследовать интерфейс "{0}", поскольку он может совпадать с интерфейсом "{1}", от которого наследуется интерфейс "{2}" для некоторых аргументов типа.
tr: Bazı tür bağımsız değişkenleri için '{2}' arabiriminin devraldığı '{1}' arabirimiyle özdeş olabileceğinden, '{0}' arabirimi devralamıyor.
zh_hans: 无法继承接口“{0}”，因为对于某些类型参数，该接口与接口“{2}”继承的接口“{1}”相同。
zh_hant: 無法繼承介面 '{0}'，因為它可能與某些類型引數的介面 '{2}' 所繼承之介面 '{1}' 相同。

# ERR_ClassInheritsBaseUnifiesWithInterfaces3
source: Cannot implement interface '{0}' because the interface '{1}' from which it inherits could be identical to implemented interface '{2}' for some type arguments.
cs: Nejde implementovat rozhraní {0}, protože rozhraní {1}, ze kterého se dědí, by mohlo být u některých argumentů identické s implementovaným rozhraním {2}.
de: Die Schnittstelle "{0}" kann nicht implementiert werden, da die Schnittstelle "{1}", von der geerbt wird, bei manchen Typargumenten möglicherweise mit der implementierten Schnittstelle "{2}" identisch ist.
es: No se puede implementar la interfaz '{0}' porque la interfaz '{1}' de la que hereda podría ser idéntica a la interfaz '{2}' implementada para algunos argumentos de tipo.
fr: Impossible d'implémenter l'interface '{0}', car l'interface '{1}' dont elle hérite peut être identique à l'interface '{2}' implémentée pour certains arguments de type.
it: Non è possibile implementare l'interfaccia '{0}' perché l'interfaccia '{1}' da cui eredita potrebbe essere identica all'interfaccia '{2}' per alcuni argomenti di tipo.
ja: インターフェイス '{0}' を実装できません。この継承元であるインターフェイス '{1}' と一部の型引数用に実装されたインターフェイス '{2}' が同一である可能性があります。
ko: '{0}' 인터페이스를 구현할 수 없습니다. 이 인터페이스가 구현된 '{1}' 인터페이스가 일부 형식 인수에 대해 '{2}' 인터페이스와 동일할 수 있습니다.
pl: Nie można zaimplementować interfejsu „{0}”, ponieważ interfejs „{1}”, po którym ten interfejs dziedziczy, może być taki sam jak zaimplementowany interfejs „{2}” dla niektórych argumentów typu.
pt_br: Não é possível implementar a interface "{0}" porque a interface "{1}" da qual ela herda poderia ser idêntica à interface implementada "{2}" para alguns argumentos de tipo.
ru: Невозможно реализовать интерфейс "{0}", поскольку интерфейс "{1}", от которого он наследуется, может совпадать с реализованным интерфейсом "{2}" для некоторых аргументов типа.
tr: Devralındığı '{1}' arabirimi bazı tür bağımsız değişkenlerinde uygulanan '{2}' arabirimiyle özdeş olabileceğinden, '{0}' arabirimi uygulanamıyor.
zh_hans: 无法实现接口“{0}”，因为对于某些类型参数，它所继承的接口“{1}”可能与实现的接口“{2}”相同。
zh_hant: 無法實作介面 '{0}'，因為它所繼承的介面 '{1}' 可能與某些類型引數之實作介面 '{2}' 相同。
