Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CantAssignToConst
source: Constant cannot be the target of an assignment.
cs: Konstanta nemůže být cílem přiřazení.
de: Konstante kann nicht das Ziel einer Zuweisung sein.
es: La constante no puede ser el destino de una asignación.
fr: Une constante ne peut pas être la cible d'une assignation.
it: Una costante non può essere la destinazione di un'assegnazione.
ja: 定数を代入式のターゲットにすることはできません。
ko: 상수는 할당 대상일 수 없습니다.
pl: Stała nie może być elementem docelowym przypisania.
pt_br: A constante não pode ser o destino de uma atribuição.
ru: Константе нельзя ничего присваивать.
tr: Sabit, atama işleminin hedefi olamaz.
zh_hans: 常量不能作为赋值目标。
zh_hant: 常數不可以當做指派的目標。

# ERR_NamedSubscript
source: Named arguments are not valid as array subscripts.
cs: Pojmenované argumenty nejsou platné jako dolní indexy polí.
de: Benannte Argumente sind als Arrayfeldindex ungültig.
es: Los argumentos con nombre no son válidos como subíndices de matriz.
fr: Les arguments nommés ne sont pas valides en tant qu'indices de tableau.
it: Gli argomenti denominati non sono validi come indici di matrice.
ja: 名前付き引数は、配列インデックスとしては有効ではありません。
ko: 명명된 인수는 배열 첨자로 사용할 수 없습니다.
pl: Nazwane argumenty nie są prawidłowe jako indeksy tablicy.
pt_br: Argumentos nomeados não são válidos como subscritos de matriz.
ru: Недопустимо использовать именованные аргументы как индексы массива.
tr: Adlandırılmış bağımsız değişkenler dizi indisi olarak geçerli değildir.
zh_hans: 命名参数作为数组下标无效。
zh_hant: 具名引數不可以當做陣列註標。

# ERR_ExpectedEndIf
source: 'If' must end with a matching 'End If'.
cs: 'Klíčové slovo If musí být ukončené párovým klíčovým slovem End If.
de: '"If" muss mit einem entsprechenden "End If" abgeschlossen werden.
es: 'If' debe terminar con la instrucción 'End If' correspondiente.
fr: 'If' doit se terminer par un 'End If' correspondant.
it: 'If' deve terminare con un elemento 'End If' corrispondente.
ja: 'If' の終わりには、対応する 'End If' を指定しなければなりません。
ko: 'If'는 짝이 되는 'End If'로 끝나야 합니다.
pl: 'Instrukcja If musi być zakończona odpowiadającą jej instrukcją End If.
pt_br: 'If' deve terminar com um 'End If' correspondente.
ru: 'Блок "If" должен заканчиваться соответствующим оператором "End If".
tr: 'If' öğesi eşleşen bir 'End If' ile bitmelidir.
zh_hans: '“If”必须以匹配的“End If”结束。
zh_hant: 'If' 之後必須搭配相對應的 'End If'。

# ERR_ExpectedEndWhile
source: 'While' must end with a matching 'End While'.
cs: 'Klíčové slovo While musí být ukončené párovým klíčovým slovem End While.
de: '"While" muss mit einem entsprechenden "End While" abgeschlossen werden.
es: 'While' debe terminar con la instrucción 'End While' correspondiente.
fr: 'While' doit se terminer par un 'End While' correspondant.
it: 'While' deve terminare con un elemento 'End While' corrispondente.
ja: 'While' の終わりには、対応する 'End While' を指定しなければなりません。
ko: 'While'은 짝이 되는 'End While'로 끝나야 합니다.
pl: 'Instrukcja While musi być zakończona odpowiadającą jej instrukcją End While.
pt_br: 'While' deve terminar com um 'End While' correspondente.
ru: 'Блок "While" должен заканчиваться соответствующим оператором "End While".
tr: 'While' öğesi eşleşen bir 'End While' ile bitmelidir.
zh_hans: '“While”必须以匹配的“End While”结束。
zh_hant: 'While' 之後必須搭配相對應的 'End While'。

# ERR_ExpectedLoop
source: 'Do' must end with a matching 'Loop'.
cs: 'Klíčové slovo Do musí být ukončené párovým klíčovým slovem Loop.
de: '"Do" muss mit einem entsprechenden "Loop" abgeschlossen werden.
es: 'Do' debe terminar con la instrucción 'Loop' correspondiente.
fr: 'Do' doit se terminer par un 'Loop' correspondant.
it: 'Do' deve terminare con un elemento 'Loop' corrispondente.
ja: 'Do' の終わりには、対応する 'Loop' を指定しなければなりません。
ko: 'Do'는 짝이 되는 'Loop'로 끝나야 합니다.
pl: 'Instrukcja Do musi być zakończona odpowiadającą jej instrukcją Loop.
pt_br: 'Do' deve terminar com um 'Loop' correspondente.
ru: 'Блок "Do" должен заканчиваться соответствующим оператором "Loop".
tr: 'Do' öğesi eşleşen bir 'Loop' ile bitmelidir.
zh_hans: '"Do" 必须以匹配的 "Loop" 结束。
zh_hant: 'Do' 之後必須搭配相對應的 'Loop'。

# ERR_ExpectedNext
source: 'For' must end with a matching 'Next'.
cs: 'Klíčové slovo For musí být ukončené párovým klíčovým slovem Next.
de: '"For" muss mit einem entsprechenden "Next" abgeschlossen werden.
es: 'For' debe terminar con la instrucción 'Next' correspondiente.
fr: 'For' doit se terminer par un 'Next' correspondant.
it: 'For' deve terminare con un elemento 'Next' corrispondente.
ja: 'For' の終わりには、対応する 'Next' を指定しなければなりません。
ko: 'For'는 짝이 되는 'Next'로 끝나야 합니다.
pl: 'Instrukcja For musi być zakończona odpowiadającą jej instrukcją Next.
pt_br: 'For' deve terminar com um 'Next' correspondente.
ru: 'Блок "For" должен заканчиваться соответствующим оператором "Next".
tr: 'For' öğesi eşleşen bir 'Next' ile bitmelidir.
zh_hans: '"For" 必须以匹配的 "Next" 结束。
zh_hant: 'For' 之後必須搭配相對應的 'Next'。

# ERR_ExpectedEndWith
source: 'With' must end with a matching 'End With'.
cs: 'Klíčové slovo With musí být ukončené párovým klíčovým slovem End With.
de: '"With" muss mit einem entsprechenden "End With" abgeschlossen werden.
es: 'With' debe terminar con la instrucción 'End With' correspondiente.
fr: 'With' doit se terminer par un 'End With' correspondant.
it: 'With' deve terminare con un elemento 'End With' corrispondente.
ja: 'With' の終わりには、対応する 'End With' を指定しなければなりません。
ko: 'With'는 짝이 되는 'End With'로 끝나야 합니다.
pl: 'Instrukcja With musi być zakończona odpowiadającą jej instrukcją End With.
pt_br: 'With' deve terminar com um 'End With' correspondente.
ru: 'Блок "With" должен заканчиваться соответствующим оператором "End With".
tr: 'With' öğesi eşleşen bir 'End With' ile bitmelidir.
zh_hans: '“With”必须以匹配的“End With”结束。
zh_hant: 'With' 之後必須搭配相對應的 'End With'。

# ERR_ElseNoMatchingIf
source: 'Else' must be preceded by a matching 'If' or 'ElseIf'.
cs: 'Klíčovému slovu Else musí předcházet párové klíčové slovo If nebo ElseIf.
de: '"Else" muss ein entsprechendes "If" oder "ElseIf" voranstehen.
es: 'Else' debe ir precedida de una instrucción 'If' o 'ElseIf' correspondiente.
fr: 'Else' doit être précédé d'un 'If' ou 'ElseIf' correspondant.
it: 'Else' deve essere preceduto da un 'If' o 'ElseIf' corrispondente.
ja: 'Else' の前には、対応する 'If' または 'ElseIf' を指定しなければなりません。
ko: 'Else'는 짝이 되는 'If' 또는 'ElseIf' 뒤에 와야 합니다.
pl: 'Element „Else” musi być poprzedzony odpowiadającym mu elementem „If” lub „ElseIf”.
pt_br: 'Else' deve ser precedido por 'If' ou 'ElseIf' correspondente.
ru: 'Оператору "ElseIf" должен предшествовать соответствующий "If" или "ElseIf".
tr: 'Else' öncesinde eşleşen bir 'If' veya 'ElseIf' olmalıdır.
zh_hans: '"Else" 前面必须是匹配的 "If" 或 "ElseIf"。
zh_hant: 'Else' 之前必須搭配相對應的 'If' 或 'ElseIf'。

# ERR_EndIfNoMatchingIf
source: 'End If' must be preceded by a matching 'If'.
cs: 'Klíčovému slovu End If musí předcházet párové klíčové slovo If.
de: '"End If" muss ein entsprechendes "If" voranstehen.
es: 'End If' debe ir precedida de la instrucción 'If' correspondiente.
fr: 'End If' doit être précédé d'un 'If' correspondant.
it: 'End If' deve essere preceduto da un 'If' corrispondente.
ja: 'End If' の前には、対応する 'If' を指定しなければなりません。
ko: 'End If'는 짝이 되는 'If' 뒤에 와야 합니다.
pl: 'Instrukcja End If musi być poprzedzona odpowiadającą jej instrukcją If.
pt_br: 'End If' deve ser precedido por 'If' correspondente.
ru: 'Оператору "End If" должен предшествовать соответствующий оператор "If".
tr: 'End If' öncesinde eşleşen bir 'If' olmalıdır.
zh_hans: '"End If" 前面必须是匹配的 "If"。
zh_hant: 'End If' 之前必須搭配相對應的 'If'。

# ERR_EndSelectNoSelect
source: 'End Select' must be preceded by a matching 'Select Case'.
cs: 'Klíčovému slovu End Select musí předcházet párové klíčové slovo Select Case.
de: '"End Select" muss ein entsprechendes "Select Case" voranstehen.
es: 'End Select' debe ir precedida de la instrucción 'Select Case' correspondiente.
fr: 'End Select' doit être précédé d'un 'Select Case' correspondant.
it: 'End Select' deve essere preceduto da un 'Select Case' corrispondente.
ja: 'End Select' の前には、対応する 'Select Case' を指定しなければなりません。
ko: 'End Select'는 짝이 되는 'Select Case' 뒤에 와야 합니다.
pl: 'Instrukcja „End Select” musi być poprzedzona odpowiadającą jej instrukcją „Select Case”.
pt_br: 'End Select' deve ser precedido por 'Select Case' correspondente.
ru: 'Оператору "End Select" должен предшествовать соответствующий оператор "Select Case".
tr: 'End Select' öncesinde eşleşen bir 'Select Case' olmalıdır.
zh_hans: '"End Select" 前面必须是匹配的 "Select Case"。
zh_hant: 'End Select' 之前必須搭配相對應的 'Select Case'。

# ERR_ExitDoNotWithinDo
source: 'Exit Do' can only appear inside a 'Do' statement.
cs: 'Klíčové slovo Exit Do se dá použít jenom uvnitř příkazu Do.
de: '"Exit Do" kann nur innerhalb einer Do-Anweisung verwendet werden.
es: 'Exit Do' solo puede aparecer dentro de una instrucción 'Do'.
fr: 'Exit Do' ne peut s'utiliser qu'à l'intérieur d'une instruction 'Do'.
it: 'Exit Do' può essere specificato solo all'interno di un'istruzione 'Do'.
ja: 'Exit Do' は、'Do' ステートメント内でのみ使用できます。
ko: 'Exit Do'는 'Do' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Exit Do może wystąpić tylko wewnątrz instrukcji Do.
pt_br: 'Exit Do' só pode aparecer dentro de uma instrução 'Do'.
ru: '"Exit Do" может использоваться только в теле оператора "Do".
tr: 'Exit Do' yalnızca bir 'Do' deyimi içinde yer alabilir.
zh_hans: '"Exit Do" 只能出现在 "Do" 语句内。
zh_hant: 'Exit Do' 只可以在 'Do' 陳述式中出現。

# ERR_EndWhileNoWhile
source: 'End While' must be preceded by a matching 'While'.
cs: 'Klíčovému slovu End While musí předcházet párové klíčové slovo While.
de: '"End While" muss ein entsprechendes "While" voranstehen.
es: 'End While' debe ir precedida de la instrucción 'While' correspondiente.
fr: 'End While' doit être précédé d'un 'While' correspondant.
it: 'End While' deve essere preceduto da un elemento 'While' corrispondente.
ja: 'End While' の前には、対応する 'While' を指定しなければなりません。
ko: 'End While'은 짝이 되는 'While' 뒤에 와야 합니다.
pl: 'Instrukcja End While musi być poprzedzona odpowiadającą jej instrukcją While.
pt_br: 'End While' deve ser precedido por 'While' correspondente.
ru: 'Оператору "End While" должен предшествовать соответствующий оператор "While".
tr: 'End While' öncesinde eşleşen bir 'While' olmalıdır.
zh_hans: '“End While”前面必须是匹配的“While”。
zh_hant: 'End While' 之前必須搭配相對應的 'While'。

# ERR_LoopNoMatchingDo
source: 'Loop' must be preceded by a matching 'Do'.
cs: 'Klíčovému slovu Loop musí předcházet párové klíčové slovo Do.
de: '"Loop" muss ein entsprechendes "Do" voranstehen.
es: 'Loop' debe ir precedida de la instrucción 'Do' correspondiente.
fr: 'Loop' doit être précédé d'un 'Do' correspondant.
it: 'Loop' deve essere preceduto da un elemento 'Do' corrispondente.
ja: 'Loop' の前には、対応する 'Do' を指定しなければなりません。
ko: 'Loop'는 짝이 되는 'Do' 뒤에 와야 합니다.
pl: 'Instrukcja Loop musi być poprzedzona odpowiadającą jej instrukcją Do.
pt_br: 'Loop' deve ser precedido por um 'Do' correspondente.
ru: 'Оператору "Loop" должен предшествовать соответствующий оператор "Do".
tr: 'Loop' öncesinde eşleşen bir 'Do' olmalıdır.
zh_hans: '"Loop" 前面必须是匹配的 "Do"。
zh_hant: 'Loop' 之前必須搭配相對應的 'Do'。

# ERR_NextNoMatchingFor
source: 'Next' must be preceded by a matching 'For'.
cs: 'Klíčovému slovu Next musí předcházet párové klíčové slovo For.
de: '"Next" muss ein entsprechendes "For" voranstehen.
es: 'Next' debe ir precedida de la instrucción 'For' correspondiente.
fr: 'Next' doit être précédé d'un 'For' correspondant.
it: 'Next' deve essere preceduto da un elemento 'For' corrispondente.
ja: 'Next' の前には、対応する 'For' を指定しなければなりません。
ko: 'Next'는 짝이 되는 'For' 뒤에 와야 합니다.
pl: 'Instrukcja Next musi być poprzedzona odpowiadającą jej instrukcją For.
pt_br: 'Next' deve ser precedido por 'For' correspondente.
ru: 'Оператору "Next" должен предшествовать соответствующий оператор "For".
tr: 'Next' öncesinde eşleşen bir 'For' olmalıdır.
zh_hans: '"Next" 前面必须是匹配的 "For"。
zh_hant: 'Next' 之前必須搭配相對應的 'For'。

# ERR_EndWithWithoutWith
source: 'End With' must be preceded by a matching 'With'.
cs: 'Klíčovému slovu End With musí předcházet párové klíčové slovo With.
de: '"End With" muss ein entsprechendes "With" voranstehen.
es: 'End With' debe ir precedida de la instrucción 'With' correspondiente.
fr: 'End With' doit être précédé d'un 'With' correspondant.
it: 'End With' deve essere preceduto da un elemento 'With' corrispondente.
ja: 'End With' の前には、対応する 'With' を指定しなければなりません。
ko: 'End With'는 짝이 되는 'With' 뒤에 와야 합니다.
pl: 'Instrukcja End With musi być poprzedzona odpowiadającą jej instrukcją With.
pt_br: 'End With' deve ser precedido por 'With' correspondente.
ru: 'Оператору "End With" должен предшествовать соответствующий оператор "With".
tr: 'End With' öncesinde eşleşen bir 'With' olmalıdır.
zh_hans: '“End With”前面必须是匹配的“With”。
zh_hant: 'End With' 之前必須搭配相對應的 'With'。

# ERR_MultiplyDefined1
source: Label '{0}' is already defined in the current method.
cs: Návěští {0} je již definované v aktuální metodě.
de: Die Bezeichnung "{0}" ist bereits in der aktuellen Methode definiert.
es: La etiqueta '{0}' ya está definida en el método actual.
fr: L'étiquette '{0}' est déjà définie dans la méthode actuelle.
it: L'etichetta '{0}' è già definita nel metodo corrente.
ja: ラベル '{0}' は、現在のメソッドで既に定義されています。
ko: '{0}' 레이블이 현재 메서드에 이미 정의되었습니다.
pl: Etykieta „{0}” jest już zdefiniowana w bieżącej metodzie.
pt_br: Rótulo "{0}" já está definido no método atual.
ru: Метка "{0}" уже определена в текущем методе.
tr: '{0}' etiketi geçerli yöntemde zaten tanımlanmış.
zh_hans: 当前方法中已定义了标签“{0}”。
zh_hant: 標籤 '{0}' 已定義在目前的方法中。

# ERR_ExpectedEndSelect
source: 'Select Case' must end with a matching 'End Select'.
cs: 'Příkaz Select Case musí být ukončený párovým příkazem End Select.
de: 'Select Case muss mit einer entsprechenden "End Select"-Anweisung enden.
es: 'Select Case' debe terminar con la instrucción 'End Select' correspondiente.
fr: 'Select Case' doit se terminer par un 'End Select' correspondant.
it: 'Select Case' deve terminare con un elemento 'End Select' corrispondente.
ja: 'Select Case' の終わりには、対応する 'End Select' を指定しなければなりません。
ko: 'Select Case'는 짝이 되는 'End Select'로 끝나야 합니다.
pl: 'Instrukcja Select Case musi być zakończona odpowiadającą jej instrukcją End Select.
pt_br: 'Select Case' deve terminar com um 'End Select' correspondente.
ru: 'Блок "Select Case" должен заканчиваться соответствующим оператором "End Select".
tr: 'Select Case' deyimi eşleşen bir 'End Select' ile bitmelidir.
zh_hans: '“Select Case”必须以匹配的“End Select”结束。
zh_hant: 'Select Case' 的結尾必須是相對應的 'End Select'。

# ERR_ExitForNotWithinFor
source: 'Exit For' can only appear inside a 'For' statement.
cs: 'Příkaz Exit For se dá použít jenom v rámci příkazu For.
de: '"Exit For" kann nur innerhalb einer For-Anweisung verwendet werden.
es: 'Exit For' solo puede aparecer dentro de una instrucción 'For'.
fr: 'Exit For' ne peut apparaître qu'à l'intérieur d'une instruction 'For'.
it: 'Exit For' può essere specificato solo all'interno di un'istruzione 'For'.
ja: 'Exit For' は、'For' ステートメント内でのみ使用できます。
ko: 'Exit For'는 'For' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Exit For może wystąpić tylko wewnątrz instrukcji For.
pt_br: 'Exit For' só pode aparecer dentro de uma instrução 'For'.
ru: '"Exit For" может использоваться только в теле оператора "For".
tr: 'Exit For' yalnızca bir 'For' deyimi içinde yer alabilir.
zh_hans: '"Exit For" 只能出现在 "For" 语句内。
zh_hant: 'Exit For' 只可以在 'For' 陳述式中出現。

# ERR_ExitWhileNotWithinWhile
source: 'Exit While' can only appear inside a 'While' statement.
cs: 'Příkaz Exit While se dá použít jenom v rámci příkazu While.
de: '"Exit While" kann nur innerhalb einer While-Anweisung verwendet werden.
es: 'Exit While' solo puede aparecer dentro de una instrucción 'While'.
fr: 'Exit While' ne peut apparaître qu'à l'intérieur d'une instruction 'While'.
it: 'Exit While' può essere specificato solo all'interno di un'istruzione 'While'.
ja: 'Exit While' は、'While' ステートメント内でのみ使用できます。
ko: 'Exit While'은 'While' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Exit While może wystąpić tylko wewnątrz instrukcji While.
pt_br: 'Exit While' só pode aparecer dentro de uma instrução 'While'.
ru: '"Exit While" может использоваться только в теле оператора "While".
tr: 'Exit While' yalnızca bir 'While' deyimi içinde yer alabilir.
zh_hans: '"Exit While" 只能出现在 "While" 语句内。
zh_hant: 'Exit While' 只可以在 'While' 陳述式中出現。

# ERR_ReadOnlyProperty1
source: 'ReadOnly' property '{0}' cannot be the target of an assignment.
cs: 'Vlastnost {0} typu ReadOnly nemůže být cílem přiřazení.
de: 'Die ReadOnly-Eigenschaft "{0}" kann nicht das Ziel einer Zuweisung sein.
es: 'La propiedad '{0}' de 'ReadOnly' no puede ser el destino de una asignación.
fr: 'La propriété 'ReadOnly' '{0}' ne peut pas être la cible d'une assignation.
it: 'La proprietà '{0}' di 'ReadOnly' non può essere la destinazione di un'assegnazione.
ja: 'ReadOnly' プロパティ '{0}' を代入式のターゲットにすることはできません。
ko: 'ReadOnly' 속성의 '{0}' 속성은 할당 대상일 수 없습니다.
pl: 'Właściwość „{0}” typu „ReadOnly” nie może być elementem docelowym przypisania.
pt_br: 'Propriedade "ReadOnly" "{0}" não pode ser o destino de uma atribuição.
ru: 'Свойство "ReadOnly" "{0}" не может быть целевым объектом назначения.
tr: '{0}' 'ReadOnly' özelliği atama işleminin hedefi olamaz.
zh_hans: '“ReadOnly”属性“{0}”不能作为赋值目标。
zh_hant: 'ReadOnly' 屬性 '{0}' 不可為指派的目標。

# ERR_ExitSelectNotWithinSelect
source: 'Exit Select' can only appear inside a 'Select' statement.
cs: 'Příkaz Exit Select se dá použít jenom v rámci příkazu Select.
de: '"Exit Select" kann nur innerhalb einer Select-Anweisung verwendet werden.
es: 'Exit Select' solo puede aparecer dentro de una instrucción 'Select'.
fr: 'Exit Select' ne peut apparaître qu'à l'intérieur d'une instruction 'Select'.
it: 'Exit Select' può essere specificato solo all'interno di un'istruzione 'Select'.
ja: 'Exit Select' は、'Select' ステートメント内でのみ使用できます。
ko: 'Exit Select'는 'Select' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Exit Select może wystąpić tylko wewnątrz instrukcji Select.
pt_br: 'Exit Select' só pode aparecer dentro de uma instrução 'Select'.
ru: '"Exit Select" может использоваться только в теле оператора "Select".
tr: 'Exit Select' yalnızca bir 'Select' deyimi içinde yer alabilir.
zh_hans: '"Exit Select" 只能出现在 "Select" 语句内。
zh_hant: 'Exit Select' 只可以在 'Select' 陳述式中出現。

# ERR_BranchOutOfFinally
source: Branching out of a 'Finally' is not valid.
cs: Rozvětvení z bloku Finally není platné.
de: Branches aus einem "Finally" sind ungültig.
es: La rama fuera de una cláusula 'Finally' no es válida.
fr: La création d'une branche en dehors d'un 'Finally' n'est pas valide.
it: La creazione di rami all'esterno di 'Finally' non è valida.
ja: Finally' からのブランチは有効ではありません。
ko: Finally' 밖으로는 분기할 수 없습니다.
pl: Rozgałęzianie poza blokiem „Finally” jest nieprawidłowe.
pt_br: Branches fora de um 'Finally' não são válidos.
ru: Переход из блока "Finally" является недопустимым.
tr: Finally' bloğunun dışına dallanma geçerli değil.
zh_hans: 从“Finally”中分支无效。
zh_hant: Finally' 的分支無效。

# ERR_QualNotObjectRecord1
source: '!' requires its left operand to have a type parameter, class or interface type, but this operand has the type '{0}'.
cs: 'Operátor ! vyžaduje, aby levý operand byl parametr typu (typ třídy nebo rozhraní), ale tento operand je typu {0}.
de: 'Für "!" muss der linke Operand einen Typparameter-, Klassen- oder Schnittstellentyp aufweisen. Dieser Operand ist jedoch vom Typ "{0}".
es: '!' requiere que el operando izquierdo tenga un parámetro de tipo, una clase o un tipo de interfaz, pero este operando tiene el tipo '{0}'.
fr: '!' requiert un opérande gauche ayant un paramètre de type, un type de classe ou d'interface, mais cet opérande a le type '{0}'.
it: 'Con '!' è necessario che all'operando di sinistra sia assegnato un tipo classe o interfaccia oppure un parametro di tipo, invece il tipo dell'operando è '{0}'.
ja: '!' の左側に、型パラメーター、クラスまたはインターフェイス型を持つオペランドが必要ですが、このオペランドの型は '{0}' です。
ko: '!'의 왼쪽 피연산자는 형식 매개 변수, 클래스 또는 인터페이스 형식이어야 하는데 이 피연산자는 '{0}' 형식입니다.
pl: 'Element „!” wymaga, aby lewy argument operacji zawierał parametr typu, klasę lub typ interfejsu, ale ten argument operacji jest typu „{0}”.
pt_br: "!" requer que seu operando esquerdo tenha um parâmetro de tipo, classe ou tipo de interface, mas este operando tem o tipo "{0}".
ru: '!' требует, чтобы левый операнд имел параметр типа, класс или тип интерфейса, но этот операнд имеет тип "{0}".
tr: '!' işleci sol işlenenin tür parametresi, sınıf veya arabirim türünde olmasını gerektirir, ancak bu işlenen '{0}' türünde.
zh_hans: '“!”要求其左操作数具有类型参数、类或接口类型，但此操作数的类型为“{0}”。
zh_hant: '!' 左側的運算元必須是類型參數、類別或介面類型，但此運算元是 '{0}' 類型。

# ERR_TooFewIndices
source: Number of indices is less than the number of dimensions of the indexed array.
cs: Počet indexů je menší než počet rozměrů indexovaného pole.
de: Die Indexanzahl ist kleiner als die Anzahl der Dimensionen des indizierten Arrays.
es: El número de índices es inferior al número de dimensiones de la matriz indizada.
fr: Le nombre d'index est inférieur au nombre de dimensions du tableau indexé.
it: Il numero di indici è inferiore al numero di dimensioni della matrice indicizzata.
ja: インデックスの数がインデックス付き配列の次元数より少ない値です。
ko: 인덱스 수가 인덱싱된 배열의 차수보다 적습니다.
pl: Liczba indeksów jest mniejsza niż liczba wymiarów tablicy indeksowanej.
pt_br: O número de índices é inferior ao número de dimensões da matriz indexada.
ru: Число индексов меньше числа измерений индексированного массива.
tr: Dizin sayısı, sıralı dizinin boyut sayısından daha az.
zh_hans: 索引数少于索引数组的维数。
zh_hant: 索引數目少於索引陣列維度的數目。

# ERR_TooManyIndices
source: Number of indices exceeds the number of dimensions of the indexed array.
cs: Počet indexů překračuje počet rozměrů indexovaného pole.
de: Die Indexanzahl ist größer als die Anzahl der Dimensionen des indizierten Arrays.
es: El número de índices supera el número de dimensiones de la matriz indizada.
fr: Le nombre d'index est supérieur au nombre de dimensions du tableau indexé.
it: Il numero di indici è superiore al numero di dimensioni della matrice indicizzata.
ja: インデックスの数がインデックス付き配列の次元数を超えています。
ko: 인덱스 수가 인덱싱된 배열의 차수보다 많습니다.
pl: Liczba indeksów przekracza liczbę wymiarów tablicy indeksowanej.
pt_br: O número de índices excede o número de dimensões da matriz indexada.
ru: Число индексов больше числа измерений индексированного массива.
tr: Dizin sayısı, indisli dizinin boyut sayısını aşıyor.
zh_hans: 索引数超过索引数组的维数。
zh_hant: 索引數目超過索引陣列維度的數目。

# ERR_EnumNotExpression1
source: '{0}' is an Enum type and cannot be used as an expression.
cs: 'Typ {0} je výčtovým typem a nejde ho použít jako výraz.
de: '"{0}" ist ein Enumerationstyp und kann nicht als Ausdruck verwendet werden.
es: “{0}” es un tipo de enumeración y no se puede usar como una expresión.
fr: '{0}' est un type Enum et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è un tipo enumerazione non può essere usato come espressione.
ja: '{0}' は列挙型であり、式として使用することはできません。
ko: '{0}'은(는) 열거형 형식이므로 식으로 사용할 수 없습니다.
pl: Typem elementu „{0}” jest typ wyliczeniowy i nie można go używać jako wyrażenia.
pt_br: "{0}" é um tipo Enum e não pode ser usado como uma expressão.
ru: "{0}" является типом Enum и не может использоваться как выражение.
tr: '{0}' bir Sabit Listesi türüdür ve ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个枚举类型，不能用作表达式。
zh_hant: '{0}' 是列舉類型，無法用做為運算式。

# ERR_TypeNotExpression1
source: '{0}' is a type and cannot be used as an expression.
cs: '{0} je typ a nejde ho použít jako výraz.
de: '"{0}" ist ein Typ und kann nicht als Ausdruck verwendet werden.
es: '{0}' es un tipo y no se puede usar como expresión.
fr: '{0}' est un type et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è un tipo e non può essere usato come espressione.
ja: '{0}' は型であるため、式として使用することはできません。
ko: '{0}'은(는) 형식이므로 식으로 사용할 수 없습니다.
pl: 'Element „{0}” jest typem i nie można go używać jako wyrażenia.
pt_br: "{0}" é um tipo e não pode ser usado como uma expressão.
ru: "{0}" является типом и не может использоваться в качестве выражения.
tr: '{0}' bir türdür ve ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个类型，不能用作表达式。
zh_hant: '{0}' 為類型，無法用做為運算式。
