Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoDefaultNotExtend1
source: Class '{0}' cannot be indexed because it has no default property.
cs: Třídu {0} nejde indexovat, protože nemá žádnou výchozí vlastnost.
de: Die Klasse "{0}" kann nicht indiziert werden, da sie keine Standardeigenschaft hat.
es: La clase '{0}' no se puede indizar porque no tiene ninguna propiedad predeterminada.
fr: La classe '{0}' ne peut pas être indexée, car elle n'a pas de propriété par défaut.
it: La classe '{0}' non può essere indicizzata perché non contiene proprietà predefinite.
ja: クラス '{0}' には既定のプロパティがないため、インデックス処理を実行できません。
ko: '{0}' 클래스는 기본 속성이 없으므로 인덱싱될 수 없습니다.
pl: Nie można zaindeksować klasy „{0}”, ponieważ nie ma ona właściwości domyślnej.
pt_br: Classe "{0}" não pode ser indexada porque ela não tem propriedade padrão.
ru: Класс "{0}" не может быть индексирован, так как не имеет свойства по умолчанию.
tr: Varsayılan özelliği olmadığından '{0}' sınıfının dizini oluşturulamaz.
zh_hans: 无法为类“{0}”编制索引，因为它没有默认属性。
zh_hant: 無法對類別 '{0}' 編製索引，因為其無預設屬性。

# ERR_OverloadWithArrayVsParamArray2
source: '{0}' and '{1}' cannot overload each other because they differ only by parameters declared 'ParamArray'.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom parametry s deklarací ParamArray.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sie sich nur durch Parameter unterscheiden, die als "ParamArray" deklariert sind.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro porque solo se diferencian en parámetros declarados como 'ParamArray'.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seuls les paramètres déclarés 'ParamArray' les différencient.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per parametri dichiarati come 'ParamArray'.
ja: '{0}' と '{1}' では、'ParamArray' として宣言されたパラメーターのみが異なるため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 'ParamArray'로 선언된 매개 변수만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie parametrami zadeklarowanymi jako „ParamArray”.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque diferem somente por parâmetros declarados "ParamArray".
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по параметрам, объявленным "ParamArray".
tr: 'Yalnızca 'ParamArray' olarak bildirilen parametreleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: “{0}”和“{1}”的差异仅在于声明为 "ParamArray" 的参数，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於宣告為 'ParamArray' 的參數不同而已。

# ERR_BadInstanceMemberAccess
source: Cannot refer to an instance member of a class from within a shared method or shared member initializer without an explicit instance of the class.
cs: V rámci sdílené metody nebo inicializační procedury sdíleného členu nejde odkazovat na instanci členu, aniž by byla k dispozici explicitní instance třídy.
de: Auf einen Instanzmember einer Klasse kann nicht ohne explizite Instanz einer Klasse von einer/m freigegebenen Methode/Member aus verwiesen werden.
es: No se puede hacer referencia a un miembro de instancia de una clase desde un método compartido o un inicializador de miembro compartido sin una instancia explícita de la clase.
fr: Impossible de faire référence à un membre instance d'une classe à partir d'une méthode partagée ou d'un initialiseur de membre partagé sans une instance explicite de la classe.
it: Non è possibile fare riferimento a un membro di istanza di una classe all'interno di un metodo condiviso o di un inizializzatore di membri condivisi senza un'istanza esplicita della classe.
ja: クラスの明示的なインスタンスを指定しないで、共有メソッドまたは共有メンバー初期化子内からクラスのインスタンス メンバーを参照することはできません。
ko: 클래스의 명시적 인스턴스가 없는 공유 메서드 또는 공유 멤버 이니셜라이저에서는 클래스의 인스턴스 멤버를 참조할 수 없습니다.
pl: Nie można odwołać się do składowej wystąpienia klasy z wnętrza udostępnionej metody lub udostępnionego inicjatora składowej bez jawnego wystąpienia klasy.
pt_br: Não é possível fazer referência a um membro de instância de uma classe de dentro de um método compartilhado ou um inicializador de membro compartilhado sem uma instância explícita da classe.
ru: Невозможно обратиться к члену экземпляра класса из общего метода или общего инициализатора члена без явного указания экземпляра этого класса.
tr: Bir sınıfın açık bir örneği olmazsa, bu sınıfın örnek üyesine paylaştırılmış yöntem veya paylaştırılmış üye başlatıcıdan başvurulamaz.
zh_hans: 没有类的显式实例，就无法从共享方法或共享成员初始值设定项中引用该类的实例成员。
zh_hant: 沒有類別的明確執行個體，因此無法從共用方法或共用成員初始設定式中參考至類別的執行個體成員。

# ERR_ExpectedRbrace
source: '}' expected.
cs: 'Očekával se znak }.
de: '"}" erwartet.
es: 'Se esperaba '}'.
fr: '}' attendu.
it: 'È previsto il segno '}'.
ja: '}' が必要です。
ko: '}'가 필요합니다.
pl: 'Oczekiwano znaku „}”.
pt_br: '}' esperado.
ru: 'Требуется "}".
tr: '}' bekleniyor.
zh_hans: '应为 "}"。
zh_hant: '必須有 '}'。

# ERR_ModuleAsType1
source: Module '{0}' cannot be used as a type.
cs: Modul {0} nejde použít jako typ.
de: Das Modul "{0}" kann nicht als Typ verwendet werden.
es: El módulo '{0}' no se puede usar como tipo.
fr: Le module '{0}' ne peut pas être utilisé en tant que type.
it: Il modulo '{0}' non può essere usato come tipo.
ja: モジュール '{0}' を型として使用することはできません。
ko: '{0}' 모듈은 형식으로 사용할 수 없습니다.
pl: Nie można użyć modułu „{0}” jako typu.
pt_br: Módulo "{0}" não pode ser usado como um tipo.
ru: Модуль "{0}" не может использоваться как тип.
tr: '{0}' modülü tür olarak kullanılamaz.
zh_hans: 模块“{0}”不能用作类型。
zh_hant: 模組 '{0}' 不能用做為類型。

# ERR_NewIfNullOnNonClass
source: 'New' cannot be used on an interface.
cs: 'Klíčové slovo New nejde použít v rozhraní.
de: '"New" kann nicht auf einer Schnittstelle verwendet werden.
es: 'New' no se puede usar en una interfaz.
fr: 'Impossible d'utiliser 'New' pour une interface.
it: 'New' non può essere usato in un'interfaccia.
ja: 'New' をインターフェイスで使用することはできません。
ko: 'New'는 인터페이스에 사용할 수 없습니다.
pl: 'Nie można użyć instrukcji New w interfejsie.
pt_br: 'New' não pode ser usado em uma interface.
ru: '"New" не может использоваться для интерфейса.
tr: 'New' bir arabirimde kullanılamaz.
zh_hans: '"New"不能在接口上使用。
zh_hant: 'New' 無法在介面上使用。

# ERR_CatchAfterFinally
source: 'Catch' cannot appear after 'Finally' within a 'Try' statement.
cs: 'Klíčové slovo Catch nejde v rámci příkazu Try použít za klíčovým slovem Finally.
de: '"Catch" kann nicht hinter "Finally" in einer Try-Anweisung stehen.
es: 'Catch' no puede aparecer después de 'Finally' dentro de una instrucción 'Try'.
fr: 'Catch' ne peut pas apparaître après 'Finally' dans une instruction 'Try'.
it: 'Catch' non può essere specificato dopo 'Finally' in un'istruzione 'Try'.
ja: 'Catch' を 'Try' ステートメント内にある 'Finally' の後に置くことはできません。
ko: 'Catch'는 'Try' 문 안에서 'Finally' 뒤에 사용할 수 없습니다.
pl: 'Instrukcja Catch nie może wystąpić po instrukcji Finally w instrukcji Try.
pt_br: 'Catch' não pode aparecer depois de 'Finally' dentro de uma instrução 'Try'.
ru: 'В операторе "Try" ключевое слово "Catch" не может указываться после "Finally".
tr: 'Try' deyimi içinde 'Finally' öğesinden sonra 'Catch' bulunamaz.
zh_hans: '在“Try”语句中，“Catch”不能出现在“Finally”之后。
zh_hant: '在 'Try' 陳述式中，'Catch' 不可以出現在 'Finally' 之後。

# ERR_CatchNoMatchingTry
source: 'Catch' cannot appear outside a 'Try' statement.
cs: 'Klíčové slovo Catch nejde použít vně příkazu Try.
de: '"Catch" kann nicht außerhalb einer Try-Anweisung verwendet werden.
es: 'Catch' no puede aparecer fuera de una instrucción 'Try'.
fr: 'Catch' ne peut pas apparaître en dehors d'une instruction 'Try'.
it: 'Catch' non può essere specificato all'esterno di un'istruzione 'Try'.
ja: 'Catch' を 'Try' ステートメントの外に置くことはできません。
ko: 'Catch'는 'Try' 문 외부에 사용할 수 없습니다.
pl: 'Instrukcja Catch nie może wystąpić poza instrukcją Try.
pt_br: 'Catch' não pode aparecer fora de uma instrução 'Try'.
ru: '"Catch" не может использоваться вне оператора "Try".
tr: 'Try' deyimi dışında 'Catch' bulunamaz.
zh_hans: '“Catch”不能出现在“Try”语句之外。
zh_hant: 'Catch' 不可以出現在 'Try' 陳述式之外。

# ERR_FinallyAfterFinally
source: 'Finally' can only appear once in a 'Try' statement.
cs: 'Klíčové slovo Finally může být v příkazu Try použito jenom jednou.
de: '"Finally" darf in einer Try-Anweisung nur einmal angegeben werden.
es: 'Finally' solo puede aparecer una vez en una instrucción 'Try'.
fr: 'Finally' ne peut apparaître qu'une seule fois dans une instruction 'Try'.
it: 'Finally' può essere specificato solo una volta in un'istruzione 'Try'.
ja: 'Finally' は、'Try' ステートメント内で 1 回のみ記述できます。
ko: 'Finally'는 'Try' 문에서 한 번만 사용할 수 있습니다.
pl: 'Instrukcja Finally może wystąpić tylko raz w instrukcji Try.
pt_br: 'Finally' só pode aparecer uma vez em uma instrução 'Try'.
ru: '"Finally" в операторе "Try" может использоваться только один раз.
tr: 'Finally', 'Try' deyimi içinde yalnızca bir kez kullanılabilir.
zh_hans: '“Finally”只能在“Try”语句中出现一次。
zh_hant: 'Finally' 只能在 'Try' 陳述式中出現一次。

# ERR_FinallyNoMatchingTry
source: 'Finally' cannot appear outside a 'Try' statement.
cs: 'Klíčové slovo Finally nejde použít vně příkazu Try.
de: '"Finally" kann nicht außerhalb einer Try-Anweisung verwendet werden.
es: 'Finally' no puede aparecer fuera de una instrucción 'Try'.
fr: 'Finally' ne peut pas apparaître en dehors d'une instruction 'Try'.
it: 'Finally' non può essere specificato all'esterno di un'istruzione 'Try'.
ja: 'Finally' を 'Try' ステートメントの外に置くことはできません。
ko: 'Finally'는 'Try' 문 외부에 사용할 수 없습니다.
pl: 'Instrukcja Finally nie może wystąpić poza instrukcją Try.
pt_br: 'Finally' não pode aparecer fora de uma instrução 'Try'.
ru: '"Finally" не может находиться за пределами оператора "Try".
tr: 'Finally', 'Try' deyiminin dışında olamaz.
zh_hans: '“Finally”不能出现在“Try”语句之外。
zh_hant: 'Finally' 不可以出現在 'Try' 陳述式之外。

# ERR_EndTryNoTry
source: 'End Try' must be preceded by a matching 'Try'.
cs: 'Klíčovému slovu End Try musí předcházet párové klíčové slovo Try.
de: '"End Try" muss ein entsprechendes "Try" voranstehen.
es: 'End Try' debe ir precedida de la instrucción 'Try' correspondiente.
fr: 'End Try' doit être précédé d'un 'Try' correspondant.
it: 'End Try' deve essere preceduto da un elemento 'Try' corrispondente.
ja: 'End Try' の前には、対応する 'Try' を指定しなければなりません。
ko: 'End Try'는 짝이 되는 'Try' 뒤에 와야 합니다.
pl: 'Instrukcja End Try musi być poprzedzona odpowiadającą jej instrukcją Try.
pt_br: 'End Try' deve ser precedido por 'Try' correspondente.
ru: 'Оператору "End Try" должен предшествовать соответствующий оператор "Try".
tr: 'End Try' öncesinde eşleşen bir 'Try' olmalıdır.
zh_hans: '“End Try”前面必须是匹配的“Try”。
zh_hant: 'End Try' 之前必須搭配相對應的 'Try'。

# ERR_ExpectedEndTry
source: 'Try' must end with a matching 'End Try'.
cs: 'Klíčové slovo Try musí být ukončené párovým klíčovým slovem End Try.
de: '"Try" muss mit einem entsprechenden "End Try" abgeschlossen werden.
es: 'Try' debe terminar con la instrucción 'End Try' correspondiente.
fr: 'Try' doit se terminer par un 'End Try' correspondant.
it: 'Try' deve terminare con un elemento 'End Try' corrispondente.
ja: 'Try' の終わりには、対応する 'End Try' を指定しなければなりません。
ko: 'Try'는 짝이 되는 'End Try'로 끝나야 합니다.
pl: 'Instrukcja Try musi być zakończona odpowiadającą jej instrukcją End Try.
pt_br: 'Try' deve terminar com um 'End Try' correspondente.
ru: 'Блок "Try" должен заканчиваться соответствующим "End Try".
tr: 'Try' öğesi eşleşen bir 'End Try' ile bitmelidir.
zh_hans: '“Try”必须以匹配的“End Try”结束。
zh_hant: 'Try' 之後必須搭配相對應的 'End Try'。

# ERR_BadDelegateFlags1
source: '{0}' is not valid on a Delegate declaration.
cs: '{0} není platný v deklaraci delegáta.
de: '"{0}" ist in einer Delegatdeklaration ungültig.
es: '{0}' no es válido en una declaración de delegado.
fr: '{0}' n'est pas valide dans une déclaration Delegate.
it: '{0}' non è valido in una dichiarazione Delegate.
ja: '{0}' は、デリゲート宣言では有効ではありません。
ko: 'Delegate 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji Delegate.
pt_br: "{0}" não é válido em uma declaração Delegate.
ru: "{0}" недопустимо использовать при объявлении делегата.
tr: 'Delegate bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在委托声明中无效。
zh_hant: '{0}' 在 Delegate 宣告中無效。

# ERR_NoConstructorOnBase2
source: Class '{0}' must declare a 'Sub New' because its base class '{1}' does not have an accessible 'Sub New' that can be called with no arguments.
cs: Třída {0} musí deklarovat proceduru Sub New, protože příslušná základní třída {1} neobsahuje přístupnou proceduru Sub New, kterou by bylo možné volat bez argumentů.
de: Die Klasse "{0}" muss eine "Sub New" deklarieren, da ihre Basisklasse "{1}" keine zugreifbare "Sub New" hat, die ohne Argumente aufgerufen werden kann.
es: La clase '{0}' debe declarar un 'Sub New' porque su clase base '{1}' no dispone de un 'Sub New' accesible al que se pueda llamar sin argumentos.
fr: La classe '{0}' doit déclarer un 'Sub New', car sa classe de base '{1}' n'a pas de 'Sub New' accessible qu'il est possible d'appeler sans argument.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché la relativa classe di base '{1}' non contiene un costruttore accessibile 'Sub New' che possa essere chiamato senza argomenti.
ja: 基底クラス '{1}' に引数なしで呼び出せるアクセス可能な 'Sub New' が指定されていないため、クラス '{0}' は 'Sub New' を宣言しなければなりません。
ko: '{0}' 클래스의 기본 클래스 '{1}'에는 인수 없이 호출할 수 있는 액세스 가능한 'Sub New'가 두 개 이상 있으므로 'Sub New'를 선언해야 합니다.
pl: Klasa „{0}” musi mieć deklarację elementu „Sub New”, ponieważ jej klasa bazowa „{1}” nie ma dostępnego elementu „Sub New”, który można wywołać bez argumentów.
pt_br: Classe "{0}" deve declarar um "Sub New" porque sua classe base "{1}" não tem um "Sub New" acessível que pode ser chamado sem argumentos.
ru: Класс "{0}" должен объявить "Sub New", так как его базовый класс "{1}" не имеет доступного "Sub New", который может быть вызван без аргументов.
tr: Temel sınıfı olan '{1}' sınıfında bağımsız değişken olmadan çağrılabilecek erişilebilir bir 'Sub New' olmadığından, '{0}' sınıfı bir 'Sub New' bildirmelidir.
zh_hans: 类“{0}”必须声明一个“Sub New”，原因是它的基类“{1}”没有不使用参数就可以调用的可访问“Sub New”。
zh_hant: 類別 '{0}' 必須宣告 'Sub New'，因為其基底類別 '{1}' 沒有不用引數即可呼叫之可存取的 'Sub New'。

# ERR_InaccessibleSymbol2
source: '{0}' is not accessible in this context because it is '{1}'.
cs: 'Metoda {0} není v tomto kontextu k dispozici, protože je {1}.
de: '"{0}" ist "{1}" und in diesem Kontext nicht zugreifbar.
es: 'No se puede obtener acceso a '{0}' en este contexto porque es '{1}'.
fr: '{0}' n'est pas accessible dans ce contexte, car il est '{1}'.
it: '{0}' non è accessibile in questo contesto perché è '{1}'.
ja: '{0}' は '{1}' であるため、このコンテキストではアクセスできません。
ko: '{0}'은(는) '{1}'이므로 이 컨텍스트에서 액세스할 수 없습니다.
pl: 'Element „{0}” nie jest dostępny w tym kontekście, ponieważ jest to element „{1}”.
pt_br: "{0}" não está acessível neste contexto porque é "{1}".
ru: "{0}" в этом контексте недоступен, так как он является "{1}".
tr: '{1}' olduğundan bu bağlamda '{0}' erişilebilir değil.
zh_hans: '“{0}”是“{1}”,因此它在此上下文中不可访问。
zh_hant: '無法在此內容中存取 '{0}'，因為它是 '{1}'。

# ERR_InaccessibleMember3
source: '{0}.{1}' is not accessible in this context because it is '{2}'.
cs: 'Metoda {0}.{1} není v tomto kontextu k dispozici, protože je {2}.
de: '"{0}.{1}" ist "{2}" und in diesem Kontext nicht zugreifbar.
es: 'No se puede obtener acceso a '{0}.{1}' en este contexto porque es '{2}'.
fr: '{0}.{1}' n'est pas accessible dans ce contexte, car il est '{2}'.
it: '{0}.{1}' non è accessibile in questo contesto perché è '{2}'.
ja: '{0}.{1}' は '{2}' であるため、このコンテキストではアクセスできません。
ko: '{0}.{1}'은(는) '{2}'이므로 이 컨텍스트에서 액세스할 수 없습니다.
pl: 'Element „{0}.{1}” nie jest dostępny w tym kontekście, ponieważ jest to element „{2}”.
pt_br: "{0}.{1}" não é acessível neste contexto porque é "{2}".
ru: "{0}.{1}" в этом контексте недоступен, так как он является "{2}".
tr: '{2}' olduğundan bu bağlamda '{0}.{1}' erişilebilir değil.
zh_hans: '“{0}.{1}”是“{2}” ,因此它在此上下文中不可访问。
zh_hant: '無法在此內容中存取 '{0}.{1}'，因為其為 '{2}'。

# ERR_CatchNotException1
source: 'Catch' cannot catch type '{0}' because it is not 'System.Exception' or a class that inherits from 'System.Exception'.
cs: 'Příkaz Catch nemůže zachytit typ {0}, protože se nejedná o výjimku System.Exception ani o třídu odvozenou od třídy System.Exception.
de: '"Catch" kann den Typ "{0}" nicht auffangen, da er weder "System.Exception" ist noch eine Klasse, die von "System.Exception" erbt.
es: 'Catch' no puede reconocer el tipo '{0}' debido a que no es 'System.Exception' ni una clase que herede de 'System.Exception'.
fr: 'Catch' ne peut pas intercepter le type '{0}', car il n'est pas 'System.Exception' ou une classe qui hérite de 'System.Exception'.
it: 'Catch' non può intercettare il tipo '{0}' perché non è 'System.Exception' o una classe che eredita da 'System.Exception'.
ja: '型 '{0}' は、'System.Exception'、または 'System.Exception' から継承するクラスではないため、'Catch' でキャッチできません。
ko: '{0}' 형식은 'System.Exception' 또는 'System.Exception'에서 상속한 클래스가 아니므로 'Catch'로 이 형식을 Catch할 수 없습니다.
pl: 'Instrukcja „Catch” nie może przechwycić typu „{0}”, ponieważ nie jest to „System.Exception” ani klasa, która dziedziczy po „System.Exception”.
pt_br: "Catch" não pode capturar o tipo "{0}" porque não é "System.Exception" ou uma classe que herda de "System.Exception".
ru: '"Catch" не может перехватить тип "{0}", так как не является "System.Exception" или классом, наследующим от "System.Exception".
tr: 'System.Exception' veya 'System.Exception'dan devralınan bir sınıf olmadığından, 'Catch' '{0}' türünü yakalayamaz.
zh_hans: '“Catch”无法捕捉类型“{0}”，因为该类型既不是“System.Exception”也不是从“System.Exception”继承的类。
zh_hant: 'Catch' 無法攔截類型 '{0}'，因為其非 'System.Exception' 或繼承自 'System.Exception' 的類別。

# ERR_ExitTryNotWithinTry
source: 'Exit Try' can only appear inside a 'Try' statement.
cs: 'Klíčové slovo Exit Try se dá použít jenom uvnitř příkazu Try.
de: '"Exit Try" kann nur innerhalb einer Try-Anweisung verwendet werden.
es: 'Exit Try' solo puede aparecer dentro de una instrucción 'Try'.
fr: 'Exit Try' ne peut apparaître qu'à l'intérieur d'une instruction 'Try'.
it: 'Exit Try' può essere specificato solo all'interno di un'istruzione 'Try'.
ja: 'Exit Try' は、'Try' ステートメント内部にのみ記述できます。
ko: 'Exit Try'는 'Try' 문 내부에만 사용할 수 있습니다.
pl: 'Instrukcja Exit Try może wystąpić tylko wewnątrz instrukcji Try.
pt_br: 'Exit Try' só pode aparecer dentro de uma instrução 'Try'.
ru: '"Exit Try" может использоваться только в теле оператора "Try".
tr: 'Exit Try' yalnızca bir 'Try' deyimi içinde yer alabilir.
zh_hans: '"Exit Try" 只能出现在 "Try" 语句内。
zh_hant: 'Exit Try' 只能在 'Try' 陳述式內出現。

# ERR_BadRecordFlags1
source: '{0}' is not valid on a Structure declaration.
cs: '{0} není platný v deklaraci struktury.
de: '"{0}" ist in einer Structure-Deklaration ungültig.
es: '{0}' no es válido en una declaración Structure.
fr: '{0}' n'est pas valide dans une déclaration Structure.
it: '{0}' non è valido in una dichiarazione Structure.
ja: '{0}' は、Structure 宣言では有効ではありません。
ko: 구조체 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji struktury.
pt_br: "{0}" não é válido em uma declaração Structure.
ru: "{0}" недопустимо использовать в объявлении Structure.
tr: '{0}', Structure bildiriminde geçerli değil.
zh_hans: '“{0}”在结构声明中无效。
zh_hant: '{0}' 在 Structure 宣告中無效。

# ERR_BadEnumFlags1
source: '{0}' is not valid on an Enum declaration.
cs: '{0} není platný v deklaraci výčtu.
de: '"{0}" ist in einer Enum-Deklaration ungültig.
es: “{0}” no es válido en una declaración de enumeración.
fr: '{0}' n'est pas valide dans une déclaration Enum.
it: '{0}' non è valido in una dichiarazione di enumerazione.
ja: '{0}' は、Enum 宣言では有効ではありません。
ko: 열거형 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: Element „{0}” nie jest prawidłowy w deklaracji wyliczenia.
pt_br: "{0}" não é válido em uma declaração Enum.
ru: "{0}" недопустимо использовать при объявлении перечисления.
tr: 'Sabit listesi bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在枚举声明中无效。
zh_hant: '{0}' 在列舉宣告中無效。

# ERR_BadInterfaceFlags1
source: '{0}' is not valid on an Interface declaration.
cs: '{0} není platný v deklaraci rozhraní.
de: '"{0}" ist in einer Schnittstellendeklaration ungültig.
es: '{0}' no es válido en una declaración Interface.
fr: '{0}' n'est pas valide dans une déclaration Interface.
it: '{0}' non è valido in una dichiarazione Interface.
ja: '{0}' は、Interface 宣言では有効ではありません。
ko: 인터페이스 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji interfejsu.
pt_br: "{0}" não é válido em uma declaração Interface.
ru: "{0}" является недопустимым объявлением интерфейса.
tr: '{0}', Interface bildiriminde geçerli değil.
zh_hans: '“{0}”在接口声明中无效。
zh_hant: '{0}' 在 Interface 宣告中無效。

# ERR_OverrideWithByref2
source: '{0}' cannot override '{1}' because they differ by a parameter that is marked as 'ByRef' versus 'ByVal'.
cs: '{0} nemůže přepsat {1}, protože se liší parametrem, který je označený jednou jako ByRef a podruhé jako ByVal.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch einen als "ByRef" bzw. "ByVal" gekennzeichneten Parameter unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en un parámetro que está marcado como 'ByRef' frente a 'ByVal'.
fr: '{0}' ne peut pas se substituer à '{1}', car un paramètre marqué comme 'ByRef' pour l'une et 'ByVal' pour l'autre les différencie.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per un parametro contrassegnato da una parte come 'ByRef' e dall'altra come 'ByVal'.
ja: '{0}' と '{1}' は、パラメーターが 'ByRef' か 'ByVal' のどちらであるかが異なるため、オーバーライドすることはできません。
ko: 'ByRef' 또는 'ByVal'로 표시된 매개 변수가 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się parametrem oznaczonym jest jako „ByRef” lub „ByVal”.
pt_br: "{0}" não pode substituir "{1}" porque diferem por um parâmetros que é marcado como "ByRef" versus "ByVal".
ru: "{0}" не может переопределить "{1}", так как они отличаются по параметру, который помечен как ByRef" относительно "ByVal".
tr: 'Bir parametre birinde 'ByRef' diğerinde 'ByVal' olarak işaretlenmiş olduğundan '{0}', '{1}' sınıfını geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在某个参数上存在差异，一个被标记为“ByRef”，而另一个被标记为“ByVal”。
zh_hant: '{0}' 無法覆寫 '{1}'，因為它們的差異只在於參數標記為 'ByRef' 或 'ByVal' 而已。

# ERR_MyBaseAbstractCall1
source: 'MyBase' cannot be used with method '{0}' because it is declared 'MustOverride'.
cs: 'Odkaz MyBase nejde použít s metodou {0}, protože se pro ni používá deklarace MustOverride.
de: '"MyBase" kann nicht mit der {0}-Methode verwendet werden, da sie als "MustOverride" deklariert ist.
es: 'MyBase' no se puede usar con el método '{0}' porque está declarado como 'MustOverride'.
fr: 'MyBase' ne peut pas être utilisé avec la méthode '{0}', car il est déclaré 'MustOverride'.
it: 'MyBase' non può essere usato con il metodo '{0}' perché è dichiarato come 'MustOverride'.
ja: 'メソッド '{0}' は 'MustOverride' として宣言されているため、'MyBase' と共に使用することはできません。
ko: 'MyBase'는 'MustOverride'로 선언된 '{0}' 메서드를 함께 사용할 수 없습니다.
pl: 'Instrukcja „MyBase” nie może być użyta z metodą „{0}”, ponieważ jest ona zadeklarowana jako „MustOverride”.
pt_br: "MyBase" não pode ser usado com o método "{0}" porque está declarado como "MustOverride".
ru: '"MyBase" не может использоваться с методом "{0}", объявленным как "MustOverride".
tr: 'MustOverride' olarak bildirildiğinden, 'MyBase' '{0}' yöntemiyle kullanılamaz.
zh_hans: '“MyBase”不能用和方法“{0}”一起使用，因为它被声明为“MustOverride”。
zh_hant: '無法以方法 '{0}' 使用 'MyBase'，因為其已宣告為 'MustOverride'。
