Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_LambdaTooManyTypesObjectDisallowed
source: Cannot infer a return type because more than one type is possible. Consider adding an 'As' clause to specify the return type.
cs: Návratový typ nejde odvodit, protože je přípustný více než jeden typ. Zvažte určení návratového typu přidáním klauzule As.
de: Es kann kein Rückgabetyp abgeleitet werden, weil mehrere Typen möglich sind. Fügen Sie eine As-Klausel hinzu, um den Rückgabetyp anzugeben.
es: No se puede inferir un tipo devuelto porque es posible más de un tipo. Puede agregar una cláusula 'As' para especificar el tipo devuelto.
fr: Impossible de déduire un type de retour, car plusieurs types sont possibles. Ajoutez une clause 'As' pour spécifier le type de retour.
it: Non è possibile dedurre un tipo restituito poiché sono possibili più tipi. Provare ad aggiungere una clausola 'As' per specificare il tipo restituito.
ja: 複数の型が考えられるため、戻り値の型を推論できません。'As' 句を追加して戻り値の型を指定することを検討してください。
ko: 두 개 이상의 형식이 가능하므로 반환 형식을 유추할 수 없습니다. 'As' 절을 추가하여 반환 형식을 지정하세요.
pl: Nie można wywnioskować zwracanego typu, ponieważ jest możliwy więcej niż jeden typ. Rozważ dodanie klauzuli „As” w celu określenia zwracanego typu.
pt_br: Não é possível deduzir um tipo de retorno porque mais de um tipo é possível. Considere adicionar uma cláusula 'As' para especificar o tipo de retorno.
ru: Не удается получить возвращаемый тип, так как возможно больше одного типа. Для указания возвращаемого типа рекомендуется добавлять предложение "As".
tr: Birden fazla tür olasılığı olduğu için bir dönüş türü çıkarsanamıyor. Dönüş türünü belirtmek için bir 'As' yan tümcesi ekleyebilirsiniz.
zh_hans: 无法推断返回类型，因为可能存在多个类型。请考虑添加一个 "As" 子句来指定返回类型。
zh_hant: 無法推斷傳回類型，因為可能的類型不止一種。請考慮加上 'As' 子句來指定傳回類型。

# WRN_UnimplementedCommandLineSwitch
source: The command line switch '{0}' is not yet implemented and was ignored.
cs: Přepínač příkazového řádku {0} ještě není implementovaný, a tak se ignoroval.
de: Der Befehlszeilenschalter '{0}' ist noch nicht implementiert und wurde ignoriert.
es: El modificador de línea de comandos '{0}' todavía no se ha implementado y se ha omitido.
fr: Le commutateur de ligne de commande '{0}' n'est pas encore implémenté et a été ignoré.
it: L'opzione '{0}' della riga di comando non è ancora implementata ed è stata ignorata.
ja: コマンド ライン スイッチ '{0}' はまだ実装されていないため、無視されました。
ko: 명령줄 스위치 '{0}'이(가) 아직 구현되지 않아 무시되었습니다.
pl: Przełącznik wiersza polecenia „{0}” nie został jeszcze wdrożony i został zignorowany.
pt_br: A opção de linha de comando "{0}" ainda não está implementada e foi ignorada.
ru: Переключатель командной строки "{0}" еще не реализован и был пропущен.
tr: '{0}' komut satırı geçişi henüz uygulanmadı ve yoksayıldı.
zh_hans: 命令行开关“{0}”尚未实现，已忽略。
zh_hant: 命令列參數 '{0}' 尚未獲實作，已忽略。

# WRN_UnimplementedCommandLineSwitch_Title
source: Command line switch is not yet implemented
cs: Přepínač příkazového řádku zatím není implementovaný.
de: Der Befehlszeilenschalter wurde noch nicht implementiert.
es: El switch de la línea de comandos aún no está implementado
fr: Le commutateur de ligne de commande n’est pas encore implémenté
it: L'opzione della riga di comando non è ancora implementata
ja: コマンド ライン スイッチはまだ実装されていません
ko: 명령줄 스위치가 아직 구현되지 않았습니다.
pl: Przełącznik wiersza polecenia nie jest jeszcze zaimplementowany
pt_br: Opção de linha de comando ainda não implementada
ru: Переключатель командной строки еще не реализован
tr: Komut satırı anahtarı henüz uygulanmadı
zh_hans: 命令行开关尚未实现
zh_hant: 尚未實作命令列參數

# ERR_ArrayInitNoTypeObjectDisallowed
source: Cannot infer an element type, and Option Strict On does not allow 'Object' to be assumed. Specifying the type of the array might correct this error.
cs: Typ elementu nejde odvodit a direktiva Option Strict On nepovoluje předpokládání typu Object. Tuto chybu můžete zkusit odstranit zadáním typu pole.
de: Ein Elementtyp kann nicht abgeleitet werden, und "Option Strict On" lässt die Annahme des Object-Typs nicht zu. Dieser Fehler kann möglicherweise durch die Angabe des Arraytyps korrigiert werden.
es: No se puede realizar inferencia de un tipo de elemento y Option Strict On no permite suponer 'Object'. Especificar el tipo de la matriz podría corregir este error.
fr: Impossible de déduire un type d'élément, et Option Strict On n'autorise pas l'utilisation par défaut de 'Object'. La spécification du type du tableau peut permettre de corriger cette erreur.
it: Non è possibile dedurre un tipo di elemento e Option Strict On non consente di usare 'Object'. Per correggere l'errore, provare a specificare il tipo della matrice.
ja: 要素の型を推論できません。Option Strict On が設定されているため、'Object' と見なすことはできません。配列の型を指定すると、このエラーが修正される可能性があります。
ko: 요소 형식을 유추할 수 없으며 Option Strict On에서 'Object'를 간주할 수 없습니다. 배열의 형식을 지정하면 이 오류를 해결할 수 있습니다.
pl: Nie można wywnioskować typu elementu, a ustawienie Option Strict On nie pozwala przyjąć typu „Object”. Określenie typu tablicy może poprawić ten błąd.
pt_br: Não é possível deduzir um tipo de elemento, e Option Strict On não permite assumir 'Object'. Especificar o tipo da matriz pode corrigir este erro.
ru: Не удается получить тип элемента, параметр Strict On не разрешает предположение "Object". Указание типа массива может исправить эту ошибку.
tr: Öğe türü çıkarsanamıyor ve Option Strict On, 'Object' varsayımına izin vermiyor. Dizi türünün belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法推断元素类型，且 Option Strict On 不允许假定 "Object"。指定数组的类型可更正此错误。
zh_hant: 無法推斷項目類型，而且 Option Strict 為 On 則不允許假設為 'Object'。指定陣列類型或許可以改正這項錯誤。

# ERR_ArrayInitNoType
source: Cannot infer an element type. Specifying the type of the array might correct this error.
cs: Typ elementu nejde odvodit. Tuto chybu můžete zkusit odstranit zadáním typu pole.
de: Ein Elementtyp kann nicht abgeleitet werden. Dieser Fehler kann möglicherweise durch die Angabe des Arraytyps korrigiert werden.
es: No se puede realizar inferencia de un tipo de elemento. Especificar el tipo de la matriz podría corregir este error.
fr: Impossible de déduire un type d'élément. La spécification du type de tableau peut permettre de corriger cette erreur.
it: Non è possibile dedurre un tipo di elemento. Per correggere l'errore, provare a specificare il tipo della matrice.
ja: 要素の型を推論できません。配列の型を指定すると、このエラーが修正される可能性があります。
ko: 요소 형식을 유추할 수 없습니다. 배열의 형식을 지정하면 이 오류를 해결할 수 있습니다.
pl: Nie można wywnioskować typu elementu. Określenie typu tablicy może poprawić ten błąd.
pt_br: Não é possível deduzir um tipo de elemento. Tente especificar o tipo da matriz para corrigir este erro.
ru: Не удалось определить тип элемента. Указание типа массива может исправить эту ошибку.
tr: Öğe türü çıkarsanamıyor. Dizi türünün belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法推断元素类型。指定数组的类型可更正此错误。
zh_hant: 無法推斷項目類型。指定陣列類型或許可以改正這項錯誤。

# ERR_ArrayInitTooManyTypesObjectDisallowed
source: Cannot infer an element type because more than one type is possible. Specifying the type of the array might correct this error.
cs: Typ elementu nejde odvodit, protože je možný víc než jeden typ. Tuto chybu můžete zkusit opravit určením typu pole.
de: Es kann kein Elementtyp abgeleitet werden, weil mehrere Typen möglich sind. Sie können diesen Fehler möglicherweise beheben, indem Sie den Typ des Arrays angeben.
es: No se puede realizar inferencia de un tipo de elemento porque es posible más de un tipo. Especificar el tipo de la matriz podría corregir este error.
fr: Impossible de déduire un type d'élément, car plusieurs types sont possibles. La spécification du type du tableau peut permettre de corriger cette erreur.
it: Non è possibile dedurre un tipo di elemento perché sono possibili più tipi. Per correggere l'errore, provare a specificare il tipo della matrice.
ja: 複数の型が考えられるため、要素の型を推論できません。配列の型を指定すると、このエラーが修正される可能性があります。
ko: 두 개 이상의 형식이 가능하므로 요소 형식을 유추할 수 없습니다. 배열의 형식을 지정하면 이 오류를 해결할 수 있습니다.
pl: Nie można wywnioskować typu elementu, ponieważ jest możliwy więcej niż jeden typ. Określenie typu tablicy może poprawić ten błąd.
pt_br: Não é possível deduzir um tipo de elemento porque mais de um tipo é possível. Especificar o tipo da matriz pode corrigir este erro.
ru: Не удается получить тип элемента, так как возможно больше одного типа. Указание типа массива может исправить эту ошибку.
tr: Birden fazla tür olası olduğu için öğe türü çıkarsanamıyor. Dizi türünün belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法推断元素类型，因为可能存在多个类型。指定数组的类型可更正此错误。
zh_hant: 無法推斷項目類型，因為可能有一種以上的類型。指定陣列類型或許可以改正這項錯誤。

# WRN_ArrayInitNoTypeObjectAssumed
source: Cannot infer an element type; 'Object' assumed.
cs: Typ elementu nejde odvodit; předpokládá se typ Object.
de: Es kann kein Elementtyp abgeleitet werden. "Object" wird angenommen.
es: No se puede inferir un tipo de elemento; se supone 'Object'.
fr: Impossible de déduire un type d'élément ; type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo di elemento. Verrà usato 'Object'.
ja: 要素の型を推論できません。'Object' と見なされます。
ko: 요소 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować typu elementu; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo de elemento; 'Object' presumido.
ru: Не удается определить тип элемента; предполагаемый тип — "Object".
tr: Öğe türü çıkarsanamıyor; 'Object' varsayıldı.
zh_hans: 无法推断元素类型；假定为 "Object"。
zh_hant: 無法推斷項目類型; 假設是 'Object'。

# WRN_ArrayInitNoTypeObjectAssumed_Title
source: Cannot infer an element type
cs: Nedá se odvodit typ elementu.
de: Es kann kein Elementtyp abgeleitet werden.
es: No se puede realizar inferencia de un tipo de elemento
fr: Impossible de déduire un type d’élément
it: Non è possibile dedurre un tipo di elemento
ja: 要素の型を推論できません
ko: 요소 형식을 유추할 수 없음
pl: Nie można wywnioskować typu elementu
pt_br: Não é possível inferir um tipo de elemento
ru: Невозможно определить тип элемента
tr: Öğe türü çıkarımı yapılamıyor
zh_hans: 无法推断元素类型
zh_hant: 無法推斷項目類型

# WRN_ArrayInitTooManyTypesObjectAssumed
source: Cannot infer an element type because more than one type is possible; 'Object' assumed.
cs: Typ elementu nejde odvodit, protože je přípustný více než jeden typ; předpokládá se typ Object.
de: Es kann kein Elementtyp abgeleitet werden, weil mehrere Typen möglich sind. "Object" wird angenommen.
es: No se puede inferir un tipo de elemento porque es posible más de un tipo; se supone 'Object'.
fr: Impossible de déduire un type d'élément, car plusieurs types sont possibles. Type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo di elemento perché sono possibili più tipi. Verrà usato 'Object'.
ja: 複数の型が考えられるため、要素の型を推論できません。'Object' と見なされます。
ko: 두 개 이상의 형식이 가능하므로 요소 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować typu elementu, ponieważ jest możliwy więcej niż jeden typ; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo de elemento porque mais de um é possível; 'Object' presumido.
ru: Не удается получить тип элемента, так как возможно больше одного типа: предполагается "Object".
tr: Birden fazla tür olasılığı olduğu için öğe türü çıkarsanamıyor; 'Object' varsayıldı.
zh_hans: 无法推断元素类型，因为可能存在多个类型；假定为 "Object"。
zh_hant: 無法推斷項目類型，因為可能有一種以上的類型; 假設是 'Object'。

# WRN_ArrayInitTooManyTypesObjectAssumed_Title
source: Cannot infer an element type because more than one type is possible
cs: Nedá se odvodit typ elementu, protože je možný víc než jeden typ.
de: Es kann kein Elementtyp abgeleitet werden, da mehrere Typen möglich sind.
es: No se puede realizar inferencia de un tipo de elemento porque es posible más de un tipo
fr: Impossible de déduire un type d’élément car plusieurs types sont possibles
it: Non è possibile dedurre un tipo di elemento perché sono possibili più tipi
ja: 複数の型が考えられるため、要素の型を推論できません
ko: 두 개 이상의 형식이 가능하므로 요소 형식을 유추할 수 없음
pl: Nie można wywnioskować typu elementu, ponieważ możliwe jest użycie więcej niż jednego typu
pt_br: Não é possível inferir um tipo de elemento porque mais de um tipo é possível
ru: Невозможно определить тип элемента, так как возможно больше одного типа
tr: Birden fazla tür mümkün olduğu için öğe türü çıkarımı yapılamıyor
zh_hans: 无法推断元素类型，原因是可能存在多个类型
zh_hant: 無法推斷項目類型，因為可能的類型不止一種

# WRN_TypeInferenceAssumed3
source: Data type of '{0}' in '{1}' could not be inferred. '{2}' assumed.
cs: Datový typ {0} v {1} se nedal odvodit. Předpokládá se typ {2}.
de: Der Datentyp von "{0}" in "{1}" konnte nicht abgeleitet werden. "{2}" wird angenommen.
es: No se pudo inferir el tipo de datos de '{0}' en '{1}'. Se supone '{2}'.
fr: Impossible de déduire le type de données de '{0}' dans '{1}'. '{2}' pris par défaut.
it: Non è possibile dedurre il tipo di dati di '{0}' in {1}. Verrà usato '{2}'.
ja: '{1}' 内にある '{0}' のデータ型を推論できませんでした。'{2}' と見なされます。
ko: '{1}'에 있는 '{0}'의 데이터 형식을 유추할 수 없습니다. '{2}'(으)로 간주합니다.
pl: Nie można wywnioskować typu danych „{0}” w „{1}”. Przyjęto „{2}”.
pt_br: Tipo de dados de "{0}" em "{1}" não poderia ser inferido. "{2}" assumido.
ru: Не удалось получить тип данных "{0}" в "{1}". "{2}" предполагается.
tr: '{1}' içinde '{0}' veri türü çıkarsanamadı. '{2}' varsayıldı.
zh_hans: 未能推断“{1}”中“{0}”的数据类型。假定为“{2}”。
zh_hant: 無法推斷 '{1}' 中 '{0}' 的資料類型。已假設是 '{2}'。

# WRN_TypeInferenceAssumed3_Title
source: Data type could not be inferred
cs: Nedal se odvodit datový typ.
de: Der Datentyp konnte nicht abgeleitet werden.
es: El tipo de datos no se puede inferir
fr: Le type de données n’a pas pu être déduit
it: Non è possibile dedurre il tipo di dati
ja: データ型を推論できませんでした
ko: 데이터 형식을 유추할 수 없음
pl: Nie można wywnioskować typu danych
pt_br: Não foi possível inferir o tipo de dados
ru: Не удалось определить тип данных
tr: Veri türü çıkarsanamadı
zh_hans: 无法推断数据类型
zh_hant: 無法推斷資料類型

# ERR_AmbiguousCastConversion2
source: Option Strict On does not allow implicit conversions from '{0}' to '{1}' because the conversion is ambiguous.
cs: Direktiva Option Strict On neumožňuje implicitní převod z {0} na {1}, protože převod není jednoznačný.
de: "Option Strict On" lässt implizite Konvertierungen von "{0}" in "{1}" nicht zu, da die Konvertierung mehrdeutig ist.
es: Option Strict On no permite conversiones implícitas de '{0}' a '{1}' porque la conversión es ambigua.
fr: Option Strict On n'autorise pas les conversions implicites de '{0}' en '{1}', car la conversion est ambiguë.
it: Option Strict On non consente conversioni implicite da '{0}' a '{1}' perché la conversione è ambigua.
ja: 変換があいまいなため、Option Strict On では '{0}' から '{1}' への暗黙的な変換が許可されません。
ko: 변환이 모호하므로 Option Strict On에서는 '{0}'에서 '{1}'(으)로 암시적으로 변환할 수 없습니다.
pl: Ustawienie Option Strict On nie zezwala na niejawne konwersje z elementu „{0}” na „{1}”, ponieważ konwersja jest niejednoznaczna.
pt_br: Opção Strict On não permite conversões implícitas de "{0}" para "{1}" porque a conversão é ambígua.
ru: Параметр Strict On не допускает неявные преобразования из "{0}" в "{1}", поскольку такое преобразование неоднозначно.
tr: Option Strict On, dönüşüm belirsiz olduğu için '{0}' ile '{1}' arasında örtük dönüşümlere izin vermez.
zh_hans: Option Strict 不允许进行“{0}”到“{1}”的隐式转换，因为转换不明确。
zh_hant: Option Strict 為 On 時，不可從 '{0}' 隱含轉換至 '{1}'，因為轉換模稜兩可。

# WRN_AmbiguousCastConversion2
source: Conversion from '{0}' to '{1}' may be ambiguous.
cs: Převod z {0} na {1} je možná nejednoznačný.
de: Die Konvertierung von "{0}" in "{1}" ist möglicherweise mehrdeutig.
es: La conversión de '{0}' a '{1}' puede ser ambigua.
fr: La conversion de '{0}' en '{1}' peut être ambiguë.
it: La conversione da '{0}' a '{1}' potrebbe essere ambigua.
ja: '{0}' から '{1}' への変換はあいまいな可能性があります。
ko: '{0}'에서 '{1}'(으)로의 변환이 모호할 수 있습니다.
pl: Konwersja z „{0}” na „{1}” może być niejednoznaczna.
pt_br: Conversão de "{0}" para "{1}" pode ser ambígua.
ru: Преобразование "{0}" в "{1}" может привести к неоднозначности.
tr: '{0}' - '{1}' dönüştürmesi belirsiz olabilir.
zh_hans: 从“{0}”到“{1}”的转换可能不明确。
zh_hant: 從 '{0}' 至 '{1}' 的轉換可能模稜兩可。

# WRN_AmbiguousCastConversion2_Title
source: Conversion may be ambiguous
cs: Převod může být nejednoznačný.
de: Die Konvertierung ist möglicherweise mehrdeutig.
es: La conversión puede ser ambigua
fr: La conversion est peut-être ambiguë
it: La conversione potrebbe essere ambigua
ja: 変換があいまいな可能性があります
ko: 변환이 모호할 수 있음
pl: Konwersja może być niejednoznaczna
pt_br: A conversão pode ser ambígua
ru: Преобразование может быть неоднозначным
tr: Dönüştürme belirsiz olabilir
zh_hans: 转换可能不明确
zh_hant: 轉換可能模稜兩可

# ERR_VarianceIEnumerableSuggestion3
source: '{0}' cannot be converted to '{1}'. Consider using '{2}' instead.
cs: '{0} není možno převést na {1}. Místo toho zvažte použití {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Verwenden Sie stattdessen "{2}".
es: '{0}' no se puede convertir en '{1}'. En su lugar, puede usar '{2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Utilisez '{2}' à la place.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a usare '{2}'.
ja: '{0}' を '{1}' に変換できません。'{2}' の使用を検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. 대신 '{2}'을(를) 사용하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ użycie zamiast tego elementu „{2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Ao invés disso, considere o uso de "{2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте использовать "{2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. Bunun yerine '{2}' kullanabilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑改用“{2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮改用 '{2}'。

# WRN_VarianceIEnumerableSuggestion3
source: '{0}' cannot be converted to '{1}'. Consider using '{2}' instead.
cs: '{0} není možno převést na {1}. Místo toho zvažte použití {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Verwenden Sie stattdessen "{2}".
es: '{0}' no se puede convertir en '{1}'. En su lugar, puede usar '{2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Utilisez '{2}' à la place.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a usare '{2}'.
ja: '{0}' を '{1}' に変換できません。'{2}' の使用を検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. 대신 '{2}'을(를) 사용하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ użycie zamiast tego elementu „{2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Ao invés disso, considere o uso de "{2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте использовать "{2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. Bunun yerine '{2}' kullanabilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑改用“{2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮改用 '{2}'。

# WRN_VarianceIEnumerableSuggestion3_Title
source: Type cannot be converted to target collection type
cs: Typ se nedá převést na cílový typ kolekce.
de: Der Typ kann nicht in den Zielsammlungstyp konvertiert werden.
es: El tipo no se puede convertir a un tipo de colección de destino
fr: Le type ne peut pas être converti en type de collection cible
it: Non è possibile convertire il tipo nel tipo di raccolta di destinazione
ja: 型を、対象のコレクション型に変換できません
ko: 형식을 대상 컬렉션 형식으로 변환할 수 없음
pl: Nie można przekonwertować typu na docelowy typ kolekcji
pt_br: O tipo não pode ser convertido para o tipo de coleção de destino
ru: Невозможно преобразовать тип в целевой тип коллекции
tr: Tür, hedef koleksiyon türüne dönüştürülemiyor
zh_hans: 无法将类型转换为目标集合类型
zh_hant: 無法將類型轉換成目標集合類型

# ERR_VarianceConversionFailedIn6
source: '{4}' cannot be converted to '{5}' because '{0}' is not derived from '{1}', as required for the 'In' generic parameter '{2}' in '{3}'.
cs: '{4} není možno převést na {5}, protože {0} není odvozené z {1}, jak se vyžaduje pro obecný parametr In {2} v {3}.
de: '"{4}" kann nicht in "{5}" konvertiert werden, weil "{0}" nicht von "{1}" abgeleitet wird, wie dies für den generischen In-Parameter "{2}" in "{3}" erforderlich ist.
es: '{4}' no se puede convertir en '{5}' porque '{0}' no se deriva de '{1}', como se requiere para el parámetro genérico 'In' '{2}' en '{3}'.
fr: 'Impossible de convertir '{4}' en '{5}', car '{0}' n'est pas dérivé de '{1}', comme le requiert le paramètre générique 'In' '{2}' dans '{3}'.
it: 'Non è possibile convertire '{4}' in '{5}' perché '{0}' non è derivato da '{1}' come richiesto dal parametro generico 'In' '{2}' in '{3}'.
ja: '{3}' の 'In' ジェネリック パラメーター '{2}' に対しては '{0}' が '{1}' から派生する必要がありますが、派生していないため、'{4}' を '{5}' に変換することはできません。
ko: '{3}'에 있는 'In' 제네릭 매개 변수 '{2}'에 필요한 대로 '{0}'이(가) '{1}'에서 파생되지 않았으므로 '{4}'을(를) '{5}'(으)로 변환할 수 없습니다.
pl: 'Element „{4}” nie może zostać skonwertowany na „{5}”, ponieważ element „{0}” nie dziedziczy od „{1}”, co jest wymagane dla parametru ogólnego „In” „{2}” w „{3}”.
pt_br: "{4}" não pode ser convertido em "{5}" porque "{0}" não é derivado de "{1}", conforme necessário para o parâmetro genérico "In" "{2}" em "{3}".
ru: "{4}" нельзя преобразовать в "{5}", так как "{0}" не наследованы из "{1}" в соответствии с требованием универсального параметра "In" "{2}" в "{3}".
tr: '{3}' içindeki '{2}' 'In' genel parametresinin gerektirdiği gibi '{0}' '{1}' öğesinden türetilmediği için, '{4}' - '{5}' dönüştürmesi yapılamıyor.
zh_hans: '“{4}”不能转换为“{5}”，因为根据“{3}”中“In”泛型形参“{2}”的需要，“{0}”不是从“{1}”派生的。
zh_hant: '{4}' 無法轉換成 '{5}'，因為依 '{3}' 中 'In' 泛型參數 '{2}' 的需求，'{0}' 並非衍生自 '{1}'。

# ERR_VarianceConversionFailedOut6
source: '{4}' cannot be converted to '{5}' because '{0}' is not derived from '{1}', as required for the 'Out' generic parameter '{2}' in '{3}'.
cs: '{4} není možno převést na {5}, protože {0} není odvozené z {1}, jak se vyžaduje pro obecný parametr Out {2} v {3}.
de: '"{4}" kann nicht in "{5}" konvertiert werden, weil "{0}" nicht von "{1}" abgeleitet wird, wie dies für den generischen Out-Parameter "{2}" in "{3}" erforderlich ist.
es: '{4}' no se puede convertir en '{5}' porque '{0}' no se deriva de '{1}', como se requiere para el parámetro genérico 'Out' '{2}' en '{3}'.
fr: 'Impossible de convertir '{4}' en '{5}', car '{0}' n'est pas dérivé de '{1}', comme le requiert le paramètre générique 'Out' '{2}' dans '{3}'.
it: 'Non è possibile convertire '{4}' in '{5}' perché '{0}' non è derivato da '{1}' come richiesto dal parametro generico 'Out' '{2}' in '{3}'.
ja: '{3}' の 'Out' ジェネリック パラメーター '{2}' に対しては '{0}' が '{1}' から派生する必要がありますが、派生していないため、'{4}' を '{5}' に変換することはできません。
ko: '{3}'에 있는 'Out' 제네릭 매개 변수 '{2}'에 필요한 대로 '{0}'이(가) '{1}'에서 파생되지 않았으므로 '{4}'을(를) '{5}'(으)로 변환할 수 없습니다.
pl: 'Element „{4}” nie może zostać skonwertowany na „{5}”, ponieważ element „{0}” nie dziedziczy od „{1}”, co jest wymagane dla parametru ogólnego „Out” „{2}” w „{3}”.
pt_br: "{4}" não pode ser convertido em "{5}" porque "{0}" não é derivado de "{1}", conforme necessário para o parâmetro genérico "Out" "{2}" em "{3}".
ru: '{4}" нельзя преобразовать в "{5}", так как "{0}" не наследованы из "{1}" в соответствии с требованием универсального параметра "Out" "{2}" в "{3}".
tr: '{3}' içindeki '{2}' 'Out' genel parametresinin gerektirdiği gibi '{0}' '{1}' öğesinden türetilmediği için, '{4}' - '{5}' dönüştürmesi yapılamıyor.
zh_hans: '“{4}”不能转换为“{5}”，因为根据“{3}”中“Out”泛型形参“{2}”的需要，“{0}”不是从“{1}”派生的。
zh_hant: '{4}' 無法轉換成 '{5}'，因為依 '{3}' 中 'Out' 泛型參數 '{2}' 的需求，'{0}' 並非衍生自 '{1}'。
