Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_VarianceOutNullableDisallowed2
source: Type '{0}' cannot be used in '{1}' because 'In' and 'Out' type parameters cannot be made nullable, and '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde použít v {1}, protože parametry typu In a Out nejde změnit na parametry připouštějící hodnotu Null a {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht in "{1}" verwendet werden, weil Parameter vom Typ "In" und "Out" nicht in Typen umgewandelt werden können, die NULL-Werte zulassen, und "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' en '{1}' porque no se puede hacer que los parámetros de tipo 'In' y 'Out' acepten valores NULL, y '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' dans '{1}', car les paramètres de type 'In' et 'Out' ne peuvent pas être rendus Nullable et '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' in '{1}' perché i parametri di tipo 'In' e 'Out' non possono essere resi nullable e '{0}' è un parametro di tipo 'Out'.
ja: 型 '{0}' は '{1}' 内では使用できません。'{0}' は 'Out' 型のパラメーターですが、'In' および 'Out' 型のパラメーターは Null 許容型にはできません。
ko: In' 및 'Out' 형식 매개 변수를 null 허용 형식으로 만들 수 없고 '{0}'이(가) 'Out' 형식 매개 변수이므로, '{0}' 형식을 '{1}'에 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany w elemencie „{1}”, ponieważ parametry typu „In” i „Out” nie mogą dopuszczać wartości null, a „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado em "{1}" porque parâmetros de tipo "In" e "Out" não podem ser tornados anuláveis e "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться в "{1}", так как параметры "In" и "Out" не допускают значение Null и "{0}" является параметром типа "Out".
tr: 'In' ve 'Out' tür parametreleri null yapılabilir duruma getirilemediğinden ve '{0}' bir 'Out' tür parametresi olduğundan, '{0}' türü '{1}' içinde kullanılamaz.
zh_hans: 类型“{0}”不能用于“{1}”，因为“In”和“Out”类型参数不能设置为可以为 null，并且“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 無法用於 '{1}'，因為 'In' 和 'Out' 類型參數不能變成可為 Null，且 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutParamDisallowed1
source: Type '{0}' cannot be used in this context because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde v tomto kontextu použít, protože {0} je parametrem typu Out.
de: Der Typ "{0}" kann nicht in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' en este contexto porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' dans ce contexte, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' in questo contesto perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、このコンテキストでは型 '{0}' を使用できません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty w tym kontekście, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado neste contexto porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться в этом контексте, так как "{0}" является параметром "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, bu bağlamda '{0}' türü kullanılamaz.
zh_hans: 类型“{0}”不能用于此上下文，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 無法用於此內容中，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutParamDisallowedForGeneric3
source: Type '{0}' cannot be used for the '{1}' in '{2}' in this context because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde v tomto kontextu použít pro {1} v {2}, protože {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht für "{1}" in "{2}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' para el '{1}' de '{2}' en este contexto porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' pour le '{1}' dans '{2}' dans ce contexte, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' per '{1} in '{2}' in questo contesto perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、このコンテキストで '{2}' の '{1}' に対して型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{2}'에 있는 '{1}'에는 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty dla elementu „{1}” w „{2}” w tym kontekście, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado para o "{1}" em "{2}" neste contexto porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться для "{1}" в "{2}" в этом контексте, так как "{0}" является параметром "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, bu bağlamda '{2}' içindeki '{1}' için '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{2}”中的“{1}”，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{2}' 中的 '{1}'，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutParamDisallowedHere2
source: Type '{0}' cannot be used in '{1}' in this context because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde v tomto kontextu použít v {1}, protože {0} je parametrem typu Out.
de: Der Typ "{0}" kann nicht in "{1}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' en '{1}' en este contexto porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' dans '{1}' dans ce contexte, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' in '{1}' in questo contesto perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、このコンテキストの '{1}' で型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{1}'에 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty w elemencie „{1}” w tym kontekście, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado em "{1}" neste contexto porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться в "{1}" в этом контексте, так как "{0}" является параметром "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, bu bağlamda '{1}' içinde '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{1}”，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{1}'，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutParamDisallowedHereForGeneric4
source: Type '{0}' cannot be used for the '{2}' of '{3}' in '{1}' in this context because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde v tomto kontextu použít pro {2} – {3} v {1}, protože {0} je parametrem typu Out.
de: Der Typ "{0}" kann nicht für "{2}" von "{3}" in "{1}" in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' para el '{2}' de '{3}' en '{1}' en este contexto porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' pour le '{2}' de '{3}' dans '{1}' dans ce contexte, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' per '{2}' di '{3}' in '{1}' in questo contesto perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、このコンテキストで '{1}' 内の '{3}' の '{2}' に対して型 '{0}' を使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 이 컨텍스트에서 '{1}'에 있는 '{3}'의 '{2}'에는 사용할 수 없습니다.
pl: Typ „{0}” nie może zostać użyty dla elementu „{2}” należącego do elementu „{3}” w „{1}” w tym kontekście, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado para o "{2}" de "{3}" em "{1}" neste contexto porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может использоваться для "{2}" "{3}" в "{1}" в этом контексте, так как "{0}" является параметром "Out".
tr: '{0}' bir 'Out' tür parametresi olduğundan, bu bağlamda '{1}' içinde '{2}' / '{3}' için '{0}' türü kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用于“{1}”中“{3}”的“{2}”，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{1}' 中 '{3}' 的 '{2}'，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceOutPropertyDisallowed1
source: Type '{0}' cannot be used as a property type in this context because '{0}' is an 'Out' type parameter and the property is not marked ReadOnly.
cs: Typ {0} nejde v tomto kontextu použít jako typ vlastnosti, protože {0} je parametr typu Out a vlastnost není označená ReadOnly.
de: Der Typ "{0}" kann nicht als Eigenschaftentyp in diesem Kontext verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist und die Eigenschaft nicht als "ReadOnly" markiert ist.
es: No se puede usar el tipo '{0}' como un tipo de propiedad en este contexto porque '{0}' es un parámetro de tipo 'Out' y la propiedad no está marcada como ReadOnly.
fr: Impossible d'utiliser le type '{0}' en tant que type de propriété dans ce contexte, car '{0}' est un paramètre de type 'Out' et la propriété n'est pas marquée ReadOnly.
it: Non è possibile usare il tipo '{0}' come tipo di proprietà in questo contesto perché '{0}' è un parametro di tipo 'Out' e la proprietà non è contrassegnata come ReadOnly.
ja: '{0}' は 'Out' 型パラメーターであり、プロパティは ReadOnly として指定されていないため、このコンテキストでは型 '{0}' をプロパティ型として使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이고 속성이 ReadOnly로 표시되어 있지 않으므로, '{0}' 형식을 이 컨텍스트에서 속성 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako typ właściwości w tym kontekście, ponieważ „{0}” jest parametrem typu „Out”, a ta właściwość nie jest oznaczona jako ReadOnly.
pt_br: Tipo "{0}" não pode ser usado como um tipo de propriedade neste contexto porque "{0}" é um parâmetro de tipo "Out" e a propriedade não é marcada como ReadOnly.
ru: Тип "{0}" не может быть использован в качестве типа свойства в данном контексте, так как "{0}" является параметром типа "Out" и свойство не помечено как ReadOnly.
tr: '{0}' bir 'Out' türü parametre olduğundan ve özellik ReadOnly olarak işaretlenmediğinden, '{0}' türü bu bağlamda özellik türü olarak kullanılamaz.
zh_hans: 在此上下文中，类型“{0}”不能用作属性类型，因为“{0}”是“Out”类型参数，且该属性未标记为 ReadOnly。
zh_hant: 類型 '{0}' 在此內容中不能用做為屬性類型，因為 '{0}' 是 'Out' 類型參數，且屬性未標記為 ReadOnly。

# ERR_VarianceOutWriteOnlyPropertyDisallowed1
source: Type '{0}' cannot be used as a WriteOnly property type because '{0}' is an 'Out' type parameter.
cs: Typ {0} nejde použít jako typ vlastnosti WriteOnly, protože {0} je parametr typu Out.
de: Der Typ "{0}" kann nicht als WriteOnly-Eigenschaftentyp verwendet werden, weil "{0}" ein Parameter vom Typ "Out" ist.
es: No se puede usar el tipo '{0}' como un tipo de propiedad WriteOnly porque '{0}' es un parámetro de tipo 'Out'.
fr: Impossible d'utiliser le type '{0}' en tant que type de propriété WriteOnly, car '{0}' est un paramètre de type 'Out'.
it: Non è possibile usare il tipo '{0}' come tipo di proprietà WriteOnly perché '{0}' è un parametro di tipo 'Out'.
ja: '{0}' は 'Out' 型パラメーターであるため、型 '{0}' を WriteOnly プロパティ型として使用することはできません。
ko: '{0}'이(가) 'Out' 형식 매개 변수이므로 '{0}' 형식을 WriteOnly 속성 형식으로 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany jako typ właściwości WriteOnly, ponieważ „{0}” jest parametrem typu „Out”.
pt_br: Tipo "{0}" não pode ser usado como tipo de propriedade WriteOnly porque "{0}" é um parâmetro de tipo "Out".
ru: Тип "{0}" не может быть использован в качестве типа свойства WriteOnly, так как "{0}" является параметром типа "Out".
tr: '{0}' bir 'Out' türü parametre olduğundan, '{0}' bir WriteOnly özellik türü olarak kullanılamaz.
zh_hans: 类型“{0}”不能用作 WriteOnly 属性类型，因为“{0}”是“Out”类型参数。
zh_hant: 類型 '{0}' 不能用做為 WriteOnly 屬性類型，因為 '{0}' 是 'Out' 類型參數。

# ERR_VarianceTypeDisallowed2
source: Type '{0}' cannot be used in this context because both the context and the definition of '{0}' are nested within interface '{1}', and '{1}' has 'In' or 'Out' type parameters. Consider moving the definition of '{0}' outside of '{1}'.
cs: Typ {0} nejde v tomto kontextu použít, protože jak kontext, tak definice {0} jsou vnořené uvnitř rozhraní {1}, které má parametry typu In nebo Out. Zvažte přesunutí definice {0} mimo {1}.
de: Der Typ "{0}" kann nicht in diesem Kontext verwendet werden, weil der Kontext und die Definition von "{0}" in der Schnittstelle "{1}" geschachtelt sind und "{1}" Parameter vom Typ "In" oder "Out" enthält. Verschieben Sie die Definition von "{0}" aus "{1}" heraus.
es: No se puede usar el tipo '{0}' en este contexto porque tanto el contexto como la definición de '{0}' están anidados en la interfaz '{1}', y '{1}' tiene parámetros de tipo 'In' o 'Out'. Puede mover la definición de '{0}' fuera de '{1}'.
fr: Impossible d'utiliser le type '{0}' dans ce contexte, car le contexte et la définition de '{0}' sont tous les deux imbriqués dans l'interface '{1}', et '{1}' a des paramètres de type 'In' ou 'Out'. Déplacez la définition de '{0}' en dehors de '{1}'.
it: Non è possibile usare il tipo '{0}' in questo contesto perché sia il contesto che la definizione di '{0}' sono annidati nell'interfaccia '{1}' e '{1}' dispone dei parametri di tipo 'In' o 'Out'. Provare a spostare la definizione di '{0}' all'esterno di '{1}'.
ja: このコンテキストでは型 '{0}' を使用できません。'{0}' のコンテキストと定義は両方ともインターフェイス '{1}' の中に入れ子にされていますが、'{1}' は 'In' または 'Out' 型のパラメーターです。'{0}' の定義を '{1}' の外側に移動することを検討してください。
ko: '{0}'의 컨텍스트와 정의가 모두 '{1}' 인터페이스 안에 중첩되어 있고 '{1}'에 'In' 또는 'Out' 형식 매개 변수가 있으므로, '{0}' 형식을 이 컨텍스트에서 사용할 수 없습니다. '{0}'의 정의를 '{1}' 외부로 이동하세요.
pl: Typ „{0}” nie może zostać użyty w tym kontekście, ponieważ zarówno kontekst, jak i definicja „{0}” są zagnieżdżone w obrębie interfejsu „{1}”, a „{1}” ma parametry typu „In” lub „Out”. Rozważ przeniesienie definicji „{0}” poza interfejs „{1}”.
pt_br: Tipo "{0}" não pode ser usado neste contexto porque o contexto e a definição de "{0}" são aninhados na interface "{1}" e "{1}" tem parâmetros de tipo "In" ou "Out". Considere mover a definição de "{0}" para fora de "{1}".
ru: Тип "{0}" не может использоваться в этом контексте, так как контекст и определение "{0}" вложены в интерфейс "{1}" и "{1}" имеют параметры "In" или "Out". Попробуйте переместить определение "{0}" за пределы "{1}".
tr: '{0}' türünün hem bağlamı hem de tanımı '{1}' arabiriminde iç içe yer aldığından ve '{1}' arabiriminin 'In' veya 'Out' türü parametreleri olduğundan, '{0}' türü bu bağlamda kullanılamaz. '{0}' tanımını '{1}' arabiriminin dışına taşıyabilirsiniz.
zh_hans: 类型“{0}”不能用于此上下文，因为此上下文和“{0}”的定义均嵌套在接口“{1}”内，而“{1}”含有“In”或“Out”类型参数。考虑将“{0}”的定义移出“{1}”。
zh_hant: 類型 '{0}' 無法用於此內容中，因為該內容和 '{0}' 的定義都位於介面 '{1}' 的巢狀內，且 '{1}' 具有 'In' 或 'Out' 類型參數。請考慮將 '{0}' 的定義移到 '{1}' 之外。

# ERR_VarianceTypeDisallowedForGeneric4
source: Type '{0}' cannot be used for the '{2}' in '{3}' in this context because both the context and the definition of '{0}' are nested within interface '{1}', and '{1}' has 'In' or 'Out' type parameters. Consider moving the definition of '{0}' outside of '{1}'.
cs: Typ {0} nejde v tomto kontextu použít pro {2} v {3}, protože jak kontext, tak definice {0} jsou vnořené uvnitř rozhraní {1}, které má parametry typu In nebo Out. Zvažte přesunutí definice {0} mimo {1}.
de: Der Typ "{0}" kann nicht für "{2}" in "{3}" in diesem Kontext verwendet werden, weil der Kontext und die Definition von "{0}" in der Schnittstelle "{1}" geschachtelt sind und "{1}" Parameter vom Typ "In" oder "Out" enthält. Verschieben Sie die Definition von "{0}" aus "{1}" heraus.
es: No se puede usar el tipo '{0}' para el '{2}' de '{3}' en este contexto porque tanto el contexto como la definición de '{0}' están anidados en la interfaz '{1}', y '{1}' tiene parámetros de tipo 'In' o 'Out'. Puede mover la definición de '{0}' fuera de '{1}'.
fr: Impossible d'utiliser le type '{0}' pour le '{2}' dans '{3}' dans ce contexte, car le contexte et la définition de '{0}' sont tous les deux imbriqués dans l'interface '{1}', et '{1}' a des paramètres de type 'In' ou 'Out'. Déplacez la définition de '{0}' en dehors de '{1}'.
it: Non è possibile usare il tipo '{0}' per '{2}' in '{3}' in questo contesto perché sia il contesto che la definizione di '{0}' sono annidati nell'interfaccia '{1}' e '{1}' dispone dei parametri di tipo 'In' o 'Out'. Provare a spostare la definizione di '{0}' all'esterno di '{1}'.
ja: このコンテキストでは、'{3}' 内の '{2}' に型 '{0}' を使用することはできません。'{0}' のコンテキストと定義は両方ともインターフェイス '{1}' の中に入れ子にされていますが、'{1}' は 'In' または 'Out' 型のパラメーターです。'{0}' の定義を '{1}' の外側に移動することを検討してください。
ko: '{0}'의 컨텍스트와 정의가 모두 '{1}' 인터페이스 안에 중첩되어 있고 '{1}'에 'In' 또는 'Out' 형식 매개 변수가 있으므로, '{0}' 형식을 이 컨텍스트에서 '{3}'에 있는 '{2}'에 대해 사용할 수 없습니다. '{0}'의 정의를 '{1}' 외부로 이동하세요.
pl: Typ „{0}” nie może zostać użyty dla elementu „{2}” w „{3}” w tym kontekście, ponieważ zarówno kontekst, jak i definicja elementu „{0}” są zagnieżdżone w obrębie interfejsu „{1}”, a „{1}” ma parametry typu „In” lub „Out”. Rozważ przeniesienie definicji „{0}” poza interfejs „{1}”.
pt_br: Tipo "{0}" não pode ser usado para o "{2}" em "{3}" neste contexto porque o contexto e a definição de "{0}" são aninhados na interface "{1}" e "{1}" tem parâmetros de tipo "In" ou "Out". Considere mover a definição de "{0}" para fora de "{1}".
ru: Тип "{0}" не может использоваться для "{2}" в "{3}" в этом контексте, так как контекст и определение "{0}" вложены в интерфейс "{1}" и "{1}" имеют параметры "In" или "Out". Попробуйте переместить определение "{0}" за пределы "{1}".
tr: '{0}' türünün hem bağlamı hem de tanımı '{1}' arabiriminde iç içe yer aldığından ve '{1}' arabiriminin 'In' veya 'Out' türü parametreleri olduğundan, '{0}' türü bu bağlamda '{3}' içinde '{2}' için kullanılamaz. '{0}' tanımını '{1}' arabiriminin dışına taşıyabilirsiniz.
zh_hans: 类型“{0}”不能在此上下文中用于“{3}”中的“{2}”，因为此上下文和“{0}”的定义均嵌套在接口“{1}”内，而“{1}”含有“In”或“Out”类型参数。考虑将“{0}”的定义移出“{1}”。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{3}' 中之 '{2}'，因為該內容和 '{0}' 的定義都位於介面 '{1}' 的巢狀內，且 '{1}' 具有 'In' 或 'Out' 類型參數。請考慮將 '{0}' 的定義移到 '{1}' 之外。

# ERR_VarianceTypeDisallowedHere3
source: Type '{0}' cannot be used in '{2}' in this context because both the context and the definition of '{0}' are nested within interface '{1}', and '{1}' has 'In' or 'Out' type parameters. Consider moving the definition of '{0}' outside of '{1}'.
cs: Typ {0} nejde v tomto kontextu použít v {2}, protože jak kontext, tak definice {0} jsou vnořené uvnitř rozhraní {1}, které má parametry typu In nebo Out. Zvažte přesunutí definice {0} mimo {1}.
de: Der Typ "{0}" kann nicht in "{2}" in diesem Kontext verwendet werden, weil der Kontext und die Definition von "{0}" in der Schnittstelle "{1}" geschachtelt sind und "{1}" Parameter vom Typ "In" oder "Out" enthält. Verschieben Sie die Definition von "{0}" aus "{1}" heraus.
es: No se puede usar el tipo '{0}' en '{2}' en este contexto porque tanto el contexto como la definición de '{0}' están anidados en la interfaz '{1}', y '{1}' tiene parámetros de tipo 'In' o 'Out'. Puede mover la definición de '{0}' fuera de '{1}'.
fr: Impossible d'utiliser le type '{0}' dans '{2}' dans ce contexte, car le contexte et la définition de '{0}' sont tous les deux imbriqués dans l'interface '{1}', et '{1}' a des paramètres de type 'In' ou 'Out'. Déplacez la définition de '{0}' en dehors de '{1}'.
it: Non è possibile usare il tipo '{0}' in '{2}' in questo contesto perché sia il contesto che la definizione di '{0}' sono annidati nell'interfaccia '{1}' e '{1}' dispone dei parametri di tipo 'In' o 'Out'. Provare a spostare la definizione di '{0}' all'esterno di '{1}'.
ja: このコンテキストでは、型 '{0}' を '{2}' 内で使用することはできません。'{0}' のコンテキストと定義は両方ともインターフェイス '{1}' の中に入れ子にされていますが、'{1}' は 'In' または 'Out' 型のパラメーターです。'{0}' の定義を '{1}' の外側に移動することを検討してください。
ko: '{0}'의 컨텍스트와 정의가 모두 '{1}' 인터페이스 안에 중첩되어 있고 '{1}'에 'In' 또는 'Out' 형식 매개 변수가 있으므로, '{0}' 형식을 이 컨텍스트에서 '{2}'에 사용할 수 없습니다. '{0}'의 정의를 '{1}' 외부로 이동하세요.
pl: Typ „{0}” nie może zostać użyty w elemencie „{2}” w tym kontekście, ponieważ zarówno kontekst, jak i definicja „{0}” są zagnieżdżone w obrębie interfejsu „{1}”, a „{1}” ma parametry typu „In” lub „Out”. Rozważ przeniesienie definicji „{0}” poza interfejs „{1}”.
pt_br: Tipo "{0}" não pode ser usado em "{2}" neste contexto porque o contexto e a definição de "{0}" são aninhados na interface "{1}" e "{1}" tem parâmetros de tipo "In" ou "Out". Considere mover a definição de "{0}" para fora de "{1}".
ru: Тип "{0}" не может использоваться для "{2}" в этом контексте, так как контекст и определение "{0}" вложены в интерфейс "{1}" и "{1}" имеют параметры "In" или "Out". Попробуйте переместить определение "{0}" за пределы "{1}".
tr: '{0}' türünün hem bağlamı hem de tanımı '{1}' arabiriminde iç içe yer aldığından ve '{1}' arabiriminin 'In' veya 'Out' türü parametreleri olduğundan, '{0}' türü bu bağlamda '{2}' için kullanılamaz. '{0}' tanımını '{1}' arabiriminin dışına taşıyabilirsiniz.
zh_hans: 类型“{0}”不能在此上下文用于“{2}”，因为此上下文和“{0}”的定义均嵌套在接口“{1}”内，而“{1}”含有“In”或“Out”类型参数。考虑将“{0}”的定义移出“{1}”。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{2}'，因為該內容和 '{0}' 的定義都位於介面 '{1}' 的巢狀內，且 '{1}' 具有 'In' 或 'Out' 類型參數。請考慮將 '{0}' 的定義移到 '{1}' 之外。

# ERR_VarianceTypeDisallowedHereForGeneric5
source: Type '{0}' cannot be used for the '{3}' of '{4}' in '{2}' in this context because both the context and the definition of '{0}' are nested within interface '{1}', and '{1}' has 'In' or 'Out' type parameters. Consider moving the definition of '{0}' outside of '{1}'.
cs: Typ {0} nejde v tomto kontextu použít pro {3} – {4} v {2}, protože jak kontext, tak definice {0} jsou vnořené uvnitř rozhraní {1}, které má parametry typu In nebo Out. Zvažte přesunutí definice {0} mimo {1}.
de: Der Typ "{0}" kann nicht für "{3}" von "{4}" in "{2}" in diesem Kontext verwendet werden, weil der Kontext und die Definition von "{0}" in der Schnittstelle "{1}" geschachtelt sind und "{1}" Parameter vom Typ "In" oder "Out" enthält. Verschieben Sie die Definition von "{0}" aus "{1}" heraus.
es: No se puede usar el tipo '{0}' para el '{3}' de '{4}' en '{2}' en este contexto porque tanto el contexto como la definición de '{0}' están anidados en la interfaz '{1}', y '{1}' tiene parámetros de tipo 'In' o 'Out'. Puede mover la definición de '{0}' fuera de '{1}'.
fr: Impossible d'utiliser le type '{0}' pour le '{3}' de '{4}' dans '{2}' dans ce contexte, car le contexte et la définition de '{0}' sont tous les deux imbriqués dans l'interface '{1}', et '{1}' a des paramètres de type 'In' ou 'Out'. Déplacez la définition de '{0}' en dehors de '{1}'.
it: Non è possibile usare il tipo '{0}' per '{3}' di '{4}' in '{2}' in questo contesto perché sia il contesto che la definizione di '{0}' sono annidati nell'interfaccia '{1}' e '{1}' dispone dei parametri di tipo 'In' o 'Out'. Provare a spostare la definizione di '{0}' all'esterno di '{1}'.
ja: このコンテキストでは、'{2}' 内の '{4}' の '{3}' に型 '{0}' を使用することはできません。'{0}' のコンテキストと定義は両方ともインターフェイス '{1}' の中に入れ子にされていますが、'{1}' は 'In' または 'Out' 型のパラメーターです。'{0}' の定義を '{1}' の外側に移動することを検討してください。
ko: '{0}'의 컨텍스트와 정의가 모두 '{1}' 인터페이스 안에 중첩되어 있고 '{1}'에 'In' 또는 'Out' 형식 매개 변수가 있으므로, '{0}' 형식을 이 컨텍스트에서 '{2}'에 있는 '{4}'의 '{3}'에 대해 사용할 수 없습니다. '{0}'의 정의를 '{1}' 외부로 이동하세요.
pl: Typ „{0}” nie może zostać użyty dla elementu „{3}” należącego do elementu „{4}” w „{2}” w tym kontekście, ponieważ zarówno kontekst, jak i definicja „{0}” są zagnieżdżone w obrębie interfejsu „{1}”, a „{1}” ma parametry typu „In” lub „Out”. Rozważ przeniesienie definicji „{0}” poza interfejs „{1}”.
pt_br: Tipo "{0}" não pode ser usado para o "{3}" de "{4}" em "{2}" neste contexto porque o contexto e a definição de "{0}" são aninhados na interface "{1}" e "{1}" tem parâmetros de tipo "In" ou "Out". Considere mover a definição de "{0}" para fora de "{1}".
ru: Тип "{0}" не может использоваться для "{3}" "{4}" в "{2}" в этом контексте, так как контекст и определение "{0}" вложены в интерфейс "{1}" и "{1}" имеют параметры "In" или "Out". Попробуйте переместить определение "{0}" за пределы "{1}".
tr: '{0}' türünün hem bağlamı hem de tanımı '{1}' arabiriminde iç içe yer aldığından ve '{1}' arabiriminin 'In' veya 'Out' türü parametreleri olduğundan, '{0}' türü bu bağlamda '{2}' içinde '{4}' öğesindeki '{3}' için kullanılamaz. '{0}' tanımını '{1}' arabiriminin dışına taşıyabilirsiniz.
zh_hans: 类型“{0}”不能在此上下文中用于“{2}”中“{4}”的“{3}”，因为此上下文和“{0}”的定义均嵌套在接口“{1}”内，而“{1}”含有“In”或“Out”类型参数。考虑将“{0}”的定义移出“{1}”。
zh_hant: 類型 '{0}' 在此內容中無法用於 '{2}' 中 '{4}' 的 '{3}'，因為該內容和 '{0}' 的定義都位於介面 '{1}' 的巢狀內，且 '{1}' 具有 'In' 或 'Out' 類型參數。請考慮將 '{0}' 的定義移到 '{1}' 之外。
