Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RestrictedAccess
source: Expression has the type '{0}' which is a restricted type and cannot be used to access members inherited from 'Object' or 'ValueType'.
cs: Výraz má typ {0}, což je omezený typ a nejde ho používat pro přistupující členy zděděné z typu Object nebo ValueType.
de: Der Ausdruck weist den Typ "{0}" auf, einen eingeschränkten Typ, der nicht verwendet werden kann, um auf von Object oder ValueType geerbte Member zuzugreifen.
es: La expresión tiene el tipo '{0}' que es un tipo restringido y no se puede usar para obtener acceso a miembros heredados de 'Object' o 'ValueType'.
fr: L'expression a le type '{0}', qui est un type restreint et qui ne peut pas être utilisé pour accéder aux membres hérités de 'Object' ou 'ValueType'.
it: Il tipo '{0}' dell'espressione è limitato e non può essere usato per accedere ai membri ereditati da 'Object' o 'ValueType'.
ja: 式の型 '{0}' は制限のある型であるため、'Object' または 'ValueType' から継承されたメンバーへのアクセスに使用することはできません。
ko: 식에 있는 '{0}' 형식은 제한된 형식이므로 'Object' 또는 'ValueType'에서 상속된 멤버에 액세스하는 데 사용할 수 없습니다.
pl: Wyrażenie zawiera typ „{0}”, który jest typem ograniczonym i nie można go używać do uzyskiwania dostępu do składowych dziedziczonych po elemencie „Object” lub „ValueType”.
pt_br: Expressão tem o tipo "{0}" que é um tipo restrito e não pode ser usada para acessar membros herdados de "Object" ou "ValueType".
ru: Выражение имеет тип "{0}", который является ограниченным типом и не может использоваться для доступа к членам, унаследованным из "Object" или "ValueType".
tr: İfadenin '{0}' türü kısıtlanmış bir tür ve 'Object' veya 'ValueType' öğesinden devralınan üyelere erişim için kullanılamaz.
zh_hans: 表达式的类型为“{0}”，这是受限类型，不能用于访问从“Object”或“ValueType”继承的成员。
zh_hant: 運算式的類型為 '{0}'，其為受限制的類型且不可用以存取繼承自 'Object' 或 'ValueType' 的成員。

# ERR_RestrictedConversion1
source: Expression of type '{0}' cannot be converted to 'Object' or 'ValueType'.
cs: Výraz typu {0} nejde převést na typ Object nebo ValueType.
de: Ein Ausdruck vom Typ "{0}" kann nicht in Object oder ValueType konvertiert werden.
es: No se puede convertir la expresión de tipo '{0}' en 'Object' o 'ValueType'.
fr: Impossible de convertir l'expression de type '{0}' en 'Object' ou 'ValueType'.
it: Non è possibile convertire l'espressione di tipo '{0}' in 'Object' o 'ValueType'.
ja: 型 '{0}' の式は、'Object' または 'ValueType' に変換できません。
ko: '{0}' 형식의 식은 'Object' 또는 'ValueType'으로 변환할 수 없습니다.
pl: Wyrażenia typu „{0}” nie można przekonwertować na element „Object” ani „ValueType”.
pt_br: Expressão de tipo "{0}" não pode ser convertida em "Object" ou "ValueType".
ru: Выражение типа "{0}" невозможно преобразовать в "Object" или "ValueType".
tr: '{0}' türündeki ifade 'Object' veya 'ValueType' olarak değiştirilemez.
zh_hans: 类型“{0}”的表达式无法转换为“Object”或“ValueType”。
zh_hant: 類型 '{0}' 的運算式無法轉換成 'Object' 或 'ValueType'。

# ERR_NoTypecharInLabel
source: Type characters are not allowed in label identifiers.
cs: Znaky typů nejsou povolené v identifikátorech popisků.
de: Typzeichen sind in Bezeichnungsbezeichnern nicht zulässig.
es: Los caracteres de tipo no se permiten en identificadores de etiqueta.
fr: Les caractères de type ne sont pas autorisés dans les identificateurs d'étiquette.
it: I caratteri tipo non sono consentiti negli identificatori di etichetta.
ja: ラベル識別子では型文字を使用できません。
ko: 레이블 식별자에는 형식 문자를 사용할 수 없습니다.
pl: Znaki typu są niedozwolone w identyfikatorach etykiet.
pt_br: Caracteres de tipo não são permitidos em identificadores de rótulo.
ru: Символы типа недопустимы в идентификаторах меток.
tr: Etiket tanıtıcılarında tür karakterleri kullanılamaz.
zh_hans: 标签标识符中不允许使用类型字符。
zh_hant: 標籤識別項中不允許類型字元。

# ERR_RestrictedType1
source: '{0}' cannot be made nullable, and cannot be used as the data type of an array element, field, anonymous type member, type argument, 'ByRef' parameter, or return statement.
cs: 'Typ {0} nejde změnit na typ připouštějící hodnotu Null a nejde ho použít jako datový typ prvku pole, typ pole, typ anonymního členu typu, typ argumentu, typ parametru ByRef ani typ příkazu return.
de: '"{0}" kann nicht in einen Typ umgewandelt werden, der NULL-Werte zulässt, und nicht als Datentyp eines Arrayelements, eines Felds, eines anonymen Typmembers, eines Typarguments, eines ByRef-Parameters oder einer return-Anweisung verwendet werden.
es: No se puede hacer que "{0}" admita valores NULL y no se puede usar como tipo de datos de un elemento de matriz, campo, miembro de tipo anónimo, argumento de tipo, parámetro "ByRef" o instrucción "return".
fr: '{0}' ne peut pas être rendu nullable ni être utilisé comme type de données d'un élément de tableau, champ, membre de type anonyme, argument de type, paramètre 'ByRef' ou instruction return.
it: '{0}' non può essere reso nullable né usato come tipo di dati di un elemento matrice, un campo, un membro di tipo anonimo, un argomento del tipo, un parametro 'ByRef' o un'istruzione return.
ja: '{0}' は Null 許容にすることはできません。また、配列要素、フィールド、匿名型メンバー、型引数、'ByRef' パラメーター、または return ステートメントのデータ型としては使用できません。
ko: '{0}'은(는) null을 허용할 수 없고 배열 요소, 필드, 익명 형식 멤버, 형식 인수, 'ByRef' 매개 변수 또는 return 문의 데이터 형식으로 사용할 수 없습니다.
pl: 'Typ „{0}” nie może być typem dopuszczającym wartość null i nie można go używać jako typu danych elementu tablicy, pola, składowej typu anonimowego, argumentu typu, parametru „ByRef” ani instrukcji return.
pt_br: "{0}" não pode ser anulável e não pode ser usado como o tipo de dados de um elemento de matriz, campo, membro de tipo anônimo, argumento de tipo, parâmetro "ByRef" ou instrução return.
ru: "{0}" не может принимать значение Null и не может быть использовано в качестве типа данных элемента массива, поля, анонимного типа члена, аргумента типа, параметра "ByRef" или оператора return.
tr: '{0}' null yapılamıyor ve bir dizi öğesinin, alanın, anonim tür üyesinin, tür bağımsız değişkeninin, 'ByRef' parametresinin veya return deyiminin türü olarak kullanılamaz.
zh_hans: “{0}”不能设置为可以为 null，而且不能用作数组元素、字段、匿名类型成员、类型参数、"ByRef" 参数或 return 语句的数据类型。
zh_hant: '{0}' 不可為 Null，且不可用做為陣列元素、欄位、匿名類型成員、類型引數、'ByRef' 參數或傳回陳述式的資料類型。

# ERR_NoTypecharInAlias
source: Type characters are not allowed on Imports aliases.
cs: Znaky typů nejsou povolené v aliasech Imports.
de: Typzeichen sind in Imports-Aliasen nicht zulässig.
es: No se permiten los caracteres de tipo en los alias de importación.
fr: Les caractères de type ne sont pas autorisés pour les alias Imports.
it: I caratteri tipo non sono consentiti negli alias di Imports.
ja: Imports エイリアスでは型文字を使用できません。
ko: Imports 별칭에는 형식 문자를 사용할 수 없습니다.
pl: Znaki typu są niedozwolone w aliasach Imports.
pt_br: Caracteres de tipo não são permitidos em aliases Imports.
ru: Символы типа недопустимы для псевдонимов Imports.
tr: Imports diğer adlarında tür karakterleri kullanılamaz.
zh_hans: 在 Imports 别名上不允许使用类型字符。
zh_hant: Imports 別名上不允許類型字元。

# ERR_NoAccessibleConstructorOnBase
source: Class '{0}' has no accessible 'Sub New' and cannot be inherited.
cs: Třída {0} nemá žádnou přístupnou proceduru Sub New a nejde ji zdědit.
de: Die {0}-Klasse hat kein zugreifbares "Sub New" und kann nicht geerbt werden.
es: La clase '{0}' no tiene un 'Sub New' accesible y no se puede heredar.
fr: La classe '{0}' n'a pas de 'Sub New' accessible et ne peut pas être héritée.
it: La classe '{0}' non ha 'Sub New' accessibili e non può essere ereditata.
ja: クラス '{0}' にはアクセス可能な 'Sub New' が含まれていません。このクラスを継承できません。
ko: '{0}' 클래스에 액세스 가능한 'Sub New'가 없으므로 상속할 수 없습니다.
pl: Klasa „{0}” nie ma dostępnego elementu „Sub New” i nie może być dziedziczona.
pt_br: Classe "{0}" não tem "Sub New" acessível e não pode ser herdada.
ru: Класс "{0}" не имеет доступного "Sub New" и не может быть унаследован.
tr: '{0}' sınıfında erişilebilir 'Sub New' yok ve devralınamıyor.
zh_hans: 类“{0}”没有可访问的“Sub New”，不能被继承。
zh_hant: 類別 '{0}' 沒有可存取的 'Sub New'，且無法被繼承。

# ERR_BadStaticLocalInStruct
source: Local variables within methods of structures cannot be declared 'Static'.
cs: Pro lokální proměnné v rámci metod struktur nejde použít deklaraci Static.
de: Lokale Variablen innerhalb von Methoden von Strukturen können nicht als "Static" deklariert werden.
es: Las variables locales que se encuentran dentro de métodos de estructuras no se pueden declarar como 'Static'.
fr: Les variables locales à l'intérieur des méthodes des structures ne peuvent pas être déclarées 'Static'.
it: Le variabili locali all'interno di metodi di strutture non possono essere dichiarate come 'Static'.
ja: 構造体のメソッド内にあるローカル変数を 'Static' と宣言することはできません。
ko: 구조체의 메서드 안에 있는 지역 변수는 'Static'으로 선언할 수 없습니다.
pl: W metodach struktur nie można deklarować zmiennych lokalnych jako „Static”.
pt_br: Variáveis locais dentro de métodos ou estruturas não podem ser declarados 'Static'.
ru: Локальные переменные в методах структур не могут объявляться как "Static".
tr: Yapı yöntemleri içindeki yerel değişkenler 'Static' olarak bildirilemez.
zh_hans: 结构方法内部的局部变量不能声明为“Static”。
zh_hant: 結構方法中的區域變數無法宣告為 'Static'。

# ERR_DuplicateLocalStatic1
source: Static local variable '{0}' is already declared.
cs: Statická lokální proměnná {0} je už deklarovaná.
de: Die statische lokale Variable "{0}" wurde bereits deklariert.
es: La variable local estática '{0}' ya se ha declarado.
fr: Une variable locale statique '{0}' est déjà déclarée.
it: La variabile locale statica '{0}' è già dichiarata.
ja: スタティック ローカル変数 '{0}' は、既に宣言されています。
ko: '{0}' static 지역 변수가 이미 선언되었습니다.
pl: Statyczna zmienna lokalna „{0}” jest już zadeklarowana.
pt_br: A variável local estática "{0}" já está declarada.
ru: Статическая локальная переменная "{0}" уже объявлена.
tr: Statik '{0}' yerel değişkeni zaten bildirildi.
zh_hans: 已声明静态局部变量“{0}”。
zh_hant: 靜態區域變數 '{0}' 已宣告。

# ERR_ImportAliasConflictsWithType2
source: Imports alias '{0}' conflicts with '{1}' declared in the root namespace.
cs: Alias importu {0} je v konfliktu s prvkem {1} deklarovaným v kořenovém oboru názvů.
de: Der Imports-Alias "{0}" steht mit "{1}", deklariert im Stammnamespace, in Konflikt.
es: El alias '{0}' de Imports entra en conflicto con '{1}', declarado en el espacio de nombres de la raíz.
fr: L'alias '{0}' pour Imports est en conflit avec '{1}' déclaré dans l'espace de noms racine.
it: L'alias '{0}' di Imports è in conflitto con '{1}', dichiarato nello spazio dei nomi radice.
ja: Imports エイリアス '{0}' は、ルート名前空間で宣言された '{1}' と競合しています。
ko: Imports 별칭 '{0}'이(가) 루트 네임스페이스에 선언된 '{1}'과(와) 충돌합니다.
pl: Alias instrukcji Imports „{0}” powoduje konflikt z elementem „{1}” zadeklarowanym w głównej przestrzeni nazw.
pt_br: Alias Imports "{0}" está em conflito com "{1}" declarado no namespace raiz.
ru: Псевдоним Imports "{0}" конфликтует с "{1}", объявленном в корневом пространстве имен.
tr: '{0}' Imports diğer adı kök ad alanında bildirilen '{1}' ile çakışıyor.
zh_hans: Imports 别名“{0}”与根命名空间中声明的“{1}”冲突。
zh_hant: Imports 別名 '{0}' 和根命名空間中宣告的 '{1}' 衝突。

# ERR_CantShadowAMustOverride1
source: '{0}' cannot shadow a method declared 'MustOverride'.
cs: '{0} nemůže zastiňovat metodu s deklarací MustOverride.
de: '"{0}" kann kein Shadowing für eine Methode durchführen, die als "MustOverride" deklariert ist.
es: '{0}' no puede prevalecer sobre un método declarado como 'MustOverride'.
fr: '{0}' ne peut pas masquer une méthode déclarée 'MustOverride'.
it: '{0}' non può nascondere un metodo dichiarato come 'MustOverride'.
ja: '{0}' で、'MustOverride' と宣言されたメソッドをシャドウすることはできません。
ko: '{0}'은(는) 'MustOverride'로 선언된 메서드를 숨길 수 없습니다.
pl: 'Element „{0}” nie może zasłaniać metody zadeklarowanej jako „MustOverride”.
pt_br: "{0}" não pode sombrear um método declarado como "MustOverride".
ru: "{0}" не может сделать теневым метод, объявленный как "MustOverride".
tr: '{0}', 'MustOverride' olarak bildirilen bir yöntemi gölgeleyemez.
zh_hans: '“{0}”不能隐藏声明为“MustOverride”的方法。
zh_hant: '{0}' 不可遮蔽宣告為 'MustOverride' 的方法。

# ERR_MultipleEventImplMismatch3
source: Event '{0}' cannot implement event '{2}.{1}' because its delegate type does not match the delegate type of another event implemented by '{0}'.
cs: Událost {0} nemůže implementovat událost {2}.{1}, protože typ delegáta neodpovídá typu delegáta jiné události implementované událostí {0}.
de: Das Ereignis "{0}" kann das Ereignis "{2}.{1}" nicht implementieren, da der Delegattyp nicht mit dem Delegattyp eines anderen Ereignisses übereinstimmt, das von "{0}" implementiert wird.
es: El evento '{0}' no puede implementar el evento '{2}.{1}' porque su tipo delegado no coincide con el tipo delegado de otro evento implementado por '{0}'.
fr: L'événement '{0}' ne peut pas implémenter l'événement '{2}.{1}', car son type délégué ne correspond pas au type délégué d'un autre événement implémenté par '{0}'.
it: L'evento '{0}' non può implementare l'evento '{2}.{1}' perché il relativo tipo delegato non corrisponde al tipo delegato di un altro evento implementato da '{0}'.
ja: デリゲート型が、'{0}' によって実装されている別のイベントのデリゲート型と一致しないため、イベント '{0}' でイベント '{2}.{1}' を実装することはできません。
ko: {2}.{1}' 이벤트의 대리자 형식이 '{0}' 이벤트에 의해 구현된 다른 이벤트의 대리자 형식과 일치하지 않으므로 '{0}' 이벤트에서 이 이벤트를 구현할 수 없습니다.
pl: Zdarzenie „{0}” nie może implementować zdarzenia „{2}.{1}”, ponieważ jego typ delegowany nie pasuje do typu delegowanego innego zdarzenia implementowanego przez zdarzenie „{0}”.
pt_br: Evento "{0}" não pode implementar o evento "{2}.{1}" porque seu tipo delegado não corresponde ao tipo delegado de outro evento implementado por "{0}".
ru: Событию "{0}" не удается реализовать событие "{2}.{1}", поскольку его тип делегата не соответствует типу делегата другого события, реализованного "{0}".
tr: '{0}' olayı, temsilci türü '{0}' tarafından uygulanan başka bir olayın temsilci türüyle eşleşmediğinden '{2}.{1}' olayını uygulayamıyor.
zh_hans: 事件“{0}”不能实现事件“{2}.{1}”，因为其委托类型与“{0}”实现的另一个事件的委托类型不匹配。
zh_hant: 事件 '{0}' 無法實作事件 '{2}.{1}'，因為其委派類型與其他以 '{0}' 實作的事件之委派類型不相符。

# ERR_BadSpecifierCombo2
source: '{0}' and '{1}' cannot be combined.
cs: '{0} a {1} nejde kombinovat.
de: '"{0}" und "{1}" können nicht kombiniert werden.
es: '{0}' y '{1}' no se pueden combinar.
fr: 'Impossible de combiner '{0}' et '{1}'.
it: 'Non è possibile combinare '{0}' con '{1}'.
ja: '{0}' と '{1}' を組み合わせることはできません。
ko: '{0}' 및 '{1}'은(는) 조합할 수 없습니다.
pl: 'Nie można połączyć elementów „{0}” i „{1}”.
pt_br: "{0}" e "{1}" não podem ser combinados.
ru: "{0}" и "{1}" объединять нельзя.
tr: '{0}' ile '{1}' birleştirilemez.
zh_hans: '“{0}”不能与“{1}”组合。
zh_hant: '無法結合 '{0}' 和 '{1}'。

# ERR_MustBeOverloads2
source: {0} '{1}' must be declared 'Overloads' because another '{1}' is declared 'Overloads' or 'Overrides'.
cs: {0} – {1} musí být deklarovaný jako Overloads, protože jiný {1} je deklarovaný jako Overloads nebo Overrides.
de: {0} "{1}" muss als "Overloads" deklariert werden, da "{1}" an anderer Stelle als "Overloads" oder "Overrides" deklariert wurde.
es: {0} '{1}' se debe declarar como 'Overloads' porque otro '{1}' está declarado como 'Overloads' u 'Overrides'.
fr: {0} '{1}' doit être déclaré 'Overloads', car un autre '{1}' est déclaré 'Overloads' ou 'Overrides'.
it: {0} '{1}' deve essere dichiarato come 'Overloads' perché un altro elemento '{1}' è dichiarato come 'Overloads' o 'Overrides'.
ja: 別の '{1}' が 'Overloads' または 'Overrides' と宣言されているため、{0} '{1}' は 'Overloads' と宣言されなければなりません。
ko: 다른 '{1}'이(가) 'Overloads' 또는 'Overrides'로 선언되어 있으므로 {0} '{1}'은(는) 'Overloads'로 선언해야 합니다.
pl: Element {0} „{1}” musi być zadeklarowany jako „Overloads”, ponieważ inny element „{1}” jest zadeklarowany jako „Overloads” lub „Overrides”.
pt_br: {0} "{1}" deve ser declarado como "Overloads" porque outro "{1}" está declarado como "Overloads" ou "Overrides".
ru: {0} "{1}" должно быть объявлено как "Overloads", поскольку другая переменная "{1}" объявлена как "Overloads" или "Overrides".
tr: Başka bir '{1}' 'Overloads' veya 'Overrides' olarak bildirildiğinden {0} '{1}' 'Overloads' olarak bildirilmelidir.
zh_hans: {0}“{1}”必须声明为“Overloads”，因为另一个“{1}”声明为“Overloads”或“Overrides”。
zh_hant: {0} '{1}' 必須宣告為 'Overloads'，因為另一個 '{1}' 已宣告為 'Overloads' 或 'Overrides'。

# ERR_MustOverridesInClass1
source: '{0}' must be declared 'MustInherit' because it contains methods declared 'MustOverride'.
cs: 'Pro typ {0} se musí použít deklarace MustInherit, protože obsahuje metody s deklarací MustOverride.
de: '"{0}" muss als "MustInherit" deklariert werden, da es Methoden enthält, die als "MustOverride" deklariert sind.
es: '{0}' se debe declarar como 'MustInherit' debido a que contiene métodos declarados como 'MustOverride'.
fr: '{0}' doit être déclaré 'MustInherit', car il contient des méthodes déclarées 'MustOverride'.
it: '{0}' deve essere dichiarato come 'MustInherit' perché contiene metodi dichiarati come 'MustOverride'.
ja: '{0}' には、'MustOverride' と宣言されているメソッドが含まれているため、'MustInherit' と宣言しなければなりません。
ko: '{0}'은(는) 'MustOverride'로 선언된 메서드를 포함하므로 'MustInherit'으로 선언해야 합니다.
pl: 'Element „{0}” musi być zadeklarowany jako „MustInherit”, ponieważ zawiera metody zadeklarowane jako „MustOverride”.
pt_br: "{0}" deve ser declarado "MustInherit" porque contém métodos declarados "MustOverride".
ru: "{0}" должна быть объявлена как "MustInherit", потому что она содержит методы, объявленные как "MustOverride".
tr: 'MustOverride' olarak bildirilen yöntemler içerdiğinden '{0}' 'MustInherit' olarak bildirilmelidir.
zh_hans: '“{0}”包含声明为“MustOverride”的方法，因此它必须声明为“MustInherit”。
zh_hant: '{0}' 必須宣告為 'MustInherit'，因為其包含宣告為 'MustOverride' 的方法。

# ERR_HandlesSyntaxInClass
source: 'Handles' in classes must specify a 'WithEvents' variable, 'MyBase', 'MyClass' or 'Me' qualified with a single identifier.
cs: 'Klauzule Handles ve třídách musí určovat proměnnou WithEvents nebo člena MyBase, MyClass či Me kvalifikovaného pomocí jednoho identifikátoru.
de: '"Handles" in Klassen muss eine WithEvents-Variable, "MyBase", "MyClass" oder "Me" angeben, die durch einen einzelnen Bezeichner qualifiziert wird.
es: 'Handles' debe especificar una variable 'WithEvents', 'MyBase', 'MyClass' o 'Me' calificada con un solo identificador cuando aparece en clases.
fr: 'Dans les classes, 'Handles' doit spécifier une variable 'WithEvents', ou 'MyBase', 'MyClass' ou 'Me' qualifié par un identificateur unique.
it: 'Handles' nelle classi deve specificare una variabile 'WithEvents', 'MyBase', 'MyClass' o 'Me' qualificata con un identificatore singolo.
ja: 'クラスの 'Handles' には、単一の識別子で限定される 'WithEvents' 変数、'MyBase'、'MyClass'、または 'Me' を指定しなければなりません。
ko: '클래스의 'Handles'는 단일 식별자로 한정된 'WithEvents' 변수, 'MyBase', 'MyClass' 또는 'Me'를 지정해야 합니다.
pl: 'Element „Handles” w klasach musi określać zmienną „WithEvents”, „MyBase”, „MyClass” lub „Me” kwalifikowaną za pomocą pojedynczego identyfikatora.
pt_br: 'Handles' em classes deve especificar uma variável 'WithEvents', 'MyBase', 'MyClass' ou 'Me' qualificada com um único identificador.
ru: 'В "Handles" в классах должна указываться переменная, объявленная с модификатором "WithEvents", либо объект "MyBase", "MyClass" или "Me", ограниченный одним идентификатором.
tr: 'Sınıflardaki 'Handles' tek bir tanımlayıcıyla nitelenmiş bir 'WithEvents' değişkeni, 'MyBase', 'MyClass' veya 'Me' belirtmelidir.
zh_hans: '类中的“Handles”必须指定用单个标识符限定的“WithEvents”变量、“MyBase”、“MyClass”或“Me”。
zh_hant: '類別中的 'Handles' 必須指定以單一識別項限定的 'WithEvents' 變數、'MyBase'、'MyClass' 或 'Me'。

# ERR_SynthMemberShadowsMustOverride5
source: '{0}', implicitly declared for {1} '{2}', cannot shadow a 'MustOverride' method in the base {3} '{4}'.
cs: '{0}, implicitně deklarovaný pro {1} - {2}, nemůže zastiňovat metodu MustOverride v základní třídě {3} – {4}.
de: '"{0}", implizit für {1} "{2}" deklariert, kann kein Shadowing für eine MustOverride-Methode in Basis-{3} "{4}" durchführen.
es: '{0}', declarado implícitamente para {1} '{2}', no puede prevalecer sobre un método 'MustOverride' en la base {3} '{4}'.
fr: '{0}', déclaré implicitement pour {1} '{2}', ne peut pas masquer une méthode 'MustOverride' dans le {3} '{4}' de base.
it: '{0}', dichiarato in modo implicito per {1} '{2}', non può nascondere un metodo 'MustOverride' nell'elemento {3} base '{4}'.
ja: {1} '{2}' で暗黙のうちに宣言された '{0}' が、基底 {3} '{4}' の 'MustOverride' メソッドをシャドウすることはできません。
ko: '{1} '{2}'에 대해 암시적으로 선언된 '{0}'은(는) 기본 {3} '{4}'의 'MustOverride' 메서드를 숨길 수 없습니다.
pl: 'Element „{0}” niejawnie zadeklarowany dla elementu {1} „{2}” nie może zasłonić metody „MustOverride” w podstawowym elemencie {3} „{4}”.
pt_br: "{0}", implicitamente declarado para {1} "{2}", não pode sombrear um método "MustOverride" na base {3} "{4}".
ru: "{0}", неявно объявленный для {1} "{2}", не может затенять метод "MustOverride" в базе {3} "{4}".
tr: {1} '{2}' için örtük olarak bildirilen '{0}', {3} '{4}' temelinde 'MustOverride' yöntemini gölgeleyemez.
zh_hans: '为 {1}“{2}”隐式声明的“{0}”不能隐藏基 {3}“{4}”中的“MustOverride”方法。
zh_hant: '為 {1} '{2}' 隱含宣告的 '{0}'，無法遮蔽基底 {3} '{4}' 中的 'MustOverride' 方法。

# ERR_CannotOverrideInAccessibleMember
source: '{0}' cannot override '{1}' because it is not accessible in this context.
cs: '{0} nemůže přepsat {1}, protože není v tomto kontextu k dispozici.
de: '"{0}" kann "{1}" nicht überschreiben, da in diesem Kontext nicht darauf zugegriffen werden kann.
es: '{0}' no puede invalidar '{1}' porque no es accesible en este contexto.
fr: '{0}' ne peut pas se substituer à '{1}', car il n'est pas accessible dans ce contexte.
it: '{0}' non può eseguire l'override di '{1}' perché non è accessibile in questo contesto.
ja: '{1}' は、このコンテキストではアクセスできないため、'{0}' でオーバーライドすることはできません。
ko: '{0}'은(는) 이 컨텍스트에서 액세스할 수 없으므로 '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłaniać elementu „{1}”, ponieważ nie jest on dostępny w tym kontekście.
pt_br: "{0}" não pode substituir "{1}" porque não está acessível neste contexto.
ru: "{0}" не может переопределить "{1}", поскольку он недоступен в данном контексте.
tr: 'Bu bağlamda erişilebilir olmadığından '{1}' öğesi '{0}' tarafından geçersiz kılınamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它在此上下文中是无法访问的。
zh_hant: '{0}' 無法覆寫 '{1}'，因為在此內容中無法存取它。

# ERR_HandlesSyntaxInModule
source: 'Handles' in modules must specify a 'WithEvents' variable qualified with a single identifier.
cs: 'V klauzulích Handles v modulech musí být zadaný kvalifikátor proměnné WithEvents s jediným identifikátorem.
de: '"Handles" in Modulen muss eine WithEvents-Variable angeben, die durch einen einzelnen Bezeichner qualifiziert wird.
es: 'Handles' debe especificar una variable 'WithEvents' calificada con un identificador único cuando aparece en módulos.
fr: 'Handles' dans les modules doivent spécifier une variable 'WithEvents' qualifiée avec un unique identificateur.
it: 'Handles' nei moduli deve specificare una variabile 'WithEvents' qualificata con un identificatore singolo.
ja: 'モジュールの 'Handles' には、単一の識別子で限定される 'WithEvents' 変数を指定しなければなりません。
ko: '모듈의 'Handles'는 단일 식별자로 한정된 'WithEvents' 변수를 지정해야 합니다.
pl: 'Elementy „Handles” w module muszą określać zmienną „WithEvents” kwalifikowaną za pomocą pojedynczego identyfikatora.
pt_br: 'Handles' em módulos deve especificar uma variável 'WithEvents' qualificada com um único identificador.
ru: 'В "Handles" в модулях должна указываться переменная с модификатором WithEvents, ограниченная одним идентификатором.
tr: 'Modüllerdeki 'Handles', tek bir tanımlayıcıyla nitelenmiş bir 'WithEvents' değişkeni belirtmelidir.
zh_hans: '模块中的“Handles”必须指定用单个标识符限定的“WithEvents”变量。
zh_hant: '模組中的 'Handles' 必須指定以單一識別項限定的 'WithEvents' 變數。
