Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_VBCHelp
source: Visual Basic Compiler Options - OUTPUT FILE - -out:<file> Specifies the output file name. -target:exe Create a console application (default). (Short form: -t) -target:winexe Create a Windows application. -target:library Create a library assembly. -target:module Create a module that can be added to an assembly. -target:appcontainerexe Create a Windows application that runs in AppContainer. -target:winmdobj Create a Windows Metadata intermediate file -doc[+|-] Generates XML documentation file. -doc:<file> Generates XML documentation file to <file>. -refout:<file> Reference assembly output to generate - INPUT FILES - -addmodule:<file_list> Reference metadata from the specified modules -link:<file_list> Embed metadata from the specified interop assembly. (Short form: -l) -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications. -reference:<file_list> Reference metadata from the specified assembly. (Short form: -r) -analyzer:<file_list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. - RESOURCES - -linkresource:<resinfo> Links the specified file as an external assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -linkres) -nowin32manifest The default manifest should not be embedded in the manifest section of the output PE. -resource:<resinfo> Adds the specified file as an embedded assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -res) -win32icon:<file> Specifies a Win32 icon file (.ico) for the default Win32 resources. -win32manifest:<file> The provided file is embedded in the manifest section of the output PE. -win32resource:<file> Specifies a Win32 resource file (.res). - CODE GENERATION - -optimize[+|-] Enable optimizations. -removeintchecks[+|-] Remove integer checks. Default off. -debug[+|-] Emit debugging information. -debug:full Emit full debugging information (default). -debug:pdbonly Emit full debugging information. -debug:portable Emit cross-platform debugging information. -debug:embedded Emit cross-platform debugging information into the target .dll or .exe. -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -nowarn Disable all warnings. -nowarn:<number_list> Disable a list of individual warnings. -warnaserror[+|-] Treat all warnings as errors. -warnaserror[+|-]:<number_list> Treat a list of warnings as errors. -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics in SARIF format. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -define:<symbol_list> Declare global conditional compilation symbol(s). symbol_list:name=value,... (Short form: -d) -imports:<import_list> Declare global Imports for namespaces in referenced metadata files. import_list:namespace,... -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `default` (latest major version), or `latest` (latest version, including minor versions), or specific versions like `14` or `15.3` -optionexplicit[+|-] Require explicit declaration of variables. -optioninfer[+|-] Allow type inference of variables. -rootnamespace:<string> Specifies the root Namespace for all type declarations. -optionstrict[+|-] Enforce strict language semantics. -optionstrict:custom Warn when strict language semantics are not respected. -optioncompare:binary Specifies binary-style string comparisons. This is the default. -optioncompare:text Specifies text-style string comparisons. - MISCELLANEOUS - -help Display this usage message. (Short form: -?) -noconfig Do not auto-include VBC.RSP file. -nologo Do not display compiler copyright banner. -quiet Quiet output mode. -verbose Display verbose messages. -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<number> The base address for a library or module (hex). -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<number> Specifies the codepage to use when opening source files. -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key. -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key. -errorreport:<string> Specifies how to handle internal compiler errors; must be prompt, send, none, or queue (default). -generatedfilesout:<dir> Place files generated during compilation in the specified directory. -filealign:<number> Specify the alignment used for output file sections. -highentropyva[+|-] Enable high-entropy ASLR. -keycontainer:<string> Specifies a strong name key container. -keyfile:<file> Specifies a strong name key file. -libpath:<path_list> List of directories to search for metadata references. (Semi-colon delimited.) -main:<class> Specifies the Class or Module that contains Sub Main. It can also be a Class that inherits from System.Windows.Forms.Form. (Short form: -m) -moduleassemblyname:<string> Name of the assembly which this module will be a part of. -netcf Target the .NET Compact Framework. -nostdlib Do not reference standard libraries (system.dll and VBC.RSP file). -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -platform:<string> Limit which platforms this code can run on; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred or anycpu (default). -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -reportivts[+|-] Output information on all IVTs granted to this assembly by all dependencies, and annotate foreign assembly accessibility errors with what assembly they came from. -sdkpath:<path> Path used to search for standard library assemblies. -subsystemversion:<version> Specify subsystem version of the output PE. version:<number>[.<number>] -utf8output[+|-] Emit compiler output in UTF-8 character encoding. @<file> Insert command-line settings from a text file -vbruntime[+|-|*] Compile with/without the default Visual Basic runtime. -vbruntime:<file> Compile with the alternate Visual Basic runtime in <file>.
es: Opciones del compilador de Visual Basic - ARCHIVO DE SALIDA - -out:<file> Especifica el nombre del archivo de salida. -target:exe Crear una aplicación de consola (predeterminado). (Forma corta: -t) -target:winexe Crear una aplicación Windows. -target:library Crear un ensamblado de biblioteca. -target:module Crear un módulo que se pueda agregar a un ensamblado. -target:appcontainerexe Crear una aplicación Windows que se ejecute en AppContainer. -target:winmdobj Crear un archivo intermedio de metadatos de Windows -doc[+|-] Genera el archivo de documentación XML. -doc:<file> Genera el archivo de documentación XML para <file>. -refout:<file> Salida del ensamblado de referencia para generar - ARCHIVOS DE ENTRADA - -addmodule:<file_list> Hace referencia a los metadatos de los módulos especificados -link:<file_list> Insertar metadatos en el ensamblado especificado en la interoperabilidad. (Forma corta: -l) -recurse:<wildcard> Incluir todos los archivos del directorio actual y subdirectorios según las especificaciones de caracteres comodín. -reference:<file_list> Hacer referencia a los metadatos del ensamblado especificado. (Forma corta: -r) -analyzer:<file_list> Ejecutar los analizadores desde este ensamblado (Forma corta: -a) -additionalfile:<file list> Archivos adicionales que no afectan directamente a la generación de código, pero los analizadores pueden usarse para producir errores o advertencias. - RECURSOS - -linkresource:<resinfo> Vincula el archivo especificado como un recurso de ensamblado externo. resinfo:<file>[,<name>[,public|private]] (Forma corta: -linkres) -nowin32manifest El manifiesto predeterminado no debe incrustarse en la sección de manifiesto del PE de salida. -resource:<resinfo> Agrega el archivo especificado como un recurso de ensamblado insertado. resinfo:<file>[,<name>[,public|private]] (Forma corta: -res) -win32icon:<file> Especifica un archivo de icono de Win32 (.ico) para los recursos de Win32 predeterminados. -win32manifest:<file> El archivo proporcionado se incrusta en la sección de manifiesto del PE de salida. -win32resource:<file> Especifica un archivo de recursos Win32 (.res). - GENERACIÓN DE CÓDIGO - -optimize[+|-] Habilitar optimizaciones. -removeintchecks[+|-] Quitar comprobaciones de enteros. Desactivado de manera predeterminada. -debug[+|-] Emitir información de depuración. -debug:full Emitir información de depuración completa (de manera predeterminada). -debug:pdbonly Emitir información de depuración completa. -debug:portable Emitir información de depuración multiplataforma. -debug:embedded Emitir información de depuración multiplataforma en el archivo .dll o .exe de destino. -deterministic Producir un ensamblado determinista (incluyendo el GUID de la versión del módulo y la marca de tiempo) -refonly Generar un ensamblado de referencia en lugar de la salida principal -instrument:TestCoverage Producir un ensamblado instrumentado para recopilar información de cobertura -sourcelink:<file> Información del vínculo de origen para insertar en el archivo PDB. - ERRORES Y ADVERTENCIAS - -nowarn Deshabilitar todas las advertencias. -nowarn:<number_list> Deshabilitar una lista de advertencias individuales. -warnaserror[+|-] Tratar todas las advertencias como errores. -warnaserror[+|-]:<number_list> Tratar una lista de advertencias como errores. -ruleset:<file> Especificar un archivo de conjunto de reglas que deshabilite diagnósticos específicos. -errorlog:<file>[,version=<sarif_version>] Especificar un archivo para registrar todos los diagnósticos del compilador y el analizador en formato SARIF. sarif_version:{1|2|2.1} El valor predeterminado es 1.2 y 2.1; ambos hacen referencia a la versión 2.1.0 de SARIF. -reportanalyzer Informar información adicional del analizador, como hora de ejecución. -skipanalyzers[+|-] Omitir la ejecución de los analizadores de diagnóstico. - LENGUAJE - -define:<symbol_list> Declarar símbolos de compilación condicional global. symbol_list:name=value,... (Forma corta: -d) -imports:<import_list> Declarar importaciones globales para espacios de nombres en los archivos de metadatos a los que se hace referencia. import_list:namespace,... -langversion:? Mostrar los valores permitidos para la versión del lenguaje -langversion:<string> Especificar la versión de idioma como "predeterminado" (versión principal más reciente) o "más reciente" (versión más reciente, incluidas las versiones secundarias), o versiones específicas, como "14" o "15.3" -optionexplicit[+|-] Requerir la declaración explícita de variables. -optioninfer[+|-] Permitir inferencia de tipos de variables. -rootnamespace:<string> Especificar el espacio de nombres de la raíz de todoas las declaraciones de tipos. -optionstrict[+|-] Aplicar una semántica de lenguaje estricta. -optionstrict:custom Advertir cuando la semántica estricta del lenguaje no sea respetada. -optioncompare:binary Especificar comparaciones de cadenas de estilo binario. Este es el valor predeterminado. -optioncompare:text Especificar comparaciones de cadenas de estilo de texto. - VARIOS - -help Mostrar este mensaje de uso. (Forma corta: -?) -noconfig No incluir automáticamente el archivo VBC.RSP. -nologo No mostrar el banner de copyright del compilador. -quiet Modo de salida silencioso. -verbose Mostrar mensajes detallados. -parallel[+|-] Compilación simultánea. -version Mostrar el número de versión del compilador y salir. - AVANZADO - -baseaddress:<number> Dirección base de la biblioteca o módulo (hex). -checksumalgorithm:<alg> Especificar el algoritmo para calcular la suma de comprobación del archivo de origen almacenada en PDB. Los valores admitidos son: SHA1 o SHA256 (valor predeterminado). -codepage:<number> Especifica la página de códigos que se vaya a utilizar al abrir archivos de código fuente. -delaysign[+|-] Retrasar la firma del ensamblado usando solo la porción pública de la clave de nombre seguro. -publicsign[+|-] Firmar públicamente el ensamblado usando solo la porción pública de la clave de nombre seguro. -errorreport:<string> Especifica cómo controlar los errores del compilador interno; debe ser solicitar, enviar, ninguno o en cola (predeterminado). -generatedfilesout:<dir> Colocar los archivos generados durante la compilación en el directorio especificado. -filealign:<number> Especificar la alineación utilizada por las secciones de archivos de salida. -highentropyva[+|-] Habilitar ASLR de alta entropía. -keycontainer:<string> Especifica un contenedor de claves de nombre seguro. -keyfile:<file> Especifica un archivo de clave de nombre seguro. -libpath:<path_list> Lista de directorios para buscar referencias a metadatos. (Delimitado por punto y coma). -main:<clase> Especifica la clase o el módulo que contenga el subelemento principal. También puede ser una clase que hereda de System.Windows.Forms.Form. (Forma corta: -m) -moduleassemblyname:<string> Nombre del ensamblado del que este módulo formará parte. -netcf Destino de .NET Compact Framework. -nostdlib No hacer referencia a bibliotecas estándar (archivo system.dll y VBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Especificar una asignación para los nombres de ruta de acceso de origen generados por el compilador. -platform:<string> Limitar en qué plataformas se puede ejecutar este código; debe ser x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred o anycpu (valor predeterminado). -preferreduilang Especificar el nombre del lenguaje de salida preferido. -nosdkpath Deshabilitar la búsqueda de rutas de acceso SDK predeterminadas para los ensamblados de biblioteca estándar. -reportivts[+|-] Información de salida sobre todos los IVT concedidos a este ensamblado por todas las dependencias y anotar los errores de accesibilidad de ensamblados externos con el ensamblado del que proceden. -sdkpath:<path> Ruta de acceso usada para buscar ensamblados de biblioteca estándar. -subsystemversion:<version> Especificar la versión del subsistema del PE de salida. version:<number>[.<number>] -utf8output[+|-] Emitir salida del compilador en codificación de caracteres UTF-8. @<file> Insertar la configuración de línea de comando de un archivo de texto -vbruntime[+|-|*] Compilar con o sin el runtime de Visual Basic predeterminado. -vbruntime:<file> Compilar con el runtime de Visual Basic alternativo en <file>.
zh_hant: Visual Basic 編譯器選項 - OUTPUT FILE - -out:<file> 指定輸出檔案名稱。 -target:exe 建立主控台應用程式 (預設)。 (簡短形式: -t) -target:winexe 建立 Windows 應用程式。 -target:library 建立程式庫組件。 -target:module 建立可新增到 組件的模組。 -target:appcontainerexe 建立可在 AppContainer 中執行的 Windows 應用程式。 -target:winmdobj 建立 Windows 中繼資料中繼檔案 -doc[+|-] 產生 XML 文件檔案。 -doc:<file> 產生 XML 文件檔案至 <file>。 -refout:<file> 要產生的參考組件輸出 - INPUT FILES - -addmodule:<file_list> 從指定的模組參考中繼資料。 -link:<file_list> 從指定的 Interop 組件內嵌中繼資料。(簡短形式: -l) -recurse:<wildcard> 根據 萬用字元 規格 包含目前目錄和子目錄中的所有檔案。 -reference:<file_list> 從指定的 組件參考中繼資料。(簡短形式: -r) -analyzer:<file_list> 從此組件執行分析器 (簡短形式: -a) -additionalfile:<file list> 不會直接影響程式碼產生 但可由分析器用來產生錯誤或警告 的其他檔案。 - RESOURCES - -linkresource:<resinfo> 連結指定的檔案做為外部 組件資源。 resinfo:<file>[,<name>[,public|private]] (簡短形式: -linkres) -nowin32manifest 預設資訊清單不應該內嵌在 輸出 PE 的資訊清單區段。 -resource:<resinfo> 將指定的檔案新增為內嵌 組件資源。 resinfo:<file>[,<name>[,public|private]] (簡短形式: -res) -win32icon:<file> 為預設 Win32 資源指定 Win32 圖示檔案 (.ico)。 -win32manifest:<file> 提供的檔案內嵌在 輸出 PE 的資訊清單區段。 -win32resource:<file> 指定 Win32 資源檔案 (.res)。 - CODE GENERATION - -optimize[+|-] 啟用最佳化。 -removeintchecks[+|-] 移除整數檢查。預設為關閉。 -debug[+|-] 發出偵錯資訊。 -debug:full 發出完整偵錯資訊 (預設)。 -debug:pdbonly 發出完整偵錯資訊。 -debug:portable 發出跨平台偵錯資訊。 -debug:embedded 發出跨平台偵錯資訊至 目標 .dll 或 .exe。 -deterministic 產生具決定性組件 (包括模組版本 GUID 和時間戳記) -refonly 產生參考組件，以取代主要輸出 -instrument:TestCoverage 產生檢測要收集 涵蓋範圍資訊的組件 -sourcelink:<file> 要內嵌至 PDB 的來源連結資訊。 - ERRORS AND WARNINGS - -nowarn 停用所有警告。 -nowarn:<number_list> 停用個別警告的清單。 -warnaserror[+|-] 將所有警告視為錯誤。 -warnaserror[+|-]:<number_list> 將警告清單視為錯誤。 -ruleset:<file> 指定會停用特定診斷的 規則集檔案。 -errorlog:<file>[,version=<sarif_version>] 指定用來以 SARIF 格式記錄所有編譯器和分析器診斷 的檔案。 sarif_version:{1|2|2.1} 預設為 1。2 和 2.1 都表示 SARIF 版本 2.1.0。 -reportanalyzer 報告其他分析器資訊，例如 執行時間。 -skipanalyzers[+|-] 略過診斷分析器執行。 - LANGUAGE - -define:<symbol_list> 宣告全域條件式編譯 符號。symbol_list:name=value,... (簡短形式: -d) -imports:<import_list> 在參考的中繼資料檔案中 宣告命名空間的全域匯入。 import_list:namespace,... -langversion:? 顯示語言版本的允許值 -langversion:<string> 指定語言版本，例如 `default` (最新的主要版本)，或 `latest` (最新版本，包括次要版本)， 或特定版本，例如 `14` 或 `15.3` -optionexplicit[+|-] 需要明確宣告變數。 -optioninfer[+|-] 允許變數的類型推斷。 -rootnamespace:<string> 指定所有類型宣告 的根命名空間。 -optionstrict[+|-] 強制執行嚴格的語言語意。 -optionstrict:custom 未遵守嚴格的語言語意時提出警告 。 -optioncompare:binary 指定二進位樣式字串比較。 這是預設值。 -optioncompare:text 指定文字樣式字串比較。 - MISCELLANEOUS - -help 顯示使用方式訊息。(簡短形式: -?) -noconfig 不要自動包括 VBC.RSP 檔案。 -nologo 不要顯示編譯器著作權橫幅。 -quiet 無訊息輸出模式。 -verbose 顯示詳細訊息。 -parallel[+|-] 同時建置。 -version 顯示編譯器版本號碼並結束。 - ADVANCED - -baseaddress:<number> 程式庫或模組的基本位址 (十六進位)。 -checksumalgorithm:<alg> 指定計算儲存在 PDB 中 來源檔案總和檢查碼的演算法。支援的值為: SHA1 或 SHA256 (預設)。 -codepage:<number> 指定開啟來源檔案時 要使用的字碼頁。 -delaysign[+|-] 只使用強式名稱金鑰的公開 部分對組件進行延遲簽屬。 -publicsign[+|-] 只使用強式名稱金鑰的公開 部分對組件進行公開簽屬。 -errorreport:<string> 指定如何處理內部編譯器 錯誤; 必須是提示、傳送、無或佇列 (預設)。 -generatedfilesout:<dir> 將編譯期間產生的檔案放在 指定的目錄。 -filealign:<number> 指定用於輸出檔案 區段的對齊。 -highentropyva[+|-] 啟用高熵 ASLR。 -keycontainer:<string> 指定強式名稱金鑰容器。 -keyfile:<file> 指定強式名稱金鑰檔案。 -libpath:<path_list> 用於搜尋中繼資料 參考的目錄清單。(以分號分隔。) -main:<class> 指定包含 Sub Main 的類別或模組。它也可以是 繼承自 System.Windows.Forms.Form 的類別。 (簡短形式: -m) -moduleassemblyname:<string> 此模組將成為 其一部分的組件名稱。 -netcf 以 .NET Compact Framework 為目標。 -nostdlib 不參考標準程式庫 (system.dll 和 VBC.RSP 檔案)。 -pathmap:<K1>=<V1>,<K2>=<V2>,... 指定由編譯器輸出之來源路徑名稱的對應 。 -platform:<string> 限制此程式碼可在哪些平台上執行; 必須是 x86、x64、Itanium、arm、arm64 AnyCPU32BitPreferred 或 anycpu (預設)。 -preferreduilang 指定喜好的輸出語言名稱。 -nosdkpath 停用搜尋標準程式庫組件的預設 SDK 路徑。 -reportivts[+|-] 輸出有關所有相依項授與至此 組件的所有 IVT 的資訊，並使用它們來自的組件 標註外部組件的可存取性錯誤。 -sdkpath:<path> .NET Framework SDK 目錄的位置 (mscorlib.dll)。 -subsystemversion:<version> 指定輸出 PE 的子系統版本。 version:<number>[.<number>] -utf8output[+|-] 以 UTF-8 字元編碼 發出編譯器輸出。 @<file> 從文字檔插入命令列設定 -vbruntime[+|-|*] 使用/不使用預設 Visual Basic 執行階段編譯。 -vbruntime:<file> 使用 <file> 中的其他 Visual Basic 執行階段編譯。

source: There are no function pointer types in VB.
es: No hay tipos de punteros de función en VB.
it: Non ci sono tipi puntatore a funzione in VB.
ja: VB に関数ポインター型はありません。
ko: VB에 함수 포인터 형식이 없습니다.
pl: W języku VB nie ma typów wskaźnikowych funkcji.
pt_br: Não há nenhum tipo de ponteiro de função no VB.
ru: В VB отсутствуют типы указателей на функции.
tr: VB'de işlev işaretçisi türü yoktur.
zh_hant: VB 中沒有函式指標類型。

source: There are no native integer types in VB.
es: No hay tipos enteros nativos en VB.
it: Non ci sono tipi Integer nativi in VB.
ja: VB にネイティブの整数型はありません。
ko: VB에는 원시 정수 형식이 없습니다.
pl: Brak typów natywnej liczby całkowitej w języku Visual Basic.
pt_br: Não há tipos de inteiro nativo no VB.
ru: В VB нет собственных целочисленных типов.
tr: VB'de yerel tamsayı türü yoktur.
zh_hant: VB 中沒有任何原生整數類型。

# TreesMustHaveRootNode
source: trees({0}) must have root node with SyntaxKind.CompilationUnit.
cs: stromy({0}) musí mít kořenový uzel s prvkem SyntaxKind.CompilationUnit.
de: Bäume({0}) müssen einen Stammknoten mit SyntaxKind.CompilationUnit haben.
es: los árboles({0}) deben tener un nodo raíz con SyntaxKind.CompilationUnit.
fr: les arborescences({0}) doivent avoir un nœud racine avec SyntaxKind.CompilationUnit.
it: gli alberi ({0}) devono avere il nodo radice con SyntaxKind.CompilationUnit.
ja: ツリー ({0}) には SyntaxKind.CompilationUnit とのルート ノードが必要です。
ko: 트리({0})는 SyntaxKind.CompilationUnit을 사용하는 루트 노드여야 합니다.
pl: Element trees({0}) musi mieć węzeł główny z elementem SyntaxKind.CompilationUnit.
pt_br: árvores({0}) devem ter um nó raiz com SyntaxKind.CompilationUnit.
ru: Деревья({0}) должны иметь корневой узел SyntaxKind.CompilationUnit.
tr: ağaçların({0}) SyntaxKind.CompilationUnit içeren kök düğümü olmalıdır.
zh_hans: 树({0}) 必须具有带 SyntaxKind.CompilationUnit 的根节点。
zh_hant: trees({0}) 必須要有具備 SyntaxKind.CompilationUnit 的根節點。

source: Cannot add compiler special tree
cs: Nejde přidat zvláštní strom kompilátoru.
de: Spezieller Compilerbaum kann nicht hinzugefügt werden
es: No se puede agregar el árbol especial del compilador
fr: Impossible d'ajouter une arborescence spéciale du compilateur
it: Non è possibile aggiungere l'albero speciale del compilatore
ja: コンパイラの特殊ツリーを追加できません
ko: 컴파일러 특별 트리를 추가할 수 없습니다.
pl: Nie można dodać specjalnego drzewa kompilatora
pt_br: Não é possível adicionar a árvore especial do compilador
ru: Не удается добавить особое дерево компилятора
tr: Derleyici özel ağacı eklenemiyor
zh_hans: 无法添加特定于编译器的树
zh_hant: 無法加入編譯器特殊樹狀結構

source: Syntax tree already present
cs: Strom syntaxe už je přítomný.
de: Der Syntaxbaum ist bereits vorhanden.
es: Ya hay un árbol de sintaxis
fr: Arborescence de syntaxe déjà présente
it: L'albero della sintassi è già presente
ja: 構文ツリーが既に存在しています
ko: 구문 트리가 이미 있습니다.
pl: Drzewo składni już istnieje
pt_br: Árvore de sintaxe já está presente
ru: Синтаксическое дерево уже имеется
tr: Sözdizimi ağacı zaten var
zh_hans: 语法树已存在
zh_hant: 語法樹狀結構已存在

source: Submission can have at most one syntax tree.
cs: Odeslání musí mít aspoň jeden strom syntaxe.
de: Es kann nur ein Syntaxbaum übermittelt werden.
es: El envío puede tener, como máximo, un árbol de sintaxis.
fr: Une soumission peut avoir au plus une arborescence de syntaxe.
it: L'invio può avere al massimo un albero della sintassi.
ja: 送信に含めることができる構文ツリーは 1 つのみです。
ko: 구문 트리를 최대 하나만 제출할 수 있습니다.
pl: Przesłanie może mieć co najwyżej jedno drzewo składni.
pt_br: Envio pode ter no máximo uma árvore de sintaxe.
ru: Отправка может иметь максимум одно синтаксическое дерево.
tr: Gönderim en fazla bir sözdizimi ağacına sahip olabilir.
zh_hans: 提交最多可以具有一个语法树。
zh_hant: 提交最多可以有一個語法樹狀結構。

source: Cannot remove compiler special tree
cs: Nejde odebrat zvláštní strom kompilátoru.
de: Spezieller Compilerbaum kann nicht entfernt werden
es: No se puede quitar el árbol especial del compilador
fr: Impossible de supprimer l'arborescence spéciale du compilateur
it: Non è possibile rimuovere l'albero speciale del compilatore
ja: コンパイラの特殊ツリーを削除できません
ko: 컴파일러 특별 트리를 제거할 수 없습니다.
pl: Nie można usunąć specjalnego drzewa kompilatora
pt_br: Não é possível remover a árvore especial do compilador
ru: Не удается удалить особое дерево компилятора
tr: Derleyici özel ağacı kaldırılamıyor
zh_hans: 无法移除特定于编译器的树
zh_hant: 無法移除編譯器特殊樹狀結構
