Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DuplicateProcDefWithDifferentTupleNames2
source: '{0}' has multiple definitions with identical signatures with different tuple element names, including '{1}'.
cs: '{0} má více definicí s identickými podpisy s různými názvy elementů řazené kolekce členů, včetně {1}.
de: '"{0}" besitzt mehrere Definitionen mit identischen Signaturen mit verschiedenen Tupelelementnamen (einschließlich "{1}").
es: '{0}' tiene varias definiciones con firmas idénticas que tienen nombres de elementos de tupla diferentes, como '{1}'.
fr: '{0}' a plusieurs définitions comportant des signatures identiques avec des noms d'éléments tuples différents, notamment '{1}'.
it: '{0}' contiene più definizioni con firme identiche e nomi di elemento diversi, tra cui '{1}'.
ja: '{0}' には、'{1}' を含め、同じ署名で異なるタプル要素名の複数の定義が存在します。
ko: '{0}'에 '{1}'을(를) 비롯한 다른 튜플 요소 이름과 시니그처가 동일한 정의가 여러 개 있습니다.
pl: 'Element „{0}” ma wiele definicji z identycznymi sygnaturami z różnymi nazwami elementów krotki, w tym „{1}”.
pt_br: '{0}' tem várias definições com assinaturas idênticas com nomes de elementos de tupla diferentes, inclusive '{1}'.
ru: "{0}" имеет несколько определений с одинаковыми подписями, но разными именами элементов кортежа, в том числе "{1}".
tr: '{0}', '{1}' gibi farklı demet öğesi adlarının kullanıldığı aynı imzalara sahip birden fazla tanım içeriyor.
zh_hans: '“{0}”具有多个带不同元组元素名称却有相同签名的定义，包括“{1}”。
zh_hant: '{0}' 具有多個定義，且這些定義的簽章相同，但卻有不同的 Tuple 項目名稱，包括 '{1}'。

# ERR_BadInterfaceMethodFlags1
source: '{0}' is not valid on an interface method declaration.
cs: '{0} není platný v deklaraci metody rozhraní.
de: '"{0}" ist in einer Schnittstellen-Methodendeklaration ungültig.
es: '{0}' no es válido en una declaración de método de interfaz.
fr: '{0}' n'est pas valide dans une déclaration de méthode d'interface.
it: '{0}' non è valido in una dichiarazione di metodo di interfaccia.
ja: '{0}' は、インターフェイス メソッド宣言では有効ではありません。
ko: '인터페이스 메서드 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji metody interfejsu.
pt_br: "{0}" não é válido em uma declaração de método de interface.
ru: "{0}" является недопустимым объявлением метода интерфейса.
tr: '{0}', arabirim yöntemi bildiriminde geçerli değil.
zh_hans: '“{0}”在接口方法声明中无效。
zh_hant: '{0}' 在介面方法宣告中無效。

# ERR_NamedParamNotFound2
source: '{0}' is not a parameter of '{1}'.
cs: '{0} není parametr pro {1}.
de: '"{0}" ist kein Parameter von "{1}".
es: '{0}' no es un parámetro de '{1}'.
fr: '{0}' n'est pas un paramètre de '{1}'.
it: '{0}' non è un parametro di '{1}'.
ja: '{0}' は、'{1}' のパラメーターではありません。
ko: '{0}'은(는) '{1}'의 매개 변수가 아닙니다.
pl: 'Element „{0}” nie jest parametrem elementu „{1}”.
pt_br: "{0}" não é um parâmetro de "{1}".
ru: "{0}" не является параметром "{1}".
tr: '{0}', bir '{1}' parametresi değil.
zh_hans: '“{0}”不是“{1}”的参数。
zh_hant: '{0}' 不是 '{1}' 的參數。

# ERR_BadInterfacePropertyFlags1
source: '{0}' is not valid on an interface property declaration.
cs: '{0} není platný v deklaraci vlastnosti rozhraní.
de: '"{0}" ist in einer Schnittstellen-Eigenschaftendeklaration ungültig.
es: '{0}' no es válido en una declaración de propiedad de interfaz.
fr: '{0}' n'est pas valide dans une déclaration de propriété d'interface.
it: '{0}' non è valido in una dichiarazione di proprietà di interfaccia.
ja: '{0}' は、インターフェイス プロパティ宣言では有効ではありません。
ko: '인터페이스 속성 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji właściwości interfejsu.
pt_br: "{0}" não é válido em uma declaração de propriedade de interface.
ru: "{0}" является недопустимым объявлением свойства интерфейса.
tr: '{0}', arabirim özelliği bildiriminde geçerli değil.
zh_hans: '“{0}”在接口属性声明中无效。
zh_hant: '{0}' 在介面屬性宣告中無效。

# ERR_NamedArgUsedTwice2
source: Parameter '{0}' of '{1}' already has a matching argument.
cs: Parametr {0} metody {1} už má odpovídající argument.
de: Der Parameter "{0}" von "{1}" hat bereits ein entsprechendes Argument.
es: El parámetro '{0}' de '{1}' ya tiene un argumento correspondiente.
fr: Le paramètre '{0}' de '{1}' a déjà un argument correspondant.
it: Il parametro '{0}' di '{1}' ha già un argomento corrispondente.
ja: '{1}' のパラメーター '{0}' には、一致する引数が既に存在します。
ko: '{1}'의 '{0}' 매개 변수와 일치하는 인수가 이미 있습니다.
pl: Parametr „{0}” („{1}”) ma już zgodny argument.
pt_br: O parâmetro "{0}" de "{1}" já tem um argumento correspondente.
ru: Параметр "{0}" "{1}" уже имеет соответствующий аргумент.
tr: '{0}' / '{1}' parametresinin zaten eşleşen bir bağımsız değişkeni var.
zh_hans: “{1}”的参数“{0}”已有匹配的参数。
zh_hant: '{1}' 的參數 '{0}' 已有相符的引數。

# ERR_InterfaceCantUseEventSpecifier1
source: '{0}' is not valid on an interface event declaration.
cs: '{0} není platný v deklaraci události rozhraní.
de: '"{0}" ist in einer Schnittstellen-Ereignisdeklaration ungültig.
es: '{0}' no es válido en una declaración de evento de interfaz.
fr: '{0}' n'est pas valide dans une déclaration event d'interface.
it: '{0}' non è valido in una dichiarazione di evento di interfaccia.
ja: '{0}' は、インターフェイス イベント宣言では有効ではありません。
ko: '인터페이스 이벤트 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji zdarzenia interfejsu.
pt_br: "{0}" não é válido em uma declaração de evento de interface.
ru: "{0}" является недопустимым объявлением события интерфейса.
tr: '{0}', bir arabirim olay bildiriminde geçerli değil.
zh_hans: '“{0}”在接口事件声明中无效。
zh_hant: '{0}' 在介面事件宣告中無效。

# ERR_TypecharNoMatch2
source: Type character '{0}' does not match declared data type '{1}'.
cs: Znak typu {0} neodpovídá deklarovanému datovému typu {1}.
de: Das Typzeichen "{0}" entspricht nicht dem deklarierten Datentyp "{1}".
es: El carácter de tipo '{0}' no coincide con el tipo de datos '{1}' declarado.
fr: Le caractère de type '{0}' ne correspond pas au type de données déclaré '{1}'.
it: Il carattere tipo '{0}' non corrisponde al tipo dati dichiarato '{1}'.
ja: 型文字 '{0}' が宣言されたデータ型 '{1}' と一致しません。
ko: '{0}' 형식 문자가 선언된 '{1}' 데이터 형식과 일치하지 않습니다.
pl: Znak typu „{0}” nie odpowiada zadeklarowanemu typowi danych „{1}”.
pt_br: Caractere de tipo "{0}" não coincide com o tipo de dados declarado "{1}".
ru: Тип символа "{0}" не соответствует объявленному типу данных "{1}".
tr: '{0}' tür karakteri bildirilen '{1}' veri türüyle eşleşmiyor.
zh_hans: 类型字符“{0}”与声明的数据类型“{1}”不匹配。
zh_hant: 類型字元 '{0}' 不符合宣告的資料類型 '{1}'。

# ERR_ExpectedSubOrFunction
source: 'Sub' or 'Function' expected after 'Delegate'.
cs: 'Za klíčovým slovem Delegate se očekávalo klíčové slovo Sub nebo Function.
de: '"Sub" oder "Function" nach "Delegate" erwartet.
es: 'Se esperaba 'Sub' o 'Function' después de 'Delegate'.
fr: 'Sub' ou 'Function' attendu après 'Delegate'.
it: 'È previsto 'Sub' o 'Function' dopo 'Delegate'.
ja: 'Delegate' の後には、'Sub' または 'Function' が必要です。
ko: 'Delegate' 뒤에 'Sub' 또는 'Function'이 필요합니다.
pl: 'Oczekiwano instrukcji Sub lub Function po instrukcji Delegate.
pt_br: 'Sub' ou 'Function' esperado após 'Delegate'.
ru: 'После "Delegate" требуется "Sub" или "Function".
tr: 'Delegate' öğesinden sonra 'Sub' veya 'Function' bekleniyor.
zh_hans: '“Delegate”后面应为“Sub”或“Function”。
zh_hant: 'Delegate' 之後必須有 'Sub' 或 'Function'。

# ERR_BadEmptyEnum1
source: Enum '{0}' must contain at least one member.
cs: Výčet {0} musí obsahovat nejmíň jeden člen.
de: Die Enumeration "{0}" muss mindestens einen Member enthalten.
es: La enumeración “{0}” debe contener al menos un miembro.
fr: Enum '{0}' doit contenir au moins un membre.
it: L'enumerazione '{0}' deve contenere almeno un membro.
ja: Enum '{0}' は少なくとも 1 つのメンバーを含んでいる必要があります。
ko: 열거형 '{0}'에는 하나 이상의 멤버가 있어야 합니다.
pl: Wyliczenie „{0}” musi zawierać co najmniej jedną składową.
pt_br: Enum "{0}" deve conter pelo menos um membro.
ru: Перечисление "{0}" должно содержать хотя бы один член.
tr: '{0}' sabit listesi en az bir üye içermelidir.
zh_hans: 枚举“{0}”必须至少包含一个成员。
zh_hant: 列舉 '{0}' 至少必須包含一個成員。

# ERR_InvalidConstructorCall
source: Constructor call is valid only as the first statement in an instance constructor.
cs: Volání konstruktoru je platné jenom jako první příkaz v konstruktoru instance.
de: Ein Aufruf eines Konstruktors ist nur als erste Anweisung in einem Instanzenkonstruktor gültig.
es: La llamada a un constructor solo es válida como primera instrucción de un constructor de instancia.
fr: Un appel à un constructeur est valide uniquement en tant que première instruction dans un constructeur d'instance.
it: Una chiamata a un costruttore è valida solo come prima istruzione in un costruttore di istanza.
ja: コンストラクターの呼び出しは、インスタンス コンストラクター内の最初のステートメントとしてのみ有効です。
ko: 인스턴스 생성자의 첫째 문으로만 생성자를 호출할 수 있습니다.
pl: Wywołanie konstruktora jest prawidłowe tylko jako pierwsza instrukcja w konstruktorze wystąpienia.
pt_br: A chamada de construtor é válida somente como a primeira instrução em um construtor de instância.
ru: Вызов конструктора допустим только как первый оператор в конструкторе экземпляра.
tr: Oluşturucu çağrısı yalnızca örnek oluşturucudaki ilk deyim olduğunda geçerlidir.
zh_hans: 构造函数调用仅作为实例构造函数中的第一条语句有效。
zh_hant: 只在當做執行個體建構函式中第一個陳述式時，建構函式呼叫才有效。

# ERR_CantOverrideConstructor
source: 'Sub New' cannot be declared 'Overrides'.
cs: 'Pro proceduru Sub New nejde použít deklaraci Overrides.
de: '"Sub New" kann nicht als "Overrides" deklariert werden.
es: 'Sub New' no se puede declarar como 'Overrides'.
fr: 'Sub New' ne peut pas être déclaré 'Overrides'.
it: 'Sub New' non può essere dichiarato come 'Overrides'.
ja: 'Sub New' を 'Overrides' として宣言することはできません。
ko: 'Sub New'는 'Overrides'로 선언할 수 없습니다.
pl: 'Nie można zadeklarować elementu Sub New jako Overrides.
pt_br: 'Sub New' não pode ser declarada como 'Overrides'.
ru: '"Sub New" не может объявляться как "Overrides".
tr: 'Sub New', 'Overrides' olarak bildirilemez.
zh_hans: '“Sub New”不能声明为“Overrides”。
zh_hant: '無法將 'Sub New' 宣告為 'Overrides'。

# ERR_ConstructorCannotBeDeclaredPartial
source: 'Sub New' cannot be declared 'Partial'.
cs: 'Pro proceduru Sub New nelze použít deklaraci Partial.
de: '"Sub New" kann nicht als "Partial" deklariert werden.
es: 'Sub New' no se puede declarar como 'Partial'.
fr: 'Sub New' ne peut pas être déclaré 'Partial'.
it: 'Sub New' non può essere dichiarato come 'Partial'.
ja: 'Sub New' は 'Partial' として宣言できません。
ko: 'Sub New'는 'Partial'로 선언할 수 없습니다.
pl: 'Nie można zadeklarować elementu „Sub New” jako „Partial”.
pt_br: "Sub New" não pode ser declarado como "Partial".
ru: '"Sub New" нельзя объявить как "Partial".
tr: 'Sub New' 'Partial' olarak bildirilemez.
zh_hans: '“Sub New”不能声明为“Partial”。
zh_hant: 'Sub New' 不可宣告為 'Partial'。

# ERR_ModuleEmitFailure
source: Failed to emit module '{0}': {1}
cs: Nepovedlo se vygenerovat modul {0}: {1}
de: Fehler beim Ausgeben von Modul "{0}": {1}
es: No se pudo emitir el módulo "{0}": {1}
it: Non è stato possibile creare il modulo '{0}': {1}
ja: モジュール '{0}' の生成に失敗しました: {1}
ko: 모듈 '{0}'을(를) 내보내지 못했습니다. {1}
pl: Wyemitowanie modułu „{0}” nie powiodło się: {1}
pt_br: Falha ao emitir o módulo '{0}': {1}
ru: Не удалось выдать модуль "{0}": {1}
tr: '{0}' modülü gösterilemedi: {1}
zh_hans: 未能发出模块“{0}”: {1}
zh_hant: 無法發出模組 '{0}': {1}

# ERR_OverrideNotNeeded3
source: {0} '{1}' cannot be declared 'Overrides' because it does not override a {0} in a base class.
cs: Pro {0} – {1} nejde použít deklaraci Overrides, protože nepřepisuje typ {0} v základní třídě.
de: {0} "{1}" kann nicht als "Overrides" deklariert werden, da es kein {0} in einer Basisklasse überschreibt.
es: {0} '{1}' no se puede declarar 'Overrides' porque no invalida {0} en una clase base.
fr: {0} '{1}' ne peut pas être déclaré 'Overrides', car il ne se substitue pas à un {0} dans une classe de base.
it: {0} '{1}' non può essere dichiarato come 'Overrides' perché non esegue l'override di un elemento {0} in una classe di base.
ja: 基底クラスで {0} をオーバーライドしないため、{0} '{1}' を 'Overrides' として宣言することはできません。
ko: {0} '{1}'은(는) 기본 클래스의 {0}을(를) 재정의하지 않으므로 'Overrides'로 선언할 수 없습니다.
pl: Nie można zadeklarować elementu {0} „{1}” jako „Overrides”, ponieważ nie przesłania on elementu {0} w klasie bazowej.
pt_br: {0} "{1}" não pode ser declarado como "Overrides" porque não substitui um {0} em uma classe base.
ru: {0} "{1}" не может быть объявлен как "Overrides", так как он не переопределяет {0} в базовом классе.
tr: {0} '{1}', bir temel sınıfta {0} öğesini geçersiz kılmadığından, 'Overrides' olarak bildirilemez.
zh_hans: {0}“{1}”不能声明为“Overrides”，因为它不重写基类中的 {0}。
zh_hant: {0} '{1}' 不可宣告為 'Overrides'，因為其在基底類別中不會覆寫 {0}。

# ERR_ExpectedDot
source: '.' expected.
cs: 'Očekávala se tečka.
de: '"." erwartet.
es: 'Se esperaba '.'.
fr: '.' attendu.
it: 'È previsto il punto ('.').
ja: '.' が必要です。
ko: '.'가 필요합니다.
pl: 'Oczekiwano znaku „.”.
pt_br: '.' esperado.
ru: 'Требуется ".".
tr: '.' bekleniyor.
zh_hans: '应为“.”。
zh_hant: '必須有 '.'。

# ERR_DuplicateLocals1
source: Local variable '{0}' is already declared in the current block.
cs: Lokální proměnná {0} je už v aktuálním bloku deklarovaná.
de: Die lokale Variable "{0}" ist bereits im aktuellen Block deklariert.
es: La variable local '{0}' ya se ha declarado en el bloque actual.
fr: La variable locale '{0}' est déjà déclarée dans le bloc actuel.
it: La variabile locale '{0}' è già dichiarata nel blocco corrente.
ja: ローカル変数 '{0}' は現在のブロックで既に宣言されています。
ko: '{0}' 지역 변수가 현재 블록에 이미 선언되었습니다.
pl: Zmienna lokalna „{0}” jest już zadeklarowana w bieżącym bloku.
pt_br: A variável local "{0}" já está declarada no bloco atual.
ru: Локальная переменная "{0}" уже объявлена в текущем блоке.
tr: Geçerli blokta '{0}' yerel değişkeni zaten bildirildi.
zh_hans: 当前块中已声明了局部变量“{0}”。
zh_hant: 目前區塊中已宣告過區域變數 '{0}'。

# ERR_InvInsideEndsProc
source: Statement cannot appear within a method body. End of method assumed.
cs: Příkaz se nemůže objevit v těle metody. Předpokládá se konec metody.
de: Eine Anweisung kann nicht innerhalb eines Methodenkörpers verwendet werden. Das Ende der Methode wird angenommen.
es: La instrucción no puede aparecer dentro de un cuerpo de método. Se supone el final del método.
fr: Cette instruction ne peut pas apparaître dans le corps d'une méthode. Elle est interprétée comme la fin de la méthode.
it: L'istruzione non può trovarsi in un corpo del metodo. Verrà interpretata come fine del metodo.
ja: ステートメントをメソッド本体の内部に表示することはできません。メソッド本体の終了と見なします。
ko: 메서드 본문 안에는 문을 사용할 수 없습니다. 메서드의 끝으로 간주합니다.
pl: Instrukcja nie może wystąpić w treści metody. Założono koniec metody.
pt_br: A instrução não pode aparecer dentro do corpo de um método. Fim do método assumido.
ru: Оператор не может присутствовать в теле метода. Предполагается, что метод закончен.
tr: Yöntem gövdesi içinde deyim bulunamaz. Yöntem sonu varsayıldı.
zh_hans: 语句不能出现在方法主体内。假定为方法末尾。
zh_hant: 陳述式不可以在方法主體中出現。已假設是方法結尾。

# ERR_LocalSameAsFunc
source: Local variable cannot have the same name as the function containing it.
cs: Lokální proměnná nemůže mít stejný název jako funkce, která ji obsahuje.
de: Eine lokale Variable darf nicht denselben Namen haben wie die Funktion, in der sie enthalten ist.
es: La variable local no puede tener el mismo nombre que la función que la contiene.
fr: Une variable locale ne peut pas avoir le même nom que la fonction qui la contient.
it: La variabile locale non può avere lo stesso nome della funzione in cui è contenuta.
ja: ローカル変数に、それを含む関数と同じ名前を指定することはできません。
ko: 지역 변수에는 해당 변수가 포함된 함수와 같은 이름을 사용할 수 없습니다.
pl: Zmienna lokalna nie może mieć takiej samej nazwy jak zawierająca ją funkcja.
pt_br: A variável local não pode ter o mesmo nome de função que a contém.
ru: Имя локальной переменной не может совпадать с именем содержащей ее функции.
tr: Yerel değişken, kendisini kapsayan işlevle aynı ada sahip olamaz.
zh_hans: 局部变量不能与包含它的函数同名。
zh_hant: 區域變數不可以和包含它的函式具有相同名稱。

# ERR_RecordEmbeds2
source: '{0}' contains '{1}' (variable '{2}').
cs: {0} obsahuje {1} (proměnná {2}).
de: "{0}" enthält "{1}" (Variable "{2}").
es: '{0}' contiene '{1}' (variable '{2}').
fr: '{0}' contient '{1}' (variable '{2}').
it: '{0}' contiene '{1}' (variabile '{2}').
ja: '{0}' は '{1}' を含みます (変数 '{2}')。
ko: '{0}'이(가) '{1}'('{2}' 변수)을(를) 포함합니다.
pl: Element „{0}” zawiera element „{1}” (zmienna „{2}”).
pt_br: "{0}" contém "{1}" (variável "{2}").
ru: "{0}" содержит "{1}" (переменная "{2}").
tr: '{0}', '{1}' içeriyor (değişken '{2}').
zh_hans: “{0}”包含“{1}”(变量“{2}”)。
zh_hant: '{0}' 包含 '{1}' (變數 '{2}')。

# ERR_RecordCycle2
source: Structure '{0}' cannot contain an instance of itself: {1}
cs: Struktura {0} nemůže obsahovat instanci sebe sama: {1}.
de: Die Struktur "{0}" kann keine Instanz von sich selbst enthalten: {1}
es: La estructura '{0}' no puede contener una instancia de sí misma: {1}
fr: La structure '{0}' ne peut pas contenir une instance d'elle-même : {1}
it: La struttura '{0}' non può contenere un'istanza di se stessa: {1}
ja: 構造体 '{0}' に、それ自体のインスタンスを含めることはできません: {1}
ko: '{0}' 구조체는 자체 인스턴스({1})를 포함할 수 없습니다.
pl: Struktura „{0}” nie może zawierać wystąpienia samej siebie: {1}.
pt_br: Estrutura "{0}" não pode conter uma instância de si mesma: {1}
ru: Структура "{0}" не может содержать экземпляр самой себя: {1}
tr: '{0}' yapısı kendi örneğini içeremez: {1}
zh_hans: 结构“{0}”不能包含自身的实例: {1}
zh_hant: 結構 '{0}' 不可包含本身的執行個體: {1}

# ERR_InterfaceCycle1
source: Interface '{0}' cannot inherit from itself: {1}
cs: Rozhraní {0} nemůže dědit samo od sebe: {1}.
de: Die {0}-Schnittstelle kann nicht von sich selbst erben: {1}
es: La interfaz '{0}' no puede heredarse de: {1}
fr: L'interface '{0}' ne peut pas hériter d'elle-même : {1}
it: L'interfaccia '{0}' non può ereditare da se stessa: {1}
ja: クラス '{0}' はそれ自体から継承することはできません: {1}
ko: '{0}' 인터페이스는 자체 인터페이스({1})에서 상속할 수 있습니다.
pl: Interfejs „{0}” nie może dziedziczyć po samym sobie: {1}
pt_br: Interface "{0}" não pode herdar de si mesma: {1}
ru: Интерфейс "{0}" не может наследовать от себя самого: {1}
tr: '{0}' arabirimi kendi kendinden devralamaz: {1}
zh_hans: 接口“{0}”不能从自身继承: {1}
zh_hant: 介面 '{0}' 無法繼承其本身: {1}

# ERR_SubNewCycle2
source: '{0}' calls '{1}'.
cs: {0} volá {1}.
de: "{0}" ruft "{1}" auf.
es: '{0}' llama a '{1}'.
fr: '{0}' appelle '{1}'.
it: '{0}' chiama '{1}'.
ja: '{0}' は '{1}' を呼び出します。
ko: '{0}'에서 '{1}'을(를) 호출합니다.
pl: Element „{0}” wywołuje element „{1}”.
pt_br: "{0}" chama "{1}".
ru: "{0}" вызывает "{1}".
tr: '{0}', '{1}' çağrısı yapıyor.
zh_hans: “{0}”调用“{1}”。
zh_hant: '{0}' 呼叫 '{1}'。

# ERR_SubNewCycle1
source: Constructor '{0}' cannot call itself: {1}
cs: Konstruktor {0} nemůže volat sám sebe: {1}.
de: Der Konstruktor "{0}" kann sich nicht selbst aufrufen: {1}
es: El constructor '{0}' no se puede llamar a sí mismo: {1}
fr: Le constructeur '{0}' ne peut pas s'appeler lui-même : {1}
it: Il costruttore '{0}' non può chiamare se stesso: {1}
ja: コンストラクター '{0}' からそれ自体を呼び出すことはできません: {1}
ko: '{0}' 생성자는 자신({1})을 호출할 수 없습니다.
pl: Konstruktor „{0}” nie może wywoływać samego siebie: {1}
pt_br: Construtor "{0}" não pode chamar a si mesmo: {1}
ru: Конструктор "{0}" не может вызывать сам себя: {1}
tr: '{0}' oluşturucusu kendi kendini çağıramaz: {1}
zh_hans: 构造函数“{0}”不能调用自身: {1}
zh_hant: 建構函式 '{0}' 不可呼叫其本身: {1}

# ERR_InheritsFromCantInherit3
source: '{0}' cannot inherit from {2} '{1}' because '{1}' is declared 'NotInheritable'.
cs: '{0} nemůže dědit z {2} {1}, protože {1} se deklaruje jako NotInheritable.
de: '"{0}" kann nicht von {2} "{1}" erben, da "{1}" als "NotInheritable" deklariert ist.
es: '{0}' no puede heredarse de {2} '{1}' porque '{1}' está declarado como 'NotInheritable'.
fr: '{0}' ne peut pas hériter de {2} '{1}', car '{1}' est déclaré 'NotInheritable'.
it: '{0}' non può ereditare da {2} '{1}' perché '{1}' è dichiarata come 'NotInheritable'.
ja: '{0}' を {2} '{1}' から継承できません。'{1}' は 'NotInheritable' として宣言されています。
ko: '{1}'이(가) 'NotInheritable'로 선언되었으므로 '{0}'은(는) {2} '{1}'에서 상속할 수 없습니다.
pl: 'Element „{0}” nie może dziedziczyć po elemencie {2} „{1}”, ponieważ element „{1}” jest zadeklarowany jako „NotInheritable”.
pt_br: "{0}" não pode herdar de {2} "{1}" porque "{1}" é declarado "NotInheritable".
ru: "{0}" не может наследовать от {2} "{1}", поскольку "{1}" объявлен как "NotInheritable".
tr: '{1}' 'NotInheritable' olarak bildirildiğinden '{0}', {2} '{1}' öğesinden devralamaz.
zh_hans: '“{1}”已声明为“NotInheritable”，因此“{0}”无法从 {2}“{1}”继承。
zh_hant: '{0}' 無法從 {2} '{1}' 繼承，因為 '{1}' 已宣告為 'NotInheritable'。

# ERR_OverloadWithOptional2
source: '{0}' and '{1}' cannot overload each other because they differ only by optional parameters.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom nepovinnými parametry.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sie sich nur durch optionale Parameter unterscheiden.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro porque solo se diferencian en parámetros opcionales.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seuls les paramètres optionnels les différencient.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per i parametri facoltativi.
ja: '{0}' と '{1}' では、省略可能なパラメーターのみが異なるため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 선택적 매개 변수만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie parametrami opcjonalnymi.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque diferem somente por parâmetros opcionais.
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по необязательным параметрам.
tr: 'Yalnızca isteğe bağlı parametreleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}” 和“{1}”的差异仅在于可选参数，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於選擇性參數不同。

# ERR_OverloadWithReturnType2
source: '{0}' and '{1}' cannot overload each other because they differ only by return types.
cs: '{0} a {1} se nemůžou vzájemně přetěžovat, protože se liší jenom typy vrácených hodnot.
de: '"{0}" und "{1}" können sich nicht gegenseitig überladen, da sie sich nur durch Rückgabetypen unterscheiden.
es: '{0}' y '{1}' no se pueden sobrecargar el uno al otro porque solo se diferencian en los tipos de valor devueltos.
fr: '{0}' et '{1}' ne peuvent pas se surcharger mutuellement, car seuls les types de retour les différencient.
it: '{0}' e '{1}' non possono essere in rapporto di overload perché si differenziano solo per i tipi restituiti.
ja: '{0}' と '{1}' では、戻り値の型のみが異なるため、お互いをオーバーロードすることはできません。
ko: '{0}'과(와) '{1}'은(는) 반환 형식만 다르므로 서로 오버로드할 수 없습니다.
pl: Elementy „{0}” i „{1}” nie mogą przeciążać siebie nawzajem, ponieważ różnią się jedynie zwracanymi typami.
pt_br: "{0}" e "{1}" não podem sobrecarregar um ao outro porque diferem somente por tipos de retorno.
ru: "{0}" и "{1}" не могут переопределить друг друга, так как они отличаются только по возвращаемым типам.
tr: 'Yalnızca dönüş türleri farklı olduğundan, '{0}' ve '{1}' birbirini aşırı yükleyemez.
zh_hans: '“{0}”和“{1}”的差异仅在于返回类型，因此它们无法重载对方。
zh_hant: '{0}' 和 '{1}' 無法互相多載，因為它們的差異只在於傳回類型不同而已。

# ERR_TypeCharWithType1
source: Type character '{0}' cannot be used in a declaration with an explicit type.
cs: Znak typu {0} nejde použít v deklaraci explicitního typu.
de: Das Typzeichen "{0}" kann nicht in einer Deklaration mit einem expliziten Typ verwendet werden.
es: El carácter de tipo '{0}' no se puede usar en una declaración con un tipo explícito.
fr: Le caractère de type '{0}' ne peut pas être utilisé dans une déclaration avec un type explicite.
it: Il carattere tipo '{0}' non può essere usato in una dichiarazione con un tipo esplicito.
ja: 明示的な型を含む宣言では、型文字 '{0}' を使用できません。
ko: 명시적 형식이 있는 선언에는 '{0}' 형식 문자를 사용할 수 없습니다.
pl: Nie można użyć znaku typu „{0}” w deklaracji z typem jawnym.
pt_br: Caractere de tipo "{0}" não pode ser usado em uma declaração com um tipo explícito.
ru: Тип символа "{0}" не может быть использован в объявлении с явным типом.
tr: '{0}' tür karakteri açık bir türü olan bildirimde kullanılamaz.
zh_hans: 在具有显式类型的声明中不能使用类型字符“{0}”。
zh_hant: 類型字元 '{0}' 不可用在明確類型的宣告中。
