Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_AssemblyGeneration0_Title
source: Possible problem detected while building assembly
cs: Při sestavování sestavení se zjistily možné potíže.
de: Beim Erstellen der Assembly wurde ein mögliches Problem gefunden.
es: Se ha detectado un posible problema al compilar el ensamblado
fr: Problème potentiel détecté lors de la génération de l’assembly
it: È stato rilevato un possibile problema durante la compilazione dell'assembly
ja: アセンブリのビルド中に検出された可能性がある問題
ko: 어셈블리를 빌드하는 동안 발생 가능한 문제가 발견되었습니다.
pl: Wykryto potencjalny problem podczas kompilowania zestawu
pt_br: Possível problema detectado durante a compilação do assembly
ru: Обнаружена возможная проблема при создании сборки
tr: Derleme oluşturulurken olası bir sorun algılandı
zh_hans: 生成程序集时检测到可能的问题
zh_hant: 建置組件時偵測的可能問題

# WRN_AssemblyGeneration1
source: Possible problem detected while building assembly '{0}': {1}
cs: Při sestavování sestavení {0} se zjistily možné potíže: {1}.
de: Beim Erstellen der Assembly "{0}" wurde möglicherweise ein Problem entdeckt: {1}
es: Posible problema detectado al compilar el ensamblado '{0}': {1}
fr: Problème possible détecté pendant la génération de l'assembly : '{0}' : {1}
it: È stato rilevato un possibile problema durante la compilazione dell'assembly '{0}': {1}
ja: アセンブリ '{0}' をビルド中に問題が発生した可能性があります: {1}
ko: '{0}' 어셈블리를 빌드하는 동안 발생 가능한 문제가 발견되었습니다({1}).
pl: Wykryto potencjalny problem podczas kompilowania zestawu „{0}”: {1}.
pt_br: Possível problema detectado ao compilar o assembly "{0}": {1}
ru: При создании сборки обнаружена потенциальная проблема "{0}": {1}
tr: '{0}' derlemesi oluşturulurken olası bir sorun algılandı: {1}
zh_hans: 生成程序集“{0}”时检测到可能存在的问题: {1}
zh_hant: 建置組件 '{0}' 時偵測到的可能問題: {1}

# WRN_AssemblyGeneration1_Title
source: Possible problem detected while building assembly
cs: Při sestavování sestavení se zjistily možné potíže.
de: Beim Erstellen der Assembly wurde ein mögliches Problem gefunden.
es: Se ha detectado un posible problema al compilar el ensamblado
fr: Problème potentiel détecté lors de la génération de l’assembly
it: È stato rilevato un possibile problema durante la compilazione dell'assembly
ja: アセンブリのビルド中に検出された可能性がある問題
ko: 어셈블리를 빌드하는 동안 발생 가능한 문제가 발견되었습니다.
pl: Wykryto potencjalny problem podczas kompilowania zestawu
pt_br: Possível problema detectado durante a compilação do assembly
ru: Обнаружена возможная проблема при создании сборки
tr: Derleme oluşturulurken olası bir sorun algılandı
zh_hans: 生成程序集时检测到可能的问题
zh_hant: 建置組件時偵測的可能問題

# WRN_ComClassNoMembers1
source: 'Microsoft.VisualBasic.ComClassAttribute' is specified for class '{0}' but '{0}' has no public members that can be exposed to COM; therefore, no COM interfaces are generated.
cs: 'Atribut Microsoft.VisualBasic.ComClassAttribute je určený pro třídu {0}, ale ta neobsahuje žádné veřejné členy, které by bylo možné vystavit rozhraní COM. Rozhraní COM se proto nevygenerují.
de: 'Microsoft.VisualBasic.ComClassAttribute ist für die Klasse "{0}" festgelegt, "{0}" hat jedoch keine öffentlichen Member, die für COM verfügbar gemacht werden können. Es wurden daher keine COM-Schnittstellen generiert.
es: 'Se ha especificado 'Microsoft.VisualBasic.ComClassAttribute' para la clase '{0}', pero '{0}' no tiene miembros públicos que se puedan exponer a COM; por tanto, no se ha generado ninguna interfaz COM.
fr: 'Microsoft.VisualBasic.ComClassAttribute' est spécifié pour la classe '{0}', mais '{0}' n'a pas de membres publics pouvant être exposés à COM ; par conséquent, aucune interface COM n'est générée.
it: 'È stato specificato 'Microsoft.VisualBasic.ComClassAttribute' per la classe '{0}', ma '{0}' non ha membri pubblici che possano essere esposti a COM, pertanto non sono state generate interfacce COM.
ja: 'Microsoft.VisualBasic.ComClassAttribute' がクラス '{0}' に対して指定されていますが、'{0}' には COM に公開できるパブリック メンバーが含まれていないため、COM インターフェイスは生成されません。
ko: '{0}' 클래스에 'Microsoft.VisualBasic.ComClassAttribute'가 지정되어 있지만 COM에 노출할 수 있는 public 멤버가 '{0}'에 없으므로 COM 인터페이스가 생성되지 않았습니다.
pl: 'Element „Microsoft.VisualBasic.ComClassAttribute” jest określony dla klasy „{0}”, ale klasa „{0}” nie ma publicznych składowych, których można ujawnić w modelu COM. Z tego powodu nie wygenerowano interfejsów modelu COM.
pt_br: "Microsoft.VisualBasic.ComClassAttribute" está especificado para a classe "{0}", mas "{0}" não tem membros públicos que podem ser expostos ao COM; portanto, nenhuma interfaces COM é gerada.
ru: '"Microsoft.VisualBasic.ComClassAttribute" указан для класса "{0}", но "{0}" не имеет открытых членов, которые могут быть использованы через COM; поэтому COM-интерфейсы не создаются.
tr: '{0}' sınıfı için 'Microsoft.VisualBasic.ComClassAttribute' belirtildi, ancak '{0}' COM'ye açılabilir bir genel üye içermediğinden hiç COM arabirimi oluşturulmadı.
zh_hans: '为类“{0}”指定了“Microsoft.VisualBasic.ComClassAttribute”，但“{0}”没有可以向 COM 公开的公共成员；因此不生成 COM 接口。
zh_hant: '為類別 '{0}' 指定了 'Microsoft.VisualBasic.ComClassAttribute'，但 '{0}' 沒有可公開至 COM 的公用成員。因此，未產生 COM 介面。

# WRN_ComClassNoMembers1_Title
source: 'Microsoft.VisualBasic.ComClassAttribute' is specified for class but class has no public members that can be exposed to COM
cs: 'Microsoft.VisualBasic.ComClassAttribute slouží pro třídu. Třída ale nemá žádné veřejné členy, které by se daly vystavit do modelu COM.
de: '"Microsoft.VisualBasic.ComClassAttribute" wird für die Klasse angegeben, die Klasse weist jedoch keine öffentlichen Member auf, die für COM verfügbar gemacht werden kann.
es: 'Microsoft.VisualBasic.ComClassAttribute' está especificado para la clase pero esta no tiene miembros públicos que se puedan exponer en COM
fr: 'Microsoft.VisualBasic.ComClassAttribute' est spécifié pour la classe, mais celle-ci n’a pas de membres publics pouvant être exposés à COM
it: 'Per la classe è stato specificato 'Microsoft.VisualBasic.ComClassAttribute', ma la classe non contiene membri pubblici che è possibile esporre a COM
ja: 'クラスに対して 'Microsoft.VisualBasic.ComClassAttribute' が指定されていますが、COM に公開できる public メンバーがクラスに含まれていません
ko: 'Microsoft.VisualBasic.ComClassAttribute'가 클래스에 지정되었지만 COM에 노출할 수 있는 공용 멤버가 클래스에 없음
pl: 'Atrybut „Microsoft.VisualBasic.ComClassAttribute” został określony dla klasy, ale klasa nie zawiera publicznych składowych, które można ujawnić modelowi COM
pt_br: 'Microsoft.VisualBasic.ComClassAttribute' está especificado para a classe, mas a classe tem não membros públicos que podem ser expostos a COM
ru: 'Атрибут Microsoft.VisualBasic.ComClassAttribute указан для класса, но класс не содержит открытые члены, которые можно предоставить для COM
tr: Sınıf için 'Microsoft.VisualBasic.ComClassAttribute' belirtildi, ancak sınıf COM'a sunulabilir genel üye içermiyor
zh_hans: '为类指定了 "Microsoft.VisualBasic.ComClassAttribute"，但类没有可向 COM 公开的公共成员
zh_hant: '為類別指定了 'Microsoft.VisualBasic.ComClassAttribute'，但類別沒有可對 COM 公開的 Public 成員

# WRN_SynthMemberShadowsMember5
source: {0} '{1}' implicitly declares '{2}', which conflicts with a member in the base {3} '{4}', and so the {0} should be declared 'Shadows'.
cs: {0} – {1} implicitně deklaruje název {2}, který je v konfliktu se členem v základní třídě {3} – {4}, takže by se pro {0} měla používat deklarace Shadows.
de: {0} "{1}" deklariert implizit "{2}", was einen Konflikt mit einem Member in Basis-{3} "{4}" verursacht. {0} sollte daher als "Shadows" deklariert werden.
es: {0} '{1}' declara implícitamente a '{2}', que entra en conflicto con un miembro de la base {3} '{4}' y, por lo tanto, el {0} se debe declarar como 'Shadows'.
fr: {0} '{1}' déclare implicitement '{2}', qui est en conflit avec un membre dans le {3} '{4}' de base, {0} doit être déclaré 'Shadows'.
it: {0} '{1}' dichiara in modo implicito '{2}', che è in conflitto con un membro della {3} base '{4}'. '{0}' deve quindi essere dichiarato come 'Shadows'.
ja: {0} '{1}' は、ベース {3} '{4}' のメンバーと競合する '{2}' を暗黙的に宣言するため、{0} は 'Shadows' と宣言しなければなりません。
ko: {0} '{1}'은(는) 기본 {3} '{4}'의 멤버와 충돌하는 '{2}'을(를) 암시적으로 선언하므로 {0}을(를) 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” niejawnie deklaruje element „{2}”, który powoduje konflikt ze składową w bazowym elemencie {3} „{4}” i dlatego element {0} powinien być zadeklarowany jako „Shadows”.
pt_br: {0} "{1}" declara implicitamente "{2}", o qual está em conflito com um membro na base {3} "{4}" e, portanto, o {0} deve ser declarado como "Shadows".
ru: {0} "{1}" неявно объявляет "{2}", что конфликтует с членом в базе {3} "{4}", поэтому {0} должен быть объявлен "Shadows".
tr: {0} '{1}', {3} '{4}' temelinde bir üyeyle çakışan '{2}' öğesini örtük olarak bildiriyor, bu nedenle {0} 'Shadows' olarak bildirilmelidir.
zh_hans: {0}“{1}”隐式声明的“{2}”与基 {3}“{4}”中的成员冲突，因此应将 {0} 声明为“Shadows”。
zh_hant: {0} '{1}' 隱含宣告 '{2}'，其與基底 {3} '{4}' 中的成員相衝突，因此 {0} 應宣告為 'Shadows'。

# WRN_SynthMemberShadowsMember5_Title
source: Property or event implicitly declares type or member that conflicts with a member in the base type
cs: Vlastnost nebo událost implicitně deklaruje typ nebo člen, který je v konfliktu se členem v základním typu.
de: Der Typ oder Member, der mit einem Member im Basistypen in Konflikt steht, wird von der Eigenschaft oder dem Ereignis implizit deklariert.
es: La propiedad o el evento se declaran implícitamente al tipo o al miembro que está en conflicto con un miembro del tipo base
fr: La propriété ou l’événement déclare implicitement un type ou un membre qui est en conflit avec un membre du type de base
it: La proprietà o l'evento dichiara in modo implicito il tipo o il membro che è in conflitto con un membro nel tipo di base
ja: プロパティまたはイベントが、基本型のメンバーと競合している型またはメンバーを暗黙的に宣言しています
ko: 속성 또는 이벤트가 기본 형식의 멤버와 충돌하는 형식 또는 멤버를 암시적으로 선언함
pl: Właściwość lub zdarzenie niejawnie deklaruje typ lub składową powodującą konflikt ze składową w typie podstawowym
pt_br: Propriedade ou evento declara implicitamente tipo ou membro que está em conflito com um membro no tipo base
ru: Свойство или событие неявно объявляет тип или член, который конфликтует с членом в базовом типе
tr: Özellik veya olay, temel türündeki bir üyeyle çakışan türü veya üyeyi örtük olarak bildiriyor
zh_hans: 属性或事件隐式声明与基类型中的成员发生冲突的类型或成员
zh_hant: 屬性或事件隱含宣告了與基底類型中的成員互相衝突的類型或成員

# WRN_MemberShadowsSynthMember6
source: {0} '{1}' conflicts with a member implicitly declared for {2} '{3}' in the base {4} '{5}' and should be declared 'Shadows'.
cs: {0} – {1} je v konfliktu se členem implicitně deklarovaným pro {2} – {3} v základní třídě {4} – {5}. Deklarace by měla obsahovat klíčové slovo Shadows.
de: {0} "{1}" verursacht einen Konflikt mit einem Member, der in Basis-{4} "{5}" implizit für {2} "{3}" deklariert wurde, und muss als "Shadows" deklariert werden.
es: {0} '{1}' entra en conflicto con un miembro implícitamente declarado para {2} '{3}' en la base {4} '{5}' y se debe declarar como 'Shadows'.
fr: {0} '{1}' est en conflit avec un membre implicitement déclaré pour {2} '{3}' dans le {4} '{5}' de base et doit être déclaré 'Shadows'.
it: {0} '{1}' è in conflitto con un membro dichiarato in modo implicito per {2} '{3}' nel {4} di base '{5}', quindi deve essere dichiarato come 'Shadows'.
ja: {0} '{1}' は、ベース {4} '{5}' にある {2} '{3}' に対して暗黙的に宣言されているメンバーと競合するため、'Shadows' と宣言しなければなりません。
ko: {0} '{1}'은(는) 기본 {4} '{5}'의 {2} '{3}'에 대해 암시적으로 선언된 멤버와 충돌하므로 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” powoduje konflikt ze składową niejawnie zadeklarowaną dla elementu {2} „{3}” w bazowym elemencie {4} „{5}” i dlatego powinien być zadeklarowany jako „Shadows”.
pt_br: {0} "{1}" está em conflito com um membro implicitamente declarado para {2} "{3}" na base {4} "{5}" e deve ser declarado como "Shadows".
ru: {0} "{1}" конфликтует с членом, который был неявно объявлен для {2} "{3}" в базе {4} "{5}" и должен быть объявлен "Shadows".
tr: {0} '{1}', {4} '{5}' temelinde {2} '{3}' için örtük olarak bildirilen bir üyeyle çakışıyor ve 'Shadows' olarak bildirilmesi gerekir.
zh_hans: {0}“{1}”与为基 {4}“{5}”中 {2}“{3}”隐式声明的成员冲突，应将它声明为“Shadows”。
zh_hant: {0} '{1}' 與基底 {4} '{5}' 中對 {2} '{3}' 隱含宣告的成員互相衝突，所以應宣告為 'Shadows'。

# WRN_MemberShadowsSynthMember6_Title
source: Member conflicts with a member implicitly declared for property or event in the base type
cs: Člen je v konfliktu se členem implicitně deklarovaným pro vlastnost nebo událost v základním typu.
de: Der Member steht mit einem Member in Konflikt, der implizit für eine Eigenschaft oder ein Ereignis in dem Basistyp deklariert wurde.
es: El miembro está en conflicto con un miembro declarado implícitamente para la propiedad o el evento del tipo base
fr: Le membre est en conflit avec un membre déclaré implicitement pour la propriété ou l’événement dans le type de base
it: Il membro è in conflitto con un membro dichiarato in modo implicito per la proprietà o l'evento nel tipo di base
ja: メンバーが、基本型のプロパティまたはイベントに対して暗黙的に宣言されているメンバーと競合しています
ko: 멤버가 기본 형식에서 속성 또는 이벤트에 대해 암시적으로 선언된 멤버와 충돌함
pl: Wystąpił konflikt składowej ze składową niejawnie zadeklarowaną dla właściwości lub zdarzenia w typie podstawowym
pt_br: O membro está em conflito com um membro implicitamente declarado para propriedade ou evento no tipo base
ru: Член конфликтует с членом, неявно объявленным для свойства или события в базовом типе
tr: Üye, temel türünde özellik veya olay için örtük olarak bildirilen bir üye ile çakışıyor
zh_hans: 成员与为基类型中的属性或事件隐式声明的成员冲突
zh_hant: 成員與針對基底類型中屬性或事件進行隱含宣告的成員互相衝突

# WRN_SynthMemberShadowsSynthMember7
source: {0} '{1}' implicitly declares '{2}', which conflicts with a member implicitly declared for {3} '{4}' in the base {5} '{6}'. {0} should be declared 'Shadows'.
cs: {0} – {1} implicitně deklaruje název {2}, který je v konfliktu se členem implicitně deklarovaným {3} – {4} v základní třídě {5} – {6}. {0} by se měl deklarovat jako Shadows.
de: {0} "{1}" deklariert implizit "{2}", was einen Konflikt mit einem implizit für {3} "{4}" in Basis-{5} "{6}" deklarierten Member verursacht. {0} sollte daher als "Shadows" deklariert werden.
es: {0} '{1}' declara implícitamente a '{2}', que entra en conflicto con un miembro declarado implícitamente para {3} '{4}' en la base {5} '{6}'. {0} se debe declarar como 'Shadows'.
fr: {0} '{1}' déclare implicitement '{2}', qui est en conflit avec un membre implicitement déclaré pour {3} '{4}' dans le {5} '{6}' de base. {0} doit être déclaré 'Shadows'.
it: {0} '{1}' dichiara in modo implicito '{2}', che è in conflitto con un membro dichiarato in modo implicito per {3} '{4}' nella {5} base '{6}', quindi '{0}' deve essere dichiarato come 'Shadows'.
ja: {0} '{1}' は、ベース {5} '{6}' で {3} '{4}' に対して暗黙的に宣言されたメンバーと競合する '{2}' を暗黙的に宣言します。{0} は 'Shadows' と宣言しなければなりません。
ko: {0} '{1}'은(는) 기본 {5} '{6}'의 {3} '{4}'에 대해 암시적으로 선언된 멤버와 충돌하는 '{2}'을(를) 암시적으로 선언하므로 {0}을(를) 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” deklaruje niejawnie element „{2}”, który powoduje konflikt ze składową niejawnie zadeklarowaną dla elementu {3} „{4}” w bazowym elemencie {5} „{6}”. Element {0} należy zadeklarować jako „Shadows”.
pt_br: {0} "{1}" declara implicitamente "{2}", o qual está em conflito com um membro implicitamente declarado para {3} "{4}" na base {5} "{6}". {0} deve ser declarado como "Shadows".
ru: {0} "{1}" неявно объявляет "{2}", что конфликтует с членом, который был неявно объявлен для {3} "{4}" в базе {5} "{6}". {0} должен быть объявлен "Shadows".
tr: {0} '{1}', {5} '{6}' temelinde {3} '{4}' için örtük olarak bildirilen bir öğeyle çakışan '{2}' öğesini örtük olarak bildiriyor. {0} 'Shadows' olarak bildirilmelidir.
zh_hans: {0}“{1}”隐式声明的“{2}”与为基 {5}“{6}”中的 {3}“{4}”隐式声明的成员冲突。{0} 应声明为“Shadows”。
zh_hant: {0} '{1}' 隱含宣告 '{2}'，其與基底 {5} '{6}' 中為 {3} '{4}' 所隱含宣告的成員相衝突。{0} 應宣告為 'Shadows'。

# WRN_SynthMemberShadowsSynthMember7_Title
source: Property or event implicitly declares member, which conflicts with a member implicitly declared for property or event in the base type
cs: Vlastnost nebo událost implicitně deklaruje člen, který je v konfliktu se členem implicitně deklarovaným pro vlastnost nebo událost v základním typu.
de: Der Member, der mit einem Member in Konflikt steht, der für die Eigenschaft oder das Ereignis im Basistyp implizit deklariert wurde, wird von der Eigenschaft oder dem Ereignis implizit deklariert.
es: La propiedad o el evento declaran implícitamente al miembro, lo que crea un conflicto con la declaración implícita de un miembro para la propiedad o el evento del tipo base
fr: La propriété ou l’événement déclare implicitement un membre, qui est en conflit avec un membre déclaré implicitement pour la propriété ou l’événement du type de base
it: La proprietà o l'evento dichiara in modo implicito il membro, che è in conflitto con un membro dichiarato in modo implicito per la proprietà o l'evento nel tipo di base
ja: プロパティまたはイベントが、基本型のプロパティまたはイベントに対して暗黙的に宣言されているメンバーと競合しているメンバーを暗黙的に宣言しています
ko: 속성 또는 이벤트가 기본 형식에서 속성 또는 이벤트에 대해 암시적으로 선언된 멤버와 충돌하는 멤버를 암시적으로 선언함
pl: Właściwość lub zdarzenie niejawnie deklaruje składową powodującą konflikt ze składową niejawnie zadeklarowaną dla właściwości lub zdarzenia w typie podstawowym
pt_br: A propriedade ou evento declara um membro implicitamente, que está em conflito com um membro implicitamente declarado para propriedade ou evento no tipo base
ru: Свойство или событие неявно объявляет член, который конфликтует с членом, неявно объявленным для свойства или события в базовом типе
tr: Özellik veya olay, temel türünde özellik veya olay için örtük olarak bildirilen bir üye ile çakışan üyeyi örtük olarak bildiriyor
zh_hans: 属性或事件隐式声明与为基类型中的属性或事件隐式声明的成员发生冲突的成员
zh_hant: 屬性或事件所隱含宣告的成員，與基底類型中為屬性或事件隱含宣告的成員互相衝突

# WRN_UseOfObsoletePropertyAccessor3
source: '{0}' accessor of '{1}' is obsolete: '{2}'.
cs: 'Přistupující objekt {0} pro {1} je zastaralý: {2}.
de: 'Der {0}-Accessor von "{1}" ist veraltet: "{2}".
es: 'El descriptor de acceso '{0}' de '{1}' está obsoleto: '{2}'.
fr: 'L'accesseur '{0}' de '{1}' est obsolète : '{2}'.
it: 'La funzione di accesso '{0}' di '{1}' è obsoleta: '{2}'.
ja: '{1}' の '{0}' アクセサーは廃止されています: '{2}'。
ko: '{1}'의 '{0}' 접근자는 사용되지 않습니다('{2}').
pl: 'Metoda dostępu „{0}” elementu „{1}” jest przestarzała: „{2}”.
pt_br: "{0}" acessador de "{1}" está obsoleto: "{2}".
ru: "{0}" средство доступа для "{1}" устарело: '{2}'.
tr: '{1}' öğesinin '{0}' erişimcisi artık kullanılmıyor: '{2}'.
zh_hans: '“{1}”的“{0}”访问器已过时:“{2}”。
zh_hant: '{1}' 的 '{0}' 存取子已經過時: '{2}'。

# WRN_UseOfObsoletePropertyAccessor3_Title
source: Property accessor is obsolete
cs: Přístupový objekt vlastnosti je zastaralý.
de: Der Eigenschaftenaccessor ist veraltet.
es: El descriptor de acceso de la propiedad está obsoleto
fr: Accesseur de propriété obsolète
it: La funzione di accesso della proprietà è obsoleta
ja: プロパティ アクセサーが旧型式です
ko: 속성 접근자가 사용되지 않음
pl: Metoda dostępu do właściwości jest przestarzała
pt_br: O acessador de propriedade está obsoleto
ru: Метод доступа свойства устарел
tr: Özellik erişimcisi artık kullanılmıyor
zh_hans: 属性访问器已过时
zh_hant: 屬性存取子已過時

# WRN_UseOfObsoletePropertyAccessor2
source: '{0}' accessor of '{1}' is obsolete.
cs: 'Přistupující objekt {0} pro {1} je zastaralý.
de: 'Der {0}-Accessor von "{1}" ist veraltet.
es: 'El descriptor de acceso '{0}' de '{1}' está obsoleto.
fr: 'L'accesseur '{0}' de '{1}' est obsolète.
it: 'La funzione di accesso '{0}' di '{1}' è obsoleta.
ja: '{1}' の '{0}' アクセサーは廃止されています。
ko: '{1}'의 '{0}' 접근자는 사용되지 않습니다.
pl: 'Metoda dostępu „{0}” elementu „{1}” jest przestarzała.
pt_br: "{0}" acessador de "{1}" está obsoleto.
ru: "{0}" средство доступа для "{1}" устарело.
tr: '{1}' öğesinin '{0}' erişimcisi artık kullanılmıyor.
zh_hans: '“{1}”的“{0}”访问器已过时。
zh_hant: '{1}' 的 '{0}' 存取子已經過時。

# WRN_UseOfObsoletePropertyAccessor2_Title
source: Property accessor is obsolete
cs: Přístupový objekt vlastnosti je zastaralý.
de: Der Eigenschaftenaccessor ist veraltet.
es: El descriptor de acceso de la propiedad está obsoleto
fr: Accesseur de propriété obsolète
it: La funzione di accesso della proprietà è obsoleta
ja: プロパティ アクセサーが旧型式です
ko: 속성 접근자가 사용되지 않음
pl: Metoda dostępu do właściwości jest przestarzała
pt_br: O acessador de propriedade está obsoleto
ru: Метод доступа свойства устарел
tr: Özellik erişimcisi artık kullanılmıyor
zh_hans: 属性访问器已过时
zh_hant: 屬性存取子已過時

# WRN_FieldNotCLSCompliant1
source: Type of member '{0}' is not CLS-compliant.
cs: Typ člena {0} není kompatibilní se specifikací CLS.
de: Der Typ des Members "{0}" ist nicht CLS-kompatibel.
es: El tipo del miembro '{0}' no es conforme a CLS.
fr: Le type de membre '{0}' n'est pas conforme CLS.
it: Il tipo di membro '{0}' non è conforme a CLS.
ja: メンバー '{0}' の型は CLS に準拠していません。
ko: '{0}' 멤버의 형식이 CLS 규격이 아닙니다.
pl: Typ składowej „{0}” nie jest zgodny ze specyfikacją CLS.
pt_br: Tipo de membro "{0}" não tem conformidade com CLS.
ru: Тип члена "{0}" не удовлетворяет требованиям CLS.
tr: '{0}' üyesinin türü CLS uyumlu değil.
zh_hans: 成员“{0}”的类型不符合 CLS。
zh_hant: 成員 '{0}' 的類型不符合 CLS 規範。

# WRN_FieldNotCLSCompliant1_Title
source: Type of member is not CLS-compliant
cs: Typ členu není kompatibilní se specifikací CLS.
de: Der Typ des Members ist nicht CLS-kompatibel.
es: El tipo de miembro no es conforme a CLS
fr: Le type du membre n’est pas conforme CLS
it: Il tipo di membro non è conforme a CLS
ja: メンバーの型が CLS に準拠していません
ko: 멤버 형식이 CLS 규격이 아님
pl: Typ składowej jest niezgodny ze specyfikacją CLS
pt_br: Tipo de membro não tem conformidade com CLS
ru: Тип члена несовместим с CLS
tr: Üye türü CLS uyumlu değil
zh_hans: 成员的类型不符合 CLS
zh_hant: 成員的類型不符合 CLS 規範

# WRN_BaseClassNotCLSCompliant2
source: '{0}' is not CLS-compliant because it derives from '{1}', which is not CLS-compliant.
cs: '{0} není kompatibilní se specifikací CLS, protože se odvozuje z {1}, které není kompatibilní se specifikací CLS.
de: '"{0}" wird von "{1}" (nicht CLS-kompatibel) abgeleitet und ist daher nicht CLS-kompatibel.
es: '{0}' no es conforme a CLS porque deriva de '{1}', que no es conforme a CLS.
fr: '{0}' n'est pas conforme CLS, car il dérive de '{1}', qui n'est pas conforme CLS.
it: '{0}' non è conforme a CLS perché deriva da '{1}', che non è conforme a CLS.
ja: '{0}' は、CLS に準拠していない '{1}' から派生しているため、CLS に準拠していません。
ko: '{0}'은(는) CLS 규격이 아닌 '{1}'에서 파생되므로 CLS 규격이 아닙니다.
pl: 'Element „{0}” jest niezgodny ze specyfikacją CLS, ponieważ dziedziczy po elemencie „{1}”, który jest niezgodny ze specyfikacją CLS.
pt_br: "{0}" não tem conformidade com CLS porque deriva de "{1}", o qual não tem conformidade com CLS.
ru: "{0}" несовместим с CLS, так как унаследован от "{1}", который несовместим с CLS.
tr: '{0}', CLS uyumlu olmayan '{1}' öğesinden türetildiği için CLS uyumlu değil.
zh_hans: '“{0}”不符合 CLS，因为它是从不符合 CLS 的“{1}”派生的。
zh_hant: '{0}' 不符合 CLS 規範，因為其衍生自不符合 CLS 規範的 '{1}'。

# WRN_BaseClassNotCLSCompliant2_Title
source: Type is not CLS-compliant because it derives from base type that is not CLS-compliant
cs: Typ není kompatibilní se specifikací CLS, protože se odvozuje od základního typu, který není kompatibilní se specifikací CLS.
de: Der Typ ist nicht CLS-kompatibel, da er von einem Basistyp abgeleitet wird, der nicht CLS-kompatibel ist.
es: El tipo no es conforme a CLS porque se deriva de un tipo de base que no es conforme a CLS
fr: Le type n’est pas conforme CLS, car il est dérivé d’un type de base qui n’est pas conforme CLS
it: Il tipo non è conforme a CLS perché deriva dal tipo di base che non è conforme a CLS
ja: 型が CLS に準拠していない基本型から派生しているので、CLS に準拠していません
ko: CLS 규격이 아닌 기본 형식에서 파생되므로 형식이 CLS 규격이 아님
pl: Typ jest niezgodny ze specyfikacją CLS, ponieważ pochodzi od typu podstawowego, który jest niezgodny ze specyfikacją CLS
pt_br: O tipo não tem conformidade com CLS porque deriva de um tipo base que não tem conformidade com CLS
ru: Тип несовместим с CLS, так как он наследуется от базового типа, который несовместим с CLS
tr: Tür, CLS uyumlu olmayan temel türünden türediğinden CLS uyumlu değil
zh_hans: 类型不符合 CLS，原因是它从不符合 CLS 的基类型派生
zh_hant: 類型不符合 CLS 規範，因為它是衍生自不符合 CLS 規範的基底類型
