Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CannotLiftRestrictedTypeQuery
source: Instance of restricted type '{0}' cannot be used in a query expression.
cs: Ve výrazu dotazu nejde použít instanci omezeného typu {0}.
de: Eine Instanz des eingeschränkten Typs "{0}" kann in einem Abfrageausdruck nicht verwendet werden.
es: La instancia del tipo restringido '{0}' no se puede usar en una expresión de consulta.
fr: Impossible d'utiliser l'instance du type restreint '{0}' dans une expression de requête.
it: Non è possibile usare l'istanza di tipo limitato '{0}' in un'espressione di query.
ja: 制限がある型 '{0}' のインスタンスをクエリ式で使用することはできません。
ko: 제한된 '{0}' 형식의 인스턴스는 쿼리 식에 사용할 수 없습니다.
pl: Nie można użyć wystąpienia typu ograniczonego „{0}” w wyrażeniu zapytania.
pt_br: Instância de tipo restrito "{0}" não pode ser usada em uma expressão de consulta.
ru: Экземпляр ограниченного типа "{0}" нельзя использовать в выражении запроса.
tr: Sorgu ifadelerinde kısıtlanmış '{0}' türünün örneği kullanılamaz.
zh_hans: 不能在查询表达式中使用受限类型“{0}”的实例。
zh_hant: 受限制的類型 '{0}' 之執行個體，不能用在查詢運算式中。

# ERR_QueryAnonymousTypeFieldNameInference
source: Range variable name can be inferred only from a simple or qualified name with no arguments.
cs: Název proměnné rozsahu jde odvodit jen z jednoduchého nebo kvalifikovaného názvu bez argumentů.
de: Der Name einer Bereichsvariablen kann nur von einem einfachen oder qualifizierten Namen ohne Argumente abgeleitet werden.
es: El nombre de una variable de rango solo se puede inferir a partir de un nombre simple o completo sin argumentos.
fr: Le nom de la variable de portée peut être déduit uniquement à partir d'un nom qualifié ou d'un nom simple sans arguments.
it: Il nome di variabile di intervallo può essere dedotto solo da un nome semplice o completo senza argomenti.
ja: 範囲変数の名前は、引数なしの簡易名または修飾名からのみ推論できます。
ko: 범위 변수 이름은 인수가 없는 단순한 이름 또는 정규화된 이름에서만 유추할 수 있습니다.
pl: Nazwę zmiennej zakresu można wywnioskować tylko na podstawie prostej lub kwalifikowanej nazwy bez argumentów.
pt_br: O nome da variável de intervalo pode ser deduzido apenas a partir de um nome simples ou qualificado sem argumentos.
ru: Имя переменной диапазона может выводиться только из простого или проверенного имени без аргументов.
tr: Aralık değişkeni adı ancak bağımsız değişken içermeyen bir basit veya tam addan çıkarsanabilir.
zh_hans: 只能从不带参数的简单名或限定名中推断范围变量名。
zh_hant: 只能從不含引數的簡單或限定名稱來推斷範圍變數名稱。

# ERR_QueryDuplicateAnonTypeMemberName1
source: Range variable '{0}' is already declared.
cs: Proměnná rozsahu {0} je už deklarovaná.
de: Die Bereichsvariable "{0}" wurde bereits deklariert.
es: La variable de rango '{0}' ya está declarada.
fr: La variable de portée '{0}' est déjà déclarée.
it: La variabile di intervallo '{0}' è già dichiarata.
ja: 範囲変数 '{0}' は既に宣言されています。
ko: '{0}' 범위 변수가 이미 선언되었습니다.
pl: Zmienna zakresu „{0}” jest już zadeklarowana.
pt_br: A variável de intervalo "{0}" já está declarada.
ru: Переменная диапазона "{0}" уже объявлена.
tr: '{0}' aralık değişkeni zaten bildirildi.
zh_hans: 已声明范围变量“{0}”。
zh_hant: 範圍變數 '{0}' 已宣告。

# ERR_QueryAnonymousTypeDisallowsTypeChar
source: Type characters cannot be used in range variable declarations.
cs: V deklaracích proměnných rozsahu nejde používat znaky typů.
de: Typzeichen können nicht in Bereichsvariablendeklarationen verwendet werden.
es: No se pueden usar caracteres de tipo en declaraciones de variable de rango.
fr: Les caractères de type ne peuvent pas être utilisés dans des déclarations de variable de portée.
it: Non è possibile usare i caratteri tipo nelle dichiarazioni della variabile di intervallo.
ja: 範囲変数の宣言で型文字を使用することはできません。
ko: 형식 문자는 범위 변수 선언에 사용할 수 없습니다.
pl: Nie można używać znaków typu w deklaracjach zmiennych zakresu.
pt_br: Caracteres de tipo não podem ser usados em declarações de variáveis de intervalo.
ru: Не удается использовать символы типа в объявлениях переменной диапазона.
tr: Aralık değişkeni bildirimlerinde tür karakterleri kullanılamaz.
zh_hans: 在范围变量声明中不能使用类型字符。
zh_hant: 範圍變數宣告中不能使用類型字元。

# ERR_ReadOnlyInClosure
source: 'ReadOnly' variable cannot be the target of an assignment in a lambda expression inside a constructor.
cs: 'Ve výrazu lambda obsaženém v konstruktoru nemůže být proměnná typu ReadOnly cílem přiřazení.
de: Die ReadOnly-Variable kann nicht das Ziel einer Zuweisung in einem Lambdaausdruck innerhalb eines Konstruktors sein.
es: 'La variable 'ReadOnly' no puede ser el destino de una asignación en una expresión lambda dentro de un constructor.
fr: 'Une variable 'ReadOnly' ne peut pas être la cible d'une assignation dans une expression lambda au sein d'un constructeur.
it: 'La variabile 'ReadOnly' non può essere la destinazione di un'assegnazione in un'espressione lambda all'interno di un costruttore.
ja: 'コンストラクター内のラムダ式では、'ReadOnly' 変数を代入式のターゲットにすることはできません。
ko: 'ReadOnly' 변수는 생성자 내부의 람다 식에서 할당 대상일 수 없습니다.
pl: 'Zmienna ReadOnly nie może być elementem docelowym przypisania w wyrażeniu lambda wewnątrz konstruktora.
pt_br: 'Uma variável 'ReadOnly' não pode ser o destino de uma atribuição em uma expressão lambda dentro de um construtor.
ru: 'Доступной только для чтения переменной (ReadOnly) нельзя присваивать значение в лямбда-выражении внутри конструктора.
tr: 'ReadOnly' değişkeni, oluşturucu içindeki bir lambda ifadesinde bir atamanın hedefi olamaz.
zh_hans: '在构造函数内的 lambda 表达式中，"ReadOnly" 变量不能作为赋值的目标。
zh_hant: 'ReadOnly' 變數不能做為建構函式內 Lambda 運算式中的指派目標。

# ERR_ExprTreeNoMultiDimArrayCreation
source: Multi-dimensional array cannot be converted to an expression tree.
cs: Vícedimenzionální pole nejde převést na strom výrazu.
de: Ein mehrdimensionales Array kann nicht in einen Ausdrucksbaum konvertiert werden.
es: Una matriz multidimensional no se puede convertir en un árbol de expresión.
fr: Impossible de convertir un tableau multidimensionnel en une arborescence de l'expression.
it: Non è possibile convertire una matrice multidimensionale in un albero delle espressioni.
ja: 多次元配列を式ツリーに変換することはできません。
ko: 다차원 배열은 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować tablicy wielowymiarowej na drzewo wyrażenia.
pt_br: Não é possível converter uma matriz multidimensional para uma árvore de expressão.
ru: Многомерный массив не может быть преобразован в дерево выражения.
tr: Çok boyutlu dizi bir ifade ağacına dönüştürülemez.
zh_hans: 多维数组无法转换为表达式树。
zh_hant: 多維陣列不可轉換成運算式樹狀結構。

# ERR_ExprTreeNoLateBind
source: Late binding operations cannot be converted to an expression tree.
cs: Operace pozdní vazby nejde převést na strom výrazu.
de: Vorgänge für spätes Binden können nicht in einen Ausdrucksbaum konvertiert werden.
es: Las operaciones de enlace en tiempo de ejecución no se pueden convertir en un árbol de expresión.
fr: Impossible de convertir les opérations à liaison tardive en une arborescence de l'expression.
it: Non è possibile convertire le operazioni di associazione tardiva in un albero delle espressioni.
ja: 遅延バインディング操作を式ツリーに変換することはできません。
ko: 런타임 바인딩 작업은 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować operacji późnego wiązania na drzewo wyrażenia.
pt_br: Não é possível converter operações de associação tardia para uma árvore de expressão.
ru: Операции позднего связывания не могут быть преобразованы в дерево выражения.
tr: Geç bağlama işlemleri bir ifade ağacına dönüştürülemez.
zh_hans: 后期绑定操作无法转换为表达式树。
zh_hant: 晚期繫結作業無法轉換成運算式樹狀結構。

# ERR_ExpectedBy
source: 'By' expected.
cs: 'Očekávalo se klíčové slovo By.
de: '"By" erwartet.
es: 'Se esperaba 'By'.
fr: 'By' attendu.
it: 'È previsto 'By'.
ja: 'By' が必要です。
ko: 'By'가 필요합니다.
pl: 'Oczekiwano elementu „By”.
pt_br: 'By' esperado.
ru: 'Требуется "By".
tr: 'By' bekleniyor.
zh_hans: '应为 "By"。
zh_hant: '必須是 'By'。

# ERR_QueryInvalidControlVariableName1
source: Range variable name cannot match the name of a member of the 'Object' class.
cs: Název proměnné rozsahu se nesmí shodovat s názvem členu třídy Object.
de: Der Name einer Bereichsvariablen darf nicht mit dem Namen eines Members der Object-Klasse übereinstimmen.
es: El nombre de una variable de rango no puede coincidir con el nombre de un miembro de la clase 'Object'.
fr: Le nom de la variable de portée ne peut pas correspondre au nom d'un membre de la classe 'Object'.
it: Il nome della variabile di intervallo non può corrispondere al nome di un membro della classe 'Object'.
ja: 範囲変数の名前を 'Object' クラスのメンバーの名前に一致させることはできません。
ko: 범위 변수 이름은 'Object' 클래스의 멤버 이름과 일치할 수 없습니다.
pl: Nazwa zmiennej zakresu nie może być zgodna z nazwą składowej klasy „Object”.
pt_br: O nome da variável de intervalo não pode corresponder ao nome de um membro da classe 'Object'.
ru: Имя переменной диапазона не может совпадать с именем члена класса "Object".
tr: Aralık değişkeni adı 'Object' sınıfının bir üyesinin adıyla eşleşemez.
zh_hans: 范围变量名无法与 "Object" 类的成员名匹配。
zh_hant: 範圍變數名稱無法符合 'Object' 類別成員的名稱。

# ERR_ExpectedIn
source: 'In' expected.
cs: 'Očekávalo se klíčové slovo In.
de: '"In" erwartet.
es: 'Se esperaba 'In'.
fr: 'In' attendu.
it: 'È previsto 'In'.
ja: 'In' が必要です。
ko: 'In'이 필요합니다.
pl: 'Oczekiwano elementu „In”.
pt_br: 'In' esperado.
ru: 'Требуется "In".
tr: 'In' bekleniyor.
zh_hans: '应为“In”。
zh_hant: '必須是 'In'。

# ERR_QueryNameNotDeclared
source: Name '{0}' is either not declared or not in the current scope.
cs: Název {0} není deklarovaný nebo není obsažený v aktuálním oboru.
de: Der Name "{0}" ist entweder nicht deklariert oder im aktuellen Bereich ungültig.
es: El nombre '{0}' no está declarado o no está en el ámbito actual.
fr: Le nom '{0}' n'est pas déclaré ou ne se trouve pas dans la portée actuelle.
it: Il nome '{0}' non è dichiarato o non è nell'ambito corrente.
ja: 名前 '{0}' は宣言されていないか、または現在のスコープ内に存在しません。
ko: '{0}' 이름이 선언되지 않았거나 현재 범위에 없습니다.
pl: Nazwa „{0}” nie jest zadeklarowana lub nie znajduje się w bieżącym zakresie.
pt_br: Nome "{0}" não é declarado ou não está no escopo atual.
ru: Имя "{0}" не объявлено или не существует в текущей области.
tr: '{0}' adı bildirilmedi veya geçerli bağlamda yer almıyor.
zh_hans: 名称“{0}”未声明或不在当前作用域中。
zh_hant: 名稱 '{0}' 未宣告或不在目前的範圍內。

# ERR_NestedFunctionArgumentNarrowing3
source: Return type of nested function matching parameter '{0}' narrows from '{1}' to '{2}'.
cs: Typ vrácené hodnoty odpovídajícího parametru {0} vložené funkce se zužuje z {1} na {2}.
de: Der mit dem Parameter "{0}" übereinstimmende Rückgabetyp der geschachtelten Funktion wird von "{1}" auf "{2}" eingeschränkt.
es: El tipo de valor devuelto de la función anidada coincidente con el parámetro '{0}' se reduce de '{1}' a '{2}'.
fr: Le type de retour de la fonction imbriquée qui correspond au paramètre '{0}' passe de '{1}' à '{2}'.
it: Il tipo restituito del parametro corrispondente '{0}' della funzione annidata viene convertito da '{1}' a '{2}'.
ja: パラメーター '{0}' と一致する入れ子にされた関数の戻り値の型は、'{1}' から '{2}' へ縮小変換します。
ko: '{0}' 매개 변수와 일치하는 중첩된 함수의 반환 형식이 '{1}'에서 '{2}'(으)로 축소 변환됩니다.
pl: Typ zwracany funkcji zagnieżdżonej pasującej do parametru „{0}” zawęża się od „{1}” do „{2}”.
pt_br: Tipo de retorno do parâmetro correspondente à função aninhada "{0}" restringe de "{1}" para "{2}".
ru: Возвращаемый тип вложенной функции соответствующего параметра "{0}" сужается с "{1}" к "{2}".
tr: '{0}' parametresiyle eşleşen iç içe işlevin dönüş türü '{1}' iken '{2}' olarak daralıyor.
zh_hans: 与参数“{0}”匹配的嵌套函数的返回类型从“{1}”收缩到“{2}”。
zh_hant: 與參數 '{0}' 相對應的巢狀函式之傳回類型，從 '{1}' 縮減到 '{2}'。

# ERR_AnonTypeFieldXMLNameInference
source: Anonymous type member name cannot be inferred from an XML identifier that is not a valid Visual Basic identifier.
cs: Název členu anonymního typu nejde odvodit z identifikátoru XML, který není platným identifikátorem jazyka Visual Basic.
de: Der Membername eines anonymen Typs kann nicht von einem XML-Bezeichner abgeleitet werden, der kein gültiger Visual Basic-Bezeichner ist.
es: El nombre de un miembro de tipo anónimo no se puede inferir de un identificador XML que no sea un identificador de Visual Basic válido.
fr: Le nom du membre de type anonyme ne peut pas être déduit à partir d'un identificateur XML qui n'est pas un identificateur Visual Basic valide.
it: Non è possibile dedurre il nome di membro di tipo anonimo da un identificatore XML che non sia un identificatore valido Visual Basic.
ja: 匿名型のメンバー名を、有効な Visual Basic 識別子ではない XML 識別子から推論することはできません。
ko: 익명 형식 멤버 이름은 올바른 Visual Basic 식별자가 아닌 XML 식별자에서 유추할 수 없습니다.
pl: Nie można wywnioskować nazwy składowej typu anonimowego na podstawie identyfikatora XML, który nie jest prawidłowym identyfikatorem języka Visual Basic.
pt_br: O nome do membro de tipo anônimo não pode ser deduzido a partir de um identificador de XML que não seja um identificador válido do Visual Basic.
ru: Имя члена анонимного типа не может быть определено из идентификатора XML, который не является допустимым идентификатором языка Visual Basic.
tr: Anonim türdeki üye adı, geçerli bir Visual Basic tanımlayıcısı olmayan bir XML tanımlayıcısından çıkarsanamaz.
zh_hans: 无法根据不是有效 Visual Basic 标识符的 XML 标识符推断出匿名类型成员名称。
zh_hant: 無法從非有效 Visual Basic 識別項的 XML 識別項來推斷匿名類型成員名稱。

# ERR_QueryAnonTypeFieldXMLNameInference
source: Range variable name cannot be inferred from an XML identifier that is not a valid Visual Basic identifier.
cs: Název proměnné rozsahu nejde odvodit z identifikátoru XML, který není platným identifikátorem jazyka Visual Basic.
de: Der Name einer Bereichsvariablen kann nicht von einem XML-Bezeichner abgeleitet werden, der kein gültiger Visual Basic-Bezeichner ist.
es: El nombre de una variable de rango no se puede inferir de un identificador XML que no sea un identificador de Visual Basic válido.
fr: Le nom de la variable de portée ne peut pas être déduit à partir d'un identificateur XML qui n'est pas un identificateur Visual Basic valide.
it: Non è possibile dedurre il nome di variabile di intervallo da un identificatore XML che non sia un identificatore valido Visual Basic.
ja: 範囲変数の名前を、有効な Visual Basic 識別子ではない XML 識別子から推論することはできません。
ko: 범위 변수 이름은 올바른 Visual Basic 식별자가 아닌 XML 식별자에서 유추할 수 없습니다.
pl: Nie można wywnioskować nazwy zmiennej zakresu na podstawie identyfikatora XML, który nie jest prawidłowym identyfikatorem języka Visual Basic.
pt_br: Não é possível deduzir o nome de uma variável de intervalo a partir de um identificador XML que não é um identificador Visual Basic válido.
ru: Имя переменной диапазона не может быть определено из идентификатора XML, который не является допустимым идентификатором Visual Basic.
tr: Aralık değişkeni adı, geçerli bir Visual Basic tanımlayıcısı olmayan bir XML tanımlayıcısından çıkarılamaz.
zh_hans: 无法根据不是有效 Visual Basic 标识符的 XML 标识符推断出范围变量名。
zh_hant: 無法從非有效 Visual Basic 識別項的 XML 識別項來推斷範圍變數名稱。

# ERR_ExpectedInto
source: 'Into' expected.
cs: 'Očekávalo se klíčové slovo Into.
de: '"Into" erwartet.
es: 'Se esperaba 'Into'.
fr: 'Into' attendu.
it: 'È previsto 'Into'.
ja: 'Into' が必要です。
ko: 'Into'가 필요합니다.
pl: 'Oczekiwano operatora „Into”.
pt_br: 'Into' esperado.
ru: 'Требуется "Into".
tr: 'Into' bekleniyor.
zh_hans: '应为“Into”。
zh_hant: '必須是 'Into'。

# ERR_TypeCharOnAggregation
source: Aggregate function name cannot be used with a type character.
cs: Název agregační funkce nejde použít se znakem typu.
de: Der Name der Aggregatfunktion darf nicht mit einem Typzeichen verwendet werden.
es: El nombre de una función de agregado no se puede usar con un carácter de tipo.
fr: Le nom d'une fonction d'agrégation ne peut pas être utilisé avec un caractère de type.
it: Non è possibile usare il nome della funzione aggregata con un carattere tipo.
ja: 集計関数名で型文字を使用することはできません。
ko: 집계 함수 이름에는 형식 문자를 사용할 수 없습니다.
pl: Nazwy funkcji agregowania nie można używać ze znakiem typu.
pt_br: O nome da função agregada não pode ser usado com um caractere de tipo.
ru: Имя агрегатной функции не может использоваться вместе с символом типа.
tr: Kümesel işlev bir tür karakteriyle kullanılamaz.
zh_hans: 聚合函数名不能与类型字符一起使用。
zh_hant: 彙總函式名稱不能與類型字元一起使用。

# ERR_ExpectedOn
source: 'On' expected.
cs: 'Očekávalo se klíčové slovo On.
de: '"On" erwartet.
es: 'Se esperaba 'On'.
fr: 'On' attendu.
it: 'È previsto 'On'.
ja: 'On' が必要です。
ko: 'On'이 필요합니다.
pl: 'Oczekiwano operatora „On”.
pt_br: 'On' esperado.
ru: 'Требуется "On".
tr: 'On' bekleniyor.
zh_hans: '应为 "On"。
zh_hant: '必須是 'On'。

# ERR_ExpectedEquals
source: 'Equals' expected.
cs: 'Očekávalo se klíčové slovo Equals.
de: '"Equals" erwartet.
es: 'Se esperaba 'Equals'.
fr: 'Equals' attendu.
it: 'È previsto 'Equals'.
ja: 'Equals' が必要です。
ko: 'Equals'가 필요합니다.
pl: 'Oczekiwano operatora „Equals”.
pt_br: 'Equals' esperado.
ru: 'Требуется "Equals".
tr: 'Equals' bekleniyor.
zh_hans: '应为“Equals”。
zh_hant: '必須是 'Equals'。

# ERR_ExpectedAnd
source: 'And' expected.
cs: 'Očekávalo se klíčové slovo And.
de: '"And" erwartet.
es: 'Se esperaba 'And'.
fr: 'And' attendu.
it: 'È previsto 'And'.
ja: 'And' が必要です。
ko: 'And'가 필요합니다.
pl: 'Oczekiwano operatora „And”.
pt_br: 'And' esperado.
ru: 'Требуется "And".
tr: 'And' bekleniyor.
zh_hans: '应为 "And"。
zh_hant: '必須是 'And'。

# ERR_EqualsTypeMismatch
source: 'Equals' cannot compare a value of type '{0}' with a value of type '{1}'.
cs: 'Operátor Equals nemůže porovnávat hodnotu typu {0} s hodnotou typu {1}.
de: '"Equals" kann nicht Werte vom Typ "{0}" mit Werten vom Typ "{1}" vergleichen.
es: 'Equals' no puede comparar un valor de tipo '{0}' con un valor de tipo '{1}'.
fr: 'Equals' ne peut pas comparer une valeur de type '{0}' à une valeur de type '{1}'.
it: 'Equals' non può confrontare un valore di tipo '{0}' con un valore di tipo '{1}'.
ja: 'Equals' で型 '{0}' の値と型 '{1}' の値を比較することはできません。
ko: 'Equals'에서 '{0}' 형식의 값을 '{1}' 형식의 값과 비교할 수 없습니다.
pl: 'Operator „Equals” nie umożliwia porównania wartości typu „{0}” z wartością typu „{1}”.
pt_br: "Equals" não pode comparar um valor do tipo "{0}" com um valor do tipo "{1}".
ru: '"Equals" не может сравнить значение типа "{0}" со значением типа "{1}".
tr: 'Equals', '{0}' türünde bir değerler '{1}' türünde bir değeri karşılaştıramaz.
zh_hans: '“Equals”不能对类型为“{0}”的值与类型“{1}”的值进行比较。
zh_hant: 'Equals' 無法比較類型 '{0}' 的值與類型 '{1}' 的值。

# ERR_EqualsOperandIsBad
source: You must reference at least one range variable on both sides of the 'Equals' operator. Range variable(s) {0} must appear on one side of the 'Equals' operator, and range variable(s) {1} must appear on the other.
cs: Na obou stranách operátoru Equals musíte zadat odkaz aspoň na jednu proměnnou rozsahu. Na jedné straně operátoru Equals se musí objevit nejmíň jedna proměnná rozsahu {0} a na druhé straně nejmíň jedna proměnná rozsahu {1}.
de: Verweisen Sie auf beiden Seiten des Equals-Operators auf mindestens eine Bereichsvariable. Die Bereichsvariablen "{0}" müssen auf einer Seite des Equals-Operators und die Bereichsvariablen "{1}" müssen auf der anderen Seite verwendet werden.
es: Debe hacer referencia al menos a una variable de rango en ambos lados del operador 'Equals'. La(s) variable(s) de rango {0} debe(n) aparecer en un lado del operador 'Equals' y la(s) variable(s) de rango {1} debe(n) aparecer en el otro.
fr: Vous devez référencer au moins une variable de portée des deux côtés de l'opérateur 'Equals'. La ou les variables de portée {0} doivent apparaître d'un côté de l'opérateur 'Equals' alors que la ou les variables de portée {1} doivent apparaître de l'autre côté.
it: È necessario fare riferimento ad almeno una variabile di intervallo su entrambi i lati dell'operatore 'Equals'. La variabile di intervallo {0} deve essere specificata su un lato dell'operatore 'Equals', mentre quella {1} deve essere specificata sull'altro.
ja: Equals' 演算子の両辺で、少なくとも 1 つの範囲変数を参照しなければなりません。'Equals' 演算子の一方で 1 つ以上の範囲変数 {0} を参照し、他方で 1 つ以上の範囲変数 {1} を参照する必要があります。
ko: Equals' 연산자의 양쪽에서 범위 변수를 하나 이상 참조해야 합니다. {0} 범위 변수는 'Equals' 연산자의 한쪽에 표시되어야 하며 {1} 범위 변수는 다른 쪽에 표시되어야 합니다.
pl: Po obu stronach operatora „Equals” musi znajdować się odwołanie do co najmniej jednej zmiennej zakresu. Zmienne zakresu {0} muszą znajdować się po jednej, a zmienne zakresu {1} po drugiej stronie operatora „Equals”.
pt_br: Você deve referenciar pelo menos uma variável de intervalo em ambos os lados do operador "Equals". Variável(is) de intervalo {0} deve(m) aparecer em um lado do operador "Equals" e a(s) variável(is) de intervalo {1} deve(m) aparecer no outro.
ru: С обеих сторон оператора "Equals" должны присутствовать ссылки хотя бы на одну переменную диапазона. Переменные диапазона {0} должны располагаться с одной стороны оператора "Equals", а переменные диапазона {1} — с другой.
tr: Equals' işlecinin her iki tarafında da en az bir aralık değişkenine başvuruda bulunmalısınız. {0} aralık değişkenleri 'Equals' işlecinin bir tarafında, {1} aralık değişkenleri de diğer tarafında yer almalıdır.
zh_hans: “Equals”运算符的每一侧都必须至少引用一个范围变量。范围变量 {0} 必须出现在“Equals”运算符的一侧，范围变量 {1} 必须出现在另一侧。
zh_hant: 在 'Equals' 運算子的兩端，至少都必須都要參考一個範圍變數。範圍變數 {0} 必須出現在 'Equals' 運算子的一端，而範圍變數 {1} 則必須出現在另一端。

# ERR_LambdaNotDelegate1
source: Lambda expression cannot be converted to '{0}' because '{0}' is not a delegate type.
cs: Výraz lambda nejde převést na {0}, protože {0} není typ delegáta.
de: Der Lambdaausdruck kann nicht in "{0}" konvertiert werden, da "{0}" kein Delegattyp ist.
es: La expresión lambda no se puede convertir en '{0}' porque '{0}' no es un tipo delegado.
fr: Impossible de convertir l'expression lambda en '{0}', car '{0}' n'est pas un type délégué.
it: Non è possibile convertire l'espressione lambda in '{0}' perché '{0}' non è un tipo delegato.
ja: '{0}' は、デリゲート型でないため、ラムダ式を '{0}' に変換できません。
ko: '{0}'이(가) 대리자 형식이 아니므로 람다 식을 '{0}'(으)로 변환할 수 없습니다.
pl: Wyrażenia lambda nie można przekonwertować na typ „{0}”, ponieważ typ „{0}” nie jest typem delegowanym.
pt_br: Expressão lambda não pode ser convertida para "{0}" porque "{0}" não é um tipo delegado.
ru: Лямбда-выражение не может быть преобразовано в "{0}", поскольку "{0}" не является типом делегата.
tr: '{0}' bir temsilci türü olmadığından lambda ifadesi '{0}' türüne dönüştürülemiyor.
zh_hans: Lambda 表达式无法转换为“{0}”，因为“{0}”不是委托类型。
zh_hant: Lambda 運算式無法轉換成 '{0}'，因為 '{0}' 不是委派類型。

# ERR_LambdaNotCreatableDelegate1
source: Lambda expression cannot be converted to '{0}' because type '{0}' is declared 'MustInherit' and cannot be created.
cs: Výraz lambda nejde převést na {0}, protože typ {0} se deklaruje s použitím klíčového slova MustInherit a nejde ho vytvořit.
de: Der Lambdaausdruck kann nicht in "{0}" konvertiert werden, da der Typ "{0}" als "MustInherit" deklariert wurde und nicht erstellt werden kann.
es: La expresión lambda no se puede convertir en '{0}' porque el tipo '{0}' está declarado como 'MustInherit' y no se puede crear.
fr: Impossible de convertir l'expression lambda en '{0}', car le type '{0}' est déclaré 'MustInherit' et ne peut pas être créé.
it: Non è possibile convertire l'espressione lambda in '{0}' perché il tipo '{0}' è dichiarato come 'MustInherit' e non può essere creato.
ja: '{0}' は 'MustInherit' として宣言されていて作成することができないので、ラムダ式を '{0}' に変換することはできません。
ko: '{0}' 형식이 'MustInherit'으로 선언되어 있어 만들 수 없으므로 람다 식을 '{0}'(으)로 변환할 수 없습니다.
pl: Wyrażenia lambda nie można przekonwertować na typ „{0}”, ponieważ typ „{0}” jest zadeklarowany jako „MustInherit” i nie można go utworzyć.
pt_br: Expressão lambda não pode ser convertida para "{0}" porque o tipo "{0}" é declarado "MustInherit" e não pode ser criado.
ru: Лямбда-выражение не может быть преобразовано в "{0}", поскольку тип "{0}" объявлен как "MustInherit" и не может быть создан.
tr: '{0}' türü 'MustInherit' olarak bildirildiğinden ve oluşturulamadığından, lambda ifadesi '{0}' türüne dönüştürülemiyor.
zh_hans: Lambda 表达式无法转换为“{0}”，因为类型“{0}”被声明为“MustInherit”，无法创建。
zh_hant: Lambda 運算式無法轉換成 '{0}'，因為類型 '{0}' 宣告為 'MustInherit' 但卻無法建立。
