Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ReImplementingWinRTInterface5
source: '{0}.{1}' from 'implements {2}' is already implemented by the base class '{3}'. Re-implementation of Windows Runtime Interface '{4}' is not allowed
cs: '{0}.{1} z klauzule implements {2} je už implementované základní třídou {3}. Opětovná implementace rozhraní Windows Runtime {4} není povolená.
de: '"{0}.{1}" von "implements {2}" wird bereits durch die Basisklasse "{3}" implementiert. Die erneute Implementierung der Windows-Runtime-Schnittstelle "{4}" ist unzulässig.
es: '{0}.{1}' de 'implements {2}' ya está implementado por la clase base '{3}'. No se permite volver a implementar la interfaz '{4}' de Windows Runtime.
fr: '{0}.{1}' issu de 'implements {2}' est déjà implémenté par la classe de base '{3}'. Vous n'êtes pas autorisé à réimplémenter l'interface Windows Runtime '{4}'
it: '{0}.{1}' da 'implements {2}' è già implementata dalla classe di base '{3}'. Non è consentita una nuova implementazione dell'interfaccia '{4}' di Windows Runtime
ja: 'implements {2}' からの '{1}.{0}' は、基底クラス '{3}' によって既に実装されているため、Windows ランタイム インターフェイス '{4}' をさらに実装することはできません
ko: 'implements {0}'에서 구현된 '{1}.{2}'은(는) 기본 클래스 '{3}'에 의해 이미 구현되었습니다. Windows Runtime 인터페이스 '{4}'을(를) 다시 구현할 수 없습니다.
pl: 'Element „{0}.{1}” z elementu „implements {2}” został już zaimplementowany przez klasę bazową „{3}”. Ponowna implementacja interfejsu środowiska wykonawczego systemu Windows „{4}” jest niedozwolona
pt_br: '{0}.{1}' de 'implementa {2}' já foi implementado pela classe base '{3}'. A reimplementação da Interface do Windows Runtime '{4}' não é permitida
ru: "{0}.{1}" из "implements {2}" уже реализован базовым классом "{3}". Повторная реализация интерфейса среды выполнения Windows "{4}" не разрешена.
tr: 'implements {0}' değerindeki '{1}.{2}', '{3}' taban sınıfı tarafından zaten uygulandı. '{4}' Windows Çalışma Zamanı Arabiriminin yeniden uygulanmasına izin verilmiyor
zh_hans: '“实现 {2}”中的“{0}.{1}”已由基类“{3}”实现。不允许重新实现 Windows Runtime 接口“{4}”
zh_hant: '基底類別 '{3}' 已實作 'implements {2}' 中的 '{0}.{1}'。不允許重新實作 Windows 執行階段介面 '{4}'

# ERR_ReImplementingWinRTInterface4
source: '{0}.{1}' is already implemented by the base class '{2}'. Re-implementation of Windows Runtime Interface '{3}' is not allowed
cs: '{0}.{1} je už implementované základní třídou {2}. Opětovná implementace rozhraní modulu Windows Runtime {3} není povolená.
de: '"{0}.{1}" wird bereits durch die Basisklasse "{2}" implementiert. Die erneute Implementierung der Windows-Runtime-Schnittstelle "{3}" ist unzulässig.
es: '{0}.{1}' ya está implementado por la clase base '{2}'. No se permite volver a implementar la interfaz '{3}' de Windows Runtime.
fr: '{0}.{1}' est déjà implémenté par la classe de base '{2}'. Vous n'êtes pas autorisé à réimplémenter l'interface Windows Runtime '{3}'
it: '{0}.{1}' è già implementata dalla classe di base '{2}'. Non è consentita una nuova implementazione dell'interfaccia '{3}' di Windows Runtime
ja: '{0}.{1}' は、基底クラス '{2}' によって既に実装されているため、Windows ランタイム インターフェイス '{3}' をさらに実装することはできません
ko: '{0}.{1}'은(는) 기본 클래스 '{2}'에 의해 이미 구현되었습니다. Windows Runtime 인터페이스 '{3}'을(를) 다시 구현할 수 없습니다.
pl: 'Element „{0}.{1}” został już zaimplementowany przez klasę bazową „{2}”. Ponowna implementacja interfejsu środowiska wykonawczego systemu Windows „{3}” jest niedozwolona
pt_br: '{0}.{1}' já foi implementado pela classe base '{2}'. A reimplementação da Interface do Windows Runtime '{3}' não é permitida
ru: "{0}.{1}" уже реализован базовым классом "{2}". Повторная реализация интерфейса среды выполнения Windows "{3}" не разрешена.
tr: '{0}.{1}', '{2}' taban sınıfı tarafından zaten uygulandı. '{3}' Windows Çalışma Zamanı Arabiriminin yeniden uygulanmasına izin verilmiyor
zh_hans: '“{0}.{1}”已由基类“{2}”实现。不允许重新实现 Windows Runtime 接口“{3}”
zh_hant: '基底類別 '{2}' 已實作 '{0}.{1}'。不允許重新實作 Windows 執行階段介面 '{3}'

# ERR_BadIteratorByRefParam
source: Iterator methods cannot have ByRef parameters.
cs: Metody iterátorů nemůžou mít parametry ByRef.
de: Iterator-Methoden dürfen nicht über ByRef-Parameter verfügen.
es: Los métodos Iterator no pueden tener parámetros ByRef.
fr: Les méthodes Iterator n'acceptent pas les paramètres ByRef.
it: I metodi Iterator non possono avere parametri ByRef.
ja: Iterator メソッドに ByRef パラメーターを指定することはできません。
ko: 반복기 메서드에는 ByRef 매개 변수를 사용할 수 없습니다.
pl: Metody iteracyjne nie mogą mieć parametrów ByRef.
pt_br: Os métodos iteradores não podem ter parâmetros ByRef.
ru: Методы с модификатором Iterator не могут иметь параметры ByRef.
tr: Yineleyici yöntemlerde ByRef parametreleri bulunamaz.
zh_hans: 迭代器方法不能包含 ByRef 参数。
zh_hant: Iterator 方法不可有 ByRef 參數。

# ERR_BadIteratorExpressionLambda
source: Single-line lambdas cannot have the 'Iterator' modifier. Use a multiline lambda instead.
cs: Jednořádkové výrazy lambda nemůžou mít modifikátor Iterator. Použijte místo toho víceřádkový výraz lambda.
de: Einzeilige Lambdafunktionen können nicht über einen Iterator-Modifizierer verfügen. Verwenden Sie stattdessen eine mehrzeilige Lambdafunktion.
es: Las expresiones lambda de una sola línea no pueden tener el modificador 'Iterator'. Use una expresión lambda de varias líneas.
fr: Les expressions lambda sur une seule ligne ne peuvent pas avoir de modificateur 'Iterator'. Utilisez une expression lambda multiligne à la place.
it: Le espressioni lambda su una sola riga non possono avere il modificatore 'Iterator'. Usare un'espressione lambda su più righe.
ja: 単一行のラムダに 'Iterator' 修飾子を指定することはできません。複数行のラムダを使用してください。
ko: 한 줄 람다에는 'Iterator' 한정자를 사용할 수 없습니다. 대신 여러 줄 람다를 사용하세요.
pl: Jednowierszowe wyrażenia lambda nie mogą mieć modyfikatora „Iterator”. W takim przypadku należy używać wielowierszowych wyrażeń lambda.
pt_br: Lambdas de uma única linha não podem ter o modificador 'Iterator'. Em vez disso, use lambda multilinha.
ru: Лямбда-выражения, состоящие из одной строки, не могут содержать модификатор Iterator. Используйте лямбда-выражение, состоящее из нескольких строк.
tr: Tek satırlı lambdalarda 'Iterator' değiştiricisi bulunamaz. Bunun yerine çok satırlı bir lambda kullanın.
zh_hans: 单行 lambda 不能包含“Iterator”修饰符。请改用多行 lambda。
zh_hant: 單行 Lambda 不能有 'Iterator' 修飾元。請改用多行 Lambda。

# ERR_BadIteratorReturn
source: Iterator functions must return either IEnumerable(Of T), or IEnumerator(Of T), or the non-generic forms IEnumerable or IEnumerator.
cs: Funkce iterátorů musejí vracet buď objekt IEnumerable(Of T), nebo IEnumerator(Of T), nebo konkrétní formy rozhraní IEnumerable nebo IEnumerator.
de: Iterator-Funktionen müssen entweder IEnumerable(Of T), IEnumerator(Of T) oder deren nicht generische Formen IEnumerable oder IEnumerator zurückgeben.
es: Las funciones de iterador deben devolver IEnumerable(Of T) o IEnumerator(Of T), o bien las formas no genéricas IEnumerable o IEnumerator.
fr: Les fonctions Iterator doivent retourner IEnumerable(Of T) ou IEnumerator(Of T), ou bien les formulaires non génériques IEnumerable ou IEnumerator.
it: Gli iteratori di funzione devono restituire IEnumerable(Of T), IEnumerator(Of T) o le forme non generiche di IEnumerable o IEnumerator.
ja: Iterator 関数では、IEnumerable(Of T) または IEnumerator(Of T)、あるいは非ジェネリック形式の IEnumerable または IEnumerator を返す必要があります。
ko: 반복기 함수는 IEnumerable(Of T), IEnumerator(Of T) 또는 제네릭이 아닌 폼 IEnumerable 또는 IEnumerator를 반환해야 합니다.
pl: Funkcje iteracyjne muszą zwracać interfejsy IEnumerable(Of T) lub IEnumerator(Of T) albo nieogólne formy interfejsu IEnumerable lub IEnumerator.
pt_br: As funções de Iterator devem retornar IEnumerable(Of T) ou IEnumerator(Of T), ou as formas não genéricas IEnumerable ou IEnumerator.
ru: Функции с модификатором Iterator должны возвращать интерфейс IEnumerable(Of T) или IEnumerator(Of T) либо неуниверсальные формы перечисления IEnumerable или IEnumerator.
tr: Yineleyici işlevler IEnumerable(Of T) veya IEnumerator(Of T) ya da genel olmayan IEnumerable veya IEnumerator biçimlerini döndürmelidir.
zh_hans: 迭代器函数必须返回 IEnumerable(Of T) 或 IEnumerator(Of T)，或返回非泛型格式的 IEnumerable 或 IEnumerator。
zh_hant: Iterator 函式必須傳回 IEnumerable(Of T) 或 IEnumerator(Of T)，或是非泛型表單 IEnumerable 或 IEnumerator。

# ERR_BadReturnValueInIterator
source: To return a value from an Iterator function, use 'Yield' rather than 'Return'.
cs: Pokud chcete vrátit hodnotu z funkce iterátoru, místo příkazu Return použijte příkaz Yield.
de: Verwenden Sie zum Zurückgeben eines Werts von der Iterator-Funktion "Yield" anstelle von "Return".
es: Para devolver un valor desde una función Iterator, use 'Yield' en lugar de 'Return'.
fr: Pour retourner une valeur depuis une fonction Iterator, utilisez 'Yield' plutôt que 'Return'.
it: Per restituire un valore da un iteratore di funzione, usare 'Yield' invece di 'Return'.
ja: 値を Iterator 関数から返すには、'Return' ではなく 'Yield' を使用します。
ko: 반복기 함수의 값을 반환하려면 'Return' 대신 'Yield'를 사용하세요.
pl: Aby była zwracana wartość z funkcji iteracyjnej, zamiast instrukcji „Return” należy użyć instrukcji „Yield”.
pt_br: Para retornar um valor de uma função Iterator, use 'Yield' em vez de 'Return'.
ru: Для возвращения значения из функции с модификатором Iterator используйте оператор Yield, а не оператор Return.
tr: Bir Iterator işlevinden değer döndürmek için, 'Return' yerine 'Yield' kullanın.
zh_hans: 若要从迭代器函数返回值，请使用“Yield”而不是“Return”。
zh_hant: 若要從 Iterator 函式傳回值，請使用 'Yield' 而不要使用 'Return'。

# ERR_BadYieldInNonIteratorMethod
source: 'Yield' can only be used in a method marked with the 'Iterator' modifier.
cs: 'Příkaz Yield je možné použít jenom v metodě označené modifikátorem Iterator.
de: '"Yield" kann nur in einer mit dem Iterator-Modifizierer markierten Methode verwendet werden.
es: 'Yield' solamente se puede usar en un método marcado con el modificador 'Iterator'.
fr: 'Yield' peut uniquement être utilisé dans une méthode marquée à l'aide du modificateur 'Iterator'.
it: 'Yield' può essere usato solo in un metodo contrassegnato con il modificatore 'Iterator'.
ja: 'Yield' は、'Iterator' 修飾子が設定されているメソッドにのみ使用できます。
ko: 'Yield'는 'Iterator' 한정자로 표시된 메서드에서만 사용할 수 있습니다.
pl: 'Instrukcji „Yield” można używać tylko w metodach oznaczonych modyfikatorem „Iterator”.
pt_br: 'Yield' só pode ser usado em um método marcado com o modificador 'Iterator'.
ru: 'Yield можно использовать только в методах, помеченных модификатором Iterator.
tr: 'Yield' yalnızca 'Iterator' değiştiricisiyle işaretlenmiş bir yöntemin içinde kullanılabilir.
zh_hans: '只能在用“Iterator”修饰符标记的方法中使用“Yield”。
zh_hant: 'Yield' 只能用在標記為 'Iterator' 修飾元的方法中。

# ERR_BadYieldInTryHandler
source: 'Yield' cannot be used inside a 'Catch' statement or a 'Finally' statement.
cs: 'Příkaz Yield nejde použít uvnitř příkazu Catch nebo Finally.
de: '"Yield" kann nicht innerhalb einer Catch- oder Finally-Anweisung verwendet werden.
es: 'Yield' no se puede usar dentro de una instrucción 'Catch' o 'Finally'.
fr: 'Yield' ne peut pas être utilisé dans une instruction 'Catch' ou 'Finally'.
it: 'Yield' non può essere usato all'interno di un'istruzione 'Catch' o 'Finally'.
ja: 'Yield' は、'Catch' ステートメントまたは 'Finally' ステートメントの内部では使用できません。
ko: 'Yield'는 'Catch' 문이나 'Finally' 문 내에서 사용할 수 없습니다.
pl: 'Instrukcja „Yield” nie może być używana wewnątrz instrukcji „Catch” ani „Finally”.
pt_br: 'Não é possível usar 'Yield' em uma instrução 'Catch' ou em uma instrução 'Finally'.
ru: 'Yield нельзя использовать в операторе Catch или Finally.
tr: 'Yield' bir 'Catch' deyimi veya 'Finally' deyimi içinde kullanılamaz.
zh_hans: '不能在“Catch”语句或“Finally”语句内使用“Yield”。
zh_hant: 'Yield' 不能用在 'Catch' 陳述式或 'Finally' 陳述式內。

# WRN_DefAsgNoRetValWinRtEventVal1
source: The AddHandler for Windows Runtime event '{0}' doesn't return a value on all code paths. Are you missing a 'Return' statement?
cs: AddHandler pro událost Windows Runtimu {0} nevrací hodnotu na všech cestách kódu. Nechybí příkaz Return?
de: Der AddHandler für das Windows-Runtime-Ereignis "{0}" gibt nicht für alle Codepfade einen Wert zurück. Fehlt eine Return-Anweisung?
es: El AddHandler para el evento '{0}' de Windows Runtime no devuelve un valor en todas las rutas de acceso de código. ¿Falta alguna instrucción 'Return'?
fr: L'événement AddHandler pour Windows Runtime '{0}' ne retourne pas une valeur pour tous les chemins de code. Une instruction 'Return' est-elle manquante ?
it: L'evento '{0}' di AddHandler per Windows Runtime non restituisce alcun valore per tutti i percorsi del codice. Probabilmente manca un'istruzione 'Return'.
ja: Windows ランタイム イベント '{0}' の AddHandler には値を返さないコード パスがあります。'Return' ステートメントが不足していないかどうかを確認してください。
ko: Windows Runtime용 AddHandler 이벤트 '{0}'이(가) 일부 코드 경로에서만 값을 반환합니다. 'Return' 문이 있는지 확인하세요.
pl: Element AddHandler dla zdarzenia środowiska uruchomieniowego systemu Windows „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Czy nie brakuje instrukcji „Return”?
pt_br: O AddHandler para evento de Windows Runtime '{0}' não retorna um valor em todos os caminhos de código. Está faltando uma instrução 'Return'?
ru: AddHandler для события среды выполнения Windows "{0}" не возвращает значение для всех путей к коду. Возможно, отсутствует оператор "Return".
tr: '{0}' AddHandler for Windows Runtime olayı tüm kod yollarında değer döndürmüyor. 'Return' deyiminiz eksik olabilir mi?
zh_hans: Windows 运行时事件“{0}”的 AddHandler 不会在所有代码路径上都返回值。是否缺少“Return”语句?
zh_hant: Windows 執行階段事件 '{0}' 的 AddHandler，並未傳回有關所有程式碼路徑的值。是否遺漏了 'Return' 陳述式?

# WRN_DefAsgNoRetValWinRtEventVal1_Title
source: The AddHandler for Windows Runtime event doesn't return a value on all code paths
cs: AddHandler pro událost prostředí Windows Runtime nevrací hodnotu ve všech cestách kódu.
de: Das Ereignis "AddHandler für Windows Runtime" gibt nicht für alle Codepfade einen Wert zurück.
es: AddHandler para el evento de Windows Runtime no devuelve un valor en todas las rutas de código
fr: L’événement AddHandler pour Windows Runtime ne renvoie pas de valeur sur tous les chemins de code
it: L'evento di AddHandler per Windows Runtime non restituisce un valore per tutti i percorsi del codice
ja: Windows ランタイム イベントの AddHandler が、すべてのコード パスで値を返しません
ko: Windows 런타임 이벤트에 대한 AddHandler가 일부 코드 경로의 값을 반환하지 않음
pl: Element AddHandler dla zdarzenia środowiska uruchomieniowego systemu Windows nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: O AddHandler para Windows Runtime não retorna um valor em todos os caminhos de código
ru: Атрибут AddHandler для события среды выполнения Windows не возвращает значение на всех путях к коду
tr: Windows Çalışma Zamanı olayı için AddHandler, bütün kod yollarında bir değer döndürmüyor
zh_hans: Windows 运行时事件的 AddHandler 没有在所有代码路径上返回值
zh_hant: Windows 執行階段事件的 AddHandler 在所有程式碼路徑上皆不會傳回值

# ERR_PartialMethodDefaultParameterValueMismatch2
source: Optional parameter of a method '{0}' does not have the same default value as the corresponding parameter of the partial method '{1}'.
cs: Nepovinný parametr metody {0} nemá stejnou výchozí hodnotu jako odpovídající parametr částečné metody {1}.
de: Der optionale Parameter einer {0}-Methode hat nicht den gleichen Standardwert wie der entsprechende Parameter der partiellen {1}-Methode.
es: El parámetro opcional de un método '{0}' no tiene el mismo valor predeterminado que el parámetro correspondiente del método parcial '{1}'.
fr: Le paramètre facultatif d'une méthode '{0}' n'a pas la même valeur par défaut que le paramètre correspondant de la méthode partielle '{1}'.
it: Il parametro facoltativo di un metodo '{0}' non ha lo stesso valore predefinito del parametro corrispondente del metodo parziale '{1}'.
ja: メソッド '{0}' の省略可能なパラメーターの既定値が、部分メソッド '{1}' の対応するパラメーターと同じではありません。
ko: '{0}' 메서드의 선택적 매개 변수에는 '{1}' 부분 메서드(Partial Method)에 해당하는 매개 변수와 동일한 기본값이 없습니다.
pl: Parametr opcjonalny metody „{0}” nie ma tej samej wartości domyślnej co odpowiedni parametr metody częściowej „{1}”.
pt_br: Parâmetro opcional de um método "{0}" não tem o mesmo valor padrão do parâmetro correspondente do método parcial "{1}".
ru: Необязательный параметр метода "{0}" не имеет то же значение по умолчанию, что и соответствующий параметр разделяемого метода "{1}".
tr: '{0}' yönteminin isteğe bağlı parametresinin varsayılan değeri, '{1}' kısmi yönteminde buna karşılık gelen parametreninkiyle aynı değil.
zh_hans: 方法“{0}”的可选参数没有与分部方法“{1}”的相应参数相同的默认值。
zh_hant: 方法 '{0}' 的選擇性參數，與部分方法 '{1}' 的對應參數沒有相同的預設值。

# ERR_PartialMethodParamArrayMismatch2
source: Parameter of a method '{0}' differs by ParamArray modifier from the corresponding parameter of the partial method '{1}'.
cs: Parametr metody {0} se od odpovídajícího parametru částečné metody {1} liší modifikátorem ParamArray.
de: Der Parameter einer {0}-Methode unterscheidet sich durch den ParamArray-Modifizierer von dem entsprechenden Parameter der partiellen {1}-Methode.
es: El parámetro de un método '{0}' se diferencia en el modificador ParamArray del parámetro correspondiente del método parcial '{1}'.
fr: Le paramètre d'une méthode '{0}' diffère par son modificateur ParamArray du paramètre correspondant de la méthode partielle '{1}'.
it: Il parametro di un metodo '{0}' differisce per il modificatore ParamArray rispetto al parametro corrispondente del metodo parziale '{1}'.
ja: メソッド '{0}' のパラメーターが、ParamArray 修飾子において部分メソッド '{1}' の対応するパラメーターと異なっています。
ko: '{0}' 메서드의 매개 변수는 '{1}' 부분 메서드(Partial Method)에 해당하는 매개 변수의 ParamArray 한정자와 다릅니다.
pl: Parametr metody „{0}” różni się modyfikatorem ParamArray od odpowiedniego parametru metody częściowej „{1}”.
pt_br: Parâmetro de um método "{0}" é diferente do modificador ParamArray do parâmetro correspondente do método parcial "{1}".
ru: Параметр метода "{0}" отличается по модификатору ParamArray из соответствующего параметра разделяемого метода "{1}".
tr: '{0}' yönteminin parametresinin ParamArray değiştiricisi, '{1}' kısmi yönteminde buna karşılık gelen parametreninkinden farklı.
zh_hans: 方法“{0}”的参数在分部方法“{1}”的相应参数的 ParamArray 修饰符上存在差异。
zh_hant: 方法 '{0}' 的參數與部分方法 '{1}' 的對應參數間之差異，在於 ParamArray 的修飾元不同。

# ERR_NetModuleNameMismatch
source: Module name '{0}' stored in '{1}' must match its filename.
cs: Název modulu {0} uložený v {1} musí odpovídat svému názvu souboru.
de: Der in "{1}" gespeicherte Modulname "{0}" muss mit seinem Dateinamen übereinstimmen.
es: El nombre de archivo '{0}' almacenado en '{1}' debe coincidir con su nombre de archivo.
fr: Le nom de module '{0}' stocké dans '{1}' doit correspondre à son nom de fichier.
it: Il nome modulo '{0}' memorizzato in '{1}' deve corrispondere al relativo nome di file.
ja: '{1}' に格納されているモジュール名 '{0}' はファイル名と一致する必要があります。
ko: '{1}'에 저장된 '{0}' 모듈 이름은 파일 이름과 일치해야 합니다.
pl: Nazwa modułu „{0}” przechowywana w elemencie „{1}” musi być zgodna z nazwą jego pliku.
pt_br: Nome do módulo "{0}" armazenado em "{1}" deve coincidir com seu filename.
ru: Имя модуля "{0}", сохраненное в "{1}", должно соответствовать его имени файла.
tr: '{1}' öğesinde depolanan '{0}' modül adı dosya adıyla eşleşmelidir.
zh_hans: 存储在“{1}”中的模块名“{0}”必须与其文件名匹配。
zh_hant: 儲存在 '{1}' 中的模組名稱 '{0}'，必須符合其檔案名稱。

# ERR_BadModuleName
source: Invalid module name: {0}
cs: Neplatný název modulu: {0}
de: Ungültiger Modulname: {0}
es: Nombre de módulo no válido: {0}
fr: Nom de module non valide : {0}
it: Nome di modulo non valido: {0}
ja: 無効なモジュール名: {0}
ko: 잘못된 모듈 이름: {0}
pl: Nieprawidłowa nazwa modułu: {0}
pt_br: Nome de módulo inválido: {0}
ru: Недопустимое имя модуля: {0}
tr: Modül adı geçersiz: {0}
zh_hans: 无效的模块名称: {0}
zh_hant: 模組名稱 {0} 無效

# WRN_AssemblyAttributeFromModuleIsOverridden
source: Attribute '{0}' from module '{1}' will be ignored in favor of the instance appearing in source.
cs: Atribut {0} z modulu {1} se bude ignorovat ve prospěch instance, která se objeví ve zdroji.
de: Das Attribut "{0}" aus Modul "{1}" wird zugunsten der in der Quelle enthaltenen Instanz ignoriert.
es: El atributo '{0}' del módulo '{1}' se omitirá a favor de la instancia que aparece en el origen.
fr: L'attribut '{0}' du module '{1}' sera ignoré au profit de l'instance présente dans la source.
it: L'attributo '{0}' del modulo '{1}' verrà ignorato e verrà usata l'istanza presente nell'origine.
ja: ソースに表示されるインスタンスが優先されるため、モジュール '{1}' からの属性 '{0}' は無視されます。
ko: '{1}' 모듈의 '{0}' 특성은 소스에 나타나는 인스턴스를 위해 무시됩니다.
pl: Atrybut „{0}” z modułu „{1}” zostanie zignorowany na rzecz wystąpienia ze źródła.
pt_br: Atributo "{0}" do módulo "{1}" será ignorado em favor da instância que aparece na fonte.
ru: Атрибут "{0}" из модуля "{1}" будут игнорироваться в пользу экземпляра в исходнике.
tr: '{1}' modülünde '{0}' özniteliği yoksayılacak, bunun yerine kaynakta gösterilen örnek kullanılacak.
zh_hans: 来自模块“{1}”的特性“{0}”将忽略，以便支持源中出现的实例。
zh_hant: 將會忽略模組 '{1}' 中的屬性 '{0}'，改用出現在來源中的執行個體。

# WRN_AssemblyAttributeFromModuleIsOverridden_Title
source: Attribute from module will be ignored in favor of the instance appearing in source
cs: Atribut z modulu se bude ignorovat ve prospěch instance, která se objeví ve zdroji.
de: Das Attribut aus dem Modul wird zugunsten der in der Quelle angezeigten Instanz ignoriert.
es: Se ignorará el atributo del módulo en favor de la instancia que aparece en el origen
fr: L’attribut du module sera ignoré en faveur de l’instance qui apparaît dans la source
it: L'attributo del modulo verrà ignorato e verrà usata l'istanza presente nell'origine
ja: ソースに現れるインスタンスを優先して、モジュールからの属性は無視されます
ko: 모듈의 특성이 무시되고 소스에 표시되는 인스턴스가 대신 사용됨
pl: Atrybut z modułu zostanie zignorowany na rzecz wystąpienia ze źródła
pt_br: O atributo do módulo será ignorado em prol do aparecimento da instância na origem
ru: Вместо атрибута модуля будет показан экземпляр, отображающийся в источнике
tr: Modül özniteliği, kaynakta görünen örneğin kullanılması için yoksayılacak
zh_hans: 为支持源中出现的实例，将忽略模块的特性
zh_hant: 將會忽略模組中的屬性，改用出現在來源中的執行個體

# ERR_CmdOptionConflictsSource
source: Attribute '{0}' given in a source file conflicts with option '{1}'.
cs: Atribut {0} daný ve zdrojovém souboru je v konfliktu s možností {1}.
de: Das in einer Quelldatei angegebene Attribut "{0}" steht mit der Option "{1}" in Konflikt.
es: El atributo '{0}' indicado en un archivo de origen entra en conflicto con la opción '{1}'.
fr: L'attribut '{0}' spécifié dans un fichier source est en conflit avec l'option '{1}'.
it: L'attributo '{0}' specificato in un file di origine è in conflitto con l'opzione '{1}'.
ja: ソース ファイルで指定された属性 '{0}' はオプション '{1}' と競合しています。
ko: 소스 파일에 지정된 '{0}' 특성이 '{1}' 옵션과 충돌합니다.
pl: Atrybut „{0}” podany w pliku źródłowym jest w konflikcie z opcją „{1}”.
pt_br: O atributo '{0}' fornecido em um arquivo de origem conflita com a opção '{1}'.
ru: Атрибут "{0}", заданный в исходном файле, конфликтует с параметром "{1}".
tr: Bir kaynak dosyada verilen '{0}' özniteliği '{1}' seçeneği ile çakışıyor.
zh_hans: 源文件中提供的特定“{0}”与选项“{1}”冲突。
zh_hant: 原始程式檔中所提供的屬性 '{0}'，與選項 '{1}' 相衝突。

# WRN_ReferencedAssemblyDoesNotHaveStrongName
source: Referenced assembly '{0}' does not have a strong name.
cs: Odkazované sestavení {0} nemá silný název.
de: Die referenzierte Assembly "{0}" besitzt keinen starken Namen.
es: El ensamblado '{0}' al que se hace referencia no tiene un nombre seguro.
fr: L'assembly référencé '{0}' n'a pas de nom fort.
it: L'assembly '{0}' al quale si fa riferimento non ha un nome sicuro.
ja: 参照アセンブリ '{0}' には厳密な名前がありません。
ko: 참조된 어셈블리 '{0}'에 강력한 이름이 없습니다.
pl: Przywoływany zestaw „{0}” nie ma silnej nazwy.
pt_br: Assembly referenciado "{0}" não tem um nome forte.
ru: У сборки "{0}", на которую дается ссылка, нет строгого имени.
tr: '{0}' başvurulan derlemesinin güçlü bir adı yok.
zh_hans: 引用程序集“{0}”没有强名称。
zh_hant: 參考組件 '{0}' 沒有強式名稱。
