Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_FieldHasMultipleDistinctConstantValues
source: The field has multiple distinct constant values.
cs: Pole má víc odlišných konstantních hodnot.
de: Das Feld weist mehrere eindeutige konstante Werte auf.
es: El campo tiene varios valores constantes distintos.
fr: Le champ contient plusieurs valeurs de constante distinctes.
it: Il campo ha più valori costanti distinct.
ja: フィールドに複数の異なる定数値があります。
ko: 필드에 고유한 상수 값이 여러 개 있습니다.
pl: Pole ma wiele unikatowych wartości stałych.
pt_br: O campo tem vários valores constantes distintos.
ru: Поле имеет несколько различных константных значений.
tr: Alanın birden fazla farklı sabit değeri vardır.
zh_hans: 字段具有多个不同的常量值。
zh_hant: 此欄位有多個相異的常數值。

# ERR_EncNoPIAReference
source: Cannot continue since the edit includes a reference to an embedded type: '{0}'.
cs: Nedá se pokračovat, protože úprava obsahuje odkaz na vložený typ: {0}
de: Die Bearbeitung enthält einen Verweis auf einen eingebetteten Typ und kann daher nicht fortgesetzt werden: "{0}".
es: No se puede continuar porque la edición incluye una referencia a un tipo incrustado: '{0}'.
fr: Impossible de continuer, car la modification inclut une référence à un type incorporé : '{0}'.
it: Non è possibile continuare perché la modifica include un riferimento a un tipo incorporato: '{0}'.
ja: 編集に埋め込み型の '{0}' への参照が含まれるため続行できません。
ko: 편집의 포함된 형식 '{0}'에 대한 참조가 포함되어 있어 계속할 수 없습니다.
pl: Nie można kontynuować, ponieważ edycja zawiera odwołanie do typu osadzonego: „{0}”
pt_br: Não é possível continuar pois a edição inclui uma referência a um tipo incorporado: '{0}'.
ru: Не удается продолжить, так как оператор edit содержит ссылку на встроенный тип: "{0}".
tr: Düzen gömülü bir türe başvuru içerdiğinden devam edilemiyor: '{0}'.
zh_hans: 无法继续，因为编辑包括对嵌入类型的引用:“{0}”。
zh_hant: 無法繼續，因為編輯包含內嵌類型的參考: '{0}'。

# ERR_EncReferenceToAddedMember
source: Member '{0}' added during the current debug session can only be accessed from within its declaring assembly '{1}'.
cs: Ke členu {0} přidanému během aktuální relace ladění se dá přistupovat jenom z jeho deklarovaného sestavení {1}.
de: Auf das während der aktuellen Debuggingsitzung hinzugefügte Element "{0}" kann nur aus der deklarierenden Assembly "{1}" heraus zugegriffen werden.
es: Al miembro '{0}' agregado durante la sesión de depuración actual solo se puede acceder desde el ensamblado donde se declara, '{1}'.
fr: Le membre '{0}' ajouté durant la session de débogage actuelle est uniquement accessible à partir de son assembly de déclaration '{1}'.
it: Il membro '{0}' aggiunto durante la sessione di debug corrente è accessibile solo dall'interno dell'assembly '{1}' in cui viene dichiarato.
ja: 現在のデバッグ セッション中に追加されたメンバー '{0}' には、宣言しているアセンブリ '{1}' からのみアクセスできます。
ko: 현재 디버그 세션 중에 추가되는 '{0}' 멤버는 해당 선언 어셈블리 '{1}' 내에서만 액세스할 수 있습니다.
pl: Dostęp do składowej „{0}” dodanej podczas bieżącej sesji debugowania można uzyskać tylko w deklarowanym zestawie „{1}”.
pt_br: Membro '{0}' adicionado durante a sessão de depuração atual pode ser acessado somente neste assembly de declaração '{1}'.
ru: Доступ к члену "{0}", добавленному в ходе текущего сеанса отладки, возможен только из его объявляющей сборки "{1}".
tr: Geçerli hata ayıklama oturumu sırasında eklenen '{0}' üyesine, yalnızca bildirme derlemesi '{1}' içinden erişilebilir.
zh_hans: 在当前调试会话期间添加的成员“{0}”只能从其声明的程序集“{1}”中访问。
zh_hant: 在目前偵錯工作階段期間加入的成員 '{0}'，只能從其宣告組件中 '{1}' 存取。

# ERR_UnsupportedModule1
source: '{0}' is an unsupported .NET module.
cs: '{0} je nepodporovaný modul .NET.
de: '"{0}" ist ein .NET-Modul, das nicht unterstützt wird.
es: '{0}' es un módulo .NET no admitido.
fr: '{0}' est un module .NET non pris en charge.
it: '{0}' è un modulo .NET non supportato.
ja: '{0}' は、サポートされていない .NET モジュールです。
ko: '{0}'은(는) 지원되지 않는 .NET 모듈입니다.
pl: 'Element „{0}” jest nieobsługiwanym modułem platformy .NET.
pt_br: "{0}" é um módulo .NET sem suporte.
ru: "{0}" не поддерживается модулем .NET.
tr: '{0}', desteklenmeyen bir .NET modülü.
zh_hans: '“{0}”是不受支持的 .NET 模块。
zh_hant: '{0}' 不是支援的 .NET 模組。

# ERR_UnsupportedEvent1
source: '{0}' is an unsupported event.
cs: '{0} je nepodporovaná událost.
de: '"{0}" ist ein Ereignis, das nicht unterstützt wird.
es: '{0}' es un evento no admitido.
fr: '{0}' est un événement non pris en charge.
it: '{0}' è un evento non supportato.
ja: '{0}' のイベントはサポートされていません。
ko: '{0}'은(는) 지원되지 않는 이벤트입니다.
pl: 'Element „{0}” jest nieobsługiwanym zdarzeniem.
pt_br: "{0}" é um evento sem suporte.
ru: "{0}" является неподдерживаемым событием.
tr: '{0}', desteklenmeyen bir olay.
zh_hans: '“{0}”是不受支持的事件。
zh_hant: '{0}' 是不支援的事件。

source: Properties can not have type arguments
cs: Vlastnosti nemůžou mít argumenty typu.
de: Eigenschaften können keine Typargumente haben
es: Las propiedades no pueden tener argumentos de tipo
fr: Les propriétés ne peuvent pas avoir d'arguments de type
it: Le proprietà non possono avere argomenti di tipo
ja: プロパティは型引数を持てません
ko: 속성에 형식 인수를 사용할 수 없습니다.
pl: Właściwości nie mogą mieć argumentów typu
pt_br: Propriedades não podem ter argumentos de tipo
ru: Свойства не могут иметь тип аргументов.
tr: Özelliklerin tür bağımsız değişkenleri olamaz
zh_hans: 属性不能具有类型参数
zh_hant: 屬性不可有類型引數

source: IdentifierSyntax not within syntax tree
cs: IdentifierSyntax není ve stromu syntaxe.
de: IdentifierSyntax nicht innerhalb Syntaxbaum
es: IdentifierSyntax no está dentro del árbol de sintaxis
fr: IdentifierSyntax ne se trouve pas dans l'arborescence de syntaxe
it: IdentifierSyntax non è compreso nell'albero della sintassi
ja: IdentifierSyntax が構文ツリー内にありません
ko: 구문 트리 내에 IdentifierSyntax가 없습니다.
pl: Element IdentifierSyntax nie znajduje się w obrębie drzewa składni
pt_br: IdentifierSyntax não está na árvore de sintaxe
ru: IdentifierSyntax находится вне синтаксического дерева
tr: IdentifierSyntax, söz dizimi ağacı içinde değil
zh_hans: IdentifierSyntax 不在语法树中
zh_hant: IdentifierSyntax 不在語法樹狀結構中

# AnonymousObjectCreationExpressionSyntaxNotWithinTree
source: AnonymousObjectCreationExpressionSyntax not within syntax tree
cs: AnonymousObjectCreationExpressionSyntax není ve stromu syntaxe.
de: AnonymousObjectCreationExpressionSyntax nicht innerhalb Syntaxbaum
es: AnonymousObjectCreationExpressionSyntax no está dentro del árbol de sintaxis
fr: AnonymousObjectCreationExpressionSyntax ne se trouve pas dans l'arborescence de syntaxe
it: AnonymousObjectCreationExpressionSyntax non è compreso nell'albero della sintassi
ja: AnonymousObjectCreationExpressionSyntax が構文ツリー内に存在しません
ko: AnonymousObjectCreationExpressionSyntax가 구문 트리 내에 없습니다.
pl: Brak elementu AnonymousObjectCreationExpressionSyntax w drzewie składni
pt_br: AnonymousObjectCreationExpressionSyntax não está na árvore de sintaxe
ru: AnonymousObjectCreationExpressionSyntax находится вне синтаксического дерева
tr: AnonymousObjectCreationExpressionSyntax söz dizimi ağacının içinde değil
zh_hans: AnonymousObjectCreationExpressionSyntax 未在语法树内
zh_hant: AnonymousObjectCreationExpressionSyntax 不在語法樹狀結構中

source: FieldInitializerSyntax not within syntax tree
cs: FieldInitializerSyntax není ve stromu syntaxe.
de: FieldInitializerSyntax nicht innerhalb Syntaxbaum
es: FieldInitializerSyntax no está dentro del árbol de sintaxis
fr: FieldInitializerSyntax ne se trouve pas dans l'arborescence de syntaxe
it: FieldInitializerSyntax non è compreso nell'albero della sintassi
ja: FieldInitializerSyntax が構文ツリー内にありません
ko: 구문 트리 내에 FieldInitializerSyntax가 없습니다.
pl: Element FieldInitializerSyntax nie znajduje się w obrębie drzewa składni
pt_br: FieldInitializerSyntax não está na árvore de sintaxe
ru: FieldInitializerSyntax находится вне синтаксического дерева
tr: FieldInitializerSyntax, söz dizimi ağacı içinde değil
zh_hans: FieldInitializerSyntax 不在语法树中
zh_hant: FieldInitializerSyntax 不在語法樹狀結構中

# IDS_TheSystemCannotFindThePathSpecified
source: The system cannot find the path specified
cs: Systém nemůže najít zadanou cestu.
de: Das System konnte den angegebenen Pfad nicht finden.
es: El sistema no encuentra la ruta de acceso especificada
fr: Le système ne trouve pas le chemin indiqué
it: Il percorso specificato non è stato trovato
ja: 指定されたパスが見つかりません
ko: 시스템이 지정한 경로를 찾을 수 없습니다.
pl: System nie może odnaleźć określonej ścieżki.
pt_br: O sistema não pode localizar o caminho especificado
ru: Системе не удается найти указанный путь
tr: Sistem belirtilen yolu bulamadı
zh_hans: 系统无法找到指定路径
zh_hant: 系統找不到指定的路徑

source: There are no pointer types in VB.
cs: Ve VB nejsou žádné typy ukazatelů.
de: Es sind keine Zeigertypen in VB vorhanden.
es: No hay tipos de punteros en VB.
fr: Les types pointer n'existent pas en VB.
it: Non ci sono tipi puntatore in VB.
ja: VB にポインター型はありません。
ko: VB에 포인터 형식이 없습니다.
pl: Brak typów wskaźnikowych w języku Visual Basic.
pt_br: Não há tipos de ponteiro no VB.
ru: В VB нет типов указателей.
tr: VB'de işaretçi türü yok.
zh_hans: VB 中没有任何指针属性。
zh_hant: VB 中沒有指標類型。

source: There is no dynamic type in VB.
cs: Ve VB není žádný dynamický typ.
de: Es ist kein dynamischer Typ in VB vorhanden.
es: No hay ningún tipo dinámico en VB.
fr: Les types dynamiques n'existent pas en VB.
it: Non ci sono tipi dinamici in VB.
ja: VB に動的な型はありません。
ko: VB에 동적 형식이 없습니다.
pl: Brak typów dynamicznych w języku Visual Basic.
pt_br: Não há tipo dinâmico no VB.
ru: В VB нет динамического типа.
tr: VB'de dinamik tür yok.
zh_hans: VB 中没有任何动态类型。
zh_hant: VB 中沒有動態類型。

source: variableSyntax not within syntax tree
cs: variableSyntax není ve stromu syntaxe.
de: variableSyntax nicht innerhalb von Syntaxbaum
es: variableSyntax no está dentro del árbol de sintaxis
fr: variableSyntax ne se trouve pas dans l'arborescence de syntaxe
it: variableSyntax non è compreso nell'albero della sintassi
ja: variableSyntax が構文ツリー内にありません
ko: 구문 트리 내에 variableSyntax가 없습니다.
pl: Element variableSyntax nie znajduje się w obrębie drzewa składni
pt_br: variableSyntax não está na árvore de sintaxe
ru: variableSyntax находится вне синтаксического дерева
tr: variableSyntax, söz dizimi ağacı içinde değil
zh_hans: variableSyntax 不在语法树中
zh_hant: variableSyntax 不在語法樹狀結構中

source: AggregateSyntax not within syntax tree
cs: AggregateSyntax není ve stromu syntaxe.
de: AggregateSyntax nicht innerhalb Syntaxbaum
es: AggregateSyntax no está dentro del árbol de sintaxis
fr: AggregateSyntax ne se trouve pas dans l'arborescence de syntaxe
it: AggregateSyntax non è compreso nell'albero della sintassi
ja: AggregateSyntax が構文ツリー内に存在しません
ko: AggregateSyntax가 구문 트리 내에 없습니다.
pl: Brak elementu AggregateSyntax w drzewie składni
pt_br: AggregateSyntax não está na árvore de sintaxe
ru: AggregateSyntax находится вне синтаксического дерева
tr: AggregateSyntax, söz dizimi ağacının içinde değil
zh_hans: AggregateSyntax 未在语法树内
zh_hant: AggregateSyntax 不在語法樹狀結構中

source: FunctionSyntax not within syntax tree
cs: FunctionSyntax není ve stromu syntaxe.
de: FunctionSyntax nicht innerhalb Syntaxbaum
es: FunctionSyntax no está dentro del árbol de sintaxis
fr: FunctionSyntax ne se trouve pas dans l'arborescence de syntaxe
it: FunctionSyntax non è compreso nell'albero della sintassi
ja: FunctionSyntax が構文ツリー内にありません
ko: 구문 트리 내에 FunctionSyntax가 없습니다.
pl: Element FunctionSyntax nie znajduje się w obrębie drzewa składni
pt_br: FunctionSyntax não está na árvore de sintaxe
ru: FunctionSyntax находится вне синтаксического дерева
tr: FunctionSyntax, söz dizimi ağacı içinde değil
zh_hans: FunctionSyntax 不在语法树中
zh_hant: FunctionSyntax 不在語法樹狀結構中

# PositionIsNotWithinSyntax
source: Position is not within syntax tree
cs: Pozice není ve stromu syntaxe.
de: Position ist nicht innerhalb von Syntaxbaum
es: La posición no está dentro del árbol de sintaxis
fr: La position ne se trouve pas dans l'arborescence de syntaxe
it: La posizione non è compresa nell'albero della sintassi
ja: 位置が構文ツリー内にありません
ko: 위치가 구문 트리 내에 없습니다.
pl: Pozycja nie znajduje się w obrębie drzewa składni
pt_br: Posição não está na árvore de sintaxe
ru: Позиция не входит в синтаксическое дерево.
tr: Konum, söz dizimi ağacı içinde değil
zh_hans: 位置不在语法树中
zh_hant: Position 不在語法樹狀結構中

source: RangeVariableSyntax not within syntax tree
cs: RangeVariableSyntax není ve stromu syntaxe.
de: RangeVariableSyntax nicht innerhalb Syntaxbaum
es: RangeVariableSyntax no está dentro del árbol de sintaxis
fr: RangeVariableSyntax ne se trouve pas dans l'arborescence de syntaxe
it: RangeVariableSyntax non è compreso nell'albero della sintassi
ja: RangeVariableSyntax が構文ツリー内にありません
ko: 구문 트리 내에 RangeVariableSyntax가 없습니다.
pl: Element RangeVariableSyntax nie znajduje się w obrębie drzewa składni
pt_br: RangeVariableSyntax não está na árvore de sintaxe
ru: RangeVariableSyntax находится вне синтаксического дерева
tr: RangeVariableSyntax, söz dizimi ağacı içinde değil
zh_hans: RangeVariableSyntax 不在语法树中
zh_hant: RangeVariableSyntax 不在語法樹狀結構中

source: DeclarationSyntax not within syntax tree
cs: DeclarationSyntax není ve stromu syntaxe.
de: DeclarationSyntax nicht innerhalb Syntaxbaum
es: DeclarationSyntax no está dentro del árbol de sintaxis
fr: DeclarationSyntax ne se trouve pas dans l'arborescence de syntaxe
it: DeclarationSyntax non è compreso nell'albero della sintassi
ja: DeclarationSyntax が構文ツリー内に存在しません
ko: DeclarationSyntax가 구문 트리 내에 없습니다.
pl: Brak elementu DeclarationSyntax w drzewie składni
pt_br: DeclarationSyntax não está na árvore de sintaxe
ru: DeclarationSyntax вне синтаксического дерева
tr: DeclarationSyntax söz dizimi ağacı içinde değil
zh_hans: DeclarationSyntax 未在语法树内
zh_hant: DeclarationSyntax 不在語法樹狀結構中

# StatementOrExpressionIsNotAValidType
source: StatementOrExpression is not an ExecutableStatementSyntax or an ExpressionSyntax
cs: StatementOrExpression není ExecutableStatementSyntax nebo ExpressionSyntax.
de: StatementOrExpression ist keine ExecutableStatementSyntax oder ExpressionSyntax
es: StatementOrExpression no es una ExecutableStatementSyntax ni una ExpressionSyntax
fr: StatementOrExpression n'est pas un ExecutableStatementSyntax ou un ExpressionSyntax
it: StatementOrExpression non è un elemento ExecutableStatementSyntax o ExpressionSyntax
ja: StatementOrExpression は、ExecutableStatementSyntax や ExpressionSyntax ではありません
ko: StatementOrExpression은 ExecutableStatementSyntax 또는 ExpressionSyntax가 아닙니다.
pl: Element StatementOrExpression nie jest typu ExecutableStatementSyntax lub ExpressionSyntax
pt_br: StatementOrExpression não é uma ExecutableStatementSyntax ou uma ExpressionSyntax
ru: StatementOrExpression не является ExecutableStatementSyntax или ExpressionSyntax
tr: StatementOrExpression bir ExecutableStatementSyntax veya ExpressionSyntax değil
zh_hans: StatementOrExpression 不是 ExecutableStatementSyntax 或 ExpressionSyntax
zh_hant: StatementOrExpression 不是 ExecutableStatementSyntax 或 ExpressionSyntax

source: DeclarationSyntax not within tree
cs: DeclarationSyntax není ve stromu.
de: DeclarationSyntax nicht innerhalb Baum
es: DeclarationSyntax no está dentro del árbol
fr: DeclarationSyntax ne se trouve pas dans l'arborescence
it: DeclarationSyntax non è compreso nell'albero
ja: DeclarationSyntax がツリー内に存在しません
ko: DeclarationSyntax가 트리 내에 없습니다.
pl: Brak elementu DeclarationSyntax w drzewie
pt_br: DeclarationSyntax não está na árvore
ru: DeclarationSyntax вне дерева
tr: DeclarationSyntax ağaç içinde değil
zh_hans: DeclarationSyntax 未在树内
zh_hant: DeclarationSyntax 不在樹狀結構中

source: TypeParameter not within tree
cs: TypeParameter není ve stromu syntaxe.
de: TypeParameter nicht innerhalb von Baum
es: TypeParameter no está dentro del árbol
fr: TypeParameter ne se trouve dans l'arborescence
it: TypeParameter non è compreso nell'albero
ja: TypeParameter がツリー内にありません
ko: 트리 내에 TypeParameter가 없습니다.
pl: Element TypeParameter w nie znajduje się w obrębie drzewa
pt_br: TypeParameter não está na árvore
ru: TypeParameter находится вне дерева
tr: TypeParameter, ağacın içinde değil
zh_hans: TypeParameter 不在树中
zh_hant: TypeParameter 不在樹狀結構中

source: not within tree
cs: není ve stromu
de: nicht innerhalb Baum
es: no está dentro del árbol
fr: ne se trouve pas dans l'arborescence
it: non compreso nell'albero
ja: ツリー内にありません
ko: 트리 내에 없습니다.
pl: nie w obrębie drzewa
pt_br: não está na árvore
ru: вне дерева
tr: ağacın içinde değil
zh_hans: 不在树中
zh_hant: 不在樹狀結構中

# LocationMustBeProvided
source: Location must be provided in order to provide minimal type qualification.
cs: Musí být zadané umístění, aby se zajistila minimální kvalifikace typu.
de: Für eine minimale Typqualifizierung muss der Pfad angegeben werden.
es: La ubicación se debe indicar para proporcionar una cualificación de tipo mínima.
fr: L'emplacement doit être indiqué pour fournir une qualification de type minimale.
it: Per offrire una qualifica minima del tipo, è necessario specificare Position.
ja: 提供される型の修飾子を最小にするため、場所を提供する必要があります。
ko: 최소 형식 한정자를 제공하려면 위치를 제공해야 합니다.
pl: Lokalizacja musi być określona, aby zapewnić minimalną kwalifikację typu.
pt_br: Local deve ser fornecido para fornecer a qualificação do tipo mínimo.
ru: Чтобы выполнить минимальную квалификацию типа, необходимо указать расположение.
tr: Minimum tür özelliği sağlamak için konum verilmelidir.
zh_hans: 必须提供位置才能提供最低程度的类型限定。
zh_hant: 必須提供位置，才可提供最基本的類型限定性條件。

# SemanticModelMustBeProvided
source: SemanticModel must be provided in order to provide minimal type qualification.
cs: Musí být zadaný SemanticModel, aby se zajistila minimální kvalifikace typu.
de: SemanticModel muss angegeben werden, um eine minimale Typqualifikation bereitzustellen.
es: SemanticModel se debe indicar para proporcionar una cualificación de tipo mínima.
fr: SemanticModel doit être indiqué afin de fournir une qualification de type minimale.
it: Per offrire una qualifica minima del tipo, è necessario specificare SemanticModel.
ja: 最小限の型修飾子を提供するには、SemanticModel が必要です。
ko: 최소 형식 한정자를 제공하려면 SemanticModel을 제공해야 합니다.
pl: Należy podać element SemanticModel w celu określenia minimalnej kwalifikacji typu.
pt_br: SemanticModel deve ser fornecido para fornecer a qualificação de tipo mínima.
ru: Для обеспечения минимального типа квалификации требуется SemanticModel.
tr: En düşük tür nitelemesini sağlamak için SemanticModel sağlanmalıdır.
zh_hans: 必须提供 SemanticModel 才能提供最低程度的类型限定。
zh_hant: 必須提供 SemanticModel，才可提供最基本的類型限定性條件。

# NumberOfTypeParametersAndArgumentsMustMatch
source: the number of type parameters and arguments should be the same
cs: Počet parametrů typu a argumentů by měl být stejný.
de: Die Anzahl der Typparameter und Argumente muss gleich sein.
es: el número de parámetros de tipo y de argumentos debe ser igual
fr: le nombre de paramètres et d'arguments de type doit être identique
it: il numero di parametri di tipo e argomenti deve essere uguale
ja: 型パラメーターと引数の数を同じにする必要があります
ko: 형식 매개 변수와 인수 수가 같아야 합니다.
pl: liczba parametrów typu i argumentów typu powinna być taka sama
pt_br: o número de parâmetros de tipo e argumentos deve ser o mesmo
ru: Число типа параметров и аргументов должно быть одинаковым.
tr: tür parametreleriyle bağımsız değişkenlerin sayısı aynı olmalıdır
zh_hans: 类型形参和实参的数量应相同
zh_hant: 類型參數和引數的數目應相同

# ERR_ResourceInModule
source: Cannot link resource files when building a module
cs: Při sestavování modulu nejde propojit soubory prostředků.
de: Beim Erstellen eines Moduls ist eine Verknüpfung mit Ressourcendateien nicht möglich.
es: No se puede vincular archivos de recursos al compilar un módulo
fr: Impossible de lier des fichiers de ressources lors de la création d'un module
it: Non è possibile collegare i file di risorse durante la compilazione di un modulo
ja: モジュールをビルド中にリソース ファイルにリンクできません
ko: 모듈을 빌드하는 동안 리소스 파일을 링크할 수 없습니다.
pl: Nie można połączyć plików zasobów podczas kompilowania modułu
pt_br: Não é possível vincular arquivos de recursos ao criar um módulo
ru: Не удается связать файлы ресурсов при сборке модуля.
tr: Modül oluşturulurken kaynak dosyaları bağlanamaz
zh_hans: 生成模块时，无法链接资源文件
zh_hant: 建立模組時無法連結資源檔案

source: Not a VB symbol.
cs: Nepředstavuje symbol VB.
de: Kein VB-Symbol.
es: No es un símbolo de VB.
fr: Symbole VB non valide.
it: Non è un simbolo di VB.
ja: VB シンボルではありません。
ko: VB 기호가 아닙니다.
pl: Nie jest to symbol języka Visual Basic.
pt_br: Não é um símbolo de VB.
ru: Не символ VB.
tr: Bir VB sembolü değil.
zh_hans: 不是 VB 符号。
zh_hant: 不是 VB 符號。

source: Elements cannot be null.
cs: Elementy nemůžou mít hodnotu null.
de: Elemente können nicht NULL sein.
es: Los elementos no pueden ser NULL.
fr: Les éléments ne peuvent pas avoir la valeur null.
it: Gli elementi non possono essere Null.
ja: 要素を null にすることはできません。
ko: 요소는 null일 수 없습니다.
pl: Elementy nie mogą mieć wartości null.
pt_br: Elementos não podem ser nulos.
ru: Элементы не могут иметь значение Null.
tr: Öğeler null olamaz.
zh_hans: 元素不能为 Null。
zh_hant: 項目不可為 null。

# HDN_UnusedImportClause
source: Unused import clause.
cs: Nepoužívaná klauzule importu
de: Nicht verwendete Import-Klausel.
es: Cláusula de importación sin usar.
fr: Clause d’importation inutilisée.
it: Clausola import non usata.
ja: 未使用のインポート句です。
ko: 사용하지 않는 import 절입니다.
pl: Nieużywana klauzula importu.
pt_br: Cláusula de importação não usada.
ru: Неиспользуемое предложение import.
tr: Kullanılmayan içeri aktarma yan tümcesi.
zh_hans: 未使用导入子句。
zh_hant: 未使用的匯入子句。

# HDN_UnusedImportStatement
source: Unused import statement.
cs: Nepoužívaný příkaz importu
de: Nicht verwendete Import-Anweisung.
es: Instrucción de importación sin usar.
fr: Instruction d’importation inutilisée.
it: Istruzione import non usata.
ja: 未使用のインポート ステートメントです。
ko: 사용하지 않는 import 문입니다.
pl: Nieużywana instrukcja importu.
pt_br: Instrução de importação não usada.
ru: Неиспользуемый оператор import.
tr: Kullanılmayan içeri aktarma deyimi.
zh_hans: 未使用导入语句。
zh_hant: 未使用的匯入陳述式。

# WrongSemanticModelType
source: Expected a {0} SemanticModel.
cs: Očekával se SemanticModel {0}.
de: SemanticModel "{0}" erwartet.
es: Se esperaba un SemanticModel de {0}.
fr: SemanticModel {0} attendu.
it: È previsto un elemento SemanticModel {0}.
ja: {0} の SemanticModel が必要です。
ko: {0} SemanticModel이 필요합니다.
pl: Oczekiwano elementu SemanticModel {0}.
pt_br: Espera-se um {0} SemanticModel.
ru: Требуется {0} SemanticModel.
tr: Beklenen bir {0} SemanticModel.
zh_hans: 应为 {0} SemanticModel。
zh_hant: 必須是 {0} SemanticModel。

# PositionNotWithinTree
source: Position must be within span of the syntax tree.
cs: Pozice musí být v rozpětí stromu syntaxe.
de: Die Position muss im Bereich des Syntaxbaums sein.
es: La posición debe estar dentro del intervalo del árbol de sintaxis.
fr: La position doit se trouver dans l'étendue de l'arborescence de syntaxe.
it: La posizione deve essere inclusa nello span dell'albero della sintassi.
ja: 場所は、構文ツリーのスパン内にある必要があります。
ko: 위치는 구문 트리 범위 내에 있어야 합니다.
pl: Pozycja musi znajdować się w zasięgu drzewa składni.
pt_br: A posição deve ser dentro do intervalo da árvore de sintaxe.
ru: Позиция должна находиться в диапазоне синтаксического дерева.
tr: Konum sözdizimi ağacı kapsamı içinde olmalıdır.
zh_hans: 位置必须处于语法树范围内。
zh_hant: 位置必須在語法樹狀結構的範圍內。
