Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AmbiguousInModules2
source: '{0}' is ambiguous between declarations in Modules '{1}'.
cs: 'Název {0} je nejednoznačný mezi deklaracemi v modulech {1}.
de: '"{0}" ist zwischen Deklarationen in den Modulen "{1}" mehrdeutig.
es: '{0}' es ambiguo entre las declaraciones de los módulos '{1}'.
fr: '{0}' est ambigu entre les déclarations des modules '{1}'.
it: '{0}' è ambiguo tra le dichiarazioni nei moduli '{1}'.
ja: '{0}' は、モジュール '{1}' 内の宣言間においてあいまいです。
ko: '{0}'이(가) '{1}' 모듈의 선언 사이에서 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny między deklaracjami w modułach „{1}”.
pt_br: "{0}" é ambíguo entre declarações em Módulos "{1}".
ru: "{0}" неоднозначен для объявлений в модулях "{1}".
tr: '{0}', '{1}' Modüllerinki bildirimler arasında belirsiz.
zh_hans: '“{0}”在模块“{1}”中的声明之间不明确。
zh_hant: '{0}' 在模組 '{1}' 中的宣告之間模稜兩可。

# ERR_AmbiguousInNamespaces2
source: '{0}' is ambiguous between declarations in namespaces '{1}'.
cs: 'Název {0} je nejednoznačný mezi deklaracemi v oboru názvů {1}.
de: '"{0}" ist zwischen Deklarationen in den Namespaces "{1}" mehrdeutig.
es: '{0}' es ambiguo entre declaraciones en espacios de nombres '{1}'.
fr: '{0}' est ambigu entre les déclarations dans les espaces de noms '{1}'.
it: '{0}' è ambiguo tra le dichiarazioni negli spazi dei nomi '{1}'.
ja: '{0}' は、名前空間 '{1}' 内の宣言間においてあいまいです。
ko: '{0}'이(가) '{1}' 네임스페이스의 선언 사이에서 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny między deklaracjami w przestrzeniach nazw „{1}”.
pt_br: "{0}" é ambíguo entre declarações e namespace "{1}".
ru: "{0}" неоднозначен для объявлений в пространствах имен "{1}".
tr: '{0}', '{1}' ad alanlarındaki bildirimler arasında belirsiz.
zh_hans: '“{0}”在命名空间“{1}”中的声明之间不明确。
zh_hant: '{0}' 在命名空間 '{1}' 中的宣告之間模稜兩可。

# ERR_ArrayInitializerTooFewDimensions
source: Array initializer has too few dimensions.
cs: Inicializátor pole nemá dost rozměrů.
de: Der Arrayinitialisierer hat zu wenig Dimensionen.
es: El inicializador de matriz no tiene suficientes dimensiones.
fr: L'initialiseur de tableau n'utilise pas suffisamment de dimensions.
it: L'inizializzatore di matrice contiene un numero insufficiente di dimensioni.
ja: 配列初期化子の次元が少なすぎます。
ko: 배열 이니셜라이저의 차원이 너무 적습니다.
pl: Inicjator tablicy ma za mało wymiarów.
pt_br: O inicializador de matriz tem muitas dimensões.
ru: Недостаточное число измерений инициализатора массива.
tr: Dizi başlatıcının çok az boyutu var.
zh_hans: 数组初始值设定项的维数太少。
zh_hant: 陣列初始設定式的維度太少。

# ERR_ArrayInitializerTooManyDimensions
source: Array initializer has too many dimensions.
cs: Inicializátor pole má moc rozměrů.
de: Der Arrayinitialisierer hat zu viele Dimensionen.
es: El inicializador de matriz tiene demasiadas dimensiones.
fr: L'initialiseur de tableau utilise trop de dimensions.
it: L'inizializzatore di matrice contiene un numero eccessivo di dimensioni.
ja: 配列初期化子の次元が多すぎます。
ko: 배열 이니셜라이저의 차원이 너무 많습니다.
pl: Inicjator tablicy ma za dużo wymiarów.
pt_br: O inicializador de matriz tem um número excessivo de dimensões.
ru: Чрезмерное число измерений инициализатора массива.
tr: Dizi başlatıcının çok fazla boyutu var.
zh_hans: 数组初始值设定项的维数太多。
zh_hant: 陣列初始設定式的維度太多。

# ERR_InitializerTooFewElements1
source: Array initializer is missing {0} elements.
cs: V inicializátoru pole chybí tento počet elementů: {0}.
de: Dem Arrayinitialisierer fehlen {0} Elemente.
es: Al inicializador de matriz le faltan {0} elementos.
fr: Il manque {0} éléments à l'initialiseur de tableau.
it: Nell'inizializzatore di matrice mancano {0} elementi.
ja: 配列初期化子には {0} 個の要素が足りません。
ko: 배열 이니셜라이저에 요소가 {0}개 없습니다.
pl: W inicjatorze tablicy brak następującej liczby elementów: {0}.
pt_br: O inicializador de matriz está sem {0} elementos.
ru: Количество отсутствующих элементов в инициализаторе массива: {0}.
tr: Dizi başlatıcıda {0} öğe eksik.
zh_hans: 数组初始值设定项缺少 {0} 个元素。
zh_hant: 陣列初始設定式遺漏 {0} 個元素。

# ERR_InitializerTooManyElements1
source: Array initializer has {0} too many elements.
cs: Inicializátor pole překračuje počet elementů o tento počet: {0}.
de: Der Arrayinitialisierer hat {0} Elemente zu viel.
es: El inicializador de matriz tiene demasiados elementos {0}.
fr: L'initialiseur de tableau utilise {0} élément(s) de trop.
it: L'inizializzatore di matrice ha '{0}' elementi in eccesso.
ja: 配列初期化子には {0} 個の要素が余分です。
ko: 배열 이니셜라이저의 요소가 {0}개 많습니다.
pl: Inicjator tablicy ma za dużo elementów (o {0}).
pt_br: Inicializador de matriz tem {0} muitos elementos.
ru: В инициализаторе массива слишком много элементов {0}.
tr: Dizi başlatıcıda çok faza öğe var: {0}.
zh_hans: 数组初始值设定项拥有的元素太多({0}个)。
zh_hant: 陣列初始設定式有 {0} 太多元素。

# ERR_NewOnAbstractClass
source: 'New' cannot be used on a class that is declared 'MustInherit'.
cs: 'Klíčové slovo New nejde použít pro třídu s deklarací MustInherit.
de: 'New darf nicht für eine Klasse verwendet werden, die als "MustInherit" deklariert ist.
es: 'New' no se puede usar en una clase declarada como 'MustInherit'.
fr: 'New' ne peut pas être utilisé dans une classe déclarée 'MustInherit'.
it: 'Non è possibile usare 'New' in una classe dichiarata come 'MustInherit'.
ja: 'MustInherit' として宣言されたクラスでは、'New' を使用することはできません。
ko: 'New'는 'MustInherit'으로 선언된 클래스에 사용할 수 없습니다.
pl: 'Nie można użyć instrukcji „New” w klasie, która jest zadeklarowana jako „MustInherit”.
pt_br: 'New' não pode ser usado em uma classe declarada 'MustInherit'.
ru: '"New" не может использоваться для класса, объявленного как "MustInherit".
tr: 'New', 'MustInherit' olarak bildirilen bir sınıf üzerinde kullanılamaz.
zh_hans: '"New" 不能在声明为 "MustInherit" 的类上使用。
zh_hant: 'New' 不可以使用在宣告為 'MustInherit' 的類別上。

# ERR_DuplicateNamedImportAlias1
source: Alias '{0}' is already declared.
cs: Alias {0} je už deklarovaný.
de: Alias "{0}" wurde bereits deklariert.
es: El alias '{0}' ya se ha declarado.
fr: L'alias '{0}' est déjà déclaré.
it: L'alias '{0}' è già dichiarato.
ja: エイリアス '{0}' は、既に宣言されています。
ko: '{0}' 별칭이 이미 선언되었습니다.
pl: Alias „{0}” jest już zadeklarowany.
pt_br: Alias "{0}" já está declarado.
ru: Псевдоним "{0}" уже объявлен.
tr: '{0}' diğer adı zaten bildirildi.
zh_hans: 已声明别名“{0}”。
zh_hant: 別名 '{0}' 已宣告。

# ERR_DuplicatePrefix
source: XML namespace prefix '{0}' is already declared.
cs: Předpona oboru názvů XML {0} už je deklarovaná.
de: Das XML-Namespacepräfix "{0}" wurde bereits deklariert.
es: El prefijo '{0}' del espacio de nombres XML ya se ha declarado.
fr: Le préfixe de l'espace de noms XML '{0}' est déjà déclaré.
it: Il prefisso dello spazio dei nomi XML '{0}' è già dichiarato.
ja: XML 名前空間プレフィックス '{0}' は既に宣言されています。
ko: XML 네임스페이스 접두사 '{0}'이(가) 이미 선언되었습니다.
pl: Prefiks przestrzeni nazw XML „{0}” jest już zadeklarowany.
pt_br: O prefixo do namespace de XML "{0}" já está declarado.
ru: Префикс пространства имен XML "{0}" уже объявлен.
tr: '{0}' XML ad alanı ön eki zaten bildirildi.
zh_hans: 已声明 XML 命名空间前缀“{0}”。
zh_hant: XML 命名空間前置詞 '{0}' 已宣告。

# ERR_StrictDisallowsLateBinding
source: Option Strict On disallows late binding.
cs: Direktiva Option Strict On nepovoluje pozdní vazbu.
de: "Option Strict On" lässt spätes Binden nicht zu.
es: Option Strict On no permite el enlace en tiempo de ejecución.
fr: Option Strict On rejette toute liaison tardive.
it: Option Strict On non consente l'associazione tardiva.
ja: Option Strict On では、遅延バインディングを使用できません。
ko: Option Strict On에서는 런타임에 바인딩을 사용할 수 없습니다.
pl: Ustawienie Option Strict On uniemożliwia późne wiązanie.
pt_br: A opção Strict On não permite associação tardia.
ru: Оператор "Option Strict On" не разрешает позднее связывание.
tr: Option Strict On geç bağlamaya izin vermez.
zh_hans: Option Strict On 不允许后期绑定。
zh_hant: Option Strict 為 On 時，不可使用晚期繫結。

# ERR_AddressOfOperandNotMethod
source: 'AddressOf' operand must be the name of a method (without parentheses).
cs: 'Operandem AddressOf musí být název metody (bez závorek).
de: 'Der AddressOf-Operand muss dem Namen einer Methode entsprechen (ohne Klammern).
es: 'El operando 'AddressOf' debe ser el nombre de un método (sin paréntesis).
fr: 'L'opérande 'AddressOf' doit être le nom d'une méthode (sans parenthèses).
it: 'L'operando 'AddressOf' deve essere il nome di un metodo, senza parentesi.
ja: 'AddressOf' オペランドはメソッドの名前でなければなりません。かっこは不要です。
ko: 'AddressOf' 피연산자에는 괄호 없이 메서드 이름을 사용해야 합니다.
pl: 'Argument operacji „AddressOf” musi być nazwą metody (bez nawiasów).
pt_br: 'Operador 'AddressOf' deve ser o nome de um método (sem parênteses).
ru: 'Операндом "AddressOf" должно быть имя метода; круглые скобки не требуются.
tr: 'AddressOf' işleneni (ayraçlar olmadan) bir yöntem adı olmalıdır.
zh_hans: '“AddressOf”操作数必须是某个方法的名称(不带圆括号)。
zh_hant: 'AddressOf' 運算元必須是方法名稱 (沒有括號)。

# ERR_EndExternalSource
source: '#End ExternalSource' must be preceded by a matching '#ExternalSource'.
cs: 'Příkazu #End ExternalSource musí předcházet párový příkaz #ExternalSource.
de: '"#End ExternalSource" muss ein entsprechendes "#ExternalSource" voranstehen.
es: '#End ExternalSource' debe ir precedida de la instrucción '#ExternalSource' correspondiente.
fr: '#End ExternalSource' doit être précédé d'un '#ExternalSource' correspondant.
it: '#End ExternalSource' deve essere preceduto da un '#ExternalSource' corrispondente.
ja: '#End ExternalSource' の前には、対応する '#ExternalSource' を指定しなければなりません。
ko: '#End ExternalSource'는 짝이 되는 '#ExternalSource' 뒤에 와야 합니다.
pl: 'Dyrektywa #End ExternalSource musi być poprzedzona odpowiadającą jej dyrektywą #ExternalSource.
pt_br: '#End ExternalSource' deve ser precedido por '#ExternalSource' correspondente.
ru: 'Оператору "#End ExternalSource" должен предшествовать соответствующий оператор "#ExternalSource".
tr: '#End ExternalSource' öncesinde eşleşen bir '#ExternalSource' olmalıdır.
zh_hans: '"#End ExternalSource" 前面必须是匹配的 "#ExternalSource"。
zh_hant: '#End ExternalSource' 之前必須搭配相對應的 '#ExternalSource'。

# ERR_ExpectedEndExternalSource
source: '#ExternalSource' statement must end with a matching '#End ExternalSource'.
cs: 'Příkaz #ExternalSource musí být ukončený párovým příkazem #End ExternalSource.
de: '"#ExternalSource" muss mit einem entsprechenden "#End ExternalSource" abgeschlossen werden.
es: 'La instrucción '#ExternalSource' debe terminar con la instrucción '#End ExternalSource' correspondiente.
fr: 'L'instruction '#ExternalSource' doit se terminer par un '#End ExternalSource' correspondant.
it: 'L'istruzione '#ExternalSource' deve terminare con un elemento '#End ExternalSource' corrispondente.
ja: '#ExternalSource' ステートメントの終わりには、対応する '#End ExternalSource' を指定しなければなりません。
ko: '#ExternalSource' 문은 짝이 되는 '#End ExternalSource'로 끝나야 합니다.
pl: 'Dyrektywa #ExternalSource musi być zakończona odpowiadającą jej dyrektywą #End ExternalSource.
pt_br: 'Instrução '#ExternalSource' deve terminar com um '#End ExternalSource' correspondente.
ru: 'Оператор "#ExternalSource" должен заканчиваться соответствующим оператором "#End ExternalSource".
tr: '#ExternalSource' deyimi eşleşen bir '#End ExternalSource' ile bitmelidir.
zh_hans: '“#ExternalSource”语句必须以匹配的“#End ExternalSource”结束。
zh_hant: '#ExternalSource' 之後必須搭配相對應的 '#End ExternalSource'。

# ERR_NestedExternalSource
source: '#ExternalSource' directives cannot be nested.
cs: 'Direktivy #ExternalSource nejde vnořovat.
de: '#ExternalSource-Direktiven sind nicht schachtelbar.
es: 'Las directivas '#ExternalSource' no se pueden anidar.
fr: 'Les directives '#ExternalSource' ne peuvent pas être imbriquées.
it: 'Le direttive di '#ExternalSource' non possono essere annidate.
ja: '#ExternalSource' ディレクティブは入れ子にできません。
ko: '#ExternalSource' 지시문은 중첩될 수 없습니다.
pl: 'Dyrektywy #ExternalSource nie mogą być zagnieżdżane.
pt_br: 'Diretivas '#ExternalSource' não podem ser aninhadas.
ru: 'Директивы "#ExternalSource" не могут быть вложенными.
tr: '#ExternalSource' yönergeleri iç içe olamaz.
zh_hans: '"#ExternalSource" 指令不能嵌套。
zh_hant: '#ExternalSource' 指示詞不可以是巢狀。

# ERR_AddressOfNotDelegate1
source: 'AddressOf' expression cannot be converted to '{0}' because '{0}' is not a delegate type.
cs: 'Výraz AddressOf nelze převést na typ {0}, protože typ {0} není delegovaný.
de: 'AddressOf-Ausdruck kann nicht in "{0}" konvertiert werden, da "{0}" kein Delegattyp ist.
es: 'La expresión 'AddressOf' no se puede convertir en '{0}' porque '{0}' no es un tipo delegado.
fr: 'Une expression 'AddressOf' ne peut pas être convertie en '{0}', car '{0}' n'est pas un type délégué.
it: 'Non è possibile convertire l'espressione 'AddressOf' in '{0}' perché '{0}' non è un tipo delegato.
ja: '{0}' はデリゲート型でないため、'AddressOf' 式を '{0}' に変換できません。
ko: '{0}'이(가) 대리자 형식이 아니므로 'AddressOf' 식을 '{0}'(으)로 변환할 수 없습니다.
pl: 'Nie można przekonwertować wyrażenia „AddressOf” na typ „{0}”, ponieważ typ „{0}” nie jest typem delegowanym.
pt_br: 'Expressão "AddressOf" não pode ser convertida em "{0}" porque "{0}" não é um tipo delegado.
ru: 'Выражение "AddressOf" нельзя преобразовать в "{0}", поскольку "{0}" не является типом делегата.
tr: '{0}' bir temsilci türü olmadığından 'AddressOf' ifadesi '{0}' türüne dönüştürülemez.
zh_hans: '“AddressOf”表达式无法转换为“{0} ”，因为“{0}”不是委托类型。
zh_hant: '因為 '{0}' 不是委派類型，所以 'AddressOf' 運算式無法轉換成 '{0}'。

# ERR_SyncLockRequiresReferenceType1
source: 'SyncLock' operand cannot be of type '{0}' because '{0}' is not a reference type.
cs: 'Operand SyncLock nemůže být typu {0}, protože typ {0} není typ odkazu.
de: 'Der SyncLock-Operand kann nicht den Typ "{0}" haben, da "{0}" kein Referenztyp ist.
es: 'El operando de 'SyncLock' no puede ser del tipo '{0}' porque '{0}' no es un tipo de referencia.
fr: 'L'opérande 'SyncLock' ne peut pas être de type '{0}', car '{0}' n'est pas un type référence.
it: 'L'operando 'SyncLock' non può essere di tipo {0} perché {0} non è un tipo riferimento.
ja: '{0}' は参照型ではないので、'SyncLock' オペランドを型 '{0}' にすることはできません。
ko: '{0}'이(가) 참조 형식이 아니므로 'SyncLock' 피연산자는 '{0}' 형식일 수 없습니다.
pl: 'Argument operacji „SyncLock” nie może być typu „{0}”, ponieważ „{0}” nie jest typem referencyjnym.
pt_br: 'O operando "SyncLock" não pode ser do tipo "{0}" porque "{0}" não é um tipo de referência.
ru: 'Операнд "SyncLock" не может быть типа "{0}", так как "{0}" не является ссылочным типом.
tr: '{0}' bir başvuru türü olmadığından, 'SyncLock' işleneni '{0}' türünde olamaz.
zh_hans: '"SyncLock" 操作数不能是“{0}”类型，因为“{0}”不是引用类型。
zh_hant: 'SyncLock' 運算元不可是類型 '{0}'，因為 '{0}' 不是參考類型。

# ERR_MethodAlreadyImplemented2
source: '{0}.{1}' cannot be implemented more than once.
cs: '{0}.{1} nejde implementovat víc než jednou.
de: '"{0}.{1}" kann nur einmal implementiert werden.
es: '{0}.{1}' no se puede implementar más de una vez.
fr: '{0}.{1}' ne peut pas être implémenté plus d'une fois.
it: '{0}.{1}' non può essere implementato più di una volta.
ja: '{0}.{1}' を複数実装することはできません。
ko: '{0}.{1}'은(는) 두 번 이상 구현할 수 없습니다.
pl: 'Nie można zaimplementować elementu „{0}.{1}” więcej niż raz.
pt_br: "{0}.{1}" não pode ser implementado mais de uma vez.
ru: "{0}.{1}" невозможно реализовать более одного раза.
tr: '{0}.{1}' bir defadan fazla uygulanamaz.
zh_hans: '“{0}.{1}”不能多次实现。
zh_hant: '{0}.{1}' 只能實作一次。

# ERR_DuplicateInInherits1
source: '{0}' cannot be inherited more than once.
cs: '{0} nejde dědit víc než jednou.
de: '"{0}" kann nicht mehrmals geerbt werden.
es: '{0}' no se puede heredar más de una vez.
fr: '{0}' ne peut pas être hérité plus d'une fois.
it: '{0}' non può essere ereditato più di una volta.
ja: '{0}' を複数回継承することはできません。
ko: '{0}'을(를) 두 번 이상 상속할 수 없습니다.
pl: 'Nie można dziedziczyć elementu „{0}” więcej niż raz.
pt_br: "{0}" não pode ser herdado mais de uma vez.
ru: "{0}" не может наследоваться несколько раз.
tr: '{0}' birden çok kez devralınamaz.
zh_hans: '“{0}”不能被继承多次。
zh_hant: '{0}' 不能繼承一次以上。

# ERR_NamedParamArrayArgument
source: Named argument cannot match a ParamArray parameter.
cs: Pojmenovaný argument nemůže sloužit jako parametr ParamArray.
de: Ein benanntes Argument kann nicht mit einem ParamArray-Parameter übereinstimmen.
es: Un argumento con nombre no puede coincidir con un parámetro ParamArray.
fr: L'argument nommé ne peut pas correspondre à un paramètre ParamArray.
it: L'argomento denominato non può corrispondere a un parametro ParamArray.
ja: 名前付き引数を ParamArray パラメーターに一致させることはできません。
ko: 명명된 인수는 ParamArray 매개 변수와 일치할 수 없습니다.
pl: Nie można dopasować nazwanego argumentu do parametru ParamArray.
pt_br: O argumento nomeado não pode corresponder a um parâmetro ParamArray.
ru: Именованный аргумент не должен соответствовать параметру ParamArray.
tr: Adlandırılmış bağımsız değişken bir ParamArray parametresiyle aynı olamaz.
zh_hans: 命名实参不能匹配 ParamArray 形参。
zh_hant: 具名引數無法符合 ParamArray 參數。

# ERR_OmittedParamArrayArgument
source: Omitted argument cannot match a ParamArray parameter.
cs: Vynechaný argument nemůže sloužit jako parametr ParamArray.
de: Ein ausgelassenes Argument kann nicht mit einem ParamArray-Parameter übereinstimmen.
es: Un argumento omitido no puede coincidir con un parámetro ParamArray.
fr: L'argument omis ne peut pas correspondre à un paramètre ParamArray.
it: L'argomento omesso non può corrispondere a un parametro ParamArray.
ja: 省略された引数を ParamArray パラメーターに一致させることはできません。
ko: 생략된 인수는 ParamArray 매개 변수와 일치할 수 없습니다.
pl: Nie można dopasować pominiętego argumentu do parametru ParamArray.
pt_br: Argumento omitido não pode corresponder a um parâmetro ParamArray.
ru: Пропущенный аргумент не может соответствовать параметру ParamArray.
tr: Atlanmış bağımsız değişken bir ParamArray parametresiyle aynı olamaz.
zh_hans: 省略的实参不能匹配 ParamArray 形参。
zh_hant: 省略的引數無法符合 ParamArray 參數。

# ERR_ParamArrayArgumentMismatch
source: Argument cannot match a ParamArray parameter.
cs: Argument nemůže sloužit jako parametr ParamArray.
de: Ein Argument kann nicht mit einem ParamArray-Parameter übereinstimmen.
es: Un argumento no puede coincidir con un parámetro ParamArray.
fr: L'argument ne peut pas correspondre à un paramètre ParamArray.
it: L'argomento non può corrispondere a un parametro ParamArray.
ja: 引数を ParamArray パラメーターに一致させることはできません。
ko: 인수는 ParamArray 매개 변수와 일치할 수 없습니다.
pl: Argument nie jest zgodny z parametrem ParamArray.
pt_br: O argumento não pode corresponder a um parâmetro ParamArray.
ru: Аргумент не может соответствовать параметру ParamArray.
tr: Bağımsız değişken bir ParamArray parametresiyle aynı olamaz.
zh_hans: 参数不能匹配 ParamArray 参数。
zh_hant: 引數無法符合 ParamArray 參數。

# ERR_EventNotFound1
source: Event '{0}' cannot be found.
cs: Událost {0} se nenašla.
de: Das Ereignis "{0}" wurde nicht gefunden.
es: No se encuentra el evento '{0}'.
fr: L'événement '{0}' est introuvable.
it: L'evento '{0}' non è stato trovato.
ja: イベント '{0}' が見つかりません。
ko: '{0}' 이벤트가 없습니다.
pl: Nie można znaleźć zdarzenia „{0}”.
pt_br: Evento "{0}" não pode ser encontrado.
ru: Не удается найти событие "{0}".
tr: '{0}' olayı bulunamadı.
zh_hans: 找不到事件“{0}”。
zh_hant: 找不到事件 '{0}'。

# ERR_ModuleCantUseVariableSpecifier1
source: Variables in Modules cannot be declared '{0}'.
cs: Pro proměnné v modulu nejde použít deklaraci {0}.
de: Variablen in Modulen können nicht als "{0}" deklariert werden.
es: Las variables de los módulos no se pueden declarar como '{0}'.
fr: Les variables des modules ne peuvent pas être déclarées '{0}'.
it: Le variabili nei moduli non possono essere dichiarate come '{0}'.
ja: モジュールの変数を '{0}' として宣言することはできません。
ko: 모듈의 변수는 '{0}'(으)로 선언할 수 없습니다.
pl: Zmienne w modułach nie mogą być deklarowane jako „{0}”.
pt_br: Variáveis em Módulos não podem ser declaradas "{0}".
ru: Переменные в модулях не могут объявляться как "{0}".
tr: Modül içindeki değişkenler '{0}' olarak bildirilemez.
zh_hans: 模块中的变量不能声明为“{0}”。
zh_hant: Module 中的變數不可宣告為 '{0}'。

# ERR_SharedEventNeedsSharedHandler
source: Events of shared WithEvents variables cannot be handled by non-shared methods.
cs: Události sdílené proměnné WithEvents nejde zpracovat nesdílenými metodami.
de: Ereignisse freigegebener WithEvents-Variablen können nicht von nicht freigegebenen Methoden behandelt werden.
es: Los métodos no compartidos no pueden controlar los eventos de variables WithEvents compartidas.
fr: Les événements des variables WithEvents partagées ne peuvent pas être gérés par des méthodes non partagées.
it: Non è possibile gestire gli eventi delle variabili WithEvents condivise mediante metodi non condivisi.
ja: 共有された WithEvents 変数のイベントを、共有されていないメソッドで処理することはできません。
ko: 비공유 메서드에서는 공유 WithEvents 변수의 이벤트를 처리할 수 없습니다.
pl: Zdarzenia udostępnionych zmiennych WithEvents nie mogą zostać obsłużone przez metody nieudostępnione.
pt_br: Eventos de variáveis WithEvents compartilhadas não podem ser tratados por métodos não compartilhados.
ru: События из общих переменных "WithEvents" не могут обрабатываться методами, не являющимися общими.
tr: Paylaşılan WithEvents değişkenlerinin olayları paylaşılmayan yöntemler tarafından işlenemez.
zh_hans: 共享 WithEvents 变量的事件不能由非共享方法处理。
zh_hant: 共用 WithEvents 變數的事件不能由非共用的方法處理。

# ERR_ExpectedMinus
source: '-' expected.
cs: 'Očekával se znak -.
de: '"-" erwartet.
es: 'Se esperaba '-'.
fr: '-' attendu.
it: 'È previsto il segno '-'.
ja: '-' が必要です。
ko: '-'가 필요합니다.
pl: 'Oczekiwano znaku „-”.
pt_br: '-' esperado.
ru: 'Требуется "-".
tr: '-' bekleniyor.
zh_hans: '应为“-”。
zh_hant: '必須有 '-'。

# ERR_InterfaceMemberSyntax
source: Interface members must be methods, properties, events, or type definitions.
cs: Členy rozhraní musí být metody, vlastnosti, události nebo definice typů.
de: Schnittstellenmember müssen Methoden, Eigenschaften, Ereignisse oder Typdefinitionen sein.
es: Los miembros de interfaz deben ser métodos, propiedades, eventos o definiciones de tipo.
fr: Les membres d'interface doivent être des méthodes, des propriétés, des événements ou des définitions de types.
it: I membri di interfaccia devono essere metodi, proprietà, eventi o definizioni di tipi.
ja: インターフェイス メンバーは、メソッド、プロパティ、イベント、または型定義でなければなりません。
ko: 인터페이스 멤버는 메서드, 속성, 이벤트 또는 형식 정의여야 합니다.
pl: Składowe interfejsu muszą być metodami, właściwościami, zdarzeniami lub definicjami typów.
pt_br: Membros de interface devem ser métodos, propriedades, eventos, ou definições de tipo.
ru: Членами интерфейса могут быть только методы, свойства, события и определения типов.
tr: Arabirim üyeleri yöntem, özellik, olay veya tür tanımı olmalıdır.
zh_hans: 接口成员必须是方法、属性、事件或类型定义。
zh_hant: 介面成員必須是方法、屬性、事件或類型定義。

# ERR_InvInsideInterface
source: Statement cannot appear within an interface body.
cs: Příkaz se nemůže objevit v těle rozhraní.
de: Die Anweisung kann nicht innerhalb des Schnittstellentexts verwendet werden.
es: La instrucción no puede aparecer dentro del cuerpo de una interfaz.
fr: L'instruction ne peut pas apparaître dans le corps d'une interface.
it: L'istruzione non può essere specificata all'interno di un corpo di interfaccia.
ja: ステートメントをインターフェイス本体内部に記述することはできません。
ko: 인터페이스 본문 안에는 문을 사용할 수 없습니다.
pl: Instrukcja nie może wystąpić w treści interfejsu.
pt_br: A instrução não pode aparecer dentro do corpo de uma interface.
ru: Оператор не может присутствовать в теле интерфейса.
tr: Arabirim gövdesi içinde deyim yer alamaz.
zh_hans: 语句不能出现在接口体内。
zh_hant: 陳述式不能出現在介面主體內。
