Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_VBCHelp
source: Visual Basic Compiler Options - OUTPUT FILE - -out:<file> Specifies the output file name. -target:exe Create a console application (default). (Short form: -t) -target:winexe Create a Windows application. -target:library Create a library assembly. -target:module Create a module that can be added to an assembly. -target:appcontainerexe Create a Windows application that runs in AppContainer. -target:winmdobj Create a Windows Metadata intermediate file -doc[+|-] Generates XML documentation file. -doc:<file> Generates XML documentation file to <file>. -refout:<file> Reference assembly output to generate - INPUT FILES - -addmodule:<file_list> Reference metadata from the specified modules -link:<file_list> Embed metadata from the specified interop assembly. (Short form: -l) -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications. -reference:<file_list> Reference metadata from the specified assembly. (Short form: -r) -analyzer:<file_list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. - RESOURCES - -linkresource:<resinfo> Links the specified file as an external assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -linkres) -nowin32manifest The default manifest should not be embedded in the manifest section of the output PE. -resource:<resinfo> Adds the specified file as an embedded assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -res) -win32icon:<file> Specifies a Win32 icon file (.ico) for the default Win32 resources. -win32manifest:<file> The provided file is embedded in the manifest section of the output PE. -win32resource:<file> Specifies a Win32 resource file (.res). - CODE GENERATION - -optimize[+|-] Enable optimizations. -removeintchecks[+|-] Remove integer checks. Default off. -debug[+|-] Emit debugging information. -debug:full Emit full debugging information (default). -debug:pdbonly Emit full debugging information. -debug:portable Emit cross-platform debugging information. -debug:embedded Emit cross-platform debugging information into the target .dll or .exe. -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -nowarn Disable all warnings. -nowarn:<number_list> Disable a list of individual warnings. -warnaserror[+|-] Treat all warnings as errors. -warnaserror[+|-]:<number_list> Treat a list of warnings as errors. -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file> Specify a file to log all compiler and analyzer diagnostics. -reportanalyzer Report additional analyzer information, such as execution time. - LANGUAGE - -define:<symbol_list> Declare global conditional compilation symbol(s). symbol_list:name=value,... (Short form: -d) -imports:<import_list> Declare global Imports for namespaces in referenced metadata files. import_list:namespace,... -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `default` (latest major version), or `latest` (latest version, including minor versions), or specific versions like `14` or `15.3` -optionexplicit[+|-] Require explicit declaration of variables. -optioninfer[+|-] Allow type inference of variables. -rootnamespace:<string> Specifies the root Namespace for all type declarations. -optionstrict[+|-] Enforce strict language semantics. -optionstrict:custom Warn when strict language semantics are not respected. -optioncompare:binary Specifies binary-style string comparisons. This is the default. -optioncompare:text Specifies text-style string comparisons. - MISCELLANEOUS - -help Display this usage message. (Short form: -?) -noconfig Do not auto-include VBC.RSP file. -nologo Do not display compiler copyright banner. -quiet Quiet output mode. -verbose Display verbose messages. -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<number> The base address for a library or module (hex). -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<number> Specifies the codepage to use when opening source files. -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key. -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key. -errorreport:<string> Specifies how to handle internal compiler errors; must be prompt, send, none, or queue (default). -filealign:<number> Specify the alignment used for output file sections. -highentropyva[+|-] Enable high-entropy ASLR. -keycontainer:<string> Specifies a strong name key container. -keyfile:<file> Specifies a strong name key file. -libpath:<path_list> List of directories to search for metadata references. (Semi-colon delimited.) -main:<class> Specifies the Class or Module that contains Sub Main. It can also be a Class that inherits from System.Windows.Forms.Form. (Short form: -m) -moduleassemblyname:<string> Name of the assembly which this module will be a part of. -netcf Target the .NET Compact Framework. -nostdlib Do not reference standard libraries (system.dll and VBC.RSP file). -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -platform:<string> Limit which platforms this code can run on; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred or anycpu (default). -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -sdkpath:<path> Location of the .NET Framework SDK directory (mscorlib.dll). -subsystemversion:<version> Specify subsystem version of the output PE. version:<number>[.<number>] -utf8output[+|-] Emit compiler output in UTF8 character encoding. @<file> Insert command-line settings from a text file -vbruntime[+|-|*] Compile with/without the default Visual Basic runtime. -vbruntime:<file> Compile with the alternate Visual Basic runtime in <file>.
fr: Options du compilateur Visual Basic - FICHIER DE SORTIE - -out:<fichier> Spécifie le nom du fichier de sortie. -target:exe Créer une application console (par défaut). (Forme abrégée : -t) -target:winexe Créer une application Windows. -target:library Créer un assembly de bibliothèque. -target:module Créer un module qui peut être ajouté à un assembly. -target:appcontainerexe Créer une application Windows qui s'exécute dans AppContainer. -target:winmdobj Créer un fichier intermédiaire de métadonnées Windows -doc[+|-] Génère un fichier de documentation XML. -doc:<fichier> Génère un fichier de documentation XML dans <fichier>. -refout:<fichier> Référencer la sortie d'assembly à générer - FICHIERS D'ENTRÉE - -addmodule:<liste_fichiers> Référencer les métadonnées à partir des modules spécifiés -link:<liste_fichiers> Incorporer les métadonnées à partir de l'assembly d'interopérabilité spécifié. (Forme abrégée : -l) -recurse:<générique> Inclure tous les fichiers dans le répertoire et les sous-répertoires actifs en fonction des spécifications des caractères génériques. -reference:<liste_fichiers> Référencer les métadonnées à partir de l'assembly spécifié. (Forme abrégée : -r) -analyzer:<liste_fichiers> Exécuter les analyseurs à partir de cet assembly (Forme abrégée : -a) -additionalfile:<liste_fich.> Fichiers supplémentaires qui n'affectent pas directement la génération de code mais qui peuvent être utilisés par les analyseurs pour produire des erreurs ou des avertissements. - RESSOURCES - -linkresource:<resinfo> Lie le fichier spécifié sous forme de ressource d'assembly externe. resinfo:<fichier>[,<nom>[,public|private]] (Forme abrégée : -linkres) -nowin32manifest Le manifeste par défaut ne doit pas être incorporé dans la section manifest du PE de sortie. -resource:<resinfo> Ajoute le fichier spécifié en tant que ressource d'assembly incorporée. resinfo:<fichier>[,<nom>[,public|private]] (Forme abrégée : -res) -win32icon:<fichier> Spécifie un fichier icône Win32 (.ico) pour les ressources Win32 par défaut. -win32manifest:<fichier> Le fichier fourni est incorporé dans la section manifest du PE de sortie. -win32resource:<fichier> Spécifie un fichier de ressources Win32 (.res). - GÉNÉRATION DE CODE - -optimize[+|-] Activer les optimisations. -removeintchecks[+|-] Supprimer les contrôles sur les entiers. La valeur par défaut est off. -debug[+|-] Émettre des informations de débogage. -debug:full Émettre des informations de débogage complètes (par défaut). -debug:pdbonly Émettre des informations de débogage complètes. -debug:portable Émettre des informations de débogage multiplateformes. -debug:embedded Émettre des informations de débogage multiplateformes dans le fichier .dll ou .exe cible. -deterministic Produire un assembly déterministe (en incluant le GUID et l'horodatage de la version du module) -refonly Produire un assembly de référence à la place de la sortie principale -instrument:TestCoverage Produire un assembly instrumenté pour collecter les informations de couverture -sourcelink:<fichier> Informations du lien source à incorporer dans le fichier PDB. - ERREURS ET AVERTISSEMENTS - -nowarn Désactiver tous les avertissements. -nowarn:<liste_numéros> Désactiver une liste d'avertissements individuels. -warnaserror[+|-] Traiter tous les avertissements comme des erreurs. -warnaserror[+|-]:<liste_numéros> Traiter une liste d'avertissements comme des erreurs. -ruleset:<fichier> Spécifier un fichier ruleset qui désactive des diagnostics spécifiques. -errorlog:<fichier> Spécifier un fichier pour journaliser tous les diagnostics du compilateur et de l'analyseur. -reportanalyzer Signaler des informations supplémentaires sur l'analyseur, comme la durée d'exécution. - LANGAGE - -define:<liste_symboles> Déclarer des symboles de compilation conditionnelle globale. liste_symboles:name=value,... (Forme abrégée : -d) -imports:<liste_importations> Déclarer des importations globales pour les espaces de noms dans les fichiers de métadonnées référencés. liste_importations:namespace,... -langversion:? Afficher les valeurs autorisées pour la version du langage -langversion:<chaîne> Spécifier la version du langage, par exemple 'default' (dernière version principale) ou 'latest' (dernière version, en incluant les versions mineures), ou des versions spécifiques comme '14' ou '15.3' -optionexplicit[+|-] Imposer une déclaration explicite des variables. -optioninfer[+|-] Autoriser l'inférence de type des variables. -rootnamespace:<chaîne> Spécifie l'espace de noms racine pour toutes les déclarations de type. -optionstrict[+|-] Appliquer une sémantique stricte du langage. -optionstrict:custom Avertir quand la sémantique stricte du langage n'est pas respectée. -optioncompare:binary Spécifie des comparaisons de chaînes de style binaire. Il s'agit de la valeur par défaut. -optioncompare:text Spécifie des comparaisons de chaînes de style texte. - DIVERS - -help Afficher ce message d'utilisation. (Forme abrégée : -?) -noconfig Ne pas inclure automatiquement un fichier VBC.RSP. -nologo Ne pas afficher la bannière de copyright du compilateur. -quiet Mode de sortie silencieux. -verbose Afficher des messages documentés. -parallel[+|-] Build simultanée. -version Afficher le numéro de version du compilateur et quitter le processus. - AVANCÉ - -baseaddress:<numéro> Adresse de base d'une bibliothèque ou d'un module (hex). -checksumalgorithm:<alg> Spécifier l'algorithme de calcul de la somme de contrôle de fichier source stockée dans le fichier PDB. Valeurs prises en charge : SHA1 ou SHA256 (par défaut). -codepage:<numéro> Spécifie la page de codes à utiliser à l'ouverture des fichiers sources. -delaysign[+|-] Différer la signature de l'assembly en utilisant uniquement la partie publique de la clé de nom fort. -publicsign[+|-] Signer publiquement l'assembly en utilisant uniquement la partie publique de la clé de nom fort. -errorreport:<chaîne> Spécifie comment prendre en charge les erreurs internes du compilateur ; doit avoir la valeur prompt, send, none ou queue (par défaut). -filealign:<numéro> Spécifier l'alignement utilisé pour les sections du fichier de sortie. -highentropyva[+|-] Activer la randomisation du format d'espace d'adresse d'entropie élevée. -keycontainer:<chaîne> Spécifie un conteneur de clé de nom fort. -keyfile:<fichier> Spécifie un fichier de clé de nom fort. -libpath:<liste_chemins> Liste de répertoires où rechercher des références de métadonnées. (Valeurs délimitées par des points-virgules.) -main:<classe> Spécifie la classe ou le module qui contient Sub Main. Il peut également s'agir d'une classe qui hérite de System.Windows.Forms.Form. (Forme abrégée : -m) -moduleassemblyname:<chaîne> Nom de l'assembly dont ce module doit faire partie. -netcf Cibler le .NET Compact Framework. -nostdlib Ne pas référencer les bibliothèques standard (fichiers system.dll et VBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Spécifier un mappage pour les noms de chemins sources sortis par le compilateur. -platform:<chaîne> Limiter les plateformes sur lesquelles ce code peut s'exécuter ; doit correspondre à x86, x64, Itanium, arm, arm64, AnyCPU32BitPreferred ou anycpu (par défaut). -preferreduilang Spécifier le nom du langage de sortie préféré. -nosdkpath Désactiver la recherche dans le chemin du SDK par défaut pour trouver des assemblys de bibliothèques standard. -sdkpath:<chemin> Emplacement du répertoire du SDK .NET Framework (mscorlib.dll). -subsystemversion:<version> Spécifier la version du sous-système du PE de sortie. version:<numéro>[.<numéro>] -utf8output[+|-] Émettre la sortie du compilateur au format d'encodage de caractères UTF8. @<fichier> Insérer les paramètres de ligne de commande à partir d'un fichier texte -vbruntime[+|-|*] Compiler avec/sans le runtime Visual Basic par défaut. -vbruntime:<fichier> Compiler avec le runtime Visual Basic de remplacement dans <fichier>.

# ERR_ModuleEmitFailure
source: Failed to emit module '{0}'.
fr: Échec de l'émission du module '{0}'.
