Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidFormatSpecifier
source: '{0}' is not a valid format specifier
cs: '{0} není platným specifikátorem formátu.
de: '"{0}" ist kein gültiger Formatbezeichner.
es: '{0}' no es un especificador de formato válido
fr: '{0}' n'est pas un spécificateur de format valide
it: '{0}' non è un identificatore di formato valido
ja: '{0}' は有効な形式指定子ではありません
ko: '{0}'은(는) 유효한 서식 지정자가 아닙니다.
pl: „{0}” nie jest prawidłowym specyfikatorem formatu
pt_br: "{0}" não é um especificador de formato válido
ru: "{0}" не является допустимым описателем формата.
tr: '{0}' geçerli bir biçim belirtici değil
zh_hans: '“{0}”不是有效的格式说明符
zh_hant: '{0}' 不是有效的格式規範

# ERR_InvalidPreprocessorConstantType
source: Preprocessor constant '{0}' of type '{1}' is not supported, only primitive types are allowed.
cs: Konstanta preprocesoru {0} typu {1} se nepodporuje. Povolené jsou jenom primitivní typy.
de: Die Präprozessorkonstante "{0}" vom Typ "{1}" wird nicht unterstützt; nur primitive Typen sind zulässig.
es: No se admite la constante de preprocesador "{0}" de tipo "{1}"; solo se permiten los tipos primitivos.
fr: La constante de préprocesseur '{0}' de type '{1}' n'est pas prise en charge, seuls les types primitifs sont autorisés.
it: La costante '{0}' del preprocessore di tipo '{1}' non è supportata. Sono supportati solo i tipi primitivi.
ja: 型 '{1}' のプリプロセッサ定数 '{0}' はサポートされていません。プリミティブ型のみを使用できます。
ko: '{1}' 형식의 전처리기 상수 '{0}'은(는) 지원되지 않습니다. 기본 형식만 허용됩니다.
pl: Stała preprocesora „{0}” typu „{1}” nie jest obsługiwana. Dozwolone są tylko typy pierwotne.
pt_br: Não há suporte para a constante de pré-processador '{0}' do tipo '{1}', somente os tipos primitivos são permitidos.
ru: Константа препроцессора "{0}" типа "{1}" не поддерживается, допускаются только примитивные типы.
tr: '{1}' türündeki '{0}' ön işlemci sabiti desteklenmiyor; yalnızca temel türlere izin verilir.
zh_hans: 不支持“{1}”类型的预处理器常数“{0}”，仅允许使用基元类型。
zh_hant: 不支援類型為 '{1}' 的前置處理器常數 '{0}'，只可使用基本類型。

# ERR_ExpectedWarningKeyword
source: 'Warning' expected.
cs: 'Očekával se výraz Warning.
de: '"Warning" erwartet.
es: 'Se esperaba 'Warning'.
fr: 'Warning' attendu.
it: 'È previsto 'Warning'.
ja: 'Warning' が必要です。
ko: 'Warning'이 필요합니다.
pl: 'Oczekiwano elementu „Warning”.
pt_br: "Aviso" esperado.
ru: 'Требуется "Warning".
tr: 'Warning' bekleniyor.
zh_hans: '应为“Warning”。
zh_hant: '必須是 'Warning'。

# ERR_CannotBeMadeNullable1
source: '{0}' cannot be made nullable.
cs: '{0} nejde nastavit tak, aby se povolovala hodnota null.
de: '"{0}" kann keine NULL-Werte zulassen.
es: 'No se puede hacer que '{0}' acepte valores NULL.
fr: '{0}' ne peut pas être null.
it: '{0}' non può essere reso nullable.
ja: '{0}' は null 許容にすることはできません。
ko: '{0}'은(는) nullable이 될 수 없습니다.
pl: 'Nie można ustawić elementu „{0}” jako dopuszczającego wartość null.
pt_br: '{0}' não pode ser tornado anulável.
ru: "{0}" не может быть стать параметром, допускающим NULL.
tr: '{0}' öğesine null değer alma özelliği verilemiyor.
zh_hans: '“{0}”不可以为 Null。
zh_hant: '{0}' 不可為 Null。

# ERR_BadConditionalWithRef
source: Leading '?' can only appear inside a 'With' statement, but not inside an object member initializer.
cs: Úvodní operátor ? se dá použít jenom uvnitř příkazu With, ale ne uvnitř inicializátorů členů objektů.
de: Führendes "?" kann nur in einer "With"-Anweisung auftreten, jedoch nicht in einem Objektmemberinitialsierer.
es: El símbolo '?' inicial solo puede aparecer dentro de una instrucción 'With', no dentro de un inicializador de miembro de objeto.
fr: Un '?' de début ne peut s'afficher que dans une instruction 'With', et pas dans un initialiseur de membre d'objet.
it: Il carattere '?' iniziale può essere specificato solo all'interno di un'istruzione 'With', ma non in un inizializzatore di membri di oggetto.
ja: 先頭の '?' は、オブジェクト メンバーの初期化子の内部ではなく 'With' ステートメント内でのみ表示できます。
ko: 선행 '?'는 'With' 문 내에만 나타날 수 있고 개체 멤버 이니셜라이저 내에는 나타날 수 없습니다.
pl: Wiodący znak „?” może występować tylko w instrukcji „With”. Nie może występować w inicjatorze składowej obiektu.
pt_br: O sinal "?" inicial só pode aparecer dentro de uma instrução "Com", mas não dentro de um inicializador de membro do objeto.
ru: Символ "?" в начале может находиться только внутри оператора "With", но не внутри инициализатора участников объекта.
tr: Baştaki '?' yalnızca bir 'With' ifadesinde olabilir. Bir nesne üyesi başlatıcısında olamaz.
zh_hans: 以 "?" 开头的情况只能出现在“With”语句中，不能出现在对象成员初始值设定项中。
zh_hant: 前置的 '?' 只可出現在 'With' 陳述式中，但不能出現在物件成員初始設定式。

# ERR_NullPropagatingOpInExpressionTree
source: A null propagating operator cannot be converted into an expression tree.
cs: Operátor šířící null nejde převést na strom výrazu.
de: Ein Operator, der NULL weitergibt, kann nicht in einen Ausdrucksbaum konvertiert werden.
es: No se puede convertir un operador que propague el valor en un árbol de expresión.
fr: Impossible de convertir un opérateur de propagation null en une arborescence d'expression.
it: Non è possibile convertire un operatore di propagazione Null in un albero delle espressioni.
ja: null を伝達する演算子を式のツリーに変換することはできません。
ko: null 전파 연산자는 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować operatora propagowania wartości null na drzewo wyrażenia.
pt_br: Um operador de propagação nulo não pode ser convertido em uma árvore de expressão.
ru: Распространяющий NULL оператор невозможно преобразовать в дерево выражения.
tr: Null bir yayılma işleci bir ifade ağacına dönüştürülemiyor.
zh_hans: 无法将 null 传播运算符转换为表达式树。
zh_hant: Null 散佈運算子無法轉換為運算式樹狀結構。

# ERR_TooLongOrComplexExpression
source: An expression is too long or complex to compile
cs: Výraz je pro zkompilování moc dlouhý nebo složitý.
de: Ein Ausdruck ist zu lang oder zu komplex für eine Kompilierung.
es: Una expresión es demasiado larga o compleja para compilarla
fr: Une expression est trop longue ou complexe à compiler
it: Espressione troppo lunga o complessa per essere compilata
ja: 式が長すぎるか複雑すぎるため、コンパイルできません
ko: 식이 너무 길거나 복잡하여 컴파일할 수 없습니다.
pl: Wyrażenie jest zbyt długie lub zbyt złożone do skompilowania
pt_br: Uma expressão é muito longa ou complexa para ser compilada
ru: Выражение слишком длинное или сложное для компиляции
tr: İfade, derlemek için çok uzun veya çok karmaşık
zh_hans: 表达式太长或者过于复杂，无法编译
zh_hant: 運算式太長或太複雜，造成編譯困難

# ERR_ExpressionDoesntHaveName
source: This expression does not have a name.
cs: Tento výraz není pojmenovaný.
de: Dieser Ausdruck hat keinen Namen.
es: Esta expresión no tiene nombre.
fr: Cette expression n'a pas de nom.
it: Questa espressione non ha un nome.
ja: この式には名前がありません。
ko: 이 식에는 이름이 없습니다.
pl: To wyrażenie nie ma nazwy.
pt_br: Esta expressão não tem um nome.
ru: Выражение не имеет имени.
tr: Bu ifade bir ada sahip değil.
zh_hans: 该表达式不具有名称。
zh_hant: 此運算式沒有名稱。

# ERR_InvalidNameOfSubExpression
source: This sub-expression cannot be used inside NameOf argument.
cs: Tento dílčí výraz se nedá použít uvnitř argumentu NameOf.
de: Dieser Unterausdruck darf nicht in einem "NameOf"-Argument verwendet werden.
es: Esta subexpresión no se puede usar dentro del argumento NameOf.
fr: Cette sous-expression ne peut pas être utilisée dans un argument NameOf.
it: Non è possibile usare questa espressione secondaria all'interno dell'argomento NameOf.
ja: このサブ式は、NameOf 引数の中では使用できません。
ko: 이 부분식은 NameOf 인수 내부에서 사용할 수 없습니다.
pl: Nie można użyć tego podwyrażenia wewnątrz argumentu NameOf.
pt_br: Essa subexpressão não pode ser usada dentro do argumento NameOf.
ru: Невозможно использовать подвыражение в аргументе NameOf.
tr: Bu alt ifade NameOf bağımsız değişkeni içinde kullanılamaz.
zh_hans: 此子表达式不能在 NameOf 参数中使用。
zh_hant: NameOf 引數中不可使用這個子運算式。

# ERR_MethodTypeArgsUnexpected
source: Method type arguments unexpected.
cs: Neočekávané argumenty typu metody
de: Unerwartete Methodentypargumente.
es: Argumentos de tipo de método inesperados.
fr: Arguments de type de méthode inattendus.
it: Argomenti del tipo di metodo imprevisti.
ja: メソッド型の引数は無効です。
ko: 예기치 않은 메서드 형식 인수입니다.
pl: Nieoczekiwane argumenty typu metody.
pt_br: Argumentos de tipo do método inesperados.
ru: Неожиданные аргументы типа метода.
tr: Metodun tür bağımsız değişkenleri beklenmiyor.
zh_hans: 意外的方法类型参数。
zh_hant: 未預期的方法類型引數。

# NoNoneSearchCriteria
source: SearchCriteria is expected.
cs: Očekává se třída SearchCriteria.
de: SearchCriteria wird erwartet.
es: Se espera SearchCriteria.
fr: SearchCriteria est attendu.
it: È previsto SearchCriteria.
ja: SearchCriteria が必要です。
ko: SearchCriteria가 필요합니다.
pl: Oczekiwano elementu SearchCriteria.
pt_br: SearchCriteria é esperado.
ru: Ожидается SearchCriteria.
tr: SearchCriteria bekleniyor.
zh_hans: 需要 SearchCriteria。
zh_hant: 必須是 SearchCriteria。

# ERR_InvalidAssemblyCulture
source: Assembly culture strings may not contain embedded NUL characters.
cs: Řetězce jazykové verze sestavení nesmí obsahovat vložené znaky NUL.
de: Assemblykultur-Zeichenfolgen dürfen keine eingebetteten NUL-Zeichen enthalten.
es: Las cadenas de referencia cultural de ensamblado no pueden contener caracteres NULL incrustados.
fr: Les chaînes de culture d'assembly ne peuvent pas contenir de caractères null incorporés.
it: Le stringhe delle impostazioni cultura dell'assembly potrebbero non contenere caratteri NUL incorporati.
ja: アセンブリ カルチャ文字列に埋め込み NUL 文字を含めることはできません。
ko: 어셈블리 문화권 문자열에는 포함된 NUL 문자가 포함되지 않을 수 있습니다.
pl: Ciągi kultury zestawu nie mogą zawierać osadzonych znaków NUL.
pt_br: As cadeias de caracteres de cultura de assembly podem não conter caracteres NUL incorporados.
ru: Строки языка и региональных параметров сборки могут не содержать встроенных символов NULL.
tr: Derleme kültürü dizeleri gömülü NUL karakterler içeremez.
zh_hans: 程序集区域性字符串可能不包含嵌入式 NUL 字符。
zh_hant: 組件文化特性字串可能不包含內嵌的 NUL 字元。

# ERR_InReferencedAssembly
source: There is an error in a referenced assembly '{0}'.
cs: V odkazovaném sestavení {0} je chyba.
de: In einer referenzierten Assembly '{0}' liegt ein Fehler vor.
es: Hay un error en un ensamblado al que se hace referencia: '{0}'.
fr: Il existe une erreur dans un assembly référencé '{0}'.
it: Un assembly di riferimento '{0}' contiene un errore.
ja: 参照アセンブリ '{0}' にエラーがあります。
ko: 참조되는 어셈블리 '{0}'에 오류가 있습니다.
pl: Wystąpił błąd w przywoływanym zestawie „{0}”.
pt_br: Há um erro em um assembly referenciado '{0}'.
ru: Ошибка в связанной сборке "{0}".
tr: Başvurulan derleme '{0}' içinde bir hata var.
zh_hans: 引用的程序集“{0}”中有错误。
zh_hant: 參考組件 '{0}' 中有錯誤。

# ERR_InterpolationFormatWhitespace
source: Format specifier may not contain trailing whitespace.
cs: Specifikátor formátu nesmí mít na začátku prázdný znak.
de: Der Formatbezeichner darf kein nachstehendes Leerzeichen enthalten.
es: El especificador de formato no puede contener un espacio en blanco al final.
fr: Le spécificateur de format ne peut pas contenir d’espaces blancs de fin.
it: L'identificatore di formato non può contenere uno spazio vuoto finale.
ja: 書式指定子の末尾に、空白を含めることはできません。
ko: 서식 지정자에는 후행 공백이 포함될 수 없습니다.
pl: Specyfikator formatu nie może kończyć się znakiem odstępu.
pt_br: O especificador de formato não pode conter espaço em branco à direita.
ru: Указатель формата может не содержать пробел в конце.
tr: Biçim belirticisinin sonunda boşluk karakteri olamaz.
zh_hans: 格式说明符可能不包含尾随空格。
zh_hant: 格式指定器尾端不得有空格。

# ERR_InterpolationAlignmentOutOfRange
source: Alignment value is outside of the supported range.
cs: Hodnota zarovnání je mimo podporovaný rozsah.
de: Ausrichtungswert ist außerhalb des unterstützten Bereichs.
es: El valor de alineación se encuentra fuera del rango admitido.
fr: La valeur de l'alignement est en dehors de la plage prise en charge.
it: Il valore dell'allineamento non è compreso nell'intervallo supportato.
ja: 配置の値がサポートされている範囲外です。
ko: 맞춤 값이 지원되는 범위를 벗어납니다.
pl: Wartość wyrównania przypada poza obsługiwanym zakresem.
pt_br: O valor de alinhamento está fora do intervalo com suporte.
ru: Значение выравнивания находится вне диапазона поддерживаемых значений.
tr: Hizalama değeri desteklenen aralığın dışında.
zh_hans: 对齐值不在支持的范围内。
zh_hant: 對齊值超出支援的範圍。

# ERR_InterpolatedStringFactoryError
source: There were one or more errors emitting a call to {0}.{1}. Method or its return type may be missing or malformed.
cs: Došlo k jedné nebo víc chybám při generování volání do {0}.{1}. Metoda nebo její návratový typ možná chybí nebo nemá správný formát.
de: Mindestens ein Fehler bei der Ausgabe eines Aufrufs an {0}.{1}. Die Methode oder ihr Rückgabetyp fehlt oder ist falsch formatiert.
es: Uno o varios errores emitieron una llamada a {0}.{1}. Es posible que falte el método o su tipo de retorno, o que el formato no sea correcto.
fr: Une ou plusieurs erreurs se sont produites lors de l'émission de l'appel à {0}.{1}. La méthode ou son type de retour peuvent être manquants ou incorrects.
it: Si sono verificati uno o più errori durante la creazione di una chiamata a {0}.{1}. Il metodo o il relativo tipo restituito potrebbe essere mancante oppure non essere formattato correttamente.
ja: {0}.{1} への呼び出しの生成中に 1 つ以上のエラーが発生しました。メソッドまたはその戻り値の型が不足しているか正しくない可能性があります。
ko: {0}.{1}에 대한 호출을 내보내는 동안 하나 이상의 오류가 발생했습니다. 메서드 또는 반환 형식이 없거나 잘못되었을 수 있습니다.
pl: Wystąpił co najmniej jeden błąd podczas emitowania wywołania do elementu {0}.{1}. Brak metody lub jej typu zwracanego bądź zostały one źle sformułowane.
pt_br: Um ou mais erros ao emitir uma chamada para {0}.{1}. O método ou seu tipo de retorno pode estar ausente ou malformado.
ru: Возникла одна или несколько ошибок при создании вызова к {0}.{1}. Метод или его тип возвращаемых данных может быть не задан или неправильно сформирован.
tr: Bir çağrıyı {0}.{1} öğesine yayarken bir veya daha fazla hata oluştu. Metot veya dönüş türü eksik ya da hatalı biçimlendirilmiş olabilir.
zh_hans: 向 {0}.{1} 发出调用时出现一个或多个错误。方法或其返回类型可能缺失或格式不正确。
zh_hant: 對 {0}.{1} 發出呼叫時發生一或多項錯誤。方法或其傳回類型可能遺漏或格式錯誤。

# HDN_UnusedImportClause_Title
source: Unused import clause
cs: Nepoužívaná klauzule importu
de: Nicht verwendete Import-Klausel
es: Cláusula de importación sin usar
fr: Clause import inutilisée
it: Clausola import non usata
ja: 未使用のインポート句です
ko: 사용하지 않는 import 절
pl: Nieużywana klauzula importu
pt_br: Cláusula de importação não usada
ru: Неиспользуемое предложение import
tr: Kullanılmayan import yan tümcesi
zh_hans: 未使用 import 子句
zh_hant: 未使用的匯入子句

# HDN_UnusedImportStatement_Title
source: Unused import statement
cs: Nepoužívaný příkaz importu
de: Nicht verwendete Import-Anweisung
es: Instrucción de importación sin usar
fr: Instruction import inutilisée
it: Istruzione import non usata
ja: 未使用の import ステートメントです
ko: 사용하지 않는 import 문
pl: Nieużywana instrukcja importu
pt_br: Instrução de importação não usada
ru: Неиспользуемый оператор import
tr: Kullanılmayan import deyimi
zh_hans: 未使用 import 语句
zh_hant: 未使用的匯入陳述式

# ERR_ConstantStringTooLong
source: Length of String constant resulting from concatenation exceeds System.Int32.MaxValue. Try splitting the string into multiple constants.
cs: Délka konstanty String, která je výsledkem zřetězení, překračuje hodnotu System.Int32.MaxValue. Zkuste rozdělit řetězec na více konstant.
de: Die Länge der aus der Verkettung resultierenden Zeichenfolgenkonstante überschreitet System.Int32.MaxValue. Teilen Sie die Zeichenfolge in mehrere Konstanten auf.
es: La longitud de la constante de cadena resultante de la concatenación supera el valor System.Int32.MaxValue. Pruebe a dividir la cadena en varias constantes.
fr: La longueur de la constante de chaîne dépasse la limite de mémoire actuelle. Essayez de fractionner la chaîne en plusieurs constantes.
it: La lunghezza della costante di stringa risultante dalla concatenazione supera il valore di System.Int32.MaxValue. Provare a dividere la stringa in più costanti.
ja: 連結の結果による文字列定数の長さが、System.Int32.MaxValue を超えています。文字列を複数の定数に分割してみてください。
ko: 연결에서 생성된 문자열 상수의 길이가 System.Int32.MaxValue를 초과합니다. 문자열을 여러 상수로 분할해 보세요.
pl: Długość stałej typu String w wyniku łączenia przekracza wartość System.Int32.MaxValue. Spróbuj podzielić ciąg na wiele stałych.
pt_br: O comprimento da Constante de cadeia de caracteres resultante da concatenação excede o System.Int32.MaxValue. Tente dividir a cadeia de caracteres em várias constantes.
ru: Длина строковой константы, полученной в результате объединения, превышает значение System.Int32.MaxValue. Попробуйте разделить строку на несколько констант.
tr: Birleştirmeden kaynaklanan Dize sabitinin uzunluğu System.Int32.MaxValue değerini aşıyor. Dizeyi birden çok sabit olacak şekilde bölmeyi deneyin.
zh_hans: 由串联所得的字符串常量长度超过了 System.Int32.MaxValue。请尝试将字符串拆分为多个常量。
zh_hant: 從串連產生的字串常數長度超過 System.Int32.MaxValue。請嘗試將字串分割為多個常數。

# ERR_LanguageVersion
source: Visual Basic {0} does not support {1}.
cs: Visual Basic {0} nepodporuje: {1}.
de: {1} wird in Visual Basic {0} nicht unterstützt.
es: Visual Basic {0} no admite {1}.
fr: Visual Basic {0} ne prend pas en charge {1}.
it: Visual Basic {0} non supporta {1}.
ja: Visual Basic {0} は {1} をサポートしません。
ko: Visual Basic {0}에서는 {1}을(를) 지원하지 않습니다.
pl: Język Visual Basic {0} nie obsługuje {1}.
pt_br: O Visual Basic {0} não dá suporte a {1}.
ru: Visual Basic {0} не поддерживает {1}.
tr: {1}, Visual Basic {0} tarafından desteklenmiyor.
zh_hans: Visual Basic {0} 不支持 {1}。
zh_hant: Visual Basic {0} 不支援 {1}。

# ERR_BadPdbData
source: Error reading debug information for '{0}'
cs: Chyba při čtení informací ladění pro {0}
de: Fehler beim Lesen der Debuginformationen für "{0}"
es: Error al leer información de depuración de '{0}'
fr: Erreur lors de la lecture des informations de débogage pour '{0}'
it: Si è verificato un errore durante la lettura delle informazioni di debug per '{0}'
ja: '{0}' のデバッグ情報の読み取りエラー
ko: '{0}'에 대한 디버그 정보 읽기 오류
pl: Błąd podczas odczytywania informacji dotyczących debugowania elementu „{0}”
pt_br: Erro ao ler as informações de depuração para '{0}'
ru: Ошибка чтения отладочной информации для "{0}"
tr: '{0}' için hata ayıklama bilgileri okunurken hata oluştu
zh_hans: 读取“{0}”的调试信息时出错
zh_hant: 讀取 '{0}' 的偵錯資訊時發生錯誤

# FEATURE_ArrayLiterals
source: array literal expressions
cs: literálové výrazy polí
de: Literale Array-Ausdrücke
es: expresiones literales de matriz
fr: expressions littérales de tableaux
it: espressioni letterali di matrice
ja: 配列のリテラル式
ko: 배열 리터럴 식
pl: wyrażenia literału w tablicy
pt_br: expressões literais de matriz
ru: литеральные выражения массива
tr: düz dizi ifadeleri
zh_hans: 数组文本表达式
zh_hant: 陣列常值運算式

# FEATURE_AsyncExpressions
source: async methods or lambdas
cs: asynchronní metody nebo výrazy lambda
de: Async-Methoden oder Lambdafunktionen
es: expresiones lambda o métodos asincrónicos
fr: méthodes Async ou expressions lambda
it: metodi o lambda async
ja: Async メソッドまたはラムダ
ko: 비동기 메서드 또는 람다
pl: metody asynchroniczne lub wyrażenia lambda
pt_br: métodos assíncronos ou lambdas
ru: Асинхронные методы или лямбда-выражения
tr: zaman uyumsuz metotlar veya lambdalar
zh_hans: 异步方法或 lambda
zh_hant: async 方法或 Lambda

# FEATURE_AutoProperties
source: auto-implemented properties
cs: automaticky implementované vlastnosti
de: automatisch implementierte Eigenschaften
es: propiedades implementadas automáticamente
fr: propriétés implémentées automatiquement
it: proprietà implementate automaticamente
ja: 自動実装プロパティ
ko: 자동 구현 속성
pl: właściwości zaimplementowane automatycznie
pt_br: propriedades auto implementadas
ru: автоматически внедренные свойства
tr: otomatik uygulanan özellikler
zh_hans: 自动实现的属性
zh_hant: 自動實作的屬性

# FEATURE_ReadonlyAutoProperties
source: readonly auto-implemented properties
cs: automaticky implementované vlastnosti jen pro čtení
de: Schreibgeschützte automatisch implementierte Eigenschaften
es: propiedades de solo lectura implementadas automáticamente
fr: propriétés implémentées automatiquement en lecture seule
it: proprietà implementate automaticamente di sola lettura
ja: 読み取り専用の自動実装プロパティ
ko: 읽기 전용 자동 구현 속성
pl: automatycznie implementowane właściwości tylko do odczytu
pt_br: propriedades somente leitura implementadas automaticamente
ru: автоматически реализуемые свойства только для чтения
tr: salt okunur otomatik uygulanan özellikler
zh_hans: 自动实现的只读属性
zh_hant: 自動實作的唯讀屬性

# FEATURE_CoContraVariance
source: variance
cs: odchylka
de: Varianz
es: varianza
it: varianza
ja: 変性
ko: 가변성
pl: wariancja
pt_br: variância
ru: расхождение
tr: fark
zh_hans: 变型
zh_hant: 變異數

# FEATURE_CollectionInitializers
source: collection initializers
cs: inicializátory kolekce
de: Sammlungsinitialisierer
es: inicializadores de colección
fr: initialiseurs de collections
it: inizializzatori di raccolta
ja: コレクション初期化子
ko: 컬렉션 이니셜라이저
pl: inicjatory kolekcji
pt_br: inicializadores de coleção
ru: инициализаторы коллекции
tr: koleksiyon başlatıcıları
zh_hans: 集合初始值设定项
zh_hant: 集合初始設定式

# FEATURE_GlobalNamespace
source: declaring a Global namespace
cs: deklarace globálního oboru názvů
de: Deklarieren eines globalen Namespaces
es: declaración de un espacio de nombres global
fr: déclaration d'un espace de noms global
it: dichiarazione di uno spazio dei nomi globale
ja: グローバル名前空間の宣言中
ko: 전역 네임스페이스 선언
pl: deklarowanie globalnej przestrzeni nazw
pt_br: declarando um namespace Global
ru: объявление глобального пространства имен
tr: Genel ad alanı bildirimi
zh_hans: 声明全局命名空间
zh_hant: 宣告全域命名空間

# FEATURE_Iterators
source: iterators
cs: iterátory
de: Iteratoren
es: iteradores
fr: itérateurs
it: iteratori
ja: 反復子
ko: 반복기
pl: iteratory
pt_br: iteradores
ru: итераторы
tr: yineleyiciler
zh_hans: 迭代器
zh_hant: 迭代器

# FEATURE_LineContinuation
source: implicit line continuation
cs: implicitní pokračování řádku
de: Implizite Zeilenfortsetzung
es: continuación de línea implícita
fr: continuation de ligne implicite
it: continuazione di riga implicita
ja: 暗黙的な行継続
ko: 암시적 줄 연속
pl: niejawna kontynuacja wiersza
pt_br: continuação de linha implícita
ru: неявное продолжение строки
tr: örtülü satır devamı
zh_hans: 隐式行继续符
zh_hant: 隱含行接續符號

# FEATURE_StatementLambdas
source: multi-line lambda expressions
cs: víceřádkové výrazy lambda
de: Mehrzeilige Lambdaausdrücke
es: expresiones lambda de varias líneas
fr: Expressions lambda multilignes
it: espressioni lambda a più righe
ja: 複数行ラムダ式
ko: 여러 줄 람다 식
pl: wielowierszowe wyrażenia lambda
pt_br: expressões lambda multilinha
ru: многострочные лямбда-выражения
tr: çok satırlı lambda ifadeleri
zh_hans: 多行 lambda 表达式
zh_hant: 多行 Lambda 運算式

# FEATURE_SubLambdas
source: 'Sub' lambda expressions
cs: 'lambda výrazy Sub
de: Sub-Lambdaausdrücke
es: 'Expresiones lambda 'Sub'
fr: 'Expressions lambda 'Sub'
it: 'espressioni lambda 'Sub'
ja: 'Sub' ラムダ式
ko: 'Sub' 람다 식
pl: 'Wyrażenia lambda „Sub”
pt_br: 'expressões lambda 'Sub'
ru: 'Лямбда-выражения "Sub"
tr: 'Sub' lambda ifadeleri
zh_hans: '“Sub”lambda 表达式
zh_hant: 'Sub' Lambda 運算式

# FEATURE_NullPropagatingOperator
source: null conditional operations
cs: podmíněné operace null
de: Vorgänge mit Null-Bedingung
es: operaciones condicionales nulas
fr: Opérations conditionnelles null
it: operazioni condizionali Null
ja: null 条件演算
ko: Null 조건부 연산
pl: operacje warunkowe o wartości null
pt_br: operações condicionais nulas
ru: условные операции со значением "null"
tr: null koşullu işlemler
zh_hans: 空条件操作
zh_hant: null 條件運算

# FEATURE_NameOfExpressions
source: 'nameof' expressions
cs: 'výrazy nameof
de: '"nameof"-Ausdrücke
es: 'expresiones "nameof"
fr: 'Expressions 'nameof'
it: 'espressioni 'nameof'
ja: 'nameof' 式
ko: 'nameof' 식
pl: 'wyrażenia „nameof”
pt_br: 'expressões 'nameof'
ru: 'выражения "nameof"
tr: 'nameof' ifadeleri
zh_hans: '"nameof" 表达式
zh_hant: 'nameof' 運算式
