Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_XMLDocReturnsOnWriteOnlyProperty_Title
source: XML comment tag 'returns' is not permitted on a 'WriteOnly' Property
cs: Značka komentáře XML returns se u vlastnosti WriteOnly nepovoluje.
de: Die XML-Kommentarkennung "returns" ist für eine WriteOnly-Eigenschaft nicht zulässig.
es: No se permite la etiqueta de comentario XML 'returns' en una propiedad 'WriteOnly'
fr: La balise de commentaire XML 'returns' n'est pas autorisée pour une propriété 'WriteOnly'
it: Il tag 'returns' del commento XML non è consentito in una proprietà 'WriteOnly'
ja: XML コメント タグ 'returns' は、'WriteOnly' プロパティに許可されていません
ko: XML 주석 태그 'returns'는 'WriteOnly' 속성에 사용할 수 없음
pl: Tag komentarza XML „returns” jest niedozwolony we właściwości „WriteOnly”
pt_br: A marca de comentário XML 'returns' não é permitida em uma Propriedade 'WriteOnly'
ru: Тег комментария XML "returns" недопустим для свойства WriteOnly
tr: WriteOnly' Özelliğinde 'returns' XML açıklama etiketine izin verilmez
zh_hans: "WriteOnly" 属性中不允许出现 XML 注释标记 "returns"
zh_hant: WriteOnly' 屬性上不得使用 XML 註解標記 'returns'

# WRN_XMLDocOnAPartialType
source: XML comment cannot be applied more than once on a partial {0}. XML comments for this {0} will be ignored.
cs: Komentář XML nejde použít víc než jednou pro částečné {0}. Komentáře XML pro tuto {0} se budou ignorovat.
de: Ein XML-Kommentar kann nicht mehrmals auf {0} (partiell) angewendet werden. XML-Kommentare für {0} werden ignoriert.
es: El comentario XML no se puede aplicar más de una vez en un {0} parcial. Se omitirán los comentarios XML para este {0}.
fr: Le commentaire XML ne peut pas être appliqué plusieurs fois pour un {0} partiel. Les commentaires XML pour ce {0} seront ignorés.
it: Non è possibile applicare il commento XML più di una volta in un elemento '{0}' parziale. I commenti XML per questo elemento '{0}' verranno ignorati.
ja: XML コメントは、部分的な {0} で複数回適用できません。この {0} の XML コメントは無視されます。
ko: 부분 {0}에는 XML 주석을 두 번 이상 적용할 수 없습니다. 이 {0}에 대한 XML 주석이 무시됩니다.
pl: Komentarza XML nie można zastosować więcej niż raz w częściowym elemencie {0}. Komentarze XML dla tego elementu {0} zostaną zignorowane.
pt_br: Comentário XML não pode ser aplicado mais de uma vez em um {0} parcial. Comentários XML para este {0} serão ignorados.
ru: Комментарий XML не может быть применен более одного раза для частичного значения {0}. Комментарий XML для {0} будет игнорироваться.
tr: XML açıklaması kısmi {0} öğesine birden çok kez uygulanamaz. Bu {0} için XML açıklamaları yoksayılacak.
zh_hans: XML 注释在分部 {0} 中不能应用多次。此 {0} 的 XML 注释将被忽略。
zh_hant: 在部分 {0} 上不可套用多次 XML 註解。將會忽略此 {0} 的 XML 註解。

# WRN_XMLDocOnAPartialType_Title
source: XML comment cannot be applied more than once on a partial type
cs: Komentář XML se u částečného typu nedá použít víc než jednou.
de: Der XML-Kommentar kann nicht mehrere Male auf einen teilweisen Typ angewendet werden.
es: El comentario XML no se puede aplicar más de una vez en un tipo parcial
fr: Le commentaire XML ne peut pas être appliqué plusieurs fois sur un type partiel
it: Non è possibile applicare il commento XML più di una volta in un tipo parziale
ja: 部分型では、XML コメントを複数回適用できません
ko: 부분 형식(Partial Type)에는 XML 주석을 두 번 이상 적용할 수 없음
pl: Nie można zastosować komentarza XML więcej niż raz w typie częściowym
pt_br: O comentário XML não pode ser aplicado mais de uma vez em um tipo parcial
ru: Комментарий XML не может применяться больше одного раза в разделенном типе
tr: XML açıklaması kısmi bir türde birden çok kez uygulanamaz
zh_hans: XML 注释无法在一个分部类型上应用多次
zh_hant: 在部分類型上不可套用多次 XML 註解

# WRN_XMLDocReturnsOnADeclareSub
source: XML comment tag 'returns' is not permitted on a 'declare sub' language element.
cs: Značka komentáře XML returns není povolená u elementu jazyka declare sub.
de: Die XML-Kommentarkennung "returns" ist für ein "declare sub"-Sprachelement nicht zulässig.
es: La etiqueta de comentario XML 'returns' no se admite en un elemento de lenguaje 'declare sub'.
fr: La balise de commentaire XML 'returns' n'est pas autorisée pour un élément de langage 'declare sub'.
it: Il tag 'returns' del commento XML non è consentito in un elemento di linguaggio 'declare sub'.
ja: XML コメント タグ 'returns' は、'declare sub' 言語要素では許可されていません。
ko: XML 주석 태그 'returns'는 'declare sub' 언어 요소에서 사용할 수 없습니다.
pl: Tag komentarza XML „returns” jest niedozwolony w elemencie języka „declare sub”.
pt_br: A marca de comentário XML "returns" não é permitida em um elemento de linguagem "declare sub".
ru: Тег комментария XML "returns" недопустим для элемента языка "declare sub".
tr: declare sub' dil öğesinde 'returns' XML açıklama etiketine izin verilmez.
zh_hans: declare sub 语言元素中不允许有 XML 注释标记 "returns"。
zh_hant: declare sub' 語言元素上不可使用 XML 註解標記 'returns'。

# WRN_XMLDocReturnsOnADeclareSub_Title
source: XML comment tag 'returns' is not permitted on a 'declare sub' language element
cs: Značka komentáře XML returns se u elementu jazyka declare sub nepovoluje.
de: Die XML-Kommentarkennung "returns" ist für ein "declare sub"-Sprachelement nicht zulässig.
es: No se permite la etiqueta de comentario XML 'returns' en un elemento de lenguaje 'declare sub'
fr: La balise de commentaire XML 'returns' n’est pas autorisée pour un élément de langage 'declare sub'
it: Il tag 'returns' del commento XML non è consentito in un elemento di linguaggio 'declare sub'
ja: XML コメント タグ 'returns' は、'declare sub' 言語要素では許可されていません
ko: XML 주석 태그 'returns'는 'declare sub' 언어 요소에서 사용할 수 없음
pl: Tag komentarza XML „returns” jest niedozwolony w elemencie języka „declare sub”
pt_br: A marca de comentário XML 'returns' não é permitida em um elemento de linguagem 'declare sub'
ru: Тег комментария XML "returns" недопустим для элемента языка declare sub
tr: declare sub' dil öğesinde 'returns' XML açıklama etiketine izin verilmez
zh_hans: "declare sub" 语言元素中不允许出现 XML 注释标记 "returns"
zh_hant: declare sub' 語言項目上不可使用 XML 註解標記 'returns'

# WRN_XMLDocStartTagWithNoEndTag
source: XML documentation parse error: Start tag '{0}' doesn't have a matching end tag. XML comment will be ignored.
cs: Při analýze dokumentace XML došlo k chybě: K počáteční značce {0} chybí koncová značka. Komentář XML se bude ignorovat.
de: Analysefehler in der XML-Dokumentation: Für die Startkennung "{0}" ist keine entsprechende Endkennung vorhanden. Der XML-Kommentar wird ignoriert.
es: Error de análisis de la documentación XML: la etiqueta de apertura '{0}' no tiene la correspondiente etiqueta de cierre. Se omitirá el comentario XML.
fr: Erreur d'analyse de la documentation XML : la balise de début '{0}' n'a pas de balise de fin correspondante. Le commentaire XML sera ignoré.
it: Errore di analisi nella documentazione XML: il tag di inizio '{0}' non ha un corrispondente tag di fine. Il commento XML verrà ignorato.
ja: XML ドキュメント解析エラー: 開始タグ '{0}' に対応する終了タグがありません。XML コメントは無視されます。
ko: XML 문서 구문 분석 오류: 시작 태그 '{0}'에 짝이 되는 끝 태그가 없습니다. XML 주석이 무시됩니다.
pl: Błąd analizowania dokumentacji XML: tag początkowy „{0}” nie ma zgodnego tagu końcowego. Komentarz XML zostanie zignorowany.
pt_br: Erro de análise de documentação XML: marca de início "{0}" não tem uma marca de fim correspondente. Comentário XML será ignorado.
ru: Ошибка синтаксического анализа документации XML: Начальный тег "{0}" не имеет соответствующего конечного тега. Комментарий XML будет игнорироваться.
tr: XML belgesi ayrıştırma hatası: '{0}' başlangıç etiketiyle eşleşen bir bitiş etiketi yok. XML açıklaması yoksayılacak.
zh_hans: XML 文档分析错误: 开始标记“{0}”没有匹配的结束标记。XML 注释将被忽略。
zh_hant: XML 文件剖析錯誤: 起始標記 '{0}' 並沒有對稱的結束標記。將會忽略 XML 註解。

# WRN_XMLDocStartTagWithNoEndTag_Title
source: XML documentation parse error: Start tag doesn't have a matching end tag
cs: Chyba analýzy dokumentace XML: K počáteční značce chybí koncová značka.
de: Analysefehler in XML-Dokumentation: Für die Startkennung ist keine entsprechende Endkennung vorhanden.
es: Error de análisis de la documentación XML: la etiqueta de inicio no tiene una etiqueta de fin coincidente
fr: Erreur d’analyse de la documentation XML. La balise de début n’a pas de balise de fin correspondante
it: Errore di analisi della documentazione XML: per il tag di inizio non esiste un tag di fine corrispondente
ja: XML ドキュメントの解析エラーです。開始タグに対応する終了タグがありません
ko: XML 문서 구문 분석 오류: 시작 태그에 짝이 되는 끝 태그가 없음
pl: Błąd analizowania dokumentacji XML: tag początkowy nie ma zgodnego tagu końcowego
pt_br: Erro de análise de documentação XML: a marcação de início não tem uma marcação final correspondente
ru: Ошибка анализа документации XML: открывающий тег не имеет соответствущего закрывающего тега
tr: XML belgesi ayrıştırma hatası: Başlangıç etiketinin eşleşen bitiş etiketi yok
zh_hans: XML 文档分析错误: 开始标记没有匹配的结束标记
zh_hant: XML 文件剖析錯誤: 起始標記並沒有對稱的結束標記

# WRN_XMLDocBadGenericParamTag2
source: XML comment type parameter '{0}' does not match a type parameter on the corresponding '{1}' statement.
cs: Parametr typu komentáře XML {0} neodpovídá parametru typu u odpovídajícího příkazu {1}.
de: Der {0}-Typparameter des XML-Kommentars stimmt mit keinem Typparameter in der entsprechenden {1}-Anweisung überein.
es: El parámetro de tipo de comentario XML '{0}' no coincide con un parámetro de tipo de la instrucción '{1}' correspondiente.
fr: Le paramètre de type du commentaire XML '{0}' ne correspond pas à un paramètre de type pour l'instruction '{1}' correspondante.
it: Il parametro di tipo '{0}' del commento XML non corrisponde a un parametro di tipo nell'istruzione '{1}' corrispondente.
ja: XML コメントの型パラメーター '{0}' が対応する '{1}' ステートメント上の型パラメーターと一致しません。
ko: '{0}' XML 주석 형식 매개 변수가 해당 '{1}' 문의 형식 매개 변수와 일치하지 않습니다.
pl: Parametr typu komentarza XML „{0}” nie jest zgodny z parametrem typu w odpowiedniej instrukcji „{1}”.
pt_br: Parâmetro de tipo de comentário XML "{0}" não corresponde a um parâmetro de tipo na instrução "{1}" correspondente.
ru: Параметр типа комментария XML "{0}" не соответствует параметру соответствующего оператора "{1}".
tr: '{0}' açıklama türü parametresi, buna karşılık gelen '{1}' deyimindeki bir tür parametresiyle eşleşmiyor.
zh_hans: XML 注释类型参数“{0}”和相应的“{1}”语句的类型参数不匹配。
zh_hant: XML 註解類型參數 '{0}' 與對應的 '{1}' 陳述式上之類型參數不相符。

# WRN_XMLDocBadGenericParamTag2_Title
source: XML comment type parameter does not match a type parameter on the corresponding declaration statement
cs: Parametr typu komentáře XML neodpovídá parametru typu u odpovídajícího příkazu deklarace.
de: Der Typparameter des XML-Kommentars stimmt nicht mit einem Typparameter in der entsprechenden Deklarationsanweisung überein.
es: El parámetro de tipo de comentario XML no coincide con un parámetro de tipo de la instrucción de declaración correspondiente
fr: Le paramètre de type du commentaire XML ne correspond pas à un paramètre de type pour l’instruction de déclaration correspondante
it: Il parametro di tipo del commento XML non corrisponde a un parametro di tipo nell'istruzione declaration corrispondente
ja: XML コメントの型パラメーターが、対応する宣言ステートメント上の型パラメーターと一致しません
ko: XML 주석 형식 매개 변수가 해당 선언 문의 형식 매개 변수와 일치하지 않음
pl: Parametr typu komentarza XML jest niezgodny z parametrem typu w odpowiedniej instrukcji deklaracji
pt_br: O parâmetro de tipo de comentário XML não coincide com um parâmetro de tipo na instrução de declaração correspondente
ru: Параметр типа комментария XML не совпадает с параметром типа в соответствующем операторе объявления
tr: XML açıklama türü parametresi, ilgili bildirim deyimindeki bir tür parametresiyle eşleşmiyor
zh_hans: XML 注释类型参数与相应的声明语句上的类型参数不匹配
zh_hant: XML 註解類型參數與對應的宣告陳述式上的類型參數不相符

# WRN_XMLDocGenericParamTagWithoutName
source: XML comment type parameter must have a 'name' attribute.
cs: Parametr typu komentáře XML musí mít atribut name.
de: Typparameter für XML-Kommentare müssen ein name-Attribut aufweisen.
es: El parámetro de tipo de comentario XML debe tener un atributo 'name'.
fr: Le paramètre de type de commentaire XML doit avoir un attribut 'name'.
it: Il parametro di tipo del commento XML deve avere un attributo 'name'.
ja: XML コメントの型パラメーターには 'name' 属性を指定しなければなりません。
ko: XML 주석 형식 매개 변수에는 'name' 특성이 있어야 합니다.
pl: Parametr typu komentarza XML musi mieć atrybut „name”.
pt_br: Parâmetro de tipo de comentário XML deve ter um atributo "name".
ru: Параметр типа комментария XML должен содержать атрибут "name".
tr: XML açıklaması tür parametresinin 'name' özniteliği olmalıdır.
zh_hans: XML 注释类型参数必须具有 "name" 属性。
zh_hant: XML 註解類型參數必須要有 'name' 屬性。

# WRN_XMLDocGenericParamTagWithoutName_Title
source: XML comment type parameter must have a 'name' attribute
cs: Parametr typu komentáře XML musí mít atribut name.
de: Typparameter für XML-Kommentare müssen ein name-Attribut aufweisen.
es: El parámetro de tipo de comentario XML debe tener un atributo 'name'
fr: Le paramètre de type de commentaire XML doit avoir un attribut 'name'
it: Il parametro di tipo del commento XML deve avere un attributo 'name'
ja: XML コメントの型パラメーターには 'name' 属性がなければなりません
ko: XML 주석 형식 매개 변수에는 'name' 특성이 있어야 함
pl: Parametr typu komentarza XML musi mieć atrybut „name”
pt_br: Parâmetro de tipo de comentário XML deve ter um atributo 'name'
ru: Параметр типа комментария XML должен содержать атрибут name
tr: XML açıklaması tür parametresinin 'name' özniteliği olmalıdır
zh_hans: XML 注释类型参数必须具有 "name" 属性
zh_hant: XML 註解類型參數必須要有 'name' 屬性

# WRN_XMLDocExceptionTagWithoutCRef
source: XML comment exception must have a 'cref' attribute.
cs: Výjimka komentáře XML musí mít atribut cref.
de: Eine XML-Kommentarausnahme muss ein cref-Attribut aufweisen.
es: La excepción del comentario XML debe tener un atributo 'cref'.
fr: Une exception de commentaire XML doit avoir un attribut 'cref'.
it: L'eccezione del commento XML deve avere un attributo 'cref'.
ja: XML コメントの例外には 'cref' 属性を指定しなければなりません。
ko: XML 주석 예외에는 'cref' 특성이 있어야 합니다.
pl: Wyjątek komentarza XML musi mieć atrybut „cref”.
pt_br: Exceção de comentário XML deve ter um atributo "cref".
ru: Исключение для комментария XML должно содержать атрибут "cref".
tr: XML açıklaması özel durumunun 'cref' özniteliği olmalıdır.
zh_hans: XML 注释异常必须具有 "cref" 属性。
zh_hant: XML 註解例外狀況必須要有 'cref' 屬性。

# WRN_XMLDocExceptionTagWithoutCRef_Title
source: XML comment exception must have a 'cref' attribute
cs: Výjimka komentáře XML musí mít atribut cref.
de: Eine XML-Kommentarausnahme muss ein cref-Attribut aufweisen.
es: La excepción de comentario XML debe tener un atributo 'cref'
fr: Une exception de commentaire XML doit avoir un attribut 'cref'
it: L'eccezione del commento XML deve avere un attributo 'cref'
ja: XML コメントの例外には 'cref' 属性がなければなりません
ko: XML 주석 예외에는 'cref' 특성이 있어야 함
pl: Wyjątek komentarza XML musi mieć atrybut „cref”
pt_br: Exceção de comentário XML deve ter um atributo 'cref'
ru: Исключение для комментария XML должно содержать атрибут cref
tr: XML açıklaması özel durumunun 'cref' özniteliği olmalıdır
zh_hans: XML 注释异常必须具有 "cref" 属性
zh_hant: XML 註解例外狀況必須要有 'cref' 屬性

# WRN_XMLDocInvalidXMLFragment
source: Unable to include XML fragment '{0}' of file '{1}'.
cs: Nejde zahrnout fragment XML {0} ze souboru {1}.
de: Das XML-Fragment "{0}" der Datei "{1}" kann nicht einbezogen werden.
es: No se puede incluir el fragmento de código XML '{0}' del archivo '{1}'.
fr: Impossible d'inclure le fragment XML '{0}' du fichier '{1}'.
it: Non è possibile includere il frammento XML '{0}' del file '{1}'.
ja: ファイル '{1}' の XML フラグメント '{0}' を含めることができません。
ko: '{1}' 파일의 '{0}' XML 조각을 포함할 수 없습니다.
pl: Nie można dołączyć fragmentu XML „{0}” pliku „{1}”.
pt_br: Não é possível incluir fragmento XML "{0}" do arquivo "{1}".
ru: Не удалось включить фрагмент XML "{0}" файла "{1}".
tr: '{1}' dosyasının '{0}' XML parçası eklenemedi.
zh_hans: 无法包括文件“{1}”的 XML 段落“{0}”。
zh_hant: 無法包含檔案 '{1}' 的 XML 片段 '{0}'。

# WRN_XMLDocInvalidXMLFragment_Title
source: Unable to include XML fragment
cs: Nejde zahrnout fragment XML.
de: Das XML-Fragment kann nicht eingeschlossen werden.
es: No se puede incluir el fragmento XML
fr: Impossible d'inclure le fragment XML
it: Non è possibile includere il frammento XML
ja: XML フラグメントを含めることができません
ko: XML 조각을 포함할 수 없습니다.
pl: Nie można dołączyć fragmentu XML
pt_br: Não é possível incluir fragmento XML
ru: Не удалось включить фрагмент XML
tr: XML parçası eklenemedi
zh_hans: 无法包括 XML 段落。
zh_hant: 無法包含 XML 片段

# WRN_XMLDocBadFormedXML
source: Unable to include XML fragment '{1}' of file '{0}'. {2}
cs: Nejde zahrnout fragment XML {1} ze souboru {0}. {2}
de: Das XML-Fragment "{0}" der Datei "{1}" kann nicht einbezogen werden. {2}
es: No se puede incluir el fragmento de código XML '{1}' del archivo '{0}'. {2}
fr: Impossible d'inclure le fragment XML '{1}' du fichier '{0}'. {2}
it: Non è possibile includere il frammento XML '{1}' del file '{0}'. {2}
ja: ファイル '{0}' の XML フラグメント '{1}' を含めることができません。{2}
ko: '{0}' 파일의 '{1}' XML 조각을 포함할 수 없습니다({2}).
pl: Nie można dołączyć fragmentu XML „{0}” pliku „{1}”. {2}
pt_br: Não é possível incluir fragmento XML "{1}" do arquivo "{0}". {2}
ru: Не удалось включить фрагмент XML "{1}" файла "{0}". {2}
tr: '{0}' dosyasının '{1}' XML parçası eklenemedi. {2}
zh_hans: 无法包括文件“{0}”的 XML 段落“{1}”。{2}
zh_hant: 無法包含檔案 '{0}' 的 XML 片段 '{1}'。{2}

# WRN_XMLDocBadFormedXML_Title
source: Unable to include XML fragment
cs: Nejde zahrnout fragment XML.
de: Das XML-Fragment kann nicht eingeschlossen werden.
es: No se puede incluir el fragmento XML
fr: Impossible d'inclure le fragment XML
it: Non è possibile includere il frammento XML
ja: XML フラグメントを含めることができません
ko: XML 조각을 포함할 수 없습니다.
pl: Nie można dołączyć fragmentu XML
pt_br: Não é possível incluir fragmento XML
ru: Не удалось включить фрагмент XML
tr: XML parçası eklenemedi
zh_hans: 无法包括 XML 段落。
zh_hant: 無法包含 XML 片段

# WRN_InterfaceConversion2
source: Runtime errors might occur when converting '{0}' to '{1}'.
cs: Při převodu {0} na {1} se můžou vyskytnout běhové chyby.
de: Beim Konvertieren von "{0}" in "{1}" können Laufzeitfehler auftreten.
es: Se pueden producir errores en tiempo de ejecución al convertir '{0}' en '{1}'.
fr: Des erreurs d'exécution peuvent se produire lors de la conversion de '{0}' en '{1}'.
it: Durante la conversione da '{0}' a '{1}' si potrebbero verificare errori di runtime.
ja: '{0}' から '{1}' への変換時にランタイム エラーが発生する可能性があります。
ko: '{0}'에서 '{1}'(으)로 변환할 경우 런타임 오류가 발생할 수 있습니다.
pl: Podczas konwertowania elementu „{0}” na „{1}” mogą wystąpić błędy czasu wykonywania.
pt_br: Podem ocorrer erros de runtime ao converter '{0}' para '{1}'.
ru: Ошибки выполнения могут произойти при преобразовании "{0}" в "{1}".
tr: '{0}' - '{1}' dönüştürmesi sırasında çalışma zamanı hataları oluşabilir.
zh_hans: 将“{0}”转换为“{1}”时可能发生运行时错误。
zh_hant: 從 '{0}' 轉換至 '{1}' 時，可能會發生執行階段錯誤。

# WRN_InterfaceConversion2_Title
source: Runtime errors might occur when converting to or from interface type
cs: Při převádění na typ rozhraní nebo z něj se můžou vyskytnout chyby za běhu.
de: Beim Konvertieren in oder aus eines Schnittstellentyps können Laufzeitfehler auftreten.
es: Es posible que ocurran errores de tiempo de ejecución al convertir desde o a un tipo de interfaz
fr: Des erreurs d’exécution peuvent survenir lors de la conversion vers ou depuis le type d'interface
it: Durante la conversione da o verso il tipo interfaccia si potrebbero verificare errori di runtime
ja: インターフェイス型との間で変換を行うときにランタイム エラーが発生する可能性があります
ko: 인터페이스 형식과 변환할 때 런타임 오류가 발생할 수 있음
pl: Błędy w czasie wykonywania mogą występować podczas konwertowania na typ interfejsu lub z tego typu
pt_br: Podem ocorrer erros de tempo de execução ao converter de ou para o tipo de interface
ru: Ошибки среды выполнения могут происходить при преобразовании в тип или из типа интерфейса
tr: Arabirim türüne veya arabirim türünden dönüştürme yaparken çalışma zamanı hataları oluşabilir
zh_hans: 运行时错误可能在转换到或从接口类型转换时发生
zh_hant: 對介面類型進行來回轉換時可能發生執行階段錯誤

# WRN_LiftControlVariableLambda
source: Using the iteration variable in a lambda expression may have unexpected results. Instead, create a local variable within the loop and assign it the value of the iteration variable.
cs: Použití proměnné iterace ve výrazu lambda může mít nečekané důsledky. Namísto toho vytvořte v cyklu lokální proměnnou a přiřaďte jí hodnotu proměnné iterace.
de: Die Verwendung der Iterationsvariablen in einem Lambdaausdruck kann zu unerwarteten Ergebnissen führen. Erstellen Sie stattdessen in der Schleife eine lokale Variable, und weisen Sie dieser den Wert der Iterationsvariablen zu.
es: El uso de una variable de iteración en una expresión lambda puede producir resultados inesperados. Cree una variable local dentro del bucle y asígnele el valor de la variable de iteración.
fr: L'utilisation de la variable d'itération dans une expression lambda peut provoquer des résultats inattendus. Créez une variable locale dans la boucle et assignez-lui la valeur de la variable d'itération à la place.
it: L'uso della variabile di iterazione in un'espressione lambda può produrre risultati imprevisti. Creare una variabile locale all'interno del ciclo e assegnarvi il valore della variabile di iterazione.
ja: ラムダ式内で繰り返し変数を使用すると、予期しない結果が発生する可能性があります。代わりに、ループ内にローカル変数を作成して繰り返し変数の値を割り当ててください。
ko: 람다 식에 반복 변수를 사용하면 예기치 않은 결과가 발생할 수 있습니다. 대신 루프 내에 지역 변수를 만든 다음 여기에 반복 변수 값을 할당하세요.
pl: Użycie zmiennej iteracyjnej w wyrażeniu lambda może spowodować nieoczekiwane wyniki. Zamiast tego utwórz zmienną lokalną w pętli i przypisz jej wartość zmiennej iteracyjnej.
pt_br: O uso da variável de iteração em uma expressão lambda pode ter resultados inesperados. Em vez disso, crie uma variável local dentro do loop e atribua a ela o valor da variável de iteração.
ru: Использование переменной цикла в лямбда-выражении может привести к непредвиденным результатам. Вместо этого можно создать локальную переменную внутри цикла и присвоить ей значение переменной цикла.
tr: Lambda ifadesinde yineleme değişkeni kullanılması beklenmeyen sonuçlara neden olabilir. Bunun yerine döngü içinde yerel bir değişken oluşturun ve buna yineleme değişkeninin değerini atayın.
zh_hans: 在 lambda 表达式中使用迭代变量可能会产生意外的结果。应改为在循环中创建一个局部变量并将迭代变量的值赋给它。
zh_hant: 在 Lambda 運算式中使用反覆運算變數可能會產生非預期的結果，請改成在迴圈中建立區域變數，並將反覆運算變數的值指派給它。

# WRN_LiftControlVariableLambda_Title
source: Using the iteration variable in a lambda expression may have unexpected results
cs: Použití proměnné iterace ve výrazu lambda může mít neočekávané výsledky.
de: Die Verwendung der Iterationsvariablen in einem Lambdaausdruck kann zu unerwarteten Ergebnissen führen.
es: Es posible que usar la variable de iteración en una expresión lambda tenga resultados inesperados
fr: L’utilisation d’une variable d’itération dans une expression lambda peut avoir des résultats inattendus
it: L'uso della variabile di iterazione in un'espressione lambda può produrre risultati imprevisti
ja: ラムダ式内で繰り返し変数を使用すると、予期しない結果が発生する可能性があります
ko: 람다 식에 반복 변수를 사용하면 예기치 않은 결과가 발생할 수 있음
pl: Użycie zmiennej iteracji w wyrażeniu lambda może mieć nieoczekiwane skutki
pt_br: Usar a variável de iteração em uma expressão lambda pode ter resultados inesperados
ru: Использование переменной итерации в лямбда-выражении может привести к непредусмотренным результатам
tr: Lambda ifadesinde yineleme değişkeni kullanılması beklenmeyen sonuçlara neden olabilir
zh_hans: 在 lambda 表达式中使用迭代变量可能会产生意外的结果
zh_hant: 在 Lambda 運算式中使用反覆運算變數可能會產生非預期的結果
