Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_MutuallyExclusiveOptions
source: Compilation options '{0}' and '{1}' can't both be specified at the same time.
cs: Možnosti kompilace {0} a {1} se nedají zadat současně.
de: Die Kompilierungsoptionen "{0}" und "{1}" dürfen nicht gleichzeitig verwendet werden.
es: No se pueden especificar a la vez las opciones de compilación '{0}' y '{1}'.
fr: Les options de compilation '{0}' et '{1}' ne peuvent pas être spécifiées toutes les deux en même temps.
it: Non è possibile specificare contemporaneamente le opzioni di compilazione '{0}' e '{1}'.
ja: コンパイル オプション '{0}' と '{1}' の両方を同時に指定することはできません。
ko: 컴파일 옵션 '{0}'과(와) '{1}'을(를) 동시에 지정할 수 없습니다.
pl: Nie można równocześnie określić opcji kompilacji „{0}” i „{1}”.
pt_br: As opções de compilação '{0}' e '{1}' não podem ser especificadas ao mesmo tempo.
ru: Параметры компиляции "{0}" и "{1}" невозможно использовать одновременно.
tr: '{0}' ve '{1}' derleme seçenekleri aynı anda belirtilemez.
zh_hans: 无法同时指定编译选项“{0}”和“{1}”。
zh_hant: 不得同時指定編輯選項 '{0}' 與 '{1}'。

# WRN_BadUILang
source: The language name '{0}' is invalid.
cs: Název jazyka {0} je neplatný.
de: Der Sprachenname "{0}" ist ungültig.
es: El nombre de idioma '{0}' no es válido.
fr: Le nom de langue '{0}' n'est pas valide.
it: Il nome del linguaggio '{0}' non è valido.
ja: 言語名 '{0}' は無効です。
ko: '{0}' 언어 이름이 잘못되었습니다.
pl: Nazwa języka „{0}” jest nieprawidłowa.
pt_br: O nome de idioma "{0}" é inválido.
ru: Недопустимое имя языка "{0}".
tr: Dil adı '{0}' geçersiz.
zh_hans: 语言名“{0}”无效。
zh_hant: 語言名稱 '{0}' 無效。

# WRN_BadUILang_Title
source: The language name for /preferreduilang is invalid
cs: Název jazyka pro /preferreduilang je neplatný.
de: Der Sprachenname für /preferreduilang ist ungültig.
es: El nombre de idioma para /preferreduilang no es válido
fr: Le nom de langue pour /preferreduilang n’est pas valide
it: Il nome del linguaggio per /preferreduilang non è valido
ja: /preferreduilang の言語名が無効です
ko: /preferreduilang의 언어 이름이 잘못됨
pl: Nazwa języka dla parametru /preferreduilang jest nieprawidłowa
pt_br: O nome do idioma para /preferreduilang é inválido
ru: Название языка для /preferreduilang недопустимо
tr: /preferreduilang için belirtilen dil adı geçersiz
zh_hans: /preferreduilang 的语言名称无效
zh_hant: /preferreduilang 的語言名稱無效

# ERR_VBCoreNetModuleConflict
source: The options /vbruntime* and /target:module cannot be combined.
cs: Možnosti /vbruntime* a /target:module nejde kombinovat.
de: Die Optionen /vbruntime* und /target:module können nicht kombiniert werden.
es: Las opciones /vbruntime* y /target:module no se pueden combinar.
fr: Les options /vbruntime* et /target:module ne peuvent pas être combinées.
it: Non è possibile combinare le opzioni /vbruntime* e /target:module.
ja: オプション /vbruntime* と /target:module を組み合わせることはできません。
ko: /vbruntime* 옵션과 /target:module 옵션은 함께 사용할 수 없습니다.
pl: Nie można łączyć opcji /vbruntime* i /target:module.
pt_br: As opções /vbruntime* e/target:module não podem ser combinadas.
ru: Невозможно объединить параметры /vbruntime* и /target:module.
tr: /vbruntime* ve /target:module seçenekleri birleştirilemez.
zh_hans: /vbruntime* 选项不能与 /target:module 选项组合。
zh_hant: 無法結合選項 /vbruntime* 和 /target:module。

# ERR_InvalidFormatForGuidForOption
source: Command-line syntax error: Invalid Guid format '{0}' for option '{1}'
cs: Chyba syntaxe příkazového řádku: Neplatný formát GUID {0} pro možnost {1}
de: Befehlszeilen-Syntaxfehler: Ungültiges GUID-Format "{0}" für die Option "{1}".
es: Error de sintaxis de línea de comandos: formato de GUID '{0}' no válido para la opción '{1}'
fr: Erreur de syntaxe de ligne de commande : format de Guid '{0}' non valide pour l'option '{1}'
it: Errore nella sintassi della riga di comando: il formato del GUID '{0}' non è valido per l'opzione '{1}'
ja: コマンドラインの構文エラー: オプション '{1}' の GUID 形式 '{0}' が無効です
ko: 명령줄 구문 오류: '{1}' 옵션에 대해 잘못된 '{0}' Guid 형식입니다.
pl: Błąd składni wiersza polecenia: nieprawidłowy format identyfikatora GUID „{0}” dla opcji „{1}”
pt_br: Erro de sintaxe de linha de comando: Formato de Guid inválido "{0}" para a opção "{1}"
ru: Ошибка в синтаксисе командной строки: Недопустимый формат Guid "{0}" для параметра "{1}".
tr: Komut satırı sözdizimi hatası: '{1}' seçeneği için geçersiz Guid biçimi '{0}'
zh_hans: 命令行语法错误: Guid 格式“{0}”对于选项“{1}”无效
zh_hant: 命令列語法錯誤: 選項 '{1}' 的 Guid 格式 '{0}' 無效

# ERR_MissingGuidForOption
source: Command-line syntax error: Missing Guid for option '{1}'
cs: Chyba syntaxe příkazového řádku: Chybí GUID pro možnost {1}.
de: Befehlszeilen-Syntaxfehler: Fehlende GUID für Option "{1}".
es: Error de sintaxis de línea de comandos: falta el GUID para la opción '{1}'
fr: Erreur de syntaxe de ligne de commande : Guid manquant pour l'option '{1}'
it: Errore nella sintassi della riga di comando: manca il GUID per l'opzione '{1}'
ja: コマンドラインの構文エラー: オプション '{1}' の GUID がありません
ko: 명령줄 구문 오류: '{1}' 옵션에 대한 Guid가 없습니다.
pl: Błąd składni wiersza polecenia: brak identyfikatora Guid dla opcji „{1}”
pt_br: Erro de sintaxe de linha de comando: falta Guid para a opção "{1}"
ru: Ошибка в синтаксисе командной строки: Отсутствует Guid для параметра "{1}".
tr: Komut satırı sözdizimi hatası: '{1}' seçeneği için Guid eksik
zh_hans: 命令行语法错误: 选项“{1}”缺少 Guid
zh_hant: 命令列語法錯誤: 遺漏選項 '{1}' 的 Guid

# ERR_BadChecksumAlgorithm
source: Algorithm '{0}' is not supported
cs: Algoritmus {0} není podporovaný.
de: Algorithmus "{0}" wird nicht unterstützt
es: No se admite el algoritmo '{0}'
fr: Algorithme '{0}' non pris en charge
it: L'algoritmo '{0}' non è supportato
ja: アルゴリズム '{0}' はサポートされていません
ko: '{0}' 알고리즘은 지원되지 않습니다.
pl: Algorytm „{0}” nie jest obsługiwany
pt_br: Algoritmo '{0}' sem suporte
ru: Алгоритм "{0}" не поддерживается
tr: '{0}' algoritması desteklenmiyor
zh_hans: 不支持算法“{0}”
zh_hant: 不支援演算法 '{0}'

# WRN_BadSwitch
source: unrecognized option '{0}'; ignored
cs: Nerozpoznaná možnost {0}. Ignoruje se.
de: Nicht erkannte Option "{0}"; wird ignoriert.
es: opción '{0}' no reconocida; omitida
fr: option '{0}' non reconnue ; ignorée
it: l'opzione '{0}' non è stata riconosciuta e verrà ignorata
ja: 認識されていないオプション '{0}'; 無視
ko: 인식할 수 없는 '{0}' 옵션입니다. 무시됩니다.
pl: nierozpoznana opcja „{0}”; zignorowano
pt_br: opção não reconhecida "{0}"; ignorada
ru: нераспознанный параметр "{0}"; проигнорирован
tr: tanınmayan '{0}' seçeneği; yoksayıldı
zh_hans: 无法识别的选项“{0}”；已忽略
zh_hant: 無法辨認的選項 '{0}'; 已經忽略

# WRN_BadSwitch_Title
source: Unrecognized command-line option
cs: Nerozpoznaný přepínač příkazového řádku
de: Nicht erkannte Befehlszeilenoption
es: Opción de línea de comandos no reconocida
fr: Option de ligne de commande non reconnue
it: Opzione non riconosciuta della riga di comando
ja: 認識できないコマンドライン オプション
ko: 인식할 수 없는 명령줄 옵션
pl: Nierozpoznana opcja wiersza polecenia
pt_br: Opção de linha de comando não reconhecida
ru: Нераспознанный параметр командной строки
tr: Tanınmayan komut satırı seçeneği
zh_hans: 无法识别的命令行选项
zh_hant: 無法辨認的命令列選項

# ERR_NoSources
source: no input sources specified
cs: Nejsou zadané žádné vstupní zdroje.
de: Es wurden keine Eingabequellen angegeben.
es: no se especificó ningún origen de entrada
fr: aucune source d'entrée spécifiée
it: non sono state specificate origini di input
ja: 入力ソースが指定されていません
ko: 입력 소스를 지정하지 않았습니다.
pl: nie określono źródeł wejściowych
pt_br: nenhuma fonte de entrada especificada
ru: не задано входящих источников
tr: hiç bir giriş kaynağı belirtilmedi
zh_hans: 未指定输入源
zh_hant: 未指定輸入來源

# ERR_CantOpenFileWrite
source: can't open '{0}' for writing: {1}
cs: Soubor {0} nejde otevřít pro zápis: {1}.
de: "{0}" kann nicht zum Schreiben geöffnet werden: {1}
es: no se puede abrir '{0}' para escribir: {1}
fr: impossible d'ouvrir '{0}' en écriture : {1}
it: non è possibile aprire '{0}' per la scrittura: {1}
ja: 書き込みのために '{0}' を開くことはできません: {1}
ko: '{0}'을(를) 쓰기용으로 열 수 없습니다('{1}').
pl: nie można otworzyć elementu „{0}” do zapisu: {1}
pt_br: não é possível abrir "{0}" para gravar: {1}
ru: не удается открыть "{0}" для записи: {1}
tr: yazmak için '{0}' açılamıyor: {1}
zh_hans: 无法打开“{0}”进行写入: {1}
zh_hant: 無法開啟 '{0}' 進行寫入: {1}

# ERR_BadCodepage
source: code page '{0}' is invalid or not installed
cs: Znaková stránka {0} je neplatná nebo není nainstalovaná.
de: Die Codepage "{0}" ist ungültig oder nicht installiert.
es: la página de código '{0}' no es válida o no está instalada
fr: la page de '{0}' n'est pas correcte ou n'est pas installée
it: la tabella codici '{0}' non è valida o non è installata
ja: コード ページ '{0}' は無効か、またはインストールされていません
ko: '{0}' 코드 페이지가 잘못되었거나 설치되어 있지 않습니다.
pl: strona kodowa „{0}” jest nieprawidłowa lub nie została zainstalowana
pt_br: página de código "{0}" é inválida ou não está instalada
ru: Кодовая страница "{0}" является недопустимой или не установлена.
tr: '{0}' kod sayfası geçersiz veya yüklü değil
zh_hans: 代码页“{0}”无效或未安装
zh_hant: 字碼頁 '{0}' 無效或尚未安裝

# ERR_BinaryFile
source: the file '{0}' is not a text file
cs: {0} není textový soubor.
de: Die Datei "{0}" ist keine Textdatei.
es: el archivo '{0}' no es un archivo de texto
fr: le fichier '{0}' n'est pas un fichier texte
it: il file '{0}' non è un file di testo
ja: ファイル '{0}' はテキスト ファイルではありません
ko: '{0}' 파일은 텍스트 파일이 아닙니다.
pl: plik „{0}” nie jest plikiem tekstowym
pt_br: o arquivo "{0}" não é um arquivo de texto
ru: файл "{0}" не является текстовым
tr: '{0}' dosyası bir metin dosyası değil
zh_hans: 文件“{0}”不是文本文件
zh_hant: 檔案 '{0}' 不是文字檔

# ERR_LibNotFound
source: could not find library '{0}'
cs: Nenašla se knihovna {0}.
de: Bibliothek "{0}" wurde nicht gefunden
es: no se encontró la biblioteca '{0}'
fr: impossible de trouver la bibliothèque '{0}'
it: la libreria '{0}' non è stata trovata
ja: ライブラリ '{0}' が見つかりませんでした
ko: '{0}' 라이브러리가 없습니다.
pl: nie można znaleźć biblioteki „{0}”
pt_br: não foi possível encontrar biblioteca "{0}"
ru: Не удалось найти библиотеку "{0}"
tr: '{0}' kitaplığı bulunamadı
zh_hans: 找不到库“{0}”
zh_hant: 找不到程式庫 '{0}'

# ERR_MetadataReferencesNotSupported
source: Metadata references not supported.
cs: Odkazy v metadatech se nepodporují.
de: Metadatenverweise werden nicht unterstützt.
es: Referencias de metadatos no admitidas.
fr: Références de métadonnées non prises en charge.
it: I riferimenti ai metadati non sono supportati.
ja: メタデータ参照はサポートされていません。
ko: 메타데이터 참조는 지원되지 않습니다.
pl: Odwołania do metadanych nie są obsługiwane.
pt_br: Não há suporte a referências de metadados.
ru: Ссылки на метаданные не поддерживаются.
tr: Meta veri başvuruları desteklenmiyor.
zh_hans: 不支持元数据引用。
zh_hant: 不支援中繼資料參考。

# ERR_IconFileAndWin32ResFile
source: cannot specify both /win32icon and /win32resource
cs: Nejde zadat oba přepínače /win32icon a /win32resource.
de: "/win32icon" und "/win32resource" können nicht gleichzeitig angegeben werden.
es: no se puede especificar /win32icon y /win32resource
fr: impossible de spécifier à la fois /win32icon et /win32resource
it: non è possibile specificare sia /win32icon che /win32resource
ja: /win32icon と /win32resource を両方指定することはできません
ko: /win32icon과 /win32resource를 모두 지정할 수는 없습니다.
pl: nie można jednocześnie określić parametrów /win32icon i /win32resource
pt_br: não é possível especificar /win32icon e /win32resource
ru: Не удается определить /win32icon и /win32resource
tr: hem /win32icon hem /win32resource belirtilemez
zh_hans: 不能同时指定 /win32icon 和 /win32resource
zh_hant: 無法同時指定 /win32icon 和 /win32resource

# WRN_NoConfigInResponseFile
source: ignoring /noconfig option because it was specified in a response file
cs: Přepínač /noconfig se ignoroval, protože byl uvedený v souboru odpovědí.
de: Die /noconfig-Option wird ignoriert, da sie in einer Antwortdatei angegeben wurde.
es: omitiendo la opción /noconfig porque se especificó en un archivo de respuesta
fr: Option /noconfig ignorée, car elle était spécifiée dans un fichier réponse
it: l'opzione /noconfig è stata ignorata perché è stata specificata in un file di risposta
ja: /noconfig オプションは、応答ファイルで指定されているため無視されます
ko: 지시 파일에 지정되었기 때문에 /noconfig 옵션을 무시합니다.
pl: opcja /noconfig zostanie zignorowana, ponieważ została określona w pliku odpowiedzi
pt_br: ignorando a opção /noconfig porque foi especificada em um arquivo de resposta
ru: Параметр /noconfig проигнорирован, потому что он задан в файле ответов.
tr: bir yanıt dosyası içinde belirtildiğinden /noconfig seçeneği yoksayılıyor
zh_hans: /noconfig 选项是在响应文件中指定的，因此被忽略
zh_hant: 忽略 /noconfig 選項，因為在回應檔中已指定

# WRN_NoConfigInResponseFile_Title
source: Ignoring /noconfig option because it was specified in a response file
cs: Přepínač /noconfig se ignoroval, protože byl uvedený v souboru odpovědí.
de: Die /noconfig-Option wird ignoriert, da sie in einer Antwortdatei angegeben wurde.
es: Omitiendo la opción /noconfig porque se especificó en un archivo de respuesta
fr: Option /noconfig ignorée, car elle était spécifiée dans un fichier réponse
it: L'opzione /noconfig è stata ignorata perché è stata specificata in un file di risposta
ja: 応答ファイルで指定されているため、/noconfig オプションを無視します
ko: 지시 파일에 지정되었기 때문에 /noconfig 옵션을 무시합니다.
pl: Opcja /noconfig zostanie zignorowana, ponieważ została określona w pliku odpowiedzi
pt_br: Ignorando a opção /noconfig porque ela foi especificada em um arquivo de resposta
ru: Параметр /noconfig пропущен, т. к. он задан в файле ответов
tr: Bir yanıt dosyası içinde belirtildiğinden /noconfig seçeneği yoksayılıyor
zh_hans: /noconfig 选项是在响应文件中指定的，因此被忽略
zh_hant: 因為在回應檔中已指定 /noconfig 選項，所以將會忽略該選項

# ERR_NoSourcesOut
source: cannot infer an output file name from resource only input files; provide the '/out' option
cs: nejde stanovit název výstupního souboru jenom ze vstupních souborů prostředků; zadejte parametr /out.
de: Ein Ausgabedateiname kann nicht aus reinen Ressourceneingabedateien per Rückschluss abgeleitet werden. Geben Sie die Option ""/out"" an.
es: no se puede inferir un nombre de archivo de salida desde recursos que solo tienen archivos de entrada; proporcione la opción '/out'
fr: impossible de déduire le nom d'un fichier de sortie à partir de fichiers d'entrée de ressource uniquement ; fournissez l'option '/out'
it: non è possibile dedurre il nome del file di output solo dai file di input delle risorse. Specificare l'opzione '/out'
ja: リソースのみの入力ファイルから出力ファイル名を生成することはできません。'/out' オプションを指定してください
ko: 리소스 전용 입력 파일에서 출력 파일 이름을 유추할 수 없습니다. '/out' 옵션을 지정하세요.
pl: nie można wywnioskować nazwy pliku wyjściowego na podstawie plików wejściowych zawierających tylko zasoby; podaj opcję „/out”
pt_br: não é possível inferir um nome de arquivo de saída com base nos arquivos de entrada de recurso único; forneça a opção "/out"
ru: Не удалось определить имя выходного файла из ресурса только входных файлов; укажите параметр "/out"
tr: salt kaynak giriş dosyalarından çıkış dosyası adı alınamaz; '/out' seçeneğini sağlayın
zh_hans: 无法从仅资源输入文件推理出输出文件名；提供“/out”选项
zh_hant: 無法從只有輸入檔的資源推斷輸出檔名，請提供 '/out' 選項

# ERR_NeedModule
source: the /moduleassemblyname option may only be specified when building a target of type 'module'
cs: možnost /moduleassemblyname jde zadat jen při sestavování cíle typu module
de: Die Option /moduleassemblyname kann nur beim Erstellen eines Ziels vom Typ "module" angegeben werden.
es: la opción /moduleassemblyname solo se puede especificar al crear un destino de tipo 'module'
fr: l'option /moduleassemblyname ne peut être spécifiée que lors de la génération d'une cible de type 'module'
it: si può specificare l'opzione /moduleassemblyname solo durante la compilazione di una destinazione di tipo 'module'
ja: /moduleassemblyname オプションは 'module' 型のターゲットをビルドするときのみ指定できます
ko: /moduleassemblyname 옵션은 'module' 형식의 대상을 빌드할 때에만 지정할 수 있습니다.
pl: opcję /moduleassemblyname można określić tylko w przypadku kompilowania elementu docelowego typu „module”
pt_br: a opção /moduleassemblyname só pode ser especificada ao construir um destino de tipo "module"
ru: Параметр /moduleassemblyname может использоваться только при создании типа "module"
tr: /moduleassemblyname seçeneği ancak 'module' türünde bir hedef oluşturulurken belirtilebilir
zh_hans: 只有在生成“module”类型的目标时才能指定 /moduleassemblyname 选项
zh_hant: /moduleassemblyname 選項只能在建置 'module' 類型的目標時指定

# ERR_InvalidAssemblyName
source: '{0}' is not a valid value for /moduleassemblyname
cs: '{0} není platný pro /moduleassemblyname.
de: '"{0}" ist kein gültiger Wert für /moduleassemblyname
es: '{0}' no es un valor válido para /moduleassemblyname
fr: '{0}' n'est pas une valeur valide pour /moduleassemblyname
it: '{0} non è un valore valido per /moduleassemblyname
ja: '{0}' は /moduleassemblyname の有効な値ではありません
ko: '{0}'은(는) /moduleassemblyname에 유효한 값이 아닙니다.
pl: 'Wartość „{0}” nie jest prawidłowa dla parametru /moduleassemblyname
pt_br: "{0}" não é um valor válido para /moduleassemblyname
ru: "{0}" не является допустимым значением для /moduleassemblyname
tr: '{0}', /moduleassemblyname için geçerli bir değer değil
zh_hans: '“{0}”不是 /moduleassemblyname 的有效值。
zh_hant: '{0}' 不是 /moduleassemblyname 的有效值

# ERR_ConflictingManifestSwitches
source: Error embedding Win32 manifest: Option /win32manifest conflicts with /nowin32manifest.
cs: Chyba při vkládání manifestu Win32: Možnost /win32manifest je v konfliktu s možností /nowin32manifest.
de: Fehler beim Einbetten des Win32-Manifests: Die Option "/win32manifest" verursacht Konflikte mit "/nowin32manifest".
es: Error al incrustar el manifiesto de Win32: la opción /win32manifest entra en conflicto con /nowin32manifest.
fr: Erreur d'incorporation du manifeste Win32 : l'option /win32manifest est en conflit avec /nowin32manifest.
it: Si è verificato un errore durante l'incorporamento del manifesto Win32: l'opzione /win32manifest è in conflitto con /nowin32manifest.
ja: Win32 マニフェストの埋め込みエラー: オプション /win32manifest が /nowin32manifest と競合しています。
ko: Win32 매니페스트를 포함하는 동안 오류가 발생했습니다. /win32manifest 옵션이 /nowin32manifest와 충돌합니다.
pl: Błąd podczas osadzania manifestu Win32: opcja /win32manifest powoduje konflikt z opcją /nowin32manifest.
pt_br: Erro ao inserir o manifesto Win32: a opção /win32manifest entra em conflito com /nowin32manifest.
ru: Ошибка при внедрении манифеста Win32: Параметр /win32manifest конфликтует с /nowin32manifest.
tr: Win32 bildirimini katıştırma hatası: /win32manifest seçeneği /nowin32manifest ile çakışıyor.
zh_hans: 嵌入 Win32 清单时出错: 选项 /win32manifest 与 /nowin32manifest 冲突。
zh_hant: 內嵌 Win32 資訊清單時發生錯誤: 選項 /win32manifest 與 /nowin32manifest 相衝突。

# WRN_IgnoreModuleManifest
source: Option /win32manifest ignored. It can be specified only when the target is an assembly.
cs: Možnost /win32manifest se ignorovala. Dá se použít jenom tehdy, když je cílem sestavení.
de: Die Option "/win32manifest" wurde ignoriert. Sie kann nur angegeben werden, wenn das Ziel eine Assembly ist.
es: Se ha omitido la opción /win32manifest. Solo se puede especificar cuando el destino es un ensamblado.
fr: Option /win32manifest ignorée. Elle ne peut être spécifiée que lorsque la cible est un assembly.
it: L'opzione /win32manifest è stata ignorata. Può essere specificata solo quando la destinazione è un assembly.
ja: オプション /win32manifest は無視されます。このオプションはターゲットがアセンブリのときにのみ指定できます。
ko: /win32manifest 옵션을 무시합니다. 이 옵션은 대상이 어셈블리일 때만 지정할 수 있습니다.
pl: Opcja /win32manifest została zignorowana. Można ją określić tylko wówczas, gdy element docelowy jest zestawem.
pt_br: Opção /win32manifest ignorada. Isso só poderá ser especificado quando o destino for um assembly.
ru: Параметр / win32manifest игнорируется. Он может быть задан, только если целевым объектом является сборка.
tr: /win32manifest seçeneği yoksayıldı. Bu seçenek ancak hedef bir derleme olduğunda belirtilebilir.
zh_hans: 已忽略选项 /win32manifest。只有在目标是程序集时才能指定该选项。
zh_hant: 已忽略選項 /win32manifest。只能在目標為組件時指定此選項。

# WRN_IgnoreModuleManifest_Title
source: Option /win32manifest ignored
cs: Možnost /win32manifest se ignoruje.
de: Die Option /win32manifest wird ignoriert
es: Se ignoró la opción /win32manifest
fr: Option /win32manifest ignorée
it: Opzione /win32manifest ignorata
ja: オプション /win32manifest が無視されました
ko: /win32manifest 옵션이 무시됩니다.
pl: Opcja /win32manifest została zignorowana
pt_br: Opção /win32manifest ignorada
ru: Параметр /win32manifest пропускается
tr: /win32manifest seçeneği yoksayıldı
zh_hans: /win32manifest 选项已忽略
zh_hant: 已忽略 /win32manifest 選項

# ERR_InvalidInNamespace
source: Statement is not valid in a namespace.
cs: Příkaz není platný v oboru názvů.
de: Die Anweisung ist in einem Namespace ungültig.
es: La instrucción no es válida en un espacio de nombres.
fr: Instruction non valide dans un espace de noms.
it: L'istruzione non è valida in uno spazio dei nomi.
ja: 名前空間では有効でないステートメントです。
ko: 네임스페이스에는 문을 사용할 수 없습니다.
pl: Instrukcja nie jest prawidłowa w przestrzeni nazw.
pt_br: A instrução não é válida em um namespace.
ru: Не допускается применение операторов в пространствах имен.
tr: Deyim bir ad alanında geçerli değil.
zh_hans: 语句在命名空间中无效。
zh_hant: 命名空間中的陳述式無效。

# ERR_UndefinedType1
source: Type '{0}' is not defined.
cs: Typ {0} není definovaný.
de: Der Typ "{0}" ist nicht definiert.
es: No está definido el tipo '{0}'.
fr: Le type '{0}' n'est pas défini.
it: Il tipo '{0}' non è definito.
ja: 型 '{0}' は定義されていません。
ko: '{0}' 형식이 정의되지 않았습니다.
pl: Typ „{0}” nie został zdefiniowany.
pt_br: O tipo '{0}' não está definido.
ru: Тип "{0}" не определен.
tr: '{0}' türü tanımlı değil.
zh_hans: 未定义类型“{0}”。
zh_hant: 類型 '{0}' 未定義。

# ERR_MissingNext
source: 'Next' expected.
cs: 'Očekával se příkaz Next.
de: '"Next" erwartet.
es: 'Se esperaba 'Next'.
fr: 'Next' attendu.
it: 'È previsto 'Next'.
ja: 'Next' が必要です。
ko: 'Next'가 필요합니다.
pl: 'Oczekiwano elementu Next.
pt_br: 'Next' esperado.
ru: 'Требуется "Next".
tr: 'Next' bekleniyor.
zh_hans: '应为 "Next"。
zh_hant: '必須是 'Next'。

# ERR_IllegalCharConstant
source: Character constant must contain exactly one character.
cs: Znaková konstanta musí obsahovat právě jeden znak.
de: Zeichenkonstanten müssen genau ein Zeichen enthalten.
es: La constante de caracteres debe contener exactamente un carácter.
fr: Une constante caractère doit contenir exactement un caractère.
it: La costante carattere deve contenere esattamente un carattere.
ja: 文字定数には 1 文字のみを指定しなければなりません。
ko: 문자 상수에는 문자가 하나만 있어야 합니다.
pl: Stała znakowa musi zawierać dokładnie jeden znak.
pt_br: A constante de caractere deve conter exatamente um caractere.
ru: Символьная константа должна содержать ровно один символ.
tr: Karakter sabiti tam olarak bir karakter içermelidir.
zh_hans: 字符常量必须正好包含一个字符。
zh_hant: 字元常數必須剛好包含一個字元。

# ERR_UnreferencedAssemblyEvent3
source: Reference required to assembly '{0}' containing the definition for event '{1}'. Add one to your project.
cs: Vyžaduje se odkaz na sestavení {0} obsahující definici události {1}. Přidejte ho do projektu.
de: Es ist ein Verweis auf die Assembly "{0}" erforderlich, die die Definition für das Ereignis "{1}" enthält. Fügen Sie dem Projekt einen Verweis hinzu.
es: Es necesaria una referencia al ensamblado '{0}' que contiene la definición del evento '{1}'. Agregue una al proyecto.
fr: Une référence à l'assembly '{0}' contenant la définition de l'événement '{1}' est requise. Ajoutez-en une à votre projet.
it: È necessario il riferimento all'assembly '{0}' contenente la definizione dell'evento '{1}'. Aggiungerne uno al progetto.
ja: イベント '{1}' の定義を含むアセンブリ '{0}' への参照が必要です。参照をプロジェクトに追加してください。
ko: '{1}' 이벤트에 대한 정의를 포함하는 '{0}' 어셈블리에 대한 참조를 찾을 수 없습니다. 프로젝트에 추가하세요.
pl: Wymagane odwołanie do zestawu „{0}” z definicją zdarzenia „{1}”. Dodaj je do projektu.
pt_br: Referência necessária para o assembly "{0}" contendo a definição para o evento "{1}". Adicione uma ao seu projeto.
ru: Для модуля "{0}" требуется сборка, содержащая определение события "{1}". Добавьте одну из них в проект.
tr: '{1}' olayının tanımını içeren '{0}' derlemesine başvuru gerekiyor. Projenize bir başvuru ekleyin.
zh_hans: 需要对程序集“{0}”(包含事件“{1}”的定义)的引用。请在项目中添加一个。
zh_hant: 組件 '{0}' (包含事件 '{1}' 的定義) 需要參考。請在您的專案中加入一個參考。
