Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_GotoIntoSyncLock
source: 'GoTo {0}' is not valid because '{0}' is inside a 'SyncLock' statement that does not contain this statement.
cs: 'Příkaz GoTo {0} není platný, protože návěstí {0} je uvnitř příkazu SyncLock, který tento příkaz neobsahuje.
de: '"GoTo {0}" ist ungültig, da "{0}" sich innerhalb einer SyncLock-Anweisung befindet, die diese Anweisung nicht enthält.
es: 'GoTo {0}' no es válida porque '{0}' está dentro de una instrucción 'SyncLock' que no contiene esta instrucción.
fr: 'GoTo {0}' n'est pas valide, car '{0}' se trouve à l'intérieur d'une instruction 'SyncLock' qui ne contient pas cette instruction.
it: 'GoTo {0}' non è valida perché '{0}' si trova all'interno di un'istruzione 'SyncLock' che non contiene questa istruzione.
ja: '{0}' は、このステートメントを含まない 'SyncLock' ステートメントの内側にあるため、'GoTo {0}' は有効ではありません。
ko: '{0}'이(가) 이 문을 포함하지 않는 'SyncLock' 문 내부에 있기 때문에 'GoTo {0}'은(는) 유효하지 않습니다.
pl: 'Instrukcja „GoTo {0}” jest nieprawidłowa, ponieważ element „{0}” znajduje się wewnątrz instrukcji „SyncLock”, która nie zawiera tej instrukcji.
pt_br: "GoTo {0}" não é válido porque "{0}" está dentro de uma instrução "SyncLock" que não contém essa instrução.
ru: 'Недопустимый оператор "GoTo {0}", поскольку "{0}" находится в теле оператора "SyncLock", не содержащего данный оператор.
tr: '{0}', bu deyimi içermeyen bir 'SyncLock' deyiminin içinde yer aldığından, 'GoTo {0}' geçerli değil.
zh_hans: '“GoTo {0}”无效，因为“{0}”位于不包含此语句的“SyncLock”语句中。
zh_hant: 'GoTo {0}' 無效，因為 '{0}' 位於不包含此陳述式的 'SyncLock' 陳述式中。

# ERR_GotoIntoWith
source: 'GoTo {0}' is not valid because '{0}' is inside a 'With' statement that does not contain this statement.
cs: 'Příkaz GoTo {0} není platný, protože návěstí {0} je uvnitř příkazu With, který tento příkaz neobsahuje.
de: '"GoTo {0}" ist ungültig, da "{0}" sich innerhalb einer With-Anweisung befindet, die diese Anweisung nicht enthält.
es: 'GoTo {0}' no es válida porque '{0}' está dentro de una instrucción 'With' que no contiene esta instrucción.
fr: 'GoTo {0}' n'est pas valide, car '{0}' se trouve à l'intérieur d'une instruction 'With' qui ne contient pas cette instruction.
it: 'GoTo {0}' non è valida perché '{0}' si trova all'interno di un'istruzione 'With' che non contiene questa istruzione.
ja: '{0}' は、このステートメントを含まない 'With' ステートメントの内側にあるため、'GoTo {0}' は有効ではありません。
ko: '{0}'이(가) 이 문을 포함하지 않는 'With' 문 내부에 있기 때문에 'GoTo {0}'은(는) 유효하지 않습니다.
pl: 'Instrukcja „GoTo {0}” jest nieprawidłowa, ponieważ element „{0}” znajduje się wewnątrz instrukcji „With”, która nie zawiera tej instrukcji.
pt_br: "GoTo {0}" não é válido porque "{0}" está dentro de uma instrução "With" que não contém essa instrução.
ru: 'Недопустимый оператор "GoTo {0}", поскольку "{0}" находится в теле оператора "With", не содержащего данный оператор.
tr: '{0}', bu deyimi içermeyen bir 'With' deyiminin içinde yer aldığından, 'GoTo {0}' geçerli değil.
zh_hans: '“GoTo {0}”无效，因为“{0}”位于不包含此语句的“With”语句中。
zh_hant: 'GoTo {0}' 無效，因為 '{0}' 位於不包含此陳述式的 'With' 陳述式中。

# ERR_GotoIntoFor
source: 'GoTo {0}' is not valid because '{0}' is inside a 'For' or 'For Each' statement that does not contain this statement.
cs: 'Příkaz GoTo {0} není platný, protože návěstí {0} je uvnitř příkazu For nebo For Each, který tento příkaz neobsahuje.
de: '"GoTo {0}" ist ungültig, da "{0}" sich innerhalb einer For- oder For Each-Anweisung befindet, die diese Anweisung nicht enthält.
es: 'GoTo {0}' no es válida porque '{0}' está dentro de una instrucción 'For' o 'For Each' que no contiene esta instrucción.
fr: 'GoTo {0}' n'est pas valide, car '{0}' se trouve à l'intérieur d'une instruction 'For' ou 'For Each' qui ne contient pas cette instruction.
it: 'GoTo {0}' non è valida perché '{0}' si trova all'interno di un'istruzione 'For' o 'For Each' che non contiene questa istruzione.
ja: '{0}' は、このステートメントを含まない 'For' または 'For Each' ステートメントの内側にあるため、'GoTo {0}' は有効ではありません。
ko: '{0}'이(가) 이 문을 포함하지 않는 'For' 또는 'For Each' 문 내부에 있기 때문에 'GoTo {0}'은(는) 유효하지 않습니다.
pl: 'Instrukcja „GoTo {0}” jest nieprawidłowa, ponieważ element „{0}” znajduje się wewnątrz instrukcji „For” lub „For Each”, która nie zawiera tej instrukcji.
pt_br: "GoTo {0}" não é válido porque "{0}" está dentro de uma instrução "For" ou "For Each" que não contém essa instrução.
ru: 'Недопустимый оператор "GoTo {0}", поскольку "{0}" находится в теле оператора ''For" или "For Each", не содержащего данный оператор.
tr: '{0}', bu deyimi içermeyen bir 'For' veya 'For Each' deyiminin içinde yer aldığından, 'GoTo {0}' geçerli değil.
zh_hans: '“GoTo {0}”无效，因为“{0}”位于不包含此语句的“For”或“For Each”语句中。
zh_hant: 'GoTo {0}' 無效，因為 '{0}' 位於不包含此陳述式的 'For' 或 'For Each' 陳述式中。

# ERR_BadAttributeNonPublicConstructor
source: Attribute cannot be used because it does not have a Public constructor.
cs: Atribut nejde použít, protože nemá konstruktor typu Public.
de: Das Attribut kann nicht verwendet werden, da es keinen Public-Konstruktor hat.
es: No se puede usar el atributo porque no tiene un constructor Public.
fr: Impossible d'utiliser cet attribut, car il n'a pas de constructeur public.
it: Non è possibile usare l'attributo perché non ha un costruttore Public.
ja: 属性に Public コンストラクターがないため、この属性を使用できません。
ko: 특성에 Public 생성자가 없으므로 특성을 사용할 수 없습니다.
pl: Nie można użyć atrybutu, ponieważ nie ma on konstruktora Public.
pt_br: O atributo não pode ser usado porque não tem um construtor Public.
ru: Использование атрибута невозможно, так как для него отсутствует открытый конструктор.
tr: Public oluşturucusu olmadığından öznitelik kullanılamıyor.
zh_hans: 特性没有 Public 构造函数，因此不能使用。
zh_hant: 無法使用屬性，因為它沒有 Public 建構函式。

# ERR_DefaultEventNotFound1
source: Event '{0}' specified by the 'DefaultEvent' attribute is not a publicly accessible event for this class.
cs: Událost {0} zadaná atributem DefaultEvent není veřejně přístupná událost pro tuto třídu.
de: Das durch das DefaultEvent-Attribut angegebene Ereignis "{0}" ist für diese Klasse nicht öffentlich zugreifbar.
es: El evento '{0}' especificado por el atributo 'DefaultEvent' no es un evento accesible públicamente para esta clase.
fr: L'événement '{0}' spécifié par l'attribut 'DefaultEvent' n'est pas un événement accessible publiquement pour cette classe.
it: L'evento '{0}' specificato dall'attributo 'DefaultEvent' non è un evento accessibile pubblicamente per questa classe.
ja: DefaultEvent' 属性で指定されたイベント '{0}' は、このクラスに対して公開されているアクセス可能なイベントではありません。
ko: DefaultEvent' 특성에 의해 지정된 '{0}' 이벤트의 이 클래스에 대한 액세스 가능성은 public이 아닙니다.
pl: Zdarzenie „{0}” określane przez atrybut „DefaultEvent” nie jest zdarzeniem publicznie dostępnym dla tej klasy.
pt_br: Evento "{0}" especificado pelo atributo "DefaultEvent" não é um evento publicamente acessível para esta classe.
ru: Событие "{0}" с атрибутом "DefaultEvent" не является общедоступным для данного класса.
tr: DefaultEvent' özniteliği tarafından belirtilen '{0}' olayı, bu sınıf için genel olarak erişilebilir bir olay değil.
zh_hans: 由“DefaultEvent”属性指定的事件“{0}”不是该类的公共可访问事件。
zh_hant: DefaultEvent' 屬性所指定的 '{0}' 事件，對此類別而言並非可公開存取的事件。

# ERR_InvalidNonSerializedUsage
source: 'NonSerialized' attribute will not have any effect on this member because its containing class is not exposed as 'Serializable'.
cs: 'Atribut NonSerialized nijak neovlivní tento člen, protože třída, která ho obsahuje, není vystavená jako Serializable.
de: 'Das NonSerialized-Attribut hat auf diesen Member keine Auswirkungen, da die enthaltende Klasse nicht als "Serializable" verfügbar gemacht wurde.
es: 'El atributo 'NonSerialized' no tendrá ningún efecto en este miembro porque su clase contenedora no está expuesta como 'Serializable'.
fr: 'L'attribut 'NonSerialized' n'aura pas d'effet sur ce membre, car sa classe conteneur n'est pas exposée comme 'Serializable'.
it: 'L'attributo 'NonSerialized' non avrà alcun effetto su questo membro perché la classe che lo contiene non è esposta come 'Serializable'.
ja: 'このメンバーを含んでいるクラスが 'Serializable' として公開されていないため、このメンバーに 'NonSerialized' 属性を設定しても効果はありません。
ko: 'NonSerialized' 특성은 포함하는 클래스가 'Serializable'로 노출되지 않으므로 이 멤버에 영향을 주지 않습니다.
pl: 'Atrybut „NonSerialized” nie ma wpływu na tą składową, ponieważ zawierająca ją klasa nie jest ujawniona jako element Serializable.
pt_br: 'O atributo 'NonSerialized' não terá nenhum efeito sobre este membro porque sua classe recipiente não é exposta como 'Serializable'.
ru: 'Атрибут "NonSerialized" не затронет данный член, поскольку класс, содержащий его, не предоставлен как "Serializable".
tr: 'Kapsayan sınıfı 'Serializable' olarak gösterilmediğinden 'NonSerialized' özniteliğinin bu üye üzerinde etkisi olmayacak.
zh_hans: '"NonSerialized" 特性对此成员无效，因为它的包含类不作为 "Serializable" 公开。
zh_hant: 'NonSerialized' 屬性對這個成員將沒有任何作用，因為它的包含類別並未公開為 'Serializable'。

# ERR_ExpectedContinueKind
source: 'Continue' must be followed by 'Do', 'For' or 'While'.
cs: 'Za klíčovým slovem Continue musí následovat klíčové slovo Do, For nebo While.
de: 'Auf "Continue" muss "Do", "For" oder "While" folgen.
es: 'Continue' debe ir seguida de 'Do', 'For' o 'While'.
fr: 'Continue' doit être suivi par 'Do', 'For' ou 'While'.
it: 'Continue' deve essere seguito da 'Do', 'For' o 'While'.
ja: 'Continue' の後には 'Do'、'For'、または 'While' が必要です。
ko: 'Continue' 다음에는 'Do', 'For' 또는 'While'이 와야 합니다.
pl: 'Po instrukcji „Continue” musi następować element „Do”, „For” lub „While”.
pt_br: 'Continue' deve ser seguido por 'Do', 'For' ou 'While'.
ru: 'После "Continue" должны следовать "Do", "For" или "While".
tr: 'Continue' deyiminin ardından 'Do', 'For' veya 'While' gelmelidir.
zh_hans: '“Continue”的后面必须跟有“Do”、“For”或“While”。
zh_hant: 'Continue' 必須在 'Do'、'For' 或 'While' 之前。

# ERR_ContinueDoNotWithinDo
source: 'Continue Do' can only appear inside a 'Do' statement.
cs: 'Klíčové slovo Continue Do se dá použít jenom uvnitř příkazu Do.
de: '"Continue Do" kann nur innerhalb einer Do-Anweisung verwendet werden.
es: 'Continue Do' únicamente puede aparecer dentro de una instrucción 'Do'.
fr: 'Continue Do' ne peut être utilisé qu'à l'intérieur d'une instruction 'Do'.
it: 'Continue Do' può essere specificato solo all'interno di un'istruzione 'Do'.
ja: 'Continue Do' は、'Do' ステートメント内でのみ使用できます。
ko: 'Continue Do'는 'Do' 문 내부에만 사용할 수 있습니다.
pl: 'Element Continue Do może się znajdować tylko w instrukcji Do.
pt_br: 'Continue Do' só pode aparecer dentro de uma instrução 'Do'.
ru: '"Continue Do" может присутствовать только в операторе "Do".
tr: 'Continue Do' yalnızca bir 'Do' deyimi içinde bulunabilir.
zh_hans: '“Continue Do”只能出现在“Do”语句内。
zh_hant: 'Continue Do' 只可以在 'Do' 陳述式中出現。

# ERR_ContinueForNotWithinFor
source: 'Continue For' can only appear inside a 'For' statement.
cs: 'Příkaz Continue For se dá použít jenom v rámci příkazu For.
de: '"Continue For" kann nur innerhalb einer For-Anweisung verwendet werden.
es: 'Continue For' solo puede aparecer dentro de una instrucción 'For'.
fr: 'Continue For' ne peut être utilisé qu'à l'intérieur d'une instruction 'For'.
it: 'Continue For' può essere specificato solo all'interno di un'istruzione 'For'.
ja: 'Continue For' は、'For' ステートメント内でのみ使用できます。
ko: 'Continue For'는 'For' 문 내부에만 사용할 수 있습니다.
pl: 'Element Continue For może się znajdować tylko w instrukcji For.
pt_br: 'Continue For' só pode aparecer dentro de uma instrução 'For'.
ru: '"Continue For" может присутствовать только в операторе "For".
tr: 'Continue For' yalnızca bir 'For' deyimi içinde bulunabilir.
zh_hans: '“Continue For”只能出现在“For”语句内。
zh_hant: 'Continue For' 只可以在 'For' 陳述式中出現。

# ERR_ContinueWhileNotWithinWhile
source: 'Continue While' can only appear inside a 'While' statement.
cs: 'Příkaz Continue While se dá použít jenom v rámci příkazu While.
de: 'Continue While darf nur innerhalb einer While-Anweisung verwendet werden.
es: 'Continue While' solo puede aparecer dentro de una instrucción 'While'.
fr: 'Continue While' ne peut apparaître que dans une instruction 'While'.
it: 'Continue While' può essere specificato solo all'interno di un'istruzione 'While'.
ja: 'Continue While' は、'While' ステートメント内でのみ使用できます。
ko: 'Continue While'은 'While' 문 내부에만 사용할 수 있습니다.
pl: 'Element Continue While może się znajdować tylko w instrukcji While.
pt_br: 'Continue While' só pode aparecer dentro de uma instrução 'While'.
ru: '"Continue While" может присутствовать только в операторе "While".
tr: 'Continue While' yalnızca bir 'While' deyimi içinde bulunabilir.
zh_hans: '“Continue While”只能出现在“While”语句内。
zh_hant: 'Continue While' 只可以在 'While' 陳述式中出現。

# ERR_DuplicateParameterSpecifier
source: Parameter specifier is duplicated.
cs: Specifikátor parametru je duplicitní.
de: Parameterspezifizierer ist doppelt vorhanden.
es: El especificador del parámetro está duplicado.
fr: Le spécificateur de paramètre est en double.
it: L'identificatore del parametro è duplicato.
ja: パラメーター指定子が重複しています。
ko: 매개 변수 지정자가 중복되었습니다.
pl: Specyfikator parametru jest zduplikowany.
pt_br: O especificador de parâmetro está duplicado.
ru: Спецификатор параметра встречается второй раз.
tr: Parametre tanımlayıcı yineleniyor.
zh_hans: 参数说明符重复。
zh_hant: 參數規範重複。

# ERR_ModuleCantUseDLLDeclareSpecifier1
source: 'Declare' statements in a Module cannot be declared '{0}'.
cs: 'Příkazy Declare v modulu nejde deklarovat jako {0}.
de: 'Declare-Anweisungen in einem Modul können nicht als "{0}" deklariert werden.
es: 'Las instrucciones 'Declare' de un módulo no se pueden declarar como '{0}'.
fr: 'Les instructions 'Declare' d'un module ne peuvent pas être déclarées '{0}'.
it: 'Le istruzioni 'Declare' di un modulo non possono essere dichiarate come '{0}'.
ja: 'モジュール内の 'Declare' ステートメントを '{0}' として宣言できません。
ko: '모듈의 'Declare' 문은 '{0}'(으)로 선언할 수 없습니다.
pl: 'Instrukcji „Declare” w module nie można zadeklarować jako „{0}”.
pt_br: 'Instruções "Declare" em um Módulo não podem ser declaradas "{0}".
ru: 'Операторы "Declare" в модуле не могут объявляться как "{0}".
tr: 'Module içindeki 'Declare' deyimleri '{0}' olarak bildirilemez.
zh_hans: '模块中的“Declare”语句不能声明为“{0}”。
zh_hant: 'Module 中的 'Declare' 陳述式不可宣告為 '{0}'。

# ERR_StructCantUseDLLDeclareSpecifier1
source: 'Declare' statements in a structure cannot be declared '{0}'.
cs: 'Příkazy Declare ve struktuře nelze deklarovat jako {0}.
de: 'Declare-Anweisungen in einer Struktur können nicht als "{0}" deklariert werden.
es: 'Las instrucciones 'Declare' de una estructura no se pueden declarar como '{0}'.
fr: 'Les instructions 'Declare' dans une structure ne peuvent pas être déclarées '{0}'.
it: 'Le istruzioni 'Declare' in una struttura non possono essere dichiarate come '{0}'.
ja: '構造体の中の 'Declare' ステートメントを '{0}' と宣言することはできません。
ko: '구조체의 'Declare' 문은 '{0}'(으)로 선언할 수 없습니다.
pl: 'Instrukcji „Declare” w strukturze nie można zadeklarować jako „{0}”.
pt_br: 'Instruções "Declare" em uma estrutura não podem ser declaradas "{0}".
ru: 'Операторы "Declare" в структуре не могут быть объявлены как "{0}".
tr: 'Yapıdaki 'Declare' deyimleri '{0}' olarak bildirilemez.
zh_hans: '结构中的“Declare”语句不能声明为“{0}”。
zh_hant: '結構中的 'Declare' 陳述式不可宣告為 '{0}'。

# ERR_TryCastOfValueType1
source: 'TryCast' operand must be reference type, but '{0}' is a value type.
cs: 'Operand TryCast musí být typ odkazu, ale {0} je typ hodnoty.
de: 'TryCast erfordert einen Referenztyp als Operanden, "{0}" ist jedoch ein Werttyp.
es: 'El operando 'TryCast' debe ser un tipo de referencia, pero '{0}' es un tipo de valor.
fr: 'L'opérande 'TryCast' doit être un type référence, mais '{0}' est un type valeur.
it: 'L'operando 'TryCast' deve essere un tipo riferimento, ma '{0}' è un tipo valore.
ja: 'TryCast' オペランドは参照型でなければなりませんが、'{0}' は値型です。
ko: 'TryCast' 피연산자는 참조 형식이어야 하는데 '{0}'은(는) 값 형식입니다.
pl: 'Argument operacji „TryCast” musi być typem referencyjnym, ale element „{0}” to typ wartości.
pt_br: 'Operando "TryCast" deve ser tipo de referência, mas "{0}" é um tipo de valor.
ru: 'Операнд "TryCast" должен быть ссылочного типа, а "{0}" является типом значения.
tr: 'TryCast' işleneni başvuru türünde olmalıdır, ancak '{0}' öğesi değer türünde.
zh_hans: '“TryCast”操作数必须是引用类型，但“{0}”是值类型。
zh_hant: 'TryCast' 運算元必須要是參考類型，但 '{0}' 是實值類型。

# ERR_TryCastOfUnconstrainedTypeParam1
source: 'TryCast' operands must be class-constrained type parameter, but '{0}' has no class constraint.
cs: 'Operandy TryCast musí být parametry typu s omezením třídy, ale {0} nemá žádné omezení třídy.
de: 'TryCast-Operanden müssen Typparameter mit Klasseneinschränkung sein, aber "{0}" hat keine Klasseneinschränkung.
es: 'Los operandos 'TryCast' deben ser parámetros de tipo con restricción de clase, pero '{0}' no tiene restricción de clase.
fr: 'L'opérande 'TryCast' doit être un paramètre de type contraint par classe, mais '{0}' n'a pas de contrainte de classe.
it: 'L'operando 'TryCast' deve essere un parametro di tipo vincolato a livello di classe. Nessun vincolo di classe è tuttavia contenuto in '{0}'.
ja: 'TryCast' オペランドはクラスの制約がある型パラメーターでなければなりませんが、'{0}' にはクラスの制約がありません。
ko: 'TryCast' 피연산자는 클래스 제약 조건이 있는 형식 매개 변수여야 하는데, '{0}'에는 클래스 제약 조건이 없습니다.
pl: 'Argumenty operacji „TryCast” muszą być parametrami typu z ograniczeniem klasy, ale element „{0}” nie ma ograniczenia klasy.
pt_br: 'Operandos "TryCast" devem ser parâmetro do tipo com restrição de classe, mas "{0}" não tem restrição de classe.
ru: 'Операнды "TryCast" должны быть параметром типа с ограничением класса, а "{0}" не имеет ограничения класса.
tr: 'TryCast' işlenenleri sınıf kısıtlamalı tür parametresi olmalıdır, ancak '{0}' öğesinin sınıf kısıtlaması yok.
zh_hans: '“TryCast”操作数必须是类约束类型参数，但“{0}”没有类约束。
zh_hant: 'TryCast' 運算元必須是具備類別條件約束的類型參數，但 '{0}' 沒有類別條件約束。

# ERR_AmbiguousDelegateBinding2
source: No accessible '{0}' is most specific: {1}
cs: Žádné přístupné {0} není nejvíce specifické: {1}.
de: Keine zugreifbare "{0}" ist am spezifischsten: {1}
es: '{0}' al que no se puede obtener acceso es más específico: {1}
fr: Aucun '{0}' accessible n'est plus spécifique : {1}
it: Nessun elemento '{0}' accessibile è il più specifico: {1}
ja: 最も固有な、アクセス可能な '{0}' がありません: {1}
ko: 액세스할 수 없는 '{0}'은(는) {1}에만 한정됩니다.
pl: Żaden z dostępnych elementów „{0}” nie jest bardziej konkretny od pozostałych: {1}
pt_br: Nenhum "{0}" acessível é mais específico: {1}
ru: Отсутствие доступного "{0}" является наиболее характерным: {1}
tr: Hiçbir erişilebilir '{0}' en belirgin değil: {1}
zh_hans: 没有非常明确的可访问“{0}”: {1}
zh_hant: 沒有最適用的 '{0}' 可供存取: {1}

# ERR_SharedStructMemberCannotSpecifyNew
source: Non-shared members in a Structure cannot be declared 'New'.
cs: Pro nesdílené členy ve struktuře nejde použít deklaraci New.
de: Nicht freigegebene Member in einer Struktur können nicht als "New" deklariert werden.
es: No se pueden declarar como 'New' los miembros no compartidos de una estructura.
fr: Les membres non partagés dans une Structure ne peuvent pas être déclarés 'New'.
it: I membri non condivisi di una struttura non possono essere dichiarati come 'New'.
ja: 構造体内の共有されていないメンバーは 'New' として宣言できません。
ko: 구조체의 멤버 중 비공유 멤버는 'New'로 선언할 수 없습니다.
pl: Nie można zadeklarować nieudostępnionych składowych w strukturze jako „New”.
pt_br: Membros não compartilhados em uma estrutura não podem ser declarados 'New'.
ru: Члены структуры, не являющиеся общими, не могут быть объявлены как "New".
tr: Bir Yapı içindeki paylaşılmayan üyeler 'New' olarak bildirilemez.
zh_hans: Structure 中的非共享成员不能声明为 "New"。
zh_hant: Structure 中的非共用成員不可以宣告為 'New'。

# ERR_GenericSubMainsFound1
source: None of the accessible 'Main' methods with the appropriate signatures found in '{0}' can be the startup method since they are all either generic or nested in generic types.
cs: Žádná z přístupných metod Main s odpovídajícími podpisy nalezených v umístění {0} nemůže být metodou spuštění, protože jsou buď všechny obecné, nebo jsou vnořené v obecných typech.
de: Keine der in "{0}" gefundenen Main-Methoden mit den geeigneten Signaturen, auf die der Zugriff möglich ist, kann als Startmethode verwendet werden, da sie alle entweder generisch oder in generischen Typen geschachtelt sind.
es: Ninguno de los métodos 'Main' accesibles con las firmas adecuadas encontrados en '{0}' puede ser el método de inicio porque son todos genéricos o están anidados en tipos genéricos.
fr: Aucune des méthodes 'Main' accessibles avec les signatures appropriées ayant été trouvées dans '{0}' ne peut être la méthode de démarrage, car elles sont toutes génériques ou imbriquées dans des types génériques.
it: Nessuno dei metodi 'Main' accessibili con le firme appropriate trovati in '{0}' può essere il metodo di avvio perché sono tutti generici o annidati in tipi generici.
ja: '{0}' で見つかった正しいシグネチャを持つ、アクセス可能な 'Main' メソッドは、スタートアップ メソッドにはなりません。それらの 'Main' メソッドはすべてジェネリックまたはジェネリック型の中に入れ子にされているためです。
ko: '{0}'에 있는 적절한 시그니처가 포함된 액세스 가능한 'Main' 메서드는 모두 제네릭이거나 제네릭 형식에 중첩되어 있으므로 시작 메서드일 수 없습니다.
pl: Żadna z dostępnych metod „Main” z odpowiednią sygnaturą znalezionych w elemencie „{0}” nie może być metodą startową, ponieważ są one metodami ogólnymi lub zagnieżdżonymi w typach ogólnych.
pt_br: Nenhum dos métodos "Main" acessíveis com as assinaturas apropriadas encontradas em "{0}" pode ser o método de inicialização porque eles são todos genéricos ou aninhados em tipos genéricos.
ru: Ни один из доступных методов "Main" с подходящими подписями в "{0}" не может быть стартовым методом, поскольку они все либо универсального типа, либо вложены в универсальный тип.
tr: '{0}' içinde bulunan ve uygun imzalara sahip olan erişilebilir 'Main' yöntemlerinin hiçbiri başlangıç yöntemi olamaz çünkü bunlar geneldir veya genel türlerle iç içedir.
zh_hans: 在“{0}”中找到的带有适当签名的可访问“Main”方法要么都是泛型方法，要么嵌套在泛型类型中，因此均不能用作启动方法。
zh_hant: 在 '{0}' 中所找到具有適當簽章之可存取的 'Main' 方法，沒有任何一個可做為啟動方法，因為所有這些方法都可能是泛型類型或是泛型類型中的巢狀類型。

# ERR_GeneralProjectImportsError3
source: Error in project-level import '{0}' at '{1}' : {2}
cs: Chyba při importu na úrovni projektu {0} v {1}: {2}
de: Fehler beim Import "{0}" auf Projektebene bei "{1}": {2}
es: Error en la importación de nivel de proyecto '{0}' en '{1}' : {2}
fr: Erreur dans l'importation au niveau du projet '{0}' à '{1}' : {2}
it: Errore a livello di progetto nell'importazione '{0}' in '{1}': {2}
ja: '{1}' でのプロジェクト レベル インポート '{0}' でエラーが発生しました: {2}
ko: '{1}'에 있는 프로젝트 수준의 가져오기 '{0}'에서 오류가 발생했습니다({2}).
pl: Błąd w imporcie na poziomie projektu „{0}” pod adresem „{1}” : {2}.
pt_br: Erro em importação de nível de projeto "{0}" às "{1}" : {2}
ru: Ошибка импорта на уровне проекта "{0}" в "{1}": {2}
tr: '{0}' proje düzeyi içeri aktarmada '{1}' konumunda hata: {2}
zh_hans: 项目级 import“{0}”中的“{1}”位置出错: {2}
zh_hant: 專案層級的匯入 '{0}' 在 '{1}' 發生錯誤: {2}
