Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_XMLDocNotFirstOnLine
source: XML comment must be the first statement on a line. XML comment will be ignored.
cs: Komentář XML musí být prvním příkazem na řádku. Komentář XML se bude ignorovat.
de: Ein XML-Kommentar muss die erste Anweisung der Zeile sein. Der XML-Kommentar wird ignoriert.
es: El comentario XML debe ser la primera instrucción de una línea. Se omitirá el comentario XML.
fr: Le commentaire XML doit être la première instruction sur une ligne. Le commentaire XML sera ignoré.
it: Il commento XML deve essere la prima istruzione in una riga. Il commento XML verrà ignorato.
ja: XML コメントは行内で最初のステートメントでなければなりません。XML コメントは無視されます。
ko: XML 주석은 줄의 첫 번째 문이어야 합니다. XML 주석이 무시됩니다.
pl: Komentarz XML musi być pierwszą instrukcją w wierszu. Komentarz XML zostanie zignorowany.
pt_br: O comentário XML deve ser a primeira instrução em uma linha. O comentário XML será ignorado.
ru: Комментарий XML должен быть первым оператором строки. Комментарий XML будет игнорироваться.
tr: XML açıklaması satırdaki ilk deyim olmalıdır. XML açıklaması yoksayılacak.
zh_hans: XML 注释必须是一行中的第一条语句。XML 注释将被忽略。
zh_hant: XML 註解必須是該行的第一個陳述式。將會忽略 XML 註解。

# WRN_XMLDocNotFirstOnLine_Title
source: XML comment must be the first statement on a line
cs: Komentář XML musí být první příkaz na řádku.
de: Der XML-Kommentar muss die erste Anweisung in einer Zeile sein.
es: El comentario XML debe ser la primera instrucción de una línea
fr: Le commentaire XML doit être la première instruction d’une ligne
it: Il commento XML deve essere la prima istruzione di una riga
ja: XML コメントは、行の最初のステートメントでなければなりません
ko: XML 주석은 줄의 첫째 문이어야 함
pl: Komentarz XML musi być pierwszą instrukcją w wierszu
pt_br: O comentário XML deve ser a primeira instrução em uma linha
ru: Комментарий XML должен быть первым оператором в строке
tr: XML açıklaması satırdaki ilk deyim olmalıdır
zh_hans: XML 注释必须是一行上的第一条语句
zh_hant: XML 註解必須是該行的第一個陳述式

# WRN_XMLDocInsideMethod
source: XML comment cannot appear within a method or a property. XML comment will be ignored.
cs: Komentář XML se nemůže objevit v rámci metody nebo vlastnosti. Komentář XML se bude ignorovat.
de: Ein XML-Kommentar kann nicht innerhalb einer Methode oder Eigenschaft verwendet werden. Der XML-Kommentar wird ignoriert.
es: El comentario XML no puede aparecer en un método o una propiedad. Se omitirá el comentario XML.
fr: Un commentaire XML ne peut pas figurer dans une méthode ou une propriété. Le commentaire XML sera ignoré.
it: Il commento XML non può essere specificato all'interno di un metodo o di una proprietà. Il commento XML verrà ignorato.
ja: XML コメントは、メソッドまたはプロパティには記述できません。XML コメントは無視されます。
ko: 메서드 또는 속성에는 XML 주석을 사용할 수 없습니다. XML 주석이 무시됩니다.
pl: Komentarz XML nie może występować w metodzie ani właściwości. Komentarz XML zostanie zignorowany.
pt_br: O comentário XML não pode aparecer dentro de um método ou propriedade. O comentário XML será ignorado.
ru: Комментарий XML не может находиться внутри метода или свойства. Комментарий XML будет игнорироваться.
tr: XML açıklaması bir yöntem veya özellik içinde bulunamaz. XML açıklaması yoksayılacak.
zh_hans: XML 注释不能在方法或属性内出现。XML 注释将被忽略。
zh_hant: XML 註解不可出現在方法或屬性中。將會忽略 XML 註解。

# WRN_XMLDocInsideMethod_Title
source: XML comment cannot appear within a method or a property
cs: Komentář XML nemůže být uvnitř metody nebo vlastnosti.
de: Der XML-Kommentar kann nicht in einer Methode oder einer Eigenschaften angezeigt werden.
es: El comentario XML no puede aparecer dentro de un método o de una propiedad
fr: Le commentaire XML ne peut pas apparaître dans une méthode ou une propriété
it: Il commento XML non può essere specificato all'interno di un metodo o di una proprietà
ja: XML コメントは、メソッドまたはプロパティ内では使用できません
ko: 메서드 또는 속성 내에 XML 주석이 표시될 수 없음
pl: Komentarz XML nie może występować w metodzie ani właściwości
pt_br: O comentário XML não pode aparecer em um método ou propriedade
ru: Комментарий XML не должен содержаться в методе или свойстве
tr: XML açıklaması bir metot veya özellik içinde bulunamaz
zh_hans: XML 注释不能在方法或属性内出现
zh_hant: XML 註解不得出現在方法或屬性中

# WRN_XMLDocParseError1
source: XML documentation parse error: {0} XML comment will be ignored.
cs: Při analýze dokumentace XML došlo k chybě: {0}. Komentář XML se bude ignorovat.
de: Analysefehler in XML-Dokumentation: "{0}". Der XML-Kommentar wird ignoriert.
es: Error de análisis de la documentación XML: se omitirá el comentario XML {0}.
fr: Erreur d'analyse de la documentation XML : le commentaire XML {0} sera ignoré.
it: Errore di analisi nella documentazione XML: il commento XML '{0}' verrà ignorato.
ja: XML ドキュメント解析エラー: {0} XML コメントは無視されます。
ko: XML 문서 구문 분석 오류: {0} XML 주석이 무시됩니다.
pl: Błąd analizowania dokumentacji XML: komentarz XML {0} zostanie zignorowany.
pt_br: Erro de análise de documentação XML: {0} comentário XML será ignorado.
ru: Ошибка синтаксического анализа документации XML: Комментарий XML {0} будет игнорироваться.
tr: XML belgesi ayrıştırma hatası: {0} XML açıklaması yoksayılacak.
zh_hans: XML 文档分析错误: {0} XML 注释将被忽略。
zh_hant: XML 文件剖析錯誤: {0} 將會忽略 XML 註解。

# WRN_XMLDocParseError1_Title
source: XML documentation parse error
cs: Chyba analýzy dokumentace XML
de: Analysefehler in XML-Dokumentation
es: Error de análisis de la documentación XML
fr: Erreur d'analyse de la documentation XML
it: Errore di analisi della documentazione XML
ja: XML ドキュメントの解析エラーです
ko: XML 문서 구문 분석 오류
pl: Błąd analizowania dokumentacji XML
pt_br: Erro de análise de documentação XML
ru: Ошибка анализа документации XML
tr: XML belgesi ayrıştırma hatası
zh_hans: XML 文档分析错误
zh_hant: XML 文件剖析錯誤

# WRN_XMLDocDuplicateXMLNode1
source: XML comment tag '{0}' appears with identical attributes more than once in the same XML comment block.
cs: Značka komentáře XML {0} se objevuje s identickými atributy víc než jednou ve stejném bloku komentáře XML.
de: Die XML-Kommentarkennung "{0}" kommt mehrmals mit identischen Attributen im gleichen XML-Kommentarblock vor.
es: La etiqueta de comentario XML '{0}' aparece con atributos idénticos más de una vez en el mismo bloque de comentario XML.
fr: La balise de commentaire XML '{0}' s'affiche avec des attributs identiques plusieurs fois dans le même bloc de commentaires XML.
it: Il tag '{0}' del commento XML è presente più volte con attributi identici nello stesso blocco di commento XML.
ja: 同一の属性を伴う XML コメント タグ '{0}' が同じ XML コメント ブロック内に複数回記述されています。
ko: 특성이 같은 '{0}' XML 주석 태그가 동일한 XML 주석 블록에서 두 번 이상 나타납니다.
pl: Tag komentarza XML „{0}” występuje z identycznymi atrybutami więcej niż raz w tym samym bloku komentarza XML.
pt_br: Marca de comentário XML "{0}" aparece com atributos idênticos mais de uma vez no mesmo bloco de comentários XML.
ru: Тег "{0}" комментария XML с одинаковыми атрибутами более одного раза появляется в том же блоке комментариев XML.
tr: '{0}' XML açıklama etiketi, özdeş özniteliklerle aynı XML açıklama bloğunda birden çok kez geçiyor.
zh_hans: 具有相同特性的 XML 注释标记“{0}”在同一 XML 注释块中出现多次。
zh_hant: 在同一個 XML 註解區塊中，XML 註解標記 '{0}' 使用相同的屬性出現多次。

# WRN_XMLDocDuplicateXMLNode1_Title
source: XML comment tag appears with identical attributes more than once in the same XML comment block
cs: Značka komentáře XML s identickými atributy se vyskytuje ve stejném bloku komentáře XML víc než jednou.
de: Die XML-Kommentarkennung wird in demselben XML-Kommentarblock mehrmals mit identischen Attributen angezeigt.
es: La etiqueta de comentario XML aparece con atributos idénticos más de una vez en el mismo bloque de comentario XML
fr: La balise de commentaire XML apparaît plusieurs fois avec des attributs identiques dans le même bloc de commentaire XML
it: Il tag del commento XML è presente più volte con attributi identici nello stesso blocco di commento XML
ja: 同一の属性を伴う XML コメント タグが同じ XML コメント ブロック内に複数回記述されています
ko: 특성이 같은 XML 주석 태그가 동일한 XML 주석 블록에서 두 번 이상 나타남
pl: Tag komentarza XML występuje z identycznymi atrybutami więcej niż raz w tym samym bloku komentarza XML
pt_br: A marca de comentário XML apresenta atributos idênticos mais de uma vez no mesmo bloco de comentário XML
ru: Тег комментария XML с идентичными атрибутами встречается больше одного раза в одном блоке комментариев XML
tr: Özdeş özniteliklere sahip XML açıklama etiketi, aynı XML açıklama bloğunda bir kereden fazla görünüyor
zh_hans: 具有相同属性的 XML 注释标记在同一个 XML 注释块中出现多次
zh_hant: 在相同的 XML 註解區塊中，XML 註解標記以相同的屬性出現多次

# WRN_XMLDocIllegalTagOnElement2
source: XML comment tag '{0}' is not permitted on a '{1}' language element.
cs: Značka komentáře XML {0} není povolená u elementu jazyka {1}.
de: Die XML-Kommentarkennung "{0}" ist für {1}-Sprachelemente nicht zulässig.
es: La etiqueta de comentario XML '{0}' no se permite en un elemento de idioma '{1}'.
fr: La balise de commentaire XML '{0}' n'est pas autorisée dans un élément de langage '{1}'.
it: Il tag '{0}' del commento XML non è consentito in un elemento di linguaggio '{1}'.
ja: XML コメント タグ '{0}' は '{1}' 言語要素上では許可されていません。
ko: '{0}' XML 주석 태그는 '{1}' 언어 요소에서 허용되지 않습니다.
pl: Tag komentarza XML „{0}” nie jest dozwolony w elemencie języka „{1}”.
pt_br: A marca de comentário XML "{0}" não é permitida em um elemento de linguagem "{1}".
ru: Тег комментария XML "{0}" недопустим для элемента языка "{1}".
tr: '{1}' dil öğesinde '{0}' XML açıklama etiketine izin verilmez.
zh_hans: “{1}”语言元素中不允许 XML 注释标记“{0}”。
zh_hant: '{1}' 語言元素上不可使用 XML 註解標記 '{0}'。

# WRN_XMLDocIllegalTagOnElement2_Title
source: XML comment tag is not permitted on language element
cs: Značka komentáře XML není v elementu jazyka povolená.
de: Die XML-Kommentarkennung ist im Sprachelement nicht zulässig.
es: No se permite la etiqueta de comentario XML en un elemento de idioma
fr: La balise de commentaire XML n’est pas autorisée sur un élément de langue
it: Il tag del commento XML non è consentito in un elemento di linguaggio
ja: XML コメント タグは言語要素上では許可されていません
ko: XML 주석 태그는 언어 요소에 사용할 수 없음
pl: Tag komentarza XML nie jest dozwolony w elemencie języka
pt_br: A marca de comentário XML não é permitida em um elemento de linguagem
ru: Тег комментария XML запрещен в элементе языка
tr: Dil öğesinde XML açıklama etiketine izin verilmiyor
zh_hans: 语言元素中不允许出现 XML 注释标记
zh_hant: 語言項目上不得有 XML 註解標記

# WRN_XMLDocBadParamTag2
source: XML comment parameter '{0}' does not match a parameter on the corresponding '{1}' statement.
cs: Parametr komentáře XML {0} neodpovídá parametru u odpovídajícího příkazu {1}.
de: Der XML-Kommentarparameter "{0}" stimmt mit keinem Parameter in der entsprechenden {1}-Anweisung überein.
es: El parámetro de comentario XML '{0}' no coincide con un parámetro de la instrucción '{1}' correspondiente.
fr: Le paramètre de commentaire XML '{0}' ne correspond pas à un paramètre pour l'instruction '{1}' correspondante.
it: Il parametro '{0}' del commento XML non corrisponde a un parametro nell'istruzione '{1}' corrispondente.
ja: XML コメント パラメーター '{0}' が対応する '{1}' ステートメント上のパラメーターと一致しません。
ko: '{0}' XML 주석 매개 변수가 해당 '{1}' 문의 매개 변수와 일치하지 않습니다.
pl: Parametr komentarza XML „{0}” nie jest zgodny z parametrem w odpowiedniej instrukcji „{1}”.
pt_br: Parâmetro de comentário XML "{0}" não corresponde um parâmetro na instrução "{1}" correspondente.
ru: Параметр комментария XML "{0}" не соответствует параметру соответствующего оператора "{1}".
tr: '{0}' açıklama türü parametresi, buna karşılık gelen '{1}' deyimindeki bir parametreyle eşleşmiyor.
zh_hans: XML 注释参数“{0}”和相应的“{1}”语句的参数不匹配。
zh_hant: XML 註解參數 '{0}' 與對應的 '{1}' 陳述式上之參數不相符。

# WRN_XMLDocBadParamTag2_Title
source: XML comment parameter does not match a parameter on the corresponding declaration statement
cs: Parametr komentáře XML neodpovídá parametru u odpovídajícího příkazu deklarace.
de: Der XML-Kommentarparameter stimmt nicht mit einem Parameter in der entsprechenden Deklarationsanweisung überein.
es: El parámetro de comentario XML no coincide con un parámetro en la instrucción de declaración correspondiente
fr: Le paramètre du commentaire XML ne correspond pas à un paramètre pour l’instruction de déclaration correspondante
it: Il parametro del commento XML non corrisponde a un parametro nell'istruzione declaration corrispondente
ja: XML コメントのパラメーターが、対応する宣言ステートメント上のパラメーターと一致しません
ko: XML 주석 매개 변수가 해당 선언 문의 매개 변수와 일치하지 않음
pl: Parametr komentarza XML jest niezgodny z parametrem w odpowiedniej instrukcji deklaracji
pt_br: O parâmetro de comentário XML não coincide com um parâmetro na instrução de declaração correspondente
ru: Параметр комментария XML не совпадает с параметром в соответствующем операторе объявления
tr: XML açıklama türü parametresi, ilgili bildirim deyimindeki bir parametreyle eşleşmiyor
zh_hans: XML 注释参数与相应的声明语句上的参数不匹配
zh_hant: XML 註解參數與對應的宣告陳述式上的參數不相符

# WRN_XMLDocParamTagWithoutName
source: XML comment parameter must have a 'name' attribute.
cs: Parametr komentáře XML musí mít atribut name.
de: XML-Kommentarparameter müssen ein name-Attribut aufweisen.
es: El parámetro de comentario XML debe tener un atributo 'name'.
fr: Le paramètre de commentaire XML doit avoir un attribut 'name'.
it: Il parametro di commento XML deve avere un attributo 'name'.
ja: XML コメント パラメーターには 'name' 属性を指定しなければなりません。
ko: XML 주석 매개 변수에는 'name' 특성이 있어야 합니다.
pl: Parametr komentarza XML musi mieć atrybut „name”.
pt_br: Parâmetro de comentário XML deve ter um atributo "name".
ru: Параметр комментария XML должен содержать атрибут "name".
tr: XML açıklama parametresinin 'name' özniteliği olmalıdır.
zh_hans: XML 注释参数必须具有 "name" 属性。
zh_hant: XML 註解參數必須要有 'name' 屬性。

# WRN_XMLDocParamTagWithoutName_Title
source: XML comment parameter must have a 'name' attribute
cs: Parametr komentáře XML musí mít atribut name.
de: XML-Kommentarparameter müssen ein name-Attribut aufweisen.
es: El parámetro de comentario XML debe tener un atributo 'name'
fr: Le paramètre de commentaire XML doit avoir un attribut 'name'
it: Il parametro di commento XML deve avere un attributo 'name'
ja: XML コメント パラメーターには 'name' 属性がなければなりません
ko: XML 주석 매개 변수에는 'name' 특성이 있어야 함
pl: Parametr komentarza XML musi mieć atrybut „name”
pt_br: O parâmetro de comentário XML deve ter um atributo 'name'
ru: Параметр комментария XML должен содержать атрибут name
tr: XML açıklama parametresinin 'name' özniteliği olmalıdır
zh_hans: XML 注释参数必须具有 "name" 属性
zh_hant: XML 註解參數必須要有 'name' 屬性

# WRN_XMLDocCrefAttributeNotFound1
source: XML comment has a tag with a 'cref' attribute '{0}' that could not be resolved.
cs: Komentář XML má značku s atributem cref {0}, kterou nebylo možné rozpoznat. Komentář XML se bude ignorovat.
de: Der XML-Kommentar enthält eine Kennung mit dem cref-Attribut "{0}", das nicht aufgelöst werden konnte.
es: El comentario XML tiene una etiqueta con un atributo 'cref' '{0}' que no se pudo resolver.
fr: Le commentaire XML a une balise avec un attribut 'cref' '{0}' qui n'a pas pu être résolu.
it: Il commento XML contiene un tag con un attributo 'cref' '{0}' che non è stato possibile risolvere.
ja: XML コメントには、解決できなかった 'cref' 属性 '{0}' を伴うタグがあります。
ko: XML 주석에 확인할 수 없는 'cref' 특성('{0}')이 포함된 태그가 있습니다.
pl: Komentarz XML ma tag z atrybutem „cref” „{0}”, którego nie można rozpoznać.
pt_br: O comentário XML tem uma marca com um atributo "cref" "{0}" que não pode ser resolvido.
ru: Комментарий XML содержит тег с атрибутом "cref" "{0}", который не удается разрешить.
tr: XML açıklamasında, çözülemeyen '{0}' 'cref' özniteliğine sahip bir etiket var.
zh_hans: XML 注释中的一个标记具有未能解析的“cref”特性“{0}”。
zh_hant: XML 註解的標記具有無法解析的 'cref' 屬性 '{0}'。

# WRN_XMLDocCrefAttributeNotFound1_Title
source: XML comment has a tag with a 'cref' attribute that could not be resolved
cs: V komentáři XML je značka s atributem cref, který se nedá přeložit.
de: Der XML-Kommentar enthält eine Kennung mit dem cref-Attribut, das nicht aufgelöst werden konnte.
es: El comentario XML tiene una etiqueta con un atributo 'cref' que no se pudo resolver
fr: Le commentaire XML possède une balise avec un attribut 'cref' qui n’a pas pu être résolu
it: Il commento XML contiene un tag con un attributo 'cref' che non è stato possibile risolvere
ja: XML コメントに、解決できない 'cref' 属性が指定されたタグが含まれています
ko: XML 주석에 확인할 수 없는 'cref' 특성이 포함된 태그가 있음
pl: Komentarz XML ma tag z atrybutem „cref”, którego nie można rozpoznać
pt_br: O comentário XML tem uma marca com um atributo 'cref' que não pode ser resolvido
ru: Комментарий XML содержит тег с атрибутом cref, который не удалось разрешить
tr: XML açıklamasında, çözümlenemeyen 'cref' özniteliğini içeren bir etiket var
zh_hans: XML 注释包含具有无法解析的 "cref" 属性的标记
zh_hant: XML 註解的標記具有無法解析的 'cref' 屬性

# WRN_XMLMissingFileOrPathAttribute1
source: XML comment tag 'include' must have a '{0}' attribute. XML comment will be ignored.
cs: Značka include komentáře XML musí mít atribut {0}. Komentář XML se bude ignorovat.
de: Die XML-Kommentarkennung "include" muss ein {0}-Attribut aufweisen. Der XML-Kommentar wird ignoriert.
es: La etiqueta de comentario XML 'include' debe tener un atributo '{0}'. Se omitirá el comentario XML.
fr: La balise de commentaire XML 'include' doit avoir un attribut '{0}'. Le commentaire XML sera ignoré.
it: Il tag 'include' del commento XML deve avere un attributo '{0}'. Il commento XML verrà ignorato.
ja: XML コメント タグ 'include' には '{0}' 属性を指定しなければなりません。XML コメントは無視されます。
ko: XML 주석 태그 'include'에는 '{0}' 특성이 있어야 합니다. XML 주석이 무시됩니다.
pl: Tag komentarza XML „include” musi mieć atrybut „{0}”. Komentarz XML zostanie zignorowany.
pt_br: A marca de comentário XML "include" deve ter um atributo "{0}". Comentário XML será ignorado.
ru: Тег комментария XML "include" должен содержать атрибут "{0}". Комментарий XML будет игнорироваться.
tr: include' XML açıklama etiketinin '{0}' özniteliği olmalıdır. XML açıklaması yoksayılacak.
zh_hans: XML 注释标记“include”必须具有“{0}”特性。XML 注释将被忽略。
zh_hant: XML 註解標記 'include' 必須要有 '{0}' 屬性。將會忽略 XML 註解。

# WRN_XMLMissingFileOrPathAttribute1_Title
source: XML comment tag 'include' must have 'file' and 'path' attributes
cs: Značka komentáře XML include musí mít atributy file a path.
de: Die XML-Kommentarkennung "include" muss die Attribute "file" und "path" aufweisen.
es: La etiqueta de comentario XML 'include' debe tener los atributos 'file' y 'path'
fr: La balise de commentaire XML 'include' doit comporter les attributs 'file' et 'path'
it: Il tag 'include' del commento XML deve contenere gli attributi 'file' e 'path'
ja: XML コメント タグ 'include' には、'file' 属性と 'path' 属性が必要です
ko: XML 주석 태그 'include'에는 'file' 및 'path' 특성이 있어야 함
pl: Tag komentarza XML „include” musi mieć atrybuty „file” i „path”
pt_br: A marca de comentário XML 'include' deve ter atributos 'file' e 'path'
ru: Тег комментария XML "include" должен иметь атрибуты file и path
tr: include' XML açıklama etiketi 'file' ve 'path' özniteliklerini içermelidir
zh_hans: XML 注释标记 "include" 必须具有 "file" 和 "path" 特性
zh_hant: XML 註解標記 'include' 必須要有 'file' 和 'path' 屬性

# WRN_XMLCannotWriteToXMLDocFile2
source: Unable to create XML documentation file '{0}': {1}
cs: Nejde vytvořit soubor dokumentace XML {0}: {1}.
de: Die XML-Dokumentationsdatei "{0}" konnte nicht erstellt werden: {1}
es: No se puede crear el archivo de documentación XML '{0}': {1}
fr: Impossible de créer un fichier de documentation XML '{0}' : {1}
it: Non è possibile creare il file di documentazione XML '{0}': {1}
ja: XML ドキュメント ファイル '{0}' を作成できません: {1}
ko: XML 문서 파일 '{0}'을(를) 만들 수 없습니다({1}).
pl: Nie można utworzyć pliku XML dokumentacji „{0}”: {1}
pt_br: Não é possível criar o arquivo de documentação XML "{0}": {1}
ru: Не удается создать файл XML-документации "{0}": {1}
tr: '{0}' XML belge dosyası oluşturulamadı: {1}
zh_hans: 无法创建 XML 文档文件“{0}”: {1}
zh_hant: 無法建立 XML 文件檔 '{0}': {1}

# WRN_XMLCannotWriteToXMLDocFile2_Title
source: Unable to create XML documentation file
cs: Nedá se vytvořit soubor dokumentace XML.
de: Die XML-Dokumentationsdatei kann nicht erstellt werden.
es: No se puede crear el archivo de documentación XML
fr: Impossible de créer un fichier de documentation XML
it: Non è possibile creare il file di documentazione XML
ja: XML ドキュメント ファイルを作成できません
ko: XML 문서 파일을 만들 수 없음
pl: Nie można utworzyć pliku XML dokumentacji
pt_br: Não é possível criar o arquivo de documentação XML
ru: Не удалось создать XML-файл документации
tr: XML belge dosyası oluşturulamıyor
zh_hans: 无法创建 XML 文档文件
zh_hant: 無法建立 XML 文件檔

# WRN_XMLDocWithoutLanguageElement
source: XML documentation comments must precede member or type declarations.
cs: Komentáře dokumentace XML se musí nacházet před deklaracemi členů a typů.
de: XML-Dokumentationskommentare müssen vor Member- oder Typdeklarationen stehen.
es: Los comentarios de documentación XML deben preceder a las declaraciones de miembros o tipos.
fr: Les commentaires de documentation XML doivent précéder les déclarations de membre ou de type.
it: I commenti in formato documentazione XML devono precedere le dichiarazioni di membro o di tipo.
ja: XML ドキュメント コメントは、メンバー宣言や型宣言より前に記述しなければなりません。
ko: XML 문서 주석은 멤버 또는 형식 선언 앞에 와야 합니다.
pl: Komentarze dokumentacji XML muszą występować przed deklaracjami składowej lub typu.
pt_br: O comentário da documentação XML deve preceder as declarações de membro ou tipo.
ru: Комментарии XML-документации должны предшествовать объявлениям членов или типов.
tr: XML belge açıklamaları üye veya tür bildirimlerinden önce gelmelidir.
zh_hans: XML 文档注释必须位于成员声明或类型声明之前。
zh_hant: XML 文件註解必須在成員或類型宣告之前。

# WRN_XMLDocWithoutLanguageElement_Title
source: XML documentation comments must precede member or type declarations
cs: Komentáře dokumentace XML musí být umístěné před deklaracemi členů a typů.
de: XML-Dokumentationskommentare müssen vor Member- oder Typdeklarationen stehen.
es: Los comentarios de documentación XML deben preceder a las declaraciones de miembros o tipos
fr: Les commentaires de documentation XML doivent précéder les déclarations de membre ou de type
it: I commenti in formato documentazione XML devono precedere le dichiarazioni di membro o di tipo
ja: XML ドキュメント コメントは、メンバー宣言や型宣言より前に記述しなければなりません
ko: XML 문서 주석은 멤버 또는 형식 선언 앞에 와야 함
pl: Komentarze dokumentacji XML muszą występować przed deklaracjami składowej lub typu
pt_br: O comentário da documentação XML deve preceder as declarações de membro ou tipo
ru: Комментарии XML-документации должны предшествовать объявлениям членов или типов
tr: XML belge açıklamaları üye veya tür bildirimlerinden önce gelmelidir
zh_hans: XML 文档注释必须位于成员声明或类型声明之前
zh_hant: XML 文件註解必須在成員或類型宣告之前

# WRN_XMLDocReturnsOnWriteOnlyProperty
source: XML comment tag 'returns' is not permitted on a 'WriteOnly' Property.
cs: Značka komentáře XML returns není u vlastnosti WriteOnly povolená.
de: Die XML-Kommentarkennung "returns" ist für eine WriteOnly-Eigenschaft nicht zulässig.
es: No se permite la etiqueta de comentario XML 'returns' en una propiedad 'WriteOnly'.
fr: La balise de commentaire XML 'returns' n'est pas autorisée pour une propriété 'WriteOnly'.
it: Il tag 'returns' del commento XML non è consentito in una proprietà 'WriteOnly'.
ja: XML コメント タグ 'returns' は、'WriteOnly' プロパティに許可されていません。
ko: XML 주석 태그 'returns'는 'WriteOnly' 속성에 사용할 수 없습니다.
pl: Tag komentarza XML „returns” jest niedozwolony we właściwości „WriteOnly”.
pt_br: A marca de comentário XML "returns" não é permitida em uma Propriedade "WriteOnly".
ru: Тег комментария XML "returns" недопустим для свойства "WriteOnly".
tr: WriteOnly' Özelliğinde 'returns' XML açıklama etiketine izin verilmez.
zh_hans: WriteOnly 属性中不允许有 XML 注释标记 "returns"。
zh_hant: WriteOnly' 屬性上不可使用 XML 註解標記 'returns'。
