Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_TypeInferenceFailureNoBest2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments because they do not convert to the same type. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}, protože nejsou převoditelné na stejný typ. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments, car ils ne sont pas convertis vers le même type. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti perché non vengono convertiti nello stesso tipo. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、同じ型に変換されないため、できません。データ型を明示的に指定することによって、このエラーを修正できる場合があります。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 '{0}' 메서드에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”, ponieważ nie można konwertować ich na ten sam typ. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos porque eles não convertem para o mesmo tipo. Especificar o(s) tipo(s) de dados explicitamente talvez corrija esse erro.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов, потому что они не преобразованы в тот же тип. Явное указание типов данных может исправить эту ошибку.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型，因为这些数据类型不会转换为同一类型。显式指定数据类型可更正此错误。
zh_hant: 因為引數不會轉換成相同類型，所以無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。

# ERR_TypeInferenceFailureNoBest3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments because they do not convert to the same type. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nelze odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}, protože nejsou převoditelné na stejný typ. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments, car ils ne sont pas convertis vers le même type. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti perché non vengono convertiti nello stesso tipo. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: '{1}' で定義されている拡張メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、複数の型の可能性があるため、できません。データ型を明示的に指定することによって、このエラーを修正できる場合があります。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'의 형식 매개 변수에 대한 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”, ponieważ nie można konwertować ich na ten sam typ. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos porque eles não convertem para o mesmo tipo. Especificar o(s) tipo(s) de dados explicitamente talvez corrija esse erro.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в {1}", не могут быть получены из этих аргументов, потому что они не преобразованы в тот же тип. Явное указание типов данных может исправить эту ошибку.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断“{1}”中定义的扩展方法“{0}”中类型形参的数据类型，因为这些数据类型不会转换为同一类型。显式指定数据类型可更正此错误。
zh_hant: 因為引數不會轉換成相同類型，所以無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。

# ERR_TypeInferenceFailureNoExplicitNoBest1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments because they do not convert to the same type.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu, protože nejsou převoditelné na stejný typ.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments, car ils ne sont pas convertis vers le même type.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti perché non vengono convertiti nello stesso tipo.
ja: 同じ型に変換されない引数があるため、型パラメーターのデータ型を、これらの引数から推論することはできません。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu, ponieważ nie można konwertować ich na jeden typ.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos porque eles não são convertidos no mesmo tipo.
ru: Типы данных параметров типов не могут быть определены из этих аргументов, так как они не могут быть приведены к одному типу.
tr: Tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断类型形参的数据类型，因为这些数据类型不会转换为同一类型。
zh_hant: 無法從這些引數推斷類型參數的資料類型，因為它們不會轉換成相同類型。

# ERR_TypeInferenceFailureNoExplicitNoBest2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments because they do not convert to the same type.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}, protože nejsou převoditelné na stejný typ.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments, car ils ne sont pas convertis vers le même type.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti perché non vengono convertiti nello stesso tipo.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、同じ型に変換されないため、できません。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 '{0}' 메서드의 형식 매개 변수에 대한 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”, ponieważ nie można konwertować ich na ten sam typ.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos porque eles não convertem para o mesmo tipo.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов, потому что они не преобразованы в тот же тип.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型，因为这些数据类型不会转换为同一类型。
zh_hant: 因為引數不會轉換成相同類型，所以無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。

# ERR_TypeInferenceFailureNoExplicitNoBest3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments because they do not convert to the same type.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}, protože nejsou převoditelné na stejný typ.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments, car ils ne sont pas convertis vers le même type.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti perché non vengono convertiti nello stesso tipo.
ja: '{1}' で定義されている拡張メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、同じ型に変換されないため、できません。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'의 형식 매개 변수에 대한 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”, ponieważ nie można konwertować ich na ten sam typ.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos porque eles não convertem para o mesmo tipo.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в {1}", не могут быть получены из этих аргументов, потому что они не преобразованы в тот же тип.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断“{1}”中定义的扩展方法“{0}”中类型形参的数据类型，因为这些数据类型不会转换为同一类型。
zh_hant: 因為引數不會轉換成相同類型，所以無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。

# ERR_DelegateBindingMismatchStrictOff2
source: Option Strict On does not allow narrowing in implicit type conversions between method '{0}' and delegate '{1}'.
cs: Možnost Strict On nepovoluje zúžení v implicitních převodech typů mezi metodou {0} a s delegátem {1}.
de: "Option Strict On" erlaubt keine Einschränkungen in impliziten Typkonvertierungen zwischen der {0}-Methode und dem Delegaten "{1}".
es: Option Strict On no permite restricciones en conversiones de tipo implícitas entre el método '{0}' y el delegado '{1}'.
fr: Option Strict On n'autorise pas les conversions restrictives lors des conversions de types implicites entre la méthode '{0}' et le délégué '{1}'.
it: Option Strict On non consente la riduzione in conversioni implicite di tipi tra il metodo '{0}' e il delegato '{1}'.
ja: Option Strict On では、メソッド '{0}' とデリゲート '{1}' 間の暗黙的な型の縮小変換は許可されていません。
ko: Option Strict On에서는 '{0}' 메서드와 '{1}' 대리자 사이의 암시적 형식 변환에 축소 변환을 사용할 수 없습니다.
pl: Ustawienie Option Strict On nie zezwala na zawężanie w niejawnych konwersjach typów między metodą „{0}” a delegatem „{1}”.
pt_br: Option Strict On não permite restrição em conversões de tipo implícito entre o método "{0}" e delegado "{1}".
ru: Параметр Strict On не разрешает сужение в преобразованиях явного типа между методом '{0}' и делегатом '{1}'.
tr: Option Strict On, '{0}' yöntemiyle '{1}' temsilcisi arasındaki örtük tür dönüştürmelerinde daraltmaya izin vermiyor.
zh_hans: Option Strict On 不允许对方法“{0}”和委托“{1}”之间的隐式类型转换进行收缩。
zh_hant: Option Strict 為 On 時，不可縮減方法 '{0}' 與委派 '{1}' 之間隱含的類型轉換。

# ERR_InaccessibleReturnTypeOfMember2
source: '{0}' is not accessible in this context because the return type is not accessible.
cs: 'Funkce {0} není v tomto kontextu dostupná, protože není k dispozici její návratový typ.
de: 'Auf "{0}" kann in diesem Kontext nicht zugegriffen werden, da auf den Rückgabetyp nicht zugegriffen werden kann.
es: '{0}' no es accesible en este contexto porque el tipo de valor devuelto no es accesible.
fr: '{0}' n'est pas accessible dans ce contexte, car le type de retour n'est pas accessible.
it: '{0}' non è accessibile in questo contesto perché il tipo restituito non è accessibile.
ja: '戻り値の型にアクセスできないため、このコンテキストでは '{0}' にアクセスできません。
ko: '반환 형식에 액세스할 수 없으므로 이 컨텍스트에서 '{0}'에 액세스할 수 없습니다.
pl: 'Element „{0}” nie jest dostępny w tym kontekście, ponieważ typ zwracany jest niedostępny.
pt_br: "{0}" não está acessível neste contexto porque o tipo de retorno não está acessível.
ru: "{0}" в этом контексте недоступен, так как недоступен возвращаемый тип.
tr: 'Dönüş türü erişilebilir olmadığından, bu bağlamda '{0}' erişilebilir değil.
zh_hans: '“{0}”是不可访问的返回类型，因此它在此上下文中不可访问。
zh_hant: '無法在此內容中存取 '{0}'，因為無法存取傳回類型。

# ERR_ExpectedIdentifierOrGroup
source: 'Group' or an identifier expected.
cs: 'Očekávalo se klíčové slovo group nebo identifikátor.
de: '"Group" oder Bezeichner erwartet.
es: 'Se esperaba 'Group' o un identificador.
fr: 'Group' ou identificateur attendu.
it: 'È previsto 'Group' o un identificatore.
ja: 'Group' または識別子が必要です。
ko: 'Group' 또는 식별자가 필요합니다.
pl: 'Oczekiwano elementu „Group” lub identyfikatora.
pt_br: 'Group' ou identificador esperado.
ru: 'Требуется "Group" или идентификатор.
tr: 'Group' veya bir tanımlayıcı bekleniyor.
zh_hans: '应为“Group”或标识符。
zh_hant: '必須是 'Group' 或識別項。

# ERR_UnexpectedGroup
source: 'Group' not allowed in this context; identifier expected.
cs: 'V tomto kontextu nejde použít klíčové slovo group. Byl očekáván identifikátor.
de: '"Group" in diesem Kontext unzulässig; Bezeichner erwartet.
es: 'No se permite 'Group' en este contexto; se esperaba un identificador.
fr: 'Group' n'est pas autorisé dans ce contexte ; identificateur attendu.
it: 'Group' non consentito in questo contesto. È previsto l'identificatore.
ja: 'Group' はこのコンテキストで許可されていません。識別子を指定してください。
ko: '이 컨텍스트에서는 'Group'을 사용할 수 없습니다. 식별자가 필요합니다.
pl: 'Element „Group” jest niedozwolony w tym kontekście; oczekiwano identyfikatora.
pt_br: 'Group' não permitido neste contexto; identificador esperado.
ru: 'В данном контексте "Group" не разрешено; ожидался идентификатор.
tr: 'Bu bağlamda 'Group' öğesine izin verilmiyor; tanımlayıcı bekleniyor.
zh_hans: '此上下文中不允许 "Group"；应为标识符。
zh_hant: '此內容中不允許 'Group'; 必須是識別項。

# ERR_DelegateBindingMismatchStrictOff3
source: Option Strict On does not allow narrowing in implicit type conversions between extension method '{0}' defined in '{2}' and delegate '{1}'.
cs: Možnost Strict On neumožňuje zúžení implicitních převodů typu mezi metodou rozšíření {0} definovanou v {2} a s delegátem {1}.
de: "Option Strict On" lässt das Einschränken impliziter Typkonvertierungen zwischen der {0}-Erweiterungsmethode, die in "{2}" definiert ist, und dem Delegaten "{1}" nicht zu.
es: Option Strict On no permite reducciones en conversiones de tipo implícito entre el método de extensión '{0}' definido en '{2}' y el delegado '{1}'.
fr: Option Strict On n'autorise pas les conversions restrictives lors des conversions de types implicites entre la méthode d'extension '{0}' définie dans '{2}' et le délégué '{1}'.
it: Option Strict On non consente la riduzione in conversioni implicite di tipi tra il metodo di estensione '{0}' definito in '{2}' e il delegato '{1}'.
ja: Option Strict On では、'{2}' で定義された拡張メソッド '{0}' とデリゲート '{1}' 間の暗黙的な型の縮小変換は許可されていません。
ko: Option Strict On에서는 '{2}'에 정의된 확장 메서드 '{0}'과(와) '{1}' 대리자 사이의 암시적 형식 변환에 축소 변환을 사용할 수 없습니다.
pl: Ustawienie Option Strict On nie zezwala na zawężanie w niejawnych konwersjach typów między metodą rozszerzenia „{0}” zdefiniowaną w elemencie „{2}” a delegatem „{1}”.
pt_br: Opção Strict On não permite restrição em conversões de tipo implícito entre o método de extensão "{0}" definido em "{2}" e delegado "{1}".
ru: Параметр Strict On не разрешает сужение в преобразованиях явного типа между методом расширения "{0}", определенным в "{2}", и делегатом "{1}".
tr: Option Strict On, '{2}' içinde tanımlanan '{0}' genişletme yöntemiyle '{1}' temsilcisi arasındaki örtük tür dönüştürmelerinde daraltmaya izin vermiyor.
zh_hans: Option Strict On 不允许对“{2}”中定义的扩展方法“{0}”和委托“{1}”之间的隐式类型转换进行收缩。
zh_hant: Option Strict 為 On 時，不可縮減 '{2}' 中定義的擴充方法 '{0}' 與委派 '{1}' 之間隱含的類型轉換。

# ERR_DelegateBindingIncompatible3
source: Extension Method '{0}' defined in '{2}' does not have a signature compatible with delegate '{1}'.
cs: Metoda {0} definovaná v {2} nemá podpis kompatibilní s delegátem {1}.
de: Die {0}-Erweiterungsmethode, die in "{2}" definiert ist, besitzt keine mit dem Delegaten "{1}" kompatible Signatur.
es: El método de extensión '{0}' definido en '{2}' no tiene una firma compatible con el delegado '{1}'.
fr: La méthode d'extension '{0}' définie dans '{2}' n'a pas une signature compatible avec le délégué '{1}'.
it: Per il metodo di estensione '{0}' definito in '{2}' non è disponibile una firma compatibile con il delegato '{1}'.
ja: '{2}' で定義された拡張メソッド '{0}' に、デリゲート '{1}' と互換性があるシグネチャがありません。
ko: '{2}'에 정의된 '{0}' 확장 메서드에 '{1}' 대리자와 호환되는 시그니처가 없습니다.
pl: Metoda rozszerzenia „{0}” zdefiniowana w elemencie „{2}” nie ma sygnatury zgodnej z delegatem „{1}”.
pt_br: Método de extensão "{0}" definido em "{2}" não tem uma assinatura compatível com o delegado "{1}".
ru: Метод расширения "{0}", определенный в "{2}", не имеет сигнатуры, совместимой с делегатом "{1}".
tr: '{2}' içinde tanımlanan '{0}' Genişletme Yönteminin '{1}' temsilcisiyle uyumlu bir imzası yok.
zh_hans: “{2}”中定义的扩展方法“{0}”没有与委托“{1}”兼容的签名。
zh_hant: '{2}' 中定義的擴充方法 '{0}'，沒有與委派 '{1}' 相容的簽章。

# ERR_ArgumentNarrowing2
source: Argument matching parameter '{0}' narrows to '{1}'.
cs: Argument odpovídající parametru {0} se zužuje na {1}.
de: Der Parameter "{0}" für den Argumentabgleich wird auf "{1}" eingeschränkt.
es: El parámetro '{0}' correspondiente al argumento se reduce a '{1}'.
fr: L'argument qui correspond au paramètre '{0}' passe à '{1}'.
it: Il parametro '{0}' di corrispondenza degli argomenti viene convertito in '{1}'.
ja: パラメーター '{0}' と一致する引数は '{1}' へ引数照合します。
ko: '{0}' 매개 변수와 일치하는 인수는 '{1}'(으)로 한정됩니다.
pl: Dopasowywanie argumentu dla parametru „{0}” powoduje zawężenie do typu „{1}”.
pt_br: O parâmetro de correspondência de argumento '{0}' restringe para '{1}'.
ru: Аргумент, соответствующий параметру "{0}", сужен до "{1}".
tr: '{0}' parametresiyle eşleşen bağımsız değişken '{1}' olarak daralıyor.
zh_hans: 与形参“{0}”匹配的实参收缩到“{1}”。
zh_hant: 與參數 '{0}' 對應的引數，縮減到 '{1}'。

# ERR_AutoPropertyInitializedInStructure
source: Auto-implemented Properties contained in Structures cannot have initializers unless they are marked 'Shared'.
cs: Automaticky implementované vlastnosti obsažené ve strukturách nemůžou mít inicializátory, pokud nejsou označeny jako Shared.
de: Automatisch implementierte Eigenschaften in Strukturen können nur dann Initialisierer enthalten, wenn sie als "Shared" markiert sind.
es: Las propiedades implementadas automáticamente contenidas en estructuras no pueden tener inicializadores a menos que se marquen como 'Shared'.
fr: Les propriétés implémentées automatiquement contenues dans les structures ne peuvent pas avoir d'initialiseurs sauf si elles sont marquées comme 'Shared'.
it: Le proprietà implementate automaticamente e contenute in strutture non avere inizializzatori a meno che non siano contrassegnate come 'Shared'.
ja: 構造体に含まれる自動実装プロパティは、'Shared' に設定されている場合を除き、初期化子を持つことはできません。
ko: 구조체에 포함된 자동 구현 속성은 'Shared'로 표시되지 않는 한 이니셜라이저를 사용할 수 없습니다.
pl: Automatycznie implementowany obiekt Properties zawarty w obiekcie Structures nie może mieć inicjatorów, chyba że są oznaczone jako „Shared”.
pt_br: Propriedades auto implementadas contidas em estruturas não podem ter inicializadores a não ser que eles sejam marcados 'Shared'.
ru: Автоматически реализуемые свойства, содержащиеся в Структурах не могут иметь инициализатор, кроме случаев, когда они помечены как "Общие".
tr: Yapıların kapsamında yer alan otomatik uygulanmış Özellikler, 'Shared' olarak işaretlenmedikçe başlatıcılara sahip olamaz.
zh_hans: 如果没有将结构中包含的自动实现的属性标记为 "Shared"，这些属性就不能有初始值设定项。
zh_hant: 結構中包含的自動實作屬性不能有初始設定式，除非標記為 'Shared'。

# ERR_TypeDisallowsElements
source: XML elements cannot be selected from type '{0}'.
cs: Nejde vybrat prvky XML z typu {0}.
de: XML-Elemente können nicht vom Typ "{0}" ausgewählt werden.
es: No se pueden seleccionar elementos XML del tipo '{0}'.
fr: Les éléments XML ne peuvent pas être sélectionnés à partir du type '{0}'.
it: Non è possibile selezionare elementi XML dal tipo '{0}'.
ja: XML 要素を型 '{0}' から選択することはできません。
ko: XML 요소는 '{0}' 형식에서 선택할 수 없습니다.
pl: Nie można wybierać elementów XML z typu „{0}”.
pt_br: Elementos XML não podem ser selecionados do tipo "{0}".
ru: Невозможно выбрать элементы XML из типа "{0}".
tr: XML öğeleri '{0}' türünden seçilemez.
zh_hans: XML 元素不能从类型“{0}”中选择。
zh_hant: 無法從類型 '{0}' 選取 XML 元素。

# ERR_TypeDisallowsAttributes
source: XML attributes cannot be selected from type '{0}'.
cs: Nejde vybrat atributy XML z typu {0}.
de: XML-Attribute können nicht vom Typ "{0}" ausgewählt werden.
es: No se pueden seleccionar atributos XML del tipo '{0}'.
fr: Les attributs XML ne peuvent pas être sélectionnés à partir du type '{0}'.
it: Non è possibile selezionare attributi XML dal tipo '{0}'.
ja: XML 属性を型 '{0}' から選択することはできません。
ko: XML 특성은 '{0}' 형식에서 선택할 수 없습니다.
pl: Nie można wybierać atrybutów XML z typu „{0}”.
pt_br: Atributos XML não podem ser selecionados do tipo "{0}".
ru: Невозможно выбрать атрибуты XML из типа "{0}".
tr: XML öznitelikleri '{0}' türünden seçilemez.
zh_hans: XML 特性不能从类型“{0}”中选择。
zh_hant: 無法從類型 '{0}' 選取 XML 屬性。

# ERR_TypeDisallowsDescendants
source: XML descendant elements cannot be selected from type '{0}'.
cs: Nejde vybrat následnické prvky XML z typu {0}.
de: XML-Nachfolgerelemente können nicht vom Typ "{0}" ausgewählt werden.
es: No se pueden seleccionar elementos descendientes XML del tipo '{0}'.
fr: Les éléments descendants XML ne peuvent pas être sélectionnés à partir du type '{0}'.
it: Non è possibile selezionare elementi discendenti XML dal tipo '{0}'.
ja: XML 子孫要素を型 '{0}' から選択することはできません。
ko: XML 하위 요소는 '{0}' 형식에서 선택할 수 없습니다.
pl: Nie można wybierać podrzędnych elementów XML z typu „{0}”.
pt_br: Elementos descendentes XML não podem ser selecionados do tipo "{0}".
ru: Невозможно выбрать элементы-потомки XML из типа "{0}".
tr: XML alt öğeleri '{0}' türünden seçilemez.
zh_hans: XML 子代元素不能从类型“{0}”中选择。
zh_hant: 無法從類型 '{0}' 選取 XML 子元素。
