Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ParameterNotValidForType
source: Parameter not valid for the specified unmanaged type.
cs: Parametr není platný pro zadaný nespravovaný typ.
de: Der Parameter ist für den angegebenen nicht verwalteten Typ nicht gültig.
es: Parámetro no válido para el tipo no administrado especificado.
fr: Paramètre non valide pour le type non managé spécifié.
it: Il parametro non è valido per il tipo non gestito specificato.
ja: パラメーターは指定されたアンマネージ型に対して無効です。
ko: 지정한 관리되지 않은 형식에 대한 매개 변수가 잘못되었습니다.
pl: Parametr jest nieprawidłowy dla określonego niezarządzanego typu.
pt_br: Parâmetro não é válido para o tipo não gerenciado especificado.
ru: Недопустимый параметр для указанного неуправляемого типа.
tr: Parametre belirtilen yönetilmeyen tür için geçerli değil.
zh_hans: 参数对于指定非托管类型无效。
zh_hant: 參數對於指定的 Unmanaged 類型無效。

# ERR_MarshalUnmanagedTypeNotValidForFields
source: Unmanaged type '{0}' not valid for fields.
cs: Nespravovaný typ {0} není platný pro pole.
de: Der verwaltete Typ "{0}" ist für Felder nicht gültig.
es: El tipo '{0}' sin administrar no es válido para los campos.
fr: Type non managé '{0}' non valide pour les champs.
it: Il tipo non gestito '{0}' non è valido per i campi.
ja: アンマネージ型 '{0}' はフィールドに対して無効です。
ko: 관리되지 않은 형식 '{0}'은(는) 필드에서 유효하지 않습니다.
pl: Niezarządzany typ „{0}” jest nieprawidłowy dla pól.
pt_br: Tipo não gerenciado "{0}" não é válido para campos.
ru: Неуправляемый тип "{0}" недопустим для полей.
tr: Yönetilmeyen tür '{0}' alanlar için geçerli değil.
zh_hans: 非托管类型“{0}”对于字段无效。
zh_hant: Unmanaged 類型 '{0}' 對欄位無效。

# ERR_MarshalUnmanagedTypeOnlyValidForFields
source: Unmanaged type '{0}' is only valid for fields.
cs: Nespravovaný typ {0} je platný jenom pro pole.
de: Der verwaltete Typ "{0}" ist nur für Felder gültig.
es: El tipo '{0}' sin administrar solo es válido para los campos.
fr: Le type non managé '{0}' n'est valide que pour les champs.
it: Il tipo non gestito '{0}' è valido solo per i campi.
ja: アンマネージ型 '{0}' はフィールドに対してのみ有効です。
ko: 관리되지 않은 형식 '{0}'은(는) 필드에서만 유효합니다.
pl: Niezarządzany typ „{0}” jest prawidłowy tylko dla pól.
pt_br: Tipo não gerenciado "{0}" é válido somente para campos.
ru: Неуправляемый тип "{0}" допустим только для полей.
tr: Yönetilmeyen tür '{0}' yalnızca alanlar için geçerlidir.
zh_hans: 非托管类型“{0}”仅对字段有效。
zh_hant: Unmanaged 類型 '{0}' 只對欄位有效。

# ERR_AttributeParameterRequired1
source: Attribute parameter '{0}' must be specified.
cs: Parametr atributu {0} musí být zadaný.
de: Der Attributparameter "{0}" muss angegeben werden.
es: Hay que especificar el parámetro de atributo '{0}'.
fr: Le paramètre d'attribut '{0}' doit être spécifié.
it: È necessario specificare il parametro di attributo '{0}'.
ja: 属性パラメーター '{0}' を指定する必要があります。
ko: '{0}' 특성 매개 변수를 지정해야 합니다.
pl: Należy podać parametr atrybutu „{0}”.
pt_br: Parâmetro do atributo "{0}" deve ser especificado.
ru: Должен быть указан параметр атрибута "{0}".
tr: '{0}' öznitelik parametresi belirtilmelidir.
zh_hans: 必须指定特性参数“{0}”。
zh_hant: 必須指定屬性參數 '{0}'。

# ERR_AttributeParameterRequired2
source: Attribute parameter '{0}' or '{1}' must be specified.
cs: Parametr atributu {0} nebo {1} musí být zadaný.
de: Der Attributparameter "{0}" oder "{1}" muss angegeben werden.
es: Hay que especificar el parámetro de atributo '{0}' o '{1}'.
fr: Le paramètre d'attribut '{0}' ou '{1}' doit être spécifié.
it: È necessario specificare il parametro di attributo '{0}' o '{1}'.
ja: 属性パラメーター '{0}' または '{1}' を指定する必要があります。
ko: '{0}' 또는 '{1}' 특성 매개 변수를 지정해야 합니다.
pl: Należy podać parametr atrybutu „{0}” lub „{1}”.
pt_br: Parâmetro do atributo "{0}" ou "{1}" deve ser especificado.
ru: Должен быть указан параметр атрибута "{0}" или "{1}".
tr: '{0}' veya '{1}' öznitelik parametresi belirtilmelidir.
zh_hans: 必须指定特性参数“{0}”或“{1}”。
zh_hant: 必須指定屬性參數 '{0}' 或 '{1}'。

# ERR_MemberConflictWithSynth4
source: Conflicts with '{0}', which is implicitly declared for '{1}' in {2} '{3}'.
cs: Je v konfliktu se členem {0}, který je implicitně deklarovaný pro prvek {1} třídy {2} - {3}.
de: Konflikt mit "{0}", das implizit für "{1}" in {2} "{3}" deklariert ist.
es: Entra en conflicto con '{0}', que está implícitamente declarado para '{1}' en {2} '{3}'.
fr: Conflit avec '{0}', qui est déclaré implicitement pour '{1}' dans {2} '{3}'.
it: Conflitti con '{0}', dichiarato in modo implicito per '{1}' in {2} '{3}'.
ja: {2} '{3}' の '{1}' に対して暗黙的に宣言された '{0}' と競合しています。
ko: {2} '{3}'의 '{1}'에 대해 암시적으로 선언된 '{0}'과(와) 충돌합니다.
pl: Powoduje konflikt z elementem „{0}”, zadeklarowanym niejawnie dla elementu „{1}” w elemencie {2} „{3}”.
pt_br: Está em conflito com "{0}", o qual já está implicitamente declarado para "{1}" em {2} "{3}".
ru: Конфликтует с "{0}", неявно объявленным для "{1}" в {2} "{3}".
tr: {2} '{3}' içindeki '{1}' için örtük olarak bildirilen '{0}' ile çakışıyor.
zh_hans: 与为 {2}“{3}”中的“{1}”隐式声明的“{0}”冲突。
zh_hant: 與 {2} '{3}' 中為 '{1}' 所隱含宣告的 '{0}' 互相衝突。

# IDS_ProjectSettingsLocationName
source: <project settings>
cs: <nastavení projektu>
de: <Projekteinstellungen>
es: <configuración del proyecto>
fr: <paramètres de projet>
it: <impostazioni progetto>
ja: <プロジェクトの設定>
ko: <프로젝트 설정>
pl: <ustawienia projektu>
pt_br: <configurações do projeto>
ru: <настройки проекта>
tr: <proje ayarları>
zh_hans: <项目设置>
zh_hant: <專案設定>

# WRN_ReturnTypeAttributeOnWriteOnlyProperty
source: Attributes applied on a return type of a WriteOnly Property have no effect.
cs: Atributy použité u návratového typu vlastnosti WriteOnly nemají žádný účinek.
de: Attribute, die auf einen Rückgabetyp einer WriteOnly-Eigenschaft angewendet werden, haben keine Auswirkung.
es: Los atributos aplicados en un tipo de valor devuelto de una propiedad WriteOnly no tienen efecto.
fr: Les attributs appliqués sur un type de retour d'une propriété WriteOnly sont sans effet.
it: Gli attributi applicati su un tipo restituito di una proprietà WriteOnly non hanno effetto.
ja: WriteOnly プロパティの戻り値の型に適用される属性は無効となります。
ko: WriteOnly 속성의 반환 형식에 적용된 특성은 효과가 없습니다.
pl: Zastosowanie atrybutów w typie zwracanym właściwości WriteOnly nie przyniosło żadnego skutku.
pt_br: Atributos aplicados em um tipo de retorno de uma Propriedade WriteOnly não têm efeito.
ru: Атрибуты, применяемые к возвращаемому типу свойства WriteOnly, никак не влияют.
tr: WriteOnly Özelliğinin dönüş türüne uygulanan özniteliklerin hiçbir etkisi yok.
zh_hans: 应用于 WriteOnly 属性的返回类型的特性不起作用。
zh_hant: 在 WriteOnly 屬性的傳回類型上套用之屬性沒有作用。

# WRN_ReturnTypeAttributeOnWriteOnlyProperty_Title
source: Attributes applied on a return type of a WriteOnly Property have no effect
cs: Atributy použité u návratového typu vlastnosti WriteOnly nemají žádný účinek.
de: Attribute, die auf einen Rückgabetyp einer WriteOnly-Eigenschaft angewendet werden, haben keine Auswirkung.
es: Los atributos aplicados en un tipo de retorno de una propiedad WriteOnly no tienen efecto
fr: Les attributs appliqués sur un type de retour d'une propriété WriteOnly sont sans effet
it: Gli attributi applicati su un tipo restituito di una proprietà WriteOnly non hanno effetto
ja: WriteOnly プロパティの戻り値の型に適用される属性には効果がありません
ko: WriteOnly 속성의 반환 형식에 적용된 특성은 효과가 없음
pl: Zastosowanie atrybutów w typie zwracanym właściwości WriteOnly nie przyniosło żadnego skutku
pt_br: Atributos aplicados em um tipo de retorno de uma Propriedade WriteOnly não têm efeito
ru: Атрибуты, применяемые к типу возвращаемого значения свойства WriteOnly, никак не влияют
tr: WriteOnly Özelliğinin dönüş türüne uygulanan özniteliklerin hiçbir etkisi yok
zh_hans: 应用于 WriteOnly 属性的返回类型的特性不起作用
zh_hant: 在 WriteOnly 屬性的傳回類型上套用的屬性沒有作用

# ERR_SecurityAttributeInvalidTarget
source: Security attribute '{0}' is not valid on this declaration type. Security attributes are only valid on assembly, type and method declarations.
cs: Atribut zabezpečení {0} není platný u tohoto typu deklarace. Atributy zabezpečení jsou platné jenom u deklarací sestavení, typu a metody.
de: Das Sicherheitsattribut "{0}" ist für diesen Deklarationstyp nicht gültig. Sicherheitsattribute sind nur für Assembly-, Typ- und Methodendeklarationen gültig.
es: El valor '{0}' de SecurityAction no es válido en este tipo de declaración. Los atributos de seguridad solo son válidos en las declaraciones de ensamblado, de tipo y de método.
fr: L'attribut de sécurité '{0}' n'est pas valide dans ce type de déclaration. Les attributs de sécurité ne sont valides que dans les déclarations d'assembly, de type et de méthode.
it: L'attributo di sicurezza '{0}' non è valido in questo tipo di dichiarazione. Gli attributi di sicurezza sono validi solo in dichiarazioni di metodo, assembly e tipi.
ja: セキュリティ属性 '{0}' はこの宣言型では無効です。セキュリティ属性は、アセンブリ、型、メソッドの宣言でのみ有効です。
ko: 이 선언 형식에서는 '{0}' 보안 특성이 유효하지 않습니다. 보안 특성은 어셈블리, 형식 및 메서드 선언에서만 유효합니다.
pl: Atrybut zabezpieczeń „{0}” jest nieprawidłowy w tym typie deklaracji. Atrybuty zabezpieczeń są prawidłowe tylko dla deklaracji zestawu, typu i metody.
pt_br: Atributo de segurança "{0}" não é válido neste tipo de declaração. Atributos de segurança são somente válidos em declarações de assembly, tipo e método.
ru: Атрибут безопасности "{0}" не допускается для этого типа объявления. Атрибуты безопасности допустимы только в сборке, типе и объявлениях метода.
tr: '{0}' güvenlik özniteliği bu bildirim türü için geçerli değil. Güvenlik öznitelikleri yalnızca derleme, tür ve yöntem bildirimlerinde geçerlidir.
zh_hans: 安全特性“{0}”对此声明类型无效。安全特性仅对程序集、类型和方法声明有效。
zh_hant: 安全屬性 '{0}' 在此宣告類型上無效。安全屬性只有在組件、類型和方法宣告上才有效。

# ERR_AbsentReferenceToPIA1
source: Cannot find the interop type that matches the embedded type '{0}'. Are you missing an assembly reference?
cs: Nedá se najít typ spolupráce, který odpovídá vloženému typu {0}. Nechybí odkaz na sestavení?
de: Der Interoptyp, der dem eingebetteten Typ "{0}" entspricht, wurde nicht gefunden. Fehlt Ihnen ein Assemblyverweis?
es: No se encuentra el tipo de interoperabilidad que coincide con el tipo incrustado '{0}'. ¿Falta alguna referencia de ensamblado?
fr: Impossible de trouver le type interop qui correspond au type incorporé '{0}'. Une référence d'assembly est-elle manquante ?
it: Il tipo di interoperabilità corrispondente al tipo incorporato {0} non è stato trovato. Probabilmente manca un riferimento all'assembly.
ja: 埋め込み型 '{0}' に一致する相互運用機能型が見つかりません。アセンブリ参照が不足していないかどうかを確認してください。
ko: 포함된 형식 '{0}'과(와) 일치하는 interop 형식을 찾을 수 없습니다. 어셈블리 참조가 있는지 확인하세요.
pl: Nie można znaleźć typu międzyoperacyjnego zgodnego z osadzonym typem „{0}”. Czy nie brakuje odwołania do zestawu?
pt_br: Não é possível encontrar o tipo de interoperabilidade que corresponda ao tipo inserido "{0}". Está faltando uma referência de assembly?
ru: Не удается найти тип взаимодействия, соответствующий внедренному типу взаимодействия "{0}". Возможно, отсутствует ссылка на сборку.
tr: Gömülü '{0}' türüyle eşleşen birlikte çalışma türü bulunamıyor. Derleme başvurunuz eksik olabilir mi?
zh_hans: 找不到与嵌入的类型“{0}”匹配的互操作类型。是否缺少程序集引用?
zh_hant: 找不到符合內嵌類型 '{0}' 的 Interop 類型。是否遺漏組件參考?

# ERR_CannotLinkClassWithNoPIA1
source: Reference to class '{0}' is not allowed when its assembly is configured to embed interop types.
cs: Odkaz na třídu {0} není dovolený, když je její sestavení nakonfigurované na vkládání typů spolupráce.
de: Ein Verweis auf die {0}-Klasse ist nicht zulässig, wenn in der Assembly die Einbettung von Interoptypen konfiguriert ist.
es: La referencia a la clase '{0}' no está permitida cuando su ensamblado está configurado para incrustar tipos de interoperabilidad.
fr: Une référence à la classe '{0}' n'est pas autorisée lorsque son assembly est configuré pour incorporer les types interop.
it: Il riferimento alla classe '{0}' non è consentito se il relativo assembly è configurato in modo da incorporare i tipi di interoperabilità.
ja: クラス '{0}' への参照は、そのアセンブリが相互運用機能型を埋め込むように構成されている場合には許可されません。
ko: 해당 어셈블리가 interop 형식을 포함하도록 구성되어 있으면 '{0}' 클래스에 대한 참조를 사용할 수 없습니다.
pl: Odwołanie do klasy „{0}” jest niedozwolone, gdy jej zestaw jest skonfigurowany do osadzania typów międzyoperacyjnych.
pt_br: Referência à classe "{0}" não é permitida quando seu assembly é configurado para inserir tipos de interoperabilidade.
ru: Ссылка на класс "{0}" не разрешена, когда его сборка настроена для внедрения типов взаимодействия.
tr: Derlemesi birlikte çalışma türleri eklenecek şekilde yapılandırıldığında, '{0}' sınıfına başvuruya izin verilmez.
zh_hans: 当类“{0}”的程序集配置为嵌入互操作类型时，不允许使用对该类的引用。
zh_hant: 在類別 '{0}' 的組件設定為內嵌 Interop 類型時，不可使用該類別的參考。

# ERR_InvalidStructMemberNoPIA1
source: Embedded interop structure '{0}' can contain only public instance fields.
cs: Vložená struktura spolupráce {0} může obsahovat jenom veřejné položky instance.
de: Die eingebettete Interopstruktur "{0}" kann nur öffentliche Instanzfelder enthalten.
es: La estructura de interoperabilidad '{0}' incrustada solo puede contener campos de instancia públicos.
fr: La structure d'interopérabilité incorporée '{0}' ne peut contenir que des champs d'instance publics.
it: La struttura di interoperabilità incorporata '{0}' può contenere solo campi di istanza pubblici.
ja: 相互運用機能の埋め込み構造体 '{0}' には、パブリック インスタンス フィールドのみを含めることができます。
ko: 포함된 interop 구조체 '{0}'은(는) public 인스턴스 필드만 포함할 수 있습니다.
pl: Osadzona struktura międzyoperacyjna „{0}” może zawierać tylko publiczne pola wystąpień.
pt_br: Estrutura de interoperabilidade inserida "{0}" pode conter somente campos de instância pública.
ru: Внедренная структура взаимодействия "{0}" может содержать только открытые экземпляры полей.
tr: Gömülü '{0}' birlikte çalışma yapısı yalnızca ortak örnek alanları içerebilir.
zh_hans: 嵌入的互操作结构“{0}”只能包含公共实例字段。
zh_hant: 內嵌的 Interop 結構 '{0}' 只可包含公用執行個體欄位。

# ERR_NoPIAAttributeMissing2
source: Interop type '{0}' cannot be embedded because it is missing the required '{1}' attribute.
cs: Typ spolupráce {0} nemůže být vložený, protože postrádá požadovaný atribut {1}.
de: Der Interoptyp "{0}" kann nicht eingebettet werden, da er nicht das erforderliche {1}-Attribut aufweist.
es: El tipo de interoperabilidad '{0}' no se puede incrustar porque le falta el atributo '{1}' requerido.
fr: Impossible d'incorporer le type interop '{0}', car il lui manque l'attribut '{1}' obligatoire.
it: Non è possibile incorporare il tipo di interoperabilità '{0}' perché manca l'attributo obbligatorio '{1}'.
ja: 相互運用型 '{0}' は、必須の '{1}' 属性がないため、埋め込むことができません。
ko: 필수 '{1}' 특성이 없으므로 Interop 형식 '{0}'을(를) 포함할 수 없습니다.
pl: Nie można osadzić typu międzyoperacyjnego „{0}”, ponieważ brakuje w nim wymaganego atrybutu „{1}”.
pt_br: Tipo de interoperabilidade "{0}" não pode ser inserido porque está faltando o atributo "{1}" necessário.
ru: Не удается внедрить тип взаимодействия "{0}", так как у него отсутствует обязательный атрибут "{1}".
tr: Gereken '{1}' özniteliği eksik olduğundan birlikte çalışma türü '{0}' eklenemiyor.
zh_hans: 无法嵌入互操作类型“{0}”，因为它缺少必需的“{1}”特性。
zh_hant: 無法內嵌 Interop 類型 '{0}'，因為其遺漏必要的 '{1}' 屬性。

# ERR_PIAHasNoAssemblyGuid1
source: Cannot embed interop types from assembly '{0}' because it is missing the '{1}' attribute.
cs: Nejde vložit typy spolupráce pro sestavení {0}, protože postrádá atribut {1}.
de: Aus Assembly "{0}" können keine Interoptypen eingebettet werden, da das {1}-Attribut fehlt.
es: No se pueden incrustar tipos de interoperabilidad desde el ensamblado '{0}' porque no tiene el atributo '{1}'.
fr: Impossible d'incorporer les types interop de l'assembly '{0}', car l'attribut '{1}' est manquant.
it: Non è possibile incorporare i tipi di interoperabilità dall'assembly '{0}' perché manca l'attributo '{1}'.
ja: アセンブリ '{0}' に '{1}' 属性が指定されていないため、このアセンブリから相互運用型を埋め込むことはできません。
ko: 어셈블리 '{0}'에 '{1}' 특성이 없으므로 이 어셈블리의 interop 형식을 포함할 수 없습니다.
pl: Nie można osadzić typów międzyoperacyjnych z zestawu „{0}”, ponieważ brakuje atrybutu „{1}”.
pt_br: Não é possível inserir tipos de interoperabilidade do assembly "{0}" porque ele está sem o "{1}" atributo.
ru: Не удается внедрить типы взаимодействия из сборки "{0}" из-за отсутствия в ней атрибута "{1}".
tr: '{1}' özniteliği eksik olduğundan '{0}' derlemesinden birlikte çalışma türleri katıştırılamıyor.
zh_hans: 无法嵌入来自程序集“{0}”的互操作类型，因为它缺少“{1}”特性。
zh_hant: 無法從組件 '{0}' 內嵌 Interop 類型，因為其遺漏了 '{1}' 屬性。

# ERR_DuplicateLocalTypes3
source: Cannot embed interop type '{0}' found in both assembly '{1}' and '{2}'. Consider disabling the embedding of interop types.
cs: Nejde vložit typ spolupráce {0} nalezený v sestavení {1} i {2}. Zvažte zákaz vkládání typů spolupráce.
de: Der {0}-Interoptyp, der sich sowohl in Assembly "{1}" als auch "{2}" befindet, kann nicht eingebettet werden. Deaktivieren Sie ggf. die Einbettung von Interoptypen.
es: No se puede incrustar el tipo de interoperabilidad '{0}' encontrado en el ensamblado '{1}' y en '{2}'. Puede deshabilitar la incrustación de los tipos de interoperabilidad.
fr: Impossible d'incorporer le type interop '{0}' trouvé dans les assemblys '{1}' et '{2}'. Désactivez l'incorporation des types interop.
it: Non è possibile incorporare il tipo di interoperabilità '{0}' trovato negli assembly '{1}' e '{2}'. Provare a disabilitare l'incorporamento dei tipi di interoperabilità.
ja: アセンブリ '{1}' と '{2}' の両方で見つかった相互運用機能型 '{0}' を埋め込むことができません。相互運用機能型の無効化を検討してください。
ko: 어셈블리 '{1}'과(와) '{2}'에 모두 있는 interop 형식 '{0}'을(를) 포함할 수 없습니다. interop 형식을 포함하지 않도록 설정하세요.
pl: Nie można osadzić typu międzyoperacyjnego „{0}” znalezionego w zestawie „{1}” i „{2}”. Rozważ wyłączenie osadzenia typów międzyoperacyjnych.
pt_br: Não é possível inserir o tipo de interoperabilidade "{0}" encontrado em ambos os assemblies "{1}" e "{2}". Considere desabilitar a inserção de tipos de interoperabilidade.
ru: Не удается внедрить тип взаимодействия "{0}", находящийся в обеих сборках "{1}" и "{2}". Попробуйте отключить внедрение типов взаимодействия.
tr: Hem '{1}' hem de '{2}' derlemesinde bulunan '{0}' birlikte çalışma türü eklenemiyor. Birlikte çalışma türlerini ekleme işlemini devre dışı bırakabilirsiniz.
zh_hans: 无法嵌入程序集“{1}”和“{2}”中找到的互操作类型“{0}”。请考虑禁用互操作类型的嵌入。
zh_hant: 無法內嵌在組件 '{1}' 和 '{2}' 中所找到的 Interop 類型 '{0}'。請考慮停用內嵌 Interop 類型。

# ERR_PIAHasNoTypeLibAttribute1
source: Cannot embed interop types from assembly '{0}' because it is missing either the '{1}' attribute or the '{2}' attribute.
cs: Nejde vložit typy spolupráce ze sestavení {0}, protože postrádá buď atribut {1}, nebo atribut {2}.
de: Aus Assembly "{0}" können keine Interoptypen eingebettet werden, da entweder das {1}-Attribut oder das {2}-Attribut fehlt.
es: No se pueden incrustar tipos de interoperabilidad desde el ensamblado '{0}' porque le falta el atributo '{1}' o '{2}'.
fr: Impossible d'incorporer les types interop de l'assembly '{0}', car l'attribut '{1}' ou '{2}' est manquant.
it: Non è possibile incorporare i tipi di interoperabilità dall'assembly '{0}' perché manca l'attributo '{1}' o '{2}'.
ja: アセンブリ '{0}' には '{1}' 属性または '{2}' 属性が指定されていないため、このアセンブリから相互運用型を埋め込むことはできません。
ko: 어셈블리 '{0}'에 '{1}' 특성 또는 '{2}' 특성이 없으므로 이 어셈블리의 interop 형식을 포함할 수 없습니다.
pl: Nie można osadzić typów międzyoperacyjnych z zestawu „{0}”, ponieważ brakuje atrybutu „{1}” lub „{2}”.
pt_br: Não é possível inserir tipos de interoperabilidade do assembly "{0}" porque ele está sem o atributo "{1}" ou o atributo "{2}".
ru: Внедрение типов взаимодействия из сборки "{0}" невозможно, так как у нее отсутствует атрибут "{1}" или атрибут "{2}".
tr: '{1}' veya '{2}' özniteliği eksik olduğundan '{0}' derlemesinden birlikte çalışma türleri katıştırılamıyor.
zh_hans: 无法嵌入来自程序集“{0}”的互操作类型，因为它缺少“{1}”特性或“{2}”特性。
zh_hant: 無法從組件 '{0}' 內嵌 Interop 類型，因為其遺漏了 '{1}' 屬性或 '{2}' 屬性。

# ERR_SourceInterfaceMustBeInterface
source: Interface '{0}' has an invalid source interface which is required to embed event '{1}'.
cs: Rozhraní {0} má neplatné zdrojové rozhraní, které se vyžaduje pro vložení události {1}.
de: Schnittstelle "{0}" besitzt eine ungültige Quellschnittstelle, die zum Einbetten von Ereignis "{1}" erforderlich ist.
es: La interfaz '{0}' tiene una interfaz de origen no válida necesaria para incrustar el evento '{1}'.
fr: L'interface '{0}' a une interface source non valide qui est nécessaire à l'incorporation de l'événement '{1}'.
it: L'interfaccia '{0}' contiene un'interfaccia di origine non valida che è necessaria per incorporare l'evento '{1}'.
ja: イベント '{1}' の埋め込みに必要な、インターフェイス '{0}' のソース インターフェイスが無効です。
ko: '{0}' 인터페이스에는 '{1}' 이벤트를 포함하는 데 필요한 소스 인터페이스가 잘못 포함되어 있습니다.
pl: Interfejs „{0}” zawiera nieprawidłowy interfejs źródłowy wymagany do osadzenia zdarzenia „{1}”.
pt_br: Interface "{0}" tem uma interface de origem inválida que é necessária para incorporar o evento "{1}".
ru: Интерфейс "{0}" имеет недопустимый исходный интерфейс, который требуется для внедрения события "{1}".
tr: '{0}' arabiriminde '{1}' olayını katıştırmak için gereken geçersiz bir kaynak arabirimi var.
zh_hans: 接口“{0}”的源接口无效，该源接口是嵌入事件“{1}”所必需的。
zh_hant: 介面 '{0}' 的來源介面無效，但內嵌事件 '{1}' 需要該介面。

# ERR_EventNoPIANoBackingMember
source: Source interface '{0}' is missing method '{1}', which is required to embed event '{2}'.
cs: Zdrojovému rozhraní {0} chybí metoda {1}, která se vyžaduje pro vložení události {2}.
de: Für die Quellschnittstelle "{0}" fehlt die {1}-Methode, die zum Einbetten des {2}-Ereignisses notwendig ist.
es: En la interfaz de origen '{0}' falta el método '{1}', que es necesario para incrustar el evento '{2}'.
fr: L'interface source '{0}' n'a pas de méthode '{1}', qui est requise pour incorporer l'événement '{2}'.
it: Nell'interfaccia di origine '{0}' manca il metodo '{1}' necessario per incorporare l'evento '{2}'.
ja: ソース インターフェイス '{0}' にはイベント '{2}' の埋め込みに必要なメソッド '{1}' がありません。
ko: 소스 인터페이스 '{0}'에 '{2}' 이벤트를 포함하는 데 필요한 '{1}' 메서드가 없습니다.
pl: W interfejsie źródłowym „{0}” brak metody „{1}” wymaganej do osadzenia zdarzenia „{2}”.
pt_br: Interface de origem "{0}" está sem o método "{1}", o qual é necessário para inserir o evento "{2}".
ru: В исходном интерфейсе "{0}" отсутствует метод "{1}", обязательный для внедрения события "{2}".
tr: '{0}' kaynak arabirimde, '{2}' olayını eklemek için gereken '{1}' yöntemi eksik.
zh_hans: 源接口“{0}”缺少方法“{2}”，此方法对嵌入事件“{1}”是必需的。
zh_hant: 來源介面 '{0}' 遺漏內嵌事件 '{2}' 所需的方法 '{1}'。

# ERR_NestedInteropType
source: Nested type '{0}' cannot be embedded.
cs: Vnořený typ {0} se nedá vložit.
de: Der geschachtelte Typ "{0}" kann nicht eingebettet werden.
es: El tipo anidado '{0}' no se puede incrustar.
fr: Le type imbriqué '{0}' ne peut pas être incorporé.
it: Non è possibile incorporare il tipo annidato '{0}'.
ja: 入れ子にされた型 '{0}' を埋め込むことはできません。
ko: '{0}' 중첩 형식을 포함할 수 없습니다.
pl: Typ zagnieżdżony „{0}” nie może zostać osadzony.
pt_br: Tipo aninhado "{0}" não pode ser inserido.
ru: Невозможно внедрить вложенный тип "{0}".
tr: '{0}' iç içe türü eklenemiyor.
zh_hans: 无法嵌入嵌套类型“{0}”。
zh_hant: 無法內嵌巢狀類型 '{0}'。
