Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_VBCHelp
source: Visual Basic Compiler Options - OUTPUT FILE - -out:<file> Specifies the output file name. -target:exe Create a console application (default). (Short form: -t) -target:winexe Create a Windows application. -target:library Create a library assembly. -target:module Create a module that can be added to an assembly. -target:appcontainerexe Create a Windows application that runs in AppContainer. -target:winmdobj Create a Windows Metadata intermediate file -doc[+|-] Generates XML documentation file. -doc:<file> Generates XML documentation file to <file>. -refout:<file> Reference assembly output to generate - INPUT FILES - -addmodule:<file_list> Reference metadata from the specified modules -link:<file_list> Embed metadata from the specified interop assembly. (Short form: -l) -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications. -reference:<file_list> Reference metadata from the specified assembly. (Short form: -r) -analyzer:<file_list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. - RESOURCES - -linkresource:<resinfo> Links the specified file as an external assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -linkres) -nowin32manifest The default manifest should not be embedded in the manifest section of the output PE. -resource:<resinfo> Adds the specified file as an embedded assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -res) -win32icon:<file> Specifies a Win32 icon file (.ico) for the default Win32 resources. -win32manifest:<file> The provided file is embedded in the manifest section of the output PE. -win32resource:<file> Specifies a Win32 resource file (.res). - CODE GENERATION - -optimize[+|-] Enable optimizations. -removeintchecks[+|-] Remove integer checks. Default off. -debug[+|-] Emit debugging information. -debug:full Emit full debugging information (default). -debug:pdbonly Emit full debugging information. -debug:portable Emit cross-platform debugging information. -debug:embedded Emit cross-platform debugging information into the target .dll or .exe. -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -nowarn Disable all warnings. -nowarn:<number_list> Disable a list of individual warnings. -warnaserror[+|-] Treat all warnings as errors. -warnaserror[+|-]:<number_list> Treat a list of warnings as errors. -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics in SARIF format. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. - LANGUAGE - -define:<symbol_list> Declare global conditional compilation symbol(s). symbol_list:name=value,... (Short form: -d) -imports:<import_list> Declare global Imports for namespaces in referenced metadata files. import_list:namespace,... -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `default` (latest major version), or `latest` (latest version, including minor versions), or specific versions like `14` or `15.3` -optionexplicit[+|-] Require explicit declaration of variables. -optioninfer[+|-] Allow type inference of variables. -rootnamespace:<string> Specifies the root Namespace for all type declarations. -optionstrict[+|-] Enforce strict language semantics. -optionstrict:custom Warn when strict language semantics are not respected. -optioncompare:binary Specifies binary-style string comparisons. This is the default. -optioncompare:text Specifies text-style string comparisons. - MISCELLANEOUS - -help Display this usage message. (Short form: -?) -noconfig Do not auto-include VBC.RSP file. -nologo Do not display compiler copyright banner. -quiet Quiet output mode. -verbose Display verbose messages. -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<number> The base address for a library or module (hex). -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<number> Specifies the codepage to use when opening source files. -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key. -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key. -errorreport:<string> Specifies how to handle internal compiler errors; must be prompt, send, none, or queue (default). -filealign:<number> Specify the alignment used for output file sections. -highentropyva[+|-] Enable high-entropy ASLR. -keycontainer:<string> Specifies a strong name key container. -keyfile:<file> Specifies a strong name key file. -libpath:<path_list> List of directories to search for metadata references. (Semi-colon delimited.) -main:<class> Specifies the Class or Module that contains Sub Main. It can also be a Class that inherits from System.Windows.Forms.Form. (Short form: -m) -moduleassemblyname:<string> Name of the assembly which this module will be a part of. -netcf Target the .NET Compact Framework. -nostdlib Do not reference standard libraries (system.dll and VBC.RSP file). -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -platform:<string> Limit which platforms this code can run on; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred or anycpu (default). -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -sdkpath:<path> Location of the .NET Framework SDK directory (mscorlib.dll). -subsystemversion:<version> Specify subsystem version of the output PE. version:<number>[.<number>] -utf8output[+|-] Emit compiler output in UTF8 character encoding. @<file> Insert command-line settings from a text file -vbruntime[+|-|*] Compile with/without the default Visual Basic runtime. -vbruntime:<file> Compile with the alternate Visual Basic runtime in <file>.
cs: Parametry kompilátoru Visual Basic - VÝSTUPNÍ SOUBOR - -out:<soubor> Určuje název výstupního souboru. -target:exe Vytvoří konzolovou aplikaci (výchozí). (Krátký tvar: -t) -target:winexe Vytvoří aplikaci Windows. -target:library Vytvoří sestavení knihovny. -target:module Vytvoří modul, který jde přidat do sestavení. -target:appcontainerexe Vytvoří aplikaci Windows, která bude běžet v kontejneru AppContainer. -target:winmdobj Vytvoří pomocný soubor metadat Windows. -doc[+|-] Generuje soubor dokumentace XML. -doc:<soubor> Generuje soubor dokumentace XML s určeným názvem. -refout:<file> Výstup referenčního sestavení, který se bude generovat - VSTUPNÍ SOUBORY - -addmodule:<seznam_souborů> Odkazuje na metadata ze zadaných modulů. -link:<seznam_souborů> Vloží metadata ze zadaného definičního sestavení. (Krátký tvar: -l) -recurse:<zástupný_znak> Zahrne všechny soubory v aktuálním adresáři a podadresářích podle zadaného zástupného znaku. -reference:<seznam_souborů> Odkazuje na metadata ze zadaného sestavení. (Krátký tvar: -r) -analyzer:<seznam_souborů> Spustí analyzátory z tohoto sestavení. (Krátký tvar: -a) -additionalfile:<seznam_souborů> Další soubory, které přímo neovlivňují generování kódu, ale analyzátory můžou jejich pomocí produkovat chyby nebo upozornění. - PROSTŘEDKY - -linkresource:<prostředek> Připojí zadaný soubor jako externí prostředek sestavení. prostředek: <soubor>[,<název>[,public|private]] (Krátký tvar: -linkres) -nowin32manifest Výchozí manifest by se neměl vkládat do oddílu manifestu výstupního PE. -resource:<prostředek> Přidá zadaný soubor jako vložený prostředek sestavení. prostředek: <soubor>[,<název>[,public|private]] (Krátký tvar: -res) -win32icon:<soubor> Určuje soubor ikony Win32 (.ico) pro výchozí prostředky Win32. -win32manifest:<soubor> Zadaný soubor se vloží do oddílu manifestu výstupního PE. -win32resource:<soubor> Určuje soubor prostředků Win32 (.res). - GENEROVÁNÍ KÓDU - -optimize[+|-] Povolí optimalizace. -removeintchecks[+|-] Odebere kontroly celých čísel. Standardně vypnuté. -debug[+|-] Generuje ladicí informace. -debug:full Generuje úplné ladicí informace (výchozí). -debug:pdbonly Generuje úplné ladicí informace. -debug:portable Generuje ladicí informace napříč platformami. -debug:embedded Generuje ladicí informace napříč platformami do cílového souboru .dll nebo .exe. -deterministic Vytvoří deterministické sestavení (včetně GUID verze modulu a časového razítka). -refonly Vytvoří referenční sestavení na místě hlavního výstupu. -instrument:TestCoverage Vytvoří sestavení instrumentované pro shromažďování informací o pokrytí. -sourcelink:<soubor> Informace o zdrojovém odkazu vkládané do přenosného PDB. - CHYBY A UPOZORNĚNÍ - -nowarn Zakáže všechna upozornění. -nowarn:<seznam_čísel> Zakáže upozornění ze seznamu. -warnaserror[+|-] Zpracuje všechna upozornění jako chyby. -warnaserror[+|-]:<seznam_čísel> Zpracuje zadaná upozornění jako chyby. -ruleset:<soubor> Určuje soubor sady pravidel, která zakazuje specifickou diagnostiku. -errorlog:<soubor>[,version=<verze_sarif>] Určuje soubor pro protokolování veškeré diagnostiky kompilátoru a analyzátoru ve formátu SARIF. verze_sarif:{1|2|2.1} Výchozí jsou 1. 2 a 2.1. Obě hodnoty znamenají SARIF verze 2.1.0. -reportanalyzer Oznamuje další informace analyzátoru, jako třeba dobu zpracování. - JAZYK - -define:<seznam_symbolů> Deklaruje globální symboly podmíněné kompilace. seznam_symbolů: název=hodnota,... (Krátký tvar: -d) -imports:<seznam_importů> Deklaruje globální importy pro obory názvů v odkazovaných souborech metadat. seznam_importů: obor_názvů,... -langversion:? Zobrazí povolené hodnoty jazykové verze. -langversion:<číslo> Určuje jazykovou verzi, například default (nejnovější hlavní verze) nebo latest (nejnovější verze včetně podverzí) nebo konkrétní verze, například 14 nebo 15.3. -optionexplicit[+|-] Vyžaduje explicitní deklarování proměnných. -optioninfer[+|-] Povoluje odvození typu proměnných. -rootnamespace:<řetězec> Určuje kořenový obor názvů pro všechny deklarace typů. -optionstrict[+|-] Vynucuje striktní sémantiku jazyka. -optionstrict:custom Upozorňuje na nedodržování striktní sémantiky jazyka. -optioncompare:binary Určuje binární styl porovnávání řetězců. Jde o výchozí možnost. -optioncompare:text Určuje textový styl porovnávání řetězců. - RŮZNÉ - -help Zobrazí tuto zprávu o použití. (Krátký tvar: -?) -noconfig Nezahrnuje automaticky soubor VBC.RSP. -nologo Nezobrazí zprávu o autorských právech kompilátoru. -quiet Určuje tichý výstupní režim. -verbose Zobrazí podrobné zprávy. -parallel[+|-] Souběžné sestavení -version Zobrazí číslo verze kompilátoru a ukončí se. - POKROČILÉ - -baseaddress:<číslo> Určuje základní adresu pro knihovnu nebo modul (hex). -checksumalgorithm:<alg> Určuje algoritmus pro výpočet kontrolního součtu zdrojového souboru uloženého v PDB. Podporované hodnoty jsou SHA1 nebo SHA256 (výchozí). -codepage:<číslo> Určuje znakovou stránku, která se má použít při otevírání zdrojových souborů. -delaysign[+|-] Vytvoří zpožděný podpis sestavení s využitím veřejné části klíče silného názvu. -publicsign[+|-] Vytvoří veřejný podpis sestavení s využitím jenom veřejné části klíče silného názvu. -errorreport:<řetězec> Určuje způsob zpracování interních chyb kompilátoru: prompt, send, none nebo queue (výchozí). -filealign:<číslo> Určuje zarovnání použité pro oddíly výstupního souboru. -highentropyva[+|-] Povoluje ASLR s vysokou entropií. -keycontainer:<řetězec> Určuje kontejner klíče se silným názvem. -keyfile:<soubor> Určuje soubor klíče se silným názvem. -libpath:<seznam_cest> Seznam adresářů, kde se mají hledat odkazy na metadata (oddělený středníky) -main:<třída> Určuje třídu nebo modul obsahující Sub Main. Může to být taky třída, která dědí od System.Windows.Forms.Form. (Krátký tvar: -m) -moduleassemblyname:<řetězec> Určuje název sestavení, jehož součástí bude tento modul. -netcf Cílí na .NET Compact Framework. -nostdlib Neodkazuje na standardní knihovny (system.dll a VBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Určuje mapování pro výstup zdrojových názvů cest kompilátorem. -platform:<řetězec> Omezuje platformy, na kterých se dá tento kód spustit: x86, x64, Itanium, arm, arm64, AnyCPU32BitPreferred nebo anycpu (výchozí). -preferreduilang Určuje název upřednostňovaného výstupního jazyka. -nosdkpath Zakáže hledání cesty k výchozí sadě SDK pro sestavení standardních knihoven. -sdkpath:<cesta> Umístění adresáře s .NET Framework SDK (mscorlib.dll). -subsystemversion:<verze> Určuje verzi subsystému výstupního PE. verze: <číslo>[.<číslo>] -utf8output[+|-] Generuje výstup kompilátoru v kódování UTF-8. @<soubor> Vloží nastavení příkazového řádku ze souboru. -vbruntime[+|-|*] Kompiluje s výchozím modulem runtime nebo bez něj Visual Basicu. -vbruntime:<soubor> Kompiluje s alternativním modulem runtime Visual Basicu určeným parametrem <soubor>.
de: Visual Basic-Compileroptionen - AUSGABEDATEI - -out:<Datei> Gibt den Ausgabedateinamen an. -target:exe Erstellt eine Konsolenanwendung (Standardwert). (Kurzform: -t) -target:winexe Erstellt eine Windows-Anwendung. -target:library Erstellt eine Bibliotheksassembly. -target:module Erstellt ein Modul, das einer Assembly hinzugefügt werden kann. -target:appcontainerexe Erstellt eine Windows-Anwendung, die in AppContainer ausgeführt wird. -target:winmdobj Erstellt eine Windows-Metadatenzwischendatei. -doc[+|-] Generiert eine XML-Dokumentationsdatei. -doc:<Datei> Generiert eine XML-Dokumentationsdatei in <Datei>. -refout:<Datei> Zu generierende Referenzassemblyausgabe - EINGABEDATEIEN - -addmodule:<Dateiliste> Verweist auf Metadaten aus den angegebenen Modulen. -link:<Dateiliste> Bettet Metadaten aus der angegebenen Interop- assembly ein. (Kurzform: -l) -recurse:<Platzhalter> Schließt alle Dateien im aktuellen Verzeichnis und dessen Unterverzeichnissen gemäß den Platzhalterspezifikationen ein. -reference:<Dateiliste> Verweist auf Metadaten aus der angegebenen Assembly. (Kurzform: -r) -analyzer:<Dateiliste> Führt die Analyzer aus dieser Assembly aus. (Kurzform: -a) -additionalfile:<Dateiliste> Zusätzliche Dateien, die sich nicht direkt auf die Code- generierung auswirken, aber ggf. von Analyzern zum Erstellen von Fehlern oder Warnungen verwendet werden können. - RESSOURCEN - -linkresource:<resinfo> Verknüpft die angegebene Datei als eine externe Assemblyressource. resinfo:<Datei>[,<Name>[,public|private]] (Kurzform: -linkres) -nowin32manifest Das Standardmanifest soll nicht in den Manifestabschnitt der PE-Ausgabedatei eingebettet werden. -resource:<resinfo> Fügt die angegebene Datei als eine eingebettete Assemblyressource hinzu. resinfo:<Datei>[,<Name>[,public|private]] (Kurzform: -res) -win32icon:<Datei> Gibt eine Win32-Symboldatei (ICO-Datei) für die Win32-Standardressourcen an. -win32manifest:<Datei> Die angegebene Datei wird im Manifest- abschnitt der PE-Ausgabedatei eingebettet. -win32resource:<Datei> Gibt eine Win32-Ressourcendatei (RES-Datei) an. - CODEGENERIERUNG - -optimize[+|-] Aktiviert Optimierungen. -removeintchecks[+|-] Entfernt Integerüberprüfungen. Standardmäßig deaktiviert. -debug[+|-] Gibt Debuginformationen aus. -debug:full Gibt vollständige Debuginformationen aus (Standardeinstellung). -debug:pdbonly Gibt vollständige Debuginformationen aus. -debug:portable Gibt plattformübergreifende Debuginformationen aus. -debug:embedded Gibt plattformübergreifende Debuginformationen in die Ziel-DLL oder -EXE aus. -deterministic Generiert eine deterministische Assembly (einschließlich Modulversion-GUID und Zeitstempel) -refonly Erstellt eine Referenzassembly anstelle der Hauptausgabe -instrument:TestCoverage Erstellt eine Assembly, die zum Erfassen von Abdeckungsinformationen instrumentiert ist. -sourcelink:<Datei> Quelllinkinformationen, die in die PDB-Datei eingebettet werden sollen. - FEHLER UND WARNUNGEN - -nowarn Deaktiviert alle Warnungen. -nowarn:<Zahlenliste> Deaktiviert eine Liste einzelner Warnungen. -warnaserror[+|-] Behandelt alle Warnungen als Fehler. -warnaserror[+|-]:<Zahlenliste> Behandelt eine Liste von Warnungen als Fehler. -ruleset:<Datei> Gibt eine Regelsatzdatei an, die bestimmte Diagnosefunktionen deaktiviert. -errorlog:<Datei>[,version=<sarif_version>] Gibt eine Datei an, in der alle Compiler- und Analyzer- diagnosedaten im SARIF-Format protokolliert werden. sarif_version:{1|2|2.1} Standardwerte sind 1. 2 und 2.1, beide beziehen sich auf SARIF-Version 2.1.0. -reportanalyzer Meldet zusätzliche Analyzerinformationen, z. B. die Ausführungszeit. - SPRACHE - -define:< Symbolliste > Deklariert globale bedingte Kompilierung von Symbolen. symbol_list:name=value,... (Kurzform: -d) -imports:< Importliste > Deklariert globale Importe für Namespaces in Metadatendateien, auf die verwiesen wird. import_list:namespace,... -langversion:? Zeigt die zulässigen Werte für die Sprachversion an. -langversion:<Zeichenfolge> Gibt die Sprachversion an: "default" (neueste Hauptversion) oder "latest" (neueste Version, einschließlich Nebenversionen) oder bestimmte Versionen wie "14" oder "15.3". -optionexplicit[+|-] Erfordert die explizite Deklaration von Variablen. -optioninfer[+|-] Lässt den Typrückschluss von Variablen zu. -rootnamespace:<Zeichenfolge> Gibt den Stammnamespace für alle Typ- deklarationen an. -optionstrict[+|-] Erzwingt strenge Sprachsemantik. -optionstrict:custom Warnt, wenn die strenge Sprachsemantik nicht beachtet wird. -optioncompare:binary Gibt Zeichenfolgenvergleiche im Binärstil an. Dies ist die Standardeinstellung. -optioncompare:text Gibt Zeichenfolgenvergleiche im Textstil an. - SONSTIGES - -help Zeigt diese Syntaxinformationen an. (Kurzform: -?) -noconfig Schließt die VBC.RSP-Datei nicht automatisch ein. -nologo Zeigt das Compilercopyrightbanner nicht an. -quiet Stiller Ausgabemodus. -verbose Zeigt ausführliche Meldungen an. -parallel[+|-] Gleichzeitige Erstellung. -version Zeigt die Compilerversionsnummer und die Beendigung an. - ERWEITERT - -baseaddress:<Zahl> Die Basisadresse für eine Bibliothek oder ein Modul (hexadezimal). -checksumalgorithm:<alg> Legt den Algorithmus zum Berechnen der Quelldatei- prüfsumme fest, die in der PDB-Datei gespeichert ist. Unterstützte Werte sind: SHA1 oder SHA256 (Standard). -codepage:<Zahl> Gibt die Codepage an, die beim Öffnen von Quelldateien verwendet werden soll. -delaysign[+|-] Signiert die Assembly verzögert nur mithilfe des öffentlichen Teils des Schlüssels für einen starken Namen. -publicsign[+|-] Signiert die Assembly öffentlich nur mithilfe des öffentlichen Teils des Schlüssels für einen starken Namen. -errorreport:<Zeichenfolge> Gibt an, wie interne Compiler- fehler behandelt werden. Mögliche Werte sind "prompt", "send", "none" oder "queue" (Standardwert). -filealign:<Zahl> Gibt die Ausrichtung an, die für die Abschnitte der Ausgabedatei verwendet wird. -highentropyva[+|-] Aktiviert ASLR mit hoher Entropie. -keycontainer:<Zeichenfolge> Gibt einen Schlüsselcontainer mit starkem Namen an. -keyfile:<Datei> Gibt eine Schlüsseldatei mit starkem Namen an. -libpath:<Pfadliste> Die Liste der Verzeichnisse, die nach Metadaten- verweisen durchsucht werden sollen (durch Semikolons getrennt). -main:<Klasse> Gibt die Klasse oder das Modul an, die bzw. das "Sub Main" enthält. Es kann sich auch um eine Klasse handeln, die von "System.Windows.Forms.Form" erbt. (Kurzform: -m) -moduleassemblyname:<Zeichenfolge> Der Name der Assembly, zu der dieses Modul gehören wird. -netcf Gibt .NET Compact Framework als Ziel an. -nostdlib Keine Verweise auf Standardbibliotheken ("system.dll" und VBC.RSP-Datei). -pathmap:<K1>=<V1>,<K2>=<V2>,... Gibt eine Zuordnung für die Ausgabe der Quellpfadnamen durch den Compiler an. -platform:<Zeichenfolge> Schränkt die Plattformen ein, auf denen dieser Code ausgeführt werden kann; gültige Werte sind x86, x64, Itanium, arm, arm64, AnyCPU32BitPreferred oder anycpu (Standard). -preferreduilang Gibt den Namen der bevorzugten Ausgabesprache an. -nosdkpath Deaktivieren Sie das Durchsuchen des Standard-SDK-Pfads für Standardbibliotheksassemblys. -sdkpath:<Pfad> Der Speicherort des .NET Framework SDK-Verzeichnisses (mscorlib.dll). -subsystemversion:<Version> Gibt die Subsystemversion der PE-Ausgabedatei an. version:<Zahl>[.<Zahl>] -utf8output[+|-] Gibt die Compilerausgabe in UTF8-Zeichen- codierung aus. @<Datei> Fügt Befehlszeileneinstellungen aus einer Textdatei ein. -vbruntime[+|-|*] Kompiliert mit der bzw. ohne die Visual Basic- Standardlaufzeit. -vbruntime:<Datei> Kompiliert mit der Visual Basic- Alternativlaufzeit in <Datei>.
zh_hans: Visual Basic 编译器选项 - 输出文件 - -out:<file> 指定输出文件名称。 -target:exe 创建控制台应用程序(默认)。 (缩写: -t) -target:winexe 创建 Windows 应用程序。 -target:library 创建库程序集。 -target:module 创建可添加到程序集的 模块。 -target:appcontainerexe 创建在 AppContainer 中运行的 Windows 应用程序。 -target:winmdobj 创建 Windows 元数据中间文件 -doc[+|-] 生成 XML 文档文件。 -doc:<file> 将 XML 文档文件生成到 <file> -refout:<file> 引用要生成的引用程序集 - 输入文件 - -addmodule:<file_list> 从指定模块中引用元数据 -link:<file_list> 嵌入指定互操作程序集中的 元数据。(缩写: -l) -recurse:<wildcard> 根据通配符规范包括 当前目录和子目录中 的所有文件。 -reference:<file_list> 从指定程序集中引用 元数据。(缩写: -r) -analyzer:<file_list> 运行此程序集的分析器 (缩写: -a) -additionalfile:<file list> 不直接影响代码 生成但可能被分析器用于生成 错误或警告的其他文件。 - 资源 - -linkresource:<resinfo> 将指定文件作为外部 程序集资源进行链接。 resinfo:<file>[,<name>[,public|private]] (缩写: -linkres) -nowin32manifest 默认清单不应嵌入 输出 PE 的清单部分。 -resource:<resinfo> 将指定文件作为嵌入式 程序集资源进行添加。 resinfo:<file>[,<name>[,public|private]] (缩写: -res) -win32icon:<file> 为默认的 Win32 资源 指定 Win32 图标文件(.ico)。 -win32manifest:<file> 提供的文件嵌入在 输出 PE 的清单部分。 -win32resource:<file> 指定 Win32 资源文件(.res)。 - 代码生成 - -optimize[+|-] 启用优化。 -removeintchecks[+|-] 删除整数检查。默认为“关”。 -debug[+|-] 发出调试信息。 -debug:full 发出完全调试信息(默认)。 -debug:pdbonly 发出完全调试信息。 -debug:portable 发出跨平台调试信息。 -debug:embedded 发出跨平台调试信息到 目标 .dll 或 .exe. -deterministic 生成确定性程序集 (包括模块版本 GUID 和时间戳) -refonly 生成引用程序集来替代主要输出 -instrument:TestCoverage 生成对其检测以收集覆盖率信息的t 程序集 -sourcelink:<file> 要嵌入到 PDB 中的源链接信息。 - 错误和警告 - -nowarn 禁用所有警告。 -nowarn:<number_list> 禁用个人警告列表。 -warnaserror[+|-] 将所有警告视为错误。 -warnaserror[+|-]:<number_list> 将警告列表视为错误。 -ruleset:<file> 指定禁用特定诊断的 规则集文件。 -errorlog:<file>[,version=<sarif_version>] 指定用于以 SARIF 格式记录所有编译器和分析器诊断的 文件。 sarif_version:{1|2|2.1} 默认为 1. 2 和 2.1 两者均表示 SARIF 版本 2.1.0。 -reportanalyzer 报告其他分析器信息，如 执行时间。 - 语言 - -define:<symbol_list> 声明全局条件编译 符号。symbol_list:name=value,... (缩写: -d) -imports:<import_list> 为引用的元数据文件中的命名空间声明 全局导入。 import_list:namespace,... -langversion:? 显示允许的语言版本值 -langversion:<string> 指定语言版本，如 “default” (最新主要版本)、 “latest” (最新版本，包括次要版本) 或 “14”、”15.3”等特定版本 -optionexplicit[+|-] 需要显示声明变量。 -optioninfer[+|-] 允许变量的类型推理。 -rootnamespace:<string> 指定所有类型声明的根 命名空间。 -optionstrict[+|-] 强制严格语言语义。 -optionstrict:custom 不遵从严格语言语义时 发出警告。 -optioncompare:binary 指定二进制样式的字符串比较。 这是默认设置。 -optioncompare:text 指定文本样式字符串比较。 - 杂项 - -help 显示此用法消息。(缩写: -?) -noconfig 不自动包括 VBC.RSP 文件。 -nologo 不显示编译器版权横幅。 -quiet 安静输出模式。 -verbose 显示详细消息。 -parallel[+|-] 并发生成。 -version 显示编译器版本号并退出。 - 高级 - -baseaddress:<number> 库或模块的基址 (十六进制)。 -checksumalgorithm:<alg> 指定计算存储在 PDB 中的源文件校验和 的算法。支持的值是: SHA1 或 SHA256 (默认)。 -codepage:<number> 指定打开源文件时要使用的 代码页。 -delaysign[+|-] 仅使用强名称密钥的公共部分 对程序集进行延迟签名。 -publicsign[+|-] 仅使用强名称密钥的公共部分 对程序集进行公共签名 -errorreport:<string> 指定处理内部编译器错误的方式； 必须是 prompt、send、none 或 queue (默认)。 -filealign:<number> 指定用于输出文件节的对齐 方式。 -highentropyva[+|-] 启用高平均信息量的 ASLR。 -keycontainer:<string> 指定强名称密钥容器。 -keyfile:<file> 指定强名称密钥文件。 -libpath:<path_list> 搜索元数据引用的目录 列表。(分号分隔。) -main:<class> 指定包含 Sub Main 的类 或模块。也可为从 System.Windows.Forms.Form 继承的类。 (缩写: -m) -moduleassemblyname:<string> 此模块所属程序集 的名称。 -netcf 以 .NET Compact Framework 为目标。 -nostdlib 不引用标准库 (system.dll 和 VBC.RSP 文件)。 -pathmap:<K1>=<V1>,<K2>=<V2>,... 按编译器指定源路径名称输出的 映射。 -platform:<string> 限制此代码可以在其上运行的平台； 必须是 x86、x64、Itanium、arm、arm64、 AnyCPU32BitPreferred 或 anycpu (默认)。 -preferreduilang 指定首选输出语言名称。 -nosdkpath 禁用搜索标准库程序集的默认 SDK 路径 -sdkpath:<path> .NET Framework SDK 目录的位置 (mscorlib.dll). -subsystemversion:<version> 指定输出 PE 的子系统版本。 version:<number>[.<number>] -utf8output[+|-] 以 UTF8 字符编码格式 发出编译器输出。 @<file> 从文本文件插入命令行设置 -vbruntime[+|-|*] 用/不用默认的 Visual Basic 运行时进行编译。 -vbruntime:<file> 使用 <file> 中的备用 Visual Basic 运行时 进行编译。
