Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: trees({0})
cs: stromy({0})
de: Bäume({0})
fr: arborescences({0})
it: alberi ({0})
ja: ツリー ({0})
ko: 트리({0})
pt_br: árvores({0})
ru: деревья({0})
tr: ağaçlar({0})
zh_hans: 树({0})

# WRN_AnalyzerReferencesNewerCompiler
source: The analyzer assembly '{0}' references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
it: L'assembly dell'analizzatore '{0}' fa riferimento alla versione '{1}' del compilatore, che è più recente della versione attualmente in esecuzione '{2}'.
ja: アナライザー アセンブリ '{0}' は、コンパイラのバージョン '{1}' を参照しています。これは、現在実行中のバージョン '{2}' よりも新しいバージョンです。
ko: 분석기 어셈블리 '{0}'은(는) 컴파일러의 '{1}' 버전을 참조하며, 이 버전은 현재 실행 중인 버전 '{2}'보다 최신 버전입니다.
pl: Zestaw analizatora „{0}” odwołuje się do wersji „{1}” kompilatora, która jest nowsza niż obecnie uruchomiona wersja „{2}”.
pt_br: O assembly do analisador '{0}' referencia a versão '{1}' do compilador, que é mais recente que a versão em execução no momento '{2}'.
ru: Сборка анализатора "{0}" ссылается на версию "{1}" компилятора, являющуюся более новой, чем версия "{2}".
tr: '{0}' çözümleyici bütünleştirilmiş kodu, derleyicinin şu anda çalışan '{2}' sürümünden daha yeni olan '{1}' sürümüne başvurur.

# WRN_AnalyzerReferencesNewerCompiler_Title
source: The analyzer assembly references a newer version of the compiler than the currently running version.
it: L'assembly dell'analizzatore fa riferimento alla versione del compilatore, che è più recente della versione attualmente in esecuzione.
ja: アナライザー アセンブリが参照しるコンパイラのバージョンは、現在実行中のバージョンよりも新しいです。
ko: 분석기 어셈블리는 현재 실행 중인 버전보다 최신 버전의 컴파일러를 참조합니다.
pl: Zestaw analizatora odwołuje się do nowszej wersji kompilatora niż obecnie uruchomiona wersja.
pt_br: O assembly do analisador faz referência a uma versão mais recente do compilador do que a versão em execução no momento.
ru: Сборка анализатора ссылается на более новую версию компилятора, чем установленная сейчас.
tr: Çözümleyici bütünleştirilmiş kodu, derleyicinin şu anda çalışandan daha yeni bir sürümüne başvurur.

# WRN_FileAlreadyIncluded
source: source file '{0}' specified multiple times
cs: Zdrojový soubor {0} je zadaný několikrát.
de: Quelldatei "{0}" mehrmals angegeben
fr: fichier source '{0}' indiqué plusieurs fois
it: il file di origine '{0}' è specificato più volte
ja: ソース ファイル '{0}' が複数回指定されています
ko: '{0}' 소스 파일을 여러 번 지정했습니다.
pl: plik źródłowy „{0}” został określony wiele razy
pt_br: arquivo de origem "{0}" especificado várias vezes
ru: Исходный файл "{0}" задан несколько раз.
tr: '{0}' kaynak dosyası birden çok kez belirtildi
zh_hans: 源文件“{0}”指定了多次

# WRN_FileAlreadyIncluded_Title
source: Source file specified multiple times
cs: Zdrojový soubor je zadaný několikrát.
de: Die Quelldatei wurde mehrere Male angegeben.
fr: Le fichier source a été spécifié plusieurs fois
it: Il file di origine è specificato più volte
ja: ソース ファイルが複数回指定されました
ko: 소스 파일이 여러 번 지정되었습니다.
pl: Plik źródłowy został określony wiele razy
pt_br: Arquivo de origem especificado várias vezes
ru: Исходный файл указан несколько раз
tr: Kaynak dosya birden çok kez belirtildi
zh_hans: 多次指定源文件

# WRN_InvalidWarningId
source: warning number '{0}' for the option '{1}' is either not configurable or not valid
cs: Číslo upozornění {0} pro parametr {1} není konfigurovatelné nebo není platné.
de: Warnung Nummer "{0}" für die Option "{1}" ist entweder nicht konfigurierbar oder ungültig
fr: le numéro d'avertissement '{0}' pour l'option '{1}' n'est pas configurable ou n'est pas valide
it: numero avviso '{0}' per l'opzione '{1}' non configurabile o non valido
ja: 警告番号 '{0}' (オプション '{1}' ) は、構成できないか無効です
ko: '{1}' 옵션에 대한 '{0}' 경고 번호를 구성할 수 없거나 잘못되었습니다.
pl: numeru ostrzeżenia „{0}” dla opcji „{1}” nie można skonfigurować lub jest on nieprawidłowy
pt_br: número de aviso "{0}" para a opção "{1}" não é configurável ou não é válido
ru: Номер предупреждения "{0}" для параметра "{1}" не настраивается или недопустим
tr: '{1}' seçeneği için '{0}' uyarı numarası yapılandırılamıyor veya geçerli değil
zh_hans: 选项“{1}”的警告编号“{0}”不可配置或无效

# WRN_InvalidWarningId_Title
source: Warning number is either not configurable or not valid
cs: Číslo upozornění není nakonfigurované nebo je neplatné.
de: Die Warnungsnummer kann nicht konfiguriert werden oder ist ungültig.
fr: Le numéro d’avertissement n’est pas configurable ou valide
it: Il numero di avviso non è configurabile o valido
ja: 警告番号は、構成できないか無効です
ko: 경고 번호가 구성 가능하지 않거나 잘못되었습니다.
pl: Nie można skonfigurować numeru ostrzeżenia lub numer jest nieprawidłowy
pt_br: O número de aviso não é configurável ou não é válido
ru: Номер предупреждения недоступен для настройки или недопустим
tr: Uyarı numarası yapılandırılamaz veya geçersiz
zh_hans: 警告编号不可配置或无效

# ERR_EncUpdateFailedMissingAttribute
source: Cannot update '{0}'; attribute '{1}' is missing.
cs: Nelze aktualizovat {0}; chybí atribut {1}.
de: "{0}" kann nicht aktualisiert werden. Das Attribut "{1}" fehlt.
fr: Impossible de mettre à jour '{0}' ; l'attribut '{1}' est manquant.
it: Non è possibile aggiornare '{0}'. Manca l'attributo '{1}'.
ja: '{0}' を更新できません。属性 '{1}' がありません。
ko: '{0}'을(를) 업데이트할 수 없습니다. 특성 '{1}'이(가) 없습니다.
pl: Nie można zaktualizować elementu „{0}”. Brak atrybutu „{1}”.
pt_br: Não é possível atualizar '{0}'; o atributo '{1}' está ausente.
ru: Невозможно обновить "{0}"; нет атрибута "{1}".
tr: '{0}' güncelleştirilemiyor; '{1}' özniteliği eksik.
zh_hans: 无法更新“{0}”；特性“{1}”缺失。

# ERR_ArrayInitForNonArray2
source: Array initializers are valid only for arrays, but the type of '{0}' is '{1}'.
cs: Inicializátory polí jsou platné jenom pro pole, ale {0} je typu {1}.
de: Arrayinitialisierer sind nur für Arrays gültig. Der Typ von "{0}" ist jedoch "{1}".
fr: Les initialiseurs de tableau ne sont valides que pour les tableaux, mais le type de '{0}' est '{1}'.
it: Gli inizializzatori di matrice sono validi solo per le matrici, ma il tipo di '{0}' è '{1}'.
ja: 配列初期化子は配列に対してのみ有効ですが、'{0}' の型は '{1}' です。
ko: 배열 이니셜라이저는 배열에만 유효하지만 '{0}'의 형식은 '{1}'입니다.
pl: Inicjatory tablic są prawidłowe tylko dla tablic, ale typem elementu „{0}” jest „{1}”.
pt_br: Inicializadores de matriz só são válidos para matrizes, mas o tipo de "{0}" é "{1}".
ru: Инициализаторы массивов допустимы только для массивов, а "{0}" имеет тип "{1}".
tr: Dizi başlatıcılar yalnızca diziler için geçerlidir; ancak '{0}' öğesinin türü '{1}'.
zh_hans: 数组初始值设定项仅对数组有效，但“{0}”的类型是“{1}”。

# WRN_UseSwitchInsteadOfAttribute
source: Use command-line option '{0}' or appropriate project settings instead of '{1}'.
cs: Namísto {1} použijte možnost příkazového řádku {0} nebo odpovídající nastavení projektu.
de: Verwenden Sie die Befehlszeilenoption "{0}" oder geeignete Projekteinstellungen anstelle von "{1}".
fr: Utilisez l'option de ligne de commande '{0}' ou les paramètres de projet appropriés plutôt que '{1}'.
it: Usare l'opzione della riga di comando '{0}' o le impostazioni di progetto appropriate invece di '{1}'.
ja: コマンド ライン オプション '{0}' を使用するか、'{1}' 以外の適切なプロジェクト設定を使用してください。
ko: '{1}' 대신 명령줄 옵션 '{0}' 또는 적합한 프로젝트 설정을 사용하세요.
pl: Użyj opcji wiersza polecenia „{0}” lub odpowiednich ustawień projektu zamiast elementu „{1}”.
pt_br: Use a opção de linha de comando "{0}" ou configurações de projeto apropriadas ao invés de "{1}".
ru: Используйте параметр командной строки "{0}" или подходящие параметры проекта вместо "{1}".
tr: '{1}' yerine '{0}' komut satırı seçeneğini veya uygun proje ayarlarını kullanın.
zh_hans: 请使用命令行选项“{0}”或适当的项目设置，而不是“{1}”。

# WRN_UseSwitchInsteadOfAttribute_Title
source: Use command-line option /keyfile, /keycontainer, or /delaysign instead of AssemblyKeyFileAttribute, AssemblyKeyNameAttribute, or AssemblyDelaySignAttribute
cs: Místo AssemblyKeyFileAttribute, AssemblyKeyNameAttribute nebo AssemblyDelaySignAttribute použijte parametr příkazového řádku /keyfile, /keycontainer nebo /delaysign.
de: Verwenden Sie die Befehlszeilenoption /keyfile, /keycontainer, oder /delaysign anstelle von AssemblyKeyFileAttribute, AssemblyKeyNameAttribute oder AssemblyDelaySignAttribute.
fr: Utilisez l’option de ligne de commande /keyfile, /keycontainer ou /delaysign au lieu de AssemblyKeyFileAttribute, AssemblyKeyNameAttribute ou AssemblyDelaySignAttribute
it: Usare l'opzione della riga di comando /keyfile, /keycontainer o /delaysign invece di AssemblyKeyFileAttribute, AssemblyKeyNameAttribute o AssemblyDelaySignAttribute
ja: AssemblyKeyFileAttribute、AssemblyKeyNameAttribute、または AssemblyDelaySignAttribute の代わりに、コマンド ライン オプション /keyfile、/keycontainer、または /delaysign を使用してください
ko: AssemblyKeyFileAttribute, AssemblyKeyNameAttribute 또는 AssemblyDelaySignAttribute 대신 명령줄 옵션 /keyfile, /keycontainer 또는 /delaysign 사용
pl: Użyj opcji wiersza polecenia /keyfile, /keycontainer lub /delaysign zamiast AssemblyKeyFileAttribute, AssemblyKeyNameAttribute lub AssemblyDelaySignAttribute
pt_br: Use a opção de linha de comando /keyfile, /keycontainer ou /delaysign em vez de AssemblyKeyFileAttribute, AssemblyKeyNameAttribute ou AssemblyDelaySignAttribute
ru: Используйте параметр командной строки /keyfile, /keycontainer или /delaysign вместо AssemblyKeyFileAttribute, AssemblyKeyNameAttribute или AssemblyDelaySignAttribute
tr: /keyfile, /keycontainer veya /delaysign komut satırı seçeneğini AssemblyKeyFileAttribute, AssemblyKeyNameAttribute veya AssemblyDelaySignAttribute yerine kullanın
zh_hans: 使用命令行选项 /keyfile、/keycontainer 或 /delaysign，而不要使用 AssemblyKeyFileAttribute、AssemblyKeyNameAttribute 或 AssemblyDelaySignAttribute

# WRN_QueryMissingAsClauseinVarDecl
source: Range variable is assumed to be of type Object because its type cannot be inferred. Use an 'As' clause to specify a different type.
cs: Předpokládá se, že proměnná rozsahu je typu Objekt, protože její typ nejde odvodit. Zadejte jiný typ pomocí klauzule As.
de: Für die Bereichsvariable wird der Typ "Object" angenommen, da ihr Typ nicht durch Rückschluss abgeleitet werden kann. Verwenden Sie eine As-Klausel, um einen anderen Typ anzugeben.
fr: La variable de portée est considérée comme étant de type Object, car son type ne peut pas être déduit. Utilisez une clause 'As' pour indiquer un type différent.
it: Si presuppone che la variabile di intervallo sia di tipo Object perché non è possibile dedurne il tipo. Usare una clausola 'As' per specificare un tipo diverso.
ja: 型を推論できないため、範囲変数は Object 型と見なされます。'As' 句を使って異なる型を指定してください。
ko: 형식을 유추할 수 없어 범위 변수가 Object 형식으로 간주됩니다. 'As' 절을 사용하여 다른 형식을 지정하세요.
pl: Przyjęto, że zmienna zakresu będzie typu Object, ponieważ nie można wywnioskować jej typu. Użyj klauzuli „As”, aby określić inny typ.
pt_br: Variável de intervalo é assumida como sendo do tipo Object porque seu tipo não pode ser inferido. Use uma cláusula "As" para especificar um tipo diferente.
ru: Предполагается, что переменная диапазона является типом Object, так как этот тип не может быть определен. Используйте предложение "As", чтобы указать другой тип.
tr: Aralık değişkeninin türü çıkarsanamadığından, Object türünde olduğu varsayıldı. Başka bir tür belirtmek için 'As' yan tümcesi kullanın.
zh_hans: 假定范围变量属于对象类型，因为无法推断其类型。请使用“As”子句指定不同类型。

# WRN_QueryMissingAsClauseinVarDecl_Title
source: Range variable is assumed to be of type Object because its type cannot be inferred
cs: Předpokládá se, že proměnná rozsahu je typu Object, protože se její typ nedá odvodit.
de: Es wird angenommen, dass die Bereichsvariable den Typ "Object" aufweist, da ihr Basistyp nicht abgeleitet werden kann.
fr: La variable de portée est considérée être de type Object, car son type ne peut pas être déduit
it: Si presuppone che la variabile di intervallo sia di tipo Object perché non è possibile dedurne il tipo
ja: 範囲変数の型を推論できないため、Object 型であると見なされます
ko: 형식을 유추할 수 없으므로 범위 변수를 Object 형식으로 가정함
pl: Przyjęto, że zmienna zakresu będzie typu Object, ponieważ nie można wywnioskować jej typu
pt_br: A variável de intervalo é assumida como do tipo Object porque seu tipo não pode ser inferido
ru: Предполагается, что переменная диапазона имеет тип Object, так как ее тип невозможно определить
tr: Aralık değişkeninin türü çıkarsanamadığından Object türü olarak kabul edilir
zh_hans: 范围变量被假设为 Object 类型，原因是无法推断它的类型

# ERR_InvalidVersionFormat2
source: The specified version string does not conform to the recommended format - major.minor.build.revision
cs: Zadaný řetězec verze není v souladu s doporučeným formátem – hlavní_verze.dílčí_verze.build.revize.
de: Die angegebene Versionszeichenfolge entspricht nicht dem empfohlenen Format: Hauptversion.Nebenversion.Build.Revision
fr: Le format de la chaîne de version spécifiée n'est pas conforme au format requis - major.minor.build.revision
it: La stringa di versione specificata non è conforme al formato consigliato: principale.secondaria.build.revisione
ja: 指定したバージョン文字列は、推奨される形式 (major.minor.build.revision) に従っていません
ko: 지정한 버전 문자열이 권장 형식 major.minor.build.revision을 따르지 않습니다.
pl: Określony ciąg wersji nie jest zgodny z zalecanym formatem — wersja_główna.wersja_pomocnicza.kompilacja.poprawka
pt_br: A cadeia de caracteres de versão especificada não está de acordo com o formato recomendado - major.minor.build.revision
ru: Указанная строка версии не соответствует рекомендованному формату — основной номер.дополнительный номер.сборка.редакция
zh_hans: 指定版本字符串不符合建议格式 - major.minor.build.revision

# ERR_InvalidDebugInfo
source: Unable to read debug information of method '{0}' (token 0x{1}) from assembly '{2}'
cs: Informace o ladění metody {0} (token 0x{1}) ze sestavení {2} nelze přečíst.
de: Die Debuginformationen der Methode "{0}" (Token 0x{1}) können nicht aus der Assembly "{2}" gelesen werden.
fr: Impossible de lire les informations de débogage de la méthode '{0}' (jeton 0x{1}) dans l'assembly '{2}'
it: Non è possibile leggere le informazione di debug del metodo '{0}' (token 0x{1}) dall'assembly '{2}'
ja: メソッド '{0}' (トークン 0x{1}) のデバッグ情報をアセンブリ '{2}' から読み取ることができません
ko: '{2}' 어셈블리에서 '{0}' 메서드(토큰 0x{1})의 디버그 정보를 읽을 수 없습니다.
pl: Nie można odczytać informacji debugowania metody „{0}” (token 0x{1}) z zestawu „{2}”
pt_br: Não é possível ler as informações de depuração do método '{0}' (token 0x{1}) do assembly '{2}'
ru: Не удается считать сведения об отладке метода "{0}" (маркер 0x{1}) из сборки "{2}".
tr: '{2}' bütünleştirilmiş kodundan '{0}' (simge 0 x{1}) metodunun hata ayıklama bilgileri okunamıyor
zh_hans: 无法从程序集“{2}”读取方法“{0}”(令牌 0x{1})的调试信息

# FEATURE_PrivateProtected
source: Private Protected
de: Privat geschützt
pl: Prywatny chroniony
pt_br: Protegido de Forma Privada
ru: Частный защищенный
