Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ClassInheritsInterfaceBaseUnifiesWithBase4
source: Cannot implement interface '{0}' because the interface '{1}' from which it inherits could be identical to interface '{2}' from which the implemented interface '{3}' inherits for some type arguments.
cs: Nejde implementovat rozhraní {0}, protože rozhraní {1}, ze kterého se dědí, by mohlo být u některých argumentů typů identické s rozhraním {2}, ze kterého dědí implementované rozhraní {3}.
de: Die Schnittstelle "{0}" kann nicht implementiert werden, da die Schnittstelle "{1}", von der geerbt wird, bei manchen Typargumenten möglicherweise mit der Schnittstelle "{2}" identisch ist, von der die implementierte Schnittstelle "{3}" erbt.
es: No se puede implementar la interfaz '{0}' porque la interfaz '{1}' de la que hereda podría ser idéntica a la interfaz '{2}' de la que la interfaz '{3}' implementada hereda para algunos argumentos de tipo.
fr: Impossible d'implémenter l'interface '{0}', car l'interface '{1}' dont elle hérite peut être identique à l'interface '{2}' dont l'interface '{3}' implémentée hérite pour certains arguments de type.
it: Non è possibile implementare l'interfaccia '{0}' perché l'interfaccia '{1}' da cui eredita potrebbe essere identica all'interfaccia '{2}' da cui eredita l'interfaccia '{3}' implementata per alcuni argomenti di tipo.
ja: インターフェイス '{0}' を実装できません。この継承元であるインターフェイス '{1}' と一部の型引数用に実装されたインターフェイス '{3}' の継承元であるインターフェイス '{2}' が同一である可能性があります。
ko: '{0}' 인터페이스를 구현할 수 없습니다. 이 인터페이스가 상속된 '{1}' 인터페이스가 일부 형식 인수에 대해 구현된 '{3}' 인터페이스가 상속된 '{2}' 인터페이스와 동일할 수 있습니다.
pl: Nie można zaimplementować interfejsu „{0}”, ponieważ interfejs „{1}”, po którym ten interfejs dziedziczy, może być taki sam jak interfejs „{2}”, po którym dziedziczy zaimplementowany interfejs „{3}” dla niektórych argumentów typu.
pt_br: Não é possível implementar a interface "{0}" porque a interface "{1}" da qual ela herda pode ser idêntica à interface "{2}" da qual a interface implementada "{3}" herda para alguns argumentos de tipo.
ru: Невозможно реализовать интерфейс "{0}", поскольку интерфейс "{1}", от которого он наследуется, может совпадать с интерфейсом "{2}", от которого наследуется реализованный интерфейс "{3}" для некоторых аргументов типа.
tr: Devralındığı '{1}' arabirimi bazı tür bağımsız değişkenleri için uygulanan '{3}' arabiriminin devralındığı '{2}' arabirimiyle özdeş olabileceğinden, '{0}' arabirimi uygulanamıyor.
zh_hans: 无法实现接口“{0}”，因为对于某些类型参数，它所继承的接口“{1}”可能与实现的接口“{3}”所继承的接口“{2}”相同。
zh_hant: 無法實作介面 '{0}'，因為它所繼承的介面 '{1}' 可能與某些類型引數的實作介面 '{3}' 所繼承之介面 '{2}' 相同。

# ERR_ClassInheritsInterfaceUnifiesWithBase3
source: Cannot implement interface '{0}' because it could be identical to interface '{1}' from which the implemented interface '{2}' inherits for some type arguments.
cs: Nejde implementovat rozhraní {0}, protože by mohlo být u některých argumentů typu identické s rozhraním {1}, ze kterého dědí implementované rozhraní {2}.
de: Die Schnittstelle "{0}" kann nicht implementiert werden, da sie bei manchen Typargumenten möglicherweise mit der Schnittstelle "{1}" identisch ist, von der die implementierte Schnittstelle "{2}" erbt.
es: No se puede implementar la interfaz '{0}' porque podría ser idéntica a la interfaz '{1}' de la que la interfaz '{2}' implementada hereda para algunos argumentos de tipo.
fr: Impossible d'implémenter l'interface '{0}', car elle peut être identique à l'interface '{1}' dont l'interface '{2}' implémentée hérite pour certains arguments de type.
it: Non è possibile implementare l'interfaccia '{0}' perché potrebbe essere identica all'interfaccia '{1}' da cui eredita l'interfaccia '{2}' implementata per alcuni argomenti di tipo.
ja: インターフェイス '{0}' を実装できません。このインターフェイスと一部の型引数用に実装されたインターフェイス '{2}' の継承元であるインターフェイス '{1}' が同一である可能性があります。
ko: '{0}' 인터페이스를 구현할 수 없습니다. 이 인터페이스가 일부 형식 인수에 대해 구현된 '{2}' 인터페이스가 상속된 '{1}' 인터페이스와 동일할 수 있습니다.
pl: Nie można zaimplementować interfejsu „{0}”, ponieważ może on być taki sam jak interfejs „{1}”, po którym dziedziczy zaimplementowany interfejs „{2}” dla niektórych argumentów typu.
pt_br: Não é possível implementar a interface "{0}" porque ela não poderia ser idêntica à interface "{1}" da qual a interface implementada "{2}" herda para alguns argumentos de tipo.
ru: Невозможно реализовать интерфейс "{0}", поскольку он может совпадать с интерфейсом "{1}", от которого наследуется реализованный интерфейс "{2}" для некоторых аргументов типа.
tr: Bazı tür bağımsız değişkenleri için uygulanan '{2}' arabiriminin devralındığı '{1}' arabirimiyle özdeş olabileceğinden '{0}' arabirimi uygulanamıyor.
zh_hans: 无法实现接口“{0}”，因为对于某些类型参数，它可能与实现的接口“{2}”所继承的接口“{1}”相同。
zh_hant: 無法實作介面 '{0}'，因為它可能與某些類型引數的實作介面 '{2}' 所繼承之介面 '{1}' 相同。

# ERR_OptionalsCantBeStructGenericParams
source: Generic parameters used as optional parameter types must be class constrained.
cs: Obecné parametry používané jako nepovinné typy parametrů musí mít omezení tříd.
de: Generische Parameter, die als optionale Parametertypen verwendet werden, müssen eine Klassenbeschränkung aufweisen.
es: Los parámetros genéricos usados como tipos de parámetro opcionales deben estar restringidos por clase.
fr: Les paramètres génériques utilisés en tant que types de paramètre optionnels doivent être contraints par classe.
it: I parametri generici usati come tipi di parametro facoltativi devono essere vincolati alla classe.
ja: 省略可能なパラメーター型として使用されるジェネリック パラメーターは、クラスの制約がある型でなければなりません。
ko: 선택적 매개 변수 형식으로 사용되는 제네릭 매개 변수는 클래스 제약 조건이 있어야 합니다.
pl: Parametry ogólne używane jako opcjonalne typy parametrów muszą mieć ograniczenia klasy.
pt_br: Parâmetros genéricos usados como tipos de parâmetro opcionais devem ser restringidos por classe.
ru: Общие параметры, используемые в качестве необязательных параметров типов, должны иметь ограничения класса.
tr: İsteğe bağlı parametre türleri olarak kullanılan genel parametreler sınıf kısıtlı olmalıdır.
zh_hans: 用作可选参数类型的泛型参数必须受类约束。
zh_hant: 用以做為選擇性參數類型的泛型參數，必須受到類別條件約束。

# ERR_AddressOfNullableMethod
source: Methods of 'System.Nullable(Of T)' cannot be used as operands of the 'AddressOf' operator.
cs: Metody System.Nullable(Of T) nejde používat jako operandy operátoru AddressOf.
de: Methoden von "System.Nullable(Of T)" können nicht als Operanden des AddressOf-Operators verwendet werden.
es: No se pueden usar los métodos de 'System.Nullable(Of T)' como operandos del operador 'AddressOf'.
fr: Les méthodes de 'System.Nullable(Of T)' ne peuvent pas être utilisées en tant qu'opérandes de l'opérateur 'AddressOf'.
it: Non è possibile usare i metodi di 'System.Nullable(Of T)' come operandi dell'operatore 'AddressOf'.
ja: System.Nullable(Of T)' のメソッドを 'AddressOf' 演算子のオペランドとして使用することはできません。
ko: System.Nullable(Of T)'의 메서드를 'AddressOf' 연산자의 피연산자로 사용할 수 없습니다.
pl: Nie można używać metod typu „System.Nullable(Of T)” jako argumentów operatora „AddressOf”.
pt_br: Os métodos de 'System.Nullable(Of T)' não podem ser usados como operandos do operador 'AddressOf'.
ru: Методы, принадлежащие "System.Nullable(Of T)", не могут использоваться как операнды для оператора "AddressOf".
tr: System.Nullable(Of T)' yöntemleri 'AddressOf' işlecinin işlenenleri olarak kullanılamaz.
zh_hans: “System.Nullable(Of T)”的方法不能用作“AddressOf”运算符的操作数。
zh_hant: System.Nullable(Of T)' 的方法無法做為 'AddressOf' 運算子的運算元

# ERR_IsOperatorNullable1
source: 'Is' operand of type '{0}' can be compared only to 'Nothing' because '{0}' is a nullable type.
cs: 'Operand Is typu {0} jde porovnat jenom s hodnotou Nothing, protože {0} je typ připouštějící hodnotu Null.
de: 'Ein Is-Operand vom Typ "{0}" kann nur mit "Nothing" verglichen werden, da "{0}" ein Typ ist, der NULL-Werte zulässt.
es: 'El operando 'Is' de tipo '{0}' solo se puede comparar con 'Nothing' porque '{0}' es un tipo que acepta valores NULL.
fr: 'L'opérande 'Is' de type '{0}' ne peut être comparé qu'à 'Nothing', car '{0}' est un type Nullable.
it: 'È possibile confrontare l'operando 'Is' del tipo '{0}' solo con 'Nothing' perché '{0}' è un tipo nullable.
ja: '{0}' は Null 許容型であるため、型 '{0}' の 'Is' オペランドは 'Nothing' とのみ比較できます。
ko: '{0}'은(는) null 허용 형식이므로 '{0}' 형식의 'Is' 피연산자는 'Nothing'과만 비교할 수 있습니다.
pl: 'Argument operacji „Is” typu „{0}” można porównać tylko z elementem „Nothing”, ponieważ typ „{0}” jest typem dopuszczającym wartość null.
pt_br: 'Operando "Is" do tipo "{0}" pode ser comparado somente a "Nothing" porque "{0}" é um tipo anulável.
ru: 'Операнд "Is" типа "{0}" можно сравнивать только с "Nothing", поскольку "{0}" является типом, допускающим значение Null.
tr: '{0}' null yapılabilir bir tür olduğundan, '{0}' türünün 'Is' işleneni yalnızca 'Nothing' ile karşılaştırılabilir.
zh_hans: '类型“{0}”是可以为 null 的类型，因此“{0}”的“Is”操作数只能与“Nothing”进行比较。
zh_hant: '類型 '{0}' 的 'Is' 運算元只能與 'Nothing' 進行比較，因為 '{0}' 是可為 Null 的類型。

# ERR_IsNotOperatorNullable1
source: 'IsNot' operand of type '{0}' can be compared only to 'Nothing' because '{0}' is a nullable type.
cs: 'Operand IsNot typu {0} jde porovnat jenom s hodnotou Nothing, protože {0} je typ připouštějící hodnotu Null.
de: 'Ein IsNot-Operand vom Typ "{0}" kann nur mit "Nothing" verglichen werden, da "{0}" ein Typ ist, der NULL-Werte zulässt.
es: 'El operando 'IsNot' de tipo '{0}' solo se puede comparar con 'Nothing' porque '{0}' es un tipo que acepta valores NULL.
fr: 'L'opérande 'IsNot' de type '{0}' ne peut être comparé qu'à 'Nothing', car '{0}' est un type Nullable.
it: 'È possibile confrontare l'operando 'IsNot' del tipo '{0}' solo con 'Nothing' perché '{0}' è un tipo nullable.
ja: '{0}' は Null 許容型であるため、型 '{0}' の 'IsNot' オペランドは 'Nothing' とのみ比較できます。
ko: '{0}'은(는) null 허용 형식이므로 '{0}' 형식의 'IsNot' 피연산자는 'Nothing'과만 비교할 수 있습니다.
pl: 'Argument operacji „IsNot” typu „{0}” można porównać tylko z elementem „Nothing”, ponieważ typ „{0}” jest typem dopuszczającym wartość null.
pt_br: 'Operando "IsNot" do tipo "{0}" pode ser comparado somente a "Nothing" porque "{0}" é um tipo anulável.
ru: 'Операнд "IsNot" типа "{0}" можно сравнивать только с "Nothing", поскольку "{0}" является типом, допускающим значение Null.
tr: '{0}' null yapılabilir bir tür olduğundan, '{0}' türünün 'IsNot' işleneni yalnızca 'Nothing' ile karşılaştırılabilir.
zh_hans: '类型“{0}”是可以为 null 的类型，因此“{0}”的“IsNot”操作数只能与“Nothing”进行比较。
zh_hant: '類型 '{0}' 的 'IsNot' 運算元只能與 'Nothing' 進行比較，因為 '{0}' 是可為 Null 的類型。

# ERR_ShadowingTypeOutsideClass1
source: '{0}' cannot be declared 'Shadows' outside of a class, structure, or interface.
cs: 'Pro člen {0} nejde použít deklaraci Shadows vně třídy, struktury nebo rozhraní.
de: '"{0}" kann nicht außerhalb einer Klasse, einer Struktur oder einer Schnittstelle als "Shadows" deklariert werden.
es: '{0}' no se puede declarar como 'Shadows' fuera de una clase, estructura o interfaz.
fr: '{0}' ne peut pas être déclaré 'Shadows' en dehors d'une classe, d'une structure ou d'une interface.
it: '{0}' non può essere dichiarato come 'Shadows' all'esterno di una classe, di una struttura o di un'interfaccia.
ja: '{0}' は、クラス、構造体、またはインターフェイス外部では 'Shadows' として宣言することはできません。
ko: '클래스, 구조체 또는 인터페이스 외부에서는 '{0}'을(를) 'Shadows'로 선언할 수 없습니다.
pl: 'Nie można zadeklarować elementu „{0}” jako „Shadows” poza klasą, strukturą lub interfejsem.
pt_br: "{0}" não pode ser declarado como "Shadows" fora de uma classe, estrutura ou interface.
ru: "{0}" невозможно объявить "Shadows" вне области класса, структуры или интерфейса.
tr: '{0}', bir sınıf, yapı veya arabirim dışında 'Shadows' olarak bildirilemez.
zh_hans: '“{0}”不能在类、结构或接口外声明为“Shadows”。
zh_hant: '{0}' 不可在類別、結構或介面外部宣告為 'Shadows'。

# ERR_PropertySetParamCollisionWithValue
source: Property parameters cannot have the name 'Value'.
cs: Parametry vlastností nemůžou mít název Value.
de: Eigenschaftenparameter können nicht den Namen "Value" haben.
es: Los parámetros de propiedad no pueden tener el nombre 'Value'.
fr: Les paramètres de propriété ne peuvent pas porter le nom 'Value'.
it: I parametri di proprietà non possono avere il nome 'Value'.
ja: Property パラメーターには 'Value' という名前は指定できません。
ko: 속성 매개 변수 이름에는 'Value'를 사용할 수 없습니다.
pl: Parametry właściwości nie mogą mieć nazwy Value.
pt_br: Parâmetros de propriedades não podem ter o nome 'Value'.
ru: Параметры свойств не могут иметь имя "Value".
tr: Özellik parametrelerinin adı 'Value' olamaz.
zh_hans: 属性参数的名称不能为 "Value"。
zh_hant: 屬性參數的名稱不可為 'Value'。

# ERR_SxSIndirectRefHigherThanDirectRef3
source: The project currently contains references to more than one version of '{0}', a direct reference to version {2} and an indirect reference to version {1}. Change the direct reference to use version {1} (or higher) of {0}.
cs: Projekt v současné době obsahuje odkazy na víc než jednu verzi {0}, přímý odkaz na verzi {2} a nepřímý odkaz na verzi {1}. Změňte přímý odkaz tak, aby používal verzi {1} (nebo vyšší) {0}.
de: Das Projekt enthält zurzeit Verweise auf mehrere Versionen von {0}, einen direkten Verweis auf Version {2} und einen indirekten Verweis auf Version {1}. Ändern Sie den direkten Verweis so, dass Version {1} (oder höher) von {0} verwendet wird.
es: El proyecto contiene actualmente referencias a más de una versión de '{0}', una referencia directa a la versión {2} y una referencia indirecta a la versión {1}. Cambie la referencia directa para que use la versión {1} (o posterior) de {0}.
fr: Le projet contient actuellement des références à plusieurs versions de '{0}', une référence directe à la version {2} et une référence indirecte à la version {1}. Modifiez la référence directe pour utiliser la version {1} (ou supérieure) de {0}.
it: Il progetto contiene attualmente riferimenti a più versioni di {0}, un riferimento diretto alla versione {2} e un riferimento indiretto alla versione {1}. Modificare il riferimento diretto in modo da usare la versione {1} o successiva di {0}.
ja: 現在、プロジェクトには、{0} の複数のバージョンへの参照、バージョン {2} への直接的な参照、およびバージョン {1} への間接的な参照が含まれています。{0} のバージョン {1} (またはそれ以降) を使用するには、直接的な参照を変更してください。
ko: 프로젝트에는 현재 두 가지 이상 버전의 '{0}' 참조, 즉 버전 {2}에 대한 직접 참조와 버전 {1}에 대한 간접 참조가 포함되어 있습니다. 버전 {1} 이상의 {0}을(를) 사용하려면 직접 참조를 변경하세요.
pl: Projekt obecnie zawiera odwołania do więcej niż jednej wersji elementu {0}, bezpośrednie odwołanie do wersji {2} i pośrednie odwołanie do wersji {1}. Zmień odwołanie bezpośrednie tak, aby używana w nim była wersja {1} (lub wyższa) elementu {0}.
pt_br: No momento, projeto contém referências a mais de uma versão de "{0}", uma referência direta à versão {2} e uma referência indireta à versão {1}. Altere a referência direta para usar a versão {1} (ou superior) de {0}.
ru: В настоящее время проект содержит ссылки на более чем одну версию "{0}", прямую ссылку на версию {2} и косвенную ссылку на версию {1}. Измените прямую ссылку на использование версии {1} (или выше) для {0}.
tr: Proje şu anda birden çok '{0}' sürümüne başvuru içeriyor: {2} sürümüne bir doğrudan başvuru ve {1} sürümüne bir dolaylı başvuru. Doğrudan başvuruyu, {0} {1} sürümünü (veya üstünü) kullanacak şekilde değiştirin.
zh_hans: 项目当前包含对多个版本的“{0}”的引用、对版本 {2} 的直接引用和对版本 {1} 的间接引用。请将直接引用更改为使用 {0} 的版本 {1} (或更高版本)。
zh_hant: 專案目前包含一個以上版本之 '{0}' 的參考、版本 {2} 的直接參考，以及版本 {1} 的間接參考。請變更直接參考以使用 {0} 的版本 {1} (或更新版本)。

# ERR_DuplicateReferenceStrong
source: Multiple assemblies with equivalent identity have been imported: '{0}' and '{1}'. Remove one of the duplicate references.
cs: Naimportovalo se víc sestavení s ekvivalentní identitou: {0} a {1}. Odeberte jeden z duplicitních odkazů.
de: Mehrere Assemblys mit äquivalenter Identität wurden importiert: "{0}" und "{1}". Entfernen Sie einen der doppelten Verweise.
es: Se han importado varios ensamblados con identidad equivalente: '{0}' y '{1}'. Quite una de las referencias duplicadas.
fr: Plusieurs assemblys ayant une identité équivalente ont été importés : '{0}' et '{1}'. Supprimez une des références en double.
it: Sono stati importati più assembly con identità equivalenti: '{0}' e '{1}'. Rimuovere uno dei riferimenti duplicati.
ja: ID が同一の複数のアセンブリ ('{0}' と '{1}') がインポートされました。重複している参照の一方を削除します。
ko: ID가 동일한 여러 어셈블리를 가져왔습니다('{0}', '{1}'). 중복된 참조 중 하나를 제거하세요.
pl: Zostało zaimportowanych wiele zestawów o równoważnej tożsamości: „{0}” i „{1}”. Usuń jedno ze zduplikowanych odwołań.
pt_br: Vários assemblies com identidade equivalente foram importados: "{0}" e "{1}". Remova uma das referências duplicadas.
ru: Импортировано несколько сборок с одинаковыми удостоверениями: "{0}" и "{1}". Удалите одну из повторяющихся ссылок.
tr: Eşdeğer kimlikli birden çok derleme içeri aktarıldı: '{0}' ve '{1}'. Yinelenen başvurulardan birini kaldırın.
zh_hans: 导入了具有等效标识的多个程序集:“{0}”和“{1}”。请删除重复引用之一。
zh_hant: 已匯入具有相同識別的多個組件: '{0}' 和 '{1}'。請移除其中一個重複的參考。

# ERR_DuplicateReference2
source: Project already has a reference to assembly '{0}'. A second reference to '{1}' cannot be added.
cs: Projekt už obsahuje odkaz na sestavení {0}. Druhý odkaz na {1} nejde přidat.
de: Das Projekt enthält bereits einen Verweis auf die Assembly "{0}". Es kann kein zweiter Verweis auf "{1}" hinzugefügt werden.
es: El proyecto ya tiene una referencia al ensamblado '{0}'. No se puede agregar una segunda referencia a '{1}'.
fr: Le projet a déjà une référence à l'assembly '{0}'. Une seconde référence à '{1}' ne peut pas être ajoutée.
it: Il progetto contiene già un riferimento all'assembly '{0}'. Non è possibile aggiungere un secondo riferimento a '{1}'.
ja: プロジェクトには既にアセンブリ '{0}' への参照が指定されています。'{1}' への 2 番目の参照を追加することはできません。
ko: 프로젝트에 이미 '{0}' 어셈블리에 대한 참조가 있습니다. '{1}'에 대한 두 번째 참조를 추가할 수 없습니다.
pl: Projekt już ma odwołanie do zestawu {0}. Nie można dodać drugiego odwołania do elementu „{1}”.
pt_br: Projeto já tem uma referência ao assembly "{0}". Uma segunda referência a "{1}" não pode ser adicionada.
ru: Проект уже содержит ссылку на сборку "{0}". Вторую ссылку на "{1}" добавить нельзя.
tr: Projenin '{0}' derlemesine zaten bir başvurusu var. İkinci bir '{1}' başvurusu eklenemez.
zh_hans: 项目已经具有对程序集“{0}”的引用。无法添加另一个对“{1}”的引用。
zh_hant: 專案已經有組件 '{0}' 的參考。無法對 '{1}' 加入第二個參考。

# ERR_IllegalCallOrIndex
source: Illegal call expression or index expression.
cs: Neplatný výraz volání nebo indexu
de: Ungültiger Aufruf- oder Indexausdruck.
es: Expresión de llamada o de índice no válida.
fr: Expression d'appel ou expression d'index non conforme.
it: L'espressione per la chiamata o l'indice non è valida.
ja: 呼び出し式またはインデックス式が無効です。
ko: 호출 식 또는 인덱스 식이 잘못되었습니다.
pl: Niedozwolone wyrażenie wywołania lub indeksu.
pt_br: Expressão de chamada ou de índice ilegal.
ru: Некорректное выражение call или index.
tr: Geçersiz çağrı ifadesi veya dizin ifadesi.
zh_hans: 非法的调用表达式或索引表达式。
zh_hant: 不合法的呼叫運算式或索引運算式。

# ERR_ConflictDefaultPropertyAttribute
source: Conflict between the default property and the 'DefaultMemberAttribute' defined on '{0}'.
cs: Došlo ke konfliktu mezi výchozí vlastností a vlastností DefaultMemberAttribute definovanou na {0}.
de: Konflikt zwischen der Standardeigenschaft und DefaultMemberAttribute (definiert in "{0}").
es: Hay un conflicto entre la propiedad predeterminada y el atributo 'DefaultMemberAttribute' definido en '{0}'.
fr: Conflit entre la propriété par défaut et le 'DefaultMemberAttribute' défini pour '{0}'.
it: Conflitto tra la proprietà predefinita e l'elemento 'DefaultMemberAttribute' definito in '{0}'.
ja: 既定プロパティと '{0}' 上で定義された 'DefaultMemberAttribute' の間の競合が発生しました。
ko: '{0}'에 정의된 'DefaultMemberAttribute'와 기본 속성이 충돌합니다.
pl: Konflikt między właściwością domyślną a elementem „DefaultMemberAttribute” zdefiniowanym w elemencie „{0}”.
pt_br: Conflito entre a propriedade padrão e "DefaultMemberAttribute" definido em "{0}".
ru: Свойство по умолчанию конфликтует с "DefaultMemberAttribute", определенным в "{0}".
tr: '{0}' üzerinde tanımlanan 'DefaultMemberAttribute' ile varsayılan özellik arasında çakışma var.
zh_hans: 默认属性与“{0}”上定义的“DefaultMemberAttribute”之间有冲突。
zh_hant: 預設屬性與 '{0}' 上定義的 'DefaultMemberAttribute' 相衝突。

# ERR_BadAttributeUuid2
source: '{0}' cannot be applied because the format of the GUID '{1}' is not correct.
cs: 'Atribut {0} nejde použít, protože formát čísla GUID {1} není správný.
de: '"{0}" kann nicht angewendet werden, da das Format von GUID "{1}" falsch ist.
es: 'No se puede aplicar '{0}' porque el formato del GUID '{1}' no es correcto.
fr: 'Impossible d'appliquer '{0}', car le format du GUID '{1}' n'est pas correct.
it: 'Non è possibile applicare '{0}' perché il formato del GUID '{1}' non è corretto.
ja: 'GUID '{1} の形式が正しくないため、'{0}' を適用できません。
ko: 'GUID '{1}'의 형식이 잘못되어 '{0}'을(를) 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „{0}”, ponieważ format identyfikatora GUID „{1}” jest niepoprawny.
pt_br: "{0}" não pode ser aplicado porque o formato do GUID "{1}" não está correto.
ru: "{0}" не может использоваться из-за неверного формата GUID "{1}".
tr: '{1}' GUID'sinin biçimi doğru olmadığından '{0}' uygulanamıyor.
zh_hans: 'GUID“{1}”的格式不正确，因此无法应用“{0}”。
zh_hant: '無法套用 '{0}'，因為 GUID '{1}' 的格式不正確。

# ERR_ComClassAndReservedAttribute1
source: 'Microsoft.VisualBasic.ComClassAttribute' and '{0}' cannot both be applied to the same class.
cs: 'Atributy Microsoft.VisualBasic.ComClassAttribute a {0} nejde použít pro tutéž třídu.
de: 'Microsoft.VisualBasic.ComClassAttribute und "{0}" können nicht zusammen auf dieselbe Klasse angewendet werden.
es: 'Microsoft.VisualBasic.ComClassAttribute' y '{0}' no se pueden aplicar a la vez a la misma clase.
fr: 'Impossible d'appliquer à la fois 'Microsoft.VisualBasic.ComClassAttribute' et '{0}' à la même classe.
it: 'Non è possibile applicare sia 'Microsoft.VisualBasic.ComClassAttribute' che '{0}' alla stessa classe.
ja: 'Microsoft.VisualBasic.ComClassAttribute' と '{0}' の両方を同じクラスに適用することはできません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'와 '{0}'을(를) 같은 클래스에 적용할 수 없습니다.
pl: 'Nie można zastosować elementów „Microsoft.VisualBasic.ComClassAttribute” i „{0}” w tej samej klasie.
pt_br: "Microsoft.VisualBasic.ComClassAttribute" e "{0}" não podem ser aplicados à mesma classe.
ru: '"Microsoft.VisualBasic.ComClassAttribute" и "{0}" не могут быть назначены одному классу.
tr: 'Hem 'Microsoft.VisualBasic.ComClassAttribute' hem de '{0}' aynı sınıfa birlikte uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”和“{0}”不能同时应用于同一个类。
zh_hant: '無法將 'Microsoft.VisualBasic.ComClassAttribute' 和 '{0}' 同時套用至相同的類別。
