Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ImplicitConversionCopyBack_Title
source: Implicit conversion in copying the value of 'ByRef' parameter back to the matching argument
cs: Implicitní převod kopíruje hodnotu parametru ByRef zpátky do odpovídajícího argumentu.
de: Implizite Konvertierung beim Kopieren des Werts des "ByRef"-Parameters zurück in das passende Argument
es: Conversión implícita al volver a copiar el valor del parámetro 'ByRef' en el argumento coincidente
fr: Conversion implicite lors de la copie de la valeur du paramètre 'ByRef dans l’argument correspondant
it: Conversione implicita durante la copia del valore del parametro 'ByRef' nell'argomento corrispondente
ja: ByRef' パラメーターの値を一致する引数に再びコピーするときの暗黙的な変換です
ko: ByRef' 매개 변수의 값을 일치하는 인수에 다시 복사할 때 수행되는 암시적 변환
pl: Niejawna konwersja podczas kopiowania wartości parametru „ByRef” z powrotem do pasującego argumentu
pt_br: Conversão implícita ao copiar o valor do parâmetro 'ByRef' de volta ao argumento correspondente
ru: Неявное преобразование при выполнении обратного копирования значения параметра ByRef в соответствующий аргумент
tr: ByRef' parametresinin değerini eşleşen bağımsız değişkene geri kopyalarken örtük dönüştürme
zh_hans: 在把 "ByRef" 参数的值复制回匹配参数的过程中进行隐式转换
zh_hant: 將 'ByRef' 參數的值複製回相符引數時的隱含轉換

# WRN_MustShadowOnMultipleInheritance2
source: {0} '{1}' conflicts with other members of the same name across the inheritance hierarchy and so should be declared 'Shadows'.
cs: {0} – {1} je v konfliktu s ostatními členy stejného názvu v hierarchii dědičnosti. Deklarace by tedy měla obsahovat klíčové slovo Shadows.
de: {0} "{1}" verursacht einen Konflikt mit anderen Membern mit dem gleichen Namen innerhalb der Vererbungshierarchie und sollte daher als "Shadows" deklariert werden.
es: {0} '{1}' entra en conflicto con otros miembros del mismo nombre en la jerarquía de herencia y, por tanto, se debe declarar como 'Shadows'.
fr: {0} '{1}' est en conflit avec d'autres membres du même nom dans la hiérarchie d'héritage et doit être déclaré 'Shadows'.
it: {0} '{1}' è in conflitto con altri membri con lo stesso nome nella gerarchia di ereditarietà, quindi deve essere dichiarato come 'Shadows'.
ja: {0} '{1}' は、継承階層間で、同じ名前の他のメンバーと競合しているため、'Shadows' と宣言しなければなりません。
ko: {0} '{1}'은(는) 상속 계층 구조에서 이름이 같은 다른 멤버와 충돌하므로 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” powoduje konflikt z innymi składowymi o tej samej nazwie w hierarchii dziedziczenia i dlatego powinien być zadeklarowany jako „Shadows”.
pt_br: {0} "{1}" está em conflito com outros membros do mesmo nome na hierarquia de herança e, portanto, deve ser declarado como "Shadows".
ru: {0} "{1}" конфликтует с другими членами с тем же именем в иерархии наследования и должен быть объявлен "Shadows".
tr: {0} '{1}', devralma hiyerarşisi genelinde aynı adlı diğer üyelerle çakışıyor; bu nedenle 'Shadows' olarak bildirilmelidir.
zh_hans: {0}“{1}”与继承层次结构中的其他同名成员冲突，因此应声明为“Shadows”。
zh_hant: {0} '{1}' 與其他跨繼承階層的同名成員互相衝突，所以應宣告為 'Shadows'。

# WRN_MustShadowOnMultipleInheritance2_Title
source: Method conflicts with other members of the same name across the inheritance hierarchy and so should be declared 'Shadows'
cs: Metoda je v konfliktu s dalšími členy se stejným názvem kdekoli v hierarchii dědičnosti, takže by se měla deklarovat jako Shadows.
de: Die Methode steht mit anderen Membern desselben Namens in der Vererbungshierarchie in Konflikt und sollte daher als "Shadows" deklariert werden.
es: El método está en conflicto con otros miembros del mismo nombre en la jerarquía de herencia y, por lo tanto, se debe declarar como “Shadows”
fr: La méthode est en conflit avec d’autres membres du même nom dans la hiérarchie d’héritage. Par conséquent, elle devrait être déclarée 'Shadows'
it: Il metodo è in conflitto con altri membri con lo stesso nome nella gerarchia di ereditarietà, quindi deve essere dichiarato come 'Shadows'
ja: 継承階層内で、メソッドが同じ名前の他のメンバーと競合しているため、'Shadows' と宣言されなければなりません
ko: 메서드가 상속 계층 구조에서 이름이 같은 다른 멤버와 충돌하므로 'Shadows'로 선언해야 함
pl: Wystąpił konflikt metody z innymi składowymi o tej samej nazwie w hierarchii dziedziczenia — należy zadeklarować element „Shadows”
pt_br: O método está em conflito com outros membros de mesmo nome na hierarquia de herança, devendo por isso deve ser declarado como 'Shadows'
ru: Метод конфликтует с другими членами того же имени в иерархии наследования, поэтому должен быть объявлен как Shadows
tr: Metot, devralma hiyerarşisindeki aynı ada sahip diğer üyelerle çakışıyor ve bu nedenle 'Shadows' olarak bildirilmeli
zh_hans: 方法与继承层次结构中的其他同名成员冲突，因此应声明为 "Shadows"
zh_hant: 方法與繼承階層中的其他同名成員互相衝突，因此應該宣告為 'Shadows'

# WRN_RecursiveOperatorCall
source: Expression recursively calls the containing Operator '{0}'.
cs: Výraz rekurzivně volá nadřazený operátor {0}.
de: Der Ausdruck ruft rekursiv den enthaltenden {0}-Operator auf.
es: La expresión llama recursivamente al operador '{0}' contenedor.
fr: L'expression appelle de manière récursive l'opérateur conteneur '{0}'.
it: L'espressione chiama in modo ricorsivo l'operatore '{0}' che la contiene.
ja: 式は、含まれている演算子 '{0}' を再帰的に呼び出します。
ko: 포함하는 '{0}' 연산자를 식이 재귀적으로 호출합니다.
pl: Wyrażenie cyklicznie wywołuje zawierający je operator „{0}”.
pt_br: A expressão chama recursivamente o Operador recipiente "{0}".
ru: Выражение рекурсивно вызывает содержащийся оператор "{0}".
tr: İfade, kapsayan '{0}' İşlecini yinelemeli olarak çağırıyor.
zh_hans: 表达式以递归方式调用包含运算符“{0}”。
zh_hant: 運算式遞迴呼叫包含運算子 '{0}'。

# WRN_RecursiveOperatorCall_Title
source: Expression recursively calls the containing Operator
cs: Výraz volá rekurzivně nadřazený operátor.
de: Durch den Ausdruck wird der enthaltende Operator rekursiv aufgerufen.
es: La expresión llama recursivamente al operador que contiene
fr: L’expression appelle de manière récursive l’opérateur conteneur
it: L'espressione chiama in modo ricorsivo l'operatore che la contiene
ja: 式は、包含する演算子を再帰的に呼び出しています
ko: 포함하는 연산자를 식이 재귀적으로 호출함
pl: Wyrażenie rekursywnie wywołuje zawierający je operator
pt_br: A expressão chama recursivamente o Operador recipiente
ru: Выражение рекурсивно вызывает содержащий его оператор
tr: İfade, kapsayan İşleci yinelemeli olarak çağırıyor
zh_hans: 表达式递归调用包含运算符
zh_hant: 運算式會遞迴呼叫包含運算子

# WRN_ImplicitConversion2
source: Implicit conversion from '{0}' to '{1}'.
cs: Implicitní převod z {0} na {1}
de: Implizite Konvertierung von "{0}" in "{1}".
es: Conversión implícita de '{0}' a '{1}'.
fr: Conversion implicite de '{0}' en '{1}'.
it: Conversione implicita da '{0}' a '{1}'.
ja: '{0}' から '{1}' への暗黙的な変換。
ko: '{0}'에서 '{1}'(으)로의 암시적 변환입니다.
pl: Niejawna konwersja z „{0}” na „{1}”.
pt_br: Conversão implícita de "{0}" para "{1}".
ru: Неявное преобразование "{0}" в "{1}".
tr: '{1}' ile '{0}' arasında örtük dönüştürme.
zh_hans: 从“{0}”到“{1}”的隐式转换。
zh_hant: 從 '{0}' 隱含轉換至 '{1}'。

# WRN_ImplicitConversion2_Title
source: Implicit conversion
cs: Implicitní převod
de: Implizite Konvertierung
es: Conversión implícita
fr: Conversion implicite
it: Conversione implicita
ja: 暗黙的な変換です
ko: 암시적 변환
pl: Niejawna konwersja
pt_br: Conversão implícita
ru: Неявное преобразование
tr: Örtük dönüştürme
zh_hans: 隐式转换
zh_hant: 隱含轉換

# WRN_MutableStructureInUsing
source: Local variable '{0}' is read-only and its type is a structure. Invoking its members or passing it ByRef does not change its content and might lead to unexpected results. Consider declaring this variable outside of the 'Using' block.
cs: Lokální proměnná {0} je jenom pro čtení a její typ je struktura. Vyvolání jejích členů nebo jejich předání pomocí klíčového slova ByRef nezmění její obsah a může vést k neočekávaným výsledkům. Zvažte deklarování této proměnné mimo blok Using.
de: Die lokale Variable "{0}" ist schreibgeschützt, und der Typ ist eine Struktur. Beim Aufrufen der dazugehörigen Member oder bei einer ByRef-Übergabe wird der Inhalt nicht geändert. Dies kann zu unerwarteten Ergebnissen führen. Deklarieren Sie diese Variable ggf. außerhalb des Using-Blocks.
es: La variable local '{0}' es de solo lectura y su tipo es una estructura. Si se invocan sus miembros o se pasa ByRef, no cambia su contenido y puede dar lugar a resultados inesperados. Puede declarar esta variable fuera del bloque 'Using'.
fr: La variable locale '{0}' est en lecture seule et son type est une structure. L'appel de ses membres ou le passage de ByRef ne modifie pas son contenu et peut provoquer des résultats inattendus. Déclarez cette variable en dehors du bloc 'Using'.
it: La variabile locale '{0}' è di sola lettura e il relativo tipo è una struttura. La chiamata ai membri o il passaggio ByRef non ne modifica il contenuto e potrebbe produrre risultati imprevisti. Provare a dichiarare la variabile all'esterno del blocco 'Using'.
ja: ローカル変数 '{0}' は読み取り専用であり、その型は構造体です。変数のメンバーを呼び出したり、変数を ByRef で渡したりしても、その内容は変更されず、予期しない結果になる可能性があります。'Using' ブロックの外側でこの変数を宣言することを検討してください。
ko: 지역 변수 '{0}'은(는) 읽기 전용이며 형식이 구조체입니다. 해당 멤버를 호출하거나 ByRef로 전달하면 해당 내용이 변경되지 않으므로 예기치 않은 결과가 발생할 수 있습니다. 이 변수는 'Using' 블록 외부에 선언하세요.
pl: Zmienna lokalna „{0}” jest tylko do odczytu i jej typ jest strukturą. Wywoływanie jej składowych lub przekazywanie jej przez odwołanie (ByRef) nie zmienia jej zawartości i może prowadzić do nieoczekiwanych wyników. Rozważ zadeklarowanie tej zmiennej poza blokiem „Using”.
pt_br: Variável local "{0}" é somente leitura e seu tipo é uma estrutura. Invocar seus membros ou passá-la ByRef não altera seu conteúdo e pode levar a resultados inesperados. Considere declarar essa variável fora do bloco "Using".
ru: Локальная переменная "{0}" доступна только для чтения и ее тип является структурой. Вызов членов или передача ByRef не меняет ее содержания и может привести к непредвиденным результатам. Попробуйте объявить переменную за пределами блока "Using".
tr: '{0}' yerel değişkeni salt okunur ve yapı türünde. Üyelerini çağırmak veya bunu ByRef olarak geçirmek içeriğini değiştirmez ve beklenmeyen sonuçlara neden olabilir. Bu değişkeni 'Using' bloğu dışında bildirebilirsiniz.
zh_hans: 局部变量“{0}”是只读的并且其类型是结构。调用此变量的成员或通过 ByRef 传递它不会更改其内容，并可能导致意外的错误。考虑在“Using”块之外声明此变量。
zh_hant: 區域變數 '{0}' 是唯讀變數，且其類型為結構。叫用其成員或將 ByRef 傳遞給它，並不會變更其內容，但可能導致非預期的結果。請考慮在 'Using' 區塊外宣告此變數。

# WRN_MutableStructureInUsing_Title
source: Local variable declared by Using statement is read-only and its type is a structure
cs: Lokální proměnná deklarovaná příkazem Using je jen pro čtení a je strukturálního typu.
de: Die von der Using-Anweisung deklarierte lokale Variable ist schreibgeschützt, und ihr Typ ist eine Struktur.
es: La variable local declarada por la instrucción Using es de solo lectura y su tipo es una estructura
fr: La variable locale déclarée à l’aide d’une instruction Using est en lecture seule et son type est une structure
it: La variabile locale dichiarata dall'istruzione Using è di sola lettura e il relativo tipo è una struttura
ja: Using ステートメントで宣言されているローカル変数は読み取り専用で、構造体型です
ko: Using 문으로 선언된 지역 변수가 읽기 전용이며 해당 형식이 구조임
pl: Zmienna lokalna zadeklarowana przez instrukcję Using jest przeznaczona tylko do odczytu i jej typem jest struktura
pt_br: A variável local declarada pela instrução Using é somente leitura e seu tipo é uma estrutura
ru: Локальная переменная, объявленная оператором Using, доступна только для чтения и имеет тип структуры
tr: Using deyimi tarafından bildirilen yerel değişken salt okunur ve yapı türünde
zh_hans: Using 语句声明的局部变量是只读的，它的类型是一种结构
zh_hant: Using 陳述式所宣告的區域變數是唯讀變數，且其類型為一結構

# WRN_MutableGenericStructureInUsing
source: Local variable '{0}' is read-only. When its type is a structure, invoking its members or passing it ByRef does not change its content and might lead to unexpected results. Consider declaring this variable outside of the 'Using' block.
cs: Lokální proměnná {0} je jenom pro čtení. Když je její typ struktura, vyvolání jeho členů nebo jejich předání pomocí klíčového slova ByRef nezmění její obsah a může vést k neočekávaným výsledkům. Zvažte deklarování této proměnné mimo blok Using.
de: Die lokale Variable "{0}" ist schreibgeschützt. Wenn ihr Typ eine Struktur ist, wird beim Aufrufen der dazugehörigen Member oder bei einer ByRef-Übergabe der Inhalt nicht geändert. Dies kann zu unerwarteten Ergebnissen führen. Deklarieren Sie diese Variable ggf. außerhalb des Using-Blocks.
es: La variable local '{0}' es de solo lectura. Cuando su tipo es una estructura, si se invocan sus miembros o se pasa ByRef, no cambia su contenido y puede dar lugar a resultados inesperados. Puede declarar esta variable fuera del bloque 'Using'.
fr: La variable locale '{0}' est en lecture seule. Lorsque son type est une structure, l'appel de ses membres ou le passage de ByRef ne modifie pas son contenu et peut provoquer des résultats inattendus. Déclarez cette variable en dehors du bloc 'Using'.
it: La variabile locale '{0}' è di sola lettura. Se il tipo della variabile è una struttura, la chiamata ai membri o il passaggio ByRef non ne modifica il contenuto e potrebbe produrre risultati imprevisti. Provare a dichiarare la variabile all'esterno del blocco 'Using'.
ja: ローカル変数 '{0}' は読み取り専用です。変数の型が構造体の場合、変数のメンバーを呼び出したり、変数を ByRef で渡したりしても、その内容は変更されず、予期しない結果になる可能性があります。'Using' ブロックの外側でこの変数を宣言することを検討してください。
ko: 지역 변수 '{0}'은(는) 읽기 전용입니다. 해당 형식이 구조체인 경우 해당 멤버를 호출하거나 ByRef로 전달하면 해당 내용이 변경되지 않으므로 예기치 않은 결과가 발생할 수 있습니다. 이 변수는 'Using' 블록 외부에 선언하세요.
pl: Zmienna lokalna „{0}” jest tylko do odczytu. Gdy jej typ jest strukturą, wywoływanie jej składowych lub przekazywanie jej przez odwołanie (ByRef) nie zmienia jej zawartości i może prowadzić do nieoczekiwanych wyników. Rozważ zadeklarowanie tej zmiennej poza blokiem „Using”.
pt_br: Variável local "{0}" é somente leitura. Quando seu tipo é uma estrutura, invocar seus membros ou passá-lo ByRef não altera seu conteúdo e pode levar a resultados inesperados. Considere declarar essa variável fora do bloco "Using".
ru: Локальная переменная "{0}" доступна только для чтения. Если ее тип является структурой, вызов членов или передача ByRef не меняет ее содержания и может привести к непредвиденным результатам. Попробуйте объявить переменную за пределами блока "Using".
tr: '{0}' yerel değişkeni salt okunur. Bunun türü yapı olduğunda, üyelerini çağırmak veya bunu ByRef olarak geçirmek içeriğini değiştirmez ve beklenmeyen sonuçlara neden olabilir. Bu değişkeni 'Using' bloğu dışında bildirebilirsiniz.
zh_hans: 局部变量“{0}”是只读的。其类型为结构时，调用其成员或使用 ByRef 传递该类型不会更改其内容，并可能会导致意外的结果。考虑在“Using”块之外声明此变量。
zh_hant: 區域變數 '{0}' 是唯讀變數。當其類型為結構時，叫用它的成員或將 ByRef 傳遞給它，並不會變更其內容，但可能導致非預期的結果。請考慮在 'Using' 區塊外宣告此變數。

# WRN_MutableGenericStructureInUsing_Title
source: Local variable declared by Using statement is read-only and its type may be a structure
cs: Lokální proměnná deklarovaná příkazem Using je jen pro čtení a mohla by být strukturálního typu.
de: Die von der Using-Anweisung deklarierte lokale Variable ist schreibgeschützt, und ihr Typ ist möglicherweise eine Struktur.
es: La variable local declarada por la instrucción Using es de solo lectura y es posible que su tipo sea una estructura
fr: La variable locale déclarée à l’aide d’une instruction Using est en lecture seule et son type peut être une structure
it: La variabile locale dichiarata dall'istruzione Using è di sola lettura e il relativo tipo può essere una struttura
ja: Using ステートメントで宣言されているローカル変数は読み取り専用で、構造体型である可能性があります
ko: Using 문으로 선언된 지역 변수가 읽기 전용이며 해당 형식이 구조일 수 있음
pl: Zmienna lokalna zadeklarowana przez instrukcję Using jest przeznaczona tylko do odczytu i jej typem może być struktura
pt_br: A variável local declarada pela instrução Using é somente leitura e seu tipo pode ser uma estrutura
ru: Локальная переменная, объявленная оператором Using, доступна только для чтения и может иметь тип структуры
tr: Using deyimi tarafından bildirilen yerel değişken salt okunur ve bu değişken yapı türünde olabilir
zh_hans: Using 语句声明的局部变量是只读的，它的类型可能是一种结构
zh_hant: Using 陳述式所宣告的區域變數是唯讀變數，且其類型可能為一結構

# WRN_ImplicitConversionSubst1_Title
source: Implicit conversion
cs: Implicitní převod
de: Implizite Konvertierung
es: Conversión implícita
fr: Conversion implicite
it: Conversione implicita
ja: 暗黙的な変換です
ko: 암시적 변환
pl: Niejawna konwersja
pt_br: Conversão implícita
ru: Неявное преобразование
tr: Örtük dönüştürme
zh_hans: 隐式转换
zh_hant: 隱含轉換

# WRN_LateBindingResolution
source: Late bound resolution; runtime errors could occur.
cs: Rozpoznání s pozdní vazbou; mohlo by dojít k chybám za běhu.
de: Spät gebundene Auflösung. Laufzeitfehler sind möglich.
es: Resolución enlazada en tiempo de ejecución; pueden darse errores en tiempo de ejecución.
fr: Résolution à liaison tardive ; des erreurs d'exécution peuvent se produire.
it: Risoluzione con associazione tardiva. Potrebbero verificarsi errori di runtime.
ja: 遅延バインディングの解決です。ランタイム エラーが発生する可能性があります。
ko: 런타임에 바인딩을 확인합니다. 런타임 오류가 발생할 수 있습니다.
pl: Rozpoznanie późnego wiązania; mogą wystąpić błędy w czasie wykonywania.
pt_br: Resolução de associação tardia; poderão ocorrer erros de tempo de execução.
ru: Позднее разрешение перегруженных объектов; возможна ошибка времени выполнения.
tr: Geç bağlanan çözümleme; çalışma zamanı hataları oluşabilir.
zh_hans: 后期绑定解决方案；可能会发生运行时错误。
zh_hant: 晚期繫結解析; 可能發生執行階段錯誤。

# WRN_LateBindingResolution_Title
source: Late bound resolution
cs: Rozpoznání s pozdní vazbou
de: Spät gebundene Auflösung
es: Resolución enlazada en tiempo de ejecución
fr: Résolution à liaison tardive
it: Risoluzione con associazione tardiva
ja: 遅延バインディングの解決です
ko: 런타임에 바인딩 확인
pl: Rozpoznawanie późnego wiązania
pt_br: Resolução de ligação tardia
ru: Динамическое разрешение границ
tr: Geç bağlanan çözümleme
zh_hans: 后期绑定解决方案
zh_hant: 晚期繫結解析

# WRN_ObjectMath1
source: Operands of type Object used for operator '{0}'; use the 'Is' operator to test object identity.
cs: Operandy typu Object jsou použité pro operátor {0}; k otestování identity objektu použijte operátor Is.
de: Für den {0}-Operator werden Operanden vom Typ "Object" verwendet. Verwenden Sie den Is-Operator, um die Objektidentität zu testen.
es: Se han usado operandos del tipo Object para el operador '{0}'; use el operador 'Is' para probar la identidad del objeto.
fr: Opérandes de type Object utilisés pour l'opérateur '{0}' ; utilisez l'opérateur 'Is' pour tester l'identité de l'objet.
it: Sono stati usati operandi di tipo Object per l'operatore '{0}'. Usare l'operatore 'Is' per verificare l'identità dell'oggetto.
ja: 演算子 '{0}' に対して使用される Object 型のオペランドです。オブジェクト ID をテストするには、'Is' 演算子を使用してください。
ko: '{0}' 연산자에 대해 Object 형식의 피연산자를 사용했습니다. 개체 ID를 테스트하려면 'Is' 연산자를 사용하세요.
pl: Argumenty operacji typu Object użyte dla operatora „{0}”; użyj operatora „Is”, aby sprawdzić tożsamość obiektu.
pt_br: Operandos do tipo Object usados para o operador "{0}"; use o operador "Is" para testar a identidade do objeto.
ru: Операнды типа Object, используемые для оператора "{0}"; используется оператор "Is", чтобы проверить идентификатор объекта.
tr: '{0}' işleci için kullanılan Object türünde işlenenler; nesne kimliğini test etmek için 'Is' işlecini kullanın.
zh_hans: 对运算符“{0}”使用了 Object 类型的操作数；应使用“Is”运算符来测试对象标识。
zh_hant: 供運算子 '{0}' 使用之 Object 類型的運算元; 請使用 'Is' 運算子測試物件識別。

# WRN_ObjectMath1_Title
source: Operands of type Object used for operator
cs: V operátoru se používají operandy typu Object.
de: Für den Operator werden Operanden vom Typ "Object" verwendet.
es: Operandos de tipo Object usados para el operador
fr: Opérandes de type Object utilisés pour l’opérateur
it: Sono stati usati operandi di tipo Object per l'operatore
ja: 演算子に使用される Object 型のオペランドです
ko: 연산자에 대해 Object 형식의 피연산자를 사용함
pl: Dla operatora użyto argumentów operacji typu Object
pt_br: Operandos do tipo Object usados pelo operador
ru: В операторе используются операнды типа Object
tr: İşleç için kullanılan Object türündeki işlenenler
zh_hans: 为运算符使用的 Object 类型的操作数
zh_hant: 對運算子使用了 Object 類型的運算元

# WRN_ObjectMath2
source: Operands of type Object used for operator '{0}'; runtime errors could occur.
cs: Pro operátor {0} jsou použité operandy typu Object; mohlo by dojít k chybám při spuštění.
de: Für den {0}-Operator werden Operanden vom Typ "Object" verwendet. Dies kann Laufzeitfehler verursachen.
es: Se han usado operandos del tipo Object para el operador '{0}'; pueden darse errores en tiempo de ejecución.
fr: Opérandes de type Object utilisés pour l'opérateur '{0}' ; des erreurs d'exécution peuvent se produire.
it: Sono stati usati operandi di tipo Object per l'operatore '{0}'. Potrebbero verificarsi errori di runtime.
ja: 演算子 '{0}' に対して使用される Object 型のオペランドです。ランタイム エラーが発生する可能性があります。
ko: '{0}' 연산자에 대해 Object 형식의 피연산자를 사용했습니다. 런타임 오류가 발생할 수 있습니다.
pl: Argumenty operacji typu Object użyte dla operatora „{0}”; mogą wystąpić błędy podczas wykonywania.
pt_br: Operandos do tipo objeto usados pelo operador "{0}"; erros de runtime poderiam ocorrer.
ru: Операнды типа Object, используемые для оператора "{0}"; возможна ошибка выполнения.
tr: '{0}' işleci için kullanılan Object türünde işlenenler; çalışma zamanı hataları oluşabilir.
zh_hans: 对运算符“{0}”使用了 Object 类型的操作数；可能会发生运行时错误。
zh_hant: 供運算子 '{0}' 使用之 Object 類型的運算元; 可能會發生執行階段錯誤。

# WRN_ObjectMath2_Title
source: Operands of type Object used for operator
cs: V operátoru se používají operandy typu Object.
de: Für den Operator werden Operanden vom Typ "Object" verwendet.
es: Operandos de tipo Object usados para el operador
fr: Opérandes de type Object utilisés pour l’opérateur
it: Sono stati usati operandi di tipo Object per l'operatore
ja: 演算子に使用される Object 型のオペランドです
ko: 연산자에 대해 Object 형식의 피연산자를 사용함
pl: Dla operatora użyto argumentów operacji typu Object
pt_br: Operandos do tipo Object usados pelo operador
ru: В операторе используются операнды типа Object
tr: İşleç için kullanılan Object türündeki işlenenler
zh_hans: 为运算符使用的 Object 类型的操作数
zh_hant: 對運算子使用了 Object 類型的運算元

# WRN_ObjectAssumedVar1_Title
source: Variable declaration without an 'As' clause
cs: Deklarace proměnné bez klauzule As
de: Variablendeklaration ohne "As"-Klausel
es: Declaración de variable sin cláusula 'As'
fr: Déclaration de variable sans clause 'As'
it: Dichiarazione di variabile senza una clausola 'As'
ja: As' 句のない変数の宣言です
ko: As' 절이 없는 변수 선언
pl: Deklaracja zmiennej bez klauzuli „As”
pt_br: Declaração de variável sem uma cláusula 'As'
ru: Объявление переменной без предложения As
tr: Değişken bildiriminde 'As' yan tümcesi yok
zh_hans: 变量声明没有 "As" 子句
zh_hant: 變數宣告沒有 'As' 子句

# WRN_ObjectAssumed1_Title
source: Function without an 'As' clause
cs: Funkce bez klauzule As
de: Funktion ohne "As"-Klausel
es: Función sin cláusula 'As'
fr: Fonction sans clause 'As'
it: Funzione senza una clausola 'As'
ja: As' 句のない関数です
ko: As' 절이 없는 함수
pl: Funkcja bez klauzuli „As”
pt_br: Função sem uma cláusula 'As'
ru: Функция без предложения As
tr: İşlevde 'As' yan tümcesi yok
zh_hans: 函数没有 "As" 子句
zh_hant: 函式沒有 'As' 子句

# WRN_ObjectAssumedProperty1_Title
source: Property without an 'As' clause
cs: Vlastnost bez klauzule As
de: Eigenschaft ohne "As"-Klausel
es: Propiedad sin cláusula 'As'
fr: Propriété sans clause 'As'
it: Proprietà senza una clausola 'As'
ja: As' 句のないプロパティです
ko: As' 절이 없는 속성
pl: Właściwość bez klauzuli „As”
pt_br: Propriedade sem uma cláusula 'As'
ru: Свойство без предложения As
tr: Özellikte 'As' yan tümcesi yok
zh_hans: 属性没有 "As" 子句
zh_hant: 屬性沒有 'As' 子句
