Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ReferencedAssemblyDoesNotHaveStrongName_Title
source: Referenced assembly does not have a strong name
cs: Odkazované sestavení nemá silný název.
de: Referenzierte Assembly hat keinen starken Namen
es: El ensamblado al que se hace referencia no tiene un nombre seguro
fr: L'assembly référencé n'a pas de nom fort
it: L'assembly di riferimento non ha un nome sicuro
ja: 参照されているアセンブリには、厳密な名前がありません
ko: 참조된 어셈블리는 강력한 이름을 사용하지 않습니다.
pl: Przywoływany zestaw nie ma silnej nazwy
pt_br: Assembly referenciado sem um nome forte
ru: Сборка, на которую указывает ссылка, не имеет строгого имени
tr: Başvurulan derlemenin güçlü bir adı yok
zh_hans: 引用程序集没有强名称
zh_hant: 參考的組件沒有強式名稱

# ERR_InvalidSignaturePublicKey
source: Invalid signature public key specified in AssemblySignatureKeyAttribute.
cs: V atributu AssemblySignatureKeyAttribute je uvedený neplatný veřejný klíč podpisu.
de: Im AssemblySignatureKeyAttribute wurde ein öffentlicher Schlüssel mit ungültiger Signatur angegeben.
es: Se especificó una clave pública de firma no válida en AssemblySignatureKeyAttribute.
fr: Une clé publique de signature non valide a été spécifiée dans AssemblySignatureKeyAttribute.
it: La chiave pubblica di firma specificata in AssemblySignatureKeyAttribute non è valida.
ja: 無効な署名公開キーが AssemblySignatureKeyAttribute で指定されました。
ko: AssemblySignatureKeyAttribute에 잘못된 시그니처 공개 키가 지정되었습니다.
pl: W atrybucie AssemblySignatureKeyAttribute określono nieprawidłowy klucz publiczny sygnatury.
pt_br: Chave pública de assinatura inválida especificada em AssemblySignatureKeyAttribute.
ru: В AssemblySignatureKeyAttribute определен недопустимый открытый ключ подписи.
tr: AssemblySignatureKeyAttribute içinde geçersiz imza ortak anahtarı belirtildi.
zh_hans: 在 AssemblySignatureKeyAttribute 中指定的签名公钥无效。
zh_hant: AssemblySignatureKeyAttribute 中指定的簽章公開金鑰無效。

# ERR_CollisionWithPublicTypeInModule
source: Type '{0}' conflicts with public type defined in added module '{1}'.
cs: Typ {0} je v konfliktu s veřejným typem definovaným v přidaném modulu {1}.
de: Der Typ "{0}" steht in Konflikt mit dem im hinzugefügten Modul "{1}" definierten öffentlichen Typ.
es: El tipo '{0}' entra en conflicto con el tipo público definido en el módulo agregado '{1}'.
fr: Le type '{0}' est en conflit avec le type public défini dans le module '{1}' ajouté.
it: Il tipo '{0}' è in conflitto con il tipo pubblico definito nel modulo aggiunto '{1}'.
ja: 型 '{0}' は、追加されたモジュール '{1}' で定義されたパブリック型と競合します。
ko: '{0}' 형식이 추가된 모듈 '{1}'에 정의된 public 형식과 충돌합니다.
pl: Typ „{0}” jest w konflikcie z typem publicznym zdefiniowanym w dodanym module „{1}”.
pt_br: O tipo '{0}' está em conflito com um tipo público definido no módulo adicionado '{1}'.
ru: Тип "{0}" конфликтует с общим типом, определенным в добавленном модуле "{1}".
tr: '{0}' türü, eklenen '{1}' modülünde tanımlanan genel türle çakışıyor.
zh_hans: 类型“{0}”与添加的模块“{1}”中定义的公共类型冲突。
zh_hant: 類型 '{0}' 與加入的模組 '{1}' 中所定義的公用類型相衝突。

# ERR_ExportedTypeConflictsWithDeclaration
source: Type '{0}' exported from module '{1}' conflicts with type declared in primary module of this assembly.
cs: Typ {0} exportovaný z modulu {1} je v konfliktu s typem deklarovaným v primárním modulu tohoto sestavení.
de: Typ "{0}", der aus Modul "{1}" exportiert wurde, steht in Konflikt mit dem Typ, der im primären Modul dieser Assembly deklariert wurde.
es: El tipo '{0}' exportado del módulo '{1}' entra en conflicto con el tipo declarado en el módulo primario de este ensamblado.
fr: Le type '{0}' exporté à partir du module '{1}' est en conflit avec le type déclaré dans le module principal de cet assembly.
it: Il tipo '{0}' esportato dal modulo '{1}' è in conflitto con il tipo dichiarato nel modulo primario di questo assembly.
ja: モジュール '{1}' からエクスポートされた型 '{0}' は、このアセンブリのプライマリ モジュールで宣言した型と競合しています。
ko: '{1}' 모듈에서 내보낸 '{0}' 형식이 이 어셈블리의 주 모듈에서 선언된 형식과 충돌합니다.
pl: Typ „{0}” wyeksportowany z modułu „{1}” powoduje konflikt z typem zadeklarowanym w podstawowym module tego zestawu.
pt_br: Tipo "{0}" exportado do módulo "{1}" está em conflito com tipo declarado no módulo primário deste assembly.
ru: Тип "{0}", экспортированный из модуля "{1}", конфликтует с типом, объявленным в основном модуле этой сборки.
tr: '{1}' modülünden dışarı aktarılan '{0}' türü, bu derlemenin birinci modülünde ifade edilen tür ile çakışıyor.
zh_hans: 从模块“{1}”导出的类型“{0}”与此程序集主模块中声明的类型冲突。
zh_hant: 從模組 '{1}' 匯出的類型 '{0}' 與此組件的主要模組中所宣告之類型相衝突。

# ERR_ExportedTypesConflict
source: Type '{0}' exported from module '{1}' conflicts with type '{2}' exported from module '{3}'.
cs: Typ {0} exportovaný z modulu {1} je v konfliktu s typem {2} exportovaným z modulu {3}.
de: Typ "{0}", der aus Modul "{1}" exportiert wurden, steht in Konflikt mit Typ "{2}", der aus Modul "{3}" exportiert wurde.
es: El tipo '{0}' exportado del módulo '{1}' entra en conflicto con el tipo '{2}' exportado del módulo '{3}'.
fr: Le type '{0}' exporté à partir du module '{1}' est en conflit avec le type '{2}' exporté à partir du module '{3}'.
it: Il tipo '{0}' esportato dal modulo '{1}' è in conflitto con il tipo '{2}' esportato dal modulo '{3}'.
ja: モジュール '{1}' からエクスポートされた型 '{0}' は、モジュール '{3}' からエクスポートされた型 '{2}' と競合しています。
ko: '{1}' 모듈에서 내보낸 '{0}' 형식이 '{3}' 모델에서 내보낸 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” wyeksportowany z modułu „{1}” powoduje konflikt z typem „{2}” wyeksportowanym z modułu „{3}”.
pt_br: Tipo "{0}" exportado do módulo "{1}" está em conflito com tipo "{2}" exportado do módulo "{3}".
ru: Тип "{0}", экспортированный из модуля "{1}", конфликтует с типом "{2}", экспортированным из модуля "{3}".
tr: '{1}' modülünden dışarı aktarılan '{0}' türü, '{3}' modülünden dışarı aktarılan '{2}' türü ile çakışıyor.
zh_hans: 从模块“{1}”导出的类型“{0}”与从模块“{3}”导出的类型“{2}”冲突。
zh_hant: 從模組 '{1}' 匯出的類型 '{0}' 與從模組 '{3}' 匯出的類型 '{2}' 相衝突。

# WRN_RefCultureMismatch
source: Referenced assembly '{0}' has different culture setting of '{1}'.
cs: Odkazované sestavení {0} má jiné nastavení jazykové verze {1}.
de: Die referenzierte {0}-Assembly besitzt eine andere Kultureinstellung: "{1}".
es: El ensamblado '{0}' al que se hace referencia tiene una configuración de referencia cultural distinta de '{1}'.
fr: L'assembly référencé '{0}' a un paramètre de culture différent : '{1}'.
it: Le impostazioni cultura dell'assembly '{0}' al quale si fa riferimento sono diverse da '{1}'.
ja: 参照アセンブリ '{0}' には '{1}' の異なるカルチャ設定があります。
ko: 참조된 어셈블리 '{0}'에 다른 '{1}' 문화권 설정이 있습니다.
pl: Przywoływany zestaw „{0}” ma inne ustawienie kultury — „{1}”.
pt_br: Assembly referenciado "{0}" tem a configuração de cultura diferente de "{1}".
ru: Сборка "{0}", на которую дается ссылка, использует другой параметр языка и региональных параметров "{1}".
tr: '{0}' başvurulan derlemesinin '{1}' için farklı kültür ayarı var.
zh_hans: 引用程序集“{0}”具有不同区域性设置“{1}”。
zh_hant: 參考組件 '{0}' 有不同的文化特性設定 '{1}'。

# WRN_RefCultureMismatch_Title
source: Referenced assembly has different culture setting
cs: Odkazované sestavení má jiné nastavení jazykové verze.
de: Referenzierte Assembly hat andere Kultureinstellungen
es: El ensamblaje referenciado tiene una configuración de cultura diferente
fr: L'assembly référencé a un paramètre de culture différent
it: Le impostazioni cultura dell'assembly di riferimento sono diverse
ja: 参照されているアセンブリのカルチャ設定が異なります
ko: 참조된 어셈블리의 문화권 설정이 다릅니다.
pl: Przywoływany zestaw ma inne ustawienie kultury
pt_br: O assembly referenciado possui uma configuração de cultura diferente
ru: Сборка, на которую указывает ссылка, содержит другой параметр языка и региональных параметров
tr: Başvurulan derlemenin farklı bir kültür ayarı var
zh_hans: 引用程序集具有不同区域性设置
zh_hant: 參考的組件具有不同文化特性設定

# ERR_AgnosticToMachineModule
source: Agnostic assembly cannot have a processor specific module '{0}'.
cs: Agnostické sestavení nemůže mít modul {0} určený pro konkrétní procesor.
de: Die agnostische Assembly kann kein prozessorspezifisches Modul "{0}" aufweisen.
es: El ensamblado válido no puede tener un módulo específico de procesador '{0}'.
fr: Un assembly agnostique ne peut pas avoir un module '{0}' propre au processeur.
it: Un assembly agnostico non può avere un modulo '{0}' specifico del processore.
ja: 不明なアセンブリにプロセッサ固有モジュール '{0}' を指定することはできません。
ko: 알 수 없는 어셈블리는 프로세서의 특정 모듈('{0}')을 포함할 수 없습니다.
pl: Zestaw agnostyczny nie może mieć modułu specyficznego dla procesora „{0}”.
pt_br: Assembly desconhecido não pode ter um módulo específico de processador "{0}".
ru: Безразмерная сборка не может иметь модуль для конкретного процессора "{0}".
tr: Belirsiz derlemede '{0}' işlemciye özel modül olamaz.
zh_hans: 不可知的程序集不能具有特定于处理器的模块“{0}”。
zh_hant: 無從驗證的組件不可有處理器專屬的模組 '{0}'。

# ERR_ConflictingMachineModule
source: Assembly and module '{0}' cannot target different processors.
cs: Sestavení a modul {0} nemůžou mířit na různé procesory.
de: Die Assembly und das Modul "{0}" können nicht verschiedene Zielprozessoren haben.
es: El ensamblado y el módulo '{0}' no pueden tener como destino procesadores distintos.
fr: L'assembly et le module '{0}' ne peuvent pas cibler des processeurs différents.
it: L'assembly e il modulo '{0}' non possono essere destinati a processori diversi.
ja: アセンブリとモジュール '{0}' で異なるプロセッサを対象にすることはできません。
ko: 어셈블리 및 '{0}' 모듈은 다른 프로세서를 대상으로 할 수 없습니다.
pl: Zestaw i moduł „{0}” nie mogą wskazywać różnych procesorów.
pt_br: Assembly e módulo "{0}" não podem diferentes processadores como destino.
ru: Сборка и модуль "{0}" не могут предназначаться для разных процессоров.
tr: Derleme ve '{0}' modülü farklı işlemcileri hedefleyemez.
zh_hans: 程序集和模块“{0}”不能以不同处理器为目标。
zh_hant: 組件與模組 '{0}' 的目標處理器不可不同。

# WRN_ConflictingMachineAssembly
source: Referenced assembly '{0}' targets a different processor.
cs: Odkazované sestavení {0} míří na jiný procesor.
de: Die Assembly "{0}", auf die verwiesen wird, hat einen anderen Zielprozessor.
es: El ensamblado '{0}' al que se hace referencia está destinado a un procesador diferente.
fr: L'assembly référencé '{0}' cible un processeur différent.
it: L'assembly '{0}' a cui si fa riferimento ha come destinazione un processore diverso.
ja: 参照アセンブリ '{0}' は、異なるプロセッサをターゲットにしています。
ko: 참조된 어셈블리 '{0}'이(가) 다른 프로세서를 대상으로 합니다.
pl: Celem przywołanego zestawu „{0}” jest inny procesor.
pt_br: Assembly referenciado "{0}" destinado a um processador diferente.
ru: Сборка, на которую дана ссылка "{0}", направлена на другой процессор.
tr: '{0}' başvurulan derlemesi farklı bir işlemciyi hedef alır.
zh_hans: 引用程序集“{0}”面向的是另一个处理器。
zh_hant: 參考組件 '{0}' 以不同的處理器為目標。

# WRN_ConflictingMachineAssembly_Title
source: Referenced assembly targets a different processor
cs: Odkazované sestavení míří na jiný procesor.
de: Die Assembly, auf die verwiesen wird, hat einen anderen Zielprozessor.
es: El ensamblador al que se hace referencia tiene como objetivo a otro procesador
fr: L'assembly référencé cible un processeur différent
it: L'assembly di riferimento ha come destinazione un processore diverso
ja: 参照アセンブリが異なるプロセッサを対象にしています
ko: 참조된 어셈블리가 다른 프로세서를 대상으로 합니다.
pl: Celem przywołanego zestawu jest inny procesor
pt_br: O assembly referenciado está direcionado a um processador diferente
ru: Сборка, на которую указывает ссылка, предназначена для другого процессора
tr: Başvurulan derleme farklı bir işlemciyi hedefliyor
zh_hans: 引用程序集面向的是另一个处理器
zh_hant: 參考的組件以不同的處理器為目標

# ERR_CryptoHashFailed
source: Cryptographic failure while creating hashes.
cs: Při vytváření čísel hash došlo ke kryptografické chybě.
de: Kryptografischer Fehler bei der Hasherstellung.
es: Error criptográfico al crear hashes.
fr: Échec de chiffrement pendant la création de hachages.
it: Si è verificato un errore di crittografia durante la creazione di hash.
ja: ハッシュを生成中に暗号化に失敗しました。
ko: 해시를 만드는 동안 암호화 오류가 발생했습니다.
pl: Wystąpił błąd kryptograficzny w czasie tworzenia mieszań.
pt_br: Falha na criptografia ao criar valores hashes.
ru: Сбой шифрования при создании хэшей.
tr: Karmalar oluşturulurken şifreleme hatası.
zh_hans: 创建哈希时加密失败。
zh_hant: 建立雜湊時密碼編譯失敗。

# ERR_CantHaveWin32ResAndManifest
source: Conflicting options specified: Win32 resource file; Win32 manifest.
cs: Byly zadané konfliktní volby: soubor prostředků Win32; manifest Win32.
de: Die angegebenen Optionen führen zu einem Konflikt: Win32-Ressourcendatei; Win32-Manifest.
es: Se especificaron opciones conflictivas: archivo de recursos de Win32; manifiesto de Win32.
fr: Options spécifiées en conflit : fichier de ressources Win32 ; manifeste Win32.
it: Sono state specificate opzioni in conflitto: file di risorse Win32; manifesto Win32.
ja: 競合するオプションが指定されました: Win32 リソース ファイル、Win32 マニフェスト。
ko: Win32 리소스 파일과 Win32 매니페스트는 서로 충돌하므로 함께 지정할 수 없습니다.
pl: Określono opcje powodujące konflikt: plik zasobów Win32; manifest Win32.
pt_br: Opções conflitantes especificadas: arquivo de recursos Win32; manifesto Win32.
ru: Заданы несовместимые параметры: файл ресурсов Win32; манифест Win32.
tr: Çakışan seçenekler belirtildi: Win32 kaynak dosyası; Win32 bildirimi.
zh_hans: 指定的选项冲突: Win32 资源文件；Win32 清单。
zh_hant: 指定的選項相衝突: Win32 資源檔; Win32 資訊清單。

# ERR_ForwardedTypeConflictsWithDeclaration
source: Forwarded type '{0}' conflicts with type declared in primary module of this assembly.
cs: Předaný typ {0} je v konfliktu s typem deklarovaným v primárním modulu tohoto sestavení.
de: Der weitergeleitete Typ "{0}" steht in Konflikt mit dem Typ, der im primären Modul dieser Assembly deklariert wurde.
es: El tipo reenviado '{0}' entra en conflicto con el tipo declarado en el módulo primario de este ensamblado.
fr: Le type transmis '{0}' est en conflit avec le type déclaré dans le module principal de cet assembly.
it: Il tipo inoltrato '{0}' è in conflitto con il tipo dichiarato nel modulo primario di questo assembly.
ja: 転送された型 '{0}' は、このアセンブリのプライマリ モジュールで宣言した型と競合しています。
ko: 전달된 '{0}' 형식이 이 어셈블리의 주 모듈에서 선언된 형식과 충돌합니다.
pl: Typ przesłany „{0}” powoduje konflikt z typem zadeklarowanym w podstawowym module tego zestawu.
pt_br: Tipo encaminhado "{0}" está em conflito com o tipo declarado no módulo primário deste assembly.
ru: Отправленный тип "{0}" конфликтует с типом, объявленным в основном модуле этой сборки.
tr: '{0}' iletilen türü bu derlemenin birincil modülünde ifade edilen türle çakışıyor.
zh_hans: 转发的类型“{0}”与此程序集主模块中声明的类型冲突。
zh_hant: 轉送的類型 '{0}' 與此組件主要模組中所宣告的類型相衝突。

# ERR_ForwardedTypesConflict
source: Type '{0}' forwarded to assembly '{1}' conflicts with type '{2}' forwarded to assembly '{3}'.
cs: Typ {0} předaný do sestavení {1} je v konfliktu s typem {2} předaným do sestavení {3}.
de: Typ "{0}", der an Assembly "{1}" weitergeleitet wurde, steht in Konflikt mit Typ "{2}", der an Assembly "{3}" weitergeleitet wurde.
es: El tipo '{0}' reenviado al ensamblado '{1}' entra en conflicto con el tipo '{2}' reenviado al ensamblado '{3}'.
fr: Le type '{0}' transmis à l'assembly '{1}' est en conflit avec le type '{2}' transmis à l'assembly '{3}'.
it: Il tipo '{0}' inoltrato all'assembly '{1}' è in conflitto con il tipo '{2}' inoltrato all'assembly '{3}'.
ja: アセンブリ '{1}' に転送された型 '{0}' は、アセンブリ '{3}' に転送された型 '{2}' と競合しています。
ko: '{1}' 어셈블리로 전달된 '{0}' 형식이 '{3}' 어셈블리로 전달된 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” przesłany do zestawu „{1}” powoduje konflikt z typem „{2}” przesłanym do zestawu „{3}”.
pt_br: Tipo "{0}" encaminhado para o assembly "{1}" está em conflito com tipo "{2}" encaminhado para o módulo "{3}".
ru: Тип "{0}", отправленный в сборку "{1}", конфликтует с типом "{2}", отправленным в сборку "{3}".
tr: '{1}' derlemesine iletilen '{0}' türü, '{3}' derlemesine iletilen '{2}' türü ile çakışıyor.
zh_hans: 转发到程序集“{1}”的类型“{0}”与转发到程序集“{3}”的类型“{2}”冲突。
zh_hant: 轉送到組件 '{1}' 的類型 '{0}' 與轉送到組件 '{3}' 的類型 '{2}' 相衝突。

# ERR_TooLongMetadataName
source: Name '{0}' exceeds the maximum length allowed in metadata.
cs: Název {0} překračuje maximální délku povolenou v metadatech.
de: Der Name "{0}" überschreitet die maximal zulässige Länge in Metadaten.
es: El nombre '{0}' supera la longitud máxima permitida en los metadatos.
fr: Le nom '{0}' dépasse la longueur maximale autorisée dans les métadonnées.
it: Il nome '{0}' supera la lunghezza massima consentita nei metadati.
ja: 名前 '{0}' が、メタデータで許可されている最大文字数を超えています。
ko: '{0}' 이름이 메타데이터에 허용된 최대 길이를 초과했습니다.
pl: Długość nazwy „{0}” przekracza maksymalną długość dozwoloną w metadanych.
pt_br: Nome "{0}" excede o comprimento máximo permitido em metadados.
ru: Имя "{0}" превышает максимальную длину, допустимую в метаданных.
tr: '{0}' adı, meta verilerde izin verilen maksimum uzunluğu aşıyor.
zh_hans: 名称“{0}”超出元数据中允许的最大长度。
zh_hant: 名稱 '{0}' 超過中繼資料內所允許的長度上限。

# ERR_MissingNetModuleReference
source: Reference to '{0}' netmodule missing.
cs: Chybí odkaz na netmodule {0}.
de: Ein Verweis auf NETMODULE "{0}" fehlt.
es: Falta la referencia al netmodule '{0}'.
fr: Référence à netmodule '{0}' manquante.
it: Manca il riferimento al netmodule '{0}'.
ja: '{0}' netmodule への参照がありません。
ko: '{0}' netmodule에 대한 참조가 없습니다.
pl: Brak odwołania do modułu netmodule „{0}”.
pt_br: Referência a "{0}" netmodule ausente.
ru: Отсутствует ссылка на "{0}" netmodule.
tr: '{0}' netmodule başvurusu eksik.
zh_hans: 缺少对“{0}”netmodule 的引用。
zh_hant: 遺漏 '{0}' netmodule 的參考。

# ERR_NetModuleNameMustBeUnique
source: Module '{0}' is already defined in this assembly. Each module must have a unique filename.
cs: Modul {0} je už v tomto sestavení definovaný. Každý modul musí mít jedinečný název souboru.
de: Das Modul "{0}" wurde in dieser Assembly bereits definiert. Alle Module müssen einen eindeutigen Dateinamen haben.
es: El módulo '{0}' ya está definido en este ensamblado. Cada módulo debe tener un nombre de archivo único.
fr: Le module '{0}' est déjà défini dans cet assembly. Chaque module doit avoir un nom de fichier unique.
it: Il modulo '{0}' è già definito in questo assembly. Ogni modulo deve avere un nome di file univoco.
ja: モジュール '{0}' は既にこのアセンブリに定義されています。各モジュールには一意のファイル名がある必要があります。
ko: '{0}' 모듈이 이 어셈블리에 이미 정의되었습니다. 각 모듈에 고유한 파일 이름이 있어야 합니다.
pl: Moduł „{0}” jest już zdefiniowany w tym zestawie. Nazwa pliku każdego modułu musi być unikatowa.
pt_br: Módulo "{0}" já está definido neste assembly. Cada módulo deve ter um filename exclusivo.
ru: Модуль "{0}" уже определен в этой сборке. Каждый модуль должен иметь уникальное имя.
tr: '{0}' modülü bu derlemeden zaten tanımlanmış. Her modülün benzersiz bir dosya adı olmalıdır.
zh_hans: 模块“{0}”已在此程序集中定义。每个模块必须具有唯一的文件名。
zh_hant: 模組 '{0}' 已定義在此組件中。每個模組都必須要有不重複的檔案名稱。

# ERR_ForwardedTypeConflictsWithExportedType
source: Type '{0}' forwarded to assembly '{1}' conflicts with type '{2}' exported from module '{3}'.
cs: Typ {0} předaný do sestavení {1} je v konfliktu s typem {2} exportovaným z modulu {3}.
de: Typ "{0}", der an Assembly "{1}" weitergeleitet wurde, steht in Konflikt mit Typ "{2}", der aus Modul "{3}" exportiert wurde.
es: El tipo '{0}' reenviado al ensamblado '{1}' entra en conflicto con el tipo '{2}' exportado del módulo '{3}'.
fr: Le type '{0}' transmis à l'assembly '{1}' est en conflit avec le type '{2}' exporté à partir du module '{3}'.
it: Il tipo '{0}' inoltrato all'assembly '{1}' è in conflitto con il tipo '{2}' esportato dal modulo '{3}'.
ja: アセンブリ '{1}' に転送された型 '{0}' は、モジュール '{3}' からエクスポートされた型 '{2}' と競合しています。
ko: '{1}' 어셈블리로 전달된 '{0}' 형식이 '{3}'에서 내보낸 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” przesłany do zestawu „{1}” powoduje konflikt z typem „{2}” wyeksportowanym z modułu „{3}”.
pt_br: Tipo "{0}" encaminhado para o assembly "{1}" está em conflito com tipo "{2}" exportado do módulo "{3}".
ru: Тип "{0}", отправленный в сборку "{1}", конфликтует с типом "{2}", экспортированным из модуля "{3}".
tr: '{1}' derlemesine iletilen '{0}' türü '{3}' modülünden dışarı aktarılan '{2}' türü ile çakışıyor.
zh_hans: 转发到程序集“{1}”的类型“{0}”与从模块“{3}”导出的类型“{2}”冲突。
zh_hant: 轉送到組件 '{1}' 的類型 '{0}' 與從模組 '{3}' 匯出的類型 '{2}' 相衝突。

# IDS_MSG_ADDREFERENCE
source: Adding assembly reference '{0}'
cs: Přidává se odkaz na sestavení {0}.
de: Der Assemblyverweis "{0}" wird hinzugefügt.
es: Agregando referencia de ensamblado '{0}'
fr: Ajout de la référence d'assembly '{0}'
it: Aggiunta del riferimento all'assembly '{0}'
ja: アセンブリ参照 '{0}' を追加中
ko: '{0}' 어셈블리 참조 추가 중
pl: Dodawanie odwołania do zestawu „{0}”
pt_br: Adicionando referência de assembly "{0}"
ru: Добавление ссылки на сборку "{0}"
tr: '{0}' derleme başvurusu ekleniyor
zh_hans: 正在添加程序集引用“{0}”
zh_hant: 正在加入組件參考 '{0}'

# IDS_MSG_ADDLINKREFERENCE
source: Adding embedded assembly reference '{0}'
cs: Přidává se vložený odkaz na sestavení {0}.
de: Der eingebettete Assemblyverweis "{0}" wird hinzugefügt.
es: Agregando referencia de ensamblado incrustado '{0}'
fr: Ajout de la référence d'assembly incorporé '{0}'
it: Aggiunta del riferimento all'assembly '{0}' incorporato
ja: 埋め込みアセンブリ参照 '{0}' を追加しています
ko: 포함된 '{0}' 어셈블리 참조 추가 중
pl: Dodawanie osadzonego odwołania do zestawu „{0}”
pt_br: Adicionando referência de assembly inserida "{0}"
ru: Добавление ссылки на встроенную сборку "{0}"
tr: Gömülü '{0}' derleme başvurusu ekleniyor
zh_hans: 正在添加嵌入程序集引用“{0}”
zh_hant: 正在加入內嵌組件參考 '{0}'

# IDS_MSG_ADDMODULE
source: Adding module reference '{0}'
cs: Přidává se odkaz na modul {0}.
de: Der Modulverweis "{0}" wird hinzugefügt.
es: Agregando referencia de módulo '{0}'
fr: Ajout de la référence de module '{0}'
it: Aggiunta del riferimento al modulo '{0}'
ja: モジュール参照 '{0}' を追加中
ko: '{0}' 모듈 참조 추가 중
pl: Dodawanie odwołania do modułu „{0}”
pt_br: Adicionando referência de módulo "{0}"
ru: Добавление ссылки на модуль "{0}"
tr: '{0}' modül başvurusu ekleniyor
zh_hans: 正在添加模块引用“{0}”
zh_hant: 正在加入模組參考 '{0}'

# ERR_NestingViolatesCLS1
source: Type '{0}' does not inherit the generic type parameters of its container.
cs: Typ {0} nedědí parametry obecného typu svého kontejneru.
de: Der Typ "{0}" erbt keine generischen Typparameter vom dazugehörigen Container.
es: El tipo '{0}' no hereda los parámetros de tipo genérico de su contenedor.
fr: Le type '{0}' n'hérite pas des paramètres de type générique de son conteneur.
it: Il tipo '{0}' non eredita i parametri di tipo generici del relativo contenitore.
ja: 型 '{0}' は、そのコンテナーのジェネリック型パラメーターを継承しません。
ko: '{0}' 형식이 해당 컨테이너의 제네릭 형식 매개 변수를 상속하지 않습니다.
pl: Typ „{0}” nie dziedziczy parametrów typu ogólnego ze swojego kontenera.
pt_br: Tipo "{0}" não herda os parâmetros de tipo genéricos do seu contêiner.
ru: Тип "{0}" не наследует параметров универсального типа для контейнера.
tr: '{0}' türü kapsayıcısı olarak genel türdeki parametreleri devralmıyor.
zh_hans: 类型“{0}”不继承其容器的泛型类型参数。
zh_hant: 類型 '{0}' 沒有繼承其容器的泛型類型參數。

# ERR_PDBWritingFailed
source: Failure writing debug information: {0}
cs: Chyba při zápisu ladicích informací: {0}
de: Fehler beim Schreiben von Debuginformationen: {0}
es: Error al escribir información de depuración: {0}
fr: Échec de l'écriture des informations de débogage : {0}
it: Si è verificato un errore durante la scrittura delle informazioni di debug: {0}
ja: デバッグ情報の書き込みエラーです: {0}
ko: 디버그 정보를 쓰지 못했습니다({0}).
pl: Błąd podczas zapisu informacji o debugowaniu: {0}
pt_br: Falha ao gravar informações de depuração: {0}
ru: Сбой при записи информации отладки: {0}
tr: Hata ayıklama bilgileri yazılamadı: {0}
zh_hans: 写入调试信息失败: {0}
zh_hant: 寫入偵錯資訊時失敗: {0}

# ERR_ParamDefaultValueDiffersFromAttribute
source: The parameter has multiple distinct default values.
cs: Parametr má víc odlišných výchozích hodnot.
de: Der Parameter weist mehrere eindeutige Standardwerte auf.
es: El parámetro tiene varios valores predeterminados distintos.
fr: Le paramètre contient plusieurs valeurs par défaut distinctes.
it: Il parametro ha più valori predefiniti distinct.
ja: パラメーターに複数の異なる既定値があります。
ko: 매개 변수에 고유한 기본값이 여러 개 있습니다.
pl: Parametr ma wiele różnych domyślnych wartości.
pt_br: O parâmetro tem vários valores padrão diferentes.
ru: Параметр имеет несколько различных значений по умолчанию.
tr: Parametrenin birden çok farklı varsayılan değeri var.
zh_hans: 参数具有多个不同的默认值。
zh_hant: 此參數有多個相異的預設值。
