Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_TypeOrMemberNotGeneric2
source: Extension method '{0}' defined in '{1}' is not generic (or has no free type parameters) and so cannot have type arguments.
cs: Metoda rozšíření {0} definovaná v {1} není obecná (nebo nemá žádné volné parametry typu), a nemůže tedy mít argumenty typu.
de: Die in "{1}" definierte Erweiterungsmethode "{0}" ist nicht generisch (oder besitzt keine Parameter mit einem freien Typ) und darf daher nicht über Typargumente verfügen.
es: El método de extensión '{0}' definido en '{1}' no es genérico (o no tiene parámetros de tipo libre) y, por tanto, no puede tener argumentos de tipo.
fr: La méthode d'extension '{0}' définie dans '{1}' n'est pas générique (ou n'a pas de paramètre de type libre) et ne peut pas avoir d'arguments de type.
it: Il metodo di estensione '{0}' definito in '{1}' non è generico o non ha parametri di tipo disponibili e quindi non può avere argomenti di tipo.
ja: '{1}' で定義された拡張メソッド '{0}' はジェネリックではない (または自由型パラメーターがない) ため、型引数を指定できません。
ko: '{1}'에 정의된 확장 메서드 '{0}'은(는) 제네릭이 아니거나 형식이 자유로운 매개 변수를 포함하지 않으므로 형식 인수를 사용할 수 없습니다.
pl: Metoda rozszerzenia „{0}” zdefiniowana w elemencie „{1}” nie jest ogólna (lub nie ma parametrów typu dowolnego) i dlatego nie może mieć argumentów typu.
pt_br: Método de extensão "{0}" definido em "{1}" não é genérico (ou não tem parâmetros de tipo livre) e, portanto, não pode ter argumentos de tipo.
ru: Метод расширения "{0}", определенный в "{1}", не является универсальным (или не имеет параметров свободного типа) и поэтому не может иметь аргументов типа.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemi genel olmadığından (boş tür parametresi yok), tür bağımsız değişkenleri olamaz.
zh_hans: “{1}”中定义的扩展方法“{0}”不是泛型方法(或没有可用的类型形参)，因此无法拥有类型实参。
zh_hant: 在 '{1}' 中定義的擴充方法 '{0}' 不是泛型 (或沒有不受限的類型參數)，因此不可有類型引數。

# ERR_ExtensionMethodCannotBeLateBound
source: Late-bound extension methods are not supported.
cs: Metody rozšíření s pozdní vazbou nejsou podporované.
de: Spät gebundene Erweiterungsmethoden werden nicht unterstützt.
es: No se admiten métodos de extensión enlazados en tiempo de ejecución.
fr: Les méthodes d'extension à liaison tardive ne sont pas prises en charge.
it: I metodi di estensione ad associazione tardiva non sono supportati.
ja: 遅延バインディングされた拡張メソッドはサポートされていません。
ko: 런타임에 바인딩된 확장 메서드는 지원되지 않습니다.
pl: Metody rozszerzenia z późnym wiązaniem nie są obsługiwane.
pt_br: Não há suporte para métodos de extensão de associação tardia.
ru: Методы расширения с поздним связыванием не поддерживаются.
tr: Geç bağlanan genişletme yöntemleri desteklenmiyor.
zh_hans: 不支持后期绑定的扩展方法。
zh_hant: 不支援晚期繫結擴充方法。

# ERR_TypeInferenceArrayRankMismatch1
source: Cannot infer a data type for '{0}' because the array dimensions do not match.
cs: Nejde odvodit typ dat pro prvek {0}, protože si neodpovídají rozměry polí.
de: Es kann kein Datentyp für "{0}" abgeleitet werden, da die Arraydimensionen nicht übereinstimmen.
es: No se puede inferir un tipo de datos para '{0}' porque las dimensiones de la matriz no coinciden.
fr: Impossible de déduire un type de données pour '{0}', car les dimensions du tableau ne correspondent pas.
it: Non è possibile dedurre un tipo di dati per '{0}' perché le dimensioni di matrice non corrispondono.
ja: 配列の次元が一致しないため、'{0}' のデータ型は推論できません。
ko: 배열 차원이 일치하지 않으므로 '{0}'의 데이터 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu danych dla elementu „{0}”, ponieważ wymiary tablicy nie są zgodne.
pt_br: Não é possível inferir um tipo de dados "{0}" porque as dimensões de matriz não coincidem.
ru: Невозможно получить тип данных для "{0}", так как размеры массива не совпадают.
tr: Dizi boyutları eşleşmediğinden, '{0}' için veri türü çıkarsanamıyor.
zh_hans: 无法推断“{0}”的数据类型，因为数组维数不匹配。
zh_hant: 因為陣列維度不相符，所以無法推斷 '{0}' 的資料類型。

# ERR_QueryStrictDisallowImplicitObject
source: Type of the range variable cannot be inferred, and late binding is not allowed with Option Strict on. Use an 'As' clause to specify the type.
cs: Typ proměnné rozsahu se nedá odvodit a pozdní vazby nejsou povolené, když je zapnutá možnost Option Strict. Určete typ pomocí klauzule As.
de: Der Typ der Bereichsvariablen kann nicht abgeleitet werden, und spätes Binden ist in "Option Strict On" nicht zulässig. Verwenden Sie eine As-Klausel zur Angabe des Typs.
es: El tipo de la variable de rango no se puede inferir y el enlace en tiempo de ejecución no se permite con Option Strict activado. Use una cláusula 'As' para especificar el tipo.
fr: Le type de la variable de portée ne peut pas être déduit, et la liaison tardive n'est pas autorisée avec Option Strict on. Utilisez une clause 'As' pour indiquer le type.
it: Non è possibile dedurre il tipo della variabile di intervallo e l'associazione tardiva non è consentita con Option Strict On. Usare una clausola 'As' per specificare il tipo.
ja: 範囲変数の型を推論できません。Option Strict がオンの場合、遅延バインディングは使用できません。'As' 句を使用して型を指定してください。
ko: 범위 변수의 형태를 유추할 수 없고 Option Strict On에서는 런타임에 바인딩을 사용할 수 없습니다. 'As' 절을 사용하여 형식을 지정하세요.
pl: Nie można wywnioskować typu zmiennej zakresu, a późne wiązanie nie jest dozwolone z ustawieniem Option Strict on. Użyj klauzuli „As”, aby określić typ.
pt_br: Tipo da variável de intervalo não pode ser deduzido e associação tardia não é permitida com Opção Strict ativa. Use uma cláusula "As" para especificar o tipo.
ru: Тип переменной диапазона не может быть определен, и с Option Strict On поздняя привязка не допускается. Используйте предложение "As", чтобы указать тип.
tr: Aralık değişkeninin türü çıkarsanamıyor ve Option Strict on ile geç bağlamaya izin verilmiyor. Türü belirtmek için 'As' yan tümcesi kullanın.
zh_hans: 无法推断范围变量的类型，且 Option Strict on 不允许后期绑定。请使用“As”子句来指定类型。
zh_hant: 無法推斷範圍變數的類型，Option Strict 為 On 時不可使用晚期繫結。請使用 'As' 子句指定類型。

# ERR_CannotEmbedInterfaceWithGeneric
source: Type '{0}' cannot be embedded because it has generic argument. Consider disabling the embedding of interop types.
cs: Typ {0} nemůže být vložený, protože má obecný argument. Zvažte zákaz vkládání typů spolupráce.
de: Der {0}-Typ kann nicht eingebettet werden, da er ein generisches Argument besitzt. Deaktivieren Sie ggf. die Einbettung von Interoptypen.
es: El tipo '{0}' no se puede incrustar porque tiene un argumento genérico. Puede deshabilitar la incrustación de tipos de interoperabilidad.
fr: Le type '{0}' ne peut pas être incorporé, car il a un argument générique. Désactivez l'incorporation des types interop.
it: Non è possibile incorporare il tipo '{0}' perché contiene un argomento generico. Provare a disabilitare l'incorporamento dei tipi di interoperabilità.
ja: 型 '{0}' にはジェネリック引数があるため、この型を埋め込むことはできません。相互運用機能型の埋め込みの無効化を検討してください。
ko: '{0}' 형식에 제네릭 인수가 있기 때문에 이 형식을 포함할 수 없습니다. interop 형식을 포함하지 않도록 설정하세요.
pl: Typ „{0}” nie może zostać osadzony, ponieważ ma argument ogólny. Rozważ wyłączenie osadzania typów międzyoperacyjnych.
pt_br: Tipo "{0}" não pode ser inserido porque ele tem argumento genérico. Considere desabilitar a inserção de tipos de interoperabilidade.
ru: Тип "{0}" нельзя внедрить, поскольку он имеет универсальный аргумент. Попробуйте отключить внедрение типов взаимодействия.
tr: '{0}' türünün genel bağımsız değişkeni olduğundan, bu tür eklenemez. Birlikte çalışma türlerinde eklemeyi devre dışı bırakabilirsiniz.
zh_hans: 无法嵌入类型“{0}”，因为它有泛型参数。请考虑禁用互操作类型嵌入。
zh_hant: 無法內嵌類型 '{0}'，因為它有泛型引數。請考慮停用內嵌 Interop 類型。

# ERR_CannotUseGenericTypeAcrossAssemblyBoundaries
source: Type '{0}' cannot be used across assembly boundaries because it has a generic type argument that is an embedded interop type.
cs: Typ {0} se nedá použít přes hranice sestavení, protože má argument obecného typu, který je vloženým definičním typem.
de: Der Typ "{0}" kann nicht über Assemblygrenzen hinweg verwendet werden, da er ein generisches Typargument besitzt, bei dem es sich um einen eingebetteten Interoptyp handelt.
es: El tipo "{0}" no se puede usar en los distintos límites de ensamblado porque tiene un argumento de tipo genérico que es un tipo de interoperabilidad incrustado.
fr: Le type '{0}' ne peut pas être utilisé au-delà des limites de l'assembly, car il a un argument de type générique qui est un type interop incorporé.
it: Non è possibile usare il tipo '{0}' tra limiti di assembly perché contiene un argomento tipo generico che corrisponde a un tipo di interoperabilità incorporato.
ja: 型 '{0}' には埋め込まれた相互運用機能型であるジェネリック型引数があるため、アセンブリ境界を越えて使用できません。
ko: '{0}' 형식에 포함된 interop 형식인 제네릭 형식 인수가 있기 때문에 이 형식을 다른 어셈블리에서 사용할 수 없습니다.
pl: Typ „{0}” nie może być używany między granicami zestawu, ponieważ ma argument typu ogólnego, który jest osadzonym typem międzyoperacyjnym.
pt_br: O tipo "{0}" não pode ser usado em limites de assembly porque ele tem um argumento de tipo genérico que é um tipo de interoperabilidade inserido.
ru: Тип "{0}" нельзя использовать за границами сборки, так как он имеет аргумент универсального типа, являющийся внедренным типом взаимодействия.
tr: '{0}' türü, bir gömülü birlikte çalışma türü olan genel tür bağımsız değişkeni içerdiğinden bütünleştirilmiş kod sınırları arasında kullanılamaz.
zh_hans: 无法跨程序集边界使用类型“{0}”，因为它有身为嵌入的互操作类型的泛型类型参数。
zh_hant: 因為類型 '{0}' 有內嵌 Interop 類型的泛型類型引數，所以不可跨組件的界限使用。

# WRN_UseOfObsoleteSymbol2
source: '{0}' is obsolete: '{1}'.
cs: 'Prvek {0} je zastaralý: {1}.
de: '"{0}" ist veraltet: "{1}".
es: '{0}' está obsoleto: '{1}'.
fr: '{0}' est obsolète : '{1}'.
it: '{0}' è obsoleto: '{1}'.
ja: '{0}' は廃止されています: '{1}'。
ko: '{0}'은(는) 사용되지 않습니다('{1}').
pl: 'Element „{0}” jest przestarzały: „{1}”.
pt_br: "{0}" está obsoleto: "{1}".
ru: "{0}" является устаревшим: "{1}".
tr: '{0}' artık kullanılmıyor: '{1}'.
zh_hans: '“{0}”已过时:“{1}”。
zh_hant: '{0}' 已經過時: '{1}'。

# WRN_UseOfObsoleteSymbol2_Title
source: Type or member is obsolete
cs: Typ nebo člen je zastaralý.
de: Typ oder Element ist veraltet
es: El tipo o el miembro están obsoletos
fr: Le type ou le membre est obsolète
it: Il tipo o il membro è obsoleto
ja: 型またはメンバーが旧型式です
ko: 형식 또는 멤버는 사용되지 않습니다.
pl: Typ lub składowa jest przestarzała
pt_br: O tipo ou membro é obsoleto
ru: Тип или член устарел
tr: Tür veya üye artık kullanılmıyor
zh_hans: 类型或成员已过时
zh_hant: 類型或成員已經過時

# WRN_MustOverloadBase4
source: {0} '{1}' shadows an overloadable member declared in the base {2} '{3}'. If you want to overload the base method, this method must be declared 'Overloads'.
cs: {0} – {1} stíní přetížitelný člen deklarovaný v základní třídě {2} – {3}. Pokud chcete přetížit základní metodu, musí být deklarovaná jako Overloads.
de: {0} "{1}" führt Shadowing für einen überladbaren Member durch, der in Basis-{2} "{3}" deklariert ist. Wenn Sie die Basismethode überladen möchten, muss die Methode als "Overloads" deklariert werden.
es: {0} '{1}' prevalece sobre un miembro que se puede sobrecargar declarado en la base {2} '{3}'. Si quiere sobrecargar el método base, este método se debe declarar como 'Overloads'.
fr: {0} '{1}' cache un membre surchargeable dans le {2} '{3}' de base. Si vous voulez surcharger la méthode de base, cette méthode doit être déclarée 'Overloads'.
it: {0} '{1}' nasconde un membro che supporta l'overload dichiarato nel {2} di base '{3}'. Per eseguire l'overload del metodo di base, quest'ultimo deve essere dichiarato come 'Overloads'.
ja: {0} '{1}' は、ベース {2} '{3}' で宣言されたオーバーロード可能なメンバーをシャドウします。ベース メソッドをオーバーロードする場合、このメソッドは 'Overloads' に宣言されていなければなりません。
ko: {0} '{1}'은(는) 기본 {2} '{3}'에 선언된 오버로드 가능한 멤버를 숨깁니다. 기본 메서드를 오버로드하려면 이 메서드를 'Overloads'로 선언해야 합니다.
pl: Element {0} „{1}” zasłania składową, która może zostać przeciążona i jest zadeklarowana w bazowym elemencie {2} „{3}”. Aby można było przeciążyć metodę bazową, ta metoda musi być zadeklarowana jako „Overloads”.
pt_br: {0} "{1}" sombreia um membro que pode ser sobrecarregado declarado na base {2} "{3}". Se você desejar sobrecarregar o método base, este método deve ser declarado como "Overloads".
ru: {0} "{1}" затеняет переопределяемый член, объявленный в базе {2} "{3}". Если вы хотите перегрузить базовый метод, этот метод должен быть объявлен "Overloads".
tr: {0} '{1}', {2} '{3}' temelinde bildirilen aşırı yüklenebilir bir üyeyi gölgeliyor. Temel yöntemi aşırı yüklemek istiyorsanız, bu yöntem 'Overloads' olarak bildirilmelidir.
zh_hans: {0}“{1}”隐藏在基 {2}“{3}”中声明的可重载的成员。如果要重载基方法，则此方法必须声明为“Overloads”。
zh_hant: {0} '{1}' 會遮蔽基底 {2} '{3}' 中宣告的可多載成員。若要多載基底方法，必須將此方法宣告為 'Overloads'。

# WRN_MustOverloadBase4_Title
source: Member shadows an overloadable member declared in the base type
cs: Člen zastiňuje přetěžovatelný člen deklarovaný v základním typu.
de: Der Member überschattet einen überladbaren Member, der im Basistyp deklariert ist.
es: El miembro crea una instantánea de un miembro que se puede sobrecargar declarado en el tipo base
fr: Le membre masque un membre surchargeable déclaré dans le type de base
it: Il membro nasconde un membro che supporta l'overload dichiarato nel tipo di base
ja: 基本型で宣言されているオーバーロード可能なメンバーをシャドウしているメンバーが存在します
ko: 멤버가 기본 형식에 선언된 오버로드 가능 멤버를 섀도 처리함
pl: Składowa zasłania składową z możliwością przeciążenia zadeklarowaną w typie podstawowym
pt_br: O membro sombreia um membro que pode ser sobrecarregado declarado no tipo base
ru: Член затемняет перегружаемый член, объявленный в базовом типе
tr: Üye, temel türünde bildirilen aşırı yüklenebilir bir üyeyi gölgeliyor
zh_hans: 成员隐藏在基类型中声明的可重载的成员
zh_hant: 成員遮蔽了基底類型中所宣告的可多載成員

# WRN_OverrideType5
source: {0} '{1}' conflicts with {2} '{1}' in the base {3} '{4}' and should be declared 'Shadows'.
cs: {0} – {1} je v konfliktu s {2} – {1} v základní třídě {3} – {4} a měl by být deklarovaný jako Shadows.
de: {0} "{1}" verursacht einen Konflikt mit {2} "{1}" in Basis-{3} "{4}" und sollte als "Shadows" deklariert werden.
es: {0} '{1}' entra en conflicto con {2} '{1}' en la base {3} '{4}' y se debe declarar como 'Shadows'.
fr: {0} '{1}' est en conflit avec {2} '{1}' dans le {3} '{4}' de base et doit être déclaré 'Shadows'.
it: {0} '{1}' è in conflitto con {2} '{1}' nel {3} di base '{4}', quindi deve essere dichiarato come 'Shadows'.
ja: {0} '{1}' は、{2} '{1}' とベース {3} '{4}' で競合しています。'Shadows' として宣言されなければなりません。
ko: {0} '{1}'은(는) 기본 {3} '{4}'의 {2} '{1}'과(와) 충돌하므로 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” powoduje konflikt z elementem {2} „{1}” w podstawowym elemencie {3} „{4}” i powinien być zadeklarowany jako „Shadows”.
pt_br: {0} "{1}" está em conflito com {2} "{1}" na base {3} "{4}" e deve ser declarado como "Shadows".
ru: {0} "{1}" конфликтует с "{2}" в базе {1} "{3}" {4} и должен быть объявлен "Shadows".
tr: {0} '{1}', {3} '{4}' temelindeki {2} '{1}' ile çakışıyor ve 'Shadows' olarak bildirilmelidir.
zh_hans: {0}“{1}”与基 {3}“{4}”中的 {2}“{1}”冲突，应该声明为“Shadows”。
zh_hant: {0} '{1}' 與基底 {3} '{4}' 中的 {2} '{1}' 互相衝突，因此應宣告為 'Shadows'。

# WRN_OverrideType5_Title
source: Member conflicts with member in the base type and should be declared 'Shadows'
cs: Člen je v konfliktu se členem v základním typu a měl by se deklarovat jako Shadows.
de: Der Member steht mit einem Member im Basistyp in Konflikt und muss als "Shadows" deklariert werden.
es: El miembro está en conflicto con el miembro del tipo base y se debe declarar como 'Shadows'
fr: Le membre est en conflit avec le membre du type de base et devrait être déclaré comme 'Shadows'
it: Il membro è in conflitto con il membro nel tipo di base, quindi deve essere dichiarato come 'Shadows'
ja: メンバーが基本型のメンバーと競合しているため、'Shadows' として宣言されなければなりません
ko: 멤버가 기본 형식의 멤버와 충돌하며 'Shadows'로 선언되어야 함
pl: Wystąpił konflikt składowej ze składową w typie podstawowym — należy zadeklarować element „Shadows”
pt_br: O membro está em conflito com membros no tipo base e deve ser declarado como 'Shadows'
ru: Член конфликтует с членом в базовом типе и должен быть объявлен как Shadows
tr: Üye temel türündeki üyeyle çakışıyor ve 'Shadows' olarak bildirilmelidir
zh_hans: 成员与基类型中的成员发生冲突，因此应声明为 "Shadows"
zh_hant: 成員與基底類型中的成員互相衝突，因此應該宣告為 'Shadows'

# WRN_MustOverride2
source: {0} '{1}' shadows an overridable method in the base {2} '{3}'. To override the base method, this method must be declared 'Overrides'.
cs: {0} – {1} stíní přepisovatelnou metodu v základní třídě {2} – {3}. Pokud chcete přepsat základní metodu, musí být deklarovaná jako Overrides.
de: {0} "{1}" führt Shadowing für eine überschreibbare Methode in Basis-{2} "{3}" durch. Wenn Sie die Basismethode überschreiben möchten, muss die Methode als "Overrides" deklariert werden.
es: {0} '{1}' prevalece sobre un método que se puede invalidar en la base {2} '{3}'. Para invalidar el método base, este método se debe declarar como 'Overrides'.
fr: {0} '{1}' cache une méthode surchargeable dans le {2} '{3}' de base. Pour substituer la méthode de base, cette méthode doit être déclarée 'Overrides'.
it: {0} '{1}' nasconde un metodo sottoponibile a override nel {2} di base '{3}'. Per eseguire l'override del metodo di base, quest'ultimo deve essere dichiarato come 'Overrides'.
ja: {0} '{1}' は、ベース {2} '{3}' のオーバーライド可能なメソッドをシャドウします。ベース メソッドをオーバーライドするには、このメソッドは 'Overrides' に宣言されていなければなりません。
ko: {0} '{1}'은(는) 기본 {2} '{3}'의 재정의 가능한 메서드를 숨깁니다. 기본 메서드를 재정의하려면 이 메서드를 'Overrides'로 선언해야 합니다.
pl: Element {0} „{1}” zasłania w podstawowym elemencie {2} „{3}” metodę, którą można przesłonić. Aby można było przesłonić metodę podstawową, metoda ta musi być zadeklarowana jako „Overrides”.
pt_br: {0} "{1}" sombreia um método substituível na base {2} "{3}". Para substituir o método base, este método deve ser declarado "Overrides".
ru: {0} "{1}" затеняет переопределяемый метод в базе {2} "{3}". Для переопределения базового метода, этот метод должен быть объявлен "Overrides".
tr: {0} '{1}', {2} '{3}' temelinde geçersiz kılınabilir bir yöntemi gölgeliyor. Temel yöntemi geçersiz kılmak için, bu yöntem 'Overrides' olarak bildirilmelidir.
zh_hans: {0}“{1}”隐藏基 {2}“{3}”中的可重写方法。若要重写基方法，必须将此方法声明为“Overrides”。
zh_hant: {0} '{1}' 會遮蔽基底 {2} '{3}' 中可覆寫的方法。若要覆寫基底方法，必須將此方法宣告為 'Overrides'。

# WRN_MustOverride2_Title
source: Member shadows an overridable method in the base type
cs: Člen zastiňuje přepisovatelnou metodu v základním typu.
de: Der Member überschattet eine überschreibbare Methode im Basistyp.
es: El miembro crea una instantánea de un método que se puede sobrecargar en el tipo base
fr: Le membre masque une méthode substituable dans le type de base
it: Il membro nasconde un metodo di cui è possibile eseguire l'override nel tipo di base
ja: メンバーと同じ、基本型のオーバーロード可能なメソッドが存在します
ko: 멤버가 기본 형식의 오버로드 가능 메서드를 섀도 처리함
pl: Składowa zasłania metodę z możliwością przeciążenia zadeklarowaną w typie podstawowym
pt_br: O membro sombreia um método substituível no tipo base
ru: Член затемняет переопределяемый метод в базовом типе
tr: Üye, temel türündeki geçersiz kılınabilir bir metodu gölgeliyor
zh_hans: 成员隐藏基类型中的可重写的方法
zh_hant: 成員遮蔽了基底類型中可覆寫的方法

# WRN_DefaultnessShadowed4
source: Default property '{0}' conflicts with the default property '{1}' in the base {2} '{3}'. '{0}' will be the default property. '{0}' should be declared 'Shadows'.
cs: Výchozí vlastnost {0} je v konfliktu s výchozí vlastností {1} v základní třídě {2} - {3}. Výchozí vlastností bude {0}. {0} by se měl deklarovat jako Shadows.
de: Die {0}-Standardeigenschaft verursacht einen Konflikt mit der {1}-Standardeigenschaft in Basis-{2} "{3}". "{0}" wird zur Standardeigenschaft. "{0}" muss als "Shadows" deklariert werden.
es: La propiedad predeterminada '{0}' entra en conflicto con la propiedad predeterminada '{1}' en la base {2} '{3}'. '{0}' será la propiedad predeterminada. '{0}' se debe declarar como 'Shadows'.
fr: La propriété par défaut '{0}' est en conflit avec la propriété par défaut '{1}' dans le {2} '{3}' de base. '{0}' sera la propriété par défaut. '{0}' doit être déclaré 'Shadows'.
it: La proprietà predefinita '{0}' è in conflitto con la proprietà predefinita '{1}' in {2} base '{3}'. La proprietà predefinita sarà '{0}'. '{0}' deve essere dichiarata come 'Shadows'.
ja: 既定のプロパティ '{0}' は、ベース {2} '{3}' の既定のプロパティ '{1}' と競合します。'{0}' が既定のプロパティになります。'{0}' は 'Shadows' と宣言しなければなりません。
ko: 기본 {2} '{3}'에서 '{0}' 기본 속성이 '{1}' 기본 속성과 충돌합니다. '{0}'이(가) 기본 속성이 됩니다. '{0}'은(는) 'Shadows'로 선언해야 합니다.
pl: Właściwość domyślna „{0}” powoduje konflikt z właściwością domyślną „{1}” w podstawowym elemencie {2} „{3}”. Właściwość „{0}” będzie domyślna. Właściwość „{0}” powinna zostać zadeklarowana jako „Shadows”.
pt_br: Propriedade padrão "{0}" está em conflito com a propriedade padrão "{1}" na base {2} "{3}". "{0}" será a propriedade padrão. "{0}" deve ser declarado como "Shadows".
ru: Свойство по умолчанию "{0}" противоречит свойству по умолчанию "{1}" в базе {2} "{3}". "{0}" будет свойством по умолчанию. "{0}" следует объявить "Shadows".
tr: '{0}' varsayılan özelliği {2} '{3}' temelinde '{1}' varsayılan özelliğiyle çakışıyor. Varsayılan özellik '{0}' olacak. '{0}' 'Shadows' olarak bildirilmelidir.
zh_hans: 默认属性“{0}”与基 {2}“{3}”中的默认属性“{1}”冲突。“{0}”将成为默认属性。“{0}”应声明为“Shadows”。
zh_hant: 預設屬性 '{0}' 與基底 {2} '{3}' 中的預設屬性 '{1}' 相互衝突。'{0}' 將成為預設屬性。'{0}' 應該宣告為 'Shadows'。

# WRN_DefaultnessShadowed4_Title
source: Default property conflicts with the default property in the base type
cs: Výchozí vlastnost je v konfliktu s výchozí vlastností v základním typu.
de: Die Standardeigenschaft steht mit der Standardeigenschaft im Basistyp in Konflikt.
es: La propiedad predeterminada está en conflicto con la propiedad predeterminada del tipo base
fr: La propriété par défaut est en conflit avec la propriété par défaut du type de base
it: La proprietà predefinita è in conflitto con la proprietà predefinita nel tipo di base
ja: 既定のプロパティが、基本型の既定のプロパティと競合します
ko: 기본 속성이 기본 형식의 기본 속성과 충돌함
pl: Wystąpił konflikt właściwości domyślnej z właściwością domyślną w typie podstawowym
pt_br: Conflitos de propriedade padrão com a propriedade padrão no tipo base
ru: Свойство по умолчанию конфликтует со свойством по умолчанию в базовом типе
tr: Varsayılan özellik, temel türündeki varsayılan özellikle çakışıyor
zh_hans: 默认属性与基类型中的默认属性发生冲突
zh_hant: 預設屬性與基底類型中的預設屬性互相衝突

# WRN_UseOfObsoleteSymbolNoMessage1
source: '{0}' is obsolete.
cs: 'Prvek {0} je zastaralý.
de: '"{0}" ist veraltet.
es: '{0}' está obsoleto.
fr: '{0}' est obsolète.
it: '{0}' è obsoleto.
ja: '{0}' は廃止されています。
ko: '{0}'은(는) 사용되지 않습니다.
pl: 'Element „{0}” jest przestarzały.
pt_br: "{0}" está obsoleto.
ru: "{0}" является устаревшим.
tr: '{0}' artık kullanılmıyor.
zh_hans: '“{0}”已过时。
zh_hant: '{0}' 已經過時。

# WRN_UseOfObsoleteSymbolNoMessage1_Title
source: Type or member is obsolete
cs: Typ nebo člen je zastaralý.
de: Typ oder Element ist veraltet
es: El tipo o el miembro están obsoletos
fr: Le type ou le membre est obsolète
it: Il tipo o il membro è obsoleto
ja: 型またはメンバーが旧型式です
ko: 형식 또는 멤버는 사용되지 않습니다.
pl: Typ lub składowa jest przestarzała
pt_br: O tipo ou membro é obsoleto
ru: Тип или член устарел
tr: Tür veya üye artık kullanılmıyor
zh_hans: 类型或成员已过时
zh_hant: 類型或成員已經過時

# WRN_AssemblyGeneration0
source: Possible problem detected while building assembly: {0}
cs: Při sestavování sestavení se zjistily možné potíže: {0}.
de: Beim Erstellen der Assembly wurde möglicherweise ein Problem entdeckt: {0}
es: Posible problema detectado al compilar el ensamblado: {0}
fr: Problème possible détecté pendant la génération de l'assembly : {0}
it: È stato rilevato un possibile problema durante la compilazione dell'assembly: {0}
ja: アセンブリをビルド中に問題が発生した可能性があります: {0}
ko: 어셈블리를 빌드하는 동안 발생 가능한 문제가 발견되었습니다({0}).
pl: Wykryto potencjalny problem podczas kompilowania zestawu: {0}.
pt_br: Possível problema detectado ao compilar o assembly: {0}
ru: При создании сборки обнаружена потенциальная проблема: {0}
tr: Derleme oluşturulurken olası bir sorun algılandı: {0}
zh_hans: 生成程序集时检测到可能存在的问题: {0}
zh_hant: 建置組件時偵測到的可能問題: {0}
