Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FEATURE_RegionsEverywhere
source: region directives within method bodies or regions crossing boundaries of declaration blocks
cs: direktivy oblastí v tělech metody nebo oblasti přesahující hranice bloků s deklaracemi
de: Bereichsdirektiven in Methodentext oder Bereiche, die Begrenzungen von Deklarationsblöcken überschreiten
es: directivas de región dentro de cuerpos de métodos o regiones que cruzan los límites de los bloques de declaración
fr: directives region dans des corps de méthodes ou régions traversant les limites de blocs de déclaration
it: direttive region in corpi di metodo o aree che attraversano i limiti dei blocchi di dichiarazione
ja: メソッド本体内の領域ディレクティブ、または宣言ブロックの境界線を越える領域
ko: 선언 블록의 경계에 걸쳐 있는 영역 또는 메서드 본문 내의 region 지시문
pl: dyrektywy regionu w treści metod lub regiony przekraczające granice bloków deklaracji
pt_br: diretivas de região em corpos de método ou regiões que cruzam limites de blocos de declaração
ru: директивы region в телах методов или регионах, пересекающих границы блоков объявлений
tr: bildirim bloklarının sınırlarını aşan metot gövdeleri veya bölgeleri içindeki bölge yönergeleri
zh_hans: 方法主体内的 region 指令或跨声明块边界的 region
zh_hant: 方法主體內的區域指示詞，或跨宣告區塊界限的區域

# FEATURE_MultilineStringLiterals
source: multiline string literals
cs: literály víceřádkových řetězců
de: Mehrzeilige Zeichenfolgenliterale
es: literales de cadena de varias líneas
fr: littéraux de chaîne multiligne
it: valori letterali stringa con più righe
ja: 複数行文字列リテラル
ko: 여러 줄 문자열 리터럴
pl: literały ciągów wielowierszowych
pt_br: literais de cadeia de caracteres de várias linhas
ru: строковые литералы из нескольких строк
tr: çok satırlı dize sabit değerleri
zh_hans: 多行字符串文本
zh_hant: 多行字串常值

# FEATURE_CObjInAttributeArguments
source: CObj in attribute arguments
cs: CObj v argumentech atributu
de: "CObj" in Attributargumenten
es: CObj en argumentos de atributo
fr: CObj dans les arguments d'attribut
it: CObj negli argomenti dell'attributo
ja: 属性引数の CObj
ko: 특성 인수의 CObj
pl: CObj w argumentach atrybutów
pt_br: CObj nos argumentos do atributo
ru: CObj в аргументах атрибута
tr: Öznitelik bağımsız değişkenlerinde CObj
zh_hans: 属性参数中的 CObj
zh_hant: 屬性引數中的 CObj

# FEATURE_LineContinuationComments
source: line continuation comments
cs: komentáře pokračování řádku
de: Zeilenfortsetzungskommentare
es: comentarios de continuación de línea
fr: commentaires de continuation de ligne
it: commenti di continuazione riga
ja: 行継続コメント
ko: 줄 연속 설명
pl: komentarze dotyczące kontynuacji wiersza
pt_br: comentários da continuação de linha
ru: комментарии продолжения строки
tr: satır devamı açıklamaları
zh_hans: 行延续注释
zh_hant: 行接續符號註解

# FEATURE_TypeOfIsNot
source: TypeOf IsNot expression
cs: Výraz TypeOf IsNot
de: TypeOf IsNot-Ausdruck
es: Expresión TypeOf IsNot
fr: Expression TypeOf IsNot
it: espressione IsNot di TypeOf
ja: TypeOf IsNot 式
ko: TypeOf IsNot 식
pl: Wyrażenie TypeOf IsNot
pt_br: Expressão TypeOf IsNot
ru: Выражение IsNot TypeOf
tr: TypeOf IsNot ifadesi
zh_hans: TypeOf IsNot 表达式
zh_hant: TypeOf IsNot 運算式

# FEATURE_YearFirstDateLiterals
source: year-first date literals
cs: literály data začínající rokem
de: year-first-Datumsliterale
es: literales de primera fecha del año
fr: littéraux de date avec année en premier
it: valori letterali data con anno come primo elemento
ja: 年優先の日付リテラル
ko: 연도 우선 날짜 리터럴
pl: literały daty z numerem roku na początku
pt_br: literais de data do primeiro ano
ru: литералы даты с годом на первом месте
tr: başta yıl yazılan tarih sabit değerleri
zh_hans: 年份在最前面的日期文本
zh_hant: 以年起始的日期常值

# FEATURE_WarningDirectives
source: warning directives
cs: direktivy upozornění
de: Warnungsdirektiven
es: directivas de advertencia
fr: directives warning
it: direttive warning
ja: 警告ディレクティブ
ko: warning 지시문
pl: dyrektywy ostrzeżenia
pt_br: diretivas de aviso
ru: директивы warning
tr: uyarı yönergeleri
zh_hans: warning 指令
zh_hant: 警告指示詞

# FEATURE_PartialModules
source: partial modules
cs: dílčí moduly
de: Teilmodule
es: módulos parciales
fr: modules partiels
it: moduli parziali
ja: 部分モジュール
ko: 부분 모듈
pl: moduły częściowe
pt_br: módulos parciais
ru: частичные модули
tr: kısmi modüller
zh_hans: 部分模块
zh_hant: 部分模組

# FEATURE_PartialInterfaces
source: partial interfaces
cs: dílčí rozhraní
de: Teilschnittstellen
es: interfaces parciales
fr: interfaces partielles
it: interfacce parziali
ja: 部分インターフェイス
ko: 부분 인터페이스
pl: interfejsy częściowe
pt_br: interfaces parciais
ru: частичные интерфейсы
tr: kısmi arabirimler
zh_hans: 部分接口
zh_hant: 部分介面

# FEATURE_ImplementingReadonlyOrWriteonlyPropertyWithReadwrite
source: implementing read-only or write-only property with read-write property
cs: implementace vlastnosti jenom pro čtení nebo jenom pro zápis s vlastností jenom pro čtení
de: Implementieren einer schreibgeschützten oder lesegeschützten Eigenschaft mit Lese-/Schreibeigenschaft
es: implementación de la propiedad de solo lectura o solo escritura con la propiedad de solo lectura
fr: implémentation d'une propriété en lecture seule ou en écriture seule avec une propriété en lecture/écriture
it: implementazione della proprietà di sola lettura o di sola scrittura con la proprietà di lettura/scrittura
ja: 読み取り専用または書き込み専用プロパティを読み取り/書き込みプロパティで実装する
ko: 읽기/쓰기 속성을 사용하여 읽기 전용 또는 쓰기 전용 속성을 구현합니다.
pl: implementowanie właściwości read-only lub write-only z właściwością read-write
pt_br: implementação da propriedade somente leitura ou somente gravação com a propriedade de leitura e gravação
ru: реализация свойства только для чтения или только для записи с помощью свойства для чтения и записи
tr: okuma-yazma özelliği olan salt okunur veya salt yazılır özelliğini uygulama
zh_hans: 使用读写属性实现只读或只写属性
zh_hant: 實作唯讀或唯寫屬性以及讀寫屬性

# FEATURE_DigitSeparators
source: digit separators
cs: oddělovače číslic
de: Zifferntrennzeichen
es: separadores de dígitos
fr: séparateurs numériques
it: separatori di cifra
ja: 桁区切り記号
ko: 숫자 구분 기호
pl: separatory cyfr
pt_br: separadores de dígito
ru: цифровые разделители
tr: basamak ayırıcılar
zh_hans: 数字分隔符
zh_hant: 數字分隔符號

# FEATURE_BinaryLiterals
source: binary literals
cs: binární literály
de: binäre Literale
es: literales binarios
fr: littéraux binaires
it: valori letterali binari
ja: バイナリ リテラル
ko: 이진 리터럴
pl: literały binarne
pt_br: literais binários
ru: двоичные литералы
tr: ikili sabit değerler
zh_hans: 二进制文字
zh_hant: 二進位常值

# FEATURE_Tuples
source: tuples
cs: řazené kolekce členů
de: Tupel
es: tuplas
it: tuple
ja: タプル
ko: 튜플
pl: krotki
pt_br: tuplas
ru: кортежи
tr: demetler
zh_hans: 元组
zh_hant: 元組

# ERR_DebugEntryPointNotSourceMethodDefinition
source: Debug entry point must be a definition of a method declared in the current compilation.
cs: Vstupní bod ladění musí být definicí metody deklarované v aktuální kompilaci.
de: Der Debugeinstiegspunkt muss eine Definition einer Methode sein, die in der aktuellen Kompilierung deklariert ist.
es: El punto de entrada de depuración debe ser una definición de un método declarado en la compilación actual.
fr: Le point d'entrée de débogage doit être une définition d'une méthode déclarée dans la compilation actuelle.
it: Il punto di ingresso del debug deve essere una definizione di un metodo nella compilazione corrente.
ja: デバッグ エントリ ポイントは、現在のコンパイルで宣言されたメソッドの定義でなければなりません。
ko: 디버그 진입점은 현재 컴파일에서 선언된 메서드의 정의여야 합니다.
pl: Punkt wejściowy debugowania musi być definicją metody zadeklarowanej w bieżącej kompilacji.
pt_br: O ponto de entrada da depuração deve ser uma definição de um método declarado na compilação atual.
ru: Точкой входа отладки должно быть определение метода, объявленное в текущей компиляции.
tr: Hata ayıklama giriş noktası, geçerli derlemede bildirilmiş bir metodun tanımı olmalıdır.
zh_hans: 调试入口点必须是当前编译中声明的方法的定义。
zh_hant: 偵錯進入點必須是目前編譯中所宣告方法的定義。

# ERR_InvalidPathMap
source: The pathmap option was incorrectly formatted.
cs: Možnost pathmap nebyla správně naformátovaná.
de: Die pathmap-Option war falsch formatiert.
es: La opción pathmap no tenía el formato correcto.
fr: Le format de l'option pathmap est incorrect.
it: Il formato dell'opzione pathmap non è corretto.
ja: pathmap オプションが正しく書式設定されていませんでした。
ko: pathmap 옵션의 형식이 잘못되었습니다.
pl: Opcja pathmap jest nieprawidłowo sformatowana.
pt_br: A opção pathmap foi formatada incorretamente.
ru: Неправильный формат параметра pathmap.
tr: Pathmap seçeneği doğru şekilde biçimlendirilmedi.
zh_hans: 路径映射选项的格式不正确。
zh_hant: pathmap 選項格式不正確。

# SyntaxTreeIsNotASubmission
source: Syntax tree should be created from a submission.
cs: Strom syntaxe by se měl vytvořit z odeslání.
de: Der Syntaxbaum sollte aus einer Übermittlung erstellt werden.
es: El árbol de sintaxis debe crearse desde un envío.
fr: L'arborescence de syntaxe doit être créée à partir d'une soumission.
it: L'albero della sintassi deve essere creato da un invio.
ja: 構文ツリーは、送信から作成する必要があります。
ko: 구문 트리가 전송에서 만들어져야 합니다.
pl: Drzewo składni powinno zostać utworzone na podstawie przesłanych danych.
pt_br: A árvore de sintaxe deve ser criada de uma submissão.
ru: Дерево синтаксиса должно быть создано из отправки.
tr: Söz dizimi ağacı bir göndermeden oluşturulmalıdır.
zh_hans: 应从提交创建语法树。
zh_hant: 提交時就應該建立語法樹狀結構。

# ERR_TooManyUserStrings
source: Combined length of user strings used by the program exceeds allowed limit. Try to decrease use of string or XML literals.
cs: Kombinovaná délka uživatelských řetězců, které používá tento program, překročila povolený limit. Zkuste omezit použití literálů XML.
de: Die kombinierte Länge der vom Programm verwendeten Benutzerzeichenfolgen überschreitet den zulässigen Grenzwert. Versuchen Sie, die Verwendung von Zeichenfolgen- oder XML-Literalen zu verringern.
es: La longitud combinada de las cadenas de usuario que el programa utiliza supera el límite permitido. Intente disminuir el uso de literales de cadena o XML.
fr: La longueur combinée des chaînes utilisateur que le programme utilise dépasse la limite autorisée. Essayez de réduire le nombre de littéraux de chaîne ou XML.
it: La lunghezza combinata delle stringhe utente usate dal programma supera il limite consentito. Provare a ridurre l'uso di valori letterali XML o stringa.
ja: プログラムで使うユーザー文字列の長さの合計が許可されている制限を超えています。文字列リテラルまたは XML リテラルの使用を減らしてください。
ko: 프로그램에서 사용하는 사용자 문자열의 결합된 길이가 허용 한도를 초과합니다. 문자열이나 XML 리터럴의 사용을 줄여 보세요.
pl: Całkowita długość ciągów użytkownika używanych przez program przekracza dozwolony limit. Spróbuj ograniczyć użycie literałów ciągów lub XML.
pt_br: O comprimento combinado de cadeias de caracteres de usuário usado pelo programa excede o limite permitido. Tente diminuir o uso da cadeia ou dos literais de XML.
ru: Объединенная длина пользовательских строк, используемых программой, превышает допустимый предел. Попробуйте сократить использование строковых литералов или XML-литералов.
tr: Program tarafından kullanılan kullanıcı dizelerinin toplam uzunluğu, izin verilen sınırı aşıyor. Dize veya XML sabit değerlerinin kullanımını azaltmayı deneyin.
zh_hans: 该程序所使用的用户字符串的合并后长度超出所允许的限制。请尝试减少字符串文本或 XML 文本的使用。
zh_hant: 程式所使用的使用者字串加起來長度超過允許限制。請嘗試減少使用字串或 XML 常值。

# ERR_PeWritingFailure
source: An error occurred while writing the output file: {0}
cs: Při zápisu výstupního souboru došlo k chybě: {0}
de: Fehler beim Schreiben der Ausgabedatei: {0}
es: Error al escribir en el archivo de salida: {0}.
fr: Une erreur s'est produite durant l'écriture du fichier de sortie : {0}
it: Si è verificato un errore durante la scrittura del file di output: {0}
ja: 出力ファイルの書き込み中にエラーが発生しました: {0}
ko: 출력 파일을 쓰는 동안 오류가 발생함: {0}
pl: Wystąpił błąd podczas zapisywania pliku wyjściowego: {0}
pt_br: Ocorreu um erro ao gravar o arquivo de saída: {0}
ru: Произошла ошибка при записи выходного файла: {0}
tr: Çıkış dosyası yazılırken hata oluştu: {0}
zh_hans: 写入输出文件时出错: {0}
zh_hant: 寫入輸出檔案時發生錯誤: {0}

# ERR_OptionMustBeAbsolutePath
source: Option '{0}' must be an absolute path.
cs: Možnost {0} musí být absolutní cesta.
de: Die Option "{0}" muss ein absoluter Pfad sein.
es: La opción '{0}' debe ser una ruta de acceso absoluta.
fr: L'option '{0}' doit être un chemin absolu.
it: L'opzione '{0}' deve essere un percorso assoluto.
ja: オプション '{0}' は絶対パスにする必要があります。
ko: 옵션 '{0}'은(는) 절대 경로여야 합니다.
pl: Opcja „{0}” musi być ścieżką bezwzględną.
pt_br: A opção '{0}' deve ser um caminho absoluto.
ru: Параметр "{0}" должен быть абсолютным путем.
tr: '{0}' seçeneği mutlak yol olmalıdır.
zh_hans: 选项“{0}”必须是绝对路径。
zh_hant: 選項 '{0}' 必須是絕對路徑。

# ERR_SourceLinkRequiresPdb
source: /sourcelink switch is only supported when emitting PDB.
cs: Přepínač /sourcelink je podporovaný jen při vydávání PDB.
de: Der Schalter "/sourcelink" wird nur beim Ausgeben von PDB unterstützt.
es: El modificador /sourcelink solo se admite al emitir PDB.
fr: Le commutateur /sourcelink est uniquement pris en charge durant l'émission d'un fichier PDB.
it: L'opzione /sourcelink è supportata solo quando si crea il file PDB.
ja: /sourcelink スイッチは、PDB を生成する場合にのみサポートされます。
ko: /sourcelink 스위치는 PDB를 내보낼 때만 지원됩니다.
pl: Przełącznik /sourcelink jest obsługiwany tylko w przypadku emitowania pliku PDB.
pt_br: A opção /sourcelink tem suporte apenas ao emitir o PDB.
ru: Параметр /sourcelink поддерживается только при создании данных формата PDB.
tr: /sourcelink anahtarı yalnızca PDB gösterilirken desteklenir.
zh_hans: 只在发出 PDB 时才支持 /sourcelink 开关。
zh_hant: 只有在發出 PDB 時才支援 /sourcelink 參數。

# ERR_TupleDuplicateElementName
source: Tuple element names must be unique.
cs: Názvy elementů řazené kolekce členů musí být jedinečné.
de: Tupelelementnamen müssen eindeutig sein.
es: Los nombres de elemento de tupla deben ser únicos.
fr: Les noms d'éléments d'un tuple doivent être uniques.
it: I nomi di elementi di tupla devono essere univoci.
ja: タプル要素名は一意である必要があります。
ko: 튜플 요소 이름은 고유해야 합니다.
pl: Nazwy elementów krotek muszą być unikatowe.
pt_br: Os nomes de elemento de tupla devem ser exclusivos.
ru: Имена элементов кортежа должны быть уникальными.
tr: Demet öğesi adları benzersiz olmalıdır.
zh_hans: 元组元素名称必须是唯一的。
zh_hant: 元組元素名稱不得重複。

# WRN_TupleLiteralNameMismatch
source: The tuple element name '{0}' is ignored because a different name or no name is specified by the target type '{1}'.
cs: Název elementu řazené kolekce členů {0} se ignoruje, protože cílovým typem {1} je určený jiný nebo žádný název.
de: Der Tupelelementname "{0}" wird ignoriert, da vom Zieltyp "{1}" ein anderer oder kein Name angegeben ist.
es: No se tiene en cuenta el nombre de elemento de tupla "{0}" porque el tipo de destino "{1}" ha especificado otro nombre o no ha especificado ninguno.
fr: Le nom d'élément tuple '{0}' est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié par le type cible '{1}'.
it: Il nome dell'elemento di tupla '{0}' viene ignorato perché nel tipo di destinazione '{1}' è specificato un nome diverso o non è specificato alcun nome.
ja: ターゲット型 '{1}' によって異なる名前が指定されている、または名前が何も指定されていないため、タプル要素名 '{0}' は無視されます。
ko: 튜플 요소 이름 '{0}'은(는) 대상 형식 '{1}'에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki „{0}” została zignorowana, ponieważ typ elementu docelowego „{1}” określa inną nazwę lub nie określa żadnej nazwy.
pt_br: O nome do elemento de tupla '{0}' foi ignorado porque um nome diferente ou nenhum nome foi especificado pelo tipo de destino '{1}'.
ru: Имя элемента кортежа "{0}" игнорируется, так как целевым типом "{1}" задано другое имя либо имя не задано.
tr: '{0}' demet öğesi adı, hedef tür olan '{1}' tarafından farklı bir ad belirtildiği veya hiçbir ad belirtilmediği için yoksayılıyor.
zh_hans: 由于目标类型“{1}”指定了其他名称或未指定名称，因此元组元素名称“{0}”被忽略。
zh_hant: 因為目標類型 '{1}' 指定了不同的名稱或未指定名稱，所以會忽略元組項目名稱 '{0}'。

# WRN_TupleLiteralNameMismatch_Title
source: The tuple element name is ignored because a different name or no name is specified by the assignment target.
cs: Název elementu řazené kolekce členů se ignoruje, protože cílem přiřazení je určený jiný nebo žádný název.
de: Der Tupelelementname wird ignoriert, da vom Zuweisungsziel ein anderer oder kein Name angegeben ist.
es: No se tiene en cuenta el nombre de elemento de tupla porque el destino de la asignación ha especificado otro nombre o no ha especificado ninguno.
fr: Le nom d'élément tuple est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié par la cible de l'assignation.
it: Il nome dell'elemento di tupla viene ignorato perché nella destinazione di assegnazione è specificato un nome diverso o non è specificato alcun nome.
ja: 代入先によって異なる名前が指定されているか、名前が何も指定されていないため、タプル要素名は無視されます。
ko: 튜플 요소 이름은 할당 대상에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki została zignorowana, ponieważ element docelowy przypisania określa inną nazwę lub nie określa żadnej nazwy.
pt_br: O nome do elemento de tupla é ignorado porque um nome diferente ou nenhum nome foi especificado pelo destino de atribuição.
ru: Имя элемента кортежа игнорируется, так как целевым объектом назначения задано другое имя либо имя не задано.
tr: Demet öğesi adı, atama hedefi tarafından farklı bir ad belirtildiği veya hiçbir ad belirtilmediği için yoksayılıyor.
zh_hans: 由于分配目标指定了其他名称或未指定名称，因此元组元素名称被忽略。
zh_hant: 因為指派目標指定了不同的名稱或未指定名稱，所以會忽略元組項目名稱。

# ERR_TupleReservedElementName
source: Tuple element name '{0}' is only allowed at position {1}.
cs: Název elementu řazené kolekce členů {0} je povolený jenom v pozici {1}.
de: Der Tupelelementname "{0}" ist nur an Position {1} zulässig.
es: El nombre '{0}' del elemento de tupla solo se permite en la posición {1}.
fr: Le nom d'élément de tuple '{0}' est uniquement autorisé à la position {1}.
it: Il nome di elemento di tupla '{0}' è consentito solo alla posizione {1}.
ja: タプル要素名 '{0}' は位置 {1} でのみ使用できます。
ko: 튜플 요소 이름 '{0}'은(는) {1} 위치에서만 허용됩니다.
pl: Nazwa elementu krotki „{0}“ jest dozwolona tylko na pozycji {1}.
pt_br: O nome do elemento de tupla '{0}' é permitido somente na posição {1}.
ru: Имя элемента кортежа "{0}" допускается только в позиции {1}.
tr: '{0}' demet öğesi adına yalnızca {1} konumunda izin verilir.
zh_hans: 只允许位置 {1} 使用元组元素名称“{0}”。
zh_hant: 只有位置 {1} 允許元組元素名稱 '{0}'。

# ERR_TupleReservedElementNameAnyPosition
source: Tuple element name '{0}' is disallowed at any position.
cs: Název elementu řazené kolekce členů {0} je zakázaný v jakékoliv pozici.
de: Der Tupelelementname "{0}" ist an keiner Position zulässig.
es: El nombre '{0}' del elemento de tupla no se permite en ninguna posición.
fr: Le nom d'élément de tuple '{0}' est interdit à toutes les positions.
it: Il nome di elemento di tupla '{0}' non è consentito in nessuna posizione.
ja: タプル要素名 '{0}' はいずれの位置でも使用できません。
ko: 튜플 요소 이름 '{0}'은(는) 어떤 위치에서도 허용되지 않습니다.
pl: Nazwa elementu krotki „{0}“ nie jest dozwolona na żadnej pozycji.
pt_br: O nome do elemento de tupla '{0}' não é permitido em qualquer posição.
ru: Имя элемента кортежа "{0}" не допускается ни в одной позиции.
tr: '{0}' demet öğesi adına hiçbir konumda izin verilmez.
zh_hans: 任何位置都不允许使用元组元素名称“{0}”。
zh_hant: 任何位置都不允許元組元素名稱 '{0}'。

# ERR_TupleTooFewElements
source: Tuple must contain at least two elements.
cs: Řazená kolekce členů musí obsahovat minimálně dva elementy.
de: Das Tupel muss mindestens zwei Elemente enthalten.
es: Una tupla debe contener al menos dos elementos.
fr: Le tuple doit contenir au moins deux éléments.
it: La tupla deve contenere almeno due elementi.
ja: タプルには 2 つ以上の要素が必要です。
ko: 튜플에는 요소가 두 개 이상 있어야 합니다.
pl: Krotka musi zawierać co najmniej dwa elementy.
pt_br: A tupla deve conter pelo menos dois elementos.
ru: Кортеж должен содержать по меньшей мере два элемента.
tr: Demet en az iki öğe içermelidir.
zh_hans: 元组必须包含至少两个元素。
zh_hant: 元組必須包含至少兩個項目。

# ERR_TupleElementNamesAttributeMissing
source: Cannot define a class or member that utilizes tuples because the compiler required type '{0}' cannot be found. Are you missing a reference?
cs: Nejde definovat třídu nebo člen, který používá řazenou kolekci členů, protože se nenašel kompilátor požadovaný typem {0}. Chybí vám odkaz?
de: Es kann keine Klasse bzw. kein Member definiert werden, die oder der Tupel verwendet, weil der für den Compiler erforderliche Typ "{0}" nicht gefunden wurde. Fehlt ggf. ein Verweis?
es: No se puede definir una clase o un miembro que utiliza tuplas porque no se encuentra el tipo requerido de compilador '{0}'. ¿Falta alguna referencia?
fr: Impossible de définir une classe ou un membre qui utilise des tuples, car le type '{0}' nécessaire au compilateur est introuvable. Une référence est-elle manquante ?
it: Non è possibile definire una classe o un membro che usa tuple perché non è stato trovato il tipo '{0}' richiesto dal compilatore. Probabilmente manca un riferimento.
ja: コンパイラの必須型 '{0}' が見つからないため、タプルを利用するクラスまたはメンバーを定義できません。参照が指定されていることを確認してください。
ko: 컴파일러에서 요구하는 '{0}' 형식을 찾지 못했기 때문에 튜플을 사용하는 클래스 또는 멤버를 정의할 수 없습니다. 참조가 있는지 확인하세요.
pl: Nie można zdefiniować klasy lub składowej, która wykorzystuje krotki, ponieważ nie można znaleźć wymaganego typu kompilatora „{0}”. Czy brakuje odwołania?
pt_br: Não é possível definir uma classe ou membro que utiliza tuplas porque o tipo '{0}' necessário de compilador não pode ser localizado. Uma referência está ausente?
ru: Невозможно определить класс или элемент, использующий кортежи, так как не удалось найти необходимый тип компилятора ({0}). Отсутствует ссылка?
tr: '{0}' türünü gerektiren derleyici bulunamadığından demetleri kullanan sınıf veya üye tanımlanamıyor. Bir başvuru eksik olabilir mi?
zh_hans: 由于找不到编译器必需的类型“{0}”，因此无法使用元组来定义类或成员。是否缺少引用?
zh_hant: 因為找不到編譯器所需的類型 '{0}'，所以無法定義利用元組的類別或成員。是否遺漏參考?

# ERR_ExplicitTupleElementNamesAttribute
source: Cannot reference 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitly. Use the tuple syntax to define tuple names.
cs: System.Runtime.CompilerServices.TupleElementNamesAttribute nejde odkazovat explicitně. K definici názvů řazené kolekce členů použijte její syntaxi.
de: Auf "System.Runtime.CompilerServices.TupleElementNamesAttribute" kann nicht explizit verwiesen werden. Verwenden Sie die Tupelsyntax zum Definieren von Tuplenamen.
es: No se puede hacer referencia a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explícitamente. Use la sintaxis de tupla para definir nombres de tupla.
fr: Impossible de référencer 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitement. Utilisez la syntaxe des tuples pour définir les noms de tuples.
it: Non è possibile fare riferimento a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' in modo esplicito. Usare la sintassi della tupla per definire i nomi di tupla.
ja: System.Runtime.CompilerServices.TupleElementNamesAttribute' を明示的に参照できません。タプル構文を使用してタプル名を定義します。
ko: System.Runtime.CompilerServices.TupleElementNamesAttribute'를 명시적으로 참조할 수 없습니다. 튜플 구문을 사용하여 튜플 이름을 정의하세요.
pl: Nie można odwołać się do atrybutu „System.Runtime.CompilerServices.TupleElementNamesAttribute” jawnie. Użyj składni krotek, aby zdefiniować nazwy krotek.
pt_br: Não é possível fazer referência a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitamente. Use a sintaxe de tupla para definir os nomes das tuplas.
ru: Невозможно явным образом добавить ссылку на "System.Runtime.CompilerServices.TupleElementNamesAttribute". Используйте синтаксис кортежа для определения имен кортежа.
tr: System.Runtime.CompilerServices.TupleElementNamesAttribute' öğesine açıkça başvurulamıyor. Demet adlarını tanımlamak için demet söz dizimini kullanın.
zh_hans: 无法显式引用 "System.Runtime.CompilerServices.TupleElementNamesAttribute"。请使用元组语法指定元组名称。
zh_hant: 無法明確參考 'System.Runtime.CompilerServices.TupleElementNamesAttribute'。請使用元組語法定義元組名稱。
