Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadPropertyAccessorFlagsRestrict
source: Access modifier '{0}' is not valid. The access modifier of 'Get' and 'Set' should be more restrictive than the property access level.
cs: Modifikátor přístupu {0} není platný. Modifikátor přístupu Get a Set by měl být víc omezující než úroveň přístupu vlastnosti.
de: Der {0}-Zugriffsmodifizierer ist ungültig. Der Zugriffsmodifizierer für "Get" und "Set" muss restriktiver sein als die Zugriffsebene der Eigenschaft.
es: El modificador de acceso '{0}' no es válido. El modificador de acceso de 'Get' y 'Set' debe ser más restrictivo que el nivel de acceso de la propiedad.
fr: Le modificateur d'accès '{0}' n'est pas valide. Le modificateur d'accès de 'Get' et 'Set' doit être plus restrictif que le niveau d'accès de la propriété.
it: Il modificatore di accesso '{0}' non è valido. Il modificatore di accesso di 'Get' e 'Set' deve essere più restrittivo del livello di accesso della proprietà.
ja: アクセス修飾子 '{0}' は有効ではありません。'Get' および 'Set' のアクセス修飾子は、プロパティのアクセス レベルよりも、より制限されている必要があります。
ko: '{0}' 액세스 한정자가 잘못되었습니다. 'Get' 및 'Set'의 액세스 한정자는 속성 액세스 수준보다 제한적이어야 합니다.
pl: Modyfikator dostępu „{0}” jest nieprawidłowy. Modyfikator dostępu elementu „Get” i „Set” powinien być bardziej restrykcyjny niż poziom dostępu do właściwości.
pt_br: Modificador de acesso "{0}" não é válido. O modificador de acesso de "Get" e "Set" deve ser mais restritivo que o nível de acesso da propriedade.
ru: Модификатор доступа "{0}" недействителен. Модификатор доступа для "Get" и "Set" должен быть более ограничивающим, чем уровень доступа к свойству.
tr: '{0}' erişim değiştiricisi geçerli değil. 'Get' ve 'Set' erişim değiştiricisi, özellik erişim düzeyinden daha kısıtlayıcı olmalıdır.
zh_hans: 访问修饰符“{0}”无效。“Get”和“Set”的访问修饰符的限制性应该比属性访问级别更强。
zh_hant: 存取修飾詞 '{0}' 無效。'Get' 和 'Set' 的存取修飾詞，應較屬性存取層級有更多限制。

# ERR_OnlyOneAccessorForGetSet
source: Access modifier can only be applied to either 'Get' or 'Set', but not both.
cs: Modifikátor přístupu jde použít buď pro metodu Get, nebo pro metodu Set, ne ale pro obě dvě.
de: Der Zugriffsmodifizierer kann entweder auf "Get" oder auf "Set" angewendet werden, aber nicht auf beide.
es: El modificador de acceso solo se puede aplicar a 'Get' o 'Set', no a ambos.
fr: Le modificateur d'accès ne peut être appliqué qu'à 'Get' ou 'Set', mais pas aux deux.
it: Un modificatore di accesso può essere applicato a 'Get' o a 'Set', ma non a entrambi.
ja: アクセス修飾子は、'Get' または 'Set' のいずれか 1 つにのみ適用できますが、両方には適用できません。
ko: 액세스 한정자는 'Get' 또는 'Set' 중 하나에만 적용할 수 있습니다.
pl: Modyfikator dostępu można stosować do elementu „Get” lub elementu „Set”, ale nie do obu elementów naraz.
pt_br: O modificador de acesso deve ser aplicado somente para o 'Get' ou para o 'Set', mas não para ambos.
ru: Модификатор доступа может применяться либо к "Get", либо к "Set", но не к обоим методам одновременно.
tr: Erişim değiştiricisi yalnızca 'Get' veya 'Set' için uygulanabilir, ancak her ikisine birden uygulanamaz.
zh_hans: 访问修饰符只能用于 "Get" 或者 "Set"，但不能同时用于这二者。
zh_hant: 存取修飾詞只能套用至 'Get' 或 'Set'，但不能同時套用至兩者。

# ERR_NoAccessibleSet
source: 'Set' accessor of property '{0}' is not accessible.
cs: 'Přistupující objekt Set vlastnosti {0} není dostupný.
de: 'Auf den Set-Accessor der {0}-Eigenschaft kann nicht zugegriffen werden.
es: 'No se puede tener acceso al descriptor de acceso 'Set' de la propiedad '{0}'.
fr: 'L'accesseur 'Set' de la propriété '{0}' n'est pas accessible.
it: 'La funzione di accesso 'Set' della proprietà '{0}' non è accessibile.
ja: 'プロパティ '{0}' の 'Set' アクセサーにアクセスできません。
ko: '{0}' 속성의 'Set' 접근자에 액세스할 수 없습니다.
pl: 'Metoda dostępu „Set” właściwości „{0}” jest niedostępna.
pt_br: 'Acessador de propriedade "Set" "{0}" não está acessível.
ru: 'Метод доступа свойства "Set" "{0}" недоступен.
tr: '{0}' özelliğinin 'Set' erişimcisine erişilemiyor.
zh_hans: '属性“{0}”的“Set”访问器不可访问。
zh_hant: '無法存取屬性 '{0}' 的 'Set' 存取子。

# ERR_NoAccessibleGet
source: 'Get' accessor of property '{0}' is not accessible.
cs: 'Přistupující objekt Get vlastnosti {0} není dostupný.
de: 'Auf den Get-Accessor der {0}-Eigenschaft kann nicht zugegriffen werden.
es: 'No se puede tener acceso al descriptor de acceso 'Get' de la propiedad '{0}'.
fr: 'L'accesseur 'Get' de la propriété '{0}' n'est pas accessible.
it: 'La funzione di accesso 'Get' della proprietà '{0}' non è accessibile.
ja: 'プロパティ '{0}' の 'Get' アクセサーにアクセスできません。
ko: '{0}' 속성의 'Get' 접근자에 액세스할 수 없습니다.
pl: 'Metoda dostępu „Get” właściwości „{0}” jest niedostępna.
pt_br: 'Acessador de propriedade "Set" "{0}" não está acessível.
ru: 'Метод доступа свойства "Get" "{0}" недоступен.
tr: '{0}' özelliğinin 'Get' erişimcisine erişilemiyor.
zh_hans: '属性“{0}”的“Get”访问器不可访问。
zh_hant: '無法存取屬性 '{0}' 的 'Get' 存取子。

# ERR_WriteOnlyNoAccessorFlag
source: 'WriteOnly' properties cannot have an access modifier on 'Set'.
cs: 'Vlastnosti WriteOnly nemůžou mít modifikátor přístupu nastaven na hodnotu Set.
de: 'WriteOnly-Eigenschaften können keinen Zugriffsmodifizierer für "Set" haben.
es: 'Las propiedades 'WriteOnly' no pueden tener un modificador de acceso en 'Set'.
fr: 'Les propriétés 'WriteOnly' ne peuvent pas avoir un modificateur d'accès pour 'Set'.
it: 'Le proprietà 'WriteOnly' non possono avere un modificatore di accesso su 'Set'.
ja: 'WriteOnly' プロパティでは、'Set' にアクセス修飾子を指定することはできません。
ko: 'WriteOnly' 속성에는 'Set'에 대한 액세스 한정자를 사용할 수 없습니다.
pl: 'Właściwości „WriteOnly” nie mogą mieć modyfikatora dostępu w elemencie „Set”.
pt_br: 'Propriedades 'WriteOnly' não podem ter modificadores de acesso em 'Set'.
ru: 'Свойства со спецификатором WriteOnly не могут иметь модификатор доступа для Set.
tr: 'WriteOnly' özelliklerinde 'Set' üzerinde erişim değiştiricisi olamaz.
zh_hans: '"WriteOnly" 属性在 "Set" 上不能有访问修饰符。
zh_hant: 'WriteOnly' 屬性在 'Set' 上不能有存取修飾詞。

# ERR_ReadOnlyNoAccessorFlag
source: 'ReadOnly' properties cannot have an access modifier on 'Get'.
cs: 'Vlastnosti ReadOnly nemůžou mít modifikátor přístupu nastavený na hodnotu Get.
de: 'ReadOnly-Eigenschaften können keinen Zugriffsmodifizierer für "Get" haben.
es: 'Las propiedades 'ReadOnly' no pueden tener un modificador de acceso en 'Get'.
fr: 'Les propriétés 'ReadOnly' ne peuvent pas avoir un modificateur d'accès pour 'Get'.
it: 'Le proprietà 'ReadOnly' non possono avere un modificatore di accesso in 'Get'.
ja: 'ReadOnly' プロパティでは、'Get' にアクセス修飾子を指定することはできません。
ko: 'ReadOnly' 속성에는 'Get'에 대한 액세스 한정자를 사용할 수 없습니다.
pl: 'Właściwości „ReadOnly” nie mogą mieć modyfikatora dostępu w elemencie „Get”.
pt_br: 'Propriedades 'ReadOnly' não podem ter modificadores de acesso em 'Get'.
ru: 'Свойства со спецификатором "ReadOnly" не могут иметь модификатор доступа для "Get".
tr: 'ReadOnly' özelliklerinin 'Get' üzerinde erişim değiştiricisi olamaz.
zh_hans: '"ReadOnly" 属性在 "Get" 上不能有访问修饰符。
zh_hant: 'ReadOnly' 屬性在 'Get' 上不能有存取修飾詞。

# ERR_BadPropertyAccessorFlags1
source: Property accessors cannot be declared '{0}' in a 'NotOverridable' property.
cs: Přistupující objekty vlastnosti nejde deklarovat jako {0} ve vlastnosti NotOverridable.
de: Eigenschaftenaccessoren können in einer NotOverridable-Eigenschaft nicht als "{0}" deklariert werden.
es: Los descriptores de acceso de la propiedad no se pueden declarar como '{0}' en una propiedad 'NotOverridable'.
fr: Les accesseurs de propriété ne peuvent pas être déclarés '{0}' dans une propriété 'NotOverridable'.
it: Le funzioni di accesso alle proprietà non possono essere dichiarate come '{0}' in una proprietà 'NotOverridable'.
ja: プロパティ アクセサーを 'NotOverridable' プロパティ内で '{0}' として宣言できません。
ko: NotOverridable' 속성에서는 속성 접근자를 '{0}'(으)로 선언할 수 없습니다.
pl: Metod dostępu do właściwości nie można deklarować jako „{0}” we właściwości „NotOverridable”.
pt_br: Acessadores de propriedade não podem ser declarados "{0}" em uma propriedade "NotOverridable".
ru: Методы доступа к свойствам нельзя объявить как "{0}" в свойстве "NotOverridable".
tr: NotOverridable' özelliğinde özellik erişimcileri '{0}' olarak bildirilemez.
zh_hans: 属性访问器不能在“NotOverridable”属性中声明为“{0}”。
zh_hant: 屬性存取子在 'NotOverridable' 屬性中不可宣告為 '{0}'。

# ERR_BadPropertyAccessorFlags2
source: Property accessors cannot be declared '{0}' in a 'Default' property.
cs: Přistupující objekty vlastnosti nejde deklarovat jako {0} ve vlastnosti Default.
de: Eigenschaftenaccessoren können in einer Default-Eigenschaft nicht als "{0}" deklariert werden.
es: Los descriptores de acceso de la propiedad no se pueden declarar como '{0}' en una propiedad 'Default'.
fr: Les accesseurs de propriété ne peuvent pas être déclarés '{0}' dans une propriété 'Default'.
it: Le funzioni di accesso alle proprietà non possono essere dichiarate come '{0}' in una proprietà 'Default'.
ja: プロパティ アクセサーを 'Default' プロパティ内で '{0}' として宣言できません。
ko: Default' 속성에서는 속성 접근자를 '{0}'(으)로 선언할 수 없습니다.
pl: Metod dostępu do właściwości nie można deklarować jako „{0}” we właściwości „Default”.
pt_br: Acessadores de propriedade não podem ser declarados "{0}" em uma propriedade "Default".
ru: Методы доступа к свойствам нельзя объявить "{0}" в свойстве "Default".
tr: Default' özelliğinde özellik erişimcileri '{0}' olarak bildirilemez.
zh_hans: 属性访问器不能在“Default”属性中声明为“{0}”。
zh_hant: 屬性存取子在 'Default' 屬性中不可宣告為 '{0}'。

# ERR_BadPropertyAccessorFlags3
source: Property cannot be declared '{0}' because it contains a 'Private' accessor.
cs: Vlastnost nejde deklarovat jako {0}, protože obsahuje přistupující objekt Private.
de: Die Eigenschaft kann nicht als "{0}" deklariert werden, da sie einen Private-Accessor enthält.
es: La propiedad no se puede declarar como '{0}' porque contiene un descriptor de acceso 'Private'.
fr: La propriété ne peut pas être déclarée '{0}', car elle contient un accesseur 'Private'.
it: La proprietà non può essere dichiarata come '{0}' perché contiene una funzione di accesso 'Private'.
ja: Private' アクセサーを含むため、プロパティを '{0}' と宣言できません。
ko: 속성에 'Private' 접근자가 포함되어 있어 '{0}'(으)로 선언할 수 없습니다.
pl: Właściwość nie może być zadeklarowana jako „{0}”, ponieważ zawiera metodę dostępu „Private”.
pt_br: Propriedade não pode ser declarada "{0}" porque contém um acessador "Private".
ru: Свойство не может быть объявлено "{0}", поскольку оно содержит метод доступа "Private".
tr: Özellik 'Private' erişimcisi içerdiğinden '{0}' olarak bildirilemez.
zh_hans: 属性包含“Private”访问器，因此不能声明为“{0}”。
zh_hant: 屬性不可宣告為 '{0}'，因為它包含 'Private' 存取子。

# ERR_InAccessibleCoClass3
source: Implementing class '{0}' for interface '{1}' is not accessible in this context because it is '{2}'.
cs: Implementace třídy {0} pro rozhraní {1} není přístupná v tomto kontextu, protože je {2}.
de: Die implementierende {0}-Klasse für die {1}-Schnittstelle ist "{2}" und in diesem Kontext nicht zugreifbar.
es: No se puede obtener acceso a la clase de implementación '{0}' de la interfaz '{1}' en este contexto porque es '{2}'.
fr: La classe d'implémentation '{0}' pour l'interface '{1}' n'est pas accessible dans ce contexte, car elle est '{2}'.
it: La classe di implementazione '{0}' per l'interfaccia '{1}' non è accessibile in questo contesto perché è '{2}'.
ja: インターフェイス '{1}' に対して実装するクラス '{0}' は '{2}' であるため、このコンテキストではアクセスできません。
ko: '{1}' 인터페이스의 '{0}' 구현 클래스는 '{2}'이므로 이 컨텍스트에서 액세스할 수 없습니다.
pl: Implementująca klasa „{0}” dla interfejsu „{1}” jest niedostępna w tym kontekście, ponieważ jest to element „{2}”.
pt_br: Implementar a classe "{0}" para a interface "{1}" não é acessível neste contexto porque é "{2}".
ru: Реализация класса "{0}" для интерфейса "{1}" недоступна в этом контексте, поскольку он является "{2}".
tr: '{2}' olduğundan bu bağlamda '{1}' arabirimi için '{0}' uygulayan sınıfı erişilebilir değil.
zh_hans: 接口“{1}”的实现类“{0}”是“{2}”，因此它在此上下文中不可访问。
zh_hant: 無法在此內容中存取介面 '{1}' 的實作類別 '{0}'，因為其為 '{2}'。

# ERR_MissingValuesForArraysInApplAttrs
source: Arrays used as attribute arguments are required to explicitly specify values for all elements.
cs: U polí použitých jako argumenty atributu se vyžaduje explicitní zadání hodnot pro všechny elementy.
de: Arrays, die als Attributargumente verwendet werden, müssen explizit Werte für alle Elemente angeben.
es: Las matrices usadas como argumentos de atributo son necesarias para especificar explícitamente los valores de todos los elementos.
fr: Les tableaux utilisés en tant qu'arguments d'attribut sont requis pour spécifier explicitement des valeurs pour tous les éléments.
it: Per specificare in modo esplicito i valori per tutti gli elementi, sono necessarie matrici usate come argomenti di attributo.
ja: 属性の引数として使用される配列には、すべての要素の値を明示的に指定する必要があります。
ko: 모든 요소에 대한 값을 명시적으로 지정하려면 특성 인수로 사용되는 배열이 필요합니다.
pl: Tablice używane jako argumenty atrybutów są wymagane do jawnego określenia wartości dla wszystkich elementów.
pt_br: Matrizes usadas como argumentos de atributos devem explicitamente especificar valores para todos os elementos.
ru: Для массивов, используемых как аргументы атрибутов, требуется явное указание значений для всех элементов.
tr: Tüm öğelerin değerlerini açıkça belirtmek için öznitelik bağımsız değişkenleri olarak kullanılan diziler gerekir.
zh_hans: 必须有用作特性参数的数组才能显式指定所有元素的值。
zh_hant: 明確指定所有元素的值時，用做為屬性引數的陣列為必要項目。

# ERR_ExitEventMemberNotInvalid
source: 'Exit AddHandler', 'Exit RemoveHandler' and 'Exit RaiseEvent' are not valid. Use 'Return' to exit from event members.
cs: 'Možnosti Exit AddHandler, Exit RemoveHandler a Exit RaiseEvent jsou neplatné. Použijte možnost Return pro ukončení ze členů událostí.
de: '"Exit AddHandler", "Exit RemoveHandler" und "Exit RaiseEvent" sind nicht gültig. Verwenden Sie "Return", um Ereignismember zu beenden.
es: 'Exit AddHandler', 'Exit RemoveHandler' y 'Exit RaiseEvent' no son válidos. Use 'Return' para salir de los miembros de evento.
fr: 'Exit AddHandler', 'Exit RemoveHandler' et 'Exit RaiseEvent' ne sont pas valides. Utilisez 'Return' pour quitter les membres d'événement.
it: 'Exit AddHandler', 'Exit RemoveHandler' e 'Exit RaiseEvent' non sono validi. Usare 'Return' per uscire dai membri dell'evento.
ja: 'Exit AddHandler'、'Exit RemoveHandler'、および 'Exit RaiseEvent' は有効ではありません。イベント メンバーを終了するには、'Return' を使用してください。
ko: 'Exit AddHandler', 'Exit RemoveHandler' 및 'Exit RaiseEvent'가 잘못되었습니다. 이벤트 멤버에서 나오려면 'Return'을 사용하세요.
pl: 'Elementy „Exit AddHandler”, „Exit RemoveHandler” i „Exit RaiseEvent” są nieprawidłowe. Użyj elementu „Return”, aby wyjść ze składowych zdarzenia.
pt_br: 'Exit AddHandler', 'Exit RemoveHandler' e 'Exit RaiseEvent' não são válidos. Use 'Return' para sair de membros de evento.
ru: '"Exit AddHandler", "Exit RemoveHandler" и "Exit RaiseEvent" недопустимы. Используйте "Return" для выхода из членов-событий.
tr: 'Exit AddHandler', 'Exit RemoveHandler' ve 'Exit RaiseEvent' geçerli değil. Olay üyelerinden çıkmak için 'Return' kullanın.
zh_hans: '"Exit AddHandler"、"Exit RemoveHandler" 和 "Exit RaiseEvent" 无效。请使用 "Return" 从事件成员中退出。
zh_hant: 'Exit AddHandler'、'Exit RemoveHandler' 和 'Exit RaiseEvent' 無效。請使用 'Return' 結束事件成員。

# ERR_InvInsideEndsEvent
source: Statement cannot appear within an event body. End of event assumed.
cs: Příkaz se nemůže objevit v těle události. Předpokládá se konec události.
de: Die Anweisung kann nicht innerhalb des Ereignistexts verwendet werden. Das Ende des Ereignisses wird angenommen.
es: La instrucción no puede aparecer en el cuerpo de un evento. Se supone el final del evento.
fr: Cette instruction ne peut pas apparaître dans le corps d'un événement. Elle est interprétée comme la fin de l'événement.
it: L'istruzione non può essere specificata nel corpo di un evento. Verrà interpretata come fine dell'evento.
ja: ステートメントをイベント本体内部に記述することはできません。イベントの終わりと見なされます。
ko: 이벤트 본문 안에는 문을 사용할 수 없습니다. 이벤트의 끝으로 간주합니다.
pl: Instrukcja nie może wystąpić w treści zdarzenia. Założono koniec zdarzenia.
pt_br: A instrução não pode aparecer dentro do corpo de evento. Fim de evento assumido.
ru: Оператор не может появляться в теле события. Подразумевается завершение события.
tr: Olay gövdesi içinde deyim bulunamaz. Olay sonu varsayıldı.
zh_hans: 语句不能出现在事件体内。假定为事件末尾。
zh_hant: 陳述式不能出現在事件主體內。假設是事件結尾。

# ERR_MissingEndEvent
source: 'Custom Event' must end with a matching 'End Event'.
cs: 'Klíčové slovo Custom Event musí být ukončené párovým klíčovým slovem End Event.
de: '"Custom Event" muss mit einem entsprechenden "End Event" abgeschlossen werden.
es: 'Custom Event' debe terminar con una declaración 'End Event' correspondiente.
fr: 'Custom Event' doit se terminer par un 'End Event' correspondant.
it: 'Custom Event' deve terminare con un elemento 'End Event' corrispondente.
ja: 'Custom Event' は対応する 'End Event' で終了しなければなりません。
ko: 'Custom Event'는 짝이 되는 'End Event'로 끝나야 합니다.
pl: 'Element „Custom Event” musi być zakończony odpowiadającym mu elementem „End Event”.
pt_br: 'Custom Event' deve terminar com 'End Event' correspondente.
ru: 'Оператор "Custom Event" должен завершаться соответствующим оператором "End Event".
tr: 'Custom Event' öğesi eşleşen bir 'End Event' ile bitmelidir.
zh_hans: 'Custom Event 必须以匹配的 "End Event" 结束。
zh_hant: 'Custom Event' 結尾必須是對應的 'End Event'。

# ERR_MissingEndAddHandler
source: 'AddHandler' declaration must end with a matching 'End AddHandler'.
cs: 'Deklarace AddHandler musí být ukončená párovou deklarací End AddHandler.
de: 'Eine AddHandler-Deklaration muss mit einer entsprechenden "End AddHandler"-Anweisung enden.
es: 'La declaración 'AddHandler' debe terminar con una declaración 'End AddHandler' correspondiente.
fr: 'La déclaration 'AddHandler' doit se terminer par un 'End AddHandler' correspondant.
it: La dichiarazione 'AddHandler' deve terminare con un elemento 'End AddHandler' corrispondente.
ja: 'AddHandler' 宣言の終わりには、対応する 'End AddHandler' を指定しなければなりません。
ko: 'AddHandler' 선언은 짝이 되는 'End AddHandler'로 끝나야 합니다.
pl: 'Deklaracja „AddHandler” musi być zakończona odpowiadającym jej elementem „End AddHandler”.
pt_br: 'A declaração 'AddHandler' deve terminar com 'End AddHandler' correspondente.
ru: 'Объявление "AddHandler" должно завершаться соответствующим оператором "End AddHandler".
tr: 'AddHandler' bildirimi eşleşen bir 'End AddHandler' ile bitmelidir.
zh_hans: '"AddHandler" 声明必须以匹配的 "End AddHandler" 结束。
zh_hant: 'AddHandler' 宣告之後必須搭配相對應的 'End AddHandler'。

# ERR_MissingEndRemoveHandler
source: 'RemoveHandler' declaration must end with a matching 'End RemoveHandler'.
cs: 'Deklarace RemoveHandler musí být ukončená párovou deklarací End RemoveHandler.
de: 'Die RemoveHandler-Deklaration muss mit einem entsprechenden "End RemoveHandler" abgeschlossen werden.
es: 'La declaración 'RemoveHandler' debe terminar con una declaración 'End RemoveHandler' correspondiente.
fr: 'La déclaration 'RemoveHandler' doit se terminer par un 'End RemoveHandler' correspondant.
it: La dichiarazione 'RemoveHandler' deve terminare con un elemento 'End RemoveHandler' corrispondente.
ja: 'RemoveHandler' 宣言の終わりには、対応する 'End RemoveHandler' を指定しなければなりません。
ko: 'RemoveHandler' 선언은 짝이 되는 'End RemoveHandler'로 끝나야 합니다.
pl: 'Deklaracja „RemoveHandler” musi być zakończona odpowiadającym jej elementem „End RemoveHandler”.
pt_br: 'A declaração 'RemoveHandler' deve terminar com 'End RemoveHandler' correspondente.
ru: 'Объявление "RemoveHandler" должно завершаться соответствующим оператором "End RemoveHandler".
tr: 'RemoveHandler' bildirimi eşleşen bir 'End RemoveHandler' ile bitmelidir.
zh_hans: '"RemoveHandler" 声明必须以匹配的 "End RemoveHandler" 结束。
zh_hant: 'RemoveHandler' 宣告之後必須搭配相對應的 'End RemoveHandler'。

# ERR_MissingEndRaiseEvent
source: 'RaiseEvent' declaration must end with a matching 'End RaiseEvent'.
cs: 'Deklarace RaiseEvent musí být ukončená párovou deklarací End RaiseEvent.
de: 'Die RaiseEvent-Deklaration muss mit einem entsprechenden "End RaiseEvent" abgeschlossen werden.
es: 'La declaración 'RaiseEvent' debe terminar con una declaración 'End RaiseEvent' correspondiente.
fr: 'La déclaration 'RaiseEvent' doit se terminer par un 'End RaiseEvent' correspondant.
it: La dichiarazione 'RaiseEvent' deve terminare con un elemento 'End RaiseEvent' corrispondente.
ja: 'RaiseEvent' 宣言の終わりには、対応する 'End RaiseEvent' を指定しなければなりません。
ko: 'RaiseEvent' 선언은 짝이 되는 'End RaiseEvent'로 끝나야 합니다.
pl: 'Deklaracja „RaiseEvent” musi być zakończona odpowiadającym jej elementem „End RaiseEvent”.
pt_br: 'A declaração 'RaiseEvent' deve terminar com 'End RaiseEvent' correspondente.
ru: 'Объявление "RaiseEvent" должно завершаться соответствующим оператором "End RaiseEvent".
tr: 'RaiseEvent' bildirimi eşleşen bir 'End RaiseEvent' ile bitmelidir.
zh_hans: '"RaiseEvent" 声明必须以匹配的 "End RaiseEvent" 结束。
zh_hant: 'RaiseEvent' 宣告之後必須搭配相對應的 'End RaiseEvent'。

# ERR_CustomEventInvInInterface
source: 'Custom' modifier is not valid on events declared in interfaces.
cs: 'Modifikátor Custom není platný pro události deklarované v rozhraních.
de: 'Der Custom-Modifizierer ist für Ereignisse, die in Schnittstellen deklariert sind, nicht gültig.
es: 'El modificador 'Custom' no es válido en los eventos declarados en interfaces.
fr: 'Le modificateur 'Custom' n'est pas valide pour les événements déclarés dans les interfaces.
it: Il modificatore 'Custom' non è valido negli eventi dichiarati nelle interfacce.
ja: 'Custom' 修飾子は、インターフェイスで宣言されたイベントでは無効です。
ko: '인터페이스에 선언된 이벤트에는 'Custom' 한정자를 사용할 수 없습니다.
pl: 'Modyfikator „Custom” jest nieprawidłowy w zdarzeniach deklarowanych w interfejsach.
pt_br: 'O modificador 'Custom' não é válido em eventos declarados em interfaces.
ru: 'Модификатор Custom недопустим для событий, объявленных в интерфейсах.
tr: 'Custom' değiştiricisi arabirimlerde bildirilen olaylarda geçerli değil.
zh_hans: '“Custom”修饰符在接口中声明的事件上无效。
zh_hant: 'Custom' 修飾元在以介面宣告的事件中無效。

# ERR_CustomEventRequiresAs
source: 'Custom' modifier is not valid on events declared without explicit delegate types.
cs: 'Modifikátor Custom není platný pro události deklarované bez explicitních typů delegátů.
de: 'Der Custom-Modifizierer ist nicht gültig für Ereignisse, die ohne expliziten Delegattyp deklariert wurden.
es: 'El modificador 'Custom' no es válido en los eventos declarados sin tipos delegados explícitos.
fr: 'Le modificateur 'Custom' n'est pas valide pour les événements déclarés sans types délégués explicites.
it: Il modificatore 'Custom' non è valido negli eventi dichiarati senza tipi delegati espliciti
ja: 'Custom' 修飾子は、明示的なデリゲート型なしで宣言されたイベントでは無効です。
ko: '명시적 대리자 형식 없이 선언된 이벤트에는 'Custom' 한정자를 사용할 수 없습니다.
pl: 'Modyfikator „Custom” jest nieprawidłowy w zdarzeniach deklarowanych bez jawnych typów delegata.
pt_br: 'O modificador 'Custom' não é válido em eventos declarados sem tipos delegados explícitos.
ru: 'Модификатор "Custom" недопустим для событий, объявленных без явных типов делегата.
tr: 'Custom' değiştiricisi açık temsilci türleri olmadan bildirilen olaylarda geçerli değildir.
zh_hans: '“Custom”修饰符在未用显式委托类型声明的事件上无效。
zh_hant: 'Custom' 修飾元在沒有以明確委派類型宣告的事件中無效。

# ERR_InvalidEndEvent
source: 'End Event' must be preceded by a matching 'Custom Event'.
cs: 'Příkazu End Event musí předcházet párový příkaz Custom Event.
de: 'End Event muss eine entsprechende "Custom Event"-Deklaration voranstehen.
es: 'End Event' debe ir precedida de una declaración 'Custom Event' correspondiente.
fr: 'End Event' doit être précédé d'un 'Custom Event' correspondant.
it: 'End Event' deve essere preceduto da un elemento 'Custom Event' corrispondente.
ja: 'End Event' の前には、対応する 'Custom Event' を指定しなければなりません。
ko: 'End Event'는 짝이 되는 'Custom Event' 뒤에 와야 합니다.
pl: 'Element „End Event” musi być poprzedzony odpowiadającym mu elementem „Custom Event”.
pt_br: 'End Event' deve ser precedido por 'Custom Event' correspondente.
ru: 'Оператору "End Event" должен предшествовать соответствующий оператор "Custom Event".
tr: 'End Event' öncesinde eşleşen bir 'Custom Event' olmalıdır.
zh_hans: '“End Event”前面必须是匹配的“Custom Event”。
zh_hant: 'End Event' 之前必須搭配相對應的 'Custom Event'。
