Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadAttributePropertyType1
source: Property or field '{0}' does not have a valid attribute type.
cs: Vlastnost nebo pole {0} nemá platný typ atributu.
de: Die {0}-Eigenschaft oder das entsprechende Feld haben keinen zulässigen Attributtyp.
es: La propiedad o el campo '{0}' no tienen un tipo de atributo válido.
fr: La propriété ou le champ '{0}' n'utilise pas un type d'attribut valide.
it: La proprietà o il campo '{0}' non contiene un tipo di attributo valido.
ja: プロパティまたはフィールド '{0}' に、有効な属性型が指定されていません。
ko: '{0}' 속성 또는 필드의 특성 형식이 잘못되었습니다.
pl: Właściwość lub pole „{0}” nie ma prawidłowego typu atrybutu.
pt_br: Propriedade ou campo "{0}" não tem um tipo de atributo válido.
ru: Свойство или поле "{0}" не имеет атрибута допустимого типа.
tr: '{0}' özelliği veya alanının öznitelik türü geçerli değil.
zh_hans: 属性或字段“{0}”没有有效的特性类型。
zh_hant: 屬性或欄位 '{0}' 不具備有效的屬性類型。

# ERR_LocalsCannotHaveAttributes
source: Attributes cannot be applied to local variables.
cs: Atributy nejde použít pro lokální proměnné.
de: Attribute können nicht auf lokale Variablen angewendet werden.
es: No se pueden aplicar atributos a las variables locales.
fr: Les attributs ne peuvent pas être appliqués aux variables locales.
it: Gli attributi non possono essere applicati alle variabili locali.
ja: ローカル変数に属性を適用することはできません。
ko: 지역 변수에는 특성을 적용할 수 없습니다.
pl: Nie można zastosować atrybutów do zmiennych lokalnych.
pt_br: Atributos não podem ser aplicados a variáveis locais.
ru: Атрибуты не могут использоваться для локальных переменных.
tr: Öznitelikler yerel değişkenlere uygulanamaz.
zh_hans: 特性不能应用于局部变量。
zh_hant: 屬性不可以套用至區域變數。

# ERR_PropertyOrFieldNotDefined1
source: Field or property '{0}' is not found.
cs: Vlastnost nebo pole {0} se nenašly.
de: Das Feld oder die Eigenschaft "{0}" wurde nicht gefunden.
es: Campo o propiedad '{0}' no encontrados.
fr: Le champ ou la propriété '{0}' est introuvable.
it: La proprietà o il campo {0} non è stato trovato.
ja: フィールドまたはプロパティ '{0}' が見つかりません。
ko: '{0}' 속성 또는 필드를 찾을 수 없습니다.
pl: Nie odnaleziono pola lub właściwości „{0}”.
pt_br: Campo ou propriedade "{0}" não encontrado.
ru: Не найдено поле или свойство "{0}".
tr: '{0}' alanı veya özelliği bulunamadı.
zh_hans: 找不到字段或属性“{0}”。
zh_hant: 找不到欄位或屬性 '{0}'。

# ERR_InvalidAttributeUsage2
source: Attribute '{0}' cannot be applied to '{1}' because the attribute is not valid on this declaration type.
cs: Atribut {0} nejde použít pro člena {1}, protože není platný pro tento deklarovaný typ.
de: Das Attribut "{0}" kann nicht auf "{1}" angewendet werden, da das Attribut für diesen Deklarationstyp nicht gültig ist.
es: El atributo '{0}' no se puede aplicar a '{1}' porque el atributo no es válido en este tipo de declaración.
fr: L'attribut '{0}' ne peut pas être appliqué à '{1}', car il n'est pas valide dans ce type de déclaration.
it: Non è possibile applicare l'attributo '{0}' a '{1}'. L'attributo non è valido per questo tipo di dichiarazione.
ja: 属性 '{0}' を '{1}' に適用できません。この属性はこの種類の宣言では有効ではありません。
ko: 이 선언 형식에서는 '{0}' 특성이 유효하지 않으므로 '{1}'에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „{0}” do elementu „{1}”, ponieważ atrybut nie jest prawidłowy w tym typie deklaracji.
pt_br: Atributo "{0}" não pode ser aplicado a "{1}" porque o atributo não é válido neste tipo de declaração.
ru: Атрибут "{0}" не может использоваться для "{1}", поскольку данный атрибут не допускается для этого типа объявления.
tr: '{0}' özniteliği bu bildirim türünde geçerli olmadığından '{1}' öğesine uygulanamaz.
zh_hans: 属性“{0}”不能应用于“{1}”，因为该属性在此声明类型中无效。
zh_hant: 無法將屬性 '{0}' 套用至 '{1}'，因為該屬性在此宣告類型上無效。

# ERR_InvalidAttributeUsageOnAccessor
source: Attribute '{0}' cannot be applied to '{1}' of '{2}' because the attribute is not valid on this declaration type.
cs: Atribut {0} nejde použít pro člena {1} v {2}, protože není platný pro tento deklarovaný typ.
de: Das Attribut "{0}" kann nicht auf "{1}" von "{2}" angewendet werden, da das Attribut für diesen Deklarationstyp nicht gültig ist.
es: El atributo '{0}' no se puede aplicar a '{1}' de '{2}' porque el atributo no es válido en este tipo de declaración.
fr: L'attribut '{0}' ne peut pas être appliqué à '{1}' de '{2}', car il n'est pas valide dans ce type de déclaration.
it: Non è possibile applicare l'attributo '{0}' a '{1}' di '{2}'. L'attributo non è valido per questo tipo di dichiarazione.
ja: 属性 '{0}' を '{2}' の '{1}' に適用できません。この属性はこの種類の宣言では有効ではありません。
ko: 이 선언 형식에서는 '{0}' 특성이 유효하지 않으므로 '{2}'의 '{1}'에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „{0}” do elementu „{1}” w „{2}”, ponieważ atrybut nie jest prawidłowy w tym typie deklaracji.
pt_br: Atributo "{0}" não pode ser aplicado a "{1}" de "{2}" porque o atributo não é válido neste tipo de declaração.
ru: Атрибут "{0}" не может использоваться для "{1}" из "{2}", поскольку данный атрибут не допускается для этого типа объявления.
tr: '{0}' özniteliği bu bildirim türünde geçerli olmadığından '{2}' '{1}' öğesine uygulanamaz.
zh_hans: 属性“{0}”不能应用于“{2}”的“{1}”，因为该属性在此声明类型中无效。
zh_hant: 無法將屬性 '{0}' 套用至 '{2}' 的 '{1}'，因為該屬性在此宣告類型上無效。

# ERR_NestedTypeInInheritsClause2
source: Class '{0}' cannot reference its nested type '{1}' in Inherits clause.
cs: Třída {0} nemůže odkazovat na svůj vnořený typ {1} v klauzuli Inherits.
de: Die Klasse "{0}" kann in einer Inherits-Klausel nicht auf ihren geschachtelten Typ "{1}" verweisen.
es: La clase '{0}' no puede hacer referencia a su tipo anidado '{1}' en la cláusula Inherits.
fr: La classe '{0}' ne peut pas faire référence à son type incorporé '{1}' dans la clause Inherits.
it: La classe '{0}' non può fare riferimento al relativo tipo annidato '{1}' nella clausola Inherits.
ja: クラス '{0}' は、入れ子にされた型 '{1}' を Inherits 句で参照できません。
ko: '{0}' 클래스는 상속 절에서 '{1}' 중첩 형식을 참조할 수 없습니다.
pl: Klasa „{0}” nie może odwoływać się do swojego zagnieżdżonego typu „{1}” w klauzuli Inherits.
pt_br: Classe "{0}" não pode referenciar seu tipo aninhado "{1}" na cláusula Inherits.
ru: Класс "{0}" не может ссылаться на вложенный тип "{1}" в предложении Inherits.
tr: '{0}' sınıfı Inherits yan tümcesinde kendi iç içe '{1}' türüne başvuramaz.
zh_hans: 类“{0}”无法在 Inherits 子句中引用其嵌套类型“{1}”。
zh_hant: 類別 '{0}' 無法參考其在 Inherits 子句中的巢狀類型 '{1}'。

# ERR_TypeInItsInheritsClause1
source: Class '{0}' cannot reference itself in Inherits clause.
cs: Třída {0} nemůže odkazovat na sebe samu v klauzuli Inherits.
de: Die Klasse "{0}" kann in einer Inherits-Klausel nicht auf sich selbst verweisen.
es: La clase '{0}' no puede hacer referencia a sí misma en la cláusula Inherits.
fr: La classe '{0}' ne peut pas se référencer elle-même dans une clause Inherits.
it: La classe '{0}' non può fare riferimento a se stessa nella clausola Inherits.
ja: クラス '{0}' は、Inherits 句でそれ自体を参照することはできません。
ko: '{0}' 클래스는 상속 절에서 자신을 참조할 수 없습니다.
pl: Klasa „{0}” nie może odwoływać się siebie samej w klauzuli Inherits.
pt_br: Classe "{0}" não pode referenciar a si mesmo na cláusula Inherits.
ru: Класс "{0}" не может ссылаться на себя в предложении Inherits.
tr: Inherits yan tümcesinde '{0}' sınıfı kendi kendine başvuramaz.
zh_hans: 类“{0}”不能在 Inherits 子句中引用自己。
zh_hant: 類別 '{0}' 無法在 Inherits 子句中參考自己本身。

# ERR_BaseTypeReferences2
source: Base type of '{0}' needs '{1}' to be resolved.
cs: Základní typ {0} vyžaduje vyřešení {1}.
de: Der Basistyp von "{0}" benötigt "{1}" für die Auflösung.
es: El tipo base de '{0}' necesita que se resuelva '{1}'.
fr: Le type de base de '{0}' a besoin de '{1}' pour être résolu.
it: Per risolvere il tipo di base di '{0}', è necessario '{1}'.
ja: '{0}' の基本型は '{1}' を解決する必要があります。
ko: '{0}'의 형식은 모두 확인하려면 '{1}'이(가) 필요합니다.
pl: Typ podstawowy elementu „{0}” potrzebuje elementu „{1}”, aby mógł zostać rozpoznany.
pt_br: Tipo base de "{0}" precisa que "{1}" seja resolvido.
ru: Базовому типу "{0}" требуется, чтобы "{1}" был разрешен.
tr: '{0}' temel türü için '{1}' çözülmelidir.
zh_hans: “{0}”基类型需要解析“{1}”。
zh_hant: '{0}' 的基底類型需要解析 '{1}'。

# ERR_IllegalBaseTypeReferences3
source: Inherits clause of {0} '{1}' causes cyclic dependency: {2}
cs: Klauzule Inherits {0} – {1} způsobuje cyklickou závislost: {2}.
de: Die Inherits-Klausel von {0} "{1}" verursacht eine zyklische Abhängigkeit: {2}
es: La cláusula Inherits de {0} '{1}' provoca dependencia cíclica: {2}
fr: La clause Inherits de {0} '{1}' provoque une dépendance cyclique : {2}
it: La clausola Inherits di {0} '{1}' causa dipendenza ciclica: {2}
ja: {0} '{1}' の Inherits 句が原因で依存関係が循環しています: {2}
ko: {0} '{1}' 절을 상속하면 종속성이 순환됩니다({2}).
pl: Klauzula Inherits elementu {0} „{1}” powoduje wystąpienie zależności cyklicznej: {2}
pt_br: Herda cláusula de {0} "{1}" causa dependência cíclica: {2}
ru: Наследует предложение {0} "{1}", вызывающее циклическую зависимость: {2}
tr: {0} '{1}' yan tümcesinin devralınması döngüsel bağımlılığa neden oluyor: {2}
zh_hans: {0}“{1}”的继承子句会导致循环依赖: {2}
zh_hant: {0} '{1}' 的 Inherits 子句造成了循環依存性: {2}

# ERR_InvalidMultipleAttributeUsage1
source: Attribute '{0}' cannot be applied multiple times.
cs: Atribut {0} nejde použít několikrát.
de: Das Attribut "{0}" kann nicht mehrmals angewendet werden.
es: El atributo '{0}' no se puede aplicar varias veces.
fr: L'attribut '{0}' ne peut pas être appliqué plusieurs fois.
it: L'attributo '{0}' non può essere applicato più volte.
ja: 属性 '{0}' を複数回適用することはできません。
ko: '{0}' 특성을 여러 번 적용할 수 없습니다.
pl: Nie można wielokrotnie zastosować atrybutu „{0}”.
pt_br: Atributo "{0}" não pode ser aplicado várias vezes.
ru: Атрибут "{0}" не может использоваться несколько раз.
tr: '{0}' özniteliği birden çok kez uygulanamaz.
zh_hans: 属性“{0}”不能应用多次。
zh_hant: 屬性 '{0}' 不可多次套用。

# ERR_InvalidMultipleAttributeUsageInNetModule2
source: Attribute '{0}' in '{1}' cannot be applied multiple times.
cs: Atribut {0} v {1} nejde použít několikrát.
de: Das Attribut "{0}" in "{1}" kann nicht mehrmals angewendet werden.
es: El atributo '{0}' de '{1}' no se puede aplicar varias veces.
fr: L'attribut '{0}' dans '{1}' ne peut pas être appliqué plusieurs fois.
it: L'attributo '{0}' in '{1}' non può essere applicato più volte.
ja: '{1}' 内の属性 '{0}' を複数回適用することはできません。
ko: '{1}'에서 '{0}' 특성을 여러 번 적용할 수 없습니다.
pl: Nie można wielokrotnie zastosować atrybutu „{0}” w elemencie „{1}”.
pt_br: Atributo "{0}" em "{1}" não pode ser aplicado várias vezes.
ru: Атрибут "{0}" в "{1}" не может использоваться несколько раз.
tr: '{1}' içinde '{0}' özniteliği birden çok kez uygulanamaz.
zh_hans: “{1}”中的属性“{0}”不能应用多次。
zh_hant: '{1}' 中的屬性 '{0}' 不可多次套用。

# ERR_CantThrowNonException
source: 'Throw' operand must derive from 'System.Exception'.
cs: 'Operand Throw musí být odvozený od objektu System.Exception.
de: 'Der Throw-Operand muss von "System.Exception" abgeleitet werden.
es: 'El operando 'Throw' debe derivarse de 'System.Exception'.
fr: 'L'opérande 'Throw' doit dériver de 'System.Exception'.
it: 'L'operando 'Throw' deve derivare da 'System.Exception'.
ja: 'Throw' オペランドは、'System.Exception' から派生しなければなりません。
ko: 'Throw' 피연산자는 'System.Exception'에서 파생되어야 합니다.
pl: 'Argument operacji „Throw” musi pochodzić od klasy „System.Exception”.
pt_br: 'Operando de 'Throw' deve derivar de 'System.Exception'.
ru: 'Операнд оператора "Throw" должен быть производным от "System.Exception".
tr: 'Throw' işleneni 'System.Exception' türevi olmalıdır.
zh_hans: '“Throw”操作数必须从“System.Exception”派生。
zh_hant: 'Throw' 運算元必須衍生自 'System.Exception'。

# ERR_MustBeInCatchToRethrow
source: 'Throw' statement cannot omit operand outside a 'Catch' statement or inside a 'Finally' statement.
cs: 'Příkaz Throw nemůže vynechat operand vně příkazu Catch nebo uvnitř příkazu Finally.
de: 'Die Throw-Anweisung kann außerhalb einer Catch-Anweisung oder innerhalb einer Finally-Anweisung den Operanden nicht auslassen.
es: 'La instrucción 'Throw' no puede omitir el operando fuera de una instrucción 'Catch' ni dentro de una instrucción 'Finally'.
fr: 'L'instruction 'Throw' ne peut pas omettre l'opérande en dehors d'une instruction 'Catch' ou dans une instruction 'Finally'.
it: 'L'istruzione 'Throw' non può omettere l'operando all'esterno di un'istruzione 'Catch' o all'interno di un'istruzione 'Finally'.
ja: 'Catch' ステートメントの外部または 'Finally' ステートメントの内部では、'Throw' ステートメントのオペランドを省略することはできません。
ko: 'Throw' 문은 'Catch' 문 외부 또는 'Finally' 문 내부에서 피연산자를 생략할 수 없습니다.
pl: 'Instrukcja „Throw” nie może pomijać argumentu operacji poza instrukcją „Catch” lub wewnątrz instrukcji „Finally”.
pt_br: 'Instrução 'Throw' não pode omitir operando fora de uma instrução 'Catch' ou dentro de uma instrução 'Finally'.
ru: 'В операторе "Throw" запрещается пропускать операнд вне оператора "Catch" или в теле оператора "Finally".
tr: 'Throw' deyimi bir 'Catch' deyimi dışındaki veya bir 'Finally' deyimi içindeki işleneni atlayamaz.
zh_hans: '"Throw" 语句在 "Catch" 语句外或 "Finally" 语句内不能省略操作数。
zh_hant: 'Throw' 陳述式不可以在 'Catch' 陳述式外或 'Finally' 陳述式內省略運算元。

# ERR_ParamArrayMustBeByVal
source: ParamArray parameters must be declared 'ByVal'.
cs: Pro parametry ParamArray musí být použitá deklarace ByVal.
de: ParamArray-Parameter müssen als ByVal deklariert werden.
es: Los parámetros ParamArray se deben declarar como 'ByVal'.
fr: Les paramètres ParamArray doivent être déclarés 'ByVal'.
it: I parametri ParamArray devono essere dichiarati come 'ByVal'.
ja: ParamArray パラメーターは、'ByVal' として宣言しなければなりません。
ko: ParamArray 매개 변수는 'ByVal'로 선언해야 합니다.
pl: Parametry ParamArray muszą być zadeklarowane jako ByVal.
pt_br: Parâmetros ParamArray devem ser declarados 'ByVal'.
ru: Параметры типа ParamArray должны объявляться как "ByVal".
tr: ParamArray parametreleri 'ByVal' olarak bildirilmelidir.
zh_hans: ParamArray 参数必须声明为 "ByVal"。
zh_hant: ParamArray 參數必須宣告為 'ByVal'。

# ERR_UseOfObsoleteSymbol2
source: '{0}' is obsolete: '{1}'.
cs: 'Prvek {0} je zastaralý: {1}.
de: '"{0}" ist veraltet: "{1}".
es: '{0}' está obsoleto: '{1}'.
fr: '{0}' est obsolète : '{1}'.
it: '{0}' è obsoleto: '{1}'.
ja: '{0}' は廃止されています: '{1}'。
ko: '{0}'은(는) 사용되지 않습니다('{1}').
pl: 'Element „{0}” jest przestarzały: „{1}”.
pt_br: "{0}" está obsoleto: "{1}".
ru: "{0}" является устаревшим: "{1}".
tr: '{0}' artık kullanılmıyor: '{1}'.
zh_hans: '“{0}”已过时:“{1}”。
zh_hant: '{0}' 已經過時: '{1}'。

# ERR_RedimNoSizes
source: 'ReDim' statements require a parenthesized list of the new bounds of each dimension of the array.
cs: 'Příkazy ReDim vyžadují seznam nových mezí jednotlivých rozměrů pole uvedený v závorkách.
de: 'ReDim-Anweisungen erfordern eine in Klammern gesetzte Liste der neuen Grenzen jeder Arraydimension.
es: 'Las instrucciones 'ReDim' requieren una lista entre paréntesis de los nuevos límites de cada una de las dimensiones de la matriz.
fr: 'Les instructions 'ReDim' requièrent une liste entre parenthèses des nouvelles limites de chaque dimension du tableau.
it: 'Le istruzioni 'ReDim' richiedono un elenco tra parentesi dei nuovi limiti di ciascuna dimensione della matrice.
ja: 'ReDim' ステートメントには、配列の各次元の新しい境界の一覧をかっこで囲まれたものが必要です。
ko: 'ReDim' 문에는 배열의 각 차원에 대한 새 범위의 괄호로 묶인 목록이 있어야 합니다.
pl: 'Instrukcja ReDim wymaga ujętej w nawiasy listy nowych granic dla każdego wymiaru tablicy.
pt_br: 'Instruções 'ReDim' requerem uma lista entre parênteses dos novos limites de cada dimensão da matriz.
ru: В операторе "ReDim" требуется задать в круглых скобках список новых границ для каждого измерения массива.
tr: 'ReDim' deyimleri, her bir dizi boyutunun yeni sınırlarının parantez içine alınmış bir listesini gerektirir.
zh_hans: "ReDim" 语句需要一个带圆括号的列表，该列表列出数组每个维度的新界限。
zh_hant: 'ReDim' 陳述式需要每個陣列維度新界限的小括號內清單。

# ERR_InitWithMultipleDeclarators
source: Explicit initialization is not permitted with multiple variables declared with a single type specifier.
cs: Explicitní inicializace není povolená v případě více proměnných deklarovaných pomocí jednoho specifikátoru typu.
de: Explizites Initialisieren mit mehreren Variablen, die mit nur einem Typspezifizierer deklariert wurden, ist nicht zulässig.
es: No se permite la inicialización explícita con varias variables declaradas con un solo especificador de tipo.
fr: Une initialisation explicite n'est pas autorisée avec plusieurs variables déclarées avec un spécificateur de type unique.
it: L'inizializzazione esplicita non è consentita con più variabili dichiarate con un singolo identificatore di tipo.
ja: 単一の型指定子で宣言された複数の変数は、明示的に初期化することはできません。
ko: 단일 형식 지정자로 선언된 여러 개의 변수로는 명시적으로 초기화할 수 없습니다.
pl: Jawne inicjowanie nie jest dozwolone, gdy wiele zmiennych zadeklarowano za pomocą jednego specyfikatora typu.
pt_br: A inicialização explícita não é permitida com várias variáveis declaradas com um único especificador de tipos.
ru: Для нескольких переменных, объявленных с одним спецификатором типа, явная инициализация не разрешена.
tr: Tek bir tür tanımlayıcıyla bildirilmiş birden çok değişkenle açık başlatmaya izin verilmez.
zh_hans: 不允许通过用单个类型说明符声明多个变量来进行显式初始化。
zh_hant: 以單一類型規範來宣告多個變數時不允許明確初始化。

# ERR_InitWithExplicitArraySizes
source: Explicit initialization is not permitted for arrays declared with explicit bounds.
cs: Explicitní inicializace není povolená pro pole deklarovaná s explicitními mezemi.
de: Für Arrays, die mit expliziten Grenzen deklariert sind, ist keine explizite Initialisierung zulässig.
es: No se permite la inicialización explícita para matrices declaradas con límites explícitos.
fr: Une initialisation explicite n'est pas autorisée pour les tableaux déclarés avec des limites explicites.
it: L'inizializzazione esplicita non è consentita per matrici dichiarate con limiti espliciti.
ja: 境界を明示的に指定して宣言された配列は、明示的に初期化することはできません。
ko: 명시적 범위로 선언된 배열은 명시적으로 초기화할 수 없습니다.
pl: Jawne inicjowanie nie jest dozwolone w przypadku tablic zadeklarowanych z jawnymi granicami.
pt_br: A inicialização explícita não é permitida para matrizes declaradas com limites explícitos.
ru: Явная инициализация массивов, объявленных с границами явно, запрещена.
tr: Açık sınırlarla bildirilen dizilerde açık başlatmaya izin verilmez.
zh_hans: 对于用显式界限声明的数组不允许进行显式初始化。
zh_hant: 以明確的界限來宣告陣列時不允許明確初始化。

# ERR_EndSyncLockNoSyncLock
source: 'End SyncLock' must be preceded by a matching 'SyncLock'.
cs: 'Příkazu End SyncLock musí předcházet párový příkaz SyncLock.
de: '"End SyncLock" muss ein entsprechendes "SyncLock" voranstehen.
es: 'End SyncLock' debe ir precedida de la instrucción 'SyncLock' correspondiente.
fr: 'End SyncLock' doit être précédé d'un 'SyncLock' correspondant.
it: 'End SyncLock' deve essere preceduto da un 'SyncLock' corrispondente.
ja: 'End SyncLock' の前には、対応する 'SyncLock' が必要です。
ko: 'End SyncLock'은 짝이 되는 'SyncLock' 뒤에 와야 합니다.
pl: 'Instrukcja End SyncLock musi być poprzedzona odpowiadającą jej instrukcją SyncLock.
pt_br: 'End SyncLock' deve ser precedido por 'SyncLock' correspondente.
ru: 'Оператору "End SyncLock" должен предшествовать соответствующий оператор "SyncLock".
tr: 'End SyncLock' öncesinde eşleşen bir 'SyncLock' olmalıdır.
zh_hans: '“End SyncLock”前面必须是匹配的“SyncLock”。
zh_hant: 'End SyncLock' 之前必須搭配相對應的 'SyncLock'。

# ERR_ExpectedEndSyncLock
source: 'SyncLock' statement must end with a matching 'End SyncLock'.
cs: 'Příkaz SyncLock musí být ukončený párovým příkazem End SyncLock.
de: '"SyncLock" muss mit einem entsprechenden "End SyncLock" abgeschlossen werden.
es: 'La instrucción 'SyncLock' debe terminar con la instrucción 'End SyncLock' correspondiente.
fr: 'L'instruction 'SyncLock' doit se terminer par un 'End SyncLock' correspondant.
it: 'L'istruzione 'SyncLock' deve terminare con un elemento 'End SyncLock' corrispondente.
ja: 'SyncLock' ステートメントの終わりには、対応する 'End SyncLock' が必要です。
ko: 'SyncLock' 문은 짝이 되는 'End SyncLock'으로 끝나야 합니다.
pl: 'Instrukcja SyncLock musi być zakończona odpowiadającą jej instrukcją End SyncLock.
pt_br: 'A instrução 'SyncLock' deve terminar com um 'End SyncLock' correspondente.
ru: 'Оператор "SyncLock" должен заканчиваться соответствующим оператором "End SyncLock".
tr: 'SyncLock' deyimi eşleşen bir 'End SyncLock' ile bitmelidir.
zh_hans: '“SyncLock”语句必须以匹配的“End SyncLock”结束。
zh_hant: 'SyncLock' 之後必須搭配相對應的 'End SyncLock'。

# ERR_NameNotEvent2
source: '{0}' is not an event of '{1}'.
cs: '{0} není událost v {1}.
de: '"{0}" ist kein Ereignis von "{1}".
es: '{0}' no es un evento de '{1}'.
fr: '{0}' n'est pas un événement de '{1}'.
it: '{0}' non è un evento di '{1}'.
ja: '{0}' は '{1}' のイベントではありません。
ko: '{0}'은(는) '{1}'의 이벤트가 아닙니다.
pl: 'Element „{0}” nie jest zdarzeniem elementu „{1}”.
pt_br: "{0}" não é um evento de "{1}".
ru: "{0}" не является событием "{1}".
tr: '{0}', bir '{1}' olayı değil.
zh_hans: '“{0}”不是“{1}”的事件。
zh_hant: '{0}' 不是 '{1}' 的事件。

# ERR_AddOrRemoveHandlerEvent
source: 'AddHandler' or 'RemoveHandler' statement event operand must be a dot-qualified expression or a simple name.
cs: 'Operandem události příkazu AddHandler nebo RemoveHandler musí být výraz s operátorem tečka nebo jednoduchý název.
de: 'Der AddHandler- oder RemoveHandler-Anweisungsereignisoperand muss ein punktqualifizierter Ausdruck oder ein einfacher Name sein.
es: 'El operando de eventos de la instrucción 'AddHandler' o 'RemoveHandler' debe ser una expresión calificada por puntos o un nombre simple.
fr: 'L'opérande d'événement d'instruction 'AddHandler' ou 'RemoveHandler' doit être une expression qualifiée par un point ou un nom simple.
it: 'L'operando di evento dell'istruzione 'AddHandler' o 'RemoveHandler' deve essere un'espressione completa di punto o un nome semplice.
ja: 'AddHandler' または 'RemoveHandler' ステートメントのイベント オペランドは、ドットで限定された式または簡易名でなければなりません。
ko: 'AddHandler' 또는 'RemoveHandler' 문의 이벤트 피연산자는 점으로 한정된 식이거나 단순한 이름이어야 합니다.
pl: 'Argument operacji zdarzenia dla instrukcji „AddHandler” lub „RemoveHandler” musi być wyrażeniem kwalifikowanym kropką lub nazwą prostą.
pt_br: 'O operando de evento de instrução 'AddHandler' ou 'RemoveHandler' deve ser uma expressão qualificada por ponto ou um nome simples.
ru: 'Операндом события оператора "AddHandler" или "RemoveHandler" должно быть выражение с точкой или простое имя.
tr: 'AddHandler' veya 'RemoveHandler' deyiminin olay işleneni, nokta nitelemeli ifade veya basit ad olmalıdır.
zh_hans: '“AddHandler”或“RemoveHandler”语句事件操作数必须是以点限定的表达式或者是简单的名称。
zh_hant: 'AddHandler' 或 'RemoveHandler' 陳述式事件運算元必須是點限定運算式 (Dot-qualified Expression) 或是簡單名稱。

# ERR_UnrecognizedEnd
source: 'End' statement not valid.
cs: 'Příkaz End není platný.
de: 'Die End-Anweisung ist ungültig.
es: 'Instrucción 'End' no válida.
fr: 'Instruction 'End' non valide.
it: 'L'istruzione 'End' non è valida.
ja: 'End' ステートメントが有効ではありません。
ko: 'End' 문이 잘못되었습니다.
pl: 'Instrukcja End jest nieprawidłowa.
pt_br: 'Instrução 'End' não válida.
ru: 'Недопустимый оператор "End".
tr: 'End' deyimi geçerli değil.
zh_hans: '"End" 语句无效。
zh_hant: 'End' 陳述式無效。

# ERR_EndRegionNoRegion
source: '#End Region' must be preceded by a matching '#Region'.
cs: 'Příkazu #End Region musí předcházet párový příkaz #Region.
de: '"#End Region" muss ein entsprechendes "#Region" voranstehen.
es: '#End Region' debe ir precedida de la instrucción '#Region' correspondiente.
fr: '#End Region' doit être précédé d'un '#Region' correspondant.
it: '#End Region' deve essere preceduto da un '#Region' corrispondente.
ja: '#End Region' の前には、対応する '#Region' を指定しなければなりません。
ko: '#End Region'은 짝이 되는 '#Region' 뒤에 와야 합니다.
pl: 'Instrukcja #End Region musi być poprzedzona odpowiadającą jej instrukcją #Region.
pt_br: '#End Region' deve ser precedido por '#Region' correspondente.
ru: 'Оператору "#End Region" должен предшествовать соответствующий оператор "#Region".
tr: '#End Region' öncesinde eşleşen bir '#Region' olmalıdır.
zh_hans: '"#End Region" 前面必须是匹配的 "#Region"。
zh_hant: '#End Region' 之前必須搭配相對應的 '#Region'。
