Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NestedGlobalNamespace
source: Global namespace may not be nested in another namespace.
cs: Globální obor názvů nemůže být vnořený do jiného oboru názvů.
de: Der globale Namespace darf nicht in einem anderen Namespace geschachtelt sein.
es: El espacio de nombres global no se puede anidar en otro espacio de nombres.
fr: Un espace de noms global ne peut pas être imbriqué dans un autre espace de noms.
it: Gli spazi dei nomi globali non possono essere annidati in altri spazi dei nomi.
ja: グローバル名前空間を別の名前空間に入れ子にすることはできません。
ko: 전역 네임스페이스는 다른 네임스페이스에 중첩할 수 없습니다.
pl: Globalna przestrzeń nazw nie może być zagnieżdżona w innej przestrzeni nazw.
pt_br: O namespace global não pode ser aninhado em outro namespace.
ru: Глобальные пространства имен нельзя вкладывать в другие пространства имен.
tr: Genel ad uzayı başka bir ad uzayının içinde iç içe olamaz.
zh_hans: 全局命名空间不能嵌套在另一个命名空间中。
zh_hant: 全域命名空間不能以巢狀方式放在另一個命名空間中。

# ERR_AccessMismatch6
source: '{0}' cannot expose type '{1}' in {2} '{3}' through {4} '{5}'.
cs: '{0} nemůže vystavovat typ {1} v {2} - {3} prostřednictvím {4} - {5}.
de: '"{0}" kann Typ "{1}" in {2} "{3}" nicht durch {4} "{5}" verfügbar machen.
es: '{0}' no se puede exponer el tipo '{1}' en {2} '{3}' a través de {4} '{5}'.
fr: '{0}' ne peut pas exposer le type '{1}' dans {2} '{3}' via {4} '{5}'.
it: '{0}' non può esporre il tipo '{1}' in {2} '{3}' mediante {4} '{5}'.
ja: '{0}' は、{4} '{5}' 経由で型 '{1}' を {2} '{3}' で公開することはできません。
ko: '{0}'은(는) {4} '{5}'을(를) 통해 {2} '{3}'의 '{1}' 형식을 노출할 수 없습니다.
pl: 'Element „{0}” nie może ujawnić typu „{1}” w zakresie od {2} „{3}” do {4} „{5}”.
pt_br: "{0}" não pode expor o tipo "{1}" em {2} "{3}" através de {4} "{5}".
ru: "{0}" не может представлять тип "{1}" в {2} "{3}" посредством {4} "{5}".
tr: '{0}', '{1}' türünü {4} '{5}' aracılığıyla {2} '{3}' içinde gösteremez.
zh_hans: '“{0}”不能通过 {4}“{5}”在 {2}“{3}”中公开类型“{1}”。
zh_hant: '{0}' 無法經由 {4} '{5}'，在 {2} '{3}' 中公開類型 '{1}'。

# ERR_BadMetaDataReference1
source: '{0}' cannot be referenced because it is not a valid assembly.
cs: 'Na {0} nejde vytvořit odkaz, protože se nejedná o sestavení.
de: 'Auf "{0}" kann nicht verwiesen werden, da es keine gültige Assembly ist.
es: 'No se puede hacer referencia a '{0}' porque no es un ensamblado válido.
fr: 'Impossible de référencer '{0}', car il ne s'agit pas d'un assembly valide.
it: 'Non è possibile fare riferimento a '{0}' perché non è un assembly valido.
ja: '{0}' は有効なアセンブリでないため参照できません。
ko: '{0}'은(는) 유효한 어셈블리가 아니므로 참조할 수 없습니다.
pl: 'Nie można odwołać się do elementu „{0}”, ponieważ nie jest to poprawny zestaw.
pt_br: "{0}" não pode ser referenciado porque não é um assembly válido.
ru: '"Задание ссылок на "{0}" не предусмотрено, поскольку это недопустимая сборка.
tr: '{0}' geçerli bir derleme olmadığından, buna başvuruda bulunulamaz.
zh_hans: '“{0}”不是有效程序集，因此无法引用它。
zh_hant: '無法參考 '{0}'，因為它不是有效的組件。

# ERR_PropertyDoesntImplementAllAccessors
source: '{0}' cannot be implemented by a {1} property.
cs: '{0} nejde implementovat vlastností {1}.
de: '"{0}" kann nicht von einer {1}-Eigenschaft implementiert werden.
es: 'Una propiedad {1} no puede implementar '{0}'.
fr: '{0}' ne peut pas être implémenté par une propriété {1}.
it: '{0}' non può essere implementato da una proprietà di {1}.
ja: '{0}' は {1} プロパティにより実装できません。
ko: '{1} 속성에서 '{0}'을(를) 구현할 수 없습니다.
pl: 'Elementy „{0}” nie mogą zostać zaimplementowane przez właściwość {1}.
pt_br: "{0}" não pode ser implementado por uma {1} propriedade.
ru: "{0}" невозможно реализовать с помощью свойства {1}.
tr: '{0}', {1} özelliği tarafından uygulanamıyor.
zh_hans: '“{0}”无法由 {1} 属性实现。
zh_hant: '{1} 屬性無法實作 '{0}'。

# ERR_IfTooManyTypesObjectDisallowed
source: Cannot infer a common type because more than one type is possible.
cs: Nedá se odvodit společný typ, protože je možný víc než jeden typ.
de: Ein gemeinsamer Typ kann nicht abgeleitet werden, da mehrere Typen möglich sind.
es: No se puede inferir un tipo común porque es posible más de un tipo.
fr: Impossible de déduire un type commun, car plusieurs types sont possibles.
it: Non è possibile dedurre un tipo comune perché sono possibili più tipi.
ja: 複数の型が考えられるため、共通型を推論できません。
ko: 두 개 이상의 형식이 가능하므로 공용 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować wspólnego typu, ponieważ jest możliwy więcej niż jeden typ.
pt_br: Não é possível deduzir um tipo comum porque mais de um tipo é possível.
ru: Не удается получить общий тип, так как возможно больше одного типа.
tr: Birden fazla tür olasılığı olduğu için ortak bir tür çıkarsanamaz.
zh_hans: 无法推断通用类型，因为可能存在多个类型。
zh_hant: 無法推斷一般類型，因為可能的類型不止一種。

# WRN_IfTooManyTypesObjectAssumed
source: Cannot infer a common type because more than one type is possible; 'Object' assumed.
cs: Společný typ nejde odvodit, protože je přípustný více než jeden typ; předpokládá se typ Object.
de: Es kann kein gemeinsamer Typ abgeleitet werden, weil mehrere Typen möglich sind. "Object" wird angenommen.
es: No se puede inferir un tipo común porque es posible más de un tipo; se supone 'Object'.
fr: Impossible de déduire un type commun, car plusieurs types sont possibles. Type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo comune perché sono possibili più tipi. Verrà usato 'Object'.
ja: 複数の型が考えられるため、共通型を推論できません。'Object' と見なされます。
ko: 두 개 이상의 형식이 가능하므로 공용 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować wspólnego typu, ponieważ jest możliwy więcej niż jeden typ; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo comum porque mais de um tipo é possível; 'Object' presumido.
ru: Не удается получить общий тип, так как возможно больше одного типа: предполагается "Object".
tr: Birden fazla tür olasılığı olduğu için ortak bir tür çıkarsanamıyor: 'Object' varsayıldı.
zh_hans: 无法推断通用类型，因为可能存在多个类型；假定为 "Object"。
zh_hant: 無法推斷一般類型，因為可能的類型不止一種; 假設是 'Object'。

# WRN_IfTooManyTypesObjectAssumed_Title
source: Cannot infer a common type because more than one type is possible
cs: Nedá se odvodit společný typ, protože je možný víc než jeden typ.
de: Ein gemeinsamer Typ kann nicht abgeleitet werden, da mehrere Typen möglich sind.
es: No se puede inferir un tipo común porque es posible más de un tipo
fr: Impossible de déduire un type commun, car plusieurs types sont possibles
it: Non è possibile dedurre un tipo comune perché sono possibili più tipi
ja: 複数の型が考えられるため、共通型を推論できません
ko: 두 개 이상의 형식이 가능하므로 공용 형식을 유추할 수 없음
pl: Nie można wywnioskować wspólnego typu, ponieważ jest możliwy więcej niż jeden typ
pt_br: Não é possível deduzir um tipo comum porque mais de um tipo é possível
ru: Не удается получить общий тип, так как возможно больше одного типа
tr: Birden fazla tür mümkün olduğundan ortak tür çıkarsanamıyor
zh_hans: 无法推断通用类型，原因是可能存在多个类型
zh_hant: 無法推斷一般類型，因為可能的類型不止一種

# ERR_IfNoTypeObjectDisallowed
source: Cannot infer a common type, and Option Strict On does not allow 'Object' to be assumed.
cs: Společný typ nejde odvodit a direktiva Option Strict On nepovoluje předpokládání typu Object.
de: Ein gemeinsamer Typ kann nicht abgeleitet werden, und "Option Strict On" lässt die Annahme des Object-Typs nicht zu.
es: No se puede inferir un tipo común y Option Strict On no permite suponer 'Object'.
fr: Impossible de déduire un type commun, et Option Strict On n'autorise pas l'utilisation par défaut de 'Object'.
it: Non è possibile dedurre un tipo comune e Option Strict On non consente di usare 'Object'.
ja: 共通型を推論できません。Option Strict On が設定されているため、'Object' と見なすことはできません。
ko: 공용 형식을 유추할 수 없으며 Option Strict On에서 'Object'를 간주할 수 없습니다.
pl: Nie można wywnioskować wspólnego typu, a ustawienie Option Strict On nie pozwala przyjąć obiektu „Object”.
pt_br: Não é possível deduzir um tipo comum, e Option Strict On não permite assumir 'Object'.
ru: Не удается получить общий тип, так как параметр Strict On не разрешает предположение "Object".
tr: Ortak bir tür çıkarılamaz ve Option Strict On, 'Object' varsayımına izin vermez.
zh_hans: 无法推断通用类型，且 Option Strict On 不允许假定“Object”。
zh_hant: 無法推斷一般類型，而 Option Strict 為 On 不允許假設為 'Object'。

# WRN_IfNoTypeObjectAssumed
source: Cannot infer a common type; 'Object' assumed.
cs: Společný typ nejde odvodit; předpokládá se typ Object.
de: Es kann kein gemeinsamer Typ abgeleitet werden. "Object" wird angenommen.
es: No se puede inferir un tipo común; se supone 'Object'.
fr: Impossible de déduire un type commun ; type 'Object' pris par défaut.
it: Non è possibile dedurre un tipo comune. Verrà usato 'Object'.
ja: 共通型を推論できません。'Object' と見なされます。
ko: 공용 형식을 유추할 수 없습니다. 'Object'로 간주합니다.
pl: Nie można wywnioskować wspólnego typu; przyjęto „Object”.
pt_br: Não é possível deduzir um tipo comum; 'Object' presumido.
ru: Не удается определить общий тип; предполагаемый тип — "Object".
tr: Ortak bir tür çıkarsanamıyor; 'Object' varsayıldı.
zh_hans: 无法推断通用类型；假定为“Object”。
zh_hant: 無法推斷一般類型; 已假設是 'Object'。

# WRN_IfNoTypeObjectAssumed_Title
source: Cannot infer a common type
cs: Společný typ nejde odvodit.
de: Ein gemeinsamer Typ kann nicht abgeleitet werden.
es: No se puede inferir un tipo común
fr: Impossible de déduire un type commun
it: Non è possibile dedurre un tipo comune
ja: 共通型を推論できません
ko: 공용 형식을 유추할 수 없음
pl: Nie można wywnioskować wspólnego typu
pt_br: Não é possível deduzir um tipo comum
ru: Невозможно получить общий тип
tr: Ortak tür çıkarsanamıyor
zh_hans: 无法推断通用类型
zh_hant: 無法推斷一般類型

# ERR_IfNoType
source: Cannot infer a common type.
cs: Společný typ nejde odvodit.
de: Ein gemeinsamer Typ kann nicht abgeleitet werden.
es: No se puede inferir un tipo común.
fr: Impossible de déduire un type commun.
it: Non è possibile dedurre un tipo comune.
ja: 共通型を推論できません。
ko: 공용 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować wspólnego typu.
pt_br: Não é possível deduzir um tipo comum.
ru: Не удалось определить общий тип.
tr: Ortak bir tür çıkarsanamaz.
zh_hans: 无法推断通用类型。
zh_hant: 無法推斷一般類型。

# ERR_PublicKeyFileFailure
source: Error extracting public key from file '{0}': {1}
cs: Chyba při extrakci veřejného klíče ze souboru {0}: {1}
de: Fehler beim Extrahieren von öffentlichem Schlüssel aus Datei "{0}": {1}
es: Error al extraer la clave pública del archivo '{0}': {1}
fr: Erreur d'extraction de la clé publique du fichier '{0}' : {1}
it: Si è verificato un errore durante l'estrazione della chiave pubblica del file '{0}': {1}
ja: ファイル '{0}' から公開キーを抽出しようとしてエラーが発生しました: {1}
ko: '{0}' 파일에서 공용 키를 추출하는 동안 오류가 발생했습니다({1}).
pl: Błąd podczas wyodrębniania klucza publicznego z pliku „{0}”: {1}
pt_br: Erro ao extrair a chave pública do arquivo "{0}": {1}
ru: Ошибка извлечения открытого ключа из файла "{0}": {1}
tr: '{0}' dosyasından ortak anahtar ayıklanırken hata oluştu: {1}
zh_hans: 从文件“{0}”中提取公钥时出错: {1}
zh_hant: 從檔案 '{0}' 擷取公開金鑰時發生錯誤: {1}

# ERR_PublicKeyContainerFailure
source: Error extracting public key from container '{0}': {1}
cs: Chyba při extrakci veřejného klíče z kontejneru {0}: {1}
de: Fehler beim Extrahieren von öffentlichem Schlüssel aus Container "{0}": {1}
es: Error al extraer la clave pública del contenedor '{0}': {1}
fr: Erreur d'extraction de la clé publique du conteneur '{0}' : {1}
it: Si è verificato un errore durante l'estrazione della chiave pubblica del contenitore '{0}': {1}
ja: コンテナー '{0}' から公開キーを抽出しているときにエラーが発生しました: {1}
ko: '{0}' 컨테이너에서 공용 키를 추출하는 동안 오류가 발생했습니다({1}).
pl: Błąd podczas wyodrębniania klucza publicznego z kontenera „{0}”: {1}
pt_br: Erro ao extrair a chave pública do contêiner "{0}": {1}
ru: Ошибка извлечения открытого ключа из контейнера "{0}": {1}
tr: '{0}' kapsayıcısından ortak anahtar ayıklanırken hata oluştu: {1}
zh_hans: 从容器“{0}”中提取公钥时出错: {1}
zh_hant: 從容器 '{0}' 擷取公開金鑰時發生錯誤: {1}

# ERR_FriendRefNotEqualToThis
source: Friend access was granted by '{0}', but the public key of the output assembly does not match that specified by the attribute in the granting assembly.
cs: Sestavení {0} udělilo přístup typu Friend, ale veřejný klíč výstupního sestavení neodpovídá klíči určenému atributem v udělujícím sestavení.
de: Von "{0}" wurde friend-Zugriff gewährt, aber der öffentliche Schlüssel der Ausgabeassembly stimmt nicht mit dem überein, der vom Attribut in der gewährenden Assembly angegeben wird.
es: '{0}' ha concedido acceso de confianza, pero la clave pública del ensamblado de salida no coincide con la especificada por el atributo en el ensamblado de concesión.
fr: Un accès Friend a été concédé par '{0}', mais la clé publique de l'assembly de sortie ne correspond pas à celle spécifiée par l'attribut concédant.
it: L'accesso a Friend è stato concesso da '{0}', ma la chiave pubblica dell'assembly di output non corrisponde a quella specificata dall'attributo nell'assembly che ha concesso l'accesso.
ja: フレンド アクセスのアクセス権は '{0}' によって付与されますが、出力アセンブリの公開キーは、付与するアセンブリで属性によって指定される公開キーと一致しません。
ko: '{0}'에서 friend 액세스 권한을 부여했지만, 출력 어셈블리의 공용 키가 부여한 어셈블리의 특성에서 지정된 키와 일치하지 않습니다.
pl: Dostęp do przyjaznego zestawu został udzielony przez „{0}”, ale klucz publiczny zestawu wyjściowego nie jest zgodny z kluczem określonym przez atrybut w zestawie udzielającym dostępu.
pt_br: O acesso Friend foi concedido por "{0}", mas a chave pública do assembly de saída não corresponde àquela especificada pelo atributo no assembly de concessão.
ru: Дружественный доступ предоставлен "{0}", однако открытый ключ выходной сборки не соответствует ключу, определенному атрибутом предоставляющей сборки.
tr: '{0}' öğesine friend erişimi izni verildi, ancak çıkış derlemesinin ortak anahtarı, izin veren derlemedeki öznitelik tarafından belirtilenle eşleşmiyor.
zh_hans: 友元访问权限由“{0}”授予，但是输出程序集的公钥与授予程序集中特性指定的公钥不匹配。
zh_hant: '{0}' 已授與 Friend 存取權限，但輸出組件的公開金鑰不符合授與之組件中屬性所指定的公開金鑰。

# ERR_FriendRefSigningMismatch
source: Friend access was granted by '{0}', but the strong name signing state of the output assembly does not match that of the granting assembly.
cs: Sestavení {0} udělilo přístup typu Friend, ale stav podepsání silného názvu u výstupního sestavení neodpovídá stavu udělujícího sestavení.
de: Von "{0}" wurde friend-Zugriff gewährt, aber der starke Name zum Signieren der Ausgabeassembly stimmt nicht mit dem der gewährenden Assembly überein.
es: '{0}' ha concedido acceso de confianza, pero el nombre seguro que firma el estado del ensamblado de salida no coincide con el del ensamblado de concesión.
fr: Un accès Friend a été concédé par '{0}', mais l'état de signature avec nom fort de l'assembly de sortie ne correspond pas à celui de l'assembly concédant.
it: L'accesso a Friend è stato concesso da '{0}', ma lo stato di firma del nome sicuro dell'assembly di output non corrisponde a quello dell'assembly che ha concesso l'accesso.
ja: フレンド アクセスのアクセス権は '{0}' によって付与されますが、出力アセンブリにおける厳密な名前の署名の状態が付与するアセンブリと一致しません。
ko: '{0}'에서 friend 액세스 권한을 부여했지만, 출력 어셈블리의 강력한 이름 서명 상태가 부여한 어셈블리의 상태와 일치하지 않습니다.
pl: Dostęp do przyjaznego zestawu został udzielony przez „{0}”, ale silna nazwa stanu podpisywania zestawu wyjściowego nie jest zgodna z nazwą określoną przez atrybut w zestawie udzielającym dostępu.
pt_br: O acesso Friend foi concedido por "{0}", mas o estado de assinatura de nome forte do assembly de saída não corresponde àquele do assembly de concessão.
ru: Дружественный доступ предоставлен "{0}", однако состояние подписи строгого имени выходной сборки не соответствует состоянию предоставляющей сборки.
tr: '{0}' öğesine friend erişimi izni verildi, ancak çıkış derlemesinin kesin ad imzalama durumu, izin veren derlemeninkiyle eşleşmiyor.
zh_hans: 友元访问权限由“{0}”授予，但是输出程序集的强名称签名状态与授予程序集的强名称签名状态不匹配。
zh_hant: '{0}' 已授與 Friend 存取權限，但輸出組件的強式名稱簽署狀態不符合授與組件的強式名稱簽署狀態。

# ERR_PublicSignNoKey
source: Public sign was specified and requires a public key, but no public key was specified
cs: Je zadaná veřejná značka a vyžaduje veřejný klíč, ale žádný veřejný klíč není zadaný.
de: Die öffentliche Signatur war angegeben. Sie erfordert einen öffentlichen Schlüssel, es wurde aber kein öffentlicher Schlüssel angegeben.
es: Se especificó un signo público y requiere una clave pública, pero no hay ninguna clave pública especificada.
fr: La signature publique a été spécifiée et nécessite une clé publique. Toutefois, aucune clé publique n'a été spécifiée
it: È stata specificata la firma pubblica per la quale è necessaria una chiave pubblica, che però non è stata specificata
ja: 公開署名が指定され、公開キーが必要ですが、公開キーが指定されませんでした
ko: 공개 기호가 지정되었고 공개 키가 필요하지만 공개 키가 지정되지 않았습니다.
pl: Wybrano podpisywanie publiczne, co wymaga klucza publicznego, ale żaden taki klucz nie został określony
pt_br: O sinal de público foi especificado e requer uma chave pública, mas nenhuma chave pública foi especificada
ru: Указана общедоступная подпись, и требуется открытый ключ, но открытый ключ не указан.
tr: Belirtilen ortak imza, ortak anahtar gerektiriyor. Ancak ortak anahtar belirtilmedi.
zh_hans: 已指定公共符号并且它需要一个公钥，但未指定任何公钥
zh_hant: 公用符號已指定並需要公開金鑰，但未指定公開金鑰

# ERR_PublicSignNetModule
source: Public signing is not supported for netmodules.
cs: Veřejné podepisování netmodulů se nepodporuje.
de: Öffentliche Signierung wird für Netmodule nicht unterstützt.
es: No se admite la firma pública para netmodules.
fr: La signature publique n'est pas prise en charge pour les netmodules.
it: La firma pubblica non è supportata per gli elementi netmodule.
ja: netmodule では公開署名はサポートされていません。
ko: netmodule에 대해 공개 서명이 지원되지 않습니다.
pl: Publiczne podpisywanie nie jest obsługiwane w przypadku modułów sieciowych.
pt_br: Não há suporte para autenticação pública dos netmodules.
ru: Общедоступные подписи не поддерживаются для netmodule.
tr: Ortak imzalama, netmodule'ler için desteklenmiyor.
zh_hans: netmodule 不支持公共签名。
zh_hant: 對 netmodule 不支援公開簽署。

# WRN_AttributeIgnoredWhenPublicSigning
source: Attribute '{0}' is ignored when public signing is specified.
cs: Atribut {0} se ignoruje, když je zadané veřejné podepisování.
de: Das Attribut "{0}" wird ignoriert, wenn öffentliche Signierung angegeben wird.
es: El atributo "{0}" se ignora cuando se especifica la firma pública.
fr: L'attribut '{0}' est ignoré quand une signature publique est spécifiée.
it: L'attributo '{0}' viene ignorato quando si specifica la firma pubblica.
ja: 公開署名が指定されると、属性 '{0}' は無視されます。
ko: 공개 서명이 지정된 경우 '{0}' 특성이 무시됩니다.
pl: Atrybut „{0}” jest ignorowany w przypadku określenia podpisywania publicznego.
pt_br: O atributo '{0}' é ignorado quando a autenticação pública é especificada.
ru: Атрибут "{0}" пропускается при указании общедоступного подписывания.
tr: Ortak imzalama belirtildiğinde '{0}' özniteliği yoksayılır.
zh_hans: 指定公共签名时，将忽略特性“{0}”。
zh_hant: 如有指定公用簽章，屬性 '{0}' 將予忽略。

# WRN_AttributeIgnoredWhenPublicSigning_Title
source: Attribute is ignored when public signing is specified.
cs: Atribut se ignoruje, když je zadané veřejné podepisování.
de: Das Attribut wird ignoriert, wenn öffentliche Signierung angegeben wird.
es: El atributo se omite cuando se especifica la firma pública.
fr: L'attribut est ignoré quand une signature publique est spécifiée.
it: L'attributo viene ignorato quando si specifica la firma pubblica.
ja: 公開署名が指定されると、属性は無視されます。
ko: 공개 서명이 지정된 경우 특성이 무시됩니다.
pl: Atrybut jest ignorowany w przypadku określenia podpisywania publicznego.
pt_br: O atributo é ignorado quando a autenticação pública é especificada.
ru: Атрибут пропускается при указании общедоступного подписывания.
tr: Ortak imzalama belirtildiğinde öznitelik yoksayılır.
zh_hans: 指定公共签名时，将忽略特性。
zh_hant: 如有指定公用簽章，屬性將予忽略。

# WRN_DelaySignButNoKey
source: Delay signing was specified and requires a public key, but no public key was specified.
cs: Je určené zpožděné podepsání, které vyžaduje veřejný klíč, ale není zadaný žádný veřejný klíč.
de: Verzögertes Signieren wurde festgelegt und erfordert einen öffentlichen Schlüssel, es wurde jedoch kein öffentlicher Schlüssel angegeben.
es: Se solicitó retrasar la firma y esto requiere una clave pública, pero no se proporcionó ninguna.
fr: La signature différée a été spécifiée et nécessite une clé publique, mais aucune clé publique n’a été spécifiée.
it: È stata specificata la firma ritardata per la quale è necessaria una chiave pubblica che però non è stata specificata.
ja: 遅延署名が指定されたため、公開キーが必要ですが、公開キーが指定されませんでした。
ko: 서명 연기가 지정되어 공개 키가 필요하지만 지정된 공개 키가 없습니다.
pl: Określono podpisywanie opóźnione, które wymaga klucza publicznego. Nie określono jednak żadnego klucza publicznego.
pt_br: A assinatura atrasada foi especificada e requer uma chave pública, mas nenhuma chave pública foi especificada.
ru: Была указана отложенная подпись, для которой требуется открытый ключ. Открытый ключ не был указан.
tr: Gecikmeli imzalama belirtildi ve ortak anahtar gerektiriyor, ancak ortak anahtar belirtilmedi.
zh_hans: 指定了延迟签名，这需要公钥，但是未指定任何公钥。
zh_hant: 已指定延遲簽署，並需要一個公開金鑰，但並未指定任何公開金鑰。

# WRN_DelaySignButNoKey_Title
source: Delay signing was specified and requires a public key, but no public key was specified
cs: Je určené zpožděné podepsání, které vyžaduje veřejný klíč, ale není zadaný žádný veřejný klíč.
de: Verzögertes Signieren wurde angegeben und erfordert einen öffentlichen Schlüssel, es wurde aber kein öffentlicher Schlüssel angegeben.
es: Se especificó un retraso en la firma y esto requiere una clave pública, pero no se ha especificado ninguna
fr: La signature différée a été spécifiée et nécessite une clé publique, mais aucune clé publique n'a été spécifiée
it: È stata specificata la firma ritardata per la quale è necessaria una chiave pubblica che però non è stata specificata
ja: 遅延署名が指定されたため、公開キーが必要ですが、公開キーが指定されませんでした
ko: 서명 연기가 지정되어 공개 키가 필요하지만 지정된 공개 키가 없습니다.
pl: Określono podpisywanie opóźnione wymagające klucza publicznego, ale nie określono klucza publicznego
pt_br: A assinatura atrasada foi especificada e requer uma chave pública, mas nenhuma chave pública foi especificada
ru: Была указана отложенная подпись, для которой требуется открытый ключ, но открытый ключ не был указан
tr: Gecikmeli imzalama belirtildi ve ortak anahtar gerektiriyor, ancak ortak anahtar belirtilmedi
zh_hans: 指定了延迟签名，这需要公钥，但是未指定任何公钥
zh_hant: 指定了延遲簽署且需要公開金鑰，但未指定任何公開金鑰

# ERR_SignButNoPrivateKey
source: Key file '{0}' is missing the private key needed for signing.
cs: V souboru klíče {0} chybí privátní klíč potřebný k podepsání.
de: In der Schlüsseldatei "{0}" fehlt der für die Signierung erforderliche private Schlüssel.
es: Al archivo de clave '{0}' le falta la clave privada necesaria para firmar.
fr: Le fichier de clé '{0}' ne comprend pas la clé privée nécessaire à la signature.
it: Nel file di chiave '{0}' manca la chiave privata necessaria per la firma.
ja: キー ファイル '{0}' には、署名に必要な秘密キーがありません。
ko: '{0}' 키 파일에 서명에 필요한 프라이빗 키가 없습니다.
pl: W pliku klucza „{0}” brak klucza prywatnego wymaganego do podpisu
pt_br: Arquivo de chave "{0}" está sem a chave privada necessária para assinatura.
ru: Файл ключа "{0}" не содержит закрытого ключа, необходимого для подписания.
tr: '{0}' anahtar dosyasında imzalama için gereken özel anahtar eksik.
zh_hans: 密钥文件“{0}”缺少进行签名所需的私钥。
zh_hant: 金鑰檔 '{0}' 遺漏簽署所需的私密金鑰。

# ERR_FailureSigningAssembly
source: Error signing assembly '{0}': {1}
cs: Chyba při podepisování sestavení {0}: {1}
de: Fehler beim Signieren der Assembly "{0}": {1}
es: Error al firmar el ensamblado '{0}': {1}
fr: Erreur lors de la signature de l'assembly '{0}' : {1}
it: Si è verificato un errore durante la firma dell'assembly '{0}': {1}
ja: アセンブリ署名のエラー '{0}': {1}
ko: '{0}' 어셈블리에 서명하는 동안 오류가 발생했습니다({1}).
pl: Wystąpił błąd podczas podpisywania zestawu „{0}”: {1}
pt_br: Erro ao assinar o assembly "{0}": {1}
ru: Ошибка при подписи сборки "{0}": {1}
tr: '{0}' derlemesini imzalama hatası: {1}
zh_hans: 对程序集“{0}”签名时出错: {1}
zh_hant: 簽署組件 '{0}' 時發生錯誤: {1}
