Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_VBCHelp
source: Visual Basic Compiler Options - OUTPUT FILE - -out:<file> Specifies the output file name. -target:exe Create a console application (default). (Short form: -t) -target:winexe Create a Windows application. -target:library Create a library assembly. -target:module Create a module that can be added to an assembly. -target:appcontainerexe Create a Windows application that runs in AppContainer. -target:winmdobj Create a Windows Metadata intermediate file -doc[+|-] Generates XML documentation file. -doc:<file> Generates XML documentation file to <file>. -refout:<file> Reference assembly output to generate - INPUT FILES - -addmodule:<file_list> Reference metadata from the specified modules -link:<file_list> Embed metadata from the specified interop assembly. (Short form: -l) -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications. -reference:<file_list> Reference metadata from the specified assembly. (Short form: -r) -analyzer:<file_list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. - RESOURCES - -linkresource:<resinfo> Links the specified file as an external assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -linkres) -nowin32manifest The default manifest should not be embedded in the manifest section of the output PE. -resource:<resinfo> Adds the specified file as an embedded assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -res) -win32icon:<file> Specifies a Win32 icon file (.ico) for the default Win32 resources. -win32manifest:<file> The provided file is embedded in the manifest section of the output PE. -win32resource:<file> Specifies a Win32 resource file (.res). - CODE GENERATION - -optimize[+|-] Enable optimizations. -removeintchecks[+|-] Remove integer checks. Default off. -debug[+|-] Emit debugging information. -debug:full Emit full debugging information (default). -debug:pdbonly Emit full debugging information. -debug:portable Emit cross-platform debugging information. -debug:embedded Emit cross-platform debugging information into the target .dll or .exe. -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -nowarn Disable all warnings. -nowarn:<number_list> Disable a list of individual warnings. -warnaserror[+|-] Treat all warnings as errors. -warnaserror[+|-]:<number_list> Treat a list of warnings as errors. -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics in SARIF format. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -define:<symbol_list> Declare global conditional compilation symbol(s). symbol_list:name=value,... (Short form: -d) -imports:<import_list> Declare global Imports for namespaces in referenced metadata files. import_list:namespace,... -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `default` (latest major version), or `latest` (latest version, including minor versions), or specific versions like `14` or `15.3` -optionexplicit[+|-] Require explicit declaration of variables. -optioninfer[+|-] Allow type inference of variables. -rootnamespace:<string> Specifies the root Namespace for all type declarations. -optionstrict[+|-] Enforce strict language semantics. -optionstrict:custom Warn when strict language semantics are not respected. -optioncompare:binary Specifies binary-style string comparisons. This is the default. -optioncompare:text Specifies text-style string comparisons. - MISCELLANEOUS - -help Display this usage message. (Short form: -?) -noconfig Do not auto-include VBC.RSP file. -nologo Do not display compiler copyright banner. -quiet Quiet output mode. -verbose Display verbose messages. -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<number> The base address for a library or module (hex). -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<number> Specifies the codepage to use when opening source files. -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key. -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key. -errorreport:<string> Specifies how to handle internal compiler errors; must be prompt, send, none, or queue (default). -generatedfilesout:<dir> Place files generated during compilation in the specified directory. -filealign:<number> Specify the alignment used for output file sections. -highentropyva[+|-] Enable high-entropy ASLR. -keycontainer:<string> Specifies a strong name key container. -keyfile:<file> Specifies a strong name key file. -libpath:<path_list> List of directories to search for metadata references. (Semi-colon delimited.) -main:<class> Specifies the Class or Module that contains Sub Main. It can also be a Class that inherits from System.Windows.Forms.Form. (Short form: -m) -moduleassemblyname:<string> Name of the assembly which this module will be a part of. -netcf Target the .NET Compact Framework. -nostdlib Do not reference standard libraries (system.dll and VBC.RSP file). -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -platform:<string> Limit which platforms this code can run on; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred or anycpu (default). -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -sdkpath:<path> Location of the .NET Framework SDK directory (mscorlib.dll). -subsystemversion:<version> Specify subsystem version of the output PE. version:<number>[.<number>] -utf8output[+|-] Emit compiler output in UTF-8 character encoding. @<file> Insert command-line settings from a text file -vbruntime[+|-|*] Compile with/without the default Visual Basic runtime. -vbruntime:<file> Compile with the alternate Visual Basic runtime in <file>.
ja: Visual Basic コンパイラ オプション - 出力ファイル - -out:<file> 出力ファイル名を指定します。 -target:exe コンソール アプリケーション (既定)を作成します。 (短い形式: -t) -target:winexe Windows アプリケーションを作成します。 -target:library ライブラリ アセンブリを作成します。 -target:module に追加できるモジュールを作成する アセンブリ。 -target:appcontainerexe で実行される Windows アプリケーションを作成する AppContainer。 -target:winmdobj Windows メタデータ中間ファイル の作成 -doc[+|-] XML ドキュメント ファイルを生成します。 -doc:<file> <file> に XML ドキュメント ファイルを生成します。 -refout:<file> アセンブリ出力を参照して を生成します - 入力ファイル - -addmodule:<file_list> 指定されたモジュールからの参照メタデータ -link:<file_list> 指定された相互運用機能からメタデータの埋め込み アセンブリ。(短い形式: -l) -recurse:<wildcard> 現在のディレクトリ内のすべてのファイルを含める と に従ったサブディレクトリ ワイルドカードの指定。 -reference:<file_list> 指定した からの参照メタデータ アセンブリ。(短い形式: -r) -analyzer:<file_list> このアセンブリからアナライザーを実行 (短い形式: -a) -additionalfile:<file list> コード に直接影響しない追加ファイル 生成しますが、アナライザーで を生成するために使用できます エラーまたは警告。 - リソース - -linkresource:<resinfo> 指定したファイルを外部 としてリンクします アセンブリ リソース。 resinfo:<file>[,<name>[,public|private]] (短い形式: -linkres) -nowin32manifest 既定のマニフェストを埋め込むべきではありません 出力 PE のマニフェスト セクションに。 -resource:<resinfo> 指定したファイルを埋め込み として追加します アセンブリ リソース。 resinfo:<file>[,<name>[,public|private]] (短い形式: -res) -win32icon:<file> の Win32 アイコン ファイル (.ico) を指定します 既定の Win32 リソース。 -win32manifest:<file> 指定されたファイルはマニフェスト に埋め込まれています 出力 PE のセクション。 -win32resource:<file> Win32 リソース ファイル (.res) を指定します。 - コード生成 - -optimize[+|-] 最適化を有効にします。 -removeintchecks[+|-] 整数チェックを削除します。既定値はオフです。 -debug[+|-] デバッグ情報を出力します。 -debug:full 完全なデバッグ情報を出力します (既定)。 -debug:pdbonly 完全なデバッグ情報を出力します。 -debug:portable クロスプラットフォーム デバッグ情報を出力します。 -debug:embedded クロスプラットフォーム デバッグ情報を に出力する ターゲット .dll または .exe。 -deterministic 決定論的アセンブリ を生成する (モジュール バージョン GUID とタイムスタンプを含む) -refonly メイン出力 の代わりに参照アセンブリを生成する -instrument:TestCoverage を収集するようにインストルメント化されたアセンブリを生成する カバレッジ情報 -sourcelink:<file> PDB に埋め込むソース リンク情報。 - エラーと警告 - -nowarn すべての警告を無効にします。 -nowarn:<number_list> 個々の警告の一覧を無効にします。 -warnaserror[+|-] すべての警告をエラーとして扱います。 -warnaserror[+|-]: <number_list> 警告の一覧をエラーとして扱います。 -ruleset:<file> 特定の を無効にするルールセット ファイルを指定します 診断。 -errorlog:<file>[,version=<sarif_version>] すべてのコンパイラとアナライザーをログに記録するファイルの指定 SARIF 形式の診断。 sarif_version:{1|2|2.1} 既定値は 1. 2 と 2.1 両方とも SARIF バージョン 2.1.0 を意味します -reportanalyzer レポート などの追加のアナライザー情報 実行時間。 -skipanalyzers[+|-] 診断アナライザーの実行をスキップします。 - 言語 - -define:<symbol_list> グローバル条件付きコンパイルを宣言する シンボル。symbol_list:name=value,... (短い形式: -d) -imports:<import_list> で名前空間のグローバル インポートを宣言する 参照されたメタデータ ファイル。 import_list:namespace,... -langversion:? 言語バージョン で使用できる値を表示する -langversion:<string> などの言語バージョンを指定します 'default' (最新のメジャー バージョン)、または 'latest' (マイナー バージョンを含む最新バージョン) または `14` や `15.3` などの特定のバージョン -optionexplicit[+|-] 変数の明示的な宣言が必要です。 -optioninfer[+|-] 変数の型推論を許可します。 -rootnamespace:<string> すべての型のルート名前空間を指定 宣言。 -optionstrict[+|-] 厳密な言語セマンティクスを適用します。 -optionstrict:custom 厳密な言語セマンティクスが でない場合の警告 尊敬される。 -optioncompare:binary バイナリ スタイルの文字列比較を指定します。 これは既定です。 -optioncompare:text テキスト スタイルの文字列比較を指定します。 - その他 - -help この使用状況メッセージを表示します。(短い形式: -?) -noconfig VBC.RSP ファイルを自動インクルードしないでください。 -nologo コンパイラの著作権バナーを表示しません。 -quiet 非表示出力モード。 -verbose 詳細メッセージを表示します。 -parallel[+|-] 同時ビルド。 -version コンパイラのバージョン番号を表示して終了します。 - 詳細設定 - -baseaddress:<number> ライブラリまたはモジュールのベース アドレス (16 進数)。 -checksumalgorithm:<alg> ソース ファイル を計算するためのアルゴリズムを指定します PDB に格納されているチェックサム。サポートされている値: SHA1 または SHA256 (既定値)。 -codepage:<number> を開くときに使用するコードページを指定します。 ソース ファイル。 -delaysign[+|-] パブリックのみを使用してアセンブリに遅延署名する 厳密な名前キーの部分。 -publicsign[+|-] パブリックのみを使用してアセンブリに公開署名する 厳密な名前キーの部分。 -errorreport:<string> 内部コンパイラを処理する方法を指定します エラー; プロンプト、送信、なし、またはキューである必要があります (既定値)。 -generatedfilesout:<dir> コンパイル中に生成されたファイルを に配置します 指定したディレクトリ。 -filealign:<number> 出力ファイルに使用する配置を指定します セクション。 -highentropyva[+|-] 高エントロピ ASLR を有効にします。 -keycontainer:<string> 厳密な名前のキー コンテナーを指定します。 -keyfile:<file> 厳密な名前のキー ファイルを指定します。 -libpath:<path_list> メタデータを検索するディレクトリの一覧 参照。(セミコロン区切り)。 -main:<class> を含むクラスまたはモジュールを指定します。 サブ メイン。また、 というクラスにすることもできます。 System.Windows.Forms.Form から継承します。 (短い形式: -m) -moduleassemblyname:<string> このモジュールが するアセンブリの名前 の一部です。 -netcf .NET Compact Frameworkをターゲットに設定します。 -nostdlib 標準ライブラリを参照しない (system.dll と VBC.RSP ファイル)。 -pathmap:<K1>=<V1>,<K2>=<V2>,... で出力されるソース パス名のマッピングを指定する コンパイラ。 -platform:<string> このコードを実行できるプラットフォームを制限します; x86, x64, Itanium, arm, arm64 である必要があります AnyCPU32BitPreferred または anycpu (既定値)。 -preferreduilang 優先する出力言語名を指定します。 -nosdkpath 標準ライブラリ アセンブリの既定の SDK パスの検索を無効にします。 -sdkpath:<path> .NET Framework SDK ディレクトリの場所 (mscorlib.dll)。 -subsystemversion:<version> 出力 PE のサブシステム バージョンを指定します。 version:<number>[.<number>] -utf8output[+|-] UTF-8 文字でコンパイラ出力を出力する エンコード。 @<file> テキスト ファイルからコマンド ライン設定を挿入 -vbruntime[+|-|*] 既定の Visual Basic の有無にかかわらずコンパイルする ランタイム。 -vbruntime:<file> 代替 Visual Basic を使用してコンパイルする <file> のランタイム。
pt_br: Opções do compilador do Visual Basic - ARQUIVO DE SAÍDA - -out:<file> Especifica o nome do arquivo de saída. -target:exe Criar um aplicativo de console (padrão). (Forma curta: -t) -target:winexe Criar um aplicativo do Windows. -target:library Criar um assembly de biblioteca. -target:module Cria um módulo que pode ser adicionado a um assembly. -target:appcontainerexe Crie um aplicativo do Windows que seja executado em AppContainer. -target:winmdobj Crie um arquivo intermediário de Metadados do Windows -doc[+|-] Gera arquivo de documentação XML. -doc:<file> Gera arquivo de documentação XML para <file>. -refout:<file> Saída de montagem de referência para gerar - ARQUIVOS DE ENTRADA - -addmodule:<file_list> Metadados de referência dos módulos especificados -link:<file_list> Incorporar metadados da interoperabilidade especificada assembly. (Forma abreviada: -l) -recurse:<wildcard> Incluir todos os arquivos no diretório atual e subdiretórios de acordo com o especificações curinga. -reference:<file_list> Metadados de referência do especificado assembly. (Forma abreviada: -r) -analyzer:<file_list> Execute os analisadores desta montagem (Forma abreviada: -a) -additionalfile:<file list> Arquivos adicionais que não afetam diretamente o código geração, mas pode ser usado por analisadores para produzir erros ou avisos. - RECURSOS - -linkresource:<resinfo> Vincula o arquivo especificado como um arquivo externo recurso de montagem. resinfo:<file>[,<name>[,public|private]] (Forma abreviada: -linkres) -nowin32manifest O manifesto padrão não deve ser incorporado na seção de manifesto do PE de saída. -resource:<resinfo> Adiciona o arquivo especificado como um incorporado recurso de montagem. resinfo:<file>[,<name>[,public|private]] (Forma abreviada: -res) -win32icon:<file> Especifica um arquivo de ícone Win32 (.ico) para o recursos padrão do Win32. -win32manifest:<file> O arquivo fornecido está incorporado no manifesto seção da saída PE. -win32resource:<file> Especifica um arquivo de recurso Win32 (.res). - GERAÇÃO DE CÓDIGO - -optimize[+|-] Habilitar otimizações. -removeintchecks[+|-] Remover verificações de números inteiros. Padrão desativado. -debug[+|-] Emite informações de depuração. -debug:full Emite informações completas de depuração (padrão). -debug:pdbonly Emite informações completas de depuração. -debug:portable Emite informações de depuração entre plataformas. -debug:embedded Emita informações de depuração de plataforma cruzada para o .dll ou .exe de destino. -deterministic Produzir uma montagem determinística (incluindo GUID da versão do módulo e carimbo de data/hora) -refonly Produzir uma montagem de referência no lugar da saída principal -instrument:TestCoverage Produzir uma montagem instrumentada para coletar informações de cobertura -sourcelink:<file> Informações do link de origem para incorporar no PDB. - ERROS E AVISOS - -nowarn Desabilitar todos os avisos. -nowarn:<number_list> Desabilitar uma lista de avisos individuais. -warnaserror[+|-] Trate todos os avisos como erros. -warnaserror[+|-]:<number_list> Tratar uma lista de avisos como erros. -ruleset:<file> Especifique um arquivo de conjunto de regras que desabilita determinados diagnósticos. -errorlog:<file>[,versão=<sarif_version>] Especifique um arquivo para registrar todo o compilador e analisador diagnóstico em formato SARIF. sarif_version:{1|2|2.1} Padrão é 1. 2 e 2.1 ambos significam versão SARIF 2.1.0. -reportanalyzer Relatar informações adicionais do analisador, como tempo de execução. -skipanalyzers[+|-] Ignorar a execução de analisadores de diagnóstico. - IDIOMA - -define:<symbol_list> Declarar compilação condicional global símbolo(s). symbol_list:name=value,... (Forma abreviada: -d) -imports:<import_list> Declarar importações globais para namespaces em arquivos de metadados referenciados. import_list:namespace,... -langversion:? Exibir os valores permitidos para a versão do idioma -langversion:<string> Especifique a versão do idioma, como `default` (última versão principal), ou `latest` (versão mais recente, incluindo versões secundárias), ou versões específicas como `14` or `15.3` -optionexplicit[+|-] Requer declaração explícita de variáveis. -optioninfer[+|-] Permitir inferência de tipo de variáveis. -rootnamespace:<string> Especifica o Namespace raiz para todos os tipos declarações. -optionstrict[+|-] Aplicar semântica de linguagem estrita. -optionstrict:custom Avisar quando a semântica estrita da linguagem não for respeitado. -optioncompare:binary Especifica comparações de cadeia de caracteres de estilo binário. Este é o padrão. -optioncompare:text Especifica comparações de cadeia de estilo de texto. - DIVERSOS - -help Exibir esta mensagem de uso. (Forma abreviada: -?) -noconfig Não inclua automaticamente o arquivo VBC.RSP. -nologo Não exibir banner de direitos autorais do compilador. -quiet Modo de saída silencioso. -verbose Exibir mensagens detalhadas. -parallel[+|-] compilação simultânea. -version Exiba o número da versão do compilador e saia. - AVANÇADO - -baseaddress:<number> O endereço base para uma biblioteca ou módulo (hex). -checksumalgorithm:<alg> Especifique o algoritmo para calcular o arquivo de origem csoma de verificação armazenada no PDB. Os valores suportados são: SHA1 ou SHA256 (padrão). -codepage:<number> Especifica a página de código a ser usada ao abrir arquivos de origem. -delaysign[+|-] Atrasar a assinatura do assembly usando apenas o público parte da chave de nome forte. -publicsign[+|-] Assinar publicamente o assembly usando apenas o público parte da chave de nome forte. -errorreport:<string> Especifica como lidar com o compilador interno erros; deve ser prompt, enviar, nenhum ou fila (padrão). -generatedfilesout:<dir> Coloque os arquivos gerados durante a compilação no diretório especificado. -filealign:<number> Especifique o alinhamento usado para o arquivo de saída Seções. -highentropyva[+|-] Habilite o ASLR de alta entropia. -keycontainer:<string> Especifica um contêiner de chave de nome forte. -keyfile:<file> Especifica um arquivo de chave de nome forte. -libpath:<path_list> Lista de diretórios para pesquisar metadados referências. (Delimitado por ponto e vírgula.) -main:<class> Especifica a Classe ou Módulo que contém Sub Principal. Também pode ser uma Classe que herda de System.Windows.Forms.Form. (Forma abreviada: -m) -moduleassemblyname:<string> Nome do assembly que este módulo irá fazer parte de. -netcf Direcione o .NET Compact Framework. -nostdlib Não faça referência a bibliotecas padrão (arquivo system.dll e VBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Especifique um mapeamento para saída de nomes de caminho de origem por o compilador. -platform:<string> Limite em quais plataformas esse código pode ser executado; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred ou anycpu (padrão). -preferreduilang Especifique o nome do idioma de saída preferido. -nosdkpath Desabilitar a pesquisa do caminho padrão do SDK para conjuntos de bibliotecas padrão. -sdkpath:<path> Local do diretório SDK do .NET Framework (mscorlib.dll). -subsystemversion:<version> Especifique a versão do subsistema do PE de saída. versão:<number>[.<number>] -utf8output[+|-] Emite a saída do compilador no caractere UTF-8 codificação. @<file> Inserir configurações de linha de comando de um arquivo de texto -vbruntime[+|-|*] Compilar com/sem o Visual Basic padrão tempo de execução. -vbruntime:<file> Compilar com o Visual Basic alternativo tempo de execução em <file>.

# WRN_GeneratorFailedDuringGeneration
source: Generator '{0}' failed to generate source. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'
ja: ジェネレーター '{0}' でソースを生成できませんでした。出力には寄与しません。結果として、コンパイル エラーが発生する可能性があります。例外の型: '{1}'。メッセージ: '{2}'
pt_br: O gerador '{0}' não pôde gerar a origem. Ele não contribuirá com a saída e poderão ocorrer erros de compilação como resultado. A exceção foi do tipo '{1}', com a mensagem '{2}'

# WRN_GeneratorFailedDuringGeneration_Description
source: Generator threw the following exception: '{0}'.
ja: ジェネレーターで次の例外がスローされました: '{0}'。
pt_br: O gerador gerou a seguinte exceção: '{0}'.

# WRN_GeneratorFailedDuringInitialization
source: Generator '{0}' failed to initialize. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'
ja: ジェネレーター '{0}' を初期化できませんでした。出力には寄与しません。結果として、コンパイル エラーが発生する可能性があります。例外の型: '{1}'。メッセージ: '{2}'
pt_br: Falha na inicialização do gerador '{0}'. Ele não contribuirá com a saída e poderão ocorrer erros de compilação como resultado. A exceção foi do tipo '{1}', com a mensagem '{2}'

# WRN_GeneratorFailedDuringInitialization_Description
source: Generator threw the following exception: '{0}'.
ja: ジェネレーターで次の例外がスローされました: '{0}'。
pt_br: O gerador gerou a seguinte exceção: '{0}'.
