Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_AsyncLacksAwaits_Title
source: This async method lacks 'Await' operators and so will run synchronously
cs: V této asynchronní metodě chybí operátory Await, takže poběží synchronně.
de: In dieser asynchronen Methode fehlten die "Await"-Operatoren, sie wird daher synchron ausgeführt.
es: Este método asincrónico no tiene los operadores 'Await' por lo que se ejecutará de forma sincrónica
fr: Cette méthode asynchrone n’a pas d’opérateurs 'Await' et sera exécutée de manière synchrone
it: Questo metodo asincrono non contiene operatori 'Await', pertanto verrà eseguito in modo sincrono
ja: この非同期メソッドには 'Await' 演算子がないため、同期的に実行されます
ko: 이 비동기 메서드에는 'Await' 연산자가 없으며 메서드가 동시에 실행됨
pl: W tej metodzie asynchronicznej brakuje operatorów „Await” — zostanie ona uruchomiona synchronicznie
pt_br: Este método assíncrono não tem operadores 'Await' e, portanto, será executado de forma síncrona
ru: В асинхронном методе отсутствуют операторы Await; будет выполнен синхронный запуск
tr: Bu zaman uyumsuz metotta 'Await' işleçleri olmadığından, zaman uyumlu çalışacak
zh_hans: 此异步方法缺少 "Await" 运算符，因此将以同步方式运行
zh_hant: 這個 async 方法缺少 'Await' 運算子，因此將以同步方式執行

# WRN_UnobservedAwaitableDelegate
source: The Task returned from this Async Function will be dropped, and any exceptions in it ignored. Consider changing it to an Async Sub so its exceptions are propagated.
cs: Úkol vrácený touto asynchronní funkcí se zahodí a jakékoli výjimky v něm se budou ignorovat. Zvažte změnu této metody na asynchronní proceduru, aby se výjimky rozšířily.
de: Die von dieser Async-Funktion zurückgegebene Aufgabe wird verworfen, und alle darin enthaltenen Ausnahmen werden ignoriert. Ändern Sie diese ggf. in eine Async-Unterfunktion, damit ihre Ausnahmen weitergegeben werden.
es: La tarea devuelta por esta función asincrónica se anulará y se omitirán todas sus excepciones. Puede cambiarla a una Sub asincrónica para que se propaguen sus excepciones.
fr: La tâche retournée à partir de cette fonction asynchrone sera supprimée et toutes les exceptions qu'elle contient seront ignorées. Envisagez de la transformer en une procédure Sub asynchrone afin que ses exceptions soient propagées.
it: L'attività restituita dalla funzione Async verrà eliminata e le relative eccezioni verranno ignorate. Provare a modificarla in un sub Async per propagare le eccezioni.
ja: この Async Function から返されたタスクは削除され、例外は無視されます。例外が伝播されるように、Async Sub への変更を検討してください。
ko: 이 비동기 함수에서 반환된 Task가 삭제되고 작업의 예외가 무시됩니다. 예외가 전파되도록 비동기 Sub로 변경해 보세요.
pl: Zadanie zwrócone z tej funkcji asynchronicznej zostanie porzucone i wszelkie zawarte w nim wyjątki zostaną zignorowane. Rozważ zmianę tej funkcji na procedurę asynchroniczną, tak aby jej wyjątki były propagowane.
pt_br: A Tarefa retornada desta Async Function será removida, e quaisquer exceções nela serão ignoradas. Considere alterá-la para uma Async Sub para que suas exceções sejam propagadas.
ru: Задача, возвращенная этой функцией Async, будет удалена, а все исключения будут игнорироваться. Попробуйте изменить ее на подпрограмму Async, чтобы исключения распространялись.
tr: Bu Zaman Uyumsuz İşlevden döndürülen Görev atılacak ve içindeki özel durumlar yoksayılacak. Özel durumlarının yayılması için bunu Zaman Uyumsuz Alt Yordamına dönüştürebilirsiniz.
zh_hans: 从此 Async Function 返回的任务将被删除，并且忽略其中的任何异常。考虑将其更改为 Async Sub，以便传播其异常。
zh_hant: 將刪除從這個 Async 函式傳回的 Task，並且忽略其中的任何例外狀況。請考慮將它變更為 Async 子函數，以便傳播例外狀況。

# WRN_UnobservedAwaitableDelegate_Title
source: The Task returned from this Async Function will be dropped, and any exceptions in it ignored
cs: Úkol vrácený touto asynchronní funkcí se zahodí a jakékoli výjimky v něm se budou ignorovat.
de: Die von dieser Async-Funktion zurückgegebene Aufgabe wird verworfen, und alle darin enthaltenen Ausnahmen werden ignoriert.
es: La tarea devuelta desde esta función asincrónica se anulará y se ignorará cualquiera de sus excepciones
fr: La tâche renvoyée à partir de cette fonction asynchrone sera supprimée et toutes les exceptions qu’elle contient seront ignorées
it: L'attività restituita dalla funzione Async verrà eliminata e le eventuali eccezioni presenti verranno ignorate
ja: この Async Function から返されたタスクは削除され、その中の例外は無視されます
ko: 이 비동기 함수에서 반환된 Task가 삭제되고 작업의 예외가 무시됨
pl: Zadanie zwrócone przez tę funkcję asynchroniczną zostanie porzucone, a powiązane z nim wyjątki zostaną zignorowane
pt_br: A tarefa retornada por essa função Async será descartada e as exceções nela ignoradas
ru: Задача, полученная из асинхронной функции, будет удалена, а все исключения в ней — пропущены
tr: Bu Zaman Uyumsuz İşlevden döndürülen Görev atılacak ve içindeki özel durumlar yoksayılacak
zh_hans: 自此 Async Function 返回的任务将被丢弃，它包含的任何异常也将被忽略
zh_hant: 將會卸除從這個 Async 函式傳回的 Task，且會忽略其中的所有例外狀況

# ERR_SecurityCriticalAsyncInClassOrStruct
source: Async and Iterator methods are not allowed in a [Class|Structure|Interface|Module] that has the 'SecurityCritical' or 'SecuritySafeCritical' attribute.
cs: Asynchronní a iterační metody nejsou povoleny ve [Třídě|Struktuře|Rozhraní|Modulu], které mají atribut SecurityCritical nebo SecuritySafeCritical.
de: Async- und Iterator-Methoden sind in [Klassen|Strukturen|Schnittstellen|Modulen], die das SecurityCritical- oder SecuritySafeCritical-Attribut aufweisen, nicht zulässig.
es: Los métodos Async e Iterator no se permiten en una [Clase|Estructura|Interfaz|Módulo] que tenga el atributo 'SecurityCritical' o 'SecuritySafeCritical'.
fr: Les méthodes Async et Iterator ne sont pas autorisées dans un(e) [Classe|Structure|Interface|Module] qui a l'attribut 'SecurityCritical' ou 'SecuritySafeCritical'.
it: I metodi Async e Iterator non sono consentiti in un elemento [Classe|Struttura|Interfaccia|Modulo] con attributo 'SecurityCritical' o 'SecuritySafeCritical'.
ja: SecurityCritical' または 'SecuritySafeCritical' 属性を持つ [Class|Structure|Interface|Module] では、Async メソッドおよび Iterator メソッドを使用できません。
ko: 특성이 'SecurityCritical' 또는 'SecuritySafeCritical'인 [Class|Structure|Interface|Module]에서는 비동기 및 반복기 메서드가 허용되지 않습니다.
pl: Metody Async i Iterator nie są dozwolone w klasie, strukturze, interfejsie lub module, który ma atrybut „SecurityCritical” lub „SecuritySafeCritical”.
pt_br: Métodos Assíncrono e Iterador não são permitidos em um [Class|Structure|Interface|Module] que tem o atributo "SecurityCritical" ou "SecuritySafeCritical".
ru: Методы Async и Iterator недопустимо использовать в [Класс|Структура|Интерфейс|Модуль] с атрибутом "SecurityCritical" или "SecuritySafeCritical".
tr: SecurityCritical' veya 'SecuritySafeCritical' özniteliği bulunan [Class|Structure|Interface|Module] içinde Zaman Uyumsuz ve Yineleyici yöntemlere izin verilmez.
zh_hans: 在具有“SecurityCritical”或“SecuritySafeCritical”属性的 [Class|Structure|Interface|Module] 中不允许使用 Async 或 Iterator 方法。
zh_hant: 具有 'SecurityCritical' 或 'SecuritySafeCritical' 屬性的 [Class|Structure|Interface|Module] 中，不可使用 Async 和 Iterator 方法。

# ERR_SecurityCriticalAsync
source: Security attribute '{0}' cannot be applied to an Async or Iterator method.
cs: Atribut zabezpečení {0} nejde použít pro asynchronní metodu nebo metodu iterátoru.
de: Das Sicherheitsattribut "{0}" kann nicht auf eine Async- oder Iterator-Methode angewendet werden.
es: El atributo de seguridad '{0}' no se puede aplicar a un método Async o Iterator.
fr: L'attribut de sécurité '{0}' ne peut pas être appliqué à une méthode Async ou Iterator.
it: Non è possibile applicare l'attributo di sicurezza '{0}' a un metodo Async o Iterator.
ja: セキュリティ属性 '{0}' を Async メソッドまたは Iterator メソッドに適用することはできません。
ko: '{0}' 보안 특성은 비동기 또는 반복기 메서드에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu zabezpieczeń „{0}” do metody Async lub Iterator.
pt_br: Atributo de segurança "{0}" não pode ser aplicado a um método Assíncrono ou Iterador.
ru: Атрибут безопасности "{0}" нельзя применить к методу Async или Iterator.
tr: '{0}' güvenlik özniteliği Zaman Uyumsuz veya Yineleyici bir yönteme uygulanamaz.
zh_hans: 安全属性“{0}”不能应用于 Async 或 Iterator 方法。
zh_hant: 安全屬性 '{0}' 無法套用至 Async 或 Iterator 方法。

# ERR_DllImportOnResumableMethod
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to an Async or Iterator method.
cs: 'Pro asynchronní metody nebo iterátory nejde použít atribut System.Runtime.InteropServices.DllImportAttribute.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf eine Async- oder Iterator-Methode angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a un método Async o Iterator.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué aux méthodes Async et Iterator.
it: 'Non è possibile applicare l'oggetto 'System.Runtime.InteropServices.DllImportAttribute' a un metodo Async o Iterator.
ja: 'System.Runtime.InteropServices.DllImportAttribute' は Async メソッドまたは Iterator メソッドに適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 비동기 또는 반복기 메서드에 적용할 수 없습니다.
pl: 'Atrybutu „System.Runtime.InteropServices.DllImportAttribute” nie można zastosować do metody asynchronicznej ani iteracyjnej.
pt_br: 'Não é possível aplicar 'System.Runtime.InteropServices.DllImportAttribute' a um método Async ou Iterator.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не может применяться к методам Async или Iterator.
tr: 'System.Runtime.InteropServices.DllImportAttribute' bir Zaman Uyumsuz veya Yineleyici yönteme uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于异步方法或迭代器方法。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至 Async 或 Iterator 方法。

# ERR_SynchronizedAsyncMethod
source: 'MethodImplOptions.Synchronized' cannot be applied to an Async method.
cs: 'Hodnotu MethodImplOptions.Synchronized nejde použít pro asynchronní metodu.
de: '"MethodImplOptions.Synchronized" kann nicht auf eine Async-Methode angewendet werden.
es: 'MethodImplOptions.Synchronized' no se puede aplicar a un método Async.
fr: 'MethodImplOptions.Synchronized' ne peut pas être appliqué à une méthode Async.
it: 'Non è possibile applicare l'oggetto 'MethodImplOptions.Synchronized' a un metodo Async.
ja: 'MethodImplOptions.Synchronized' は Async メソッドに適用できません。
ko: 'MethodImplOptions.Synchronized'는 비동기 메서드에 적용할 수 없습니다.
pl: 'Atrybutu „MethodImplOptions.Synchronized” nie można zastosować do metody asynchronicznej.
pt_br: 'Não é possível aplicar 'MethodImplOptions.Synchronized' a um método Async.
ru: 'Невозможно применить "MethodImplOptions.Synchronized" к асинхронному методу.
tr: 'MethodImplOptions.Synchronized' Zaman Uyumsuz bir yönteme uygulanamaz.
zh_hans: '"MethodImplOptions.Synchronized" 不能应用于异步方法。
zh_hant: 'MethodImplOptions.Synchronized' 無法套用至 Async 方法。

# ERR_AsyncSubMain
source: The 'Main' method cannot be marked 'Async'.
cs: Metodu Main nejde označit jako asynchronní pomocí modifikátoru Async.
de: Die Main-Methode kann nicht als "Async" markiert werden.
es: El método 'Main' no se puede marcar como 'Async'.
fr: La méthode 'Main' ne peut pas être marquée comme 'Async'.
it: Il metodo 'Main' non può essere contrassegnato con 'Async'.
ja: Main' メソッドを 'Async' に設定することはできません。
ko: Main' 메서드는 'Async'로 표시할 수 없습니다.
pl: Metoda „Main” nie może być oznaczona atrybutem „Async”.
pt_br: Não é possível marcar o método 'Main' como 'Async'.
ru: Метод Main нельзя пометить модификатором Async.
tr: Main' yöntemi 'Async' olarak işaretlenemez.
zh_hans: "Main" 方法不能标记为 "Async"。
zh_hant: Main' 方法不能標記為 'Async。

# WRN_AsyncSubCouldBeFunction
source: Some overloads here take an Async Function rather than an Async Sub. Consider either using an Async Function, or casting this Async Sub explicitly to the desired type.
cs: Některé přetížené výrazy vyžadují asynchronní funkci místo asynchronní procedury. Zvažte použití asynchronní funkce nebo explicitní přetypování této asynchronní procedury na požadovaný typ.
de: Einige hier aufgeführte Überladungen nutzen die Async-Funktion anstelle der Async-Unterfunktion. Ziehen Sie in Betracht, entweder eine Async-Funktion zu verwenden oder diese Async-Unterfunktion explizit in den gewünschten Typ umzuwandeln.
es: Algunas de estas sobrecargas toman una función asincrónica en lugar de Sub asincrónico. Puede usar una función asincrónica o convertir este Sub asincrónico explícitamente en el tipo deseado.
fr: Certaines surcharges doivent être associées à une fonction Async plutôt qu'à une procédure Sub Async. Utilisez une fonction Async ou effectuez une conversion explicite de la procédure Sub Async vers le type désiré.
it: Sono presenti alcuni overload che accettano Async Function anziché Async Sub. Provare a usare Async Function o a eseguire in modo esplicito il cast di Async Sub sul tipo desiderato.
ja: ここにある一部のオーバーロードは Async Sub ではなく Async Function を受け取ります。Async Function を使用するか、この Async Sub を目的の型に明示的にキャストすることを検討してください。
ko: 여기서 일부 오버로드는 비동기 Sub 대신 비동기 함수를 받아들입니다. 비동기 함수를 사용하거나 명시적으로 이 비동기 Sub를 원하는 형식으로 캐스팅하세요.
pl: Niektóre widoczne tu przeciążenia korzystają z funkcji asynchronicznych, a nie procedur asynchronicznych. Rozważ użycie funkcji asynchronicznej albo rzutowanie tej procedury asynchronicznej jawnie na żądany typ.
pt_br: Algumas sobrecargas aqui obtêm uma Async Function em vez de uma Async Sub. Considere o uso de uma Async Function ou a conversão dessa Async Sub explicitamente no tipo desejado.
ru: Некоторые используемые здесь перегрузки принимают функцию Async, а не подпрограмму Async. Воспользуйтесь функцией Async или выполните явное приведение данной подпрограммы Async к требуемому типу.
tr: Buradaki bazı aşırı yüklemeler Async Alt Yordamı yerine bir Async İşlevi alıyor. Bir Async İşlevi kullanabilir veya bu Async Alt Yordamını istediğiniz türe atayabilirsiniz.
zh_hans: 此处某些重载使用的是 Async Function 而不是 Async Sub。请考虑使用 Async Function 或将此 Async Sub 显式强制转换为所需类型。
zh_hant: 這裡的有些多載會接受 Async 函式，而非 Async 子函數。請考慮使用 Async 函式，或者將這個 Async 子函數明確地轉型為想要的類型。

# WRN_AsyncSubCouldBeFunction_Title
source: Some overloads here take an Async Function rather than an Async Sub
cs: Některá přetížení tady nepřijímají asynchronní proceduru, ale asynchronní funkci.
de: Manche Überladungen hier verwenden eine Async-Funktion anstelle einer Async-Unterfunktion.
es: Algunas sobrecargas toman una función asincrónica en lugar de una subfunción asincrónica
fr: Certaines surcharges doivent être associées à une fonction Async plutôt qu’à une procédure Sub Async
it: Sono presenti alcuni overload che accettano una funzione Async invece di sub Async
ja: ここにある一部のオーバーロードは Async Sub ではなく Async Function を受け取ります
ko: 여기서 일부 오버로드는 비동기 Sub 대신 비동기 함수를 받아들임
pl: Niektóre widoczne tu przeciążenia korzystają z funkcji asynchronicznych, a nie procedur asynchronicznych
pt_br: Aqui, algumas sobrecargas usam uma função Async em vez de uma Sub Async
ru: Некоторые используемые здесь перегрузки принимают функцию с модификатором Async, а не подпрограмму с модификатором Async
tr: Buradaki bazı aşırı yüklemeler Async Sub yerine Async Function alıyor
zh_hans: 此处的一些重载采用的是 Async Function，而不是 Async Sub
zh_hant: 有些此處的多載接受 Async 函式但不接受 Async 子函式

# ERR_MyGroupCollectionAttributeCycle
source: MyGroupCollectionAttribute cannot be applied to itself.
cs: MyGroupCollectionAttribute se nedá aplikovat na sebe sama.
de: MyGroupCollectionAttribute kann nicht auf sich selbst angewendet werden.
es: MyGroupCollectionAttribute no se puede aplicar a sí mismo.
fr: MyGroupCollectionAttribute ne peut pas être appliqué à lui-même.
it: Non è possibile applicare MyGroupCollectionAttribute a se stesso.
ja: MyGroupCollectionAttribute をそれ自体に適用することはできません。
ko: MyGroupCollectionAttribute를 자체적으로 적용할 수 없습니다.
pl: Atrybut MyGroupCollectionAttribute nie może zostać zastosowany do siebie samego.
pt_br: MyGroupCollectionAttribute não pode ser aplicada a si mesmo.
ru: Атрибут MyGroupCollectionAttribute нельзя применить к самому себе.
tr: MyGroupCollectionAttribute kendi kendisine uygulanamaz.
zh_hans: MyGroupCollectionAttribute 不能应用于自身。
zh_hant: MyGroupCollectionAttribute 無法套用至本身。

# ERR_LiteralExpected
source: Literal expected.
cs: Očekával se literál.
de: Literal erwartet.
es: Se esperaba un literal.
fr: Littéral attendu.
it: È previsto un valore letterale.
ja: リテラルが必要です。
ko: 리터럴이 필요합니다.
pl: Oczekiwano literału.
pt_br: Literal esperado.
ru: Требуется литерал.
tr: Sabit değer bekleniyor.
zh_hans: 应为文本。
zh_hant: 必須是常值。

# ERR_WinRTEventWithoutDelegate
source: Event declarations that target WinMD must specify a delegate type. Add an As clause to the event declaration.
cs: Pro deklarace událostí, jejichž cílovým výstupem je soubor WinMD, musí být určený typ delegáta. Přidejte klauzuli As do deklarace události.
de: Ereignisdeklarationen, die auf WinMD abzielen, müssen einen Delegattyp angeben. Fügen Sie eine As-Klausel zur Ereignisdeklaration hinzu.
es: Las declaraciones de eventos cuyo destino es WinMD deben especificar un tipo de delegado. Agregue una cláusula As a la declaración de eventos.
fr: Les déclarations d'événement qui ciblent WinMD doivent spécifier un type de délégué. Ajoutez une clause As à la déclaration d'événement.
it: Le dichiarazioni di evento destinate a WinMD devono specificare un tipo delegato. Aggiungere una clausola As alla dichiarazione di evento.
ja: WinMD を対象とするイベント宣言は、デリゲート型を指定する必要があります。イベント宣言に As 句を追加してください。
ko: WinMD를 대상으로 하는 이벤트 선언은 대리자 형식을 지정해야 합니다. 이벤트 선언에 As 절을 추가합니다.
pl: Deklaracje zdarzeń przeznaczone dla WinMD muszą określać typ delegata. Dodaj klauzulę As do deklaracji zdarzenia.
pt_br: As declarações de evento destinadas a WinMD devem especificar um tipo de delegado. Adicione uma cláusula As à declaração do evento.
ru: В объявления событий, предназначенных для WinMD, должен указываться тип делегатов. Добавьте в объявление событий предложение As.
tr: WinMD'yi hedefleyen olay bildirimleri, temsilci türü belirtmelidir. Olay bildirimine As yan tümcesi ekleyin.
zh_hans: 面向 WinMD 的事件声明必须指定委托类型。请在事件声明中添加一个 As 子句。
zh_hant: 目標為 WinMD 的事件宣告必須指定委派類型。請將 As 子句加入至事件宣告。

# ERR_MixingWinRTAndNETEvents
source: Event '{0}' cannot implement a Windows Runtime event '{1}' and a regular .NET event '{2}'
cs: Událost {0} nemůže implementovat událost {1} modulu Windows Runtime a současně normální událost {2} rozhraní .NET.
de: Das Ereignis "{0}" kann nicht ein Windows-Runtime-Ereignis "{1}" und ein reguläres .NET-Ereignis "{2}" implementieren.
es: El evento '{0}' no puede implementar un evento '{1}' de Windows Runtime y un evento '{2}' regular de .NET.
fr: L'événement '{0}' ne peut pas implémenter un événement Windows Runtime '{1}' et un événement .NET régulier '{2}'.
it: L'evento '{0}' non è in grado di implementare un evento di Windows Runtime '{1}' e un evento .NET normale '{2}'
ja: イベント '{0}' は Windows ランタイム イベント '{1}' と通常の .NET イベント '{2}' を実装できません
ko: '{0}' 이벤트에서 Windows Runtime 이벤트 '{1}'과(와) 일반 .NET 이벤트 '{2}'을(를) 모두 구현할 수는 없습니다.
pl: Zdarzenie „{0}” nie może implementować zdarzenia wykonawczego systemu Windows „{1}” i zwykłego zdarzenia platformy .NET „{2}”.
pt_br: Evento '{0}' não pode implementar um evento de Windows Runtime '{1}' e um evento .NET regular '{2}'
ru: Событие "{0}" не может реализовать событие среды выполнения Windows "{1}" и регулярное событие .NET "{2}"
tr: '{0}' olayı '{1}' Windows Çalışma Zamanı olayını ve normal '{2}' .NET olayını uygulayamaz
zh_hans: 事件“{0}”无法实现 Windows 运行时事件“{1}”和常规 .NET 事件“{2}”
zh_hant: 事件 '{0}' 無法實作 Windows 執行階段事件 '{1}' 和一般 .NET 事件 '{2}'

# ERR_EventImplRemoveHandlerParamWrong
source: Event '{0}' cannot implement event '{1}' on interface '{2}' because the parameters of their 'RemoveHandler' methods do not match.
cs: Událost {0} nemůže implementovat událost {1} rozhraní {2}, protože parametry jejich metod RemoveHandler se neshodují.
de: Das {0}-Ereignis kann das {1}-Ereignis für die {2}-Schnittstelle nicht implementieren, da die Parameter der RemoveHandler-Methoden nicht übereinstimmen.
es: El evento '{0}' no puede implementar el evento '{1}' en la interfaz '{2}' porque los parámetros de sus métodos 'RemoveHandler' no coinciden.
fr: L'événement '{0}' ne peut pas implémenter l'événement '{1}' dans l'interface '{2}', car les paramètres de leurs méthodes 'RemoveHandler' respectives ne sont pas les mêmes.
it: L'evento '{0}' non è in grado di implementare l'evento '{1}' nell'interfaccia '{2}' perché i parametri dei rispettivi metodi 'RemoveHandler' non corrispondono.
ja: RemoveHandler' メソッドのパラメーターが一致しないため、イベント '{0}' はインターフェイス '{2}' 上のイベント '{1}' を実装できません。
ko: RemoveHandler' 메서드의 매개 변수가 일치하지 않으므로 '{0}' 이벤트에서 '{2}' 인터페이스에 대해 '{1}' 이벤트를 구현할 수 없습니다.
pl: Zdarzenie „{0}” nie może implementować zdarzenia „{1}” w interfejsie „{2}”, ponieważ parametry ich metod „RemoveHandler” są niezgodne.
pt_br: Evento "{0}" não pode implementar o evento "{1}" na interface "{2}" porque os parâmetros dos seus métodos "RemoveHandler" não coincidem.
ru: Событию "{0}" не удается реализовать событие "{1}" в интерфейсе "{2}" из-за несовпадения параметров их методов "RemoveHandler".
tr: RemoveHandler' yöntemlerinin parametreleri eşleşmediğinden, '{0}' olayı '{2}' arabirimi üzerinde '{1}' olayını uygulayamıyor.
zh_hans: 事件“{0}”无法实现接口“{2}”上的事件“{1}”，因为其“RemoveHandler”方法的参数不匹配。
zh_hant: 事件 '{0}' 無法在介面 '{2}' 上實作事件 '{1}'，因為其 'RemoveHandler' 方法的參數不相符。

# ERR_AddParamWrongForWinRT
source: The type of the 'AddHandler' method's parameter must be the same as the type of the event.
cs: Typ parametru metody AddHandler musí být stejný jako typ události.
de: Der Typ des Parameters der AddHandler-Methode muss dem Typ des Ereignisses entsprechen.
es: El parámetro del método 'AddHandler' debe tener el mismo tipo que el evento.
fr: Le type du paramètre de la méthode 'AddHandler' doit être identique au type de l'événement.
it: Il tipo del parametro del metodo 'AddHandler' deve corrispondere al tipo dell'evento.
ja: AddHandler' メソッドのパラメーターの型は、イベントの型と同じであることが必要です。
ko: AddHandler' 메서드 매개 변수의 형식은 이벤트 형식과 같아야 합니다.
pl: Typ parametru metody „AddHandler” musi być taki sam jak typ zdarzenia.
pt_br: O tipo do parâmetro do método de 'AddHandler' deve ser o mesmo que o tipo do evento.
ru: Тип параметра метода AddHandler должен совпадать с типом события.
tr: AddHandler' yöntemi parametresinin türü olayın türüyle aynı olmalıdır.
zh_hans: “AddHandler”方法的参数的类型必须与事件的类型相同。
zh_hant: AddHandler' 方法參數的類型必須與事件的類型相同。

# ERR_RemoveParamWrongForWinRT
source: In a Windows Runtime event, the type of the 'RemoveHandler' method parameter must be 'EventRegistrationToken'
cs: V události prostředí Windows Runtime musí být parametr metody RemoveHandler typu EventRegistrationToken.
de: Bei einem Windows-Runtime-Ereignis muss der Methodenparameter "RemoveHandler" vom Typ "EventRegistrationToken" sein.
es: En un evento de Windows Runtime, el tipo de parámetro de método 'RemoveHandler' debe ser 'EventRegistrationToken'
fr: Dans un événement Windows Runtime, le type du paramètre de méthode 'RemoveHandler' doit être 'EventRegistrationToken'
it: In un evento di Windows Runtime il tipo del parametro del metodo 'RemoveHandler' deve essere 'EventRegistrationToken'
ja: Windows ランタイム イベントでは、'RemoveHandler' メソッド パラメーターの型を 'EventRegistrationToken' にする必要があります
ko: Windows 런타임 이벤트에서 'RemoveHandler' 메서드 매개 변수의 형식은 'EventRegistrationToken'이어야 합니다.
pl: W zdarzeniu środowiska wykonawczego systemu Windows parametr metody „RemoveHandler” musi mieć wartość „EventRegistrationToken”
pt_br: Em um evento do Windows Runtime, o tipo do parâmetro do método 'RemoveHandler' deve ser 'EventRegistrationToken'
ru: В событии среды выполнения Windows тип параметра метода "RemoveHandler" должен иметь значение "EventRegistrationToken"
tr: Windows Çalışma Zamanı olayında ‘RemoveHandler’ metot parametresinin türü 'EventRegistrationToken' olmalıdır
zh_hans: 在 Windows Runtime 事件中，“RemoveHandler”方法参数的类型必须为“EventRegistrationToken”
zh_hant: 在 Windows 執行階段事件中，'RemoveHandler' 方法參數的類型必須是 'EventRegistrationToken'
