Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_TypeInferenceFailure3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: '{1}' で定義されている拡張メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論することはできません。データ型を明示的に指定することによって、このエラーを修正できる可能性があります。
ko: 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'의 형식 매개 변수에 대한 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos. Especificar o(s) tipo(s) de dados explicitamente pode corrigir este erro.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в "{1}", не могут быть получены из этих аргументов. Явное указание типов данных может исправить эту ошибку.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断“{1}”中定义的扩展方法“{0}”中类型形参的数据类型。显式指定数据类型可更正此错误。
zh_hant: 無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。

# ERR_TypeInferenceFailureNoExplicit1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti.
ja: 型パラメーターのデータ型を、これらの引数から推論することはできません。
ko: 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos.
ru: Типы данных параметров-типов не могут быть определены из этих аргументов.
tr: Bu bağımsız değişkenlerden tür parametrelerinin veri türleri çıkarsanamıyor.
zh_hans: 无法从这些实参推断类型形参的数据类型。
zh_hant: 無法從這些引數推斷類型參數的資料類型。

# ERR_TypeInferenceFailureNoExplicit2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論することはできません。
ko: 이 인수에서 '{0}' 메서드에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型。
zh_hant: 無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。

# ERR_TypeInferenceFailureNoExplicit3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti.
ja: '{1}' で定義された拡張メソッド '{0}' 内の型パラメーターのデータ型を、これらの引数から推論することはできません。
ko: 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'의 형식 매개 변수에 대한 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в "{1}", не могут быть получены из этих аргументов.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断“{1}”中定义的扩展方法“{0}”中类型形参的数据类型。
zh_hant: 無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。

# ERR_TypeInferenceFailureAmbiguous1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments because more than one type is possible. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu, protože je přípustný více než jeden typ. Je možné, že se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos porque hay más de un tipo posible. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments, car plusieurs types sont possibles. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti perché sono possibili più tipi. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: 該当する型が複数考えられるため、型パラメーターのデータ型を、これらの引数から推論することはできません。データ型を明示的に指定すると、このエラーが修正される可能性があります。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu, ponieważ jest możliwy więcej niż jeden typ. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos porque há mais de um tipo possível. A especificação explícita dos tipos de dados deve corrigir esse erro.
ru: Типы данных параметров-типов не могут быть определены из этих аргументов, так как возможны несколько типов. Явное указание типов данных может исправить эту ошибку.
tr: Tür parametrelerinin veri türleri, birden çok tür olasılığı bulunduğundan, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断类型形参的数据类型，因为可能会存在多个类型。显式指定数据类型可更正此错误。
zh_hant: 無法從這些引數推斷類型參數的資料類型，因為可能的類型不止一種。明確指定資料類型或許可以改正這項錯誤。

# ERR_TypeInferenceFailureAmbiguous2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments because more than one type is possible. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}, protože je přípustný víc než jeden typ. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos porque hay más de un tipo posible. Este error se puede resolver especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments, car plusieurs types sont possibles. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti perché sono possibili più tipi. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、複数の型の可能性があるため、できません。データ型を明示的に指定することによって、このエラーを修正できる場合があります。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 '{0}' 메서드에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”, ponieważ możliwe jest użycie więcej niż jednego typu. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos porque mais de um tipo é possível. Especificar o(s) tipo(s) de dados explicitamente pode corrigir este erro.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов, так как возможен более чем один тип. Явное указание типов данных может исправить эту ошибку.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri, birden çok tür olasılığı bulunduğundan, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型，因为可能会存在多个类型。显式指定数据类型可更正此错误。
zh_hant: 因為可能的類型不只一種，所以無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。

# ERR_TypeInferenceFailureAmbiguous3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments because more than one type is possible. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}, protože je přípustný víc než jeden typ. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos porque hay más de un tipo posible. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments, car plusieurs types sont possibles. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti perché sono possibili più tipi. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: '{1}' で定義されている拡張メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、複数の型の可能性があるため、できません。データ型を明示的に指定することによって、このエラーを修正できる場合があります。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”, ponieważ możliwe jest użycie więcej niż jednego typu. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos porque mais de um tipo é possível. Especificar o(s) tipo(s) de dados explicitamente pode corrigir esse erro.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в "{1}", не могут быть получены из этих аргументов, так как возможен более чем один тип. Явное указание типов данных может исправить эту ошибку.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri, birden çok tür olasılığı bulunduğundan, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断“{0}”中定义的扩展方法“{1}”中类型形参的数据类型，因为可能会存在多个类型。显式指定数据类型可更正此错误。
zh_hant: 因為可能的類型不只一種，所以無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。

# ERR_TypeInferenceFailureNoExplicitAmbiguous1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments because more than one type is possible.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu, protože je přípustný více než jeden typ.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos porque hay más de un tipo posible.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments, car plusieurs types sont possibles.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti perché sono possibili più tipi.
ja: 該当する型が複数考えられるため、型パラメーターのデータ型を、これらの引数から推論することはできません。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu, ponieważ jest możliwy więcej niż jeden typ.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos porque há mais de um tipo possível.
ru: Типы данных параметров-типов не могут быть определены из этих аргументов, так как возможны несколько типов.
tr: Birden çok tür olasılığı bulunduğundan, tür parametrelerinin veri türleri bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断类型形参的数据类型，因为可能会存在多个类型。
zh_hant: 無法從這些引數推斷類型參數的資料類型，因為可能會有一個以上的類型。

# ERR_TypeInferenceFailureNoExplicitAmbiguous2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments because more than one type is possible.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}, protože je přípustný víc než jeden typ.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos porque hay más de un tipo posible.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments, car plusieurs types sont possibles.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti perché sono possibili più tipi.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、複数の型の可能性があるため、できません。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 '{0}' 메서드에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”, ponieważ możliwe jest użycie więcej niż jednego typu.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos porque mais de um tipo é possível.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов, так как возможен более чем один тип.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri, birden çok tür olasılığı bulunduğundan, bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型，因为可能会存在多个类型。
zh_hant: 因為可能的類型不只一種，所以無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。

# ERR_TypeInferenceFailureNoExplicitAmbiguous3
source: Data type(s) of the type parameter(s) in extension method '{0}' defined in '{1}' cannot be inferred from these arguments because more than one type is possible.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě rozšíření {0} definované v {1}, protože je přípustný víc než jeden typ.
de: Die Datentypen der Typparameter in der in "{1}" definierten Erweiterungsmethode "{0}" können nicht von diesen Argumenten abgeleitet werden, da mehrere Typen möglich sind.
es: Los tipos de datos de los parámetros de tipo del método de extensión '{0}' definido en '{1}' no se pueden inferir de estos argumentos porque hay más de un tipo posible.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode d'extension '{0}' définie dans '{1}' à partir de ces arguments, car plusieurs types sont possibles.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' dell'estensione definito in '{1}' da questi argomenti perché sono possibili più tipi.
ja: '{1}' で定義されている拡張メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論しようとしても、複数の型の可能性があるため、できません。
ko: 두 개 이상의 형식이 가능하므로 이 인수에서 '{1}'에 정의된 확장 메서드 '{0}'에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”, ponieważ możliwe jest użycie więcej niż jednego typu.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método de extensão "{0}" definido(s) em "{1}" não pode(m) ser inferido(s) destes argumentos porque mais de um tipo é possível.
ru: Типы данных параметров типа в методе расширения "{0}", которые определены в "{1}", не могут быть получены из этих аргументов, так как возможен более чем один тип.
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemindeki tür parametrelerinin veri türleri, birden çok tür olasılığı bulunduğundan, bu bağımsız değişkenlerden çıkarsanamıyor.
zh_hans: 无法从这些实参推断“{0}”中定义的扩展方法“{1}”中类型形参的数据类型，因为可能会存在多个类型。
zh_hant: 因為可能的類型不只一種，所以無法從這些引數推斷定義在 '{1}' 中擴充方法 '{0}' 內類型參數的資料類型。

# ERR_TypeInferenceFailureNoBest1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments because they do not convert to the same type. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu, protože nejsou převoditelné na stejný typ. Je možné, že se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden, da sie nicht in denselben Typ konvertiert werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos porque no se convierten en el mismo tipo. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments, car ils ne sont pas convertis vers le même type. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti perché non vengono convertiti nello stesso tipo. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: 同じ型に変換されない引数があるため、型パラメーターのデータ型を、これらの引数から推論することはできません。データ型を明示的に指定すると、このエラーが修正される可能性があります。
ko: 동일한 형식으로 변환할 수 없으므로 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu, ponieważ nie można konwertować ich na jeden typ. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos porque eles não são convertidos no mesmo tipo. A especificação explícita dos tipos de dados deve corrigir esse erro.
ru: Типы данных параметров типов не могут быть определены из этих аргументов, так как они не могут быть приведены к одному типу. Явное указание типов данных может исправить эту ошибку.
tr: Tür parametrelerinin veri türleri, aynı türe dönüştürülmediklerinden, bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断类型形参的数据类型，因为这些数据类型不会转换为同一类型。显式指定数据类型可更正此错误。
zh_hant: 無法從這些引數推斷類型參數的資料類型，因為它們不會轉換成相同類型。明確指定資料類型或許可以改正這項錯誤。
