Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoUniqueConstructorOnBase2
source: Class '{0}' must declare a 'Sub New' because its base class '{1}' has more than one accessible 'Sub New' that can be called with no arguments.
cs: Třída {0} musí deklarovat proceduru Sub New, protože základní třída {1} obsahuje víc než jednu přístupnou proceduru Sub New, kterou jde volat bez argumentů.
de: Die Klasse "{0}" muss eine "Sub New" deklarieren, da ihre Basisklasse "{1}" mehr als eine zugreifbare "Sub New" hat, die ohne Argumente aufgerufen werden kann.
es: La clase '{0}' debe declarar un 'Sub New' porque su clase base '{1}' tiene más de un 'Sub New' accesible al que puede llamarse sin argumentos.
fr: La classe '{0}' doit déclarer un 'Sub New', car sa classe de base '{1}' comporte plus de 'Sub New' accessibles qu'il n'est possible d'appeler sans argument.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché la relativa classe di base '{1}' contiene più di un elemento 'Sub New' accessibile che può essere chiamato senza argomenti.
ja: 基底クラス '{1}' に引数なしで呼び出されるアクセス可能な 'Sub New' が 2 つ以上指定されているため、クラス '{0}' で 'Sub New' を宣言する必要があります。
ko: '{0}' 클래스의 기본 클래스 '{1}'에는 인수 없이 호출할 수 있는 액세스 가능한 'Sub New'가 두 개 이상 있으므로 'Sub New'를 선언해야 합니다.
pl: Klasa „{0}” musi mieć deklarację elementu „Sub New”, ponieważ jej klasa bazowa „{1}” ma więcej niż jeden dostępny element „Sub New”, który można wywołać bez argumentów.
pt_br: Classe "{0}" deve declarar um "Sub New" porque sua classe base "{1}" não tem mais de um "Sub New" acessível que pode ser chamado sem argumentos.
ru: Класс "{0}" должен объявить "Sub New", так как его базовый класс "{1}" имеет более чем один доступный "Sub New", который может быть вызван без аргументов.
tr: '{0}' sınıfı, temel sınıfı olan '{1}' sınıfı bağımsız değişken olmadan çağrılabilen birden çok erişilebilir 'Sub New' içerdiğinden bir 'Sub New' bildirmelidir.
zh_hans: 类“{0}”必须声明一个“Sub New”，因它的基类“{1}”有多个不使用参数就可以调用的可访问“Sub New”。
zh_hant: 類別 '{0}' 必須宣告 'Sub New'，因為其基底類別 '{1}' 有一個以上不用引數即可呼叫的可存取 'Sub New'。

# ERR_ExtraNextVariable
source: 'Next' statement names more variables than there are matching 'For' statements.
cs: 'Příkaz Next uvádí víc proměnných, než je odpovídajících příkazů For.
de: 'Die Next-Anweisung benennt mehr Variablen, als entsprechende For-Anweisungen vorhanden sind.
es: 'Hay más variables designadas por la instrucción 'Next' que instrucciones 'For' correspondientes.
fr: 'L'instruction 'Next' nomme plus de variables qu'il n'existe d'instructions 'For' correspondantes.
it: 'Con l'istruzione 'Next' viene assegnato un numero di variabili maggiore delle istruzioni 'For' corrispondenti.
ja: 'Next' ステートメントに、対応する 'For' ステートメントよりも多くの変数が指定されています。
ko: 'Next' 문은 해당 'For' 문에 있는 변수보다 많은 변수를 명명합니다.
pl: 'Instrukcja „Next” zawiera więcej zmiennych, niż istnieje odpowiadających jej instrukcji „For”.
pt_br: 'Instruções 'Next' nomeiam mais variáveis do que há de instruções 'For' correspondentes.
ru: 'В операторе "Next" указано больше переменных, чем в соответствующих операторах "For".
tr: 'Next' deyiminde eşleşen 'For' deyimlerinde bulunanlardan daha çok değişken adı geçiyor.
zh_hans: '“Next”语句命名的变量比已有的匹配“For”语句多。
zh_hant: 'Next' 陳述式命名超過符合 'For' 陳述式的變數。

# ERR_RequiredNewCallTooMany2
source: First statement of this 'Sub New' must be a call to 'MyBase.New' or 'MyClass.New' because base class '{0}' of '{1}' has more than one accessible 'Sub New' that can be called with no arguments.
cs: Prvním příkazem této procedury Sub New musí být volání konstruktoru MyBase.New nebo MyClass.New, protože základní třída {0} odvozená od třídy {1} má víc než jednu přístupnou proceduru Sub New, kterou jde volat bez argumentů.
de: Die erste Anweisung dieser "Sub New" muss ein Aufruf an "MyBase.New" oder "MyClass.New" sein, da die Basisklasse "{0}" von "{1}" mehr als eine zugreifbare "Sub New" hat, die ohne Argumente aufgerufen werden kann.
es: La primera instrucción de este 'Sub New' debe ser una llamada a 'MyBase.New' o 'MyClass.New' porque la clase base '{0}' de '{1}' tiene más de un 'Sub New' accesible al que se pueda llamar sin argumentos.
fr: La première instruction de ce 'Sub New' doit être un appel à 'MyBase.New' ou 'MyClass.New', car la classe de base '{0}' de '{1}' a plusieurs 'Sub New' accessibles qu'il est possible d'appeler sans argument.
it: La prima istruzione di questo 'Sub New' deve essere una chiamata a 'MyBase.New' o a 'MyClass.New' perché la classe di base '{0}' di '{1}' ha più 'Sub New' accessibili che possono essere chiamati senza argomenti.
ja: '{1}' の基底クラス '{0}' には、引数なしで呼び出せるアクセス可能な 'Sub New' が 2 つ以上指定されているため、この 'Sub New' の最初のステートメントは、'MyBase.New' または 'MyClass.New' への呼び出しでなければなりません。
ko: '{1}'의 기본 클래스 '{0}'에는 인수 없이 호출할 수 있는 액세스 가능한 'Sub New'가 두 개 이상 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 호출이어야 합니다.
pl: Pierwszą instrukcją w tym bloku „Sub New” musi być wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ klasa bazowa „{0}” klasy „{1}” ma więcej niż jeden dostępny element „Sub New”, który można wywołać bez argumentów.
pt_br: Primeira instrução deste "Sub New" deve ser uma chamada para "MyBase.New" ou "MyClass.New" porque a classe base "{0}" de "{1}" não tem um "Sub New" acessível que pode ser chamado sem argumentos.
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" из "{1}" имеет более чем один доступный "Sub New", который может быть вызван без аргументов.
tr: '{1}' sınıfının temel sınıfı olan '{0}' sınıfında bağımsız değişken olmadan çağrılabilecek erişilebilir birden fazla 'Sub New' olduğundan, bu 'Sub New' oluşturucusunun ilk deyimi bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır.
zh_hans: “{1}”的基类“{0}”没有不使用参数就可以调用的可访问“Sub New”，因此该“Sub New”的第一个语句必须是对“MyBase.New”或“MyClass.New”的调用。
zh_hant: 此 'Sub New' 的第一個陳述式，必須呼叫 'MyBase.New' 或 'MyClass.New'，因為 '{1}' 的基底類別 '{0}' 有一個以上不使用引數即可呼叫的可存取 'Sub New'。

# ERR_ForCtlVarArraySizesSpecified
source: Array declared as for loop control variable cannot be declared with an initial size.
cs: Pole deklarované jako řídicí proměnná smyčky For nejde deklarovat s počáteční velikostí.
de: Ein Array, das als For-Schleifensteuervariable deklariert ist, kann nicht mit einer vorgegebenen Größe deklariert werden.
es: La matriz declarada como variable de control de bucle For no se puede declarar con un tamaño inicial.
fr: Un tableau déclaré en tant que variable de contrôle de boucle for ne peut pas être déclaré avec une taille initiale.
it: La matrice dichiarata come variabile di controllo ciclo non può essere dichiarata con dimensione iniziale.
ja: for ループ制御変数として宣言される配列に初期サイズを指定することはできません。
ko: For 루프 제어 변수를 통해 선언되는 배열은 초기 크기를 지정하여 선언할 수 없습니다.
pl: Tablica zadeklarowana jako zmienna sterująca pętli for nie może być zadeklarowana z rozmiarem początkowym.
pt_br: Não é possível declarar matriz declarada como variável de controle de loop com um valor inicial.
ru: Массив, объявляемый для переменной цикла For, не может объявляться с начальным размером.
tr: For döngüsü denetim değişkeni olarak bildirilen bir dizinin ilk boyutu bildirilemez.
zh_hans: 声明用于循环控制变量的数组时不能使用初始大小的值。
zh_hant: 宣告為 for 迴圈控制變數的陣列不能宣告它的初始大小。

# ERR_BadFlagsOnNewOverloads
source: The '{0}' keyword is used to overload inherited members; do not use the '{0}' keyword when overloading 'Sub New'.
cs: Klíčové slovo {0} se používá k přetěžování zděděných členů. Klíčové slovo {0} nepoužívejte při přetěžování Sub New.
de: Das Schlüsselwort "{0}" wird zum Überladen von geerbten Membern verwendet. Verwenden Sie das Schlüsselwort "{0}" nicht beim Überladen von "Sub New".
es: La palabra clave '{0}' se usa para sobrecargar los miembros heredados; no use la palabra clave '{0}' cuando sobrecargue un procedimiento 'Sub New'.
fr: Le mot clé '{0}' est utilisé pour surcharger les membres hérités ; n'utilisez pas le mot clé '{0}' lors de la surcharge de 'Sub New'.
it: La parola chiave '{0}' viene usata per eseguire l'overload dei membri ereditati. Non usare la parola chiave '{0}' per l'overload di 'Sub New'.
ja: '{0}' キーワードは、継承されたメンバーをオーバーロードするために使用されます。'Sub New' をオーバーロードするときには '{0}' を使用しないでください。
ko: '{0}' 키워드를 사용하여 상속된 멤버를 오버로드했습니다. 'Sub New'를 오버로드할 때에는 '{0}' 키워드를 사용하지 마세요.
pl: Słowo kluczowe „{0}” służy do przeciążania dziedziczonych składowych; nie należy używać słowa kluczowego „{0}” do przeciążania elementu „Sub New”.
pt_br: A palavra-chave "{0}" é usada para sobrecarregar membros herdados; não use a palavra-chave "{0}" ao sobrecarregar "Sub New".
ru: Ключевое слово "{0}" используется для перегрузки наследуемых членов. Не используйте ключевое слово "{0}" при перегрузке "Sub New".
tr: '{0}' anahtar sözcüğü devralınan üyeleri aşırı yüklemek için kullanılır; 'Sub New' öğesinin aşırı yüklemesinde '{0}' anahtar sözcüğünü kullanmayın.
zh_hans: “{0}”关键字用于重载继承的成员；重载“Sub New”时不要使用“{0}”关键字。
zh_hant: '{0}' 關鍵字是用以多載繼承的成員; 當多載 'Sub New' 時，請勿使用 '{0}' 關鍵字。

# ERR_TypeCharOnGenericParam
source: Type character cannot be used in a type parameter declaration.
cs: V deklaraci parametru typu nejde použít znak typu.
de: Typzeichen können nicht in einer Typparameterdeklaration verwendet werden.
es: El carácter de tipo no se puede usar en una declaración de parámetros de tipo.
fr: Le caractère de type ne peut pas être utilisé dans une déclaration de paramètre de type.
it: Non è possibile usare il carattere tipo in una dichiarazione di parametro di tipo.
ja: 型パラメーターの宣言で型文字を使用することはできません。
ko: 형식 매개 변수 선언에는 형식 문자를 사용할 수 없습니다.
pl: Znaku typu nie można użyć w deklaracji parametru typu.
pt_br: Não é possível usar o caractere de tipo em uma declaração de parâmetro de tipo.
ru: Символ типа нельзя использовать в объявлении параметра-типа.
tr: Tür karakteri tür parametresi bildiriminde kullanılamaz.
zh_hans: 在类型参数声明中不能使用类型字符。
zh_hant: 類型字元無法在類型參數宣告中使用。

# ERR_TooFewGenericArguments1
source: Too few type arguments to '{0}'.
cs: {0} nemá dostatečný počet argumentů typu.
de: Nicht genügend Typargumente für "{0}".
es: Argumentos de tipo insuficientes para '{0}'.
fr: Arguments de type insuffisants dans '{0}'.
it: Il numero di argomenti di tipo per '{0}' è insufficiente.
ja: '{0}' の型引数が少なすぎます。
ko: '{0}'에 대한 형식 인수가 너무 적습니다.
pl: Za mało argumentów typu dla elementu „{0}”.
pt_br: Muito poucos argumentos para "{0}".
ru: Слишком мало аргументов типа в "{0}".
tr: '{0}' için çok az tür bağımsız değişkeni var.
zh_hans: “{0}”的类型参数太少。
zh_hant: '{0}' 的類型引數太少。

# ERR_TooManyGenericArguments1
source: Too many type arguments to '{0}'.
cs: {0} má příliš moc argumentů typu.
de: Zu viele Typargumente für "{0}".
es: Demasiados argumentos de tipo para '{0}'.
fr: Arguments de type trop nombreux dans '{0}'.
it: Il numero di argomenti di tipo per '{0}' è eccessivo.
ja: '{0}' の型引数が多すぎます。
ko: '{0}'에 대한 형식 인수가 너무 많습니다.
pl: Za dużo argumentów typu elementu „{0}”.
pt_br: Muitos argumentos de tipo para "{0}".
ru: Слишком много аргументов типа в "{0}".
tr: '{0}' için çok fazla tür bağımsız değişkeni var.
zh_hans: “{0}”的类型参数太多。
zh_hant: '{0}' 的類型引數太多。

# ERR_GenericConstraintNotSatisfied2
source: Type argument '{0}' does not inherit from or implement the constraint type '{1}'.
cs: Argument {0} nedědí od typu omezení {1} ani ho neimplementuje.
de: Das Typargument "{0}" erbt nicht vom Einschränkungstyp "{1}" bzw. implementiert diesen nicht.
es: El argumento de tipo '{0}' no se hereda del tipo de restricción '{1}' ni lo implementa.
fr: L'argument de type '{0}' n'hérite pas ou n'implémente pas le type de contrainte '{1}'.
it: L'argomento di tipo '{0}' non eredita dal tipo di vincolo '{1}' né lo implementa.
ja: 型引数 '{0}' は、制約型 '{1}' から継承したり、この型を実装したりしません。
ko: '{0}' 형식 인수는 '{1}' 제약 조건 형식에서 상속되지 않거나 이를 구현하지 않습니다.
pl: Argument typu „{0}” nie dziedziczy po typie ograniczenia „{1}” ani nie implementuje go.
pt_br: O argumento de tipo "{0}" não herda de ou implementa o tipo de restrição "{1}".
ru: Аргумент типа "{0}" не наследует или реализует строгий тип "{1}".
tr: '{0}' tür bağımsız değişkeni '{1}' kısıtlama türünden devralamaz veya bu türü uygulayamaz.
zh_hans: 类型参数“{0}”不能继承自或实现约束类型“{1}”。
zh_hant: 類型引數 '{0}' 並未繼承或實作條件約束類型 '{1}'。

# ERR_TypeOrMemberNotGeneric1
source: '{0}' has no type parameters and so cannot have type arguments.
cs: '{0} nemá žádné parametry typu, nemůže proto mít argumenty typu.
de: '"{0}" hat keine Typparameter und kann daher keine Typargumente haben.
es: '{0}' no tiene parámetros de tipo y, por lo tanto, no puede tener argumentos de tipo.
fr: '{0}' n'a pas de paramètres de type et donc ne peut pas avoir d'arguments de type.
it: '{0}' non ha parametri di tipo, quindi non può avere argomenti di tipo.
ja: '{0}' は型パラメーターが指定されてないため、型引数を指定することができません。
ko: '{0}'에는 형식 매개 변수가 없으므로 형식 인수를 사용할 수 없습니다.
pl: 'Element „{0}” nie ma parametrów typu i dlatego nie może mieć argumentów typu.
pt_br: "{0}" não tem parâmetros de tipo e, portanto, não pode ter argumentos de tipo.
ru: "{0}" не имеет параметров типа и поэтому не может иметь аргументов типа.
tr: '{0}' öğesinin tür parametresi olmadığından tür bağımsız değişkenleri olamaz.
zh_hans: '“{0}”没有类型形参，因此不能有类型实参。
zh_hant: '{0}' 沒有類型參數，因此不可有類型引數。

# ERR_NewIfNullOnGenericParam
source: 'New' cannot be used on a type parameter that does not have a 'New' constraint.
cs: 'Klíčové slovo New nejde použít pro parametr typu, který nemá omezení New.
de: '"New" kann nicht für einen Typparameter verwendet werden, der keine New-Einschränkung aufweist.
es: 'New' no se puede usar en un parámetro de tipo que no tenga una restricción 'New'.
fr: 'New' ne peut pas être utilisé pour un paramètre de type qui n'a pas de contrainte 'New'.
it: 'Non è possibile usare 'New' in un parametro di tipo che non ha un vincolo 'New'.
ja: 'New' 制約のない型パラメーターに対して 'New' を使用することはできません。
ko: 'New' 제약 조건이 없는 형식 매개 변수에는 'New'를 사용할 수 없습니다.
pl: 'Elementu New nie można używać w parametrze typu, który nie ma ograniczenia New.
pt_br: 'New' não pode ser utilizado em um parâmetro de tipo que não possui uma restrição 'New'.
ru: '"New" нельзя использовать для параметра-типа, у которого нет ограничения "New".
tr: 'New' kısıtlaması olmayan bir tür parametresinde 'New' kullanılamaz.
zh_hans: '不能在没有 "New" 约束的类型参数上使用 "New"。
zh_hant: 'New' 無法在沒有 'New' 條件約束的類型參數上使用。

# ERR_MultipleClassConstraints1
source: Type parameter '{0}' can only have one constraint that is a class.
cs: Parametr typu {0} může mít jenom jedno omezení, které je třídou.
de: Der {0}-Typparameter kann maximal eine Einschränkung haben, die eine Klasse ist.
es: El parámetro de tipo '{0}' puede tener una restricción que sea una clase.
fr: Le paramètre de type '{0}' ne peut avoir qu'une seule contrainte qui est une classe.
it: Il parametro di tipo '{0}' può avere solo un vincolo costituito da una classe.
ja: 型パラメーター '{0}' には、クラスの制約を 1 つだけ指定できます。
ko: '{0}' 형식 매개 변수는 제약 조건(클래스)을 하나만 포함할 수 있습니다.
pl: Parametr typu „{0}” może mieć tylko jedno ograniczenie, które jest klasą.
pt_br: Parâmetro de tipo "{0}" pode somente ter uma restrição que seja uma classe.
ru: Параметр типа "{0}" может иметь только одно ограничение, которое является классом.
tr: '{0}' tür parametresinde sınıf olan tek bir kısıtlama olabilir.
zh_hans: 类型参数“{0}”只能有一个属于类的约束。
zh_hant: 類型參數 '{0}' 只可有一個為類別的條件約束。

# ERR_ConstNotClassInterfaceOrTypeParam1
source: Type constraint '{0}' must be either a class, interface or type parameter.
cs: Omezení typu {0} musí být třída, rozhraní nebo parametr typu.
de: Die Typeinschränkung "{0}" muss entweder eine Klasse, eine Schnittstelle oder ein Typparameter sein.
es: La restricción de tipo '{0}' debe ser una clase, una interfaz o un parámetro de tipo.
fr: La contrainte de type '{0}' doit être un paramètre de classe, d'interface ou de type.
it: Il vincolo di tipo '{0}' deve essere una classe, un'interfaccia o un parametro di tipo.
ja: 型の制約 '{0}' は、クラス、インターフェイスまたは型パラメーターでなければなりません。
ko: 형식 제약 조건 '{0}'은(는) 클래스, 인터페이스 또는 형식 매개 변수여야 합니다.
pl: Ograniczenie typu „{0}” musi być klasą, interfejsem lub parametrem typu.
pt_br: Tipo de restrição "{0}" deve ser um parâmetro de classe, interface ou tipo.
ru: Тип ограничения "{0}" должен быть классом, интерфейсом или параметром типа.
tr: '{0}' tür kısıtlaması bir sınıf, arabirim veya tür parametresi olmalıdır.
zh_hans: 类型约束“{0}”必须是类、接口或类型参数。
zh_hant: 類型條件約束 '{0}' 必須是類別、介面或類型參數。

# ERR_DuplicateTypeParamName1
source: Type parameter already declared with name '{0}'.
cs: Parametr typu s názvem {0} už je deklarovaný.
de: Ein Typparameter ist bereits mit dem Namen "{0}" deklariert.
es: Ya se ha declarado el parámetro de tipo con el nombre '{0}'.
fr: Le paramètre de type est déjà déclaré avec le nom '{0}'.
it: Il parametro di tipo è già stato dichiarato con il nome '{0}'.
ja: 型パラメーターは名前 '{0}' で既に宣言されています。
ko: 이름이 '{0}'인 형식 매개 변수가 이미 선언되었습니다.
pl: Zadeklarowano już parametr typu o nazwie „{0}”.
pt_br: Parâmetro de tipo já declarado com o nome "{0}".
ru: Параметр типа уже объявлен с именем "{0}".
tr: Tür parametresi '{0}' adıyla zaten bildirildi.
zh_hans: 类型参数已使用名称“{0}”声明。
zh_hant: 類型參數已使用名稱 '{0}' 進行宣告。

# ERR_UnboundTypeParam2
source: Type parameter '{0}' for '{1}' cannot be inferred.
cs: Parametr typu {0} pro {1} nejde odvodit.
de: Der {0}-Typparameter für "{1}" kann nicht per Rückschluss abgeleitet werden.
es: No se puede inferir el parámetro de tipo '{0}' para '{1}'.
fr: Le paramètre de type '{0}' pour '{1}' ne peut pas être déduit.
it: Non è possibile dedurre il parametro di tipo '{0}' per '{1}'.
ja: '{1}' の型パラメーター '{0}' を推論できません。
ko: '{1}'의 형식 매개 변수 '{0}'을(를) 유추할 수 없습니다.
pl: Nie można wywnioskować parametru typu „{0}” dla elementu „{1}”.
pt_br: Parâmetro de tipo "{0}" para "{1}" não pode ser deduzido.
ru: Невозможно получить параметр типа "{0}" для "{1}".
tr: '{1}' için '{0}' tür parametresi çıkarsanamıyor.
zh_hans: 无法推断“{1}”的类型参数“{0}”。
zh_hant: 無法推斷 '{1}' 的類型參數 '{0}'。

# ERR_IsOperatorGenericParam1
source: 'Is' operand of type '{0}' can be compared only to 'Nothing' because '{0}' is a type parameter with no class constraint.
cs: 'Operand Is typu {0} jde porovnat jenom s hodnotou Nothing, protože {0} je parametr typu bez omezení třídy.
de: 'Ein Is-Operand vom Typ "{0}" kann nur mit "Nothing" verglichen werden, da "{0}" ein Typparameter ohne Klasseneinschränkung ist.
es: 'El operando 'Is' de tipo '{0}' solo se puede comparar con 'Nothing' porque '{0}' es un parámetro de tipo sin restricción de clase.
fr: 'L'opérande 'Is' de type '{0}' ne peut être comparé qu'à 'Nothing', car '{0}' est un paramètre de type sans contrainte de classe.
it: 'È possibile confrontare l'operando 'Is' del tipo '{0}' solo con 'Nothing' perché '{0}' è un parametro di tipo senza vincoli di classe.
ja: '{0}' はクラスの制約がない型パラメーターであるため、型 '{0}' の 'Is' オペランドは 'Nothing' とのみ比較できます。
ko: '{0}'은(는) 클래스 제약 조건이 없는 형식 매개 변수이므로 '{0}' 형식의 'Is' 피연산자는 'Nothing'과만 비교할 수 있습니다.
pl: 'Argument operacji „Is” typu „{0}” można porównać tylko z elementem „Nothing”, ponieważ element „{0}” jest parametrem typu bez ograniczenia klasy.
pt_br: 'Operando "Is" do tipo "{0}" pode ser comparado somente a "Nothing" porque "{0}" é um parâmetro de tipo sem restrição de classe.
ru: 'Операнд "Is" типа "{0}" можно сравнивать только с "Nothing", поскольку "{0}" является параметром типа без ограничения класса.
tr: '{0}' sınıf kısıtlaması olmayan bir tür parametresi olduğundan, '{0}' türünün 'Is' işleneni yalnızca 'Nothing' ile karşılaştırılabilir.
zh_hans: '类型“{0}”是没有类约束的类型参数，因此类型“{0}”的“Is”操作数只能与“Nothing”比较。
zh_hant: '類型 '{0}' 的 'Is' 運算元只能與 'Nothing' 進行比較，因為 '{0}' 是沒有類別條件約束的類型參數。

# ERR_ArgumentCopyBackNarrowing3
source: Copying the value of 'ByRef' parameter '{0}' back to the matching argument narrows from type '{1}' to type '{2}'.
cs: Kopírování hodnoty parametru ByRef {0} zpátky na odpovídající argument způsobí zúžení z typu {1} na typ {2}.
de: Das Zurückkopieren des ByRef-Parameters "{0}" in das entsprechende Argument führt zu einer Einschränkung von Typ "{1}" auf Typ "{2}".
es: La copia del valor del parámetro 'ByRef' {0} en el argumento correspondiente se reduce del tipo '{1}' al tipo '{2}'.
fr: La copie de la valeur du paramètre 'ByRef' '{0}' dans l'argument correspondant passe du type '{1}' au type '{2}'.
it: Se si copia il valore del parametro '{0}' di 'ByRef' nell'argomento corrispondente, verrà eseguita la conversione dal tipo '{1}' al tipo più piccolo '{2}'.
ja: ByRef' パラメーター '{0}' の値を一致する引数へ戻してコピーすると、型 '{1}' から型 '{2}' に縮小変換します。
ko: ByRef' 매개 변수 '{0}'의 값을 해당 인수에 다시 복사하면 '{1}' 형식에서 '{2}' 형식으로 축소 변환됩니다.
pl: Kopiowanie wartości parametru „ByRef” „{0}” z powrotem do pasującego argumentu powoduje zawężenie z typu „{1}” do typu „{2}”.
pt_br: Copiar o valor do parâmetro "ByRef" "{0}" de volta para o argumento correspondente reduz do tipo "{1}" para o tipo "{2}".
ru: Копирование значения параметра "ByRef" "{0}" обратно в соответствующий аргумент сводит тип "{1}" к типу "{2}".
tr: ByRef' '{0}' parametresi değerinin eşleşen bağımsız değere geri kopyalanması '{1}' türünden '{2}' türüne daralmaya neden olur.
zh_hans: 将“ByRef”参数“{0}”的值复制回匹配的参数将导致从类型“{1}”到类型“{2}”的收缩。
zh_hant: 將 'ByRef' 參數的值 '{0}' 複製回對稱的引數，會從類型 '{1}' 縮減到 '{2}'。

# ERR_ShadowingGenericParamWithMember1
source: '{0}' has the same name as a type parameter.
cs: '{0} má stejný název jako parametr typu.
de: '"{0}" hat den gleichen Namen wie ein Typparameter.
es: '{0}' tiene el mismo nombre que un parámetro de tipo.
fr: '{0}' porte le même nom qu'un paramètre de type.
it: '{0}' ha lo stesso nome di un parametro di tipo.
ja: '{0}' には型パラメーターとして同じ名前が指定されています。
ko: '{0}'의 이름이 형식 매개 변수와 같습니다.
pl: 'Element „{0}” ma taką samą nazwę jak parametr typu.
pt_br: "{0}" tem o mesmo nome de um parâmetro de tipo.
ru: "{0}" имеет такое же имя, как и параметр типа.
tr: '{0}' öğesi bir tür parametresiyle aynı ada sahip.
zh_hans: '“{0}”与一个类型参数同名。
zh_hant: '{0}' 與類型參數擁有相同的名稱。

# ERR_GenericParamBase2
source: {0} '{1}' cannot inherit from a type parameter.
cs: {0} {1} nemůže dědit z parametru typu.
de: {0} "{1}" kann nicht von einem Typparameter erben.
es: {0} '{1}' no se puede heredar de un parámetro de tipo.
fr: {0} '{1}' ne peut pas hériter d'un paramètre de type.
it: {0} '{1}' non può ereditare da un parametro di tipo.
ja: {0} '{1}' は、型パラメーターから継承することはできません。
ko: {0} '{1}'은(는) 형식 매개 변수에서 상속할 수 없습니다.
pl: Element {0} „{1}” nie może dziedziczyć po parametrze typu.
pt_br: {0} "{1}" não pode herdar de um parâmetro de tipo.
ru: {0} "{1}" не может наследовать от параметра типа.
tr: {0} '{1}', tür parametresinden devralamaz.
zh_hans: {0}“{1}”不能从类型参数中继承。
zh_hant: {0} '{1}' 無法繼承自類型參數。

# ERR_ImplementsGenericParam
source: Type parameter not allowed in 'Implements' clause.
cs: Parametr typu není v klauzuli Implements povolený.
de: Ein Typparameter ist in einer Implements-Klausel nicht zulässig.
es: Parámetro de tipo no permitido en la cláusula 'Implements'.
fr: Le paramètre de type n'est pas autorisé dans la clause 'Implements'.
it: Il parametro di tipo non è consentito nella clausola 'Implements'.
ja: 型パラメーターは 'Implements' 句では使用できません。
ko: Implements' 절에는 형식 매개 변수를 사용할 수 없습니다.
pl: Parametr typu niedozwolony w klauzuli Implements.
pt_br: Parâmetro de tipo não permitido na cláusula 'Implements'.
ru: Параметр-тип нельзя использовать в предложении "Implements".
tr: Implements' yan tümcesinde tür parametresine izin verilmez.
zh_hans: “Implements”子句中不允许类型参数。
zh_hant: Implements' 子句中不允許類型參數。

# ERR_OnlyNullLowerBound
source: Array lower bounds can be only '0'.
cs: Spodní hranice pole může být jenom 0.
de: Untere Arraybegrenzung kann nur "0" sein.
es: Los límites inferiores de la matriz solo pueden ser '0'.
fr: Les limites inférieures du tableau ne peuvent être que '0'.
it: I limiti inferiori della matrice possono essere solo '0'.
ja: 配列の下限に指定できるのは '0' のみです。
ko: 배열 하한으로는 '0'만 사용할 수 있습니다.
pl: Dolne granice tablicy mogą mieć tylko wartość „0”.
pt_br: O limite inferior de matrizes deve ser somente '0'.
ru: Нижняя граница массива должна равняться 0.
tr: Dizi alt sınırları yalnızca '0' olabilir.
zh_hans: 数组的下限只能是“0”。
zh_hant: 陣列的下限只能是 '0'。
