Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ForLoopOperatorRequired2
source: Type '{0}' must define operator '{1}' to be used in a 'For' statement.
cs: Typ {0} musí definovat operátor {1}, aby ho bylo možné použít v příkazu For.
de: Der Typ "{0}" muss den {1}-Operator definieren, der in einer For-Anweisung verwendet werden soll.
es: El tipo '{0}' debe definir el operador '{1}' que se va a usar en una instrucción 'For'.
fr: Le type '{0}' doit définir l'opérateur '{1}' à utiliser dans une instruction 'For'.
it: Il tipo '{0}' deve definire l'operatore '{1}' per poter essere usato in un'istruzione 'For'.
ja: 型 '{0}' を 'For' ステートメントで使用するには、演算子 '{1}' を定義しなければなりません。
ko: '{0}' 형식은 'For' 문에서 사용할 '{1}' 연산자를 정의해야 합니다.
pl: Typ „{0}” musi definiować operator „{1}”, aby można było go używać w instrukcji „For”.
pt_br: Tipo "{0}" deve definir o operador "{1}" a ser usado em uma instrução "For".
ru: Тип "{0}" должен определять оператор "{1}" для использования в операторе "For".
tr: '{0}' türü, 'For' deyiminde kullanılacak '{1}' işlecini tanımlamalıdır.
zh_hans: 类型“{0}”必须定义运算符“{1}”，才能在“For”语句中使用。
zh_hant: 類型 '{0}' 必須定義要用於 'For' 陳述式中的運算子 '{1}'。

# ERR_UnacceptableForLoopOperator2
source: Return and parameter types of '{0}' must be '{1}' to be used in a 'For' statement.
cs: Typy vrácených hodnot a parametrů pro {0} musí být {1}, aby je bylo možné použít v příkazu For.
de: Rückgabe- und Parametertypen von "{0}" müssen "{1}" sein, damit sie in einer For-Anweisung verwendet werden können.
es: Los tipos de valor devuelto y de parámetro de '{0}' deben ser '{1}' para usarse en una expresión 'For'.
fr: Les types de retour et de paramètres de '{0}' doivent être '{1}' pour être utilisés dans une instruction 'For'.
it: I tipi restituiti e i tipi di parametro di '{0}' devono essere '{1}' per poter essere usati in un'istruzione 'For'.
ja: '{0}' の戻り値型およびパラメーター型は、'For' ステートメントで使用するためには '{1}' でなければなりません。
ko: '{0}'의 반환 및 매개 변수 형식은 'For' 문에서 사용할 '{1}'이어야 합니다.
pl: Typy zwracane i typy parametrów „{0}” muszą być typu „{1}”, aby można było używać ich w instrukcji „For”.
pt_br: Tipos de retorno e de parâmetro de "{0}" devem ser "{1}" para serem usados em uma instrução "For".
ru: Типы возврата и параметров "{0}" должны быть "{1}" для использования в операторе "For".
tr: For' deyiminde kullanılabilmesi için, '{0}' dönüş ve parametre türleri '{1}' olmalıdır.
zh_hans: “{0}”的返回类型和参数类型必须是“{1}”，才能在“For”语句中使用。
zh_hant: '{0}' 的傳回類型與參數類型必須是 '{1}'，才可用在 'For' 陳述式中。

# ERR_UnacceptableForLoopRelOperator2
source: Parameter types of '{0}' must be '{1}' to be used in a 'For' statement.
cs: Typy parametru {0} musí být {1}, aby je bylo možné použít v příkazu For.
de: Parametertypen von "{0}" müssen "{1}" sein, damit sie in einer For-Anweisung verwendet werden können.
es: Los tipos de parámetro de '{0}' deben ser '{1}' para usarse en una expresión 'For'.
fr: Les types de paramètres de '{0}' doivent être '{1}' pour être utilisés dans une instruction 'For'.
it: I tipi di parametro di '{0}' devono essere '{1}' per poter essere usati in un'istruzione 'For'.
ja: パラメーター型 '{0}' を 'For' ステートメントで使用するには、'{1}' でなければなりません。
ko: '{0}'의 매개 변수 형식은 'For' 문에서 사용할 '{1}'이어야 합니다.
pl: Typy parametru „{0}” muszą być typu „{1}”, aby można było ich użyć w instrukcji 'For'.
pt_br: Tipos de parâmetro de "{0}" deve ser "{1}" para serem usados em uma instrução "For".
ru: Типы параметров "{0}" должны быть "{1}" для использования в операторе "For".
tr: For' deyiminde kullanılabilmesi için, '{0}' parametre türleri '{1}' olmalıdır.
zh_hans: “{0}”的参数类型必须是“{1}”，才能在“For”语句中使用。
zh_hant: '{0}' 的參數類型必須是 '{1}'，才可用在 'For' 陳述式中。

# ERR_OperatorRequiresIntegerParameter1
source: Operator '{0}' must have a second parameter of type 'Integer' or 'Integer?'.
cs: Operátor {0} musí mít druhý operátor typu Integer nebo Integer?.
de: Der {0}-Operator muss einen zweiten Parameter vom Typ "Integer" oder "Integer?" aufweisen.
es: El operador '{0}' debe tener un segundo parámetro de tipo 'Integer' o 'Integer?'.
fr: L'opérateur '{0}' doit avoir un second paramètre de type 'Integer' ou 'Integer?'.
it: L'operatore '{0}' deve avere un secondo parametro di tipo 'Integer' o 'Integer?'.
ja: 演算子 '{0}' には、型 'Integer' または型 'Integer?' の第 2 パラメーターを指定しなければなりません。
ko: '{0}' 연산자의 두 번째 매개 변수 형식은 'Integer' 또는 'Integer?'여야 합니다.
pl: Operator „{0}” musi mieć drugi parametr typu „Integer” lub „Integer?”.
pt_br: Operador "{0}" deve ter um segundo parâmetro de tipo "Interger" ou "Integer?".
ru: Оператор "{0}" должен иметь второй параметр типа "Integer" или "Integer?".
tr: '{0}' işlecinin 'Integer' veya 'Integer?' türünde ikinci bir parametresi olmalıdır.
zh_hans: 运算符“{0}”必须有另一个“Integer”或“Integer?”类型的参数。
zh_hant: 運算子 '{0}' 的第二個參數類型必須為 'Integer' 或 'Integer?'。

# ERR_CantSpecifyNullableOnBoth
source: Nullable modifier cannot be specified on both a variable and its type.
cs: Modifikátor Nullable nejde použít u proměnné i jejího typu.
de: Modifizierer, die NULL-Werte zulassen, können nicht für eine Variable und ihren Typ gleichzeitig festgelegt werden.
es: No se puede especificar un modificador que acepte valores NULL en una variable y en su tipo a la vez.
fr: Impossible de spécifier un modificateur autorisant les valeurs Null pour la variable et son type.
it: Non è possibile specificare il modificatore nullable sia nella variabile che nel tipo.
ja: 変数とその型の両方で、Null 許容修飾子を指定することはできません。
ko: 변수와 그 형식 모두에 null 허용 한정자를 지정할 수 없습니다.
pl: Modyfikator dopuszczający wartość null nie może być określony jednocześnie w zmiennej i jej typie.
pt_br: Não é possível especificar o modificador anulável em uma variável e seu tipo.
ru: Модификатор, допускающий значений NULL, не может быть одновременно применен к переменной и ее типу.
tr: Null yapılabilir değiştirici hem değişken hem de değişkenin türü üzerinde belirtilemez.
zh_hans: 不能在变量及其类型上同时指定可以为 null 的修饰符。
zh_hant: 無法同時在變數及其類型上指定可為 Null 的修飾元。

# ERR_BadTypeArgForStructConstraintNull
source: Type '{0}' must be a value type or a type argument constrained to 'Structure' in order to be used with 'Nullable' or nullable modifier '?'.
cs: Typ {0} musí být typ hodnoty nebo argument typu s omezením Structure, aby jej bylo možné použít s klíčovým slovem Nullable nebo s modifikátorem ? připouštějícím hodnotu null.
de: Der Typ "{0}" muss ein Werttyp oder ein Typargument sein, das auf "Structure" eingeschränkt ist, damit er mit "Nullable" oder dem Modifizierer "?", der NULL-Werte zulässt, verwendet werden kann.
es: El tipo '{0}' debe ser un tipo de valor o un argumento de tipo restringido a 'Structure' para poder usarlo con 'Nullable' o el modificador '?' que acepta valores NULL.
fr: Le type '{0}' doit être un type valeur ou un argument de type limité à 'Structure' pour pouvoir être utilisé avec 'Nullable' ou le modificateur autorisant les valeurs Null '?'.
it: Il tipo '{0}' deve essere un tipo valore o un argomento di tipo vincolato a 'Structure' per poter essere usato con 'Nullable' o con il modificatore nullable '?'.
ja: Nullable' または Null 許容修飾子 '?' と共に使用するためには、型 '{0}' は 'Structure' に制約されている値型または型引数である必要があります。
ko: '{0}' 형식을 'Null 허용' 또는 null 허용 한정자 '?'와 함께 사용하려면 해당 형식이 'Structure'의 제약을 받는 형식 인수이거나 값 형식이어야 합니다.
pl: Typ „{0}” musi być typem wartości lub typem argumentu ograniczonym do elementu „Structure”, aby można go było używać z modyfikatorem „Nullable” lub modyfikatorem dopuszczającym wartość null „?”.
pt_br: Tipo "{0}" deve ser um tipo de valor ou um argumento de tipo restrito a "Structure" para ser usado com "Nullable" ou o modificador anulável "?".
ru: Тип "{0}" должен быть типом значения или аргументом типа, ограниченным "Structure" для использования с "Nullable" или с модификатором "?", допускающим значение Null.
tr: Nullable' ile veya '?' null yapılabilir değiştiriciyle kullanılabilmesi için, '{0}' türünün bir değer türü olması veya 'Structure' ile kısıtlanmış bir tür bağımsız değişkeni olması gerekir.
zh_hans: 类型“{0}”必须是一个被约束为“Structure”的值类型或类型参数，才能与“Nullable”或可以为 null 的修饰符“?”一起使用。
zh_hant: 類型 '{0}' 必須是實值類型或已限制為 'Structure' 的類型引數，才可與 'Nullable' 或可為 Null 的修飾元 '?' 搭配使用。

# ERR_CantSpecifyArrayAndNullableOnBoth
source: Nullable modifier '?' and array modifiers '(' and ')' cannot be specified on both a variable and its type.
cs: Modifikátor ? připouštějící hodnotu Null a modifikátory pole ( a ) nejde zadat u proměnné i u jejího typu.
de: Der Modifizierer "?", der NULL-Werte zulässt, und die Arraymodifizierer "(" und ")" können nicht für eine Variable und ihren Typ gleichzeitig festgelegt werden.
es: El modificador '?' que acepta valores NULL y los modificadores de matriz '(' y ')' no se pueden especificar en una variable y su tipo a la vez.
fr: Impossible de spécifier le modificateur autorisant les valeurs Null '?' ainsi que les modificateurs de tableau '(' et ')' pour la variable et son type.
it: Non è possibile specificare il modificatore nullable '?' e i modificatori di matrici '(' e ')' sia nella variabile che nel relativo tipo.
ja: 変数とその型の両方で、Null 許容修飾子 '?' と配列修飾子 '(' および ')' を指定することはできません。
ko: 변수와 그 형식 모두에 null 허용 한정자 '?'와 배열 한정자 '(' 및 ')'를 지정할 수 없습니다.
pl: Modyfikator dopuszczający wartość null „?” oraz modyfikatory tablicy „(” i „)” nie mogą być określone jednocześnie w zmiennej i jej typie.
pt_br: Não é possível especificar o modificador anulável '?' e os modificadores de matriz '(' e ')' em uma variável e seu tipo.
ru: Модификатор "?", допускающий значения NULL, и модификаторы массива "(" и ")" не могут быть применены к переменной и ее типу.
tr: ?' null yapılabilir değiştiricisiyle '(' ve ')' dizi değiştiricileri hem değişken hem de değişkenin türü üzerinde belirtilemez.
zh_hans: 不能在变量及其类型上同时指定可为 null 的修饰符“?”和数组修饰符“(”/“)”。
zh_hant: 無法同時在變數及其類型上指定可為 Null 的修飾元 '?' 以及陣列修飾元 '(' 和 ')'。

# ERR_CantSpecifyTypeCharacterOnIIF
source: Expressions used with an 'If' expression cannot contain type characters.
cs: Výrazy použité s výrazem If nemůžou obsahovat znaky typu.
de: Ausdrücke, die mit einem If-Ausdruck verwendet werden, dürfen keine Typzeichen enthalten.
es: Las expresiones que se usan con una expresión 'If' no pueden contener caracteres de tipo.
fr: Les expressions utilisées avec une expression 'If' ne peuvent pas contenir de caractères de type.
it: Le espressioni usate con un'espressione 'If' non possono contenere caratteri tipo.
ja: If' 式で使用する式に、型文字を含めることはできません。
ko: If' 식을 사용한 식은 형식 문자를 포함할 수 없습니다.
pl: Wyrażenia używane w wyrażeniu „If” nie mogą zawierać znaków typu.
pt_br: Expressões usadas com uma expressão "If" não podem conter caracteres de tipo.
ru: Выражения, используемые с выражением "If", не могут содержать символы типа.
tr: If' ifadesiyle birlikte kullanılan ifadeler tür karakterleri içeremez.
zh_hans: 与“If”表达式一起使用的表达式不能包含类型字符。
zh_hant: 與 'If' 運算式一併使用的運算式，不可包含類型字元。

# ERR_IllegalOperandInIIFName
source: 'If' operands cannot be named arguments.
cs: 'Operandy operátoru If nemůžou být pojmenované argumenty.
de: 'If-Operanden dürfen keine benannten Argumente sein.
es: 'Los operandos 'If' no pueden ser argumentos con nombre.
fr: 'Les opérandes 'If' ne peuvent pas être des arguments nommés.
it: 'Gli operandi 'If' non possono essere argomenti denominati.
ja: 'If' オペランドを名前付き引数にすることはできません。
ko: 'If' 피연산자는 명명된 인수일 수 없습니다.
pl: 'Argumenty operatora „If” nie mogą być nazwanymi argumentami.
pt_br: 'Os operandos 'If' não podem ser argumentos nomeados.
ru: 'Операндами "If" не могут быть именованные аргументы.
tr: 'If' işleçleri adlandırılmış bağımsız değişkenler olamaz.
zh_hans: '“If”操作数不能是命名参数。
zh_hant: 'If' 運算元不能是具名引數。

# ERR_IllegalOperandInIIFConversion
source: Cannot infer a common type for the second and third operands of the 'If' operator. One must have a widening conversion to the other.
cs: Nejde odvodit společný typ pro druhý a třetí operand operátoru If. Typ jednoho z nich musí umožňovat rozšiřující konverzi na druhý.
de: Es kann kein gemeinsamer Typ für den zweiten und dritten Operanden des If-Operators abgeleitet werden. Es muss eine erweiternde Konvertierung von einem Typ in den anderen durchgeführt werden.
es: No se puede inferir un tipo común para los operandos segundo y tercero del operador 'If'. Uno de ellos debe tener una conversión de ampliación que lo convierta en el otro.
fr: Impossible de déduire un type commun pour le second et le troisième opérandes de l'opérateur 'If'. L'un doit avoir une conversion étendue vers l'autre.
it: Non è possibile dedurre un tipo comune per il secondo e il terzo operando dell'operatore 'If'. Uno deve avere una conversione che supporta un maggior numero di dati rispetto all'altro.
ja: If' 演算子の 2 番目と 3 番目のオペランドの共通型を推論できません。一方の型から他方の型への拡大変換が必要です。
ko: If' 연산자의 두 번째, 세 번째 피연산자에 대한 공용 형식을 유추할 수 없습니다. 하나가 다른 하나에 대해 확대 변환을 해야 합니다.
pl: Nie można wywnioskować wspólnego typu dla drugiego i trzeciego argumentu operacji operatora „If”. Jeden musi umożliwiać konwersję rozszerzającą do drugiego.
pt_br: Não é possível inferir um tipo comum para o segundo e terceiro operandos do operador "If". Um deve ter uma conversão de expansão para o outro.
ru: Не удается определить общий тип второго и третьего операнда бинарного оператора "If". Один из них должен иметь расширяющее преобразование в другой.
tr: If' işlecinin ikinci ve üçüncü işlenenleri için ortak tür çıkarsanamaz. Birinin diğerine genişletme dönüştürmesi olmalıdır.
zh_hans: 无法推断“If”运算符的第二个和第三个操作数的通用类型。其中一个必须是另一个的扩大转换。
zh_hant: 無法推斷 'If' 運算子的第二個和第三個運算元之一般類型。一個運算元必須要能夠放大轉換成另一個運算元。

# ERR_IllegalCondTypeInIIF
source: First operand in a binary 'If' expression must be a nullable value type, a reference type, or an unconstrained generic type.
cs: První operand v binárním výrazu If musí být typu, který připouští hodnotu Null, nebo typu odkazu.
de: Der erste Operand in einem binären If-Ausdruck muss ein Typ, der NULL-Werte zulässt, oder ein Referenztyp sein.
es: El primer operando de una expresión "If" binaria debe ser un tipo de valor que acepte valores NULL, un tipo de referencia o un tipo genérico sin restricciones.
fr: Le premier opérande d'une expression 'If' binaire doit être un type valeur Nullable, un type référence ou un type générique sans contrainte.
it: Il primo operando in un'espressione 'If' binaria deve essere un tipo valore nullable, un tipo riferimento o un tipo generico senza vincoli.
ja: バイナリ 'If' 式の最初のオペランドは Null 許容または参照型である必要があります。
ko: If' 이항 식의 첫 번째 피연산자는 nullable이거나 참조 형식이어야 합니다.
pl: Pierwszy operand w binarnym wyrażeniu „If” musi być typem wartości dopuszczającym wartość null, typem referencyjnym lub typem ogólnym bez ograniczeń.
pt_br: O primeiro operando em uma expressão binária 'If' precisa ser um tipo de valor que permite valor nulo, um tipo de referência ou um tipo genérico irrestrito.
ru: Первым операндом в бинарном выражении "If" должен быть тип, допускающий значения NULL, или ссылочный тип.
tr: İkili bir 'If' ifadesindeki ilk işlenen null yapılabilmeli veya bir başvuru türü olmalıdır.
zh_hans: 二进制“If”表达式中的第一个操作数必须是可以为 null 的类型或引用类型。
zh_hant: 二進位 'If' 運算式的第一個運算元必須是可為 Null 或是參考類型。

# ERR_CantCallIIF
source: 'If' operator cannot be used in a 'Call' statement.
cs: 'Operátor If se nedá použít v příkazu Call.
de: 'If-Operator kann in einer Call-Anweisung nicht verwendet werden.
es: 'El operador 'If' no se puede usar en una instrucción 'Call'.
fr: 'L'opérateur 'If' ne peut pas être utilisé dans une instruction 'Call'.
it: 'Non è possibile usare l'operatore 'If' in un'istruzione 'Call'.
ja: 'If' 演算子を 'Call' ステートメントの中で使用することはできません。
ko: 'If' 연산자는 'Call' 문에서 사용할 수 없습니다.
pl: Operatora „If” nie można użyć w instrukcji „Call”.
pt_br: 'Operador "If" não pode ser usado em uma instrução "Call".
ru: 'Оператор "If" не может использоваться в операторе "Call".
tr: 'If' işleci 'Call' deyiminde kullanılamaz.
zh_hans: '“If”运算符不能在“Call”语句中使用。
zh_hant: 'If' 運算子無法用於 'Call' 陳述式中。

# ERR_CantSpecifyAsNewAndNullable
source: Nullable modifier cannot be specified in variable declarations with 'As New'.
cs: V deklaracích proměnné s klíčovým slovem As New nejde použít modifikátor Nullable.
de: In Variablendeklarationen mit "As New" darf kein Modifizierer angegeben werden, der NULL-Werte zulässt.
es: No se puede especificar un modificador que acepte valores NULL en declaraciones de variable con 'As New'.
fr: Impossible de spécifier un modificateur autorisant les valeurs Null dans les déclarations de variable avec 'As New'.
it: Non è possibile specificare un modificatore nullable in dichiarazioni di variabili con 'As New'.
ja: As New' を含む変数宣言で null 許容修飾子を指定することはできません。
ko: As New'를 사용하는 변수 선언에는 null 허용 한정자를 지정할 수 없습니다.
pl: Modyfikator dopuszczający wartość null nie może być określany w deklaracjach zmiennych za pomocą instrukcji „As New”.
pt_br: Não é possível especificar o modificador anulável em declarações de variável com 'As New'.
ru: Модификатор, допускающий значения NULL, не может быть задан в объявлениях переменных с "As New".
tr: Null yapılabilir değiştirici 'As New' bulunan değişken bildirimlerinde belirtilemez.
zh_hans: 在变量声明中不能用“As New”指定可以为 null 的修饰符。
zh_hant: 包含 'As New' 的變數宣告中不能指定可為 Null 的修飾元。

# ERR_IllegalOperandInIIFConversion2
source: Cannot infer a common type for the first and second operands of the binary 'If' operator. One must have a widening conversion to the other.
cs: Nejde odvodit společný typ pro první a druhý operand binárního operátoru If. Typ jednoho z nich musí umožňovat rozšiřující konverzi na druhý.
de: Es kann kein gemeinsamer Typ für den ersten und zweiten Operanden des binären If-Operators abgeleitet werden. Es muss eine erweiternde Konvertierung von einem Typ in den anderen durchgeführt werden.
es: No se puede inferir un tipo común para los operandos primero y segundo del operador 'If' binario. Uno de ellos debe tener una conversión de ampliación que lo convierta en el otro.
fr: Impossible de déduire un type commun pour le premier et le second opérandes de l'opérateur 'If' binaire. L'un doit avoir une conversion étendue vers l'autre.
it: Non è possibile dedurre un tipo comune per il primo e il secondo operando dell'operatore 'If'. Uno deve avere una conversione che supporta un maggior numero di dati rispetto all'altro.
ja: バイナリ 'If' 演算子の 1 番目と 2 番目のオペランドの共通型を推論できません。一方の型から他方の型への拡大変換が必要です。
ko: 이진 'If' 연산자의 첫 번째, 두 번째 피연산자에 대한 공용 형식을 유추할 수 없습니다. 하나가 다른 하나에 대해 확대 변환을 해야 합니다.
pl: Nie można wywnioskować wspólnego typu dla pierwszego i drugiego argumentu operacji binarnego operatora „If”. Jeden musi umożliwiać konwersję rozszerzającą do drugiego.
pt_br: Não é possível inferir um tipo comum para o primeiro e segundo operandos do operador "If" binário. Um deve ter uma conversão de expansão para o outro.
ru: Не удается определить общий тип первого и второго операнда бинарного оператора "If". Один из них должен иметь расширяющее преобразование в другой.
tr: İkili 'If' işlecinin birinci ve ikinci işlenenleri için ortak tür çıkarsanamaz. Birinin diğerine genişletme dönüştürmesi olmalıdır.
zh_hans: 无法推断二元“If”运算符的第一个和第二个操作数的通用类型。其中一个必须是另一个的扩大转换。
zh_hant: 無法推斷二元 'If' 運算子的第一個和第二個運算元之一般類型。一個運算元必須要能夠放大轉換成另一個運算元。

# ERR_BadNullTypeInCCExpression
source: Nullable types are not allowed in conditional compilation expressions.
cs: Ve výrazech podmíněné kompilace nejsou povolené typy připouštějící hodnotu Null.
de: Typen, die NULL-Werte zulassen, sind in Ausdrücken für die bedingte Kompilierung nicht zulässig.
es: No se permiten tipos que acepten valores NULL en expresiones de compilación condicionales.
fr: Les types Nullable ne sont pas autorisés dans les expressions de compilation conditionnelles.
it: I tipi nullable non sono consentiti nelle espressioni di compilazione condizionale.
ja: 条件付きコンパイル式では null 許容型を使用できません。
ko: 조건부 컴파일 식에는 nullable 형식을 사용할 수 없습니다.
pl: Typy dopuszczające wartości null nie są dozwolone w wyrażeniach kompilacji warunkowej.
pt_br: Tipos anuláveis não são permitidos em expressões de compilação condicional.
ru: Типы, допускающие значения NULL, нельзя использовать в выражениях условной компиляции.
tr: Koşullu derleme ifadelerinde boş değer atanabilir türlere izin verilmez.
zh_hans: 在条件编译表达式中不允许有可以为 null 的类型。
zh_hant: 條件式編譯運算式中不可使用可為 Null 的類型。

# ERR_NullableImplicit
source: Nullable modifier cannot be used with a variable whose implicit type is 'Object'.
cs: U proměnné s implicitním typem Object nejde použít modifikátor Nullable.
de: In einer Variablen, deren impliziter Typ "Object" ist, darf kein Modifizierer, der NULL-Werte zulässt, verwendet werden.
es: No se puede usar un modificador que acepte valores Null con una variable cuyo tipo implícito sea 'Object'.
fr: Impossible d'utiliser un modificateur autorisant les valeurs Null avec une variable dont le type implicite est 'Object'.
it: Non è possibile usare il modificatore nullable con una variabile il cui tipo implicito è 'Object'.
ja: Null 許容修飾子は、暗黙的な型が 'Object' である変数と共に使用することはできません。
ko: null 허용 한정자는 암시적 형식이 'Object'인 변수와 함께 사용할 수 없습니다.
pl: Modyfikator dopuszczający wartość null nie może być używany ze zmienną, której typem niejawnym jest „Object”.
pt_br: Não é possível usar o modificador anulável com uma variável cujo tipo implícito é 'Object'.
ru: Модификатор, допускающий значения NULL, не может быть использован с переменной, чьим неявным типом является "Object".
tr: Nullable değiştiricisi, örtük türü 'Object' olan bir değişkenle kullanılamaz.
zh_hans: 可以为 null 的修饰符不能与隐式类型为 "Object" 的变量一起使用。
zh_hant: 可為 Null 的修飾元不能用於隱含類型為 'Object' 的變數。

# ERR_MissingRuntimeHelper
source: Requested operation is not available because the runtime library function '{0}' is not defined.
cs: Požadovaná operace není k dispozici, protože není definovaná funkce běhové knihovny {0}.
de: Der angeforderte Vorgang ist nicht möglich, da die {0}-Funktion der Laufzeitbibliothek nicht definiert ist.
es: La operación solicitada no está disponible porque no está definida la función de biblioteca en tiempo de ejecución '{0}'.
fr: L'opération demandée n'est pas disponible, car la fonction de la bibliothèque runtime '{0}' n'est pas définie.
it: L'operazione richiesta non è disponibile perché la funzione '{0}' della libreria di runtime non è definita.
ja: ランタイム ライブラリ関数 '{0}' が定義されていないため、要求された操作を実行できません。
ko: '{0}' 런타임 라이브러리 함수가 정의되어 있지 않아 요청한 작업을 수행할 수 없습니다.
pl: Żądana operacja jest niedostępna, ponieważ funkcja biblioteki uruchomieniowej „{0}” nie jest zdefiniowana.
pt_br: Operação solicitada não está disponível porque a função de biblioteca em tempo de execução "{0}" não está definida.
ru: Запрошенная операция недоступна, поскольку не определена функция библиотеки среды выполнения "{0}".
tr: Çalışma zamanı kitaplığı işlevi '{0}' tanımlanmadığından istenen işlem kullanılamıyor.
zh_hans: 所请求的操作不可用，因为没有定义运行库函数“{0}”。
zh_hant: 因為未定義執行階段程式庫函式 '{0}'，所以無法進行要求的作業。

# ERR_ExpectedDotAfterGlobalNameSpace
source: 'Global' must be followed by '.' and an identifier.
cs: 'Za klíčovým slovem Global musí být tečka (.) a identifikátor.
de: 'Auf "Global" müssen "." und ein Bezeichner folgen.
es: 'Global' debe ir seguido de '.' y un identificador.
fr: 'Global' doit être suivi par '.' et un identificateur.
it: 'Global' deve essere seguito da '.' e da un identificatore.
ja: 'Global' の後には、'.' および識別子が必要です。
ko: 'Global' 다음에는 '.'과 식별자가 와야 합니다.
pl: 'Po elemencie „Global” musi wystąpić znak „.” i identyfikator.
pt_br: 'Global' deve ser seguido por um '.' e um identificador.
ru: 'За "Global" должны идти "." и идентификатор.
tr: 'Global' öğesinin arkasından '.' ve bir tanımlayıcı gelmelidir.
zh_hans: '“Global”的后面必须跟有“.”和标识符。
zh_hant: '在 'Global' 之後必須接著 '.' 及一個識別項。
