Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_MissingAsClauseinVarDecl
source: Variable declaration without an 'As' clause; type of Object assumed.
cs: Deklarace proměnné bez klauzule As; předpokládá se typ Object.
de: Variablendeklaration ohne As-Klausel. Typ "Object" wird angenommen.
es: Declaración de variable sin una cláusula 'As'; se supone el tipo de Object.
fr: Déclaration de variable sans clause 'As' ; type Object pris par défaut.
it: Dichiarazione di variabile senza una clausola 'As'. Verrà usato il tipo Object.
ja: As' 句のない変数宣言です。Object 型と見なされます。
ko: 변수 선언에 'As' 절이 없습니다. Object 형식으로 간주합니다.
pl: Deklaracja zmiennej bez klauzuli „As”; przyjęto typ Object.
pt_br: Declaração de variável sem cláusula 'As'; tipo Object presumido.
ru: Переменная объявлена без предложения "As"; предполагаемый тип — Object.
tr: Değişken bildiriminde 'As' yan tümcesi yok; Object türü varsayıldı.
zh_hans: 变量声明没有 "As" 子句；假定为 Object 类型。
zh_hant: 沒有 'As' 子句的變數宣告; 假設是 Object 的類型。

# WRN_MissingAsClauseinVarDecl_Title
source: Variable declaration without an 'As' clause
cs: Deklarace proměnné bez klauzule As
de: Variablendeklaration ohne "As"-Klausel
es: Declaración de variable sin cláusula 'As'
fr: Déclaration de variable sans clause 'As'
it: Dichiarazione di variabile senza una clausola 'As'
ja: As' 句のない変数の宣言です
ko: As' 절이 없는 변수 선언
pl: Deklaracja zmiennej bez klauzuli „As”
pt_br: Declaração de variável sem uma cláusula 'As'
ru: Объявление переменной без предложения As
tr: Değişken bildiriminde 'As' yan tümcesi yok
zh_hans: 变量声明没有 "As" 子句
zh_hant: 變數宣告沒有 'As' 子句

# WRN_MissingAsClauseinFunction
source: Function without an 'As' clause; return type of Object assumed.
cs: Funkce bez klauzule As; předpokládá se návratový typ Object.
de: Funktion ohne As-Klausel. Rückgabetyp "Object" wird angenommen.
es: Función sin una cláusula 'As'; se supone un tipo de valor devuelto de Object.
fr: Fonction sans clause 'As' ; type de retour Object pris par défaut.
it: Funzione senza una clausola 'As'. Verrà usato il tipo restituito Object.
ja: As' 句のない関数です。戻り値は Object 型と見なされます。
ko: 함수에 'As' 절이 없습니다. Object 반환 형식으로 간주합니다.
pl: Funkcja bez klauzuli „As”; przyjęto zwracany typ Object.
pt_br: Função sem cláusula 'As'; tipo de retorno Object presumido.
ru: Функция без предложения "As"; предполагаемый возвращаемый тип — Object.
tr: İşleçte 'As' yan tümcesi yok; Object dönüş türü varsayıldı.
zh_hans: 函数没有 "As" 子句；假定返回类型为 Object。
zh_hant: 沒有 'As' 子句的函式; 假設是 Object 的傳回類型。

# WRN_MissingAsClauseinFunction_Title
source: Function without an 'As' clause
cs: Funkce bez klauzule As
de: Funktion ohne "As"-Klausel
es: Función sin cláusula 'As'
fr: Fonction sans clause 'As'
it: Funzione senza una clausola 'As'
ja: As' 句のない関数です
ko: As' 절이 없는 함수
pl: Funkcja bez klauzuli „As”
pt_br: Função sem uma cláusula 'As'
ru: Функция без предложения As
tr: İşlevde 'As' yan tümcesi yok
zh_hans: 函数没有 "As" 子句
zh_hant: 函式沒有 'As' 子句

# WRN_MissingAsClauseinProperty
source: Property without an 'As' clause; type of Object assumed.
cs: Vlastnost bez klauzule As; předpokládá se typ Object.
de: Eigenschaft ohne As-Klausel; Typ "Object" wird angenommen.
es: La propiedad no tiene una cláusula 'As'; se supone el tipo de Object.
fr: Propriété sans clause 'As' ; type Object pris par défaut.
it: Proprietà senza una clausola 'As'. Verrà usato il tipo Object.
ja: As' 句のないプロパティです。Object 型と見なされます。
ko: 속성에 'As' 절이 없습니다. Object 형식으로 간주합니다.
pl: Właściwość bez klauzuli „As”; przyjęto typ Object.
pt_br: Propriedade sem cláusula 'As'; tipo Object presumido.
ru: Свойство без предложения "As"; предполагаемый тип — Object.
tr: Özellikte 'As' yan tümcesi yok; Object türü varsayıldı.
zh_hans: 属性没有 "As" 子句；假定为 Object 类型。
zh_hant: 沒有 'As' 子句的屬性; 假設是 Object 的類型。

# WRN_MissingAsClauseinProperty_Title
source: Property without an 'As' clause
cs: Vlastnost bez klauzule As
de: Eigenschaft ohne "As"-Klausel
es: Propiedad sin cláusula 'As'
fr: Propriété sans clause 'As'
it: Proprietà senza una clausola 'As'
ja: As' 句のないプロパティです
ko: As' 절이 없는 속성
pl: Właściwość bez klauzuli „As”
pt_br: Propriedade sem uma cláusula 'As'
ru: Свойство без предложения As
tr: Özellikte 'As' yan tümcesi yok
zh_hans: 属性没有 "As" 子句
zh_hant: 屬性沒有 'As' 子句

# WRN_UnusedLocal
source: Unused local variable: '{0}'.
cs: Nepoužitá lokální proměnná: {0}
de: Nicht verwendete lokale Variable: "{0}".
es: Variable local sin usar: '{0}'.
fr: Variable locale inutilisée : '{0}'.
it: Variabile locale inutilizzata: '{0}'.
ja: 未使用のローカル変数: '{0}'。
ko: 사용되지 않는 지역 변수: '{0}'
pl: Nieużywana zmienna lokalna: „{0}”.
pt_br: Variável local não utilizada: "{0}".
ru: Неиспользованная локальная переменная: "{0}".
tr: Kullanılmayan yerel değişken: '{0}'.
zh_hans: 未使用的局部变量:“{0}”。
zh_hant: 未使用的區域變數: '{0}'。

# WRN_UnusedLocal_Title
source: Unused local variable
cs: Nepoužitá lokální proměnná
de: Nicht verwendete lokale Variable
es: Variable local no usada
fr: Variable locale non utilisée
it: Variabile locale inutilizzata
ja: 未使用のローカル変数です
ko: 사용하지 않는 지역 변수
pl: Nieużyta zmienna lokalna
pt_br: Variável de local não usada
ru: Неиспользуемая локальная переменная
tr: Kullanılmayan yerel değişken
zh_hans: 未使用的本地变量
zh_hant: 未使用的區域變數

# WRN_SharedMemberThroughInstance
source: Access of shared member, constant member, enum member or nested type through an instance; qualifying expression will not be evaluated.
cs: Přístup ke sdílenému členu, konstantnímu členu, členu výčtu nebo vnořenému typu prostřednictvím instance; kvalifikující výraz se nevyhodnotí.
de: Zugriff des freigegebenen Members, konstanten Members, Enumerationsmembers oder geschachtelten Typs über eine Instanz; der qualifizierende Ausdruck wird nicht ausgewertet.
es: Acceso de miembro compartido, miembro de constante, miembro de enumeración o tipo anidado a través de una instancia; la expresión de calificación no se evaluará.
fr: Accès d'un membre partagé, d'un membre de constante, d'un membre enum ou d'un type imbriqué via une instance ; l'expression qualifiante ne sera pas évaluée.
it: L'accesso del membro condiviso, del membro costante, del membro di enumerazione o del tipo nidificato verrà effettuato tramite un'istanza. L'espressione di qualificazione non verrà valutata.
ja: 共有メンバー、定数メンバー、列挙型メンバー、または入れ子にされた型にインスタンス経由でアクセスしています。正規の式は評価されません。
ko: 인스턴스를 통한 공유 멤버, 상수 멤버, 열거형 멤버 또는 중첩 형식 액세스입니다. 정규화 식을 계산하지 않습니다.
pl: Dostęp przez wystąpienie do udostępnionej składowej, stałej składowej, składowej wyliczenia lub typu zagnieżdżonego; wyrażenie kwalifikujące nie zostanie obliczone.
pt_br: Acesso de membro compartilhado, membro constante, membro enum ou tipo aninhado por meio de uma instância; a expressão de qualificação não será avaliada.
ru: Доступ к общему члену, члену-константе, члену-перечислению или вложенному типу через экземпляр; заданное выражение не будет вычислено.
tr: Paylaşılan üye, sabit üye, sabit listesi üyesi veya iç içe türe örnek üzerinden erişim; niteleyen ifade hesaplanmaz.
zh_hans: 通过实例访问共享成员、常量成员、枚举成员或嵌套类型；将不计算限定表达式。
zh_hant: 透過執行個體存取共用成員、常數成員、列舉成員或巢狀類型。將不會評估合格的運算式。

# WRN_SharedMemberThroughInstance_Title
source: Access of shared member, constant member, enum member or nested type through an instance
cs: Přístup ke sdílenému členu, konstantnímu členu, členu výčtu nebo vnořenému typu přes instanci
de: Zugriff des freigegebenen Members, konstanten Members, Enumerationsmembers oder geschachtelten Typs über eine Instanz.
es: Acceso del miembro compartido, el miembro de constante, el miembro de enumeración o el tipo anidado a través de una instancia
fr: Accès d’un membre partagé, d’un membre de constante, d’un membre enum ou d’un type imbriqué via une instance
it: L'accesso del membro condiviso, del membro costante, del membro di enumerazione o del tipo nidificato verrà effettuato tramite un'istanza
ja: インスタンスを経由する共有メンバー、定数メンバー、列挙型メンバー、または入れ子にされた型へのアクセスです
ko: 인스턴스를 통한 공유 멤버, 상수 멤버, 열거형 멤버 또는 중첩 형식 액세스임
pl: Dostęp przez wystąpienie do udostępnionej składowej, stałej składowej, składowej wyliczenia lub typu zagnieżdżonego
pt_br: Acesso do membro compartilhado, membro constante, membro enumerado ou tipo aninhado por meio de uma instância
ru: Доступ общего члена, члена константы, члена перечисления или вложенного типа с помощью экземпляра
tr: Paylaşılan üye, sabit üye, sabit listesi üyesi veya iç içe türe örnek üzerinden erişim
zh_hans: 通过实例访问共享成员、常量成员、枚举成员或嵌套类型
zh_hant: 透過執行個體存取共用成員、常數成員、列舉成員或巢狀類型

# WRN_RecursivePropertyCall
source: Expression recursively calls the containing property '{0}'.
cs: Výraz rekurzivně volá nadřazenou vlastnost {0}.
de: Der Ausdruck ruft rekursiv die enthaltende {0}-Eigenschaft auf.
es: La expresión llama recursivamente a la propiedad '{0}' contenedora.
fr: L'expression appelle de manière récursive la propriété conteneur '{0}'.
it: L'espressione chiama in modo ricorsivo la proprietà '{0}' che la contiene.
ja: 式は、含まれているプロパティ '{0}' を再帰的に呼び出します。
ko: 포함하는 '{0}' 속성을 식이 재귀적으로 호출합니다.
pl: Wyrażenie cyklicznie wywołuje zawierającą je właściwość „{0}”.
pt_br: A expressão chama recursivamente a propriedade recipiente "{0}".
ru: Выражение рекурсивно вызывает содержащееся свойство "{0}".
tr: İfade, kapsayan '{0}' özelliğini yinelemeli olarak çağırıyor.
zh_hans: 表达式递归调用包含属性“{0}”。
zh_hant: 運算式遞迴呼叫包含屬性 '{0}'。

# WRN_RecursivePropertyCall_Title
source: Expression recursively calls the containing property
cs: Výraz volá rekurzivně nadřazenou vlastnost.
de: Durch den Ausdruck wird die enthaltende Eigenschaft rekursiv aufgerufen.
es: La expresión llama recursivamente a la propiedad que contiene
fr: L’expression appelle de manière récursive la propriété conteneur
it: L'espressione chiama in modo ricorsivo la proprietà che la contiene
ja: 式は、包含するプロパティを再帰的に呼び出しています
ko: 포함하는 속성을 식이 재귀적으로 호출함
pl: Wyrażenie rekursywnie wywołuje zawierającą je właściwość
pt_br: A expressão chama recursivamente a propriedade recipiente
ru: Выражение рекурсивно вызывает содержащее его свойство
tr: İfade, kapsayan özelliği yinelemeli olarak çağırıyor
zh_hans: 表达式递归调用包含属性
zh_hant: 運算式會遞迴呼叫包含屬性

# WRN_OverlappingCatch
source: 'Catch' block never reached, because '{0}' inherits from '{1}'.
cs: 'K bloku Catch se nedospělo, protože {0} dědí z {1}.
de: 'Der Catch-Block wird niemals erreicht, weil "{0}" von "{1}" erbt.
es: 'Nunca se alcanzó el bloque 'Catch' porque '{0}' hereda de '{1}'.
fr: 'Le bloc 'Catch' n'a jamais été atteint, car '{0}' hérite de '{1}'.
it: 'Il blocco 'Catch' non è mai stato raggiunto perché '{0}' eredita da '{1}'.
ja: '{0}' は '{1}' から継承するため、'Catch' ブロックに到達しません。
ko: '{0}'이(가) '{1}'에서 상속되므로 'Catch' 블록에 도달하지 않습니다.
pl: 'Blok „Catch” nigdy nie został osiągnięty, ponieważ element „{0}” dziedziczy po elemencie „{1}”.
pt_br: 'O bloco 'Catch' nunca é alcançado porque '{0}' herda de '{1}'.
ru: 'Невозможно достичь блока Catch, поскольку "{0}" наследуется от "{1}".
tr: '{0}', '{1}' öğesinden devralındığından 'Catch' bloğuna hiç ulaşılamadı.
zh_hans: '永远不会到达“Catch”块，因为“{0}”从“{1}”继承。
zh_hant: '因為 '{0}' 繼承自 '{1}'，所以一律不會執行到 'Catch' 區塊。

# WRN_OverlappingCatch_Title
source: 'Catch' block never reached; exception type's base type handled above in the same Try statement
cs: 'K bloku Catch se nedospělo; nad ním se ve stejném příkazu Try zpracovával základní typ typu výjimky.
de: 'Der Catch-Block wurde nie erreicht. Der Basistyp des Ausnahmetyps wurde oben in der gleichen Try-Anweisung behandelt.
es: 'El bloque 'Catch' nunca se alcanzó. El tipo base del tipo de excepción se administró anteriormente en la misma instrucción Try.
fr: 'Le bloc 'Catch' n'a jamais été atteint. Le type de base du type d'exception est géré au-dessus dans la même instruction Try
it: 'Il blocco 'Catch' non è mai stato raggiunto. Il tipo di base del tipo di eccezione viene gestito sopra nella stessa istruzione Try
ja: 'Catch' ブロックに到達しません。例外の種類の基本型は同じ Try ステートメントで処理されました
ko: 'Catch' 블록에 도달할 수 없어 예외 형식의 기본 형식이 동일한 Try 문의 윗부분에서 처리됨
pl: 'Blok „Catch” nie jest nigdy osiągany; typ podstawowy typu wyjątku jest obsługiwany powyżej w tej samej instrukcji Try
pt_br: 'O bloco 'Catch' nunca foi alcançado. O tipo base do tipo de exceção foi identificado acima na mesma instrução Try
ru: 'Блок Catch недоступен; базовый тип типа исключения обрабатывается выше в том же операторе Try
tr: 'Catch' bloğuna erişilemedi; özel durum türü yukarıda aynı Try deyiminde işlendi
zh_hans: '永远不会到达 "Catch" 块；异常类型的基类型已在上面同一个 Try 语句中处理
zh_hant: '一律不會執行到 'Catch' 區塊; 例外狀況類型的基底類型已在相同的 Try 陳述式中處理過此項

# WRN_DefAsgUseNullRefByRef
source: Variable '{0}' is passed by reference before it has been assigned a value. A null reference exception could result at runtime.
cs: Proměnná {0} se předá pomocí odkazu dřív, než se jí přiřadí hodnota. Při spuštění by mohlo dojít k výjimce z důvodu odkazu s hodnotou Null.
de: Die {0}-Variable wird als Verweis übergeben, bevor ihr ein Wert zugewiesen wird. Zur Laufzeit kann eine Nullverweisausnahme auftreten.
es: La variable '{0}' se ha pasado como referencia antes de haberle asignado un valor. Podría darse una excepción de referencia NULL en tiempo de ejecución.
fr: La variable '{0}' est passée par référence avant qu'une valeur lui ait été attribuée. Cela peut provoquer une exception de référence null au moment de l'exécution.
it: La variabile '{0}' è stata passata per riferimento prima dell'assegnazione di un valore. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null.
ja: 変数 '{0}' は、値が割り当てられる前に参照渡しによって渡されています。Null 参照の例外が実行時に発生する可能性があります。
ko: 값이 할당되기 전에 '{0}' 변수를 참조로 전달했습니다. 런타임에 null 참조 예외가 발생할 수 있습니다.
pl: Zmienna „{0}” jest przekazywana przez referencję, zanim zostanie do niej przypisana wartość. W czasie wykonania może wystąpić wyjątek referencji o wartości null.
pt_br: Variável "{0}" é passada por referência antes de receber um valor. Uma exceção de referência nula poderia resultar em runtime.
ru: Переменная "{0}" передается по ссылке, прежде чем ей присваивается значение. Во время выполнения может появиться пустая ссылка на исключение.
tr: '{0}' değişkeni, bir değere atanmadan önce başvuru olarak geçirildi. Çalışma zamanında null başvurusu özel durumu oluşabilir.
zh_hans: 变量“{0}”在赋值前通过引用传递。可能会在运行时导致 null 引用异常。
zh_hant: 為變數 '{0}' 指派值之前，已藉傳址方式傳遞該數數。可能會在執行階段產生 null 參考例外狀況。

# WRN_DefAsgUseNullRefByRef_Title
source: Variable is passed by reference before it has been assigned a value
cs: Proměnná se předává pomocí odkazu dřív, než se k ní přiřadí hodnota.
de: Die Variable wurde als Verweis übergeben, bevor ihr ein Wert zugewiesen wurde.
es: La referencia pasa una variable ates de que se le haya asignado un valor
fr: La variable est transmise par référence avant de se voir attribuer une valeur
it: La variabile è stata passata per riferimento prima dell'assegnazione di un valore
ja: 変数が、値が割り当てられる前に参照渡しによって渡されます
ko: 변수에 값이 할당되기 전에 참조로 변수가 전달됨
pl: Zmienna została przekazana przez referencję przed przypisaniem do niej wartości
pt_br: A variável é passada por referência antes de receber um valor
ru: Переменная передана ссылкой до того, как ей было назначено значение
tr: Değişkene bir değer atanmadan önce değişken başvuruyla geçirildi
zh_hans: 在为变量赋值之前，变量已通过引用传递
zh_hant: 變數在獲派值之前就已藉傳址方式傳遞

# WRN_DuplicateCatch
source: 'Catch' block never reached; '{0}' handled above in the same Try statement.
cs: 'Bloku Catch se nikdy nedosáhlo. {0} je už zpracované výše na stejném příkazu Try.
de: 'Der Catch-Block wird niemals erreicht; "{0}" wird oben in der gleichen Try-Anweisung behandelt.
es: 'No se alcanzó el bloque 'Catch'; '{0}' se controla anteriormente en la misma instrucción Try.
fr: 'Bloc 'Catch' jamais atteint ; '{0}' géré au-dessus dans la même instruction Try.
it: 'Il blocco 'Catch' non è mai stato raggiunto. '{0}' viene gestito sopra nella stessa istruzione Try.
ja: 'Catch' ブロック に到達しませんでした。'{0}' は、同じ Try ステートメントで処理しました。
ko: 'Catch' 블록에 도달할 수 없습니다. '{0}'이(가) 같은 Try 문의 윗부분에서 처리되었습니다.
pl: 'Blok „Catch” nie został nigdy osiągnięty; element „{0}” został obsłużony powyżej w tej samej instrukcji Try.
pt_br: 'Bloco "Catch" nunca atingido; "{0}" manipulado acima na mesma instrução Try.
ru: 'Невозможно достичь блок "Catch"; "{0}" обрабатывается выше в том же операторе Try.
tr: 'Catch' bloğuna hiç ulaşılmadı; '{0}' yukarıda, aynı Try deyiminde işlendi.
zh_hans: '永远不会到达“Catch”块；“{0}”已在上面同一个 Try 语句中处理。
zh_hant: '{0}' 已在相同的 Try 陳述式中處理過上述項目，所以一律不會進行到 'Catch' 區塊。

# WRN_DuplicateCatch_Title
source: 'Catch' block never reached; exception type handled above in the same Try statement
cs: 'K bloku Catch se nedospělo; nad ním se ve stejném příkazu Try zpracovával typ výjimky.
de: 'Der "Catch"-Block wurde nie erreicht; der Ausnahmetyp wurde oben in derselben Try-Anweisung behandelt.
es: 'Nunca se alcanzó el bloque 'Catch'; el tipo de excepción se gestionó anteriormente en la misma instrucción Try
fr: 'Le bloc 'Catch' n’a jamais été atteint. Le type d’exception est traité au-dessus dans la même instruction Try
it: 'Il blocco 'Catch' non è mai stato raggiunto. Il tipo di eccezione viene gestito sopra nella stessa istruzione Try
ja: 'Catch' ブロックに到達しません。例外の種類は同じ Try ステートメントで処理されました
ko: 'Catch' 블록에 도달할 수 없어 예외 형식이 동일한 Try 문의 윗부분에서 처리됨
pl: 'Blok „Catch” nie jest nigdy osiągany; typ wyjątku jest obsługiwany powyżej w tej samej instrukcji Try
pt_br: 'O bloco 'Catch' nunca foi alcançado. O tipo de exceção foi manipulado acima na mesma instrução Try
ru: 'Блок Catch недоступен; обработанный выше тип исключения находится в том же операторе Try
tr: 'Catch' bloğuna erişilemedi; özel durum türü yukarıda aynı Try deyiminde işlendi
zh_hans: '永远不会到达 "Catch" 块；异常类型已在上面同一个 Try 语句中处理
zh_hant: '一律不會執行到 'Catch' 區塊; 例外狀況類型會在相同 Try 陳述式的上方處理

# WRN_ObjectMath1Not
source: Operands of type Object used for operator '{0}'; use the 'IsNot' operator to test object identity.
cs: Operandy typu Object jsou použité pro operátor {0}; k otestování identity objektu použijte operátor IsNot.
de: Für den {0}-Operator werden Operanden vom Typ "Object" verwendet. Verwenden Sie den IsNot-Operator, um die Objektidentität zu testen.
es: Se han usado operandos del tipo Object para el operador '{0}'; use el operador 'IsNot' para probar la identidad del objeto.
fr: Opérandes de type Object utilisés pour l'opérateur '{0}' ; utilisez l'opérateur 'IsNot' pour tester l'identité de l'objet.
it: Sono stati usati operandi di tipo Object per l'operatore '{0}'. Usare l'operatore 'IsNot' per verificare l'identità dell'oggetto.
ja: 演算子 '{0}' に対して使用される Object 型のオペランドです。オブジェクト ID をテストするには、'IsNot' 演算子を使用してください。
ko: '{0}' 연산자에 대해 Object 형식의 피연산자를 사용했습니다. 개체 ID를 테스트하려면 'IsNot' 연산자를 사용하세요.
pl: Argumenty operacji typu Object użyte dla operatora „{0}”; użyj operatora „IsNot”, aby sprawdzić tożsamość obiektu.
pt_br: Operandos do tipo Object usados para o operador "{0}"; use o operador "IsNot" para testar a identidade do objeto.
ru: Операнды типа Object, используемые для оператора "{0}"; используется оператор "IsNot", чтобы проверить идентификатор объекта.
tr: '{0}' işleci için kullanılan Object türünde işlenenler; nesne kimliğini test etmek için 'IsNot' işlecini kullanın.
zh_hans: 对运算符“{0}”使用了 Object 类型的操作数；应使用“IsNot”运算符来测试对象标识。
zh_hant: 供運算子 '{0}' 使用之 Object 類型的運算元; 請使用 'IsNot' 運算子測試物件識別。

# WRN_ObjectMath1Not_Title
source: Operands of type Object used for operator <>
cs: V operátoru <> se používají operandy typu Object.
de: Für den <>-Operator werden Operanden vom Typ "Object" verwendet.
es: Operandos de tipo Object usados para el operador <>
fr: Opérandes de type Object utilisés pour l’opérateur <>
it: Sono stati usati operandi di tipo Object per l'operatore <>
ja: 演算子 <> に使用される Object 型のオペランドです
ko: <> 연산자에 대해 Object 형식의 피연산자를 사용함
pl: Dla operatora <> użyto argumentów operacji typu Object
pt_br: Operandos do tipo objeto usados pelo operador <>
ru: В операторе <> используются операнды типа Object
tr: <> işleci için kullanılan Object türündeki işlenenler
zh_hans: 为运算符 <> 使用的 Object 类型的操作数
zh_hant: 對運算子 <> 使用了 Object 類型的運算元

# WRN_BadChecksumValExtChecksum
source: Bad checksum value, non hex digits or odd number of hex digits.
cs: Nesprávná hodnota kontrolního součtu. Číslice nejsou v šestnáctkové soustavě nebo je zadaný lichý počet číslic v šestnáctkové soustavě.
de: Ungültiger Prüfsummenwert, keine hexadezimalen Ziffern oder ungerade Anzahl von hexadezimalen Ziffern.
es: El valor de suma de comprobación es incorrecto, hay dígitos no hexadecimales o un número impar de dígitos hexadecimales.
fr: Valeur de checksum erronée, pas de chiffre hexadécimal ou de nombre impair de chiffres hexadécimaux.
it: Il valore checksum non è corretto. Le cifre esadecimali mancano o sono dispari.
ja: 不適切なチェックサム値です。16 進数ではないか、または奇数の 16 進数です。
ko: 체크섬 값이 잘못되었습니다. 16진수가 아니거나 16진수 값이 홀수입니다.
pl: Nieprawidłowa wartość sumy kontrolnej, cyfry nieszesnastkowe lub nieparzysta liczba cyfr szesnastkowych.
pt_br: Valor de soma de verificação inválido, dígitos não hexadecimais ou quantidade ímpar de dígitos hexadecimais.
ru: Некорректное значение контрольной суммы: не шестнадцатеричный формат или нечетное количество шестнадцатеричных цифр.
tr: Hatalı sağlama toplaması değeri, onaltılık olmayan basamaklar veya tek sayıda onaltılık basamak sayısı.
zh_hans: 错误的校验和值、非十六进制数字或奇数个十六进制数字。
zh_hant: 錯誤的總和檢查碼值、非十六進位數字或奇數的十六進位數字。

# WRN_BadChecksumValExtChecksum_Title
source: Bad checksum value, non hex digits or odd number of hex digits
cs: Nesprávná hodnota kontrolního součtu. Číslice nejsou v šestnáctkové soustavě nebo je zadaný lichý počet číslic v šestnáctkové soustavě.
de: Ungültiger Prüfsummenwert, keine hexadezimalen Ziffern oder ungerade Anzahl von hexadezimalen Ziffern.
es: El valor de suma de comprobación es incorrecto, hay dígitos no hexadecimales o un número impar de dígitos hexadecimales
fr: Valeur de checksum erronée, pas de chiffre hexadécimal ou de nombre impair de chiffres hexadécimaux
it: Il valore checksum non è corretto. Le cifre esadecimali mancano o sono dispari
ja: 不適切なチェックサム値です。16 進数ではないか、または奇数の 16 進数です
ko: 체크섬 값이 잘못됨, 16진수가 아니거나 16진수 값이 홀수임
pl: Nieprawidłowa wartość sumy kontrolnej, cyfry nieszesnastkowe lub nieparzysta liczba cyfr szesnastkowych
pt_br: Valor de soma de verificação inválido, dígitos não hexadecimais ou quantidade ímpar de dígitos hexadecimais
ru: Некорректное значение контрольной суммы: не шестнадцатеричный формат или нечетное количество шестнадцатеричных цифр
tr: Hatalı sağlama toplaması değeri, onaltılı olmayan basamaklar veya tek sayıda onaltılı basamak sayısı
zh_hans: 错误的校验和值、非十六进制数字或奇数个十六进制数字
zh_hant: 錯誤的總和檢查碼值，非十六進位數字或奇數的十六進位數字

# WRN_MultipleDeclFileExtChecksum
source: File name already declared with a different GUID and checksum value.
cs: Název souboru je už deklarovaný s jiným identifikátorem GUID a hodnotou kontrolního součtu.
de: Der Dateiname wurde bereits mit einer anderen GUID und einem anderen Prüfsummenwert deklariert.
es: El nombre de archivo ya está declarado con un GUID y un valor de suma de comprobación distintos.
fr: Le nom de fichier est déjà déclaré avec un GUID et une valeur de checksum différents.
it: Il nome di file è già dichiarato con un valore diverso per checksum e GUID.
ja: ファイル名は、別の GUID とチェックサム値を使用して既に宣言されています。
ko: 파일 이름이 이미 다른 GUID와 체크섬 값으로 선언되어 있습니다.
pl: Nazwa pliku została już zadeklarowana z innym identyfikatorem GUID i wartością sumy kontrolnej.
pt_br: Nome de arquivo já declarado com um GUID e valor de soma de verificação diferentes.
ru: Имя файла уже объявлено с другим GUID и контрольной суммой.
tr: Dosya adı farklı bir GUID ile ve sağlama toplaması değeriyle zaten bildirildi.
zh_hans: 已使用另一个 GUID 和校验和值声明了文件名。
zh_hant: 已使用不同 GUID 與總和檢查碼宣告的檔名。
