Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_LambdaPassedToRemoveHandler
source: Lambda expression will not be removed from this event handler. Assign the lambda expression to a variable and use the variable to add and remove the event.
cs: Výraz lambda se neodebere z této obslužné rutiny události. Přiřaďte výraz lambda proměnné a tuto proměnnou používejte k přidání a odebrání události.
de: Der Lambdaausdruck wird nicht aus diesem Ereignishandler entfernt. Weisen Sie den Lambdaausdruck einer Variablen zu, und verwenden Sie die Variable, um das Ereignis hinzuzufügen und zu entfernen.
es: La expresión lambda no se quitará de este controlador de eventos. Asigne la expresión lambda a una variable y use esta variable para agregar y quitar el evento.
fr: L'expression lambda ne sera pas supprimée de ce gestionnaire d'événements. Assignez l'expression lambda à une variable et utilisez cette dernière pour ajouter et supprimer l'événement.
it: L'espressione lambda non verrà rimossa da questo gestore eventi. Assegnare l'espressione lambda a una variabile e usare la variabile per aggiungere e rimuovere l'evento.
ja: ラムダ式はこのイベント ハンドラーから削除されません。ラムダ式を変数に割り当て、その変数を使用してイベントを追加および削除してください。
ko: 이벤트 처리기에서 람다 식이 제거되지 않습니다. 변수에 람다 식을 할당한 후 변수를 사용하여 이벤트를 추가하거나 제거하세요.
pl: Wyrażenie lambda nie zostanie usunięte z tej procedury obsługi zdarzeń. Przypisz wyrażenie lambda do zmiennej i używaj jej do dodawania i usuwania zdarzenia.
pt_br: A expressão lambda não será removida desse manipulador de eventos. Atribua a expressão lambda a uma variável e use-a para adicionar e remover o evento.
ru: Лямбда-выражение не будет удалено из обработчика этого события. Присвойте переменной лямбда-выражение и используйте переменную, чтобы добавить или удалить событие.
tr: Lambda ifadesi bu olay işleyiciden kaldırılmayacak. Lambda ifadesini bir değişkene atayın ve olayı eklemek ve kaldırmak için bu değişkeni kullanın.
zh_hans: Lambda 表达式将不会从此事件处理程序中移除。将 lambda 表达式赋给变量，并使用该变量添加和移除事件。
zh_hant: Lambda 運算式將不會從這個事件處理常式中移除。請將 Lambda 運算式指派給變數，然後使用該變數來加入和移除事件。

# WRN_LambdaPassedToRemoveHandler_Title
source: Lambda expression will not be removed from this event handler
cs: Výraz lambda se z této obslužné rutiny události neodebere.
de: Der Lambdaausdruck wird aus diesem Ereignishandler nicht entfernt.
es: La expresión lambda no se quitará de este controlador de eventos
fr: L’expression lambda ne sera pas supprimée de ce gestionnaire d’événements
it: L'espressione lambda non verrà rimossa da questo gestore eventi
ja: ラムダ式はこのイベント ハンドラーから削除されません
ko: 이벤트 처리기에서 람다 식이 제거되지 않음
pl: Wyrażenie lambda nie zostanie usunięte z tej procedury obsługi zdarzeń
pt_br: A expressão lambda não será removida deste manipulador de eventos
ru: Лямбда-выражение не будет удалено из этого обработчика событий
tr: Lambda ifadesi bu olay işleyicisinden kaldırılmayacak
zh_hans: Lambda 表达式将不会从此事件处理程序中删除
zh_hant: 將不會從這個事件處理常式中移除 Lambda 運算式

# WRN_LiftControlVariableQuery
source: Using the iteration variable in a query expression may have unexpected results. Instead, create a local variable within the loop and assign it the value of the iteration variable.
cs: Použití proměnné iterace ve výrazu dotazu může mít nečekané důsledky. Namísto toho vytvořte v cyklu lokální proměnnou a přiřaďte jí hodnotu proměnné iterace.
de: Die Verwendung der Iterationsvariablen in einem Abfrageausdruck kann zu unerwarteten Ergebnissen führen. Erstellen Sie stattdessen in der Schleife eine lokale Variable, und weisen Sie dieser den Wert der Iterationsvariablen zu.
es: El uso de una variable de iteración en una expresión de consulta puede producir resultados inesperados. Cree una variable local dentro del bucle y asígnele el valor de la variable de iteración.
fr: L'utilisation de la variable d'itération dans une expression de requête peut provoquer des résultats inattendus. Créez une variable locale dans la boucle et assignez-lui la valeur de la variable d'itération à la place.
it: L'uso della variabile di iterazione in un'espressione di query può produrre risultati imprevisti. Creare una variabile locale all'interno del ciclo e assegnarvi il valore della variabile di iterazione.
ja: クエリ式内で繰り返し変数を使用すると、予期しない結果が発生する可能性があります。代わりに、ループ内にローカル変数を作成して繰り返し変数の値を割り当ててください。
ko: 쿼리 식에 반복 변수를 사용하면 예기치 않은 결과가 발생할 수 있습니다. 대신 루프 내에 지역 변수를 만든 다음 여기에 반복 변수 값을 할당하세요.
pl: Użycie zmiennej iteracyjnej w wyrażeniu zapytania może spowodować nieoczekiwane wyniki. Zamiast tego utwórz zmienną lokalną w pętli i przypisz jej wartość zmiennej iteracyjnej.
pt_br: O uso da variável de iteração em uma expressão de consulta pode ter resultados inesperados. Crie uma variável local no loop e atribua o valor da variável de iteração a ela.
ru: Использование переменной цикла в выражении запроса может привести к непредвиденным результатам. Вместо этого можно создать локальную переменную внутри цикла и присвоить ей значение переменной цикла.
tr: Sorgu ifadesinde yineleme değişkeni kullanılması beklenmeyen sonuçlara neden olabilir. Bunun yerine döngü içinde yerel bir değişken oluşturun ve buna yineleme değişkeninin değerini atayın.
zh_hans: 在查询表达式中使用迭代变量可能会产生意外的结果。应改为在循环中创建一个局部变量并将迭代变量的值赋给它。
zh_hant: 在查詢運算式中使用反覆運算變數可能會產生非預期的結果，請改成在迴圈中建立區域變數，並將反覆運算變數的值指派給它。

# WRN_LiftControlVariableQuery_Title
source: Using the iteration variable in a query expression may have unexpected results
cs: Použití proměnné iterace ve výrazu dotazu může mít neočekávané výsledky.
de: Die Verwendung der Iterationsvariablen in einem Abfrageausdruck kann zu unerwarteten Ergebnissen führen.
es: Es posible que usar la variable de iteración en una expresión de consulta tenga resultados inesperados
fr: L’utilisation d’une variable d’itération dans une expression de requête peut avoir des résultats inattendus
it: L'uso della variabile di iterazione in un'espressione di query può produrre risultati imprevisti
ja: クエリ式内で繰り返し変数を使用すると、予期しない結果が発生する可能性があります
ko: 쿼리 식에 반복 변수를 사용하면 예기치 않은 결과가 발생할 수 있음
pl: Użycie zmiennej iteracji w wyrażeniu zapytania może mieć nieoczekiwane skutki
pt_br: Usar a variável de iteração em uma expressão de consulta pode ter resultados inesperados
ru: Использование переменной итерации в выражении запроса может привести к непредусмотренным результатам
tr: Sorgu ifadesinde yineleme değişkeni kullanılması beklenmeyen sonuçlara neden olabilir
zh_hans: 在查询表达式中使用迭代变量可能会产生意外的结果
zh_hant: 在查詢運算式中使用反覆運算變數可能會產生非預期的結果

# WRN_RelDelegatePassedToRemoveHandler
source: The 'AddressOf' expression has no effect in this context because the method argument to 'AddressOf' requires a relaxed conversion to the delegate type of the event. Assign the 'AddressOf' expression to a variable, and use the variable to add or remove the method as the handler.
cs: Výraz AddressOf nemá v tomto kontextu žádný účinek, protože argument metody pro výraz AddressOf vyžaduje volný převod na typ delegáta události. Přiřaďte výraz AddressOf proměnné a tuto proměnnou použijte při přidání a odebrání metody jako obslužnou rutinu.
de: Der AddressOf-Ausdruck hat in diesem Kontext keine Wirkung, da das Methodenargument für AddressOf eine gelockerte Konvertierung in den Delegattyp des Ereignisses erfordert. Weisen Sie den AddressOf-Ausdruck einer Variablen zu, und verwenden Sie die Variable, um die Methode als Handler hinzuzufügen oder zu entfernen.
es: La expresión 'AddressOf' no tiene efecto en este contexto porque el argumento de método para 'AddressOf' requiere una conversión flexible al tipo delegado del evento. Asigne la expresión 'AddressOf' a una variable y use la variable para agregar o quitar el método como controlador.
fr: L'expression 'AddressOf' n'a pas d'effet dans ce contexte, car l'argument de la méthode pour 'AddressOf' requiert une conversion souple en type délégué de l'événement. Assignez l'expression 'AddressOf' à une variable et utilisez la variable pour ajouter ou supprimer la méthode comme gestionnaire.
it: L'espressione 'AddressOf' non ha effetto in questo contesto perché l'argomento del metodo per 'AddressOf' richiede una conversione di tipo relaxed nel tipo delegato dell'evento. Assegnare l'espressione 'AddressOf' a una variabile e usare tale variabile per aggiungere o rimuovere il metodo come gestore.
ja: AddressOf' へのメソッド引数には、イベントのデリゲート型への厳密でない変換が必要です。したがって、'AddressOf' 式はこのコンテキストでは無効です。'AddressOf' 式を変数に割り当て、その変数を使用してハンドラーとしてメソッドを追加および削除してください。
ko: AddressOf'의 메서드 인수를 사용하려면 이벤트의 대리자 형식으로 낮은 수준의 변환을 수행해야 하므로 'AddressOf' 식은 이 컨텍스트에서는 의미가 없습니다. 변수에 'AddressOf' 식을 할당한 후 해당 변수를 사용하여 메서드를 처리기로 추가하거나 제거하세요.
pl: Wyrażenie „AddressOf” nie przynosi efektów w tym kontekście, ponieważ argument metody dla wyrażenia „AddressOf” wymaga swobodnej konwersji na typ delegata zdarzenia. Przypisz wyrażenie „AddressOf” do zmiennej i używaj jej do dodawania lub usuwania metody jako procedury obsługi.
pt_br: A expressão 'AddressOf' não possui nenhum efeito neste contexto porque o argumento de método para 'AddressOf' necessita de uma conversão relaxada para o tipo delegado do evento. Atribua a expressão 'AddressOf' para uma variável, e use a variável para adicionar ou remover o método como o manipulador.
ru: Выражение "AddressOf" не работает в этом контексте, так как аргумент метода "AddressOf" требует преобразование в тип делегата события. Можно присвоить выражение "AddressOf" переменной и использовать ее для добавления и удаления события.
tr: AddressOf' ifadesine geçirilen yöntem bağımsız değişkeni olayın temsilci türüne gevşek dönüştürme gerektirdiğinden bu içerikte 'AddressOf' etkisizdir. 'AddressOf' ifadesini bir değişkene atayın ve yöntemi işleyici olarak eklemek ve kaldırmak için değişkeni kullanın.
zh_hans: "AddressOf" 表达式在此上下文中不起作用，因为 "AddressOf" 的方法参数需要到该事件的委托类型的宽松转换。将 "AddressOf' 表达式赋给变量，并使用变量将该方法作为处理程序进行添加或移除。
zh_hant: AddressOf' 運算式在此內容中沒有作用，因為 'AddressOf' 的方法引數必須以寬鬆的方式轉換成事件的委派類型。請將 'AddressOf' 運算式指派給變數，然後使用該變數來加入或移除做為處理常式的方法。

# WRN_RelDelegatePassedToRemoveHandler_Title
source: The 'AddressOf' expression has no effect in this context because the method argument to 'AddressOf' requires a relaxed conversion to the delegate type of the event
cs: Výraz AddressOf nemá v tomto kontextu žádný účinek, protože argument metody pro výraz AddressOf vyžaduje volný převod na typ delegáta události.
de: Der AddressOf-Ausdruck hat in diesem Kontext keine Wirkung, da das Methodenargument für AddressOf eine gelockerte Konvertierung in den Delegattyp des Ereignisses erfordert.
es: La expresión 'AddressOf' no tiene efecto en este contexto porque el argumento de método para 'AddressOf' necesita una conversión flexible para el tipo delegado del evento
fr: L’expression 'AddressOf' n’a pas d’effet dans ce contexte, car l’argument de la méthode pour 'AddressOf' requiert une conversion souple en type délégué de l’événement
it: L'espressione 'AddressOf' non ha effetto in questo contesto perché l'argomento del metodo per 'AddressOf' richiede una conversione di tipo relaxed del tipo delegato dell'evento
ja: AddressOf' へのメソッド引数には、イベントのデリゲート型への厳密でない変換が必要です。したがって、'AddressOf' 式はこのコンテキストでは効果がありません
ko: AddressOf'의 메서드 인수를 사용하려면 이벤트의 대리자 형식으로 낮은 수준의 변환을 수행해야 하므로 'AddressOf' 식은 이 컨텍스트에서 효과가 없음
pl: Wyrażenie „AddressOf” nie przynosi efektów w tym kontekście, ponieważ argument metody dla wyrażenia „AddressOf” wymaga swobodnej konwersji na typ delegata zdarzenia
pt_br: A expressão 'AddressOf' não tem nenhum efeito nesse contexto porque o argumento de método para 'AddressOf' requer uma conversão reduzida no tipo de delegado do evento
ru: Выражение AddressOf не оказывает влияния в этом контексте, так как аргумент метода для AddressOf требует неявного преобразования в тип делегата события
tr: AddressOf' deyimine geçirilen metot bağımsız değişkeni olayın temsilci türü için gevşek dönüştürme gerektirdiğinden bu bağlamda 'AddressOf' etkisizdir
zh_hans: "AddressOf" 表达式在此上下文中不起作用，原因是 "AddressOf" 的方法参数需要到该事件的委托类型的宽松转换
zh_hant: AddressOf' 運算式在這個內容中沒有作用，因為 'AddressOf' 的方法引數必須以寬鬆的方式轉換成事件的委派類型

# ERR_MultilineLambdaMissingFunction
source: Multiline lambda expression is missing 'End Function'.
cs: Víceřádkový výraz lambda nemá příkaz End Function.
de: Im mehrzeiligen Lambdaausdruck fehlt "End Function".
es: Falta 'End Function' en una expresión lambda de varias líneas.
fr: L'expression lambda multiligne ne contient pas de 'End Function'.
it: Manca 'End Function' nell'espressione lambda su più righe.
ja: 複数行のラムダ式に 'End Function' が見つかりません。
ko: 여러 줄 람다 식에 'End Function'이 없습니다.
pl: W wielowierszowym wyrażeniu lambda brakuje instrukcji „End Function”.
pt_br: Expressão lambda multilinha não encontrou 'End Function'.
ru: В многострочном лямбда-выражении отсутствует "End Function".
tr: Çok satırlı lambda ifadesinde 'End Function' eksik.
zh_hans: 多行 lambda 表达式缺少 "End Function"。
zh_hant: 多行 Lambda 運算式遺漏 'End Function'。

# ERR_MultilineLambdaMissingSub
source: Multiline lambda expression is missing 'End Sub'.
cs: Víceřádkový výraz lambda nemá příkaz End Sub.
de: Im mehrzeiligen Lambdaausdruck fehlt "End Sub".
es: Falta 'End Sub' en una expresión lambda de varias líneas.
fr: L'expression lambda multiligne ne contient pas 'End Sub'.
it: Manca 'End Sub' nell'espressione lambda su più righe.
ja: 複数行のラムダ式に 'End Sub' が見つかりません。
ko: 여러 줄 람다 식에 'End Sub'가 없습니다.
pl: W wielowierszowym wyrażeniu lambda brakuje instrukcji „End Sub”.
pt_br: Expressão lambda multilinha não encontrou 'End Sub'.
ru: В многострочном лямбда-выражении отсутствует "End Sub".
tr: Çok satırlı lambda ifadesinde 'End Sub' eksik.
zh_hans: 多行 lambda 表达式缺少 "End Sub"。
zh_hant: 多行 Lambda 運算式遺漏 'End Sub'。

# ERR_AttributeOnLambdaReturnType
source: Attributes cannot be applied to return types of lambda expressions.
cs: Na návratové typy výrazů lambda nejde použít atributy.
de: Attribute können nicht auf Rückgabetypen von Lambdaausdrücken angewendet werden.
es: No se pueden aplicar atributos para devolver tipos de expresiones lambda.
fr: Les attributs ne peuvent pas être appliqués aux types de retour des expressions lambda.
it: Non è possibile applicare attributi a tipi restituiti delle espressioni lambda.
ja: ラムダ式の戻り値の型に属性を適用することはできません。
ko: 람다 식의 반환 형식에 특성을 적용할 수 없습니다.
pl: Nie można stosować atrybutów do zwracanych typów wyrażeń lambda.
pt_br: Não é possível aplicar atributos aos tipos de retorno das expressões lambda.
ru: Не удается применить атрибуты к возвращаемым типам лямбда-выражений.
tr: Öznitelikler lambda ifadelerinin dönüş türlerine uygulanamaz.
zh_hans: 特性不能应用于 lambda 表达式的返回类型。
zh_hant: 屬性無法套用至 Lambda 運算式的傳回類型。

# ERR_SubDisallowsStatement
source: Statement is not valid inside a single-line statement lambda.
cs: Příkaz není platný uvnitř výrazu lambda jednořádkového příkazu.
de: Die Anweisung ist in einer einzeiligen Anweisungslambdafunktion nicht gültig.
es: La instrucción no es válida en una expresión lambda de instrucción de una sola línea.
fr: L'instruction n'est pas valide au sein d'une lambda-instruction sur une seule ligne.
it: L'istruzione non è valida all'interno di espressioni lambda a riga singola.
ja: 単一行ステートメント形式のラムダの内部では有効でないステートメントです。
ko: 한 줄 문 람다 내부에는 문을 사용할 수 없습니다.
pl: Instrukcja wewnątrz jednowierszowej instrukcji lambda jest nieprawidłowa.
pt_br: A instrução não é válida em um lambda com instrução de uma linha.
ru: Недопустимый оператор в лямбде однострочного оператора.
tr: Deyim tek satırlı deyim lambdası içinde geçerli değil.
zh_hans: 该语句在单行语句 lambda 中无效。
zh_hant: 單行陳述式 Lambda 內的陳述式無效。

# ERR_SubRequiresParenthesesBang
source: This single-line statement lambda must be enclosed in parentheses. For example: (Sub() <statement>)!key
cs: Tento výraz lambda jednořádkového příkazu musí být v závorkách. Například: (Sub() <příkaz>)!key
de: Diese einzeilige Anweisungslambdafunktion muss in Klammern eingeschlossen sein. Beispiel: (Sub() <Anweisung>)!key
es: Esta expresión lambda con una instrucción de una sola línea debe ir entre paréntesis. Por ejemplo: (Sub() <instrucción>)!key
fr: Cette lambda-instruction sur une seule ligne doit être mise entre parenthèses. Par exemple : (Sub() <instruction>)!key
it: L'espressione lambda di istruzione a riga singola deve essere racchiusa tra parentesi. Ad esempio: (Sub() <istruzione>)!key
ja: この単一行ステートメント形式のラムダは、かっこで囲む必要があります。例: (Sub() <ステートメント>)!key
ko: 이 한 줄 문 람다는 괄호로 묶어야 합니다(예: (Sub() <statement>)!key).
pl: Jednowierszowa instrukcja lambda musi być ujęta w nawiasy. Na przykład: (Sub() <instrukcja>)!key
pt_br: O lambda de instrução de uma linha deve estar delimitado por parênteses. Por exemplo: (Sub() <instrução>)!key
ru: Эту лямбду однострочного оператора необходимо заключить в круглые скобки. Например: (Sub() <оператор>)!key
tr: Bu tek satırlı deyim lambdası ayraç içine alınmalıdır. Örnek: (Sub() <deyim>)!key
zh_hans: 此单行语句 lambda 必须括在括号中。例如: (Sub() <语句>)!key
zh_hant: 這個單行陳述式 Lambda 必須放在括號之中。例如: (Sub() <statement>)!key

# ERR_SubRequiresParenthesesDot
source: This single-line statement lambda must be enclosed in parentheses. For example: (Sub() <statement>).Invoke()
cs: Tento výraz lambda jednořádkového příkazu musí být v závorkách. Například: (Sub() <příkaz>).Invoke()
de: Diese einzeilige Anweisungslambdafunktion muss in Klammern eingeschlossen sein. Beispiel: (Sub() <Anweisung>).Invoke()
es: Esta expresión lambda con una instrucción de una sola línea debe ir entre paréntesis. Por ejemplo: (Sub() <instrucción>).Invoke()
fr: Cette lambda-instruction sur une seule ligne doit être mise entre parenthèses. Par exemple : (Sub() <instruction>).Invoke()
it: L'espressione lambda di istruzione a riga singola deve essere racchiusa tra parentesi. Ad esempio: (Sub() <istruzione>).Invoke()
ja: この単一行ステートメント形式のラムダは、かっこで囲む必要があります。例: (Sub() <ステートメント>).Invoke()
ko: 이 한 줄 문 람다는 괄호로 묶어야 합니다(예: (Sub() <statement>).Invoke()).
pl: Jednowierszowa instrukcja lambda musi być ujęta w nawiasy. Na przykład: (Sub() <instrukcja>).Invoke()
pt_br: O lambda de instrução de uma linha deve estar delimitado por parênteses. Por exemplo: (Sub() <instrução>).Invoke()
ru: Эту лямбду однострочного оператора необходимо заключить в круглые скобки. Например: (Sub() <оператор>).Invoke()
tr: Bu tek satırlı deyim lambdası ayraç içine alınmalıdır. Örnek: (Sub() <deyim>).Invoke()
zh_hans: 此单行语句 lambda 必须括在括号中。例如: (Sub() <语句>).Invoke()
zh_hant: 這個單行陳述式 Lambda 必須放在括號之中。例如: (Sub() <statement>).Invoke()

# ERR_SubRequiresParenthesesLParen
source: This single-line statement lambda must be enclosed in parentheses. For example: Call (Sub() <statement>) ()
cs: Tento výraz lambda jednořádkového příkazu musí být v závorkách. Například: Call (Sub() <příkaz>) ()
de: Diese einzeilige Anweisungslambdafunktion muss in Klammern eingeschlossen sein. Beispiel: Call (Sub() <Anweisung>) ()
es: Esta expresión lambda con una instrucción de una sola línea debe ir entre paréntesis. Por ejemplo: Call (Sub() <instrucción>) ()
fr: Cette lambda-instruction sur une seule ligne doit être mise entre parenthèses. Par exemple : Call (Sub() <instruction>) ()
it: L'espressione lambda di istruzione a riga singola deve essere racchiusa tra parentesi. Ad esempio: Call (Sub() <istruzione>) ()
ja: この単一行ステートメント形式のラムダは、かっこで囲む必要があります。例: Call (Sub() <ステートメント>) ()
ko: 이 한 줄 문 람다는 괄호로 묶어야 합니다(예: Call (Sub() <statement>) ()).
pl: Jednowierszowa instrukcja lambda musi być ujęta w nawiasy. Na przykład: Call (Sub() <instrukcja>) ()
pt_br: O lambda de instrução de uma linha deve estar delimitado por parênteses. Por exemplo: Call (Sub() <instrução>) ()
ru: Эту лямбду однострочного оператора необходимо заключить в круглые скобки. Например: Call (Sub() <оператор>) ()
tr: Bu tek satırlı deyim lambdası ayraç içine alınmalıdır. Örnek: Call (Sub() <deyim>) ()
zh_hans: 此单行语句 lambda 必须括在括号中。例如: Call (Sub() <语句>) ()
zh_hant: 這個單行陳述式 Lambda 必須放在括號之中。例如: Call (Sub() <statement>) ()

# ERR_SubRequiresSingleStatement
source: Single-line statement lambdas must include exactly one statement.
cs: Výrazy lambda jednořádkových příkazů musí obsahovat přesně jeden příkaz.
de: Einzeilige Anweisungslambdafunktionen müssen eine einzelne Anweisung enthalten.
es: Las expresiones lambda de instrucción de una sola línea deben incluir exactamente una instrucción.
fr: Les lambda-instructions sur une seule ligne doivent inclure exactement une instruction.
it: Le espressioni lambda di istruzione a riga singola devono includere una sola istruzione.
ja: 単一行ステートメント形式のラムダには、1 つのステートメントだけを含める必要があります。
ko: 한 줄 문 람다에는 정확히 하나의 문만 있어야 합니다.
pl: Jednowierszowe instrukcje lambda muszą zawierać dokładnie jedną instrukcję.
pt_br: Lambdas de instrução de uma linha devem incluir exatamente uma instrução.
ru: В лямбдах однострочного оператора может содержаться только один оператор.
tr: Tek satırlı deyim lambdaları tam olarak bir deyim içermelidir.
zh_hans: 单行语句 lambda 必须仅包含一个语句。
zh_hant: 單行陳述式 Lambda 只能有一個陳述式。

# ERR_StaticInLambda
source: Static local variables cannot be declared inside lambda expressions.
cs: Statické lokální proměnné nemůžou být deklarované uvnitř výrazů lambda.
de: Statische lokale Variablen können nicht in Lambdaausdrücken deklariert werden.
es: Las variables locales estáticas no se pueden declarar dentro de expresiones lambda.
fr: Les variables locales static ne peuvent pas être déclarées dans des expressions lambda.
it: Non è possibile dichiarare variabili locali statiche all'interno di espressioni lambda.
ja: 静的ローカル変数は、ラムダ式の内部では宣言できません。
ko: static 지역 변수는 람다 식 내부에 선언할 수 없습니다.
pl: Nie można deklarować statycznych zmiennych lokalnych wewnątrz wyrażeń lambda.
pt_br: Não é possível declarar variáveis locais estáticas em expressões lambda.
ru: Статические локальные переменные нельзя задавать в лямбда-выражениях.
tr: Statik yerel değişkenler lambda ifadeleri içinde bildirilemez.
zh_hans: 无法在 lambda 表达式内声明静态局部变量。
zh_hant: Lambda 運算式中不能宣告靜態區域變數。

# ERR_InitializedExpandedProperty
source: Expanded Properties cannot be initialized.
cs: Rozšířené vlastnosti nemůžou být inicializované.
de: Erweiterte Eigenschaften können nicht initialisiert werden.
es: Las propiedades expandidas no se pueden inicializar.
fr: Les propriétés développées ne peuvent pas être initialisées.
it: Non è possibile inizializzare le proprietà espanse.
ja: 展開されたプロパティは初期化できません。
ko: 확장된 속성은 초기화할 수 없습니다.
pl: Rozszerzone właściwości nie mogą być zainicjowane.
pt_br: Não é possível inicializar propriedades expandidas.
ru: Невозможно инициировать расширенные свойства.
tr: Genişletilmiş Özellikler başlatılamıyor.
zh_hans: 无法初始化扩展属性。
zh_hant: 無法初始化展開的屬性。

# ERR_AutoPropertyCantHaveParams
source: Auto-implemented properties cannot have parameters.
cs: Automaticky implementované vlastnosti nemůžou mít parametry.
de: Automatisch implementierte Eigenschaften können keine Parameter besitzen.
es: Las propiedades implementadas automáticamente no pueden tener parámetros.
fr: Les propriétés implémentées automatiquement ne peuvent pas avoir de paramètres.
it: Le proprietà implementate automaticamente non possono avere parametri.
ja: 自動実装プロパティはパラメーターを持つことができません。
ko: 자동 구현 속성은 매개 변수를 사용할 수 없습니다.
pl: Właściwości zaimplementowane automatycznie nie mogą mieć parametrów.
pt_br: Propriedades auto implementadas não podem ter parâmetros.
ru: Автоматически реализованные свойства не могут иметь параметры.
tr: Otomatik uygulanmış özelliklerin parametresi olamaz.
zh_hans: 自动实现的属性不能带有参数。
zh_hant: 自動實作的屬性不能有參數。
