Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_DefAsgNoRetValFuncRef1
source: Function '{0}' doesn't return a value on all code paths. A null reference exception could occur at run time when the result is used.
cs: Funkce {0} nevrací hodnotu u všech cest kódu. V případě použití výsledku může při spuštění dojít k výjimce vyvolané odkazem s hodnotou Null.
de: Die Funktion "{0}" gibt nicht für alle Codepfade einen Wert zurück. Wenn das Ergebnis verwendet wird, kann zur Laufzeit eine NULL-Verweisausnahme auftreten.
es: La función '{0}' no devuelve un valor en todas las rutas de acceso de código. Puede producirse una excepción de referencia NULL en tiempo de ejecución cuando se use el resultado.
fr: La fonction '{0}' ne retourne pas une valeur pour tous les chemins de code. Une exception de référence null peut se produire au moment de l'exécution lorsque le résultat est utilisé.
it: La funzione '{0}' non restituisce un valore in tutti i percorsi del codice. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null quando viene usato il risultato.
ja: 関数 '{0}' は値を返さないコード パスがあります。結果が使用されるときに、null 参照の例外が実行時に発生する可能性があります。
ko: '{0}' 함수가 일부 코드 경로에서만 값을 반환합니다. 이 결과를 사용하면 런타임에 null 참조 예외가 발생할 수 있습니다.
pl: Funkcja „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Podczas wykonywania może wystąpić wyjątek pustej referencji, gdy zostanie użyty wynik.
pt_br: Função "{0}" não retorna um valor em todos os caminhos de código. Uma exceção de referência nula pode ocorrer em tempo de execução quando o resultado é usado.
ru: Функция "{0}" не возвращает значение для всех путей к коду. Во время выполнения при использовании результата может возникнуть пустая ссылка на исключение.
tr: '{0}' işlevi tüm kod yollarında değer döndürmüyor. Sonuç kullanıldığında çalışma zamanında null başvurusu özel durumu oluşabilir.
zh_hans: 函数“{0}”不会在所有代码路径上都返回值。当使用结果时，可能会在运行时发生 null 引用异常。
zh_hant: 函式 '{0}' 並未傳回有關所有程式碼路徑的值。使用該結果時，可能會在執行階段發生 null 參考例外狀況。

# WRN_DefAsgNoRetValFuncRef1_Title
source: Function doesn't return a value on all code paths
cs: Funkce nevrací hodnotu ve všech cestách kódu.
de: Die Funktion gibt nicht für alle Codepfade einen Wert zurück.
es: La función no devuelve un valor en todas las rutas de código
fr: La fonction ne renvoie pas de valeur sur tous les chemins de code
it: La funzione non restituisce un valore per tutti i percorsi del codice
ja: 関数が、すべてのコード パスで値を返しません
ko: 함수가 일부 코드 경로의 값을 반환하지 않음
pl: Funkcja nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: A função não retorna um valor em todos os caminhos de código
ru: Функция не возвращает значение на всех путях к коду
tr: İşlev bütün kod yollarında bir değer döndürmüyor
zh_hans: 函数没有在所有代码路径上返回值
zh_hant: 函式在所有程式碼路徑上皆不會傳回值

# WRN_DefAsgNoRetValOpRef1
source: Operator '{0}' doesn't return a value on all code paths. A null reference exception could occur at run time when the result is used.
cs: Operátor {0} nevrací hodnotu u všech cest kódu. V případě použití výsledku může při spuštění dojít k výjimce vyvolané odkazem s hodnotou Null.
de: Der Operator "{0}" gibt nicht für alle Codepfade einen Wert zurück. Wenn das Ergebnis verwendet wird, kann zur Laufzeit eine NULL-Verweisausnahme auftreten.
es: El operador '{0}' no devuelve un valor en todas las rutas de acceso de código. Puede producirse una excepción de referencia NULL en tiempo de ejecución cuando se use el resultado.
fr: L'opérateur '{0}' ne retourne pas une valeur pour tous les chemins de code. Une exception de référence null peut se produire au moment de l'exécution lorsque le résultat est utilisé.
it: L'operatore '{0}' non restituisce alcun valore per tutti i percorsi del codice. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null quando viene usato il risultato.
ja: 演算子 '{0}' には値を返さないコード パスがあります。結果が使用されるときに、null 参照の例外が実行時に発生する可能性があります。
ko: '{0}' 연산자가 일부 코드 경로에 대해서만 값을 반환합니다. 이 결과를 사용하면 런타임에 null 참조 예외가 발생할 수 있습니다.
pl: Operator „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Podczas wykonywania może wystąpić wyjątek pustej referencji, gdy zostanie użyty wynik.
pt_br: Operador "{0}" não retorna um valor em todos os caminhos de código. Uma exceção de referência nula pode ocorrer em tempo de execução quando o resultado é usado.
ru: Оператор "{0}" не возвращает значение для всех путей к коду. Во время выполнения при использовании результата может возникнуть пустая ссылка на исключение.
tr: '{0}' işleci tüm kod yollarında değer döndürmüyor. Sonuç kullanıldığında çalışma zamanında null başvurusu özel durumu oluşabilir.
zh_hans: 运算符“{0}”不会在所有代码路径上都返回值。当使用结果时，可能会在运行时发生 null 引用异常。
zh_hant: 運算子 '{0}' 並未傳回有關所有程式碼路徑的值。使用該結果時，可能會在執行階段發生 null 參考例外狀況。

# WRN_DefAsgNoRetValOpRef1_Title
source: Operator doesn't return a value on all code paths
cs: Operátor nevrací hodnotu ve všech cestách kódu.
de: Der Operator gibt nicht für alle Codepfade einen Wert zurück.
es: El operador no devuelve un valor en todas las rutas de código
fr: L’opérateur ne renvoie pas de valeur sur tous les chemins de code
it: L'operatore non restituisce un valore per tutti i percorsi del codice
ja: 演算子が、すべてのコード パスで値を返しません
ko: 연산자가 일부 코드 경로의 값을 반환하지 않음
pl: Operator nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: O operador não retorna um valor em todos os caminhos de código
ru: Оператор не возвращает значение на всех путях к коду
tr: İşleç bütün kod yollarında bir değer döndürmüyor
zh_hans: 运算符没有在所有代码路径上返回值
zh_hant: 運算子在所有程式碼路徑上皆不會傳回值

# WRN_DefAsgNoRetValPropRef1
source: Property '{0}' doesn't return a value on all code paths. A null reference exception could occur at run time when the result is used.
cs: Vlastnost {0} nevrací hodnotu u všech cest kódu. V případě použití výsledku může při spuštění dojít k výjimce vyvolané odkazem s hodnotou Null.
de: Die Eigenschaft "{0}" gibt nicht für alle Codepfade einen Wert zurück. Wenn das Ergebnis verwendet wird, kann zur Laufzeit eine NULL-Verweisausnahme auftreten.
es: La propiedad '{0}' no devuelve un valor en todas las rutas de acceso de código. Puede producirse una excepción de referencia NULL en tiempo de ejecución cuando se use el resultado.
fr: La propriété '{0}' ne retourne pas une valeur pour tous les chemins de code. Une exception de référence null peut se produire au moment de l'exécution lorsque le résultat est utilisé.
it: La proprietà '{0}' non restituisce un valore in tutti i percorsi del codice. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null quando viene usato il risultato.
ja: プロパティ '{0}' には値を返さないコード パスがあります。結果が使用されるときに、null 参照の例外が実行時に発生する可能性があります。
ko: '{0}' 속성이 일부 코드 경로에서만 값을 반환합니다. 이 결과를 사용하면 런타임에 null 참조 예외가 발생할 수 있습니다.
pl: Właściwość „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Podczas wykonywania może wystąpić wyjątek pustej referencji, gdy zostanie użyty wynik.
pt_br: Propriedade "{0}" não retorna um valor em todos os caminhos de código. Uma exceção de referência nula pode ocorrer em tempo de execução quando o resultado é usado.
ru: Свойство "{0}" не возвращает значение для всех путей к коду. Во время выполнения при использовании результата может возникнуть пустая ссылка на исключение.
tr: '{0}' özelliği tüm kod yollarında değer döndürmüyor. Sonuç kullanıldığında çalışma zamanında null başvurusu özel durumu oluşabilir.
zh_hans: 属性“{0}”不会在所有代码路径上都返回值。当使用结果时，可能会在运行时发生 null 引用异常。
zh_hant: 屬性 '{0}' 並未傳回有關所有程式碼路徑的值。使用該結果時，可能會在執行階段發生 null 參考例外狀況。

# WRN_DefAsgNoRetValPropRef1_Title
source: Property doesn't return a value on all code paths
cs: Vlastnost nevrací hodnotu ve všech cestách kódu.
de: Die Eigenschaft gibt nicht für alle Codepfade einen Wert zurück.
es: La propiedad no devuelve un valor en todas las rutas de código
fr: La propriété ne renvoie pas une valeur sur tous les chemins d’accès de code
it: La proprietà non restituisce un valore per tutti i percorsi del codice
ja: プロパティが、すべてのコード パスで値を返しません
ko: 속성이 일부 코드 경로의 값을 반환하지 않음
pl: Właściwość nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: A propriedade não retorna um valor em todos os caminhos de código
ru: Свойство не возвращает значение на всех путях к коду
tr: Özellik bütün kod yollarında bir değer döndürmüyor
zh_hans: 属性没有在所有代码路径上返回值
zh_hant: 屬性在所有程式碼路徑上皆不會傳回值

# WRN_DefAsgUseNullRefByRefStr
source: Variable '{0}' is passed by reference before it has been assigned a value. A null reference exception could result at runtime. Make sure the structure or all the reference members are initialized before use
cs: Proměnná {0} se předá pomocí odkazu dřív, než se jí přiřadí hodnota. Při spuštění by mohlo dojít k výjimce vyvolané pomocí odkazu s hodnotou Null. Přesvědčte se, jestli je před použitím inicializovaná struktura nebo všechny členy odkazu.
de: Die {0}-Variable wird als Verweis übergeben, bevor ihr ein Wert zugewiesen wird. Zur Laufzeit kann eine Nullverweisausnahme auftreten. Stellen Sie sicher, dass die Struktur oder alle Verweismember vor der Verwendung initialisiert werden.
es: La variable '{0}' se ha pasado como referencia antes de haberle asignado un valor. Podría producirse una excepción de referencia NULL en tiempo de ejecución. Asegúrese de que la estructura o todos los miembros de referencia se inicialicen antes de usarse.
fr: La variable '{0}' est passée par référence avant qu'une valeur lui ait été attribuée. Cela peut provoquer une exception de référence null au moment de l'exécution. Assurez-vous que la structure et tous les membres de référence sont initialisés avant leur utilisation
it: La variabile '{0}' è stata passata per riferimento prima dell'assegnazione di un valore. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null. Verificare che la struttura o tutti i membri del riferimento siano inizializzati prima di usarli
ja: 変数 '{0}' は、値が割り当てられる前に参照渡しによって渡されています。Null 参照の例外が実行時に発生する可能性があります。構造体、またはすべての参照メンバーが使用前に初期化されていることを確認してください。
ko: 값이 할당되기 전에 '{0}' 변수를 참조로 전달했습니다. 런타임에 null 참조 예외가 발생할 수 있습니다. 사용하기 전에 구조체 또는 모든 참조 멤버가 초기화되었는지 확인하세요.
pl: Zmienna „{0}” jest przekazywana przez referencję, zanim zostanie do niej przypisana wartość. Podczas wykonywania może wystąpić wyjątek referencji o wartości null. Upewnij się, że struktura lub wszystkie składowe odwołania są zainicjowane przed użyciem
pt_br: Variável "{0}" é passada por referência antes de receber um valor. Uma exceção de referência nula poderia resultar em runtime. Certifique-se que a estrutura ou todos os membros de referência são inicializados antes do uso
ru: Переменная "{0}" передается по ссылке, прежде чем ей присваивается значение. Во время выполнения может появиться пустая ссылка на исключение. Убедитесь, что перед использованием инициализирована структура или все ссылочные члены
tr: '{0}' değişkeni, bir değere atanmadan önce başvuru olarak geçirildi. Çalışma zamanında null başvurusu özel durumu oluşabilir. Yapının veya tüm başvuru üyelerinin kullanılmadan önce başlatıldığından emin olun
zh_hans: 变量“{0}”在赋值前通过引用传递。可能会在运行时导致 null 引用异常。请确保结构或所有引用成员在使用前已经初始化
zh_hant: 為變數 '{0}' 指派值之前，已藉傳址方式傳遞該變數。可能會在執行階段產生 null 參考例外狀況。請確定結構或所有的參考成員，都在使用前進行過初始化。

# WRN_DefAsgUseNullRefByRefStr_Title
source: Variable is passed by reference before it has been assigned a value
cs: Proměnná se předává pomocí odkazu dřív, než se k ní přiřadí hodnota.
de: Die Variable wurde als Verweis übergeben, bevor ihr ein Wert zugewiesen wurde.
es: La referencia pasa una variable ates de que se le haya asignado un valor
fr: La variable est transmise par référence avant de se voir attribuer une valeur
it: La variabile è stata passata per riferimento prima dell'assegnazione di un valore
ja: 変数が、値が割り当てられる前に参照渡しによって渡されます
ko: 변수에 값이 할당되기 전에 참조로 변수가 전달됨
pl: Zmienna została przekazana przez referencję przed przypisaniem do niej wartości
pt_br: A variável é passada por referência antes de receber um valor
ru: Переменная передана ссылкой до того, как ей было назначено значение
tr: Değişkene bir değer atanmadan önce değişken başvuruyla geçirildi
zh_hans: 在为变量赋值之前，变量已通过引用传递
zh_hant: 變數在獲派值之前就已藉傳址方式傳遞

# WRN_DefAsgUseNullRefStr
source: Variable '{0}' is used before it has been assigned a value. A null reference exception could result at runtime. Make sure the structure or all the reference members are initialized before use
cs: Proměnná {0} se použije dřív, než se jí přiřadí hodnota. Při spuštění by mohlo dojít k výjimce vyvolané odkazem s hodnotou Null. Přesvědčte se, jestli je před použitím inicializovaná struktura nebo všechny členy odkazu.
de: Die {0}-Variable wird verwendet, bevor ihr ein Wert zugewiesen wird. Zur Laufzeit kann eine Nullverweisausnahme auftreten. Stellen Sie sicher, dass die Struktur oder alle Verweismember vor der Verwendung initialisiert werden.
es: La variable '{0}' se usa antes de que se le haya asignado un valor. Podría producirse una excepción de referencia NULL en tiempo de ejecución. Asegúrese de que la estructura o todos los miembros de referencia se inicialicen antes de usarse.
fr: La variable '{0}' est utilisée avant qu'une valeur ne lui ait été assignée. Une exception de référence null peut se produire au moment de l'exécution. Vérifiez que la structure ou que tous les membres de référence sont initialisés avant de les utiliser
it: La variabile '{0}' è stata usata prima dell'assegnazione di un valore. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null. Verificare che la struttura o tutti i membri del riferimento siano inizializzati prima di usarli
ja: 変数 '{0}' は、値が割り当てられる前に使用されています。Null 参照の例外が実行時に発生する可能性があります。構造体、またはすべての参照メンバーが使用前に初期化されていることを確認してください。
ko: 값이 할당되기 전에 '{0}' 변수를 사용했습니다. 런타임에 null 참조 예외가 발생할 수 있습니다. 사용하기 전에 구조체 또는 모든 참조 멤버가 초기화되었는지 확인하세요.
pl: Zmienna „{0}” jest używana, zanim zostanie do niej przypisana wartość. Podczas wykonywania może wystąpić wyjątek pustej referencji. Upewnij się, że struktura lub wszystkie składowe odwołania są zainicjowane przed użyciem.
pt_br: Variável "{0}" é usada antes de receber um valor. Uma exceção de referência nula poderia resultar em runtime. Certifique-se que a estrutura ou todos os membros de referência são inicializados antes do uso
ru: Используется переменная "{0}", прежде чем ей было присвоено значение. Во время выполнения может появиться пустая ссылка на исключение. Убедитесь, что перед использованием инициализирована структура или все ссылочные члены
tr: '{0}' değişkeni bir değere atanmadan önce kullanıldı. Çalışma zamanında null başvurusu özel durumu oluşabilir. Yapının ve tüm başvuru üyelerinin kullanılmadan önce başlatıldığından emin olun
zh_hans: 变量“{0}”在赋值前被使用。可能会在运行时导致 null 引用异常。请确保结构或所有引用成员在使用前已经初始化
zh_hant: 為變數 '{0}' 指派值之前，已使用該變數。可能會在執行階段產生 null 參考例外狀況。請確定結構或所有的參考成員，都在使用前進行過初始化。

# WRN_DefAsgUseNullRefStr_Title
source: Variable is used before it has been assigned a value
cs: Proměnná se používá dřív, než se k ní přiřadí hodnota.
de: Die Variable wurde verwendet, bevor ihr ein Wert zugewiesen wurde.
es: Se usa la variable antes de que se le haya asignado un valor
fr: La variable est utilisée avant de se voir attribuer une valeur
it: La variabile è stata usata prima dell'assegnazione di un valore
ja: 変数が、値が割り当てられる前に使用されています
ko: 변수에 값이 할당되기 전에 변수가 사용됨
pl: Zmienna została użyta przed przypisaniem do niej wartości
pt_br: A variável é usada antes de receber um valor
ru: Переменная используется до того, как ей было назначено значение
tr: Değişken, bir değer atanmadan kullanıldı
zh_hans: 在为变量赋值之前，变量已被使用
zh_hant: 變數在獲派值之前就已使用

# WRN_StaticLocalNoInference
source: Static variable declared without an 'As' clause; type of Object assumed.
cs: Statická proměnná je deklarovaná bez klauzule As; předpokládá se typ Object.
de: Die statische Variable wurde ohne As-Klausel deklariert. Der Typ "Object" wird angenommen.
es: Variable estática declarada sin una cláusula 'As'; se supone el tipo de Object.
fr: Variable Static déclarée sans clause 'As' ; type Object pris par défaut.
it: La variabile statica è stata dichiarata senza clausola 'As'. Verrà usato il tipo Object.
ja: 静的変数の宣言に 'As' 句がありません。Object 型と見なされます。
ko: As' 절 없이 정적 변수가 선언되었습니다. Object 형식으로 간주합니다.
pl: Zmienna statyczna zadeklarowana bez klauzuli „As”; przyjęto typ Object.
pt_br: Variável estática declarada sem a cláusula 'As'; tipo Object presumido.
ru: Статическая переменная объявлена без предложения "As"; предполагаемый тип — "Object".
tr: Statik değişken 'As' yan tümcesi olmadan bildirildi; Object türü varsayıldı.
zh_hans: 未使用 "As" 子句声明的静态变量；假定为 Object 类型。
zh_hant: 沒有 'As' 子句的靜態變數宣告; 假設是 Object 的類型。

# WRN_StaticLocalNoInference_Title
source: Static variable declared without an 'As' clause
cs: Statická proměnná je deklarovaná bez klauzule As.
de: Die statische Variable wurde ohne As-Klausel deklariert.
es: Se ha declarado una variable estática sin una cláusula 'As'
fr: Variable statique déclarée sans clause 'As'
it: La variabile statica è stata dichiarata senza clausola 'As'
ja: 静的変数の宣言に 'As' 句がありません
ko: As' 절 없이 정적 변수가 선언됨
pl: Zmienna statyczna zadeklarowana bez klauzuli „As”
pt_br: Variável estática sem uma cláusula 'As'
ru: Статическая переменная, объявленная без предложения As
tr: Statik değişken 'As' yan tümcesi olmadan tanımlamış
zh_hans: 声明静态变量时未使用 "As" 子句
zh_hant: 宣告的靜態變數沒有 'As' 子句

# WRN_InvalidAssemblyName
source: Assembly reference '{0}' is invalid and cannot be resolved.
cs: Odkaz na sestavení {0} je neplatný a nedá se vyhodnotit.
de: Der Assemblyverweis "{0}" ist ungültig und kann nicht aufgelöst werden.
es: La referencia de ensamblado '{0}' no es válida y no se puede resolver.
fr: La référence d'assembly '{0}' n'est pas valide et ne peut pas être résolue.
it: Il riferimento all'assembly '{0}' non è valido e non può essere risolto.
ja: アセンブリ参照 '{0}' は無効なため、解決できません。
ko: '{0}' 어셈블리 참조가 잘못되어 확인할 수 없습니다.
pl: Odwołanie do zestawu „{0}” jest nieprawidłowe i nie można go rozpoznać.
pt_br: Referência de assembly "{0}" é inválida e não pode ser resolvida.
ru: Ссылка сборки "{0}" является недопустимой и не может быть разрешена.
tr: '{0}' derleme başvurusu geçersiz ve çözülemiyor.
zh_hans: 程序集引用“{0}”无效，无法解析。
zh_hant: 組件參考 '{0}' 無效，無法解析。

# WRN_InvalidAssemblyName_Title
source: Assembly reference is invalid and cannot be resolved
cs: Odkaz na sestavení je neplatný a nedá se vyhodnotit.
de: Der Assemblyverweis ist ungültig und kann nicht aufgelöst werden.
es: La referencia de ensamblado no es válida y no se puede resolver
fr: La référence d'assembly n'est pas valide et ne peut pas être résolue
it: Il riferimento all'assembly non è valido e non può essere risolto
ja: アセンブリ参照が無効で、解決できません
ko: 어셈블리 참조가 잘못되어 확인할 수 없습니다.
pl: Odwołanie do zestawu jest nieprawidłowe i nie można go rozpoznać
pt_br: A referência de assembly é inválida e não pode ser resolvida
ru: Ссылка на сборку недопустима и не может быть разрешена
tr: Derleme başvurusu geçersiz ve çözümlenemiyor
zh_hans: 程序集引用无效，无法解析
zh_hant: 組件參考無效，無法進行解析

# WRN_XMLDocBadXMLLine
source: XML comment block must immediately precede the language element to which it applies. XML comment will be ignored.
cs: Blok komentáře XML musí být bezprostředně před elementem jazyka, na který se vztahuje. Komentář XML se bude ignorovat.
de: Der XML-Kommentarblock muss direkt vor dem Sprachelement stehen, auf das er sich bezieht. Der XML-Kommentar wird ignoriert.
es: El bloque de comentario XML debe preceder directamente al elemento de lenguaje al que se aplica. Se omitirá el comentario XML.
fr: Le bloc de commentaires XML doit précéder immédiatement l'élément de langage auquel il se rapporte. Le commentaire XML sera ignoré.
it: Il blocco di commento XML deve essere specificato immediatamente prima dell'elemento del linguaggio a cui si riferisce. Il commento XML verrà ignorato.
ja: XML コメント ブロックは、適用される言語要素の直前に配置しなければなりません。XML コメントは無視されます。
ko: XML 주석 블록은 이 주석 블록이 적용되는 언어 요소의 바로 앞에 와야 합니다. XML 주석이 무시됩니다.
pl: Blok komentarza XML musi bezpośrednio poprzedzać element języka, do którego jest stosowany. Komentarz XML zostanie zignorowany.
pt_br: O bloco de comentários XML deve preceder imediatamente o elemento de linguagem ao qual se aplica. Os comentários em XML serão ignorados.
ru: Непосредственно перед блоком комментариев XML должен находиться элемент языка, к которому он применяется. Комментарий XML будет игнорироваться.
tr: XML açıklama bloğu uyguladığı dil öğesinden hemen önce gelmelidir. XML açıklaması yoksayılacak.
zh_hans: XML 注释块必须紧挨着它应用于的语言元素的前面。XML 注释将被忽略。
zh_hant: XML 註解區塊必須緊接在所套用的語言元素之前。將會忽略 XML 註解。

# WRN_XMLDocBadXMLLine_Title
source: XML comment block must immediately precede the language element to which it applies
cs: Blok komentáře XML musí bezprostředně předcházet elementu jazyka, ke kterému se vztahuje.
de: Der XML-Kommentarblock muss unmittelbar vor dem Sprachelement stehen, für das er angewendet wird.
es: El bloque de comentario XML debe preceder inmediatamente al elemento de idioma al que se aplica
fr: Le bloc de commentaires XML doit précéder immédiatement l’élément de langage auquel il se rapporte
it: Il blocco di commento XML deve essere specificato subito prima dell'elemento del linguaggio a cui si riferisce
ja: XML コメント ブロックは、適用される言語要素の直前に配置しなければなりません
ko: XML 주석 블록은 이 주석 블록이 적용되는 언어 요소의 바로 앞에 와야 함
pl: Blok komentarza XML musi bezpośrednio poprzedzać element języka, do którego jest stosowany
pt_br: O bloco de comentário XML deve preceder imediatamente o elemento de linguagem ao qual se aplica
ru: Блок комментариев XML должен находиться непосредственно перед элементом языка, к которому он применяется
tr: XML açıklama bloğu uygulandığı dil öğesinden hemen önce gelmelidir
zh_hans: XML 注释块必须紧跟它所应用于的语言元素
zh_hant: XML 註解區塊必須緊接在所套用的語言項目之前

# WRN_XMLDocMoreThanOneCommentBlock
source: Only one XML comment block is allowed per language element.
cs: Povoluje se jenom jeden blok komentáře XML na jeden element jazyka.
de: Pro Sprachelement ist nur ein XML-Kommentarblock zulässig.
es: Únicamente se permite un bloque de comentario XML por elemento de lenguaje.
fr: Un seul bloc de commentaires XML est autorisé par élément de langage.
it: Per ogni elemento di linguaggio è consentito solo un blocco di commento XML.
ja: 各言語要素につき 1 つの XML コメント ブロックのみが許可されます。
ko: XML 주석 블록은 언어 요소마다 하나만 사용할 수 있습니다.
pl: Tylko jeden blok komentarza XML może przypadać na element języka.
pt_br: Somente um bloco de comentário XML é permitido por elemento de linguagem.
ru: Только один блок комментариев XML допускается для каждого элемента языка.
tr: Dil öğesi başına yalnızca bir XML açıklama bloğu olabilir.
zh_hans: 每个语言元素只能有一个 XML 注释块。
zh_hant: 每個語言項目只允許一個 XML 註解區塊。

# WRN_XMLDocMoreThanOneCommentBlock_Title
source: Only one XML comment block is allowed per language element
cs: Povoluje se jenom jeden blok komentáře XML na jeden element jazyka.
de: Pro Sprachelement ist nur ein XML-Kommentarblock zulässig.
es: Solo se permite un bloque de comentario XML por elemento de lenguaje
fr: Un seul bloc de commentaires XML est autorisé par élément de langage
it: Per ogni elemento di linguaggio è consentito solo un blocco di commento XML
ja: 各言語要素につき 1 つの XML コメント ブロックのみが許可されます
ko: XML 주석 블록은 언어 요소마다 하나만 사용할 수 있음
pl: Dozwolony jest tylko jeden blok komentarza XML na element języka
pt_br: Somente um bloco de comentário XML é permitido por elemento de linguagem
ru: Только один блок комментариев XML допускается для каждого элемента языка
tr: Dil öğesi başına yalnızca bir XML açıklama bloğuna izin verilir
zh_hans: 每个语言元素只能有一个 XML 注释块
zh_hant: 每個語言項目只允許一個 XML 註解區塊
