Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadAnonymousTypeForExprTree
source: Cannot convert anonymous type to an expression tree because a property of the type is used to initialize another property.
cs: Anonymní typ nejde převést na strom výrazů, protože vlastnost tohoto typu se používá k inicializaci jiné vlastnosti.
de: Der anonyme Typ kann nicht in einen Ausdrucksbaum konvertiert werden, da eine Eigenschaft des Typs für das Initialisieren einer anderen Eigenschaft verwendet wird.
es: No se puede convertir el tipo anónimo en un árbol de expresión porque una propiedad del tipo se usa para inicializar otra propiedad.
fr: Impossible de convertir le type anonyme en arborescence de l'expression, car une propriété de ce type sert à initialiser une autre propriété.
it: Non è possibile convertire il tipo anonimo in un albero delle espressioni perché una proprietà del tipo viene usata per inizializzare un'altra proprietà.
ja: 匿名型を式ツリーに変換できません。この型のプロパティは、別のプロパティを初期化するために使用されています。
ko: 익명 형식의 속성이 다른 속성을 초기화하는 데 사용되므로 익명 형식을 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować typu anonimowego na drzewo wyrażenia, ponieważ właściwość typu jest używana do inicjowania innej właściwości.
pt_br: Não é possível converter o tipo anônimo em uma árvore de expressão porque uma propriedade de tipo é usada para inicializar outra.
ru: Не удается преобразовать анонимный тип к дереву выражения, так как свойство типа используется для инициализации другого свойства.
tr: Anonim türün bir özelliği başka bir özelliği başlatmak için kullanıldığından tür ifade ağacına dönüştürülemiyor.
zh_hans: 无法将匿名类型转换为表达式树，因为此类型的属性用于初始化其他属性。
zh_hant: 無法將匿名類型轉換成運算式樹狀結構，因為類型的屬性會用以初始化另一個屬性。

# ERR_CannotLiftAnonymousType1
source: Anonymous type property '{0}' cannot be used in the definition of a lambda expression within the same initialization list.
cs: Vlastnost anonymního typu {0} nejde použít v definici výrazu lambda v rámci stejného inicializačního seznamu.
de: Die anonyme Typeigenschaft "{0}" kann nicht in der Definition eines Lambdaausdrucks innerhalb derselben Initialisierungsliste verwendet werden.
es: No se puede usar la propiedad de tipo anónimo '{0}' en la definición de una expresión lambda en la misma lista de inicialización.
fr: La propriété de type anonyme '{0}' ne peut pas être utilisée dans la définition d'une expression lambda au sein de la même liste d'initialisation.
it: Non è possibile usare la proprietà di tipo anonimo '{0}' nella definizione di un'espressione lambda nello stesso elenco di inizializzazione.
ja: 匿名型プロパティ '{0}' を、同じ初期化リスト内のラムダ式の定義で使用することはできません。
ko: 동일한 초기화 목록 내의 람다 식 정의에는 익명 형식 속성 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można użyć właściwości typu anonimowego „{0}” w definicji wyrażenia lambda w obrębie tej samej listy inicjowania.
pt_br: Instância de tipo anônima "{0}" não pode ser usada na definição de uma expressão lambda na mesma lista de inicialização.
ru: Нельзя использовать свойство анонимного типа "{0}" в определении лямбда-выражения в рамках одного списка инициализации.
tr: '{0}' anonim tür özelliği aynı başlatma listesindeki bir lambda ifadesi tanımında kullanılamaz.
zh_hans: 不能在同一个初始化列表中的 lambda 表达式定义中使用匿名类型属性“{0}”。
zh_hant: 匿名類型屬性 '{0}' 不可用在同一個初始設定清單中之 Lambda 運算式的定義內。

# ERR_ExtensionOnlyAllowedOnModuleSubOrFunction
source: 'Extension' attribute can be applied only to 'Module', 'Sub', or 'Function' declarations.
cs: 'Atribut Extension jde použít jenom v deklaracích Module, Sub a Function.
de: 'Das Extension-Attribut darf nur in Module-, Sub- oder Function-Deklarationen verwendet werden.
es: 'El atributo 'Extension' solo se puede aplicar a las declaraciones 'Module', 'Sub' o 'Function'.
fr: 'L'attribut 'Extension' ne peut être appliqué qu'aux déclarations 'Module', 'Sub' ou 'Function'.
it: 'È possibile applicare l'attributo 'Extension' solo alle dichiarazioni 'Module', 'Sub' o 'Function'.
ja: 'Extension' 属性は 'Module'、'Sub'、または 'Function' の各宣言にのみ適用できます。
ko: 'Extension' 특성은 'Module', 'Sub' 또는 'Function' 선언에만 적용할 수 있습니다.
pl: 'Atrybut „Extension” można stosować tylko w deklaracjach „Module”, „Sub” lub „Function”.
pt_br: 'O atributo 'Extension' só pode ser aplicado para declarações 'Module', 'Sub', ou 'Function'.
ru: 'Атрибут "Extension" можно применять только к объявлениям "Module", "Sub" или "Function".
tr: 'Extension' özniteliği yalnızca 'Module', 'Sub' veya 'Function' bildirimlerine uygulanabilir.
zh_hans: '“Extension”特性只能应用于“Module”、“Sub”或“Function”声明。
zh_hant: 'Extension' 屬性只能套用到 'Module'、'Sub' 或 'Function' 宣告。

# ERR_ExtensionMethodNotInModule
source: Extension methods can be defined only in modules.
cs: Metody rozšíření jde definovat jen v modulech.
de: Erweiterungsmethoden können nur in Modulen definiert werden.
es: Los métodos de extensión se pueden definir solo en módulos.
fr: Les méthodes d'extension ne peuvent être définies que dans des modules.
it: I metodi di estensione possono essere definiti solo nei moduli.
ja: 拡張メソッドはモジュール内でのみ定義できます。
ko: 확장 메서드는 모듈에만 정의할 수 있습니다.
pl: Metody rozszerzenia można definiować tylko w modułach.
pt_br: Os métodos de extensão podem ser definidos apenas em módulos.
ru: Методы расширения могут определяться только в модулях.
tr: Genişletme yöntemleri yalnızca modüllerde tanımlanabilir.
zh_hans: 只能在模块中定义扩展方法。
zh_hant: 擴充方法只能在模組內定義。

# ERR_ExtensionMethodNoParams
source: Extension methods must declare at least one parameter. The first parameter specifies which type to extend.
cs: Metody rozšíření musí deklarovat aspoň jeden parametr. První parametr určuje, který typ daná metoda rozšiřuje.
de: Erweiterungsmethoden müssen mindestens einen Parameter deklarieren. Der erste Parameter gibt den zu erweiternden Typ an.
es: Los métodos de extensión deben declarar al menos un parámetro. El primer parámetro especifica el tipo que se debe extender.
fr: Les méthodes d'extension doivent déclarer au moins un paramètre. Le premier paramètre spécifie le type à étendre.
it: I metodi di estensione devono dichiarare almeno un parametro. Il primo parametro specifica il tipo da estendere.
ja: 拡張メソッドは、少なくとも 1 つのパラメーターを宣言する必要があります。最初のパラメーターでは、拡張する型を指定します。
ko: 확장 메서드는 하나 이상의 매개 변수를 선언해야 합니다. 첫 번째 매개 변수는 확장할 형식을 지정합니다.
pl: Metody rozszerzenia muszą deklarować co najmniej jeden parametr. Pierwszy parametr określa typ do rozszerzenia.
pt_br: Os métodos de extensão devem declarar pelo menos um parâmetro. O primeiro parâmetro especifica qual o tipo a ser estendido.
ru: Методы расширения должны объявлять не менее одного параметра. Первый параметр указывает тип для расширения.
tr: Genişletme yöntemleri en az bir parametre bildirmelidir. İlk parametre hangi türün genişletileceğini belirtir.
zh_hans: 扩展方法必须至少声明一个参数。第一个参数指定要扩展的类型。
zh_hant: 擴充方法必須宣告至少一個參數。第一個參數會指定要擴充的類型。

# ERR_ExtensionMethodOptionalFirstArg
source: 'Optional' cannot be applied to the first parameter of an extension method. The first parameter specifies which type to extend.
cs: 'Modifikátor Optional nejde použít pro první parametr metody rozšíření. První parametr určuje, který typ daná metoda rozšiřuje.
de: '"Optional" kann nicht auf den ersten Parameter einer Erweiterungsmethode angewendet werden. Der erste Parameter gibt den zu erweiternden Typ an.
es: 'No se puede aplicar 'Optional' al primer parámetro de un método de extensión. El primer parámetro especifica el tipo que se debe extender.
fr: 'Optional' ne peut pas être appliqué au premier paramètre d'une méthode d'extension. Le premier paramètre spécifie le type à étendre.
it: 'Non è possibile applicare 'Optional' al primo parametro di un metodo di estensione. Il primo parametro specifica il tipo da estendere.
ja: 'Optional' は、拡張メソッドの最初のパラメーターには適用できません。最初のパラメーターでは、拡張する型を指定します。
ko: 'Optional'은 확장 메서드의 첫 번째 매개 변수에 적용할 수 없습니다. 첫 번째 매개 변수는 확장할 형식을 지정합니다.
pl: 'Nie można zastosować elementu „Optional” do pierwszego parametru metody rozszerzenia. Pierwszy parametr określa typ do rozszerzenia.
pt_br: 'Não é possível aplicar 'Optional' ao primeiro parâmetro de um método de extensão. O primeiro parâmetro especifica qual tipo estender.
ru: '"Optional" нельзя применять к первому параметру метода расширения. Первый параметр указывает тип для расширения.
tr: 'Genişletme yönteminin ilk parametresine 'Optional' uygulanamaz. İlk parametre hangi türün genişletileceğini belirtir.
zh_hans: '“Optional”无法应用于扩展方法的第一个参数。第一个参数指定要扩展哪个类型。
zh_hant: 'Optional' 不能套用至擴充方法的第一個參數。第一個參數會指定要擴充的類型。

# ERR_ExtensionMethodParamArrayFirstArg
source: 'ParamArray' cannot be applied to the first parameter of an extension method. The first parameter specifies which type to extend.
cs: 'Modifikátor ParamArray nejde použít pro první parametr metody rozšíření. První parametr určuje, který typ daná metoda rozšiřuje.
de: '"ParamArray" kann nicht auf den ersten Parameter einer Erweiterungsmethode angewendet werden. Der erste Parameter gibt den zu erweiternden Typ an.
es: 'No se puede aplicar 'ParamArray' al primer parámetro de un método de extensión. El primer parámetro especifica el tipo que se debe extender.
fr: 'ParamArray' ne peut pas être appliqué au premier paramètre d'une méthode d'extension. Le premier paramètre spécifie le type à étendre.
it: 'Non è possibile applicare 'ParamArray' al primo parametro di un metodo di estensione. Il primo parametro specifica il tipo da estendere.
ja: 'ParamArray' は、拡張メソッドの最初のパラメーターには適用できません。最初のパラメーターでは、拡張する型を指定します。
ko: 'ParamArray'는 확장 메서드의 첫 번째 매개 변수에 적용할 수 없습니다. 첫 번째 매개 변수는 확장할 형식을 지정합니다.
pl: 'Nie można zastosować elementu „ParamArray” do pierwszego parametru metody rozszerzenia. Pierwszy parametr określa typ do rozszerzenia.
pt_br: 'Não é possível aplicar 'ParamArray' ao primeiro parâmetro de um método de extensão. O primeiro parâmetro especifica qual tipo estender.
ru: '"ParamArray" нельзя применять к первому параметру метода расширения. Первый параметр указывает тип для расширения.
tr: 'Genişletme yönteminin ilk parametresine 'ParamArray' uygulanamaz. İlk parametre hangi türün genişletileceğini belirtir.
zh_hans: "ParamArray" 无法应用于扩展方法的第一个参数。第一个参数指定要扩展哪个类型。
zh_hant: 'ParamArray' 不能套用至擴充方法的第一個參數。第一個參數會指定要擴充的類型。

# ERR_AnonymousTypeFieldNameInference
source: Anonymous type member name can be inferred only from a simple or qualified name with no arguments.
cs: Název členu anonymního typu jde odvodit jenom z jednoduchého nebo kvalifikovaného názvu bez argumentů.
de: Der Membername eines anonymen Typs kann nur von einem einfachen oder qualifizierten Namen ohne Argumente abgeleitet werden.
es: El nombre de miembro de tipo anónimo solo se puede inferir a partir de un nombre simple o completo sin argumentos.
fr: Le nom du membre de type anonyme ne peut être déduit qu'à partir d'un nom simple ou qualifié sans argument.
it: Il nome di membro di tipo anonimo può essere dedotto solo da un nome semplice o completo senza argomenti.
ja: 匿名型メンバーの名前は、引数なしの簡易名または修飾名からのみ推論できます。
ko: 익명 형식 멤버 이름은 인수가 없는 단순한 이름 또는 정규화된 이름에서만 유추할 수 있습니다.
pl: Nazwę składowej typu anonimowego można wywnioskować tylko na podstawie prostej lub kwalifikowanej nazwy bez argumentów.
pt_br: O nome do membro de tipo anônimo pode ser deduzido apenas a partir de um nome simples ou qualificado sem argumentos.
ru: Имя члена анонимного типа может быть определено только из простого или полного имени без аргументов.
tr: Anonim türdeki üye adı yalnızca bağımsız değişken içermeyen basit veya tam bir addan çıkarsanabilir.
zh_hans: 只能从不带参数的简单名或限定名中推断匿名类型成员名称。
zh_hant: 只能從不含引數的簡單或限定名稱來推斷匿名類型成員名稱。

# ERR_NameNotMemberOfAnonymousType2
source: '{0}' is not a member of '{1}'; it does not exist in the current context.
cs: '{0} není členem {1} a v aktuálním kontextu neexistuje.
de: '"{0}" ist kein Member von "{1}" und ist im aktuellen Kontext nicht vorhanden.
es: '{0}' no es un miembro de '{1}'; no existe en el contexto actual.
fr: '{0}' n'est pas membre de '{1}' ; il n'existe pas dans le contexte actuel.
it: '{0}' non è un membro di '{1}' e non esiste nel contesto corrente.
ja: '{0}' は '{1}' のメンバーではなく、現在のコンテキストに存在しません。
ko: '{0}'은(는) '{1}'의 멤버가 아닙니다. 현재 컨텍스트에 없습니다.
pl: 'Element „{0}” nie jest składową elementu „{1}”. Nie istnieje on w bieżącym kontekście.
pt_br: "{0}" não é um membro de "{1}"; ele não existe no contexto atual.
ru: "{0}" не является членом "{1}"; он не существует в текущем контексте.
tr: '{0}', bir '{1}' üyesi değil; bu, geçerli bağlamda yok.
zh_hans: '“{0}”不是“{1}”的成员；它不存在于当前上下文。
zh_hant: '{0}' 不是 '{1}' 的成員，其不存在於目前的內容中。

# ERR_ExtensionAttributeInvalid
source: The custom-designed version of 'System.Runtime.CompilerServices.ExtensionAttribute' found by the compiler is not valid. Its attribute usage flags must be set to allow assemblies, classes, and methods.
cs: Vlastní návrh verze System.Runtime.CompilerServices.ExtensionAttribute nalezený kompilátorem je neplatný. Příznaky použití atributů musí být u této verze nastavené tak, aby povolovaly sestavení, třídy a metody.
de: Die vom Compiler gefundene benutzerdefinierte Version von "System.Runtime.CompilerServices.ExtensionAttribute" ist nicht gültig. Die Flags für die Attributverwendung müssen so festgelegt sein, dass Assemblys, Klassen und Methoden zulässig sind.
es: La versión con diseño personalizado de 'System.Runtime.CompilerServices.ExtensionAttribute' que encontró el compilador no es válida. Se deben establecer sus marcas de uso de atributos para que permitan ensamblados, clases y métodos.
fr: La version personnalisée de 'System.Runtime.CompilerServices.ExtensionAttribute' trouvée par le compilateur n'est pas valide. Ses indicateurs d'utilisation d'attribut doivent être définis pour autoriser les assemblys, les classes et les méthodes.
it: La versione personalizzata di 'System.Runtime.CompilerServices.ExtensionAttribute' trovata dal compilatore non è valida. I flag di utilizzo degli attributi devono essere impostati per consentire assembly, classi e metodi.
ja: カスタム デザイン バージョンの 'System.Runtime.CompilerServices.ExtensionAttribute' がコンパイラにより検出されましたが、有効ではありません。その属性の使用フラグを、アセンブリ、クラス、およびメソッドが許可されるように設定する必要があります。
ko: 컴파일러에서 검색한 'System.Runtime.CompilerServices.ExtensionAttribute'의 사용자 지정 디자인 버전이 잘못되었습니다. 해당 특성 사용 플래그가 어셈블리, 클래스 및 메서드를 허용하도록 설정되어야 합니다.
pl: Niestandardowo zaprojektowana wersja klasy „System.Runtime.CompilerServices.ExtensionAttribute” odnaleziona przez kompilator jest nieprawidłowa. Jej flagi użycia atrybutów należy ustawić tak, aby zezwalały na zestawy, klasy i metody.
pt_br: A versão personalizada de 'System.Runtime.CompilerServices.ExtensionAttribute' encontrada pelo compilador não é válida. Os sinalizadores de utilização de atributo devem ser definidos para permitir assemblies, classes e métodos.
ru: Нестандартная версия атрибута "System.Runtime.CompilerServices.ExtensionAttribute", обнаруженная компилятором, недопустима. Флаги использования ее атрибутов должны быть установлены таким образом, чтобы задействовать сборки, классы и методы.
tr: Derleyici tarafından bulunan özel tasarlanmış 'System.Runtime.CompilerServices.ExtensionAttribute' sürümü geçerli değil. Öznitelik kullanım bayrakları derlemelere, sınıflara ve yöntemlere izin verecek şekilde ayarlanmalıdır.
zh_hans: 编译器找到的“System.Runtime.CompilerServices.ExtensionAttribute”的自定义设计版本无效。必须将其特性用法标志设置为允许程序集、类和方法使用。
zh_hant: 這個由編譯器所發現的 'System.Runtime.CompilerServices.ExtensionAttribute' 自訂版本無效。它的屬性使用方式旗標必須設定成允許組件、類別和方法。

# ERR_AnonymousTypePropertyOutOfOrder1
source: Anonymous type member property '{0}' cannot be used to infer the type of another member property because the type of '{0}' is not yet established.
cs: Vlastnost {0} členu anonymního typu nejde použít k odvození typu jiné vlastnosti členu, protože typ {0} zatím není vytvořený.
de: Die Membereigenschaft "{0}" eines anonymen Typs kann nicht zum Ableiten des Typs einer anderen Membereigenschaft verwendet werden, da der Typ von "{0}" noch nicht bekannt ist.
es: La propiedad '{0}' del miembro de tipo anónimo no se puede usar para inferir el tipo de otra propiedad de miembro porque el tipo de '{0}' no se ha establecido aún.
fr: La propriété du membre de type anonyme '{0}' ne peut pas être utilisée pour déduire le type d'une autre propriété de membre, car le type de '{0}' n'est pas encore établi.
it: Non è possibile usare la proprietà di membro '{0}' di tipo anonimo per dedurre il tipo di un'altra proprietà di membro perché il tipo di '{0}' non è ancora stabilito.
ja: '{0}' の型がまだ確立されていないため、匿名型メンバーのプロパティ '{0}' を使用して別のメンバーのプロパティの型を推論することはできません。
ko: '{0}' 형식이 아직 설정되지 않아 다른 멤버 속성의 형식을 유추하는 데 익명 형식 멤버 속성 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można użyć właściwości składowej typu anonimowego „{0}” do wywnioskowania typu innej właściwości składowej, ponieważ typ elementu „{0}” nie jest jeszcze ustalony.
pt_br: Propriedade de membro de tipo anônimo "{0}" não pode ser usada para inferir o tipo de outra propriedade de membro porque o tipo de "{0}" ainda não está estabelecida.
ru: Свойство члена анонимного типа "{0}" нельзя использовать для определения типа другого свойства члена, поскольку тип "{0}" еще не установлен.
tr: Anonim türdeki '{0}' üye özelliğinin türü henüz oluşturulmadığından, '{0}' üye özelliği başka bir üye özelliğinin türünü çıkarsamak için kullanılamaz.
zh_hans: 无法使用匿名类型成员属性“{0}”来推断另一个成员属性的类型，因为尚未建立“{0}”的类型。
zh_hant: 匿名類型成員屬性 '{0}' 無法用以推斷另一個成員屬性的類型，因為尚未建立類型 '{0}'。

# ERR_AnonymousTypeDisallowsTypeChar
source: Type characters cannot be used in anonymous type declarations.
cs: V deklaracích anonymních typů nejde použít znaky typu.
de: Typzeichen können in anonymen Typdeklarationen nicht verwendet werden.
es: No se pueden usar caracteres de tipo en declaraciones de tipos anónimos.
fr: Les caractères de type ne peuvent pas être utilisés dans des déclarations de type anonymes.
it: Non è possibile usare i caratteri tipo nelle dichiarazioni di tipi anonimi.
ja: 型文字を匿名型の宣言で使用することはできません。
ko: 형식 문자는 익명 형식 선언에 사용할 수 없습니다.
pl: Nie można używać znaków typu w deklaracjach typów anonimowych.
pt_br: Os caracteres do tipo não podem ser usados em declarações de tipo anônimo.
ru: Символы типа не могут быть использованы в объявлении анонимного типа.
tr: Anonim türdeki bildirimlerde tür karakterleri kullanılamaz.
zh_hans: 不能在匿名类型声明中使用类型字符。
zh_hant: 匿名類型宣告中不能使用類型字元。

# ERR_TupleLiteralDisallowsTypeChar
source: Type characters cannot be used in tuple literals.
cs: Znaky typů nejde použít v literálech řazené kolekce členů.
de: Typzeichen dürfen in Tupelliteralen nicht verwendet werden.
es: No se pueden usar caracteres de tipo en los literales de tupla.
fr: Impossible d'utiliser des caractères de type dans des littéraux de tuple.
it: Non è possibile usare caratteri di tipo in valori letterali di tupla.
ja: 型文字はタプル リテラルでは使用できません。
ko: 형식 문자는 튜플 리터럴에 사용할 수 없습니다.
pl: Znaki typu nie mogą być używane w literałach krotek.
pt_br: Caracteres de tipo não podem ser usados em literais de tupla.
ru: Символы типа невозможно использовать в литералах кортежа.
tr: Tür karakterleri demet sabit değerlerinde kullanılamaz.
zh_hans: 类型字符无法用在元组文本中。
zh_hant: 元組常值中不得使用類型字元。

# ERR_NewWithTupleTypeSyntax
source: 'New' cannot be used with tuple type. Use a tuple literal expression instead.
cs: 'New není možné použít s typem řazené kolekce členů. Použijte raději literálový výraz řazené kolekce členů.
de: '"New" kann mit dem Tupeltyp nicht verwendet werden. Verwenden Sie stattdessen einen literalen Tupelausdruck.
es: '"New" no se puede usar con un tipo de tupla. Use una expresión literal de tupla en su lugar.
fr: 'Impossible d'utiliser 'new' avec le type tuple. Utilisez une expression littérale de tuple à la place.
it: 'Non è possibile usare 'New' con il tipo tupla. Usare un'espressione letterale di tupla.
ja: 'new' はタプル型では併用できません。代わりに、タプル リテラル式を使用します。
ko: 'New'는 튜플 형식과 함께 사용할 수 없습니다. 대신 튜플 리터럴 식을 사용하세요.
pl: 'Instrukcji „new” nie można użyć dla typu krotki. Użyj zamiast tego wyrażenia literału krotki.
pt_br: 'New' não pode ser usado com o tipo da tupla. Use uma expressão literal da tupla no lugar.
ru: '"New" невозможно использовать с типом кортежа. Вместо этого примените литеральное выражение кортежа.
tr: 'Yeni' seçeneği demet türü ile kullanılamaz. Bunun yerine bir demet sabit değer ifadesi kullanın.
zh_hans: '"New" 不能用于元组类型。请改用元组文本表达式。
zh_hant: 'Tuple 類型不得使用 'New'。請改用 Tuple 常值運算式。

# ERR_PredefinedValueTupleTypeMustBeStruct
source: Predefined type '{0}' must be a structure.
cs: Předdefinovaný typ {0} musí být struktura.
de: Der vordefinierte Typ "{0}" muss eine Struktur sein.
es: El tipo predefinido '{0}' debe ser una estructura.
fr: Le type prédéfini '{0}' doit être une structure.
it: Il tipo predefinito '{0}' deve essere una struttura.
ja: 定義済みの型 '{0}' は、構造体である必要があります。
ko: 미리 정의된 형식 '{0}'은(는) 구조체여야 합니다.
pl: Wstępnie zdefiniowany typ „{0}” musi być strukturą.
pt_br: O tipo predefinido '{0}' deve ser uma estrutura.
ru: Предопределенный тип "{0}" должен быть структурой.
tr: Önceden tanımlı '{0}' türü bir yapı olmalıdır.
zh_hans: 预定义的类型“{0}”必须是一种结构。
zh_hant: 預先定義的類型 '{0}' 必須是結構。

# ERR_ExtensionMethodUncallable1
source: Extension method '{0}' has type constraints that can never be satisfied.
cs: Omezení typu metody rozšíření {0} jsou nesplnitelná.
de: Die Erweiterungsmethode "{0}" verfügt über Typeinschränkungen, die nie erfüllt werden.
es: El método de extensión '{0}' tiene restricciones de tipo que no se pueden cumplir nunca.
fr: La méthode d'extension '{0}' a des contraintes de type qui ne peuvent pas être satisfaites.
it: I vincoli di tipo del metodo di estensione '{0}' non possono mai essere soddisfatti.
ja: 拡張メソッド '{0}' に、満たされる可能性のない型制約があります。
ko: 확장 메서드 '{0}'에 충족될 수 없는 형식 제약 조건이 있습니다.
pl: Metoda rozszerzenia „{0}” ma ograniczenia typu, których nie będzie można nigdy spełnić.
pt_br: Método de extensão "{0}" tem restrições de tipo que nunca podem ser atendidas.
ru: Метод расширения "{0}" содержит ограничения типа, которые не могут быть соблюдены.
tr: '{0}' genişletme yönteminin asla karşılanamayacak tür kısıtlamaları var.
zh_hans: 扩展方法“{0}”具有无法满足的类型约束。
zh_hant: 擴充方法 '{0}' 有一直無法滿足的類型條件約束。

# ERR_ExtensionMethodOverloadCandidate3
source: Extension method '{0}' defined in '{1}': {2}
cs: Metoda rozšíření {0} definovaná v {1}: {2}
de: Erweiterungsmethode "{0}" in "{1}" definiert: {2}
es: Método de extensión '{0}' definido en '{1}': {2}
fr: Méthode d'extension '{0}' définie dans '{1}': {2}
it: Metodo di estensione '{0}' definito in '{1}': {2}
ja: '{1}' で定義された拡張メソッド '{0}': {2}
ko: '{1}'에서 '{0}' 확장 메서드가 정의되었습니다({2}).
pl: Metoda rozszerzenia „{0}” zdefiniowana w elemencie „{1}”: {2}
pt_br: Método de extensão "{0}" definido em "{1}": {2}
ru: Метод расширения "{0}" определен в "{1}": {2}
tr: '{1}' içinde '{0}' genişletme yöntemi tanımlandı: {2}
zh_hans: “{1}”中定义的扩展方法“{0}”: {2}
zh_hant: 定義於 '{1}' 中的擴充方法 '{0}': {2}

# ERR_DelegateBindingMismatch
source: Method does not have a signature compatible with the delegate.
cs: Podpis metody není kompatibilní s delegátem.
de: Die Signatur der Methode ist nicht mit dem Delegaten kompatibel.
es: El método no tiene una firma compatible con el delegado.
fr: La méthode n'a pas de signature compatible avec le délégué.
it: La firma del metodo non è compatibile con il delegato.
ja: メソッドにデリゲートと互換性のあるシグネチャがありません。
ko: 메서드에 대리자와 호환되는 시그니처가 없습니다.
pl: Metoda nie ma sygnatury zgodnej z delegatem.
pt_br: O método não tem uma assinatura compatível com o delegado.
ru: Метод не имеет сигнатуры, совместимой с сигнатурой делегата.
tr: Yöntemin temsilciyle uyumlu bir imzası yok.
zh_hans: 方法没有与委托兼容的签名。
zh_hant: 方法沒有與委派相容的簽章。
