Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_GenericConstraintNotCLSCompliant1
source: Generic parameter constraint type '{0}' is not CLS-compliant.
cs: Obecný typ omezení parametru {0} není kompatibilní se specifikací CLS.
de: Der Einschränkungstyp "{0}" für generische Parameter ist nicht CLS-kompatibel.
es: El tipo de restricción del parámetro genérico '{0}' no es conforme a CLS.
fr: Le type de contrainte de paramètre générique '{0}' n'est pas conforme CLS.
it: Il tipo di vincolo '{0}' per il parametro generico non è conforme a CLS.
ja: ジェネリック パラメーターの制約型 '{0}' は CLS に準拠していません。
ko: '{0}' 제네릭 매개 변수 제약 조건 형식이 CLS 규격이 아닙니다.
pl: Typ ograniczenia parametru ogólnego „{0}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo de restrição de parâmetro genérico "{0}" não tem conformidade com CLS.
ru: Универсальный тип параметра ограничения "{0}" не удовлетворяет требованиям CLS.
tr: '{0}' genel parametre kısıtlama türü CLS uyumlu değil.
zh_hans: 泛型形参约束类型“{0}”不符合 CLS。
zh_hant: 泛型參數條件約束類型 '{0}' 不符合 CLS 規範。

# WRN_GenericConstraintNotCLSCompliant1_Title
source: Generic parameter constraint type is not CLS-compliant
cs: Obecný typ omezení parametru není kompatibilní se specifikací CLS.
de: Der Einschränkungstyp des generischen Parameters ist nicht CLS-kompatibel.
es: El tipo de restricción del parámetro genérico no es conforme a CLS
fr: Le type de contrainte de paramètre générique n’est pas conforme CLS
it: Il tipo di vincolo per il parametro generico non è conforme a CLS
ja: ジェネリック パラメーターの制約型は CLS に準拠していません
ko: 제네릭 매개 변수 제약 조건 형식이 CLS 규격이 아님
pl: Typ ograniczenia parametru ogólnego jest niezgodny ze specyfikacją CLS
pt_br: Tipo de restrição de parâmetro genérico não tem conformidade com CLS
ru: Тип ограничения общего параметра несовместим с CLS
tr: Genel parametre kısıtlama türü CLS uyumlu değil
zh_hans: 泛型参数约束类型不符合 CLS
zh_hant: 泛型參數條件約束類型不符合 CLS 規範

# WRN_TypeNotCLSCompliant1
source: Type '{0}' is not CLS-compliant.
cs: Typ {0} není kompatibilní se specifikací CLS.
de: Der Typ "{0}" ist nicht CLS-kompatibel.
es: El tipo '{0}' no es conforme a CLS.
fr: Le type '{0}' n'est pas conforme CLS.
it: Il tipo '{0}' non è conforme a CLS.
ja: 型 '{0}' は CLS に準拠していません。
ko: '{0}' 형식이 CLS 규격이 아닙니다.
pl: Typ „{0}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo "{0}" não tem conformidade com CLS.
ru: Тип "{0}" не совместим с CLS.
tr: '{0}' türü CLS uyumlu değil.
zh_hans: 类型“{0}”不符合 CLS。
zh_hant: 類型 '{0}' 不符合 CLS 規範。

# WRN_TypeNotCLSCompliant1_Title
source: Type is not CLS-compliant
cs: Typ není kompatibilní se specifikací CLS.
de: Typ ist nicht CLS-kompatibel
es: El tipo no es conforme a CLS
fr: Le type n’est pas conforme CLS
it: Il tipo non è conforme a CLS
ja: 型が CLS に準拠していません
ko: 형식이 CLS 규격이 아닙니다.
pl: Typ nie jest zgodny ze specyfikacją CLS
pt_br: Tipo tem conformidade com CLS
ru: Тип несовместим с CLS
tr: Tür CLS uyumlu değil
zh_hans: 类型不符合 CLS
zh_hant: 類型不符合 CLS 規範

# WRN_OptionalValueNotCLSCompliant1
source: Type of optional value for optional parameter '{0}' is not CLS-compliant.
cs: Typ nepovinné hodnoty pro nepovinný parametr {0} není kompatibilní se specifikací CLS.
de: Der Typ des optionalen Werts für den optionalen {0}-Parameter ist nicht CLS-kompatibel.
es: El tipo de valor opcional para el parámetro opcional '{0}' no es conforme a CLS.
fr: Le type de la valeur facultative pour le paramètre optionnel '{0}' n'est pas conforme CLS.
it: Il tipo di valore facoltativo per il parametro facoltativo '{0}' non è conforme a CLS.
ja: 省略可能なパラメーター '{0}' に対する省略可能な値の型は、CLS に準拠していません。
ko: 선택적 매개 변수 '{0}'에 대한 선택적 값의 형식이 CLS 규격이 아닙니다.
pl: Typ wartości opcjonalnej dla parametru opcjonalnego „{0}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo de valor opcional para o parâmetro opcional "{0}" não tem conformidade com CLS.
ru: Тип необязательного значения для необязательного параметра "{0}" не удовлетворяет требованиям CLS.
tr: İsteğe bağlı '{0}' parametresinin isteğe bağlı değerinin türü CLS uyumlu değil.
zh_hans: 可选参数“{0}”的可选值的类型不符合 CLS。
zh_hant: 選擇性參數 '{0}' 的選擇性值類型不符合 CLS 規範。

# WRN_OptionalValueNotCLSCompliant1_Title
source: Type of optional value for optional parameter is not CLS-compliant
cs: Typ s volitelnou hodnotou pro volitelný parametr není kompatibilní se specifikací CLS.
de: Der Typ des optionalen Werts für den optionalen Parameter ist nicht CLS-kompatibel.
es: El tipo de valor opcional para el parámetro opcional no es conforme a CLS
fr: Le type de valeur facultative pour le paramètre facultatif n’est pas conforme CLS
it: Il tipo di valore facoltativo per il parametro facoltativo non è conforme a CLS
ja: 省略可能なパラメーターに対する省略可能な値の型が CLS に準拠していません
ko: 선택적 매개 변수에 대한 선택적 값의 형식이 CLS 규격이 아님
pl: Typ opcjonalnej wartości parametru opcjonalnego jest niezgodny ze specyfikacją CLS
pt_br: Tipo de valor opcional para parâmetro opcional não tem conformidade com CLS
ru: Тип дополнительного значения для дополнительного параметра несовместим с CLS
tr: İsteğe bağlı parametre için isteğe bağlı değerin türü CLS uyumlu değil
zh_hans: 可选参数的可选值类型不符合 CLS
zh_hant: 選用參數的選用值類型不符合 CLS 規範

# WRN_CLSAttrInvalidOnGetSet
source: System.CLSCompliantAttribute cannot be applied to property 'Get' or 'Set'.
cs: Atribut System.CLSCompliantAttribute se nedá použít pro vlastnost Get nebo Set.
de: System.CLSCompliantAttribute kann nicht auf die Get- oder Set-Eigenschaft angewendet werden.
es: System.CLSCompliantAttribute no se puede aplicar a la propiedad 'Get' o 'Set'.
fr: System.CLSCompliantAttribute ne peut pas être appliqué à la propriété 'Get' ou 'Set'.
it: Non è possibile applicare System.CLSCompliantAttribute alla proprietà 'Get' o 'Set'.
ja: プロパティの 'Get' または 'Set' に System.CLSCompliantAttribute を適用することはできません。
ko: System.CLSCompliantAttribute는 'Get' 또는 'Set' 속성에 적용할 수 없습니다.
pl: Nie można zastosować elementu System.CLSCompliantAttribute do właściwości „Get” lub „Set”.
pt_br: Não é possível aplicar System.CLSCompliantAttribute à propriedade 'Get' ou 'Set'.
ru: Атрибут System.CLSCompliantAttribute нельзя применять к свойствам "Get" или "Set".
tr: System.CLSCompliantAttribute bir 'Get' veya 'Set' özelliğine uygulanamaz.
zh_hans: System.CLSCompliantAttribute 不能应用于属性 "Get" 或 "Set"。
zh_hant: System.CLSCompliantAttribute 無法套用至屬性 'Get' 或 'Set'。

# WRN_CLSAttrInvalidOnGetSet_Title
source: System.CLSCompliantAttribute cannot be applied to property 'Get' or 'Set'
cs: Atribut System.CLSCompliantAttribute se nedá použít pro vlastnost Get nebo Set.
de: System.CLSCompliantAttribute kann nicht auf die Get- oder Set-Eigenschaft angewendet werden.
es: No se puede aplicar System.CLSCompliantAttribute a la propiedad 'Get' o 'Set'
fr: Impossible d'appliquer System.CLSCompliantAttribute à la propriété 'Get' ou 'Set'
it: Non è possibile applicare System.CLSCompliantAttribute alla proprietà 'Get' o 'Set'
ja: プロパティの 'Get' または 'Set' に System.CLSCompliantAttribute を適用することはできません
ko: System.CLSCompliantAttribute는 'Get' 또는 'Set' 속성에 적용할 수 없음
pl: Nie można zastosować elementu System.CLSCompliantAttribute do właściwości „Get” lub „Set”
pt_br: Não é possível aplicar System.CLSCompliantAttribute à propriedade 'Get' ou 'Set'
ru: Атрибут System.CLSCompliantAttribute невозможно применить к свойствам Get или Set
tr: System.CLSCompliantAttribute bir 'Get' veya 'Set' özelliğine uygulanamaz
zh_hans: System.CLSCompliantAttribute 不能应用于属性 "Get" 或 "Set"
zh_hant: System.CLSCompliantAttribute 無法套用至屬性 'Get' 或 'Set'

# WRN_TypeConflictButMerged6
source: {0} '{1}' and partial {2} '{3}' conflict in {4} '{5}', but are being merged because one of them is declared partial.
cs: {0} – {1} a částečně {2} – {3} jsou v konfliktu v {4} – {5}, ale slučují se, protože jedna z nich se deklaruje jako částečná.
de: {0} "{1}" und {2} "{3}" (partiell) verursachen einen Konflikt in {4} "{5}", werden aber gemergt, da eines der beiden Elemente als "Partial" deklariert wurde.
es: {0} '{1}' y {2} '{3}' parcial entran en conflicto en {4} '{5}', pero se van a fusionar mediante combinación porque uno de ellos está declarado como parcial.
fr: {0} '{1}' et {2} '{3}' partiel sont en conflit dans {4} '{5}', mais vont être fusionnés, car l'un d'eux est déclaré partiel.
it: {0} '{1}' e {2} '{3}' parziale sono in conflitto in {4} '{5}', ma il merge verrà eseguito comunque perché uno di essi è dichiarato come parziale.
ja: {0} '{1}' と部分的な {2} '{3}' が {4} '{5}' で競合しますが、そのうち 1 つが部分的な宣言であるためマージされました。
ko: {0} '{1}' 및 부분 형식(Partial Type) {2} '{3}'이(가) {4} '{5}'에서 충돌하지만 이 중 하나가 partail로 선언되었으므로 병합되고 있습니다.
pl: Element {0} „{1}” i częściowy element {2} „{3}” powodują konflikt w elemencie {4} „{5}”, ale są scalane, ponieważ jeden z nich jest zadeklarowany jako częściowy.
pt_br: {0} "{1}" e parcial {2} "{3}" estão em conflito em {4} "{5}", mas estão sendo mesclados porque um deles é declarado parcial.
ru: {0} "{1}" и частичный {2} "{3}" конфликтуют в {4} "{5}", но объединены, так как один из них объявлен разделяемым.
tr: {0} '{1}' ve kısmi {2} '{3}' {4} '{5}' içinde çakışıyor, ancak biri kısmi olarak bildirildiğinden birleştiriliyor.
zh_hans: {0}“{1}”和分部 {2}“{3}”在 {4}“{5}”中冲突，但由于其中的一个被声明为 Partial，因此正在合并。
zh_hant: {0} '{1}' 和部分 {2} '{3}' 在 {4} '{5}' 中互相衝突，但是因為其中一個宣告為部分，所以已合併。

# WRN_TypeConflictButMerged6_Title
source: Type and partial type conflict, but are being merged because one of them is declared partial
cs: Typ a částečný typ jsou v konfliktu, ale sloučí se, protože jeden z nich je deklarovaný jako částečný.
de: Typkonflikt und teilweiser Typkonflikt. Die Typen werden jedoch gemergt, da einer der Typen teilweise deklariert wird.
es: Conflicto entre el tipo y el tipo parcial; se han fusionado mediante combinación porque uno de ellos se declara como parcial
fr: Le type et le type partiel sont en conflit, mais ils sont fusionnés, car l’un d’eux est déclaré partiel
it: Il tipo e il tipo parziale sono in conflitto, ma ne verrà comunque eseguito il merge perché uno di essi è dichiarato come parziale
ja: 型と部分型が競合していますが、そのうち 1 つが部分的な宣言であるためマージされました
ko: 형식 및 부분 형식(Partial Type)이 충돌하지만 형식 중 하나가 부분으로 선언되었으므로 병합됨
pl: Wystąpił konflikt typu i typu częściowego, ale trwa ich scalanie, ponieważ jeden z nich został zadeklarowany jako częściowy
pt_br: Tipo e tipo parcial estão em conflito, mas estão sendo mesclados porque um deles é declarado como parcial
ru: Тип и разделяемый тип конфликтуют, но выполняется их объединение, так как один из них объявлен разделяемым
tr: Tür ve kısmi tür çakışıyor, ancak içlerinden biri kısmi olarak bildirildiğinden birleştiriliyorlar
zh_hans: 类型和分部类型冲突，但由于其中一个被声明为 Partial，因此正在合并
zh_hant: 類型與部分類型相衝突，但將予以合併，因為其中一個已宣告為部分

# WRN_ShadowingGenericParamWithParam1
source: Type parameter '{0}' has the same name as a type parameter of an enclosing type. Enclosing type's type parameter will be shadowed.
cs: Parametr typu {0} má stejný název jako parametr typu z vnějšího typu. Parametr typu vnějšího typu se nastaví jako stínový.
de: Der {0}-Typparameter hat den gleichen Namen wie ein Typparameter eines einschließenden Typs. Für den Typparameter des einschließenden Typs wird Shadowing durchgeführt.
es: El parámetro de tipo '{0}' tiene el mismo nombre que el parámetro de tipo de un tipo envolvente. Prevalecerá sobre el parámetro de tipo del tipo envolvente.
fr: Le paramètre de type '{0}' a le même nom qu'un paramètre de type d'un type englobant. Le paramètre de type du type englobant sera shadowed.
it: Il parametro di tipo '{0}' ha lo stesso nome di un parametro di tipo di un tipo di inclusione. Il parametro di tipo del tipo di inclusione verrà nascosto.
ja: 型パラメーター '{0}' には、それを囲む型の型パラメーターと同じ名前が付けられています。それを囲む型の型パラメーターはシャドウされます。
ko: '{0}' 형식 매개 변수의 이름이 바깥쪽 형식의 형식 매개 변수 이름과 같습니다. 바깥쪽 형식의 형식 매개 변수가 숨겨집니다.
pl: Parametr typu „{0}” ma taką samą nazwę jak parametr typu zamykającego. Parametr typu zamykającego zostanie zasłonięty.
pt_br: Parâmetro de tipo "{0}" tem o mesmo nome de um parâmetro de tipo de um tipo delimitador. O parâmetro de tipo do tipo delimitador será sombreado.
ru: Параметр типа "{0}" имеет то же имя в качестве параметра типа вмещающего типа. Параметр типа вмещающего типа будет затенен.
tr: '{0}' tür parametresi, kapsayan türün tür parametresiyle aynı ada sahip. Kapsayan türün tür parametresi gölgelenir.
zh_hans: 类型参数“{0}”与封闭类型的类型参数同名。封闭类型的类型参数将被隐藏。
zh_hant: 類型參數 '{0}' 與封入類型的類型參數，擁有相同的名稱。將會遮蔽封入類型的類型參數。

# WRN_ShadowingGenericParamWithParam1_Title
source: Type parameter has the same name as a type parameter of an enclosing type
cs: Parametr typu má stejný název jako parametr typu nadřazeného typu.
de: Der Typparameter hat denselben Namen wie der Typparameter eines einschließenden Typs.
es: El parámetro tipo tiene el mismo nombre que el parámetro tipo de un tipo envolvente
fr: Le paramètre de type a le même nom qu’un paramètre de type d’un type englobant
it: Il parametro di tipo ha lo stesso nome di un parametro di tipo di un tipo di inclusione
ja: 型パラメーターの名前が、それを囲む型の型パラメーターの名前と同じです
ko: 형식 매개 변수의 이름이 바깥쪽 형식의 형식 매개 변수와 동일함
pl: Parametr typu ma taką samą nazwę jak parametr typu otaczającego
pt_br: O parâmetro de tipo tem o mesmo nome que um parâmetro de tipo de um tipo de delimitador
ru: Параметр типа имеет то же имя, что и параметр типа, в который он входит
tr: Tür parametresiyle aynı adı taşıyan bir kapsayıcı türü tür parametresi var
zh_hans: 类型参数与封闭类型的类型参数具有相同的名称
zh_hant: 類型參數與封入類型的類型參數擁有相同的名稱

# WRN_CannotFindStandardLibrary1
source: Could not find standard library '{0}'.
cs: Nenašla se standardní knihovna {0}.
de: Die Standardbibliothek "{0}" wurde nicht gefunden.
es: No se encontró la biblioteca estándar '{0}'.
fr: La bibliothèque standard '{0}' est introuvable.
it: La libreria standard {0} non è stata trovata.
ja: 標準ライブラリ '{0}' が見つかりませんでした。
ko: '{0}' 표준 라이브러리를 찾을 수 없습니다.
pl: Nie można odnaleźć biblioteki standardowej „{0}”.
pt_br: Não foi possível encontrar a biblioteca padrão "{0}".
ru: Не удалось найти стандартную библиотеку "{0}".
tr: '{0}' standart kitaplığı bulunamadı.
zh_hans: 未能找到标准库“{0}”。
zh_hant: 找不到標準程式庫 '{0}'。

# WRN_CannotFindStandardLibrary1_Title
source: Could not find standard library
cs: Nepovedlo se najít standardní knihovnu.
de: Die Standardbibliothek wurde nicht gefunden.
es: Falta la biblioteca estándar
fr: Bibliothèque standard introuvable
it: La libreria standard non è stata trovata
ja: 標準ライブラリが見つかりませんでした
ko: 표준 라이브러리를 찾을 수 없음
pl: Nie można odnaleźć biblioteki standardowej
pt_br: Não foi possível encontrar a biblioteca padrão
ru: Не удалось найти стандартную библиотеку
tr: Standart kitaplık bulunamadı
zh_hans: 找不到标准库
zh_hant: 找不到標準程式庫

# WRN_EventDelegateTypeNotCLSCompliant2
source: Delegate type '{0}' of event '{1}' is not CLS-compliant.
cs: Typ delegáta {0} události {1} není kompatibilní se specifikací CLS.
de: Der Delegattyp "{0}" des {1}-Ereignisses ist nicht CLS-kompatibel.
es: El tipo delegado '{0}' del evento '{1}' no es conforme a CLS.
fr: Le type délégué '{0}' de l'événement '{1}' n'est pas conforme CLS.
it: Il tipo delegato '{0}' dell'evento '{1}' non è conforme a CLS.
ja: イベント '{1}' のデリゲート型 '{0}' は CLS に準拠していません。
ko: '{1}' 이벤트의 '{0}' 대리자 형식이 CLS 규격이 아닙니다.
pl: Typ delegowany „{0}” zdarzenia „{1}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo delegate "{0}" do evento "{1}" não tem conformidade com CLS.
ru: Тип делегата "{0}" события "{1}" не удовлетворяет требованиям CLS.
tr: '{1}' olayının '{0}' temsilci türü CLS uyumlu değil.
zh_hans: 事件“{1}”的委托类型“{0}”不符合 CLS。
zh_hant: 事件 '{1}' 的委派類型 '{0}' 不符合 CLS 規範。

# WRN_EventDelegateTypeNotCLSCompliant2_Title
source: Delegate type of event is not CLS-compliant
cs: Typ delegáta události není kompatibilní se specifikací CLS.
de: Der Delegattyp des Ereignisses ist nicht CLS-kompatibel.
es: El tipo delegado del evento no es conforme a CLS
fr: Le type d’événement délégué n’est pas conforme CLS
it: Il tipo delegato dell'evento non è conforme a CLS
ja: デリゲート型のイベントは CLS に準拠していません
ko: 이벤트의 대리자 형식이 CLS 규격이 아님
pl: Typ delegowania zdarzenia jest niezgodny ze specyfikacją CLS
pt_br: Tipo de delegado do evento não tem conformidade com CLS
ru: Тип делегата события несовместим с CLS
tr: Olayın temsilci türü CLS uyumlu değil
zh_hans: 事件的委托类型不符合 CLS
zh_hant: 事件的委派類型不符合 CLS 規範

# WRN_DebuggerHiddenIgnoredOnProperties
source: System.Diagnostics.DebuggerHiddenAttribute does not affect 'Get' or 'Set' when applied to the Property definition. Apply the attribute directly to the 'Get' and 'Set' procedures as appropriate.
cs: Atribut System.Diagnostics.DebuggerHiddenAttribute neovlivňuje metody Get nebo Set při použití u definice Property. Použijte atribut vhodným způsobem přímo pro procedury Get a Set.
de: System.Diagnostics.DebuggerHiddenAttribute hat keine Auswirkungen auf "Get" oder "Set", wenn es auf die Eigenschaftendefinition angewendet wird. Wenden Sie das Attribut direkt auf Get- und Set-Prozeduren an, wenn dies erforderlich ist.
es: System.Diagnostics.DebuggerHiddenAttribute no afecta a 'Get' o 'Set' cuando se aplica a la definición Property. Aplique el atributo directamente a los procedimientos 'Get' y 'Set' como corresponda.
fr: System.Diagnostics.DebuggerHiddenAttribute n'affecte pas 'Get' ou 'Set' lorsqu'il est appliqué à la définition Property. Appliquez l'attribut directement aux procédures 'Get' et 'Set' de manière appropriée.
it: System.Diagnostics.DebuggerHiddenAttribute non ha effetto su 'Get' o 'Set' se applicato alla definizione delle proprietà. Applicare l'attributo direttamente alle procedure 'Get' e 'Set', quando necessario.
ja: System.Diagnostics.DebuggerHiddenAttribute をプロパティ定義に適用しても、'Get' または 'Set' には適用されません。この属性は、目的の 'Get' または 'Set' プロシージャに直接適用してください。
ko: System.Diagnostics.DebuggerHiddenAttribute는 속성 정의에 적용될 때 'Get' 또는 'Set'에 영향을 주지 않습니다. 특성을 'Get' 및 'Set' 프로시저에 적절히 직접 적용하세요.
pl: Atrybut System.Diagnostics.DebuggerHiddenAttribute nie ma wpływu na elementy „Get” ani „Set”, gdy jest stosowany do definicji Property. Zastosuj atrybut bezpośrednio do odpowiednich procedur „Get” i „Set”.
pt_br: System.Diagnostics.DebuggerHiddenAttribute não afeta 'Get' ou 'Set' quando aplicado à definição da propriedade. Aplique o atributo diretamente aos procedimentos 'Get' e 'Set' conforme for apropriado.
ru: Атрибут System.Diagnostics.DebuggerHiddenAttribute не влияет на методы "Get" или "Set", когда применяется к определению свойства. Применяйте атрибут непосредственно к соответствующим методам "Get" и "Set".
tr: System.Diagnostics.DebuggerHiddenAttribute, Property tanımına uygulandığında 'Get' veya 'Set' yordamını etkilemez. Özniteliği 'Get' ve 'Set' yordamlarına uygun şekilde doğrudan uygulayın.
zh_hans: System.Diagnostics.DebuggerHiddenAttribute 在应用于属性定义时不影响“Get”或“Set”。请根据相应的情况，将此特性直接应用于“Get”和“Set”过程。
zh_hant: 當 System.Diagnostics.DebuggerHiddenAttribute 套用至屬性 (Property) 定義時，它並不會影響 'Get' 或 'Set'。請依適當的情況直接將屬性 (Attribute) 套用至 'Get' 和 'Set' 程序。

# WRN_DebuggerHiddenIgnoredOnProperties_Title
source: System.Diagnostics.DebuggerHiddenAttribute does not affect 'Get' or 'Set' when applied to the Property definition
cs: System.Diagnostics.DebuggerHiddenAttribute neovlivňuje metodu Get nebo Set, pokud se použije v definici vlastnosti.
de: System.Diagnostics.DebuggerHiddenAttribute hat bei Anwendung auf die Eigenschaftsdefinition keine Auswirkungen auf "Get" oder "Set".
es: System.Diagnostics.DebuggerHiddenAttribute no afecta a 'Get' o 'Set' cuando se aplica a la definición de propiedad
fr: System.Diagnostics.DebuggerHiddenAttribute n’affecte pas 'Get' ou 'Set' lorsqu’il est appliqué à la définition Property
it: System.Diagnostics.DebuggerHiddenAttribute non influisce su 'Get' o 'Set' quando viene applicato alla definizione della proprietà
ja: System.Diagnostics.DebuggerHiddenAttribute は、プロパティ定義に適用するときに 'Get' または 'Set' に影響しません
ko: System.Diagnostics.DebuggerHiddenAttribute는 속성 정의에 적용될 때 'Get' 또는 'Set'에 영향을 주지 않음
pl: Atrybut System.Diagnostics.DebuggerHiddenAttribute zastosowany dla definicji właściwości nie ma wpływu na właściwości „Get” lub „Set”
pt_br: System.Diagnostics.DebuggerHiddenAttribute não afeta 'Get' ou 'Set' quando aplicado à definição da Propriedade
ru: Атрибут System.Diagnostics.DebuggerHiddenAttribute не влияет на Get или Set при применении к определению свойств
tr: System.Diagnostics.DebuggerHiddenAttribute, Property tanımına uygulandığında 'Get' veya 'Set' yordamını etkilemez
zh_hans: 在应用到属性定义时，System.Diagnostics.DebuggerHiddenAttribute 不影响 "Get" 或 "Set"
zh_hant: System.Diagnostics.DebuggerHiddenAttribute 在套用至 Property 定義時，並不會影響 'Get' 或 'Set'

# WRN_SelectCaseInvalidRange
source: Range specified for 'Case' statement is not valid. Make sure that the lower bound is less than or equal to the upper bound.
cs: Rozsah zadaný pro příkaz Case je neplatný. Přesvědčte se, jestli je dolní mez rozsahu menší nebo rovna horní mezi rozsahu.
de: Der für die Case-Anweisung angegebene Bereich ist nicht gültig. Stellen Sie sicher, dass die untere Begrenzung kleiner oder gleich der oberen Begrenzung ist.
es: El intervalo especificado para la instrucción 'Case' no es válido. Asegúrese de que el límite inferior sea menor o igual que el límite superior.
fr: La plage spécifiée pour l'instruction 'Case' n'est pas valide. Vérifiez que la limite inférieure est inférieure ou égale à la limite supérieure.
it: L'intervallo specificato nell'istruzione 'Case' non è valido. Accertarsi che il limite inferiore sia minore o uguale al limite superiore.
ja: Case' ステートメントに指定された範囲が有効ではありません。下限が上限以下になっていることを確認してください。
ko: Case' 문에 지정한 범위가 잘못되었습니다. 하한이 상한보다 작거나 같은지 확인하세요.
pl: Zakres określony dla instrukcji „Case” jest nieprawidłowy. Upewnij się, że dolna granica jest mniejsza lub równa górnej granicy.
pt_br: O intervalo especificado para a instrução 'Case' não é válido. Assegure que o limite inferior é menor ou igual ao limite superior.
ru: Указан недопустимый диапазон для оператора "Case". Убедитесь, что нижняя граница меньше или равна верхней границе.
tr: Case' deyimi için belirtilen aralık geçerli değil. Alt sınırın üst sınırdan küçük veya üst sınıra eşit olduğundan emin olun.
zh_hans: 为 "Case" 语句指定的范围无效。请确保下限小于或等于上限。
zh_hant: Case' 陳述式的指定範圍無效。請確定下限小於或等於上限。

# WRN_SelectCaseInvalidRange_Title
source: Range specified for 'Case' statement is not valid
cs: Rozsah zadaný pro příkaz Case není platný.
de: Der für die Case-Anweisung angegebene Bereich ist ungültig.
es: El rango especificado para la instrucción 'Case' no es válido
fr: La plage spécifiée pour l’instruction 'Case' n’est pas valide
it: L'intervallo specificato per l'istruzione 'Case' non è valido
ja: Case' ステートメントに指定された範囲が無効です
ko: Case' 문에 지정한 범위가 잘못됨
pl: Zakres określony dla instrukcji „Case” jest nieprawidłowy
pt_br: O intervalo especificado para a instrução "Case" não é válido
ru: Диапазон, указанный для оператора Case, недопустим
tr: Case' deyimi için belirtilen aralık geçerli değil
zh_hans: 为 "Case" 语句指定的范围无效
zh_hant: Case' 陳述式的指定範圍無效
