Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SpeculatedSyntaxNodeCannotBelongToCurrentCompilation
source: Syntax node to be speculated cannot belong to a syntax tree from the current compilation.
cs: Uzel syntaxe určený ke spekulaci nemůže patřit do stromu syntaxe z aktuální kompilace.
de: Der zu analysierende Syntaxknoten kann nicht zum Syntaxbaum der aktuellen Kompilierung gehören.
es: El nodo de sintaxis que se va a especular no puede pertenecer a un árbol de sintaxis de la compilación actual.
fr: Le nœud de syntaxe à extrapoler ne peut pas appartenir à une arborescence de syntaxe de la compilation actuelle.
it: Il nodo della sintassi da prevedere non può appartenere a un albero della sintassi della compilazione corrente.
ja: 推測される構文ノードは、現在のコンパイルの構文ツリーに属することができません。
ko: 추측한 구문 노드는 현재 컴파일에서 구문 트리에 속할 수 없습니다.
pl: Drzewo składni do przeanalizowania nie może należeć do drzewa składni bieżącej kompilacji.
pt_br: Nó de sintaxe a ser especulado não pode pertencer a uma árvore de sintaxe da compilação atual.
ru: Предполагаемый синтаксический узел не может принадлежать синтаксическому дереву из текущей компиляции.
tr: Tahmin edilen sözdizimi düğümü geçerli derlemeden bir sözdizimi ağacına ait olamaz.
zh_hans: 要推断的语法节点不能属于来自当前编译的语法树。
zh_hant: 要推測的語法節點，不可屬於目前編譯的語法樹狀結構。

# ChainingSpeculativeModelIsNotSupported
source: Chaining speculative semantic model is not supported. You should create a speculative model from the non-speculative ParentModel.
cs: Zřetězení spekulativního sémantického modelu se nepodporuje. Měli byste vytvořit spekulativní model z nespekulativního modelu ParentModel.
de: Die Verkettung eines spekulativen semantischen Modells wird nicht unterstützt. Sie sollten ein spekulatives Modell aus dem nicht spekulativen ParentModel erstellen.
es: No se puede encadenar el modelo semántico especulativo. Tiene que crear un modelo especulativo desde el modelo principal no especulativo.
fr: Le chaînage d'un modèle sémantique spéculatif n'est pas pris en charge. Vous devez créer un modèle spéculatif à partir du ParentModel non spéculatif.
it: Il concatenamento del modello semantico speculativo non è supportato. È necessario creare un modello speculativo dal modello ParentModel non speculativo.
ja: 予測セマンティック モデルのチェーンはサポートしていません。非予測 ParentModel から予測モデルを作成する必要があります。
ko: 이론적 의미 체계 모델 연결은 지원되지 않습니다. 비이론적 ParentModel에서 이론적 모델을 만들어야 합니다.
pl: Tworzenie łańcuchów spekulacyjnego modelu semantycznego nie jest obsługiwane. Należy utworzyć model spekulacyjny z nadrzędnego modelu niespekulacyjnego.
pt_br: Não há suporte ao encadeamento do modelo semântico especulativo. Você deve criar um modelo especulativo com base no ParentModel não especulativo.
ru: Построение цепочки наблюдающей семантической модели не поддерживается. Необходимо создать наблюдающую модель из ненаблюдающей ParentModel.
tr: Kurgusal anlam modelini zincirleme desteklenmiyor. Kurgusal olmayan ParentModel öğesinden kurgusal bir model oluşturmalısınız.
zh_hans: 不支持链接推理语义模型。应从非推理 ParentModel 创建推理模型。
zh_hant: 不支援鏈結理論式語意模型。應從非理論式 ParentModel 建立理論式模型。

# IDS_ToolName
source: Microsoft (R) Visual Basic Compiler
es: Compilador de Microsoft (R) Visual Basic
fr: Compilateur Microsoft (R) Visual Basic
it: Compilatore Microsoft (R) Visual Basic
ko: Microsoft (R) Visual Basic 컴파일러
pl: Kompilator Microsoft (R) Visual Basic Compiler
pt_br: Compilador do Microsoft (R) Visual Basic
ru: Компилятор Microsoft (R) Visual Basic
tr: Microsoft (R) Visual Basic Derleyicisi
zh_hans: Microsoft (R) Visual Basic 编译器
zh_hant: Microsoft (R) Visual Basic 編譯器

# IDS_LogoLine1
source: {0} version {1}
cs: {0} verze {1}
es: {0} versión {1}
it: {0} versione {1}
ja: {0} バージョン {1}
ko: {0} 버전 {1}
pl: {0} w wersji {1}
pt_br: {0} versão {1}
ru: {0} версии {1}
tr: {0} sürüm {1}
zh_hans: {0} 版本 {1}
zh_hant: {0} 版 {1}

# IDS_LogoLine2
source: Copyright (C) Microsoft Corporation. All rights reserved.
cs: Copyright (C) Microsoft Corporation. Všechna práva vyhrazena.
de: Copyright (C) Microsoft Corporation. Alle Rechte vorbehalten.
es: Copyright (C) Microsoft Corporation. Todos los derechos reservados.
fr: Copyright (C) Microsoft Corporation. Tous droits réservés.
it: Copyright (C) Microsoft Corporation. Tutti i diritti sono riservati.
pl: Copyright (C) Microsoft Corporation. Wszelkie prawa zastrzeżone.
pt_br: Copyright (C) Microsoft Corporation. Todos os direitos reservados.
ru: © Корпорация Майкрософт (Microsoft Corporation). Все права защищены.
tr: Telif hakkı (C) Microsoft Corporation. Tüm hakları saklıdır.
zh_hans: 版权所有(C) Microsoft Corporation。保留所有权利。
zh_hant: Copyright (C) Microsoft Corporation. 著作權所有，並保留一切權利。

# IDS_LangVersions
source: Supported language versions:
cs: Podporované jazykové verze:
de: Unterstützte Sprachversionen:
es: Versiones de lenguaje admitidas:
fr: Versions de langage prises en charge :
it: Versioni del linguaggio supportate:
ja: サポートされる言語バージョン:
ko: 지원되는 언어 버전:
pl: Obsługiwane wersje językowe:
pt_br: Versões de linguagens com suporte:
ru: Поддерживаемые языковые версии:
tr: Desteklenen dil sürümleri:
zh_hans: 支持的语言版本:
zh_hant: 支援的語言版本:

# WRN_PdbLocalNameTooLong
source: Local name '{0}' is too long for PDB. Consider shortening or compiling without /debug.
cs: Místní název {0} je moc dlouhý pro PDB. Zvažte jeho zkrácení nebo kompilaci bez /debug.
de: Der lokale Name "{0}" ist für PDB zu lang. Kürzen Sie ihn, oder führen Sie die Kompilierung ohne /debug durch.
es: El nombre local '{0}' es demasiado largo para PDB. Puede acortar o compilar sin /debug.
fr: Le nom local '{0}' est trop long pour PDB. Raccourcissez-le ou compilez sans /debug.
it: Il nome locale '{0}' è troppo lungo per for PDB. Provare ad abbreviarlo oppure a compilare senza /debug.
ja: ローカル名 '{0}' は PDB に対して長すぎます。短縮するか、/debug なしでコンパイルすることを検討してください。
ko: PDB에 대한 '{0}' 로컬 이름이 너무 깁니다. 줄이거나 /debug 없이 컴파일하세요.
pl: Lokalna nazwa „{0}” jest za długa dla pliku PDB. Rozważ skrócenie jej lub skompilowanie bez opcji /debug.
pt_br: Nome local "{0}" é muito longo para PDB. Considere reduzir ou compilar sem /debug.
ru: Слишком длинное локальное имя "{0}" для PDB. Попробуйте сократить или компилировать без /debug.
tr: '{0}' yerel adı PDB için çok uzun. Kısaltmayı veya /debug olmadan derlemeyi deneyin.
zh_hans: 本地名称“{0}”对于 PDB 太长。请考虑缩短或在不使用 /debug 的情况下编译。
zh_hant: 區域變數名稱 '{0}' 對 PDB 而言太長。請考慮將其縮短，或在編譯時不要使用 /debug。

# WRN_PdbLocalNameTooLong_Title
source: Local name is too long for PDB
cs: Lokální název je moc dlouhý pro PDB.
de: Lokaler Name ist zu lang für PDB
es: El nombre local es demasiado largo para PDB
fr: Le nom local est trop long pour PDB
it: Il nome locale è troppo lungo per PDB
ja: PDB のローカル名が長すぎます
ko: 로컬 이름이 너무 길어서 PDB에 사용할 수 없습니다.
pl: Nazwa lokalna jest za długa dla pliku PDB
pt_br: O nome do local é muito longo para o PDB
ru: Локальное имя слишком длинное для PDB-файла
tr: Yerel ad PDB için çok uzun
zh_hans: 本地名称对于 PDB 太长
zh_hant: PDB 的本機名稱太長

# WRN_PdbUsingNameTooLong
source: Import string '{0}' is too long for PDB. Consider shortening or compiling without /debug.
cs: Řetězec importu {0} je moc dlouhý pro PDB. Zvažte zkrácení nebo kompilaci bez /debug.
de: Die Importzeichenfolge "{0}" ist zu lang für PDB. Kürzen Sie sie, oder kompilieren Sie ggf. ohne /debug.
es: La cadena de importación '{0}' es demasiado larga para PDB. Puede acortar o compilar sin /debug.
fr: La chaîne d'importation '{0}' est trop longue pour PDB. Raccourcissez-la ou compilez sans /debug.
it: La stringa di importazione '{0}' è troppo lunga per for PDB. Provare ad abbreviarla oppure a compilare senza /debug.
ja: インポート文字列 '{0}' は PDB にとって長すぎます。短縮するか、デバッグなしでコンパイルすることを検討してください。
ko: PDB에 대한 '{0}' 가져오기 문자열이 너무 깁니다. 줄이거나 /debug 없이 컴파일하세요.
pl: Ciąg importu „{0}” jest zbyt długi dla pliku PDB. Rozważ skrócenie go lub skompilowanie bez opcji /debug.
pt_br: Cadeia de caracteres de importação "{0}" é muito longo para o PDB. Considere encurtar ou compilar sem /debug.
ru: Импорт строки "{0}" имеет слишком много знаков для PDB. Попробуйте сократить или компилировать без /debug.
tr: '{0}' içeri aktarma dizesi PDB için fazla uzun. Kısaltabilir veya /debug olmadan derleyebilirsiniz.
zh_hans: 导入字符串“{0}”对于 PDB 太长。请考虑缩短或在不使用 /debug 的情况下编译。
zh_hant: 匯入字串 '{0}' 對 PDB 而言太長。請考慮縮短長度或不使用 /debug 進行編譯。

# WRN_PdbUsingNameTooLong_Title
source: Import string is too long for PDB
cs: Řetězec importu je pro PDB moc dlouhý.
de: Die Importzeichenfolge ist zu lang für PDB.
es: La cadena de importación es demasiado larga para PDB
fr: La chaîne d’importation est trop longue pour PDB
it: La stringa di importazione è troppo lunga per PDB
ja: PDB のインポート文字列が長すぎます
ko: 가져오기 문자열이 너무 길어서 PDB에 사용할 수 없음
pl: Ciąg importu jest za długi dla pliku PDB
pt_br: A cadeia de caracteres de importação é longa demais para o PDB
ru: Строка импорта слишком длинная для PDB
tr: İçeri aktarma dizesi PDB için çok uzun
zh_hans: 导入字符串对 PDB 而言太长
zh_hant: Import 字串對於 PDB 而言太長

# WRN_XMLDocCrefToTypeParameter
source: XML comment has a tag with a 'cref' attribute '{0}' that bound to a type parameter. Use the <typeparamref> tag instead.
cs: Komentář XML má značku s atributem cref {0}, který se vázal k parametru typu. Použijte místo toho značku <typeparamref>.
de: Der XML-Kommentar enthält eine Kennung mit dem cref-Attribut "{0}", das an einen Typparameter gebunden ist. Verwenden Sie stattdessen die <typeparamref>-Kennung.
es: El comentario XML tiene una etiqueta con un atributo 'cref' '{0}' enlazado a un parámetro de tipo. Use la etiqueta <typeparamref> en su lugar.
fr: Le commentaire XML a une balise avec un attribut 'cref' '{0}' qui est lié à un paramètre de type. Utilisez la balise <typeparamref> à la place.
it: Il commento XML contiene un tag con un attributo 'cref' '{0}' che è associato a un parametro di tipo. Usare invece il tag <typeparamref>.
ja: XML コメントには、型パラメーターにバインドされた 'cref' 属性 '{0}' を伴うタグがあります。代わりに <typeparamref> タグを使ってください。
ko: XML 주석에 형식 매개 변수로 바인딩되는 'cref' 특성('{0}')이 포함된 태그가 있습니다. 대신 <typeparamref> 태그를 사용하세요.
pl: Komentarz XML ma tag z atrybutem „cref” „{0}”, który jest wiązany z parametrem typu. Zamiast tego użyj tagu <typeparamref>.
pt_br: O comentário XML tem uma marca com um atributo "cref" "{0}" que é associada a um parâmetro de tipo. Ao invés disso, use a marca <typeparamref>.
ru: Комментарий XML содержит тег с атрибутом "cref" "{0}", который привязан к типу параметра. Вместо этого следует использовать тег <typeparamref>.
tr: XML açıklamasında, bir tür parametresine bağlı olan '{0}' 'cref' özniteliğine sahip bir etiket var. Bunun yerine <typeparamref> etiketini kullanın.
zh_hans: XML 注释中的一个标记具有绑定到类型参数的“cref”特性“{0}”。请改用 <typeparamref> 标记。
zh_hant: XML 註解的標記具有繫結至類型參數的 'cref' 屬性 '{0}'。請改用 <typeparamref> 標記。

# WRN_XMLDocCrefToTypeParameter_Title
source: XML comment has a tag with a 'cref' attribute that bound to a type parameter
cs: V komentáři XML je značka s atributem cref, který má vazbu na parametr typu.
de: Der XML-Kommentar enthält eine Kennung mit dem cref-Attribut, das an einen Typparameter gebunden ist.
es: El comentario XML tiene una etiqueta con un atributo 'cref' que enlaza a un parámetro de tipo
fr: Le commentaire XML possède une balise avec un attribut 'cref' lié à un paramètre de type
it: Il commento XML contiene un tag con un attributo 'cref' che è associato a un parametro di tipo
ja: XML コメントに、型パラメーターにバインドされた 'cref' 属性が指定されたタグが含まれています
ko: XML 주석에 형식 매개 변수에 바인딩된 'cref' 특성이 포함된 태그가 있음
pl: Komentarz XML ma tag z atrybutem „cref”, który jest wiązany z parametrem typu
pt_br: O comentário XML tem uma marca com um atributo 'cref' vinculado a um parâmetro de tipo
ru: Комментарий XML содержит тег с атрибутом cref, который привязан к параметру типа
tr: XML açıklamasında, bir tür parametresine bağlanan 'cref' özniteliğini içeren bir etiket var
zh_hans: XML 注释包含的一个标记具有绑定到类型参数的 "cref" 属性
zh_hant: XML 註解的標記具有與類型參數繫結的 'cref' 屬性

# ERR_LinkedNetmoduleMetadataMustProvideFullPEImage
source: Linked netmodule metadata must provide a full PE image: '{0}'.
cs: Propojená metadata netmodule musí poskytovat plnou image PE: {0}.
de: Verknüpfte NETMODULE-Metadaten müssen ein vollständiges PE-Abbild bereitstellen: "{0}".
es: El metadato netmodule vinculado debe proporcionar una imagen PE completa: '{0}'.
fr: Les métadonnées netmodule liées doivent fournir une image PE complète : '{0}'.
it: I metadati del netmodule collegato devono fornire un'immagine PE completa: '{0}'.
ja: リンクされた netmodule メタデータには完全な PE イメージ '{0}' が必要です。
ko: 링크된 netmodule 메타데이터는 전체 PE 이미지를 제공해야 합니다. '{0}'
pl: Połączone metadane modułu netmodule muszą określać pełny obraz PE: „{0}”.
pt_br: Metadados netmodule vinculados devem fornecer uma imagem completa de PE: "{0}".
ru: Связанные метаданные netmodule должны обеспечивать полный образ PE: '{0}'.
tr: Bağlantılı netmodule meta verileri tam bir PE görüntüsü sağlamalıdır: '{0}'.
zh_hans: 链接 netmodule 元数据必须提供完整 PE 映像:“{0}”。
zh_hant: 連結的 netmodule 中繼資料必須提供完整的 PE 影像: '{0}'。

# WRN_AnalyzerCannotBeCreated
source: An instance of analyzer {0} cannot be created from {1} : {2}.
cs: Instance analyzátoru {0} nejde vytvořit z {1} : {2}.
de: Eine Instanz des Analysetools "{0}" kann nicht aus {1} erstellt werden: {2}.
es: No se puede crear una instancia de analizador {0} desde {1} : {2}.
fr: Impossible de créer une instance de l'analyseur {0} à partir de {1} : {2}.
it: Non è possibile creare un'istanza dell'analizzatore {0} da {1} : {2}.
ja: アナライザー {0} のインスタンスは {1} ({2}) から作成できません。
ko: {0} 분석기 인스턴스는 {1}에서 만들 수 없습니다({2}).
pl: Wystąpienia analizatora {0} nie można utworzyć z elementu {1}: {2}.
pt_br: Uma instância do analisador de {0} não pode ser criada de {1} : {2}.
ru: Экземпляр анализатора {0} невозможно создать из {1} : {2}"
tr: {0} çözümleyicisinin bir örneği {1} : {2} öğesinden oluşturulamaz.
zh_hans: 无法从 {1} 创建分析器 {0} 的实例: {2}。
zh_hant: 不可從 {1} 建立分析器 {0} 的執行個體: {2}。

# WRN_AnalyzerCannotBeCreated_Title
source: Instance of analyzer cannot be created
cs: Nedá se vytvořit instance analyzátoru.
de: Es kann keine Instanz des Analysetools erstellt werden.
es: No se puede crear la instancia del analizador
fr: L’instance de l’analyseur ne peut pas être créée
it: Non è possibile creare l'istanza dell'analizzatore
ja: アナライザーのインスタンスを作成できません
ko: 분석기 인스턴스를 만들 수 없음
pl: Nie można utworzyć wystąpienia analizatora
pt_br: Não é possível criar a instância do analisador
ru: Невозможно создать экземпляр анализатора
tr: Çözümleyici örneği oluşturulamıyor
zh_hans: 无法创建分析器实例
zh_hant: 無法建立分析器的執行個體

# WRN_NoAnalyzerInAssembly
source: The assembly {0} does not contain any analyzers.
cs: Sestavení {0} neobsahuje žádné analyzátory.
de: Die Assembly "{0}" enthält keine Analysetools.
es: El ensamblado {0} no contiene ningún analizador.
fr: L'assembly {0} ne contient pas d'analyseurs.
it: L'assembly {0} non contiene analizzatori.
ja: アセンブリ {0} にアナライザーは含まれていません。
ko: {0} 어셈블리에는 분석기가 포함되어 있지 않습니다.
pl: Zestaw {0} nie zawiera żadnych analizatorów.
pt_br: O assembly {0} não contém quaisquer analisadores.
ru: Сборка {0} не содержит анализаторов.
tr: {0} derlemesi hiçbir çözümleyici içermiyor.
zh_hans: 程序集 {0} 不包含任何分析器。
zh_hant: 組件 {0} 不包含任何分析器。

# WRN_NoAnalyzerInAssembly_Title
source: Assembly does not contain any analyzers
cs: Sestavení neobsahuje žádné analyzátory.
de: Assembly enthält keine Analysen
es: El ensamblado no contiene ningún analizador
fr: L'assembly ne contient pas d'analyseur
it: L'assembly non contiene analizzatori
ja: アセンブリに、アナライザーが含まれていません
ko: 어셈블리에는 분석기가 포함되어 있지 않습니다.
pl: Zestaw nie zawiera analizatorów
pt_br: O assembly não contém analisadores
ru: Сборка не содержит анализаторов
tr: Derleme hiçbir çözümleyici içermiyor
zh_hans: 程序集不包含任何分析器
zh_hant: 組件不包含任何分析器

# WRN_UnableToLoadAnalyzer
source: Unable to load analyzer assembly {0} : {1}.
cs: Nejde načíst sestavení analyzátoru {0}: {1}.
de: Die Assembly "{0}" des Analysetools kann nicht geladen werden: {1}.
es: No se puede cargar el ensamblado de analizador {0} : {1}.
fr: Impossible de charger l'assembly d'analyseur {0} : {1}.
it: Non è possibile caricare l'assembly dell'analizzatore {0}: {1}.
ja: アナライザー アセンブリ {0} を読み込めませんでした: {1}。
ko: {0} 분석기 어셈블리를 로드할 수 없습니다({1}).
pl: Nie można załadować zestawu analizatora {0}: {1}.
pt_br: Não é possível carregar o assembly do analisador {0} : {1}.
ru: Не удается загрузить анализатор сборки{0}: {1}.
tr: {0} çözümleyici derlemesi yüklenemedi: {1}.
zh_hans: 无法加载分析器程序集 {0}: {1}。
zh_hant: 無法載入分析器組件 {0} : {1}。

# WRN_UnableToLoadAnalyzer_Title
source: Unable to load analyzer assembly
cs: Nedá se načíst sestavení analyzátoru.
de: Die Assembly des Analysetools konnte nicht geladen werden.
es: No se puede cargar el ensamblado del analizador
fr: Impossible de charger l’assembly de l’analyseur
it: Non è possibile caricare l'assembly dell'analizzatore
ja: アナライザーのアセンブリを読み込むことができません
ko: 분석기 어셈블리를 로드할 수 없음
pl: Nie można załadować zestawu analizatora
pt_br: Não é possível carregar o assembly do analisador
ru: Не удалось загрузить сборку анализатора
tr: Çözümleyici derlemesi yüklenemiyor
zh_hans: 无法加载分析器程序集
zh_hant: 無法載入分析器組件

# INF_UnableToLoadSomeTypesInAnalyzer
source: Skipping some types in analyzer assembly {0} due to a ReflectionTypeLoadException : {1}.
cs: Přeskočí se některé typy v sestavení analyzátoru {0} kvůli výjimce ReflectionTypeLoadException: {1}.
de: Einige Typen werden in der Analyzer-Assembly {0} aufgrund von ReflectionTypeLoadException übersprungen: {1}.
es: Omisión de algunos tipos en el ensamblado de analizador {0} por una ReflectionTypeLoadException: {1}.
fr: Certains types contenus dans l'assembly analyseur {0} ont été ignorés pour cause de ReflectionTypeLoadException : {1}.
it: Alcuni tipi nell'assembly dell'analizzatore {0} verranno ignorati a causa di un'eccezione ReflectionTypeLoadException: {1}.
ja: ReflectionTypeLoadException ({1}) のため、アナライザー アセンブリ {0} の一部の型をスキップしています。
ko: ReflectionTypeLoadException로 인해 {0} 분석기 어셈블리에서 일부 형식을 건너뜁니다({1}).
pl: Niektóre typy zestawu analizatora {0} zostaną pominięte z powodu wyjątku ReflectionTypeLoadException: {1}.
pt_br: Ignorando a alguns tipos de assembly de analisador {0} devido a uma ReflectionTypeLoadException: {1}.
ru: Пропуск некоторых типов в сборке анализатора {0} из-за исключения ReflectionTypeLoadException: {1}.
tr: Bir ReflectionTypeLoadException nedeniyle {0} çözümleyici derleyicisinde bazı türler atlanıyor: {1}.
zh_hans: 正在跳过分析器程序集 {0} 中的某些类型，因为出现 ReflectionTypeLoadException: {1}。
zh_hant: 因為 ReflectionTypeLoadException 之故，所以略過分析器組件 {0} 中的某些類型: {1}。

# INF_UnableToLoadSomeTypesInAnalyzer_Title
source: Skip loading types in analyzer assembly that fail due to a ReflectionTypeLoadException
cs: Přeskočí načtení typů v sestavení analyzátoru, které selžou kvůli výjimce ReflectionTypeLoadException.
de: Das Laden von Typen in der Analyseassembly überspringen, bei denen durch eine ReflectionTypeLoadException ein Fehler auftrat.
es: Omitir la carga de los tipos con errores en el ensamblado de analizador debido a ReflectionTypeLoadException
fr: Ignorer le chargement de types dans un assembly d’analyseur qui échouent en raison d’une ReflectionTypeLoadException
it: Ignora il caricamento dei tipi nell'assembly dell'analizzatore che non riescono a causa di un'eccezione ReflectionTypeLoadException
ja: ReflectionTypeLoadException のために失敗したアナライザーのアセンブリ内の型の読み込みをスキップします
ko: ReflectionTypeLoadException으로 인해 실패한 분석기 어셈블리에서 형식 로드를 건너뜀
pl: Pomiń ładowanie typów w zestawie analizatora zakończonych niepowodzeniem z powodu wyjątku ReflectionTypeLoadException
pt_br: Ignorar tipos de carregamento no assembly analisador que falharem devido a uma ReflectionTypeLoadException
ru: Пропуск загрузки типов в сборке анализатора, завершившихся сбоем из-за ReflectionTypeLoadException
tr: Bir ReflectionTypeLoadException nedeniyle başarısız olan çözümleyici derlemesinde türleri yüklemeyi atlayın
zh_hans: 跳过加载分析器程序集中因 ReflectionTypeLoadException 而失败的类型
zh_hant: 跳過載入分析器組件中因 ReflectionTypeLoadException 而失敗的類型

# ERR_CantReadRulesetFile
source: Error reading ruleset file {0} - {1}
cs: Chyba při čtení souboru sady pravidel {0} - {1}
de: Fehler beim Lesen der RULESET-Datei "{0}": {1}
es: Error al leer el archivo de conjunto de reglas {0}: {1}
fr: Erreur lors de la lecture du fichier ruleset {0} - {1}
it: Si è verificato un errore durante la lettura del file del set di regole {0} - {1}
ja: 規則セット ファイル {0} を読み込み中にエラーが発生しました - {1}
ko: {0} ruleset 파일을 읽는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas odczytywania pliku zestawu reguł {0} — {1}
pt_br: Erro ao ler arquivo de conjunto de regras {0} - {1}
ru: Ошибка при чтении файла с набором правил {0} — {1}
tr: {0} kural kümesi dosyası okunurken hata - {1}
zh_hans: 读取规则集文件 {0} 时出错 - {1}
zh_hant: 讀取規則集檔案 {0} 時發生錯誤 - {1}

# ERR_PlatformDoesntSupport
source: {0} is not supported in current project type.
cs: {0} se nepodporuje v aktuálním typu projektu.
de: {0} wird im aktuellen Projekttyp nicht unterstützt.
es: {0} no se admite en el tipo de proyecto actual.
fr: {0} n'est pas pris en charge dans le type de projet actif.
it: {0} non è supportato nel tipo di progetto corrente.
ja: 現在のプロジェクトのタイプでは {0} がサポートされていません。
ko: {0}은(는) 현재 프로젝트 형식에서 지원되지 않습니다.
pl: Element {0} nie jest obsługiwany w bieżącym typie projektu.
pt_br: {0} não é suportado no tipo de projeto atual.
ru: {0} не поддерживается в текущем типе проекта.
tr: Geçerli proje türünde {0} desteklenmiyor.
zh_hans: 当前项目类型不支持 {0}。
zh_hant: 目前的專案類型不支援 {0}。

# ERR_CantUseRequiredAttribute
source: The RequiredAttribute attribute is not permitted on Visual Basic types.
cs: Atribut RequiredAttribute není povolený pro typy Visual Basicu.
de: Das RequiredAttribute-Attribut ist in Visual Basic-Typen nicht zulässig.
es: El atributo RequiredAttribute no está permitido en los tipos de Visual Basic.
fr: L'attribut RequiredAttribute n'est pas autorisé dans des types Visual Basic.
it: L'attributo RequiredAttribute non è consentito per i tipi Visual Basic.
ja: RequiredAttribute 属性は Visual Basic 型で許可されていません。
ko: RequiredAttribute 특성은 Visual Basic 형식에서 허용되지 않습니다.
pl: Atrybut RequiredAttribute nie jest dozwolony w typach programu Visual Basic.
pt_br: O atributo RequiredAttribute não é permitido em tipos do Visual Basic.
ru: Атрибут RequiredAttribute не разрешен для типов Visual Basic.
tr: Visual Basic türlerinden RequiredAttribute özniteliğine izin verilmez.
zh_hans: Visual Basic 类型上不允许有 RequiredAttribute 特性。
zh_hant: Visual Basic 類型上不可出現 RequiredAttribute 屬性。

# ERR_EncodinglessSyntaxTree
source: Cannot emit debug information for a source text without encoding.
cs: Nejde vygenerovat ladicí informace pro zdrojový text bez kódování.
de: Debuginformationen für einen Quelltext können nur codiert ausgegeben werden.
es: No se puede emitir información de depuración para un texto de origen sin descodificar.
fr: Impossible d'émettre des informations de débogage pour un texte source sans encodage.
it: Non è possibile creare le informazioni di debug per un testo di origine senza codifica.
ja: エンコーディングせずにソース テキストのデバッグ情報を作成することはできません。
ko: 인코딩하지 않고 원본 텍스트에 대한 디버그 정보를 생성할 수 없습니다.
pl: Nie można wyemitować informacji debugowania dla tekstu źródłowego bez kodowania.
pt_br: Não é possível emitir informações de depuração para um texto de origem sem codificação.
ru: Не удается выдать отладочную информацию для исходного текста без кодировки.
tr: Kodlama olmadan bir kaynak metin için hata ayıklama bilgileri yayılamıyor.
zh_hans: 无法在不进行编码的情况下发出源文本的调试信息。
zh_hant: 無法在不編碼的情況下，對原始程式文字發出偵錯資訊。
