Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DuplicateImport1
source: Namespace or type '{0}' has already been imported.
cs: Obor názvů nebo typ {0} už je naimportovaný.
de: Namespace oder Typ "{0}" wurde bereits importiert.
es: El espacio de nombres o el tipo '{0}' ya se han importado.
fr: L'espace de noms ou le type '{0}' a déjà été importé.
it: Lo spazio dei nomi o il tipo '{0}' è già stato importato.
ja: 名前空間または型 '{0}' は既にインポートされています。
ko: '{0}' 네임스페이스 또는 형식을 이미 가져왔습니다.
pl: Przestrzeń nazw lub typ „{0}” zostały już zaimportowane.
pt_br: Namespace ou tipo "{0}" já foi importado.
ru: Пространство имен или тип "{0}" уже импортированы.
tr: '{0}' ad alanı veya türü zaten içeri aktarıldı.
zh_hans: 已导入命名空间或类型呢“{0}”。
zh_hant: 命名空間或類型 '{0}' 已經匯入。

# ERR_BadModuleFlags1
source: Modules cannot be declared '{0}'.
cs: Pro moduly nejde použít deklaraci {0}.
de: Module können nicht als "{0}" deklariert werden.
es: Los módulos no se pueden declarar como '{0}'.
fr: Les modules ne peuvent pas être déclarés '{0}'.
it: I moduli non possono essere dichiarati come '{0}'.
ja: モジュールを '{0}' として宣言することはできません。
ko: 모듈은 '{0}'(으)로 선언할 수 없습니다.
pl: Moduły nie mogą być deklarowane jako „{0}”.
pt_br: Módulos não podem ser declarados "{0}".
ru: Модули не могут быть объявлены "{0}".
tr: Modüller '{0}' olarak bildirilemez.
zh_hans: 模块不能声明为“{0}”。
zh_hant: 模組不可宣告為 '{0}'。

# ERR_ImplementsStmtWrongOrder
source: 'Implements' statements must follow any 'Inherits' statement and precede all declarations in a class.
cs: 'Příkazy Implements musí následovat za všemi příkazy Inherits a musí předcházet všechny deklarace v rámci třídy.
de: 'Implements-Anweisungen müssen allen Inherits-Anweisungen folgen und allen Deklarationen in der Klasse voranstehen.
es: 'Las instrucciones 'Implements' deben ir detrás de las instrucciones 'Inherits' y delante de todas las declaraciones de una clase.
fr: 'Les instructions 'Implements' doivent suivre toute instruction 'Inherits' et précéder toutes les déclarations dans une classe.
it: 'Le istruzioni 'Implements' devono seguire l'istruzione 'Inherits' e precedere tutte le dichiarazioni in una classe.
ja: 'Implements' ステートメントは、'Inherits' ステートメントの後およびクラス内のすべての宣言の前に記述しなければなりません。
ko: 'Implements' 문은 모든 'Inherits' 문 다음에 와야 하고 클래스의 모든 선언 앞에 와야 합니다.
pl: 'Instrukcje „Implements” muszą występować po wszelkich instrukcjach „Inherits” i muszą znajdować się przed wszystkimi deklaracjami w klasie.
pt_br: 'Instruções 'Implements' devem seguir qualquer instrução 'Inherits' e preceder todas as declarações em uma classe.
ru: 'После каждого оператора "Inherits" до первого объявления в классе должен присутствовать оператор "Implements".
tr: 'Implements' deyimleri 'Inherits' deyiminden sonra ve sınıftaki tüm bildirimlerden önce gelmelidir.
zh_hans: '“Implements”语句在类中必须位于任何“Inherits”语句之后，所有声明之前。
zh_hant: 'Implements' 陳述式必須位在所有 'Inherits' 陳述式之後，並且必須在類別中的所有宣告之前。

# ERR_SynthMemberClashesWithSynth7
source: {0} '{1}' implicitly defines '{2}', which conflicts with a member implicitly declared for {3} '{4}' in {5} '{6}'.
cs: {0} – {1} implicitně definuje člen {2}, který je v konfliktu s členem implicitně deklarovaným pro {3} – {4} v {5} – {6}.
de: {0} "{1}" definiert implizit "{2}", was einen Konflikt mit einem für {3} "{4}" in {5} "{6}" implizit deklarierten Member verursacht.
es: {0} '{1}' define implícitamente '{2}', que entra en conflicto con un miembro declarado implícitamente para {3} '{4}' en {5} '{6}'.
fr: {0} '{1}' définit implicitement '{2}', qui est en conflit avec un membre déclaré implicitement pour {3} '{4}' dans {5} '{6}'.
it: {0} '{1}' definisce in modo implicito '{2}', che è in conflitto con un membro dichiarato in modo implicito per {3} '{4}' in {5} '{6}'.
ja: {0} '{1}' は、{5} '{6}' で {3} '{4}' に対して暗黙的に宣言されたメンバーと競合している '{2}' を暗黙的に定義しています。
ko: {0} '{1}'은(는) {5} '{6}'의 {3} '{4}'에 대해 암시적으로 선언된 멤버와 충돌하는 '{2}'을(를) 암시적으로 정의합니다.
pl: Element {0} „{1}” niejawnie definiuje element „{2}”, który powoduje konflikt ze składową zadeklarowaną niejawnie dla elementu {3} „{4}” w elemencie {5} „{6}”.
pt_br: {0} "{1}" define implicitamente "{2}", que está em conflito com um membro implicitamente declarado para {3} "{4}" em {5} "{6}".
ru: {0} "{1}" неявно объявляет "{2}", что конфликтует с членом, который был неявно объявлен для {3} "{4}" в {5} "{6}".
tr: {0} '{1}', {5} '{6}' içinde {3} '{4}' için bildirilen bir öğeyle çakışan '{2}' öğesini örtük olarak tanımlıyor.
zh_hans: {0}“{1}”隐式定义的“{2}”与为 {5}“{6}”中的 {3}“{4}”隐式声明的成员冲突。
zh_hant: {0} '{1}' 隱含定義 '{2}'，其與 {5} '{6}' 中為 {3} '{4}' 所隱含宣告的成員互相衝突。

# ERR_SynthMemberClashesWithMember5
source: {0} '{1}' implicitly defines '{2}', which conflicts with a member of the same name in {3} '{4}'.
cs: {0} – {1} implicitně definuje člen {2}, který je v konfliktu se stejnojmenným členem třídy {3} – {4}.
de: {0} "{1}" definiert implizit "{2}", was einen Konflikt mit einem Member mit dem gleichen Namen in {3} "{4}" verursacht.
es: {0} '{1}' define implícitamente '{2}', que entra en conflicto con un miembro del mismo nombre en {3} '{4}'.
fr: {0} '{1}' définit implicitement '{2}', qui est en conflit avec un membre du même nom dans {3} '{4}'.
it: {0} '{1}' definisce in modo implicito '{2}', che è in conflitto con un membro con lo stesso nome in {3} '{4}'.
ja: {0} '{1}' は、同じ名前のメンバーと {3} '{4}' で競合する '{2}' を暗黙的に定義しています。
ko: {0} '{1}'은(는) {3} '{4}'에서 이름이 같은 멤버와 충돌하는 '{2}'을(를) 암시적으로 정의합니다.
pl: Element {0} „{1}” niejawnie definiuje element „{2}”, który powoduje konflikt ze składową o tej samej nazwie w elemencie {3} „{4}”.
pt_br: {0} "{1}" define implicitamente "{2}", que está em conflito com um membro do mesmo nome em {3} "{4}".
ru: {0} "{1}" неявно объявляет "{2}", который конфликтует с членом с тем же именем в {3} "{4}".
tr: {0} '{1}', {3} '{4}' içindeki aynı adlı bir üyeyle çakışan '{2}' öğesini örtük olarak tanımlıyor.
zh_hans: {0}“{1}”隐式定义的“{2}”与 {3}“{4}”中的同名成员冲突。
zh_hant: {0} '{1}' 隱含定義 '{2}'，其與 {3} '{4}' 中相同名稱的成員互相衝突。

# ERR_MemberClashesWithSynth6
source: {0} '{1}' conflicts with a member implicitly declared for {2} '{3}' in {4} '{5}'.
cs: {0} – {1} je v konfliktu se členem implicitně deklarovaným pro {2} – {3} ve třídě {4} – {5}.
de: {0} "{1}" verursacht einen Konflikt mit einem für {2} "{3}" in {4} "{5}" implizit deklarierten Member.
es: {0} '{1}' entra en conflicto con un miembro declarado implícitamente para {2} '{3}' en {4} '{5}'.
fr: {0} '{1}' est en conflit avec un membre déclaré implicitement pour {2} '{3}' dans {4} '{5}'.
it: {0} '{1}' è in conflitto con un membro dichiarato in modo implicito per {2} '{3}' in {4} '{5}'.
ja: {0} '{1}' は、{4} '{5}' の {2} '{3}' に対して暗黙的に宣言されたメンバーと競合しています。
ko: {0} '{1}'은(는) {4} '{5}'의 {2} '{3}'에 대해 암시적으로 선언된 멤버와 충돌합니다.
pl: Element {0} „{1}” powoduje konflikt ze składową zadeklarowaną niejawnie dla elementu {2} „{3}” w elemencie {4} „{5}”.
pt_br: {0} "{1}" está em conflito com um membro implicitamente declarado para {2} "{3}" em {4} "{5}".
ru: {0} "{1}" конфликтует с членом, неявно объявленным для {2} "{3}" в {4} "{5}".
tr: {0} '{1}', {4} '{5}' içindeki {2} '{3}' için örtük olarak bildirilen bir üyeyle çakışıyor.
zh_hans: {0}“{1}”与为 {4}“{5}”中的 {2}“{3}”隐式声明的成员冲突。
zh_hant: {0} '{1}' 與 {4} '{5}' 中為 {2} '{3}' 所隱含宣告的成員互相衝突。

# ERR_TypeClashesWithVbCoreType4
source: {0} '{1}' conflicts with a Visual Basic Runtime {2} '{3}'.
cs: {0} – {1} je v konfliktu s {2} – {3} z Visual Basic Runtimu.
de: {0} "{1}" steht in Konflikt mit einer Visual Basic Runtime-{2} "{3}".
es: {0} '{1}' entra en conflicto con un {2} '{3}' en tiempo de ejecución de Visual Basic.
fr: {0} '{1}' est en conflit avec un {2} '{3}' Visual Basic Runtime.
it: {0} '{1}' è in conflitto con un elemento {2} '{3}' di Visual Basic Runtime.
ja: {0} '{1}' が Visual Basic ランタイム {2} '{3}' と競合しています。
ko: {0} '{1}'이(가) Visual Basic Runtime {2} '{3}'과(와) 충돌합니다.
pl: Element {0} „{1}” powoduje konflikt ze środowiskiem uruchomieniowym języka Visual Basic {2} „{3}”.
pt_br: {0} '{1}' está em conflito com um Visual Basic Runtime {2} '{3}'.
ru: {0} "{1}" конфликтует со средой выполнения Visual Basic {2} "{3}".
tr: {0} '{1}', {2} '{3}' Visual Basic Çalışma Zamanıyla çakışıyor.
zh_hans: {0}“{1}”与 Visual Basic 运行时 {2}“{3}”冲突。
zh_hant: {0} '{1}' 與 Visual Basic 執行階段 {2} '{3}' 相衝突。

# ERR_SecurityAttributeMissingAction
source: First argument to a security attribute must be a valid SecurityAction.
cs: První argument atributu zabezpečení musí být platný SecurityAction.
de: Das erste Argument eines Sicherheitsattributs muss ein gültiger SecurityAction-Wert sein.
es: El primer argumento de un atributo de seguridad debe ser un SecurityAction válido.
fr: Le premier argument d'un attribut de sécurité doit être un SecurityAction valide.
it: Il primo argomento di un attributo di sicurezza deve essere un elemento SecurityAction valido.
ja: セキュリティ属性への最初の引数は有効な SecurityAction でなければなりません。
ko: 보안 특성에 대한 첫 번째 인수는 유효한 SecurityAction이어야 합니다.
pl: Pierwszy argument atrybutu zabezpieczeń musi być poprawnym elementem SecurityAction.
pt_br: Primeiro argumento para um atributo de segurança deve ser um SecurityAction válido.
ru: Первый аргумент для атрибута безопасности должен быть допустимым атрибутом SecurityAction.
tr: Güvenlik özniteliğinin ilk bağımsız değişkeni geçerli bir SecurityAction olmalıdır.
zh_hans: 安全属性的第一个参数必须是有效的 SecurityAction。
zh_hant: 安全屬性的第一個引數，必須是有效的 SecurityAction。

# ERR_SecurityAttributeInvalidAction
source: Security attribute '{0}' has an invalid SecurityAction value '{1}'.
cs: Atribut zabezpečení {0} má neplatnou hodnotu SecurityAction {1}.
de: Das Sicherheitsattribut "{0}" hat einen ungültigen SecurityAction-Wert "{1}".
es: El atributo de seguridad '{0}' tiene un valor '{1}' de SecurityAction no válido.
fr: L'attribut de sécurité '{0}' a une valeur SecurityAction '{1}' non valide.
it: L'attributo di sicurezza '{0}' ha un valore SecurityAction '{1}' non valido.
ja: セキュリティ属性 '{0}' の SecurityAction 値 '{1}' が無効です。
ko: '{0}' 보안 특성에 있는 SecurityAction 값('{1}')이 잘못되었습니다.
pl: Atrybut zabezpieczeń „{0}” ma nieprawidłową wartość SecurityAction: „{1}”.
pt_br: Atributo de segurança "{0}" tem um valor SecurityAction inválido "{1}".
ru: Атрибут безопасности "{0}" имеет недопустимое значение SecurityAction "{1}".
tr: '{0}' güvenlik özniteliğinin '{1}' SecurityAction değeri geçersiz.
zh_hans: 安全属性“{0}”具有无效的 SecurityAction 值“{1}”。
zh_hant: 安全屬性 '{0}' 的 SecurityAction 值 '{1}' 無效。

# ERR_SecurityAttributeInvalidActionAssembly
source: SecurityAction value '{0}' is invalid for security attributes applied to an assembly.
cs: Hodnota SecurityAction {0} není platná pro atributy zabezpečení použité u sestavení.
de: Der SecurityAction-Wert "{0}" ist für auf eine Assembly angewendete Sicherheitsattribute ungültig.
es: El valor '{0}' de SecurityAction no es válido para los atributos de seguridad aplicados a un ensamblado.
fr: La valeur SecurityAction '{0}' n'est pas valide pour les attributs de sécurité appliqués à un assembly.
it: Il valore '{0}' di SecurityAction non è valido per gli attributi di sicurezza applicati a un assembly.
ja: SecurityAction 値 '{0}' が、アセンブリに適用されたセキュリティ属性に対して無効です。
ko: 어셈블리에 적용된 보안 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest niepoprawna dla atrybutów zabezpieczeń zastosowanych względem zestawu.
pt_br: Valor SecurityAction "{0}" é inválido para atributos de segurança aplicados a um assembly.
ru: Значение SecurityAction "{0}" является недопустимым для атрибутов безопасности, применяемых к сборке.
tr: Derlemeye uygulanan güvenlik özniteliklerinde '{0}' SecurityAction değeri geçersiz.
zh_hans: SecurityAction 值“{0}”对应用于程序集的安全属性无效。
zh_hant: SecurityAction 值 '{0}' 對套用至組件的安全屬性無效。

# ERR_SecurityAttributeInvalidActionTypeOrMethod
source: SecurityAction value '{0}' is invalid for security attributes applied to a type or a method.
cs: Hodnota SecurityAction {0} není platná pro atributy zabezpečení použité u typu nebo metody.
de: Der SecurityAction-Wert "{0}" ist für auf einen Typ oder eine Methode angewendete Sicherheitsattribute ungültig.
es: El valor '{0}' de SecurityAction no es válido para los atributos de seguridad aplicados a un tipo o método.
fr: La valeur SecurityAction '{0}' n'est pas valide pour les attributs de sécurité appliqués à un type ou à une méthode.
it: Il valore '{0}' di SecurityAction non è valido per gli attributi di sicurezza applicati a un tipo o a un metodo.
ja: SecurityAction 値 '{0}' が、型またはメソッドに適用されたセキュリティ属性に対して無効です。
ko: 형식 또는 메서드에 적용된 보안 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest niepoprawna dla atrybutów zabezpieczeń zastosowanych względem typu lub metody.
pt_br: Valor SecurityAction "{0}" é inválido para atributos de segurança aplicados a um tipo ou um método.
ru: Значение SecurityAction "{0}" является недопустимым для атрибутов безопасности, применяемых к типу или методу.
tr: Türe veya yönteme uygulanan güvenlik özniteliklerinde '{0}' SecurityAction değeri geçersiz.
zh_hans: SecurityAction 值“{0}”对应用于类型或方法的安全属性无效。
zh_hant: SecurityAction 值 '{0}' 對套用至類型或方法的安全屬性無效。

# ERR_PrincipalPermissionInvalidAction
source: SecurityAction value '{0}' is invalid for PrincipalPermission attribute.
cs: Hodnota SecurityAction {0} není platná pro atribut PrincipalPermission.
de: Der SecurityAction-Wert "{0}" ist für das PrincipalPermission-Attribut ungültig.
es: El valor '{0}' de SecurityAction no es válido para el atributo PrincipalPermission.
fr: La valeur SecurityAction '{0}' n'est pas valide pour l'attribut PrincipalPermission.
it: Il valore '{0}' di SecurityAction non è valido per l'attributo PrincipalPermission.
ja: PrincipalPermission 属性では、SecurityAction の値 '{0}' が無効です。
ko: PrincipalPermission 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest niepoprawna dla atrybutu PrincipalPermission.
pt_br: Valor SecurityAction "{0}" é inválido para o atributo PrincipalPermission.
ru: значение SecurityAction "{0}" недопустимо для атрибута PrincipalPermission.
tr: PrincipalPermission özniteliği için '{0}' SecurityAction değeri geçersiz.
zh_hans: SecurityAction 值“{0}”对 PrincipalPermission 属性无效。
zh_hant: SecurityAction 值 '{0}' 對 PrincipalPermission 屬性無效。

# ERR_PermissionSetAttributeInvalidFile
source: Unable to resolve file path '{0}' specified for the named argument '{1}' for PermissionSet attribute.
cs: Nejde vyřešit cestu k souboru {0} zadanému pro pojmenovaný argument {1} pro atribut PermissionSet.
de: Fehler beim Auflösen von Dateipfad "{0}", der für das benannte Argument "{1}" des PermissionSet-Attributs angegeben wurde.
es: No se puede resolver la ruta de acceso de archivo '{0}' especificada para el argumento con nombre '{1}' para el atributo PermissionSet.
fr: Impossible de résoudre le chemin d'accès au fichier '{0}' spécifié pour l'argument nommé '{1}' de l'attribut PermissionSet.
it: Non è possibile risolvere il percorso del file '{0}' specificato per l'argomento denominato '{1}' per l'attributo PermissionSet.
ja: PermissionSet 属性の名前付き引数 '{1}' に指定されたファイル パス '{0}' を解決できません。
ko: PermissionSet 특성에 대해 명명된 인수 '{1}'에 지정된 '{0}' 파일 경로를 확인할 수 없습니다.
pl: Nie można rozpoznać ścieżki do pliku „{0}” określonej dla nazwanego argumentu „{1}” dla atrybutu PermissionSet.
pt_br: Não é possível resolver o caminho de arquivo "{0}" especificado para o argumento nomeado "{1}" para o atributo PermissionSet.
ru: Не удается найти путь к файлу "{0}", указанному для именованного аргумента "{1}" для атрибута PermissionSet.
tr: PermissionSet özniteliği için '{1}' adlandırılmış bağımsız değişkeninde belirtilen '{0}' dosya yolu çözülemedi.
zh_hans: 无法解析为 PermissionSet 属性的命名参数“{1}”指定的文件路径“{0}”。
zh_hant: 無法解析指定給 PermissionSet 屬性之具名引數 '{1}' 的檔案路徑 '{0}'。

# ERR_PermissionSetAttributeFileReadError
source: Error reading file '{0}' specified for the named argument '{1}' for PermissionSet attribute: '{2}'.
cs: Chyba při čtení souboru {0} zadaného pro pojmenovaný argument {1} pro atribut PermissionSet: {2}
de: Fehler beim Lesen von Datei "{0}", die für das benannte Argument "{1}" des PermissionSet-Attributs angegeben wurde: "{2}".
es: Error al leer el archivo '{0}' especificado para el argumento con nombre '{1}' para el atributo PermissionSet: '{2}'.
fr: Erreur lors de la lecture du fichier '{0}' spécifié pour l'argument nommé '{1}' pour l'attribut PermissionSet : '{2}'.
it: Si è verificato un errore durante la lettura del file '{0}' specificato per l'argomento denominato '{1}' per l'attributo PermissionSet: '{2}'.
ja: PermissionSet 属性の名前付き引数 '{1}' に指定されたファイル '{0}' の読み取り中にエラーが発生しました: '{2}'
ko: PermissionSet 특성에 대해 명명된 인수 '{1}'에 지정된 '{0}' 파일을 읽는 동안 오류가 발생했습니다('{2}').
pl: Błąd podczas odczytu pliku „{0}” określonego dla nazwanego argumentu „{1}” dla atrybutu PermissionSet: „{2}”.
pt_br: Erro ao ler arquivo "{0}" especificado para o argumento nomeado "{1}" para o atributo PermissionSet: "{2}".
ru: Ошибка чтения файла "{0}", указанного для именованного аргумента "{1}" для атрибута PermissionSet: '{2}'.
tr: PermissionSet özniteliği için '{1}' adlandırılmış bağımsız değişkeninde belirtilen '{0}' dosyası okunurken hata oluştu: '{2}'.
zh_hans: 读取为 PermissionSet 属性的命名参数“{1}”指定的文件“'{0}' ”时出错:“{2}”。
zh_hant: 讀取指定給 PermissionSet 屬性之具名引數 '{1}' 的檔案 '{0}' 時發生錯誤: '{2}'。

# ERR_SetHasOnlyOneParam
source: 'Set' method cannot have more than one parameter.
cs: 'Metoda Set nemůže mít víc než jeden parametr.
de: 'Die Set-Methode kann nicht mehrere Parameter haben.
es: 'El método 'Set' no puede tener más de un parámetro.
fr: 'La méthode 'Set' ne peut pas comporter plusieurs paramètres.
it: 'Il metodo 'Set' non può avere più di un parametro.
ja: 'Set' メソッドに 2 つ以上のパラメーターを指定することはできません。
ko: 'Set' 메서드에는 매개 변수를 둘 이상 사용할 수 없습니다.
pl: 'Metoda „Set” nie może mieć więcej parametrów niż jeden.
pt_br: 'O método 'Set' não pode ter mais de um parâmetro.
ru: 'Метод "Set" не может иметь более одного параметра.
tr: 'Set' yönteminin birden fazla parametresi olamaz.
zh_hans: '"Set" 方法不能有一个以上的参数。
zh_hant: 'Set' 方法不可以有多個參數。

# ERR_SetValueNotPropertyType
source: 'Set' parameter must have the same type as the containing property.
cs: 'Parametr metody Set musí být stejného typu jako příslušná vlastnost.
de: 'Der Set-Parameter muss denselben Typ wie die Eigenschaft haben, in der er sich befindet.
es: 'El parámetro de 'Set' debe tener el mismo tipo que la propiedad que lo contiene.
fr: 'Le paramètre 'Set' doit être du même type que la propriété conteneur.
it: 'Il parametro 'Set' deve essere dello stesso tipo della proprietà che lo contiene.
ja: 'Set' パラメーターには、それを含むプロパティと同じ型を指定しなければなりません。
ko: 'Set' 매개 변수는 포함하는 속성과 형식이 같아야 합니다.
pl: 'Parametr Set musi mieć taki sam typ jak zawierająca go właściwość.
pt_br: 'O parâmetro 'Set' deve ter a mesma propriedade que a propriedade recipiente.
ru: 'Тип параметра метода "Set" должен совпадать с типом содержащего его свойства.
tr: 'Set' parametresinin türü, kendisini içeren özellikle aynı olmalıdır.
zh_hans: '"Set" 参数必须与包含属性的类型相同。
zh_hant: 'Set' 參數必須和包含的屬性具有相同的類型。

# ERR_SetHasToBeByVal1
source: 'Set' parameter cannot be declared '{0}'.
cs: 'Pro parametr metody Set nelze použít deklaraci {0}.
de: 'Der Set-Parameter kann nicht als "{0}" deklariert werden.
es: 'El parámetro 'Set' no se puede declarar como '{0}'.
fr: 'Le paramètre 'Set' ne peut pas être déclaré '{0}'.
it: 'Il parametro 'Set' non può essere dichiarato come '{0}'.
ja: 'Set' パラメーターを '{0}' に宣言することはできません。
ko: 'Set' 매개 변수는 '{0}'(으)로 선언할 수 없습니다.
pl: 'Nie można zadeklarować parametru „Set” jako „{0}”.
pt_br: 'Parâmetro "Set" não pode ser declarado "{0}".
ru: 'Невозможно объявить параметр "Set" как "{0}".
tr: 'Set' parametresi '{0}' olarak bildirilemez.
zh_hans: '“Set”参数不能声明为“{0}”。
zh_hant: 'Set' 參數不可宣告為 '{0}'。

# ERR_StructureCantUseProtected
source: Method in a structure cannot be declared 'Protected', 'Protected Friend', or 'Private Protected'.
cs: Metodu ve struktuře nelze deklarovat jako Protected, Protected Friend ani Private Protected.
de: Eine Methode in einer Struktur kann nicht als "Protected", "Protected Friend" oder "Private Protected" deklariert werden.
es: Un método de una estructura no se puede declarar como "Protected", "Protected Friend" o "Private Protected".
fr: Une méthode dans une structure ne peut pas être déclarée 'Protected', 'Protected Friend' ou 'Private Protected'.
it: Non è possibile dichiarare un metodo in una struttura come 'Protected', 'Protected Friend', o 'Private Protected'.
ja: 構造体のメソッドを 'Protected'、'Protected Friend' または 'Private Protected' として宣言することはできません。
ko: 구조체의 메서드는 'Protected', 'Protected Friend' 또는 'Private Protected'로 선언할 수 없습니다.
pl: Nie można zadeklarować metody w strukturze jako Protected, Protected Friend lub Private Protected.
pt_br: O método em uma estrutura não pode ser declarado 'Protected', 'Protected Friend' ou 'Private Protected'.
ru: Метод в структуре нельзя объявлять как "Protected", "Protected Friend" или "Private Protected".
tr: Bir yapı içindeki metot 'Protected', 'Protected Friend' veya 'Private Protected' olarak bildirilemez.
zh_hans: 结构中的方法不能声明为 "Protected"、"Protected Friend" 或 "Private Protected"。
zh_hant: 在結構中的方法不可宣告為 'Protected'、'Protected Friend' 或 'Private Protected'。

# ERR_BadInterfaceDelegateSpecifier1
source: Delegate in an interface cannot be declared '{0}'.
cs: Pro delegáta v rozhraní nejde použít deklaraci {0}.
de: Ein Delegat in einer Schnittstelle kann nicht als "{0}" deklariert werden.
es: Un delegado de una interfaz no se puede declarar como '{0}'.
fr: Un délégué dans une interface ne peut pas être déclaré '{0}'.
it: Il delegato in un'interfaccia non può essere dichiarato come '{0}'.
ja: インターフェイス内のデリゲートを '{0}' と宣言することはできません。
ko: 인터페이스의 대리자는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować delegatu w interfejsie jako „{0}”.
pt_br: Delegado em uma interface não pode ser declarado "{0}".
ru: Делегат в интерфейсе не может объявляться как "{0}".
tr: Arabirim içindeki temsilci '{0}' olarak bildirilemez.
zh_hans: 接口中的委托不能声明为“{0}”。
zh_hant: 介面中的委派不可宣告為 '{0}'。

# ERR_BadInterfaceEnumSpecifier1
source: Enum in an interface cannot be declared '{0}'.
cs: Pro výčet v rozhraní nejde použít deklaraci {0}.
de: Eine Enumeration in einer Schnittstelle kann nicht als "{0}" deklariert werden.
es: Una enumeración de una interfaz no se puede declarar como '{0}'.
fr: Un enum dans une interface ne peut pas être déclaré '{0}'.
it: Non è possibile dichiarare come '{0}' l'enumerazione in un'interfaccia.
ja: インターフェイス内の Enum を '{0}' と宣言することはできません。
ko: 인터페이스의 열거형은 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować wyliczenia w interfejsie jako „{0}”.
pt_br: Enum em uma interface não pode ser declarada "{0}".
ru: Перечисление в интерфейсе не может объявляться как "{0}".
tr: Arabirim içindeki sabit listesi '{0}' olarak bildirilemez.
zh_hans: 接口中的枚举不能声明为“{0}”。
zh_hant: 介面中的列舉不可宣告為 '{0}'。

# ERR_BadInterfaceClassSpecifier1
source: Class in an interface cannot be declared '{0}'.
cs: Pro třídu v rozhraní nejde použít deklaraci {0}.
de: Eine Klasse in einer Schnittstelle kann nicht als "{0}" deklariert werden.
es: Una clase de una interfaz no se puede declarar como '{0}'.
fr: Une classe dans une interface ne peut pas être déclarée '{0}'.
it: La classe in un'interfaccia non può essere dichiarata come '{0}'.
ja: インターフェイス内のクラスを '{0}' と宣言することはできません。
ko: 인터페이스의 클래스는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować klasy w interfejsie jako „{0}”.
pt_br: Classe em uma interface não pode ser declarada "{0}".
ru: Класс в интерфейсе не может объявляться как "{0}".
tr: Arabirim içindeki sınıf '{0}' olarak bildirilemez.
zh_hans: 接口中的类不能声明为“{0}”。
zh_hant: 介面中的類別不可宣告為 '{0}'。
