Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_MismatchedXmlEndTag
source: End tag </{0}{1}{2}> expected.
cs: Očekávala se koncová značka </{0}{1}{2}>.
de: Endkennung </{0}{1}{2}> erwartet.
es: Se esperaba la etiqueta de cierre </{0}{1}{2}>.
fr: Fin de balise </{0}{1}{2}> attendue.
it: È previsto il tag di fine </{0}{1}{2}>.
ja: 終了タグ </{0}{1}{2}> が必要です。
ko: </{0}{1}{2}> 끝 태그가 필요합니다.
pl: Oczekiwano tagu końcowego </{0}{1}{2}>.
pt_br: Marca de fim </{0}{1}{2}> esperada.
ru: Требуется конечный тег </{0}{1}{2}>.
tr: Bitiş etiketi </{0}{1}{2}> bekleniyor.
zh_hans: 应为结束标记 </{0}{1}{2}>。
zh_hant: 必須是結束標記 </{0}{1}{2}>。

# ERR_MissingXmlEndTag
source: Element is missing an end tag.
cs: V prvku chybí koncová značka.
de: Das Element hat keine Endkennung.
es: Falta una etiqueta de cierre en el elemento.
fr: Balise de fin manquante dans l'élément.
it: Manca il tag di fine nell'elemento.
ja: 要素に終了タグがありません。
ko: 요소에 끝 태그가 없습니다.
pl: Brak tagu końcowego w elemencie.
pt_br: Falta uma marca de fim no elemento.
ru: В элементе отсутствует конечный тег.
tr: Öğede bitiş etiketi eksik.
zh_hans: 元素缺少结束标记。
zh_hant: 項目中遺漏結束標記。

# ERR_ReservedXmlPrefix
source: XML namespace prefix '{0}' is reserved for use by XML and the namespace URI cannot be changed.
cs: Předpona oboru názvů XML {0} je v kódu XML rezervovaná a identifikátor URI oboru názvů nejde změnit.
de: Das XML-Namespacepräfix "{0}" ist für die Verwendung durch XML reserviert, und der Namespace-URI kann nicht geändert werden.
es: El prefijo '{0}' del espacio de nombres XML está reservado para uso de XML y el URI del espacio de nombres no se puede cambiar.
fr: Le préfixe de l'espace de noms XML '{0}' est réservé pour une utilisation par XML et l'URI de l'espace de noms ne peut pas être changé.
it: L'uso del prefisso dello spazio dei nomi XML '{0}' è riservato a XML. Non è possibile modificare l'URI dello spazio dei nomi.
ja: XML 名前空間プレフィックス '{0}' は XML による使用のために予約されているので、名前空間 URI を変更できません。
ko: XML 네임스페이스 접두사('{0}')는 XML에서 사용하도록 예약되었으므로 네임스페이스 URI를 변경할 수 없습니다.
pl: Prefiks przestrzeni nazw XML „{0}” jest zastrzeżony do użytku przez kod XML i nie można zmienić identyfikatora URI przestrzeni nazw.
pt_br: O prefixo do namespace XML "{0}" é reservado para uso por XML e o namespace URI não pode ser alterado.
ru: Префикс пространства имен XML "{0}" зарезервирован для использования XML, и пространство имен URI не может быть изменено.
tr: '{0}' XML ad alanı ön eki XML'nin kullanımına ayrılmıştır ve ad alanı URI'si değiştirilemez.
zh_hans: XML 命名空间前缀“{0}”已保留供 XML 使用，并且命名空间 URI 不能更改。
zh_hant: XML 命名空間前置詞 '{0}' 已保留供 XML 使用，且不可變更命名空間 URI。

# ERR_MissingVersionInXmlDecl
source: Required attribute 'version' missing from XML declaration.
cs: V deklaraci XML chybí vyžadovaný atribut version.
de: In der XML-Deklaration fehlt das erforderliche version-Attribut.
es: Falta el atributo 'version' necesario en una declaración XML.
fr: Attribut 'version' requis absent de la déclaration XML.
it: Manca l'attributo obbligatorio 'version' nella dichiarazione XML.
ja: 必要な属性 'version' が XML 宣言にありません。
ko: 필요한 'version' 특성이 XML 선언에 없습니다.
pl: Brak wymaganego atrybutu „version” w deklaracji XML.
pt_br: Falta o atributo 'version' obrigatório da declaração XML.
ru: В объявлении XML отсутствует необходимый атрибут "version".
tr: Gerekli 'version' özniteliği XML bildiriminde eksik.
zh_hans: XML 声明中缺少必需的特性 "version"。
zh_hant: XML 宣告遺漏必要的屬性 'version'。

# ERR_IllegalAttributeInXmlDecl
source: XML declaration does not allow attribute '{0}{1}{2}'.
cs: V deklaraci XML nelze použít atribut {0}{1}{2}.
de: Die XML-Deklaration lässt das Attribut "{0}{1}{2}" nicht zu.
es: Una declaración XML no permite el atributo '{0}{1}{2}'.
fr: La déclaration XML n'autorise pas l'attribut '{0}{1}{2}'.
it: La dichiarazione XML non consente l'attributo '{0}{1}{2}'.
ja: XML 宣言では、属性 '{0}{1}{2}' を使用できません。
ko: XML 선언에는 특성 '{0}{1}{2}'을(를) 사용할 수 없습니다.
pl: Deklaracja XML nie zezwala na użycie atrybutu „{0}{1}{2}”.
pt_br: Declaração XML não permite atributo "{0}{1}{2}".
ru: В объявлении XML не может быть атрибута "{0}{1}{2}".
tr: XML bildirimi '{0}{1}{2}' özniteliğine izin vermiyor
zh_hans: XML 声明不允许属性“{0}{1}{2}”。
zh_hant: XML 宣告不可使用屬性 '{0}{1}{2}'。

# ERR_QuotedEmbeddedExpression
source: Embedded expression cannot appear inside a quoted attribute value. Try removing quotes.
cs: Vložený výraz se nesmí objevit uvnitř hodnoty atributu uvedené v uvozovkách. Zkuste odebrat uvozovky.
de: In einem Attributwert in Anführungszeichen dürfen keine eingebetteten Ausdrücke enthalten sein. Entfernen Sie die Anführungszeichen.
es: Una expresión incrustada no puede aparecer dentro de un valor de atributo entrecomillado. Pruebe a quitar las comillas.
fr: Une expression incorporée ne peut pas s'afficher à l'intérieur d'une valeur d'attribut entre guillemets. Supprimez les guillemets.
it: L'espressione incorporata non può essere specificata all'interno di un valore di attributo tra virgolette. Provare a rimuovere le virgolette.
ja: 引用符で囲まれた属性値内に埋め込み式を指定することはできません。引用符を削除してください。
ko: 포함 식은 따옴표로 묶인 특성 값 내에 표시할 수 없습니다. 따옴표를 제거해 보세요.
pl: Wyrażenie osadzone nie może występować wewnątrz wartości atrybutu umieszczonej w cudzysłowie. Spróbuj usunąć znaki cudzysłowu.
pt_br: A expressão incorporada não pode aparecer em um valor de atributo entre aspas. Tente remover as aspas.
ru: Вложенное выражение не может появляться внутри значения атрибута в кавычках. Попробуйте убрать кавычки.
tr: Gömülü ifade tırnak içine alınmış bir öznitelik değerinin içinde yer alamaz. Tırnak işaretlerini kaldırmayı deneyin.
zh_hans: 带引号的特性值内不能出现嵌入式表达式。请尝试移除引号。
zh_hant: 有引號的屬性值中不能出現內嵌運算式。請移除引號。

# ERR_VersionMustBeFirstInXmlDecl
source: XML attribute 'version' must be the first attribute in XML declaration.
cs: Atribut XML version musí být prvním atributem v deklaraci XML.
de: Das XML-Attribut "version" muss das erste Attribut in der XML-Deklaration sein.
es: El atributo XML 'version' debe ser el primer atributo en una declaración XML.
fr: L'attribut XML 'version' doit être le premier attribut dans une déclaration XML.
it: L'attributo XML 'version' deve essere il primo attributo nella dichiarazione XML.
ja: XML 属性 'version' は XML 宣言の最初の属性でなければなりません。
ko: XML 특성 'version'은 XML 선언에서 첫 번째 특성이어야 합니다.
pl: Atrybut XML „version” musi być pierwszym atrybutem w deklaracji XML.
pt_br: O atributo XML 'version' deve ser o primeiro atributo na declaração XML.
ru: Атрибут XML "version" должен быть первым атрибутом в объявлении XML.
tr: Version' XML özniteliği XML bildirimindeki ilk öznitelik olmalıdır.
zh_hans: XML 特性 "version" 必须是 XML 声明中的第一个特性。
zh_hant: XML 屬性 'version' 必須是 XML 宣告中的第一個屬性。

# ERR_AttributeOrder
source: XML attribute '{0}' must appear before XML attribute '{1}'.
cs: Atribut XML {0} musí být před atributem XML {1}.
de: Das XML-Attribut "{0}" muss vor dem XML-Attribut "{1}" stehen.
es: El atributo XML '{0}' debe aparecer antes del atributo XML '{1}'.
fr: L'attribut XML '{0}' doit apparaître avant l'attribut XML '{1}'.
it: L'attributo XML '{0}' deve essere specificato prima dell'attributo XML '{1}'.
ja: XML 属性 '{0}' は XML 属性 '{1}' の前に指定する必要があります。
ko: XML 특성 '{0}'은(는) XML 특성 '{1}' 앞에 와야 합니다.
pl: Atrybut XML „{0}” musi występować przed atrybutem XML „{1}”.
pt_br: Atributo XML "{0}" deve aparecer antes do atributo XML "{1}".
ru: Атрибут XML "{0}" должен предшествовать атрибуту XML "{1}".
tr: '{0}' XML özniteliği, '{1}' XML özniteliğinden önce gelmelidir.
zh_hans: XML 特性“{0}”必须出现在 XML 特性“{1}”之前。
zh_hant: XML 屬性 '{0}' 必須出現在 XML 屬性 '{1}' 之前。

# ERR_ExpectedXmlEndEmbedded
source: Expected closing '%>' for embedded expression.
cs: Očekávalo se ukončení vloženého výrazu znaky %>.
de: "%>" als Abschluss des eingebetteten Ausdrucks erwartet.
es: Se esperaba el cierre '%>' para la expresión incrustada.
fr: %>' fermant attendu pour une expression incorporée.
it: È previsto il segno '%>' di chiusura per un'espressione incorporata.
ja: 埋め込み式の終わりに '%>' が必要です。
ko: 포함 식에 닫는 '%>'가 필요합니다.
pl: Oczekiwano zamykających znaków „%>” dla wyrażenia osadzonego.
pt_br: %>' de fechamento esperado para expressão incorporada.
ru: Для вложенного выражения требуются закрывающие символы "%>".
tr: Gömülü ifade için sağ '%>' bekleniyor.
zh_hans: 应为嵌入表达式的结束标记“%>”。
zh_hant: 內嵌運算式必須以 '%>' 結尾

# ERR_ExpectedXmlEndPI
source: Expected closing '?>' for XML processor instruction.
cs: Očekávalo se ukončení instrukce procesoru XML znaky ?>.
de: "?>" als Abschluss der XML-Verarbeitungsanweisung erwartet.
es: Se esperaba el cierre '?>' para la instrucción del procesador XML.
fr: ?>' fermant attendu pour une instruction de processeur XML.
it: È previsto il segno '?>' di chiusura per un'istruzione del processore XML.
ja: XML プロセッサ命令の終わりに '?>' が必要です。
ko: XML 프로세서 명령에 닫는 '?>'가 필요합니다.
pl: Oczekiwano zamykających znaków „?>” dla instrukcji procesora XML.
pt_br: ?>' de fechamento esperado para instrução do processador XML.
ru: В инструкции XML-процессора требуется закрывающие символы "?>".
tr: XML işlemci yönergesi için sağda '?>' bekleniyor.
zh_hans: 应为 XML 处理器指令的结束标记“?>”。
zh_hant: XML 處理器指示必須以 '?>' 結尾。

# ERR_ExpectedXmlEndComment
source: Expected closing '-->' for XML comment.
cs: Očekávalo se ukončení komentáře XML znaky -->.
de: "-->" als Abschluss des XML-Kommentars erwartet.
es: Se esperaba el cierre '-->' para el comentario XML.
fr: -->' fermant attendu pour un commentaire XML.
it: È previsto il segno '-->' di chiusura per un commento XML.
ja: XML コメントの終わりに '-->' が必要です。
ko: XML 주석에 닫는 '-->'가 필요합니다.
pl: Oczekiwano zamykających znaków „-->” dla komentarza XML.
pt_br: -->' de fechamento esperado no comentário XML.
ru: В комментарии XML требуются закрывающие символы "-->".
tr: XML açıklaması için sağda '-->' bekleniyor.
zh_hans: 应为 XML 注释的结束标记“-->”。
zh_hant: XML 註解必須以 '-->' 結尾。

# ERR_ExpectedXmlEndCData
source: Expected closing ']]>' for XML CDATA section.
cs: Očekávalo se ukončení oddílu CDATA kódu XML znaky ]]>.
de: "]]>" als Abschluss des XML-CDATA-Abschnitts erwartet.
es: Se esperaba el cierre ']]>' para la sección XML CDATA.
fr: ]]>' fermant attendu pour une section CDATA XML.
it: È previsto il segno ']]>' di chiusura per una sezione XML CDATA.
ja: XML CDATA セクションの終わりに ']]>' が必要です。
ko: XML CDATA 섹션에 닫는 ']]>'가 필요합니다.
pl: Oczekiwano zamykających znaków „]]>” dla sekcji CDATA XML.
pt_br: ']]>' de fechamento esperado para seção XML CDATA.
ru: Требуются закрывающие символы "]]>" для XML-секции CDATA.
tr: XML CDATA bölümü için sağda ']]>' bekleniyor.
zh_hans: 应为 XML CDATA 部分的结束标记“]]>”。
zh_hant: XML CDATA 區段必須以 ']]>' 結尾。

# ERR_ExpectedSQuote
source: Expected matching closing single quote for XML attribute value.
cs: Očekával se párový koncový apostrof hodnoty atributu XML.
de: Schließendes einfaches Anführungszeichen für XML-Attributwert erwartet.
es: Se esperaba la comilla simple de cierre para el valor de atributo XML.
fr: Guillemet simple fermant correspondant attendu pour une valeur d'attribut XML.
it: È previsto l'apostrofo di chiusura corrispondente per un valore di attributo XML.
ja: XML 属性値の終わりに、対応する単一引用符が必要です。
ko: XML 특성 값에 짝이 되는 닫는 작은따옴표가 필요합니다.
pl: Oczekiwano zgodnego pojedynczego cudzysłowu zamykającego dla wartości atrybutu XML.
pt_br: Aspas simples de fechamento esperada no valor de atributo do XML.
ru: Для значения атрибута XML требуется закрывающая одинарная кавычка.
tr: XML öznitelik değeri için eşleşen kapatma tek tırnak işareti bekleniyor.
zh_hans: XML 特性值应有匹配的右单引号。
zh_hant: XML 屬性值的結束單引號必須相符。

# ERR_ExpectedQuote
source: Expected matching closing double quote for XML attribute value.
cs: Očekávaly se párové koncové uvozovky hodnoty atributu XML.
de: Schließendes doppeltes Anführungszeichen für XML-Attributwert erwartet.
es: Se esperaban las comillas dobles de cierre para el valor de atributo XML.
fr: Guillemet double fermant attendu pour une valeur d'attribut XML.
it: Sono previste virgolette di chiusura corrispondenti per un valore di attributo XML.
ja: XML 属性値の終わりに、対応する二重引用符が必要です。
ko: XML 특성 값에 짝이 되는 닫는 큰따옴표가 필요합니다.
pl: Oczekiwano zgodnego podwójnego cudzysłowu zamykającego dla wartości atrybutu XML.
pt_br: Aspas duplas de fechamento esperada no valor de atributo do XML.
ru: Для значения атрибута XML требуется закрывающая двойная кавычка.
tr: XML öznitelik değeri için eşleşen kapatma çift tırnak işareti bekleniyor.
zh_hans: XML 特性值应有匹配的右双引号。
zh_hant: 必須是對應的 XML 屬性值右雙引號。

# ERR_ExpectedLT
source: Expected beginning '<' for an XML tag.
cs: Očekával se úvodní znak < značky XML.
de: "<" am Anfang einer XML-Kennung erwartet.
es: Se esperaba la apertura '<' para una etiqueta XML.
fr: <' ouvrant attendu pour une balise XML.
it: È previsto il segno '<' di apertura per un tag XML.
ja: XML タグの始めに '<' が必要です。
ko: XML 태그에 시작 '<'가 필요합니다.
pl: Oczekiwano rozpoczynającego znaku „<” dla tagu XML.
pt_br: Esperado '<' de abertura para uma marca XML.
ru: Для XML-тега требуется открывающий символ "<".
tr: XML etiketi için sol '<' bekleniyor.
zh_hans: XML 标记前应有 "<"。
zh_hant: XML 標記應以 '<' 開頭。

# ERR_StartAttributeValue
source: Expected quoted XML attribute value or embedded expression.
cs: Očekávala se hodnota atributu XML v uvozovkách nebo vložený výraz.
de: XML-Attributwert in Anführungszeichen oder eingebetteter Ausdruck erwartet.
es: Se esperaba una expresión incrustada o un valor de atributo XML entrecomillado.
fr: Valeur d'attribut XML entre guillemets ou expression incorporée attendue.
it: È prevista l'espressione incorporata o il valore di attributo XML tra virgolette.
ja: 引用符で囲まれた XML 属性値または埋め込み式が必要です。
ko: 따옴표 붙은 XML 특성 값 또는 포함 식이 필요합니다.
pl: Oczekiwano umieszczonej w cudzysłowie wartości atrybutu XML lub wyrażenia osadzonego.
pt_br: Valor do atributo XML entre aspas esperado ou expressão inserida.
ru: Требуется заключенное в кавычки значение атрибута XML или вложенное выражение.
tr: Tırnak içinde XML özniteliği değeri veya gömülü ifade bekleniyor.
zh_hans: 应为带引号的 XML 特性值或嵌入式表达式。
zh_hant: 必須為引號 XML 屬性值或內嵌運算式。

# ERR_ExpectedDiv
source: Expected '/' for XML end tag.
cs: Očekával se znak / koncové značky XML.
de: Für eine XML-Endkennung wurde "/" erwartet.
es: Se esperaba '/' para la etiqueta de cierre XML.
fr: /' attendu pour la balise de fin XML.
it: È previsto '/' per un tag di fine XML.
ja: XML 終了タグに '/' が必要です。
ko: XML 끝 태그에 '/'가 필요합니다.
pl: Oczekiwano znaku „/” dla tagu końcowego XML.
pt_br: Esperado '/' para uma marca XML de fim.
ru: Для закрывающего XML-тега требуется символ "/".
tr: XML bitiş etiketi için '/' bekleniyor.
zh_hans: 应使用“/”作为 XML 结束标记。
zh_hant: XML 結束標記必須是 '/'。

# ERR_NoXmlAxesLateBinding
source: XML axis properties do not support late binding.
cs: Vlastnosti osy XML nepodporují pozdní vazbu.
de: Die XML-Achseneigenschaften unterstützen keine späte Bindung.
es: Las propiedades del eje XML no admiten enlace en tiempo de ejecución.
fr: Les propriétés d'axes XML ne prennent pas en charge la liaison tardive.
it: Le proprietà axis XML non supportano l'associazione tardiva.
ja: XML 軸のプロパティは遅延バインディングをサポートしていません。
ko: XML 축 속성은 런타임 바인딩을 지원하지 않습니다.
pl: Właściwości osi XML nie obsługują późnego wiązania.
pt_br: As propriedades de rótulo do XML não dão suporte à associação tardia.
ru: Свойства оси XML не поддерживают позднее связывание.
tr: XML eksen özellikleri geç bağlamayı desteklemez.
zh_hans: XML 轴属性不支持后期绑定。
zh_hant: XML 軸屬性不支援晚期繫結。

# ERR_IllegalXmlStartNameChar
source: Character '{0}' ({1}) is not allowed at the beginning of an XML name.
cs: Použití znaku {0} ({1}) na začátku názvu XML není povolené.
de: Das Zeichen "{0}" ({1}) ist am Anfang eines XML-Namens nicht zulässig.
es: No se permite el carácter '{0}' ({1}) al principio de un nombre XML.
fr: Le caractère '{0}' ({1}) n'est pas autorisé au début d'un nom XML.
it: Il carattere '{0}' ({1}) non è consentito all'inizio di un nome XML.
ja: 文字 '{0}' ({1}) は、XML 名の先頭に使用できません。
ko: XML 이름은 '{0}'({1}) 문자로 시작할 수 없습니다.
pl: Znak „{0}” ({1}) jest niedozwolony na początku nazwy XML.
pt_br: Caractere "{0}" ({1}) não é permitido no início de um nome XML.
ru: Не допускается использование символа "{0}" ({1}) в начале имени XML.
tr: XML adının başında '{0}' ({1}) karakterine izin verilmez.
zh_hans: XML 名称的开头不允许出现字符“{0}”({1})。
zh_hant: XML 名稱的開頭不可使用字元 '{0}' ({1})。

# ERR_IllegalXmlNameChar
source: Character '{0}' ({1}) is not allowed in an XML name.
cs: Znak {0} ({1}) není povolený v názvu XML.
de: Das Zeichen "{0}" ({1}) ist in einem XLM-Namen nicht zulässig.
es: No se permite el carácter '{0}' ({1}) en un nombre XML.
fr: Le caractère '{0}' ({1}) n'est pas autorisé dans un nom XML.
it: Il carattere '{0}' ({1}) non è consentito in un nome XML.
ja: 文字 '{0}' ({1}) は、XML 名では使用できません。
ko: XML 이름에는 '{0}'({1}) 문자를 사용할 수 없습니다.
pl: Znak „{0}” ({1}) jest niedozwolony w nazwie XML.
pt_br: Caractere "{0}" ({1}) não é permitido em um nome XML.
ru: Не допускается использование символа "{0}" ({1}) в имени XML.
tr: XML adında '{0}' ({1}) karakterine izin verilmez.
zh_hans: XML 名称中允许字符“{0}”({1})。
zh_hant: XML 名稱中不可使用字元 '{0}' ({1})。

# ERR_IllegalXmlCommentChar
source: Character sequence '--' is not allowed in an XML comment.
cs: Použití posloupnosti znaků -- v komentáři XML není povolené.
de: Die Zeichenfolge "--" ist in einem XML-Kommentar nicht zulässig.
es: No se permite la secuencia de caracteres '--' en un comentario XML.
fr: La séquence de caractères '--' n'est pas autorisée dans un commentaire XML.
it: La sequenza di caratteri '--' non è consentita in un commento XML.
ja: 文字のシーケンス '--' は、XML コメントでは使用できません。
ko: XML 주석에는 문자 시퀀스 '--'을 사용할 수 없습니다.
pl: Sekwencja znaków „--” jest niedozwolona w komentarzu XML.
pt_br: A sequência de caracteres '--' não é permitida em um comentário XML.
ru: Последовательность символов "--" недопустима в XML-комментарии.
tr: XML açıklamasında '--' karakter sırasına izin verilmez.
zh_hans: XML 注释中不允许出现字符序列“--”。
zh_hant: XML 註解中不可有字元順序 '--'。

# ERR_EmbeddedExpression
source: An embedded expression cannot be used here.
cs: Na tomto místě nejde použít vložený výraz.
de: An dieser Stelle darf kein eingebetteter Ausdruck verwendet werden.
es: Aquí no se puede usar una expresión incrustada.
fr: Une expression incorporée ne peut pas être utilisée ici.
it: In questo punto non è possibile usare un'espressione incorporata.
ja: 埋め込み式はここでは使用できません。
ko: 포함 식은 여기에 사용할 수 없습니다.
pl: Tutaj nie można użyć wyrażenia osadzonego.
pt_br: Não foi possível utilizar uma expressão incorporada aqui.
ru: Вложенное выражение не может быть здесь использовано.
tr: Burada gömülü bir ifade kullanılamaz.
zh_hans: 不能在此处使用嵌入式表达式。
zh_hant: 內嵌運算式不能用在這裡。

# ERR_ExpectedXmlWhiteSpace
source: Missing required white space.
cs: Chybí vyžadované mezerové znaky.
de: Erforderliche Leerstellen fehlen.
es: Falta un espacio en blanco requerido.
fr: Espace requis manquant.
it: Manca lo spazio vuoto obbligatorio.
ja: 必要なスペース文字がありません。
ko: 필요한 공백이 없습니다.
pl: Brak wymaganych białych znaków.
pt_br: Espaço em branco obrigatório ausente.
ru: Отсутствует обязательный пробел.
tr: Gereken boşluk eksik.
zh_hans: 缺少必需的空白。
zh_hant: 遺漏必要的空白字元。

# ERR_IllegalProcessingInstructionName
source: XML processing instruction name '{0}' is not valid.
cs: Název instrukce zpracování XML {0} je neplatný.
de: Der Name "{0}" der XML-Verarbeitungsanweisung ist nicht gültig.
es: El nombre de la instrucción de procesamiento XML '{0}' no es válido.
fr: Le nom de l'instruction de traitement XML '{0}' n'est pas valide.
it: Il nome di istruzione di elaborazione XML '{0}' non è valido.
ja: XML 処理命令の名前 '{0}' が有効ではありません。
ko: XML 처리 명령 이름 '{0}'이(가) 잘못되었습니다.
pl: Nazwa „{0}” instrukcji przetwarzającej kod XML jest nieprawidłowa.
pt_br: Nome de instrução de processamento XML "{0}" não é válido.
ru: Недопустимое имя инструкции по обработке XML "{0}".
tr: '{0}' XML işleme yönergesi adı geçerli değil.
zh_hans: XML 处理指令名称“{0}”无效。
zh_hant: XML 處理指示名稱 '{0}' 無效。

# ERR_DTDNotSupported
source: XML DTDs are not supported.
cs: Soubory DTD kódu XML nejsou podporované.
de: XML-DTDs werden nicht unterstützt.
es: No se admiten DTD XML.
fr: Les DTD XML ne sont pas prises en charge.
it: I DTD XML non sono supportati.
ja: XML DTD はサポートされていません。
ko: XML DTD는 지원되지 않습니다.
pl: Definicje DTD XML nie są obsługiwane.
pt_br: Não há suporte para XML DTDs.
ru: Шаблоны DTD XML не поддерживаются.
tr: XML DTD'ler desteklenmiyor.
zh_hans: 不支持 XML DTD。
zh_hant: 不支援 XML DTD。

# ERR_IllegalXmlWhiteSpace
source: White space cannot appear here.
cs: Na tomto místě se nesmí objevit mezerové znaky.
de: An dieser Stelle darf keine Leerstelle stehen.
es: Aquí no puede aparecer un espacio en blanco.
fr: L'espace ne peut pas s'afficher ici.
it: In questo punto non è possibile usare spazi vuoti.
ja: スペース文字はここでは使用できません。
ko: 공백은 여기에 표시할 수 없습니다.
pl: Tutaj nie mogą występować białe znaki.
pt_br: O espaço em branco não pode aparecer aqui.
ru: Здесь не может находиться пробел.
tr: Burada boşluk olamaz.
zh_hans: 此处不能使用空白。
zh_hant: 空白字元不可出現在這裡。

# ERR_ExpectedSColon
source: Expected closing ';' for XML entity.
cs: Očekával se koncový znak ; entity XML.
de: ";" als Abschluss der XML-Entität erwartet.
es: Se esperaba el cierre ';' para la entidad XML.
fr: ;' fermant attendu pour une entité XML.
it: È previsto il punto e virgola (';') di chiusura per un'entità XML.
ja: XML エンティティの終わりに ';' が必要です。
ko: XML 엔터티에 닫는 ';'이 필요합니다.
pl: Oczekiwano zamykającego znaku „;” dla jednostki XML.
pt_br: Esperado ';' de fechamento para entidade XML.
ru: Для XML-сущности требуется закрывающий знак ";".
tr: XML varlığı için sağda ';' bekleniyor.
zh_hans: 应为 XML 实体的结束标记“;”。
zh_hant: XML 實體必須以 ';' 結尾

# ERR_ExpectedXmlBeginEmbedded
source: Expected '%=' at start of an embedded expression.
cs: Na začátku vloženého výrazu se očekávaly znaky %=.
de: %= wird am Anfang eines eingebetteten Ausdrucks erwartet.
es: Se esperaba '%=' al principio de una expresión incrustada.
fr: %=' attendu au début d'une expression incorporée.
it: È previsto '%=' all'inizio di un'espressione incorporata.
ja: 埋め込み式の始めに '%=' が必要です。
ko: 포함 식의 시작 부분에 '%='가 필요합니다.
pl: Oczekiwano znaków „%=” na początku wyrażenia osadzonego.
pt_br: %=' esperado no início de uma expressão incorporada.
ru: В начале вложенного выражения требуется "%=".
tr: Gömülü ifadenin başlangıcında '%=' bekleniyor.
zh_hans: 嵌入表达式的开头应为“%=”。
zh_hant: 內嵌運算式的開頭必須是 '%='。

# ERR_XmlEntityReference
source: XML entity references are not supported.
cs: Odkazy na entity XML nejsou podporované.
de: XML-Entitätsverweise werden nicht unterstützt.
es: No se admiten referencias de entidad XML.
fr: Les références d'entité XML ne sont pas prises en charge.
it: I riferimenti a entità XML non sono supportati.
ja: XML エンティティの参照はサポートされていません。
ko: XML 엔터티 참조가 지원되지 않습니다.
pl: Odwołania do jednostek XML nie są obsługiwane.
pt_br: Não há suporte para referências de entidade XML.
ru: Ссылки на специальный символ XML не поддерживаются.
tr: XML varlık başvuruları desteklenmiyor.
zh_hans: 不支持 XML 实体引用。
zh_hant: 不支援 XML 實體參考。

# ERR_InvalidAttributeValue1
source: Attribute value is not valid; expecting '{0}'.
cs: Hodnota atributu není platná; očekávalo se: {0}.
de: Ungültiger Attributwert, "{0}" erwartet.
es: El valor del atributo no es válido; se espera '{0}'.
fr: Valeur d'attribut non valide ; '{0}' attendu.
it: Il valore di attributo non è valido. È previsto '{0}'.
ja: 属性値が有効ではありません。'{0}' である必要があります。
ko: 특성 값이 잘못되었습니다. '{0}'이(가) 필요합니다.
pl: Wartość atrybutu jest nieprawidłowa, oczekiwano „{0}”.
pt_br: O valor do atributo não é válido; esperando "{0}".
ru: Недопустимое значение атрибута; ожидается значение "{0}".
tr: Öznitelik değeri geçerli değil; '{0}' bekleniyor.
zh_hans: 属性值无效；应为“{0}”。
zh_hant: 屬性值無效，必須是 '{0}'。
