Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_IntegralToCharTypeMismatch1
source: '{0}' values cannot be converted to 'Char'. Use 'Microsoft.VisualBasic.ChrW' to interpret a numeric value as a Unicode character or first convert it to 'String' to produce a digit.
cs: 'Hodnoty typu {0} nejde převést na typ Char. Pokud chcete číselnou hodnotu interpretovat jako znak Unicode, použijte funkci Microsoft.VisualBasic.ChrW. Pokud chcete vytvořit číslici, převeďte ji nejprve na typ String.
de: '{0}-Werte können nicht in "Char" konvertiert werden. Verwenden Sie Microsoft.VisualBasic.ChrW, um einen numerischen Wert als Unicode-Zeichen zu interpretieren, oder konvertieren Sie ihn zuerst in "String", um eine Ziffer zu erstellen.
es: 'Los valores '{0}' no se pueden convertir en 'Char'. Use 'Microsoft.VisualBasic.ChrW' para interpretar un valor numérico como carácter Unicode o conviértalo primero en 'String' para producir un dígito.
fr: 'Impossible de convertir les valeurs '{0}' en 'Char'. Utilisez 'Microsoft.VisualBasic.ChrW' pour interpréter une valeur numérique en tant que caractère Unicode ou convertissez-la d'abord en 'String' pour obtenir un chiffre.
it: 'Non è possibile convertire i valori '{0}' in 'Char'. Usare 'Microsoft.VisualBasic.ChrW' per interpretare un valore numerico come carattere Unicode oppure convertirlo in 'String' per produrre una cifra.
ja: '{0}' 値を 'Char' に変換できません。数値を Unicode 文字として扱うには 'Microsoft.VisualBasic.ChrW' を使用してください。または、最初に 'String' に変換して数字の文字列を生成してください。
ko: '{0}' 값을 'Char'로 변환할 수 없습니다. 'Microsoft.VisualBasic.ChrW'를 사용하여 숫자 값을 유니코드 문자로 해석하거나 먼저 숫자 값을 'String'으로 변환하여 숫자를 산출하세요.
pl: 'Nie można konwertować wartości „{0}” na elementy „Char”. Użyj elementu „Microsoft.VisualBasic.ChrW”, aby zinterpretować wartość numeryczną jako znak Unicode, lub najpierw przekonwertuj ją na typ „String”, aby otrzymać cyfrę.
pt_br: "{0}" valores não podem ser convertidos em "Char". Use "Microsoft.VisualBasic.ChrW" para interpretar um valor numérico como um caractere Unicode ou converta-o primeiro em "String" para produzir um dígito.
ru: '"Значения "{0}" невозможно преобразовать в "Char". Используйте "Microsoft.VisualBasic.ChrW" для интерпретации числового значения как символа Юникода или сначала преобразуйте его в значение типа "String" для получения цифры.
tr: '{0}' değerleri 'Char' türüne dönüştürülemez. Sayısal değeri bir Unicode karakteri olarak yorumlamak için 'Microsoft.VisualBasic.ChrW' kullanın veya rakam oluşturmak için bunu önce 'String' türüne dönüştürün.
zh_hans: '“{0}”值不能转换为“Char”。使用“Microsoft.VisualBasic.ChrW”将数值解释为 Unicode 字符或先将其转换为“String”以产生数字。
zh_hant: '{0}' 的值無法轉換成 'Char'。請使用 'Microsoft.VisualBasic.ChrW' 將數值解譯為 Unicode 字元，或先將其轉換成 'String'，以產生數字。

# ERR_NoDirectDelegateConstruction1
source: Delegate '{0}' requires an 'AddressOf' expression or lambda expression as the only argument to its constructor.
cs: Delegát {0} vyžaduje výraz AddressOf nebo výraz lambda jako jediný argument konstruktoru.
de: Der Delegat "{0}" erfordert als einziges Argument für seinen Konstruktor einen AddressOf-Ausdruck oder einen Lambdaausdruck.
es: El delegado '{0}' requiere una expresión 'AddressOf' o una expresión lambda como único argumento de su constructor.
fr: Le délégué '{0}' requiert une expression 'AddressOf' ou une expression lambda en tant qu'unique argument de son constructeur.
it: Il delegato '{0}' richiede un'espressione 'AddressOf' o un'espressione lambda come unico argomento del relativo costruttore.
ja: デリゲート '{0}' には、コンストラクターへの唯一の引数として 'AddressOf' 式またはラムダ式が必要です。
ko: '{0}' 대리자에서는 'AddressOf' 식 또는 람다 식을 해당 생성자의 유일한 인수로 지정해야 합니다.
pl: Delegat „{0}” wymaga wyrażenia „AddressOf” lub wyrażenia lambda jako jedynego argumentu dla jego konstruktora.
pt_br: Delegado "{0}" requer uma expressão "AddressOf" ou expressão lambda como o único argumento para seu construtor.
ru: Делегат "{0}" требует выражение "AddressOf" или лямбда-выражение в качестве единственного аргумента конструктора.
tr: '{0}' temsilcisi oluşturucusuna bağımsız değişken olarak yalnızca tek bir 'AddressOf' ifadesi veya lambda ifadesi gerektirir.
zh_hans: 委托“{0}”需要使用一个“AddressOf”表达式或 lambda 表达式作为其构造函数的唯一参数。
zh_hant: 委派 '{0}' 必須使用 'AddressOf' 運算式或 Lambda 運算式，做為其建構函式唯一的引數。

# ERR_MethodMustBeFirstStatementOnLine
source: Method declaration statements must be the first statement on a logical line.
cs: Příkazy deklarace metod musí být prvním příkazem logického řádku.
de: Eine Methodendeklarationsanweisung muss die erste Anweisung in einer logischen Zeile sein.
es: Las instrucciones de declaración de método deben ser la primera instrucción en una línea lógica.
fr: Une instruction de déclaration de méthode doit être la première instruction d'une ligne logique.
it: Le istruzioni per la dichiarazione di un metodo devono essere la prima istruzione in una riga logica.
ja: メソッド宣言ステートメントは、論理行の最初のステートメントでなければなりません。
ko: 메서드 선언문은 논리 줄의 첫 번째 문이어야 합니다.
pl: Instrukcja deklaracji metody musi być pierwszą instrukcją w wierszu logicznym.
pt_br: Instruções de declaração de método devem ser a primeira instrução em uma linha lógica.
ru: Операторы объявления методов должны указываться первыми в логической строке.
tr: Yöntem bildirim deyimleri mantıksal bir satırdaki ilk deyim olmalıdır.
zh_hans: 方法声明语句必须是逻辑行上的第一条语句。
zh_hant: 方法宣告陳述式必須是邏輯程式敘述行中的第一個陳述式。

# ERR_AttrAssignmentNotFieldOrProp1
source: '{0}' cannot be named as a parameter in an attribute specifier because it is not a field or property.
cs: 'Název {0} nejde uvést jako specifikátor atributu, protože se nejedná o pole ani o vlastnost.
de: '"{0}" kann nicht als Parameter in einem Attributspezifizierer verwendet werden, da es kein Feld bzw. keine Eigenschaft ist.
es: '{0}' no se puede usar como parámetro en un especificador de atributo porque no es un campo ni una propiedad.
fr: '{0}' ne peut pas être nommé en tant que paramètre dans un spécificateur d'attribut, car ce n'est ni un champ ni une propriété.
it: 'Non è possibile denominare '{0}' come parametro in un identificatore di attributi perché non è un campo o una proprietà.
ja: '{0}' はフィールドまたはプロパティでないため、属性指定子の中でパラメーターとして名前を指定することはできません。
ko: '{0}'은(는) 필드 또는 속성이 아니므로 특성 지정자에서 매개 변수로 명명할 수 없습니다.
pl: 'Nie można użyć elementu „{0}” jako parametru w specyfikatorze atrybutu, ponieważ nie jest to pole ani właściwość.
pt_br: "{0}" não pode ser nomeado como um parâmetro em um especificador de atributo porque não é um campo ou propriedade.
ru: "{0}" нельзя указать как параметр в описателе атрибута, поскольку он не является полем или свойством.
tr: '{0}' bir alan veya özellik olmadığından, öznitelik tanımlayıcıda bir parametre olarak adlandırılamaz.
zh_hans: '“{0}”不是字段或属性(Property)，因此不能命名为属性(Attribute)说明符中的参数。
zh_hant: '{0}' 不是欄位或屬性 (Property)，所以無法命名為屬性 (Attribute) 規範中的參數。

# ERR_StrictDisallowsObjectComparison1
source: Option Strict On disallows operands of type Object for operator '{0}'. Use the 'Is' operator to test for object identity.
cs: Direktiva Option Strict On zakazuje operandy typu Object pro operátor {0}. K testování identity objektů použijte operátor Is.
de: "Option Strict On" lässt Operanden des Typs "Object" für den {0}-Operator nicht zu. Verwenden Sie den Is-Operator, wenn Sie die Objektidentität testen möchten.
es: Option Strict On no permite operandos de tipo Object para el operador '{0}'. Use el operador 'Is' para probar la identidad del objeto.
fr: Option Strict On n'autorise pas les opérandes de type Object pour l'opérateur '{0}'. Utilisez l'opérateur 'Is' pour tester l'identité de l'objet.
it: Option Strict On non ammette operandi di tipo Object per l'operatore '{0}'. Usare l'operatore 'Is' per verificare l'identità dell'oggetto.
ja: Option Strict On が指定されている場合、演算子 '{0}' に対して Object 型のオペランドを使うことはできません。オブジェクト ID をテストするには、'Is' 演算子を使用してください。
ko: Option Strict On에서는 '{0}' 연산자에 대해 Object 형식의 피연산자를 사용할 수 없습니다. 개체 ID를 테스트하려면 'Is' 연산자를 사용하세요.
pl: Ustawienie „Option Strict On” uniemożliwia stosowanie argumentów operacji typu Object dla operatora „{0}”. Użyj operatora „Is” w celu zbadania tożsamości obiektu.
pt_br: Opção Strict On não permite operandos do tipo Object para o operador "{0}". Use o operador "Is" para testar a identidade do objeto.
ru: Option Strict On не разрешает операнды типа Object для оператора "{0}". Используйте оператор "Is" для проверки идентификатора объекта.
tr: Option Strict On, '{0}' işleci için Object türünde işlenene izin vermiyor. Nesne kimliğini sınamak için 'Is' işlecini kullanın.
zh_hans: Option Strict On 不允许将类型 Object 的操作数用于运算符“{0}”。请使用“Is”运算符测试对象标识。
zh_hant: Option Strict 為 On 時，不可為運算子 '{0}' 使用 Object 類型的運算元。請使用 'Is' 運算子來測試物件識別。

# ERR_NoConstituentArraySizes
source: Bounds can be specified only for the top-level array when initializing an array of arrays.
cs: Při inicializaci pole polí jde určit meze jenom pro pole nejvyšší úrovně.
de: Grenzen können nur für das Array auf der höchsten Ebene angegeben werden, wenn ein Array für ein Array initialisiert wird.
es: Los límites solo se pueden especificar para la matriz de nivel superior al inicializar una matriz de matrices.
fr: Les limites ne peuvent être spécifiées que pour le tableau de premier niveau lors de l'initialisation d'un tableau de tableaux.
it: Durante l'inizializzazione di una matrice di matrici i limiti possono essere specificati solo per la matrice di primo livello.
ja: 配列の配列を初期化する場合、トップレベル配列に対してのみ境界を指定できます。
ko: 배열의 배열을 초기화하는 동안에는 최상위 배열에 대해서만 범위를 지정할 수 있습니다.
pl: Granice można określić tylko dla tablicy najwyższego poziomu podczas inicjowania tablicy tablic.
pt_br: Limites podem ser especificados somente para matrizes de alto nível durante a inicialização de uma matriz de matrizes.
ru: При инициализации массива массивов границы могут задаваться только для массива верхнего уровня.
tr: Dizilerden oluşan bir dizi başlatılırken yalnızca en üst düzey dizinin sınırları belirtilebilir.
zh_hans: 初始化数组的数组时，只能指定顶级数组的界限。
zh_hant: 在初始化陣列的陣列時，只可以指定最上層陣列的界限。

# ERR_FileAttributeNotAssemblyOrModule
source: 'Assembly' or 'Module' expected.
cs: 'Očekávalo se klíčové slovo Assembly nebo Module.
de: '"Assembly" oder "Module" erwartet.
es: 'Se esperaba 'Assembly' o 'Module'.
fr: 'Assembly' ou 'Module' attendu.
it: 'È previsto 'Assembly' o 'Module'.
ja: 'Assembly' または 'Module' が必要です。
ko: 'Assembly' 또는 'Module'이 필요합니다.
pl: 'Oczekiwano instrukcji Assembly lub Module.
pt_br: 'Assembly' ou 'Module' esperado.
ru: 'Требуется "Assembly" или "Module".
tr: 'Assembly' veya 'Module' bekleniyor.
zh_hans: '应为“Assembly”或“Module”。
zh_hant: '必須是 'Assembly' 或 'Module'。

# ERR_FunctionResultCannotBeIndexed1
source: '{0}' has no parameters and its return type cannot be indexed.
cs: 'Procedura {0} nemá žádné parametry a její typ vrácené hodnoty nejde indexovat.
de: '"{0}" hat keine Parameter, und der Rückgabetyp kann nicht indiziert werden.
es: '{0}' no tiene parámetros y su tipo de valor devuelto no se puede indizar.
fr: '{0}' n'a aucun paramètre et son type de retour ne peut pas être indexé.
it: '{0}' non ha parametri e il tipo restituito non può essere indicizzato.
ja: '{0}' にはパラメーターがないため、戻り値の型をインデックス化できません。
ko: '{0}'에는 매개 변수가 없으며 반환 형식을 인덱싱할 수 없습니다.
pl: 'Element „{0}” nie ma parametrów, a jego typ zwracany nie może być indeksowany.
pt_br: "{0}" não tem parâmetros e seu tipo de retorno não pode ser indexado.
ru: "{0}" не имеет параметров, поэтому невозможно проиндексировать его возвращаемый тип.
tr: '{0}' öğesinin hiç parametresi yok ve dönüş türünün dizini oluşturulamaz.
zh_hans: '“{0}”没有任何参数，并且无法对它的返回类型进行索引。
zh_hant: '{0}' 沒有參數，且無法對其傳回類型編製索引。

# ERR_ArgumentSyntax
source: Comma, ')', or a valid expression continuation expected.
cs: Očekávala se čárka, znak ) nebo platné pokračování výrazu.
de: Komma, ")" oder eine gültige Ausdrucksfortsetzung erwartet.
es: Se esperaba una coma, ')' o la continuación de una expresión válida.
fr: Virgule, ')' ou continuation d'expression valide attendue.
it: È prevista la virgola, il segno ')' o una continuazione di espressione valida.
ja: コンマ、')'、または有効な式の継続文字が必要です。
ko: 쉼표, ')' 또는 이어지는 올바른 식이 필요합니다.
pl: Oczekiwano przecinka, znaku ) lub prawidłowej kontynuacji wyrażenia.
pt_br: Vírgula, ')' ou uma continuação de expressão válida esperada.
ru: Требуется запятая, ")" или допустимое продолжение выражения.
tr: Virgül, ')' veya geçerli bir ifadenin devamı bekleniyordu.
zh_hans: 应为逗号、")" 或有效的表达式继续符。
zh_hant: 必須是逗號、')' 或有效的運算式接續符號。

# ERR_ExpectedResumeOrGoto
source: 'Resume' or 'GoTo' expected.
cs: 'Očekávalo se klíčové slovo Resume nebo GoTo.
de: '"Resume" oder "GoTo" erwartet.
es: 'Se esperaba 'Resume' o 'GoTo'.
fr: 'Resume' ou 'GoTo' attendu.
it: 'È previsto 'Resume' o 'GoTo'.
ja: 'Resume' または 'GoTo' が必要です。
ko: 'Resume' 또는 'GoTo'가 필요합니다.
pl: 'Oczekiwano instrukcji Resume lub GoTo.
pt_br: 'Resume' ou 'GoTo' esperado.
ru: 'Требуется "Resume" или "GoTo".
tr: 'Resume' veya 'GoTo' bekleniyor.
zh_hans: '应为 "Resume" 或 "GoTo"。
zh_hant: '必須是 'Resume' 或 'GoTo'。

# ERR_ExpectedAssignmentOperator
source: '=' expected.
cs: 'Očekával se znak =.
de: '"=" erwartet.
es: 'Se esperaba '='.
fr: '=' attendu.
it: 'È previsto '='.
ja: '=' が必要です。
ko: '='가 필요합니다.
pl: 'Oczekiwano znaku „=”.
pt_br: '=' esperado.
ru: 'Требуется "=".
tr: '=' bekleniyor.
zh_hans: '应为 "="。
zh_hant: '必須有 '='。

# ERR_NamedArgAlsoOmitted2
source: Parameter '{0}' in '{1}' already has a matching omitted argument.
cs: Parametr {0} v metodě {1} už obsahuje odpovídající vynechaný argument.
de: Der Parameter "{0}" in "{1}"hat bereits ein entsprechendes ausgelassenes Argument.
es: El parámetro '{0}' de '{1}' ya tiene un argumento omitido correspondiente.
fr: Le paramètre '{0}' dans '{1}' a déjà un argument omis correspondant.
it: Il parametro '{0}' in '{1}' contiene già un argomento omesso corrispondente.
ja: '{1}' のパラメーター '{0}' には、一致する省略された引数が既に存在します。
ko: '{1}'의 '{0}' 매개 변수에 일치하는 생략된 인수가 이미 있습니다.
pl: Parametr „{0}” w elemencie „{1}” ma już pasujący pominięty argument.
pt_br: Parâmetro "{0}" em "{1}" já tem um argumento omitido correspondente.
ru: Параметр "{0}" в "{1}" уже имеет соответствующий пропущенный аргумент.
tr: '{1}' içindeki '{0}' parametresiyle eşleşen atlanmış bir bağımsız değişken zaten var.
zh_hans: “{1}”中的形参“{0}”已具有匹配的省略实参。
zh_hant: '{1}' 中的參數 '{0}' 已有相符的省略引數。

# ERR_CannotCallEvent1
source: '{0}' is an event, and cannot be called directly. Use a 'RaiseEvent' statement to raise an event.
cs: '{0} je událost a nejde ji vyvolat přímo. K vyvolání události použijte příkaz RaiseEvent.
de: '"{0}" ist ein Ereignis und kann nicht direkt aufgerufen werden. Verwenden Sie eine RaiseEvent-Anweisung, um ein Ereignis aufzurufen.
es: '{0}' es un evento y no se puede llamar directamente. Use una instrucción 'RaiseEvent' para generar un evento.
fr: '{0}' est un événement. Il ne peut donc pas être appelé directement. Utilisez une instruction 'RaiseEvent' pour déclencher un événement.
it: '{0}' è un evento e non può essere chiamato direttamente. Usare un'istruzione 'RaiseEvent' per generare un evento.
ja: '{0}' はイベントであるため、直接呼び出すことはできません。イベントを発生させるには 'RaiseEvent' ステートメントを使用してください。
ko: '{0}'은(는) 이벤트이므로 직접 호출할 수 없습니다. 이벤트를 발생시키려면 'RaiseEvent' 문을 사용하세요.
pl: Element „{0}” jest zdarzeniem i nie można go wywołać bezpośrednio. Użyj instrukcji „RaiseEvent”, aby wywołać zdarzenie.
pt_br: "{0}" é um evento e não pode ser chamado diretamente. Use uma instrução "RaiseEvent" para acionar um evento.
ru: "{0}" является событием и не может вызываться напрямую. Для порождения события используйте оператор "RaiseEvent".
tr: '{0}' bir olay ve doğrudan çağrılamaz. Olay oluşturmak için 'RaiseEvent' deyimini kullanın.
zh_hans: '“{0}”是事件，不能直接调用。请使用“RaiseEvent”语句引发事件。
zh_hant: '{0}' 為一事件，不可直接呼叫。請使用 'RaiseEvent' 陳述式引發事件。

# ERR_ForEachCollectionDesignPattern1
source: Expression is of type '{0}', which is not a collection type.
cs: Výraz je typu {0}, což není typ kolekce.
de: Der Ausdruck ist vom Typ "{0}". Dies ist kein Sammlungstyp.
es: La expresión es del tipo '{0}', que no es un tipo de colección.
fr: L'expression est du type '{0}', qui n'est pas un type de collection.
it: L'espressione è di tipo '{0}', che non è un tipo di raccolta.
ja: 式の型は '{0}' で、コレクション型ではありません。
ko: 식의 형식이 컬렉션 형식이 아닌 '{0}'입니다.
pl: Wyrażenie jest typu „{0}”, który nie jest typem kolekcji.
pt_br: Expressão é do tipo "{0}", que não é um tipo de coleção.
ru: Выражение имеет тип "{0}", не являющийся типом коллекции.
tr: İfade, bir koleksiyon türü olmayan '{0}' türünde.
zh_hans: 表达式的类型为“{0}”，该类型不是集合类型。
zh_hant: 運算式類型為 '{0}'，非集合類型。

# ERR_DefaultValueForNonOptionalParam
source: Default values cannot be supplied for parameters that are not declared 'Optional'.
cs: Nejde zadat výchozí hodnoty pro parametry bez deklarace Optional.
de: Standardwerte können nicht für Parameter bereitgestellt werden, die nicht als "Optional" deklariert sind.
es: Los valores predeterminados no se pueden proporcionar para parámetros no declarados como 'Optional'.
fr: Des valeurs par défaut ne peuvent pas être fournies pour des paramètres qui ne sont pas déclarés 'Optional'.
it: Non è possibile specificare i valori predefiniti per i parametri che non sono dichiarati come 'Optional'.
ja: Optional' と宣言されていないパラメーターに対して既定値を指定することはできません。
ko: Optional'로 선언하지 않은 매개 변수에 대해 기본값을 지정할 수 없습니다.
pl: Nie można podać wartości domyślnych dla parametrów, które nie są zadeklarowane jako Optional.
pt_br: Valores padrão não podem ser fornecidos para parâmetros que não são declarados 'Optional'.
ru: Значения по умолчанию не могут задаваться для параметров, не объявленных как "Optional".
tr: Optional' olarak bildirilmeyen parametrelere varsayılan değer sağlanamaz.
zh_hans: 无法向未声明为 "Optional" 的参数提供默认值。
zh_hant: 無法提供預設值給未宣告為 'Optional' 的參數。

# ERR_ExpectedDotAfterMyBase
source: 'MyBase' must be followed by '.' and an identifier.
cs: 'Za klíčovým slovem MyBase musí být tečka (.) a identifikátor.
de: 'Auf "MyBase" müssen "." und ein Bezeichner folgen.
es: 'MyBase' debe ir seguido por '.' y un identificador.
fr: 'MyBase' doit être suivi de '.' et d'un identificateur.
it: 'MyBase' deve essere seguito da '.' e da un identificatore.
ja: 'MyBase' の後には '.' および識別子を指定しなければなりません。
ko: 'MyBase' 뒤에는 '.'과 식별자가 와야 합니다.
pl: 'Po elemencie „MyBase” musi wystąpić znak „.” i identyfikator.
pt_br: 'MyBase' deve ser seguido por um '.' e um identificador.
ru: 'После "MyBase" должны следовать "." и идентификатор.
tr: 'MyBase' öğesinin arkasından '.' ve bir tanımlayıcı gelmelidir.
zh_hans: '“MyBase”的后面必须跟有“.”和标识符。
zh_hant: '在 'MyBase' 之後必須接著 '.' 及一個識別項。

# ERR_ExpectedDotAfterMyClass
source: 'MyClass' must be followed by '.' and an identifier.
cs: 'Za klíčovým slovem MyClass musí být tečka (.) a identifikátor.
de: 'Auf "MyClass" müssen "." und ein Bezeichner folgen.
es: 'MyClass' debe ir seguido por '.' y un identificador.
fr: 'MyClass' doit être suivi de '.' et d'un identificateur.
it: 'MyClass' deve essere seguito da '.' e da un identificatore.
ja: 'MyClass' の後には '.' および識別子を指定しなければなりません。
ko: 'MyClass' 뒤에는 '.'과 식별자가 와야 합니다.
pl: 'Po elemencie „MyClass” musi wystąpić znak „.” i identyfikator.
pt_br: 'MyClass' deve ser seguido por um '.' e um identificador.
ru: 'После "MyClass" должны следовать "." и идентификатор.
tr: 'MyClass' öğesinin arkasından '.' ve bir tanımlayıcı gelmelidir.
zh_hans: '“MyClass”的后面必须跟有“.”和标识符。
zh_hant: '在 'MyClass' 之後必須接著 '.' 及一個識別項。

# ERR_StrictArgumentCopyBackNarrowing3
source: Option Strict On disallows narrowing from type '{1}' to type '{2}' in copying the value of 'ByRef' parameter '{0}' back to the matching argument.
cs: Direktiva Option Strict On zakazuje při kopírování hodnoty parametru ByRef {0} zpět do odpovídajícího argumentu zúžení typu {1} na {2}.
de: "Option Strict On" lässt das Einschränken von Typ "{1}" zu Typ "{2}" beim Zurückkopieren des ByRef-Parameterwerts "{0}" in das entsprechende Argument nicht zu.
es: Option Strict On no permite restricciones del tipo '{1}' al tipo '{2}' al copiar de nuevo el valor del parámetro 'ByRef' '{0}' en el argumento correspondiente.
fr: Option Strict On interdit le passage du type '{1}' au type '{2}' lors de la recopie de la valeur du paramètre 'ByRef' '{0}' dans l'argument correspondant.
it: Option Strict On non consente la riduzione dal tipo '{1}' al tipo '{2}' quando il valore del parametro 'ByRef' '{0}' viene ricopiato nell'argomento corrispondente.
ja: Option Strict On が指定されている場合、'ByRef' パラメーター '{0}' の戻り値を対応する引数にコピーする際に、型 '{1}' から型 '{2}' に縮小変換することはできません。
ko: Option Strict On에서는 'ByRef' 매개 변수 '{0}'의 값을 해당 인수에 다시 복사하는 동안 '{1}' 형식에서 '{2}' 형식으로 축소 변환할 수 없습니다.
pl: Ustawienie „Option Strict On” uniemożliwia zawężanie z typu „{1}” do typu „{2}” podczas kopiowania wartości parametru „ByRef” „{0}” z powrotem do pasującego argumentu.
pt_br: A opção Strict On não permite restringir do tipo "{1}" para o tipo "{2}" na cópia do valor do parâmetro "ByRef" "{0}" de volta para o argumento correspondente.
ru: Option Strict On не разрешает сужение из типа "{1}" в тип "{2}" при копировании значения параметра "ByRef" "{0}" обратно в соответствующий аргумент.
tr: Option Strict On, '{0}' 'ByRef' parametresi eşleşen bağımsız değişkene geri kopyalanırken '{1}' türünden '{2}' türüne daraltmaya izin vermiyor.
zh_hans: 将“ByRef”形参“{0}”的值复制回匹配实参时，Option Strict On 不允许从类型“{1}”收缩为类型“{2}”。
zh_hant: Option Strict 為 On 時，不可將 'ByRef' 參數 '{0}' 的值複製回相對應的引數，而將類型 '{1}' 縮減為類型 '{2}'。

# ERR_LbElseifAfterElse
source: '#ElseIf' cannot follow '#Else' as part of a '#If' block.
cs: 'Klíčové slovo #ElseIf nemůže následovat za slovem #Else v rámci bloku #If.
de: '"#ElseIf" kann als Teil eines #If-Blocks nicht auf "#Else" folgen.
es: '#ElseIf' no puede ir detrás de '#Else' como parte de un bloque '#If'.
fr: '#ElseIf' ne peut pas suivre '#Else' dans un bloc '#If'.
it: '#ElseIf' non può seguire '#Else' come parte di un blocco '#If'.
ja: '#If' ブロックの一部として '#ElseIf' を '#Else' の後に使用することはできません。
ko: '#ElseIf'는 ''#If' 블록의 일부로 '#Else' 뒤에 올 수 없습니다.
pl: 'Instrukcja „#ElseIf” nie może wystąpić po instrukcji „#Else” jako część bloku „#If”.
pt_br: '#ElseIf' não pode seguir '#Else' como parte de um bloco '#If'.
ru: 'Блок "#ElseIf" не может следовать за "#Else" в пределах блока "#If".
tr: '#Else' deyiminin ardından '#If' bloğunun bir parçası olarak '#ElseIf' gelemez.
zh_hans: '"#ElseIf" 不能作为 "#If" 块的一部分跟在 "#Else" 之后。
zh_hant: '#ElseIf' 不可以跟隨在 '#Else' 之後做為 '#If' 區塊的一部分。

# ERR_StandaloneAttribute
source: Attribute specifier is not a complete statement. Use a line continuation to apply the attribute to the following statement.
cs: Specifikátor atributu není úplným příkazem. Použijte znak pro pokračování řádku a uplatněte atribut na následující příkaz.
de: Der Attributspezifizierer ist keine vollständige Anweisung. Verwenden Sie eine Zeilenfortsetzung, um das Attribut auf die folgende Anweisung anzuwenden.
es: El especificador de atributo no es una instrucción completa. Use una continuación de línea para aplicar el atributo a la instrucción siguiente.
fr: Le spécificateur d'attribut n'est pas une instruction complète. Utilisez un signe de continuation de ligne pour appliquer l'attribut à l'instruction suivante.
it: L'identificatore di attributi non è un'istruzione completa. Usare una continuazione di riga per applicare l'attributo alla seguente istruzione.
ja: 属性指定子が完全なステートメントではありません。後続のステートメントに属性を適用するには、行連結文字を使用してください。
ko: 특성 지정자 문이 종결되지 않았습니다. 줄 연속 문자를 사용하여 다음 문에 특성을 적용하세요.
pl: Specyfikator atrybutu nie jest kompletną instrukcją. Użyj kontynuacji wiersza, aby zastosować atrybut do następnej instrukcji.
pt_br: O especificador de atributo não é uma instrução completa. Use uma continuação de linha para aplicar o atributo à instrução seguinte.
ru: Спецификатор атрибута не является законченным оператором. Для назначения атрибута следующему оператору используйте символ продолжения строки.
tr: Öznitelik tanımlayıcı tam bir deyim değil. Özniteliği izleyen deyime uygulamak için satırı devam ettirme özelliğini kullanın.
zh_hans: 特性说明符不是一个完整的语句。请使用行继续符将该特性应用于下列语句。
zh_hant: 屬性規範不是完整的陳述式。請使用行接續符號將屬性套用至下列陳述式。
