Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadConstFlags1
source: '{0}' is not valid on a constant declaration.
cs: '{0} není platná deklarace konstanty.
de: '"{0}" ist in einer Konstantendeklaration ungültig.
es: '{0}' no es válido en una declaración de constantes.
fr: '{0}' n'est pas valide dans une déclaration de constante.
it: '{0}' non è valido in una dichiarazione di costante.
ja: '{0}' は、定数宣言では有効ではありません。
ko: '상수 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest poprawny w deklaracji stałej.
pt_br: "{0}" não é válido em uma declaração de constante.
ru: "{0}" недопустимо использовать при объявлении константы.
tr: 'Sabit bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在常量声明中无效。
zh_hant: '{0}' 在常數宣告中無效。

# ERR_BadWithEventsFlags1
source: '{0}' is not valid on a WithEvents declaration.
cs: '{0} není platný v deklaraci WithEvents.
de: '"{0}" ist in einer WithEvents-Deklaration ungültig.
es: '{0}' no es válido en una declaración WithEvents.
fr: '{0}' n'est pas valide dans une déclaration WithEvents.
it: '{0}' non è valido in una dichiarazione WithEvents.
ja: '{0}' は、WithEvents 宣言 では有効ではありません。
ko: 'WithEvents 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest poprawny w deklaracji WithEvents.
pt_br: "{0}" não é válido em uma declaração WithEvents.
ru: "{0}" недопустимо использовать в объявлении WithEvents.
tr: 'WithEvents bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在 WithEvents 声明中无效。
zh_hant: '{0}' 在 WithEvents 宣告中無效。

# ERR_BadDimFlags1
source: '{0}' is not valid on a member variable declaration.
cs: '{0} není platný v deklaraci členské proměnné.
de: '"{0}" ist in einer Membervariablendeklaration ungültig.
es: '{0}' no es válido en una declaración de variables miembro.
fr: '{0}' n'est pas valide dans une déclaration de variable membre.
it: '{0}' non è valido in una dichiarazione di variabile membro.
ja: '{0}' は、メンバー変数宣言では有効ではありません。
ko: '멤버 변수 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest poprawny w deklaracji zmiennej składowej.
pt_br: "{0}" não é válido em uma declaração de variável de membro.
ru: "{0}" недопустимо использовать при объявлении переменной-члена.
tr: 'Üye değişken bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在成员变量声明中无效。
zh_hant: '{0}' 在成員變數宣告中無效。

# ERR_DuplicateParamName1
source: Parameter already declared with name '{0}'.
cs: Parametr s názvem {0} už je deklarovaný.
de: Ein Parameter ist bereits mit dem Namen "{0}" deklariert.
es: Ya se ha declarado el parámetro con el nombre '{0}'.
fr: Paramètre déjà déclaré avec le nom '{0}'.
it: Il parametro è già dichiarato con il nome '{0}'.
ja: パラメーターは '{0}' という名前で既に宣言されています。
ko: 이름이 '{0}'인 매개 변수가 이미 선언되었습니다.
pl: Zadeklarowano już parametr o nazwie „{0}”.
pt_br: Parâmetro já declarado com o nome "{0}".
ru: Параметр уже объявлен с именем "{0}".
tr: Parametre, '{0}' adıyla zaten bildirildi.
zh_hans: 已用名称“{0}”声明了参数。
zh_hant: 參數已使用名稱 '{0}' 進行宣告。

# ERR_LoopDoubleCondition
source: 'Loop' cannot have a condition if matching 'Do' has one.
cs: 'Příkaz Loop nemůže obsahovat podmínku, pokud ji obsahuje párový příkaz Do.
de: '"Loop" kann keine Bedingung haben, wenn das übereinstimmende "Do" eine Bedingung hat.
es: 'Loop' no puede tener una condición si la instrucción 'Do' coincidente tiene una.
fr: 'Loop' ne peut pas avoir de condition si le 'Do' correspondant en a une.
it: 'Loop' non può contenere una condizione se questa è già presente nell'elemento 'Do' corrispondente.
ja: '対応する 'Do' に条件がある場合、'Loop' に条件を指定することはできません。
ko: '짝이 되는 'Do'에 조건이 있으면 'Loop'에는 조건을 사용할 수 없습니다.
pl: 'Instrukcja Loop nie może zawierać warunku, jeśli zawiera go już odpowiadająca jej instrukcja Do.
pt_br: 'Loop' não pode possuir uma condição se o 'Do' correspondente possui uma.
ru: 'Оператор "Loop" не может содержать условие, если соответствующий оператор "Do" содержит условие.
tr: 'Eşleşen 'Do' bir koşul içeriyorsa 'Loop' koşul içeremez.
zh_hans: '"Loop" 和匹配的 "Do" 不能同时具有条件。
zh_hant: '如果對稱的 'Do' 有條件，'Loop' 就不可有條件。

# ERR_ExpectedRelational
source: Relational operator expected.
cs: Očekával se relační operátor.
de: Relationaler Operator erwartet.
es: Se esperaba un operador relacional.
fr: Opérateur relationnel attendu.
it: È previsto l'operatore relazionale.
ja: 関係演算子が必要です。
ko: 관계형 연산자가 필요합니다.
pl: Oczekiwano operatora relacyjnego.
pt_br: Operador relacional esperado.
ru: Требуется оператор отношения.
tr: İlişkisel işleç bekleniyor.
zh_hans: 应为关系运算符。
zh_hant: 必須有關係運算子。

# ERR_ExpectedExitKind
source: 'Exit' must be followed by 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select', or 'Try'.
cs: 'Za klíčovým slovem Exit musí následovat klíčové slovo Sub, Function, Property, Do, For, While, Select nebo Try.
de: 'Auf "Exit" muss "Sub", "Function", "Property", "Do", "For", "While", "Select" oder "Try" folgen.
es: 'Exit' debe ir seguido de 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select' o 'Try'.
fr: 'Exit' doit être suivi de 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select' ou 'Try'.
it: 'Exit' deve essere seguito da 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select' o 'Try'.
ja: 'Exit' の後には、'Sub'、'Function'、'Property'、'Do'、'For'、'While'、'Select'、または 'Try' を指定しなければなりません。
ko: 'Exit' 뒤에는 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select' 또는 'Try'가 와야 합니다.
pl: 'Po instrukcji „Exit” musi występować instrukcja „Sub”, „Function”, „Property”, „Do”, „For”, „While”, „Select” lub „Try”.
pt_br: 'Exit' deve ser seguido por 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select', ou 'Try'.
ru: 'За оператором "Exit" должно следовать слово "Sub", "Function", "Property", "Do", "For", "While", "Select" или "Try".
tr: 'Exit' öğesinin ardından 'Sub', 'Function', 'Property', 'Do', 'For', 'While', 'Select' veya 'Try' gelmelidir.
zh_hans: '“Exit”的后面必须跟有“Sub”、“Function”、“Property”、“Do”、“For”、“While”、“Select”或“Try”。
zh_hant: 'Exit' 必須在 'Sub'、'Function'、'Property'、'Do'、'For'、'While'、'Select' 或 'Try' 之前。

# ERR_ExpectedNamedArgumentInAttributeList
source: Named argument expected.
cs: Očekával se pojmenovaný argument.
de: Benanntes Argument erwartet.
es: Se esperaba un argumento con nombre.
fr: Argument nommé attendu.
it: È previsto un argomento denominato.
ja: 名前付き引数が必要です。
ko: 명명된 인수가 필요합니다.
pl: Oczekiwano nazwanego argumentu.
pt_br: Argumento nomeado esperado.
ru: Ожидается именованный аргумент.
tr: Adlandırılmış bağımsız değişken bekleniyor.
zh_hans: 应为命名参数。
zh_hant: 必須是具名引數。

# ERR_NamedArgumentSpecificationBeforeFixedArgumentInLateboundInvocation
source: Named argument specifications must appear after all fixed arguments have been specified in a late bound invocation.
cs: Specifikace pojmenovaných argumentů musí následovat po specifikaci všech pevných argumentů v pozdním vyvolání vazby.
de: Die Spezifikationen für benannte Argumente müssen in einem spät gebundenen Aufruf nach Angabe aller festen Argumente aufgeführt werden.
es: Las especificaciones de argumento con nombre deben aparecer después de haber especificado todos los argumentos fijos en una invocación enlazada en tiempo de ejecución.
fr: Les spécifications d'argument nommé doivent s'afficher après la spécification de tous les arguments fixes dans un appel avec liaison tardive.
it: In una chiamata con associazione tardiva le specifiche di argomenti denominati devono trovarsi dopo tutti gli argomenti fissi specificati.
ja: 遅延バインディングの呼び出しでは、すべての固定引数を指定した後で名前付き引数を指定する必要があります。
ko: 명명된 인수 사양은 런타임에 바인딩된 호출에서 모든 고정 인수를 지정한 다음에 와야 합니다.
pl: Specyfikacje argumentu nazwanego muszą występować po wszystkich stałych argumentach, które zostały określone w wywołaniu późnego wiązania.
pt_br: As especificações de argumentos nomeados devem aparecer depois que todos os argumentos fixos são especificados em uma invocação de associação posterior.
ru: Спецификации именованных аргументов должны создаваться после всех указанных фиксированных аргументов в вызове с поздним связыванием.
tr: Adlandırılmış bağımsız değişken belirtimleri, tüm düzeltilmiş sabit değişkenler geç bağlanan bir çağrıda belirtildikten sonra görüntülenmelidir.
zh_hans: 命名参数规范必须出现在已在后期绑定调用中指定的所有固定参数之后。
zh_hant: 必須在所有固定引數皆已在晚期繫結引動過程中指定之後，具名引數規格才可出現。

# ERR_ExpectedNamedArgument
source: Named argument expected. Please use language version {0} or greater to use non-trailing named arguments.
cs: Očekával se pojmenovaný argument. Pokud chcete použít pojmenované argumenty, které nejsou na konci, použijte prosím jazyk verze {0} nebo vyšší.
de: Benanntes Argument erwartet. Verwenden Sie Sprachversion {0} oder höher, um nicht nachfolgende benannte Argumente zu verwenden.
es: Se esperaba un argumento con nombre. Use la versión {0} del lenguaje, o una posterior, para usar argumentos con nombre que no sean finales.
fr: Argument nommé attendu. Utilisez la version de langage {0} ou une version ultérieure pour permettre l'emploi d'arguments nommés non placés en position de fin.
it: È previsto l'argomento denominato. Usare la versione {0} o versioni successive del linguaggio per specificare argomenti denominati non finali.
ja: 名前付き引数が必要です。末尾以外の名前付き引数を使用するには、言語バージョン {0} 以上を使用してください。
ko: 명명된 인수가 필요합니다. 뒤에 오지 않는 명명된 인수를 사용하려면 {0} 이상의 언어 버전을 사용하세요.
pl: Oczekiwano argumentu nazwanego. Użyj wersji języka {0} lub nowszej, aby używać argumentów nazwanych innych niż końcowe.
pt_br: Argumento nomeado esperado. Use a versão de linguagem {0} ou posterior para usar argumentos nomeados que não estejam à direita.
ru: Ожидается именованный аргумент. Используйте версию языка {0} или более позднюю, чтобы использовать неконечные аргументы.
tr: Adlandırılmış bağımsız değişken bekleniyor. Sonda olmayan bağımsız değişkenleri kullanmak için {0} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 需要命名参数。请使用语言版本 {0} 或更高版本，以使用非尾随命名参数。
zh_hant: 必須是具名引數。請使用語言版本 {0} 或更高版本，以使用非後置的具名引數。

# ERR_BadMethodFlags1
source: '{0}' is not valid on a method declaration.
cs: '{0} není platný v deklaraci metody.
de: '"{0}" ist in einer Methodendeklaration ungültig.
es: '{0}' no es válido en una declaración de método.
fr: '{0}' n'est pas valide dans une déclaration de méthode.
it: '{0}' non è valido in una dichiarazione di metodo.
ja: '{0}' は、メソッド宣言では有効ではありません。
ko: '메서드 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji metody.
pt_br: "{0}" não é válido em uma declaração de método.
ru: "{0}" недопустимо использовать в объявлении метода.
tr: 'Yöntem bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在方法声明中无效。
zh_hant: '{0}' 在方法宣告中無效。

# ERR_BadEventFlags1
source: '{0}' is not valid on an event declaration.
cs: '{0} není platný v deklaraci události.
de: '"{0}" ist in einer Ereignisdeklaration ungültig.
es: '{0}' no es válido en una declaración de evento.
fr: '{0}' n'est pas valide dans une déclaration event.
it: '{0}' non è valido in una dichiarazione di evento.
ja: '{0}' は、イベント宣言では有効ではありません。
ko: '이벤트 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji zdarzenia.
pt_br: "{0}" não é válido em uma declaração de evento.
ru: "{0}" недопустимо использовать при объявлении события.
tr: 'Olay bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在事件声明中无效。
zh_hant: '{0}' 在事件宣告中無效。

# ERR_BadDeclareFlags1
source: '{0}' is not valid on a Declare.
cs: '{0} není platný v příkazu Declare.
de: '"{0}" ist in einer Declare-Anweisung ungültig.
es: '{0}' no es válido en Declare.
fr: '{0}' n'est pas valide dans un Declare.
it: '{0}' non è valido in un elemento Declare.
ja: '{0}' は、Declare では有効ではありません。
ko: 'Declare에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w elemencie Declare
pt_br: "{0}" não é válido em Declare.
ru: "{0}" является недопустимым для Declare.
tr: 'Declare üzerinde '{0}' geçerli değil.
zh_hans: '“{0}”在 Declare 中无效。
zh_hant: '{0}' 在 Declare 中無效。

# ERR_BadLocalConstFlags1
source: '{0}' is not valid on a local constant declaration.
cs: '{0} není platný v deklaraci lokální konstanty.
de: '"{0}" ist in der Deklaration von lokalen Konstanten ungültig.
es: '{0}' no es válido en una declaración de constantes local.
fr: '{0}' n'est pas valide dans une déclaration de constante locale.
it: '{0}' non è valido in una dichiarazione di costante locale.
ja: '{0}' は、ローカル定数宣言では有効ではありません。
ko: '지역 상수 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w deklaracji stałej lokalnej.
pt_br: "{0}" não é válido em uma declaração de constante local.
ru: "{0}" недопустимо использовать в объявлении локальной константы.
tr: 'Yerel sabit bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在局部常量声明中无效。
zh_hant: '{0}' 在區域常數宣告中無效。

# ERR_BadLocalDimFlags1
source: '{0}' is not valid on a local variable declaration.
cs: '{0} není platný v deklaraci lokální proměnné.
de: '"{0}" ist in der Deklaration von lokalen Variablen ungültig.
es: '{0}' no es válido en una declaración de variables local.
fr: '{0}' n'est pas valide dans une déclaration de variable locale.
it: '{0}' non è valido in una dichiarazione di variabile locale.
ja: '{0}' は、ローカル変数宣言では有効ではありません。
ko: '지역 변수 선언에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest poprawny w deklaracji zmiennej lokalnej.
pt_br: "{0}" não é válido em uma declaração de variável local.
ru: "{0}" недопустимо использовать в объявлении локальной переменной.
tr: 'Yerel değişken bildiriminde '{0}' geçerli değil.
zh_hans: '“{0}”在局部变量声明中无效。
zh_hant: '{0}' 在區域變數宣告中無效。

# ERR_ExpectedConditionalDirective
source: 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' or 'R' expected.
cs: 'Očekával se výraz If, ElseIf, Else, Const, Region, ExternalSource, ExternalChecksum, Enable, Disable, End nebo R.
de: '"If", "ElseIf", "Else", "Const", "Region", "ExternalSource", "ExternalChecksum", "Enable", "Disable", "End" oder "R" erwartet.
es: 'Se esperaba 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' o 'R'.
fr: 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' ou 'R' attendu.
it: 'È previsto 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' o 'R'.
ja: 'If'、'ElseIf'、'Else'、'Const'、'Region'、'ExternalSource'、'ExternalChecksum'、'Enable'、'Disable'、'End'、'R' が必要です。
ko: 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' 또는 'R'이 필요합니다.
pl: 'Oczekiwano instrukcji „If”, „ElseIf”, „Else”, „Const”, „Region”, „ExternalSource”, „ExternalChecksum”, „Enable”, „Disable”, „End” lub „R”.
pt_br: 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable', 'End' ou 'R' esperado.
ru: 'Ожидались операторы If, ElseIf, Else, Const, Region, ExternalSource, ExternalChecksum, Enable, Disable, End или R.
tr: 'If', 'ElseIf', 'Else', 'Const', 'Region', 'ExternalSource', 'ExternalChecksum', 'Enable', 'Disable' veya 'R' bekleniyor.
zh_hans: '应为“If”、“ElseIf”、“Else”、“Const”、“Region”、“ExternalSource”、“ExternalChecksum”、“Enable”、“Disable”、“End”或“R”。
zh_hant: '必須是 'If'、'ElseIf'、'Else'、'Const'、'Region'、'ExternalSource'、'ExternalChecksum'、'Enable'、'Disable'、'End' 或 'R'。

# ERR_ExpectedEQ
source: '=' expected.
cs: 'Očekával se znak =.
de: '"=" erwartet.
es: 'Se esperaba '='.
fr: '=' attendu.
it: 'È previsto '='.
ja: '=' が必要です。
ko: '='가 필요합니다.
pl: 'Oczekiwano znaku „=”.
pt_br: '=' esperado.
ru: 'Требуется "=".
tr: '=' bekleniyor.
zh_hans: '应为 "="。
zh_hant: '必須有 '='。

# ERR_ConstructorNotFound1
source: Type '{0}' has no constructors.
cs: Typ {0} nemá žádné konstruktory.
de: Der Typ "{0}" hat keine Konstruktoren.
es: El tipo '{0}' no tiene constructores.
fr: Le type '{0}' n'a aucun constructeur.
it: Il tipo '{0}' non ha costruttori.
ja: 型 '{0}' にはコンストラクターがありません。
ko: '{0}' 형식에 생성자가 없습니다.
pl: Typ „{0}” nie ma konstruktorów.
pt_br: Tipo "{0}" não tem construtores.
ru: Тип "{0}" не имеет конструкторов.
tr: '{0}' türünün oluşturucusu yok.
zh_hans: 类型“{0}”没有构造函数。
zh_hant: 類型 '{0}' 沒有建構函式。

# ERR_InvalidEndInterface
source: 'End Interface' must be preceded by a matching 'Interface'.
cs: 'Klíčovému slovu End Interface musí předcházet párové klíčové slovo Interface.
de: '"End Interface" muss ein entsprechendes "Interface" voranstehen.
es: 'End Interface' debe ir precedida de la instrucción 'Interface' correspondiente.
fr: 'End Interface' doit être précédé d'un 'Interface' correspondant.
it: 'End Interface' deve essere preceduto da un elemento 'Interface' corrispondente.
ja: 'End Interface' の前には、対応する 'Interface' を指定しなければなりません。
ko: 'End Interface'는 짝이 되는 'Interface' 뒤에 와야 합니다.
pl: 'Instrukcja End Interface musi być poprzedzona odpowiadającą jej instrukcją Interface.
pt_br: 'End Interface' deve ser precedido por 'Interface' correspondente.
ru: 'Оператору "End Interface" должен предшествовать соответствующий оператор "Interface".
tr: 'End Interface' öncesinde eşleşen bir 'Interface' olmalıdır.
zh_hans: '“End Interface”前面必须是匹配的“Interface”。
zh_hant: 'End Interface' 之前必須搭配相對應的 'Interface'。

# ERR_MissingEndInterface
source: 'Interface' must end with a matching 'End Interface'.
cs: 'Klíčové slovo Interface musí být ukončené párovým klíčovým slovem End Interface.
de: '"Interface" muss mit einem entsprechenden "End Interface" abgeschlossen werden.
es: 'Interface' debe terminar con la instrucción 'End Interface' correspondiente.
fr: 'Interface' doit se terminer par un 'End Interface' correspondant.
it: 'Interface' deve terminare con un elemento 'End Interface' corrispondente.
ja: 'Interface' の終わりには、対応する 'End Interface' を指定しなければなりません。
ko: 'Interface'는 짝이 되는 'End Interface'로 끝나야 합니다.
pl: 'Instrukcja Interface musi być zakończona odpowiadającą jej instrukcją End Interface.
pt_br: 'Interface' deve terminar com um 'End Interface' correspondente.
ru: 'Блок "Interface" должен заканчиваться соответствующим оператором "End Interface".
tr: 'Interface' öğesi eşleşen bir 'End Interface' ile bitmelidir.
zh_hans: '"Interface" 必须以匹配的 "End Interface" 结束。
zh_hant: 'Interface' 之後必須搭配相對應的 'End Interface'。

# ERR_InheritsFrom2
source: '{0}' inherits from '{1}'.
cs: {0} dědí z {1}.
de: "{0}" erbt von "{1}".
es: '{0}' hereda de '{1}'.
fr: '{0}' hérite de '{1}'.
it: '{0}' eredita da '{1}'.
ja: '{0}' は '{1}' から継承されます。
ko: '{0}'이(가) '{1}'에서 상속됩니다.
pl: Element „{0}” dziedziczy po elemencie „{1}”.
pt_br: "{0}" herda de "{1}".
ru: "{0}" наследует от "{1}".
tr: '{0}', '{1}' öğesinden devralıyor.
zh_hans: “{0}”从“{1}”继承。
zh_hant: '{0}' 繼承自 '{1}'。

# ERR_IsNestedIn2
source: '{0}' is nested in '{1}'.
cs: {0} je vnořené v {1}.
de: "{0}" ist in "{1}" geschachtelt.
es: '{0}' está anidado en '{1}'.
fr: '{0}' est imbriqué dans '{1}'.
it: '{0}' è annidato in '{1}'.
ja: '{0}' は '{1}' 内で入れ子にされています。
ko: '{0}'이(가) '{1}'에 중첩됩니다.
pl: Element „{0}” jest zagnieżdżony w elemencie „{1}”.
pt_br: "{0}" está aninhado em "{1}".
ru: "{0}" вложено в "{1}".
tr: '{0}', '{1}' ile iç içedir.
zh_hans: “{0}”嵌套在“{1}”中。
zh_hant: '{0}' 巢狀於 '{1}'。

# ERR_InheritanceCycle1
source: Class '{0}' cannot inherit from itself: {1}
cs: Třída {0} nemůže dědit od sebe sama: {1}.
de: Die {0}-Klasse kann nicht von sich selbst erben: {1}
es: La clase '{0}' no puede heredar de sí misma: {1}
fr: La classe '{0}' ne peut pas hériter d'elle-même : {1}
it: La classe '{0}' non può ereditare da se stessa: {1}
ja: クラス '{0}' はそれ自体から継承することはできません: {1}
ko: '{0}' 클래스는 자체 클래스({1})에서 상속할 수 없습니다.
pl: Klasa „{0}” nie może dziedziczyć po sobie samej: {1}.
pt_br: Classe "{0}" não pode herdar de si mesma: {1}
ru: Класс "{0}" не может наследовать от себя самого: {1}
tr: '{0}' sınıfı kendi kendisinden devralamaz: {1}
zh_hans: 类“{0}”不能从自身继承: {1}
zh_hant: 類別 '{0}' 無法繼承其本身: {1}

# ERR_InheritsFromNonClass
source: Classes can inherit only from other classes.
cs: Třídy můžou dědit jenom od jiných tříd.
de: Klassen können nur von anderen Klassen erben.
es: Las clases solo pueden heredarse de otras clases.
fr: Les classes ne peuvent hériter que d'autres classes.
it: Le classi possono ereditare solo da altre classi.
ja: クラスは、他のクラスからのみ継承できます。
ko: 클래스는 다른 클래스에서만 상속할 수 있습니다.
pl: Klasy mogą dziedziczyć tylko po innych klasach.
pt_br: Classes só podem herdar de outras classes.
ru: Классы могут наследовать только от других классов.
tr: Sınıflar yalnızca diğer sınıflardan devralabilir.
zh_hans: 类只能从其他类继承。
zh_hant: 類別只能繼承自其他類別。

# ERR_MultiplyDefinedType3
source: '{0}' is already declared as '{1}' in this {2}.
cs: 'Název {0} je už deklarovaný jako {1} v tomto {2}.
de: '"{0}" wurde bereits als "{1}" in dieser {2} deklariert.
es: '{0}' ya está declarado como '{1}' en esta {2}.
fr: '{0}' est déjà déclaré en tant que '{1}' dans ce {2}.
it: '{0}' è già dichiarato come '{1}' in questo elemento {2}.
ja: '{0}' は、この {2} で '{1}' として既に宣言されています。
ko: '{0}'은(는) 이 {2}에 '{1}'(으)로 이미 선언되었습니다.
pl: 'Element „{0}” jest już zadeklarowany jako „{1}” w tym elemencie {2}.
pt_br: "{0}" já está declarado neste como "{1}" neste {2}.
ru: "{0}" уже объявлено как "{1}" в {2}.
tr: '{0}', bu {2} içinde '{1}' olarak zaten bildirildi.
zh_hans: '“{0}”已在此 {2} 中声明为“{1}”。
zh_hant: '{0}' 在此 {2} 中已宣告為 '{1}'。

# ERR_BadOverrideAccess2
source: '{0}' cannot override '{1}' because they have different access levels.
cs: 'Deklarace {0} nemůže přepsat deklaraci {1}, protože mají různé úrovně přístupu.
de: '"{0}" kann "{1}" nicht überschreiben, da sie unterschiedliche Zugriffsebenen haben.
es: '{0}' no puede invalidar '{1}' porque tienen niveles de acceso diferentes.
fr: '{0}' ne peut pas se substituer à '{1}', car elles ont des niveaux d'accès différents.
it: '{0}' non può eseguire l'override di '{1}' perché hanno livelli di accesso diversi.
ja: '異なるアクセス レベルが指定されているため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '액세스 수준이 서로 달라 '{0}'에서는 '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ mają one różne poziomy dostępu.
pt_br: "{0}" não pode substituir "{1}" porque têm níveis de acesso diferentes.
ru: "{0}" не может переопределить "{1}", поскольку у них разные уровни доступа.
tr: 'Farklı erişim düzeylerine sahip olduklarından '{1}' öğesi '{0}' tarafından geçersiz kılınamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们具有不同的访问级别。
zh_hant: '{0}' 無法覆寫 '{1}'，因為它們的存取層級不同。

# ERR_CantOverrideNotOverridable2
source: '{0}' cannot override '{1}' because it is declared 'NotOverridable'.
cs: '{0} nemůže přepsat {1}, protože je deklarovaná jako NotOverridable.
de: '"{0}" kann "{1}" nicht überschreiben, da es als "NotOverridable" deklariert ist.
es: '{0}' no puede anular '{1}' porque está declarado como 'NotOverridable'.
fr: '{0}' ne peut pas se substituer à '{1}', car il est déclaré 'NotOverridable'.
it: '{0}' non può eseguire l'override di '{1}' perché è dichiarato come 'NotOverridable'.
ja: '{1}' は、'NotOverridable' として宣言されているため、'{0}' でオーバーライドすることはできません。
ko: '{0}'은(는) 'NotOverridable'로 선언되었으므로 '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ jest on zadeklarowany jako „NotOverridable”.
pt_br: "{0}" não pode substituir "{1}" porque está declarado como "NotOverridable".
ru: "{0}" не может переопределить "{1}", поскольку он объявлен как "NotOverridable".
tr: 'NotOverridable' olarak bildirildiğinden '{0}' '{1}' öğesini geçersiz kılamıyor.
zh_hans: '“{0}”无法重写“{1}”，因为后者已声明为“NotOverridable”。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其宣告為 'NotOverridable'。

# ERR_DuplicateProcDef1
source: '{0}' has multiple definitions with identical signatures.
cs: '{0} má několik definic s identickými podpisy.
de: '"{0}" hat mehrere Definitionen mit identischen Signaturen.
es: '{0}' tiene varias definiciones con firmas idénticas.
fr: '{0}' a plusieurs définitions comportant des signatures identiques.
it: '{0}' contiene più definizioni con firme identiche.
ja: '{0}' には同じ署名で複数の定義が存在します。
ko: '{0}'에 시그니처가 동일한 정의가 여러 개 있습니다.
pl: 'Element „{0}” ma wiele definicji o identycznych sygnaturach.
pt_br: "{0}" tem várias definições com assinaturas idênticas.
ru: "{0}" имеет несколько определений с одинаковыми сигнатурами.
tr: '{0}', imzaları aynı olan birden çok tanıma sahip.
zh_hans: '“{0}”具有多个带相同签名的定义。
zh_hant: '{0}' 有多個具相同簽章的定義。
