Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NewInStruct
source: Structures cannot declare a non-shared 'Sub New' with no parameters.
cs: Struktury nemůžou deklarovat nesdílený příkaz Sub New bez parametrů.
de: Strukturen können keine nicht gemeinsame "Sub New" ohne Parameter deklarieren.
es: Las estructuras no pueden declarar un elemento 'Sub New' no compartido sin parámetros.
fr: Les structures ne peuvent pas déclarer un 'Sub New' non partagé sans aucun paramètre.
it: Le strutture non possono dichiarare un elemento 'Sub New' non condiviso senza parametri.
ja: 構造体は、パラメーターなしの非共有の 'Sub New' を宣言できません。
ko: 구조는 매개 변수가 없고 공유되지 않는 'Sub New'를 선언할 수 없습니다.
pl: Struktury nie mogą deklarować nieudostępnianych elementów „Sub New” bez parametrów.
pt_br: Estruturas não podem declarar 'Sub New' não compartilhado sem parâmetros.
ru: Структуры не могут объявлять неразделяемый конструктор "Sub New" при отсутствии параметров.
tr: Yapılar parametre olmadan paylaşılmayan bir 'Sub New' bildiremez.
zh_hans: 结构不能声明没有参数的非共享 "Sub New"。
zh_hant: 結構無法宣告非共用且無參數的 'Sub New'。

# ERR_InvalidEndGet
source: 'End Get' must be preceded by a matching 'Get'.
cs: 'Příkazu End Get musí předcházet párový příkaz Get.
de: '"End Get" muss ein entsprechendes "Get" voranstehen.
es: 'End Get' debe ir precedida de la instrucción 'Get' correspondiente.
fr: 'End Get' doit être précédé d'un 'Get' correspondant.
it: 'End Get' deve essere preceduto da un elemento 'Get' corrispondente.
ja: 'End Get' の前には、対応する 'Get' を指定しなければなりません。
ko: 'End Get'은 짝이 되는 'Get' 뒤에 와야 합니다.
pl: 'Instrukcja End Get musi być poprzedzona odpowiadającą jej instrukcją Get.
pt_br: 'End Get' deve ser precedido por 'Get' correspondente.
ru: 'Оператору "End Get" должен предшествовать соответствующий оператор "Get".
tr: 'End Get' öncesinde eşleşen bir 'Get' olmalıdır.
zh_hans: '“End Get”前面必须是匹配的“Get”。
zh_hant: 'End Get' 之前必須搭配相對應的 'Get'。

# ERR_MissingEndGet
source: 'Get' statement must end with a matching 'End Get'.
cs: 'Příkaz Get musí být ukončený párovým příkazem End Get.
de: '"Get" muss mit einem entsprechenden "End Get" abgeschlossen werden.
es: 'La instrucción 'Get' debe terminar con la instrucción 'End Get' correspondiente.
fr: 'Une instruction 'Get' doit se terminer par un 'End Get' correspondant.
it: 'L'istruzione 'Get' deve terminare con un elemento 'End Get' corrispondente.
ja: 'Get' ステートメントの終わりには、対応する 'End Get' を指定しなければなりません。
ko: 'Get' 문은 짝이 되는 'End Get'으로 끝나야 합니다.
pl: 'Instrukcja Get musi być zakończona odpowiadającą jej instrukcją End Get.
pt_br: 'A instrução 'Get' deve terminar com um 'End Get' correspondente.
ru: 'Оператор "Get" должен заканчиваться соответствующим оператором "End Get".
tr: 'Get' deyimi eşleşen bir 'End Get' ile bitmelidir.
zh_hans: '"Get" 语句必须以匹配的 "End Get" 结束。
zh_hant: 'Get' 陳述式之後必須搭配相對應的 'End Get'。

# ERR_InvalidEndSet
source: 'End Set' must be preceded by a matching 'Set'.
cs: 'Příkazu End Set musí předcházet párový příkaz Set.
de: '"End Set" muss ein entsprechendes "Set" voranstehen.
es: 'End Set' debe ir precedida de la instrucción 'Set' correspondiente.
fr: 'End Set' doit être précédé d'un 'Set' correspondant.
it: 'End Set' deve essere preceduto da un elemento 'Set' corrispondente.
ja: 'End Set' の前には、対応する 'Set' を指定しなければなりません。
ko: 'End Set'은 짝이 되는 'Set' 뒤에 와야 합니다.
pl: 'Instrukcja End Set musi być poprzedzona odpowiadającą jej instrukcją Set.
pt_br: 'End Set' deve ser precedido por 'Set' correspondente.
ru: 'Оператору "End Set" должен предшествовать соответствующий оператор "Set".
tr: 'End Set' öncesinde eşleşen bir 'Set' olmalıdır.
zh_hans: '“End Set”前面必须是匹配的“Set”。
zh_hant: 'End Set' 之前必須搭配相對應的 'Set'。

# ERR_MissingEndSet
source: 'Set' statement must end with a matching 'End Set'.
cs: 'Příkaz Set musí být ukončený párovým příkazem End Set.
de: '"Set" muss mit einem entsprechenden "End Set" abgeschlossen werden.
es: 'La instrucción 'Set' debe terminar con la instrucción 'End Set' correspondiente.
fr: 'Une instruction 'Set' doit se terminer par un 'End Set' correspondant.
it: 'L'istruzione 'Set' deve terminare con un elemento 'End Set' corrispondente.
ja: 'Set' ステートメントの終わりには、対応する 'End Set' を指定しなければなりません。
ko: 'Set' 문은 짝이 되는 'End Set'으로 끝나야 합니다.
pl: 'Instrukcja Set musi być zakończona odpowiadającą jej instrukcją End Set.
pt_br: 'A instrução 'Set' deve terminar com um 'End Set' correspondente.
ru: 'Оператор "Set" должен заканчиваться соответствующим оператором "End Set".
tr: 'Set' deyimi eşleşen bir 'End Set' ile bitmelidir.
zh_hans: '"Set" 语句必须以匹配的 "End Set" 结束。
zh_hant: 'Set' 陳述式之後必須搭配相對應的 'End Set'。

# ERR_InvInsideEndsProperty
source: Statement cannot appear within a property body. End of property assumed.
cs: Příkaz se nemůže objevit v těle vlastnosti. Předpokládá se konec vlastnosti.
de: Eine Anweisung kann nicht innerhalb eines Eigenschaftentexts verwendet werden. Das Ende der Eigenschaft wird angenommen.
es: La instrucción no puede aparecer dentro del cuerpo de una propiedad. Se supone el final de la propiedad.
fr: Cette instruction ne peut pas apparaître dans le corps d'une propriété. Elle est interprétée comme la fin de la propriété.
it: L'istruzione non può essere specificata all'interno di un corpo di proprietà. Verrà interpretata come fine della proprietà.
ja: ステートメントを、プロパティ本体内部に記述することはできません。プロパティの終わりと見なします。
ko: 속성 본문 안에는 문을 사용할 수 없습니다. 속성의 끝으로 간주합니다.
pl: Instrukcja nie może wystąpić w treści właściwości. Założono koniec właściwości.
pt_br: A instrução não pode aparecer dentro do corpo de uma propriedade. Fim da propriedade assumido.
ru: Оператор не может присутствовать в теле свойства. Предполагается, что свойство завершено.
tr: Özellik gövdesi içinde deyim bulunamaz. Özellik sonu varsayıldı.
zh_hans: 语句不能出现在属性体内。假定为属性末尾。
zh_hant: 陳述式不可以在屬性主體中出現。已假設是屬性結尾。

# ERR_DuplicateWriteabilityCategoryUsed
source: 'ReadOnly' and 'WriteOnly' cannot be combined.
cs: 'Klíčová slova ReadOnly a WriteOnly nejde kombinovat.
de: '"ReadOnly" und "WriteOnly" können nicht kombiniert werden.
es: 'ReadOnly' y 'WriteOnly' no se pueden combinar.
fr: 'Impossible de combiner 'ReadOnly' et 'WriteOnly'.
it: 'Non è possibile combinare 'ReadOnly' e 'WriteOnly'.
ja: 'ReadOnly' と 'WriteOnly' を組み合わせて使用することはできません。
ko: 'ReadOnly'와 'WriteOnly'는 함께 사용할 수 없습니다.
pl: 'Nie można łączyć elementów „ReadOnly” i „WriteOnly”.
pt_br: 'ReadOnly' e 'WriteOnly' não podem ser combinados.
ru: '"ReadOnly" и "WriteOnly" не могут использоваться вместе.
tr: 'ReadOnly' ile 'WriteOnly' birleştirilemez.
zh_hans: '"ReadOnly" 不能与 "WriteOnly" 组合。
zh_hant: '無法結合 'ReadOnly' 和 'WriteOnly'。

# ERR_ExpectedGreater
source: '>' expected.
cs: 'Očekával se znak >.
de: '">" erwartet.
es: 'Se esperaba '>'.
fr: '>' attendu.
it: 'È previsto il segno '>'.
ja: '>' が必要です。
ko: '>'가 필요합니다.
pl: 'Oczekiwano znaku „>”.
pt_br: '>' esperado.
ru: 'Требуется ">".
tr: '>' bekleniyor.
zh_hans: '应为“>”。
zh_hant: '必須有 '>'。

# ERR_AttributeStmtWrongOrder
source: Assembly or Module attribute statements must precede any declarations in a file.
cs: Příkazy atributů Assembly a Module musí předcházet před všemi deklaracemi v souboru.
de: Assembly- oder Modulattributanweisungen müssen vor allen Deklarationen in einer Datei stehen.
es: Las instrucciones de atributo de ensamblado o módulo deben preceder a cualquier declaración en un archivo.
fr: Les instructions d'attribut Assembly ou Module doivent précéder toutes les déclarations dans un fichier.
it: Le istruzioni di attributi Assembly o Module devono precedere tutte le dichiarazioni in un file.
ja: Assembly または Module 属性ステートメントは、ファイル内のどの宣言よりも前に記述しなければなりません。
ko: 어셈블리 또는 모듈 특성 문은 파일의 모든 선언 앞에 와야 합니다.
pl: Instrukcje atrybutu zestawu lub modułu muszą występować przed wszelkimi deklaracjami w pliku.
pt_br: Instruções de atributo Assembly ou Module devem preceder qualquer declaração em um arquivo.
ru: Операторы атрибута сборки или модуля в файле должны указываться до объявлений.
tr: Assembly veya Module öznitelik deyimleri dosyadaki tüm bildirimlerden önce gelmelidir.
zh_hans: Assembly 或 Module 特性语句必须位于文件中的任何声明之前。
zh_hant: 組件或模組屬性陳述式必須在檔案中任何宣告之前。

# ERR_NoExplicitArraySizes
source: Array bounds cannot appear in type specifiers.
cs: Indexy pole nemohou být použity ve specifikátorech typu.
de: Arraygrenzen können nicht in Typspezifizierern verwendet werden.
es: Los límites de matriz no pueden aparecer en los especificadores de tipo.
fr: Les limites d'index de tableau ne peuvent pas figurer dans les spécificateurs de type.
it: I limiti di matrice non possono essere specificati negli identificatori di tipo.
ja: 配列の範囲を、型指定子に記述することはできません。
ko: 배열 범위는 형식 지정자에 사용할 수 없습니다.
pl: Granice tablicy nie mogą wystąpić w specyfikatorze typu.
pt_br: Limites de matriz não podem aparecer em especificadores de tipo.
ru: Границы массивов не могут присутствовать в спецификаторах типов.
tr: Tür tanımlayıcılarda dizi sınırları bulunamaz.
zh_hans: 数组界限不能出现在类型说明符中。
zh_hant: 陣列界限的宣告不可以出現在類型規範中。

# ERR_BadPropertyFlags1
source: Properties cannot be declared '{0}'.
cs: Pro vlastnosti nelze použít deklaraci {0}.
de: Eigenschaften können nicht als "{0}" deklariert werden.
es: Las propiedades no se pueden declarar como '{0}'.
fr: Les propriétés ne peuvent pas être déclarées '{0}'.
it: Le proprietà non possono essere dichiarate come '{0}'.
ja: プロパティを '{0}' として宣言することはできません。
ko: 속성은 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować właściwości jako „{0}”.
pt_br: Propriedades não podem ser declarados "{0}".
ru: Свойства не могут быть объявлены "{0}".
tr: Özellikler '{0}' olarak bildirilemez.
zh_hans: 属性不能声明为“{0}”。
zh_hant: 屬性不可宣告為 '{0}'。

# ERR_InvalidOptionExplicit
source: 'Option Explicit' can be followed only by 'On' or 'Off'.
cs: 'Za klíčovým slovem Option Explicit může následovat jenom klíčové slovo On nebo Off.
de: 'Auf "Option Explicit" kann nur "On" oder "Off" folgen.
es: 'Option Explicit' solo puede ir seguida de 'On' u 'Off'.
fr: 'Option Explicit' ne peut être suivi que de 'On' ou 'Off'.
it: 'Option Explicit' può essere seguito solo da 'On' o da 'Off'.
ja: 'Option Explicit' の後には、'On' または 'Off' のみを指定できます。
ko: 'Option Explicit' 뒤에는 'On' 또는 'Off'만 올 수 있습니다.
pl: 'Po instrukcji Option Explicit może wystąpić jedynie opcja On lub Off.
pt_br: 'Option Explicit' só pode ser seguido por 'On' ou 'Off'.
ru: 'За "Option Explicit" может следовать только "On" или "Off".
tr: 'Option Explicit' öğesinin ardından yalnızca 'On' veya 'Off' gelebilir.
zh_hans: '"Option Explicit" 的后面只能跟 "On" 或 "Off"。
zh_hant: 'Option Explicit' 之後只能是 'On' 或 'Off'。

# ERR_MultipleParameterSpecifiers
source: 'ByVal' and 'ByRef' cannot be combined.
cs: 'Klíčová slova ByVal a ByRef nejde kombinovat.
de: '"ByVal" und "ByRef" können nicht kombiniert werden.
es: 'ByVal' y 'ByRef' no se pueden combinar.
fr: 'Impossible de combiner 'ByVal' et 'ByRef'.
it: 'Non è possibile combinare 'ByVal' e 'ByRef'.
ja: 'ByVal' および 'ByRef' を組み合わせて使用することはできません。
ko: 'ByVal'과 'ByRef'는 함께 사용할 수 없습니다.
pl: 'Nie można łączyć elementów „ByVal” i „ByRef”.
pt_br: 'ByVal' e 'ByRef' não podem ser combinados.
ru: '"ByVal" и "ByRef" не могут использоваться вместе.
tr: 'ByVal' ile 'ByRef' birleştirilemez.
zh_hans: '“ByVal”不能与“ByRef”组合。
zh_hant: '無法結合 'ByVal' 和 'ByRef'。

# ERR_MultipleOptionalParameterSpecifiers
source: 'Optional' and 'ParamArray' cannot be combined.
cs: 'Klíčová slova Optional a ParamArray nejde kombinovat.
de: '"Optional" und "ParamArray" können nicht kombiniert werden.
es: 'Optional' y 'ParamArray' no se pueden combinar.
fr: 'Impossible de combiner 'Optional' et 'ParamArray'.
it: 'Non è possibile combinare 'Optional' e 'ParamArray'.
ja: 'Optional' と 'ParamArray' を組み合わせて使用することはできません。
ko: 'Optional'과 'ParamArray'는 함께 사용할 수 없습니다.
pl: 'Nie można łączyć elementów „Optional” i „ParamArray”.
pt_br: 'Optional' e 'ParamArray' não podem ser combinados.
ru: '"Optional" и "ParamArray" не могут использоваться вместе.
tr: 'Optional' ile 'ParamArray' birleştirilemez.
zh_hans: "Optional" 不能与 "ParamArray" 组合。
zh_hant: '無法結合 'Optional' 和 'ParamArray'。

# ERR_UnsupportedProperty1
source: Property '{0}' is of an unsupported type.
cs: Vlastnost {0} je nepodporovaného typu.
de: Der Typ der Eigenschaft "{0}" wird nicht unterstützt.
es: La propiedad '{0}' es de un tipo no admitido.
fr: La propriété '{0}' est d'un type non pris en charge.
it: La proprietà '{0}' è di tipo non supportato.
ja: プロパティ '{0}' の型はサポートされていません。
ko: '{0}' 속성은 지원되지 않는 형식입니다.
pl: Właściwość „{0}” jest nieobsługiwanego typu.
pt_br: Propriedade "{0}" é de um tipo sem suporte.
ru: Свойство "{0}" относится к неподдерживаемому типу.
tr: '{0}' özelliği desteklenmeyen türde.
zh_hans: 属性“{0}”的类型不受支持。
zh_hant: 屬性 '{0}' 是不支援的類型。

# ERR_InvalidOptionalParameterUsage1
source: Attribute '{0}' cannot be applied to a method with optional parameters.
cs: Atribut {0} nejde použít pro metodu s nepovinnými parametry.
de: Das Attribut "{0}" kann nicht auf eine Methode mit optionalen Parametern angewendet werden.
es: El atributo '{0}' no se puede aplicar a un método con parámetros opcionales.
fr: L'attribut '{0}' ne peut pas être appliqué à une méthode avec des paramètres optionnels.
it: Non è possibile applicare l'attributo '{0}' a un metodo con parametri facoltativi.
ja: 省略可能なパラメーターを含むメソッドに、属性 '{0}' を適用できません。
ko: '{0}' 특성을 선택적 매개 변수가 있는 메서드에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „{0}” do metody z parametrami opcjonalnymi.
pt_br: Atributo "{0}" não pode ser aplicado a um método com parâmetros opcionais.
ru: Атрибут "{0}" не может использоваться для метода с необязательными параметрами.
tr: '{0}' özniteliği isteğe bağlı parametreleri olan bir yönteme uygulanamaz.
zh_hans: 属性“{0}”不能应用于具有可选参数的方法。
zh_hant: 無法將屬性 '{0}' 套用至具有選擇性參數的方法。

# ERR_ReturnFromNonFunction
source: 'Return' statement in a Sub or a Set cannot return a value.
cs: 'Příkaz Return v proceduře Sub nebo Set nemůže vracet hodnotu.
de: 'Eine Return-Anweisung in "Sub" oder "Set" kann keinen Wert zurückgeben.
es: 'Una instrucción 'Return' en Sub o Set no puede devolver un valor.
fr: 'L'instruction 'Return' dans un Sub ou un Set ne peut pas retourner de valeur.
it: 'L'istruzione 'Return' in un elemento Sub o Set non può restituire un valore.
ja: 'Sub または Set の 'Return' ステートメントで値を返すことはできません。
ko: 'Sub 또는 Set의 'Return' 문은 값을 반환할 수 없습니다.
pl: 'Instrukcja Return w bloku Sub lub Set nie może zwracać wartości.
pt_br: 'A instrução 'Return' em um Sub ou um Set não pode retornar um valor.
ru: 'Оператор "Return" в "Sub" или "Set" не может возвращать значение.
tr: 'Sub veya Set içindeki 'Return' deyimi değer döndüremez.
zh_hans: 'Sub 或 Set 中的 "Return" 语句不能返回值。
zh_hant: '在 Sub 或 Set 中的 'Return' 陳述式無法傳回值。

# ERR_UnterminatedStringLiteral
source: String constants must end with a double quote.
cs: Řetězcové konstanty musí končit uvozovkami.
de: Zeichenfolgenkonstanten müssen mit einem doppelten Anführungszeichen enden.
es: Las constantes de cadena deben terminar con comillas dobles.
fr: Les constantes de chaîne doivent se terminer par un guillemet.
it: Le costanti stringa devono terminare con le virgolette.
ja: 文字列定数の終わりには、二重引用符を指定しなければなりません。
ko: 문자열 상수는 큰따옴표로 끝나야 합니다.
pl: Stałe w postaci ciągu muszą być zakończone znakiem podwójnego cudzysłowu.
pt_br: Constantes de cadeia de caracteres devem terminar com aspas duplas.
ru: Строковые константы должны завершаться двойной кавычкой.
tr: Dize sabitleri çift tırnak işaretiyle bitmelidir.
zh_hans: 字符串常量必须以双引号结束。
zh_hant: 字串常數必須以雙引號結尾。

# ERR_UnsupportedType1
source: '{0}' is an unsupported type.
cs: '{0} je nepodporovaný typ.
de: '"{0}" ist ein Typ, der nicht unterstützt wird.
es: '{0}' es de un tipo no admitido.
fr: '{0}' est un type non pris en charge.
it: '{0}' è un tipo non supportato.
ja: '{0}' の型はサポートされていません。
ko: '{0}'은(는) 지원되지 않는 형식입니다.
pl: 'Element „{0}” jest nieobsługiwanym typem.
pt_br: "{0}" é um tipo sem suporte.
ru: "{0}" является неподдерживаемым типом.
tr: '{0}', desteklenmeyen bir tür.
zh_hans: '“{0}”是不受支持的类型。
zh_hant: '{0}' 是不支援的類型。

# ERR_InvalidEnumBase
source: Enums must be declared as an integral type.
cs: Pro výčtové hodnoty musí být použita deklarace integrálního typu.
de: Enumerationen müssen als ganzzahliger Typ deklariert werden.
es: Las enumeraciones se deben declarar como un tipo entero.
fr: Les enums doivent être déclarés en tant que type intégral.
it: Le enumerazioni devono essere dichiarate come tipo integrale.
ja: Enum は整数型として宣言されなければなりません。
ko: 열거형은 정수 계열 형식으로 선언해야 합니다.
pl: Wyliczenia należy deklarować jako typ całkowity.
pt_br: Enums devem ser declarados como tipo integral.
ru: Перечисления должны объявляться как целочисленный тип.
tr: Sabit listeleri tam sayı türünde bildirilmelidir.
zh_hans: 枚举必须声明为整型。
zh_hant: 列舉必須宣告為整數類資料類型。

# ERR_ByRefIllegal1
source: {0} parameters cannot be declared 'ByRef'.
cs: Pro parametry {0} nejde použít deklaraci ByRef.
de: {0}-Parameter können nicht als "ByRef" deklariert werden.
es: Los parámetros {0} no se pueden declarar como 'ByRef'.
fr: Les paramètres {0} ne peuvent pas être déclarés 'ByRef'.
it: I parametri '{0}' non possono essere dichiarati come 'ByRef'.
ja: {0} パラメーターを 'ByRef' として宣言することはできません。
ko: {0} 매개 변수는 'ByRef'로 선언할 수 없습니다.
pl: Parametrów {0} nie można deklarować jako „ByRef”.
pt_br: {0} parâmetros não podem ser declarados "ByRef".
ru: параметры {0} не могут быть объявлены как "ByRef".
tr: {0} parametreleri 'ByRef' olarak bildirilemez.
zh_hans: {0} 参数不能声明为“ByRef”。
zh_hant: {0} 參數不可宣告為 'ByRef'。

# ERR_UnreferencedAssembly3
source: Reference required to assembly '{0}' containing the type '{1}'. Add one to your project.
cs: Vyžaduje se odkaz na sestavení {0} obsahující typ {1}. Přidejte ho do projektu.
de: Es ist ein Verweis auf die Assembly "{0}" erforderlich, die den Typ "{1}" enthält. Fügen Sie dem Projekt einen Verweis hinzu.
es: Es necesaria una referencia al ensamblado '{0}' que contiene el tipo '{1}'. Agregue una al proyecto.
fr: Une référence à l'assembly '{0}' contenant le type '{1}' est requise. Ajoutez-en une à votre projet.
it: È necessario il riferimento all'assembly '{0}' contenente il tipo '{1}'. Aggiungerne uno al progetto.
ja: 型 '{1}' を含むアセンブリ '{0}' への参照が必要です。参照をプロジェクトに追加してください。
ko: '{1}' 형식을 포함하는 '{0}' 어셈블리에 대한 참조를 찾을 수 없습니다. 프로젝트에 추가하세요.
pl: Wymagane odwołanie do zestawu „{0}” z typem „{1}”. Dodaj je do projektu.
pt_br: Referência necessária para o assembly "{0}" contendo o tipo "{1}". Adicione uma ao seu projeto.
ru: Для модуля "{0}" требуется сборка, содержащая тип "{1}". Добавьте одну из них в проект.
tr: '{1}' türünü içeren '{0}' derlemesine başvuru gerekiyor. Projenize bir başvuru ekleyin.
zh_hans: 需要对程序集“{0}”(包含类型“{1}”)的引用。请在项目中添加一个。
zh_hant: 組件 '{0}' (包含類型 '{1}') 需要參考。請在您的專案中加入一個參考。

# ERR_UnreferencedModule3
source: Reference required to module '{0}' containing the type '{1}'. Add one to your project.
cs: Vyžaduje se odkaz na modul {0} obsahující typ {1}. Přidejte ho do projektu.
de: Es ist ein Verweis auf das Modul "{0}" erforderlich, das den Typ "{1}" enthält. Fügen Sie dem Projekt einen Verweis hinzu.
es: Es necesaria una referencia al módulo '{0}' que contiene el tipo '{1}'. Agregue una al proyecto.
fr: Une référence au module '{0}' contenant le type '{1}' est requise. Ajoutez-en une à votre projet.
it: È necessario il riferimento al modulo '{0}' contenente il tipo '{1}'. Aggiungerne uno al progetto.
ja: 型 '{1}' を含むモジュール '{0}' への参照が必要です。参照をプロジェクトに追加してください。
ko: '{1}' 형식을 포함하는 '{0}' 모듈에 대한 참조를 찾을 수 없습니다. 프로젝트에 추가하세요.
pl: Wymagane odwołanie do modułu „{0}” z typem „{1}”. Dodaj je do projektu.
pt_br: Referência necessária para o módulo "{0}" contendo o tipo "{1}". Adicione uma ao seu projeto.
ru: Для модуля "{0}" требуется ссылка, содержащая тип "{1}". Добавьте одну из них в проект.
tr: '{1}' türünü içeren '{0}' modülüne başvuru gerekiyor. Projenize bir başvuru ekleyin.
zh_hans: 需要对模块“{0}”(包含类型“{1}”)的引用。请在项目中添加一个。
zh_hant: 模組 '{0}' (包含類型 '{1}') 需要參考。請在您的專案中加入一個參考。

# ERR_ReturnWithoutValue
source: 'Return' statement in a Function, Get, or Operator must return a value.
cs: 'Příkaz Return v proceduře Function, Get nebo Operator musí vracet hodnotu.
de: 'Eine Return-Anweisung in "Function", "Get" oder "Operator" muss einen Wert zurückgeben.
es: 'Una instrucción 'Return' en Function, Get u Operator debe devolver un valor.
fr: 'L'instruction 'Return' dans un Function, Get ou Operator doit retourner une valeur.
it: 'L'istruzione 'Return' all'interno di un elemento Function, Get o Operator deve restituire un valore.
ja: 'Function、Get、または Operator の 'Return' ステートメントは、値を返さなければなりません。
ko: 'Function, Get 또는 Operator의 'Return' 문은 값을 반환해야 합니다.
pl: 'Instrukcja Return w bloku Function, Get lub Operator musi zwracać wartość.
pt_br: 'Instrução 'Return' em Function, Get, ou Operator deve retornar um valor.
ru: 'Оператор "Return" в Function, Get или Operator должен возвращать значение.
tr: 'Function, Get veya Operator içindeki 'Return' deyimi değer döndürmelidir.
zh_hans: 'Function、Get 或 Operator 中的 "Return" 语句必须返回值。
zh_hant: '在 Function、Get 或 Operator 中的 'Return' 陳述式必須傳回值。

# ERR_UnsupportedField1
source: Field '{0}' is of an unsupported type.
cs: Pole {0} je nepodporovaného typu.
de: Der Typ des Felds "{0}" wird nicht unterstützt.
es: El campo '{0}' es de un tipo no admitido.
fr: Le champ '{0}' est d'un type non pris en charge.
it: Il campo '{0}' è di tipo non supportato.
ja: フィールド '{0}' の型はサポートされていません。
ko: '{0}' 필드는 지원되지 않는 형식입니다.
pl: Pole „{0}” jest nieobsługiwanego typu.
pt_br: Campo "{0}" é de um tipo sem suporte.
ru: Поле "{0}" относится к неподдерживаемому типу.
tr: '{0}' alanı desteklenmeyen türde.
zh_hans: 字段“{0}”的类型不受支持。
zh_hant: 欄位 '{0}' 是不支援的類型。

# ERR_UnsupportedMethod1
source: '{0}' has a return type that is not supported or parameter types that are not supported.
cs: 'Typ vrácené hodnoty procedury {0} není podporovaný nebo nejsou podporované typy parametrů.
de: '"{0}" hat einen Rückgabetyp oder Parametertypen, die nicht unterstützt werden.
es: 'El tipo de valor devuelto o los tipos de parámetros de '{0}' no se admiten.
fr: '{0}' a un type de retour ou des types de paramètres non pris en charge.
it: '{0}' contiene un tipo restituito non supportato o tipi di parametri non supportati.
ja: '{0}' には、サポートされていない戻り値の型か、またはサポートされていないパラメーター型が指定されています。
ko: '{0}'에 지원되지 않는 반환 형식 또는 지원되지 않는 매개 변수 형식이 있습니다.
pl: 'Element „{0}” ma nieobsługiwany typ zwracany albo nieobsługiwane typy parametrów.
pt_br: "{0}" tem um tipo de retorno que não é suportado ou tipos de parâmetro que não são suportados.
ru: "{0}" имеет возвращаемый тип или типы параметров, которые не поддерживаются.
tr: '{0}' öğesinin desteklenmeyen bir dönüş türü veya desteklenmeyen tür parametreleri var.
zh_hans: '“{0}”有不受支持的返回类型或不受支持的参数类型。
zh_hant: '{0}' 含有不支援的傳回類型或多個不支援的參數類型。

# ERR_NoNonIndexProperty1
source: Property '{0}' with no parameters cannot be found.
cs: Vlastnost {0} bez parametrů se nenašla.
de: Die {0}-Eigenschaft ohne Parameter wurde nicht gefunden.
es: No se encuentra la propiedad '{0}' sin parámetros.
fr: Impossible de trouver la propriété '{0}' sans paramètre.
it: La proprietà {0} senza parametri non è stata trovata.
ja: パラメーターなしのプロパティ '{0}' が見つかりません。
ko: 매개 변수가 없는 '{0}' 속성을 찾을 수 없습니다.
pl: Nie można odnaleźć właściwości „{0}” bez parametrów.
pt_br: Propriedade "{0}" sem parâmetros não pode ser encontrada.
ru: Не удается найти свойство "{0}" без параметров.
tr: Parametresi olmayan '{0}' özelliği bulunamadı.
zh_hans: 无法找到不带参数的属性“{0}”。
zh_hant: 找不到不含有參數的屬性 '{0}'。
