Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ExpectedEndRegion
source: '#Region' statement must end with a matching '#End Region'.
cs: 'Příkaz #Region musí být ukončený párovým příkazem #End Region.
de: '"#Region" muss mit einem entsprechenden "#End Region" abgeschlossen werden.
es: 'La instrucción '#Region' debe terminar con la instrucción '#End Region' correspondiente.
fr: 'L'instruction '#Region' doit se terminer par un '#End Region' correspondant.
it: 'L'istruzione '#Region' deve terminare con un elemento '#End Region' corrispondente.
ja: '#Region' ステートメントの終わりには、対応する '#End Region' を指定しなければなりません。
ko: '#Region' 문은 짝이 되는 '#End Region'으로 끝나야 합니다.
pl: 'Instrukcja #Region musi być zakończona odpowiadającą jej instrukcją #End Region.
pt_br: 'A instrução '#Region' deve terminar com um '#End Region' correspondente.
ru: 'Оператор "#Region" должен заканчиваться соответствующим оператором "#End Region".
tr: '#Region' deyimi eşleşen bir '#End Region' ile bitmelidir.
zh_hans: '"#Region" 语句必须以匹配的 "#End Region" 结束。
zh_hant: '#Region' 之後必須搭配相對應的 '#End Region'。

# ERR_InheritsStmtWrongOrder
source: 'Inherits' statement must precede all declarations in a class.
cs: 'Příkaz Inherits musí předcházet před všemi deklaracemi v rámci třídy.
de: 'Inherits-Anweisungen müssen vor allen Deklarationen in der Klasse stehen.
es: 'La instrucción 'Inherits' debe preceder a todas las declaraciones de una clase.
fr: 'L'instruction 'Inherits' doit précéder toutes les déclarations dans une classe.
it: 'L'istruzione 'Inherits' deve precedere tutte le dichiarazioni in una classe.
ja: 'Inherits' ステートメントは、クラス内のすべての宣言の前に記述しなければなりません。
ko: 'Inherits' 문은 클래스의 모든 선언 앞에 와야 합니다.
pl: 'Instrukcja „Inherits” musi znajdować się przed wszystkimi deklaracjami w klasie.
pt_br: 'A instrução 'Inherits' deve preceder todas as declarações em uma classe.
ru: 'Оператор "Inherits" должен предшествовать всем объявлениям в классе.
tr: 'Inherits' deyimi sınıf içindeki tüm bildirimlerden önce gelmelidir.
zh_hans: '“Inherits”语句必须位于类中的所有声明之前。
zh_hant: 'Inherits' 陳述式必須在類別中所有宣告之前。

# ERR_AmbiguousAcrossInterfaces3
source: '{0}' is ambiguous across the inherited interfaces '{1}' and '{2}'.
cs: 'Název {0} je nejednoznačný ve zděděných rozhraních {1} a {2}.
de: '"{0}" ist innerhalb der geerbten Schnittstellen "{1}" und "{2}" mehrdeutig.
es: '{0}' es ambiguo en las interfaces heredadas '{1}' y '{2}'.
fr: '{0}' est ambigu entre les interfaces héritées '{1}' et '{2}'.
it: '{0}' è ambiguo nelle interfacce ereditate '{1}' e '{2}'.
ja: '{0}' は、継承インターフェイス '{1}' と '{2}' のどちらなのかがあいまいです。
ko: '{0}'이(가) 상속된 인터페이스 '{1}' 및 '{2}'에서 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny w obrębie odziedziczonych interfejsów „{1}” i „{2}”.
pt_br: "{0}" é ambíguo nas interfaces herdadas "{1}" e "{2}".
ru: '"Неоднозначность: "{0}" относится к наследуемым интерфейсам "{1}" и "{2}".
tr: '{0}', devralınmış '{1}' ve '{2}' arabirimleri arasında belirsiz.
zh_hans: '“{0}”在继承接口“{1}”和“{2}”之间不明确。
zh_hant: '跨繼承介面 '{1}' 和 '{2}' 的 '{0}' 模稜兩可。

# ERR_DefaultPropertyAmbiguousAcrossInterfaces4
source: Default property access is ambiguous between the inherited interface members '{0}' of interface '{1}' and '{2}' of interface '{3}'.
cs: Zděděné členy {0} rozhraní {1} a členy {2} rozhraní {3} mají nejednoznačný přístup k výchozím vlastnostem.
de: Der Standardeigenschaftenzugriff ist nicht eindeutig. Es kann sich um den geerbten Schnittstellenmember "{0}" der Schnittstelle "{1}" oder "{2}" der Schnittstelle "{3}" handeln.
es: Hay un acceso de propiedad predeterminado ambiguo entre los miembros de interfaz heredados '{0}' de la interfaz '{1}' y '{2}' de la interfaz '{3}'.
fr: L'accès à la propriété par défaut est ambigu entre les membres '{0}' de l'interface héritée '{1}' et '{2}' de l'interface '{3}'.
it: L'accesso a una proprietà predefinita è ambiguo tra i membri di interfaccia ereditati '{0}' dell'interfaccia '{1}' e '{2}' dell'interfaccia '{3}'.
ja: Default プロパティ アクセスは、インターフェイス '{1}' の継承インターフェイス メンバー '{0}' とインターフェイス '{3}' の '{2}' との間で不適切です。
ko: 기본 속성 액세스가 '{1}' 인터페이스의 상속된 인터페이스 멤버 '{0}'과(와) '{3}' 인터페이스의 상속된 인터페이스 멤버 '{2}' 사이에서 모호합니다.
pl: Dostęp do właściwości domyślnej jest niejednoznaczny dla dziedziczonej składowej „{0}” interfejsu „{1}” i dziedziczonej składowej „{2}” interfejsu „{3}”.
pt_br: Acesso à propriedade padrão é ambíguo entre os membros de interface herdados "{0}" da interface "{1}" e "{2}" da interface "{3}".
ru: Неоднозначность при доступе к свойству по умолчанию между членами "{0}" наследуемого интерфейса "{1}" и "{2}" интерфейса "{3}".
tr: '{1}' arabiriminin devralınan '{0}' arabirim üyeleriyle '{3}' arabiriminin '{2}' üyeleri arasında varsayılan özellik erişimi belirsiz.
zh_hans: 默认属性访问在接口“{1}”的继承接口成员“{0}”和接口“{3}”的继承接口成员“{2}”之间不明确。
zh_hant: 在介面 '{1}' 的繼承介面成員 '{0}' 以及介面 '{3}' 的 '{2}' 之間，預設屬性存取模稜兩可。

# ERR_InterfaceEventCantUse1
source: Events in interfaces cannot be declared '{0}'.
cs: Pro události v rozhraní nejde použít deklaraci {0}.
de: Ereignisse in Schnittstellen können nicht als "{0}" deklariert werden.
es: Los eventos de las interfaces no se pueden declarar como '{0}'.
fr: Les événements des interfaces ne peuvent pas être déclarés '{0}'.
it: Gli eventi nelle interfacce non possono essere dichiarati come '{0}'.
ja: インターフェイスのイベントを、'{0}' として宣言することはできません。
ko: 인터페이스의 이벤트는 '{0}'(으)로 선언할 수 없습니다.
pl: Zdarzenia w interfejsach nie mogą być zadeklarowane jako „{0}”.
pt_br: Eventos em interfaces não podem ser declarados "{0}".
ru: События в интерфейсах не могут объявляться как "{0}".
tr: Arabirimlerdeki olaylar '{0}' olarak bildirilemez.
zh_hans: 接口中的事件无法声明为“{0}”。
zh_hant: 介面中的事件不可宣告為 '{0}'。

# ERR_ExecutableAsDeclaration
source: Statement cannot appear outside of a method body.
cs: Příkaz se nemůže objevit mimo tělo metody.
de: Die Anweisung darf nicht außerhalb eines Methodenkörpers verwendet werden.
es: La instrucción no puede aparecer fuera de un cuerpo de método.
fr: Cette instruction ne peut pas apparaître en dehors du corps d'une méthode.
it: L'istruzione non può essere specificata all'esterno di un corpo del metodo.
ja: ステートメントをメソッド本体の外側に置くことはできません。
ko: 문은 메서드 본문 외부에 사용할 수 없습니다.
pl: Instrukcja nie może wystąpić poza treścią metody.
pt_br: Instrução não pode aparecer fora do corpo de um método.
ru: Оператор не может находиться вне тела метода.
tr: Deyim, yöntem gövdesinin dışında yer alamaz.
zh_hans: 语句不能出现在方法主体外。
zh_hant: 陳述式不可出現在方法主體之外。

# ERR_StructureNoDefault1
source: Structure '{0}' cannot be indexed because it has no default property.
cs: Strukturu {0} nejde indexovat, protože nemá žádnou výchozí vlastnost.
de: Die Struktur "{0}" kann nicht indiziert werden, da sie keine Standardeigenschaft hat.
es: No se puede indizar la estructura '{0}' porque no tiene ninguna propiedad predeterminada.
fr: La structure '{0}' ne peut pas être indexée, car elle n'a pas de propriété par défaut.
it: La struttura '{0}' non può essere indicizzata perché non contiene proprietà predefinite.
ja: 構造体 '{0}' には既定のプロパティがないため、インデックス処理を実行できません。
ko: '{0}' 구조체는 기본 속성이 없으므로 인덱싱될 수 없습니다.
pl: Nie można indeksować struktury „{0}”, ponieważ nie ma ona domyślnej właściwości.
pt_br: Estrutura "{0}" não pode ser indexada porque não tem nenhuma propriedade padrão.
ru: Структуру "{0}" нельзя проиндексировать, так как не имеет свойства по умолчанию.
tr: '{0}' yapısının varsayılan özelliği olmadığından yapı dizine alınamıyor.
zh_hans: 无法为结构“{0}”编制索引，因为它没有默认属性。
zh_hant: 無法對結構 '{0}' 編製索引，因為其無預設屬性。

# ERR_MustShadow2
source: {0} '{1}' must be declared 'Shadows' because another member with this name is declared 'Shadows'.
cs: {0} – {1} musí být deklarovaný jako Shadows, protože jiný člen s tímto názvem je deklarovaný jako Shadows.
de: {0} "{1}" muss als "Shadows" deklariert werden, da ein anderer Member mit diesem Namen als "Shadows" deklariert ist.
es: {0} '{1}' se debe declarar como 'Shadows' porque otro miembro con este nombre está declarado como 'Shadows'.
fr: {0} '{1}' doit être déclaré 'Shadows', car un autre membre avec ce nom est déclaré 'Shadows'.
it: {0} '{1}' deve essere dichiarato come 'Shadows' perché un altro membro con lo stesso nome è dichiarato come 'Shadows'.
ja: この名前で別のメンバーが 'Shadows' として宣言されているため、{0} '{1}' は 'Shadows' として宣言されなければなりません。
ko: 이름이 같은 다른 멤버가 'Shadows'로 선언되었으므로 {0} '{1}'은(는) 'Shadows'로 선언해야 합니다.
pl: Element {0} „{1}” musi być zadeklarowany jako „Shadows”, ponieważ inna składowa o tej samej nazwie jest zadeklarowana jako „Shadows”.
pt_br: {0} "{1}" deve ser declarado "Shadows" porque outro membro com esse nome está declarado "Shadows".
ru: {0} "{1}" должна быть объявлена как "Shadows", потому что другой член с таким именем объявлен как "Shadows".
tr: Bu ada sahip başka bir üye 'Shadows' olarak bildirildiğinden, {0} '{1}' 'Shadows' olarak bildirilmelidir.
zh_hans: {0}“{1}”必须声明为“Shadows”，因为具有此名称的另一个成员被声明为“Shadows”。
zh_hant: {0} '{1}' 必須宣告為 'Shadows'，因為使用此名稱的另一個成員已宣告為 'Shadows'。

# ERR_OverrideWithOptionalTypes2
source: '{0}' cannot override '{1}' because they differ by the types of optional parameters.
cs: '{0} nemůže přepsat {1}, protože se liší typy nepovinných parametrů.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch optionale Parametertypen unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en los tipos de parámetros opcionales.
fr: '{0}' ne peut pas se substituer à '{1}', car les types des paramètres optionnels les différencient.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i tipi di parametri facoltativi.
ja: '省略可能なパラメーターの型において異なるため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '선택적 매개 변수의 형식이 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się typami parametrów opcjonalnych.
pt_br: "{0}" não pode substituir "{1}" porque diferem pelos tipos de parâmetros opcionais.
ru: "{0}" не может переопределить "{1}", так как они отличаются по типам необязательных параметров.
tr: 'İsteğe bağlı parametrelerinin türleri farklı olduğundan '{0}', '{1}' öğesini geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在可选参数类型上存在差异。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其選擇性參數類型不同。

# ERR_ExpectedEndOfExpression
source: End of expression expected.
cs: Očekával se konec výrazu.
de: Ausdrucksende erwartet.
es: Se esperaba el fin de una expresión.
fr: Fin d'expression attendue.
it: È prevista la fine dell'espressione.
ja: 式の終わりが必要です。
ko: 식의 끝이 필요합니다.
pl: Oczekiwano końca wyrażenia.
pt_br: Fim da expressão esperado.
ru: Ожидался конец выражения.
tr: İfade sonu bekleniyor.
zh_hans: 应为表达式结尾。
zh_hant: 必須是運算式結尾。

# ERR_StructsCannotHandleEvents
source: Methods declared in structures cannot have 'Handles' clauses.
cs: Metody deklarované ve strukturách nemůžou obsahovat klauzule Handles.
de: In Strukturen deklarierte Methoden können keine Handles-Klauseln haben.
es: Los métodos declarados en estructuras no pueden tener cláusulas 'Handles'.
fr: Les méthodes déclarées dans des structures ne peuvent pas comporter de clauses 'Handles'.
it: I metodi dichiarati nelle strutture non possono avere clausole 'Handles'.
ja: 構造体で宣言されたメソッドに 'Handles' 句を指定することはできません。
ko: 구조체에 선언된 메서드에는 'Handles' 절을 사용할 수 없습니다.
pl: Metody zadeklarowane w strukturach nie mogą mieć klauzul Handles.
pt_br: Métodos declarados em estruturas não podem ter cláusulas 'Handles'.
ru: Методы, объявляемые в структурах, не могут содержать предложения "Handles".
tr: Yapıların içinde bildirilen yöntemlerde 'Handles' yan tümceleri olamaz.
zh_hans: 结构中声明的方法不能有 "Handles" 子句。
zh_hant: 結構中宣告的方法不能有 'Handles' 子句。

# ERR_OverridesImpliesOverridable
source: Methods declared 'Overrides' cannot be declared 'Overridable' because they are implicitly overridable.
cs: Pro metody s deklarací Overrides nejde použít deklaraci Overridable, protože už jsou přepsatelné.
de: Methoden, die als "Overrides" deklariert sind, können nicht als "Overridable" deklariert werden, da sie implizit überschreibbar sind.
es: Los métodos declarados 'Overrides' no se pueden declarar 'Overridable' porque se pueden invalidar implícitamente.
fr: Les méthodes déclarées 'Overrides' ne peuvent pas être déclarées 'Overridable', car elles sont implicitement substituables.
it: I metodi dichiarati come 'Overrides' non possono essere dichiarati come 'Overridable' perché sono implicitamente sottoponibili a override.
ja: Overrides' として宣言されているメソッドを 'Overridable' として宣言することはできません。これらのメソッドは暗黙的にオーバーライド可能です。
ko: Overrides'로 선언된 메서드는 암시적으로 재정의할 수 있으므로 'Overridable'로 선언할 수 없습니다.
pl: Metody zadeklarowane jako „Overrides” nie mogą być zadeklarowane jako „Overridable”, ponieważ niejawnie są one możliwe do przesłonięcia.
pt_br: Métodos declarados 'Overrides' não podem ser declarados 'Overridable' porque eles são implicitamente substituíveis.
ru: Методы, объявленные оператором "Overrides", не могут объявляться как "Overridable", поскольку возможность их переопределения подразумевается неявно.
tr: Overrides' olarak bildirilen yöntemler, örtük olarak geçersiz kılınabilir olduklarından 'Overridable' olarak bildirilemez.
zh_hans: 声明为 "Overrides" 的方法是隐式可重写的，因此它们不能声明为 "Overridable"。
zh_hant: 宣告為 'Overrides' 的方法無法宣告為 'Overridable'，因為它們可以被隱含地覆寫。

# ERR_LocalNamedSameAsParam1
source: '{0}' is already declared as a parameter of this method.
cs: '{0} už je deklarovaný jako parametr této metody.
de: '"{0}" ist bereits als Parameter dieser Methode deklariert.
es: '{0}' ya se declaró como parámetro de este método.
fr: '{0}' est déjà déclaré en tant que paramètre de cette méthode.
it: '{0}' è già dichiarato come parametro di questo metodo.
ja: '{0}' は、このメソッドへのパラメーターとして既に宣言されています。
ko: '{0}'이(가) 이 메서드의 매개 변수로 이미 선언되었습니다.
pl: 'Element „{0}” jest już zadeklarowany jako parametr tej metody.
pt_br: "{0}" já está declarado como um parâmetro deste método.
ru: "{0}" уже объявлена как параметр этого метода.
tr: '{0}' bu yöntemin bir parametresi olarak önceden bildirildi.
zh_hans: '“{0}”已声明为此方法的参数。
zh_hant: '{0}' 已經宣告為此方法的參數。

# ERR_LocalNamedSameAsParamInLambda1
source: Variable '{0}' is already declared as a parameter of this or an enclosing lambda expression.
cs: Proměnná {0} je už deklarovaná jako parametr tohoto nebo nadřazeného výrazu lambda.
de: Die Variable "{0}" ist bereits als Parameter dieses oder eines einschließenden Lambdaausdrucks deklariert.
es: La variable '{0}' ya está declarada como un parámetro de esta o de una expresión lambda envolvente.
fr: La variable '{0}' est déjà déclarée en tant que paramètre de cet élément ou en tant qu'expression lambda englobante.
it: La variabile '{0}' è già stata dichiarata come parametro di questa o di un'espressione lambda di inclusione.
ja: 変数 '{0}' は、この式またはそれを囲むラムダ式のパラメーターとして既に宣言されています。
ko: '{0}' 변수가 이미 이 항목의 매개 변수 또는 바깥쪽 람다 식으로 선언되어 있습니다.
pl: Zmienna „{0}” jest już zadeklarowana jako parametr tego lub otaczającego wyrażenia lambda.
pt_br: Variável "{0}" já está declarada como um parâmetro desta ou de uma expressão lambda delimitadora.
ru: Переменная "{0}" уже объявлена как параметр этого или внешнего лямбда-выражения.
tr: '{0}' değişkeni zaten bunun veya kapsayan bir lambda ifadesinin parametresi olarak bildirilmiş.
zh_hans: 变量“{0}”已声明为此 lambda 表达式或某个封闭 lambda 表达式的参数。
zh_hant: 變數 '{0}' 已宣告為此運算式或封閉式 Lambda 運算式的參數。

# ERR_ModuleCantUseTypeSpecifier1
source: Type in a Module cannot be declared '{0}'.
cs: Pro typ v modulu nejde použít deklaraci {0}.
de: Ein Typ in einem Modul kann nicht als "{0}" deklariert werden.
es: Un tipo de un módulo no se puede declarar como '{0}'.
fr: Un type dans un module ne peut pas être déclaré '{0}'.
it: Il tipo in un modulo non può essere dichiarato come '{0}'.
ja: モジュール内の型を '{0}' に宣言することはできません。
ko: 모듈의 형식은 '{0}'(으)로 선언할 수 없습니다.
pl: Typ w module nie może być zadeklarowany jako „{0}”.
pt_br: Tipo em um Módulo não pode ser declarado "{0}".
ru: Тип в модуле не может объявляться как "{0}".
tr: Modül içindeki tür '{0}' olarak bildirilemez.
zh_hans: 模块中的类型不能声明为“{0}”。
zh_hant: Module 中的類型不可宣告為 '{0}'。

# ERR_InValidSubMainsFound1
source: No accessible 'Main' method with an appropriate signature was found in '{0}'.
cs: V aplikaci {0} se nenašla žádná dostupná metoda Main s odpovídajícím podpisem.
de: Es wurde keine zugreifbare Main-Methode mit entsprechender Signatur in "{0}" gefunden.
es: No se encontró ningún método 'Main' accesible con una firma apropiada en '{0}'.
fr: Aucune méthode 'Main' accessible avec une signature appropriée n'a été trouvée dans '{0}'.
it: In '{0}' non è stato trovato un metodo 'Main' accessibile con una firma appropriata.
ja: 正しいシグネチャを持つ、アクセス可能な 'Main' メソッドは、'{0}' に見つかりませんでした。
ko: '{0}'에 적절한 시그니처가 있는 액세스 가능한 'Main' 메서드가 없습니다.
pl: W elemencie „{0}” nie odnaleziono dostępnej metody „Main” z odpowiednią sygnaturą.
pt_br: Nenhum método "Main" acessível com uma assinatura apropriada foi encontrado em "{0}".
ru: В "{0}" не найдено доступного метода "Main" с подходящей сигнатурой.
tr: '{0}' içinde uygun imzaya sahip, erişilebilir bir 'Main' yöntemi bulunamadı.
zh_hans: “{0}”中找不到带有适当签名的可访问“Main”方法。
zh_hant: 在 '{0}' 中找不到具有適當簽章的可存取 'Main' 方法。

# ERR_MoreThanOneValidMainWasFound2
source: 'Sub Main' is declared more than once in '{0}': {1}
cs: 'Procedura Sub Main je v oboru názvů {0} deklarovaná víc než jednou: {1}.
de: '"Sub Main" wird in "{0}" mehrmals deklariert: {1}
es: 'Sub Main' se declaró más de una vez en '{0}': {1}
fr: 'Sub Main' est déclaré plusieurs fois dans '{0}' : {1}
it: 'Sub Main' è dichiarato più volte in '{0}': {1}
ja: 'Sub Main' が '{0}' で複数回宣言されています: {1}
ko: '{0}'에서 'Sub Main'을 두 번 이상 선언했습니다({1}).
pl: 'Element „Sub Main” zadeklarowano więcej niż raz w elemencie „{0}”: {1}
pt_br: "Sub Main" está declarado mais de uma vez em "{0}": {1}
ru: '"Sub Main" объявлен в "{0}" более одного раза: {1}
tr: 'Sub Main' '{0}' içinde birden çok kez bildiriliyor: {1}
zh_hans: '在“{0}”中多次声明了“Sub Main”: {1}
zh_hant: '在 '{0}' 中已重複宣告 'Sub Main': {1}

# ERR_CannotConvertValue2
source: Value '{0}' cannot be converted to '{1}'.
cs: Hodnotu {0} nejde převést na {1}.
de: Der Wert "{0}" kann nicht in "{1}" konvertiert werden.
es: El valor '{0}' no se puede convertir en '{1}'.
fr: Impossible de convertir la valeur '{0}' en '{1}'.
it: Non è possibile convertire il valore '{0}' in '{1}'.
ja: 値 '{0}' を '{1}' に変換できません。
ko: '{0}' 변수는 '{1}'(으)로 변환할 수 없습니다.
pl: Wartości „{0}” nie można skonwertować na typ „{1}”.
pt_br: Valor "{0}" não pode ser convertido em "{1}".
ru: Значение "{0}" нельзя преобразовать в "{1}".
tr: '{0}' değeri, '{1}' olarak dönüştürülemez.
zh_hans: 值“{0}”无法转换为“{1}”。
zh_hant: 值 '{0}' 無法轉換成 '{1}'。

# ERR_OnErrorInSyncLock
source: 'On Error' statements are not valid within 'SyncLock' statements.
cs: 'Příkazy On Error nejsou platné uvnitř příkazů SyncLock.
de: '"On Error"-Anweisungen sind innerhalb von SyncLock-Anweisungen nicht gültig.
es: 'Las instrucciones 'On Error' no son válidas dentro de instrucciones 'SyncLock'.
fr: 'Les instructions 'On Error' ne sont pas valides dans les instructions 'SyncLock'.
it: 'Le istruzioni 'On Error' non sono valide all'interno di istruzioni 'SyncLock'.
ja: 'On Error' ステートメントは、'SyncLock' ステートメント内では有効ではありません。
ko: 'On Error' 문은 'SyncLock' 문 안에서 사용할 수 없습니다.
pl: 'Instrukcje On Error nie są prawidłowe w instrukcjach SyncLock.
pt_br: 'Instruções 'On Error' não são válidas dentro de instruções 'SyncLock'.
ru: 'Операторы "On Error" в теле оператора "SyncLock" недопустимы.
tr: 'On Error' deyimleri 'SyncLock' deyimlerinin içinde geçerli değildir.
zh_hans: '"On Error" 语句在 "SyncLock" 语句内无效。
zh_hant: 'SyncLock' 陳述式中的 'On Error' 陳述式無效。

# ERR_NarrowingConversionCollection2
source: Option Strict On disallows implicit conversions from '{0}' to '{1}'; the Visual Basic 6.0 collection type is not compatible with the .NET Framework collection type.
cs: Direktiva Option Strict On zakazuje implicitní převod {0} na {1}. Typ kolekce jazyka Visual Basic 6.0 není kompatibilní s typem kolekce platformy .NET Framework.
de: "Option Strict On" lässt keine impliziten Konvertierungen von "{0}" in "{1}" zu. Der Visual Basic 6.0-Sammlungstyp ist mit dem .NET Framework-Sammlungstyp nicht kompatibel.
es: Option Strict On no permite conversiones implícitas de '{0}' a '{1}'; el tipo de colección de Visual Basic 6.0 no es compatible con el tipo de colección de .NET Framework.
fr: Option Strict On interdit les conversions implicites de '{0}' en '{1}' ; le type de collection de Visual Basic 6.0 n'est pas compatible avec le type de collection du .NET Framework.
it: Option Strict On non consente conversioni implicite da '{0}' a '{1}'. Il tipo raccolta di Visual Basic 6.0 non è compatibile con il tipo raccolta di .NET Framework.
ja: Option Strict On では '{0}' から '{1}' への暗黙的な変換は許可されていません。Visual Basic 6.0 のコレクション型は .NET Framework のコレクション型と互換性がありません。
ko: Option Strict On에서는 '{0}'에서 '{1}'(으)로 암시적으로 변환할 수 없습니다. Visual Basic 6.0의 컬렉션 형식은 .NET Framework의 컬렉션 형식과 호환되지 않습니다.
pl: Ustawienie „Option Strict On” uniemożliwia niejawną konwersję z elementu „{0}” na „{1}”. Typ kolekcji języka Visual Basic 6.0 nie jest zgodny z typem kolekcji .NET Framework.
pt_br: Option Strict On não permite conversões implícitas de "{0}" para "{1}"; o tipo de coleção Visual Basic 6.0 não é compatível com o tipo de coleção do .NET Framework.
ru: Option Strict On не разрешает неявные преобразования "{0}" к "{1}"; тип коллекции Visual Basic 6.0 несовместим с типом коллекции .NET Framework.
tr: Option Strict On, '{0}' - '{1}' örtük dönüştürmelerine izin vermiyor; Visual Basic 6.0 koleksiyon türü, .NET Framework koleksiyon türüyle uyumlu değil.
zh_hans: Option Strict On 不允许从“{0}”到“{1}”的隐式转换；Visual Basic 6.0 集合类型与 .NET Framework 集合类型不兼容。
zh_hant: Option Strict 為 On 時，不可進行 '{0}' 至 '{1}' 的隱含轉換。Visual Basic 6.0 集合類型與 .NET Framework 集合類型不相容。

# ERR_GotoIntoTryHandler
source: 'GoTo {0}' is not valid because '{0}' is inside a 'Try', 'Catch' or 'Finally' statement that does not contain this statement.
cs: 'Příkaz GoTo {0} není platný, protože návěstí {0} je uvnitř příkazu Try, Catch nebo Finally, který tento příkaz neobsahuje.
de: '"GoTo {0}" ist ungültig, da "{0}" sich innerhalb einer Try-, Catch- oder Finally-Anweisung befindet, die diese Anweisung nicht enthält.
es: 'GoTo {0}' no es válida porque '{0}' está dentro de una instrucción 'Try', 'Catch' o 'Finally' que no contiene esta instrucción.
fr: 'GoTo {0}' n'est pas valide, car '{0}' se trouve à l'intérieur d'une instruction 'Try', 'Catch' ou 'Finally' qui ne contient pas cette instruction.
it: 'GoTo {0}' non è valida perché '{0}' si trova all'interno di un'istruzione 'Try', 'Catch' o 'Finally' che non contiene questa istruzione.
ja: '{0}' は、このステートメントを含まない 'Try'、'Catch' または 'Finally' ステートメントの内側にあるため、'GoTo {0}' は有効ではありません。
ko: '{0}'이(가) 이 문을 포함하지 않는 'Try', 'Catch' 또는 'Finally' 문 내부에 있기 때문에 'GoTo {0}'은(는) 유효하지 않습니다.
pl: 'Instrukcja „GoTo {0}” jest nieprawidłowa, ponieważ element „{0}” znajduje się wewnątrz instrukcji „Try”, „Catch” lub „Finally”, która nie zawiera tej instrukcji.
pt_br: "GoTo {0}" não é válido porque "{0}" está dentro de uma instrução "Try", "Catch" ou "Finally" que não contém essa instrução.
ru: 'Недопустимый оператор "GoTo {0}", поскольку "{0}" находится в теле оператора "Try", "Catch" или "Finally", не содержащего данный оператор.
tr: '{0}', bu deyimi içermeyen bir 'Try', 'Catch' veya 'Finally' deyiminin içinde yer aldığından, 'GoTo {0}' geçerli değil.
zh_hans: '“GoTo {0}”语句无效，因为“{0}”位于不包含此语句的“Try”、“Catch”或“Finally”语句中。
zh_hant: 'GoTo {0}' 無效，因為 '{0}' 位於不包含此陳述式的 'Try'、'Catch' 或 'Finally' 陳述式內。
