Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_VBCHelp
source: Visual Basic Compiler Options - OUTPUT FILE - -out:<file> Specifies the output file name. -target:exe Create a console application (default). (Short form: -t) -target:winexe Create a Windows application. -target:library Create a library assembly. -target:module Create a module that can be added to an assembly. -target:appcontainerexe Create a Windows application that runs in AppContainer. -target:winmdobj Create a Windows Metadata intermediate file -doc[+|-] Generates XML documentation file. -doc:<file> Generates XML documentation file to <file>. -refout:<file> Reference assembly output to generate - INPUT FILES - -addmodule:<file_list> Reference metadata from the specified modules -link:<file_list> Embed metadata from the specified interop assembly. (Short form: -l) -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications. -reference:<file_list> Reference metadata from the specified assembly. (Short form: -r) -analyzer:<file_list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. - RESOURCES - -linkresource:<resinfo> Links the specified file as an external assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -linkres) -nowin32manifest The default manifest should not be embedded in the manifest section of the output PE. -resource:<resinfo> Adds the specified file as an embedded assembly resource. resinfo:<file>[,<name>[,public|private]] (Short form: -res) -win32icon:<file> Specifies a Win32 icon file (.ico) for the default Win32 resources. -win32manifest:<file> The provided file is embedded in the manifest section of the output PE. -win32resource:<file> Specifies a Win32 resource file (.res). - CODE GENERATION - -optimize[+|-] Enable optimizations. -removeintchecks[+|-] Remove integer checks. Default off. -debug[+|-] Emit debugging information. -debug:full Emit full debugging information (default). -debug:pdbonly Emit full debugging information. -debug:portable Emit cross-platform debugging information. -debug:embedded Emit cross-platform debugging information into the target .dll or .exe. -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -nowarn Disable all warnings. -nowarn:<number_list> Disable a list of individual warnings. -warnaserror[+|-] Treat all warnings as errors. -warnaserror[+|-]:<number_list> Treat a list of warnings as errors. -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics in SARIF format. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -define:<symbol_list> Declare global conditional compilation symbol(s). symbol_list:name=value,... (Short form: -d) -imports:<import_list> Declare global Imports for namespaces in referenced metadata files. import_list:namespace,... -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `default` (latest major version), or `latest` (latest version, including minor versions), or specific versions like `14` or `15.3` -optionexplicit[+|-] Require explicit declaration of variables. -optioninfer[+|-] Allow type inference of variables. -rootnamespace:<string> Specifies the root Namespace for all type declarations. -optionstrict[+|-] Enforce strict language semantics. -optionstrict:custom Warn when strict language semantics are not respected. -optioncompare:binary Specifies binary-style string comparisons. This is the default. -optioncompare:text Specifies text-style string comparisons. - MISCELLANEOUS - -help Display this usage message. (Short form: -?) -noconfig Do not auto-include VBC.RSP file. -nologo Do not display compiler copyright banner. -quiet Quiet output mode. -verbose Display verbose messages. -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<number> The base address for a library or module (hex). -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<number> Specifies the codepage to use when opening source files. -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key. -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key. -errorreport:<string> Specifies how to handle internal compiler errors; must be prompt, send, none, or queue (default). -generatedfilesout:<dir> Place files generated during compilation in the specified directory. -filealign:<number> Specify the alignment used for output file sections. -highentropyva[+|-] Enable high-entropy ASLR. -keycontainer:<string> Specifies a strong name key container. -keyfile:<file> Specifies a strong name key file. -libpath:<path_list> List of directories to search for metadata references. (Semi-colon delimited.) -main:<class> Specifies the Class or Module that contains Sub Main. It can also be a Class that inherits from System.Windows.Forms.Form. (Short form: -m) -moduleassemblyname:<string> Name of the assembly which this module will be a part of. -netcf Target the .NET Compact Framework. -nostdlib Do not reference standard libraries (system.dll and VBC.RSP file). -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -platform:<string> Limit which platforms this code can run on; must be x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred or anycpu (default). -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -reportivts[+|-] Output information on all IVTs granted to this assembly by all dependencies, and annotate foreign assembly accessibility errors with what assembly they came from. -sdkpath:<path> Location of the .NET Framework SDK directory (mscorlib.dll). -subsystemversion:<version> Specify subsystem version of the output PE. version:<number>[.<number>] -utf8output[+|-] Emit compiler output in UTF-8 character encoding. @<file> Insert command-line settings from a text file -vbruntime[+|-|*] Compile with/without the default Visual Basic runtime. -vbruntime:<file> Compile with the alternate Visual Basic runtime in <file>.
it: Opzioni del compilatore Visual Basic - FILE DI OUTPUT - -out:<file> Specifica il nome del file di output. -target:exe Crea un'applicazione console (impostazione predefinita). Forma breve: -t -target:winexe Crea un'applicazione Windows. -target:library Crea un assembly di librerie. -target:module Crea un modulo che può essere aggiunto a un assembly. -target:appcontainerexe Crea un'applicazione Windows che viene eseguita in AppContainer. -target:winmdobj Crea file intermedio di metadati di Windows -doc[+|-] Genera un file di documentazione XML. -doc:<file> Genera un file di documentazione XML in <file>. -refout:<file> Output dell'assembly di riferimento da generare - FILE DI INPUT - -addmodule:<file_list> Crea un riferimento ai metadati dai moduli specificati -link:<file_list> Incorpora metadati dall'assembly di interoperabilità specificato. Forma breve: -l -recurse:<wildcard> Include tutti i file presenti nella directory corrente e nelle relative sottodirectory in base ai caratteri jolly specificati. -reference:<file_list> Crea un riferimento ai metadati dal file di assembly specificato. Forma breve: -r -analyzer:<file_list> Esegue gli analizzatori dall'assembly Forma breve: -a -additionalfile:<file list> File aggiuntivi che non influiscono direttamente sulla generazione del codice ma possono essere usati dagli analizzatori per produrre errori o avvisi. - RISORSE - -linkresource:<resinfo> Collega il file specificato come risorsa di assembly incorporata. resinfo:<file>[,<name>[,public|private]] Forma breve: -linkres -nowin32manifest Il manifesto predefinito non deve essere incorporato nella sezione manifesto del file PE di output. -resource:<resinfo> Aggiunge il file specificato come risorsa di assembly incorporata. resinfo:<file>[,<name>[,public|private]] Forma breve: -res -win32icon:<file> Consente di specificare un file di icona Win32 (.ico) per le risorse Win32 predefinite. -win32manifest:<file> Il file fornito è incorporato nella sezione manifesto del file PE di output. -win32resource:<file> Consente di specificare un file di risorse Win32 (.res). - GENERAZIONE DEL CODICE - -optimize[+|-] Abilita le ottimizzazioni. -removeintchecks[+|-] Rimuove il controllo dei numeri interi. Per impostazione predefinita, è disattivato. -debug[+|-] Crea le informazioni di debug. -debug:full Crea le informazioni di debug complete (impostazione predefinita). -debug:pdbonly Crea le informazioni di debug complete. -debug:portable Crea informazioni di debug multipiattaforma. -debug:embedded Crea informazioni di debug multipiattaforma nel file DLL o EXE di destinazione. -deterministic Produce un assembly deterministico (che include GUID e timestamp della versione del modulo) -refonly Produce un assembly di riferimento al posto dell'output principale -instrument:TestCoverage Produce un assembly instrumentato per raccogliere informazioni sulla copertura -sourcelink:<file> Informazioni sul collegamento all'origine da incorporare nel file PDB. - ERRORI E AVVISI - -nowarn Disabilita tutti gli avvisi. -nowarn:<number_list> Disabilita un elenco di avvisi singoli. -warnaserror[+|-] Considera tutti gli avvisi come errori. -warnaserror[+|-]:<number_list> Considera un elenco di avvisi come errori. -ruleset:<file> Consente di specificare un file di set di regole che disabilita diagnostica specifica. -errorlog:<file>[,version=<sarif_version>] Consente di specificare un file in cui registrare tutte le diagnostiche del compilatore e dell'analizzatore in formato SARIF. sarif_version:{1|2|2.1} L'impostazione predefinita è 1. 2 e 2.1 si riferiscono entrambi a SARIF versione 2.1.0. -reportanalyzer Restituisce informazioni aggiuntive dell'analizzatore, ad esempio il tempo di esecuzione. -skipanalyzers[+|-] Ignora l'esecuzione degli analizzatore diagnostici. - LINGUAGGIO - -define:<symbol_list> Dichiara simboli di compilazione condizionale. symbol_list:name=value,... Forma breve: -d -imports:<import_list> Dichiara importazioni globali per spazi dei nomi in file di metadati a cui viene fatto riferimento. import_list:namespace,... -langversion:? Visualizza i valori consentiti per la versione del linguaggio -langversion:<string> Consente di specificare la versione del linguaggio, ad esempio 'default' (ultima versione principale) o 'latest' (ultima versione che include versioni secondarie) o versioni specifiche come '14' o '15.3' -optionexplicit[+|-] Richiede la dichiarazione esplicita delle variabili. -optioninfer[+|-] Consente l'inferenza del tipo delle variabili. -rootnamespace:<string> Consente di specificare lo spazio dei nomi radice per tutti i tipi di dichiarazioni. -optionstrict[+|-] Attiva la semantica del linguaggio strict. -optionstrict:custom Avvisa quando la semantica del linguaggio strict non viene rispettata. -optioncompare:binary Consente di specificare i confronti fra stringhe binarie. Impostazione predefinita. -optioncompare:text Consente di specificare i confronti fra stringhe di testo. - VARIE - -help Visualizza questo messaggio relativo alla sintassi. Forma breve: -? -noconfig Non include automaticamente il file VBC.RSP. -nologo Non visualizza le informazioni sul copyright del compilatore. -quiet Modalità di output non interattiva. -verbose Visualizza messaggi dettagliati. -parallel[+|-] Compilazione simultanea. -version Visualizza il numero di versione del compilatore ed esce. - AVANZATE - -baseaddress:<number> Indirizzo di base di una libreria o di un modulo (hex). -checksumalgorithm:<alg> Consente di specificare l'algoritmo per calcolare il checksum del file di origine archiviato nel file PDB. I valori supportati sono: SHA1 o SHA256 (impostazione predefinita). -codepage:<number> Consente di specificare la tabella codici da usare all'apertura dei file di origine. -delaysign[+|-] Ritarda la firma dell'assembly usando solo la parte pubblica della della chiave con nome sicuro. -publicsign[+|-] Firma pubblicamente l'assembly usando solo la parte pubblica della chiave con nome sicuro. -errorreport:<string> Consente di specificare come gestire gli errori interni del compilatore. I valori devono essere prompt, send, none o queue (impostazione predefinita). -generatedfilesout:<dir> Inserisce i file generati durante la compilazione nella directory specificata. -filealign:<number> Consente di specificare l'allineamento usato per le sezioni del file di output. -highentropyva[+|-] Abilita ASLR a entropia elevata. -keycontainer:<string> Consente di specificare un contenitore di chiavi con nome sicuro. -keyfile:<file> Consente di specificare un file di chiave con nome sicuro. -libpath:<path_list> Elenco di directory in cui cercare riferimenti ai metadati. (Delimitato da punto e virgola). -main:<class> Consente di specificare la classe o il modulo che contiene Sub Main. Può essere anche una classe che eredita da System.Windows.Forms.Form. Forma breve: -m -moduleassemblyname:<string> Nome dell'assembly di cui farà parte questo modulo. -netcf Destinato a .NET Compact Framework. -nostdlib Omette i riferimenti alle librerie standard (file system.dll eVBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Consente di specificare un mapping per i nomi di percorso di origine visualizzati dal compilatore. -platform:<string> Limita le piattaforme in cui è possibile eseguire questo codice. Il valore deve essere x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred o anycpu (impostazione predefinita). -preferreduilang Consente di specificare il nome del linguaggio di output preferito. -nosdkpath Disabilita la ricerca di assembly di librerie standard nel percorso predefinito dell'SDK. -reportivts[+|-] Restituisce informazioni su tutti i tipi di I/O concessi a questo assembly da tutte le dipendenze e annota gli errori di accessibilità dell'assembly esterno da cui provengono. -sdkpath:<path> Percorso della directory di .NET Framework SDK (mscorlib.dll). -subsystemversion:<version> Consente di specificare la versione del sottosistema del file PE di output. version:<number>[.<number>] -utf8output[+|-] Crea l'output del compilatore con codifica dei caratteri UTF8. @<file> Inserisce le impostazioni della riga di comando da un file di testo -vbruntime[+|-|*] Compila con/senza il runtime di Visual Basic predefinito. -vbruntime:<file> Compila con il runtime di Visual Basic alternativo in <file>.
ko: Visual Basic 컴파일러 옵션 - 출력 파일 - -out:<file> 출력 파일 이름을 지정합니다. -target:exe 콘솔 애플리케이션을 만듭니다(기본값). (약식: -t) -target:winexe Windows 애플리케이션을 만듭니다. -target:library 라이브러리 어셈블리를 만듭니다. -target:module 어셈블리에 추가할 수 있는 모듈을 만듭니다. -target:appcontainerexe AppContainer에서 실행되는 Windows 애플리케이션을 만듭니다. -target:winmdobj Windows 메타데이터 중간 파일을 만듭니다. -doc[+|-] XML 문서 파일을 생성합니다. -doc:<file> XML 문서 파일을 <file>(으)로 생성합니다. -refout:<file> 다음을 생성하기 위한 참조 어셈블리 - 입력 파일 - -addmodule:<file_list> 지정된 모듈의 참조 메타데이터 -link:<file_list> 지정한 interop 어셈블리의 메타데이터를 참조합니다. (약식: -l) -recurse:<wildcard> 현재 디렉터리 및 하위 디렉터리의 모든 파일을 와일드카드 사양에 따라 포함합니다. -reference:<file_list> 지정한 어셈블리 파일에서 메타데이터를 참조합니다. (약식: -r) -analyzer:<file_list> 이 어셈블리에서 분석기 실행 (약식: -a) -additionalfile:<file list> 코드 생성에 직접 영향을 주지 않지만 오류 경고를 생성하기 위해 분석기에 사용되는 추가 파일입니다. - RESOURCES - -linkresource:<resinfo> 지정된 파일을 외부 어셈블리 리소스로 파일을 추가합니다. resinfo:<file>[,<name>[,public|private]] (약식: -linkres) -nowin32manifest 기본 매니페스트를 출력 PE의 매니페스트 섹션에 포함시키면 안됩니다. -resource:<resinfo> 지정된 파일을 어셈블리 리소스로 추가합니다. resinfo:<file>[,<name>[,public|private]] (약식: -res) -win32icon:<file> 기본 Win32 리소스용 Win32 아이콘 파일(.ico)을 지정합니다. -win32manifest:<file> 제공된 파일이 출력 PE의 매니페스트 섹션에 포함되었습니다. -win32resource:<file> Win32 리소스 파일(.res)을 지정합니다. - 코드 생성 - -optimize[+|-] 최적화를 사용하도록 설정합니다. -removeintchecks[+|-] 정수 검사를 제거합니다. 기본값을 해제합니다. -debug[+|-] 디버깅 정보를 내보냅니다. -debug:full 전체 디버깅 정보를 내보냅니다(기본값). -debug:pdbonly 전체 디버깅 정보를 내보냅니다. -debug:portable 플랫폼 간 디버깅 정보를 내보냅니다. -debug:embedded 플랫폼 간 디버깅 정보를 대상 .dll 또는 .exe로 내보냅니다. -deterministic 결정적 어셈블리 생성 (모듈 버전 GUID 및 타임스탬프 포함) -refonly 주 출력 대신 참조 어셈블리 생성 -instrument:TestCoverage 검사 정보를 수집하도록 사용될 어셈블리 생성 -sourcelink:<file> PDB에 포함할 원본 링크 정보입니다. - 오류 및 경고 - -nowarn 모든 경고를 사용하지 않도록 설정합니다. -nowarn:<number_list> 개별 경고 목록을 사용하지 않도록 설정합니다. -warnaserror[+|-] 모든 경고를 오류로 처리합니다. -warnaserror[+|-]:<number_list> 경고 목록을 오류로 처리합니다. -ruleset:<file> 특정 진단을 사용하지 않도록 설정하는 규칙 집합 파일을 지정합니다. -errorlog:<file>[,version=<sarif_version>] 모든 컴파일러 및 분석기의 진단을 SARIF 형식으로 기록하기 위해 파일을 지정합니다. sarif_version:{1|2|2.1} 기본값은 1. 2과 2.1이며 둘 다 SARIF 버전 2.1.0을 의미합니다. -reportanalyzer 실행 시간과 같은 추가 분석기 정보를 보고합니다. -skipanalyzers[+|-] 진단 분석기 실행을 건너뜁니다. -언어- -define:<symbol_list> 전역 조건부 컴파일 기호를 선언합니다. symbol_list:name=value,... (약식: -d) -imports:<import_list> 참조한 메타데이터 파일의 네임스페이스에 대해 전역 가져오기를 선언합니다. import_list:namespace,... -langversion:? 언어 버전에 허용되는 값을 표시합니다. -langversion:<string> 다음과 같이 언어 버전을 지정합니다. 'default'(최신 주 버전), 또는 'latest'(부 버전을 포함한 최신 버전), 또는 특정 버전(예: '14' 또는 '15.3') -optionexplicit[+|-] 변수의 명시적 선언이 필요합니다. -optioninfer[+|-] 변수의 형식 유추를 허용합니다. -rootnamespace:<string> 모든 형식 선언에 대한 루트 네임스페이스를 지정합니다. -optionstrict[+|-] 언어 의미 체계를 엄격하게 확인합니다. -optionstrict:custom 엄격한 언어 의미 체계를 준수하지 않을 경우 경고합니다. -optioncompare:binary 이진 형식 문자열 비교를 지정합니다. 기본값입니다. -optioncompare:text 텍스트 형식 문자열 비교를 지정합니다. - 기타 - -help 사용법 메시지를 표시합니다. (약식: -?) -noconfig 파일을 자동으로 포함하지 않습니다. -nologo 컴파일러 저작권 배너를 표시하지 않습니다. -quiet 자동 출력 모드입니다. -verbose 자세한 메시지를 표시합니다. -parallel[+|-] 동시 빌드입니다. -version 컴파일러 버전 번호를 표시하고 종료합니다. - 고급 - -baseaddress:<number> 라이브러리 또는 모듈의 기준 주소입니다 (16진수). -checksumalgorithm:<alg> PBD에 저장된 소스 파일 체크섬을 계싼하기 위한 알고리즘을 지정합니다. 지원되는 값은 다음과 같습니다. SHA1 또는 SHA256(기본값)입니다. -codepage:<number> 소스 파일을 열 때 사용할 코드 페이지를 지정합니다. -delaysign[+|-] 강력한 이름의 키의 공개 부분만 사용하여 어셈블리 서명을 공개적으로 진행합니다. -publicsign[+|-] 강력한 이름의 키의 공개 부분만 사용하여 어셈블리 서명을 공개적으로 진행합니다. -errorreport:<string> 내부 컴파일러 오류를 처리하는 방법을 지정합니다. 이는 프롬프트, 보내기, 없음 또는 큐(기본값)여야 합니다. -generatedfilesout:<dir> 지정된 디렉터리에 컴파일 중 생성된 파일을 이동합니다. -filealign:<number> 출력 파일 섹션에 사용되는 맞춤을 지정합니다. -highentropyva[+|-] 높은 엔트로피 ASLR을 사용하도록 설정합니다. -keycontainer:<string> 강력한 이름의 키 컨테이너를 지정합니다. -keyfile:<file> 강력한 이름의 키 파일을 지정합니다. -libpath:<path_list> 메타데이터 참조를 검색할 디렉터리 목록입니다. (세미콜론으로 구분됨) -main:<class> Sub Main을 포함하는 클래스 또는 모듈을 지정합니다. System.Windows.Forms.Form를 상속하는 Class도 가능합니다. (약식: -m) -moduleassemblyname:<string> 이 모듈이 속할 어셈블리의 이름입니다. -netcf .NET Compact Framework를 지정하세요. -nostdlib 표준 라이브러리를 참조하지 마세요 (system.dll 및 VBC. RSP 파일). -pathmap:<K1>=<V1>,<K2>=<V2>,... 컴파일러를 이용하여 원본 경로 이름 출력의 매핑을 구체화합니다. -platform:<string> 이 코드를 실행할 수 있는 플랫폼을 제한합니다. x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred 또는 anycpu(기본값)이어야 합니다. -preferreduilang 기본 출력 언어 이름을 지정합니다. -nosdkpath 표준 라이브러리 어셈블리의 기본 SDK 경로 검색을 사용하지 않도록 설정합니다. -reportivts[+|-] 여기에 부여된 모든 IVT에 대한 출력 정보 모든 종속 항목에 의한 어셈블리 및 외부 어셈블리 주석 어떤 어셈블리에서 왔는지에 대한 접근성 오류 -sdkpath:<path> .NET Framework SDK 디렉터리 위치 (mscorlib.dll). -subsystemversion:<version> 출력 PE의 하위 시스템 버전을 지정하세요. 버전:<number>[.<number>] -utf8output[+|-] UTF8 문자 인코딩으로 컴파일러 출력을 내보냅니다. @<file> 텍스트 파일에서 명령줄 설정을 삽입합니다. -vbruntime[+|-|*] 기본 Visual Basic 런타임을 사용하거나 사용하지 않고 컴파일합니다. -vbruntime:<file> <file>에서 대체 Visual Basic 런타임을 사용하여 컴파일합니다.
pl: Opcje kompilatora Visual Basic - PLIK WYJŚCIOWY - -out:<file> Określa nazwę pliku wyjściowego. -target:exe Tworzenie aplikacji konsoli (domyślne). (skrócona postać: -t) -target:winexe Tworzenie aplikacji systemu Windows. -target:library Tworzenie zestawu biblioteki. -target:module Tworzenie modułu, który można dodać do zestawu. -target:appcontainerexe Tworzenie aplikacji systemu Windows, która działa w środowisku AppContainer. -target:winmdobj Tworzenie pośredniego pliku metadanych systemu Windows -doc[+|-] Generowanie pliku dokumentacji XML. -doc:<file> Generowanie pliku dokumentacji XML w pliku <file>. -refout:<file> Odwołanie do danych wyjściowych zestawu do wygenerowania - PLIKI WEJŚCIOWE - -addmodule:<file_list> Metadane odwołania z określonych modułów -link:<file_list> Osadzone metadane z określonego zestawu międzyoperacyjności. (skrócona postać: -l) -recurse:<wildcard> Uwzględnianie wszystkich plików w bieżącym katalogu i podkatalogach zgodnie z specyfikacjami symboli wieloznacznych. -reference:<file_list> Metadane odwołania z określonego elementu zestawu. (skrócona postać: -r) -analyzer:<file_list> Uruchamianie analizatorów z tego zestawu (skrócona postać: -a) -additionalfile:<file list> Dodatkowe pliki, które nie mają bezpośredniego wpływu na generowanie kodu, ale mogą być używane przez analizatory do generowania błędów i ostrzeżeń. - ZASOBY - -linkresource:<resinfo> Łączy określony plik jako zewnętrzny zasób zestawu. resinfo:<file>[,<name>[,public|private]] (skrócona postać: -linkres) -nowin32manifest Manifest domyślny nie powinien być osadzony w sekcji manifestu wyjściowego środowiska PE. -resource:<resinfo> Dodaje określony plik jako osadzony zasób zestawu. resinfo:<file>[,<name>[,public|private]] (Krótka postać: -res) -win32icon:<file> Określa plik ikony Win32 (.ico) dla domyślnych zasobów Win32. -win32manifest:<file> Podany plik jest osadzony w sekcji manifestu wyjściowego środowiska PE. -win32resource:<file> Określa plik zasobów Win32 (.res) - GENEROWANIE KODU - -optimize[+|-] Włączanie optymalizacji. -removeintchecks[+|-] Usuwanie testów liczb całkowitych. Wartość domyślna jest wyłączona. -debug[+|-] Emitowanie informacji o debugowaniu. -debug:full Emitowanie pełnych informacji o debugowaniu (domyślnie). -debug:pdbonly Emitowanie pełnych informacji o debugowaniu. -debug:portable Emitowanie informacji o debugowaniu międzyplatformowym. -debug:embedded Emitowanie informacji o debugowaniu międzyplatformowym do docelowego pliku dll lub exe. -deterministic Generowanie zestawu deterministycznego (w tym identyfikatora GUID i sygnatury czasowa wersji modułu) -refonly Tworzenie zestawu referencyjnego zamiast głównego wyjścia -instrument:TestCoverage Tworzenie zestawu instrumentowanego do zbierania informacji o pokryciach -sourcelink:<file> Informacje o linku źródłowym, aby osadzić w pliku PDB. - BŁĘDY I OSTRZEŻENIA - -nowarn Wyłączanie wszystkich ostrzeżeń. -nowarn:<number_list> Wyłączanie listy poszczególnych ostrzeżeń. -warnaserror[+|-] Traktowanie wszystkich ostrzeżeń jako błędy. -warnaserror[+|-]:<number_list> Traktowanie listy ostrzeżeń jako błędy. -ruleset:<file> Określanie pliku zestawu reguł, który wyłącza określoną diagnostykę. -errorlog:<file>[,version=<sarif_version>] Określanie pliku do rejestrowania pełnej diagnostyki kompilatora i analizatora w formacie SARIF. sarif_version:{1|2|2.1} Wartość domyślna to 1. 2 i 2.1, obie oznaczające wersję SARIF 2.1.0. -reportanalyzer Raportowanie dodatkowych informacji analizatora, takich jak czas wykonania. -skipanalyzers[+|-] Pomijanie wykonywania analizatorów diagnostycznych. - JĘZYK - -define:<symbol_list> Deklarowanie globalnych symboli kompilacji warunkowej. symbol_list:name=value,... (skrócona postać: -d) -imports:<import_list> Deklarowanie globalnych importów dla przestrzeni nazw w przywoływanych plików metadanych. import_list:namespace,... -langversion:? Wyświetlanie dozwolonych wartości dla wersji językowej -langversion:<string> Określanie wersji języka, na przykład „default” (najnowsza wersja główna) lub „latest” (najnowsza wersja, w tym wersje pomocnicze), albo dokładnych wersji, takich jak „14” lub „15.3” -optionexplicit[+|-] Wymaganie jawnej deklaracji zmiennych. -optioninfer[+|-] Zezwalanie na wnioskowanie o typie zmiennych. -rootnamespace:<string> Określanie głównej przestrzeni nazw dla wszystkich deklaracji typów. -optionstrict[+|-] Wymuszanie ścisłej semantyki języka. -optionstrict:custom Ostrzeganie w sytuacji, gdy ścisła semantyka języka nie jest przestrzegana. -optioncompare:binary Określa porównania ciągów w stylu binarnym. Jest to ustawienie domyślne. -optioncompare:text Określa porównania ciągów w stylu tekstu. - RÓŻNE - -help Wyświetlanie tego komunikatu dotyczące użycia. (skrócona postać: -?) -noconfig Nie dołączaj automatycznie pliku VBC.RSP. -nologo Nie wyświetlaj transparentu kompilatora z informacjami o prawach autorskich. -quiet Cichy tryb wyjściowy. -verbose Wyświetlanie szczegółowych komunikatów. -parallel[+|-] Współbieżna kompilacja. -version Wyświetlanie numeru wersji kompilatora i wyjście. - ZAAWANSOWANE - -baseaddress:<number> Adres podstawowy biblioteki lub modułu (szestnastkowy). -checksumalgorithm:<alg> Określanie algorytmu obliczania sumy kontrolnej pliku źródłowego przechowywanego w pliku PDB. Obsługiwane wartości to: SHA1 lub SHA256 (domyślna). -codepage:<number> Określanie strony kodowej do użycia podczas otwierania plików źródłowych. -delaysign[+|-] Podpisywanie z opóźnieniem zestawu tylko przy użyciu publicznego fragmentu silnego klucza nazwy. -publicsign[+|-] Podpisywanie publiczne zestawu tylko przy użyciu publicznego fragmentu silnego klucza nazwy. -errorreport:<string> Określanie sposobu obsługi wewnętrznych błędów kompilatora; musi być monitem, wysyłaniem, brakiem lub kolejką (domyślne). -generatedfilesout:<dir> Umieszczanie plików wygenerowanych podczas kompilacji w określonym katalogu. -filealign:<number> Określanie wyrównania używanego dla sekcji pliku wyjściowego. -highentropyva[+|-] Włączanie funkcji ASLR o wysokiej entropii. -keycontainer:<string> Określa kontener silnych kluczy nazw. -keyfile:<file> Określa plik silnego klucza nazwy. -libpath:<path_list> Lista katalogów do wyszukania odwołań metadanych. (rozdzielone średnikami). -main:<class> Określa klasę lub moduł zawierający Sub Main. Może to być również klasa, która dziedziczy z elementu System.Windows.Forms.Form. (skrócona postać: -m) -moduleassemblyname:<string> Nazwa zestawu, którego częścią będzie ten moduł. -netcf Wskazywanie docelowe platformy .NET Compact Framework. -nostdlib Nie odwołuj się do bibliotek standardowych (plik system.dll i VBC.RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Określanie mapowania dla wyjścia nazw ścieżek źródłowych przez kompilatora. -platform:<string> Ograniczanie platform, na których można uruchomić ten kod; musi być x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred lub anycpu (domyślna). -preferreduilang Określanie preferowanej nazwy języka wyjściowego. -nosdkpath Wyłączanie wyszukiwania domyślnej ścieżki zestawu SDK dla zestawów bibliotek standardowych. -reportivts[+|-] Informacje dotyczące danych wyjściowych o wszystkich plikach IVT przyznanych temu zestawowi przez wszystkie zależności i adnotowanie błędów dotyczących dostępności zestawu, z którego one pochodzą. -sdkpath:<path> Lokalizacja katalogu zestawu .NET Framework SDK (mscorlib.dll) (mscorlib.dll). -subsystemversion:<version> Określanie wersji podsystemu wyjściowego środowiska PE. version:<number>[.<number>] -utf8output[+|-] Emitowanie danych wyjściowych kompilatora w kodowaniu znaków UTF-8. @<file> Wstawianie ustawień wiersza polecenia z pliku tekstowego -vbruntime[+|-|*] Kompilowanie z/bez domyślnego środowiska uruchomieniowego języka Visual Basic. -vbruntime:<file> Kompilowanie z alternatywnym środowiskiem uruchomieniowym języka Visual Basic w pliku <file>.
ru: Параметры компилятора Visual Basic - ВЫХОДНОЙ ФАЙЛ - -out:<file> Задает имя выходного файла. -target:exe Создать консольное приложение (по умолчанию). (Краткая форма: -t) -target:winexe Создать приложение для Windows. -target:library Создать библиотечную сборку. -target:module Создать модуль, который может быть добавлен в сборку. -target:appcontainerexe Создать приложение для Windows, выполняемое в AppContainer. -target:winmdobj Создать промежуточный файл метаданных Windows -doc[+|-] Создает XML-файл документации. -doc:<файл> Создает XML-файл документации <file>. -refout:<файл> Указать выходные данные сборки для создания - ВХОДНЫЕ ФАЙЛЫ - -addmodule:<список_файлов> Указать метаданные из заданных модулей -link:<список_файлов> Внедрять метаданные из указанной сборки взаимодействия. (Краткая форма: -l) -recurse:<подстановочный знак> Включить все файлы в текущем каталоге и подкаталогах в соответствии со спецификациями подстановочных знаков. -reference:<список_файлов> Указать метаданные из указанной сборки. (Краткая форма: -r) -analyzer:<список_файлов> Запустить анализаторы из этой сборки (Краткая форма: -а) -additionalfile:<список_файлов> Дополнительные файлы, которые не влияют непосредственно на создание кода но которые могут использоваться анализаторами для создания ошибок и предупреждений. - РЕСУРСЫ - -linkresource:<resinfo> Связывает указанный файл как внешний сборочный ресурс. resinfo: <файл>[,<имя>[,общедоступный|частный]] (Краткая форма: -linkres) -nowin32manifest Манифест по умолчанию не должен быть внедрен в раздел манифеста выходного PE. -resource:<resinfo> Добавляет указанный файл как внедренный сборочный ресурс. resinfo: <файл>[,<имя>[,общедоступный|частный]] (Краткая форма: -res) -win32icon:<файл> Задает файл значка win32icon (.ico) для ресурсов Win32 по умолчанию. -win32manifest:<файл> Предоставленный файл внедрен в раздел манифеста выходного PE. -win32resource:<файл> Задает файл ресурсов Win32 (.res). - ГЕНЕРАЦИЯ КОДА - -optimize[+|-] Включить оптимизацию. -removeintchecks[+|-] Удалить целочисленные проверки. По умолчанию отключено. -debug[+|-] Выдавать отладочные сведения. -debug:full Выдавать полные отладочные сведения (по умолчанию). -debug:pdbonly Выдавать полные отладочные сведения. -debug:portable Выдавать кроссплатформенную информацию отладки. -debug:embedded Выдавать кроссплатформенную информацию отладки в целевой .dll или .exe. -deterministic Создать детерминированную сборку (включая GUID версии модуля и метку времени) -refonly Создать базовую сборку в качестве основного вывода -instrument:TestCoverage Создать сборку, оснащенную для сбора сведений об охвате -sourcelink:<файл> Сведения об исходной ссылке для встраивания в PDB. - ОШИБКИ И ПРЕДУПРЕЖДЕНИЯ - -nowarn Отключить все предупреждения. -nowarn:<список_чисел> Отключить список индивидуальных предупреждений. -warnaserror[+|-] Обрабатывать все предупреждения как ошибки. -warnaserror[+|-]:<список_чисел> Обрабатывать все предупреждения как ошибки. -ruleset:<файл> Указать файл набора правил, который отключает определенную диагностику. -errorlog:<file>[,version=<sarif_version>] Укажите файл для регистрации всего компилятора и анализатора диагностики в формате SARIF. sarif_version:{1|2|2.1} По умолчанию 1. 2 и 2.1 оба означают SARIF версии 2.1.0. -reportanalyzer Сообщить дополнительные сведения об анализаторе, например время выполнения. -skipanalyzers[+|-] Пропустить выполнение диагностических анализаторов. - ЯЗЫК - -define:<список_символов> Объявить глобальные символы условной компиляции. символ(ы). список_символов:имя=значение,... (Краткая форма: -d) -imports:<список_импорта> Объявить глобальные импорты для пространств имен в указанных файлах метаданных. import_list:namespace,... -langversion:? Показать допустимые значения для языковой версии -langversion:<строка> Указать версию языка, например `по умолчанию` (последняя основная версия) или `latest` (последняя версия, включая дополнительные версии), или специальные версии, такие как «14» или «15.3» -optionexplicit[+|-] Требовать явного объявления переменных. -optioninfer[+|-] Разрешить определение типа переменных. -rootnamespace:<строка> Корневое пространство имен для всех типов деклараций. optionstrict[+|-] Принудительное применение строгой семантики языка. -optionstrict:custom Предупреждать, если строгая семантика не соблюдается. -optioncompare:binary Задает сравнение строк в двоичном формате. Это значение по умолчанию. -optioncompare:text Задает сравнение строк в виде текста. - РАЗНОЕ - -help Отображать сообщение об использовании. (Краткая форма: -?) -noconfig Не включать в состав файл VBC.RSP автоматически. -nologo Не отображать баннер компилятора со сведениями об авторских правах. -quiet Режим вывода без сообщений. -verbose Показать подробные сообщения. -parallel[+|-] Параллельная сборка. -version Показать номер версии компилятора и выйти. - РАСШИРЕННЫЙ - -baseaddress:<число> Базовый адрес библиотеки или модуля (шестнадцатеричный). -checksumalgorithm:<alg> Указать алгоритм вычисления контрольной суммы исходного файла, хранящегося в PDB. Поддерживаемые значения: SHA1 или SHA256 (по умолчанию). -codepage:<число> Указывает кодовую страницу, используемую при открытии исходных файлов. -delaysign[+|-] Отложенная подпись сборки с использованием только общедоступной части ключа строгого имени. -publicsign[+|-] Открытое подписание сборки с использованием только общедоступной части ключа строгого имени. -errorreport:<строка> Указать порядок обработки внутренних ошибок компилятора; допустимые значения: prompt, send, none или queue (по умолчанию). -generatedfilesout:<dir> Разместить файлы, созданные во время компиляции, в указанный каталог. -filealign:<число> Указать выравнивание для секций выходного файла. -highentropyva[+|-] Включить ASLR с высокой энтропией. -keycontainer:<строка> Указывает контейнер ключа строгого имени. -keyfile:<файл> Указывает файл ключа строгого имени. -libpath:<список_путей> Список каталогов для поиска ссылок на метаданные. (Разделитель — точка с запятой.) -main:<класс> Указывает класс или модуль, содержащий Sub Main. Это также может быть класс, который наследуется от System.Windows.Forms.Form. (Краткая форма: -m) -moduleassemblyname:<строка> Имя сборки, частью которой будет данный модуль. -netcf Целевая среда — .NET Compact Framework. -nostdlib Не ссылаться на стандартные библиотеки (system.dll и файл VBC. RSP). -pathmap:<K1>=<V1>,<K2>=<V2>,... Укажите сопоставление для имен исходных путей, выводимых с помощью компилятора. -platform:<строка> Ограничить платформы, на которых может выполняться этот код; допустимые значения: x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred или любой процессор (по умолчанию). -preferreduilang Указать предпочитаемое имя языка вывода. -nosdkpath Отключить поиск стандартных сборок библиотек в пути SDK по умолчанию. -reportivts[+|-] Вывести информацию обо всех IVT, предоставленных этой сборке по всем зависимостям и и аннотировать ошибки доступности сторонних сборок с указанием того, из какой сборки они произошли. -sdkpath:<путь> Местоположение каталога .NET Framework SDK (mscorlib.dll). -subsystemversion:<версия> Указать версию подсистемы выходного PE-файла. версия:<номер>[.<номер>] -utf8output[+|-] Выдавать выходные данные компилятора в кодировке символов UTF-8. @<файл> Вставить параметры командной строки из текстового файла -vbruntime[+|-|*] Компиляция с/без среды выполнения Visual Basic по умолчанию. -vbruntime:<файл> Компилировать с альтернативной средой выполнения Visual Basic в <файл>.
tr: Visual Basic Derleyicisi Seçenekleri - ÇIKIŞ DOSYASI - -out:<file> Çıkış dosyası adını belirtir. -target:exe Konsol uygulaması oluşturur (varsayılan). (Kısa biçimi: -t) -target:winexe Windows uygulaması oluşturur. -target:library Kitaplık derlemesi oluşturur. -target:module Bir derlemeye eklenebilecek bir modül oluşturur. -target:appcontainerexe AppContainer içinde çalışan bir Windows uygulaması oluşturur. -target:winmdobj Bir Windows Meta Veri ara dosyası oluşturur -doc[+|-] XML belgeleri dosyası oluşturur. -doc:<file> <file> için XML belgeleri dosyası oluşturur. -refout:<file> Oluşturulacak başvuru derlemesi çıkışı - GİRİŞ DOSYALARI - -addmodule:<file_list> Belirtilen modüllerdeki başvuru meta verileri -link:<file_list> Belirtilen birlikte çalışma derlemesinden meta veri meta verileri. (Kısa biçimi: -l) -recurse:<wildcard> Joker karakter belirtimlerine göre geçerli dizindeki ve alt dizinlerdeki tüm dosyaları ekler. -reference:<file_list> Belirtilen derlemedeki başvuru meta verileri. (Kısa biçimi: -r) -analyzer:<file_list> Bu derlemedeki çözümleyicileri çalıştırır (Kısa biçimi: -a) -additionalfile:<file list> Kod oluşturmayı doğrudan etkilemeyen ancak hata veya uyarı üretimi için çözümleyiciler tarafından kullanılabilen ek dosyalar. - KAYNAKLAR - -linkresource:<resinfo> Belirtilen dosyayı bir dış derleme kaynağı olarak ekler. resinfo:<file>[,<name>[,public|private]] (Kısa biçimi: -linkres) -nowin32manifest Varsayılan bildirim çıkış PE’sinin bildirim bölümüne eklenmemeli. -resource:<resinfo> Belirtilen dosyayı ekli bir derleme kaynağı olarak ekler. resinfo:<file>[,<name>[,public|private]] (Kısa biçimi: -res) -win32icon:<file> Varsayılan Win32 kaynakları için bir Win32 simge dosyası (.ico) belirtir. -win32manifest:<file> Sağlanan dosya çıkış PE’sinin bildirim bölümüne eklenir. -win32resource:<file> Bir Win32 kaynak dosyası (.res) belirtir. - KOD OLUŞTURMA - -optimize[+|-] İyileştirmeleri etkinleştirir. -removeintchecks[+|-] Tamsayı denetimlerini kaldırır. Varsayılan olarak kapalıdır. -debug[+|-] Hata ayıklama bilgilerini gösterir. -debug:full Hata ayıklama bilgilerini tam gösterir (varsayılan). -debug:pdbonly Hata ayıklama bilgilerini tam gösterir. -debug:portable Farklı platformlardaki hata ayıklama bilgilerini gösterir. -debug:embedded Farklı platformlardaki hata ayıklama bilgilerini hedef .dll veya .exe dosyasında gösterir. -deterministic Belirlenimci bir derleme üretir (modül sürümü GUID'si ve zaman damgası dahil) -refonly Ana çıkış yerine bir başvuru derlemesi üretir -instrument:TestCoverage Kapsam bilgilerini toplamak için işaretlenmiş bir derleme üretir -sourcelink:<file> PDB dosyasına eklenecek kaynak bağlantısı bilgileri. - HATALAR VE UYARILAR - -nowarn Tüm uyarıları devre dışı bırakır. -nowarn:<number_list> Uyarıların bir kısmını devre dışı bırakır. -warnaserror[+|-] Tüm uyarıları hata olarak değerlendirir. -warnaserror[+|-]:<number_list> Uyarıların bir kısmını hata olarak değerlendirir. -ruleset:<file> Belirli tanılamaları devre dışı bırakan bir kural kümesi dosyası belirtir. -errorlog:<file>[,version=<sarif_version>] Tüm derleyici ve çözümleyici tanılamalarının SARIF biçiminde günlüğe kaydedilmesi için bir dosya belirtir. sarif_version:{1|2|2.1} Varsayılan olarak 1. 2 ve 2.1 Her ikisi ise 2.1.0 SARIF sürümünü ifade eder. -reportanalyzer Yürütme zamanı gibi ek çözümleyici bilgilerini raporlar. -skipanalyzers[+|-] Tanılama çözümleyicilerinin yürütülmesini atlar. - DİL - -define:<symbol_list> Genel koşullu derlemeyi bildirir symbol(s). symbol_list:name=value,... (Kısa biçimi: -d) -imports:<import_list> Başvurulan meta veri dosyalarında ad alanları için genel İçeri Aktarma işlemlerini bildirir. import_list:namespace,... -langversion:? Dil sürümü için izin verilen değerleri görüntüler -langversion:<string> `default` (en son birincil sürüm) veya `latest` (ikincil sürümler dahil en son sürüm) veya `14` veya `15.3` gibi belirli sürümler gibi dil sürümünü belirtir. -optionexplicit[+|-] Değişkenlerin açıkça bildirilmesini gerektirir. -optioninfer[+|-] Değişkenlerin tür çıkarımına izin verir. -rootnamespace:<string> Tüm tür bildirimleri için kök Ad Alanını belirtir. -optionstrict[+|-] Kesin dil semantik kurallarının uygulanmasını zorlar. -optionstrict:custom Kesin dil semantik kurallarına uyulmadığında uyarır. -optioncompare:binary İkili stilinde dize karşılaştırmaları yapılacağını belirtir. Bu varsayılandır. -optioncompare:text Metin stilinde dize karşılaştırmaları yapılacağını belirtir. - DİĞER - -help Bu kullanım iletisini görüntüler. (Kısa biçimi: -?) -noconfig VBC.RSP dosyasını otomatik olarak ekleme. -nologo Derleyici telif hakkı başlığını gösterme. -quiet Sessiz çıkış modu. -verbose Ayrıntılı iletileri görüntüler. -parallel[+|-] Eş zamanlı derleme. -version Derleyici sürüm numarasını görüntüler ve çıkar. - GELİŞMİŞ - -baseaddress:<number> Kitaplık veya modülün temel adresi (onaltılık). -checksumalgorithm:<alg> PDB dosyasında depolanan kaynak dosya sağlama toplamını hesaplamak için kullanılan algoritmayı belirtir. Desteklenen değerler şunlardır: SHA1 veya SHA256 (varsayılan). -codepage:<number> Kaynak dosyalar açılırken kullanılan kod sayfasını belirtir. -delaysign[+|-] Tanımlayıcı ad anahtarının ortak bölümünü kullanarak derlemeyi genel imzalar. -publicsign[+|-] Tanımlayıcı ad anahtarının ortak bölümünü kullanarak derlemeyi genel imzalar. -errorreport:<string> İç derleyici hatalarının nasıl işleneceğini belirtir; prompt, send, none veya queue (varsayılan) olmalıdır. -generatedfilesout:<dir> Derleme sırasında oluşturulan dosyaları belirtilen dizinde yerleştirir. -filealign:<number> Çıkış dosyası bölümleri için kullanılan hizalamayı belirtir. -highentropyva[+|-] Yüksek entropili ASLR’yi etkinleştirir. -keycontainer:<string> Tanımlayıcı ad anahtarı kapsayıcısını belirtir. -keyfile:<file> Tanımlayıcı ad anahtarı dosyasını belirtir. -libpath:<path_list> Meta veri başvurularını aramak için kullanılacak dizinlerin listesi. (Noktalı virgülle ayrılmış.) -main:<class> Alt Ana dosyayı içeren Sınıfı veya Modülü belirtir. Bu ayrıca System.Windows.Forms.Form’dan devralan bir Sınıf da olabilir. (Kısa biçimi: -m) -moduleassemblyname:<string> Bu modülün bir parçası olacağı derlemenin adı. -netcf .NET Compact Framework'ü hedefler. -nostdlib Standart kitaplıklara (system.dll ve VBC.RSP dosyası) başvurma. -pathmap:<K1>=<V1>,<K2>=<V2>,... Derleyicinin oluşturduğu kaynak yol adları için eşleştirme belirtir. -platform:<string> Bu kodun çalışabileceği platformları sınırlar; x86, x64, Itanium, arm, arm64 AnyCPU32BitPreferred veya anycpu (varsayılan) olmalıdır. -preferreduilang Tercih edilen çıkış dili adını belirtir. -nosdkpath Standart kitaplık derlemeleri için varsayılan SDK yolunu aramayı devre dışı bırakır. -reportivts[+|-] Bu derlemeye tüm bağımlılıklar tarafından verilen tüm IVT'ler hakkında çıkış bilgisi ve hangi derlemeden geldikleri dahil olmak üzere yabancı derleme erişilebilirlik hataları hakkında ek açıklamalar. -sdkpath:<path> .NET Framework SDK dizininin konumu (mscorlib.dll). -subsystemversion:<version> Çıkış PE’sinin alt sistem sürümünü belirtir. version:<number>[.<number>] -utf8output[+|-] Derleyici çıkışını UTF-8 karakter kodlamasıyla gösterir. @<file> Komut satırı ayarlarını metin dosyasından alarak ekler -vbruntime[+|-|*] Varsayılan Visual Basic çalışma zamanı ile/olmadan derler. -vbruntime:<file> <file> içindeki alternatif Visual Basic çalışma zamanı ile derler.
