Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadGenericParamForNewConstraint2
source: Type parameter '{0}' must have either a 'New' constraint or a 'Structure' constraint to satisfy the 'New' constraint for type parameter '{1}'.
cs: Parametr typu {0} musí mít omezení New nebo Structure, aby byly splněné podmínky omezení New pro parametr typu {1}.
de: Der {0}-Typparameter muss entweder eine New-Einschränkung oder eine Structure-Einschränkung haben, um der New-Einschränkung für den {1}-Typparameter zu entsprechen.
es: El parámetro de tipo '{0}' debe tener una restricción 'New' o 'Structure' para satisfacer la restricción 'New' del parámetro de tipo '{1}'.
fr: Le paramètre de type '{0}' doit avoir une contrainte 'New' ou une contrainte 'Structure' pour satisfaire la contrainte 'New' pour le paramètre de type '{1}'.
it: Per soddisfare il vincolo 'New' per il parametro di tipo '{1}', il parametro di tipo '{0}' deve contenere un vincolo 'New' o 'Structure'.
ja: 型パラメーター '{0}' は、型パラメーター '{1}' の 'New' 制約を満たすために 'New' 制約または 'Structure' 制約が必要です。
ko: 형식 매개 변수 '{1}'에 대한 'New' 제약 조건을 만족하려면 형식 매개 변수 '{0}'에 'New' 제약 조건 또는 'Structure' 제약 조건이 있어야 합니다.
pl: Parametr typu „{0}” musi mieć ograniczenie „New” lub „Structure”, aby spełniać ograniczenie „New” dla parametru typu „{1}”.
pt_br: Parâmetro de tipo "{0}" deve ter uma restrição "New" ou uma restrição "Structure" para satisfazer a restrição "New" para o parâmetro de tipo "{1}".
ru: Параметр типа "{0}" должен иметь либо ограничение "New", либо ограничение "Structure" в соответствии с ограничением "New" параметра типа "{1}".
tr: '{0}' tür parametresinde, '{1}' tür parametresinin 'New' kısıtlamasını karşılamak için bir 'New' kısıtlaması veya 'Structure' kısıtlaması olmalıdır.
zh_hans: 类型参数“{0}”必须具有“New”约束或“Structure”约束，才能满足类型参数“{1}”的“New”约束。
zh_hant: 類型參數 '{0}' 必須擁有 'New' 條件約束或 'Structure' 條件約束，才能符合類型參數 '{1}' 的 'New' 條件約束。

# ERR_NewArgsDisallowedForTypeParam
source: Arguments cannot be passed to a 'New' used on a type parameter.
cs: Argumenty nejde předávat omezení New použitému pro parametr typu.
de: An "New" in einem Typparameter können keine Argumente übergeben werden.
es: No se pueden pasar argumentos a 'New' si se usa en un parámetro de tipo.
fr: Les arguments ne peuvent pas être passés à un 'New' utilisé pour un paramètre de type.
it: Non è possibile passare argomenti a un elemento 'New' usato in un parametro di tipo.
ja: 型パラメーターで使用される 'New' に引数を渡すことはできません。
ko: 형식 매개 변수에 사용된 'New'에 인수를 전달할 수 없습니다.
pl: Argumentów nie można przekazać do elementu „New” używanego w parametrze typu.
pt_br: Argumentos não podem ser passados para um 'New' usado em um parâmetro de tipo.
ru: Аргументы нельзя передать в оператор "New" для параметра-типа.
tr: Bağımsız değişkenler bir tür parametresinde kullanılan 'New' öğesine geçilemez.
zh_hans: 无法给类型形参上使用的 "New" 传递实参。
zh_hant: 引數無法傳遞至類型參數上所使用的 'New'。

# ERR_DuplicateRawGenericTypeImport1
source: Generic type '{0}' cannot be imported more than once.
cs: Obecný typ {0} nejde importovat víc než jednou.
de: Der generische Typ "{0}" kann nur einmal importiert werden.
es: El tipo genérico '{0}' no se puede importar más de una vez.
fr: Le type générique '{0}' ne peut pas être importé plus d'une fois.
it: Non è possibile importare il tipo generico '{0}' più di una volta.
ja: ジェネリック型 '{0}' を複数回インポートすることはできません。
ko: 제네릭 형식 '{0}'은(는) 두 번 이상 가져올 수 없습니다.
pl: Typ ogólny „{0}” nie może zostać zaimportowany więcej niż raz.
pt_br: Tipo genérico "{0}" não pode ser herdado mais de uma vez.
ru: Универсальный тип "{0}" нельзя импортировать более одного раза.
tr: '{0}' genel türü birden çok kez içeri aktarılamaz.
zh_hans: 不能多次导入泛型类型“{0}”。
zh_hant: 不可匯入一次以上的泛型類型 '{0}'。

# ERR_NoTypeArgumentCountOverloadCand1
source: Overload resolution failed because no accessible '{0}' accepts this number of type arguments.
cs: Rozlišení přetěžování se nezdařilo, protože tento počet argumentů nepřijímá žádná přístupná metoda {0}.
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" diese Anzahl von Typargumenten akzeptiert.
es: Error de resolución de sobrecarga porque ninguna de las funciones '{0}' a las que se tiene acceso acepta este número de argumentos de tipo.
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible n'accepte ce nombre d'arguments de type.
it: La risoluzione dell'overload non è riuscita perché nessun '{0}' accessibile accetta questo numero di argomenti di tipo.
ja: この型引数の数を受け付ける '{0}' がないため、オーバーロードの解決に失敗しました。
ko: 지정한 개수의 형식 인수를 허용하는 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다.
pl: Rozpoznanie przeciążenia nie powiodło się, ponieważ żaden z dostępnych elementów „{0}” nie akceptuje tej liczby argumentów typu.
pt_br: Falha na resolução de sobrecarga porque nenhum "{0}" acessível aceita este número de argumentos de tipo.
ru: Произошел сбой разрешения перегрузки, так как "{0}" принимает такое число аргументов типа.
tr: Hiçbir erişilebilir '{0}' bu sayıda tür bağımsız değişkeni kabul etmediğinden aşırı yükleme çözümlemesi başarısız oldu.
zh_hans: 重载决策失败，因为没有可访问的“{0}”接受此数量的类型参数。
zh_hant: 因為沒有可存取的 '{0}' 接受此數目的類型引數，所以多載解析失敗。

# ERR_TypeArgsUnexpected
source: Type arguments unexpected.
cs: Očekávaly se argumenty typu.
de: Unerwartete Typargumente.
es: Argumentos de tipo no esperados.
fr: Arguments de type inattendus.
it: Argomenti di tipo imprevisti.
ja: 予期しない型引数です。
ko: 예기치 않은 형식 인수입니다.
pl: Nieoczekiwane argumenty typu.
pt_br: Argumentos de tipo não esperados.
ru: Непредвиденные аргументы типа.
tr: Tür bağımsız değişkenleri beklenmiyor.
zh_hans: 不应为类型参数。
zh_hant: 未預期的類型引數。

# ERR_NameSameAsMethodTypeParam1
source: '{0}' is already declared as a type parameter of this method.
cs: '{0} je už deklarovaný jako parametr typu této metody.
de: '"{0}" ist bereits als Typparameter dieser Methode deklariert.
es: '{0}' ya se declaró como parámetro de tipo de este método.
fr: '{0}' est déjà déclaré en tant que paramètre de type de cette méthode.
it: '{0}' è già dichiarato come parametro di tipo di questo metodo.
ja: '{0}' は、このメソッドの型パラメーターとして既に宣言されています。
ko: '{0}'이(가) 이 메서드의 형식 매개 변수로 이미 선언되었습니다.
pl: 'Element „{0}” jest już zadeklarowany jako parametr typu tej metody.
pt_br: "{0}" já está declarado como um parâmetro de tipo deste método.
ru: "{0}" уже объявлен в качестве параметра типа этого метода.
tr: '{0}', bu yöntemin bir tür parametresi olarak zaten bildirildi.
zh_hans: '“{0}”已声明为此方法的类型参数。
zh_hant: '{0}' 已經宣告為此方法的類型參數。

# ERR_TypeParamNameFunctionNameCollision
source: Type parameter cannot have the same name as its defining function.
cs: Parametr typu nemůže mít stejný název jako funkce, která ho definuje.
de: Ein Typparameter kann nicht den gleichen Namen haben wie die ihn definierende Funktion.
es: El parámetro de tipo no puede tener el mismo nombre que la función que lo define.
fr: Un paramètre de type ne peut pas avoir le même nom que sa fonction de définition.
it: Il nome del parametro di tipo non può essere uguale a quello della funzione che lo definisce.
ja: 型パラメーターを、定義する関数と同じ名前に設定することはできません。
ko: 형식 매개 변수에는 자신을 정의하는 함수와 같은 이름을 사용할 수 없습니다.
pl: Parametr typu nie może mieć nazwy takiej samej jak definiująca go funkcja.
pt_br: O parâmetro de tipo não pode ter o mesmo nome da sua função de definição.
ru: Имя параметра-типа не может совпадать с именем определяющей его функции.
tr: Tür parametresinin adı kendisini tanımlayan işlevle aynı olamaz.
zh_hans: 类型参数不能与其定义函数同名。
zh_hant: 類型參數不可以與其定義函式擁有相同的名稱。

# ERR_BadConstraintSyntax
source: Type or 'New' expected.
cs: Očekával se typ nebo omezení New.
de: Typ oder "New" erwartet.
es: Se esperaba un tipo o 'New'.
fr: Type ou 'New' attendu.
it: È previsto il tipo o 'New'.
ja: 型または 'New' が必要です。
ko: 형식 또는 'New'가 필요합니다.
pl: Oczekiwano typu lub elementu „New”.
pt_br: Tipo ou 'New' esperado.
ru: Требуется тип или "New".
tr: Tür veya 'New' bekleniyordu.
zh_hans: 应为类型或“New”。
zh_hant: 必須是類型或 'New'。

# ERR_OfExpected
source: 'Of' required when specifying type arguments for a generic type or method.
cs: 'Při zadávání argumentů typu pro obecný typ nebo metodu se vyžaduje možnost Of.
de: 'Zur Angabe von Typargumenten für generische Typen oder Methoden ist "Of" erforderlich.
es: 'Se requiere 'Of' cuando se especifican argumentos de tipo para un tipo o método genérico.
fr: 'Of' requis lors de la spécification des arguments de type pour un type ou une méthode générique.
it: 'Of' è richiesto quando si specificano argomenti di tipo per un tipo o metodo generico.
ja: 'ジェネリック型またはメソッドの型引数を指定するときには 'Of' が必要です。
ko: '제네릭 형식 또는 메서드에 형식 인수를 지정하는 경우에는 'Of'가 필요합니다.
pl: 'Wymagany element „Of” podczas określania argumentów typu dla typu ogólnego lub metody ogólnej.
pt_br: 'Of' necessário para a especificação de argumentos de tipo para um tipo genérico ou um método.
ru: 'При задании аргументов-типов для универсального типа или метода, необходимо использовать "Of".
tr: 'Genel tür veya yöntem için tür bağımsız değişkenleri belirtilirken 'Of' gerekir.
zh_hans: '在指定泛型类型或方法的类型参数时需要 "Of"。
zh_hant: '為泛型類型或方法指定類型引數時需要 'Of'。

# ERR_ArrayOfRawGenericInvalid
source: '(' unexpected. Arrays of uninstantiated generic types are not allowed.
cs: 'Neočekával se znak (. Pole obecných typů bez instancí nejsou povolená.
de: '"(" wurde nicht erwartet. Arrays von nicht instanziierten generischen Typen sind nicht zulässig.
es: '(' inesperado. No se permiten matrices de tipos genéricos sin instancias.
fr: '(' inattendu. Les tableaux de types génériques non instanciés ne sont pas autorisés.
it: 'Segno '(' imprevisto. Non sono consentite matrici di tipi generici privi di istanze.
ja: '(' は無効です。インスタンス生成されないジェネリック型の配列は許可されていません。
ko: '예기치 않은 '('입니다. 인스턴스화되지 않은 제네릭 형식의 배열은 사용할 수 없습니다.
pl: 'Nieoczekiwany znak „(”. Tablice typów ogólnych bez wystąpień nie są dozwolone.
pt_br: '(' inesperado. Matrizes de tipos genéricos sem instâncias não são permitidas.
ru: 'Непредвиденная круглая скобка "(". Массивы не-экземплярных общих типов не допустимы.
tr: '(' beklenmiyordu. Örneği oluşturulmamış genel tür dizilerine izin verilmez.
zh_hans: '不应为 "("。不允许非实例化泛型类型的数组。
zh_hant: '出現未預期的 '('。不可使用未執行個體化的泛型類型陣列。

# ERR_ForEachAmbiguousIEnumerable1
source: 'For Each' on type '{0}' is ambiguous because the type implements multiple instantiations of 'System.Collections.Generic.IEnumerable(Of T)'.
cs: 'Možnost For Each pro typ {0} je nejednoznačná, protože tento typ implementuje vytváření víc instancí možnosti System.Collections.Generic.IEnumerable(Of T).
de: '"For Each" für den {0}-Typ ist mehrdeutig, da der Typ mehrere Instanziierungen von System.Collections.Generic.IEnumerable(Of T) implementiert.
es: 'La instrucción 'For Each' del tipo '{0}' es ambigua porque el tipo implementa varias creaciones de instancias de 'System.Collections.Generic.IEnumerable(Of T)'.
fr: 'For Each' pour le type '{0}' est ambigu, car le type implémente plusieurs instanciations de 'System.Collections.Generic.IEnumerable(Of T)'.
it: 'For Each' sul tipo '{0}' è ambiguo perché il tipo implementa più creazioni di un'istanza di 'System.Collections.Generic.IEnumerable(Of T)'.
ja: '型が 'System.Collections.Generic.IEnumerable(Of T)' の複数のインスタンス化を実装するため、型 '{0}' の 'For Each' はあいまいです。
ko: '{0}' 형식은 'System.Collections.Generic.IEnumerable(Of T)'의 여러 인스턴스화를 구현하므로 이 형식의 'For Each'가 모호합니다.
pl: Element „For Each” w typie „{0}” jest niejednoznaczny, ponieważ typ implementuje wiele wystąpień elementu „System.Collections.Generic.IEnumerable(Of T)”.
pt_br: "For Each" no tipo "{0}" é ambíguo porque o tipo implementa várias instanciações de "System.Collections.Generic.IEnumerable (Of T)".
ru: Оператор "For Each" с типом "{0}" неоднозначен, поскольку этот тип реализует создание множества экземпляров "System.Collections.Generic.IEnumerable(Of T)".
tr: '{0}' türü üzerinde 'For Each' belirsiz çünkü tür birden çok 'System.Collections.Generic.IEnumerable(Of T)' örnek oluşturma işlemi uyguluyor.
zh_hans: '类型“{0}”的“For Each”不明确，因为此类型实现了“System.Collections.Generic.IEnumerable(Of T)”的多个实例化。
zh_hant: '類型 '{0}' 上的 'For Each' 模稜兩可，因為該類型實作了多個 'System.Collections.Generic.IEnumerable(Of T)' 具現化。

# ERR_IsNotOperatorGenericParam1
source: 'IsNot' operand of type '{0}' can be compared only to 'Nothing' because '{0}' is a type parameter with no class constraint.
cs: 'Operand IsNot typu {0} jde porovnat jenom s hodnotou Nothing, protože {0} je parametr typu bez omezení třídy.
de: 'Ein IsNot-Operand vom Typ "{0}" kann nur mit "Nothing" verglichen werden, da "{0}" ein Typparameter ohne Klasseneinschränkung ist.
es: 'El operando 'IsNot' de tipo '{0}' solo se puede comparar con 'Nothing' porque '{0}' es un parámetro de tipo sin restricción de clase.
fr: 'L'opérande 'IsNot' de type '{0}' peut être comparé uniquement à 'Nothing', car '{0}' est un paramètre de type sans contrainte de classe.
it: 'È possibile confrontare l'operando 'IsNot' del tipo '{0}' solo con 'Nothing' perché '{0}' è un parametro di tipo senza vincoli di classe.
ja: '{0}' はクラスの制約がない型パラメーターであるため、型 '{0}' の 'IsNot' オペランドは 'Nothing' とのみ比較できます。
ko: '{0}'은(는) 클래스 제약 조건이 없는 형식 매개 변수이므로 '{0}' 형식의 'IsNot' 피연산자는 'Nothing'과만 비교할 수 있습니다.
pl: 'Argument operacji „IsNot” typu „{0}” można porównać tylko z elementem „Nothing”, ponieważ element „{0}” jest parametrem typu bez ograniczenia klasy.
pt_br: 'Operando "IsNot" do tipo "{0}" pode ser comparado somente a "Nothing" porque "{0}" é um parâmetro de tipo sem restrição de classe.
ru: 'Операнд "IsNot" типа "{0}" можно сравнивать только с "Nothing", поскольку "{0}" является параметром типа без ограничения класса.
tr: '{0}' sınıf kısıtlaması olmayan bir tür parametresi olduğundan, '{0}' türünün 'IsNot' işleneni yalnızca 'Nothing' ile karşılaştırılabilir.
zh_hans: '类型“{0}”是没有类约束的类型参数，因此类型“{0}”的“Isnot”操作数只能与“Nothing”比较。
zh_hant: '類型 '{0}' 的 'IsNot' 運算元只能與 'Nothing' 進行比較，因為 '{0}' 是沒有類別條件約束的類型參數。

# ERR_TypeParamQualifierDisallowed
source: Type parameters cannot be used as qualifiers.
cs: Parametry typů nejde použít jako kvalifikátory.
de: Typparameter können nicht als Qualifizierer verwendet werden.
es: Los parámetros de tipo no se pueden usar como calificadores.
fr: Les paramètres de type ne peuvent pas être utilisés comme qualificateurs.
it: Non è possibile usare i parametri di tipo come qualificatori.
ja: 型パラメーターは修飾子として使用できません。
ko: 형식 매개 변수는 한정자로 사용할 수 없습니다.
pl: Parametrów typu nie można używać jako kwalifikatorów.
pt_br: Não é possível usar parâmetros de tipo como qualificadores.
ru: Параметры-типы нельзя использовать в качестве определителей.
tr: Tür parametreleri niteleyici olarak kullanılamaz.
zh_hans: 类型参数不能用作限定符。
zh_hant: 類型參數不能當做限定詞使用。

# ERR_TypeParamMissingCommaOrRParen
source: Comma or ')' expected.
cs: Očekávala se čárka nebo znak ).
de: Komma oder ")" erwartet.
es: Se esperaba una coma o ')'.
fr: Virgule ou ')' attendue.
it: È prevista la virgola o il segno ')'.
ja: コンマまたは ')' が必要です。
ko: 쉼표 또는 ')'가 필요합니다.
pl: Oczekiwano przecinka lub znaku ).
pt_br: Vírgula ou ")" esperado.
ru: Требуется запятая или ")".
tr: Virgül veya ')' bekleniyor.
zh_hans: 应为逗号或 ")"。
zh_hant: 必須是逗號或 ')'。

# ERR_TypeParamMissingAsCommaOrRParen
source: 'As', comma or ')' expected.
cs: 'Očekával se operátor As, čárka nebo znak ).
de: '"As", Komma oder ")" erwartet.
es: 'Se esperaba 'As', una coma o ')'.
fr: 'As', virgule ou ')' attendu.
it: 'È previsto 'As', la virgola o il segno ')'.
ja: 'As'、コンマ、または ')' が必要です。
ko: 'As', 쉼표 또는 ')'가 필요합니다.
pl: 'Oczekiwano elementu „As”, przecinka lub znaku „)”.
pt_br: 'As', vírgula ou ')' esperado.
ru: 'Требуется "As", запятая или ")".
tr: 'As', virgül veya ')' bekleniyor.
zh_hans: '应为 "As"、逗号或 ")"。
zh_hant: '必須是 'As'、逗號或 ')'。

# ERR_MultipleReferenceConstraints
source: 'Class' constraint cannot be specified multiple times for the same type parameter.
cs: 'Omezení Class nejde pro stejný parametr typu zadat vícekrát.
de: 'Die Class-Einschränkung kann nicht mehrmals für den gleichen Typparameter angegeben werden.
es: 'No se puede especificar la restricción 'Class' varias veces para el mismo parámetro de tipo.
fr: 'La contrainte 'Class' ne peut pas être spécifiée plusieurs fois pour le même paramètre de type.
it: 'Non è possibile specificare il vincolo 'Class' più volte per lo stesso parametro di tipo.
ja: 'Class' 制約は、同じ型パラメーターに対して複数回指定できません。
ko: '동일한 형식 매개 변수에는 'Class' 제약 조건을 여러 번 지정할 수 없습니다.
pl: 'Ograniczenie elementu Class nie może być określone wiele razy dla tego samego parametru typu.
pt_br: 'Não é possível especificar a restrição 'Class' várias vezes para o mesmo parâmetro de tipo.
ru: 'Ограничение "Class" нельзя указывать несколько раз для одного параметра-типа.
tr: 'Class' kısıtlaması aynı tür parametresi için birden çok kez belirtilemez.
zh_hans: '"Class" 约束不能为同一类型参数指定多次。
zh_hant: '不能針對相同的類型參數多次指定 'Class' 條件約束。

# ERR_MultipleValueConstraints
source: 'Structure' constraint cannot be specified multiple times for the same type parameter.
cs: 'Omezení Structure nejde pro stejný parametr typu zadat vícekrát.
de: 'Die Structure-Einschränkung kann nicht mehrmals für den gleichen Typparameter angegeben werden.
es: 'La restricción 'Structure' no se puede especificar varias veces para el mismo parámetro de tipo.
fr: 'La contrainte 'Structure' ne peut pas être spécifiée plusieurs fois pour le même paramètre de type.
it: 'Non è possibile specificare il vincolo 'Structure' più volte per lo stesso parametro di tipo.
ja: 'Structure' 制約は、同じ型パラメーターに対して複数回指定できません。
ko: '동일한 형식 매개 변수에는 'Structure' 제약 조건을 여러 번 지정할 수 없습니다.
pl: 'Ograniczenie elementu Structure nie może być określone wiele razy dla tego samego parametru typu.
pt_br: 'Não é possível especificar a restrição 'Structure' várias vezes para o mesmo parâmetro de tipo.
ru: 'Ограничение "Structure" нельзя указывать несколько раз для одного параметра-типа.
tr: 'Structure' kısıtlaması aynı tür parametresi için birden çok kez belirtilemez.
zh_hans: '"Structure" 约束不能为同一类型参数指定多次。
zh_hant: '不能針對相同的類型參數多次指定 'Structure' 條件約束。

# ERR_NewAndValueConstraintsCombined
source: 'New' constraint and 'Structure' constraint cannot be combined.
cs: 'Omezení New a Structure nejde kombinovat.
de: 'Die New-Einschränkung und die Structure-Einschränkung können nicht kombiniert werden.
es: 'No se pueden combinar las restricciones 'New' y 'Structure'.
fr: 'La contrainte 'New' et la contrainte 'Structure' ne peuvent pas être combinées.
it: 'Non è possibile combinare i vincoli 'New' e 'Structure'.
ja: 'New' 制約と 'Structure' 制約は、組み合わせて使用できません。
ko: 'New' 제약 조건과 'Structure' 제약 조건은 함께 사용할 수 없습니다.
pl: 'Nie można łączyć ograniczeń New i Structure.
pt_br: 'Não é possível combinar as restrições 'New' e 'Structure'.
ru: 'Ограничения "New" и "Structure" нельзя использовать вместе.
tr: 'New' kısıtlaması ile 'Structure' kısıtlaması birleştirilemez.
zh_hans: '"New" 约束不能与 "Structure" 约束组合。
zh_hant: '無法合併 'New' 條件約束和 'Structure' 條件約束。

# ERR_RefAndValueConstraintsCombined
source: 'Class' constraint and 'Structure' constraint cannot be combined.
cs: 'Omezení Class a Structure nejde kombinovat.
de: 'Die Class-Einschränkung und die Structure-Einschränkung können nicht kombiniert werden.
es: 'No se pueden combinar las restricciones 'Class' y 'Structure'.
fr: 'La contrainte 'Class' et la contrainte 'Structure' ne peuvent pas être combinées.
it: 'Non è possibile combinare il vincolo 'Class' e il vincolo 'Structure'.
ja: 'Class' 制約と 'Structure' 制約は、組み合わせて使用できません。
ko: 'Class' 제약 조건과 'Structure' 제약 조건은 함께 사용할 수 없습니다.
pl: 'Nie można łączyć ograniczeń Class i Structure.
pt_br: 'Não é possível combinar as restrições 'Class' e 'Structure'.
ru: 'Ограничения Class и Structure нельзя использовать вместе.
tr: 'Class' kısıtlaması ile 'Structure' kısıtlaması birleştirilemez.
zh_hans: '"Class" 约束不能与 "Structure" 约束组合。
zh_hant: '無法合併 'Class' 條件約束和 'Structure' 條件約束。

# ERR_BadTypeArgForStructConstraint2
source: Type argument '{0}' does not satisfy the 'Structure' constraint for type parameter '{1}'.
cs: Argument typu {0} nesplňuje podmínky omezení Structure pro parametr typu {1}.
de: Das Typargument "{0}" entspricht nicht der Structure-Einschränkung für den {1}-Typparameter.
es: El argumento de tipo '{0}' no satisface la restricción 'Structure' para el parámetro de tipo '{1}'.
fr: L'argument de type '{0}' ne satisfait pas la contrainte 'Structure' pour le paramètre de type '{1}'.
it: L'argomento di tipo '{0}' non soddisfa il vincolo 'Structure' per il parametro di tipo '{1}'.
ja: 型引数 '{0}' は型パラメーター '{1}' の 'Structure' 制約を満たしていません。
ko: '{0}' 형식 인수는 '{1}' 형식 매개 변수에 대한 'Structure' 제약 조건을 만족하지 않습니다.
pl: Argument typu „{0}” nie spełnia warunków ograniczenia „Structure” dla parametru typu „{1}”.
pt_br: Argumento de tipo "{0}" não satisfaz a restrição "Structure" para o parâmetro de tipo "{1}".
ru: Аргумент типа "{0}" не удовлетворяет ограничению "Structure" для параметра типа "{1}".
tr: '{0}' tür bağımsız değişkeni, '{1}' tür parametresi için 'Structure' kısıtlamasını karşılamıyor.
zh_hans: 类型实参“{0}”不满足类型形参“{1}”的“Structure”约束。
zh_hant: 類型引數 '{0}' 不符合類型參數 '{1}' 的 'Structure' 條件約束。

# ERR_BadTypeArgForRefConstraint2
source: Type argument '{0}' does not satisfy the 'Class' constraint for type parameter '{1}'.
cs: Argument typu {0} nesplňuje podmínky omezení Class pro parametr typu {1}.
de: Das Typargument "{0}" entspricht nicht der Class-Einschränkung für den {1}-Typparameter.
es: El argumento de tipo '{0}' no satisface la restricción 'Class' para el parámetro de tipo '{1}'.
fr: L'argument de type '{0}' ne satisfait pas la contrainte 'Class' pour le paramètre de type '{1}'.
it: L'argomento di tipo '{0}' non soddisfa il vincolo 'Class' per il parametro di tipo '{1}'.
ja: 型引数 '{0}' は型パラメーター '{1}' の 'Class' 制約を満たしていません。
ko: '{0}' 형식 인수는 '{1}' 형식 매개 변수에 대한 'Class' 제약 조건을 만족하지 않습니다.
pl: Argument typu „{0}” nie spełnia warunków ograniczenia „Class” dla parametru typu „{1}”.
pt_br: Argumento de tipo "{0}" não satisfaz a restrição "Class" para o parâmetro de tipo "{1}".
ru: Аргумент типа "{0}" не удовлетворяет ограничению "Class" для параметра типа "{1}".
tr: '{0}' tür bağımsız değişkeni, '{1}' tür parametresi için 'Class' kısıtlamasını karşılamıyor.
zh_hans: 类型实参“{0}”不满足类型形参“{1}”的“Class”约束。
zh_hant: 類型引數 '{0}' 不符合類型參數 '{1}' 的 'Class' 條件約束。

# ERR_RefAndClassTypeConstrCombined
source: 'Class' constraint and a specific class type constraint cannot be combined.
cs: 'Omezení Class a specifické omezení typu třídy nejde kombinovat.
de: 'Die Class-Einschränkung und eine Einschränkung für einen spezifischen Klassentyp können nicht kombiniert werden.
es: 'La restricción 'Class' no se puede combinar con una restricción de tipo de clase específica.
fr: 'Une contrainte 'Class' et une contrainte de type classe spécifique ne peuvent pas être combinées.
it: 'Non è possibile combinare il vincolo 'Class' e uno specifico vincolo di tipo classe.
ja: 'Class' 制約と特定のクラス型は、組み合わせて使用できません。
ko: 'Class' 제약 조건과 특정 클래스 형식 제약 조건은 함께 사용할 수 없습니다.
pl: 'Nie można łączyć ograniczenia Class i określonego ograniczenia typu klasy.
pt_br: 'Não é possível combinar a restrição 'Class' e uma restrição de tipo de classe específica.
ru: 'Ограничение "Class" и ограничение c указанием конкретного типа класса нельзя использовать вместе.
tr: 'Class' kısıtlaması ile belirli bir sınıf türü kısıtlaması birleştirilemez.
zh_hans: '"Class" 约束不能与特定的类类型约束组合。
zh_hant: '無法合併 'Class' 條件約束和特定類別的類型條件約束。
