Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_UseOfObsoletePropertyAccessor3
source: '{0}' accessor of '{1}' is obsolete: '{2}'.
cs: 'Přistupující objekt {0} pro {1} je zastaralý: {2}.
de: 'Der {0}-Accessor von "{1}" ist veraltet: "{2}".
es: 'El descriptor de acceso '{0}' de '{1}' está obsoleto: '{2}'.
fr: 'L'accesseur '{0}' de '{1}' est obsolète : '{2}'.
it: 'La funzione di accesso '{0}' di '{1}' è obsoleta: '{2}'.
ja: '{1}' の '{0}' アクセサーは廃止されています: '{2}'。
ko: '{1}'의 '{0}' 접근자는 사용되지 않습니다('{2}').
pl: 'Metoda dostępu „{0}” elementu „{1}” jest przestarzała: „{2}”.
pt_br: "{0}" acessador de "{1}" está obsoleto: "{2}".
ru: "{0}" средство доступа для "{1}" устарело: '{2}'.
tr: '{1}' öğesinin '{0}' erişimcisi artık kullanılmıyor: '{2}'.
zh_hans: '“{1}”的“{0}”访问器已过时:“{2}”。
zh_hant: '{1}' 的 '{0}' 存取子已經過時: '{2}'。

# ERR_UseOfObsoletePropertyAccessor2
source: '{0}' accessor of '{1}' is obsolete.
cs: 'Přistupující objekt {0} pro {1} je zastaralý.
de: 'Der {0}-Accessor von "{1}" ist veraltet.
es: 'El descriptor de acceso '{0}' de '{1}' está obsoleto.
fr: 'L'accesseur '{0}' de '{1}' est obsolète.
it: 'La funzione di accesso '{0}' di '{1}' è obsoleta.
ja: '{1}' の '{0}' アクセサーは廃止されています。
ko: '{1}'의 '{0}' 접근자는 사용되지 않습니다.
pl: 'Metoda dostępu „{0}” elementu „{1}” jest przestarzała.
pt_br: "{0}" acessador de "{1}" está obsoleto.
ru: "{0}" средство доступа для "{1}" устарело.
tr: '{1}' öğesinin '{0}' erişimcisi artık kullanılmıyor.
zh_hans: '“{1}”的“{0}”访问器已过时。
zh_hant: '{1}' 的 '{0}' 存取子已經過時。

# ERR_AccessMismatchImplementedEvent6
source: '{0}' cannot expose the underlying delegate type '{1}' of the event it is implementing to {2} '{3}' through {4} '{5}'.
cs: '{0} nemůže vystavovat nadřazený typ delegáta {1} události, kterou implementuje do {2} - {3} prostřednictvím {4} - {5}.
de: '"{0}" kann den zugrunde liegenden Delegattyp "{1}" des Ereignisses, das in {2} "{3}" implementiert wird, nicht über {4} "{5}" verfügbar machen.
es: '{0}' no puede exponer el tipo delegado subyacente '{1}' del evento que se implementa en {2} '{3}' a través de {4} '{5}'.
fr: '{0}' ne peut pas exposer le type de délégué sous-jacent '{1}' de l'événement qu'il implémente à {2} '{3}' via {4} '{5}'.
it: '{0}' non può esporre il tipo delegato sottostante '{1}' dell'evento che sta implementando in {2} '{3}' mediante {4} '{5}'.
ja: '{0}' は、イベントの基になるデリゲート型 '{1}' を公開できません。{4} '{5}' 経由で {2} '{3}' に実装しています。
ko: '{0}'은(는) {4} '{5}'을(를) 통해 {2} '{3}'에 구현되어 있는 이벤트의 내부 대리자 형식 '{1}'을(를) 노출할 수 없습니다.
pl: 'Element „{0}” nie może ujawnić podstawowego typu delegowanego „{1}” zdarzenia, które implementuje w elemencie {2} „{3}” za pomocą elementu {4} „{5}”.
pt_br: "{0}" não pode expor o tipo delegado subjacente "{1}" do evento que está implementando para {2} "{3}" através de {4} "{5}".
ru: "{0}" не может представлять базовый тип делегата "{1}" события, которое он реализует в {2} "{3}" посредством {4} "{5}".
tr: '{0}', {4} '{5}' aracılığıyla {2} '{3}' öğesine uyguladığı olayın temel aldığı '{1}' temsilci türünü gösteremiyor.
zh_hans: '“{0}”不能通过 {4}“{5}”向 {2}“{3}”公开它正在实现的事件的基础委托类型“{1}”。
zh_hant: '{0}' 無法將其實作之事件的基礎委派類型 '{1}'，經由 {4} '{5}' 公開至 {2} '{3}'。

# ERR_AccessMismatchImplementedEvent4
source: '{0}' cannot expose the underlying delegate type '{1}' of the event it is implementing outside the project through {2} '{3}'.
cs: '{0} nemůže vystavovat nadřazený typ delegáta {1} události, kterou implementuje mimo projekt prostřednictvím {2} - {3}.
de: '"{0}" kann den zugrunde liegenden Delegattyp "{1}" des Ereignisses, das implementiert wird, nicht außerhalb des Projekts über {2} "{3}" verfügbar machen.
es: '{0}' no puede exponer el tipo delegado subyacente '{1}' del evento que se implementa fuera del proyecto a través de {2} '{3}'.
fr: '{0}' ne peut pas exposer le type de délégué sous-jacent '{1}' de l'événement qu'il implémente en dehors du projet via {2} '{3}'.
it: '{0}' non può esporre il tipo delegato sottostante '{1}' dell'evento che sta implementando all'esterno del progetto mediante {2} '{3}'.
ja: '{0}' は、イベントの基になるデリゲート型 '{1}' を公開できません。{2} '{3}' 経由でプロジェクトの外側に実装しています。
ko: '{0}'은(는) {2} '{3}'을(를) 통해 프로젝트 외부에 구현되어 있는 이벤트의 내부 대리자 형식 '{1}'을(를) 노출할 수 없습니다.
pl: 'Element „{0}” nie może ujawnić podstawowego typu delegowanego „{1}” zdarzenia, które implementuje poza projektem za pomocą elementu {2} „{3}”.
pt_br: "{0}" não pode expor o tipo delegado subjacente "{1}" do evento que está implementando fora do projeto por meio de {2} "{3}".
ru: "{0}" не может представлять базовый тип делегата "{1}" события, которое он реализует вне проекта посредством {2} "{3}".
tr: '{0}', {2} '{3}' aracılığıyla projenin dışına uyguladığı olayın temel aldığı '{1}' temsilci türünü gösteremiyor.
zh_hans: '“{0}”不能通过 {2}“{3}”公开它正在实现的事件的基础委托类型“{1}”。
zh_hant: '{0}' 無法將其實作之事件的基礎委派類型 '{1}'，經由 {2} '{3}' 公開於專案之外。

# ERR_InheritanceCycleInImportedType1
source: Type '{0}' is not supported because it either directly or indirectly inherits from itself.
cs: Typ {0} se nepodporuje, protože přímo nebo nepřímo dědí sám od sebe.
de: Der Typ "{0}" wird nicht unterstützt, weil er direkt oder indirekt von sich selbst erbt.
es: El tipo '{0}' no es compatible porque hereda directa o indirectamente de sí mismo.
fr: Le type '{0}' n'est pas pris en charge, car il hérite directement ou indirectement de lui-même.
it: Il tipo '{0}' non è supportato perché eredita direttamente o indirettamente da se stesso.
ja: 型 '{0}' は、直接的または間接的にそれ自体から継承しているため、サポートされていません。
ko: '{0}' 형식은 직접 또는 간접적으로 자신에게서 상속되므로 지원되지 않습니다.
pl: Typ „{0}” nie jest obsługiwany, ponieważ dziedziczy on pośrednio albo bezpośrednio po sobie samym.
pt_br: Tipo "{0}" não é suportado porque ele herda direta ou indiretamente de si mesmo.
ru: Тип "{0}" не поддерживается, поскольку он прямо или косвенно наследует от себя самого.
tr: '{0}' türü, doğrudan veya dolaylı olarak kendi kendisinden devraldığından desteklenmiyor.
zh_hans: 类型“{0}”直接或者间接从自身继承，因此不受支持。
zh_hant: 因為類型 '{0}' 直接或間接繼承其本身，所以不受支援。

# ERR_NoNonObsoleteConstructorOnBase3
source: Class '{0}' must declare a 'Sub New' because the '{1}' in its base class '{2}' is marked obsolete.
cs: Třída {0} musí deklarovat Sub New, protože {1} v její základní třídě {2} je označená jako zastaralá.
de: Die {0}-Klasse muss "Sub New" deklarieren, da "{1}" in der {2}-Basisklasse als veraltet markiert ist.
es: La clase '{0}' debe declarar 'Sub New' porque el '{1}' de su clase base '{2}' está marcado como obsoleto.
fr: La classe '{0}' doit déclarer un 'Sub New', car le '{1}' dans sa classe de base '{2}' est marqué comme obsolète.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché '{1}' nella relativa classe di base '{2}' è contrassegnato come obsoleto.
ja: 基底クラス'{2}' の '{1}' には廃止マークが付けられているため、クラス '{0}' は 'Sub New' を宣言しなければなりません。
ko: '{0}' 클래스는 기본 클래스 '{2}'의 '{1}'이(가) obsolete로 표시되어 있으므로 'Sub New'를 선언해야 합니다.
pl: Klasa „{0}” musi deklarować element „Sub New”, ponieważ element „{1}” w swojej klasie bazowej „{2}” jest oznaczony jako przestarzały.
pt_br: Classe "{0}" deve declarar um "Sub New" porque o "{1}" na sua classe base "{2}" está marcado como obsoleto.
ru: Класс "{0}" должен объявить "Sub New", так как "{1}" в базовом классе "{2}" помечен как устаревший.
tr: '{2}' temel sınıfındaki '{1}' kullanılmıyor biçiminde işaretlendiğinden '{0}' sınıfı bir 'Sub New' bildirmelidir.
zh_hans: 类“{0}”必须声明一个“Sub New”，因为它的基类“{2}”中的“{1}”被标记为已过时。
zh_hant: 類別 '{0}' 必須宣告 'Sub New'，因為基底類別 '{2}' 中的 '{1}' 已標記為過時。

# ERR_NoNonObsoleteConstructorOnBase4
source: Class '{0}' must declare a 'Sub New' because the '{1}' in its base class '{2}' is marked obsolete: '{3}'.
cs: Třída {0} musí deklarovat Sub New, protože {1} v její základní třídě {2} je označená jako zastaralá: {3}.
de: Die {0}-Klasse muss "Sub New" deklarieren, da "{1}" in der {2}-Basisklasse als veraltet markiert ist: "{3}".
es: La clase '{0}' debe declarar 'Sub New' porque el '{1}' de su clase base '{2}' está marcado como obsoleto: '{3}'.
fr: La classe '{0}' doit déclarer un 'Sub New', car le '{1}' dans sa classe de base '{2}' est marqué comme obsolète. '{3}'.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché '{1}' nella relativa classe di base '{2}' è contrassegnato come obsoleto: '{3}'.
ja: 基底クラス '{2}' の '{1}' には廃止マークが付けられているため、クラス '{0}' は 'Sub New' を宣言しなければなりません: '{3}'
ko: '{0}' 클래스는 기본 클래스 '{2}'의 '{1}'이(가) obsolete로 표시되어 있으므로 'Sub New'를 선언해야 합니다('{3}').
pl: Klasa „{0}” musi deklarować element „Sub New”, ponieważ element „{1}” w swojej klasie bazowej „{2}” jest oznaczony jako przestarzały: „{3}”.
pt_br: Classe "{0}" deve declarar um "Sub New" porque o "{1}" na sua classe base "{2}" está marcado como obsoleto: "{3}".
ru: Класс "{0}" должен объявить "Sub New", так как "{1}" в базовом классе "{2}" помечен как устаревший: "{3}".
tr: '{2}' temel sınıfındaki '{1}' kullanılmıyor biçiminde işaretlendiğinden '{0}' sınıfı bir 'Sub New' bildirmelidir: '{3}'.
zh_hans: 类“{0}”必须声明一个“Sub New”，因为它的基类“{2}”中的“{1}”被标记为已过时:“{3}”。
zh_hant: 類別 '{0}' 必須宣告 'Sub New'，因為基底類別 '{2}' 中的 '{1}' 已標記為過時: '{3}'。

# ERR_RequiredNonObsoleteNewCall3
source: First statement of this 'Sub New' must be an explicit call to 'MyBase.New' or 'MyClass.New' because the '{0}' in the base class '{1}' of '{2}' is marked obsolete.
cs: Prvním příkazem této procedury Sub New musí být explicitní volání konstruktoru MyBase.New nebo MyClass.New, protože {0} základní třídy {1} pro {2} je označená jako zastaralá.
de: Die erste Anweisung dieser "Sub New" muss ein expliziter Aufruf an "MyBase.New" oder "MyClass.New" sein, da "{0}" in der Basisklasse "{1}" von "{2}" als veraltet markiert ist.
es: La primera instrucción de 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque '{0}' en la clase base '{1}' de '{2}' está marcado como obsoleto.
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le '{0}' dans la classe de base '{1}' de '{2}' est marquée comme obsolète.
it: La prima istruzione di questo 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché '{0}' nella classe di base '{1}' di '{2}' è contrassegnato come obsoleto.
ja: '{2}' の基底クラス '{1}' にある '{0}' には廃止マークが付けられているため、この 'Sub New' の最初のステートメントは、明示的な 'MyBase.New' または 'MyClass.New' への呼び出しでなければなりません。
ko: '{2}'의 기본 클래스 '{1}'에 있는 '{0}'이(가) obsolete로 표시되어 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 합니다.
pl: Pierwsza instrukcja tego elementu „Sub New” musi być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ element „{0}” w klasie bazowej „{1}” klasy „{2}” jest oznaczony jako przestarzały.
pt_br: A primeira instrução deste "Sub New" deve ser uma chamada explícita para "MyBase.New" ou "MyClass.New" porque o "{0}" na classe base "{1}" de "{2}" está marcado como obsoleto.
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" в базовом классе "{1}" из "{2}" помечен как устаревший.
tr: '{2}' öğesinin '{1}' temel sınıfında '{0}' artık kullanılmıyor olarak işaretlendiğinden, bu 'Sub New' yönteminin ilk deyimi açık bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır.
zh_hans: 此“Sub New”的第一条语句必须是对“MyBase.New”或“MyClass.New”的显式调用，因为“{2}”的基类“{1}”中的“{0}”被标为已过时。
zh_hant: 此 'Sub New' 的第一個陳述式，必須是對 'MyBase.New' 或 'MyClass.New' 的明確呼叫，因為 '{2}' 的基底類別 '{1}' 中之 '{0}' 已標記為過時。

# ERR_RequiredNonObsoleteNewCall4
source: First statement of this 'Sub New' must be an explicit call to 'MyBase.New' or 'MyClass.New' because the '{0}' in the base class '{1}' of '{2}' is marked obsolete: '{3}'.
cs: Prvním příkazem této procedury Sub New musí být explicitní volání konstruktoru MyBase.New nebo MyClass.New, protože {0} základní třídy {1} pro {2} je označená jako zastaralá: {3}.
de: Die erste Anweisung dieser "Sub New" muss ein expliziter Aufruf an "MyBase.New" oder "MyClass.New" sein, da "{0}" in der Basisklasse "{1}" von "{2}" als veraltet markiert ist: "{3}".
es: La primera instrucción de 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque '{0}' en la clase base '{1}' de '{2}' está marcado como obsoleto: '{3}'.
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le '{0}' dans la classe de base '{1}' de '{2}' est marquée comme obsolète : '{3}'.
it: La prima istruzione di questo 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché '{0}' nella classe di base '{1}' di '{2}' è contrassegnato come obsoleto: '{3}'.
ja: '{2}' の基底クラス '{1}' の '{0}' には廃止マークが付けられているため、この 'Sub New' の最初のステートメントは、明示的な 'MyBase.New' または 'MyClass.New' への呼び出しでなければなりません: '{3}'
ko: '{2}'의 기본 클래스 '{1}'에 있는 '{0}'이(가) obsolete로 표시되어 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 합니다. '{3}'
pl: Pierwsza instrukcja tego elementu „Sub New” musi być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ element „{0}” w klasie bazowej „{1}” klasy „{2}” jest oznaczony jako przestarzały: „{3}”.
pt_br: A primeira instrução deste "Sub New" deve ser uma chamada explícita para "MyBase.New" ou "MyClass.New" porque o "{0}" na classe base "{1}" de "{2}" está marcado como obsoleto: "{3}".
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" в базовом классе "{1}" из "{2}" помечен как устаревший: "{3}".
tr: '{2}' öğesinin '{1}' temel sınıfında '{0}' artık kullanılmıyor olarak işaretlendiğinden, bu 'Sub New' yönteminin ilk deyimi açık bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır: '{3}'.
zh_hans: 此“Sub New”的第一条语句必须是对“MyBase.New”或“MyClass.New”的显式调用，因为“{2}”的基类“{1}”中的“{0}”被标为已过时:“{3}”。
zh_hant: 此 'Sub New' 的第一個陳述式，必須是對 'MyBase.New' 或 'MyClass.New' 的明確呼叫，因為 '{2}' 的基底類別 '{1}' 中之 '{0}' 已標記為過時: '{3}'。

# ERR_InheritsTypeArgAccessMismatch7
source: '{0}' cannot inherit from {1} '{2}' because it expands the access of type '{3}' to {4} '{5}'.
cs: '{0} nemůže dědit z {1} - {2}, protože rozšiřuje přístup typu {3} na {4} - {5}.
de: '"{0}" erweitert den Zugriff des Typs "{3}" auf {4} "{5}" und kann daher nicht von {1} "{2}" erben.
es: '{0}' no puede heredarse de {1} '{2}' porque expande el acceso del tipo '{3}' a {4} '{5}'.
fr: '{0}' ne peut pas hériter de {1} '{2}', car il étend l'accès du '{3}' de type à {4} '{5}'.
it: '{0}' non può ereditare da {1} '{2}' perché espande l'accesso di tipo '{3}' a {4} '{5}'.
ja: '型 '{3}' のアクセスを {4} '{5}' へ展開しているため、'{0}' は {1} '{2}' から継承できません。
ko: '{0}'은(는) 형식 '{3}'의 액세스를 {4} '{5}'(으)로 확장하므로 {1} '{2}'에서 상속할 수 없습니다.
pl: 'Element „{0}” nie może dziedziczyć po elemencie {1} „{2}”, ponieważ rozszerza on dostęp do typu „{3}” do elementu {4} „{5}”.
pt_br: "{0}" não pode herdar de {1} "{2}" porque ele expande o acesso de tipo "{3}" para {4} "{5}".
ru: "{0}" не может наследовать от {1} "{2}", поскольку он расширяет доступ типа "{3}" до {4} "{5}".
tr: '{3}' türünün erişimini {4} '{5}' olarak genişlettiğinden '{0}', {1} '{2}' öğesinden devralamaz.
zh_hans: '“{0}”将对类型“{3}”的访问扩展到{4}“{5}”，因此无法从 {1}“{2}”继承。
zh_hant: '{0}' 無法繼承自 {1} '{2}'，因為它會將類型 '{3}' 的存取展開至 {4} '{5}'。

# ERR_InheritsTypeArgAccessMismatchOutside5
source: '{0}' cannot inherit from {1} '{2}' because it expands the access of type '{3}' outside the assembly.
cs: '{0} nemůže dědit z {1} - {2}, protože rozšiřuje přístup typu {3} mimo sestavení.
de: '"{0}" erweitert den Zugriff von Typ "{3}" außerhalb der Assembly und kann daher nicht von {1} "{2}" erben.
es: '{0}' no puede heredarse de {1} '{2}' porque expande el acceso del tipo '{3}' fuera del ensamblado.
fr: '{0}' ne peut pas hériter de {1} '{2}', car il étend l'accès du '{3}' de type en dehors de l'assembly.
it: '{0}' non può ereditare da {1} '{2}' perché espande l'accesso di tipo '{3}' all'esterno dell'assembly.
ja: '型 '{3}' のアクセスをアセンブリの外側に展開しているため、'{0}' は {1} '{2}' から継承できません。
ko: '{0}'은(는) 형식 '{3}'의 액세스를 해당 어셈블리 범위 밖으로 확장하므로 {1} '{2}'에서 상속할 수 없습니다.
pl: 'Element „{0}” nie może dziedziczyć po elemencie {1} „{2}”, ponieważ rozszerza on dostęp do typu „{3}” poza zestaw.
pt_br: "{0}" não pode herdar de {1} "{2}" porque ele expande o acesso de tipo "{3}" fora do assembly.
ru: "{0}" не может наследовать от {1} "{2}", поскольку он расширяет доступ типа "{3}" за пределы данной сборки.
tr: '{3}' türünün erişimini derlemenin dışına genişlettiğinden '{0}', {1} '{2}' öğesinden devralamaz.
zh_hans: '“{0}”将对类型“{3}”的访问扩展到程序集之外，因此无法从 {1}“{2}”继承。
zh_hant: '{0}' 無法繼承自 {1} '{2}'，因為它會在組件外展開類型 '{3}' 的存取。

# ERR_PartialTypeAccessMismatch3
source: Specified access '{0}' for '{1}' does not match the access '{2}' specified on one of its other partial types.
cs: Zadaný přístup {0} pro {1} neodpovídá přístupu {2} zadanému pro jeden z jeho ostatních částečných typů.
de: Der angegebene Zugriff "{0}" für "{1}" stimmt nicht mit dem Zugriff "{2}" für einen der anderen partiellen Typen überein.
es: El acceso especificado '{0}' para '{1}' no coincide con el acceso '{2}' especificado en uno de sus tipos parciales.
fr: L'accès spécifié '{0}' pour '{1}' ne correspond pas à l'accès '{2}' spécifié pour l'un de ses autres types partiels.
it: L'accesso '{0}' specificato per '{1}' non corrisponde all'accesso '{2}' specificato in uno degli altri tipi parziali.
ja: '{1}' に指定されたアクセス '{0}' は、その他の partial 型の 1 つで指定されたアクセス '{2}' と一致しません。
ko: '{1}'에 지정된 '{0}' 액세스가 다른 부분 형식(Partial Type) 중 하나에 지정된 '{2}' 액세스와 일치하지 않습니다.
pl: Dostęp „{0}” określony dla elementu „{1}” nie jest zgodny z dostępem „{2}” określonym w jednym z jego innych typów częściowych.
pt_br: Acesso especificado "{0}" para "{1}" não corresponde ao acesso "{2}" especificado em um dos seus outros tipos parciais.
ru: Указанный доступ "{0}" для "{1}" не соответствует доступу "{2}", указанному для одного из других разделяемых типов.
tr: '{1}' için belirtilen '{0}' erişimi, diğer kısmi türlerinden birinin üzerinde belirtilen '{2}' erişimiyle eşleşmiyor.
zh_hans: “{1}”的指定访问“{0}”与它的一个其他分部类型上指定的访问“{2}”不匹配。
zh_hant: 對於某個其他部分類型所指定的存取 '{2}' 而言，為 '{1}' 所指定的存取 '{0}' 不相符。

# ERR_PartialTypeBadMustInherit1
source: 'MustInherit' cannot be specified for partial type '{0}' because it cannot be combined with 'NotInheritable' specified for one of its other partial types.
cs: 'Deklaraci MustInherit nejde zadat pro částečný typ {0}, protože ji nejde kombinovat s deklarací NotInheritable zadanou pro jeden z jejích ostatních částečných typů.
de: '"MustInherit" kann nicht für den partiellen Typ "{0}" angegeben werden, da "NotInheritable" für einen der anderen partiellen Typen angegeben wurde und eine Kombination nicht möglich ist.
es: 'No se puede especificar 'MustInherit' para el tipo parcial '{0}' porque no se puede combinar con 'NotInheritable' especificado para uno de sus tipos parciales.
fr: 'MustInherit' ne peut pas être spécifié pour le type partiel '{0}', car il ne peut pas être combiné avec 'NotInheritable' spécifié pour l'un de ses autres types partiels.
it: 'Non è possibile specificare 'MustInherit' per il tipo parziale '{0}' perché non può essere combinato con 'NotInheritable' specificato per uno degli altri tipi parziali.
ja: 'MustInherit' は、その他の partial 型の 1 つに指定された 'NotInheritable' と組み合わせて使用できないので、partial 型 '{0}' に指定できません。
ko: 'MustInherit'은 다른 부분 형식(Partial Type) 중 하나에 지정된 'NotInheritable'과 함께 사용할 수 없으므로 '{0}' 부분 형식에 지정할 수 없습니다.
pl: 'Elementu „MustInherit” nie można określić dla typu częściowego „{0}”, ponieważ nie można go łączyć z elementem „NotInheritable” określonym dla jednego z jego innych typów częściowych.
pt_br: "MustInherit" não pode ser especificado para o tipo parcial "{0}" porque não pode ser combinado com "NotInheritable" especificado para um dos seus outros tipos parciais.
ru: '"MustInherit" не может быть указан для разделяемого типа "{0}", так как не может быть объединен с "NotInheritable", указанным для одного из других разделяемых типов.
tr: 'Diğer kısmi türlerinden biri için belirtilen 'NotInheritable' ile birleştirilemeyeceğinden, '{0}' kısmi türü için 'MustInherit' belirtilemez.
zh_hans: '“MustInherit”不能为分部类型“{0}”指定，因为它不能与为该类型的某个其他分部类型指定的“NotInheritable”组合。
zh_hant: '不可為部分類型 '{0}' 指定 'MustInherit'，因為其無法與針對某個其他部分類型所指定的 'NotInheritable' 相結合。

# ERR_MustOverOnNotInheritPartClsMem1
source: 'MustOverride' cannot be specified on this member because it is in a partial type that is declared 'NotInheritable' in another partial definition.
cs: 'Člen MustOverride nejde zadat pro u tohoto členu, protože se jedná o částečný typ s deklarací NotInheritable v jiné částečné deklaraci.
de: '"MustOverride" kann für diesen Member nicht angegeben werden, da es sich um einen partiellen Typ handelt, der in einer anderen partiellen Definition als "NotInheritable" deklariert ist.
es: 'MustOverride' no se puede especificar en este miembro porque se encuentra en un tipo parcial que se declaró como 'NotInheritable' en otra definición parcial.
fr: 'MustOverride' ne peut pas être spécifié pour ce membre, car il est dans un type partiel déclaré 'NotInheritable' dans une autre définition partielle.
it: 'MustOverride' non può essere specificato in questo membro perché è in un tipo parziale dichiarato come 'NotInheritable' in un'altra definizione parziale.
ja: 'このメンバーは、別の部分定義で 'NotInheritable' と宣言された Partial 型のメンバーなので、'MustOverride' を指定することはできません。
ko: 'MustOverride'는 다른 부분 정의에서 'NotInheritable'로 선언된 부분 형식(Partial Type)에 속하므로 이 멤버에 지정할 수 없습니다.
pl: 'Elementu „MustOverride” nie można określić w tej składowej, ponieważ znajduje się ona w typie częściowym zadeklarowanym jako „NotInheritable” w innej definicji częściowej.
pt_br: "MustOverride" não pode ser especificado neste membro porque está em um tipo parcial declarado "NotInheritable" em outra definição parcial.
ru: 'Невозможно определить "MustOverride" для этого члена, поскольку он находится в разделяемом типе, объявленном как "NotInheritable" в другом частичном определении.
tr: 'MustOverride', başka bir kısmi tanımda 'NotInheritable' olarak bildirilen kısmi bir türde bulunduğundan, bu üyede belirtilemez.
zh_hans: '不能在此成员上指定“MustOverride”，因为它所在的分部类型在另一个分部定义中被声明为“NotInheritable”。
zh_hant: '因為成員所屬的部分類型，在另一個部分定義中已宣告為 'NotInheritable'，所以無法對該成員指定 'MustOverride'，

# ERR_BaseMismatchForPartialClass3
source: Base class '{0}' specified for class '{1}' cannot be different from the base class '{2}' of one of its other partial types.
cs: Základní třída {0} zadaná pro třídu {1} se nemůže lišit od základní třídy {2} jednoho z jejích ostatních částečných typů.
de: Die für die {1}-Klasse festgelegte {0}-Basisklasse darf sich nicht von der {2}-Basisklasse eines ihrer anderen partiellen Typen unterscheiden.
es: La clase base '{0}' especificada para la clase '{1}' no puede ser distinta de la clase base '{2}' de otro de sus tipos parciales.
fr: La classe de base '{0}' spécifiée pour la classe '{1}' ne peut pas être différente de la classe de base '{2}' de l'un de ses autres types partiels.
it: La classe di base '{0}' specificata per la classe '{1}' non può essere diversa dalla classe di base '{2}' di uno degli altri tipi parziali.
ja: クラス '{1}' に指定された基本クラス '{0}' は、その他の Partial 型の 1 つである基本クラス '{2}' と異なることはできません。
ko: '{1}' 클래스에 지정된 기본 클래스 '{0}'은(는) 다른 부분 형식(Partial Type) 중 하나의 기본 클래스 '{2}'과(와) 다르면 안 됩니다.
pl: Klasa bazowa „{0}” określona dla klasy „{1}” nie może się różnić od klasy bazowej „{2}” jednego z jej pozostałych typów częściowych.
pt_br: Classe base "{0}" especificada para a classe "{1}" não pode ser diferente da classe base "{2}" de um dos seus outros tipos parciais.
ru: Базовый класс "{0}", указанный для класса "{1}", не может отличаться от базового класса "{2}" для одного из его других разделяемых типов.
tr: '{1}' sınıfı için belirtilen '{0}' temel sınıfı, diğer kısmi türlerinden birinin '{2}' temel sınıfından farklı olamaz.
zh_hans: 为类“{1}”指定的基类“{0}”不能与它的其他分部类型之一的基类“{2}”不同。
zh_hant: 為類別 '{1}' 指定的基底類別 '{0}'，不可與其任一其他部分類型的基底類別 '{2}' 不相同。
