Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DelegateBindingTypeInferenceFails
source: Type arguments could not be inferred from the delegate.
cs: Argumenty typu nejde odvodit z delegáta.
de: Die Typargumente konnten nicht vom Delegaten abgeleitet werden.
es: No se pudieron inferir los argumentos de tipo a partir del delegado.
fr: Impossible de déduire les arguments de type à partir du délégué.
it: Non è stato possibile dedurre gli argomenti di tipo dal delegato.
ja: 型引数をデリゲートから推論できませんでした。
ko: 대리자에서 형식 인수를 유추할 수 없습니다.
pl: Nie można wywnioskować argumentów typu na podstawie delegata.
pt_br: Os argumentos de tipo não podem ser deduzidos a partir da delegação.
ru: Аргументы-типы не могут быть определены из делегата.
tr: Tür bağımsız değişkenleri temsilciden çıkarsanamadı.
zh_hans: 未能从委托中推断类型参数。
zh_hant: 無法從委派推斷類型引數。

# ERR_TooManyArgs
source: Too many arguments.
cs: Příliš moc argumentů
de: Zu viele Argumente.
es: Demasiados argumentos.
fr: Arguments trop nombreux.
it: Troppi argomenti.
ja: 引数が多すぎます。
ko: 인수가 너무 많습니다.
pl: Za dużo argumentów.
pt_br: Muitos argumentos.
ru: Слишком много аргументов.
tr: Çok fazla bağımsız değişken var.
zh_hans: 参数太多。
zh_hant: 引數太多。

# ERR_NamedArgAlsoOmitted1
source: Parameter '{0}' already has a matching omitted argument.
cs: Pro parametr {0} už existuje odpovídající vynechaný argument.
de: Der Parameter "{0}" hat bereits ein entsprechendes ausgelassenes Argument.
es: El parámetro '{0}' ya tiene un argumento omitido correspondiente.
fr: Le paramètre '{0}' a déjà un argument omis correspondant.
it: Il parametro '{0}' ha già un argomento omesso corrispondente.
ja: パラメーター '{0}' には、一致する省略された引数が既に存在します。
ko: '{0}' 매개 변수에 일치하는 생략된 인수가 이미 있습니다.
pl: Parametr „{0}” ma już pasujący pominięty argument.
pt_br: Parâmetro "{0}" já tem um argumento omitido correspondente.
ru: Параметр "{0}" уже имеет соответствующий пропущенный аргумент.
tr: '{0}' parametresinin zaten eşleşen bir atlanmış bağımsız değişkeni var.
zh_hans: 形参“{0}”已具有匹配的省略实参。
zh_hant: 參數 '{0}' 已有相符的省略引數。

# ERR_NamedArgUsedTwice1
source: Parameter '{0}' already has a matching argument.
cs: Pro parametr {0} už existuje odpovídající argument.
de: Der Parameter "{0}" hat bereits ein entsprechendes Argument.
es: El parámetro '{0}' ya tiene un argumento correspondiente.
fr: Le paramètre '{0}' a déjà un argument correspondant.
it: Il parametro '{0}' ha già un argomento corrispondente.
ja: パラメーター '{0}' には、一致する引数が既に存在します。
ko: '{0}' 매개 변수에 일치하는 인수가 이미 있습니다.
pl: Parametr „{0}” ma już pasujący argument.
pt_br: Parâmetro "{0}" já tem um argumento correspondente.
ru: Параметр "{0}" уже имеет соответствующий аргумент.
tr: '{0}' parametresinin zaten eşleşen bir bağımsız değişkeni var.
zh_hans: 形参“{0}”已具有匹配的实参。
zh_hant: 參數 '{0}' 已有相符的引數。

# ERR_NamedParamNotFound1
source: '{0}' is not a method parameter.
cs: '{0} není parametr metody.
de: '"{0}" ist kein Methodenparameter.
es: '{0}' no es un parámetro de método.
fr: '{0}' n'est pas un paramètre de méthode.
it: '{0}' non è un parametro di metodo.
ja: '{0}' はメソッド パラメーターではありません。
ko: '{0}'은(는) 메서드 매개 변수가 아닙니다.
pl: 'Element „{0}” nie jest parametrem metody.
pt_br: "{0}" não é um parâmetro de método.
ru: "{0}" не является параметром метода.
tr: '{0}' bir yöntem parametresi değil.
zh_hans: '“{0}”不是方法参数。
zh_hant: '{0}' 不是方法參數。

# ERR_OmittedArgument1
source: Argument not specified for parameter '{0}'.
cs: Není zadaný argument pro parametr {0}.
de: Für den Parameter "{0}" wurde kein Argument angegeben.
es: No se ha especificado ningún argumento para el parámetro '{0}'.
fr: Argument non spécifié pour le paramètre '{0}'.
it: L'argomento non è stato specificato per il parametro '{0}'.
ja: パラメーター '{0}' に対して引数が指定されていません。
ko: '{0}' 매개 변수에는 인수가 지정되어 있지 않습니다.
pl: Nie określono parametru dla argumentu „{0}”.
pt_br: O argumento não foi especificado para o parâmetro "{0}".
ru: Аргумент, не указанный для параметра "{0}".
tr: '{0}' parametresi için bağımsız değişken belirtilmemiş.
zh_hans: 没有为参数“{0}”指定参数。
zh_hant: 參數 '{0}' 未指定引數。

# ERR_UnboundTypeParam1
source: Type parameter '{0}' cannot be inferred.
cs: Nejde odvodit parametr typu {0}.
de: Der {0}-Typparameter kann nicht per Rückschluss abgeleitet werden.
es: No se puede inferir el parámetro de tipo '{0}'.
fr: Le paramètre de type '{0}' ne peut pas être déduit.
it: Non è possibile dedurre il parametro di tipo '{0}'.
ja: 型パラメーター '{0}' を推論できません。
ko: 형식 매개 변수 '{0}'을(를) 유추할 수 없습니다.
pl: Nie można wywnioskować parametru typu „{0}”.
pt_br: Parâmetro de tipo "{0}" não pode ser deduzido.
ru: Невозможно получить параметр типа "{0}".
tr: '{0}' tür parametresi çıkarsanamıyor.
zh_hans: 无法推断类型参数“{0}”。
zh_hant: 無法推斷類型參數 '{0}'。

# ERR_ExtensionMethodOverloadCandidate2
source: Extension method '{0}' defined in '{1}'.
cs: Metoda rozšíření {0} definovaná v {1}
de: Erweiterungsmethode "{0}" in "{1}" definiert.
es: Método de extensión '{0}' definido en '{1}'.
fr: Méthode d'extension '{0}' définie dans '{1}'.
it: Metodo di estensione '{0}' definito in '{1}'.
ja: '{1}' で定義された拡張メソッド '{0}'。
ko: '{1}'에서 '{0}' 확장 메서드가 정의되었습니다.
pl: Metoda rozszerzenia „{0}” zdefiniowana w elemencie „{1}”.
pt_br: Método de extensão "{0}" definido em "{1}".
ru: Метод расширения "{0}" определен в "{1}".
tr: '{1}' içinde '{0}' genişletme yöntemi tanımlandı.
zh_hans: “{1}”中定义的扩展方法“{0}”。
zh_hant: 定義於 '{1}' 中的擴充方法 '{0}'。

# ERR_AnonymousTypeNeedField
source: Anonymous type must contain at least one member.
cs: Anonymní typ musí obsahovat aspoň jeden člen.
de: Anonyme Typen müssen mindestens einen Member enthalten.
es: El tipo anónimo debe contener al menos un miembro.
fr: Le type anonyme doit contenir au moins un membre.
it: Il tipo anonimo deve contenere almeno un membro.
ja: 匿名型は、少なくとも 1 つのメンバーを含んでいる必要があります。
ko: 익명 형식에는 하나 이상의 멤버가 있어야 합니다.
pl: Typ anonimowy musi zawierać co najmniej jedną składową.
pt_br: O tipo anônimo deve conter pelo menos um membro.
ru: Анонимный тип должен содержать по крайней мере один член.
tr: Anonim türün en az bir üyesi olmalıdır.
zh_hans: 匿名类型必须至少包含一个成员。
zh_hant: 匿名類型必須至少有一名成員。

# ERR_AnonymousTypeNameWithoutPeriod
source: Anonymous type member name must be preceded by a period.
cs: Před názvem členu anonymního typu musí být tečka.
de: Dem Membernamen eines anonymen Typs muss ein Punkt voranstehen.
es: El nombre de un miembro de tipo anónimo debe ir precedido de un punto.
fr: Le nom du membre de type anonyme doit être précédé d'un point.
it: Il nome di membro di tipo anonimo deve essere preceduto da un punto.
ja: 匿名型のメンバー名の前には、ピリオドが必要です。
ko: 익명 형식 멤버 이름은 마침표 뒤에 와야 합니다.
pl: Nazwa składowej typu anonimowego musi być poprzedzona kropką.
pt_br: O nome do membro de tipo anônimo deve ser precedido por um ponto.
ru: Имени члена анонимного типа должна предшествовать точка.
tr: Anonim türdeki üye adının başında bir nokta işareti bulunmalıdır.
zh_hans: 匿名类型成员名前面必须有一个句点。
zh_hant: 匿名類型成員名稱前面必須有一個句號。

# ERR_AnonymousTypeExpectedIdentifier
source: Identifier expected, preceded with a period.
cs: Očekával se identifikátor začínající tečkou.
de: Bezeichner mit vorangestelltem Punkt erwartet.
es: Se esperaba un identificador precedido por un punto.
fr: Identificateur attendu, précédé d'un point.
it: È previsto l'identificatore preceduto da un punto.
ja: 前にピリオドが付いた識別子が必要です。
ko: 마침표가 앞에 오는 식별자가 필요합니다.
pl: Oczekiwano identyfikatora poprzedzonego kropką.
pt_br: Identificador esperado, precedido por um ponto.
ru: Требуется идентификатор, перед которым должна стоять точка.
tr: Başında bir nokta işareti olan tanımlayıcı bekleniyordu.
zh_hans: 应为开头带有句点的标识符。
zh_hant: 必須是識別項，前面加上句號。

# ERR_TooManyArgs2
source: Too many arguments to extension method '{0}' defined in '{1}'.
cs: Metoda rozšíření {0} definovaná v {1} má příliš moc argumentů.
de: Zu viele Argumente für die in "{1}" definierte Erweiterungsmethode "{0}".
es: Demasiados argumentos para el método de extensión '{0}' definido en '{1}'.
fr: Arguments trop nombreux dans la méthode d'extension '{0}' définie dans '{1}'.
it: In '{1}' è stato definito un numero eccessivo di argomenti per il metodo di estensione '{0}'.
ja: '{1}' で定義された拡張メソッド '{0}' の引数が多すぎます。
ko: '{1}'에 정의된 확장 메서드 '{0}'의 인수가 너무 많습니다.
pl: Za dużo argumentów dla metody rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”.
pt_br: Muito poucos argumentos para o método de extensão "{0}" definidos em "{1}".
ru: Слишком много аргументов в методе расширения "{0}", определенном в "{1}".
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemi için çok fazla bağımsız değişken var.
zh_hans: 对“{1}”中定义的扩展方法“{0}”而言，参数太多。
zh_hant: 在 '{1}' 中定義的擴充方法 '{0}'，有太多引數。

# ERR_NamedArgAlsoOmitted3
source: Parameter '{0}' in extension method '{1}' defined in '{2}' already has a matching omitted argument.
cs: Pro parametr {0} v metodě rozšíření {1} definované v {2} už existuje odpovídající vynechaný argument.
de: Der Parameter "{0}" in der in "{2}" definierten Erweiterungsmethode "{1}" hat bereits ein entsprechendes ausgelassenes Argument.
es: El parámetro '{0}' del método de extensión '{1}' definido en '{2}' ya tiene un argumento omitido correspondiente.
fr: Le paramètre '{0}' de la méthode d'extension '{1}' définie dans '{2}' a déjà un argument omis correspondant.
it: Il parametro '{0}' del metodo di estensione '{1}' definito in '{2}' ha già un argomento omesso corrispondente.
ja: '{2}' で定義された拡張メソッド '{1}' のパラメーター '{0}' には、一致する省略された引数が既に存在します。
ko: '{2}'에 정의된 확장 메서드 '{1}'의 '{0}' 매개 변수에는 일치하는 생략된 인수가 이미 있습니다.
pl: Parametr „{0}” metody rozszerzenia „{1}” zdefiniowanej w elemencie „{2}” ma już pasujący pominięty argument.
pt_br: Parâmetro "{0}" no método de extensão "{1}" definido em "{2}" já tem um argumento omitido correspondente.
ru: Параметр "{0}" метода расширения "{1}", заданного в "{2}", уже имеет соответствующий пропущенный аргумент.
tr: '{2}' içinde tanımlanan '{1}' genişletme yöntemindeki '{0}' parametresinin zaten eşleşen atlanmış bir bağımsız değişkeni var.
zh_hans: “{2}”中定义的扩展方法中的“{1}”形参“{0}”已具有匹配的省略实参。
zh_hant: '{2}' 中定義之擴充方法 '{1}' 內的參數 '{0}'，已有相符的省略引數。

# ERR_NamedArgUsedTwice3
source: Parameter '{0}' of extension method '{1}' defined in '{2}' already has a matching argument.
cs: Pro parametr {0} metody rozšíření {1} definované v {2} už existuje odpovídající argument.
de: Der Parameter "{0}" in der in "{2}" definierten Erweiterungsmethode "{1}" hat bereits ein entsprechendes Argument.
es: El parámetro '{0}' del método de extensión '{1}' definido en '{2}' ya tiene un argumento correspondiente.
fr: Le paramètre '{0}' de la méthode d'extension '{1}' définie dans '{2}' a déjà un argument correspondant.
it: Il parametro '{0}' del metodo di estensione '{1}' definito in '{2}' ha già un argomento corrispondente.
ja: '{2}' で定義された拡張メソッド '{1}' のパラメーター '{0}' には、一致する引数が既に存在します。
ko: '{2}'에 정의된 확장 메서드 '{1}'의 '{0}' 매개 변수에는 일치하는 인수가 이미 있습니다.
pl: Parametr „{0}” metody rozszerzenia „{1}” zdefiniowanej w elemencie „{2}” ma już pasujący argument.
pt_br: Parâmetro "{0}" do método de extensão "{1}" definido em "{2}" já tem um argumento correspondente.
ru: Параметр "{0}" метода расширения "{1}", заданного в "{2}", уже имеет соответствующий аргумент.
tr: '{2}' içinde tanımlanan '{1}' genişletme yöntemindeki '{0}' parametresinin zaten eşleşen bir bağımsız değişkeni var.
zh_hans: “{2}”中定义的扩展方法“{1}”的形参“{0}”已具有匹配的实参。
zh_hant: '{2}' 中定義之擴充方法 '{1}' 的參數 '{0}'，已有相符的引數。

# ERR_NamedParamNotFound3
source: '{0}' is not a parameter of extension method '{1}' defined in '{2}'.
cs: '{0} není parametr metody rozšíření {1} definované v {2}.
de: '"{0}" ist kein Parameter der in "{2}" definierten Erweiterungsmethode "{1}".
es: '{0}' no es un parámetro del método de extensión '{1}' definido en '{2}'.
fr: '{0}' n'est pas un paramètre de la méthode d'extension '{1}' définie dans '{2}'.
it: '{0}' non è un parametro del metodo di estensione '{1}' definito in '{2}'.
ja: '{0}' は、'{2}' で定義された拡張メソッド '{1}' のパラメーターではありません。
ko: '{0}'은(는) '{2}'에 정의된 확장 메서드 '{1}'의 매개 변수가 아닙니다.
pl: 'Element „{0}” nie jest parametrem metody rozszerzenia „{1}” zdefiniowanej w elemencie „{2}”.
pt_br: "{0}" não é um parâmetro do método de extensão "{1}" definido em "{2}".
ru: "{0}" не является параметром метода расширения "{1}", определенного в "{2}".
tr: '{0}', '{2}' içinde tanımlanan '{1}' genişletme yönteminin parametresi değil.
zh_hans: '“{0}”不是“{2}”中定义的扩展方法“{1}”的参数。
zh_hant: '{0}' 不是 '{2}' 中定義之擴充方法 '{1}' 的參數。

# ERR_OmittedArgument3
source: Argument not specified for parameter '{0}' of extension method '{1}' defined in '{2}'.
cs: Není zadaný argument pro parametr {0} metody rozšíření {1} definované v {2}.
de: Für den Parameter "{0}" der in "{2}" definierten Erweiterungsmethode "{1}" wurde kein Argument angegeben.
es: No se especificó un argumento para el parámetro '{0}' del método de extensión '{1}' definido en '{2}'.
fr: Argument non spécifié pour le paramètre '{0}' de la méthode d'extension '{1}' définie dans '{2}'.
it: L'argomento non è stato specificato per il parametro '{0}' del metodo di estensione '{1}' definito in '{2}'.
ja: '{2}' で定義された拡張メソッド '{1}' のパラメーター '{0}' に対して引数が指定されていません。
ko: '{2}'에 정의된 '{1}' 확장 메서드의 '{0}' 매개 변수에는 인수가 지정되어 있지 않습니다.
pl: Nie określono argumentu dla parametru „{0}” metody rozszerzenia „{1}” zdefiniowanej w elemencie „{2}”.
pt_br: Argumento não especificado para o parâmetro "{0}" do método de extensão "{1}" definido em "{2}".
ru: Аргумент, не указанный для параметра "{0}" метода расширения "{1}", определен в "{2}".
tr: '{2}' içinde tanımlanan '{1}' genişletme yönteminin '{0}' parametresi için bağımsız değişken belirtilmemiş.
zh_hans: 没有为“{2}”中定义的扩展方法“{1}”的形参“{0}”指定实参。
zh_hant: 未對 '{2}' 中定義的擴充方法 '{1}' 之參數 '{0}' 指定引數。

# ERR_UnboundTypeParam3
source: Type parameter '{0}' for extension method '{1}' defined in '{2}' cannot be inferred.
cs: Nepodařilo se odvodit parametr typu {0} pro metodu rozšíření {1} definovanou v {2}.
de: Der {0}-Typparameter für die in "{2}" definierte Erweiterungsmethode "{1}" kann nicht per Rückschluss abgeleitet werden.
es: No se puede inferir el parámetro de tipo '{0}' para el método de extensión '{1}' definido en '{2}'.
fr: Le paramètre de type '{0}' pour la méthode d'extension '{1}' définie dans '{2}' ne peut pas être déduit.
it: Non è possibile dedurre il parametro di tipo '{0}' del metodo di estensione '{1}' definito in '{2}'.
ja: '{2}' で定義された拡張メソッド '{1}' の型パラメーター '{0}' を推論できません。
ko: '{2}'에 정의된 확장 메서드 '{1}'의 형식 매개 변수 '{0}'을(를) 유추할 수 없습니다.
pl: Nie można wywnioskować parametru typu „{0}” metody rozszerzenia „{1}” zdefiniowanej w elemencie „{2}”.
pt_br: Parâmetro de tipo "{0}" para método de extensão "{1}" definido em "{2}" não pode ser deduzido.
ru: Невозможно получить параметр типа "{0}" для метода расширения "{1}", определенного в "{2}".
tr: '{2}' içinde tanımlanan '{1}' genişletme yöntemi için '{0}' tür parametresi çıkarsanamıyor.
zh_hans: 无法推断“{2}”中定义的扩展方法“{1}”的类型参数“{0}”。
zh_hant: 無法推斷在 '{2}' 中定義之擴充方法 '{1}' 的類型參數 '{0}'。

# ERR_TooFewGenericArguments2
source: Too few type arguments to extension method '{0}' defined in '{1}'.
cs: Nedostatečný počet argumentů metody rozšíření {0} definované v {1}
de: Nicht genügend Typargumente für die in "{1}" definierte Erweiterungsmethode "{0}".
es: Argumentos de tipo insuficientes para el método de extensión '{0}' definido en '{1}'.
fr: Arguments de type insuffisants dans la méthode d'extension '{0}' définie dans '{1}'.
it: In '{1}' è stato definito un numero insufficiente di argomenti di tipo per il metodo di estensione '{0}'.
ja: '{1}' で定義された拡張メソッド '{0}' の型引数が少なすぎます。
ko: '{1}'에 정의된 확장 메서드 '{0}'의 인수가 너무 적습니다.
pl: Za mało argumentów typu dla metody rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”.
pt_br: Muito poucos argumentos de tipo para o método de extensão "{0}" definido em "{1}".
ru: Слишком мало аргументов типа в методе расширения "{0}", определенном в "{1}".
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemi için çok az tür bağımsız değişkeni var.
zh_hans: 对“{1}”中定义的扩展方法“{0}”而言，类型参数太少。
zh_hant: 在 '{1}' 中定義的擴充方法 '{0}'，類型引數太少。

# ERR_TooManyGenericArguments2
source: Too many type arguments to extension method '{0}' defined in '{1}'.
cs: Příliš moc argumentů metody rozšíření {0} definované v {1}.
de: Zu viele Typargumente für die in "{1}" definierte Erweiterungsmethode "{0}".
es: Demasiados argumentos de tipo para el método de extensión '{0}' definido en '{1}'.
fr: Arguments de type trop nombreux dans la méthode d'extension '{0}' définie dans '{1}'.
it: In '{1}' è stato definito un numero eccessivo di argomenti di tipo per il metodo di estensione '{0}'.
ja: '{1}' で定義されている拡張メソッド '{0}' の型引数が多すぎます。
ko: '{1}'에 정의된 확장 메서드 '{0}'의 형식 인수가 너무 많습니다.
pl: Za dużo argumentów typu dla metody rozszerzenia „{0}” zdefiniowanej w elemencie „{1}”.
pt_br: Muitos argumentos de tipo para o método de extensão "{0}" definidos em "{1}".
ru: Слишком много аргументов типа в методе расширения "{0}", определенного в "{1}".
tr: '{1}' içinde tanımlanan '{0}' genişletme yöntemi için çok fazla tür bağımsız değişkeni var.
zh_hans: 对“{1}”中定义的扩展方法“{0}”而言，类型参数太多。
zh_hant: 在 '{1}' 中定義的擴充方法 '{0}'，有太多類型引數。

# ERR_ExpectedInOrEq
source: 'In' or '=' expected.
cs: 'Očekával se výraz In nebo =.
de: '"In" oder "=" erwartet.
es: 'Se esperaba 'In' o '='.
fr: 'In' ou '=' attendu.
it: 'È previsto 'In' o '='.
ja: 'In' または '=' が必要です。
ko: 'In' 또는 '='가 필요합니다.
pl: 'Oczekiwano elementu „In” lub znaku „=”.
pt_br: "In" ou "=" esperado.
ru: 'Требуется "In" или "=".
tr: 'In' veya '=' bekleniyor.
zh_hans: '应为“In”或“=”。
zh_hant: '必須是 'In' 或 '='。

# ERR_ExpectedQueryableSource
source: Expression of type '{0}' is not queryable. Make sure you are not missing an assembly reference and/or namespace import for the LINQ provider.
cs: Na výrazy typu {0} nejde zadávat dotazy. Zkontrolujte, jestli nechybí odkaz na sestavení nebo import oboru názvů pro zprostředkovatele LINQ.
de: Ein Ausdruck vom Typ "{0}" kann nicht abgefragt werden. Stellen Sie sicher, dass kein Assemblyverweis und/oder Namespaceimport für den LINQ-Anbieter fehlt.
es: No se puede consultar una expresión de tipo '{0}'. Compruebe que no falta ninguna referencia de ensamblado ni ninguna importación de espacio de nombres para el proveedor LINQ.
fr: L'expression de type '{0}' ne peut pas être interrogée. Vérifiez qu'une référence d'assembly et/ou une importation d'espace de noms existent pour le fournisseur LINQ.
it: L'espressione di tipo '{0}' non può essere sottoposta a query. Verificare che sia presente un riferimento all'assembly e/o un'importazione dello spazio dei nomi per il provider LINQ.
ja: 型 '{0}' の式はクエリ不可能です。LINQ プロバイダーに対してアセンブリ参照や名前空間インポートが不足していないことを確認してください。
ko: '{0}' 형식의 식은 쿼리할 수 없습니다. LINQ 공급자에 대한 네임스페이스 가져오기 및/또는 어셈블리 참조가 있는지 확인하세요.
pl: Wyrażenie typu „{0}” nie umożliwia formułowania zapytań. Upewnij się, że nie brakuje odwołania do zestawu i/lub importu przestrzeni nazw dla dostawcy LINQ.
pt_br: Expressão do tipo "{0}" não é questionável. Certifique-se de que não está faltando uma referência de assembly e/ou importação de namespace para o provedor LINQ.
ru: Выражение типа "{0}" недоступно для запроса. Убедитесь, что не пропущена ссылка на сборку и (или) импорт пространства имен для поставщика LINQ.
tr: '{0}' türündeki ifade sorgulanabilir değil. LINQ sağlayıcısı için bir derleme başvurusunun ve/veya ad alanı içeri aktarmasının eksik olmadığından emin olun.
zh_hans: 类型“{0}”的表达式不可查询。请确保不缺少程序集引用和/或 LINQ 提供程序的命名空间导入。
zh_hant: 類型 '{0}' 的運算式無法查詢。請確定您沒有遺漏組件參考及 (或) LINQ 提供者的命名空間匯入。

# ERR_QueryOperatorNotFound
source: Definition of method '{0}' is not accessible in this context.
cs: Definice metody {0} není v tomto kontextu dostupná.
de: Auf die Definition der {0}-Methode kann in diesem Kontext nicht zugegriffen werden.
es: La definición del método '{0}' no es accesible en este contexto.
fr: La définition de la méthode '{0}' n'est pas accessible dans ce contexte.
it: La definizione del metodo '{0}' non è accessibile in questo contesto.
ja: メソッド '{0}' の定義には、このコンテキストではアクセスできません。
ko: 이 컨텍스트에서는 '{0}' 메서드의 정의에 액세스할 수 없습니다.
pl: Definicja metody „{0}” jest niedostępna w tym kontekście.
pt_br: Definição de método "{0}" não está acessível neste contexto.
ru: Определение метода "{0}" недоступно в этом контексте.
tr: '{0}' yönteminin tanımına bu bağlamda erişilemiyor.
zh_hans: 方法“{0}”的定义在此上下文中不可访问。
zh_hant: 在此內容中無法存取方法 '{0}' 的定義。

# ERR_CannotUseOnErrorGotoWithClosure
source: Method cannot contain both a '{0}' statement and a definition of a variable that is used in a lambda or query expression.
cs: Metoda nemůže obsahovat příkaz {0} i definici proměnné, která se používá v lambda výrazu nebo ve výrazu dotazu.
de: Eine Methode kann nicht gleichzeitig eine {0}-Anweisung und eine Definition einer Variablen enthalten, die in einem Lambda- oder Abfrageausdruck verwendet wird.
es: El método no puede contener una instrucción '{0}' y una definición de una variable que se use en una expresión lambda o de consulta.
fr: La méthode ne peut pas contenir une instruction '{0}' et une définition d'une variable qui est utilisée dans une expression lambda ou de requête.
it: Il metodo non può contenere sia un'istruzione '{0}' che una definizione di una variabile usata in un'espressione lambda o di query.
ja: メソッドに '{0}' ステートメントとラムダ式またはクエリ式で使用される変数の定義の両方を含むことはできません。
ko: 메서드는 '{0}' 문과 람다 또는 쿼리 식에 사용되는 변수 정의를 모두 포함할 수 없습니다.
pl: Metoda nie może zawierać zarówno instrukcji „{0}”, jak i definicji zmiennej użytej w wyrażeniu lambda lub wyrażeniu zapytania.
pt_br: O método não pode conter uma instrução "{0}" e uma definição de uma variável que é usada em uma expressão lambda ou de consulta.
ru: Метод не может одновременно содержать оператор "{0}" и определение переменной, которая используется в лямбда-выражении или выражении запроса.
tr: Yöntem hem bir '{0}' deyimi hem de lambda veya sorgu ifadesinde kullanılan bir değişken tanımı içeremez.
zh_hans: 方法不能同时包含“{0}”语句以及在 lambda 或查询表达式中使用的变量的定义。
zh_hant: 方法不可同時包含 '{0}' 陳述式以及用於 Lambda 或查詢運算式中的變數定義。

# ERR_CannotGotoNonScopeBlocksWithClosure
source: '{0}{1}' is not valid because '{2}' is inside a scope that defines a variable that is used in a lambda or query expression.
cs: '{0}{1} je neplatný, protože {2} se nachází v oboru definujícím proměnnou, která se používá v lambda výrazu nebo ve výrazu dotazu.
de: '"{0}{1}" ist ungültig, weil sich "{2}" in einem Bereich befindet, der eine Variable definiert, die in einem Lambdaausdruck oder einem Abfrageausdruck verwendet wird.
es: '{0}{1}' no es válido porque '{2}' está dentro de un ámbito que define una variable que se usa en una expresión lambda o de consulta.
fr: '{0}{1}' n'est pas valide, car '{2}' se trouve dans une portée qui définit une variable utilisée dans une expression lambda ou une expression de requête.
it: '{0}{1}' non è valido perché '{2}' si trova all'interno di un ambito che definisce una variabile usata in un'espressione lambda o in un'espressione di query.
ja: '{2}' は、ラムダ式またはクエリ式で使用される変数を定義するスコープの内側にあるため、'{0}{1}' は有効ではありません。
ko: '{2}'이(가) 람다 또는 쿼리 식에 사용되는 변수를 정의하는 범위 안에 있으므로 '{0}{1}'이(가) 유효하지 않습니다.
pl: 'Instrukcja „{0}{1}” jest nieprawidłowa, ponieważ element „{2}” znajduje się wewnątrz zakresu, który definiuje zmienną używaną w wyrażeniu lambda lub wyrażeniu zapytania.
pt_br: "{0}{1}" não é válido porque "{2}" está dentro de um escopo que define uma variável que é usada em uma expressão lambda ou de consulta.
ru: "{0}{1}" является недопустимым, поскольку "{2}" находится внутри области, которая определяет переменную, используемую в лямбда-выражении или выражении запроса.
tr: '{2}' bir lambda veya sorgu ifadesinde kullanılmış bir değişken tanımlayan kapsamın içinde yer aldığından, '{0}{1}' geçerli değil.
zh_hans: '“{0}{1}”无效，因为“{2}”所在的范围定义一个用在 lambda 表达式或查询表达式中的变量。
zh_hant: '{0}{1}' 無效，因為 '{2}' 所在的範圍內，定義了用於 Lambda 或查詢運算式中的變數。
