Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidTypeForAliasesImport2
source: '{1}' for the Imports alias to '{0}' does not refer to a Namespace, Class, Structure, Interface, Enum or Module.
cs: 'Název {1} aliasu importu {0} neodkazuje na prvky Namespace, Class, Structure, Interface, Enum ani Module.
de: '"{1}" für den Imports-Alias für "{0}" bezieht sich nicht auf einen Namespace, eine Klasse, eine Struktur, eine Schnittstelle, eine Enumeration oder ein Modul.
es: '{1}' del alias de Imports para '{0}' no hace referencia a un espacio de nombres, una clase, una estructura, una interfaz, una enumeración ni un módulo.
fr: '{1}' utilisé pour l'alias Imports de '{0}' ne fait pas référence à un Namespace, Class, Structure, Interface, Enum ou Module.
it: '{1}' per l'alias di Imports per '{0}' non si riferisce uno spazio dei nomi, a una classe, a una struttura, a un'interfaccia, a un'enumerazione o a un modulo.
ja: '{0}' へのエイリアスのインポート '{1}' は Namespace、Class、Structure、Interface、Enum または Module を参照していません。
ko: '{0}'에 대한 Imports 별칭의 '{1}'은(는) Namespace, Class, Structure, Interface, Enum 또는 Module을 참조하지 않습니다.
pl: Element „{1}” dla aliasu Imports elementu „{0}” nie odwołuje się do elementu Namespace, Class, Structure, Interface, Enum lub Module.
pt_br: "{1}" para o alias Imports para "{0}" não se refere a um Namespace, Classe, Estrutura, Interface, Enum ou Módulo.
ru: "{1}" псевдонима Imports для "{0}" не ссылается на Namespace, Class, Structure, Interface, Enum или Module.
tr: 'Imports diğer adı '{0}' için olan '{1}' bir Namespace, Class, Structure, Interface, Enum veya Module başvurusu yapmıyor.
zh_hans: '“{0}”的 Imports 别名的“{1}”不引用命名空间、类、结构、接口、枚举或模块。
zh_hant: 'Imports 別名為 '{0}' 的 '{1}'，並未參考 Namespace、Class、Structure、Interface、Enum 或 Module。

# ERR_UnsupportedConstant2
source: Field '{0}.{1}' has an invalid constant value.
cs: Pole {0}.{1} má neplatnou konstantní hodnotu.
de: Das Feld "{0}.{1}" hat einen ungültigen Konstantenwert.
es: El campo '{0}.{1}' tiene un valor de constante no válido.
fr: Le champ '{0}.{1}' a une valeur constante non valide.
it: Il campo '{0}.{1}' contiene un valore costante non valido.
ja: フィールド '{0}.{1}' の定数値が無効です。
ko: {0}.{1}' 필드에 잘못된 상수 값이 있습니다.
pl: Pole „{0}.{1}” ma nieprawidłową wartość stałej.
pt_br: Campo "{0}.{1}" tem um valor de constante inválido.
ru: Поле "{0}.{1}" имеет недопустимое константное значение.
tr: {0}.{1}' alanında geçersiz sabit değeri var.
zh_hans: 字段“{0}.{1}”具有无效常量值。
zh_hant: 欄位 '{0}.{1}' 的常數值無效。

# ERR_ObsoleteArgumentsNeedParens
source: Method arguments must be enclosed in parentheses.
cs: Argumenty metody musí být v závorkách.
de: Methodenargumente müssen in Klammern stehen.
es: Los argumentos de método se deben incluir entre paréntesis.
fr: Les arguments de méthode doivent être mis entre parenthèses.
it: Gli argomenti del metodo devono essere racchiusi tra parentesi.
ja: メソッドの引数はかっこで囲む必要があります。
ko: 메서드 인수는 괄호로 묶어야 합니다.
pl: Argumenty metod muszą być ujęte w nawiasy.
pt_br: Os argumentos do método devem ser delimitados por parênteses.
ru: Аргументы метода должны быть заключены в круглые скобки.
tr: Yöntem bağımsız değişkenleri ayraç içine alınmalıdır.
zh_hans: 方法参数必须括在括号中。
zh_hant: 方法引數必須放在括號之中。

# ERR_ObsoleteLineNumbersAreLabels
source: Labels that are numbers must be followed by colons.
cs: Za návěstími, která jsou jenom číselná, musí být uvedena dvojtečka.
de: Nach Bezeichnungen, die Zahlen sind, muss ein Doppelpunkt stehen.
es: Las etiquetas que son números deben ir seguidas de dos puntos.
fr: Les étiquettes qui sont des nombres doivent être suivies du signe deux-points.
it: Le etichette relative a numeri devono essere seguite da un segno di due punti.
ja: 数字のラベルの後にはコロンが必要です。
ko: 숫자 레이블 뒤에는 콜론이 와야 합니다.
pl: Po etykietach, które są liczbami, muszą następować dwukropki.
pt_br: Rótulos que são números devem ser seguidos por dois-pontos.
ru: После числовых меток следует ставить двоеточие.
tr: Sayı olan etiketlerden sonra iki nokta işareti gelmelidir.
zh_hans: 数字标签后面必须跟冒号。
zh_hant: 內容為數字的標籤之後必須跟隨冒號。

# ERR_ObsoleteStructureNotType
source: 'Type' statements are no longer supported; use 'Structure' statements instead.
cs: 'Příkazy Type už nejsou podporované. Použijte místo nich příkazy Structure.
de: 'Type-Anweisungen werden nicht mehr unterstützt. Verwenden Sie stattdessen Structure-Anweisungen.
es: 'Ya no se admiten las instrucciones 'Type'; use las instrucciones 'Structure' en su lugar.
fr: 'Les instructions 'Type' ne sont plus prises en charge ; utilisez les instructions 'Structure' à la place.
it: 'Le istruzioni 'Type' non sono più supportate. Usare le istruzioni 'Structure'.
ja: 'Type' ステートメントはサポートされなくなりました。'Structure' ステートメントを使用してください。
ko: 'Type' 문이 더 이상 지원되지 않으므로 대신 'Structure' 문을 사용하세요.
pl: 'Instrukcje „Type” nie są już obsługiwane. Zamiast nich używaj instrukcji „Structure”.
pt_br: 'Não há mais suporte a instruções 'Type'; use instruções 'Structure' no lugar.
ru: 'Операторы "Type" больше не поддерживаются; используйте операторы "Structure".
tr: 'Type' deyimleri artık desteklenmiyor; bunun yerine 'Structure' deyimlerini kullanın.
zh_hans: '不再支持 "Type" 语句；请改用 "Structure" 语句。
zh_hant: '不再支援 'Type' 陳述式。請使用 'Structure' 陳述式代替。

# ERR_ObsoleteObjectNotVariant
source: 'Variant' is no longer a supported type; use the 'Object' type instead.
cs: 'Typ Variant už není podporovaný. Použijte místo něj typ Object.
de: 'Der Typ "Variant" wird nicht mehr unterstützt. Verwenden Sie stattdessen den Typ "Object".
es: 'Ya no se admite el tipo 'Variant'; use el tipo 'Object' en su lugar.
fr: 'Variant' n'est plus un type pris en charge ; utilisez le type 'Object' à la place.
it: 'Il tipo 'Variant' non è più supportato. Usare il tipo 'Object'.
ja: 'Variant' 型はサポートされなくなりました。'Object' 型を使用してください。
ko: 'Variant' 형식이 더 이상 지원되지 않으므로 대신 'Object' 형식을 사용하세요.
pl: 'Typ Variant nie jest już obsługiwany; zamiast niego użyj typu Object.
pt_br: 'Não há mais suporte ao tipo 'Variant'; use o tipo 'Object' no lugar.
ru: 'Тип "Variant" больше не поддерживается; используйте тип "Object".
tr: 'Variant' türü artık desteklenmiyor; bunun yerine 'Object' türünü kullanın.
zh_hans: '"Variant" 不再是受支持的类型；请改用 "Object" 类型。
zh_hant: '不再支援 'Variant' 類型。請使用 'Object' 類型代替。

# ERR_ObsoleteLetSetNotNeeded
source: 'Let' and 'Set' assignment statements are no longer supported.
cs: 'Přiřazovací příkazy Let a Set už nejsou podporované.
de: 'Let- und Set-Zuweisungsanweisungen werden nicht mehr unterstützt.
es: 'No se admiten instrucciones de asignación 'Let' y 'Set'.
fr: 'Les instructions d'assignation 'Let' et 'Set' ne sont plus prises en charge.
it: 'Le istruzioni di assegnazione 'Let' e 'Set' non sono più supportate.
ja: 'Let' および 'Set' 代入ステートメントはサポートされなくなりました。
ko: 'Let' 및 'Set' 대입문은 더 이상 지원되지 않습니다.
pl: 'Instrukcje przypisania Let i Set nie są już obsługiwane.
pt_br: 'Não há mais suporte às instruções de atribuição 'Let' e 'Set'.
ru: 'Операторы назначения "Let" и "Set" больше не поддерживаются.
tr: 'Let' ve 'Set' atama deyimleri artık desteklenmiyor.
zh_hans: '不再支持 "Let" 和 "Set" 赋值语句。
zh_hant: '不再支援 'Let' 和 'Set' 指派陳述式。

# ERR_ObsoletePropertyGetLetSet
source: Property Get/Let/Set are no longer supported; use the new Property declaration syntax.
cs: Vlastnosti Get, Let a Set už nejsou podporované. Použijte novou syntaxi deklarace vlastností.
de: "Property Get/Let/Set" werden nicht mehr unterstützt. Verwenden Sie die neue Syntax zum Deklarieren von Eigenschaften.
es: No se admiten las propiedades Get/Let/Set; use la nueva sintaxis de declaración de propiedad.
fr: Property Get/Let/Set ne sont plus pris en charge ; utilisez la nouvelle syntaxe de déclaration Property.
it: Get, Let e Set non sono più supportati per le proprietà. Usare la nuova sintassi di dichiarazione delle proprietà.
ja: Property Get/Let/Set はサポートされなくなりました。新しい Property 宣言の構文を使用してください。
ko: Property Get/Let/Set이 더 이상 지원되지 않으므로 새 Property 선언 구문을 사용하세요.
pl: Instrukcje Get/Let/Set dotyczące właściwości nie są już obsługiwane; użyj nowej składni deklaracji właściwości.
pt_br: Não há mais suporte às propriedades Get/Let/Set; use a nova sintaxe de declaração de propriedade.
ru: Операторы "Property Get/Let/Set" больше не поддерживаются; используйте новый синтаксис объявления свойств.
tr: Get/Let/Set özelliği artık desteklenmiyor; yeni Property bildirimi söz dizimini kullanın.
zh_hans: 不再支持 Property Get/Let/Set；请使用新的 Property 声明语法。
zh_hant: 不再支援 Property Get/Let/Set; 請使用新的 Property 宣告語法。

# ERR_ObsoleteWhileWend
source: 'Wend' statements are no longer supported; use 'End While' statements instead.
cs: 'Příkazy Wend už nejsou podporované. Použijte místo nich příkazy End While.
de: 'Wend-Anweisungen werden nicht mehr unterstützt. Verwenden Sie stattdessen "End While"-Anweisungen.
es: 'Ya no se admiten instrucciones 'Wend'; use instrucciones 'End While' en su lugar.
fr: 'Les instructions 'Wend' ne sont plus prises en charge ; utilisez les instructions 'End While' à la place.
it: 'Le istruzioni 'Wend' non sono più supportate. Usare le istruzioni 'End While'.
ja: 'Wend' ステートメントはサポートされなくなりました。'End While' ステートメントを使用してください。
ko: 'Wend' 문은 더 이상 지원되지 않습니다. 대신 'End While' 문을 사용하세요.
pl: 'Instrukcje „Wend” nie są już obsługiwane. Zamiast nich używaj instrukcji „End While”.
pt_br: 'Não há mais suporte a instruções 'Wend'; use instruções 'End While' no lugar.
ru: 'Операторы "Wend" больше не поддерживаются; используйте операторы "End While".
tr: 'Wend' deyimleri artık desteklenmiyor; bunun yerine 'End While' deyimlerini kullanın.
zh_hans: '不再支持 "Wend" 语句；请改用 "End While" 语句。
zh_hant: '不再支援 'Wend' 陳述式; 請使用 'End While' 陳述式代替。

# ERR_ObsoleteRedimAs
source: 'ReDim' statements can no longer be used to declare array variables.
cs: 'K deklaraci proměnných polí už nejde použít příkazy ReDim.
de: 'Die Anweisung "ReDim" kann nicht mehr zum Deklarieren von Arrayvariablen verwendet werden.
es: 'Las instrucciones 'ReDim' ya no se pueden usar para declarar variables de matriz.
fr: 'Les instructions 'ReDim' ne peuvent plus être utilisées pour déclarer des variables tableau.
it: 'Non è più possibile usare le istruzioni 'ReDim' per dichiarare le variabili di matrice.
ja: '配列変数を宣言するために 'ReDim' ステートメントを使用することはできません。
ko: 'ReDim' 문은 더 이상 배열 변수를 선언하는 데 사용할 수 없습니다.
pl: 'Nie można już używać instrukcji ReDim do deklarowania zmiennych tablicowych.
pt_br: 'Instruções 'ReDim' não podem mais ser usadas para declarar variáveis de matriz.
ru: 'Операторы "ReDim" больше не используются при объявлении переменных-массивов.
tr: 'ReDim' deyimleri artık dizi değişkenlerini bildirmek için kullanılamaz.
zh_hans: '"ReDim" 语句不能再用于声明数组变量。
zh_hant: '無法再使用 'ReDim' 陳述式來宣告陣列變數。

# ERR_ObsoleteOptionalWithoutValue
source: Optional parameters must specify a default value.
cs: Nepovinné parametry musí určovat výchozí hodnotu.
de: Optionale Parameter müssen einen Standardwert angeben.
es: Los parámetros opcionales deben especificar un valor predeterminado.
fr: Les paramètres optionnels doivent spécifier une valeur par défaut.
it: I parametri facoltativi devono specificare un valore predefinito.
ja: 省略可能なパラメーターには、既定値を指定する必要があります。
ko: 선택적 매개 변수는 기본값을 지정해야 합니다.
pl: Parametry opcjonalne muszą określać wartość domyślną.
pt_br: Parâmetros opcionais devem especificar um valor padrão.
ru: Для необязательных параметров должны быть заданы значения по умолчанию.
tr: İsteğe bağlı parametreler varsayılan değer belirtmelidir.
zh_hans: 可选参数必须指定默认值。
zh_hant: 選擇性參數必須指定預設值。

# ERR_ObsoleteGosub
source: 'GoSub' statements are no longer supported.
cs: 'Příkazy GoSub už nejsou podporované.
de: 'GoSub-Anweisungen werden nicht mehr unterstützt.
es: 'Ya no se admiten instrucciones 'GoSub'.
fr: 'Les instructions 'GoSub' ne sont plus prises en charge.
it: 'Le istruzioni 'GoSub' non sono più supportate.
ja: 'GoSub' ステートメントはサポートされなくなりました。
ko: 'GoSub' 문은 더 이상 지원되지 않습니다.
pl: 'Instrukcje GoSub nie są już obsługiwane.
pt_br: 'Não há mais suporte a instruções 'GoSub'.
ru: 'Операторы "GoSub" больше не поддерживаются.
tr: 'GoSub' deyimleri artık desteklenmiyor.
zh_hans: '不再支持 "GoSub" 语句。
zh_hant: '不再支援 'GoSub' 陳述式。

# ERR_ObsoleteOnGotoGosub
source: 'On GoTo' and 'On GoSub' statements are no longer supported.
cs: 'Příkazy On GoTo a On GoSub už nejsou podporované.
de: 'Die Anweisungen "On GoTo" und "On GoSub" werden nicht mehr unterstützt.
es: 'No se admiten las instrucciones 'OnGoTo' ni 'OnGoSub'.
fr: 'Les instructions 'On GoTo' et 'On GoSub' ne sont plus prises en charge.
it: 'Le istruzioni 'On GoTo' e 'On GoSub' non sono più supportate.
ja: 'On GoTo' および 'On GoSub' ステートメントはサポートされなくなりました。
ko: 'On GoTo' 및 'On GoSub' 문은 더 이상 지원되지 않습니다.
pl: 'Instrukcje On GoTo i On GoSub nie są już obsługiwane.
pt_br: 'Não há mais suporte a instruções 'On GoTo' e 'On GoSub'.
ru: 'Операторы "On GoTo" и "On GoSub" больше не поддерживаются.
tr: 'On GoTo' ve 'On GoSub' deyimleri artık desteklenmiyor.
zh_hans: '不再支持 "On GoTo" 和 "On GoSub" 语句。
zh_hant: '不再支援 'On GoTo' 和 'On GoSub' 陳述式。

# ERR_ObsoleteEndIf
source: 'EndIf' statements are no longer supported; use 'End If' instead.
cs: 'Příkazy EndIf už nejsou podporované. Použijte místo nich příkazy End If.
de: 'EndIf-Anweisungen werden nicht mehr unterstützt. Verwenden Sie stattdessen "End If".
es: 'Ya no se admiten instrucciones 'EndIf'; use 'End If' en su lugar.
fr: 'Les instructions 'EndIf' ne sont plus prises en charge ; utilisez 'End If' à la place.
it: 'Le istruzioni 'EndIf' non sono più supportate. Usare 'End If'.
ja: 'EndIf' ステートメントはサポートされなくなりました。'End If' を使用してください。
ko: 'EndIf' 문은 더 이상 지원되지 않습니다. 대신 'End If' 문을 사용하세요.
pl: 'Instrukcje „EndIf” nie są już obsługiwane; zamiast nich używaj instrukcji „End If”.
pt_br: 'Não há mais suporte a instruções 'EndIf'; use instruções 'End If' no lugar.
ru: 'Операторы "EndIf" больше не поддерживаются; используйте "End If".
tr: 'EndIf' deyimleri artık desteklenmiyor; bunun yerine 'End If' kullanın.
zh_hans: '不再支持 "EndIf" 语句；请改用 "End If"。
zh_hant: '不再支援 'EndIf' 陳述式; 請使用 'End If' 代替。

# ERR_ObsoleteExponent
source: 'D' can no longer be used to indicate an exponent, use 'E' instead.
cs: 'Znak D už nejde použít k označení exponentu. Použijte místo něho znak E.
de: '"D" darf nicht zum Beschreiben eines Exponenten verwendet werden. Verwenden Sie stattdessen "E".
es: 'D' ya no se puede usar para indicar un exponente; use 'E' en su lugar.
fr: 'D' ne peut plus être utilisé pour indiquer un exposant ; utilisez 'E' à la place.
it: 'Non è più possibile usare 'D' per indicare un esponente. Usare 'E'.
ja: 'D' は指数を表す文字として使用できません。'E' を使用してください。
ko: '지수를 가리키는 데 더 이상 'D'를 사용할 수 없습니다. 대신 'E'를 사용하세요.
pl: 'Litery „D” nie można już używać do określenia wykładnika; zamiast niej użyj litery „E”.
pt_br: 'D' não pode mais ser utilizado para indicar um expoente, use 'E' no lugar.
ru: '"D" больше не может использоваться для обозначения показателя степени; используйте "E".
tr: 'D' artık üs gösteriminde kullanılamıyor, bunun yerine 'E' kullanın.
zh_hans: '"D" 不能再用来表示指数；请改用 "E"。
zh_hant: '不再使用 'D' 來表示指數，請使用 'E' 代替。

# ERR_ObsoleteAsAny
source: 'As Any' is not supported in 'Declare' statements.
cs: 'Klíčová slova As Any už nejsou podporovaná v příkazech Declare.
de: '"As Any" wird in Declare-Anweisungen nicht unterstützt.
es: 'As Any' no se admite en instrucciones 'Declare'.
fr: 'As Any' n'est pas pris en charge dans les instructions 'Declare'.
it: 'As Any' non è supportato nelle istruzioni 'Declare'.
ja: 'As Any' は、'Declare' ステートメントではサポートされていません。
ko: 'Declare' 문에서는 'As Any'가 지원되지 않습니다.
pl: 'Element As Any nie jest obsługiwany w instrukcjach Declare.
pt_br: 'Não há suporte para 'As Any' em instruções 'Declare'.
ru: '"As Any" в операторах "Declare" не поддерживается.
tr: 'Declare' deyimlerinde 'As Any' desteklenmiyor.
zh_hans: '"Declare" 语句中不支持 "As Any"。
zh_hant: 'Declare' 陳述式中不支援 'As Any'。

# ERR_ObsoleteGetStatement
source: 'Get' statements are no longer supported. File I/O functionality is available in the 'Microsoft.VisualBasic' namespace.
cs: 'Příkazy Get už nejsou podporované. Funkce pro vstupně-výstupní operace se soubory jsou k dispozici v oboru názvů Microsoft.VisualBasic.
de: 'Get-Anweisungen werden nicht mehr unterstützt. Die Datei-E/A-Funktionen sind im Microsoft.VisualBasic-Namespace verfügbar.
es: 'Ya no se admiten instrucciones 'Get'. La funcionalidad de E/S de archivo está disponible en el espacio de nombres 'Microsoft.VisualBasic'.
fr: 'Les instructions 'Get' ne sont plus prises en charge. La fonctionnalité d'E/S de fichier est disponible dans l'espace de noms 'Microsoft.VisualBasic'.
it: 'Le istruzioni 'Get' non sono più supportate. La funzionalità di I/O dei file è disponibile nello spazio dei nomi 'Microsoft.VisualBasic'.
ja: 'Get' ステートメントはサポートされなくなりました。ファイル I/O の機能は 'Microsoft.VisualBasic' 名前空間で使用できます。
ko: 'Get' 문은 더 이상 지원되지 않습니다. 파일 I/O 기능은 'Microsoft.VisualBasic' 네임스페이스에서 사용할 수 있습니다.
pl: 'Instrukcje „Get” nie są już obsługiwane. Funkcje We/Wy dla plików są dostępne w przestrzeni nazw „Microsoft.VisualBasic”.
pt_br: 'Não há mais suporte a instruções 'Get'. A funcionalidade de E/S de arquivos está disponível no namespace 'Microsoft.VisualBasic'.
ru: 'Операторы "Get" больше не поддерживаются. Возможности ввода/вывода файлов доступны в пространстве имен Microsoft.VisualBasic.
tr: 'Get' deyimleri artık desteklenmiyor. Dosya G/Ç işlevselliği 'Microsoft.VisualBasic' ad uzayında kullanılabilir.
zh_hans: '不再支持 "Get" 语句。"Microsoft.VisualBasic" 命名空间中有文件 I/O 功能。
zh_hant: '不再支援 'Get' 陳述式。檔案 I/O 的功能可以在 'Microsoft.VisualBasic' 命名空間中使用。

# ERR_OverrideWithArrayVsParamArray2
source: '{0}' cannot override '{1}' because they differ by parameters declared 'ParamArray'.
cs: '{0} nemůže přepsat {1}, protože se liší parametry deklarovanými jako ParamArray.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch Parameter unterscheiden, die als ParamArray deklariert sind.
es: '{0}' no puede invalidar '{1}' porque se diferencian en los parámetros declarados como 'ParamArray'.
fr: '{0}' ne peut pas se substituer à '{1}', car les paramètres déclarés 'ParamArray' les différencient.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i parametri dichiarati come 'ParamArray'.
ja: 'ParamArray' として宣言されたパラメーターが異なるため、'{0}' は '{1}' をオーバーライドできません。
ko: '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다. 'ParamArray'로 선언된 매개 변수가 다릅니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się parametrami zadeklarowanymi jako „ParamArray”.
pt_br: "{0}" não pode substituir "{1}" porque diferem por parâmetros declarados "ParamArray".
ru: "{0}" не может переопределить "{1}", так как они отличаются по параметрам, объявленным как "ParamArray".
tr: '{0}' , 'ParamArray' olarak bildirilen parametreleri farklı olduğundan '{1}' öğesini geçersiz kılamıyor.
zh_hans: “{0}”无法重写“{1}”，因为它们在声明为 "ParamArray" 的参数上存在差异。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其宣告為 'ParamArray' 的參數不同。

# ERR_CircularBaseDependencies4
source: This inheritance causes circular dependencies between {0} '{1}' and its nested or base type '{2}'.
cs: Toto dědění způsobuje cyklické závislosti mezi {0} – {1} a jeho vnořeným nebo základním typem {2}.
de: Diese Vererbung verursacht Ringabhängigkeiten zwischen {0} "{1}" und seinem geschachtelten oder Basistyp "{2}".
es: Esta herencia produce dependencias circulares entre {0} '{1}' y su tipo anidado o base '{2}'.
fr: Cet héritage provoque des dépendances circulaires entre {0} '{1}' et son '{2}' incorporé ou type de base.
it: L'ereditarietà causa dipendenze circolari tra {0} '{1}' e il relativo tipo di base o annidato '{2}'.
ja: この継承では、{0} '{1}' とその入れ子になったまたは基本型 '{2}' の間で循環依存関係が発生します。
ko: 이 상속 때문에 {0} '{1}' 및 그 안에 중첩된 형식이나 기본 형식 '{2}' 사이에서 순환 종속성이 발생합니다.
pl: To dziedziczenie powoduje powstanie zależności cyklicznych między elementem {0} „{1}” a jego zagnieżdżonym lub podstawowym typem „{2}”.
pt_br: Esta herança causa dependências circulares entre {0} "{1}" e seu tipo aninhado ou base "{2}".
ru: Данное наследование приводит к циклической зависимости между {0} "{1}" и вложенным в него или базовым типом "{2}".
tr: Bu devralma {0} '{1}' ile '{2}' iç içe veya temel türü arasında döngüsel bağımlılıklara neden oluyor.
zh_hans: 此继承将导致在 {0}“{1}”及其嵌套类型或基类型“{2}”之间产生循环依赖项。
zh_hant: 此繼承會導致 {0} '{1}' 與其巢狀或基底類型 '{2}' 之間發生循環相依。

# ERR_NestedBase2
source: {0} '{1}' cannot inherit from a type nested within it.
cs: {0} {1} nemůže dědit z typu, který je do něho vnořený.
de: {0} "{1}" kann nicht von einem in ihr bzw. ihm geschachtelten Typ erben.
es: {0} '{1}' no puede heredar de un tipo anidado dentro de él.
fr: {0} '{1}' ne peut pas hériter d'un type imbriqué.
it: {0} '{1}' non può ereditare da un tipo annidato al suo interno.
ja: {0} '{1}' は、その中に入れ子にされた型から継承することはできません。
ko: {0} '{1}'은(는) 그 안에 중첩된 형식에서 상속할 수 없습니다.
pl: Element {0} „{1}” nie może dziedziczyć po typie, który jest w nim zagnieżdżony.
pt_br: {0} "{1}" não pode herdar de um tipo aninhado dentro dele.
ru: {0} "{1}" не может наследовать из вложенного в него типа.
tr: {0} '{1}' kendi içinde iç içe olan bir türden devralamaz.
zh_hans: {0}“{1}”不能从嵌套在它里面的类型继承。
zh_hant: {0} '{1}' 無法繼承自其內部的巢狀類型。

# ERR_AccessMismatchOutsideAssembly4
source: '{0}' cannot expose type '{1}' outside the project through {2} '{3}'.
cs: '{0} nemůže vystavovat typ {1} mimo projekt prostřednictvím {2} - {3}.
de: '"{0}" kann den Typ "{1}" nicht außerhalb des Projekts über {2} "{3}" verfügbar machen.
es: '{0}' no puede exponer el tipo '{1}' fuera del proyecto a través de {2} '{3}'.
fr: '{0}' ne peut pas exposer le type '{1}' en dehors du projet via {2} '{3}'.
it: '{0}' non può esporre il tipo '{1}' all'esterno del progetto mediante {2} '{3}'.
ja: '{0}' は、型 '{1}' を {2} '{3}' 経由でプロジェクトの外側に公開できません。
ko: '{0}'은(는) {2} '{3}'을(를) 통해 '{1}' 형식을 프로젝트 외부로 노출할 수 없습니다.
pl: 'Element „{0}” nie może ujawnić typu „{1}” poza projektem za pomocą elementu {2} „{3}”.
pt_br: "{0}" não pode expor o tipo "{1}" fora do projeto através de {2} "{3}".
ru: "{0}" не может представлять тип "{1}" вне проекта посредством {2} "{3}".
tr: '{0}', {2} '{3}' aracılığıyla projenin dışında '{1}' türünü gösteremiyor.
zh_hans: '“{0}”不能通过 {2}“{3}”在项目外部公开类型“{1}”。
zh_hant: '{0}' 無法經由 {2} '{3}'，在專案外公開類型 '{1}'。

# ERR_InheritanceAccessMismatchOutside3
source: '{0}' cannot inherit from {1} '{2}' because it expands the access of the base {1} outside the assembly.
cs: '{0} nemůže dědit z {1} - {2}, protože rozšiřuje přístup základní třídy {1} mimo sestavení.
de: '"{0}" erweitert den Zugriff der Basis-{1} außerhalb der Assembly und kann daher nicht von {1} "{2}" erben.
es: '{0}' no puede heredar de {1} '{2}' porque expande el acceso de la base {1} fuera del ensamblado.
fr: '{0}' ne peut pas hériter de {1} '{2}', car il étend l'accès du {1} de base en dehors de l'assembly.
it: '{0}' non può ereditare da {1} '{2}' perché espande l'accesso dell'elemento {1} base all'esterno dell'assembly.
ja: 'ベース {1} のアクセスをアセンブリの外側に展開しているため、'{0}' は {1} '{2}' から継承できません。
ko: '{0}'은(는) 기본 {1}의 액세스를 해당 어셈블리 범위 밖으로 확장하므로 {1} '{2}'에서 상속할 수 없습니다.
pl: 'Element „{0}” nie może dziedziczyć po elemencie {1} „{2}”, ponieważ rozszerza on dostęp podstawowego elementu {1} poza zestaw.
pt_br: "{0}" não pode herdar de {1} "{2}" porque ele expande o acesso da base {1} fora do assembly.
ru: "{0}" не может наследовать от {1} "{2}", поскольку он расширяет доступ базы {1} за пределы сборки.
tr: 'Temel {1} erişimini derlemenin dışına genişlettiğinden '{0}', {1} '{2}' öğesinden özellik devralamaz.
zh_hans: '“{0}”将对基 {1} 的访问扩展到程序集之外，因此无法从 {1}“{2}”继承。
zh_hant: '{0}' 無法繼承自 {1} '{2}'，因為其會在組件外展開基底 {1} 的存取。
