Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AutoPropertyCantBeWriteOnly
source: Auto-implemented properties cannot be WriteOnly.
cs: Automaticky implementované vlastnosti nemůžou mít stav WriteOnly.
de: Automatisch implementierte Eigenschaften können nicht WriteOnly sein.
es: Las propiedades implementadas automáticamente no pueden ser WriteOnly.
fr: Les propriétés implémentées automatiquement ne peuvent pas être WriteOnly.
it: Le proprietà implementate automaticamente non possono essere WriteOnly.
ja: 自動実装プロパティを WriteOnly にすることはできません。
ko: 자동 구현 속성은 WriteOnly일 수 없습니다.
pl: Właściwości implementowane automatycznie nie mogą mieć określonego ustawienia WriteOnly.
pt_br: As propriedades autoimplementadas não podem ser WriteOnly.
ru: Автоматически реализуемые свойства не могут иметь значение WriteOnly.
tr: Otomatik uygulanan özellikler WriteOnly olamaz.
zh_hans: 自动实现的属性不能为 WriteOnly。
zh_hant: 自動實作的屬性不可為 WriteOnly。

# ERR_IllegalOperandInIIFCount
source: 'If' operator requires either two or three operands.
cs: 'Operátor If vyžaduje dva nebo tři operandy.
de: 'Der If-Operator erfordert zwei oder drei Operanden.
es: 'El operador 'If' requiere dos o tres operandos.
fr: 'L'opérateur 'If' requiert deux ou trois opérandes.
it: 'L'operatore 'If' richiede due o tre operandi.
ja: 'If' 演算子には 2 つまたは 3 つのオペランドが必要です。
ko: 'If' 연산자에는 두 개 또는 세 개의 피연산자가 필요합니다.
pl: 'Operator „If” wymaga dwóch lub trzech argumentów.
pt_br: 'O operador 'If' requer dois ou três operandos.
ru: 'Оператор "If" должен содержать два или три операнда.
tr: 'If' işleci iki ya da üç işlenen gerektirir.
zh_hans: '“If”运算符需要两个或三个操作数。
zh_hant: 'If' 運算子需要兩個或三個運算元。

# ERR_NotACollection1
source: Cannot initialize the type '{0}' with a collection initializer because it is not a collection type.
cs: Nejde inicializovat typ {0} s inicializátorem kolekcí, protože se nejedná o typ kolekce.
de: Der Typ "{0}" kann nicht mit einem Sammlungsinitialisierer initialisiert werden, weil es sich nicht um einen Sammlungstyp handelt.
es: No se puede inicializar el tipo '{0}' con un inicializador de colección porque no es un tipo de colección.
fr: Impossible d'initialiser le type '{0}' avec un initialiseur de collection, car il ne s'agit pas d'un type de collection.
it: Non è possibile inizializzare il tipo '{0}' con un inizializzatore di raccolta perché non è un tipo di raccolta.
ja: 型 '{0}' はコレクション型ではないため、コレクション初期化子で初期化することはできません。
ko: '{0}' 형식이 컬렉션 형식이 아니므로 컬렉션 이니셜라이저를 사용하여 해당 형식을 초기화할 수 없습니다.
pl: Nie można zainicjować typu „{0}” za pomocą inicjatora kolekcji, ponieważ to nie jest typ kolekcji.
pt_br: Não é possível inicializar o tipo "{0}" com um inicializador de coleção porque ele não é um tipo de coleção.
ru: Невозможно инициализировать тип "{0}" с инициализатором набора, так как он не является типом коллекции.
tr: Bir koleksiyon türü olmadığı için '{0}' türü koleksiyon başlatıcısıyla başlatılamaz.
zh_hans: 无法用集合初始值设定项初始化类型“{0}”，因为该类型不是集合类型。
zh_hant: 因為類型 '{0}' 並非集合類型，所以無法利用集合初始設定式初始化該類型。

# ERR_NoAddMethod1
source: Cannot initialize the type '{0}' with a collection initializer because it does not have an accessible 'Add' method.
cs: Nejde inicializovat typ {0} s inicializátorem kolekcí, protože nemá přístupnou metodu Add.
de: Der Typ "{0}" kann nicht mit einem Sammlungsinitialisierer initialisiert werden, weil er nicht über eine Add-Methode verfügt, auf die zugegriffen werden kann.
es: No se puede inicializar el tipo '{0}' con un inicializador de colección porque no tiene un método 'Add' accesible.
fr: Impossible d'initialiser le type '{0}' avec un initialiseur de collection, car il n'a pas de méthode 'Add' accessible.
it: Non è possibile inizializzare il tipo '{0}' con un inizializzatore di raccolta perché non ha un metodo 'Add' accessibile.
ja: 型 '{0}' にはアクセス可能な 'Add' メソッドがないため、コレクション初期化子で初期化することはできません。
ko: '{0}' 형식에 액세스 가능한 'Add' 메서드가 없으므로 컬렉션 이니셜라이저를 사용하여 해당 형식을 초기화할 수 없습니다.
pl: Nie można zainicjować typu „{0}” za pomocą inicjatora kolekcji, ponieważ nie ma on dostępnej metody „Add”.
pt_br: Não é possível inicializar o tipo "{0}" com um inicializador de coleção porque ele não tem um método "Adicionar" acessível.
ru: Невозможно инициализировать тип "{0}" с инициализатором набора, так как он не имеет доступного метода "Add".
tr: Erişilebilir bir 'Add' yöntemi olmadığı için '{0}' türü koleksiyon başlatıcısıyla başlatılamaz.
zh_hans: 无法用集合初始值设定项初始化类型“{0}”，因为该类型没有可访问的“Add”方法。
zh_hant: 無法初始化具有集合初始設定式的類型 '{0}'，因為它沒有可存取的 'Add' 方法。

# ERR_CantCombineInitializers
source: An Object Initializer and a Collection Initializer cannot be combined in the same initialization.
cs: Inicializátor objektu a inicializátor kolekce nejde kombinovat ve stejné inicializaci.
de: Ein Objektinitialisierer und ein Sammlungsinitialisierer können nicht in einer Initialisierung kombiniert werden.
es: No se pueden combinar un inicializador de objeto y un inicializador de colección en la misma inicialización.
fr: Un initialiseur d'objet et un initialiseur de collection ne peuvent pas être combinés dans la même initialisation.
it: Non è possibile combinare un inizializzatore di oggetto e un inizializzatore di raccolta nella stessa inizializzazione.
ja: オブジェクト初期化子とコレクション初期化子を同じ初期化内で組み合わせることはできません。
ko: 개체 이니셜라이저와 컬렉션 이니셜라이저를 동일한 초기화 작업에서 함께 사용할 수 없습니다.
pl: Nie można łączyć inicjatora obiektu i inicjatora kolekcji w tej samej inicjacji.
pt_br: Não é possível combinar um Inicializador de Objeto e um Inicializador de Coleção na mesma inicialização.
ru: Инициализатор объектов и инициализатор коллекций не могут объединяться в одной инициализации.
tr: Bir Nesne Başlatıcısı ve Koleksiyon Başlatıcısı aynı başlatma işleminde birleştirilemez.
zh_hans: 不能将对象初始值设定项与集合初始值设定项组合到同一个初始化过程中。
zh_hant: 物件初始設定式和集合初始設定式不能合併在相同的初始設定中。

# ERR_EmptyAggregateInitializer
source: An aggregate collection initializer entry must contain at least one element.
cs: Položka agregovaného inicializátoru kolekce musí obsahovat aspoň jeden element.
de: Ein Eintrag für einen Aggregatsammlungsinitialisierer muss mindestens ein Element enthalten.
es: Una entrada de inicializador de colección de agregados debe contener al menos un elemento.
fr: Une entrée d'initialiseur de collection d'agrégation doit contenir au moins un élément.
it: Una voce aggregata di inizializzatore di raccolta deve contenere almeno un elemento.
ja: 集約コレクションの初期化子エントリには、少なくとも 1 つの要素を含める必要があります。
ko: 집계 컬렉션 이니셜라이저 항목에는 하나 이상의 요소가 있어야 합니다.
pl: Wpis inicjatora kolekcji zagregowanej musi zawierać co najmniej jeden element.
pt_br: Uma entrada de inicializador de coleção de agregação deve conter pelo menos um elemento.
ru: Запись агрегатного инициализатора коллекции должна содержать по меньшей мере один элемент.
tr: Küme koleksiyonu başlatıcısı girdisi en az bir öğe içermelidir.
zh_hans: 聚合集合初始值设定项必须至少包含一个元素。
zh_hant: 彙總集合初始設定式項目 (Entry) 至少必須包含一個項目 (Element)。

# ERR_XmlEndElementNoMatchingStart
source: XML end element must be preceded by a matching start element.
cs: Koncovému elementu XML musí předcházet odpovídající počáteční element.
de: Dem XML-Endelement muss ein entsprechendes Startelement voranstehen.
es: El elemento final de XML debe ir precedido de un elemento de inicio correspondiente.
fr: Un élément de fin XML doit être précédé d'un élément de début correspondant.
it: L'elemento finale XML deve essere preceduto da un elemento iniziale corrispondente.
ja: XML 終了要素の前には、一致する開始要素が必要です。
ko: XML 끝 요소는 짝이 되는 시작 요소 뒤에 와야 합니다.
pl: Końcowy element XML musi być poprzedzony zgodnym elementem początkowym.
pt_br: Elemento final do XML deve ser precedido por um elemento inicial correspondente.
ru: Перед конечным XML-элементом должен идти соответствующий начальный элемент.
tr: XML bitiş öğesinin öncesinde eşleşen bir başlangıç öğesi olmalıdır.
zh_hans: XML 结束元素前面必须是匹配的开始元素。
zh_hant: XML 結束元素之前必須搭配對稱的起始元素。

# ERR_MultilineLambdasCannotContainOnError
source: 'On Error' and 'Resume' cannot appear inside a lambda expression.
cs: 'Uvnitř výrazu lambda se nesmí objevit příkaz On Error nebo Resume.
de: '"On Error" und "Resume" dürfen nicht innerhalb eines Lambdaausdrucks stehen.
es: 'On Error' y 'Resume' no pueden aparecer dentro de una expresión lambda.
fr: 'On Error' et 'Resume' ne peuvent pas être utilisés dans une expression lambda.
it: 'Un'espressione lambda non può includere 'On Error' e 'Resume'.
ja: 'On Error' および 'Resume' は、ラムダ式の内部では使用できません。
ko: 'On Error' 및 'Resume'은 람다 식 내부에 사용할 수 없습니다.
pl: 'Instrukcje „On Error” i „Resume” nie mogą wystąpić wewnątrz wyrażenia lambda.
pt_br: 'On Error' e 'Resume' não podem aparecer dentro de uma expressão lambda.
ru: 'Сообщения "On Error" и "Resume" не могут находиться в лямбда-выражении.
tr: 'On Error' ve 'Resume' bir lambda ifadesinin içinde yer alamaz.
zh_hans: '“On Error”和“Resume”不能出现在 lambda 表达式内。
zh_hant: 'On Error' 和 'Resume' 不能出現在 Lambda 運算式內。

# ERR_VarianceDisallowedHere
source: Keywords 'Out' and 'In' can only be used in interface and delegate declarations.
cs: Klíčová slova Out a In můžou být použita jenom v deklaracích rozhraní a delegátů.
de: Die Schlüsselwörter "Out" und "In" können nur in Schnittstellen- und Delegatdeklarationen verwendet werden.
es: Las palabras clave 'Out' e 'In' se pueden usar solo en declaraciones de interfaz y delegado.
fr: Les mots clés 'Out' et 'In' peuvent uniquement être utilisés dans des déclarations interface et delegate.
it: Le parole chiave 'Out' e 'In' possono essere usate solo in dichiarazioni di delegati e interfacce.
ja: キーワード 'Out' および 'In' は、インターフェイスとデリゲートの宣言でのみ使用できます。
ko: Out' 및 'In' 키워드는 인터페이스 및 대리자 선언에만 사용할 수 있습니다.
pl: Słów kluczowych „Out” oraz „In” można używać tylko w deklaracjach interfejsu i delegata.
pt_br: As palavras-chave 'Out' e 'In' só podem ser usadas em declarações de interface e delegado.
ru: Ключевые слова "Out" и "In" могут использоваться только в объявлениях интерфейсов и делегатов.
tr: Out' ve 'In' anahtar sözcükleri yalnızca arabirim ve temsilci bildirimlerinde kullanılabilir.
zh_hans: 关键字 "Out" 和 "In" 只能在接口声明和委托声明中使用。
zh_hant: 關鍵字 'Out' 和 'In' 只能用於介面和委派宣告中。

# ERR_XmlEndCDataNotAllowedInContent
source: The literal string ']]>' is not allowed in element content.
cs: V obsahu elementu není povolený řetězec literálu ]]>.
de: Die Literalzeichenfolge "]]>" ist in Inhaltselementen nicht zugelassen.
es: La cadena literal ']]>' no se permite en el contenido de elemento.
fr: La chaîne littérale ']]>' n'est pas autorisée dans le contenu de l'élément.
it: La stringa letterale ']]>' non è consentita nel contenuto dell'elemento.
ja: リテラル文字列 ']]>' は要素コンテンツでは許可されていません。
ko: 요소 콘텐츠에는 ']]>' 리터럴 문자열이 허용되지 않습니다.
pl: Ciąg literału „]]>” jest niedozwolony w zawartości elementu.
pt_br: A cadeia de caracteres literal "]]>" não é permitida no conteúdo do elemento.
ru: Использование строки литерала "]]>" в содержимом элемента не допускается.
tr: Değişmez ']]>' dizesine öğe içeriğinde izin verilmez.
zh_hans: 元素内容中不允许使用字符串“]]>”。
zh_hant: 常值字串 ']]>' 不可用在元素內容中。

# ERR_OverloadsModifierInModule
source: Inappropriate use of '{0}' keyword in a module.
cs: Nesprávné použití klíčového slova {0} v modulu
de: Unzulässige Verwendung des {0}-Schlüsselworts in einem Modul.
es: Uso no apropiado de la palabra clave '{0}' en un módulo.
fr: Utilisation inappropriée du mot clé '{0}' dans un module.
it: Uso inappropriato della parola chiave '{0}' in un modulo.
ja: モジュールでの '{0}' キーワードの使い方が不適切です。
ko: 모듈에 적절하지 않은 '{0}' 키워드가 사용되었습니다.
pl: Nieodpowiednie użycie słowa kluczowego „{0}” w module.
pt_br: Uso inadequado da palavra-chave "{0}" em um módulo.
ru: Неправильное использование ключевого слова "{0}" в модуле.
tr: Modülde '{0}' anahtar sözcüğünün hatalı kullanımı.
zh_hans: 模块中不恰当地使用了“{0}”关键字。
zh_hant: 在模組中使用 '{0}' 關鍵字的方法不適當。

# ERR_UndefinedTypeOrNamespace1
source: Type or namespace '{0}' is not defined.
cs: Typ nebo obor názvů {0} není definovaný.
de: Der Typ oder Namespace "{0}" ist nicht definiert.
es: El tipo o el nombre del espacio de nombres '{0}' no está definido.
fr: Le type ou l'espace de noms '{0}' n'est pas défini.
it: Il tipo o lo spazio dei nomi '{0}' non è definito.
ja: 型または名前空間 '{0}' が定義されていません。
ko: 형식 또는 네임스페이스 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano typu lub przestrzeni nazw „{0}”.
pt_br: Tipo ou namespace "{0}" não está definido.
ru: Тип или пространство имен "{0}" не определено.
tr: '{0}' türü veya ad alanı tanımlanmadı.
zh_hans: 未定义类型或命名空间“{0}”。
zh_hant: 未定義類型或命名空間 '{0}'。

# ERR_IdentityDirectCastForFloat
source: Using DirectCast operator to cast a floating-point value to the same type is not supported.
cs: Použití operátoru DirectCast k přetypování hodnoty s plovoucí desetinnou čárkou na stejný typ se nepodporuje.
de: Die Verwendung des DirectCast-Operators zum Umwandeln eines Gleitkommawerts in denselben Typ wird nicht unterstützt.
es: No se admite el uso del operador DirectCast para convertir un valor de número de punto flotante en el mismo tipo.
fr: L'opérateur DirectCast ne peut pas être utilisé pour effectuer un cast d'une valeur à virgule flottante en un type identique.
it: L'uso dell'operatore DirectCast per eseguire il cast di un valore a virgola mobile nello stesso tipo non è supportato.
ja: DirectCast 演算子を使用して浮動小数点値を同じ型にキャストすることはサポートされていません。
ko: DirectCast 연산자를 사용하여 부동 소수점 값을 동일한 형식으로 캐스팅할 수는 없습니다.
pl: Używanie operatora DirectCast do rzutowania wartości zmiennoprzecinkowych do tego samego typu nie jest obsługiwane.
pt_br: Não há suporte para o uso do operador DirectCast na conversão de um valor de ponto flutuante em mesmo tipo.
ru: Использование оператора DirectCast для приведения значения с плавающей точкой к тому же типу не поддерживается.
tr: Kayan nokta değerini aynı türe yayınlamak için DirectCast işlecinin kullanılması desteklenmiyor.
zh_hans: 不支持使用 DirectCast 运算符将浮点值强制转换为同一类型。
zh_hant: 不支援使用 DirectCast 運算子將浮點值轉型為相同類型。

# WRN_ObsoleteIdentityDirectCastForValueType
source: Using DirectCast operator to cast a value-type to the same type is obsolete.
cs: Použití operátoru DirectCast k přetypování hodnoty na stejný typ je zastaralé.
de: Die Umwandlung eines Werttyps in denselben Typ mithilfe eines DirectCast-Operators ist veraltet.
es: El uso del operador DirectCast para convertir un tipo de valor en el mismo tipo está obsoleto.
fr: L’opérateur DirectCast ne peut plus être utilisé pour effectuer un cast d’un type valeur en un type identique.
it: L'uso dell'operatore DirectCast per eseguire il cast di un tipo di valore nello stesso tipo è obsoleto.
ja: DirectCast 演算子を使用して値型を同じ型にキャストすることは古い形式です。
ko: DirectCast 연산자를 사용하여 값 형식을 동일한 형식으로 캐스팅하는 작업은 사용되지 않습니다.
pl: Użycie operatora DirectCast do rzutowania typu wartości na ten sam typ jest przestarzałe.
pt_br: O uso do operador DirectCast para converter um tipo de valor em mesmo tipo é obsoleto.
ru: Использование оператора DirectCast для приведения типа значения к тому же типу больше не нужно.
tr: Değer türünü aynı türe atamak için DirectCast işleci artık kullanılmıyor.
zh_hans: 使用 DirectCast 运算符将值类型强制转换为同一类型的做法已过时。
zh_hant: 使用 DirectCast 運算子將實值類型轉型為相同類型的做法已過時。

# WRN_ObsoleteIdentityDirectCastForValueType_Title
source: Using DirectCast operator to cast a value-type to the same type is obsolete
cs: Použití operátoru DirectCast k přetypování typu hodnoty na stejný typ je zastaralé.
de: Die Umwandlung eines Werttyps in denselben Typ mithilfe eines DirectCast-Operators ist veraltet.
es: El uso del operador DirectCast para convertir un tipo de valor en el mismo tipo es obsoleto
fr: L’opérateur DirectCast ne peut plus être utilisé pour effectuer un cast d’un type valeur en un type identique
it: L'uso dell'operatore DirectCast per eseguire il cast di un tipo di valore nello stesso tipo è obsoleto
ja: DirectCast 演算子を使用して値型を同じ型にキャストすることは古い形式です
ko: DirectCast 연산자를 사용하여 값 형식을 동일한 형식으로 캐스팅하는 작업은 사용되지 않음
pl: Użycie operatora DirectCast do rzutowania typu wartości na ten sam typ jest przestarzałe
pt_br: O uso do operador DirectCast para converter um tipo de valor em mesmo tipo é obsoleto
ru: Использование оператора DirectCast для приведения типа значения к тому же типу больше не нужно
tr: DirectCast işlecini aynı türe bir değer türü yaymak için kullanmak yürürlükte olmayan bir metot
zh_hans: 使用 DirectCast 运算符将值类型强制转换为同一类型的做法已过时
zh_hant: 使用 DirectCast 運算子將實值類型轉型為相同類型的做法已過時

# WRN_UnreachableCode
source: Unreachable code detected.
cs: Zjistil se nedosažitelný kód.
de: Unerreichbarer Code wurde entdeckt.
es: Se ha detectado código inaccesible.
fr: Code inatteignable détecté.
it: È stato rilevato codice non raggiungibile.
ja: 到達できないコードが検出されました。
ko: 접근할 수 없는 코드가 있습니다.
pl: Wykryto nieosiągalny kod.
pt_br: Código inacessível detectado.
ru: Обнаружен недостижимый код.
tr: Ulaşılamayan kod algılandı.
zh_hans: 检测到无法访问的代码。
zh_hant: 偵測到無法執行到的程式碼。

# WRN_UnreachableCode_Title
source: Unreachable code detected
cs: Byl zjištěn nedosažitelný kód.
de: Unerreichbarer Code wurde entdeckt.
es: Se detectó código inaccesible
fr: Code inaccessible détecté
it: È stato rilevato codice non raggiungibile
ja: 到達できないコードが検出されました
ko: 접근할 수 없는 코드가 있습니다.
pl: Wykryto nieosiągalny kod
pt_br: Código inacessível detectado
ru: Обнаружен недостижимый код
tr: Ulaşılamayan kod algılandı
zh_hans: 检测到无法访问的代码
zh_hant: 偵測到執行不到的程式碼

# WRN_DefAsgNoRetValFuncVal1
source: Function '{0}' doesn't return a value on all code paths. Are you missing a 'Return' statement?
cs: Funkce {0} nevrací hodnotu na všech cestách kódu. Nechybí příkaz Return?
de: Die Funktion "{0}" gibt nicht für alle Codepfade einen Wert zurück. Fehlt eine Return-Anweisung?
es: La función '{0}' no devuelve un valor en todas las rutas de acceso de código. ¿Falta alguna instrucción 'Return'?
fr: La fonction '{0}' ne retourne pas une valeur pour tous les chemins de code. Une instruction 'Return' est-elle manquante ?
it: La funzione '{0}' non restituisce alcun valore per tutti i percorsi del codice. Probabilmente manca un'istruzione 'Return'.
ja: 関数 '{0}' には値を返さないコード パスがあります。'Return' ステートメントが不足していないかどうかを確認してください。
ko: '{0}' 함수가 일부 코드 경로에서만 값을 반환합니다. 'Return' 문이 있는지 확인하세요.
pl: Funkcja „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Czy nie brakuje instrukcji „Return”?
pt_br: Função "{0}" não retorna um valor em todos os caminhos de código. Está faltando uma instrução "Return"?
ru: Функция "{0}" не возвращает значение для всех путей к коду. Возможно, отсутствует оператор "Return".
tr: '{0}' işlevi tüm kod yollarında değer döndürmüyor. 'Return' deyiminiz eksik olabilir mi?
zh_hans: 函数“{0}”不会在所有代码路径上都返回值。是否缺少“Return”语句?
zh_hant: 函式 '{0}' 並未傳回有關所有程式碼路徑的值。是否遺漏了 'Return' 陳述式?

# WRN_DefAsgNoRetValFuncVal1_Title
source: Function doesn't return a value on all code paths
cs: Funkce nevrací hodnotu ve všech cestách kódu.
de: Die Funktion gibt nicht für alle Codepfade einen Wert zurück.
es: La función no devuelve un valor en todas las rutas de código
fr: La fonction ne renvoie pas de valeur sur tous les chemins de code
it: La funzione non restituisce un valore per tutti i percorsi del codice
ja: 関数が、すべてのコード パスで値を返しません
ko: 함수가 일부 코드 경로의 값을 반환하지 않음
pl: Funkcja nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: A função não retorna um valor em todos os caminhos de código
ru: Функция не возвращает значение на всех путях к коду
tr: İşlev bütün kod yollarında bir değer döndürmüyor
zh_hans: 函数没有在所有代码路径上返回值
zh_hant: 函式在所有程式碼路徑上皆不會傳回值

# WRN_DefAsgNoRetValOpVal1
source: Operator '{0}' doesn't return a value on all code paths. Are you missing a 'Return' statement?
cs: Operátor {0} nevrací hodnotu na všech cestách kódu. Nechybí příkaz Return?
de: Der Operator "{0}" gibt nicht für alle Codepfade einen Wert zurück. Fehlt eine Return-Anweisung?
es: El operador '{0}' no devuelve un valor en todas las rutas de acceso de código. ¿Falta alguna instrucción 'Return'?
fr: L'opérateur '{0}' ne retourne pas une valeur pour tous les chemins de code. Une instruction 'Return' est-elle manquante ?
it: L'operatore '{0}' non restituisce alcun valore per tutti i percorsi del codice. Probabilmente manca un'istruzione 'Return'.
ja: 演算子 '{0}' には値を返さないコード パスがあります。'Return' ステートメントが不足していないかどうかを確認してください。
ko: '{0}' 연산자가 일부 코드 경로에서만 값을 반환합니다. 'Return' 문이 있는지 확인하세요.
pl: Operator „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Czy nie brakuje instrukcji „Return”?
pt_br: Operador "{0}" não retorna um valor em todos os caminhos de código. Está faltando uma instrução "Return"?
ru: Оператор "{0}" не возвращает значение для всех путей к коду. Возможно, отсутствует оператор "Return".
tr: '{0}' işleci tüm kod yollarında değer döndürmüyor. 'Return' deyiminiz eksik olabilir mi?
zh_hans: 运算符“{0}”不会在所有代码路径上都返回值。是否缺少“Return”语句?
zh_hant: 運算子 '{0}' 並未傳回有關所有程式碼路徑的值。是否遺漏了 'Return' 陳述式?

# WRN_DefAsgNoRetValOpVal1_Title
source: Operator doesn't return a value on all code paths
cs: Operátor nevrací hodnotu ve všech cestách kódu.
de: Der Operator gibt nicht für alle Codepfade einen Wert zurück.
es: El operador no devuelve un valor en todas las rutas de código
fr: L’opérateur ne renvoie pas de valeur sur tous les chemins de code
it: L'operatore non restituisce un valore per tutti i percorsi del codice
ja: 演算子が、すべてのコード パスで値を返しません
ko: 연산자가 일부 코드 경로의 값을 반환하지 않음
pl: Operator nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: O operador não retorna um valor em todos os caminhos de código
ru: Оператор не возвращает значение на всех путях к коду
tr: İşleç bütün kod yollarında bir değer döndürmüyor
zh_hans: 运算符没有在所有代码路径上返回值
zh_hant: 運算子在所有程式碼路徑上皆不會傳回值

# WRN_DefAsgNoRetValPropVal1
source: Property '{0}' doesn't return a value on all code paths. Are you missing a 'Return' statement?
cs: Vlastnost {0} nevrací hodnotu na všech cestách kódu. Nechybí příkaz Return?
de: Die Eigenschaft "{0}" gibt nicht für alle Codepfade einen Wert zurück. Fehlt eine Return-Anweisung?
es: La propiedad '{0}' no devuelve un valor en todas las rutas de acceso de código. ¿Falta alguna instrucción 'Return'?
fr: La propriété '{0}' ne retourne pas une valeur pour tous les chemins de code. Une instruction 'Return' est-elle manquante ?
it: La proprietà '{0}' non restituisce alcun valore per tutti i percorsi del codice. Probabilmente manca un'istruzione 'Return'.
ja: プロパティ '{0}' には値を返さないコード パスがあります。'Return' ステートメントが不足していないかどうかを確認してください。
ko: '{0}' 속성이 일부 코드 경로에서만 값을 반환합니다. 'Return' 문이 있는지 확인하세요.
pl: Właściwość „{0}” nie zwraca wartości na wszystkich ścieżkach w kodzie. Czy nie brakuje instrukcji „Return”?
pt_br: Propriedade "{0}" não retorna um valor em todos os caminhos de código. Está faltando uma instrução "Return"?
ru: Свойство "{0}" не возвращает значение для всех путей к коду. Возможно, отсутствует оператор "Return".
tr: '{0}' özelliği tüm kod yollarında değer döndürmüyor. 'Return' deyiminiz eksik olabilir mi?
zh_hans: 属性“{0}”不会在所有代码路径上都返回值。是否缺少“Return”语句?
zh_hant: 屬性 '{0}' 並未傳回有關所有程式碼路徑的值。是否遺漏了 'Return' 陳述式?

# WRN_DefAsgNoRetValPropVal1_Title
source: Property doesn't return a value on all code paths
cs: Vlastnost nevrací hodnotu ve všech cestách kódu.
de: Die Eigenschaft gibt nicht für alle Codepfade einen Wert zurück.
es: La propiedad no devuelve un valor en todas las rutas de código
fr: La propriété ne renvoie pas une valeur sur tous les chemins d’accès de code
it: La proprietà non restituisce un valore per tutti i percorsi del codice
ja: プロパティが、すべてのコード パスで値を返しません
ko: 속성이 일부 코드 경로의 값을 반환하지 않음
pl: Właściwość nie zwraca wartości na wszystkich ścieżkach w kodzie
pt_br: A propriedade não retorna um valor em todos os caminhos de código
ru: Свойство не возвращает значение на всех путях к коду
tr: Özellik bütün kod yollarında bir değer döndürmüyor
zh_hans: 属性没有在所有代码路径上返回值
zh_hant: 屬性在所有程式碼路徑上皆不會傳回值
