Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DllImportNotLegalOnDeclare
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to a Declare.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro příkazy Declare.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf "Declare" angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a Declare.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à un Declare.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a Declare.
ja: 'System.Runtime.InteropServices.DllImportAttribute' は Declare に適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 Declare에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „System.Runtime.InteropServices.DllImportAttribute” do elementu Declare.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicado a um Declare.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не применим к оператору Declare.
tr: 'System.Runtime.InteropServices.DllImportAttribute' bir Declare üzerine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于 Declare。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至 Declare。

# ERR_DllImportNotLegalOnGetOrSet
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to a Get or Set.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro metodu Get nebo Set.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf "Get" oder "Set" angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a Get o Set.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à un Get ou Set.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a Get o Set.
ja: 'System.Runtime.InteropServices.DllImportAttribute' を Get または Set に適用することはできません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 Get 또는 Set에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „System.Runtime.InteropServices.DllImportAttribute” do elementu Get ani Set.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicado a um Get ou Set.
ru: 'Атрибут System.Runtime.InteropServices.DllImportAttribute не может применяться к оператору Get или Set.
tr: 'System.Runtime.InteropServices.DllImportAttribute' bir Get veya Set üzerine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于 Get 或 Set。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至 Get 或 Set。

# ERR_DllImportOnGenericSubOrFunction
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to a method that is generic or contained in a generic type.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro metodu, která je obecná nebo která je obsažena v obecném typu.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf eine Methode angewendet werden, die generisch oder in einem generischen Typ enthalten ist.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a un método que es genérico o está contenido en un tipo genérico.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à une méthode générique ou contenue dans un type générique.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a un metodo generico o contenuto in un tipo generico.
ja: 'System.Runtime.InteropServices.DllImportAttribute' は、ジェネリック メソッドまたはジェネリック型に含まれるメソッドには適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 제네릭이거나 제네릭 형식에 포함된 메서드에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „System.Runtime.InteropServices.DllImportAttribute” do metody ogólnej lub zawartej w typie ogólnym.
pt_br: 'Não é possível aplicar 'System.Runtime.InteropServices.DllImportAttribute' a um método genérico ou contido em um tipo genérico.
ru: 'Атрибут System.Runtime.InteropServices.DllImportAttribute не может применяться к универсальному методу или методу, содержащемуся в универсальном типе.
tr: 'System.Runtime.InteropServices.DllImportAttribute' genel olan veya genel tür içinde yer alan bir yönteme uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于属于泛型类型或者包含在泛型类型中的方法。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至泛型方法，或套用至包含在泛型類型中的方法。

# ERR_ComClassOnGeneric
source: 'Microsoft.VisualBasic.ComClassAttribute' cannot be applied to a class that is generic or contained inside a generic type.
cs: 'Třídu Microsoft.VisualBasic.ComClassAttribute nejde použít pro třídu, která je obecná nebo obsažena uvnitř obecného typu.
de: 'Microsoft.VisualBasic.ComClassAttribute kann nicht auf eine Klasse angewendet werden, die generisch ist oder sich innerhalb eines generischen Typs befindet.
es: 'Microsoft.VisualBasic.ComClassAttribute' no se puede aplicar a una clase genérica o contenida dentro de un tipo genérico.
fr: 'Microsoft.VisualBasic.ComClassAttribute' ne peut pas être appliqué à une classe qui est générique ou contenue dans un type générique.
it: 'Non è possibile applicare 'Microsoft.VisualBasic.ComClassAttribute' a una classe generica o contenuta all'interno di un tipo generico.
ja: 'Microsoft.VisualBasic.ComClassAttribute' は、ジェネリック クラスまたはジェネリック型に含まれるクラスには適用できません。
ko: 'Microsoft.VisualBasic.ComClassAttribute'는 제네릭 또는 제네릭 형식에 포함된 클래스에 적용할 수 없습니다.
pl: 'Nie można zastosować elementu „Microsoft.VisualBasic.ComClassAttribute” do klasy ogólnej lub zawartej w typie ogólnym.
pt_br: 'Não é possível aplicar 'Microsoft.VisualBasic.ComClassAttribute' a uma classe genérica ou contida em um tipo genérico.
ru: 'Атрибут Microsoft.VisualBasic.ComClassAttribute не может применяться к универсальному классу или классу, содержащемуся в универсальном типе.
tr: 'Microsoft.VisualBasic.ComClassAttribute' genel olan veya genel türün içinde bulunan bir sınıfa uygulanamaz.
zh_hans: '“Microsoft.VisualBasic.ComClassAttribute”不能应用于属于泛型类型或者包含在泛型类型中的类。
zh_hant: 'Microsoft.VisualBasic.ComClassAttribute' 無法套用至泛型類別，或套用至包含在泛型類型內的類別。

# ERR_DllImportOnInstanceMethod
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to instance method.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro instanční metodu.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf eine Instanzmethode angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a un método de instancia.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à une méthode d'instance.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' al metodo di istanza.
ja: 'System.Runtime.InteropServices.DllImportAttribute' はインスタンス メソッドに適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 인스턴스 메서드에 적용할 수 없습니다.
pl: 'Elementu System.Runtime.InteropServices.DllImportAttribute nie można zastosować do metody wystąpienia.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicada a métodos de instância.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не может применяться к методу экземпляра.
tr: 'System.Runtime.InteropServices.DllImportAttribute' bir örnek yöntemine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于实例方法。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至執行個體方法。

# ERR_DllImportOnInterfaceMethod
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to interface methods.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro metody rozhraní.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf Schnittstellenmethoden angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a métodos de interfaz.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué aux méthodes d'interface.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a metodi di interfaccia.
ja: 'System.Runtime.InteropServices.DllImportAttribute' はインターフェイス メソッドに適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 인터페이스 메서드에 적용할 수 없습니다.
pl: 'Elementu „System.Runtime.InteropServices.DllImportAttribute” nie można zastosować do metod interfejsu.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicada a métodos de interface.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не может применяться к методам интерфейса.
tr: 'System.Runtime.InteropServices.DllImportAttribute' arabellek yöntemlerine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于接口方法。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至介面方法。

# ERR_DllImportNotLegalOnEventMethod
source: 'System.Runtime.InteropServices.DllImportAttribute' cannot be applied to 'AddHandler', 'RemoveHandler' or 'RaiseEvent' method.
cs: 'Atribut System.Runtime.InteropServices.DllImportAttribute nejde použít pro metodu AddHandler, RemoveHandler nebo RaiseEvent.
de: 'System.Runtime.InteropServices.DllImportAttribute kann nicht auf die Methoden AddHandler, RemoveHandler oder RaiseEvent angewendet werden.
es: 'System.Runtime.InteropServices.DllImportAttribute' no se puede aplicar a los métodos 'AddHandler', 'RemoveHandler' o 'RaiseEvent'.
fr: 'System.Runtime.InteropServices.DllImportAttribute' ne peut pas être appliqué à une méthode 'AddHandler', 'RemoveHandler' ou 'RaiseEvent'.
it: 'Non è possibile applicare 'System.Runtime.InteropServices.DllImportAttribute' a un metodo 'AddHandler', 'RemoveHandler' o 'RaiseEvent'.
ja: 'System.Runtime.InteropServices.DllImportAttribute' は、'AddHandler'、'RemoveHandler'、または 'RaiseEvent' メソッドには適用できません。
ko: 'System.Runtime.InteropServices.DllImportAttribute'는 'AddHandler', 'RemoveHandler' 또는 'RaiseEvent' 메서드에 적용할 수 없습니다.
pl: 'Elementu System.Runtime.InteropServices.DllImportAttribute nie można zastosować do metody AddHandler, RemoveHandler ani RaiseEvent.
pt_br: 'System.Runtime.InteropServices.DllImportAttribute' não pode ser aplicada a métodos 'AddHandler', 'RemoveHandler' ou 'RaiseEvent'.
ru: 'Атрибут "System.Runtime.InteropServices.DllImportAttribute" не может применяться к методам "AddHandler", "RemoveHandler" и "RaiseEvent".
tr: 'System.Runtime.InteropServices.DllImportAttribute' 'AddHandler', 'RemoveHandler' veya 'RaiseEvent' yöntemine uygulanamaz.
zh_hans: '"System.Runtime.InteropServices.DllImportAttribute" 不能应用于 "AddHandler"、"RemoveHandler" 或 "RaiseEvent" 方法。
zh_hant: 'System.Runtime.InteropServices.DllImportAttribute' 無法套用至 'AddHandler'、'RemoveHandler' 或 'RaiseEvent' 方法。

# ERR_FriendAssemblyBadArguments
source: Friend assembly reference '{0}' is invalid. InternalsVisibleTo declarations cannot have a version, culture, public key token, or processor architecture specified.
cs: Odkaz na sestavení {0} typu Friend je neplatný. V deklaracích InternalsVisibleTo nesmí být zadaná verze, jazykové prostředí, token veřejného klíče ani architektura procesoru.
de: Der friend-Assemblyverweis "{0}" ist ungültig. Für InternalsVisibleTo-Deklarationen kann keine Version, keine Kultur, kein öffentliches Schlüsseltoken und keine Prozessorarchitektur angegeben werden.
es: La referencia de ensamblado de confianza '{0}' no es válida. Las declaraciones InternalsVisibleTo no pueden tener especificada una versión, una referencia cultural, un token de clave pública ni una arquitectura de procesador.
fr: La référence d'assembly Friend '{0}' n'est pas valide. Les déclarations InternalsVisibleTo ne peuvent pas avoir une version, une culture, un jeton de clé publique ou une architecture de processeur spécifié.
it: Il riferimento all'assembly Friend {0} non è valido. Nelle dichiarazioni InternalsVisibleTo non è possibile specificare la versione, le impostazioni cultura, il token di chiave pubblica o l'architettura del processore.
ja: フレンド アセンブリ参照 '{0}' は無効です。InternalsVisibleTo 宣言にバージョン、カルチャ、公開キー トークン、またはプロセッサ属性を指定することはできません。
ko: Friend 어셈블리 참조 '{0}'이(가) 잘못되었습니다. InternalsVisibleTo 선언에는 버전, 문화권, 공개 키 토큰 또는 프로세서 아키텍처를 지정할 수 없습니다.
pl: Odwołanie do przyjaznego zestawu „{0}” jest nieprawidłowe. Deklaracje InternalsVisibleTo nie mogą mieć określonej wersji, kultury, tokena klucza publicznego ani architektury procesora.
pt_br: Referência do assembly Friend "{0}" é inválido. Declarações InternalsVisibleTo não podem ter uma versão, cultura, token de chave pública ou arquitetura de processador especificada.
ru: Недопустимая дружественная ссылка на сборку "{0}". Объявления InternalsVisibleTo не содержат определения версии, языка и региональных параметров, токена открытого ключа или архитектуры процессора.
tr: '{0}' friend derleme başvurusu geçersiz. InternalsVisibleTo bildirimlerinde sürüm, kültür, ortak anahtar simgesi veya işlemci mimarisi belirtilemez.
zh_hans: 友元程序集引用“{0}”无效。不能在 InternalsVisibleTo 声明中指定版本、区域性、公钥标记或处理器架构。
zh_hant: Friend 組件參考 '{0}' 無效。InternalsVisibleTo 宣告不可指定版本、文化特性、公開金鑰語彙基元或處理器架構。

# ERR_FriendAssemblyStrongNameRequired
source: Friend assembly reference '{0}' is invalid. Strong-name signed assemblies must specify a public key in their InternalsVisibleTo declarations.
cs: Odkaz na sestavení {0} typu Friend je neplatný. V deklaracích InternalsVisibleTo musí být u podepsaných sestavení se silným názvem uvedený veřejný klíč.
de: Der friend-Assemblyverweis "{0}" ist ungültig. Signierte Assemblys mit starkem Namen müssen in ihren InternalsVisibleTo-Deklarationen einen öffentlichen Schlüssel angeben.
es: La referencia de ensamblado de confianza '{0}' no es válida. Los ensamblados firmados con nombre seguro deben especificar una clave pública en sus declaraciones InternalsVisibleTo.
fr: La référence d'assembly Friend '{0}' n'est pas valide. Les assemblys signés avec un nom fort doivent spécifier une clé publique dans leurs déclarations InternalsVisibleTo.
it: Il riferimento {0} all'assembly Friend non è valido. Gli assembly firmati con nome sicuro devono specificare una chiave pubblica nelle rispettive dichiarazioni InternalsVisibleTo.
ja: フレンド アセンブリ参照 '{0}' は無効です。厳密な名前の署名つきアセンブリはその InternalsVisibleTo 宣言内で公開キーを指定しなければなりません。
ko: Friend 어셈블리 참조 '{0}'이(가) 잘못되었습니다. 강력한 이름의 서명된 어셈블리에는 InternalsVisibleTo 선언에 공개 키를 지정해야 합니다.
pl: Odwołanie do przyjaznego zestawu „{0}” jest nieprawidłowe. Zestawy podpisane silnymi nazwami muszą określać klucz publiczny w swoich deklaracjach InternalsVisibleTo.
pt_br: Referência do assembly Friend "{0}" é inválida. Assemblies assinados com nome forte devem especificar uma chave pública em suas declarações InternalsVisibleTo.
ru: Недопустимая дружественная ссылка на сборку "{0}". Сборки, подписанные строгим именем, должны содержать в объявлении InternalsVisibleTo открытый ключ.
tr: '{0}' friend derleme başvurusu geçersiz. Kesin ad imzalı derlemelerin kendi InternalsVisibleTo bildirmelerinde bir ortak anahtar belirtmesi gerekir.
zh_hans: 友元程序集引用“{0}”无效。强名称签名的程序集必须在其 InternalsVisibleTo 声明中指定一个公钥。
zh_hant: Friend 組件參考 '{0}' 無效。以強式名稱簽署的組件，在其 InternalsVisibleTo 宣告中必須指定公開金鑰。

# ERR_FriendAssemblyNameInvalid
source: Friend declaration '{0}' is invalid and cannot be resolved.
cs: Deklarace {0} typu friend je neplatná a nejde ji vyhodnotit.
de: Die Frienddeklaration "{0}" ist ungültig und kann nicht aufgelöst werden.
es: La declaración "friend" "{0}" no es válida y no se puede resolver.
fr: La déclaration Friend '{0}' n'est pas valide et ne peut pas être résolue.
it: La dichiarazione Friend '{0}' non è valida e non può essere risolta.
ja: friend 宣言 '{0}' は無効であり、解決できません。
ko: friend 선언 '{0}'이(가) 잘못되어 확인할 수 없습니다.
pl: Deklaracja elementu zaprzyjaźnionego „{0}” jest nieprawidłowa i nie można jej rozpoznać.
pt_br: A declaração de friend "{0}" é inválida e não pode ser resolvida.
ru: Дружественное объявление "{0}" недопустимо и не может быть разрешено.
tr: '{0}' arkadaş bildirimi geçersiz ve çözümlenemiyor.
zh_hans: 友元声明“{0}”无效，且无法解析。
zh_hant: Friend 宣告 '{0}' 無效，無法解析。

# ERR_FriendAssemblyBadAccessOverride2
source: Member '{0}' cannot override member '{1}' defined in another assembly/project because the access modifier 'Protected Friend' expands accessibility. Use 'Protected' instead.
cs: Člen {0} nemůže přepisovat člen {1} definovaný v jiném sestavení/projektu, protože modifikátor přístupu Protected Friend rozšiřuje dostupnost. Jako náhradu použijte modifikátor Protected.
de: Der Member "{0}" kann den Member "{1}", der in einer anderen Assembly/einem anderen Projekt definiert ist, nicht überschreiben, da der Zugriffsmodifizierer "Protected Friend" den Zugriff erweitert. Verwenden Sie stattdessen "Protected".
es: El miembro '{0}' no puede invalidar al miembro '{1}' definido en otro ensamblado o proyecto porque el modificador de acceso 'Protected Friend' amplía la accesibilidad. Use 'Protected'.
fr: Le membre '{0}' ne peut pas se substituer au membre '{1}' défini dans un autre assembly/projet, car le modificateur d'accès 'Protected Friend' étend l'accessibilité. Utilisez 'Protected' à la place.
it: Il membro '{0}' non può eseguire l'override del membro '{1}' definito in un altro assembly/progetto perché il modificatore di accesso 'Protected Friend' espande l'accessibilità. Usare 'Protected'.
ja: アクセス修飾子 'Protected Friend' がアクセシビリティを拡張するため、メンバー '{0}' は別のアセンブリまたはプロジェクトで定義されているメンバー '{1}' をオーバーライドできません。代わりに 'Protected' を使用してください。
ko: 액세스 한정자 'Protected Friend'가 액세스 가능성을 확장하므로 '{0}' 멤버는 다른 어셈블리/프로젝트에 정의된 '{1}' 멤버를 재정의할 수 없습니다. 대신 'Protected'를 사용하세요.
pl: Składowa „{0}” nie może przesłaniać składowej „{1}” zdefiniowanej w innym zestawie/projekcie, ponieważ modyfikator dostępu „Protected Friend” rozszerza dostępność. Zamiast niego użyj modyfikatora „Protected”.
pt_br: Membro "{0}" não pode substituir o membro "{1}" definido em outro assembly/projeto porque o modificador de acesso "Protected Friend" expande a acessibilidade. Ao invés dele, use "Protected".
ru: Член "{0}" не может переопределить член "{1}", определенный в другой сборке или проекте, так как модификатор доступа "Protected Friend" расширяет доступность. Вместо него используйте "Protected".
tr: Protected Friend' erişim değiştiricisi erişilebilirliği genişlettiğinden, '{0}' üyesi başka bir derlemede/projede tanımlanan '{1}' üyesini geçersiz kılamaz. Bunun yerine 'Protected' kullanın.
zh_hans: 成员“{0}”无法重写另一个程序集/项目中定义的成员“{1}”，因为访问修饰符“Protected Friend”扩展了可访问性。请改用“Protected”。
zh_hant: 成員 '{0}' 無法覆寫在另一個組件/專案中定義的成員 '{1}'，因為存取修飾詞 'Protected Friend' 會展開存取範圍。請改用 'Protected'。

# ERR_UseOfLocalBeforeDeclaration1
source: Local variable '{0}' cannot be referred to before it is declared.
cs: Na lokální proměnnou {0} nejde odkazovat dříve, než se deklaruje.
de: Auf die lokale Variable "{0}" kann nicht verwiesen werden, bevor sie deklariert ist.
es: No se puede hacer referencia a la variable local '{0}' hasta que esté declarada.
fr: Il ne peut exister aucune référence à la variable locale '{0}' tant que cette variable n'est pas déclarée.
it: Non è possibile fare riferimento alla variabile locale '{0}' prima che sia dichiarata.
ja: ローカル変数 '{0}' は宣言されているため、参照できません。
ko: '{0}' 지역 변수를 참조하려면 이 변수를 먼저 선언해야 합니다.
pl: Nie można odwołać się do zmiennej lokalnej „{0}” przed jej zadeklarowaniem.
pt_br: Variável local "{0}" não pode ser referida antes de ser declarada.
ru: Невозможно указать локальную переменную "{0}" до ее объявления.
tr: '{0}' yerel değişkeni bildirilmeden önce çıkarsanamaz.
zh_hans: 局部变量“{0}”在声明之前不能被引用。
zh_hant: 在宣告區域變數 '{0}' 之前，無法參考該區域變數。

# ERR_UseOfKeywordFromModule1
source: '{0}' is not valid within a Module.
cs: 'Prvek {0} není platný v rámci modulu.
de: '"{0}" ist innerhalb eines Moduls ungültig.
es: '{0}' no es válido dentro de un módulo.
fr: '{0}' n'est pas valide dans un module.
it: '{0}' non è valido all'interno di un modulo.
ja: '{0}' は、モジュール内では有効ではありません。
ko: '모듈 내에서는 '{0}'이(가) 유효하지 않습니다.
pl: 'Element „{0}” nie jest prawidłowy w ramach modułu.
pt_br: "{0}" não é válido dentro de um Módulo.
ru: "{0}" не является допустимым в модуле.
tr: '{0}', Modül içinde geçerli değil.
zh_hans: '“{0}”在模块中无效。
zh_hant: '{0}' 在 Module 中無效。

# ERR_BogusWithinLineIf
source: Statement cannot end a block outside of a line 'If' statement.
cs: Příkaz nemůže ukončit blok mimo řádek s příkazem If.
de: Eine Anweisung kann keinen Block außerhalb einer If-Zeilenanweisung beenden.
es: La instrucción no puede terminar un bloque fuera de una línea de la instrucción 'If'.
fr: L'instruction ne peut pas terminer un bloc en dehors d'une instruction 'If'.
it: L'istruzione non può terminare un blocco all'esterno di un'istruzione di riga 'If'.
ja: If' ステートメント行の外側でステートメント ブロックを終了することはできません。
ko: 문이 'If' 문 줄 외부의 블록에서 끝날 수 없습니다.
pl: Instrukcja nie może kończyć bloku poza instrukcją If wiersza.
pt_br: A instrução não pode finalizar um bloco fora de uma instrução 'If' de linha.
ru: Нельзя завершить блок, внешний по отношению к однострочному оператору If.
tr: Deyim, bir satır 'If' deyimi dışında bloğu sona erdiremez.
zh_hans: 语句不能在“If”语句行之外结束块。
zh_hant: 陳述式不能在 'If' 陳述式行之外結束區塊。

# ERR_CharToIntegralTypeMismatch1
source: 'Char' values cannot be converted to '{0}'. Use 'Microsoft.VisualBasic.AscW' to interpret a character as a Unicode value or 'Microsoft.VisualBasic.Val' to interpret it as a digit.
cs: 'Hodnoty Char nejde převést na typ {0}. Pokud ale chcete znak interpretovat jako hodnotu Unicode, použijte funkci Microsoft.VisualBasic.AscW. Pokud ho chcete interpretovat jako číslici, použijte funkci Microsoft.VisualBasic.Val.
de: 'Char-Werte können nicht in "{0}" konvertiert werden. Verwenden Sie Microsoft.VisualBasic.AscW oder Microsoft.VisualBasic.Val, um ein Zeichen als Unicode-Wert bzw. als Ziffer zu interpretieren.
es: 'Los valores 'Char' no se pueden convertir en '{0}'. Use 'Microsoft.VisualBasic.AscW' para interpretar un carácter como valor Unicode o 'Microsoft.VisualBasic.Val' para interpretarlo como un dígito.
fr: 'Impossible de convertir les valeurs 'Char' en '{0}'. Utilisez soit 'Microsoft.VisualBasic.AscW' pour interpréter un caractère comme une valeur Unicode, soit 'Microsoft.VisualBasic.Val' pour interpréter le caractère comme un chiffre.
it: 'Non è possibile convertire i valori 'Char' in '{0}'. Usare 'Microsoft.VisualBasic.AscW' per interpretare un carattere come valore Unicode o 'Microsoft.VisualBasic.Val' per interpretarlo come cifra.
ja: 'Char' 値を '{0}' に変換することはできません。文字を Unicode 値として扱うには 'Microsoft.VisualBasic.AscW' を、数字として扱うには 'Microsoft.VisualBasic.Val' を使用してください。
ko: 'Char' 값을 '{0}'(으)로 변환할 수 없습니다. 'Microsoft.VisualBasic.AscW'를 사용하여 문자를 유니코드 값으로 해석하거나 'Microsoft.VisualBasic.Val'을 사용하여 문자를 숫자로 해석하세요.
pl: 'Nie można konwertować wartości „Char” na elementy „{0}”. Użyj elementu „Microsoft.VisualBasic.AscW”, aby zinterpretować znak jako wartość Unicode, lub elementu „Microsoft.VisualBasic.Val”, aby zinterpretować go jako cyfrę.
pt_br: 'Valores "Char" não podem ser convertidos em "{0}". Use "Microsoft.VisualBasic.AscW" para interpretar um caractere como um valor Unicode ou "Microsoft.VisualBasic.Val" para interpretá-lo como um dígito.
ru: 'Значения "Char" невозможно преобразовать в "{0}". Используйте "Microsoft.VisualBasic.AscW" для интерпретации символа как символа Юникода или "Microsoft.VisualBasic.Val" для интерпретации его как цифры.
tr: 'Char' değerleri '{0}' olarak dönüştürülemez. Karakteri Unicode değeri olarak yorumlamak için 'Microsoft.VisualBasic.AscW' veya rakam olarak yorumlamak için 'Microsoft.VisualBasic.Val' kullanın.
zh_hans: '“Char”值不能转换为“{0}”。请使用“Microsoft.VisualBasic.AscW”将字符解释为 Unicode 值，或者使用“Microsoft.VisualBasic.Val”将字符解释为数字。
zh_hant: 'Char' 的值無法轉換成 '{0}'。請使用 'Microsoft.VisualBasic.AscW' 將字元解譯為 Unicode 值，或使用 'Microsoft.VisualBasic.Val' 將其解譯為數字。
