Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_AttributeNotSupportedInVB_Title
source: Attribute is not supported in VB
cs: Atribut není v jazyce Visual Basic podporovaný
de: Attribut wird in VB nicht unterstützt
es: El atributo no se admite en VB
it: L'attributo non è supportato in VB
ja: 属性が VB でサポートされていない
ko: 특성은 VB에서 지원되지 않습니다.
pl: Atrybut nie jest obsługiwany w języku VB
pt_br: Não há suporte para o atributo no VB
ru: Атрибут не поддерживается в VB
tr: Öznitelik, VB'de desteklenmiyor
zh_hans: VB 中不支持属性
zh_hant: VB 中不支援屬性
