Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_UnreferencedModuleEvent3
source: Reference required to module '{0}' containing the definition for event '{1}'. Add one to your project.
cs: Vyžaduje se odkaz na modul {0} obsahující definici události {1}. Přidejte ho do projektu.
de: Es ist ein Verweis auf das Modul "{0}" erforderlich, das die Definition für das Ereignis "{1}" enthält. Fügen Sie dem Projekt einen Verweis hinzu.
es: Es necesaria una referencia al módulo '{0}' que contiene la definición del evento '{1}'. Agregue una al proyecto.
fr: Une référence au module '{0}' contenant la définition pour l'événement '{1}' est requise. Ajoutez-en une à votre projet.
it: È necessario il riferimento al modulo '{0}' contenente la definizione dell'evento '{1}'. Aggiungerne uno al progetto.
ja: イベント '{1}' の定義を含むモジュール '{0}' への参照が必要です。参照をプロジェクトに追加してください。
ko: '{1}' 이벤트에 대한 정의를 포함하는 '{0}' 모듈에 대한 참조를 찾을 수 없습니다. 프로젝트에 추가하세요.
pl: Wymagane odwołanie do modułu „{0}” z definicją zdarzenia „{1}”. Dodaj je do projektu.
pt_br: Referência necessária para o módulo "{0}" contendo a definição para o evento "{1}". Adicione uma ao seu projeto.
ru: Для модуля "{0}" требуется ссылка, содержащая определение события "{1}". Добавьте одну из них в проект.
tr: '{1}' olayının tanımını içeren '{0}' modülüne başvuru gerekiyor. Projenize bir başvuru ekleyin.
zh_hans: 需要对模块“{0}”(包含事件“{1}”的定义)的引用。请在项目中添加一个。
zh_hant: 模組 '{0}' (包含事件 '{1}' 的定義) 需要參考。請在您的專案中加入一個參考。

# ERR_LbExpectedEndIf
source: '#If' block must end with a matching '#End If'.
cs: 'Blok #If musí končit párovým klíčovým slovem #End If.
de: '#If-Block muss mit einem entsprechenden "#End If" abgeschlossen werden.
es: 'El bloque '#If' debe terminar con una instrucción '#End If' correspondiente.
fr: 'Le bloc '#If' doit se terminer par un '#End If' correspondant.
it: 'È necessario concludere il blocco '#If' con un elemento '#End If' corrispondente.
ja: '#If' ブロックの最後には、対応する '#End If' が必要です。
ko: '#If' 블록은 짝이 되는 '#End If'로 끝나야 합니다.
pl: 'Blok #If musi kończyć się instrukcją #End If.
pt_br: 'Bloco '#If' deve terminar com um '#End If' correspondente.
ru: 'Блок "#If" должен завершаться соответствующим блоком "#End If".
tr: '#If' bloğu eşleşen bir '#End If' ile bitmelidir.
zh_hans: '"#If" 块必须以匹配的 "#End If" 结束。
zh_hant: '#If' 區塊之後必須搭配相對應的 '#End If'。

# ERR_LbNoMatchingIf
source: '#ElseIf', '#Else', or '#End If' must be preceded by a matching '#If'.
cs: 'Klíčovému slovu #ElseIf, #Else nebo #End If musí předcházet párové klíčové slovo #If.
de: '"#ElseIf", "#Else" oder "#End If" muss ein entsprechendes "#If" voranstehen.
es: '#ElseIf', '#Else' o '#End If' deben ir precedidas de la instrucción '#If' correspondiente.
fr: '#ElseIf', '#Else' ou '#End If' doit être précédé d'un '#If' correspondant.
it: '#ElseIf', '#Else' o '#End If' deve essere preceduto da un elemento '#If' corrispondente.
ja: '#ElseIf'、'#Else'、または '#End If' の前には、対応する '#If' が必要です。
ko: '#ElseIf', '#Else' 또는 '#End If'는 짝이 되는 '#If' 뒤에 와야 합니다.
pl: 'Instrukcje #ElseIf, #Else i #End If muszą być poprzedzone odpowiadającą im instrukcją #If.
pt_br: '#ElseIf', '#Else', ou '#End If' devem ser precedidos por um '#If' correspondente.
ru: 'Блоку "#ElseIf", "#Else" или "#End If" должен предшествовать соответствующий оператор "#If".
tr: '#ElseIf', '#Else' veya '#End If' öncesinde eşleşen bir '#If' olmalıdır.
zh_hans: '"#ElseIf"、"#Else" 或 "#End If" 前面必须是匹配的 "#If"。
zh_hant: '#ElseIf'、'#Else' 或 '#End If' 之前必須搭配相對應的 '#If'。

# ERR_LbBadElseif
source: '#ElseIf' must be preceded by a matching '#If' or '#ElseIf'.
cs: 'Klíčovému slovu #ElseIf musí předcházet párové klíčové slovo #If nebo #ElseIf.
de: '"#ElseIf" muss ein entsprechendes "#If" oder "#ElseIf" voranstehen.
es: '#ElseIf' debe ir precedida de la instrucción '#If' o '#ElseIf' correspondiente.
fr: '#ElseIf' doit être précédé d'un '#If' ou '#ElseIf' correspondant.
it: '#ElseIf' deve essere preceduto da un elemento '#If' o '#ElseIf' corrispondente.
ja: '#ElseIf' の前には、対応する '#If' または '#ElseIf' が必要です。
ko: '#ElseIf'는 짝이 되는 '#If' 또는 '#ElseIf' 뒤에 와야 합니다.
pl: 'Element „#ElseIf” musi być poprzedzony odpowiadającym mu elementem „#If” lub „#ElseIf”.
pt_br: '#ElseIf' deve ser precedido por um '#If' ou '#ElseIf' correspondente.
ru: 'Блоку "#ElseIf" должен предшествовать соответствующий блок "#If" или "#ElseIf".
tr: '#ElseIf' öncesinde eşleşen bir '#If' veya '#ElseIf' olmalıdır.
zh_hans: '"#ElseIf" 前面必须是匹配的 "#If" 或 "#ElseIf"。
zh_hant: '#ElseIf' 之前必須搭配相對應的 '#If' 或 '#ElseIf'。

# ERR_InheritsFromRestrictedType1
source: Inheriting from '{0}' is not valid.
cs: Dědění z {0} není platné.
de: Das Erben von "{0}" ist ungültig.
es: No es válido heredar de '{0}'.
fr: L'héritage de '{0}' n'est pas valide.
it: Non è consentito ereditare da '{0}'.
ja: '{0}' からの継承は、有効ではありません。
ko: '{0}'에서 상속할 수 없습니다.
pl: Dziedziczenie po typie „{0}” jest niepoprawne.
pt_br: Herdar de "{0}" não é válido.
ru: Наследование от "{0}" недопустимо.
tr: '{0}' öğesinden devralma geçerli değil.
zh_hans: 从“{0}”继承无效。
zh_hant: 從 '{0}' 繼承無效。

# ERR_InvOutsideProc
source: Labels are not valid outside methods.
cs: Návěští nejsou platné mimo metody.
de: Bezeichnungen sind außerhalb von Methoden ungültig.
es: Las etiquetas no son válidas fuera de los métodos.
fr: Les étiquettes ne sont pas valides en dehors des méthodes.
it: Le etichette non sono valide all'esterno di metodi.
ja: ラベルは、メソッドの外では有効ではありません。
ko: 메서드 외부에서는 레이블이 유효하지 않습니다.
pl: Etykiety nie są prawidłowe poza metodami.
pt_br: Rótulos não são válidos fora de métodos.
ru: Метки за пределами методов недействительны.
tr: Yöntemlerin dışında etiketler geçerli değil.
zh_hans: 标签在方法外部无效。
zh_hant: 方法外的標籤無效。

# ERR_DelegateCantImplement
source: Delegates cannot implement interface methods.
cs: Delegáti nemůžou implementovat metody rozhraní.
de: Delegaten können keine Schnittstellenmethoden implementieren.
es: Los delegados no pueden implementar métodos de interfaz.
fr: Les délégués ne peuvent pas implémenter des méthodes d'interface.
it: I delegati non possono implementare metodi di interfaccia.
ja: デリゲートでインターフェイス メソッドを実装することはできません。
ko: 대리자는 인터페이스 메서드를 구현할 수 없습니다.
pl: Obiekty delegatów nie mogą implementować metod interfejsu.
pt_br: Delegados não podem implementar métodos de interface.
ru: Делегаты не могут реализовывать методы интерфейсов.
tr: Temsilciler arabirim yöntemlerini uygulayamaz.
zh_hans: 委托无法实现接口方法。
zh_hant: 委派 (Delegate) 無法實作介面方法。

# ERR_DelegateCantHandleEvents
source: Delegates cannot handle events.
cs: Delegáti nemůžou zpracovávat události.
de: Delegaten können keine Ereignisse verarbeiten.
es: Los delegados no pueden administrar eventos.
fr: Les délégués ne peuvent pas gérer les événements.
it: I delegati non possono gestire gli eventi.
ja: デリゲートでイベントを処理することはできません。
ko: 대리자는 이벤트를 처리할 수 없습니다.
pl: Obiekty delegatów nie mogą obsługiwać zdarzeń.
pt_br: Delegados não podem manipular eventos.
ru: Делегаты не могут обрабатывать события.
tr: Temsilciler olayları işleyemez.
zh_hans: 委托无法处理事件。
zh_hant: 委派 (Delegate) 無法處理事件。

# ERR_IsOperatorRequiresReferenceTypes1
source: 'Is' operator does not accept operands of type '{0}'. Operands must be reference or nullable types.
cs: 'Operátor Is nepřijímá operátory typu {0}. Operandy musí být typu odkaz nebo s povolenou hodnotou Null.
de: 'Der Is-Operator akzeptiert keine Operanden vom Typ "{0}". Die Operanden müssen Referenztypen sein oder Typen, die NULL-Werte zulassen.
es: 'El operador 'Is' no acepta operandos de tipo '{0}'. Los operandos deben ser tipos de referencia o que acepten valores NULL.
fr: 'L'opérateur 'Is' n'accepte pas d'opérandes de type '{0}'. Les opérandes doivent être de types référence ou Nullable.
it: 'L'operatore 'Is' non accetta operandi di tipo '{0}'. Gli operandi devono essere tipi riferimento o nullable.
ja: 'Is' 演算子は型 '{0}' のオペランドを受け付けません。オペランドは参照型または Null 許容型でなければなりません。
ko: 'Is' 연산자에는 '{0}' 형식의 피연산자를 사용할 수 없습니다. 피연산자는 참조 또는 null 허용 형식이어야 합니다.
pl: 'Operator „Is” nie akceptuje argumentów operacji typu „{0}”. Typem argumentu operacji musi być odwołanie lub typ dopuszczający wartość null.
pt_br: 'Operador "Is" não aceita operandos do tipo "{0}". Os operandos devem ser de referência ou tipos anuláveis.
ru: 'Оператор "Is" не принимает операнды типа "{0}". Операнды должны быть ссылочными типами или типами, допускающими значения Null.
tr: 'Is' işleci '{0}' türünde işlenenleri kabul etmez. İşlenenler başvuru veya null yapılabilir türlerde olmalıdır.
zh_hans: '“Is”运算符不接受类型为“{0}”的操作数。操作数必须是引用类型或可以为 null 的类型。
zh_hant: 'Is' 運算子不接受類型 '{0}' 的運算元。運算元必須是參考或可為 Null 的類型。

# ERR_TypeOfRequiresReferenceType1
source: 'TypeOf ... Is' requires its left operand to have a reference type, but this operand has the value type '{0}'.
cs: 'Operátor TypeOf ... Is vyžaduje levý operand typu odkaz, ale tento operand je typu {0}.
de: '"TypeOf ... Is" erfordert, dass der linke Operand einen Referenztyp hat. Dieser Operand hat jedoch den Werttyp "{0}".
es: 'TypeOf ... Is' requiere que el operando situado a su izquierda tenga un tipo de referencia, pero este operando tiene el tipo de valor '{0}'.
fr: 'TypeOf ... Is' requiert un opérande gauche ayant un type référence, mais cet opérande a le type valeur '{0}'.
it: 'L'operando sinistro di 'TypeOf... Is' deve avere un tipo riferimento, ma questo operando ha il tipo valore '{0}'.
ja: 'TypeOf ... Is' の左には参照型を持つオペランドが必要ですが、このオペランドの値型は '{0}' です。
ko: 'TypeOf ... Is'의 왼쪽 피연산자는 참조 형식이어야 하는데 이 피연산자의 값 형식은 '{0}'입니다.
pl: 'Instrukcja „TypeOf ... Is” wymaga, aby argument operacji po lewej stronie miał typ referencyjny, a ten argument operacji ma typ wartości „{0}”.
pt_br: "TypeOf ... Is" requer que seu operando esquerdo tenha um tipo de referência, mas este operando tem o tipo de valor "{0}".
ru: '"TypeOf ... Is" требует, чтобы левый операнд имел ссылочный тип, но этот операнд имеет тип значения "{0}".
tr: 'TypeOf ... Is', bir başvuru türüne sahip olması için sol işlenen gerektiriyor, ancak bu işlenen '{0}' değer türünde.
zh_hans: '“TypeOf ... Is”要求它的左操作数具有引用类型，但此操作数具有值类型“{0}”。
zh_hant: 'TypeOf ... Is' 的左運算元必須是參考類型，但此運算元是實值類型 '{0}'。

# ERR_ReadOnlyHasSet
source: Properties declared 'ReadOnly' cannot have a 'Set'.
cs: Vlastnosti deklarované jako ReadOnly nemůžou používat metodu Set.
de: Eine Eigenschaft, die als "ReadOnly" deklariert ist, darf kein "Set" haben.
es: Las propiedades declaradas como 'ReadOnly' no pueden tener una instrucción 'Set'.
fr: Les propriétés déclarées 'ReadOnly' ne peuvent pas avoir de 'Set'.
it: Le proprietà dichiarate 'ReadOnly' non possono avere un elemento 'Set'.
ja: ReadOnly' として宣言されているプロパティに 'Set' を使用することはできません。
ko: ReadOnly'로 선언된 속성에는 'Set'을 사용할 수 없습니다.
pl: Właściwości zadeklarowane jako ReadOnly nie mogą mieć procedury Set.
pt_br: Propriedades declaradas como 'ReadOnly' não podem ter 'Set'.
ru: Свойства, объявленные как доступные только для чтения (ReadOnly), не могут иметь метод "Set".
tr: ReadOnly' olarak bildirilen özelliklerde 'Set' bulunamaz.
zh_hans: 声明为 "ReadOnly" 的属性不能有 "Set"。
zh_hant: 宣告為 'ReadOnly' 的屬性無法擁有 'Set'。

# ERR_WriteOnlyHasGet
source: Properties declared 'WriteOnly' cannot have a 'Get'.
cs: Vlastnosti deklarované jako WriteOnly nemůžou používat metodu Get.
de: Eine Eigenschaft, die als "WriteOnly" deklariert ist, darf kein "Get" haben.
es: Las propiedades declaradas como 'WriteOnly' no pueden tener una instrucción 'Get'.
fr: Les propriétés déclarées 'WriteOnly' ne peuvent pas avoir de 'Get'.
it: Le proprietà dichiarate 'WriteOnly' non possono avere un elemento 'Get'.
ja: WriteOnly' として宣言されているプロパティに 'Get' を使用することはできません。
ko: WriteOnly'로 선언된 속성에는 'Get'을 사용할 수 없습니다.
pl: Właściwości zadeklarowane jako WriteOnly nie mogą mieć procedury Get.
pt_br: Propriedades declaradas como 'WriteOnly' não podem ter 'Get'.
ru: Свойства, объявленные как доступные только для записи (WriteOnly), не могут иметь метод Get.
tr: WriteOnly' olarak bildirilen özelliklerde 'Get' bulunamaz.
zh_hans: 声明为 "WriteOnly" 的属性不能有 "Get"。
zh_hant: 宣告為 'WriteOnly' 的屬性無法擁有 'Get'。

# ERR_InvInsideProc
source: Statement is not valid inside a method.
cs: Příkaz není platný uvnitř metody.
de: Die Anweisung ist innerhalb einer Methode ungültig.
es: La instrucción no es válida dentro de un método.
fr: Instruction non valide dans une méthode.
it: L'istruzione non è valida all'interno di un metodo.
ja: ステートメントはメソッド内では有効ではありません。
ko: 메서드 내부에는 문을 사용할 수 없습니다.
pl: Instrukcja nie jest prawidłowa wewnątrz metody.
pt_br: Instrução não é válida dentro de um método.
ru: Недопустимый оператор в методе.
tr: Yöntem içinde deyim geçerli değil.
zh_hans: 语句在方法内部无效。
zh_hant: 方法內的陳述式無效。

# ERR_InvInsideBlock
source: Statement is not valid inside '{0}' block.
cs: Příkaz není platný uvnitř bloku {0}.
de: Die Anweisung ist innerhalb eines {0}-Blocks ungültig.
es: La instrucción no es válida dentro de un bloque '{0}'.
fr: Instruction non valide dans un bloc '{0}'.
it: L'istruzione non è valida all'interno del blocco '{0}'.
ja: '{0}' ブロックの内部では有効でないステートメントです。
ko: '{0}' 블록 내부에서는 문이 유효하지 않습니다.
pl: Instrukcja nie jest prawidłowa w ramach bloku „{0}”.
pt_br: Instrução não é válida dentro do "{0}" bloco.
ru: Недопустимый оператор в блоке "{0}".
tr: Deyim, '{0}' bloğunun içinde geçerli değil.
zh_hans: 语句在“{0}”块内部无效。
zh_hant: '{0}' 區塊內的陳述式無效。

# ERR_UnexpectedExpressionStatement
source: Expression statement is only allowed at the end of an interactive submission.
cs: Příkaz výrazu není povolený na konci interaktivního odeslání.
de: Eine Ausdrucksanweisung ist nur am Ende einer interaktiven Übermittlung zulässig.
es: La instrucción de expresión solo se permite al final de un envío interactivo.
fr: L'instruction d'expression est autorisée uniquement à la fin d'un envoi interactif.
it: L'istruzione di espressione è consentita solo alla fine di un invio interattivo.
ja: 式ステートメントは対話型送信の終了時のみ使用できます。
ko: 식 문은 대화형 제출의 끝에서만 허용됩니다.
pl: Instrukcja wyrażenia jest dozwolona tylko na końcu przesyłania interaktywnego.
pt_br: Instrução de expressão é permitida somente no final de um envio interativo.
ru: Выражение оператора допускается только в конце интерактивной отправки.
tr: İfade deyimine yalnızca etkileşimli bir gönderimin sonunda izin verilir.
zh_hans: 只允许在交互提交结尾处使用表达式语句。
zh_hant: 只有在互動提交結束時，才可出現運算式陳述式。

# ERR_EndProp
source: Property missing 'End Property'.
cs: Ve vlastnosti chybí příkaz End Property.
de: Eigenschaft ohne "End Property".
es: Falta 'End Property' en Property.
fr: End Property' manquant dans la propriété.
it: Nella proprietà manca 'End Property'.
ja: Property に 'End Property' がありません。
ko: 속성에 'End Property'가 없습니다.
pl: We właściwości brakuje instrukcji End Property.
pt_br: End Property' está faltando na propriedade.
ru: В свойстве отсутствует "End Property".
tr: Özellikte 'End Property' eksik.
zh_hans: Property 缺少 "End Property"。
zh_hant: 屬性遺漏了 'End Property'。

# ERR_EndSubExpected
source: 'End Sub' expected.
cs: 'Očekával se příkaz End Sub.
de: '"End Sub" erwartet.
es: 'Se esperaba 'End Sub'.
fr: 'End Sub' attendu.
it: 'È previsto 'End Sub'.
ja: 'End Sub' が必要です。
ko: 'End Sub'가 필요합니다.
pl: 'Oczekiwano instrukcji End Sub.
pt_br: 'End Sub' esperado.
ru: 'Требуется "End Sub".
tr: 'End Sub' bekleniyor.
zh_hans: '应为 "End Sub"。
zh_hant: '必須有 'End Sub'。

# ERR_EndFunctionExpected
source: 'End Function' expected.
cs: 'Očekával se příkaz End Function.
de: '"End Function" erwartet.
es: 'Se esperaba 'End Function'.
fr: 'End Function' attendu.
it: 'È previsto 'End Function'.
ja: 'End Function' が必要です。
ko: 'End Function'이 필요합니다.
pl: 'Oczekiwano instrukcji End Function.
pt_br: 'End Function' esperado.
ru: 'Требуется "End Function".
tr: 'End Function' bekleniyor.
zh_hans: '应为 "End Function"。
zh_hant: '必須有 'End Function'。

# ERR_LbElseNoMatchingIf
source: '#Else' must be preceded by a matching '#If' or '#ElseIf'.
cs: 'Klíčovému slovu #Else musí předcházet odpovídající klíčové slovo #If nebo #ElseIf.
de: '"#Else" muss ein entsprechendes "#If" oder "#ElseIf" voranstehen.
es: '#Else' debe ir precedida de la instrucción '#If' o '#ElseIf' correspondiente.
fr: '#Else' doit être précédé d'un '#If' ou '#ElseIf' correspondant.
it: '#Else' deve essere preceduto da un elemento '#If' o '#ElseIf' corrispondente.
ja: '#Else' の前には、対応する '#If' または '#ElseIf' が必要です。
ko: '#Else'는 짝이 되는 '#If' 또는 '#ElseIf' 뒤에 와야 합니다.
pl: 'Instrukcja #Else musi być poprzedzona odpowiadającą jej instrukcją #If lub #ElseIf.
pt_br: '#Else' deve ser precedido por um '#If' ou '#ElseIf' correspondente.
ru: 'Блоку "#Else" должен предшествовать соответствующий блок "#If" или "#ElseIf".
tr: '#Else' öncesinde eşleşen bir '#If' veya '#ElseIf' olmalıdır.
zh_hans: '"#Else" 前面必须是匹配的 "#If" 或 "#ElseIf"。
zh_hant: '#Else' 之前必須搭配相對應的 '#If' 或 '#ElseIf'。

# ERR_CantRaiseBaseEvent
source: Derived classes cannot raise base class events.
cs: Odvozené třídy nemůžou vyvolat události základní třídy.
de: Abgeleitete Klassen können keine Basisklassenereignisse auslösen.
es: Las clases derivadas no pueden generar eventos de clase base.
fr: Les classes dérivées ne peuvent pas déclencher les événements de la classe de base.
it: Le classi derivate non possono generare eventi di classe di base.
ja: 派生クラスで基底クラスのイベントを発生させることはできません。
ko: 파생 클래스는 기본 클래스 이벤트를 발생시킬 수 없습니다.
pl: Klasy pochodne nie mogą generować zdarzeń klasy bazowej.
pt_br: Classes derivadas não podem elevar eventos de classe base.
ru: Производные классы не могут генерировать события базовых классов.
tr: Türetilmiş sınıflar temel sınıf olaylarını oluşturamaz.
zh_hans: 派生类不能引发基类事件。
zh_hant: 衍生的類別無法引發基底類別事件。

# ERR_TryWithoutCatchOrFinally
source: Try must have at least one 'Catch' or a 'Finally'.
cs: V rámci příkazu Try je nutné použít nejmíň jedno klíčové slovo Catch nebo Finally.
de: "Try" muss mindestens ein "Catch" oder ein "Finally" haben.
es: Try debe tener al menos una instrucción 'Catch' o 'Finally'.
fr: Try doit utiliser au moins un 'Catch' ou 'Finally'.
it: Try deve avere almeno un elemento 'Catch' o 'Finally'.
ja: Try には少なくとも 1 つの 'Catch' または 'Finally' を指定しなければなりません。
ko: Try에는 적어도 'Catch' 또는 'Finally' 중 하나가 있어야 합니다.
pl: Blok Try musi zawierać co najmniej jedną instrukcję Catch lub Finally.
pt_br: Try' deve possuir pelo menos um 'Catch' ou um 'Finally'.
ru: Оператор "Try" должен содержать хотя бы один блок "Catch" или "Finally".
tr: Try en az bir 'Catch' veya 'Finally' içermelidir.
zh_hans: Try 必须至少有一个 "Catch" 或 "Finally"。
zh_hant: Try 至少必須有一個 'Catch' 或 'Finally'。

# ERR_EventsCantBeFunctions
source: Events cannot have a return type.
cs: Události nemůžou mít typ vrácené hodnoty.
de: Ereignisse dürfen keinen Rückgabetyp haben.
es: Los eventos no pueden tener un tipo de valor devuelto.
fr: Les événements ne peuvent pas avoir de type de retour.
it: Gli eventi non possono avere un tipo restituito.
ja: イベントに戻り値の型を指定することはできません。
ko: 이벤트에는 반환 형식을 사용할 수 없습니다.
pl: Zdarzenia nie mogą mieć zwracanego typu.
pt_br: Eventos não podem ter um tipo de retorno.
ru: Событиям невозможно задать возвращаемый тип.
tr: Olayların dönüş türü olamaz.
zh_hans: 事件不能有返回类型。
zh_hant: 事件不可以有傳回類型。

# ERR_MissingEndBrack
source: Bracketed identifier is missing closing ']'.
cs: Pro identifikátor v hranatých závorkách se nenašla pravá hranatá závorka (]).
de: Dem Bezeichner fehlt die schließende Klammer "]".
es: Falta el corchete de cierre ']' del identificador entre corchetes.
fr: Crochet fermant manquant (']') pour l'identificateur.
it: Manca la parentesi di chiusura ']' nell'identificatore tra parentesi.
ja: かっこ付きの識別子の終わりに ']' がありません。
ko: 대괄호로 묶은 식별자에 닫는 ']'가 없습니다.
pl: Identyfikator ujęty w nawiasy kwadratowe nie ma nawiasu zamykającego ].
pt_br: O colchete de fechamento ']' está faltando no identificador entre colchetes.
ru: У идентификатора в квадратных скобках отсутствует закрывающая скобка "]".
tr: Köşeli ayraç içindeki tanımlayıcıda sağ ']' yok.
zh_hans: 用括号标识的标识符缺少右边的 "]"。
zh_hant: 有括號的識別項遺漏右括號 ']'。

# ERR_Syntax
source: Syntax error.
cs: Chyba syntaxe
de: Syntaxfehler.
es: Error de sintaxis.
fr: Erreur de syntaxe.
it: Errore di sintassi.
ja: 構文エラーです。
ko: 구문 오류입니다.
pl: Błąd składni.
pt_br: Erro de sintaxe.
ru: Синтаксическая ошибка.
tr: Söz dizimi hatası.
zh_hans: 语法错误。
zh_hant: 語法錯誤。

# ERR_Overflow
source: Overflow.
cs: Přetečení
de: Überlauf
es: Desbordamiento.
fr: Dépassement de capacité.
ja: オーバーフローしました。
ko: 오버플로가 발생했습니다.
pl: Przepełnienie.
pt_br: Estouro.
ru: Переполнение.
tr: Taşma.
zh_hans: 溢出。
zh_hant: 溢位。

# ERR_IllegalChar
source: Character is not valid.
cs: Znak není platný.
de: Ungültiges Zeichen.
es: El carácter no es válido.
fr: Caractère non valide.
it: Il carattere non è valido.
ja: 文字が有効ではありません。
ko: 문자가 잘못되었습니다.
pl: Znak jest nieprawidłowy.
pt_br: Caractere inválido.
ru: Недопустимый символ.
tr: Karakter geçerli değil.
zh_hans: 字符无效。
zh_hant: 字元無效。

# ERR_StdInOptionProvidedButConsoleInputIsNotRedirected
source: stdin argument '-' is specified, but input has not been redirected from the standard input stream.
es: Se ha especificado el argumento stdin "-", pero la entrada no se ha redirigido desde el flujo de entrada estándar.
it: è stato specificato l'argomento stdin '-', ma l'input non è stato reindirizzato dal flusso di input standard.
ja: stdin 引数 '-' が指定されていますが、入力が標準入力ストリームからリダイレクトされていません。
ko: stdin 인수 '-'를 지정했지만 표준 입력 스트림에서 입력이 리디렉션되지 않았습니다.
pl: określono argument stdin „-”, ale dane wejściowe nie zostały przekierowane ze standardowego strumienia wejściowego.
pt_br: O argumento stdin '-' foi especificado, mas a entrada não foi redirecionada do fluxo de entrada padrão.
ru: Указан аргумент stdin "-", но входные данные не были перенаправлены из стандартного входного потока.
tr: '-' stdin bağımsız değişkeni belirtildi ancak giriş, standart giriş akışından yeniden yönlendirilmedi.
zh_hant: 已指定 stdin 引數 '-'，但尚未從標準輸入資料流重新導向輸入。

# ERR_StrictDisallowsObjectOperand1
source: Option Strict On prohibits operands of type Object for operator '{0}'.
cs: Direktiva Option Strict On zakazuje operandy typu Object pro operátor {0}.
de: "Option Strict On" lässt keine Operanden des Typs "Object" für den {0}-Operator zu.
es: Option Strict On prohíbe operandos de tipo Object para el operador '{0}'.
fr: Option Strict On interdit les opérandes de type Object pour l'opérateur '{0}'.
it: Option Strict On non ammette operandi di tipo Object per l'operatore '{0}'.
ja: Option Strict On が指定されている場合、演算子 '{0}' に対して Object 型のオペランドを使用することはできません。
ko: Option Strict On에서는 '{0}' 연산자에 대해 Object 형식의 피연산자를 사용할 수 없습니다.
pl: Ustawienie Option Strict On nie zezwala na stosowanie argumentów typu Object dla operatora „{0}”.
pt_br: Opção Strict On proíbe operandos do tipo Object para o operador "{0}".
ru: Option Strict On запрещает операнды типа Object для оператора "{0}".
tr: Option Strict On, '{0}' işleci için Object türündeki işlenenleri yasaklar.
zh_hans: Option Strict On 禁止将 Object 类型的操作数用于运算符“{0}”。
zh_hant: Option Strict 為 On 時，禁止為運算子 '{0}' 使用 Object 類型的運算元。
