Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SyntaxTreeNotFoundToRemove
source: SyntaxTree '{0}' not found to remove
cs: Strom syntaxe {0} k odebrání se nenašel.
de: SyntaxTree "{0}" wurde zum Entfernen nicht gefunden.
es: No se encontró SyntaxTree '{0}' para quitarlo
fr: SyntaxTree '{0}' à supprimer introuvable
it: Non è stato trovato nessun elemento SyntaxTree '{0}' da rimuovere
ja: 削除する構文ツリー '{0}' が見つかりません
ko: 제거할 '{0}' SyntaxTree를 찾을 수 없습니다.
pl: Nie znaleziono elementu SyntaxTree „{0}” do usunięcia
pt_br: SyntaxTree "{0}" não encontrada para remover
ru: SyntaxTree "{0}" не найдено и не будет удалено.
tr: SyntaxTree '{0}' kaldırmak üzere bulunamadı
zh_hans: 未找到要删除的 SyntaxTree“{0}”。
zh_hant: 找不到要移除的語法樹狀結構 '{0}'

# TreeMustHaveARootNodeWithCompilationUnit
source: Tree must have a root node with SyntaxKind.CompilationUnit
cs: Strom musí mít kořenový uzel s prvkem SyntaxKind.CompilationUnit
de: Der Baum muss einen Stammknoten mit SyntaxKind.CompilationUnit haben
es: El árbol debe tener un nodo raíz con SyntaxKind.CompilationUnit
fr: L'arborescence doit avoir un nœud racine avec SyntaxKind.CompilationUnit
it: L'albero deve avere un nodo radice con SyntaxKind.CompilationUnit
ja: ツリーには SyntaxKind.CompilationUnit とのルート ノードが必要です
ko: 트리는 SyntaxKind.CompilationUnit을 사용하는 루트 노드여야 합니다.
pl: Drzewo musi mieć węzeł główny z elementem SyntaxKind.CompilationUnit
pt_br: Árvore deve ter um nó raiz com SyntaxKind.CompilationUnit
ru: Деревья должны иметь корневой узел SyntaxKind.CompilationUnit.
tr: Ağacın SyntaxKind.CompilationUnit içeren bir kök düğümü olmalıdır
zh_hans: 树必须具有带 SyntaxKind.CompilationUnit 的根节点
zh_hant: 樹狀結構必須要有具備 SyntaxKind.CompilationUnit 的根節點

source: Compilation (Visual Basic):
cs: Kompilace (Visual Basic):
de: Kompilierung (Visual Basic):
es: Compilación (Visual Basic):
it: Compilazione (Visual Basic):
ja: コンパイル (Visual Basic):
ko: 컴파일(Visual Basic):
pl: Kompilacja (Visual Basic):
pt_br: Compilação (Visual Basic):
ru: Компиляция (Visual Basic):
tr: Derleme (Visual Basic):
zh_hans: 编译(Visual Basic):
zh_hant: 編譯 (Visual Basic):

source: Node is not within syntax tree
cs: Uzel není ve stromu syntaxe.
de: Knoten ist nicht innerhalb Syntaxbaum
es: El nodo no está dentro del árbol de sintaxis
fr: Le nœud ne se trouve pas dans l'arborescence de syntaxe
it: Il nodo non è compreso nell'albero della sintassi
ja: ノードが構文ツリー内にありません
ko: 노드가 구문 트리 내에 없습니다.
pl: Węzeł nie znajduje się w obrębie drzewa składni
pt_br: Nó não está na árvore de sintaxe
ru: Узел не входит в синтаксическое дерево.
tr: Düğüm, söz dizimi ağacı içinde değil
zh_hans: 节点不在语法树中
zh_hant: Node 不在語法樹狀結構中

# CantReferenceCompilationFromTypes
source: Can't reference compilation of type '{0}' from {1} compilation.
cs: Na kompilaci typu {0} nejde odkazovat z kompilace {1}.
de: Die Kompilierung mit dem Typ "{0}" kann aus der {1}-Kompilierung nicht referenziert werden.
es: No se puede hacer referencia a la compilación de tipo '{0}' desde {1} compilación.
fr: Impossible de référencer la compilation de type '{0}' à partir de la compilation {1}.
it: Non è possibile fare riferimento alla compilazione di tipo '{0}' dalla compilazione di {1}.
ja: コンパイル {1} から '{0}' 型のコンパイルを参照できません。
ko: {1} 컴파일에서 '{0}' 형식의 컴파일을 참조할 수 없습니다.
pl: Nie można odwołać się do kompilacji typu „{0}” z kompilacji {1}.
pt_br: Não é possível fazer referência a compilação do tipo "{0}" de {1} compilação.
ru: Не удается создать ссылку на компиляцию типа "{0}" из компиляции {1}.
tr: {1} derlemesinden '{0}' türünün derlemesine başvurulamıyor.
zh_hans: 无法从 {1} 编译引用类型为“{0}”的编译。
zh_hant: 無法從 {1} 編譯來參考類型為 '{0}' 的編譯

source: position of type parameter too large
cs: Pozice parametru typu je moc velká.
de: Position von Typparameter zu groß
es: la posición del parámetro de tipo es demasiado grande
fr: position du paramètre de type trop large
it: la posizione del parametro di tipo è troppo grande
ja: 型パラメーターの位置が大きすぎます
ko: 형식 매개 변수 위치가 너무 깁니다.
pl: pozycja parametru typu jest zbyt duża
pt_br: posição do parâmetro de tipo muito grande
ru: Позиция типа параметра является слишком большой.
tr: tür parametresinin konumu fazla büyük
zh_hans: 类型参数的位置太大
zh_hant: 類型參數的位置太大

source: Associated type does not have type parameters
cs: Přidružený typ nemá parametry typu.
de: Zugeordneter Typ hat keine Typparameter
es: El tipo asociado no tiene parámetros de tipo
fr: Le type associé n'a pas de paramètres de type
it: Il tipo associato non include parametri di tipo
ja: 関連付けられた型には型パラメーターがありません
ko: 연결된 형식에 형식 매개 변수가 없습니다.
pl: Skojarzony typ nie zawiera parametrów typu
pt_br: Tipo associado não tem parâmetros de tipo
ru: У связанного типа отсутствуют параметры типа.
tr: İlişkili türün, tür parametreleri yok
zh_hans: 关联类型没有类型参数
zh_hant: 相關聯的類型沒有類型參數

# IDS_FunctionReturnType
source: function return type
cs: návratový typ funkce
de: Funktionsrückgabetyp
es: tipo de valor devuelto de función
fr: type de retour de la fonction
it: tipo restituito della funzione
ja: 関数の戻り値の型
ko: 함수 반환 형식
pl: zwracany typ funkcji
pt_br: tipo de retorno de função
ru: тип возвращаемого функцией значения
tr: işlev dönüş türü
zh_hans: 函数返回类型
zh_hant: 函式傳回類型

source: Type argument cannot be Nothing
cs: Argument typu nemůže být Nothing.
de: Typargument kann nicht "Nothing" sein
es: El argumento de tipo no puede ser Nothing
fr: L'argument de type ne peut pas être Nothing
it: L'argomento di tipo non può essere Nothing
ja: 型引数に Nothing は使用できません
ko: 형식 인수는 Nothing일 수 없습니다.
pl: Argument typu nie może mieć wartości Nothing
pt_br: Argumento de tipo não pode ser Nothing
ru: Аргумент типа не может иметь значение Nothing
tr: Tür bağımsız değişkeni Nothing olamaz
zh_hans: 类型参数不能是任何内容
zh_hant: 類型引數不可為 Nothing

# WRN_AnalyzerReferencesFramework
source: The assembly '{0}' containing type '{1}' references .NET Framework, which is not supported.
es: El ensamblado "{0}" que contiene el tipo "{1}" hace referencia a .NET Framework, lo cual no se admite.
it: L'assembly '{0}' che contiene il tipo '{1}' fa riferimento a .NET Framework, che non è supportato.
ja: 型 '{1}' を含むアセンブリ '{0}' が .NET Framework を参照しています。これはサポートされていません。
ko: '{1}' 형식을 포함하는 '{0}' 어셈블리가 지원되지 않는 .NET Framework를 참조합니다.
pl: Zestaw „{0}” zawierający typ „{1}” odwołuje się do platformy .NET Framework, co nie jest obsługiwane.
pt_br: O assembly '{0}' contendo o tipo '{1}' referencia o .NET Framework, mas não há suporte para isso.
ru: Сборка "{0}", содержащая тип "{1}", ссылается на платформу .NET Framework, которая не поддерживается.
tr: '{1}' türünü içeren '{0}' bütünleştirilmiş kodu, desteklenmeyen .NET Framework'e başvuruyor.
zh_hant: 包含類型 '{1}' 的組件 '{0}' 參考了 .NET Framework，此情形不受支援。

# WRN_AnalyzerReferencesFramework_Title
source: The loaded assembly references .NET Framework, which is not supported.
es: El ensamblado que se ha cargado hace referencia a .NET Framework, lo cual no se admite.
it: L'assembly caricato fa riferimento a .NET Framework, che non è supportato.
ja: 読み込まれたアセンブリが .NET Framework を参照しています。これはサポートされていません。
ko: 로드된 어셈블리가 지원되지 않는 .NET Framework를 참조합니다.
pl: Załadowany zestaw odwołuje się do platformy .NET Framework, co nie jest obsługiwane.
pt_br: O assembly carregado referencia o .NET Framework, mas não há suporte para isso.
ru: Загруженная сборка ссылается на платформу .NET Framework, которая не поддерживается.
tr: Yüklenen bütünleştirilmiş kod, desteklenmeyen .NET Framework'e başvuruyor.
zh_hant: 載入的組件參考了 .NET Framework，此情形不受支援。

# WRN_AnalyzerReferencesNewerCompiler
source: Analyzer assembly '{0}' cannot be used because it references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
es: El ensamblado del analizador “{0}” no se puede usar porque hace referencia a la versión “{1}” del compilador, que es más reciente que la versión “{2}” que se está ejecutando actualmente.
zh_hant: 分析程式組件 '{0}' 參考編譯器的版本 '{1}' ，比目前執行的版本 '{2}' 還要新。

# WRN_AnalyzerReferencesNewerCompiler_Title
source: Analyzer assembly cannot be used because it references a newer version of the compiler than the currently running version.
es: El ensamblado del analizador no se puede usar porque hace referencia a una versión más reciente del compilador que la que se está ejecutando.
zh_hant: 分析程式組件參考的編譯器版本比目前執行的版本新。

# WRN_CallerArgumentExpressionAttributeHasInvalidParameterName
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect. It is applied with an invalid parameter name.
es: El atributo CallerArgumentExpressionAttribute aplicado al parámetro "{0}" no tendrá ningún efecto. Se ha aplicado con un nombre de parámetro no válido.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto. È applicato con un nome di parametro non valido.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、無効なパラメーター名で適用されているため無効となります。
ko: 매개 변수 '{0}'에 적용된 CallerArgumentExpressionAttribute는 효과가 없습니다. 잘못된 매개 변수 이름으로 적용되었습니다.
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru „{0}” nie będzie działać. Jest on stosowany z nieprawidłową nazwą parametru.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá efeito. Ele é aplicado com um nome de parâmetro inválido.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, так как он применяется с недопустимым именем параметра.
tr: '{0}' parametresine uygulanan CallerArgumentExpressionAttribute hiçbir etkiye sahip olmaz. Geçersiz bir parametre adıyla uygulanır.
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果。它套用了不正確的參數名稱。

# WRN_CallerArgumentExpressionAttributeHasInvalidParameterName_Title
source: The CallerArgumentExpressionAttribute applied to parameter will have no effect. It is applied with an invalid parameter name.
es: El CallerArgumentExpressionAttribute aplicado al parámetro no tendrá ningún efecto. Se ha aplicado con un nombre de parámetro no válido.
it: CallerArgumentExpressionAttribute applicato al parametro non avrà alcun effetto. È applicato con un nome di parametro non valido.
ja: パラメーターに適用された CallerArgumentExpressionAttribute は、無効なパラメーター名で適用されているため無効となります。
ko: 매개 변수에 적용된 CallerArgumentExpressionAttribute는 효과가 없습니다. 잘못된 매개 변수 이름으로 적용되었습니다.
pl: CallerArgumentExpressionAttribute zastosowane do parametru nie będzie działać. Jest on stosowany z nieprawidłową nazwą parametru.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro não terá efeito. Ele é aplicado com um nome de parâmetro inválido.
ru: Применение класса CallerArgumentExpressionAttribute к параметру не подействует, так как он применяется с недопустимым именем параметра.
tr: Parametreye uygulanan CallerArgumentExpressionAttribute hiçbir etkiye sahip olmaz. Geçersiz bir parametre adıyla uygulanır.
zh_hant: 套用至參數的 CallerArgumentExpressionAttribute 將沒有效果。它套用了不正確的參數名稱。

# WRN_CallerArgumentExpressionAttributeSelfReferential
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect because it's self-referential.
es: El atributo CallerArgumentExpressionAttribute aplicado al parámetro "{0}" no tendrá ningún efecto porque es autorreferencial.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto perché è autoreferenziale.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は自己参照であるため、無効となります。
ko: 매개 변수 '{0}'에 적용된 CallerArgumentExpressionAttribute는 자체 참조이기 때문에 효과가 없습니다.
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru „{0}” nie będzie działać, ponieważ jego odwołanie jest samodzielne.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá efeito porque é de autorreferência.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, так как он ссылается сам на себя.
tr: Parametre kendini işaret ettiğinden, '{0}' parametresine uygulanan CallerArgumentExpressionAttribute hiçbir etkiye sahip olmaz.
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，因為它是自我參考。

# WRN_CallerArgumentExpressionAttributeSelfReferential_Title
source: The CallerArgumentExpressionAttribute applied to parameter will have no effect because it's self-referential.
es: El atributo CallerArgumentExpressionAttribute aplicado al parámetro no tendrá ningún efecto porque es autorreferencial.
it: CallerArgumentExpressionAttribute applicato al parametro non avrà alcun effetto perché è autoreferenziale.
ja: パラメーターに適用された CallerArgumentExpressionAttribute は自己参照であるため、無効となります。
ko: 매개 변수에 적용된 CallerArgumentExpressionAttribute는 자체 참조이기 때문에 효과가 없습니다.
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru nie będzie działać, ponieważ jest to odwołanie samodzielne.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro não terá efeito porque é de autorreferência.
ru: Применение класса CallerArgumentExpressionAttribute к параметру не подействует, так как он ссылается сам на себя.
tr: Parametre kendini işaret ettiğinden, parametreye uygulanan CallerArgumentExpressionAttribute hiçbir etkiye sahip olmaz.
zh_hant: 套用到參數的 CallerArgumentExpressionAttribute 將沒有效果，因為它是自我參考。

# WRN_ConvertingLock
source: A value of type 'System.Threading.Lock' converted to a different type will use likely unintended monitor-based locking in SyncLock statement.
es: Un valor de tipo 'System.Threading.Lock' convertido a otro tipo probablemente usará un bloqueo basado en monitor no deseado en la instrucción SyncLock.
it: Un valore di tipo 'System.Threading.Lock' convertito in un tipo diverso userà probabilmente un blocco basato su monitoraggio non intenzionale nell'istruzione SyncLock.
ko: 다른 형식으로 변환된 'System.Threading.Lock' 형식의 값은 SyncLock 문에서 의도하지 않은 모니터 기반 잠금을 사용합니다.
tr: Farklı bir türe dönüştürülen 'System.Threading.Lock' türündeki bir değer, SyncLock deyiminde büyük olasılıkla istenmeyen izleyici tabanlı kilitlemeyi kullanır.
zh_hant: 型別 'System.Threading.Lock' 轉換為不同型別的值，在 SyncLock 陳述式中可能會使用非預期的監視器型鎖定。

# WRN_ConvertingLock_Title
source: A value of type 'System.Threading.Lock' converted to a different type will use likely unintended monitor-based locking in SyncLock statement.
es: Un valor de tipo 'System.Threading.Lock' convertido a otro tipo probablemente usará un bloqueo basado en monitor no deseado en la instrucción SyncLock.
it: Un valore di tipo 'System.Threading.Lock' convertito in un tipo diverso userà probabilmente un blocco basato su monitoraggio non intenzionale nell'istruzione SyncLock.
ko: 다른 형식으로 변환된 'System.Threading.Lock' 형식의 값은 SyncLock 문에서 의도하지 않은 모니터 기반 잠금을 사용합니다.
tr: Farklı bir türe dönüştürülen 'System.Threading.Lock' türündeki bir değer, SyncLock deyiminde büyük olasılıkla istenmeyen izleyici tabanlı kilitlemeyi kullanır.
zh_hant: 型別 'System.Threading.Lock' 轉換為不同型別的值，在 SyncLock 陳述式中可能會使用非預期的監視器型鎖定。

# WRN_DuplicateAnalyzerReference
source: Analyzer reference '{0}' specified multiple times
es: Referencia del analizador "{0}" especificada varias veces
it: Il riferimento '{0}' dell'analizzatore è stato specificato più volte
ja: 複数回指定されたアナライザー参照 '{0}'
ko: 분석기 참조 '{0}'이(가) 여러 번 지정되었습니다.
pl: Odwołanie analizatora „{0}” określono wiele razy
pt_br: Referência do analisador '{0}' especificada várias vezes
ru: Ссылка анализатора "{0}" указана несколько раз
tr: Çözümleyici referansı '{0}' birden çok kez belirtildi
zh_hant: 已指定多次分析器參考 '{0}'

# WRN_DuplicateAnalyzerReference_Title
source: Analyzer reference specified multiple times
es: Referencia del analizador especificada varias veces
it: Riferimento analizzatore specificato più volte
ja: 複数回指定されたアナライザー参照
ko: 여러 번 지정된 분석기 참조
pl: Odwołanie do analizatora określono wiele razy
pt_br: Referência do analisador especificada várias vezes
ru: Ссылка на анализатор указана несколько раз
tr: Çözümleyici referansı birden çok kez belirtildi
zh_hant: 已指定多次分析器參考

# WRN_ExperimentalWithMessage
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates: '{1}'.
es: ''{0}'' es solo para fines de evaluación y está sujeto a cambios o eliminaciones en futuras actualizaciones: ''{1}''.
zh_hant: '{0}' 僅供評估用。後續更新: '{1}' 時可能會有所變更或移除。

# WRN_ExperimentalWithMessage_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates.
es: Este tipo se incluye solo con fines de evaluación y está sujeto a cambios o a que se elimine en próximas actualizaciones.
zh_hant: 類型僅供評估之用。後續更新時可能會有所變更或移除。

# WRN_GeneratorFailedDuringGeneration
source: Generator '{0}' failed to generate source. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'. {3}
es: El generador '{0}' no pudo generar el origen. No contribuye a la salida y pueden producirse errores de compilación como resultado. La excepción era de tipo '{1}' con el mensaje '{2}'. {3}
it: Il generatore '{0}' non è riuscito a generare l'origine. Non contribuirà quindi all'output ed è possibile che si verifichino errori di compilazione. Eccezione di tipo '{1}' con messaggio '{2}'. {3}
ko: 생성기 '{0}'이(가) 소스를 생성하지 못했습니다. 출력에 기여하지 않으므로 컴파일 오류가 발생할 수 있습니다. 예외의 형식은 '{1}'이고 메시지는 '{2}'입니다. {3}
pl: Generator „{0}” nie mógł wygenerować źródła. W rezultacie nie będzie on współtworzyć danych wyjściowych i mogą wystąpić błędy kompilacji. Wyjątek był typu „{1}” z komunikatem „{2}”. {3}
ru: Генератору "{0}" не удалось создать источник. Это не повлияет на выходные данные и ошибки компиляции, которые могут возникнуть в результате. Тип возникшего исключения: "{1}", сообщение: "{2}". {3}
tr: '{0}' oluşturucusu kaynak oluşturamadı. Oluşturucu çıkışa katkıda bulunamaz, bunun sonucunda derleme hataları oluşabilir. Özel durum '{2}' iletisi ile '{1}' türündeydi. {3}
zh_hant: 產生器 '{0}' 無法產生來源。其不會提供給輸出，並可能導致編譯錯誤。例外狀況的類型為 '{1}'，訊息為 '{2}'。 {3}

# WRN_GeneratorFailedDuringGeneration_Title
source: Generator failed to generate source.
es: Error del generador al crear código fuente.
it: Il generatore non è riuscito a generare l'origine.
ja: ジェネレーターはソースを生成できませんでした。
ko: 생성기가 소스를 생성하지 못했습니다.
pl: Generator nie mógł wygenerować źródła.
pt_br: O gerador não pôde gerar a origem.
ru: Генератору не удалось создать источник.
tr: Oluşturucu kaynak oluşturamadı.
zh_hant: 產生器無法產生來源。

# WRN_GeneratorFailedDuringInitialization
source: Generator '{0}' failed to initialize. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'. {3}
es: El generador '{0} ' no se pudo inicializar. No contribuye a la salida y pueden producirse errores de compilación como resultado. La excepción era de tipo '{1}' con el mensaje '{2}'. {3}
it: Non è stato possibile inizializzare il generatore '{0}'. Non contribuirà quindi all'output ed è possibile che si verifichino errori di compilazione. Eccezione di tipo '{1}' con messaggio '{2}'. {3}
ko: 생성기 '{0}'이(가) 초기화하지 못했습니다. 출력에 기여하지 않으므로 컴파일 오류가 발생할 수 있습니다. 예외의 형식은 '{1}'이고 메시지는 '{2}'입니다. {3}
pl: Generator „{0}” nie mógł przeprowadzić inicjalizacji. W rezultacie nie będzie on współtworzyć danych wyjściowych i mogą wystąpić błędy kompilacji. Wyjątek był typu „{1}” z komunikatem „{2}”. {3}
ru: Не удалось инициализировать генератор "{0}". Это не повлияет на выходные данные и ошибки компиляции, которые могут возникнуть в результате. Тип возникшего исключения: "{1}", сообщение: "{2}". {3}
tr: '{0}' oluşturucusu başlatılamadı. Oluşturucu çıkışa katkıda bulunamaz, bunun sonucunda derleme hataları oluşabilir. Özel durum '{2}' iletisi ile '{1}' türündeydi. {3}
zh_hant: 產生器 '{0}' 無法初始化。其不會提供給輸出，並可能導致編譯錯誤。例外狀況的類型為 '{1}'，訊息為 '{2}'。 {3}

# WRN_GeneratorFailedDuringInitialization_Title
source: Generator failed to initialize.
es: Error de inicialización del generador.
it: Non è stato possibile inizializzare il generatore.
ja: ジェネレーターを初期化できませんでした。
ko: 생성기가 초기화하지 못했습니다.
pl: Generator nie mógł przeprowadzić inicjalizacji.
pt_br: Falha na inicialização do gerador.
ru: Не удалось инициализировать генератор.
tr: Oluşturucu başlatılamadı.
zh_hant: 產生器無法初始化。

source: Wrong number of type arguments
cs: Chybný počet argumentů typu
de: Falsche Anzahl von Typargumenten.
es: Número de argumentos de tipo incorrecto
fr: Nombre incorrect d'arguments de type
it: Il numero di argomenti di tipo è errato
ja: 型引数の数が正しくありません
ko: 형식 인수 수가 잘못되었습니다.
pl: Nieprawidłowa liczba argumentów typu
pt_br: Número errado de argumentos de tipo
ru: Неверное число аргументов типа
tr: Tür bağımsız değişkenlerinin yanlış sayısı
zh_hans: 类型参数的数目不正确
zh_hant: 類型引數的數目錯誤

# ERR_FileNotFound
source: file '{0}' could not be found
cs: Soubor {0} se nenašel.
de: Die Datei "{0}" wurde nicht gefunden.
es: no se encontró el archivo '{0}'
fr: le fichier '{0}' est introuvable
it: Il file '{0}' non è stato trovato
ja: ファイル '{0}' が見つかりませんでした
ko: '{0}' 파일을 찾을 수 없습니다.
pl: nie znaleziono pliku „{0}”
pt_br: arquivo "{0}" não pode ser encontrado
ru: Не удалось найти файл "{0}".
tr: '{0}' dosyası bulunamadı
zh_hans: 找不到文件“{0}”。
zh_hant: 找不到檔案 '{0}'

# ERR_NoResponseFile
source: unable to open response file '{0}'
cs: Nejde otevřít soubor s odpovědí {0}.
de: Fehler beim Öffnen der Antwortdatei "{0}"
es: no se puede abrir el archivo de respuesta '{0}'
fr: impossible d'ouvrir le fichier réponse '{0}'
it: non è possibile aprire il file di risposta '{0}'
ja: 応答ファイル '{0}' を開くことができません
ko: '{0}' 응답 파일을 열 수 없습니다.
pl: nie można otworzyć pliku odpowiedzi „{0}”
pt_br: não é possível abrir o arquivo de resposta "{0}"
ru: Не удается открыть файл ответов "{0}".
tr: '{0}' yanıt dosyası açılamadı
zh_hans: 无法打开响应文件“{0}”
zh_hant: 無法開啟回應檔 '{0}'

# ERR_ArgumentRequired
source: option '{0}' requires '{1}'
cs: Parametr {0} vyžaduje {1}.
de: Option "{0}" erfordert "{1}"
es: la opción '{0}' requiere '{1}'
fr: l'option '{0}' requiert '{1}'
it: con l'opzione '{0}' è richiesto '{1}'
ja: オプション '{0}' には '{1}' が必要です
ko: '{0}' 옵션을 사용하려면 '{1}'이(가) 필요합니다.
pl: opcja „{0}” wymaga argumentu „{1}”
pt_br: opção "{0}" requer "{1}"
ru: параметр "{0}" требует "{1}"
tr: '{0}' seçeneği için '{1}' gerekiyor
zh_hans: 选项“{0}”需要“{1}”
zh_hant: 選項 '{0}' 需要 '{1}'

# ERR_SwitchNeedsBool
source: option '{0}' can be followed only by '+' or '-'
cs: Za parametrem {0} může následovat pouze znak + nebo -.
de: Auf die Option "{0}" darf nur "+" oder "-" folgen.
es: la opción '{0}' solo puede ir seguida de '+' o '-'
fr: l'option '{0}' ne peut être suivie que de '+' ou '-'
it: l'opzione '{0}' può essere seguita solo da '+' o da '-'
ja: オプション '{0}' の後には '+' または '-' のみを指定できます
ko: '{0}' 옵션 뒤에는 '+' 또는 '-'만 올 수 있습니다.
pl: po opcji „{0}” może występować tylko znak „+” lub „-”
pt_br: opção "{0}" pode ser seguida somente por "+" ou "-"
ru: за параметром "{0}" может следовать только "+" или "-"
tr: '{0}' seçeneğinin arkasından yalnızca '+' veya '-' gelebilir
zh_hans: 选项“{0}”后面只能跟“+”或“-”
zh_hant: 選項 '{0}' 之後只可接著 '+' 或 '-'

# ERR_InvalidSwitchValue
source: the value '{1}' is invalid for option '{0}'
cs: Hodnota {1} je pro možnost {0} neplatná.
de: Der Wert "{1}" ist für die Option"{0}" nicht gültig.
es: el valor '{1}' no es válido para la opción '{0}'
fr: la valeur '{1}' n'est pas valide pour l'option '{0}'
it: il valore '{1}' non è valido per l'opzione '{0}'
ja: 値 '{1}' はオプション '{0}' に対して無効です
ko: '{1}' 값은 '{0}' 옵션에 사용할 수 없습니다.
pl: wartość „{1}” jest nieprawidłowa dla opcji „{0}”
pt_br: o valor '{1}' é inválido para a opção '{0}'
ru: значение "{1}" недопустимо для параметра "{0}"
tr: '{0}' seçeneği için '{1}' değeri geçersiz
zh_hans: 值“{1}”对选项“{0}”无效
zh_hant: 值 '{1}' 對選項 '{0}' 無效
