Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CannotInferNullableForVariable1
source: A nullable type cannot be inferred for variable '{0}'.
cs: Nejde odvodit typ s možnou hodnotou null pro proměnnou {0}.
de: Für die Variable "{0}" kann kein Typ abgeleitet werden, der NULL-Werte zulässt.
es: No se puede inferir un tipo que acepte valores NULL para la variable '{0}'.
fr: Impossible de déduire un type Nullable pour la variable '{0}'.
it: Non è possibile dedurre un tipo nullable per la variabile '{0}'.
ja: 変数 '{0}' の Null 許容型を推論できません。
ko: '{0}' 변수에 대해 null 허용 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu dopuszczającego wartość null dla zmiennej „{0}”.
pt_br: Um tipo anulável não pode ser inferido para variável "{0}".
ru: Тип, допускающий значение Null, не может быть определен для переменной "{0}".
tr: '{0}' değişkeni için null yapılabilir bir tür çıkarsanamıyor.
zh_hans: 对于变量“{0}”不能推断可以为 null 的类型。
zh_hant: 無法為變數 '{0}' 推斷可為 Null 的類型。

# ERR_NullableTypeInferenceNotSupported
source: Nullable type inference is not supported in this context.
cs: V tomto kontextu se nepodporuje odvození typu připouštějícího hodnotu Null.
de: Der Rückschluss von Typen, die NULL-Werte zulassen, wird in diesem Kontext nicht unterstützt.
es: No se admite la inferencia de tipos que acepten valores NULL en este contexto.
fr: L'inférence de type Nullable n'est pas prise en charge dans ce contexte.
it: L'inferenza di tipi nullable non è supportata in questo contesto.
ja: null 許容型推論は、このコンテキストではサポートされていません。
ko: 이 컨텍스트에서는 nullable 형식을 유추할 수 없습니다.
pl: Wnioskowanie typu dopuszczającego wartość null nie jest obsługiwane w tym kontekście.
pt_br: Não há suporte para dedução de tipo anulável neste contexto.
ru: Определение типа, допускающего значения NULL, не поддерживается в текущем контексте.
tr: Bu bağlamda null yapılabilir tür çıkarsama desteklenmiyor.
zh_hans: 在该上下文中不支持可以为 null 的类型推理。
zh_hant: 此處不支援可為 Null 的類型推斷。

# ERR_ExpectedJoin
source: 'Join' expected.
cs: 'Očekávalo se klíčové slovo Join.
de: '"Join" erwartet.
es: 'Se esperaba 'Join'.
fr: 'Join' attendu.
it: 'È previsto 'Join'.
ja: 'Join' が必要です。
ko: 'Join'이 필요합니다.
pl: 'Oczekiwano operatora „Join”.
pt_br: 'Join' esperado.
ru: 'Требуется "Join".
tr: 'Join' bekleniyor.
zh_hans: '应为“Join”。
zh_hant: '必須是 'Join'。

# ERR_NullableParameterMustSpecifyType
source: Nullable parameters must specify a type.
cs: U parametrů připouštějících hodnotu Null musí být určený typ.
de: Parameter, die NULL-Werte zulassen, müssen einen Typ angeben.
es: Los parámetros que aceptan valores NULL deben especificar un tipo.
fr: Les paramètres Nullable doivent spécifier un type.
it: I parametri nullable devono specificare un tipo.
ja: Null 許容パラメーターには型を指定しなければなりません。
ko: nullable 매개 변수에 형식을 지정해야 합니다.
pl: Parametry dopuszczające wartości null muszą określać typ.
pt_br: Parâmetros anuláveis devem especificar um tipo.
ru: Параметры, допускающие значения NULL, должны задавать тип.
tr: Null yapılabilen parametreler tür belirtmelidir.
zh_hans: 可以为 null 的参数必须指定一个类型。
zh_hant: 可為 Null 的參數必須指定類型。

# ERR_IterationVariableShadowLocal2
source: Range variable '{0}' hides a variable in an enclosing block, a previously defined range variable, or an implicitly declared variable in a query expression.
cs: Proměnná rozsahu {0} skrývá proměnnou v nadřízeném bloku, dříve definovanou proměnnou rozsahu nebo implicitně deklarovanou proměnnou ve výrazu dotazu.
de: Die Bereichsvariable "{0}" verbirgt eine Variable in einem einschließenden Block, eine zuvor definierte Bereichsvariable oder eine implizit im Abfrageausdruck deklarierte Variable.
es: La variable de rango '{0}' oculta una variable en un bloque envolvente, una variable de rango definida anteriormente o una variable declarada de forma implícita en una expresión de consulta.
fr: La variable de portée '{0}' masque une variable dans un bloc englobant, une variable de portée précédemment définie ou une variable déclarée implicitement dans une expression de requête.
it: La variabile di intervallo '{0}' nasconde una variabile in un blocco di inclusione, una variabile di intervallo definita in precedenza o una variabile dichiarata in modo implicito in un'espressione di query.
ja: 範囲変数 '{0}' により、それを囲むブロック内の変数、以前に定義された範囲変数、またはクエリ式内で暗黙的に宣言された変数が隠ぺいされます。
ko: '{0}' 범위 변수가 바깥쪽 블록의 변수, 이전에 정의한 범위 변수 또는 쿼리 식에 암시적으로 선언한 변수를 숨깁니다.
pl: Zmienna zakresu „{0}” ukrywa zmienną w otaczającym bloku, w uprzednio zdefiniowanej zmiennej zakresu lub w niejawnie zadeklarowanej zmiennej w wyrażeniu zapytania.
pt_br: A variável de intervalo "{0}" oculta uma variável em um bloco delimitador, uma variável de intervalo definida anteriormente ou uma variável declarada implicitamente em uma expressão de consulta.
ru: Переменная диапазона "{0}" скрывает переменную во внешнем блоке, ранее определенную переменную диапазона или неявно объявленную переменную в выражении запроса.
tr: '{0}' aralık değişkeni kapsayan bir blok içinde bir değişken, daha önce tanımlanmış bir aralık değişkeni veya sorgu ifadesinde örtük olarak bildirilmiş bir değişken gizliyor.
zh_hans: 范围变量“{0}”隐藏封闭块中的某个变量、以前定义的某个范围变量或者在查询表达式中隐式声明的某个变量。
zh_hant: 範圍變數 '{0}' 可隱藏封閉區塊中的變數、預先定義的範圍變數，或查詢運算式中隱含宣告的變數。

# ERR_LambdasCannotHaveAttributes
source: Attributes cannot be applied to parameters of lambda expressions.
cs: Pro parametry výrazů lambda nejde použít atributy.
de: Attribute können nicht auf Parameter von Lambdaausdrücken angewendet werden.
es: No se puede aplicar atributos a parámetros de expresiones lambda.
fr: Des attributs ne peuvent pas être appliqués aux paramètres d'expressions lambda.
it: Non è possibile applicare attributi a parametri delle espressioni lambda.
ja: ラムダ式のパラメーターに属性を適用することはできません。
ko: 람다 식의 매개 변수에는 특성을 적용할 수 없습니다.
pl: Nie można zastosować atrybutów do parametrów wyrażeń lambda.
pt_br: Não é possível aplicar atributos a parâmetros de expressões lambda.
ru: Атрибуты не могут быть применены к параметрам лямбда-выражений.
tr: Öznitelikler lambda ifadelerin parametrelerine uygulanamaz.
zh_hans: 特性不能应用于 lambda 表达式的参数。
zh_hant: 屬性無法套用到 Lambda 運算式的參數。

# ERR_LambdaInSelectCaseExpr
source: Lambda expressions are not valid in the first expression of a 'Select Case' statement.
cs: Použití výrazů lambda v prvním výrazu příkazu Select Case je neplatné.
de: Lambdaausdrücke sind im ersten Ausdruck einer "Select Case"-Anweisung nicht gültig.
es: Las expresiones lambda no son válidas en la primera expresión de una instrucción 'Select Case'.
fr: Les expressions lambda ne sont pas valides dans la première expression d'une instruction 'Select Case'.
it: Le espressioni lambda non sono valide nella prima espressione di un'istruzione 'Select Case'.
ja: ラムダ式は、'Select Case' ステートメントの最初の式では有効ではありません。
ko: 람다 식은 'Select Case' 문의 첫 번째 식에 사용할 수 없습니다.
pl: Wyrażenia lambda nie są prawidłowe w pierwszym wyrażeniu instrukcji Select Case.
pt_br: Expressões lambda não são válidas na primeira expressão de uma instrução 'Select Case'.
ru: Лямбда-выражения являются недопустимыми в первом выражении инструкции "Select Case".
tr: Select Case' deyiminin ilk ifadesinde lambda ifadeleri geçerli değildir.
zh_hans: Lambda 表达式在 "Select Case" 语句的第一个表达式中无效。
zh_hant: Lambda 運算式在 'Select Case' 陳述式的第一個運算式中無效。

# ERR_AddressOfInSelectCaseExpr
source: 'AddressOf' expressions are not valid in the first expression of a 'Select Case' statement.
cs: 'Použití výrazů AddressOf v prvním výrazu příkazu Select Case je neplatné.
de: 'AddressOf-Ausdrücke sind im ersten Ausdruck einer "Select Case"-Anweisung nicht gültig.
es: 'Las expresiones 'AddressOf' no son válidas en la primera expresión de una instrucción 'Select Case'.
fr: 'Les expressions 'AddressOf' ne sont pas valides dans la première expression d'une instruction 'Select Case'.
it: 'Le espressioni 'AddressOf' non sono valide nella prima espressione di un'istruzione 'Select Case'.
ja: 'AddressOf' 式は、'Select Case' ステートメントの最初の式では有効ではありません。
ko: 'Select Case' 문의 첫 번째 식에서는 'AddressOf' 식을 사용할 수 없습니다.
pl: 'Wyrażenia „AddressOf” nie są prawidłowe w pierwszym wyrażeniu instrukcji „Select Case”.
pt_br: 'Expressões 'AddressOf' não são válidas na primeira expressão de uma instrução 'Select Case'.
ru: 'Выражения "AddressOf" недопустимы в первом выражении оператора "Select Case".
tr: 'AddressOf' ifadeleri, 'Select Case' deyiminin ilk ifadesinde geçerli değildir.
zh_hans: '“AddressOf”表达式在“Select Case”语句的第一个表达式中无效。
zh_hant: 'AddressOf' 運算式在 'Select Case' 陳述式的第一個運算式中無效。

# ERR_NullableCharNotSupported
source: The '?' character cannot be used here.
cs: Na tomto místě nejde použít znak ?.
de: An dieser Stelle darf das Zeichen "?" nicht verwendet werden.
es: No se puede usar aquí el carácter '?'.
fr: Impossible d'utiliser le caractère '?' ici.
it: In questo punto non è possibile usare il carattere '?'.
ja: ?' 文字はここでは使用できません。
ko: ?' 문자는 여기에서 사용할 수 없습니다.
pl: Tutaj nie można użyć znaku „?”.
pt_br: O caractere '?' não pode ser usado aqui.
ru: Символ "?" нельзя употреблять здесь.
tr: Burada '?' karakteri kullanılamaz.
zh_hans: 此处不能使用 "?" 字符。
zh_hant: ?' 字元不能用在這裡。

# ERR_CannotLiftStructureMeLambda
source: Instance members and 'Me' cannot be used within a lambda expression in structures.
cs: Ve výrazech lambda ve strukturách nejde používat členy instance a klíčové slovo Me.
de: Instanzmember und "Me" können in Strukturen in Lambdaausdrücken nicht verwendet werden.
es: No se pueden usar miembros de instancia ni 'Me' dentro de una expresión lambda en estructuras.
fr: Les membres d'instance et 'Me' ne peuvent pas être utilisés au sein d'une expression lambda dans des structures.
it: Non è possibile usare membri di istanza e 'Me' in un'espressione lambda delle strutture.
ja: インスタンス メンバーおよび 'Me' は、構造体内のラムダ式では使用できません。
ko: 인스턴스 멤버와 'Me'는 구조체의 람다 식에 사용할 수 없습니다.
pl: Nie można używać składowych wystąpień i elementu „Me” w wyrażeniach lambda w strukturach.
pt_br: Membros de instância e 'Me' não podem ser usados em uma expressão lambda em estruturas.
ru: Члены экземпляров и "Me" не могут быть использованы внутри лямбда-выражений в структурах.
tr: Yapılardaki lambda ifadesinin içinde örnek üyeleri ve 'Me' kullanılamaz.
zh_hans: 无法在结构中的 lambda 表达式内使用实例成员和“Me”。
zh_hant: 執行個體成員和 'Me' 不能用在結構的 Lambda 運算式中。

# ERR_CannotLiftByRefParamLambda1
source: 'ByRef' parameter '{0}' cannot be used in a lambda expression.
cs: 'Ve výrazu lambda nejde použít parametr {0} typu ByRef.
de: 'Der ByRef-Parameter "{0}" kann in einem Lambdaausdruck nicht verwendet werden.
es: 'El parámetro '{0}' de 'ByRef' no se puede usar en una expresión lambda.
fr: 'Le paramètre 'ByRef' '{0}' ne peut pas être utilisé dans une expression lambda.
it: 'Non è possibile usare il parametro '{0}' di 'ByRef' in un'espressione lambda.
ja: 'ByRef' パラメーター '{0}' をラムダ式で使用することはできません。
ko: '람다 식에는 'ByRef' 매개 변수 '{0}'을(를) 사용할 수 없습니다.
pl: 'Nie można użyć parametru ByRef „{0}” w wyrażeniu lambda.
pt_br: 'Parâmetro "ByRef" "{0}" não pode ser usado em uma expressão lambda.
ru: 'Параметр "ByRef" "{0}" нельзя использовать в лямбда-выражении.
tr: '{0}' 'ByRef' parametresi lambda ifadesinde kullanılamaz.
zh_hans: '不能在 lambda 表达式中使用“ByRef”参数“{0}”。
zh_hant: 'ByRef' 參數 '{0}' 不可用在 Lambda 運算式中。

# ERR_CannotLiftRestrictedTypeLambda
source: Instance of restricted type '{0}' cannot be used in a lambda expression.
cs: Ve výrazu lambda nejde použít instanci omezeného typu {0}.
de: Eine Instanz des eingeschränkten Typs "{0}" kann in einem Lambdaausdruck nicht verwendet werden.
es: La instancia del tipo restringido '{0}' no se puede usar en una expresión lambda.
fr: Impossible d'utiliser l'instance du type restreint '{0}' dans une expression lambda.
it: Non è possibile usare l'istanza di tipo limitato '{0}' in un'espressione lambda.
ja: 制限がある型 '{0}' のインスタンスをラムダ式で使用することはできません。
ko: 제한된 '{0}' 형식의 인스턴스는 람다 식에 사용할 수 없습니다.
pl: Nie można użyć wystąpienia typu ograniczonego „{0}” w wyrażeniu lambda.
pt_br: Instância de tipo restrito "{0}" não pode ser usado em uma expressão lambda.
ru: Экземпляр ограниченного типа "{0}" нельзя использовать в лямбда-выражении.
tr: Lambda ifadelerinde kısıtlanmış '{0}' türünün örneği kullanılamaz.
zh_hans: 不能在 lambda 表达式中使用受限类型“{0}”的实例。
zh_hant: 受限制的類型 '{0}' 之執行個體，不能用在 Lambda 運算式中。

# ERR_LambdaParamShadowLocal1
source: Lambda parameter '{0}' hides a variable in an enclosing block, a previously defined range variable, or an implicitly declared variable in a query expression.
cs: Parametr lambda {0} skrývá proměnnou v nadřízeném bloku, dříve definovanou proměnnou rozsahu nebo implicitně deklarovanou proměnnou ve výrazu dotazu.
de: Der Lambdaparameter "{0}" verbirgt eine Variable in einem einschließenden Block, eine zuvor definierte Bereichsvariable oder eine implizit im Abfrageausdruck deklarierte Variable.
es: El parámetro lambda '{0}' oculta una variable en un bloque envolvente, una variable de rango definida anteriormente o una variable declarada de forma implícita en una expresión de consulta.
fr: Le paramètre lambda '{0}' masque une variable dans un bloc englobant, une variable de portée précédemment définie ou une variable déclarée implicitement dans une expression de requête.
it: Il parametro lambda '{0}' nasconde una variabile in un blocco di inclusione, una variabile di intervallo definita in precedenza o una variabile dichiarata in modo implicito in un'espressione di query.
ja: ラムダ パラメーター '{0}' により、それを囲むブロック内の変数、以前に定義された範囲変数、またはクエリ式内で暗黙的に宣言された変数が隠ぺいされます。
ko: 람다 매개 변수 '{0}'이(가) 바깥쪽 블록의 변수, 이전에 정의한 범위 변수 또는 쿼리 식에 암시적으로 선언한 변수를 숨깁니다.
pl: Parametr lambda „{0}” ukrywa zmienną w otaczającym bloku, w uprzednio zdefiniowanej zmiennej zakresu lub w niejawnie zadeklarowanej zmiennej w wyrażeniu zapytania.
pt_br: O parâmetro lambda "{0}" oculta uma variável em um bloco delimitador, uma variável de intervalo definida anteriormente ou uma variável declarada implicitamente em uma expressão de consulta.
ru: Лямбда-параметр "{0}" скрывает переменную во внешнем блоке, ранее определенную переменную диапазона или неявно объявленную переменную в выражении запроса.
tr: '{0}' lambda parametresi kapsayan bir blok içinde bir değişken, daha önce tanımlanmış bir aralık değişkeni veya sorgu ifadesinde örtük olarak bildirilmiş bir değişken gizliyor.
zh_hans: Lambda 参数“{0}”隐藏封闭块中的某个变量、以前定义的某个范围变量或者在查询表达式中隐式声明的某个变量。
zh_hant: Lambda 參數 '{0}' 隱藏了封閉區塊中的變數、預先定義的範圍變數，或查詢運算式中隱含宣告的變數。

# ERR_StrictDisallowImplicitObjectLambda
source: Option Strict On requires each lambda expression parameter to be declared with an 'As' clause if its type cannot be inferred.
cs: Možnost Strict On vyžaduje, aby byl každý parametr výrazu lambda deklarován s klauzulí As, pokud jeho typ nejde odvodit.
de: "Option Strict On" erfordert, dass alle Parameter von Lambdaausdrücken mit einer As-Klausel deklariert werden, wenn der Typ nicht abgeleitet werden kann.
es: Option Strict On requiere que los parámetros de la expresión lambda estén declarados con una cláusula 'As' si no se puede inferir su tipo.
fr: Chaque paramètre d'expression lambda de Option Strict On doit être déclaré avec une clause 'As' si son type ne peut pas être déduit.
it: Option Strict On richiede che ciascun parametro di espressione lambda venga dichiarato con una clausola 'As' se non è possibile dedurne il relativo tipo.
ja: Option Strict On では、各ラムダ式のパラメーターの型を推論できない場合、そのパラメーターを 'As' 句で宣言する必要があります。
ko: Option Strict On에서는 각 람다 식 매개 변수의 형식을 유추할 수 없을 경우 해당 매개 변수를 'As' 절로 선언해야 합니다.
pl: Ustawienie Option Strict On wymaga zadeklarowania każdego parametru wyrażenia lambda za pomocą klauzuli „As”, jeśli nie można wywnioskować ich typu.
pt_br: Option Strict On requer que cada parâmetro de expressão lambda seja declarado com uma cláusula 'As' se não for possível inferir o tipo.
ru: Параметр "Strict On" требует, чтобы все лямбда-выражения были объявлены с использованием предложения "As" в случае, если тип не может быть определен.
tr: Option Strict On, her lambda ifadesi parametresinin, türü çıkarsanamıyorsa bir 'As' yan tümcesiyle bildirilmesini gerektirir.
zh_hans: Option Strict On 要求使用 "As" 子句来声明其类型无法推断的每个 lambda 表达式参数。
zh_hant: Option Strict 為 On 時，要求如果無法推斷每個 Lambda 運算式參數的類型，就必須以 'As' 子句宣告該參數。

# ERR_CantSpecifyParamsOnLambdaParamNoType
source: Array modifiers cannot be specified on lambda expression parameter name. They must be specified on its type.
cs: U názvu parametru výrazu lambda nejde zadat modifikátory pole. Tyto modifikátory musí být uvedeny u jeho typu.
de: Arraymodifizierer dürfen nicht im Parameternamen von Lambdaausdrücken angegeben werden. Sie müssen in ihrem Typ angegeben werden.
es: No se pueden especificar modificadores de matriz en el nombre del parámetro de una expresión lambda. Deben especificarse en su tipo.
fr: Impossible de spécifier des modificateurs de tableau pour le nom de paramètre d'une expression lambda. Ils doivent être spécifiés dans son type.
it: Non è possibile specificare modificatori di matrici nel nome di parametro dell'espressione lambda. Specificarli nel tipo.
ja: 配列修飾子をラムダ式のパラメーター名に指定することはできません。配列修飾子は、その型に指定する必要があります。
ko: 람다 식 매개 변수 이름에는 배열 한정자를 지정할 수 없습니다. 배열 한정자는 해당 형식에 지정해야 합니다.
pl: Nie można określić modyfikatorów tablicy w nazwie parametru wyrażenia lambda. Muszą być one określone w jego typie.
pt_br: Não é possível especificar modificadores de matriz no nome de parâmetro da expressão lambda. Eles devem ser especificados em seu tipo.
ru: Модификаторы массива не могут указываться в имени параметра лямбда-выражения. Они должны задаваться по его типу.
tr: Lambda ifadesi parametre adı üzerinde dizi değiştiriciler belirtilemez. Bunun türü üzerinde belirtilmeleri gerekir.
zh_hans: 不能在 lambda 表达式的参数名中指定数组修饰符。数组修饰符必须在其类型中指定。
zh_hant: 不能在 Lambda 運算式參數名稱上指定陣列修飾元，而必須在其類型上指定。

# ERR_TypeInferenceFailure1
source: Data type(s) of the type parameter(s) cannot be inferred from these arguments. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu. Je možné, že se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter können nicht von diesen Argumenten abgeleitet werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo no se pueden inferir de estos argumentos. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type à partir de ces arguments. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo da questi argomenti. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: 型パラメーターのデータ型を、これらの引数から推論することはできません。データ型を明示的に指定すると、このエラーが修正される可能性があります。
ko: 이 인수에서 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Não é possível inferir os tipos de dados dos parâmetros de tipo com base nesses argumentos. A especificação explícita dos tipos de dados deve corrigir esse erro.
ru: Типы данных параметров-типов не могут быть определены из этих аргументов. Явное указание типов данных может исправить эту ошибку.
tr: Bu bağımsız değişkenlerden tür parametrelerinin veri türleri çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断类型形参的数据类型。显式指定该数据类型可更正此错误。
zh_hant: 無法從這些引數推斷類型參數的資料類型。明確指定資料類型或許可以改正這項錯誤。

# ERR_TypeInferenceFailure2
source: Data type(s) of the type parameter(s) in method '{0}' cannot be inferred from these arguments. Specifying the data type(s) explicitly might correct this error.
cs: Z těchto argumentů nejde odvodit datové typy parametrů typu v metodě {0}. Možná se chybu podaří odstranit explicitním zadáním datových typů.
de: Die Datentypen der Typparameter in der {0}-Methode können nicht von diesen Argumenten abgeleitet werden. Sie können diesen Fehler möglicherweise beheben, indem Sie die Datentypen explizit angeben.
es: Los tipos de datos de los parámetros de tipo del método '{0}' no se pueden inferir de estos argumentos. Este error se puede corregir especificando los tipos de datos explícitamente.
fr: Impossible de déduire le ou les types de données du ou des paramètres de type dans la méthode '{0}' à partir de ces arguments. La spécification explicite du ou des types de données peut permettre de corriger cette erreur.
it: Non è possibile dedurre i tipi di dati dei parametri di tipo nel metodo '{0}' da questi argomenti. Per correggere l'errore, provare a specificare i tipi di dati in modo esplicito.
ja: メソッド '{0}' 内の型パラメーターのデータ型をこれらの引数から推論することはできません。データ型を明示的に指定することによって、このエラーを修正できる場合があります。
ko: 이 인수에서 '{0}' 메서드에 있는 형식 매개 변수의 데이터 형식을 유추할 수 없습니다. 데이터 형식을 명시적으로 지정하면 이 오류를 해결할 수 있습니다.
pl: Na podstawie tych argumentów nie można wywnioskować typów danych parametrów typu w metodzie „{0}”. Jawne określenie typów danych może rozwiązać ten problem.
pt_br: Tipo(s) de dados do(s) parâmetro(s) de tipo no método "{0}" não pode(m) ser inferido(s) destes argumentos. Especificar o(s) tipo(s) de dados explicitamente talvez corrija esse erro.
ru: Типы данных параметров типа в методе "{0}" не могут быть получены из этих аргументов. Явное указание типов данных может исправить эту ошибку.
tr: '{0}' yöntemindeki tür parametrelerinin veri türleri bu bağımsız değişkenlerden çıkarsanamıyor. Veri türlerinin açıkça belirtilmesi bu hatayı düzeltebilir.
zh_hans: 无法从这些实参推断方法“{0}”中类型形参的数据类型。显式指定数据类型可更正此错误。
zh_hant: 無法從這些引數推斷方法 '{0}' 中類型參數的資料類型。明確指定資料類型或許可更正此項錯誤。
