Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidUseOfKeyword
source: Keyword is not valid as an identifier.
cs: Klíčové slovo není platné jako identifikátor.
de: Das Schlüsselwort ist kein gültiger Bezeichner.
es: Una palabra clave no es válida como identificador.
fr: Mot clé non valide en tant qu'identificateur.
it: La parola chiave non è valida come identificatore.
ja: キーワードは、識別子として有効ではありません。
ko: 키워드를 식별자로 사용할 수 없습니다.
pl: Słowo kluczowe nie jest prawidłowe jako identyfikator.
pt_br: A palavra-chave não é válida como identificador.
ru: Ключевое слово не может использоваться как идентификатор.
tr: Anahtar sözcük bir tanımlayıcı olarak geçerli değildir.
zh_hans: 关键字作为标识符无效。
zh_hant: 以關鍵字做為識別項無效。

# ERR_InvalidEndEnum
source: 'End Enum' must be preceded by a matching 'Enum'.
cs: 'Klíčovému slovu End Enum musí předcházet párové klíčové slovo Enum.
de: '"End Enum" muss ein entsprechendes "Enum" voranstehen.
es: 'End Enum' debe ir precedida de la instrucción 'Enum' correspondiente.
fr: 'End Enum' doit être précédé d'un 'Enum' correspondant.
it: 'End Enum' deve essere preceduto da un elemento 'Enum' corrispondente.
ja: 'End Enum' の前には、対応する 'Enum' を指定しなければなりません。
ko: 'End Enum'은 짝이 되는 'Enum' 뒤에 와야 합니다.
pl: Instrukcja „End Enum” musi być poprzedzona odpowiadającą jej instrukcją „Enum”.
pt_br: 'End Enum' deve ser precedido por 'Enum' correspondente.
ru: 'Оператору "End Enum" должен предшествовать соответствующий оператор "Enum".
tr: 'End Enum' öncesinde eşleşen bir 'Enum' olmalıdır.
zh_hans: '“End Enum”前面必须是匹配的“Enum”。
zh_hant: 'End Enum' 之前必須搭配相對應的 'Enum'。

# ERR_MissingEndEnum
source: 'Enum' must end with a matching 'End Enum'.
cs: 'Klíčové slovo Enum musí být ukončené párovým klíčovým slovem End Enum.
de: '"Enum" muss mit einem entsprechenden "End Enum" abgeschlossen werden.
es: 'Enum' debe terminar con la instrucción 'End Enum' correspondiente.
fr: 'Enum' doit se terminer par un 'End Enum' correspondant.
it: 'Enum' deve terminare con un elemento 'End Enum' corrispondente.
ja: 'Enum' の終わりには、対応する 'End Enum' を指定しなければなりません。
ko: 'Enum'은 짝이 되는 'End Enum'으로 끝나야 합니다.
pl: Instrukcja Enum musi być zakończona odpowiadającą jej instrukcją End Enum.
pt_br: 'Enum' deve terminar com um 'End Enum' correspondente.
ru: 'Блок "Enum" должен заканчиваться соответствующим блоком "End Enum".
tr: 'Enum' öğesi eşleşen bir 'End Enum' ile bitmelidir.
zh_hans: '"Enum" 必须以匹配的 "End Enum" 结束。
zh_hant: 'Enum' 之後必須搭配相對應的 'End Enum'。

# ERR_ExpectedDeclaration
source: Declaration expected.
cs: Očekávala se deklarace.
de: Deklaration erwartet.
es: Se esperaba una declaración.
fr: Déclaration attendue.
it: È prevista la dichiarazione.
ja: 宣言が必要です。
ko: 선언이 필요합니다.
pl: Oczekiwano deklaracji.
pt_br: Declaração esperada.
ru: Ожидалось объявление.
tr: Bildirim bekleniyor.
zh_hans: 应为声明。
zh_hant: 應有宣告。

# ERR_ParamArrayMustBeLast
source: End of parameter list expected. Cannot define parameters after a paramarray parameter.
cs: Byl očekáván konec seznamu parametrů. Nejde definovat parametry za parametrem paramarray.
de: Das Ende der Parameterliste wurde erwartet. Parameter können nicht nach einem ParamArray-Parameter definiert werden.
es: Se esperaba el fin de la lista de parámetros. No se pueden definir parámetros después de un parámetro paramarray.
fr: Fin de liste de paramètres attendue. Impossible de définir des paramètres après un paramètre paramarray.
it: È prevista la fine dell'elenco parametri. Non è possibile definire parametri dopo un parametro ParamArray.
ja: パラメーター リストの最後が必要です。ParamArray パラメーターの後にパラメーターを定義できません。
ko: 매개 변수 목록의 끝이어야 합니다. paramarray 매개 변수 뒤에는 매개 변수를 정의할 수 없습니다.
pl: Oczekiwano końca listy parametrów. Nie można zdefiniować parametrów po parametrze paramarray.
pt_br: Fim de lista de parâmetros esperado. Não é possível definir parâmetros após um parâmetro ParamArray.
ru: Требуется завершение списка параметров. Невозможно определить параметры, расположенные после параметра ParamArray.
tr: Parametre listesi sonu bekleniyor. Paramarray parametresinden sonra parametre tanımlanamaz.
zh_hans: 应为参数列表的结尾。不能在 Paramarray 参数后定义参数。
zh_hant: 必須是參數清單的結尾。無法在 paramarray 參數之後定義參數。

# ERR_SpecifiersInvalidOnInheritsImplOpt
source: Specifiers and attributes are not valid on this statement.
cs: Specifikátory a atributy nejsou pro tento příkaz platné.
de: Spezifizierer und Attribute sind für diese Anweisungen ungültig.
es: Los especificadores y atributos no son válidos en esta instrucción.
fr: Les spécificateurs et les attributs ne sont pas valides pour cette instruction.
it: Identificatori e attributi non sono validi in questa istruzione.
ja: 指定子および属性は、このステートメントでは有効ではありません。
ko: 이 문에는 지정자 및 특성을 사용할 수 없습니다.
pl: Specyfikatory i atrybuty nie są prawidłowe w tej instrukcji.
pt_br: Especificadores e atributos não são válidos nesta instrução.
ru: Для этого оператора спецификаторы и атрибуты являются недопустимыми.
tr: Tanımlayıcılar ve öznitelikler bu deyimde geçerli değil.
zh_hans: 说明符和特性在此语句上无效。
zh_hant: 在此陳述式上的規範和屬性無效。

# ERR_ExpectedSpecifier
source: Expected one of 'Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' or 'Shared'.
cs: Očekávalo se jedno z klíčových slov Dim, Const, Public, Private, Protected, Friend, Shadows, ReadOnly nebo Shared.
de: "Dim", "Const", "Public", "Private", "Protected", "Friend", "Shadows", "ReadOnly" oder "Shared" erwartet.
es: Se esperaba 'Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' o 'Shared'.
fr: Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' ou 'Shared' attendu.
it: È previsto un elemento 'Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' o 'Shared'.
ja: Dim'、'Const'、'Public'、'Private'、'Protected'、'Friend'、'Shadows'、'ReadOnly'、または 'Shared' のいずれかを指定してください。
ko: Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' 또는 'Shared' 중 하나가 필요합니다.
pl: Oczekiwano jednej z instrukcji: Dim, Const, Public, Private, Protected, Friend, Shadows, ReadOnly lub Shared.
pt_br: Esperado um de 'Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' ou 'Shared'.
ru: Требуется один из этих операторов: "Dim", "Const", "Public", "Private", "Protected", "Friend", "Shadows", "ReadOnly" или "Shared".
tr: Dim', 'Const', 'Public', 'Private', 'Protected', 'Friend', 'Shadows', 'ReadOnly' veya 'Shared' seçeneklerinden biri bekleniyor.
zh_hans: 应为“Dim”、“Const”、“Public”、“Private”、“Protected”、“Friend”、“Shadows”、“ReadOnly”或“Shared”中的一个。
zh_hant: 必須是 'Dim'、'Const'、'Public'、'Private'、'Protected'、'Friend'、'Shadows'、'ReadOnly' 或 'Shared' 其中之一。

# ERR_ExpectedComma
source: Comma expected.
cs: Očekávala se čárka.
de: Komma erwartet.
es: Se esperaba una coma.
fr: Virgule attendue.
it: È prevista la virgola.
ja: コンマが必要です。
ko: 쉼표가 필요합니다.
pl: Oczekiwano przecinka.
pt_br: Vírgula esperada.
ru: Требуется запятая.
tr: Virgül bekleniyor.
zh_hans: 应为逗号。
zh_hant: 必須有逗號。

# ERR_ExpectedAs
source: 'As' expected.
cs: 'Očekávalo se klíčové slovo As.
de: '"As" erwartet.
es: 'Se esperaba 'As'.
fr: 'As' attendu.
it: 'È previsto 'As'.
ja: 'As' が必要です。
ko: 'As'가 필요합니다.
pl: 'Oczekiwano klauzuli „As”.
pt_br: 'As' esperado.
ru: 'Требуется "As".
tr: 'As' bekleniyor.
zh_hans: '应为 "As"。
zh_hant: '必須有 'As'。

# ERR_ExpectedRparen
source: ')' expected.
cs: 'Očekával se znak ).
de: '")" erwartet.
es: 'Se esperaba ')'.
fr: ')' attendue.
it: 'È previsto il segno ')'.
ja: ')' が必要です。
ko: ')'가 필요합니다.
pl: 'Oczekiwano znaku „)”.
pt_br: ')' esperado.
ru: 'Требуется ")".
tr: ')' bekleniyor.
zh_hans: '应为 ")"。
zh_hant: '必須有 ')'。

# ERR_ExpectedLparen
source: '(' expected.
cs: 'Očekával se znak (.
de: '"(" erwartet.
es: 'Se esperaba '('.
fr: '(' attendue.
it: 'È previsto il segno '('.
ja: '(' が必要です。
ko: '('가 필요합니다.
pl: 'Oczekiwano znaku „(”.
pt_br: '(' esperado.
ru: 'Требуется "(".
tr: '(' bekleniyor.
zh_hans: '应为“(”。
zh_hant: '必須有 '('。

# ERR_InvalidNewInType
source: 'New' is not valid in this context.
cs: 'Klíčové slovo New není v tomto kontextu platné.
de: '"New" ist in diesem Kontext ungültig.
es: 'New' no es válido en este contexto.
fr: 'New' n'est pas valide dans ce contexte.
it: 'New' non è valido in questo contesto.
ja: 'このコンテキストでは、'New' は無効です。
ko: '이 컨텍스트에서는 'New'를 사용할 수 없습니다.
pl: 'Instrukcja New nie jest prawidłowa w tym kontekście.
pt_br: 'New' não é válido neste contexto.
ru: 'В этом контексте "New" является недействительным.
tr: 'New' bu bağlamda geçerli değildir.
zh_hans: '"New" 在此上下文中无效。
zh_hant: 'New' 在此內容中無效。

# ERR_ExpectedExpression
source: Expression expected.
cs: Očekával se výraz.
de: Ausdruck erwartet.
es: Se esperaba una expresión.
fr: Expression attendue.
it: È prevista l'espressione.
ja: 式が必要です。
ko: 식이 필요합니다.
pl: Oczekiwano wyrażenia.
pt_br: Expressão esperada.
ru: Требуется выражение.
tr: İfade bekleniyor.
zh_hans: 应为表达式。
zh_hant: 應有運算式。

# ERR_ExpectedOptional
source: 'Optional' expected.
cs: 'Očekávalo se klíčové slovo Optional.
de: '"Optional" erwartet.
es: 'Se esperaba 'Optional'.
fr: 'Optional' attendu.
it: 'È previsto 'Optional'.
ja: 'Optional' が必要です。
ko: 'Optional'이 필요합니다.
pl: 'Oczekiwano instrukcji „Optional”.
pt_br: 'Optional' esperado.
ru: 'Требуется "Optional".
tr: 'Optional' bekleniyor.
zh_hans: '应为 "Optional"。
zh_hant: '必須有 'Optional'。

# ERR_ExpectedIdentifier
source: Identifier expected.
cs: Očekával se identifikátor.
de: Bezeichner erwartet.
es: Se esperaba un identificador.
fr: Identificateur attendu.
it: È previsto un identificatore.
ja: 識別子が必要です。
ko: 식별자가 필요합니다.
pl: Oczekiwano identyfikatora.
pt_br: Identificador esperado.
ru: Требуется идентификатор.
tr: Tanımlayıcı bekleniyor.
zh_hans: 应为标识符。
zh_hant: 應有識別項。

# ERR_ExpectedIntLiteral
source: Integer constant expected.
cs: Očekávala se celočíselná konstanta.
de: Ganzzahlkonstante erwartet.
es: Se esperaba una constante de tipo entero.
fr: Constante Integer attendue.
it: È prevista la costante Integer.
ja: 整数の定数が必要です。
ko: 정수 계열 상수가 필요합니다.
pl: Oczekiwano stałej całkowitej.
pt_br: Constante de inteiro esperada.
ru: Требуется целочисленная константа.
tr: Tamsayı sabiti bekleniyor.
zh_hans: 应为整数常量。
zh_hant: 必須有整數常數。

# ERR_ExpectedEOS
source: End of statement expected.
cs: Očekával se konec příkazu.
de: end of-Anweisung erwartet.
es: Se esperaba el fin de instrucción.
fr: Fin d'instruction attendue.
it: È prevista la fine dell'istruzione.
ja: ステートメントの終わりを指定してください。
ko: 문의 끝이 필요합니다.
pl: Oczekiwano końca instrukcji.
pt_br: Fim de instrução esperado.
ru: Требуется завершение оператора.
tr: Deyim sonu bekleniyor.
zh_hans: 应为语句结束。
zh_hant: 必須有陳述式結尾。

# ERR_ExpectedForOptionStmt
source: 'Option' must be followed by 'Compare', 'Explicit', 'Infer', or 'Strict'.
cs: 'Za klíčovým slovem Option musí následovat klíčové slovo Compare, Explicit, Infer nebo Strict.
de: 'Auf "Option" muss "Compare", "Explicit", "Infer" oder "Strict" folgen.
es: 'Option' debe ir seguido de 'Compare', 'Explicit', 'Infer' o 'Strict'.
fr: 'Option' doit être suivi de 'Compare', 'Explicit', 'Infer' ou 'Strict'.
it: 'Option' deve essere seguito da 'Compare', 'Explicit', 'Infer' o 'Strict'.
ja: 'Option' の後には、'Compare'、'Explicit'、'Infer'、または 'Strict' を指定しなければなりません。
ko: 'Option' 뒤에는 'Compare', 'Explicit', 'Infer' 또는 'Strict'가 와야 합니다.
pl: 'Po instrukcji „Option” musi znajdować się element „Compare”, „Explicit”, „Infer” lub „Strict”.
pt_br: 'Option' deve ser seguido de 'Compare', 'Explicit', 'Infer', ou 'Strict'.
ru: 'После "Option" должно следовать "Compare", "Explicit", "Infer" или "Strict".
tr: 'Option' öğesinin arkasından 'Compare', 'Explicit', 'Infer' veya 'Strict' gelmelidir.
zh_hans: '“Option”的后面必须跟有“Compare”、“Explicit”、“Infer”或“Strict”。
zh_hant: 'Option' 必須在 'Compare'、'Explicit'、'Infer' 或 'Strict' 之前。

# ERR_InvalidOptionCompare
source: 'Option Compare' must be followed by 'Text' or 'Binary'.
cs: 'Za klíčovým slovem Option Compare musí následovat klíčové slovo Text nebo Binary.
de: 'Auf "Option Compare" muss "Text" oder "Binary" folgen.
es: 'Option Compare' debe ir seguida de 'Text' o 'Binary'.
fr: 'Option Compare' doit être suivi de 'Text' ou 'Binary'.
it: 'Option Compare' deve essere seguito da 'Text' o 'Binary'.
ja: 'Option Compare' の後には、'Text' または 'Binary' を指定しなければなりません。
ko: 'Option Compare' 뒤에는 'Text' 또는 'Binary'가 와야 합니다.
pl: 'Po instrukcji Option Compare musi wystąpić element Text lub Binary.
pt_br: 'Option Compare' deve ser seguido por 'Text' ou 'Binary'.
ru: 'За оператором "Option Compare" должны следовать "Text" или "Binary".
tr: 'Option Compare' öğesinin ardından 'Text' veya 'Binary' gelmesi gerekir.
zh_hans: '"Option Compare" 的后面必须跟有 "Text" 或 "Binary"。
zh_hant: 'Option Compare' 必須在 'Text' 或 'Binary' 之前。

# ERR_ExpectedOptionCompare
source: 'Compare' expected.
cs: 'Očekávalo se klíčové slovo Compare.
de: '"Compare" erwartet.
es: 'Se esperaba 'Compare'.
fr: 'Compare' attendu.
it: 'È previsto 'Compare'.
ja: 'Compare' が必要です。
ko: 'Compare'가 필요합니다.
pl: 'Oczekiwano instrukcji „Compare”.
pt_br: 'Compare' esperado.
ru: 'Требуется Compare.
tr: 'Compare' bekleniyor.
zh_hans: '应为 "Compare"。
zh_hant: '必須有 'Compare'。

# ERR_StrictDisallowImplicitObject
source: Option Strict On requires all variable declarations to have an 'As' clause.
cs: Direktiva Option Strict On vyžaduje, aby deklarace všech proměnných obsahovaly klauzuli As.
de: "Option Strict On" erfordert, dass alle Variablendeklarationen eine As-Klausel enthalten.
es: Option Strict On requiere que todas las declaraciones de variables tengan una cláusula 'As'.
fr: Toutes les déclarations de variable de Option Strict On requièrent une clause 'As'.
it: Option Strict On richiede che tutte le dichiarazioni di variabili abbiano una clausola 'As'.
ja: Option Strict On では、すべての変数宣言に 'As' 句が必要です。
ko: Option Strict On에서는 모든 변수 선언에 'As' 절을 사용해야 합니다.
pl: Ustawienie Option Strict On wymaga, aby wszystkie deklaracje zmiennych miały klauzulę „As”.
pt_br: Option Strict On necessita que todas as declarações de variáveis tenham uma cláusula 'As'.
ru: При использовании параметра "Strict On" все объявления переменных должны иметь предложение "As".
tr: Option Strict On, tüm değişken bildirimlerinde 'As' yan tümcesi bulunmasını gerektirir.
zh_hans: Option Strict On 要求所有变量声明都有 "As" 子句。
zh_hant: Option Strict 為 On 時，對於所有變數宣告，都要求要有 'As' 子句。

# ERR_StrictDisallowsImplicitProc
source: Option Strict On requires all Function, Property, and Operator declarations to have an 'As' clause.
cs: Direktiva Option Strict On vyžaduje, aby deklarace všech funkcí, vlastností a operátorů obsahovaly klauzuli As.
de: "Option Strict On" erfordert, dass alle Funktions-, Eigenschafts- und Operatordeklarationen eine As-Klausel enthalten.
es: Option Strict On requiere que todas las declaraciones Function, Property y Operator tengan una cláusula 'As'.
fr: Toutes les déclarations Function, Property et Operator de Option Strict On requièrent une clause 'As'.
it: Option Strict On richiede che tutte le dichiarazioni di funzioni, di proprietà e di operatori abbiano una clausola 'As'.
ja: Option Strict On では、すべての関数、プロパティ、および演算子宣言に 'As' 句が必要です。
ko: Option Strict On에서는 모든 함수, 속성 및 연산자 선언에 'As' 절을 사용해야 합니다.
pl: Ustawienie Option Strict On wymaga, aby wszystkie deklaracje funkcji, właściwości i operatorów miały klauzulę „As”.
pt_br: Option Strict On necessita que todas as declarações de Function, Property, e Operator tenham uma cláusula 'As'.
ru: При использовании параметра "Strict On" объявления функций, свойств и операторов должны иметь предложение "As".
tr: Option Strict On, tüm Function, Property ve Operator bildirimlerinde 'As' yan tümcesi bulunmasını gerektirir.
zh_hans: Option Strict On 要求所有函数、属性和运算符声明都有 "As" 子句。
zh_hant: Option Strict 為 On 時，對所有函式、屬性及運算子宣告，都要求要有 'As' 子句。

# ERR_StrictDisallowsImplicitArgs
source: Option Strict On requires that all method parameters have an 'As' clause.
cs: Možnost Strict On vyžaduje použití klauzule As u všech parametrů metody.
de: "Option Strict On" erfordert, dass alle Methodenparameter eine As-Klausel enthalten.
es: Option Strict On requiere que todos los parámetros del método tengan una cláusula 'As'.
fr: Tous les paramètres de méthode de Option Strict On requièrent une clause 'As'.
it: Option Strict On richiede che tutti i parametri dei metodi abbiano una clausola 'As'.
ja: Option Strict On では、すべてのメソッド パラメーターに 'As' 句が必要です。
ko: Option Strict On에서는 모든 메서드 매개 변수에 'As' 절을 사용해야 합니다.
pl: Ustawienie Option Strict On wymaga, aby wszystkie parametry metody miały klauzulę „As”.
pt_br: Option Strict On requer que todos os parâmetros de método tenham uma cláusula 'As'.
ru: Оператор "Option Strict On" требует, чтобы все параметры метода имели предложение "As".
tr: Option Strict On, tüm yöntem parametrelerinde 'As' yan tümcesi bulunmasını gerektirir.
zh_hans: Option Strict On 要求所有方法参数都有 "As" 子句。
zh_hant: Option Strict 為 On 時，對所有方法參數，都要求要有 'As' 子句。

# ERR_InvalidParameterSyntax
source: Comma or ')' expected.
cs: Očekávala se čárka nebo znak ).
de: Komma oder ")" erwartet.
es: Se esperaba una coma o ')'.
fr: Virgule ou ')' attendue.
it: È prevista la virgola o il segno ')'.
ja: コンマまたは ')' が必要です。
ko: 쉼표 또는 ')'가 필요합니다.
pl: Oczekiwano przecinka lub znaku ).
pt_br: Vírgula ou ")" esperado.
ru: Требуется запятая или ")".
tr: Virgül veya ')' bekleniyor.
zh_hans: 应为逗号或 ")"。
zh_hant: 必須是逗號或 ')'。

# ERR_ExpectedSubFunction
source: 'Sub' or 'Function' expected.
cs: 'Očekávalo se klíčové slovo Sub nebo Function.
de: '"Sub" oder "Function" erwartet.
es: 'Se esperaba 'Sub' o 'Function'.
fr: 'Sub' ou 'Function' attendu.
it: 'È previsto 'Sub' o 'Function'.
ja: 'Sub' または 'Function' が必要です。
ko: 'Sub' 또는 'Function'이 필요합니다.
pl: 'Oczekiwano instrukcji Sub lub Function.
pt_br: 'Sub' ou 'Function' esperado.
ru: 'Требуется "Sub" или "Function".
tr: 'Sub' veya 'Function' bekleniyor.
zh_hans: '应为“Sub”或“Function”。
zh_hant: '必須有 'Sub' 或 'Function'。

# ERR_ExpectedStringLiteral
source: String constant expected.
cs: Očekávala se řetězcová konstanta.
de: Zeichenfolgenkonstante erwartet.
es: Se esperaba una constante de cadena.
fr: Constante de chaîne attendue.
it: È prevista una costante di stringa.
ja: 文字列定数を指定してください。
ko: 문자열 상수가 필요합니다.
pl: Oczekiwano stałej w postaci ciągu.
pt_br: Constante de cadeia de caracteres esperada.
ru: Ожидалась строковая константа.
tr: Dize sabiti bekleniyor.
zh_hans: 应为字符串常量。
zh_hant: 必須有字串常數。

# ERR_MissingLibInDeclare
source: 'Lib' expected.
cs: 'Očekávalo se klíčové slovo Lib.
de: '"Lib" erwartet.
es: 'Se esperaba 'Lib'.
fr: 'Lib' attendu.
it: 'È previsto 'Lib'.
ja: 'Lib' が必要です。
ko: 'Lib'가 필요합니다.
pl: 'Oczekiwano instrukcji Lib.
pt_br: 'Lib' esperado.
ru: 'Требуется "Lib".
tr: 'Lib' bekleniyor.
zh_hans: '应为 "Lib"。
zh_hant: '必須有 'Lib'。

# ERR_DelegateNoInvoke1
source: Delegate class '{0}' has no Invoke method, so an expression of this type cannot be the target of a method call.
cs: Třída delegáta {0} neobsahuje metodu Invoke, a proto výraz tohoto typu nemůže být cílem volání metody.
de: Die Delegatklasse "{0}" hat keine Invoke-Methode. Ein Ausdruck dieses Typs kann daher nicht das Ziel eines Methodenaufrufs sein.
es: La clase delegada '{0}' no tiene ningún método Invoke y, por tanto, una expresión de este tipo no puede ser el destino de una llamada a método.
fr: La classe déléguée '{0}' n'a pas de méthode Invoke, c'est pourquoi une expression de ce type ne peut pas être la cible d'un appel de méthode.
it: La classe delegata '{0}' non contiene un metodo Invoke. Un'espressione di questo tipo non può essere la destinazione di una chiamata a un metodo.
ja: Delegate クラス '{0}' には Invoke メソッドが含まれていないため、この型の式をメソッド呼び出しのターゲットに設定することはできません。
ko: '{0}' 대리자 클래스에는 Invoke 메서드가 없으므로 이러한 형식의 식은 메서드 호출의 대상일 수 없습니다.
pl: Klasa delegatu „{0}” nie ma metody Invoke, dlatego wyrażenie tego typu nie może być elementem docelowym wywołania metody.
pt_br: Classe delegate "{0}" não tem método Invoke, portanto, uma expressão desse tipo não pode ser o destino de uma chamada de método.
ru: Класс делегата "{0}" не содержит метода Invoke, поэтому выражение этого типа не может быть результатом вызова метода.
tr: '{0}' temsilci sınıfında Invoke yöntemi yok, bu nedenle bu türdeki bir ifade bir yöntem çağrısının hedefi olamaz.
zh_hans: 委托类“{0}”没有 Invoke 方法，所以此类型的表达式不能作为方法调用的目标。
zh_hant: 委派類別 '{0}' 沒有 Invoke 方法，因此這個類型的運算式不可成為方法呼叫的目標。

# ERR_MissingIsInTypeOf
source: 'Is' expected.
cs: 'Očekávalo se klíčové slovo Is.
de: '"Is" erwartet.
es: 'Se esperaba 'Is'.
fr: 'Is' attendu.
it: 'È previsto 'Is'.
ja: 'Is' が必要です。
ko: 'Is'가 필요합니다.
pl: 'Oczekiwano instrukcji „Is”.
pt_br: 'Is' esperado.
ru: 'Требуется "Is".
tr: 'Is' bekleniyor.
zh_hans: '应为 "Is"。
zh_hant: '必須是 'Is'。

# ERR_DuplicateOption1
source: 'Option {0}' statement can only appear once per file.
cs: 'Příkaz Option {0} se dá v každém souboru použít jenom jednou.
de: 'Pro Datei ist nur eine "Option {0}"-Anweisung zugelassen.
es: 'La instrucción 'Option {0}' solo puede aparecer una vez en cada archivo.
fr: 'Une instruction 'Option {0}' ne peut apparaître qu'une seule fois par fichier.
it: 'L'istruzione 'Option {0}' può essere specificata solo una volta per file.
ja: 'Option {0}' ステートメントは、1 つのファイルに付き 1 回のみ使用できます。
ko: '파일당 'Option {0}' 문을 한 번만 사용할 수 있습니다.
pl: 'Instrukcja „Option {0}” może wystąpić w pliku tylko raz.
pt_br: 'A instrução "Opção {0}" pode somente aparecer uma vez por arquivo.
ru: 'Оператор "Option {0}" можно использовать в файле только один раз.
tr: 'Option {0}' deyimi dosyada tek bir kez bulunabilir.
zh_hans: '每个文件中只能出现一次“Option {0}”语句。
zh_hant: '每個檔案只能出現一次 'Option {0}' 陳述式。

# ERR_ModuleCantInherit
source: 'Inherits' not valid in Modules.
cs: 'Klíčové slovo Inherits není platné v modulech.
de: '"Inherits" ist in Modulen nicht gültig.
es: 'Inherits' no es válido en módulos.
fr: 'Inherits' n'est pas valide dans les modules.
it: 'Inherits' non è valido nei moduli.
ja: 'Inherits' は、モジュールでは有効ではありません。
ko: '모듈에는 'Inherits'를 사용할 수 없습니다.
pl: 'Instrukcja Inherits nie jest prawidłowa w modułach.
pt_br: 'Inherits' não é válido em Módulos.
ru: 'Оператор "Inherits" недопустим в модулях.
tr: 'Inherits' Modüllerde geçerli değildir.
zh_hans: '"Inherits" 在模块中无效。
zh_hant: 'Inherits' 在模組中無效。

# ERR_ModuleCantImplement
source: 'Implements' not valid in Modules.
cs: 'Klíčové slovo Implements není platné v modulech.
de: '"Implements" ist in Modulen nicht gültig.
es: 'Implements' no es válido en módulos.
fr: 'Implements' n'est pas valide dans les modules.
it: 'Implements' non è valido nei moduli.
ja: 'Implements' は、モジュールでは有効ではありません。
ko: '모듈에는 'Implements'를 사용할 수 없습니다.
pl: 'Instrukcja Implements nie jest prawidłowa w modułach.
pt_br: 'Implements' não é válido em Módulos.
ru: 'Оператор "Implements" недопустим в модулях.
tr: 'Implements' Modüllerde geçerli değildir.
zh_hans: '"Implements" 在模块中无效。
zh_hant: 'Implements' 在模組中無效。

# ERR_BadImplementsType
source: Implemented type must be an interface.
cs: Implementovaným typem musí být rozhraní.
de: Der implementierte Typ muss eine Schnittstelle sein.
es: El tipo implementado debe ser una interfaz.
fr: Le type implémenté doit être une interface.
it: Il tipo implementato deve essere un'interfaccia.
ja: 実装される型は、インターフェイスでなければなりません。
ko: 구현 형식은 인터페이스여야 합니다.
pl: Implementowany typ musi być interfejsem.
pt_br: Tipo implementado deve ser uma interface.
ru: Реализованный тип должен представлять интерфейс.
tr: Uygulanan tür bir arabirim olmalı.
zh_hans: 已实现的类型必须是接口。
zh_hant: 實作類型必須是介面。
