Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NoNonObsoleteConstructorOnBase3
source: Class '{0}' should declare a 'Sub New' because the '{1}' in its base class '{2}' is marked obsolete.
cs: Třída {0} by měla deklarovat Sub New, protože {1} v její základní třídě {2} je označená jako zastaralá.
de: Die {0}-Klasse sollte "Sub New" deklarieren, da "{1}" in der entsprechenden {2}-Basisklasse als veraltet markiert ist.
es: La clase '{0}' debe declarar 'Sub New' porque el '{1}' de su clase base '{2}' está marcado como obsoleto.
fr: La classe '{0}' doit déclarer un 'Sub New', car le '{1}' dans sa classe de base '{2}' est marqué comme obsolète.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché '{1}' nella classe di base '{2}' è contrassegnato come obsoleto.
ja: 基本クラス '{2}' の '{1}' が古い形式に設定されているため、クラス '{0}' は 'Sub New' を宣言しなければなりません。
ko: '{0}' 클래스는 기본 클래스 '{2}'의 '{1}'이(가) obsolete로 표시되어 있으므로 'Sub New'를 선언해야 합니다.
pl: Klasa „{0}” powinna deklarować element „Sub New”, ponieważ element „{1}” w swojej klasie bazowej „{2}” jest oznaczony jako przestarzały.
pt_br: Classe "{0}" deve declarar um "Sub New" porque o "{1}" na sua classe base "{2}" está marcado como obsoleto.
ru: Класс "{0}" должен объявить "Sub New", так как "{1}" в базовом классе "{2}" помечен как устаревший.
tr: Kendi '{2}' temel sınıfındaki '{1}' artık kullanılmıyor olarak işaretlendiğinden, '{0}' sınıfı 'Sub New' bildirmelidir.
zh_hans: 类“{0}”应该声明一个“Sub New”，因为其基类“{2}”中的“{1}”被标记为已过时。
zh_hant: 類別 '{0}' 應宣告 'Sub New'，因為其基底類別 '{2}' 中的 '{1}' 已標記為過時。

# WRN_NoNonObsoleteConstructorOnBase3_Title
source: Class should declare a 'Sub New' because the constructor in its base class is marked obsolete
cs: Třída by měla deklarovat Sub New, protože konstruktor v její základní třídě je označený jako zastaralý.
de: Die Klasse muss "Sub New" deklarieren, da der Konstruktor in ihrer Basisklasse als veraltet markiert ist.
es: La clase debe declarar un 'Sub New' porque el constructor de su clase base está marcado como obsoleto
fr: La classe doit déclarer un 'Sub New', car le constructeur dans sa classe de base est marqué comme obsolète
it: La classe deve dichiarare un 'Sub New' perché il costruttore nella relativa classe di base è contrassegnato come obsoleto
ja: 基底クラスのコンストラクターが古い形式としてマークされているため、クラスは 'Sub New' を宣言しなければなりません
ko: 기본 클래스의 생성자가 obsolete로 표시되어 있으므로 클래스에서 'Sub New'를 선언해야 함
pl: Należy zadeklarować element „Sub New” w klasie, ponieważ konstruktor w klasie bazowej został oznaczony jako przestarzały
pt_br: A classe deve declarar um 'Sub New' porque o construtor em sua classe base está marcado como obsoleto
ru: Класс должен объявлять Sub New, так как конструктор в базовом классе отмечен как устаревший
tr: Temel sınıfındaki oluşturucu artık kullanılmıyor olarak işaretlendiğinden sınıf bir 'Sub New' bildirmelidir
zh_hans: 类应声明 "Sub New"，原因是它的基类中的构造函数被标记为已过时
zh_hant: 類別應該宣告 'Sub New'，因為其基底類別中的建構函式已標記為過時

# WRN_NoNonObsoleteConstructorOnBase4
source: Class '{0}' should declare a 'Sub New' because the '{1}' in its base class '{2}' is marked obsolete: '{3}'.
cs: Třída {0} by měla deklarovat Sub New, protože {1} v její základní třídě {2} je označená jako zastaralá: {3}.
de: Die {0}-Klasse muss "Sub New" deklarieren, da "{1}" in der entsprechenden {2}-Basisklasse als veraltet markiert ist: "{3}".
es: La clase '{0}' debe declarar 'Sub New' porque el '{1}' de su clase base '{2}' está marcado como obsoleto: '{3}'.
fr: La classe '{0}' doit déclarer un 'Sub New', car le '{1}' dans sa classe de base '{2}' est marqué comme obsolète : '{3}'.
it: La classe '{0}' deve dichiarare un elemento 'Sub New' perché '{1}' nella classe di base '{2}' è contrassegnato come obsoleto: '{3}'.
ja: 基本クラス '{2}' の '{1}' が古い形式に設定されているため、クラス '{0}' は 'Sub New' を宣言しなければなりません: '{3}'。
ko: '{0}' 클래스는 기본 클래스 '{2}'의 '{1}'이(가) obsolete로 표시되어 있으므로 'Sub New'를 선언해야 합니다('{3}').
pl: Klasa „{0}” powinna deklarować element „Sub New”, ponieważ element „{1}” w swojej klasie bazowej „{2}” jest oznaczony jako przestarzały: „{3}”.
pt_br: Classe "{0}" deve declarar um "Sub New" porque o "{1}" na sua classe base "{2}" está marcado como obsoleto: "{3}".
ru: Класс "{0}" должен объявить "Sub New", так как "{1}" в базовом классе "{2}" помечен как устаревший: "{3}".
tr: Kendi '{2}' temel sınıfındaki '{1}' artık kullanılmıyor olarak işaretlendiğinden, '{0}' sınıfı 'Sub New' bildirmelidir: '{3}'.
zh_hans: 类“{0}”应该声明一个“Sub New”，因为其基类“{2}”中的“{1}”被标记为已过时:“{3}”。
zh_hant: 類別 '{0}' 應宣告 'Sub New'，因為其基底類別 '{2}' 中的 '{1}' 已標記為過時: '{3}'。

# WRN_NoNonObsoleteConstructorOnBase4_Title
source: Class should declare a 'Sub New' because the constructor in its base class is marked obsolete
cs: Třída by měla deklarovat Sub New, protože konstruktor v její základní třídě je označený jako zastaralý.
de: Die Klasse muss "Sub New" deklarieren, da der Konstruktor in ihrer Basisklasse als veraltet markiert ist.
es: La clase debe declarar un 'Sub New' porque el constructor de su clase base está marcado como obsoleto
fr: La classe doit déclarer un 'Sub New', car le constructeur dans sa classe de base est marqué comme obsolète
it: La classe deve dichiarare un 'Sub New' perché il costruttore nella relativa classe di base è contrassegnato come obsoleto
ja: 基底クラスのコンストラクターが古い形式としてマークされているため、クラスは 'Sub New' を宣言しなければなりません
ko: 기본 클래스의 생성자가 obsolete로 표시되어 있으므로 클래스에서 'Sub New'를 선언해야 함
pl: Należy zadeklarować element „Sub New” w klasie, ponieważ konstruktor w klasie bazowej został oznaczony jako przestarzały
pt_br: A classe deve declarar um 'Sub New' porque o construtor em sua classe base está marcado como obsoleto
ru: Класс должен объявлять Sub New, так как конструктор в базовом классе отмечен как устаревший
tr: Temel sınıfındaki oluşturucu artık kullanılmıyor olarak işaretlendiğinden sınıf bir 'Sub New' bildirmelidir
zh_hans: 类应声明 "Sub New"，原因是它的基类中的构造函数被标记为已过时
zh_hant: 類別應該宣告 'Sub New'，因為其基底類別中的建構函式已標記為過時

# WRN_RequiredNonObsoleteNewCall3
source: First statement of this 'Sub New' should be an explicit call to 'MyBase.New' or 'MyClass.New' because the '{0}' in the base class '{1}' of '{2}' is marked obsolete.
cs: Prvním příkazem této procedury Sub New by mělo být explicitní volání konstruktoru MyBase.New nebo MyClass.New, protože {0} základní třídy {1} pro {2} je označená jako zastaralá.
de: Die erste Anweisung dieser "Sub New" muss ein expliziter Aufruf an "MyBase.New" oder "MyClass.New" sein, da "{0}" in der Basisklasse "{1}" von "{2}" als veraltet markiert ist.
es: La primera instrucción de este 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque el '{0}' de la clase base '{1}' de '{2}' está marcado como obsoleto.
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le '{0}' dans la classe de base '{1}' de '{2}' est marquée comme obsolète.
it: La prima istruzione di questo elemento 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché '{0}' nella classe di base '{1}' di '{2}' è contrassegnato come obsoleto.
ja: '{2}' の基本クラス '{1}' にある '{0}' が古い形式に設定されているため、この 'Sub New' の最初のステートメントは、明示的な 'MyBase.New' または 'MyClass.New' への呼び出しでなければなりません。
ko: '{2}'의 기본 클래스 '{1}'에 있는 '{0}'이(가) 사용되지 않는 상태로 표시되어 있으므로, 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 합니다.
pl: Pierwsza instrukcja tego elementu „Sub New” powinna być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ element „{0}” w klasie bazowej „{1}” elementu „{2}” jest oznaczony jako przestarzały.
pt_br: A primeira instrução deste "Sub New" deve ser uma chamada explícita para "MyBase.New" ou "MyClass.New" porque o "{0}" na classe base "{1}" de "{2}" está marcada como obsoleta.
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" в базовом классе "{1}" из "{2}" помечен как устаревший.
tr: '{2}' öğesinin '{1}' temel sınıfında '{0}' artık kullanılmıyor olarak işaretlendiğinden, bu 'Sub New' yönteminin ilk deyimi açık bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır.
zh_hans: 此“Sub New”中的第一条语句应为对“MyBase.New”或“MyClass.New”的显式调用，因为“{2}”的基类“{1}”中的“{0}”被标记为已过时。
zh_hant: 此 'Sub New' 的第一個陳述式，必須是對 'MyBase.New' 或 'MyClass.New' 的明確呼叫，因為 '{2}' 的基底類別 '{1}' 中之 '{0}' 已標記為過時。

# WRN_RequiredNonObsoleteNewCall3_Title
source: First statement of this 'Sub New' should be an explicit call to 'MyBase.New' or 'MyClass.New' because the constructor in the base class is marked obsolete
cs: Prvním příkazem pro Sub New by mělo být explicitní volání metody MyBase.New nebo MyClass.New, protože konstruktor v základní třídě je označený jako zastaralý.
de: Die erste Anweisung dieses "Sub New" muss ein expliziter Aufruf von "MyBase.New" oder "MyClass.New" sein, da der Konstruktor in der Basisklasse als veraltet markiert ist.
es: La primera instrucción de este 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque el constructor de la clase base está marcado como obsoleto
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le constructeur de la classe de base est marqué comme obsolète
it: La prima istruzione di questo 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché il costruttore nella classe di base è contrassegnato come obsoleto
ja: 基底クラスにあるコンストラクターが古い形式としてマークされているため、この 'Sub New' の最初のステートメントは、'MyBase.New' または 'MyClass.New' への明示的な呼び出しでなければなりません
ko: 기본 클래스의 생성자가 obsolete로 표시되어 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 함
pl: Pierwsza instrukcja tego elementu „Sub New” powinna być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ konstruktor w klasie bazowej został oznaczony jako przestarzały
pt_br: A primeira instrução deste 'Sub New' deve ser uma chamada explícita para 'MyBase.New' ou 'MyClass.New' porque o construtor de classe base está marcado como obsoleto
ru: Первый оператор Sub New должен быть явным вызовом в MyBase.New или MyClass.New, так как конструктор в базовом классе отмечен как устаревший
tr: Temel sınıftaki oluşturucu kullanılmıyor olarak işaretlendiğinden bu 'Sub New' metodunun ilk deyimi 'MyBase.New' veya 'MyClass.New' için açık çağrı olmalıdır
zh_hans: 此 "Sub New" 的第一条语句必须是对 "MyBase.New" 或 "MyClass.New" 的显式调用，原因是基类中的构造函数被标为已过时
zh_hant: 這個 'Sub New' 的第一個陳述式應明確呼叫 'MyBase.New' 或 'MyClass.New'，因為基底類別中的建構函式已標記為過時

# WRN_RequiredNonObsoleteNewCall4
source: First statement of this 'Sub New' should be an explicit call to 'MyBase.New' or 'MyClass.New' because the '{0}' in the base class '{1}' of '{2}' is marked obsolete: '{3}'
cs: Prvním příkazem této procedury Sub New by mělo být explicitní volání konstruktoru MyBase.New nebo MyClass.New, protože {0} základní třídy {1} pro {2} je označená jako zastaralá: {3}.
de: Die erste Anweisung dieser "Sub New" muss ein expliziter Aufruf an "MyBase.New" oder "MyClass.New" sein, da "{0}" in der Basisklasse "{1}" von "{2}" als veraltet markiert ist: "{3}"
es: La primera instrucción de este 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque el '{0}' de la clase base '{1}' de '{2}' está marcado como obsoleto: '{3}'
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le '{0}' dans la classe de base '{1}' de '{2}' est marquée comme obsolète : '{3}'.
it: La prima istruzione di questo elemento 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché '{0}' nella classe di base '{1}' di '{2}' è contrassegnato come obsoleto: '{3}'
ja: '{2}' の基本クラス '{1}' にある '{0}' が古い形式に設定されているため、この 'Sub New' の最初のステートメントは、明示的な 'MyBase.New' または 'MyClass.New' への呼び出しでなければなりません: '{3}'
ko: '{2}'의 기본 클래스 '{1}'에 있는 '{0}'이(가) obsolete로 표시되어 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 합니다('{3}').
pl: Pierwsza instrukcja tego elementu „Sub New” powinna być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ element „{0}” w klasie bazowej „{1}” elementu „{2}” jest oznaczony jako przestarzały: „{3}”.
pt_br: A primeira instrução deste "Sub New" deve ser uma chamada explícita para "MyBase.New" ou "MyClass.New" porque o "{0}" na classe base "{1}" de "{2}" está marcada como obsoleta. "{3}"
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" в базовом классе "{1}" из "{2}" помечен как устаревший: "{3}"
tr: '{2}' öğesinin '{1}' temel sınıfında '{0}' artık kullanılmıyor olarak işaretlendiğinden, bu 'Sub New' yönteminin ilk deyimi açık bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır: '{3}'
zh_hans: 此“Sub New”中的第一条语句应为对“MyBase.New”或“MyClass.New”的显式调用，因为“{2}”的基类“{1}”中的“{0}”被标记为已过时:“{3}”
zh_hant: 此 'Sub New' 的第一個陳述式，必須是對 'MyBase.New' 或 'MyClass.New' 的明確呼叫，因為 '{2}' 的基底類別 '{1}' 中之 '{0}' 已標記為過時: '{3}'

# WRN_RequiredNonObsoleteNewCall4_Title
source: First statement of this 'Sub New' should be an explicit call to 'MyBase.New' or 'MyClass.New' because the constructor in the base class is marked obsolete
cs: Prvním příkazem pro Sub New by mělo být explicitní volání metody MyBase.New nebo MyClass.New, protože konstruktor v základní třídě je označený jako zastaralý.
de: Die erste Anweisung dieses "Sub New" muss ein expliziter Aufruf von "MyBase.New" oder "MyClass.New" sein, da der Konstruktor in der Basisklasse als veraltet markiert ist.
es: La primera instrucción de este 'Sub New' debe ser una llamada explícita a 'MyBase.New' o 'MyClass.New' porque el constructor de la clase base está marcado como obsoleto
fr: La première instruction de ce 'Sub New' doit être un appel explicite à 'MyBase.New' ou 'MyClass.New', car le constructeur de la classe de base est marqué comme obsolète
it: La prima istruzione di questo 'Sub New' deve essere una chiamata esplicita a 'MyBase.New' o a 'MyClass.New' perché il costruttore nella classe di base è contrassegnato come obsoleto
ja: 基底クラスにあるコンストラクターが古い形式としてマークされているため、この 'Sub New' の最初のステートメントは、'MyBase.New' または 'MyClass.New' への明示的な呼び出しでなければなりません
ko: 기본 클래스의 생성자가 obsolete로 표시되어 있으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 명시적 호출이어야 함
pl: Pierwsza instrukcja tego elementu „Sub New” powinna być jawnym wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ konstruktor w klasie bazowej został oznaczony jako przestarzały
pt_br: A primeira instrução deste 'Sub New' deve ser uma chamada explícita para 'MyBase.New' ou 'MyClass.New' porque o construtor de classe base está marcado como obsoleto
ru: Первый оператор Sub New должен быть явным вызовом в MyBase.New или MyClass.New, так как конструктор в базовом классе отмечен как устаревший
tr: Temel sınıftaki oluşturucu kullanılmıyor olarak işaretlendiğinden bu 'Sub New' metodunun ilk deyimi 'MyBase.New' veya 'MyClass.New' için açık çağrı olmalıdır
zh_hans: 此 "Sub New" 的第一条语句必须是对 "MyBase.New" 或 "MyClass.New" 的显式调用，原因是基类中的构造函数被标为已过时
zh_hant: 這個 'Sub New' 的第一個陳述式應明確呼叫 'MyBase.New' 或 'MyClass.New'，因為基底類別中的建構函式已標記為過時

# WRN_MissingAsClauseinOperator
source: Operator without an 'As' clause; type of Object assumed.
cs: Operátor bez klauzule As; předpokládá se typ Object.
de: Operator ohne As-Klausel; Typ "Object" wird angenommen.
es: Operador sin una cláusula 'As'; se supone el tipo de Object.
fr: Opérateur sans clause 'As' ; type Object pris par défaut.
it: Operatore senza clausola 'As'. Verrà usato il tipo Object.
ja: As' 句のない演算子です。Object 型と見なされます。
ko: 연산자에 'As' 절이 없습니다. Object 형식으로 간주합니다.
pl: Operator bez klauzuli As; przyjęto typ Object.
pt_br: Operador sem uma cláusula 'As'; tipo Object presumido.
ru: Оператор без предложения "As"; предполагаемый тип — Object.
tr: İşleçte 'As' yan tümcesi yok; Object türü varsayıldı.
zh_hans: 运算符没有 "As" 子句；假定为 Object 类型。
zh_hant: 沒有 'As' 子句的運算子; 假設是 Object 的類型。

# WRN_MissingAsClauseinOperator_Title
source: Operator without an 'As' clause
cs: Operátor bez klauzule As
de: Operator ohne "As"-Klausel
es: Operador sin cláusula 'As'
fr: Opérateur sans clause 'As'
it: Operatore senza una clausola 'As'
ja: As' 句のない演算子です
ko: As' 절이 없는 연산자
pl: Operator bez klauzuli „As”
pt_br: Operador sem uma cláusula 'As'
ru: Оператор без предложения As
tr: İşleçte 'As' yan tümcesi yok
zh_hans: 运算符没有 "As" 子句
zh_hant: 運算子沒有 'As' 子句

# WRN_ConstraintsFailedForInferredArgs2
source: Type arguments inferred for method '{0}' result in the following warnings :{1}
cs: Výsledkem odvozených argumentů typu pro metodu {0} jsou následující upozornění: {1}
de: Die Typargumente, die per Rückschluss für die {0}-Methode abgeleitet wurden, verursachen die folgenden Warnungen: {1}
es: Los argumentos de tipo inferidos para el método '{0}' generan las siguientes advertencias :{1}
fr: Les arguments de type déduits pour la méthode '{0}' donnent les avertissements suivants : {1}
it: Con gli argomenti di tipo dedotti per il metodo '{0}' vengono restituiti i seguenti avvisi: {1}
ja: メソッド '{0}' に対して推論された型引数は次の警告になります: {1}
ko: '{0}' 메서드에 대해 유추된 형식 인수가 다음 경고를 표시했습니다({1})
pl: Argumenty typu wywnioskowane dla metody „{0}” powodują wystąpienie następujących ostrzeżeń: {1}.
pt_br: Argumentos de tipo inferidos para método "{0}" resultam nos seguintes avisos :{1}
ru: Тип аргументов, выведенных для метода "{0}", выдает следующие предупреждения: {1}
tr: '{0}' yöntemi için çıkarsanan tür bağımsız değişkenleri şu uyarıyı veriyor:{1}
zh_hans: 为方法“{0}”推断的类型参数导致以下警告:{1}
zh_hant: 方法 '{0}' 的推斷類型引數，導致下列錯誤 :{1}

# WRN_ConstraintsFailedForInferredArgs2_Title
source: Type arguments inferred for method result in warnings
cs: Argumenty typu odvozené pro metodu mají za následek upozornění.
de: Für die Methode abgeleitete Typargumente führen zu Warnungen.
es: Los argumentos de tipo inferidos para el método dan advertencias como resultado
fr: Les arguments de type déduits pour la méthode entraînent des avertissements
it: Con gli argomenti di tipo dedotti per il metodo vengono restituiti avvisi
ja: メソッドに対して推論された型引数には、警告が表示されます
ko: 메서드에 대해 유추된 형식 인수로 인해 경고 발생
pl: Argumenty typu wywnioskowane dla metody powodują ostrzeżenia
pt_br: Argumentos de tipo inferidos para o método resultam em avisos
ru: Аргументы типов, определяемые для результата метода в предупреждениях
tr: Metot için çıkarsanan tür bağımsız değişkenleri uyarılarla sonuçlandı
zh_hans: 为方法推断的类型参数导致警告
zh_hant: 為方法推斷的類型引數引發了警告

# WRN_ConditionalNotValidOnFunction
source: Attribute 'Conditional' is only valid on 'Sub' declarations.
cs: Atribut Conditional je platný jenom v deklaracích Sub.
de: Das Conditional-Attribut ist nur in Sub-Deklarationen gültig.
es: El atributo 'Conditional' solo es válido en declaraciones 'Sub'.
fr: L'attribut 'Conditional' est valide uniquement dans les déclarations 'Sub'.
it: L'attributo 'Conditional' è valido solo nelle dichiarazioni 'Sub'.
ja: 属性 'Conditional' は 'Sub' 宣言でのみ有効です。
ko: Conditional' 특성은 'Sub' 선언에서만 사용할 수 있습니다.
pl: Atrybut „Conditional” jest prawidłowy tylko w deklaracjach „Sub”.
pt_br: O atributo 'Conditional' só é válido em declarações 'Sub'.
ru: Атрибут "Conditional" допустим только в объявлениях "Sub".
tr: Conditional' özniteliği yalnızca 'Sub' bildirimlerinde geçerlidir.
zh_hans: 特性 "Conditional" 只在 "Sub" 声明中有效。
zh_hant: 屬性 'Conditional' 只在 'Sub' 宣告中有效。

# WRN_ConditionalNotValidOnFunction_Title
source: Attribute 'Conditional' is only valid on 'Sub' declarations
cs: Atribut Conditional je platný jenom v deklaracích Sub.
de: Das Conditional-Attribut ist nur in Sub-Deklarationen gültig.
es: El atributo 'Conditional' solo es válido en declaraciones 'Sub'
fr: L'attribut 'Conditional' est valide uniquement dans les déclarations 'Sub'
it: L'attributo 'Conditional' è valido solo nelle dichiarazioni 'Sub'
ja: 属性 'Conditional' は 'Sub' 宣言でのみ有効です
ko: Conditional' 특성은 'Sub' 선언에서만 유효함
pl: Atrybut „Conditional” jest prawidłowy tylko w deklaracjach „Sub”
pt_br: O atributo 'Conditional' só é válido em declarações 'Sub'
ru: Атрибут Conditional допустим только в объявлениях Sub
tr: Conditional' özniteliği yalnızca 'Sub' bildirimlerinde geçerlidir
zh_hans: 特性 "Conditional" 只在 "Sub" 声明中有效
zh_hant: 屬性 'Conditional' 只在 'Sub' 宣告中有效

# WRN_RecursiveAddHandlerCall
source: Statement recursively calls the containing '{0}' for event '{1}'.
cs: Příkaz rekurzivně volá nadřazený {0} pro událost {1}.
de: Die Anweisung ruft rekursiv das enthaltende "{0}" für das {1}-Ereignis auf.
es: La instrucción llama recursivamente al elemento contenedor '{0}' para el evento '{1}'.
fr: L'instruction appelle de manière récursive le '{0}' conteneur pour l'événement '{1}'.
it: L'istruzione chiama in modo ricorsivo il metodo '{0}' che la contiene per l'evento '{1}'.
ja: ステートメントはイベント '{1}' の含まれている '{0}' を再帰的に呼び出しています。
ko: 문이 '{1}' 이벤트에 대해 포함하는 '{0}'을(를) 재귀적으로 호출합니다.
pl: Instrukcja cyklicznie wywołuje zawierający ją element „{0}” dla zdarzenia „{1}”.
pt_br: A instrução chama recursivamente a "{0}" recipiente para o evento "{1}".
ru: Выражение рекурсивно вызывает содержащийся "{0}" для события "{1}".
tr: Deyim, '{1}' olayı için kapsayan '{0}' öğesini yinelemeli olarak çağırıyor.
zh_hans: 语句以递归方式调用事件“{1}”的包含“{0}”。
zh_hant: 陳述式遞迴呼叫事件 '{1}' 的包含 '{0}'。

# WRN_RecursiveAddHandlerCall_Title
source: Statement recursively calls the event's containing AddHandler
cs: Příkaz volá rekurzivně nadřazenou obslužnou rutinu AddHandler události.
de: Durch die Anweisung wird der enthaltende AddHandler des Ereignisses rekursiv aufgerufen.
es: La instrucción llama recursivamente al evento que contiene AddHandler
fr: L’instruction appelle de manière récursive l’élément AddHandler contenant l’événement
it: L'istruzione chiama in modo ricorsivo l'elemento AddHandler contenitore dell'evento
ja: ステートメントは、イベントの包含している AddHandler を再帰的に呼び出しています
ko: 이벤트에 대해 포함하는 AddHandler를 문이 재귀적으로 호출함
pl: Instrukcja rekursywnie wywołuje zawierający ją element AddHandler dla zdarzenia
pt_br: A instrução chama recursivamente o AddHandler que contém o evento
ru: Оператор рекурсивно вызывает содержащий его AddHandler события
tr: Deyim, olayın kapsayan AddHandler ifadesini yinelemeli olarak çağırıyor
zh_hans: 语句递归调用事件包含的 AddHandler
zh_hant: 陳述式會遞迴呼叫事件的包含 AddHandler

# WRN_ImplicitConversionCopyBack
source: Implicit conversion from '{1}' to '{2}' in copying the value of 'ByRef' parameter '{0}' back to the matching argument.
cs: Implicitní převod z {1} na {2} při kopírování hodnoty parametru ByRef {0} zpátky na odpovídající argument
de: Implizite Konvertierung von "{1}" in "{2}" beim Zurückkopieren des Werts des ByRef-Parameters "{0}" in das entsprechende Argument.
es: Conversión implícita de '{1}' a '{2}' al volver a copiar el valor del parámetro 'ByRef' '{0}' en el argumento correspondiente.
fr: Conversion implicite de '{1}' en '{2}' lors de la recopie de la valeur du paramètre 'ByRef' '{0}' dans l'argument correspondant.
it: Viene eseguita la conversione implicita da '{1}' a '{2}' quando il valore del parametro 'ByRef' '{0}' viene ricopiato nell'argomento corrispondente.
ja: ByRef' パラメーター '{0}' の値を、一致する引数に戻してコピーする際の、'{1}' から '{2}' への暗黙的な変換です。
ko: ByRef' 매개 변수 '{0}'의 값을 해당 인수에 다시 복사하는 동안 발생하는 '{1}'에서 '{2}'(으)로의 암시적 변환입니다.
pl: Niejawna konwersja z „{1}” na „{2}” podczas kopiowania wartości parametru „ByRef” „{0}” z powrotem do pasującego argumentu.
pt_br: Conversão implícita de "{1}" para "{2}" na cópia do valor do parâmetro "ByRef" "{0}" de volta para o argumento correspondente.
ru: Неявное преобразование "{1}" в "{2}" при копировании значения параметра "ByRef" "{0}" обратно в соответствующий аргумент.
tr: '{0}' 'ByRef' parametresinin değeri eşleşen bağımsız değişkene geri kopyalanırken '{1}' ile '{2}' arasında örtük dönüştürme.
zh_hans: 将“ByRef”形参“{0}”的值复制回匹配实参时，发生从“{1}”到“{2}”的隐式转换。
zh_hant: 在將 'ByRef' 參數的值 '{0}' 複製回相對應的引數時，將 '{1}' 隱含轉換至 '{2}'。
