Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_VarianceConversionFailedIn6
source: Implicit conversion from '{4}' to '{5}'; this conversion may fail because '{0}' is not derived from '{1}', as required for the 'In' generic parameter '{2}' in '{3}'.
cs: Implicitní převod z {4} na {5}; tento převod může selhat, protože {0} není odvozené z {1}, jak se vyžaduje pro obecný parametr In {2} v {3}.
de: Implizite Konvertierung von "{4}" in "{5}". Bei dieser Konvertierung können Fehler auftreten, weil "{0}" nicht von "{1}" abgeleitet ist, wie dies für den generischen In-Parameter "{2}" in "{3}" erforderlich ist.
es: Conversión implícita de '{4}' a '{5}'; esta conversión puede dar error porque '{0}' no se deriva de '{1}', como se requiere para el parámetro genérico 'In' '{2}' en '{3}'.
fr: Conversion implicite de '{4}' en '{5}' ; cette conversion peut échouer car '{0}' ne dérive pas de '{1}', comme cela est requis pour le paramètre générique 'In' '{2}' dans '{3}'.
it: La conversione implicita da '{4}' a '{5}' potrebbe non riuscire perché '{0}' non è derivato da '{1}' come richiesto per il parametro generico 'In' '{2}' in '{3}'.
ja: '{4}' から '{5}' への暗黙の型変換です。'{0}' は、'{3}' の 'In' ジェネリック パラメーター '{2}' に求められるように '{1}' から派生していないため、この変換は失敗する可能性があります。
ko: '{4}'에서 '{5}'(으)로 암시적 변환을 수행합니다. '{3}'에 있는 'In' 제네릭 매개 변수 '{2}'에 필요한 대로 '{0}'이(가) '{1}'에서 파생되지 않았으므로 이 변환 작업을 수행하지 못할 수 있습니다.
pl: Niejawna konwersja z „{4}” na „{5}”; ta konwersja może się nie powieść, ponieważ „{0}” nie dziedziczy od „{1}”, co jest wymagane dla parametru ogólnego „In” „{2}” w „{3}”.
pt_br: Conversão implícita de "{4}" para "{5}"; esta conversão pode falhar porque "{0}" não é derivado de "{1}", conforme necessário para o parâmetro genérico "In" "{2}" em "{3}".
ru: Неявное преобразование "{4}" в "{5}"; возможны ошибки преобразования, так как "{0}" не наследованы из "{1}" в соответствии с требованием универсального параметра "In" "{2}" в "{3}".
tr: '{4}' ile '{5}' arasında örtük dönüşüm; '{3}' içinde '{2}' 'In' genel parametresinin gerektirdiği gibi '{0}' öğesi '{1}' öğesinden türetilmediği için, bu dönüşüm başarısız olabilir.
zh_hans: 从“{4}”到“{5}”的隐式转换；此转换可能失败，因为根据“{3}”中“In”泛型形参“{2}”的需要，“{0}”不是从“{1}”派生的。
zh_hant: 從 '{4}' 隱含轉換成 '{5}'; 此轉換可能會失敗，因為依 '{3}' 中 'In' 泛型參數 '{2}' 之需求，'{0}' 並非衍生自 '{1}'。

# WRN_VarianceConversionFailedIn6_Title
source: Implicit conversion; this conversion may fail because the target type is not derived from the source type, as required for 'In' generic parameter
cs: Implicitní převod; tento převod se možná nepovede, protože cílový typ není odvozený od zdrojového typu, jak to vyžaduje obecný parametr In.
de: Implizite Konvertierung. Bei dieser Konvertierung tritt möglicherweise ein Fehler auf, da der Zieltyp nicht vom Quelltyp abgeleitet wird, wie für den generischen In-Parameter erforderlich.
es: Conversión implícita; es posible que esta conversión dé un error porque el tipo de destino no se deriva del tipo de origen, tal y como se necesita para el parámetro genérico 'In'
fr: Conversion implicite. Il est possible que cette conversion échoue, car le type cible n’est pas dérivé d’un type source, comme le requiert le paramètre générique 'In'
it: Conversione implicita. Questa conversione potrebbe non riuscire perché il tipo di destinazione non è derivato dal tipo di origine, come richiesto dal parametro generico 'In'
ja: 暗黙的な変換です。対象の型は元の型からは派生しないため ('In' ジェネリック パラメーターにはこの派生が必須)、この変換は失敗する可能性があります
ko: 암시적 변환임, 'In' 제네릭 매개 변수에 필요한 것처럼 대상 형식이 소스 형식에서 파생되지 않았으므로 이 변환은 실패할 수 있음
pl: Niejawna konwersja; ta konwersja może się nie powieść, ponieważ typ docelowy nie pochodzi od typu źródłowego, co jest wymagane dla parametru ogólnego „In”
pt_br: Conversão implícita. Esta conversão pode falhar porque o tipo de destino não é derivado do tipo de fonte, conforme necessário para o parâmetro genérico 'In'
ru: Неявное преобразование; может произойти сбой этого преобразования, так как целевой тип не наследуется от типа источника, как это требуется для универсального параметра In
tr: Örtük dönüştürme; hedef türü 'In' genel parametresinin gerektirdiği kaynak türünden türetilmediğinden bu dönüştürme başarısız olabilir
zh_hans: 隐式转换；此转换可能失败，原因是目标类型不是从源类型派生的，而这是 "In" 泛型参数所必需的
zh_hant: 隱含轉換; 這個轉換可能會失敗，因為目標類型並非衍生自來源類型，如此不符合 'In' 泛型參數的要求

# WRN_VarianceConversionFailedOut6
source: Implicit conversion from '{4}' to '{5}'; this conversion may fail because '{0}' is not derived from '{1}', as required for the 'Out' generic parameter '{2}' in '{3}'.
cs: Implicitní převod z {4} na {5}; tento převod může selhat, protože {0} není odvozené z {1}, jak se vyžaduje pro obecný parametr Out {2} v {3}.
de: Implizite Konvertierung von "{4}" in "{5}". Bei dieser Konvertierung können Fehler auftreten, weil "{0}" nicht von "{1}" abgeleitet ist, wie dies für den generischen Out-Parameter "{2}" in "{3}" erforderlich ist.
es: Conversión implícita de '{4}' a '{5}'; esta conversión puede dar error porque '{0}' no se deriva de '{1}', como se requiere para el parámetro genérico 'Out' '{2}' en '{3}'.
fr: Conversion implicite de '{4}' en '{5}' ; cette conversion peut échouer car '{0}' ne dérive pas de '{1}', comme cela est requis pour le paramètre générique 'Out' '{2}' dans '{3}'.
it: La conversione implicita da '{4}' a '{5}' potrebbe non riuscire perché '{0}' non è derivato da '{1}' come richiesto per il parametro generico 'Out' '{2}' in '{3}'.
ja: '{4}' から '{5}' への暗黙の型変換です。'{0}' は、'{3}' の 'Out' ジェネリック パラメーター '{2}' に求められるように '{1}' から派生していないため、この変換は失敗する可能性があります。
ko: '{4}'에서 '{5}'(으)로 암시적 변환을 수행합니다. '{3}'에 있는 'Out' 제네릭 매개 변수 '{2}'에 필요한 대로 '{0}'이(가) '{1}'에서 파생되지 않았으므로 이 변환 작업을 수행하지 못할 수 있습니다.
pl: Niejawna konwersja z „{4}” na „{5}”; ta konwersja może się nie powieść, ponieważ „{0}” nie dziedziczy od „{1}”, co jest wymagane dla parametru ogólnego „Out” „{2}” w „{3}”.
pt_br: Conversão implícita de "{4}" para "{5}"; esta conversão pode falhar porque "{0}" não é derivado de "{1}", conforme necessário para o parâmetro genérico "Out" "{2}" em "{3}".
ru: Неявное преобразование "{4}" в "{5}"; возможно ошибки преобразования, так как "{0}" не наследованы из "{1}" в соответствии с требованием универсального параметра "Out" "{2}" в "{3}".
tr: '{4}' ile '{5}' arasında örtük dönüşüm; '{3}' içinde '{2}' 'Out' genel parametresinin gerektirdiği gibi '{0}' öğesi '{1}' öğesinden türetilmediği için, bu dönüşüm başarısız olabilir.
zh_hans: 从“{4}”到“{5}”的隐式转换；此转换可能失败，因为根据“{3}”中“Out”泛型形参“{2}”的需要，“{0}”不是从“{1}”派生的。
zh_hant: 從 '{4}' 隱含轉換成 '{5}'; 此轉換可能會失敗，因為依 '{3}' 中 'Out' 泛型參數 '{2}' 之需求，'{0}' 並非衍生自 '{1}'。

# WRN_VarianceConversionFailedOut6_Title
source: Implicit conversion; this conversion may fail because the target type is not derived from the source type, as required for 'Out' generic parameter
cs: Implicitní převod; tento převod se možná nepovede, protože cílový typ není odvozený od zdrojového typu, jak to vyžaduje obecný parametr Out.
de: Implizite Konvertierung. Bei dieser Konvertierung tritt möglicherweise ein Fehler auf, da der Zieltyp nicht vom Quelltyp abgeleitet wird, wie für den generischen Out-Parameter erforderlich.
es: Conversión implícita; es posible que esta conversión dé un error porque el tipo de destino no se deriva del tipo de origen, tal y como necesita el parámetro genérico 'Out'
fr: Conversion implicite. Il est possible que cette conversion échoue, car le type cible n’est pas dérivé du type source, comme le requiert le paramètre générique 'Out'
it: Conversione implicita. Questa conversione potrebbe non riuscire perché il tipo di destinazione non è derivato dal tipo di origine, come richiesto dal parametro generico 'Out'
ja: 暗黙的な変換です。対象の型は元の型からは派生しないため ('Out' ジェネリック パラメーターにはこの派生が必須)、この変換は失敗する可能性があります
ko: 암시적 변환임, 'Out' 제네릭 매개 변수에 필요한 것처럼 대상 형식이 소스 형식에서 파생되지 않았으므로 이 변환은 실패할 수 있음
pl: Niejawna konwersja; ta konwersja może się nie powieść, ponieważ typ docelowy nie pochodzi od typu źródłowego, co jest wymagane dla parametru ogólnego „Out”
pt_br: Conversão implícita. Esta conversão pode falhar porque o tipo de destino não é derivado do tipo de fonte, conforme necessário para o parâmetro genérico 'Out'
ru: Неявное преобразование; может произойти сбой этого преобразования, так как целевой тип не наследуется из типа источника, как это требуется для универсального параметра Out
tr: Örtük dönüştürme; hedef türü 'Out' genel parametresinin gerektirdiği kaynak türünden türetilmediğinden bu dönüştürme başarısız olabilir
zh_hans: 隐式转换；此转换可能失败，原因是目标类型不是从源类型派生的，而这是 "Out" 泛型参数所必需的
zh_hant: 隱含轉換; 這個轉換可能失敗，因為目標類型並非衍生自來源類型，如此不符合 'Out' 泛型參數的要求

# ERR_VarianceConversionFailedTryIn4
source: '{0}' cannot be converted to '{1}'. Consider changing the '{2}' in the definition of '{3}' to an In type parameter, 'In {2}'.
cs: '{0} není možno převést na {1}. Zvažte změnu {2} v definici {3} na parametr typu In: In {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Ändern Sie "{2}" in der Definition von "{3}" ggf. in einen Parameter vom Typ "In" (In {2}).
es: '{0}' no se puede convertir en '{1}'. Puede cambiar el '{2}' en la definición de '{3}' a un parámetro de tipo In, 'In {2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Changez '{2}' dans la définition de '{3}' en paramètre de type In, 'In {2}'.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a modificare '{2}' nella definizione di '{3}' specificando un parametro di tipo In, 'In {2}'.
ja: '{0}' を '{1}' に変換できません。'{3}' の定義にある '{2}' を In 型パラメーター 'In {2}' に変更することを検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. '{3}'의 정의에 있는 '{2}'을(를) In 형식 매개 변수 'In {2}'(으)로 변경하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ zmianę elementu „{2}” w definicji „{3}” na parametr typu In, „In {2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Considere alterar o "{2}" na definição de "{3}" para um parâmetro de tipo In, "In {2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте изменить "{2}" в определении "{3}" на параметр In, "In {2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. '{3}' tanımındaki '{2}' öğesini In tür parametresi ('In {2}') olarak değiştirebilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑在“{3}”的定义中将“{2}”改为 In 类型参数“In {2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮將 '{3}' 之定義中的 '{2}'，變更為 In 類型參數 'In {2}'。

# ERR_VarianceConversionFailedTryOut4
source: '{0}' cannot be converted to '{1}'. Consider changing the '{2}' in the definition of '{3}' to an Out type parameter, 'Out {2}'.
cs: '{0} není možno převést na {1}. Zvažte změnu {2} v definici {3} na parametr typu Out: Out {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Ändern Sie "{2}" in der Definition von "{3}" ggf. in einen Parameter vom Typ "Out" (Out {2}).
es: '{0}' no se puede convertir en '{1}'. Puede cambiar el '{2}' en la definición de '{3}' a un parámetro de tipo Out, 'Out {2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Changez '{2}' dans la définition de '{3}' en paramètre de type Out, 'Out {2}'.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a modificare '{2}' nella definizione di '{3}' specificando un parametro di tipo Out, 'Out {2}'.
ja: '{0}' を '{1}' に変換できません。'{3}' の定義にある '{2}' を Out 型パラメーター 'Out {2}' に変更することを検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. '{3}'의 정의에 있는 '{2}'을(를) Out 형식 매개 변수 'Out {2}'(으)로 변경하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ zmianę elementu „{2}” w definicji „{3}” na parametr typu Out, „Out {2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Considere alterar o "{2}" na definição de "{3}" para um parâmetro de tipo Out, "Out {2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте изменить "{2}" в определении "{3}" на параметр типа Out, "Out {2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. '{3}' tanımındaki '{2}' öğesini Out tür parametresi ('Out {2}') olarak değiştirebilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑在“{3}”的定义中将“{2}”改为 Out 类型参数“Out {2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮將 '{3}' 之定義中的 '{2}'，變更為 Out 類型參數 'Out {2}'。

# WRN_VarianceConversionFailedTryIn4
source: '{0}' cannot be converted to '{1}'. Consider changing the '{2}' in the definition of '{3}' to an In type parameter, 'In {2}'.
cs: '{0} není možno převést na {1}. Zvažte změnu {2} v definici {3} na parametr typu In: In {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Ändern Sie "{2}" in der Definition von "{3}" ggf. in einen Parameter vom Typ "In" (In {2}).
es: '{0}' no se puede convertir en '{1}'. Puede cambiar el '{2}' en la definición de '{3}' a un parámetro de tipo In, 'In {2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Changez '{2}' dans la définition de '{3}' en paramètre de type In, 'In {2}'.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a modificare '{2}' nella definizione di '{3}' specificando un parametro di tipo In, 'In {2}'.
ja: '{0}' を '{1}' に変換できません。'{3}' の定義にある '{2}' を In 型パラメーター 'In {2}' に変更することを検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. '{3}'의 정의에 있는 '{2}'을(를) In 형식 매개 변수 'In {2}'(으)로 변경하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ zmianę elementu „{2}” w definicji „{3}” na parametr typu In, „In {2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Considere alterar o "{2}" na definição de "{3}" para um parâmetro de tipo In, "In {2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте изменить "{2}" в определении "{3}" на параметр In, "In {2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. '{3}' tanımındaki '{2}' öğesini In tür parametresi ('In {2}') olarak değiştirebilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑在“{3}”的定义中将“{2}”改为 In 类型参数“In {2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮將 '{3}' 之定義中的 '{2}'，變更為 In 類型參數 'In {2}'。

# WRN_VarianceConversionFailedTryIn4_Title
source: Type cannot be converted to target type
cs: Typ se nedá převést na cílový typ.
de: Der Typ kann nicht in den Zieltyp konvertiert werden.
es: El tipo no se puede convertir al tipo de destino
fr: Le type ne peut pas être converti en type cible
it: Non è possibile convertire il tipo nel tipo di destinazione
ja: 型を対象の型に変換できません
ko: 형식을 대상 형식으로 변환할 수 없음
pl: Nie można przekonwertować typu na typ docelowy
pt_br: O tipo não pode ser convertido para o tipo de destino
ru: Тип невозможно преобразовать в целевой тип
tr: Tür, hedef türüne dönüştürülemiyor
zh_hans: 无法将类型转换为目标类型
zh_hant: 無法將類型轉換成目標類型

# WRN_VarianceConversionFailedTryOut4
source: '{0}' cannot be converted to '{1}'. Consider changing the '{2}' in the definition of '{3}' to an Out type parameter, 'Out {2}'.
cs: '{0} není možno převést na {1}. Zvažte změnu {2} v definici {3} na parametr typu Out: Out {2}.
de: '"{0}" kann nicht in "{1}" konvertiert werden. Ändern Sie "{2}" in der Definition von "{3}" ggf. in einen Parameter vom Typ "Out" (Out {2}).
es: '{0}' no se puede convertir en '{1}'. Puede cambiar el '{2}' en la definición de '{3}' a un parámetro de tipo Out, 'Out {2}'.
fr: 'Impossible de convertir '{0}' en '{1}'. Changez '{2}' dans la définition de '{3}' en paramètre de type Out, 'Out {2}'.
it: 'Non è possibile convertire '{0}' in '{1}'. Provare a modificare '{2}' nella definizione di '{3}' specificando un parametro di tipo Out, 'Out {2}'.
ja: '{0}' を '{1}' に変換できません。'{3}' の定義にある '{2}' を Out 型パラメーター 'Out {2}' に変更することを検討してください。
ko: '{0}'을(를) '{1}'(으)로 변환할 수 없습니다. '{3}'의 정의에 있는 '{2}'을(를) Out 형식 매개 변수 'Out {2}'(으)로 변경하세요.
pl: 'Nie można skonwertować elementu „{0}” na „{1}”. Rozważ zmianę elementu „{2}” w definicji „{3}” na parametr typu Out, „Out {2}”.
pt_br: "{0}" não pode ser convertido em "{1}". Considere alterar o "{2}" na definição de "{3}" para um parâmetro de tipo Out, "Out {2}".
ru: "{0}" нельзя преобразовать в "{1}". Попробуйте изменить "{2}" в определении "{3}" на параметр типа Out, "Out {2}".
tr: '{0}', '{1}' öğesine dönüştürülemez. '{3}' tanımındaki '{2}' öğesini Out tür parametresi ('Out {2}') olarak değiştirebilirsiniz.
zh_hans: '“{0}”不能转换为“{1}”。考虑在“{3}”的定义中将“{2}”改为 Out 类型参数“Out {2}”。
zh_hant: '{0}' 無法轉換成 '{1}'。請考慮將 '{3}' 之定義中的 '{2}'，變更為 Out 類型參數 'Out {2}'。

# WRN_VarianceConversionFailedTryOut4_Title
source: Type cannot be converted to target type
cs: Typ se nedá převést na cílový typ.
de: Der Typ kann nicht in den Zieltyp konvertiert werden.
es: El tipo no se puede convertir al tipo de destino
fr: Le type ne peut pas être converti en type cible
it: Non è possibile convertire il tipo nel tipo di destinazione
ja: 型を対象の型に変換できません
ko: 형식을 대상 형식으로 변환할 수 없음
pl: Nie można przekonwertować typu na typ docelowy
pt_br: O tipo não pode ser convertido para o tipo de destino
ru: Тип невозможно преобразовать в целевой тип
tr: Tür, hedef türüne dönüştürülemiyor
zh_hans: 无法将类型转换为目标类型
zh_hant: 無法將類型轉換成目標類型

# WRN_VarianceDeclarationAmbiguous3
source: Interface '{0}' is ambiguous with another implemented interface '{1}' due to the 'In' and 'Out' parameters in '{2}'.
cs: Rozhraní {0} je nejednoznačné s jiným implementovaným rozhraním {1} kvůli parametrům In a Out v {2}.
de: Die Schnittstelle "{0}" unterscheidet sich aufgrund der Parameter "In" und "Out" in "{2}" nicht eindeutig von einer anderen implementierten Schnittstelle ({1}).
es: La interfaz '{0}' es ambigua con otra interfaz implementada '{1}' debido a los parámetros 'In' y 'Out' de '{2}'.
fr: La présence des paramètres 'In' et 'Out' dans '{2}' crée une ambiguïté entre l'interface '{0}' et une autre interface '{1}' implémentée.
it: L'interfaccia '{0}' presenta ambiguità rispetto a un'altra interfaccia implementata '{1}' per la presenza dei parametri 'In' e 'Out' in '{2}'.
ja: インターフェイス '{0}' は、'{2}' の 'In' および 'Out' パラメーターが原因で、実装されている別のインターフェイス '{1}' に対してあいまいです。
ko: '{2}'에 있는 'In' 및 'Out' 매개 변수로 인해 '{0}' 인터페이스가 구현된 다른 인터페이스 '{1}'에 대해 모호합니다.
pl: Interfejs „{0}” jest niejednoznaczny z innym zaimplementowanym interfejsem „{1}” ze względu na parametry „In” i „Out” w „{2}”.
pt_br: Interface "{0}" é ambígua com outra interface implementada "{1}" devido aos parâmetros "In" e "Out" em "{2}".
ru: Интерфейс "{0}" неоднозначен с другим реализованным интерфейсом "{1}" из-за параметров "In" и "Out" в "{2}".
tr: '{2}' içindeki 'In' ve 'Out' parametreleri nedeniyle '{0}' arabirimi uygulanmış diğer '{1}' arabirimiyle birlikte belirsiz.
zh_hans: “{2}”中的“In”和“Out”参数导致接口“{0}”与另一个已实现的接口“{1}”一起使用时目的不明确。
zh_hant: 因為 '{2}' 中 'In' 和 'Out' 參數而造成介面 '{0}' 與另一個實作介面 '{1}' 之間模稜兩可。

# WRN_VarianceDeclarationAmbiguous3_Title
source: Interface is ambiguous with another implemented interface due to 'In' and 'Out' parameters
cs: Rozhraní je nejednoznačné vzhledem k jinému implementovanému rozhraní kvůli parametrům In a Out.
de: Die Schnittstelle ist aufgrund von In- und Out-Parametern mit einer anderen implementierten Schnittstelle mehrdeutig.
es: La interfaz es ambigua con otra interfaz implementada debido a los parámetros 'In' y 'Out'
fr: La présence des paramètres 'In' et 'Out' crée une ambiguïté entre l’interface et une autre interface implémentée
it: L'interfaccia presenta ambiguità rispetto a un'altra interfaccia implementata per la presenza dei parametri 'In' e 'Out'
ja: インターフェイスは、'In' パラメーターと 'Out' パラメーターが原因で、別の実装されたインターフェイスとあいまいです
ko: In' 및 'Out' 매개 변수로 인해 인터페이스와 다른 구현된 인터페이스를 구별하기가 모호함
pl: Interfejs jest niejednoznaczny z innym zaimplementowanym interfejsem ze względu na parametry „In” i „Out”
pt_br: A interface é ambígua com outra interface implementada pelos parâmetros 'In' e 'Out'
ru: Интерфейс неоднозначен, так как другой интерфейс реализован в соответствии с параметрами In и Out
tr: Arabirim, 'In' ve 'Out' parametrelerine göre uygulanan başka bir arabirim nedeniyle belirsiz
zh_hans: 接口对于另一个实现的接口不明确，原因在于 "In" 和 "Out" 参数
zh_hant: 因為 'In' 和 'Out' 參數的關係，介面與另一個已實作的介面之間模稜兩可

# ERR_VarianceInterfaceNesting
source: Enumerations, classes, and structures cannot be declared in an interface that has an 'In' or 'Out' type parameter.
cs: Výčty, třídy a struktury nejde deklarovat v rozhraní, které má parametr In nebo Out.
de: Enumerationen, Klassen und Strukturen können nicht in Schnittstellen mit Parametern vom Typ "In" oder "Out" deklariert werden.
es: Las enumeraciones, las clases y las estructuras no se pueden declarar en una interfaz que tenga un parámetro de tipo 'In' o 'Out'.
fr: Les énumérations, les classes et les structures ne peuvent pas être déclarées dans une interface comportant un paramètre de type 'In' ou 'Out'.
it: Non è possibile dichiarare enumerazioni, classi e strutture in un'interfaccia che contiene un parametro di tipo 'In' o 'Out'.
ja: In' または 'Out' の型パラメーターを持つインターフェイス内では、列挙体、クラス、および構造体を宣言することはできません。
ko: 열거형, 클래스 및 구조체는 'In' 또는 'Out' 형식 매개 변수가 있는 인터페이스에서 선언할 수 없습니다.
pl: Wyliczenia, klasy i struktury nie mogą być deklarowane w interfejsie mającym parametr typu „In” lub „Out”.
pt_br: Não é possível declarar enumerações, classes, e estruturas em uma interface que possui um parâmetro de tipo 'In' ou 'Out'.
ru: Перечисления, классы и структуры не могут быть объявлены в интерфейсе, имеющем параметр типа "In" или "Out".
tr: Sabit listeleri, sınıflar ve yapılar 'In' veya 'Out' tür parametresine sahip bir arabirimde bildirilemez.
zh_hans: 无法在含有 "In" 或 "Out" 类型参数的接口中声明枚举、类和结构。
zh_hant: 無法在有 'In' 或 'Out' 類型參數的介面中宣告列舉、類別和結構。
