Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CLSEventMethodInNonCLSType3
source: '{0}' method for event '{1}' cannot be marked CLS compliant because its containing type '{2}' is not CLS compliant.
cs: 'Metodu {0} pro událost {1} nejde označit jako kompatibilní se specifikací CLS, protože typ {2}, ve kterém je obsažená, není kompatibilní se specifikací CLS.
de: 'Die {0}-Methode für das {1}-Ereignis kann nicht als CLS-kompatibel markiert werden, da der enthaltende {2}-Typ nicht CLS-kompatibel ist.
es: 'El método '{0}' del evento '{1}' no se puede marcar como conforme a CLS porque el tipo contenedor '{2}' no es conforme a CLS.
fr: 'La méthode '{0}' pour l'événement '{1}' ne peut pas être marquée comme conforme CLS, car son type conteneur '{2}' n'est pas conforme CLS.
it: 'Il metodo '{0}' per l'evento '{1}' non può essere contrassegnato come conforme a CLS perché il tipo che lo contiene '{2}' non è conforme a CLS.
ja: 'CLS に準拠していない型 '{2}' を含んでいるため、イベント '{1}' の '{0}' メソッドを CLS 準拠として設定できません。
ko: '포함하는 형식 '{2}'이(가) CLS 규격이 아니므로 '{1}' 이벤트의 '{0}' 메서드를 CLS 규격으로 표시할 수 없습니다.
pl: 'Metody „{0}” dla zdarzenia „{1}” nie można oznaczyć jako zgodnej ze specyfikacją CLS, ponieważ jej typ zawierający „{2}” jest niezgodny ze specyfikacją CLS.
pt_br: "{0}" método para o evento "{1}" não pode ser marcado como em conformidade com CLS porque seu tipo recipiente "{2}" não tem conformidade com CLS.
ru: "{0}" метод для события "{1}" не может быть помечен как совместимый с CLS, потому что тип, который он содержит, "{2}" несовместим с CLS.
tr: '{1}' olayı için '{0}' yöntemi CLS uyumlu olarak işaretlenemez çünkü kapsayıcı türü olan '{2}' CLS uyumlu değil.
zh_hans: '事件“{1}”的“{0}”方法不能被标记为符合 CLS，因为它的包含类型“{2}”不符合 CLS。
zh_hant: '事件 '{1}' 的 '{0}' 方法無法標記為符合 CLS 規範，因為其包含類型 '{2}' 不符合 CLS 規範。

# WRN_CLSEventMethodInNonCLSType3_Title
source: AddHandler or RemoveHandler method for event cannot be marked CLS compliant because its containing type is not CLS compliant
cs: Metoda AddHandler nebo RemoveHandler pro událost se nedá označit za kompatibilní se specifikací CLS, protože její nadřazený typ není kompatibilní se specifikací CLS.
de: Die AddHandler- oder RemoveHandler-Methode für das Ereignis kann nicht als CLS-kompatibel gekennzeichnet werden, da sie einen Typ enthalten, der nicht CLS-kompatibel ist.
es: No se pueden marcar los métodos AddHandler o RemoveHandler para el evento como conformes a CLS porque contienen un tipo que no es conforme a CLS
fr: Les méthodes AddHandler ou RemoveHandler pour un événement ne peuvent pas être signalées comme conformes CLS, car leur type contenant n’est pas conforme CLS
it: Il metodo AddHandler o RemoveHandler per l'evento non può essere contrassegnato come conforme a CLS perché il tipo che lo contiene non è conforme a CLS
ja: イベントの AddHandler メソッドまたは RemoveHandler メソッドを包含する型が CLS に準拠していないので、これらのメソッドを CLS 準拠としてマークすることはできません
ko: 포함하는 형식이 CLS 규격이 아니므로 이벤트에 대한 AddHandler 또는 RemoveHandler 메서드를 CLS 규격으로 표시할 수 없음
pl: Nie można oznaczyć metody AddHandler lub RemoveHandler dla zdarzenia jako zgodnej ze specyfikacją CLS, ponieważ jej typ zawierający jest niezgodny ze specyfikacją CLS
pt_br: O método AddHandler ou RemoveHandler para o evento não pode ser marcado como em conformidade com CLS porque seu tipo recipiente não tem conformidade com CLS
ru: Метод AddHandler или RemoveHandler для события невозможно пометить как совместимый с CLS, так как его содержащий тип несовместим с CLS
tr: Olayın kapsayan türü CLS uyumlu olmadığından AddHandler veya RemoveHandler metodu CLS uyumlu olarak işaretlenemez
zh_hans: 事件的 AddHandler 方法或 RemoveHandler 方法无法标记为符合 CLS，原因是它的包含类型不符合 CLS
zh_hant: 無法將事件的 AddHandler 或 RemoveHandler 方法標記為符合 CLS 規範，因為其包含類型並不符合 CLS 規範

# WRN_ExpectedInitComponentCall2
source: '{0}' in designer-generated type '{1}' should call InitializeComponent method.
cs: '{0} v typu {1} vygenerovaném prvkem návrhu musí volat metodu InitializeComponent.
de: '"{0}" im vom Designer generierten Typ "{1}" sollte die InitializeComponent-Methode aufrufen.
es: '{0}', en el tipo generado por el diseñador '{1}', debe llamar al método InitializeComponent.
fr: '{0}' dans le type généré par le concepteur '{1}' doit appeler la méthode InitializeComponent.
it: '{0}' nel tipo '{1}' generato dalla finestra di progettazione deve chiamare il metodo InitializeComponent.
ja: 'デザイナーで生成された型 '{1}' の '{0}' は InitializeComponent メソッドを呼び出さなければなりません。
ko: '디자이너에서 생성한 '{1}' 형식의 '{0}'이(가) InitializeComponent 메서드를 호출해야 합니다.
pl: Element „{0}” w typie wygenerowanym przez projektanta „{1}” powinien wywoływać metodę InitializeComponent.
pt_br: "{0}" no tipo gerado por designer "{1}" deve chamar o método InitializeComponent.
ru: "{0}" в типе, созданном конструктором "{1}", должен вызывать метод InitializeComponent.
tr: 'Tasarımcı tarafından oluşturulan '{1}' türündeki '{0}', InitializeComponent yöntemini çağırmalıdır.
zh_hans: '设计器生成的类型“{1}”中的“{0}”应调用 InitializeComponent 方法。
zh_hant: '設計工具所產生的類型 '{1}' 之 '{0}'，應呼叫 InitializeComponent 方法。

# WRN_ExpectedInitComponentCall2_Title
source: Constructor in designer-generated type should call InitializeComponent method
cs: Konstruktor v typu generovaném prvkem návrhu by měl volat metodu InitializeComponent.
de: Der Konstruktor in dem vom Designer generierten Typ sollte eine InitializeComponent-Methode aufrufen.
es: El constructor del tipo generado por el diseñador debe llamar al método InitializeComponent
fr: Le constructeur du type généré par le concepteur doit appeler la méthode InitializeComponent
it: Il costruttore nel tipo generato dalla finestra di progettazione deve chiamare il metodo InitializeComponent
ja: デザイナーで生成された型のコンストラクターは、InitializeComponent メソッドを呼び出す必要があります
ko: 디자이너에서 생성된 형식의 생성자는 InitializeComponent 메서드를 호출해야 함
pl: Konstruktor w typie wygenerowanym przez projektanta powinien wywoływać metodę InitializeComponent
pt_br: O construtor no tipo gerado pelo designer deve chamar o método InitializeComponent
ru: Конструктор в типе, созданном конструктором, должен вызывать метод InitializeComponent
tr: Tasarımcı tarafından oluşturulan türdeki oluşturucu, InitializeComponent metodunu çağırmalıdır
zh_hans: 设计器生成的类型中的构造函数应调用 InitializeComponent 方法
zh_hant: 設計工具產生的類型中的建構函式，應該呼叫 InitializeComponent 方法

# WRN_NamespaceCaseMismatch3
source: Casing of namespace name '{0}' does not match casing of namespace name '{1}' in '{2}'.
cs: Malá a velká písmena v názvu oboru názvů {0} neodpovídají názvu oboru názvů {1} v {2}.
de: Die Groß-/Kleinschreibung des Namespacenamens "{0}" stimmt nicht mit der Groß-/Kleinschreibung des Namespacenamens "{1}" in "{2}" überein.
es: Las mayúsculas y minúsculas del nombre de espacio de nombres '{0}' no coinciden con las del nombre de espacio de nombres '{1}' en '{2}'.
fr: La casse du nom de l'espace de noms '{0}' ne correspond pas à la casse du nom de l'espace de noms '{1}' dans '{2}'.
it: La combinazione di maiuscole e minuscole nel nome dello spazio dei nomi '{0}' non corrisponde a quella del nome dello spazio dei nomi '{1}' in '{2}'.
ja: '{2}' で、名前空間の名前 '{0}' の大文字と小文字の指定が、名前空間の名前 '{1}' の大文字と小文字の指定と一致しません。
ko: 네임스페이스 이름 '{0}'의 대/소문자가 '{2}'의 네임스페이스 이름 '{1}'의 대/소문자와 일치하지 않습니다.
pl: Wielkość liter nazwy przestrzeni nazw „{0}” nie pasuje do wielkości liter nazwy przestrzeni nazw „{1}” w pliku „{2}”.
pt_br: Maiúsculas do nome do namespace "{0}" não corresponde às maiúsculas do nome do namespace "{1}" em "{2}".
ru: Регистр пространства имен "{0}" не соответствует регистру имени пространства имен "{1}" в "{2}".
tr: '{0}' ad alanı adındaki büyük/küçük harf kullanımı, '{2}' içindeki '{1}' ad alanı adının büyük/küçük harf kullanımıyla eşleşmiyor.
zh_hans: 命名空间名“{0}”的大小写与“{2}”中命名空间名“{1}”的大小写不匹配。
zh_hant: 命名空間名稱 '{0}' 的大小寫，與 '{2}' 中命名空間名稱 '{1}' 的大小寫不相符。

# WRN_NamespaceCaseMismatch3_Title
source: Casing of namespace name does not match
cs: Malá a velká písmena v názvu oboru názvů neodpovídají.
de: Die Schreibweise des Namespacenamens stimmt nicht überein.
es: El uso de mayúsculas y minúsculas en el nombre del espacio de nombres no coincide
fr: La casse du nom de l’espace de noms est incorrecte
it: La combinazione di maiuscole e minuscole nel nome dello spazio dei nomi non corrisponde
ja: 名前空間の名前の大文字と小文字の指定が一致しません
ko: 네임스페이스 이름의 대/소문자가 일치하지 않음
pl: Niezgodna wielkość liter w nazwie przestrzeni nazw
pt_br: Uso de maiúsculas do namespace não correspondente
ru: Регистр имен для пространств имен не соответствует требованиям
tr: Ad alanı adının büyük/küçük harfleri eşleşmiyor
zh_hans: 命名空间名称的大小写不匹配
zh_hant: 命名空間名稱大小寫不相符

# WRN_UndefinedOrEmptyNamespaceOrClass1
source: Namespace or type specified in the Imports '{0}' doesn't contain any public member or cannot be found. Make sure the namespace or the type is defined and contains at least one public member. Make sure the imported element name doesn't use any aliases.
cs: Obor názvů nebo typ zadaný v příkazu Imports {0} neobsahuje žádný veřejný člen nebo se nenašel. Přesvědčte se, jestli je obor názvů nebo typ definovaný a obsahuje nejmíň jeden veřejný člen. Přesvědčte se, jestli název importovaného prvku neobsahuje žádné aliasy.
de: Der in Imports "{0}" angegebene Namespace oder Typ enthält keine öffentlichen Member oder kann nicht gefunden werden. Stellen Sie sicher, dass der Namespace oder der Typ definiert ist und mindestens einen öffentlichen Member enthält, und dass der importierte Elementname keine Aliase verwendet.
es: El espacio de nombres o el tipo especificado en el '{0}' Imports no contienen ningún miembro público o no se encuentran. Asegúrese de que el espacio de nombres o el tipo se hayan definido y de que contengan al menos un miembro público. Asegúrese de que el nombre del elemento importado no use ningún alias.
fr: L'espace de noms ou le type spécifié dans les Imports '{0}' ne contient aucun membre public ou est introuvable. Vérifiez que l'espace de noms ou le type est défini et qu'il contient au moins un membre public. Vérifiez que le nom de l'élément importé n'utilise pas d'autres alias.
it: Lo spazio dei nomi o il tipo specificato nelle istruzioni Imports '{0}' non contiene membri pubblici o non è definito. Accertarsi che lo spazio dei nomi o il tipo sia definito e contenga almeno un membro pubblico e che il nome dell'elemento importato non usi alias.
ja: インポート '{0}' で指定された名前空間または型が、パブリック メンバーを含んでいないか、あるいは見つかりません。名前空間または型が定義されていて、少なくとも 1 つのパブリック メンバーを含んでいることを確認してください。また、インポートされた要素名がエイリアスを使用していないことを確認してください。
ko: Imports '{0}'에 지정된 네임스페이스 또는 형식에 public 멤버가 없거나, 해당 네임스페이스 또는 형식을 찾을 수 없습니다. 네임스페이스 또는 형식이 정의되어 있고 public 멤버를 하나 이상 포함하는지, 그리고 가져온 요소 이름이 별칭을 사용하지 않는지 확인하세요.
pl: Przestrzeń nazw lub typ określony w elemencie Imports „{0}” nie zawiera żadnej publicznej składowej lub nie można jej znaleźć. Upewnij się, że przestrzeń nazw lub typ są zdefiniowane i zawierają co najmniej jedną publiczną składową. Upewnij się, że w nazwie importowanego elementu nie są używane aliasy.
pt_br: Namespace ou tipo especificado na Imports "{0}" não contém membro público ou não pode ser encontrado. Certifique-se que o namespace ou o tipo está definido e contém pelo menos um membro público. Certifique-se que o nome do elemento importado não usa alias.
ru: Пространство имен или тип, указанный в Imports "{0}", не содержит открытый член или не может быть найден. Убедитесь, что пространство имен или тип заданы и содержат хотя бы один открытый член. Убедитесь, что импортируемое имя элемента не использует псевдонимы.
tr: Imports '{0}' içinde belirtilen ad alanı veya tür ortak üye içermiyor veya bulunamıyor. Ad alanının veya türün tanımlandığından ve en az bir ortak üye içerdiğinden emin olun. İçeri aktarılan öğe adının diğer ad kullanmadığından emin olun.
zh_hans: Imports“{0}”中指定的命名空间或类型不包含任何公共成员，或者找不到该命名空间或类型。确保定义了该命名空间或类型且其中至少包含一个公共成员。确保导入的元素名不使用任何别名。
zh_hant: Imports '{0}' 中指定的命名空間或類型，不包含任何 Public 成員，或是找不到該命名空間或類型。請確定已定義該命名空間或類型，且至少包含一個 Public 成員。請確定匯入的元素名稱沒有使用任何別名。

# WRN_UndefinedOrEmptyNamespaceOrClass1_Title
source: Namespace or type specified in Imports statement doesn't contain any public member or cannot be found
cs: Obor názvů nebo typ zadaný v příkazu Imports neobsahuje žádné veřejné členy nebo se nedá najít.
de: Der in der Imports-Anweisung angegebene Namespace oder Typ enthält keinen öffentlichen Member oder wurde nicht gefunden.
es: Falta el espacio de nombre o el tipo especificados en la instrucción Imports o no contienen ningún miembro público
fr: L’espace de noms ou le type spécifié dans l’instruction Imports ne contient pas de membre public ou est introuvable
it: Lo spazio dei nomi o il tipo specificato nell'istruzione Imports non contiene membri pubblici o non è stato trovato
ja: Imports ステートメントで指定されている名前空間または型にパブリック メンバーが含まれていないか、名前空間または型が見つかりません
ko: Imports 문에 지정된 네임스페이스 또는 형식에 public 멤버가 없거나 해당 네임스페이스 또는 형식을 찾을 수 없음
pl: Przestrzeń nazw lub typ określony w instrukcji Imports nie zawiera żadnej publicznej składowej lub nie można jej znaleźć
pt_br: Namespace ou tipo especificado em instruções de Importação não contém nenhum membro público ou não pode ser encontrado
ru: Пространство имен или тип, указанный в операторе Imports, не содержит открытый член, или невозможно найти пространство имен или тип
tr: Imports deyiminde belirtilen ad alanı veya tür, genel üye içermiyor veya bulunamıyor
zh_hans: 在 Imports 语句中指定的命名空间或类型不包含任何公共成员或找不到公共成员
zh_hant: Imports 陳述式中指定的命名空間或類型，不包含任何 Public 成員，或找不到該命名空間或類型

# WRN_UndefinedOrEmptyProjectNamespaceOrClass1
source: Namespace or type specified in the project-level Imports '{0}' doesn't contain any public member or cannot be found. Make sure the namespace or the type is defined and contains at least one public member. Make sure the imported element name doesn't use any aliases.
cs: Obor názvů nebo typ zadaný v příkazu Imports {0} na úrovni projektu neobsahuje žádný veřejný člen nebo se nenašel. Ujistěte se, jestli je obor názvů nebo typ definovaný a obsahuje aspoň jeden veřejný člen. Ujistěte se, jestli název importovaného prvku neobsahuje žádné aliasy.
de: Der in Imports "{0}" auf Projektebene angegebene Namespace oder Typ enthält keine öffentlichen Member oder wurde nicht gefunden. Stellen Sie sicher, dass der Namespace oder der Typ definiert ist und mindestens einen öffentlichen Member enthält und der importierte Elementname keine Aliase verwendet.
es: El espacio de nombres o tipo especificado en las importaciones de nivel de proyecto '{0}' no contienen ningún miembro público o no se encuentran. Asegúrese de que el espacio de nombres o el tipo se hayan definido y de que contengan al menos un miembro público. Asegúrese de que el nombre del elemento importado no utilice ningún alias.
fr: L'espace de noms ou le type spécifié dans les importations '{0}' au niveau du projet ne contient aucun membre public ou est introuvable. Vérifiez que l'espace de noms ou le type est défini, et qu'il contient au moins un membre public. Vérifiez que le nom de l'élément importé n'utilise pas d'alias.
it: Lo spazio dei nomi o il tipo specificato nelle istruzioni Imports '{0}' a livello di progetto non contiene membri pubblici o non è definito. Accertarsi che lo spazio dei nomi o il tipo sia definito e contenga almeno un membro pubblico e che il nome dell'elemento importato non usi alias.
ja: プロジェクト レベルのインポート '{0}' で指定された名前空間または型が、パブリック メンバーを含んでいないか、または見つかりません。名前空間または型が定義されていて、少なくとも 1 つのパブリック メンバーを含んでいることを確認してください。また、インポートされた要素名にエイリアスが使用されていないことを確認してください。
ko: 프로젝트 수준의 Imports '{0}'에 지정된 네임스페이스 또는 형식에 public 멤버가 없거나 해당 네임스페이스 또는 형식을 찾을 수 없습니다. 네임스페이스 또는 형식이 정의되어 있고 하나 이상의 public 멤버를 포함하는지, 그리고 가져온 요소 이름이 별칭을 사용하지 않는지 확인하세요.
pl: Przestrzeń nazw lub typ określony w elemencie Imports „{0}” na poziomie projektu nie zawiera żadnej publicznej składowej lub nie można jej znaleźć. Upewnij się, że przestrzeń nazw lub typ zostały zdefiniowane i zawierają co najmniej jedną publiczną składową. Upewnij się, że w nazwie importowanego elementu nie są używane aliasy.
pt_br: O namespace ou tipo especificado nas importações de nível de projeto "{0}" não contém nenhum membro público ou não foi encontrado. Verifique se o namespace ou o tipo está definido e contém pelo menos um membro público. Verifique se o nome do elemento importado não usa nenhum alias.
ru: Пространство имен или тип, указанные в операторе Imports "{0}" проекта, не содержат открытые члены или не могут быть найдены. Убедитесь, что пространство имен или тип определены и содержат хотя бы один открытый член. Убедитесь, что имя импортируемого элемента не имеет псевдонимов.
tr: Proje düzeyi Imports '{0}' içinde belirtilen ad alanı veya tür ortak üye içermiyor veya bulunamıyor. Ad alanının veya türün tanımlandığından ve en az bir ortak üye içerdiğinden emin olun. İçeri aktarılan öğe adının diğer ad kullanmadığından emin olun.
zh_hans: 项目级 Imports“{0}”中指定的命名空间或类型不包含任何公共成员，或者找不到公共成员。要确保定义了该命名空间或类型且其中至少包含一个公共成员；还要确保导入的元素名不使用任何别名。
zh_hant: 在專案層級 Imports '{0}' 中指定的命名空間或類型不包含任何 Public 成員，或是找不到該命名空間或類型。請確定已定義命名空間或類型，而且其中包含至少一個 Public 成員。請確定匯入的項目名稱未使用任何別名。

# WRN_UndefinedOrEmptyProjectNamespaceOrClass1_Title
source: Namespace or type imported at project level doesn't contain any public member or cannot be found
cs: Obor názvů nebo typ importovaný na úrovni projektu neobsahuje žádné veřejné členy nebo se nedá najít.
de: Der auf Projektebene importierte Namespace oder Typ enthält keinen öffentlichen Member oder wurde nicht gefunden.
es: Falta el espacio de nombre o el tipo importados al nivel de proyecto o no contienen ningún miembro público
fr: L'espace de noms ou le type importé au niveau du projet ne contient pas de membre public ou est introuvable
it: Lo spazio dei nomi o il tipo importato a livello di progetto non contiene membri pubblici oppure non è stato trovato
ja: プロジェクト レベルでインポートされた名前空間または型にパブリック メンバーが含まれていないか、名前空間または型が見つかりません
ko: 프로젝트 수준에서 가져온 네임스페이스 또는 형식에 public 멤버가 없거나 해당 네임스페이스 또는 형식을 찾을 수 없음
pl: Przestrzeń nazw lub typ zaimportowany na poziomie projektu nie zawiera żadnej publicznej składowej lub nie można jej znaleźć
pt_br: O namespace ou tipo importado no nível de projeto não contém nenhum membro público ou não foi encontrado
ru: Пространство имен или тип, импортированный на уровне проекта, не содержит открытый член, или невозможно найти пространство имен или тип
tr: Proje düzeyinde içeri aktarılan ad alanı veya tür, genel üye içermiyor veya bulunamıyor
zh_hans: 在项目级别导入的命名空间或类型不包含任何公共成员或找不到公共成员
zh_hant: 在專案層級匯入的命名空間或類型不包含任何 Public 成員，或是找不到該命名空間或類型

# WRN_IndirectRefToLinkedAssembly2
source: A reference was created to embedded interop assembly '{0}' because of an indirect reference to that assembly from assembly '{1}'. Consider changing the 'Embed Interop Types' property on either assembly.
cs: Vytvořil se odkaz na vložené sestavení vzájemné spolupráce {0}, protože existuje nepřímý odkaz na toto sestavení ze sestavení {1}. Zvažte změnu vlastnosti Vložit typy vzájemné spolupráce u obou sestavení.
de: Es wurde ein Verweis auf die eingebettete Interopassembly "{0}" aufgrund eines indirekten Verweises auf diese Assembly aus Assembly "{1}" erstellt. Ändern Sie ggf. für beide Assemblys die Eigenschaft "Interoptypen einbetten".
es: Se creó una referencia al ensamblado de interoperabilidad '{0}' incrustado debido a una referencia indirecta a ese ensamblado desde el ensamblado '{1}'. Puede cambiar la propiedad 'Incrustar tipos de interoperabilidad' en cualquiera de los ensamblados.
fr: Une référence a été créée pour l'assembly d'interopérabilité incorporé '{0}' en raison d'une référence indirecte à cet assembly à partir de l'assembly '{1}'. Modifiez la propriété 'Incorporer les types interop' pour l'un des assemblys.
it: È stato creato un riferimento all'assembly di interoperabilità '{0}' incorporato a causa di un riferimento indiretto a tale assembly dall'assembly '{1}'. Provare a modificare la proprietà 'Incorpora tipi di interoperabilità' per entrambi gli assembly.
ja: 埋め込まれた相互運用機能アセンブリ '{0}' への参照が作成されました。これは、そのアセンブリへの間接参照がアセンブリ '{1}' によって作成されたためです。どちらかのアセンブリで '相互運用機能型の埋め込み' プロパティを変更することを検討してください。
ko: 포함된 interop '{0}' 어셈블리에 대한 참조는 해당 어셈블리에 대한 '{1}' 어셈블리의 간접 참조 때문에 만들어졌습니다. 두 어셈블리 중 하나의 'Interop 형식 포함' 속성을 변경하세요.
pl: Utworzono odwołanie do osadzonego zestawu międzyoperacyjnego „{0}” z powodu pośredniego odwołania do tego zestawu z zestawu „{1}”. Rozważ zmianę właściwości osadzania typów międzyoperacyjnych w jednym z zestawów.
pt_br: Foi criada uma referência ao assembly de interoperabilidade inserido "{0}" devido a uma referência indireta a esse assembly a partir do assembly "{1}". Considere alterar a propriedade "Inserir Tipos de Interoperabilidade" em qualquer assembly.
ru: Была создана ссылка на внедренную сборку взаимодействия "{0}", так как существует косвенная ссылка на эту сборку, созданная сборкой "{1}". Рассмотрите возможность изменения свойства "Внедрять типы взаимодействия" в любой сборке.
tr: '{1}' derlemesinden '{0}' gömülü birlikte çalışma derlemesine dolaylı bir başvuru olduğundan, bu birlikte çalışma derlemesine bir başvuru oluşturuldu. İki derlemeden birinde 'Embed Interop Types' özelliğini değiştirebilirsiniz.
zh_hans: 已创建对嵌入的互操作程序集“{0}”的引用，因为程序集“{1}”间接引用了该程序集。请考虑更改其中一个程序集的“嵌入互操作类型”属性。
zh_hant: 已建立內嵌 Interop 組件 '{0}' 的參考，因為該組件的間接參考來自組件 '{1}'。請考慮變更其中任一組件上的 [內嵌 Interop 類型] 屬性。

# WRN_IndirectRefToLinkedAssembly2_Title
source: A reference was created to embedded interop assembly because of an indirect reference to that assembly
cs: Vytvořil se odkaz na vložené definiční sestavení kvůli nepřímému odkazu na toto sestavení.
de: Es wurde ein Verweis auf die eingebettete Interop-Assembly aufgrund eines indirekten Verweises auf diese Assembly erstellt.
es: Se creó una referencia para insertar un ensamblado de interoperabilidad debido a una referencia indirecta a dicho ensamblado
fr: Une référence a été créée pour l’assembly d’interopérabilité incorporé en raison d’une référence indirecte à cet assembly
it: È stato creato un riferimento all'assembly di interoperabilità incorporato a causa di un riferimento indiretto a tale assembly
ja: アセンブリへの間接的な参照が原因で、埋め込まれた相互運用機能アセンブリに対して参照が作成されました
ko: 포함된 interop 어셈블리에 대한 간접 참조로 인해 해당 어셈블리에 대한 참조가 만들어짐
pl: Utworzono odwołanie do osadzonego zestawu międzyoperacyjnego z powodu pośredniego odwołania do tego zestawu
pt_br: Foi criada uma referência para o assembly de interoperabilidade integrado devido a uma referência indireta a este assembly
ru: Была создана ссылка на внедренную сборку взаимодействия из-за непрямой ссылки на эту сборку
tr: Derlemeye dolaylı başvurudan dolayı gömülü birlikte çalışma derlemesi için bir başvuru oluşturuldu
zh_hans: 已创建对嵌入的互操作程序集的引用，因为间接引用了该程序集
zh_hant: 已建立內嵌 Interop 組件的參考，因為對該組件已有間接參考
