Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InterfaceImplementedTwiceWithDifferentTupleNames3
source: Interface '{0}' can be implemented only once by this type, but already appears with different tuple element names, as '{1}' (via '{2}').
cs: Rozhraní {0} jde pomocí tohoto typu implementovat jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {1} (prostřednictvím {2}).
de: Die Schnittstelle "{0}" kann von dieser Schnittstelle nur ein Mal implementiert werden, wird aber bereits mit anderen Tupelelementnamen als "{1}" (über "{2}") angezeigt.
es: La interfaz '{0}' solo se puede implementar una vez por este tipo, pero ya aparece con diferentes nombres de elementos de tupla, como '{1}' (a través de '{2}').
fr: L'interface '{0}' ne peut être implémentée qu'une seule fois par ce type, mais elle apparaît déjà avec noms d'éléments tuples différents, notamment '{1}' (par l'intermédiaire de '{2}').
it: L'interfaccia '{0}' può essere implementata solo una volta da questo tipo, ma è già presente con nomi di elementi di tupla diversi, come '{1}' (tramite '{2}').
ja: インターフェイス '{0}' は、この型によって 1 回のみ実装できますが、異なるタプル要素名で、'{1}' として既に存在しています ('{2}' 経由)。
ko: '{0}' 인터페이스는 이 형식으로 한 번만 구현할 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{2}'을(를) 통해 '{1}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” można zaimplementować tylko raz według tego typu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{1}” (poprzez „{2}”).
pt_br: A interface '{0}' pode ser implementada somente uma vez por este tipo, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{1}' (via '{2}').
ru: Интерфейс "{0}" может быть реализован с этим типом только один раз, но уже существует с другими именами элементов кортежа как "{1}" (реализован через "{2}").
tr: '{0}' arabirimi bu tür tarafından yalnızca bir kez uygulanabilir, ancak '{1}' olarak ('{2}' aracılığıyla) farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此类型实现一次，但已显示有不同的元组元素名称，如“{1}”(通过“{2}”)。
zh_hant: 此類型只可在介面 '{0}' 上實作一次，但卻已有不同的 Tuple 項目名稱 ('{1}'，經由 '{2}')。

# ERR_InterfaceImplementedTwiceWithDifferentTupleNamesReverse3
source: Interface '{0}' (via '{1}') can be implemented only once by this type, but already appears with different tuple element names, as '{2}'.
cs: Rozhraní {0} (prostřednictvím {1}) jde pomocí tohoto typu implementovat jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {2}.
de: Die Schnittstelle "{0}" (über "{1}") kann von diesem Typ nur ein Mal implementiert werden, wird aber bereits mit anderen Tupelelementnamen als "{2}" angezeigt.
es: La interfaz '{0}' (a través de '{1}') solo se puede implementar una vez por este tipo, pero ya aparece con diferentes nombres de elementos de tupla, como '{2}'.
fr: L'interface '{0}' (par l'intermédiaire de '{1}') ne peut être implémentée qu'une seule fois par ce type, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{2}'.
it: L'interfaccia '{0}' (tramite '{1}') può essere implementata solo una volta da questo tipo, ma è già presente con nomi di elementi di tupla diversi, come '{2}'.
ja: インターフェイス '{0}' ('{1}' 経由) は、この型によって 1 回のみ実装できますが、異なるタプル要素名で、'{2}' として既に存在しています。
ko: '{0}' 인터페이스는 '{1}'을(를) 통해 이 형식으로 한 번만 구현할 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{2}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” (poprzez „{1}”) można zaimplementować tylko raz według tego typu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{2}”.
pt_br: A interface '{0}' (via '{1}') pode ser implementada somente uma vez por este tipo, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{2}'.
ru: Интерфейс "{0}" (реализован через "{1}") может быть реализован с этим типом только один раз, но уже существует с другими именами элементов кортежа как "{2}".
tr: '{0}' arabirimi ('{1}' aracılığıyla) bu tür tarafından yalnızca bir kez uygulanabilir, ancak '{2}' olarak farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此类型实现一次(通过“{1}”)，但已显示有不同的元组元素名称，如“{2}”。
zh_hant: 此類型只可在介面 '{0}' 上實作一次 (經由 '{1}')，但卻已有不同的 Tuple 項目名稱 ('{2}')。

# ERR_InterfaceImplementedTwiceWithDifferentTupleNames4
source: Interface '{0}' (via '{1}') can be implemented only once by this type, but already appears with different tuple element names, as '{2}' (via '{3}').
cs: Rozhraní {0} (prostřednictvím {1}) jde pomocí tohoto typu implementovat jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {2} (prostřednictvím {3}).
de: Die Schnittstelle "{0}" (über "{1}") kann von diesem Typ nur ein Mal implementiert werden, wird aber bereits mit anderen Tupelelementnamen als "{2}" (über "{3}") angezeigt.
es: La interfaz '{0}' (a través de '{1}') solo se puede implementar una vez por este tipo, pero ya aparece con diferentes nombres de elementos de tupla, como '{2}' (a través de '{3}').
fr: L'interface '{0}' (par l'intermédiaire de '{1}') ne peut être implémentée qu'une seule fois par ce type, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{2}' (par l'intermédiaire de '{3}').
it: L'interfaccia '{0}' (tramite '{1}') può essere implementata solo una volta da questo tipo, ma è già presente con nomi di elementi di tupla diversi, come '{2}' (tramite '{3}').
ja: インターフェイス '{0}' ('{1}' 経由) は、この型によって 1 回のみ実装できますが、異なるタプル要素名で、'{2}' として既に存在しています ('{3}' 経由)。
ko: '{0}' 인터페이스는 '{1}'을(를) 통해 이 형식으로 한 번만 구현할 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{3}'을(를) 통해 '{2}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” (poprzez „{1}”) można zaimplementować tylko raz według tego typu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{2}” (poprzez „{3}”).
pt_br: A interface '{0}' (via '{1}') pode ser implementada somente uma vez por este tipo, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{2}' (via '{3}').
ru: Интерфейс "{0}" (реализован через "{1}") может быть реализован с этим типом только один раз, но уже существует с другими именами элементов кортежа как "{2}" (реализован через "{3}").
tr: '{0}' arabirimi ('{1}' aracılığıyla) bu tür tarafından yalnızca bir kez uygulanabilir, ancak '{2}' olarak ('{3}' aracılığıyla) farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此类型实现一次(通过“{1}”)，但已显示有不同的元组元素名称，如“{2}”(通过“{3}”)。
zh_hant: 此類型只可在介面 '{0}' 上實作一次 (經由 '{1}')，但卻已有不同的 Tuple 項目名稱 ('{2}'，經由 '{3}')。

# ERR_InterfaceInheritedTwiceWithDifferentTupleNames2
source: Interface '{0}' can be inherited only once by this interface, but already appears with different tuple element names, as '{1}'.
cs: Rozhraní {0} jde pomocí tohoto rozhraní zdědit jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {1}.
de: Die Schnittstelle "{0}" kann von dieser Schnittstelle nur ein Mal geerbt werden, wird aber bereits mit anderen Tupelelementnamen als "{1}" angezeigt.
es: La interfaz '{0}' solo se puede heredar una vez por esta interfaz, pero ya aparece con diferentes nombres de elementos de tupla, como '{1}'.
fr: L'interface '{0}' ne peut être héritée qu'une seule fois par cette interface, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{1}'.
it: L'interfaccia '{0}' può essere ereditata solo una volta da questa interfaccia, ma è già presente con nomi di elementi di tupla diversi, come '{1}'.
ja: インターフェイス '{0}' は、このインターフェイスによって 1 回のみ継承できますが、異なるタプル要素名で、'{1}' として既に存在しています。
ko: '{0}' 인터페이스는 이 인터페이스에서 한 번만 상속될 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{1}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” można odziedziczyć tylko raz według tego interfejsu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{1}”.
pt_br: A interface '{0}' pode ser herdada somente uma vez por esta interface, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{1}'.
ru: Интерфейс "{0}" может быть унаследован этим интерфейсом только один раз, но уже существует с другими именами элементов кортежа как "{1}".
tr: '{0}' arabirimi bu arabirim tarafından yalnızca bir kez devralınabilir, ancak '{1}' olarak farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此接口继承一次，但已显示有不同的元组元素名称，如“{1}”。
zh_hant: 此介面只可繼承介面 '{0}' 一次，但卻已有不同的 Tuple 項目名稱 ('{1}')。

# ERR_InterfaceInheritedTwiceWithDifferentTupleNames3
source: Interface '{0}' can be inherited only once by this interface, but already appears with different tuple element names, as '{1}' (via '{2}').
cs: Rozhraní {0} jde pomocí tohoto rozhraní zdědit jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {1} (prostřednictvím {2}).
de: Die Schnittstelle "{0}" kann von dieser Schnittstelle nur ein Mal geerbt werden, wird aber bereits mit anderen Tupelelementnamen als "{1}" (über "{2}") angezeigt.
es: La interfaz '{0}' solo se puede heredar una vez por esta interfaz, pero ya aparece con diferentes nombres de elementos de tupla, como '{1}' (a través de '{2}').
fr: L'interface '{0}' ne peut être héritée qu'une seule fois par cette interface, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{1}' (par l'intermédiaire de '{2}').
it: L'interfaccia '{0}' può essere ereditata solo una volta da questa interfaccia, ma è già presente con nomi di elementi di tupla diversi, come '{1}' (tramite '{2}').
ja: インターフェイス '{0}' は、このインターフェイスによって 1 回のみ継承できますが、異なるタプル要素名で、'{1}' として既に存在しています ('{2}' 経由)。
ko: '{0}' 인터페이스는 이 인터페이스에서 한 번만 상속될 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{2}'을(를) 통해 '{1}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” można odziedziczyć tylko raz według tego interfejsu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{1}” (poprzez „{2}”).
pt_br: A interface '{0}' pode ser herdada somente uma vez por esta interface, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{1}' (via '{2}').
ru: Интерфейс "{0}" может быть унаследован этим интерфейсом только один раз, но уже существует с другими именами элементов кортежа как "{1}" (реализован через '{2}').
tr: '{0}' arabirimi bu arabirim tarafından yalnızca bir kez devralınabilir, ancak '{1}' olarak ('{2}' aracılığıyla) farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此接口继承一次，但已显示有不同的元组元素名称，如“{1}”(通过“{2}”)。
zh_hant: 此介面只可繼承介面 '{0}' 一次，但卻已有不同的 Tuple 項目名稱 ('{1}'，經由 '{2}')。

# ERR_InterfaceInheritedTwiceWithDifferentTupleNamesReverse3
source: Interface '{0}' (via '{1}') can be inherited only once by this interface, but already appears with different tuple element names, as '{2}'.
cs: Rozhraní {0} (prostřednictvím {1}) jde pomocí tohoto rozhraní zdědit jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {2}.
de: Die Schnittstelle "{0}" (über "{1}") kann von dieser Schnittstelle nur ein Mal geerbt werden, wird aber bereits mit anderen Tupelelementnamen als "{2}" angezeigt.
es: La interfaz '{0}' (a través de '{1}') solo se puede heredar una vez por esta interfaz, pero ya aparece con diferentes nombres de elementos de tupla, como '{2}'.
fr: L'interface '{0}' (par l'intermédiaire de '{1}') ne peut être héritée qu'une seule fois par cette interface, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{2}'.
it: L'interfaccia '{0}' (tramite '{1}') può essere ereditata solo una volta da questa interfaccia, ma è già presente con nomi di elementi di tupla diversi, come '{2}'.
ja: インターフェイス '{0}' ('{1}' 経由) は、このインターフェイスによって 1 回のみ継承できますが、異なるタプル要素名で、'{2}' として既に存在しています。
ko: '{0}' 인터페이스는 '{1}'을(를) 통해 이 인터페이스에서 한 번만 상속될 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{2}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” (poprzez „{1}”) można odziedziczyć tylko raz według tego interfejsu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{2}”.
pt_br: A interface '{0}' (via '{1}') pode ser herdada somente uma vez por esta interface, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{2}'.
ru: Интерфейс "{0}" (реализован через "{1}") может быть унаследован этим интерфейсом только один раз, но уже существует с другими именами элементов кортежа как "{2}".
tr: '{0}' arabirimi ('{1}' aracılığıyla) bu arabirim tarafından yalnızca bir kez devralınabilir, ancak '{2}' olarak farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此接口继承一次(通过“{1}”)，但已显示有不同的元组元素名称，如“{2}”。
zh_hant: 此介面只可繼承介面 '{0}' 一次 (經由 '{1}')，但卻已有不同的 Tuple 項目名稱 ('{2}')。

# ERR_InterfaceInheritedTwiceWithDifferentTupleNames4
source: Interface '{0}' (via '{1}') can be inherited only once by this interface, but already appears with different tuple element names, as '{2}' (via '{3}').
cs: Rozhraní {0} (prostřednictvím {1}) jde pomocí tohoto rozhraní zdědit jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {2} (prostřednictvím {3}).
de: Die Schnittstelle "{0}" (über "{1}") kann von dieser Schnittstelle nur ein Mal geerbt werden, wird aber bereits mit anderen Tupelelementnamen als "{2}" über "{3}" angezeigt.
es: La interfaz '{0}' (a través de '{1}') solo se puede heredar una vez por esta interfaz, pero ya aparece con diferentes nombres de elementos de tupla, como '{2}' (a través de '{3}').
fr: L'interface '{0}' (par l'intermédiaire de '{1}') ne peut être héritée qu'une seule fois par cette interface, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{2}' (par l'intermédiaire de '{3}').
it: L'interfaccia '{0}' (tramite '{1}') può essere ereditata solo una volta da questa interfaccia, ma è già presente con nomi di elementi di tupla diversi, come '{2}' (tramite '{3}').
ja: インターフェイス '{0}' ('{1}' 経由) は、このインターフェイスによって 1 回のみ継承できますが、異なるタプル要素名で、'{2}' として既に存在しています ('{3}' 経由)。
ko: '{0}' 인터페이스는 '{1}'을(를) 통해 이 인터페이스에서 한 번만 상속될 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{3}'을(를) 통해 '{2}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” (poprzez „{1}”) można odziedziczyć tylko raz według tego interfejsu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{2}” (poprzez „{3}”).
pt_br: A interface '{0}' (via '{1}') pode ser herdada somente uma vez por esta interface, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{2}' (via '{3}').
ru: Интерфейс "{0}" (реализован через "{1}") может быть унаследован этим интерфейсом только один раз, но уже существует с другими именами элементов кортежа как "{2}" (реализован через "{3}").
tr: '{0}' arabirimi ('{1}' aracılığıyla) bu arabirim tarafından yalnızca bir kez devralınabilir, ancak '{2}' olarak ('{3}' aracılığıyla) farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此接口继承一次(通过“{1}”)，但已显示有不同的元组元素名称，如“{2}”(通过“{3}”)。
zh_hant: 此介面只可繼承介面 '{0}' 一次 (經由 '{1}')，但卻已有不同的 Tuple 項目名稱 ('{2}'，經由 '{3}')。

# ERR_InterfaceNotImplemented1
source: Interface '{0}' is not implemented by this class.
cs: Rozhraní {0} se touto třídou neimplementuje.
de: Die Schnittstelle "{0}" wird nicht von dieser Klasse implementiert.
es: Esta clase no ha implementado la interfaz '{0}' .
fr: L'interface '{0}' n'est pas implémentée par cette classe.
it: L'interfaccia '{0}' non è implementata da questa classe.
ja: インターフェイス '{0}' は、このクラスによって実装されていません。
ko: '{0}' 인터페이스가 이 클래스에서 구현되지 않았습니다.
pl: Interfejs „{0}” nie jest implementowany przez tę klasę.
pt_br: Interface "{0}" não está implementada por esta classe.
ru: Интерфейс "{0}" в данном классе не реализован.
tr: '{0}' arabirimi bu sınıf tarafından uygulanamaz.
zh_hans: 接口“{0}”不是由此类实现的。
zh_hant: 介面 '{0}' 尚未由此類別實作。

# ERR_AmbiguousImplementsMember3
source: '{0}' exists in multiple base interfaces. Use the name of the interface that declares '{0}' in the 'Implements' clause instead of the name of the derived interface.
cs: 'Člen {0} existuje v několika základních rozhraních. Místo názvu odvozeného rozhraní použijte název rozhraní, které deklaruje člen {0} v klauzuli Implements.
de: '"{0}" ist in mehreren Basisschnittstellen vorhanden. Verwenden Sie in der Implements-Klausel den Namen der Schnittstelle, die "{0}" deklariert, und nicht den Namen der abgeleiteten Schnittstelle.
es: '{0}' existe en varias interfaces base. Use el nombre de la interfaz que declara '{0}' en la cláusula 'Implements' en lugar del nombre de la interfaz derivada.
fr: '{0}' existe dans plusieurs interfaces de base. Utilisez le nom de l'interface qui déclare '{0}' dans la clause 'Implements' au lieu du nom de l'interface dérivée.
it: '{0}' esiste in più interfacce di base. Usare il nome dell'interfaccia che dichiara '{0}' nella clausola 'Implements' invece del nome dell'interfaccia derivata.
ja: '{0}' は、複数の基底インターフェイスに存在します。派生インターフェイスの名前ではなく、'Implements' 句で '{0}' を宣言するインターフェイスの名前を使用してください。
ko: '{0}'이(가) 여러 기본 인터페이스에 있습니다. 파생 인터페이스 이름 대신 'Implements' 절에서 '{0}'을(를) 선언하는 인터페이스 이름을 사용하세요.
pl: 'Element „{0}” istnieje w wielu interfejsach podstawowych. Użyj nazwy interfejsu deklarującego element „{0}” w klauzuli „Implements” zamiast nazwy interfejsu pochodnego.
pt_br: '{0}' existe em várias interfaces base. Use o nome da interface que declara ‘{0}' na cláusula 'Implements' em vez do nome da interface derivada.
ru: "{0}" существует в нескольких базовых интерфейсах. Используйте имя данного интерфейса, которое объявляет "{0}" в предложении "Implements", а не имя производного интерфейса.
tr: '{0}' birden fazla temel arabirimde bulunuyor. Türetilen arabirimin adı yerine 'Implements' yan tümcesinde '{0}' bildiren arabirimin adını kullanın.
zh_hans: '“{0}”存在于多个基接口中。请使用在“Implements”子句中声明“{0}”的接口的名称，而不要使用派生接口的名称。
zh_hant: '{0}' 存在於多個基底介面中。請使用 'Implements' 子句中宣告 '{0}' 的介面名稱，來取代衍生介面的名稱。

# ERR_ImplementsOnNew
source: 'Sub New' cannot implement interface members.
cs: 'Procedura Sub New nemůže implementovat členy rozhraní.
de: '"Sub New" kann keine Schnittstellenmember implementieren.
es: 'Sub New' no puede implementar miembros de interfaz.
fr: 'Sub New' ne peut pas implémenter des membres d'interface.
it: 'Sub New' non può implementare i membri di interfaccia.
ja: 'Sub New' はインターフェイス メンバーを実装できません。
ko: 'Sub New'는 인터페이스 멤버를 구현할 수 없습니다.
pl: 'Element Sub New nie może implementować składowych interfejsu.
pt_br: 'Sub New' não pode implementar membros de interface.
ru: '"Sub New" не может содержать реализации членов интерфейса.
tr: 'Sub New', arabirim üyelerini uygulayamaz.
zh_hans: '“Sub New”无法实现接口成员。
zh_hant: 'Sub New' 無法實作介面成員。

# ERR_ArrayInitInStruct
source: Arrays declared as structure members cannot be declared with an initial size.
cs: U polí deklarovaných jako členy struktury nejde deklarovat počáteční velikost.
de: Arrays, die als Strukturmember deklariert sind, können nicht mit einer vorgegebenen Größe definiert werden.
es: Las matrices declaradas como miembros de estructura no se pueden declarar con un tamaño inicial.
fr: Les tableaux déclarés en tant que membres de structures ne peuvent pas être déclarés avec une taille initiale.
it: Le matrici dichiarate come membri di struttura non possono essere dichiarate con una dimensione iniziale.
ja: 構造体メンバーとして宣言される配列に初期サイズを指定することはできません。
ko: 구조체 멤버로 선언된 배열은 초기 크기로 선언할 수 없습니다.
pl: Tablice deklarowane jako składowe struktur nie mogą być deklarowane z rozmiarem początkowym.
pt_br: Matrizes declaradas como membros de estruturas não podem ser declaradas com um tamanho inicial.
ru: Массивы, объявляемые как члены структуры, не могут объявляться с начальным размером.
tr: Yapı üyesi olarak bildirilen diziler için ilk boyut bildirilemez.
zh_hans: 声明为结构成员的数组不能用初始大小声明。
zh_hant: 宣告為結構成員的陣列無法以初始大小宣告。

# ERR_EventTypeNotDelegate
source: Events declared with an 'As' clause must have a delegate type.
cs: Události deklarované s klauzulí As musí obsahovat typ delegáta.
de: Ereignisse, die mit einer As-Klausel deklariert wurden, müssen einen Delegattyp haben.
es: Los eventos declarados con una cláusula 'As' deben tener un tipo delegado.
fr: Les événements déclarés avec une clause 'As' doivent avoir un type délégué.
it: Gli eventi dichiarati con una clausola 'As' devono avere un tipo delegato.
ja: As' 句を伴って宣言されたイベントには、デリゲート型を指定しなければなりません。
ko: As' 절로 선언된 이벤트에는 대리자 형식을 지정해야 합니다.
pl: Zdarzenia deklarowane z klauzulą „As” muszą mieć typ delegata.
pt_br: Eventos declarados com uma cláusula 'As' devem possuir um tipo delegado.
ru: События, объявляемые с помощью предложения "As", должны иметь тип делегата.
tr: As' yan tümcesiyle bildirilen olaylar temsilci türünde olmalıdır.
zh_hans: 用 "As" 子句声明的事件必须有委托类型。
zh_hant: 使用 'As' 子句宣告的事件必須有委派類型。

# ERR_ProtectedTypeOutsideClass
source: Protected types can only be declared inside of a class.
cs: Chráněné typy jde deklarovat jenom uvnitř třídy.
de: Geschützte Typen können nur innerhalb einer Klasse deklariert werden.
es: Los tipos protegidos solo se pueden declarar dentro de una clase.
fr: Les types protégés ne peuvent être déclarés qu'à l'intérieur d'une classe.
it: I tipi protetti possono essere dichiarati solo all'interno di una classe.
ja: Protected 型はクラスの内部でのみ宣言できます。
ko: Protected 형식은 클래스 내부에서만 선언할 수 있습니다.
pl: Typy chronione mogą być deklarowane tylko wewnątrz klasy.
pt_br: Tipos protegidos só podem ser declarados dentro de uma classe.
ru: Защищенные типы могут объявляться только в теле класса.
tr: Korunan türler yalnızca bir sınıf içinde bildirilebilir.
zh_hans: 受保护的类型只能在类内部声明。
zh_hant: 只可以在類別內宣告 Protected 類型。

# ERR_DefaultPropertyWithNoParams
source: Properties with no required parameters cannot be declared 'Default'.
cs: Pro vlastnosti bez požadovaných parametrů nejde použít deklaraci Default
de: Eigenschaften ohne erforderliche Parameter können nicht als "Default" deklariert werden.
es: Las propiedades sin parámetros obligatorios no se pueden declarar como 'Default'.
fr: Les propriétés sans paramètre requis ne peuvent pas être déclarées 'Default'.
it: Le proprietà senza parametri obbligatori non possono essere dichiarate come 'Default'.
ja: 必要なパラメーターを持たないプロパティを、'Default' として宣言することはできません。
ko: 필요한 매개 변수가 없는 속성은 'Default'로 선언할 수 없습니다.
pl: Właściwości bez żadnych wymaganych parametrów nie mogą być deklarowane jako Default.
pt_br: Propriedades sem parâmetros requeridos não podem ser declaradas 'Default'.
ru: Свойства без обязательных параметров не могут объявляться как "Default".
tr: Zorunlu parametre içermeyen özellikler 'Default' olarak bildirilemez.
zh_hans: 不带必选参数的属性不能声明为“Default”。
zh_hant: 沒有必要參數的屬性不可以宣告為 'Default'。

# ERR_InitializerInStruct
source: Initializers on structure members are valid only for 'Shared' members and constants.
cs: Inicializátory členů struktur jsou platné jenom pro členy Shared a konstanty.
de: Initialisierer für Strukturmember sind nur für Shared-Member und -Konstanten gültig.
es: Los inicializadores en miembros de estructura solo son válidos para las constantes y los miembros 'Shared'.
fr: Les initialiseurs pour les membres de structure ne sont valides que pour les membres et constantes 'Shared'.
it: Gli inizializzatori dei membri di struttura sono validi solo per costanti e membri 'Shared'.
ja: 構造体メンバーの初期化子は、'Shared' メンバーと定数にのみ有効です。
ko: 구조체 멤버의 이니셜라이저는 'Shared' 멤버 및 상수에만 사용할 수 있습니다.
pl: Inicjatory w składowych struktur są prawidłowe tylko w przypadku wartości stałych i składowych „Shared”.
pt_br: Inicializadores em membros de estrutura só são válidos para membros e constantes 'Shared'.
ru: Инициализаторы членов структур допустимы только для членов "Shared" и констант.
tr: Yapı üyeleri üzerindeki başlatıcılar yalnızca 'Shared' olan üyeler ve sabitler için geçerlidir.
zh_hans: 结构成员上的初始值设定项仅对“Shared”成员和常量有效。
zh_hant: 結構成員上的初始設定式只有對 'Shared' 成員和常數有效。
