Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoSuitableWidestType1
source: Type of '{0}' cannot be inferred because the loop bounds and the step clause do not convert to the same type.
cs: Typ {0} nejde odvodit, protože omezení cyklu a klauzuli kroku nejde převést na stejný typ.
de: Der Typ von "{0}" kann nicht per Rückschluss abgeleitet werden, da die Schleifenbegrenzungen und die step-Klausel nicht in denselben Typ konvertiert werden.
es: No se puede inferir el tipo de '{0}' porque los límites del bucle y la cláusula step no se convierten en el mismo tipo.
fr: Le type de '{0}' ne peut pas être déduit, car les limites de la boucle et la clause step ne sont pas converties en un même type.
it: Non è possibile dedurre il tipo di '{0}' perché i limiti del ciclo e la clausola STEP non eseguono la conversione nello stesso tipo.
ja: ループの境界とステップの句が同じ型に変換されないため、'{0}' の型を推論できません。
ko: 루프 범위와 단계 절은 같은 형식으로 변환할 수 없으므로 '{0}' 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu elementu „{0}”, ponieważ granice pętli i klauzula step nie są konwertowane na ten sam typ.
pt_br: Tipo de "{0}" não pode ser inferido porque os limites do loop e a cláusula step não convertem para o mesmo tipo.
ru: Невозможно получить тип "{0}", так как границы цикла и выражение шага не преобразуют в тот же тип.
tr: Döngü sınırları ve step yan tümcesi aynı türe dönüştürülemediğinden '{0}' türü çıkarsanamıyor.
zh_hans: 无法推断“{0}”的类型，因为循环边界和 step 子句不会转换为同一类型。
zh_hant: 因為迴圈繫結和 step 子句不會轉換成相同類型，所以無法推斷 '{0}' 的類型。

# ERR_AmbiguousWidestType3
source: Type of '{0}' is ambiguous because the loop bounds and the step clause do not convert to the same type.
cs: Typ {0} je nejednoznačný, protože omezení cyklu a klauzuli kroku nejde převést na stejný typ.
de: Der Typ von "{0}" ist mehrdeutig, weil die Schleifenbegrenzungen und die step-Klausel nicht in denselben Typ konvertiert werden.
es: El tipo de '{0}' es ambiguo porque los límites del bucle y la cláusula step no se convierten en el mismo tipo.
fr: Le type de '{0}' est ambigu, car les limites de la boucle et la clause step ne sont pas converties dans un type identique.
it: '{0}' è di tipo ambiguo perché i limiti del ciclo e la clausola step non eseguono la conversione nello stesso tipo.
ja: ループの境界とステップの句が同じ型に変換されないため、'{0}' の型があいまいです。
ko: 루프 범위와 단계 절은 같은 형식으로 변환되지 않아 '{0}' 형식이 모호합니다.
pl: Typ „{0}” jest niejednoznaczny, ponieważ granice pętli i klauzula step nie są konwertowane na ten sam typ.
pt_br: Tipo de "{0}" é ambíguo porque os limites do loop e a cláusula step não convertem para o mesmo tipo.
ru: Тип "{0}" неоднозначен, так как привязки цикла и выражение шага не преобразуются в один тип.
tr: Döngü sınırları ve step yan tümcesi aynı türe dönüştürülmediğinden, '{0}' türü belirsiz.
zh_hans: “{0}”的类型不明确，因为循环边界和 step 子句不会转换为同一类型。
zh_hant: 類型 '{0}' 模稜兩可，因為迴圈繫結和 step 子句不會轉換成相同的類型。

# ERR_ExpectedAssignmentOperatorInInit
source: '=' expected (object initializer).
cs: 'Očekával se znak = (inicializátor objektu).
de: '"=" erwartet (Objektinitialisierer).
es: 'Se esperaba '=' (inicializador de objeto).
fr: '=' attendu (initialiseur d'objet).
it: 'È previsto '=' (inizializzatore di oggetto).
ja: '=' が必要です (オブジェクト初期化子)。
ko: '='가 필요합니다(개체 이니셜라이저).
pl: 'Oczekiwano znaku „=” (inicjator obiektów).
pt_br: '=' esperado (inicializador de objeto).
ru: 'Ожидается "=" (инициализатор объекта).
tr: '=' bekleniyor (nesne başlatıcısı).
zh_hans: '应为 "="(对象初始值设定项)。
zh_hant: '必須是 '=' (物件初始設定式)。

# ERR_ExpectedQualifiedNameInInit
source: Name of field or property being initialized in an object initializer must start with '.'.
cs: Názvy polí a vlastností inicializovaných v inicializátoru objektu musí začínat tečkou (.).
de: Der Name des Felds oder der Eigenschaft, das bzw. die in einem Objektinitialisierer initialisiert wird, muss mit "." beginnen.
es: El nombre de un campo o una propiedad que se va a inicializar en un inicializador de objeto debe comenzar con '.'.
fr: Le nom du champ ou de la propriété initialisé dans un initialiseur d'objet doit commencer par '.'.
it: Il nome di un campo o di una proprietà inizializzato in un inizializzatore di oggetti deve iniziare con '.'.
ja: オブジェクト初期化子で初期化されるフィールドまたはプロパティの名前は、'.' で始まらなければなりません。
ko: 개체 이니셜라이저에서 초기화되는 필드 또는 속성 이름은 '.'으로 시작해야 합니다.
pl: Nazwa pola lub właściwości inicjowanej w inicjatorze obiektów musi zaczynać się od znaku „.”.
pt_br: Nome do campo ou propriedade sendo inicializado em um inicializador de objeto deve começar com '.'.
ru: Имя поля или свойства, которое инициализируется с помощью инициализатора объектов, должно начинаться с ".".
tr: Nesne başlatıcısında başlatılmakta olan alanın veya özelliğin adı '.' ile başlamalıdır.
zh_hans: 正在对象初始值设定项中初始化的字段或属性的名称必须以 "."开头。
zh_hant: 在物件初始設定式中初始化的欄位或屬性，其名稱開頭必須是 '.'。

# ERR_ExpectedLbrace
source: '{' expected.
cs: 'Očekával se znak {.
de: '"{" erwartet.
es: 'Se esperaba '{'.
fr: '{' attendue.
it: 'È previsto il segno '{'.
ja: '{' が必要です。
ko: '{'가 필요합니다.
pl: 'Oczekiwano znaku „{”.
pt_br: '{' esperado.
ru: 'Требуется "{".
tr: '{' bekleniyor.
zh_hans: '应为 "{"。
zh_hant: '必須是 '{'。

# ERR_UnrecognizedTypeOrWith
source: Type or 'With' expected.
cs: Očekával se typ nebo klíčové slovo With.
de: Typ oder "With" erwartet.
es: Se esperaba un tipo o 'With'.
fr: Type ou 'With' attendu.
it: È previsto il tipo o 'With'.
ja: 型または 'With' が必要です。
ko: 형식 또는 'With'가 필요합니다.
pl: Oczekiwano typu lub instrukcji „With”.
pt_br: Tipo ou 'With' esperado.
ru: Требуется тип или "With".
tr: Tür veya 'With' bekleniyor.
zh_hans: 应为类型或 "With"。
zh_hant: 必須是類型或 'With'。

# ERR_DuplicateAggrMemberInit1
source: Multiple initializations of '{0}'. Fields and properties can be initialized only once in an object initializer expression.
cs: Vícenásobná inicializace prvku {0}. Pole a vlastnosti jde ve výrazu inicializátoru objektu inicializovat jen jednou.
de: Mehrfache Initialisierungen von "{0}". Felder und Eigenschaften können in einem Objektinitialisiererausdruck nur einmal initialisiert werden.
es: Hay varias inicializaciones de '{0}'. Los campos y las propiedades solo se pueden inicializar una vez en una expresión de inicializador de objeto.
fr: Plusieurs initialisations de '{0}'. Les champs et les propriétés ne peuvent être initialisés qu'une seule fois dans une expression d'initialiseur d'objet.
it: Sono presenti più inizializzazioni di '{0}'. I campi e le proprietà possono essere inizializzati solo se presenti in un'espressione dell'inizializzatore di oggetti.
ja: '{0}' を複数回初期化しています。フィールドまたはプロパティは、オブジェクト初期化子式で複数回初期化することはできません。
ko: '{0}'을(를) 여러 번 초기화했습니다. 개체 이니셜라이저 식에서 필드와 속성은 한 번만 초기화할 수 있습니다.
pl: Wiele operacji inicjowania elementu „{0}”. W wyrażeniu inicjatora obiektów pola i właściwości mogą być inicjowane tylko raz.
pt_br: Várias inicializações de "{0}". Campos e propriedades podem ser inicializadas somente uma vez em uma expressão de inicializador de objeto.
ru: Несколько инициализаций "{0}". Поля и свойства можно инициализировать только один раз в выражении инициализатора объекта.
tr: '{0}' birden çok kez başlatıldı. Nesne başlatıcısı ifadesinde alanlar ve özellikler tek bir kez başlatılabilir.
zh_hans: 多次初始化“{0}”的。字段和属性只能在对象初始值设定项表达式中初始化一次。
zh_hant: '{0}' 的多個初始設定。欄位和屬性只能在一個物件初始設定式運算式中初始化一次。

# ERR_NonFieldPropertyAggrMemberInit1
source: Member '{0}' cannot be initialized in an object initializer expression because it is not a field or property.
cs: Člen {0} nejde inicializovat ve výrazu inicializátoru objektu, protože se nejedná o pole ani vlastnost.
de: Der Member "{0}" kann nicht in einem Objektinitialisiererausdruck initialisiert werden, da er kein Feld und keine Eigenschaft ist.
es: No se puede inicializar el miembro '{0}' en una expresión de inicializador de objeto porque no es un campo ni una propiedad.
fr: Le membre '{0}' ne peut pas être initialisé dans une expression d'initialiseur d'objet, car il ne s'agit pas d'un champ ou d'une propriété.
it: Non è possibile inizializzare il membro '{0}' in un'espressione dell'inizializzatore di oggetti perché non è un campo o una proprietà.
ja: メンバー '{0}' はフィールドまたはプロパティではないため、オブジェクト初期化子式で初期化できません。
ko: '{0}' 멤버는 필드 또는 속성이 아니므로 개체 이니셜라이저 식에서 초기화할 수 없습니다.
pl: Nie można zainicjować składowej „{0}” w wyrażeniu inicjatora obiektów, ponieważ nie jest ona polem ani właściwością.
pt_br: Membro "{0}" não pode ser inicializado em uma expressão de inicializador de objeto porque não é um campo ou propriedade.
ru: Член "{0}" не может быть инициализирован в выражении инициализатора объекта, так как он не является полем или свойством.
tr: Bir alan veya özellik olmadığından, nesne başlatıcısı ifadesinde '{0}' üyesi başlatılamıyor.
zh_hans: 无法在对象初始值设定项表达式中初始化成员“{0}”，因为它不是一个字段或属性。
zh_hant: 成員 '{0}' 因為不是欄位或屬性，所以無法在物件初始設定式運算式中進行初始化。

# ERR_SharedMemberAggrMemberInit1
source: Member '{0}' cannot be initialized in an object initializer expression because it is shared.
cs: Člen {0} nejde inicializovat ve výrazu inicializátoru objektu, protože je sdílený.
de: Der Member "{0}" kann nicht in einem Objektinitialisiererausdruck initialisiert werden, da er freigegeben ist.
es: No se puede inicializar el miembro '{0}' en una expresión de inicializador de objeto porque está compartido.
fr: Le membre '{0}' ne peut pas être initialisé dans une expression d'initialiseur d'objet, car il est partagé.
it: Non è possibile inizializzare il membro '{0}' in un'espressione dell'inizializzatore di oggetti perché è condiviso.
ja: メンバー '{0}' は共有されているため、オブジェクト初期化子式で初期化できません。
ko: '{0}' 멤버를 공유하고 있으므로 개체 이니셜라이저 식에서 초기화할 수 없습니다.
pl: Nie można zainicjować składowej „{0}” w wyrażeniu inicjatora obiektów, ponieważ jest ona udostępniona.
pt_br: Membro "{0}" não pode ser inicializado em uma expressão de inicializador de objeto porque ele é compartilhado.
ru: Член "{0}" не может быть инициализирован в выражении инициализатора объекта, потому что он является общим.
tr: '{0}' üyesi paylaşıldığından bu üye nesne başlatıcısı ifadesinde başlatılamıyor.
zh_hans: 无法在对象初始值设定项表达式中初始化成员“{0}”，因为它是共享的。
zh_hant: 因為成員 '{0}' 為共用成員，所以無法在物件初始設定式運算式中進行初始化。

# ERR_ParameterizedPropertyInAggrInit1
source: Property '{0}' cannot be initialized in an object initializer expression because it requires arguments.
cs: Vlastnost {0} nejde inicializovat ve výrazu inicializátoru objektu, protože vyžaduje argumenty.
de: Die {0}-Eigenschaft kann nicht in einem Objektinitialisiererausdruck initialisiert werden, da sie Argumente erfordert.
es: No se puede inicializar la propiedad '{0}' en una expresión de inicializador de objeto porque requiere argumentos.
fr: La propriété '{0}' ne peut pas être initialisée dans une expression d'initialiseur d'objet, car elle requiert des arguments.
it: Non è possibile inizializzare la proprietà '{0}' in un'espressione dell'inizializzatore di oggetto perché richiede che vengano specificati gli argomenti.
ja: プロパティ '{0}' には引数が必要なため、オブジェクト初期化子式で初期化できません。
ko: 인수가 필요하므로 개체 이니셜라이저 식에서 '{0}' 속성을 초기화할 수 없습니다.
pl: Nie można zainicjować właściwości „{0}” w wyrażeniu inicjatora obiektów, ponieważ wymaga ona argumentów.
pt_br: Propriedade "{0}" não pode ser inicializada em uma expressão de inicializador de objeto porque todas as sobrecargas acessíveis requerem argumentos.
ru: Свойство "{0}" нельзя инициализировать в выражении инициализатора объекта, так как оно требует использования аргументов.
tr: Bağımsız değişkenler gerektirdiğinden, nesne başlatıcısı ifadesinde '{0}' özelliği başlatılamıyor.
zh_hans: 无法在对象初始值设定项表达式中初始化属性“{0}”，因为它需要参数。
zh_hant: 因為屬性 '{0}' 需要有引數，所以無法在物件初始設定式運算式中進行初始化。

# ERR_NoZeroCountArgumentInitCandidates1
source: Property '{0}' cannot be initialized in an object initializer expression because all accessible overloads require arguments.
cs: Vlastnost {0} nejde inicializovat ve výrazu inicializátoru objektu, protože všechna dostupná přetížení vyžadují argumenty.
de: Die {0}-Eigenschaft kann nicht in einem Objektinitialisiererausdruck initialisiert werden, da alle Überladungen, auf die zugegriffen werden kann, Argumente erfordern.
es: No se puede inicializar la propiedad '{0}' en una expresión de inicializador de objeto porque todas las sobrecargas accesibles requieren argumentos.
fr: La propriété '{0}' ne peut pas être initialisée dans une expression d'initialiseur d'objet, car toutes les surcharges accessibles nécessitent des arguments.
it: Non è possibile inizializzare la proprietà '{0}' in un'espressione dell'inizializzatore di oggetto. Tutti gli overload accessibili richiedono argomenti.
ja: アクセス可能なすべてのオーバーロードには引数が必要なため、プロパティ '{0}' はオブジェクト初期化子式で初期化できません。
ko: 액세스 가능한 모든 오버로드에 인수가 필요하므로 개체 이니셜라이저 식에서 '{0}' 속성을 초기화할 수 없습니다.
pl: Nie można zainicjować właściwości „{0}” w wyrażeniu inicjatora obiektów, ponieważ wszystkie dostępne przeciążenia wymagają argumentów.
pt_br: Propriedade "{0}" não pode ser inicializada em uma expressão de inicializador de objeto porque todas as sobrecargas acessíveis requerem argumentos.
ru: Свойство "{0}" не может быть инициализировано в выражении инициализатора объекта, так как все перегрузки требуют использования аргументов.
tr: Tüm erişilebilir aşırı yükler için bağımsız değişkenler gerektiğinden, nesne başlatıcısı ifadesinde '{0}' özelliği başlatılamıyor.
zh_hans: 无法在对象初始值设定项表达式中初始化属性“{0}”，因为所有可访问的重载都需要参数。
zh_hant: 因為所有可存取的多載都需要有引數，所以屬性 '{0}' 無法在物件初始設定式運算式中進行初始化。

# ERR_AggrInitInvalidForObject
source: Object initializer syntax cannot be used to initialize an instance of 'System.Object'.
cs: K inicializaci instance typu System.Object nejde použít syntaxi inicializátoru objektu.
de: Die Syntax des Objektinitialisierers kann nicht zum Initialisieren einer Instanz von "System.Object" verwendet werden.
es: No se puede usar la sintaxis de inicializador de objetos para inicializar una instancia de 'System.Object'.
fr: La syntaxe de l'initialiseur d'objet ne peut pas être utilisée pour initialiser une instance de 'System.Object'.
it: Non è possibile usare la sintassi dell'inizializzatore di oggetto per inizializzare un'istanza di 'System.Object'.
ja: オブジェクト初期化子の構文は、'System.Object' のインスタンスの初期化には使用できません。
ko: 개체 이니셜라이저 구문은 'System.Object'의 인스턴스를 초기화하는 데 사용할 수 없습니다.
pl: Nie można użyć składni inicjatora obiektów do zainicjowania wystąpienia obiektu System.Object.
pt_br: Não é possível utilizar a sintaxe de inicialização de objeto para inicializar uma instância de 'System.Object'.
ru: Синтаксис инициализатора объектов нельзя применять для инициализации экземпляра "System.Object".
tr: Nesne başlatıcısı söz dizimi bir 'System.Object' örneği başlatmak için kullanılamaz.
zh_hans: 不能使用对象初始值设定项语法初始化“System.Object”的实例。
zh_hant: 物件初始設定式語法無法用來初始化 'System.Object' 的執行個體。

# ERR_InitializerExpected
source: Initializer expected.
cs: Očekával se inicializátor.
de: Initialisierer erwartet.
es: Se esperaba un inicializador.
fr: Initialiseur attendu.
it: È previsto l'inizializzatore.
ja: 初期化子が必要です。
ko: 이니셜라이저가 필요합니다.
pl: Oczekiwano inicjatora.
pt_br: Inicializador esperado.
ru: Требуется инициализатор.
tr: Başlatıcı bekleniyor.
zh_hans: 应为初始值设定项。
zh_hant: 必須是初始設定式。

# ERR_LineContWithCommentOrNoPrecSpace
source: The line continuation character '_' must be preceded by at least one white space and it must be followed by a comment or the '_' must be the last character on the line.
cs: Před znakem pro pokračování řádku _ musí předcházet alespoň jeden prázdný znak a po něm musí následovat komentář nebo posledním znakem na řádku musí být _.
de: Dem Zeilenfortsetzungszeichen "_" muss mindestens ein Leerzeichen vorangestellt sein und ein Kommentar folgen, oder "_" muss das letzte Zeichen in der Zeile sein.
es: El carácter de continuación de línea "_ " debe ir precedido de al menos un espacio en blanco y debe ir seguido de un comentario o " _" debe ser el último carácter de la línea.
fr: Le caractère de continuation de ligne '_' doit être précédé d'au moins un espace blanc et être suivi d'un commentaire. Sinon, '_' doit être le dernier caractère de la ligne.
it: Il carattere di continuazione di riga '_' deve essere preceduto da almeno uno spazio vuoto e deve essere seguito da un commento oppure il carattere '_' deve essere ultimo carattere della riga.
ja: 行連結文字 ' _ ' の前には少なくとも 1 つの空白を指定する必要があります。その後にコメントを続けるか、' _ ' を行の最後の文字にしなければなりません。
ko: 줄 연속 문자 '_'은 앞에 공백이 하나 이상 있어야 하며, 뒤에 주석이 오거나 '_'이 줄의 마지막 문자여야 합니다.
pl: Znak kontynuacji wiersza „_” musi być poprzedzony co najmniej jednym białym znakiem i musi po nim następować komentarz lub znak „_” musi być ostatnim w wierszu.
pt_br: O caractere de continuação de linha '_' precisa ser precedido por pelo menos um espaço em branco e seguido por um comentário ou ser o último caractere da linha.
ru: Перед символом продолжения строки "_" должен стоять по меньшей мере один пробел, а после этого символа должен идти комментарий, либо "_" должен быть последним символом в строке.
tr: Satır devamı karakterinin ('_') öncesinde en az bir boşluk olması gerekir ve bu karakterin ardından bir açıklama gelmeli veya satırdaki son karakter '_' olmalıdır.
zh_hans: 行继续符 "_" 前面必须至少有一个空格，且其后必须有注释或 "_" 必须是该行的最后一个字符。
zh_hant: 行接續字元 '_' 前面必須至少有一個空白字元，後面必須接著註解，否則 '_' 必須是該行的最後一個字元。

# ERR_BadModuleFile1
source: Unable to load module file '{0}': {1}
cs: Nepodařilo se načíst soubor modulu {0}: {1}.
de: Moduldatei "{0}" konnte nicht geladen werden: {1}
es: No se puede cargar el archivo de módulo '{0}': {1}
fr: Impossible de charger le fichier de module '{0}' : {1}
it: Non è possibile aprire il file di modulo '{0}': {1}
ja: モジュール ファイル '{0}' を読み込めません: {1}
ko: '{0}' 모듈 파일을 로드할 수 없습니다({1}).
pl: Nie można załadować pliku modułu „{0}”: {1}
pt_br: Não é possível carregar o arquivo de módulo "{0}": {1}
ru: Не удалось загрузить файл модуля "{0}": {1}
tr: '{0}' modül dosyası yüklenemedi: {1}
zh_hans: 无法加载模块文件“{0}”: {1}
zh_hant: 無法載入模組檔 '{0}': {1}

# ERR_BadRefLib1
source: Unable to load referenced library '{0}': {1}
cs: Odkazovanou knihovnu {0} nejde načíst: {1}.
de: Die referenzierte Bibliothek "{0}" konnte nicht geladen werden: {1}
es: No se puede cargar la biblioteca '{0}' a la que se hace referencia: {1}
fr: Impossible de charger la bibliothèque référencée '{0}' : {1}
it: Non è possibile caricare la libreria a cui si fa riferimento '{0}': {1}
ja: 参照ライブラリ '{0}' を読み込めません: {1}
ko: 참조된 라이브러리('{0}')를 로드할 수 없습니다({1}).
pl: Nie można załadować określonej w odwołaniu biblioteki „{0}”: {1}
pt_br: Não é possível carregar a biblioteca referenciada "{0}": {1}
ru: Не удается загрузить указанную библиотеку "{0}": {1}
tr: Başvurulan '{0}' kitaplığı yüklenemedi: {1}
zh_hans: 无法加载引用的库“{0}”: {1}
zh_hant: 無法載入參考的程式庫 '{0}': {1}

# ERR_EventHandlerSignatureIncompatible2
source: Method '{0}' cannot handle event '{1}' because they do not have a compatible signature.
cs: Metoda {0} nemůže zpracovávat událost {1}, protože jejich podpisy nejsou kompatibilní.
de: Die {0}-Methode kann das {1}-Ereignis nicht behandeln, da die Signaturen inkompatibel sind.
es: El método '{0}' no puede controlar el evento '{1}' porque no tienen una firma compatible.
fr: La méthode '{0}' ne peut pas gérer l'événement '{1}', car sa signature n'est pas compatible.
it: Il metodo '{0}' non può gestire l'evento '{1}' perché non ha una firma compatibile.
ja: メソッド '{0}' でイベント '{1}' を処理できません。シグネチャに互換性がありません。
ko: '{0}' 메서드에 호환되는 시그니처가 없으므로 '{1}' 이벤트를 처리할 수 없습니다.
pl: Metoda „{0}” nie może obsłużyć zdarzenia „{1}”, ponieważ metoda i zdarzenie nie mają zgodnej sygnatury.
pt_br: Método "{0}" não pode manipular o evento "{1}" porque eles não têm uma assinatura compatível.
ru: Методу "{0}" не удается обработать событие "{1}", поскольку они не содержат совместимую сигнатуру.
tr: Uyumlu bir imzaları olmadığından, '{0}' yöntemi '{1}' olayını işleyemiyor.
zh_hans: 方法“{0}”无法处理事件“{1}”，因为它们的签名不兼容。
zh_hant: 方法 '{0}' 因為沒有相容的簽章，所以無法處理事件 '{1}'。

# ERR_ConditionalCompilationConstantNotValid
source: Conditional compilation constant '{1}' is not valid: {0}
cs: Konstanta podmíněné kompilace {1} není platná: {0}
de: Die Konstante für bedingte Kompilierung "{1}" ist nicht gültig: {0}.
es: La constante de compilación condicional "{1}" no es válida: {0}
fr: La constante de compilation conditionnelle '{1}' est non valide : {0}
it: La costanti di compilazione condizionale '{1}' non è valida: {0}
ja: 条件付きコンパイル定数 '{1}' が無効です: {0}
ko: 조건부 컴파일 상수 '{1}'이(가) 잘못되었습니다. {0}
pl: Stała kompilacji warunkowej „{1}” jest nieprawidłowa: {0}
pt_br: A constante de compilação condicional '{1}' não é válida: {0}
ru: Константа условной компиляции "{1}" недопустима: {0}
tr: Koşullu derleme sabiti '{1}' geçerli değil: {0}
zh_hans: 条件编译常数“{1}”无效: {0}
zh_hant: 條件式編譯常數 '{1}' 無效: {0}

# ERR_InterfaceImplementedTwice1
source: Interface '{0}' can be implemented only once by this type.
cs: Rozhraní {0} jde pomocí tohoto typu implementovat jenom jednou.
de: Die Schnittstelle "{0}" darf nur einmal von diesem Typ implementiert werden.
es: Este tipo solo puede implementar la interfaz '{0}' una vez.
fr: L'interface '{0}' ne peut être implémentée qu'une seule fois par ce type.
it: L'interfaccia '{0}' può essere implementata solo una volta da questo tipo.
ja: インターフェイス '{0}' は、この型によって 1 回のみ実装できます。
ko: '{0}' 인터페이스는 이 형식으로 한 번만 구현할 수 있습니다.
pl: Interfejs „{0}” może być zaimplementowany przez ten typ tylko raz.
pt_br: Interface "{0}" pode ser implementada somente uma vez por este tipo.
ru: Интерфейс "{0}" может быть реализован этим типом только один раз.
tr: '{0}' arabirimi bu türle tek bir kez uygulanabilir.
zh_hans: 接口“{0}”只能由此类型实现一次。
zh_hant: 介面 '{0}' 只可由此類型實作一次。

# ERR_InterfaceImplementedTwiceWithDifferentTupleNames2
source: Interface '{0}' can be implemented only once by this type, but already appears with different tuple element names, as '{1}'.
cs: Rozhraní {0} jde pomocí tohoto typu implementovat jenom jednou, ale rozhraní se už zobrazuje s jinými názvy elementů řazené kolekce členů jako {1}.
de: Die Schnittstelle "{0}" kann von diesem Typ nur ein Mal implementiert werden, wird aber bereits mit anderen Tupelelementnamen als "{1}" angezeigt.
es: La interfaz '{0}' solo se puede implementar una vez por este tipo, pero ya aparece con diferentes nombres de elementos de tupla, como '{1}'.
fr: L'interface '{0}' ne peut être implémentée qu'une seule fois par ce type, mais elle apparaît déjà avec des noms d'éléments tuples différents, notamment '{1}'.
it: L'interfaccia '{0}' può essere implementata solo una volta da questo tipo, ma è già presente con nomi di elementi di tupla diversi, come '{1}'.
ja: インターフェイス '{0}' は、この型によって 1 回のみ実装できますが、異なるタプル要素名で、'{1}' として既に存在しています。
ko: '{0}' 인터페이스는 이 형식으로 한 번만 구현할 수 있지만 이미 다른 튜플 요소 이름을 사용하여 '{1}'(으)로 표시되어 있습니다.
pl: Interfejs „{0}” można zaimplementować tylko raz według tego typu, lecz występuje już z innymi nazwami elementów krotki, takimi jak „{1}”.
pt_br: A interface '{0}' pode ser implementada somente uma vez por este tipo, mas já aparece com nomes de elementos de tupla diferentes, por exemplo '{1}'.
ru: Интерфейс "{0}" может быть реализован с этим типом только один раз, но уже существует с другими именами элементов кортежа как "{1}".
tr: '{0}' arabirimi bu tür tarafından yalnızca bir kez uygulanabilir, ancak '{1}' olarak farklı demet öğesi adları ile zaten görünüyor.
zh_hans: 接口“{0}”只能通过此类型实现一次，但已显示有不同的元组元素名称，如“{1}”。
zh_hant: 此類型只可在介面 '{0}' 上實作一次，但卻已有不同的 Tuple 項目名稱 ('{1}')。
