Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_IsNotOpRequiresReferenceTypes1
source: 'IsNot' requires operands that have reference types, but this operand has the value type '{0}'.
cs: 'Klíčové slovo IsNot vyžaduje operandy typu odkaz, ale tento operand je typu hodnota {0}.
de: 'IsNot erfordert Operanden mit Referenztypen. Dieser Operand hat jedoch den Werttyp "{0}".
es: 'IsNot' requiere operandos que tengan tipos de referencia, pero este operando tiene el tipo de valor '{0}'.
fr: 'IsNot' requiert des opérandes qui ont des types référence, mais cet opérande a le type valeur '{0}'.
it: 'Gli operandi di 'IsNot' devono avere tipi riferimento, ma questo operando ha tipo di valore {0}.
ja: 'IsNot' には参照型を持つオペランドが必要ですが、このオペランドの値型は '{0}' です。
ko: 'IsNot'의 피연산자는 참조 형식이어야 하는데 이 피연산자의 값 형식은 '{0}'입니다.
pl: 'Element „IsNot” wymaga argumentów operacji, które mają typ referencyjny, ale ten argument operacji ma typ wartości „{0}”.
pt_br: "IsNot" requer operandos que tenham tipos de referência, mas este operando tem o tipo de valor "{0}".
ru: 'Для "IsNot" требуются операнды ссылочных типов, а этот операнд имеет тип значения "{0}".
tr: 'IsNot' için başvuru türleri olan işlenenler gerekiyor, ancak bu işlenenin '{0}' değer türü var.
zh_hans: '“IsNot”要求具有引用类型的操作数,但此操作数的值类型为“{0}”。
zh_hant: 'IsNot' 需要具有參考類型的運算元，但此運算元為實值類型 '{0}'。

# ERR_ClashWithReservedEnumMember1
source: '{0}' conflicts with the reserved member by this name that is implicitly declared in all enums.
cs: '{0} je v konfliktu s vyhrazeným členem podle tohoto názvu, který je implicitně deklarovaný ve všech výčtech.
de: '"{0}" verursacht einen Konflikt mit dem gleichnamigen reservierten Member, der in allen Enumerationen explizit deklariert wurde.
es: '{0}' entra en conflicto con el miembro reservado por este nombre que está declarado implícitamente en todas las enumeraciones.
fr: '{0}' est en conflit avec le membre réservé par ce nom qui est implicitement déclaré dans tous les enums.
it: '{0}' è in conflitto con il membro riservato a causa del nome che è dichiarato in modo implicito in tutte le enumerazioni.
ja: '{0}' は、すべての列挙型で暗黙的に宣言されている、同じ名前の予約メンバーと競合しています。
ko: '{0}'은(는) 모든 열거형에서 암시적으로 선언된 이 이름으로 예약된 멤버와 충돌합니다.
pl: Element „{0}” powoduje konflikt z zastrzeżoną składową o tej nazwie, która została niejawnie zadeklarowana we wszystkich wyliczeniach.
pt_br: "{0}" está em conflito com o membro reservado por este nome que é declarado implicitamente em todos os enums.
ru: "{0}" конфликтует с зарезервированным членом по данному имени, которое явно объявлено во всех перечислениях.
tr: '{0}', tüm sabit listelerinde örtük olarak bildirilen bu ada sahip ayrılmış üyeyle çakışıyor.
zh_hans: '“{0}”与在所有枚举中隐式声明的同名保留成员冲突。
zh_hant: '{0}' 與使用此名稱的保留成員互相衝突，此名稱已在所有列舉中隱含宣告。

# ERR_MultiplyDefinedEnumMember2
source: '{0}' is already declared in this {1}.
cs: 'Název {0} je už deklarovaný v tomto {1}.
de: '"{0}" wurde bereits in dieser {1} deklariert.
es: '{0}' ya está declarado en esta {1}.
fr: '{0}' est déjà déclaré dans ce {1}.
it: '{0}' è già dichiarato in {1}.
ja: '{0}' は、この {1} で既に宣言されています。
ko: '{0}'은(는) 이 {1}에 이미 선언되었습니다.
pl: 'Element „{0}” jest już zadeklarowany w tym elemencie {1}.
pt_br: "{0}" já está declarado neste {1}.
ru: "{0}" уже объявлено в {1}.
tr: '{0}', bu {1} içinde zaten bildirildi.
zh_hans: '此 {1} 中已声明了“{0}”。
zh_hant: '在此 {1} 中已宣告 '{0}'。

# ERR_BadUseOfVoid
source: 'System.Void' can only be used in a GetType expression.
cs: 'Konstrukci System.Void jde použít jenom ve výrazu GetType.
de: '"System.Void" kann nur in einem GetType-Ausdruck verwendet werden.
es: 'System.Void' solo se puede usar en una expresión GetType.
fr: 'System.Void' ne peut être utilisé que dans une expression GetType.
it: 'System.Void' può essere usato solo in un'espressione GetType.
ja: 'System.Void' は、GetType 式でのみ使用できます。
ko: 'System.Void'는 GetType 식에서만 사용할 수 있습니다.
pl: 'Elementu „System.Void” można użyć tylko w wyrażeniu GetType.
pt_br: 'System.Void' só pode ser usado em uma expressão GetType.
ru: 'System.Void можно использовать только в выражении GetType.
tr: 'System.Void' yalnızca bir GetType ifadesinde kullanılabilir.
zh_hans: '“System.Void”只能在 GetType 表达式中使用。
zh_hant: 'System.Void' 只能使用於 GetType 運算式。

# ERR_EventImplMismatch5
source: Event '{0}' cannot implement event '{1}' on interface '{2}' because their delegate types '{3}' and '{4}' do not match.
cs: Událost {0} nemůže implementovat událost {1} v rozhraní {2}, protože se neshodují jejich typy delegátů {3} a {4}.
de: Das {0}-Ereignis kann das {1}-Ereignis für die {2}-Schnittstelle nicht implementieren, da die entsprechenden Delegattypen "{3}" und "{4}" nicht übereinstimmen.
es: El evento '{0}' no puede implementar el evento '{1}' en la interfaz '{2}' porque sus tipos delegados '{3}' y '{4}' no coinciden.
fr: L'événement '{0}' ne peut pas implémenter l'événement '{1}' pour l'interface '{2}', car leurs types délégués '{3}' et '{4}' ne correspondent pas.
it: L'evento '{0}' non può implementare l'evento '{1}' nell'interfaccia '{2}' perché i relativi tipi delegati '{3}' e '{4}' non corrispondono.
ja: デリゲート型 '{3}' および '{4}' が一致しないため、イベント '{0}' はインターフェイス '{2}' 上のイベント '{1}' を実装できません。
ko: 대리자 형식 '{3}'과(와) '{4}'이(가) 일치하지 않으므로 '{0}' 이벤트에서 '{2}' 인터페이스에 대해 '{1}' 이벤트를 구현할 수 없습니다.
pl: Zdarzenie „{0}” nie może implementować zdarzenia „{1}” w interfejsie „{2}”, ponieważ ich typy delegowane „{3}” i „{4}” są niezgodne.
pt_br: Evento "{0}" não pode implementar o evento "{1}" na interface "{2}" porque seus tipos delegados "{3}" e "{4}" não coincidem.
ru: Событию "{0}" не удается реализовать событие "{1}" в интерфейсе "{2}" из-за несовпадения их типов делегатов "{3}" и "{4}".
tr: Temsilci türleri ('{3}' ve '{4}') eşleşmediğinden, '{0}' olayı '{2}' arabirimi üzerinde '{1}' olayını uygulayamıyor.
zh_hans: 事件“{0}”无法实现接口“{2}”上的事件“{1}”，因为其委托类型“{3}”和“{4}”不匹配。
zh_hant: 事件 '{0}' 無法在介面 '{2}' 上實作事件 '{1}'，因為它們的委派類型 '{3}' 和 '{4}' 不相符。

# ERR_ForwardedTypeUnavailable3
source: Type '{0}' in assembly '{1}' has been forwarded to assembly '{2}'. Either a reference to '{2}' is missing from your project or the type '{0}' is missing from assembly '{2}'.
cs: Typ {0} v sestavení {1} byl předaný do sestavení {2}. Buď v projektu chybí odkaz na {2}, nebo typ {0} chybí v sestavení {2}.
de: Der Typ "{0}" in Assembly "{1}" wurde an Assembly "{2}" weitergeleitet. Entweder fehlt im Projekt ein Verweis auf "{2}", oder der Typ "{0}" fehlt in der Assembly "{2}".
es: El tipo '{0}' del ensamblado '{1}' se reenvió al ensamblado '{2}'. Falta una referencia a '{2}' en el proyecto o falta el tipo '{0}' en el ensamblado '{2}'.
fr: Le type '{0}' dans l'assembly '{1}' a été transmis à l'assembly '{2}'. Soit une référence à '{2}' est absente du projet soit le type '{0}' est absent de l'assembly '{2}'.
it: Il tipo '{0}' nell'assembly '{1}' è stato inoltrato all'assembly '{2}'. Un riferimento a '{2}' non è presente nel progetto o il tipo '{0}' non è presente nell'assembly '{2}'.
ja: アセンブリ '{1}' の型 '{0}' は、アセンブリ '{2}' に転送されました。プロジェクトに '{2}' への参照が見つからないか、またはアセンブリ '{2}' に型 '{0}' が見つかりません。
ko: '{1}' 어셈블리의 '{0}' 형식이 '{2}' 어셈블리로 전달되었습니다. 프로젝트에 '{2}'에 대한 참조가 없거나 '{2}' 어셈블리에 '{0}' 형식이 없습니다.
pl: Typ „{0}” w zestawie „{1}” został przekazany do zestawu „{2}”. Brak odwołania do zestawu „{2}” w projekcie lub typu „{0}” w zestawie „{2}”.
pt_br: Tipo "{0}" no assembly "{1}" foi encaminhado para o assembly "{2}". Uma referência a "{2}" está ausente do seu projeto ou o tipo "{0}" está ausente no assembly "{2}".
ru: Тип "{0}" в сборке "{1}" переадресован в сборку "{2}". Либо ссылка на "{2}" отсутствует в вашем проекте, либо тип "{0}" отсутствует в сборке "{2}".
tr: '{1}' derlemesinin içindeki '{0}' türü '{2}' derlemesine iletildi. Projenizde bir '{2}' başvurusu eksik veya '{2}' derlemesinde '{0}' türü eksik.
zh_hans: 程序集“{1}”中的类型“{0}”已转发到程序集“{2}”。您的项目中缺少对“{2}”的引用或者程序集中“{2}”缺少类型“{0}”。
zh_hant: 組件 '{1}' 中的類型 '{0}'，已轉送至組件 '{2}'。專案中遺漏對 '{2}' 的參考，或者組件 '{2}' 中遺漏類型 '{0}'。

# ERR_TypeFwdCycle2
source: '{0}' in assembly '{1}' has been forwarded to itself and so is an unsupported type.
cs: '{0} v sestavení {1} se předal sám sobě, jedná se proto o nepodporovaný typ.
de: '"{0}" in Assembly "{1}" wurde an sich selbst weitergeleitet und ist daher ein nicht unterstützter Typ.
es: '{0}' del ensamblado '{1}' se ha reenviado a sí mismo y, por tanto, no es un tipo admitido.
fr: '{0}' dans l'assembly '{1}' a été transféré à lui-même et est donc un type non pris en charge.
it: '{0}' nell'assembly '{1}' è stato inoltrato a se stesso, quindi non è un tipo supportato.
ja: 'アセンブリ '{1}' の型 '{0}' はそれ自体に転送され、サポートされていない型もそれ自体に転送されました。
ko: '{1}' 어셈블리의 '{0}'이(가) 자신에게 전달되었습니다. 이는 지원되지 않는 형식입니다.
pl: 'Element „{0}” w zestawie „{1}” został przesłany dalej do samego siebie, i dlatego jest nieobsługiwanym typem.
pt_br: "{0}" no assembly "{1}" foi encaminhado para si mesmo e, portanto, é um tipo sem suporte.
ru: "{0}" в сборке "{1}" был перемещен к себе и поэтому является недопустимым типом.
tr: '{1}' derlemesindeki '{0}' kendi kendine iletildi ve bu nedenle desteklenmeyen bir tür.
zh_hans: '程序集“{1}”中的“{0}”已被转发给自身，因此它是一种不受支持的类型。
zh_hant: '組件 '{1}' 中的 '{0}' 已轉送至其本身，所以不支援該類型。

# ERR_BadTypeInCCExpression
source: Non-intrinsic type names are not allowed in conditional compilation expressions.
cs: Názvy jiných než vnitřních typů nejsou ve výrazech podmíněné kompilace povolené.
de: Nicht systeminterne Typennamen sind in Ausdrücken für bedingte Kompilierung nicht zulässig.
es: No se permiten nombres de tipo no intrínseco en las expresiones de compilación condicional.
fr: Les noms de types non intrinsèques ne sont pas autorisés dans les expressions de compilation conditionnelles.
it: I nomi di tipo non intrinseco non sono consentiti nelle espressioni di compilazione condizionale.
ja: 条件付きコンパイル式では非組み込み型名を使用できません。
ko: 조건부 컴파일 식에는 내장 형식 이름만 사용할 수 있습니다.
pl: Nazwy typu niewewnętrznego nie są dozwolone w wyrażeniach kompilacji warunkowej.
pt_br: Nomes de tipo não intrínsecos não são permitidos em expressões de compilação condicional.
ru: Имена типов, отличных от встроенных, недопустимы в выражениях условной компиляции.
tr: Koşullu derleme ifadelerinde gerçek olmayan tür adlarına izin verilmez.
zh_hans: 在条件编译表达式中不允许有非内部的类型名。
zh_hant: 條件式編譯運算式中不允許非內建的類型名稱。

# ERR_BadCCExpression
source: Syntax error in conditional compilation expression.
cs: Ve výrazu podmíněné kompilace se našla chyba syntaxe.
de: Syntaxfehler im Ausdruck für bedingte Kompilierung.
es: Error de sintaxis de la expresión de compilación condicional.
fr: Erreur de syntaxe dans l'expression de compilation conditionnelle.
it: Errore di sintassi nell'espressione di compilazione condizionale.
ja: 条件付きコンパイル式に構文エラーがあります。
ko: 조건부 컴파일 식에 구문 오류가 있습니다.
pl: Błąd składni w wyrażeniu kompilacji warunkowej.
pt_br: Erro de sintaxe em expressão de compilação condicional.
ru: Синтаксическая ошибка в выражении условной компиляции.
tr: Koşullu derleme ifadesinde söz dizimi hatası var.
zh_hans: 条件编译表达式中有语法错误。
zh_hant: 條件式編譯運算式中的語法錯誤。

# ERR_VoidArrayDisallowed
source: Arrays of type 'System.Void' are not allowed in this expression.
cs: Pole typu System.Void nejsou v tomto výrazu povolená.
de: Arrays vom Typ "System.Void" sind in diesem Ausdruck nicht zulässig.
es: Esta expresión no permite matrices de tipo 'System.Void'.
fr: Les tableaux de type 'System.Void' ne sont pas autorisés dans cette expression.
it: Le matrici di tipo 'System.Void' non sono consentite in questa espressione.
ja: 型 'System.Void' の配列はこの式では使用できません。
ko: 이 식에는 'System.Void' 형식의 배열을 사용할 수 없습니다.
pl: Tablice typu „System.Void” są niedozwolone w tym wyrażeniu.
pt_br: Matrizes do tipo 'System.Void' não são permitidos nesta expressão.
ru: Массивы типа "System.Void" недопустимы в данном выражении.
tr: System.Void' türündeki dizilere bu ifadede izin verilmez.
zh_hans: 此表达式中不允许使用 "System.Void" 类型的数组。
zh_hant: 此運算式中不允許類型 'System.Void' 的陣列。

# ERR_MetadataMembersAmbiguous3
source: '{0}' is ambiguous because multiple kinds of members with this name exist in {1} '{2}'.
cs: 'Název {0} je nejednoznačný, protože v {1} – {2} existuje víc druhů členů s tímto názvem.
de: '"{0}" ist mehrdeutig, da in {1} "{2}" mehrere Arten von Membern mit diesem Namen vorhanden sind.
es: '{0}' es ambiguo porque existen varios tipos de miembros con este nombre en {1} '{2}'.
fr: '{0}' est ambigu, car plusieurs genres de membres portant ce nom existent dans {1} '{2}'.
it: '{0}' è ambiguo perché esistono diversi tipi di membri con lo stesso nome in {1} '{2}'.
ja: {1} '{2}' に同じ名前のメンバーが多種類存在するため、'{0}' があいまいです。
ko: '이름이 같은 여러 종류의 멤버가 {1} '{2}'에 있으므로 '{0}'은(는) 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny, ponieważ wiele rodzajów składowych o tej nazwie istnieje w elemencie {1} „{2}”.
pt_br: "{0}" é ambíguo porque vários tipos de membros com este nome existem em {1} "{2}".
ru: "{0}" неоднозначно, поскольку несколько видов членов с данным именем существует в {1} "{2}".
tr: {1} '{2}' içinde bu ada sahip birden çok türde üye olduğundan '{0}' belirsiz.
zh_hans: '“{0}”不明确，因为 {1}“{2}”中存在多种具有此名称的成员
zh_hant: '因為在 {1} '{2}' 中有多種具備此名稱的成員，因而 '{0}' 模稜兩可。

# ERR_TypeOfExprAlwaysFalse2
source: Expression of type '{0}' can never be of type '{1}'.
cs: Výraz typu {0} nemůže být nikdy typu {1}.
de: Ein Ausdruck vom Typ "{0}" kann nie vom Typ "{1}" sein.
es: La expresión de tipo '{0}' nunca puede ser del tipo '{1}'.
fr: L'expression de type '{0}' ne peut jamais être de type '{1}'.
it: L'espressione di tipo '{0}' non può mai essere di tipo '{1}'.
ja: 型 '{0}' の式を型 '{1}' にすることはできません。
ko: '{0}' 형식의 식은 '{1}' 형식일 수 없습니다.
pl: Wyrażenie typu „{0}” nigdy nie może być typu „{1}”.
pt_br: Expressão do tipo "{0}" nunca pode ser do tipo "{1}".
ru: Выражение типа "{0}" не может относиться к типу "{1}".
tr: '{0}' türünün ifadesi hiçbir zaman '{1}' türünde olamaz.
zh_hans: 类型“{0}”的表达式永远不能为类型“{1}”。
zh_hant: 類型 '{0}' 的運算式不能為類型 '{1}'。

# ERR_OnlyPrivatePartialMethods1
source: Partial methods must be declared 'Private' instead of '{0}'.
cs: Částečné metody musí být deklarované s použitím klíčového slova Private, ne {0}.
de: Partielle Methoden müssen als "Private" deklariert werden, nicht als "{0}".
es: Los métodos parciales deben declararse como 'Private' en lugar de como '{0}'.
fr: Les méthodes partielles doivent être déclarées 'Private' au lieu de '{0}'.
it: I metodi parziali devono essere dichiarati come 'Private' invece di '{0}'.
ja: 部分メソッドは、'{0}' ではなく 'Private' と宣言しなければなりません。
ko: 부분 메서드(Partial Method)는 '{0}' 대신 'Private'으로 선언해야 합니다.
pl: Metody częściowe muszą być zadeklarowane jako „Private” zamiast „{0}”.
pt_br: Métodos parciais devem ser declarados "Private", em vez de "{0}".
ru: Разделяемые методы должны быть объявлены "Private", а не "{0}".
tr: Kısmi yöntemler '{0}' yerine 'Private' olarak bildirilmelidir.
zh_hans: 必须将分部方法声明为“Private”，而不是“{0}”。
zh_hant: 部分方法必須宣告為 'Private'，而非 '{0}'。

# ERR_PartialMethodsMustBePrivate
source: Partial methods must be declared 'Private'.
cs: Částečné metody musí být deklarované s použitím klíčového slova Private.
de: Partielle Methoden müssen als "Private" deklariert werden.
es: Los métodos parciales deben declararse como 'Private'.
fr: Les méthodes partielles doivent être déclarées 'Private'.
it: I metodi parziali devono essere dichiarati come 'Private'.
ja: 部分メソッドは、'Private' と宣言しなければなりません。
ko: 부분 메서드(Partial Method)는 'Private'으로 선언해야 합니다.
pl: Metody częściowe muszą być zadeklarowane jako „Private”.
pt_br: Métodos parciais devem ser declarados 'Private'.
ru: Разделяемые методы должны быть объявлены как "Private".
tr: Kısmi yöntemler 'Private' olarak bildirilmelidir.
zh_hans: 必须将分部方法声明为 "Private"。
zh_hant: 部分方法必須宣告為 'Private'。

# ERR_OnlyOnePartialMethodAllowed2
source: Method '{0}' cannot be declared 'Partial' because only one method '{1}' can be marked 'Partial'.
cs: Metodu {0} nejde deklarovat s použitím klíčového slova Partial, protože klíčové slovo Partial jde použít jenom u jedné metody {1}.
de: Die {0}-Methode kann nicht als "Partial" deklariert werden, da nur eine {1}-Methode als "Partial" gekennzeichnet werden darf.
es: El método '{0}' no se puede declarar como 'Partial' porque solo puede haber un método '{1}' marcado como 'Partial'.
fr: La méthode '{0}' ne peut pas être déclarée 'Partial', car une seule méthode '{1}' peut être marquée comme 'Partial'.
it: Il metodo '{0}' non può essere dichiarato come 'Partial' perché solo un metodo '{1}' può essere contrassegnato come 'Partial'.
ja: Partial' のマークを付けることが可能なのは 1 つのメソッド '{1}' のみであるため、メソッド '{0}' を 'Partial' と宣言することはできません。
ko: '{1}' 메서드 하나만 'Partial'로 표시할 수 있으므로 '{0}' 메서드는 'Partial'로 선언할 수 없습니다.
pl: Metody „{0}” nie można zadeklarować jako „Partial”, ponieważ tylko jedną metodę „{1}” można oznaczyć jako „Partial”.
pt_br: Método "{0}" não pode ser declarado como "Partial" porque somente um método "{1}" pode ser marcado como "Partial".
ru: Метод "{0}" не может быть объявлен "Partial", так как только один метод "{1}" может быть помечен как "Partial".
tr: Yalnızca bir '{1}' yöntemi 'Partial' olarak işaretleneceği için '{0}' yöntemi 'Partial' olarak bildirilemiyor.
zh_hans: 方法“{0}”不能声明为“Partial”，因为只有一个方法“{1}”可以标记为“Partial”。
zh_hant: 方法 '{0}' 不可宣告為 'Partial'，因為只有一個方法 '{1}' 可標記為 'Partial'。

# ERR_OnlyOneImplementingMethodAllowed3
source: Method '{0}' cannot implement partial method '{1}' because '{2}' already implements it. Only one method can implement a partial method.
cs: Metoda {0} nemůže implementovat částečnou metodu {1}, protože ji už implementuje metoda {2}. Částečnou metodu smí implementovat jenom jedna metoda.
de: Die {0}-Methode kann die partielle {1}-Methode nicht implementieren, da sie von "{2}" bereits implementiert wird. Nur eine Methode darf eine partielle Methode implementieren.
es: El método '{0}' no puede implementar el método parcial '{1}' porque '{2}' ya lo implementa. Solo un método puede implementar un método parcial.
fr: La méthode '{0}' ne peut pas implémenter de méthode partielle '{1}', car '{2}' l'implémente déjà. Une seule méthode peut implémenter une méthode partielle.
it: Il metodo '{0}' non può implementare il metodo parziale '{1}' perché è già implementato da '{2}'. Un metodo parziale può essere implementato da un solo metodo.
ja: '{2}' によって既に実装されているため、メソッド '{0}' は部分メソッド '{1}' を実装できません。部分メソッドを実装できるのは 1 つのメソッドだけです。
ko: '{2}'에서 이미 '{1}' 부분 메서드(Partial Method)를 구현했으므로 '{0}' 메서드에서 부분 메서드를 구현할 수 없습니다. 메서드 하나만 부분 메서드를 구현할 수 있습니다.
pl: Metoda „{0}” nie może implementować metody częściowej „{1}”, ponieważ już implementuje ją metoda „{2}”. Tylko jedna metoda może implementować metodę częściową.
pt_br: Método "{0}" não pode implementar o método parcial "{1}" porque "{2}" já o implementa. Somente um método pode implementar um método parcial.
ru: Метод "{0}" не может реализовывать разделяемый метод "{1}", так как "{2}" он уже реализован. Только один метод может реализовать разделяемый метод.
tr: '{0}' yöntemi '{1}' kısmi yöntemini uygulayamaz çünkü bu '{2}' tarafından zaten uygulanıyor. Yalnızca bir yöntem kısmi bir yöntem uygulayabilir.
zh_hans: 方法“{0}”无法实现分部方法“{1}”，因为它已经由“{2}”实现。分部方法只能由一个方法实现。
zh_hant: 方法 '{0}' 無法實作部分方法 '{1}'，因為 '{2}' 已實作該方法。只有一個方法可實作部分方法。

# ERR_PartialMethodMustBeEmpty
source: Partial methods must have empty method bodies.
cs: Částečné metody musí mít prázdné tělo metody.
de: Der Text von partiellen Methoden muss leer sein.
es: Los métodos parciales deben tener cuerpos de método vacíos.
fr: Les méthodes partielles doivent avoir des corps de méthodes vides.
it: I metodi parziali devono avere corpi dei metodi vuoti.
ja: 部分メソッドには空のメソッド本体が必要です。
ko: 부분 메서드(Partial Method)의 본문은 비어 있어야 합니다.
pl: Metody częściowe muszą mieć pustą treść metody.
pt_br: Os métodos parciais devem ter corpos vazios.
ru: Разделяемые методы должны иметь пустое тело метода.
tr: Kısmi yöntemlerin yöntem gövdeleri boş olmalıdır.
zh_hans: 分部方法必须具有空方法体。
zh_hant: 部分方法的方法主體必須是空的。

# ERR_PartialMethodsMustBeSub1
source: '{0}' cannot be declared 'Partial' because partial methods must be Subs.
cs: 'Metodu {0} nejde deklarovat s použitím klíčového slova Partial, protože částečné metody se musí deklarovat jako metody typu Sub.
de: '"{0}" kann nicht als "Partial" deklariert werden, da partielle Methoden untergeordnete Methoden sein müssen.
es: '{0}' no se puede declarar como 'Partial' porque los métodos parciales deben ser Subs.
fr: '{0}' ne peut pas être déclaré 'Partial', car les méthodes partielles doivent être des Subs.
it: '{0}' non può essere dichiarato come 'Partial' perché i metodi parziali devono essere Sub.
ja: '部分メソッドは Sub でなければならないため、'{0}' を 'Partial' として宣言することはできません。
ko: '부분 메서드(Partial Method)는 Sub여야 하므로 '{0}'은(는) 'Partial'로 선언할 수 없습니다.
pl: 'Nie można zadeklarować metody „{0}” jako „Partial”, ponieważ metody częściowe muszą być typu Sub.
pt_br: "{0}" não pode ser declarado como "Partial" porque métodos parciais devem ser Subs.
ru: "{0}" не может быть объявлен "Partial", так как разделяемые методы должны быть Subs.
tr: 'Kısmi yöntemlerin Sub olmaları gerektiğinden '{0}' 'Partial' olarak bildirilemiyor.
zh_hans: '“{0}”不能声明为“Partial”，因为分部方法必须为 Subs。
zh_hant: '{0}' 不可宣告為 'Partial'，因為部分方法必須是 Sub。

# ERR_PartialMethodGenericConstraints2
source: Method '{0}' does not have the same generic constraints as the partial method '{1}'.
cs: Metoda {0} nemá stejná obecná omezení jako částečná metoda {1}.
de: Die {0}-Methode hat nicht dieselben generischen Einschränkungen wie die partielle {1}-Methode.
es: El método '{0}' no tiene las mismas restricciones genéricas que el método parcial '{1}'.
fr: La méthode '{0}' n'a pas les mêmes contraintes génériques que la méthode partielle '{1}'.
it: Il metodo '{0}' non ha gli stessi vincoli generici del metodo parziale '{1}'.
ja: メソッド '{0}' に、部分メソッド '{1}' と同じジェネリック制約がありません。
ko: '{0}' 메서드에는 '{1}' 부분 메서드(Partial Method)과 같은 제네릭 제약 조건이 없습니다.
pl: Metoda „{0}” nie ma takich samych ograniczeń ogólnych jak metoda częściowa „{1}”.
pt_br: Método "{0}" não tem as mesmas restrições genéricas do método parcial "{1}".
ru: Метод "{0}" не имеет те же универсальные ограничения, что и разделяемый метод "{1}".
tr: '{0}' yöntemi, '{1}' kısmi yöntemiyle aynı genel kısıtlamalara sahip değil.
zh_hans: 方法“{0}”没有与分部方法“{1}”相同的泛型约束。
zh_hant: 方法 '{0}' 沒有與部分方法 '{1}' 相同的泛型條件約束。

# ERR_PartialDeclarationImplements1
source: Partial method '{0}' cannot use the 'Implements' keyword.
cs: Částečná metoda {0} nesmí používat klíčové slovo Implements.
de: Die partielle {0}-Methode darf das Schlüsselwort "Implements" nicht verwenden.
es: El método parcial '{0}' no puede usar la palabra clave 'Implements'.
fr: La méthode partielle '{0}' ne peut pas utiliser le mot clé 'Implements'.
it: Il metodo parziale '{0}' non può usare la parola chiave 'Implements'.
ja: 部分メソッド '{0}' では 'Implements' キーワードを使用できません。
ko: '{0}' 부분 메서드(Partial Method)에서 'Implements' 키워드를 사용할 수 없습니다.
pl: W metodzie częściowej „{0}” nie można używać słowa kluczowego „Implements”.
pt_br: Método parcial "{0}" não pode usar a palavra-chave "Implements".
ru: Разделяемый метод "{0}" не может использовать ключевое слово "Implements".
tr: '{0}' kısmi yöntemi 'Implements' anahtar sözcüğünü kullanamaz.
zh_hans: 分部方法“{0}”不能使用“Implements”关键字。
zh_hant: 部分方法 '{0}' 不可使用 'Implements' 關鍵字。
