Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_LocalTypeNameClash2
source: Embedding the interop type '{0}' from assembly '{1}' causes a name clash in the current assembly. Consider disabling the embedding of interop types.
cs: Vložení typu spolupráce {0} ze sestavení {1} způsobí konflikt názvů v aktuálním sestavení. Zvažte zákaz vkládání typů spolupráce.
de: Durch Einbetten des Interoptyps "{0}" aus der Assembly "{1}" wird ein Namenskonflikt in der aktuellen Assembly verursacht. Deaktivieren Sie ggf. die Einbettung von Interoptypen.
es: Incrustar el tipo de interoperabilidad '{0}' desde el ensamblado '{1}' provoca un conflicto de nombre en el ensamblado actual. Puede deshabilitar la incrustación de los tipos de interoperabilidad.
fr: L'incorporation du type interop '{0}' de l'assembly '{1}' entraîne un conflit de noms dans l'assembly actuel. Désactivez l'incorporation des types interop.
it: L'incorporamento del tipo di interoperabilità '{0}' dall'assembly '{1}' causa un conflitto di nomi nell'assembly corrente. Provare a disabilitare l'incorporamento dei tipi di interoperabilità.
ja: アセンブリ '{1}' から相互運用機能型 '{0}' を埋め込むと、現在のアセンブリで名前の競合が発生します。相互運用機能型の埋め込みの無効化を検討してください。
ko: '{1}' 어셈블리의 interop 형식 '{0}'을(를) 포함하면 현재 어셈블리에서 이름이 충돌합니다. interop 형식을 포함하지 않도록 설정하세요.
pl: Osadzenie typu międzyoperacyjnego „{0}” z zestawu „{1}” spowoduje konflikt nazw w bieżącym zestawie. Rozważ wyłączenie osadzania typów międzyoperacyjnych.
pt_br: Inserir o tipo de interoperabilidade "{0}" do assembly "{1}" causa um conflito de nome no assembly atual. Considere desabilitar a inserção de tipos de interoperabilidade.
ru: Внедрение типа взаимодействия "{0}" из сборки "{1}" служит причиной конфликта имен в текущей сборке. Попробуйте отключить внедрение типов взаимодействия.
tr: '{1}' derlemesinden '{0}' birlikte çalışma türünün eklenmesi geçerli derlemede ad çakışmasına neden oluyor. Birlikte çalışma türlerini ekleme işlemini devre dışı bırakabilirsiniz.
zh_hans: 嵌入来自程序集“{1}”中的互操作类型“{0}”会导致当前程序集中发生名称冲突。请考虑禁用互操作类型的嵌入。
zh_hant: 從組件 '{1}' 內嵌 Interop 類型 '{0}'，會造成目前組件中的名稱衝突。請考慮停用內嵌 Interop 類型。

# ERR_InteropMethodWithBody1
source: Embedded interop method '{0}' contains a body.
cs: Vložená metoda spolupráce {0} obsahuje tělo.
de: Die eingebettete Interopmethode "{0}" enthält Text.
es: El método de interoperabilidad incrustado '{0}' contiene un cuerpo.
fr: La méthode interop incorporée '{0}' contient un corps.
it: Il metodo di interoperabilità incorporato '{0}' contiene un corpo.
ja: 埋め込み相互運用メソッド '{0}' には本体が含まれます。
ko: 포함된 interop 메서드 '{0}'에 본문이 있습니다.
pl: Osadzona metoda międzyoperacyjna „{0}” zawiera treść.
pt_br: Método de interoperabilidade inserido "{0}" contém um corpo.
ru: Внедренный метод взаимодействия "{0}" содержит тело.
tr: Gömülü birlikte çalışma yöntemi '{0}' bir gövde içeriyor.
zh_hans: 嵌入互操作方法“{0}”包含主体。
zh_hant: 內嵌 Interop 方法 '{0}' 包含主體。

# ERR_BadAsyncInQuery
source: 'Await' may only be used in a query expression within the first collection expression of the initial 'From' clause or within the collection expression of a 'Join' clause.
cs: 'Operátor Await jde použít jenom ve výrazu dotazu v rámci prvního výrazu kolekce počáteční klauzule From nebo v rámci výrazu kolekce klauzule Join.
de: '"Await" darf in einem Abfrageausdruck nur innerhalb des ersten Sammlungsausdrucks der ursprünglichen From-Klausel oder innerhalb des Sammlungsausdrucks einer Join-Klausel verwendet werden.
es: 'Await' solamente se puede usar en una expresión de consulta dentro de la primera expresión de colección de la cláusula 'From' inicial o dentro de la expresión de colección de una cláusula 'Join'.
fr: 'Await' peut uniquement être utilisé dans une expression de requête contenue dans la première expression de collection de la clause 'From' initiale ou dans l'expression de collection d'une clause 'Join'.
it: 'Await' può essere usato solo in un'espressione di query all'interno della prima espressione di raccolta della clausola 'From' iniziale o all'interno dell'espressione di raccolta di una clausola 'Join'.
ja: 'Await' は、最初の 'From' 句の最初のコレクション式内、または 'Join' 句のコレクション式内のクエリ式でのみ使用できます。
ko: 'Await'는 초기 'From' 절의 첫 번째 Collection 식이나 'Join' 절의 Collection 식 내의 쿼리 식에서만 사용할 수 있습니다.
pl: 'Operatora „Await” można użyć tylko w wyrażeniu zapytania w pierwszym wyrażeniu kolekcji początkowej klauzuli „From” albo w wyrażeniu kolekcji klauzuli „Join”.
pt_br: 'Await' só pode ser usado em uma expressão de consulta na primeira expressão de coleção da cláusula inicial 'From' ou na expressão de coleção de uma cláusula 'Join'.
ru: 'Оператор Await можно использовать только в выражении запроса в первом выражении коллекции начального предложения From или в выражении коллекции предложения Join.
tr: 'Await' yalnızca başlangıçtaki 'From' yan tümcesinin ilk koleksiyon ifadesinin içindeki ya da bir 'Join' yan tümcesinin koleksiyon ifadesinin içindeki bir sorgu ifadesinde kullanılabilir.
zh_hans: '"Await" 只能在初始 "From" 子句的第一个集合表达式或 "Join" 子句的集合表达式的查询表达式中使用。
zh_hant: 'Await' 只能使用於初始 'From' 子句第一個集合運算式內的查詢運算式，或 'Join' 子句集合運算式內的查詢運算式。

# ERR_BadGetAwaiterMethod1
source: 'Await' requires that the type '{0}' have a suitable GetAwaiter method.
cs: 'Operátor Await vyžaduje, aby typ {0} měl odpovídající metodu GetAwaiter.
de: '"Await" erfordert, dass der Typ "{0}" eine geeignete GetAwaiter-Methode aufweist.
es: 'Await' requiere que el tipo '{0}' tenga un método GetAwaiter adecuado.
fr: 'Await' nécessite que le type '{0}' ait une méthode GetAwaiter appropriée.
it: 'Con 'Await' il tipo {0} deve disporre di un metodo GetAwaiter appropriato.
ja: 'Await' では、型 '{0}' に適切な GetAwaiter メソッドが必要です。
ko: 'Await'의 경우 {0} 형식에 적합한 GetAwaiter 메서드가 있어야 합니다.
pl: 'Element „Await” wymaga, aby typ „{0}” miał odpowiednią metodę GetAwaiter.
pt_br: "Await" requer que o tipo "{0}" tenha um método GetAwaiter adequado.
ru: 'Для применения оператора "await" у типа "{0}" должен быть подходящий метод GetAwaiter.
tr: 'Await', '{0}' türünün uygun bir GetAwaiter yöntemi olmasını gerektirir.
zh_hans: '“Await”要求类型“{0}”包含适当的 GetAwaiter 方法。
zh_hant: 'Await' 要求類型 '{0}' 必須具有合適的 GetAwaiter 方法。

# ERR_BadIsCompletedOnCompletedGetResult2
source: 'Await' requires that the return type '{0}' of '{1}.GetAwaiter()' have suitable IsCompleted, OnCompleted and GetResult members, and implement INotifyCompletion or ICriticalNotifyCompletion.
cs: 'Operátor await vyžaduje, aby návratový typ {0} metody {1}.GetAwaiter() měl odpovídající členy IsCompleted, OnCompleted a GetResult a implementoval rozhraní INotifyCompletion nebo ICriticalNotifyCompletion.
de: '"Await" erfordert, dass der Rückgabetyp "{0}" von "{1}.GetAwaiter()" geeignete IsCompleted-, OnCompleted- und GetResult-Member enthält und dass INotifyCompletion oder ICriticalNotifyCompletion implementiert wird.
es: 'Await' requiere que el tipo de valor devuelto '{0}' de '{1}.GetAwaiter()' tenga los miembros IsCompleted, OnCompleted y GetResult adecuados, e implemente INotifyCompletion o ICriticalNotifyCompletion.
fr: 'Await' nécessite que le type de retour '{0}' de '{1}.GetAwaiter()' ait des membres IsCompleted, OnCompleted et GetResult appropriés et qu'ils implémentent INotifyCompletion ou ICriticalNotifyCompletion.
it: 'Con 'Await' il tipo restituito '{0}' di '{1}.GetAwaiter()' deve disporre di membri IsCompleted, OnCompleted e GetResult appropriati e implementare INotifyCompletion o ICriticalNotifyCompletion.
ja: 'await' を使用するには、'{1}.GetAwaiter()' の戻り値の型 '{0}' に IsCompleted、OnCompleted、および GetResult の適切なメンバーが含まれ、INotifyCompletion または ICriticalNotifyCompletion が実装されている必要があります。
ko: 'Await'의 경우 '{1}.GetAwaiter()'의 반환 형식 '{0}'에 적합한 IsCompleted, OnCompleted 및 GetResult 멤버가 있어야 하며 INotifyCompletion 또는 ICriticalNotifyCompletion을 구현해야 합니다.
pl: 'Element „Await” wymaga, aby zwracany typ „{0}” metody „{1}.GetAwaiter()” miał odpowiednie składowe IsCompleted, OnCompleted i GetResult oraz implementował interfejs INotifyCompletion lub ICriticalNotifyCompletion.
pt_br: "Await" requer que o tipo de retorno "{0}" de "{1}.GetAwaiter()" tenha membros IsCompleted, OnCompleted e GetResult adequados e implemente INotifyCompletion ou ICriticalNotifyCompletion.
ru: 'Для использования оператора "Await" необходимо, чтобы у возвращаемого типа "{0}" метода "{1}.GetAwaiter()" были соответствующие члены IsCompleted, OnCompleted и GetResult и чтобы этот тип реализовывал интерфейс INotifyCompletion или ICriticalNotifyCompletion.
tr: 'Await', '{1}.GetAwaiter()' öğesinin '{0}' dönüş türünün uygun IsCompleted, OnCompleted ve GetResult üyeleri olmasını ve INotifyCompletion veya ICriticalNotifyCompletion uygulanmasını gerektirir.
zh_hans: '“Await”要求“{1}.GetAwaiter()”的返回类型“{0}”包含适当的 IsCompleted、OnCompleted 和 GetResult 成员，并实现 INotifyCompletion 或 ICriticalNotifyCompletion
zh_hant: 'Await' 要求 '{1}.GetAwaiter()' 的傳回類型 '{0}'，必須具有合適的 IsCompleted、OnCompleted 和 GetResult 成員，且實作 INotifyCompletion 或 ICriticalNotifyCompletion。

# ERR_DoesntImplementAwaitInterface2
source: '{0}' does not implement '{1}'.
cs: '{0} neimplementuje {1}.
de: '"{0}" implementiert "{1}" nicht.
es: '{0}' no implementa '{1}'.
fr: '{0}' n'implémente pas '{1}'.
it: '{0}' non implementa '{1}'.
ja: '{0}' は '{1}' を実装していません。
ko: '{0}'은(는) '{1}'을(를) 구현하지 않습니다.
pl: 'Element „{0}” nie implementuje interfejsu „{1}”.
pt_br: "{0}" não implementa "{1}".
ru: "{0}" не реализует "{1}".
tr: '{0}', '{1}' uygulamıyor.
zh_hans: '“{0}”未实现“{1}”。
zh_hant: '{0}' 未實作 '{1}'。

# ERR_BadAwaitNothing
source: Cannot await Nothing. Consider awaiting 'Task.Yield()' instead.
cs: Nejde použít operátor await s hodnotou Nothing. Zvažte místo toho použití operátoru await s výrazem Task.Yield().
de: Auf Nichts kann nicht gewartet werden. Ziehen Sie stattdessen das Warten auf 'Task.Yield()' in Betracht.
es: No se puede usar Await con Nothing. Puede usarlo con 'Task.Yield()'.
fr: Impossible d'attendre Nothing. Attendez plutôt 'Task.Yield()'.
it: Non è possibile attendere Nothing. Provare ad attendere 'Task.Yield()'.
ja: Nothing を待つことはできません。'Task.Yield()' を待つことを検討してください。
ko: Nothing에 await를 사용할 수 없습니다. 대신 'Task.Yield()'에 await를 사용하세요.
pl: Nie można zdefiniować oczekiwania na wartość Nothing. Zamiast tego rozważ zdefiniowanie oczekiwania na funkcję „Task.Yield()”.
pt_br: Não é possível aguardar Nothing. Em vez disso, considere aguardar 'Task.Yield()'.
ru: Нельзя ожидать значение Nothing. Попробуйте вместо этого ожидать Task.Yield().
tr: Nothing beklenemez. Bunun yerine 'Task.Yield()' bekleyebilirsiniz.
zh_hans: 不能等待 Nothing。请考虑改为等待“Task.Yield()”。
zh_hant: 無法等候 Nothing。請考慮改為等候 'Task.Yield()'。

# ERR_BadAsyncByRefParam
source: Async methods cannot have ByRef parameters.
cs: Asynchronní metody nemůžou mít parametry ByRef.
de: Async-Methoden dürfen nicht über ByRef-Parameter verfügen.
es: Los métodos asincrónicos no pueden tener parámetros ByRef.
fr: Les méthodes Async n'acceptent pas les paramètres ByRef.
it: I metodi asincroni non possono avere parametri ByRef.
ja: Async メソッドに ByRef パラメーターを指定することはできません。
ko: 비동기 메서드에는 ByRef 매개 변수를 사용할 수 없습니다.
pl: Metody asynchroniczne nie mogą mieć parametrów ByRef.
pt_br: Os métodos assíncronos não podem ter parâmetros ByRef.
ru: Методы с модификатором Async не могут иметь параметры ByRef.
tr: Zaman uyumsuz yöntemlerde ByRef parametreleri bulunamaz.
zh_hans: 异步方法不能包含 ByRef 参数。
zh_hant: Async 方法不可以有 ByRef 參數。

# ERR_InvalidAsyncIteratorModifiers
source: 'Async' and 'Iterator' modifiers cannot be used together.
cs: 'Modifikátory Async a Iterator nejde použít současně.
de: 'Die Async- und Iterator-Modifizierer können nicht gleichzeitig verwendet werden.
es: 'Los modificadores 'Async' e 'Iterator' no se pueden usar juntos.
fr: 'Les modificateurs 'Async' et 'Iterator' ne peuvent pas être utilisés en même temps.
it: 'I modificatori 'Async' e 'Iterator' non possono essere usati contemporaneamente.
ja: 'Async' 修飾子と 'Iterator' 修飾子を同時に使用することはできません。
ko: 'Async' 및 'Iterator' 한정자는 함께 사용할 수 없습니다.
pl: 'Modyfikatory „Async” i „Iterator” nie mogą być używane razem.
pt_br: 'Não é possível usar os modificadores 'Async' e 'Iterator' juntos.
ru: 'Модификаторы "Async" и "Iterator" нельзя использовать одновременно.
tr: 'Async' ve 'Iterator' değiştiricileri birlikte kullanılamaz.
zh_hans: '“Async”和“Iterator”修饰符不能一起使用。
zh_hant: 'Async' 和 'Iterator' 修飾元不可以同時使用。

# ERR_BadResumableAccessReturnVariable
source: The implicit return variable of an Iterator or Async method cannot be accessed.
cs: Nejde přistupovat k implicitní návratové hodnotě iterátoru nebo asynchronní metody.
de: Auf die implizite Rückgabevariable einer Iterator- oder Async-Methode kann nicht zugegriffen werden.
es: No se puede obtener acceso a la variable devuelta implícita de un método Iterator o Async.
fr: Impossible d'accéder à la variable de retour implicite d'une méthode Iterator ou Async.
it: Non è possibile accedere alla variabile implicita restituita di un metodo Iterator o Async.
ja: Iterator メソッドまたは Async メソッドの暗黙的な戻り変数にアクセスできません。
ko: 반복기 또는 비동기 메서드의 암시적 반환 변수에 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do niejawnie zwracanej zmiennej metody iteracyjnej lub asynchronicznej.
pt_br: Não é possível acessar a variável de retorno implícita de um método Iterator ou Async.
ru: Нельзя получить доступ к неявно возвращаемой переменной метода, помеченного модификатором Iterator или Async.
tr: Bir Yineleyici veya Zaman Uyumsuz yöntemin örtük dönüş değerine erişilemiyor.
zh_hans: 无法访问迭代器方法或异步方法的隐式返回变量。
zh_hant: 無法存取 Iterator 或 Async 方法的隱含傳回變數。

# ERR_ReturnFromNonGenericTaskAsync
source: 'Return' statements in this Async method cannot return a value since the return type of the function is 'Task'. Consider changing the function's return type to 'Task(Of T)'.
cs: 'Příkazy Return v této asynchronní metodě nemůžou vracet hodnotu, protože návratový typ funkce je Task. Zvažte změnu návratového typu funkce na typ Task(Of T).
de: 'Return-Anweisungen in dieser Async-Methode können keinen Wert zurückgeben, da der Rückgabetyp der Funktion "Task" ist. Ändern Sie ggf. den Rückgabetyp der Funktion in "Task(Of T)".
es: 'Las instrucciones 'Return' del método Async no pueden devolver un valor, ya que el tipo de valor devuelto de la función es 'Task'. Puede cambiar el tipo de valor devuelto de la función a 'Task(Of T)'.
fr: 'Les instructions 'Return' de cette méthode Async ne peuvent pas retourner de valeur puisque que le retour de la fonction est de type 'Task'. Convertissez le type de retour de la fonction en 'Task(Of T)'.
it: 'Le istruzioni 'Return' in questo metodo Async non possono restituire un valore perché il tipo restituito della funzione è 'Task'. Provare a modificare il tipo restituito della funzione in 'Task(Of T)'.
ja: 'この Async メソッドの 'Return' ステートメントは、関数の戻り値の型が 'Task' であるため、値を返すことができません。関数の戻り値の型を 'Task(Of T)' に変更することを検討してください。
ko: '이 비동기 메서드의 'Return' 문은 함수의 반환 형식이 'Task'이기 때문에 값을 반환할 수 없습니다. 함수의 반환 형식을 'Task(Of T)'로 변경하세요.
pl: 'Instrukcje „Return” w tej metodzie asynchronicznej nie mogą zwracać wartości, ponieważ funkcja zwraca typ „Task”. Rozważ zmianę typu zwracanego przez funkcję na „Task(Of T)”.
pt_br: 'As instruções 'Return' deste método Async não podem retornar um valor, uma vez que o tipo de retorno da função é 'Task'. Considere a alteração do tipo de retorno da função para 'Task(Of T)'.
ru: 'Операторам "Return" данного метода Async не удается вернуть значение, поскольку для функции указан возвращаемый тип "Task". Попробуйте изменить тип возвращаемого значения на "Task(Of T)".
tr: 'İşlevin dönüş türü 'Task' olduğundan bu Zaman Uyumsuz yöntemdeki 'Return' deyimleri değer döndüremez. İşlevin dönüş türünü 'Task(Of T)' olarak değiştirebilirsiniz.
zh_hans: '此异步方法中的 "Return" 语句无法返回值，因为函数的返回类型为 "Task" 。请考虑将函数的返回类型更改为 "Task(Of T)"。
zh_hant: '這個 Async 方法中的 'Return' 陳述式無法傳回值，因為函式的傳回類型為 'Task'。請考慮將函式的傳回類型變更為 'Task(Of T)'。

# ERR_BadAsyncReturnOperand1
source: Since this is an async method, the return expression must be of type '{0}' rather than 'Task(Of {0})'.
cs: Protože se jedná o asynchronní metodu, vrácený výraz musí být typu {0} a ne typu Task(Of {0}).
de: Da es sich um eine asynchrone Methode handelt, muss der Rückgabeausdruck vom Typ "{0}" anstelle von "Task(Of {0})" sein.
es: Como este es un método asincrónico, la expresión devuelta debe ser de tipo '{0}' en lugar de 'Task(Of {0})'.
fr: Étant donné qu'il s'agit d'une méthode Async, l'expression de retour doit être de type '{0}' plutôt que 'Task(Of {0})'.
it: Poiché si tratta di un metodo asincrono, l'espressione restituita deve essere di tipo '{0}' invece di 'Task(Of {0})'.
ja: これは非同期メソッドであるため、return 式は 'Task(Of {0})' ではなく '{0}' 型である必要があります。
ko: 비동기 메서드이기 때문에 이 메서드의 반환 식은 'Task(Of {0})' 형식이 아니라 '{0}' 형식이어야 합니다.
pl: Ze względu na to, że jest to metoda asynchroniczna, zwracane wyrażenie musi być typu „{0}”, a nie typu „Task(Of {0})”.
pt_br: Como este é um método assíncrono, a expressão de retorno deve ser do tipo "{0}" em vez de "Task(Of {0})".
ru: Поскольку данный метод является асинхронным, возвращаемое выражение должно относиться к типу "{0}", а не к типу "Task(Of {0})".
tr: Bu zaman uyumsuz bir yöntem olduğundan, dönüş ifadesi 'Task(Of {0})' yerine '{0}' türünde olmalıdır.
zh_hans: 这是一个异步方法，因此返回表达式的类型必须为“{0}”而不是“Task(Of {0})”。
zh_hant: 因為此為 Async 方法，所以傳回運算式必須是 '{0}' 類型，而非 'Task(Of {0})'。

# ERR_BadAsyncReturn
source: The 'Async' modifier can only be used on Subs, or on Functions that return Task or Task(Of T).
cs: Modifikátor Async je možné použít jenom pro procedury nebo pro funkce, které vracejí hodnotu typu Task nebo Task(Of T).
de: Der Async-Modifizierer kann nur für untergeordnete Methoden oder für Funktionen verwendet werden, die "Task" oder "Task(Of T)" zurückgeben.
es: El modificador 'Async' solamente se puede usar en Subs o en funciones que devuelvan Task o Task(Of T).
fr: Le modificateur 'Async' peut uniquement être utilisé dans les procédures Sub, ou dans les fonctions retournant Task ou Task(Of T).
it: Il modificatore 'Async' può essere usato solo su sub o funzioni che restituiscano Task o Task(Of T).
ja: Async' 修飾子は、Sub と、Task または Task(Of T) を返す Function でのみ使用できます。
ko: Async' 한정자는 Task 또는 Task(Of T)를 반환하는 Sub 또는 함수에서만 사용할 수 있습니다.
pl: Modyfikatora „Async” można używać tylko dla procedur albo funkcji zwracających typ Task lub Task(Of T).
pt_br: O modificador 'Async' só pode ser usado em Subs ou em Functions que retornem Task ou Task(Of T).
ru: Модификатор Async можно использовать только в подпрограммах или в функциях, которые возвращают значения типа Task или Task(Of T).
tr: Async' değiştiricisi yalnızca Task veya Task(Of T) döndüren İşlevler ve Alt Yordamlar üzerinde kullanılabilir.
zh_hans: 只能在 Sub 上或者在返回 Task 或 Task(Of T) 的函数上使用 "Async" 修饰符。
zh_hant: Async' 修飾元只能用在傳回 Task 或 Task(Of T) 的子函數或函式上。

# ERR_CantAwaitAsyncSub1
source: '{0}' does not return a Task and cannot be awaited. Consider changing it to an Async Function.
cs: 'Metoda {0} nevrací typ Task a nejde v ní použít operátor await. Zvažte změnu této metody na asynchronní funkci.
de: '"{0}" gibt keine Aufgabe zurück und kann nicht abgewartet werden. Erwägen Sie eine Änderung in eine Async-Funktion.
es: '{0}' no devuelve una tarea y no se le puede aplicar await. Puede cambiarla a una función asincrónica.
fr: '{0}' ne peut pas retourner de tâche ni être attendu. Utilisez plutôt une fonction Async.
it: '{0}' non restituisce un oggetto Task e non può essere atteso. Provare a modificarlo in una funzione Async.
ja: '{0}' はタスクを返さないため、Await できません。Async Function への変更を検討してください。
ko: '{0}'은(는) Task를 반환하지 않으므로 await를 사용할 수 없습니다. 비동기 함수로 변경하세요.
pl: 'Element „{0}” nie zwraca zadania i nie jest możliwe oczekiwanie na niego. Rozważ zmianę tego elementu na funkcję asynchroniczną.
pt_br: "{0}" não retornar uma Tarefa e não podem ser colocada em espera. Considere alterá-la para uma Função Assíncrona.
ru: "{0}" не возвращает значения типа Task, и его нельзя ожидать. Попробуйте заменить его на функцию с модификатором Async.
tr: '{0}' bir Task döndürmüyor ve beklenemez. Bunu değiştirip bir Zaman Uyumsuz İşlev yapabilirsiniz.
zh_hans: '“{0}”不返回 Task 且无法等待。请考虑将它更改为 Async Function。
zh_hant: '{0}' 不會傳回 Task 且無法等候。請考慮將其變更為 Async 函式。

# ERR_InvalidLambdaModifier
source: 'Only the 'Async' or 'Iterator' modifier is valid on a lambda.
cs: 'Pro výraz lambda jsou platné pouze modifikátory Async nebo Iterator.
de: In einem Lambdaausdruck ist nur der Async- oder Iterator-Modifizierer gültig.
es: 'Solo los modificadores 'Async' o 'Iterator' son válidos en una expresión lambda.
fr: 'Seuls les modificateurs 'Async' et 'Iterator' sont valides dans les expressions lambda.
it: In un'espressione lambda sono validi solo modificatori 'Async' o 'Iterator'.
ja: 'ラムダでは 'Async' 修飾子または 'Iterator' 修飾子のみが有効です。
ko: '람다에서는 'Async' 또는 'Iterator' 한정자만 유효합니다.
pl: 'Tylko modyfikator „Async” lub „Iterator” jest poprawny w przypadku wyrażenia lambda.
pt_br: 'Somente o modificador "Async" ou "Iterator" é válido em um lambda.
ru: 'В лямбда-выражениях допускаются только модификаторы "Async" или "Iterator".
tr: 'Lambda üzerinde yalnızca 'Async' veya 'Iterator' değiştiricisi geçerlidir.
zh_hans: '仅“Async”或“Iterator”修饰符在 lambda 上有效。
zh_hant: 'Lambda 上只有 'Async' 或 'Iterator' 修飾元有效。

# ERR_BadAwaitInNonAsyncMethod
source: 'Await' can only be used within an Async method. Consider marking this method with the 'Async' modifier and changing its return type to 'Task(Of {0})'.
cs: 'Klíčové slovo Await se dá použít jenom v asynchronních metodách. Zvažte označení této metody modifikátorem Async a změnu jejího návratového typu na Task(Of {0}).
de: '"Await" kann nur innerhalb einer Async-Methode verwendet werden. Markieren Sie ggf. diese Methode mit dem Async-Modifizierer, und ändern Sie ihren Rückgabetyp in "Task(Of {0})".
es: 'Await' solo se puede usar dentro de un método Async. Puede marcar este método con el modificador 'Async' y cambiar su tipo de valor devuelto a 'Task(Of {0})'.
fr: 'Await' peut uniquement être utilisé dans une méthode Async. Marquez cette méthode avec le modificateur 'Async' et changez son type de retour en 'Task(Of {0})'.
it: 'Await' può essere usato solo all'interno di un metodo asincrono. Provare a contrassegnare il metodo con il modificatore 'Async' e impostare il tipo restituito su 'Task(Of {0})'.
ja: 'Await' は、非同期メソッド内でのみ使用できます。このメソッドに 'Async' 修飾子を指定して、その戻り値の型を 'Task(Of {0})' に変更することを検討してください。
ko: 'Await'는 비동기 메서드 내에서만 사용할 수 있습니다. 'Async' 한정자로 이 메서드를 표시하고 해당 반환 형식을 'Task(Of {0})'로 변경하세요.
pl: 'Słowo kluczowe „Await” może zostać użyte tylko wewnątrz metody asynchronicznej. Rozważ oznaczenie tej metody za pomocą modyfikatora „Async” i zmianę zwracanego przez nią typu na „Task(Of {0})”.
pt_br: "Await" pode somente ser usado dentro de um método Assíncrono. Considere marcar este método com o modificador "Async" e alterar seu tipo de retorno para "Task(Of {0})".
ru: 'Оператор await можно использовать только в методах с модификатором async. Попробуйте пометить этот метод модификатором "Async" и изменить его возвращаемый тип на "Task(Of {0})".
tr: 'Await' yalnızca Zaman Uyumsuz bir yöntemde kullanılabilir. Bu yöntemi 'Async' değiştiricisiyle işaretleyebilir ve dönüş türünü 'Task(Of {0})' olarak değiştirebilirsiniz.
zh_hans: '“Await”只能在异步方法中使用。请考虑使用“Async”修饰符标记此方法，并将其返回类型更改为“Task(Of {0})”。
zh_hant: 'Await' 只可用於 Async 方法中。請考慮以 'Async' 修飾元標記此方法，並將其傳回類型變更為 'Task(Of {0})'。
