Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ProcTypeNotCLSCompliant1
source: Return type of function '{0}' is not CLS-compliant.
cs: Typ vrácené hodnoty funkce {0} není kompatibilní se specifikací CLS.
de: Der Rückgabetyp der {0}-Funktion ist nicht CLS-kompatibel.
es: El tipo de valor devuelto de la función '{0}' no es conforme a CLS.
fr: Le type de retour de la fonction '{0}' n'est pas conforme CLS.
it: Il tipo restituito della funzione '{0}' non è conforme a CLS.
ja: 関数 '{0}' の戻り値の型は CLS に準拠していません。
ko: '{0}' 함수의 반환 형식이 CLS 규격이 아닙니다.
pl: Zwracany typ funkcji „{0}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo de retorno da função "{0}" não tem conformidade com CLS.
ru: Тип возвращаемого значения "{0}" не удовлетворяет требованиям CLS.
tr: '{0}' işlevinin dönüş türü CLS uyumlu değil.
zh_hans: 函数“{0}”的返回类型不符合 CLS。
zh_hant: 函式 '{0}' 的傳回類型不符合 CLS 規範。

# WRN_ProcTypeNotCLSCompliant1_Title
source: Return type of function is not CLS-compliant
cs: Návratový typ funkce není kompatibilní se specifikací CLS.
de: Der Rückgabetyp der Funktion ist nicht CLS-kompatibel.
es: El tipo de retorno de la función no es conforme a CLS
fr: Le type de retour de la fonction n’est pas conforme CLS
it: Il tipo restituito della funzione non è conforme a CLS
ja: 関数の戻り型が CLS に準拠していません
ko: 함수의 반환 형식이 CLS 규격이 아님
pl: Zwracany typ funkcji jest niezgodny ze specyfikacją CLS
pt_br: Retornar o tipo da função não tem conformidade com CLS
ru: Тип возвращаемого значения функции несовместим с CLS
tr: İşlevin dönüş türü CLS uyumlu değil
zh_hans: 函数的返回类型不符合 CLS
zh_hant: 函式的傳回類型不符合 CLS 規範

# WRN_ParamNotCLSCompliant1
source: Type of parameter '{0}' is not CLS-compliant.
cs: Typ parametru {0} není kompatibilní se specifikací CLS.
de: Der Typ des {0}-Parameters ist nicht CLS-kompatibel.
es: El tipo de parámetro '{0}' no es conforme a CLS.
fr: Le type de paramètre '{0}' n'est pas conforme CLS.
it: Il tipo di parametro '{0}' non è conforme a CLS.
ja: パラメーター '{0}' の型は CLS に準拠していません。
ko: '{0}' 매개 변수의 형식이 CLS 규격이 아닙니다.
pl: Typ parametru „{0}” jest niezgodny ze specyfikacją CLS.
pt_br: Tipo de parâmetro "{0}" não tem conformidade com CLS.
ru: Тип параметра "{0}" не удовлетворяет требованиям CLS.
tr: '{0}' parametresinin türü CLS uyumlu değil.
zh_hans: 参数“{0}”的类型不符合 CLS。
zh_hant: 參數 '{0}' 的類型不符合 CLS 規範。

# WRN_ParamNotCLSCompliant1_Title
source: Type of parameter is not CLS-compliant
cs: Typ parametru není kompatibilní se specifikací CLS.
de: Der Typ des Parameters ist nicht CLS-kompatibel.
es: El tipo de parámetro no es conforme a CLS
fr: Le type de paramètre n’est pas conforme CLS
it: Il tipo di parametro non è conforme a CLS
ja: パラメーターの型が CLS に準拠していません
ko: 매개 변수 형식이 CLS 규격이 아님
pl: Typ parametru jest niezgodny ze specyfikacją CLS
pt_br: Tipo de parâmetro não tem conformidade com CLS
ru: Тип параметра несовместим с CLS
tr: Parametre türü CLS uyumlu değil
zh_hans: 参数的类型不符合 CLS
zh_hant: 參數的類型不符合 CLS 規範

# WRN_InheritedInterfaceNotCLSCompliant2
source: '{0}' is not CLS-compliant because the interface '{1}' it inherits from is not CLS-compliant.
cs: '{0} není kompatibilní se specifikací CLS, protože rozhraní {1}, ze kterého se dědí, není kompatibilní se specifikací CLS.
de: '"{0}" ist nicht CLS-kompatibel, da die {1}-Schnittstelle, von der geerbt wird, nicht CLS-kompatibel ist.
es: '{0}' no es conforme a CLS porque la interfaz '{1}' de la que se hereda no es conforme a CLS.
fr: '{0}' n'est pas conforme CLS, car l'interface '{1}' dont il hérite n'est pas conforme CLS.
it: '{0}' non è conforme a CLS perché l'interfaccia '{1}' da cui eredita non è conforme a CLS.
ja: '{0}' は、継承元のインターフェイス '{1}' が CLS に準拠していないため、CLS に準拠していません。
ko: '{1}' 인터페이스가 CLS 규격이 아니므로 이 인터페이스에서 상속된 '{0}'은(는) CLS 규격이 아닙니다.
pl: 'Element „{0}” jest niezgodny ze specyfikacją CLS, ponieważ interfejs „{1}”, po którym dziedziczy, jest niezgodny ze specyfikacją CLS.
pt_br: "{0}" não tem conformidade com CLS porque a interface "{1}" da qual ele herda não tem conformidade com CLS.
ru: "{0}" несовместим с CLS, так как унаследованный интерфейс "{1}" несовместим с CLS.
tr: 'Devralındığı '{1}' arabirimi CLS uyumlu olmadığından, '{0}' de CLS uyumlu değildir.
zh_hans: '“{0}”不符合 CLS，因为它所继承的接口“{1}”不符合 CLS。
zh_hant: '{0}' 不符合 CLS 規範，因為其繼承的介面 '{1}' 不符合 CLS 規範。

# WRN_InheritedInterfaceNotCLSCompliant2_Title
source: Type is not CLS-compliant because the interface it inherits from is not CLS-compliant
cs: Typ není kompatibilní se specifikací CLS, protože rozhraní, ze kterého se dědí, není kompatibilní se specifikací CLS.
de: Der Typ ist nicht CLS-kompatibel, weil die Schnittstelle, von der er erbt, nicht CLS-kompatibel ist.
es: El tipo no es conforme a CLS porque la interfaz de la que se hereda no es conforme a CLS
fr: Le type n’est pas conforme CLS, car l’interface dont il hérite n’est pas conforme CLS
it: Il tipo non è conforme a CLS perché l'interfaccia da cui eredita non è conforme a CLS
ja: 継承元のインターフェイスは CLS 準拠ではないので、型が CLS に準拠していません
ko: 상속되는 인터페이스가 CLS 규격이 아니므로 형식이 CLS 규격이 아님
pl: Typ jest niezgodny ze specyfikacją CLS, ponieważ interfejs, po którym on dziedziczy, jest niezgodny ze specyfikacją CLS
pt_br: O tipo não tem conformidade com CLS porque a interface herdada não tem conformidade com CLS
ru: Тип несовместим с CLS, так как наследуемый интерфейс несовместим с CLS
tr: Türün devraldığı arabirim CLS uyumlu olmadığından tür CLS uyumlu değil
zh_hans: 类型不符合 CLS，原因是它继承自的接口不符合 CLS
zh_hant: 類型不符合 CLS 規範，因為它所繼承的介面不符合 CLS 規範

# WRN_CLSMemberInNonCLSType3
source: {0} '{1}' cannot be marked CLS-compliant because its containing type '{2}' is not CLS-compliant.
cs: {0} {1} se nedá označit jako kompatibilní s CLS, protože příslušný nadřazený typ {2} není kompatibilní s CLS.
de: {0} "{1}" kann nicht als CLS-kompatibel markiert werden, da der enthaltende {2}-Typ nicht CLS-kompatibel ist.
es: {0} '{1}' no se puede marcar como conforme a CLS porque el tipo contenedor '{2}' no es conforme a CLS.
fr: {0} '{1}' ne peut pas être marqué comme conforme CLS, car son type conteneur '{2}' n'est pas conforme CLS.
it: {0} '{1}' non può essere contrassegnato come conforme a CLS perché il tipo che lo contiene '{2}' non è conforme a CLS.
ja: {0} '{1}' は、含んでいる型 '{2}' が CLS に準拠していないため、CLS 準拠として設定できません。
ko: 포함하는 형식 '{2}'이(가) CLS 규격이 아니므로 {0} '{1}'을(를) CLS 규격으로 표시할 수 없습니다.
pl: Elementu {0} „{1}” nie można oznaczyć jako zgodnego ze specyfikacją CLS, ponieważ jego zawierający typ „{2}” jest niezgodny ze specyfikacją CLS.
pt_br: {0} "{1}" não pode ser marcado como em conformidade com CLS porque seu tipo recipiente "{2}" não tem conformidade com CLS.
ru: {0} "{1}" не может быть помечен как совместимый с CLS, так как тип, который он содержит "{2}", несовместим с CLS.
tr: {0} '{1}' CLS uyumlu olarak işaretlenemez çünkü kapsayıcı türü olan '{2}' CLS uyumlu değil.
zh_hans: {0}“{1}”不能被标记为符合 CLS，因为它的包含类型“{2}”不符合 CLS。
zh_hant: {0} '{1}' 無法標記為符合 CLS 規範，因為其包含類型 '{2}' 不符合 CLS 規範。

# WRN_CLSMemberInNonCLSType3_Title
source: Member cannot be marked CLS-compliant because its containing type is not CLS-compliant
cs: Člen se nedá označit za kompatibilní se specifikací CLS, protože jeho nadřazený typ není kompatibilní se specifikací CLS.
de: Der Member kann nicht als CLS-kompatibel gekennzeichnet werden, da er einen Typ enthält, der nicht CLS-kompatibel ist.
es: El miembro no se puede marcar como conforme a CLS porque contiene un tipo que no es conforme a CLS
fr: Le membre ne peut pas être signalé comme conforme CLS, car son type contenant n’est pas conforme CLS
it: Il membro non può essere contrassegnato come conforme a CLS perché il tipo che lo contiene non è conforme a CLS
ja: メンバーを包含する型が CLS に準拠していないので、メンバーを CLS 準拠としてマークすることはできません
ko: 포함하는 형식이 CLS 규격이 아니므로 멤버를 CLS 규격으로 표시할 수 없음
pl: Nie można oznaczyć składowej jako zgodnej ze specyfikacją CLS, ponieważ jej typ zawierający jest niezgodny ze specyfikacją CLS
pt_br: O membro não pode ser marcado como em conformidade com CLS porque seu tipo recipiente não tem conformidade com CLS
ru: Член невозможно пометить как совместимый с CLS, так как его содержащий тип несовместим с CLS
tr: Üye, kapsayan türü CLS uyumlu olmadığından CLS uyumlu olarak işaretlenemez
zh_hans: 无法将成员标记为符合 CLS，原因是它的包含类型不符合 CLS
zh_hant: 無法將成員標記為符合 CLS 規範，因為其包含類型並不符合 CLS 規範

# WRN_NameNotCLSCompliant1
source: Name '{0}' is not CLS-compliant.
cs: Název {0} není kompatibilní se specifikací CLS.
de: Der Name "{0}" ist nicht CLS-kompatibel.
es: El nombre '{0}' no es conforme a CLS.
fr: Le nom '{0}' n'est pas conforme CLS.
it: Il nome '{0}' non è conforme a CLS.
ja: 名前 '{0}' は CLS に準拠していません。
ko: 이름 '{0}'은(는) CLS 규격이 아닙니다.
pl: Nazwa „{0}” jest niezgodna ze specyfikacją CLS.
pt_br: Nome "{0}" não tem conformidade com CLS.
ru: Тип "{0}" не совместим с CLS.
tr: '{0}' adı CLS uyumlu değil.
zh_hans: 名称“{0}”不符合 CLS。
zh_hant: 名稱 '{0}' 不符合 CLS 規範。

# WRN_NameNotCLSCompliant1_Title
source: Name is not CLS-compliant
cs: Název není kompatibilní se specifikací CLS.
de: Der Name ist nicht CLS-kompatibel.
es: El nombre no es conforme a CLS
fr: Le nom n’est pas conforme CLS
it: Il nome non è conforme a CLS
ja: 名前が CLS に準拠していません
ko: 이름이 CLS 규격이 아님
pl: Nazwa jest niezgodna ze specyfikacją CLS
pt_br: Nome não tem conformidade com CLS
ru: Имя несовместимо с CLS
tr: Ad CLS uyumlu değil
zh_hans: 名称不符合 CLS
zh_hant: 名稱不符合 CLS 規範

# WRN_EnumUnderlyingTypeNotCLS1
source: Underlying type '{0}' of Enum is not CLS-compliant.
cs: Nadřazený typ {0} Enum není kompatibilní se specifikací CLS.
de: Der zugrunde liegende {0}-Typ der Enumeration ist nicht CLS-kompatibel.
es: El tipo subyacente “{0}” de la enumeración no es conforme a CLS.
fr: Le type sous-jacent '{0}' d'Enum n'est pas conforme CLS.
it: Il tipo sottostante '{0}' dell'enumerazione non è conforme a CLS.
ja: Enum の基になる型 '{0}' は CLS に準拠していません。
ko: 열거형의 '{0}' 내부 형식이 CLS 규격이 아닙니다.
pl: Typ bazowy „{0}” wyliczenia jest niezgodny ze specyfikacją CLS.
pt_br: Tipo subjacente "{0}" de Enum não tem conformidade com CLS.
ru: Базовый тип "{0}" Enum не удовлетворяет требованиям CLS.
tr: Sabit listesinin '{0}' temel alınan türü CLS uyumlu değil.
zh_hans: 枚举的基础类型“{0}”不符合 CLS。
zh_hant: 列舉的基礎類型 '{0}' 不符合 CLS 規範。

# WRN_EnumUnderlyingTypeNotCLS1_Title
source: Underlying type of Enum is not CLS-compliant
cs: Nadřazený typ Enum není kompatibilní se specifikací CLS.
de: Der zugrunde liegende Typ von "Enum" ist nicht CLS-kompatibel.
es: El tipo subyacente de enumeración no es conforme a CLS
fr: Le type sous-jacent du type Enum n’est pas conforme CLS
it: Il tipo sottostante dell'enumerazione non è conforme a CLS
ja: Enum の基になる型が CLS に準拠していません
ko: 열거형의 내부 형식이 CLS 규격이 아님
pl: Typ podstawowy wyliczenia jest niezgodny ze specyfikacją CLS
pt_br: O tipo Subjacente da Enumeração não tem conformidade com CLS
ru: Базовый тип перечисления несовместим с CLS
tr: Sabit listesinin temel alınan türü CLS uyumlu değil
zh_hans: 枚举的基础类型不符合 CLS
zh_hant: 列舉的基礎類型不符合 CLS 規範

# WRN_NonCLSMemberInCLSInterface1
source: Non CLS-compliant '{0}' is not allowed in a CLS-compliant interface.
cs: {0} nekompatibilní se specifikací CLS není povolené v rozhraní kompatibilním se specifikací CLS.
de: "{0}" ist nicht CLS-kompatibel und darf in einer CLS-kompatiblen Schnittstelle nicht verwendet werden.
es: No se permite '{0}' no conforme a CLS en una interfaz conforme a CLS.
fr: Le '{0}' non conforme CLS n'est pas autorisé dans une interface conforme CLS.
it: '{0}' non conforme a CLS non è consentito in un'interfaccia conforme a CLS.
ja: CLS に準拠していない '{0}' は、CLS に準拠しているインターフェイスに使用できません。
ko: CLS 규격 인터페이스에는 CLS 규격이 아닌 '{0}'을(를) 사용할 수 없습니다.
pl: Element „{0}” niezgodny ze specyfikacją CLS jest niedozwolony w interfejsie zgodnym ze specyfikacją CLS.
pt_br: "{0}" não tem conformidade com CLS não é permitido em uma interface em conformidade com CLS.
ru: Не допускается "{0}", несовместимый с CLS, для интерфейса, совместимого с CLS.
tr: CLS uyumlu bir arabirimde CLS uyumlu olmayan '{0}' öğesine izin verilmez.
zh_hans: 在符合 CLS 的接口中不允许出现不符合 CLS 的“{0}”。
zh_hant: 符合 CLS 規範的介面中，不可出現不符合 CLS 規範的 '{0}'。

# WRN_NonCLSMemberInCLSInterface1_Title
source: Non CLS-compliant member is not allowed in a CLS-compliant interface
cs: Člen, který není kompatibilní se specifikací CLS, se v rozhraní kompatibilním se specifikací CLS nepovoluje.
de: In einer CLS-kompatiblen Schnittstelle ist kein Member zulässig, der nicht CLS-kompatibel ist.
es: No se permite el miembro que no es conforme a CLS en una interfaz conforme a CLS
fr: Un membre non conforme CLS n’est pas autorisé dans une interface conforme CLS
it: Un membro non conforme a CLS non è consentito in un'interfaccia conforme a CLS
ja: CLS 準拠インターフェイスでは、CLS に準拠していないメンバーは許可されません
ko: CLS 규격이 아닌 멤버는 CLS 규격 인터페이스에 사용할 수 없음
pl: Niezgodna ze specyfikacją CLS składowa jest niedozwolona w interfejsie zgodnym ze specyfikacją CLS
pt_br: Um membro não tem conformidade com CLS não é permitido em uma interface em conformidade com CLS
ru: Член, несовместимый с CLS, запрещено использовать в интерфейсе, совместимом с CLS
tr: CLS uyumlu bir arabirimde CLS uyumlu olmayan üyeye izin verilmez
zh_hans: 在符合 CLS 的接口中不允许出现不符合 CLS 的成员
zh_hant: 符合 CLS 規範的介面中不得有不符合 CLS 規範的成員

# WRN_NonCLSMustOverrideInCLSType1
source: Non CLS-compliant 'MustOverride' member is not allowed in CLS-compliant type '{0}'.
cs: Člen MustOverride nekompatibilní se specifikací CLS není povolený v typu {0} kompatibilním se specifikací CLS.
de: Ein nicht CLS-kompatibler MustOverride-Member ist im CLS-kompatiblen Typ "{0}" nicht zulässig.
es: No se permite el miembro 'Mustoverride' no conforme a CLS en el tipo '{0}' conforme a CLS.
fr: Le membre « MustOverride » non conforme CLS n’est pas autorisé dans un type « {0} » conforme CLS.
it: Il membro 'MustOverride' non conforme a CLS non è consentito in un tipo '{0}' conforme a CLS.
ja: CLS に準拠していない 'MustOverride' メンバーは、CLS に準拠している型 '{0}' に使用できません。
ko: CLS 규격이 아닌 'MustOverride' 멤버는 CLS 규격의 '{0}' 형식에 사용할 수 없습니다.
pl: Składowa „MustOverride” niezgodna ze specyfikacją CLS nie jest dozwolona w elementach „{0}” zgodnych ze specyfikacją CLS.
pt_br: O membro MustOverride' não tem conformidade com CLS não é permitido no tipo em conformidade com CLS '{0}'.
ru: В типе "{0}", совместимом с CLS, запрещено использовать член MustOverride, несовместимый с CLS.
tr: CLS uyumlu '{0}' türünde CLS uyumlu olmayan 'MustOverride' üyesine izin verilmez.
zh_hans: 在符合 CLS 的类型“{0}”中不允许出现不符合 CLS 的 "MustOverride" 成员。
zh_hant: 符合 CLS 規範的類型 '{0}' 中不能有不符合 CLS 規範的 'MustOverride' 成員。

# WRN_NonCLSMustOverrideInCLSType1_Title
source: Non CLS-compliant 'MustOverride' member is not allowed in CLS-compliant type
cs: Člen MustOverride, který není kompatibilní se specifikací CLS, se v typu kompatibilním se specifikací CLS nepovoluje.
de: In einem CLS-kompatiblen Typ ist kein "MustOverride"-Member zulässig, der nicht CLS-kompatibel ist.
es: No se permite el miembro 'MustOverride' que no es conforme a CLS en un tipo conforme a CLS
fr: Un membre 'MustOverride' non conforme CLS n’est pas autorisé dans un type conforme CLS
it: Il membro 'MustOverride' non conforme a CLS non è consentito in un tipo conforme a CLS
ja: CLS 準拠型では、CLS に準拠していない 'MustOverride' メンバーは許可されません
ko: CLS 규격이 아닌 'MustOverride' 멤버는 CLS 규격 형식에 사용할 수 없음
pl: Niezgodna ze specyfikacją CLS składowa „MustOverride” jest niedozwolona w typie zgodnym ze specyfikacją CLS
pt_br: O membro "Mustoverride" não tem conformidade com CLS não é permitido no tipo em conformidade com CLS
ru: Член MustOverride, несовместимый с CLS, запрещено использовать в типе, совместимом с CLS
tr: CLS uyumlu türde CLS uyumlu olmayan 'MustOverride' üyesine izin verilmez
zh_hans: 在符合 CLS 的类型中不允许出现不符合 CLS 的 "Mustoverride" 成员
zh_hant: 符合 CLS 規範的類型中不得有不符合 CLS 規範的 'MustOverride' 成員

# WRN_ArrayOverloadsNonCLS2
source: '{0}' is not CLS-compliant because it overloads '{1}' which differs from it only by array of array parameter types or by the rank of the array parameter types.
cs: '{0} není kompatibilní se specifikací CLS, protože přetěžuje {1}. Navzájem se liší jenom polem typů parametrů polí nebo rozměrem typů parametru pole.
de: '"{0}" überlädt "{1}", unterscheidet sich jedoch nur durch Array-von-Array-Parametertypen oder durch den Rang der Arrayparametertypen davon und ist daher nicht CLS-kompatibel.
es: '{0}' no es conforme a CLS porque sobrecarga a '{1}' que solo difiere de él en la matriz de tipos de parámetro de matriz o en el rango de los tipos de parámetro de matriz.
fr: '{0}' n'est pas conforme CLS, car il surcharge '{1}' dont il diffère uniquement par un tableau de types de paramètres tableau ou par le rang des types de paramètres tableau.
it: '{0}' non è conforme a CLS perché esegue l'overload di '{1}' che differisce da esso solo per la matrice dei tipi di parametro matrice o per il numero di dimensioni dei tipi di parametro matrice.
ja: '{0}' は、配列パラメーター型の配列または配列パラメーター型のランクのみが異なる '{1}' をオーバーロードするため、CLS に準拠していません。
ko: '{0}'은(는) 배열 매개 변수 형식의 배열만 다르거나 배열 매개 변수 형식의 차수만 다른 '{1}'을(를) 오버로드하므로 CLS 규격이 아닙니다.
pl: Element „{0}” nie jest zgodny ze specyfikacją CLS, ponieważ przeciąża element „{1}”, który różni się od niego tylko tablicą typów parametrów tablicowych lub rangą typów parametrów tablicowych.
pt_br: "{0}" não tem conformidade com CLS porque sobrecarrega "{1}" que difere dele apenas pela matriz de tipos de parâmetro de matriz ou pela classificação dos tipos de parâmetro de matriz.
ru: "{0}" несовместим с CLS, так как перегружает "{1}", который отличается от него только массивом типов параметра массива или рангом типов параметра массива.
tr: '{0}', kendisinden yalnızca dizi parametresi türleri dizisi veya dizi parametresi türleri sırası farklı olan '{1}' öğesini aşırı yüklediğinden, CLS uyumlu değil.
zh_hans: '“{0}”不符合 CLS，因为它重载仅在数组参数类型的数组或数组参数类型的秩方面与它不同的“{1}”。
zh_hant: '{0}' 不符合 CLS 規範，因為其多載了 '{1}'，兩者的差別只在於陣列參數類型的陣列，或是陣列參數類型的陣序。

# WRN_ArrayOverloadsNonCLS2_Title
source: Method is not CLS-compliant because it overloads method which differs from it only by array of array parameter types or by the rank of the array parameter types
cs: Metoda není kompatibilní se specifikací CLS, protože přetěžuje metodu, která se od ní liší jenom polem typů parametrů pole nebo řazením typů parametrů pole.
de: Die Methode ist nicht CLS-kompatibel, da die Methode überladen wird, die sich nur im Hinblick auf Array- oder Arrayparametertypen bzw. im Hinblick auf den Rang der Arrayparametertypen von ihr unterscheidet.
es: El método no es conforme a CLS porque sobrecarga el método que se difiere de él solo por tipos de parámetros de matriz a matriz o por el rango de los tipos de parámetros de matriz
fr: La méthode n’est pas conforme CLS, car elle surcharge une méthode dont elle diffère uniquement par un tableau de types de paramètres tableau ou par la dimension des types de paramètres tableau
it: Il metodo non è conforme a CLS perché esegue l'overload del metodo che differisce da esso solo per la matrice dei tipi di parametro matrice o per il numero di dimensioni dei tipi di parametro matrice
ja: 配列パラメーター型の配列または配列パラメーター型のランクのみが異なるメソッドをオーバーロードするので、メソッドは CLS に準拠していません
ko: 배열 매개 변수 형식의 배열만 다르거나 배열 매개 변수 형식의 차수만 다른 메서드를 오버로드하므로 메서드가 CLS 규격이 아님
pl: Metoda jest niezgodna ze specyfikacją CLS, ponieważ przeciąża metodę, która różni się od niej tylko tablicą typów parametrów tablicowych lub rangą typów parametrów tablicowych
pt_br: Método não tem conformidade com CLS porque sobrecarrega um método que difere dele apenas por matriz de tipos de parâmetro de matriz ou pela classificação dos tipos de parâmetro de matriz
ru: Метод несовместим с CLS, так как он перегружает метод, который отличается от него только массивом типов параметров массива или рангом типов параметров массива
tr: Kendisinden yalnızca dizi parametresi türleri dizisi veya dizi parametresi türlerinin sırası bakımından farklı olan metodu aşırı yüklediğinden, metot CLS uyumlu değil
zh_hans: 方法不符合 CLS，因为它重载仅在数组参数类型的数组或数组参数类型的秩方面与它不同的方法
zh_hant: 方法不符合 CLS 規範，因為它所多載的方法與其本身之間只有陣列參數類型的陣列或陣列參數類型的順位方面的差異

# WRN_RootNamespaceNotCLSCompliant1
source: Root namespace '{0}' is not CLS-compliant.
cs: Kořenový obor názvů {0} není kompatibilní se specifikací CLS.
de: Der Stammnamespace "{0}" ist nicht CLS-kompatibel.
es: El espacio de nombres raíz '{0}' no es conforme a CLS.
fr: L'espace de noms racine '{0}' n'est pas conforme CLS.
it: Lo spazio dei nomi radice '{0}' non è conforme a CLS.
ja: ルート名前空間 '{0}' は CLS に準拠していません。
ko: '{0}' 루트 네임스페이스가 CLS 규격이 아닙니다.
pl: Główna przestrzeń nazw „{0}” jest niezgodna ze specyfikacją CLS.
pt_br: Namespace raiz "{0}" não tem conformidade com CLS.
ru: Корневое пространство имен "{0}" не удовлетворяет требованиям CLS.
tr: '{0}' kök ad alanı CLS uyumlu değil.
zh_hans: 根命名空间“{0}”不符合 CLS。
zh_hant: 根命名空間 '{0}' 不符合 CLS 規範。

# WRN_RootNamespaceNotCLSCompliant1_Title
source: Root namespace is not CLS-compliant
cs: Kořenový obor názvů není kompatibilní se specifikací CLS.
de: Der Stammnamespace ist nicht CLS-kompatibel.
es: El espacio de nombres raíz no es conforme a CLS
fr: L’espace de noms racine n’est pas conforme CLS
it: Lo spazio dei nomi radice non è conforme a CLS
ja: ルート名前空間が CLS に準拠していません
ko: 루트 네임스페이스가 CLS 규격이 아님
pl: Główna przestrzeń nazw jest niezgodna ze specyfikacją CLS
pt_br: Namespace de raiz não tem conformidade com CLS
ru: Корневое пространство имен несовместимо с CLS
tr: Kök ad alanı CLS uyumlu değil
zh_hans: 根命名空间不符合 CLS
zh_hant: 根命名空間不符合 CLS 規範

# WRN_RootNamespaceNotCLSCompliant2
source: Name '{0}' in the root namespace '{1}' is not CLS-compliant.
cs: Název {0} v kořenovém oboru názvů {1} není kompatibilní se specifikací CLS.
de: Der Name "{0}" im Stammnamespace "{1}" ist nicht CLS-kompatibel.
es: El nombre '{0}' del espacio de nombres raíz '{1}' no es conforme a CLS.
fr: Le nom '{0}' de l'espace de noms racine '{1}' n'est pas conforme CLS.
it: Il nome '{0}' nello spazio dei nomi radice '{1}' non è conforme a CLS.
ja: ルート名前空間 '{1}' にある名前 '{0}' は CLS に準拠していません。
ko: '{1}' 루트 네임스페이스의 '{0}' 이름이 CLS 규격이 아닙니다.
pl: Nazwa „{0}” w głównej przestrzeni nazw „{1}” jest niezgodna ze specyfikacją CLS.
pt_br: Nome "{0}" no namespace raiz "{1}" não tem conformidade com CLS.
ru: Имя "{0}" в корневом пространстве имен "{1}" не совместимо с CLS.
tr: '{1}' kök ad alanındaki '{0}' adı CLS uyumlu değil.
zh_hans: 根命名空间“{1}”中的名称“{0}”不符合 CLS。
zh_hant: 根命名空間 '{1}' 中的名稱 '{0}' 不符合 CLS 規範。

# WRN_RootNamespaceNotCLSCompliant2_Title
source: Part of the root namespace is not CLS-compliant
cs: Část kořenového oboru názvů není kompatibilní se specifikací CLS.
de: Ein Teil des Stammnamespaces ist nicht CLS-kompatibel.
es: Parte del espacio de nombres raíz no es conforme a CLS
fr: Une partie de l’espace de noms racine n’est pas conforme CLS
it: Parte dello spazio dei nomi radice non è conforme a CLS
ja: ルート名前空間の一部が CLS に準拠していません
ko: 루트 네임스페이스의 일부가 CLS 규격이 아님
pl: Część głównej przestrzeni nazw jest niezgodna ze specyfikacją CLS
pt_br: Parte do namespace raiz não tem conformidade com CLS
ru: Часть корневого пространства имен несовместима с CLS
tr: Kök ad alanının bir kısmı CLS uyumlu değil
zh_hans: 根命名空间的一部分不符合 CLS
zh_hant: 根命名空間有部分不符合 CLS 規範
