Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoGlobalExpectedIdentifier
source: 'Global' not allowed in this context; identifier expected.
cs: 'Možnost Global není v tomto kontextu povolená. Očekával se identifikátor.
de: '"Global" ist in diesem Kontext nicht zulässig. Es wird ein Bezeichner erwartet.
es: 'Global' no se permite en este contexto; se esperaba un identificador.
fr: 'Global' n'est pas autorisé dans ce contexte ; identificateur attendu.
it: 'Global' non è consentito in questo contesto; è previsto l'identificatore.
ja: 'Global' はこのコンテキストで許可されていません。識別子を指定してください。
ko: '이 컨텍스트에서는 'Global'을 사용할 수 없습니다. 식별자가 필요합니다.
pl: 'Element „Global” jest niedozwolony w tym kontekście; oczekiwano identyfikatora.
pt_br: 'Global' não permitido neste contexto; identificador esperado.
ru: '"Global" нельзя использовать в данном контексте; требуется идентификатор.
tr: 'Bu bağlamda 'Global' kullanılamaz; tanımlayıcı bekleniyor.
zh_hans: '此上下文中不允许 "Global"；应为标识符。
zh_hant: '此內容中不允許 'Global'; 必須是識別項。

# ERR_NoGlobalInHandles
source: 'Global' not allowed in handles; local name expected.
cs: 'Možnost Global není povolena v popisovačích. Očekával se místní název.
de: '"Global" ist in Handles nicht zulässig. Es wird ein lokaler Name erwartet.
es: 'Global' no se permite en identificadores; se esperaba el nombre local.
fr: 'Global' interdit dans les handles ; nom local attendu.
it: 'Global' non è consentito negli handle; è previsto il nome locale.
ja: 'Global' はハンドルで許可されていません。ローカル名を指定してください。
ko: '핸들에는 'Global'을 사용할 수 없습니다. 로컬 이름이 필요합니다.
pl: 'Element „Global” jest niedozwolony w elementach Handles; oczekiwano nazwy lokalnej.
pt_br: 'Global' não permitido em identificadores; nome local esperado.
ru: '"Global" нельзя использовать в обработчиках; требуется локальное имя.
tr: 'Tutamaçlarda 'Global' kullanılamaz; yerel ad bekleniyor.
zh_hans: '句柄中不允许 "Global"；应为本地名称。
zh_hant: '控制代碼中不允許 'Global'; 必須是區域名稱。

# ERR_ElseIfNoMatchingIf
source: 'ElseIf' must be preceded by a matching 'If' or 'ElseIf'.
cs: 'Klíčovému slovu ElseIf musí předcházet párové klíčové slovo If nebo ElseIf.
de: '"ElseIf" muss eine entsprechende If- oder ElseIf-Anweisung voranstehen.
es: 'ElseIf' debe ir precedida de una instrucción 'If' o 'ElseIf' correspondiente.
fr: 'ElseIf' doit être précédé d'un 'If' ou 'ElseIf' correspondant.
it: 'ElseIf' deve essere preceduto da un 'If' o 'ElseIf' corrispondente.
ja: 'ElseIf' の前には、対応する 'If' または 'ElseIf' を指定しなければなりません。
ko: 'ElseIf'는 짝이 되는 'If' 또는 'ElseIf' 뒤에 와야 합니다.
pl: 'Element „ElseIf” musi być poprzedzony odpowiadającym mu elementem „If” lub „ElseIf”.
pt_br: 'ElseIf' deve ser precedido por 'If' ou 'ElseIf' correspondente.
ru: 'Оператору "ElseIf" должен предшествовать соответствующий "If" или "ElseIf".
tr: 'ElseIf' öncesinde eşleşen bir 'If' veya 'ElseIf' olmalıdır.
zh_hans: '"ElseIf" 前面必须是匹配的 "If" 或 "ElseIf"。
zh_hant: 'ElseIf' 之前必須搭配相對應的 'If' 或 'ElseIf'。

# ERR_BadAttributeConstructor2
source: Attribute constructor has a 'ByRef' parameter of type '{0}'; cannot use constructors with byref parameters to apply the attribute.
cs: Konstruktor atributu má parametr ByRef typu {0}. Pro atribut nejde používat konstruktory s parametry byref.
de: Der Attributkonstruktor hat einen ByRef-Parameter vom Typ "{0}". Zum Anwenden des Attributs können keine Konstruktoren mit Byref-Parametern verwendet werden.
es: El constructor de atributos tiene un parámetro 'ByRef' del tipo '{0}'; no se pueden usar constructores con parámetros byref para aplicar el atributo.
fr: Le constructeur d'attribut a un paramètre 'ByRef' de type '{0}' ; impossible d'utiliser les constructeurs avec des paramètres byref pour appliquer l'attribut.
it: Il costruttore di attributo ha un parametro 'ByRef' di tipo '{0}'. Non è possibile usare i costruttori con parametri ByRef per applicare l'attributo.
ja: Attribute コンストラクターに、型 '{0}' の 'ByRef' パラメーターが指定されています。属性を適用する場合、ByRef パラメーターを含むコンストラクターを使用できません。
ko: 특성 생성자에 'ByRef' 매개 변수 형식 '{0}'이 있으므로 byref 매개 변수와 함께 생성자를 사용하여 특성을 적용할 수 없습니다.
pl: Konstruktor atrybutu ma parametr „ByRef” typu „{0}”; konstruktorów z parametrami byref nie można używać do zastosowania atrybutu.
pt_br: Construtor de atributos tem um parâmetro "ByRef" de tipo "{0}"; não é possível usar construtores com parâmetros byref para aplicar o atributo.
ru: Конструктор атрибута имеет параметр "ByRef" типа "{0}"; для работы с атрибутами нельзя использовать конструкторы с параметрами byref.
tr: Öznitelik oluşturucusunda '{0}' türünde 'ByRef' parametresi var; özniteliğe uygulanacak byref parametrelerine sahip oluşturucular kullanılamıyor.
zh_hans: 特性构造函数有一个“{0}”类型的“ByRef”参数；不能用带有 byref 参数的构造函数来应用特性。
zh_hant: 屬性建構函式的 'ByRef' 參數類型為 '{0}'; 不可使用具有 byref 參數的建構函式來套用屬性。

# ERR_EndUsingWithoutUsing
source: 'End Using' must be preceded by a matching 'Using'.
cs: 'Příkazu End Using musí předcházet párový příkaz Using.
de: '"End Using" muss eine entsprechende Using-Anweisung voranstehen.
es: 'End Using' debe ir precedida de una instrucción 'Using' correspondiente.
fr: 'End Using' doit être précédé d'un 'Using' correspondant.
it: 'End Using' deve essere preceduto da un elemento 'Using' corrispondente.
ja: 'End Using' の前には、対応する 'Using' を指定しなければなりません。
ko: 'End Using'은 짝이 되는 'Using' 뒤에 와야 합니다.
pl: 'Element „End Using” musi być poprzedzony odpowiadającym mu elementem „Using”.
pt_br: 'End Using' deve ser precedido por 'Using' correspondente.
ru: 'Оператору "End Using" должен предшествовать соответствующий ему оператор "Using".
tr: 'End Using' öncesinde eşleşen bir 'Using' olmalıdır.
zh_hans: '“End Using”前面必须是匹配的“Using”。
zh_hant: 'End Using' 之前必須搭配相對應的 'Using'。

# ERR_ExpectedEndUsing
source: 'Using' must end with a matching 'End Using'.
cs: 'Klíčové slovo Using musí být ukončené párovým klíčovým slovem End Using.
de: '"Using" muss mit einem entsprechenden "End Using" abgeschlossen werden.
es: 'Using' debe terminar con una instrucción 'End Using' correspondiente.
fr: 'Using' doit se terminer par un 'End Using' correspondant.
it: 'Using' deve terminare con un elemento 'End Using' corrispondente.
ja: 'Using' の終わりには、対応する 'End Using' を指定しなければなりません。
ko: 'Using'은 짝이 되는 'End Using'으로 끝나야 합니다.
pl: 'Element „Using” musi być zakończony odpowiadającym mu elementem „End Using”.
pt_br: 'Using' deve terminar com 'End Using' correspondente.
ru: 'Операнд "Using" должен завершаться соответствующим операндом "End Using".
tr: 'Using' öğesi eşleşen bir 'End Using' ile bitmelidir.
zh_hans: '“Using”必须以匹配的“End Using”结束。
zh_hant: 'Using' 之後必須搭配相對應的 'End Using'。

# ERR_GotoIntoUsing
source: 'GoTo {0}' is not valid because '{0}' is inside a 'Using' statement that does not contain this statement.
cs: 'Příkaz GoTo {0} není platný, protože návěstí {0} je uvnitř příkazu Using, který tento příkaz neobsahuje.
de: '"GoTo {0}" ist ungültig, da "{0}" sich innerhalb einer Using-Anweisung befindet, die diese Anweisung nicht enthält.
es: 'GoTo {0}' no es válida porque '{0}' está dentro de una instrucción 'Using' que no contiene esta instrucción.
fr: 'GoTo {0}' n'est pas valide, car '{0}' se trouve dans une instruction 'Using' qui ne contient pas cette instruction.
it: 'GoTo {0}' non è valida perché '{0}' si trova all'interno di un'istruzione 'Using' che non contiene questa istruzione.
ja: '{0}' は、このステートメントを含まない 'Using' ステートメントの内側にあるため、'GoTo {0}' は有効ではありません。
ko: '{0}'이(가) 이 문을 포함하지 않는 'Using' 문 내부에 있기 때문에 'GoTo {0}'은(는) 유효하지 않습니다.
pl: 'Instrukcja „GoTo {0}” jest nieprawidłowa, ponieważ element „{0}” znajduje się wewnątrz instrukcji „Using”, która nie zawiera tej instrukcji.
pt_br: "GoTo {0}" não é válido porque "{0}" está dentro de uma instrução "Using" que não contém essa instrução.
ru: 'Недопустимый оператор "GoTo {0}", поскольку "{0}" находится в теле оператора "Using", не содержащего данный оператор.
tr: '{0}', bu deyimi içermeyen bir 'Using' deyiminin içinde yer aldığından, 'GoTo {0}' geçerli değil.
zh_hans: '“GoTo {0}”无效，因为“{0}”位于不包含此语句的“Using”语句中。
zh_hant: 'GoTo {0}' 無效，因為 '{0}' 位於不包含此陳述式的 'Using' 陳述式中。

# ERR_UsingRequiresDisposePattern
source: 'Using' operand of type '{0}' must implement 'System.IDisposable'.
cs: 'Operand Using typu {0} musí implementovat rozhraní System.IDisposable.
de: 'Ein Using-Operand vom Typ "{0}" muss System.IDisposable implementieren.
es: 'El operando 'Using' del tipo '{0}' debe implementar 'System.IDisposable'.
fr: 'L'opérande 'Using' de type '{0}' doit implémenter 'System.IDisposable'.
it: 'L'operando 'Using' di tipo '{0}' deve implementare 'System.IDisposable'.
ja: '型 '{0}' の 'Using' オペランドは System.IDisposable を実装しなければなりません。
ko: '{0}' 형식의 'Using' 피연산자는 'System.IDisposable'을 구현해야 합니다.
pl: 'Argument operacji „Using” typu „{0}” musi implementować interfejs „System.IDisposable”.
pt_br: 'Operando "Using" de tipo "{0}" deve implementar "System. IDisposable".
ru: 'Операнд "Using" типа "{0}" должен реализовать "System.IDisposable".
tr: '{0}' türündeki 'Using' işleneni 'System.IDisposable' uygulamalıdır.
zh_hans: '“{0}”类型的“Using”操作数必须实现“System.IDisposable”。
zh_hant: '類型 '{0}' 的 'Using' 運算元必須實作 'System.IDisposable'。

# ERR_UsingResourceVarNeedsInitializer
source: 'Using' resource variable must have an explicit initialization.
cs: 'Proměnná prostředků Using musí mít explicitní inicializaci.
de: 'Die Using-Ressourcenvariable muss über eine explizite Initialisierung verfügen.
es: 'La variable de recursos 'Using' debe tener una inicialización explícita.
fr: 'La variable de ressource 'Using' doit avoir une initialisation explicite.
it: 'La variabile di risorsa 'Using' deve avere un'inizializzazione esplicita.
ja: 'Using' リソース変数には明示的な初期化が必要です。
ko: 'Using' 리소스 변수에는 명시적 초기화를 사용해야 합니다.
pl: 'Zmienna zasobu Using musi być jawnie inicjowana.
pt_br: 'A variável de recurso 'Using' deve ter uma inicialização explícita.
ru: 'Для переменной ресурса в "Using" требуется явная инициализация.
tr: 'Using' kaynak değişkeninde açık bir başlatma olmalıdır.
zh_hans: '"Using" 资源变量必须有一个显式初始化。
zh_hant: 'Using' 資源變數必須擁有明確的初始設定。

# ERR_UsingResourceVarCantBeArray
source: 'Using' resource variable type can not be array type.
cs: 'Typ proměnné prostředků Using nemůže být typu pole.
de: 'Der Variablentyp für Using-Ressourcen kann kein Arraytyp sein.
es: 'El tipo de variable del recurso 'Using' no puede ser un tipo de matriz.
fr: 'Le type de variable de ressource 'Using' ne peut pas être de type tableau.
it: 'Il tipo di variabile della risorsa 'Using' non può essere un tipo matrice.
ja: 'Using' リソース変数の型を配列型にすることはできません。
ko: 'Using' 리소스 변수 형식은 배열 형식일 수 없습니다.
pl: 'Typ zmiennej zasobu „Using” nie może być typem tablicowym.
pt_br: 'Tipo de variável de recurso 'Using' não pode ser tipo de matriz.
ru: 'Тип переменной ресурса в операторе "Using" не может быть массивом.
tr: 'Using' kaynak değişkeni türü, dizi türü olamaz.
zh_hans: '"Using" 资源变量类型不能是数组类型。
zh_hant: 'Using' 資源變數類型不能是陣列類型。

# ERR_OnErrorInUsing
source: 'On Error' statements are not valid within 'Using' statements.
cs: 'Příkazy On Error nejsou platné uvnitř příkazů Using.
de: '"On Error"-Anweisungen sind innerhalb von Using-Anweisungen nicht gültig.
es: 'Las instrucciones 'On Error' no son válidas dentro de instrucciones 'Using'.
fr: 'Les instructions 'On Error' ne sont pas valides dans les instructions 'Using'.
it: 'Le istruzioni 'On Error' non sono valide all'interno di istruzioni 'Using'.
ja: 'On Error' ステートメントは、'Using' ステートメント内では有効ではありません。
ko: 'On Error' 문은 'Using' 문 안에서 사용할 수 없습니다.
pl: 'Instrukcje On Error nie są prawidłowe w instrukcjach Using.
pt_br: 'Instruções 'On Error' não são válidas dentro de instruções 'Using'.
ru: 'Операторы "On Error" нельзя использовать в операторе "Using".
tr: 'On Error' deyimleri 'Using' deyimlerinin içinde geçerli değildir.
zh_hans: '"On Error" 语句在 "Using" 语句内无效。
zh_hant: 'On Error' 陳述式在 'Using' 陳述式內無效。

# ERR_PropertyNameConflictInMyCollection
source: '{0}' has the same name as a member used for type '{1}' exposed in a 'My' group. Rename the type or its enclosing namespace.
cs: '{0} má stejný název, jako jiný člen použil pro typ {1} vystavený ve skupině My. Přejmenujte typ nebo obor názvů, v němž je obsažený.
de: '"{0}" hat den gleichen Namen wie ein Member, der für den in einer My-Gruppe verfügbar gemachter Typ "{1}" verwendet wird. Benennen Sie den Typ oder den einschließenden Namespace um.
es: '{0}' tiene el mismo nombre que un miembro usado para el tipo '{1}' expuesto en un grupo 'My'. Cambie el nombre del tipo o de su espacio de nombres envolvente.
fr: '{0}' porte le même nom qu'un autre membre utilisé pour le type '{1}' exposé dans un groupe 'My'. Renommez le type ou son espace de noms englobant.
it: '{0}' ha lo stesso nome di un membro usato per il tipo '{1}' esposto in un gruppo 'My'. Rinominare il tipo o lo spazio dei nomi che lo contiene.
ja: '{0}' は 'My' グループ内で公開されている型 '{1}' に使用されるメンバーと同じ名前です。型またはそれを囲む名前空間の名前を変更してください。
ko: '{0}'의 이름이 '{1}' 형식을 'My' 그룹에 노출하는 데 사용한 멤버와 같습니다. 형식 또는 형식의 바깥쪽 네임스페이스의 이름을 바꾸세요.
pl: 'Element „{0}” ma taką samą nazwę jak składowa użyta dla typu „{1}” ujawniona w grupie „My”. Zmień nazwę typu lub obejmującej go przestrzeni nazw.
pt_br: "{0}" tem o mesmo nome de um membro usado para o tipo "{1}" exposto em um grupo "My". Renomeie o tipo ou seu namespace delimitador.
ru: "{0}" имеет то же имя, что и член, используемый для типа "{1}" в группе "My". Переименуйте тип или его вложенное пространство имен.
tr: '{0}' öğesinin adı, 'My' grubunda açılan '{1}' türü için kullanılan bir üyenin adıyla aynı. Türü veya onu kapsayan ad alanını yeniden adlandırın.
zh_hans: '“{0}”与“My”组中公开的类型“{1}”所使用的成员同名。请重命名该类型或其封闭命名空间。
zh_hant: '{0}' 與用在 'My' 群組中所公開之類型 '{1}' 的成員，有相同的名稱。請重新命名類型或其內含的命名空間。

# ERR_InvalidImplicitVar
source: Implicit variable '{0}' is invalid because of '{1}'.
cs: Implicitní proměnná {0} je neplatná kvůli {1}.
de: Die implizite Variable "{0}" ist ungültig aufgrund von "{1}".
es: La variable implícita '{0}' no es válida por '{1}'.
fr: La variable Implicite '{0}' n'est pas valide en raison de '{1}'.
it: La variabile implicita '{0}' non è valida a causa di '{1}'.
ja: 暗黙的な変数 '{0}' は '{1}' であるため、無効です。
ko: '{0}' 암시적 변수가 '{1}' 때문에 잘못되었습니다.
pl: Zmienna niejawna „{0}” jest nieprawidłowa z powodu „{1}”.
pt_br: A variável implícita "{0}" é inválida devido a "{1}".
ru: Неявная переменная "{0}" недопустима из-за "{1}".
tr: '{1}' nedeniyle '{0}' örtük değişkeni geçersiz.
zh_hans: 由于“{1}”，隐式变量“{0}”无效。
zh_hant: 隱含變數 '{0}' 無效，原因為 '{1}'。

# ERR_ObjectInitializerRequiresFieldName
source: Object initializers require a field name to initialize.
cs: Inicializátory objektů vyžadují název inicializovaného pole.
de: Für Objektinitialisierer ist ein zu initialisierender Feldname erforderlich.
es: Los inicializadores de objeto requieren un nombre de campo para inicializar.
fr: Les initialiseurs d'objet requièrent un nom de fichier à initialiser.
it: Con gli inizializzatori di oggetto è richiesto un nome di campo da inizializzare.
ja: オブジェクト初期化子には、初期化対象のフィールド名が必要です。
ko: 개체 이니셜라이저에 초기화할 필드 이름이 필요합니다.
pl: Inicjatory obiektów wymagają nazwy pola do zainicjowania.
pt_br: Inicializadores de objeto necessitam de um nome de campo para inicializar.
ru: Инициализаторы объектов требуют для инициализации имя поля.
tr: Nesne başlatıcılarına başlatmak için bir alan adı gerekir.
zh_hans: 对象初始值设定项需要一个字段名称以便进行初始化。
zh_hant: 物件初始設定式需要欄位名稱，才可進行初始化。

# ERR_ExpectedFrom
source: 'From' expected.
cs: 'Očekával se výraz From.
de: '"From" erwartet.
es: 'Se esperaba 'From'.
fr: 'From' attendu.
it: 'È previsto 'From'.
ja: 'From' が必要です。
ko: 'From'이 필요합니다.
pl: 'Oczekiwano instrukcji „From”.
pt_br: "From" esperado.
ru: 'Требуется "From".
tr: 'From' bekleniyor.
zh_hans: '应为“From”。
zh_hant: '必須是 'From'。

# ERR_LambdaBindingMismatch1
source: Nested function does not have the same signature as delegate '{0}'.
cs: Vnořená funkce nemá stejný podpis jako delegát {0}.
de: Die Signatur der geschachtelten Funktion stimmt nicht mit der des Delegaten "{0}" überein.
es: La función anidada no tiene la misma firma que el delegado '{0}'.
fr: La fonction imbriquée n'a pas la même signature que le délégué '{0}'.
it: La funzione annidata non ha la stessa firma del delegato '{0}'.
ja: 入れ子になった関数に、デリゲート '{0}' と同じシグネチャがありません。
ko: 중첩된 함수에 '{0}' 대리자와 동일한 시그니처가 없습니다.
pl: Funkcja zagnieżdżona nie ma takiej samej sygnatury jak obiekt delegowany „{0}”.
pt_br: A função aninhada não tem a mesma assinatura do delegado "{0}".
ru: Вложенная функция не имеет одинаковой подписи с делегатом "{0}".
tr: İç içe işlevin imzası '{0}' temsilcisiyle aynı değil.
zh_hans: 嵌套函数与委托“{0}”的签名不相同。
zh_hant: 巢狀函式與委派 '{0}' 沒有相同的簽章。

# ERR_LambdaBindingMismatch2
source: Nested sub does not have a signature that is compatible with delegate '{0}'.
cs: Vnořená procedura nemá signaturu kompatibilní s delegátem {0}.
de: Die Signatur des geschachtelten Sub ist nicht mit dem Delegaten "{0}" kompatibel.
es: El elemento sub anidado no tiene una firma compatible con el delegado '{0}'.
fr: Un Sub imbriqué n'a pas une signature compatible avec le délégué '{0}'.
it: La sub annidata non ha una firma compatibile con il delegato '{0}'.
ja: 入れ子になった sub に、デリゲート '{0}' と互換性のあるシグネチャがありません。
ko: 중첩된 sub에 '{0}' 대리자와 호환되는 시그니처가 없습니다.
pl: Zagnieżdżony element sub nie ma sygnatury zgodnej z obiektem delegowanym „{0}”.
pt_br: Sub aninhada não tem uma assinatura compatível com delegado "{0}".
ru: Подпись вложенного подчиненного несовместима с делегатом "{0}".
tr: İç içe sub'ın '{0}' temsilcisiyle uyumlu bir imzası yok.
zh_hans: 嵌套 Sub 的签名与委托“{0}”不兼容。
zh_hant: 巢狀 Sub 沒有與委派 '{0}' 相容的簽章。

# ERR_CannotLiftByRefParamQuery1
source: 'ByRef' parameter '{0}' cannot be used in a query expression.
cs: 'Ve výrazu dotazu nejde použít parametr ByRef {0}.
de: 'Der ByRef-Parameter "{0}" kann in einem Abfrageausdruck nicht verwendet werden.
es: 'El parámetro '{0}' de 'ByRef' no se puede usar en una expresión de consulta.
fr: 'Le paramètre 'ByRef' '{0}' ne peut pas être utilisé dans une expression de requête.
it: 'Non è possibile usare il parametro '{0}' di 'ByRef' in un'espressione di query.
ja: 'ByRef' パラメーター '{0}' をクエリ式で使用することはできません。
ko: '쿼리 식에는 'ByRef' 매개 변수 '{0}'을(를) 사용할 수 없습니다.
pl: 'Nie można użyć parametru ByRef „{0}” w wyrażeniu zapytania.
pt_br: 'Parâmetro "ByRef" "{0}" não pode ser usado em uma expressão de consulta.
ru: 'Параметр "ByRef" "{0}" нельзя использовать в выражении запроса.
tr: '{0}' 'ByRef' parametresi sorgu ifadesinde kullanılamaz.
zh_hans: '不能在查询表达式中使用“ByRef”参数“{0}”。
zh_hant: 'ByRef' 參數 '{0}' 不可用在查詢運算式中。

# ERR_ExpressionTreeNotSupported
source: Expression cannot be converted into an expression tree.
cs: Výraz nejde převést na strom výrazu.
de: Der Ausdruck kann nicht in einen Ausdrucksbaum konvertiert werden.
es: La expresión no se puede convertir en un árbol de expresión.
fr: Impossible de convertir l'expression en une arborescence d'expression.
it: Non è possibile convertire l'espressione in un albero delle espressioni.
ja: 式を式ツリーに変換できません。
ko: 식은 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować wyrażenia na drzewo wyrażenia.
pt_br: Não é possível converter a expressão para uma árvore de expressão.
ru: Выражение не может быть преобразовано в дерево выражения.
tr: İfade bir ifade ağacına dönüştürülemez.
zh_hans: 无法将表达式转换为表达式树。
zh_hant: 運算式不可轉換成運算式樹狀結構。

# ERR_CannotLiftStructureMeQuery
source: Instance members and 'Me' cannot be used within query expressions in structures.
cs: Členy instancí a skupinu Me nejde používat ve výrazech dotazů ve strukturách.
de: Instanzmember und "Me" können in Strukturen in Abfrageausdrücken nicht verwendet werden.
es: No se pueden usar miembros de instancia ni 'Me' en expresiones de consulta en estructuras.
fr: Les membres d'instance et 'Me' ne peuvent pas être utilisés au sein d'expressions de requêtes dans des structures.
it: Non è possibile usare membri di istanza e 'Me' in espressioni di query delle strutture.
ja: インスタンス メンバーおよび 'Me' は、構造体内のクエリ式では使用できません。
ko: 인스턴스 멤버와 'Me'는 구조체의 쿼리 식에 사용할 수 없습니다.
pl: Nie można używać składowych wystąpień i elementu „Me” w wyrażeniach zapytań w strukturach.
pt_br: Não é possível usar membros de instância e 'Me' dentro de expressões de consulta em estruturas.
ru: Члены экземпляров и "Me" не могут быть использованы в выражениях запроса в структурах.
tr: Yapılardaki sorgu ifadelerinin içinde örnek üyeleri ve 'Me' kullanılamaz.
zh_hans: 无法在结构中的查询表达式中使用实例成员和“Me”。
zh_hant: 執行個體成員和 'Me' 不能用在結構的查詢運算式中。

# ERR_InferringNonArrayType1
source: Variable cannot be initialized with non-array type '{0}'.
cs: Proměnnou nejde inicializovat s použitím typu {0}, který není typem pole.
de: Die Variable kann nicht mit dem Typ "{0}", der kein Arraytyp ist, initialisiert werden.
es: Una variable no se puede inicializar con un tipo '{0}' que no sea de matriz.
fr: La variable ne peut pas être initialisée avec un type autre qu'un type tableau '{0}'.
it: Non è possibile inizializzare la variabile con il tipo non matrice '{0}'.
ja: 変数を非配列型 '{0}' で初期化することはできません。
ko: 배열이 아닌 형식 '{0}'을(를) 사용하여 변수를 초기화할 수 없습니다.
pl: Nie można zainicjować zmiennej przy użyciu typu nietablicowego „{0}”.
pt_br: Variável não pode ser inicializada com tipo não-matriz "{0}".
ru: Не удается инициализировать переменную с типом "{0}", не являющимся массивом.
tr: Değişken, dizi olmayan '{0}' türüyle başlatılamıyor.
zh_hans: 无法用非数组类型“{0}”初始化变量。
zh_hant: 不能以非陣列類型 '{0}' 初始化變數。

# ERR_ByRefParamInExpressionTree
source: References to 'ByRef' parameters cannot be converted to an expression tree.
cs: Odkazy na parametry ByRef nejde převést na strom výrazu.
de: Verweise auf ByRef-Parameter können nicht in einen Ausdrucksbaum konvertiert werden.
es: Las referencias a parámetros 'ByRef' no se pueden convertir en un árbol de expresión.
fr: Impossible de convertir les références aux paramètres 'ByRef' en une arborescence de l'expression.
it: Non è possibile convertire i riferimenti ai parametri 'ByRef' in un albero delle espressioni.
ja: ByRef' パラメーターへの参照を式ツリーに変換することはできません。
ko: ByRef' 매개 변수에 대한 참조는 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować odwołań do parametrów „ByRef” na drzewo wyrażenia.
pt_br: Não é possível converter referências para parâmetros 'ByRef' para uma árvore de expressão.
ru: Ссылки на параметры "ByRef" не могут быть преобразованы в дерево выражений.
tr: ByRef' parametrelerine yapılan başvurular ifade ağacına dönüştürülemiyor.
zh_hans: 对“ByRef”参数的引用无法转换为表达式树。
zh_hant: ByRef' 參數的參考不可轉換成運算式樹狀結構。

# ERR_DuplicateAnonTypeMemberName1
source: Anonymous type member or property '{0}' is already declared.
cs: Člen anonymního typu nebo vlastnost {0} jsou už deklarované.
de: Der Member oder die Eigenschaft "{0}" des anonymen Typs wurde bereits deklariert.
es: El miembro de tipo anónimo o la propiedad '{0}' están ya declarados.
fr: Le membre de type anonyme ou la propriété '{0}' est déjà déclaré.
it: La proprietà o il membro di tipo anonimo '{0}' è già dichiarato.
ja: 匿名型のメンバーまたはプロパティ '{0}' は既に宣言されています。
ko: 익명 형식 멤버 또는 속성 '{0}'이(가) 이미 선언되어 있습니다.
pl: Składowa lub właściwość typu anonimowego „{0}” jest już zadeklarowana.
pt_br: Membro de tipo anônimo ou propriedade "{0}" já está declarado.
ru: Анонимный член типа или свойство "{0}" уже объявлены.
tr: Anonim türdeki '{0}' üyesi veya özelliği zaten bildirildi.
zh_hans: 已声明匿名类型成员或属性“{0}”。
zh_hant: 匿名類型成員或屬性 '{0}' 已宣告。
