Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_IdentNotMemberOfInterface4
source: '{0}' cannot implement '{1}' because there is no matching {2} on interface '{3}'.
cs: 'Rozhraní {0} nemůže implementovat metodu {1}, protože rozhraní {3} neobsahuje odpovídající metodu {2}.
de: '"{0}" kann "{1}" nicht implementieren, da keine entsprechende "{2}" in der Schnittstelle "{3}" vorhanden ist.
es: '{0}' no puede implementar '{1}' porque no existe su '{2}' correspondiente en la interfaz '{3}'.
fr: '{0}' ne peut pas implémenter '{1}', car il n'existe pas de {2} correspondant pour l'interface '{3}'.
it: '{0}' non può implementare '{1}' perché non esiste un elemento {2} corrispondente nell'interfaccia '{3}'.
ja: '{0}' で '{1}' を実装できません。インターフェイス '{3}' に、対応する {2} がありません。
ko: '{3}' 인터페이스에 일치하는 {2}이(가) 없으므로 '{0}'에서 '{1}'을(를) 구현할 수 없습니다.
pl: 'Element „{0}” nie może zaimplementować elementu „{1}”, ponieważ nie ma pasującego elementu {2} w interfejsie „{3}”.
pt_br: "{0}" não pode implementar "{1}" porque não há correspondência {2} na interface "{3}".
ru: "{0}" не может реализовать "{1}", поскольку нет соответствующего {2} в интерфейсе "{3}".
tr: '{3}' arabiriminde eşleşen {2} olmadığından, '{0}' '{1}' öğesini uygulayamıyor.
zh_hans: '“{0}”无法实现“{1}”，因为接口“{3}”上不存在匹配的 {2}。
zh_hant: '{0}' 無法實作 '{1}'，因為在介面 '{3}' 上沒有相符的 {2}。

# ERR_ImplementingInterfaceWithDifferentTupleNames5
source: '{0}' cannot implement {1} '{2}' on interface '{3}' because the tuple element names in '{4}' do not match those in '{5}'.
cs: '{0} nemůže implementovat {1} {2} v rozhraní {3}, protože názvy elementů řazené kolekce členů v {4} neodpovídá názvům elementů v {5}.
de: '"{0}" kann {1} "{2}" für die Schnittstelle "{3}" nicht implementieren, weil die Tupelelementnamen in "{4}" nicht mit den Namen in "{5}" übereinstimmen.
es: '{0}' no puede implementar {1} '{2}' en la interfaz '{3}' porque los nombres de elementos de tupla de '{4}' no coinciden con los de '{5}'.
fr: '{0}' ne peut pas implémenter {1} '{2}' sur l'interface '{3}', car les noms d'éléments tuples dans '{4}' ne correspondent pas à ceux dans '{5}'.
it: '{0}' non può implementare {1} '{2}' nell'interfaccia '{3}' perché i nomi di elementi di tupla in '{4}' non corrispondono a quelli in '{5}'.
ja: '{4}' のタプル要素名が '{5}' のタプル要素名と一致しないため、'{0}' はインターフェイス '{3}' に {1} '{2}' を実装できません。
ko: '{4}'의 튜플 요소 이름이 '{5}'의 이름과 일치하지 않으므로 '{0}'은(는) '{3}' 인터페이스에서 {1} '{2}'을(를) 구현할 수 없습니다.
pl: 'Element „{0}” nie może implementować elementu {1} „{2}” w ramach interfejsu „{3}”, ponieważ nazwy elementów krotki w elemencie „{4}” nie pasują do nazw w elemencie „{5}”.
pt_br: '{0}' não pode implementar {1} '{2}' na interface '{3}' porque os nomes dos elementos de tupla em '{4}' não correspondem àqueles em '{5}'.
ru: "{0}" не может реализовать {1} "{2}" в интерфейсе "{3}", так как имена элементов кортежа в "{4}" не соответствуют именам в "{5}".
tr: '{4}' içindeki demet öğesi adları '{5}' içindekilerle eşleşmediğinden, '{0}' tarafından '{3}' arabirimi üzerinde '{2}' adlı {1} uygulanamıyor.
zh_hans: '“{0}”不能在接口“{3}”上实现{1}“{2}”，因为“{4}”中的元组元素名称与“{5}”中的名称不匹配。
zh_hant: '因為 '{4}' 中的 Tuple 項目名稱與 '{5}' 中的 Tuple 項目名稱不相符，導致 '{0}' 無法在介面 '{3}' 上實作 {1} '{2}'。

# ERR_WithEventsRequiresClass
source: 'WithEvents' variables must have an 'As' clause.
cs: 'Proměnné WithEvents musí mít klauzuli As.
de: 'WithEvents-Variablen müssen eine As-Klausel haben.
es: 'Las variables 'WithEvents' deben tener una cláusula 'As'.
fr: 'Les variables 'WithEvents' doivent comporter une clause 'As'.
it: 'Le variabili 'WithEvents' devono avere una clausola 'As'.
ja: 'WithEvents' 変数には 'As' 句を指定しなければなりません。
ko: 'WithEvents' 변수에는 'As' 절이 있어야 합니다.
pl: 'Zmienne WithEvents muszą mieć klauzulę As.
pt_br: 'Variáveis 'WithEvents' devem possuir uma cláusula 'As'.
ru: 'Объявления переменных с модификатором "WithEvents" должны иметь предложение "As".
tr: 'WithEvents' değişkenlerinde 'As' yan tümcesi olmalıdır.
zh_hans: '"WithEvents" 变量必须有 "As" 子句。
zh_hant: 'WithEvents' 變數必須要有 'As' 子句。

# ERR_WithEventsAsStruct
source: 'WithEvents' variables can only be typed as classes, interfaces or type parameters with class constraints.
cs: 'Proměnné s deklarací WithEvents můžou být jenom typu třída, rozhraní nebo parametr typu s omezeními třídy.
de: 'WithEvents-Variablen können nur als Klassen, Schnittstellen oder Typparameter mit Klasseneinschränkungen typisiert werden.
es: 'Las variables 'WithEvents' solo se pueden escribir como clases, interfaces o parámetros de tipo con restricciones de clase.
fr: 'Les variables 'WithEvents' peuvent seulement être de type classe, interface ou paramètre de type avec des contraintes de classe.
it: 'È possibile tipizzare le variabili 'WithEvents' solo come classi, interfacce o parametri di tipo con vincoli di classe.
ja: 'WithEvents' 変数は、クラス、インターフェイス、またはクラス制約のある型パラメーターとしてのみ型指定することができます。
ko: 'WithEvents' 변수는 클래스, 인터페이스 또는 클래스 제약 조건이 있는 형식 매개 변수로만 형식화될 수 있습니다.
pl: 'Zmienne „WithEvents” można określać tylko jako klasy, interfejsy lub parametry typu z ograniczeniami klasy.
pt_br: 'Variáveis 'WithEvents' só podem ser digitadas como classes, interfaces ou parâmetros de tipo com restrições de classe.
ru: 'Типы переменных с модификатором "WithEvents" могут быть только классами, интерфейсами или параметрами типов с ограничениями классов.
tr: 'WithEvents' değişkenleri yalnızca sınıf kısıtlamalarına sahip sınıf, arabirim veya tür parametreleri türünde olabilir.
zh_hans: '"WithEvents" 变量只能类型化为具有类约束的类、接口或类型参数。
zh_hant: 'WithEvents' 變數類型只能設定為具有類別條件約束的類別、介面或類型參數。

# ERR_ConvertArrayRankMismatch2
source: Value of type '{0}' cannot be converted to '{1}' because the array types have different numbers of dimensions.
cs: Hodnotu typu {0} nejde převést na typ {1}, protože typy polí mají různý počet rozměrů.
de: Der Wert des Typs "{0}" kann nicht in "{1}" konvertiert werden, da die Arraytypen eine unterschiedliche Anzahl von Dimensionen haben.
es: El valor de tipo '{0}' no se puede convertir en '{1}' porque los tipos de matriz tienen un número diferente de dimensiones.
fr: Impossible de convertir une valeur de type '{0}' en '{1}', car les types tableau ont des nombres de dimensions différents.
it: Non è possibile convertire il valore di tipo '{0}' in '{1}' perché i tipi matrice hanno numeri di dimensioni diversi.
ja: 配列型の次元数が異なるため、型 '{0}' の値を '{1}' に変換できません。
ko: 형식이 다른 두 배열의 차수가 달라 '{0}' 형식의 값을 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości typu „{0}” na „{1}”, ponieważ typy tablic mają różną liczbę wymiarów.
pt_br: Valor de tipo "{0}" não pode ser convertido em "{1}" porque os tipos de matriz têm números diferentes de dimensões.
ru: Значение типа "{0}" невозможно преобразовать в "{1}", так как в типах массивов указано различное количество измерений.
tr: Dizi türlerinin boyut sayıları farklı olduğundan, '{0}' türünün değeri '{1}' olarak dönüştürülemez.
zh_hans: 类型“{0}”的值无法转换为“{1}”，原因是数组类型的维数不同。
zh_hant: 類型 '{0}' 的值無法轉換成 '{1}'，因為陣列類型的維度數目不同。

# ERR_RedimRankMismatch
source: 'ReDim' cannot change the number of dimensions of an array.
cs: 'Příkaz ReDim nemůže měnit počet rozměrů pole.
de: 'ReDim kann die Anzahl der Dimensionen eines Arrays nicht ändern.
es: 'ReDim' no puede cambiar el número de dimensiones de una matriz.
fr: 'ReDim' ne peut pas changer le nombre de dimensions d'un tableau.
it: 'ReDim' non può modificare il numero di dimensioni di una matrice.
ja: 'ReDim' によって配列の次元数を変更することはできません。
ko: 'ReDim'은 배열의 차수를 변경할 수 없습니다.
pl: 'Nie można zmienić liczby wymiarów tablicy przy użyciu instrukcji ReDim.
pt_br: 'ReDim' não pode alterar o número de dimensões de uma matriz.
ru: '"ReDim" не может изменять число измерений массива.
tr: 'ReDim' dizinin boyut sayısını değiştiremez.
zh_hans: '"ReDim" 无法更改数组的维数。
zh_hant: 'ReDim' 無法變更陣列的維度數目。

# ERR_StartupCodeNotFound1
source: 'Sub Main' was not found in '{0}'.
cs: 'Procedura Sub Main se v {0} nenašla.
de: '"Sub Main" wurde nicht in "{0}" gefunden.
es: 'No se encontró 'Sub Main' en '{0}'.
fr: 'Sub Main' est introuvable dans '{0}'.
it: 'Sub Main' non è stato trovato in '{0}'.
ja: 'Sub Main' が、'{0}' に見つかりませんでした。
ko: '{0}'에서 'Sub Main'을 찾을 수 없습니다.
pl: 'Nie odnaleziono instrukcji „Sub Main” w elemencie „{0}”.
pt_br: "Sub Main" não foi encontrado em "{0}".
ru: 'Не удалось найти "Sub Main" в "{0}".
tr: '{0}' içinde 'Sub Main' bulunamadı.
zh_hans: '“{0}”中找不到“Sub Main”。
zh_hant: '在 '{0}' 中找不到 'Sub Main'。

# ERR_ConstAsNonConstant
source: Constants must be of an intrinsic or enumerated type, not a class, structure, type parameter, or array type.
cs: Konstanty musí být vnitřního nebo výčtového typu, ne třída, struktura, parametr typu nebo typ pole.
de: Konstanten müssen einen systeminternen oder enumerierten Typ aufweisen, keinen Klassen-, Struktur-, Typparameter- oder Arraytyp.
es: Las constantes deben ser de tipo intrínseco o enumerado, no pueden ser de tipo clase, estructura, parámetro de tipo ni matriz.
fr: Les constantes doivent être de type intrinsèque ou énuméré, et non de type classe, structure, paramètre de type ou tableau.
it: Le costanti devono essere di tipo intrinseco o enumerato, non di tipo classe, struttura, parametro di tipo o matrice.
ja: 定数は、クラス、構造体、または配列型ではなく、組み込み型か列挙型でなければなりません。
ko: 상수는 클래스, 구조체, 형식 매개 변수 또는 배열 형식이 아닌 내장 또는 열거 형식이어야 합니다.
pl: Stałe muszą być typu wewnętrznego lub wyliczeniowego, a nie typu klasy, struktury, parametru typu lub tablicy.
pt_br: Constantes devem ser do tipo intrínseco ou enumerado, e não classe, estrutura, tipo de parâmetro ou tipo de matriz.
ru: Константы должны быть значениями встроенного типа или типа перечисления, а не классом, структурой, параметром-типом или массивом.
tr: Sabitler gerçek veya sabit listesi türünde olmalıdır; sınıf, yapı, tür parametresi veya dizi türünde olamaz.
zh_hans: 常量必须是内部类型或者枚举类型，不能是类、结构、类型参数或数组类型。
zh_hant: 常數必須是內建或列舉類型，而不是類別、結構、類型參數或陣列類型。

# ERR_InvalidEndSub
source: 'End Sub' must be preceded by a matching 'Sub'.
cs: 'Příkazu End Sub musí předcházet párový příkaz Sub.
de: '"End Sub" muss ein entsprechendes "Sub" voranstehen.
es: 'End Sub' debe ir precedida de la instrucción 'Sub' correspondiente.
fr: 'End Sub' doit être précédé d'un 'Sub' correspondant.
it: 'End Sub' deve essere preceduto da un elemento 'Sub' corrispondente.
ja: 'End Sub' の前には、対応する 'Sub' を指定しなければなりません。
ko: 'End Sub'는 짝이 되는 'Sub' 뒤에 와야 합니다.
pl: 'Instrukcja End Sub musi być poprzedzona odpowiadającą jej instrukcją Sub.
pt_br: 'End Sub' deve ser precedido por 'Sub' correspondente.
ru: 'Оператору "End Sub" должен предшествовать соответствующий оператор "Sub".
tr: 'End Sub' öncesinde eşleşen bir 'Sub' olmalıdır.
zh_hans: '“End Sub”前面必须是匹配的“Sub”。
zh_hant: 'End Sub' 之前必須搭配相對應的 'Sub'。

# ERR_InvalidEndFunction
source: 'End Function' must be preceded by a matching 'Function'.
cs: 'Příkazu End Function musí předcházet párový příkaz Function.
de: '"End Function" muss ein entsprechendes "Function" voranstehen.
es: 'End Function' debe ir precedida de la instrucción 'Function' correspondiente.
fr: 'End Function' doit être précédé d'un 'Function' correspondant.
it: 'End Function' deve essere preceduto da un elemento 'Function' corrispondente.
ja: 'End Function' の前には、対応する 'Function' を指定しなければなりません。
ko: 'End Function'은 짝이 되는 'Function' 뒤에 와야 합니다.
pl: 'Instrukcja End Function musi być poprzedzona odpowiadającą jej instrukcją Function.
pt_br: 'End Function' deve ser precedido por 'Function' correspondente.
ru: 'Оператору "End Function" должен предшествовать соответствующий оператор "Function".
tr: 'End Function' öncesinde eşleşen bir 'Function' olmalıdır.
zh_hans: '“End Function”前面必须是匹配的“Function”。
zh_hant: 'End Function' 之前必須搭配相對應的 'Function'。

# ERR_InvalidEndProperty
source: 'End Property' must be preceded by a matching 'Property'.
cs: 'Příkazu End Property musí předcházet párový příkaz Property.
de: '"End Property" muss ein entsprechendes "Property" voranstehen.
es: 'End Property' debe ir precedida de la instrucción 'Property' correspondiente.
fr: 'End Property' doit être précédé d'un 'Property' correspondant.
it: 'End Property' deve essere preceduto da un elemento 'Property' corrispondente.
ja: 'End Property' の前には、対応する 'Property' を指定しなければなりません。
ko: 'End Property'는 짝이 되는 'Property' 뒤에 와야 합니다.
pl: 'Instrukcja End Property musi być poprzedzona odpowiadającą jej instrukcją Property.
pt_br: 'End Property' deve ser precedido por 'Property' correspondente.
ru: 'Оператору "End Property" должен предшествовать соответствующий оператор "Property".
tr: 'End Property' öncesinde eşleşen bir 'Property' olmalıdır.
zh_hans: '“End Property”前面必须是匹配的“Property”。
zh_hant: 'End Property' 之前必須搭配相對應的 'Property'。

# ERR_ModuleCantUseMethodSpecifier1
source: Methods in a Module cannot be declared '{0}'.
cs: Pro metody v modulu nejde použít deklaraci {0}.
de: Methoden in einem Modul können nicht als "{0}" deklariert werden.
es: Los métodos de un módulo no se pueden declarar como '{0}'.
fr: Les méthodes d'un module ne peuvent pas être déclarées '{0}'.
it: I metodi di un modulo non possono essere dichiarati come '{0}'.
ja: モジュールのメソッドを '{0}' として宣言できません。
ko: 모듈의 메서드는 '{0}'(으)로 선언할 수 없습니다.
pl: Metody w module nie mogą być zadeklarowane jako „{0}”.
pt_br: Métodos em um Módulo não podem ser declarados "{0}".
ru: Методы в модуле не могут объявляться как "{0}".
tr: Modül içindeki yöntemler '{0}' olarak bildirilemez.
zh_hans: 模块中的方法不能声明为“{0}”。
zh_hant: Module 中的方法不可宣告為 '{0}'。

# ERR_ModuleCantUseEventSpecifier1
source: Events in a Module cannot be declared '{0}'.
cs: Pro události v modulu nejde použít deklaraci {0}.
de: Ereignisse in einem Modul können nicht als "{0}" deklariert werden.
es: Los eventos de un módulo no se pueden declarar como '{0}'.
fr: Les événements d'un module ne peuvent pas être déclarés '{0}'.
it: Gli eventi di un modulo non possono essere dichiarati come '{0}'.
ja: モジュールのイベントを '{0}' として宣言できません。
ko: 모듈의 이벤트는 '{0}'(으)로 선언할 수 없습니다.
pl: Zdarzenia w module nie mogą być zadeklarowane jako „{0}”.
pt_br: Eventos em um Módulo não podem ser declarados "{0}".
ru: События в модуле не могут объявляться как "{0}".
tr: Modül içindeki olaylar '{0}' olarak bildirilemez.
zh_hans: 模块中的事件不能声明为“{0}”。
zh_hant: Module 中的事件不可宣告為 '{0}'。

# ERR_StructCantUseVarSpecifier1
source: Members in a Structure cannot be declared '{0}'.
cs: Pro členy ve struktuře nelze použít deklaraci {0}.
de: Member in einer Struktur können nicht als "{0}" deklariert werden.
es: Los miembros de una estructura no se pueden declarar como '{0}'.
fr: Les membres d'une structure ne peuvent pas être déclarés '{0}'.
it: I membri di una struttura non possono essere dichiarati come '{0}'.
ja: 構造体のメンバーを '{0}' として宣言できません。
ko: 구조체의 멤버는 '{0}'(으)로 선언할 수 없습니다.
pl: Nie można zadeklarować składowych w strukturze jako „{0}”.
pt_br: Membros em uma Estrutura não podem ser declarados "{0}".
ru: Члены в структуре не могут быть объявлены как "{0}".
tr: Yapıdaki üyeler '{0}' olarak bildirilemez.
zh_hans: 结构中的成员不能声明为“{0}”。
zh_hant: 結構中的成員不可宣告為 '{0}'。

# ERR_InvalidOverrideDueToReturn2
source: '{0}' cannot override '{1}' because they differ by their return types.
cs: '{0} nemůže přepsat {1}, protože se liší typy vrácených hodnot.
de: '"{0}" kann "{1}" nicht überschreiben, da sie sich durch ihre Rückgabetypen unterscheiden.
es: '{0}' no puede invalidar '{1}' porque se diferencian en sus tipos de valor devuelto.
fr: '{0}' ne peut pas se substituer à '{1}', car leurs types de retour ne sont pas identiques.
it: '{0}' non può eseguire l'override di '{1}' perché i tipi restituiti sono diversi.
ja: '戻り値の型が異なるため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '반환 형식이 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ różnią się one zwracanym typem.
pt_br: "{0}" não pode substituir "{1}" porque diferem por seus tipos de retorno.
ru: "{0}" не может переопределить "{1}", так как их возвращаемые типы различны.
tr: 'Dönüş türleri farklı olduğundan '{0}', '{1}' öğesini geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们的返回类型不同。
zh_hant: '{0}' 無法覆寫 '{1}'，因為它們的傳回類型不同。

# WRN_InvalidOverrideDueToTupleNames2
source: '{0}' cannot override '{1}' because they differ by their tuple element names.
cs: '{0} nemůže přepsat {1}, protože se liší v názvech elementů řazené kolekce členů.
de: '"{0}" kann "{1}" nicht überschreiben, weil sich die Tupelelementnamen unterscheiden.
es: '{0}' no puede reemplazar a '{1}' porque tienen nombres de elementos de tupla diferentes.
fr: '{0}' ne peut pas se substituer à '{1}' car leurs noms d'éléments tuples sont différents.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i nomi di elementi di tupla.
ja: 'タプル要素名が異なるため、'{0}' は '{1}' をオーバーライドできません。
ko: '튜플 요소 이름이 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ różnią się nazwami elementów krotki.
pt_br: '{0}' não pode substituir '{1}' porque eles diferem em seus nomes de elemento de tupla.
ru: "{0}" не может переопределять "{1}", так как они отличаются именами элементов кортежа.
tr: '{1}', demet öğesi adları farklı olduğundan '{0}' tarafından geçersiz kılınamıyor.
zh_hans: '“{0}”不能替代“{1}”，因为它们的元组元素名称不同。
zh_hant: '因為 '{0}' 的 Tuple 項目名稱各不相同，所以無法覆寫 '{1}'。

# WRN_InvalidOverrideDueToTupleNames2_Title
source: Member cannot override because it differs by its tuple element names.
cs: Člen se nedá přepsat, protože se liší svými názvy elementů řazené kolekce členů.
de: Der Member kann nicht überschreiben, weil er sich durch seine Tupeleelementnamen unterscheidet.
es: El miembro no se puede invalidar porque tiene nombres de elementos de tupla diferentes.
fr: Le membre ne peut pas procéder à la substitution car ses noms d'éléments tuples sont différents.
it: Il membro non può eseguire l'override perché si differenzia per i nomi di elementi di tupla.
ja: タプル要素名が異なるために、メンバーをオーバーライドできません。
ko: 튜플 요소 이름이 서로 다르므로 멤버를 재정의할 수 없습니다.
pl: Składowa nie może przesłaniać, ponieważ różni się nazwami elementów krotki.
pt_br: O membro não pode substituir porque ele difere segundo seus nomes de elementos de tupla.
ru: Переопределение с помощью члена невозможно, так как его имена элементов кортежа отличаются.
tr: Demet öğesi adları farklı olduğundan üye geçersiz kılamaz.
zh_hans: 成员不能替代，因为它的元组元素名称不同。
zh_hant: 因為成員的 Tuple 項目名稱各不相同，所以無法覆寫。

# ERR_ConstantWithNoValue
source: Constants must have a value.
cs: Konstanty musí mít hodnotu.
de: Konstanten müssen einen Wert erhalten.
es: Las constantes deben tener un valor.
fr: Les constantes doivent avoir une valeur.
it: Le costanti devono avere un valore.
ja: 定数には、値を指定しなければなりません。
ko: 상수에는 값이 있어야 합니다.
pl: Stałe muszą mieć wartość.
pt_br: Constantes devem ter um valor.
ru: Константы должны иметь значения.
tr: Sabitlerin bir değeri olması gerekir.
zh_hans: 常量必须具有值。
zh_hant: 必須有常數值。

# ERR_ExpressionOverflow1
source: Constant expression not representable in type '{0}'.
cs: Konstantní výraz nejde reprezentovat typem {0}.
de: Der Konstantenausdruck ist in Typ "{0}" nicht repräsentierbar.
es: La expresión constante no se puede representar en el tipo '{0}'.
fr: L'expression constante n'est pas représentable dans le type '{0}'.
it: Espressione costante non rappresentabile nel tipo '{0}'.
ja: 型 '{0}' では表現できない定数式です。
ko: 상수 식은 '{0}' 형식으로 표현할 수 없습니다.
pl: Nieprawidłowa reprezentacja wyrażenia stałego w typie „{0}”.
pt_br: Expressão de constante não representável no tipo "{0}".
ru: Константное выражение не может быть представлено как имеющее тип "{0}".
tr: Sabit ifade '{0}' türünde gösterilebilir değil.
zh_hans: 常量表达式无法在类型“{0}”中表示。
zh_hant: 在類型 '{0}' 中無法呈現常數運算式。

# ERR_DuplicatePropertyGet
source: 'Get' is already declared.
cs: 'Metoda Get už je deklarovaná.
de: '"Get" wurde bereits deklariert.
es: 'Get' está ya declarado.
fr: 'Get' est déjà déclaré.
it: 'Get' è già dichiarato.
ja: 'Get' は既に宣言されています。
ko: 'Get'이 이미 선언되었습니다.
pl: 'Element „Get” jest już zadeklarowany.
pt_br: 'Get' já está declarado.
ru: 'Процедура "Get" уже объявлена.
tr: 'Get' zaten bildirildi.
zh_hans: '已声明 "Get"。
zh_hant: 'Get' 已宣告。

# ERR_DuplicatePropertySet
source: 'Set' is already declared.
cs: 'Metoda Set už je deklarovaná.
de: '"Set" wurde bereits deklariert.
es: 'Set' está ya declarado.
fr: 'Set' est déjà déclaré.
it: 'Set' è già dichiarato.
ja: 'Set' は既に宣言されています。
ko: 'Set'이 이미 선언되었습니다.
pl: 'Element „Set” jest już zadeklarowany.
pt_br: 'Set' já está declarado.
ru: 'Процедура "Set" уже объявлена.
tr: 'Set' zaten bildirildi.
zh_hans: '已声明 "Set"。
zh_hant: 'Set' 已宣告。

# ERR_NameNotDeclared1
source: '{0}' is not declared. It may be inaccessible due to its protection level.
cs: '{0} není deklarované. Může být z důvodu úrovně ochrany nepřístupné.
de: '"{0}" wurde nicht deklariert. Aufgrund der Schutzstufe ist unter Umständen kein Zugriff möglich.
es: '{0}' no está declarado. Puede que sea inaccesible debido a su nivel de protección.
fr: '{0}' n'est pas déclaré. Il peut être inaccessible en raison de son niveau de protection.
it: '{0}' non è dichiarato. Potrebbe essere inaccessibile a causa del livello di protezione.
ja: '{0}' は宣言されていません。アクセスできない保護レベルになっています。
ko: '{0}'이(가) 선언되지 않았습니다. 해당 보호 수준 때문에 액세스할 수 없습니다.
pl: 'Element „{0}” nie został zadeklarowany. Może on być niedostępny z powodu swojego poziomu ochrony.
pt_br: "{0}" não está declarado. Ele pode estar inacessível devido ao seu nível de proteção.
ru: "{0}" не объявлена. Возможно, она недоступна из-за своего уровня защиты.
tr: '{0}' bildirilmedi. Koruma düzeyi nedeniyle erişilemez durumda olabilir.
zh_hans: '未声明“{0}”。由于其保护级别，它可能无法访问。
zh_hant: '{0}' 未宣告。由於其保護層級，可能無法對其進行存取。

# ERR_BinaryOperands3
source: Operator '{0}' is not defined for types '{1}' and '{2}'.
cs: Operátor {0} není definovaný pro typy {1} a {2}.
de: Der {0}-Operator ist für die Typen "{1}" und "{2}" nicht definiert.
es: El operador '{0}' no está definido por los tipos '{1}' y '{2}'.
fr: L'opérateur '{0}' n'est pas défini pour les types '{1}' et '{2}'.
it: L'operatore '{0}' non è definito per i tipi '{1}' e '{2}'.
ja: 演算子 '{0}' は、型 '{1}' および '{2}' に対して定義されていません。
ko: '{1}' 및 '{2}' 형식에 대한 '{0}' 연산자가 정의되지 않았습니다.
pl: Operator „{0}” nie jest zdefiniowany dla typu „{1}” i „{2}”.
pt_br: Operador "{0}" não está definido para tipos "{1}" e "{2}".
ru: Оператор "{0}" не определен для типов "{1}" и "{2}".
tr: '{0}' işleci '{1}' ve '{2}' türleri için tanımlanmadı.
zh_hans: 没有为类型“{1}”和“{2}”定义运算符“{0}”。
zh_hant: 未對類型 '{1}' 和 '{2}' 定義運算子 '{0}'。

# ERR_ExpectedProcedure
source: Expression is not a method.
cs: Výraz není metoda.
de: Der Ausdruck ist keine Methode.
es: La expresión no es un método.
fr: L'expression n'est pas une méthode.
it: L'espressione non è un metodo.
ja: 式はメソッドではありません。
ko: 식이 메서드가 아닙니다.
pl: Wyrażenie nie jest metodą.
pt_br: Expressão não é um método.
ru: Выражение не является методом.
tr: İfade bir yöntem değil.
zh_hans: 表达式不是方法。
zh_hant: 運算式不是方法。

# ERR_OmittedArgument2
source: Argument not specified for parameter '{0}' of '{1}'.
cs: Není zadaný argument pro parametr {0} metody {1}.
de: Für den Parameter "{0}" von "{1}" wurde kein Argument angegeben.
es: No se especificó un argumento para el parámetro '{0}' de '{1}'.
fr: Argument non spécifié pour le paramètre '{0}' de '{1}'.
it: L'argomento non è stato specificato per il parametro '{0}' di '{1}'.
ja: '{1}' のパラメーター '{0}' に対して引数が指定されていません。
ko: '{1}'의 '{0}' 매개 변수에는 인수가 지정되어 있지 않습니다.
pl: Nie określono argumentu dla parametru „{0}” elementu „{1}”.
pt_br: Argumento não especificado para o parâmetro "{0}" de "{1}".
ru: Аргумент, не указанный для параметра "{0}" метода "{1}".
tr: '{0}' / '{1}' parametresi için bağımsız değişken belirtilmemiş.
zh_hans: 没有为“{1}”的形参“{0}”指定实参。
zh_hant: 未對 '{1}' 的參數 '{0}' 指定引數。
