Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoArgumentCountOverloadCandidates1
source: Overload resolution failed because no accessible '{0}' accepts this number of arguments.
cs: Rozlišení přetěžování se nezdařilo, protože tento počet argumentů nepřijímá žádná přístupná metoda {0}.
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" diese Anzahl von Argumenten akzeptiert.
es: Error de resolución de sobrecarga porque ninguna de las funciones '{0}' a las que se tiene acceso acepta este número de argumentos.
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible n'accepte ce nombre d'arguments.
it: La risoluzione dell'overload non è riuscita. Nessun elemento '{0}' accessibile accetta questo numero di argomenti.
ja: この引数の数を受け付ける '{0}' がないため、オーバーロードの解決に失敗しました。
ko: 지정한 개수의 인수를 허용하는 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다.
pl: Rozpoznanie przeciążenia nie powiodło się, ponieważ żaden z dostępnych elementów „{0}” nie akceptuje tej liczby argumentów.
pt_br: Falha na resolução de sobrecarga porque nenhum "{0}" acessível aceita este número de argumentos.
ru: Произошел сбой разрешения перегрузки, так как нет доступного "{0}", который принимает такое число аргументов.
tr: Hiçbir erişilebilir '{0}' bu sayıda bağımsız değişken kabul etmediğinden aşırı yükleme çözümlemesi başarısız oldu.
zh_hans: 重载决策失败，因为没有可访问的“{0}”接受此数目的参数。
zh_hant: 因為沒有可存取的 '{0}' 接受此引數數目，所以多載解析失敗。

# ERR_NoViableOverloadCandidates1
source: Overload resolution failed because no '{0}' is accessible.
cs: Rozlišení přetěžování se nezdařilo, protože není dostupná žádná metoda {0}.
de: Fehler bei der Überladungsauflösung, da keine "{0}" zugreifbar ist.
es: Error de resolución de sobrecarga porque no se tiene acceso a ninguna función '{0}'.
fr: La résolution de surcharge a échoué, car aucun '{0}' n'est accessible.
it: La risoluzione dell'overload non è riuscita perché nessun elemento '{0}' è accessibile.
ja: '{0}' にアクセスできないため、オーバーロードの解決に失敗しました。
ko: 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다.
pl: Rozpoznanie przeciążenia zakończyło się niepowodzeniem, ponieważ żaden z parametrów „{0}” nie jest dostępny.
pt_br: Resolução de sobrecarga falhou porque nenhum "{0}" está acessível.
ru: Произошел сбой разрешения перегрузки, так как нет доступа к "{0}".
tr: Hiçbir '{0}' erişilebilir olmadığından aşırı yükleme çözümlemesi başarısız oldu.
zh_hans: 重载决策失败，因为没有可访问的“{0}”。
zh_hant: 因為沒有任何可存取的 '{0}'，所以多載解析失敗。

# ERR_NoCallableOverloadCandidates2
source: Overload resolution failed because no accessible '{0}' can be called with these arguments:{1}
cs: Rozlišení přetěžování se nezdařilo, protože žádnou dostupnou metodu {0} nejde volat s těmito argumenty: {1}
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" mit diesen Argumenten aufgerufen werden kann: {1}
es: Error de resolución de sobrecarga porque no se puede llamar a ninguna de las funciones '{0}' a las que se tiene acceso con estos argumentos:{1}
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible ne peut être appelé avec ces arguments : {1}
it: La risoluzione dell'overload non è riuscita perché nessun elemento '{0}' accessibile può essere chiamato con questi argomenti: {1}
ja: これらの引数で呼び出せるアクセス可能な '{0}' がないため、オーバーロードの解決に失敗しました: {1}
ko: 이 인수로 호출할 수 있는 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다({1}).
pl: Ustalanie przeciążenia nie powiodło się, ponieważ brak jest dostępnego elementu „{0}”, który można wywołać z tymi argumentami: {1}
pt_br: Resolução de sobrecarga falhou porque nenhum "{0}" acessível pode ser chamado com estes argumentos:{1}
ru: Произошел сбой разрешения перегрузки, так как отсутствует доступный "{0}", который можно вызвать с этими аргументами: {1}
tr: Hiçbir erişilebilir '{0}' bu bağımsız değişkenlerle çağrılamayacağından aşırı yükleme çözümlemesi başarısız oldu:{1}
zh_hans: 重载决策失败，因为没有可使用这些参数调用的可访问“{0}”: {1}
zh_hant: 因為沒有可利用這些引數呼叫之可存取的 '{0}'，所以多載解析失敗: {1}

# ERR_BadOverloadCandidates2
source: Overload resolution failed because no accessible '{0}' can be called:{1}
cs: Rozlišení přetěžování se nezdařilo, protože žádnou dostupnou metodu {0} nejde volat s těmito argumenty: {1}.
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" aufgerufen werden kann: {1}
es: Error de resolución de sobrecarga porque no se puede llamar a ningún '{0}' accesible: {1}
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible ne peut être appelé : {1}
it: La risoluzione dell'overload non è riuscita perché non è possibile chiamare nessun elemento '{0}' accessibile: {1}
ja: 呼び出し可能でアクセス可能な '{0}' がないため、オーバーロードの解決に失敗しました:{1}
ko: 액세스 가능한 '{0}'을(를) 호출할 수 없어 오버로드를 확인하지 못했습니다({1}).
pl: Rozpoznanie przeciążenia nie powiodło się, ponieważ nie ma dostępnego elementu „{0}” do wywołania: {1}
pt_br: Resolução de sobrecarga falhou porque nenhum "{0}" acessível pode ser chamado:{1}
ru: Сбой при разрешении перегрузки, поскольку ни один из доступных "{0}" не может быть вызван:{1}
tr: Erişilebilir '{0}' çağrısı yapılamadığından aşırı yükleme çözümü başarısız oldu:{1}
zh_hans: 重载决策失败，原因是没有可访问的“{0}”可以进行调用:{1}
zh_hant: 多載解析失敗，因為無法呼叫可存取的 '{0}': {1}

# ERR_NoNonNarrowingOverloadCandidates2
source: Overload resolution failed because no accessible '{0}' can be called without a narrowing conversion:{1}
cs: Rozlišení přetěžování se nezdařilo, protože žádnou dostupnou metodu {0} nejde volat bez zužujícího převodu: {1}.
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" ohne einschränkende Konvertierung aufgerufen werden kann: {1}
es: Error de resolución de sobrecarga porque no se puede llamar a ninguna de las funciones '{0}' a las que se tiene acceso sin una conversión de restricción:{1}
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible ne peut être appelé sans conversion restrictive : {1}
it: La risoluzione dell'overload non è riuscita perché nessun '{0}' accessibile può essere chiamato senza una conversione che supporta un minor numero di dati: {1}
ja: 縮小変換しないで呼び出される、アクセス可能な '{0}' がないため、オーバーロードの解決に失敗しました: {1}
ko: 형식을 축소 변환하지 않고 호출할 수 있는 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다({1}).
pl: Ustalanie przeciążenia nie powiodło się, ponieważ brak jest dostępnego elementu „{0}”, którego można wywołać bez konwersji zawężającej: {1}.
pt_br: Resolução de sobrecarga falhou porque nenhum "{0}" acessível pode ser chamado sem um conversão de restrição:{1}
ru: Произошел сбой разрешения перегрузки, так как нет доступных "{0}", которые можно вызвать без сужающего преобразования:{1}
tr: Hiçbir erişilebilir '{0}' bir daraltma dönüştürmesi olmadan çağrılamayacağından aşırı yükleme çözümlemesi başarısız oldu:{1}
zh_hans: 重载决策失败，因为没有不使用收缩转换即可调用的可访问重载“{0}”: {1}
zh_hant: 因為沒有不需要縮減轉換即可呼叫之可存取的 '{0}'，所以多載解析失敗: {1}

# ERR_ArgumentNarrowing3
source: Argument matching parameter '{0}' narrows from '{1}' to '{2}'.
cs: Argument odpovídající parametru {0} je z rozsahu {1} až {2}.
de: Der Parameter "{0}" für den Argumentabgleich wird von "{1}" auf "{2}" eingeschränkt.
es: El parámetro '{0}' correspondiente al argumento se reduce de '{1}' a '{2}'.
fr: L'argument qui correspond au paramètre '{0}' passe de '{1}' à '{2}'.
it: Il parametro '{0}' di corrispondenza degli argomenti viene convertito da '{1}' al tipo di dati più piccolo '{2}'.
ja: パラメーター '{0}' と一致する引数は '{1}' から '{2}' へ引数照合します。
ko: '{0}' 매개 변수와 일치하는 인수는 '{1}'에서 '{2}'(으)로 한정됩니다.
pl: Dopasowywanie argumentu dla parametru „{0}” powoduje zawężenie typu „{1}” do typu „{2}”.
pt_br: O parâmetro de correspondência de argumento '{0}' restringe de '{1}' para '{2}'.
ru: Аргумент, соответствующий параметру "{0}", сужен с "{1}" до "{2}".
tr: '{0}' parametresiyle eşleşen bağımsız değişken '{1}' türünden '{2}' türüne daralıyor.
zh_hans: 与形参“{0}”匹配的实参从“{1}”收缩到“{2}”。
zh_hant: 與參數 '{0}' 對應的引數，從 '{1}' 縮減 '{2}'。

# ERR_NoMostSpecificOverload2
source: Overload resolution failed because no accessible '{0}' is most specific for these arguments:{1}
cs: Rozlišení přetěžování se nezdařilo, protože žádná dostupná metoda {0} není nejvíce specifická pro tyto argumenty: {1}.
de: Fehler bei der Überladungsauflösung, da keine zugreifbare "{0}" für diese Argumente am spezifischsten ist: {1}
es: Error de resolución de sobrecarga porque ninguna de las funciones '{0}' a las que se tiene acceso es más específica para estos argumentos:{1}
fr: La résolution de surcharge a échoué, car aucun '{0}' accessible n'est plus spécifique pour ces arguments : {1}
it: La risoluzione dell'overload non è riuscita perché nessun '{0}' accessibile è specifico per questi argomenti: {1}
ja: これらの引数に最も固有な、アクセス可能な '{0}' がないため、オーバーロードの解決に失敗しました: {1}
ko: 다음 인수에만 한정되는 액세스 가능한 '{0}'이(가) 없으므로 오버로드를 확인하지 못했습니다({1}).
pl: Ustalanie przeciążenia nie powiodło się, ponieważ brak jest dostępnego elementu „{0}”, który jest najbardziej konkretny dla tych argumentów: {1}.
pt_br: Resolução de sobrecarga falhou porque nenhum "{0}" acessível é mais específico para esses argumentos:{1}
ru: Произошел сбой разрешения перегрузки, так как нет доступного "{0}", который бы являлся наиболее конкретным для этих аргументов: {1}
tr: Hiçbir erişilebilir '{0}' bu bağımsız değişkenler için en belirgin olmadığından aşırı yükleme çözümlemesi başarısız oldu:{1}
zh_hans: 重载决策失败，因为没有可访问的“{0}”最适合这些参数: {1}
zh_hant: 因為沒有可存取的 '{0}' 對這些引數而言是最適合的，所以多載解析失敗: {1}

# ERR_NotMostSpecificOverload
source: Not most specific.
cs: Není nejvíce specifické.
de: Nicht spezifisch genug.
es: No es la más específica.
fr: Pas plus spécifique.
it: Non specifico.
ja: 最も固有ではありません。
ko: 한정적이지 않습니다.
pl: Brak specyficznego elementu.
pt_br: Não é o mais específico possível.
ru: Не является наиболее подходящим.
tr: En belirgin olan değil.
zh_hans: 不是最适合。
zh_hant: 並非最適合。

# ERR_NoGetProperty1
source: Property '{0}' is 'WriteOnly'.
cs: Vlastnost {0} je typu WriteOnly.
de: Die Eigenschaft "{0}" ist WriteOnly.
es: La propiedad '{0}' es 'WriteOnly'.
fr: La propriété '{0}' est 'WriteOnly'.
it: La proprietà '{0}' è 'WriteOnly'.
ja: プロパティ '{0}' は 'WriteOnly' です。
ko: '{0}' 속성은 'WriteOnly'입니다.
pl: Właściwość „{0}” jest tylko do zapisu.
pt_br: Propriedade "{0}" é "WriteOnly".
ru: Свойство "{0}" помечено как "WriteOnly".
tr: '{0}' özelliği 'WriteOnly'.
zh_hans: 属性“{0}”为“WriteOnly”。
zh_hant: 屬性 '{0}' 是 'WriteOnly'。

# ERR_NoSetProperty1
source: Property '{0}' is 'ReadOnly'.
cs: Vlastnost {0} je typu ReadOnly.
de: Die Eigenschaft "{0}" ist ReadOnly.
es: La propiedad '{0}' es 'ReadOnly'.
fr: La propriété '{0}' est 'ReadOnly'.
it: La proprietà '{0}' è 'ReadOnly'.
ja: プロパティ '{0}' は 'ReadOnly' です。
ko: '{0}' 속성이 'ReadOnly'입니다.
pl: Właściwość „{0}” jest tylko do odczytu.
pt_br: Propriedade "{0}" é "ReadOnly".
ru: Свойство "{0}" помечено как "ReadOnly".
tr: '{0}' özelliği 'ReadOnly'.
zh_hans: 属性“{0}”为“ReadOnly”。
zh_hant: 屬性 '{0}' 是 'ReadOnly'。

# ERR_ParamTypingInconsistency
source: All parameters must be explicitly typed if any of them are explicitly typed.
cs: Pokud je explicitně určený typ jednoho parametru, musí být explicitně určené typy všech parametrů.
de: Alle Parameter müssen explizit typisiert sein, wenn einer von ihnen explizit typisiert ist.
es: Todos los parámetros deben tener un tipo explícito si uno de ellos lo tiene.
fr: Tous les paramètres doivent être explicitement typés, si l'un d'eux est explicitement typé.
it: Se un parametro è tipizzato in modo esplicito, allora devono esserlo tutti i parametri.
ja: 明示的に型指定されているパラメーターが存在する場合、すべてのパラメーターが明示的に型指定されていなければなりません。
ko: 매개 변수 중 하나라도 명시적으로 형식화된 경우 모든 매개 변수를 명시적으로 형식화해야 합니다.
pl: Jeśli którekolwiek z parametrów mają jawnie określone typy, to wszystkie parametry muszą mieć jawnie określone typy.
pt_br: Todos os parâmetros deverão ser do tipo explícito caso algum deles seja do tipo explícito.
ru: Типы всех параметров должны быть указаны явно, если хотя бы один тип указан явно.
tr: Parametrelerden herhangi birinin türü açık olarak belirlendiğinde, tümünün türü açık olarak belirlenmelidir.
zh_hans: 如果任何一个参数已显式类型化，则所有参数都必须显式类型化。
zh_hant: 如果明確輸入任何一個參數，則必須明確輸入所有參數。

# ERR_ParamNameFunctionNameCollision
source: Parameter cannot have the same name as its defining function.
cs: Parametr nemůže mít stejný název jako funkce, která jej definuje.
de: Ein Parameter kann nicht den gleichen Namen haben wie die ihn definierende Funktion.
es: El parámetro no puede tener el mismo nombre que la función que lo define.
fr: Un paramètre ne peut pas avoir le même nom que sa fonction de définition.
it: Il parametro non può avere lo stesso nome della funzione che lo definisce.
ja: パラメーターを、定義する関数と同じ名前に設定することはできません。
ko: 매개 변수에는 자신을 정의하는 함수와 같은 이름을 사용할 수 없습니다.
pl: Parametr nie może mieć takiej samej nazwy jak definiująca go funkcja.
pt_br: O parâmetro não pode ter o mesmo nome da sua função de definição.
ru: Параметр не может иметь имя, совпадающее с именем определяющей его функции.
tr: Parametrenin adı kendisini tanımlayan işlevle aynı olamaz.
zh_hans: 参数不能与它的定义函数同名。
zh_hant: 函式名稱不可同時做為參數名稱。

# ERR_DateToDoubleConversion
source: Conversion from 'Date' to 'Double' requires calling the 'Date.ToOADate' method.
cs: Převod typu Date na typ Double vyžaduje volání metody Date.ToOADate.
de: Das Konvertieren von "Date" in "Double" erfordert den Aufruf der Methode "Date.ToOADate".
es: La conversión de 'Date' en 'Double' requiere llamar al método 'Date.ToOADate'.
fr: Pour convertir 'Date' en 'Double', vous devez appeler la méthode 'Date.ToOADate'.
it: Per la conversione da 'Date' a 'Double' è necessario chiamare il metodo 'Date.ToOADate'.
ja: Date' から 'Double' への変換には、'Date.ToOADate' メソッドの呼び出しが必要です。
ko: Date'를 'Double'로 변환하려면 'Date.ToOADate' 메서드를 호출해야 합니다.
pl: Konwersja typu Date na typ Double wymaga wywołania metody Date.ToOADate.
pt_br: A conversão de 'Date' para 'Double' requer a chamada do método 'Date.ToOADate'.
ru: Для преобразования из типа Date в Double требуется вызов метода Date.ToOADate.
tr: Date' türünden 'Double' türüne dönüştürme için 'Date.ToOADate' yönteminin çağrılması gerekir.
zh_hans: 从“Date”到“Double”的转换需要调用“Date.ToOADate”方法。
zh_hant: 要將 'Date' 轉換成 'Double' 需要呼叫 'Date.ToOADate' 方法。

# ERR_DoubleToDateConversion
source: Conversion from 'Double' to 'Date' requires calling the 'Date.FromOADate' method.
cs: Převod typu Double na typ Date vyžaduje volání metody Date.FromOADate.
de: Das Konvertieren von "Double" in "Date" erfordert den Aufruf der Methode "Date.FromOADate".
es: La conversión de 'Double' en 'Date' requiere llamar al método 'Date.FromOADate'.
fr: Pour convertir 'Double' en 'Date', vous devez appeler la méthode 'Date.FromOADate'.
it: Per la conversione da 'Double' a 'Date' è necessario chiamare il metodo 'Date.FromOADate'.
ja: Double' から 'Date' への変換には、'Date.FromOADate' メソッドの呼び出しが必要です。
ko: Double'을 'Date'로 변환하려면 'Date.FromOADate' 메서드를 호출해야 합니다.
pl: Konwersja typu Double na typ Date wymaga wywołania metody Date.FromOADate.
pt_br: A conversão de 'Double' para 'Date' requer a chamada do método 'Date.FromOADate'.
ru: Для преобразования из типа Date в Double требуется вызов метода Date.FromOADate.
tr: Double' türünden 'Date' türüne dönüştürme için 'Date.FromOADate' yönteminin çağrılması gerekir.
zh_hans: 从 "Double" 到 "Date" 的转换需要调用 "Date.FromOADate" 方法。
zh_hant: 要將 'Double' 轉換成 'Date' 需要呼叫 'Date.FromOADate' 方法。

# ERR_ZeroDivide
source: Division by zero occurred while evaluating this expression.
cs: Při vyhodnocování tohoto výrazu došlo k dělení nulou.
de: Beim Auswerten dieses Ausdrucks trat eine Division durch Null auf.
es: División entre cero al evaluar esta expresión.
fr: Une division par zéro s'est produite lors de l'évaluation de cette expression.
it: Si è verificata una divisione per zero durante la valutazione dell'espressione.
ja: この式の評価中に 0 による除算が発生しました。
ko: 이 식을 계산할 때 0으로 나눠졌습니다.
pl: Podczas obliczania tego wyrażenia wystąpiło dzielenie przez zero.
pt_br: Uma divisão por zero ocorreu durante a avaliação desta expressão.
ru: При вычислении этого выражения произошло деление на нуль.
tr: Bu ifadenin değeri hesaplanırken sıfır ile bölme durumu oluştu.
zh_hans: 计算此表达式时出现被零除的情况。
zh_hant: 評估此運算式時發生除數為零的情形。

# ERR_TryAndOnErrorDoNotMix
source: Method cannot contain both a 'Try' statement and an 'On Error' or 'Resume' statement.
cs: Metoda nemůže současně obsahovat příkaz Try a příkaz On Error nebo Resume.
de: Eine Methode kann nicht gleichzeitig eine Try-Anweisung und eine "On Error"- oder Resume-Anweisung enthalten.
es: El método no puede contener a la vez una instrucción 'Try' y una instrucción 'On Error' o 'Resume'.
fr: Une méthode ne peut pas contenir à la fois une instruction 'Try' et une instruction 'On Error' ou 'Resume'.
it: Il metodo non può contenere un'istruzione 'Try' insieme a un'istruzione 'On Error' o 'Resume'.
ja: メソッドに 'Try' ステートメントと 'On Error' または 'Resume' ステートメントの両方を含めることはできません。
ko: 메서드에는 'Try' 문과 함께 'On Error' 또는 'Resume' 문을 사용할 수 없습니다.
pl: Metoda nie może zawierać jednocześnie instrukcji Try i instrukcji On Error lub Resume.
pt_br: O método não pode conter instruções 'Try' e 'On Error' ou 'Resume'.
ru: Метод не может одновременно содержать оператор "Try" и оператор "On Error" или "Resume".
tr: Yöntem, hem bir 'Try' deyimi hem de 'On Error' veya 'Resume' deyimi içeremez.
zh_hans: 方法不能既包含 "Try" 语句，又包含 "On Error" 或 "Resume" 语句。
zh_hant: 方法不可以同時包含 'Try' 陳述式以及 'On Error' 或 'Resume' 陳述式。

# ERR_PropertyAccessIgnored
source: Property access must assign to the property or use its value.
cs: Při přístupu k vlastnosti musí proběhnout přiřazení vlastnosti nebo se musí použít její hodnota.
de: Eigenschaftenzugriff muss der Eigenschaft zugewiesen werden oder deren Wert verwenden.
es: Debe asignarse un acceso de propiedad a la propiedad o usar su valor.
fr: Un accès à la propriété doit assigner la propriété ou utiliser sa valeur.
it: L'accesso alla proprietà deve assegnare un valore alla proprietà o usare quello corrente.
ja: プロパティ アクセスはプロパティに割り当てるか、またはその値を使わなければなりません。
ko: 속성 액세스를 속성에 할당하거나 속성 액세스에서 속성 값을 사용해야 합니다.
pl: Operacja dostępu do właściwości musi przypisywać wartość właściwości lub używać jej wartości.
pt_br: O acesso à propriedade deve ser atribuído à propriedade ou usar seu valor.
ru: Доступ к свойству должен выполняться для присваивания или считывания его значения.
tr: Özellik erişimi özelliğe değer atamalı veya özelliğin değerini kullanmalıdır.
zh_hans: 属性访问必须分配给属性或使用属性值。
zh_hant: 屬性的存取必須是指定值給屬性或使用屬性值。

# ERR_InterfaceNoDefault1
source: '{0}' cannot be indexed because it has no default property.
cs: '{0} se nedá indexovat, protože nemá žádnou výchozí vlastnost.
de: '"{0}" kann nicht indiziert werden, da sie keine Standardeigenschaft hat.
es: 'No se puede indizar la clase '{0}' porque no tiene ninguna propiedad predeterminada.
fr: '{0}' ne peut pas être indexé, car il n'a pas de propriété par défaut.
it: 'Non è possibile indicizzare '{0}' perché non contiene proprietà predefinite.
ja: '{0}' には既定のプロパティがないため、インデックス処理を実行できません。
ko: '{0}'은(는) 기본 속성이 없으므로 인덱싱될 수 없습니다.
pl: 'Nie można zaindeksować elementu „{0}”, ponieważ nie ma on domyślnej właściwości.
pt_br: "{0}" não pode ser indexado porque não tem nenhuma propriedade padrão.
ru: "{0}" невозможно индексировать, поскольку он не содержит свойства по умолчанию.
tr: '{0}' öğesinin varsayılan özelliği olmadığından dizini oluşturulamaz.
zh_hans: '无法为“{0}”编制索引，因为它没有默认属性。
zh_hant: '無法對 '{0}' 編製索引，因為其無預設屬性。

# ERR_InvalidAssemblyAttribute1
source: Attribute '{0}' cannot be applied to an assembly.
cs: Atribut {0} nejde použít v sestavení.
de: Das Attribut "{0}" kann nicht auf eine Assembly angewendet werden.
es: El atributo '{0}' no se puede aplicar a un ensamblado.
fr: L'attribut '{0}' ne peut pas être appliqué à un assembly.
it: Non è possibile applicare l'attributo '{0}' a un assembly.
ja: 属性 '{0}' をアセンブリに適用できません。
ko: '{0}' 특성을 어셈블리에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „{0}” do zestawu.
pt_br: Atributo "{0}" não pode ser aplicado a um assembly.
ru: Атрибут "{0}" невозможно применить к сборке.
tr: '{0}' özniteliği bir derlemeye uygulanamaz.
zh_hans: 属性“{0}”不能应用于程序集。
zh_hant: 無法將屬性 '{0}' 套用至組件。

# ERR_InvalidModuleAttribute1
source: Attribute '{0}' cannot be applied to a module.
cs: Atribut {0} nejde použít v modulu.
de: Das Attribut "{0}" kann nicht auf ein Modul angewendet werden.
es: El atributo '{0}' no se puede aplicar a un módulo.
fr: L'attribut '{0}' ne peut pas être appliqué à un module.
it: Non è possibile applicare l'attributo '{0}' a un modulo.
ja: 属性 '{0}' をモジュールに適用できません。
ko: '{0}' 특성을 모듈에 적용할 수 없습니다.
pl: Nie można zastosować atrybutu „{0}” do modułu.
pt_br: Atributo "{0}" não pode ser aplicado a um módulo.
ru: Атрибут "{0}" невозможно применить к модулю.
tr: '{0}' özniteliği bir modüle uygulanamaz.
zh_hans: 属性“{0}”不能应用于模块。
zh_hant: 無法將屬性 '{0}' 套用至模組。

# ERR_AmbiguousInUnnamedNamespace1
source: '{0}' is ambiguous.
cs: '{0} je nejednoznačný.
de: '"{0}" ist mehrdeutig.
es: '{0}' es ambiguo.
fr: '{0}' est ambigu.
it: '{0}' è ambiguo.
ja: '{0}' はあいまいです。
ko: '{0}'이(가) 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny.
pt_br: "{0}" é ambíguo.
ru: "{0}" неоднозначен.
tr: '{0}' belirsiz.
zh_hans: '“{0}”不明确。
zh_hant: '{0}' 模稜兩可。

# ERR_DefaultMemberNotProperty1
source: Default member of '{0}' is not a property.
cs: Výchozí člen {0} není vlastností.
de: Der Standardmember von "{0}" ist keine Eigenschaft.
es: El miembro predeterminado de '{0}' no es una propiedad.
fr: Le membre '{0}' par défaut n'est pas une propriété.
it: Il membro predefinito '{0}' non è una proprietà.
ja: 既定のメンバー '{0}' はプロパティではありません。
ko: '{0}'의 기본 멤버는 속성이 아닙니다.
pl: Domyślna składowa elementu „{0}” nie jest właściwością.
pt_br: Membro padrão de "{0}" não é uma propriedade.
ru: Член по умолчанию "{0}" не является свойством.
tr: '{0}' varsayılan üyesi bir özellik değil.
zh_hans: “{0}”的默认成员不是属性。
zh_hant: '{0}' 的預設成員並非屬性。

# ERR_AmbiguousInNamespace2
source: '{0}' is ambiguous in the namespace '{1}'.
cs: 'Název {0} je nejednoznačný v oboru názvů {1}.
de: '"{0}" ist im Namespace "{1}" mehrdeutig.
es: '{0}' es ambiguo en el espacio de nombres '{1}'.
fr: '{0}' est ambigu dans l'espace de noms '{1}'.
it: '{0}' è ambiguo nello spazio dei nomi '{1}'.
ja: '{0}' は、名前空間 '{1}' ではあいまいです。
ko: '{0}'이(가) '{1}' 네임스페이스에서 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny w przestrzeni nazw „{1}”.
pt_br: "{0}" é ambíguo no namespace "{1}".
ru: "{0}" неоднозначен в пространстве имен "{1}".
tr: '{0}', '{1}' ad alanında belirsiz.
zh_hans: '“{1}”在命名空间中“{0}”不明确。
zh_hant: '{0}' 在命名空間 '{1}' 中模稜兩可。

# ERR_AmbiguousInImports2
source: '{0}' is ambiguous, imported from the namespaces or types '{1}'.
cs: 'Název {0} je nejednoznačný a importuje se z oboru názvů nebo typů {1}.
de: '"{0}" ist mehrdeutig, importiert aus den Namespaces oder Typen "{1}".
es: '{0}' es ambiguo y se ha importado de los espacios de nombres o tipos '{1}'.
fr: '{0}' est ambigu, importé des espaces de noms ou des types '{1}'.
it: '{0}' è ambiguo ed è importato dagli spazi dei nomi o dai tipi '{1}'.
ja: '名前空間または型 '{1}' からインポートされた '{0}' はあいまいです。
ko: '{1}' 네임스페이스 또는 형식에서 가져온 '{0}'이(가) 모호합니다.
pl: 'Element „{0}” jest niejednoznaczny. Element ten został zaimportowany z przestrzeni nazw lub typów: „{1}”.
pt_br: "{0}" é ambíguo, importado dos namespaces ou tipos "{1}".
ru: "{0}", импортированный из пространств имен или типов "{1}", является неоднозначным.
tr: '{1}' ad alanlarından veya türlerinden içeri aktarılan '{0}' belirsiz.
zh_hans: '“{0}”不明确，从命名空间或类型“{1}”导入。
zh_hant: '從命名空間或類型 '{1}' 匯入的 '{0}' 模稜兩可。
