Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ClassNotExpression1
source: '{0}' is a class type and cannot be used as an expression.
cs: '{0} je typ třídy a nejde ho použít jako výraz.
de: '"{0}" ist ein Klassentyp und kann nicht als Ausdruck verwendet werden.
es: '{0}' es un tipo de clase y no se puede usar como una expresión.
fr: '{0}' est un type classe et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è un tipo classe e non può essere usato come espressione.
ja: '{0}' はクラス型であり、式として使用することはできません。
ko: '{0}'은(는) 클래스 형식이므로 식으로 사용할 수 없습니다.
pl: 'Typem elementu „{0}” jest typ klasy i nie można go używać jako wyrażenia.
pt_br: "{0}" é um tipo de classe e não pode ser usado como uma expressão.
ru: "{0}" является типом класса и не может использоваться как выражение.
tr: '{0}' bir sınıf türüdür ve ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个类类型，不能用作表达式。
zh_hant: '{0}' 是類別類型，無法用做為運算式。

# ERR_StructureNotExpression1
source: '{0}' is a structure type and cannot be used as an expression.
cs: 'Typ {0} je strukturovaným typem a nejde ho použít jako výraz.
de: '"{0}" ist ein Strukturtyp und kann nicht als Ausdruck verwendet werden.
es: '{0}' es un tipo de estructura y no se puede usar como expresión.
fr: '{0}' est un type structure et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è un tipo struttura e non può essere usato come espressione.
ja: '{0}' は構造体型であり、式として使用することはできません。
ko: '{0}'은(는) 구조체 형식이므로 식으로 사용할 수 없습니다.
pl: 'Typem elementu „{0}” jest typ struktury i nie można go używać jako wyrażenia.
pt_br: "{0}" é um tipo de estrutura e não pode ser usado como uma expressão.
ru: "{0}" является типом структуры и не может использоваться в качестве выражения.
tr: '{0}' bir yapı türüdür ve ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个结构类型，不能用作表达式。
zh_hant: '{0}' 是結構類型，無法用做為運算式。

# ERR_InterfaceNotExpression1
source: '{0}' is an interface type and cannot be used as an expression.
cs: '{0} je typ rozhraní a nejde ho použít jako výraz.
de: '"{0}" ist ein Schnittstellentyp und kann nicht als Ausdruck verwendet werden.
es: '{0}' es un tipo de interfaz y no se puede usar como una expresión.
fr: '{0}' est un type interface et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è un tipo interfaccia e non può essere usato come espressione.
ja: '{0}' はインターフェイス型であり、式として使用することはできません。
ko: '{0}'은(는) 인터페이스 형식이므로 식으로 사용할 수 없습니다.
pl: 'Typem elementu „{0}” jest typ interfejsu i nie można go używać jako wyrażenia.
pt_br: "{0}" é um tipo de interface e não pode ser usado como uma expressão.
ru: "{0}" является типом интерфейса и не может использоваться как выражение.
tr: '{0}' bir arabirim türüdür ve ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个接口类型，不能用作表达式。
zh_hant: '{0}' 是介面類型，無法用做為運算式。

# ERR_NamespaceNotExpression1
source: '{0}' is a namespace and cannot be used as an expression.
cs: '{0} je obor názvů a nedá se použít jako výraz.
de: '"{0}" ist ein Namespace und kann nicht als Ausdruck verwendet werden.
es: '{0}' es un espacio de nombres y no se puede usar como expresión.
fr: '{0}' est un espace de noms et ne peut pas être utilisé en tant qu'expression.
it: '{0}' è uno spazio dei nomi e non può essere usato come espressione.
ja: '{0}' は名前空間であり、式としては使用することはできません。
ko: '{0}'은(는) 네임스페이스여서 식으로 사용할 수 없습니다.
pl: 'Element „{0}” jest przestrzenią nazw i nie można go używać jako wyrażenia.
pt_br: "{0}" é um namespace e não pode ser usado como uma expressão.
ru: "{0}" является пространством имени и не может использоваться в качестве выражения.
tr: '{0}' bir ad alanı; ifade olarak kullanılamaz.
zh_hans: '“{0}”是一个命名空间，不能用作表达式。
zh_hant: '{0}' 是命名空間，無法用做為運算式。

# ERR_BadNamespaceName1
source: '{0}' is not a valid name and cannot be used as the root namespace name.
cs: 'Název {0} není platný a nejde ho použít jako název kořenového oboru názvů.
de: '"{0}" ist kein gültiger Name und darf nicht als Stammnamespace-Name verwendet werden.
es: '{0}' no es un nombre válido y no se puede usar como el nombre del espacio de nombres raíz.
fr: '{0}' n'est pas un nom valide et ne peut pas être utilisé comme nom d'espace de noms racine.
it: '{0}' non è un nome valido e non può essere usato come nome per lo spazio dei nomi radice.
ja: '{0}' は有効な名前ではありません。ルートの名前空間名として使用できません。
ko: '{0}'은(는) 유효한 이름이 아니므로 루트 네임스페이스 이름으로 사용할 수 없습니다.
pl: 'Element „{0}” nie jest prawidłową nazwą i nie można go użyć jako nazwy głównej przestrzeni nazw.
pt_br: "{0}" não é um nome válido e não pode ser usado como o nome do namespace raiz.
ru: "{0}" является недопустимым именем и не может использоваться как имя корневого пространства имен.
tr: '{0}' geçerli bir ad değil ve kök ad alanı adı olarak kullanılamaz.
zh_hans: '“{0}”不是有效名称，不能用作根命名空间名称。
zh_hant: '{0}' 不是有效的名稱，且無法用做為根命名空間名稱。

# ERR_XmlPrefixNotExpression
source: '{0}' is an XML prefix and cannot be used as an expression. Use the GetXmlNamespace operator to create a namespace object.
cs: '{0} je předpona jazyka XML, kterou nejde použít jako výraz. K vytvoření objektu oboru názvů použijte operátor GetXmlNamespace.
de: '"{0}" ist ein XML-Präfix und kann nicht als Ausdruck verwendet werden. Erstellen Sie mit dem GetXmlNamespace-Operator ein Namespaceobjekt.
es: '{0}' es un prefijo XML y no se puede usar como una expresión. Use el operador GetXmlNamespace para crear un objeto de espacio de nombres.
fr: '{0}' est un préfixe XML et ne peut pas être utilisé comme expression. Utilisez l'opérateur GetXmlNamespace pour créer un objet namespace.
it: '{0}' è un prefisso XML e non può essere usato come espressione. Usare l'operatore GetXmlNamespace per creare un oggetto spazio dei nomi.
ja: '{0}' は XML プレフィックスであり、式として使用することはできません。名前空間オブジェクトを作成するには、GetXmlNamespace 演算子を使用します。
ko: '{0}'은(는) XML 접두사이므로 식으로 사용할 수 없습니다. 네임스페이스 개체를 만들려면 GetXmlNamespace 연산자를 사용하세요.
pl: 'Element „{0}” jest prefiksem XML i nie można go używać jako wyrażenia. Użyj operatora GetXmlNamespace, aby utworzyć obiekt przestrzeni nazw.
pt_br: "{0}" é um prefixo XML e não pode ser usado como uma expressão. Use o operador GetXmlNamespace para criar um objeto namespace.
ru: "{0}" является префиксом XML и не может использоваться в качестве выражения. Используйте оператор GetXmlNamespace для создания объекта пространства имен.
tr: '{0}' bir XML ön ekidir ve ifade olarak kullanılamaz. Ad alanı nesnesi oluşturmak için GetXmlNamespace işlecini kullanın.
zh_hans: '“{0}”是 XML 前缀，不能用作表达式。请使用 GetXmlNamespace 运算符创建命名空间对象。
zh_hant: '{0}' 為 XML 前置詞，不可用做為運算式。請使用 GetXmlNamespace 運算子建立命名空間物件。

# ERR_MultipleExtends
source: 'Inherits' can appear only once within a 'Class' statement and can only specify one class.
cs: 'Klíčové slovo Inherits může být uvnitř příkazu Class použito jenom jednou a může určovat jenom jednu třídu.
de: 'In einer Class-Anweisung darf "Inherits" nur einmal verwendet werden und kann nur eine Klasse angeben.
es: 'Inherits' solo puede aparecer una vez dentro de una instrucción 'Class' y solo puede especificar una clase.
fr: 'Inherits' ne peut apparaître qu'une seule fois dans une instruction 'Class' et ne peut spécifier qu'une classe.
it: 'Inherits' può essere specificato solo una volta in un'istruzione 'Class' e può specificare solo una classe.
ja: 'Inherits' は、'Class' ステートメント内で 1 回のみ使用でき、1 つのクラスのみを指定できます。
ko: 'Inherits'는 'Class' 문 안에 한 번만 사용할 수 있으며 하나의 클래스만 지정할 수 있습니다.
pl: 'Instrukcja Inherits może wystąpić tylko raz w instrukcji Class i może określać tylko jedną klasę.
pt_br: 'Inherits' pode aparecer somente uma vez dentro de uma instrução 'Class' e só pode especificar uma classe.
ru: 'В операторе "Class" ключевое слово "Inherits" может использоваться только один раз и задавать только один класс.
tr: 'Inherits', 'Class' deyiminde tek bir kez geçebilir ve tek bir sınıf belirtebilir.
zh_hans: '"Inherits" 只能在 "Class" 语句中出现一次，并且只能指定一个类。
zh_hant: 'Inherits' 只可以在 'Class' 陳述式中出現一次，並且只能指定一個類別。

# ERR_PropMustHaveGetSet
source: Property without a 'ReadOnly' or 'WriteOnly' specifier must provide both a 'Get' and a 'Set'.
cs: Vlastnost bez specifikace ReadOnly a WriteOnly musí poskytovat metody Get a Set.
de: Eine Eigenschaft ohne einen ReadOnly- oder WriteOnly-Spezifizierer muss ein "Get" und ein "Set" bereitstellen.
es: Una propiedad sin un especificador 'ReadOnly' o 'WriteOnly' debe proporcionar una instrucción 'Get' y una instrucción 'Set'.
fr: Une propriété sans spécificateur 'ReadOnly' ou 'WriteOnly' doit fournir un 'Get' et un 'Set'.
it: Una proprietà senza identificatore 'ReadOnly' o 'WriteOnly' deve fornire sia un elemento 'Get' che un elemento 'Set'.
ja: ReadOnly' または 'WriteOnly' 指定子を持たないプロパティには、'Get' および 'Set' の両方を指定する必要があります。
ko: ReadOnly' 또는 'WriteOnly' 지정자가 없는 속성에는 'Get'과 'Set'을 모두 지정해야 합니다.
pl: Właściwość bez specyfikatora „ReadOnly” lub „WriteOnly” musi udostępniać zarówno procedurę „Get”, jak i „Set”.
pt_br: Propriedade sem um especificador 'ReadOnly' ou 'WriteOnly' deve fornecer um 'Get' e um 'Set'.
ru: Свойство без спецификаторов "ReadOnly" или "WriteOnly" должно содержать методы "Get" и "Set".
tr: ReadOnly' veya 'WriteOnly' tanımlayıcısı olmayan özellik hem 'Get' hem de 'Set' sağlamalıdır.
zh_hans: 不带 "ReadOnly" 或 "WriteOnly" 说明符的属性必须同时提供 "Get" 和 "Set"。
zh_hant: 沒有 'ReadOnly' 或 'WriteOnly' 規範的屬性必須提供 'Get' 和 'Set'。

# ERR_WriteOnlyHasNoWrite
source: 'WriteOnly' property must provide a 'Set'.
cs: 'Vlastnost typu WriteOnly musí poskytovat metodu Set.
de: 'WriteOnly-Eigenschaft muss ein "Set" bereitstellen.
es: 'Una propiedad 'WriteOnly' debe proporcionar una instrucción 'Set'.
fr: 'Une propriété 'WriteOnly' doit fournir un 'Set'.
it: 'La proprietà 'WriteOnly' deve fornire un elemento 'Set'.
ja: 'WriteOnly' プロパティには 'Set' が必要です。
ko: 'WriteOnly' 속성에는 'Set'을 지정해야 합니다.
pl: 'Właściwość typu WriteOnly musi udostępniać procedurę Set.
pt_br: 'Propriedade 'WriteOnly' deve fornecer um 'Set'.
ru: 'Свойство со спецификатором WriteOnly должно иметь метод Set.
tr: 'WriteOnly' özelliğinde 'Set' sağlanmalıdır.
zh_hans: '"WriteOnly" 属性必须提供 "Set"。
zh_hant: 'WriteOnly' 屬性必須提供 'Set'。

# ERR_ReadOnlyHasNoGet
source: 'ReadOnly' property must provide a 'Get'.
cs: 'Vlastnost ReadOnly musí poskytovat metodu Get.
de: 'ReadOnly-Eigenschaft muss ein "Get" bereitstellen.
es: 'Una propiedad 'ReadOnly' debe proporcionar una instrucción 'Get'.
fr: 'Une propriété 'ReadOnly' doit fournir un 'Get'.
it: 'La proprietà 'ReadOnly' deve fornire un elemento 'Get'.
ja: 'ReadOnly' プロパティには 'Get' を指定する必要があります。
ko: 'ReadOnly' 속성에는 'Get'을 지정해야 합니다.
pl: 'Właściwość typu ReadOnly musi udostępniać procedurę Get.
pt_br: 'Propriedade 'ReadOnly' deve fornecer um 'Get'.
ru: 'Свойство со спецификатором "ReadOnly" должно иметь метод "Get".
tr: 'ReadOnly' özelliğinde bir 'Get' sağlanmalıdır.
zh_hans: '"ReadOnly" 属性必须提供 "Get"。
zh_hant: 'ReadOnly' 屬性必須提供 'Get'。

# ERR_BadAttribute1
source: Attribute '{0}' is not valid: Incorrect argument value.
cs: Atribut {0} není platný: nesprávná hodnota argumentu.
de: Attribut "{0}" ist ungültig: falscher Argumentwert.
es: El atributo '{0}' no es válido: valor de argumento incorrecto.
fr: L'attribut '{0}' n'est pas valide : valeur d'argument incorrecte.
it: L'attributo '{0}' non è valido. Il valore dell'argomento non è corretto.
ja: 属性 '{0}' が無効です: 引数値が正しくありません。
ko: '{0}' 특성이 잘못되었습니다. 잘못된 인수 값입니다.
pl: Atrybut „{0}” jest niepoprawny: niepoprawna wartość argumentu.
pt_br: Atributo "{0}" não é válido: valor do argumento incorreto.
ru: Недопустимый атрибут "{0}": Неверное значение аргумента.
tr: '{0}' özniteliği geçerli değil: Bağımsız değişken değeri yanlış.
zh_hans: 特性“{0}”无效: 参数值不正确。
zh_hant: 屬性 '{0}' 無效: 引數值不正確。

# ERR_LabelNotDefined1
source: Label '{0}' is not defined.
cs: Návěstí {0} nebylo definováno.
de: Die Bezeichnung "{0}" ist nicht definiert.
es: La etiqueta '{0}' no está definida.
fr: L'étiquette '{0}' n'est pas définie.
it: L'etichetta '{0}' non è definita.
ja: ラベル '{0}' が定義されていません。
ko: '{0}' 레이블이 정의되지 않았습니다.
pl: Etykieta „{0}” nie jest zdefiniowana.
pt_br: Rótulo "{0}" não está definido.
ru: Метка "{0}" не определена.
tr: '{0}' etiketi tanımlanmadı.
zh_hans: 未定义标签“{0}”。
zh_hant: 標籤 '{0}' 未定義。

# ERR_ErrorCreatingWin32ResourceFile
source: Error creating Win32 resources: {0}
cs: Chyba při vytváření prostředků Win32: {0}
de: Fehler beim Erstellen von Win32-Ressourcen: {0}
es: Error al crear recursos de Win32: {0}
fr: Erreur lors de la création de ressources Win32 : {0}
it: Si è verificato un errore durante la creazione delle risorse Win32: {0}
ja: Win32 リソースの作成中にエラーが発生しました: {0}
ko: Win32 리소스를 만드는 동안 오류가 발생했습니다({0}).
pl: Błąd podczas tworzenia zasobów Win32: {0}.
pt_br: Erro ao criar recursos do Win32: {0}
ru: Ошибка при создании ресурсов Win32: {0}
tr: Win32 kaynaklarını oluşturma hatası: {0}
zh_hans: 创建 Win32 资源时出错: {0}
zh_hant: 建立 Win32 資源時發生錯誤: {0}

# ERR_UnableToCreateTempFile
source: Cannot create temporary file: {0}
cs: Nedá se vytvořit dočasný soubor: {0}.
de: Temporäre Datei kann nicht erstellt werden: {0}
es: No se puede crear el archivo temporal: {0}
fr: Impossible de créer le fichier temporaire : {0}
it: Non è possibile creare il file temporaneo: {0}
ja: 一時ファイルを作成できません: {0}
ko: {0} 임시 파일을 만들 수 없습니다.
pl: Nie można utworzyć pliku tymczasowego: {0}
pt_br: Não é possível criar arquivo temporário: {0}
ru: Не удается создать временный файл: {0}
tr: Geçici dosya oluşturulamıyor: {0}
zh_hans: 无法创建临时文件: {0}
zh_hant: 無法建立暫存檔: {0}

# ERR_RequiredNewCall2
source: First statement of this 'Sub New' must be a call to 'MyBase.New' or 'MyClass.New' because base class '{0}' of '{1}' does not have an accessible 'Sub New' that can be called with no arguments.
cs: Prvním příkazem této procedury Sub New musí být volání konstruktoru MyBase.New nebo MyClass.New, protože základní třída {0} odvozená od třídy {1} nemá přístupnou proceduru Sub New, kterou jde volat bez argumentů.
de: Die erste Anweisung dieser "Sub New" muss ein Aufruf an "MyBase.New" oder "MyClass.New" sein, da die Basisklasse "{0}" von "{1}" keine zugreifbare "Sub New" hat, die ohne Argumente aufgerufen werden kann.
es: La primera instrucción de este 'Sub New' debe ser una llamada a 'MyBase.New' o 'MyClass.New' porque la clase base '{0}' de '{1}' no tiene un 'Sub New' accesible al que se pueda llamar sin argumentos.
fr: La première instruction de ce 'Sub New' doit être un appel à 'MyBase.New' ou 'MyClass.New', car la classe de base '{0}' de '{1}' n'a pas de 'Sub New' accessible qu'il est possible d'appeler sans argument.
it: La prima istruzione di questo 'Sub New' deve essere una chiamata a 'MyBase.New' o a 'MyClass.New' perché la classe di base '{0}' di '{1}' non ha un 'Sub New' accessibile che possa essere chiamato senza argomenti.
ja: '{1}' の基底クラス '{0}' には、引数なしで呼び出される、アクセス可能な 'Sub New' がないため、この 'Sub New' の最初のステートメントは、'MyBase.New' または 'MyClass.New' に対して呼び出さなければなりません。
ko: '{1}'의 기본 클래스 '{0}'에 인수 없이 호출할 수 있는 액세스 가능한 'Sub New'가 없으므로 이 'Sub New'의 첫째 문은 'MyBase.New' 또는 'MyClass.New'에 대한 호출이어야 합니다.
pl: Pierwsza instrukcja w tym elemencie „Sub New” musi być wywołaniem elementu „MyBase.New” lub „MyClass.New”, ponieważ klasa bazowa „{0}” klasy „{1}” nie ma dostępnego elementu „Sub New”, który można wywoływać bez argumentów.
pt_br: Primeira instrução deste "Sub New" deve ser uma chamada para "MyBase.New" ou "MyClass.New" porque a classe base "{0}" de "{1}" não tem um "Sub New" acessível que pode ser chamado sem argumentos.
ru: Первый оператор в "Sub New" должен иметь явный вызов в "MyBase.New" или "MyClass.New", так как "{0}" из "{1}" не имеет доступный "Sub New", который может быть вызван без аргументов.
tr: '{1}' sınıfının temel sınıfı olan '{0}' sınıfında bağımsız değişken olmadan çağrılabilecek erişilebilir bir 'Sub New' olmadığından, bu 'Sub New' oluşturucusunun ilk deyimi bir 'MyBase.New' veya 'MyClass.New' çağrısı olmalıdır.
zh_hans: “{1}”的基类“{0}”没有不使用参数就可以调用的可访问“Sub New”，因此该“Sub New”的第一个语句必须是对“MyBase.New”或“MyClass.New”的调用。
zh_hant: 此 'Sub New' 的第一個陳述式，必須呼叫 'MyBase.New' 或 'MyClass.New'，因為 '{1}' 的基底類別 '{0}' 沒有不使用引數即可呼叫的可存取 'Sub New'。

# ERR_UnimplementedMember3
source: {0} '{1}' must implement '{2}' for interface '{3}'.
cs: {0} {1} musí implementovat {2} pro rozhraní {3}.
de: {0} "{1}" muss "{2}" für Schnittstelle "{3}" implementieren.
es: {0} '{1}' debe implementar '{2}' para la interfaz '{3}'.
fr: {0} '{1}' doit implémenter '{2}' pour l'interface '{3}'.
it: {0} '{1}' deve implementare '{2}' per l'interfaccia '{3}'.
ja: {0} '{1}' は '{2}' をインターフェイス '{3}' に実装しなければなりません。
ko: {0} '{1}'은(는) '{3}' 인터페이스에 대한 '{2}'을(를) 구현해야 합니다.
pl: Element {0} „{1}” musi implementować element „{2}” dla interfejsu „{3}”.
pt_br: {0} "{1}" deve implementar "{2}" para a interface "{3}".
ru: {0} "{1}" должна реализовать "{2}" для интерфейса "{3}".
tr: {0} '{1}', '{3}' arabirimi için '{2}' uygulamalıdır.
zh_hans: {0}“{1}”必须为接口“{3}”实现“{2}”。
zh_hant: {0} '{1}' 必須為介面 '{3}' 實作 '{2}'。

# ERR_BadWithRef
source: Leading '.' or '!' can only appear inside a 'With' statement.
cs: Úvodní operátor . nebo ! se dá použít jenom uvnitř příkazu With.
de: Vorangestellte "." oder "!" können nur in einer With-Anweisung verwendet werden.
es: .' o '!' inicial solo puede aparecer dentro de una instrucción 'With'.
fr: Un '.' ou '!' de début ne peut apparaître que dans une instruction 'With'.
it: Il carattere '.' o '!' iniziale può essere specificato solo all'interno di un'istruzione 'With'.
ja: 先頭の '.' または '!' は、'With' ステートメント内でのみ使用できます。
ko: With' 문 내부에서만 '.' 또는 '!'로 시작할 수 있습니다.
pl: Wiodący znak . lub ! może wystąpić tylko wewnątrz instrukcji With.
pt_br: .' ou '!' à esquerda só podem aparecer dentro de uma instrução 'With'.
ru: "." или "!" в начале строки может использоваться только в теле оператора With.
tr: Baştaki '.' veya '!' yalnızca 'With' deyimi içinde bulunabilir.
zh_hans: 前导“.”或“!”只能出现在“With”语句内。
zh_hant: 前置的 '.' 或 '!' 只可以在 'With' 陳述式中出現。

# ERR_DuplicateAccessCategoryUsed
source: Only one of 'Public', 'Private', 'Protected', 'Friend', 'Protected Friend', or 'Private Protected' can be specified.
cs: Lze zadat jen jednu z možností Public, Private, Protected, Friend, Protected Friend nebo Private Protected.
de: Nur eine Option aus "Public", "Private", "Protected", "Friend", "Protected Friend" oder "Private Protected" kann angegeben werden.
es: Solo se puede especificar uno de los valores siguientes: "Public", "Private", "Protected", "Friend", "Protected Friend" o "Private Protected".
fr: Vous pouvez spécifier uniquement une instance de type 'Public', 'Private', 'Protected', 'Friend', 'Protected Friend' ou 'Private Protected'.
it: È possibile specificare solo un'opzione tra 'Public', 'Private', 'Protected', 'Friend', 'Protected Friend' o 'Private Protected'.
ja: Public'、'Private'、'Protected'、'Friend'、'Protected Friend'、または 'Private Protected' は、いずれか 1 つしか指定できません。
ko: Public', 'Private', 'Protected', 'Friend', 'Protected Friend' 또는 'Private Protected' 중 하나만 지정할 수 있습니다.
pl: Można określić tylko jeden z modyfikatorów: Public, Private, Protected, Friend, Protected Friend i Private Protected.
pt_br: Somente um de 'Public', 'Private', 'Protected', 'Friend', 'Protected Friend' ou 'Private Protected' pode ser especificado.
ru: Можно указать только один из модификаторов: "Public", "Private", "Protected", "Friend", "Protected Friend" или "Private Protected".
tr: Public', 'Private', 'Protected', 'Friend' veya 'Protected Friend' seçeneklerinden yalnızca biri belirtilebilir.
zh_hans: 只能指定 "Public"、"Private"、"Protected"、"Friend"、"Protected Friend" 或 "Private Protected" 中的一个。
zh_hant: 只可指定 'Public'、'Private'、'Protected'、'Friend'、'Protected Friend' 或 'Private Protected' 其中之一。

# ERR_DuplicateModifierCategoryUsed
source: Only one of 'NotOverridable', 'MustOverride', or 'Overridable' can be specified.
cs: Lze zadat jenom jedno z klíčových slov NotOverridable, MustOverride nebo Overridable.
de: Entweder "NotOverridable", "MustOverride" oder "Overridable" kann angegeben werden.
es: Solo se puede especificar 'NotOverridable', 'MustOverride' u 'Overridable'.
fr: Vous pouvez spécifier uniquement une instance de type 'NotOverridable', 'MustOverride' ou 'Overridable'.
it: È possibile specificare solo un modificatore tra 'NotOverridable', 'MustOverride' e 'Overridable'.
ja: NotOverridable'、'MustOverride'、または 'Overridable' は、いずれか 1 つしか指定できません。
ko: NotOverridable', 'MustOverride' 또는 'Overridable' 중 하나만 지정할 수 있습니다.
pl: Można określić tylko jeden z modyfikatorów: NotOverridable, MustOverride lub Overridable.
pt_br: Somente um de 'NotOverridable', 'MustOverride', ou 'Overridable' pode ser especificado.
ru: Можно указать только одно из значений: "NotOverridable", "MustOverride" или "Overridable".
tr: NotOverridable', 'MustOverride' veya 'Overridable' seçeneklerinden yalnızca biri belirtilebilir.
zh_hans: 只能指定 "NotOverridable"、"MustOverride" 或 "Overridable" 中的一个。
zh_hant: 只可以指定 'NotOverridable'、'MustOverride' 或 'Overridable' 其中之一。

# ERR_DuplicateSpecifier
source: Specifier is duplicated.
cs: Specifikátor je duplicitní.
de: Doppelter Spezifizierer.
es: El especificador está duplicado.
fr: Spécificateur en double.
it: L'identificatore è duplicato.
ja: 指定子が重複しています。
ko: 지정자가 중복되었습니다.
pl: Specyfikator jest zduplikowany.
pt_br: Especificador duplicado.
ru: Повторяющийся спецификатор.
tr: Tanımlayıcı yineleniyor.
zh_hans: 说明符重复。
zh_hant: 重複規範。

# ERR_TypeConflict6
source: {0} '{1}' and {2} '{3}' conflict in {4} '{5}'.
cs: {0} – {1} a {2} – {3} jsou v konfliktu v {4} – {5}.
de: {0} "{1}" und {2} "{3}" stehen in {4} "{5}" in Konflikt.
es: {0} '{1}' y {2} '{3}' entran en conflicto en {4} '{5}'.
fr: {0} '{1}' et {2} '{3}' sont en conflit dans {4} '{5}'.
it: {0} '{1}' e {2} '{3}' sono in conflitto in {4} '{5}'.
ja: {0} '{1}' と {2} '{3}' が {4} '{5}' で競合しています。
ko: {0} '{1}' 및 {2} '{3}'이(가) {4} '{5}'에 충돌합니다.
pl: Element {0} „{1}” i {2} „{3}” powoduje konflikt w elemencie {4} „{5}”.
pt_br: {0} "{1}" e {2} "{3}" estão em conflito em {4} "{5}".
ru: {0} "{1}" и {2} "{3}" конфликтуют в {4} "{5}".
tr: {0} '{1}' ve {2} '{3}', {4} '{5}' içinde çakışıyor.
zh_hans: {0}“{1}”和 {2}“{3}”在 {4}“{5}”中冲突。
zh_hant: {0} '{1}' 和 {2} '{3}' 在 {4} '{5}' 中互相衝突。

# ERR_UnrecognizedTypeKeyword
source: Keyword does not name a type.
cs: Klíčové slovo neurčuje typ.
de: Das Schlüsselwort gibt keinen Typ an.
es: La palabra clave no denomina un tipo.
fr: Le mot clé ne désigne pas un type.
it: La parola chiave non indica un tipo.
ja: キーワードは型の名前を指定しません。
ko: 키워드는 형식의 이름을 지정하지 않습니다.
pl: Słowo kluczowe nie określa typu.
pt_br: A palavra-chave não nomeia tipo.
ru: Ключевое слово не задает имя типа.
tr: Anahtar sözcük bir tür adı belirtmiyor.
zh_hans: 关键字没有指定类型。
zh_hant: 關鍵字無法為類型命名。

# ERR_ExtraSpecifiers
source: Specifiers valid only at the beginning of a declaration.
cs: Specifikátory jsou platné jenom na začátku deklarace.
de: Spezifizierer sind nur am Anfang einer Deklaration gültig.
es: Especificadores válidos solo al principio de una declaración.
fr: Les spécificateurs sont valides uniquement au début d'une déclaration.
it: Gli identificatori sono validi solo all'inizio di una dichiarazione.
ja: 指定子は、宣言の先頭でのみ有効です。
ko: 지정자는 선언의 시작 부분에서만 사용할 수 있습니다.
pl: Specyfikatory są prawidłowe tylko na początku deklaracji.
pt_br: Especificadores válidos somente no início de uma declaração.
ru: Спецификаторы допустимы только в начале объявления.
tr: Tanımlayıcılar yalnızca bildirimin başında geçerlidir.
zh_hans: 说明符仅在声明的开始处有效。
zh_hant: 規範只在宣告的開頭有效。

# ERR_UnrecognizedType
source: Type expected.
cs: Očekával se typ.
de: Typ erwartet.
es: Se esperaba un tipo.
fr: Type attendu.
it: È previsto il tipo.
ja: 型が必要です。
ko: 형식이 필요합니다.
pl: Oczekiwano typu.
pt_br: Tipo esperado.
ru: Требуется тип.
tr: Tür bekleniyor.
zh_hans: 应为类型。
zh_hant: 應有類型。
