Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ClassConstraintNotInheritable1
source: Type constraint cannot be a 'NotInheritable' class.
cs: Jako omezení typu nejde použít třídu NotInheritable.
de: Eine Typeinschränkung kann keine NotInheritable-Klasse sein.
es: La restricción de tipo no puede ser una clase 'NotInheritable'.
fr: La contrainte de type ne peut pas être une classe 'NotInheritable'.
it: Il vincolo di tipo non può essere una classe 'NotInheritable'.
ja: 型制約に 'NotInheritable' クラスを指定することはできません。
ko: 형식 제약 조건은 'NotInheritable' 클래스일 수 없습니다.
pl: Ograniczenie typu nie może być klasą NotInheritable.
pt_br: A restrição de tipo não pode ser uma classe 'NotInheritable'.
ru: Ограничение типа не может быть классом, объявленным как "NotInheritable".
tr: Tür kısıtlaması 'NotInheritable' sınıfı olamaz.
zh_hans: 类型约束不能是“NotInheritable”类。
zh_hant: 類型條件約束不可以為 'NotInheritable' 類別。

# ERR_ConstraintIsRestrictedType1
source: '{0}' cannot be used as a type constraint.
cs: '{0} nejde použít jako omezení typu.
de: '"{0}" kann nicht als Typeinschränkung verwendet werden.
es: '{0}' no se puede usar como una restricción de tipo.
fr: '{0}' ne peut pas être utilisé en tant que contrainte de type.
it: 'Non è possibile usare '{0}' come vincolo di tipo.
ja: '{0}' を型制約として使用することはできません。
ko: '{0}'은(는) 형식 제약 조건으로 사용할 수 없습니다.
pl: 'Elementu „{0}” nie można użyć jako ograniczenia typu.
pt_br: "{0}" não pode ser usado como uma restrição de tipo.
ru: "{0}" нельзя использовать как ограничение типа.
tr: '{0}' bir tür kısıtlaması olarak kullanılamaz.
zh_hans: '“{0}”不能用作类型约束。
zh_hant: '{0}' 不能用做為類型條件約束。

# ERR_GenericParamsOnInvalidMember
source: Type parameters cannot be specified on this declaration.
cs: Parametry typu nejde pro tuto deklaraci zadat.
de: Typparameter können in dieser Deklaration nicht angegeben werden.
es: No se pueden especificar parámetros de tipo en esta declaración.
fr: Les paramètres de type ne peuvent pas être spécifiés pour cette déclaration.
it: In questa dichiarazione non si possono specificare parametri di tipo.
ja: この宣言には型パラメーターを指定できません。
ko: 이 선언에는 형식 매개 변수를 지정할 수 없습니다.
pl: W tej deklaracji nie można określić parametrów typu.
pt_br: Não é possível especificar parâmetros de tipo nesta declaração.
ru: Параметры типа нельзя указать в этом объявлении.
tr: Tür parametreleri bu bildirimde belirtilemez.
zh_hans: 在此声明上不能指定类型参数。
zh_hant: 不可以在這個宣告上指定類型參數。

# ERR_GenericArgsOnAttributeSpecifier
source: Type arguments are not valid because attributes cannot be generic.
cs: Argumenty typu nejsou platné, protože atributy nemůžou být obecné.
de: Typargumente sind nicht gültig, da Attribute nicht generisch sein können.
es: Los argumentos de tipo no son válidos porque los atributos no pueden ser genéricos.
fr: Les arguments de type ne sont pas valides, car les attributs ne peuvent pas être génériques.
it: Gli argomenti di tipo non sono validi perché gli attributi non possono essere generici.
ja: 属性はジェネリックにできないため、型引数が有効ではありません。
ko: 특성이 제네릭일 수 없으므로 형식 인수를 사용할 수 없습니다.
pl: Argumenty typu są nieprawidłowe, ponieważ atrybuty nie mogą być ogólne.
pt_br: Os argumentos de tipo não são válidos porque os atributos não podem ser genéricos.
ru: Недопустимые аргументы типа, поскольку атрибуты не могут быть универсального типа.
tr: Öznitelikler genel olamayacağından tür bağımsız değişkenleri geçerli değil.
zh_hans: 由于特性不能是泛型，因此类型参数无效。
zh_hant: 類型引數無效，因為屬性不可以是泛型的。

# ERR_AttrCannotBeGenerics
source: Type parameters, generic types or types contained in generic types cannot be used as attributes.
cs: Parametry typu, obecné typy nebo typy obsažené v obecných typech nejde používat jako atributy.
de: Typparameter, generische Typen oder in generischen Typen enthaltene Typen können nicht als Attribute verwendet werden.
es: Los parámetros de tipo, los tipos genéricos y los tipos contenidos en tipos genéricos no se pueden usar como atributos.
fr: Les paramètres de type, les types génériques ou les types contenus dans des types génériques ne peuvent pas être utilisés comme attributs.
it: Non è possibile usare come attributi parametri di tipo, tipi generici o tipi contenuti in tipi generici.
ja: 型パラメーター、ジェネリック型、またはジェネリック型に含まれる型は、属性として使用できません。
ko: 형식 매개 변수, 제네릭 형식 또는 제네릭 형식에 포함된 형식은 특성으로 사용할 수 없습니다.
pl: Parametrów typu, typów ogólnych lub typów zawartych w typach ogólnych nie można używać jako atrybutów.
pt_br: Não é possível usar parâmetros de tipo, tipos genéricos ou tipos contidos em tipos genéricos como atributos
ru: Параметры-типы, универсальные типы и типы, содержащиеся внутри универсальных типов, нельзя использовать в качестве атрибутов.
tr: Tür parametreleri, genel türler ve genel türlerde bulunan türler öznitelik olarak kullanılamaz.
zh_hans: 类型参数、泛型类型或泛型类型中包含的类型不能用作特性。
zh_hant: 類型參數、泛型類型或泛型類型中所包含的類型不能當做屬性使用。

# ERR_BadStaticLocalInGenericMethod
source: Local variables within generic methods cannot be declared 'Static'.
cs: Místní proměnné v rámci obecných metod nejde deklarovat jako Static.
de: Lokale Variablen innerhalb generischer Methoden können nicht als "Static" deklariert werden.
es: Las variables locales que se encuentran dentro de métodos genéricos no se pueden declarar como 'Static'.
fr: Les variables locales dans les méthodes génériques ne peuvent pas être déclarées 'Static'.
it: Le variabili locali all'interno di metodi generici non possono essere dichiarate come 'Static'.
ja: ジェネリック メソッド内のローカル変数を 'Static' として宣言することはできません。
ko: 제네릭 메서드 안에 있는 지역 변수는 'Static'으로 선언할 수 없습니다.
pl: Zmienne lokalne z metodami ogólnymi nie mogą być deklarowane jako Static.
pt_br: Não é possível declarar variáveis locais dentro de métodos genéricos como 'Static'.
ru: Локальные переменные в универсальных методах не могут объявляться как "Static".
tr: Genel yöntemlerdeki yerel değişkenler 'Static' olarak bildirilemez.
zh_hans: 泛型方法中的局部变量不能声明为“Static”。
zh_hant: 泛型方法內的區域變數不可以宣告為 'Static'。

# ERR_SyntMemberShadowsGenericParam3
source: {0} '{1}' implicitly defines a member '{2}' which has the same name as a type parameter.
cs: {0} – {1} implicitně definuje člen {2}, který má stejný název jako parametr typu.
de: {0} "{1}" definiert implizit den Member "{2}". Dieser hat den gleichen Namen wie ein Typparameter.
es: {0} '{1}' define implícitamente un miembro '{2}' que tiene el mismo nombre que un parámetro de tipo.
fr: {0} '{1}' définit implicitement un membre '{2}' qui a le même nom que le paramètre de type.
it: {0} '{1}' definisce in modo implicito un membro '{2}' che ha lo stesso nome di un parametro di tipo.
ja: {0} '{1}' は、型パラメーターと同じ名前のメンバー '{2}' を暗黙的に定義します。
ko: {0} '{1}'은(는) 형식 매개 변수와 이름이 같은 '{2}' 멤버를 암시적으로 정의합니다.
pl: Element {0} „{1}” niejawnie definiuje składową „{2}”, która ma taką samą nazwę jak parametr typu.
pt_br: {0} "{1}" define implicitamente um membro "{2}" que tem o mesmo nome de um parâmetro de tipo.
ru: {0} "{1}" неявно определяет член "{2}", который имеет то же имя в качестве параметра типа.
tr: {0} '{1}', tür parametresiyle aynı ada sahip olan bir '{2}' üyesini örtük olarak tanımlıyor.
zh_hans: {0}“{1}”隐式定义了与某个类型参数同名的成员“{2}”。
zh_hant: {0} '{1}' 隱含定義成員 '{2}'，該成員與類型參數擁有相同的名稱。

# ERR_ConstraintAlreadyExists1
source: Constraint type '{0}' already specified for this type parameter.
cs: Typ omezení {0} je už pro tento parametr typu zadaný.
de: Der Einschränkungstyp "{0}" wurde bereits für diesen Typparameter angegeben.
es: Ya se ha especificado el tipo de restricción '{0}' para este parámetro de tipo.
fr: Le type de contrainte '{0}' est déjà spécifié pour ce paramètre de type.
it: Il tipo vincolo '{0}' è già specificato per questo parametro di tipo.
ja: 制約型 '{0}' は、既にこの型パラメーターに指定されています。
ko: 제약 조건 형식 '{0}'이(가) 이 형식 매개 변수에 대해 이미 지정되어 있습니다.
pl: Typ ograniczenia „{0}” jest już określony dla tego parametru typu.
pt_br: Tipo de restrição "{0}" já especificado para este parâmetro de tipo.
ru: Тип ограничения "{0}" уже указан для этого параметра типа.
tr: Bu tür parametresi için '{0}' kısıtlama türü zaten belirtildi.
zh_hans: 已为此类型参数指定了约束类型“{0}”。
zh_hant: 已為此類型參數指定條件約束類型 '{0}'。

# ERR_InterfacePossiblyImplTwice2
source: Cannot implement interface '{0}' because its implementation could conflict with the implementation of another implemented interface '{1}' for some type arguments.
cs: Nejde implementovat rozhraní {0}, protože jeho implementace by mohla být v konfliktu s implementací jiného implementovaného rozhraní {1} pro některé argumenty typu.
de: Die {0}-Schnittstelle kann nicht implementiert werden, da ihre Implementierung aufgrund einiger Typargumente einen Konflikt mit der ebenfalls implementierten {1}-Schnittstelle verursachen würde.
es: No se puede implementar la interfaz '{0}' porque su implementación podría entrar en conflicto con la implementación de otra interfaz implementada '{1}' para algunos argumentos de tipo.
fr: Impossible d'implémenter l'interface '{0}', car son implémentation pourrait être en conflit avec l'implémentation d'une autre interface '{1}' implémentée pour certains arguments de type.
it: Non è possibile eseguire l'implementazione dell'interfaccia '{0}' perché potrebbe essere in conflitto con l'implementazione di un'altra interfaccia '{1}' per alcuni argomenti di tipo.
ja: インターフェイス '{0}' を実装できません。実装すると、型引数に実装された別のインターフェイス '{1}' の実装と競合する可能性があります。
ko: '{0}' 인터페이스 구현이 일부 형식 인수에 대해 구현된 다른 인터페이스 '{1}'의 구현과 충돌할 수 있으므로 이 인터페이스를 구현할 수 없습니다.
pl: Nie można zaimplementować interfejsu „{0}”, ponieważ jego implementacja może powodować konflikt z implementacją innego zaimplementowanego interfejsu „{1}” w przypadku niektórych argumentów typu.
pt_br: Não é possível implementar a interface "{0}" porque sua implementação poderia entrar em conflito com a implementação de outra interface implementada "{1}" para alguns argumentos de tipo.
ru: Невозможно реализовать интерфейс "{0}", поскольку это может вызвать конфликт с реализацией другого существующего интерфейса "{1}" для некоторых аргументов типа.
tr: '{0}' arabirimi uygulanamıyor çünkü bu uygulama bazı tür bağımsız değişkenlerinde başka bir uygulanan '{1}' arabiriminin uygulanmasıyla çakışabilir.
zh_hans: 无法实现接口“{0}”，因为对于某些类型参数，该接口的实现可能与另一个已实现的接口“{1}”的实现冲突。
zh_hant: 無法實作介面 '{0}'，因為它的實作可能與某些類型引數的另一個實作介面 '{1}' 之實作互相衝突。

# ERR_ModulesCannotBeGeneric
source: Modules cannot be generic.
cs: Moduly nemůžou být obecné.
de: Module können nicht generisch sein.
es: Los módulos no pueden ser genéricos.
fr: Les modules ne peuvent pas être génériques.
it: I moduli non possono essere generici.
ja: モジュールはジェネリックにできません。
ko: 모듈은 제네릭일 수 없습니다.
pl: Moduły nie mogą być ogólne.
pt_br: Os módulos não podem ser genéricos.
ru: Модули не могут быть общими.
tr: Modüller genel olamaz.
zh_hans: 模块不能是泛型的。
zh_hant: 模組不可以是泛型的。

# ERR_GenericClassCannotInheritAttr
source: Classes that are generic or contained in a generic type cannot inherit from an attribute class.
cs: Třídy, které jsou obecné nebo které jsou obsažené v obecném typu, nemůžou dědit ze třídy atributů.
de: Generische oder in einem generischen Typ enthaltene Klassen können nicht von einer Attributklasse erben.
es: Las clases genéricas o contenidas en un tipo genérico no se pueden heredar de una clase de atributos.
fr: Les classes qui sont génériques ou contenues dans un type générique ne peuvent pas hériter d'une classe d'attributs.
it: Le classi generiche o che sono contenute in un tipo generico non possono ereditare da una classe Attribute.
ja: ジェネリック クラスまたはジェネリック型に含まれるクラスは、属性クラスから継承できません。
ko: 제네릭 또는 제네릭 형식에 포함된 클래스는 특성 클래스에서 상속할 수 없습니다.
pl: Klasy, które są ogólne lub są zawarte w typie ogólnym, nie mogą dziedziczyć po klasie atrybutu.
pt_br: As classes genéricas ou contidas em um tipo genérico não podem herdar de uma classe de atributo.
ru: Универсальные классы и классы, содержащиеся в универсальном типе, не могут наследовать от класса атрибута.
tr: Genel olan veya genel türün içinde yer alan sınıflar öznitelik sınıfından devralamaz.
zh_hans: 属于泛型或包含在泛型类型中的类不能从特性类继承。
zh_hant: 泛型類別或包含在泛型類型中的類別不可以繼承自屬性類別。

# ERR_DeclaresCantBeInGeneric
source: 'Declare' statements are not allowed in generic types or types contained in generic types.
cs: 'Příkazy Declare nejsou povolené v obecných typech ani v typech obsažených v obecných typech.
de: 'Declare-Anweisungen sind in generischen Typen oder in Typen, die in generischen Typen enthalten sind, nicht zulässig.
es: 'No se permiten las instrucciones 'Declare' en tipos genéricos ni en tipos contenidos en tipos genéricos.
fr: 'Les instructions 'Declare' ne sont pas autorisées dans les types génériques ou les types contenus dans des types génériques.
it: 'Le istruzioni 'Declare' non sono consentite in tipi generici o in tipi contenuti in tipi generici.
ja: 'Declare' ステートメントは、ジェネリック型またはジェネリック型に含まれる型では使用できません。
ko: '제네릭 형식 또는 제네릭 형식을 포함하는 형식에서 'Declare' 문이 허용되지 않습니다.
pl: 'Instrukcje „Declare” nie są dozwolone w typach ogólnych ani typach zawartych w typach ogólnych.
pt_br: 'Instruções "Declare" não são permitidas em tipos genéricos ou tipos contidos em tipos genéricos.
ru: 'Операторы "Declare" нельзя использовать в универсальных типах или типах, содержащихся в универсальных типах.
tr: 'Genel türlerde ve genel türlerin kapsamındaki türlerde 'Declare' deyimlerine izin verilmez.
zh_hans: '泛型类型或包含在泛型类型中的类型中不允许“Declare”语句。
zh_hant: '泛型類型或包含在泛型類型中的類型，不可使用 'Declare' 陳述式。

# ERR_OverrideWithConstraintMismatch2
source: '{0}' cannot override '{1}' because they differ by type parameter constraints.
cs: '{0} nemůže přepsat {1}, protože se liší v omezeních parametrů typu.
de: '"{0}" kann "{1}" nicht überschreiben, da sie unterschiedliche Typparametereinschränkungen aufweisen.
es: '{0}' no puede invalidar '{1}' porque difieren en las restricciones de parámetros de tipo.
fr: '{0}' ne peut pas se substituer à '{1}', car leurs contraintes de paramètre de type les différencient.
it: '{0}' non può eseguire l'override di '{1}' perché si differenziano per i vincoli del parametro di tipo.
ja: '型パラメーターの制約が異なるため、'{0}' で '{1}' をオーバーライドすることはできません。
ko: '형식 매개 변수 제약 조건이 서로 다르므로 '{0}'은(는) '{1}'을(를) 재정의할 수 없습니다.
pl: 'Element „{0}” nie może przesłonić elementu „{1}”, ponieważ elementy różnią się ograniczeniami parametrów typu.
pt_br: "{0}" não pode substituir "{1}" porque diferem por restrições de parâmetros de tipo.
ru: "{0}" не может переопределить "{1}", так как они отличаются по ограничениям параметра типа.
tr: 'Tür parametresi kısıtlamaları farklı olduğundan '{0}', '{1}' sınıfını geçersiz kılamaz.
zh_hans: '“{0}”无法重写“{1}”，因为它们在类型参数约束上存在差异。
zh_hant: '{0}' 無法覆寫 '{1}'，因為其類型參數條件約束不同。

# ERR_ImplementsWithConstraintMismatch3
source: '{0}' cannot implement '{1}.{2}' because they differ by type parameter constraints.
cs: '{0} nemůže implementovat {1}.{2}, protože se liší v omezeních parametrů typu.
de: '"{0}" kann "{1}.{2}" nicht implementieren, da sie unterschiedliche Einschränkungen für Typparameter aufweisen.
es: '{0}' no se puede implementar '{1}.{2}' porque difieren en las restricciones de parámetros de tipo.
fr: '{0}' ne peut pas implémenter '{1}.{2}', car ils diffèrent par leur contraintes de paramètre de type.
it: '{0}' non può implementare '{1}.{2}' perché i vincoli del parametro di tipo sono diversi.
ja: '型パラメーター制約が異なるため、'{0}' は '{1}.{2}' を実装することができません。
ko: '형식 매개 변수 제약 조건이 서로 다르므로 '{0}'은(는) '{1}.{2}'을(를) 구현할 수 없습니다.
pl: 'Element „{0}” nie może implementować elementu „{1}.{2}”, ponieważ różnią się one ograniczeniami parametrów typu.
pt_br: "{0}" não pode implementar "{1}.{2}" porque diferem por restrições de parâmetro de tipo.
ru: "{0}" не может реализовать "{1}.{2}", поскольку они отличаются ограничениями параметра типа.
tr: 'Tür parametresi kısıtlamaları farklı olduğundan '{0}', '{1}.{2}' öğesini uygulayamaz.
zh_hans: '“{0}”无法实现“{1}.{2}”，因为它们在类型参数约束上存在差异。
zh_hant: '{0}' 無法實作 '{1}.{2}'，因為它們的類型參數條件約束不同。

# ERR_OpenTypeDisallowed
source: Type parameters or types constructed with type parameters are not allowed in attribute arguments.
cs: Parametry typu nebo typy vytvořené pomocí parametrů typu nejsou povolené v argumentech atributů.
de: Typparameter oder mit Typparametern konstruierte Typen sind in Attributargumenten nicht zulässig.
es: No se permiten los parámetros de tipo o los tipos construidos con parámetros de tipo en argumentos de atributo.
fr: Les paramètres de type ou les types construits avec des paramètres de type ne sont pas autorisés dans les arguments d'attribut.
it: I parametri di tipo o i tipi costruiti con parametri di tipo non sono consentiti negli argomenti di attributo.
ja: 型パラメーターまたは型パラメーターを使用して構築される型は、属性の引数には指定できません。
ko: 형식 매개 변수로 생성된 형식 매개 변수 또는 형식은 특성 인수에 사용할 수 없습니다.
pl: Parametry typu lub typy utworzone za pomocą parametrów typu są niedozwolone w argumentach atrybutu.
pt_br: Parâmetros de tipo ou tipos construídos com parâmetros de tipo não são permitidos em argumentos de atributo.
ru: Параметры-типы или типы, содержащие параметры-типы, нельзя использовать в аргументах атрибутов.
tr: Öznitelik bağımsız değişkenlerinde tür parametreleri veya tür parametreleriyle oluşturulan türler kullanılamaz.
zh_hans: 特性实参中不允许类型形参或用类型形参构造的类型。
zh_hant: 屬性引數中不允許類型參數或以類型參數建構的類型。

# ERR_HandlesInvalidOnGenericMethod
source: Generic methods cannot use 'Handles' clause.
cs: V obecných metodách nejde používat klauzuli Handles.
de: Generische Methoden können die Handles-Klausel nicht verwenden.
es: Los métodos genéricos no pueden usar la cláusula 'Handles'.
fr: Les méthodes génériques ne peuvent pas utiliser une clause 'Handles'.
it: I metodi generici non possono usare la clausola 'Handles'.
ja: ジェネリック メソッドで 'Handles' 句を使用することはできません。
ko: 제네릭 메서드에서는 'Handles' 절을 사용할 수 없습니다.
pl: Metody ogólne nie mogą używać klauzuli Handles.
pt_br: Métodos genéricos não podem usar a cláusula 'Handles'.
ru: В универсальных методах нельзя использовать предложение "Handles".
tr: Genel yöntemler 'Handles' yan tümcesini kullanamaz.
zh_hans: 泛型方法不能使用“Handles”子句。
zh_hant: 泛型方法不可以使用 'Handles' 子句。

# ERR_MultipleNewConstraints
source: 'New' constraint cannot be specified multiple times for the same type parameter.
cs: 'Omezení New nejde pro stejný parametr typu zadat vícekrát.
de: 'Die New-Einschränkung kann nicht mehrmals für den gleichen Typparameter angegeben werden.
es: 'La restricción 'New' no se puede especificar varias veces para el mismo parámetro de tipo.
fr: 'La contrainte 'New' ne peut pas être spécifiée plusieurs fois pour le même paramètre de type.
it: 'Non è possibile specificare il vincolo 'New' più volte per lo stesso parametro di tipo.
ja: 'New' 制約は、同じ型パラメーターに対して複数回指定できません。
ko: '동일한 형식 매개 변수에는 'New' 제약 조건을 여러 번 지정할 수 없습니다.
pl: 'Ograniczenie New nie może być określone wiele razy dla tego samego parametru typu.
pt_br: 'Não é possível especificar a restrição 'New' várias vezes para o mesmo parâmetro de tipo.
ru: 'Ограничение "New" нельзя указывать несколько раз для одного параметра-типа.
tr: 'New' kısıtlaması aynı tür parametresi için birden çok kez belirtilemez.
zh_hans: '"New" 约束不能为同一类型参数指定多次。
zh_hant: '不能針對相同的類型參數多次指定 'New' 條件約束。

# ERR_MustInheritForNewConstraint2
source: Type argument '{0}' is declared 'MustInherit' and does not satisfy the 'New' constraint for type parameter '{1}'.
cs: Argument typu {0} je deklarovaný jako MustInherit a neodpovídá omezení New pro parametr typu {1}.
de: Das Typargument "{0}" wurde als "MustInherit" deklariert und erfüllt nicht die Anforderungen der New-Einschränkung für den {1}-Typparameter.
es: El argumento de tipo '{0}' está declarado como 'MustInherit' y no satisface la restricción 'New' para el parámetro de tipo '{1}'.
fr: L'argument de type '{0}' est déclaré 'MustInherit' et ne satisfait pas la contrainte 'New' pour le paramètre de type '{1}'.
it: L'argomento di tipo '{0}' è dichiarato come 'MustInherit' e non soddisfa il vincolo 'New' per il parametro di tipo '{1}'.
ja: 型引数 '{0}' は 'MustInherit' として宣言され、型パラメーター '{1}' の 'New' 制約を満たしていません。
ko: '{0}' 형식 인수는 'MustInherit'으로 선언되었으며 형식 매개 변수 '{1}'에 대한 'New' 제약 조건을 만족하지 않습니다.
pl: Argument typu „{0}” jest deklarowany jako „MustInherit” i nie spełnia ograniczenia „New” dla parametru typu „{1}”.
pt_br: O argumento de tipo "{0}" é declarado "MustInherit" e não satisfaz a restrição "New" para o parâmetro de tipo "{1}".
ru: Аргумент типа "{0}" объявлен как "MustInherit" и не удовлетворяет ограничению "New", накладываемому на параметр типа "{1}".
tr: '{0}' tür bağımsız değişkeni 'MustInherit' olarak bildirildi ve '{1}' tür parametresi için 'New' kısıtlamasını karşılamıyor.
zh_hans: 类型实参“{0}”声明为“MustInherit”，并且不满足类型形参“{1}”的“New”约束。
zh_hant: 類型引數 '{0}' 宣告為 'MustInherit'，且不符合類型參數 '{1}' 的 'New' 條件約束。

# ERR_NoSuitableNewForNewConstraint2
source: Type argument '{0}' must have a public parameterless instance constructor to satisfy the 'New' constraint for type parameter '{1}'.
cs: Argument typu {0} musí mít konstruktor instance bez parametrů, aby bylo splněné omezení New pro parametr typu {1}.
de: Das Typargument "{0}" muss einen öffentlichen parameterlosen Instanzenkonstruktor aufweisen, um der New-Einschränkung für den {1}-Typparameter zu entsprechen.
es: El argumento de tipo '{0}' debe tener un constructor de instancia sin parámetros público para satisfacer la restricción 'New' para el parámetro de tipo '{1}'.
fr: L'argument de type '{0}' doit avoir un constructeur d'instance sans paramètre public pour satisfaire la contrainte 'New' pour le paramètre de type '{1}'.
it: L'argomento di tipo '{0}' deve avere un costruttore di istanza pubblico senza parametri per soddisfare il vincolo 'New' per il parametro di tipo '{1}'.
ja: 型パラメーター '{1}' の 'New' 制約を満たすには、型引数 '{0}' にパブリック パラメーターなしインスタンス コンストラクターを指定しなければなりません。
ko: 형식 매개 변수 '{1}'에 대한 'New' 제약 조건을 만족하려면 형식 인수 '{0}'에 매개 변수가 없는 public 인스턴스 생성자가 있어야 합니다.
pl: Argument typu „{0}” musi mieć publiczny konstruktor wystąpienia bez parametrów, aby spełniać ograniczenie „New” dla parametru typu „{1}”.
pt_br: O argumento de tipo "{0}" deve ter um construtor de instância sem parâmetros públicos para satisfazer a restrição "New" para parâmetro de tipo "{1}".
ru: Аргумент типа "{0}" должен иметь конструктор открытого экземпляра без параметров для удовлетворения ограничения "New" для параметра типа "{1}".
tr: '{0}' tür bağımsız değişkeninde, '{1}' tür parametresinin 'New' kısıtlamasını karşılayacak ortak parametresi olmayan bir örnek oluşturucusu olmalıdır.
zh_hans: 类型实参“{0}”必须具有一个公共的无参数实例构造函数，才能满足类型形参“{1}”的“New”约束。
zh_hant: 類型引數 '{0}' 必須擁有公用的無參數執行個體建構函式，才能滿足類型參數 '{1}' 的 'New' 條件約束。
