Repository: dotnet/roslyn
Catalog: src/Compilers/VisualBasic/Portable/xlf/VBResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_MultipleDeclFileExtChecksum_Title
source: File name already declared with a different GUID and checksum value
cs: Název souboru je už deklarovaný s jiným identifikátorem GUID a hodnotou kontrolního součtu.
de: Der Dateiname wurde bereits mit einer anderen GUID und einem anderen Prüfsummenwert deklariert.
es: El nombre de archivo ya está declarado con un GUID y un valor de suma de comprobación distintos
fr: Le nom de fichier est déjà déclaré avec un GUID et une valeur de checksum différents
it: Il nome file è già dichiarato con un valore diverso per checksum e GUID
ja: ファイル名は、別の GUID とチェックサム値を使用して既に宣言されています
ko: 파일 이름이 이미 다른 GUID와 체크섬 값으로 선언되어 있음
pl: Nazwa pliku została już zadeklarowana z innym identyfikatorem GUID i inną wartością sumy kontrolnej
pt_br: Nome do arquivo já declarado com um GUID e valor de soma de verificação diferentes
ru: Имя файла уже объявлено с другим GUID и контрольной суммой
tr: Dosya adı farklı bir GUID ve sağlama toplaması değeriyle zaten bildirildi
zh_hans: 已使用另一个 GUID 和校验和值声明了文件名
zh_hant: 已使用不同的 GUID 與總和檢查碼值宣告的檔名

# WRN_BadGUIDFormatExtChecksum
source: Bad GUID format.
cs: Nesprávný formát GUID
de: Ungültiges GUID-Format.
es: Formato de GUID incorrecto.
fr: Format de GUID incorrect.
it: Il formato GUID non è valido.
ja: 不適切な GUID 形式です。
ko: 잘못된 GUID 형식입니다.
pl: Nieprawidłowy format identyfikatora GUID.
pt_br: Formato de GUID inválido.
ru: Недействительный формат GUID.
tr: Hatalı GUID biçimi.
zh_hans: 错误的 GUID 格式。
zh_hant: GUID 格式錯誤。

# WRN_BadGUIDFormatExtChecksum_Title
source: Bad GUID format
cs: Nesprávný formát GUID
de: Ungültiges GUID-Format.
es: Formato de GUID incorrecto
fr: Format de GUID incorrect
it: Il formato del GUID non è valido
ja: 不適切な GUID 形式です
ko: 잘못된 GUID 형식
pl: Nieprawidłowy format identyfikatora GUID
pt_br: Formato de GUID inválido
ru: Недействительный формат GUID
tr: Hatalı GUID biçimi
zh_hans: 错误的 GUID 格式
zh_hant: GUID 格式錯誤

# WRN_ObjectMathSelectCase
source: Operands of type Object used in expressions for 'Select', 'Case' statements; runtime errors could occur.
cs: Ve výrazech pro příkazy Select a Case se používají operandy typu Object. Mohlo by docházet k chybám při spuštění.
de: In Ausdrücken für Select- oder Case-Anweisungen werden Operanden vom Typ "Object" verwendet. Dies kann Laufzeitfehler verursachen.
es: Se han usado operandos del tipo Object en expresiones de instrucciones 'Select', 'Case'. Podrían producirse errores en tiempo de ejecución.
fr: Opérandes de type Object utilisés dans les expressions pour les instructions 'Select', 'Case' ; des erreurs au moment de l'exécution peuvent se produire.
it: Sono stati usati operandi di tipo Object in espressioni per istruzioni 'Select' e 'Case'. Potrebbero verificarsi errori di runtime.
ja: Select'、'Case' ステートメントの式で Object 型のオペランドが使用されています。ランタイム エラーが発生する可能性があります。
ko: Select', 'Case' 문의 식에서 Object 형식의 피연산자를 사용했습니다. 런타임 오류가 발생할 수 있습니다.
pl: Argumenty operacji typu Object używane w wyrażeniach dla instrukcji Select, Case; mogą wystąpić błędy czasu wykonania.
pt_br: Operandos do tipo Object usados na expressão para instruções 'Select', 'Case'; erros de tempo de execução podem ocorrer.
ru: В выражениях для операторов "Select", "Case" используются операнды типа Object; возможна ошибка времени выполнения.
tr: Select' ve 'Case' için ifadelerde kullanılan Object türünde işlenenler; çalışma zamanı hataları oluşabilir.
zh_hans: 在 "Select"、"Case" 语句的表达式中使用了 Object 类型的操作数；可能会发生运行时错误。
zh_hant: Select'、'Case' 陳述式的運算式中所使用的類型 Object 的運算元; 可能發生執行階段錯誤。

# WRN_ObjectMathSelectCase_Title
source: Operands of type Object used in expressions for 'Select', 'Case' statements
cs: Ve výrazech pro příkazy Select a Case se používají operandy typu Object.
de: In Ausdrücken für Select- oder Case-Anweisungen werden Operanden vom Typ "Object" verwendet.
es: Operandos de tipo Object usados en expresiones para las instrucciones 'Select' y 'Case'
fr: Opérandes de type Object utilisés dans des expressions pour les instructions 'Select' et 'Case'
it: Sono stati usati operandi di tipo Object in espressioni per istruzioni 'Select' e 'Case'
ja: Select'、'Case' ステートメントの式で Object 型のオペランドが使用されています
ko: Select', 'Case' 문의 식에 Object 형식의 피연산자를 사용함
pl: W wyrażeniach dla instrukcji „Select” i „Case” użyto argumentów operacji typu Object
pt_br: Operandos do tipo Object usados em expressões para instruções 'Select' e 'Case'
ru: В выражениях для операторов Select и Case используются операнды типа Object
tr: Select' ve 'Case' deyimlerinde kullanılan Object türündeki işlenenler
zh_hans: "Select"、"Case" 语句的表达式中使用的 Object 类型的操作数
zh_hant: Select'、'Case' 陳述式的運算式中使用了 Object 類型的運算元

# WRN_EqualToLiteralNothing
source: This expression will always evaluate to Nothing (due to null propagation from the equals operator). To check if the value is null consider using 'Is Nothing'.
cs: Tento výraz bude vždy nabývat hodnotu Nothing vzhledem k šíření hodnoty null z operátoru rovná se. Pokud chcete zkontrolovat, jestli je hodnota rovna hodnotě null, použijte funkci Is Nothing.
de: Dieser Ausdruck ergibt immer "Nothing" (aufgrund der NULL-Weitergabe des Equals-Operators). Verwenden Sie ggf. "Is Nothing", um zu überprüfen, ob der Wert NULL ist.
es: Esta expresión siempre se evaluará como Nothing (debido a la propagación de tipo NULL del operador equals). Para comprobar si el valor es NULL, puede usar 'Is Nothing'.
fr: Cette expression sera toujours évaluée en Nothing (en raison de la propagation null à partir de l'opérateur égal). Pour vérifier si la valeur est null, utilisez 'Is Nothing'.
it: Questa espressione restituirà sempre Nothing a causa della propagazione di valori Null dall'operatore Equals. Per verificare se il valore è Null, provare a usare 'IsNot Nothing'.
ja: この式は常に Nothing に評価されます (等値演算子からの null 値の反映が原因)。値が null であるかどうかを確認するには、'Is Nothing' の使用を検討してください。
ko: Equals 연산자의 null 전파 때문에 이 식은 항상 Nothing으로 평가됩니다. 값이 null인지 확인하려면 'Is Nothing'을 사용하세요.
pl: Wartością tego wyrażenia zawsze będzie Nothing (z powodu propagacji wartości null z operatora równości). Aby sprawdzać, czy wartość jest równa null, rozważ użycie warunku „Is Nothing”.
pt_br: Esta expressão sempre convergirá para Nothing (devido ao tratamento simplificado de nulo do operador igual). Para verificar se o valor é nulo, considere o uso de 'Is Nothing'.
ru: Это выражение всегда будет иметь результат "Nothing" (из-за распространения значения Null от оператора равенства). Для проверки на значение NULL рекомендуется использовать "Is Nothing".
tr: Bu ifade her zaman Nothing olarak hesaplanır (eşittir işlecinden gelen null yayılmasına bağlı olarak). Değerin null olup olmadığını denetlemek için 'Is Nothing' kullanabilirsiniz.
zh_hans: 此表达式的计算结果始终为 Nothing (由于来自等于运算符的 null 传播)。若要检查值是否为 null，请考虑使用 "Is Nothing"。
zh_hant: 這個運算式永遠會評估為 Nothing (由於等號運算子的 null 傳播所造成)。若要檢查此值是否為 null，請考慮使用 'Is Nothing'。

# WRN_EqualToLiteralNothing_Title
source: This expression will always evaluate to Nothing
cs: Tento výraz se vždycky vyhodnotí jako Nothing.
de: Dieser Ausdruck ergibt immer "Nothing".
es: Esta expresión siempre se evaluará como Nothing
fr: Cette expression sera toujours évaluée en Nothing
it: Questa espressione restituirà sempre Nothing
ja: この式は常に Nothing に評価されます
ko: 이 식은 항상 Nothing으로 평가됨
pl: To wyrażenie zawsze da wynik Nothing
pt_br: Essa expressão será sempre avaliada como Nada
ru: Вычисление этого выражения всегда будет иметь значение Nothing
tr: Bu ifade her zaman Nothing olarak değerlendirilir
zh_hans: 此表达式的计算结果始终为 Nothing
zh_hant: 這個運算式一律會評估為 Nothing

# WRN_NotEqualToLiteralNothing
source: This expression will always evaluate to Nothing (due to null propagation from the equals operator). To check if the value is not null consider using 'IsNot Nothing'.
cs: Tento výraz bude vždy nabývat hodnotu Nothing vzhledem k šíření hodnoty null z operátoru rovná se. Pokud chcete zkontrolovat, jestli se hodnota nerovná hodnotě null, použijte funkci IsNot Nothing.
de: Dieser Ausdruck ergibt immer "Nothing" (aufgrund der NULL-Weitergabe des Equals-Operators). Verwenden Sie ggf. "IsNot Nothing", um zu überprüfen, ob der Wert nicht NULL ist.
es: Esta expresión siempre se evaluará como Nothing (debido a la propagación de tipo NULL del operador equals). Para comprobar si el valor no es NULL, puede usar 'IsNot Nothing'.
fr: Cette expression sera toujours évaluée en Nothing (en raison de la propagation null à partir de l'opérateur égal). Pour vérifier si la valeur n'est pas null, utilisez 'IsNot Nothing'.
it: Questa espressione restituirà sempre Nothing a causa della propagazione di valori Null dall'operatore Equals. Per verificare se il valore non è Null, provare a usare 'IsNot Nothing'.
ja: この式は常に Nothing に評価されます (等値演算子からの null 値の反映が原因)。値が null でないかどうかを確認するには、'IsNot Nothing' の使用を検討してください。
ko: Equals 연산자의 null 전파 때문에 이 식은 항상 Nothing으로 평가됩니다. 값이 null이 아닌지 확인하려면 'IsNot Nothing'을 사용하세요.
pl: Wartością tego wyrażenia zawsze będzie Nothing (z powodu propagacji wartości null z operatora równości). Aby sprawdzać, czy wartość nie jest równa null, rozważ użycie warunku „IsNot Nothing”.
pt_br: Esta expressão sempre convergirá para Nothing (devido ao tratamento simplificado de nulo do operador igual). Para verificar se o valor é não nulo, considere o uso de 'IsNot Nothing'.
ru: Это выражение всегда будет иметь результат "Nothing" (из-за распространения значения Null от оператора равенства). Для проверки на значение NULL рекомендуется использовать "IsNot Nothing".
tr: Bu ifade (eşittir işlecinden gelen null yayılmasına bağlı olarak) her zaman Nothing döndürecek. Değerin null olup olmadığını denetlemek için 'IsNot Nothing' kullanabilirsiniz.
zh_hans: 此表达式的计算结果始终为 Nothing (由于来自等于运算符的 null 传播)。若要检查值是否不为 null，请考虑使用 "IsNot Nothing"。
zh_hant: 這個運算式永遠會評估為 Nothing (由於等號運算子的 null 傳播所造成)。若要檢查此值是否並非為 null，請考慮使用 'IsNot Nothing'。

# WRN_NotEqualToLiteralNothing_Title
source: This expression will always evaluate to Nothing
cs: Tento výraz se vždycky vyhodnotí jako Nothing.
de: Dieser Ausdruck ergibt immer "Nothing".
es: Esta expresión siempre se evaluará como Nothing
fr: Cette expression sera toujours évaluée en Nothing
it: Questa espressione restituirà sempre Nothing
ja: この式は常に Nothing に評価されます
ko: 이 식은 항상 Nothing으로 평가됨
pl: To wyrażenie zawsze da wynik Nothing
pt_br: Essa expressão será sempre avaliada como Nada
ru: Вычисление этого выражения всегда будет иметь значение Nothing
tr: Bu ifade her zaman Nothing olarak değerlendirilir
zh_hans: 此表达式的计算结果始终为 Nothing
zh_hant: 這個運算式一律會評估為 Nothing

# WRN_UnusedLocalConst
source: Unused local constant: '{0}'.
cs: Nepoužitá lokální konstanta: {0}
de: Nicht verwendete lokale Konstante: "{0}".
es: Constante local sin usar: '{0}'.
fr: Constante locale inutilisée : '{0}'.
it: Costante locale non usata: '{0}'.
ja: 未使用のローカル定数: '{0}'。
ko: 사용되지 않는 지역 상수: '{0}'
pl: Nieużywana stała lokalna: „{0}”.
pt_br: Constante local não utilizada: "{0}".
ru: Неиспользованная локальная константа: "{0}".
tr: Kullanılmayan yerel sabit: '{0}'.
zh_hans: 未使用的局部常量:“{0}”。
zh_hant: 未使用的區域常數: '{0}'。

# WRN_UnusedLocalConst_Title
source: Unused local constant
cs: Nepoužitá lokální konstanta
de: Nicht verwendete lokale Konstante
es: Constante local sin usar
fr: Constante locale non utilisée
it: Costante locale non usata
ja: 未使用のローカル定数です
ko: 사용하지 않는 로컬 상수
pl: Nieużywana stała lokalna
pt_br: Constante local não usada
ru: Неиспользуемая локальная константа
tr: Kullanılmayan yerel sabit
zh_hans: 未使用的局部常量
zh_hant: 未使用的區域常數

# WRN_ComClassInterfaceShadows5
source: 'Microsoft.VisualBasic.ComClassAttribute' on class '{0}' implicitly declares {1} '{2}', which conflicts with a member of the same name in {3} '{4}'. Use 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)' if you want to hide the name on the base {4}.
cs: 'Microsoft.VisualBasic.ComClassAttribute ve třídě {0} implicitně deklaruje {1} {2}, což je v konfliktu s členem se stejným názvem v {3} {4}. Použijte Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True), pokud chcete skrýt název v základní třídě {4}.
de: 'Microsoft.VisualBasic.ComClassAttribute für die {0}-Klasse deklariert implizit {1} "{2}", was einen Konflikt mit einem Member desselben Namens in {3} "{4}" verursacht. Verwenden Sie "Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)" wenn Sie den Namen in der Basis-{4} verbergen möchten.
es: 'Microsoft.VisualBasic.ComClassAttribute' de la clase '{0}' declara implícitamente {1} '{2}', que entra en conflicto con un miembro del mismo nombre en {3} '{4}'. Use 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)' si quiere ocultar el nombre en la base {4}.
fr: 'Microsoft.VisualBasic.ComClassAttribute' dans la classe '{0}' déclare implicitement {1} '{2}', qui est en conflit avec un membre du même nom dans {3} '{4}'. Utilisez 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)' si vous voulez masquer le nom dans le {4} de base.
it: 'Microsoft.VisualBasic.ComClassAttribute' nella classe '{0}' dichiara in modo implicito {1} '{2}', che è in conflitto con un membro di {3} '{4}' con lo stesso nome. Se si vuole nascondere il nome nell'elemento {4} base, usare 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)'.
ja: 'クラス '{0}' の 'Microsoft.VisualBasic.ComClassAttribute' は、{3} '{4}' にある同じ名前のメンバーと競合する {1} '{2}' を暗黙的に宣言します。ベース {4} の名前をシャドウする場合は 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)' に設定してください。
ko: '{0}' 클래스의 'Microsoft.VisualBasic.ComClassAttribute'는 {3} '{4}'에서 이름이 같은 멤버와 충돌하는 {1} '{2}'을(를) 암시적으로 선언합니다. 기본 {4}의 이름을 숨기려면 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)'를 사용하세요.
pl: 'Element „Microsoft.VisualBasic.ComClassAttribute” w klasie „{0}” niejawnie deklaruje element {1} „{2}”, który powoduje konflikt ze składową o tej samej nazwie w elemencie {3} „{4}”. Użyj elementu „Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)”, jeśli chcesz ukryć nazwę w bazie {4}.
pt_br: "Microsoft.VisualBasic.ComClassAttribute" na classe "{0}" declara implicitamente {1} "{2}", que está em conflito com um membro do mesmo nome em {3} "{4}". Use "Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)" se você deseja ocultar o nome da base {4}.
ru: '"Microsoft.VisualBasic.ComClassAttribute" для класса "{0}" неявно объявляет {1} "{2}", что конфликтует с членом, имеющим то же имя в {3} "{4}". Используйте "Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)", если вы хотите скрыть имя в базе{4}.
tr: '{0}' sınıfındaki 'Microsoft.VisualBasic.ComClassAttribute', {3} '{4}' içinde aynı ada sahip bir üyeyle çakışan {1} '{2}' öğesini örtük olarak bildiriyor. {4} temelinde adı gizlemek istiyorsanız, 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)' kullanın.
zh_hans: '类“{0}”上的“Microsoft.VisualBasic.ComClassAttribute”隐式声明的 {1}“{2}”与 {3}“{4}”中的同名成员冲突。如果要隐藏基 {4} 上的名称，请使用“Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)”。
zh_hant: '在類別 '{0}' 上的 'Microsoft.VisualBasic.ComClassAttribute' 隱含宣告的 {1} '{2}'，與 {3} '{4}' 中的同名成員互相衝突。若要隱藏基底 {4} 上的名稱，請使用 'Microsoft.VisualBasic.ComClassAttribute(InterfaceShadows:=True)'。

# WRN_ComClassInterfaceShadows5_Title
source: 'Microsoft.VisualBasic.ComClassAttribute' on class implicitly declares member, which conflicts with a member of the same name
cs: 'Microsoft.VisualBasic.ComClassAttribute v třídě deklaruje implicitně člena, který je v konfliktu se členem stejného názvu.
de: 'Durch "Microsoft.VisualBasic.ComClassAttribute" in der Klasse wird impliziert ein Member deklariert, wodurch ein Konflikt mit einem Member mit demselben Namen entsteht.
es: 'Microsoft.VisualBasic.ComClassAttribute' de la clase declara implícitamente al miembro, lo que entra en conflicto con un miembro con el mismo nombre
fr: 'Microsoft.VisualBasic.ComClassAttribute' sur la classe déclare le membre de manière implicite, ce qui provoque un conflit avec un membre du même nom
it: 'Microsoft.VisualBasic.ComClassAttribute' sulla classe dichiara in modo implicito il membro, che è in conflitto con un membro con lo stesso nome
ja: 'Microsoft.VisualBasic.ComClassAttribute' クラスで暗黙的に宣言されているメンバーが、同じ名前のメンバーと競合しています
ko: '클래스의 'Microsoft.VisualBasic.ComClassAttribute'가 동일한 이름의 멤버와 충돌하는 멤버를 암시적으로 선언함
pl: 'Atrybut „Microsoft.VisualBasic.ComClassAttribute” klasy niejawnie deklaruje składową pozostającą w konflikcie ze składową o tej samej nazwie
pt_br: 'Microsoft.VisualBasic.ComClassAttribute' na classe declara implicitamente um membro, que está em conflito com um membro do mesmo nome
ru: 'Атрибут Microsoft.VisualBasic.ComClassAttribute в классе неявно объявляет член, который конфликтует с членом, обладающим тем же именем
tr: 'Sınıf üzerindeki 'Microsoft.VisualBasic.ComClassAttribute', aynı ada sahip bir üye ile çakışan üye bildiriyor
zh_hans: '类上的 "Microsoft.VisualBasic.ComClassAttribute" 隐式声明与同名成员发生冲突的成员
zh_hant: '類別上的 'Microsoft.VisualBasic.ComClassAttribute' 隱含宣告了與同名成員互相衝突的成員

# WRN_ComClassPropertySetObject1
source: '{0}' cannot be exposed to COM as a property 'Let'. You will not be able to assign non-object values (such as numbers or strings) to this property from Visual Basic 6.0 using a 'Let' statement.
cs: 'Vlastnost {0} nejde vystavit rozhraní COM jako vlastnost Let. Této vlastnosti nebude možné v rámci jazyka Visual Basic 6.0 přiřadit neobjektové hodnoty (například čísla nebo řetězce) pomocí příkazu Let.
de: '"{0}" kann nicht für COM als Let-Eigenschaft verfügbar gemacht werden. Sie können dieser Eigenschaft mit der Let-Anweisung keine Werte (z. B. Zahlen oder Zeichenfolgen) aus Visual Basic 6.0 zuweisen, die keine Objekte sind.
es: '{0}' no se puede exponer a COM como una propiedad 'Let'. No podrá asignar valores que no sean de objeto (como números o cadenas) a esta propiedad desde Visual Basic 6.0 usando una instrucción 'Let'.
fr: '{0}' ne peut pas être exposé à COM en tant que propriété 'Let'. Vous ne serez pas en mesure d'assigner des valeurs qui ne sont pas des objets (telles que des nombres ou des chaînes) à cette propriété à partir de Visual Basic 6.0 à l'aide d'une instruction 'Let'.
it: '{0}' non può essere esposto a COM come proprietà 'Let'. Non sarà possibile assegnare valori non oggetto (quali numeri o stringhe) a questa proprietà da Visual Basic 6.0 con un'istruzione 'Let'.
ja: '{0}' を、プロパティ 'Let' として COM に公開することはできません。'Let' ステートメントを使って、数字や文字列のようなオブジェクト以外の値を Visual Basic 6.0 のこのプロパティに割り当てることはできません。
ko: '{0}'을(를) 'Let' 속성으로 COM에 노출할 수 없습니다. Visual Basic 6.0의 'Let' 문을 사용하여 이 속성에 숫자나 문자열 같은 개체가 아닌 값을 할당할 수 없습니다.
pl: 'Element „{0}” nie może być ujawniony dla modelu COM jako instrukcja „Let” właściwości. Przy użyciu instrukcji „Let” nie będzie można przypisać do tej właściwości wartości niebędących obiektami (takich jak liczby czy ciągi) w języku Visual Basic 6.0.
pt_br: "{0}" não pode ser exposto a COM como uma propriedade "Let". Você não poderá atribuir valores não-objeto (como números ou cadeias de caracteres) para essa propriedade do Visual Basic 6.0 usando uma instrução "Let".
ru: 'Для "{0}" невозможно использование через COM как свойство "Let". Вы не сможете присвоить значения, не являющиеся объектом (например, числа или строки), с помощью оператора "Let" для этого свойства с версии Visual Basic 6.0.
tr: '{0}', 'Let' özelliği olarak COM'ye açılamaz. Visual Basic 6.0'dan 'Let' deyimini kullanarak, nesne olmayan değerleri (sayılar veya dizeler gibi) bu özelliğe atayamazsınız.
zh_hans: '“{0}”无法作为属性“Let”向 COM 公开。将无法使用“Let”语句从 Visual Basic 6.0 向该属性分配非对象值(如数字或字符串)。
zh_hant: '{0}' 無法以屬性 'Let' 公開給 COM。您無法從 Visual Basic 6.0 使用 'Let' 陳述式，將非物件值 (例如數值或字串) 指定給此屬性。

# WRN_ComClassPropertySetObject1_Title
source: Property cannot be exposed to COM as a property 'Let'
cs: Vlastnost se nedá vystavit do modelu COM jako vlastnost Let.
de: Die Eigenschaft kann nicht als "Let"-Eigenschaft für COM verfügbar gemacht werden.
es: La propiedad no se puede exponer en COM como una propiedad 'Let'
fr: La propriété ne peut pas être exposée à COM en tant que propriété 'Let'
it: Non è possibile esporre la proprietà a COM come proprietà 'Let'
ja: プロパティを、'Let' として COM に公開することはできません
ko: 속성을 COM에 'Let' 속성으로 노출할 수 없음
pl: Nie można ujawnić właściwości modelowi COM jako właściwości „Let”
pt_br: A propriedade não pode ser exposta a COM como propriedade 'Let'
ru: Невозможно предоставить свойство для COM как свойство Let
tr: Özellik, COM'a 'Let' özelliği olarak sunulamaz
zh_hans: 无法将属性作为 "Let" 属性向 COM 公开
zh_hant: 無法以屬性 'Let' 的形式將屬性公開給 COM

# WRN_DefAsgUseNullRef
source: Variable '{0}' is used before it has been assigned a value. A null reference exception could result at runtime.
cs: Proměnná {0} se použije dřív, než se jí přiřadí hodnota. Při spuštění by mohlo dojít k výjimce vyvolané odkazem s hodnotou Null.
de: Die {0}-Variable wird verwendet, bevor ihr ein Wert zugewiesen wird. Zur Laufzeit kann eine Nullverweisausnahme auftreten.
es: La variable '{0}' se usa antes de que se le haya asignado un valor. Podría darse una excepción de referencia NULL en tiempo de ejecución.
fr: La variable '{0}' est utilisée avant qu'une valeur ne lui ait été assignée. Une exception de référence null peut se produire au moment de l'exécution.
it: La variabile '{0}' è stata usata prima dell'assegnazione di un valore. È possibile che in fase di esecuzione venga restituita un'eccezione dovuta a un riferimento Null.
ja: 変数 '{0}' は、値が割り当てられる前に使用されています。Null 参照の例外が実行時に発生する可能性があります。
ko: 값이 할당되기 전에 '{0}' 변수를 사용했습니다. 런타임에 null 참조 예외가 발생할 수 있습니다.
pl: Zmienna „{0}” jest używana, zanim zostanie do niej przypisana wartość. Podczas wykonywania może wystąpić wyjątek pustej referencji.
pt_br: Variável "{0}" é usada antes de receber um valor. Uma exceção de referência nula poderia resultar em runtime.
ru: Используется переменная "{0}", прежде чем ей было присвоено значение. Во время выполнения может появиться пустая ссылка на исключение.
tr: '{0}' değişkeni bir değere atanmadan önce kullanıldı. Çalışma zamanında null başvurusu özel durumu oluşabilir.
zh_hans: 变量“{0}”在赋值前被使用。可能会在运行时导致 null 引用异常。
zh_hant: 為變數 '{0}' 指派值之前，已使用該變數。可能會在執行階段產生 null 參考例外狀況。

# WRN_DefAsgUseNullRef_Title
source: Variable is used before it has been assigned a value
cs: Proměnná se používá dřív, než se k ní přiřadí hodnota.
de: Die Variable wurde verwendet, bevor ihr ein Wert zugewiesen wurde.
es: Se usa la variable antes de que se le haya asignado un valor
fr: La variable est utilisée avant de se voir attribuer une valeur
it: La variabile è stata usata prima dell'assegnazione di un valore
ja: 変数が、値が割り当てられる前に使用されています
ko: 변수에 값이 할당되기 전에 변수가 사용됨
pl: Zmienna została użyta przed przypisaniem do niej wartości
pt_br: A variável é usada antes de receber um valor
ru: Переменная используется до того, как ей было назначено значение
tr: Değişken, bir değer atanmadan kullanıldı
zh_hans: 在为变量赋值之前，变量已被使用
zh_hant: 變數在獲派值之前就已使用
