Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# OverrideCodeActionEquivalenceKeyMessage
source: '{0}' has the default value of 'null' for property '{1}'. Either override this property on '{0}' to return a non-null and unique value across all code actions per-fixer or use such an existing code action.
de: "{0}" besitzt den Standardwert "null" für die Eigenschaft "{1}". Setzen Sie diese Eigenschaft für "{0}" außer Kraft, um zu einem für alle Codeaktionen pro Korrekturregel eindeutigen Wert ungleich NULL zurückzukehren, oder verwenden Sie eine solche vorhandene Codeaktion.
es: “{0}” tiene el valor predeterminado “null” para la propiedad “{1}”. Reemplace esta propiedad en “{0}” para devolver un valor único no NULL en todas las acciones de código por reparador o use una acción de código existente de este tipo.
fr: '{0}' a la valeur par défaut 'null' pour la propriété '{1}'. Remplacez cette propriété sur '{0}' pour retourner une valeur non null et unique dans l'ensemble des actions de code par correcteur, ou utilisez une action de code existante de ce type.
it: Il valore predefinito di '{0}' è 'null' per la proprietà '{1}'. Eseguire l'override di questa proprietà su '{0}' in modo da restituire un valore non Null e univoco in tutte le azioni codice per utilità di correzione oppure usare tale azione codice esistente.
ko: '{0}'에는 '{1}' 속성에 대한 'null'의 기본값이 있습니다. '{0}'의 속성을 재정의하여 수정 도구당 모든 코드 작업에서 null이 아닌 고유 값을 반환하거나 기존 코드 작업을 사용하세요.
pl: Element „{0}” ma wartość domyślną „null” dla właściwości „{1}”. Zastąp tę właściwość w elemencie „{0}”, aby zwrócić niezerową i unikatową wartość dla wszystkich akcji kodów na regułę naprawczą, albo użyj takiej akcji istniejącego kodu.
ru: "{0}" имеет значение по умолчанию "Null" для свойства "{1}". Переопределите это свойство в "{0}", чтобы возвратить отличное от Null и уникальное значение для всех действий кода, относящихся к одному исправлению, или используйте уже существующее действие кода.
tr: '{0}' '{1}' özelliği için 'null' varsayılan değerine sahip. Null olmayan ve tüm kod eylemleri arasında benzersiz bir değer döndürmek için '{0}' üzerindeki bu özelliği geçersiz kılın veya buna benzer mevcut bir kod eylemi kullanın.
zh_hans: “{0}”具有适用于属性“{1}”的默认值 "null"。可重写“{0}”上的此属性，以返回每个修复程序的所有代码操作中的唯一非 null 值，也可使用此类现有代码操作。
zh_hant: '{0}' 的屬性 '{1}' 為預設值 'null'。請在 '{0}' 上覆寫此屬性，以傳回在每個修正程式的所有程式碼動作之間唯一的非 Null 值，或使用這類現有的程式碼動作。

# OverrideCodeActionEquivalenceKeyTitle
source: Use code actions that have a unique EquivalenceKey for FixAll occurrences support
de: Zur Unterstützung von FixAll-Vorkommen Codeaktionen mit eindeutigem EquivalenceKey verwenden
es: Use acciones de código con un elemento EquivalenceKey único para admitir las repeticiones de FixAll
fr: Utilisez les actions de code ayant un EquivalenceKey unique pour la prise en charge des occurrences de FixAll
it: Usare azioni codice con un elemento EquivalenceKey univoco per il supporto delle occorrenze di FixAll
ko: FixAll 발생 지원을 위한 고유 EquivalenceKey가 있는 코드 작업 사용
pl: Użyj akcji kodu, które mają unikatowy klucz EquivalenceKey do obsługi wystąpień FixAll
ru: Использование действий кода, имеющих уникальный EquivalenceKey, для поддержки FixAll
tr: FixAll oluşumları desteği için benzersiz bir EquivalenceKey’e sahip kod eylemleri kullanın
zh_hans: 使用具备 FixAll 事件支持的唯一 EquivalenceKey 的代码操作
zh_hant: 使用具有唯一 EquivalenceKey 之程式碼動作，支援出現 FixAll 之處

# DoNotIgnoreReturnValueOnImmutableObjectMethodInvocationDescription
source: Many objects exposed by Roslyn are immutable. The return value from a method invocation on these objects should not be ignored.
de: Viele von Roslyn verfügbar gemachte Objekte sind unveränderlich. Der Rückgabewert aus einem Methodenaufruf für diese Objekte darf nicht ignoriert werden.
es: Muchos de los objetos que Roslyn expone son inmutables. El valor devuelto de una invocación de método en estos objetos no debe omitirse.
fr: De nombreux objets exposés par Roslyn sont non modifiables. La valeur de retour d'un appel de méthode sur ces objets ne doit pas être ignorée.
it: Molti oggetti esposti da Roslyn non sono modificabili. Il valore restituito da una chiamata di metodo su questi oggetti non deve essere ignorato.
ko: Roslyn에서 노출한 대부분의 개체는 변경할 수 없습니다. 이 개체에 대한 메서드 호출의 반환 값은 무시할 수 없습니다.
pl: Wiele obiektów ujawnionych przez program Roslyn jest niezmienialnych. Wartość zwracana z wywołania metody dla tych obiektów nie powinna być ignorowana.
ru: Многие из предоставляемых Roslyn объектов являются неизменяемыми. Не игнорируйте значение, возвращаемое из вызова метода для этих объектов.
tr: Roslyn tarafından açığa çıkarılan birçok nesne sabittir. Bu nesneler üzerinde bir yöntem çağırmadan dönüş değeri yoksayılmamalıdır.
zh_hans: 由 Roslyn 公开的多个对象不可变。通过对这些对象的方法调用得到的返回值不应被忽略。
zh_hant: Roslyn 所公開的許多物件皆不可變。請勿略過來自這些物件上，方法引動過程的傳回值。

# DoNotIgnoreReturnValueOnImmutableObjectMethodInvocationMessage
source: '{0}' is immutable and '{1}' will not have any effect on it. Consider using the return value from '{1}'.
de: "{0}" ist unveränderlich, "{1}" besitzt darauf keine Auswirkungen. Ziehen Sie in Betracht, den Rückgabewert von "{1}" zu verwenden.
es: “{0}” es inmutable y “{1}” no tienen ningún efecto en dicho elemento. Considere usar el valor devuelto de “{1}”.
fr: '{0}' est non modifiable et '{1}' n'a aucun effet sur celui-ci. Utilisez la valeur de retour de '{1}'.
it: '{0}' non è modificabile e '{1}' non avrà alcun effetto su di esso. Provare a usare il valore restituito da '{1}'.
ko: '{0}'을(를) 변경할 수 없으며 '{1}'은(는) 아무런 영향을 주지 않습니다. '{1}'의 반환 값을 사용하세요.
pl: Element „{0}” jest niezmienialny i element „{1}” nie będzie miał tutaj żadnego efektu. Rozważ użycie wartości zwracanej z elementu „{1}”.
ru: "{0}" является неизменяемым, поэтому "{1}" не окажет на него никакого влияния. Рекомендуется использовать значение, возвращаемое "{1}".
tr: '{0}' sabittir ve '{1}' bu öğeyi etkilemez. '{1}' öğesinden dönüş değerini kullanmayı düşünün.
zh_hans: “{0}”不可变且“{1}”不对它产生任何影响。请考虑使用来自“{1}”的返回值。
zh_hant: '{0}' 不可變動，所以 '{1}' 對它沒有任何作用。請考慮使用來自 '{1}' 的傳回值。

# DoNotIgnoreReturnValueOnImmutableObjectMethodInvocationTitle
source: Do not ignore values returned by methods on immutable objects
de: Keine von Methoden zu unveränderlichen Objekten zurückgegebenen Werte ignorieren
es: No omitir los valores devueltos por métodos en objetos inmutables
fr: Ne pas ignorer les valeurs retournées par les méthodes sur les objets immuables
it: Non ignorare i valori restituiti dai metodi su oggetti non modificabili
ko: 변경할 수 없는 개체의 메서드에서 반환된 값을 무시하지 마세요.
pl: Nie ignoruj wartości zwracanych przez metody w obiektach niezmiennych
ru: Не игнорировать значения, возвращаемые методами для неизменяемых объектов
tr: Sabit nesnelerdeki yöntemler tarafından döndürülen değerleri yok saymama
zh_hans: 不要忽略通过不可变对象上的方法返回的值
zh_hant: 請勿略過不可變物件上方法所傳回的值

# OverrideGetFixAllProviderTitle
source: Code fix providers should provide FixAll support
de: Anbieter von Codekorrekturen müssen FixAll-Unterstützung bereitstellen
es: Los proveedores de corrección de código deberían proporcionar soporte FixAll
fr: Les fournisseurs de correctifs de code doivent prendre en charge FixAll
it: I provider di correzione del codice devono fornire il supporto per FixAll
ko: 코드 수정 공급자가 FixAll 지원을 제공해야 함
pl: Dostawcy poprawek kodu powinni dostarczać obsługę elementu FixAll
ru: Поставщики исправлений кода должны предоставлять поддержку FixAll
tr: Kod düzeltme sağlayıcıları FixAll desteği sağlamalıdır
zh_hans: 代码修复提供程序应提供 FixAll 支持
zh_hant: 程式碼修正提供者應提供 FixAll 支援

# OverrideGetFixAllProviderMessage
source: '{0}' registers one or more code fixes, but does not override the method 'CodeFixProvider.GetFixAllProvider'. Override this method and provide a non-null FixAllProvider for FixAll support, potentially 'WellKnownFixAllProviders.BatchFixer', or 'null' to explicitly disable FixAll support.
de: "{0}" registriert mindestens eine Codefehlerbehebung, aber überschreibt nicht die Methode "CodeFixProvider.GetFixAllProvider". Überschreiben Sie diese Methode, und stellen Sie einen FixAllProvider ungleich NULL für FixAll-Unterstützung bereit, etwa "WellKnownFixAllProviders.BatchFixer" oder "null", um die FixAll-Unterstützung explizit zu deaktivieren.
es: "{0}" registra una o varias correcciones de código, pero no reemplaza el método "CodeFixProvider.GetFixAllProvider". Reemplace este método y proporcione un valor FixAllProvider que no sea nulo para el soporte FixAll; potencialmente "WellKnownFixAllProviders.BatchFixer" o "null" para deshabilitar explícitamente el soporte FixAll.
fr: '{0}' inscrit un ou plusieurs correctifs de code, mais ne substitue pas la méthode 'CodeFixProvider.GetFixAllProvider'. Substituez cette méthode et fournissez un FixAllProvider non-null pour la prise en charge de FixAll, éventuellement 'WellKnownFixAllProviders.BatchFixer', ou 'null' pour désactiver explicitement la prise en charge de FixAll.
it: '{0}' registra una o più correzioni del codice, ma non esegue l'override del metodo 'CodeFixProvider.GetFixAllProvider'. Eseguire l'override di questo metodo e fornire un elemento FixAllProvider non Null per il supporto per FixAll, possibilmente 'WellKnownFixAllProviders.BatchFixer', oppure 'null' per disabilitare in modo esplicito il supporto per FixAll.
ko: '{0}'은(는) 하나 이상의 코드 수정 사항을 등록하지만 'CodeFixProvider.GetFixAllProvider' 메서드를 재정의하지 않습니다. 이 메서드를 재정의하고 FixAll 지원에 대해 null이 아닌 FixAllProvider(잠재적으로 'WellKnownFixAllProviders.BatchFixer')를 제공하세요. 'null'은 FixAll 지원을 명시적으로 사용하지 않습니다.
pl: Element „{0}” rejestruje co najmniej jedną poprawkę kodu, ale nie przesłania metody „CodeFixProvider.GetFixAllProvider”. Przesłoń tę metodę i udostępnij element FixAllProvider o wartości innej niż null na potrzeby obsługi elementu FixAll, potencjalnie „WellKnownFixAllProviders.BatchFixer”, lub „null”, aby jawnie wyłączyć obsługę elementu FixAll.
ru: "{0}" регистрирует одно исправление кода или несколько, но не переопределяет метод "CodeFixProvider.GetFixAllProvider". Переопределите этот метод и предоставьте отличный от NULL FixAllProvider для обеспечения поддержки FixAll, возможно "WellKnownFixAllProviders.BatchFixer", либо задайте значение NULL, чтобы явно отключить поддержку FixAll.
tr: '{0}' bir veya daha fazla kod düzeltmesi kaydediyor ancak 'CodeFixProvider.GetFixAllProvider' metodunu geçersiz kılmıyor. Bu metodu geçersiz kılın ve FixAll desteği için 'WellKnownFixAllProviders.BatchFixer' gibi null olmayan bir FixAllProvider sağlayın veya FixAll desteğini açıkça devre dışı bırakmak için 'null' sağlayın.
zh_hans: “{0}”注册了一个或多个代码修复程序，但是未重写方法 "CodeFixProvider.GetFixAllProvider"。请重写该方法并向 FixAll 支持提供非 null 型 FixAllProvider (可能为 "WellKnownFixAllProviders.BatchFixer")或提供 "null" 以显式启用 FixAll 支持。
zh_hant: '{0}' 註冊了一個或多個程式碼修正，卻沒有覆寫 'CodeFixProvider.GetFixAllProvider' 方法。請覆寫此方法並提供 FixAll 支援、也許是 'WellKnownFixAllProviders.BatchFixer'，或是已明確停用 'null' 的非 null FixAllProvider。

# OverrideGetFixAllProviderDescription
source: A CodeFixProvider should provide FixAll support to enable users to fix multiple instances of the underlying diagnostic with a single code fix. See documentation at https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md for further details.
de: Ein CodeFixProvider muss FixAll-Unterstützung bereitstellen, damit mehrere Instanzen der zugrunde liegenden Diagnose mit einer einzigen Codefehlerbehebung korrigiert werden können. Weitere Informationen finden Sie in der Dokumentation unter https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md.
es: Un valor CodeFixProvider debe proporcionar soporte FixAll para permitir a los usuarios corregir varias instancias del diagnóstico subyacente con una única corrección de código. Consulte la documentación en https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md para obtener más detalles.
fr: CodeFixProvider doit prendre en charge FixAll pour permettre aux utilisateurs de corriger plusieurs instances du diagnostic sous-jacent avec un seul correctif de code. Pour plus d'informations, consultez la documentation sur https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md.
it: Un elemento CodeFixProvider deve fornire il supporto per FixAll per consentire agli utenti di correggere più istanze della diagnostica sottostante con un'unica correzione del codice. Per maggiori dettagli, vedere la documentazione all'indirizzo https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md.
ko: 사용자가 단일 코드 수정 사항을 사용하여 기본 진단의 여러 인스턴스를 수정할 수 있도록 하려면 CodeFixProvider가 FixAll 지원을 제공해야 합니다. 자세한 내용은 https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md에 있는 문서를 참조하세요.
pl: Element CodeFixProvider powinien dostarczać obsługę elementu FixAll, aby umożliwić użytkownikom naprawienie wielu wystąpień diagnostyk bazowych za pomocą pojedynczej poprawki kodu. Zobacz dokumentację pod adresem https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md w celu uzyskania dalszych szczegółów.
ru: CodeFixProvider должен предоставлять поддержку FixAll, чтобы пользователи могли исправить несколько экземпляров базовых диагностических данных с помощью одного исправления кода. Дополнительные сведения см. в документации по адресу https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md for further details.
tr: CodeFixProvider, kullanıcıların tek bir kod düzeltmesiyle temel tanılamanın birden çok örneğini düzeltebilmesi için FixAll desteği sağlamalıdır. Daha fazla ayrıntı için https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md adresindeki belgelere bakın.
zh_hans: CodeFixProvider 应提供 FixAll 支持，以允许用户通过单个代码修补程序修复基础诊断的多个实例。有关更多详细信息，请参阅 https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md 中的文档。
zh_hant: CodeFixProvider 應提供 FixAll 支援，讓使用者能利用單一程式碼修正來修正基礎診斷的多個執行個體。如需進一步的詳細資料，請參閱下列位置的文件 https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md。

# OverrideGetFixAllProviderCodeFixTitle
source: Override GetFixAllProvider.
de: Überschreiben Sie GetFixAllProvider.
es: Reemplace GetFixAllProvider.
fr: Substituez GetFixAllProvider.
it: Eseguire l'override di GetFixAllProvider.
ko: GetFixAllProvider를 재정의하세요.
pl: Przesłoń element GetFixAllProvider.
ru: Переопределите GetFixAllProvider.
tr: GetFixAllProvider’ı geçersiz kılın.
zh_hans: 重写 GetFixAllProvider。
zh_hant: 覆寫 GetFixAllProvider。

# ProvideHelpUriInDescriptorMessage
source: Consider providing a non-null 'helpLinkUri' to diagnostic descriptor constructor to show information when this diagnostic appears in the error list
de: Erwägen Sie die Bereitstellung eines "helpLinkUri" ungleich NULL zum Konstruktor des Diagnosedeskriptors, um Informationen anzuzeigen, wenn diese Diagnose in der Fehlerliste erscheint.
es: Considere la posibilidad de proporcionar un valor "helpLinkUri" no NULL para diagnosticar el constructor del descriptor a fin de mostrar información cuando este diagnóstico aparece en la lista de errores.
fr: Envisagez de fournir un 'helpLinkUri' non-null au constructeur du descripteur de diagnostic pour afficher des informations quand ce diagnostic apparaît dans la liste des erreurs
it: Provare a fornire un valore 'helpLinkUri' non Null al costruttore del descrittore di diagnostica in modo da visualizzare le informazioni quando questa diagnostica è presente nell'elenco errori
ko: null이 아닌 'helpLinkUri'를 진단 설명자 생성자에 제공하여 이 진단이 오류 목록에 나타날 때 정보를 표시하는 것이 좋습니다.
pl: Rozważ dostarczenie wartości „helpLinkUri” innej niż null do konstruktora deskryptora diagnostyki w celu pokazania informacji, gdy ta diagnostyka pojawia się na liście błędów
ru: Рекомендуется предоставить конструктору дескриптора диагностики отличное от NULL значение "helpLinkUri", чтобы отображать информацию, когда эти диагностические данные появляются в списке ошибок.
tr: Bu tanılama, hata listesinde görüntülendiğinde bilgileri göstermek için tanılama tanımlayıcısı oluşturucusuna null olmayan bir 'helpLinkUri' sağlamayı düşünün
zh_hans: 请考虑向诊断描述符构造函数提供一个非 null 型 "helpLinkUri"，以在错误列表中出现该诊断时显示信息
zh_hant: 請考慮提供非 null 的 'helpLinkUri' 到診斷描述元建構函式，使錯誤清單出現此診斷時顯示資訊

# ProvideHelpUriInDescriptorTitle
source: Provide non-null 'helpLinkUri' value to diagnostic descriptor constructor
de: helpLinkUri-Wert ungleich NULL für Konstruktor des Diagnosedeskriptors angeben
es: Proporcione un valor "helpLinkUri" que no sea nulo para diagnosticar el constructor del descriptor
fr: Fournissez une valeur "helpLinkUri" non-null au constructeur du descripteur de diagnostic
it: Fornire un valore 'helpLinkUri' non Null al costruttore del descrittore di diagnostica
ko: null이 아닌 'helpLinkUri' 값을 진단 설명자 생성자에 제공
pl: Dostarcz wartość „helpLinkUri” różną od null do konstruktora deskryptora diagnostyki
ru: Передача значения параметра "helpLinkUri", отличного от NULL, в конструктор дескриптора диагностики
tr: Tanılama tanımlayıcısı oluşturucusuna null olmayan 'helpLinkUri' değeri sağlayın
zh_hans: 向诊断描述符构造函数提供非 null 型 "helpLinkUri" 值
zh_hant: 請提供非 null 的 'helpLinkUri' 值到診斷描述元建構函式

# ProvideHelpUriInDescriptorDescription
source: The 'helpLinkUri' value is used to show information when this diagnostic in the error list. Every analyzer should have a helpLinkUri specified which points to a help page that does not change over time.
de: Der helpLinkUri-Wert wird verwendet, um Informationen anzuzeigen, wenn diese Diagnose in der Fehlerliste erscheint. Jedes Analysetool sollte mithilfe eines helpLinkUri-Werts auf eine Hilfeseite zeigen, die sich im Laufe der Zeit nicht ändert.
es: El valor "helpLinkUri" se utiliza para mostrar información cuando este diagnóstico figura en la lista de errores. Todos los analizadores deben tener un helpLinkUri especificado que apunte a una página de ayuda que no cambie con el tiempo.
fr: La valeur 'helpLinkUri' est utilisée pour afficher des informations quand ce diagnostic figure dans la liste des erreurs. Un helpLinkUri qui pointe vers une page d'aide qui ne change pas au fil du temps doit être spécifié pour chaque analyseur.
it: Il valore 'helpLinkUri' viene usato per visualizzare le informazioni quando questa diagnostica è presente nell'elenco errori. È necessario specificare per ogni analizzatore un elemento helpLinkUri che punta a una pagina che non cambia nel tempo.
ko: 'helpLinkUri' 값은 이 진단이 오류 목록에 표시될 때 정보를 표시하는 데 사용됩니다. 모든 분석기에 시간이 지나도 변경되지 않는 도움말 페이지를 가리키는 지정된 helpLinkUri가 있어야 합니다.
pl: Wartość „helpLinkUri” służy do pokazywania informacji, gdy ta diagnostyka pojawia się na liście błędów. Każdy analizator powinien mieć określoną wartość helpLinkUri wskazującą stronę pomocy, która nie zmienia się w czasie.
ru: Значение "helpLinkUri" используется для отображения информации при появлении этих диагностических сведений в списке ошибок. Для каждого анализатора должен быть задан helpLinkUri, указывающий на страницу справки, которая не меняется с течением времени.
tr: 'helpLinkUri' değeri, bu tanılama hata listesinde olduğunda bilgi görüntülemek için kullanılır. Her çözümleyici için zaman içinde değişmeyen bir yardım sayfasına işaret eden bir helpLinkUri belirtilmelidir.
zh_hans: "helpLinkUri" 值用于在错误列表中出现该诊断时显示信息。应对每个分析器指定一个 helpLinkUri，用于指向一个不会随时间推移而更改的帮助页面。
zh_hant: 'helpLinkUri' 值可在錯誤清單中出現此診斷時用於顯示資訊。每個分析器都應指定指向說明頁面的 helpLinkUri，其不會隨時間變更。

# DiagnosticIdMustBeInSpecifiedFormatTitle
source: DiagnosticId for analyzers must be in specified format
de: DiagnosticId für das Analysetool muss im angegebenen Format vorliegen
es: El valor DiagnosticId para los analizadores debe estar en el formato especificado
fr: Le DiagnosticId pour les analyseurs doit être au format spécifié
it: Gli ID diagnostica per gli analizzatori devono essere nel formato specificato
ko: 분석기의 진단 ID는 지정된 형식이어야 함
pl: Wartość DiagnosticId dla analizatorów musi mieć określony format
ru: Диагностический идентификатор для анализаторов должен иметь заданный формат
tr: Çözümleyiciler için DiagnosticId belirtilen biçimde olmalıdır
zh_hans: 分析器的 DiagnosticId 必须为指定格式
zh_hant: 分析器的診斷識別碼必須為指定格式

# DiagnosticIdMustBeInSpecifiedFormatMessage
source: Diagnostic Id '{0}' belonging to category '{1}' is not in the required range and/or format '{2}' specified in the file '{3}'
de: Die Diagnose-ID "{0}" der Kategorie "{1}" liegt nicht im erforderlichen Bereich und/oder weist nicht das in der Datei "{3}" angegebene Format "{2}" auf.
es: El identificador de diagnóstico "{0}" que pertenece a la categoría "{1}" no se encuentra en el rango o el formato requerido "{2}" que se especifica en el archivo "{3}".
fr: L'ID de diagnostic '{0}' appartenant à la catégorie '{1}' n'est pas dans la plage et/ou au format '{2}' exigé spécifié dans le fichier '{3}'
it: L'ID diagnostica '{0}' appartenente alla categoria '{1}' non è incluso nell'intervallo e/o nel formato '{2}' richiesto specificato nel file '{3}'
ko: '{1}' 범주에 속하는 진단 ID '{0}'이(가) 필요한 범위 내에 있지 않고/않거나 '{3}' 파일에 지정된 '{2}' 형식이 아닙니다.
pl: Identyfikator diagnostyczny „{0}” należący do kategorii „{1}” nie znajduje się w żądanym zakresie i/lub nie ma formatu „{2}” określonego w pliku „{3}”
ru: Диагностический идентификатор "{0}", относящийся к категории "{1}", не соответствует требуемому диапазону и (или) формату "{2}", указанному в файле "{3}".
tr: '{1}' kategorisine ait '{0}' tanılama kimliği, '{3}' dosyasında belirtilen gerekli '{2}' aralığında ve/veya biçiminde değil
zh_hans: 属于类别“{1}”的诊断 Id“{0}”不符合文件“{3}”中指定的要求范围和/或格式“{2}”
zh_hant: 屬於類別 '{1}' 的診斷識別碼 '{0}' 不在必要範圍內，而且 (或) 不是檔案 '{3}' 中所指定的格式 '{2}'

# DiagnosticIdMustBeInSpecifiedFormatDescription
source: DiagnosticId for analyzers must be in specified format.
de: Die DiagnosticId für das Analysetool muss im angegebenen Format vorliegen.
es: El valor DiagnosticId para los analizadores debe estar en el formato especificado.
fr: Le DiagnosticId pour les analyseurs doit être au format spécifié.
it: Gli ID diagnostica per gli analizzatori devono essere nel formato specificato.
ko: 분석기에 대한 진단 ID는 지정된 형식이어야 합니다.
pl: Wartość DiagnosticId dla analizatorów musi mieć określony format.
ru: Диагностический идентификатор для анализаторов должен иметь заданный формат.
tr: Çözümleyiciler için DiagnosticId belirtilen biçimde olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为指定格式。
zh_hant: 分析器的診斷識別碼必須為指定格式。

# UseUniqueDiagnosticIdTitle
source: DiagnosticId must be unique across analyzers
de: DiagnosticId muss für jedes Analysetool eindeutig sein
es: El valor de DiagnosticId debe ser único en los analizadores
fr: Le DiagnosticId doit être unique sur l'ensemble des analyseurs
it: L'ID diagnostica deve essere univoco tra gli analizzatori
ko: 진단 ID는 분석기 간에 고유해야 함
pl: Wartość DiagnosticId musi być unikatowa między analizatorami
ru: Анализаторы должны иметь уникальный диагностический идентификатор
tr: DiagnosticId çözümleyiciler arasında benzersiz olmalıdır
zh_hans: 分析器的 DiagnosticId 必须唯一
zh_hant: 診斷識別碼必須是唯一的橫向分析器

# UseUniqueDiagnosticIdMessage
source: Diagnostic Id '{0}' is already used by analyzer '{1}'. Please use a different diagnostic ID.
de: Die Diagnose-ID "{0}" wird bereits vom Analysetool "{1}" verwendet. Verwenden Sie eine andere Diagnose-ID
es: El identificador de diagnóstico "{0}" ya se ha utilizado por el analizador "{1}". Utilice un identificador de diagnóstico diferente.
fr: L'ID de diagnostic '{0}' est déjà utilisé par l'analyseur '{1}'. Utilisez un ID de diagnostic différent.
it: L'ID diagnostica '{0}' è già usato dall'analizzatore '{1}'. Usarne uno diverso.
ko: 진단 ID '{0}'이(가) 분석기 '{1}'에서 이미 사용되고 있습니다. 다른 진단 ID를 사용하세요.
pl: Identyfikator diagnostyczny „{0}” jest już używany przez analizator „{1}”. Użyj innego identyfikatora diagnostycznego.
ru: Диагностический идентификатор "{0}" уже используется анализатором "{1}". Задайте другой идентификатор.
tr: '{0}' tanılama kimliği zaten '{1}' çözümleyicisi tarafından kullanılıyor. Lütfen farklı bir tanılama kimliği kullanın.
zh_hans: 诊断 Id“{0}”已被分析器“{1}”使用。请使用其他诊断 ID。
zh_hant: 分析器 '{1}' 已使用診斷識別碼 '{0}'。請使用其他診斷識別碼。
