Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# MissingDiagnosticAnalyzerAttributeDescription
source: Non-abstract sub-types of DiagnosticAnalyzer should be marked with DiagnosticAnalyzerAttribute(s). The argument to this attribute(s), if any, determine the supported languages for the analyzer. Analyzer types without this attribute will be ignored by the analysis engine.
de: Nicht abstrakte Untertypen von DiagnosticAnalyzer müssen mit "DiagnosticAnalyzerAttribute(s)" markiert werden. Das Argument für diese Attribute, falls vorhanden, legt die unterstützten Sprachen für die Analyse fest. Analysetypen ohne dieses Attribut werden von der Analyse-Engine ignoriert.
es: Los subtipos no abstractos de DiagnosticAnalyzer deben marcarse con el atributo DiagnosticAnalyzerAttribute. El argumento de estos atributos, si lo hay, determina los lenguajes admitidos para el analizador. El motor de análisis omite los tipos de analizador sin este atributo.
fr: Les sous-types non abstraits de DiagnosticAnalyzer doivent être marqués avec DiagnosticAnalyzerAttribute(s). L'argument de cet attribut (ou de ces attributs), le cas échéant, détermine les langages pris en charge pour l'analyseur. Les types de l'analyseur qui n'ont pas cet attribut sont ignorés par le moteur d'analyse.
it: I sottotipi non astratti di dell'analizzatore DiagnosticAnalyzer devono essere contrassegnati con uno o più elementi DiagnosticAnalyzerAttribute. L'eventuale argomento di questi attributi determina le lingue supportate per l'analizzatore. I tipi di analizzatore senza questo attributo verranno ignorati dal motore di analisi.
ko: DiagnosticAnalyzer의 비추상 하위 형식은 DiagnosticAnalyzerAttribute로 표시되어야 합니다. 이 특성에 대한 인수가 있는 경우 해당 인수가 분석기에 지원되는 언어를 결정합니다. 이 특성이 없는 분석기 형식은 분석 엔진에 의해 무시됩니다.
pl: Nieabstrakcyjne podtypy atrybutu DiagnosticAnalyzer powinny być oznakowane atrybutami DiagnosticAnalyzerAttribute. Argument dla tych atrybutów, o ile istnieje, określa obsługiwane języki analizatora. Typy analizatora bez tego atrybutu będą ignorowane przez aparat analizy.
ru: Неабстрактные подтипы DiagnosticAnalyzer нужно помечать с помощью атрибутов DiagnosticAnalyzerAttribute. Аргумент этих атрибутов (при его наличии) определяет поддерживаемые анализатором языки. Типы анализатора без такого атрибута будут проигнорированы модулем анализа.
tr: Soyut olmayan DiagnosticAnalyzer alt türleri DiagnosticAnalyzerAttribute(s) ile işaretlenmelidir. Bu özniteliklerin bağımsız değişkenleri, varsa, çözümleyici için desteklenen dilleri belirler. Bu özniteliğe sahip olmayan çözümleyici türleri çözümleme altyapısı tarafından yoksayılır.
zh_hans: DiagnosticAnalyzer 的非抽象子类型应使用 DiagnosticAnalyzerAttribute 标记。此特性的参数；如果有，则可确定分析器支持的语言。分析引擎将忽略未带此特性的分析器类型。
zh_hant: DiagnosticAnalyzer 的非抽象子類型應標記為 DiagnosticAnalyzerAttribute。此屬性的引數 (若有的話) 會決定分析器支援的語言。分析引擎將會略過不含此屬性的分析器類型。

# AddLanguageSupportToAnalyzerMessage
source: Diagnostic analyzer '{0}' may be able to support both C# and Visual Basic. Consider adding an argument to DiagnosticAnalyzerAttribute for '{1}' language support.
de: Das Diagnoseanalysetool "{0}" kann möglicherweise sowohl C# als auch Visual Basic unterstützen. Ziehen Sie in Betracht, DiagnosticAnalyzerAttribute ein Argument für die Sprachunterstützung "{1}" hinzuzufügen.
es: El analizador de diagnóstico “{0}” admite tanto C# como Visual Basic. Considere agregar un argumento a DiagnosticAnalyzerAttribute para la compatibilidad con el lenguaje de “{1}”.
fr: L'analyseur de diagnostic '{0}' peut prendre en charge C# et Visual Basic. Ajoutez un argument à DiagnosticAnalyzerAttribute pour la prise en charge du langage '{1}'.
it: L'analizzatore diagnostico '{0}' potrebbe riuscire a supportare sia C# che Visual Basic. Provare ad aggiungere a DiagnosticAnalyzerAttribute un argomento per includere il supporto per la lingua '{1}'.
ko: '{0}' 진단 분석기는 C# 및 Visual Basic을 모두 지원할 수 있습니다. '{1}' 언어 지원을 위해 DiagnosticAnalyzerAttribute에 대한 인수를 추가하세요.
pl: Analizator diagnostyczny „{0}” może mieć możliwość obsłużenia zarówno języka C#, jak i Visual Basic. Rozważ dodanie argumentu do atrybutu DiagnosticAnalyzerAttribute w celu obsługi języka „{1}”.
ru: Диагностический анализатор "{0}" может поддерживать как C#, так и Visual Basic. Рекомендуется добавить в DiagnosticAnalyzerAttribute аргумент для поддержки языка "{1}".
tr: Tanılama çözümleyicisi '{0}' hem C# hem de Visual Basic’i destekleyebilir. '{1}' dil desteği için DiagnosticAnalyzerAttribute’a bir bağımsız değişken eklemeyi düşünün.
zh_hans: 诊断分析器“{0}”可能可以支持 C# 和 Visual Basic。请考虑向“{1}”语言支持的 DiagnosticAnalyzerAttribute 添加一个参数。
zh_hant: 診斷分析器 '{0}' 可同時支援 C# 與 Visual Basic。請考慮將對 DiagnosticAnalyzerAttribute 新增一項引數，以取得 '{1}' 語言支援。

# AddLanguageSupportToAnalyzerTitle
source: Recommend adding language support to diagnostic analyzer
de: Empfehlung zum Hinzufügen von Sprachunterstützung zum Diagnoseanalysetool
es: Se recomienda agregar compatibilidad con lenguajes al analizador de diagnóstico
fr: Recommandez l'ajout à l'analyseur de diagnostic d'une prise en charge des langages
it: Consigliata l'aggiunta del supporto per la lingua all'analizzatore diagnostico
ko: 진단 분석기에 언어 지원을 추가하는 것이 좋음
pl: Zaleć dodanie obsługi języka do analizatora diagnostycznego
ru: Рекомендация добавить поддержку языка в диагностический анализатор
tr: Tanılama çözümleyicisine dil desteği eklemeniz önerilir
zh_hans: 建议向诊断分析器添加语言支持
zh_hant: 建議為診斷分析器新增語言支援

# AddLanguageSupportToAnalyzerDescription
source: Diagnostic analyzer is marked as supporting only one language, but the analyzer assembly doesn't seem to refer to any language specific CodeAnalysis assemblies, and so is likely to work for more than one language. Consider adding an additional language argument to DiagnosticAnalyzerAttribute.
de: Das Diagnoseanalysetool ist für die Unterstützung von nur einer Sprache markiert, die Analyseassembly verweist jedoch offenbar auf keine sprachspezifischen CodeAnalysis-Assemblys und funktioniert daher wahrscheinlich für mehrere Sprachen. Ziehen Sie in Betracht, DiagnosticAnalyzerAttribute ein weiteres Sprachargument hinzuzufügen.
es: El analizador de diagnóstico está marcado como compatible con un solo lenguaje, pero el ensamblado del analizador no parece hacer referencia a ningún ensamblado CodeAnalysis específico de un lenguaje, por lo que es posible que funcione para más de un lenguaje. Considere agregar un argumento de lenguaje adicional a DiagnosticAnalyzerAttribute.
fr: Il est indiqué que l'analyseur de diagnostic prend en charge un seul langage. Toutefois, l'assembly de l'analyseur ne semble pas faire référence à des assemblys CodeAnalysis spécifiques à un langage. Il est donc susceptible de fonctionner pour plusieurs langages. Ajoutez un argument de langage supplémentaire à DiagnosticAnalyzerAttribute.
it: L'analizzatore diagnostico è contrassegnato in modo da supportare una sola lingua, ma l'assembly dell'analizzatore non sembra fare riferimento ad alcun assembly CodeAnalysis specifico della lingua, di conseguenza è probabile che funziono per più lingue. Provare ad aggiungere a DiagnosticAnalyzerAttribute un argomento per una lingua aggiuntiva.
ko: 진단 분석기는 1개의 언어만 지원하는 것으로 표시되지만, 분석기 어셈블리가 언어 특정 CodeAnalysis 어셈블리를 참조하지 않는 것으로 보이므로 2개 이상의 언어로 작업할 가능성이 있습니다. DiagnosticAnalyzerAttribute에 언어 인수를 추가하세요.
pl: Analizator diagnostyczny jest oznaczony jako obsługujący tylko jeden język, ale zestaw analizatora raczej nie odwołuje się do żadnych zestawów CodeAnalysis specyficznych dla języka, a więc najprawdopodobniej będzie działał dla więcej niż jednego języka. Rozważ dodanie argumentu dodatkowego języka do atrybutu DiagnosticAnalyzerAttribute.
ru: Для диагностического анализатора указана поддержка только одного языка, однако сборка анализатора не ссылается на какие-либо языковые сборки CodeAnalysis, поэтому, вероятнее всего, она будет работать с несколькими языками. Рекомендуется добавить в DiagnosticAnalyzerAttribute аргумент дополнительного языка.
tr: Tanılama çözümleyicisi yalnızca bir dili destekliyor olarak işaretlenmiş ancak çözümleyici bütünleştirilmiş kodu herhangi bir dile özgü CodeAnalysis bütünleştirilmiş koduna başvuruyor gibi görünmediğinden birden çok dil için çalışması olasıdır. DiagnosticAnalyzerAttribute’a bir ek dil bağımsız değişkeni eklemeyi düşünün.
zh_hans: 诊断分析器标记为仅支持一种语言，但分析器程序集貌似未引用语言特定的任何 CodeAnalysis 程序集，因此可能会适用于多种语言。请考虑向 DiagnosticAnalyzerAttribute 添加其他语言参数。
zh_hant: 診斷分析器標記為只支援一種語言，但分析器組件似乎未參考任何語言專屬的 CodeAnalysis 組件，因此可能適用於多種語言。請考慮對 DiagnosticAnalyzerAttribute 新增其他語言引數。

# ApplyDiagnosticAnalyzerAttribute_1
source: Apply DiagnosticAnalyzer attribute for '{0}'.
de: Wenden Sie das DiagnosticAnalyzer-Attribut für "{0}" an.
es: Aplique el atributo DiagnosticAnalyzer para “{0}”.
fr: Appliquez l'attribut DiagnosticAnalyzer pour '{0}'.
it: Applicare l'attributo DiagnosticAnalyzer per '{0}'.
ko: '{0}'에 대한 DiagnosticAnalyzer 특성을 적용하세요.
pl: Zastosuj atrybut DiagnosticAnalyzer do elementu „{0}”.
ru: Примените атрибут DiagnosticAnalyzer для "{0}".
tr: '{0}' için DiagnosticAnalyzer özniteliğini uygulayın.
zh_hans: 为“{0}”应用 DiagnosticAnalyzer 特性。
zh_hant: 為 '{0}' 套用 DiagnosticAnalyzer 屬性。

# ApplyDiagnosticAnalyzerAttribute_2
source: Apply DiagnosticAnalyzer attribute for both '{0}' and '{1}'.
de: Wenden Sie das DiagnosticAnalyzer-Attribut sowohl für "{0}" als auch für "{1}" an.
es: Aplique el atributo DiagnosticAnalyzer para “{0}” y “{1}”.
fr: Appliquez l'attribut DiagnosticAnalyzer pour '{0}' et '{1}'.
it: Applicare l'attributo DiagnosticAnalyzer sia per '{0}' che per '{1}'.
ko: '{0}' 및 '{1}'에 대한 DiagnosticAnalyzer 특성을 적용하세요.
pl: Zastosuj atrybut DiagnosticAnalyzer zarówno do elementu „{0}”, jak i elementu „{1}”.
ru: Примените атрибут DiagnosticAnalyzer для "{0}" и "{1}".
tr: Hem '{0}' hem de '{1}' için DiagnosticAnalyzer özniteliğini uygulayın.
zh_hans: 为“{0}”和“{1}”应用 DiagnosticAnalyzer 特性。
zh_hant: 同時為 '{0}' 與 '{1}' 套用 DiagnosticAnalyzer 屬性。

# MissingSymbolKindArgumentToRegisterActionMessage
source: Specify at least one SymbolKind of interest when registering a symbol analyzer action
de: Geben Sie bei der Registrierung einer Symbolanalyseaktion mindestens einen relevanten SymbolKind-Wert an.
es: Especifique al menos un elemento SymbolKind de interés al registrar una acción del analizador de símbolos.
fr: Spécifiez au moins un SymbolKind d'intérêt au moment d'inscrire une action d'analyseur de symbole
it: Specificare almeno un elemento SymbolKind di interesse durante la registrazione di un'azione dell'analizzatore di simboli
ko: 기호 분석기 작업을 등록할 때 관심 있는 SymbolKind를 하나 이상 지정하세요.
pl: Określ co najmniej jeden interesujący argument SymbolKind podczas rejestrowania akcji analizatora symboli
ru: Укажите по меньшей мере один нужный SymbolKind при регистрации действия анализатора для символов.
tr: Bir sembol çözümleyicisi eylemi kaydedilirken en az bir ilgili SymbolKind belirtin
zh_hans: 注册符号分析器操作时，至少指定一个感兴趣的 SymbolKind
zh_hant: 註冊符號分析器動作時，請至少指定一個關注的 SymbolKind

# MissingSyntaxKindArgumentToRegisterActionMessage
source: Specify at least one SyntaxKind of interest when registering a syntax node analyzer action
de: Geben Sie bei der Registrierung einer Syntaxknotenanalyse-Aktion mindestens einen relevanten SymbolKind-Wert an.
es: Especifique al menos un elemento SyntaxKind de interés al registrar una acción del analizador de nodos de sintaxis.
fr: Spécifiez au moins un SyntaxKind d'intérêt au moment d'inscrire une action d'analyseur de nœud de syntaxe
it: Specificare almeno un elemento SyntaxKind di interesse durante la registrazione di un'azione dell'analizzatore di nodi della sintassi
ko: 구문 노드 분석기 작업을 등록할 때 관심 있는 SyntaxKind를 하나 이상 지정하세요.
pl: Określ co najmniej jeden interesujący argument SyntaxKind podczas rejestrowania akcji analizatora węzła składni
ru: Укажите по меньшей мере один нужный SyntaxKind при регистрации действия анализатора для синтаксических узлов.
tr: Bir söz dizimi düğümü çözümleyicisi eylemi kaydedilirken en az bir ilgili SyntaxKind belirtin
zh_hans: 注册语法节点分析器操作时，至少指定一个感兴趣的 SyntaxKind
zh_hant: 註冊語法節點分析器動作時，請至少指定一個關注的 SyntaxKind

# MissingOperationKindArgumentToRegisterActionMessage
source: Specify at least one OperationKind of interest when registering an operation analyzer action
de: Geben Sie bei der Registrierung einer Vorgangsanalyseaktion mindestens einen relevanten OperationKind-Wert an.
es: Especifique al menos un elemento OperationKind de interés al registrar una acción del analizador de operaciones.
fr: Spécifiez au moins un OperationKind d'intérêt au moment d'inscrire une action d'analyseur d'opération
it: Specificare almeno un elemento OperationKind di interesse durante la registrazione di un'azione dell'analizzatore di operazioni
ko: 작업 분석기 작업을 등록할 때 관심 있는 OperationKind를 하나 이상 지정하세요.
pl: Określ co najmniej jeden interesujący argument OperationKind podczas rejestrowania akcji analizatora operacji
ru: Укажите по меньшей мере один нужный OperationKind при регистрации действия анализатора для операций.
tr: Bir işlem çözümleyicisi eylemi kaydedilirken en az bir ilgili OperationKind belirtin
zh_hans: 注册操作分析器操作时，至少指定一个感兴趣的 OperationKind
zh_hant: 註冊作業分析器動作時，請至少指定一個關注的 OperationKind

# MissingKindArgumentToRegisterActionTitle
source: Missing kind argument when registering an analyzer action
de: Fehlendes kind-Argument beim Registrieren einer Analyseaktion
es: Falta un argumento de tipo al registrar una acción del analizador
fr: Argument kind manquant au moment d'inscrire une action d'analyseur
it: Durante la registrazione di un'azione dell'analizzatore manca un argomento di tipo
ko: 분석기 작업을 등록할 때 종류 인수가 없음
pl: Brak argumentu rodzaju podczas rejestrowania akcji analizatora
ru: Отсутствует аргумент типа при регистрации действия анализатора
tr: Bir çözümleyici eylemi kaydedilirken tür bağımsız değişkeni eksik
zh_hans: 注册分析器操作时缺少 kind 参数
zh_hant: 註冊分析器動作時，缺少 kind 引數

# MissingKindArgumentToRegisterActionDescription
source: You must specify at least one syntax, symbol or operation kind when registering a syntax, symbol, or operation analyzer action respectively. Otherwise, the registered action will never be invoked during analysis.
de: Sie müssen mindestens eine Variante für Syntax, Symbol oder Vorgang angeben, wenn Sie eine Syntax-, Symbol- oder Vorgangsanalyseaktion registrieren. Andernfalls wird die registrierte Aktion während der Analyse nicht aufgerufen.
es: Debe especificar al menos un tipo de sintaxis, símbolo u operación al registrar una acción del analizador de sintaxis, símbolos u operaciones respectivamente. De lo contrario, la acción registrada no se invocará nunca durante el análisis.
fr: Vous devez spécifier au moins un genre de syntaxe, de symbole ou d'opération au moment d'inscrire une action d'analyseur de syntaxe, de symbole ou d'opération. Sinon, l'action inscrite n'est jamais appelée durant l'analyse.
it: Quando si registra un'azione dell'analizzatore di sintassi, operazioni o simboli, è necessario specificare rispettivamente almeno un tipo di sintassi, operazione o simbolo. In caso contrario, l'azione registrata non verrà mai richiamata durante l'analisi.
ko: 구문, 기호 또는 작업 분석기 작업을 각각 등록할 때 하나 이상의 구문, 기호 또는 작업 종류를 지정해야 합니다. 지정하지 않으면 등록된 작업이 분석하는 동안 호출되지 않습니다.
pl: Musisz określić co najmniej jeden rodzaj składni, symbolu lub operacji podczas rejestracji odpowiednio akcji analizatora składni, symboli lub operacji. W przeciwnym razie zarejestrowana akcja nie zostanie nigdy wywołana podczas analizy.
ru: Вам следует указать по меньшей мере один вид синтаксиса, символа или операции при регистрации соответствующего действия анализатора. В противном случае зарегистрированное действие не будет вызвано во время анализа.
tr: Bir söz dizimi, sembol veya işlem çözümleyicisi eylemi eklerken en az bir söz dizimi, sembol veya işlem türü belirtmeniz gerekir. Aksi takdirde, kayıtlı eylem çözümleme sırasında hiçbir zaman çağrılmaz.
zh_hans: 分别注册语法、符号或操作分析器动作时，必须至少指定一种语法、符号或操作类型。否则，分析过程中将不会调用已注册的操作。
zh_hant: 註冊語法、符號或作業分析器動作時，必須個別指定至少一個語法、符號或作業種類。否則，分析期間絕不會叫用註冊的動作。

# NoSettingSpecifiedSymbolIsBannedInAnalyzersDescription
source: A project containing analyzers or source generators should specify the property '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'.
de: Ein Projekt, das Analysetools oder Quellgeneratoren enthält, muss die Eigenschaft "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>" angeben.
es: Un proyecto que contenga analizadores o generadores de origen debe especificar la propiedad "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>".
fr: Un projet contenant des analyseurs ou des générateurs sources doit spécifier la propriété ' <EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
it: Un progetto contenente analizzatori o generatori di origine deve specificare la proprietà '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'.
ko: 분석기 또는 원본 생성기를 포함하는 프로젝트는 속성 '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'을(를) 지정해야 합니다.
pl: Projekt zawierający analizatory lub generatory źródeł powinien określać właściwość „<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>”
ru: Проект, содержащий анализаторы или исходные генераторы, должен указывать свойство "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>"
tr: Çözümleyiciler veya kaynak oluşturucular içeren bir proje '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>' özelliğini belirtilmelidir.
zh_hans: 包含分析器或源生成器的项目应指定属性“<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>”。
zh_hant: 包含分析器或來源產生器的專案應該指定屬性 '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'。

# NoSettingSpecifiedSymbolIsBannedInAnalyzersMessage
source: '{0}': A project containing analyzers or source generators should specify the property '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
de: "{0}": Ein Projekt, das Analysetools oder Quellgeneratoren enthält, muss die Eigenschaft "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>" angeben
es: "{0}": un proyecto que contenga analizadores o generadores de origen debe especificar la propiedad "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>"
fr: '{0}' : un projet contenant des analyseurs ou des générateurs sources doit spécifier la propriété ' <EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
it: '{0}': un progetto contenente analizzatori o generatori di origine deve specificare la proprietà '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
ko: '{0}': 분석기 또는 원본 생성기를 포함하는 프로젝트는 속성 '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'을(를) 지정해야 합니다.
pl: „{0}”: projekt zawierający analizatory lub generatory źródeł powinien określać właściwość „<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>”
ru: "{0}": проект, содержащий анализаторы или исходные генераторы, должен указывать свойство "<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>"
tr: '{0}': Çözümleyiciler veya kaynak oluşturucular içeren bir proje '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>' özelliğini belirtilmelidir
zh_hans: “{0}”: 包含分析器或源生成器的项目应指定属性“<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>”
zh_hant: '{0}': 包含分析器或來源產生器的專案應該指定屬性 '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'

# NoSettingSpecifiedSymbolIsBannedInAnalyzersTitle
source: Specify analyzer banned API enforcement setting
de: Geben Sie die Erzwingungseinstellung für gesperrte API für das Analysetool an
es: Especificar la configuración de la aplicación de la API vetada por el analizador
fr: Spécifier le paramètre d’application des API interdites par l’analyseur
it: Specificare l'impostazione di imposizione dell'API esclusa dell'analizzatore
ko: 분석기 금지 API 적용 설정 지정
pl: Określ ustawienie wymuszania zabronionego interfejsu API analizatora
ru: Укажите параметр принудительного применения API, запрещенного для анализатора
tr: Çözümleyici yasaklı API zorlama ayarını belirtin
zh_hans: 指定分析器禁止的 API 强制设置
zh_hant: 指定分析器禁止的 API 強制設定

# PreferIsKindDescription
source: Prefer 'syntax.IsKind(kind)' to 'syntax.Kind() == kind' when checking syntax kinds. Code using 'IsKind' is slightly more efficient at runtime, so consistent use of this form where applicable helps improve performance in complex analysis scenarios.
de: Bei der Überprüfung von Syntaxarten ist "syntax.IsKind(kind)" der Syntax "syntax.Kind() == kind" vorzuziehen. Der Code mit "IsKind" ist zur Laufzeit etwas effizienter, daher trägt die konsistente Verwendung dieser Form in komplexen Analyseszenarios zur Verbesserung der Leistung bei.
es: Use preferentemente "syntax.IsKind(kind)" antes que "syntax.Kind() == kind" al comprobar las variantes de sintaxis. El código que usa "IsKind" es algo más eficaz en tiempo de ejecución, por lo que el uso coherente de esta forma, cuando proceda, ayuda a mejorar el rendimiento en los escenarios de análisis complejos.
fr: Utilisez 'syntax.IsKind(kind)' au lieu de 'syntax.Kind() == kind' pour la vérification des genres de syntaxe. Dans la mesure où le code utilisant 'IsKind' est légèrement plus efficace au moment de l'exécution, l'utilisation cohérente de ce formulaire permet d'améliorer les performances dans les scénarios d'analyse complexes.
it: Preferire 'syntax.IsKind(kind)' a 'syntax.Kind() == kind' durante la verifica dei tipi di sintassi. Il codice che usa 'IsKind' è leggermente più efficiente in fase di runtime, di conseguenza l'uso coerente di questo formato dove possibile contribuisce a migliorare le prestazioni in scenari di analisi complessi.
ko: 구문 종류를 확인할 때 'syntax.IsKind(kind)' ~ 'syntax.Kind() == kind'를 선호합니다. 'IsKind'를 사용하는 코드는 런타임 시 약간 더 효율적이므로 해당하는 경우 이 형식을 일관되게 사용하면 복잡한 분석 시나리오에서 성능을 향상하는 데 도움이 됩니다.
pl: Preferuj formę „syntax.IsKind(kind)” zamiast „syntax.Kind() == kind” podczas sprawdzania rodzajów składni. Kod używający elementu „IsKind” jest nieco bardziej wydajny w środowisku uruchomieniowym, więc konsekwentne używanie tej formy w stosownych przypadkach pomaga zwiększyć wydajność w złożonych scenariuszach analizy.
ru: При проверке видов синтаксиса предпочтение отдается "syntax.IsKind(kind)" вместо "syntax.Kind() == kind". Код с использованием "IsKind" имеет чуть большее быстродействие во время выполнения, поэтому регулярное применение этого формата где возможно помогает повысить производительность в сложных сценариях анализа.
tr: Söz dizimi çeşitleri denetlenirken 'syntax.IsKind(kind)' türünü 'syntax.Kind() == kind' türüne tercih edin. 'IsKind' kullanan kod, çalışma zamanında biraz daha etkilidir, bu nedenle bu formu kullanmak, karmaşık analiz senaryolarında performansın artırılmasına yardımcı olur.
zh_hans: 检查语法类型时，首选 "syntax.IsKind(kind)" 而不是 "syntax.Kind() == kind"。使用 "IsKind" 的代码在运行时更加高效一些，因此在适用时始终使用此形式有助于提高复杂分析方案中的性能。
zh_hant: 檢查語法類型時，相較於 'syntax.Kind() == kind'，更建議使用 'syntax.IsKind(kind)'。使用 'IsKind' 的程式碼，在執行階段的效率稍高。因此在適用情況下，一致使用此格式有助改進複雜分析案例的效能。

# PreferIsKindFix
source: Use 'IsKind' instead of 'Kind'
de: "IsKind" anstelle von "Kind" verwenden
es: Usar "IsKind" en lugar de "Kind"
fr: Utilisez 'IsKind' au lieu de 'Kind'
it: Usare 'IsKind' invece di 'Kind'
ko: 'Kind' 대신 'IsKind' 사용
pl: Użyj elementu „IsKind” zamiast elementu „Kind”
ru: Использование "IsKind" вместо "Kind"
tr: 'Kind' yerine 'IsKind' kullanın
zh_hans: 使用 "IsKind" 而不是 "Kind"
zh_hant: 使用 'IsKind' 代替 'Kind'
