Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# StartActionWithNoRegisteredActionsMessage
source: '{0}' does not register any analyzer actions. Consider moving actions registered in '{1}' that depend on this start action to '{0}'.
de: "{0}" registriert keine Analyseaktionen. Ziehen Sie in Betracht, in "{1}" registrierte Aktionen, die von dieser Startaktion abhängen, nach "{0}" zu verschieben.
es: “{0}” no registra ninguna acción del analizador. Considere mover las acciones registradas en “{1}” dependientes de esta acción de inicio a “{0}”.
fr: '{0}' n'inscrit aucune action d'analyseur. Déplacez les actions inscrites dans '{1}' et qui dépendent de cette action de démarrage vers '{0}'.
it: '{0}' non registra alcuna azione dell'analizzatore. Provare a spostare in '{0}' le azioni registrate in '{1}' che dipendono da questa azione di avvio.
ko: '{0}'은(는) 분석기 작업을 등록하지 않습니다. 이 시작 작업에 종속된 '{1}'에 등록된 작업을 '{0}'(으)로 이동하세요.
pl: Element „{0}” nie rejestruje żadnych akcji analizatora. Rozważ przeniesienie akcji zarejestrowanych w elemencie „{1}”, które zależą od tej akcji uruchamiania, do „{0}”.
ru: "{0}" не регистрирует никакие действия анализатора. Рекомендуется переместить действия, зарегистрированные в "{1}", которые зависят от этого начального действия, в "{0}".
tr: '{0}' herhangi bir çözümleyici eylemini kaydetmez. Bu başlangıç eylemine bağımlı olan '{1}' içinde kayıtlı eylemleri '{0}' içine taşımayı düşünün.
zh_hans: “{0}”没有注册任何分析器操作。请考虑将“{1}”中注册的依赖于此启动操作的操作移动到“{0}”。
zh_hant: '{0}' 並未註冊任何分析器動作。請考慮將註冊於 '{1}' 中且與此起始動作相依的動作，移至 '{0}'。

# StartActionWithNoRegisteredActionsTitle
source: Start action has no registered actions
de: Für die Startaktion wurden keine Aktionen registriert
es: La acción de inicio no tiene ninguna acción registrada
fr: L'action de démarrage n'a aucune action inscrite
it: Per l'azione di avvio non esistono azioni registrate
ko: 시작 작업에 등록된 작업이 없음
pl: Akcja uruchamiania nie ma zarejestrowanych akcji
ru: Начальное действие не содержит зарегистрированные действия
tr: Başlangıç eyleminin kayıtlı eylemi yok
zh_hans: 启动操作未注册有任何操作
zh_hant: 起始動作沒有任何註冊的動作

# StartActionWithOnlyEndActionMessage
source: '{0}' does not register any analyzer actions, except for a '{1}'. Consider replacing this start/end action pair with a '{2}' or moving actions registered in '{3}' that depend on this start action to '{0}'.
de: "{0}" registriert keine Analyseaktionen mit Ausnahme von "{1}". Ziehen Sie in Betracht, dieses Paar aus Start-/Endaktion durch "{2}" zu ersetzen oder die in "{3}" registrierten Aktionen, die von dieser Startaktion abhängen, nach "{0}" zu verschieben.
es: “{0}” no registra ninguna acción del analizador, excepto “{1}”. Considere reemplazar este par de acciones de inicio/final por un objeto “{2}” o mover las acciones registradas en “{3}” que dependen de esta acción de inicio a “{0}”.
fr: '{0}' n'inscrit aucune action d'analyseur, à l'exception de '{1}'. Remplacez cette paire d'actions de début/fin par '{2}', ou déplacez les actions inscrites dans '{3}' et qui dépendent de cette action de démarrage vers '{0}'.
it: '{0}' non registra alcuna azione dell'analizzatore, ad eccezione di '{1}'. Provare a sostituire questa coppia di azioni di avvio/fine con un elemento '{2}' o a spostare in '{0}' le azioni registrate in '{3}' che dipendono da questa azione di avvio.
ko: '{0}'은(는) '{1}'을(를) 제외하고 분석기 작업을 등록하지 않았습니다. 이 시작/종료 작업 쌍을 '{2}'(으)로 바꾸거나 이 시작 작업에 종속된 '{3}'에 등록된 작업을 '{0}'(으)로 이동하세요.
pl: Element „{0}” nie rejestruje żadnych akcji analizatora, chyba że dla elementu „{1}”. Rozważ zastąpienie tej pary akcji początek/koniec przez „{2}” lub przeniesienie akcji zarejestrowanych w elemencie „{3}”, które zależą od tej akcji uruchamiania, do elementu „{0}”.
ru: "{0}" не регистрирует никакие действия анализатора, кроме "{1}". Рекомендуется заменить это начальное/конечное действие на "{2}" или переместить действия, зарегистрированные в "{3}", которые зависят от этого начального действия, в "{0}".
tr: '{0}' bir '{1}' hariç herhangi bir çözümleyici eylemini kaydetmez. Bu başlangıç/bitiş eylem çiftini '{2}' ile eşlemeyi veya bu başlangıç eylemine bağımlı olan '{3}' içinde kayıtlı eylemleri '{0}' içine taşımayı düşünün.
zh_hans: “{0}”没有注册除“{1}”以外的任何分析器操作。请考虑将此启动/结束操作对替换为“{2}”，或将“{3}”中注册的依赖于此启动操作的操作移动到“{0}”。
zh_hant: 除了 '{1}' 以外，'{0}' 並未註冊任何分析器動作。請考慮以 '{2}' 取代此成對的起始/結束動作，或將註冊於 '{3}' 中且與此起始動作相依的動作，移至 '{0}'。

# StatefulAnalyzerRegisterActionsDescription
source: An analyzer start action enables performing stateful analysis over a given code unit, such as a code block, compilation, etc. Careful design is necessary to achieve efficient analyzer execution without memory leaks. Use the following guidelines for writing such analyzers: 1. Define a new scope for the registered start action, possibly with a private nested type for analyzing each code unit. 2. If required, define and initialize state in the start action. 3. Register at least one non-end action that refers to this state in the start action. If no such action is necessary, consider replacing the start action with a non-start action. For example, a CodeBlockStartAction with no registered actions or only a registered CodeBlockEndAction should be replaced with a CodeBlockAction. 4. If required, register an end action to report diagnostics based on the final state.
de: Eine Startaktion für das Analysetool ermöglicht die Durchführung einer zustandsbehafteten Analyse über eine bestimmte Codeeinheit wie einen Codeblock, eine Kompilierung etc. Ein sorgfältiges Design ist erforderlich, um eine effiziente Ausführung des Analysetools ohne Arbeitsspeicherverluste zu erzielen. Beachten Sie beim Schreiben solcher Analysen die folgenden Richtlinien: 1. Definieren Sie einen neuen Geltungsbereich für die registrierte Startaktion, möglicherweise mit einem privaten geschachtelten Typ für die Analyse der einzelnen Codeeinheiten. 2. Definieren und initialisieren Sie bei Bedarf den Zustand in der Startaktion. 3. Registrieren Sie mindestens eine Nicht-Endaktion, die auf diesen Zustand in der Startaktion verweist. Falls keine solche Aktion erforderlich ist, ziehen Sie in Betracht, die Startaktion durch eine Nicht-Startaktion zu ersetzen. Beispielsweise sollte eine CodeBlockStartAction ohne registrierte Aktionen oder mit nur einer registrierten CodeBlockEndAction durch eine CodeBlockAction ersetzt werden. 4. Registrieren Sie bei Bedarf eine Endaktion, um die Diagnose basierend auf dem Endzustand zu melden.
es: Una acción de inicio del analizador permite realizar un análisis con estado de una unidad de código dada, como un bloque de código, una compilación, etc. Realice un diseño minucioso para lograr una ejecución eficiente del analizador sin fugas de memoria. Siga las instrucciones a continuación para escribir este tipo de analizadores: 1. Defina un nuevo ámbito para la acción de inicio registrada, posiblemente con un tipo anidado privado para analizar cada unidad de código. 2. Si se requiere, defina e inicialice el estado en la acción de inicio. 3. Registre al menos una acción no final que haga referencia a este estado en la acción de inicio. Si no es necesaria una acción de este tipo, considere reemplazar la acción de inicio por otra que no lo sea. Por ejemplo, una acción CodeBlockStartAction sin acciones registradas o solo una acción CodeBlockEndAction registrada deberían reemplazarse por una acción CodeBlockAction. 4. Si se requiere, registre una acción de final para notificar los diagnósticos en función del estado final.
fr: Une action de démarrage de l'analyseur permet d'effectuer une analyse avec état sur une unité de code donnée, par exemple un bloc de code, une compilation, etc. Vous devez effectuer un design soigné pour obtenir une exécution efficace de l'analyseur, sans fuites de mémoire. Utilisez les recommandations suivantes pour écrire des analyseurs de ce type : 1. Définissez une nouvelle portée pour l'action de démarrage inscrite, éventuellement avec un type imbriqué privé pour analyser chaque unité de code. 2. Si nécessaire, définissez et initialisez l'état dans l'action de démarrage. 3. Inscrivez au moins une action qui n'est pas une action de fin et qui fait référence à cet état dans l'action de démarrage. Si aucune action de ce type n'est nécessaire, remplacez l'action de démarrage par une action qui n'est pas une action de fin. Par exemple, un CodeBlockStartAction sans action inscrite ou uniquement un CodeBlockEndAction inscrit doit être remplacé par CodeBlockAction. 4. Si nécessaire, inscrivez une action de fin de pour créer un rapport de diagnostics en fonction de l'état final.
it: Un'azione di avvio dell'analizzatore consente di eseguire un'analisi con stato su una data unità di codice, ad esempio un blocco di codice, una compilazione e così via. Per rendere più efficiente l'esecuzione degli analizzatori ed evitare perdite di memoria, è necessaria un'attenta progettazione. Per scrivere tali analizzatori, attenersi alle linea guida seguenti: 1. Definire un nuovo ambito per l'azione di avvio registrata, possibilmente con un tipo nidificato privato per l'analisi delle singole unità di codice. 2. Se necessario, definire e inizializzare lo stato nell'azione di avvio. 3. Registrare almeno un'azione non di fine che fa riferimento a questo stato nell'azione di avvio. Se una tale azione non è necessaria, provare a sostituire l'azione di avvio con un'azione non di avvio. Ad esempio un elemento CodeBlockStartAction senza azioni registrate o un solo elemento CodeBlockEndAction registrato deve essere sostituito da un elemento CodeBlockAction. 4. Se necessario, registrare un'azione di fine per restituire i dati di diagnostica in base allo stato finale.
ko: 분석기 시작 작업으로 코드 블록, 컴파일 등의 특정 코드 단위에서 상태 저장 분석을 수행할 수 있습니다. 메모리 누수 없이 분석기를 효율적으로 실행하려면 신중한 설계가 필요합니다. 이러한 분석기를 쓰려면 다음 지침을 따르세요. 1. 등록된 시작 작업에 대해 각 코드 단위를 분석하기 위한 프라이빗 중첩 형식이 있는 새 범위를 정의합니다. 2. 필요한 경우 시작 작업에서 상태를 정의하고 초기화합니다. 3. 시작 작업에서 이 상태를 참조하는 비종료 작업을 하나 이상 등록합니다. 이러한 작업이 필요하지 않은 경우 시작 작업을 비종료 작업으로 바꾸는 것이 좋습니다. 예를 들어 등록된 작업이 없는 CodeBlockStartAction 또는 등록된 CodeBlockEndAction만 CodeBlockAction으로 바꿀 수 있습니다. 4. 필요한 경우 종료 작업을 등록하여 최종 상태를 기준으로 진단을 보고합니다.
pl: Akcja uruchamiania analizatora umożliwia wykonanie analizy stanowej dla danej jednostki kodu, takiej jak blok kodu, kompilacja itd. Dokładne projektowanie jest niezbędne do uzyskania skutecznego wykonania analizatora bez przecieków pamięci. Podczas pisania takich analizatorów skorzystaj z poniższych wskazówek: 1. Określ nowy zakres dla zarejestrowanej akcji uruchamiania, być może za pomocą prywatnego typu zagnieżdżonego, do analizowania każdej jednostki kodu. 2. W razie potrzeby zdefiniuj i zainicjuj stan w akcji uruchamiania. 3. Zarejestruj co najmniej jedną akcję niekończącą, która odnosi się do tego stanu w akcji uruchamiania. Jeśli żadna taka akcja nie jest niezbędna, rozważ zastąpienie akcji uruchamiania przez akcję inną niż uruchamianie. Na przykład akcja CodeBlockStartAction bez zarejestrowanych akcji lub tylko zarejestrowana akcja CodeBlockEndAction powinny być zastąpione przez akcję CodeBlockAction. 4. W razie potrzeby zarejestruj akcję kończącą, aby zgłaszać diagnostykę na podstawie stanu końcowego.
ru: Начальное действие анализатора позволяет выполнить анализ с отслеживанием состояния для заданного модуля кода, например блока кода, компиляции и т. д. Чтобы обеспечить эффективное выполнение анализатора без утечек памяти, нужно тщательно все спроектировать. При создании подобных анализаторов используйте следующие рекомендации: 1. Определите новую область для зарегистрированного начального действия, возможно, с закрытым вложенным типом, для анализа каждого из модулей кода. 2. При необходимости определите и инициализируйте состояние в начальном действии. 3. Зарегистрируйте по меньшей мере одно неконечное действие, ссылающееся на это состояние в начальном действии. Если подобное действие не требуется, рекомендуется заменить начальное действие неначальным. Например, CodeBlockStartAction без зарегистрированных действий или с единственным зарегистрированным действием CodeBlockEndAction следует заменить на CodeBlockAction. 4. При необходимости зарегистрируйте конечное действие, чтобы предоставлять диагностические сведения на основе конечного состояния.
tr: Bir çözümleyici başlatma eylemi bir kod bloğu, derleme vb. belirli kod birimi üzerinde durum bilgisi olan çözümleme gerçekleştirmeye olanak sağlar. Bellek sızıntısı olmadan verimli çözümleyici yürütmesi sağlamak için dikkatli tasarım gereklidir. Bu tür çözümleyiciler yazmak için aşağıdaki kılavuzu kullanın: 1. Muhtemelen her kod birimini çözümlemek için özel bir iç içe geçmiş tür ile kayıtlı başlatma eylemi için yeni bir kapsam tanımlayın. 2. Gerekirse, durumu başlangıç eyleminde tanımlayın ve başlatın. 3. Başlangıç eyleminde bu duruma başvuran en az bir bitiş eylemi olmayan eylem kaydedin. Böyle bir eyleme gerek yoksa, başlangıç eylemini başlangıç eylemi olmayan bir eylemle değiştirmeyi düşünün. Örneğin, kayıtlı eylemi olmayan veya yalnızca kayıtlı bir CodeBlockEndAction’ı olan CodeBlockStartAction, CodeBlockAction ile değiştirilmelidir. 4. Gerekirse, son durumu temel alan tanılamaları raporlamak için bir bitiş eylemi kaydedin.
zh_hans: 分析器启动操作可以对给定的代码单元(如代码块、编译等)执行有状态分析。细致的设计是实现分析器高效执行和保证内存不泄露的必要条件。使用以下准则编写此类分析器: 1.为已注册的启动操作定义新的作用域，可能需要一个私有嵌套类型用于分析每个代码单元。 2.必要时，请在启动操作中定义和初始化状态。 3.至少在启动操作中注册一个引用此状态的非结束操作。如果不需要此类操作，请考虑将启动操作替换为非启动操作。例如，未注册有操作或仅注册了一个 CodeBlockEndAction 的 CodeBlockStartAction 应替换为 CodeBlockAction。 4.必要时，请注册一个结束操作，根据最终状态对诊断进行报告。
zh_hant: 分析器起始動作會對指定的程式碼單位 (例如程式碼區塊、編譯等) 執行具狀態的分析。請仔細設計，以便有效執行分析器而不流失記憶體。使用下列方針撰寫這類分析器: 1.為註冊的起始動作定義新範圍，可能會有私用巢狀類別以分析每個程式碼單位。 2.如有必要，請定義並初始化起始動作中的狀態。 3.至少註冊一個非結束動作，其參考起始動作中的這個狀態。如果不需要這類動作，請考慮以非起始動作取代起始動作。例如，CodeBlockStartAction 沒有任何註冊動作或只有一個註冊的 CodeBlockEndAction 時，應以 CodeBlockAction 取代。 4.如有必要，請註冊結束動作，以根據最終狀態回報診斷。

# UpdateDiagnosticIdInAnalyzerReleaseDescription
source: Ensure up-to-date entry for analyzer diagnostic IDs are added to analyzer release.
de: Stellen Sie sicher, dass dem Analysetoolrelease ein aktueller Eintrag für Analysetooldiagnose-IDs hinzugefügt wird.
es: Asegúrese de que se agregue una entrada actualizada de los identificadores de diagnóstico del analizador a la versión del analizador.
fr: Vérifiez que les entrées actualisées des ID de diagnostic d'analyseur sont bien ajoutées à la version d'analyseur.
it: Assicurarsi che la voce aggiornata per gli ID diagnostica dell'analizzatore vengano aggiunti alla versione dell'analizzatore.
ko: 분석기 진단 ID의 최신 항목이 분석기 릴리스에 추가되었는지 확인합니다.
pl: Upewnij się, że do wydania analizatora dodano aktualny wpis identyfikatorów diagnostycznych analizatora.
ru: Убедитесь, что в выпуск анализатора добавлена обновленная запись для идентификаторов диагностики анализатора.
tr: Çözümleyici tanılama kimlikleri için güncel girdilerin çözümleyici yayınına eklendiğinden emin olun.
zh_hans: 确保将分析器诊断 ID 的最新条目添加到分析器版本中。
zh_hant: 請確認已將分析器診斷識別碼的最新項目新增至分析器版本。

# UpdateDiagnosticIdInAnalyzerReleaseMessage
source: Rule '{0}' has a changed 'Category' or 'Severity' from the last release. Either revert the update(s) in source or add a new up-to-date entry to unshipped release file.
de: Die Regel "{0}" weist gegenüber dem letzten Release eine Änderung an "Kategorie" oder "Schweregrad" auf. Setzen Sie entweder die Updates in der Quelle zurück, oder fügen Sie der nicht veröffentlichten Releasedatei einen neuen aktuellen Eintrag hinzu.
es: La regla "{0}" tiene el valor "Categoría" o "Gravedad" cambiado respecto a la última versión. Revierta las actualizaciones en el origen o agregue una entrada nueva actualizada al archivo de versión no incluido.
fr: La règle '{0}' a changé de 'Catégorie' ou de 'Gravité' depuis la dernière version. Restaurez la ou les mises à jour appropriées dans la source, ou ajoutez une nouvelle entrée à jour au fichier de version non fourni.
it: L'attributo 'Categoria' o 'Gravità' della regola '{0}' è stato modificato rispetto all'ultima versione. Ripristinare gli aggiornamenti nell'origine oppure aggiungere una nuova voce aggiornata al file di versione non distribuito.
ko: '{0}' 규칙에는 마지막 릴리스에서 변경된 '범주' 또는 '심각도'가 있습니다. 소스에서 업데이트를 되돌리거나 제공되지 않은 릴리스 파일에 새 최신 항목을 추가합니다.
pl: W regule „{0}” zmieniono wartość „Kategoria” lub „Ważność” w stosunku do ostatniego wydania. Przywróć aktualizacje w źródle lub dodaj nowy, aktualny wpis do niedostarczonego pliku wydania.
ru: Категория или уровень серьезности для правила "{0}" были изменены с последнего выпуска. Отмените изменения в источнике или добавьте обновленную запись в неотправленный файл выпуска.
tr: '{0}' kuralı, son yayından sonra değiştirilen bir 'Kategori' veya 'Önem Derecesi' içeriyor. Kaynaktaki güncelleştirmeleri geri alın veya gönderilmeyen yayın dosyasına yeni bir güncel girdi ekleyin.
zh_hans: 与上一个版本相比，规则“{0}”更改了一个“类别”或“严重级别”。请还原源中的更新或将新的最新项添加到 未提供的版本文件。
zh_hant: 規則 '{0}' 已變更上一個版本中的「分類」或「嚴重性」。請還原來源中的更新，或將最新項目新增至未送出的版本檔案。

# UpdateDiagnosticIdInAnalyzerReleaseTitle
source: Ensure up-to-date entry for analyzer diagnostic IDs are added to analyzer release
de: Stellen Sie sicher, dass dem Analysetoolrelease ein aktueller Eintrag für Analysetooldiagnose-IDs hinzugefügt wird.
es: Asegúrese de que se agregue una entrada actualizada de los identificadores de diagnóstico del analizador a la versión del analizador
fr: Vérifier que les entrées actualisées des ID de diagnostic d'analyseur sont bien ajoutées à la version d'analyseur
it: Assicurarsi che la voce aggiornata per gli ID diagnostica dell'analizzatore vengano aggiunti alla versione dell'analizzatore
ko: 분석기 진단 ID의 최신 항목이 분석기 릴리스에 추가되었는지 확인
pl: Upewnij się, że do wydania analizatora dodano aktualny wpis identyfikatorów diagnostyki analizatora
ru: Убедитесь, что в выпуск анализатора добавлена последняя версия записи для идентификаторов диагностики анализатора.
tr: Çözümleyici tanılama kimlikleri için çözümleyici yayınına güncel girişlerin eklendiğinden emin olun
zh_hans: 确保将分析器诊断 ID 的最新条目添加到分析器版本中
zh_hant: 請確認已將分析器診斷識別碼的最新項目，新增至分析器版本

# UpdateEntryForDiagnosticIdInAnalyzerReleaseCodeFixTitle
source: Update rule entry in unshipped release file
de: Regeleintrag in nicht veröffentlichter Releasedatei aktualisieren
es: Actualizar la entrada de la regla en un archivo de versión no incluido
fr: Mettre à jour une entrée de règle dans le fichier de version non fourni
it: Aggiornare la voce della regola nel file di versione non distribuito
ko: 제공되지 않은 릴리스 파일의 규칙 항목 업데이트
pl: Aktualizuj wpis reguły w niedostarczonym pliku wydania
ru: Обновить запись правила в неотправленном файле выпуска
tr: Gönderilmeyen yayın dosyasındaki kural girdisini güncelleştir
zh_hans: 在未提供的版本文件中更新规则项
zh_hant: 更新未送出版本檔案中的規則項目

# UseLocalizableStringsInDescriptorMessage
source: Consider providing localizable arguments of type '{0}' to diagnostic descriptor constructor to ensure the descriptor is localizable
de: Ziehen Sie die Bereitstellung lokalisierbarer Argumente vom Typ "{0}" für den Konstruktor des Diagnosedeskriptors in Betracht, um sicherzustellen, dass der Deskriptor lokalisierbar ist.
es: Considere proporcionar argumentos localizables de tipo "{0}" al constructor descriptor de diagnósticos para asegurarse de que el descriptor es localizable.
fr: Fournissez des arguments localisables de type '{0}' au constructeur de descripteur de diagnostic pour vérifier que le descripteur est localisable
it: Provare a fornire argomenti localizzabili di tipo '{0}' al costruttore del descrittore di diagnostica per garantire che sia localizzabile
ko: '{0}' 형식의 지역화 가능 인수를 진단 설명자 생성자에 제공하여 설명자가 지역화 가능하도록 하는 것이 좋습니다.
pl: Rozważ udostępnienie umożliwiających lokalizację argumentów typu „{0}” dla konstruktora deskryptora diagnostycznego, aby zapewnić możliwość lokalizacji deskryptora
ru: Рекомендуется предоставить конструктору дескриптора диагностики локализуемые аргументы типа "{0}", чтобы дескриптор можно было локализовать.
tr: Tanımlayıcının yerelleştirilebilir olduğundan emin olmak için tanılama tanımlayıcısına '{0}' türünde yerelleştirilebilir bağımsız değişkenler sağlamayı düşünün
zh_hans: 请考虑为诊断描述符构造函数提供类型“{0}”的可本地化参数，以确保描述符可本地化
zh_hant: 請考慮將型別為 '{0}' 的可當地語系化引數，提供給診斷描述元建構函式，以確保該描述元可當地語系化

# UseLocalizableStringsInDescriptorTitle
source: Provide localizable arguments to diagnostic descriptor constructor
de: Lokalisierbare Argumente für Konstruktor des Diagnosedeskriptors angeben
es: Proporcione argumentos localizables al constructor descriptor de diagnósticos
fr: Fournissez des arguments localisables au constructeur de descripteur de diagnostic
it: Fornire argomenti localizzabili al costruttore del descrittore di diagnostica
ko: 지역화 가능 인수를 진단 설명자 생성자에 제공
pl: Zapewnij umożliwiające lokalizację argumenty dla konstruktora deskryptora diagnostycznego
ru: Предоставление конструктору дескриптора диагностики локализуемых аргументов
tr: Tanılama tanımlayıcısı oluşturucusuna yerelleştirilebilir bağımsız değişkenler sağlayın
zh_hans: 为诊断描述符构造函数提供可本地化的参数
zh_hant: 為診斷描述元建構函式提供可當地語系化的引數
