Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# AddCompilationEndCustomTagDescription
source: 'DiagnosticDescriptor' assigned to field is used to report a compilation end diagnostic, but the 'DiagnosticDescriptor' constructor used to initialize it does not pass in the required custom tag "CompilationEnd". See documentation for 'WellKnownDiagnosticTags.CompilationEnd' for details.
de: "DiagnosticDescriptor", der dem Feld zugewiesen ist, wird verwendet, um eine Kompilierungsendediagnose zu melden, aber der zum Initialisieren verwendete DiagnosticDescriptor-Konstruktor übergibt nicht das erforderliche benutzerdefinierte Tag "CompilationEnd". Weitere Informationen finden Sie in der Dokumentation zu "WellKnownDiagnosticTags.CompilationEnd".
es: El "DiagnosticDescriptor" asignado al campo se utiliza para informar de un diagnóstico de fin de compilación, pero el constructor "DiagnosticDescriptor" utilizado para inicializarlo no pasa la etiqueta personalizada requerida "CompilationEnd". Consulte la documentación de "WellKnownDiagnosticTags.CompilationEnd" para obtener más información.
fr: 'DiagnosticDescriptor' affecté au champ est utilisé pour signaler un diagnostic de fin de compilation, mais le constructeur 'DiagnosticDescriptor' utilisé pour l’initialiser ne passe pas la balise personnalisée requise « CompilationEnd ». Pour plus d’informations, consultez la documentation de « WellKnownDiagnosticTags.CompilationEnd ».
it: 'DiagnosticDescriptor' assegnato al campo viene usato per segnalare una diagnostica di fine compilazione, ma il costruttore 'DiagnosticDescriptor' utilizzato per inizializzarlo non passa il tag personalizzato richiesto "CompilationEnd". Per informazioni dettagliate, vedere la documentazione di 'WellKnownDiagnosticTags.CompilationEnd'.
ko: 필드에 할당된 'DiagnosticDescriptor'는 컴파일 종료 진단을 보고하는 데 사용되지만 이를 초기화하는 데 사용되는 'DiagnosticDescriptor' 생성자는 필요한 사용자 지정 태그 "CompilationEnd"를 전달하지 않습니다. 자세한 내용은 'WellKnownDiagnosticTags.CompilationEnd'에 대한 설명서를 참조하세요.
pl: Element „DiagnosticDescriptor” przypisany do pola jest używany do raportowania diagnostyki zakończenia kompilacji, ale konstruktor „DiagnosticDescriptor” użyty do zainicjowania go nie przekazuje wymaganego niestandardowego tagu „CompilationEnd”. Zobacz dokumentację elementu „WellKnownDiagnosticTags.CompilationEnd”, aby uzyskać szczegółowe informacje.
ru: Дескриптор "DiagnosticDescriptor", назначенный полю, используется для передачи диагностических данных окончания компиляции, но конструктор "DiagnosticDescriptor" не передал необходимый настраиваемый тег "CompilationEnd". Дополнительные сведения см. в документации по "WellKnownDiagnosticTags.CompilationEnd".
tr: Alana atanan 'DiagnosticDescriptor', bir derleme bitiş tanılamasını rapor etmek için kullanılır ancak bunu başlatmak için kullanılan 'DiagnosticDescriptor' oluşturucusu, gerekli "CompilationEnd" özel etiketinde geçmez. Ayrıntılar için 'WellKnownDiagnosticTags.CompilationEnd' belgesine bakın.
zh_hans: 分配给字段的 "DiagnosticDescriptor" 用于报告编译结束诊断，但用于初始化它的 "DiagnosticDescriptor" 构造函数未传入所需的自定义标记 "CompilationEnd"。有关详细信息，请参阅 "WellKnownDiagnosticTags.CompilationEnd" 的文档。
zh_hant: 指派給欄位的 'DiagnosticDescriptor' 可用來報告編譯結束診斷，但用於初始化的 'DiagnosticDescriptor' 建構函式未傳遞到必要的自訂標籤 "CompilationEnd"。如需詳細資料，請參閱 'WellKnownDiagnosticTags.CompilationEnd' 文件。

# AddCompilationEndCustomTagMessage
source: Add "CompilationEnd" custom tag to the diagnostic descriptor used to initialize field '{0}' as it is used to report a compilation end diagnostic
de: Dem Diagnosedeskriptor das benutzerdefinierte Tag "CompilationEnd" hinzufügen, das zum Initialisieren des Felds "{0}" verwendet wird, da es zum Melden einer Kompilierungsenddiagnose verwendet wird
es: Agregar la etiqueta personalizada "CompilationEnd" al descriptor de diagnóstico usado para inicializar el campo "{0}" como se usa para notificar un diagnóstico final de compilación
fr: Ajouter la balise personnalisée « CompilationEnd » au descripteur de diagnostic utilisé pour initialiser le champ «{0}», car il est utilisé pour signaler un diagnostic de fin de compilation
it: Aggiungere il tag personalizzato "CompilationEnd" al descrittore di diagnostica usato per inizializzare il campo '{0}' in quanto viene usato per segnalare una diagnostica di fine compilazione
ko: 컴파일 종료 진단을 보고하는 데 사용되므로 필드 '{0}'을(를) 초기화하는 데 사용되는 진단 설명자에 "CompilationEnd" 사용자 지정 태그를 추가합니다.
pl: Dodaj niestandardowy tag „CompilationEnd” do deskryptora diagnostycznego używanego do inicjowania pola „{0}”, ponieważ jest on używany do raportowania diagnostyki zakończenia kompilacji
ru: Добавить настраиваемый тег "CompilationEnd" к дескриптору диагностики, используемому для инициализации поля "{0}", поскольку он передает диагностические данные окончания компиляции
tr: Derleme sonu tanılamasını rapor etmek için kullanıldığından, '{0}' alanını başlatmak için kullanılan tanılama tanımlayıcısına "CompilationEnd" özel etiketi ekleyin
zh_hans: 将 "CompilationEnd" 自定义标记添加到用于初始化字段 "{0}" 的诊断描述符，因为它用于报告编译结束诊断
zh_hant: 將 "CompilationEnd" 自訂標記新增至用於初始化欄位 '{0}' 的診斷描述項，因為它用來報告編譯結束診斷

# AddCompilationEndCustomTagTitle
source: Add "CompilationEnd" custom tag to compilation end diagnostic descriptor
de: Benutzerdefiniertes Tag "CompilationEnd" zum Diagnosedeskriptor für Kompilierungsende hinzufügen
es: Agregar la etiqueta personalizada "CompilationEnd" al descriptor de diagnóstico de fin de compilación
fr: Ajouter la balise personnalisée « CompilationEnd » au descripteur de diagnostic de fin de compilation
it: Aggiungere il tag personalizzato "CompilationEnd" al descrittore di diagnostica di fine della compilazione
ko: 컴파일 종료 진단 설명자에 "CompilationEnd" 사용자 지정 태그를 추가합니다.
pl: Dodaj niestandardowy tag „CompilationEnd” do deskryptora diagnostycznego zakończenia kompilacji
ru: Добавить настраиваемый тег "CompilationEnd" к дескриптору диагностики окончания компиляции
tr: Derleme sonu tanılama tanımlayıcısına "CompilationEnd" özel etiketi ekleme
zh_hans: 将 "CompilationEnd" 自定义标记添加到编译结束诊断描述符
zh_hant: 將 "CompilationEnd" 自訂標記新增至編譯結束診斷描述項

# AddEntryForDiagnosticIdInAnalyzerReleaseCodeFixTitle
source: Add rule entry to unshipped release file
de: Regeleintrag der nicht veröffentlichten Releasedatei hinzufügen
es: Agregar una entrada de regla a un archivo de versión no incluido
fr: Ajouter une entrée de règle au fichier de version non fourni
it: Aggiungere la voce della regola per il file di versione non distribuito
ko: 제공되지 않은 릴리스 파일에 규칙 항목 추가
pl: Dodaj wpis reguły do niedostarczonego pliku wydania
ru: Добавить запись правила в неотправленный файл выпуска
tr: Gönderilmeyen yayın dosyasına kural girişi ekle
zh_hans: 将规则项添加到未提供的版本文件
zh_hant: 將規則項目新增至未送出的版本檔案

# ClassIsNotDiagnosticAnalyzerMessage
source: Inherit type '{0}' from DiagnosticAnalyzer or remove the DiagnosticAnalyzerAttribute(s)
de: Übernehmen Sie den Typ "{0}" von DiagnosticAnalyzer, oder entfernen Sie DiagnosticAnalyzerAttribute(s).
es: Herede el tipo "{0}" de DiagnosticAnalyzer o quite los elementos DiagnosticAnalyzerAttribute.
fr: Effectuez un héritage de type '{0}' à partir de DiagnosticAnalyzer, ou supprimez les instances de DiagnosticAnalyzerAttribute
it: Ereditare il tipo '{0}' da DiagnosticAnalyzer o rimuovere gli attributi DiagnosticAnalyzerAttribute
ko: DiagnosticAnalyzer에서 '{0}' 형식을 상속하거나 DiagnosticAnalyzerAttribute를 제거하세요.
pl: Dziedzicz typ „{0}” z elementu DiagnosticAnalyzer lub usuń elementy DiagnosticAnalyzerAttribute
ru: Наследуйте тип "{0}" от DiagnosticAnalyzer или удалите DiagnosticAnalyzerAttribute.
tr: DiagnosticAnalyzer'dan '{0}' türünü devralın veya DiagnosticAnalyzerAttribute'ları kaldırın
zh_hans: 从 DiagnosticAnalyzer 继承类型“{0}”，或者删除 DiagnosticAnalyzerAttribute
zh_hant: 從 DiagnosticAnalyzer 繼承型別 '{0}' 或移除 DiagnosticAnalyzerAttribute

# ClassIsNotDiagnosticAnalyzerTitle
source: Types marked with DiagnosticAnalyzerAttribute(s) should inherit from DiagnosticAnalyzer
de: Mit DiagnosticAnalyzerAttribute(s) gekennzeichnete Typen müssen von DiagnosticAnalyzer erben
es: Los tipos marcados con DiagnosticAnalyzerAttribute deben heredar de DiagnosticAnalyzer
fr: Les types marqués avec des instances de DiagnosticAnalyzerAttribute doivent hériter de DiagnosticAnalyzer
it: I tipi contrassegnati con attributi DiagnosticAnalyzerAttribute devono ereditare da DiagnosticAnalyzer
ko: DiagnosticAnalyzerAttribute로 표시된 형식은 DiagnosticAnalyzer에서 상속되어야 함
pl: Typy oznaczone za pomocą elementów DiagnosticAnalyzerAttribute powinny dziedziczyć po elemencie DiagnosticAnalyzer
ru: Типы, помеченные как DiagnosticAnalyzerAttribute, должны наследовать от DiagnosticAnalyzer
tr: DiagnosticAnalyzerAttribute'lar ile işaretlenen türler DiagnosticAnalyzer'dan devralınmalıdır
zh_hans: 标有 DiagnosticAnalyzerAttribute 的类型应继承自 DiagnosticAnalyzer
zh_hant: 標示了 DiagnosticAnalyzerAttribute 的型別應繼承自 DiagnosticAnalyzer

# CompareSymbolsCorrectlyCodeFix
source: Use a 'SymbolEqualityComparer' for symbol comparison
de: Verwenden von "SymbolEqualityComparer" für den Symbolvergleich
es: Usar un 'SymbolEqualityComparer' para la comparación de símbolos
fr: Utiliser un ’SymbolEqualityComparer’ pour la comparaison de symboles
it: Usa un 'SymbolEqualityComparer' per il confronto dei simboli
ko: 기호 비교에 'SymbolEqualityComparer' 사용
pl: Użyj elementu „SymbolEqualityComparer” do porównania symboli
ru: Используйте "SymbolEqualityComparer" для сравнения символов
tr: Sembol karşılaştırması için 'SymbolEqualityComparer' kullanın
zh_hans: 使用 “SymbolEqualityComparer” 进行符号比较
zh_hant: 使用 'SymbolEqualityComparer' 進行符號比較

# CompareSymbolsCorrectlyDescription
source: Symbols should be compared for equality, not identity. Use an overload accepting an 'IEqualityComparer' and pass 'SymbolEqualityComparer'.
de: Symbole sollten im Hinblick auf Gleichheit und nicht im Hinblick auf die Identität verglichen werden. Verwenden Sie eine Überladung, die "IEqualityComparer" akzeptiert, und übergeben Sie "SymbolEqualityComparer".
es: Debe compararse la igualdad de los símbolos, no la identidad. Use una sobrecarga que acepte un elemento "IEqualityComparer" y pase "SymbolEqualityComparer".
fr: La comparaison des symboles doit porter sur l'égalité, pas sur l'identité. Utilisez une surcharge acceptant 'IEqualityComparer' et passez 'SymbolEqualityComparer'.
it: I simboli devono essere confrontati per verificarne l'uguaglianza, non l'identità. Usare un overload che accetta un elemento 'IEqualityComparer' e passare 'SymbolEqualityComparer'.
ko: 기호는 ID가 아니라 같은지 비교해야 합니다. 'IEqualityComparer'를 허용하는 오버로드를 사용하고 'SymbolEqualityComparer'를 전달하세요.
pl: Symbole powinny być porównywane pod kątem równości, a nie tożsamości. Użyj przeciążenia przyjmującego element „IEqualityComparer” i przekazującego element „SymbolEqualityComparer”.
ru: Символы должны сравниваться на равенство, а не на идентичность. Используйте перегрузку, принимающую "IEqualityComparer", и передайте "SymbolEqualityComparer".
tr: Semboller kimlik değil, eşitlik bakımından karşılaştırılmalıdır. 'IEqualityComparer' kabul eden bir aşırı yükleme kullanın ve 'SymbolEqualityComparer' geçirin.
zh_hans: 应比较符号是否相等，而不是比较标识。使用重载接受 "IEqualityComparer" 并传递 "SymbolEqualityComparer"。
zh_hant: 應比較符號是否相等，而非相同。請使用接受 'IEqualityComparer' 的多載，並傳遞 'SymbolEqualityComparer'。

# CompareSymbolsCorrectlyDescriptionGetHashCode
source: Symbols should be compared for equality, not identity. An explicit call to 'GetHashCode' will likely result in the wrong behavior.
de: Symbole sollten im Hinblick auf Gleichheit und nicht im Hinblick auf die Identität verglichen werden. Ein expliziter Aufruf von "GetHashCode" führt wahrscheinlich zu einem falschen Verhalten.
es: Debe compararse la igualdad de los símbolos, no la identidad. Una llamada explícita a "GetHashCode" probablemente producirá un comportamiento incorrecto.
fr: La comparaison des symboles doit porter sur l'égalité, pas sur l'identité. Un appel explicite à 'GetHashCode' risque d'entraîner un comportement incorrect.
it: I simboli devono essere confrontati per verificarne l'uguaglianza, non l'identità. Una chiamata esplicita a 'GetHashCode' probabilmente causerà un comportamento errato.
ko: 기호는 ID가 아니라 같은지 비교해야 합니다. 'GetHashCode'를 명시적으로 호출하면 잘못된 동작이 수행될 수 있습니다.
pl: Symbole powinny być porównywane pod kątem równości, a nie tożsamości. Jawne wywołanie metody „GetHashCode” prawdopodobnie spowoduje nieprawidłowe zachowanie.
ru: Символы должны сравниваться на равенство, а не на идентичность. Явный вызов "GetHashCode" может привести к неправильному поведению.
tr: Semboller kimlik değil, eşitlik bakımından karşılaştırılmalıdır. 'GetHashCode'a yönelik açık çağrı büyük olasılıkla yanlış davranışa neden olur.
zh_hans: 应比较符号是否相等，而不是比较标识。对 "GetHashCode" 的显式调用可能会导致错误的行为。
zh_hant: 應比較符號是否相等，而非相同。對 'GetHashCode' 進行明確的呼叫可能會造成錯誤的行為。

# CompareSymbolsCorrectlyMessage
source: Use 'SymbolEqualityComparer' when comparing symbols
de: Verwenden von "SymbolEqualityComparer" beim Vergleichen von Symbolen
es: Usar 'SymbolEqualityComparer' al comparar símbolos
fr: Utiliser ’SymbolEqualityComparer’ lors de la comparaison de symboles
it: Usa 'SymbolEqualityComparer' quando si confrontano i simboli
ko: 기호를 비교할 때 'SymbolEqualityComparer' 사용
pl: Użyj elementu „SymbolEqualityComparer” podczas porównywania symboli
ru: Используйте "SymbolEqualityComparer" при сравнении символов
tr: Sembolleri karşılaştırırken 'SymbolEqualityComparer' kullanın
zh_hans: 比较符号时使用 “SymbolEqualityComparer”
zh_hant: 比較符號時，請使用 'SymbolEqualityComparer'

# CompareSymbolsCorrectlyTitle
source: Symbols should be compared for equality
de: Symbole sollten auf Gleichheit verglichen werden
es: Se debe comparar la igualdad de los símbolos
fr: La comparaison des symboles doit porter sur l'égalité.
it: È necessario confrontare i simboli per verificarne l'uguaglianza.
ko: 기호는 동등성을 위해 비교되어야 합니다.
pl: Symbole powinny być porównywane pod kątem równości
ru: Символы следует сравнивать на равенство
tr: Semboller eşitlik bakımından karşılaştırılmalıdır.
zh_hans: 应比较符号是否相等
zh_hant: 應比較符號是否相等

# ConfigureGeneratedCodeAnalysisFix
source: Configure generated code analysis
de: Konfigurieren der Analyse von generiertem Code
es: Configurar análisis de código generado
fr: Configurer l'analyse du code générée
it: Configura Code Analysis per file generati
ko: 생성된 코드 분석 구성
pl: Konfigurowanie analizy wygenerowanego kodu
ru: Настройка анализа созданного кода
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析
zh_hant: 設定產生的程式碼分析

# ConfigureGeneratedCodeAnalysisMessage
source: Configure generated code analysis
de: Konfigurieren der Analyse von generiertem Code
es: Configurar análisis de código generado
fr: Configurer l'analyse du code générée
it: Configura Code Analysis per file generati
ko: 생성된 코드 분석 구성
pl: Konfigurowanie analizy wygenerowanego kodu
ru: Настройка анализа созданного кода
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析
zh_hant: 設定產生的程式碼分析

# ConfigureGeneratedCodeAnalysisTitle
source: Configure generated code analysis
de: Konfigurieren der Analyse von generiertem Code
es: Configurar análisis de código generado
fr: Configurer l'analyse du code générée
it: Configura Code Analysis per file generati
ko: 생성된 코드 분석 구성
pl: Konfigurowanie analizy wygenerowanego kodu
ru: Настройка анализа созданного кода
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析
zh_hant: 設定產生的程式碼分析

# DeclareDiagnosticIdInAnalyzerReleaseDescription
source: All supported analyzer diagnostic IDs should be part of an analyzer release.
de: Alle unterstützten Analysetooldiagnose-IDs müssen Teil eines Analysetoolrelease sein.
es: Todos los identificadores de diagnóstico del analizador admitidos deben formar parte de una versión del analizador.
fr: Tous les ID de diagnostic d'analyseur pris en charge doivent faire partie d'une version d'analyseur.
it: Tutti gli ID diagnostica dell'analizzatore supportati devono far parte di una versione dell'analizzatore.
ko: 지원되는 모든 분석기 진단 ID는 분석기 릴리스에 포함되어야 합니다.
pl: Wszystkie obsługiwane identyfikatory diagnostyczne analizatora powinny być częścią wydania analizatora.
ru: Все поддерживаемые идентификаторы диагностики анализатора должны быть частью выпуска анализатора.
tr: Tüm desteklenen çözümleyici tanılama kimlikleri bir çözümleyici yayınının parçası olmalıdır.
zh_hans: 所有受支持的分析器诊断 ID 都应是分析器版本的一部分。
zh_hant: 所有受支援的分析器診斷識別碼都應包含在分析器版本中。

# DeclareDiagnosticIdInAnalyzerReleaseMessage
source: Rule '{0}' is not part of any analyzer release
de: Die Regel "{0}" gehört keinem Analysetoolrelease an.
es: La regla "{0}" no forma parte de ninguna versión del analizador.
fr: La règle '{0}' ne fait partie d'aucune version d'analyseur
it: La regola '{0}' non fa parte di alcuna versione dell'analizzatore
ko: '{0}' 규칙은 분석기 릴리스에 포함되지 않습니다.
pl: Reguła „{0}” nie jest częścią żadnego wydania analizatora
ru: Правило "{0}" не входит ни в один из выпусков анализатора.
tr: '{0}' kuralı herhangi bir çözümleyici yayınının parçası değil
zh_hans: 规则“{0}”不是分析器版本的一部分
zh_hant: 規則 '{0}' 未包含在任何分析器版本中

# DeclareDiagnosticIdInAnalyzerReleaseTitle
source: Add analyzer diagnostic IDs to analyzer release
de: Analysetooldiagnose-IDs zu Analysetoolrelease hinzufügen
es: Agregar identificadores de diagnóstico del analizador a la versión del analizador
fr: Ajouter des ID de diagnostic d'analyseur à la version d'analyseur
it: Aggiungere gli ID diagnostica dell'analizzatore alla versione dell'analizzatore
ko: 분석기 릴리스에 분석기 진단 ID 추가
pl: Dodaj identyfikatory diagnostyki analizatora do wydania analizatora
ru: Добавьте идентификаторы диагностики анализатора в выпуск анализатора
tr: Çözümleyici yayınına çözümleyici tanılama kimlikleri ekleyin
zh_hans: 向分析器版本添加分析器诊断 ID
zh_hant: 將分析器診斷識別碼新增至分析器版本

# DefineDiagnosticDescriptionCorrectlyMessage
source: The diagnostic description should be one or multiple sentences ending with a punctuation sign and should not have any leading or trailing whitespaces
de: Die Diagnosebeschreibung muss aus einem oder mehreren Sätzen bestehen, die mit einem Satzzeichen enden und keine führenden oder nachfolgenden Leerzeichen enthalten dürfen.
es: La descripción del diagnóstico debe tener una o varias oraciones que terminen con un signo de puntuación y no debe tener espacios en blanco al principio ni al final.
fr: La description du diagnostic doit se composer d'une ou de plusieurs phrases se terminant par un signe de ponctuation, sans espaces blancs de début ou de fin
it: La descrizione della diagnostica deve essere costituita da una o più frasi che terminano con un segno di punteggiatura e non deve includere spazi vuoti iniziali o finali
ko: 진단 설명은 문장 부호로 끝나는 하나 이상의 문장이어야 하며 선행 또는 후행 공백이 없어야 합니다.
pl: Opis diagnostyczny powinien być jednym lub wieloma zdaniami kończącymi się znakiem interpunkcyjnym i nie powinien mieć żadnych spacji na początku ani na końcu
ru: Описание диагностики должно представлять собой одно или несколько предложений, заканчивающихся знаком препинания, и не должно содержать начальные или конечные пробелы.
tr: Tanılama açıklaması, noktalama işaretiyle biten bir veya birkaç cümle olmalı ve başında veya sonunda boşluk olmamalıdır
zh_hans: 诊断说明应为以标点符号结尾的一个或多个句子，且不应包含任何前导空格或尾随空格
zh_hant: 診斷描述應為具有標點符號結尾的一或多行句子，而且前後不能有空白字元

# DefineDiagnosticDescriptionCorrectlyTitle
source: Define diagnostic description correctly
de: Diagnosebeschreibung ordnungsgemäß definieren
es: Definir correctamente la descripción del diagnóstico
fr: Définir correctement la description de diagnostic
it: Definisci correttamente la descrizione della diagnostica
ko: 진단 설명 올바르게 정의
pl: Poprawnie zdefiniuj opis diagnostyki
ru: Укажите описание диагностики правильно
tr: Tanılama açıklamasını doğru tanımlayın
zh_hans: 正确定义诊断说明
zh_hant: 正確定義診斷描述

# DefineDiagnosticMessageCorrectlyMessage
source: The diagnostic message should not contain any line return character nor any leading or trailing whitespaces and should either be a single sentence without a trailing period or a multi-sentences with a trailing period
de: Die Diagnosemeldung darf keine Zeilenvorschubzeichen und keine führenden oder nachfolgenden Leerzeichen enthalten und muss entweder einen einzelnen Satz ohne Satzendepunkt oder mehrere Sätze mit Satzendepunkt umfassen.
es: El mensaje de diagnóstico no debe contener ningún carácter de retorno de línea ni espacios en blanco al principio o al final; además, debe ser una sola oración sin punto final o varias oraciones con punto final.
fr: Le message du diagnostic ne doit comporter aucun caractère de retour de ligne et aucun espace blanc de début ou de fin, et doit tenir en une seule phrase sans point final ou en plusieurs phrases avec un point final
it: Il messaggio della diagnostica non deve contenere caratteri di ritorno a capo oppure spazi vuoti iniziali o finali e deve essere costituito da una singola frase senza punto finale oppure da più frasi con un punto finale
ko: 진단 메시지에 줄 바꿈 문자 또는 선행이나 후행 공백을 포함할 수 없으며, 마침표가 없는 단일 문장이거나 마침표가 있는 여러 문장이어야 합니다.
pl: Komunikat dotyczący diagnostyki nie powinien zawierać znaku nowego wiersza ani odstępów na początku i końcu oraz powinien być pojedynczym zdaniem bez kropki na końcu lub wieloma zdaniami z kropkami na końcu
ru: Диагностическое сообщение не должно содержать символы возврата каретки либо начальные или конечные пробелы и должно представлять собой одно предложение без конечной точки или несколько предложений с конечной точкой.
tr: Tanılama iletisi, satır başı karakteri veya başta ya da sonda boşluk içermemeli ve sonunda nokta olmayan tek bir cümle ya da sonunda nokta olan birden çok cümle olmalıdır
zh_hans: 诊断消息不应包含任何行回车符，也不应包含任何前导或尾随空格，应为不带尾随句点的单个句子或带有一个尾随句点的多个句子
zh_hant: 診斷訊息不應包含任何換行字元或前後空白，而且應為沒有行尾句點的單一句子，或有行尾句點的多行句子

# DefineDiagnosticMessageCorrectlyTitle
source: Define diagnostic message correctly
de: Diagnosemeldung ordnungsgemäß definieren
es: Definir correctamente el mensaje de diagnóstico
fr: Définir correctement le message de diagnostic
it: Definisci correttamente il messaggio della diagnostica
ko: 진단 메시지 올바르게 정의
pl: Poprawnie zdefiniuj komunikat dotyczący diagnostyki
ru: Укажите сообщение диагностики правильно
tr: Tanılama iletisini doğru tanımlayın
zh_hans: 正确定义诊断消息
zh_hant: 正確定義診斷訊息

# DefineDiagnosticTitleCorrectlyMessage
source: The diagnostic title should not contain a period, nor any line return character, nor any leading or trailing whitespaces
de: Der Diagnosetitel darf weder einen Punkt, noch ein Zeilenumbruchzeichen, noch führende und nachfolgende Leerzeichen enthalten.
es: El título del diagnóstico no debe tener punto final ni ningún carácter de retorno de línea, así como tampoco espacios en blanco al principio ni al final.
fr: Le titre du diagnostic ne doit contenir aucun point, aucun caractère de retour de ligne et aucun espace blanc de début ou de fin
it: Il titolo della diagnostica non deve contenere un punto, né un carattere di ritorno a capo oppure spazi vuoti iniziali o finali
ko: 진단 제목에는 마침표, 줄 바꿈 문자 또는 선행이나 후행 공백을 포함할 수 없습니다.
pl: Tytuł diagnostyki nie powinien zawierać kropki ani żadnego znaku nowego wiersza, a także żadnych spacji na początku i na końcu
ru: Заголовок диагностики не должен содержать точку, любой символ возврата каретки, а также начальные или конечные пробелы.
tr: Tanılama başlığı nokta, satır başı karakteri veya başta ya da sonda boşluk içermemelidir
zh_hans: 诊断标题不应包含句点，也不应包含任何行回车符和任何前导空格或尾随空格
zh_hant: 診斷標題不應包含句點或任何換行字元，前後也不能包含任何空白字元

# DefineDiagnosticTitleCorrectlyTitle
source: Define diagnostic title correctly
de: Titel der Diagnosemeldung ordnungsgemäß definieren
es: Definir el título del diagnóstico correctamente
fr: Définir correctement le titre de diagnostic
it: Definisci correttamente il titolo della diagnostica
ko: 진단 제목을 올바르게 정의
pl: Poprawnie zdefiniuj tytuł diagnostyki
ru: Укажите название диагностики правильно
tr: Tanılama başlığını doğru tanımlayın
zh_hans: 正确定义诊断标题
zh_hant: 正確定義診斷標題
