Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullForFieldDescription
source: Calling 'SemanticModel.GetDeclaredSymbol' with an argument of type 'FieldDeclarationSyntax' or 'EventFieldDeclarationSyntax' will always return 'null'. Call 'GetDeclaredSymbol' with the variable declarators from the field instead.
de: Beim Aufrufen von "SemanticModel.GetDeclaredSymbol" mit einem Argument vom Typ "FieldDeclarationSyntax" oder "EventFieldDeclarationSyntax" wird immer "null" zurückgegeben. Rufen Sie stattdessen "GetDeclaredSymbol" mit den Variablendeklaratoren aus dem Feld auf.
es: Llamar a "SemanticModel.GetDeclaredSymbol" con un argumento de tipo "FieldDeclarationSyntax" o "EventFieldDeclarationSyntax" siempre devolverá "null". Llame a "GetDeclaredSymbol" con los declaradores de variable del campo en su lugar.
fr: L’appel de « SemanticModel.GetDeclaredSymbol » avec un argument de type « FieldDeclarationSyntax » ou « EventFieldDeclarationSyntax » retourne toujours « null ». Appelez « GetDeclaredSymbol » avec les déclarateur de variable du champ à la place.
it: La chiamata a 'SemanticModel.GetDeclaredSymbol' con un argomento di tipo 'FieldDeclarationSyntax' o 'EventFieldDeclarationSyntax' restituirà sempre 'null'. Chiamare 'GetDeclaredSymbol' con i dichiaratori di variabili dal campo.
ko: 'FieldDeclarationSyntax' 또는 'EventFieldDeclarationSyntax' 형식의 인수를 사용하여 'SemanticModel.GetDeclaredSymbol'을 호출하면 항상 'null'이 반환됩니다. 대신 필드의 변수 선언자를 사용하여 'GetDeclaredSymbol'을 호출합니다.
pl: Wywołanie metody „SemanticModel.GetDeclaredSymbol” z argumentem typu „FieldDeclarationSyntax” lub „EventFieldDeclarationSyntax” zawsze zwróci wartość „null”. Wywołaj metodę „GetDeclaredSymbol” z deklaratorami zmiennych z pola.
ru: Вызов "SemanticModel.GetDeclaredSymbol" с аргументом типа "FieldDeclarationSyntax" или "EventFieldDeclarationSyntax" всегда будет возвращать "null". Вместо этого вызовите "GetDeclaredSymbol" с операторами объявления переменных из поля.
tr: 'FieldDeclarationSyntax' veya 'EventFieldDeclarationSyntax' bağımsız değişken türüyle 'SemanticModel.GetDeclaredSymbol' çağrısı yapmak her zaman 'null' döndürür. Bunun yerine, alandan değişken bildirimciler ile 'GetDeclaredSymbol' çağrısı yapın.
zh_hans: 使用类型为“FieldDeclarationSyntax”或“EventFieldDeclarationSyntax”的参数调用“SemanticModel.GetDeclaredSymbol”将始终返回“null”。改为使用字段中的变量声明符调用“GetDeclaredSymbol”。

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullForFieldMessage
source: A call to 'SemanticModel.GetDeclaredSymbol({0})' will always return 'null'
de: Ein Aufruf von "SemanticModel.GetDeclaredSymbol({0})" gibt immer "null" zurück.
es: Una llamada a "SemanticModel.GetDeclaredSymbol({0})" siempre devolverá "null"
fr: Un appel à « SemanticModel.GetDeclaredSymbol({0}) » retourne toujours « null »
it: Una chiamata a 'SemanticModel.GetDeclaredSymbol({0})' restituirà sempre 'null'
ko: 'SemanticModel.GetDeclaredSymbol({0})'에 대한 호출은 항상 'null'을 반환합니다.
pl: Wywołanie metody „SemanticModel.GetDeclaredSymbol({0})” zawsze zwraca wartość „null”
ru: Вызов в "SemanticModel.GetDeclaredSymbol({0})" всегда возвращает "null"
tr: 'SemanticModel.GetDeclaredSymbol({0})' çağrısı her zaman 'null' döndürür
zh_hans: 对“SemanticModel.GetDeclaredSymbol({0})'”的调用将始终返回“null”
zh_hant: 呼叫 'SemanticModel.GetDeclaredSymbol({0})' 一律會傳回 'null'

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullMessage
source: A call to 'SemanticModel.GetDeclaredSymbol({0})' will always return 'null'
de: Ein Aufruf von "SemanticModel.GetDeclaredSymbol({0})" gibt immer "null" zurück.
es: Una llamada a "SemanticModel.GetDeclaredSymbol({0})" siempre devolverá "null"
fr: Un appel à « SemanticModel.GetDeclaredSymbol({0}) » retourne toujours « null »
it: Una chiamata a 'SemanticModel.GetDeclaredSymbol({0})' restituirà sempre 'null'
ko: 'SemanticModel.GetDeclaredSymbol({0})'에 대한 호출은 항상 'null'을 반환합니다.
pl: Wywołanie metody „SemanticModel.GetDeclaredSymbol({0})” zawsze zwraca wartość „null”
ru: Вызов в "SemanticModel.GetDeclaredSymbol({0})" всегда возвращает "null"
tr: 'SemanticModel.GetDeclaredSymbol({0})' çağrısı her zaman 'null' döndürür
zh_hans: 对“SemanticModel.GetDeclaredSymbol({0})'”的调用将始终返回“null”
zh_hant: 呼叫 'SemanticModel.GetDeclaredSymbol({0})' 一律會傳回 'null'

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullTitle
source: This call to 'SemanticModel.GetDeclaredSymbol()' will always return 'null'
de: Dieser Aufruf von "SemanticModel.GetDeclaredSymbol()" gibt immer "null" zurück.
es: Esta llamada a "SemanticModel.GetDeclaredSymbol()" siempre devolverá "null".
fr: Cet appel à « SemanticModel.GetDeclaredSymbol() » retourne toujours « null »
it: Questa chiamata a 'SemanticModel.GetDeclaredSymbol()' restituirà sempre 'null'
ko: 'SemanticModel.GetDeclaredSymbol()'에 대한 이 호출은 항상 'null'을 반환합니다.
pl: To wywołanie metody "SemanticModel.GetDeclaredSymbol()" zawsze zwróci wartość „null”
ru: Этот вызов в "SemanticModel.GetDeclaredSymbol()" всегда возвращает "null"
tr: 'SemanticModel.GetDeclaredSymbol()' çağrısı her zaman 'null' döndürür
zh_hans: 对“SemanticModel.GetDeclaredSymbol()”的调用将始终返回“null”

# SymbolIsBannedInAnalyzersDescription
source: The symbol has been marked as banned for use in analyzers, and an alternate should be used instead.
de: Das Symbol wurde für die Verwendung in dem Analysetool als gesperrt gekennzeichnet, und es muss stattdessen eine Alternative verwendet werden.
es: El símbolo ha sido marcado como de uso prohibido en los analizadores, y en su lugar debe usarse uno alternativo.
fr: Le symbole a été marqué comme étant interdit d’utilisation dans les analyseurs, et un autre symbole doit être utilisé à la place.
it: Il simbolo è stato contrassegnato come escluso dall'uso negli analizzatori e al suo posto deve esserne usato uno alternativo.
ko: 기호가 분석기에서 사용 금지된 것으로 표시되었으며 대신 대체 기호를 사용해야 합니다.
pl: Symbol został oznaczony jako zabroniony do użytku w analizatorze i zamiast niego powinien być używany alternatywny.
ru: Символ был помечен как запрещенный к использованию в анализаторах. Вместо него следует использовать альтернативный вариант.
tr: Sembol, çözümleyicilerde kullanılması yasaklı olarak işaretlendiğinden bunun yerine başka bir sembol kullanılması gerekiyor.
zh_hans: 已将该符号标记为禁止在分析器中使用，并应改用备用符号。
zh_hant: 已將符號標示為禁用於分析器，因此應改用替代符號。

# SymbolIsBannedInAnalyzersMessage
source: The symbol '{0}' is banned for use by analyzers{1}
de: Das Symbol "{0}" ist für die Verwendung durch Analysetools gesperrt{1}
es: El símbolo "{0}" está prohibido para su uso por los analizadores{1}
fr: Le symbole '{0}' est interdit pour l’utilisation par les analyseurs{1}.
it: Il simbolo '{0}' è stato escluso per l'uso da parte degli analizzatori{1}
ko: 기호 '{0}'은(는) 분석기에서 사용할 수 없습니다{1}
pl: Symbol „{0}” jest zabroniony do użycia przez analizatory{1}
ru: Символ "{0}" запрещен к использованию анализаторами{1}
tr: '{0}' sembolünün {1} çözümleyicileri tarafından kullanılması yasaklandı
zh_hans: 已禁止分析器 {1} 使用符号“{0}”
zh_hant: 符號 '{0}' 已禁用於分析器{1}

# SymbolIsBannedInAnalyzersTitle
source: Do not use APIs banned for analyzers
de: Verwenden Sie keine für Analysetools gesperrte APIs
es: No usar API prohibidas para analizadores
fr: Ne pas utiliser d’API interdites pour les analyseurs
it: Non usare API escluse per gli analizzatori
ko: 분석기에서 금지된 API 사용 안 함
pl: Nie używaj interfejsów API zablokowanych dla analizatorów
ru: Не использовать API, запрещенные для анализаторов
tr: Çözümleyiciler için yasaklanan API'leri kullanmayın
zh_hans: 不要使用禁用于分析器的 API
zh_hant: 請勿在分析器中使用禁止的 API

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdDescription
source: Diagnostic IDs marked as removed in analyzer release file should not be reported by analyzers.
de: Diagnose-IDs, die in der Analysetool-Releasedatei als entfernt markiert sind, dürfen von Analysetools nicht gemeldet werden.
es: Los analizadores no deben informar sobre los identificadores de diagnóstico marcados como quitados en el archivo de versión del analizador.
fr: Les ID de diagnostic marqués comme étant supprimés dans le fichier de version d'analyseur ne doivent pas être signalés par les analyseurs.
it: Gli ID diagnostica contrassegnati come rimossi nel file di versione dell'analizzatore non devono essere segnalati dagli analizzatori.
ko: 분석기 릴리스 파일에서 제거된 것으로 표시된 진단 ID는 분석기에서 보고되면 안 됩니다.
pl: Identyfikatory diagnostyczne oznaczone jako usunięte w pliku wydania analizatora nie powinny być zgłaszane przez analizatory.
ru: Идентификаторы диагностики, помеченные как удаленные в файле выпуска анализатора, не должны отображаться в отчетах анализаторов.
tr: Çözümleyici yayın dosyasında kaldırılmış olarak işaretlenen tanılama kimlikleri çözümleyiciler tarafından bildirilmemelidir.
zh_hans: 分析器版本文件中标记为已删除的诊断 ID 不应由分析器报告。
zh_hant: 分析器不應回報分析器版本檔案中標示為已移除的診斷識別碼。

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdMessage
source: Rule '{0}' is marked as removed in the latest analyzer release, but is still being reported
de: Die Regel "{0}" ist im aktuellen Analysetoolrelease als entfernt markiert, wird aber noch gemeldet.
es: La regla "{0}" se ha marcado como quitada en la última versión del analizador, pero aún se notifica.
fr: La règle '{0}' est marquée comme étant supprimée dans la dernière version de l'analyseur, mais elle est toujours signalée
it: La regola '{0}' è contrassegnata come rimossa nell'ultima versione dell'analizzatore, ma viene ancora segnalata
ko: '{0}' 규칙이 최신 분석기 릴리스에서 제거된 것으로 표시되었지만 계속 보고됩니다.
pl: Reguła „{0}” jest oznaczona jako usunięta w najnowszym wydaniu analizatora, ale jest nadal zgłaszana
ru: Правило "{0}" помечено как удаленное в последнем выпуске анализатора, но по-прежнему отображается в отчете.
tr: '{0}' kuralı en son çözümleyici yayınında kaldırılmış olarak işaretlenmiş ancak hala bildiriliyor
zh_hans: 规则“{0}”在最新的分析器版本中标记为“已删除”，但它仍在报告中
zh_hant: 規則 '{0}' 在最新的分析器版本中標示為已移除，但仍回報了該規則

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdTitle
source: Diagnostic IDs marked as removed in analyzer release file should not be reported by analyzers
de: Diagnose-IDs, die in der Analysetool-Releasedatei als entfernt markiert sind, dürfen von Analysetools nicht gemeldet werden.
es: Los analizadores no deben informar sobre los identificadores de diagnóstico marcados como quitados en el archivo de versión del analizador
fr: Les ID de diagnostic marqués comme étant supprimés dans le fichier de version d'analyseur ne doivent pas être signalés par les analyseurs
it: Gli ID diagnostica contrassegnati come rimossi nel file di versione dell'analizzatore non devono essere segnalati dagli analizzatori
ko: 분석기 릴리스 파일에서 제거된 것으로 표시된 진단 ID는 분석기에서 보고되면 안 됩니다.
pl: Identyfikatory diagnostyki oznaczone jako usunięte w pliku wydania analizatora nie powinny być zgłaszane przez analizatory
ru: Идентификаторы диагностики, помеченные как удаленные в файле выпуска анализатора, не должны отображаться в отчетах анализаторов
tr: Çözümleyici yayın dosyasında kaldırılmış olarak işaretlenen tanılama kimlikleri çözümleyiciler tarafından bildirilmemelidir
zh_hans: 分析器版本文件中标记为“已删除”的诊断 ID 不得由分析器报告
zh_hant: 分析器不應回報在分析器版本檔案中標示為已移除的診斷識別碼

# UnsupportedSymbolKindArgumentToRegisterActionMessage
source: SymbolKind '{0}' is not supported for symbol analyzer actions
de: Der SymbolKind-Wert "{0}" wird für Symbolanalyseaktionen nicht unterstützt.
es: El argumento SymbolKind "{0}" no se admite para las acciones del analizador de símbolos.
fr: Le SymbolKind '{0}' n'est pas pris en charge pour les actions d'analyseur de symbole
it: L'elemento SymbolKind '{0}' non è supportato per le azioni dell'analizzatore di simboli
ko: SymbolKind '{0}'이(가) 기호 분석기 작업에서 지원되지 않습니다.
pl: Element SymbolKind „{0}” nie jest obsługiwany dla akcji analizatora symboli
ru: SymbolKind "{0}" не поддерживается для действий анализатора для символов.
tr: '{0}' SymbolKind, sembol çözümleyicisi eylemleri için desteklenmiyor
zh_hans: 符号分析器操作不支持 SymbolKind“{0}”
zh_hant: 對符號分析器動作不支援 SymbolKind '{0}'

# UnsupportedSymbolKindArgumentToRegisterActionTitle
source: Unsupported SymbolKind argument when registering a symbol analyzer action
de: Nicht unterstütztes SymbolKind-Argument beim Registrieren einer Symbolanalyseaktion
es: Argumento SymbolKind no admitido al registrar una acción del analizador de símbolos
fr: Argument SymbolKind non pris en charge au moment d'inscrire une action d'analyseur de symbole
it: L'argomento SymbolKind non è supportato durante la registrazione di un'azione dell'analizzatore di simboli
ko: 기호 분석기 작업을 등록할 때 지원되지 않는 SymbolKind 인수
pl: Nieobsługiwany argument SymbolKind podczas rejestrowania akcji analizatora symboli
ru: Неподдерживаемый аргумент SymbolKind при регистрации действия анализатора для символов
tr: Sembol çözümleyicisi eylemi kaydedilirken SymbolKind bağımsız değişkeni desteklenmiyor
zh_hans: 注册符号分析器操作时使用了不受支持的 SymbolKind 实参
zh_hant: 註冊符號分析器動作時不支援 SymbolKind 引數

# InvalidReportDiagnosticMessage
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor '{0}'
de: ReportDiagnostic wurde mit einem nicht unterstützten DiagnosticDescriptor "{0}" aufgerufen.
es: Se invocó a ReportDiagnostic con un elemento DiagnosticDescriptor "{0}" no admitido.
fr: ReportDiagnostic appelé avec un DiagnosticDescriptor '{0}' non pris en charge
it: ReportDiagnostic è stato richiamato con un elemento DiagnosticDescriptor '{0}' non supportato
ko: 지원되지 않는 DiagnosticDescriptor '{0}'을(를) 사용하여 호출된 ReportDiagnostic입니다.
pl: Argument ReportDiagnostic wywołany z nieobsługiwanym deskryptorem DiagnosticDescriptor „{0}”
ru: ReportDiagnostic вызван с помощью неподдерживаемого DiagnosticDescriptor "{0}".
tr: ReportDiagnostic desteklenmeyen '{0}' DiagnosticDescriptor ile çağrıldı
zh_hans: 使用不受支持的 DiagnosticDescriptor“{0}”调用了 ReportDiagnostic
zh_hant: 叫用 ReportDiagnostic 時使用了不受支援的 DiagnosticDescriptor '{0}'

# InvalidReportDiagnosticTitle
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor
de: ReportDiagnostic wurde mit einem nicht unterstützten DiagnosticDescriptor aufgerufen
es: Se invocó a ReportDiagnostic con un elemento DiagnosticDescriptor no admitido
fr: ReportDiagnostic appelé avec un DiagnosticDescriptor non pris en charge
it: ReportDiagnostic è stato richiamato con un elemento DiagnosticDescriptor non supportato
ko: 지원되지 않는 DiagnosticDescriptor를 사용하여 호출된 ReportDiagnostic
pl: Argument ReportDiagnostic wywołany z nieobsługiwanym deskryptorem DiagnosticDescriptor
ru: ReportDiagnostic вызван с помощью неподдерживаемого DiagnosticDescriptor
tr: ReportDiagnostic desteklenmeyen bir DiagnosticDescriptor ile çağrıldı
zh_hans: 使用不受支持的 DiagnosticDescriptor 调用了 ReportDiagnostic
zh_hant: 叫用 ReportDiagnostic 時使用了不受支援的 DiagnosticDescriptor

# InvalidReportDiagnosticDescription
source: ReportDiagnostic should only be invoked with supported DiagnosticDescriptors that are returned from DiagnosticAnalyzer.SupportedDiagnostics property. Otherwise, the reported diagnostic will be filtered out by the analysis engine.
de: ReportDiagnostic darf nur mit unterstützten DiagnosticDescriptors aufgerufen werden, die von der Eigenschaft "DiagnosticAnalyzer.SupportedDiagnostics" zurückgegeben werden. Andernfalls wird die gemeldete Diagnose durch die Analyse-Engine herausgefiltert.
es: ReportDiagnostic solo debe invocarse con elementos DiagnosticDescriptor admitidos que devuelve la propiedad DiagnosticAnalyzer.SupportedDiagnostics. De lo contrario, el motor de análisis descartará el diagnóstico notificado.
fr: ReportDiagnostic doit être appelé uniquement avec les DiagnosticDescriptors retournés à partir de la propriété DiagnosticAnalyzer.SupportedDiagnostics. Sinon, le diagnostic rapporté est filtré par le moteur d'analyse.
it: ReportDiagnostic deve essere richiamato solo con elementi DiagnosticDescriptor supportati restituiti dalla proprietà DiagnosticAnalyzer.SupportedDiagnostics. In caso contrario, la diagnostica restituita verrà filtrata dal motore di analisi.
ko: ReportDiagnostic은 DiagnosticAnalyzer.SupportedDiagnostics 속성에서 반환된 지원되는 DiagnosticDescriptors를 통해서만 호출되어야 합니다. 그러지 않으면 보고된 진단이 분석 엔진에 의해 필터링됩니다.
pl: Argument ReportDiagnostic powinien być wywoływany tylko z obsługiwanymi deskryptorami DiagnosticDescriptor, które są zwracane z właściwości DiagnosticAnalyzer.SupportedDiagnostics. W przeciwnym razie zgłoszona diagnostyka zostanie odfiltrowana przez aparat analizy.
ru: ReportDiagnostic следует вызывать только с помощью поддерживаемых DiagnosticDescriptor, возвращаемых свойством DiagnosticAnalyzer.SupportedDiagnostics. В противном случае модуль анализа отфильтрует зарегистрированные данные диагностики.
tr: ReportDiagnostic yalnızca DiagnosticAnalyzer.SupportedDiagnostics özelliğinden döndürülen desteklenen DiagnosticDescriptors ile çağrılmalıdır. Aksi takdirde, raporlanan tanılama çözümleme altyapısı tarafından filtrelenir.
zh_hans: 仅应使用从 DiagnosticAnalyzer.SupportedDiagnostics 属性返回的受支持的 DiagnosticDescriptors 调用 ReportDiagnostic。否则，分析引擎将过滤掉所报告的诊断。
zh_hant: 叫用 ReportDiagnostic 時，只可使用 DiagnosticAnalyzer.SupportedDiagnostics 屬性所傳回之受支援的 DiagnosticDescriptors。否則，分析引擎將會篩選掉回報的診斷。

# InvalidSyntaxKindTypeArgumentMessage
source: Type argument '{0}' for type parameter '{1}' of method '{2}' is not a SyntaxKind enum
de: Das Typargument "{0}" für den Typparameter "{1}" der Methode "{2}" ist keine SyntaxKind-Enumeration.
es: El argumento de tipo "{0}" para el parámetro de tipo "{1}" del método "{2}" no es una enumeración SyntaxKind.
fr: L'argument de type '{0}' pour le paramètre de type '{1}' de la méthode '{2}' n'est pas un enum SyntaxKind
it: L'argomento tipo '{0}' per il parametro di tipo '{1}' del metodo '{2}' non è un'enumerazione SyntaxKind
ko: '{2}' 메서드의 '{1}' 형식 매개 변수에 대한 형식 인수 '{0}'은(는) SyntaxKind 열거형이 아닙니다.
pl: Argument typu „{0}” dla parametru typu „{1}” metody „{2}” nie jest wyliczeniem SyntaxKind
ru: Аргумент типа "{0}" для параметра типа "{1}" метода "{2}" не является перечислением SyntaxKind.
tr: '{2}' metodunun '{1}' tür parametresi için '{0}' tür bağımsız değişkeni bir SyntaxKind sabit listesi değil
zh_hans: 方法“{2}”的类型形参“{1}”的类型实参“{0}”不是 SyntaxKind 枚举
zh_hant: 方法 '{2}' 之型別參數 '{1}' 的型別引數 '{0}' 並非 SyntaxKind 列舉

# InvalidSyntaxKindTypeArgumentTitle
source: Invalid type argument for DiagnosticAnalyzer's Register method
de: Ungültiges Typargument für die Register-Methode von DiagnosticAnalyzer
es: Argumento de tipo no válido para el método Register de DiagnosticAnalyzer
fr: Argument de type non valide pour la méthode Register de DiagnosticAnalyzer
it: L'argomento tipo per il metodo Register di DiagnosticAnalyzer non è valido
ko: DiagnosticAnalyzer의 Register 메서드에 대한 형식 인수가 잘못됨
pl: Nieprawidłowy argument typu dla metody Register analizatora DiagnosticAnalyzer
ru: Недопустимый аргумент типа для метода Register DiagnosticAnalyzer
tr: DiagnosticAnalyzer’ın Register metodu için tür bağımsız değişkeni geçersiz
zh_hans: DiagnosticAnalyzer 的 Register 方法的类型参数无效
zh_hant: DiagnosticAnalyzer 之 Register 方法的型別引數無效

# InvalidSyntaxKindTypeArgumentDescription
source: DiagnosticAnalyzer's language-specific Register methods, such as RegisterSyntaxNodeAction, RegisterCodeBlockStartAction and RegisterCodeBlockEndAction, expect a language-specific 'SyntaxKind' type argument for it's '{0}' type parameter. Otherwise, the registered analyzer action can never be invoked during analysis.
de: Die sprachspezifischen Register-Methoden von DiagnosticAnalyzer, beispielsweise "RegisterSyntaxNodeAction", "RegisterCodeBlockStartAction" und "RegisterCodeBlockEndAction", erwarten ein sprachspezifisches SyntaxKind-Typargument für den zugehörigen Typparameter "{0}". Andernfalls kann die registrierte Analyseaktion während der Analyse nicht aufgerufen werden.
es: Los métodos Register específicos del lenguaje de DiagnosticAnalyzer, como RegisterSyntaxNodeAction, RegisterCodeBlockStartAction y RegisterCodeBlockEndAction, esperan un argumento de tipo “SyntaxKind” específico del lenguaje para el parámetro de tipo “{0}”. De lo contrario, la acción del analizador registrada no se puede invocar nunca durante el análisis.
fr: Les méthodes Register spécifiques au langage de DiagnosticAnalyzer, par exemple RegisterSyntaxNodeAction, RegisterCodeBlockStartAction et RegisterCodeBlockEndAction, attendent un argument de type 'SyntaxKind' spécifique au langage pour son paramètre de type '{0}'. Sinon, l'action d'analyseur inscrite ne peut jamais être appelée durant l'analyse.
it: Con i metodi Register specifici della lingua di DiagnosticAnalyzer, come RegisterSyntaxNodeAction, RegisterCodeBlockStartAction e RegisterCodeBlockEndAction, è previsto un argomento tipo 'SyntaxKind' specifico della lingua per il parametro di tipo '{0}'. In caso contrario, l'azione registrata dell'analizzatore non può essere mai richiamata durante l'analisi.
ko: RegisterSyntaxNodeAction, RegisterCodeBlockStartAction 및 RegisterCodeBlockEndAction 등의 DiagnosticAnalyzer의 언어 특정 Register 메서드에는 '{0}' 형식 매개 변수에 대한 언어 특정 'SyntaxKind' 형식 인수를 사용해야 합니다. 그러지 않으면 등록된 분석기 작업이 분석하는 동안 호출되지 않습니다.
pl: Specyficzne dla języka metody Register analizatora DiagnosticAnalyzer, takie jak RegisterSyntaxNodeAction, RegisterCodeBlockStartAction i RegisterCodeBlockEndAction, oczekują specyficznego dla języka argumentu typu „SyntaxKind” dla swojego parametru typu „{0}”. W przeciwnym razie zarejestrowana akcja analizatora może nigdy nie zostać wywołana podczas analizy.
ru: Языковые методы Register DiagnosticAnalyzer, такие как RegisterSyntaxNodeAction, RegisterCodeBlockStartAction и RegisterCodeBlockEndAction, ожидают языковой аргумент типа "SyntaxKind" для параметра типа "{0}". В противном случае зарегистрированное действие анализатора невозможно будет вызвать во время анализа.
tr: DiagnosticAnalyzer’ın dile özgü Register yöntemleri (örneğin RegisterSyntaxNodeAction, RegisterCodeBlockStartAction ve RegisterCodeBlockEndAction) '{0}' tür parametresi için dile özgü bir 'SyntaxKind' tür bağımsız değişkeni bekliyor. Aksi takdirde, kayıtlı çözümleyici eylemi çözümleme sırasında hiçbir zaman çağrılamaz.
zh_hans: DiagnosticAnalyzer 的语言特定的 Register 方法，例如 RegisterSyntaxNodeAction、RegisterCodeBlockStartAction 和 RegisterCodeBlockEndAction，需要一个语言特定的 "SyntaxKind" 类型实参用于“{0}”类型形参。否则，分析过程中将不会调用已注册的分析器操作。
zh_hant: DiagnosticAnalyzer 語言專屬的 Register 方法 (例如 RegisterSyntaxNodeAction、RegisterCodeBlockStartAction 與 RegisterCodeBlockEndAction)，必須是其 '{0}' 型別參數的語言專屬 'SyntaxKind' 型別引數。否則，分析期間絕不會叫用註冊的分析器動作。

# StartActionWithOnlyEndActionTitle
source: Start action has no registered non-end actions
de: Für die Startaktion wurden keine Nicht-Endaktionen registriert
es: La acción de inicio no tiene registrada ninguna acción no final
fr: L'action de démarrage n'a aucune action inscrite qui n'est pas une action de fin
it: Per l'azione di avvio non esistono azioni non di fine registrate
ko: 시작 작업에 등록된 비종료 작업이 없음
pl: Akcja uruchamiania nie ma zarejestrowanych akcji niekończących
ru: Начальное действие не содержит зарегистрированные неконечные действия
tr: Başlangıç eyleminin kayıtlı bitiş eylemi olmayan eylemi yok
zh_hans: 启动操作未注册有任何非结束操作
zh_hant: 起始動作沒有任何註冊的非結束動作
