Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# UseUniqueDiagnosticIdDescription
source: DiagnosticId must be unique across analyzers.
de: Die DiagnosticId muss für jedes Analysetool eindeutig sein.
es: El valor de DiagnosticId debe ser único en los analizadores.
fr: Le DiagnosticId doit être unique sur l'ensemble des analyseurs.
it: L'ID diagnostica deve essere univoco tra gli analizzatori.
ko: 진단 ID는 분석기 간에 고유해야 합니다.
pl: Wartość DiagnosticId musi być unikatowa między analizatorami.
ru: Анализаторы должны иметь уникальный диагностический идентификатор.
tr: DiagnosticId çözümleyiciler arasında benzersiz olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须唯一。
zh_hant: 分析器的診斷識別碼必須是唯一的。

# UseCategoriesFromSpecifiedRangeTitle
source: Category for analyzers must be from the specified values
de: Kategorie für Analysetools muss einem der angegebenen Werte entsprechen
es: La categoría de los analizadores debe proceder de los valores especificados
fr: La catégorie pour les analyseurs doit provenir des valeurs spécifiées
it: La categoria per gli analizzatori deve essere inclusa nei valori specificati
ko: 분석기 범주는 지정된 값이어야 함
pl: Kategoria dla analizatora musi być jedną z określonych wartości
ru: Категория для анализаторов должна иметь одно из заданных значений
tr: Çözümleyiciler için kategori, belirtilen değerlerden biri olmalıdır
zh_hans: 分析器的类别必须源自指定的值
zh_hant: 分析器的類別必須來自指定的值

# UseCategoriesFromSpecifiedRangeMessage
source: Category '{0}' is not from the allowed categories specified in the file '{1}'
de: Die Kategorie "{0}" ist nicht in den zulässigen Kategorien enthalten, die in der Datei "{1}" angegeben sind.
es: La categoría "{0}" no se corresponde con las categorías permitidas que se especifican en el archivo "{1}".
fr: La catégorie '{0}' ne provient pas des catégories autorisées spécifiées dans le fichier '{1}'
it: La categoria '{0}' non è inclusa nelle categorie consentite specificate nel file '{1}'
ko: '{0}' 범주가 '{1}' 파일에 지정된 허용 범주에 속해 있지 않습니다.
pl: Kategoria „{0}” nie jest jedną z dozwolonych kategorii określonych w pliku „{1}”
ru: Категория "{0}" не относится к разрешенным категориям, заданным в файле "{1}".
tr: '{0}' kategorisi '{1}' dosyasında belirtilen izin verilen kategoriler arasında değil
zh_hans: 类别“{0}”不属于文件“{1}”中指定的允许类别
zh_hant: 類別 '{0}' 並不是來自檔案 '{1}' 中指定的允許類別

# UseCategoriesFromSpecifiedRangeDescription
source: Category for analyzers must be from the specified values.
de: Die Kategorie für Analysetools muss einem der angegebenen Werte entsprechen.
es: La categoría de los analizadores debe proceder de los valores especificados.
fr: La catégorie pour les analyseurs doit provenir des valeurs spécifiées.
it: La categoria per gli analizzatori deve essere inclusa nei valori specificati.
ko: 분석기에 대한 범주는 지정된 값이어야 합니다.
pl: Kategoria dla analizatora musi być jedną z określonych wartości.
ru: Категория для анализаторов должна иметь одно из заданных значений.
tr: Çözümleyiciler için kategori belirtilen değerlerden biri olmalıdır.
zh_hans: 分析器的类别必须源自指定的值。
zh_hant: 分析器的類別必須來自指定的值。

# AnalyzerCategoryAndIdRangeFileInvalidTitle
source: Invalid entry in analyzer category and diagnostic ID range specification file
de: Ungültiger Eintrag in der Spezifikationsdatei für Kategorien und Diagnose-ID-Bereich der Analysetools
es: Entrada no válida en la categoría del analizador y el archivo de especificación del rango de identificadores de diagnóstico
fr: Entrée non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic
it: La voce nella categoria dell'analizzatore e nel file di specifica dell'intervallo degli ID diagnostica non è valida
ko: 분석기 범주 및 진단 ID 범위 사양 파일의 항목이 잘못됨
pl: Nieprawidłowy wpis w pliku specyfikacji zakresu kategorii analizatora i identyfikatora diagnostycznego
ru: Недопустимая запись в файле спецификации с категориями анализаторов и диапазоном диагностических идентификаторов
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasındaki girdi geçersiz
zh_hans: 分析器类别和诊断 ID 范围规定文件中的条目无效
zh_hant: 分析器類別中的項目與診斷識別碼範圍規格檔案無效

# AnalyzerCategoryAndIdRangeFileInvalidMessage
source: Invalid entry '{0}' in analyzer category and diagnostic ID range specification file '{1}'
de: Ungültiger Eintrag "{0}" in der Spezifikationsdatei "{1}" für Kategorien und Diagnose-ID-Bereich der Analysetools.
es: Entrada "{0}" no válida en la categoría del analizador y el archivo de especificación del rango de identificadores de diagnóstico "{1}".
fr: Entrée '{0}' non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic '{1}'
it: La voce '{0}' nella categoria dell'analizzatore e nel file '{1}' di specifica dell'intervallo degli ID diagnostica non è valida
ko: 분석기 범주 및 진단 ID 범위 사양 파일 '{1}'의 '{0}' 항목이 잘못되었습니다.
pl: Nieprawidłowy wpis „{0}” w pliku specyfikacji zakresu kategorii analizatora i identyfikatora diagnostycznego „{1}”
ru: Недопустимая запись "{0}" в файле "{1}" с категориями анализаторов и диапазоном диагностических идентификаторов.
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasında ('{1}'), '{0}' girdisi geçersiz
zh_hans: 分析器类别和诊断 ID 范围规定文件“{1}”中的条目“{0}”无效
zh_hant: 分析器類別中的項目 '{0}' 與診斷識別碼範圍規格檔案 '{1}' 無效

# AnalyzerCategoryAndIdRangeFileInvalidDescription
source: Invalid entry in analyzer category and diagnostic ID range specification file.
de: Ungültiger Eintrag in der Spezifikationsdatei für Kategorien und Diagnose-ID-Bereich der Analysetools.
es: Entrada no válida en la categoría del analizador y el archivo de especificación del rango de identificadores de diagnóstico.
fr: Entrée non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic.
it: La voce nella categoria dell'analizzatore e nel file di specifica dell'intervallo degli ID diagnostica non è valida.
ko: 분석기 범주 및 진단 ID 범위 지정 파일의 항목이 잘못되었습니다.
pl: Nieprawidłowy wpis w pliku specyfikacji zakresu kategorii analizatora i identyfikatora diagnostycznego.
ru: Недопустимая запись в файле с категориями анализаторов и диапазоном диагностических идентификаторов.
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasında geçersiz girdi.
zh_hans: 分析器类别和诊断 ID 范围规定文件中的条目无效。
zh_hant: 分析器類別中的項目與診斷識別碼規格檔案無效。

# DiagnosticIdMustBeAConstantTitle
source: DiagnosticId for analyzers must be a non-null constant
de: Die DiagnosticId für Analysetools muss eine Konstante ungleich NULL sein
es: El valor DiagnosticId de los analizadores debe ser una constante no nula
fr: Le DiagnosticId pour les analyseurs doit être une constante non-null
it: Gli ID diagnostica per gli analizzatori devono essere una costante non Null
ko: 분석기의 진단 ID는 null이 아닌 상수여야 함
pl: Element DiagnosticId dla analizatorów musi być stałą o wartości innej niż null
ru: Диагностический идентификатор для анализаторов должен быть константой, отличной от NULL
tr: Çözümleyiciler için DiagnosticId null olmayan bir sabit değer olmalıdır
zh_hans: 分析器的 DiagnosticId 必须为非 null 常量
zh_hant: 分析器之診斷識別碼必須是非 null 的常數

# DiagnosticIdMustBeAConstantMessage
source: Diagnostic Id for rule '{0}' must be a non-null constant
de: Die Diagnose-ID für die Regel "{0}" muss eine Konstante ungleich NULL sein.
es: El identificador de diagnóstico de la regla "{0}" debe ser una constante no nula.
fr: L'ID de diagnostic pour la règle '{0}' doit être une constante non-null
it: L'ID diagnostica per la regola '{0}' deve essere una costante non Null
ko: '{0}' 규칙의 진단 ID는 null이 아닌 상수여야 합니다.
pl: Identyfikator diagnostyczny dla reguły „{0}” musi być stałą o wartości innej niż null
ru: Диагностический идентификатор для правила "{0}" должен быть константой, отличной от NULL.
tr: '{0}' kuralı için tanılama kimliği null olmayan bir sabit değer olmalıdır
zh_hans: 规则“{0}”的诊断 ID 必须为非 null 常量
zh_hant: 規則 '{0}' 的診斷識別碼必須是非 null 之常數

# DiagnosticIdMustBeAConstantDescription
source: DiagnosticId for analyzers must be a non-null constant.
de: Die DiagnosticId für Analysetools muss eine Konstante ungleich NULL sein.
es: El valor DiagnosticId de los analizadores debe ser una constante no nula.
fr: Le DiagnosticId pour les analyseurs doit être une constante non-null.
it: Gli ID diagnostica per gli analizzatori devono essere una costante non Null.
ko: 분석기에 대한 진단 ID는 null이 아닌 상수여야 합니다.
pl: Element DiagnosticId dla analizatorów musi być stałą o wartości innej niż null.
ru: Диагностический идентификатор для анализаторов должен быть константой, отличной от NULL.
tr: Çözümleyiciler için DiagnosticId null olmayan bir sabit değer olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为非 null 常量。
zh_hant: 分析器的診斷識別碼必須是非 null 之常數。

# DoNotUseTypesFromAssemblyRuleDescription
source: Diagnostic analyzer types should not use types from Workspaces assemblies. Workspaces assemblies are only available when the analyzer executes in Visual Studio IDE live analysis, but are not available during command line build. Referencing types from Workspaces assemblies will lead to runtime exception during analyzer execution in command line build.
de: Diagnoseanalysetypen dürfen keine Typen aus Arbeitsbereichassemblys verwenden. Arbeitsbereichassemblys sind nur verfügbar, wenn das Analysetool in der Visual Studio IDE-Liveanalyse ausgeführt wird, nicht jedoch während einer Builderstellung über die Befehlszeile. Das Referenzieren von Typen aus Arbeitsbereichassemblys führt zu Laufzeitausnahmen bei der Analyseausführung während der Builderstellung über die Befehlszeile.
es: Los tipos de analizador de diagnóstico no deben usar tipos de ensamblados de Áreas de trabajo. Los ensamblados de Áreas de trabajo solo están disponibles cuando el analizador se ejecuta en el análisis activo del IDE de Visual Studio, pero no están disponibles durante la compilación de la línea de comando. Hacer referencia a tipos de ensamblados de Áreas de trabajo dará lugar a la excepción de tiempo de ejecución durante la ejecución del analizador en la compilación de línea de comando.
fr: Les types d'analyseur de diagnostic ne doivent pas utiliser les types d'assemblys Espaces de travail. Les assemblys Espaces de travail sont disponibles uniquement quand l'analyseur s'exécute dans l'analyse en direct de l'IDE Visual Studio, mais ne sont pas disponibles pendant l'exécution de la ligne de commande build. Le référencement de types d'assemblys Espaces de travail lève une exception de runtime pendant l'exécution de l'analyseur dans la ligne de commande build.
it: I tipi di analizzatore diagnostico non devono usare tipi degli assembly di aree di lavoro. Gli assembly di aree di lavoro sono disponibili solo quando l'analizzatore viene eseguito nell'analisi in tempo reale dell'IDE di Visual Studio, ma non sono disponibili durante la compilazione dalla riga di comando. Se si fa riferimento a tipi di assembly di aree di lavoro, si verificherà un'eccezione di runtime durante l'esecuzione dell'analizzatore nella compilazione dalla riga di comando.
ko: 진단 분석기 형식은 작업 영역 어셈블리의 형식을 사용해서는 안 됩니다. 작업 영역 어셈블리는 분석기가 Visual Studio IDE 라이브 분석에서 실행될 때에만 사용 가능하지만, 명령줄 빌드 중에는 사용할 수 없습니다. 작업 영역 어셈블리의 형식을 참조하면 명령줄 빌드에서 분석기 실행 중 런타임 예외가 발생합니다.
pl: Typy analizatora diagnostycznego nie mogą używać typów z zestawów Workspaces. Zestawy Workspaces są dostępne tylko wtedy, gdy analizator działa w ramach analizy na żywo w programie Visual Studio IDE, ale nie są dostępne podczas kompilacji wiersza polecenia. Odwołania do typów z zestawów Workspaces będą powodować wyjątek środowiska uruchomieniowego podczas wykonywania analizatora podczas kompilacji wiersza polecenia.
ru: Типы диагностического анализатора не должны использовать типы из сборок рабочих областей. Сборки рабочих областей доступны только при запуске анализатора в интерактивном анализе среды Visual Studio, но они недоступны во время сборки из командной строки. Ссылки на типы из сборок рабочих областей приведут к возникновению исключения в среде выполнения при запуске анализаторе в сборке командной строки.
tr: Tanılama çözümleyicisi türleri, Çalışma Alanları bütünleştirilmiş kodlarından alınan türleri kullanmamalıdır. Çalışma Alanları bütünleştirilmiş kodları yalnızca çözümleyici Visual Studio IDE canlı analizinde yürütülüyorsa kullanılabilir, ancak komut satırı derlemesi sırasında kullanılamaz. Çalışma Alanları bütünleştirilmiş kodlarından türlere başvurulması, komut satırı derlemesinde çözümleyici yürütüldüğü sırada çalışma zamanı özel durumuna yol açar.
zh_hans: 诊断分析器类型不应使用 Workspaces 程序集中的类型。分析器在 Visual Studio IDE 实时分析中执行时，Workspaces 程序集才可用，但在命令行生成期间不可用。命令行生成中的分析器执行期间，从 Workspaces 程序集引用类型将导致运行时异常。
zh_hant: 診斷分析器類型不應使用來自工作區組件的類型。工作區組件僅在分析器於 Visual Studio IDE 即時分析中執行時可用，而在命令列建置期間不可用。當分析器在命令列建置期間執行時，參考來自工作區組件的類型會導致執行階段例外狀況。

# DoNotUseTypesFromAssemblyRuleTitle
source: Do not use types from Workspaces assembly in an analyzer
de: Verwenden Sie im Analysetool keine Typen aus Arbeitsbereichassemblys.
es: No use tipos del ensamblado de Áreas de trabajo en un analizador
fr: Ne pas utiliser les types d'assembly Espaces de travail dans un analyseur
it: Non usare tipi di assembly di aree di lavoro in un analizzatore
ko: 분석기에서 작업 영역 어셈블리의 형식을 사용하지 마세요.
pl: Nie używaj typów z zestawu Workspaces w analizatorze
ru: Не используйте в анализаторе типы из сборки рабочих областей
tr: Bir çözümleyicide Çalışma Alanları bütünleştirilmiş kodundan alınan türleri kullanmayın
zh_hans: 不要在分析器中使用来自 Workspaces 程序集的类型
zh_hant: 不要使用分析器中來自工作區組件的類型

# DoNotUseTypesFromAssemblyRuleIndirectMessage
source: Change diagnostic analyzer type '{0}' to remove all direct and/or indirect accesses to type(s) '{1}', which access type(s) '{2}'
de: Ändern Sie den Diagnoseanalysetyp "{0}", um alle direkten und/oder indirekten Zugriffe auf die Typen "{1}" zu entfernen, die auf die Typen "{2}" zugreifen.
es: Cambie el tipo de analizador de diagnóstico "{0}" para quitar todo acceso directo o indirecto a los tipos "{1}", que accede a los tipos "{2}"
fr: Changer le type d'analyseur de diagnostic '{0}' pour supprimer tous les accès directs et/ou indirects aux types '{1}', qui accèdent aux types '{2}'
it: Modificare il tipo di analizzatore diagnostico '{0}' in modo da rimuovere tutti gli accessi diretti e/o indiretti al tipo o ai tipi '{1}', che accedono al tipo o ai tipi '{2}'
ko: 진단 분석기 형식 '{0}'을(를) 변경하여 '{1}' 형식에 대해 액세스 형식이 '{2}'인 모든 직접 및/또는 간접 액세스를 제거합니다.
pl: Zmień typ analizatora diagnostycznego „{0}”, aby usunąć cały bezpośredni i/lub pośredni dostęp do typów „{1}”, który pozwala uzyskać dostęp do typów „{2}”
ru: Измените тип диагностического анализатора "{0}" и удалите из него все возможности прямого и непрямого доступа к типам "{1}", которые обращаются к типам "{2}"
tr: '{2}' türüne erişen '{1}' türüne doğrudan veya dolaylı tüm erişimleri kaldırmak için tanılama çözümleyici türünü ('{0}') değiştirin
zh_hans: 更改诊断分析器类型“{0}”，删除对访问类型“{2}”的类型“{1}”的所有的直接和/或间接访问
zh_hant: 變更診斷分析器類型 '{0}' 會移除存取類型 '{2}' 之類型 '{1}' 的所有直接及 (或) 間接存取

# DoNotUseTypesFromAssemblyRuleDirectMessage
source: Change diagnostic analyzer type '{0}' to remove all direct accesses to type(s) '{1}'
de: Ändern Sie den Diagnoseanalysetyp "{0}", um alle direkten Zugriffe auf die Typen "{1}" zu entfernen.
es: Cambie el tipo de analizador de diagnóstico "{0}" para quitar todo acceso directo a los tipos "{1}"
fr: Changer le type d'analyseur de diagnostic '{0}' pour supprimer tous les accès directs aux types '{1}'
it: Modificare il tipo di analizzatore diagnostico '{0}' in modo da rimuovere tutti gli accessi diretti al tipo o ai tipi '{1}'
ko: 진단 분석기 형식 '{0}'을(를) 변경하여 '{1}' 형식에 대해 모든 직접 액세스를 제거합니다.
pl: Zmień typ analizatora diagnostycznego „{0}”, aby usunąć cały bezpośredni dostęp do typów „{1}”
ru: Измените тип диагностического анализатора "{0}" и удалите из него все возможности прямого доступа к типам "{1}"
tr: '{1}' türüne yönelik tüm doğrudan erişimleri kaldırmak için tanılama çözümleyici türünü ('{0}') değiştirin
zh_hans: 更改诊断分析器类型“{0}”以删除对类型“{1}”的所有直接访问
zh_hant: 變更診斷分析器類型 '{0}' 可移除類型 '{1}' 的所有直接存取

# UpgradeMSBuildWorkspaceDescription
source: MSBuildWorkspace has moved to the Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet package and there are breaking API changes.
de: MSBuildWorkspace wurde in das NuGet-Paket "Microsoft.CodeAnalysis.Workspaces.MSBuild" verschoben, in dem Breaking Changes an APIs vorgenommen wurden.
es: MSBuildWorkspacese ha movido al paquete Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet y hay cambios de API novedosos.
fr: MSBuildWorkspace a été déplacé vers le package Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet. Il existe des changements d'API importants.
it: MSBuildWorkspace è stato spostato nel pacchetto NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild e sono presenti importanti novità relative alle API.
ko: MSBuildWorkspace가 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 패키지로 이동되었으며 새로운 API 변경 내용이 있습니다.
pl: Klasa MSBuildWorkspace została przeniesiona do pakietu Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet i istnieją zmiany interfejsu API powodujące niezgodność.
ru: Класс MSBuildWorkspace перемещен в пакет NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild, и в API внесены существенные изменения.
tr: MSBuildWorkspace, Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet paketini taşıdı ve hataya neden olan API değişiklikleri var.
zh_hans: MSBuildWorkspace 已经转移到了 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 包，并且存在中断的 API 更改。
zh_hant: MSBuildWorkspace 已移至 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 套件，且目前有最新的 API 變更。

# UpgradeMSBuildWorkspaceMessage
source: Please upgrade MSBuildWorkspace by adding a package reference to the Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet package. See https://go.microsoft.com/fwlink/?linkid=874285 for details on using MSBuildWorkspace successfully.
de: Führen Sie ein Upgrade für MSBuildWorkspace durch, indem Sie einen Paketverweis auf das NuGet-Paket "Microsoft.CodeAnalysis.Workspaces.MSBuild" hinzufügen. Einzelheiten zur richtigen Verwendung von MSBuildWorkspace finden Sie unter https://go.microsoft.com/fwlink/?linkid=874285.
es: Actualice MSBuildWorkspace agregando una referencia de paquete al paquete de NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Consulte https://go.microsoft.com/fwlink/?linkid=874285 para obtener información sobre cómo utilizar correctamente MSBuildWorkspace.
fr: Mettez à niveau MSBuildWorkspace en ajoutant une référence de package au package NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Pour plus d'informations sur l'utilisation correcte de MSBuildWorkspace, consultez https://go.microsoft.com/fwlink/?linkid=874285.
it: Aggiornare MSBuildWorkspace aggiungendo un riferimento al pacchetto NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Per dettagli sull'uso corretto di MSBuildWorkspace, vedere https://go.microsoft.com/fwlink/?linkid=874285.
ko: Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 패키지에 패키지 참조를 추가하여 MSBuildWorkspace를 업그레이드하세요. 성공적인 MSBuildWorkspace 사용에 대한 자세한 내용은 https://go.microsoft.com/fwlink/?linkid=874285를 참조하세요.
pl: Uaktualnij klasę MSBuildWorkspace przez dodanie odwołania do pakietu Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet. Zobacz https://go.microsoft.com/fwlink/?linkid=874285, aby uzyskać szczegółowe informacje na temat pomyślnego korzystania z klasy MSBuildWorkspace.
ru: Обновите MSBuildWorkspace, добавив ссылку на пакет NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Дополнительные сведения об использовании MSBuildWorkspace: https://go.microsoft.com/fwlink/?linkid=874285.
tr: Lütfen Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet paketine bir paket başvurusu ekleyerek MSBuildWorkspace’i yükseltin. MSBuildWorkspace’i başarıyla kullanma hakkında ayrıntılı bilgi için bkz. https://go.microsoft.com/fwlink/?linkid=874285.
zh_hans: 请通过向 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 包添加包引用来升级 MSBuildWorkspace。有关成功使用 MSBuildWorkspace 的详细信息，请参阅 https://go.microsoft.com/fwlink/?linkid=874285。
zh_hant: 請將套件參考新增至 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 套件，來升級 MSBuildWorkspace。如需成功使用 MSBuildWorkspace 的詳細資料，請參閱 https://go.microsoft.com/fwlink/?linkid=874285。

# UpgradeMSBuildWorkspaceTitle
source: Upgrade MSBuildWorkspace
de: Upgrade von MSBuildWorkspace
es: Actualización de MSBuildWorkspace
fr: Mettre à niveau MSBuildWorkspace
it: Aggiorna MSBuildWorkspace
ko: MSBuildWorkspace 업그레이드
pl: Uaktualnianie klasy MSBuildWorkspace
ru: Обновление MSBuildWorkspace
tr: MSBuildWorkspace’i yükseltir
zh_hans: 升级 MSBuildWorkspace
zh_hant: 升級 MSBuildWorkspace
