Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# UseLocalizableStringsInDescriptorDescription
source: If your diagnostic analyzer and it's reported diagnostics need to be localizable, then the supported DiagnosticDescriptors used for constructing the diagnostics must also be localizable. If so, then localizable argument(s) must be provided for parameter 'title' (and optionally 'description') to the diagnostic descriptor constructor to ensure that the descriptor is localizable.
de: Wenn Ihr Diagnoseanalysetool und die zugehörigen gemeldeten Diagnosen lokalisierbar sein sollen, müssen auch die unterstützten DiagnosticDescriptors für die Erstellung der Diagnose lokalisierbar sein. In diesem Fall müssen dem Konstruktor des Diagnosedeskriptors die lokalisierbaren Argumente für den Parameter "title" (und optional "description") angegeben werden, um sicherzustellen, dass der Deskriptor lokalisierbar ist.
es: Si el analizador de diagnóstico y los diagnósticos notificados deben ser localizables, los descriptores DiagnosticDescriptor usados para crear los diagnósticos también deben ser localizables. En ese caso, deben proporcionarse argumentos localizables para el parámetro “title” (y, opcionalmente, para “description”) al constructor descriptor de diagnósticos a fin de asegurarse de que el descriptor es localizable.
fr: Si votre analyseur de diagnostic et ses rapports de diagnostics doivent être localisables, les DiagnosticDescriptors pris en charge et utilisés pour la construction des diagnostics doivent également être localisables. Dans ce cas, vous devez fournir des arguments localisables pour le paramètre 'title' (et éventuellement 'description') au constructeur de descripteur de diagnostic pour vérifier que le descripteur est localisable.
it: Se l'analizzatore diagnostico e i relativi dati di diagnostica restituiti devono essere localizzabili, devono essere localizzabili anche gli elementi DiagnosticDescriptor supportati usati per costruire i dati di diagnostica. In tal caso, è necessario fornire argomenti localizzabili per il parametro 'title' (e facoltativamente per 'description') al costruttore del descrittore di diagnostica per garantire che il descrittore sia localizzabile.
ko: 진단 분석기 및 보고된 진단을 현지화해야 하는 경우 진단을 생성하는 데 사용된 지원되는 DiagnosticDescriptors도 현지화할 수 있어야 합니다. 이 경우 매개 변수 '제목'(선택적으로 '설명')에 대해 현지화할 수 있는 인수를 진단 설명자 생성자에 제공하여 설명자를 현지화할 수 있는지 확인해야 합니다.
pl: Jeśli analizator diagnostyczny i jego zgłaszana diagnostyka muszą umożliwiać lokalizację, wówczas obsługiwane deskryptory DiagnosticDescriptors użyte do konstruowania diagnostyki muszą również umożliwiać lokalizację. W takim przypadku umożliwiające lokalizację argumenty muszą zostać udostępnione dla parametru „title” (i opcjonalnie „description”) i konstruktora deskryptora diagnostycznego, aby zapewnić, że deskryptor umożliwia lokalizację.
ru: Чтобы предусмотреть возможность локализации для вашего диагностического анализатора и предоставляемых им сведений, нужно сделать локализуемыми и поддерживаемые DiagnosticDescriptor, используемые для создания диагностики. Для этого нужно предоставить локализуемые аргументы для параметра "title" (и дополнительно для "description") в конструкторе дескриптора диагностики, чтобы сделать дескриптор локализуемым.
tr: Tanılama çözümleyicinizin ve raporlanan tanılamalarının yerelleştirilebilir olması gerekiyorsa, tanılamaları oluşturmak için kullanılan desteklenen DiagnosticDescriptors’ın da yerelleştirilebilir olması gerekir. Öyleyse, tanımlayıcının yerelleştirilebilir olduğundan emin olmak için tanılama tanımlayıcısı oluşturucusuna 'title' (ve isteğe bağlı olarak 'description') parametresi için yerelleştirilebilir bağımsız değişkenlerin sağlanması gerekir.
zh_hans: 如果诊断分析器及其报告的诊断需要能够本地化，则用于构建诊断的受支持 DiagnosticDescriptors 也必须可本地化。若是如此，必须为诊断描述符构造函数的 “title” 形参(和可选 “description”)提供可本地化的实参，确保描述符可本地化。
zh_hant: 如果診斷分析器及其回報的診斷必須可當地語系化，則用於建構診斷之受支援的 DiagnosticDescriptors，也必須可當地語系化。若是如此，則必須為診斷描述元建構函式，對參數 'title' (及選擇性 'description') 提供可當地語系化引數，以確保該描述元可當地語系化。

# DoNotStorePerCompilationDataOntoFieldsMessage
source: Avoid storing per-compilation data of type '{0}' into the fields of a diagnostic analyzer
de: Vermeiden Sie die Speicherung kompilierungsbezogener Daten des Typs "{0}" in den Feldern eines Diagnoseanalysetools.
es: Evite almacenar datos por compilación de tipo "{0}" en los campos de un analizador de diagnóstico.
fr: Évitez de stocker des données par compilation de type '{0}' dans les champs d'un analyseur de diagnostic
it: Evitare di archiviare dati per compilazione di tipo '{0}' nei campi di un analizzatore diagnostico
ko: '{0}' 형식의 컴파일당 데이터를 진단 분석기의 필드에 저장하지 마세요.
pl: Unikaj zapisywania danych poszczególnych kompilacji danych typu „{0}” w polach analizatora diagnostycznego
ru: Не храните данные типа "{0}" об отдельных компиляциях в полях диагностического анализатора.
tr: Tanılama çözümleyicisinin alanlarına '{0}' türünde derleme başına veriler depolamaktan kaçının
zh_hans: 不要将类型为“{0}”的每次编译的数据存储到诊断分析器的字段中
zh_hant: 避免將型別 '{0}' 的各個編譯資料，儲存至診斷分析器的欄位中

# DoNotStorePerCompilationDataOntoFieldsTitle
source: Avoid storing per-compilation data into the fields of a diagnostic analyzer
de: Speicherung kompilierungsbezogener Daten in den Feldern eines Diagnoseanalysetools vermeiden
es: Evite almacenar datos por compilación en los campos de un analizador de diagnóstico
fr: Évitez de stocker des données par compilation dans les champs d'un analyseur de diagnostic
it: Evitare di archiviare dati per compilazione nei campi di un analizzatore diagnostico
ko: 컴파일당 데이터를 진단 분석기의 필드에 저장하면 안 됨
pl: Unikaj zapisywania danych poszczególnych kompilacji w polach analizatora diagnostycznego
ru: Нежелательность хранения данных об отдельных компиляциях в полях диагностического анализатора
tr: Tanılama çözümleyicisinin alanlarına derleme başına veriler depolamaktan kaçının
zh_hans: 不要将每次编译的数据存储到诊断分析器的字段中
zh_hant: 避免將各個編譯的資料，儲存至診斷分析器的欄位中

# DoNotStorePerCompilationDataOntoFieldsDescription
source: Instance of a diagnostic analyzer might outlive the lifetime of compilation. Hence, storing per-compilation data, such as symbols, into the fields of a diagnostic analyzer might cause stale compilations to stay alive and cause memory leaks. Instead, you should store this data on a separate type instantiated in a compilation start action, registered using '{0}.{1}' API. An instance of this type will be created per-compilation and it won't outlive compilation's lifetime, hence avoiding memory leaks.
de: Die Instanz des Diagnoseanalysetools kann die Lebensdauer der Kompilierung überdauern. Daher kann die Speicherung kompilierungsbezogener Daten (z. B. Symbole) in den Feldern eines Diagnoseanalysetools zur Beibehaltung veralteter Kompilierungen und zu Arbeitsspeicherverlusten führen. Speichern Sie diese Daten stattdessen in einem separaten Typ, der in einer Kompilierungsstartaktion instanziiert wird, die über die {0}.{1}-API registriert ist. Eine Instanz dieses Typs wird pro Kompilierung erstellt und überdauert nicht die Lebensdauer der Kompilierung, sodass Arbeitsspeicherverluste vermieden werden.
es: Una instancia de un analizador de diagnóstico puede superar la duración de la compilación. Así, almacenar datos por compilación (por ejemplo, símbolos) en los campos de un analizador de diagnóstico puede hacer que compilaciones obsoletas se mantengan activas y causar fugas de memoria. En su lugar, debe almacenar estos datos en un tipo independiente del que se haya creado una instancia en una acción de inicio de compilación, registrado con la API “{0}.{1}”. Por cada compilación se crea una instancia de este tipo que no sobrepasa la duración de la compilación, lo que evita fugas de memoria.
fr: L'instance d'un analyseur de diagnostic peut vivre au-delà de la durée de vie de la compilation. Ainsi, le stockage des données par compilation, telles que les symboles, dans les champs d'un analyseur de diagnostic peut entraîner la persistance de compilations obsolètes et provoquer des fuites de mémoire. À la place, vous devez stocker ces données dans un type distinct instancié dans une action de démarrage de compilation, inscrite à l'aide de l'API '{0}.{1}'. Une instance de ce type est créée par compilation et ne survit pas à la durée de vie de la compilation, ce qui permet ainsi d'éviter les fuites de mémoire.
it: L'istanza di un analizzatore diagnostico potrebbe sopravvivere alla durata della compilazione. Di conseguenza, se si archiviano i dati per compilazione, ad esempio i simboli, nei campi di un analizzatore diagnostico, compilazioni obsolete potrebbero continuare a esistere e causare perdite di memoria. È invece consigliabile archiviare questi dati in un tipo separato di cui viene creata un'istanza in un'azione di avvio della compilazione, registrata con l'API '{0}.{1}'. Un'istanza di questo tipo verrà creata per compilazione e non sopravviverà alla durata della compilazione, evitando in tal modo perdite di memoria.
ko: 진단 분석기의 인스턴스는 컴파일 수명보다 더 오래 활성화될 수 있습니다. 그러므로 기호와 같은 컴파일당 데이터를 진단 분석기 필드에 저장하면 활성화된 컴파일의 상태가 부실하여 메모리 손실 문제를 일으킬 수 있습니다. 대신 인스턴스화된 별도 형식의 데이터를 '{0}.{1}' API를 사용하여 등록된 컴파일 시작 작업에 저장해야 합니다. 이 형식의 컴파일당 인스턴스가 만들어지며 컴파일의 수명보다 오래 활성화되지 않아 메모리 손실을 방지할 수 있습니다.
pl: Wystąpienie analizatora diagnostycznego może istnieć dłużej niż czas życia kompilacji. Stąd przechowywanie danych poszczególnych kompilacji, takich jak symbole, w polach analizatora diagnostycznego może powodować przedłużenie istnienia nieaktualnych kompilacji i przecieki pamięci. Zamiast tego należy przechowywać te dane w oddzielnym typie, dla którego utworzono wystąpienie w akcji uruchamiania kompilacji, zarejestrowanym przy użyciu interfejsu API „{0}.{1}”. Wystąpienie tego typu zostanie utworzone dla poszczególnych kompilacji i nie będzie istnieć dłużej niż czas życia kompilacji, co pozwoli uniknąć przecieków pamięci.
ru: Экземпляр диагностического анализатора может сохраняться и после истечения времени существования компиляции. Поэтому хранение данных об отдельных компиляциях, например символов, в полях диагностического анализатора может привести к тому, что устаревшие компиляции останутся активными и вызовут утечки памяти. Вместо этого такие данные следует хранить в отдельном типе, экземпляр которого создается в начальном действии компиляции, и зарегистрировать с помощью API "{0}.{1}". Экземпляр этого типа создается для каждой компиляции и прекращает действовать до истечения ее времени существования, что позволяет предотвратить утечки памяти.
tr: Bir tanılama çözümleyicisi, derlemenin ömrüne daha uzun süre kullanılabilir. Bu nedenle, semboller gibi derleme başına simgelerin bir tanılama çözümleyicisinin alanlarında depolanması, eski derlemelerin kullanılmaya devam ederek bellek sızıntıları oluşturmasına neden olabilir. Bunun yerine, bu verileri '{0}.{1}' API’si kullanılarak kaydedilmiş bir derleme başlatma eylemi içinde örneklenen ayrı bir tür üzerinde depolamanız gerekir. Derleme başına bu türde bir örnek oluşturulur ve derlemenin ömründen daha uzun süre kullanılmayarak bellek sızıntıları önlenir.
zh_hans: 诊断分析器实例可能会超出编译的生存期。因此，如果将每次编译的数据(如符号)存储到诊断分析器的字段中，这可能导致过时的编译保持活动状态并导致内存泄漏。相反，应将此数据存储在使用“{0}.{1}”API 注册且在编译启动操作中实例化的单独类型中。此类型的实例将在每次编译时创建，并且它不会超出编译的生存期，因此避免了内存泄漏。
zh_hant: 診斷分析器的執行個體可能會超過編譯的存留期。因此，將各個編譯資料 (例如符號) 儲存至診斷分析器的欄位中，可能會造成過時的編譯仍繼續運作，而導致記憶體流失。而應改為將此資料儲存為另一種在編譯起始動作內具現化，且使用 '{0}.{1}' API 註冊的類型。每個編譯都會建立一個此類型的執行個體，且該執行個體不會超過編譯的存留期，因此可避免記憶體流失。

# InternalImplementationOnlyDescription
source: The author of this interface did not intend to have third party implementations of this interface and reserves the right to change it. Implementing this interface could therefore result in a source or binary compatibility issue with a future version of this interface.
de: Der Autor dieser Schnittstelle hat keine Drittanbieterimplementierungen dieser Schnittstelle beabsichtigt und behält sich das Recht auf Änderungen vor. Die Implementierung dieser Schnittstelle kann daher zu einem Kompatibilitätsproblem der Quelle oder Binärdatei mit einer zukünftigen Version dieser Schnittstelle führen.
es: El autor de esta interfaz no tenía intención de contar con implementaciones de terceros de la misma y se reserva el derecho de cambiarla. Así, la implementación de la interfaz puede dar lugar a problemas de compatibilidad binaria o de código fuente con una versión futura de esta.
fr: L'auteur de l'interface n'a pas l'intention d'accepter les implémentations tierces de celle-ci, et se réserve le droit de la changer. L'implémentation de cette interface peut donc entraîner un problème de compatibilité au niveau source ou binaire avec une version future de l'interface.
it: L'autore di questa interfaccia non intendeva includere implementazioni dell'interfaccia di terze parti e si riserva il diritto di modificarla. L'implementazione di questa interfaccia potrebbe quindi generare un problema di compatibilità del codice sorgente o dei binari con una versione futura di questa interfaccia.
ko: 이 인터페이스 작성자는 이 인터페이스를 타사에서 구현하도록 의도하지 않았으며 변경할 권리를 갖습니다. 그러므로 이 인터페이스를 구현하면 향후 버전에서 소스 또는 이진 호환성 문제가 발생할 수 있습니다.
pl: Autor niniejszego interfejsu nie przewidywał implementacji tego interfejsu przez podmioty trzecie i zastrzega sobie prawo do jego zmiany. Wdrożenie tego interfejsu może więc powodować problem ze zgodnością plików źródłowych lub binarnych z przyszłą wersją niniejszego interfejsu.
ru: Разработчик этого интерфейса не предусматривал его сторонние реализации и оставляет за собой право изменять его. Поэтому реализация этого интерфейса может привести к проблемам совместимости на уровне исходного или двоичного кода с последующими версиями интерфейса.
tr: Bu arabirimin yazarı bu arabirimin üçüncü taraf uygulamalarının oluşturulmasını planlamadı ve arabirimi değiştirme hakkını saklı tutuyor. Bu nedenle, bu arabirimin uygulanması bu arabirimin gelecekteki bir sürümüyle kaynak veya uyumluluk sorunlarıyla sonuçlanabilir.
zh_hans: 此接口的作者不允许此接口的第三方实现，并保留更改此接口的权利。因此，实现此接口可能会导致此接口的未来版本发生源或二进制的兼容性问题。
zh_hant: 此介面的作者並不希望第三方實作此介面，並保留變更的權利。因此，實作此介面可能會導致與此介面的未來版本，發生原始碼或二進位碼相容性問題。

# InternalImplementationOnlyMessage
source: Type {0} cannot implement interface {1} because {1} is not available for public implementation
de: Der Typ "{0}" kann die Schnittstelle "{1}" nicht implementieren, weil "{1}" für die öffentliche Implementierung nicht zur Verfügung steht.
es: El tipo {0} no puede implementar la interfaz {1} porque {1} no está disponible para la implementación pública.
fr: Le type {0} ne peut pas implémenter l'interface {1}, car {1} n'est pas disponible pour une implémentation publique
it: Il tipo {0} non può implementare l'interfaccia {1} perché {1} non è disponibile per l'implementazione pubblica
ko: {1}을(를) 공개 구현할 수 없으므로 {0} 형식은 {1} 인터페이스를 구현할 수 없습니다.
pl: Typ {0} nie może wdrażać interfejsu {1}, ponieważ interfejs {1} nie jest dostępny do publicznego wdrażania
ru: Тип {0} не может реализовать интерфейс {1}, так как {1} недоступен для общей реализации.
tr: {1} genel uygulama için kullanılabilir olmadığından {0} türü {1} arabirimini uygulayamıyor
zh_hans: 类型 {0} 无法实现接口 {1}，因为 {1} 不适用于公共实现
zh_hant: 因為 {1} 無法供公用實作使用，所以型別 {0} 無法實作介面 {1}

# InternalImplementationOnlyTitle
source: Only internal implementations of this interface are allowed
de: Es sind nur interne Implementierungen dieser Schnittstelle zulässig
es: Solo se permiten implementaciones internas de esta interfaz
fr: Seules les implémentations internes de cette interface sont autorisées
it: Sono consentite solo implementazioni interne di questa interfaccia
ko: 이 인터페이스의 내부 구현만 허용됨
pl: Dozwolone są tylko wewnętrzne implementacje tego interfejsu
ru: Разрешение только внутренних реализаций этого интерфейса
tr: Bu arabirimin yalnızca içeride yapılan uygulamalarına izin verilir
zh_hans: 只允许此接口的内部实现
zh_hant: 只允許內部實作此介面

# CodeActionNeedsEquivalenceKeyDescription
source: A CodeFixProvider that intends to support fix all occurrences must classify the registered code actions into equivalence classes by assigning it an explicit, non-null equivalence key which is unique for each kind of code action created by this fixer. This enables the FixAllProvider to fix all diagnostics in the required scope by applying code actions from this fixer that are in the equivalence class of the trigger code action.
de: Ein CodeFixProvider, der die Korrektur aller Vorkommen unterstützen soll, muss die registrierten Codeaktionen in Äquivalenzklassen einteilen, indem ein expliziter Äquivalenzschlüssel ungleich NULL zugewiesen wird, der für jede Art von durch diese Korrekturregel erstellten Codeaktionen eindeutig sein muss. Dadurch kann der FixAllProvider alle Diagnosen im erforderlichen Geltungsbereich korrigieren, indem er Codeaktionen dieser Korrekturregel anwendet, die sich in der Äquivalenzklasse der Triggercodeaktion befinden.
es: Un objeto CodeFixProvider destinado a corregir todas las repeticiones debe clasificar las acciones de código registradas en clases de equivalencia. Para ello, debe asignarles una clave de equivalencia explícita no nula que sea única para cada tipo de acción de código creada por este reparador. Esto permite a FixAllProvider corregir todos los diagnósticos del ámbito requerido aplicando acciones de código de este reparador que están en la clase de equivalencia de la acción de código desencadenador.
fr: Un CodeFixProvider qui a l'intention de prendre en charge la correction de toutes les occurrences doit classer les actions de code inscrites en classes d'équivalence en leur affectant une clé d'équivalence explicite, non-Null et unique pour chaque genre d'action de code créée par ce correcteur. Cela permet à FixAllProvider de corriger tous les diagnostics dans la portée nécessaire en appliquant les actions de code du correcteur situées dans la classe d'équivalence de l'action de code du déclencheur.
it: Un elemento CodeFixProvider che intende supportare la correzione di tutte le occorrenze deve classificare le azioni codice registrate nelle classi di equivalenza assegnando una chiave di equivalenza non Null che sia univoca per ogni tipo di azione codice creata da questa utilità di correzione. In questo modo FixAllProvider potrà correggere tutte le diagnostiche nell'ambito richiesto applicando codici azioni di questa utilità di correzione che sono inclusi nella classe di equivalenza dell'azione codice di attivazione.
ko: 모든 발생 수정을 지원하는 CodeFixProvider에 이 수정 도구에서 만들어진 각 종류의 코드 작업에 대해 고유한 명시적이고 null이 아닌 동등 키를 할당하여 등록된 코드 작업을 동등 클래스로 분류해야 합니다. 이렇게 하면 FixAllProvider가 트리거 코드 작업의 동등 클래스에 있는 수정 도구의 코드 작업을 적용하여 필수 범위에서 모든 진단을 수정할 수 있습니다.
pl: Dostawca CodeFixProvider, który zamierza obsługiwać poprawki dla wszystkich wystąpień, musi sklasyfikować zarejestrowane akcje kodu do klas równoważności, przypisując im jawny, inny niż null klucz równoważności, który jest unikatowy dla każdego rodzaju akcji kodu utworzonego przez tę regułę naprawczą. Umożliwia to dostawcy FixAllProvider naprawę całej diagnostyki w wymaganym zakresie, stosując akcje kodu z tej reguły naprawczej, które są w klasie równoważności akcji wyzwalania kodu.
ru: CodeFixProvider, намеревающемуся поддерживать случаи полного исправления, нужно классифицировать зарегистрированные действия кода по классам эквивалентности, назначив явный и отличный от NULL ключ эквивалентности, который является уникальным для всех видов действий кода, созданных этим исправлением. Это позволяет FixAllProvider исправить всю диагностику в требуемой области, применив действия кода из этого исправления, входящие в класс эквивалентности для действия кода триггера.
tr: Tüm örnekleri düzeltme desteği sunmayı hedefleyen bir CodeFixProvider’ın, kayıtlı kod eylemlerine bu düzeltici tarafından oluşturulan her kod eylemi türü için benzersiz olan açık, null olmayan bir eşdeğerlik anahtarı atayarak bu kod eylemlerini eşdeğerlik sınıflarına ayırması gerekir. Bu, FixAllProvider’ın bu düzelticiden tetikleyici kod eyleminin eşdeğerlik sınıfında olan kod eylemlerini uygulayarak gerekli kapsamdaki tüm tanılamaları düzeltmesine olanak sağlar.
zh_hans: 支持修复所有事件的 CodeFixProvider 必须将注册的代码操作划分为等效类，方法是为其分配一个非 null 的显式等效键，且该键对于此修复程序创建的各种代码操作都是唯一的。这样，FixAllProvider 即可通过应用此修复程序的代码操作解决所有诊断问题，其中这些操作位于触发器代码操作的等效类中。
zh_hant: CodeFixProvider 若想支援修正所有出現之處，必須將註冊的程式碼動作分類為相等類別，方法是為其指派明確且非 Null 的相等索引鍵，而其在此修正程式建立的每一種程式碼動作之間皆不重複。如此可讓 FixAllProvider 能藉由套用來自此修正程式中位於觸發程式碼動作之相等類別內的程式碼動作，來修正所需範圍內的所有診斷。

# CreateCodeActionWithEquivalenceKeyMessage
source: Provide an explicit argument for optional parameter '{0}', which is non-null and unique for each kind of code action created by this fixer
de: Geben Sie ein explizites Argument für den optionalen Parameter "{0}" an, das nicht NULL und für jede Art von durch diese Korrekturregel erstellten Aktionen eindeutig ist.
es: Proporcione un argumento explícito para el parámetro "{0}" opcional, que no sea nulo y que sea único para cada tipo de acción de código creada por este reparador.
fr: Fournissez un argument explicite pour le paramètre optionnel '{0}', qui soit non-null et unique pour chaque genre d'action de code créée par ce correcteur
it: Fornire un argomento esplicito per il parametro facoltativo '{0}', che sia non Null e univoco per ogni tipo di azione codice creata da questa correzione
ko: 이 수정 도구에서 생성된 각 종류의 코드 작업에 대해 고유하고 null이 아닌 선택적 매개 변수 '{0}'의 명시적 인수를 제공하세요.
pl: Podaj jawny argument dla opcjonalnego parametru „{0}”, który jest inny niż null i unikatowy dla każdego rodzaju akcji kodu utworzonego przez tę regułę naprawczą
ru: Укажите явный аргумент для необязательного параметра "{0}", который отличен от NULL и уникален для всех видов действий кода, созданных этим исправлением.
tr: İsteğe bağlı '{0}' parametresi için, null olmayan ve bu düzeltici tarafından oluşturulan her kod eylemi için benzersiz olan bir açık bağımsız değişken sağlayın
zh_hans: 为可选形参“{0}”提供一个显式实参，该形参对于此修复程序创建的各种代码操作均为非 null 且是唯一的
zh_hant: 為選擇性參數 '{0}' 提供非 Null 的明確引數，而其在此修正程式所建立的每一種程式碼動作間皆不重複

# CreateCodeActionWithEquivalenceKeyTitle
source: Create code actions should have a unique EquivalenceKey for FixAll occurrences support
de: Aktionen zum Erstellen von Code müssen zur Unterstützung von FixAll-Vorkommen einen eindeutigen EquivalenceKey aufweisen
es: Las acciones de creación de código deben tener un elemento EquivalenceKey único para admitir las repeticiones de FixAll
fr: Les actions de création de code doivent avoir un EquivalenceKey unique pour la prise en charge des occurrences de FixAll
it: Le azioni di creazione codice devono includere un elemento EquivalenceKey univoco per il supporto delle occorrenze di FixAll
ko: 코드 생성 작업에는 FixAll 발생 지원을 위한 고유 EquivalenceKey가 있어야 함
pl: Utworzone akcje kodu powinny mieć unikatowy klucz EquivalenceKey do obsługi wystąpień FixAll
ru: Действия создания кода должны иметь уникальный EquivalenceKey, чтобы поддерживать FixAll
tr: Kod oluşturma eylemlerinin FixAll oluşumları desteği için benzersiz bir EquivalenceKey’e sahip olması gerekir
zh_hans: 创建代码操作应具备唯一 EquivalenceKey，以支持 FixAll 事件
zh_hant: 建立的程式碼動作應要有唯一的 EquivalenceKey ，才可支援出現 FixAll 之處
