Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# PreferIsKindMessage
source: Prefer 'IsKind' for checking syntax kinds
de: "IsKind" für die Überprüfung von Syntaxarten bevorzugen
es: Preferir "IsKind" para comprobar las variantes de sintaxis
fr: Préférez 'IsKind' pour la vérification des genres de syntaxe
it: Preferire 'IsKind' per la verifica dei tipi di sintassi
ko: 구문 종류 확인에 'IsKind' 선호
pl: Preferuj metodę „IsKind” do sprawdzania rodzajów składni
ru: Предпочтение "IsKind" для проверки видов синтаксиса
tr: Söz dizimi türlerini denetlemek için 'IsKind' öğesini tercih et
zh_hans: 首选 "IsKind" 来检查语法类型
zh_hant: 建議使用 'IsKind' 來檢查語法類型

# PreferIsKindTitle
source: Prefer 'IsKind' for checking syntax kinds
de: "IsKind" für die Überprüfung von Syntaxarten bevorzugen
es: Preferir "IsKind" para comprobar las variantes de sintaxis
fr: Préférez 'IsKind' pour la vérification des genres de syntaxe
it: Preferire 'IsKind' per la verifica dei tipi di sintassi
ko: 구문 종류 확인에 'IsKind' 선호
pl: Preferuj metodę „IsKind” do sprawdzania rodzajów składni
ru: Предпочтение "IsKind" для проверки видов синтаксиса
tr: Söz dizimi türlerini denetlemek için 'IsKind' öğesini tercih et
zh_hans: 首选 "IsKind" 来检查语法类型
zh_hant: 建議使用 'IsKind' 來檢查語法類型

# ProvideCustomTagsInDescriptorDescription
source: The 'customTags' value is used as a way to enable specific actions and filters on diagnostic descriptors based on the specific values of the tags. Every Roslyn analyzer should have at least one tag from the 'WellKnownDiagnosticTags' class.
de: Der Wert "customTags" wird verwendet, um bestimmte Aktionen und Filter für Diagnosedeskriptoren basierend auf den spezifischen Werten der Tags zu aktivieren. Jedes Roslyn-Analysetool muss mindestens ein Tag aus der Klasse "WellKnownDiagnosticTags" aufweisen.
es: El valor "customTags" se usa como una forma de habilitar acciones y filtros específicos en los descriptores de diagnóstico según valores específicos de las etiquetas. Cada analizador de Roslyn debe tener al menos una etiqueta de la clase "WellKnownDiagnosticTags".
fr: La valeur ’customTags’ est utilisée comme moyen d’activer des actions et des filtres spécifiques sur les descripteurs de diagnostic en fonction des valeurs spécifiques des balises. Tous les analyseurs Roslyn doivent avoir au moins une balise de la classe ’WellKnownDiagnosticTags'.
it: Il valore 'customTags' viene usato per abilitare azioni e filtri specifici per i descrittori di diagnostica in base a valori specifici dei tag. Ogni analizzatore Roslyn deve includere almeno un tag della classe 'WellKnownDiagnosticTags'.
ko: 'customTags' 값은 특정 태그 값을 기준으로 진단 설명자에서 특정 작업 및 필터를 사용하도록 설정하는 방법으로 사용됩니다. 모든 Roslyn 분석기에는 'WellKnownDiagnosticTags' 클래스의 태그가 하나 이상 있어야 합니다.
pl: Wartość „customTags” jest używana jako sposób włączania określonych akcji i filtrów w deskryptorach diagnostycznych na podstawie konkretnych wartości tagów. Każdy analizator Roslyn powinien zawierać co najmniej jeden tag z klasy „WellKnownDiagnosticTags”.
ru: Значение параметра "customTags" используется для включения определенных действий и фильтров для диагностических дескрипторов на основе конкретных значений тегов. У каждого анализатора Roslyn должен быть по крайней мере один тег из класса "WellKnownDiagnosticTags".
tr: 'customTags' değeri, etiketlerin belirli değerlerine dayalı olarak, tanılama tanımlayıcılarında belirli eylemleri ve filtreleri etkinleştirmek için kullanılır. Her Roslyn çözümleyicisinin 'WellKnownDiagnosticTags' sınıfından en az bir etiketi olmalıdır.
zh_hans: "CustomTags" 值用作根据标记的特定值在诊断描述符上启用特定操作和筛选器的方法。每个 Roslyn 分析器都应至少有一个来自 "WellKnownDiagnosticTags" 类的标记。
zh_hant: 'customTags' 值可用來在診斷描述項上依據標籤的特定值，啟用特定的動作及篩選。每個 Roslyn 分析器至少都應該要有一個來自 'WellKnownDiagnosticTags' 類別的標籤。

# ProvideCustomTagsInDescriptorMessage
source: Consider providing a non-null 'customTags' to diagnostic descriptor constructor to enable metatada filtering of diagnostic descriptors
de: Erwägen Sie die Bereitstellung eines customTags-Werts ungleich NULL für den Konstruktor des Diagnosedeskriptors, um die Metadatenfilterung von Diagnosedeskriptoren zu aktivieren.
es: Considere la posibilidad de proporcionar un objeto "customTags" no NULL para el constructor del descriptor de diagnóstico a fin de permitir el filtrado de metadatos de descriptores de diagnóstico.
fr: Si possible, spécifiez une valeur 'customTags' non null pour le constructeur de descripteur de diagnostic afin d'activer le filtrage des métadonnées des descripteurs de diagnostic
it: Provare a fornire un valore 'customTags' non Null al costruttore del descrittore di diagnostica per abilitare il filtro dei metadati dei descrittori di diagnostica
ko: 진단 설명자 생성자에 null이 아닌 'customTags'를 제공하여 진단 설명자의 메타데이터 필터링을 사용하도록 설정하는 것이 좋습니다.
pl: Rozważ podanie innej niż null wartości „customTags” w konstruktorze deskryptorów diagnostycznych, aby umożliwić filtrowanie metadanych deskryptorów diagnostycznych
ru: Рекомендуется передать в конструктор дескриптора диагностики значение параметра "customTags", отличное от NULL, чтобы включить фильтрацию метаданных дескрипторов диагностики.
tr: Tanılama tanımlayıcılarının meta veri filtrelemesini etkinleştirmek için tanılama tanımlayıcısı oluşturucusuna null olmayan bir 'customTags' değeri sağlamayı düşünün
zh_hans: 请考虑向诊断描述符构造函数提供一个非 null "customTags"，以启用诊断描述符的元数据筛选
zh_hant: 請考慮提供非 null 的 'customTags' 給診斷描述元建構函式，以啟用診斷描述元的中繼資料篩選

# ProvideCustomTagsInDescriptorTitle
source: Provide non-null 'customTags' value to diagnostic descriptor constructor
de: customTags-Wert ungleich NULL für den Konstruktor des Diagnosedeskriptors angeben
es: Proporcione un valor "customTags" que no sea NULL para el constructor del descriptor de diagnóstico
fr: Fournissez une valeur 'customTags' non-null au constructeur de descripteur de diagnostic
it: Fornire un valore 'customTags' non Null al costruttore del descrittore di diagnostica
ko: null이 아닌 'customTags' 값을 진단 설명자 생성자에 제공
pl: Podaj inną niż null wartość „customTags” w konstruktorze deskryptorów diagnostycznych
ru: Передача значения параметра "customTags", отличного от NULL, в конструктор дескриптора диагностики
tr: Tanılama tanımlayıcısı oluşturucusuna null olmayan 'customTags' değeri sağlayın
zh_hans: 向诊断描述符构造函数提供非 null "customTags" 值
zh_hant: 請提供非 null 的 'customTags' 值給診斷描述元建構函式

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleDescription
source: Remove duplicate entries for diagnostic ID between analyzer releases.
de: Entfernen Sie doppelte Einträge für die Diagnose-ID zwischen Analysetoolreleases.
es: Quite las entradas duplicadas del identificador de diagnóstico entre las versiones del analizador.
fr: Supprimez les entrées dupliquées de l'ID de diagnostic entre les versions d'analyseur.
it: Rimuovere le voci duplicate per l'ID diagnostica tra le versioni dell'analizzatore.
ko: 분석기 릴리스 간에 진단 ID의 중복 항목을 제거합니다.
pl: Usuń zduplikowane wpisy identyfikatora diagnostycznego w różnych wydaniach analizatora.
ru: Удалите повторяющиеся записи идентификаторов диагностики в разных выпусках анализатора.
tr: Çözümleyici yayınları arasında tanılama kimliği için yinelenen girdileri kaldırın.
zh_hans: 删除分析器版本之间的诊断 ID 的重复条目。
zh_hant: 移除分析器版本之間診斷識別碼的重複項目。

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleMessage
source: Rule '{0}' has duplicate entry between release '{1}' and release '{2}'
de: Die Regel "{0}" weist zwischen Release "{1}" und Release "{2}" einen doppelten Eintrag auf.
es: La regla "{0}" tiene una entrada duplicada entre la versión "{1}" y la versión "{2}".
fr: La règle '{0}' contient une entrée dupliquée entre la version '{1}' et la version '{2}'
it: La regola '{0}' contiene una voce duplicata tra la versione '{1}' e la versione '{2}'
ko: '{0}' 규칙에서 '{1}' 릴리스 및 '{2}' 릴리스 간에 중복 항목이 있습니다.
pl: Reguła „{0}” ma zduplikowany wpis między wydaniami „{1}” i „{2}”
ru: Правило "{0}" содержит повторяющуюся запись в выпусках "{1}" и "{2}".
tr: '{0}' kuralı, '{1}' yayını ile '{2}' yayını arasında yinelenen giriş içeriyor
zh_hans: 规则“{0}”在版本“{1}”和版本“{2}”之间有重复项
zh_hant: 規則 '{0}' 在版本 '{1}' 與版本 '{2}' 之間，出現了重複的項目

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleTitle
source: Remove duplicate entries for diagnostic ID between analyzer releases
de: Entfernen Sie doppelte Einträge für die Diagnose-ID zwischen Analysetoolreleases.
es: Quitar las entradas duplicadas del identificador de diagnóstico entre versiones del analizador
fr: Supprimer les entrées dupliquées de l'ID de diagnostic entre les versions d'analyseur
it: Rimuovere le voci duplicate per l'ID diagnostica tra le versioni dell'analizzatore
ko: 분석기 릴리스 간에 진단 ID의 중복 항목 제거
pl: Usuń zduplikowane wpisy identyfikatora diagnostyki w różnych wydaniach analizatora
ru: Удалите повторяющиеся записи идентификаторов диагностики в разных выпусках анализатора
tr: Çözümleyici yayınları arasında tanılama kimliği için yinelenen girişleri kaldır
zh_hans: 删除分析器版本之间的诊断 ID 的重复条目
zh_hant: 移除分析器版本之間重複的診斷識別碼項目

# RemoveDuplicateEntriesForAnalyzerReleaseRuleDescription
source: Remove duplicate entries for diagnostic ID in the same analyzer release.
de: Entfernen Sie doppelte Einträge für die Diagnose-ID im selben Analysetoolrelease.
es: Quite las entradas duplicadas del identificador de diagnóstico en la misma versión del analizador.
fr: Supprimez les entrées dupliquées de l'ID de diagnostic dans la même version d'analyseur.
it: Rimuovere le voci duplicate per gli ID diagnostica nella stessa versione dell'analizzatore.
ko: 동일한 분석기 릴리스에서 진단 ID의 중복 항목을 제거합니다.
pl: Usuń zduplikowane wpisy identyfikatora diagnostycznego w tym samym wydaniu analizatora.
ru: Удалите повторяющиеся записи идентификаторов диагностики в одном и том же выпуске анализатора.
tr: Aynı çözümleyici yayınında tanılama kimliği için yinelenen girdileri kaldırın.
zh_hans: 删除同一分析器版本中诊断 ID 的重复条目。
zh_hant: 移除相同分析器版本中診斷識別碼的重複項目。

# RemoveDuplicateEntriesForAnalyzerReleaseRuleMessage
source: Rule '{0}' has more then one entry for release '{1}' in analyzer release file '{2}'
de: Die Regel "{0}" enthält mehrere Einträge für das Release "{1}" in der Analysetool-Releasedatei "{2}".
es: La regla "{0}" tiene más de una entrada para la versión "{1}" en el archivo de versión del analizador "{2}".
fr: La règle '{0}' a plusieurs entrées pour la version '{1}' dans le fichier de version d'analyseur '{2}'
it: La regola '{0}' contiene più di una voce per la versione '{1}' nel file di versione dell'analizzatore '{2}'
ko: '{0}' 규칙에 분석기 릴리스 파일 '{2}'의 '{1}' 릴리스에 대한 항목이 둘 이상 있습니다.
pl: Reguła „{0}” ma więcej niż jeden wpis dla wydania „{1}” w pliku wydania analizatora „{2}”
ru: Правило "{0}" содержит несколько записей для выпуска "{1}" в файле выпуска анализатора "{2}".
tr: '{0}' kuralı, '{1}' yayını için '{2}' çözümleyici yayın dosyasında birden fazla giriş içeriyor
zh_hans: 在分析器版本文件“{2}”中，规则“{0}”具有版本“{1}”的多个项
zh_hant: 規則 '{0}' 在分析器版本檔案 '{2}' 中，針對版本 '{1}' 出現了多個項目

# RemoveDuplicateEntriesForAnalyzerReleaseRuleTitle
source: Remove duplicate entries for diagnostic ID in the same analyzer release
de: Entfernen Sie doppelte Einträge für die Diagnose-ID im selben Analysetoolrelease.
es: Quitar las entradas duplicadas del identificador de diagnóstico en la misma versión del analizador
fr: Supprimer les entrées dupliquées de l'ID de diagnostic dans la même version d'analyseur
it: Rimuovere le voci duplicate per gli ID diagnostica nella stessa versione dell'analizzatore
ko: 동일한 분석기 릴리스에서 진단 ID의 중복 항목 제거
pl: Usuń zduplikowane wpisy identyfikatora diagnostyki w tym samym wydaniu analizatora
ru: Удалите повторяющиеся записи идентификаторов диагностики в одном и том же выпуске анализатора
tr: Aynı çözümleyici yayınında tanılama kimliği için yinelenen girişleri kaldır
zh_hans: 删除同一分析器版本中诊断 ID 的重复条目
zh_hant: 移除相同分析器版本中重複的診斷識別碼項目

# RemoveShippedDeletedDiagnosticIdDescription
source: Shipped diagnostic IDs that are no longer reported should have an entry in the 'Removed Rules' table in unshipped file.
de: Veröffentlichte Diagnose-IDs, die nicht mehr gemeldet werden, müssen in der Tabelle "Entfernte Regeln" in der nicht veröffentlichten Datei einen Eintrag enthalten.
es: Debe haber una entrada en la tabla "Removed Rules" en el archivo no incluido para los identificadores de diagnóstico incluidos que ya no se notifican.
fr: Les ID de diagnostic fournis qui ne sont plus signalés doivent avoir une entrée dans la table 'Règles supprimées' du fichier non fourni.
it: Per gli ID diagnostica distribuiti che non sono più segnalati deve essere inclusa una voce nella tabella 'Regole rimosse' nel file non distribuito.
ko: 더 이상 보고되지 않는 제공된 진단 ID는 제공되지 않은 파일의 '제거된 규칙' 테이블에 항목이 있어야 합니다.
pl: Dostarczone identyfikatory diagnostyczne, które nie są już zgłaszane, powinny mieć wpis w tabeli „Usunięte reguły” niedostarczonego pliku.
ru: Для отправленных идентификаторов диагностики, которые больше не включены в отчет, должны присутствовать записи в таблице "Удаленные правила" в неотправленном файле.
tr: Artık bildirilmeyen gönderilmiş tanılama kimliklerinin, gönderilmeyen dosyada 'Kaldırılan Kurallar' tablosunda bir girdisi olmalıdır.
zh_hans: 不再报告的已提供的诊断 ID 应该在未提供的文件的“已删除规则”表中有一个条目。
zh_hant: 不再回報的已送出診斷識別碼，在未送出檔案的「已移除規則」資料表中應有一個項目。

# RemoveShippedDeletedDiagnosticIdMessage
source: Rule '{0}' was shipped in analyzer release '{1}', but is no longer a supported diagnostic for any analyzer. Add an entry for this rule in a 'Removed Rules' table to unshipped file.
de: Die Regel "{0}" wurde im Analysetoolrelease "{1}" ausgeliefert, wird aber als Diagnose für das Analysetool nicht mehr unterstützt. Fügen Sie der nicht veröffentlichten Datei einen Eintrag für diese Regel in einer Tabelle "Entfernte Regeln" hinzu.
es: La regla "{0}" se incluyó en la versión del analizador "{1}", pero ya no es un diagnóstico admitido para ningún analizador. Agregue una entrada para esta regla en una tabla "Removed Rules" a un archivo no incluido.
fr: La règle '{0}' a été fournie dans la version d'analyseur '{1}', mais elle n'est plus un diagnostic pris en charge par un analyseur. Ajoutez une entrée pour cette règle dans une table 'Règles supprimées' au sein du fichier non fourni.
it: La regola '{0}' è stata distribuita nella versione dell'analizzatore '{1}', ma non è più una diagnostica supportata per qualsiasi analizzatore. Aggiungere una voce per questa regola in una tabella 'Regole rimosse' in un file non distribuito.
ko: '{0}' 규칙은 분석기 릴리스 '{1}'에서 제공되었지만 더 이상 모든 분석기를 지원하는 진단이 아닙니다. '제거된 규칙' 테이블에서 이 규칙에 대한 항목을 제공되지 않은 파일에 추가합니다.
pl: Reguła „{0}” została dostarczona w wydaniu analizatora „{1}”, ale nie jest to już obsługiwana diagnostyka dla żadnego analizatora. Dodaj wpis dla tej reguły w tabeli „Usunięte reguły” do niedostarczonego pliku.
ru: Правило "{0}" было отправлено в выпуске анализатора "{1}", но больше не поддерживается в качестве диагностики ни для одного из анализаторов. Добавьте запись для этого правила в таблице "Удаленные правила" в неотправленном файле.
tr: '{0}' kuralı '{1}' çözümleyici yayınında gönderildi, ancak artık herhangi bir çözümleyici için desteklenen bir tanılama değil. Gönderilmeyen dosyada, 'Kaldırılan kurallar' tablosunda bu kural için bir girdi ekleyin.
zh_hans: 规则“{0}”已在分析器版本“{1}”中提供，但不再是任何分析器支持的诊断。将“已删除规则”表中此规则的项添加到未提供的文件。
zh_hant: 規則 '{0}' 已送到分析器版本 '{1}' 中，但已不再是任何分析器的支援診斷。請在未送出檔案的「已移除規則」資料表中針對此規則新增項目。

# RemoveShippedDeletedDiagnosticIdTitle
source: Shipped diagnostic IDs that are no longer reported should have an entry in the 'Removed Rules' table in unshipped file
de: Veröffentlichte Diagnose-IDs, die nicht mehr gemeldet werden, müssen in der Tabelle "Entfernte Regeln" in der nicht veröffentlichten Datei einen Eintrag enthalten.
es: Debe haber una entrada de los identificadores de diagnóstico incluidos que ya no se notifican en la tabla "Removed Rules" del archivo no incluido
fr: Les ID de diagnostic fournis qui ne sont plus signalés doivent avoir une entrée dans la table 'Règles supprimées' du fichier non fourni
it: Per gli ID diagnostica distribuiti che non sono più segnalati deve essere inclusa una voce nella tabella 'Regole rimosse' nel file non distribuito
ko: 더 이상 보고되지 않는 제공된 진단 ID는 제공되지 않은 파일의 '제거된 규칙' 테이블에 항목이 있어야 합니다.
pl: Dostarczone identyfikatory diagnostyki, które nie są już zgłaszane, powinny mieć wpis w tabeli „Usunięte reguły” niedostarczonego pliku
ru: Для отправленных идентификаторов диагностики, которые больше не включены в отчет, должны присутствовать записи в таблице "Удаленные правила" в неотправленном файле.
tr: Artık bildirilmeyen gönderilmiş tanılama kimliklerinin, gönderilmeyen dosyada bulunan 'Kaldırılan Kurallar' tablosunda bir girişi olmalıdır
zh_hans: 不再报告但已提供的诊断 ID 应该在未提供的文件的“已删除规则”表中有一个条目
zh_hant: 不會再回報的已送出之診斷識別碼，在未送出檔案的「已移除規則」資料表中應有一個項目

# RemoveUnshippedDeletedDiagnosticIdDescription
source: Entries for analyzer diagnostic IDs that are no longer reported and never shipped can be removed from unshipped analyzer release.
de: Einträge für Analysetooldiagnose-IDs, die nicht mehr gemeldet und niemals veröffentlicht werden, können aus dem nicht veröffentlichten Analysetoolrelease entfernt werden.
es: Las entradas de los identificadores de diagnóstico del analizador que ya no se notifican y que no se incluyen nunca pueden quitarse de la versión del analizador no incluida.
fr: Les entrées des ID de diagnostic d'analyseur qui ne sont plus signalées et qui ne sont jamais fournies peuvent être supprimées de la version d'analyseur non fournie.
it: Le voci per gli ID diagnostica dell'analizzatore che non sono più segnalate e non vengono più distribuite possono essere rimosse dalla versione dell'analizzatore non distribuita.
ko: 더 이상 보고되지 않고 제공되지 않는 분석기 진단 ID의 항목은 제공되지 않은 분석기 릴리스에서 제거될 수 있습니다.
pl: Wpisy identyfikatorów diagnostycznych analizatora, które nie są już zgłaszane i nigdy nie są dostarczane, mogą zostać usunięte z niedostarczonego wydania analizatora.
ru: Записи для идентификаторов диагностики анализатора, которые больше не включены в отчет и не были отправлены, можно удалить из неотправленного выпуска анализатора.
tr: Artık bildirilmeyen ve hiç gönderilmemiş çözümleyici tanılama kimliklerine yönelik girdiler, gönderilmeyen çözümleyici yayınından kaldırılabilir.
zh_hans: 可以将不再报告和从未提供的分析器诊断 ID 的项从未提供的版本中删除。
zh_hant: 不再回報且從未送出的分析器診斷識別碼項目可以從未送出的分析器版本移除。

# RemoveUnshippedDeletedDiagnosticIdMessage
source: Rule '{0}' is part of the next unshipped analyzer release, but is not a supported diagnostic for any analyzer
de: Die Regel "{0}" ist Teil des nächsten nicht veröffentlichten Analysetoolrelease, wird aber für kein Analysetool als Diagnose unterstützt.
es: La regla "{0}" forma parte de la versión del analizador siguiente sin incluir, pero no es un diagnóstico admitido para ningún analizador.
fr: La règle '{0}' fait partie de la prochaine version d'analyseur non fournie, mais elle n'est pas un diagnostic pris en charge par un analyseur
it: La regola '{0}' fa parte della successiva versione dell'analizzatore non distribuita, ma non è una diagnostica supportata per qualsiasi analizzatore
ko: '{0}' 규칙은 제공되지 않은 다음 분석기 릴리스에 포함되지만 모든 분석기를 지원하는 진단이 아닙니다.
pl: Reguła „{0}” jest częścią następnego niedostarczonego wydania analizatora, ale nie jest obsługiwaną diagnostyką dla żadnego analizatora
ru: Правило "{0}" является частью следующего неотправленного выпуска анализатора, но не поддерживается в качестве диагностики ни для одного из анализаторов.
tr: '{0}' kuralı, sonraki gönderilmemiş çözümleyici yayınının parçası ancak herhangi bir çözümleyici için desteklenen bir tanılama değil
zh_hans: 规则“{0}”是下一个未提供的分析器版本的一部分，但它不是任何分析器支持的诊断
zh_hant: 規則 '{0}' 包含在下一個未送出的分析器版本中，但其並非任何分析器的支援診斷

# RemoveUnshippedDeletedDiagnosticIdTitle
source: Do not add removed analyzer diagnostic IDs to unshipped analyzer release
de: Fügen Sie einem nicht veröffentlichten Analysetoolrelease keine entfernten Analysetooldiagnose-IDs hinzu.
es: No agregar identificadores de diagnóstico del analizador eliminados a una versión del analizador no incluida
fr: Ne pas ajouter d'ID de diagnostic d'analyseur supprimé à une version d'analyseur non fournie
it: Non aggiungere gli ID diagnostica dell'analizzatore rimossi alla versione dell'analizzatore non distribuita
ko: 제거된 분석기 진단 ID를 제공되지 않은 분석기 릴리스에 추가하면 안 됩니다.
pl: Nie dodawaj usuniętych identyfikatorów diagnostyki analizatora do niedostarczonego wydania analizatora
ru: Не добавляйте удаленные идентификаторы диагностики анализатора в неотправленный выпуск анализатора
tr: Kaldırılmış çözümleyici tanılama kimliklerini gönderilmeyen çözümleyici sürümüne ekleme
zh_hans: 请勿将已删除的分析器诊断 ID 添加到未提供的分析器版本中
zh_hant: 請勿將已移除的分析器診斷識別碼，新增至未送出的分析器版本

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullDescription
source: Calling 'SemanticModel.GetDeclaredSymbol' with on certain types inheriting from 'SyntaxNode', for example 'GlobalStatementSyntax' and 'IncompleteMemberSyntax' will always return 'null'.
de: Beim Aufruf von "SemanticModel.GetDeclaredSymbol" für bestimmte Typen, die von "SyntaxNode" erben, geben beispielsweise "GlobalStatementSyntax" und "IncompleteMemberSyntax" immer "null" zurück.
es: Llamar a "SemanticModel.GetDeclaredSymbol" con determinados tipos que heredan de "SyntaxNode"; por ejemplo, "GlobalStatementSyntax" y "IncompleteMemberSyntax" siempre devolverán "null".
fr: L’appel de « SemanticModel.GetDeclaredSymbol » sur certains types héritant de « SyntaxNode », par exemple « GlobalStatementSyntax » et « IncompleteMemberSyntax » retourne toujours « null ».
it: La chiamata a 'SemanticModel.GetDeclaredSymbol' con determinati tipi che ereditano da 'SyntaxNode', ad esempio 'GlobalStatementSyntax' e 'IncompleteMemberSyntax', restituirà sempre 'null'.
ko: 'SyntaxNode'에서 상속되는 특정 형식을 사용하여 'SemanticModel.GetDeclaredSymbol'을 호출합니다(예: 'GlobalStatementSyntax' 및 'IncompleteMemberSyntax'는 항상 'null'을 반환합니다.)
pl: Wywołanie metody „SemanticModel.GetDeclaredSymbol” z określonymi typami dziedziczonymi z elementu „SyntaxNode”, na przykład „GlobalStatementSyntax” i „IncompleteMemberSyntax”, zawsze zwróci wartość „null”.
ru: Вызов "SemanticModel.GetDeclaredSymbol" с определенными типами, унаследованными от "SyntaxNode", например "GlobalStatementSyntax" и "IncompleteMemberSyntax", всегда возвращает "null".
tr: 'GlobalStatementSyntax' ve 'IncompleteMemberSyntax' gibi 'SyntaxNode' öğesinden devralınan belirli türlerde 'SemanticModel.GetDeclaredSymbol' çağrısı her zaman 'null' döndürür.
zh_hans: 对从“SyntaxNode”继承的某些类型(例如“GlobalStatementSyntax”和“IncompleteMemberSyntax”)调用“SemanticModel.GetDeclaredSymbol”将始终返回“null”。
