Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# DoNotUseCompilationGetSemanticModelDescription
source: 'GetSemanticModel' is an expensive method to invoke within a diagnostic analyzer because it creates a completely new semantic model, which does not share compilation data with the compiler or other analyzers. This incurs an additional performance cost during semantic analysis. Instead, consider registering a different analyzer action which allows used of a shared 'SemanticModel', such as 'RegisterOperationAction', 'RegisterSyntaxNodeAction', or 'RegisterSemanticModelAction'.
de: "GetSemanticModel" ist eine kostspielige Methode zum Aufruf in einem Diagnoseanalysetool, weil damit ein vollständig neues Semantikmodell erstellt wird, das keine Kompilierungsdaten mit dem Compiler oder anderen Analysetools teilt. Dies führt zu zusätzlichen Leistungseinbußen bei der Semantikanalyse. Erwägen Sie stattdessen die Registrierung einer anderen Analysetoolaktion, die die Verwendung eines freigegebenen "SemanticModel" wie z. B. "RegisterOperationAction", "RegisterSyntaxNodeAction" oder "RegisterSemanticModelAction" ermöglicht.
es: "GetSemanticModel" es un método caro para invocar dentro de un analizador de diagnóstico porque crea un modelo semántico completamente nuevo que no comparte datos de compilación con el compilador u otros analizadores. Como consecuencia, se generan costos de rendimiento adicionales durante el análisis semántico. En su lugar, podría registrar una acción del analizador diferente que permita usar un elemento "SemanticModel" compartido, como "RegisterOperationAction", "RegisterSyntaxNodeAction" o "RegisterSemanticModelAction".
fr: 'GetSemanticModel' est une méthode coûteuse à appeler dans un analyseur de diagnostic, car elle crée un modèle sémantique complètement nouveau, qui ne partage pas les données de compilation avec le compilateur ou d'autres analyseurs. Cela entraîne un coût supplémentaire au niveau des performances au moment de l'analyse sémantique. À la place, inscrivez une autre action d'analyseur qui permet d'utiliser un 'SemanticModel' partagé, par exemple 'RegisterOperationAction', 'RegisterSyntaxNodeAction' ou 'RegisterSemanticModelAction'.
it: 'GetSemanticModel' è un metodo dispendioso da richiamare in un analizzatore diagnostico perché crea un modello semantico completamente nuovo, che non condivide i dati di compilazione con il compilatore o con altri analizzatori, comportando un ulteriore costo in termini di prestazioni durante l'analisi semantica. Provare invece a registrare un'azione diversa dell'analizzatore che consenta l'uso di un elemento 'SemanticModel' condiviso, come 'RegisterOperationAction', 'RegisterSyntaxNodeAction' o 'RegisterSemanticModelAction'.
ko: 'GetSemanticModel'은 컴파일러나 다른 분석기와 컴파일 데이터를 공유하지 않는 완전히 새로운 의미 체계 모델을 만들므로 진단 분석기 내에서 호출하는 데 부담이 큰 메서드입니다. 이 메서드를 사용하면 의미 체계 분석 중 추가 성능 비용이 발생합니다. 대신 공유 'SemanticModel'을 사용할 수 있는 'RegisterOperationAction', 'RegisterSyntaxNodeAction', 'RegisterSemanticModelAction' 등과 같은 다른 분석기 작업을 등록하세요.
pl: Wywołanie metody „GetSemanticModel” w analizatorze diagnostycznym jest kosztowne, ponieważ powoduje utworzenie całkowicie nowego modelu semantycznego, który nie współdzieli danych kompilacji z kompilatorem ani innymi analizatorami. Wiąże się to z dodatkowym kosztem wydajności podczas analizy semantycznej. Zamiast tego rozważ zarejestrowanie innej akcji analizatora, która umożliwia użycie współdzielonego modelu „SemanticModel”, takiego jak „RegisterOperationAction”, „RegisterSyntaxNodeAction” lub „RegisterSemanticModelAction”.
ru: "GetSemanticModel" является затратным методом для вызова в диагностическом анализаторе, так как при этом создается совершенно новая семантическая модель, которая не использует данные компиляции совместно с компилятором или другими анализаторами. Это приводит к снижению производительности во время семантического анализа. Вместо этого попробуйте зарегистрировать другое действие анализатора, которое позволит использовать общую модель "SemanticModel", например "RegisterOperationAction", "RegisterSyntaxNodeAction" или "RegisterSemanticModelAction".
tr: 'GetSemanticModel', derleme verilerini derleyici veya diğer çözümleyiciler ile paylaşmayan tamamen yeni bir anlam modeli oluşturduğundan bir tanılama çözümleyicisi içinde çağırmak için pahalı bir yöntemdir. Bu işlem, anlamsal analiz sırasında ek bir performans maliyetine neden olur. Bunun yerine, 'RegisterOperationAction', 'RegisterSyntaxNodeAction' veya 'RegisterSemanticModelAction' gibi paylaşılan bir 'SemanticModel' kullanılmasına izin veren farklı bir çözümleyici eylemini kaydetmeyi deneyin.
zh_hans: "GetSemanticModel" 是在诊断分析器中调用的昂贵方法，因为它创建了一个全新的语义模型，该语义模型不与编译器或其他分析器共享编译数据。这会在语义分析期间产生额外的性能开销。请考虑改为注册允许使用共享 "SemanticModel" (如 "RegisterOperationAction"、"RegisterSyntaxNodeAction" 或 "RegisterSemanticModelAction")的其他分析器操作。
zh_hant: 在診斷分析器內叫用方法時，'GetSemanticModel' 是成本較高的方法，原因是其會建立全新的語意模型，而不會與編譯器或其他分析器共用編譯資料，此舉會在分析語意期間產生額外的效能成本。請改為考慮註冊不同的分析器動作，以允許使用共用的 'SemanticModel'，例如 'RegisterOperationAction'、'RegisterSyntaxNodeAction' 或 'RegisterSemanticModelAction'。

# DoNotUseCompilationGetSemanticModelMessage
source: Do not invoke Compilation.GetSemanticModel() method within a diagnostic analyzer
de: Compilation.GetSemanticModel()-Methode nicht innerhalb eines Diagnoseanalysetools aufrufen
es: No invoque el método Compilation.GetSemanticModel() en un analizador de diagnóstico
fr: N'appelez pas la méthode Compilation.GetSemanticModel() dans un analyseur de diagnostic
it: Non richiamare il metodo Compilation.GetSemanticModel() in un analizzatore diagnostico
ko: 진단 분석기 내에서 Compilation.GetSemanticModel() 메서드를 호출하지 마세요.
pl: Nie wywołuj metody Compilation.GetSemanticModel() w analizatorze diagnostycznym
ru: Не вызывайте метод Compilation.GetSemanticModel() в диагностическом анализаторе.
tr: Bir tanılama çözümleyicisi içinde Compilation.GetSemanticModel() yöntemini çağırma
zh_hans: 请勿在诊断分析器中调用 Compilation.GetSemanticModel() 方法
zh_hant: 請不要在診斷分析器內叫用 Compilation.GetSemanticModel() 方法

# DoNotUseCompilationGetSemanticModelTitle
source: Do not invoke Compilation.GetSemanticModel() method within a diagnostic analyzer
de: Compilation.GetSemanticModel()-Methode nicht innerhalb eines Diagnoseanalysetools aufrufen
es: No invoque el método Compilation.GetSemanticModel() en un analizador de diagnóstico
fr: N'appelez pas la méthode Compilation.GetSemanticModel() dans un analyseur de diagnostic
it: Non richiamare il metodo Compilation.GetSemanticModel() in un analizzatore diagnostico
ko: 진단 분석기 내에서 Compilation.GetSemanticModel() 메서드를 호출하지 마세요.
pl: Nie wywołuj metody Compilation.GetSemanticModel() w analizatorze diagnostycznym
ru: Не вызывайте метод Compilation.GetSemanticModel() в диагностическом анализаторе
tr: Bir tanılama çözümleyicisi içinde Compilation.GetSemanticModel() yöntemini çağırma
zh_hans: 请勿在诊断分析器中调用 Compilation.GetSemanticModel() 方法
zh_hant: 請不要在診斷分析器內叫用 Compilation.GetSemanticModel() 方法

# DoNotUseFileTypesForAnalyzersOrGeneratorsDescription
source: Using a 'file' type is not allowed for implementing analyzers, generators, or code fixers. This can break analyzer loading on some platforms.
pl: Używanie typu „file” nie jest dozwolone przy implementacji analizatorów, generatorów ani naprawiaczy kodu. Może to spowodować problemy z ładowaniem analizatora na niektórych platformach.
ru: Использование типа file не разрешено для реализации анализаторов, генераторов или исправлений кода. Это может привести к сбоям при загрузке анализатора на некоторых платформах.

# DoNotUseFileTypesForAnalyzersOrGeneratorsMessage
source: Type '{0}' should not be marked with 'file'
pl: Typ „{0}” nie powinien być oznaczony jako „file”
ru: Тип "{0}" не должен быть помечен как file

# DoNotUseFileTypesForAnalyzersOrGeneratorsTitle
source: Do not use file types for implementing analyzers, generators, and code fixers
pl: Nie używaj typów plików do implementacji analizatorów, generatorów i naprawiaczy kodu
ru: Не используйте типы file для реализации анализаторов, генераторов и исправлений кода

# DoNotUseReservedDiagnosticIdDescription
source: DiagnosticId for analyzers should not use reserved IDs.
de: Die DiagnosticId für Analysetools darf keine reservierten IDs verwenden.
es: El valor DiagnosticId para los analizadores no debe usar identificadores reservados.
fr: DiagnosticId pour les analyseurs ne doit pas utiliser d'ID réservés.
it: L'ID diagnostica per gli analizzatori non deve usare ID riservati.
ko: 분석기의 DiagnosticId에는 예약된 ID를 사용해서는 안 됩니다.
pl: W elemencie DiagnosticId dla analizatorów nie należy używać zastrzeżonych identyfikatorów.
ru: Идентификатор диагностики DiagnosticId для анализатора не должен включать зарезервированные идентификаторы.
tr: Çözümleyiciler için DiagnosticId, ayrılmış kimlikler kullanmamalıdır.
zh_hans: 分析器的 DiagnosticId 不应使用保留 ID。
zh_hant: 分析器的診斷識別碼不應使用保留的識別碼。

# DoNotUseReservedDiagnosticIdMessage
source: '{0}' is a reserved diagnostic ID
de: "{0}" ist eine reservierte Diagnose-ID.
es: "{0}" es un identificador de diagnóstico reservado.
fr: '{0}' est un ID de diagnostic réservé
it: '{0}' è un ID diagnostica riservato
ko: '{0}'은(는) 예약된 진단 ID입니다.
pl: „{0}” to zastrzeżony identyfikator diagnostyczny
ru: "{0}" является зарезервированным идентификатором диагностики.
tr: '{0}', ayrılmış bir tanılama kimliğidir
zh_hans: “{0}”是保留的诊断 ID
zh_hant: '{0}' 是保留的診斷識別碼

# DoNotUseReservedDiagnosticIdTitle
source: Do not use reserved diagnostic IDs
de: Keine reservierten Diagnose-IDs verwenden
es: No use identificadores de diagnóstico reservados
fr: N'utilisez pas d'ID de diagnostic réservés
it: Non usare ID diagnostica riservati
ko: 예약된 진단 ID를 사용하면 안 됨
pl: Nie używaj zastrzeżonych identyfikatorów diagnostycznych
ru: Запрет использования зарезервированных диагностических идентификаторов
tr: Ayrılmış tanılama kimlikleri kullanmayın
zh_hans: 不要使用保留的诊断 ID
zh_hant: 請勿使用保留的診斷識別碼

# EnableAnalyzerReleaseTrackingRuleDescription
source: Enabling release tracking for analyzer packages helps in tracking and documenting the analyzer diagnostics that ship and/or change with each analyzer release. See details at https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
de: Das Aktivieren der Versionsnachverfolgung für Analysepakete unterstützt Sie beim Nachverfolgen und Dokumentieren der Analysediagnose, die mit den einzelnen Analysereleases ausgeliefert und/oder geändert wird. Details finden Sie unter https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
es: Habilitar el seguimiento de versiones para los paquetes de analizadores ayuda al seguimiento y la documentación de los diagnósticos de analizador que se incluyen o se modifican con cada versión de este. Consulte los detalles en https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
fr: L'activation du suivi de version pour les packages d'analyseurs permet de suivre et de documenter les diagnostics d'analyseurs qui sont fournis et/ou changés pour chaque version d'analyseur. Consultez les détails sur https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
it: L'abilitazione del rilevamento delle versioni per i pacchetti per i pacchetti dell'analizzatore consente di tenere traccia e documentare la diagnostica dell'analizzatore che viene inclusa e/o modificata con ogni versione dell'analizzatore. Per dettagli, vedere https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
ko: 분석기 패키지에 대해 릴리스 추적을 사용하도록 설정하면 각 분석기 릴리스와 함께 제공 및/또는 변경되는 분석기 진단을 추적하고 문서화하는 데 도움이 됩니다. 자세한 내용은 https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md를 참조하세요.
pl: Włączenie śledzenia wydań dla pakietów analizatora ułatwia śledzenie i dokumentowanie diagnostyki analizatora dostarczanej i/lub zmienianej w poszczególnych wydaniach analizatora. Zobacz szczegóły pod adresem https://github.com/dotnet/roslyn-analyzers/blob/main/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
ru: Включение отслеживания выпуска для пакетов анализатора помогает отслеживать и документировать диагностические сведения анализатора, поставляемые и (или) изменяемые с каждым выпуском анализатора. Дополнительные сведения см. на странице https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
tr: Çözümleyici paketleri için yayın izlemeyi etkinleştirme, her çözümleyici yayınıyla birlikte gelen ve/veya değişen çözümleyici tanılamalarını izlemeye ve belgelemeye yardımcı olur. https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md adresindeki ayrıntılara bakın.
zh_hans: 为分析器包启用发布跟踪有助于跟踪和记录每次分析器发布时附带/或更改的分析器诊断。有关详细信息，请访问 https://github.com/dotnet/roslyn/blob/main/src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md。

# EnableAnalyzerReleaseTrackingRuleMessage
source: Enable analyzer release tracking for the analyzer project containing rule '{0}'
de: Analyseversionsnachverfolgung für Analyseprojekt mit Regel "{0}" aktivieren
es: Habilitar el seguimiento de versiones del analizador para el proyecto de analizador que contiene la regla "{0}"
fr: Activer le suivi de version d'analyseur pour le projet d'analyseur contenant la règle '{0}'
it: Abilita il rilevamento delle versioni dell'analizzatore per il progetto dell'analizzatore che contiene la regola '{0}'
ko: '{0}' 규칙을 포함하는 분석기 프로젝트에 대해 분석기 릴리스 추적 사용
pl: Włącz śledzenie wydań analizatora dla projektu analizatora zawierającego regułę „{0}”
ru: Включить отслеживание выпуска анализатора для проекта анализатора, содержащего правило "{0}"
tr: '{0}' kuralını içeren çözümleyici projesi için çözümleyici yayını izlemeyi etkinleştir
zh_hans: 为包含规则“{0}”的分析器项目启用分析器发布跟踪
zh_hant: 啟用包含規則 '{0}' 之分析器專案的分析器版本追蹤

# EnableAnalyzerReleaseTrackingRuleTitle
source: Enable analyzer release tracking
de: Analyseversionsnachverfolgung aktivieren
es: Habilitar el seguimiento de versiones del analizador
fr: Activer le suivi de version d'analyseur
it: Abilita il rilevamento delle versioni dell'analizzatore
ko: 분석기 릴리스 추적 사용
pl: Włącz śledzenie wydań analizatora
ru: Включить отслеживание выпуска анализатора
tr: Çözümleyici yayını izlemeyi etkinleştir
zh_hans: 启用分析器发布跟踪
zh_hant: 啟用分析器版本追蹤

# EnableConcurrentExecutionFix
source: Enable concurrent execution
de: Gleichzeitige Ausführung aktivieren
es: Habilitar la ejecución simultánea
fr: Activer l'exécution simultanée
it: Abilita l'esecuzione simultanea
ko: 동시 실행 사용
pl: Włącz wykonywanie współbieżne
ru: Включение параллельного выполнения
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行
zh_hant: 啟用同時執行

# EnableConcurrentExecutionMessage
source: Enable concurrent execution
de: Gleichzeitige Ausführung aktivieren
es: Habilitar la ejecución simultánea
fr: Activer l'exécution simultanée
it: Abilitare l'esecuzione simultanea
ko: 동시 실행 사용
pl: Włącz wykonywanie współbieżne
ru: Включение параллельного выполнения
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行
zh_hant: 啟用同時執行

# EnableConcurrentExecutionTitle
source: Enable concurrent execution
de: Gleichzeitige Ausführung aktivieren
es: Habilitar la ejecución simultánea
fr: Activer l'exécution simultanée
it: Abilita l'esecuzione simultanea
ko: 동시 실행 사용
pl: Włącz wykonywanie współbieżne
ru: Включение параллельного выполнения
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行
zh_hant: 啟用同時執行

# ImplementationIsObsoleteDescription
source: The author of this interface has deprecated implementing this interface.
pl: Autor tego interfejsu oznaczył implementację tego interfejsu jako przestarzałą.
ru: Автор этого интерфейса объявил реализацию данного интерфейса нерекомендуемой.

# ImplementationIsObsoleteMessage
source: Type {0} cannot implement interface {1} because {1} is obsolete for implementation. See {2} for more details.
pl: Typ {0} nie może zaimplementować interfejsu {1}, ponieważ {1} jest przestarzały do implementacji. Zobacz {2}, aby uzyskać więcej szczegółów.
ru: Тип {0} не может реализовать интерфейс {1}, так как {1} устарел для реализации. Дополнительные сведения см. на странице {2}.

# ImplementationIsObsoleteTitle
source: Implementations of this interface are not allowed
pl: Implementacje tego interfejsu nie są dozwolone
ru: Реализации этого интерфейса не разрешены

# InvalidEntryInAnalyzerReleasesFileRuleDescription
source: Invalid entry in analyzer release file.
de: Ungültiger Eintrag in Analysetool-Releasedatei.
es: Entrada no válida en el archivo de versión del analizador.
fr: Entrée non valide dans le fichier de version d'analyseur.
it: Voce non valida nel file di versione dell'analizzatore.
ko: 분석기 릴리스 파일에 잘못된 항목이 있습니다.
pl: Nieprawidłowy wpis w pliku wydania analizatora.
ru: Недопустимая запись в файле выпуска анализатора.
tr: Çözümleyici yayın dosyasında geçersiz girdi.
zh_hans: 分析器版本文件中的条目无效。
zh_hant: 分析器版本檔案中的項目無效。

# InvalidEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an invalid entry '{1}'
de: Die Analysetool-Releasedatei "{0}" weist einen ungültigen Eintrag "{1}" auf.
es: El archivo de versión del analizador "{0}" tiene una entrada "{1}" no válida.
fr: Le fichier de version d'analyseur '{0}' contient une entrée non valide '{1}'
it: Il file di versione dell'analizzatore '{0}' contiene la voce non valida '{1}'
ko: 분석기 릴리스 파일 '{0}'에 잘못된 항목 '{1}'이(가) 있습니다.
pl: Plik wydania analizatora „{0}” ma nieprawidłowy wpis „{1}”
ru: Файл выпуска анализатора "{0}" содержит недопустимую запись "{1}"
tr: '{0}' çözümleyici yayın dosyasında geçersiz '{1}' girişi var
zh_hans: 分析器版本文件“{0}”具有无效条目“{1}”
zh_hant: 分析器版本檔案 '{0}' 具有無效的項目 '{1}'

# InvalidEntryInAnalyzerReleasesFileRuleTitle
source: Invalid entry in analyzer release file
de: Ungültiger Eintrag in Analysetool-Releasedatei
es: Entrada no válida en el archivo de versión del analizador
fr: Entrée non valide dans le fichier de version d'analyseur
it: Voce non valida nel file di versione dell'analizzatore
ko: 분석기 릴리스 파일에 잘못된 항목이 있습니다.
pl: Nieprawidłowy wpis w pliku wydania analizatora
ru: Недопустимая запись в файле выпуска анализатора
tr: Çözümleyici yayın dosyasındaki giriş geçersiz
zh_hans: 分析器版本文件中的条目无效
zh_hant: 分析器版本檔案中有無效的項目

# InvalidHeaderInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has a missing or invalid release header '{1}'
de: In der Analysetool-Releasedatei "{0}" fehlt der Releaseheader "{1}" oder ist ungültig.
es: El encabezado de versión "{1}" del archivo de versión del analizador "{0}" falta o no es válido.
fr: Le fichier de version d'analyseur '{0}' a un en-tête de version '{1}' non valide, ou celui-ci est manquant
it: Il file di versione dell'analizzatore '{0}' contiene un'intestazione di versione '{1}' mancante o non valida
ko: 분석기 릴리스 파일 '{0}'에 누락되거나 잘못된 릴리스 헤더 '{1}'이(가) 있습니다.
pl: Brak nagłówka wydania „{1}” w pliku wydania analizatora „{0}” lub jest on nieprawidłowy
ru: В файле выпуска анализатора "{0}" отсутствует заголовок выпуска или указан недопустимый заголовок выпуска "{1}"
tr: '{0}' çözümleyici yayın dosyası, eksik veya geçersiz bir yayın üst bilgisine ('{1}') sahip
zh_hans: 分析器版本文件“{0}”缺少版本标头“{1}”或该标头无效
zh_hant: 分析器版本檔案 '{0}' 缺少版本標頭 '{1}' 或其無效

source: Analyzer release file '{0}' has an invalid '{1}' entry without a prior shipped release for the rule '{2}'. Instead, add a separate '{1}' entry for the rule in unshipped release file.
de: Die Analysetool-Releasedatei "{0}" weist einen ungültigen Eintrag "{1}" ohne zuvor veröffentlichtes Release für die Regel "{2}" auf. Fügen Sie stattdessen einen separaten Eintrag "{1}" für die Regel in der nicht veröffentlichten Releasedatei hinzu.
es: El archivo de versión del analizador "{0}" tiene una entrada "{1}" no válida sin una versión incluida previamente para la regla "{2}". En su lugar, agregue una entrada "{1}" independiente para la regla en el archivo de versión no incluido.
fr: Le fichier de version d'analyseur '{0}' a une entrée '{1}' non valide sans version antérieure fournie pour la règle '{2}'. À la place, ajoutez une entrée '{1}' distincte pour la règle dans le fichier de version non fourni.
it: Il file di versione dell'analizzatore '{0}' contiene una voce '{1}' non valida senza una versione distribuita in precedenza per la regola '{2}'. Aggiungere invece una voce '{1}' distinta per la regola nel file di versione non distribuito.
ko: 분석기 릴리스 파일 '{0}'에 '{2}' 규칙에 대해 제공된 이전 릴리스가 없는 잘못된 '{1}' 항목이 있습니다. 제공되지 않은 릴리스 파일에서 해당 규칙에 대한 별도의 '{1}' 항목을 대신 추가합니다.
pl: Plik wydania analizatora „{0}” ma nieprawidłowy wpis „{1}” bez wcześniejszego dostarczonego wydania dla reguły „{2}”. Zamiast tego dodaj osobny wpis „{1}” dla reguły w niedostarczonym pliku wydania.
ru: В файле выпуска анализатора "{0}" указана недопустимая запись "{1}" без ранее отправленного выпуска для правила "{2}". Вместо этого добавьте отдельную запись "{1}" для правила в неотправленном файле выпуска.
tr: '{0}' çözümleyici yayın dosyası, '{2}' kuralı için önceden gönderilmiş bir yayın içermeyen geçersiz bir '{1}' girdisine sahip. Bunun yerine, gönderilmeyen yayın dosyasındaki kural için ayrı bir '{1}' girdisi ekleyin.
zh_hans: 分析器版本文件“{0}”具有不包含针对规则“{2}”的以前已提供版本的无效“{1}”项。请改为在未提供的版本文件中添加针对规则的单独的“{1}”项。
zh_hant: 分析器版本檔案 '{0}' 具有無效的 '{1}' 項目，該項目未包含先前所送出的規則 '{2}' 版本。請改為在未送出的版本檔案中針對規則新增個別的 '{1}' 項目。

# InvalidUndetectedEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an entry with one or more 'Undetected' fields that need to be manually filled in '{1}'
de: Die Analysetool-Releasedatei "{0}" weist einen Eintrag mit mindestens einem Feld "Nicht erkannt" auf, das in "{1}" manuell gefüllt werden muss.
es: El archivo de versión del analizador "{0}" tiene una entrada con uno o más campos "No detectado" que deben rellenarse manualmente en "{1}".
fr: Le fichier de version d'analyseur '{0}' a une entrée qui contient un ou plusieurs champs 'non détectés' qui doivent être renseignés manuellement dans '{1}'
it: Il file di versione dell'analizzatore '{0}' contiene una voce con uno o più campi 'Non rilevato' che devono essere compilati manualmente in '{1}'
ko: 분석기 릴리스 파일 '{0}'에 '{1}'에 수동으로 채워야 하는 하나 이상의 '검색되지 않은' 필드가 있는 항목이 있습니다.
pl: Plik wydania analizatora „{0}” ma wpis z co najmniej jednym polem „Niewykryte”, które należy wypełnić ręcznie w elemencie „{1}”
ru: В файле выпуска анализатора "{0}" содержится запись с одним или несколькими полями "Не обнаружено", которые необходимо заполнить вручную в "{1}".
tr: '{0}' çözümleyici yayın dosyasında, '{1}' içinde el ile doldurulması gereken en az bir 'Algılanmamış' alan içeren bir giriş var
zh_hans: 分析器版本文件“{0}”包含具有一个或多个“未检测到”字段的项，这些字段需要在“{1}”中手动填充
zh_hant: 分析器版本檔案 '{0}' 具有包含一或多個「未偵測」欄位的項目，必須手動填入 '{1}' 中

# MissingAttributeMessage
source: Missing '{0}' attribute
de: Fehlendes {0}-Attribut.
es: Falta el atributo "{0}".
fr: Attribut '{0}' manquant
it: Manca l'attributo '{0}'
ko: '{0}' 특성이 없습니다.
pl: Brak atrybutu „{0}”
ru: Отсутствует атрибут "{0}".
tr: '{0}' özniteliği eksik
zh_hans: 缺少“{0}”特性
zh_hant: 缺少 '{0}' 屬性

# MissingDiagnosticAnalyzerAttributeTitle
source: Missing diagnostic analyzer attribute
de: Fehlendes Attribut für Diagnoseanalysetool
es: Falta el atributo del analizador de diagnóstico
fr: Attribut d'analyseur de diagnostic manquant
it: Manca l'attributo dell'analizzatore diagnostico
ko: 진단 분석기 특성이 없음
pl: Brak atrybutu analizatora diagnostycznego
ru: Отсутствует атрибут диагностического анализатора
tr: Tanılama çözümleyicisi özniteliği eksik
zh_hans: 缺少诊断分析器特性
zh_hant: 缺少診斷分析器屬性
