Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: de, es, fr, it, ko, pl, ru, tr, zh_hans, zh_hant

# DoNotDeclareCSharpCompilerFeatureInAssemblyWithVisualBasicReferenceMessage
source: This C# compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.VisualBasic. The Microsoft.CodeAnalysis.VisualBasic assembly is not always provided during C# compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
de: Diese C#-Compilererweiterung sollte nicht in einer Assembly implementiert werden, die einen Verweis auf "Microsoft.CodeAnalysis.VisualBasic" enthält. Die Assembly "Microsoft.CodeAnalysis.VisualBasic" wird nicht immer in C#-Kompilierungsszenarien bereitgestellt. Verweise darauf können daher ein unvorhersehbares Verhalten der Compilererweiterung verursachen.
es: Esta extensión del compilador de C# no debe implementarse en un ensamblado que contenga una referencia a Microsoft.CodeAnalysis.VisualBasic. El ensamblado Microsoft.CodeAnalysis.VisualBasic no siempre se proporciona durante los escenarios de compilación de C#, por lo que las referencias a él podrían hacer que la extensión del compilador se comporte de forma impredecible.
fr: Cette extension de compilateur ne doit pas être implémentée dans un assembly contenant une référence à Microsoft.CodeAnalysis.Workspaces. L’assembly Microsoft.CodeAnalysis.Workspaces n’est pas fourni pendant les scénarios de compilation de ligne de commande. Par conséquent, les références à celui-ci peuvent entraîner un comportement imprévisible de l’extension du compilateur.
it: Questa estensione del compilatore C# non deve essere implementata in un assembly contenente un riferimento a Microsoft.CodeAnalysis.VisualBasic. L'assembly Microsoft.CodeAnalysis.VisualBasic non viene sempre fornito durante gli scenari di compilazione di C#, pertanto i riferimenti ad esso potrebbero causare un comportamento imprevisto dell'estensione del compilatore.
ko: 이 C# 컴파일러 확장은 Microsoft.CodeAnalysis.VisualBasic에 대한 참조를 포함하는 어셈블리에서 구현되면 안 됩니다. Microsoft.CodeAnalysis.VisualBasic 어셈블리는 C# 컴파일 시나리오 중에 항상 제공되는 것은 아니기 때문에 이를 참조하면 컴파일러 확장이 예기치 않게 동작할 수 있습니다.
pl: To rozszerzenie kompilatora języka C# nie powinno być implementowane w zestawie zawierającym odwołanie do zestawu Microsoft.CodeAnalysis.VisualBasic. Zestaw Microsoft.CodeAnalysis.VisualBasic nie jest dostarczany podczas scenariuszy kompilacji w języku C#, więc odwołania do niego mogą spowodować nieprzewidywalne działanie rozszerzenia kompilatora.
ru: Это расширение компилятора C# не следует реализовывать в сборке, содержащей ссылку на Microsoft.CodeAnalysis.VisualBasic. Сборка Microsoft.CodeAnalysis.VisualBasic не всегда предоставляется в сценариях компиляции C#, поэтому ссылки на нее могут привести к непредсказуемому поведению расширения компилятора.
tr: Bu C# derleyici uzantısı, Microsoft.CodeAnalysis.VisualBasic başvurusu içeren bir derlemede uygulanmamalıdır. Microsoft.CodeAnalysis.VisualBasic derlemesi, C# derleme senaryoları sırasında her zaman sağlanmaz, bu nedenle ona yapılan başvurular derleyici uzantısının beklenmedik şekilde davranmasına neden olabilir.
zh_hans: 不应在包含对 Microsoft.CodeAnalysis.VisualBasic 的引用的程序集中实现此 C# 编译器扩展。在 C# 编译方案期间，不会始终提供 Microsoft.CodeAnalysis.VisualBasic 程序集，因此对它的引用可能导致编译器扩展的行为不可预测。
zh_hant: 此 C# 編譯器延伸模組不應該在包含 Microsoft.CodeAnalysis.VisualBasic 參考的組件中實作。Microsoft.CodeAnalysis.VisualBasic 組件未一律在 C# 編譯案例期間提供，因此參考它可能會導致編譯器延伸模組發生未預期的行為。

# DoNotDeclareCompilerFeatureInAssemblyWithUnsupportedTargetFrameworkMessage
source: This compiler extension should not be implemented in an assembly with target framework '{0}'. References to other target frameworks will cause the compiler to behave unpredictably.
de: Diese Compilererweiterung sollte nicht in einer Assembly mit dem Zielframework "{0}" implementiert werden. Verweise auf andere Zielframeworks führen dazu, dass sich der Compiler unvorhersehbar verhält.
es: Esta extensión del compilador no debe implementarse en un ensamblado con la plataforma de destino '{0}'. Las referencias a otras plataformas de destino harán que el compilador se comporte de forma imprevisible.
fr: Cette extension de compilateur ne doit pas être implémentée dans un assembly avec la version cible de .Net Framework « {0} ». Les références à d’autres versions cible de .Net Framework entraînent un comportement imprévisible du compilateur.
it: Questa estensione del compilatore non deve essere implementata in un assembly con framework di destinazione '{0}'. I riferimenti ad altri framework di destinazione determineranno un comportamento imprevisto del compilatore.
ko: 이 컴파일러 확장은 대상 프레임워크 '{0}'가 있는 어셈블리에서 구현되어서는 안 됩니다. 다른 대상 프레임워크를 참조하면 컴파일러가 예기치 않게 동작합니다.
pl: To rozszerzenie kompilatora nie powinno być wdrażane w zestawie z platformą docelową „{0}”. Odwołania do innych platform docelowych spowodują nieprzewidywalne zachowanie kompilatora.
ru: Это расширение компилятора не должно быть реализовано в сборке с требуемой версией .NET Framework "{0}". Ссылки на другие требуемые версии .NET Framework приведут к непредсказуемому поведению компилятора.
tr: Bu derleyici uzantısı, '{0}' hedef çerçevesine sahip bir derlemede uygulanmamalıdır. Diğer hedef çerçevelere yapılan başvurular derleyicinin öngörülemeyen şekilde davranmasına neden olur.
zh_hans: 不应在具有目标框架“{0}”的程序集中实现此编译器扩展。引用其他目标框架将导致编译器的行为不可预测。
zh_hant: 此編譯器延伸模組不應該在目標架構為 '{0}' 的元件中實作。參考其他目標架構會導致編譯器發生無法預測的行為。

source: Types which implement compiler extension points should only be declared in assemblies targeting netstandard2.0. More specific target frameworks are only available in a subset of supported compilation scenarios, so targeting them may cause the feature to behave unpredictably.
de: Typen, die Compilererweiterungspunkte implementieren, dürfen nur in Assemblys für netstandard2.0 deklariert werden. Spezifischere Zielframeworks sind nur in einer Teilmenge der unterstützten Kompilierungsszenarien verfügbar, weshalb das Festlegen der Zielframeworks dazu führen kann, dass sich das Feature unvorhersehbar verhält.
es: Los tipos que implementan puntos de extensión del compilador solo deben declararse en ensamblados que tengan como destino netstandard2.0. Las plataformas de destino más específicas solo están disponibles en un subconjunto de escenarios de compilación admitidos, por lo que establecerlas como destino puede provocar que la característica se comporte de forma impredecible.
fr: Les types qui implémentent des points d’extension du compilateur doivent uniquement être déclarés dans les assemblys ciblant netstandard2.0. Les versions cible de .Net Framework plus spécifiques sont disponibles uniquement dans un sous-ensemble de scénarios de compilation pris en charge. Par conséquent, leur ciblage peut entraîner un comportement imprévisible de la fonctionnalité.
it: I tipi che implementano punti di estensione del compilatore devono essere dichiarati solo in assembly destinati a netstandard2.0. I framework di destinazione più specifici sono disponibili solo in un subset di scenari di compilazione supportati, di conseguenza la destinazione potrebbe causare un comportamento imprevisto della funzionalità.
ko: 컴파일러 확장 지점을 구현하는 형식은 netstandard2.0을 대상으로 하는 어셈블리에서만 선언되어야 합니다. 보다 구체적인 대상 프레임워크는 지원되는 컴파일 시나리오의 하위 집합에서만 사용할 수 있으므로 해당 프레임워크를 대상으로 지정하면 기능이 예기치 않게 동작할 수 있습니다.
pl: Typy wdrażające punkty rozszerzenia kompilatora powinny być deklarowane tylko w zestawach z odwołaniami netstandard2.0. Bardziej określone platformy docelowe są dostępne tylko w podzbiorze obsługiwanych scenariuszy kompilacji, więc odwołanie do nich może spowodować nieprzewidywalne działanie funkcji.
ru: Типы, реализующие точки расширения компилятора, следует объявлять только в сборках, ориентированных на netstandard2.0. Более конкретные целевые платформы доступны только в подмножестве поддерживаемых сценариев компиляции, поэтому их нацеливание может привести к непредсказуемому поведению функции.
tr: Derleyici uzantı noktalarını uygulayan türler yalnızca netstandard2.0'ı hedefleyen derlemelerde tanımlanabilir. Daha belirli hedef çerçeveler yalnızca desteklenen derleme senaryolarının bir alt kümesinde kullanılabilir, bu nedenle bunları hedeflemek özelliğin öngörülemeyen şekilde davranmasına neden olabilir.
zh_hans: 实现编译器扩展点的类型只应在面向 netstandard2.0 的程序集中声明。更具体的目标框架仅在受支持的编译方案的子集中可用，因此面向这些框架可能会导致该功能的行为不可预测。
zh_hant: 實作編譯器擴充點的類型，只應在以 netstandard2.0 為目標的組件中宣告。更特定的目標架構僅適用於支援的編譯案例子集，因此以它們為目標可能會導致功能發生無法預期的行為。

# DoNotDeclareCompilerFeatureInAssemblyWithUnsupportedTargetFrameworkRuleTitle
source: Compiler extensions should be implemented in assemblies targeting netstandard2.0
de: Compilererweiterungen sollten in Assemblys implementiert werden, die netstandard2.0 als Ziel verwenden
es: Las extensiones del compilador deben implementarse en ensamblados que tengan como destino netstandard2.0
fr: Les extensions du compilateur doivent être implémentées dans les assemblys ciblant netstandard2.0
it: Le estensioni del compilatore devono essere implementate negli assembly destinati a netstandard2.0
ko: 컴파일러 확장은 netstandard2.0을 대상으로 하는 어셈블리에서 구현되어야 합니다.
pl: Rozszerzenia kompilatora powinny być wdrażane w zestawach z odwołaniami netstandard2.0
ru: Расширения компилятора должны быть реализованы в сборках, ориентированных на netstandard2.0.
tr: Derleyici uzantıları, netstandard2.0’ı hedefleyen derlemelerde uygulanmalıdır.
zh_hans: 应在面向 netstandard2.0 的程序集中实现编译器扩展
zh_hant: 編譯器延伸模組應在以 netstandard2.0 為目標的組件中實作

# DoNotDeclareCompilerFeatureInAssemblyWithWorkspacesReferenceMessage
source: This compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.Workspaces. The Microsoft.CodeAnalysis.Workspaces assembly is not provided during command line compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
de: Diese Compilererweiterung sollte nicht in einer Assembly implementiert werden, die einen Verweis auf "Microsoft.CodeAnalysis.Workspaces" enthält. Die Assembly "Microsoft.CodeAnalysis.Workspaces" wird in Befehlszeilen-Kompilierungsszenarien nicht bereitgestellt. Verweise darauf können daher ein unvorhersehbares Verhalten der Compilererweiterung verursachen.
es: Esta extensión del compilador no debe implementarse en un ensamblado que contenga una referencia a Microsoft.CodeAnalysis.Workspaces. El ensamblado Microsoft.CodeAnalysis.Workspaces no se proporciona durante los escenarios de compilación de la línea de comandos, por lo que las referencias a él podrían hacer que la extensión del compilador se comporte de forma impredecible.
fr: Cette extension de compilateur ne doit pas être implémentée dans un assembly contenant une référence à Microsoft.CodeAnalysis.Workspaces. L’assembly Microsoft.CodeAnalysis.Workspaces n’est pas fourni pendant les scénarios de compilation de ligne de commande. Par conséquent, les références à celui-ci peuvent entraîner un comportement imprévisible de l’extension du compilateur.
it: Questa estensione del compilatore non deve essere implementata in un assembly contenente un riferimento a Microsoft.CodeAnalysis.Workspaces. L'assembly Microsoft.CodeAnalysis.Workspaces non viene fornito durante gli scenari di compilazione da riga di comando, pertanto i riferimenti ad esso potrebbero causare un comportamento imprevisto dell'estensione del compilatore.
ko: 이 컴파일러 확장은 Microsoft.CodeAnalysis.Workspaces에 대한 참조를 포함하는 어셈블리에서 구현되면 안 됩니다. Microsoft.CodeAnalysis.Workspaces 어셈블리는 명령줄 컴파일 시나리오 중에 제공되지 않기 때문에 이를 참조하면 컴파일러 확장이 예기치 않게 동작할 수 있습니다.
pl: To rozszerzenie kompilatora nie powinno być implementowane w zestawie zawierającym odwołanie do zestawu Microsoft.CodeAnalysis.Workspaces. Zestaw Microsoft.CodeAnalysis.Workspaces nie został dostarczony podczas scenariuszy kompilacji wiersza polecenia, więc odwołania do niego mogą spowodować nieprzewidywalne działanie rozszerzenia kompilatora.
ru: Это расширение компилятора не следует реализовывать в сборке, содержащей ссылку на Microsoft.CodeAnalysis.Workspaces. Сборка Microsoft.CodeAnalysis.Workspaces не предоставляется в сценариях компиляции из командной строки, поэтому ссылки на нее могут привести к непредсказуемому поведению расширения компилятора.
tr: Bu derleyici uzantısı, Microsoft.CodeAnalysis.Çalışma Alanları başvurusunu içeren bir derlemede uygulanmamalıdır. Microsoft.CodeAnalysis.Çalışma Alanları derlemesi, komut satırı derleme senaryoları sırasında sağlanmaz, dolayısıyla buna yapılan başvurular, derleyici uzantısının beklenmedik şekilde davranmasına neden olabilir.
zh_hans: 不应在包含对 Microsoft.CodeAnalysis.Workspaces 的引用的程序集中实现此编译器扩展。在命令行编译方案期间未提供 Microsoft.CodeAnalysis.Workspaces 程序集，因此对它的引用可能导致编译器扩展的行为不可预测。
zh_hant: 此編譯器延伸模組不應該在包含 Microsoft.CodeAnalysis.Workspaces 參考的組件中實作。Microsoft.CodeAnalysis.Workspaces 組件未在命令列編譯案例期間提供，因此參考它可能會導致編譯器延伸模組發生未預期的行為。

# DoNotDeclareVisualBasicCompilerFeatureInAssemblyWithCSharpReferenceMessage
source: This Visual Basic compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.CSharp. The Microsoft.CodeAnalysis.CSharp assembly is not always provided during Visual Basic compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
de: Diese Visual Basic-Compilererweiterung sollte nicht in einer Assembly implementiert werden, die einen Verweis auf "Microsoft.CodeAnalysis.CSharp" enthält. Die Assembly "Microsoft.CodeAnalysis.CSharp" wird nicht immer in Visual Basic-Kompilierungsszenarien bereitgestellt. Verweise darauf können daher ein unvorhersehbares Verhalten der Compilererweiterung verursachen.
es: Esta extensión del compilador de Visual Basic no debe implementarse en un ensamblado que contenga una referencia a Microsoft.CodeAnalysis.CSharp. El ensamblado Microsoft.CodeAnalysis.CSharp no siempre se proporciona durante los escenarios de compilación de Visual Basic, por lo que las referencias a él podrían hacer que la extensión del compilador se comportara de forma impredecible.
fr: Cette extension de compilateur Visual Basic ne doit pas être implémentée dans un assembly contenant une référence à Microsoft.CodeAnalysis.CSharp. L’assembly Microsoft.CodeAnalysis.CSharp n’étant pas toujours fourni pendant Visual Basic scénarios de compilation, les références à celui-ci peuvent entraîner le comportement imprévisible de l’extension du compilateur.
it: Questa estensione del compilatore di Visual Basic non deve essere implementata in un assembly contenente un riferimento a Microsoft.CodeAnalysis.CSharp. L'assembly Microsoft.CodeAnalysis.CSharp non viene sempre fornito durante gli scenari di compilazione di Visual Basic, pertanto i riferimenti ad esso potrebbero causare un comportamento imprevisto dell'estensione del compilatore.
ko: 이 Visual Basic 컴파일러 확장은 Microsoft.CodeAnalysis.CSharp에 대한 참조를 포함하는 어셈블리에서 구현되면 안 됩니다. Microsoft.CodeAnalysis.CSharp 어셈블리는 Visual Basic 컴파일 시나리오 중에 항상 제공되는 것은 아니기 때문에 이를 참조하면 컴파일러 확장이 예기치 않게 동작할 수 있습니다.
pl: To rozszerzenie kompilatora języka Visual Basic nie powinno być implementowane w zestawie zawierającym odwołanie do zestawu Microsoft.CodeAnalysis.CSharp. Zestaw Microsoft.CodeAnalysis.CSharp nie jest dostarczany podczas scenariuszy kompilacji w języku Visual Basic, więc odwołania do niego mogą spowodować nieprzewidywalne działanie rozszerzenia kompilatora.
ru: Это расширение компилятора Visual Basic не следует реализовывать в сборке, содержащей ссылку на Microsoft.CodeAnalysis.CSharp. Сборка Microsoft.CodeAnalysis.CSharp не всегда предоставляется в сценариях компиляции Visual Basic, поэтому ссылки на нее могут привести к непредсказуемому поведению расширения компилятора.
tr: Bu Visual Basic derleyici uzantısı, Microsoft.CodeAnalysis.CSharp başvurusunu içeren bir derlemede uygulanmamalıdır. Microsoft.CodeAnalysis.CSharp derlemesi, Visual Basic derleme senaryoları sırasında her zaman sağlanmaz, bu nedenle derlemeye yapılan başvurular derleyici uzantısının beklenmedik şekilde davranmasına neden olabilir.
zh_hans: 不应在包含对 Microsoft.CodeAnalysis.CSharp 的引用的程序集中实现此 Visual Basic 编译器扩展。Microsoft.CodeAnalysis.CSharp 程序集并非始终在 Visual Basic 编译方案中提供，因此对它的引用可能导致编译器扩展的行为不可预测。
zh_hant: 此 Visual Basic 編譯器延伸模組不應該在包含 Microsoft.CodeAnalysis.CSharp 參考的組件中實作。Microsoft.CodeAnalysis.CSharp 組件未一律在 Visual Basic 編譯案例期間提供，因此參考它可能會導致編譯器延伸模組發生未預期的行為。

# DoNotRegisterCompilerTypesWithBadAssemblyReferenceRuleDescription
source: Types which implement compiler extension points should not be declared in assemblies that contain references to assemblies which are not provided by all compilation scenarios. Doing so may cause the feature to behave unpredictably.
de: Typen, die Compilererweiterungspunkte implementieren, sollten nicht in Assemblys deklariert werden, die Verweise auf Assemblys enthalten, die nicht von allen Kompilierungsszenarien bereitgestellt werden. Andernfalls kann sich das Feature unvorhersehbar verhalten.
es: Los tipos que implementan puntos de extensión del compilador no deben declararse en ensamblados que contengan referencias a ensamblados que no se proporcionan en todos los escenarios de compilación. Si lo hace, la característica puede comportarse de forma impredecible.
fr: Les types qui implémentent des points d’extension du compilateur ne doivent pas être déclarés dans les assemblys qui contiennent des références à des assemblys qui ne sont pas fournis par tous les scénarios de compilation. Cela peut entraîner un comportement imprévisible de la fonctionnalité.
it: I tipi che implementano i punti di estensione del compilatore non devono essere dichiarati in assembly che contengono riferimenti ad assembly non forniti da tutti gli scenari di compilazione. Ciò potrebbe causare un comportamento imprevisto della funzionalità.
ko: 컴파일러 확장 지점을 구현하는 형식은 모든 컴파일 시나리오에서 제공되는 어셈블리에 대한 참조를 포함하는 어셈블리에서 선언해야 합니다. 그렇지 않으면 기능이 예기치 않게 동작할 수 있습니다.
pl: Typy implementujące punkty rozszerzenia kompilatora nie powinny być deklarowane w zestawach zawierających odwołania do zestawów, które nie są dostarczane przez wszystkie scenariusze kompilacji. Wykonanie tej czynności może spowodować nieprzewidywalne zachowanie funkcji.
ru: Типы, реализующие точки расширения компилятора, не следует объявлять в сборках, содержащих ссылки на сборки, которые не предоставляются всеми сценариями компиляции. Это может привести к непредсказуемому поведению функции.
tr: Derleyici uzantı noktalarını uygulayan türler, tüm derleme senaryoları tarafından sağlanmayan derlemelere başvurular içeren derlemelerde bildirilmemelidir. Bunu yapmak, özelliğin öngörülemeyen şekilde davranmasına neden olabilir.
zh_hans: 在包含对并非由所有编译方案提供的程序集的引用的程序集中，不应声明实现编译器扩展点的类型。这样做可能会导致该功能的行为不可预测。
zh_hant: 實作編譯器延伸模組點不應在包含未由所有編譯案例提供的組件參考的組件中宣告的類型。這樣做可能會導致功能發生無法預測的行為。

# DoNotRegisterCompilerTypesWithBadAssemblyReferenceRuleTitle
source: Compiler extensions should be implemented in assemblies with compiler-provided references
de: Compilererweiterungen sollten in Assemblys mit vom Compiler bereitgestellten Verweisen implementiert werden
es: Las extensiones del compilador deben implementarse en ensamblados con referencias proporcionadas por el compilador
fr: Les extensions du compilateur doivent être implémentées dans les assemblys avec des références fournies par le compilateur
it: Le estensioni del compilatore devono essere implementate negli assembly con riferimenti forniti dal compilatore.
ko: 컴파일러 확장은 컴파일러 제공 참조가 있는 어셈블리에서 구현해야 합니다.
pl: Rozszerzenia kompilatora powinny być implementowane w zestawach z odwołaniami dostarczonymi przez kompilator
ru: Расширения компилятора должны быть реализованы в сборках с предоставленными компилятором ссылками.
tr: Derleyici uzantıları, derleyici tarafından sağlanan referanslara sahip derlemelerde uygulanmalıdır.
zh_hans: 应在具有编译器提供的引用的程序集中实现编译器扩展
zh_hant: 編譯器延伸模組應該在具有編譯器提供參考的組件中實作
