Repository: dotnet/roslyn
Catalog: src/Interactive/Host/xlf/InteractiveHostResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pt_br, ru, zh_hant

# Attempt_to_connect_to_process_Sharp_0_failed_retrying
source: Attempt to connect to process #{0} failed, retrying ...
cs: Pokus o připojení k procesu #{0} se nepovedl. Akce se opakuje...
de: Verbinden mit dem Prozess #{0} fehlgeschlagen, wird wiederholt ...
es: Error al intentar conectar con el proceso #{0}, reintentando...
fr: Échec de la connexion au processus n° {0}. Nouvelle tentative...
ja: プロセス #{0} に接続できませんでした。再試行しています...
ko: #{0} 프로세스에 연결하지 못했습니다. 다시 시도하고 있습니다.
pt_br: Tentativa para conectar ao processo #{0} falhou, repetindo...
ru: Сбой попытки подключения к процессу #{0}, выполнение повторной попытки...
zh_hant: 嘗試連接到處理序 #{0} 失敗，正在重試...

source: Cannot resolve reference '{0}'.
cs: Nejde vyřešit odkaz {0}.
de: Verweis "{0}" konnte nicht aufgelöst werden.
es: No se puede resolver la referencia '{0}'.
fr: Impossible de résoudre la référence '{0}'.
ja: 参照 '{0}' を解決できません。
ko: {0}' 참조를 확인할 수 없습니다.
pt_br: Não é possível resolver a referência "{0}".
ru: Не удается разрешить ссылку "{0}".
zh_hant: 無法解析參考 '{0}'。

# Failed_to_create_a_remote_process_for_interactive_code_execution
source: Failed to create a remote process for interactive code execution: '{0}'
cs: Nepovedlo se vytvořit vzdálený proces pro provádění interaktivního kódu: {0}
es: No se pudo crear un proceso remoto para la ejecución de código interactivo: "{0}"
zh_hant: 無法為互動式程式碼執行建立遠端處理序: '{0}'

source: Failed to initialize remote interactive process.
cs: Nepodařilo se inicializovat vzdálený interaktivní proces.
de: Der interaktive Remoteprozess konnte nicht initialisiert werden.
es: Error al inicializar el proceso remoto interactivo.
fr: Échec de l'initialisation de processus interactif à distance.
ja: リモートの対話型プロセスを初期化できませんでした。
ko: 원격 대화형 프로세스를 초기화하지 못했습니다.
pt_br: Falha ao inicializar o processo interativo remoto.
ru: Не удалось инициализировать удаленный интерактивный процесс.
zh_hant: 無法初始化遠端互動式處理序。

# Failed_to_launch_0_process_exit_code_colon_1_with_output_colon
source: Failed to launch '{0}' process (exit code: {1}) with output:
cs: Nepodařilo se spustit proces {0} (ukončovací kód: {1}) s výstupem:
de: "{0}"-Prozess konnte nicht gestartet werden (Beendigungscode: {1}) mit Ausgabe:
es: Error al iniciar el proceso '{0}' (código de salida: {1}) con la salida:
fr: Échec du lancement du processus '{0}' (code de sortie : {1}) avec la sortie :
ja: 次の出力がある '{0}' プロセスを起動できませんでした (終了コード: {1}):
ko: 출력에서 '{0}' 프로세스(종료 코드: {1})를 실행하지 못했습니다.
pt_br: Falha ao iniciar o "{0}" processo (código de saída: {1}) com saída:
ru: Не удалось запустить процесс "{0}" (код выхода: {1}) с выходными данными:
zh_hant: 無法啟動 '{0}' 處理序 (結束代碼: {1})，輸出如下:

source: Hosting process exited with exit code {0}.
cs: Hostovací proces skončil s ukončovacím kódem {0}.
de: Der Hostprozess wurde mit dem Exitcode "{0}" beendet.
es: El proceso de hospedaje terminó con el código de salida {0}.
fr: Le processus d'hébergement s'est arrêté avec le code de sortie {0}.
ja: ホスティング プロセスは終了コード {0} で終了しました。
ko: 호스팅 프로세스가 종료되었습니다(종료 코드: {0}).
pt_br: O processo de hospedagem saiu com o código de saída {0}.
ru: Ведущий процесс завершен, код завершения: {0}.
zh_hant: 裝載處理序已結束，結束代碼為 {0}。

source: Interactive Host not initialized.
cs: Interaktivní hostitel není inicializovaný.
de: Interaktiver Host nicht initialisiert.
es: Host interactivo no inicializado.
fr: L'hôte interactif n'est pas initialisé.
ja: 対話型ホストが初期化されていません。
ko: 대화형 호스트가 초기화되지 않았습니다.
pt_br: Host interativo não inicializado.
ru: Интерактивный узел не инициализирован.
zh_hant: 未初始化互動式主機。

source: Loading context from '{0}'.
cs: Načítá se kontext z {0}.
de: Kontext aus "{0}" wird geladen.
es: Cargando contexto de '{0}'.
fr: Chargement du contexte de '{0}'.
ja: {0}' からコンテキストを読み込んでいます。
ko: {0}'에서 컨텍스트를 로드하는 중입니다.
pt_br: Carregando contexto de "{0}".
ru: Загрузка контекста из "{0}".
zh_hant: 正在載入 '{0}' 的內容。

# Searched_in_directories_colon
source: Searched in directories:
cs: Prohledané adresáře:
de: Gesucht in den Verzeichnissen:
es: Buscado en directorios:
fr: Recherche effectuée dans les répertoires :
ja: ディレクトリで検索されました:
ko: 디렉터리에서 검색됨:
pt_br: Pesquisado nos diretórios:
ru: Поиск в каталогах:
zh_hant: 在下列目錄中搜尋:

# Searched_in_directory_colon
source: Searched in directory:
cs: Prohledaný adresář:
de: Gesucht im Verzeichnis:
es: Buscado en directorio:
fr: Recherche effectuée dans le répertoire :
ja: 検索されたディレクトリ:
ko: 디렉터리에서 검색됨:
pt_br: Pesquisado no diretório:
ru: Поиск в каталоге:
zh_hant: 在下列目錄中搜尋:

source: Specified file not found.
cs: Zadaný soubor se nenašel.
de: Angegebene Datei nicht gefunden.
es: Archivo especificado no encontrado.
fr: Fichier spécifié introuvable.
ja: 指定されたファイルが見つかりません。
ko: 지정한 파일을 찾을 수 없습니다.
pt_br: Arquivo especificado não encontrado.
ru: Указанный файл не найден.
zh_hant: 找不到指定的檔案

# Specified_file_not_found_colon_0
source: Specified file not found: {0}
cs: Nenalezený určený soubor: {0}
de: Angegebene Datei nicht gefunden: {0}
es: Archivo especificado no encontrado: {0}
fr: Fichier spécifié introuvable : {0}
ja: 指定されたファイルが見つかりません: {0}
ko: 지정한 파일을 찾을 수 없음: {0}
pt_br: Arquivo especificado não encontrado. {0}
ru: Указанный файл не найден: {0}
zh_hant: 找不到指定的檔案: {0}

# Type_Sharphelp_for_more_information
source: Type "#help" for more information.
cs: Zadáním #help si zobrazíte víc informací.
de: Weitere Informationen erhalten Sie nach der Eingabe von "#help".
es: Escriba "#help" para más información.
fr: Tapez "#help" pour plus d'informations.
ja: 詳細については、「#help」と入力します。
ko: 자세한 내용을 보려면 "#help"를 입력하세요.
pt_br: Digite "#help" para obter mais informações.
ru: Введите "#help" для получения дополнительных сведений.
zh_hant: 如需詳細資訊，請輸入 "#help"。

source: Unable to create hosting process.
cs: Nelze vytvořit hostovací proces.
de: Der Hostprozess kann nicht erstellt werden.
es: No se puede crear el proceso de hospedaje.
fr: Impossible de créer le processus d'hébergement.
ja: ホスティング プロセスを作成できません。
ko: 호스팅 프로세스를 만들 수 없습니다.
pt_br: Não é possível criar o processo de hospedagem.
ru: Не удалось создать ведущий процесс.
zh_hant: 無法建立裝載處理序。

# plus_additional_0_1
source: + additional {0} {1}
cs: + dalších {0} {1}
de: + zusätzlich {0} {1}
es: + adicional {0} {1}
fr: + {0} {1} supplémentaire
ja: + 追加の {0} {1}
ko: + 추가 {0} {1}
pt_br: + adicional {0} {1}
ru: + дополнительный {0} {1}
zh_hant: + 額外的 {0} {1}

source: Failed to create a remote process for interactive code execution.
fr: Échec de la création d'un processus à distance pour l'exécution de code interactif.
