Repository: dotnet/roslyn
Catalog: src/Analyzers/Core/Analyzers/xlf/AnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Remove unused parameter '{0}' if it is not part of a shipped public API
de: Nicht verwendeten Parameter "{0}" entfernen, wenn dieser nicht Bestandteil einer öffentlich verfügbaren API ist
es: Quitar el parámetro "{0}" sin usar si no forma parte de una API pública enviada
fr: Supprimer le paramètre inutilisé '{0}' si celui-ci ne fait pas partie d’une API publique livrée
it: Rimuovi il parametro inutilizzato '{0}' se non fa parte di un'API pubblica fornita
ja: 未使用のパラメーター '{0}' が同梱のパブリック API の一部ではない場合に削除します
ko: 제공된 공용 API의 일부가 아닌 경우 사용하지 않는 매개 변수 '{0}' 제거
pl: Usuń nieużywany parametr „{0}”, jeśli nie jest częścią dostarczonego publicznego API
pt_br: Remover o parâmetro não usado '{0}' se ele não fizer parte de uma API pública enviada
ru: Удалить неиспользуемый параметр "{0}", если он не является частью предоставляемого общедоступного API
tr: Kullanılmayan '{0}' parametresi gönderilmiş bir genel API'nin parçası değilse parametreyi kaldırın
zh_hans: 如果未使用的参数 "{0}" 不是已发布的公共 api 的一部分, 请将其删除
zh_hant: 如果未使用的參數 ‘{0}’ 不屬於已發行的公用 API，請予以移除

source: Remove unused private members
de: Nicht verwendete private Member entfernen
es: Quitar miembros privados no utilizados
fr: Supprimer les membres privés non utilisés
it: Rimuovi i membri privati inutilizzati
ja: 使用されていないプライベート メンバーを削除する
ko: 사용되지 않는 private 멤버 제거
pl: Usuń nieużywane prywatne składowe
pt_br: Remover membros privados não utilizados
ru: Удалите неиспользуемые закрытые члены
tr: Kullanılmayan özel üyeleri kaldır
zh_hans: 删除未使用的私有成员
zh_hant: 刪除未使用的私用成員

source: Set MSBuild property 'GenerateDocumentationFile' to 'true'
de: MSBuild-Eigenschaft "GenerateDocumentationFile" auf "true" festlegen
es: Establecer la propiedad de MSBuild "GenerateDocumentationFile" en "true"
ja: MSBuild プロパティ 'GenerateDocumentationFile' を 'true' に設定します
ko: MSBuild 속성 'GenerateDocumentationFile'을 'true'로 설정
pl: Ustaw właściwość MSBuild „GenerateDocumentationFile” na wartość „true”
pt_br: Definir a propriedade 'GenerateDocumentationFile' do MSBuild como 'true'
tr: 'GenerateDocumentationFile' MSBuild özelliğini 'true' olarak ayarlayın
zh_hans: 将 MSBuild 属性 "GenerateDocumentationFile" 设置为 "true"
zh_hant: 將 MSBuild 屬性 'GenerateDocumentationFile' 設為 'true'

source: Set MSBuild property 'GenerateDocumentationFile' to 'true' in project file to enable IDE0005 (Remove unnecessary usings/imports) on build
de: Legen Sie die MSBuild-Eigenschaft "GenerateDocumentationFile" in der Projektdatei auf "true" fest, um IDE0005 (Nicht benötigte Using-Direktiven/Importe entfernen) beim Build zu aktivieren.
es: Establecer la propiedad de MSBuild "GenerateDocumentationFile" en "true" en el archivo de proyecto para habilitar IDE0005 (quitar instrucciones using o importaciones innecesarias) en la compilación
ja: ビルドで IDE0005 (不要な usings/imports を削除する) を有効にするには、プロジェクト ファイルで MSBuild プロパティ 'GenerateDocumentationFile' を 'true' に設定します
ko: 빌드 시 IDE0005(불필요한 using/imports 제거)를 사용하도록 설정하려면 프로젝트 파일에서 MSBuild 속성 'GenerateDocumentationFile'을 'true'로 설정합니다.
pl: Ustaw właściwość MSBuild „GenerateDocumentationFile” na wartość „true” w pliku projektu, aby włączyć środowisko IDE0005 (usuń niepotrzebne operacje użycia/importu) w kompilacji
pt_br: Defina a propriedade 'GenerateDocumentationFile' do MSBuild como 'true' no arquivo de projeto para habilitar IDE0005 (Remover usos/importações desnecessários) no build
tr: Derlemede IDE0005'i (Gereksiz kullanımları/içe aktarmaları kaldırın) etkinleştirmek için proje dosyasında MSBuild özelliğini 'GenerateDocumentationFile' 'true' olarak ayarlayın
zh_hans: 在项目文件中将 MSBuild 属性 "GenerateDocumentationFile" 设置为 "true"，以在生成时启用 IDE0005 (删除不必要的使用/导入)
zh_hant: 如要在組建上啟用 IDE0005 (移除不必要的 using/import)，請在專案檔中將 MSBuild 屬性 'GenerateDocumentationFile' 設為 'true'

source: Simplify LINQ expression
de: LINQ-Ausdruck vereinfachen
es: Simplificar la expresión LINQ
ja: LINQ 式を簡略化する
ko: LINQ 식 단순화
pl: Uprość wyrażenie LINQ
pt_br: Simplificar a expressão LINQ
tr: LINQ ifadesini basitleştir
zh_hans: 简化 LINQ 表达式
zh_hant: 簡化 LINQ 運算式

source: Simplify Member Access
de: Memberzugriff vereinfachen
es: Simplificar acceso de miembros
ja: メンバー アクセスを単純化します
ko: 멤버 액세스 단순화
pl: Uprość dostęp do składowej
pt_br: Simplificar o Acesso de Membro
tr: Üye Erişimini Basitleştir
zh_hans: 简化成员访问
zh_hant: 簡化成員存取

source: Simplify Names
de: Namen vereinfachen
es: Simplificar nombres
ja: 名前を単純化します
ko: 이름 단순화
pl: Uprość nazwy
pt_br: Simplificar Nomes
tr: Adları Basitleştir
zh_hans: 简化名称
zh_hant: 簡化名稱

source: Simplify check
de: Überprüfung vereinfachen
es: Simplificar comprobación
ja: チェックの簡略化
ko: 검사 단순화
pl: Uprość kontrolę
pt_br: Simplificar a verificação
tr: Denetimi basitleştir
zh_hans: 简化检查
zh_hant: 簡化檢查

source: Simplify collection initialization
de: Initialisierung der Sammlung vereinfachen
es: Simplificar la inicialización de la recopilación
fr: Simplifier l'initialisation des collections
it: Semplifica l'inizializzazione della raccolta
ja: コレクションの初期化を簡略化します
ko: 컬렉션 초기화 단순화
pl: Uprość inicjowanie kolekcji
pt_br: Simplificar a inicialização de coleção
ru: Упростите инициализацию коллекции
tr: Koleksiyon başlatmayı kolaylaştır
zh_hans: 简化集合初始化
zh_hant: 簡化集合初始化

source: Simplify conditional expression
de: Bedingten Ausdruck vereinfachen
es: Simplificar la expresión condicional
ja: 条件式を簡略化する
ko: 조건식 단순화
pl: Uprość wyrażenie warunkowe
pt_br: Simplificar a expressão condicional
tr: Koşullu ifadeyi basitleştir
zh_hans: 简化条件表达式
zh_hant: 簡化條件運算式

source: Simplify interpolation
de: Interpolation vereinfachen
es: Simplificar la interpolación
fr: Simplifier l’interpolation
it: Semplifica l'interpolazione
ja: 補間の簡略化
ko: 보간 단순화
pl: Uprość interpolację
pt_br: Simplificar interpolação
tr: İlişkilendirmeyi basitleştir
zh_hans: 简化内插
zh_hant: 簡化內插補點

source: Simplify object initialization
de: Initialisierung von Objekten vereinfachen
es: Simplificar la inicialización de objetos
fr: Simplifier l'initialisation des objets
it: Semplifica l'inizializzazione degli oggetti
ja: オブジェクトの初期化を簡略化します
ko: 개체 초기화 단순화
pl: Uprość inicjowanie obiektów
pt_br: Simplificar a inicialização de objeto
ru: Упростите инициализацию объекта
tr: Nesne başlatmayı kolaylaştır
zh_hans: 简化对象初始化
zh_hant: 簡化物件初始化

source: Suppression is unnecessary
ja: 抑制は不要です
pl: Pomijanie jest zbędne
tr: Engelleme gereksiz
zh_hans: 抑制是不必要的
zh_hant: 不需要抑制

source: The file header does not match the required text
de: Der Dateiheader stimmt nicht mit dem erforderlichen Text überein.
es: El encabezado de archivo no coincide con el texto requerido.
fr: L'en-tête du fichier ne correspond pas au texte nécessaire
it: L'intestazione del file non corrisponde al testo obbligatorio
ja: ファイル ヘッダーが、必要なテキストと一致しません
ko: 파일 헤더가 필요한 텍스트와 일치하지 않습니다.
pl: Nagłówek pliku nie jest zgodny z wymaganym tekstem
pt_br: O cabeçalho do arquivo não corresponde ao texto necessário
ru: Заголовок файла не соответствует требуемому тексту
tr: Dosya üst bilgisi gerekli metinle eşleşmiyor
zh_hans: 文件标题与所需文本不匹配
zh_hant: 檔案標頭與必要文字不相符

source: The file header is missing or not located at the top of the file
de: Der Dateiheader fehlt oder befindet sich nicht am Anfang der Datei.
es: Falta el encabezado del archivo o no se encuentra en la parte superior del archivo.
fr: L'en-tête du fichier est manquant ou ne se trouve pas en haut du fichier
it: L'intestazione del file manca o non si trova all'inizio del file
ja: ファイル ヘッダーが存在しないか、ファイルの先頭にありません
ko: 파일 헤더가 없거나 파일 맨 위에 없습니다.
pl: Brak nagłówka pliku lub nie znajduje się on w górnej części pliku
pt_br: O cabeçalho do arquivo está ausente ou não está localizado na parte superior do arquivo
ru: Заголовок файла отсутствует или находится не в начале файла
tr: Dosya üst bilgisi eksik veya dosyanın en üstünde yer almıyor
zh_hans: 文件标题缺失或没有位于文件的顶部
zh_hant: 缺少檔案標頭或其不在檔案的頂端

source: Unnecessary assignment of a value
de: Unnötige Zuweisung eines Werts.
es: Asignación innecesaria de un valor
fr: Assignation inutile d'une valeur
it: Assegnazione non necessaria di un valore
ja: 値の不必要な代入
ko: 불필요한 값 할당
pl: Niepotrzebne przypisanie wartości
pt_br: Atribuição desnecessária de um valor
ru: Ненужное присваивание значения
tr: Bir değerin gereksiz ataması
zh_hans: 不需要赋值
zh_hant: 指派了不必要的值

source: Unnecessary assignment of a value to '{0}'
de: Unnötige Zuweisung eines Werts zu "{0}".
es: Asignación innecesaria de un valor a "{0}"
fr: Assignation inutile d'une valeur à '{0}'
it: Assegnazione non necessaria di un valore a '{0}'
ja: 値の '{0}' への不必要な代入
ko: '{0}'에 불필요한 값 할당
pl: Niepotrzebne przypisanie wartości do elementu „{0}”
pt_br: Atribuição desnecessária de um valor para '{0}'
ru: Ненужное присваивание значения "{0}"
tr: '{0}' için bir değerin gereksiz ataması
zh_hans: 不需要对 "{0}" 赋值
zh_hant: 對 '{0}' 指派了不必要的值

source: Use 'System.HashCode'
de: "System.Hashcode" verwenden
es: Usar "System.HashCode"
fr: Utiliser 'System.HashCode'
it: Usa 'System.HashCode'
ja: 'System.HashCode' を使用する
ko: 'System.HashCode' 사용
pl: Użyj elementu „System.HashCode”
ru: Используйте "System.HashCode".
tr: 'System.HashCode' kullan
zh_hans: 使用 "System.HashCode"
zh_hant: 使用 'System.HashCode'

source: Use auto property
de: Automatisch generierte Eigenschaft verwenden
es: Usar propiedad automática
fr: Utiliser auto-property
it: Usa la proprietà automatica
ja: 自動プロパティを使用する
ko: auto 속성 사용
pl: Użyj właściwości automatycznej
pt_br: Usar a propriedade auto
ru: Использовать свойство auto
tr: Otomatik özellik kullan
zh_hans: 使用自动属性
zh_hant: 使用 Auto 屬性

source: Use coalesce expression
de: COALESCE-Ausdruck verwenden
es: Usar expresión coalesce
fr: Utiliser l'expression de fusion
it: Usa l'espressione COALESCE
ja: coalesce 式を使用します
ko: COALESCE 식 사용
pl: Użyj wyrażenia łączącego
pt_br: Usar a expressão de união
ru: Используйте выражение объединения
tr: Birleştirme ifadesi kullan
zh_hans: 使用 COALESCE 表达式
zh_hant: 使用 coalesce 運算式

source: Use compound assignment
de: Verbundzuweisung verwenden
es: Usar la asignación compuesta
fr: Utiliser une assignation composée
it: Usa l'assegnazione composta
ja: 複合代入を使用
ko: 복합형 할당 사용
pl: Użyj przypisania złożonego
pt_br: Usar a atribuição composta
ru: Использовать составной оператор назначения
tr: Bileşik atama kullan
zh_hans: 使用复合分配
zh_hant: 使用複合指派

# Use_decrement_operator
source: Use '--' operator
de: Operator "--" verwenden
es: Usar el operador "--"
ja: '--' 演算子を使用する
ko: '--' 연산자 사용
pl: Użyj operatora „--”
pt_br: Usar o operador '--'
tr: '--' operatörünü kullanın
zh_hans: 使用 "--" 运算符
zh_hant: 使用 '--' 運算子

source: Use explicitly provided tuple name
de: Explizit angegebenen Tupelelementnamen verwenden
es: Usar el nombre de tupla proporcionado explícitamente
fr: Utiliser le nom de tuple fourni explicitement
it: Usa il nome di tupla specificato in modo esplicito
ja: 明示的に提供されたタプル名を使用します
ko: 명시적으로 제공된 튜플 이름 사용
pl: Użyj jawnie podanej nazwy krotki
pt_br: Usar o nome de tupla fornecido explicitamente
ru: Использовать явно указанное имя кортежа
tr: Açıkça sağlanan demet adını kullan
zh_hans: 使用显式提供的元组名称
zh_hant: 使用明確提供的元組名稱

# Use_increment_operator
source: Use '++' operator
de: Operator "++" verwenden
es: Usar el operador "++"
ja: '++' 演算子を使用する
ko: '++' 연산자 사용
pl: Użyj operatora „++”
pt_br: Usar o operador '++'
tr: '++' operatörünü kullanın
zh_hans: 使用 "++" 运算符
zh_hant: 使用 '+ +' 運算子

source: Use inferred member name
de: Abgeleiteten Membernamen verwenden
es: Usar nombre de miembro inferido
fr: Utiliser un nom de membre déduit
it: Usa il nome di membro dedotto
ja: 推定メンバーの名前を使用します
ko: 유추 멤버 이름 사용
pl: Użyj nazwy wywnioskowanego elementu członkowskiego
pt_br: Usar o nome do membro inferido
tr: Gösterilen üye adı kullan
zh_hans: 使用推断的成员名称
zh_hant: 使用推斷的成員名稱

source: Use null propagation
de: NULL-Weitergabe verwenden
es: Usar propagación de null
fr: Utiliser la propagation nulle
it: Usa la propagazione di valori Null
ja: null 値の反映を使用します
ko: Null 전파 사용
pl: Użyj propagacji wartości null
pt_br: Usar tratamento simplificado de nulo
ru: Используйте распространение значения NULL
tr: Null yayılması kullan
zh_hans: 使用 null 传播
zh_hant: 使用 null 傳播

source: Use 'throw' expression
de: throw-Ausdruck verwenden
es: Usar expresión "throw"
fr: Utiliser l'expression 'throw'
it: Usa l'espressione 'throw'
ja: スロー' 式を使用する
ko: throw' 식 사용
pl: Użyj wyrażenia „throw“
pt_br: Use a expressão 'throw'
ru: Использовать выражение "throw"
tr: 'throw' ifadesi kullan
zh_hans: 使用 "throw" 表达式
zh_hant: 使用 'throw' 運算式

source: '{0}' statement implicitly converts '{1}' to '{2}'. Add an explicit cast to make intent clearer, as it may fail at runtime
de: '{0}' Anweisung konvertiert implizit '{1}' in '{2}'. Fügen Sie eine explizite Umwandlung hinzu, um die Absicht klarer zu machen, da sie zur Laufzeit fehlschlagen kann.
es: La instrucción '{0}' convierte implícitamente '{1}' en '{2}'. Agregue una conversión explícita para que la intención sea más clara, ya que puede producir un error en tiempo de ejecución
ja: '{0}' ステートメントは、'{1}' を暗黙的に '{2}' に変換します。実行時に失敗する可能性があるため、インテントをより明確にするために明示的なキャストを追加します
ko: '{0}' 문은 '{1}'을(를) '{2}'으로 암시적으로 변환합니다. 런타임에 실패할 수 있으므로 의도를 더 명확하게 하기 위해 명시적 캐스트를 추가합니다.
pt_br: A instrução '{0}' converte implicitamente '{1}' para '{2}'. Adicione uma conversão explícita para tornar a intenção mais clara, pois ela pode falhar no runtime
tr: '{0}' deyimi örtük olarak '{1}' öğesini '{2}' öğesine dönüştürür. Çalışma zamanında başarısız olabileceğinden amacı daha net hale getirmek için açık bir tür dönüştürme ekleyin
zh_hans: '{0}' 语句隐式将 '{1}' 转换为 '{2}'。添加显式强制转换以使意向更清晰，因为它可能会在运行时失败
zh_hant: '{0}' 陳述式隱含地將 '{1}' 轉換為 '{2}'。新增明確的轉換，讓意圖更清楚，因為它在執行時間可能會失敗

source: 'unsafe' modifier is unnecessary
ja: 'unsafe' 修飾子は不要です
pl: Modyfikator „unsafe” jest zbędny
tr: 'unsafe' değiştiricisi gereksiz
zh_hans: “unsafe”修饰符是不必要的
zh_hant: 不需要 'unsafe' 修飾元

source: Add 'this' or 'Me' qualification.
fr: Ajoutez la qualification 'this' ou 'Me'.
it: Aggiunge la qualificazione 'this' o 'Me'.
ru: Добавьте квалификацию "this" или "Me".

source: Convert to tuple
fr: Convertir en tuple
it: Converti in tupla
ru: Преобразовать в кортеж

source: Private member '{0}' can be removed as the value assigned to it is never read.
fr: Vous pouvez supprimer le membre privé '{0}', car la valeur qui lui est attribuée n'est jamais lue.
it: È possibile rimuovere il membro privato '{0}' perché il valore assegnato ad esso non viene mai letto.
ru: Закрытый член «{0}» может быть удален как значение, присвоенное него никогда не читал.

source: Private member '{0}' is unused.
fr: Le membre privé '{0}' n'est pas utilisé.
it: Il membro privato '{0}' è inutilizzato.
ru: Закрытый член «{0}» не используется.
