Repository: dotnet/roslyn
Catalog: src/Analyzers/Core/Analyzers/xlf/AnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: A source file contains a header that does not match the required text
de: Eine Quelldatei enthält einen Header, der nicht mit dem erforderlichen Text übereinstimmt.
es: Un archivo de código fuente contiene un encabezado que no coincide con el texto requerido.
fr: Un fichier source contient un en-tête qui ne correspond pas au texte nécessaire
it: Un file di origine contiene un'intestazione che non corrisponde al testo obbligatorio
ja: ソース ファイルに、必要なテキストと一致しないヘッダーが含まれています
ko: 소스 파일에 포함된 헤더가 필요한 텍스트와 일치하지 않습니다.
pl: Plik źródłowy zawiera nagłówek, który nie jest zgodny z wymaganym tekstem
pt_br: Um arquivo de origem contém um cabeçalho que não corresponde ao texto necessário
ru: Исходный файл содержит заголовок, который не соответствует требуемому тексту
tr: Kaynak dosya, gerekli metinle eşleşmeyen bir üst bilgi içeriyor
zh_hans: 源文件包含一个与所需文本不匹配的标题
zh_hant: 來源檔案包含的標頭與必要文字不相符

source: A source file is missing a required header.
de: In einer Quelldatei fehlt ein erforderlicher Header.
es: Falta un encabezado obligatorio en un archivo de código fuente.
fr: Il manque un en-tête nécessaire dans un fichier source.
it: In un file di origine manca un'intestazione obbligatoria.
ja: ソース ファイルに、必要なヘッダーがありません。
ko: 소스 파일에 필요한 헤더가 없습니다.
pl: Brak wymaganego nagłówka w pliku źródłowym.
pt_br: Um arquivo de origem não tem um cabeçalho necessário.
ru: В исходном файле отсутствует обязательный заголовок.
tr: Kaynak dosyada gerekli üst bilgi eksik.
zh_hans: 源文件缺少所需的标题。
zh_hant: 來源檔案缺少必要標頭。

source: Accessibility modifiers required
de: Zugriffsmodifizierer erforderlich
es: Modificadores de accesibilidad requeridos
fr: Modificateurs d'accessibilité obligatoires
it: Modificatori di accessibilità obbligatori
ja: アクセシビリティ修飾子が必要です
ko: 접근성 한정자 필요
pl: Wymagane modyfikatory dostępności
pt_br: Modificadores de acessibilidade necessários
ru: Требуются модификаторы доступности
tr: Erişilebilirlik değiştiricileri gerekli
zh_hans: 需要可访问性修饰符
zh_hant: 協助工具修飾元為必要項

source: Accessibility modifiers unnecessary
ja: アクセシビリティ修飾子は不要です
ko: 접근성 한정자가 필요하지 않음
pl: Modyfikatory dostępności są zbędne
tr: Erişilebilirlik değiştiricileri gereksiz
zh_hans: 不必要的辅助功能修饰符
zh_hant: 不需要協助工具修飾元

source: Add accessibility modifiers
de: Zugriffsmodifizierer hinzufügen
es: Agregar modificadores de accesibilidad
fr: Ajouter des modificateurs d'accessibilité
it: Aggiungi i modificatori di accessibilità
ja: アクセシビリティ修飾子を追加します
ko: 접근성 한정자 추가
pl: Dodaj modyfikatory dostępności
pt_br: Adicionar modificadores de acessibilidade
ru: Добавьте модификаторы доступности
tr: Erişilebilirlik değiştiricileri Ekle
zh_hans: 添加可访问性修饰符
zh_hant: 新增協助工具修飾元

source: Add explicit cast
de: Explizite Umwandlung hinzufügen
es: Agregar conversión explícita
ja: 明示的なキャストの追加
ko: 명시적 캐스트 추가
pl: Dodaj rzutowanie jawne
pt_br: Adicionar conversão explícita
tr: Açık tür dönüştürme ekle
zh_hans: 添加显式转换
zh_hant: 新增明確轉換

source: Add parentheses for clarity
de: Zur besseren Unterscheidung Klammern hinzufügen
es: Agregar paréntesis para claridad
fr: Ajouter des parenthèses pour plus de clarté
it: Aggiungi le parentesi per chiarezza
ja: わかりやすくするためにかっこを追加
ko: 명확하게 하기 위해 괄호 추가
pl: Dodaj nawiasy w celu zapewnienia jednoznaczności
pt_br: Adicionar parênteses para esclarecimento
ru: Добавить круглые скобки для ясности
tr: Açıklık sağlamak için parantez ekleyin
zh_hans: 为清楚起见，请添加括号
zh_hant: 新增括號以明確表示

source: Add readonly modifier
de: Modifizierer "readonly" hinzufügen
es: Agregar modificador de solo lectura
fr: Ajouter un modificateur readonly
it: Aggiungi modificatore readonly
ja: 読み取り専用修飾子を追加します
ko: 읽기 전용 한정자 추가
pl: Dodaj modyfikator tylko do odczytu
pt_br: Adicionar modificador somente leitura
ru: Добавить модификатор только для чтения
tr: Salt okunur değiştirici ekle
zh_hans: 添加只读修饰符
zh_hant: 新增唯讀修飾元

source: Add the following PropertyGroup to your MSBuild project file to enable IDE0005 (Remove unnecessary usings/imports) on build: <PropertyGroup> <!-- Make sure any documentation comments which are included in code get checked for syntax during the build, but do not report warnings for missing comments. CS1573: Parameter 'parameter' has no matching param tag in the XML comment for 'parameter' (but other parameters do) CS1591: Missing XML comment for publicly visible type or member 'Type_or_Member' CS1712: Type parameter 'type_parameter' has no matching typeparam tag in the XML comment on 'type_or_member' (but other type parameters do) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
de: Fügen Sie die folgende PropertyGroup zu Ihrer MSBuild-Projektdatei hinzu, um IDE0005 (Nicht benötigte Using-Direktiven/Importe entfernen) beim Build zu aktivieren: <PropertyGroup> <!-- Stellen Sie sicher, dass alle Dokumentationskommentare, die im Code enthalten sind, während des Builds auf Syntax geprüft werden, aber melden Sie keine Warnungen für fehlende Kommentare. CS1573: Der Parameter 'parameter' hat kein passendes param-Tag im XML-Kommentar für 'parameter' (andere Parameter jedoch schon) CS1591: Fehlender XML-Kommentar für öffentlich sichtbaren Typ oder Member 'Type_or_Member' CS1712: Der Typparameter 'type_parameter' hat kein passendes typeparam-Tag im XML-Kommentar zu 'type_or_member' (andere Typparameter jedoch schon) --> <GenerateDocumentationFile>TRUE</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
es: Agregue el siguiente PropertyGroup al archivo de proyecto de MSBuild para habilitar IDE0005 (Quitar instrucciones using o importaciones innecesarias) en la compilación: <PropertyGroup> <!-- Asegúrese de que los comentarios de documentación que se incluyen en el código se comprueban para comprobar la sintaxis durante la compilación, pero no notificar advertencias para los comentarios que faltan. CS1573: El parámetro 'parameter' no tiene ninguna etiqueta de parámetro coincidente en el comentario XML para 'parameter' (pero otros parámetros sí) CS1591: Falta un comentario XML para el tipo o miembro visible públicamente 'Type_or_Member' CS1712:El parámetro de tipo 'type_parameter' no tiene ninguna etiqueta typeparam coincidente en el comentario XML en 'type_or_member' (pero sí otros parámetros de tipo) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
ja: MSBuild プロジェクト ファイルに次の PropertyGroup を追加して、ビルドで IDE0005 (不要な usings/imports を削除する) を有効にします。 <PropertyGroup> <!-- コードにドキュメント コメントが含まれている場合には、ビルド中に構文チェックが行われるようにしますが、 。 抜けているコメントに関する警告は報告しません。 CS1573: パラメーター 'parameter' には、'parameter' の XML コメントに一致するパラメーター タグがありません (ただし、他のパラメーターにはあります)。 CS1591: 公開されている型またはメンバー 'Type_or_Member' CS1712: 型パラメーター 'type_parameter' には、'type_or_member' の XML コメントに一致する typeparam タグがありません (ただし、他の型パラメーターにはあります) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
ko: 빌드 시 IDE0005(불필요한 using/imports 제거)를 사용하도록 설정하려면 MSBuild 프로젝트 파일에 다음 PropertyGroup을 추가합니다. <PropertyGroup> <!-- 빌드하는 동안 코드에 포함된 설명서 주석이 구문을 확인하지만, 주석 누락에 대한 경고를 보고하지 않습니다. CS1573: 'parameter' 매개 변수의 XML 주석에 'parameter'에 일치하는 매개 변수 태그가 없습니다(하지만 다른 매개 변수는 일치함.) CS1591: 공개적으로 표시되는 형식 또는 멤버 'Type_or_Member'에 대한 XML 주석이 없습니다. CS1712: 형식 매개 변수 'type_parameter'에 'type_or_member'의 XML 주석에 일치하는 형식 매개 변수 태그가 없습니다(하지만 다른 형식 매개 변수는 일치함). --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
pl: Dodaj następującą grupę właściwości do pliku projektu MSBuild, aby włączyć środowisko IDE0005 (usuń niepotrzebne operacje użycia/importu) w kompilacji: <PropertyGroup> <!-- Sprawdź komentarze do dokumentacji zawarte w kodzie pod kątem składni, ale nie zgłaszaj ostrzeżeń dla brakujących komentarzy. CS1573: Parametr „parameter” nie ma pasującej etykiety parametru w komentarzu XML dla „parameter” (ale inne parametry mają taką etykietę) CS1591: Brak komentarza XML dla publicznie widocznego typu lub członka „Type_or_Member” CS1712: Parametr typu „type_parameter” nie ma pasującej etykiety typeparam w komentarzu XML dla „type_or_member” (ale inne parametry typu mają taką etykietę) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
pt_br: Adicione o PropertyGroup a seguir ao arquivo de projeto do MSBuild para habilitar IDE0005 (Remover usos/importações desnecessários) no build: <PropertyGroup> <!-- Verifique se todos os comentários de documentação incluídos no código são verificados para sintaxe durante a compilação, mas não relatar avisos para comentários ausentes. CS1573: o parâmetro 'parameter' não tem marca de parâmetro correspondente no comentário XML para 'parameter' (mas outros parâmetros têm) CS1591: Comentário XML ausente para o tipo ou membro publicamente visível 'Type_or_Member' CS1712: o parâmetro de tipo 'type_parameter' não tem marca typeparam correspondente no comentário XML em 'type_or_member' (mas outros parâmetros de tipo têm) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
tr: Derlemede IDE0005'i (Gereksiz kullanımları/içe aktarmaları kaldır) etkinleştirmek için MSBuild proje dosyanıza aşağıdaki PropertyGroup'u ekleyin: <PropertyGroup> <!-- Kodda yer alan, belge hakkındaki yorumlar, derleme sırasında söz dizimi açısından kontrol edilmelidir. Eksik yorumlar için uyarılar bildirilmemelidir. CS1573: 'parameter' parametresi, ‘parameter’ için XML yorumunda param etiketine sahip değil (Diğer parametrelerin aksine) CS1591: Herkese açık tür veya üye 'Type_or_Member' için XML yorumu eklenmemiş CS1712: Tür parametresi 'type_parameter’, 'type_or_member' hakkındaki XML yorumunda eşleşen typeparam etiketine sahip değil (Diğer parametrelerin aksine) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
zh_hans: 将以下 PropertyGroup 添加到 MSBuild 项目文件，以便在生成时启用 IDE0005 (删除不必要的使用/导入): <PropertyGroup> <!-- 请确保在生成期间对代码中包含的任何文档注释进行了语法检查，但 没有报告关于缺少注释的警告。 CS1573: 参数 'parameter' 在 'parameter' 的 XML 注释中没有匹配的 param 标记(但其他参数有) CS1591: 公开可见类型或成员 'Type_or_Member' 缺少 XML 注释 CS1712: 类型参数 'type_parameter' 在 'type_or_member' 的 XML 注释中没有匹配的 typeparam 标记(但其他类型参数有) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>
zh_hant: 將下列 PropertyGroup 新增至 MSBuild 專案檔，以在組建上啟用 IDE0005 (移除不必要的 using/import): <PropertyGroup> <!-- 請務必確認程式碼中包含的任何文件註解在組建期間皆經過語法檢查，但 不要回報遺漏註解的警告。 CS1573: 參數 'parameter' 在 'parameter' 的 XML 註解中沒有相符的參數標籤 (不過其他參數有) CS1591: 遺漏公開可見類型或成員 'Type_or_Member' 的 XML 註解 CS1712: 型別參數 'type_parameter' 在 'type_or_member' 的 XML 註解中沒有相符的型別參數標籤 (不過其他型別參數有) --> <GenerateDocumentationFile>True</GenerateDocumentationFile> <NoWarn>$(NoWarn),1573,1591,1712</NoWarn> </PropertyGroup>

source: Add 'this' or 'Me' qualification
de: Qualifizierung 'this' oder 'Me' hinzufügen
es: Agregar calificación 'this' o 'Me'
ja: this' または 'Me' 修飾子を追加する
ko: 'this' 또는 'Me' 한정자를 추가합니다.
pl: Dodaj kwalifikacje „this” lub „Me”
pt_br: Adicionar a qualificação 'este' ou 'Eu'
tr: 'this' veya 'Me' niteliği ekle
zh_hans: 添加 “this” 或 “Me” 限定
zh_hant: 新增 'this' 或 'Me' 限定性條件。

source: Avoid legacy format target '{0}' in 'SuppressMessageAttribute'
de: Ziel "{0}" im Legacyformat in "SuppressMessageAttribute" vermeiden
es: Evitar el destino del formato heredado "{0}" en "SuppressMessageAttribute"
fr: Éviter la cible de format hérité '{0}' dans 'SuppressMessageAttribute'
it: Evita la destinazione di formato legacy '{0}' in 'SuppressMessageAttribute'
ja: 'SuppressMessageAttribute' では、以前の形式のターゲット '{0}' は使用しないでください
ko: 'SuppressMessageAttribute'에서 레거시 형식 대상 '{0}'을(를) 사용하지 마세요.
pl: Unikaj elementu docelowego w starszym formacie „{0}” we właściwości „SuppressMessageAttribute”
pt_br: Evite o destino de formato herdado '{0}' em 'SuppressMessageAttribute'
tr: 'SuppressMessageAttribute' içinde eski biçimde hedef ('{0}') kullanmaktan kaçının
zh_hans: 避免在 "SuppressMessageAttribute" 中使用旧格式目标“{0}”
zh_hant: 避免在 'SuppressMessageAttribute' 中使用舊版格式目標 '{0}'

source: Avoid legacy format target in 'SuppressMessageAttribute'
de: Ziel im Legacyformat in "SuppressMessageAttribute" vermeiden
es: Evitar el destino del formato heredado en "SuppressMessageAttribute"
fr: Éviter la cible de format hérité dans 'SuppressMessageAttribute'
it: Evita la destinazione di formato legacy in 'SuppressMessageAttribute'
ja: 'SuppressMessageAttribute' では、以前の形式のターゲットは使用しないでください
ko: 'SuppressMessageAttribute'에서 레거시 형식 대상을 사용하지 마세요.
pl: Unikaj elementu docelowego w starszym formacie we właściwości „SuppressMessageAttribute”
pt_br: Evite o destino de formato herdado em 'SuppressMessageAttribute'
tr: 'SuppressMessageAttribute' içinde eski biçimde hedef kullanmaktan kaçının
zh_hans: 避免在 "SuppressMessageAttribute" 中使用旧格式目标
zh_hant: 避免在 'SuppressMessageAttribute' 中使用舊版格式目標

source: Avoid multiple blank lines
de: Vermeiden Sie mehrere Leerzeilen.
es: Evitar varias líneas en blanco
ja: 複数の空白行は使用できません
ko: 여러 빈 줄 방지
pl: Unikaj wielu pustych wierszy
pt_br: Evite várias linhas em branco
tr: Birden çok boş satırdan kaçının
zh_hans: 避免出现多个空白行
zh_hant: 避免多個空白行

source: Avoid unnecessary value assignments in your code, as these likely indicate redundant value computations. If the value computation is not redundant and you intend to retain the assignment, then change the assignment target to a local variable whose name starts with an underscore and is optionally followed by an integer, such as '_', '_1', '_2', etc. These are treated as special discard symbol names.
de: Vermeiden Sie unnötige Wertzuweisungen in Ihrem Code, weil diese wahrscheinlich auf redundante Wertberechnungen hinweisen. Wenn die Wertberechnung nicht redundant ist und die Zuweisung beibehalten werden soll, ändern Sie das Zuweisungsziel in eine lokale Variable, deren Name mit einem Unterstrich beginnt, dem optional eine Zahl angefügt wird. Beispiel: "_", "_1", "_2" usw. Diese werden als spezielle Symbolnamen für Ausschussvariablen behandelt.
es: Evite las asignaciones de valores innecesarias en el código, ya que probablemente indican cálculos de valores redundantes. Si el cálculo de valor no es redundante y tiene intención de retener la asignación, cambie el destino de la asignación a una variable local cuyo nombre empiece por un carácter de subrayado, seguido opcionalmente por un entero, como "_", "_1", "_2", etc. Estos se tratan como nombres de símbolos de descarte especiales.
fr: Évitez les assignations de valeurs inutiles dans votre code, car elles représentent probablement des calculs de valeurs redondants. Si un calcul de valeur n'est pas redondant et si vous souhaitez conserver l'assignation, remplacez la cible de l'assignation par une variable locale dont le nom commence par un trait de soulignement éventuellement suivi d'un entier, par exemple '_', '_1', '_2', etc. Ces types d'élément sont traités en tant que noms de symboles discard spéciaux.
it: Evitare assegnazioni di valori non necessarie nel codice perché indicano probabilmente calcoli di valori ridondanti. Se il calcolo del valore non è ridondante e si intende mantenere l'assegnazione, modificare la destinazione dell'assegnazione in una variabile locale il cui nome inizia con un carattere di sottolineatura e, facoltativamente, è seguito da un numero intero, ad esempio '_', '_1', '_2' e così via. Questi vengono considerati come nomi di simboli speciali di rimozione.
ja: コード内における不必要な値代入は、値計算が重複する原因になり得るため、避けてください。値計算が重複しておらず、代入を保持する場合は、代入先をアンダースコアの後にオプションで整数が続く名前 ('_'、'_1'、'_2' など) のローカル変数に変更してください。これらは、特別なディスカード シンボル名として扱われます。
ko: 코드에 불필요한 값을 할당하면 값의 중복 계산으로 표시될 수 있으므로 이와 같은 할당을 사용하지 않도록 합니다. 값의 중복 계산이 아닌 할당을 유지하려는 경우 할당 대상을 이름이 밑줄로 시작하고 필요에 따라 뒤에 정수가 있는(예: '_', '_1', '_2' 등) 지역 변수로 변경합니다. 해당 이름은 특수 무시 기호 이름으로 처리됩니다.
pl: Unikaj niepotrzebnych przypisań wartości w kodzie, ponieważ mogą one wskazywać nadmiarowe obliczenia wartości. Jeśli obliczenie wartości nie jest nadmiarowe i zamierzasz zachować przypisanie, zmień wartość docelową przypisania na zmienną lokalną, której nazwa rozpoczyna się od znaku podkreślenia, a opcjonalnie następuje po niej liczba całkowita, taka jak „_”, „_1”, „_2” itp. Są one traktowane jako specjalne nazwy symboli odrzucenia.
pt_br: Evite atribuições de valor desnecessárias no código, pois isso pode indicar cálculos de valor redundantes. Se o cálculo do valor não for redundante e você pretender reter a atribuição, altere o destino da atribuição para uma variável local cujo nome comece com um sublinhado e seja seguido opcionalmente por um inteiro, como '_', '_1', '_2' etc. Esses nomes são tratados como nomes de símbolo de descarte especiais.
ru: Избегайте ненужных операций присваивания значений в коде, так как это может свидетельствовать об избыточных вычислениях значений. Если вычисление значения не является избыточным и предполагается сохранить присваивание, измените целевой объект присваивания на локальную переменную, имя которой начинается с символа подчеркивания, за которым при необходимости следует целое число, например, "_", "_1", "_2" и т. д. Эти имена рассматриваются как специальные имена для освобождаемых переменных.
tr: Kodunuzda gereksiz değer atamaları yapmaktan kaçının; bunlar genelde gereksiz değer hesaplamalarını belirtir. Değer hesaplaması gereksiz değilse ve atamayı korumak istiyorsanız, atama hedefini adı bir alt çizgiyle başlayan ve isteğe bağlı olarak tamsayı ile devam eden yerel bir değişkene çevirin, örneğin '_', '_1', '_2' vb. Bunlar özel atma sembol adları olarak değerlendirilir.
zh_hans: 请避免在代码中使用不必要的值赋值，因为这些值极有可能指示冗余的值计算。如果值计算不是冗余的，并且打算保留该赋值，请将分配目标更改为名称以下划线开头或在下划线后面跟一个整数的局部变量(如 "_"、"_1"、"_2" 等)。这些被视为特殊丢弃符号名。
zh_hant: 請避免在您的程式碼中指派非必要的值，因為這可能表示值會重複計算。如果值未重複計算，而且您想要保留指派，請將指派目標變更為名稱以底線開頭的區域變數，並可選擇在後面接著整數，例如 '_'、'_1'、'_2' 等。這些會視為特殊的捨棄符號名稱。

source: Avoid unused parameters in your code. If the parameter cannot be removed, then change its name so it starts with an underscore and is optionally followed by an integer, such as '_', '_1', '_2', etc. These are treated as special discard symbol names.
de: Vermeiden Sie nicht verwendete Parameter in Ihrem Code. Wenn der Parameter nicht entfernt werden kann, ändern Sie dessen Namen so, dass er mit einem Unterstrich beginnt, dem optional eine Zahl angefügt wird. Beispiel: "_", "_1", "_2" usw. Diese werden als spezielle Symbolnamen für Ausschussparameter behandelt.
es: Evite los parámetros sin usar en el código. Si el parámetro no se puede quitar, cámbielo de nombre para que empiece por un carácter de subrayado, seguido opcionalmente por un entero, como "_", "_1", "_2", etc. Estos se tratan como nombres de símbolos de descarte especiales.
fr: Évitez les paramètres inutilisés dans votre code. Évitez les paramètres inutilisés dans votre code. Si vous ne pouvez pas supprimer un paramètre, changez son nom en le faisant commencer par un trait de soulignement éventuellement suivi d'un entier, par exemple '_', '_1', '_2', etc. Ces types d'élément sont traités en tant que noms de symboles discard spéciaux.
it: Evitare parametri inutilizzati nel codice. Se non è possibile rimuovere il parametro, modificarne il nome in modo che inizi con un carattere di sottolineatura e, facoltativamente, sia seguito da un numero intero, ad esempio '_', '_1', '_2' e così via. Questi vengono considerati come nomi di simboli speciali di rimozione.
ja: コードに未使用のパラメーターを指定しないでください。パラメーターを削除できない場合は、パラメーターの名前をアンダースコアの後にオプションで整数が続く名前 ('_'、'_1'、'_2' など) に変更してください。これらは、特別なディスカード シンボル名として扱われます。
ko: 코드에 사용되지 않는 매개 변수를 사용하지 않도록 합니다. 매개 변수를 제거할 수 없는 경우 이름을 변경하여 밑줄로 시작하고 필요에 따라 뒤에 정수가 있도록 합니다(예: '_', '_1', '_2' 등). 해당 이름은 특수 무시 기호 이름으로 처리됩니다.
pl: Unikaj nieużywanych parametrów w kodzie. Jeśli nie można usunąć parametru, zmień jego nazwę, tak aby rozpoczynała się od znaku podkreślenia, a opcjonalnie następowała po niej liczba całkowita, na przykład „_”, „_1”, „_2” itp. Są one traktowane jako specjalne nazwy symboli odrzucenia.
pt_br: Evite parâmetros não usados no seu código. Se o parâmetro não puder ser removido, altere o nome para que ele comece com um sublinhado e seja seguido opcionalmente por um inteiro, como '_', '_1', '_2' etc. Esses nomes são tratados como nomes de símbolo de descarte especiais.
ru: Избегайте неиспользуемых параметров в коде. Если удалить параметр невозможно, измените его имя так, чтобы оно начиналось с символа подчеркивания, за которым при необходимости следует целое число, например, "_", "_1", "_2" и т. д. Эти имена считаются особыми пустыми именами символов.
tr: Kodunuzda kullanılmayan parametreler bulundurmamaya çalışın. Parametre kaldırılamıyorsa adını, bir alt çizgiyle başlayacak ve ardından isteğe bağlı olarak bir tamsayı gelecek ('_', '_1', '_2' gibi) şekilde değiştirin. Bu değerler özel atılabilir sembol adı olarak işlenir.
zh_hans: 请避免在代码中使用未使用的参数。如果无法删除该参数，请更改其名称，使其以下划线开头，也可在下划线后面跟一个整数(如 "_"、"_1"、"_2" 等)。这些被视为特殊丢弃符号名。
zh_hant: 請避免在您的程式碼中使用參數。如果無法移除參數，請變更其名稱，使其以底線開頭，並可選擇在後面接著整數，例如 '_'、'_1'、'_2' 等。這些會視為特殊的捨棄符號名稱。

source: Base classes contain inaccessible unimplemented members
de: Basisklassen enthalten nicht implementierte Member, auf die nicht zugegriffen werden kann.
ja: アクセス不可能な未実装のメンバーが基底クラスに含まれています
ko: 기본 클래스에 구현되지 않아 액세스할 수 없는 멤버가 포함되어 있습니다.
pl: Klasy podstawowe zawierają niedostępne niezaimplementowane składowe
pt_br: As classes base contêm membros não implementados inacessíveis
tr: Temel sınıflarda erişilemeyen, uygulanmamış üyeler var
zh_hans: 基类包含无法访问的未实现成员
zh_hant: 基底類別包含無法存取的未實作成員

source: Blank line required between block and subsequent statement
de: Zwischen dem Block und der nachfolgenden Anweisung ist eine leere Zeile erforderlich.
es: Se requiere una línea en blanco entre el bloque y la instrucción subsiguiente
ja: ブロックと後続のステートメントの間に空白行が必要です
ko: 블록과 후속 문 사이에 빈 줄이 필요함
pl: Wymagany jest pusty wiersz między blokiem a kolejną instrukcją
pt_br: Linha em branco necessária entre o bloco e a próxima instrução
tr: Blok ve sonraki ifade arasında boş satır gerekir
zh_hans: 块与后续语句之间需要有空白行
zh_hant: 區塊與後續陳述式之間必須有空白行

source: Change namespace to match folder structure
de: Ändern Sie "namespace", sodass er der Ordnerstruktur entspricht.
es: Cambiar namespace para que coincida con la estructura de carpetas
ja: フォルダー構造に合わせて namespace を変更してください
ko: 폴더 구조가 일치하도록 namespace 변경
pl: Zmień element namespace, aby była zgodna ze strukturą folderów
pt_br: Alterar o namespace para corresponder à estrutura da pasta
tr: namespace'i klasör yapısıyla eşlenecek şekilde değiştirir
zh_hans: 更改 namespace 以匹配文件夹结构
zh_hant: 變更 namespace 以符合資料夾結構

source: Changes to expression trees may result in behavior changes at runtime
de: Änderungen an Ausdrucksstrukturen führen unter Umständen zu Verhaltensänderungen zur Laufzeit
es: Los cambios en los árboles de expresión pueden originar cambios de comportamiento en tiempo de ejecución
fr: Les changements apportés aux arborescences d'expression peuvent entraîner des changements de comportement au moment de l'exécution
it: Le modifiche apportate agli alberi delle espressioni possono causare modifiche di comportamento in fase di esecuzione
ja: 式ツリーを変更すると、実行時の動作が変わる可能性があります
ko: 식 트리를 변경하면 런타임에 동작이 변경될 수 있습니다.
pl: Wprowadzenie zmian w drzewach wyrażeń może spowodować zmiany zachowania w czasie wykonywania
pt_br: Alterações nas árvores de expressão podem resultar em alterações de comportamento no tempo de execução
ru: Изменения в деревьях выражений могут привести к изменениям поведения во время выполнения.
tr: İfade ağaçlarında yapılan değişiklikler çalışma zamanında davranış değişikliklerine neden olabilir
zh_hans: 对表达式树的更改可能导致运行时的行为改变
zh_hant: 變更運算式樹狀架構可能會導致執行階段的行為變更
