Repository: dotnet/roslyn
Catalog: src/Analyzers/Core/Analyzers/xlf/AnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Conditional expression can be simplified
de: Bedingter Ausdruck kann vereinfacht werden.
es: La expresión condicional se puede simplificar
fr: L’expression conditionnelle peut être simplifiée
it: L'espressione condizionale può essere semplificata
ja: 条件式を簡素化できます
ko: 조건식을 단순화할 수 있습니다.
pl: Wyrażenie warunkowe można uprościć
pt_br: A expressão condicional pode ser simplificada
tr: Koşul ifadesi basitleştirilebilir
zh_hans: 可以简化条件表达式
zh_hant: 條件運算式可加以簡化

source: Convert to conditional expression
de: In bedingten Ausdruck konvertieren
es: Convertir a expresión condicional
fr: Convertir en expression conditionnelle
it: Converti nell'espressione condizionale
ja: 条件式に変換します
ko: 조건식으로 변환
pl: Konwertuj na wyrażenie warunkowe
pt_br: Converter em expressão condicional
ru: Преобразовать в условное выражение
tr: Koşullu ifadeye dönüştürme
zh_hans: 转换为条件表达式
zh_hant: 轉換至條件運算式

source: Expression value is never used
de: Der Ausdruckswert wird niemals verwendet.
es: El valor de la expresión no se utiliza nunca.
fr: La valeur d'expression n'est jamais utilisée
it: Il valore dell'espressione non viene mai usato
ja: 式の値が使用されていません
ko: 식 값은 절대 사용되지 않습니다.
pl: Wartość wyrażenia nie jest nigdy używana.
pt_br: O valor da expressão nunca é usado
ru: Значение выражения никогда не используется
tr: İfade değeri asla kullanılmaz
zh_hans: 永远不会使用表达式值
zh_hant: 永遠不會使用運算式值

source: Collection initialization can be simplified
de: Die Initialisierung der Sammlung kann vereinfacht werden.
es: La inicialización de la recopilación se pueden simplificar
fr: L'initialisation des collections peut être simplifiée
it: L'inizializzazione della raccolta può essere semplificata
ja: コレクションの初期化を簡素化できます
ko: 컬렉션 초기화를 단순화할 수 있습니다.
pl: Można uprościć inicjowanie kolekcji
pt_br: A inicialização de coleção pode ser simplificada
ru: Инициализацию коллекции можно упростить.
tr: Koleksiyon başlatma işlemi kolaylaştırılabilir
zh_hans: 可以简化集合初始化
zh_hant: 集合初始化可簡化

source: Fix formatting
de: Formatierung korrigieren
es: Fijar formato
ja: 書式設定を修正
ko: 서식 수정
pl: Napraw formatowanie
pt_br: Corrigir a formatação
tr: Biçimlendirme Düzeltme
zh_hans: 修正格式
zh_hant: 修正格式化

source: Format string contains invalid placeholder
de: Die Formatzeichenfolge enthält einen ungültigen Platzhalter.
es: La cadena de formato contiene un marcador de posición no válido.
fr: La chaîne de format contient un espace réservé non valide
it: La stringa di formato contiene un segnaposto non valido
ja: 書式設定文字列に無効なプレース ホルダーが含まれています
ko: 형식 문자열에 잘못된 자리 표시자가 포함되어 있습니다.
pl: Ciąg formatu zawiera nieprawidłowy symbol zastępczy
pt_br: A cadeia de formato contém espaço reservado inválido
ru: Строка формата содержит недопустимый заполнитель
tr: Biçim dizesi, geçersiz yer tutucu içeriyor
zh_hans: 格式字符串包含无效的占位符
zh_hant: 格式字串包含無效的預留位置

source: 'GetHashCode' implementation can be simplified
de: Die Implementierung von "GetHashCode" kann vereinfacht werden.
es: La implementación de "GetHashCode" se puede simplificar.
fr: L'implémentation de 'GetHashCode' peut être simplifiée
it: L'implementazione di 'GetHashCode' può essere semplificata
ja: 'GetHashCode' の実装を簡素化できます
ko: 'GetHashCode' 구현을 단순화할 수 있습니다.
pl: Implementację „GetHashCode” można uprościć
pt_br: A implementação de 'GetHashCode' pode ser simplificada
ru: Реализацию "GetHashCode" можно упростить.
tr: 'GetHashCode' uygulaması basitleştirilebilir
zh_hans: 可简化 "GetHashCode" 实现
zh_hant: 'GetHashCode' 實作可簡化

source: Implement abstract class
de: Abstrakte Klasse implementieren
ja: 抽象クラスの実装
ko: 추상 클래스 구현
pl: Implementuj klasę abstrakcyjną
pt_br: Implementar classe abstrata
tr: Soyut sınıfı uygula
zh_hans: 实现抽象类
zh_hant: 實作抽象類別

source: Implement through '{0}'
de: Über "{0}" implementieren
ja: '{0}' を通じて実装します
ko: '{0}'을(를) 통해 구현
pl: Implementuj za pomocą elementu „{0}”
pt_br: Implementar por meio de '{0}'
tr: '{0}' aracılığıyla uygula
zh_hans: 通过“{0}”实现
zh_hant: 透過 '{0}' 實作

source: Interpolation can be simplified
de: Die Interpolation kann vereinfacht werden
es: La interpolación se puede simplificar
fr: L'interpolation peut être simplifiée
it: L'interpolazione può essere semplificata
ja: 補間を簡素化することができます
ko: 보간을 단순화할 수 있습니다.
pl: Interpolację można uprościć
pt_br: A interpolação pode ser simplificada
tr: İlişkilendirme basitleştirilebilir
zh_hans: 内插可以简化
zh_hant: 可簡化內插補點

source: Invalid format string
de: Ungültige Formatzeichenfolge
es: Cadena de formato no válida
fr: Chaîne de format non valide
it: Stringa di formato non valida
ja: 無効な書式設定文字列
ko: 잘못된 형식 문자열
pl: Nieprawidłowy ciąg formatu
pt_br: Cadeia de formato inválida
ru: Недопустимая строка формата
tr: Geçersiz biçim dizesi
zh_hans: 无效的格式字符串
zh_hant: 格式字串無效

source: Invalid global 'SuppressMessageAttribute'
de: Ungültiger globaler SuppressMessageAttribute-Wert.
es: "SuppressMessageAttribute" global no válido
fr: 'SuppressMessageAttribute' global non valide
it: Attributo 'SuppressMessageAttribute' globale non valido
ja: グローバル 'SuppressMessageAttribute' が無効です
ko: 전역 'SuppressMessageAttribute'가 잘못되었습니다.
pl: Nieprawidłowy globalny element „SuppressMessageAttribute”
pt_br: 'SuppressMessageAttribute' global inválido
tr: Genel 'SuppressMessageAttribute' geçersiz
zh_hans: 全局 "SuppressMessageAttribute" 无效
zh_hant: 全域 'SuppressMessageAttribute' 無效

source: Invalid or missing target for 'SuppressMessageAttribute'
de: Ungültiges oder fehlendes Ziel für "SuppressMessageAttribute".
es: Falta el destino de "SuppressMessageAttribute" o no es válido
fr: Cible non valide ou manquante pour 'SuppressMessageAttribute'
it: Destinazione mancante o non valida per l'attributo 'SuppressMessageAttribute'
ja: 'SuppressMessageAttribute' のターゲットが無効か、見つかりません
ko: 'SuppressMessageAttribute'의 대상이 잘못되었거나 없습니다.
pl: Nieprawidłowy lub brakujący element docelowy dla elementu „SuppressMessageAttribute”
pt_br: Destino ausente ou inválido de 'SuppressMessageAttribute'
tr: 'SuppressMessageAttribute' için hedef geçersiz veya eksik
zh_hans: "SuppressMessageAttribute" 的目标无效或缺失
zh_hant: 'SuppressMessageAttribute' 缺少目標或其無效

source: Invalid scope for 'SuppressMessageAttribute'
de: Ungültiger Bereich für "SuppressMessageAttribute".
es: Ámbito no válido para "SuppressMessageAttribute"
fr: Étendue non valide pour 'SuppressMessageAttribute'
it: Ambito non valido per l'attributo 'SuppressMessageAttribute'
ja: 'SuppressMessageAttribute' のスコープが無効です
ko: 'SuppressMessageAttribute'의 범위가 잘못되었습니다.
pl: Nieprawidłowy zakres dla elementu „SuppressMessageAttribute”
pt_br: Escopo inválido de 'SuppressMessageAttribute'
tr: 'SuppressMessageAttribute' için kapsam geçersiz
zh_hans: "SuppressMessageAttribute" 的范围无效
zh_hant: 'SuppressMessageAttribute' 的範圍無效

source: Make field readonly
de: Schreibschutz für Feld festlegen
es: Hacer el archivo de solo lectura
fr: Rendre le champ readonly
it: Imposta il campo come di sola lettura
ja: フィールドを読み取り専用にします
ko: 필드를 읽기 전용으로 만들기
pl: Ustaw pole jako tylko do odczytu
pt_br: Tornar campo somente leitura
ru: Сделать поле доступным только для чтения
tr: Alanı salt okunur yap
zh_hans: 将字段设置为只读
zh_hant: 使欄位唯讀

source: Make method synchronous
tr: Metodu zaman uyumlu hale getir
zh_hans: 使方法同步

source: Member access should be qualified.
de: Der Memberzugriff sollte qualifiziert sein.
es: Debe calificarse el acceso a miembros.
fr: L'accès au membre doit être qualifié.
it: L'accesso ai membri deve essere qualificato.
ja: メンバー アクセスを修飾する必要があります。
ko: 멤버 액세스를 한정해야 합니다.
pl: Dostęp do składowej powinien mieć kwalifikator.
pt_br: O acesso de membro deve ser qualificado.
ru: Доступ к члену должен быть квалифицирован.
tr: Üye erişimi nitelenmiş olmalıdır.
zh_hans: 应限定成员访问。
zh_hant: 必須限定成員存取。

source: Add missing cases
de: Fehlende Fälle hinzufügen
es: Agregar casos que faltan
fr: Ajouter les instructions case manquantes
it: Aggiungi case mancanti
ja: 欠落しているケースの追加
ko: 누락된 사례 추가
pl: Dodaj brakujące przypadki
pt_br: Adicionar casos ausentes
ru: Добавить отсутствующие варианты
tr: Eksik durumları ekle
zh_hans: 添加缺失的事例
zh_hant: 新增遺漏的案例

source: Member name can be simplified
de: Der Membername kann vereinfacht werden.
es: El nombre del miembro se puede simplificar.
fr: Le nom de membre peut être simplifié
it: Il nome del membro può essere semplificato
ja: メンバーの名前を簡素化できます
ko: 멤버 이름을 단순화할 수 있습니다.
pl: Nazwę składowej można uprościć
pt_br: O nome do membro pode ser simplificado
tr: Üye adı basitleştirilebilir
zh_hans: 可简化成员名称
zh_hant: 成員名稱可簡化

source: Method can be made synchronous
tr: Yöntem zaman uyumlu yapılabilir
zh_hans: 方法可以为同步

source: Modifiers are not ordered
de: Modifizierer sind nicht angeordnet.
es: Los modificadores no están ordenados.
fr: Les modificateurs ne sont pas ordonnés
it: I modificatori non sono ordinati
ja: 修飾子が順序付けされていません
ko: 한정자가 순서대로 정렬되지 않음
pl: Modyfikatory nie są uporządkowane
pt_br: Os modificadores não são ordenados
ru: Модификаторы не упорядочены
tr: Değiştiriciler sıralı değil
zh_hans: 未对修饰符排序
zh_hant: 修飾元未排序

source: Name can be simplified
de: Der Name kann vereinfacht werden
es: El nombre se puede simplificar
ja: 名前を簡素化できます
ko: 이름을 단순화할 수 있습니다.
pl: Nazwę można uprościć
pt_br: O nome pode ser simplificado
tr: Ad basitleştirilebilir
zh_hans: 可简化名称
zh_hant: 可以簡化名稱

source: Namespace "{0}" does not match folder structure, expected "{1}"
de: Der Namespace "{0}" entspricht nicht der Ordnerstruktur. Erwartet: {1}
es: El espacio de nombres "{0}" no coincide con la estructura de carpetas, se esperaba "{1}"
ja: Namespace "{0}" はフォルダー構造と一致しません。"{1}" が必要です
ko: 네임스페이스 "{0}"이(가) 폴더 구조와 일치하지 않습니다. "{1}"이(가) 필요합니다.
pl: Przestrzeń nazw „{0}” nie jest zgodna z strukturą folderów, oczekiwano „{1}”
pt_br: O namespace "{0}" não corresponde à estrutura da pasta. Esperava-se "{1}"
tr: "{0}" ad alanı klasör yapısıyla eşleşmiyor, "{1}" bekleniyor
zh_hans: 命名空间“{0}”与文件夹结构不匹配，应为“{1}”
zh_hant: 命名空間 "{0}" 與資料夾結構不相符，必須為 "{1}"

source: Namespace does not match folder structure
de: Der Namespace entspricht stimmt nicht der Ordnerstruktur.
es: El espacio de nombres no coincide con la estructura de carpetas
ja: Namespace がフォルダー構造と一致しません
ko: 네임스페이스가 폴더 구조와 일치하지 않습니다.
pl: Przestrzeń nazw nie jest zgodna ze strukturą folderów
pt_br: O namespace não corresponde à estrutura da pasta
tr: Ad alanı, klasör yapısıyla eşleşmiyor
zh_hans: 命名空间与文件夹结构不匹配
zh_hant: 命名空間與資料夾結構不相符

source: Naming Styles
de: Benennungsstile
es: Estilos de nombres
fr: Styles d'affectation de noms
it: Stili di denominazione
ja: 命名スタイル
ko: 명명 스타일
pl: Style nazewnictwa
pt_br: Estilos de Nomenclatura
ru: Стили именования
tr: Adlandırma Stilleri
zh_hans: 命名样式
zh_hant: 命名樣式

source: Naming rule violation: {0}
de: Verstoß gegen Benennungsregel: {0}
es: Infracción de la regla de nomenclatura: {0}
fr: Violation des règles de nommage : {0}
it: Violazione della regola di denominazione: {0}
ja: 名前付けルール違反: {0}
ko: 명명 규칙 위반: {0}
pl: Naruszenie reguły nazewnictwa: {0}
pt_br: Violação da regra de nomenclatura: {0}
ru: Нарушение правила именования: {0}
tr: Adlandırma kuralı ihlali: {0}
zh_hans: 命名规则冲突: {0}
zh_hant: 違反命名規則: {0}

source: Null check can be simplified
de: Die NULL-Überprüfung kann vereinfacht werden.
es: La comprobación de valores null se puede simplificar
fr: Le contrôle de valeurs Null peut être simplifié
it: Il controllo Null può essere semplificato
ja: Null チェックを簡素化できます
ko: Null 검사를 단순화할 수 있습니다.
pl: Można uprościć test na obecność wartości null
pt_br: A seleção nula pode ser simplificada
ru: Проверку значения NULL можно упростить.
tr: Null denetimi kolaylaştırılabilir
zh_hans: 可以简化 Null 检查
zh_hant: Null 檢查可簡化

source: Order modifiers
de: Modifizierer anordnen
es: Ordenar modificadores
fr: Ordonner les modificateurs
it: Ordina i modificatori
ja: 修飾子を順序付けます
ko: 순서 한정자
pl: Uporządkuj modyfikatory
pt_br: Modificadores de ordem
ru: Упорядочить модификаторы
tr: Değiştiricileri sırala
zh_hans: 对修饰符排序
zh_hant: 為修飾元排序

source: Parameter '{0}' can be removed if it is not part of a shipped public API; its initial value is never used
de: Der Parameter "{0}" kann entfernt werden, wenn er nicht Bestandteil einer öffentlich verfügbaren API ist. Sein Initialisierungswert wird niemals verwendet.
es: Se puede quitar el parámetro "{0}" si no forma parte de una API pública enviada; su valor inicial no se usa nunca.
fr: Impossible de supprimer le paramètre '{0}' s'il ne fait pas partie d'une API publique fournie, sa valeur initiale n'est jamais utilisée
it: È possibile rimuovere il parametro '{0}' se non fa parte di un'API pubblica. Il relativo valore iniziale non viene mai usato
ja: パラメーター '{0}' は、それが同梱のパブリック API の一部ではない場合に削除できます。その初期値は使用されていません
ko: '{0}' 매개 변수가 제공된 퍼블릭 API의 일부가 아닌 경우 제거할 수 있습니다. 해당 초기 값은 사용되지 않습니다.
pl: Parametr „{0}” można usunąć, jeśli nie jest częścią dostarczonego publicznego interfejsu API, ponieważ jego wartość początkowa nie jest nigdy używana
pt_br: O parâmetro '{0}' pode ser removido quando não faz parte de uma API pública enviada. Seu valor inicial nunca é usado
ru: Параметр "{0}" можно удалить, если он не является частью предоставляемого общедоступного API. Начальное значение этого параметра никогда не используется.
tr: Gönderilmiş bir genel API'nin parçası değilse '{0}' parametresi kaldırılabilir. Parametrenin ilk değeri asla kullanılmaz
zh_hans: 如果参数“{0}”不是已发布的公共 API 的一部分，可将其删除，因为永远不会使用其初始值
zh_hant: 若參數 '{0}' 不屬於已經出貨的公用 API，將無法移除; 其初始值一律不會使用

source: Parameter '{0}' can be removed; its initial value is never used
de: Der Parameter "{0}" kann entfernt werden, sein Initialisierungswert wird niemals verwendet.
es: Se puede quitar el parámetro "{0}"; su valor inicial no se usa nunca.
fr: Le paramètre '{0}' peut être supprimé, sa valeur initiale n'est jamais utilisée
it: È possibile rimuovere il parametro '{0}'. Il relativo valore iniziale non viene mai usato
ja: パラメーター '{0}' を削除できます。その初期値は使用されていません
ko: '{0}' 매개 변수는 제거할 수 있습니다. 해당 초기 값은 사용되지 않습니다.
pl: Parametr „{0}” można usunąć, ponieważ jego wartość początkowa nie jest nigdy używana
pt_br: O parâmetro '{0}' pode ser removido. Seu valor inicial nunca é usado
ru: Параметр "{0}" можно удалить. Его начальное значение никогда не используется.
tr: '{0}' parametresi kaldırılabilir. İlk değeri asla kullanılmaz
zh_hans: 可删除参数“{0}”，因为永远不会使用其初始值
zh_hant: 參數 '{0}' 可以移除; 其初始值一律不會使用

source: Object initialization can be simplified
de: Die Objektinitialisierung kann vereinfacht werden.
es: La inicialización del objeto se puede simplificar
fr: L'initialisation de l'objet peut être simplifiée
it: L'inizializzazione dell'oggetto può essere semplificata
ja: オブジェクトの初期化を簡素化できます
ko: 개체 초기화를 단순화할 수 있습니다.
pl: Inicjowanie obiektu można uprościć
pt_br: A inicialização do objeto pode ser simplificada
ru: Инициализацию объекта можно упростить.
tr: Nesne başlatma basitleştirilebilir
zh_hans: 可以简化对象初始化
zh_hant: 物件初始化可以簡化

source: Parentheses can be removed
de: Klammern können entfernt werden.
es: Los paréntesis se pueden quitar
fr: Vous pouvez supprimer les parenthèses
it: È possibile rimuovere le parentesi
ja: かっこは削除できます
ko: 괄호를 제거할 수 있습니다.
pl: Nawiasy można usunąć
pt_br: Os parênteses podem ser removidos
ru: Круглые скобки можно удалить
tr: Parantezler kaldırılabilir
zh_hans: 可以删除括号
zh_hant: 可以移除括號

source: Parentheses should be added for clarity
de: Zur besseren Unterscheidung sollten Klammern hinzugefügt werden.
es: Los paréntesis deben agregarse para mejorar la claridad
fr: Vous devez ajouter des parenthèses pour plus de clarté
it: È necessario aggiungere le parentesi per chiarezza
ja: わかりやすくするためにかっこを追加してください
ko: 명확하게 하기 위해 괄호를 추가해야 합니다.
pl: Nawiasy powinny zostać dodane w celu zapewnienia jednoznaczności
pt_br: Os parênteses devem ser adicionados para esclarecimento
ru: Добавьте скобки для большей ясности
tr: Açıklık sağlamak için parantez eklenmelidir
zh_hans: 为清楚起见，应添加括号
zh_hant: 應新增括號以明確表示

source: Populate switch
de: Switch mit Daten auffüllen
es: Rellenar switch
fr: Remplir une instruction switch
it: Popola switch
ja: スイッチを設定する
ko: 스위치 채우기
pl: Wypełnij instrukcję switch
pt_br: Popular comutador
ru: Заполнить оператор switch
zh_hans: 填充开关
zh_hant: 填入切換

source: Prefer explicitly provided tuple element name
de: Explizit angegebenen Tupelelementnamen bevorzugen
es: Preferir el nombre del elemento de tupla proporcionado explícitamente
fr: Préférer le nom d'élément tuple fourni explicitement
it: Preferisci il nome di elemento di tupla specificato in modo esplicito
ja: 明示的に提供されたタプル要素名を優先します
ko: 명시적으로 제공된 튜플 요소 이름 기본 사용
pl: Preferuj jawnie podaną nazwę elementu krotki
pt_br: Preferir o nome do elemento de tupla fornecido explicitamente
ru: Предпочитать явно указанное имя элемента кортежа
tr: Açıkça sağlanan demet öğesi adını tercih et
zh_hans: 首选显式提供的元组元素名称
zh_hant: 建議使用明確提供的元組元素名稱

source: Private member '{0}' can be removed as the value assigned to it is never read
de: Der private Member "{0}" kann entfernt werden, weil der zugewiesene Wert nie gelesen wird.
es: El miembro privado "{0}" puede quitarse porque el valor que tiene asignado no se lee nunca
ja: 割り当てられた値が読み取られることがないので、プライベート メンバー '{0}' を削除できます
ko: 프라이빗 멤버 '{0}'에 할당된 값을 읽을 수 없으므로 이 멤버를 제거할 수 있습니다.
pl: Prywatną składową „{0}” można usunąć, ponieważ przypisana do niej wartość nie jest nigdy odczytywana
pt_br: O membro privado '{0}' pode ser removido, pois o valor atribuído a ele nunca é lido
tr: Kendisine atanmış değer hiç okunmadığından, özel üye '{0}' kaldırılabilir.
zh_hans: 可删除私有成员“{0}”，因为永不会读取分配给它的值
zh_hant: 因為永遠不會讀取指派給 Private 成員 '{0}' 的值，所以可移除該成員

source: Private member '{0}' is unused
de: Der private Member "{0}" wird nicht verwendet.
es: El miembro privado "{0}" no se usa
ja: プライベート メンバー '{0}' は使用されていません
ko: 프라이빗 멤버 '{0}'을(를) 사용하지 않습니다.
pl: Prywatna składowa „{0}” jest nieużywana
pt_br: O membro privado '{0}' não é usado
tr: Özel üye '{0}' kullanılmıyor
zh_hans: 未使用私有成员“{0}”
zh_hant: 未使用 Private 成員 '{0}'

source: Private method '{0}' can be removed as it is never invoked.
de: Die private Methode "{0}" kann entfernt werden, da sie nie aufgerufen wird.
es: El método privado "{0}" se puede quitar porque nunca se invoca.
fr: Impossible de supprimer la méthode privée '{0}', car elle n'est jamais appelée.
it: Il metodo privato '{0}' può essere rimosso perché non viene mai richiamato.
ja: プライベート メソッド '{0}' が呼び出されることがないよう削除できます。
ko: 프라이빗 메서드 '{0}'은(는) 호출되지 않으므로 제거할 수 있습니다.
pl: Metodę prywatną „{0}” można usunąć, ponieważ nie jest nigdy wywoływana.
pt_br: O método particular '{0}' pode ser removido pois nunca é invocado.
ru: Закрытый метод "{0}" можно удалить, так как он никогда не вызывается.
tr: '{0}' özel metodu hiç çağrılmadığından kaldırılabilir.
zh_hans: 私有方法“{0}”可以删除，因为它永远不会被调用。
zh_hant: 因為永遠不會叫用私用方法 ‘{0}’，所以可予以移除。

source: Private property '{0}' can be converted to a method as its get accessor is never invoked.
de: Die private Eigenschaft "{0}" kann in eine Methode konvertiert werden, weil ihr get-Accessor niemals aufgerufen wird.
es: La propiedad privada "{0}" se puede convertir en un método porque su descriptor de acceso get nunca se invoca.
fr: La propriété privée '{0}' peut être convertie en méthode, car son accesseur get n'est jamais appelé.
it: È possibile convertire la proprietà privata '{0}' in un metodo perché la relativa funzione di accesso get non viene mai richiamata.
ja: プライベート プロパティ '{0}' は、その get アクセサーが呼び出されることがないため、メソッドに変換できます。
ko: 해당 get 접근자가 호출되지 않았으므로 프라이빗 속성 '{0}'을(를) 메서드로 변환할 수 있습니다.
pl: Właściwość prywatną „{0}” można przekonwertować na metodę, ponieważ jej metoda dostępu get nie jest nigdy wywoływana.
pt_br: A propriedade privada '{0}' pode ser convertida em um método porque seu acessador get nunca é invocado.
ru: Частное свойство "{0}" можно преобразовать в метод, так как его метод доступа get никогда не вызывается.
tr: '{0}' özel özelliği, bu özelliğin get erişimcisi hiçbir zaman çağrılmadığı için bir yönteme dönüştürülebilir.
zh_hans: 私有属性 "{0}" 可以转换为方法，因为永远不会调用它的 get 访问器。
zh_hant: 系統永遠不會叫用私用屬性 '{0}' 的 get 存取子，因此該屬性可以轉換成方法。

source: Remove Unnecessary Cast
de: Nicht erforderliche Umwandlung entfernen
es: Quitar conversión innecesaria
fr: Supprimer le cast inutile
it: Rimuovi cast non necessario
ja: 不要なキャストの削除
ko: 불필요한 캐스트 제거
pl: Usuń niepotrzebne rzutowanie
pt_br: Remover Conversão Desnecessária
ru: Удалить ненужное приведение
tr: Gereksiz Atamayı Kaldır
zh_hans: 删除不必要的转换
zh_hant: 移除不必要的 Cast

source: Remove accessibility modifiers
de: Barrierefreiheitsmodifizierer entfernen
es: Quitar modificadores de accesibilidad
ja: アクセシビリティ修飾子を削除する
ko: 접근성 한정자 제거
pl: Usuń modyfikatory ułatwień dostępu
pt_br: Remover modificadores de acessibilidade
tr: Erişilebilirlik değiştiricilerini kaldır
zh_hans: 删除辅助功能修饰符
zh_hant: 移除協助工具修飾元

source: Remove redundant equality
de: Redundante Gleichheit entfernen
es: Quitar la igualdad redundante
ja: 冗長な等値を削除
ko: 중복 같음 제거
pl: Usuń nadmiarową równość
pt_br: Remover a igualdade redundante
tr: Gereksiz eşitliği kaldır
zh_hans: 删除冗余等同性
zh_hant: 移除多餘的等號

source: Remove unnecessary parentheses
de: Unnötige Klammern entfernen
es: Quitar los paréntesis innecesarios
fr: Supprimer les parenthèses inutiles
it: Rimuovi le parentesi non necessarie
ja: 不要なかっこの削除
ko: 불필요한 괄호 제거
pl: Usuń niepotrzebne nawiasy
pt_br: Remover os parênteses desnecessários
ru: Удалить ненужные круглые скобки
tr: Gereksiz parantezleri kaldırın
zh_hans: 删除不必要的括号
zh_hant: 移除不必要的括號

source: Remove unnecessary suppression
de: Unnötige Unterdrückung entfernen
es: Quitar supresión innecesaria
ja: 不要な抑制を削除します
ko: 불필요한 비표시 오류(Suppression) 제거
pl: Usuń niepotrzebne pomijanie
pt_br: Remover a supressão desnecessária
tr: Gereksiz gizlemeyi kaldırın
zh_hans: 请删除不必要的忽略
zh_hant: 移除非必要的隱藏項目

source: Remove unnecessary 'unsafe' modifier
ja: 不要な 'unsafe' 修飾子を削除する
pl: Usuń zbędny modyfikator „unsafe”
tr: Gereksiz 'unsafe' değiştiricisini kaldırın
zh_hans: 删除不必要的“unsafe”修饰符
zh_hant: 移除不必要的 'unsafe' 修飾元

source: Remove unread private members
de: Ungelesene private Member entfernen
es: Quitar miembros privados no leídos
fr: Supprimer les membres privés non lus
it: Rimuovi i membri privati non letti
ja: 読み取られていないプライベート メンバーを削除
ko: 읽지 않은 private 멤버 제거
pl: Usuń nieodczytywane składowe prywatne
pt_br: Remover membros particulares não lidos
ru: Удалить непрочитанные закрытые члены
tr: Okunmamış özel üyeleri kaldır
zh_hans: 删除未读的私有成员
zh_hant: 刪除未讀取的私用成員

source: Remove unused member
de: Nicht verwendete Member entfernen
es: Quitar miembros sin usar
fr: Supprimer les membres non utilisés
it: Rimuovi il membro inutilizzato
ja: 未使用のメンバーを削除
ko: 사용되지 않은 멤버 제거
pl: Usuń nieużywaną składową
pt_br: Remover membro não utilizado
ru: Удалить неиспользуемый член
tr: Kullanılmayan üye kaldırma
zh_hans: 删除未使用的成员
zh_hant: 移除未使用的成員

source: Remove unused parameter
de: Nicht verwendete Parameter entfernen
es: Quitar el parámetro no utilizado
fr: Supprimer le paramètre inutilisé
it: Rimuovere il parametro inutilizzato
ja: 未使用のパラメーターを削除します
ko: 사용하지 않는 매개 변수를 제거하세요.
pl: Usuń nieużywany parametr
pt_br: Remover o parâmetro não utilizado
ru: Удалите неиспользуемый параметр
tr: Kullanılmayan parametreyi kaldırma
zh_hans: 删除未使用的参数
zh_hant: 移除未使用的參數

source: Remove unused parameter '{0}'
de: Nicht verwendeten Parameter "{0}" entfernen
es: Retirar el parámetro "{0}" sin usar
fr: Supprimer le paramètre '{0}' inutilisé
it: Rimuovi il parametro inutilizzato '{0}'
ja: 未使用のパラメーター '{0}' を削除
ko: 사용하지 않는 매개 변수 '{0}' 제거
pl: Usuń nieużywany parametr „{0}”
pt_br: Remover o parâmetro não usado '{0}'
ru: Удалить неиспользуемый параметр "{0}"
tr: Kullanılmayan '{0}' parametresini kaldır
zh_hans: 删除未使用的参数 "{0}"
zh_hant: 移除未使用的參數 ‘{0}’
