Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: A language name cannot be specified for this option.
de: Für diese Option kann kein Sprachenname angegeben werden.
fr: Impossible de spécifier un nom de langage pour cette option.
it: Non è possibile specificare un nome di linguaggio per questa opzione.
ja: 言語名は、このオプションでは指定できません。
ko: 이 옵션에 대한 언어 이름을 지정할 수 없습니다.
pl: Nie można określić nazwy języka dla tej opcji.
pt_br: Um nome de idioma não pode ser especificado para essa opção.
tr: Bu seçenek için bir dil adı belirtilemiyor.

source: A language name must be specified for this option.
de: Für diese Option muss ein Sprachenname angegeben werden.
fr: Un nom de langage doit être spécifié pour cette option.
it: È necessario specificare un nome di linguaggio per questa opzione.
ja: このオプションの言語名を指定する必要があります。
ko: 이 옵션에 대한 언어 이름을 지정해야 합니다.
pl: Nazwa języka musi zostać określona dla tej opcji.
pt_br: Um nome de idioma deve ser especificado para esta opção.
tr: Bu seçenek için bir dil adı belirtilmelidir.

# AssemblyReferencesNetFramework
source: The assembly containing type '{0}' references .NET Framework, which is not supported.
cs: Sestavení, které obsahuje typ {0}, se odkazuje na architekturu .NET Framework, což se nepodporuje.
es: El ensamblado que contiene el tipo "{0}" hace referencia a .NET Framework, lo cual no se admite.
it: L'assembly che contiene il tipo '{0}' fa riferimento a .NET Framework, che non è supportato.
ja: 型 '{0}' を含むアセンブリが .NET Framework を参照しています。これはサポートされていません。
ko: '{0}' 형식을 포함하는 어셈블리가 지원되지 않는 .NET Framework를 참조합니다.
ru: Сборка, содержащая тип "{0}", ссылается на платформу .NET Framework, которая не поддерживается.
zh_hans: 包含类型“{0}”的程序集引用了 .NET Framework，而此操作不受支持。
zh_hant: 包含類型 '{0}' 的組件參考了 .NET Framework，此情形不受支援。

# BadBuiltInOps1
source: Illegal built-in operator name '{0}'
cs: Neplatný předdefinovaný název operátoru {0}
es: Nombre de operador integrado no válido "{0}"
it: Nome dell'operatore predefinito '{0}' non valido
ja: 不正な組み込み演算子名 '{0}'
ko: 기본 제공 연산자 이름 '{0}'이(가) 잘못되었습니다.
ru: Недопустимое имя встроенного оператора "{0}"
zh_hans: 内置运算符名称“{0}”非法
zh_hant: 不合法的內建運算子名稱 '{0}'

# BadBuiltInOps2
source: Unsupported built-in operator: {0}
cs: Nepodporovaný předdefinovaný operátor: {0}
es: Operador integrado no admitido: {0}
it: Operatore predefinito non supportato: {0}
ja: サポート対象外の組み込み演算子: {0}
ko: 지원되지 않는 기본 제공 연산자: {0}
ru: Неподдерживаемый встроенный оператор: {0}
zh_hans: 不支持的内置运算符: {0}
zh_hant: 不支援的內建運算子: {0}

# BadBuiltInOps3
source: '{0}' was not a valid built-in operator name
cs: {0} nebyl platný předdefinovaný název operátoru
es: "{0}" no era un nombre de operador integrado válido
it: '{0}' non era un nome di operatore predefinito valido
ja: '{0}' は有効な組み込み演算子名ではありませんでした
ko: '{0}'은(는) 유효한 기본 제공 연산자 이름이 아닙니다.
ru: "{0}" не являлось допустимым именем встроенного оператора
zh_hans: “{0}”不是有效的内置运算符名称
zh_hant: '{0}' 不是有效的內建運算子名稱

source: Changes must be within bounds of SourceText
cs: Změny musí spadat do mezí SourceText.
es: Los cambios deben estar dentro de los límites de SourceText.
it: Le modifiche devono rientrare nei limiti di SourceText
ja: 変更は SourceText の範囲内でなければなりません
ko: 변경 내용은 SourceText의 범위 내에 있어야 합니다.
ru: Изменения должны находиться в границах SourceText
zh_hans: 必须在 SourceText 的边界内进行更改
zh_hant: 變更必須在 SourceText 的界限內

# ChangingVersionOfAssemblyReferenceIsNotAllowedDuringDebugging
source: Changing the version of an assembly reference is not allowed during debugging: '{0}' changed version to '{1}'.
cs: Změna verze odkazu na sestavení není povolená při ladění: {0} změnil(a) verzi na {1}.
es: No se permite cambiar la versión de una referencia de ensamblado durante la depuración: "{0}" cambió la versión a "{1}".
fr: Aucun changement de la version d'une référence d'assembly n'est autorisé durant le débogage : '{0}' a changé la version en '{1}'.
it: La modifica della versione di un riferimento ad assembly durante il debug non è consentita: '{0}' ha modificato la versione in '{1}'.
ja: デバッグ中にアセンブリ参照のバージョンを変更することはできません: '{0}' のバージョンが '{1}' に変更されました。
ko: 디버깅 중에는 어셈블리 참조의 버전 변경이 허용되지 않습니다. '{0}'이(가) 버전을 '{1}'(으)로 변경했습니다.
pl: Zmiana wersji odwołania do zestawu jest niedozwolona podczas debugowania: „{0}” — zmieniono wersję na „{1}”.
pt_br: Não é permitido alterar a versão de uma referência de assembly durante a depuração: a versão de '{0}' foi alterada para '{1}'.
ru: Изменение версии ссылки на сборку недопустимо во время отладки: "{0}" изменил версию на "{1}".
tr: Hata ayıklama sırasında bütünleştirilmiş kod başvurusunun sürümünü değiştirmeye izin verilmez: '{0}' sürümü, '{1}' olarak değiştirildi.
zh_hans: 调试过程中不允许更改程序集引用的版本:“{0}”版本改为“{1}”。
zh_hant: 在偵錯期間不允許變更組件參考的版本: '{0}' 已將版本變更為 '{1}'。

# DisableAnalyzerDiagnosticsMessage
source: Suppress the following diagnostics to disable this analyzer: {0}
cs: Pokud chcete tento analyzátor zakázat, potlačte následující diagnostiku: {0}
es: Suprima el diagnóstico siguiente para deshabilitar este analizador: {0}
fr: Supprimez les diagnostics suivants pour désactiver cet analyseur : {0}
it: Per disabilitare questo analizzatore, eliminare la diagnostica seguente: {0}
ja: 次の診断を抑制して、このアナライザーを無効にします: {0}
ko: 이 분석기를 사용하지 않도록 설정하려면 다음 진단이 표시되지 않도록 설정하세요. {0}
pl: Pomiń następującą diagnostykę, aby wyłączyć ten analizator: {0}
pt_br: Suprimir os seguintes diagnósticos para desabilitar este analisador: {0}
ru: Отключите следующую диагностику, чтобы отключить этот анализатор: {0}
tr: Bu çözümleyiciyi devre dışı bırakmak için şu tanılamaları gizleyin: {0}
zh_hans: 取消以下诊断以禁用此分析器: {0}
zh_hant: 請隱藏下列診斷以停用此分析器: {0}

# EncCannotResumeSuspendedAsyncMethod
source: Edit and Continue can't resume suspended asynchronous method since the corresponding await expression has been deleted
cs: Funkce Upravit a Pokračovat nemůže obnovit pozastavenou asynchronní metodu, protože odpovídající výraz await byl odstraněn.
es: Editar y continuar no puede reanudar el método asincrónico suspendido porque se ha eliminado la expresión await correspondiente.
it: Modifica e Continua non sono in grado di riprendere il metodo asincrono sospeso perché l'espressione await corrispondente è stata eliminata
ja: 対応する await 式が削除されているため、エディット コンティニュは中断された非同期メソッドを再開できません
ko: 해당 대기 식이 삭제되었으므로 편집하고 계속하기가 일시 중단된 비동기 메서드를 재개할 수 없습니다.
ru: Операция "Изменить и продолжить" не может возобновить приостановленный асинхронный метод, поскольку соответствующее выражение await удалено
zh_hans: 编辑并继续无法恢复挂起的异步方法，因为相应的 await 表达式已被删除
zh_hant: 編輯和繼續無法繼續暫停的非同步方法，因為對應的 await 運算式已刪除

# EncCannotResumeSuspendedIteratorMethod
source: Edit and Continue can't resume suspended iterator since the corresponding yield return statement has been deleted
cs: Funkce Upravit a pokračovat nemůže obnovit pozastavený iterátor, protože odpovídající příkaz yield return byl odstraněn.
es: Editar y continuar no puede reanudar el iterador suspendido porque se ha eliminado la instrucción yield return correspondiente
it: Modifica e Continua non sono in grado di riprendere l'enumeratore sospeso perché l'istruzione yield return corrispondente è stata eliminata
ja: 対応する yield return ステートメントが削除されているため、エディット コンティニュは中断された反復子を再開できません
ko: 해당 yield return 문이 삭제되었으므로 편집하고 계속하기가 일시 중단된 반복기를 다시 시작할 수 없습니다.
ru: Операция "Изменить и продолжить" не может возобновить приостановленный итератор, поскольку соответствующий оператор yield return удален
zh_hans: 编辑并继续无法恢复挂起的迭代器，因为相应的 yield return 语句已被删除
zh_hant: 編輯和繼續無法繼續暫停的列舉程式，因為對應的 yield return 陳述式已刪除

# EncDeletedLambdaInvoked
source: Attempted to invoke a deleted lambda or local function implementation. This can happen when lambda or local function is deleted while the application is running.
cs: Proběhl pokus o vyvolání smazané funkce lambda nebo implementace lokální funkce. To se může stát, když se lambda nebo lokální funkce odstraní, když je aplikace spuštěná.
es: Se intentó invocar una implementación lambda o de función local eliminada. Esto puede ocurrir cuando se elimina una función lambda o local mientras se ejecuta la aplicación.
ja: 削除済みの Lambda 関数またはローカル関数の実装を呼び出そうとしました。これは、アプリケーションの実行中に Lambda 関数またはローカル関数が削除された場合に発生する可能性があります。
ko: 삭제된 람다 또는 로컬 함수 구현을 호출하려고 했습니다. 이 문제는 애플리케이션이 실행되는 동안 람다 또는 로컬 함수가 삭제될 때 발생할 수 있습니다.
ru: Попытка вызвать удаленную реализацию лямбды или локальной функции. Это может произойти при удалении лямбды или локальной функции во время работы приложения.
zh_hans: 已尝试调用已删除的 lambda 或本地函数实现。在应用程序运行时删除 lambda 或本地函数就可能会发生这种情况。
zh_hant: 嘗試叫用已刪除的 Lambda 或 Local 函式實作。在應用程式執行時刪除 Lambda 或 Local 函式，便可能會發生此情況。

# EncDeletedMethodInvoked
source: Attempted to invoke a deleted method implementation. This can happen when a method is deleted or its name or signature is changed while the application is running.
cs: Proběhl pokus o vyvolání implementace odstraněné metody. K tomu může dojít při odstranění metody nebo změně jejího názvu či podpisu, když je aplikace spuštěná.
es: Se intentó invocar una implementación de método eliminada. Esto puede ocurrir cuando se elimina un método o se cambia su nombre o firma mientras se ejecuta la aplicación.
ja: 削除済みのメソッドの実装を呼び出そうとしました。これは、アプリケーションの実行中にメソッドが削除されたり、メソッドの名前やシグネチャが変更されたりした場合に発生する可能性があります。
ko: 삭제된 메서드 구현을 호출하려고 했습니다. 이 문제는 애플리케이션이 실행되는 동안 메서드가 삭제되거나 해당 이름 또는 서명이 변경될 때 발생할 수 있습니다.
ru: Предпринята попытка вызвать реализацию удаленного метода. Это может произойти при удалении метода или изменении его имени или сигнатуры во время работы приложения.
zh_hans: 已尝试调用已删除的方法实现。在应用程序运行时删除方法或更改其名称或签名就可能会发生这种情况。
zh_hant: 嘗試叫用已刪除的方法實作。在應用程式執行時刪除方法或變更其名稱或簽章，便可能會發生此情況。

# EncLambdaRudeEdit
source: Attempted to invoke lambda or local function with an unsupported change made while the application is running: {0}
cs: Proběhl pokus o vyvolání funkce lambda nebo lokální funkce, která nepodporuje změny provedené když aplikace běží: {0}
es: Se intentó invocar una función lambda o local que tiene un cambio no admitido realizado mientras se ejecuta la aplicación: {0}
ja: アプリケーションの実行中にサポートされていない変更が加えられた Lambda 関数またはローカル関数を呼び出そうとしました: {0}
ko: 애플리케이션이 실행되는 동안 지원되지 않는 변경 내용이 있는 람다 또는 로컬 함수를 호출하려고 했습니다. {0}
ru: Попытка вызвать лямбду или локальную функцию с неподдерживаемым изменением, сделанным во время работы приложения: {0}
zh_hans: 已尝试调用 lambda 或本地函数，该函数在应用程序运行时进行的更改不受支持: {0}
zh_hant: 在應用程式執行時嘗試叫用具有不支援變更的 Lambda 或 Local 函式: {0}

# EncLambdaRudeEdit_CapturedVariables
source: Attempted to invoke lambda or local function that has an unsupported change to captured variables made while the application is running
cs: Proběhl pokus o vyvolání funkce lambda nebo lokální funkce, která nepodporuje změnu zachycených proměnných provedených když aplikace běží.
es: Se intentó invocar una función lambda o local que tiene un cambio no admitido en las variables capturadas realizadas mientras se ejecuta la aplicación.
ja: アプリケーションの実行中にキャプチャされた変数に対してサポートされていない変更が加えられた Lambda 関数またはローカル関数を呼び出そうとしました
ko: 애플리케이션이 실행되는 동안 캡처된 변수에 대해 지원되지 않는 변경 내용이 있는 람다 또는 로컬 함수를 호출하려고 했습니다.
ru: Попытка вызвать лямбду или локальную функцию, содержащую неподдерживаемое изменение зафиксированных переменных, сделанное во время работы приложения.
zh_hans: 已尝试调用 lambda 或本地函数，该函数在应用程序运行时对捕获的变量进行的更改不受支持
zh_hant: 在應用程式執行時嘗試叫用對擷取到的變數具有不支援變更的 Lambda 或 Local 函式

# EndMustNotBeLessThanStart
source: 'end' must not be less than 'start'. start='{0}' end='{1}'.
cs: Hodnota end nesmí být menší než hodnota start. start={0} end={1}.
es: 'fin' no debe ser menor que 'inicio'. inicio='{0}' fin='{1}'.
it: il valore di 'end' non deve essere minore di quello di 'start'. start='{0}' end='{1}'.
ja: 'end' は 'start' より小さくすることはできません。start='{0}' end='{1}'。
ko: 'end'는 'start'보다 작을 수 없습니다. start='{0}' end='{1}'
ru: Значение "end" не должно быть меньше, чем "start". start="{0}", end="{1}".
zh_hans: "end" 不得小于 "start"。start="{0}" end="{1}"。
zh_hant: 'end' 不可小於 'start'。start='{0}' end='{1}'。

# GeneratorNameColumnHeader
source: Generator
cs: Generátor
es: Generador
it: Generatore
ja: ジェネレーター
ko: 생성기
ru: Генератор
zh_hans: 生成器
zh_hant: 產生器

# GeneratorTotalExecutionTime
source: Total generator execution time: {0} seconds.
cs: Celková doba spuštění generátoru: {0} sekund.
es: Tiempo total de ejecución del generador: {0} segundos.
it: Tempo totale di esecuzione del generatore: {0} secondi.
ja: ジェネレーターの合計実行時間: {0} 秒。
ko: 총 생성기 실행 시간: {0} 초
ru: Общее время выполнения генератора: {0} с.
zh_hans: 生成器执行总时间: {0} 秒。
zh_hant: 產生器執行時間總計: {0}秒。

# HintNameInvalidChar
source: The hintName '{0}' contains an invalid character '{1}' at position {2}.
cs: {0} hintName obsahuje neplatný znak {1} na pozici {2}.
es: El elemento hintName "{0}" contiene un carácter no válido "{1}" en la posición {2}.
it: L'elemento hintName '{0}' contiene un carattere non valido '{1}' alla posizione {2}.
ja: hintName {0} の位置 {2} に無効な文字 '{1}' が含まれています。
ko: hintName의 {0} 위치 {2}에 잘못된 문자 '{1}'이(가) 있습니다.
ru: hintName "{0}" содержит недопустимый символ "{1}" в позиции {2}.
zh_hans: hintName“{0}”在位置 {2} 处包含无效字符“{1}”。
zh_hant: 位置 {2} 的 hintName {0} 包含無效的字元 '{1}'。

# HintNameInvalidSegment
source: The hintName '{0}' contains an invalid segment '{1}' at position {2}.
cs: HintName {0} obsahuje neplatný segment {1} na pozici {2}.
es: HintName '{0}' contiene un segmento no válido '{1}' en la posición {2}.
it: L'elemento hintName '{0}' contiene un segmento non valido '{1}' alla posizione {2}.
ja: hintName '{0}' の位置 {2} に無効なセグメント '{1}' が含まれています。
ko: hintName '{0}'의 위치 {2}에 잘못된 세그먼트 '{1}'이(가) 있습니다.
ru: HintName "{0}" содержит недопустимый сегмент "{1}" в позиции {2}.
zh_hans: hintName“{0}”的段“{1}”(位于位置“{2}”)无效。
zh_hant: hintName '{0}' 的位置 {2} 包含無效的字元 '{1}'。

# HintNameUniquePerGenerator
source: The hintName '{0}' of the added source file must be unique within a generator.
cs: {0} hintName přidaného zdrojového souboru musí být v rámci generátoru jedinečná.
es: El elemento hintName "{0}"del archivo de código fuente agregado debe ser único dentro de un generador.
it: L'elemento hintName '{0}' del file di origine aggiunto deve essere univoco all'interno di un generatore.
ja: 追加されたソース ファイルの hintName '{0}' は、ジェネレーター内で一意である必要があります。
ko: 추가된 원본 파일의 hintName ‘{0}’은(는) 생성기 내에서 고유해야 합니다.
ru: HintName "{0}" добавленного исходного файла должно быть уникальным в пределах генератора.
zh_hans: 添加的源文件的 hintName“{0}”在生成器中必须唯一。
zh_hant: 新增來源檔案的 hintName '{0}' 在產生器中必須是唯一的。

# InternalsVisibleToCurrentAssembly
source: Current assembly: '{0}'
cs: Aktuální sestavení: {0}
es: Ensamblado actual: '{0}'
ja: 現在のアセンブリ: '{0}'
ko: 현재 어셈블리: '{0}'
ru: Текущая сборка: ' {0} '
zh_hans: 当前程序集:“{0}”
zh_hant: 目前的組件: '{0}'

# InternalsVisibleToHeaderSummary
source: Printing 'InternalsVisibleToAttribute' information for the current compilation and all referenced assemblies.
cs: Tisk informací InternalsVisibleToAttribute pro aktuální kompilaci a všechna odkazovaná sestavení.
es: Imprimir información de 'InternalsVisibleToAttribute' para la compilación actual y todos los ensamblados a los que se hace referencia.
ja: 現在のコンパイルおよび参照されているすべてのアセンブリの 'InternalsVisibleToAttribute' 情報を印刷しています。
ko: 현재 컴파일 및 참조된 모든 어셈블리에 대한 'InternalsVisibleToAttribute' 정보를 인쇄합니다.
ru: Печать информации «InternalsVisibleToAttribute» для текущей компиляции и всех связанных сборок.
zh_hans: 正在打印当前编译和所有引用程序集的 "InternalsVisibleToAttribute" 信息。
zh_hant: 正在列印目前編譯及所有參考組件的 'InternalsVisibleToAttribute' 資訊。

# InternalsVisibleToReferencedAssembly
source: Assembly reference: '{0}' Grants IVT to current assembly: {1} Grants IVTs to:
cs: Odkaz na sestavení: {0} Uděluje IVT aktuálnímu sestavení: {1} Uděluje IVT:
es: Referencia de ensamblado: '{0}' Concede IVT al ensamblado actual: {1} Concede IVT a:
ja: アセンブリ参照: '{0}' 現在のアセンブリに IVT を付与します。{1} 次のものに IVT を付与します。
ko: 어셈블리 참조: '{0}' 현재 어셈블리에 IVT 부여: {1} 다음에 IVT를 부여합니다.
ru: Ссылка на сборку: ' {0} ' Предоставляет IVT текущей сборке: {1} Предоставляет IVT:
zh_hans: 程序集引用:“{0}” 将 IVT 授予当前程序集:{1} 将 IVT 授予:
zh_hant: 組件參考: '{0}' 將 IVT 授與至目前的組件:{1} 將 IIV 授與至:

# InternalsVisibleToReferencedAssemblyDetails
source: Assembly name: '{0}' Public Keys:
cs: Název sestavení: {0} Veřejné klíče:
es: Nombre de ensamblado: '{0}' Claves públicas:
ja: アセンブリ名: '{0}' 公開鍵:
ko: 어셈블리 이름: '{0}' 공개 키:
ru: Имя сборки: ' {0} ' Открытые ключи:
zh_hans: 程序集名称:“{0}” 公钥:
zh_hant: 組件名稱: '{0}' 公開金鑰:

# InvalidAdditionalFile
source: Additional file doesn't belong to the underlying 'CompilationWithAnalyzers'.
cs: Další soubor nepatří do základního CompilationWithAnalyzers.
es: El archivo adicional no pertenece al elemento "CompilationWithAnalyzers" subyacente.
it: Il file aggiuntivo non appartiene all'oggetto 'CompilationWithAnalyzers' sottostante.
ja: 追加ファイルは、基になる 'CompilationWithAnalyzers' に属していません。
ko: 추가 파일이 기본 'CompilationWithAnalyzers'에 속하지 않습니다.
ru: Дополнительный файл не принадлежит базовому элементу "CompilationWithAnalyzers".
zh_hans: 其他文件不属于基础 "CompilationWithAnalyzers"。
zh_hant: 其他檔案不屬於基礎 'CompilationWithAnalyzers'。

# InvalidDiagnosticSuppressionReported
source: Suppressed diagnostic ID '{0}' does not match suppressable ID '{1}' for the given suppression descriptor.
cs: Potlačené ID diagnostiky {0} neodpovídá potlačitelnému ID {1} pro daný popisovač potlačení.
de: Die unterdrückte Diagnose-ID "{0}" entspricht nicht der unterdrückbaren ID "{1}" für den angegebenen Deskriptor zur Unterdrückung.
es: El id. de diagnóstico "{0}" suprimido no coincide con el id. "{1}" que se puede suprimir para el descriptor de supresión dado.
fr: L'ID de diagnostic supprimé '{0}' ne correspond pas à l'ID supprimable '{1}' pour le descripteur de suppression spécifié.
it: L'ID diagnostica '{0}' eliminato non corrisponde all'ID eliminabile '{1}' per il descrittore di eliminazione specificato.
ja: 抑制された診断 ID '{0}' が、指定された抑制記述子の抑制可能な ID '{1}' と一致しません。
ko: 표시되지 않는 진단 ID '{0}'이(가) 지정된 비표시 설명자의 표시하지 않을 수 있는 ID '{1}'과(와) 일치하지 않습니다.
pl: Pominięty identyfikator diagnostyki „{0}” nie pasuje do możliwego do pominięcia identyfikatora „{1}” dla danego deskryptora pomijania.
pt_br: A ID de diagnóstico suprimida '{0}' não corresponde à ID suprimível '{1}' para o descritor de supressão fornecido.
ru: Подавленный идентификатор диагностики "{0}" не соответствует подавленному идентификатору "{1}" для заданного дескриптора подавления.
tr: '{0}' gizlenmiş tanılama kimliği, belirtilen gizleme tanımlayıcısı için gizlenebilir '{1}' kimliği ile eşleşmiyor.
zh_hans: 对于给定的禁止显示描述符，禁止显示的诊断 ID“{0}”与可禁止显示的 ID“{1}”不匹配。
zh_hant: 隱藏的診斷識別碼 '{0}' 不符合指定隱藏描述項的可隱藏識別碼 '{1}'。

# InvalidInstrumentationKind
source: Invalid instrumentation kind: {0}
cs: Neplatný typ instrumentace: {0}
es: Clase de instrumentación no válida: {0}
it: Il tipo di strumentazione non è valido: {0}
ja: 無効なインストルメンテーションの種類: {0}
ko: 잘못된 계측 종류: {0}
ru: Недопустимый тип инструментирования: {0}
zh_hans: 无效的检测类型: {0}
zh_hant: 檢測設備種類無效: {0}

# InvalidOperationBlockForAnalysisContext
source: Given operation block does not belong to the current analysis context.
cs: Blok dané operace nepatří do aktuálního analytického kontextu.
de: Der angegebene Operationsblock gehört nicht zum aktuellen Analysekontext.
es: El bloque de operaciones dado no pertenece al contexto de análisis actual.
fr: Le bloc d'opérations donné n'appartient pas au contexte d'analyse actuel.
it: Il blocco operazioni specificato non appartiene al contesto di analisi corrente.
ja: 指定した操作ブロックが現在の分析コンテストに属していません。
ko: 지정한 작업 블록이 현재 분석 컨텍스트에 속하지 않습니다.
pl: Dany blok operacji nie należy do bieżącego kontekstu analizy.
pt_br: O bloqueio de operação fornecido não pertence ao contexto de análise atual.
ru: Заданный блок операции не принадлежит текущему контексту анализа.
tr: Belirtilen işlem bloğu geçerli analiz bağlamına ait değil.
zh_hans: 给定操作块不属于当前的分析上下文。
zh_hant: 指定的作業區塊不屬於目前的分析內容。

# IsSymbolAccessibleBadWithin
source: Parameter '{0}' must be an 'INamedTypeSymbol' or an 'IAssemblySymbol'.
cs: Parametr {0} musí být INamedTypeSymbol nebo IAssemblySymbol.
de: Der Parameter "{0}" muss eine INamedTypeSymbol- oder eine IAssemblySymbol-Schnittstelle sein.
es: Parámetro '{0}' debe ser un 'INamedTypeSymbol' o un 'IAssemblySymbol'.
fr: Le paramètre '{0}' doit être un 'INamedTypeSymbol' ou un 'IAssemblySymbol'.
it: Il parametro '{0}' deve essere un elemento 'INamedTypeSymbol' o 'IAssemblySymbol'.
ja: パラメーター '{0}' は、'INamedTypeSymbol' または 'IAssemblySymbol' でなければなりません。
ko: '{0}' 매개 변수는 'INamedTypeSymbol' 또는 'IAssemblySymbol'이어야 합니다.
pl: Parametr „{0}” musi być interfejsem „INamedTypeSymbol” lub „IAssemblySymbol”.
pt_br: O parâmetro '{0}' deve ser um 'INamedTypeSymbol' ou um 'IAssemblySymbol'.
ru: Параметр "{0}" должен представлять собой "INamedTypeSymbol" или "IAssemblySymbol".
tr: '{0}' parametresi 'INamedTypeSymbol' veya 'IAssemblySymbol' olması gerekir.
zh_hans: 参数“{0}”必须是 "INamedTypeSymbol 或 "IAssemblySymbol"。
zh_hant: 參數 '{0}' 必須是 'INamedTypeSymbol' 或 'IAssemblySymbol’。

# IsSymbolAccessibleWrongAssembly
source: Parameter '{0}' must be a symbol from this compilation or some referenced assembly.
cs: Parametr {0} musí být symbol z této kompilace nebo některé odkazované sestavení.
de: Der Parameter "{0}" muss ein Symbol aus dieser Zusammenstellung oder eine referenzierte Assembly sein.
es: El parámetro "{0}" debe ser un símbolo de esta compilación o algún ensamble al que se hace referencia.
fr: Le paramètre '{0}' doit être un symbole de cette compilation ou un assembly référencé.
it: Il parametro '{0}' deve essere un simbolo di questa compilazione oppure un qualsiasi assembly cui viene fatto riferimento.
ja: パラメーター '{0}' は、このコンパイルまたはいくつかの参照アセンブリのシンボルにする必要があります。
ko: '{0}' 매개 변수는 이 컴파일 또는 일부 참조된 어셈블리의 기호여야 합니다.
pl: Parametr „{0}” musi być symbolem z tej kompilacji lub przywoływanym zestawem.
pt_br: O parâmetro '{0}' deve ser um símbolo desta compilação ou um assembly referenciado.
ru: Параметр "{0}" должен быть символом из этой компиляции или из другой сборки, на которую она ссылается.
tr: '{0}' parametresi bu derleme veya bazı başvurulan derleme bir sembol olması gerekir.
zh_hans: 参数“{0}”必须是此编译或某些引用程序集的符号。
zh_hant: 參數 '{0}' 必須是此編譯或某些參考組件中的符號。

# LineCannotBeGreaterThanEnd
source: The requested line number {0} must be less than the number of lines {1}.
cs: Požadované číslo řádku {0} musí být menší než počet řádků {1}.
es: El número de línea solicitado {0} debe ser menor que el número de líneas {1}.
it: Il numero di riga richiesto {0} deve essere minore del numero di righe {1}.
ja: 要求された行番号 {0} は、行数 {1} より小さくする必要があります。
ko: 요청한 줄 번호 {0}은(는) {1} 줄 수보다 작아야 합니다.
ru: Номер запрашиваемой строки {0} должен быть меньше числа строк {1}.
zh_hans: 请求的行号 {0} 必须小于 {1} 的行数。
zh_hant: 要求的行號 {0} 必須小於 {1} 的行數。

source: Method symbol expected
cs: Byl očekáván symbol metody.
es: Se esperaba un símbolo de método
it: È previsto un simbolo di metodo
ja: メソッド シンボルが必要です
ko: 메서드 기호가 필요합니다.
ru: Ожидается символ метода
zh_hans: 应为方法符号
zh_hant: 預期的方法符號

source: Module has invalid attributes.
cs: Modul zahrnuje neplatné atributy.
es: El módulo tiene atributos no válidos.
fr: Le module a des attributs non valides.
it: Il modulo contiene attributi non validi.
ja: モジュールに無効な属性があります。
ko: 모듈에 잘못된 특성이 있습니다.
pl: Moduł ma nieprawidłowe atrybuty.
pt_br: O módulo tem atributos inválidos.
ru: Модуль содержит недопустимые атрибуты.
tr: Modülde geçersiz öznitelikler var.
zh_hans: 模块具有无效属性。
zh_hant: 模組有無效的屬性。
