Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NonReportedDiagnosticCannotBeSuppressed
source: Non-reported diagnostic with ID '{0}' cannot be suppressed.
cs: Neohlášená diagnostika s ID {0} se nedá potlačit.
de: Die nicht gemeldete Diagnose mit der ID "{0}" kann nicht unterdrückt werden.
es: No se puede suprimir el diagnóstico no notificado con el id. "{0}".
fr: Impossible de supprimer le diagnostic non signalé ayant l'ID '{0}'.
it: Non è possibile eliminare la diagnostica non restituita con ID '{0}'.
ja: ID '{0}' を持つ未報告の診断を抑制することはできません。
ko: ID가 '{0}'인 보고되지 않는 진단은 표시되지 않도록 설정할 수 없습니다.
pl: Nie można pominąć niezgłoszonej diagnostyki o identyfikatorze „{0}”.
pt_br: O diagnóstico não relatado com a ID '{0}' não pode ser suprimido.
ru: Невозможно подавить невыводимую диагностику с идентификатором "{0}".
tr: '{0}' kimlikli raporlanamayan tanılama gizlenemiyor.
zh_hans: 不可禁止显示 ID 为“{0}”的未报告的诊断。
zh_hant: 無法隱藏識別碼為 '{0}' 的非回報診斷。

# NotARootOperation
source: Given operation has a non-null parent.
cs: Daná operace má nadřazenou položku, která není null.
de: Die angegebene Operation weist ein übergeordnetes Element ungleich NULL auf.
es: La operación dada tiene un elemento primario no nulo.
fr: L'opération donnée a un parent non-null.
it: L'operazione specificata contiene un elemento padre non Null.
ja: 指定した操作の親が null 以外です。
ko: 지정한 작업에 null이 아닌 부모가 있습니다.
pl: Dana operacja ma element nadrzędny inny niż null.
pt_br: A operação especificada tem um pai não nulo.
ru: Заданная операция имеет родительский элемент, отличный от NULL.
tr: Belirtilen işlemin null olmayan bir üst öğesi var.
zh_hans: 给定操作具有一个非 null 父级。
zh_hant: 指定的作業有非 null 的父代。

source: Nothing
cs: Nic
es: Nada
ja: なし
ko: 없음
ru: Ничего
zh_hans: 无
zh_hant: 無

# OperationHasNullSemanticModel
source: Given operation has a null semantic model.
cs: Daná operace má sémantický model null.
de: Die angegebene Operation weist ein NULL-Semantikmodell auf.
es: La operación dada tiene un modelo semántico nulo.
fr: L'opération donnée a un modèle sémantique Null.
it: L'operazione specificata contiene un modello semantico Null.
ja: 指定した操作のセマンティック モデルが null です。
ko: 지정한 작업에 null 의미 체계 모델이 있습니다.
pl: Dana operacja ma model semantyczny o wartości null.
pt_br: A operação fornecida tem um modelo não semântico.
ru: Заданная операция имеет семантическую модель со значением NULL.
tr: Belirtilen işlemin null bir anlam modeli var.
zh_hans: 给定操作具有一个 null 语义模型。
zh_hant: 指定的作業有 null 的語意模型。

# OperationMustNotBeControlFlowGraphPart
source: The provided operation must not be part of a Control Flow Graph.
cs: Zadaná operace nesmí být součástí grafu toku řízení.
de: Der angegebene Vorgang darf nicht Bestandteil eines Ablaufsteuerungsdiagramm sein.
es: La operación proporcionada no debe ser parte de un gráfico de flujo de control.
fr: L'opération fournie ne doit pas faire partie d'un graphique de flux de contrôle.
it: L'operazione specificata non deve essere inclusa in un grafico del flusso di controllo.
ja: 指定された操作を制御フロー グラフの一部にすることはできません。
ko: 제공된 작업은 제어 흐름 그래프의 일부가 아니어야 합니다.
pl: Podana operacja nie może być częścią grafu przepływu sterowania.
pt_br: A operação fornecida não deve ser parte de um Gráfico de Fluxo de Controle.
ru: Указанная операция не может быть частью графа потока управления.
tr: Sağlanan işlem denetimi akış grafiği bir parçası olmalıdır.
zh_hans: 提供的操作不能是控制流图的一部分。
zh_hant: 提供的運算不得為控制流程圖的一部分。

source: Output kind not supported.
cs: Druh výstupu se nepodporuje.
de: Ausgabetyp wird nicht unterstützt.
es: Tipo de salida no admitida.
fr: Type de sortie non pris en charge.
it: Il tipo di output non è supportato.
ja: 出力の種類がサポートされていません。
ko: 출력 종류가 지원되지 않습니다.
pl: Rodzaj wyjścia nie jest obsługiwany.
pt_br: Tipo de saída sem suporte.
ru: Неподдерживаемый тип выходных данных.
tr: Çıkış türü desteklenmiyor.
zh_hans: 输出类型不受支持。
zh_hant: 輸出種類不支援。

# PathReturnedByResolveMetadataFileMustBeAbsolute
source: Path returned by {0}.ResolveMetadataFile must be absolute: '{1}'
de: Der von {0}.ResolveMetadataFile zurückgegebene Pfad muss absolut sein: '{1}'
fr: Le chemin d'accès retourné par {0}.ResolveMetadataFile doit être absolu : '{1}'
it: Il percorso restituito da {0}.ResolveMetadataFile deve essere assoluto: '{1}'
ja: {0}.ResolveMetadataFile は絶対パスを返す必要があります: '{1}'
ko: {0}.ResolveMetadataFile에서 반환한 경로는 절대 경로여야 합니다. '{1}'
pl: Ścieżka zwrócona przez element {0}.ResolveMetadataFile musi być bezwzględna: „{1}”
pt_br: Caminho retornado por {0}.ResolveMetadataFile deve ser absoluto: "{1}"
tr: {0}.ResolveMetadataFile tarafından döndürülen yol mutlak olmalıdır: '{1}'

source: Assembly must have at least one module.
cs: Sestavení musí mít nejmíň jeden modul.
de: Assembly muss mindestens ein Modul aufweisen.
es: El ensamblado debe tener al menos un módulo.
fr: L'assembly doit avoir au moins un module.
it: L'assembly deve contenere almeno un modulo.
ja: アセンブリには、1 つ以上のモジュールが必要です。
ko: 어셈블리에는 모듈이 하나 이상 있어야 합니다.
pl: Zestaw musi mieć co najmniej jeden moduł.
pt_br: Assembly deve ter pelo menos um módulo.
ru: Сборка должна иметь хотя бы один модуль.
tr: Derleme en az bir modüle sahip olmalıdır.
zh_hans: 程序集必须有至少一个模块。
zh_hant: 組件至少必須要有一個模組。

# ModuleCopyCannotBeUsedToCreateAssemblyMetadata
source: Module copy can't be used to create an assembly metadata.
cs: Kopie modulu se nedá použít k vytvoření metadat sestavení.
de: Modulkopie kann nicht zum Erstellen von Assembly-Metadaten verwendet werden.
es: No se puede usar una copia de módulo para crear metadatos de ensamblado.
fr: Impossible d'utiliser le module de copie pour créer des métadonnées d'assembly.
it: Non è possibile usare la copia del modulo per creare i metadati di un assembly.
ja: モジュールのコピーは、アセンブリ メタデータの作成には使用できません。
ko: 모듈 복사본은 어셈블리 메타데이터를 만드는 데 사용할 수 없습니다.
pl: Nie można użyć kopii modułu do utworzenia metadanych zestawu.
pt_br: Cópia de módulo não pode ser usada para criar metadados do assembly.
ru: Копию модуля нельзя использовать для создания метаданных сборки.
tr: Derleme meta verileri oluşturmak için modül kopyası kullanılamaz.
zh_hans: 模块复制不能用于创建程序集元数据。
zh_hant: 不可使用模組複本建立組件中繼資料。

# SigningTempPathUnavailable
source: The temporary path for legacy file signing is unavailable.
cs: Dočasná cesta pro podepisování starší verze souboru není k dispozici.
es: La ruta de acceso temporal para la firma de archivos heredados no está disponible.
ja: レガシ ファイル署名の一時パスは使用できません。
ko: 레거시 파일 서명에 대한 임시 경로를 사용할 수 없습니다.
ru: Временный путь для подписывания устаревших файлов недоступен.
zh_hans: 旧式文件签名的临时路径不可用。
zh_hant: 舊版檔案簽署的暫存路徑無法使用。

# Single_type_per_generator_0
source: Only a single {0} can be registered per generator.
cs: Na jeden generátor je možné zaregistrovat jen jedno {0}.
es: Solo puede registrarse un único tipo de {0} por generador.
fr: Un seul {0} peut être inscrit par générateur.
it: È possibile registrare solo un tipo {0} per generatore.
ja: ジェネレーターごとに登録できるのは 1 つの {0} のみです。
ko: 생성기당 하나의 {0}만 등록할 수 있습니다.
pl: Można zarejestrować tylko jeden element {0} na generator.
pt_br: Somente um único {0} pode ser registrado por gerador.
ru: Для каждого генератора можно зарегистрировать только один {0}.
tr: Oluşturucu başına tek bir {0} kaydedilebilir.
zh_hans: 每个生成器仅可注册一个 {0}。
zh_hant: 每個產生器只能註冊一個 {0}。

# SourceTextRequiresEncoding
source: The SourceText with hintName '{0}' must have an explicit encoding set.
cs: SourceText s hintName {0} musí mít explicitní sadu kódování.
es: El elemento SourceText con hintName "{0}" debe tener un conjunto de codificación explícito.
it: L'elemento SourceText con hintName '{0}' deve avere una codifica esplicita impostata.
ja: hintName '{0}' の SourceText は、明示的なエンコード セットを含んでいる必要があります。
ko: hintName이 '{0}'인 SourceText에는 명시적 인코딩 집합이 있어야 합니다.
ru: SourceText с hintName "{0}" должен иметь явный набор кодировок.
zh_hans: 具有 hintName“{0}”的 SourceText 必须具有显式编码集。
zh_hant: 具有 hintName '{0}' 的 SourceText 必須有明確的編碼集。

# SupportedDiagnosticsHasNullDescriptor
source: Analyzer '{0}' contains a null descriptor in its 'SupportedDiagnostics'.
cs: Analyzátor {0} má v SupportedDiagnostics deskriptor s hodnotou null.
de: Der Analyzer "{0}" enthält einen NULL-Deskriptor in "SupportedDiagnostics".
es: El analizador de "{0}" contiene un descriptor nulo en "SupportedDiagnostics".
fr: L'analyseur '{0}' contient un descripteur null dans 'SupportedDiagnostics'.
it: L'analizzatore '{0}' contiene un descrittore Null nel relativo elemento 'SupportedDiagnostics'.
ja: アナライザー '{0}' の 'SupportedDiagnostics' に null 記述子が含まれています。
ko: '{0}' 분석기의 'SupportedDiagnostics'에 null 설명자가 포함되어 있습니다.
pl: Analizator „{0}” zawiera deskryptor null we właściwości „SupportedDiagnostics”.
pt_br: O analisador '{0}' contém um descritor nulo em seu 'SupportedDiagnostics'.
ru: Анализатор "{0}" содержит дескриптор null в разделе "SupportedDiagnostics".
tr: Çözümleyicisi '{0}', 'SupportedDiagnostics' boş bir tanımlayıcısı içerir.
zh_hans: 分析器“{0}”在其 "SupportedDiagnostics" 中包含 null 描述符。
zh_hant: 分析器 '{0}' 在其 'SupportedDiagnostics' 中包含一個 null 描述項。

# SupportedSuppressionsHasNullDescriptor
source: Analyzer '{0}' contains a null descriptor in its 'SupportedSuppressions'.
cs: Analyzátor {0} má v SupportedSuppressions popisovač s hodnotou null.
de: Das Analysetool "{0}" enthält einen NULL-Deskriptor in "SupportedDiagnostics".
es: El analizador "{0}" contiene un descriptor NULL en "SupportedDiagnostics".
fr: L'analyseur '{0}' contient un descripteur ayant une valeur null dans 'SupportedSuppressions'.
it: L'analizzatore '{0}' contiene un descrittore Null nel relativo elemento 'SupportedSuppressions'.
ja: アナライザー '{0}' の 'SupportedSuppressions' に null 記述子が含まれています。
ko: '{0}' 분석기의 'SupportedSuppressions'에 null 설명자가 포함되어 있습니다.
pl: Analizator „{0}” zawiera deskryptor null we właściwości „SupportedSuppressions”
pt_br: O analisador '{0}' contém um descritor nulo em seu 'SupportedSuppressions'.
ru: Анализатор "{0}" содержит дескриптор null в разделе "SupportedSuppressions".
tr: '{0}' çözümleyicisi, 'SupportedSuppressions' içinde boş bir tanımlayıcı içeriyor.
zh_hans: 分析器“{0}”在其 "SupportedSuppressions" 中包含 null 描述符。
zh_hant: 分析器 '{0}' 在其 'SupportedSuppressions' 中包含一個 null 描述項。

# SuppressionDiagnosticDescriptorMessage
source: Diagnostic '{0}: {1}' was programmatically suppressed by a DiagnosticSuppressor with suppression ID '{2}' and justification '{3}'
cs: Diagnostika {0}: {1} se programově potlačila pomocí DiagnosticSuppressor s ID potlačení {2} a odůvodněním {3}.
es: Un elemento DiagnosticSuppressor con el identificador de supresión "{2}" y la justificación "{3}" ha suprimido mediante programación el diagnóstico "{0}: {1}".
fr: Le diagnostic '{0} : {1}' a été supprimé par programmation par un DiagnosticSuppressor ayant l'ID de suppression '{2}' et la justification '{3}'
it: La diagnostica '{0}: {1}' è stata eliminata a livello di codice da un elemento DiagnosticSuppressor con ID eliminazione '{2}' e giustificazione '{3}'
ja: 診断 '{0}: {1}' は、抑制 ID '{2}' と理由 '{3}' で DiagnosticSuppressor によってプログラムで抑制されました
ko: 진단 '{0}:{1}'은(는) 비표시 ID가 '{2}'이고 근거가 '{3}'인 DiagnosticSuppressor에서 프로그래밍 방식으로 표시되지 않았습니다.
pl: Diagnostyka „{0}: {1}” została programowo pominięta przez interfejs DiagnosticSuppressor z identyfikatorem pominięcia „{2}” i uzasadnieniem „{3}”
pt_br: O diagnóstico '{0}: {1}' foi suprimido de forma programática por meio de um DiagnosticSuppressor com a ID de supressão '{2}' e a justificativa '{3}'
ru: Диагностика "{0}: {1}" была программно подавлена DiagnosticSuppressor с ИД подавления "{2}" и обоснованием "{3}".
tr: '{0}: {1}' tanılaması, '{2}' gizleme kimliği ve '{3}' gerekçesi ile DiagnosticSuppressor tarafından programlama yoluyla gizlendi
zh_hans: 具有禁止显示 ID {2} 和理由“{3}”的 DiagnosticSuppressor 已以编程方式禁止显示诊断“{0}: {1}”
zh_hant: 隱藏識別碼為 '{2}' 且理由為 '{3}' 的 DiagnosticSuppressor，以程式設計的方式隱藏了診斷 '{0}: {1}'

# SuppressionDiagnosticDescriptorTitle
source: Programmatic suppression of an analyzer diagnostic
cs: Programové potlačení diagnostiky analyzátoru
de: Programmgesteuerte Unterdrückung einer Analysetooldiagnose
es: Supresión mediante programación de un diagnóstico del analizador
fr: Suppression programmatique d'un diagnostic d'analyseur
it: Eliminazione a livello di codice di una diagnostica dell'analizzatore
ja: アナライザー診断のプログラムによる抑制
ko: 분석기 진단의 프로그래밍 방식 비표시
pl: Programowe pomijanie diagnostyki analizatora
pt_br: Supressão programática de um diagnóstico do analisador
ru: Программное подавление диагностики анализатора
tr: Bir çözümleyici tanılamasının programlı bir şekilde gizlenmesi
zh_hans: 以编程方式禁止显示分析器诊断
zh_hant: 以程式設計方式隱藏分析器診斷

# SuppressionIdCantBeNullOrWhitespace
source: A SuppressionDescriptor must have an Id that is neither null nor an empty string nor a string that only contains white space.
cs: SuppressionDescriptor musí mít ID, které není null, prázdný řetězec ani řetězec obsahující jenom prázdné znaky.
de: Ein SuppressionDescriptor muss eine ID aufweisen, die weder NULL noch eine leere Zeichenfolge noch eine Zeichenfolge ist, die nur Leerzeichen enthält.
es: Un elemento SuppressionDescriptor debe tener un id. que no sea NULL, una cadena vacía ni una cadena que solo contenga un espacio en blanco.
fr: SuppressionDescriptor doit avoir un ID qui n'est ni une valeur null, ni une chaîne vide, ni une chaîne contenant uniquement des espaces blancs.
it: L'ID di un elemento SuppressionDescriptor non deve essere Null, né una stringa vuota o una stringa composta solo da spazi vuoti.
ja: SuppressionDescriptor では、null でも、空の文字列でも、空白のみの文字列でもない ID が必要です。
ko: SuppressionDescriptor에 null, 빈 문자열 및 공백만 포함된 문자열이 아닌 ID가 있어야 합니다.
pl: Interfejs DiagnosticDescriptor musi mieć identyfikator, który nie ma wartości null, nie jest ciągiem pustym ani nie jest ciągiem zawierającym tylko białe znaki.
pt_br: A ID do SuppressionDescriptor não pode ser nula, não deve ser uma cadeia de caracteres vazia nem deve ser uma cadeia de caracteres que contenha apenas espaços em branco.
ru: SuppressionDescriptor должен иметь идентификатор, который не является значением NULL, пустой строкой или строкой, состоящей из одного пробела.
tr: SuppressionDescriptor türünün kimliği, null veya boş bir dize ya da yalnızca boşluk içeren bir dize olmamalıdır.
zh_hans: A SuppressionDescriptor 必须具有一个 ID，且该 ID 不为 null、不是空字符串且不是仅包含空格的字符串。
zh_hant: SuppressionDescriptor 的識別碼不得為 null、空白字串或只包含空白字元的字串。

# TupleElementNullableAnnotationCountMismatch
source: If tuple element nullable annotations are specified, the number of annotations must match the cardinality of the tuple.
cs: Pokud jsou zadané anotace prvků řazené kolekce členů s možnou hodnotou null, musí se počet anotací shodovat s kardinalitou této řazené kolekce členů.
de: Wenn Nullable-Anmerkungen für Tupelelemente angegeben werden, muss die Anzahl von Anmerkungen der Kardinalität des Tupels entsprechen.
es: Si se especifican las anotaciones que aceptan valores NULL de los elementos de tupla, el número de anotaciones debe coincidir con la cardinalidad de la tupla.
fr: Si des annotations de type Nullable pour des éléments de tuples sont spécifiées, le nombre d'annotations doit correspondre à la cardinalité du tuple.
it: Se si specificano annotazioni nullable di elementi di tupla, il numero delle annotazioni deve corrispondere alla cardinalità della tupla.
ja: タプル要素の Null 許容の注釈を指定する場合、注釈の数はタプルの基数と一致する必要があります。
ko: 튜플 요소 nullable 주석이 지정된 경우, 주석 수는 튜플의 카디널리티와 일치해야 합니다.
pl: Jeśli określono adnotacje elementów krotki z możliwością ustawiania wartości null, liczba adnotacji musi zgadzać się z kardynalnością krotki.
pt_br: Se as anotações anuláveis de elementos de tupla forem especificadas, o número de anotações deverá corresponder à cardinalidade da tupla.
ru: Если указаны аннотации элементов кортежа, допускающих значения null, то число аннотаций должно соответствовать кратности кортежа.
tr: Demet öğelerine yönelik boş değer atanabilir ek açıklamalar belirtildiyse, ek açıklamaların sayısı demetin kardinalitesiyle eşleşmelidir.
zh_hans: 如果已指定元组元素可以为 null 的注释，则注释的数量必须与元组基数相匹配。
zh_hant: 如果指定元組元素可為 Null 的註釋，註釋數目就必須符合元組的基數。

# UnableToDetermineSpecificCauseOfFailure
source: Unable to determine specific cause of the failure.
cs: Nepodařilo se určit konkrétní příčinu selhání.
es: No se puede determinar la causa específica del error.
fr: Impossible de déterminer la cause spécifique de l'échec.
it: Non è possibile determinare la causa specifica dell'errore.
ja: エラーの具体的な原因を特定できません。
ko: 오류의 특정 원인을 확인할 수 없습니다.
pl: Nie można ustalić konkretnej przyczyny niepowodzenia.
pt_br: Não é possível determinar a causa específica da falha.
ru: Не удается определить конкретную причину сбоя.
tr: Hatanın nedeni belirlenemiyor.
zh_hans: 无法确定失败的具体原因。
zh_hant: 無法判斷失敗的具體原因。

source: Unresolved:
cs: Nevyřešeno:
de: Nicht aufgelöst:
es: Sin resolver:
fr: Non résolu :
it: Non risolto:
ja: 未解決:
ko: 확인되지 않음:
pl: Nierozpoznane:
pt_br: Não resolvido:
ru: Не разрешено:
tr: Çözümlenmemiş:
zh_hans: 未解析:
zh_hant: 未解析:

source: assembly
cs: sestavení
es: ensamblado
ja: アセンブリ
ko: 어셈블리
pl: zestaw
ru: сборка
tr: derleme
zh_hans: 程序集
zh_hant: 組件

# Class1
source: class
cs: třída
de: Klasse
es: clase
fr: classe
it: classe
ja: クラス
ko: 클래스
pl: klasa
pt_br: classe
ru: класс
tr: sınıf
zh_hans: 类
zh_hant: 類別

source: constructor
cs: konstruktor
de: Konstruktor
fr: constructeur
it: costruttore
ja: コンストラクター
ko: 생성자
pl: konstruktor
pt_br: construtor
ru: конструктор
tr: oluşturucu
zh_hans: 构造函数
zh_hant: 建構函式

# Delegate1
source: delegate
cs: delegát
de: Delegat
es: delegado
fr: délégué
it: delegato
ja: デリゲート
ko: 대리자
pl: delegat
pt_br: delegar
ru: делегат
tr: temsilci
zh_hans: 委托
zh_hant: 委派

# Enum1
source: enum
cs: výčet
de: Aufzählung
es: enumeración
it: enumerazione
ja: 列挙型
ko: 열거형
pl: wyliczenie
ru: перечисление
tr: sabit listesi
zh_hans: 枚举
zh_hant: 列舉

# Event1
source: event
cs: událost
de: Ereignis
es: evento
fr: événement
it: evento
ja: イベント
ko: 이벤트
pl: zdarzenie
pt_br: evento
ru: событие
tr: olay
zh_hans: 事件
zh_hant: 事件

source: field
cs: pole
de: Feld
es: Campo
fr: Champ
it: campo
ja: フィールド
ko: 필드
pl: pole
pt_br: Campo
ru: Поле
tr: alan
zh_hans: 字段
zh_hant: 欄位

source: type parameter
cs: parametr typu
de: Typparameter
es: parámetro de tipo
fr: paramètre de type
it: parametro di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: parametr typu
pt_br: parâmetro de tipo
ru: параметр типа
tr: tür parametresi
zh_hans: 类型形参
zh_hant: 類型參數

# Interface1
source: interface
cs: rozhraní
de: Schnittstelle
es: interfaz
it: interfaccia
ja: インターフェイス
ko: 인터페이스
pl: interfejs
ru: интерфейс
tr: arabirim
zh_hans: 接口
zh_hant: 介面

source: method
cs: metoda
de: Methode
es: método
fr: méthode
it: metodo
ja: メソッド
ko: 메서드
pl: metoda
pt_br: método
ru: метод
tr: yöntem
zh_hans: 方法
zh_hant: 方法

source: module
cs: modul
de: Modul
es: módulo
it: modulo
ja: モジュール
ko: 모듈
pl: moduł
pt_br: módulo
ru: модуль
tr: modül
zh_hans: 模块
zh_hant: 模組

source: parameter
cs: parametr
es: parámetro
fr: paramètre
it: parametro
ja: パラメーター
ko: 매개 변수
pl: parametr
pt_br: parâmetro
ru: параметр
tr: parametre
zh_hans: 参数
zh_hant: 參數

# Property
source: property, indexer
cs: vlastnost, indexer
de: Eigenschaft, Indexer
es: propiedad, indizador
fr: propriété, indexeur
it: proprietà, indicizzatore
ja: プロパティ、インデクサー
ko: 속성, 인덱서
pl: właściwość, indeksator
pt_br: propriedade, indexador
ru: свойство, индексатор
tr: özellik, dizin oluşturucusu
zh_hans: 属性、索引器
zh_hant: 屬性, 索引子

# Return1
source: return
cs: návrat
de: Zurück
es: volver
fr: retour
it: valore restituito
ja: 戻る
ko: 돌아가기
pl: zwracany
pt_br: retornar
ru: возврат
tr: dönüş
zh_hans: 返回
zh_hant: 返回

# Struct1
source: struct
cs: struktura
de: Struktur
es: estructura
ja: 構造体
ko: 구조체
pl: struktura
zh_hans: 结构
zh_hant: 結構

# CannotCreateReferenceToSubmission
source: Can't create a reference to a submission.
cs: Nejde vytvořit odkaz na odeslání.
de: Zu einer Übermittlung konnte kein Verweis erstellt werden.
es: No se puede crear una referencia a un envío.
fr: Impossible de créer une référence à une soumission.
it: Non è possibile creare un riferimento a un invio.
ja: 送信への参照は作成できません。
ko: 제출에 대한 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania do przesłanego elementu.
pt_br: Não é possível criar uma referência para um envio.
ru: Не удается создать ссылку на сообщение.
tr: Bir gönderime başvuru oluşturulamaz.
zh_hans: 不能创建对提交的引用。
zh_hant: 無法建立對提交的參考。

# CannotCreateReferenceToModule
source: Can't create a reference to a module.
cs: Nejde vytvořit odkaz na modul.
de: Zu einem Modul konnte kein Verweis erstellt werden.
es: No se puede crear una referencia a un módulo.
fr: Impossible de créer une référence à un module.
it: Non è possibile creare un riferimento a un modulo.
ja: モジュールへの参照は作成できません。
ko: 모듈에 대한 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania do modułu.
pt_br: Não é possível criar uma referência a um módulo.
ru: Не удается создать ссылку на модуль.
tr: Bir modüle başvuru oluşturulamaz.
zh_hans: 不能创建对模块的引用。
zh_hant: 無法建立對模組的參考。

source: <in-memory assembly>
cs: <sestavení v paměti>
es: <ensamblado en memoria>
fr: <assembly en mémoire>
it: <assembly in memoria>
ja: <メモリ内アセンブリ>
ko: <메모리 내 어셈블리>
pl: <zestaw w pamięci>
ru: <сборка в памяти>
tr: < bellek içi derleme >
zh_hans: <内存中的程序集>
zh_hant: <記憶體內組件>

source: <in-memory module>
cs: <modul v paměti>
de: <In-Memory-Modul>
es: <módulo en memoria>
fr: <module en mémoire>
it: <modulo in memoria>
ja: <メモリ内モジュール>
ko: <메모리 내 모듈>
pl: <moduł w pamięci>
pt_br: <módulo na memória>
ru: <модуль в памяти>
tr: < bellek modülü >
zh_hans: <内存中的模块>
zh_hant: <記憶體內部模組>

source: Size has to be positive.
cs: Velikost musí být kladná.
de: Größe muss positiv sein.
es: El tamaño ha de ser positivo.
fr: La taille doit être positive.
it: Il valore delle dimensioni deve essere positivo.
ja: サイズには正の値が必要です。
ko: 크기는 양수여야 합니다.
pl: Rozmiar musi być wartością dodatnią.
pt_br: Tamanho deve ser positivo.
ru: Размер должен иметь положительное значение.
tr: Boyut pozitif olmalıdır.
zh_hans: 大小必须为正数。
zh_hant: 大小必須為正值。

source: Assembly file not found
de: Assemblydatei nicht gefunden
fr: Fichier d'assembly introuvable
it: Il file di assembly non è stato trovato
ja: アセンブリ ファイルが見つかりません
ko: 어셈블리 파일을 찾을 수 없습니다.
pl: Nie znaleziono pliku zestawu
pt_br: Arquivo do assembly não encontrado
tr: Derleme dosyası bulunamadı

# CannotEmbedInteropTypesFromModule
source: Can't embed interop types from module.
cs: Nejde vložit typy spolupráce z modulu.
de: Die Interoptypen aus dem Modul konnten nicht eingebettet werden.
es: No se pueden insertar tipos de interoperabilidad desde el módulo.
fr: Impossible d'incorporer des types interop du module.
it: Non è possibile incorporare tipi di interoperabilità dal modulo.
ja: モジュールから相互運用型を埋め込むことはできません。
ko: 모듈에서 interop 형식을 포함할 수 없습니다.
pl: Nie można osadzić typów międzyoperacyjnych z modułu.
pt_br: Não é possível inserir tipos de interoperabilidade do módulo.
ru: Не удается внедрить типы взаимодействия из модуля.
tr: Birlikte çalışma türleri modülden katıştırılamıyor.
zh_hans: 不能从模块嵌入互操作类型。
zh_hant: 無法從模組內嵌 interop 類型。

# CannotAliasModule
source: Can't alias a module.
cs: Modul nejde označit aliasem.
de: Ein Modul kann nicht bezeichnet werden.
es: Un módulo no puede tener alias.
fr: Impossible de créer un alias d'un module.
it: Non è possibile creare l'alias di un modulo.
ja: モジュールにエイリアスを付けることはできません。
ko: 모듈에 별칭을 지정할 수 없습니다.
pl: Nie można ustawić aliasu dla modułu.
pt_br: Não é possível atribuir alias a um módulo.
ru: Не удается использовать псевдоним для модуля.
tr: Bir modüle diğer ad verilemez.
zh_hans: 不能给模块起别名。
zh_hant: 無法指定模組別名。

source: Invalid alias.
cs: Neplatný alias
de: Ungültiger Alias.
es: Alias no válido.
fr: Alias non valide.
it: L'alias non è valido.
ja: エイリアスが無効です。
ko: 잘못된 별칭입니다.
pl: Nieprawidłowy alias.
pt_br: Alias inválido.
ru: Недопустимый псевдоним.
tr: Geçersiz diğer ad.
zh_hans: 无效别名。
zh_hant: 別名無效。
