Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_MultipleGlobalAnalyzerKeys_Title
source: Multiple global analyzer config files set the same key. It has been unset.
cs: Několik konfiguračních souborů globálního analyzátoru nastavuje stejný klíč. Jeho nastavení se zrušilo
es: Varios archivos de configuración de analizador global establecen la misma clave. No se ha establecido.
fr: Plusieurs fichiers config d'analyseur global définissent la même clé. Elle a été annulée.
it: Più file di configurazione dell'analizzatore globale impostano la stessa chiave. L'impostazione è stata annullata.
ja: 複数のグローバル アナライザー構成ファイルで同じキーが設定されている。設定が解除された。
ko: 여러 전역 분석기 구성 파일이 같은 키를 설정했습니다. 해당 키 설정이 해제되었습니다.
pl: Wiele plików konfiguracji analizatora globalnego ustawiło ten sam klucz. To ustawienie zostało wycofane.
pt_br: Vários arquivos de configuração do analisador global definem a mesma chave. Essa definição foi removida.
ru: В нескольких файлах конфигурации глобального анализатора установлен один и тот же ключ. Установка этого ключа отменена.
tr: Birden çok genel çözümleyici yapılandırma dosyası aynı anahtarı ayarladı. Ayar kaldırıldı.
zh_hans: 多个全局分析器配置文件设置了相同的密钥。它已取消设置。
zh_hant: 有多個全域分析器設定檔，設定了相同的索引碼。該索引碼設定已取消。

# WinRTIdentityCantBeRetargetable
source: WindowsRuntime identity can't be retargetable
cs: U identity WindowsRuntime se nedá změnit cíl.
de: WindowsRuntime-Identität darf nicht anzielbar sein
es: La identidad WindowsRuntime no puede ser redestinable
fr: L'identité WindowsRuntime ne peut pas être reciblable
it: Non è possibile ridefinire la destinazione dell'identità WindowsRuntime
ja: WindowsRuntime の ID を再ターゲット可能にすることはできません
ko: WindowsRuntime ID는 대상으로 다시 지정할 수 없습니다.
pl: Tożsamość WindowsRuntime nie może być elementem, który można ponownie ustawić jako cel
pt_br: Identidade de WindowsRuntime não pode ser redirecionável
ru: Идентификатор WindowsRuntime не может быть перенацеливаемым
tr: WindowsRuntime kimliği yeniden hedeflendirilebilir olamaz
zh_hans: WindowsRuntime 标识不可重定目标
zh_hant: 無法重新指定 WindowsRuntime 身分識別目標

source: PE image not available.
de: PE-Abbild nicht verfügbar.
fr: L'image PE n'est pas disponible.
it: L'immagine PE non è disponibile.
ja: PE イメージは使用できません。
ko: PE 이미지를 사용할 수 없습니다.
pl: Obraz PE jest niedostępny.
pt_br: Imagem PE não está disponível.
tr: PE görüntüsü kullanılamıyor.

source: Assembly signing not supported.
cs: Podepsání sestavení se nepodporuje.
de: Assemblysignierung nicht unterstützt.
es: Firma de ensamblados no admitida.
fr: La signature d'assembly n'est pas prise en charge.
it: La firma dell'assembly non è supportata.
ja: アセンブリの署名はサポートされません。
ko: 어셈블리 서명은 지원되지 않습니다.
pl: Podpisywanie zestawu nie jest obsługiwane.
pt_br: Assinatura de assembly não tem suporte.
ru: Подписывание сборок не поддерживается.
tr: Derleme imzalama desteklenmiyor.
zh_hans: 不支持程序集签名。
zh_hant: 不支援組件簽署。

# XmlReferencesNotSupported
source: References to XML documents are not supported.
cs: Odkazy na dokumenty XML se nepodporují.
de: Verweise zu XML-Dokumenten werden nicht unterstützt.
es: No se admiten referencias a documentos XML.
fr: Les références à des documents XML ne sont pas prises en charge.
it: I riferimenti ai documenti XML non sono supportati.
ja: XML ドキュメントへの参照はサポートされません。
ko: XML 문서에 대한 참조는 지원되지 않습니다.
pl: Odwołania do dokumentów XML są nieobsługiwane.
pt_br: Não há suporte a referências a documentos XML.
ru: Ссылки на документы XML не поддерживаются.
tr: XML belgelerine yönelik başvurular desteklenmez.
zh_hans: 不支持 XML 文档的引用。
zh_hant: 不支援對 XML 文件的參考。

# FailedToResolveRuleSetName
source: Could not locate the rule set file '{0}'.
de: Fehler beim Suchen der Regelsatzdatei "{0}"
fr: Impossible de trouver le fichier d'ensemble de règles '{0}'.
it: Non è stato possibile individuare il file del set di regole '{0}'.
ja: 規則セット ファイル '{0}' が見つかりませんでした。
ko: 규칙 집합 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć pliku zestawu reguł „{0}”.
pt_br: Não foi possível localizar o arquivo de conjunto de regras '{0}'.
tr: Kural kümesi dosyası '{0}' bulunamadı.

# InvalidRuleSetInclude
source: An error occurred while loading the included rule set file {0} - {1}
cs: Při načítání zahrnutého souboru sady pravidel {0} došlo k chybě: {1}
de: Fehler beim Laden der eingeschlossenen Regelsatzdatei {0} - {1}
es: Se produjo un error al cargar el archivo de conjuntos de reglas incluido {0} - {1}
fr: Une erreur s'est produite lors du chargement du fichier d'ensemble de règles inclus {0} - {1}
it: Si è verificato un errore durante il caricamento del file del set di regole incluso {0} - {1}
ja: 含まれている規則セット ファイル {0} - {1} の読み込み中にエラーが発生しました
ko: 포함된 규칙 설정 파일 {0}을(를) 로드하는 동안 오류가 발생했습니다. {1}
pl: Podczas ładowania dołączonego pliku zestawu reguł wystąpił błąd {0} — {1}
pt_br: Erro ao carregar o arquivo de conjunto de regras incluído {0} - {1}
ru: Произошла ошибка при загрузке включенного файла набора правил {0} — {1}
tr: Eklenen kural kümesi dosyası {0} yüklenirken bir hata oluştu: {1}
zh_hans: 加载所含规则集文件 {0} - {1} 时出错
zh_hant: 載入包含的規則集檔案 {0} 時發生錯誤 - {1}

# CompilerAnalyzerFailure
source: Analyzer Failure
cs: Chyba analyzátoru
de: Analysefehler
es: Error del analizador
fr: Échec de l'analyseur
it: Errore dell'analizzatore
ja: アナライザー エラー
ko: 분석기 오류
pl: Błąd analizatora
pt_br: Falha no Analisador
ru: Сбой анализатора
tr: Çözümleyici Hatası
zh_hans: 分析器故障
zh_hant: 分析器失敗

# CompilerAnalyzerThrows
source: Analyzer '{0}' threw an exception of type '{1}' with message '{2}'. {3}
cs: Analyzátor {0} způsobil výjimku typu {1} se zprávou {2}. {3}
es: El analizador "{0}" produjo una excepción de tipo "{1}" con el mensaje "{2}". {3}
fr: L'analyseur '{0}' a levé une exception de type '{1}' avec le message '{2}'. {3}
it: L'analizzatore '{0}' ha generato un'eccezione di tipo '{1}'. Messaggio: '{2}'. {3}
ja: アナライザー '{0}' が型 '{1}' の例外をメッセージ '{2}' 付きでスローしました。 {3}
ko: 분석기 '{0}'에서 '{2}' 메시지와 함께 '{1}' 형식의 예외를 throw했습니다. {3}
pl: Analizator „{0}” zgłosił wyjątek typu „{1}” z komunikatem „{2}”. {3}
pt_br: O analisador '{0}' gerou uma exceção do tipo '{1}' com a mensagem '{2}'. {3}
ru: Анализатор "{0}" создал исключение типа "{1}" с сообщением "{2}". {3}
tr: '{0}' çözümleyicisi '{2}' iletisiyle '{1}' türünde bir özel durum oluşturdu. {3}
zh_hans: 分析器“{0}”引发类型为“{1}”的异常，并显示消息“{2}”。 {3}
zh_hant: 分析器 '{0}' 擲回了類型為 '{1}' 的例外狀況。訊息: '{2}'。 {3}

source: Analyzer Driver Failure
cs: Chyba ovladače analyzátoru
de: Fehler des Analysetreibers.
es: Error del controlador del analizador
fr: Échec du pilote de l'analyseur
it: Errore del driver dell'analizzatore
ja: アナライザー ドライバー エラー
ko: 분석기 드라이버 오류
pl: Błąd sterownika analizatora
pt_br: Falha no Driver do Analisador
ru: Сбой драйвера анализатора
tr: Çözümleyici Sürücüsü Hatası
zh_hans: 分析器驱动程序故障
zh_hant: 分析器驅動程式失敗

# AnalyzerDriverThrows
source: Analyzer driver threw an exception of type '{0}' with message '{1}'. {2}
cs: Ovladač analyzátoru způsobil výjimku typu {0} se zprávou {1}. {2}
es: El controlador del analizador produjo una excepción de tipo '{0}' con el mensaje '{1}'. {2}
ja: アナライザー ドライバーが型 '{0}' の例外をメッセージ '{1}' 付きでスローしました。 {2}
ko: 분석기 드라이버에서 '{0}' 메시지와 함께 '{1}' 형식의 예외를 throw했습니다. {2}
ru: Драйвер анализатора вызвал исключение типа "{0}" с сообщением "{1}". {2}
zh_hans: 分析器驱动程序抛出类型为“{0}”的异常，并显示消息“{1}”。 {2}
zh_hant: 分析器驅動程式擲回類型 '{0}' 的例外狀況，訊息為 '{1}'。 {2}

source: PE image doesn't contain managed metadata.
cs: Image PE neobsahuje spravovaná metadata.
de: PE-Abbild enthält keine verwalteten Metadaten.
es: La imagen PE no contiene metadatos administrados.
fr: L'image PE ne contient pas de métadonnées gérées.
it: L'immagine PE non contiene metadati gestiti.
ja: PE イメージには、管理されたメタデータが含まれていません。
ko: PE 이미지에 관리된 메타데이터가 포함되어 있지 않습니다.
pl: Obraz PE nie zawiera zarządzanych metadanych.
pt_br: Imagem PE não contém metadados gerenciados.
ru: Образ среды предустановки не содержит управляемые метаданные.
tr: PE görüntüsü yönetilen meta verileri içermiyor.
zh_hans: PE 映像不包含任何托管元数据。
zh_hant: PE 映像不包含 Managed 中繼資料。

# ChangesMustNotOverlap
source: The changes must not overlap.
cs: Změny musí být seřazené a nesmí se překrývat.
de: Die Änderungen müssen sortiert sein und dürfen sich nicht überschneiden.
es: Los cambios deben estar ordenados y no superponerse.
fr: Les modifications doivent être ordonnées et ne pas se chevaucher.
it: Le modifiche devono essere ordinate e non sovrapposte.
ja: 変更は順序付けする必要があり、重複は許可されません。
ko: 변경 내용의 순서를 지정해야 하고 겹쳐서는 안 됩니다.
pl: Zmiany muszą być uporządkowane i nie mogą nakładać się na siebie.
pt_br: As alterações devem ser ordenadas e não sobrepostas.
ru: Изменения должны идти в строгом порядке и не накладываться.
tr: Değişiklikler sıralanmalı ve çakışmamalıdır.
zh_hans: 更改必须有序且不重叠。
zh_hant: 變更必須排序且不可重疊。

# DiagnosticIdCantBeNullOrWhitespace
source: A DiagnosticDescriptor must have an Id that is neither null nor an empty string nor a string that only contains white space.
cs: DiagnosticDescriptor musí mít ID, které není null, prázdný řetězec, ani řetězec obsahující jenom prázdné znaky.
de: Ein "DiagnosticDescriptor" muss eine ID aufweisen, die nicht NULL, keine leere Zeichenfolge und keine Zeichenfolge ist, die nur Leerzeichen enthält.
es: Un DiagnosticDescriptor debe tener un identificador que no sea nulo, que no sea una cadena vacía y que no sea una cadena que solo contenga espacio en blanco.
fr: DiagnosticDescriptor doit avoir un ID qui n'est ni une valeur Null, ni une chaîne vide, ni une chaîne contenant uniquement des espaces blancs.
it: L'ID di un elemento DiagnosticDescriptor non deve essere Null, né una stringa vuota o una stringa composta solo da spazi vuoti.
ja: DiagnosticDescriptor の ID は、null、空の文字列、または空白のみの文字列でもない必要があります。
ko: DiagnosticDescriptor에 null, 빈 문자열 및 공백만 포함된 문자열이 아닌 ID가 있어야 합니다.
pl: DiagnosticDescriptor musi mieć identyfikator, który nie ma wartości null, nie jest ciągiem pustym ani nie jest ciągiem zawierającym tylko puste miejsca.
pt_br: A ID do DiagnosticDescriptor não deve ser nula, não deve ser uma cadeia de caracteres vazia nem deve ser uma cadeia de caracteres que contenha apenas espaços em branco.
ru: DiagnosticDescriptor должен иметь идентификатор, который не является значением NULL, пустой строкой или строкой, состоящей из одного пробела.
tr: DiagnosticDescriptor türünün null veya boş dize ya da yalnızca boşluk içeren dize olmayan bir kimliğinin olması gerekir.
zh_hans: DiagnosticDescriptor 必须有一个 ID，该 ID 不能为 null、空字符串或只包含空格的字符串。
zh_hant: DiagnosticDescriptor 的識別碼不得為 null、空白字串或只包含空白字元的字串。

# RuleSetHasDuplicateRules
source: The rule set file has duplicate rules for '{0}' with differing actions '{1}' and '{2}'.
cs: Soubor sady pravidel obsahuje duplicitní pravidla pro {0} s odlišnými akcemi {1} a {2}.
de: Die Regelsatzdatei weist doppelte Regeln für '{0}' mit abweichenden Aktionen '{1}' und '{2}' auf.
es: El archivo de conjuntos de reglas tiene reglas duplicadas para '{0}' con las acciones distintas '{1}' y '{2}'.
fr: Le fichier d'ensemble de règles possède des règles dupliquées pour '{0}' avec des actions différentes '{1}' et '{2}'.
it: Il file del set di regole contiene regole duplicate per '{0}' con azioni '{1}' e '{2}' diverse.
ja: 規則セット ファイルは、異なるアクション '{1}' と '{2}' を持つ '{0}' の規則が重複しています。
ko: 규칙 설정 파일에서 '{1}' 및 '{2}'이(가) 다르게 동작하는 '{0}'에 대한 규칙이 중복되었습니다.
pl: Plik zestawu reguł ma zduplikowane reguły w przypadku elementu „{0}” z różniącymi się akcjami „{1}” i „{2}”.
pt_br: O arquivo de conjunto de regras tem regras duplicadas para "{0}" com ações "{1}" e "{2}".
ru: Файл набора правил содержит повторяющиеся правила для "{0}" с разными действиями, "{1}" и "{2}".
tr: Kural kümesi dosyası farklı '{1}' ve '{2}' eylemleri ile '{0}' için yinelenen kurallara sahiptir.
zh_hans: 规则集文件对有不同操作 “{1}” 和“{2}”的“{0}”有重复规则。
zh_hant: 規則集檔案中 '{0}' 的規則重複，差異在於動作 '{1}' 及 '{2}'。

# CantCreateModuleReferenceToAssembly
source: Can't create a module reference to an assembly.
cs: Nejde vytvořit odkaz modulu na sestavení.
de: Modulverweis auf eine Assembly kann nicht erstellt werden.
es: No se puede crear una referencia de módulo en un ensamblado.
fr: Impossible de créer une référence de module à un assembly.
it: Non è possibile creare un riferimento del modulo a un assembly.
ja: アセンブリのモジュール参照を作成できません。
ko: 어셈블리에 대한 모듈 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania modułu do zestawu.
pt_br: Não é possível criar uma referência de módulo a um assembly.
ru: Не удается создать ссылку модуля на сборку.
tr: Bir derleme dosyasına bir modül başvurusu oluşturulamaz.
zh_hans: 无法对程序集创建模块引用.
zh_hant: 無法為組件建立模組參考。

# CantCreateReferenceToDynamicAssembly
source: Can't create a metadata reference to a dynamic assembly.
cs: Nejde vytvořit odkaz metadat na dynamické sestavení.
de: Metadatenverweis auf eine dynamische Assembly kann nicht erstellt werden.
es: No se puede crear una referencia de metadatos en un ensamblado dinámico.
fr: Impossible de créer une référence de métadonnées à un assembly dynamique.
it: Non è possibile creare un riferimento dei metadati a un assembly dinamico.
ja: 動的アセンブリのメタデータ参照を作成できません。
ko: 동적 어셈블리에 대한 메타데이터 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania metadanych do zestawu dynamicznego.
pt_br: Não é possível criar uma referência de metadados a um assembly dinâmico.
ru: Не удается создать ссылку метаданных на динамическую сборку.
tr: Dinamik bir derleme dosyasına bir meta veri başvurusu oluşturulamaz.
zh_hans: 无法对动态程序集创建元数据引用。
zh_hant: 無法為動態組件建立中繼資料參考。

# CantCreateReferenceToAssemblyWithoutLocation
source: Can't create a metadata reference to an assembly without location.
cs: Nedá se vytvořit odkaz na metadata do sestavení bez umístění.
de: Ein Metadatenverweis auf eine Assembly ohne Speicherort kann nicht erstellt werden.
es: No se puede crear una referencia de metadatos a un ensamblado sin ubicación.
fr: Impossible de créer une référence de métadonnées pour un assembly sans emplacement.
it: Non è possibile creare un riferimento dei metadati a un assembly senza percorso.
ja: 位置が指定されていないアセンブリのメタデータ参照を作成できません。
ko: 위치 없이 어셈블리에 대한 메타데이터 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania metadanych do zestawu bez lokalizacji.
pt_br: Não é possível criar uma referência de metadados para um assembly sem o local.
ru: Невозможно создать ссылку на метаданные в сборке без расположения.
tr: Konum olmadan bir derlemeye meta veri başvurusu oluşturulamaz.
zh_hans: 无法对不含位置的程序集创建元数据引用。
zh_hant: 無法對沒有位置的組件建立中繼資料參考。

source: Argument cannot be empty.
cs: Argument nemůže být prázdný.
de: Argument darf nicht leer sein.
es: El argumento no puede estar vacío.
fr: L'argument ne peut pas être vide.
it: L'argomento non può essere vuoto.
ja: 引数を空にすることはできません。
ko: 인수는 비워 둘 수 없습니다.
pl: Argument nie może być pusty.
pt_br: O argumento não pode estar vazio.
ru: Аргумент не может быть пустым.
tr: Bağımsız değişken boş olamaz.
zh_hans: 参数不能为空。
zh_hant: 引數不可為空白。

# ArgumentElementCannotBeNull
source: Argument cannot have a null element.
cs: Argument nemůže mít element, který je null.
de: Argument darf kein Nullelement enthalten.
es: El argumento no puede tener un elemento nulo.
fr: L'argument ne peut pas avoir un élément null.
it: L'argomento non può contenere un elemento Null.
ja: 引数に null 要素は指定できません。
ko: 인수에는 null 요소가 있을 수 없습니다.
pl: Argument nie może zawierać elementu o wartości null.
pt_br: O argumento não pode ter um elemento nulo.
ru: Аргумент не может содержать элемент NULL.
tr: Bağımsız değişken null öğe içeremez.
zh_hans: 参数不能具有 null 元素。
zh_hant: 引數不能有 null 元素。

# UnsupportedDiagnosticReported
source: Reported diagnostic with ID '{0}' is not supported by the analyzer.
cs: Ohlášená diagnostika s ID {0} se v analyzátoru nepodporuje.
de: Die gemeldete Diagnose mit ID "{0}" wird vom Diagnoseanalysetool nicht unterstützt.
es: El analizador no admite el diagnóstico notificado con identificador '{0}'.
fr: Le diagnostic signalé avec l'ID '{0}' n'est pas pris en charge par l'analyseur.
it: La diagnostica restituita con ID '{0}' non è supportata dall'analizzatore.
ja: ID '{0}' の報告済みの診断はアナライザーによってサポートされていません。
ko: ID가 '{0}'인 보고된 진단이 분석기에서 지원되지 않습니다.
pl: Zgłoszona diagnostyka z identyfikatorem „{0}” nie jest obsługiwana przez analizatora.
pt_br: O analisador não dá suporte ao diagnóstico relatado com ID '{0}'.
ru: Зарегистрированное диагностическое событие с идентификатором "{0}" не поддерживается в анализаторе.
tr: {0}' kimliği ile bildirilen tanılama, çözümleyici tarafından desteklenmiyor.
zh_hans: 分析器不支持 ID 为“{0}”的报告的诊断。
zh_hant: 分析器不支援識別碼為 '{0}' 的回報診斷。

# InvalidDiagnosticIdReported
source: Reported diagnostic has an ID '{0}', which is not a valid identifier.
cs: Hlášená diagnostika má ID {0}, které není platným identifikátorem.
de: Die gemeldete Diagnose weist die ID "{0}" auf, die kein gültiger Bezeichner ist.
es: El diagnóstico informado tiene un identificador '{0}', que no es válido.
fr: Le diagnostic signalé comporte l'ID '{0}', ce qui n'est pas un identificateur valide.
it: L'ID della diagnostica restituita è '{0}', che non è un identificatore valido.
ja: 報告された診断に有効な識別子ではない ID '{0}' があります。
ko: 보고된 진단의 ID가 '{0}'인데 유효한 식별자가 아닙니다.
pl: Zgłoszona diagnostyka ma identyfikator „{0}”, który nie jest prawidłowym identyfikatorem.
pt_br: O diagnóstico relatado contém uma ID "{0}", que não é um identificador válido.
ru: Зарегистрированное диагностическое событие имеет идентификатор "{0}", который не является допустимым.
tr: Bildirilen tanılama, geçerli bir tanıtıcı olmayan '{0}' kimliğine sahip.
zh_hans: 报告的诊断 ID“{0}”不是有效的标识符。
zh_hant: 回報的診斷具有 ID '{0}'，這不是有效的識別碼。

# InvalidDiagnosticLocationReported
source: Reported diagnostic '{0}' has a source location in file '{1}', which is not part of the compilation being analyzed.
cs: Zdroj vykazované diagnostiky {0} je umístěný v souboru {1}, který není součástí analyzované kompilace.
de: Die gemeldete Diagnose "{0}" weist einen Quellspeicherort in der Datei "{1}" auf, die nicht Teil der Kompilierung ist, die analysiert wird.
es: El diagnóstico notificado "{0}" tiene una ubicación de origen en el archivo "{1}", que no forma parte de la compilación que se está analizando.
fr: Le diagnostic signalé '{0}' a un emplacement source dans le fichier '{1}', qui ne fait pas partie de la compilation en cours d'analyse.
it: Il percorso di origine della diagnostica restituita '{0}' è incluso nel file '{1}', che non fa parte della compilazione da analizzare.
ja: 報告された診断 '{0}' のソースの場所がファイル '{1}' にありますが、これは、分析対象のコンパイルの一部ではありません。
ko: 보고된 진단 '{0}'의 소스 위치가 분석되는 컴파일의 일부가 아닌 '{1}' 파일에 있습니다.
pl: Lokalizacja źródłowa zgłoszonych danych diagnostycznych „{0}” znajduje się w pliku „{1}”, który nie jest częścią analizowanej kompilacji.
pt_br: O diagnóstico relatado '{0}' tem um local de origem no arquivo '{1}', que não faz parte da compilação sendo analisada.
ru: В отчете о диагностике "{0}" используется исходное расположение "{1}", которое не входит в анализируемую компиляцию.
tr: Raporlanan '{0}' tanılamasının kaynak konumu, çözümlenen derlemenin bir parçası olmayan '{1}' dosyası içinde.
zh_hans: 报告的诊断“{0}”的源位置位于文件“{1}”中，后者不是要分析的编译的一部分。
zh_hant: 回報的診斷 '{0}' 在檔案 '{1}' 中具有來源位置，其不屬於正在進行分析的編譯。

source: The type '{0}' is not understood by the serialization binder.
de: Der Typ "{0}" wird vom Serialisierungsbinder nicht verstanden.
fr: Le type '{0}' n'est pas pris en charge par le binder de sérialisation.
it: Il tipo '{0}' non è riconosciuto dal binder di serializzazioni.
ja: 型 '{0}' がシリアル化バインダーで認識されません。
ko: 직렬화 바인더가 '{0}' 형식을 인식할 수 없습니다.
pl: Typ „{0}” nie jest zrozumiały dla integratora serializacji.
pt_br: O tipo '{0}' não é compreendido pelo associador de serialização.
tr: {0}' türü, serileştirme bağlayıcısı tarafından anlaşılamıyor.

source: Cannot deserialize type '{0}'.
de: Typ "{0}" kann nicht deserialisiert werden.
fr: Impossible de désérialiser le type '{0}'.
it: Non è possibile deserializzare il tipo '{0}'.
ja: 型 '{0}' を逆シリアル化できません。
ko: '{0}' 형식을 역직렬화할 수 없습니다.
pl: Nie można deserializować typu „{0}”.
pt_br: Não é possível desserializar o tipo '{0}'.
tr: {0}' türü seri durumdan çıkarılamıyor.

source: Cannot serialize type '{0}'.
de: Typ "{0}" kann nicht serialisiert werden.
fr: Impossible de sérialiser le type '{0}'.
it: Non è possibile serializzare il tipo '{0}'.
ja: 型 '{0}' をシリアル化できません。
ko: '{0}' 형식을 직렬화할 수 없습니다.
pl: Nie można serializować typu „{0}”.
pt_br: Não é possível serializar o tipo '{0}'.
tr: {0}' türü seri hale getirilemiyor.

# InvalidNodeToTrack
source: Node to track is not a descendant of the root.
cs: Uzel určený ke sledování není potomkem kořene.
de: Der aufzuzeichnende Knoten ist kein untergeordnetes Element des Stamms.
es: El nodo que se debe seguir no es descendiente de la raíz.
fr: Le nœud à suivre n’est pas un descendant de la racine.
it: Il nodo da tracciare non è un discendente della radice.
ja: 追跡するノードは、ルートの子孫ではありません。
ko: 추적할 노드가 루트의 하위 항목이 아닙니다.
pl: Węzeł do śledzenia nie jest elementem podrzędnym elementu głównego.
pt_br: O nó a ser rastreado não é um descendente da raiz.
ru: Отслеживаемый узел не является потомком корня.
tr: İzlenecek düğüm, kökün alt öğesi değil.
zh_hans: 要跟踪的节点不是根的后代。
zh_hant: 要追蹤的節點不是根的子代。

# NodeOrTokenOutOfSequence
source: A node or token is out of sequence.
cs: Uzel nebo token je mimo sekvenci.
de: Falsche Reihenfolge für Knoten oder Token.
es: Un nodo o token están fuera de la secuencia.
fr: Un nœud ou jeton est hors séquence.
it: Un nodo o token è fuori sequenza.
ja: ノードまたはトークンの順序が正しくありません。
ko: 노드 또는 토큰이 순서를 벗어났습니다.
pl: Węzeł lub token jest poza sekwencją.
pt_br: Um nó ou token está fora de sequência.
ru: Узел или токен находится за пределами последовательности.
tr: Bir düğüm veya belirteç sıranın dışında.
zh_hans: 某个节点或标记的顺序不正确。
zh_hant: 節點或語彙基元超出序列。

# UnexpectedTypeOfNodeInList
source: A node in the list is not of the expected type.
cs: Uzel v seznamu není očekávaného typu.
de: Ein Knoten in der Liste weist nicht den erwarteten Typ auf.
es: Un nodo de la lista no es del tipo esperado.
fr: Un nœud de la liste n’a pas le type attendu.
it: Un nodo nell'elenco non è del tipo previsto.
ja: リスト内のノードが、予期された型ではありません。
ko: 목록의 노드가 필요한 형식이 아닙니다.
pl: Węzeł na liście nie ma oczekiwanego typu.
pt_br: Um nó na lista não pertence ao tipo esperado.
ru: Непредусмотренный тип узла в списке.
tr: Listedeki düğümlerden biri beklenen türde değil.
zh_hans: 列表中的某个节点不是预期的类型。
zh_hant: 清單中的節點並非預期的類型。

# MissingListItem
source: The item specified is not the element of a list.
cs: Zadaná položka není elementem seznamu.
de: Das angegebene Element ist kein Element einer Liste.
es: El elemento especificado no es elemento de una lista.
fr: L’élément spécifié n’est pas l’élément d’une liste.
it: L'elemento specificato non è l'elemento di un elenco.
ja: 指定した項目は、リストの要素ではありません。
ko: 지정한 항목은 목록의 요소가 아닙니다.
pl: Określony element nie jest elementem listy.
pt_br: O item especificado não é elemento de uma lista.
ru: Указанный элемент не является элементом списка.
tr: Belirtilen öğe, bir liste öğesi değil.
zh_hans: 指定的项不是列表的元素。
zh_hant: 指定的項目不是清單中的元素。

source: Invalid public key.
cs: Neplatný veřejný klíč
de: Ungültiger, öffentlicher Schlüssel.
es: Clave pública no válida.
fr: La clé publique n'est pas valide.
it: Chiave pubblica non valida.
ja: 公開キーが無効です。
ko: 공개 키가 잘못되었습니다.
pl: Nieprawidłowy klucz publiczny.
pt_br: Chave pública inválida.
ru: Недопустимый открытый ключ.
tr: Geçersiz genel anahtar.
zh_hans: 公钥无效
zh_hant: 公開金鑰無效。

source: Invalid public key token.
cs: Neplatný token veřejného klíče
de: Ungültiges Token für den öffentlichen Schlüssel
es: Token de clave pública no válido.
fr: Le jeton de clé publique n'est pas valide.
it: Token di chiave pubblica non valido.
ja: 公開キーのトークンが無効です。
ko: 공개 키 토큰이 잘못되었습니다.
pl: Nieprawidłowy token klucza publicznego.
pt_br: Token de chave pública inválida.
ru: Недопустимый токен открытого ключа.
tr: Geçersiz genel anahtar belirteci
zh_hans: 公钥标记无效。
zh_hant: 公開金鑰語彙基元無效。
