Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# StreamMustSupportReadAndSeek
source: Stream must support read and seek operations.
cs: Stream musí podporovat operace read a seek.
de: Stream muss Lese- und Suchvorgänge unterstützen.
es: La secuencia debe admitir las operaciones de lectura y búsqueda.
fr: Le flux doit prendre en charge les opérations de lecture et de recherche.
it: Il flusso deve supportare operazioni di lettura e ricerca.
ja: ストリームは、読み取りとシーク操作をサポートする必要があります。
ko: 스트림은 읽기 및 찾기 작업을 지원해야 합니다.
pl: Strumień musi obsługiwać operacje odczytu i wyszukiwania.
pt_br: O fluxo deve fornecer suporte a operações de leitura e busca.
ru: Поток должен поддерживать операции чтения и поиска.
tr: Akış okuma ve arama işlemlerini desteklemelidir.
zh_hans: 流必须支持读取和搜寻操作。
zh_hant: 資料流必須支援讀取及搜尋作業。

# StreamMustSupportRead
source: Stream must be readable.
cs: Stream musí být čitelný.
de: Der Datenstrom muss lesbar sein.
es: La secuencia debe ser legible.
fr: Le flux doit être lisible.
it: Il flusso deve essere leggibile.
ja: ストリームは読み取り可能でなければなりません。
ko: 스트림을 읽을 수 있어야 합니다.
pl: Strumień musi być możliwy do odczytania.
pt_br: O fluxo deve ser legível.
ru: Поток должен быть читаем.
tr: Akış okunabilir olmalıdır.
zh_hans: 流必须为可读。
zh_hant: 資料流必須可讀取。

# StreamMustSupportWrite
source: Stream must be writable.
cs: Datový proud musí být zapisovatelný.
de: Der Stream muss schreibbar sein.
es: La secuencia se debe poder escribir.
fr: Le flux doit être accessible en écriture.
it: Il flusso deve essere scrivibile.
ja: ストリームは書き込み可能でなければなりません。
ko: 스트림이 쓰기 가능해야 합니다.
pl: Strumień musi być zapisywalny.
pt_br: O fluxo deve ser gravável.
ru: Поток должен быть доступен для записи.
tr: Akış yazılabilir olmalıdır.
zh_hans: 流必须是可写的。
zh_hant: 必須可寫入資料流。

# PdbStreamUnexpectedWhenEmbedding
source: PDB stream should not be given when embedding PDB into the PE stream.
cs: Při vkládání PDB do streamu PE by neměl být zadaný stream PDB.
de: Der PDB-Datenstrom sollte nicht angegeben werden, wenn PDB in den PE-Datenstrom eingebettet wird.
es: No se debería dar una secuencia de PDB al incrustar el PDB en la secuencia de PE.
fr: Le flux PDB ne doit pas être fourni quand le format PDB est incorporé dans le flux PE.
it: È consigliabile non specificare il flusso PDB quando si incorpora PDB nel flusso PE.
ja: PDB を PE ストリームに埋め込むとき、PDB ストリームを使ってはなりません。
ko: PDB를 PE 스트림에 포함할 경우 PDB 스트림을 지정하면 안 됩니다.
pl: Nie należy podawać strumienia PDB podczas wbudowywania pliku PDB w strumieniu PE.
pt_br: O fluxo de PDB não deve ser fornecido ao inserir PDB no fluxo PE.
ru: Поток PDB не должен предоставляться при внедрении PDB в поток PE.
tr: PDB, PE akışına eklenirken PDB akışı verilmemelidir.
zh_hans: 将 PE 流嵌入 PDB 时，无法提供 PDB 流。
zh_hant: 將 PDB 內嵌 PE 資料流中時，不應提供 PDB 資料流。

# PdbStreamUnexpectedWhenEmittingMetadataOnly
source: PDB stream should not be given when emitting metadata only.
cs: Když se generují jenom metadata, neměl by se zadávat stream PDB.
de: PDB-Stream sollte nicht ausgegeben werden, wenn nur die Ausgabe von Metadaten erfolgt.
es: No se debería dar una secuencia de PE al emitir solo metadatos.
fr: Le flux PDB ne doit pas être transmis durant l'émission de métadonnées uniquement.
it: È consigliabile non specificare il flusso PDB quando si creano solo metadati.
ja: メタデータのみを生成している場合、PDB ストリームは指定しないでください。
ko: 메타데이터만 내보낼 때 PDB 스트림을 지정해서는 안 됩니다.
pl: Strumień PDB nie powinien być podawany podczas emitowania samych metadanych.
pt_br: O fluxo de PDB não deve ser fornecido ao emitir somente metadados.
ru: Не следует задавать поток PDB, если выводятся только метаданные.
tr: Yalnızca meta veriler yayınlanırken, PDB akışı sağlanmamalıdır.
zh_hans: 仅发出元数据时不应提供 PDB 流。
zh_hant: 只有在發出中繼資料時，才無須指定 PDB 資料流。

# MetadataPeStreamUnexpectedWhenEmittingMetadataOnly
source: Metadata PE stream should not be given when emitting metadata only.
cs: Když se generují jenom metadata, neměl by zadávat stream PE metadat.
de: Metadaten-PE-Stream sollte nicht ausgegeben werden, wenn nur die Ausgabe von Metadaten erfolgt.
es: No se debería dar una secuencia de PE de metadatos al emitir solo metadatos.
fr: Le flux PE de métadonnées ne doit pas être transmis durant l'émission de métadonnées uniquement.
it: È consigliabile non specificare il flusso PE dei metadati quando si creano solo metadati.
ja: メタデータのみを生成している場合、メタデータ PE ストリームは指定しないでください。
ko: 메타데이터만 내보낼 때 메타데이터 PE 스트림을 지정해서는 안 됩니다.
pl: Strumień PE metadanych nie powinien być podawany podczas emitowania samych metadanych.
pt_br: O fluxo PE de metadados não deve ser fornecido ao emitir somente metadados.
ru: Не следует задавать поток PE метаданных, если выводятся только метаданные.
tr: Yalnızca meta veriler yayınlanırken, meta veri PE akışı sağlanmamalıdır.
zh_hans: 仅发出元数据时不应提供元数据 PE 流。
zh_hant: 只有在發出中繼資料時，才無須指定中繼資料 PE 資料流。

# IncludingPrivateMembersUnexpectedWhenEmittingToMetadataPeStream
source: Including private members should not be used when emitting to the secondary assembly output.
cs: Při generování do sekundárního výstupu sestavení by se neměly zahrnovat privátní členy.
de: Private Members sollten beim Ausgeben an die sekundäre Assemblyausgabe nicht einbezogen werden.
es: No se debe usar la inclusión de números privados al emitir a la salida del ensamblado secundario.
fr: Les membres privés ne doivent pas être inclus durant l'émission vers la sortie de l'assembly secondaire.
it: È consigliabile non usare membri privati di inclusione quando si crea l'output secondario dell'assembly.
ja: セカンダリ アセンブリ出力に対して生成している場合、プライベート メンバーのインクルードは使用しないでください。
ko: 보조 어셈블리 출력으로 내보낼 때 프라이빗 멤버를 포함해서는 안 됩니다.
pl: Uwzględnianie prywatnych składowych nie powinno być używane podczas emitowania danych wyjściowych pomocniczego zestawu.
pt_br: A inclusão de membros privados não deve ser usada ao emitir para a saída do assembly secundário.
ru: Включение частных членов не следует использовать при выводе в выходные данные вторичной сборки.
tr: İkincil bütünleştirilmiş kod çıktısına yayın yapılırken özel üyeleri ekleme özelliği kullanılmamalıdır.
zh_hans: 发出到辅助程序集输出时不应包含私有成员。
zh_hant: 發出至次要組件輸出時，應使用包含私人成員。

# MustIncludePrivateMembersUnlessRefAssembly
source: Must include private members unless emitting a ref assembly.
de: Muss private Member enthalten, sofern keine Referenzassembly ausgegeben wird.
fr: Doit inclure des membres privés sauf si émet un assembly de référence.
it: Deve includere membri privati a meno che non si stia creando un assembly di riferimento.
ja: 参照アセンブリを出力しない限り、プライベート メンバーを含める必要があります。
ko: 참조 어셈블리를 내보내지 않는 경우 프라이빗 멤버를 포함해야 합니다.
pl: Musi zawierać prywatne składowe, chyba że emituje zestaw odwołania.
pt_br: Deve incluir membros privados a menos que esteja emitindo um assembly de referência.
tr: Bir başvuru bütünleştirilmiş kodu yayınlamıyorsa özel üyeler içermelidir.

# EmbeddingPdbUnexpectedWhenEmittingMetadata
source: Embedding PDB is not allowed when emitting metadata.
cs: Při generování metadat se vkládání PDB nepovoluje.
de: Einbetten von PDB ist beim Ausgeben von Metadaten nicht zulässig.
es: No se permite insertar PDB al emitir metadatos.
fr: L'incorporation d'un fichier PDB n'est pas autorisée quand des métadonnées sont émises.
it: L'incorporamento di PDB non è consentito quando si creano metadati.
ja: メタデータを生成している場合、PDB を埋め込むことは許可されていません。
ko: 메타데이터를 내보낼 때 PDB를 포함할 수 없습니다.
pl: Osadzanie pliku PDB nie jest dozwolone podczas emitowania metadanych.
pt_br: Não é permitido inserir PDB ao emitir metadados.
ru: Внедрение PDB запрещено при выводе метаданных.
tr: Meta veriler yayınlanırken PDB eklemeye izin verilmez.
zh_hans: 不允许在发出元数据时嵌入 PDB。
zh_hant: 發出中繼資料時，不得內嵌 PDB。

source: Cannot target net module when emitting ref assembly.
cs: Když se generuje referenční sestavení, nejde cílit na síťový modul.
de: Verweisen auf Netzmodul beim Ausgeben der Referenzassembly nicht möglich.
es: El destino no puede ser el módulo al emitir el ensamblado de referencia.
fr: Impossible de cibler le module net quand un assembly de référence est émis.
it: Non è possibile impostare come destinazione il modulo quando si crea l'assembly di riferimento.
ja: 参照アセンブリを生成している場合、ネット モジュールをターゲットにすることはできません。
ko: 참조 어셈블리를 내보낼 때 NET 모듈을 대상으로 지정할 수 없습니다.
pl: Nie można ustawić modułu sieciowego jako docelowego podczas emitowania zestawu odwołania.
pt_br: Não é possível destinar o módulo de rede ao emitir o assembly de referência.
ru: Не удается нацелиться на сетевой модуль при выводе базовой сборки.
tr: Başvuru bütünleştirilmiş kodu yayınlanırken net modülü hedeflenemez.
zh_hans: 无法在发出引用程序集时将 Net 模块作为目标。
zh_hant: 發出參考組件時，目標不可以是網路模組。

source: Invalid hash.
cs: Neplatná hodnota hash
de: Ungültiger Hash.
es: Hash no válido.
fr: Hachage non valide.
it: Hash non valido.
ja: 無効なハッシュです。
ko: 잘못된 해시입니다.
pl: Nieprawidłowy skrót.
pt_br: Hash inválido.
ru: Недопустимый хэш.
tr: Geçersiz karma değer.
zh_hans: 哈希无效。
zh_hant: 雜湊無效。

source: Unsupported hash algorithm.
cs: Nepodporovaný algoritmus hash
de: Nicht unterstützter Hashalgorithmus.
es: Algoritmo del hash no admitido.
fr: Algorithme de hachage non pris en charge.
it: L'algoritmo hash non è supportato.
ja: サポートされていないハッシュ アルゴリズムです。
ko: 지원되지 않는 해시 알고리즘입니다.
pl: Nieobsługiwany algorytm wyznaczania wartości skrótu.
pt_br: Algoritmo de hash sem suporte.
ru: Неподдерживаемый хэш-алгоритм.
tr: Desteklenmeyen karma değer algoritması.
zh_hans: 不支持的哈希算法。
zh_hant: 不支援的雜湊演算法。

source: Inconsistent language versions
cs: Nekonzistentní jazykové verze
de: Inkonsistente Sprachversionen
es: Versiones de idioma incoherentes
fr: Versions de langage incohérentes
it: Versioni incoerenti del linguaggio
ja: 一貫性のない言語バージョン
ko: 일치하지 않는 언어 버전
pl: Niezgodne wersje językowe
pt_br: Versões de idioma inconsistentes
ru: Несогласованные языковые версии
tr: Tutarsız dil sürümleri
zh_hans: 不一致的语言版本
zh_hant: 不一致的語言版本

# CoffResourceInvalidRelocation
source: Win32 resources, assumed to be in COFF object format, have one or more invalid relocation header values.
cs: Prostředky Win32, u kterých se předpokládá, že jsou ve formátu objektů COFF, mají nejmíň jednu neplatnou hodnotu hlavičky přemístění.
de: Win32-Ressourcen, bei denen angenommen wird, dass sie im COFF-Objektformat vorhanden sind, weisen einen oder mehrere gültige Umzugskopfzeilenwerte auf.
es: Los recursos de Win32, que se presupone que están en el formato de objeto COFF, tienen uno o varios valores de encabezado de reubicación no válidos.
fr: Les ressources Win32, censées être au format d'objet COFF, ont une ou plusieurs valeurs d'en-tête de réadressage non valides.
it: Le risorse Win32, che dovrebbero essere nel formato oggetto COFF, hanno uno o più valori di intestazione di rilocazione non validi.
ja: Win32 リソースは、COFF オブジェクト形式であると見なされますが、1 つ以上の再配置ヘッダー値が無効です。
ko: COFF 개체 형식으로 간주되는 Win32 리소스에 잘못된 재배치 헤더 값이 둘 이상 있습니다.
pl: Zasoby Win32, w przypadku których zakłada się, że format obiektu to COFF, mają co najmniej jedną nieprawidłową wartość nagłówka relokacji.
pt_br: Recursos do Win32, supostos como estando no formato de objeto COFF, têm um ou mais valores de cabeçalho de realocação inválidos.
ru: Ресурсы Win32, для которых предполагается использование формата объекта COFF, имеют одно или несколько недопустимых значений заголовка перемещения.
tr: COFF nesnesi biçiminde olduğu varsayılan Win32 kaynakları, bir veya daha fazla geçersiz konum değiştirme üst bilgi değerine sahiptir.
zh_hans: Win32 资源，假定为 COFF 对象格式，具有一个或多个无效的重定位标头值。
zh_hant: Win32 資源 (假設為 COFF 物件格式) 包含一或多個無效的重新配置標頭值。

# CoffResourceInvalidSectionSize
source: Win32 resources, assumed to be in COFF object format, have an invalid section size.
cs: Prostředky Win32, u kterých se předpokládá, že jsou ve formátu objektů COFF, mají neplatnou velikost sekce.
de: Win32-Ressourcen, bei denen angenommen wird, dass sie im COFF-Objektformat vorhanden sind, weisen eine ungültige Abschnittsgröße auf.
es: Los recursos de Win32, que se presupone que están en el formato de objeto COFF, tienen un tamaño de sección no válido.
fr: Les ressources Win32, censées être au format d'objet COFF, ont une taille de section non valide.
it: Le risorse Win32, che dovrebbero essere nel formato oggetto COFF, hanno una dimensione di sezione non valida.
ja: Win32 リソースは、COFF オブジェクト形式であると見なされますが、セクション サイズが無効です。
ko: COFF 개체 형식으로 간주되는 Win32 리소스에 잘못된 섹션 크기가 있습니다.
pl: Zasoby Win32, w przypadku których zakłada się, że format obiektu to COFF, mają nieprawidłowy rozmiar sekcji.
pt_br: Recursos do Win32, supostos como estando no formato de objeto COFF, têm um tamanho de seção inválido.
ru: Ресурсы Win32, для которых предполагается использование формата объекта COFF, имеют недопустимый размер раздела.
tr: COFF nesnesi biçiminde olduğu varsayılan Win32 kaynakları geçersiz bölüm boyutuna sahiptir.
zh_hans: Win32 资源，假定为 COFF 对象格式，具有一个无效的节大小。
zh_hant: Win32 資源 (假設為 COFF 物件格式) 包含無效的區段大小。

# CoffResourceInvalidSymbol
source: Win32 resources, assumed to be in COFF object format, have one or more invalid symbol values.
cs: Prostředky Win32, u kterých se předpokládá, že jsou ve formátu objektů COFF, mají nejmíň jednu neplatnou hodnotu symbolu.
de: Win32-Ressourcen, bei denen angenommen wird, dass sie im COFF-Objektformat vorhanden sind, weisen einen oder mehrere ungültige Symbolwerte auf.
es: Los recursos de Win32, que se presupone que están en el formato de objeto COFF, tienen uno o varios valores de símbolo no válidos,
fr: Les ressources Win32, censées être au format d'objet COFF, ont une ou plusieurs valeurs de symbole non valides.
it: Le risorse Win32, che dovrebbero essere nel formato oggetto COFF, hanno uno o più valori di simbolo non validi.
ja: Win32 リソースは、COFF オブジェクト形式であると見なされますが、1 つ以上のシンボル値が無効です。
ko: COFF 개체 형식으로 간주되는 Win32 리소스에 잘못된 기호 값이 둘 이상 있습니다.
pl: Zasoby Win32, w przypadku których zakłada się, że format obiektu to COFF, mają co najmniej jedną nieprawidłową wartość symbolu.
pt_br: Recursos do Win32, supostos como estando no formato de objeto COFF, têm um ou mais valores de símbolo inválidos.
ru: Ресурсы Win32, для которых предполагается использование формата объекта COFF, имеют одно или несколько недопустимых значений символа.
tr: COFF nesnesi biçiminde olduğu varsayılan Win32 kaynakları, bir veya daha fazla geçersiz sembol değerine sahiptir.
zh_hans: Win32 资源，假定为 COFF 对象格式，具有一个或多个无效的符号值。
zh_hant: Win32 資源 (假設為 COFF 物件格式) 包含一或多個無效的符號值。

# CoffResourceMissingSection
source: Win32 resources, assumed to be in COFF object format, are missing one or both of sections '.rsrc$01' and '.rsrc$02'
cs: U prostředků Win32, u kterých se předpokládá, že jsou ve formátu objektů COFF, chybí nejmíň jedna ze sekcí .rsrc$01 a .rsrc$02.
de: Bei Win32-Ressourcen, bei denen angenommen wird, dass sie im COFF-Objektformat vorhanden sind, fehlen ein oder beide Abschnitte der Dateien '.rsrc$01' und '.rsrc$02'
es: Los recursos de Win32, que se presupone que están en el formato de objeto COFF, carecen de una o las dos secciones '.rsrc$01' y '.rsrc$02'
fr: Les ressources Win32, censées être au format d'objet COFF, ne possèdent pas l'une des sections '.rsrc$01' ou '.rsrc$02' ou les deux
it: Nelle risorse Win32, che dovrebbero essere nel formato oggetto COFF, mancano una o entrambe le sezioni '.rsrc$01' e '.rsrc$02'
ja: Win32 リソースは、COFF オブジェクト形式であると見なされますが、セクションの '.rsrc$01' と '.rsrc$02' のいずれかまたは両方がありません
ko: COFF 형식으로 간주되는 Win32 리소스에 '.rsrc$01' 및 '.rsrc$02' 섹션이 하나 또는 둘 다 없습니다.
pl: Zasoby Win32, w przypadku których zakłada się, że format obiektu to COFF, nie zawierają jednej sekcji „rsrc$01” lub „rsrc$02” albo obu tych sekcji.
pt_br: Recursos do Win32, supostos como estando no formato de objeto COFF, estão sem uma ou ambas as seções '.rsrc$ 01' e '.rsrc$ 02'
ru: В ресурсах Win32, для которых предполагается использование формата объекта COFF, отсутствует один или оба раздела (".rsrc$01" и ".rsrc$02").
tr: COFF nesnesi biçiminde olduğu varsayılan Win32 kaynaklarında '.rsrc$01' ve '.rsrc$02' bölümlerinden biri veya her ikisi eksik
zh_hans: Win32 资源，假定为 COFF 对象格式，缺少其中一个或全部两个节:“.rsrc$01” 和“.rsrc$02”
zh_hant: Win32 資源 (假設為 COFF 物件格式) 遺漏 '.rsrc$01' 及 (或) '.rsrc$02' 區段之一，或同時缺少兩者。

# IconStreamUnexpectedFormat
source: Icon stream is not in the expected format.
cs: Stream ikon není v očekávaném formátu.
de: Symbol-Stream weist nicht das erwartete Format auf.
es: La secuencia de iconos no está en el formato esperado.
fr: Le flux Icon n'est pas au format attendu.
it: Il formato del flusso dell'icona non è corretto.
ja: アイコン ストリームの形式が正しくありません。
ko: 아이콘 스트림이 필요한 형식이 아닙니다.
pl: Strumień ikony nie ma oczekiwanego formatu.
pt_br: O fluxo de ícones não está no formato esperado.
ru: Формат потока значков отличается от ожидаемого.
tr: Simge akışı beklenen biçimde değil.
zh_hans: 图标流不是预期格式。
zh_hant: 圖示資料流的格式不正確。

# InvalidCultureName
source: Invalid culture name: '{0}'
cs: Neplatný název jazykové verze: {0}
de: Ungültiger Kulturname: '{0}'
es: Nombre de referencia cultural no válido: '{0}'
fr: Nom de culture non valide : '{0}'
it: Il nome delle impostazioni cultura '{0}' non è valido
ja: 無効なカルチャ名: '{0}'
ko: 잘못된 문화권 이름입니다('{0}').
pl: Nieprawidłowa nazwa kultury: „{0}”
pt_br: Nome de cultura inválido: "{0}"
ru: Недопустимое название языка и региональных параметров: "{0}"
tr: Geçersiz kültür adı: '{0}'
zh_hans: 无效的区域性名称:“{0}”
zh_hant: 文化特性名稱無效: '{0}'

# WRN_InvalidGlobalSectionName
source: Global analyzer config section name '{0}' is invalid as it is not an absolute path. Section will be ignored. Section was declared in file: '{1}'
cs: Název oddílu konfigurace globálního analyzátoru {0} není platný, protože to není absolutní cesta. Oddíl se bude ignorovat. Deklaroval se v souboru: {1}
es: El nombre de la sección de configuración "{0}" del analizador global no es válido porque no es una ruta de acceso absoluta. La sección se ignorará; esta se declaró en el archivo "{1}"
it: Il nome della sezione '{0}' di configurazione dell'analizzatore globale non è valido perché non è un percorso assoluto. La sezione verrà ignorata. La sezione è stata dichiarata nel file: '{1}'
ja: グローバル アナライザー構成セクション名 '{0}' は、絶対パスではないため無効です。セクションは無視されます。セクションはファイル '{1}' で宣言されました。
ko: 전역 분석기 구성 섹션 이름 '{0}'이(가) 절대 경로가 아니므로 잘못되었습니다. 섹션이 무시됩니다. 파일 '{1}'에 섹션이 선언되었습니다.
ru: Имя раздела конфигурации глобального анализатора "{0}" недопустимо, так как не является абсолютным путем. Раздел будет проигнорирован. Раздел объявлен в файле: "{1}".
zh_hans: 全局分析器配置部分名称“{0}”无效，因为它不是绝对路径。部分将被忽略。部分已在以下文件中声明:“{1}”。
zh_hant: 因為全域分析器組態區段名稱 '{0}' 不是絕對路徑，所以無效。將忽略區段。區段已在以下檔案中宣告: '{1}'

# WRN_InvalidGlobalSectionName_Title
source: Global analyzer config section name is invalid as it is not an absolute path. Section will be ignored.
cs: Název oddílu konfigurace globálního analyzátoru není platný, protože to není absolutní cesta. Oddíl se bude ignorovat
es: El nombre de la sección de configuración del analizador global no es válido porque no es una ruta de acceso absoluta. La sección se ignorará.
it: Il nome della sezione di configurazione dell'analizzatore globale non è valido perché non è un percorso assoluto. La sezione verrà ignorata.
ja: グローバル アナライザー構成セクション名は、絶対パスではないため無効です。セクションは無視されます。
ko: 전역 분석기 구성 섹션 이름이 절대 경로가 아니므로 잘못되었습니다. 섹션이 무시됩니다.
ru: Имя раздела конфигурации глобального анализатора недопустимо, так как не является абсолютным путем. Раздел будет проигнорирован.
zh_hans: 全局分析器配置部分名称无效，因为它不是绝对路径。部分将被忽略。
zh_hant: 因為全域分析器組態區段名稱不是絕對路徑，所以無效。將忽略區段。

# WRN_InvalidSeverityInAnalyzerConfig
source: The diagnostic '{0}' was given an invalid severity '{1}' in the analyzer config file at '{2}'.
cs: Při diagnostice {0} byla v konfiguračním souboru analyzátoru v {2} předána neplatná závažnost {1}.
de: Der Diagnose "{0}" wurde ein ungültiger Schweregrad "{1}" in der Konfigurationsdatei des Analysetools unter "{2}" zugewiesen.
es: Se proporcionó al diagnóstico "{0}" una gravedad no válida "{1}" en el archivo de configuración del analizador en "{2}".
fr: Le diagnostic '{0}' a reçu un niveau de gravité non valide '{1}' dans le fichier config de l'analyseur sur '{2}'.
it: Alla diagnostica ' {0}' è stato assegnato un livello di gravità non valido '{1}' nel file di configurazione dell'analizzatore alla posizione '{2}'.
ja: アナライザー構成ファイルの '{2}' で、診断 '{0}' に無効な重要度 '{1}' が指定されました。
ko: '{2}'의 분석기 구성 파일에 있는 진단 '{0}'에 잘못된 심각도 '{1}'이(가) 지정되었습니다.
pl: Dla elementu diagnostyki „{0}” określono nieprawidłową ważność „{1}” w pliku konfiguracji analizatora — „{2}”.
pt_br: O diagnóstico '{0}' recebeu uma gravidade inválida '{1}' no arquivo de configuração do analisador em '{2}'.
ru: Для диагностики "{0}" указана недопустимая серьезность "{1}" в файле конфигурации анализатора в "{2}".
tr: '{0}' tanılamasına '{2}' konumundaki çözümleyici yapılandırma dosyasında geçersiz bir önem derecesi ('{1}') verildi.
zh_hans: 在 "{2}" 的分析器配置文件中为诊断 "{0}" 给定了无效的严重性 "{1}"。
zh_hant: 在分析器組態檔的 '{2}' 處，為診斷 '{0}' 提供了無效的嚴重性 '{1}'。

# WRN_InvalidSeverityInAnalyzerConfig_Title
source: Invalid severity in analyzer config file.
cs: Neplatná závažnost v konfiguračním souboru analyzátoru
de: Ungültiger Schweregrad in der Konfigurationsdatei des Analysetools.
es: Gravedad no válida en el archivo de configuración del analizador.
fr: Niveau de gravité non valide dans le fichier config de l'analyseur.
it: Gravità non valida nel file di configurazione dell'analizzatore.
ja: アナライザー構成ファイルの重大度が無効です。
ko: 분석기 구성 파일의 심각도가 잘못되었습니다.
pl: Nieprawidłowa ważność w pliku konfiguracji analizatora.
pt_br: Gravidade inválida no arquivo de configuração do analisador.
ru: Недопустимая серьезность в файле конфигурации анализатора.
tr: Çözümleyici yapılandırma dosyasında geçersiz önem derecesi.
zh_hans: 分析器配置文件中的严重性无效。
zh_hant: 分析器組態檔中的嚴重性無效。

# WRN_MultipleGlobalAnalyzerKeys
source: Multiple global analyzer config files set the same key '{0}' in section '{1}'. It has been unset. Key was set by the following files: '{2}'
cs: Několik konfiguračních souborů globálního analyzátoru nastavuje v části {1} stejný klíč {0}. Jeho nastavení se zrušilo. Klíč se nastavil v následujících souborech: {2}
es: Varios archivos de configuración de analizador global establecen la misma clave "{0}" en la sección "{1}". No se ha establecido. La clave se estableció con los siguientes archivos: "{2}"
fr: Plusieurs fichiers config d'analyseur global définissent la même clé '{0}' dans la section '{1}'. Elle a été annulée. La clé a été définie par les fichiers suivants : '{2}'
it: Più file di configurazione dell'analizzatore globale impostano la stessa chiave '{0}' nella sezione '{1}'. L'impostazione è stata annullata. La chiave è stata impostata dai file seguenti: '{2}'
ja: 複数のグローバル アナライザー構成ファイルで、セクション '{1}' に同じキー '{0}' が設定されています。設定は解除されました。キーは次のファイルによって設定されました: '{2}'
ko: 여러 전역 분석기 구성 파일이 섹션 '{1}'에 같은 키 '{0}'을(를) 설정했습니다. 해당 키 설정이 해제되었습니다. 키는 '{2}' 파일에 의해 설정되었습니다.
pl: Wiele plików konfiguracji analizatora globalnego ustawiło ten sam klucz „{0}” w sekcji „{1}”. To ustawienie zostało wycofane. Klucz został ustawiony przez następujące pliki: „{2}”
pt_br: Vários arquivos de configuração do analisador global definem a mesma chave '{0}' na seção '{1}'. Essa definição foi removida. A chave foi definida pelos seguintes arquivos: '{2}'
ru: В нескольких файлах конфигурации глобального анализатора установлен один и тот же ключ "{0}" в разделе "{1}". Установка этого ключа отменена. Ключ был установлен в следующих файлах: "{2}"
tr: Birden çok genel çözümleyici yapılandırma dosyası, '{1}' bölümünde aynı '{0}' anahtarını ayarladı. Ayar kaldırıldı. Anahtar şu dosyalar tarafından ayarlandı: '{2}'
zh_hans: 多个全局分析器配置文件在“{1}”部分中设置了相同的密钥“{0}”。它已取消设置。密钥由以下文件设置:“{2}”
zh_hant: 有多個全域分析器設定檔，在區段 '{1}' 中設定了相同的索引碼 '{0}'。該索引碼設定已取消。下列檔案中設定了索引碼: '{2}'
