Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidDataAtOffset
source: Invalid data at offset {0}: {1}{2}*{3}{4}
cs: Neplatná data na pozici {0}: {1}{2}*{3}{4}
de: Ungültige Daten bei Offset {0}: {1}{2}*{3}{4}
es: Datos no válidos en el desplazamiento {0}: {1}{2}*{3}{4}
fr: Données non valides au décalage {0} : {1}{2}*{3}{4}
it: Dati non validi in corrispondenza dell'offset {0}: {1}{2}*{3}{4}
ja: オフセット {0} にある無効なデータ: {1}{2}*{3}{4}
ko: {0} 오프셋의 잘못된 데이터: {1}{2}*{3}{4}
pl: Nieprawidłowe dane w przesunięciu {0}: {1}{2}*{3}{4}
pt_br: Dados inválidos no deslocamento {0}: {1}{2}*{3}{4}
ru: Недопустимые данные в смещении {0}: {1}{2}*{3}{4}
tr: {0} uzaklığında geçersiz veriler: {1}{2}*{3}{4}
zh_hans: 偏移量 {0} 处的数据无效: {1}{2}*{3}{4}
zh_hant: 位移 {0}: {1}{2}*{3}{4} 處的資料無效

# SymWriterNotDeterministic
source: Windows PDB writer doesn't support deterministic compilation: '{0}'
cs: Zapisovač Windows PDB nepodporuje deterministickou kompilaci: {0}.
de: Windows PDB Writer unterstützt keine deterministische Kompilierung. "{0}"
es: El escritor de PDB de Windows no admite la compilación determinista: "{0}"
fr: Le writer Windows PDB ne prend pas en charge la compilation déterministe : '{0}'
it: Il writer PDB di Windows non supporta la compilazione deterministica: '{0}'
ja: Windows PDB ライターは、決定論的コンパイルをサポートしていません: '{0}'
ko: Windows PDB 기록기는 결정적 컴파일을 지원하지 않습니다. '{0}'
pl: Składnik zapisywania plików PDB systemu Windows nie obsługuje kompilacji deterministycznej: „{0}”
pt_br: O gravador PDB do Windows não dá suporte à compilação determinística: '{0}'
ru: Модуль записи PDB в Windows не поддерживает детерминированную компиляцию: "{0}"
tr: Windows PDB yazıcısı, belirlenimci derlemeyi desteklemiyor: '{0}'
zh_hans: Windows PDB 编写器不支持确定性的编译:“{0}”
zh_hant: Windows PDB 寫入器不支援確定性編譯: '{0}'

# SymWriterOlderVersionThanRequired
source: The version of Windows PDB writer is older than required: '{0}'
cs: Verze zapisovače Windows PDB je starší, než se vyžaduje: {0}.
de: Die Version von Windows PDB Writer ist älter als die erforderliche Version: "{0}"
es: La versión del escritor de PDB de Windows no puede ser anterior a la requerida: "{0}"
fr: La version du writer Windows PDB est trop ancienne : '{0}'
it: La versione del writer PDB di Windows è meno recente di quella richiesta: '{0}'
ja: Windows PDB ライターのバージョンが、必要なバージョンより古いものです: '{0}'
ko: Windows PDB 기록기가 필요한 버전보다 이전 버전입니다. '{0}'
pl: Wersja składnika zapisywania plików PDB systemu Windows jest starsza niż wymagana: „{0}”
pt_br: A versão do gravador de PDB do Windows é mais antiga do que a necessária: '{0}'
ru: Версия модуля записи PDB Windows старше требуемой: "{0}"
tr: Windows PDB yazıcısının sürümü, gerekli olan '{0}' sürümünden eski
zh_hans: Windows PDB 编写器的版本早于要求的版本:“{0}”
zh_hant: Windows PDB 寫入器版本較所需的版本舊: '{0}'

# SymWriterDoesNotSupportSourceLink
source: Windows PDB writer doesn't support SourceLink feature: '{0}'
cs: Zapisovač Windows PDB nepodporuje funkci SourceLink: {0}.
de: Windows PDB Writer unterstützt keine SourceLink-Funktion: "{0}"
es: El escritor de PDB de Windows no admite la característica SourceLink: "{0}"
fr: Le writer Windows PDB ne prend pas en charge la fonctionnalité SourceLink : '{0}'
it: Il writer PDB di Windows non supporta la funzionalità SourceLink: '{0}'
ja: Windows PDB ライターは、SourceLink 機能をサポートしていません: '{0}'
ko: Windows PDB 기록기는 SourceLink 기능을 지원하지 않습니다. '{0}'
pl: Składnik zapisywania plików PDB systemu Windows nie obsługuje funkcji SourceLink: „{0}”
pt_br: O gravador de PDB do Windows não dá suporte à funcionalidade SourceLink: '{0}'
ru: Модуль записи PDB в Windows не поддерживает функцию SourceLink: "{0}"
tr: Windows PDB yazıcısı SourceLink özelliğini desteklemiyor: '{0}'
zh_hans: Windows PDB 编写器不支持 SourceLink 功能:“{0}”
zh_hant: Windows PDB 寫入器不支援 SourceLink 功能: '{0}'

# RuleSetBadAttributeValue
source: The attribute {0} has an invalid value of {1}.
cs: Atribut {0} má neplatnou hodnotu {1}.
de: Das Attribut "{0}" hat den ungültigen Wert "{1}".
es: El atributo {0} tiene un valor no válido de {1}.
fr: L'attribut {0} a une valeur {1} non valide.
it: Il valore {1} dell'attributo {0} non è valido.
ja: 属性 {0} に {1} の無効な値が含まれています。
ko: {0} 특성에 잘못된 {1} 값이 있습니다.
pl: Atrybut {0} ma nieprawidłową wartość {1}.
pt_br: O atributo {0} tem um valor inválido de {1}.
ru: Атрибут {0} имеет недопустимое значение {1}.
tr: {0} özniteliği {1} geçersiz değerine sahip.
zh_hans: 属性 {0} 具有无效值 {1}。
zh_hant: 屬性 {0} 有無效的 {1} 值。

# RuleSetMissingAttribute
source: The element {0} is missing an attribute named {1}.
cs: V elementu {0} chybí atribut s názvem {1}.
de: Dem Element "{0}" fehlt das Attribut mit dem Namen "{1}".
es: Falta el atributo llamado {1} del elemento {0}.
fr: Un attribut nommé {1} est manquant dans l'élément {0}.
it: Nell'elemento {0} manca un attributo denominato {1}.
ja: 要素 {0} に {1} という属性がありません。
ko: {0} 요소에 이름이 {1}인 특성이 없습니다.
pl: Element {0} nie ma atrybutu o nazwie {1}.
pt_br: O elemento {0} não tem um atributo chamado {1}.
ru: У элемента {0} отсутствует атрибут с именем {1}.
tr: {0} öğesinde {1} adlı öznitelik eksik.
zh_hans: 元素 {0} 缺少名为 {1} 的属性。
zh_hant: 項目 {0} 遺漏名稱為 {1} 的屬性。

# KeepAliveIsNotAnInteger
source: Argument to '/keepalive' option is not a 32-bit integer.
cs: Argument pro možnost /keepalive není 32bitové celé číslo.
de: Argument für "/keepalive"-Option ist keine 32-Bit-Ganzzahl.
es: El argumento para la opción "/keepalive" no es un entero de 32 bits.
fr: L'argument de l'option '/keepalive' n'est pas un entier 32 bits.
it: L'argomento dell'opzione '/keepalive' non è un intero a 32 bit.
ja: /keepalive' オプションへの引数は 32 ビットの整数ではありません。
ko: /keepalive' 옵션의 인수는 32비트 정수가 아닙니다.
pl: Argument opcji „/keepalive” nie jest 32-bitową liczbą całkowitą.
pt_br: O argumento para a opção '/keepalive' não é um número inteiro de 32 bits.
ru: Аргумент для параметра "/keepalive" не является 32-битным целым числом.
tr: /keepalive' seçeneğinin bağımsız değişkeni 32 bitlik bir tamsayı değil.
zh_hans: "/keepalive" 选项的参数不是一个 32 位整数。
zh_hant: /keepalive' 選項的引數並非 32 位元整數。

# KeepAliveIsTooSmall
source: Arguments to '/keepalive' option below -1 are invalid.
cs: Argumenty možnosti /keepalive nižší než -1 nejsou platné.
de: Argumente für "/keepalive"-Option kleiner als -1 sind ungültig.
es: Los argumentos para la opción "/keepalive" inferiores a -1 no son válidos.
fr: Les arguments de l'option '/keepalive' dont la valeur est inférieure à -1 ne sont pas valides.
it: Gli argomenti dell'opzione '/keepalive' il cui valore è inferiore a -1 non sono validi.
ja: -1 より小さい '/keepalive' オプションへの引数は無効です。
ko: -1 아래의 '/keepalive' 옵션에 대한 인수가 잘못되었습니다.
pl: Argumenty opcji „/keepalive” mniejsze niż -1 są nieprawidłowe.
pt_br: Os argumentos para a opção '/keepalive' abaixo de -1 são inválidos.
ru: Аргументы для параметра "/keepalive" со значением ниже –1 являются недопустимыми.
tr: /keepalive' seçeneğinin -1'den düşük bağımsız değişkenleri geçersiz.
zh_hans: 小于 -1 的 "/keepalive" 选项的参数无效。
zh_hant: /keepalive' 選項的引數若小於 -1 即為無效。

# KeepAliveWithoutShared
source: '/keepalive' option is only valid with '/shared' option.
cs: 'Možnost /keepalive je platná jenom s možností /shared.
de: 'Die "/keepalive"-Option ist nur zusammen mit der "/shared"-Option gültig.
es: 'La opción "/keepalive" solo es válida con la opción "/shared".
fr: 'L'option '/keepalive' est valide seulement avec l'option '/shared'.
it: 'L'opzione '/keepalive' è valida solo con l'opzione '/shared'.
ja: '/keepalive' オプションが有効になるのは、'/shared' オプションと一緒に使用する場合のみです。
ko: '/keepalive' 옵션은 '/shared' 옵션과 함께 사용되는 경우에만 유효합니다.
pl: 'Opcja „/keepalive” jest prawidłowa tylko z opcją „/shared”.
pt_br: 'A opção '/keepalive' só é válida com a opção '/shared'.
ru: 'Параметр "/keepalive" является допустимым только при использовании с параметром "/shared".
tr: '/keepalive' seçeneği yalnızca '/shared' seçeneği ile geçerlidir.
zh_hans: '"/keepalive" 选项仅在与 "/shared" 选项一起使用时有效。
zh_hant: '/keepalive' 選項只可與 '/shared' 選項並用。

# MismatchedVersion
source: Roslyn compiler server reports different protocol version than build task.
cs: Server kompilátoru Roslyn hlásí jinou verzi protokolu, než má úloha sestavení.
de: Roslyn-Compilerserver meldet unterschiedliche Protokollversion als in Erstellungsaufgabe.
es: El servidor del compilador Roslyn informa de una versión de protocolo distinta a la de la tarea de compilación.
fr: Le serveur du compilateur Roslyn signale une version du protocole différente de celle de la tâche de build.
it: Il server del compilatore Roslyn restituisce una versione del protocollo diversa da quella dell'attività di compilazione.
ja: Roslyn コンパイル サーバーは、ビルド タスクとは異なるバージョンのプロトコルを報告しています。
ko: Roslyn 컴파일러 서버가 빌드 작업과 다른 프로토콜 버전을 보고합니다.
pl: Wersja protokołu zgłaszana przez serwer kompilatora programu Roslyn jest inna niż wersja dla zadania kompilacji.
pt_br: O servidor de compilador Roslyn relata uma versão de protocolo diferente da tarefa de compilação.
ru: Сервер компиляции Roslyn сообщает о версии протокола, отличной от версии, которая указана в задаче сборки.
tr: Roslyn derleyici sunucusu derleme görevinden farklı protokol sürümü bildiriyor.
zh_hans: Roslyn 编译器服务器报告不同于生成任务的协议版本。
zh_hant: Roslyn 編譯器伺服器回報了不同於建置工作的通訊協定版本。

# MissingKeepAlive
source: Missing argument for '/keepalive' option.
cs: Chybí argument pro možnost /keepalive.
de: Fehlendes Argument für "/keepalive"-Option.
es: Falta el argumento de la opción "/keepalive".
fr: Argument manquant pour l'option '/keepalive'.
it: Manca l'argomento per l'opzione '/keepalive'.
ja: /keepalive' オプションの引数がありません。
ko: /keepalive' 옵션에 인수가 없습니다.
pl: Brak argumentu opcji „/keepalive”.
pt_br: Argumento ausente para a opção '/keepalive'.
ru: Отсутствует аргумент для параметра "/keepalive".
tr: /keepalive' seçeneği için bağımsız değişken eksik.
zh_hans: 缺少 "/keepalive" 选项的参数。
zh_hant: /keepalive' 選項遺漏引數。

# AnalyzerTotalExecutionTime
source: Total analyzer execution time: {0} seconds.
cs: Celková doba spuštění analyzátoru: {0} sekund
de: Gesamtausführungszeit des Analysetools: {0} Sekunden.
es: Tiempo total de ejecución del analizador: {0} segundos.
fr: Temps d'exécution total de l'analyseur : {0} secondes.
it: Tempo totale di esecuzione dell'analizzatore: {0} secondi.
ja: アナライザー実行の合計時間: {0} 秒。
ko: 총 분석기 실행 시간: {0}초.
pl: Łączny czas wykonywania analizatora: {0} sek.
pt_br: Tempo de execução total do analisador: {0} segundos.
ru: Общее время выполнения анализатора: {0} с.
tr: Çözümleyicinin toplam yürütme süresi: {0} saniye.
zh_hans: 分析器总执行时间: {0} 秒。
zh_hant: 分析器執行時間總計: {0} 秒。

# MultithreadedAnalyzerExecutionNote
source: NOTE: Elapsed time may be less than analyzer execution time because analyzers can run concurrently.
cs: POZNÁMKA: Uplynulý čas může být kratší než čas spuštění analyzátoru, protože analyzátory můžou běžet současně.
de: HINWEIS: Die verstrichene Zeit kann kürzer als die Ausführungszeit des Analysetools sein, da Analysetools parallel ausgeführt werden können.
es: NOTA: el tiempo transcurrido puede ser inferior al tiempo de ejecución del analizador, dado que los analizadores pueden ejecutarse simultáneamente.
fr: REMARQUE : le temps écoulé peut être inférieur à la durée d'exécution de l'analyseur, car des analyseurs peuvent s'exécuter simultanément.
it: NOTE: il tempo trascorso può essere inferiore al tempo di esecuzione dell'analizzatore perché non è possibile eseguire gli analizzatori simultaneamente.
ja: メモ: 複数のアナライザーが同時に実行される可能性があるので、経過時間はアナライザーの実行時間よりも短くなる場合があります。
ko: 참고: 여러 분석기가 동시에 실행될 수 있으므로 경과된 시간이 분석기 실행 시간보다 짧을 수 있습니다.
pl: UWAGA: Czas, który upłynął, może być krótszy niż czas wykonywania analizatora, ponieważ analizatory mogą działać współbieżnie.
pt_br: OBSERVAÇÃO: o tempo decorrido pode ser menor do que o tempo de execução do analisador porque analisadores podem ser executados simultaneamente.
ru: ПРИМЕЧАНИЕ. Затраченное время может быть меньше времени выполнения анализатора, так как анализаторы могут выполняться параллельно.
tr: NOT: Çözümleyiciler eşzamanlı olarak çalışabileceğinden, geçen süre çözümleyicinin yürütme süresinden daha az olabilir.
zh_hans: 注意: 运行时间可能小于分析器执行时间，因为分析器可以同时运行。
zh_hant: 注意: 因為分析器可以同時執行，所以已耗用時間可能小於分析器執行時間。

# AnalyzerExecutionTimeColumnHeader
source: Time (s)
cs: Doba (s)
de: Zeit (s)
es: Tiempo (s)
fr: Durée (s)
it: Tempo (s)
ja: 時間 (秒)
ko: 시간(초)
pl: Czas (s)
pt_br: Tempo (s)
ru: Время (с)
tr: Süre (sn)
zh_hans: 时间(秒)
zh_hant: 時間 (秒)

# AnalyzerNameColumnHeader
source: Analyzer
cs: Analyzátor
de: Analysetool
es: Analizador
fr: Analyseur
it: Analizzatore
ja: アナライザー
ko: 분석기
pl: Analizator
pt_br: Analisador
ru: Анализатор
tr: Çözümleyici
zh_hans: 分析器
zh_hant: 分析器

source: No analyzers found
cs: Nenašly se žádné analyzátory.
de: Es wurden keine Analysetools gefunden.
es: No se encontraron analizadores
fr: Aucun analyseur trouvé
it: Non sono stati trovati analizzatori
ja: アナライザーが見つかりません
ko: 분석기를 찾을 수 없습니다.
pl: Nie znaleziono analizatorów
pt_br: Nenhum analisador encontrado
ru: Анализаторы не найдены
tr: Çözümleyici bulunamadı
zh_hans: 找不到分析器
zh_hant: 找不到任何分析器

# DuplicateAnalyzerInstances
source: Argument contains duplicate analyzer instances.
cs: Argument obsahuje duplicitní instance analyzátoru.
de: Das Argument enthält doppelte Analyseinstanzen.
es: El argumento contiene instancias de analizador duplicadas.
fr: L'argument contient des instances en double de l'analyseur.
it: L'argomento contiene istanze duplicate dell'analizzatore.
ja: 引数にアナライザーのインスタンスが重複して含まれています。
ko: 인수에 중복된 분석기 인스턴스가 포함되어 있습니다.
pl: Argument zawiera zduplikowane wystąpienia analizatora.
pt_br: O argumento contém instâncias duplicadas do analisador.
ru: Аргумент содержит дублирующиеся экземпляры анализатора.
tr: Bağımsız değişken, yinelenen çözümleyici örnekleri içeriyor.
zh_hans: 参数包含重复的分析器实例。
zh_hant: 引數含有重複的分析器執行個體。

# UnsupportedAnalyzerInstance
source: Argument contains an analyzer instance that does not belong to the 'Analyzers' for this CompilationWithAnalyzers instance.
cs: Argument obsahuje instanci analyzátoru, který nepatří mezi Analyzátory pro tuto instanci CompilationWithAnalyzers.
de: Das Argument enthält eine Analysetoolinstanz, die nicht zu den Analysetools für diese CompilationWithAnalyzers-Instanz gehört.
es: El argumento contiene una instancia de analizador que no pertenece a los 'Analizadores' de esta instancia de CompilationWithAnalyzers.
fr: L'argument contient une instance de l'analyseur qui n'appartient pas à 'Analyzers' pour cette instance de CompilationWithAnalyzers.
it: L'argomento contiene un'istanza dell'analizzatore che non appartiene all'elemento 'Analyzers' per questa istanza di CompilationWithAnalyzers.
ja: 引数には、この CompilationWithAnalyzers インスタンスの 'アナライザー' に属していないアナライザー インスタンスが含まれています。
ko: 인수에 이 CompilationWithAnalyzers 인스턴스에 대한 '분석기'에 속하지 않는 분석기 인스턴스가 포함되어 있습니다.
pl: Argument zawiera wystąpienie analizatora, które nie należy do elementu „Analizatory” dla tego wystąpienia CompilationWithAnalyzers.
pt_br: O argumento contém uma instância de analisador que não pertence aos "Analisadores" dessa instância de CompilationWithAnalyzers.
ru: Аргумент содержит экземпляр анализатора, который не относится к объекту "Analyzers" для этого экземпляра CompilationWithAnalyzers.
tr: Bağımsız değişken, bu CompilationWithAnalyzers örneğinin 'Analyzers' öğesine ait olmayan bir çözümleyici örneği içeriyor.
zh_hans: 参数包含的分析器实例不属于此 CompilationWithAnalyzers 实例的“Analyzers”。
zh_hant: 引數含有分析器執行個體，其不屬於此 CompilationWithAnalyzers 執行個體的 'Analyzers'。

# InvalidTree
source: Syntax tree doesn't belong to the underlying 'Compilation'.
cs: Strom syntaxe nepatří do zdrojové kompilace.
de: Der Syntaxbaum gehört nicht zur zugrunde liegenden "Compilation".
es: El árbol de sintaxis no pertenece a la 'Compilación' subyacente.
fr: L'arborescence de syntaxe n'appartient pas à la 'Compilation' sous-jacente.
it: L'albero sintattico non appartiene all'elemento 'Compilation' sottostante.
ja: 構文ツリーは、基になる 'コンパイル' に属していません。
ko: 구문 트리가 기본 '컴파일'에 속하지 않습니다.
pl: Drzewo składni nie należy do podstawowego elementu „Kompilacja”.
pt_br: A árvore de sintaxe não pertence à "Compilação" subjacente.
ru: Дерево синтаксиса не относится к базовому объекту "Compilation".
tr: Söz dizimi ağacı temel alınan 'Compilation' öğesine ait değil.
zh_hans: 语法树不属于底层“Compilation”。
zh_hant: 語法樹狀結構不屬於基礎 'Compilation'。

# ResourceStreamEndedUnexpectedly
source: Resource stream ended at {0} bytes, expected {1} bytes.
cs: Datový proud prostředků skončil na {0} bajtech, očekávalo se {1} bajtů.
de: Der Ressourcendatenstrom endete bei {0} Bytes. Erwartet wurden {1} Bytes.
es: La secuencia de recursos finalizó en {0} bytes, cuando se esperaban {1} bytes.
fr: Fin du flux de ressources à {0} octets. {1} octets attendus.
it: Il flusso della risorsa è terminato a {0} byte, mentre era previsto a {1} byte.
ja: リソース ストリームが {0} バイトで終了しました。{1} バイトが必要です。
ko: 리소스 스트림이 {0}바이트에서 끝났는데 {1}바이트여야 합니다.
pl: Strumień zasobów zakończył się przy następującej liczbie bajtów: {0}, oczekiwano następującej liczby bajtów: {1}.
pt_br: O fluxo de recursos terminou em {0} bytes, mas eram esperados {1} bytes.
ru: Поток ресурсов закончился на {0} байт, ожидалось {1} байт.
tr: Kaynak akışı {0} baytta sona erdi {1} bayt bekleniyordu.
zh_hans: 资源流在 {0} 字节结束，预期为 {1} 字节。
zh_hant: 資源資料流於 {0} 個位元組結束，必須是 {1} 個位元組。

# SharedArgumentMissing
source: Value for argument '/shared:' must not be empty
cs: Hodnota argumentu /shared: nesmí být prázdná.
de: Der Wert für das Argument "/shared:" darf nicht leer sein.
es: El valor para el argumento '/shared:' no debe estar vacío
fr: La valeur de l'argument '/shared:' ne doit pas être vide
it: Il valore dell'argomento '/shared:' non deve essere vuoto
ja: 引数 '/shared:' の値を空にすることはできません
ko: /shared:' 인수의 값은 비워 둘 수 없습니다.
pl: Wartość argumentu „/shared:” nie może być pusta
pt_br: O valor para o argumento '/shared:' não deve ser vazio
ru: Значение для аргумента /shared: не должно быть пустым
tr: /shared:' bağımsız değişkeninin değeri boş olamaz
zh_hans: 参数“/shared:”的值不能为空
zh_hant: 引數 '/shared:' 的值不可為空白

# ExceptionContext
source: Exception occurred with following context: {0}
cs: Došlo k výjimce s tímto kontextem: {0}
de: Ausnahme mit dem folgenden Kontext: {0}
es: Se produjo una excepción con el contexto siguiente: {0}
fr: Une exception s'est produite dans le contexte suivant : {0}
it: Si è verificata un'eccezione con il contesto seguente: {0}
ja: 次のコンテキストで例外が発生しました: {0}
ko: 다음 컨텍스트에서 예외가 발생했습니다. {0}
pl: Wystąpił wyjątek z następującym kontekstem: {0}
pt_br: Ocorreu uma exceção com o seguinte contexto: {0}
ru: Возникло исключение со следующим контекстом: {0}
tr: Şu bağlama sahip özel durum oluştu: {0}
zh_hans: 出现异常，上下文如下: {0}
zh_hant: 下列內容發生例外狀況: {0}

# AnonymousTypeMemberAndNamesCountMismatch2
source: {0} and {1} must have the same length.
cs: {0} a {1} musí mít stejnou délku.
de: {0} und {1} müssen die gleiche Länge aufweisen.
es: {0} y {1} deben tener la misma longitud.
fr: {0} et {1} doivent être de la même longueur.
it: {0} e {1} devono avere la stessa lunghezza.
ja: {0} と {1} は、同じ長さである必要があります。
ko: {0}과(와) {1}의 길이가 같아야 합니다.
pl: Elementy {0} i {1} muszą mieć tę samą długość.
pt_br: {0} e {1} devem ter o mesmo tamanho.
ru: {0} и {1} должны иметь одинаковую длину.
tr: {0} ile {1} aynı uzunlukta olmalıdır.
zh_hans: {0} 和 {1} 长度必须相同。
zh_hant: {0} 及 {1} 的長度必須相同。

# AnonymousTypeArgumentCountMismatch2
source: {0} must either be 'default' or have the same length as {1}.
cs: {0} musí být buď default, nebo musí mít stejnou délku jako {1}.
de: {0} muss "Standard" sein oder die gleiche Länge wie {1} aufweisen.
es: {0} debe ser el "valor predeterminado" o tener la misma longitud que {1}.
fr: {0} doit être 'default' ou être de la même longueur que {1}.
it: {0} deve essere 'default' o avere la stessa lunghezza di {1}.
ja: {0} は 'default' もしくは {1} と同じ長さである必要があります。
ko: {0}은(는) '기본값'이거나 {1}과(와) 길이가 같아야 합니다.
pl: Element {0} musi mieć wartość „default” lub tę samą długość co element {1}.
pt_br: {0} deve ser 'padrão' ou deve ter o mesmo tamanho que {1}.
ru: {0} должен иметь значение по умолчанию или быть той же длины, что и {1}.
tr: {0} değeri 'default' olmalı veya {1} ile aynı uzunlukta olmalıdır.
zh_hans: {0} 必须为“默认值”或具有与 {1} 相同的长度。
zh_hant: {0} 必須是「預設值」，或其長度必須與 {1} 相同。

# InconsistentSyntaxTreeFeature
source: Inconsistent syntax tree features
cs: Nekonzistentní funkce stromu syntaxe
de: Inkonsistente Syntaxbaumfeatures
es: Características de árbol de sintaxis incoherente
fr: Fonctionnalités de l'arborescence de syntaxe incohérentes
it: Funzionalità incoerenti dell'albero della sintassi
ja: 不整合の構文ツリーの機能
ko: 일관성 없는 구문 트리 기능
pl: Niespójne funkcje drzewa składni
pt_br: Recursos da árvore de sintaxe inconsistentes
ru: Несогласованные компоненты синтаксического дерева
tr: Tutarsız söz dizimi ağacı özellikleri
zh_hans: 不一致的语法树特征
zh_hant: 不一致的語法樹功能

# ReferenceOfTypeIsInvalid1
source: Reference of type '{0}' is not valid for this compilation.
cs: Odkaz typu {0} není pro tuto kompilaci platný.
de: Der Verweis vom Typ "{0}" ist für diese Kompilierung ungültig.
es: La referencia del tipo '{0}' no es válida para esta compilación.
fr: La référence de type '{0}' n'est pas valide pour cette compilation.
it: Il riferimento di tipo '{0}' non è valido per questa compilazione.
ja: 型 '{0}' の参照は、このコンパイルで有効ではありません。
ko: '{0}' 형식의 참조를 이 컴파일에 사용할 수 없습니다.
pl: Odwołanie typu „{0}” jest nieprawidłowe dla tej kompilacji.
pt_br: A referência do tipo '{0}' não é válida para esta compilação.
ru: Ссылка типа "{0}" недопустима для этой компиляции.
tr: {0}' türündeki başvuru bu derleme için geçerli değil.
zh_hans: 引用类型“{0}”对该编译无效。
zh_hant: 類型 '{0}' 的參考對此編譯無效。

# MetadataRefNotFoundToRemove1
source: MetadataReference '{0}' not found to remove.
cs: Nenašel se odkaz na metadata {0}, který by se dal odebrat.
de: MetadataReference "{0}" wurde nicht zum Entfernen gefunden.
es: No se encontró MetadataReference '{0}' para quitarse.
fr: MetadataReference '{0}' à supprimer introuvable.
it: Non è stato trovato nessun elemento MetadataReference '{0}' da rimuovere.
ja: 削除する MetadataReference '{0}' が見つかりません。
ko: 제거할 '{0}' MetadataReference를 찾을 수 없습니다.
pl: Nie znaleziono elementu MetadataReference „{0}” do usunięcia.
pt_br: MetadataReference '{0}' não encontrada para remoção.
ru: Не найдена ссылка MetadataReference "{0}" для удаления.
tr: Kaldırılacak MetadataReference '{0}' bulunamadı.
zh_hans: 未找到要删除的 MetadataReference“{0}”。
zh_hant: 找不到 MetadataReference '{0}' 可移除。

# TupleElementNameCountMismatch
source: If tuple element names are specified, the number of element names must match the cardinality of the tuple.
cs: Pokud jsou zadané názvy prvků řazené kolekce členů, musí se počet názvů členů shodovat s kardinalitou této řazené kolekce členů.
de: Wenn Tupelelementnamen angegeben werden, muss die Anzahl der Elementnamen mit der Kardinalität des Tupels übereinstimmen.
es: Si se especifican nombres de elementos de tupla, el número de nombres de elementos debe coincidir con la cardinalidad de la tupla.
fr: Si des noms d'éléments tuples sont spécifiés, le nombre de noms d'éléments doit correspondre à la cardinalité du tuple.
it: Se si specificano nomi di elementi di tupla, il numero dei nomi di elementi deve corrispondere alla cardinalità della tupla.
ja: タプル要素名を指定する場合、要素名の数は、タプルの基数と一致する必要があります。
ko: 튜플 요소 이름을 지정하는 경우 요소 이름 수가 튜플의 카디널리티와 일치해야 합니다.
pl: Jeśli określono nazwy elementów krotki, liczba tych nazw musi być zgodna z kardynalnością krotki.
pt_br: Se os nomes do elemento de tupla forem especificados, o número de nomes de elemento deverá corresponder à cardinalidade da tupla.
ru: Если указаны имена элементов кортежа, число имен элементов должно соответствовать кратности кортежа.
tr: Demet öğesi adları belirtildiyse, öğe adlarının sayısı demetin kardinalitesiyle eşleşmelidir.
zh_hans: 如果指定了元组元素名称，元素名称的数量必须与元组基数相匹配。
zh_hant: 如果已指定元組元素名稱，元素名稱的數目就必須符合元組的基數。
