Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TupleElementNameEmpty
source: Tuple element name cannot be an empty string.
cs: Názvem prvku řazené kolekce členů nemůže být prázdný řetězec.
de: Ein Tupelelement darf kein leerer String sein.
es: El nombre del elemento de tupla no puede ser una cadena vacía.
fr: Le nom d'élément tuple ne peut pas être une chaîne vide.
it: Il nome di elemento di tupla non può essere una stringa vuota.
ja: タプル要素名を空の文字列にすることはできません。
ko: 튜플 요소 이름은 빈 문자열일 수 없습니다.
pl: Nazwa elementu krotki nie może być pustym ciągiem.
pt_br: O nome de elemento de tupla não pode ser uma cadeia de caracteres vazia.
ru: Имя элемента кортежа не может быть пустой строкой.
tr: Demet öğesi adı boş bir dize olamaz.
zh_hans: 元组元素名称不能为空字符串。
zh_hant: 元組元素名稱不可為空字串。

# TupleElementLocationCountMismatch
source: If tuple element locations are specified, the number of locations must match the cardinality of the tuple.
cs: Pokud jsou zadaná umístění prvků řazené kolekce členů, musí se počet umístění shodovat s kardinalitou této řazené kolekce členů.
de: Wenn Tupelelementstandorte angegeben werden, muss die Anzahl von Standorten der Kardinalität des Tupels entsprechen.
es: Si se especifican las ubicaciones de los elementos de tupla, el número de ubicaciones debe coincidir con la cardinalidad de la tupla.
fr: Si des emplacements d'éléments tuples sont spécifiés, le nombre d'emplacements doit correspondre à la cardinalité du tuple.
it: Se si specificano percorsi di elementi di tupla, il numero dei percorsi deve corrispondere alla cardinalità della tupla.
ja: タプル要素の場所を指定する場合、場所の数はタプルの基数と一致する必要があります。
ko: 튜플 요소 위치가 지정된 경우, 위치 수는 튜플의 카디널리티와 일치해야 합니다.
pl: Jeśli określono lokalizacje elementów krotki, liczba lokalizacji musi zgadzać się z kardynalnością krotki.
pt_br: Se as localizações dos elementos de tupla forem especificadas, o número de localizações deverá corresponder à cardinalidade da tupla.
ru: Если указаны расположения элементов кортежа, число расположений и кортежей должно совпадать.
tr: Demet öğelerinin konumları belirtildiyse, konumların sayısı demetin kardinalitesiyle eşleşmelidir.
zh_hans: 如果已指定元组元素位置，则位置的数量必须与元组基数相匹配。
zh_hant: 如果指定了元組元素位置，位置數目就必須符合元組的基數。

# TuplesNeedAtLeastTwoElements
source: Tuples must have at least two elements.
cs: Řazené kolekce členů musí mít aspoň dva elementy.
de: Tupel müssen mindestens zwei Elemente enthalten.
es: Las tuplas deben tener al menos dos elementos.
fr: Les tuples doivent posséder au moins deux éléments.
it: Le tuple devono contenere almeno due elementi.
ja: タプルには 2 つ以上の要素が必要です。
ko: 튜플에는 요소가 두 개 이상 있어야 합니다.
pl: Krotki muszą zawierać co najmniej dwa elementy.
pt_br: Tuplas devem ter pelo menos dois elementos.
ru: Кортежы должны содержать по меньшей мере два элемента.
tr: Demetler en az iki öğe içermelidir.
zh_hans: 元组必须包含至少两个元素。
zh_hant: 元組必須有至少兩個項目。

# CompilationReferencesAssembliesWithDifferentAutoGeneratedVersion
source: The compilation references multiple assemblies whose versions only differ in auto-generated build and/or revision numbers.
cs: Kompilace odkazuje na víc sestavení, jejichž verze se liší jenom v automaticky generovaném buildu a/nebo číslech revizí.
de: Die Kompilierung verweist auf mehrere Assemblys, deren Versionen sich nur hinsichtlich der automatisch generierten Build- oder Revisionsversionsnummern unterscheiden.
es: La compilación hace referencia a varios ensamblados cuyas versiones solo difieren en los números de compilación y/o versión generados automáticamente.
fr: La compilation fait référence à plusieurs assemblys dont les versions ne diffèrent que par les numéros de build et/ou de révision générés automatiquement.
it: La compilazione fa riferimento a più assembly le cui versioni differiscono solo nei numeri di revisione e/o di build generati automaticamente.
ja: コンパイルは、自動生成ビルド番号またはリビジョン番号 (あるいはその両方) のみが異なるバージョンの複数のアセンブリを参照しています。
ko: 컴파일에서 버전이 자동 생성 빌드 및/또는 수정 번호만 다른 여러 어셈블리를 참조합니다.
pl: Kompilacja zawiera odwołania do wielu zestawów, których wersje różnią się tylko automatycznie wygenerowanymi numerami kompilacji i/lub poprawki.
pt_br: A compilação faz referência a vários assemblies cujas versões diferem apenas nos números de build e/ou revisão gerados automaticamente.
ru: Компиляция ссылается на несколько сборок, версии которых отличаются только номерами автоматически созданных сборок и (или) редакций.
tr: Derleme, sürümleri yalnızca otomatik olarak oluşturulan derleme ve/veya düzeltme numaraları bakımından farklı olan birden çok bütünleştirilmiş koda başvuruyor.
zh_hans: 编译将引用多个程序集(其版本只在自动生成的版本和/或修订号方面有所不同)。
zh_hant: 此編譯參考多項組件，其差異只在自動產生的組建編號及 (或) 修訂編號。

# TupleUnderlyingTypeMustBeTupleCompatible
source: The underlying type for a tuple must be tuple-compatible.
cs: Základní typ pro řazenou kolekci členů musí být s řazenou kolekcí členů kompatibilní.
de: Der zugrunde liegende Typ für ein Tupel muss tupelkompatibel sein.
es: El tipo subyacente de una tupla debe ser compatible con tuplas.
fr: Le type sous-jacent d'un tuple doit être compatible avec le tuple.
it: Il tipo sottostante di una tupla deve essere compatibile con la tupla.
ja: タプルの基になる型は、タプルと互換性がなければなりません。
ko: 튜플의 기본 형식은 튜플과 호환되어야 합니다.
pl: Podstawowy typ krotki musi zapewniać obsługę krotek.
pt_br: O tipo subjacente de uma tupla deve ser compatível com a tupla.
ru: Базовый тип кортежа должен быть совместим с кортежами.
tr: Bir demet için temel alınan tür, demet ile uyumlu olmalıdır.
zh_hans: 元组的基础类型必须符合元组。
zh_hant: 元組的基礎類型必須與元組相容。

source: Unrecognized resource file format.
cs: Nerozpoznaný formát souboru prostředku
de: Unbekanntes Ressourcendateiformat.
es: Formato de archivo de recurso no reconocido.
fr: Format de fichier de ressources non reconnu.
it: Il formato del file di risorse non è riconosciuto.
ja: 認識されないリソース ファイル形式です。
ko: 인식할 수 없는 리소스 파일 형식입니다.
pl: Nierozpoznany format pliku zasobów.
pt_br: Formato de arquivo de recurso não reconhecido.
ru: Нераспознанный формат файла ресурса.
tr: Tanınmayan kaynak dosyası biçimi.
zh_hans: 无法识别的资源文件格式。
zh_hant: 無法辨識的資源檔格式。

# SourceTextCannotBeEmbedded
source: SourceText cannot be embedded. Provide encoding or canBeEmbedded=true at construction.
cs: SourceText se nedá vložit. Při vytváření zadejte kódování nebo canBeEmbedded=true.
de: SourceText kann nicht eingebettet werden. Geben Sie bei der Erstellung die Codierung oder "canBeEmbedded=true" an.
es: SourceText no se puede insertar. Proporcione codificación o canBeEmbedded=true en la construcción.
fr: Impossible d'incorporer SourceText. Indiquez l'encodage ou canBeEmbedded=true au moment de la construction.
it: Non è possibile incorporare SourceText. Specificare la codifica oppure canBeEmbedded=true in fase di costruzione.
ja: SourceText を埋め込むことはできません。構築においてエンコードまたは canBeEmbedded=true を使用してください。
ko: SourceText를 포함할 수 없습니다. 생성 시 인코딩 또는 canBeEmbedded=true를 지정하세요.
pl: Nie można osadzić elementu SourceText. Podaj kodowanie lub ustawienie canBeEmbedded=true w konstrukcji.
pt_br: SourceText não pode ser inserido. Forneça a codificação ou canBeEmbedded=true durante a construção.
ru: Невозможно внедрить SourceText. Укажите кодировку или аргумент canBeEmbedded=true во время создания.
tr: SourceText eklenemedi. Yapılandırmada kodlamayı veya canBeEmbedded=true değerini sağlayın.
zh_hans: 不能嵌入 SourceText。在构造时提供编码或 canBeEmbedded=true。
zh_hant: 無法內嵌 SourceText。請於建構提供編碼或 canBeEmbedded = true。

source: Stream is too long.
cs: Stream je moc dlouhý.
de: Der Datenstrom ist zu lang.
es: Secuencia demasiado larga.
fr: Le flux est trop long.
it: Il flusso è troppo lungo.
ja: ストリームが長すぎます。
ko: 스트림이 너무 깁니다.
pl: Strumień jest za długi.
pt_br: O fluxo é muito longo.
ru: Слишком длинный поток.
tr: Akış çok uzun.
zh_hans: “流”过长。
zh_hant: 資料流過長。

# EmbeddedTextsRequirePdb
source: Embedded texts are only supported when emitting a PDB.
cs: Vložené texty jsou podporované jen při vydávání souboru PDB.
de: Eingebettete Texte werden nur bei Ausgabe einer PDB-Datei unterstützt.
es: Solo se admiten textos insertados cuando se emite un archivo PDB.
fr: Les textes incorporés sont uniquement pris en charge durant l'émission d'un fichier PDB.
it: I testi incorporati sono supportati solo quando si crea un file PDB.
ja: 埋め込みのテキストは、PDB の生成時にのみサポートされます。
ko: PDB를 내보낼 때만 포함된 텍스트가 지원됩니다.
pl: Osadzony tekst jest obsługiwany tylko w przypadku emitowania pliku PDB.
pt_br: Só há suporte para textos inseridos ao emitir um PDB.
ru: Внедренный текст поддерживается только при создании PDB-файла.
tr: Ekli metinler yalnızca PDB gösterilirken desteklenir.
zh_hans: 仅在发出 PDB 时才支持嵌入的文本。
zh_hant: 只在發出 PDB 時才支援內嵌文字。

source: The stream cannot be written to.
de: In den Datenstrom kann nicht geschrieben werden.
fr: Écriture dans le flux impossible.
it: Non è possibile scrivere nel flusso.
ja: ストリームを書き込めません。
ko: 스트림에 쓸 수 없습니다.
pl: Nie można zapisać do strumienia.
pt_br: Não é possível gravar no fluxo.
tr: Akışa yazılamıyor.

source: element is expected
cs: Očekával se element.
de: Element wird erwartet
es: elemento esperado
fr: élément attendu
it: è previsto un elemento
ja: 要素が必要です
ko: 요소가 필요합니다.
pl: element jest oczekiwany
pt_br: elemento é esperado
ru: требуется элемент
tr: öğe bekleniyor
zh_hans: 应为元素
zh_hant: 必須是元素

source: separator is expected
cs: Očekával se oddělovač.
de: Trennzeichen erwartet.
es: se espera un separador
fr: séparateur attendu
it: è previsto il separatore
ja: 区切り記号が必要です
ko: 구분 기호가 필요합니다.
pl: oczekiwano separatora
pt_br: separador é esperado
ru: требуется разделитель
tr: ayırıcı bekleniyor
zh_hans: 需要分隔符
zh_hant: 必須是分隔符號

source: The stream cannot be read from.
de: Aus dem Datenstrom kann nicht gelesen werden.
fr: Lecture à partir du flux impossible.
it: Non è possibile leggere dal flusso.
ja: ストリームを読み取れません。
ko: 스트림에서 읽을 수 없습니다.
pl: Nie można odczytać ze strumienia.
pt_br: Não é possível ler o fluxo.
tr: Akıştan okunamıyor.

source: Deserialization reader for '{0}' read incorrect number of values.
de: Der Deserialisierungsreader für "{0}" hat eine falsche Anzahl von Werten gelesen.
fr: Le lecteur de désérialisation pour '{0}' a lu un nombre incorrect de valeurs.
it: Il numero di valori letto dal lettore di deserializzazioni per '{0}' non è corretto.
ja: '{0}' の逆シリアル化のリーダーが、正しくない数の値を読み取りました。
ko: '{0}'에 대한 역직렬화 판독기가 잘못된 숫자 값을 읽습니다.
pl: Czytnik deserializacji dla elementu „{0}” odczytuje nieprawidłową liczbę wartości.
pt_br: O leitor de desserialização para '{0}' lê o número incorreto de valores.
tr: {0}' türünün seri durumdan çıkarma okuyucusu, yanlış sayıda değer okudu.

source: Stream contains invalid data
de: Der Stream enthält ungültige Daten.
fr: Le flux contient des données non valides
it: Il flusso contiene dati non validi
ja: ストリームに無効なデータが含まれています
ko: 스트림에 잘못된 데이터가 들어 있습니다.
pl: Strumień zawiera nieprawidłowe dane
pt_br: A transmissão contém dados inválidos
tr: Akış, geçersiz veri içeriyor

# InvalidDiagnosticSpanReported
source: Reported diagnostic '{0}' has a source location '{1}' in file '{2}', which is outside of the given file.
cs: Zdroj vykazované diagnostiky {0} má umístění {1} v souboru {2}, což je mimo daný soubor.
de: Die gemeldete Diagnose "{0}" enthält einen Quellspeicherort "{1}" in der Datei "{2}", der sich außerhalb der angegebenen Datei befindet.
es: El diagnóstico notificado "{0}" tiene una ubicación de origen "{1}" en el archivo "{2}", que está fuera del archivo dado.
fr: Le diagnostic signalé '{0}' a un emplacement source '{1}' dans le fichier '{2}', qui se trouve en dehors du fichier donné.
it: Il percorso di origine '{1}' della diagnostica restituita '{0}' è incluso nel file '{2}', che non è presente nel file specificato.
ja: 報告された診断 '{0}' のソースの場所はファイル '{2}' 内の '{1}' ですが、これは指定されたファイルの外です。
ko: 보고된 진단 '{0}'의 소스 위치 '{1}'이(가) 지정된 파일의 범위 밖인 파일 '{2}'에 있습니다.
pl: Zgłoszone dane diagnostyczne „{0}” mają lokalizację źródłową „{1}” w pliku „{2}”, który jest spoza podanego pliku.
pt_br: O diagnóstico relatado '{0}' tem um local de origem '{1}' no arquivo '{2}', que está fora do arquivo fornecido.
ru: В отчете о диагностике "{0}" используется исходное расположение "{1}" в файле "{2}". Это расположение находится за пределами указанного файла.
tr: Bildirilen tanılamanın ('{0}') kaynak konumu olan '{1}', '{2}' dosyasında ve bu konum, belirtilen dosyanın dışında.
zh_hans: 报告的诊断“{0}”的源位置“{1}”位于文件“{2}”中，后者不是给定文件。
zh_hant: 回報之診斷 '{0}' 中的來源位置 '{1}' 位於檔案 '{2}' 內，而該檔案不在指定的檔案內。

# ExceptionEnablingMulticoreJit
source: Warning: Could not enable multicore JIT due to exception: {0}.
de: Warnung: Multi-Core-JIT konnte aufgrund einer Ausnahme nicht aktiviert werden: {0}.
fr: Avertissement : Impossible d'activer le JIT multicœur en raison de l'exception suivante : {0}.
it: Avviso: non è stato possibile abilitare JIT multicore a causa dell'eccezione {0}.
ja: 警告: 次の例外によりマルチコア JIT を有効にできませんでした: {0}。
ko: 경고: 다음 예외 때문에 멀티 코어 JIT를 사용할 수 없습니다. {0}
pl: Ostrzeżenie: Nie można włączyć wielordzeniowego kompilowania JIT z powodu wyjątku: {0}.
pt_br: Aviso: não foi possível habilitar o JIT multicore devido à exceção: {0}.
tr: Uyarı: Çok çekirdekli JIT, özel durum nedeniyle etkinleştirilemedi: {0}.

# CompilerAnalyzerThrowsDescription
source: Analyzer '{0}' threw the following exception: '{1}'.
de: Das Analysetool "{0}" hat die folgende Ausnahme ausgelöst: "{1}".
fr: L'analyseur '{0}' a levé l'exception suivante : '{1}'.
it: L'analizzatore '{0}' ha generato l'eccezione seguente: '{1}'.
pl: Analizator „{0}” zgłosił następujący wyjątek: „{1}”.
pt_br: O analisador '{0}' gerou a seguinte exceção: '{1}'.
tr: {0}' çözümleyicisi şu özel durumu oluşturdu: '{1}'.

# HintNameNotWithinCurrentDirectory
source: The hintName '{0}' is not within the current directory.
it: L'elemento '{0}' hintName non si trova nella directory corrente.

# AnalyzerDriverThrows
source: Analyzer driver threw an exception of type '{0}' with message '{1}'.
de: Der Analysetreiber hat eine Ausnahme vom Typ "{0}" mit der Meldung "{1}" ausgelöst.
fr: Le pilote de l'analyseur a levé une exception de type '{0}' avec le message '{1}'.
it: Il driver dell'analizzatore ha generato un'eccezione di tipo '{0}'. Messaggio: '{1}'.
pl: Sterownik analizatora zgłosił wyjątek typu „{0}” z komunikatem „{1}”.
pt_br: O driver do analisador gerou uma exceção do tipo '{0}' com a mensagem '{1}'.
tr: Çözümleyici sürücüsü, '{1}' iletisiyle '{0}' türünde bir özel durum oluşturdu.

# AnalyzerDriverThrowsDescription
source: Analyzer driver threw the following exception: '{0}'.
de: Der Analysetreiber hat die folgende Ausnahme ausgelöst: "{0}".
fr: Le pilote de l'analyseur a levé l'exception suivante : '{0}'.
it: Il driver dell'analizzatore ha generato l'eccezione seguente: '{0}'.
pl: Sterownik analizatora zgłosił następujący wyjątek: „{0}”.
pt_br: O driver do analisador gerou a seguinte exceção: '{0}'.
tr: Çözümleyici sürücüsü aşağıdaki özel durumu oluşturdu: '{0}'.

source: attribute
cs: atribut
es: atributo
ru: атрибут
zh_hans: 属性
zh_hant: 屬性

# ExceptionMessage_FileMayBeLockedBy
source: {0}; file may be locked by {1}
cs: {0}; soubor může být uzamčen {1}
es: {0}; archivo puede estar bloqueado por {1}
ru: {0}; файл может быть заблокирован {1}
zh_hans: {0};文件可能被 {1} 锁定
zh_hant: {0};檔案可能被 {1} 鎖定

# MissingTokenListItem
source: The specified token must be a direct element of a SyntaxTokenList (such as a modifier in a list of modifiers). The token cannot be an arbitrary token from the syntax tree.
es: El token especificado debe ser un elemento directo de una SyntaxTokenList (como un modificador en una lista de modificadores). No puede ser un token arbitrario del árbol de sintaxis.
ru: Указанный токен должен быть непосредственным элементом SyntaxTokenList (например, модификатором в списке модификаторов). Токен не может быть произвольным токеном из дерева синтаксиса.
zh_hans: 指定的标记必须是 SyntaxTokenList 的直接元素(例如修饰符列表中的修饰符)。该令牌不能是语法树中的任意令牌。
zh_hant: 指定的權杖必須是 SyntaxTokenList 的直接元素 (例如修飾元清單中的修飾元)。該權杖不能是語法樹中的任意權杖。

# SeparatorTokenMustHaveSameLanguage
source: New separator must have the same Language as the separator being replaced.
es: El nuevo separador debe tener el mismo Language que el separador que se reemplaza.
ru: Новый разделитель должен иметь тот же Language, что и заменяемый разделитель.
zh_hans: 新分隔符必须具有与要替换的分隔符相同的语言。
zh_hant: 新的分隔符號必須與被替換的分隔符號擁有相同的語言。

# SeparatorTokenMustHaveSameRawKind
source: New separator must have the same RawKind as the separator being replaced.
es: El nuevo separador debe tener el mismo RawKind que el separador que se reemplaza.
ru: Новый разделитель должен иметь тот же RawKind, что и заменяемый разделитель.
zh_hans: 新分隔符必须具有与要替换的分隔符相同的 RawKind。
zh_hant: 新的分隔符號必須與被替換的分隔符號擁有相同的 RawKind。

# SymWriterMetadataOverLimit
source: Cannot emit native PDB for method '{0}' because its debug metadata size {1} is over the limit {2}.
cs: Nejde vygenerovat nativní soubor PDB pro '{0}' metody, protože jeho velikost metadat ladění {1} překračuje limit {2}.
es: No se puede emitir un archivo PDB nativo para el método '{0}' porque su tamaño de metadatos de depuración {1} supera el límite {2}.
ru: Не удается создать собственный PDB-файл для '{0}', так как размер метаданных отладки {1} превышает ограничение {2}.
zh_hans: 无法发出方法 '{0}' 的本机 PDB，因为其调试元数据大小 {1} 超过 {2} 限制。
zh_hant: 無法發出方法 '{0}' 的原生 PDB，因為其偵錯元數據大小 {1} 超過限制 {2}。

# Type0DoesNotHaveExpectedConstructor
source: '{0}' type does not have the expected constructor
cs: typ '{0}' nemá očekávaný konstruktor.
es: '{0}' tipo no tiene el constructor esperado
ru: '{0}' тип не имеет ожидаемого конструктора
zh_hans: '{0}' 类型没有所需的构造函数
zh_hant: '{0}' 類型沒有預期的建構函式

# HintNameInvalidChar
source: The hintName contains an invalid character '{0}' at position {1}.
fr: Le hintName contient un caractère non valide '{0}' à la position {1}.
pl: Element hintName zawiera nieprawidłowy znak „{0}” na pozycji {1}.
pt_br: O hintName contém um caractere inválido '{0}' na posição {1}.
tr: hintName, {1} konumunda geçersiz bir '{0}' karakteri içeriyor.

# HintNameUniquePerGenerator
source: The hintName of the added source file must be unique within a generator.
fr: Le hintName du fichier source ajouté doit être unique dans un générateur.
pl: Element hintName dodanego pliku źródłowego musi być unikatowy w obrębie generatora.
pt_br: O hintName do arquivo de origem adicionado precisa ser exclusivo em um gerador.
tr: Eklenen kaynak dosyanın hintName'i bir oluşturucu içinde benzersiz olmalıdır.

source: 'end' must not be less than 'start'
de: 'Ende' darf nicht kleiner sein als 'Start'
fr: 'La valeur 'end' ne doit pas être inférieure à la valeur 'start'
pl: 'Element „end” nie może mieć mniejszej wartości niż element „start”
pt_br: '"fim" não deve ser menor que "início"
tr: 'end', 'start'tan az olmamalıdır

# AsyncAnalyzerActionCannotBeRegistered
source: Analyzer attempted to register an 'async' action, which is not supported.
de: Das Analysetool hat versucht, eine Aktion "async" zu registrieren. Dies wird nicht unterstützt.
fr: L'analyseur a tenté d'inscrire une action 'async', ce qui n'est pas pris en charge.
pl: Analizator próbował zarejestrować akcję „async”, co nie jest obsługiwane.
pt_br: O analisador tentou registrar uma ação 'async', tarefa para a qual não há suporte.
tr: Çözümleyici, desteklenmeyen 'asenkron' bir eylem kaydetmeye çalıştı.

# SuppressionDiagnosticDescriptorMessage
source: Diagnostic '{0}: {1}' was programmatically suppressed by a DiagnosticSuppressor with suppresion ID '{2}' and justification '{3}'
de: Die Diagnose "{0}: {1}" wurde durch einen DiagnosticSuppressor mit der Unterdrückungs-ID "{2}" und der Begründung "{3}" programmgesteuert unterdrückt.

# CompilerAnalyzerThrows
source: Analyzer '{0}' threw an exception of type '{1}' with message '{2}'.
de: Die Analyse "{0}" hat eine Ausnahme vom Typ "{1}" mit der Meldung "{2}" ausgelöst.
