Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Portable/xlf/CodeAnalysisResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# GetMetadataMustReturnInstance
source: {0}.GetMetadata() must return an instance of {1}.
de: {0}.GetMetadata() muss eine Instanz von {1} zurückgeben.
fr: {0}.GetMetadata() doit retourner une instance de {1}.
it: {0}.GetMetadata() deve restituire un'istanza di {1}.
ja: {0}.GetMetadata() は {1} のインスタンスを返す必要があります。
ko: {0}.GetMetadata()는 {1}의 인스턴스를 반환해야 합니다.
pl: Metoda {0}.GetMetadata() musi zwrócić wystąpienie {1}.
pt_br: {0}.GetMetadata() deve retornar uma instância de {1}.
tr: {0}.GetMetadata() bir {1} örneği döndürmelidir.

# UnsupportedSuppressionReported
source: Reported suppression with ID '{0}' is not supported by the suppressor.
cs: Ohlášené potlačení s ID {0} se v potlačovacím modulu nepodporuje.
de: Die gemeldete Unterdrückung mit der ID "{0}" wird vom Unterdrückungsmodul nicht unterstützt.
es: El supresor no admite la supresión notificada con el id. "{0}".
fr: La suppression signalée ayant l'ID '{0}' n'est pas prise en charge par le suppresseur.
it: L'eliminazione restituita con ID '{0}' non è supportata dall'elemento di eliminazione.
ja: ID '{0}' の報告済みの抑制はサプレッサーによってサポートされていません。
ko: ID가 '{0}'인 보고된 비표시가 억제 장치에서 지원되지 않습니다.
pl: Zgłoszone pominięcie o identyfikatorze „{0}” nie jest obsługiwane przez eliminator.
pt_br: O supressor não dá suporte à supressão relatada com a ID '{0}'.
ru: Зарегистрированное подавление с идентификатором "{0}" не поддерживается подавителем.
tr: '{0}' kimliği ile bildirilen gizleme, gizleyici tarafından desteklenmiyor.
zh_hans: 抑制器不支持已报告的 ID 为“{0}”的诊断。
zh_hant: 隱藏器不支援識別碼為 '{0}' 的回報隱藏。

source: Value too large to be represented as a 30 bit unsigned integer.
de: Der Wert ist zu groß, um als ganze 30-Bit-Zahl ohne Vorzeichen dargestellt zu werden.
fr: La valeur est trop grande pour être représentée comme un entier non signé 30 bits.
it: Il valore è troppo grande per essere rappresentato come intero senza segno a 30 bit.
ja: 値が大きすぎるため、30 ビットの符号なし整数として表すことができません。
ko: 값이 너무 커서 30비트 정수로 표시할 수 없습니다.
pl: Wartość jest zbyt duża, dlatego nie może być reprezentowana jako 30-bitowa liczba całkowita bez znaku.
pt_br: Valor muito grande para ser representado como um inteiro não assinado de 30 bits.
tr: Değer, 30 bit işaretsiz tamsayı olarak temsil edilemeyecek kadar büyük.

source: Arrays with more than one dimension cannot be serialized.
de: Arrays mit mehr als einer Dimension können nicht serialisiert werden.
fr: Impossible de sérialiser les tableaux de plus d'une dimension.
it: Non è possibile serializzare le matrice con più di una dimensione.
ja: 複数の次元を持つ配列はシリアル化できません。
ko: 차원이 두 개 이상인 배열을 직렬화할 수 없습니다.
pl: Nie można przeprowadzić serializacji tablic z więcej niż jednym wymiarem.
pt_br: As matrizes com mais de uma dimensão não podem ser serializadas.
tr: Birden çok boyutlu diziler seri hale getirilemez.

# InvalidAssemblyName
source: Invalid assembly name: '{0}'
cs: Neplatný název sestavení: {0}
de: Ungültiger Assemblyname: '{0}'
es: Nombre de ensamblado no válido: '{0}'
fr: Nom d'assembly non valide : '{0}'
it: Il nome dell'assembly '{0}' non è valido
ja: 無効なアセンブリ名: '{0}'
ko: 잘못된 어셈블리 이름입니다('{0}').
pl: Nieprawidłowa nazwa zestawu: „{0}”
pt_br: Nome de assembly inválido: "{0}"
ru: Недопустимое имя сборки: "{0}"
tr: Geçersiz derleme adı: '{0}'
zh_hans: 无效程序集名称: “{0}”
zh_hant: 組件名稱無效: '{0}'

source: Absolute path expected.
cs: Očekávala se absolutní cesta.
de: Absoluter Pfad erwartet.
es: Ruta de acceso absoluta esperada.
fr: Chemin d'accès absolu attendu.
it: È previsto il percorso assoluto.
ja: 絶対パスが必要です。
ko: 절대 경로가 필요합니다.
pl: Oczekiwano ścieżki bezwzględnej.
pt_br: Caminho absoluto esperado.
ru: Ожидался абсолютный путь.
tr: Mutlak yok bekleniyor.
zh_hans: 预期的绝对路径。
zh_hant: 必須是絕對路徑。

# EmptyKeyInPathMap
source: A key in the pathMap is empty.
cs: Klíč v pathMap je prázdný.
de: Ein Schlüssel in der "pathMap" ist leer.
es: Una clave de pathMap está vacía.
fr: Une clé dans pathMap est vide.
it: Una chiave in pathMap è vuota.
ja: pathMap のキーが空です。
ko: pathMap의 키가 비어 있습니다.
pl: Klucz w elemencie pathMap jest pusty.
pt_br: Uma chave no pathMap está vazia.
ru: Ключ в pathMap пуст.
tr: pathMap öğesinde bir anahtar boş.
zh_hans: pathMap 中的键为空。
zh_hant: pathMap 中的索引鍵為空白。

# NullValueInPathMap
source: A value in the pathMap is null.
cs: Hodnota v pathMap je null.
de: Ein Wert in "pathMap" ist NULL.
es: Un valor en pathMap es null.
fr: Une valeur dans pathMap est Null.
it: Un valore in pathMap è Null.
ja: pathMap の値は null です。
ko: pathMap의 값이 null입니다.
pl: Wartość elementu pathMap to null.
pt_br: Um valor no pathMap é nulo.
ru: Значение в pathMap равно NULL.
tr: pathMap'te bir değer null.
zh_hans: pathMap 中的一个值为 null。
zh_hant: pathMap 中有值為 null。

source: Compilation options must not have errors.
de: Kompilierungs-Optionen dürfen keine Fehler enthalten.
fr: Les options de compilation ne doivent pas comporter d'erreurs.
it: Le opzioni di compilazione non devono contenere errori.
ja: コンパイル オプションにエラーがあってはなりません。
ko: 컴파일 옵션에 오류가 없어야 합니다.
pl: Opcje kompilacji nie mogą zawierać błędów.
pt_br: Opções de compilação não devem ter erros.
tr: Derleme seçeneklerinde hata bulunmamalıdır.

# ReturnTypeCannotBeValuePointerbyRefOrOpen
source: Return type can't be a value type, pointer, by-ref or open generic type
cs: Návratový typ nemůže být typ hodnoty, ukazatel, hodnota podle odkazu nebo otevřený obecný typ.
de: Rückgabetyp darf kein Wertetyp, Zeiger, durch Verweis oder offener generischer Typ sein
es: El tipo devuelto no puede ser un tipo de valor, un puntero, por referencia ni un tipo genérico abierto
fr: Le type de retour ne peut pas être un type de valeur, un pointeur, un type byref ou un type générique ouvert
it: Il tipo restituito non può essere un tipo valore, un puntatore, un tipo generico open o by-ref
ja: 戻り値の型は、値型、ポインター、参照渡し、オープン ジェネリック型にはできません
ko: 반환 형식에는 값 형식, 포인터, by-ref 또는 공개 제네릭 형식을 사용할 수 없습니다.
pl: Typ zwracany nie może być typem wartości, wskaźnikiem, elementem by-ref ani otwartym typem ogólnym.
pt_br: Tipo de retorno não pode ser um tipo de valor, ponteiro, by-ref ou tipo genérico aberto
ru: Возвращаемые данные не могут иметь следующий тип: значение, указатель, передача по ссылке или открытый универсальный тип
tr: Dönüş türü bir değer türü, işaretçi, başvuru tarafından veya açık genel tür olamaz
zh_hans: 返回类型不能是值类型、指针、引用传递或开放式泛型类型
zh_hant: 傳回類型不可為值類型、指標、by-ref 或開放式泛型類型

# ReturnTypeCannotBeVoidByRefOrOpen
source: Return type can't be void, by-ref or open generic type
cs: Návratový typ nemůže být prázdná hodnota, hodnota podle odkazu nebo otevřený obecný typ.
de: Rückgabetyp darf kein ungültiger, durch Verweis oder offener generischer Typ sein
es: El tipo devuelto no puede estar vacío, ser por referencia ni un tipo genérico abierto
fr: Le type de retour ne peut pas être void, un type byref ou un type générique ouvert
it: Il tipo restituito non può essere nullo, un tipo generico open o by-ref
ja: 戻り値の型は、void、参照渡し、オープン ジェネリック型にはできません
ko: 반환 형식에는 void, by-ref 또는 공개 제네릭 형식을 사용할 수 없습니다.
pl: Typ zwracany nie może być typem void, elementem by-ref ani otwartym typem ogólnym
pt_br: Tipo de retorno não pode ser um tipo de valor void, by-ref ou genérico aberto
ru: Возвращаемые данные не могут иметь следующий тип: недействительный, передача по ссылке или открытый универсальный тип
tr: Dönüş türü void, başvuru tarafından veya açık genel tür olamaz
zh_hans: 返回类型不能是无效、引用传递或是开放式泛型类型
zh_hant: 傳回類型不可為 void、by-ref 或開放式泛型類型

source: Type must be same as host object type of previous submission.
cs: Typ musí být stejný jako u hostitelského objektu při předchozím odeslání.
de: Typ muss dem Hostobjekttyp der vorherigen Übermittlung entsprechen.
es: El tipo debe ser el mismo que el tipo de objeto host del envío anterior.
fr: Le type doit être le même que celui de l'objet hôte de la soumission précédente.
it: Il tipo deve essere uguale al tipo di oggetto host dell'invio precedente.
ja: 種類は、前回の送信のホスト オブジェクトの種類と同じでなければなりません。
ko: 형식은 이전 제출의 호스트 개체 형식과 같아야 합니다.
pl: Typ musi być identyczny z typem obiektu hosta poprzedniego przesłanego elementu.
pt_br: Tipo deve ser igual ao tipo de objeto do host do envio anterior.
ru: Тип должен совпадать с типом объекта базовой среды предыдущего сообщения.
tr: Tür, önceki gönderimin konak nesnesi türü ile aynı olmalıdır.
zh_hans: 类型须与之前提交的宿主对象的类型相同。
zh_hant: 類型必須與上次提交的主物件類型相同。

source: Previous submission has errors.
cs: Předchozí odeslání obsahuje chyby.
de: Vorherige Übermittlung enthält Fehler.
es: El envío anterior tiene errores.
fr: La soumission précédente contient des erreurs.
it: L'invio precedente contiene errori.
ja: 前回の送信にはエラーがあります。
ko: 이전 제출에 오류가 있습니다.
pl: Poprzedni przesłany element zawiera błędy.
pt_br: Envio anterior tem erros.
ru: Предыдущее сообщение содержит ошибки.
tr: Önceki gönderimde hatalar var.
zh_hans: 上一个提交有错误。
zh_hant: 上一個提交出現錯誤。

# InvalidOutputKindForSubmission
source: Invalid output kind for submission. DynamicallyLinkedLibrary expected.
cs: Neplatný druh výstupu pro odeslání Očekávalo se DynamicallyLinkedLibrary.
de: Die Übermittlung weist einen ungültigen Ausgabetyp auf. DynamicallyLinkedLibrary erwartet.
es: Tipo de salida no válida para el envío. DynamicallyLinkedLibrary esperado.
fr: Type de sortie non valide pour la soumission. DynamicallyLinkedLibrary attendu.
it: Il tipo di output per l'invio non è valido. È previsto DynamicallyLinkedLibrary.
ja: 送信の出力の種類が無効です。DynamicallyLinkedLibrary が必要です。
ko: 제출에 대해 잘못된 출력 종류입니다. DynamicallyLinkedLibrary가 필요합니다.
pl: Nieprawidłowy rodzaj wyjścia przesłanego elementu. Oczekiwano elementu DynamicallyLinkedLibrary.
pt_br: Tipo de saída inválido para envio. DynamicallyLinkedLibrary esperado.
ru: Недопустимый тип выходных данных для сообщения. Ожидался DynamicallyLinkedLibrary.
tr: Gönderim için geçersiz çıkış türü. DynamicallyLinkedLibrary bekleniyor.
zh_hans: 无效的提交输出类型。预期为 DynamicallyLinkedLibrary。
zh_hant: 提交的輸出種類無效。必須是 DynamicallyLinkedLibrary。

# InvalidCompilationOptions
source: Invalid compilation options -- submission can't be signed.
cs: Neplatné možnosti kompilace -- odeslání nejde podepsat.
de: Ungültige Kompilierungsoptionen -- Übermittlung kann nicht signiert werden.
es: Opciones de compilación no válidas: el envío no se puede firmar.
fr: Options de compilation non valides : impossible de signer la soumission.
it: Opzioni di compilazione non valide. Non è possibile firmare l'invio.
ja: 無効なコンパイル オプション -- 送信は署名できません。
ko: 잘못된 컴파일 옵션입니다. 제출에 서명할 수 없습니다.
pl: Nieprawidłowe opcje kompilacji — nie można podpisać przesłanego elementu.
pt_br: Opções de compilação inválidas -- envio não pode ser assinado.
ru: Недопустимые параметры компиляции — сообщение не может быть подписано.
tr: Geçersiz derleme seçenekleri: Gönderim imzalanamıyor.
zh_hans: 无效的编译选项 -- 不能签署提交。
zh_hant: 編譯選項無效 -- 無法簽署提交。

source: Resource stream provider should return non-null stream.
cs: Zprostředkovatel streamu prostředků by měl vrátit čitelný stream, který není null.
de: Ressourcenstreamanbieter sollte einen nicht-Null-Stream zurückgeben.
es: El proveedor de secuencias de recursos debe devolver secuencias no nulas.
fr: Le fournisseur du flux de ressource doit retourner un flux non null.
it: Il provider di flusso della risorsa deve restituire un flusso non Null.
ja: リソース ストリーム プロバイダーは Null 以外のストリームを返す必要があります。
ko: 리소스 스트림 공급자는 null이 아닌 스트림을 반환해야 합니다.
pl: Dostawca strumienia zasobów powinien zwrócić strumień, który ma wartość inną niż null.
pt_br: O provedor de fluxo de recursos deve retornar fluxo não nulo.
ru: Поставщик потока ресурса должен возвращать поток, отличный от NULL.
tr: Kaynak akış sağlayıcısı boş olmayan akış döndürmelidir.
zh_hans: 资源流提供程序应返回非空流。
zh_hant: 資源資料流提供者應傳回非 null 資料流。

source: Reference resolver should return readable non-null stream.
cs: Řešitel odkazů by měl vrátit čitelný stream, který není null.
de: Verweis-Resolver sollte einen lesbaren nicht-Null-Stream zurückgeben.
es: El solucionador de referencias debe devolver secuencias no nulas que se puedan leer.
fr: Le programme de résolution de référence doit retourner un flux non null.
it: Il resolver di riferimenti deve restituire un flusso non Null leggibile.
ja: 参照リゾルバーは Null 以外の読み取り可能なストリームを返す必要があります。
ko: 참조 확인자는 읽을 수 있고 null이 아닌 스트림을 반환해야 합니다.
pl: Procedura rozpoznawania odwołań powinna zwrócić możliwy do odczytu strumień, który ma wartość inną niż null.
pt_br: Solucionador de referência deve o fluxo não nulo legível.
ru: Сопоставитель ссылок должен возвращать доступный для чтения поток, отличный от NULL.
tr: Başvuru çözümleyicisi boş olmayan okunabilir akış döndürmelidir.
zh_hans: 引用解析程序应返回非空的可读流。
zh_hant: 參考解析程式應傳回可讀取的非 null 資料流。

source: Empty or invalid resource name
cs: Prázdný nebo neplatný název zdroje
de: Leerer oder ungültiger Ressourcenname
es: Nombre de recurso vacío o no válido
fr: Nom de ressource vide ou non valide
it: Nome di risorsa vuoto o non valido
ja: リソース名が空または無効です
ko: 비어 있거나 잘못된 리소스 이름입니다.
pl: Pusta lub nieprawidłowa nazwa zasobu
pt_br: Nome de recurso vazio ou inválido
ru: Пустое или недопустимое имя ресурса
tr: Boş veya geçersiz kaynak adı
zh_hans: 空的或无效的资源名
zh_hant: 資源名稱是空的，或其無效

source: Empty or invalid file name
cs: Prázdný nebo neplatný název souboru
de: Leerer oder ungültiger Dateiname
es: Nombre de archivo vacío o no válido
fr: Nom de fichier vide ou non valide
it: Nome di file vuoto o non valido
ja: ファイル名が空または無効です
ko: 비어 있거나 잘못된 파일 이름입니다.
pl: Pusta lub nieprawidłowa nazwa pliku
pt_br: Nome de arquivo vazio ou inválido
ru: Пустое или недопустимое имя файла
tr: Boş veya geçersiz dosya adı
zh_hans: 空的或无效的文件名
zh_hant: 檔案名稱是空的，或其無效

source: Resource data provider should return non-null stream
cs: Zprostředkovatel dat prostředků by měl vrátit čitelný stream, který není null.
de: Ressourcendatenanbieter sollte einen Nicht-Null-Stream zurückgeben
es: El proveedor de datos de recursos debe devolver secuencias no nulas
fr: Le fournisseur de données de ressource doit retourner un flux non null
it: Il provider di dati della risorsa deve restituire un flusso non Null
ja: リソース データ プロバイダーは Null 以外のストリームを返す必要があります
ko: 리소스 데이터 공급자는 null이 아닌 스트림을 반환해야 합니다.
pl: Dostawca danych zasobów powinien zwrócić strumień, który ma wartość inną niż null.
pt_br: Provedor de dados de recursos deve retornar o fluxo não nulo
ru: Поставщик данных ресурса должен возвращать поток, отличный от NULL
tr: Kaynak veri sağlayıcısı boş olmayan akış döndürmelidir
zh_hans: 资源数据提供程序应返回非空流
zh_hant: 資源資料提供者應傳回非 null 資料流

source: File not found.
cs: Soubor se nenašel.
de: Die Datei wurde nicht gefunden.
es: Archivo no encontrado.
fr: Fichier introuvable.
it: Il file non è stato trovato.
ja: ファイルが見つかりません。
ko: 파일을 찾을 수 없습니다.
pl: Nie znaleziono pliku.
pt_br: Arquivo não encontrado.
ru: Файл не найден.
tr: Dosya bulunamadı.
zh_hans: 未找到文件。
zh_hant: 找不到檔案。

# PathReturnedByResolveStrongNameKeyFileMustBeAbsolute
source: Path returned by {0}.ResolveStrongNameKeyFile must be absolute: '{1}'
de: Der von {0}.ResolveStrongNameKeyFile zurückgegebene Pfad muss absolut sein: '{1}'
fr: Le chemin d'accès retourné par {0}.ResolveStrongNameKeyFile doit être absolu : '{1}'
it: Il percorso restituito da {0}.ResolveStrongNameKeyFile deve essere assoluto: '{1}'
ja: {0}.ResolveStrongNameKeyFile は絶対パスを返す必要があります: '{1}'
ko: {0}.ResolveStrongNameKeyFile에서 반환한 경로는 절대 경로여야 합니다. '{1}'
pl: Ścieżka zwrócona przez element {0}.ResolveStrongNameKeyFile musi być bezwzględna: „{1}”
pt_br: Caminho retornado por {0}.ResolveStrongNameKeyFile deve ser absoluto: "{1}"
tr: {0}.ResolveStrongNameKeyFile tarafından döndürülen yol mutlak olmalıdır: '{1}'

source: type must be a subclass of SyntaxAnnotation.
de: Typ muss eine Unterklasse von SyntaxAnnotation sein.
fr: Le type doit être une sous-classe de SyntaxAnnotation.
it: il tipo deve essere una sottoclasse di SyntaxAnnotation.
ja: 種類は SyntaxAnnotation のサブクラスでなければなりません。
ko: 형식은 SyntaxAnnotation의 하위 클래스여야 합니다.
pl: Typ musi być podklasą elementu SyntaxAnnotation.
pt_br: tipo deve ser uma subclasse de SyntaxAnnotation.
tr: Tür SyntaxAnnotation'ın alt sınıfı olmalıdır.

# InvalidModuleName
source: Invalid module name specified in metadata module '{0}': '{1}'
cs: Neplatný název oddílu určený v modulu metadat {0}: {1}
de: Im Metadatenmodul '{0}': '{1}' ist ein ungültiger Modulname angegeben
es: Nombre de módulo no válido especificado en el módulo de metadatos '{0}': '{1}'
fr: Nom du module spécifié non valide dans le module de métadonnées '{0}' : '{1}'
it: È stato specificato un nome di modulo non valido nel modulo dei metadati '{0}': '{1}'
ja: メタデータ モジュール '{0}' に無効なモジュール名が指定されています: '{1}'
ko: '{0}' 메타데이터 모듈에 잘못된 모듈 이름이 지정되었습니다('{1}').
pl: Nieprawidłowa nazwa modułu została określona w module metadanych „{0}”: „{1}”
pt_br: Nome de módulo inválido especificado no módulo de metadados "{0}": "{1}"
ru: В модуле метаданных "{0}" указано недопустимое имя модуля: "{1}"
tr: {0}' meta veri modülünde geçersiz modül adı belirtildi: '{1}'
zh_hans: 在元数据模块“{0}”中所指定的模块名称无效:“{1}”
zh_hant: 中繼資料模組 '{0}' 中指定了無效的模組名稱: '{1}'

# FileSizeExceedsMaximumAllowed
source: File size exceeds maximum allowed size of a valid metadata file.
de: Dateigröße überschreitet die maximal zulässige Größe einer gültigen Metadatendatei.
fr: La taille du fichier dépasse la taille maximale autorisée pour un fichier de métadonnées valide.
it: Le dimensioni del file superano quelle massime consentite per un file di metadati valido.
ja: ファイルのサイズが有効なメタデータ ファイルの最大許容サイズを超えています。
ko: 파일 크기가 유효한 메타데이터 파일에 허용된 최대 크기를 초과했습니다.
pl: Rozmiar pliku przekracza maksymalny dozwolony rozmiar prawidłowego pliku metadanych.
pt_br: Tamanho do arquivo excede o tamanho máximo permitido de um arquivo de metadados válido.
tr: Dosya boyutu geçerli meta veri dosyasının izin verilen maksimum boyutunu aşıyor.

source: Name cannot be null.
cs: Název nemůže být null.
de: Der Name darf nicht NULL sein.
es: El nombre no puede ser nulo.
fr: Le nom ne peut pas être Null.
it: Il nome non può essere Null.
ja: 名前を null にすることはできません。
ko: 이름은 null일 수 없습니다.
pl: Nazwa nie może być pusta.
pt_br: O nome não pode ser nulo.
ru: Имя не может иметь значение null.
tr: Ad null olamaz.
zh_hans: 名称不能为 null。
zh_hant: 名稱不可為 null。

source: Name cannot be empty.
cs: Název nemůže být prázdný.
de: Der Name darf nicht leer sein.
es: El nombre no puede estar vacío.
fr: Le nom ne peut pas être vide.
it: Il nome non può essere vuoto.
ja: 名前は空にできません。
ko: 이름을 비워 둘 수 없습니다.
pl: Nazwa nie może być pusta.
pt_br: O nome não pode ficar vazio.
ru: Имя не может быть пустым.
tr: Ad boş olamaz.
zh_hans: 名称不能为空。
zh_hant: 名稱不可為空白。

source: Name cannot start with whitespace.
cs: Název nesmí začínat mezerou.
de: Name darf nicht mit einem Leerzeichen beginnen.
es: El nombre no puede empezar con un espacio en blanco.
fr: Le nom ne peut pas commencer par un espace blanc.
it: Il nome non può iniziare con uno spazio vuoto.
ja: 名前は空白文字で開始できません。
ko: 이름은 공백으로 시작할 수 없습니다.
pl: Nazwa nie może rozpoczynać się od białego znaku.
pt_br: Nome não pode começar com espaço em branco.
ru: Имя не может начинаться с пробела.
tr: Ad boşluk ile başlayamaz.
zh_hans: 名称不能以空格开头。
zh_hant: 名稱開頭不可為空白。

# NameContainsInvalidCharacter
source: Name contains invalid characters.
cs: Název obsahuje neplatné znaky.
de: Name enthält ungültige Zeichen.
es: El nombre contiene caracteres no válidos.
fr: Le nom contient des caractères non valides.
it: Il nome contiene caratteri non validi.
ja: 名前に無効な文字が含まれています。
ko: 이름에 잘못된 문자가 포함되어 있습니다.
pl: Nazwa zawiera nieprawidłowe znaki.
pt_br: Nome contém caracteres inválidos.
ru: Имя содержит недопустимые символы.
tr: Ad geçersiz karakterler içeriyor.
zh_hans: 名称包含无效字符。
zh_hant: 名稱包含無效的字元。

# SpanDoesNotIncludeStartOfLine
source: The span does not include the start of a line.
cs: Rozpětí nezahrnuje začátek řádku.
de: Der Bereich enthält nicht den Beginn einer Zeile.
es: El intervalo no incluye el principio de una línea.
fr: L'étendue n'inclut pas le début d'une ligne.
it: L'elemento span non include l'inizio di una riga.
ja: 範囲には、行の先頭が含まれません。
ko: 범위에 줄의 시작이 포함되지 않습니다.
pl: Zakres nie obejmuje początku wiersza.
pt_br: O alcance não inclui o início de uma linha.
ru: Диапазон не включает в себя начало строки.
tr: Yayılım bir satırın başlangıcını içermez.
zh_hans: 范围不包括行的开头。
zh_hant: Span 不包含行首。

# SpanDoesNotIncludeEndOfLine
source: The span does not include the end of a line.
cs: Rozpětí nezahrnuje konec řádku.
de: Der Bereich umfasst nicht das Ende einer Zeile.
es: El intervalo no incluye el extremo de una línea.
fr: L'étendue n'inclut pas la fin d'une ligne.
it: L'elemento span non include la fine di una riga.
ja: 範囲に、行の末尾が含まれません。
ko: 범위에 줄의 끝이 포함되지 않습니다.
pl: Zakres nie obejmuje końca wiersza.
pt_br: A extensão não inclui o fim de uma linha.
ru: Диапазон не включает в себя конец строки.
tr: Yayılma, bir satırın sonunu içermiyor.
zh_hans: 范围不包括行的末尾。
zh_hant: Span 不包含行尾。

source: 'start' must not be negative
cs: 'Začátek musí být záporný.
de: 'Start' darf nicht negativ sein
es: 'inicio' no puede ser negativo
fr: 'La valeur 'start' ne doit pas être négative
it: 'start' non deve essere negativo
ja: 'start' は負の値であってはなりません
ko: 'start'는 음수일 수 없습니다.
pl: 'Element „start” nie może być wartością ujemną
pt_br: '"início" não deve ser negativo
ru: 'начальное значение не должно быть отрицательным
tr: 'start' negatif olmamalıdır
zh_hans: '“开始”不能为负
zh_hant: 'start' 不可為負值

source: Invalid content type
cs: Neplatný typ obsahu
de: Ungültiger Inhaltstyp
es: Tipo de contenido no válido
fr: Type de contenu non valide
it: Il tipo di contenuto non è valido
ja: 無効なコンテンツ タイプ
ko: 잘못된 콘텐츠 형식입니다.
pl: Nieprawidłowy typ zawartości
pt_br: Tipo de conteúdo inválido
ru: Недопустимый тип содержимого
tr: Geçersiz içerik türü
zh_hans: 无效的内容类型
zh_hant: 內容類型無效

source: Expected non-empty public key
de: Nicht leerer öffentlicher Schlüssel erwartet
fr: Clé publique non vide attendue
it: È prevista una chiave pubblica non vuota
ja: 空でない公開キーが必要です
ko: 비어 있지 않은 공용 키가 필요합니다.
pl: Oczekiwano klucza publicznego, który nie jest pusty
pt_br: Chave pública não vazia esperada
tr: Beklenen boş olmayan ortak anahtar

source: Invalid size of public key token.
cs: Neplatná velikost tokenu veřejného klíče
de: Token des öffentlichen Schlüssels weist eine ungültige Größe auf.
es: Tamaño no válido del token de clave pública.
fr: Taille non valide du jeton de clé publique.
it: La dimensione del token di chiave pubblica non è valida.
ja: 公開キーのトークンのサイズが無効です。
ko: 잘못된 공용 키 토큰 크기입니다.
pl: Nieprawidłowy rozmiar tokenu klucza publicznego.
pt_br: Tamanho inválido de token de chave pública.
ru: Недопустимый размер токена открытого ключа.
tr: Ortak anahtar belirtecinin boyutu geçersiz.
zh_hans: 公钥标记的大小无效。
zh_hant: 公用金鑰語彙基元大小無效。

source: Invalid characters in assembly name
cs: Neplatné znaky v názvu sestavení
de: Assemblyname enthält ungültige Zeichen.
es: Caracteres no válidos en el nombre de ensamblado
fr: Caractères non valides dans le nom de l'assembly
it: Caratteri non validi nel nome dell'assembly
ja: アセンブリ名に無効な文字があります
ko: 어셈블리 이름에 잘못된 문자가 있음
pl: Nieprawidłowe znaki w nazwie zestawu
pt_br: Caracteres inválidos no nome do assembly
ru: Недопустимые символы в имени сборки
tr: Derleme adında geçersiz karakterler
zh_hans: 程序集名称中有无效字符
zh_hant: 組件名稱包含無效的字元

source: Invalid characters in assembly culture name
de: Asssemblykulturname enthält ungültige Zeichen
fr: Caractères non valides dans le nom de la culture d'assembly
it: Caratteri non validi nel nome delle impostazioni cultura dell'assembly
ja: アセンブリのカルチャ名に無効な文字があります
ko: 어셈블리 문화권 이름에 잘못된 문자가 있습니다.
pl: Nieprawidłowe znaki w nazwie kultury zestawu
pt_br: Caracteres inválidos no nome de cultura do assembly
tr: Derleme kültürü adında geçersiz karakterler
