Repository: dotnet/roslyn
Catalog: src/LanguageServer/Microsoft.CodeAnalysis.LanguageServer/xlf/LanguageServerResources.*.xlf
Languages: it, ru, zh_hans, zh_hant

source: Aborted!
it: Interrotto!
ru: Прервано
zh_hans: 已中止!
zh_hant: 已中止！

source: Attaching debugger to process {0}
it: Collegamento del debugger all'elaborazione di {0}
ru: Подключение отладчика для обработки {0}
zh_hans: 正在将调试器附加到进程 {0}
zh_hant: 正在將偵錯工具連結到處理序 {0}

source: Building project...
it: Compilazione del progetto in corso...
ru: Сборка проекта...
zh_hans: 正在生成项目...
zh_hant: 正在建置專案...

source: Canceled!
it: Annullato!
ru: Отменено
zh_hans: 已取消!
zh_hant: 已取消！

source: Client failed to attach the debugger
it: Il client non è riuscito a collegare il debugger
ru: Клиенту не удалось подключить отладчик
zh_hans: 客户端无法附加调试器
zh_hant: 用戶端無法連結偵錯工具

source: Completed (re)load of all projects in {0}
it: Completato il (ri)caricamento di tutti i progetti in {0}
ru: Завершена (повторная) загрузка всех проектов в {0}
zh_hans: 已完成加载(重新加载) {0} 中的所有项目
zh_hant: 已完成 {0} 中所有專案的(重新)載入

source: Debugging tests...
it: Debug dei test...
ru: Идет отладка тестов...
zh_hans: 正在调试测试...
zh_hant: 正在偵錯測試...

source: Discovering tests...
it: Individuazione dei test in corso...
ru: Обнаружение тестов...
zh_hans: 正在发现测试...
zh_hant: 正在探索測試...

source: Exception thrown: {0}
it: È stata generata un'eccezione: {0}
ru: Возникло исключение: "{0}"
zh_hans: 引发了异常: {0}
zh_hant: 擲回的例外狀況: {0}

source: Failed!
it: Non superato!
ru: Не выполнено
zh_hans: 失败!
zh_hant: 失敗！

source: Failed: {0}, Passed: {1}, Skipped: {2}, Total: {3}, Duration: {4}
it: Non superati: {0}%1, Superati: {1}%2, Ignorati: {2}%2, Totale: {3}%2, Durata: {4}
ru: Не пройдено: {0}, пройдено: {1}, пропущено: {2}, всего: {3}, длительность: {4}
zh_hans: 失败: {0} 个，通过: {1} 个，已跳过: {2} 个，总计: {3} 个，持续时间: {4}
zh_hant: 失敗: {0}，通過: {1}，跳過: {2}，總計: {3}，持續時間: {4}

source: Failed to read .runsettings file at {0}:{1}
it: Non è stato possibile leggere il file con estensione runsettings in {0}:{1}
ru: Не удалось прочитать файл RUNSETTINGS в {0}:{1}
zh_hans: 无法读取 {0}:{1}的 .runsettings 文件
zh_hant: 無法讀取位於 {0} 的 .runsettings 檔案: {1}

source: Failed to run restore on {0}
it: Non è stato possibile eseguire il ripristino in {0}
ru: Не удалось запустить восстановление в {0}
zh_hans: 无法在 {0} 上运行还原
zh_hant: 無法在 {0} 上執行還原

source: Found {0} tests in {1}
it: Sono stati trovati {0} test in {1}
ru: Обнаружены тесты ({0}) в {1}
zh_hans: 在 {1} 中找到了 {0} 个测试
zh_hant: 在 {1} 中找到 {0} 個測試

source: Loading {0}...
it: Caricamento di {0} in corso...
ru: Загрузка {0}...
zh_hans: 正在加载 {0}...
zh_hant: 正在載入 {0}...

source: Message
it: Messaggio
ru: Сообщение
zh_hans: 消息
zh_hant: 訊息

source: No test methods found in requested range
it: Non sono stati trovati metodi di test nell'intervallo richiesto
ru: Методы тестов не найдены в запрашиваемом диапазоне
zh_hans: 在请求的范围内找不到测试方法
zh_hant: 在要求的範圍內找不到測試方法

source: Nothing found to restore
it: Non sono stati trovati elementi da ripristinare
ru: Ничего не найдено для восстановления
zh_hans: 找不到要还原的内容
zh_hant: 找不到可還原的項目

source: Passed!
it: Superato!
ru: Пройдено
zh_hans: 已通过!
zh_hant: 通過！

source: Project {0} has unresolved dependencies
it: Il progetto {0} ha dipendenze non risolte
ru: В проекте {0} имеются неразрешенные зависимости
zh_hans: 项目 {0} 具有未解析的依赖项
zh_hant: 專案 {0} 有無法解析的相依性

# Project_0_loaded_by_CSharp_Dev_Kit
source: Project {0} loaded by C# Dev Kit
it: Project {0} caricato da C# Dev Kit
ru: Проект {0} загружен при помощи C# Dev Kit
zh_hans: 项目 {0} 由 C# 开发工具包加载
zh_hant: 由 C# 開發人員套件載入的專案 {0}

# Projects_failed_to_load_because_MSBuild_could_not_be_found
source: Projects failed to load because the .NET Framework build tools could not be found. Try installing Visual Studio or the Visual Studio Build Tools package, or check the logs for details.
it: Non è stato possibile caricare i progetti perché non è stato possibile trovare gli strumenti di compilazione .NET Framework. Provare a installare Visual Studio o il pacchetto Visual Studio Build Tools oppure controllare i log per i dettagli.
ru: Не удалось загрузить проекты, так не удалось найти инструменты сборки .NET Framework. Попробуйте установить Visual Studio или пакет Visual Studio Build Tools либо проверьте журналы для получения дополнительных сведений.
zh_hans: 无法加载项目，因为找不到 .NET Framework 生成工具。请尝试安装 Visual Studio 或 Visual Studio 生成工具包，或查看日志以了解详细信息。
zh_hant: 無法載入專案，因為找不到.NET Framework 建置工具。請嘗試安裝 Visual Studio 或 Visual Studio Build Tools 套件，或查看記錄以尋求詳細資料。

# Projects_failed_to_load_because_Mono_could_not_be_found
source: Projects failed to load because the Mono could not be found. Ensure that Mono and MSBuild are installed, and check the logs for details.
it: Non è stato possibile caricare i progetti perché non è stato possibile trovare Mono. Verificare che Mono e MSBuild siano installati e controllare i log per i dettagli.
ru: Не удалось загрузить проекты, так как не удалось найти Mono. Убедитесь, что Mono и MSBuild установлены и проверьте журналы для получения дополнительных сведений.
zh_hans: 无法加载项目，因为找不到 Mono。确保已安装 Mono 和 MSBuild，并检查日志以了解详细信息。
zh_hant: 無法載入專案，因為找不到 Mono。請確認已安裝 Mono 和 MSBuild，並查看記錄以尋求詳細資料。

source: Restore
it: Ripristina
ru: Восстановить
zh_hans: 还原
zh_hant: 還原

source: Restore complete
it: Ripristino completato
ru: Восстановление завершено
zh_hans: 还原完成
zh_hant: 還原完成

source: Restore started
it: Ripristino avviato
ru: Восстановление запущено
zh_hans: 已开始还原
zh_hant: 還原已開始

source: Restoring {0}
it: Ripristino di {0}
ru: Выполняется восстановление {0}
zh_hans: 正在还原 {0}
zh_hant: 正在還原 {0}

source: Running dotnet restore on {0}
it: Esecuzione di dotnet restore su {0}
ru: Выполнение dotnet restore для {0}
zh_hans: 正在 {0} 上运行 dotnet restore...
zh_hant: 正在 {0} 上執行 dotnet restore

source: Running tests...
it: Esecuzione dei test in corso...
ru: Выполняются тесты…
zh_hans: 正在运行测试...
zh_hant: 正在執行測試...

source: .runsettings file does not exist at {0}
it: Il file con estensione runsettings non esiste in {0}
ru: Файл RUNSETTINGS не существует в {0}
zh_hans: {0} 中不存在 .runsettings 文件
zh_hant: .runsettings 檔案不存在於 {0}

# Show_csharp_logs
source: Show C# logs
it: Mostra log C#
ru: Показать журналы C#
zh_hans: 显示 C# 日志
zh_hant: 顯示 C# 記錄

source: Stack Trace
it: Analisi dello stack
ru: Трассировка стека
zh_hans: 堆栈跟踪
zh_hant: 堆疊追蹤

source: Starting test discovery
it: Avvio dell'individuazione dei test
ru: Запуск обнаружения тестов
zh_hans: 正在启动测试发现
zh_hant: 即將開始測試探索

source: Starting test run
it: Avvio dell'esecuzione dei test
ru: Начало тестового запуска
zh_hans: 正在启动测试运行
zh_hant: 即將開始測試回合

source: Successfully completed load of {0}
it: Il caricamento di {0} è stato completato
ru: Завершена загрузка {0}
zh_hans: 已成功完成加载 {0}
zh_hant: 已成功完成 {0} 的載入

source: Summary
it: Riepilogo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

source: Test discovery aborted
it: Individuazione dei test interrotta
ru: Обнаружение тестов прервано
zh_hans: 已中止测试发现
zh_hant: 測試探索已中止

# Test_run_error
source: Test run error: {0}
it: Errore di esecuzione dei test: {0}
ru: Ошибка тестового запуска: {0}
zh_hans: 测试运行错误: {0}
zh_hant: 測試回合錯誤：{0}

source: There were problems loading project {0}. See log for details.
it: Si sono verificati problemi durante il caricamento del progetto {0}. Per informazioni dettagliate, vedere il log.
ru: Возникли проблемы при загрузке проекта {0}. Дополнительные сведения см. в журнале.
zh_hans: 加载项目 {0} 时出现问题。有关详细信息，请参阅日志。
zh_hant: 載入專案 {0} 時發生問題。查看記錄以尋求詳細資料。

source: Using .runsettings file at {0}
it: Uso del file con estensione runsettings in {0}
ru: Использование файла RUNSETTINGS в {0}
zh_hans: 在 {0} 使用 .runsettings 文件
zh_hant: 使用位於 {0} 的 .runsettings 檔案
