Repository: dotnet/roslyn
Catalog: src/Workspaces/CSharp/Portable/xlf/CSharpWorkspaceResources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, ru, zh_hans, zh_hant

source: Code-block preferences
cs: Předvolby bloků kódu
de: Einstellungen für Codeblöcke
es: Preferencias de bloque de código
it: Preferenze per blocchi di codice
ja: コード ブロックの設定
ko: 코드 블록 기본 설정
pl: Preferencje bloku kodu
ru: Предпочтения для блоков кода
zh_hans: 代码块首选项
zh_hant: 程式碼區塊喜好設定

source: Expression-bodied members
cs: Členy s výrazem v těle
de: Ausdruckskörpermember
es: Miembros en cuerpo de expresión
it: Membri con corpo di espressione
ja: 式のようなメンバー
ko: 식 본문 멤버
pl: Składowe z wyrażeniem w treści
ru: Члены, заданные выражениями
zh_hans: Expression-bodied 成员
zh_hant: 運算式主體成員

source: Indentation preferences
cs: Předvolby odsazení
de: Einstellungen für Einrückung
es: Preferencias de indentación
it: Preferenze per rientro
ja: インデント設定
ko: 들여쓰기 기본 설정
pl: Preferencje wcięć
ru: Предпочтения для отступов
zh_hans: 缩进首选项
zh_hant: 縮排喜好設定

source: No available location found to add statements to.
cs: Nenašlo se dostupné umístění, kam by se daly přidávat příkazy.
de: Kein verfügbarer Speicherort zum Hinzufügen von Anweisungen gefunden.
es: No hay ubicación disponible a la que agregar declaraciones.
it: Non sono state trovate posizioni disponibili in cui aggiungere istruzioni.
ja: ステートメントを追加する場所がありません。
ko: 문을 추가할 위치가 없습니다.
pl: Nie znaleziono dostępnej lokalizacji, do której można dodać instrukcje.
ru: Доступные места для добавления операторов не обнаружены.
zh_hans: 没有找到添加语句的可用位置。
zh_hant: 找不到能加入陳述式的可用位置。

source: Namespace can not be added in this destination.
cs: Obor názvů nejde přidat do tohoto cílového umístění.
de: Namespace kann zu diesem Ziel nicht hinzugefügt werden.
es: El espacio de nombres no se puede agregar en este destino.
it: Non è possibile aggiungere lo spazio dei nomi in questa destinazione.
ja: 名前空間は、このターゲットでは追加できません。
ko: 이 대상에는 네임스페이스를 추가할 수 없습니다.
pl: Do tego miejsca docelowego nie można dodać przestrzeni nazw.
ru: Не удается добавить пространство имен в этот конечный объект.
zh_hans: 不能在此目标中添加命名空间。
zh_hant: 無法將命名空間加入此目的地。

source: Expected string or char literal
cs: Očekával se řetězcový nebo znakový literál.
de: Erwartete Zeichenfolge oder Zeichenliteral
es: Cadena o carácter literal esperados
it: È previsto un valore letterale di tipo stringa o char
ja: 文字列または文字リテラルが必要です
ko: 문자열 또는 문자 리터럴이 필요합니다.
pl: Oczekiwano ciągu lub literału znakowego
ru: Требуется строка или знаковый литерал
zh_hans: 预期的字符串或字符文本
zh_hant: 必須是字串或字元常值

source: Node does not descend from root.
cs: Uzel nesestupuje z kořene.
de: Knoten steigt nicht vom Stamm ab.
es: El nodo no desciende de la raíz.
it: Il nodo non discende dalla radice.
ja: ノードがルートから派生していません。
ko: 노드가 루트의 내림차순이 아닙니다.
pl: Węzeł nie jest elementem podrzędnym elementu głównego.
ru: Узел не является корневым.
zh_hans: 节点并非源自根。
zh_hant: 節點不是根的子系。

source: Node not in parent's child list
cs: Uzel není v seznamu podřízených položek u nadřazené položky.
de: Knoten befindet sich nicht in der untergeordneten Liste des übergeordneten Elements
es: El nodo no está en una lista secundaria de la primaria
it: Il nodo non è incluso nell'elenco degli elementi figlio dell'elemento padre
ja: ノードが親の子リストにありません
ko: 부모의 자식 목록에 노드가 없습니다.
pl: Węzeł nie znajduje się na liście elementów podrzędnych elementu nadrzędnego
ru: Узел не входит в родительский список дочерних узлов
zh_hans: 节点不在父级的子列表中
zh_hant: 節點不在父代的子清單中

source: Null-checking preferences
cs: Předvolby kontrol hodnoty null
de: Einstellungen für NULL-Überprüfung
es: Preferencias de comprobación de nulo
it: Preference per controllo valori Null
ja: Null チェック設定
ko: Null 검사 기본 설정
pl: Preferencje sprawdzania wartości null
ru: Настройки проверки на null
zh_hans: Null 检查首选项
zh_hant: Null 檢查喜好設定

source: Pattern matching preferences
cs: Předvolby porovnávání vzorů
de: Einstellungen für den Musterabgleich
es: Preferencias de coincidencia de patrón
it: Preferenze per criteri di ricerca
ja: パターン マッチング設定
ko: 패턴 일치 기본 설정
pl: Preferencje dopasowywania do wzorca
ru: Настройки соответствия шаблонов
zh_hans: 模式匹配首选项
zh_hant: 模式比對喜好設定

source: R&emove and Sort Usings
de: &Unnötige Using-Direktiven entfernen und sortieren
ja: Using の削除と並び替え(&E)
ko: Using 제거 및 정렬(&E)
pl: &Usuń i sortuj instrukcje using
ru: У&далить и отсортировать директивы using
zh_hans: 删除 Using 和对其排序(&E)

source: &Sort Usings
de: Using-Anweisungen &sortieren
ja: using の並べ替え(&S)
ko: Using 정렬(&S)
pl: &Sortuj użycia
ru: &Сортировать директивы using
zh_hans: 对 using 排序(&S)

source: Space preferences
cs: Předvolby mezer
de: Einstellungen für Abstände
es: Preferencias de espacio
it: Preferenze per spazi
ja: スペース設定
ko: 공간 기본 설정
pl: Preferencje dotyczące odstępów
ru: Предпочтения для интервалов
zh_hans: 空格键首选项
zh_hant: 空格喜好設定

source: Trivia is not associated with token
cs: Triviální prvek není přidružený k tokenu.
de: Trivia ist nicht dem Token zugeordnet
es: Trivialidad no asociada con token
it: Gli elementi semplici non sono associati al token
ja: トリビアがトークンに関連付けられていません
ko: Trivia가 토큰에 연결되어 있지 않습니다.
pl: Elementy towarzyszące składni nie są skojarzone z tokenem
ru: Trivia не связана с токеном
zh_hans: 琐事与标记不相关联
zh_hant: Trivia 與語彙基元無關聯

source: Cannot retrieve the Span of a null syntax reference.
cs: Nejde načíst rozpětí odkazu syntaxe s hodnotou null.
de: Der Bereich eines Nullsyntaxverweises konnte nicht abgerufen werden.
es: No se puede recuperar el intervalo de una referencia de sintaxis nula.
it: Non è possibile recuperare l'elemento Span di un riferimento a sintassi Null.
ja: Null の構文参照の範囲を取得できません。
ko: null 구문 참조의 범위를 검색할 수 없습니다.
pl: Nie można pobrać zakresu odwołania do składni o wartości null.
ru: Не удается извлечь диапазон из синтаксической ссылки со значением Null.
zh_hans: 无法检索一个空语法引用的范围。
zh_hant: 無法擷取 null 語法參考的 Span。

source: Only attributes, constructor initializers, expressions or statements can be made explicit
cs: Jako explicitní jde nastavit jenom atributy, inicializátory konstruktorů, výrazy nebo příkazy.
de: Nur Attribute, Konstruktor-Initialisierungen, Ausdrücke oder Anweisungen können den Status ausdrücklich erhalten
es: Solo los atributos, los inicializadores de constructor, las expresiones o las declaraciones se pueden hacer explícitos
it: È possibile rendere espliciti solo attributi, inizializzatori di costruttore, espressioni o istruzioni
ja: 明示できるのは、属性、コンストラクターの初期化子、式、ステートメントだけです
ko: 특성, 생성자 이니셜라이저, 식 또는 문만 명시적일 수 있습니다.
pl: Jako jawne można ustawić tylko atrybuty, inicjatory konstruktorów, wyrażenia lub instrukcje
ru: Явными могут быть сделаны только атрибуты, инициализаторы конструктора, выражения или операторы
zh_hans: 仅属性、构造函数初始值设定项、表达式或语句可为显式
zh_hant: 只有屬性、建構函式初始設定式、運算式或陳述式才可明確設定。

source: Implement Interface
cs: Implementujte rozhraní.
de: Schnittstelle implementieren
es: Implementar interfaz
it: Implementa l'interfaccia
ja: インターフェイスを実装します。
ko: 인터페이스 구현
pl: Zaimplementuj interfejs
ru: Реализовать интерфейс
zh_hans: 实现接口
zh_hant: 實作介面

source: Wrapping preferences
cs: Předvolby obálek
de: Umbrucheinstellungen
es: Preferencias de encapsulado
it: Preferenze per ritorno a capo
ja: 折り返しの設定
ko: 기본 설정 줄 바꿈
pl: Preferencje zawijania
ru: Предпочтения переноса
zh_hans: 包装首选项
zh_hant: 換行喜好設定

source: 'using' directive preferences
cs: Předvolby direktivy using
de: Einstellungen für using-Anweisungen
it: Preferenze per direttive 'using'
ja: 'using' ディレクティブの基本設定
ko: 'using' 지시문 기본 설정
pl: Preferencje dyrektywy „using”
ru: предпочтения для директивы using
zh_hans: "using" 指令首选项
zh_hant: 'using' 指示詞的喜好設定

source: var preferences
cs: Předvolby pro var
de: Var-Einstellungen
es: Preferencias de var
it: Preferenze per var
ja: var を優先
ko: var 기본 설정
pl: Preferencje zmiennych
ru: Предпочтения var
zh_hans: var 首选项
zh_hant: var 喜好設定
