Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, pl, ru, tr

# UseSpecializedCollectionsSingletonEnumerableTitle
source: Use 'SpecializedCollections.SingletonEnumerable()'
de: "SpecializedCollections.SingletonEnumerable()" verwenden
es: Usar "SpecializedCollections.SingletonEnumerable()"
fr: Utiliser 'SpecializedCollections.SingletonEnumerable()'
it: Usare 'SpecializedCollections.SingletonEnumerable()'
ja: 'SpecializedCollections.SingletonEnumerable()' を使用します
pl: Użyj metody „SpecializedCollections.SingletonEnumerable()”
ru: Используйте SpecializedCollections.SingletonEnumerable()
tr: 'SpecializedCollections.SingletonEnumerable()' kullanın

# UseSpecializedCollectionsSingletonEnumerableDescription
source: #N/A
de: #Nicht zutreffend
es: #N/D
pl: ND
ru: #Н/Д

# UseSpecializedCollectionsSingletonEnumerableMessage
source: Use 'SpecializedCollections.SingletonEnumerable()'
de: Verwenden Sie "SpecializedCollections.SingletonEnumerable()".
es: Usar "SpecializedCollections.SingletonEnumerable()"
fr: Utiliser 'SpecializedCollections.SingletonEnumerable()'
it: Usare 'SpecializedCollections.SingletonEnumerable()'
ja: 'SpecializedCollections.SingletonEnumerable()' を使用します
pl: Użyj metody „SpecializedCollections.SingletonEnumerable()”
ru: Используйте SpecializedCollections.SingletonEnumerable()
tr: 'SpecializedCollections.SingletonEnumerable()' kullanın

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsTitle
source: Invoke the correct property to ensure correct use site diagnostics
de: Richtige Eigenschaft zum Sicherstellen einer korrekten Nutzung der Websitediagnose aufrufen
es: Invocar la propiedad correcta para garantizar el diagnóstico de uso de sitio correcto
fr: Appeler la propriété appropriée pour garantir une utilisation adéquate des diagnostics de site
it: Richiamare la proprietà corretta per garantire l'uso corretto della diagnostica del sito
ja: 正しいサイト診断が使用されるように、正しいプロパティを呼び出してください
pl: Wywołaj odpowiednią właściwość, aby upewnić się, że diagnostyka witryny jest używana prawidłowo
ru: Вызовите подходящее свойство, чтобы обеспечить правильное использование диагностики сайта
tr: Doğru site tanılamalarının kullanıldığından emin olmak için doğru özelliği çağırın

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsDescription
source: #N/A
de: #Nicht zutreffend
es: #N/D
pl: ND
ru: #Н/Д

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsMessage
source: Invoke the correct property to ensure correct use site diagnostics
de: Rufen Sie die richtige Eigenschaft auf, um eine korrekte Nutzung der Websitediagnose sicherzustellen.
es: Invocar la propiedad correcta para garantizar el diagnóstico de uso de sitio correcto
fr: Appeler la propriété appropriée pour garantir une utilisation adéquate des diagnostics de site
it: Richiamare la proprietà corretta per garantire l'uso corretto della diagnostica del sito
ja: 正しいサイト診断が使用されるように、正しいプロパティを呼び出してください
pl: Wywołaj odpowiednią właściwość, aby upewnić się, że diagnostyka witryny jest używana prawidłowo
ru: Вызовите подходящее свойство, чтобы обеспечить правильное использование диагностики сайта
tr: Doğru site tanılamalarının kullanıldığından emin olmak için doğru özelliği çağırın

# DoNotUseGenericCodeActionCreateToCreateCodeActionTitle
source: Do not use generic 'CodeAction.Create' to create 'CodeAction'
de: Generische Methode "CodeAction.Create" nicht zum Erstellen von "CodeAction" verwenden
es: No usar "CodeAction.Create" genérico para crear "CodeAction"
fr: N'utilisez pas de 'CodeAction.Create' générique pour créer 'CodeAction'
it: Non usare il metodo 'CodeAction.Create' per creare l'elemento 'CodeAction'
ja: 'CodeAction' を作成するために、ジェネリック 'CodeAction.Create' を使用しないでください
pl: Nie używaj ogólnej metody „CodeAction.Create” do tworzenia elementu „CodeAction”
ru: Не используйте универсальный метод CodeAction.Create для создания CodeAction
tr: 'CodeAction' oluşturmak için genel 'CodeAction.Create' kullanmayın

# DoNotUseGenericCodeActionCreateToCreateCodeActionDescription
source: #N/A
de: #Nicht zutreffend
es: #N/D
pl: ND
ru: #Н/Д

# DoNotUseGenericCodeActionCreateToCreateCodeActionMessage
source: Do not use generic 'CodeAction.Create' to create 'CodeAction'
de: Verwenden Sie die generische Methode "CodeAction.Create" nicht zum Erstellen von "CodeAction".
es: No usar "CodeAction.Create" genérico para crear "CodeAction"
fr: N'utilisez pas de 'CodeAction.Create' générique pour créer 'CodeAction'
it: Non usare il metodo 'CodeAction.Create' per creare l'elemento 'CodeAction'
ja: 'CodeAction' を作成するために、ジェネリック 'CodeAction.Create' を使用しないでください
pl: Nie używaj ogólnej metody „CodeAction.Create” do tworzenia elementu „CodeAction”
ru: Не используйте универсальный метод CodeAction.Create для создания CodeAction
tr: 'CodeAction' oluşturmak için genel 'CodeAction.Create' kullanmayın

# OverrideObjectEqualsObjectWhenImplementingIequatableTitle
source: Override 'Object.Equals(object)' when implementing 'IEquatable'
de: "Object.Equals(object)" bei Implementierung von "IEquatable" überschreiben
es: Reemplazar "Object.Equals(object)" al implementar "IEquatable"
fr: Substituer 'Object.Equals(object)' au moment de l'implémentation de 'IEquatable'
it: Eseguire l'override di 'Object.Equals(object)' durante l'implementazione di 'IEquatable'
ja: IEquatable' を実装するときに 'Object.Equals(object)' をオーバーライドしてください
pl: Przesłoń metodę „Object.Equals(object)” przy implementowaniu interfejsu „IEquatable”
ru: Переопределите Object.Equals(object) при реализации IEquatable
tr: 'IEquatable' uygularken 'Object.Equals(object)' özniteliğini geçersiz kılın

# OverrideObjectEqualsObjectWhenImplementingIequatableDescription
source: #N/A
de: #Nicht zutreffend
es: #N/D
pl: ND
ru: #Н/Д

# OverrideObjectEqualsObjectWhenImplementingIequatableMessage
source: Override 'Object.Equals(object)' when implementing 'IEquatable'
de: Überschreiben Sie "Object.Equals(object)" bei Implementierung von "IEquatable".
es: Reemplazar "Object.Equals(object)" al implementar "IEquatable"
fr: Substituer 'Object.Equals(object)' au moment de l'implémentation de 'IEquatable'
it: Eseguire l'override di 'Object.Equals(object)' durante l'implementazione di 'IEquatable'
ja: IEquatable' を実装するときに 'Object.Equals(object)' をオーバーライドしてください
pl: Przesłoń metodę „Object.Equals(object)” przy implementowaniu interfejsu „IEquatable”
ru: Переопределите Object.Equals(object) при реализации IEquatable
tr: 'IEquatable' uygularken 'Object.Equals(object)' özniteliğini geçersiz kılın

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsTitle
source: 'SymbolDeclaredEvent' must be generated for source symbols
de: "SymbolDeclaredEvent" muss für Quellsymbole generiert werden
es: Debe generarse "SymbolDeclaredEvent" para los símbolos de origen
fr: 'SymbolDeclaredEvent' doit être généré pour les symboles sources
it: È necessario generare 'SymbolDeclaredEvent' per i simboli di origine
ja: ソース シンボルに対して 'SymbolDeclaredEvent' を生成する必要があります
pl: Element „SymbolDeclaredEvent” musi być generowany dla symboli źródłowych
ru: Для исходных символов необходимо создать SymbolDeclaredEvent
tr: Kaynak semboller için 'SymbolDeclaredEvent' oluşturulmalıdır

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsDescription
source: Compilation event queue is required to generate symbol declared events for all declared source symbols. Hence, every source symbol type or one of its base types must generate a symbol declared event.
de: Die Warteschlange für das Kompilierungsereignis ist erforderlich, um für alle deklarierten Quellsymbole Symboldeklarationsereignisse zu generieren. Daher muss jeder Quellsymboltyp oder einer der zugehörigen Basistypen ein Symboldeklarationsereignis generieren.
es: Se requiere la cola del evento de compilación para generar eventos declarados de símbolos para todos los símbolos de origen declarados. Por lo tanto, todos los tipos de símbolos de origen de uno de sus tipos base debe generar un evento declarado de símbolos.
fr: Une file d'attente d'événements de compilation est nécessaire afin de générer les événements de déclaration de symbole pour tous les symboles sources déclarés. Ainsi, chaque type de symbole source ou l'un de ses types de base doit générer un événement de déclaration de symbole.
it: Per generare eventi dichiarati da simboli per tutti i simboli di origine dichiarati, è necessaria la coda degli eventi di compilazione. Di conseguenza ogni tipo di simbolo di origine o uno dei relativi tipi di base deve generare un evento dichiarato da simboli.
ja: すべての宣言済みソース シンボルのシンボル宣言イベントを生成するには、コンパイル イベント キューが必要です。そのため、各ソース シンボル型、またはその基本型の 1 つは、シンボル宣言イベントを生成する必要があります。
pl: Kolejka zdarzeń kompilacji jest wymagana do generowania zdarzeń deklarowanych przy użyciu symboli dla wszystkich deklarowanych symboli źródłowych. Dlatego każdy typ symbolu źródłowego lub jeden z jego typów bazowych musi generować zdarzenie deklarowane przy użyciu symbolu.
ru: Чтобы создать объявляемые символом события для всех объявленных исходных символов, нужна очередь событий компиляции. Поэтому каждый тип исходных символов или один из его базовых типов должны создавать объявляемое символом событие.
tr: Tüm bildirilen kaynak semboller için sembolle bildirilen olaylar oluşturmak üzere derleme olay kuyruğu gereklidir. Bu nedenle, her kaynak sembol türünün veya temel türlerinden birinin sembolle bildirilen bir olay oluşturması gerekir.

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsMessage
source: 'SymbolDeclaredEvent' must be generated for source symbols
de: "SymbolDeclaredEvent" muss für Quellsymbole generiert werden.
es: Debe generarse "SymbolDeclaredEvent" para los símbolos de origen
fr: 'SymbolDeclaredEvent' doit être généré pour les symboles sources
it: È necessario generare 'SymbolDeclaredEvent' per i simboli di origine
ja: ソース シンボルに対して 'SymbolDeclaredEvent' を生成する必要があります
pl: Element „SymbolDeclaredEvent” musi być generowany dla symboli źródłowych
ru: Для исходных символов необходимо создать SymbolDeclaredEvent
tr: Kaynak semboller için 'SymbolDeclaredEvent' oluşturulmalıdır

# DoNotMixAttributesFromDifferentVersionsOfMEFTitle
source: Do not mix attributes from different versions of MEF
de: Keine Attribute aus verschiedenen Versionen des MEF kombinieren
es: No se deben mezclar atributos de distintas versiones de MEF.
fr: Ne pas mélanger les attributs de différentes versions de MEF
it: Non combinare attributi di versioni diverse di MEF
ja: 複数のバージョンの MEF の属性を混用しないでください
pl: Nie mieszaj atrybutów z różnych wersji MEF
ru: Не смешивайте атрибуты из разных версий MEF
tr: Farklı MEF sürümlerine ait öznitelikleri karışık kullanmayın

# DoNotMixAttributesFromDifferentVersionsOfMEFDescription
source: Do not mix attributes from different versions of MEF.
de: Hiermit werden keine Attribute aus verschiedenen Versionen des MEF kombiniert.
es: No se deben mezclar atributos de distintas versiones de MEF.
fr: Ne mélangez pas les attributs de différentes versions de MEF.
it: Non combinare attributi di versioni diverse di MEF.
ja: 複数のバージョンの MEF の属性を混用しないでください。
pl: Nie mieszaj atrybutów z różnych wersji warstwy MEF.
ru: Не смешивайте атрибуты из разных версий MEF.
tr: Farklı MEF sürümlerindeki öznitelikleri karışık olarak kullanmayın.

# DoNotMixAttributesFromDifferentVersionsOfMEFMessage
source: Attribute '{0}' comes from a different version of MEF than the export attribute on '{1}'
de: Das Attribut "{0}" stammt aus einer anderen Version des MEF als das Exportattribut für "{1}".
es: El atributo “{0}” procede de una versión de MEF distinta a la del atributo de exportación en “{1}”.
fr: L'attribut '{0}' provient d'une autre version de MEF que l'attribut d'exportation sur '{1}'
it: L'attributo '{0}' proviene da una versione di MEF diversa rispetto all'attributo export su '{1}'
ja: 属性 '{0}' は、'{1}' のエクスポート属性とは別のバージョンの MEF の属性です
pl: Atrybut „{0}” pochodzi z innej wersji MEF niż atrybut eksportu „{1}”
ru: Атрибут "{0}" отличается версией MEF от атрибута экспорта в "{1}"
tr: '{0}' özniteliği, '{1}' üzerindeki dışarı aktarma özniteliğinden farklı bir MEF sürümüne ait

# PartsExportedWithMEFv2MustBeMarkedAsSharedTitle
source: Parts exported with MEFv2 must be marked with 'SharedAttribute'
de: Mit MEFv2 exportierte Teile müssen mit "SharedAttribute" gekennzeichnet werden
es: Las partes exportadas con MEFv2 deben marcarse con "SharedAttribute"
fr: Les parties exportées avec MEFv2 doivent être marquées avec 'SharedAttribute'
it: Le parti esportate con MEFv2 devono essere contrassegnate con 'SharedAttribute'
ja: MEFv2 でエクスポートされたパーツには 'SharedAttribute' を設定する必要があります
pl: Części wyeksportowane z warstwy MEFv2 muszą być oznaczone za pomocą atrybutu „SharedAttribute”
ru: Части, экспортированные с помощью MEF версии 2, должны быть помечены как SharedAttribute
tr: MEFv2 ile dışarı aktarılan parçalar 'SharedAttribute' ile işaretlenmelidir

# PartsExportedWithMEFv2MustBeMarkedAsSharedDescription
source: Part exported with MEFv2 must be marked with the 'SharedAttribute'.
de: Ein mit MEFv2 exportiertes Teil muss mit "SharedAttribute" gekennzeichnet werden.
es: La parte exportada con MEFv2 debe marcarse con "SharedAttribute".
fr: La partie exportée avec MEFv2 doit être marquée avec 'SharedAttribute'.
it: La parte esportata con MEFv2 deve essere contrassegnata con 'SharedAttribute'.
ja: MEFv2 でエクスポートされたパーツには 'SharedAttribute' を設定する必要があります。
pl: Część wyeksportowana z warstwy MEFv2 musi być oznaczona za pomocą atrybutu „Shared”.
ru: Часть, экспортированная с помощью MEF версии 2, должна быть помечена как SharedAttribute.
tr: MEFv2 ile dışarı aktarılan parça 'SharedAttribute' ile işaretlenmelidir.

# PartsExportedWithMEFv2MustBeMarkedAsSharedMessage
source: '{0}' is exported with MEFv2 and hence must be marked with 'SharedAttribute'
de: "{0}" wurde mit MEFv2 exportiert und muss daher mit "SharedAttribute" gekennzeichnet werden.
es: “{0}” se exporta con MEFv2 y, por lo tanto, debe marcarse con "SharedAttribute".
fr: '{0}' est exporté avec MEFv2 et doit donc être marqué avec 'SharedAttribute'
it: '{0}' viene esportato con MEFv2 e di conseguenza deve essere contrassegnato con 'SharedAttribute'
ja: '{0}' は MEFv2 でエクスポートされるため、'SharedAttribute' と設定する必要があります
pl: Element „{0}” jest eksportowany jako warstwa MEFv2, a więc musi być oznaczony za pomocą atrybutu „SharedAttribute”
ru: Часть "{0}" экспортирована с помощью MEF версии 2 и поэтому должна быть помечена как SharedAttribute
tr: '{0}', MEFv2 ile dışarı aktarıldığından 'SharedAttribute' ile işaretlenmelidir
