Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, pl, ru, tr

# DoNotCopyValueUnsupportedUseMessage
source: Unsupported use of non-copyable type '{0}' in '{1}' operation
de: Nicht unterstützte Verwendung des nicht kopierbaren Typs "{0}" im Vorgang "{1}".
es: Uso no admitido del tipo "{0}" que no se puede copiar en la operación "{1}"
fr: Utilisation non prise en charge du type '{0}' non copiable dans l'opération '{1}'
it: Uso non supportato del tipo non copiabile '{0}' nell'operazione '{1}'
ja: '{1}' 操作でコピー不可の型 '{0}' の使用はサポートされていません
pl: Nieobsługiwane użycie typu bez możliwości kopiowania „{0}” w operacji „{1}”
ru: Неподдерживаемое использование типа "{0}", не допускающего копирование, в операции "{1}"
tr: '{1}' işleminde kopyalanabilir olmayan '{0}' türünün kullanımı desteklenmiyor

# DoNotUseInterpolatedStringsWithDebugAssertCodeFix
source: Use 'RoslynDebug.Assert'.
fr: Utilisez « RoslynDebug.Assert ».
it: Usare 'RoslynDebug.Assert'.
ru: Используйте RoslynDebug.Assert.
tr: 'RoslynDebug.Assert' kullanın.

# DoNotUseInterpolatedStringsWithDebugAssertDescription
source: 'Debug.Assert' on .NET Framework eagerly creates the string value. This can cause OOMs in tests, particularly for strings that involve syntax nodes. Use 'RoslynDebug.Assert' instead, which will only create the string if required.
fr: « Debug.Assert » sur .NET Framework crée immédiatement la valeur de chaîne. Cette action peut provoquer des erreurs de mémoire insuffisante (OOM) dans les tests, notamment pour les chaînes impliquant des nœuds de syntaxe. Utilisez « RoslynDebug.Assert » à la place, qui crée uniquement la chaîne si elle est nécessaire.
it: 'Debug.Assert' in .NET Framework crea immediatamente il valore stringa. Questo può determinare errori di memoria insufficiente nei test, soprattutto per le stringhe che interessano nodi di sintassi. Usare invece 'RoslynDebug.Assert', che creerà la stringa solo se necessario.
ru: Debug.Assert в .NET Framework сразу создает строковое значение. Это может привести к нехватке памяти в тестах, особенно для строк, содержащих узлы синтаксиса. Вместо этого используйте RoslynDebug.Assert, который создает строку только при необходимости.
tr: .NET Framework'te 'Debug.Assert' gayretli bir şekilde dize değerini oluşturur. Bu, testlerde özellikle söz dizimi düğümleri içeren dizeler için bellek yetersizliği sorunlarına yol açabilir. Bunun yerine, yalnızca gerektiğinde dize oluşturan 'RoslynDebug.Assert' kullanın.

# DoNotUseInterpolatedStringsWithDebugAssertMessage
source: Do not use interpolated strings with 'Debug.Assert'. Use 'RoslynDebug.Assert' instead.
fr: N’utilisez pas de chaînes interpolées avec « Debug.Assert ». Utilisez « RoslynDebug.Assert » à la place.
it: Non usare stringhe interpolate con 'Debug.Assert'. Usare invece 'RoslynDebug.Assert'.
ru: Не используйте интерполированные строки с Debug.Assert. Вместо этого используйте RoslynDebug.Assert.
tr: 'Debug.Assert' ile ilişkilendirilmiş dizeler kullanmayın. Bunun yerine 'RoslynDebug.Assert' kullanın.

# DoNotUseInterpolatedStringsWithDebugAssertTitle
source: Do not use interpolated strings with 'Debug.Assert'
fr: Ne pas utiliser de chaînes interpolées avec « Debug.Assert »
it: Non usare stringhe interpolate con 'Debug.Assert'
ru: Не используйте интерполированные строки с Debug.Assert
tr: 'Debug.Assert' ile ilişkilendirilmiş dizeler kullanmayın

# ExportedPartsShouldHaveImportingConstructorCodeFix_ImplicitConstructor
source: Explicitly define the importing constructor
de: Importierenden Konstruktor explizit definieren
es: Definir explícitamente el constructor de importación
fr: Définir explicitement le constructeur d'importation
it: Definire esplicitamente il costruttore di importazione
ja: インポート コンストラクターを明示的に定義します
pl: Jawnie zdefiniuj konstruktor importujący
ru: Явно определите конструктор импорта.
tr: İçeri aktarma oluşturucusunu açıkça tanımlayın

# ExportedPartsShouldHaveImportingConstructorCodeFix_MissingAttribute
source: Add 'ImportingConstructor' attribute
de: Attribut "ImportingConstructor" hinzufügen
es: Agregar el atributo "ImportingConstructor"
fr: Ajouter l'attribut 'ImportingConstructor'
it: Aggiungere l'attributo 'ImportingConstructor'
ja: 'ImportingConstructor' 属性の追加
pl: Dodaj atrybut „ImportingConstructor”
ru: Добавить атрибут "ImportingConstructor"
tr: 'ImportingConstructor' özniteliği ekle

# ExportedPartsShouldHaveImportingConstructorCodeFix_NonPublicConstructor
source: Make constructor public
de: Konstruktor als öffentlich festlegen
es: Convertir el constructor en público
fr: Rendre le constructeur public
it: Impostare il costruttore come public
ja: コンストラクターを公開します
pl: Ustaw konstruktor jako publiczny
ru: Сделать конструктор открытым
tr: Oluşturucuyu genel yapın

# ExportedPartsShouldHaveImportingConstructorDescription
source: Exported parts should be marked with 'ImportingConstructorAttribute'.
de: Exportierte Teile müssen mit "ImportingConstructorAttribute" gekennzeichnet werden.
es: Las partes exportadas deben marcarse con "ImportingConstructorAttribute".
fr: Les parties exportées doivent être marquées avec 'ImportingConstructorAttribute'.
it: Le parti esportate devono essere contrassegnate con 'ImportingConstructorAttribute'.
ja: エクスポートされたパーツには 'ImportingConstructorAttribute' を設定する必要があります。
pl: Wyeksportowane części powinny być oznaczone za pomocą atrybutu „ImportingConstructorAttribute”.
ru: Экспортированные части должны быть помечены как ImportingConstructorAttribute.
tr: Dışarı aktarılan bölümler 'ImportingConstructorAttribute' ile işaretlenmelidir.

# ExportedPartsShouldHaveImportingConstructorMessage
source: '{0}' is MEF-exported and should have a single, public importing constructor of the correct form
de: „{0}“ ist MEF-exportiert und muss einen einzelnen importierenden Konstruktor der richtigen Form aufweisen.
es: '{0}' se exporta mediante MEF y debe tener un único constructor de importación público con el formato correcto
fr: '{0}' est exporté avec MEF et doit avoir un seul constructeur d'importation de la forme appropriée.
it: '{0}' è esportato da MEF e deve avere un singolo costruttore di importazione pubblico nel formato corretto
ja: '{0}' は MEF でエクスポートされており、正しい形式の単一のインポート コンストラクターが含まれている必要があります
pl: Element „{0}” jest eksportowany przez strukturę MEF i powinien mieć pojedynczy konstruktor importujący o właściwej postaci
ru: "{0}" экспортируется в MEF и должен содержать единственный общедоступный конструктор импорта правильной формы.
tr: '{0}', MEF ile dışarı aktarıldı ve doğru biçimde tek bir ortak içeri aktarma oluşturucusuna sahip olmalıdır

# ExportedPartsShouldHaveImportingConstructorTitle
source: Exported parts should have a public constructor marked with 'ImportingConstructorAttribute'
de: Exportierte Teile müssen einen öffentlichen Konstruktor aufweisen, der mit „ImportingConstructorAttribute“ markiert ist.
es: Las partes exportadas deben tener un constructor público marcado con 'ImportingConstructorAttribute'
fr: Les parties exportées doivent avoir un constructeur public marqué avec 'ImportingConstructorAttribute'.
it: Le parti esportate devono avere un costruttore pubblico contrassegnato da 'ImportingConstructorAttribute'.
ja: エクスポートされたパーツには、'ImportingConstructorAttribute' でマークされたパブリック コンストラクターが必要です
pl: Wyeksportowane części powinny mieć konstruktora publicznego oznaczonego atrybutem „ImportingConstructorAttribute”
ru: Экспортированные части должны содержать общедоступный конструктор, помеченный как "ImportingConstructorAttribute"
tr: Dışarı aktarılan bölümler 'ImportingConstructorAttribute' ile işaretlenmiş bir ortak oluşturucuya sahip olmalıdır

# ExposeMemberForTestingDescription
source: Expose member for testing.
de: Hiermit wird der Member für Tests verfügbar gemacht.
es: Expone el miembro para las pruebas.
fr: Exposez le membre à des fins de test.
it: Espone il membro per il test.
ja: テストのためにメンバーを公開します。
pl: Udostępnij składową do testowania.
ru: Предоставьте элемент для тестирования
tr: Test için üyeyi kullanıma sunun.

# ExposeMemberForTestingMessage
source: Expose member for testing
de: Member für Tests verfügbar machen
es: Exponer miembro para pruebas
fr: Exposer un membre à des fins de test
it: Esporre il membro per il test
ja: テストのためにメンバーを公開します
pl: Udostępnij element członkowski do testowania
ru: Предоставить элемент для тестирования
tr: Test için üyeyi kullanıma sunun

# ExposeMemberForTestingTitle
source: Expose member for testing
de: Member für Tests verfügbar machen
es: Exponer miembro para pruebas
fr: Exposer un membre à des fins de test
it: Esponi il membro per il test
ja: テストのためにメンバーを公開します
pl: Udostępnij element członkowski do testowania
ru: Предоставить элемент для тестирования
tr: Test için üyeyi kullanıma sunun

source: Fix numbered comments
de: Nummerierte Kommentare korrigieren
es: Corregir comentarios numerados
fr: Corriger les commentaires numérotés
it: Correggi i commenti numerati
ja: 番号付きのコメントの修正
pl: Popraw numerowane komentarze
ru: Исправление нумерованных комментариев
tr: Numaralı açıklamaları düzelt

# ImportingConstructorShouldBeObsoleteCodeFix_ErrorSetToFalse
source: Set 'ObsoleteAttribute.Error' to 'true'
de: Legen Sie "ObsoleteAttribute.Error" auf TRUE fest.
es: Establecer "ObsoleteAttribute.Error" en "true"
fr: Affectez la valeur 'true' à 'ObsoleteAttribute.Error'
it: Impostare 'ObsoleteAttribute.Error' su 'true'
ja: 'ObsoleteAttribute.Error' を 'true' に設定してください
pl: Ustaw parametr „ObsoleteAttribute.Error” na wartość „true”
ru: Присвойте ObsoleteAttribute.Error значение true
tr: 'ObsoleteAttribute.Error' özelliğini 'true' olarak ayarlayın

# ImportingConstructorShouldBeObsoleteCodeFix_IncorrectDescription
source: Use correct 'ObsoleteAttribute' message.
de: Hiermit wird die richtige Meldung "ObsoleteAttribute" verwendet.
es: Usa el mensaje "ObsoleteAttribute" correcto.
fr: Utilisez le message 'ObsoleteAttribute' approprié.
it: Usare il messaggio 'ObsoleteAttribute' corretto.
ja: 正しい 'ObsoleteAttribute' メッセージを使用します。
pl: Użyj poprawnego komunikatu „ObsoleteAttribute”.
ru: Используйте правильное сообщение ObsoleteAttribute.
tr: Doğru 'ObsoleteAttribute' iletisini kullanın.

# ImportingConstructorShouldBeObsoleteCodeFix_MissingAttribute
source: Add 'ObsoleteAttribute'
de: "ObsoleteAttribute" hinzufügen
es: Agregar "ObsoleteAttribute"
fr: Ajouter 'ObsoleteAttribute'
it: Aggiungere 'ObsoleteAttribute'
ja: 'ObsoleteAttribute' の追加
pl: Dodaj atrybut „ObsoleteAttribute”
ru: Добавьте ObsoleteAttribute
tr: 'ObsoleteAttribute' ekle

# ImportingConstructorShouldBeObsoleteCodeFix_MissingDescription
source: Configure 'ObsoleteAttribute' for importing constructor.
de: Hiermit wird "ObsoleteAttribute" für den importierenden Konstruktor konfiguriert.
es: Configura "ObsoleteAttribute" para el constructor de importación.
fr: Configurez 'ObsoleteAttribute' pour le constructeur d'importation.
it: Configurare 'ObsoleteAttribute' per il costruttore di importazione.
ja: インポート コンストラクターの 'ObsoleteAttribute' を構成します。
pl: Skonfiguruj atrybut „ObsoleteAttribute” dla konstruktora importującego.
ru: Настройте ObsoleteAttribute для конструктора импорта.
tr: İçeri aktarma oluşturucusu için 'ObsoleteAttribute' özniteliğini yapılandırın.

# ImportingConstructorShouldBeObsoleteCodeFix_MissingError
source: Set 'ObsoleteAttribute.Error' to 'true'
de: Legen Sie "ObsoleteAttribute.Error" auf TRUE fest.
es: Establecer "ObsoleteAttribute.Error" en "true"
fr: Affectez la valeur 'true' à 'ObsoleteAttribute.Error'
it: Impostare 'ObsoleteAttribute.Error' su 'true'
ja: 'ObsoleteAttribute.Error' を 'true' に設定してください
pl: Ustaw parametr „ObsoleteAttribute.Error” na wartość „true”
ru: Присвойте ObsoleteAttribute.Error значение true
tr: 'ObsoleteAttribute.Error' özelliğini 'true' olarak ayarlayın

# ImportingConstructorShouldBeObsoleteDescription
source: Importing constructor should be marked with 'ObsoleteAttribute'.
de: Der importierende Konstruktor muss mit "ObsoleteAttribute" gekennzeichnet werden.
es: El constructor de importación debe marcarse con "ObsoleteAttribute".
fr: Le constructeur d'importation doit être marqué avec 'ObsoleteAttribute'.
it: Il costruttore di importazione deve essere contrassegnato con 'ObsoleteAttribute'.
ja: インポート コンストラクターには 'ObsoleteAttribute' を設定する必要があります。
pl: Konstruktor importu powinien być oznaczony za pomocą atrybutu „ObsoleteAttribute”.
ru: Конструктор импорта должен быть помечен как ObsoleteAttribute.
tr: İçeri aktarma oluşturucusunun 'ObsoleteAttribute' ile işaretlenmesi gerekir.

# ImportingConstructorShouldBeObsoleteMessage
source: Importing constructor should be marked with 'ObsoleteAttribute'
de: Der importierende Konstruktor muss mit "ObsoleteAttribute" gekennzeichnet werden.
es: El constructor de importación debe marcarse con "ObsoleteAttribute"
fr: Le constructeur d'importation doit être marqué avec 'ObsoleteAttribute'
it: Il costruttore di importazione deve essere contrassegnato con 'ObsoleteAttribute'
ja: インポート コンストラクターには 'ObsoleteAttribute' を設定する必要があります
pl: Konstruktor importu powinien być oznaczony atrybutem „ObsoleteAttribute”
ru: Конструктор импорта должен быть помечен как ObsoleteAttribute
tr: İçeri aktarma oluşturucusunun 'ObsoleteAttribute' ile işaretlenmesi gerekir

# ImportingConstructorShouldBeObsoleteTitle
source: Importing constructor should be marked with 'ObsoleteAttribute'
de: Importierender Konstruktor muss mit "ObsoleteAttribute" gekennzeichnet werden
es: El constructor de importación debe marcarse con "ObsoleteAttribute"
fr: Le constructeur d'importation doit être marqué avec 'ObsoleteAttribute'
it: Il costruttore di importazione deve essere contrassegnato con 'ObsoleteAttribute'
ja: インポート コンストラクターには 'ObsoleteAttribute' を設定する必要があります
pl: Konstruktor importu powinien być oznaczony atrybutem „ObsoleteAttribute”
ru: Конструктор импорта должен быть помечен как ObsoleteAttribute
tr: İçeri aktarma oluşturucusunun 'ObsoleteAttribute' ile işaretlenmesi gerekir

source: Place statement on following line
de: Anweisung in folgender Zeile platzieren
es: Instrucción de colocación en la línea siguiente
fr: Placer l'instruction sur la ligne suivante
it: Inserire l'istruzione nella riga seguente
ja: 次の行にステートメントを配置する
pl: Umieść instrukcję w następnym wierszu
ru: Размещайте оператор на отдельной строке
tr: Aşağıdaki satıra ifadeyi yerleştirin

# NamedTypeFullNameNotNullSuppressorJustification
source: The 'Type.FullName' property is never null when using the syntax 'typeof(T).FullName'
de: Die Type.FullName-Eigenschaft ist bei Verwendung der Syntax "typeof(T).FullName" nie NULL.
es: La propiedad "Type.FullName" nunca es NULL cuando se usa la sintaxis "typeof(T).FullName"
fr: La propriété 'Type.FullName' n'a jamais de valeur null quand la syntaxe 'typeof(T).FullName' est utilisée
it: La proprietà 'Type.FullName' non è mai Null quando si usa la sintassi 'typeof(T).FullName'
ja: 構文 'typeof(T).FullName' を使用している場合、'Type.FullName' プロパティが null になることはありません
pl: Właściwość „Type.FullName” nigdy nie ma wartości null, gdy jest używana składnia „typeof(T).FullName”
ru: Свойство "Type.FullName" не может иметь значение null при использовании синтаксиса "typeof(T).FullName".
tr: 'typeof(T).FullName' söz dizimi kullanılırken 'Type.FullName' özelliği hiçbir zaman null olmaz.

# PreferNullLiteralCodeFix
source: Use 'null' instead of 'default'
de: "null" anstelle von "default" verwenden
es: Usar "null" en lugar de "default"
fr: Utilisez 'null' à la place de 'default'
it: Usare 'null' invece di 'default'
ja: 'default' の代わりに 'null' を使用する
pl: Użyj wartości „null” zamiast „default”
ru: Используйте "null" вместо "default".
tr: 'default' yerine 'null' kullanın

# PreferNullLiteralDescription
source: Use 'null' instead of 'default' for nullable types.
de: Verwenden Sie für Nullable-Typen "null" anstelle von "default".
es: Use "null" en lugar de "default" para los tipos que aceptan valores NULL.
fr: Utilisez 'null' à la place de 'default' pour les types Nullable.
it: Usare 'null' invece di 'default' per i tipi nullable.
ja: Null 許容型には、'default' の代わりに 'null' を使用してください。
pl: Użyj wartości „null” zamiast „default” dla typów dopuszczających wartość null.
ru: Используйте "null" вместо "default" для типов, допускающих значение NULL.
tr: Başvuru türleri için 'default' yerine 'null' kullanın.

# PreferNullLiteralMessage
source: Use 'null' instead of 'default' for nullable types
de: Für Nullable-Typen "null" anstelle von "default" verwenden
es: Usar "null" en lugar de "default" para los tipos que aceptan valores NULL
fr: Utiliser 'null' à la place de 'default' pour les types Nullable
it: Usare 'null' invece di 'default' per i tipi nullable
ja: Null 許容型には、'default' の代わりに 'null' をお使いください
pl: Użyj wartości „null” zamiast „default” dla typów dopuszczających wartość null
ru: Используйте "null" вместо "default" для типов, допускающих значение NULL.
tr: Başvuru türleri için 'default' yerine 'null' kullan

# PreferNullLiteralTitle
source: Prefer null literal
de: NULL-Literal bevorzugen
es: Preferir literal NULL
fr: Préférez un littéral ayant une valeur null
it: Preferire il valore letterale Null
ja: null リテラルを優先
pl: Preferuj literał o wartości null
ru: Используйте литерал null
tr: Null sabit değerini tercih et

# RelaxTestNamingSuppressorJustification
source: Asynchronous test methods do not require the 'Async' suffix
de: Für asynchrone Testmethoden ist das Suffix "Async" nicht erforderlich.
es: Los métodos de prueba asincrónicos no requieren el sufijo "Async".
fr: Les méthodes de test asynchrones ne nécessitent pas le suffixe 'Async'
it: I metodi di test asincroni non richiedono il suffisso 'Async'
ja: 非同期テスト メソッドには 'Async' サフィックスは不要です
pl: Asynchroniczne metody testowe nie wymagają sufiksu „Async”
ru: Асинхронные методы теста не требуют суффикса Async
tr: Asenkron test metotları için 'Async' soneki gerekmez

source: Run iterations
de: Iterationen ausführen
es: Ejecutar iteraciones
fr: Exécuter les itérations
it: Eseguire iterazioni
ja: イテレーションの実行
pl: Uruchom iteracje
ru: Выполнить итерации
tr: Yinelemeleri çalıştır

# TemporaryArrayAsRefDescription
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable.
de: Die Instanz von TemporaryArray<T>.AsRef() muss eine using-Variable sein.
es: La instancia de TemporaryArray<T>.AsRef() debe ser una variable "using".
fr: L'instance de TemporaryArray<T>.AsRef() doit être une variable 'using'.
it: L'istanza di TemporaryArray<T>.AsRef() deve essere una variabile 'using'.
ja: TemporaryArray<T>.AsRef() のインスタンスは 'using' 変数でなければなりません。
pl: Wystąpienie elementu TemporaryArray<T>.AsRef() musi być zmienną „using”.
ru: Экземпляр TemporaryArray<T>.AsRef() должен представлять собой переменную "using".
tr: TemporaryArray<T>.AsRef() örneği bir 'using' değişkeni olmalıdır.

# TemporaryArrayAsRefMessage
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable
de: Instanz von TemporaryArray<T>.AsRef() muss eine using-Variable sein
es: La instancia de TemporaryArray<T>.AsRef() debe ser una variable "using"
fr: L'instance de TemporaryArray<T>.AsRef() doit être une variable 'using'
it: L'istanza di TemporaryArray<T>.AsRef() deve essere una variabile 'using'
ja: TemporaryArray<T>.AsRef() のインスタンスは 'using' 変数でなければなりません
pl: Wystąpienie elementu TemporaryArray<T>.AsRef() musi być zmienną „using”
ru: Экземпляр TemporaryArray<T>.AsRef() должен представлять собой переменную "using".
tr: TemporaryArray<T>.AsRef() örneği bir 'using' değişkeni olmalıdır

# TemporaryArrayAsRefTitle
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable
de: Instanz von TemporaryArray<T>.AsRef() muss eine using-Variable sein
es: La instancia de TemporaryArray<T>.AsRef() debe ser una variable "using"
fr: L'instance de TemporaryArray<T>.AsRef() doit être une variable 'using'
it: L'istanza di TemporaryArray<T>.AsRef() deve essere una variabile 'using'
ja: TemporaryArray<T>.AsRef() のインスタンスは 'using' 変数でなければなりません
pl: Wystąpienie elementu TemporaryArray<T>.AsRef() musi być zmienną „using”
ru: Экземпляр TemporaryArray<T>.AsRef() должен представлять собой переменную "using".
tr: TemporaryArray<T>.AsRef() örneği bir 'using' değişkeni olmalıdır

# TestExportsShouldNotBeDiscoverableCodeFix
source: Apply 'PartNotDiscoverableAttribute'
de: "PartNotDiscoverableAttribute" anwenden
es: Aplicar "PartNotDiscoverableAttribute"
fr: Appliquer 'PartNotDiscoverableAttribute'
it: Applicare 'PartNotDiscoverableAttribute'
ja: 'PartNotDiscoverableAttribute' を適用します
pl: Zastosuj atrybut „PartNotDiscoverableAttribute”
ru: Применить PartNotDiscoverableAttribute
tr: 'PartNotDiscoverableAttribute' uygulayın

# TestExportsShouldNotBeDiscoverableDescription
source: Test exports should not be discoverable.
de: Testexporte dürfen nicht ermittelbar sein.
es: Las exportaciones de prueba no deben poder detectarse.
fr: Les exportations de test ne doivent pas être détectables.
it: Le esportazioni di test non devono essere individuabili.
ja: テスト エクスポートは検出可能であってはなりません。
pl: Odnajdywanie eksportów testowych nie powinno być możliwe.
ru: Тестовые экспорты не должны быть доступными для обнаружения.
tr: Test dışarı aktarmaları bulunabilir olmamalıdır.

# TestExportsShouldNotBeDiscoverableMessage
source: '{0}' is exported for test purposes and should be marked with 'PartNotDiscoverableAttribute'
de: "{0}" wird zu Testzwecken exportiert und muss mit "PartNotDiscoverableAttribute" gekennzeichnet werden.
es: "{0}" se exporta con fines de prueba y debe marcarse con "PartNotDiscoverableAttribute".
fr: '{0}' est exporté à des fins de test et doit être marqué avec 'PartNotDiscoverableAttribute'
it: '{0}' viene esportato a scopo di test e deve essere contrassegnato con 'PartNotDiscoverableAttribute'
ja: '{0}' はテスト用にエクスポートされており、'PartNotDiscoverableAttribute' と設定する必要があります
pl: Element „{0}” jest eksportowany do celów testowych i powinien być oznaczony za pomocą atrybutu „PartNotDiscoverableAttribute”
ru: "{0}" экспортируется в целях тестирования и должен быть помечен как PartNotDiscoverableAttribute
tr: '{0}', test amaçları doğrultusunda dışarı aktarıldığından 'PartNotDiscoverableAttribute' ile işaretlenmelidir

# TestExportsShouldNotBeDiscoverableTitle
source: Test exports should not be discoverable
de: Testexporte dürfen nicht ermittelbar sein
es: Las exportaciones de prueba no deben poder detectarse
fr: Les exportations de test ne doivent pas être découvrables
it: Le esportazioni di test non devono essere individuabili
ja: テスト エクスポートは検出可能であってはなりません
pl: Odnajdywanie eksportów testowych nie powinno być możliwe
ru: Тестовые экспорты не должны быть доступными для обнаружения
tr: Test dışarı aktarmaları bulunabilir olmamalıdır

# UseSpecializedCollectionsEmptyEnumerableTitle
source: Use 'SpecializedCollections.EmptyEnumerable()'
de: "SpecializedCollections.EmptyEnumerable()" verwenden
es: Usar "SpecializedCollections.EmptyEnumerable()"
fr: Utiliser 'SpecializedCollections.EmptyEnumerable()'
it: Usare 'SpecializedCollections.EmptyEnumerable()'
ja: 'SpecializedCollections.EmptyEnumerable()' を使用します
pl: Użyj metody „SpecializedCollections.EmptyEnumerable()”
ru: Используйте SpecializedCollections.EmptyEnumerable()
tr: 'SpecializedCollections.EmptyEnumerable()' kullanın

# UseSpecializedCollectionsEmptyEnumerableDescription
source: #N/A
de: #Nicht zutreffend
es: #N/D
pl: ND
ru: #Н/Д

# UseSpecializedCollectionsEmptyEnumerableMessage
source: Use 'SpecializedCollections.EmptyEnumerable()'
de: Verwenden Sie "SpecializedCollections.EmptyEnumerable()".
es: Usar "SpecializedCollections.EmptyEnumerable()"
fr: Utiliser 'SpecializedCollections.EmptyEnumerable()'
it: Usare 'SpecializedCollections.EmptyEnumerable()'
ja: 'SpecializedCollections.EmptyEnumerable()' を使用します
pl: Użyj metody „SpecializedCollections.EmptyEnumerable()”
ru: Используйте SpecializedCollections.EmptyEnumerable()
tr: 'SpecializedCollections.EmptyEnumerable()' kullanın
