Repository: dotnet/roslyn
Catalog: src/RoslynAnalyzers/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: de, es, fr, it, ja, pl, ru, tr

source: Add 'Shared' attribute
de: Attribut "Shared" hinzufügen
es: Agregar el atributo "Shared"
fr: Ajouter l'attribut 'Shared'
it: Aggiungere l'attributo 'Shared'
ja: 'Shared' 属性の追加
pl: Dodaj atrybut „Shared”
ru: Добавить атрибут "Shared"
tr: 'Shared' özniteliği ekleme

source: Apply trait to containing type
de: Merkmal auf enthaltenden Typ anwenden
es: Aplicar rasgo al tipo contenedor
fr: Appliquer la caractéristique au type conteneur
it: Applicare la caratteristica al tipo contenitore
ja: 包含する側の型に特性を適用する
pl: Zastosuj cechę do typu zawierającego
ru: Применить признак к содержащему типу
tr: İçeren türe özellik uygulama

# AvoidOptSuffixForNullableEnableCodeCodeFixTitle
source: Remove the 'Opt' suffix
de: Suffix "Opt" entfernen
es: Quitar el sufijo "Opt"
fr: Supprimer le suffixe 'Opt'
it: Rimuovere il suffisso 'Opt'
ja: 'Opt' サフィックスの削除
pl: Usuń sufiks „Opt”
ru: Удалите суффикс "Opt"
tr: 'Opt' sonekini kaldır

# AvoidOptSuffixForNullableEnableCodeDescription
source: Avoid the 'Opt' suffix in a nullable-enabled code.
de: Hiermit wird das Suffix "Opt" in einem Code vermieden, der NULL-Werte zulässt.
es: Evite el sufijo "Opt" en un código que admita valores NULL.
fr: Évitez le suffixe 'Opt' dans du code pouvant accepter des valeurs null.
it: Evitare il suffisso 'Opt' in codice abilitato per i valori Null.
ja: null 許容型のコードでは 'Opt' サフィックスを使用しないでください。
pl: Unikaj sufiksu „Opt” w kodzie z możliwością nullowania.
ru: Не используйте суффикс "Opt" в коде, допускающем значения null.
tr: Null atanabilir özellikli bir kodda 'Opt' sonekinden kaçının.

# AvoidOptSuffixForNullableEnableCodeMessage
source: Avoid the 'Opt' suffix in a nullable-enabled code
de: Vermeiden Sie das Suffix "Opt" in einem Code, der NULL-Werte zulässt.
es: Evitar el sufijo "Opt" en un código que admita valores NULL
fr: Éviter le suffixe 'Opt' dans du code pouvant accepter des valeurs null
it: Evitare il suffisso 'Opt' in codice abilitato per i valori Null
ja: null 許容型のコードでは 'Opt' サフィックスを使用しません
pl: Unikaj sufiksu „Opt” w kodzie z możliwością nullowania
ru: Не используйте суффикс "Opt" в коде, допускающем значения null.
tr: Null atanabilir özellikli bir kodda 'Opt' sonekinden kaçının

# AvoidOptSuffixForNullableEnableCodeTitle
source: Avoid the 'Opt' suffix
de: Suffix "Opt" vermeiden
es: Evitar el sufijo "Opt"
fr: Éviter le suffixe 'Opt'
it: Evitare il suffisso 'Opt'
ja: 'Opt' サフィックスを使用しない
pl: Unikaj sufiksu „Opt”
ru: Не используйте суффикс "Opt"
tr: 'Opt' sonekinden kaçının

# CreateTestAccessorDescription
source: This is a refactoring which simplifies the process of creating test accessors using the 'TestAccessor' pattern.
de: Dies ist ein Refactoring, das den Prozess zum Erstellen von Testzugriffsmethoden mithilfe des Musters "TestAccessor" vereinfacht.
es: Esta es una refactorización que simplifica el proceso de creación de descriptores de acceso de pruebas con el patrón "TestAccessor".
fr: Il s'agit d'une refactorisation qui simplifie le processus de création d'accesseurs de test à l'aide du modèle 'TestAccessor'.
it: Si tratta di un refactoring che semplifica il processo di creazione delle funzioni di accesso ai test con il criterio 'TestAccessor'.
ja: これは、'TestAccessor' パターンを使用してテスト アクセサーを作成するプロセスを簡略化するリファクタリングです。
pl: Jest to refaktoryzacja upraszczająca proces tworzenia testowych metod dostępu przy użyciu wzorca „TestAccessor”
ru: Это рефакторинг, который упрощает процесс создания методов доступа к тесту с помощью шаблона TestAccessor.
tr: Bu, 'TestAccessor' desenini kullanarak test erişimcileri oluşturma işlemini basitleştiren bir yeniden düzenlemedir.

# CreateTestAccessorMessage
source: Create test accessor
de: Testzugriffsmethode erstellen
es: Crear un descriptor de acceso de prueba
fr: Créer un accesseur de test
it: Creare la funzione di accesso di test
ja: テスト アクセサーの作成
pl: Utwórz testową metodę dostępu
ru: Создать метод доступа к тесту
tr: Test erişimcisi oluştur

# CreateTestAccessorTitle
source: Create test accessor
de: Testzugriffsmethode erstellen
es: Crear un descriptor de acceso de prueba
fr: Créer un accesseur de test
it: Crea funzione di accesso di test
ja: テスト アクセサーの作成
pl: Utwórz testową metodę dostępu
ru: Создать метод доступа к тесту
tr: Test erişimcisi oluştur

# DefaultableTypeShouldHaveDefaultableFieldsDescription
source: Defaultable types should have defaultable fields.
de: Typen, für die ein Standardwert verfügbar ist, müssen auf den Standardwert festlegbare Felder aufweisen.
es: Los tipos que aceptan valores predeterminados deben tener campos que también los acepten.
fr: Les types par défaut doivent avoir des champs par défaut.
it: I tipi per cui è disponibile un valore predefinito devono avere campi per cui è disponibile un valore predefinito.
ja: 既定値を使用可能な型には、既定に設定可能なフィールドが必要です。
pl: Typy dopuszczające wartość domyślną powinny mieć pola z wartościami domyślnymi.
ru: Типы, для которых имеются значения по умолчанию, должны иметь соответствующие поля.
tr: Varsayılan değer atanabilir türler, varsayılan değer atanabilir alanlara sahip olmalıdır.

# DefaultableTypeShouldHaveDefaultableFieldsMessage
source: Defaultable type '{0}' has a non-defaultable field or auto-property '{1}'
de: Der den Standard festlegbare Typ "{0}" weist ein nicht auf den Standard festlegbares Feld oder die automatische Eigenschaft "{1}" auf.
es: El tipo "{0}" defaultable tiene un campo que no es defaultable o la propiedad automática "{1}"
fr: Le type par défaut '{0}' a un champ sans valeur par défaut ou une propriété automatique '{1}'
it: Il tipo defaultable '{0}' ha un campo non defaultable o la proprietà automatica '{1}'
ja: 既定に設定可能な型 '{0}' に、既定に設定できないフィールドまたは自動プロパティ '{1}' が含まれています
pl: Typ „{0}” dopuszczający wartość domyślną ma pole niedopuszczające wartości domyślnej lub automatyczną właściwość „{1}”
ru: Тип "{0}", допускающий значения по умолчанию, имеет поле, не допускающее значений по умолчанию, или автоматическое свойство "{1}".
tr: Varsayılan değer atanabilir '{0}' türü, varsayılan değer atanamayan alana veya otomatik '{1}' özelliğine sahip

# DefaultableTypeShouldHaveDefaultableFieldsTitle
source: Defaultable types should have defaultable fields
de: Auf den Standard festlegbare Typen müssen auf den Standard festlegbare Felder aufweisen.
es: Los tipos defaultable deben tener campos defaultable
fr: Les types par défaut doivent avoir des champs par défaut
it: I tipi defaultable devono avere campi defaultable
ja: 既定に設定可能な型には、既定に設定可能なフィールドが必要です
pl: Typy dopuszczające wartość domyślną powinny mieć pola z wartościami domyślnymi
ru: Типы, допускающие значения по умолчанию, должны иметь соответствующие поля
tr: Varsayılan değer atanabilir türler varsayılan değer atanabilir alanlara sahip olmalıdır

# DoNotCallGetTestAccessorDescription
source: 'GetTestAccessor()' is a helper method reserved for testing. Production code must not call this member.
de: "GetTestAccessor()" ist eine für Tests reservierte Hilfsmethode. Der Produktionscode darf diesen Member nicht aufrufen.
es: "GetTestAccessor()" es un método auxiliar reservado para las pruebas. El código de producción no debe llamar a este miembro.
fr: 'GetTestAccessor()' est une méthode d'assistance réservée aux tests. Le code de production ne doit pas appeler ce membre.
it: 'GetTestAccessor()' è un metodo helper riservato per il test. Il codice di produzione non deve chiamare questo membro.
ja: 'GetTestAccessor()' は、テスト用に予約されているヘルパー メソッドです。運用コードでこのメンバーを呼び出さないでください。
pl: „GetTestAccessor()” to metoda pomocnicza zarezerwowana do testowania. Kod produkcyjny nie może wywoływać tej składowej.
ru: GetTestAccessor() — это вспомогательный метод, используемый только для тестирования. Не вызывайте этот метод из рабочего кода.
tr: 'GetTestAccessor()', test için ayrılmış bir yardımcı metottur. Üretim kodu bu üyeyi çağırmamalıdır.

# DoNotCallGetTestAccessorMessage
source: Do not call 'GetTestAccessor()' from production code
de: Rufen Sie "GetTestAccessor()" nicht über den Produktionscode auf.
es: No llamar a "GetTestAccessor()" desde el código de producción
fr: N'appelez pas 'GetTestAccessor()' à partir du code de production
it: Non chiamare 'GetTestAccessor()' dal codice di produzione
ja: 'GetTestAccessor()' を運用コードから呼び出さないでください
pl: Nie wywołuj metody „GetTestAccessor()” z kodu produkcyjnego
ru: Не вызывайте метод GetTestAccessor() из рабочего кода
tr: Üretim kodundan 'GetTestAccessor()' metodunu çağırmayın

# DoNotCallGetTestAccessorTitle
source: Do not call 'GetTestAccessor()'
de: "GetTestAccessor()" nicht aufrufen
es: No llamar a "GetTestAccessor()"
fr: Ne pas appeler 'GetTestAccessor()'
it: Non chiamare 'GetTestAccessor()'
ja: 'GetTestAccessor()' を呼び出さないでください
pl: Nie wywołuj metody „GetTestAccessor()”
ru: Не вызывайте метод GetTestAccessor()
tr: 'GetTestAccessor()' metodunu çağırmayın

# DoNotCapturePrimaryConstructorParametersDescription
source: Primary constructor parameters should not be implicitly captured. Manually assign them to fields at the start of the type.
de: Primäre Konstruktorparameter sollten nicht implizit erfasst werden. Weisen Sie sie Feldern am Anfang des Typs manuell zu.
es: Los parámetros del constructor principal no deben capturarse implícitamente. Asígnelos manualmente a campos al principio del tipo.
fr: Les paramètres du constructeur principal ne doivent pas être capturés implicitement. Affectez-les manuellement aux champs au début du type.
it: I parametri del costruttore primario non devono essere acquisiti in modo implicito. Assegnarli manualmente ai campi all'inizio del tipo.
ja: プライマリ コンストラクター パラメーターを暗黙的にキャプチャしてはいけません。型の先頭にあるフィールドに手動で割り当てます。
pl: Podstawowe parametry konstruktora nie powinny być przechwytywane niejawnie. Przypisz je ręcznie do pól na początku typu.
ru: Параметры первичного конструктора не должны записываться неявным образом. Вручную назначьте их полям в начале типа.
tr: Birincil oluşturucu parametreleri örtük olarak yakalanmamalıdır. Bunları türün başındaki alanlara el ile atayın.

# DoNotCapturePrimaryConstructorParametersMessage
source: Primary constructor parameter '{0}' should not be implicitly captured
de: Der primäre Konstruktorparameter „{0}“ sollte nicht implizit erfasst werden.
es: El parámetro de constructor principal "{0}" no se debe capturar implícitamente
fr: Le paramètre de constructeur principal '{0}' ne doit pas être capturé implicitement
it: Il parametro del costruttore primario "{0}" non deve essere acquisito in modo implicito
ja: プライマリ コンストラクター パラメーター '{0}' を暗黙的にキャプチャすることはできません
pl: Podstawowy parametr konstruktora „{0}” nie powinien być przechwytywany niejawnie
ru: Параметр первичного конструктора "{0}" не должен записываться неявным образом
tr: Birincil oluşturucu parametre '{0}' örtük olarak yakalanmamalıdır

# DoNotCapturePrimaryConstructorParametersTitle
source: Do not capture primary constructor parameters
de: Primäre Konstruktorparameter nicht erfassen
es: No capturar parámetros del constructor principal
fr: Ne pas capturer les paramètres du constructeur principal
it: Non acquisire parametri del costruttore primario
ja: プライマリ コンストラクター パラメーターをキャプチャしない
pl: Nie przechwytuj parametrów konstruktora podstawowego
ru: Не записывать параметры первичного конструктора
tr: Birincil oluşturucu parametrelerini yakalama

# DoNotCopyValueAvoidNullableWrapperDescription
source: Avoid nullable wrapper.
de: Hiermit wird der Nullable-Wrapper vermieden.
es: Evita un contenedor que acepte valores NULL.
fr: Évitez le wrapper nullable.
it: Evitare il wrapper nullable.
ja: Null 許容ラッパーを回避します。
pl: Unikaj otoki dopuszczającej wartość null.
ru: Избегайте программы-оболочки, допускающей значение NULL.
tr: Null atanabilir sarmalayıcıdan kaçının.

# DoNotCopyValueAvoidNullableWrapperMessage
source: Do not wrap non-copyable type '{0}' in '{1}' operation
de: Umschließen Sie den nicht kopierbaren Typ "{0}" nicht im Vorgang "{1}".
es: No ajustar el tipo "{0}" que no se puede copiar en la operación "{1}"
fr: Ne pas inclure dans un wrapper le type '{0}' non copiable dans l'opération '{1}'
it: Non eseguire il wrapping del tipo non copiabile '{0}' nell'operazione '{1}'
ja: '{1}' 操作でコピー不可の型 '{0}' をラップしないでください
pl: Nie opakowuj typu bez możliwości kopiowania „{0}” w operacji „{1}”
ru: Не переносите в операцию "{1}" тип "{0}", не допускающий копирование.
tr: '{1}' işleminde kopyalanabilir olmayan '{0}' türünü sarmalamayın

# DoNotCopyValueDescription
source: Do not copy value.
de: Hiermit wird der Wert nicht kopiert.
es: No se copia el valor.
fr: Ne copiez pas de valeur.
it: Non copiare il valore.
ja: 値をコピーしないでください。
pl: Nie kopiuj wartości.
ru: Не копируйте значение.
tr: Değeri kopyalamayın.

# DoNotCopyValueMessage
source: Do not copy value
de: Wert nicht kopieren
es: No copiar el valor
fr: Ne pas copier la valeur
it: Non copiare il valore
ja: 値をコピーしないでください
pl: Nie kopiuj wartości
ru: Не копировать значение
tr: Değeri kopyalamayın

# DoNotCopyValueNoAssignValueFromReferenceDescription
source: Cannot assign a value from a reference to a non-copyable type.
de: Es ist nicht möglich, einen Wert aus einem Verweis einem nicht kopierbaren Typ zuzuweisen.
es: No se puede asignar un valor de una referencia a un tipo que no se puede copiar.
fr: Impossible d'affecter une valeur à partir d'une référence à un type non copiable.
it: Non è possibile assegnare un valore da un riferimento a un tipo non copiabile.
ja: 参照からコピー不可の型に値を割り当てることはできません。
pl: Nie można przypisać wartości z odwołania do typu bez możliwości kopiowania.
ru: Невозможно присвоить значение из ссылки типу, который не может быть скопирован.
tr: Kopyalanamayan türe yönelik bir başvurudan değer atanamaz.

# DoNotCopyValueNoAssignValueFromReferenceMessage
source: Cannot assign a value from a reference to non-copyable type '{0}'
de: Ein Wert kann aus einem Verweis kann dem nicht kopierbaren Typ "{0}" nicht zugewiesen werden.
es: No se puede asignar un valor de una referencia a un tipo "{0}" que no se puede copiar.
fr: Impossible d'affecter une valeur à partir d'une référence au type non copiable '{0}'
it: Non è possibile assegnare un valore da un riferimento al tipo non copiabile '{0}'
ja: 参照からコピー不可の型 '{0}' に値を割り当てることはできません
pl: Nie można przypisać wartości z odwołania do typu bez możliwości kopiowania „{0}”
ru: Невозможно присвоить значение из ссылки типу "{0}", который не может быть скопирован
tr: '{0}' kopyalanamayan türüne yönelik bir başvurudan değer atanamaz

# DoNotCopyValueNoAutoPropertyDescription
source: Auto-properties always copy values, so they cannot be declared with non-copyable types.
de: Automatische Eigenschaften kopieren immer Werte und können daher nicht mit nicht kopierbaren Typen deklariert werden.
es: Las propiedades automáticas siempre copian los valores, por lo que no pueden declararse con tipos que no se puedan copiar.
fr: Les propriétés automatiques copient toujours les valeurs, elles ne peuvent donc pas être déclarées avec des types non copiables.
it: Le proprietà automatiche copiano sempre i valori, quindi non possono essere dichiarate con tipi non copiabili.
ja: 自動プロパティでは常に値がコピーされるため、コピー不可の型を使用して宣言することはできません。
pl: Właściwości automatyczne zawsze kopiują wartości, więc nie można ich zadeklarować z typami bez możliwości kopiowania.
ru: Автоматические свойства всегда копируют значения, поэтому их нельзя объявлять с типами, не допускающими копирование.
tr: Otomatik özellikler her zaman değerleri kopyalar, bu nedenle kopyalanabilir olmayan türlerle bildirilemez.

# DoNotCopyValueNoAutoPropertyMessage
source: Auto-property '{1}' cannot have non-copyable type '{0}'
de: Die automatische Eigenschaft "{1}" darf nicht den nicht kopierbaren Typ "{0}" aufweisen.
es: La propiedad automática "{1}" no puede tener el tipo "{0}" que no se puede copiar.
fr: La propriété automatique '{1}' ne peut pas avoir le type non copiable '{0}'
it: La proprietà automatica '{1}' non può includere il tipo non copiabile '{0}'
ja: 自動プロパティ '{1}' にコピー不可の型 '{0}' を指定することはできません
pl: Właściwość automatyczna „{1}” nie może mieć typu bez możliwości kopiowania „{0}”
ru: Автоматическое свойство "{1}" не может иметь тип "{0}", не допускающий копирование.
tr: '{1}' otomatik özelliği kopyalanabilir olmayan '{0}' türüne sahip olamaz

# DoNotCopyValueNoBoxingDescription
source: Do not box non-copyable value types.
de: Für nicht kopierbare Werttypen darf kein Boxing ausgeführt werden.
es: No aplique conversión boxing a los tipos de valores que no se pueden copiar.
fr: N'effectue pas de conversion boxing des types valeur non copiables.
it: Non eseguire la conversione boxing di tipi valore non copiabili.
ja: コピー不可の値の型をボックス化しません。
pl: Nie opakowuj typów wartości bez możliwości kopiowania.
ru: Не упаковывайте типы значений, не допускающие копирование.
tr: Kopyalanabilir olmayan değer türlerini kutuya eklemeyin.

# DoNotCopyValueNoBoxingMessage
source: Do not box non-copyable type '{0}'
de: Für den nicht kopierbaren Typ "{0}" darf kein Boxing ausgeführt werden.
es: No aplicar conversión boxing al tipo "{0}" que no se puede copiar
fr: Ne pas effectuer de conversion boxing du type non copiable '{0}'
it: Non eseguire la conversione boxing del tipo non copiabile '{0}'
ja: コピー不可の型 '{0}' をボックス化しないでください
pl: Nie opakowuj typu bez możliwości kopiowania „{0}”
ru: Не следует упаковывать тип "{0}", не допускающий копирование.
tr: Kopyalanabilir olmayan '{0}' türünü kutuya eklemeyin

# DoNotCopyValueNoFieldOfCopyableTypeDescription
source: A field with a non-copyable type cannot be a member of a copyable type. The containing type can be made non-copyable or converted to a reference type, or the field can be removed or converted to a copyable type.
de: Ein Feld mit einem nicht kopierbaren Typ kann kein Member eines kopierbaren Typs sein. Der enthaltende Typ kann als nicht kopierbar festgelegt oder in einen Verweistyp konvertiert werden, oder das Feld kann entfernt oder in einen kopierbaren Typ konvertiert werden.
es: Un campo con un tipo que no se pueda copiar no puede ser miembro de un tipo que pueda copiarse. El tipo contenedor puede hacerse no copiable o convertirse en un tipo de referencia, o bien el campo puede quitarse o convertirse en un tipo que se pueda copiar.
fr: Un champ avec un type non copiable ne peut pas être membre d'un type copiable. Le type conteneur peut être rendu non copiable ou être converti en type référence. De même, le champ peut être supprimé ou converti en type copiable.
it: Un campo con un tipo non copiabile non può essere membro di un tipo copiabile. Il tipo contenitore può essere reso non copiabile o convertito in un tipo riferimento oppure il campo può essere rimosso o convertito in un tipo copiabile.
ja: コピー不可の型のフィールドをコピー可能な型のメンバーにすることはできません。包含する側の型をコピー不可にすることも参照型に変換することもできます。あるいは、フィールドを削除することも、コピー可能な型に変換することもできます。
pl: Pole typie bez możliwości kopiowania nie może być składową typu z możliwością kopiowania. Typ zawierający można ustawić jako typ z możliwością kopiowania lub przekonwertować na typ referencyjny, ewentualnie można usunąć pole lub przekonwertować je na typ z możliwością kopiowania.
ru: Поле с типом, не допускающим копирование, не может быть элементом типа, допускающего копирование. Содержащий тип можно сделать не допускающим копирование или преобразовать в ссылочный тип, либо можно удалить поле или преобразовать поле в тип, допускающий копирование.
tr: Kopyalanabilir olmayan bir tür içeren alan, kopyalanabilir türün bir üyesi olamaz. Kapsayan tür, kopyalanabilir olmayan hale getirilebilir veya bir başvuru türüne dönüştürülebilir ya da alan kaldırılabilir ya da kopyalanabilir bir türe dönüştürülebilir.

# DoNotCopyValueNoFieldOfCopyableTypeMessage
source: Copyable field '{1}' cannot have non-copyable type '{0}'
de: Das kopierbare Feld "{1}" darf nicht den nicht kopierbaren Typ "{0}" aufweisen.
es: El campo "{1}" que se puede copiar no puede tener el tipo "{0}" que no puede copiarse.
fr: La champ copiable '{1}' ne peut pas avoir le type non copiable '{0}'
it: Il campo copiabile '{1}' non può includere il tipo non copiabile '{0}'
ja: コピー可能なフィールド '{1}' にコピー不可の型 '{0}' を指定することはできません
pl: Pole z możliwością kopiowania „{1}” nie może mieć typu bez możliwości kopiowania „{0}”
ru: Поле "{1}", допускающее копирование, не может иметь тип "{0}", не допускающий копирование.
tr: '{1}' kopyalanabilir alanı, kopyalanabilir olmayan '{0}' türüne sahip olamaz

# DoNotCopyValueNoReturnValueFromReferenceDescription
source: Cannot return a value from a reference to a non-copyable type.
de: Ein Wert aus einem Verweis kann nicht an einen nicht kopierbaren Typ zurückgegeben werden.
es: No se puede devolver un valor de una referencia a un tipo que no se puede copiar.
fr: Impossible de retourner une valeur à partir d'une référence à un type non copiable.
it: Non è possibile restituire un valore da un riferimento a un tipo non copiabile.
ja: 参照からコピー不可の型に値を返すことはできません。
pl: Nie można zwrócić wartości z odwołania do typu bez możliwości kopiowania.
ru: Невозможно вернуть значение из ссылки в тип, который не может быть скопирован.
tr: Kopyalanamayan türe yönelik bir başvurudan değer döndürülemez.

# DoNotCopyValueNoReturnValueFromReferenceMessage
source: Cannot return a value from a reference to non-copyable type '{0}'
de: Ein Wert aus einem Verweis kann nicht an den nicht kopierbaren Typ "{0}" zurückgegeben werden.
es: No se puede devolver un valor de una referencia a un tipo "{0}" que no se puede copiar.
fr: Impossible de retourner une valeur à partir d'une référence au type non copiable '{0}'
it: Non è possibile restituire un valore da un riferimento al tipo non copiabile '{0}'
ja: 参照からコピー不可の型 '{0}' に値を返すことはできません
pl: Nie można zwrócić wartości z odwołania do typu bez możliwości kopiowania „{0}”
ru: Невозможно вернуть значение из ссылки в тип "{0}", который не может быть скопирован
tr: '{0}' kopyalanamayan türüne yönelik bir başvurudan değer döndürülemez

# DoNotCopyValueNoUnboxingDescription
source: Do not unbox non-copyable value types.
de: Für nicht kopierbare Werttypen darf kein Unboxing ausgeführt werden.
es: No aplique conversión unboxing a los tipos de valores que no se pueden copiar.
fr: N'effectue pas de conversion unboxing des types valeur non copiables.
it: Non eseguire la conversione unboxing di tipi valore non copiabili.
ja: コピー不可の値の型をボックス化解除しないでください。
pl: Nie rozpakowuj typów wartości bez możliwości kopiowania.
ru: Не распаковывайте типы значений, не допускающие копирование.
tr: Kopyalanabilir olmayan değer türlerini kutuya eklemeyin.

# DoNotCopyValueNoUnboxingMessage
source: Do not unbox non-copyable type '{0}'
de: Für den nicht kopierbaren Typ "{0}" darf kein Unboxing ausgeführt werden.
es: No aplicar conversión unboxing al tipo "{0}" que no se puede copiar
fr: Ne pas effectuer de conversion unboxing du type '{0}' non copiable
it: Non eseguire la conversione unboxing del tipo non copiabile '{0}'
ja: コピー不可の型 '{0}' をボックス化解除しないでください
pl: Nie rozpakowuj typu bez możliwości kopiowania „{0}”
ru: Не следует распаковывать тип "{0}", не допускающий копирование.
tr: Kopyalanabilir olmayan '{0}' türünü kutudan çıkarmayın

# DoNotCopyValueTitle
source: Do not copy value
de: Wert nicht kopieren
es: No copiar el valor
fr: Ne pas copier la valeur
it: Non copiare il valore
ja: 値をコピーしない
pl: Nie kopiuj wartości
ru: Не копировать значение
tr: Değeri kopyalamayın

# DoNotCopyValueUnsupportedUseDescription
source: Unsupported use of non-copyable type.
de: Nicht unterstützte Verwendung eines nicht kopierbaren Typs.
es: Uso no admitido de un tipo que no se puede copiar.
fr: Utilisation non prise en charge d'un type non copiable.
it: Uso non supportato di un tipo non copiabile.
ja: コピー不可の型の使用はサポートされていません。
pl: Nieobsługiwane użycie typu bez możliwości kopiowania.
ru: Неподдерживаемое использование типа, не допускающего копирование.
tr: Kopyalanabilir olmayan türün kullanımı desteklenmiyor.
