Repository: dotnet/roslyn
Catalog: src/Analyzers/CSharp/Analyzers/xlf/CSharpAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Add braces
cs: Přidat složené závorky
de: Geschweifte Klammern hinzufügen
es: Agregar llaves
fr: Ajouter des accolades
it: Aggiungi parentesi graffe
ja: 波かっこを追加します
ko: 중괄호 추가
pl: Dodaj nawiasy klamrowe
pt_br: Adicionar chaves
ru: Добавить фигурные скобки
tr: Küme ayracı ekle
zh_hans: 添加大括号
zh_hant: 加入大括號

source: Add braces to '{0}' statement.
cs: Přidat složené závorky do příkazu {0}.
de: Der Anweisung "{0}" geschweifte Klammern hinzufügen
es: Agregar llaves a la instrucción '{0}'.
fr: Ajouter des accolades à l'instruction '{0}'.
it: Aggiunge le parentesi graffe all'istruzione '{0}'.
ja: '{0}' ステートメントに波かっこを追加します。
ko: '{0}' 문에 중괄호를 추가합니다.
pl: Dodaj nawiasy klamrowe do instrukcji „{0}”.
pt_br: Adicionar chaves à instrução '{0}'.
ru: Добавить фигурные скобки в оператор "{0}".
tr: '{0}' deyimine küme ayracı ekleyin.
zh_hans: 向 “{0}” 语句添加大括号。
zh_hant: 為 '{0}' 陳述式加入大括號。

source: Anonymous function can be made static
cs: Anonymní funkce se dá nastavit jako statická.
de: Eine anonyme Funktion kann als statisch festgelegt werden.
fr: La fonction anonyme peut être rendue statique
it: La funzione anonima può essere resa statica
ja: 匿名関数を静的にすることができます
ko: 익명 함수를 정적으로 만들 수 있습니다.
pl: Funkcja anonimowa może być statyczna
pt_br: A função anônima pode ser transformada em estática
ru: Анонимную функцию можно сделать статической
tr: Anonim işle statik hale getirilebilir

source: Blank line not allowed after arrow expression clause token
cs: Za tokenem klauzule výrazu šipky není povolen prázdný řádek.
de: Nach dem Token der Pfeilausdrucksklausel ist keine leere Zeile zulässig
fr: Ligne vide non autorisée après le jeton de clause d’expression fléchée
it: Riga vuota non consentita dopo il token della clausola dell'espressione arrow
ja: 矢印式句トークンの後に空白行は許可されていません
ko: 화살표 식 절 토큰 뒤에는 빈 줄을 사용할 수 없습니다.
pl: Pusty wiersz jest niedozwolony po tokenie klauzuli wyrażenia strzałki
pt_br: Linha em branco não permitida após token de cláusula de expressão de seta
ru: Пустая строка недопустима после маркера предложения выражения со стрелкой
tr: Ok ifadesi yan tümce belirtecinin ardından boş satıra izin verilmez
zh_hans: 箭头表达式子句标记后不允许空行
zh_hant: 在箭頭運算式子句權杖後不允許空白行

source: Blank line not allowed after conditional expression token
cs: Za tokenem podmíněného výrazu se nepovoluje prázdný řádek.
de: Leere Zeile nach bedingtem Ausdruckstoken nicht zulässig
fr: Ligne vide non autorisée après un jeton d’expression conditionnelle
it: Riga vuota non consentita dopo il token di espressione condizionale
ja: 条件式トークンの後に空白行は許可されていません
ko: 조건식 토큰 다음에는 빈 줄을 사용할 수 없습니다.
pl: Pusty wiersz jest niedozwolony po tokenie wyrażenia warunkowego
pt_br: Linha em branco não permitida após token de expressão condicional
ru: Пустая строка недопустима после маркера условного выражения
tr: Koşullu ifade belirtecinin ardından boş satıra izin verilmez
zh_hans: 条件表达式标记后不允许使用空行
zh_hant: 條件運算式權杖之後不允許空白行

source: Blank line not allowed after constructor initializer colon
cs: Za dvojtečkou inicializátoru konstruktoru se nepovoluje prázdný řádek.
de: Nach dem Doppelpunkt für den Initialisierer des Konstruktors ist keine leere Zeile zulässig.
es: No se permite una línea en blanco después del signo de dos puntos del inicializador del constructor
fr: Ligne vide non autorisée après le signe des deux-points de l'initialiseur du constructeur
it: Non sono consentite righe vuote dopo i due punti dell'inizializzatore del costruttore
ja: コンストラクター初期化子のコロンの後に空白行を使用することはできません
ko: 생성자 이니셜라이저 콜론 뒤에 빈 줄을 사용할 수 없음
pl: Pusty wiersz jest niedozwolony po dwukropku inicjatora konstruktora
pt_br: Linha em branco não permitida após os dois-pontos do inicializador de construtor
ru: После инициализатора конструктора с двоеточием не допускается пустая строка.
tr: Oluşturucu başlatıcı iki noktadan sonra boş satıra izin verilmiyor
zh_hans: 构造函数初始值设定项冒号后面不允许有空白行
zh_hant: 不允許在建構函式初始設定式冒號後加上空白行

# Consecutive_braces_must_not_have_a_blank_between_them
source: Consecutive braces must not have blank line between them
cs: Po sobě jdoucí závorky nesmí mít mezi sebou prázdný řádek.
de: Aufeinanderfolgende geschweifte Klammern dürfen keine leere Zeile einschließen.
es: Las llaves consecutivas no deben tener una línea en blanco entre ellas
fr: Les accolades consécutives ne doivent pas avoir de ligne vide entre elles
it: Tra parentesi graffe consecutive non devono essere presenti righe vuote
ja: 連続する中かっこの間に空白行を含めることはできません
ko: 연속 중괄호 사이에 빈 줄이 없어야 함
pl: Między kolejnymi nawiasami klamrowymi nie może znajdować się pusty wiersz.
pt_br: As chaves consecutivas não podem ter uma linha em branco entre elas
ru: Между последовательными фигурными скобками не должно быть пустых строк.
tr: Ardışık ayraçlar arasında boş çizgi olmamalıdır
zh_hans: 连续大括号之间不能有空白行
zh_hant: 連續大括弧之間不能有空白行

source: Convert switch statement to expression
cs: Převést příkaz switch na výraz
de: Switch-Anweisung in Ausdruck konvertieren
es: Convertir una instrucción switch en expresión
fr: Convertir l'instruction switch en expression
it: Converti l'istruzione switch in espressione
ja: switch ステートメントを式に変換します
ko: switch 문을 식으로 변환
pl: Konwertuj instrukcję switch na wyrażenie
pt_br: Converter a instrução switch em expressão
ru: Преобразовать оператор switch в выражение
tr: Switch deyimini ifadeye dönüştür
zh_hans: 将 switch 语句转换为表达式
zh_hant: 將 switch 陳述式轉換為運算式

source: Convert to 'Program.Main' style program
cs: Převést na program stylu Program.Main
de: In 'Program.Main' Programmformat konvertieren
fr: Convertir en programme de style « Program.Main »
it: Converti in programma di stile 'Program.Main'
ja: 'Program.Main' スタイル プログラムに変換
ko: 'Program.Main' 스타일 프로그램으로 변환
pl: Konwertuj na program w stylu „Program.Main”
pt_br: Converter para 'Program.Main' o estilo do programa
ru: Преобразовать в программу в стиле "Program.Main"
tr: 'Program.Main' stil programına dönüştür
zh_hans: 转换为 'Program.Main' 样式程序
zh_hant: 轉換成 'Program.Main' 樣式程式

source: Convert to block scoped namespace
cs: Převést na namespace pro celý blok
de: In namespace eines Blockbereichs konvertieren
es: Convertir en namespace con ámbito de bloque
fr: Convertir en namespace bloc inclus dans l'étendue
it: Converti in namespace con ambito blocco
ja: 範囲指定されたブロックが設定された namespace に変換
ko: 블록 범위 namespace 스로 변환
pl: Konwertuj do zakresu bloku elementu namespace
pt_br: Converter para bloquear o namespace com escopo
ru: Преобразовать в namespace с заданной областью видимости блока
tr: Kapsamlı namespace öğesini engellemek için dönüştür
zh_hans: 转换为块范围限定的 namespace
zh_hant: 轉換為已設定區塊範圍的 namespace

source: Convert to file-scoped namespace
cs: Převést na namespace pro celý soubor
de: In namespace eines Dateibereichs konvertieren
es: Convertir en namespace con ámbito de archivo
fr: Convertir en namespace inclus dans l'étendue de fichier
it: Converti in namespace con ambito file
ja: 範囲指定されたファイルが設定された namespace に変換
ko: 파일 범위 namespace 스로 변환
pl: Konwertuj do zakresu pliku elementu namespace
pt_br: Converter em namespace com escopo de arquivo
ru: Преобразовать в namespace с заданной областью видимости файла
tr: Dosya kapsamlı namespace öğesine dönüştür
zh_hans: 转换为文件范围限定的 namespace
zh_hant: 轉換為已設定檔案範圍的 namespace

source: Convert to top-level statements
cs: Převést na příkazy nejvyšší úrovně
de: Konvertieren in Anweisungen der obersten Ebene
fr: Convertir en instructions de niveau supérieur
it: Converti in istruzioni di primo livello
ja: 最上位レベルのステートメントに変換する
ko: 최상위 문으로 변환
pl: Konwertuj na instrukcje najwyższego poziomu
pt_br: Converter para instruções de alto-nível
ru: Преобразовать в операторы верхнего уровня
tr: Üst düzey deyimlere dönüştür
zh_hans: 转换为顶级语句
zh_hant: 轉換成最上層陳述式

source: Deconstruct variable declaration
cs: Dekonstruovat deklaraci proměnné
de: Variablendeklaration dekonstruieren
es: Desconstruir la declaración de variable
fr: Déconstruire la déclaration de variable
it: Decostruisci la dichiarazione di variabile
ja: 変数の宣言を分解
ko: 변수 선언 분해
pl: Zdekonstruuj deklarację zmiennej
pt_br: Desconstruir declaração de variável
ru: Деконструировать объявление переменной
tr: Değişken bildirimini ayrıştır
zh_hans: 析构变量声明
zh_hant: 解構變數宣告

source: Delegate invocation can be simplified.
cs: Volání delegáta může být zjednodušené.
de: Der Delegataufruf kann vereinfacht werden.
es: La invocación del delegado se puede simplificar.
fr: L'appel de délégué peut être simplifié.
it: La chiamata del delegato può essere semplificata.
ja: デリゲート呼び出しを簡素化できます。
ko: 대리자 호출을 단순화할 수 있습니다.
pl: Wywołanie delegata można uprościć.
pt_br: A invocação de delegado pode ser simplificada.
ru: Вызов делегата можно упростить.
tr: Temsilci çağrısı basitleştirilebilir.
zh_hans: 可简化委托调用。
zh_hant: 可以簡化委派引動的過程。

source: Discard can be removed
cs: Proměnná typu discard se dá odebrat.
de: discard-Element kann entfernt werden.
es: El descarte se puede quitar.
fr: Vous pouvez supprimer le discard
it: È possibile rimuovere discard
ja: ディスカードは削除できます
ko: 무시 항목은 제거할 수 있습니다.
pl: Odrzucenie można usunąć
pt_br: O discard pode ser removido
ru: Пустую переменную можно удалить
tr: Atma işlemi kaldırılabilir
zh_hans: 可删除放弃项
zh_hant: 可以移除捨棄

source: Embedded statements must be on their own line
cs: Vložené příkazy musí mít svůj vlastní řádek.
de: Eingebettete Anweisungen müssen in einer eigenen Zeile enthalten sein.
es: Las instrucciones incrustadas deben estar en su propia línea
fr: Les instructions imbriquées doivent être placées sur leur propre ligne
it: Le istruzioni incorporate devono essere posizionate nella rispettiva riga
ja: 埋め込みステートメントは独自の行に配置する必要があります
ko: 포함 문은 고유한 줄에 있어야 합니다.
pl: Osadzone instrukcje muszą znajdować się w osobnym wierszu
pt_br: As instruções inseridas precisam estar nas próprias linhas
ru: Встроенные операторы должны располагаться на отдельной строке.
tr: Katıştırılmış deyimler kendi satırına yerleştirilmelidir
zh_hans: 嵌入的语句必须放在其自己的行上
zh_hant: 內嵌陳述式必須位於自己的行中

source: Implement
ko: 구현

source: Indexing can be simplified
cs: Indexování může být zjednodušené.
de: Die Indizierung kann vereinfacht werden
es: La indexación de direcciones se puede simplificar
fr: L'indexation peut être simplifiée
it: L'indicizzazione può essere semplificata
ja: インデックスの作成を簡素化することができます
ko: 인덱싱을 단순화할 수 있습니다.
pl: Indeksowanie można uprościć
pt_br: A indexação pode ser simplificada
ru: Вы можете упростить индексирование
tr: Dizin oluşturma basitleştirilebilir
zh_hans: 索引可以简化
zh_hant: 可簡化索引

source: Inline variable declaration
cs: Vložená deklarace proměnné
de: Inlinevariablendeklaration
es: Declaración de variables alineada
fr: Déclaration de variable inline
it: Dichiarazione di variabile inline
ja: インライン変数宣言
ko: 인라인 변수 선언
pl: Deklaracja zmiennej wbudowanej
pt_br: Declaração de variável embutida
ru: Объявление встроенной переменной
tr: Satır içi değişken bildirimi
zh_hans: 内联变量声明
zh_hant: 內嵌變數宣告

source: Lambda expression can be removed
cs: Výraz lambda je možné odebrat
de: Lambdaausdruck kann entfernt werden
es: Se puede quitar la expresión lambda
fr: L’expression lambda peut être supprimée.
it: L'espressione lambda può essere rimossa
ja: ラムダ式を削除できます
ko: 람다 식을 제거할 수 있습니다.
pl: Wyrażenie lambda można usunąć
pt_br: A expressão lambda pode ser removida
ru: Лямбда-выражение можно удалить
tr: Lambda ifadesi kaldırılabilir
zh_hans: 可以删除 Lambda 表达式
zh_hant: 可移除 Lambda 運算式

source: Lambda expression can be simplified
de: Lambdaausdruck kann vereinfacht werden
fr: Vous pouvez simplifier l’expression lambda
it: L'espressione lambda può essere semplificata
ko: 람다 식을 단순화할 수 있습니다.

source: Make anonymous function static
cs: Nastavit anonymní funkci jako statickou
de: Anonyme Funktion statisch machen
fr: Rendre la fonction anonyme statique
it: Rendere statica la funzione anonima
ja: 匿名関数を静的にする
ko: 익명 함수를 정적으로 설정
pl: Ustaw funkcję anonimową jako statyczną
pt_br: Tornar a função anônima estática
ru: Сделать анонимную функцию статической
tr: Anonim işlevi statik hale getir

source: Make member 'readonly'
cs: Nastavit člena jako readonly
de: Member als "readonly" festlegen
fr: Définir comme membre 'readonly'
it: Rendi il membro 'readonly'
ja: メンバーを 'readonly' にする
ko: 멤버를 'readonly'로 만들기
pl: Ustaw element członkowski jako „readonly”
pt_br: Tornar membro 'readonly'
ru: Сделать элемент "readonly"
tr: Üyeyi 'readonly' yap
zh_hans: 将成员设为“readonly”
zh_hant: 讓成員 'readonly'

source: Make struct 'readonly'
cs: Vytvořit strukturu readonly
de: Struktur als "readonly" festlegen
fr: Rendre le struct 'readonly'
it: Rendere struct 'readonly'
ja: 構造体を '読み取り専用' にする
ko: 구조체를 '읽기 전용'으로 만들기
pl: Ustaw strukturę jako „tylko do odczytu”
pt_br: Tornar o struct 'readonly'
ru: Сделать структуру доступной "только для чтения"
tr: Yapıyı 'salt okunur' hale dönüştür
zh_hans: 将结构设置为 “readonly”
zh_hant: 將結構設為 'readonly'

source: Member can be made 'readonly'
cs: Člena je možné nastavit jako readonly
de: Member kann als "readonly" festgelegt werden
fr: Le membre peut être défini en 'readonly'
it: Il membro può essere impostato come 'readonly'
ja: メンバーを 'readonly' にすることができます
ko: 멤버를 'readonly'로 만들 수 있음
pl: Element członkowski można określić jako „readonly”
pt_br: O membro pode se tornar 'readonly'
ru: Элемент можно сделать "readonly"
tr: Üye 'readonly' yapılabilir
zh_hans: 可将成员设为“readonly”
zh_hant: 成員可以設為 'readonly'

source: Misplaced using directive
cs: Nesprávné umístění direktivy using
de: Die using-Anweisung wurde falsch platziert.
es: Directiva using mal colocada
fr: Directive using mal placée
it: Direttiva using in posizione errata
ja: using ディレクティブが正しく配置されていません
ko: 위치가 잘못된 using 지시문
pl: Nieprawidłowo umieszczona dyrektywa using
pt_br: Diretiva using em local incorreto
ru: Неправильно расположенная директива using
tr: Yanlış yerleştirilmiş using yönergesi
zh_hans: 错放了 using 指令
zh_hant: using 指示詞位置錯誤

source: Move misplaced using directives
cs: Přesunout nesprávně umístěné direktivy using
de: Falsch platzierte using-Anweisungen verschieben
es: Mover directivas using mal colocadas
fr: Déplacer les directives using mal placées
it: Sposta le direttive using in posizione errata
ja: 誤って配置された using ディレクティブを移動します
ko: 위치가 잘못된 using 지시문 이동
pl: Przenieś nieprawidłowo umieszczone dyrektywy using
pt_br: Mover diretivas using no local incorreto
ru: Переместить неправильно расположенные директивы using
tr: Yanlış yerleştirilmiş using yönergelerini taşı
zh_hans: 移动错放的 using 指令
zh_hant: 移動位置錯誤的 using 指示詞

source: Make readonly fields writable
cs: Umožnit zápis do polí jen pro čtení (readonly)
de: readonly-Felder als schreibbar festlegen
es: Convertir en editables los campos readonly
fr: Rendre les champs readonly accessibles en écriture
it: Rendi scrivibili i campi readonly
ja: readonly フィールドを書き込み可能にします
ko: readonly 필드를 쓰기 가능으로 지정
pl: Ustaw możliwość zapisu dla pól z deklaracją readonly
pt_br: Alterar os campos readonly para graváveis
ru: Сделать поля readonly доступными для записи
tr: readonly alanları yazılabilir yap
zh_hans: 使 readonly 字段可写
zh_hant: 將 readonly 欄位設為可寫入

source: Local function can be made static
cs: Místní funkce se dá nastavit jako statická.
de: Die lokale Funktion kann als statisch festgelegt werden.
es: La función local se puede convertir en estática
fr: Une fonction locale peut être rendue statique
it: La funzione locale può essere resa statica
ja: ローカル関数を静的にすることができます
ko: 로컬 함수를 정적으로 지정할 수 있습니다.
pl: Funkcję lokalną można ustawić jako statyczną
pt_br: A função local pode ser alterada para estática
ru: Локальную функцию можно сделать статической
tr: Yerel işlev statik yapılabilir
zh_hans: 可以使本地函数成为静态函数
zh_hant: 區域函式可以變成靜態

source: Make local function 'static'
cs: Nastavit místní funkci jako statickou
de: Lokale Funktion als "static" festlegen
es: Convertir la función local "static"
fr: Rendre la fonction locale 'static'
it: Rendi la funzione locale 'static'
ja: ローカル関数を 'static' にします
ko: 로컬 함수를 '정적'으로 지정
pl: Ustaw funkcję lokalną jako „static”
pt_br: Alterar a função local para 'static'
ru: Сделать локальную функцию статической
tr: Yerel işlevi 'static' yap
zh_hans: 使本地函数成为静态函数
zh_hant: 將區域函式設為 'static'

source: Negate expression (changes semantics)
cs: Negovat výraz (změní sémantiku)
de: Ausdruck negieren (Semantik ändern)
es: Negar expresión (cambia la semántica)
fr: Inverser l'expression (change la sémantique)
it: Nega l'espressione (modifica la semantica)
ja: 式の無効化 (セマンティクスを変更)
ko: 식 부정(의미 체계를 변경함)
pl: Neguj wyrażenie (zmienia semantykę)
pt_br: Negar expressão (altera a semântica)
ru: Применить отрицание к выражению (семантика изменяется)
tr: İfadeyi tersine çevir (semantiği değiştirir)
zh_hans: 使用求反表达式(更改语义)
zh_hant: 否定運算式 (變更語義)

source: Null check can be clarified
cs: Kontrolu hodnoty null je možné upřesnit.
de: Die NULL-Überprüfung kann verdeutlicht werden
es: Se puede aclarar la comprobación de valores NULL
fr: La vérification null peut être précisée
it: Il controllo Null può essere chiarificato
ja: null値 チェックを明確にできます
ko: Null 검사를 명확히 할 수 있습니다.
pl: Można określić sprawdzanie wartości null.
pt_br: A verificação nula pode ser esclarecida
ru: Проверку значения null можно уточнить.
tr: Null denetimi daha fazla ayrıntıya sahip olabilir
zh_hans: 可以阐明 Null 检查
zh_hant: 可以澄清 Null 檢查

source: Nullable directive is redundant
cs: Direktiva s možnou hodnotou null je redundantní.
de: Nullable Direktive ist überflüssig
fr: La directive nullable est redondante
it: La direttiva che ammette i valori Null è ridondante
ja: Null 許容ディレクティブが冗長です
ko: null 허용 지시문이 중복됩니다.
pl: Dyrektywa dopuszczania wartości null jest nadmiarowa
pt_br: Diretiva que permite valor nulo é redundante
ru: Директива, допускающая значение NULL, является избыточной
tr: Null atanabilir yönerge yineleniyor
zh_hans: 可为空的指令是冗余的
zh_hant: 可為 Null 的指示詞是多餘的

source: Nullable directive is unnecessary
cs: Direktiva s možnou hodnotou null není potřebná.
de: Nullable Direktive ist unnötig
fr: La directive nullable n’est pas nécessaire
it: La direttiva che ammette i valori Null non è necessaria
ja: Null 許容ディレクティブは不要です
ko: null 허용 지시문이 필요하지 않습니다.
pl: Dyrektywa dopuszczania wartości null jest niepotrzebna
pt_br: Diretiva que permite valor nulo é desnecessária
ru: Директива, допускающий значение NULL, не нужна
tr: Null atanabilir yönerge gereksiz
zh_hans: 可为空的指令不必要
zh_hant: 無須使用可為 Null 的指示詞

source: Prefer 'null' check over type check
cs: Upřednostňovat kontrolu hodnoty null před kontrolou typu
de: „NULL“-Überprüfung vor Typüberprüfung bevorzugen
es: Preferir comprobación "null' sobre comprobación de tipo
fr: Préférer la vérification « null » à la vérification de type
it: Preferisci il controllo 'null' al controllo del tipo
ja: 型のチェックよりも 'null 値' チェックを優先する
ko: 형식 검사보다 'null' 검사 선호
pl: Ustaw preferencje na sprawdzanie wartości „null” zamiast sprawdzania typu
pt_br: Preferir a verificação 'nula' à verificação de tipo
ru: Предпочитать проверку "null" проверке типа
tr: Tür denetimi yerine 'null' denetimini tercih et
zh_hans: 与类型检查相比，首选 “Null” 检查
zh_hant: 建議使用 'null' 檢查而非鍵入檢查

source: Property accessor can be simplified
de: Eigenschaftenaccessor kann vereinfacht werden
it: La funzione di accesso alla proprietà può essere semplificata
ko: 속성 접근자를 단순화할 수 있습니다.

source: Property pattern can be simplified
cs: Vzor vlastnosti se dá zjednodušit.
de: Das Eigenschaftsmuster kann vereinfacht werden.
es: El patrón de propiedad puede ser simplificado
fr: Le modèle de propriété peut être simplifié
it: Il modello di proprietà può essere semplificato
ja: プロパティ パターンは簡略化できます
ko: 속성 패턴을 간소화할 수 있습니다.
pl: Wzorzec właściwości można uprościć
pt_br: O padrão da propriedade pode ser simplificado
ru: Шаблон свойства можно упростить
tr: Özellik deseni basitleştirilebilir
zh_hans: 可以简化属性模式
zh_hant: 可簡化屬性模式

source: Remove operator (preserves semantics)
cs: Odebrat operátor (zachová sémantiku)
de: Operator entfernen (Semantik beibehalten)
es: Quitar operador (conserva la semántica)
fr: Supprimer l'opérateur (préserve la sémantique)
it: Rimuovi l'operatore (conserva la semantica)
ja: 演算子の削除 (セマンティクスを保持)
ko: 연산자 제거(의미 체계를 유지함)
pl: Usuń operator (zachowuje semantykę)
pt_br: Remover operador (preserva a semântica)
ru: Удалить оператор (семантика сохраняется)
tr: İşleci kaldır (semantiği korur)
zh_hans: 删除运算符(保留语义)
zh_hant: 移除運算子 (保留語義)

source: Remove redundant nullable directive
cs: Odebrat redundantní direktivu s možnou hodnotou null
de: Die redundante nullable-Direktive entfernen
fr: Supprimer la directive nullable redondante
it: Rimuovi direttiva che ammette i valori Null ridondante
ja: 冗長な null 許容ディレクティブを削除します
ko: 중복 null 허용 지시문 제거
pl: Usuwanie nadmiarowej dyrektywy dopuszczania wartości null
pt_br: Remover diretiva que permite valor nulo redundante
ru: Удалите избыточную директиву, допускающую значение NULL
tr: Yinelenen null atanabilir yönergeyi kaldırın
zh_hans: 删除冗余的可为空的指令
zh_hant: 移除多餘而可為 Null 的指示詞

source: Remove unnecessary lambda expression
cs: Odebrat nepotřebný výraz lambda
de: Unnötigen Lambdaausdruck entfernen
es: Quitar la expresión lambda innecesaria
fr: Supprimer l’expression lambda inutile
it: Rimuovi espressione lambda non necessaria
ja: 不要なラムダ式の削除
ko: 불필요한 람다 식 제거
pl: Usuń niepotrzebne wyrażenie lambda
pt_br: Remover expressão lambda desnecessária
ru: Удалить ненужное лямбда-выражение
tr: Gereksiz lambda ifadesini kaldır
zh_hans: 删除不必要的 lambda 表达式
zh_hant: 移除不必要的 Lambda 運算式

source: Remove unnecessary nullable directive
cs: Odebrat nepotřebnou direktivu s možnou hodnotou null
de: Unnötige Nullable-Direktiven entfernen
fr: Supprimer la directive nullable inutile
it: Rimuovi direttiva che ammette i valori Null non necessaria
ja: 不要な null 許容ディレクティブを削除します
ko: 불필요한 null 허용 지시문 제거
pl: Usuwanie niepotrzebnej dyrektywy dopuszczania wartości null
pt_br: Remover diretiva anulável desnecessária
ru: Удалите ненужную директиву, допускающую значение NULL
tr: Gereksiz null atanabilir yönergeyi kaldırın
zh_hans: 删除不必要的可为空的指令
zh_hant: 移除不必要而可為 Null 的指示詞

source: Remove unnecessary suppression operator
cs: Odebrat nepotřebný operátor potlačení
de: Unnötigen Unterdrückungsoperator entfernen
es: Quitar operador de supresión innecesario
fr: Supprimer l'opérateur de suppression inutile
it: Rimuovi l'operatore di eliminazione non necessario
ja: 不要な抑制演算子を削除します
ko: 불필요한 비표시 오류(Suppression) 연산자 제거
pl: Usuń niepotrzebny operator pomijania
pt_br: Remover operador de supressão desnecessário
ru: Удалить ненужный оператор подавления
tr: Gereksiz gizleme işlecini kaldır
zh_hans: 请删除不必要的忽略运算符
zh_hant: 移除隱藏運算子中不需要的運算子

# Remove_unnessary_discard
source: Remove unnecessary discard
cs: Odebrat nepotřebnou proměnnou typu discard
de: Nicht benötigtes discard-Element entfernen
es: Quitar un descarte innecesario
fr: Supprimer tout discard inutile
it: Rimuovi discard non necessario
ja: 不要なディスカードを削除
ko: 불필요한 무시 항목 제거
pl: Usuń niepotrzebne odrzucenie
pt_br: Remover o discard desnecessário
ru: Удалите ненужную пустую переменную.
tr: Gereksiz atmayı kaldır
zh_hans: 删除不必要的放弃项
zh_hant: 移除不必要的捨棄

source: Simplify 'default' expression
cs: Zjednodušit výraz default
de: "default"-Ausdruck vereinfachen
es: Simplificar la expresión "predeterminada"
fr: Simplifier l'expression 'default'
it: Semplifica l'espressione 'default'
ja: default' 式を単純化する
ko: default' 식 단순화
pl: Uprość wyrażenie „default”
pt_br: Simplificar expressão 'default'
ru: Упростить выражение default
tr: Default' ifadesini basitleştir
zh_hans: 简化 "default" 表达式
zh_hant: 簡化 'default' 運算式

source: Simplify delegate invocation
cs: Zjednodušit vyvolání delegáta
de: Vereinfachen des Delegatenaufrufs
es: Simplificar la invocación del delegado
fr: Simplifier l’appel du délégué
it: Semplifica la chiamata del delegato
ja: デリゲートの呼び出しを簡略化する
ko: 대리자 호출 간소화
pl: Uprość wywołanie delegata
pt_br: Simplificar invocação de delegado
ru: Упростить вызов делегата
tr: Temsilci çağırmayı basitleştir
zh_hans: 简化委托调用
zh_hant: 簡化委派引動

source: Simplify property accessor
de: Vereinfachen des Eigenschaftenaccessors
it: Semplificare la funzione di accesso alla proprietà
ko: 속성 접근자 단순화
