Repository: dotnet/roslyn
Catalog: src/Analyzers/CSharp/Analyzers/xlf/CSharpAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Variable declaration can be inlined
cs: Deklaraci proměnné je možné vložit do řádku.
de: Variablendeklaration kann inline erfolgen.
es: La declaración de variables se puede insertar
fr: La déclaration de variable peut être inlined
it: La dichiarazione di variabile può essere impostata come inline
ja: 変数の宣言をインライン化できます
ko: 변수 선언은 인라인될 수 있습니다.
pl: Deklaracja zmiennej może być śródwierszowa
pt_br: A declaração de variável pode ser embutida
ru: Объявление переменной может быть встроенным.
tr: Değişken bildirimi satır içine alınabilir
zh_hans: 可以内联变量声明
zh_hant: 變數宣告可內置

# Warning_colon_Moving_using_directives_may_change_code_meaning
source: Warning: Moving using directives may change code meaning.
cs: Upozornění: Přesunutí direktiv using může změnit význam kódu.
de: Warnung: Durch das Verschieben von using-Anweisungen kann sich die Codebedeutung ändern.
es: Advertencia: El movimiento de directivas using puede cambiar el significado del código.
fr: Avertissement : Le déplacement des directives using peut changer la signification du code.
it: Avviso: in seguito allo spostamento di direttive using, il significato del codice può cambiare.
ja: 警告: using ディレクティブを移動すると、コードの意味が変わる可能性があります。
ko: 경고: using 지시문을 이동하면 코드 의미가 변경될 수 있습니다.
pl: Uwaga: przeniesienie dyrektyw using może zmienić znaczenie kodu.
pt_br: Aviso: a movimentação das diretivas using pode alterar o significado do código.
ru: Предупреждение! Перемещение директив using может изменить значение кода.
tr: Uyarı: using yönergelerini taşımak, kodun anlamını değiştirebilir.
zh_hans: 警告: 移动 using 指令可能会更改代码含义。
zh_hant: 警告: 移動 using 指示詞可能會變更程式碼意義。

source: {0} can be simplified
cs: {0} může být zjednodušený.
de: {0} kann vereinfacht werden
es: {0} se puede simplificar.
fr: {0} peut être simplifié
it: {0} può essere semplificato
ja: {0} を簡素化できます
ko: {0}을(를) 단순화할 수 있습니다.
pl: Element {0} można uprościć
pt_br: {0} pode ser simplificado
ru: {0} можно упростить
tr: {0} basitleştirilebilir
zh_hans: {0} 可以简化
zh_hant: 可簡化 {0}

source: 'default' expression can be simplified
cs: Výraz „default“ může být zjednodušený.
de: '"default"-Ausdruck kann vereinfacht werden
es: 'La expresión "predeterminada" se puede simplificar
fr: 'l'expression 'default' peut être simplifiée
it: 'L'espressione 'default' può essere semplificata
ja: 'default' 式を簡素化できます
ko: 'default' 식을 단순화할 수 있습니다.
pl: Wyrażenie „default” można uprościć
pt_br: 'a expressão 'default' pode ser simplificada
ru: выражение default можно упростить
tr: 'default' ifadesi basitleştirilebilir
zh_hans: 可以简化 "default" 表达式
zh_hant: 'default' 運算式可予簡化

source: 'if' statement can be simplified
cs: Příkaz if může být zjednodušený.
de: Die If-Anweisung kann vereinfacht werden.
es: La instrucción "if" se puede simplificar
fr: L'instruction 'if' peut être simplifiée
it: L'istruzione 'If' può essere semplificata
ja: 'if' ステートメントは簡素化できます
ko: 'if' 문을 단순화할 수 있습니다.
pl: Instrukcja „if” może zostać uproszczona
pt_br: A instrução 'if' pode ser simplificada
ru: Оператор if можно упростить
tr: 'If' deyimi basitleştirilebilir
zh_hans: 可简化 "if" 语句
zh_hant: 'if' 陳述式可簡化

source: 'new' expression can be simplified
cs: Výraz „new“ může být zjednodušený.
de: new-Ausdruck kann vereinfacht werden
es: La expresión "new" se puede simplificar.
fr: L'expression 'new' peut être simplifiée
it: L'espressione 'new' può essere semplificata
ja: 'new' 式を簡素化できます
ko: 'new' 식을 단순화할 수 있습니다.
pl: Wyrażenie „new” można uprościć
pt_br: A expressão 'new' pode ser simplificada
ru: выражение new можно упростить
tr: 'new' ifadesi basitleştirilebilir
zh_hans: 可简化 "new" 表达式
zh_hant: 'new' 運算式可簡化

source: 'typeof' can be converted to 'nameof'
cs: typeof se dá převést na nameof.
de: "typeof" kann in "nameof" konvertiert werden
fr: « typeof » peut être converti en « nameof »
it: 'typeof' può essere convertito in 'nameof'
ja: 'typeof' を 'nameof' に変換できます
ko: 'typeof'를 'nameof'로 변환할 수 있습니다.
pl: Element „typeof” można przekonwertować na element „nameof”
pt_br: 'typeof' pode ser convertido em 'nameof'
ru: "typeof" можно преобразовать в "nameof".
tr: 'typeof' metodu 'nameof' metoduna dönüştürülebilir

source: use 'var' instead of explicit type
cs: Použít var místo explicitního typu
de: "var" anstelle des expliziten Typs verwenden
es: Usar 'var' en lugar de un tipo explícito
fr: utiliser 'var' au lieu d'un type explicite
it: usa 'var' invece del tipo esplicito
ja: 明示的な型ではなく 'var' を使用します
ko: 대신 명시적 형식의 'var'을 사용합니다.
pl: użyj deklaracji „var” zamiast jawnego typu
pt_br: usar 'var' em vez do tipo explícito
ru: Использовать var вместо явного типа
tr: açık tür yerine 'var' kullan
zh_hans: 用 "var" 代替显式类型
zh_hant: 使用 'var'，而非明確類型

source: Using directive is unnecessary.
cs: Direktiva Using není potřebná.
de: Using-Direktive ist unnötig.
es: El uso de la directiva no es necesario.
fr: La directive using n'est pas nécessaire.
it: La direttiva using non è necessaria.
ja: Using ディレクティブは必要ありません。
ko: Using 지시문은 필요하지 않습니다.
pl: Dyrektywa using jest niepotrzebna.
pt_br: O uso da diretiva é desnecessário.
ru: Директива using не нужна.
tr: Using yönergesi gerekli değildir.
zh_hans: Using 指令是不需要的。
zh_hant: 無須使用指示詞。

source: 'using' statement can be simplified
cs: Příkaz using může být zjednodušený.
de: Die using-Anweisung kann vereinfacht werden.
es: La instrucción "using" se puede simplificar
fr: L'instruction 'using' peut être simplifiée
it: L'istruzione 'using' può essere semplificata
ja: 'using' ステートメントは簡素化できます
ko: 'using' 문을 단순화할 수 있습니다.
pl: Instrukcję „using” można uprościć
pt_br: A instrução 'using' pode ser simplificada
ru: Оператор using можно упростить
tr: 'using' deyimi basitleştirilebilir
zh_hans: 可简化 "using" 语句
zh_hant: 'using' 陳述式可簡化

source: Remove suppression operators
es: Quitar operadores de supresión
zh_hans: 请删除忽略运算符
zh_hant: 移除隱藏的運算子

source: 'typeof' can be converted to 'nameof'
es: "typeof" puede convertirse en "nameof"
zh_hans: "typeof" 可以转换为 "nameof"
zh_hant: 'typeof' 可轉換為 'nameof'

source: Use block body for accessors
es: Usar cuerpo del bloque para los descriptores de acceso

source: Use block body for constructors
es: Usar cuerpo del bloque para los constructores

source: Use block body for indexers
es: Usar cuerpo del bloque para los indizadores

source: Use block body for local functions
es: Usar cuerpo del bloque para las funciones locales

source: Use block body for methods
es: Usar cuerpo del bloque para los métodos

source: Use block body for operators
es: Usar cuerpo del bloque para los operadores

source: Use block body for properties
es: Usar cuerpo del bloque para las propiedades

source: Use expression body for accessors
es: Usar cuerpo de expresiones para los descriptores de acceso

source: Use expression body for constructors
es: Usar cuerpo de expresiones para los constructores

source: Use expression body for indexers
es: Usar cuerpo de expresiones para los indizadores

source: Use expression body for local functions
es: Usar el cuerpo de la expresión para las funciones locales

source: Use expression body for methods
es: Usar cuerpo de expresiones para los métodos

source: Use expression body for operators
es: Usar cuerpo de expresiones para los operadores

source: Use expression body for properties
es: Usar cuerpo de expresiones para las propiedades

source: Use parameter null checking
es: Usar la comprobación de los parámetros NULL
