Repository: dotnet/roslyn
Catalog: src/Analyzers/CSharp/Analyzers/xlf/CSharpAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Simplify property pattern
cs: Zjednodušit vzor vlastnosti
de: Eigenschaftenmuster vereinfachen
es: Simplificar el patrón de propiedad
fr: Simplifier le modèle de propriété
it: Semplifica il modello di proprietà
ja: プロパティ パターンを簡略化する
ko: 속성 패턴 간소화
pl: Uprość wzorzec właściwości
pt_br: Simplificar o padrão de propriedade
ru: Упростить шаблон свойства
tr: Özellik desenini basitleştir
zh_hans: 简化属性模式
zh_hant: 簡化屬性模式

source: Struct can be made 'readonly'
cs: Strukturu je možné vytvořit jako readonly
de: Struktur kann als "readonly" festgelegt werden
fr: Struct peut être rendu 'readonly'
it: Lo struct può essere impostato come 'readonly'
ja: '読み取り専用' にできる構造体
ko: 구조체를 '읽기 전용'으로 만들 수 있습니다.
pl: Strukturę można określić jako „tylko do odczytu”
pt_br: Struct pode ser 'readonly'
ru: Структуру можно сделать доступной "только для чтения"
tr: Yapı 'salt okunur' olabilir
zh_hans: 可以将结构设置为 “readonly”
zh_hant: 結構可以設為 'readonly'

source: Struct contains assignment to 'this' outside of constructor. Make readonly fields writable.
cs: Struct obsahuje přiřazení do this mimo konstruktor. Nastavte pole určená jen pro čtení jako zapisovatelná.
de: "Struct" enthält außerhalb des Konstruktors eine Zuweisung zu "this". Legen Sie schreibgeschützte Felder als beschreibbar fest.
es: Struct contiene una asignación a "this" fuera del constructor. Convierta en editables los campos de solo lectura.
fr: Struct contient une assignation à 'this' en dehors du constructeur. Rend les champs readonly accessibles en écriture.
it: La parola chiave Struct contiene l'assegnazione a 'this' all'esterno del costruttore. Impostare i campi di sola lettura come scrivibili.
ja: Struct に、コンストラクター外部の 'this' に対する代入が含まれています。読み取り専用フィールドを書き込み可能にしてください。
ko: Struct에서 'this'에 대한 할당이 생성자 외부에 있습니다. 읽기 전용 필드를 쓰기 가능으로 설정하세요.
pl: Element Struct zawiera przypisanie do elementu „this” poza konstruktorem. Ustaw pola tylko do odczytu jako zapisywalne.
pt_br: O Struct contém a atribuição para 'this' fora do construtor. Converta os campos somente leitura em graváveis.
ru: Структура (Struct) содержит присваивание "this" вне конструктора. Сделайте поля, доступные только для чтения, доступными для записи.
tr: Struct, oluşturucu dışında 'this' öğesine yönelik atama içeriyor. Salt okunur alanları yazılabilir yapın.
zh_hans: Struct 包含对构造函数之外的 "this" 的赋值。使只读字段可写。
zh_hant: Struct 包含建構函式外對 'this' 的指派。請將唯讀欄位設為可寫入。

source: Suppression operator has no effect and can be misinterpreted
cs: Operátor potlačení nemá žádný vliv a může být chybně interpretován.
de: Der Unterdrückungsoperator besitzt keine Auswirkungen und kann falsch interpretiert werden.
es: El operador de supresión no tiene efecto y se puede interpretar incorrectamente
fr: L'opérateur de suppression n'a aucun effet et peut être mal interprété
it: L'operatore di eliminazione non ha alcun effetto e può essere frainteso
ja: 抑制演算子は効果がなく、誤って解釈される可能性があります
ko: 비표시 오류(Suppression) 연산자는 아무런 영향을 주지 않으며 잘못 해석될 수 있습니다.
pl: Operator pomijania nie ma żadnego efektu i może zostać błędnie zinterpretowany
pt_br: O operador de supressão não tem efeito e pode ser mal interpretado
ru: Оператор подавления не имеет эффекта и может быть интерпретирован неправильно.
tr: Gizleme işleci hiçbir etkiye sahip değil ve yanlış yorumlanabilir
zh_hans: 抑制运算符不起任何作用且可能被误解
zh_hant: 隱藏運算子沒有作用，而且可能會造成誤解

source: Unreachable code detected
cs: Byl zjištěn nedosažitelný kód.
de: Unerreichbarer Code wurde entdeckt.
es: Se detectó código inaccesible
fr: Code inaccessible détecté
it: È stato rilevato codice non raggiungibile
ja: 到達できないコードが検出されました
ko: 접근할 수 없는 코드가 있습니다.
pl: Wykryto nieosiągalny kod
pt_br: Código inacessível detectado
ru: Обнаружен недостижимый код
tr: Ulaşılamayan kod algılandı
zh_hans: 检测到无法访问的代码
zh_hant: 偵測到執行不到的程式碼

source: Use 'System.Threading.Lock'
de: „System.Threading.Lock“ nutzen
fr: Utilisez 'System.Threading.Lock'
it: Usare 'System.Threading.Lock'
ja: 'System.Threading.Lock' を使用する
ko: 'System.Threading.Lock' 사용
pl: Użyj typu „System.Threading.Lock”
pt_br: Usar 'System.Threading.Lock'
tr: 'System.Threading.Lock' türünü kullanın

source: Use UTF-8 string literal
cs: Použití řetězcového literálu UTF-8
de: Verwenden des UTF-8-Zeichenfolgenliterals
fr: Utiliser le littéral de chaîne UTF-8
it: Usa valore letterale stringa UTF-8
ja: UTF-8 文字列リテラルを使用する
ko: UTF-8 문자열 리터럴 사용
pl: Użyj literału ciągu UTF-8
pt_br: Usar literal de cadeia de caracteres UTF-8
ru: Использовать строковый литерал UTF-8
tr: UTF-8 sabit değerli dizesini kullan
zh_hans: 使用 UTF-8 字符串文本
zh_hant: 使用 UTF-8 字串常值

source: Use block body for accessor
cs: Pro přístupové objekty používat text bloku.
de: Blocktextkörper für Zugriffsmethode verwenden
fr: Utiliser un corps de bloc pour un accesseur
it: Usare il corpo del blocco per la funzione di accesso
ja: アクセサーにブロック本体を使用する
ko: 접근자에 블록 본문 사용
pl: Użyj treści bloku dla metody dostępu
pt_br: Usar o corpo do bloco para acessador
ru: Использовать тело блока для метода доступа
tr: Erişimci için blok gövdesi kullan
zh_hans: 使用访问器的块主体
zh_hant: 使用存取子的區塊主體

source: Use block body for constructor
cs: Pro konstruktory používat text bloku.
de: Blocktextkörper für Konstruktor verwenden
fr: Utiliser un corps de bloc pour un constructeur
it: Usare il corpo del blocco per il costruttore
ja: コンストラクターにブロック本体を使用する
ko: 생성자에 블록 본문 사용
pl: Użyj treści bloku dla konstruktora
pt_br: Usar o corpo do bloco para construtor
ru: Использовать тело блока для конструктора
tr: Oluşturucu için blok gövdesi kullan
zh_hans: 使用构造函数的块主体
zh_hant: 使用建構函式的區塊主體

source: Use block body for conversion operator
cs: Pro operátory převodu používat text bloku.
de: Blocktext für Konvertierungsoperator verwenden
fr: Utiliser le corps de bloc pour un opérateur de conversion
it: Usare il corpo del blocco per l'operatore di conversione
ja: 変換演算子にブロック本体を使用する
ko: 변환 연산자에 블록 본문 사용
pl: Użyj treści bloku dla operatora konwersacji
pt_br: Usar o corpo do bloco para operador de conversão
ru: Использовать текст блока для оператора преобразования
tr: Dönüştürme işleci için blok gövdesi kullan
zh_hans: 使用块主体来表示转换运算符
zh_hant: 使用轉換運算子的區塊主體

source: Use block body for indexer
cs: Pro indexery používat text bloku.
de: Blocktextkörper für Indexer verwenden
fr: Utiliser un corps de bloc pour un indexeur
it: Usare il corpo del blocco per l'indicizzatore
ja: インデクサーにブロック本体を使用する
ko: 인덱서에 블록 본문 사용
pl: Użyj treści bloku dla indeksatora
pt_br: Usar o corpo do bloco para indexador
ru: Использовать тело блока для индексатора
tr: Dizin oluşturucu için blok gövdesi kullan
zh_hans: 使用块主体来表示索引器
zh_hant: 使用索引子的區塊主體

source: Use block body for lambda expression
cs: Pro lambda výrazy používat text bloku.
de: Blocktextkörper für Lambdafunktion verwenden
fr: Utiliser un corps de bloc pour une expression lambda
it: Usare il corpo del blocco per l'espressione lambda
ja: ラムダ式にブロック本体を使用する
ko: 람다 식에 블록 본문 사용
pl: Użyj treści bloku dla wyrażenia lambda
pt_br: Usar o corpo do bloco para expressão lambda
ru: Использовать тело блока для лямбда-выражения
tr: Lambda ifadesi için blok gövdesi kullan
zh_hans: 使用块主体来表示 Lambda 表达式
zh_hant: 使用 Lambda 運算式的區塊主體

source: Use block body for local function
cs: Pro místní funkce používat text bloku.
de: Blocktextkörper für lokale Funktion verwenden
fr: Utiliser un corps de bloc pour une fonction locale
it: Usare il corpo del blocco per la funzione locale
ja: ローカル関数にブロック本体を使用する
ko: 로컬 함수에 블록 본문 사용
pl: Użyj treści bloku dla funkcji lokalnej
pt_br: Usar o corpo do bloco para função local
ru: Использовать тело блока для локальной функции
tr: Yerel işlev için blok gövdesi kullan
zh_hans: 使用本地函数的块主体
zh_hant: 為區域函式使用區塊主體

source: Use block body for method
cs: Pro metody používat text bloku.
de: Blocktextkörper für Methode verwenden
fr: Utiliser un corps de bloc pour une méthode
it: Usare il corpo del blocco per il metodo
ja: メソッドにブロック本体を使用する
ko: 메서드에 블록 본문 사용
pl: Użyj treści bloku dla metody
pt_br: Usar o corpo do bloco para método
ru: Использовать тело блока для метода
tr: Metot için blok gövdesi kullan
zh_hans: 使用方法的程序块主体
zh_hant: 使用方法的區塊主體

source: Use block body for operator
cs: Pro operátory používat text bloku.
de: Blocktextkörper für Operator verwenden
fr: Utiliser un corps de bloc pour un opérateur
it: Usare il corpo del blocco per l'operatore
ja: オペレーターにブロック本体を使用する
ko: 연산자에 블록 본문 사용
pl: Użyj treści bloku dla operatora
pt_br: Usar o corpo do bloco para operador
ru: Использовать тело блока для оператора
tr: İşleç için blok gövdesi kullan
zh_hans: 使用块主体来表示运算符
zh_hant: 使用運算子的區塊主體

source: Use block body for property
cs: Pro vlastnost použít text bloku.
de: Blocktextkörper für Eigenschaft verwenden
fr: Utiliser un corps de bloc pour les propriétés
it: Usare il corpo del blocco per la proprietà
ja: プロパティにブロック本体を使用する
ko: 속성에 블록 본문 사용
pl: Użyj treści bloku dla właściwości
pt_br: Usar o corpo do bloco para propriedade
ru: Использовать тело блока для свойства
tr: Özellikler için blok gövdesi kullan
zh_hans: 使用属性的块主体
zh_hant: 使用屬性的區塊主體

source: Use explicit type
cs: Použít explicitní typ
de: Expliziten Typ verwenden
es: Usar un tipo explícito
fr: Utiliser un type explicite
it: Usa il tipo esplicito
ja: 明示的な型の使用
ko: 명시적 형식 사용
pl: Użyj jawnego typu
pt_br: Usar o tipo explícito
ru: Использование явного типа
tr: Açık tür kullanma
zh_hans: 使用显式类型
zh_hant: 使用明確類型

source: Use explicit type instead of 'var'
cs: Použít explicitní typ místo var
de: Expliziten Typ anstelle von "var" verwenden
es: Usar un tipo explícito en lugar de 'var'
fr: Utiliser un type explicite au lieu de 'var'
it: Usa il tipo esplicito invece di 'var'
ja: var' ではなく明示的な型を使用します
ko: var' 대신에 명시적 형식을 사용합니다.
pl: Użyj jawnego typu zamiast deklaracji „var”
pt_br: Usar o tipo explícito em vez de 'var'
ru: Использовать явный тип вместо var
tr: Var' yerine açık tür kullan
zh_hans: 用显式类型代替 "var"
zh_hant: 使用明確類型，而非 'var'

source: Use expression body for accessor
cs: Pro přístupové objekty používat text výrazu.
de: Ausdruckskörper für Zugriffsmethode verwenden
fr: Utiliser un corps d'expression pour un accesseur
it: Usare il corpo dell'espressione per la funzione di accesso
ja: アクセサーに式本体を使用する
ko: 접근자에 식 본문 사용
pl: Użyj treści wyrażenia dla metody dostępu
pt_br: Usar o corpo da expressão para acessador
ru: Использовать тело выражения для метода доступа
tr: Erişimci için ifade gövdesi kullan
zh_hans: 使用访问器的表达式主体
zh_hant: 使用存取子的運算式主體

source: Use expression body for constructor
cs: Pro konstruktory používat text výrazu.
de: Ausdruckskörper für Konstruktor verwenden
fr: Utiliser un corps d'expression pour un constructeur
it: Usare il corpo dell'espressione per il costruttore
ja: コンストラクターに式本体を使用する
ko: 생성자에 식 본문 사용
pl: Użyj treści wyrażenia dla konstruktora
pt_br: Usar o corpo da expressão para construtor
ru: Использовать тело выражения для конструктора
tr: Oluşturucu için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示构造函数
zh_hant: 使用建構函式的運算式主體

source: Use expression body for conversion operator
cs: Pro operátory převodu používat text výrazu.
de: Ausdruckstext für Konvertierungsoperator verwenden
fr: Utiliser le corps d’expression pour un opérateur de conversion
it: Usare il corpo dell'espressione per l'operatore di conversione
ja: 変換演算子に式本体を使用する
ko: 변환 연산자에 식 본문 사용
pl: Użyj treści wyrażenia dla operatora konwersji
pt_br: Usar o corpo da expressão para operador de conversão
ru: Использовать тело выражения для оператора преобразования
tr: Dönüştürme işleci için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示转换运算符
zh_hant: 使用轉換運算子的運算式主體

source: Use expression body for indexer
cs: Pro indexery používat text výrazu.
de: Ausdruckskörper für Indexer verwenden
fr: Utiliser un corps d'expression pour un indexeur
it: Usare il corpo dell'espressione per l'indicizzatore
ja: インデクサーに式本体を使用する
ko: 인덱서에 식 본문 사용
pl: Użyj treści wyrażenia dla indeksatora
pt_br: Usar o corpo da expressão para indexador
ru: Использовать тело выражения для индексатора
tr: Dizin oluşturucu için ifade gövdesi kullan
zh_hans: 使用索引器的表达式主体
zh_hant: 使用索引子的運算式主體

source: Use expression body for lambda expression
cs: Pro výrazy lambda používat text výrazu.
de: Ausdruckskörper für Lambdafunktion verwenden
fr: Utiliser le corps d'expression pour une expression lambda
it: Usare il corpo dell'espressione per l'espressione lambda
ja: ラムダ式に式本体を使用する
ko: 람다 식에 식 본문 사용
pl: Użyj treści wyrażenia dla wyrażenia lambda
pt_br: Usar o corpo da expressão para expressão lambda
ru: Использовать тело выражения для лямбда-выражения
tr: Lambda ifadesi için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示 Lambda 表达式
zh_hant: 使用 Lambda 運算式的運算式主體

source: Use expression body for local function
cs: Pro místní funkce používat text výrazu.
de: Ausdruckskörper für lokale Funktion verwenden
fr: Utiliser un corps d'expression pour une fonction locale
it: Usare il corpo dell'espressione per la funzione locale
ja: ローカル関数に式本体を使用する
ko: 로컬 함수에 식 본문 사용
pl: Użyj treści wyrażenia dla funkcji lokalnej
pt_br: Usar o corpo da expressão para função local
ru: Использовать тело выражения для локальной функции
tr: Yerel işlev için ifade gövdesi kullan
zh_hans: 使用本地函数的表达式主体
zh_hant: 為區域函式使用運算式主體

source: Use expression body for method
cs: Pro metody používat text výrazu.
de: Ausdruckskörper für Methode verwenden
fr: Utiliser un corps d'expression pour une méthode
it: Usare il corpo dell'espressione per il metodo
ja: メソッドに式本体を使用する
ko: 메서드에 식 본문 사용
pl: Użyj treści wyrażenia dla metod
pt_br: Usar o corpo da expressão para método
ru: Использовать тело выражения для метода
tr: Metot için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示方法
zh_hant: 使用方法的運算式主體

source: Use expression body for operator
cs: Pro operátory používat text výrazu.
de: Ausdruckskörper für Operator verwenden
fr: Utiliser un corps d'expression pour un opérateur
it: Usare il corpo dell'espressione per l'operatore
ja: オペレーターに式本体を使用する
ko: 연산자에 식 본문 사용
pl: Użyj treści wyrażenia dla operatora
pt_br: Usar o corpo da expressão para operador
ru: Использовать тело выражения для оператора
tr: İşleç için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示运算符
zh_hant: 使用運算子的運算式主體

source: Use expression body for property
cs: Pro vlastnosti používat text výrazu.
de: Ausdruckskörper für Eigenschaft verwenden
fr: Utiliser un corps d'expression pour un propriété
it: Usare il corpo dell'espressione per la proprietà
ja: プロパティに式本体を使用する
ko: 속성에 식 본문 사용
pl: Użyj treści wyrażenia dla właściwości
pt_br: Usar o corpo da expressão para propriedade
ru: Использовать тело выражения для свойства
tr: Özellik için ifade gövdesi kullan
zh_hans: 使用表达式主体来表示属性
zh_hant: 使用屬性的運算式主體

source: Use implicit type
cs: Použít implicitní typ
de: Impliziten Typ verwenden
es: Usar un tipo implícito
fr: Utiliser un type implicite
it: Usa il tipo implicito
ja: 暗黙的な型の使用
ko: 암시적 형식 사용
pl: Użyj niejawnego typu
pt_br: Usar o tipo implícito
ru: Использование неявного типа
tr: Örtük tür kullanma
zh_hans: 使用隐式类型
zh_hant: 使用隱含類型

source: Use implicitly typed lambda
de: Implizit typisierte Lambda verwenden
fr: Utiliser une fonction lambda implicitement typée
it: Usare lambda tipizzata in modo implicito
ko: 암시적으로 형식화된 지정된 람다 사용

source: Use index operator
cs: Použít operátor indexu
de: Indexoperator verwenden
es: Usar operador de índice
fr: Utiliser l'opérateur d'index
it: Usa operatore di indice
ja: インデックス演算子を使用
ko: 인덱스 연산자 사용
pl: Użyj operatora indeksu
pt_br: Usar operador de índice
ru: Использовать оператор индекса
tr: Dizin işleci kullan
zh_hans: 使用索引运算符
zh_hant: 使用索引運算子

source: Use 'is not null' check
cs: Použít kontrolu is not null
de: „Ist nicht NULL“-Überprüfung verwenden
es: Use la comprobación \"is not null\"
fr: Utiliser la vérification 'is not null'
it: Usa il controllo 'is not Null'
ja: 'is not null' チェックを使用します
ko: 'is not null' 검사 사용
pl: Użyj sprawdzania „nie jest wartością null”
pt_br: Usar a verificação “não é nulo”
ru: Использовать проверку \"is not null\"
tr: ‘is not null’ denetimini kullan
zh_hans: 使用 \"is null\" 检查
zh_hant: 使用 'is not null' 檢查

source: Use 'is null' check
cs: Použít kontrolu „is null“
de: "Ist NULL"-Prüfung verwenden
es: Usar comprobación "is null"
fr: Utiliser la vérification 'is null'
it: Usa controllo 'is null'
ja: is null' チェックを使用します
ko: is null' 검사 사용
pl: Użyj sprawdzania „is null”
pt_br: Usar verificação 'is null'
ru: Использовать флажок "is NULL"
tr: is null' denetimini kullan
zh_hans: 使用 "is null" 检查
zh_hant: 使用 'is null' 檢查

source: Use 'is object' check
cs: Použít kontrolu is object
de: „Ist Objekt“-Überprüfung verwenden
es: Use la comprobación \"is object\"
fr: Utiliser la vérification « is object »
it: Usa il controllo 'is object'
ja: 'is object' チェックを使用する
ko: 'is object' 검사 사용
pl: Użyj sprawdzania „jest obiektem”
pt_br: Usar a verificação “é objeto”
ru: Использовать проверку \"is object\"
tr: 'is object' denetimini kullan
zh_hans: 使用 \"is object\" 检查
zh_hant: 使用 'is object' 檢查

source: Use local function
cs: Použít lokální funkci
de: Lokale Funktion verwenden
es: Usar función local
fr: Utiliser une fonction locale
it: Usa la funzione locale
ja: ローカル関数を使用します
ko: 로컬 함수 사용
pl: Użyj funkcji lokalnej
pt_br: Usar função local
ru: Использовать локальную функцию
tr: Yerel işlev kullan
zh_hans: 使用本地函数
zh_hant: 使用區域函式

source: Use 'nameof'
cs: Použít nameof
de: „nameof“ verwenden
fr: Utiliser « nameof »
it: Usare 'nameof'
ja: 'nameof' を使用する
ko: 'nameof' 사용
pl: Użyj wyrażenia „nameof”
pt_br: Usar 'nameof'
ru: Использовать "nameof"
tr: “Nameof” kullan
zh_hans: 使用 "nameof"
zh_hant: 使用 'nameof'

source: Use 'new(...)'
cs: Použít new(...)
de: "new(...)" verwenden
es: Usar "new(...)"
fr: Utiliser 'new(...)'
it: Usa 'new(...)'
ja: 'new(...)' を使用する
ko: 'new(...)' 사용
pl: Użyj operatora „new(...)”
pt_br: Usar 'new(...)'
ru: Используйте "new(...)".
tr: 'new(...)' kullanın
zh_hans: 使用 "new(...)"
zh_hant: 使用 'new(...)'

source: Use pattern matching
cs: Použít porovnávání vzorů
de: Musterabgleich verwenden
es: Usar coincidencia de patrones
fr: Utiliser les critères spéciaux
it: Usa i criteri di ricerca
ja: パターン マッチングを使用します
ko: 패턴 일치 사용
pl: Użyj dopasowywania wzorców
pt_br: Usar a correspondência de padrão
ru: Используйте сопоставление шаблонов
tr: Desen eşleştirme kullan
zh_hans: 使用模式匹配
zh_hant: 使用模式比對

source: Use pattern matching (may change code meaning)
cs: Použít porovnávání vzorů (může změnit význam kódu)
de: Musterabgleich verwenden (kann Codebedeutung ändern)
es: Usar coincidencia de patrones (puede cambiar el significado del código)
fr: Utiliser la correspondance de modèle (peut modifier la signification du code)
it: Usa i criteri di ricerca (può cambiare il significato del codice)
ja: パターン マッチングを使用する (コードが変わる可能性があります)
ko: 패턴 일치 사용(코드 의미를 변경할 수 있음)
pl: Użyj porównywania ze wzorcem (może zmienić znaczenie kodu)
pt_br: Usar a correspondência de padrões (pode alterar o significado do código)
ru: Использовать сопоставление шаблонов (может измениться значение кода)
tr: Desen eşlemeyi kullan (kod anlamını değiştirebilir)
zh_hans: 使用模式匹配(可能会更改代码含义)
zh_hant: 使用模式比對 (可能會變更程式碼的含義)

source: Use primary constructor
cs: Použít primární konstruktor
de: Primären Konstruktor verwenden
fr: Utiliser le constructeur principal
it: Usa costruttore primario
ja: プライマリ コンストラクターの使用
ko: 기본 생성자 사용
pl: Użyj konstruktora podstawowego
pt_br: Usar construtor primário
ru: Использовать основной конструктор
tr: Birincil oluşturucuyu kullan
zh_hans: 使用主构造函数
zh_hant: 使用主要建構函式

source: Use range operator
cs: Použít operátor rozsahu
de: Bereichsoperator verwenden
es: Usar el operador de intervalo
fr: Utiliser l'opérateur de plage
it: Usa l'operatore di intervallo
ja: 範囲演算子を使用
ko: 범위 연산자 사용
pl: Użyj operatora zakresu
pt_br: Usar operador de intervalo
ru: Использовать оператор диапазона
tr: Aralık işleci kullan
zh_hans: 使用范围运算符
zh_hant: 使用範圍運算子

source: Use simple 'using' statement
cs: Použít jednoduchý příkaz using
de: Einfache using-Anweisung verwenden
es: Use la instrucción "using" simple
fr: Utiliser une instruction 'using' simple
it: Usa l'istruzione 'using' semplice
ja: 単純な 'using' ステートメントを使用する
ko: 간단한 'using' 문 사용
pl: Użyj prostej instrukcji „using”
pt_br: Usar a instrução 'using' simples
ru: Использовать простой оператор using
tr: Basit 'using' deyimini kullan
zh_hans: 使用简单的 "using" 语句
zh_hant: 使用簡單的 'using' 陳述式

source: Use 'switch' expression
cs: Použít výraz switch
de: Switch-Ausdruck verwenden
es: Usar la expresión "switch"
fr: Utiliser l'expression 'switch'
it: Usa l'espressione 'switch'
ja: 'switch' 式を使用します
ko: 'switch' 식 사용
pl: Użyj wyrażenia „switch”
pt_br: Usar a expressão 'switch'
ru: Использовать выражение switch
tr: 'Switch' ifadesini kullan
zh_hans: 使用 "switch" 表达式
zh_hant: 使用 'switch' 運算式

source: Use tuple to swap values
cs: Prohození hodnot pomocí řazené kolekce členů
de: Tupel zum Tauschen von Werten verwenden
es: Utilizar tupla para intercambiar valores
fr: Utilisez le tuple pour échanger des valeurs
it: Usa la tupla per scambiare i valori
ja: タプルを使用して値をスワップする
ko: 튜플을 사용하여 값 바꾸기
pl: Użyj krotki do zamiany wartości
pt_br: Usar a tupla para trocar valores
ru: Использовать кортеж для переключения значений
tr: Değerleri değiştirmek için demeti kullanın
zh_hans: 使用元组交换值
zh_hant: 使用元組交換值

source: Use unbound generic type
de: Ungebundenen generischen Typ verwenden
fr: Utiliser un type générique indépendant
it: Usa tipo generico non associato
ko: 바인딩되지 않은 제네릭 형식 사용
pl: Użyj niepowiązanego typu ogólnego
pt_br: Usar tipo genérico não associado
tr: Bağlı olmayan genel tür kullan

source: Using directives must be placed inside of a namespace declaration
cs: Direktivy using se musí umístit do deklarace namespace.
de: Using-Anweisungen müssen in einer namespace-Deklaration platziert werden.
es: Las directivas using deben colocarse dentro de una declaración de namespace
fr: Les directives using doivent être placées dans une déclaration namespace
it: Le direttive using devono essere inserite all'interno di una dichiarazione di namespace
ja: using ディレクティブを namespace 宣言の中に配置する必要があります
ko: Using 지시문은 namespace 선언 내부에 배치되어야 합니다.
pl: Dyrektywy using muszą znajdować się wewnątrz deklaracji namespace
pt_br: As diretivas using precisam ser colocadas dentro de uma declaração de namespace
ru: Директивы using должны находиться внутри объявления namespace
tr: Using yönergelerinin bir namespace bildiriminin içine yerleştirilmesi gerekir
zh_hans: using 指令必须放在 namespace 声明的内部
zh_hant: using 指示詞必須放在 namespace 宣告內

source: Using directives must be placed outside of a namespace declaration
cs: Direktivy using se musí umístit mimo deklaraci namespace.
de: Using-Anweisungen müssen außerhalb einer namespace-Deklaration platziert werden.
es: Las directivas using deben colocarse fuera de una declaración de namespace
fr: Les directives using doivent être placées en dehors d'une déclaration namespace
it: Le direttive using devono essere inserite all'esterno di una dichiarazione di namespace
ja: using ディレクティブを namespace 宣言の外に配置する必要があります
ko: Using 지시문은 namespace 선언 외부에 배치되어야 합니다.
pl: Dyrektywy using muszą znajdować się poza deklaracją namespace
pt_br: As diretivas using precisam ser colocadas fora de uma declaração de namespace
ru: Директивы using должны находиться вне объявления namespace
tr: Using yönergelerinin bir namespace bildiriminin dışına yerleştirilmesi gerekir
zh_hans: using 指令必须放在 namespace 声明之外
zh_hant: using 指示詞必須放在 namespace 宣告外

source: Variable declaration can be deconstructed
cs: Deklaraci proměnné je možné dekonstruovat.
de: Die Variablendeklaration kann dekonstruiert werden.
es: La declaración de variables se puede desconstruir.
fr: La déclaration de variable peut être déconstruite
it: La dichiarazione di variabile può essere decostruita
ja: 変数の宣言を分解できます
ko: 변수 선언을 분해할 수 있습니다.
pl: Deklaracja zmiennej może zostać zdekonstruowana
pt_br: A declaração de variável pode ser desconstruída
ru: Объявление переменной можно деконструировать
tr: Değişken bildirimi ayrıştırılabilir
zh_hans: 可以析构变量声明
zh_hant: 變數宣告可進行解構
