Repository: dotnet/roslyn
Catalog: src/PublicApiAnalyzers/Core/Analyzers/xlf/PublicApiAnalyzerResources.*.xlf
Languages: cs, de, fr, it, ko, pt_br, ru, tr, zh_hans, zh_hant

# AddAllItemsInDocumentToThePublicApiTitle
source: Add all items in document '{0}' to the public API
cs: Přidat všechny položky v dokumentu {0} do veřejného rozhraní API
de: Alle Elemente im Dokument "{0}" der öffentlichen API hinzufügen
fr: Ajouter tous les éléments du document '{0}' à l'API publique
it: Aggiungi tutti gli elementi del documento '{0}' all'API pubblica
ko: '{0}' 문서의 모든 항목을 퍼블릭 API에 추가
ru: Добавление всех элементов в документе "{0}" в общедоступный API
tr: '{0}' belgesindeki tüm öğeleri genel API'ye ekle
zh_hant: 將文件 '{0}' 中的所有項目新增至公用 API

# AddAllItemsInProjectToThePublicApiTitle
source: Add all items in project '{0}' to the public API
cs: Přidat všechny položky v projektu {0} do veřejného rozhraní API
de: Alle Elemente im Projekt "{0}" der öffentlichen API hinzufügen
fr: Ajouter tous les éléments du projet '{0}' à l'API publique
it: Aggiungi tutti gli elementi del progetto '{0}' all'API pubblica
ko: '{0}' 프로젝트의 모든 항목을 퍼블릭 API에 추가
ru: Добавление всех элементов в проекте "{0}" в общедоступный API
tr: '{0}' projesindeki tüm öğeleri genel API'ye ekle
zh_hant: 將專案 '{0}' 中的所有項目新增至公用 API

# AddAllItemsInTheSolutionToThePublicApiTitle
source: Add all items in the solution to the public API
cs: Přidat všechny položky v řešení do veřejného rozhraní API
de: Alle Elemente in der Projektmappe der öffentlichen API hinzufügen
fr: Ajouter tous les éléments de la solution à l'API publique
it: Aggiungi tutti gli elementi della soluzione all'API pubblica
ko: 솔루션의 모든 항목을 퍼블릭 API에 추가
ru: Добавление всех элементов в решении в общедоступный API
tr: Çözümdeki tüm öğeleri genel API'ye ekle
zh_hant: 將解決方案中的所有項目新增至公用 API

# AnnotateAllItemsInDocumentToThePublicApiTitle
source: Annotate all items in document '{0}' in the public API
cs: Přidat anotaci ke všem položkám v dokumentu {0} ve veřejném rozhraní API
de: Alle Elemente im Dokument "{0}" in der öffentlichen API anmerken
fr: Annoter tous les éléments du document '{0}' dans l'API publique
it: Annota tutti gli elementi del documento '{0}' nell'API pubblica
ko: 퍼블릭 API에서 '{0}' 문서의 모든 항목에 주석 추가
ru: Аннотирование всех элементов в документе "{0}" в общедоступном API
tr: Genel API'de yer alan '{0}' belgesindeki tüm öğelere not ekle
zh_hant: 標註公用 API 中文件 '{0}' 的所有項目

# AnnotateAllItemsInProjectToThePublicApiTitle
source: Annotate all items in project '{0}' in the public API
cs: Přidat anotaci ke všem položkám v projektu {0} ve veřejném rozhraní API
de: Alle Elemente im Projekt "{0}" in der öffentlichen API anmerken
fr: Annoter tous les éléments du projet '{0}' dans l'API publique
it: Annota tutti gli elementi del progetto '{0}' nell'API pubblica
ko: 퍼블릭 API에서 '{0}' 프로젝트의 모든 항목에 주석 추가
ru: Аннотирование всех элементов в проекте "{0}" в общедоступном API
tr: Genel API'de yer alan '{0}' projesindeki tüm öğelere not ekle
zh_hant: 標註公用 API 中專案 '{0}' 的所有項目

# AnnotateAllItemsInTheSolutionToThePublicApiTitle
source: Annotate all items in the solution in the public API
cs: Přidat anotaci ke všem položkám v řešení ve veřejném rozhraní API
de: Alle Elemente in der Projektmappe in der öffentlichen API anmerken
fr: Annoter tous les éléments de la solution dans l'API publique
it: Annota tutti gli elementi della soluzione nell'API pubblica
ko: 퍼블릭 API에서 솔루션의 모든 항목에 주석 추가
ru: Аннотирование всех элементов в решении в общедоступном API
tr: Genel API'de yer alan çözümdeki tüm öğelere not ekle
zh_hant: 標註公用 API 中解決方案的所有項目

# AnnotatePublicApiDescription
source: All public types and members should be declared with nullability annotations in PublicAPI.txt. This draws attention to API nullability changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny veřejné typy a členy by se měly deklarovat s anotacemi o možnosti použití hodnoty null v souboru PublicAPI.txt. To přitáhne pozornost ke změnám možnosti použití hodnoty null u rozhraní API při revizích a v historii správy zdrojového kódu a pomůže předejít změnám způsobujícím chybu.
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" mit Anmerkungen zur NULL-Zulässigkeit deklariert werden. Dadurch wird die Aufmerksamkeit auf Änderungen an der NULL-Zulässigkeit der API in den Code Reviews und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
fr: Tous les types et membres publics doivent être déclarés avec des annotations de nullabilité dans PublicAPI.txt. Cela permet d'attirer l'attention sur les changements apportés à la nullabilité de l'API dans les revues de code et l'historique de contrôle de code source. Cela permet également d'éviter les changements cassants.
it: Tutti i tipi e i membri public devono essere dichiarati con annotazioni di supporto dei valori Null in PublicAPI.txt. In questo modo si richiama l'attenzione sulle modifiche del supporto dei valori Null all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e si contribuisce a evitare modifiche che causano un'interruzione.
ko: 모든 public 형식 및 멤버는 PublicAPI.txt에서 Null 허용 여부 주석을 포함하여 선언되어야 합니다. 그러면 코드 검토 및 소스 제어 기록에서 API Null 허용 여부 변경 내용을 쉽게 확인할 수 있고 호환성이 손상되는 변경을 방지할 수 있습니다.
ru: Все открытые типы и элементы должны быть объявлены в PublicAPI.txt с заметками допустимости значений NULL. Это привлекает внимание к изменениям допустимости значений NULL в API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm genel türler ve üyeler PublicAPI.txt içinde null atanabilirlik ek açıklamalarıyla bildirilmelidir. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API null atanabilirlik değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hant: 在 PublicAPI.txt 中宣告所有公用類型與成員時，應提供可 NULL 性註釋。此動作會引起對程式碼檢閱與原始檔控制記錄中 API 可 NULL 性變更的注意，有助於避免發生中斷性變更。

# AnnotatePublicApiMessage
source: Symbol '{0}' is missing nullability annotations in the declared API
fr: Il manque des annotations de nullabilité pour le symbole '{0}' dans l'API déclarée.

# AnnotatePublicApiTitle
source: Annotate nullability of public types and members in the declared API
cs: Přidat anotace o možnosti použití hodnoty null u veřejných typů a členů v deklarovaném rozhraní API
de: NULL-Zulässigkeit öffentlicher Typen und Member in der deklarierten API anmerken
fr: Annoter la nullabilité des types et des membres publics dans l'API déclarée
it: Annota il supporto dei valori Null di tipi e membri public nell'API dichiarata
ko: 선언된 API에서 public 형식 및 멤버의 Null 허용 여부 주석 추가
ru: Аннотирование допустимости значений NULL для открытых типов и элементов в объявленном API
tr: Bildirilen API'deki genel türlerin ve üyelerin null atanabilirliğine not ekle
zh_hant: 標註已宣告 API 中公用類型和成員的可 NULL 性

# AvoidMultipleOverloadsWithOptionalParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Do not add multiple overloads with optional parameters'. See '{1}' for details.
cs: Symbol {0} porušuje požadavek na zpětnou kompatibilitu: Nepřidávat více přetížení s nepovinnými parametry. Podrobnosti najdete tady: {1}
de: Das Symbol "{0}" verletzt die backcompat-Anforderung: Nicht mehrere Überladungen mit optionalen Parametern hinzufügen. Details finden Sie unter "{1}".
fr: Le symbole '{0}' viole l'exigence de compatibilité descendante : 'Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels'. Pour plus d'informations, consultez '{1}'.
it: Il simbolo '{0}' viola il requisito di compatibilità con le versioni precedenti: 'Non aggiungere più overload public con parametri facoltativi'. Per dettagli, vedere '{1}'.
ko: '{0}' 기호가 backcompat 요구 사항인 '선택적 매개 변수가 있는 여러 오버로드를 추가하지 마세요.'를 위반합니다. 자세한 내용은 '{1}'을(를) 참조하세요.
pt_br: O símbolo '{0}' viola o requisito de backcompat: 'Não adicione várias sobrecargas com parâmetros opcionais'. Confira '{1}' para obter detalhes.
ru: Символ "{0}" нарушает требование обратной совместимости: "Не добавляйте несколько перегрузок с необязательными параметрами". Дополнительные сведения см. в "{1}" .
tr: '{0}' sembolü geriye dönük uyumluluk gereksinimini ihlal ediyor: 'İsteğe bağlı parametreleri olan birden fazla aşırı yükleme eklemeyin'. Ayrıntılar için bkz. '{1}'.
zh_hans: 符号“{0}”违反了 backcompat 要求:“请勿添加具有可选参数的多个重载”。有关详细信息，请参阅“{1}”。
zh_hant: 符號 '{0}' 違反回溯相容性需求:「請勿新增具備選擇性參數的多項多載」。請參閱 '{1}' 以取得詳細資料。

# AvoidMultipleOverloadsWithOptionalParametersTitle
source: Do not add multiple public overloads with optional parameters
cs: Nepřidávat více přetížení s nepovinnými parametry
de: Nicht mehrere Überladungen mit optionalen Parametern hinzufügen
fr: Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels
it: Non aggiungere più overload public con parametri facoltativi
ko: 선택적 매개 변수가 있는 여러 공용 오버로드를 추가하지 마세요.
pt_br: Não adicione várias sobrecargas públicas com parâmetros opcionais
ru: Не добавляйте несколько общедоступных перегрузок с необязательными параметрами
tr: İsteğe bağlı parametreleri olan birden fazla genel aşırı yükleme eklemeyin
zh_hans: 请勿添加具有可选参数的多个公共重载
zh_hant: 無法新增多個具有選擇性參數的公用多載

# DeclarePublicApiDescription
source: All public types and members should be declared in PublicAPI.txt. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny veřejné typy a členy by se měly deklarovat v souboru PublicAPI.txt. To přivádí pozornost ke změnám rozhraní API v revizích a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" deklariert werden. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Codeüberprüfungen und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
fr: Tous les types et membres publics doivent être déclarés dans PublicAPI.txt. Cela permet d'attirer l'attention sur les changements apportés à l'API dans les revues de code et l'historique de contrôle de code source. Cela permet également d'éviter les changements cassants.
it: Tutti i tipi e i membri public devono essere dichiarati in PublicAPI.txt. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e contribuisce a evitare modifiche che causano un'interruzione.
ko: 모든 public 형식 및 멤버는 PublicAPI.txt에서 선언해야 합니다. 이로 인해 코드 검토 및 소스 제어 기록에서 API 변경 내용을 쉽게 확인할 수 있고 큰 변경을 방지할 수 있습니다.
pt_br: Todos os tipos e membros públicos devem ser declarados no PublicAPI.txt. Isso chama a atenção para as alterações da API no histórico de revisões de código e de controle do código-fonte e ajuda a evitar alterações da falha.
ru: Все открытые типы и элементы должны быть объявлены в PublicAPI.txt. Это привлекает внимание к изменениям API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Tüm genel türler ve üyeler PublicAPI.txt içinde bildirilmelidir. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 应在 PublicAPI.txt 中声明所有公共类型和成员。这将关注代码评审和源代码管理历史记录中的 API 更改，并有助于防止重大更改。
zh_hant: 應在 PublicAPI.txt 中宣告所有公用類型與成員。此舉會讓您注意到程式碼檢閱與原始檔控制歷程記錄中的 API 變更，同時有助於避免發生中斷性變更。

# DeclarePublicApiMessage
source: Symbol '{0}' is not part of the declared API
fr: Le symbole '{0}' ne fait pas partie de l'API déclarée.

# DeclarePublicApiTitle
source: Add public types and members to the declared API
cs: Přidat veřejné typy a členy do deklarovaného rozhraní API
de: Öffentliche Typen und Member der deklarierten API hinzufügen
fr: Ajouter des types et membres publics à l'API déclarée
it: Aggiungere tipi e membri public all'API dichiarata
ko: 선언된 API에 공용 형식 및 멤버 추가
pt_br: Adicionar membros e tipos públicos à API declarada
ru: Добавьте открытые типы и элементы в объявленный API
tr: Genel türleri ve üyeleri bildirilen API'ye ekleyin
zh_hans: 向已声明 API 添加公共类型和成员
zh_hant: 為宣告的 API 新增公用類型與成員

# DuplicateSymbolsInPublicApiFilesMessage
source: The symbol '{0}' appears more than once in the public API files
fr: Le symbole '{0}' apparaît plusieurs fois dans les fichiers de l'API publique.

# DuplicateSymbolsInPublicApiFilesTitle
source: Do not duplicate symbols in public API files
cs: Neduplikovat symboly v souborech veřejných rozhraní API
de: Symbole in öffentlichen API-Dateien nicht duplizieren
fr: Ne pas dupliquer les symboles dans les fichiers d'une API publique
it: Non duplicare simboli nei file dell'API pubblica
ko: 공용 API 파일에서 기호를 복제하지 마세요.
pt_br: Não duplique símbolos em arquivos de API pública
ru: Не дублируйте символы в файлах открытого API
tr: Genel API dosyalarında sembolleri yinelemeyin
zh_hans: 请勿在公共 API 文件中复制符号
zh_hant: 請勿在公用 API 檔案中使用重複的符號

# EnableNullableInProjectToThePublicApiTitle
source: Enable nullability annotations in the public API for project '{0}'
cs: Povolit anotace o možnosti použití hodnoty null ve veřejném rozhraní API pro projekt {0}
de: Anmerkungen zur NULL-Zulässigkeit in der öffentlichen API für das Projekt "{0}" aktivieren
fr: Activer les annotations de nullabilité dans l'API publique pour le projet '{0}'
it: Abilita le annotazioni di supporto dei valori Null nell'API pubblica per il progetto '{0}'
ko: 퍼블릭 API에서 '{0}' 프로젝트에 Null 허용 여부 주석 사용
ru: Включите заметки о допустимости значений NULL в общедоступном API для проекта "{0}"
tr: '{0}' projesi için genel API'deki null atanabilirlik ek açıklamalarını etkinleştir
zh_hant: 啟用公用 API 中專案 '{0}' 的可 NULL 性註釋

# EnableNullableInTheSolutionToThePublicApiTitle
source: Enable nullability annotations in the public API for the solution
cs: Povolit anotace o možnosti použití hodnoty null ve veřejném rozhraní API pro řešení
de: Anmerkungen zur NULL-Zulässigkeit in der öffentlichen API für die Projektmappe aktivieren
fr: Activer les annotations de nullabilité dans l'API publique pour la solution
it: Abilita le annotazioni di supporto dei valori Null nell'API pubblica per la soluzione
ko: 퍼블릭 API에서 솔루션에 Null 허용 여부 주석 사용
ru: Включите заметки о допустимости значений NULL в общедоступном API для решения
tr: Çözüm için genel API'deki null atanabilirlik ek açıklamalarını etkinleştir
zh_hant: 啟用公用 API 中解決方案的可 NULL 性註釋

# ExposedNoninstantiableTypeMessage
source: Constructor makes its noninheritable base class inheritable, thereby exposing its protected members
fr: Le constructeur fait de sa classe de base non héritable une classe héritable, exposant ainsi ses membres protégés.

# ExposedNoninstantiableTypeTitle
source: Constructor make noninheritable base class inheritable
cs: Konstruktor činí z nedědičné základní třídy dědičnou.
de: Konstruktor macht nicht vererbbare Basisklasse vererbbar
fr: Le constructeur fait de la classe de base noninheritable une classe inheritable
it: Il costruttore rende ereditabile la classe di base non ereditabile
ko: 생성자가 상속할 수 없는 기본 클래스를 상속할 수 있도록 만듭니다.
pt_br: O construtor transforma a classe base não herdável em herdável
ru: Конструктор делает ненаследуемый базовый класс наследуемым
tr: Oluşturucu, devralınamayan temel sınıfı devralınabilir hale getirir
zh_hans: 构造函数使不可继承的基类可以继承
zh_hant: 建構函式可將無法繼承的基底類別變成為可繼承

# ObliviousPublicApiDescription
source: All public members should use either nullable or non-nullable reference types, but no oblivious reference types.
cs: Všechny veřejné členy by měly používat odkazové typy s možnou hodnotou null, nebo bez ní, ale ne odkazové typy bez určení možnosti použití hodnoty null.
de: Alle öffentlichen Member sollten Verweistypen, die NULL-Werte zulassen oder nicht zulassen, aber keine nicht beachtenden Verweistypen verwenden.
fr: Tous les membres publics doivent utiliser des types référence nullables ou non nullables, mais aucun type référence inconscient.
it: Tutti i membri pubblici devono usare tipi riferimento nullable o non nullable, ma non tipi riferimento oblivious.
ko: 모든 public 멤버는 nullable 또는 nullable이 아닌 참조 형식을 사용해야 하지만, 인식 불가능한 참조 형식은 사용하면 안 됩니다.
ru: Все открытые элементы должны использовать ссылочные типы, допускающие или не допускающие значение null, но не игнорируемые ссылочные типы.
tr: Tüm genel üyeler null atanabilir veya null atanamaz başvuru türleri kullanmalıdır ancak uyarısız atanabilen başvuru türü içermemelidir.
zh_hant: 所有公開成員都應使用可為 Null 或不可為 Null 的參考型別，但不可使用無警示的參考型別。

# ObliviousPublicApiMessage
source: Symbol '{0}' uses some oblivious reference types
fr: Le symbole '{0}' utilise des types référence inconscients.

# ObliviousPublicApiTitle
source: Public members should not use oblivious types
cs: Veřejné členy by neměly používat typy bez určení možnosti použití hodnoty null
de: Öffentliche Member dürfen keine nicht beachtenden Typen verwenden.
fr: Les membres publics ne doivent pas utiliser de types inconscients
it: I membri pubblici non devono usare tipi oblivious
ko: public 멤버는 인식 불가능한 형식을 사용하면 안 됨
ru: Открытые элементы не должны использовать игнорируемые типы
tr: Genel üyeler uyarısız atanabilen türler kullanmamalıdır
zh_hant: 公開成員不應使用無警示類型

# OverloadWithOptionalParametersShouldHaveMostParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Public API with optional parameter(s) should have the most parameters amongst its public overloads'. See '{1}' for details.
cs: Symbol {0} porušuje požadavek na zpětnou kompatibilitu: Veřejné rozhraní API s nepovinnými parametry by mělo mít ze všech veřejných přetížení nejvíce parametrů. Podrobnosti najdete tady: {1}
de: Das Symbol "{0}" verletzt die backcompat-Anforderung: Öffentliche API mit optionalen Parametern muss die meisten Parameter bei den öffentlichen Überladungen aufweisen. Details finden Sie unter "{1}".
fr: Le symbole '{0}' viole l'exigence de compatibilité descendante : 'L'API publique avec un ou plusieurs paramètres optionnels doit avoir le plus de paramètres possibles parmi ses surcharges publiques'. Pour plus d'informations, consultez '{1}'.
it: Il simbolo '{0}' viola il requisito di compatibilità con le versioni precedenti: 'L'API pubblica con parametri facoltativi deve includere la maggior parte dei parametri tra i relativi overload public'. Per dettagli, vedere '{1}'.
ko: '{0}' 기호가 backcompat 요구 사항인 '선택적 매개 변수가 있는 공용 API에는 공용 오버로드 중 가장 많은 매개 변수를 보유해야 합니다.'를 위반합니다. 자세한 내용은 '{1}'을(를) 참조하세요.
pt_br: O símbolo '{0}' viola o requisito de backcompat: 'A API pública com parâmetros opcionais deve ter a maioria dos parâmetros entre suas sobrecargas públicas. Confira '{1}' para obter detalhes.
ru: Символ "{0}" нарушает требование обратной совместимости: "Открытый API с необязательными параметрами должен иметь основную часть параметров среди своих открытых перегрузок". Дополнительные сведения см. в "{1}".
tr: '{0}' sembolü geriye dönük uyumluluk gereksinimini ihlal ediyor: 'İsteğe bağlı parametreleri olan genel API'nin, genel aşırı yüklemeleri arasında en çok parametreye sahip olması gerekir.' Ayrıntılar için bkz. '{1}'.
zh_hans: 符号“{0}”违反了 backcompat 要求:“具有可选参数的公共 API 应在其公共重载中具有最多参数”。有关详细信息，请参阅“{1}”。
zh_hant: 符號 '{0}' 違反回溯相容性需求:「具有選擇性參數的公用 API，大部分的參數應位於其公用多載之間。」。請參閱 '{1}' 以取得詳細資料。

# OverloadWithOptionalParametersShouldHaveMostParametersTitle
source: Public API with optional parameter(s) should have the most parameters amongst its public overloads
fr: L'API publique avec un ou plusieurs paramètres optionnels doit avoir le plus de paramètres possibles parmi ses surcharges publiques.

# PublicApiFileMissingMessage
source: Public API file '{0}' is missing or not marked as an additional analyzer file
fr: Le fichier d'API publique '{0}' est manquant ou n'est pas marqué en tant que fichier d'analyseur supplémentaire
tr: '{0}' genel API dosyası eksik veya ek bir çözümleyici dosyası olarak işaretlenmemiş

# PublicApiFileMissingTitle
source: Missing shipped or unshipped public API file
fr: Absence du fichier d'API publique fournie ou non fournie
tr: Gönderilmiş veya gönderilmemiş genel API dosyası eksik

# PublicApiFilesInvalidMessage
source: The contents of the public API files are invalid: {0}
cs: Obsah souborů veřejných rozhraní API není platný: {0}
de: Die Inhalte der öffentlichen API-Dateien sind ungültig: {0}
fr: Le contenu des fichiers de l'API publique est non valide : {0}
it: Il contenuto dei file dell'API pubblica non è valido: {0}
ko: 공용 API 파일의 콘텐츠가 유효하지 않습니다. {0}
pt_br: O conteúdo dos arquivos da API pública é inválido: {0}
ru: Недопустимое содержимое файлов открытого API: {0}
tr: Genel API dosyalarının içerikleri geçersiz: {0}
zh_hans: 公共 API 文件的内容无效: {0}
zh_hant: 公用 API 檔案的內容無效: {0}

# PublicApiFilesInvalidTitle
source: The contents of the public API files are invalid
cs: Obsah souborů veřejných rozhraní API není platný
de: Inhalte der öffentlichen API-Dateien sind ungültig
fr: Le contenu des fichiers de l'API publique est non valide
it: Il contenuto dei file dell'API pubblica non è valido
ko: 공용 API 파일의 콘텐츠가 유효하지 않습니다.
pt_br: O conteúdo dos arquivos da API pública é inválido
ru: Недопустимое содержимое файлов открытого API
tr: Genel API dosyalarının içerikleri geçersiz
zh_hans: 公共 API 文件的内容无效
zh_hant: 公用 API 檔案的內容無效

# PublicApiFilesMissingMessage
source: The solution must contain two files with the type "AdditionalFiles": PublicAPI.Unshipped.txt and PublicAPI.Shipped.txt. At least one of these files is missing or has the wrong type.
cs: Řešení musí obsahovat dva soubory typu AdditionalFiles: PublicAPI.Unshipped.txt a PublicAPI.Shipped.txt. Nejméně jeden z těchto souborů chybí nebo nemá správný typ.
de: Die Projektmappe muss zwei Dateien mit dem Typ "AdditionalFiles" enthalten: "PublicAPI.Unshipped.txt" und "PublicAPI.Shipped.txt". txt. Mindestens eine dieser Dateien fehlt oder weist den falschen Typ auf.
fr: La solution doit contenir deux fichiers ayant le type "AdditionalFiles" : PublicAPI.Unshipped.txt et PublicAPI.Shipped.txt. L'un de ces fichiers est manquant, ou son type est incorrect.
it: La soluzione deve contenere due file con il tipo "AdditionalFiles": PublicAPI.unshipped.txt e PublicAPI.shipped.txt. Almeno uno di questi file manca o è di tipo errato.
ko: 솔루션에 "AdditionalFiles": PublicAPI.Unshipped.txt 및 PublicAPI.Shipped.txt 형식의 파일이 두 개 포함되어야 합니다. 이러한 파일 중 하나 이상이 없거나 형식이 잘못되었습니다.
pt_br: A solução precisa conter dois arquivos com o tipo "AdditionalFiles": PublicAPI.Unshipped.txt e PublicAPI.Shipped.txt. Pelo menos um desses arquivos está ausente ou tem o tipo errado.
ru: Решение должно содержать два файла с типом "AdditionalFiles": PublicAPI.Unshipped.txt и PublicAPI.Shipped.txt. По меньшей мере один из этих файлов отсутствует или имеет неправильный тип.
tr: Çözüm, "AdditionalFiles" türüne sahip iki dosya içermelidir: PublicAPI.Unshipped.txt ve PublicAPI.Shipped.txt. Bu dosyalardan en az biri eksik veya yanlış türe sahip.
zh_hant: 解決方案必須包含兩個類型為 "AdditionalFiles" 的檔案: PublicAPI.Unshipped.txt 與 PublicAPI.Shipped.txt。其中至少缺少一個檔案或檔案類型錯誤。

# PublicApiFilesMissingTitle
source: One or both of the public API files are missing
cs: Chybí nejméně jeden soubor veřejného rozhraní API
de: Mindestens eine der öffentlichen API-Dateien fehlt.
fr: Il manque l'un des deux fichiers d'API publiques, ou les deux
it: Uno o entrambi i file dell'API pubblica sono mancanti
ko: 공용 API 파일 중 하나 또는 둘 다 없습니다.
pt_br: Um ou ambos os arquivos de API pública estão ausentes
ru: Отсутствует один или оба файла открытого API
tr: Ortak API dosyalarından biri veya her ikisi de eksik
zh_hant: 缺少兩個公用 API 檔案的其中一個或兩者

# PublicImplicitConstructorErrorMessageName
source: implicit constructor for '{0}'
cs: implicitní konstruktor pro {0}
de: Impliziter Konstruktor für "{0}"
fr: constructeur implicite pour '{0}'
it: costruttore implicito per '{0}'
ko: '{0}'의 암시적 생성자
ru: неявный конструктор для "{0}"
tr: '{0}' için örtük oluşturucu
zh_hant: '{0}' 的隱含建構函式
