Repository: dotnet/roslyn
Catalog: src/PublicApiAnalyzers/Core/Analyzers/xlf/PublicApiAnalyzerResources.*.xlf
Languages: cs, de, fr, it, ko, pt_br, ru, tr, zh_hans, zh_hant

# PublicImplicitGetAccessor
source: implicit get-accessor for '{0}'
cs: implicitní přístupový objekt get pro {0}
de: Impliziter get-Accessor für "{0}"
fr: accesseur get implicite pour '{0}'
it: funzione di accesso get implicita per '{0}'
ko: '{0}'의 암시적 get 접근자
ru: неявный метод доступа get для "{0}"
tr: '{0}' için örtük get erişimcisi
zh_hant: '{0}' 的隱含 get 存取子

# PublicImplicitSetAccessor
source: implicit set-accessor for '{0}'
cs: implicitní přístupový objekt set pro {0}
de: Impliziter set-Accessor für "{0}"
fr: accesseur set implicite pour '{0}'
it: funzione di accesso set implicita per '{0}'
ko: '{0}'의 암시적 set 접근자
ru: неявный метод доступа set для "{0}"
tr: '{0}' için örtük set erişimcisi
zh_hant: '{0}' 的隱含 set 存取子

# RemoveDeletedApiDescription
source: When removing a public type or member the corresponding entry in PublicAPI.txt should also be removed. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Když se odebírá veřejný typ nebo člen, měla by se odebrat i odpovídající položka v souboru PublicAPI.txt. To přivádí pozornost ke změnám rozhraní API v revizích a historii správy zdrojového kódu a pomáhá předcházet změnám způsobujícím chybu.
de: Beim Entfernen eines öffentlichen Typs oder Members muss auch der entsprechende Eintrag in "PublicAPI.txt" entfernt werden. Dadurch wird die Aufmerksamkeit auf API-Änderungen in den Codeüberprüfungen und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
fr: Quand vous supprimez un type ou un membre public, l'entrée correspondante dans PublicAPI.txt doit également être supprimée. Cela attire l'attention sur les changements apportés à l'API dans les revues de code et l'historique du contrôle de code source. De plus, cela permet d'éviter les changements cassants.
it: Quando si rimuove un tipo o un membro public, è necessario rimuovere anche la voce corrispondente in PublicAPI.txt. In questo modo si richiama l'attenzione sulle modifiche all'API nelle revisioni del codice e nella cronologia del controllo del codice sorgente e contribuisce a evitare modifiche che causano un'interruzione.
ko: public 형식 및 멤버를 제거하면 PublicAPI.txt의 해당 항목도 제거되어야 합니다. 이로 인해 코드 검토 및 소스 제어 기록에서 API 변경 내용을 쉽게 확인할 수 있고 큰 변경을 방지할 수 있습니다.
pt_br: Quando um tipo ou membro público é removido, a entrada correspondente no PublicAPI.txt também deve ser removida. Isso chama a atenção para alterações da API no histórico de revisões de código e de controle do código-fonte e ajuda a evitar alterações da falha.
ru: При удалении открытого типа или элемента следует удалить и соответствующую запись в PublicAPI.txt. Это привлекает внимание к изменениям API при проверках кода и в журнале системы управления версиями и помогает предотвратить критические изменения.
tr: Bir genel tür veya üye kaldırılırken PublicAPI.txt dosyasındaki karşılık gelen girişin de kaldırılması gerekir. Bu işlem, kod incelemeleri ve kaynak denetimi geçmişindeki API değişikliklerine dikkat çeker ve hataya neden olan değişikliklerin önlenmesine yardımcı olur.
zh_hans: 删除公共类型或成员时还应该删除 PublicAPI.txt 中相应的项。这将关注代码评审和源代码管理历史记录中的 API 更改，并有助于防止重大更改。
zh_hant: 移除公用類型或成員時，也應一併移除 PublicAPI.txt 中的對應項目。如此會讓您注意到在程式碼檢閱以及原始檔控制歷程記錄中有關於 API 的變更，同時有助於避免發生中斷性變更。

# RemoveDeletedApiMessage
source: Symbol '{0}' is part of the declared API, but is either not public or could not be found
cs: Symbol {0} je součástí deklarovaného rozhraní API, ale buď není veřejný, nebo se ho nepovedlo najít.
de: Das Symbol "{0}" ist Teil der deklarierten API, aber entweder nicht öffentlich oder nicht auffindbar.
fr: Le symbole '{0}' fait partie de l'API déclarée, mais il n'est pas public ou est introuvable
it: Il simbolo '{0}' fa parte dell'API dichiarata, ma non è public oppure non è stato possibile trovarlo
ko: '{0}' 기호가 선언된 API의 일부이지만, 공용이 아니거나 찾을 수 없습니다.
pt_br: O símbolo '{0}' faz parte da API declarada, mas não é público ou não pôde ser encontrado
ru: Символ "{0}" является частью объявленного API, однако не является открытым либо не был найден
tr: '{0}' sembolü bildirilen API'nin parçası, ancak genel değil veya bulunamadı
zh_hans: 符号“{0}”是已声明 API 的一部分，但此符号为非公共或无法找到
zh_hant: 符號 '{0}' 是宣告 API 的一部分，但可能找不到或並非公用

# RemoveDeletedApiTitle
source: Remove deleted types and members from the declared API
cs: Odebrat odstraněné typy a členy z deklarovaného rozhraní API
de: Gelöschte Typen und Member aus der deklarierten API entfernen
fr: Enlever les types et membres supprimés de l'API déclarée
it: Rimuovere tipi e membri eliminati dall'API dichiarata
ko: 선언된 API에서 삭제된 형식 및 멤버 제거
pt_br: Remova os tipos e membros excluídos da API declarada
ru: Удалите удаленные типы и элементы из объявленного API
tr: Silinen türleri ve üyeleri bildirilen API'den kaldırın
zh_hans: 从已声明 API 中删除已删除的类型和成员
zh_hant: 從宣告的 API 移除已刪除的類型與成員

# ShouldAnnotateApiFilesDescription
source: PublicAPI.txt files should have `#nullable enable` to track nullability information, or this diagnostic should be suppressed. With nullability enabled, PublicAPI.txt records which types are nullable (suffix `?` on type) or non-nullable (suffix `!`). It also tracks any API that is still using an oblivious reference type (prefix `~` on line).
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" mit Anmerkungen zur NULL-Zulässigkeit deklariert werden. Dadurch wird die Aufmerksamkeit auf Änderungen an der NULL-Zulässigkeit der API in den Code Reviews und der Versionsgeschichte der Quellcodeverwaltung gelenkt, und Breaking Changes werden verhindert.
fr: Les fichiers PublicAPI.txt doivent avoir '#nullable enable' pour effectuer le suivi des informations de possibilité de valeur null ou ce diagnostic doit être supprimé. Si l'option de possibilité de valeur null est activée, PublicAPI.txt enregistre les types nullable (suffixe '?' sur le type) ou non-nullable (suffixe '!'). Il effectue également le suivi des API qui utilisent encore un type référence inconscient (préfixe '~' sur la ligne).
it: I file PublicAPI.txt devono includere `#nullable enable` per tenere traccia delle informazioni sul supporto dei valori Null, in caso contrario questa diagnostica deve essere eliminata. Se il supporto dei valori Null è abilitato, PublicAPI.txt registra i tipi nullable (suffisso `?` nel tipo) o non nullable (suffisso `!`). Tiene inoltre traccia di eventuali API che usano ancora un tipo riferimento oblivious (prefisso `~` nella riga).
ko: Null 허용 여부 정보를 추적하려면 PublicAPI.txt 파일에 '#nullable enable'이 있어야 합니다. 또는 이 진단이 표시되지 않아야 합니다. Null 허용 여부를 사용하는 경우 PublicAPI.txt는 nullable 형식(형식에 접미사 '?') 또는 nullable이 아닌 형식(접미사 '!')을 기록합니다. 또한 null을 허용하지 않는 참조 형식(줄에 접두사 '~')을 계속 사용하는 모든 API를 추적합니다.
ru: Для файлов PublicAPI.txt необходимо установить директиву #nullable enable, чтобы отслеживать сведения о допустимости значений NULL, либо отключить этот параметр диагностики. Если значения NULL являются допустимыми, в файлах PublicAPI.txt записываются типы, которые допускают значения NULL (суффикс "?" типа) или не допускают значения NULL (суффикс "!"). Также отслеживаются все API, в которых все еще используется ссылочный тип без заметок о допустимости значений NULL (префикс "~" в строке).
tr: PublicAPI.txt dosyalarında null atanabilirlik bilgilerini izlemek için `#nullable enable` bulunmalıdır veya bu tanılama gizlenmelidir. Null atanabilirlik etkin olduğunda PublicAPI.txt, null atanabilir (türde `?` soneki) veya null atanamaz (`!` soneki) türleri kaydeder. Ayrıca, hala bir kayıtsız başvuru türünü (satırda `~` ön eki) kullanan tüm API'leri de izler.
zh_hant: 在 PublicAPI.txt 中宣告所有公用類型與成員時，應提供可 NULL 性註釋。此動作會引起對程式碼檢閱與原始檔控制記錄中 API 可 NULL 性變更的注意，有助於避免發生中斷性變更。

# ShouldAnnotateApiFilesMessage
source: PublicAPI.txt is missing '#nullable enable', so the nullability annotations of API isn't recorded. It is recommended to enable this tracking.
cs: V souboru PublicAPI.txt chybí #nullable enable, takže se nezaznamenají anotace o možnosti použití hodnoty null u rozhraní API. Doporučuje se toto sledování povolit.
de: In "PublicAPI.txt" fehlt "#nullable enable", daher werden die Anmerkungen zur NULL-Zulässigkeit der API nicht aufgezeichnet. Es wird empfohlen, diese Nachverfolgung zu aktivieren.
fr: PublicAPI.txt ne contient pas '#nullable enable'. Les annotations de nullabilité de l'API ne sont donc pas enregistrées. Il est recommandé d'activer ce suivi.
it: In PublicAPI.txt manca '#nullable enable', di conseguenza le annotazioni di supporto dei valori Null dell'API non sono registrate. È consigliabile abilitare questa verifica.
ko: PublicAPI.txt에 '#nullable enable'이 없으므로 API의 Null 허용 여부 주석이 기록되지 않았습니다. 이 추적을 사용하도록 설정하는 것이 좋습니다.
ru: В файле PublicAPI.txt отсутствует "#nullable enable", поэтому заметки о допустимости значений NULL для API не записываются. Рекомендуется включить их отслеживание.
tr: PublicAPI.txt dosyasında '#nullable enable' eksik olduğundan API'nin null atanabilirlik ek açıklamaları kaydedilmiyor. Bu izlemenin etkinleştirilmesi önerilir.
zh_hant: PublicAPI.txt 缺少 '#nullable enable'，因此未記錄 API 的可 NULL 性註釋。建議啟用此追蹤。

# ShouldAnnotateApiFilesTitle
source: Enable tracking of nullability of reference types in the declared API
fr: Activer le suivi de la possibilité de valeur null des types référence dans l'API déclarée
it: Abilita il rilevamento del supporto dei valori Null dei tipi riferimento nell'API dichiarata
ko: 선언된 API에서 참조 형식의 Null 허용 여부 추적 사용
ru: Включение отслеживания допустимости значений NULL ссылочных типов в объявленном API
tr: Bildirilen API'de başvuru türlerinin null olduğunu izlemeyi etkinleştir

# AnnotatePublicApiMessage
source: Symbol '{0}' is missing nullability annotations in the declared API.
cs: U symbolu {0} chybí v deklarovaném rozhraní API anotace o možnosti použití hodnoty null.
de: Für das Symbol "{0}" fehlen Anmerkungen zur NULL-Zulässigkeit in der deklarierten API.
it: Nel simbolo '{0}' mancano le annotazioni di supporto dei valori Null nell'API dichiarata.
ko: 선언된 API에서 '{0}' 기호에 Null 허용 여부 주석이 없습니다.
ru: В объявленном API для символа "{0}" отсутствуют заметки о допустимости значений NULL.
tr: '{0}' sembolünde, bildirilen API'deki null atanabilirlik ek açıklamaları eksik.
zh_hant: 在已宣告的 API 中，符號 '{0}' 缺少可 NULL 性註釋。

# DeclarePublicApiMessage
source: Symbol '{0}' is not part of the declared API.
cs: Symbol {0} není součástí deklarovaného rozhraní API.
de: Das Symbol "{0}" ist nicht Teil der deklarierten API.
it: Il simbolo '{0}' non fa parte dell'API dichiarata.
ko: '{0}' 기호가 선언된 API의 일부가 아닙니다.
pt_br: O símbolo '{0}' não faz parte da API declarada.
ru: Символ "{0}" не является частью объявленного API.
tr: '{0}' sembolü bildirilen API'nin bir parçası değil.
zh_hans: 符号“{0}”不是已声明 API 的一部分。
zh_hant: 符號 '{0}' 並非宣告 API 的一部分。

# DuplicateSymbolsInPublicApiFilesMessage
source: The symbol '{0}' appears more than once in the public API files.
cs: Symbol {0} se v souborech veřejného rozhraní API vyskytuje více než jednou.
de: Das Symbol "{0}" wird in den öffentlichen API-Dateien mehrmals aufgeführt.
it: Il simbolo '{0}' è presente più volte nei file dell'API pubblica.
ko: '{0}' 기호가 공용 API 파일에 두 번 이상 나타납니다.
pt_br: O símbolo '{0}' aparece mais de uma vez nos arquivos da API pública.
ru: Символ "{0}" встречается больше одного раза в файлах открытого API.
tr: '{0}' sembolü genel API dosyalarında birden çok kez görünüyor.
zh_hans: 符号“{0}”多次出现在公共 API 文件中。
zh_hant: 公用 API 檔案中出現一次以上的符號 '{0}'。

# ExposedNoninstantiableTypeMessage
source: Constructor makes its noninheritable base class inheritable, thereby exposing its protected members.
cs: Konstruktor nastavuje základní třídu, ze které se nedá dědit, na třídu, ze které se dědit dá, čímž zpřístupňuje své chráněné členy.
de: Der Konstruktor legt die nicht vererbbare Basisklasse als vererbbar fest und macht damit deren geschützte Member verfügbar.
it: Il costruttore rende ereditabile la relativa classe di base non ereditabile, esponendone in tal modo i membri protetti.
ko: 생성자는 해당 상속할 수 없는 기본 클래스를 상속할 수 있도록 만들어 보호된 멤버가 공개됩니다.
pt_br: O construtor faz com que sua classe base não herdável seja herdável, expondo seus membros protegidos.
ru: Конструктор делает свой ненаследуемый базовый класс наследуемым, ставя под угрозу его защищенные элементы.
tr: Oluşturucu devralınamaz temel sınıfını devralınabilir hale getirir, böylece korumalı üyelerini açığa çıkarır.
zh_hans: 构造函数使其不可继承的基类变为可继承，从而暴露其受保护的成员。
zh_hant: 建構函式會使無法繼承的基底類別變成可繼承，進而公開其受保護的成員。

# ObliviousPublicApiMessage
source: Symbol '{0}' uses some oblivious reference types.
cs: Symbol {0} používá některé odkazové typy bez určení možnosti použití hodnoty null.
de: Das Symbol "{0}" verwendet einige nicht beachtende Verweistypen.
it: Il simbolo '{0}' usa alcuni tipi di riferimento oblivious.
ko: '{0}' 기호는 일부 인식 불가능한 참조 형식을 사용합니다.
ru: Символ "{0}" использует некоторые игнорируемые ссылочные типы.
tr: '{0}' sembolü, uyarısız atanabilen bazı başvuru türlerini kullanıyor.
zh_hant: 符號 '{0}' 使用了部分無警示的參考型別。

# OverloadWithOptionalParametersShouldHaveMostParametersTitle
source: Public API with optional parameter(s) should have the most parameters amongst its public overloads.
cs: Veřejné rozhraní API s nepovinnými parametry by mělo mít ze všech veřejných přetížení nejvíce parametrů
de: Öffentliche API mit optionalen Parametern muss die meisten Parameter bei den öffentlichen Überladungen aufweisen.
it: L'API pubblica con parametri facoltativi deve includere la maggior parte dei parametri tra i relativi overload public.
ko: 선택적 매개 변수가 있는 공용 API에는 공용 오버로드 중 대부분의 매개 변수가 포함되어야 합니다.
pt_br: A API pública com parâmetros opcionais deve ter a maioria dos parâmetros entre suas sobrecargas públicas.
ru: Открытый API с необязательными параметрами должен иметь основную часть параметров среди своих открытых перегрузок.
tr: İsteğe bağlı parametreleri olan genel API'nin, genel aşırı yüklemeleri arasında en çok parametreye sahip olması gerekir.
zh_hans: 具有可选参数的公共 API 应在其公共重载中具有最多参数。
zh_hant: 具有選擇性參數的公用 API，大部分的參數應位於其公用多載之間。

# ShouldAnnotateApiFilesDescription
source: All public types and members should be declared with nullability annotations in PublicAPI.txt. This draws attention to API nullability changes in the code reviews and source control history, and helps prevent breaking changes.
cs: Všechny veřejné typy a členy by se měly deklarovat s anotacemi o možnosti použití hodnoty null v souboru PublicAPI.txt. To přitáhne pozornost ke změnám možnosti použití hodnoty null u rozhraní API při revizích a v historii správy zdrojového kódu a pomůže předejít změnám způsobujícím chybu.

# ShouldAnnotateApiFilesTitle
source: Annotate nullability of types and members in the declared API
cs: Přidat anotace o možnosti použití hodnoty null u typů a členů v deklarovaném rozhraní API
de: NULL-Zulässigkeit von Typen und Membern in der deklarierten API anmerken
zh_hant: 標註已宣告 API 中類型和成員的可 NULL 性

# PublicImplicitConstructorErrorMessageName
source: implicit constructor for {0}
pt_br: construtor implícito para {0}
zh_hans: {0} 的隐式构造函数

# PublicImplicitGetAccessor
source: implicit get-accessor for {0}
pt_br: acessador get implícito para {0}
zh_hans: {0} 的隐式 get 访问器

# PublicImplicitSetAccessor
source: implicit set-accessor for {0}
pt_br: acessador set implícito para {0}
zh_hans: {0} 的隐式 set 访问器
