Repository: dotnet/roslyn
Catalog: src/CodeStyle/Core/Analyzers/xlf/CodeStyleResources.*.xlf
Languages: ru

source: A language name cannot be specified for this option.
ru: Для данного параметра невозможно указать имя языка.

source: A language name must be specified for this option.
ru: Для данного параметра необходимо указать имя языка.

source: Error
ru: Ошибка

source: Fix formatting
ru: Исправить форматирование

source: Indentation and spacing
ru: Отступы и интервалы

source: New line preferences
ru: Предпочтения для новых строк

source: Refactoring Only
ru: Только рефакторинг

source: Style
ru: Стиль

source: Suggestion
ru: Рекомендация

source: Warning
ru: Предупреждение
