Repository: dotnet/roslyn
Catalog: src/Features/CSharp/Portable/xlf/CSharpFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Name can be simplified
cs: Název se dá zjednodušit.
de: Der Name kann vereinfacht werden
es: El nombre se puede simplificar
fr: Le nom peut être simplifié
it: Il nome può essere semplificato
ja: 名前を簡素化できます
ko: 이름은 간단하게 줄일 수 있습니다.
pl: Nazwę można uprościć
pt_br: O nome pode ser simplificado
ru: Имя может быть упрощено
tr: Ad basitleştirilebilir
zh_hans: 可简化名称
zh_hant: 可以簡化名稱

source: Can't determine valid range of statements to extract
cs: Nemůže určit platný rozsah příkazů k extrakci.
de: Ein gültiger Bereich der zu extrahierenden Anweisungen kann nicht ermittelt werden.
es: No se puede determinar el intervalo válido de instrucciones para extraer.
fr: Impossible de déterminer la plage valide d'instructions à extraire
it: Non è possibile determinare l'intervallo valido di istruzioni da estrarre
ja: 抽出するステートメントの有効な範囲を決定できません
ko: 추출할 문의 유효한 범위를 결정할 수 없습니다.
pl: Nie można określić prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: Não é possível determinar o intervalo válido de instruções para extrair
ru: Невозможно определить допустимый диапазон операторов для извлечения
tr: Ayıklanacak deyimlerin geçerli aralığı belirlenemiyor
zh_hans: 无法确定要提取的语句的有效范围
zh_hant: 無法判斷要擷取的有效陳述式範圍

source: Not all code paths return
cs: Ne všechny cesty kódu vracejí
de: Nicht alle Codepfadrückgaben
es: No todas las rutas de acceso de código vuelven
fr: Tous les chemins du code n'ont pas été retournés
it: Non vengono restituiti tutti i percorsi del codice
ja: 返されないコード パスがあります
ko: 일부 코드 경로가 반환됩니다.
pl: Nie wszystkie ścieżki kodu zwracają
pt_br: Nem todos os caminhos de código são retornados
ru: Не все пути к коду возвращают значения
tr: Kod yollarından bazıları dönmüyor
zh_hans: 未返回所有代码路径
zh_hant: 未傳回所有程式碼路徑

source: Selection does not contain a valid node
cs: Výběr neobsahuje platný uzel.
de: Auswahl enthält keinen gültigen Knoten.
es: La selección no contiene un nodo válido
fr: La sélection ne contient pas un nœud valide.
it: La selezione non contiene un nodo valido
ja: 選択には有効なノードは含まれません
ko: 선택 항목에 유효한 노드가 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera prawidłowego węzła
pt_br: A seleção não contém um nó válido
ru: Выделение не содержит допустимый узел
tr: Seçim, geçerli bir düğüm içermiyor
zh_hans: 所选内容不包含有效节点
zh_hant: 選取範圍沒有包含有效的節點

source: Invalid selection.
cs: Neplatný výběr
de: Ungültige Auswahl.
es: Selección no válida.
fr: Sélection incorrecte.
it: Selezione non valida.
ja: 選択が無効です。
ko: 잘못된 선택 항목입니다.
pl: Nieprawidłowe zaznaczenie.
pt_br: Seleção inválida.
ru: Недопустимое выделение.
tr: Geçersiz seçim.
zh_hans: 无效的选择。
zh_hant: 無效的選取範圍。

source: Selection does not contain a valid token.
cs: Výběr neobsahuje platný token.
de: Auswahl enthält kein gültiges Token.
es: La selección no contiene un token válido
fr: La sélection ne contient pas un jeton valide.
ko: 선택 항목에 유효한 토큰이 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera prawidłowego tokenu.
pt_br: A seleção não contém um token válido.
ru: Выделение не содержит допустимый токен.
tr: Seçim, geçerli bir belirteç içermiyor.
zh_hant: 選取範圍沒有包含有效的語彙基元。

source: No valid selection to perform extraction.
cs: Žádný platný výběr k provedení extrakce
de: Keine gültige Auswahl zum Durchführen der Extraktion.
es: Selección no válida para efectuar extracción.
fr: Pas de sélection valide pour procéder à l'extraction.
ko: 추출을 수행할 선택 항목이 잘못되었습니다.
pl: Brak prawidłowego zaznaczenia do wyodrębnienia.
pt_br: Nenhuma seleção válida para realizar a extração.
ru: Нет допустимого выделения для извлечения.
tr: Ayıklamayı gerçekleştirme için geçerli seçim yok.
zh_hant: 沒有可執行擷取的有效選取範圍。

source: No common root node for extraction.
cs: Žádný společný kořenový uzel pro extrakci
de: Kein gemeinsamer Stammknoten für Extraktion.
es: No hay nodo raíz común para la extracción.
fr: Pas de nœud racine commun pour l'extraction.
ko: 추출에 필요한 일반 루트 노드가 없습니다.
pl: Brak wspólnego węzła głównego do wyodrębnienia.
pt_br: Nenhum nó de raiz comum para extração.
ru: Нет стандартного корневого узла для извлечения.
tr: Ayıklama için ortak kök düğümü yok.
zh_hant: 沒有根節點可供擷取。

source: Contains invalid selection.
cs: Obsahuje neplatný výběr.
de: Enthält eine ungültige Auswahl.
es: Contiene una selección no válida.
fr: Contient une sélection incorrecte.
it: Contiene una selezione non valida.
ja: 無効な選択が含まれています。
ko: 잘못된 선택 항목을 포함합니다.
pl: Zawiera nieprawidłowe zaznaczenie.
pt_br: Contém uma seleção inválida.
ru: Содержит недопустимое выделение.
tr: Geçersiz seçimi içerir.
zh_hans: 包含无效的选择。
zh_hant: 包含無效的選取範圍。

source: The selection contains syntactic errors
cs: Výběr obsahuje syntaktické chyby.
de: Die Auswahl enthält Syntaxfehler.
es: La selección contiene errores sintácticos
fr: La sélection contient des erreurs syntaxiques
it: La selezione contiene errori di sintassi
ja: 選択に構文エラーが含まれています
ko: 선택 영역에 구문 오류가 포함되어 있습니다.
pl: Zaznaczenie zawiera błędy składni
pt_br: A seleção contém erros sintáticos
ru: В выбранном фрагменте есть синтаксические ошибки
tr: Seçim söz dizimsel hatalar içeriyor
zh_hans: 所选内容包含语法错误
zh_hant: 選取項目包含語法錯誤

source: Selection can not cross over preprocessor directives.
cs: Výběr nemůže zasahovat do direktiv preprocesorů.
de: Auswahl kann keine Präprozessordirektiven kreuzen.
es: La selección no puede cruzar directivas de preprocesador.
fr: La sélection ne peut pas traverser plusieurs directives de préprocesseur.
it: La selezione non può intersecare direttive per il preprocessore.
ja: 選択範囲はプリプロセッサ ディレクティブ上を通過できません。
ko: 여러 전처리기 지시문을 교차해서 선택할 수 없습니다.
pl: Zaznaczenie nie może zawierać dyrektyw preprocesora.
pt_br: A seleção não pode ultrapassar diretivas de pré-processador.
ru: Выделение не может пересекать директивы препроцессора.
tr: Seçim önişlemci yönergeleriyle çapraz olamaz.
zh_hans: 所选内容不能超出预处理器指令。
zh_hant: 選取範圍不可以跨越前置處理器指示詞。

source: Selection can not contain a yield statement.
cs: Výběr nemůže obsahovat žádný příkaz Yield.
de: Auswahl kann keine yield-Anweisung enthalten.
es: La selección no puede contener una instrucción yield.
fr: La sélection ne contient pas d'instruction yield.
it: La selezione non può contenere un'istruzione yield.
ja: 選択範囲に yield ステートメントを含めることはできません。
ko: 선택 항목에는 yield 문이 포함될 수 없습니다.
pl: Zaznaczenie nie może zawierać instrukcji yield.
pt_br: A seleção não pode conter uma instrução yield.
ru: Выделение не может содержать оператор yield.
tr: Seçim bir bırakma ifadesi içeremez.
zh_hans: 所选内容不能包含 yield 语句。
zh_hant: 選取範圍不能包含 yield 陳述式。

source: Selection can not contain throw statement.
cs: Výběr nemůže obsahovat žádný příkaz Throw.
de: Auswahl kann keine throw-Anweisung enthalten.
es: La selección no puede contener una instrucción throw.
fr: La sélection ne contient pas d'instruction throw.
it: La selezione non può contenere l'istruzione throw.
ja: 選択範囲に throw ステートメントを含めることはできません。
ko: 선택 항목에는 throw 문이 포함될 수 없습니다.
pl: Zaznaczenie nie może zawierać instrukcji throw.
pt_br: A seleção não pode conter uma instrução throw.
ru: Выделение не может содержать оператор throw.
tr: Seçim bir atma ifadesi içeremez.
zh_hans: 所选内容不能包含 throw 语句。
zh_hant: 選取範圍不能包含 throw 陳述式。

source: Selection can not be part of constant initializer expression.
cs: Výběr nemůže být součástí konstantního výrazu inicializátoru.
de: Auswahl kann nicht Teil eines konstanten Initialisierungsausdrucks sein.
es: La selección no puede formar parte de una expresión de inicializador constante.
fr: La sélection ne peut pas faire partie d'une expression d'initialiseur de constante.
it: La selezione non può essere inclusa nell'espressione costante dell'inizializzatore.
ja: 選択範囲を定数の初期化子式の一部にすることはできません。
ko: 선택 항목은 상수 이니셜라이저 식의 일부일 수 없습니다.
pl: Zaznaczenie nie może być częścią wyrażenia inicjatora stałej.
pt_br: A seleção não pode fazer parte da expressão de inicializador constante.
ru: Выделение не может быть частью постоянного выражения инициализатора.
tr: Seçim, sabit başlatıcı ifadesinin parçası olamaz.
zh_hans: 所选内容不能作为常量初始值设定项表达式的一部分。
zh_hant: 選取範圍不能是常數初始設定式運算式的一部分。

source: Selection can not contain a pattern expression.
cs: Výběr nesmí obsahovat výraz vzoru.
de: Die Auswahl kann keinen Musterausdruck enthalten.
es: La selección no puede contener una expresión de patrón.
fr: La sélection ne peut pas contenir une expression de modèle.
it: La selezione non può contenere un'espressione di criteri.
ja: 選択に、パターン式を含めることはできません。
ko: 선택 항목에 패턴 식이 포함될 수 없습니다.
pl: Wybór nie może zawierać wyrażenia wzorca.
pt_br: A seleção não pode conter uma expressão de padrão.
ru: Выбор не может содержать выражение шаблона.
tr: Seçim, bir desen ifadesi içeremez.
zh_hans: 所选内容不能包含模式表达式。
zh_hant: 選取項目不能包含模式運算式。

source: The selected code is inside an unsafe context.
cs: Vybraný uzel je uvnitř nezabezpečeného kontextu.
de: Der ausgewählte Code befindet sich in einem unsicheren Kontext.
es: El código seleccionado se encuentra dentro de un contexto no seguro.
fr: Le code sélectionné se trouve dans un contexte unsafe.
it: Il codice selezionato è all'interno di un contesto unsafe.
ja: 選択されたコードは unsafe コンテキストの内側にあります。
ko: 선택한 코드가 안전하지 않은 컨텍스트 내에 있습니다.
pl: Zaznaczony kod znajduje się w niebezpiecznym kontekście.
pt_br: O código selecionado está dentro de um contexto sem segurança.
ru: Выделенный код находится внутри небезопасного содержимого.
tr: Seçili kod güvenli olmayan bir bağlam içinde.
zh_hans: 所选代码位于不安全的上下文中。
zh_hant: 選取的程式碼在不安全的內容中。

source: No valid statement range to extract
cs: Žádný platný rozsah příkazů pro extrakci
de: Kein gültiger Anweisungsbereich für die Extraktion
es: No hay un intervalo válido de instrucciones para extraer.
fr: Aucune plage valide d'instructions à extraire
it: Non esiste alcun intervallo di istruzioni valido per l'estrazione
ja: 抽出する有効なステートメントの範囲がありません
ko: 추출하는 데 유효한 문 범위가 없습니다.
pl: Brak prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: Nenhum intervalo de instruções válido para extrair
ru: Отсутствует допустимый диапазон операторов для извлечения
tr: Ayıklanacak geçerli deyim aralığı yok
zh_hans: 没有可供提取的有效语句范围
zh_hant: 沒有可擷取的有效陳述式範圍

source: deprecated
cs: zastaralé
de: veraltet
es: en desuso
fr: déconseillé
it: deprecato
ja: 非推奨
ko: 사용되지 않음
pl: przestarzałe
pt_br: preterido
ru: не рекомендуется
tr: kullanım dışı
zh_hans: 弃用的
zh_hant: 已取代

source: extension
cs: rozšíření
de: Erweiterung
es: Extensión
it: Estensione
ja: 拡張子
ko: 확장
pl: rozszerzenie
pt_br: Extensão
ru: Расширение
tr: uzantı
zh_hans: 扩展
zh_hant: 擴充功能

source: awaitable
cs: očekávatelný
es: admite await
fr: pouvant être attendu(e)
ja: 待機可能
ko: 대기 가능
pl: oczekujący
pt_br: aguardável
ru: поддерживает ожидание
zh_hans: 可等待
zh_hant: 可等候

source: awaitable, extension
cs: očekávatelný, rozšíření
de: Awaitable, Erweiterung
es: admite await, extensión
it: awaitable, estensione
ja: 待機可能、拡張子
ko: 대기 가능, 확장
pl: oczekujący, rozszerzenie
pt_br: aguardável, extensão
ru: ожидание, расширение
tr: awaitable, uzantı
zh_hans: 可等待，扩展
zh_hant: 可等候，擴充功能

source: Organize Usings
cs: Uspořádat direktivy using
de: Using-Direktiven organisieren
es: Organizar instrucciones Using
fr: Organiser les instructions Using
it: Organizza using
ja: using の整理
ko: Using 구성
pl: Organizuj użycia
pt_br: Organizar Usos
ru: Упорядочение Using
tr: Kullanımları Düzenle
zh_hans: 组织 Using
zh_hant: 組合管理 Using

source: Insert 'await'.
cs: Vložit operátor Await
de: "await" einfügen.
es: Insertar 'await'.
fr: Insérez 'await'.
it: Inserire 'await'.
ja: await' を挿入します。
ko: Await'를 삽입합니다.
pl: Wstaw element „await”.
pt_br: Inserir "aguardar".
ru: Вставьте "await".
tr: await' ekle.
zh_hans: 插入“await”。
zh_hant: 插入 'await'。

source: Make {0} return Task instead of void.
cs: Nastavit, že {0} má místo hodnoty typu Void vracet hodnotu Task
de: "{0}" in Rückgabeaufgabe umwandeln, statt leer zu lassen.
es: Hacer que {0} devuelva Tarea en lugar de void.
fr: {0} doit retourner Task au lieu de void.
it: Fa in modo che {0} restituisca Task invece di void.
ja: {0} が void ではなくタスクを返すようにします。
ko: {0}에서 void 대신 Task를 반환하도록 설정합니다.
pl: Ustaw element {0}, aby zwracał zadanie zamiast elementu void.
pt_br: Fazer com que {0} retorne Tarefa em vez de nulo.
ru: Сделать {0} задачей возврата вместо void.
tr: {0} öğesi boşluk yerine Görev döndürsün.
zh_hans: 使 {0} 返回 Task，而不是 void。
zh_hant: 使 {0} 傳回 Task 而不是 void。

source: Change return type from {0} to {1}
cs: Změnit typ návratové hodnoty z: {0} na: {1}
de: Rückgabetyp von "{0}" in "{1}" ändern
es: Cambiar el tipo de valor devuelto de {0} a {1}
fr: Changer le type de retour de {0} en {1}
it: Modifica il tipo restituito da {0} in {1}
ja: 戻り値の型を {0} から {1} に変更する
ko: 반환 형식을 {0}에서 {1}(으)로 변경
pl: Zmień zwracany typ z {0} na {1}
pt_br: Alterar tipo de retorno de {0} para {1}
ru: Изменить тип возврата с {0} на {1}
tr: Dönüş türünü {0} değerinden {1} olarak değiştir
zh_hans: 将返回类型由 {0} 改为 {1}
zh_hant: 將傳回類型從 {0} 變更為 {1}

source: Replace return with yield return
cs: Nahradit příkaz return příkazem yield return
de: "return" durch "yield return" ersetzen
es: Reemplazar return por yield return
fr: Remplacer return par yield return
it: Sostituisce return con yield return
ja: 戻り値を 'yield' の戻り値に置き換える
ko: return을 yield return으로 바꾸기
pl: Zamień instrukcję return na instrukcję yield return
pt_br: Substituir return por yield return
ru: Заменить тип возврата на yield
tr: Dönüşü, bırakma dönüşüyle değiştir
zh_hans: 用 yield return 替代 return
zh_hant: 使用 yield return 取代 return

source: Generate explicit conversion operator in '{0}'
cs: Generovat explicitní operátor převodu v {0}
de: Expliziten Konversionsoperator in '{0}' generieren
es: Generar operador de conversión explícito en '{0}'
fr: Générer l’opérateur de conversion explicite dans « {0} »
it: Genera l'operatore di conversione esplicito in '{0}'
ja: 明示的な変換演算子を '{0}' に生成します
ko: {0}'에서 명시적 변환 연산자 생성
pl: Generuj operator jawnej konwersji w elemencie „{0}”
pt_br: Gerar um operador de conversão explícita em '{0}'
ru: Создать явный оператор преобразования в "{0}"
tr: {0}' içinde açık dönüşüm işleci oluştur
zh_hans: 在“{0}”中生成显示转换运算符
zh_hant: 在 '{0}' 中產生明確轉換運算子

source: Generate implicit conversion operator in '{0}'
cs: Generovat implicitní operátor převodu v {0}
de: Impliziten Konversionsoperator in '{0}' generieren
es: Generar operador de conversión implícito en '{0}'
fr: Générer l’opérateur de conversion implicite dans « {0} »
it: Genera l'operatore di conversione implicito in '{0}'
ja: 暗黙的な変換演算子を '{0}' に生成します
ko: {0}'에서 암시적 변환 연산자 생성
pl: Generuj operator niejawnej konwersji w elemencie „{0}”
pt_br: Gerar um operador de conversão implícita em '{0}'
ru: Создать неявный оператор преобразования в "{0}"
tr: {0}' içinde örtük dönüşüm işleci oluştur
zh_hans: 在“{0}”中生成隐式转换运算符
zh_hant: 在 '{0}' 中產生隱含轉換運算子

source: Do not change this code. Put cleanup code in Dispose(bool disposing) above.
cs: Neměňte tento kód. Kód pro vyčištění vložte do výše uvedené metody Dispose(bool disposing).
de: Ändern Sie diesen Code nicht. Fügen Sie Bereinigungscode in Dispose(bool disposing) weiter oben ein.
es: No cambie este código. Coloque el código de limpieza en el anterior Dispose(colocación de bool).
fr: Ne modifiez pas ce code. Placez le code de nettoyage dans Dispose(bool disposing) ci-dessus.
ko: 이 코드를 변경하지 마세요. 위의 Dispose(bool disposing)에 정리 코드를 입력하세요.
pl: Nie zmieniaj tego kodu. Umieść kod czyszczący w powyższej metodzie Dispose(bool disposing).
pt_br: Não altere este código. Coloque o código de limpeza em Dispose(bool disposing) acima.
ru: Не изменяйте этот код. Разместите код очистки выше, в методе Dispose(bool disposing).
tr: Bu kodu değiştirmeyin. Temizleme kodunu yukarıdaki Dispose(bool disposing) içine yerleştirin.
zh_hant: 請勿變更這個程式碼。請將清除程式碼放入上方的 Dispose(bool disposing) 中。

source: TODO: free unmanaged resources (unmanaged objects) and override a finalizer below.
cs: TODO: Uvolněte nespravované prostředky (nespravované objekty) a přepište finalizační metodu níže.
de: TODO: nicht verwaltete Ressourcen (nicht verwaltete Objekte) freigeben und Finalizer weiter unten überschreiben.
es: TODO: libere los recursos no administrados (objetos no administrados) y reemplace el siguiente finalizador.
fr: TODO: libérer les ressources non managées (objets non managés) et remplacer un finaliseur ci-dessous.
ko: TODO: 관리되지 않는 리소스(관리되지 않는 개체)를 해제하고 아래의 종료자를 재정의합니다.
pl: TODO: Zwolnić niezarządzane zasoby (niezarządzane obiekty) i przesłonić poniższy finalizator.
pt_br: TODO: liberar recursos não gerenciados (objetos não gerenciados) e substituir um finalizador abaixo.
ru: TODO: освободить неуправляемые ресурсы (неуправляемые объекты) и переопределить ниже метод завершения.
tr: TODO: yönetilmeyen kaynakları (yönetilmeyen nesneleri) serbest bırakın ve aşağıda bir sonlandırıcıyı geçersiz kılın.
zh_hant: TODO: 釋放 Unmanaged 資源 (Unmanaged 物件) 並覆寫下方的完成項。

source: TODO: override a finalizer only if Dispose(bool disposing) above has code to free unmanaged resources.
cs: TODO: Přepište finalizační metodu, jenom pokud metoda Dispose(bool disposing) výše obsahuje kód pro uvolnění nespravovaných prostředků.
de: TODO: Finalizer nur überschreiben, wenn Dispose(bool disposing) weiter oben Code für die Freigabe nicht verwalteter Ressourcen enthält.
es: TODO: reemplace un finalizador solo si el anterior Dispose(bool disposing) tiene código para liberar los recursos no administrados.
fr: TODO: remplacer un finaliseur seulement si la fonction Dispose(bool disposing) ci-dessus a du code pour libérer les ressources non managées.
ko: TODO: 위의 Dispose(bool disposing)에 관리되지 않는 리소스를 해제하는 코드가 포함되어 있는 경우에만 종료자를 재정의합니다.
pl: TODO: Przesłonić finalizator tylko w sytuacji, gdy powyższa metoda Dispose(bool disposing) zawiera kod służący do zwalniania niezarządzanych zasobów.
pt_br: TODO: substituir um finalizador somente se Dispose(bool disposing) acima tiver o código para liberar recursos não gerenciados.
ru: TODO: переопределить метод завершения, только если Dispose(bool disposing) выше включает код для освобождения неуправляемых ресурсов.
tr: TODO: yalnızca yukarıdaki Dispose(bool disposing) ifadesi yönetilmeyen kaynakları serbest bırakacak koda sahipse sonlandırıcıyı geçersiz kılın.
zh_hant: TODO: 僅當上方的 Dispose(bool disposing) 具有會釋放 Unmanaged 資源的程式碼時，才覆寫完成項。

source: This code added to correctly implement the disposable pattern.
cs: Tento kód je přidaný pro správnou implementaci odstranitelného vzoru.
de: Dieser Code wird hinzugefügt, um das Dispose-Muster richtig zu implementieren.
es: Este código se agrega para implementar correctamente el patrón descartable.
fr: Ce code est ajouté pour implémenter correctement le modèle supprimable.
ko: 삭제 가능한 패턴을 올바르게 구현하기 위해 추가된 코드입니다.
pl: Ten kod został dodany w celu prawidłowego zaimplementowania wzorca rozporządzającego.
pt_br: Código adicionado para implementar corretamente o padrão descartável.
ru: Этот код добавлен для правильной реализации шаблона высвобождаемого класса.
tr: Atılabilir deseni doğru uygulamak için bu kod eklendi.
zh_hant: 加入這個程式碼的目的在正確實作可處置的模式。

# TODO_colon_uncomment_the_following_line_if_the_finalizer_is_overridden_above
source: TODO: uncomment the following line if the finalizer is overridden above.
cs: TODO: Zrušte komentář následujícího řádku, pokud se výše přepisuje finalizační metoda.
de: TODO: Auskommentierung der folgenden Zeile aufheben, wenn der Finalizer weiter oben überschrieben wird.
es: TODO: quite la marca de comentario de la siguiente línea si el finalizador se ha reemplazado antes.
fr: TODO: supprimer les marques de commentaire pour la ligne suivante si le finaliseur est remplacé ci-dessus.
ko: TODO: 위의 종료자가 재정의된 경우 다음 코드 줄의 주석 처리를 제거합니다.
pl: TODO: Usunąć komentarz z poniższego wiersza, jeśli finalizator został przesłonięty powyżej.
pt_br: TODO: remover marca de comentário da linha a seguir se o finalizador for substituído acima.
ru: TODO: раскомментировать следующую строку, если метод завершения переопределен выше.
tr: TODO: sonlandırıcı yukarıda geçersiz kılınırsa aşağıdaki satırın açıklamasını kaldırın.
zh_hant: TODO: 如果上方的完成項已被覆寫，即取消下行的註解狀態。

source: Using directive is unnecessary.
cs: Direktiva Using není potřebná.
de: Using-Direktive ist unnötig.
es: El uso de la directiva no es necesario.
fr: La directive using n'est pas nécessaire.
ko: Using 지시문은 필요하지 않습니다.
pl: Dyrektywa using jest niepotrzebna.
pt_br: O uso da diretiva é desnecessário.
ru: Директива using не нужна.
tr: Using yönergesi gerekli değildir.
zh_hant: 無須使用指示詞。

source: switch statement
cs: příkaz switch
es: instrucción switch
fr: instruction switch
it: istruzione switch
ja: switch ステートメント
ko: switch 문
pl: instrukcja switch
ru: оператор switch
zh_hans: switch 语句

source: switch statement case clause
cs: klauzule case příkazu switch
es: cláusula case de la instrucción switch
fr: clause case d'une instruction switch
it: clausola case dell'istruzione switch
ja: switch ステートメントの case 句
ko: switch 문 case 절
pl: klauzula case instrukcji switch
ru: предложение case оператора switch
zh_hans: switch 语句 case 子句

source: try block
cs: blok try
es: bloque try
fr: bloc try
it: blocco try
ja: try ブロック
ko: try 블록
pl: blok try
pt_br: bloco try
ru: блок try
tr: try bloğu
zh_hans: try 块
zh_hant: try 區塊

source: catch clause
cs: klauzule catch
de: catch-Klausel
es: cláusula catch
fr: clause catch
it: clausola catch
ja: catch 句
ko: catch 절
pl: klauzula catch
pt_br: cláusula catch
ru: предложение catch
tr: catch yan tümcesi
zh_hans: catch 子句
zh_hant: catch 子句

source: filter clause
cs: klauzule filter
de: filter-Klausel
es: cláusula de filtro
fr: clause filter
it: clausola filter
ja: フィルター句
ko: filter 절
pl: klauzula filter
pt_br: cláusula de filtro
ru: предложение filter
tr: filter yan tümcesi
zh_hans: filter 子句
zh_hant: filter 子句

source: finally clause
cs: klauzule finally
de: finally-Klausel
es: cláusula finally
fr: clause finally
it: clausola finally
ja: finally 句
ko: finally 절
pl: klauzula finally
pt_br: cláusula finally
ru: предложение finally
tr: finally yan tümcesi
zh_hans: finally 子句
zh_hant: finally 子句

source: fixed statement
cs: příkaz fixed
de: fixed-Anweisung
es: instrucción fixed
fr: instruction fixed
it: istruzione fixed
ja: fixed ステートメント
ko: fixed 문
pl: instrukcja fixed
pt_br: instrução fixed
ru: оператор fixed
tr: fixed deyimi
zh_hans: fixed 语句
zh_hant: fixed 陳述式

source: using declaration
cs: deklarace using
es: declaración using
fr: déclaration using
it: dichiarazione using
ja: using 宣言
ko: using 선언
pl: deklaracja using
ru: объявление using
zh_hans: using 声明

source: using statement
cs: příkaz using
de: using-Anweisung
es: instrucción using
fr: instruction using
it: istruzione using
ja: using ステートメント
ko: using 문
pl: instrukcja using
pt_br: instrução using
ru: оператор using
tr: using deyimi
zh_hans: using 语句
zh_hant: using 陳述式

source: lock statement
cs: příkaz lock
de: lock-Anweisung
es: instrucción lock
fr: instruction lock
it: istruzione lock
ja: lock ステートメント
ko: lock 문
pl: instrukcja lock
pt_br: instrução lock
ru: оператор lock
tr: lock deyimi
zh_hans: lock 语句
zh_hant: lock 陳述式

source: foreach statement
cs: příkaz foreach
de: foreach-Anweisung
es: instrucción foreach
fr: instruction foreach
it: istruzione foreach
ja: foreach ステートメント
ko: foreach 문
pl: instrukcja foreach
pt_br: instrução foreach
ru: оператор foreach
tr: foreach deyimi
zh_hans: foreach 语句
zh_hant: foreach 陳述式

source: checked statement
cs: příkaz checked
de: checked-Anweisung
es: instrucción checked
fr: instruction checked
it: istruzione checked
ja: checked ステートメント
ko: checked 문
pl: instrukcja checked
pt_br: instrução checked
ru: оператор checked
tr: checked deyimi
zh_hans: checked 语句
zh_hant: checked 陳述式

source: unchecked statement
cs: příkaz unchecked
de: unchecked-Anweisung
es: instrucción unchecked
fr: instruction unchecked
it: istruzione unchecked
ja: unchecked ステートメント
ko: unchecked 문
pl: instrukcja unchecked
pt_br: instrução unchecked
ru: оператор unchecked
tr: unchecked deyimi
zh_hans: unchecked 语句
zh_hant: unchecked 陳述式
