Repository: dotnet/roslyn
Catalog: src/Features/CSharp/Portable/xlf/CSharpFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Using directives must be placed inside of a namespace declaration
cs: Direktivy using se musí umístit do deklarace namespace.
de: Using-Anweisungen müssen in einer namespace-Deklaration platziert werden.
es: Las directivas using deben colocarse dentro de una declaración de namespace
fr: Les directives using doivent être placées dans une déclaration namespace
ko: Using 지시문은 namespace 선언 내부에 배치되어야 합니다.
pl: Dyrektywy using muszą znajdować się wewnątrz deklaracji namespace
pt_br: As diretivas using precisam ser colocadas dentro de uma declaração de namespace
ru: Директивы using должны находиться внутри объявления namespace
tr: Using yönergelerinin bir namespace bildiriminin içine yerleştirilmesi gerekir

source: Using directives must be placed outside of a namespace declaration
cs: Direktivy using se musí umístit mimo deklaraci namespace.
de: Using-Anweisungen müssen außerhalb einer namespace-Deklaration platziert werden.
es: Las directivas using deben colocarse fuera de una declaración de namespace
fr: Les directives using doivent être placées en dehors d'une déclaration namespace
ko: Using 지시문은 namespace 선언 외부에 배치되어야 합니다.
pl: Dyrektywy using muszą znajdować się poza deklaracją namespace
pt_br: As diretivas using precisam ser colocadas fora de uma declaração de namespace
ru: Директивы using должны находиться вне объявления namespace
tr: Using yönergelerinin bir namespace bildiriminin dışına yerleştirilmesi gerekir

# Warning_colon_Moving_using_directives_may_change_code_meaning
source: Warning: Moving using directives may change code meaning.
cs: Upozornění: Přesunutí direktiv using může změnit význam kódu.
de: Warnung: Durch das Verschieben von using-Anweisungen kann sich die Codebedeutung ändern.
es: Advertencia: El movimiento de directivas using puede cambiar el significado del código.
fr: Avertissement : Le déplacement des directives using peut changer la signification du code.
ko: 경고: using 지시문을 이동하면 코드 의미가 변경될 수 있습니다.
pl: Uwaga: przeniesienie dyrektyw using może zmienić znaczenie kodu.
pt_br: Aviso: a movimentação das diretivas using pode alterar o significado do código.
ru: Предупреждение! Перемещение директив using может изменить значение кода.
tr: Uyarı: using yönergelerini taşımak, kodun anlamını değiştirebilir.

source: yield break statement
cs: příkaz yield break
es: instrucción yield break
fr: instruction yield break
it: istruzione yield break
ja: yield break ステートメント
ko: yield break 문
pl: instrukcja yield break
ru: оператор yield break
zh_hans: yield break 语句

source: yield return statement
cs: příkaz yield return
es: instrucción yield return
fr: instruction yield return
it: istruzione yield return
ja: yield return ステートメント
ko: yield return 문
pl: instrukcja yield return
ru: оператор yield return
zh_hans: yield return 语句

source: Warning: Extracting a local function reference may produce invalid code
cs: Upozornění: Extrahování odkazu na místní funkci může vytvořit neplatný kód.
de: Warnung: Das Extrahieren eines lokalen Funktionsverweises führt unter Umständen zu ungültigem Code.
es: Advertencia: Extraer una referencia a una función local puede generar código no válido.
fr: Avertissement : L'extraction d'une référence de fonction locale peut produire du code non valide
ko: 경고: 로컬 함수 참조를 추출하면 잘못된 코드가 생성될 수 있습니다.
pt_br: Aviso: a extração de uma referência de função local pode produzir um código inválido
tr: Uyarı: Bir yerel işlev referansının ayıklanması geçersiz kod oluşturulmasına neden olabilir
zh_hant: 警告: 擷取本機函式參考可能會產生無效的程式碼

source: &Sort Usings
cs: &Seřadit direktivy using
de: Using-Anweisungen &sortieren
ko: Using 정렬(&S)
pt_br: Cla&ssificar Usos
tr: &Using’leri Sırala

source: R&emove and Sort Usings
cs: Od&ebrat a seřadit direktivy Using
de: &Unnötige Using-Direktiven entfernen und sortieren
ko: Using 제거 및 정렬(&E)
pt_br: R&emover e Classificar Usos
tr: &Kaldır ve Sıralama Usings
zh_hant: 移除和排序 Using(&E)

source: Convert to 'switch'
cs: Převést na switch
ko: 'switch'로 변환
pt_br: Converter em 'switch'
zh_hant: 轉換為 'switch'

source: Add 'await'
it: Aggiungi 'await'
ja: 'await' の追加
zh_hans: 添加 "await"

source: Add 'await' and 'ConfigureAwait(false)'
it: Aggiungi 'await' e 'ConfigureAwait(false)'
ja: 'await' と 'ConfigureAwait(false)' の追加
zh_hans: 添加 "await" 和 "ConfigureAwait(false)"

# Apply_using_directive_placement_preferences
source: Apply preferred 'using' placement preferences
it: Applica le preferenze di posizionamento per 'using'
ja: 優先する 'using' 配置設定を適用する
zh_hans: 应用首选的 "using" 放置首选项

source: Assign to '{0}'
it: Assegna a '{0}'
ja: "{0}" に割り当て
zh_hans: 赋值给 "{0}"

source: Autoselect disabled due to potential pattern variable declaration.
it: La selezione automatica è disabilitata a causa di una potenziale dichiarazione della variabile di criterio.
ja: パターン変数宣言の可能性があるため、自動選択は無効になっています。
zh_hans: 由于可能出现模式变量声明，已禁用自动选择。

source: Change to 'as' expression
it: Cambia in espressione 'as'
ja: 'as' 式に変更
zh_hans: 更改为 "as" 表达式

source: Change to cast
it: Cambia in cast
ja: キャストに変更
zh_hans: 更改为强制转换

source: Compare to '{0}'
it: Confronta con '{0}'
ja: "{0}" と比較
zh_hans: 与 "{0}" 比较

source: Convert to regular string
it: Converti in stringa normale
ja: 正規文字列に変換する
zh_hans: 转换为正则字符串

source: Convert to verbatim string
it: Converti in stringa verbatim
ja: 逐語的文字列に変換する
zh_hans: 转换为逐字字符串

source: Enable nullable reference types in project
it: Abilita tipi riferimento nullable nel progetto
ja: プロジェクトで null 許容参照型を有効にする
zh_hans: 在项目中启用可为 null 的引用类型

source: Remove 'in' keyword
it: Rimuovi la parola chiave 'in'
ja: 'in' キーワードを削除します
zh_hans: 删除 "in" 关键字

source: Remove 'new' modifier
it: Rimuovi il modificatore 'new'
ja: 'new' 修飾子の削除
zh_hans: 删除 "new" 修饰符

source: Selection cannot include global statements
it: La selezione non può includere istruzioni globali
ja: 選択にグローバル ステートメントを含めることはできません
zh_hans: 所选内容不能包含全局语句

source: Selection cannot include top-level statements
it: La selezione non può includere istruzioni di primo livello
ja: 選択に最上位レベルのステートメントを含めることはできません
zh_hans: 所选内容不能包含顶级语句

source: Use recursive patterns
it: Usa criteri ricorsivi
ja: 再帰パターンを使用する
zh_hans: 使用递归模式

# Warning_Expression_may_change_code_meaning
source: Warning: Expression may have side effects. Code meaning may change.
it: Avviso: l'espressione può avere effetti collaterali. Il significato del codice può cambiare.
ja: 警告: 式に副作用がある可能性があります。コードの意味が変更される可能性があります。
zh_hans: 警告: 表达式可能有副作用。代码含义可能更改。

source: Warning: Inlining temporary variable may change code meaning.
it: Avviso: l'espansione inline della variabile temporanea potrebbe modificare il significato del codice.
ja: 警告: 一時変数をインライン化すると、コードの意味が変わる可能性があります。
zh_hans: 警告: 内联临时变量可能会更改代码含义。

source: extern alias
it: alias extern
ja: extern エイリアス
zh_hans: 外部别名

source: record
ja: レコード
zh_hans: 记录

source: record struct
it: struct di record
ja: レコード構造体
zh_hans: 记录结构

source: <pattern variable>
it: <variabile di criterio>
zh_hans: <模式变量>
