Repository: dotnet/roslyn
Catalog: src/Features/CSharp/Portable/xlf/CSharpFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Add await and ConfigureAwait(false)
cs: Přidat await a ConfigureAwait(false)
de: "await" und "ConfigureAwait(false)" hinzufügen
es: Agregar await y ConfigureAwait(false)
fr: Ajouter await et ConfigureAwait(false)
ko: await 및 ConfigureAwait(false) 추가
pl: Dodaj elementy await i ConfigureAwait(false)
pt_br: Adicionar aguardar e ConfigureAwait(false)
ru: Добавить await and ConfigureAwait(false)
tr: Eklemek bekliyor ve ConfigureAwait(false)
zh_hant: 新增 await 和 ConfigureAwait(false)

source: Add accessibility modifiers
cs: Přidat Modifikátory dostupnosti
de: Zugriffsmodifizierer hinzufügen
es: Agregar modificadores de accesibilidad
fr: Ajouter des modificateurs d'accessibilité
ko: 접근성 한정자 추가
pl: Dodaj modyfikatory dostępności
pt_br: Adicionar modificadores de acessibilidade
ru: Добавьте модификаторы доступности
tr: Erişilebilirlik değiştiricileri Ekle
zh_hant: 新增協助工具修飾詞

source: Add await
cs: Přidat await
de: "await" hinzufügen
es: Añadir await
fr: Ajouter une expression await
ko: await 추가
pl: Dodaj element await
pt_br: Adicionar aguardar
ru: Добавить await
tr: Ekleme bekliyor
zh_hant: 新增等候

source: Add missing usings
cs: Přidat chybějící direktivy using
de: Fehlende using-Anweisungen hinzufügen
es: Añadir valores using que faltan
fr: Ajouter les instructions using manquantes
it: Aggiungi using mancanti
ja: 不足している using を追加する
ko: 누락된 using 추가
pl: Dodaj brakujące instrukcje using
pt_br: Adicionar usings ausentes
ru: Добавить отсутствующие директивы using
tr: Eksik usings Ekle
zh_hans: 添加缺少的 using
zh_hant: 新增遺漏的 using

source: Add/remove braces for single-line control statements
cs: Přidat/odebrat složené závorky pro řídicí příkazy na jeden řádek
de: Geschweifte Klammern für einzeilige Steuerungsanweisungen hinzufügen/entfernen
es: Agregar o quitar llaves para instrucciones de control de una línea
fr: Ajouter/supprimer des accolades pour les instructions de contrôle sur une seule ligne
ko: 한 줄 제어문에 대해 중괄호 추가/제거
pl: Dodaj/usuń nawiasy klamrowe w przypadku jednowierszowych instrukcji sterowania
pt_br: Adicionar/remover as chaves das instruções de controle de linha única
ru: Добавлять или удалять фигурные скобки для однострочных операторов управления
tr: Tek satır denetim deyimleri için küme ayracı ekle/küme ayraçlarını kaldır
zh_hant: 新增/移除單行控制項陳述式的括弧

source: Allow unsafe code in this project
cs: Povolit v tomto projektu nezabezpečený kód
de: Unsicheren Code in diesem Projekt zulassen
es: Permitir código no seguro en este proyecto
fr: Autoriser du code unsafe dans ce projet
it: Consenti codice unsafe in questo progetto
ja: このプロジェクトでアンセーフ コードを許可する
ko: 이 프로젝트에서 안전하지 않은 코드 허용
pl: Zezwalaj na niebezpieczny kod w tym projekcie
pt_br: Permitir código não seguro neste projeto
ru: Разрешить небезопасный код в этом проекте
tr: Bu projede güvenli olmayan koda izin ver
zh_hans: 允许在此项目中使用不安全代码

source: Apply expression/block body preferences
cs: Použít předvolby pro tělo výrazu/bloku
de: Ausdrucks-/Blocktexteinstellungen anwenden
es: Aplicar preferencias de cuerpo de expresiones o de bloques
fr: Appliquer les préférences de corps d'expression/de bloc
it: Applica le preferenze relative al corpo dell'espressione o del blocco
ja: 式/ブロック本体の基本設定を適用します
ko: 식/블록 본문 기본 설정 적용
pl: Zastosuj preferencje treści wyrażenia/bloku
pt_br: Aplicar as preferências de expressão/corpo de bloco
ru: Применять предпочтения для выражения или тела блока
tr: İfade/blok gövdesi tercihlerini uygula
zh_hans: 应用表达式/块主体首选项
zh_hant: 套用延伸模組/區塊主體喜好設定

source: Apply implicit/explicit type preferences
cs: Použít předvolby imlicitního/explicitního typu
de: Implizite/explizite Typeneinstellungen anwenden
es: Aplicar preferencias de tipos implícitos o explícitos
fr: Appliquer les préférences de type implicite/explicite
ko: 암시적/명시적 형식 기본 설정 적용
pl: Zastosuj preferencje niejawnego/jawnego typu
pt_br: Aplicar as preferências de tipo implícitas/explícitas
ru: Применять предпочтения для неявных или явных типов
tr: Örtük/açık tür tercihlerini uygula
zh_hant: 套用隱含/明確類型喜好設定

# Apply_inline_out_variable_preferences
source: Apply inline 'out' variables preferences
cs: Použít předvolby vložených proměnných out
de: Einstellungen für out-Inlinevariablen anwenden
es: Aplicar preferencias de variables “out” insertadas
fr: Appliquer les préférences des variables 'out' inline
it: Applica le preferenze relative alle variabili 'out' inline
ja: インラインの 'out' 変数の基本設定を適用します
ko: 인라인 'out' 변수 기본 설정 적용
pl: Zastosuj preferencje wstawionych zmiennych „out”
pt_br: Aplicar as preferências de variáveis 'out' embutidas
ru: Применять предпочтения для встроенных переменных out
tr: Satır içi 'out' değişkenlerine ilişkin tercihleri uygula
zh_hans: 应用内联 “out” 变量首选项
zh_hant: 套用內嵌 'out' 變數喜好設定

source: Apply language/framework type preferences
cs: Použít předvolby typu jazyka/architektury
de: Einstellungen zum Sprach-/Frameworktyp anwenden
es: Aplicar preferencias de tipo de lenguaje o marco
fr: Appliquer les préférences de type de langage/framework
ko: 언어/프레임워크 형식 기본 설정 적용
pl: Zastosuj preferencje typu języka/platformy
pt_br: Aplicar as preferências de linguagem/tipo de estrutura
ru: Применять предпочтения для типа языка или платформы
tr: Dil/çerçeve türü tercihlerini uygula
zh_hant: 套用語言/架構類型喜好設定

source: Apply object/collection initialization preferences
cs: Použít předvolby inicializace objektu/kolekce
de: Einstellungen zur Objekt-/Sammlungsinitialisierung anwenden
es: Aplicar preferencias de inicialización de objetos o colecciones
fr: Appliquer les préférences d'initialisation des objets/collections
ko: 개체/컬렉션 초기화 기본 설정 적용
pl: Zastosuj preferencje inicjowania obiektu/kolekcji
pt_br: Aplicar as preferências de inicialização de objeto/coleção
ru: Применять предпочтения для инициализации объекта или коллекции
tr: Nesne/koleksiyon başlatma tercihlerini uygula
zh_hant: 套用物件/集合初始設定喜好設定

source: Apply 'this.' qualification preferences
cs: Použít předvolby kvalifikace this.
de: Einstellungen zur Qualifikation "this." anwenden
es: Aplicar preferencias de calificación “this.”
fr: Appliquer les préférences de qualification 'this.'
it: Applica le preferenze relative alla qualificazione 'this.'
ja: 'this.' 修飾の基本設定を適用します
ko: 'this.' 한정자 기본 설정 적용
pl: Zastosuj preferencje kwalifikacji „this.”
pt_br: Aplicar as preferências de qualificação 'this.'
ru: Применять предпочтения для квалификации this.
tr: 'this.' nitelemesi tercihlerini uygula
zh_hans: 应用 “this.” 资格首选项
zh_hant: 套用 'this.' 資格喜好設定

source: Assign 'out' parameters
es: Asignar parámetros "out"
fr: Assigner des paramètres 'out'
it: Assegnare parametri 'out'
ja: 'out' パラメーターの割り当て
ru: Присвоение значений параметров "out"
zh_hans: 为 "out" 参数赋值

source: Assign 'out' parameters (at start)
es: Asignar parámetros "out" (al inicio)
fr: Assigner des paramètres 'out' (au début)
it: Assegnare parametri 'out' (all'inizio)
ja: 'out' パラメーターの割り当て (開始時)
ru: Присвоение значений параметров "out" (при запуске)
zh_hans: 为 "out" 赋值 (在开始处)

source: Convert switch statement to expression
cs: Převést příkaz switch na výraz
de: Switch-Anweisung in Ausdruck konvertieren
es: Convertir una instrucción switch en expresión
fr: Convertir l'instruction switch en expression
ko: switch 문을 식으로 변환
pl: Konwertuj instrukcję switch na wyrażenie
pt_br: Converter a instrução switch em expressão
ru: Преобразовать оператор switch в выражение
tr: Switch deyimini ifadeye dönüştür

source: Convert to method
cs: Převést na metodu
de: In Methode konvertieren
es: Convertir al método
fr: Convertir en méthode
it: Converti in metodo
ja: メソッドに変換
ko: 메서드로 변환
pl: Konwertuj na metodę
pt_br: Converter em método
ru: Преобразовать в метод
tr: Yönteme dönüştür
zh_hans: 转换为方法
zh_hant: 轉換為方法

source: Convert to 'switch' expression
it: Converti nell'espressione 'switch'
ja: 'switch' 式に変換する
ru: Преобразовать в выражение "switch"
zh_hans: 转换为 "switch" 表达式

source: Convert to 'switch' statement
it: Converti nell'istruzione 'switch'
ja: 'switch' ステートメントに変換
ru: Преобразовать в оператор \"switch\"
zh_hans: 转换为 \"switch\" 语句

source: Declare as nullable
cs: Deklarovat jako s možnou hodnotou null
de: Als für NULL-Werte zulässig deklarieren
es: Declara como que acepta valores NULL
fr: Déclarer comme nullable
it: Dichiara come nullable
ja: Null 許容型として宣言する
ko: Nullable로 선언
pl: Zadeklaruj jako dopuszczający wartość null
pt_br: Declarar como anulável
ru: Объявить как тип, допускающий значения null
tr: Olarak null olabilecek ilan
zh_hans: 声明成可为 null
zh_hant: 宣告為可為 Null

source: Fix return type
cs: Opravit návratový typ
de: Rückgabetyp korrigieren
es: Corregir tipo de valor devuelto
fr: Corriger le type de retour
it: Correggi il tipo restituito
ja: 戻り値の型の修正
ko: 반환 형식 수정
pl: Napraw zwracany typ
pt_br: Corrigir o tipo de retorno
ru: Исправить тип возвращаемых значений
tr: Dönüş türünü düzelt
zh_hans: 修复返回类型

source: Inline temporary variable
cs: Dočasná vložená proměnná
de: Inline temporär variabel
es: Variable temporal en línea
fr: Variable temporaire inline
it: Variabile temporanea inline
ja: インラインの一時変数
ko: 인라인 임시 변수
pl: Wstawiona zmienna tymczasowa
pt_br: Variável temporária embutida
ru: Встроенная временная переменная
tr: Satır içi geçici değişken
zh_hans: 内联临时变量
zh_hant: 內嵌暫存變數

source: Conflict(s) detected.
cs: Zjistily se konflikty.
de: Konflikt(e) erkannt.
es: Conflicto(s) detectado(s).
fr: Conflit(s) détecté(s).
it: Sono stati rilevati conflitti.
ja: 競合が検出されました。
ko: 충돌이 감지되었습니다.
pl: Wykryto konflikty.
pt_br: Conflito(s) detectado(s).
ru: Обнаружены конфликты.
tr: Çakışmalar algılandı.
zh_hans: 检测到冲突。
zh_hant: 偵測到衝突。

# Make_private_field_readonly_when_possible
source: Make private fields readonly when possible
cs: Nastavit privátní pole jako jenom pro čtení, kde je to možné
de: Private Felder nach Möglichkeit als schreibgeschützt festlegen
es: Cuando sea posible, hacer que los cambios privados sean solo de lectura
fr: Configurer les champs privés en lecture seule quand cela est possible
it: Imposta i campi privati come di sola lettura quando possibile
ja: 可能な場合、private フィールドを読み取り専用にする
ko: 가능한 경우 프라이빗 필드를 읽기 전용으로 만들기
pl: Ustawiaj pola prywatne jako tylko do odczytu, gdy to możliwe
pt_br: Tornar os campos privados somente leitura quando possível
ru: При возможности делать частные поля доступными только для чтения
tr: Özel alanları mümkün olduğunda salt okunur yap
zh_hans: 尽可能将私有字段设置为“只读”
zh_hant: 若可能的話，請將私用欄位設定為唯讀

source: Make 'ref struct'
cs: Nastavit jako ref struct
de: "ref struct" erstellen
es: Convertir "ref struct"
fr: Définir 'ref struct'
it: Imposta come 'ref struct'
ja: 'ref struct' を作成します
ko: 'ref struct'로 지정
pl: Ustaw jako „ref struct”
pt_br: Alterar 'ref struct'
ru: Сделать ref struct
tr: 'ref struct' yap
zh_hans: 生成 "ref struct"

source: Pass in captured variables as arguments
es: Pasar variables capturadas como argumentos
fr: Passer les variables capturées en tant qu'arguments
ru: Передача захваченных переменных в качестве аргументов

source: Remove unnecessary casts
cs: Odebrat nepotřebná přetypování
de: Nicht erforderliche Umwandlungen entfernen
es: Quitar conversiones innecesarias
fr: Supprimer les casts inutiles
ko: 불필요한 캐스트 제거
pl: Usuń niepotrzebne rzutowania
pt_br: Remover conversões desnecessárias
ru: Удалить ненужные приведения
tr: Gereksiz atamaları kaldır
zh_hant: 移除不必要的 Cast

source: Remove unused variables
cs: Odebrat nepoužívané proměnné
de: Nicht verwendete Variablen entfernen
es: Quitar variables no utilizadas
fr: Supprimer les variables inutilisées
ko: 사용하지 않는 변수 제거
pl: Usuń nieużywane zmienne
pt_br: Remover variáveis não utilizadas
ru: Удалить неиспользуемые переменные
tr: Kullanılmayan değişkenleri kaldır
zh_hant: 移除未使用的變數

source: Reverse 'for' statement
it: Inverti l'istruzione 'for'
ja: 'for' ステートメントの反転
ru: Обратить оператор "for"
zh_hans: 反向“for”语句

source: Simplify lambda expression
cs: Zjednodušit výraz lambda
de: Lambdaausdruck vereinfachen
es: Simplificar expresión lambda
fr: Simplifier l'expression lambda
it: Semplifica l'espressione lambda
ja: ラムダ式の簡略化
ko: 람다 식 단순화
pl: Uprość wyrażenie lambda
pt_br: Simplificar expressão lambda
ru: Упростить лямбда-выражение
tr: Lambda ifadesini basitleştir
zh_hans: 简化 lambda 表达式
zh_hant: 簡化 Lambda 運算式

source: Simplify all occurrences
cs: Zjednodušit všechny výskyty
de: Alle Vorkommen vereinfachen
es: Simplificar todas las repeticiones
fr: Simplifier toutes les occurrences
it: Semplifica tutte le occorrenze
ja: すべての出現箇所を簡素化します
ko: 모든 항목 단순화
pl: Uprość wszystkie wystąpienia
pt_br: Simplificar todas as ocorrências
ru: Упростить все вхождения
tr: Tüm yinelemeleri basitleştir
zh_hans: 简化所有事件
zh_hant: 簡化所有項目

source: Remove Unnecessary Usings
cs: Odebrat nepotřebné direktivy using
de: Nicht benötigte Using-Direktiven entfernen
es: Eliminar instrucciones Using innecesarias
fr: Supprimer les Usings inutiles
ko: 불필요한 Using 제거
pl: Usuń niepotrzebne użycia
pt_br: Remover Usos Desnecessários
ru: Удалить ненужные директивы using
tr: Gereksiz Kullanımları Kaldır
zh_hant: 移除不必要的 Using

source: Sort accessibility modifiers
cs: Seřadit modifikátory dostupnosti
de: Zugriffsmodifizierer sortieren
es: Ordenar modificadores de accesibilidad
fr: Trier les modificateurs d'accessibilité
ko: 접근성 한정자 정렬
pl: Sortuj modyfikatory dostępności
pt_br: Classificar modificadores de acessibilidade
ru: Сортировать модификаторы доступности
tr: Erişilebilirlik değiştiricilerini sırala
zh_hant: 排序協助工具修飾詞

source: Unseal class '{0}'
cs: Rozpečetit třídu {0}
de: Versiegelung der Klasse "{0}" aufheben
es: Quitar el sello de la clase "{0}"
fr: Classe unsealed '{0}'
it: Rimuovi seal dalla classe '{0}'
ja: クラス '{0}' のシールを解除
ko: '{0}' 클래스 봉인 해제
pl: Odpieczętuj klasę „{0}”
pt_br: Desselar a classe '{0}'
ru: Распечатать класс "{0}"
tr: '{0}' sınıfının mührünü aç
zh_hans: Unseal 类 "{0}"

source: Use 'switch' expression
cs: Použít výraz switch
de: Switch-Ausdruck verwenden
es: Usar la expresión "switch"
fr: Utiliser l'expression 'switch'
ko: 'switch' 식 사용
pl: Użyj wyrażenia „switch”
pt_br: Usar a expressão 'switch'
ru: Использовать выражение switch
tr: 'Switch' ifadesini kullan

source: Warning: Inlining temporary into conditional method call.
es: Advertencia: Inserción de una llamada temporal en otra de método condicional.
fr: Avertissement : Inlining temporaire dans un appel de méthode conditionnel.
it: Avviso: incorporamento dell'elemento temporaneo nella chiamata a un metodo condizionale.
ja: 警告: 一時メソッド呼び出しを条件付きメソッド呼び出しにインライン展開しています。
ru: Предупреждение: встраивание временных элементов в условный вызов метода.
zh_hans: 警告: 即将在条件方法调用中内联临时内容。

source: Warning: Adding parameters to local function declaration may produce invalid code.
es: Advertencia: Agregar parámetros a la declaración de función local puede generar código no válido.
fr: Avertissement : L'ajout de paramètres à la déclaration de fonction locale peut produire du code non valide.
ru: Предупреждение! Добавление параметров в объявление локальной функции может привести к недопустимому коду.

source: '{0}' is not null here.
cs: {0} tady není null.
de: "{0}" ist hier nicht NULL.
es: "{0}" no es NULL aquí.
fr: '{0}' n'a pas une valeur null ici.
ko: '{0}'은(는) 여기에서 null이 아닙니다.
pl: Element „{0}” nie ma wartości null w tym miejscu.
ru: Здесь "{0}" имеет значение, отличное от NULL.

source: '{0}' may be null here.
cs: {0} tady může být null.
de: "{0}" darf hier NULL sein.
es: "{0}" puede ser NULL aquí.
fr: '{0}' a peut-être une valeur null ici.
ko: '{0}'은(는) 여기에서 null일 수 있습니다.
pl: Element „{0}” może mieć wartość null w tym miejscu.
ru: Здесь "{0}" может иметь значение NULL.

source: asynchronous foreach statement
cs: asynchronní příkaz foreach
es: instrucción foreach asincrónica
fr: instruction foreach asynchrone
it: istruzione foreach asincrona
ja: 非同期の foreach ステートメント
ko: 비동기 foreach 문
pl: asynchroniczna instrukcja foreach
ru: асинхронная инструкция foreach
zh_hans: 异步 foreach 语句

source: asynchronous using declaration
cs: asynchronní deklarace using
es: declaración using asincrónica
fr: déclaration using asynchrone
it: dichiarazione using asincrona
ja: 非同期の using 宣言
ko: 비동기 using 선언
pl: asynchroniczna deklaracja using
ru: асинхронное объявление using
zh_hans: 异步 using 声明

source: 'if' statement can be simplified
cs: Příkaz if lze zjednodušit.
de: Die If-Anweisung kann vereinfacht werden.
es: La instrucción "if" se puede simplificar
fr: L'instruction 'if' peut être simplifiée
ko: 'if' 문을 간단하게 줄일 수 있습니다.
pl: Instrukcja „if” może zostać uproszczona
pt_br: A instrução 'if' pode ser simplificada
ru: Оператор if можно упростить
tr: 'If' deyimi basitleştirilebilir
zh_hant: 'if' 陳述式可簡化

source: <lambda expression>
cs: <lambda výraz>
de: <Lambdaausdruck>
es: <expresión lambda>
fr: <expression lambda>
it: <espressione lambda>
ja: <ラムダ式>
ko: <람다 식>
pl: <wyrażenie lambda>
pt_br: <expressão lambda>
ru: <лямбда-выражение>
tr: < lambda ifadesi >
zh_hans: <lambda 表达式>
zh_hant: <Lambda 運算式>

source: Autoselect disabled due to potential lambda declaration.
cs: Automatický výběr je zakázaný kvůli možné deklaraci lambda.
de: Automatische Auswahl aufgrund einer potenziellen Lambdadeklaration deaktiviert.
es: La selección automática se ha deshabilitado debido posiblemente a una declaración lambda.
fr: Sélection automatique désactivée en raison d'une déclaration lambda éventuelle.
it: La selezione automatica è disabilitata a causa di una potenziale dichiarazione lambda.
ja: ラムダが宣言された可能性があるため、自動選択は無効になっています。
ko: 람다 선언이 있을 수 있어 자동 선택을 사용하지 않도록 설정했습니다.
pl: Automatyczne zaznaczanie zostało wyłączone z powodu możliwej deklaracji lambda.
pt_br: Seleção automática desabilitada devido à possível declaração lambda.
ru: Автовыбор отключен из-за возможного объявления лямбды.
tr: Otomatik seçim, olası lambda bildirimi nedeniyle devre dışı bırakıldı.
zh_hans: 由于可能出现 lambda 声明，已禁用自动选择。
zh_hant: 由於可能的 Lambda 宣告，所以停用自動選取。

source: local variable declaration
cs: deklarace lokální proměnné
es: declaración de variable local
fr: déclaration de variable locale
it: dichiarazione di variabile locale
ja: ローカル変数宣言
ko: 지역 변수 선언
pl: deklaracja zmiennej lokalnej
ru: объявление локальной переменной
zh_hans: 局部变量声明

source: <member name> =
cs: <název členu> =
es: <nombre> =
fr: <nom de membre> =
it: <nome membro> =
ja: <メンバー名> =
ko: <멤버 이름> =
pl: <nazwa składowej> =
pt_br: <nome do membro> =
ru: <имя члена> =
tr: < üye adı > =
zh_hans: <成员名称>=
zh_hant: <成員名稱> =

source: Autoselect disabled due to possible explicitly named anonymous type member creation.
cs: Automatický výběr je zakázaný kvůli možnému vytvoření explicitně pojmenovaného člena anonymního typu.
de: Automatische Auswahl aufgrund der möglichen Erstellung eines explizit genannten anonymen Typmembers deaktiviert.
es: La selección automática se ha deshabilitado debido a la creación de un miembro de tipo anónimo nombrado explícitamente.
fr: Sélection automatique désactivée en raison de la création éventuelle d'un membre de type anonyme nommé explicitement.
it: La selezione automatica è disabilitata a causa della creazione di possibili membri di tipo anonimo denominati in modo esplicito.
ja: 明示的に指定された匿名型メンバーの作成である可能性があるため、自動選択は無効になっています。
ko: 명시적으로 이름이 지정된 익명 형식 멤버가 만들어질 수 있어 자동 선택을 사용하지 않도록 설정했습니다.
pl: Automatyczne zaznaczanie zostało wyłączone z powodu możliwego utworzenia jawnie nazwanej anonimowej składowej typu.
pt_br: Seleção automática desabilitada devido à possível criação de membros do tipo anônimo nomeados explicitamente.
ru: Автовыбор отключен из-за возможного создания явно названного участника анонимного типа.
tr: Otomatik seçim, olası açık adlı anonim tür üyesi oluşturma nedeniyle devre dışı bırakıldı.
zh_hans: 由于可能导致创建显式命名的匿名类型成员，自动选择已禁用。
zh_hant: 由於可能會建立明確命名的匿名類型成員，所以停用自動選取。

source: <element name> :
cs: <název prvku>:
es: <nombre de elemento> :
fr: <nom d'élément> :
it: <nome elemento>:
ja: <要素名> :
ko: <요소 이름>:
pl: <nazwa elementu>:
pt_br: <nome do elemento:>
ru: <имя элемента>:
tr: < öğe adı >:
zh_hans: <元素名称>:
zh_hant: <元素名稱> :

source: Autoselect disabled due to possible tuple type element creation.
cs: Automatický výběr je zakázaný kvůli možnému vytvoření elementu typu řazená kolekce členů.
de: Die automatische Auswahl wurde aufgrund einer möglichen Tupeltyp-Elementerstellung deaktiviert.
es: La selección automática se deshabilitó debido a la posible creación de elementos de tipo de tupla.
fr: Sélection automatique désactivée en raison de la création possible d'un élément de type tuple.
it: La selezione automatica è disabilitata a causa della potenziale creazione di elementi di tipo tupla.
ja: タプル型の要素が作成された可能性があるため、自動選択は無効になっています。
ko: 가능한 튜플 형식 요소 만들기로 인해 자동 선택을 사용할 수 없습니다.
pl: Funkcja automatycznego wyboru została wyłączona ze względu na prawdopodobne utworzenie elementu typu krotki.
pt_br: Seleção automática desabilitada devido a uma possível criação de elemento do tipo tupla.
ru: Автовыбор отключен из-за возможного создания элемента типа кортежа.
tr: Olası demet türü öğe oluşturma işleminden dolayı Otomatik seçim devre dışı bırakıldı.
zh_hans: 由于可能的元组类型元素创建，已禁用自动选择。
zh_hant: 因為可能建立元組類型元素，所以停用自動選擇。

source: <range variable>
cs: <proměnná rozsahu>
de: <Bereichsvariable>
es: <variable de intervalo>
fr: <variable de plage>
it: <variabile di intervallo>
ja: <範囲変数>
ko: <범위 변수>
pl: <zmienna zakresu>
pt_br: <variável de intervalo>
ru: <переменная диапазона>
tr: < Aralık değişkeni >
zh_hans: <范围变量>
zh_hant: <範圍變數>

source: Autoselect disabled due to potential range variable declaration.
cs: Automatický výběr je zakázaný kvůli možné deklaraci proměnné rozsahu.
de: Automatische Auswahl aufgrund einer potzenziellen Bereichvariablendeklaration deaktiviert.
es: La selección automática se ha deshabilitado debido posiblemente a una declaración de variable de rango.
fr: Sélection automatique désactivée en raison d'une déclaration de variable de plage éventuelle.
it: La selezione automatica è disabilitata a causa di una potenziale dichiarazione della variabile di intervallo.
ja: 範囲変数宣言の可能性があるため、自動選択は無効になっています。
ko: 범위 변수가 선언될 수 있어 자동 선택을 사용하지 않도록 설정했습니다.
pl: Automatyczne zaznaczanie zostało wyłączone z powodu możliwej deklaracji zmiennej zakresu.
pt_br: Seleção automática desabilitada devido a uma possível declaração de variável de intervalo.
ru: Автовыбор отключен из-за возможного объявления переменной диапазона.
tr: Otomatik seçim, olası aralık değişkeni bildirimi nedeniyle devre dışı bırakıldı.
zh_hans: 由于可能出现范围变量声明，已禁用自动选择。
zh_hant: 由於可能的範圍變數宣告，所以停用自動選取。

source: Simplify name '{0}'
cs: Zjednodušit název {0}
de: Name '{0}' vereinfachen
es: Simplificar nombre '{0}'
fr: Simplifier le nom '{0}'
it: Semplifica il nome '{0}'
ja: 名前 '{0}' の単純化
ko: {0}' 이름 단순화
pl: Uprość nazwę „{0}”
pt_br: Simplificar nome '{0}'
ru: Упрощение имени "{0}"
tr: {0}' adını basitleştir
zh_hans: 简化名称“{0}”
zh_hant: 簡化名稱 '{0}'

source: Simplify member access '{0}'
cs: Zjednodušit přístup ke členu {0}
de: Memberzugriff '{0}' vereinfachen
es: Simplificar acceso a miembros '{0}'
fr: Simplifier l'accès au membre '{0}'
it: Semplifica l'accesso dei membri '{0}'
ja: メンバーのアクセス '{0}' を単純化します
ko: 멤버 액세스 '{0}' 단순화
pl: Uprość dostęp do składowej „{0}”
pt_br: Simplificar acesso do membro '{0}'
ru: Упрощение доступа для членов "{0}"
tr: {0}' üye erişimini basitleştir
zh_hans: 简化成员访问“{0}”
zh_hant: 簡化成員存取 '{0}'

source: Remove 'this' qualification
cs: Odebrat kvalifikaci this
de: Qualifikation 'this' entfernen
es: Quitar calificación 'this'
fr: Supprimer la qualification 'this'
it: Rimuove la qualificazione 'this'
ja: this' 修飾子を削除します
ko: this' 한정자 제거
pl: Usuń kwalifikację „this”
pt_br: Remover qualificação ''this''
ru: Удаление квалификации this
tr: this' nitelemesini kaldır
zh_hans: 删除 "this" 资格
zh_hant: 移除 'this' 限定性條件
