Repository: dotnet/roslyn
Catalog: src/Features/CSharp/Portable/xlf/CSharpFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: await expression
cs: výraz await
de: await-Ausdruck
es: expresión await
fr: expression await
it: espressione await
ja: await 式
ko: await 식
pl: wyrażenie await
pt_br: expressão await
ru: выражение await
tr: await ifadesi
zh_hans: await 表达式
zh_hant: await 運算式

source: lambda
ja: ラムダ
ko: 람다
ru: лямбда

source: anonymous method
cs: anonymní metoda
de: Anonyme Methode
es: método anónimo
fr: méthode anonyme
it: metodo anonimo
ja: 匿名メソッド
ko: 무명 메서드
pl: metoda anonimowa
pt_br: método anônimo
ru: анонимный метод
tr: anonim yöntem
zh_hans: 匿名方法
zh_hant: 匿名方法

source: from clause
cs: klauzule from
de: from-Klausel
es: cláusula from
fr: clause from
it: clausola from
ja: from 句
ko: from 절
pl: klauzula from
pt_br: cláusula from
ru: предложение from
tr: from yan tümcesi
zh_hans: from 子句
zh_hant: from 子句

source: join clause
cs: klauzule join
de: join-Klausel
es: cláusula join
fr: clause join
it: clausola join
ja: join 句
ko: join 절
pl: klauzula join
pt_br: cláusula join
ru: предложение join
tr: join yan tümcesi
zh_hans: join 子句
zh_hant: join 子句

source: let clause
cs: klauzule let
de: let-Klausel
es: cláusula let
fr: clause let
it: clausola let
ja: let 句
ko: let 절
pl: klauzula let
pt_br: cláusula let
ru: предложение let
tr: let yan tümcesi
zh_hans: let 子句
zh_hant: let 子句

source: where clause
cs: klauzule where
de: where-Klausel
es: cláusula where
fr: clause where
it: clausola where
ja: where 句
ko: where 절
pl: klauzula where
pt_br: cláusula where
ru: предложение where
tr: where yan tümcesi
zh_hans: where 子句
zh_hant: where 子句

source: orderby clause
cs: klauzule orderby
de: orderby-Klausel
es: cláusula orderby
fr: clause orderby
it: clausola orderby
ja: orderby 句
ko: orderby 절
pl: klauzula orderby
pt_br: cláusula orderby
ru: предложение orderby
tr: orderby yan tümcesi
zh_hans: orderby 子句
zh_hant: orderby 子句

source: select clause
cs: klauzule select
de: select-Klausel
es: cláusula select
fr: clause select
it: clausola select
ja: select 句
ko: select 절
pl: klauzula select
pt_br: cláusula select
ru: предложение select
tr: select yan tümcesi
zh_hans: select 子句
zh_hant: select 子句

source: groupby clause
cs: klauzule groupby
de: groupby-Klausel
es: cláusula groupby
fr: clause groupby
it: clausola groupby
ja: groupby 句
ko: groupby 절
pl: klauzula groupby
pt_br: cláusula groupby
ru: предложение groupby
tr: groupby yan tümcesi
zh_hans: groupby 子句
zh_hant: groupby 子句

source: query body
cs: tělo dotazu
de: Abfragetext
es: cuerpo de consulta
fr: corps de la requête
it: corpo della query
ja: クエリ本体
ko: 쿼리 본문
pl: treść zapytania
pt_br: corpo da consulta
ru: текст запроса
tr: sorgu gövdesi
zh_hans: 查询正文
zh_hant: 查詢主體

source: into clause
cs: klauzule into
de: into-Klausel
es: cláusula into
fr: clause into
it: clausola into
ja: into 句
ko: into 절
pl: klauzula into
pt_br: cláusula into
ru: предложение into
tr: into yan tümcesi
zh_hans: into 子句
zh_hant: into 子句

source: is pattern
cs: vzor is
de: is-Muster
es: patrón is
fr: modèle is
it: criterio is
ja: is パターン
ko: is 패턴
pl: wzorzec is
pt_br: padrão is
ru: шаблон is
tr: is deseni
zh_hans: is 模式
zh_hant: 為模式

source: deconstruction
cs: dekonstrukce
de: Dekonstruktion
es: desconstrucción
fr: déconstruction
it: decostruzione
ja: 分解
ko: 분해
pl: dekonstrukcja
pt_br: desconstrução
ru: деконструирование
tr: ayrıştırma
zh_hans: 析构函数
zh_hant: 解構

source: tuple
cs: řazená kolekce členů
de: Tupel
es: tupla
it: tupla
ja: タプル
ko: 튜플
pl: krotka
pt_br: tupla
ru: кортеж
tr: demet
zh_hans: 元组
zh_hant: 元組

source: local function
cs: lokální funkce
de: Lokale Funktion
es: función local
fr: fonction locale
it: funzione locale
ja: ローカル関数
ko: 로컬 함수
pl: funkcja lokalna
pt_br: função local
ru: локальная функция
tr: yerel işlev
zh_hans: 本地函数
zh_hant: 區域函式

# out_var
source: out variable
cs: proměnná out
es: variable out
fr: variable out
it: variabile out
ja: out 変数
ko: out 변수
pl: zmienna „out”
pt_br: variável out
ru: переменная out
tr: out değişkeni
zh_hans: out 变量
zh_hant: out 變數

source: ref local or expression
cs: místní ref nebo výraz
de: ref – "local" oder Ausdruck
es: ref local o expresión
fr: variable locale ou expression ref
it: espressione o variabile locale ref
ja: ref ローカルまたは式
ko: ref 지역 또는 식
pl: ref — lokalna zmienna lub wyrażenie
pt_br: expressão ou variável local ref
ru: локальная переменная ref или выражение
tr: yerel ref veya ifade
zh_hans: ref 本地函数或表达式
zh_hant: 參考本機或運算式

source: global statement
cs: příkaz global
de: global – Anweisung
es: declaración global
fr: instruction global
it: istruzione global
ja: global ステートメント
ko: global 문
pl: instrukcja global
pt_br: instrução global
ru: инструкция global
tr: global deyimi
zh_hans: global 语句
zh_hant: global 陳述式

source: using namespace
es: uso de espacio de nombres
fr: espace de noms using
ko: using 네임스페이스
pl: przestrzeń nazw using
pt_br: usando o namespace
ru: пространство имен using
zh_hant: using 命名空間

source: using directive
cs: direktiva using
de: Using-Direktive
es: uso de directiva
fr: directive using
it: direttiva using
ja: using ディレクティブ
ko: using 지시문
pl: dyrektywa using
pt_br: usando a diretiva
ru: директива using
tr: using yönergesi
zh_hans: using 指令
zh_hant: using 指示詞

source: event field
cs: pole event
de: Ereiginisfeld
es: campo de evento
fr: champ d'événement
it: campo evento
ja: イベント フィールド
ko: 이벤트 필드
pl: pole event
pt_br: campo do evento
ru: поле события
tr: olay alanı
zh_hans: 事件字段
zh_hant: 事件欄位

source: conversion operator
cs: operátor převodu
de: Konvertierungsoperator
es: operador de conversión
fr: opérateur de conversion
it: operatore di conversione
ja: 変換演算子
ko: 변환 연산자
pl: operator konwersji
pt_br: operador de conversão
ru: оператор преобразования
tr: dönüştürme işleci
zh_hans: 转换运算符
zh_hant: 轉換運算子

source: destructor
cs: destruktor
de: Destruktor
fr: destructeur
it: distruttore
ja: デストラクター
ko: 소멸자
pl: destruktor
pt_br: destruidor
ru: деструктор
tr: yok edici
zh_hans: 析构函数
zh_hant: 解構函式

source: indexer
es: indizador
fr: indexeur
it: indicizzatore
ja: インデクサー
ko: 인덱서
pl: indeksator
pt_br: indexador
ru: индексатор
tr: dizin oluşturucu
zh_hans: 索引器
zh_hant: 索引子

source: property getter
cs: metoda getter vlastnosti
de: Getter für eine Eigenschaft
es: captador de propiedad
fr: méthode getter de propriété
it: getter proprietà
ja: プロパティ ゲッター
ko: 속성 getter
pl: metoda pobierająca właściwości
pt_br: getter da propriedade
ru: метод получения свойств
tr: özellik alıcısı
zh_hans: 属性 Getter
zh_hant: 屬性 getter

source: indexer getter
cs: metoda getter indexeru
es: captador de indizador
fr: méthode getter d'indexeur
it: getter indicizzatore
ja: インデクサー ゲッター
ko: 인덱서 getter
pl: metoda pobierająca indeksatora
pt_br: getter do indexador
ru: метод получения индексатора
tr: dizin oluşturucu alıcısı
zh_hans: 索引器 Getter
zh_hant: 索引子 getter

source: property setter
cs: metoda Set vlastnosti
de: Setter für eine Eigenschaft
es: configurador de propiedad
fr: méthode setter de propriété
it: setter proprietà
ja: プロパティ set アクセス操作子
ko: 속성 setter
pl: metoda ustawiająca właściwości
pt_br: setter da propriedade
ru: метод задания свойств
tr: özellik ayarlayıcısı
zh_hans: 属性 setter
zh_hant: 屬性 setter

source: indexer setter
cs: metoda Set indexeru
es: configurador de indizador
fr: méthode setter d'indexeur
it: setter indicizzatore
ja: インデクサー set アクセス操作子
ko: 인덱서 setter
pl: metoda ustawiająca indeksatora
pt_br: setter do indexador
ru: метод задания индексатора
tr: dizin oluşturucu ayarlayıcısı
zh_hans: 索引器 setter
zh_hant: 索引子 setter

source: attribute target
cs: cíl atributu
de: Attributziel
es: destino de atributo
fr: cible d'attribut
it: destinazione dell'attributo
ja: 属性ターゲット
ko: 특성 대상
pl: cel atrybutu
pt_br: destino do atributo
ru: назначение атрибута
tr: öznitelik hedefi
zh_hans: 属性目标
zh_hant: 屬性目標

source: '{0}' does not contain a constructor that takes that many arguments.
cs: '{0} neobsahuje konstruktor, který přebírá tolik argumentů.
de: '"{0}" enthält keinen Konstruktor, der viele Argumente verwendet.
es: '{0}' no contiene un constructor que tome tantos argumentos.
fr: '{0}' ne contient pas de constructeur prenant en charge autant d'arguments.
it: '{0}' non contiene un costruttore che accetta un tale numero di argomenti.
ja: '{0}' には、多数の引数を指定できるコンストラクターがありません。
ko: '{0}'에 해당 개수의 인수를 사용하는 생성자가 없습니다.
pl: 'Element „{0}” nie zawiera konstruktora, który przyjmuje wiele argumentów.
pt_br: '{0}' não tem um construtor que aceite que muitos argumentos.
ru: '"{0}" не содержит конструктор, который принимает такое количество аргументов.
tr: '{0}' bu kadar çok sayıda bağımsız değişken alan bir oluşturucu içermiyor.
zh_hans: “{0}”不包含采用许多参数的构造函数。
zh_hant: '{0}' 不包含接受許多引數的建構函式。

source: The name '{0}' does not exist in the current context.
cs: Název {0} v aktuálním kontextu neexistuje.
de: Der Name "{0}" ist im aktuellen Kontext nicht vorhanden.
es: El nombre '{0}' no existe en el contexto actual.
fr: Le nom '{0}' n'existe pas dans le contexte actuel.
it: Il nome '{0}' non esiste nel contesto corrente.
ja: 名前 '{0}' は、現在のコンテキストに存在しません。
ko: 이름 '{0}'이(가) 현재 컨텍스트에 없습니다.
pl: Nazwa „{0}” nie istnieje w bieżącym kontekście.
pt_br: O nome '{0}' não existe no contexto atual.
ru: Имя "{0}" не существует в текущем контексте.
tr: {0}' adı geçerli bağlamda yok.
zh_hans: 当前上下文中不存在名称“{0}”。
zh_hant: 目前內容中沒有名稱 '{0}'。

source: Hide base member
cs: Skrýt základního člena
de: Basismember ausblenden
es: Ocultar miembro base
fr: Masquer le membre de base
it: Nascondi il membro di base
ja: 基本メンバーを非表示にします
ko: 기본 멤버 숨기기
pl: Ukryj składową bazową
pt_br: Ocultar o membro base
ru: Скрыть базовый член
tr: Temel üyeyi gizle
zh_hans: 隐藏基成员
zh_hant: 隱藏基底成員

source: Delegate invocation can be simplified.
cs: Volání delegáta se dá zjednodušit.
de: Der Delegataufruf kann vereinfacht werden.
es: La invocación del delegado se puede simplificar.
fr: L'appel de délégué peut être simplifié.
ko: 대리자 호출을 간단하게 만들 수 있습니다.
pl: Wywołanie delegata można uprościć.
pt_br: A invocação de delegado pode ser simplificada.
ru: Вызов делегата можно упростить.
tr: Temsilci çağrısı basitleştirilebilir.
zh_hant: 可以簡化委派引動的過程。

source: Properties
cs: Vlastnosti
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pl: Właściwości
pt_br: Propriedades
ru: Свойства
tr: Özellikler
zh_hans: 属性
zh_hant: 屬性

source: Use explicit type instead of 'var'
cs: Použít explicitní typ místo var
de: Expliziten Typ anstelle von "var" verwenden
es: Usar un tipo explícito en lugar de 'var'
fr: Utiliser un type explicite au lieu de 'var'
ko: var' 대신에 명시적 형식을 사용합니다.
pl: Użyj jawnego typu zamiast deklaracji „var”
pt_br: Usar o tipo explícito em vez de 'var'
ru: Использовать явный тип вместо var
tr: Var' yerine açık tür kullan
zh_hant: 使用明確類型，而非 'var'

source: Use explicit type
cs: Použít explicitní typ
de: Expliziten Typ verwenden
es: Usar un tipo explícito
fr: Utiliser un type explicite
ko: 명시적 형식 사용
pl: Użyj jawnego typu
pt_br: Usar o tipo explícito
ru: Использование явного типа
tr: Açık tür kullanma
zh_hant: 使用明確類型

source: use 'var' instead of explicit type
cs: Použít var místo explicitního typu
de: "var" anstelle des expliziten Typs verwenden
es: Usar 'var' en lugar de un tipo explícito
fr: utiliser 'var' au lieu d'un type explicite
ko: 대신 명시적 형식의 'var'을 사용합니다.
pl: użyj deklaracji „var” zamiast jawnego typu
pt_br: usar 'var' em vez do tipo explícito
ru: Использовать var вместо явного типа
tr: açık tür yerine 'var' kullan
zh_hant: 使用 'var'，而非明確類型

source: Use implicit type
cs: Použít implicitní typ
de: Impliziten Typ verwenden
es: Usar un tipo implícito
fr: Utiliser un type implicite
ko: 암시적 형식 사용
pl: Użyj niejawnego typu
pt_br: Usar o tipo implícito
ru: Использование неявного типа
tr: Örtük tür kullanma
zh_hant: 使用隱含類型

source: Autoselect disabled due to namespace declaration.
cs: Automatický výběr je zakázaný kvůli deklaraci oboru názvů.
de: Die automatische Auswahl ist aufgrund der Namespacedeklaration deaktiviert.
es: Se ha deshabilitado la selección automática durante la declaración del espacio de nombres.
fr: Sélection automatique désactivée en raison d'une déclaration d'espace de noms.
it: La selezione automatica è disabilitata a causa della dichiarazione dello spazio dei nomi.
ja: 名前空間宣言により、Autoselect は無効です。
ko: 네임스페이스 선언으로 인해 자동 선택을 사용할 수 없습니다.
pl: Automatyczne zaznaczanie zostało wyłączone z powodu deklaracji przestrzeni nazw.
pt_br: Seleção automática desabilitada devido à declaração de namespace.
ru: Автовыбор отключен из-за объявления пространства имен.
tr: Ad alanı bildirimi nedeniyle otomatik seçme devre dışı bırakıldı.
zh_hans: 自动选择由于命名空间声明而被禁用。
zh_hant: 由於命名空間宣告，所以停用自動選取。

source: <namespace name>
cs: <název oboru názvů>
es: <nombre de espacio de nombres>
fr: <nom d'espace de noms>
it: <nome spazio dei nomi>
ja: <名前空間名>
ko: <네임스페이스 이름>
pl: <nazwa przestrzeni nazw>
pt_br: <nome do namespace>
ru: <имя пространства имен>
tr: < ad alanı adı >
zh_hans: <命名空间名称>
zh_hant: <命名空間名稱>

source: Autoselect disabled due to type declaration.
cs: Automatický výběr je zakázaný kvůli deklaraci typu.
de: Die automatische Auswahl ist aufgrund der Typdeklaration deaktiviert.
es: Selección automática deshabilitada debido a la declaración de tipos.
fr: Sélection automatique désactivée en raison d'une déclaration de type.
it: La selezione automatica è disabilitata a causa della dichiarazione di tipo.
ja: 型宣言が原因で、自動選択は無効になっています。
ko: 형식 선언으로 인해 자동 선택을 사용할 수 없습니다.
pl: Funkcja automatycznego wybierania została wyłączona z powodu deklaracji typu.
pt_br: Seleção automática desabilitada devido a declaração de tipo.
ru: Автовыбор отключен из-за объявления типа.
tr: Tür bildirimine göre devre dışı bırakılanı otomatik olarak seç.
zh_hans: 由于类型声明，自动选择被禁用。
zh_hant: 自動選取因類型宣告而停用。

source: Autoselect disabled due to possible deconstruction declaration.
cs: Automatický výběr je zakázaný kvůli možné deklaraci dekonstrukce.
de: Die automatische Auswahl wurde aufgrund einer möglichen Dekonstruktionsdeklaration deaktiviert.
es: Selección automática deshabilitada debido a una posible declaración de desconstrucción.
fr: Sélection automatique désactivée en raison d'une déclaration de déconstruction possible.
it: La selezione automatica è disabilitata a causa di una possibile dichiarazione di decostruzione.
ja: 分解宣言の可能性により、自動選択が無効になりました。
ko: 가능한 분해 선언으로 인하여 자동 선택 사용이 중지되었습니다.
pl: Automatyczne wybieranie jest wyłączone z powodu możliwej deklaracji dekonstrukcji.
pt_br: Seleção automática desabilitada devido a uma possível declaração de deconstrução.
ru: Автовыбор отключен из-за возможного присутствия объявления деконструирования.
tr: Otomatik seçim, olası ayrıştırma bildiriminden dolayı devre dışı bırakıldı.
zh_hans: 由于可能有析构声明，禁用了自动选择。
zh_hant: 因為可能的解構宣告，所以停用自動選取。

# Upgrade_this_project_to_csharp_language_version_0
source: Upgrade this project to C# language version '{0}'
cs: Upgradovat tento projekt na jazykovou verzi C# {0}
de: Upgrade für dieses Projekt auf C#-Sprachversion "{0}" durchführen
es: Actualizar este proyecto a la versión del lenguaje de C# "{0}"
fr: Mettre à niveau ce projet vers la version de langage C# '{0}'
it: Aggiorna questo progetto alla versione '{0}' del linguaggio C#
ja: このプロジェクトを C# 言語バージョン '{0}' にアップグレードする
ko: 이 프로젝트를 C# 언어 버전 '{0}'(으)로 업그레이드
pl: Uaktualnij ten projekt do wersji „{0}” języka C#
pt_br: Atualizar este projeto para versão de linguagem C# '{0}'
ru: Обновить этот проект C# до версии языка "{0}"
tr: Bu projeyi C# '{0}' dil sürümüne yükselt
zh_hans: 将该项目升级为 C# 语言版本“{0}”
zh_hant: 將此專案升級為 C# 語言版本 '{0}'

# Upgrade_all_csharp_projects_to_language_version_0
source: Upgrade all C# projects to language version '{0}'
cs: Upgradovat všechny projekty jazyka C# na jazykovou verzi {0}
de: Upgrade für alle C#-Projekte auf Sprachversion "{0}" durchführen
es: Actualizar todos los proyectos de C# a la versión del lenguaje "{0}"
fr: Mettre à niveau tous les projets C# vers la version de langage '{0}'
it: Aggiorna tutti i progetti alla versione '{0}' del linguaggio C#
ja: すべての C# プロジェクトを言語バージョン '{0}' にアップグレードする
ko: 모든 C# 프로젝트를 언어 버전 '{0}'(으)로 업그레이드
pl: Uaktualnij wszystkie projekty C# do wersji „{0}” języka
pt_br: Atualizar todos os projetos C# para a versão de linguagem '{0}'
ru: Обновить все проекты C# до версии языка "{0}"
tr: Tüm C# projelerini '{0}' dil sürümüne yükselt
zh_hans: 将所有 C# 项目升级为语言版本“{0}”
zh_hant: 將所有 C# 專案升級為語言版本 '{0}'

source: <class name>
cs: <název třídy>
de: <Klassenname>
es: <nombre de la clase>
fr: <nom de la classe>
it: <nome classe>
ja: <クラス名>
ko: <클래스 이름>
pl: <nazwa klasy>
pt_br: <nome da classe>
ru: <имя класса>
tr: < sınıf adı >
zh_hans: <类名>
zh_hant: <類別名稱>

source: <interface name>
cs: <název rozhraní>
de: <Schnittstellenname>
es: <nombre de la interfaz>
fr: <nom de l'interface>
it: <nome dell'interfaccia>
ja: <インターフェイス名>
ko: <인터페이스 이름>
pl: <nazwa interfejsu>
pt_br: <nome da interface>
ru: < имя интерфейса >
tr: < arabirim adı >
zh_hans: <接口名称>

source: <designation name>
cs: <název označení>
de: <Bezeichnungsname>
es: <nombre de designación>
fr: <nom de la désignation>
it: <nome designazione>
ja: <指定名>
ko: <지정명>
pl: <nazwa oznaczenia>
pt_br: <nome de designação>
ru: <имя обозначения>
tr: < atama adı >
zh_hans: <指定名称>
zh_hant: <指定名稱>

source: <struct name>
cs: <název struktury>
de: <Strukturname>
es: <nombre de estructura>
fr: <nom du struct>
it: <nome struct>
ja: <構造体名>
ko: <구조체 이름>
pl: <nazwa struktury>
pt_br: <nome do struct>
ru: <имя структуры>
tr: < yapı adı >
zh_hans: <结构名称>
zh_hant: <結構名稱>

source: Make method async
cs: Převést metodu na asynchronní
de: Methode als asynchron definieren
es: Convertir el método en asincrónico
fr: Rendre la méthode async
it: Rendi asincrono il metodo
ja: メソッドを非同期にします
ko: 메서드를 비동기로 설정
pl: Ustaw metodę jako asynchroniczną
pt_br: Tornar método assíncrono
ru: Преобразовать метод в асинхронный
tr: Metodu asenkron yap
zh_hans: 使方法异步
zh_hant: 讓方法非同步

# Make_method_async_remain_void
source: Make method async (stay void)
cs: Převést metodu na asynchronní (ponechat neplatné)
de: Methode als asynchron definieren ("void" beibehalten)
es: Convertir método en asincónico (permanecer nulo)
fr: Rendre la méthode asynchrone (rester void)
it: Rendi asincrono il metodo (lascia nullo)
ja: メソッドを非同期にする (void を維持)
ko: 메서드를 비동기로 설정(void 유지)
pl: Ustaw metodę jako asynchroniczną (pozostaw jako unieważnioną)
pt_br: Tornar o método assíncrono (permanecer nulo)
ru: Сделать метод асинхронным (оставить void)
tr: Metodu zaman uyumsuz yap (void olarak bırak)
zh_hans: 使方法异步(保持 void)
zh_hant: 讓方法不同步 (仍為 void)

source: Add 'this.'
cs: Přidejte položku this.
de: "this." hinzufügen
es: Agregar "this."
fr: Ajouter 'this.'
ko: this'를 추가합니다.
pl: Dodaj „this.”
pt_br: Adicionar 'isso.'
ru: Добавьте "this".
tr: this' ekleyin.
zh_hant: 新增 'this.'

source: <Name>
cs: <Název>
es: <nombre>
fr: <Nom>
it: <Nome>
ja: <名前>
ko: <이름>
pl: <Nazwa>
pt_br: <Nome>
ru: <Имя>
tr: < ad >
zh_hans: <名称>
zh_hant: <名稱>

source: Autoselect disabled due to member declaration
cs: Automatický výběr je zakázaný z důvodu deklarace člena.
de: Automatische Auswahl aufgrund einer Memberdeklaration deaktiviert
es: Selección automática deshabilitada debido a una declaración de miembro
fr: Sélection automatique désactivée en raison d'une déclaration de membre
it: La selezione automatica è disabilitata a causa della dichiarazione di membro
ja: メンバー宣言が原因で自動選択が無効になりました
ko: 멤버 선언으로 인해 자동 선택을 사용할 수 없습니다.
pl: Funkcja automatycznego wybierania została wyłączona z powodu deklaracji składowej
pt_br: Seleção automática desabilitada devido à declaração de membro
ru: Автовыбор отключен из-за объявления члена
tr: Üye bildirimi nedeniyle otomatik seçim devre dışı
zh_hans: 因成员声明已禁用自动选择
zh_hant: 因為成員宣告而已停用自動選取

source: (Suggested name)
cs: (Navržený název)
de: (Empfohlener Name)
es: (Nombre sugerido)
fr: (Nom suggéré)
it: (Nome consigliato)
ja: (推奨される名前)
ko: (제안된 이름)
pl: (Sugerowana nazwa)
pt_br: (Nome sugerido)
ru: (предложенное имя)
tr: (Önerilen ad)
zh_hans: (建议名称)
zh_hant: (建議的名稱)

source: Remove unused function
cs: Odebrat nepoužitou funkci
de: Nicht verwendete Funktion entfernen
es: Quitar función no utilizada
fr: Supprimer la fonction inutilisée
it: Rimuovi funzione non usata
ja: 使用されていない関数を削除します
ko: 사용하지 않는 함수 제거
pl: Usuń nieużywaną funkcję
pt_br: Remover função não utilizada
ru: Удалить неиспользуемую функцию
tr: Kullanılmayan işlevi kaldır
zh_hans: 删除未使用的函数
zh_hant: 移除未使用的函式

source: Use 'is null' check
cs: Použít kontrolu „is null“
de: "Ist NULL"-Prüfung verwenden
es: Usar comprobación "is null"
fr: Utiliser la vérification 'is null'
ko: is null' 검사 사용
pl: Użyj sprawdzania „is null”
pt_br: Usar verificação 'is null'
ru: Использовать флажок "is NULL"
tr: is null' denetimini kullan
zh_hant: 使用 'is null' 檢查

# Add_parentheses_around_conditional_expression_in_interpolated_string
source: Add parentheses
cs: Přidat závorky
de: Klammern hinzufügen
es: Agregar paréntesis
fr: Ajouter des parenthèses
it: Aggiungi parentesi
ja: 括弧を追加します
ko: 괄호 추가
pl: Dodaj nawiasy
pt_br: Adicionar parênteses
ru: Добавить скобки
tr: Parantez ekle
zh_hans: 添加括号
zh_hant: 新增括弧

source: Convert to 'foreach'
cs: Převést na foreach
de: In "foreach" konvertieren
es: Convertir a "foreach"
fr: Convertir en 'foreach'
it: Converti in 'foreach'
ja: 'foreach' に変換する
ko: 'foreach'로 변환
pl: Konwertuj na wyrażenie „foreach”
pt_br: Converter em 'foreach'
ru: Преобразовать в "foreach"
tr: 'foreach' deyimine dönüştür
zh_hans: 转换为“foreach”
zh_hant: 轉換為 'foreach'

source: Convert to 'for'
cs: Převést na for
de: In "for" konvertieren
es: Convertir a "for"
fr: Convertir en 'for'
it: Converti in 'for'
ja: 'for' に変換する
ko: 'for'로 변환
pl: Konwertuj na wyrażenie „for”
pt_br: Converter em 'for'
ru: Преобразовать в "for"
tr: 'for' deyimine dönüştür
zh_hans: 转换为“for”
zh_hant: 轉換為 'for'

source: Invert if
cs: Invertovat if
de: "If" umkehren
es: Invertir If
fr: Inverser si
it: Inverti if
ja: if を反転する
ko: if 반전
pl: Odwróć instrukcję if
pt_br: Inverter If
ru: Инвертировать оператор if
tr: if ifadesini tersine çevir
zh_hans: 反转 if
zh_hant: 反轉 if

source: Add [Obsolete]
cs: Přidat [Obsolete]
de: Hinzufügen [veraltet]
es: Agregar [obsoleto]
fr: Ajouter [obsolète]
it: Aggiungi [obsoleto]
ja: 追加 [廃止]
ko: [Obsolete] 추가
pl: Dodaj [przestarzałe]
pt_br: Adicionar [Obsolete]
ru: Добавить [устарело]
tr: Ekle [Eski]
zh_hans: 添加 [Obsolete]
zh_hant: 新增 [Obsolete]

source: Use '{0}'
cs: Použít {0}
de: "{0}" verwenden
es: Usar "{0}"
fr: Utiliser '{0}'
it: Usa '{0}'
ja: '{0}' を使用します
ko: '{0}' 사용
pl: Użyj elementu „{0}”
pt_br: Usar '{0}'
ru: Использовать "{0}"
tr: '{0}' kullan
zh_hans: 使用 "{0}"
zh_hant: 使用 '{0}'

source: Introduce 'using' statement
cs: Zavést příkaz using
de: "using"-Anweisung einführen
es: Introducir la instrucción "using"
fr: Introduire l’instruction 'using'
it: Introduci l'istruzione 'using'
ja: 'using' ステートメントを導入します
ko: 'using' 문 지정
pl: Wprowadź instrukcję „using”
pt_br: Introduzir a instrução 'using'
ru: Добавить инструкцию 'using'
tr: 'using' deyimi ekle
zh_hans: 引入 'using' 语句
zh_hant: 引進 'using’ 陳述式

source: Misplaced using directive
cs: Nesprávné umístění direktivy using
de: Die using-Anweisung wurde falsch platziert.
es: Directiva using mal colocada
fr: Directive using mal placée
ko: 위치가 잘못된 using 지시문
pl: Nieprawidłowo umieszczona dyrektywa using
pt_br: Diretiva using em local incorreto
ru: Неправильно расположенная директива using
tr: Yanlış yerleştirilmiş using yönergesi

source: Move misplaced using directives
cs: Přesunout nesprávně umístěné direktivy using
de: Falsch platzierte using-Anweisungen verschieben
es: Mover directivas using mal colocadas
fr: Déplacer les directives using mal placées
ko: 위치가 잘못된 using 지시문 이동
pl: Przenieś nieprawidłowo umieszczone dyrektywy using
pt_br: Mover diretivas using no local incorreto
ru: Переместить неправильно расположенные директивы using
tr: Yanlış yerleştirilmiş using yönergelerini taşı
