Repository: dotnet/roslyn
Catalog: src/Tools/dotnet-format/xlf/Resources.*.xlf
Languages: cs, fr, it, pl, pt_br, ru, tr

source: Both a MSBuild project file and solution file found in '{0}'. Specify which to use with the --workspace option.
cs: {0} obsahuje jak soubor projektu MSBuild, tak soubor řešení. Určete, který soubor chcete použít, pomocí parametru --workspace.
fr: Un fichier projet et un fichier solution MSBuild ont été trouvés dans '{0}'. Spécifiez celui à utiliser avec l'option --workspace.
it: In '{0}' sono stati trovati sia un file di progetto che un file di soluzione MSBuild. Per specificare quello desiderato, usare l'opzione --workspace.
pl: W elemencie „{0}” znaleziono zarówno plik rozwiązania, jak i plik projektu MSBuild. Określ plik do użycia za pomocą opcji --workspace.
pt_br: Foram encontrados um arquivo de solução e um arquivo de projeto MSBuild em '{0}'. Especifique qual usar com a opção --espaço de trabalho.
ru: В "{0}" обнаружены как файл проекта, так и файл решения MSBuild. Укажите используемый файл с помощью параметра --workspace.
tr: Hem bir MSBuild proje dosyası ve çözüm dosyası '{0}' içinde bulundu. Hangi--çalışma alanı seçeneği ile kullanmak için belirtin.

source: Could not find a MSBuild project file or solution file in '{0}'. Specify which to use with the --workspace option.
cs: V adresáři {0} nešlo najít soubor projektu MSBuild nebo soubor řešení. Určete, který soubor chcete použít, pomocí parametru --workspace.
fr: Fichier projet ou solution MSBuild introuvable dans '{0}'. Spécifiez celui à utiliser avec l'option --workspace.
it: In '{0}' non è stato possibile trovare alcun file di progetto o di soluzione MSBuild. Per specificare quello desiderato, usare l'opzione --workspace.
pl: Nie można znaleźć pliku rozwiązania lub projektu MSBuild w elemencie „{0}”. Określ plik do użycia za pomocą opcji --workspace.
pt_br: Não foi possível encontrar um arquivo de solução ou arquivo de projeto MSBuild em '{0}'. Especifique qual usar com a opção --espaço de trabalho.
ru: Не удалось найти файл проекта или решения MSBuild в "{0}". Укажите используемый файл с параметром --workspace.
tr: Bir MSBuild proje dosyası veya çözüm dosyası '{0}' içinde bulunamadı. Hangi--çalışma alanı seçeneği ile kullanmak için belirtin.

source: Could not format '{0}'. Format currently supports only C# and Visual Basic projects.
cs: {0} nejde formátovat. Formátovat jde v současné době jenom projekty v jazycích C# a Visual Basic.
fr: Impossible de mettre en forme '{0}'. L'opération Mettre en forme prend uniquement en charge les projets C# et Visual Basic pour le moment.
it: Non è stato possibile formattare '{0}'. Il formato supporta attualmente solo progetti C# e Visual Basic.
pl: Nie można sformatować elementu „{0}”. Obecnie format obsługuje tylko projekty C# i Visual Basic.
pt_br: Não foi possível formatar '{0}'. O formato atualmente suporta apenas projetos do Visual Basic e C#.
ru: Не удалось отформатировать "{0}". Форматирование сейчас поддерживается только для проектов C# и Visual Basic.
tr: '{0}' biçiminde değil. Biçimi şu anda yalnızca C# ve Visual Basic projeleri desteklemektedir.

source: Failed to save formatting changes.
cs: Nepodařilo se uložit změny formátování.
fr: L'enregistrement des changements de mise en forme a échoué.
it: Non è stato possibile salvare le modifiche di formattazione.
pl: Nie można zapisać zmian formatowania.
pt_br: Falha ao salvar alterações de formatação.
ru: Не удалось сохранить изменения форматирования.
tr: Biçimlendirme değişiklikleri kaydedilemedi.

source: Format complete.
cs: Formátování se dokončilo.
fr: Format complet.
it: Formattazione completata.
pl: Formatowanie zakończone.
pt_br: Formato completo.
ru: Форматирование завершено.
tr: Tam biçimlendirme.

source: Format files, but do not save changes to disk.
cs: Soubory se naformátují, ale změny se neuloží na disk.
fr: Mettez en forme les fichiers, mais n'enregistrez pas les changements sur le disque.
it: Formatta i file, ma non salvare le modifiche sul disco.
pl: Formatuj pliki, ale nie zapisuj zmian na dysku.
pt_br: Arquivos de formato, mas não salva as alterações para o disco.
ru: Форматировать файлы без сохранения изменений на диск.

source: Formatted {0} of {1} files in {2}ms.
cs: Naformátovali jsme {0} z {1} souborů za {2} ms.
fr: {0} fichiers sur {1} mis en forme en {2} ms.
it: Sono stati formattati {0} di {1} file in {2} ms.
pl: Sformatowano następującą liczbę plików: {0} z {1} w {2} ms.
pt_br: Formatado {0} de {1} arquivos em ms {2}.
ru: Отформатировано файлов: {0} из {1} за {2} мс.

source: Formatting code file '{0}'.
cs: Formátuje se soubor kódu {0}.
fr: Mise en forme du fichier de code '{0}'.
it: Formattazione del file di codice '{0}'.
pl: Formatowanie pliku kodu „{0}”.
pt_br: Arquivo de código de formatação '{0}'.
ru: Форматирование файла кода "{0}".
tr: Biçimlendirme kod dosyası '{0}'.

source: Formatting code files in project '{0}'.
cs: Formátují se soubory kódu v projektu {0}.
fr: Mise en forme des fichiers de code du projet '{0}'.
it: Formattazione del file di codice nel progetto '{0}'.
pl: Formatowanie plików kodu w projekcie „{0}”.
pt_br: Formatando arquivos de código no projeto '{0}'.
ru: Форматирование файлов кода в проекте "{0}".
tr: Proje '{0}' kod dosyalarında biçimlendirme.

source: Formatting code files in workspace '{0}'.
cs: Formátují se soubory kódu v pracovním prostoru {0}.
fr: Mise en forme des fichiers de code dans l'espace de travail '{0}'.
it: Formattazione del file di codice nell'area di lavoro '{0}'.
pl: Formatowanie plików kodu w obszarze roboczym „{0}”.
pt_br: Formatação de arquivos de código no espaço de trabalho '{0}'.
ru: Форматирование кода файлов в рабочей области "{0}".
tr: Çalışma alanı '{0}' kod dosyalarında biçimlendirme.

source: Loading workspace.
cs: Načítá se pracovní prostor.
fr: Chargement de l'espace de travail.
it: Caricamento dell'area di lavoro.
pl: Ładowanie obszaru roboczego.
pt_br: Carregando espaço de trabalho.
ru: Загрузка рабочей области.
tr: Çalışma alanı yükleniyor.

source: Maximum number of workspace warnings to log has been reached. Set the --verbosity option to the 'diagnostic' level to see all warnings.
cs: Dosáhlo se maximálního počtu upozornění pracovního prostoru, který se dá protokolovat. Pokud chcete zobrazit všechna upozornění, nastavte parametr --verbosity na úroveň diagnostic.
fr: Le nombre maximal d'avertissements d'espace de travail à journaliser a été atteint. Définissez l'option --verbosity sur le niveau 'diagnostic' pour voir les avertissements.
it: È stato raggiunto il numero massimo di avvisi da registrare per l'area di lavoro. Per visualizzare tutti gli avvisi, impostare l'opzione --verbosity sul livello 'diagnostic'.
pl: Osiągnięto maksymalną liczbę ostrzeżeń obszaru roboczego do zarejestrowania. Ustaw opcję --verbosity na poziom „diagnostic”, aby zobaczyć wszystkie ostrzeżenia.
pt_br: Foi atingido o número máximo de avisos do workspace a serem registrados em log. Defina a opção --verbosity para o nível 'diagnostic' para ver todos os avisos.
ru: Достигнуто максимальное количество предупреждений рабочей области, которые могут быть записаны в журнал. Чтобы просмотреть все предупреждения, установите параметр --verbosity.

source: Multiple MSBuild project files found in '{0}'. Specify which to use with the --workspace option.
cs: {0} obsahuje více souborů projektů MSBuild. Určete, který soubor chcete použít, pomocí parametru --workspace.
fr: Plusieurs fichiers projet MSBuild dans '{0}'. Spécifiez celui à utiliser avec l'option --workspace.
it: In '{0}' sono stati trovati più file di progetto MSBuild. Per specificare quello desiderato, usare l'opzione --workspace.
pl: W elemencie „{0}” znaleziono wiele plików projektów MSBuild. Określ, którego użyć, za pomocą opcji --workspace.
pt_br: Foram encontrados vários arquivos do projeto MSBuild em '{0}'. Especifique qual usar com a opção --espaço de trabalho.
ru: В "{0}" обнаружено несколько файлов проектов MSBuild. Укажите используемый файл с помощью параметра --workspace.
tr: Birden fazla MSBuild proje dosyası '{0}' içinde bulundu. Hangi--çalışma alanı seçeneği ile kullanmak için belirtin.

source: Multiple MSBuild solution files found in '{0}'. Specify which to use with the --workspace option.
cs: {0} obsahuje více souborů řešení MSBuild. Určete, který soubor chcete použít, pomocí parametru --workspace.
fr: Plusieurs fichiers solution MSBuild dans '{0}'. Spécifiez ceux à utiliser avec l'option --workspace.
it: In '{0}' sono stati trovati più file di soluzione MSBuild. Per specificare quello desiderato, usare l'opzione --workspace.
pl: W elemencie „{0}” znaleziono wiele plików rozwiązań MSBuild. Określ plik do użycia za pomocą opcji --workspace.
pt_br: Foram encontrados vários arquivos de solução MSBuild em '{0}'. Especifique qual usar com a opção --espaço de trabalho.
ru: В "{0}" обнаружено несколько файлов решений MSBuild. Укажите используемый файл с параметром --workspace.
tr: Birden fazla MSBuild çözüm dosyası '{0}' içinde bulundu. Hangi--çalışma alanı seçeneği ile kullanmak için belirtin.

source: Set the verbosity level. Allowed values are q[uiet], m[inimal], n[ormal], d[etailed], and diag[nostic]
cs: Nastavte úroveň podrobností. Povolené hodnoty jsou: q[uiet], m[inimal], n[ormal], d[etailed] a diag[nostic]
fr: Définissez le niveau de détail. Les valeurs autorisées sont q[uiet], m[inimal], n[ormal], d[etailed] et diag[nostic]
it: Consente di impostare il livello di dettaglio. I valori consentiti sono q[uiet], m[inimal], n[ormal], d[etailed] e diag[nostic]
pl: Ustaw poziom szczegółowości. Dozwolone wartości to q[uiet] (cicha), m[inimal] (minimalna), n[ormal] (normalna), d[etailed] (szczegółowa) i diag[nostic] (diagnostyczna)
pt_br: Defina o nível de detalhes. Os valores permitidos são q[uiet], m[inimal], n[ormal], d[etailed], e diag[nostic]
ru: Задает уровень детализации. Допустимые значения: q (без вывода подробных сведений), m (минимальный), n (нормальный), d (подробный) и diag (диагностика)
tr: Ayrıntı düzeyini ayarlayın. İzin verilen değerler şunlardır: q [uiet], [inimal] m, n [nizamî], d [ayrıntılı] ve diag [nostic]

source: Skipping referenced project '{0}'.
cs: Přeskočí se odkazovaný projekt {0}.
fr: Saut du projet référencé '{0}'.
it: Il progetto di riferimento '{0}' verrà ignorato.
pl: Pomijanie przywoływanego projektu „{0}”.
pt_br: Ignorando o projeto referenciado '{0}'.
ru: Пропуск указанного проекта "{0}".
tr: Atlama projesi '{0}' başvuru.

source: The file '{0}' does not appear to be a valid project or solution file.
cs: Soubor {0} zřejmě není platný soubor projektu nebo řešení.
fr: Le fichier '{0}' ne semble pas être un fichier projet ou solution valide.
it: Il file '{0}' non sembra essere un file di progetto o di soluzione valido.
pl: Plik „{0}” prawdopodobnie nie jest prawidłowym plikiem projektu lub rozwiązania.
pt_br: O arquivo '{0}' parece não ser um projeto válido ou o arquivo de solução.
ru: Файл "{0}" не является допустимым файлом проекта или решения.
tr: '{0}' dosyası geçerli proje veya çözüm dosyası gibi görünmüyor.

source: The project file '{0}' does not exist.
cs: Soubor projektu {0} neexistuje.
fr: Le fichier projet '{0}' n'existe pas.
it: Il file di progetto '{0}' non esiste.
pl: Plik projektu „{0}” nie istnieje.
pt_br: O arquivo de projeto '{0}' não existe.
ru: Файл проекта "{0}" не существует.
tr: Proje dosyası '{0}' yok.

source: The solution file '{0}' does not exist.
cs: Soubor řešení {0} neexistuje.
fr: Le fichier solution '{0}' n'existe pas.
it: Il file di soluzione '{0}' non esiste.
pl: Plik rozwiązania „{0}” nie istnieje.
pt_br: O arquivo de solução '{0}' não existe.
ru: Файл решения "{0}" не существует.
tr: Çözüm dosyası '{0}' yok.

source: The solution or project file to operate on. If a file is not specified, the command will search the current directory for one.
cs: Soubor řešení nebo projektu, se kterým se má operace provést. Pokud soubor není zadaný, příkaz ho bude hledat v aktuálním adresáři.
fr: Fichier solution ou projet à utiliser. Si un fichier n'est pas spécifié, la commande en recherche un dans le répertoire actuel.
it: File di progetto o di soluzione su cui intervenire. Se non si specifica un file, il comando ne cercherà uno nella directory corrente.
pl: Plik rozwiązania lub projektu, względem którego operacja ma być wykonana. Jeśli plik nie zostanie określony, polecenie wyszuka go w bieżącym katalogu.
pt_br: O arquivo de projeto ou solução para operar. Se um arquivo não for especificado, o comando pesquisará o diretório atual para um.
ru: Файл решения или проекта. Если файл не указан, команда будет искать этот файл в текущем каталоге.
tr: Ameliyat için çözüm ya da proje dosyasını. Bir dosya belirtilmezse, komut için bir geçerli dizini arar.

source: Unable to load workspace.
cs: Pracovní prostor nejde načíst.
fr: Impossible de charger l'espace de travail.
it: Non è possibile caricare l'area di lavoro.
pl: Nie można załadować obszaru roboczego.
pt_br: Não é possível carregar o espaço de trabalho.
ru: Не удается загрузить рабочую область.
tr: Çalışma alanı yüklenemedi.

source: Workspace loaded in {0}ms.
cs: Pracovní prostor se načetl za {0} ms.
fr: Espace de travail chargé en {0} ms.
it: Area di lavoro caricata in {0} ms.
pl: Obszar roboczy załadowano w {0} ms.
pt_br: Espaço de trabalho carregado em {0}ms.
ru: Рабочая область загружена за {0} мс.
tr: Çalışma alanı {0} ms yüklü.
