Repository: dotnet/roslyn
Catalog: src/VisualStudio/VisualBasic/Impl/xlf/BasicVSResources.*.xlf
Languages: de, es, ja, ru, zh_hans

source: Add missing imports on paste
de: Beim Einfügen fehlende import-Anweisungen hinzufügen
es: Agregar las importaciones que faltan al pegar
ja: 貼り付け時に欠落している imports を追加する
ru: Добавить недостающие директивы import при вставке

# In_relational_binary_operators
source: In relational operators: = <> < > <= >= Like Is
de: In relationalen Operatoren: = <> < > <= >= Like Is
es: En los operadores relacionales: = <> < > <= >= Like Is
ja: 関係演算子: = <> < > <= >= Like Is
ru: В реляционных операторах: = <> < > <= >= Like Is
zh_hans: 在关系运算符中: = <> < > <= >= Like Is

# Insert_apostrophe_at_the_start_of_new_lines_when_writing_apostrophe_comments
source: Insert ' at the start of new lines when writing ' comments
de: Fügen Sie beim Schreiben von '-Kommentaren ein Apostroph (') am Anfang der neuen Zeilen ein.
es: Insertar ' al comienzo de las líneas nuevas al escribir comentarios '
ja: ' コメントの記述時に ' を新しい行の先頭に挿入する
ru: Вставлять "'" в начале новых строк при написании комментариев "'"

source: Insert Snippet
de: Schnipsel einfügen
es: Insertar fragmento de código
ja: スニペットの挿入
ru: Вставить фрагмент
zh_hans: 插入片段

source: Automatic _insertion of Interface and MustOverride members
de: Automatisches _Einfügen von Schnittstellen- und MustOverride-Membern
es: I_nserción automática de miembros Interface y MustOverride
ja: インターフェイスと MustOverride メンバーの自動挿入(_I)
ru: Автоматическая в_ставка членов Interface и MustOverride
zh_hans: 自动插入 Interface 和 MustOverride 成员(_I)

source: Never
de: Nie
es: Nunca
ja: 行わない
ru: Никогда
zh_hans: 从不

source: Prefer 'IsNot' expression
de: Ausdruck "IsNot" bevorzugen
es: Anteponer expresión "IsNot"
ja: 'IsNot' 式を優先する
ru: Предпочтительно использовать выражение IsNot

source: Prefer 'Is Nothing' for reference equality checks
de: "Is Nothing" für Verweisübereinstimmungsprüfungen vorziehen
es: Preferir “Is Nothing” para comprobaciones de igualdad de referencias
ja: 参照の等値性のチェックには 'Is Nothing' を優先する
ru: Предпочитать Is Nothing для проверок равенства ссылок
zh_hans: 引用相等检查偏好 “Is Nothing”

source: Prefer simplified object creation
de: Vereinfachte Objekterstellung bevorzugen
es: Preferir la creación de objetos simplificados
ja: 簡素化されたオブジェクト作成を優先
ru: Предпочтение упрощенному созданию объектов

source: Remove unnecessary Imports
de: Unnötige Import-Direktiven entfernen
es: Quitar instrucciones Import innecesarias

source: Show hints for 'New' expressions
de: Hinweise für new-Ausdrücke anzeigen
es: Mostrar sugerencias para las expresiones "new"
ja: 'New' 式のヒントを表示する
ru: Отображать подсказки для выражений "New"

source: Show items from unimported namespaces
de: Elemente aus nicht importierten Namespaces anzeigen
es: Mostrar elementos de espacios de nombres no importados
ja: インポートされていない名前空間の項目を表示する
ru: Отображать элементы из неимпортированных пространств имен

source: _Show procedure line separators
de: _Zeilentrennzeichen in Prozeduren anzeigen
es: Mo_strar separadores de líneas de procedimientos
ja: プロシージャ行の区切り記号を表示する(_S)
ru: _Показывать разделительные линии процедур
zh_hans: 显示过程行分隔符(_S)

source: _Don't put ByRef on custom structure
de: _ByRef nicht für benutzerdefinierte Struktur verwenden
es: _No poner ByRef en una estructura personalizada
ja: カスタム構造に ByRef を置かない(_D)
ru: _Не помещать ByRef в пользовательскую структуру
zh_hans: 请勿将 ByRef 放在自定义结构中(_D)

source: Editor Help
de: Editor-Hilfe
es: Ayuda de editor
ja: エディターのヘルプ
ru: Справка по редактору
zh_hans: 编辑器帮助

source: A_utomatic insertion of end constructs
de: end-Konstrukte _automatisch einfügen
es: Inserción a_utomática de construcciones end
ja: 構造文の終端の自動挿入(_U)
ru: А_втоматическая вставка конечной конструкции
zh_hans: 自动插入 end 构造(_U)

source: Highlight related _keywords under cursor
de: Verwandte _Schlüsselbegriffe unter Cursor anzeigen
es: Resaltar palabras cla_ve relacionadas bajo el cursor
ja: カーソルの下にあるキーワードの関連キーワードをハイライトする(_K)
ru: Выделить связанные _ключевые слова под курсором
zh_hans: 突出显示光标下相关的关键字(_K)

source: _Highlight references to symbol under cursor
de: _Verweise auf Symbol unter Cursor hervorheben
es: _Resaltar referencias al símbolo bajo el cursor
ja: カーソルの下にあるシンボルへの参照をハイライトする(_H)
ru: _Выделить ссылки на символ под курсором
zh_hans: 突出显示对光标下符号的引用(_H)

source: _Pretty listing (reformatting) of code
de: _Automatische Strukturierung und Einrückung des Programmcodes
es: _Lista descriptiva (nuevo formato) de código
ja: コードの再フォーマット(_P)
ru: Ав_томатическое форматирование кода
zh_hans: 整齐排列代码(重新格式化)(_P)

source: _Enter outlining mode when files open
de: _Gliederungsmodus beim Öffnen von Dateien starten
es: _Especificar el modo de esquematización al abrir los archivos
ja: ファイルが開かれたときにアウトライン モードを実行する(_E)
ru: _Включать режим создания структуры при открытии файлов
zh_hans: 打开文件时进入大纲模式(_E)

source: Extract Method
de: Methode extrahieren
es: Extraer método
ja: メソッドの抽出
ru: Извлечение метода
zh_hans: 提取方法

source: _Generate XML documentation comments for '''
de: _XML-Dokumentationskommentare generieren für '''
es: _Generar comentarios de documentación XML con '''
ja: ''' が入力されたときに XML ドキュメント コメントを生成する(_G)
ru: _Создавать комментарии XML-документации для '''
zh_hans: 为 ''' 生成 XML 文档注释(_G)

source: Highlighting
de: Hervorheben
es: Resaltar
ja: 強調表示
ru: Выделение
zh_hans: 突出显示

source: Optimize for solution size
de: Für Lösungsgröße optimieren
es: Optimizar para tamaño de la solución
ja: ソリューションのサイズを最適化します
ru: Оптимизировать под размер решения
zh_hans: 优化解决方案大小

source: Large
de: Groß
es: Grande
ja: 大
ru: Большой
zh_hans: 大

source: Regular
de: Regulär
es: Normal
ja: 標準
ru: обычный
zh_hans: 常规

source: Show remarks in Quick Info
de: Hinweise in QuickInfo anzeigen
es: Mostrar comentarios en Información rápida
ja: クイック ヒントに注釈を表示する
ru: Показать заметки в кратких сведениях

source: Small
de: Klein
es: Pequeño
ja: 小
ru: Малый
zh_hans: 小

source: Performance
de: Leistung
es: Rendimiento
ja: パフォーマンス
ru: Производительность
zh_hans: 性能

source: Show preview for rename _tracking
de: Vorschau für Nachverfolgung beim _Umbenennen anzeigen
es: Mostrar vista previa para _seguimiento de cambio de nombre
ja: 名前変更追跡のプレビューの表示(_T)
ru: Показывать предпросмотр для _отслеживания переименований
zh_hans: 显示重命名跟踪的预览(_T)

source: _Navigate to Object Browser for symbols defined in metadata
de: Für i_n Metadaten definierte Symbole zum Objektkatalog navigieren
es: _Vaya al Examinador de objetos para obtener los símbolos definidos en los metadatos
ja: メタデータで定義されている記号のオブジェクト ブラウザーに移動する(_N)
ru: _Перейти в обозреватель объектов для символов, определенных в метаданных
zh_hans: 导航到对象浏览器以了解元数据中定义的符号(_N)

source: Go to Definition
de: Gehe zu Definition
es: Ir a definición
ja: 定義へ移動
ru: Перейти к определению
zh_hans: 转到定义

source: Import Directives
de: Import-Direktiven
es: Directivas de importación
ja: ディレクティブをインポートする
ru: Директивы Import
zh_hans: Import 指令

source: Sort imports
de: Importe sortieren
es: Ordenar instrucciones Import

source: Suggest imports for types in _NuGet packages
de: Import-Direktiven für Typen in _NuGet-Paketen vorschlagen
es: Sugerir importaciones para tipos de paquetes _NuGet
ja: NuGet パッケージの型に import を提案する(_N)
ru: Предлагать import для типов в _пакетах NuGet
zh_hans: 建议对 NuGet 包中的类型使用 import(_N)

source: Suggest imports for types in _reference assemblies
de: Import-Direktiven für Typen in _Verweisassemblys vorschlagen
es: Sugerir importaciones para tipos de ensamblados de r_eferencia
ja: 参照アセンブリの型に import を提案する(_R)
ru: Предлагать import для типов в _эталонных сборках
zh_hans: 建议对引用程序集中的类型使用 import(_R)

source: _Place 'System' directives first when sorting imports
de: System-Anweisungen beim Sortieren von import-Anweisungen an erster Stelle _platzieren
es: _Poner directivas del sistema en primer lugar cuando se ordenen las importaciones
ja: import の並び替えのとき、最初に 'System' ディレクティブを配置する(_P)
ru: _Размещать директивы import с "System" в начале при сортировке
zh_hans: 对导入进行排序时将 "System" 指令排在第一位(_P)

source: Qualify event access with 'Me'
de: Ereigniszugriff mit "Me" qualifizieren
es: Calificar el acceso a eventos con 'Me'
ja: イベントのアクセスを 'Me' で修飾する
ru: Квалифицировать доступ к событиям через "Me"
zh_hans: 使用 "Me" 限定事件访问的资格

source: Qualify field access with 'Me'
de: Feldzugriff mit "Me" qualifizieren
es: Calificar el acceso a campos con 'Me'
ja: フィールドのアクセスを 'Me' で修飾する
ru: Квалифицировать доступ к полям через "Me"
zh_hans: 使用 "Me" 限定字段访问的资格

source: Qualify method access with 'Me'
de: Methodenzugriff mit "Me" qualifizieren
es: Calificar el acceso a métodos con 'Me'
ja: メソッドのアクセスを 'Me' で修飾する
ru: Квалифицировать доступ к методам через "Me"
zh_hans: 使用 "Me" 限定方法访问的资格

source: Qualify property access with 'Me'
de: Eigenschaftenzugriff mit "Me" qualifizieren
es: Calificar el acceso a propiedades con 'Me'
ja: プロパティのアクセスを 'Me' で修飾する
ru: Квалифицировать доступ к свойствам через "Me"
zh_hans: 使用 "Me" 限定属性访问的资格

source: Do not prefer 'Me.'
de: "me" nicht bevorzugen
es: No preferir 'Me.'
ja: Me.' を優先しない
ru: Не предпочитать "Me."
zh_hans: 请勿首选 "Me."

source: Prefer 'Me.'
de: "me" bevorzugen
es: Preferir 'Me.'
ja: Me.' を優先する
ru: Предпочитать "Me."
zh_hans: 首选 "Me."

# Me_preferences_colon
source: 'Me.' preferences:
de: 'me.-Einstellungen:
es: 'Preferencias de "Me.":
ja: 'Me.' 設定:
ru: 'Предпочтения "Me.":
zh_hans: '“Me.”首选项:

# Predefined_type_preferences_colon
source: Predefined type preferences:
de: Vordefinierte Typeinstellungen:
es: Preferencias de tipos predefinidos:
ja: 定義済みの型の設定:
ru: Предпочтения для предопределенных типов:
zh_hans: 预定义类型首选项:

source: _Highlight matching portions of completion list items
de: _Übereinstimmende Teile der Vervollständigungslistenelemente anzeigen
es: _Resaltar partes coincidentes de elementos de lista de finalización
ja: 入力候補一覧の項目の一致している部分を強調表示する(_H)
ru: _Выделять совпадающие части элементов списка завершения
zh_hans: 突出显示完成列表项的匹配部分(_H)

source: Show completion item _filters
de: Vervollständigungselement_filter anzeigen
es: Mostrar _filtros de elementos de finalización
ja: 入力候補の項目フィルターを表示する(_F)
ru: Показывать фильтр_ы элементов завершения
zh_hans: 显示完成项筛选器(_F)

source: Completion Lists
de: Vervollständigungslisten
es: Listas de finalización
ja: 入力候補一覧
ru: Списки завершения
zh_hans: 完成列表

# Enter_key_behavior_colon
source: Enter key behavior:
de: Verhalten der EINGABETASTE:
es: Comportamiento de la tecla Entrar:
ja: Enter キー入力時動作:
ru: Поведение при нажатии клавиши ВВОД:
zh_hans: 输入关键行为:

source: _Only add new line on enter after end of fully typed word
de: Neue _Zeile beim Drücken der EINGABETASTE nur nach einem vollständig eingegebenen Wort einfügen
es: _Agregar solo una nueva línea con Entrar al final de palabras
ja: 単語を完全に入力した後 Enter キーで新しい行のみを追加する(_O)
ru: До_бавлять новую строку при нажатии клавиши ВВОД только в конце полностью введенного слова
zh_hans: _只有在完整键入的单词结尾后按下回车键时才添加新行

source: _Always add new line on enter
de: _Immer neue Zeile beim Drücken der EINGABETASTE einfügen
es: _Agregar siempre una nueva línea al presionar Entrar
ja: Enter キーで常に新しい行を追加する(_A)
ru: _Всегда добавлять символ новой строки при нажатии клавиши ВВОД
zh_hans: 按下 Enter 时始终添加新行(_A)

source: _Never add new line on enter
de: _Nie neue Zeile beim Drücken der EINGABETASTE einfügen
es: _No agregar nunca una nueva línea al presionar Entrar
ja: Enter キーで新しい行を追加しない(_N)
ru: _Никогда не добавлять новую строку при нажатии клавиши ВВОД
zh_hans: 按下 Enter 时不添加新行(_N)

source: Always include snippets
de: Schnipsel immer einschließen
es: Incluir siempre fragmentos de código
ja: 常にスニペットを含める
zh_hans: 始终包含片段

source: Include snippets when ?-Tab is typed after an identifier
de: Schnipsel einschließen, wenn ?-TAB nach einem Bezeichner eingegeben wird
es: Incluir fragmentos de código cuando ?-Tab se escriba después de un identificador
ja: 識別子の後に ? Tab を入力したときにスニペットを含める
zh_hans: 在标识符后键入 ?-Tab 时包含片段

source: Never include snippets
de: Schnipsel nie einschließen
es: No incluir nunca fragmentos de código
ja: スニペットを含めない
zh_hans: 从不包含片段

source: Snippets behavior
de: Schnipselverhalten
es: Comportamiento de los fragmentos de código
ja: スニペットの動作
ru: Поведение фрагментов кода
zh_hans: 片段行为

source: Show completion list after a character is _deleted
de: Vervollstän_digungsliste nach Löschen eines Zeichens anzeigen
es: Mostrar lista de finalización después de _eliminar un carácter
ja: 文字が削除された後に入力候補一覧を表示する(_D)
ru: Показывать список завершения после удалени_я знака
zh_hans: 删除字符后显示完成列表(_D)

source: _Show completion list after a character is typed
de: _Vervoll­ständigungsliste nach Eingabe eines Zeichens anzeigen
es: _Mostrar lista de finalización después de escribir un carácter
ja: 文字が入力された後に入力候補一覧を表示する(_S)
ru: _Показывать список завершения после ввода знака
zh_hans: 键入字符后显示完成列表(_S)

source: Unused local
de: Nicht verwendete lokale Variable
es: Local sin uso
ja: 未使用のローカル
ru: Не использовать локальный аргумент
zh_hans: 未使用的本地

source: VB Coding Conventions
de: VB-Codierungskonvention
zh_hans: vb 编码约定

# nothing_checking_colon
source: 'nothing' checking:
de: 'Überprüfung auf "nothing":
es: 'Comprobación de "nothing":
ja: 'nothing' のチェック中:
ru: 'Проверка значений "nothing":
zh_hans: '"nothing" 检查:

source: Fade out unused imports
de: Nicht verwendete Importe ausblenden
es: Atenuar importaciones no utilizadas
ja: 未使用のインポートをフェードアウトします
ru: Скрывать неиспользуемые импорты
zh_hans: 淡出未使用的导入

# Report_invalid_placeholders_in_string_dot_format_calls
source: Report invalid placeholders in 'String.Format' calls
de: Ungültige Platzhalter in String.Format-Aufrufen melden
es: Informar sobre marcadores de posición no válidos en llamadas a "String.Format"
ja: String.Format' の呼び出しで無効なプレース ホルダーをレポートします
ru: Сообщать о недопустимых заполнителях в вызовах "String.Format"
zh_hans: 报告 "String.Format" 调用中无效的占位符

source: Separate import directive groups
de: Import-Anweisungsgruppen trennen
es: Separar grupos de directivas import
ja: インポート ディレクティブのグループを分離します
ru: Разделять группы директив import
zh_hans: 单独的导入指令组

# In_arithmetic_binary_operators
source: In arithmetic operators: ^ * / \ Mod + - & << >>
de: In arithmetischen Operatoren: ^ * / \ Mod + - & << >>
es: En operadores aritméticos: ^ * / \ Mod + - & << >>
ja: 算術演算子: ^ * / \ Mod + - & << >>
ru: В арифметических операторах: ^ * / \ Mod + - & << >>
zh_hans: 在算术运算符中: ^ * / \ Mod + - & << >>

# In_other_binary_operators
source: In other binary operators: And AndAlso Or OrElse
de: In anderen binären Operatoren: And AndAlso Or OrElse
es: En otros operadores binarios: Y AndAlso o OrElse
ja: その他の 2 項演算子内で: And AndAlso Or OrElse
ru: В других бинарных операторах: And AndAlso Or OrElse
zh_hans: 在其他二进制运算符中: And AndAlso Or OrElse

source: Collapse Imports on file open
es: Contraer importaciones al abrir archivos
ja: ファイルを開くときにインポートを折りたたむ
ru: Сворачивать директивы import импорта при открытии файлов

source: Remove unnecessary imports
ja: 不要なインポートの削除
ru: Удалить ненужные операции импорта

source: _Move local declaration to the extracted method if it is not used elsewhere
zh_hans: 如果提取的方法未用于他处，则将局部声明移至提取的方法(_M)

# Show_items_from_unimported_namespaces
source: Show items from unimported namespaces (experimental)
zh_hans: 显示 unimported 命名空间中的项(实验)
