Repository: dotnet/roslyn
Catalog: src/VisualStudio/VisualBasic/Impl/xlf/VSPackage.*.xlf
Languages: es, fr, ja, pl, pt_br, ru, zh_hans, zh_hant

source: Underline reassigned variables; Display inline hints; Show diagnostics for closed files; Colorize regular expression; Highlight related components under cursor; Report invalid regular expressions; Enable full solution analysis; Perform editor feature analysis in external process; Enable navigation to decompiled sources; Always use default symbol servers for navigation; Import directives; Place System directives first when sorting imports; Separate import directive groups; Suggest imports for types in reference assemblies; Suggest imports for types in NuGet packages; Highlighting; Highlight references to symbol under cursor; Highlight related keywords under cursor; Outlining; Enter outlining mode when files open; Collapse #regions on file open; Collapse Imports on file open; Collapse metadata implementations on file open; Show procedure line separators; Show outlining for declaration level constructs; Show outlining for code level constructs; Show outlining for comments and preprocessor regions; Collapse regions when collapsing to definitions; Fading; Fade out unused imports; Fade out unused members; Block Structure Guides; Show guides for declaration level constructs; Show guides for code level constructs; Editor Help; Generate XML documentation comments for '''; Insert ' at the start of new lines when writing ' comments; Show preview for rename tracking; Report invalid placeholders in string.Format calls; Extract Method; Implement Interface or Abstract Class; When inserting properties, events and methods, place them; with other members of the same kind; at the end; When generating property; prefer throwing properties; prefer auto properties; regex; regular expression; Colorize regular expressions; Highlight related components under cursor; Report invalid regular expressions; JSON; Colorize JSON strings; Report invalid JSON strings; Detect and offer editor features for JSON strings; Use enhanced colors; Editor Color Scheme; Inheritance Margin;
es: Subrayar variables reasignadas; Mostrar sugerencias insertadas; Mostrar diagnóstico para archivos cerrados; Colorear expresión regular; Resaltar los componentes relacionados bajo el cursor; Informar de las expresiones regulares no válidas; Habilitar análisis de la solución completa; Realizar el análisis de características del editor en proceso externo; Habilitar la navegación a orígenes descompilados; Usar siempre servidores de símbolo predeterminados para la navegación; Importar directivas; Colocar las directivas del sistema en primer lugar cuando se ordenen las importaciones; Separar grupos de directivas de importación; Sugerir importaciones para tipos de ensamblados de referencia; Sugerir importaciones para tipos de paquetes NuGet; Resaltar; Resaltar referencias al símbolo bajo el cursor; Resaltar palabras clave relacionadas bajo el cursor; Esquema; Especificar el modo de esquematización al abrir los archivos; Contraer #regions al abrir los archivos; Contraer importaciones al abrir los archivos; Contraer implementaciones de metadatos al abrir los archivos; Mostrar separadores de líneas de procedimientos; Mostrar esquematización para construcciones a nivel de declaración; Mostrar esquematización para construcciones a nivel de código; Mostrar esquematización para regiones de preprocesador y comentarios; Contraer regiones cuando se contraigan las definiciones; Atenuación; Atenuar importaciones no utilizadas; Atenuar miembros no usados; Guías de estructura de bloques; Mostrar guías para construcciones a nivel de declaración; Mostrar guías para construcciones a nivel de código; Ayuda del editor; Generar comentarios de documentación XML para '''; Insertar ' al comienzo de las nuevas líneas al escribir comentarios '; Mostrar vista previa para el seguimiento de cambio de nombre; Informar sobre marcadores de posición no válidos en llamadas a string.Format; Extraer método; Implementar interfaz o clase abstracta; Al insertar propiedades, eventos y métodos, colóquelos; con otros miembros de la misma clase; al final; Al generar una propiedad; preferir propiedades de lanzamiento; preferir propiedades automáticas; regex; expresión regular; Colorear las expresiones regulares; Resaltar los componentes relacionados bajo el cursor; Informar de las expresiones regulares no válidas; JSON; Colorear las cadenas JSON; Informar de las cadenas JSON no válidas; Detectar y ofrecer funciones del editor para las cadenas JSON; Utilizar colores mejorados; Esquema de colores del editor; Margen de herencia;
fr: Souligner les variables réaffectées ; Afficher les astuces inline ; Afficher les diagnostics pour les fichiers fermés ; Coloriser les expressions régulières ; Mettre en surbrillance les composants associés sous le curseur ; Signaler les expressions régulières non valides ; Activer l’analyse complète de la solution ; Effectuer l’analyse des fonctionnalités de l’éditeur dans le processus externe ; Activer la navigation vers les sources décompilées ; Toujours utiliser les serveurs de symboles par défaut pour la navigation ; Importer des directives ; Placer les directives System en première position lors du tri des importations ; Séparer les groupes de directives d’importation ; Suggérer des importations pour les types dans les assembly de référence ; Suggérer des importations pour les types dans les packages NuGet ; Mettre en évidence ; Mettre en évidence les références au symbole sous le curseur ; Mettre en évidence les mots-clés associés sous le curseur ; Contournement ; Entrer en mode de contournement lorsque les fichiers sont ouverts ; Réduire les #regions à l’ouverture du fichier ; Réduire les importations à l’ouverture du fichier ; Réduire les implémentations de métadonnées à l’ouverture du fichier ; Afficher les séparateurs de lignes de procédure ; Afficher le contour pour les constructions au niveau de la déclaration ; Afficher le contour pour les constructions au niveau du code ; Afficher le contour pour les commentaires et les régions du préprocesseur ; Réduire les régions lors de la réduction vers les définitions ; Fermeture en fondu ; Fermer en fondu les importations inutilisées ; Fermer en fondu les membres inutilisés ; Guides de structure de bloc ; Afficher les guides pour les constructions au niveau de la déclaration ; Afficher les guides pour les constructions au niveau du code ; Aide avec l’éditeur ; Générer des commentaires de documentation XML pour ’’’ ; Insérer ’ au début des nouvelles lignes lors de l’écriture de commentaires ’ ; Afficher l’aperçu pour le suivi des opérations de renommage ; Signaler des caractères de remplacement non valides dans les appels string.Format ; Méthode d’extraction ; Implémenter l’interface ou la classe abstraite ; Lorsque vous insérez des propriétés, des événements et des méthodes, placez-les ; avec d’autres membres du même type ; à la fin ; En générant la propriété ; privilégiez les propriétés qui lèvent des exceptions ; privilégiez les propriétés automatiques ; regex ; Expression régulière ; Coloriser les expressions régulières ; Mettre en surbrillance les composants associés sous le curseur ; Signaler les expressions régulières non valides ; JSON ; Coloriser les chaînes JSON ; Signaler les chaînes JSON non valides ; Détecter et proposer des fonctionnalités d’éditeur pour les chaînes JSON ; Utiliser des couleurs améliorées ; Schéma de couleurs de l’éditeur ; Marge d’héritage ;
ja: 再割り当てされた変数に下線を引く; インラインのヒントを表示する; 閉じているファイルの診断結果を表示する; 正規表現をカラー化する; カーソルの下の関連コンポーネントの強調表示; 無効な正規表現の報告; 完全ソリューション解析を有効にする; 外部プロセスでエディター機能解析を実行する; 逆コンパイルされたソースへのナビゲーションを有効にする; ナビゲーションには常に既定のシンボル サーバーを使用する; Import ディレクティブ; Imports の並び替えのとき、最初に System ディレクティブを配置する; Import ディレクティブのグループを分離します; 参照アセンブリの型に imports を提案する; NuGet パッケージの型に imports を提案する; 強調表示; カーソルの下にあるシンボルへの参照を強調表示する; カーソルの下にある関連キーワードを強調表示する; アウトライン表示; ファイルを開くときにアウトライン モードを入力する; ファイルを開くときに #regionsを折りたたむ; ファイルを開くときに imports を折りたたむ; ファイルを開くときにメタデータを折りたたむ; プロシージャ行の区切り記号を表示する; 宣言レベルのコンストラクトのアウトラインを表示する; コード レベルのコンストラクトのアウトラインを表示する; コメントとプリプロセッサ リージョンのアウトラインを表示する; 定義を折りたたむときにリージョンを折りたたむ; フェード中; 未使用の imports をフェードアウトする; 未使用のメンバーをフェードアウトする; ブロック構造のガイド; 宣言レベルのコンストラクトのガイドを表示する; コード レベルのコンストラクトのガイドを表示する; エディターのヘルプ; ''' の XML ドキュメント コメントを生成する; ' コメントを記述する際、新しい行の先頭に ' を挿入する; 名前変更追跡のプレビューを表示する; string.Format の呼び出しで無効なプレースホルダーをレポートする; メソッドを抽出する; インターフェイスまたは抽象クラスを実装する; プロパティ、イベント、メソッドを挿入する際には、次の場所に挿入する; 同じ種類の他のメンバーと共に; 末尾に; プロパティの生成時; スロー プロパティを優先する; 自動プロパティを優先する; 正規表現; 正規表現; 正規表現の色付け; カーソルの下の関連コンポーネントの強調表示; 無効な正規表現の報告; JSON; JSON 文字列の色付け; 無効な JSON 文字列の報告; JSON 文字列のエディター機能の検出と提供; 拡張された色を使用する; エディターの配色; 継承余白;
pl: Podkreślaj ponownie przypisane zmienne; Wyświetlaj wskazówki w tekście; Pokaż dane diagnostyczne dla zamkniętych plików; Koloruj wyrażenie regularne; Wyróżniaj powiązane składniki pod kursorem; Zgłaszaj nieprawidłowe wyrażenia regularne; Włącz pełną analizę rozwiązania; Wykonaj analizę funkcji edytora w procesie zewnętrznym; Włącz nawigowanie do dekompilowanych źródeł; Zawsze używaj domyślnych serwerów symboli na potrzeby nawigowania; Importuj dyrektywy; Umieść najpierw dyrektywy „System” podczas sortowania dyrektyw import; Oddziel grupy dyrektywy import; Sugeruj dyrektywy import dla typów w zestawach referencyjnych; Sugeruj dyrektywy import dla typów w pakietach NuGet; Wyróżnianie; Wyróżnij odwołania do symbolu pod kursorem; Wyróżnij pokrewne słowa kluczowe pod kursorem; Tworzenie konspektu; Przejdź do trybu konspektu przy otwieraniu pliku; Zwijaj #regions przy otwieraniu pliku; Zwiń importy przy otwieraniu pliku; Zwijaj implementacje metadanych przy otwieraniu pliku; Pokaż separatory wierszy procedur; Pokaż konspekt dla konstrukcji na poziomie deklaracji; Pokaż konspekt dla konstrukcji na poziomie kodu; okaż konspekt dla regionów komentarzy i preprocesora; Zwiń regiony podczas zwijania do definicji; Zanikanie; Przyciemniaj nieużywane dyrektywy import; Przyciemniaj nieużywane składowe; Przewodniki po strukturze bloku; Pokaż prowadnice dla konstrukcji na poziomie deklaracji; Pokaż prowadnice dla konstrukcji na poziomie kodu; Pomoc edytora; Generuj komentarze dokumentacji XML dla elementów ///; Wstaw znak * na początku nowych wierszy podczas pisania komentarzy typu /* */; Pokaż podgląd śledzenia zmian nazw; Zgłaszaj nieprawidłowe symbole zastępcze w ciągu.Formatuj komórki; Metoda wyodrębniania; Implementuj interfejs lub klasę abstrakcyjną; W przypadku wstawiania właściwości, zdarzeń i metod umieszczaj je razem; z innymi składowymi tego samego rodzaju; na końcu; Podczas generowania właściwości; preferuj zgłaszanie właściwości; preferuj właściwości automatyczne; wyrażenie regularne; wyrażenie regularne; Koloruj wyrażenia regularne; Wyróżniaj powiązane składniki pod kursorem; Zgłaszaj nieprawidłowe wyrażenia regularne; JSON; Koloruj ciągi JSON; Zgłaszaj nieprawidłowe ciągi JSON; Wykrywaj i oferuj funkcje edytowania dla ciągów JSON; Używaj rozszerzonych kolorów; Schemat kolorów edytora; Margines dziedziczenia;
zh_hans: 为重新分配的变量添加下划线; 显示内联提示; 显示已关闭文件的诊断; 对正则表达式着色; 突出显示游标下的相关组件; 报告无效的正则表达式; 启用完整解决方案分析; 在外部进程中执行编辑器功能分析; 对反编译的源启用导航; 始终使用默认符号服务器进行导航; Import 指令; 对导入进行排序时将 "System" 指令排在第一位; 单独的导入指令组; 建议对引用程序集中的类型使用 import; 建议对 NuGet 包中的类型使用 import; 突出显示; 突出显示对游标下符号的引用; 突出显示游标下的相关关键字; 概述; 在文件打开时进入大纲模式; 文件打开时折叠#regions; 打开文件时折叠导入; 文件打开时折叠元数据实现; 显示过程行分隔符; 显示声明级别构造的大纲; 显示代码级别构造的大纲; 显示注释和预处理器区域的大纲; 在折叠到定义时折叠区域; 淡出; 淡出未使用的导入; 淡出未使用的成员; 块结构指南; 显示声明级别构造的指南; 显示代码级别构造的指南; 编辑器帮助; 为 ''' 生成 XML 文档注释; 在写入 ' 注释时在新行开头插入 '; 显示重命名跟踪的预览;在按 Enter 时拆分字符串字面量; 报告 string.Format 调用中的无效占位符; 提取方法; 不要在自定义结构上放置 ref 或 out; 插入属性、事件和方法时，放置它们; 位于末尾; 具有相同种类的其他成员; 在生成属性时; 首选引发属性; 首选自动属性; regex; 正则表达式; 对正则表达式着色; 突出显示游标下的相关组件; 报告无效的正则表达式; JSON; 对 JSON 字符串着色; 报告无效的 JSON 字符串; 为 JSON 字符串检测并提供编辑器功能; 使用增强颜色; 编辑器配色方案; 继承边距;

source: An empty Visual Basic script file.
zh_hant: 空白的 Visual Basic 指令碼檔。

source: Visual Basic Script
zh_hant: Visual Basic 指令碼
