Repository: dotnet/roslyn
Catalog: src/VisualStudio/VisualBasic/Impl/xlf/VSPackage.*.xlf
Languages: es, fr, ja, pl, pt_br, ru, zh_hans, zh_hant

source: Visual Basic Editor with Encoding
es: Editor de Visual Basic con Encoding
fr: Visual Basic Editor avec encodage
ja: エンコード付き Visual Basic エディター
pl: Edytor Visual Basic z kodowaniem
pt_br: Editor do Visual Basic com Codificação
ru: Редактор Visual Basic с кодировкой
zh_hans: 带编码功能的 Visual Basic 编辑器
zh_hant: 具備編碼功能的 Visual Basic 編輯器

source: Visual Basic Editor
es: Editor de Visual Basic
ja: Visual Basic エディター
pl: Edytor Visual Basic
pt_br: Editor do Visual Basic
ru: Редактор Visual Basic
zh_hans: Visual Basic 编辑器
zh_hant: Visual Basic 編輯器

source: Underline reassigned variables;Display inline hints;Automatic insertion of end constructs;Change pretty listing settings;Change outlining mode;Automatic insertion of Interface and MustOverride members;Show or hide procedure line separators;Turn error correction suggestions on or off;Turn highlighting of references and keywords on or off; Regex; regular expressions; related components under cursor; Report invalid regular expressions; regex; regular expression; JSON; Colorize JSON strings; Report invalid JSON strings; Detect and offer editor features for JSON strings; Collapse #regions on file open; Collapse Imports on file open; Collapse metadata implementations on file open; Use enhanced colors;Editor Color Scheme;Inheritance Margin;Import Directives;
pt_br: Sublinhar variáveis reatribuídas;Exibir dicas incorporadas;Inserção automática de construtores finais;Alterar as configurações de reformatação automática;Alterar o modo de estrutura de tópicos;Inserção automática de interface e membros MustOverride;Mostrar ou ocultar separadores de linha de procedimento;Ativar ou desativar as sugestões de correção de erros;Ativar ou desativar o realce de referências e palavras-chave; Regex; expressões regulares; componentes relacionados sob o cursor; Notificar expressões regulares inválidas; regex; expressões regulares; JSON; Colorizar cadeias de caracteres JSON; Notificar cadeias de caracteres JSON inválidas; Detectar e oferecer recursos de editor para cadeia de caracteres JSON; Recolher #regions do arquivo aberto; Recolher inportações do arquivo aberto; Recolher implementações de metadados do arquivo aberto; Usar cores aprimoradas;Esquema de Cores do Editor;Margem de Herança;Importar Diretivas;
ru: Подчеркивать переназначенные переменные;Показывать встроенные подсказки;Автоматическая вставка конечных конструкций;Изменять параметры автоматического форматирования;Изменять режим структуры;Автоматическая вставка интерфейса и элементов MustOverride;Показывать или скрывать разделители строк для процедуры;Включить или отключить предложения по исправлению ошибок;Включить или отключить выделение ссылок и ключевых слов; Регулярные выражения; регулярные выражения; связанные компоненты под курсором; Сообщать о недопустимых регулярных выражениях; регулярное выражение; регулярное выражение; JSON; Выделить строки JSON цветом; Сообщить о недопустимых строках JSON; Найти и предложить функции редактора для строк JSON; Сворачивать #regions при открытии файлов; Сворачивать директивы import при открытии файлов; Сворачивать реализации метаданных при открытии файлов; Использовать расширенный набор цветов;Цветовая схема редактора;Поле наследования;Директивы import;

source: Advanced
es: Opciones avanzadas
fr: Avancé
ja: 詳細
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительный
zh_hans: 高级
zh_hant: 進階

source: Basic
fr: De base
ja: 基本
pl: Podstawowe
pt_br: Básico
ru: Обычный
zh_hans: 基本
zh_hant: 基本

source: Basic Editor
es: Editor de Basic
fr: Éditeur de base
ja: 基本エディター
pl: Edytor podstawowy
pt_br: Editor Básico
ru: Редактор Basic
zh_hans: Basic 编辑器
zh_hant: Basic 編輯器

source: Options that control general editor features including Intellisense statement completion, line number display, and single-click URL navigation.
es: Opciones que controlan las funcionalidades generales del editor entre las que se incluyen finalización de instrucciones de IntelliSense, visualización del número de líneas y navegación a direcciones URL con un sólo clic.
fr: Options qui contrôlent les fonctionnalités générales de l'éditeur, y compris la saisie semi-automatique d'instructions Intellisense, l'affichage des numéros de ligne et la navigation dans les URL par simple clic.
ja: Intellisense 入力候補、行番号の表示、シングル クリックでの URL ナビゲーションなどの全般的なエディター機能を設定するオプションです。
pl: Opcje obsługujące podstawowe funkcje edycji, takie jak uzupełnianie instrukcji za pomocą funkcji Intellisense, wyświetlanie numerów wierszy i nawigacja URL przy użyciu jednego kliknięcia.
pt_br: Opções que controlam recursos gerais do editor, como preenchimento de instruções Intellisense, exibição do número de linhas e navegação de URL com um clique.
ru: Параметры, которые управляют общими компонентами редактора, включая завершение операторов Intellisense, отображение номера строки и навигацию по URL-адресам одним нажатием.
zh_hans: 用于控制常规编辑器功能(包括 Intellisense 语句结束、行号显示和单击 URL 导航)的选项。
zh_hant: 控制一般編輯器功能的選項，包括 IntelliSense 陳述式完成、顯示行號，以及按一下方式的 URL 巡覽。

source: Options that control Visual Basic editor features including automatic insertion of end constructs, procedure line separators, and automatic code formatting.
es: Opciones que controlan las funcionalidades del editor de Visual Basic entre las que se incluyen la inserción automática de construcciones End, separadores de línea de procedimientos y formato de código automático.
fr: Options qui contrôlent les fonctionnalités de base de Visual Basic Editor, y compris l'insertion de constructions de fin, les séparateurs de ligne de procédure et la mise en forme automatique du code.
ja: 構造文の終端の自動挿入、プロシージャ行の区切り記号、自動コード書式設定などの Visual Basic エディター機能を設定するオプションです。
pl: Opcje obsługujące funkcje edycji w programie Visual Basic, takie jak wstawianie konstrukcji końcowych, separatory wierszy procedury i automatyczne formatowanie kodu.
pt_br: Opções que controlam recursos do editor do Visual Basic, como inserção automática de construtores end, separadores de linhas de procedimento e formatação de código automática.
ru: Параметры, которые управляют компонентами редактора Visual Basic, включая автоматическую вставку конечных структур, разделители строк для процедуры и автоматическое форматирование кода.
zh_hans: 用于控制 Visual Basic 编辑器功能(包括自动插入 End 构造、过程行分隔符和自动设置代码格式)的选项。
zh_hant: 控制 Visual Basic 編輯器功能的選項，包括自動插入 End 建構、程序行分隔符號，以及自動格式化程式碼。

source: Optimizes the environment so you can focus on building world-class applications. This collection of settings contains customizations to the window layout, command menus and keyboard shortcuts to make common Visual Basic commands more accessible.
es: Optimiza el entorno para permitirle centrarse en la creación de aplicaciones de primer nivel. Esta colección de valores contiene personalizaciones del diseño de ventanas, los menús de comandos y los métodos abreviados de teclado para hacer más accesibles los comandos de Visual Basic.
fr: Optimisez l'environnement afin que vous puissiez vous concentrer sur la création d'applications de haut niveau. Cet ensemble de paramètres contient des personnalisations de la disposition des fenêtres, des menus de commandes et des raccourcis clavier pour rendre les commandes Visual Basic courantes plus accessibles.
ja: ユーザーが国際的レベルのアプリケーションの開発に取り組めるように、環境を最適化します。この設定には、ウィンドウのレイアウトやコマンド メニューのカスタマイズ、および Visual Basic の共通コマンドを利用しやすくするキーボードのショートカットのカスタマイズが含まれます。
pl: Optymalizuje środowisko, dzięki czemu możesz się skupić na tworzeniu światowej klasy aplikacji. Ta kolekcja ustawień zawiera dostosowania układu okna, menu poleceń i skrótów klawiaturowych zapewniające łatwiejszy dostęp do często używanych poleceń języka Visual Basic.
pt_br: Otimiza o ambiente para que você possa se concentrar na criação de aplicativos de classe mundial. Esta coleção de configurações contém personalizações para o layout da janela, menus de comandos e atalhos de teclado para tornar os comandos comuns do Visual Basic mais acessíveis.
ru: Оптимизирует окружение, чтобы вы могли сосредоточиться на создании приложений мирового класса. Эта коллекция параметров содержит пользовательские настройки макета окна, меню команд и сочетания клавиш и создана для того, чтобы сделать более доступными стандартные команды Visual Basic.
zh_hans: 优化环境，使您可以集中精力生成一流的应用程序。此设置集合包含对窗口布局、命令菜单和键盘快捷键的自定义，使得对常用 Visual Basic 命令的访问更加容易。
zh_hant: 將環境最佳化，讓您可以專注於建置世界級的應用程式。此設定集合包含視窗配置、命令功能表和鍵盤快速鍵的自訂，能更容易存取常用的 Visual Basic 命令。

source: Code Style
es: Estilo de código
fr: Style de code
ja: コード スタイル
pl: Styl kodu
pt_br: Estilo do Código
ru: Стиль кода
zh_hans: 代码样式
zh_hant: 程式碼樣式

source: Qualify with Me;Prefer intrinsic types;Style;Code Style
es: Calificar con Me;Tipos intrínsecos Prefer;Estilo;Estilo de código
fr: Qualifier avec Me;Préférer les types intrinsèques;Style;Style de code
ja: Me で修飾;組み込み型を推奨;スタイル;コード スタイル
pl: Kwalifikuj w powiązaniu ze mną;Preferuj typy wewnętrzne;Styl;Styl kodu
pt_br: Qualificar com Me;Preferir tipos intrínsecos;Estilo;Estilo do Código
ru: Квалифицировать с помощью Me;Предпочитать внутренние типы;Стиль;Стиль кода
zh_hans: 使用"Me"限定权限;首选内部类型;样式;代码样式
zh_hant: 符合我的資格;優先使用內建類型;樣式;程式碼樣式

source: Naming
es: Nomenclatura
fr: Nommage
ja: 名前付け
pl: Nazewnictwo
pt_br: Nomenclatura
ru: Именование
zh_hans: 命名
zh_hant: 命名

source: Naming Style;Name Styles;Naming Rule;Naming Conventions
es: Estilo de nomenclatura;Estilos de nombre;Regla de nomenclatura;Convenciones de nomenclatura
fr: Style de nommage;Styles de nom;Règle de nommage;Conventions de nommage
ja: 名前付けのスタイル;名前のスタイル;名前付けルール;名前付けの規則
pl: Styl nazewnictwa;Style nazw;Reguła nazewnictwa;Konwencje nazewnictwa
pt_br: Estilo de Nomenclatura;Estilos de Nome;Regra de Nomenclatura;Convenções de Nomenclatura
ru: Стиль именования;стили имен;правило именования;соглашения об именовании
zh_hans: 命名样式;名称样式;命名规则;命名约定
zh_hant: 命名樣式;命名樣式;命名規則;命名慣例

source: General
fr: Général
ja: 全般
pl: Ogólne
pt_br: Geral
ru: Общее
zh_hans: 常规
zh_hant: 一般

source: Change completion list settings;Pre-select most recently used member
pt_br: Alterar as configurações de lista de conclusão;pre-selecionar membro usado recentemente
ru: Изменение параметров списка завершения; Предварительный выбор наиболее часто используемого члена
zh_hant: 變更完成清單設定;預先選取最近使用的成員

source: Visual Basic components used in the IDE. Depending on your project type and settings, a different version of the compiler may be used.
es: Los componentes de Visual Basic utilizados en el IDE. En función del tipo de proyecto y la configuración, se podría utilizar una versión diferente del compilador.
fr: Composants Visual Basic utilisés dans l'IDE. Selon votre type de projet et vos paramètres, une version différente du compilateur peut être utilisée.
ja: IDE で使用する Visual Basic コンポーネント。プロジェクトの種類や設定に応じて、異なるバージョンのコンパイラを使用できます。
pl: Składniki języka Visual Basic używane w środowisku IDE. Zależnie od typu projektu i jego ustawień może być używana inna wersja kompilatora.
pt_br: Componentes do Visual Basic usados no IDE. Dependendo do seu tipo de projeto e configurações, uma versão diferente do compilador poderá ser usada.
ru: Компоненты Visual Basic, используемые в интегрированной среде разработки. В зависимости от типа и настроек проекта могут использоваться различные версии компилятора.
zh_hans: IDE 中使用的 Visual Basic 组件。可能使用其他版本的编译器，具体取决于你的项目类型和设置。
zh_hant: 在 IDE 中使用的 Visual Basic 元件。根據您的專案類型與設定，可能會使用其他版本的編譯器。

source: Visual Basic Tools
es: Herramientas de Visual Basic
fr: Outils Visual Basic
ja: Visual Basic ツール
pl: Narzędzia języka Visual Basic
pt_br: Ferramentas do Visual Basic
ru: Инструменты Visual Basic
zh_hans: Visual Basic 工具
zh_hant: Visual Basic 工具

source: Always add new line on enter
es: Siempre agregar una nueva línea al pulsar Intro
fr: Toujours ajouter une nouvelle ligne en appuyant sur Entrée
ja: Enter を押すと常に新しい行を追加します
pl: Zawsze dodawaj nowy wiersz po naciśnięciu klawisza Enter
pt_br: Sempre adicionar uma nova linha ao pressionar enter
zh_hans: 始终在按下 Enter 时添加新行

source: Always include snippets
es: Incluir siempre fragmentos de código
fr: Toujours inclure les extraits de code
ja: 常にスニペットを含める
pl: Zawsze dołączaj fragmenty kodu
pt_br: Sempre incluir snippets
zh_hans: 始终包含片段

source: Include snippets when ?-Tab is typed after an identifier
es: Incluir fragmentos de código cuando ?-Tab se escriba después de un identificador
fr: Inclure les extraits de code quand ?-Tab est typé après un identificateur
ja: 識別子の後に ? Tab を入力したときにスニペットを含める
pl: Dołącz fragmenty kodu po wpisaniu znaku ? po identyfikatorze i naciśnięciu klawisza Tab
pt_br: Incluir snippets quando ?-Tab for digitado após um identificador
zh_hans: 在标识符后键入 ?-Tab 时包含片段

source: Never add new line on enter
es: Nunca agregar una nueva línea al pulsar Intro
fr: Ne jamais ajouter de nouvelle ligne en appuyant sur Entrée
ja: Enter 時に新しい行を追加しません
pl: Nigdy nie dodawaj nowego wiersza po naciśnięciu klawisza Enter
pt_br: Nunca adicionar uma nova linha ao entrar
zh_hans: 永远不要在点击回车后添加新行

source: Never include snippets
es: No incluir nunca fragmentos de código
fr: Ne jamais inclure d'extrait de code
ja: スニペットを含めない
pl: Nigdy nie dołączaj fragmentów kodu
pt_br: Nunca incluir snippets
zh_hans: 从不包含片段

source: Only add new line on enter after end of fully typed word
es: Solo agregar una nueva línea al pulsar Intro cuando se haya terminado de escribir completamente una palabra
fr: Ajouter une nouvelle ligne en appuyant sur Entrée seulement après la fin d'un mot entièrement tapé
ja: 単語を完全に入力した後 Enter キーで新しい行のみを追加する
pl: Dodaj nowy wiersz tylko po naciśnięciu klawisza Enter na końcu w pełni wpisanego wyrazu
pt_br: Somente adiciona uma nova linha após digitar toda palavra
zh_hans: 只在键入完整的单词后点击回车后才添加新行
