Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# round_trip_date_time_description
source: The "O" or "o" standard format specifier represents a custom date and time format string using a pattern that preserves time zone information and emits a result string that complies with ISO 8601. For DateTime values, this format specifier is designed to preserve date and time values along with the DateTime.Kind property in text. The formatted string can be parsed back by using the DateTime.Parse(String, IFormatProvider, DateTimeStyles) or DateTime.ParseExact method if the styles parameter is set to DateTimeStyles.RoundtripKind. The "O" or "o" standard format specifier corresponds to the "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" custom format string for DateTime values and to the "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" custom format string for DateTimeOffset values. In this string, the pairs of single quotation marks that delimit individual characters, such as the hyphens, the colons, and the letter "T", indicate that the individual character is a literal that cannot be changed. The apostrophes do not appear in the output string. The "O" or "o" standard format specifier (and the "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" custom format string) takes advantage of the three ways that ISO 8601 represents time zone information to preserve the Kind property of DateTime values: The time zone component of DateTimeKind.Local date and time values is an offset from UTC (for example, +01:00, -07:00). All DateTimeOffset values are also represented in this format. The time zone component of DateTimeKind.Utc date and time values uses "Z" (which stands for zero offset) to represent UTC. DateTimeKind.Unspecified date and time values have no time zone information. Because the "O" or "o" standard format specifier conforms to an international standard, the formatting or parsing operation that uses the specifier always uses the invariant culture and the Gregorian calendar. Strings that are passed to the Parse, TryParse, ParseExact, and TryParseExact methods of DateTime and DateTimeOffset can be parsed by using the "O" or "o" format specifier if they are in one of these formats. In the case of DateTime objects, the parsing overload that you call should also include a styles parameter with a value of DateTimeStyles.RoundtripKind. Note that if you call a parsing method with the custom format string that corresponds to the "O" or "o" format specifier, you won't get the same results as "O" or "o". This is because parsing methods that use a custom format string can't parse the string representation of date and time values that lack a time zone component or use "Z" to indicate UTC.
cs: Specifikátory standardního formátu O nebo o představují řetězec vlastního formátu data a času, který používá vzor, který zachovává informaci o časovém pásmu a generuje výsledný řetězec podle standardu ISO 8601. Pro hodnoty DateTime je tento specifikátor formátu navržený tak, aby v textu zachoval hodnoty data a času spolu s vlastností DateTime.Kind. Pokud se parametr styles nastaví na DateTimeStyles.RoundtripKind, formátovaný řetězec se dá parsovat zpět pomocí metod DateTime.Parse(String, IFormatProvider, DateTimeStyles) nebo DateTime.ParseExact. Specifikátory standardního formátu O nebo o odpovídají řetězci vlastního formátu yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK pro hodnoty DateTime a řetězci vlastního formátu yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz pro hodnoty DateTimeOffset. V tomto řetězci dvojice jednoduchých uvozovek, které oddělují jednotlivé znaky (třeba spojovníky, dvojtečky a písmeno T), označují, že jednotlivé znaky jsou literály a nedají se změnit. Apostrofy se ve výstupním řetězci nezobrazují. Specifikátory vlastního formátu O nebo o (a řetězec vlastního formátu yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK) využívá tři způsoby, kterými standard ISO 8601 reprezentuje informace o časovém pásmu, aby se zachovala vlastnost Kind hodnot DateTime: Složka časového pásma hodnot data a času DateTimeKind.Local je posun oproti UTC (například +01:00, -07:00). V tomto formátu se reprezentují všechny hodnoty DateTimeOffset. Složka časového pásma hodnot data a času DateTimeKind.Utc používá Z (což znamená nulový (zero) posun), pomocí kterého představuje čas UTC. Hodnoty data a času DateTimeKind.Unspecified nemají žádnou informaci o časovém pásmu. Vzhledem k tomu, že specifikátory standardního formátu O nebo o dodržují mezinárodní standard, operace formátování nebo parsování, která daný specifikátor používá, vždy používá invariantní jazykovou verzi a Gregoriánský kalendář. Řetězce, které se předávají metodám Parse, TryParse, ParseExact a TryParseExact typů DateTime a DateTimeOffset, se dají pomocí specifikátoru formátu O nebo o parsovat v případě, že mají jeden z těchto formátů. V případě objektů DateTime by přetížení parsování, které zavoláte, mělo navíc zahrnovat parametr styles s hodnotou DateTimeStyles.RoundtripKind. Poznámka: Pokud metodu parsování zavoláte s řetězcem vlastního formátu, který odpovídá specifikátoru formátu O nebo o, nedostanete výsledky shodné s O nebo o. Důvodem je to, že metody parsování, které používají řetězec vlastního formátu, nemůžou parsovat řetězcové reprezentace hodnot data a času, kterým chybí složka časového pásma nebo které označují UTC pomocí Z.
de: Der Standardformatbezeichner "O" oder "o" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge mit Verwendung eines Musters, das die Zeitzoneninformationen beibehält und eine Ergebniszeichenfolge ausgibt, die ISO 8601 entspricht. Für DateTime-Werte ist dieser Formatbezeichner so ausgelegt, dass Datums- und Uhrzeitwerte zusammen mit der DateTime.Kind-Eigenschaft im Text erhalten bleiben. Die formatierte Zeichenfolge kann mit der Methode "DateTime.Parse(String, IFormatProvider, DateTimeStyles)" oder mit der DateTime.ParseExact-Methode rückanalysiert werden, wenn der styles-Parameter auf "DateTimeStyles.RoundtripKind" festgelegt ist. Der Standardformatbezeichner "O" oder "o" entspricht der benutzerdefinierten Formatzeichenfolge "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" für DateTime-Werte und der benutzerdefinierten Formatzeichenfolge "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" für DateTimeOffset-Werte. In dieser Zeichenfolge weisen die Paare einfacher Anführungszeichen zum Abgrenzen einzelner Zeichen – beispielsweise Bindestriche, Doppelpunkte und der Buchstabe "T" – darauf hin, dass es sich bei dem einzelnen Zeichen um ein Literal handelt, das nicht geändert werden kann. Die Apostrophe werden in der Ausgabezeichenfolge nicht angezeigt. Der Standardformatbezeichner "O" oder "o" (und die benutzerdefinierte Formatzeichenfolge "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK") nutzt die drei Möglichkeiten von ISO 8601 zur Darstellung von Zeitzoneninformationen, um die Kind-Eigenschaft der DateTime-Werte beizubehalten: Die Zeitzonenkomponente von Datums- und Uhrzeitwerten von DateTimeKind.Local ist die UTC-Abweichung (z. B. +01:00, -07:00). Alle DateTimeOffset-Werte werden ebenfalls in diesem Format dargestellt. Die Zeitzonenkomponente von Datums- und Uhrzeitwerten von DateTimeKind.Utc verwenden "Z" (entspricht der Abweichung 0), um UTC darzustellen. Datums- und Uhrzeitwerte von DateTimeKind.Unspecified umfassen keine Zeitzoneninformationen. Da der Standardformatbezeichner "O" oder "o" einem internationalen Standard entspricht, werden bei der Formatierung oder Analyse mit diesem Bezeichner immer die invariante Kultur und der gregorianische Kalender verwendet. Zeichenfolgen zur Übergabe an die Parse-, TryParse-, ParseExact- und TryParseExact-Methoden von DateTime und DateTimeOffset können mithilfe der Formatbezeichner "O" oder "o" analysiert werden, wenn sie in einem dieser Formate vorliegen. Im Fall von DateTime-Objekten sollte die aufgerufene Analyseüberladung außerdem einen styles-Parameter mit dem Wert "DateTimeStyles.RoundtripKind" enthalten. Beachten Sie, dass Sie nicht die gleichen Ergebnisse wie für "O" oder "o" erhalten, wenn Sie eine Analysemethode mit der benutzerdefinierten Formatzeichenfolge aufrufen, die dem Formatbezeichner "O" oder "o" entspricht. Dafür gibt es folgenden Grund: Analysemethoden, die eine Zeichenfolge mit benutzerdefiniertem Format verwenden, können die Zeichenfolgendarstellung von Datums- und Uhrzeitwerten nicht analysieren, denen die Zeitzonenkomponente fehlt oder die "Z" zur Angabe von UTC verwenden.
es: El especificador de formato estándar "O" o bien "o" representa una cadena de formato de fecha y hora personalizado con un patrón que conserva la información de la zona horaria y emite una cadena de resultado que se ajusta a la norma ISO 8601. Para valores de fecha y hora, este especificador de formato está diseñado para conservar los valores de fecha y hora junto con la propiedad DateTime.Kind en el texto. La cadena con formato se puede analizar de nuevo con el método DateTime.Parse (String, IFormatProvider, DateTimeStyles) o DateTime.ParseExact si el parámetro Styles se establece en DateTimeStyles.RoundtripKind. El especificador de formato estándar "O" o bien "o" se corresponde con la cadena de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" para valores de DateTime y con la cadena de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" para valores de DateTimeOffset. En esta cadena, los pares de comillas simples que delimitan los caracteres individuales, como los guiones, los dos puntos y la letra "T", indican que el carácter individual es un literal que no se puede cambiar. Los apóstrofos no aparecen en la cadena de salida. El especificador de formato estándar "O" o bien "o" (y la cadena de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" aprovecha las tres formas en que ISO 8601 representa la información de la zona horaria para conservar la propiedad Kind de los valores de DateTime: El componente de zona horaria de los valores de fecha y hora de DateTimeKind.Local tiene una diferencia respecto a la hora UTC (por ejemplo, +01:00,-07:00). Todos los valores de DateTimeOffset también se representan con este formato. El componente de zona horaria de los valores de fecha y hora de DateTimeKind.Utc utilizan "Z" (que significa que la diferencia es cero) para representar la hora UTC. Los valores de fecha y hora de DateTimeKind.Unspecified no tienen información de zona horaria. Dado que el especificador de formato estándar "O" o bien "o" se ajusta a un estándar internacional, la operación de formato o análisis que usa el especificador siempre utiliza la referencia cultural invariable y el calendario gregoriano. Las cadenas que se pasan a los métodos Parse, TryParse, ParseExact y TryParseExact de DateTime y DateTimeOffset se pueden analizar usando el especificador de formato "O" o bien "o" si se encuentran en uno de estos formatos. En el caso de los objetos DateTime, la sobrecarga de análisis a la que llama debe incluir también un parámetro Styles con un valor de DateTimeStyles.RoundtripKind. Tenga en cuenta que si se llama a un método de análisis con la cadena de formato personalizada que corresponde al especificador de formato "O" o bien "o", no se obtendrán los mismos resultados que "O" o bien "o". Esto se debe a que los métodos de análisis que usan una cadena de formato personalizado no pueden analizar la representación de cadena de valores de fecha y hora que carecen de un componente de zona horaria o utilizan "Z" para indicar la hora UTC.
fr: Le spécificateur de format standard "O" ou "o" représente une chaîne de format de date et d'heure personnalisée à l'aide d'un modèle qui conserve les informations de fuseau horaire et émet une chaîne de résultat conforme à la norme ISO 8601. Pour les valeurs DateTime, ce spécificateur de format permet de conserver les valeurs de date et d'heure ainsi que la propriété DateTime.Kind au format texte. La chaîne à laquelle le format a été appliqué peut être réanalysée à l'aide de la méthode DateTime.Parse(String, IFormatProvider, DateTimeStyles) ou DateTime.ParseExact si le paramètre styles a la valeur DateTimeStyles.RoundtripKind. Le spécificateur de format standard "O" ou "o" correspond à la chaîne de format personnalisée "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" pour les valeurs DateTime, et à la chaîne de format personnalisée "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" pour les valeurs DateTimeOffset. Dans cette chaîne, les paires de guillemets simples qui délimitent les caractères individuels, par exemple les tirets, les deux-points et la lettre "T", indiquent que le caractère individuel est un littéral qui ne peut pas être changé. Les apostrophes n'apparaissent pas dans la chaîne de sortie. Le spécificateur de format standard "O" ou "o" (avec la chaîne de format personnalisée "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK") tire parti des trois façons dont la norme ISO 8601 représente les informations de fuseau horaire pour conserver la propriété Kind des valeurs DateTime : Le composant de fuseau horaire des valeurs de date et d'heure de DateTimeKind.Local représente un décalage par rapport à l'heure UTC (par exemple +01:00, -07:00). Toutes les valeurs de DateTimeOffset sont également représentées dans ce format. Le composant de fuseau horaire des valeurs de date et d'heure de DateTimeKind.Utc utilise "Z" (qui signifie décalage de zéro) pour représenter l'heure UTC. Les valeurs de date et d'heure de DateTimeKind.Unspecified n'ont aucune information de fuseau horaire. Dans la mesure où le spécificateur de format standard "O" ou "o" est conforme à une norme internationale, l'opération qui consiste à appliquer un format ou à exécuter une analyse en fonction du spécificateur utilise toujours la culture invariante et le calendrier grégorien. Les chaînes passées aux méthodes Parse, TryParse, ParseExact et TryParseExact de DateTime et DateTimeOffset peuvent être analysées à l'aide du spécificateur de format "O" ou "o", si elles sont dans l'un de ces formats. Dans le cas des objets DateTime, la surcharge d'analyse que vous appelez doit également inclure un paramètre styles ayant la valeur DateTimeStyles.RoundtripKind. Notez que si vous appelez une méthode d'analyse avec la chaîne de format personnalisée qui correspond au spécificateur de format "O" ou "o", vous n'obtenez pas les mêmes résultats que "O" ou "o". Cela est dû au fait que les méthodes d'analyse qui s'appuient sur une chaîne de format personnalisée ne peuvent pas analyser la représentation sous forme de chaîne des valeurs de date et d'heure qui n'ont pas de composant de fuseau horaire ou qui utilisent "Z" pour indiquer l'heure UTC.
it: L'identificatore di formato standard "O" o "o" rappresenta una stringa di formato di data e ora personalizzata con uno schema che mantiene le informazioni sul fuso orario e crea una stringa di risultato conforme allo standard ISO 8601. Per i valori DateTime, questo identificatore di formato è progettato in modo da mantenere i valori di data e ora insieme alla proprietà DateTime.Kind nel testo. È possibile analizzare di nuovo la stringa formattata usando il metodo DateTime.Parse(String, IFormatProvider, DateTimeStyles) o DateTime.ParseExact se il parametro styles è impostato su DateTimeStyles.RoundtripKind. L'identificatore di formato standard "O" o "o" corrisponde alla stringa di formato personalizzata "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" per valori DateTime e alla stringa di formato personalizzata "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" per valori DateTimeOffset. In questa stringa le coppie di virgolette singole che delimitano singoli caratteri, ad esempio trattini, due punti e la lettera "T", indicano che il singolo carattere è un valore letterale che non può essere modificato. Gli apostrofi non vengono visualizzati nella stringa di output. L'identificatore di formato standard "O" o "o" (e la stringa di formato personalizzata "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK") sfrutta i tre modi in cui lo standard ISO 8601 rappresenta le informazioni sul fuso orario per mantenere la proprietà Kind dei valori DateTime: Il componente relativo al fuso orario dei valori di data e ora DateTimeKind.Local rappresenta la differenza dall'ora UTC (ad esempio +01:00, -07:00). Anche tutti i valori DateTimeOffset sono rappresentati in questo formato. Il componente relativo al fuso orario dei valori di data e ora DateTimeKind.Utc usa "Z" (che corrisponde alla differenza zero) per rappresentare l'ora UTC. I valori di data e ora DateTimeKind.Unspecified non includono informazioni sul fuso orario. Dal momento che l'identificatore di formato standard "O" o "o" è conforme a uno standard internazionale, per l'operazione di formattazione o di analisi che usa l'identificatore vengono usate sempre le impostazioni cultura inglese non dipendenti da paese/area geografica e il calendario gregoriano. Le stringhe passate ai metodi Parse, TryParse, ParseExact e TryParseExact di DateTime e DateTimeOffset possono essere analizzate usando l'identificatore di formato "O" o "o" se sono in uno di questi formati. Nel caso degli oggetti DateTime, l'overload di analisi chiamato deve anche includere un parametro styles con un valore DateTimeStyles.RoundtripKind. Tenere presente che se si chiama un metodo di analisi con la stringa di formato personalizzata che corrisponde all'identificatore di formato "O" o "o", non si otterranno gli stessi risultati di "O" o "o". Il motivo è che i metodi di analisi che usano una stringa di formato personalizzata non possono analizzare la rappresentazione in formato stringa di valori di data e ora in cui manca un componente di fuso orario o che usano "Z" per indicare l'ora UTC.
ja: "O" または "o" 標準書式指定子は、タイム ゾーン情報を保持するパターンを使用するカスタム日時書式設定文字列を表し、ISO 8601 に準拠する結果文字列を生成します。この書式指定子は、DateTime 値の日付と時刻の値を DateTime.Kind プロパティと共にテキストとして保持できるように設計されています。styles パラメーターが DateTimeStyles.RoundtripKind に設定されている場合、書式設定された文字列は、DateTime.Parse(String, IFormatProvider, DateTimeStyles) または DateTime.ParseExact メソッドを使用して、変換前の文字列に戻すことができます。 "O" または "o" 標準書式指定子は、DateTime 値の場合は、"yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" カスタム書式設定文字列に、DateTimeOffset 値の場合は、"yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" カスタム書式文字列に対応します。この文字列で、ハイフン、コロン、アルファベット "T" などの個々の文字を区切る単一引用符ペアは、各文字が、変更できないリテラルであることを示します。アポストロフィは、出力文字列には表示されません。 "O" または "o" 標準書式指定子 (および "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" カスタム書式設定文字列") は、ISO 8601 の3 種類のタイム ゾーン情報表記形式を利用して、DateTime 値の Kind プロパティを保持します。 DateTimeKind.Local の日時値のタイム ゾーン コンポーネントは、UTC からのオフセットです (+01:00、-07:00 など)。すべての DateTimeOffset 値がこの形式で表されます。 DateTimeKind.Utc 日時値のタイム ゾーン コンポーネントは、(ゼロ オフセットを示す) "Z" を使用して UTC を表します。 DateTimeKind.Unspecified 日時値には、タイム ゾーン情報が含まれていません。 "O" または "o" 標準書式指定子は国際標準に準拠しているため、この指定子を使用する書式設定操作または解析操作では常に、インバリアント カルチャとグレゴリオ暦が使用されます。 DateTime と DateTimeOffset の Parse、TryParse、ParseExact、および TryParseExact メソッドに渡される文字列が、これらの形式のいずれかである場合は、"O" または "o" 書式指定子を使用して解析できます。DateTime オブジェクトの場合、呼び出す解析オーバーロードの styles パラメーターにも、DateTimeStyles.RoundtripKind 値が指定されている必要があります。"O" または "o" 書式指定子に対応するカスタム書式設定文字列を使用して解析メソッドを呼び出した結果は、"O" または "o" を使用した場合の結果と同じではありません。これは、カスタム書式設定文字列を使用する解析メソッドでは、タイム ゾーン コンポーネントがない、または "Z" を使用して UTC を表す日時値の文字列表現を解析できないためです。
ko: "O" 또는 "o" 표준 형식 지정자는 표준 시간대 정보를 보존하고 ISO 8601을 준수하는 결과 문자열을 출력하는 패턴을 사용하여 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. DateTime 값의 경우, 이 형식 지정자는 텍스트의 DateTime.Kind 속성과 함께 날짜 및 시간 값을 보존하도록 설계되어 있습니다. 형식이 지정된 문자열은 styles 매개 변수가 DateTimeStyles.RoundtripKind로 설정된 경우 DateTime.Parse(String, IFormatProvider, DateTimeStyles) 또는 DateTime.ParseExact 메서드를 사용하여 다시 구문 분석할 수 있습니다. "O" 또는 "o" 표준 형식 지정자는 DateTime 값의 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 사용자 지정 형식 문자열 및 DateTimeOffset 값의 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" 사용자 지정 형식 문자열에 대응됩니다. 이 문자열에서 하이픈, 콜론 및 문자 "T"와 같은 개별 문자를 구분하는 작은따옴표 쌍은 해당 개별 문자가 변경될 수 없는 리터럴임을 나타냅니다. 출력 문자열에는 아포스트로피가 표시되지 않습니다. "O" 또는 "o" 표준 형식 지정자(및 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 사용자 지정 형식 문자열)는 ISO 8601이 표준 시간대 정보를 나타내는 세 가지 방법을 사용하여 DateTime 값의 Kind 속성을 보존합니다. DateTimeKind.Local 날짜 및 시간 값의 표준 시간대 부분은 UTC에서 가져온 오프셋(예: +01:00, -07:00)입니다. 모든 DateTimeOffset 값도 이 형식으로 표현됩니다. DateTimeKind.Utc 날짜 및 시간 값의 표준 시간대 부분은 "Z"(제로 오프셋을 나타냄)를 사용하여 UTC를 표현합니다. DateTimeKind.Unspecified 날짜 및 시간 값에는 표준 시간대 정보가 없습니다. "O" 또는 "o" 표준 형식 지정자는 국제 표준을 준수하므로 이 지정자를 사용하는 형식 지정 또는 구문 분석 연산은 항상 고정 문화권과 양력을 사용합니다. DateTime 및 DateTimeOffset의 Parse, TryParse, ParseExact 및 TryParseExact 메서드로 전달되는 문자열은 "O" 또는 "o"형식 중 하나인 경우 "O" 또는 "o" 형식 지정자를 사용하여 구문 분석될 수 있습니다. DateTime 개체의 경우, 호출하는 구문 분석 오버로드는 값이 DateTimeStyles.RoundtripKind인 styles 매개 변수도 포함해야 합니다. "O" 또는 "o" 형식 지정자에 대응되는 사용자 지정 형식 문자열을 사용하여 구문 분석 메서드를 호출해도 "O" 또는 "o"와 동일한 결과를 얻을 수 없습니다. 사용자 지정 형식 문자열을 사용하는 구문 분석 메서드는 표준 시간대 부분이 없거나 "Z"를 사용하여 UTC를 나타내는 날짜 및 시간 값의 문자열 표현을 구문 분석할 수 없기 때문입니다.
pl: Standardowy specyfikator formatu „O” lub „o” reprezentuje niestandardowy ciąg formatu daty i godziny przy użyciu wzorca, który zachowuje informacje o strefie czasowej i generuje ciąg wynikowy zgodny z normą ISO 8601. W przypadku wartości DateTime ten specyfikator formatu został zaprojektowany tak, aby zachowywać wartości daty i godziny wraz z właściwością DateTime.Kind w postaci tekstu. Sformatowany ciąg można z powrotem przeanalizować przy użyciu metody DateTime.Parse(String, IFormatProvider, DateTimeStyles) lub DateTime.ParseExact, jeśli parametr stylów ma wartość DateTimeStyles.RoundtripKind. Standardowy specyfikator formatu „O” lub „o” odpowiada niestandardowemu ciągowi formatu „yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK” dla wartości DateTime i niestandardowemu ciągowi formatu „yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz” dla wartości DateTimeOffset. W tym ciągu pary apostrofów ograniczające pojedyncze znaki, takie jak łączniki, dwukropki i litera „T” wskazują, że dany znak jest literałem, którego nie można zmienić. Apostrofy nie pojawiają się w ciągu wyjściowym. Standardowy specyfikator formatu „O” lub „o” (oraz niestandardowy ciąg formatu „yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK”) używają trzech sposobów zdefiniowanych przez normę ISO 8601 do reprezentowania informacji o strefie czasowej w celu zachowania właściwości Kind wartości DateTime: Składnik strefy czasowej DateTimeKind.Local wartości daty i godziny to przesunięcie względem czasu UTC (na przykład +01:00, -07:00). Wszystkie wartości DateTimeOffset są także reprezentowane za pomocą tego formatu. Składnik strefy czasowej DateTimeKind.Utc wartości daty i godziny używa elementu „Z” (oznaczającego zerowe przesunięcie) do reprezentowania czasu UTC. Wartości daty i godziny ze składnikiem DateTimeKind.Unspecified nie mają informacji o strefie czasowej. Ponieważ standardowy specyfikator formatu „O” lub „o” jest zgodny ze standardem międzynarodowym, operacja formatowania lub przetwarzania używająca tego specyfikatora zawsze używa kultury niezmiennej i kalendarza gregoriańskiego. Ciągi przekazywane do metod Parse, TryParse, ParseExact i TryParseExact wartości DateTime i DateTimeOffset mogą być analizowane przy użyciu specyfikatora formatu „O” lub „o”, jeśli mają one jeden z tych formatów. W przypadku obiektów DateTime wywołanie przeciążenia analizy powinno także obejmować parametr stylu o wartości DateTimeStyles.RoundtripKind. Zauważ, że wywołanie metody analizy z niestandardowym ciągiem formatu odpowiadającym specyfikatorowi formatu „O” lub „o” da inne wyniki niż w przypadku specyfikatora „O” lub „o”. Dzieje się tak dlatego, że metody analizy używające niestandardowego ciągu formatu nie mogą analizować wartości daty i godziny w postaci ciągu, który nie zawiera składnika strefy czasowej lub elementu „Z” wskazującego czas UTC.
pt_br: O especificador de formato padrão "O" ou "o" representa uma cadeia de caracteres de formato de data e hora personalizado usando um padrão que preserva as informações de fuso horário e emite uma cadeia de resultado que está em conformidade com o ISO 8601. Para valores DateTime, esse especificador de formato é projetado para preservar valores de data e hora juntamente com a propriedade DateTime.Kind no texto. A cadeia de caracteres formatada poderá ser analisada novamente usando o método DateTime.Parse (String, IFormatProvider, DateTimeStyles) ou DateTime.ParseExact se o parâmetro styles estiver definido como DateTimeStyles.RoundtripKind. O especificador de formato padrão "O" ou "o" corresponde à cadeia de caracteres de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" para valores DateTime e à cadeia de caracteres de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" para valores de DateTimeOffset. Nessa cadeia de caracteres, os pares de aspas simples que delimitam caracteres individuais, como hifens, dois-pontos e a letra "T", indicam que o caractere individual é um literal que não pode ser alterado. Os apóstrofos não aparecem na cadeia de caracteres de saída. O especificador de formato padrão "O" ou "o" (e a cadeia de caracteres de formato personalizado "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK") aproveita as três maneiras pelas quais o ISO 8601 representa as informações de fuso horário para preservar a propriedade Kind dos valores DateTime: O componente de fuso horário de DateTimeKind.Local dos valores de data e hora é uma diferença do UTC (por exemplo, +01:00, -07:00). Todos os valores de DateTimeOffset também são representados nesse formato. O componente de fuso horário de DateTimeKind.Utc dos valores de data e hora usa "Z" (que significa diferença zero) para representar o UTC. Os valores de data e hora de DateTimeKind.Unspecified não especificados não têm informações de fuso horário. Como o especificador de formato padrão "O" ou "o" está em conformidade com um padrão internacional, a operação de formatação ou análise que usa o especificador sempre usa a cultura invariável e o calendário gregoriano. As cadeias de caracteres que são passadas para os métodos Parse, TryParse, ParseExact e TryParseExact de DateTime e DateTimeOffset podem ser analisadas usando o especificador de formato "O" ou "o" caso elas estejam em um desses formatos. No caso de objetos DateTime, a sobrecarga de análise que você chama também deve incluir um parâmetro styles com um valor de DateTimeStyles.RoundtripKind. Observe que, se você chamar um método de análise com a cadeia de caracteres de formato personalizado que corresponde ao especificador de formato "O" ou "o", você não obterá os mesmos resultados de "O" ou "o". Isso porque os métodos de análise que usam uma cadeia de caracteres de formato personalizado não podem analisar a representação de cadeia de caracteres dos valores de data e hora que não têm um componente de fuso horário ou usar "Z" para indicar o UTC.
ru: Описатель стандартного формата "O" или "o" представляет строку пользовательского формата даты и времени с использованием шаблона, который сохраняет сведения о часовом поясе и дает результирующую строку, соответствующую стандарту ISO 8601. Для значений DateTime этот описатель формата предназначен для сохранения значений даты и времени вместе со свойством DateTime.Kind в тексте. Отформатированную строку можно проанализировать в обратном направлении с помощью метода DateTime.Parse(String, IFormatProvider, DateTimeStyles) или DateTime.ParseExact, если параметр styles имеет значение DateTimeStyles.RoundtripKind. Описатель стандартного формата "O" или "o" соответствует строке пользовательского формата "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" для значений DateTime и строке пользовательского формата "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" для значений DateTimeOffset. В этой строке пары одинарных кавычек, разделяющие отдельные символы, такие как дефисы, двоеточия и буква "T", указывают, что этот отдельный знак является литералом, который не может быть изменен. Апострофы не отображаются в выходной строке. Описатель стандартного формата "O" или "o" (и строка пользовательского формата "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK") использует преимущества трех описанных в ISO 8601 способов представления сведений о часовом поясе, для сохранения свойства Kind значений DateTime: Компонент часового пояса в значениях даты и времени DateTimeKind.Local является смещением от UTC (например, +01:00, -07:00). Все значения DateTimeOffset также представлены в этом формате. Компонент часового пояса для значений даты и времени DateTimeKind.Utc использует "Z" (что означает нулевое смещение) для представления времени в формате UTC. Значения даты и времени DateTimeKind.Unspecified не содержат сведения о часовом поясе. Так как описатель стандартного формата "O" или "o" соответствует международным стандарту, операция форматирования или анализа, использующая этот описатель, всегда использует инвариантные язык и региональные параметры, а также григорианский календарь. Строки, передаваемые в методы Parse, TryParse, ParseExact и TryParseExact для значений DateTime и DateTimeOffset, можно проанализировать с помощью описателя формата "O" или "o", если они имеют один из этих форматов. В случае объектов DateTime вызываемая перегрузка анализа должна также включать параметр styles со значением DateTimeStyles.RoundtripKind. Обратите внимание, что при вызове метода анализа со строкой пользовательского формата, соответствующей описателю формата "O" или "o", результаты будут не такими, как для "O" или "o". Это вызвано тем, что методы анализа, использующие строку пользовательского формата, не могут анализировать строковое представление значений даты и времени, в которых отсутствует компонент часового пояса или используется "Z" для обозначения времени в формате UTC.
tr: "O" veya "o" standart biçim belirticisi, saat dilimi bilgilerini koruyan ve ISO 8601 ile uyumlu bir sonuç dizesi üreten bir desen kullanan özel bir tarih ve saat biçimi dizesini temsil eder. DateTime değerleri için bu biçim belirticisi metinde DateTime.Kind özelliği ile birlikte tarih ve saat değerlerini korumak için tasarlanmıştır. Biçimlendirilmiş dize, stiller parametresi DateTimeStyles.RoundtripKind olarak ayarlandıysa DateTime.Parse(String, IFormatProvider, DateTimeStyles) veya DateTime.ParseExact yöntemi kullanılarak geri ayrıştırılabilir. "O" veya "o" standart biçim belirticisi, DateTime değerleri için "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" özel biçim dizesine, DateTimeOffset değerleri içinse "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" özel biçim dizesine karşılık gelir. Bu dizede tire, iki nokta üst üste ve "T" harfi gibi tek karakterleri sınırlandıran tek tırnak işareti çiftleri bu tek karakterin değiştirilemeyen bir sabit değer olduğunu gösterir. Çıktı dizesinde tırnak işaretleri görünmez. "O" veya "o" standart biçim belirticisi (ve "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" özel biçim dizesi), DateTime değerlerinin Kind özelliğini korumak için ISO 8601'in saat dilimi bilgilerini temsil ettiği üç yoldan yararlanır: DateTimeKind.Local tarih ve saat değerlerinin saat dilimi bileşeni UTC'den uzaklıktır (örneğin, +01:00, -07:00). Tüm DateTimeOffset değerleri de bu biçimde gösterilir. DateTimeKind.UTC Tarih ve saat değerlerinin saat dilimi bileşeni UTC'yi temsil etmek için (sıfır uzaklık anlamına gelen) "Z" harfini kullanır. DateTimeKind.Unspecified tarih ve saat değerlerinde saat dilimi bilgileri yoktur. "O" veya "o" standart biçim belirticisi uluslararası bir standarda uyduğundan, belirtici kullanan biçimlendirme veya ayrıştırma işlemi her zaman sabit kültürü ve Gregoryen takvimi kullanır. DateTime ve DateTimeOffset için Parse, TryParse, ParseExact ve TryParseExact yöntemlerine geçilen dizeler, bu biçimlerden birindeyse "O" veya "o" biçim belirticisi kullanılarak ayrıştırılabilir. DateTime nesnelerinde, çağırdığınız ayrıştırma aşırı yüklemesi, değeri DateTimeStyles.RoundtripKind olan bir stiller parametresi içermelidir. "O" veya "o" biçim belirticisine karşılık gelen özel biçim dizesiyle bir ayrıştırma yöntemi çağırırsanız, "O" veya "o" ile aynı sonuçları elde edemeyeceğinizi akılda tutun. Bunun nedeni, özel biçim dizesi kullanan ayrıştırma yöntemlerinin bir saat dilimi bileşeni olmayan veya UTC'yi belirtmek için "Z" kullanan tarih ve saat değerlerinin dize gösterimini ayrıştıramamasıdır.
zh_hans: "O" 或 "o" 标准格式说明符表示使用以下模式的自定义日期和时间格式字符串: 该模式保留时区信息并发出符合 ISO 8601 的结果字符串。对于 DateTime 值，此格式说明符旨在保留日期和时间值以及文本中的 DateTime.Kind 属性。如果将样式参数设置为 DateTimeStyles.RoundtripKind，则可使用 DateTime.Parse(String, IFormatProvider, DateTimeStyles)或 DateTime.ParseExact 方法对格式化字符串进行重新分析。 "O" 或 "o" 标准格式说明符对应于 DateTime 值的 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 自定义格式字符串和 DateTimeOffset 值的 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" 自定义格式字符串。在此字符串中，分隔单个字符的单引号标记对(如连字符、冒号和字母 "T")指示单个字符是不能更改的文本。撇号不会出现在输出字符串中。 "O" 或 "o" 标准格式说明符(以及 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 自定义格式字符串)利用 ISO 8601 表示时区信息的三种方式保留日期时间值的 Kind 属性: DateTimeKind 日期和时间值的时区部分是相对于 UTC 的偏移量(例如 +01:00, -07:00)。所有 DateTimeOffset 值也以这种格式表示。 DateTimeKind 日期和时间值的时区部分使用 "Z" (代表零偏移量)表示 UTC。 DateTimeKind.Unspecified 日期和时间值不具有时区信息。 由于 "O" 或 "o" 标准格式说明符符合国际标准，因此使用该说明符的格式设置或分析操作始终使用固定区域性和公历。 可使用 "O" 或 "o" 格式说明符分析传递给 DateTime 和 DateTimeOffset 的 Parse、TryParse、ParseExact 和 TryParseExact 方法的字符串，如果字符串采用了这些格式的其中一种格式。对于 DateTime 对象，调用的分析重载还应包含值为 DateTimeStyles RoundtripKind 的样式参数。请注意，如果使用与 "O" 或 "o" 格式说明符对应的自定义格式字符串调用分析方法，则不会获得与 "O" 或 "o" 相同的结果。这是因为使用自定义格式字符串的分析方法无法分析缺少时区部分或使用 "Z" 指示 UTC 的日期和时间值的字符串表示形式。
zh_hant: "O" 或 "o" 標準格式規範會使用保留時區資訊並發出符合 ISO 8601 規範之結果字串的模式，來表示自訂日期和時間格式字串。對於 DateTime 值，此格式規範專用於以文字來保留日期和時間值以及 DateTime.Kind 屬性。如果樣式參數設定為 DateTimeStyles.RoundtripKind，就可以使用 DateTime.Parse(String, IFormatProvider, DateTimeStyles) 或 DateTime.ParseExact 方法來反向剖析格式化字串。 "O" 或 "o" 標準格式規範對應到 DateTime 值的 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 自訂格式字串，以及 DateTimeOffset 值的 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffzzz" 自訂格式字串。在這個字串中，分隔個別字元 (例如連字號、冒號和字母 "T") 的成對單引號，表示個別字元為無法變更的常值。單引號則不會出現在輸出字串中。 "O" 或 "o" 標準格式規範 (以及 "yyyy'-'MM'-'dd'T'HH':'mm':'ss'.'fffffffK" 自訂格式字串) 會利用 ISO 8601 用來表示時區資訊的三種方式，來保留 DateTime 值的 Kind 屬性: DateTimeKind.Local 日期和時間值的時區元件為 UTC 時差 (例如，+01:00、-07:00)。所有 DateTimeOffset 值也都以這種格式表示。 DateTimeKind.Utc 日期和時間值的時區元件使用 "Z" (代表零時差) 來表示 UTC。 DateTimeKind.Unspecified 的日期和時間值沒有時區資訊。 因為 "O" 或 "o" 標準格式規範符合國際標準，所以使用該規範的格式化或剖析作業，永遠不因文化特性而異並使用西曆。 如果傳遞給 DateTime 和 DateTimeOffset 之 Parse、TryParse、ParseExact 以及 TryParseExact 方法的字串採用上述其中一種格式，則可以使用 "O" 或 "o" 格式規範進行剖析。對於 DateTime 物件，您呼叫的剖析多載也應該包含具有 DateTimeStyles.RoundtripKind 值的樣式參數。請注意，如果您使用對應到 "O" 或 "o" 格式規範的自訂格式字串來呼叫剖析方法，就不會收到與 "O" 或 "o" 相同的結果。這是因為使用自訂格式字串的剖析方法無法剖析缺少時區元件或使用 "Z" 來表示 UTC 之日期和時間值的字串表示法。
