Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Modifying {0} which contains a static variable requires restarting the application.
cs: Úprava {0} se statickou proměnnou vyžaduje restartování aplikace.
de: Das Ändern von {0}, welche eine statische Variable enthält erfordert einen Neustart der Anwendung.
es: Para modificar {0}que contiene una variable estática, es necesario reiniciar la aplicación.
it: Se si modifica {0} che contiene una variabile statica, è necessario riavviare l'applicazione.
ja: 静的な変数を含む {0} を変更するには、アプリケーションを再起動する必要があります。
ko: 정적 변수를 포함하는 {0}을(를) 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja elementu {0}, który zawiera zmienną statyczną, wymaga ponownego uruchomienia aplikacji.
pt_br: A modificação de {0}, que contém uma variável estática, requer o reinício do aplicativo.
ru: Для изменения {0}, где содержится статическая переменная, требуется перезапустить приложение.
tr: Statik bir değişken içeren {0} öğesinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改包含静态变量的 {0} 需要重启应用程序。

source: Modifying {0} which contains an Aggregate, Group By, or Join query clauses requires restarting the application.
cs: Úprava {0} s klauzulí dotazu Aggregate, Group By nebo Join vyžaduje restartování aplikace.
de: Das Ändern von {0}, die eine Aggregate, Group By, oder Join Abfrageklausel enthält, erfordert einen Neustart der Anwendung.
es: Para modificar {0} que contiene las cláusulas de consulta Aggregate, Group By o Join, es necesario reiniciar la aplicación.
it: Se si modifica {0}, che contiene una clausola di query Aggregate, Group By o Join, è necessario riavviare l'applicazione.
ja: Aggregate、Group By、または Join クエリ句を含む {0} を変更するには、アプリケーションを再起動する必要があります。
ko: Aggregate, Group By 또는 Join 쿼리 절이 포함된 {0}을(를) 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja elementu {0}, który zawiera klauzule zapytania Aggregate, Group By lub Join, wymaga ponownego uruchomienia aplikacji.
pt_br: Modificar {0} que contém cláusulas de consulta Aggregate, Group By ou Join requer o reinício do aplicativo.
ru: Для изменения {0}, содержащего предложения запроса Aggregate, Group By или Join, требуется перезапустить приложение.
tr: Bir Aggregate, Group By veya Join sorgu yan tümceleri içeren {0} öğesinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改包含 Aggregate、Group By 或 Join 查询子句的 {0} 需要重启应用程序。

source: Modifying {0} which contains the stackalloc operator requires restarting the application.
cs: Úprava {0} s operátorem stackalloc vyžaduje restartování aplikace.
de: Das Ändern von {0}, die den stackalloc-Operator enthält, erfordert einen Neustart der Anwendung.
es: Para modificar {0}que contiene el operador stackalloc, es necesario reiniciar la aplicación.
it: Se si modifica {0} che contiene l'operatore stackalloc, è necessario riavviare l'applicazione.
ja: stackalloc 演算子を含む {0} を変更するには、アプリケーションを再起動する必要があります。
ko: stackalloc 연산자를 포함하는 {0}을(를) 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja elementu {0}, który zawiera operator stackalloc, wymaga ponownego uruchomienia aplikacji.
pt_br: A modificação de {0} que contém o operador stackalloc requer a reinicialização do aplicativo.
ru: Для изменения {0}, содержащего оператор stackalloc, требуется перезапустить приложение.
tr: stackalloc işleci içeren {0} öğesinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改包含 stackalloc 运算符的 {0} 需要重启应用程序。

source: Modifying a catch/finally handler with an active statement in the try block requires restarting the application.
cs: Úprava obslužné rutiny catch/finally aktivním příkazem v bloku try vyžaduje restartování aplikace.
de: Das Ändern eines Catch/Finally-Handlers mit einer aktiven Anweisung im Try-Block erfordert einen Neustart der Anwendung.
es: Para modificar un controlador catch/finally con una instrucción de acción en el bloque try se requiere reiniciar la aplicación.
it: Se si modifica un gestore catch/finally con un'istruzione attiva nel blocco try, è necessario riavviare l'applicazione.
ja: try ブロック内のアクティブ ステートメントがある catch/finally ハンドラーを変更するには、アプリケーションを再起動する必要があります。
ko: try 블록에서 활성 문으로 catch/finally 처리기를 수정하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Modyfikowanie procedury obsługi catch/finally za pomocą aktywnej instrukcji w bloku try wymaga ponownego uruchomienia aplikacji.
pt_br: Modificar um manipulador catch/finally com uma instrução ativa no bloco try requer a reinicialização do aplicativo.
ru: Для изменения обработчика catch/finally с активным оператором в блоке try требуется перезапустить приложение.
tr: Try bloğu içindeki etkin deyimli catch/finally işleyicisini değiştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改带有 try 块中的活动语句的 catch/finally 处理程序需要重新启动应用程序。

source: Modifying a catch handler around an active statement requires restarting the application.
cs: Úprava obslužné rutiny catch kolem aktivního příkazu vyžaduje restartování aplikace.
de: Das Ändern eines Catch-Handlers um eine aktive Anweisung erfordert einen Neustart der Anwendung.
es: Para modificar un controlador de tipo catch alrededor de una instrucción activa, es necesario reiniciar la aplicación.
it: Se si modifica un gestore catch all'inizio di un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントの前後の catch ハンドラーを変更するには、アプリケーションを再起動する必要があります。
ko: 활성 문 주위에 catch 처리기를 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja procedury obsługi typu catch wokół aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: A modificação de um manipulador catch em torno de uma instrução ativa requer a reinicialização do aplicativo.
ru: Для изменения обработчика catch вокруг активной инструкции требуется перезапустить приложение.
tr: Bir yakalama işleyicisinin etkin bir ifade etrafında değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改活动语句周围的 catch 处理程序需要重启应用程序。

source: Modifying a generic method requires restarting the application.
cs: Úprava obecné metody vyžaduje restartování aplikace.
de: Das Ändern einer generischen Methode erfordert einen Neustart der Anwendung.
es: Para modificar un método genérico se requiere reiniciar la aplicación.
it: Se si modifica un metodo generico, è necessario riavviare l'applicazione.
ja: ジェネリック メソッドを変更するには、アプリケーションを再起動する必要があります。
ko: 일반 메서드를 수정하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Modyfikowanie metody ogólnej wymaga ponownego uruchomienia aplikacji.
pt_br: Modificar um método genérico requer a reinicialização do aplicativo.
ru: Для изменения универсального метода требуется перезапустить приложение.
tr: Bir genel yöntemi değiştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改泛型方法需要重新启动应用程序。

source: Modifying a method inside the context of a generic type requires restarting the application.
cs: Úprava metody uvnitř kontextu obecného typu vyžaduje restartování aplikace.
de: Das Ändern einer Methode im Kontext des generischen Typs erfordert einene Neustart der Anwendung.
es: Para modificar un método dentro del contexto de un tipo genérico se requiere reiniciar la aplicación.
it: Se si modifica un metodo all'interno del contesto di un tipo generico, è necessario riavviare l'applicazione.
ja: ジェネリック型のコンテキスト内でメソッドを変更するには、アプリケーションを再起動する必要があります。
ko: 제네릭 형식의 컨텍스트 내에서 메서드를 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja metody w kontekście typu ogólnego wymaga ponownego uruchomienia aplikacji.
pt_br: A modificação de um método dentro do contexto de um tipo genérico requer o reinício do aplicativo.
ru: Для изменения метода в контексте универсального типа требуется перезапустить приложение.
tr: Genel bir tür bağlamında bir yöntemin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在泛型类型的上下文中修改方法需要重启应用程序。

source: Modifying a try/catch/finally statement when the finally block is active requires restarting the application.
cs: Úprava příkazu try/catch/finally, když je aktivní blok finally, vyžaduje restartování aplikace.
de: Das Ändern einer Try-/Catch-/Finally-Anweisung bei aktiviertem endgültigen Block erfordert einen Neustart der Anwendung.
es: Para modificar una instrucción try/catch/finally cuando el bloque finally está activo se requiere reiniciar la aplicación.
it: Se si modifica un'istruzione try/catch/finally quando il blocco finally è attivo, è necessario riavviare l'applicazione.
ja: finally ブロックがアクティブのときに try/catch/finally ステートメントを変更するには、アプリケーションを再起動する必要があります。
ko: finally 블록이 활성 상태일 때 try/catch/finally 문을 수정하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Modyfikowanie instrukcji try/catch/finally, gdy blok finally jest aktywny, wymaga ponownego uruchomienia aplikacji.
pt_br: Modificar uma instrução try/catch/finally quando o bloco finally estiver ativo requer a reinicialização do aplicativo.
ru: Для изменения оператора try/catch/finally при активном блоке finally требуется перезапустить приложение.
tr: Finally bloğu etkin olduğunda bir try/catch/finally deyimini değiştirme, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在 finally 块处于活动状态时修改 try/catch/finally 语句需要重新启动应用程序。

source: Modifying the body of {0} requires restarting the application because the body has too many statements.
cs: Úprava těla {0} vyžaduje restartování aplikace, protože je v něm příliš mnoho příkazů.
de: Das Ändern des Texts von {0} erfordert einen Neustart der Anwendung, da der Text zu viele Anweisungen enthält.
es: Para modificar el cuerpo de {0}se requiere reiniciar la aplicación porque el cuerpo tiene demasiadas instrucciones.
it: Se si modifica il corpo di {0}, è necessario riavviare l'applicazione perché il corpo contiene troppe istruzioni.
ja: 本文のステートメントが多すぎるため、{0} の本文を変更するには、アプリケーションを再起動する必要があります。
ko: 본문에 문이 너무 많기 때문에 {0}의 본문을 수정하려면 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja treści elementu {0} wymaga ponownego uruchomienia aplikacji, ponieważ treść zawiera zbyt wiele instrukcji.
pt_br: Modificar o corpo de {0} requer reiniciar o aplicativo porque o corpo tem muitas instruções.
ru: Для изменения тела {0} требуется перезапустить приложение, так как в теле содержится слишком много операторов.
tr: {0} öğesinin gövdesinin değiştirilmesi, gövdenin çok fazla ifadesi olduğundan uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改 {0} 的正文需要重启应用程序，因为正文的语句太多。

# Modifying_body_of_0_requires_restarting_the_application_due_to_internal_error_1
source: Modifying the body of {0} requires restarting the application due to internal error: {1}
cs: Úprava těla {0} vyžaduje restartování aplikace kvůli vnitřní chybě: {1}
de: Das Ändern des Texts von {0} erfordert einen Neustart der Anwendung aufgrund des internen Fehlers: {1}
es: Para modificar el cuerpo de {0} es necesario reiniciar la aplicación debido a un error interno: {1}
it: Se si modifica il corpo di {0}, è necessario riavviare l'applicazione a causa di un errore interno: {1}
ja: {0} の本文を変更するには、内部エラーが発生したため、アプリケーションを再起動する必要があります: {1}
ko: {0}의 본문을 수정하려면 내부 오류로 인해 애플리케이션을 다시 시작해야 합니다. {1}
pl: Modyfikacja treści elementu {0} wymaga ponownego uruchomienia aplikacji z powodu błędu wewnętrznego: {1}
pt_br: A modificação do corpo de {0} requer a reinicialização do aplicativo devido a um erro interno: {1}
ru: Для изменения тела {0} требуется перезапустить приложение из-за внутренней ошибки: {1}
tr: {0} öğesinin gövdesini değiştirmek, iç hata {1} nedeniyle uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改 {0} 的正文要求重启应用程序，原因为内部错误: {1}

source: Modifying source file '{0}' requires restarting the application because the file is too big.
cs: Změna zdrojového souboru {0} vyžaduje restartování aplikace, protože soubor je příliš velký.
de: Das Ändern der Quelldatei „{0}“ erfordert einen Neustart der Anwendung, da die Datei zu groß ist.
es: Para modificar el archivo de origen "{0}" se requiere reiniciar la aplicación porque el archivo es demasiado grande.
it: Se si modifica il file di origine '{0}', è necessario riavviare l'applicazione perché le dimensioni del file sono eccessive.
ja: ファイルが大きすぎるため、ソース ファイル '{0}' を変更するには、アプリケーションを再起動する必要があります。
ko: 원본 파일 '{0}'을(를) 수정하려면 파일이 너무 크므로 애플리케이션을 다시 시작해야 합니다.
pl: Modyfikacja pliku źródłowego elementu „{0}” wymaga ponownego uruchomienia aplikacji, ponieważ plik jest zbyt duży.
pt_br: Modificar o arquivo de origem '{0}' requer reiniciar o aplicativo porque o arquivo é muito grande.
ru: Для изменения исходного файла "{0}" требуется перезапустить приложение, так как файл слишком велик.
tr: '{0}' kaynak dosyasının değiştirilmesi, dosya çok büyük olduğundan uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 修改源文件“{0}”需要重启应用程序，因为该文件太大。

source: Modifying source file '{0}' requires restarting the application due to internal error: {1}
cs: Úprava zdrojového souboru {0} vyžaduje restartování aplikace kvůli vnitřní chybě: {1}
de: Das Ändern der Quelldatei „{0}“ erfordert einen Neustart der Anwendung aufgrund des internen Fehlers: {1}
es: Para modificar el archivo de origen "{0}" se requiere reiniciar la aplicación debido a un error interno: {1}
it: Se si modifica il corpo di origine '{0}', è necessario riavviare l'applicazione a causa di un errore interno: {1}
ja: ソース ファイル '{0}' を変更するには、次の内部エラーのため、アプリケーションを再起動する必要があります: {1}
ko: 원본 파일 '{0}'을(를) 수정하려면 내부 오류로 인해 응용 프로그램을 다시 시작해야 합니다. {1}
pl: Modyfikowanie pliku źródłowego "{0}" wymaga ponownego uruchomienia aplikacji z powodu błędu wewnętrznego: {1}
pt_br: Modificar o arquivo de origem '{0}' requer a reinicialização do aplicativo devido a um erro interno: {1}
ru: Для изменения исходного файла "{0}" требуется перезапустить приложение из-за внутренней ошибки: {1}
tr: '{0}' kaynak dosyasını değiştirmek, iç hata {1} nedeniyle uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 由于内部错误“{1}”，修改源文件“{0}”需要重启应用程序

source: Modifying source with experimental language features enabled requires restarting the application.
cs: Úprava zdroje s povolenými experimentálními jazykovými funkcemi vyžaduje restartování aplikace.
de: Das Ändern der Quelle mit aktivierten experimentellen Sprachfeatures erfordert einen Neustart der Anwendung.
es: Para modificar el origen con las características de lenguaje experimental habilitadas se requiere reiniciar la aplicación.
it: Se si modifica l'origine con le funzionalità del linguaggio sperimentali abilitate, è necessario riavviare l'applicazione.
ja: 試験的な言語機能を有効にしてソースを変更するには、アプリケーションを再起動する必要があります。
ko: 실험 언어 기능이 활성화된 원본를 수정하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Modyfikowanie źródła z włączonymi funkcjami eksperymentalnymi języka wymaga ponownego uruchomienia aplikacji.
pt_br: Modificar a origem com recursos de linguagem experimental habilitados requer a reinicialização do aplicativo.
ru: Для изменения исходного кода с включенными экспериментальными функциями языка требуется перезапустить приложение..
tr: Deneysel dil özellikleri etkinken kaynağı değiştirme, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在启用实验语言功能的情况下修改源需要重新启动应用程序。

source: Module not found!
cs: Modul se nenašel!
de: Das Modul wurde nicht gefunden.
es: No se encontró el módulo.
it: Modulo non trovato.
ja: モジュールが見つかりません
ko: 모듈을 찾을 수 없습니다.
pl: Nie znaleziono modułu.
pt_br: Módulo não encontrado.
ru: Модуль не найден.
tr: Modül bulunamadı!
zh_hans: 找不到模块!

source: Move contents to namespace...
cs: Přesunout obsah do oboru názvů...
de: Inhalt in Namespace verschieben...
es: Mover contenido al espacio de nombres...
fr: Déplacer le contenu vers un espace de noms...
it: Sposta contenuto nello spazio dei nomi...
ja: 名前空間へのコンテンツの移動...
ko: 네임스페이스로 콘텐츠 이동...
pl: Przenieś zawartość do przestrzeni nazw...
pt_br: Mover conteúdo para o namespace...
ru: Переместить содержимое в пространство имен...
tr: İçerikleri ad alanına taşı...
zh_hans: 将内容移动到命名空间...
zh_hant: 將內容移到命名空間...

source: Move file to '{0}'
cs: Přesunout soubor do: {0}
de: Datei in "{0}" verschieben
es: Mover el archivo a "{0}"
fr: Déplacer le fichier vers '{0}'
it: Sposta il file in '{0}'
ja: ファイルを '{0}' に移動します
ko: 파일을 '{0}'(으)로 이동
pl: Przenieś plik do lokalizacji „{0}”
pt_br: Mover o arquivo para '{0}'
ru: Переместить файл в "{0}"
tr: Dosyayı '{0}' konumuna taşı
zh_hans: 将文件移至“{0}”
zh_hant: 將檔案移至 ‘{0}'

source: Move file to project root folder
cs: Přesunout soubor do kořenové složky projektu
de: Datei in den Stammordner des Projekts verschieben
es: Mover el archivo a la carpeta raíz del proyecto
fr: Déplacer le fichier dans le dossier racine du projet
it: Sposta il file nella cartella radice del progetto
ja: ファイルをプロジェクト ルート フォルダーに移動します
ko: 파일을 프로젝트 루트 폴더로 이동
pl: Przenieś plik do folderu głównego projektu
pt_br: Mover o arquivo para a pasta raiz do projeto
ru: Переместить файл в корневую папку проекта
tr: Dosyayı proje kök klasörüne taşı
zh_hans: 将文件移动到项目根文件夹
zh_hant: 將檔案移到專案根資料夾

source: Move static members to another type...
cs: Přesunout statické členy do jiného typu…
de: Statische Mitglieder werden in einen anderen Typ verschoben...
es: Mover miembros estáticos a otro tipo...
it: Sposta membri statici in un altro tipo...
ja: 静的メンバーを別の型に移行する...
ko: 정적 멤버를 다른 형식으로 이동...
pl: Przenieś statyczne składowe do innego typu...
pt_br: Mover membros estáticos para outro tipo...
ru: Переместить статические элементы в другой тип...
tr: Statik üyeleri başka bir türe taşı...
zh_hans: 将静态成员移到另一类型...

source: Move to namespace...
cs: Přesunout do oboru názvů...
de: In Namespace verschieben...
es: Mover a espacio de nombres...
fr: Déplacer vers un espace de noms...
it: Sposta nello spazio dei nomi...
ja: 名前空間に移動します...
ko: 네임스페이스로 이동...
pl: Przenieś do przestrzeni nazw...
pt_br: Mover para o namespace...
ru: Переместить в пространство имен...
tr: Ad alanına taşı...
zh_hans: 移动到命名空间...
zh_hant: 移到命名空間...

source: Moving {0} requires restarting the application.
cs: Přesunutí {0} vyžaduje restartování aplikace.
de: Das Verschieben von {0} erfordert einen Neustart der Anwendung.
es: Para mover {0} es necesario reiniciar la aplicación.
it: Se si sposta {0}, è necessario riavviare l'applicazione.
ja: {0} を移動するには、アプリケーションを再起動する必要があります。
ko: {0}을(를) 이동하려면 애플리케이션을 다시 시작해야 합니다.
pl: Przeniesienie elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Mover {0} requer reiniciar o aplicativo.
ru: Для перемещения {0} требуется перезапустить приложение.
tr: {0} öğesinin taşınması uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 移动 {0} 要求重启应用程序。

source: Name expected
cs: Očekával se název
de: Name erwartet
es: Nombre esperado
it: Previsto nome
ja: 名前が必要です
ko: 이름이 필요합니다.
pl: Oczekiwano nazwy
pt_br: Nome esperado
ru: Ожидалось имя
tr: Ad bekleniyor
zh_hans: 预期名称

source: Navigating to symbol '{0}' from '{1}'.
cs: Přechází se na symbol {0} z {1}.
de: Die Navigation von „{1}“ zum Symbol „{0}“ wird durchgeführt.
es: Navegando al símbolo '{0}' desde '{1}'.
it: Passaggio al simbolo '{0}' da '{1}'.
ja: "{1}" からシンボル '{0}' に移動しています。
ko: '{1}'에서 기호 '{0}'(으)로 이동하는 중입니다.
pl: Trwa przechodzenie do symbolu „{0}” z „{1}”.
pt_br: Navegando para o símbolo '{0}' de '{1}'.
ru: Переход к символу "{0}" от "{1}".
tr: “{1}“den "{0}" sembolüne gidiliyor.
zh_hans: 从“{1}”导航到符号“{0}”。

source: Nested properties not allowed
cs: Vnořené vlastnosti nejsou povolené
de: Nicht zulässige geschachtelte Eigenschaften
es: Propiedades anidadas no permitidas
it: Proprietà annidate non consentite
ja: 入れ子になったプロパティは使用できません
ko: 중첩 속성은 사용할 수 없습니다.
pl: Właściwości zagnieżdżone są niedozwolone
pt_br: Propriedades aninhadas não são permitidas
ru: Вложенные свойства не разрешены
tr: İç içe özelliklere izin verilmiyor
zh_hans: 不允许嵌套属性

source: Nested quantifier {0}
de: Geschachtelter Quantifizierer {0}.
fr: Quantificateur imbriqué {0}
it: Quantificatore nidificato {0}
ja: 入れ子になった量指定子 {0}
tr: İç içe geçmiş niceleyici {0}
zh_hans: 嵌套限定符 {0}
zh_hant: 巢狀數量詞 {0}

source: No common root node for extraction.
cs: Žádný společný kořenový uzel pro extrakci
de: Kein gemeinsamer Stammknoten für Extraktion.
es: No hay nodo raíz común para la extracción.
it: Non esiste un nodo radice comune per l'estrazione.
ja: 抽出するための一般的なルート ノードがありません。
ko: 추출에 필요한 일반 루트 노드가 없습니다.
pl: Brak wspólnego węzła głównego do wyodrębnienia.
pt_br: Nenhum nó de raiz comum para extração.
ru: Нет стандартного корневого узла для извлечения.
tr: Ayıklama için ortak kök düğümü yok.
zh_hans: 没有可用于提取的公共根节点。

source: No source document info found in PDB.
cs: V souboru PDB se nenašly žádné informace o zdrojovém dokumentu.
de: In der PDB-Datei wurden keine Quelldokumentinformationen gefunden.
es: No se encontró información del documento de origen en PDB.
it: Nessuna informazione sul documento di origine trovata nel PDB.
ja: PDB にソース ドキュメント情報が見つかりません。
ko: PDB에서 원본 문서 정보를 찾을 수 없습니다.
pl: Nie znaleziono informacji o dokumencie źródłowym w pliku PDB.
pt_br: Nenhuma informação do documento de origem encontrada no PDB.
ru: В PDB-файле не найдены сведения об исходном документе.
tr: PDB'de kaynak belge bilgisi bulunamadı.
zh_hans: 未在 PDB 中找到源文档信息。

source: No valid location to insert method call.
cs: Není k dispozici žádné platné umístění, kam vložit volání metody.
de: Keine gültige Position zum Einfügen eines Methodenaufrufs.
es: No hay ninguna ubicación válida para insertar una llamada de método.
fr: Aucun emplacement valide pour l'insertion de l'appel de méthode.
it: Non ci sono posizioni valide per inserire la chiamata a un metodo.
ja: メソッド呼び出しを挿入する有効な場所がありません。
ko: 메서드 호출을 삽입할 유효한 위치가 없습니다.
pl: Brak prawidłowej lokalizacji dla wstawienia wywołania metody.
pt_br: Não há nenhum local válido para inserir a chamada de método.
ru: Отсутствует допустимое расположение для вставки вызова метода.
tr: Metot çağrısının ekleneceği geçerli konum yok.
zh_hans: 没有插入方法调用的有效位置。
zh_hant: 沒有可插入方法呼叫的有效位置。

source: No valid selection to perform extraction.
cs: Žádný platný výběr k provedení extrakce
de: Keine gültige Auswahl zum Durchführen der Extraktion.
es: Selección no válida para efectuar extracción.
it: La selezione non è valida per eseguire l'estrazione.
ja: 抽出を行うための有効な選択がありません。
ko: 추출을 수행할 선택 항목이 잘못되었습니다.
pl: Brak prawidłowego zaznaczenia do wyodrębnienia.
pt_br: Nenhuma seleção válida para realizar a extração.
ru: Нет допустимого выделения для извлечения.
tr: Ayıklamayı gerçekleştirme için geçerli seçim yok.
zh_hans: 没有执行提取的有效选择。

# Not_enough_close_parens
source: Not enough )'s
cs: Nedostatek znaků )
de: Zu wenige )-Zeichen
es: No hay suficientes )
fr: Pas assez de )'s
it: Parentesi chiuse insufficienti
ja: ) が足りません
ko: 부족 )'s
pl: Zbyt mało znaków )
pt_br: Não há )'s suficientes
ru: Отсутствуют закрывающие круглые скобки
tr: Değil yeterli)'ın
zh_hans: ")" 不足
zh_hant: ) 不夠

source: Only properties allowed in an object
cs: V objektu jsou povolené pouze vlastnosti
de: Nur in einem Objekt zulässige Eigenschaften
es: Solo se permiten propiedades en un objeto
it: Solo le proprietà consentite in un oggetto
ja: オブジェクトではプロパティのみ使用できます
ko: 개체에는 속성만 사용할 수 있습니다.
pl: Tylko właściwości dozwolone w obiekcie
pt_br: Somente propriedades permitidas em um objeto
ru: В объекте разрешены только свойства
tr: Yalnızca nesnede izin verilen özellikler
zh_hans: 仅对象中允许的属性

source: Operators
cs: Operátory
de: Operatoren
es: Operadores
it: Operatori
ja: 演算子
ko: 연산자
pl: Operatory
pt_br: Operadores
ru: Операторы
tr: Operatörler
zh_hans: 运算符

source: Please resolve errors in your code before renaming this element.
cs: Před přejmenováním tohoto elementu prosím vyřešte chyby v kódu.
de: Beheben Sie die Fehler in Ihrem Code, bevor Sie dieses Element umbenennen.
es: Resuelva los errores del código antes de cambiar el nombre de este elemento.
it: Prima di rinominare l'elemento risolvere gli errori nel codice.
ja: この要素の名前を変更する前に、コード内のエラーを解決してください。
ko: 이 요소의 이름을 바꾸기 전에 코드 오류를 해결하세요.
pl: Przed zmianą nazwy tego elementu napraw problemy występujące w kodzie.
pt_br: Resolva erros em seu código antes de renomear este elemento.
ru: Устраните ошибки в коде, прежде чем переименовать этот элемент.
tr: Bu öğeyi yeniden adlandırmadan önce lütfen kodunuzdaki hataları çözümleyin.
zh_hans: 请在重命名此元素前解决代码中的错误。
