Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Apply string interpolation preferences
cs: Použít předvolby interpolace řetězců
de: Anwenden von Einstellungen für die Zeichenfolgeninterpolation
es: Aplicar preferencias de interpolación de cadena
it: Applica preferenze di interpolazione stringa
ja: 文字列補間の基本設定を適用する
ko: 문자열 보간 적용 기본 설정
pl: Zastosuj preferencje interpolacji ciągu
pt_br: Aplicar preferências de interpolação de cadeia de caracteres
ru: Применить настройки для интерполяции строк
tr: Dize ilişkilendirme tercihlerini uygula
zh_hans: 应用字符串内插首选项

source: Apply tuple name preferences
cs: Použít předvolby názvů řazené kolekce členů
de: Tupelnamenseinstellungen anwenden
es: Aplicar preferencias de nombre de tupla
it: Applica le preferenze per il nome della tupla
ja: タプル名の基本設定を適用する
ko: 튜플 이름 적용 기본 설정
pl: Zastosuj preferencje dotyczące nazw spójnych kolekcji
pt_br: Aplicar preferências de nome de tupla
ru: Применить настройки для имен кортежей
tr: Demet adı tercihlerini uygula
zh_hans: 应用元组名称首选项

source: Apply unused value preferences
cs: Použít předvolby nepoužívaných hodnot
de: Nicht verwendete Werteinstellungen anwenden
es: Aplicar preferencias de valor sin usar
it: Applica preferenze valore inutilizzato
ja: 未使用の値の基本設定を適用する
ko: 사용하지 않는 값 적용 기본 설정
pl: Zastosuj nieużywane preferencje wartości
pt_br: Aplicar preferências de valor não utilizadas
ru: Применить настройки для неиспользуемых значений
tr: Kullanılmayan değer tercihlerini uygula
zh_hans: 应用未使用的值首选项

source: Apply using directive placement preferences
cs: Použít předvolby umístění direktivy pro použití
de: Platzierungseinstellungen für Verwendungsrichtlinien anwenden
es: Aplicar usando las preferencias de selección de ubicación de directiva
it: Applica preferenze di posizionamento per le direttive
ja: using ディレクティブの配置の基本設定を適用する
ko: Using 지시문 배치 적용 기본 설정
pl: Zastosuj preferencje umieszczania dyrektyw użycia
pt_br: Aplicar preferências de uso de posicionamento de diretiva
ru: Применить настройки для размещения директивы using
tr: Using yönerge yerleştirme tercihlerini uygula
zh_hans: 使用指令放置偏好应用

source: Applying source changes while the application is running is not supported by the runtime.
cs: Použití změn zdroje v době, kdy je aplikace spuštěna, není podporováno modulem runtime.
de: Das Anwenden von Quelländerungen während der Ausführung der Anwendung wird von der Laufzeit nicht unterstützt.
es: El tiempo de ejecución no admite la aplicación de cambios de origen mientras se ejecuta la aplicación.
it: L'applicazione delle modifiche all'origine durante l'esecuzione dell'applicazione non è supportata dal runtime.
ja: アプリケーションの実行中にソースの変更を適用することは、ランタイムでサポートされていません。
ko: 애플리케이션이 실행되는 동안 원본 변경 사항을 적용하는 것은 런타임에서 지원되지 않습니다.
pl: Stosowanie zmian źródłowych, gdy aplikacja jest uruchomiona, nie jest obsługiwane przez środowisko uruchomieniowe.
pt_br: Não há suporte para a aplicação de alterações de origem enquanto o aplicativo estiver em execução.
ru: Применение изменений источника во время выполнения приложения не поддерживается средой выполнения.
tr: Uygulama çalışırken kaynak değişikliklerinin uygulanması çalışma zamanı tarafından desteklenmiyor.
zh_hans: 在应用程序运行时，运行时不支持应用源更改。

source: Attribute '{0}' is missing. Updating an async method or an iterator requires restarting the application.
cs: Atribut {0} chybí. Aktualizace asynchronní metody nebo iterátoru vyžaduje restartování aplikace.
de: Das Attribut „{0}“ fehlt. Das Aktualisieren eine asynchronen Methode oder eine Iterators erfordert einen Neustart der Anwendung.
es: Falta el atributo "{0}". Para actualizar un método asincrónico o un iterador se requiere reiniciar la aplicación.
it: Manca l'attributo '{0}'. Se si aggiorna un metodo asincrono o un iteratore, è necessario riavviare l'applicazione.
ja: 属性 '{0}' がありません。非同期メソッドまたは反復子を更新するには、アプリケーションを再起動する必要があります。
ko: 특성 '{0}'이(가) 없습니다. 비동기 메서드 또는 반복기를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Brak atrybutu elementu „{0}”. Aktualizacja metody asynchronicznej lub iteratora wymaga ponownego uruchomienia aplikacji.
pt_br: O atributo '{0}' está ausente. A atualização de um método assíncrono ou iterador requer a reinicialização do aplicativo.
ru: Атрибут "{0}" отсутствует. Для обновления асинхронного метода или итератора требуется перезапустить приложение.
tr: '{0}' özniteliği eksik. Bir zaman uyumsuz yöntemin veya yineleyicinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 缺少属性“{0}”。更新异步方法或迭代器需要重启应用程序。

source: Asynchronously waits for the task to finish.
cs: Asynchronně čeká na dokončení úlohy.
de: Wartet asynchron darauf, dass die Aufgabe fertig ist.
es: Espera de forma asincrónica a que termine la tarea.
it: Attende in modalità asincrona il completamento dell'attività.
ja: タスクの完了を非同期に待機します。
ko: 작업이 완료될 때까지 비동기적으로 기다립니다.
pl: Asynchronicznie oczekuje na zakończenie zadania.
pt_br: Assincronamente aguarda a conclusão da tarefa.
ru: Асинхронно ожидает окончания задачи.
tr: Zaman uyumsuz olarak görevin tamamlanmasını bekler.
zh_hans: 异步等待任务完成。

source: Await the preceding expression
cs: Počkat na předchozí výraz
de: Auf den vorhergehenden Ausdruck warten
es: Espere la expresión anterior
it: Attendi l'espressione precedente
ja: 前の式を待機する
ko: 이전 식을 기다립니다.
pl: Oczekuj poprzedniego wyrażenia
pt_br: Aguarde a expressão anterior
ru: Ожидание предыдущего выражения
tr: Önceki ifadeyi bekle
zh_hans: 等待前面的表达式

source: Await the preceding expression and add ConfigureAwait({0}).
cs: Počkejte na předchozí výraz a přidejte ConfigureAwait({0}).
de: Warten Sie auf den vorhergehenden Ausdruck, und fügen Sie „ConfigureAwait ({0})“ hinzu.
es: Espere la expresión anterior y agregue ConfigureAwait({0}).
it: Attendi l'espressione precedente e aggiungi ConfigureAwait({0}).
ja: 前の式を待機し、ConfigureAwait ({0}) を追加します。
ko: 이전 식을 기다리고 ConfigureAwait({0})를 추가합니다.
pl: Oczekuj poprzedniego wyrażenia i dodaj ConfigureAwait({0}).
pt_br: Aguarde a expressão anterior e adicione ConfigureAwait ({0}).
ru: Ожидание предыдущего выражения и добавление ConfigureAwait({0}).
tr: Önceki ifadeyi bekleyin ve ConfigureAwait({0}) ekleyin.
zh_hans: 等待前面的表达式并添加 ConfigureAwait({0})。

source: Awaited task returns {0}
cs: Očekávaná úloha vrací {0}.
de: Erwartete Aufgabe gibt „{0}“ zurück
es: La tarea esperada devuelve {0}
ko: 대기된 작업에서 {0}이(가) 반환됨
pl: Zadanie, którego oczekiwano, zwraca wartość {0}
pt_br: A tarefa esperada retorna {0}
ru: Ожидаемая задача возвращает {0}
tr: Beklenen görev {0} döndürüyor
zh_hans: 等待任务返回 {0}

source: Awaited task returns no value
cs: Očekávaná úloha nevrací žádnou hodnotu.
de: Erwartete Aufgabe gibt keinen Wert zurück
es: La tarea esperada no devuelve ningún valor.
fr: La tâche attendue ne retourne aucune valeur
it: L'attività attesa non restituisce alcun valore
ja: 待機中のタスクは値を返しません
ko: 대기된 작업에서 값이 반환되지 않음
pl: Zadanie, na które oczekiwano, nie zwraca wartości
pt_br: A tarefa esperada não retorna nenhum valor
ru: Ожидаемая задача не возвращает значение.
tr: Beklenen görev değer döndürmüyor
zh_hans: 等待任务没有返回任何值
zh_hant: 等待的工作不會傳回任何值

source: Base classes contain inaccessible unimplemented members
de: Basisklassen enthalten nicht implementierte Member, auf die nicht zugegriffen werden kann.
fr: Les classes de base contiennent des membres non implémentés inaccessibles
it: Le classi di base contengono membri non implementati inaccessibili
ja: アクセス不可能な未実装のメンバーが基底クラスに含まれています
zh_hans: 基类包含无法访问的未实现成员
zh_hant: 基底類別包含無法存取的未實作成員

source: Built-in Copilot analysis
tr: Yerleşik Copilot analizi
zh_hans: 内置 Copilot 分析

# CSharp_VisualBasic_References
source: C# and Visual Basic References
cs: Reference pro C# a Visual Basic
de: Referenzen zu C# und Visual Basic
es: Referencias de C# y Visual Basic
it: Riferimenti per C# e Visual Basic
ja: C# および Visual Basic の参照
ko: C# 및 Visual Basic 참조
pl: Dokumentacja języków C# i Visual Basic
pt_br: Referências do C# e do Visual Basic
ru: Справочники по C# и Visual Basic
tr: C# ve Visual Basic Başvuruları
zh_hans: C# 和 Visual Basic 参考

# CannotApplyChangesUnexpectedError
source: Cannot apply changes -- unexpected error: '{0}'
cs: Změny se nedají použít – neočekávaná chyba: {0}
de: Änderungen können nicht angewendet werden -- unerwarteter Fehler: "{0}"
es: No se pueden aplicar los cambios. Error inesperado: "{0}"
fr: Impossible d'appliquer les changements -- Erreur inattendue : '{0}'
it: Non è possibile applicare le modifiche. Errore imprevisto: '{0}'
ja: 変更を適用できません。予期しないエラー: '{0}'
ko: 변경 내용을 적용할 수 없음 -- 예기치 않은 오류: '{0}'
pl: Nie można zastosować zmian — nieoczekiwany błąd: „{0}”
pt_br: Não é possível aplicar as alterações – erro inesperado: '{0}'
ru: Не удается применить изменения, так как возникла непредвиденная ошибка: "{0}"
tr: Değişiklikler uygulanamıyor - beklenmeyen hata: '{0}'
zh_hans: 无法应用更改 - 意外错误:“{0}”
zh_hant: 無法套用變更 -- 未預期的錯誤: '{0}'

source: Cannot include class \{0} in character range
cs: Do rozsahu znaků nejde zahrnout třídu \{0}.
de: Die Klasse \{0} kann nicht in den Zeichenbereich aufgenommen werden.
es: No se incluye la clase \{0} en el intervalo de caracteres
fr: Impossible d'inclure la classe \{0} dans la plage de caractères
it: Non è possibile includere la classe \{0} nell'intervallo di caratteri
ja: 文字範囲にクラス \{0} を含めることはできません
ko: 문자 범위에 \{0} 클래스를 포함할 수 없습니다.
pl: Nie można uwzględnić klasy \{0} w zakresie znaków
pt_br: Não é possível incluir a classe \{0} no intervalo de caracteres
ru: Невозможно включить класс \{0} в диапазон символов
tr: Sınıf \{0} içeremez karakter aralığı
zh_hans: 不能在字符范围内包含类 \{0}
zh_hant: 無法在字元範圍內包含類別 \{0}

source: Cannot navigate to the symbol under the caret.
cs: Nejde navigovat k symbolu pod stříškou.
de: Navigieren zu dem Symbol unter dem Caret nicht möglich.
es: No se puede navegar al símbolo que hay debajo del símbolo de intercalación.
it: Non è possibile passare al simbolo sotto il punto di inserimento.
ja: カレットの下のシンボルに移動できません。
ko: 캐럿에서 기호를 탐색할 수 없습니다.
pl: Nie można przejść do symbolu pod karetką.
pt_br: Não é possível navegar para o símbolo sob o cursor.
ru: Не удается перейти к символу, на котором находится курсор.
tr: Giriş işareti altında sembole gidilemiyor.
zh_hans: 无法导航到插入点下面的符号。

source: Capture group numbers must be less than or equal to Int32.MaxValue
de: Erfassungsgruppennummern müssen kleiner oder gleich Int32.MaxValue sein.
fr: Les nombres de groupe de capture doivent être inférieurs ou égaux à Int32.MaxValue
it: I numeri del gruppo Capture devono essere minori o uguali a Int32.MaxValue
ja: キャプチャ グループ番号は Int32.MaxValue 以下でなければなりません
tr: Yakalama grup numaraları Int32.MaxValue eşit veya daha az olmalıdır
zh_hans: 捕获组编号必须小于等于 Int32.MaxValue
zh_hant: 擷取群組號碼必須小於或等於 Int32.MaxValue

source: Capture number cannot be zero
cs: Počet zachytávání nemůže být nulový
de: Aufzeichnungsnummer darf nicht 0 (null) sein.
es: La captura de número no puede ser cero
fr: Le nombre de captures ne peut pas être égal à zéro
it: Il numero di acquisizioni non può essere zero
ja: キャプチャ番号を 0 にすることはできません
ko: 캡처 번호는 0일 수 없습니다.
pl: Numer przechwytywania nie może być równy zeru
pt_br: O número da captura não pode ser zero
ru: Номер записи не может быть равен нулю
tr: Yakalama numarası sıfır olamaz
zh_hans: 捕获编号不能为零
zh_hant: 擷取號碼不可為零

source: Capturing primary constructor parameter '{0}' that hasn't been capture before requires restarting the application.
cs: Zachytávání parametru primárního konstruktoru {0}, který se předtím nezachytával, vyžaduje restartování aplikace.
es: La captura del parámetro de constructor principal "{0}" que no se ha capturado antes requiere reiniciar la aplicación.
ko: 캡처되지 않은 '{0}' 기본 생성자 매개 변수를 캡처하려면 애플리케이션을 다시 시작해야 합니다.
pl: Przechwytywanie podstawowego parametru konstruktora „{0}”, który nie został wcześniej przechwycony, wymaga ponownego uruchomienia aplikacji.
pt_br: A captura do parâmetro primário do construtor '{0}' que não tenha sido capturado antes exige a reinicialização do aplicativo.
ru: Для фиксации параметра первичной конструкции "{0}", который ранее не был зафиксирован, требуется перезапустить приложение.
tr: Önceden yakalanmamış olan '{0}' birincil oluşturucu parametresini yakalamak için uygulamanın yeniden başlatılmasını gerekir.
zh_hans: 捕获之前尚未捕获的主构造函数参数“{0}”需要重启应用程序。

source: Ceasing to capture primary constructor parameter '{0}' of '{1}' requires restarting the application.
cs: Dokončení zachytávání parametru primárního konstruktoru{0} z {1} vyžaduje restartování aplikace.
de: Das Erfassen des primären Konstruktorparameters '{0}' von '{1}' erfordert einen Neustart der Anwendung.
es: Dejar de capturar el parámetro de constructor principal "{0}" de "{1}" requiere reiniciar la aplicación.
it: Per non acquisire il parametro del costruttore primario '{0}' di '{1}' è necessario riavviare l'applicazione.
ja: '{1}' のプライマリ コンストラクター パラメーター '{0}' をキャプチャするには、アプリケーションを再起動する必要があります。
ko: '{0}'/‘{1}’ 기본 생성자 매개 변수를 캡처를 중지하려면 애플리케이션을 다시 시작해야 합니다.
pl: Przerwanie przechwytywania podstawowego parametru konstruktora „{0}” „{1}” wymaga ponownego uruchomienia aplikacji.
pt_br: Deixar de capturar o parâmetro {0} do construtor primário de '{1}' exige a reinicialização do aplicativo.
ru: Для прекращения фиксации параметра первичной конструкции "{0}" "{1}" требуется перезапустить приложение.
tr: '{0}' / '{1}' birincil oluşturucu parametresini yakalama işleminin başlatılması için uygulamanın yeniden başlatılması gerekir.
zh_hans: 停止以捕获“{1}”的主构造函数参数“{0}”需要重启应用程序。

# ChangeSignature_NewParameterInferValue
source: <infer>
cs: <vyvodit>
de: <ableiten>
es: <inferir>
fr: <déduire>
it: <deduci>
ja: <推測する>
ko: <유추>
pl: <wnioskuj>
pt_br: <inferir>
ru: <вывести>
tr: <çıkarsa>
zh_hans: <推断>
zh_hant: <推斷>

# ChangeSignature_NewParameterOmitValue
source: <omit>
cs: <vynechat>
de: <Auslassen>
es: <omitir>
fr: <omettre>
it: <ometti>
ja: <省略>
ko: <생략>
pl: <pomiń>
pt_br: <omitir>
ru: <пропустить>
tr: <atla>
zh_hans: <省略>
zh_hant: <省略>

source: Change namespace to '{0}'
cs: Změnit obor názvů na {0}
de: Namespace in "{0}" ändern
es: Cambiar el espacio de nombres "{0}"
fr: Remplacer l’espace de noms par '{0}'
it: Modifica lo spazio dei nomi in '{0}'
ja: 名前空間を '{0}' に変更します
ko: 네임스페이스를 '{0}'(으)로 변경
pl: Zmień przestrzeń nazw na „{0}”
pt_br: Alterar o namespace para '{0}'
ru: Изменить пространство имен на "{0}"
tr: Ad alanını '{0}' olarak değiştir
zh_hans: 将命名空间更改为“{0}”
zh_hant: 將命名空間變更為 ‘{0}'

source: Change to global namespace
cs: Změnit na globální obor názvů
de: In globalen Namespace ändern
es: Cambiar al espacio de nombres global
fr: Remplacer par l'espace de noms général
it: Passa allo spazio dei nomi globale
ja: グローバル名前空間に変更します
ko: 전역 네임스페이스로 변경
pl: Zmień na globalną przestrzeń nazw
pt_br: Alterar para o namespace global
ru: Изменить на глобальное пространство имен
tr: Genel ad alanı olarak değiştir
zh_hans: 更改为全局命名空间
zh_hant: 變更為全域命名空間

# ChangesDisallowedWhileStoppedAtException
source: Changes are not allowed while stopped at exception
cs: Když se běh zastaví na výjimce, změny se nepovolují.
de: Änderungen sind nicht zulässig, solange der Vorgang bei einer Ausnahme angehalten ist.
es: No se permiten cambios durante una parada por una excepción
fr: Aucun changement n'est autorisé en cas d'arrêt à la suite d'une exception
it: Le modifiche non sono consentite in caso di arresto in corrispondenza dell'eccezione
ja: 例外で停止中は変更できません
ko: 예외에서 중지된 동안에는 변경할 수 없습니다.
pl: Zmiany nie są dozwolone, gdy wyjątek został zatrzymany
pt_br: Não são permitidas alterações durante uma interrupção em exceção
ru: Изменения запрещены, когда выполнение остановлено при исключении
tr: Özel durum sırasında durdurulduğunda değişikliklere izin verilmez
zh_hans: 在出现异常而停止时禁止更改
zh_hant: 於例外狀況停止時不允許變更

# ChangesRequiredSynthesizedType
source: One or more changes result in a new type being created by the compiler, which requires restarting the application because it is not supported by the runtime
cs: Výsledkem jedné nebo více změn je, že kompilátor vytvoří nový typ, což vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Eine oder mehrere Änderungen führen dazu, dass ein neuer Typ vom Compiler erstellt wird, der einen Neustart der Anwendung erfordert, da er von der Laufzeit nicht unterstützt wird.
es: Uno o varios cambios provocan que el compilador cree un nuevo tipo, lo que requiere reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Una o più modifiche determinano la creazione di un nuovo tipo da parte del compilatore e tale operazione richiede il riavvio dell'applicazione perché non è supportata dal runtime
ja: 1 つ以上の変更によって、新しい型がコンパイラによって作成されています。これはランタイムでサポートされていないため、アプリケーションを再起動する必要があります。
ko: 하나 이상의 변경으로 인해 컴파일러에서 새 유형이 생성되며 런타임에서 지원하지 않기 때문에 응용 프로그램을 다시 시작해야 합니다.
pl: Co najmniej jedna zmiana powoduje utworzenie nowego typu przez kompilator, co wymaga ponownego uruchomienia aplikacji, ponieważ nie jest ona obsługiwana przez środowisko uruchomieniowe
pt_br: Uma ou mais alterações resultam no compilador criando um novo tipo, o que requer a reinicialização do aplicativo porque não há suporte para ele no runtime
ru: Одно или несколько изменений приведут к созданию нового типа компилятором. Это не поддерживается средой выполнения, поэтому требуется перезапустить приложение.
tr: Bir veya daha fazla değişiklik, derleyici tarafından yeni bir türün oluşturulmasına neden olur ve bu, çalışma zamanı tarafından desteklenmediği için uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 一个或多个更改导致编译器创建新类型，这需要重新启动应用程序，因为运行时不支持该应用程序

source: Changing {0} from asynchronous to synchronous requires restarting the application.
cs: Změna {0} z asynchronního na synchronní vyžaduje restartování aplikace.
de: Das Ändern von {0} von asynchron zu synchron erfordert einen Neustart der Anwendung.
es: Para cambiar {0} de asíncrona a sincrónica, es necesario reiniciar la aplicación.
it: Se si modifica {0} da asincrono a sincrono, è necessario riavviare l'applicazione.
ja: {0} を非同期から同期に変更するには、アプリケーションを再起動する必要があります。
ko: 비동기에서 동기로 {0}을(를) 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana elementu {0} z asynchronicznego na synchroniczny wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar {0} de assíncrono para síncrono requer a reinicialização do aplicativo.
ru: Для изменения {0} с асинхронного на синхронный требуется перезапустить приложение.
tr: {0} öğesinin zaman uyumsuzdan zaman uyumluya değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将 {0} 从异步更改为同步需要重启应用程序。

source: Changing '{0}' to '{1}' requires restarting the application because it changes the shape of the state machine.
cs: Změna {0} na {1} vyžaduje restartování aplikace, protože mění tvar stavového stroje.
de: Das Ändern von „{0}“ zu „{1}“ erfordert einen Neustart der Anwendung, da dadurch die Form des Zustandsautomaten geändert wird.
es: Para cambiar "{0}" a "{1}" se requiere reiniciar la aplicación porque cambia la forma de la máquina de estados.
it: Se si modifica '{0}' in '{1}', è necessario il riavvio dell'applicazione perché l'operazione comporta la modifica della forma della macchina a stati.
ja: '{0}' を '{1}' に変更すると、ステート マシンの形状が変更されるため、アプリケーションを再起動する必要があります。
ko: '{0}'을(를) '{1}'(으)로 변경하려면 상태 시스템의 모양을 변경하므로 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana elementu „{0}” na „{1}” wymaga ponownego uruchomienia aplikacji, ponieważ zmienia on kształt automatu stanów.
pt_br: Alterar '{0}' para '{1}' requer a reinicialização do aplicativo porque altera a forma da máquina de estado.
ru: Для изменения "{0}" на "{1}" требуется перезапустить приложение, так как при этом изменяется форма конечного автомата.
tr: '{0}' öğesinin '{1}' olarak değiştirilmesi, durum makinesinin şeklini değiştirdiği için uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将“{0}”更改为“{1}”需要重启应用程序，因为它会更改状态机的形状。

source: Changing a field to an event or vice versa requires restarting the application.
cs: Změna pole na událost nebo naopak vyžaduje restartování aplikace.
de: Das Ändern eines Felds in ein Ereignis oder umgekehrt erfordert einen Neustart der Anwendung.
es: Para cambiar un campo a un evento o viceversa se requiere reiniciar la aplicación.
it: Se si modifica un campo per un evento o viceversa, è necessario riavviare l'applicazione.
ja: フィールドをイベントに変更する、またはイベントをフィールドに変更するには、アプリケーションを再起動する必要があります。
ko: 필드를 이벤트로 변경하거나 그 반대로 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana pola na zdarzenie lub odwrotnie wymaga ponownego uruchomienia aplikacji.
pt_br: Para alterar um campo para um evento ou vice-versa, é necessário reiniciar o aplicativo.
ru: Для изменения поля на событие или наоборот требуется перезапустить приложение.
tr: Bir alanın bir olaya dönüştürülmesi veya tersinin yapılması, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将字段更改为事件或将事件更改为字段需要重启应用程序。

source: Changing attribute '{0}' requires restarting the application.
cs: Změna atributu {0} vyžaduje restartování aplikace.
es: Cambiar el atributo "{0}" requiere reiniciar la aplicación.
ko: '{0}' 특성을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmienianie atrybutu „{0}” wymaga ponownego uruchomienia aplikacji.
pt_br: A alteração do atributo '{0}' exige a reinicialização do aplicativo.
ru: Для изменения атрибута "{0}" требуется перезапустить приложение.
tr: '{0}' özniteliğinin değiştirilmesi için uygulamanın yeniden başlatılması gerekir.
zh_hans: 更改属性“{0}”需要重启应用程序。

source: Changing constraints of {0} requires restarting the application.
cs: Změna omezení pro {0} vyžaduje restartování aplikace.
de: Das Ändern der Einschränkungen von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar las restricciones de {0} es necesario reiniciar la aplicación.
it: Se si modificano i vincoli di {0}, è necessario riavviare l'applicazione.
ja: {0} の制約を変更するには、アプリケーションを再起動する必要があります。
ko: {0} 제약 조건을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana ograniczeń elementów {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar as restrições de {0} requer o reinício do aplicativo.
ru: Для изменения ограничений {0} требуется перезапустить приложение.
tr: {0} öğesinin kısıtlamalarının değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的约束需要重启应用程序。

source: Changing attribute '{0}' requires restarting the application.
cs: Změna atributu {0} vyžaduje restartování aplikace.
de: Zum Ändern des Attributs "{0}" muss die Anwendung neu gestartet werden.
es: Cambiar el atributo '{0}' requiere reiniciar la aplicación.
it: La modifica dell'attributo '{0}' richiede il riavvio dell'applicazione.
ja: 属性 '{0}' を変更するには、アプリケーションを再起動する必要があります。
ko: '{0}' 특성을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmienianie atrybutu „{0}” wymaga ponownego uruchomienia aplikacji.
pt_br: A alteração do atributo “{0}” requer a reinicialização do aplicativo.
ru: Для изменения атрибута "{0}" требуется перезапустить приложение.
tr: '{0}' özniteliğinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改属性“{0}”需要重新启动应用程序。

source: Changing parameter types of {0} requires restarting the application.
cs: Změna typů parametrů u {0} vyžaduje restartování aplikace.
de: Das Ändern von Parametertypen von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar los tipos de parámetros de {0}se requiere reiniciar la aplicación.
it: Se si modificano i tipi di parametro di {0}, è necessario riavviare l'applicazione.
ja: {0} のパラメーターの種類を変更するには、アプリケーションを再起動する必要があります。
ko: {0}의 매개 변수 유형을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana typów parametrów elementów {0} wymaga ponownego uruchomienia aplikacji.
pt_br: A alteração dos tipos de parâmetro de {0} requer o reinício do aplicativo.
ru: Для изменения типов параметров {0} требуется перезапустить приложение.
tr: {0} öğesinin parametre türlerinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的参数类型需要重启应用程序。
