Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_zero_width_negative_lookahead_assertion_long
source: A zero-width negative lookahead assertion, where for the match to be successful, the input string must not match the regular expression pattern in subexpression. The matched string is not included in the match result. A zero-width negative lookahead assertion is typically used either at the beginning or at the end of a regular expression. At the beginning of a regular expression, it can define a specific pattern that should not be matched when the beginning of the regular expression defines a similar but more general pattern to be matched. In this case, it is often used to limit backtracking. At the end of a regular expression, it can define a subexpression that cannot occur at the end of a match.
cs: Negativní kontrolní výraz dopředného vyhledávání s nulovou délkou, při kterém úspěšná shoda nastane v případě, že vstupní řetězec neodpovídá vzoru regulárního výrazu v dílčím výrazu. Hledaný řetězec se do výsledku porovnávání nezahrnuje. Negativní kontrolní výraz dopředného vyhledávání s nulovou délkou se obvykle používá na začátku nebo na konci regulárního výrazu. Na začátku regulárního výrazu může definovat konkrétní vzor, který by se neměl shodovat, pokud začátek regulárního výrazu definuje podobný, ale obecnější vzor, který se má shodovat. V tomto případě se často používá k omezení zpětného vyhledávání. Na konci regulárního výrazu může definovat dílčí výraz, který se nesmí vyskytovat na konci hledaného řetězce.
de: Eine negative Lookaheadassertion mit Nullbreite, bei der eine Übereinstimmung erfolgreich ist, wenn die Eingabezeichenfolge nicht dem Muster für reguläre Ausdrücke im Teilausdruck entspricht. Die übereinstimmende Zeichenfolge ist im Übereinstimmungsergebnis nicht enthalten. Eine negative Lookaheadassertion mit Nullbreite wird in der Regel entweder am Anfang oder am Ende eines regulären Ausdrucks verwendet. Am Anfang eines regulären Ausdrucks kann ein bestimmtes Muster definiert werden, das nicht übereinstimmen darf, wenn der Anfang des regulären Ausdrucks ein ähnliches, aber allgemeineres Muster für den Abgleich definiert. In diesem Fall wird sie häufig verwendet, um die Rückverfolgung einzuschränken. Am Ende eines regulären Ausdrucks kann ein Teilausdruck definiert werden, der nicht am Ende einer Übereinstimmung vorliegen darf.
es: Una aserción de búsqueda anticipada (lookahead) negativa de ancho cero, donde para que la coincidencia sea correcta, la cadena de entrada no debe coincidir con el patrón de expresión regular en la subexpresión. La cadena coincidente no se incluye en el resultado de la coincidencia. Una aserción de búsqueda anticipada (lookahead) negativa de ancho cero se utiliza normalmente al principio o al final de una expresión regular. Al comienzo de una expresión regular, puede definir un patrón específico que no debe coincidir cuando el comienzo de la expresión regular define un patrón similar pero más general para la coincidencia. En este caso, se suele usar para limitar el seguimiento con retroceso. Al final de una expresión regular, puede definir una subexpresión que no se puede producir al final de una coincidencia.
fr: Assertion avant négative de largeur nulle, où, pour que la correspondance soit réussie, la chaîne d'entrée ne doit pas correspondre au modèle d'expression régulière de la sous-expression. La chaîne correspondante n'est pas incluse dans le résultat de la correspondance. Une assertion avant négative de largeur nulle est généralement utilisée au début ou à la fin d'une expression régulière. Au début d'une expression régulière, elle peut définir un modèle spécifique à ne pas mettre en correspondance quand le début de l'expression régulière définit un modèle similaire, mais plus général, à mettre en correspondance. Dans ce cas, elle est souvent utilisée pour limiter le retour sur trace. À la fin d'une expression régulière, elle peut définir une sous-expression qui ne peut pas se produire à la fin d'une correspondance.
it: Asserzione lookahead negativa di larghezza zero, in cui per trovare una corrispondenza, la stringa di input non deve corrispondere al criterio di ricerca di espressioni regolari in subexpression. La stringa corrispondente non è inclusa nei risultati della corrispondenza. Un'asserzione lookahead negativa di larghezza zero viene usata in genere all'inizio o alla fine di un'espressione regolare. All'inizio di un'espressione regolare, può definire un criterio specifico per il quale non deve essere trovata una corrispondenza quando l'inizio dell'espressione regolare definisce un criterio simile, ma più generale, per cui stabilire la corrispondenza. In questo caso, viene spesso usata per limitare il backtracking. Alla fine di un'espressione regolare, può definire una sottoespressione che non può verificarsi alla fine di una corrispondenza.
ja: ゼロ幅の否定先読みアサーション。ここで、一致と見なされるためには、入力文字列が subexpression の正規表現パターンと一致しない必要がありますが、一致した文字列は一致結果には含まれません。 通常、ゼロ幅の否定先読みアサーションは正規表現の先頭または末尾で使用されます。正規表現の先頭の場合は、類似してもより一般的なパターンを照合するように正規表現の先頭で定義されているときに、一致しない必要がある特定のパターンを定義できます。この場合は、バックトラッキングを制限するためによく使用されます。正規表現の末尾の場合は、一致の末尾に出現できない部分式を定義できます。
ko: 너비가 0인 부정 lookahead 어설션입니다. 여기서, 일치 항목을 찾으려면 입력 문자열이 하위 식의 정규식 패턴과 일치하면 안 됩니다. 일치하는 문자열은 일치 결과에 포함되지 않습니다. 너비가 0인 부정 lookahead 어설션은 일반적으로 정규식의 시작 부분이나 끝부분에 사용됩니다. 정규식의 시작 부분에서는 일치시켜야 하는 유사하지만 보다 일반적인 패턴을 정의할 때 일치시키면 안 되는 특정 패턴을 정의할 수 있습니다. 이 경우 보통 역추적을 제한하는 데 사용됩니다. 정규식의 끝부분에서는 일치 항목의 끝부분에 있으면 안 되는 하위 식을 정의할 수 있습니다.
pl: Negatywna asercja wyprzedzająca o zerowej szerokości, w przypadku której powodzenie dopasowania wymaga, aby ciąg wejściowy nie pasował do wzorca wyrażenia regularnego w podwyrażeniu. Dopasowany ciąg nie jest dołączany do wyniku dopasowania. Negatywna asercja wyprzedzająca o zerowej szerokości jest zwykle używana na początku lub na końcu wyrażenia regularnego. Na początku wyrażenia regularnego może definiować konkretny wzorzec, który nie powinien zostać dopasowany, jeśli początek wyrażenia regularnego definiuje podobny, ale bardziej ogólny wzorzec dopasowania. W takim przypadku jest często używana do ograniczenia cofania się. Na końcu wyrażenia regularnego może definiować podwyrażenie, które nie może wystąpić na końcu dopasowania.
pt_br: Uma asserção lookahead negativa de largura zero, em que, para que a correspondência seja bem-sucedida, a cadeia de caracteres de entrada não pode corresponder ao padrão de expressão regular na subexpressão. A cadeia de caracteres correspondente não está incluída no resultado correspondente. Uma asserção lookahead negativa de largura zero normalmente é usada no início ou no final de uma expressão regular. No início de uma expressão regular, ela pode definir um padrão específico que não deve ser correspondido quando o início da expressão regular define um padrão semelhante, mas mais geral, a ser correspondido. Nesse caso, ela geralmente é usada para limitar o rastreamento inverso. No final de uma expressão regular, ela pode definir uma subexpressão que não pode ocorrer no final de uma correspondência.
ru: Отрицательное утверждение просмотра вперед нулевой ширины, в котором для успешного сопоставления входная строка не должна соответствовать шаблону регулярного выражения в части выражения. Соответствующая строка не включается в результат сравнения. Отрицательное упреждающее утверждение нулевой ширины обычно используется либо в начале, либо в конце регулярного выражения. В начале выражения оно может определять определенный шаблон, который не должен совпадать, когда начало регулярного выражения определяет схожий, но более общий сравниваемый шаблон. В этом случае такое утверждение часто используется для ограничения обратного отслеживания. В конце регулярного выражения такое утверждение может определять часть выражения, которое не может находиться в конце сравнения.
tr: Eşleşmenin başarılı olması için giriş dizesinin alt ifadedeki normal ifade deseniyle eşleşmemesi gerektiği sıfır genişlikli bir negatif ileri yönlü onaylama. Eşleşen dize, eşleşme sonucuna dahil değildir. Sıfır genişlikli bir negatif ileri yönlü onaylama genellikle normal ifadenin başında veya sonunda kullanılır. Normal bir ifadenin başında olduğunda, normal ifadenin başının eşleştirilecek benzer ancak daha genel bir desen tanımlaması durumunda, eşleştirilmemesi gereken belirli bir desen tanımlayabilir. Bu durumda, genellikle geri izlemeyi sınırlandırmak için kullanılır. Normal bir ifadenin sonunda olduğunda, bir eşleşmenin sonunda oluşamayacak bir alt ifade tanımlayabilir.
zh_hans: 零宽负向先行断言(即要成功匹配)，输入字符串不得与子表达式中的正则表达式模式匹配。匹配的字符串未包含在匹配结果中。 零宽负向先行断言通常在正则表达式的开头或结尾使用。在正则表达式的开头，它可以定义一个特定模式，当正则表达式的开头定义类似但更多个要匹配的常规模式时，不应匹配该模式。在这种情况下，它通常用于限制回溯。在正则表达式的末尾，它可以定义无法在匹配结束时出现的子表达式。
zh_hant: 零寬負右合樣判斷提示，如果要使比對成功，則輸入字串不得符合子運算式中的規則運算式模式。符合的字串不會包含在比對結果內。 零寬度 lookahead 判斷提示通常會用在規則運算式的開頭或結尾。在規則運算式的開頭，其可定義應符合的特定模式 (當規則運算式的開頭定義相似但更普通的應符合模式時)。在這種情況下，其常會用來限制回溯。在規則運算式的結尾，其可定義不會在比對結束時發生的子運算式。

# Regex_zero_width_negative_lookahead_assertion_short
source: zero-width negative lookahead assertion
cs: negativní kontrolní výraz dopředného vyhledávání s nulovou délkou
de: Negative Lookaheadassertion mit Nullbreite
es: aserción de búsqueda anticipada (lookahead) negativa de ancho cero
fr: assertion avant négative de largeur nulle
it: asserzione lookahead negativa di larghezza zero
ja: ゼロ幅の否定先読みアサーション
ko: 너비가 0인 부정 lookahead 어설션
pl: negatywna asercja wyprzedzająca o zerowej szerokości
pt_br: asserção lookahead negativa de largura zero
ru: отрицательное утверждение просмотра вперед нулевой ширины
tr: sıfır genişlikli negatif ileri yönlü onaylama
zh_hans: 零宽负向先行断言
zh_hant: 零寬負值右合樣判斷提示

# Regex_zero_width_negative_lookbehind_assertion_long
source: A zero-width negative lookbehind assertion, where for a match to be successful, 'subexpression' must not occur at the input string to the left of the current position. Any substring that does not match 'subexpression' is not included in the match result. Zero-width negative lookbehind assertions are typically used at the beginning of regular expressions. The pattern that they define precludes a match in the string that follows. They are also used to limit backtracking when the last character or characters in a captured group must not be one or more of the characters that match that group's regular expression pattern.
cs: Negativní kontrolní výraz zpětného vyhledávání s nulovou délkou, při kterém úspěšná shoda nastane v případě, že se dílčí výraz nenachází ve vstupním řetězci nalevo od aktuální pozice. Dílčí řetězce, které neodpovídají dílčímu výrazu, se do výsledku porovnávání nezahrnují. Negativní kontrolní výrazy zpětného vyhledávání s nulovou délkou se obvykle používají na začátku regulárních výrazů. Vzor, který definují, vylučuje shodu v řetězci, který následuje. Používají se také k omezení zpětného vyhledávání, pokud poslední znak nebo znaky v zachycující skupině nesmí představovat jeden nebo více znaků, které odpovídají vzoru regulárního výrazu dané skupiny.
de: Eine negative Lookbehindassertion mit Nullbreite, bei der eine Übereinstimmung erfolgreich ist, wenn "Teilausdruck" nicht in der Eingabezeichenfolge links von der aktuellen Position vorliegt. Teilzeichenfolgen, die nicht mit "Teilausdruck" übereinstimmen, sind im Übereinstimmungsergebnis nicht enthalten. Negative Lookbehindassertionen mit Nullbreite werden normalerweise am Anfang regulärer Ausdrücke verwendet. Das von ihnen definierte Muster verhindert eine Übereinstimmung in der nachfolgenden Zeichenfolge. Sie werden zudem zum Begrenzen der Rückverfolgung verwendet, wenn das letzte Zeichen oder die Zeichen in einer erfassten Gruppe nicht mit einem oder mehreren Zeichen übereinstimmen dürfen, die dem Muster für reguläre Ausdrücke der Gruppe entsprechen.
es: Una aserción de búsqueda retrasada (lookbehind) negativa de ancho cero, donde para que una coincidencia sea correcta, "subexpresión" no se debe producir en la cadena de entrada a la izquierda de la posición actual. Cualquier subcadena que no coincida con "subexpresión" no se incluye en el resultado de la coincidencia. Las aserciones de búsqueda retrasada (lookbehind) negativas de ancho cero se usan normalmente al principio de las expresiones regulares. El patrón que definen excluye una coincidencia en la cadena que aparece a continuación. También se usan para limitar el seguimiento con retroceso cuando el último o los últimos caracteres de un grupo capturado no deban ser uno o varios de los caracteres que coinciden con el patrón de expresión regular de ese grupo.
fr: Assertion arrière négative de largeur nulle, où, pour qu'une correspondance soit réussie, la 'sous-expression' ne doit pas apparaître dans la chaîne d'entrée à gauche de la position actuelle. Les sous-chaînes qui ne correspondent pas à la 'sous-expression' ne sont pas incluses dans le résultat de la correspondance. Les assertions arrière négatives de largeur nulle sont généralement utilisées au début des expressions régulières. Le modèle qu'elles définissent empêche toute correspondance dans la chaîne qui suit. Elles sont également utilisées pour limiter le retour sur trace quand le ou les derniers caractères d'un groupe capturé ne doivent pas représenter un ou plusieurs des caractères qui correspondent au modèle d'expression régulière de ce groupe.
it: Asserzione lookbehind negativa di larghezza zero, in cui per trovare una corrispondenza, 'subexpression' non deve trovarsi nella stringa di input a sinistra della posizione corrente. Qualsiasi sottostringa che non corrisponde a 'subexpression' non viene inclusa nel risultato della corrispondenza. Le asserzioni lookbehind negative di larghezza zero vengono usate in genere all'inizio delle espressioni regolari. Il criterio definito preclude una corrispondenza nella stringa che segue. Queste asserzioni vengono usate anche per limitare il backtracking quando l'ultimo carattere o gli ultimi caratteri in un gruppo acquisito non devono essere costituiti da uno o più caratteri corrispondenti al criterio di ricerca di espressioni regolari di tale gruppo.
ja: ゼロ幅の否定後読みアサーション。ここで、一致と見なされるためには、'subexpression' が入力文字列の現在の位置の左側に出現しない必要があります。'subexpression' と一致しない部分文字列は一致結果には含まれません。 通常、ゼロ幅の否定後読みアサーションは正規表現の先頭で使用されます。定義されるパターンでは、後に続く文字列内の一致が除外されます。これは、キャプチャされたグループの最後の文字がそのグループの正規表現パターンと一致する 1 つ以上の文字にならない必要がある場合に、バックトラッキングを制限するためにも使用されます。
ko: 너비가 0인 부정 lookbehind 어설션입니다. 여기서, 일치 항목을 찾으려면 입력 문자열에서 현재 위치 왼쪽에 'subexpression'이 없어야 합니다. 'subexpression'과 일치하지 않는 하위 문자열은 일치 결과에 포함되지 않습니다. 너비가 0인 부정 lookbehind 어설션은 일반적으로 정규식의 시작 부분에 사용됩니다. 어설션이 정의하는 패턴은 뒤에 오는 문자열에 일치 항목이 없도록 합니다. 캡처된 그룹에 있는 마지막 문자가 해당 그룹의 정규식 패턴과 일치하는 하나 이상의 문자가 아니어야 하는 경우 역추적을 제한하는 데도 사용됩니다.
pl: Negatywna asercja wsteczna o zerowej szerokości, w przypadku której powodzenie dopasowania wymaga, aby „podwyrażenie” nie występowało w ciągu wejściowym po lewej stronie bieżącej pozycji. Dowolny podciąg niepasujący do „podwyrażenia” nie jest dołączany do wyniku dopasowania. Negatywne asercje wsteczne o zerowej szerokości są zwykle używane na początku wyrażeń regularnych. Definiowany przez nie wzorzec wyklucza dopasowanie w następującym ciągu. Są one także używane do ograniczenia cofania się, jeśli ostatni znak lub znaki w przechwyconej grupie nie mogą być znakami pasującymi do wzorca wyrażenie regularnego tej grupy.
pt_br: Uma asserção lookbehind negativa de largura zero, em que, para que uma correspondência seja bem-sucedida, a 'subexpression' não pode ocorrer na cadeia de caracteres de entrada à esquerda da posição atual. As substrings que não corresponderem à 'subexpression' não serão incluídas no resultado correspondente. As declarações de lookbehind negativas de largura zero normalmente são usadas no início de expressões regulares. O padrão que elas definem impede uma correspondência na cadeia de caracteres seguinte. Elas também são usadas para limitar o rastreamento inverso quando o último caractere ou caracteres em um grupo capturado não pode ser um ou mais dos caracteres que correspondem ao padrão dessa expressão regular do grupo.
ru: Отрицательное утверждение просмотра назад нулевой ширины, где для успешного сопоставления "часть выражения" не должна находиться во входной строке слева от текущей позиции. Любая подстрока, не соответствующая "части выражения", не включается в результат сравнения. Отрицательные отстающие утверждения просмотра назад обычно используются в начале регулярных выражений. Шаблон, который они определяют, предотвращает совпадение в следующей строке. Они также используются для ограничения обратного отслеживания, когда один или несколько последних символов в группе записи не должны соответствовать символам шаблона регулярного выражения этой группы.
tr: Bir eşleşmenin başarılı olması için geçerli konumun solundaki giriş dizesinde 'subexpression' gerçekleşmemesi gereken sıfır genişlikli bir negatif geri yönlü onaylama. 'subexpression' ile eşleşmeyen herhangi bir alt dize, eşleşme sonucuna dahil değildir. Sıfır genişlikli negatif geri yönlü onaylamalar genellikle normal ifadelerin başlangıcında kullanılır. Tanımladıkları desen, kendisini izleyen dizede bir eşleşmenin önüne geçer. Ayrıca, yakalanan bir gruptaki son karakter veya karakterler, grubun normal ifade deseniyle eşleşen karakterlerden biri veya daha fazlası olmaması gerektiğinde, geri izlemeyi sınırlandırmak için de kullanılır.
zh_hans: 零宽负向后行断言(即要成功匹配)，不得在输入字符串的当前位置左侧出现 "subexpression"。与 "subexpression" 不匹配的任何子字符串都不包含在匹配结果中。 零宽负向后行断言通常在正则表达式开头使用。它们定义的模式在后面的字符串中排除匹配。当捕获组中的最后一个字符不能是与该组的正则表达式模式匹配的一个或多个字符时，它们也用于限制回溯。
zh_hant: 零寬負左合樣判斷提示，如果要使比對成功，則 'subexpression' 不得發生在目前位置左側的輸入字串。所有不符合 'subexpression' 的子字串都不會包含在比對結果內。 零寬度負 lookbehind 判斷提示通常會用在規則運算式的開頭。其定義的模式會排除下一個字串中的相符項。其也常用於限制回溯 (當最後一個字元或已擷取群組中的字元不得為符合群組規則運算式模式的一或多個字元時)。

# Regex_zero_width_negative_lookbehind_assertion_short
source: zero-width negative lookbehind assertion
cs: negativní kontrolní výraz zpětného vyhledávání s nulovou délkou
de: Negative Lookbehindassertion mit Nullbreite
es: aserción de búsqueda retrasada (lookbehind) negativa de ancho cero
fr: assertion arrière négative de largeur nulle
it: asserzione lookbehind negativa di larghezza zero
ja: ゼロ幅の否定後読みアサーション
ko: 너비가 0인 부정 lookbehind 어설션
pl: negatywna asercja wsteczna o zerowej szerokości
pt_br: asserção lookbehind negativa de largura zero
ru: отрицательное утверждение просмотра назад нулевой ширины
tr: sıfır genişlikli negatif geri yönlü onaylama
zh_hans: 零宽负向后行断言
zh_hant: 零寬負值左合樣判斷提示
