Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: #{0} directive
cs: Direktiva #{0}
de: #{0} Anweisung
es: directiva #{0}
it: direttiva #{0}
ja: #{0} ディレクティブ
ko: #{0} 지시문
pl: dyrektywa #{0}
pt_br: diretiva #{0}
ru: Директива #{0}
tr: #{0} yönergesi
zh_hans: {0} 号指令

source: AM/PM (abbreviated)
cs: AM/PM (zkráceno)
de: AM/PM (abgekürzt)
es: a.m./p.m. (abreviado)
fr: AM/PM (abrégé)
it: AM/PM (abbreviato)
ja: AM/PM (短縮)
ko: AM/PM(약식)
pl: AM/PM (skrót)
pt_br: AM/PM (abreviado)
ru: AM/PM (сокращенно)
tr: AM/PM (kısa)
zh_hans: AM/PM(缩写)
zh_hant: AM/PM (縮寫)

# AM_PM_abbreviated_description
source: The "t" custom format specifier represents the first character of the AM/PM designator. The appropriate localized designator is retrieved from the DateTimeFormatInfo.AMDesignator or DateTimeFormatInfo.PMDesignator property of the current or specific culture. The AM designator is used for all times from 0:00:00 (midnight) to 11:59:59.999. The PM designator is used for all times from 12:00:00 (noon) to 23:59:59.999. If the "t" format specifier is used without other custom format specifiers, it's interpreted as the "t" standard date and time format specifier.
cs: Specifikátor vlastního formátu t představuje první znak údaje dop/odp. Správný lokalizovaný údaj se načítá z vlastnosti DateTimeFormatInfo.AMDesignator nebo DateTimeFormatInfo.PMDesignator aktuální nebo konkrétní jazykové verze. Údaj dop se používá pro časy od 0:00:00 (půlnoc) do 11:59:59.999. Údaj odp se používá pro časy od 12:00:00 (poledne) do 23:59:59.999. Pokud se specifikátor formátu t použije bez dalších vlastních specifikátorů formátu, interpretuje se jako standardní specifikátor formátu data a času t.
de: Der benutzerdefinierte Formatbezeichner "t" repräsentiert das erste Zeichen des AM/PM-Kennzeichners. Der geeignete lokalisierte Kennzeichner wird aus der DateTimeFormatInfo.AMDesignator- oder DateTimeFormatInfo.PMDesignator-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen. Der AM-Kennzeichner wird für alle Uhrzeiten von 0:00:00 (Mitternacht) bis 11:59:59.999 verwendet. Der PM-Kennzeichner wird für alle Uhrzeiten von 12:00:00 (Mittag) bis 23:59:59.999 verwendet. Bei Verwendung des Formatbezeichners "t" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "t" für Datum und Uhrzeit interpretiert.
es: El especificador de formato personalizado "t" representa el primer carácter del designador AM/PM. Se recupera el designador adaptado apropiado de la propiedad DateTimeFormatInfo.AMDesignator o DateTimeFormatInfo.PMDesignator de la referencia cultural actual o específica. El designador AM se usa para todas las horas de 0:00:00 (medianoche) a 11:59:59.999. El designador PM se usa para todas las horas de 12:00:00 (mediodía) a 23:59:59.999. Si el especificador de formato "t" se usa sin otros especificadores de formato personalizado, se interpreta como el especificador de formato de fecha y hora estándar "t".
fr: Le spécificateur de format personnalisé "t" représente le premier caractère du désignateur AM/PM. Le désignateur localisé approprié est récupéré à partir de la propriété DateTimeFormatInfo.AMDesignator ou DateTimeFormatInfo.PMDesignator de la culture actuelle ou spécifique. Le désignateur AM est utilisé pour toutes les heures comprises entre 0:00:00 (minuit) et 11:59:59.999. Le désignateur PM est utilisé pour toutes les heures comprises entre 12:00:00 (midi) et 23:59:59.999. Si le spécificateur de format "t" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "t".
it: L'identificatore di formato personalizzato "t" rappresenta il primo carattere dell'indicatore AM/PM. L'indicatore localizzato appropriato viene recuperato dalla proprietà DateTimeFormatInfo.AMDesignator o DateTimeFormatInfo.PMDesignator delle impostazioni cultura correnti o specificate. L'indicatore AM viene usato per tutti gli orari compresi tra 0:00:00 (mezzanotte) e 11:59:59.999. L'indicatore PM viene usato per tutti gli orari compresi tra 12:00:00 (mezzogiorno) e 23:59:59.999. Se l'identificatore di formato "t" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato data e ora standard "t".
ja: "t" カスタム書式指定子は、AM/PM 指定子の最初の文字を表します。ローカライズされた適切な指定子は、現在または特定のカルチャの DateTimeFormatInfo.AMDesignator または DateTimeFormatInfo.PMDesignator プロパティから取得されます。AM 指定子は、0:00:00 (深夜) から 11:59:59.999 までのすべての時刻に使用されます。PM 指定子は、12:00:00 (正午) から 23:59:59.999 までのすべての時刻に使用されます。 "t" 書式指定子がその他のカスタム書式指定子なしで使用されている場合、"t" 標準日時書式指定子として解釈されます。
ko: "t" 사용자 지정 형식 지정자는 AM/PM 지정자의 첫 번째 문자를 나타냅니다. 지역화된 적절한 지정자는 현재 문화권 또는 특정 문화권의 DateTimeFormatInfo.AMDesignator 또는 DateTimeFormatInfo.PMDesignator 속성에서 검색됩니다. AM 지정자는 0:00:00(자정)부터 11:59:59.999까지의 모든 시간에 사용됩니다. PM 지정자는 12:00:00(정오)부터 23:59:59.999까지의 모든 시간에 사용됩니다. 다른 사용자 지정 형식 지정자 없이 "t" 형식 지정자를 사용하면 "t" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Indywidualny specyfikator formatu „t” reprezentuje pierwszą literę oznaczenia AM/PM. Odpowiednie zlokalizowane oznaczenie jest pobierane z właściwości DateTimeFormatInfo.AMDesignator lub DateTimeFormatInfo.PMDesignator bieżącej lub określonej kultury. Oznaczenie AM jest używane dla wszystkich godzin od 0:00:00 (północ) do 11:59:59,999. Oznaczenie PM jest używane dla wszystkich godzin od 12:00:00 (południe) do 23:59:59,999. Jeśli specyfikator formatu „t” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny „t”.
pt_br: O especificador de formato personalizado "t" representa o primeiro caractere do designador AM/PM. O designador localizado apropriado é recuperado da propriedade DateTimeFormatInfo.AMDesignator ou DateTimeFormatInfo.PMDesignator da cultura atual ou específica. O designador AM é usado para todos os horários de 0:00:00 (meia-noite) até 11:59:59.999. O designador PM é usado para todos os horários de 12:00:00 (meio-dia) para 23:59:59.999. Se o especificador de formato "t" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "t".
ru: Описатель пользовательского формата "t" представляет первый символ указателя AM/PM. Соответствующий локализованный указатель извлекается из свойства DateTimeFormatInfo.AMDesignator или DateTimeFormatInfo.PMDesignator текущих или заданных языка и региональных параметров. Указатель AM используется для всех значений времени с 0:00:00 (полночь) до 11:59:59,999. Указатель PM используется для всех значений времени с 12:00:00 (полдень) до 23:59:59,999. Если описатель формата "t" используется без других описателей пользовательского формата, он интерпретируется как описатель "t" стандартного формата даты и времени.
tr: "t" özel biçim belirticisi, AM/PM belirleyicisinin ilk karakterini temsil eder. Uygun yerelleştirilmiş belirleyici, geçerli veya belirli bir kültürün DateTimeFormatInfo.AMDesignator ya da DateTimeFormatInfo.PMDesignator özelliğinden alınır. AM belirleyicisi, 0:00:00 (gece yarısı) ile 11:59:59.999 arasındaki tüm saatler için kullanılır. PM göstergesi, 12:00:00 (öğlen) ile 23:59:59.999 arasındaki tüm saatler için kullanılır. "t" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçimi belirticisi olarak yorumlanır.
zh_hans: "T" 自定义格式说明符表示 AM/PM 指示符的第一个字符。相应的本地化指示符从当前或特定区域性的 DateTimeFormatInfo.AMDesignator 或 DateTimeFormatInfo.PMDesignator 属性中进行检索。AM 指示符用于指示从 0:00:00 (午夜)到 11:59:59.999 的所有时间。PM 指示符用于指示从 12:00:00 (中午)到 23:59:59.999 的所有时间。 如果使用 "t" 格式说明符而未使用其他自定义格式说明符，则该说明符将被解释为 "t" 标准日期和时间格式说明符。
zh_hant: "t" 自訂格式規範代表 AM/PM 指示項的第一個字元。系統會從目前文化特性或特定文化特性的 DateTimeFormatInfo.AMDesignator 或 DateTimeFormatInfo.PMDesignator 屬性，擷取適當的當地語系化指示項。AM 指示項用來表示從 0:00:00 (午夜) 到 11:59:59.999 的所有時間。PM 指示項用來表示從 12:00:00 (中午) 到 23:59:59.999 的所有時間。 如果在使用 "t" 格式規範時沒有其他自訂格式規範，則會將其解譯為 "t" 標準日期與時間格式規範。

source: AM/PM (full)
cs: AM/PM (úplné)
de: AM/PM (vollständig)
es: a.m./p.m. (completo)
fr: AM/PM (complet)
it: AM/PM (esteso)
ja: AM/PM (完全)
ko: AM/PM(전체)
pl: AM/PM (pełne oznaczenie)
pt_br: AM/PM (completo)
ru: AM/PM (полностью)
tr: AM/PM (tam)
zh_hans: AM/PM(完整)
zh_hant: AM/PM (完整)

# AM_PM_full_description
source: The "tt" custom format specifier (plus any number of additional "t" specifiers) represents the entire AM/PM designator. The appropriate localized designator is retrieved from the DateTimeFormatInfo.AMDesignator or DateTimeFormatInfo.PMDesignator property of the current or specific culture. The AM designator is used for all times from 0:00:00 (midnight) to 11:59:59.999. The PM designator is used for all times from 12:00:00 (noon) to 23:59:59.999. Make sure to use the "tt" specifier for languages for which it's necessary to maintain the distinction between AM and PM. An example is Japanese, for which the AM and PM designators differ in the second character instead of the first character.
cs: Specifikátor vlastního formátu tt (a jakýkoli počet dalších specifikátorů t) představuje celý údaj dop/odp. Správný lokalizovaný údaj se načítá z vlastnosti DateTimeFormatInfo.AMDesignator nebo DateTimeFormatInfo.PMDesignator aktuální nebo konkrétní jazykové verze. Údaj dop se používá pro časy od 0:00:00 (půlnoc) do 11:59:59.999. Údaj odp se používá pro časy od 12:00:00 (poledne) do 23:59:59.999. Ujistěte se, že specifikátor tt použijete pro jazyky, pro které je nezbytné zachovat rozlišení mezi dop a odp. Příkladem může být japonština, pro kterou se údaje dop a odp liší namísto prvního znaku ve znaku sekundy.
de: Der benutzerdefinierte Formatbezeichner "tt" (plus beliebig viele zusätzliche t-Bezeichner) repräsentiert den vollständigen AM/PM-Kennzeichner. Der geeignete lokalisierte Kennzeichner wird aus der DateTimeFormatInfo.AMDesignator- oder DateTimeFormatInfo.PMDesignator-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen. Der AM-Kennzeichner wird für alle Uhrzeiten von 0:00:00 (Mitternacht) bis 11:59:59.999 verwendet. Der PM-Kennzeichner wird für alle Uhrzeiten von 12:00:00 (Mittag) bis 23:59:59.999 verwendet. Stellen Sie sicher, dass Sie den Bezeichner "tt" für Sprachen verwenden, für die eine Unterscheidung zwischen AM und PM erforderlich ist. Ein Beispiel ist Japanisch, bei dem sich die AM- und PM-Kennzeichner durch das zweite Zeichen anstelle des ersten Zeichens unterscheiden.
es: El especificador de formato personalizado "tt" (más cualquier número de especificadores "t" adicionales) representa el designador AM/PM completo. Se recupera el designador adaptado apropiado de la propiedad DateTimeFormatInfo.AMDesignator o DateTimeFormatInfo.PMDesignator de la referencia cultural actual o específica. El designador AM se usa para todas las horas de 0:00:00 (medianoche) a 11:59:59.999. El designador PM se usa para todas las horas de 12:00:00 (mediodía) a 23:59:59.999. Asegúrese de usar el especificador "tt" para los idiomas para los que es necesario mantener la distinción entre AM y PM. Un ejemplo es el japonés, para el que los designadores AM y PM difieren en el segundo carácter en lugar de en el primer carácter.
fr: Le spécificateur de format personnalisé "tt" (plus n'importe quel nombre de spécificateurs "t" supplémentaires) représente l'intégralité du désignateur AM/PM. Le désignateur localisé approprié est récupéré à partir de la propriété DateTimeFormatInfo.AMDesignator ou DateTimeFormatInfo.PMDesignator de la culture actuelle ou spécifique. Le désignateur AM est utilisé pour toutes les heures comprises entre 0:00:00 (minuit) et 11:59:59.999. Le désignateur PM est utilisé pour toutes les heures comprises entre 12:00:00 (midi) et 23:59:59.999. Veillez à utiliser le spécificateur "tt" pour les langues où il est nécessaire de maintenir la distinction entre AM et PM. Par exemple, en japonais, les désignateurs AM et PM diffèrent au niveau du second caractère au lieu du premier.
it: L'identificatore di formato personalizzato "tt" (più qualsiasi numero di identificatori "t" aggiuntivi) rappresenta l'indicatore AM/PM completo. L'indicatore localizzato appropriato viene recuperato dalla proprietà DateTimeFormatInfo.AMDesignator o DateTimeFormatInfo.PMDesignator delle impostazioni cultura correnti o specificate. L'indicatore AM viene usato per tutti gli orari compresi tra 0:00:00 (mezzanotte) e 11:59:59.999. L'indicatore PM viene usato per tutti gli orari compresi tra 12:00:00 (mezzogiorno) e 23:59:59.999. Assicurarsi di usare l'identificatore "tt" per le lingue per le quali è necessario mantenere la distinzione tra AM e PM. Un esempio è la lingua giapponese, in cui gli indicatori AM e PM sono diversi nel secondo carattere anziché nel primo.
ja: "tt" カスタム書式指定子 (任意の数の "t" 指定子を追加できます) は、AM/PM 指定子全体を表します。ローカライズされた適切な指定子は、現在または特定のカルチャの DateTimeFormatInfo.AMDesignator または DateTimeFormatInfo.PMDesignator プロパティから取得されます。AM 指定子は、0:00:00 (深夜) から 11:59:59.999 までのすべての時刻に使用されます。PM 指定子は、12:00:00 (正午) から 23:59:59.999 までのすべての時刻に使用されます。 "tt" 指定子は、AM と PM を区別するためにこれが必要な言語でお使いください。たとえば、日本語の場合、AM と PM の指定子は、最初の文字ではなく、2 番目の文字が異なります。
ko: "tt" 사용자 지정 형식 지정자(및 임의 개수의 추가 "t" 지정자)는 전체 AM/PM 지정자를 나타냅니다. 지역화된 적절한 지정자는 현재 문화권 또는 특정 문화권의 DateTimeFormatInfo.AMDesignator 또는 DateTimeFormatInfo.PMDesignator 속성에서 검색됩니다. AM 지정자는 0:00:00(자정)부터 11:59:59.999까지의 모든 시간에 사용됩니다. PM 지정자는 12:00:00(정오)부터 23:59:59.999까지의 모든 시간에 사용됩니다. "tt" 지정자는 AM과 PM 사이의 구분을 유지해야 하는 언어에 사용해야 합니다. 그 예로 일본어를 들 수 있는데, 일본어에서는 AM 지정자와 PM 지정자가 첫 번째 문자가 아닌 두 번째 문자에서 구분됩니다.
pl: Indywidualny specyfikator formatu „tt” (wraz z dowolną liczbą dodatkowych specyfikatorów „t”) reprezentuje całe oznaczenie AM/PM. Odpowiednie zlokalizowane oznaczenie jest pobierane z właściwości DateTimeFormatInfo.AMDesignator lub DateTimeFormatInfo.PMDesignator bieżącej lub określonej kultury. Oznaczenie AM jest używane dla wszystkich godzin od 0:00:00 (północ) do 11:59:59,999. Oznaczenie PM jest używane dla wszystkich godzin od 12:00:00 (południe) do 23:59:59,999. Pamiętaj, aby nie używać specyfikatora „tt” dla wszystkich języków, w których konieczne jest zachowanie rozróżnienia między godzinami AM a PM. Przykładem jest tutaj język japoński, w którym różnice w oznaczeniach AM i PM występują w drugim znaku a nie pierwszym.
pt_br: O especificador de formato personalizado "tt" (mais qualquer número de especificadores "t" adicionais) representa todo o designador AM/PM. O designador localizado apropriado é recuperado da propriedade DateTimeFormatInfo.AMDesignator ou DateTimeFormatInfo.PMDesignator da cultura atual ou específica. O designador AM é usado para todos os horários de 0:00:00 (meia-noite) até 11:59:59.999. O designador PM é usado para todos os horários de 12:00:00 (meio-dia) até 23:59:59.999. Verifique se o especificador "tt" foi usado para idiomas para os quais é necessário manter a distinção entre AM e PM. Um exemplo é o japonês, para o qual os designadores AM e PM diferem no segundo caractere, em vez de no primeiro caractere.
ru: Описатель пользовательского формата "tt" (плюс любое число дополнительных описателей "t") представляет весь указатель AM/PM. Соответствующий локализованный указатель извлекается из свойства DateTimeFormatInfo.AMDesignator или DateTimeFormatInfo.PMDesignator текущих или заданных языка и региональных параметров. Указатель AM используется для всех значений времени с 0:00:00 (полночь) до 11:59:59,999. Указатель PM используется для всех значений времени с 12:00:00 (полдень) до 23:59:59,999. Используйте описатель "tt" для языков, где необходимо сохранить различие между AM и PM. В качестве примера можно привести японский язык, в котором указатели AM и PM различаются вторым, а не первым символом.
tr: "tt" özel biçim belirticisi (ve herhangi bir sayıda ek "t" belirticisi), AM/PM belirleyicisini tümüyle temsil eder. Uygun yerelleştirilmiş belirleyici, geçerli veya belirli bir kültürün DateTimeFormatInfo.AMDesignator ya da DateTimeFormatInfo.PMDesignator özelliğinden alınır. AM göstergesi, 0:00:00 (gece yarısı) ile 11:59:59.999 arasındaki tüm saatler için kullanılır. PM göstergesi, 12:00:00 (öğlen) ile 23:59:59.999 arasındaki tüm saatler için kullanılır. AM ve PM arasındaki farkın korunmasının gerekli olduğu diller için "tt" belirticisini kullandığınızdan emin olun. Buna bir örnek, AM ve PM belirleyicilerinin ilk karakter yerine ikinci karakterde farklı olduğu Japoncadır.
zh_hans: "tt" 自定义格式说明符(另加任意数量的其他 "t" 说明符)表示整个 AM/PM 指示符。相应的本地化指示符从当前或特定区域性的 DateTimeFormatInfo.AMDesignator 或 DateTimeFormatInfo.PMDesignator 属性中进行检索。AM 指示符用于指示从 0:00:00(午夜)到 11:59:59.999 的所有时间。PM 指示符用于指示从 12:00:00 (中午)到 23:59:59.999 的所有时间。 请确保对需要维护 AM 和 PM 之间的差异的语言使用 "tt" 说明符。例如日语，其 AM 和 PM 指示符在第二个字符(而不是第一个字符)会不同。
zh_hant: "tt" 自訂格式規範 (加上任意數目的其他 "t" 規範) 代表整個 AM/PM 指示項。系統會從目前文化特性或特定文化特性的 DateTimeFormatInfo.AMDesignator 或 DateTimeFormatInfo.PMDesignator 屬性，擷取適當的當地語系化指示項。AM 指示項用來表示從 0:00:00 (午夜) 到 11:59:59.999 的所有時間。PM 指示項用來表示從 12:00:00 (中午) 到 23:59:59.999 的所有時間。 對於需要保有 AM 與 PM 之間區別的語言來說，請務必對該語言使用 "tt" 規範。以日文為例，其 AM 和 PM 指示項是第二個字元不同，而非第一個字元不同。

source: A subtraction must be the last element in a character class
cs: Odčítání musí být posledním prvkem ve třídě znaků.
de: Eine Subtraktion muss das letzte Element in einer Zeichenklasse sein.
es: Una sustracción debe ser el último elemento de una clase de caracteres
fr: Une soustraction doit être le dernier élément dans une classe de caractères
it: L'ultimo elemento di una classe di caratteri deve essere una sottrazione
ja: 減算は、文字クラスの最後の要素でなければなりません
ko: 빼기는 문자 클래스의 마지막 요소여야 합니다.
pl: Odejmowanie musi być ostatnim elementem w klasie znaków
pt_br: Uma subtração deve ser o último elemento em uma classe de caracteres
ru: Вычитание должно быть последним элементом в классе символов
tr: Bir çıkarma bir karakter sınıfı içinde son öğe olması gerekir
zh_hans: 负号必须是字符类中的最后一个元素
zh_hant: 減法必須是字元類別中的最後一個元素

source: Add 'DebuggerDisplay' attribute
cs: Přidat atribut DebuggerDisplay
de: DebuggerDisplay-Attribut hinzufügen
es: Agregar atributo de "DebuggerDisplay"
fr: Ajouter l'attribut 'DebuggerDisplay'
it: Aggiungi l'attributo 'DebuggerDisplay'
ja: 'DebuggerDisplay' 属性の追加
ko: 'DebuggerDisplay' 특성을 추가합니다.
pl: Dodaj atrybut "DebuggerDisplay"
pt_br: Adicionar atributo 'DebuggerDisplay'
ru: Добавить атрибут "DebuggerDisplay"
tr: 'DebuggerDisplay' özniteliği ekle
zh_hans: 添加 "DebuggerDisplay" 属性
zh_hant: 新增 'DebuggerDisplay' 屬性

source: Add null checks for all parameters
cs: Přidat kontroly hodnot null u všech parametrů
de: NULL-Überprüfungen für alle Parameter hinzufügen
es: Agregar comprobaciones de valores NULL para todos los parámetros
fr: Ajouter des vérifications de valeur null pour tous les paramètres
it: Aggiungi controlli Null per tutti i parametri
ja: すべてのパラメーターに対して null チェックを追加する
ko: 모든 매개 변수에 대한 null 검사 추가
pl: Dodaj sprawdzenia wartości null dla wszystkich parametrów
pt_br: Adicionar verificações nulas para todos os parâmetros
ru: Добавление проверки NULL для всех параметров
tr: Tüm parametreler için null denetimi ekle
zh_hans: 为所有参数添加 null 检查
zh_hant: 為所有參數新增 null 檢查

source: Add optional parameter to constructor
cs: Přidat volitelný parametr do konstruktoru
de: Optionalen Parameter zum Konstruktor hinzufügen
es: Agregar parámetro opcional al constructor
fr: Ajouter un paramètre optionnel au constructeur
it: Aggiungi il parametro facoltativo al costruttore
ja: 省略可能なパラメーターをコンストラクターに追加する
ko: 생성자에 선택적 매개 변수 추가
pl: Dodaj opcjonalny parametr do konstruktora
pt_br: Adicionar parâmetro opcional ao construtor
ru: Добавить необязательный параметр в конструктор
tr: Oluşturucuya isteğe bağlı parametre ekle
zh_hans: 将可选参数添加到构造函数
zh_hant: 將選擇性參數新增至建構函式

source: Add parameter to constructor
cs: Přidat parametr do konstruktoru
de: Parameter zum Konstruktor hinzufügen
es: Agregar parámetro al constructor
fr: Ajouter un paramètre au constructeur
it: Aggiungi il parametro al costruttore
ja: パラメーターをコンストラクターに追加する
ko: 생성자에 매개 변수 추가
pl: Dodaj parametr do konstruktora
pt_br: Adicionar parâmetro ao construtor
ru: Добавить параметр в конструктор
tr: Oluşturucuya parametre ekle
zh_hans: 将参数添加到构造函数
zh_hant: 將參數新增至建構函式

source: Add project reference to '{0}'.
cs: Přidat odkaz na projekt do {0}
de: Fügen Sie zu "{0}" einen Projektverweis hinzu.
es: Agregue referencia de proyecto a '{0}'.
fr: Ajoutez une référence de projet à '{0}'.
it: Aggiunge il riferimento al progetto a '{0}'.
ja: プロジェクト参照を '{0}' に追加します。
ko: 프로젝트 참조를 '{0}'에 추가합니다.
pl: Dodaj odwołanie do projektu do elementu „{0}”
pt_br: Adicione referência de projeto a "{0}".
ru: Добавьте ссылку на проект в "{0}".
tr: '{0}' üzerine proje başvurusu ekleyin.
zh_hans: 添加到“{0}”的项目引用。
zh_hant: 加入對 '{0}' 的專案參考。

source: Add reference to '{0}'.
cs: Přidat odkaz do {0}
de: Fügen Sie zu "{0}" einen Verweis hinzu.
es: Agregue referencia a '{0}'.
fr: Ajoutez une référence à '{0}'.
it: Aggiunge il riferimento a '{0}'.
ja: 参照を '{0}' に追加します。
ko: 참조를 '{0}'에 추가합니다.
pl: Dodaj odwołanie do elementu „{0}”
pt_br: Adicione referência a "{0}".
ru: Добавьте ссылку в "{0}".
tr: '{0}' üzerine başvuru ekleyin.
zh_hans: 添加到“{0}”的引用。
zh_hant: 加入對 '{0}' 的參考。

source: Actions can not be empty.
cs: Akce nemůžou zůstat prázdné.
de: Aktionen dürfen nicht leer sein.
es: Las acciones no pueden estar vacías.
fr: Les actions ne peuvent pas être vides.
it: Il campo Azioni non può essere vuoto.
ja: アクションは空にできません。
ko: 작업은 비워 둘 수 없습니다.
pl: Akcje nie mogą być puste.
pt_br: Ações não podem ficar vazias.
ru: Действия не могут быть пустыми.
tr: Eylemler boş olamaz.
zh_hans: 操作不能为空。
zh_hant: 動作不可為空。

source: Add tuple element name '{0}'
cs: Přidat název elementu řazené kolekce členů {0}
de: Tupelelementnamen "{0}" hinzufügen
es: Agregar el nombre del elemento de tupla "{0}"
fr: Ajouter le nom d'élément tuple '{0}'
it: Aggiungi il nome dell'elemento tupla '{0}'
ja: タプル要素名 '{0}' を追加します
ko: 튜플 요소 이름 '{0}' 추가
pl: Dodaj nazwę elementu krotki „{0}”
pt_br: Adicionar o nome do elemento de tupla '{0}'
ru: Добавить имя элемента кортежа "{0}"
tr: '{0}' demet öğesi adını ekle
zh_hans: 添加元组元素名称 "{0}"
zh_hant: 新增元組元素名稱 ‘{0}’

source: Adding {0} around an active statement requires restarting the application.
cs: Přidání {0} kolem aktivního příkazu vyžaduje restartování aplikace.
de: Das Hinzufügen von {0} um eine aktive Anweisung erfordert einen Neustart der Anwendung.
es: Para agregar {0} alrededor de una instrucción de acción es necesario reiniciar la aplicación.
it: Se si aggiunge {0} all'inizio di un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントの前後に {0} を追加するには、アプリケーションを再起動する必要があります。
ko: 활성 문 주위에 {0}을(를) 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodawanie elementu {0} wokół aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar {0} em torno de uma instrução ativa requer a reinicialização do aplicativo.
ru: Для добавления {0} вокруг активного оператора требуется перезапустить приложение.
tr: Etkin bir deyim etrafında bir {0} öğesinin eklenmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在活动语句周围添加 {0} 需要重新启动应用程序。

source: Adding {0} into a {1} requires restarting the application.
de: Das Hinzufügen von {0} zu einer {1} erfordert einen Neustart der Anwendung.
it: Se si aggiunge {0} in un elemento {1}, è necessario riavviare l'applicazione.
ja: {0} を {1} に追加するには、アプリケーションを再起動する必要があります。
tr: {1} öğesine {0} eklemek, uygulamanın yeniden başlatılmasını gerektir.
zh_hans: 将 {0} 添加进 {1} 中需要重新启动应用程序。

source: Adding {0} into a class with explicit or sequential layout requires restarting the application.
de: Das Hinzufügen von {0} zu einer Klasse mit explizitem oder sequenziellem Layout erfordert einen Neustart der Anwendung.
it: Se si aggiunge {0} in una classe con layout esplicito o sequenziale, è necessario riavviare l'applicazione.
ja: 明示的またはシーケンシャルなレイアウトのクラスに {0} を追加するには、アプリケーションを再起動する必要があります。
tr: Açık veya sıralı düzene sahip bir sınıfa {0} eklemek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将 {0} 添加到具有显式或顺序布局的类中需要重新启动应用程序。
