Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: 12 hour clock (2 digits)
cs: 12hodinový formát (2 číslice)
de: 12-Stunden-Format (2 Stellen)
es: Reloj de 12 horas (2 dígitos)
fr: Horloge de 12 heures (2 chiffres)
it: Orario in formato 12 ore (2 cifre)
ja: 12 時間制 (2 桁)
ko: 12시간제(2자리)
pl: Zegar 12-godzinny (2 cyfry)
pt_br: Relógio de 12 horas (2 dígitos)
ru: 12-часовой формат времени (2 цифры)
tr: 12 saatlik düzen (2 rakam)
zh_hans: 12 小时制(2 位数)
zh_hant: 12 小時制 (2 位數)

# _12_hour_clock_2_digits_description
source: The "hh" custom format specifier (plus any number of additional "h" specifiers) represents the hour as a number from 01 through 12; that is, the hour is represented by a 12-hour clock that counts the whole hours since midnight or noon. A particular hour after midnight is indistinguishable from the same hour after noon. The hour is not rounded, and a single-digit hour is formatted with a leading zero. For example, given a time of 5:43 in the morning or afternoon, this format specifier displays "05".
cs: Specifikátor vlastního formátu hh (a libovolný počet dalších specifikátorů h) reprezentuje hodinu jako číslo od 01 do 12. To znamená, že hodina je reprezentována ve 12hodinovém formátu, který počítá celé hodiny od půlnoci do poledne. Konkrétní hodina po půlnoci se nijak neliší od stejné hodiny po poledni. Hodina se nezaokrouhluje a jednočíselná hodina se formátuje s nulou na začátku. Když je například ráno nebo odpoledne 5:43, tento specifikátor vlastního formátu zobrazí 05.
de: Der benutzerdefinierte Formatbezeichner "hh" (plus beliebig viele zusätzliche h-Bezeichner) repräsentiert die Stunde als eine Zahl zwischen 01 und 12, d. h., die Stunde wird in einem 12-Stunden-Format dargestellt, bei dem die ganzen Stunden seit Mitternacht oder Mittag gezählt werden. Eine bestimmte Stunde nach Mitternacht ist nicht von der gleichen Stunde nach Mittag unterscheidbar. Der Stundenwert wird nicht gerundet, und ein einstelliger Stundenwert wird mit einer führenden Null formatiert. Beispielsweise zeigt dieser benutzerdefinierte Formatbezeichner bei der Uhrzeit 5:43 morgens oder nachmittags den Wert "05" an.
es: El especificador de formato personalizado "hh" (más cualquier número de especificadores "h" adicionales) representa la hora como un número de 01 al 12, es decir, mediante un reloj de 12 horas que cuenta las horas enteras desde la medianoche o el mediodía. Una hora determinada después de la medianoche no se distingue de la misma hora después del mediodía. La hora no se redondea y el formato de una hora de un solo dígito es con un cero inicial. Por ejemplo, a las 5:43 de la mañana o de la tarde, este especificador de formato muestra "05".
fr: Le spécificateur de format personnalisé "hh" (plus n'importe quel nombre de spécificateurs "h" supplémentaires) représente les heures sous la forme d'un nombre compris entre 01 et 12. En d'autres termes, les heures sont représentées par une horloge de 12 heures qui compte les heures entières écoulées depuis minuit ou midi. Vous ne pouvez pas différencier une heure particulière après minuit et la même heure après midi. L'heure n'est pas arrondie, et une heure à un chiffre est présentée dans un format qui comporte un zéro de début. Par exemple, s'il est 5:43 du matin ou de l'après-midi, le spécificateur de format personnalisé affiche "05".
it: L'identificatore di formato personalizzato "hh" (più qualsiasi numero di identificatori "h" aggiuntivi) rappresenta l'ora come numero compreso tra 01 e 12, ovvero l'ora rappresentata nell'orario in formato 12 ore in base al quale il conteggio riparte da mezzanotte o da mezzogiorno. Una particolare ora dopo mezzanotte non è distinguibile dalla stessa ora dopo mezzogiorno. L'ora non viene arrotondata e se è costituita da una singola cifra viene formattata con uno zero iniziale. Se viene, ad esempio, specificata un'ora equivalente alle 5:43 della mattina o del pomeriggio, tramite questo identificatore di formato viene visualizzato "05".
ja: "hh" カスタム書式指定子 (任意の数の "h" 指定子を追加できます) は、時を 01 から 12 の数字で表します。つまり、午前 0 時または午後 0 時からの時間をカウントする 12 時間制で時が表されます。午前 0 時からカウントした特定の時は、正午からカウントした同じ時と区別できません。時は丸められず、1 桁の時は先行ゼロ付きで書式設定されます。たとえば、午前または午後の 5:43 という時刻の場合、この書式指定子では "05" が表示されます。
ko: "hh" 사용자 지정 형식 지정자(및 임의 개수의 추가 "h" 지정자)는 시간을 01부터 12까지의 숫자로 나타냅니다. 즉, 시간은 자정 또는 정오부터 경과한 정수 시간을 계산하는 12시간제로 표현됩니다. 자정 이후의 특정 시간은 정오 이후의 동일한 시간과 구분되지 않습니다. 시간은 반올림되지 않으며, 한 자릿수 시간은 앞에 0이 있는 형식으로 지정됩니다. 예를 들어, 오전 또는 오후 5:43이라는 시간이 지정되면 이 형식 지정자는 "05"를 표시합니다.
pl: Indywidualny specyfikator formatu „hh” (wraz z dowolną liczbą dodatkowych specyfikatorów „h”) reprezentuje godzinę jako liczbę z zakresu od 01 do 12; tzn. godzina jest reprezentowana przez 12-godzinny zegar liczący pełne godziny od północy lub południa. Określona godzina po północy jest nie do odróżnienia od tej samej godziny po południu. Godzina nie jest zaokrąglana, a godzina 1-cyfrowa jest wyświetlana w formacie z wiodącym zerem. Na przykład w przypadku godziny 5:43 rano lub po południu ten specyfikator formatu wyświetla wartość „05”.
pt_br: O especificador de formato personalizado "hh" (mais qualquer número de especificadores "h" adicionais) representa a hora como um número de 01 a 12. Ou seja, a hora é representada por um relógio de 12 horas que conta todas as horas desde a meia-noite ou o meio-dia. Uma determinada hora após a meia-noite é indistinguível da mesma hora após o meio-dia. A hora não é arredondada e uma hora de dígito único é formatada com um zero à esquerda. Por exemplo, dado um horário de 5:43 na manhã ou à tarde, esse especificador de formato exibe "05".
ru: Описатель пользовательского формата "hh" (плюс любое число дополнительных описателей "h") представляет час в виде числа от 01 до 12, то есть час представлен в 12-часовом формате, который подсчитывает целые часы, начиная с полуночи или с полудня. Определенный час после полуночи невозможно отличить от такого же часа после полудня. Значение часа не округляется, а значение часа из одной цифры форматируется с начальным нулем. Например, для времени 5:43 утра или вечера этот описатель формата выводит "05".
tr: "hh" özel biçim belirticisi (ve herhangi bir sayıda ek "h" belirticisi) saati 01 ile 12 arasında bir sayı ile temsil eder; yani saat, gece yarısı veya öğleden bu yana geçen saat sayısını belirten 12 saatlik bir düzen ile gösterilir. Gece yarısından sonraki belirli bir saat, öğleden sonraki aynı saatten ayırt edilemez. Saat yuvarlanmaz ve tek haneli bir saat başına sıfır eklenerek biçimlendirilir. Örneğin, sabah veya öğleden sonra saat 5:43 için bu biçim belirticisi "05" görüntüler.
zh_hans: "hh" 自定义格式说明符(另加任意数量的其他 "h" 说明符)将小时表示为从 01 到 12 的数字；即通过 12 小时制表示小时，因此，午夜后经过的某特定小时数与中午过后的相同小时数无法加以区分。小时数不进行舍入，一位数字的小时数设置为带前导零的格式。例如，给定上午或下午时间为 5:43，则此格式说明符显示为 "05"。
zh_hant: "hh" 自訂格式規範 (加上任意數目的其他 "h" 規範) 代表小時，以數字 01 到 12 表示; 換句話說，小時即為自午夜或中午起所經過的整數時數，是 12 小時制。午夜後經過特定小時數與中午後經過相同的小時數，會無法區別。小時不會四捨五入，而單一數字的小時格式，開頭不會出現零。例如，假設時間為上午或下午的 5:43，此自訂格式規範會顯示 "05"。

source: 24 hour clock (1-2 digits)
cs: 24hodinový formát (1–2 číslice)
de: 24-Stunden-Format (1–2 Stellen)
es: Reloj de 24 horas (1-2 dígitos)
fr: Horloge de 24 heures (1 à 2 chiffres)
it: Orario in formato 24 ore (1-2 cifre)
ja: 24 時間制 (1 - 2 桁)
ko: 24시간제(1~2자리)
pl: Zegar 24-godzinny (1–2 cyfr)
pt_br: Relógio de 24 horas (1-2 dígitos)
ru: 24-часовой формат времени (1–2 цифры)
tr: 24 saatlik düzen (1-2 rakam)
zh_hans: 24 小时制(1-2 位数)
zh_hant: 24 小時制 (1-2 位數)

# _24_hour_clock_1_2_digits_description
source: The "H" custom format specifier represents the hour as a number from 0 through 23; that is, the hour is represented by a zero-based 24-hour clock that counts the hours since midnight. A single-digit hour is formatted without a leading zero. If the "H" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: Specifikátor vlastního formátu H reprezentuje hodinu jako číslo od 0 do 23. To znamená, že hodina je reprezentována ve 24hodinovém formátu, který začíná na nule a počítá hodiny od půlnoci. Hodina s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu H použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a čas a vyvolá FormatException.
de: Der benutzerdefinierte Formatbezeichner "H" repräsentiert die Stunde als eine Zahl zwischen 0 und 23, d. h., die Stunde wird in einem nullbasierten 24-Stunden-Format dargestellt, bei dem die Stunden seit Mitternacht gezählt werden. Ein einstelliger Stundenwert wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "H" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner für Datum und Uhrzeit interpretiert und löst eine FormatException aus.
es: El especificador de formato personalizado "H" representa la hora como un número del 0 al 23; es decir, la hora se representa mediante un reloj de 24 horas de base cero que cuenta las horas desde la medianoche. Una hora con un solo dígito tiene un formato sin un cero inicial. Si el especificador de formato "H" se usa sin otros especificadores de formato personalizado, se interpreta como un especificador de formato de fecha y hora estándar y produce una excepción FormatException.
fr: Le spécificateur de format personnalisé "H" représente l'heure sous la forme d'un nombre compris entre 0 et 23. En d'autres termes, l'heure est représentée par une horloge de 24 heures de base zéro, qui compte les heures entières depuis minuit. Une heure à un chiffre est présentée dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "H" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: L'identificatore di formato personalizzato "H" rappresenta l'ora come numero compreso tra 0 e 23, ovvero l'ora rappresentata nell'orario in formato 24 ore a base zero in base al quale il conteggio riparte da mezzanotte. Un'ora costituita da una singola cifra viene formattata senza zero iniziale. Se l'identificatore di formato "H" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: "H" カスタム書式指定子は、時を 0 から 23 の数字として表します。つまり、午前 0 時からの時間をカウントする、ゼロから始まる 24 時間制で時が表されます。1 桁の時は、先行ゼロなしで書式設定されます。 "H" 書式指定子を他のカスタム書式指定子なしで使用すると、標準日時書式指定子として解釈され、FormatException がスローされます。
ko: "H" 사용자 지정 형식 지정자는 시간을 0부터 23까지의 숫자로 나타냅니다. 즉, 시간은 자정부터 경과한 시간을 계산하는 0 기반 24시간제로 표현됩니다. 한 자릿수 시간은 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "H" 형식 지정자를 사용하면 표준 날짜 및 시간 형식 지정자로 해석되어 FormatException을 throw합니다.
pl: Indywidualny specyfikator formatu „H” reprezentuje godzinę jako liczbę z zakresu od 0 do 23; tzn. godzina jest reprezentowana przez 24-godzinny zegar zaczynający się od zera i liczący godziny od północy lub południa. Godzina 1-cyfrowa jest wyświetlana w formacie bez wiodącego zera. Jeśli specyfikator formatu „H” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny i zwróci wyjątek FormatException.
pt_br: O especificador de formato personalizado "H" representa a hora como um número de 0 a 23. Ou seja, a hora é representada por um relógio de 24 horas com base em zero que conta as horas desde a meia-noite. Uma hora de dígito único é formatada sem um zero à esquerda. Se o especificador de formato "H" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: Описатель пользовательского формата "H" представляет час в виде числа от 0 до 23, то есть час представлен в начинающемся с нуля 24-часовом формате, отсчитывающем часы с полуночи. Значение часа из одной цифры форматируется без начального нуля. Если описатель формата "H" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: "H" özel biçim belirticisi saati 0 ile 23 arasında bir sayı ile temsil eder; yani saat, gece yarısından beri geçen saat sayısını belirten sıfır tabanlı 24 saatlik bir düzen ile temsil edilir. Tek haneli bir saat, başına sıfır eklenmeden biçimlendirilir. "H" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: "H" 自定义格式说明符将小时表示为从 0 至 23 的数字，即通过从零开始的 24 小时制表示小时，自午夜开始对小时计数。一位数字的小时数设置为不带前导零的格式。 如果使用 "H" 格式说明符而没有其他自定义格式说明符，该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: "H" 自訂格式規範代表小時，以數字 0 到 23 表示; 換句話說，小時即為自午夜起所經過的時數，是以零開始的 24 小時制。單一數字的小時格式，開頭不會出現零。 如果在使用 "H" 格式規範時沒有其他自訂格式規範，則會將其解譯為標準日期與時間格式規範，並擲回 FormatException。

source: 24 hour clock (2 digits)
cs: 24hodinový formát (2 číslice)
de: 24-Stunden-Format (2 Stellen)
es: Reloj de 24 horas (2 dígitos)
fr: Horloge de 24 heures (2 chiffres)
it: Orario in formato 24 ore (2 cifre)
ja: 24 時間制 (2 桁)
ko: 24시간제(2자리)
pl: Zegar 24-godzinny (2 cyfry)
pt_br: Relógio de 24 horas (2 dígitos)
ru: 24-часовой формат времени (2 цифры)
tr: 24 saatlik düzen (2 rakam)
zh_hans: 24 小时制(2 位数)
zh_hant: 24 小時制 (2 位數)

# _24_hour_clock_2_digits_description
source: The "HH" custom format specifier (plus any number of additional "H" specifiers) represents the hour as a number from 00 through 23; that is, the hour is represented by a zero-based 24-hour clock that counts the hours since midnight. A single-digit hour is formatted with a leading zero.
cs: Specifikátor vlastního formátu HH reprezentuje hodinu jako číslo od 00 do 23. To znamená, že hodina je reprezentována ve 24hodinovém formátu, který začíná na nule a počítá hodiny od půlnoci. Hodina s jednou číslicí se formátuje s nulou na začátku.
de: Der benutzerdefinierte Formatbezeichner "HH" (plus beliebig viele zusätzliche H-Bezeichner) repräsentiert die Stunde als eine Zahl zwischen 00 und 23, d. h., die Stunde wird in einem nullbasierten 24-Stunden-Format dargestellt, bei dem die Stunden seit Mitternacht gezählt werden. Ein einstelliger Stundenwert wird mit einer führenden Null formatiert.
es: El especificador de formato personalizado "HH" (más cualquier número de especificadores "H" adicionales) representa la hora como un número de 00 a 23, es decir, mediante un reloj de 24 horas de base cero que cuenta las horas desde la medianoche. El formato de una hora de un solo dígito es con un cero inicial.
fr: Le spécificateur de format personnalisé "HH" (plus n'importe quel nombre de spécificateurs "H" supplémentaires) représente les heures sous la forme d'un nombre compris entre 00 et 23. En d'autres termes, les heures sont représentées par une horloge de 24 heures de base zéro, qui compte les heures écoulées depuis minuit. Une heure à un chiffre est présentée dans un format qui comporte un zéro de début.
it: L'identificatore di formato personalizzato "HH" (più qualsiasi numero di identificatori "H" aggiuntivi) rappresenta l'ora come numero compreso tra 00 e 23, ovvero l'ora rappresentata nell'orario in formato 24 ore a base zero in base al quale il conteggio riparte da mezzanotte. Un'ora costituita da una singola cifra viene formattata con uno zero iniziale.
ja: "HH" カスタム書式指定子 (任意の数の "H" 指定子を追加できます) は、時を 00 から 23 の数字で表します。つまり、午前 0 時からの時間をカウントする、ゼロから始まる 24 時間制で時が表されます。1 桁の時は、先行ゼロ付きで書式設定されます。
ko: "HH" 사용자 지정 형식 지정자(및 임의 개수의 추가 "H" 지정자)는 시간을 00부터 23까지의 숫자로 나타냅니다. 즉, 시간은 자정부터 경과한 시간을 계산하는 0 기반 24시간제로 표현됩니다. 한 자릿수 시간은 앞에 0이 있는 형식으로 지정됩니다.
pl: Indywidualny specyfikator formatu „HH” (wraz z dowolną liczbą dodatkowych specyfikatorów „H”) reprezentuje godzinę jako liczbę z zakresu od 00 do 23; tzn. godzina jest reprezentowana przez 24-godzinny zegar zaczynający się od zera i liczący godziny od północy. Godzina 1-cyfrowa jest wyświetlana w formacie z wiodącym zerem.
pt_br: O especificador de formato personalizado "HH" (mais qualquer número de especificadores "H" adicionais) representa a hora como um número de 00 a 23. Ou seja, a hora é representada por um relógio de 24 horas com base em zero que conta as horas desde a meia-noite. Uma hora de dígito único é formatada com um zero à esquerda.
ru: Описатель пользовательского формата "HH" (плюс любое число дополнительных описателей "H") представляет час в виде числа от 00 до 23, то есть час представлен в начинающемся с нуля 24-часовом формате, отсчитывающем часы с полуночи. Значение часа из одной цифры форматируется с начальным нулем.
tr: "HH" özel biçim belirticisi (ve herhangi bir sayıda ek "H" belirticisi) saati 00 ile 23 arasında bir sayı ile temsil eder; yani saat, gece yarısından bu yana geçen saat sayısını belirten sıfır tabanlı 24 saatlik bir düzen ile temsil edilir. Tek haneli bir saat, başına sıfır eklenerek biçimlendirilir.
zh_hans: "HH" 自定义格式说明符(另加任意数量的 "H" 说明符)将小时表示为从 00 至 23 的数字，即通过从零开始的 24 小时制表示小时，自午夜开始对小时计数。一位数字的小时数设置为带前导零的格式。
zh_hant: "HH" 自訂格式規範 (加上任意數目的其他 "H" 規範) 代表小時，以數字 00 到 23 表示; 換句話說，小時即為自午夜起所經過的時數，是以零開始的 24 小時制。單一數字的小時格式，開頭不會出現零。

source: all anonymous types in container
cs: všechny anonymní typy v kontejneru
de: Alle anonymen Typen im Container
es: todos los tipos anónimos del contenedor
it: tutti i tipi anonimi nel contenitore
ja: コンテナー内のすべての匿名型
ko: 컨테이너의 모든 익명 유형
pl: wszystkie typy anonimowe w kontenerze
pt_br: todos os tipos anônimos no contêiner
ru: все анонимные типы в контейнере
tr: kapsayıcıdaki tüm anonim tipler
zh_hans: 容器中的所有匿名类型

source: and update call sites directly
cs: a aktualizovat místa volání přímo
de: und Aufrufsites direkt aktualisieren
es: y actualizar sitios de llamada directamente
it: e aggiornare direttamente i siti di chiamata
ja: および直接呼び出しサイトを更新する
ko: 통화 사이트를 직접 업데이트하고
pl: i aktualizowanie miejsc wywoływania bezpośrednio
pt_br: e atualizar sites de chamadas diretamente
ru: и обновлять сайты вызовов напрямую
tr: ve çağrı sitelerini doğrudan güncelleştir
zh_hans: 并直接更新调用站点

source: class with explicit or sequential layout
cs: třída s explicitním nebo sekvenčním rozložením
es: clase con diseño explícito o secuencial
ko: 명시적 또는 순차적 레이아웃이 있는 클래스
pl: klasa z układem jawnie lub sekwencyjnym
pt_br: classe com layout explícito ou sequencial
ru: класс с явной или последовательной компоновкой
tr: açık veya sıralı düzeni olan sınıf
zh_hans: 具有显式或顺序布局的类

source: code
es: código
it: codice
ja: コード
ko: 코드
pl: kod
pt_br: código
ru: код
tr: kod
zh_hans: 代码

source: date separator
cs: oddělovač data
de: Datumstrennzeichen
es: separador de fecha
fr: séparateur de date
it: Separatore di data
ja: 日付の区切り記号
ko: 날짜 구분 기호
pl: separator daty
pt_br: separador de data
ru: разделитель компонентов даты
tr: tarih ayırıcısı
zh_hans: 日期分隔符
zh_hant: 日期分隔符號
