Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Updating the alias of Declare statement requires restarting the application.
cs: Aktualizace aliasu příkazu Declare vyžaduje restartování aplikace.
de: Das Aktualisieren des Alias der Declare-Anweisung erfordert einen Neustart der Anwendung.
es: Para actualizar el alias de la instrucción Declare es necesario reiniciar la aplicación.
it: Se si aggiorna l'alias dell'istruzione Declare, è necessario riavviare l'applicazione.
ja: Declare ステートメントのエイリアスを更新するには、アプリケーションを再起動する必要があります。
ko: Declare 문의 별칭을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizacja aliasu instrukcji Declare wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o alias da instrução Declare requer a reinicialização do aplicativo.
ru: Для обновления псевдонима оператора Declare требуется перезапустить приложение.
tr: Declare ifadesinin diğer adını güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 Declare 语句的别名需要重新启动应用程序。

source: Updating the attributes of {0} requires restarting the application because it is not supported by the runtime.
cs: Aktualizace atributů {0} vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Aktualisieren der Attribute von {0} erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para actualizar los atributos de {0} se requiere reiniciar la aplicación porque no es compatible con el runtime.
it: Se si aggiornano gli attributi di {0}, è necessario riavviare l'applicazione perché l'operazione non è supportata dal runtime.
ja: ランタイムでサポートされていないため、{0} の属性を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 특성을 업데이트하려면 런타임에서 지원되지 않으므로 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja atrybutów elementu {0} wymaga ponownego uruchomienia aplikacji, ponieważ nie jest obsługiwany przez środowisko uruchomieniowe.
pt_br: A atualização dos atributos de {0} requer a reinicialização do aplicativo porque não é compatível com o tempo de execução.
ru: Для обновления атрибутов {0} требуется перезапустить приложение, так как обновление не поддерживается средой выполнения.
tr: {0} öğesinin özniteliklerinin güncelleştirilmesi çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的属性需要重启应用程序，因为它不受运行时支持。

source: Updating the base class and/or base interface(s) of {0} requires restarting the application.
cs: Aktualizace základní třídy nebo základních rozhraní {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Basisklasse und/oder der Basisschnittstelle(n) von {0} erfordert eine Neustart der Anwendung.
es: Para actualizar la clase base o las interfaces base de {0}se requiere reiniciar la aplicación.
it: Se si aggiorna la classe di base e/o le interfacce di base di {0}, è necessario riavviare l'applicazione.
ja: {0} の基本クラスおよび (または) 基本インターフェイスを更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 기본 클래스 및/또는 기본 인터페이스를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja klasy bazowej i/lub interfejsu podstawowego elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar a classe base e/ou interface(s) base de {0} requer reiniciar o aplicativo.
ru: Для обновления базового класса и/или базового интерфейса {0} требуется перезапустить приложение.
tr: {0} öğesinin temel sınıfının ve/veya temel arabiriminin/arabirimlerinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的基类和/或基接口需要重启应用程序。

source: Updating the initializer of {0} requires restarting the application.
cs: Aktualizace inicializátoru pro {0} vyžaduje restartování aplikace.
de: Das Aktualisieren des Initialisierers von {0} erfordert einen Neustart der Anwendung.
es: Para actualizar el inicializador de {0} es necesario reiniciar la aplicación.
it: Se si aggiorna l'inizializzatore di {0}, è necessario riavviare l'applicazione.
ja: {0} の初期化子を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 이니셜라이저를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja inicjatora elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: A atualização do inicializador de {0} requer a reinicialização do aplicativo.
ru: Для обновления инициализатора {0} требуется перезапустить приложение.
tr: {0} başlatıcısının güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的初始化表达式需要重启应用程序。

source: Updating the kind of a property/event accessor requires restarting the application.
cs: Aktualizace druhu přístupového objektu vlastnosti nebo události vyžaduje restartování aplikace.
de: Das Aktualisieren der Art einer Eigenschafts-/Ereigniszugriffsmethode erfordert einen Neustart der Anwendung.
es: Para actualizar el tipo de descriptor de acceso property/event es necesario reiniciar la aplicación.
it: Se si aggiorna la tipologia di una funzione di accesso a proprietà/eventi, è necessario riavviare l'applicazione.
ja: プロパティまたはイベント アクセサーの種類を更新するには、アプリケーションを再起動する必要があります。
ko: 속성/이벤트 접근자의 종류를 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie rodzaju metody dostępu do właściwości/zdarzenia wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o tipo de um acessador de propriedade/evento requer a reinicialização do aplicativo.
ru: Для обновления метода доступа свойства/события требуется перезапустить приложение.
tr: Bir özellik/olay erişimcisinin türünü güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新属性/事件取值函数的类型需要重新启动应用程序。

source: Updating the kind of a type requires restarting the application.
cs: Aktualizace typu vyžaduje restartování aplikace.
de: Das Aktualisieren der Art eines Typs erfordert einen Neustart der Anwendung.
es: Para actualizar la variante de un tipo, es necesario reiniciar la aplicación.
it: Se si aggiorna la tipologia di un tipo, è necessario riavviare l'applicazione.
ja: 型の種類を更新するには、アプリケーションを再起動する必要があります。
ko: 형식 종류를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja rodzaju typu wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o tipo de um tipo requer o reinício do aplicativo.
ru: Для обновления вида типа требуется перезапустить приложение.
tr: Bir türün tipinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新类型的种类需要重启应用程序。

source: Updating the library name of Declare statement requires restarting the application.
cs: Aktualizace názvu knihovny příkazu Declare vyžaduje restartování aplikace.
de: Das Aktualisieren des Bibliotheksnamens der Declare-Anweisung erfordert einen Neustart der Anwendung.
es: Para actualizar el nombre de la biblioteca de la instrucción Declare, es necesario reiniciar la aplicación.
it: Se si aggiorna il nome della libreria dell'istruzione Declare, è necessario riavviare l'applicazione.
ja: Declare ステートメントのライブラリ名を更新するには、アプリケーションを再起動する必要があります。
ko: Declare 문의 라이브러리 이름을 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja nazwy biblioteki instrukcji Declare wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o nome da biblioteca da instrução Declare requer a reinicialização do aplicativo.
ru: Для обновления имени библиотеки оператора Declare требуется перезапустить приложение.
tr: Declare deyiminin kitaplık adının güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 Declare 语句的库名称需要重启应用程序。

source: Updating the modifiers of {0} requires restarting the application.
cs: Aktualizace modifikátorů pro {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Modifizierer von {0} erfordert einen Neustart der Anwendung.
es: Para actualizar los modificadores de {0} es necesario reiniciar la aplicación.
it: Se si aggiornano i modificatori di {0}, è necessario riavviare l'applicazione.
ja: {0} の修飾子を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 한정자를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja modyfikatorów elementów {0} wymaga ponownego uruchomienia aplikacji.
pt_br: A atualização dos modificadores de {0} requer a reinicialização do aplicativo.
ru: Для обновления модификаторов {0} требуется перезапустить приложение.
tr: {0} değiştiricilerinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的修饰符需要重启应用程序。

source: Updating the size of a {0} requires restarting the application.
cs: Aktualizace velikosti {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Größe einer {0} erfordert einen Neustart der Anwendung.
es: Para actualizar el tamaño de un {0} es necesario reiniciar la aplicación.
it: Se si aggiornano le dimensioni di un elemento {0}, è necessario riavviare l'applicazione.
ja: {0} のサイズを更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 크기를 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie rozmiaru elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o tamanho de um {0} requer a reinicialização do aplicativo.
ru: Для обновления размера {0} требуется перезапустить приложение.
tr: {0} öğesinin boyutunu güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的大小需要重新启动应用程序。

source: Updating the type of {0} requires restarting the application.
cs: Aktualizace typu {0} vyžaduje restartování aplikace.
de: Das Aktualisieren des Typs von {0} erfordert einen Neustart der Anwendung.
es: Para actualizar el tipo de {0} es necesario reiniciar la aplicación.
it: Se si aggiorna il tipo di {0}, è necessario riavviare l'applicazione.
ja: {0} の種類を更新するには、アプリケーションを再起動する必要があります。
ko: {0} 유형을 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja typu elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o tipo de {0} requer a reinicialização do aplicativo.
ru: Для обновления типа {0} требуется перезапустить приложение.
tr: {0} öğesinin türünün güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的类型需要重启应用程序。

source: Updating the underlying type of {0} requires restarting the application.
cs: Aktualizace základního typu {0} vyžaduje restartování aplikace.
de: Das Aktualisieren des zugrundeliegenden Typs von {0} erfordert einen Neustart der Anwendung.
es: Para actualizar el tipo subyacente de {0} se requiere reiniciar la aplicación.
it: Se si aggiorna il tipo sottostante di {0}, è necessario riavviare l'applicazione.
ja: {0} の基になる型を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 기본 유형을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie typu podstawowego elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o tipo subjacente de {0} requer a reinicialização do aplicativo.
ru: Для обновления базового типа {0} требуется перезапустить приложение.
tr: Temel alınan türdeki {0} öğesinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的基础差异需要重新启动应用程序。

source: Updating the variance of {0} requires restarting the application.
cs: Aktualizace variance {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Abweichung von {0} erfordert einen Neustart der Anwendung.
es: Al actualizar la varianza de {0} se requiere reiniciar la aplicación.
it: Se si aggiorna la varianza di {0}, è necessario riavviare l'applicazione.
ja: {0} の変性を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 분산을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie odchylenia elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar a variação de {0} requer a reinicialização do aplicativo.
ru: Для обновления расхождения {0} требуется перезапустить приложение.
tr: {0} varyansını güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的差异需要重新启动应用程序。

# Value_colon
source: Value:
cs: Hodnota:
de: Wert:
es: Valor:
fr: Valeur :
it: Valore:
ja: 値:
ko: 값:
pl: Wartość:
pt_br: Valor:
ru: Значение:
tr: Değer:
zh_hans: 值:
zh_hant: 值:

source: Value required
cs: Hodnota je povinná
de: Wert erforderlich
es: Valor obligatorio
it: Valore obbligatorio
ja: 値が必要です
ko: 값이 필요함
pl: Wartość wymagana
pt_br: Valor obrigatório
ru: Требуется значение
tr: Değer gerekiyor
zh_hans: 值是必需的

source: WARN: Version mismatch. Expected: '{0}', Got: '{1}'
cs: UPOZORNĚNÍ: Neshoda verzí. Očekáváno: {0}, získáno: {1}
de: WARNUNG: Versionskonflikt. Erwartet: "{0}", erhalten: "{1}"
es: AVISO: No coinciden las versiones. Se esperaba "{0}", se obtuvo "{1}"
it: AVVISO: versione non corrispondente. Prevista: '{0}'. Ottenuta: '{1}'
ja: 警告: バージョンが一致しません。必要なバージョン: '{0}'、現在のバージョン: '{1}'
ko: WARN: 버전이 일치하지 않습니다. 예상: '{0}', 실제: '{1}'
pl: OSTRZEŻENIE: niezgodność wersji. Oczekiwano: „{0}”, uzyskano: „{1}”
pt_br: AVISO: incompatibilidade de versão. Esperado: '{0}', Obtido: '{1}'
ru: Внимание! Несовпадение версий. Ожидалось: "{0}", получено: "{1}"
tr: UYARI: Sürüm uyumsuzluğu. Beklenen: '{0}', Alınan: '{1}'
zh_hans: 警告: 版本不匹配。应为: "{0}"，实际为: "{1}"

source: Warning: Changing namespace may produce invalid code and change code meaning.
cs: Upozornění: Změna oboru názvů může vést k vytvoření neplatného kódu a změnit význam kódu.
de: Warnung: Durch die Änderung des Namespaces kann der Code ungültig werden oder seine Bedeutung verändern.
es: Advertencia: si cambia Cambiar el espacio de nombres puede producir código inválido y cambiar el significado del código.
fr: Avertissement : Le changement d’espace de noms peut produire du code non valide et changer la signification du code.
it: Avviso: la modifica dello spazio dei nomi può comportare la creazione di codice non valido e modificare il significato del codice.
ja: 警告: 名前空間を変更すると無効なコードが生成され、コードの意味が変更される可能性があります。
ko: 경고: 네임스페이스를 변경하면 잘못된 코드가 발생하고 코드 의미가 변경될 수 있습니다.
pl: Ostrzeżenie: Zmiana przestrzeni nazw może skutkować nieprawidłowym kodem i zmianą jego znaczenia.
pt_br: Aviso: a alteração do namespace pode produzir código inválido e mudar o significado do código.
ru: Предупреждение: изменение пространства имен может привести к появлению недопустимого кода и к изменению значения кода.
tr: Uyarı: Ad alanının değiştirilmesi geçersiz kod oluşturabilir ve kodun anlamını değiştirebilir.
zh_hans: 警告: 更改命名空间可能会产生无效的代码并更改代码的含义。
zh_hant: 警告: 變更命名空間可能會產生無效的程式碼及變更程式碼意義。

# Warning_colon_semantics_may_change_when_converting_statement
source: Warning: Semantics may change when converting statement.
cs: Upozornění: Při převodu příkazu se může změnit sémantika.
de: Warnung: Die Semantik kann sich beim Konvertieren der Anweisung ändern.
es: Advertencia: La semántica puede cambiar al convertir la instrucción.
fr: Avertissement : La sémantique peut changer durant la conversion d'une instruction.
it: Avviso: durante la conversione dell'istruzione la semantica può cambiare.
ja: 警告: ステートメントの変換時にセマンティクスが変更される可能性があります。
ko: 경고: 문을 변환할 때 의미 체계가 변경될 수 있습니다.
pl: Ostrzeżenie: semantyka może ulec zmianie podczas konwertowania instrukcji.
pt_br: Aviso: a semântica pode ser alterada ao converter a instrução.
ru: Внимание! При преобразовании инструкции семантика может измениться.
tr: Uyarı: İfade dönüştürülürken semantikleri değişebilir.
zh_hans: 警告: 转换语句时，语义可能出现变化。
zh_hant: 警告: 轉換陳述式時，語意可能會變更。

source: Wrap and align call chain
cs: Zalomit a zarovnat posloupnost volání
de: Aufrufkette umbrechen und ausrichten
es: Encapsular y alinear la cadena de llamadas
fr: Envelopper et aligner la chaîne d'appels
it: Imposta il ritorno a capo e allinea la catena di chiamate
ja: 呼び出しチェーンの折り返しと配置
ko: 호출 체인 래핑 및 맞춤
pl: Zawijaj i wyrównuj łańcuch wywołań
pt_br: Encapsular e alinhar cadeia de chamadas
ru: Свернуть и выровнять цепочку вызовов
tr: Çağrı zincirini sarmala ve hizala
zh_hans: 包装并对齐调用链
zh_hant: 包裝並對齊呼叫鏈

source: Wrap and align expression
cs: Výraz pro zabalení a zarovnání
de: Ausdruck umbrechen und ausrichten
es: Expresión de encapsulado y alineación
fr: Envelopper et aligner l'expression
it: Imposta il ritorno a capo e allinea l'espressione
ja: 式を折り返して整列する
ko: 식 래핑 및 맞추기
pl: Zawijaj i wyrównuj wyrażenie
pt_br: Quebrar e alinhar expressão
ru: Перенос и выравнивание выражения
tr: İfadeyi kaydır ve hizala
zh_hans: 环绕和对齐表达式
zh_hant: 換行並對齊運算式

source: Wrap and align long call chain
cs: Zalomit a zarovnat dlouhou posloupnost volání
de: Lange Aufrufkette umbrechen und ausrichten
es: Encapsular y alinear la cadena de llamadas larga
fr: Envelopper et aligner la longue chaîne d'appels
it: Imposta il ritorno a capo e allinea la catena di chiamate lunga
ja: 長い呼び出しチェーンの折り返しと配置
ko: 긴 호출 체인 래핑 및 맞춤
pl: Zawijaj i wyrównuj długi łańcuch wywołań
pt_br: Encapsular e alinhar cadeia longa de chamadas
ru: Свернуть и выровнять длинную цепочку вызовов
tr: Uzun çağrı zincirini sarmala ve hizala
zh_hans: 包装并对齐长调用链
zh_hant: 包裝並對齊長呼叫鏈

source: Wrap call chain
cs: Zalomit posloupnost volání
de: Aufrufkette umbrechen
es: Encapsular la cadena de llamadas
fr: Envelopper la chaîne d'appels
it: Imposta il ritorno a capo alla catena di chiamate
ja: 呼び出しチェーンの折り返し
ko: 호출 체인 래핑
pl: Zawijaj łańcuch wywołań
pt_br: Encapsular cadeia de chamadas
ru: Свернуть цепочку вызовов
tr: Çağrı zincirini sarmala
zh_hans: 包装调用链
zh_hant: 包裝呼叫鏈

source: Wrap collection
cs: Zalomit kolekci
de: Sammlung umbrechen
es: Ajustar colección
ja: コレクションの折り返し
ko: 컬렉션 래핑
pl: Zwiń kolekcję
pt_br: Encapsular coleção
ru: Упаковка коллекции
tr: Koleksiyonu sarmala
zh_hans: 包装集合

source: Wrap every argument
cs: Zalomit každý argument
de: Jedes Argument umbrechen
es: Ajustar todos los argumentos
fr: Envelopper chaque argument
it: Imposta il ritorno a capo a ogni argomento
ja: すべての引数を折り返します
ko: 모든 인수 래핑
pl: Zawijaj każdy argument
pt_br: Encapsular cada argumento
ru: Свернуть каждый аргумент
tr: Her bağımsız değişkeni sarmala
zh_hans: 包装每个参数
zh_hant: 包裝每個引數

source: Wrap every parameter
cs: Zalomit každý parametr
de: Alle Parameter umbrechen
es: Ajustar todos los parámetros
fr: Envelopper chaque paramètre
it: Imposta il ritorno a capo a ogni parametro
ja: すべてのパラメーターを折り返します
ko: 모든 매개 변수 래핑
pl: Zawijaj każdy parametr
pt_br: Encapsular cada parâmetro
ru: Свернуть каждый параметр
tr: Her parametreyi sarmala
zh_hans: 包装每个参数
zh_hant: 將每個參數換行

source: Wrap expression
cs: Zalomit výraz
de: Ausdruck umbrechen
es: Ajustar la expresión
fr: Envelopper l'expression
it: Imposta il ritorno a capo all'espressione
ja: 式を折り返す
ko: 식 래핑
pl: Zawijaj wyrażenie
pt_br: Encapsular a expressão
ru: Свернуть выражение
tr: İfadeyi sarmala
zh_hans: 包装表达式
zh_hant: 換行運算式

source: Wrap initializer
cs: Zalomit inicializátor
de: Initialisierer umschließen
es: Inicializador de encapsulado
it: Esegui il wrapping dell'inizializzatore
ja: 初期化子の折り返し
ko: 이니셜라이저 래핑
pl: Zawijaj inicjator
pt_br: Quebrar linha do inicializador
ru: Переносить инициализатор
tr: Başlatıcıyı sarmala
zh_hans: 换行初始化表达式

source: Wrap long argument list
cs: Zalomit dlouhý seznam argumentů
de: Lange Argumentliste umbrechen
es: Desajustar la lista larga de argumentos
fr: Envelopper la longue liste d'arguments
it: Imposta il ritorno a capo all'elenco di argomenti lungo
ja: 長い引数リストを折り返します
ko: 긴 인수 목록 래핑
pl: Zawijaj długą listę argumentów
pt_br: Encapsular a lista de argumentos longa
ru: Свернуть длинный список аргументов
tr: Uzun bağımsız değişken listesini sarmala
zh_hans: 包装长参数列表
zh_hant: 包裝長引數清單

source: Wrap long call chain
cs: Zalomit dlouhou posloupnost volání
de: Lange Aufrufkette umbrechen
es: Encapsular la cadena de llamadas larga
fr: Envelopper la longue chaîne d'appels
it: Imposta il ritorno a capo alla catena di chiamate lunga
ja: 長い呼び出しチェーンの折り返し
ko: 긴 호출 체인 래핑
pl: Zawijaj długi łańcuch wywołań
pt_br: Encapsular cadeia longa de chamadas
ru: Свернуть длинную цепочку вызовов
tr: Uzun çağrı zincirini sarmala
zh_hans: 包装长调用链
zh_hant: 包裝長呼叫鏈

source: Wrap long collection
cs: Zalomit dlouhou kolekci
de: Lange Sammlung umbrechen
es: Ajustar colección larga
ja: 長いコレクションを折り返す
ko: 긴 컬렉션 래핑
pl: Zwiń długą kolekcję
pt_br: Encapsular coleção longa
ru: Упаковка длинной коллекции
tr: Uzun koleksiyonu sarmala
zh_hans: 包装长集合

source: Wrap long initializer
cs: Zalomit dlouhý inicializátor
de: Langen Initialisierer umschließen
es: Encapsular el inicializador largo
it: Esegui il wrapping dell'inizializzatore long
ja: 長い初期化子を折り返す
ko: 긴 이니셜라이저 래핑
pl: Zawijaj długi inicjator
pt_br: Quebrar linha do inicializador longo
ru: Переносить длинный инициализатор
tr: Uzun başlatıcıyı sarmala
zh_hans: 换行长初始化表达式

source: Wrap long parameter list
cs: Zalomit dlouhý seznam parametrů
de: Lange Parameterliste umbrechen
es: Ajustar la lista larga de parámetros
fr: Envelopper la longue liste de paramètres
it: Imposta il ritorno a capo all'elenco di parametri lungo
ja: 長いパラメーター リストを折り返します
ko: 긴 매개 변수 목록 래핑
pl: Zawijaj długą listę parametrów
pt_br: Encapsular a lista de parâmetros longa
ru: Свернуть длинный список параметров
tr: Uzun parametre listesini sarmala
zh_hans: 包装长参数列表
zh_hant: 將長參數清單換行

source: Wrapping
cs: Zalamování
de: Umbruch
es: Ajuste
fr: Enveloppement
it: Ritorno a capo
ja: 折り返し
ko: 래핑
pl: Zawijanie
pt_br: Quebra de linha
ru: Перенос по словам
tr: Kaydırma
zh_hans: 换行
zh_hant: 換行

source: You can use the navigation bar to switch contexts.
cs: Pro přepínání kontextů můžete použít navigační panel.
de: Sie können die Navigationsleiste verwenden, um den Kontext zu wechseln.
es: Puede usar la barra de navegación para cambiar contextos.
it: Per cambiare contesto, si può usare la barra di spostamento.
ja: ナビゲーション バーを使用してコンテキストを切り替えることができます。
ko: 탐색 모음을 사용하여 컨텍스트를 전환할 수 있습니다.
pl: Za pomocą paska nawigacyjnego można przełączać konteksty.
pt_br: Você pode usar a barra de navegação para mudar de contexto.
ru: Для переключения контекстов можно использовать панель навигации.
tr: Bağlamlarda geçiş yapmak için gezinti çubuğunu kullanabilirsiniz.
zh_hans: 可使用导航栏切换上下文。

source: You cannot rename elements from previous submissions.
cs: Nemůžete přejmenovat elementy z předchozích odeslání.
de: Sie können Elemente aus vorherigen Übermittlungen umbenennen.
es: No se puede cambiar el nombre a elementos de envíos anteriores.
it: Non è possibile rinominare elementi di invii precedenti.
ja: 前の送信からの要素の名前を変更することはできません。
ko: 이전 전송 요소의 이름을 바꿀 수 없습니다.
pl: Nie można zmienić nazw elementów pochodzących z poprzednich przesłanych elementów.
pt_br: Você não pode renomear elementos de envios anteriores.
ru: Нельзя переименовать элементы из предыдущих отправок.
tr: Öğeleri önceki gönderimlerden yeniden adlandıramazsınız.
zh_hans: 无法重命名来自之前提交的元素。

source: You cannot rename elements that are defined in metadata.
cs: Nemůžete přejmenovat elementy, které jsou definované v metadatech.
de: Sie können in Metadaten definierte Elemente nicht umbenennen.
es: No se puede cambiar el nombre a elementos que están definidos en metadatos.
it: Non è possibile rinominare elementi definiti nei metadati.
ja: メタデータで定義されている要素の名前を変更することはできません。
ko: 메타데이터에서 정의된 요소의 이름을 바꿀 수 없습니다.
pl: Nie można zmienić nazw elementów zdefiniowanych w metadanych.
pt_br: Você não pode renomear elementos que estão definidos nos metadados.
ru: Нельзя переименовать элементы, определенные в метаданных.
tr: Meta verilerde tanımlanan öğeleri yeniden adlandıramazsınız.
zh_hans: 无法重命名元数据中定义的元素。

source: You cannot rename operators.
cs: Nemůžete přejmenovat operátory.
de: Sie können Operatoren nicht umbenennen.
es: No se puede cambiar el nombre a los operadores.
it: Non è possibile rinominare gli operatori.
ja: 演算子の名前を変更することはできません。
ko: 연산자의 이름을 바꿀 수 없습니다.
pl: Nie można zmienić nazw operatorów.
pt_br: Você não pode renomear operadores.
ru: Нельзя переименовать операторы.
tr: Operatörleri yeniden adlandıramazsınız.
zh_hans: 无法重命名运算符。

source: You cannot rename this element.
cs: Nemůžete přejmenovat tento element.
de: Sie können dieses Element nicht umbenennen.
es: No se puede cambiar el nombre a este elemento.
it: Non è possibile rinominare questo elemento.
ja: この要素の名前を変更することはできません。
ko: 이 요소의 이름을 바꿀 수 없습니다.
pl: Nie można zmienić nazwy tego elementu.
pt_br: Você não pode renomear este elemento.
ru: Этот элемент переименовать нельзя.
tr: Bu öğeyi yeniden adlandıramazsınız.
zh_hans: 无法重命名此元素。
