Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# year_5_digits_description
source: The "yyyyy" custom format specifier (plus any number of additional "y" specifiers) represents the year with a minimum of five digits. If the year has more than five significant digits, they are included in the result string. If the year has fewer than five digits, the number is padded with leading zeros to produce five digits. If there are additional "y" specifiers, the number is padded with as many leading zeros as necessary to produce the number of "y" specifiers.
cs: Specifikátor vlastního formátu yyyyy (a libovolný počet dalších specifikátorů y) představuje rok s nejméně pěti číslicemi. Pokud má rok více než pět platných číslic, zahrnou se do výsledného řetězce. Pokud má rok méně než pět číslic, číslo se doplní nulami na začátku, aby mělo pět číslice. Pokud se použijí další specifikátory y, číslo se doplní tolika nulami na začátku, kolik jich je potřeba, aby vzniklo číslo odpovídající specifikátorům y.
de: Der benutzerdefinierte Formatbezeichner "yyyyy" (plus beliebig viele zusätzliche y-Bezeichner) repräsentiert das Jahr mit mindestens fünf Stellen. Wenn das Jahr mehr als fünf signifikante Stellen aufweist, werden diese in die Ergebniszeichenfolge eingeschlossen. Umfasst das Jahr weniger als fünf Stellen, wird die Zahl mit führenden Nullen aufgefüllt, um fünf Stellen zu erzeugen. Falls zusätzliche y-Bezeichner vorhanden sind, wird die Zahl mit so vielen führenden Nullen aufgefüllt, wie erforderlich sind, um die Anzahl der y-Bezeichner zu erhalten.
es: El especificador de formato personalizado "yyyyy" (más cualquier número de especificadores "y" adicionales) representa el año con un mínimo de cinco dígitos. Si el año tiene más de cinco dígitos significativos, se incluyen en la cadena de resultado. Si el año tiene menos de cinco dígitos, se le ponen ceros delante al número hasta tener cinco dígitos. Si hay especificadores "y" adicionales, al número se le ponen delante tantos ceros como sean necesarios para tener el número de especificadores "y".
fr: Le spécificateur de format personnalisé "yyyyy" (plus n'importe quel nombre de spécificateurs "y" supplémentaires) représente l'année sous la forme d'un nombre à cinq chiffres au minimum. Si l'année comporte plus de cinq chiffres significatifs, ils sont inclus dans la chaîne résultante. Si l'année comporte moins de cinq chiffres, la valeur numérique est complétée avec des zéros de début pour produire cinq chiffres. S'il existe des spécificateurs "y" supplémentaires, la valeur numérique est complétée avec autant de zéros de début que nécessaire pour produire le nombre de spécificateurs "y".
it: L'identificatore di formato personalizzato "yyyyy" (più qualsiasi numero di identificatori "y" aggiuntivi) rappresenta l'anno con un minimo di cinque cifre. Se l'anno ha più di cinque cifre significative, queste vengono incluse nella stringa di risultato. Se l'anno ha meno di cinque cifre, prima del numero vengono aggiunti gli zeri necessari per ottenere cinque cifre. Se sono presenti identificatori "y" aggiuntivi, prima del numero vengono aggiunti gli zeri necessari per ottenere il numero di identificatori "y".
ja: "yyyyy" カスタム書式指定子 (任意の数の "y" 指定子を追加可能) は、年を 5 桁以上で表します。年が有効数字 5 桁を超える場合、書式設定後の文字列にはすべての桁が表示されます。年が 5 桁に満たない年については、先行ゼロが追加され 5 桁の数値で表されます。 "y" 指定子を追加すると、数値の桁数が "y" 指定子の数と同じになるまで、先行ゼロが数値に追加されます。
ko: "yyyyy" 사용자 지정 형식 지정자(및 임의 개수의 추가 "y" 지정자)는 다섯 자릿수 이상으로 연도를 나타냅니다. 연도에 6개 이상의 유효 숫자가 있는 경우 결과 문자열에 포함됩니다. 연도에 5개 미만의 유효 숫자가 있는 경우 앞을 0으로 채워 다섯 자릿수를 생성합니다. 추가 "y" 지정자가 있는 경우 "y" 지정자의 개수를 생성하는 데 필요한 만큼 숫자가 0으로 채워집니다.
pl: Niestandardowy specyfikator formatu „yyyyy” (oraz dowolna liczba dodatkowych specyfikatorów „y”) reprezentuje rok za pomocą minimalnie 5 cyfr. Jeśli rok ma więcej niż pięć cyfr znaczących, są one uwzględniane w ciągu wyniku. Jeśli rok ma mniej niż pięć cyfr, liczba jest uzupełniana zerami wiodącymi, tak aby otrzymać pięć cyfr. Jeśli podano dodatkowe specyfikatory „y”, liczba jest uzupełniana taką liczbą zer wiodących, aby otrzymać liczbę cyfr równą liczbie specyfikatorów „y”.
pt_br: O especificador de formato personalizado "yyyyy" (mais qualquer número de especificadores "y" adicionais) representa o ano com um mínimo de cinco dígitos. Se o ano tiver mais de cinco dígitos significativos, eles serão incluídos na cadeia de caracteres de resultado. Se o ano tiver menos de cinco dígitos, o número será preenchido com zeros à esquerda para produzir cinco dígitos. Se houver especificadores "y" adicionais, o número será preenchido com quantos zeros à esquerda forem necessários para produzir o número de especificadores "y".
ru: Описатель пользовательского формата "yyyyy" (плюс любое число дополнительных описателей "y") представляет год как число из по меньшей мере пяти цифр. Если в значении года больше пяти значащих цифр, они включаются в результирующую строку. Если значение года содержит меньше пяти цифр, число дополняется начальными нулями, чтобы получить пять разрядов. При наличии дополнительных описателей "y" число дополняется таким количеством начальных нулей, которое позволяет получить нужное число описателей "y".
tr: "yyyyy" özel biçim belirticisi (ve herhangi bir sayıda ek "y" belirticisi) yılı minimum beş rakamla temsil eder. Yılda beşten fazla anlamlı basamak varsa, bunlar sonuç dizesine eklenir. Yılda beşten az rakam varsa, beş rakam üretmek için sayının başına sıfırlar eklenir. Ek "y" belirticileri varsa, sayının önüne "y" belirticilerinin sayısını üretmek için gerektiği kadar sıfır eklenir.
zh_hans: "yyyyy" 自定义格式说明符(另加任意数量的其他 "y" 说明符)表示最少为五位年份。如果年份具有五个以上的有效数字，则结果字符串中会显示所有数字。如果年份少于五位，则用前导零填充该数字以生成五个数字。 如果有其他 "y" 说明符，则用所需数量的前导零填充该数字，以生成 "y" 说明符。
zh_hant: "yyyyy" 自訂格式規範 (外加任意數目的額外 "y" 規範) 代表最少五位數的年份。如果該年份有五個以上的有效位數，則這些位數會包含在結果字串中。如果年份少於五位數，則會在該數字開頭填補零，以產生五位數。 如果有額外的 "y" 規範，則會在該數字開頭視所需數目填補零，以產生該數目之多的 "y" 規範。

source: year month
cs: měsíc v roce
de: Monat des Jahres
es: mes del año
fr: année mois
it: Anno e mese
ja: 年月
ko: 년 월
pl: rok miesiąc
pt_br: mês do ano
ru: Месяц года
tr: yıl ay
zh_hans: 年月
zh_hant: 年份月份

# year_month_description
source: The "Y" or "y" standard format specifier represents a custom date and time format string that is defined by the DateTimeFormatInfo.YearMonthPattern property of a specified culture. For example, the custom format string for the invariant culture is "yyyy MMMM".
cs: Specifikátory standardního formátu Y nebo y představují řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.ShortTimePattern zadané jazykové verze. Například řetězec vlastního formátu pro invariantní jazykovou verzi je yyyy MMMM.
de: Der Standardformatbezeichner "Y" oder "y" repräsentiert eine benutzerdefinierte Datums- und Zeitformatzeichenfolge, die durch die DateTimeFormatInfo.YearMonthPattern-Eigenschaft einer bestimmten Kultur definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "yyyy MMMM".
es: El especificador de formato estándar "Y" o "y" representa una cadena de formato de fecha y hora personalizado definida por la propiedad DateTimeFormatInfo.YearMonthPattern de una referencia cultural especificada. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "yyyy MMMM".
fr: Le spécificateur de format standard "Y" ou "y" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.YearMonthPattern de la culture spécifiée. Par exemple, la chaîne de format personnalisée pour la culture invariante est "yyyy MMMM".
it: L'identificatore di formato standard "Y" o "y" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.YearMonthPattern di impostazioni cultura specifiche. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "yyyy MMMM".
ja: "Y" または "y" 標準書式指定子は、指定されたカルチャの DateTimeFormatInfo.YearMonthPattern プロパティによって定義されたカスタム日時書式設定文字列を表します。たとえば、インバリアント カルチャのカスタム書式設定文字列は "yyyy MMMM" です。
ko: "Y" 또는 "y" 표준 형식 지정자는 지정된 문화권의 DateTimeFormatInfo.YearMonthPattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "yyyy MMMM"입니다.
pl: Standardowy specyfikator formatu „R” lub „r” reprezentuje ciąg niestandardowego formatu daty i godziny, który jest definiowany przez właściwość DateTimeFormatInfo.YearMonthPattern określonej kultury. Na przykład ciąg niestandardowego formatu dla niezmiennej kultury to „rrrr MMMM”.
pt_br: O especificador de formato padrão "Y" ou "y" representa uma cadeia de caracteres de formato de data e hora personalizado definida pela propriedade DateTimeFormatInfo.YearMonthPattern de uma cultura especificada. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "yyyy MMMM".
ru: Описатель стандартного формата "Y" или "y" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.YearMonthPattern заданных языка и региональных параметров. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "yyyy MMMM".
tr: "Y" veya "y" standart biçim belirticisi belirtilen bir kültürün DateTimeFormatInfo.YearMonthPattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "yyyy MMMM"dir.
zh_hans: "Y" 或 "y" 标准格式说明符表示由指定区域性的 DateTimeFormatInfo.YearMonthPattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "yyyy MMMM"。
zh_hant: "Y" 或 "y" 標準格式規範代表由指定文化特性 (Culture) DateTimeFormatInfo.YearMonthPattern 屬性所定義的自訂日期和時間格式字串。例如，不因文化特性而異的自訂格式字串為 "yyyy MMMM"。

source: Add '{0}' check
cs: Přidat kontrolu {0}
es: Agregar comprobación de “{0}”
pl: Dodaj sprawdzenie „{0}”
pt_br: Adicionar verificação "{0}"

source: Add negative value check
cs: Přidat kontrolu záporné hodnoty
es: Agregar comprobación de valor negativo
pl: Dodaj sprawdzenie wartości ujemnej
pt_br: Adicionar verificação de valor negativo

source: Add negative value or zero check
cs: Přidat kontrolu záporné hodnoty nebo nuly
es: Agregar comprobación de valor negativo o cero
pl: Dodaj sprawdzenie wartości ujemnej lub zerowej
pt_br: Adicionar valor negativo ou verificação de zero

source: Adding or moving {0} of {1} requires restarting the application.
cs: Přidání nebo přesunutí {0} {1} vyžaduje restartování aplikace.
es: Para agregar o mover {0} de {1} es necesario reiniciar la aplicación.
ko: {1} {0} 추가하거나 이동하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie lub przeniesienie {0} {1} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar ou mover {0} de {1} requer a reinicialização do aplicativo.
ru: Добавление или {0} {1} требует перезапуска приложения.

source: Adding or moving {0} of {1} with explicit or sequential layout requires restarting the application.
cs: Přidání nebo přesunutí {0} z(e) {1} s explicitním nebo sekvenčním rozložením vyžaduje restartování aplikace.
es: Para agregar o mover {0} de {1} con un diseño explícito o secuencial, es necesario reiniciar la aplicación.
ko: 명시적 또는 순차적 레이아웃으로 {1}개 중 {0}개를 추가하거나 이동하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie lub przeniesienie {0} z {1} wraz z układem jawnym lub sekwencyjnym wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar ou migrar {0} de {1} com layout explícito ou sequencial requer a reinicialização do aplicativo.
ru: Добавление или перемещение {0} из {1} с явной или последовательной компоновкой требует перезапуска приложения.

source: Adding or moving {0} of a COM interface requires restarting the application.
cs: Přidání nebo přesunutí {0} rozhraní COM vyžaduje restartování aplikace.
es: Para agregar o mover {0} de una interfaz COM es necesario reiniciar la aplicación.
ko: COM 인터페이스의 {0} 추가하거나 이동하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie lub przeniesienie {0} interfejsu COM wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar ou mover {0} de uma interface COM requer a reinicialização do aplicativo.
ru: Чтобы добавить или {0} com-интерфейса, необходимо перезапустить приложение.

source: Cannot determine valid range of statements to extract
cs: Nelze určit platný rozsah příkazů k extrakci.
es: No se puede determinar el intervalo válido de instrucciones que se van a extraer
ko: 추출할 문의 유효한 범위를 결정할 수 없습니다.
pl: Nie można określić prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: Não é possível determinar o intervalo válido de instruções a serem extraídas
ru: Невозможно определить допустимый диапазон операторов для извлечения

source: Changing '{0}' might not have any effect until the application is restarted.
cs: Změna {0} nemusí mít žádný vliv, dokud se aplikace nerestartuje.
es: Es posible que el cambio de "{0}" no tenga efecto hasta que se reinicie la aplicación.
ko: 애플리케이션을 다시 시작할 때까지는 '{0}'을(를) 변경해도 아무것도 적용되지 않을 수 있습니다.
pl: Zmiana elementu „{0}” może nie mieć żadnego wpływu, dopóki aplikacja nie zostanie uruchomiona ponownie.
pt_br: A alteração de '{0}' pode não ter efeito algum até que o aplicativo seja reiniciado.
ru: Изменение "{0}" может не иметь эффекта до перезапуска приложения.
tr: '{0}' değişikliği uygulama yeniden başlatılana kadar etkili olmaz.

source: Changing project or package reference caused the identity of referenced assembly to change from '{0}' to '{1}', which requires restarting the application.
cs: Změna odkazu na projekt nebo balíček způsobila změnu identity odkazovaného sestavení z {0} na {1}, což vyžaduje restartování aplikace.
es: Cambiar la referencia del proyecto o paquete provocó que la identidad del ensamblado al que se hace referencia cambiara de “{0}” a “{1}”, lo que requiere reiniciar la aplicación.
pl: Zmiana odwołania do projektu lub pakietu spowodowała zmianę tożsamości odwoływanego zestawu z „{0}” na „{1}”, co wymaga ponownego uruchomienia aplikacji.
pt_br: A alteração da referência de projeto ou pacote fez com que a identidade do assembly referenciado alterava de "{0}" para "{1}", o que requer a reinicialização do aplicativo.

source: Changing project setting '{0}' from '{1}' to '{2}' requires restarting the application.
cs: Změna nastavení projektu {0} z {1} na {2} vyžaduje restartování aplikace.
es: Cambiar el valor del proyecto “{0}” de “{1}” a “{2}” requiere reiniciar la aplicación.
pl: Zmiana ustawienia projektu „{0}” z „{1}” na „{2}” wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar a configuração do projeto "{0}" de "{1}" para "{2}" requer a reinicialização do aplicativo.

source: Changing pseudo-custom attribute '{0}' of {1} requires restarting the application
pl: Zmiana atrybutu pseudoniestandardowego elementu „{0}” z {1} wymaga ponownego uruchomienia aplikacji

source: Changing source file '{0}' in a stale project '{1}' has no effect until the project is rebuit; {2}
pl: Zmiana pliku źródłowego „{0}” w nieaktualnym projekcie „{1}” nie ma żadnego efektu, dopóki projekt nie zostanie przebudowany; {2}

source: Changing the containing namespace of '{0}' from '{1}' to '{2}' requires restarting the application
pl: Zmiana zawierającej przestrzeni nazw „{0}” z „{1}” na „{2}” wymaga ponownego uruchomienia aplikacji

source: Changing the signature of {0} requires restarting the application.
cs: Změna podpisu {0} vyžaduje restartování aplikace.
es: Para cambiar la firma de {0} es necesario reiniciar la aplicación.
ko: {0} 서명을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana podpisu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar a assinatura de {0} requer a reinicialização do aplicativo.
ru: Изменение подписи {0} требует перезапуска приложения.

source: Conditional alternation is missing a closing parenthesis after the group number {0}
cs: V podmíněné alternaci chybí pravá závorka za číslem skupiny {0}.
es: A la alternancia condicional le falta un paréntesis de cierre después del número de grupo {0}
pl: W zmianie warunkowej brakuje nawiasu zamykającego po numerze grupy {0}
pt_br: A alternância condicional não tem um parêntese de fechamento após o número do grupo {0}

source: Conditional alternation refers to an undefined group number {0}
cs: Podmíněná alternace odkazuje na nedefinované číslo skupiny {0}.
es: La alternancia condicional hace referencia a un número de grupo no definido {0}
pl: Zmiana warunkowa odwołuje się do niezdefiniowanego numeru grupy {0}
pt_br: Alternância condicional refere-se a um número de grupo indefinido {0}

source: Conflict(s) detected.
cs: Zjistily se konflikty.
es: Conflicto(s) detectado(s).
ko: 충돌이 감지되었습니다.
pl: Wykryto konflikty.
pt_br: Conflito(s) detectado(s).
ru: Обнаружены конфликты.

source: Convert to 'field' property
cs: Převést na vlastnost field
es: Convertir en la propiedad “field”
pl: Konwertuj na właściwość „field'
pt_br: Converter em propriedade "field"

source: Extension '{0}' is already registered.
cs: Rozšíření {0} je již zaregistrováno.
es: La extensión “{0}” ya está registrada.
pl: Zestaw „{0}” jest już zarejestrowany.
pt_br: A extensão "{0}" já está registrada.

source: Extension '{0}' was not registered.
cs: Rozšíření {0} nebylo zaregistrováno.
es: No se registró la extensión “{0}”.
pl: Rozszerzenie „{0}” nie zostało zarejestrowane.
pt_br: A extensão "{0}" não foi registrada.

source: Generate Equals(...)
cs: Generovat Equals(...)
ko: Equals(...) 생성
pl: Generuj metodę równa się(...)
pt_br: Gerar é Igual a(...)

source: Generate constructor from members...
cs: Generovat konstruktor od členů...
es: Generar constructor a partir de miembros...
ko: 멤버에서 생성자 생성...
pl: Generuj konstruktor na podstawie składowych...
pt_br: Gerar construtor a partir de membros...
ru: Создать конструктор из элементов...

source: Insufficient or invalid hexadecimal digits
cs: Nedostatečné nebo neplatné šestnáctkové číslice
es: Dígitos hexadecimales insuficientes o no válidos
pl: Niewystarczające lub nieprawidłowe cyfry szesnastkowe
pt_br: Dígitos hexadecimais insuficientes ou inválidos

source: Move declaration near reference (may change semantics)
cs: Přesunout deklaraci blízko odkazu (může se změnit sémantika)
es: Mover declaración cerca de referencia (puede cambiar semántica)
ko: 선언을 참조 근처로 이동(의미 체계가 변경될 수 있음)
pl: Przenieś deklarację w pobliżu odwołania (może zmienić semantykę)
pt_br: Mover declaração para perto da referência (pode alterar a semântica)
ru: Переместить объявление рядом со ссылкой (может изменить семантику)

source: Multiple handlers found for message {0}.
cs: Pro zprávu {0} bylo nalezeno více obslužných rutin.
es: Se encontraron varios controladores para el mensaje {0}.
pl: Znaleziono wiele modułów obsługujących dla komunikatu {0}.
pt_br: Vários manipuladores encontrados para a mensagem {0}.

source: .NET Code Actions
cs: Akce kódu .NET
es: Acciones de código de .NET
ko: .NET 코드 작업
pl: Akcje kodu platformy .NET
pt_br: Ações de código do .NET
ru: Действия кода .NET

source: Nested quantifier '{0}'
cs: Vnořený kvantifikátor {0}
es: Cuantificador anidado “{0}”
ko: 중첩 수량자 {0}입니다.
pl: Zagnieżdżony kwantyfikator „{0}”
pt_br: Quantificador aninhado "{0}"

source: No extension registered as '{0}'.
cs: Není zaregistrované žádné rozšíření {0}.
es: No hay ninguna extensión registrada como “{0}”.
pl: Nie zarejestrowano żadnego rozszerzenia jako „{0}”.
pt_br: Nenhuma extensão registrada como "{0}".

source: No extensions registered at '{0}'.
cs: V {0} nejsou zaregistrovaná žádná rozšíření.
es: No hay extensiones registradas en “{0}”.
pl: W „{0}” nie zarejestrowano żadnych rozszerzeń.
pt_br: Nenhuma extensão registrada em "{0}".

source: No handler found for message {0}.
cs: Pro zprávu {0} nebyla nalezena žádná obslužná rutina .
es: No se encontró ningún controlador para el mensaje {0}.
pl: Nie znaleziono modułu obsługującego dla komunikatu {0}.
pt_br: Nenhum manipulador encontrado para a mensagem {0}.

source: No valid statement range to extract
cs: Žádný platný rozsah příkazů pro extrakci
es: No hay un intervalo válido de instrucciones para extraer.
ko: 추출하는 데 유효한 문 범위가 없습니다.
pl: Brak prawidłowego zakresu instrukcji do wyodrębnienia
pt_br: Nenhum intervalo de instruções válido para extrair
ru: Отсутствует допустимый диапазон операторов для извлечения

source: Not all code paths return
cs: Ne všechny cesty kódu vracejí
es: No todas las rutas de acceso de código vuelven
ko: 일부 코드 경로가 반환됩니다.
pl: Nie wszystkie ścieżki w kodzie zwracają wartość
pt_br: Nem todos os caminhos de código são retornados
ru: Не все пути к коду возвращают значения

source: Project references mutliple assemblies of the same simple name '{0}': {1}. Changing a reference to such an assembly requires restarting the application.
cs: Projekt odkazuje na více sestavení se stejným jednoduchým názvem {0}: {1}. Změna odkazu na takové sestavení vyžaduje restartování aplikace.
es: El proyecto hace referencia a varios ensamblados con el mismo nombre simple “{0}”: {1}. Cambiar una referencia a uno de estos ensamblados requiere reiniciar la aplicación.
pl: Projekt odwołuje się do wielu zestawów o tej samej prostej nazwie „{0}”: {1}. Zmiana odwołania do takiego zestawu wymaga ponownego uruchomienia aplikacji.
pt_br: O projeto referencia vários assemblies com o mesmo nome simples "{0}": {1}. Alterar uma referência a esse assembly requer a reinicialização do aplicativo.

source: Pull '{0}' up to ...
cs: Povýšit {0} na...
es: Extraer '{0}' hasta...
ko: '{0}'을(를) 다음으로 끌어오기...
pl: Ściągnij elementy „{0}” aż do...
pt_br: Efetuar pull de "{0}" até...
ru: Извлечь "{0}" до ...

source: Quantifier '{0}' following nothing
cs: Kvantifikátor {0} za ničím nenásleduje.
es: El cuantificador “{0}” después de nada
pl: Kwantyfikator „{0}” nie obserwuje niczego
pt_br: Nada precede o quantificador "{0}"

source: Quantifier and capture group numbers must be less than or equal to Int32.MaxValue
cs: Kvantifikátor a čísla skupin digitalizace musí být menší nebo rovny hodnotě Int32.MaxValue.
es: Los números de grupo cuantificador y captura deben ser menores o iguales que Int32.MaxValue
pl: Numery kwantyfikatora i grup przechwytywania muszą być mniejsze lub równe wartości Int32.MaxValue
pt_br: O quantificador e os números do grupo de captura devem ser menores ou iguais a Int32.MaxValue

source: Reference to undefined group name '{0}'
cs: Odkaz na nedefinovaný název skupiny {0}
es: Referencia al nombre de grupo no definido “{0}”
ko: 정의되지 않은 그룹 이름 {0}에 대한 참조입니다.
pl: Odwołanie do niezdefiniowanej nazwy grupy „{0}”
pt_br: Referência ao nome do grupo indefinido "{0}"

# Regex_name1
source: name1
fr: nom1
pl: nazwa1
ru: имя1
zh_hant: 名稱 1

# Regex_name2
source: name2
fr: nom2
pl: nazwa2
ru: имя2
zh_hant: 名稱 2

source: Semantic Search
cs: Sémantické vyhledávání
es: Búsqueda semántica
pl: Wyszukiwanie semantyczne
pt_br: Pesquisa Semântica
ru: Семантический поиск
tr: Anlamsal Arama
