Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Illegal string character
cs: Neplatný znak řetězce
de: Ungültiges Zeichenfolgenzeichen
es: Carácter de cadena no válido
it: Carattere stringa non valido
ja: 文字列の文字が正しくありません
ko: 문자열 문자가 잘못되었습니다.
pl: Niedozwolony znak ciągu
pt_br: Caractere ilegal da cadeia de caracteres
ru: Недопустимый символ строки
tr: Geçersiz dize karakteri
zh_hans: 非法字符串字符

source: Illegal whitespace character
cs: Neplatný prázdný znak
de: Unzulässiges Leerzeichen
es: Carácter de espacio en blanco no válido
it: Carattere di spazio vuoto non valido
ja: 無効な空白文字
ko: 잘못된 공백 문자
pl: Niedozwolony biały znak
pt_br: Caractere ilegal de espaço em branco
ru: Недопустимый символ пробела
tr: Geçersiz boşluk karakteri
zh_hans: 非法的空白字符

# Illegal_x_y_with_x_less_than_y
source: Illegal {x,y} with x > y
cs: Neplatné {x,y} s x > y
de: Illegaler {x,y}-Wert mit x > y.
es: Ilegales {x,y} con x > y
fr: {x,y} non autorisé avec x > y
it: {x,y} non valido con x > y
ja: {x,y} で x > y は無効です
ko: x > y인 잘못된 {x,y}입니다.
pl: Niedozwolone wyrażenie {x,y} z wartością x > y
pt_br: {x,y} ilegal com x> y
ru: Неправильное использование {x,y} в x > y
tr: Yasadışı {x,y} x > y
zh_hans: x > y 的 {x,y} 无效
zh_hant: x 大於 y 的 {x,y} 不符合格式

source: Implement '{0}' explicitly
cs: Implementovat rozhraní {0} explicitně
de: "{0}" explizit implementieren
es: Implementar "{0}" de forma explícita
fr: Implémenter '{0}' explicitement
it: Implementa '{0}' in modo esplicito
ja: '{0}' を明示的に実装する
ko: '{0}'을(를) 명시적으로 구현
pl: Jawnie zaimplementuj interfejs „{0}”
pt_br: Implementar '{0}' explicitamente
ru: Реализовать "{0}" явно
tr: '{0}' öğesini açıkça uygula
zh_hans: 显式实现 "{0}"
zh_hant: 明確實作 '{0}'

source: Implement '{0}' implicitly
cs: Implementovat rozhraní {0} implicitně
de: "{0}" implizit implementieren
es: Implementar "{0}" de forma implícita
fr: Implémenter '{0}' implicitement
it: Implementa '{0}' in modo implicito
ja: '{0}' を暗黙的に実装する
ko: '{0}'을(를) 암시적으로 구현
pl: Niejawnie zaimplementuj interfejs „{0}”
pt_br: Implementar '{0}' implicitamente
ru: Реализовать "{0}" неявно
tr: '{0}' öğesini örtük olarak uygula
zh_hans: 隐式实现 "{0}"
zh_hant: 隱含實作 '{0}'

source: Implement abstract class
de: Abstrakte Klasse implementieren
fr: Implémenter une classe abstraite
it: Implementa la classe astratta
ja: 抽象クラスの実装
zh_hans: 实现抽象类
zh_hant: 實作抽象類別

source: Implement all interfaces explicitly
cs: Implementovat všechna rozhraní explicitně
de: Alle Schnittstellen explizit implementieren
es: Implementar todas las interfaces de forma explícita
fr: Implémenter toutes les interfaces explicitement
it: Implementa tutte le interfacce in modo esplicito
ja: すべてのインターフェイスを明示的に実装する
ko: 모든 인터페이스를 명시적으로 구현
pl: Jawnie zaimplementuj wszystkie interfejsy
pt_br: Implementar todas as interfaces explicitamente
ru: Реализовать все интерфейсы явно
tr: Tüm arabirimleri açıkça uygula
zh_hans: 显式实现所有接口
zh_hant: 明確實作所有介面

source: Implement all interfaces implicitly
cs: Implementovat všechna rozhraní implicitně
de: Alle Schnittstellen implizit implementieren
es: Implementar todas las interfaces de forma implícita
fr: Implémenter toutes les interfaces implicitement
it: Implementa tutte le interfacce in modo implicito
ja: すべてのインターフェイスを暗黙的に実装する
ko: 모든 인터페이스를 암시적으로 구현
pl: Niejawnie zaimplementuj wszystkie interfejsy
pt_br: Implementar todas as interfaces implicitamente
ru: Реализовать все интерфейсы неявно
tr: Tüm arabirimleri örtük olarak uygula
zh_hans: 隐式实现所有接口
zh_hant: 隱含實作所有介面

source: Implement all members explicitly
de: Alle Member explizit implementieren
fr: Implémenter tous les membres explicitement
it: Implementare tutti i membri in modo esplicito
ja: すべてのメンバーを明示的に実装する
zh_hans: 显式实现所有成员
zh_hant: 明確實作所有成員

source: Implement explicitly
cs: Implementovat explicitně
de: Explizit implementieren
es: Implementar de forma explícita
fr: Implémenter explicitement
it: Implementa in modo esplicito
ja: 明示的に実装する
ko: 명시적으로 구현
pl: Zaimplementuj jawnie
pt_br: Implementar explicitamente
ru: Реализовать явно
tr: Açıkça uygula
zh_hans: 显式实现
zh_hant: 明確實作

source: Implement implicitly
cs: Implementovat implicitně
de: Implizit implementieren
es: Implementar de forma implícita
fr: Implémenter implicitement
it: Implementa in modo implicito
ja: 暗黙的に実装する
ko: 암시적으로 구현
pl: Zaimplementuj niejawnie
pt_br: Implementar implicitamente
ru: Реализовать неявно
tr: Örtük olarak uygula
zh_hans: 隐式实现
zh_hant: 隱含實作

source: Implement remaining members explicitly
de: Verbleibende Member explizit implementieren
fr: Implémenter les membres restants explicitement
it: Implementare i membri rimanenti in modo esplicito
ja: 残りのメンバーを明示的に実装する
zh_hans: 显式实现剩余成员
zh_hant: 明確實作剩餘的成員

source: Implement through '{0}'
de: Über "{0}" implementieren
fr: Implémenter via '{0}'
it: Implementa tramite '{0}'
ja: '{0}' を通じて実装します
zh_hans: 通过“{0}”实现
zh_hant: 透過 '{0}' 實作

# Incomplete_character_escape
source: Incomplete \p{X} character escape
cs: Neúplné uvození znaků \p{X}
de: Unvollständiges \p{X}-Escapezeichen.
es: Escape de carácter incompleto \p{X}
fr: Caractère d'échappement \p{X} incomplet
it: Sequenza di caratteri di escape \p{X} incompleta
ja: 不完全な \p{X} 文字エスケープです
ko: 불완전한 \p{X} 문자 이스케이프
pl: Niekompletna sekwencja ucieczki znaku \p{X}
pt_br: Escape de caractere incompleto \p{X}
ru: Незавершенная escape-последовательность \p{X}
tr: Tamamlanmamış \p{X} karakter kaçış
zh_hans: \p{X} 字符转义不完整
zh_hant: 不完整的 \p{X} 字元逸出

source: Indent all arguments
cs: Odsadit všechny argumenty
de: Alle Argumente einrücken
es: Aplicar sangría a todos los argumentos
fr: Mettre en retrait tous les arguments
it: Imposta rientro per tutti gli argomenti
ja: すべての引数にインデントを設定します
ko: 모든 인수 들여쓰기
pl: Dodaj wcięcie dla wszystkich argumentów
pt_br: Recuar todos os argumentos
ru: Добавить отступы для всех аргументов
tr: Tüm bağımsız değişkenleri girintile
zh_hans: 缩进所有参数
zh_hant: 將所有引數縮排

source: Indent all elements
cs: Odsadit všechny elementy
de: Alle Elemente einziehen
es: Aplicar sangría a todos los elementos
it: Applica un rientro a tutti gli elementi
ja: すべての要素をインデント
ko: 모든 요소 한 수준 내리기
pl: Zwiększ wcięcie wszystkich elementów
pt_br: Aplicar recuo a todos os elementos
ru: Добавить отступ для всех элементов
tr: Tüm öğeleri girintile
zh_hans: 缩进所有元素

source: Indent all parameters
cs: Odsadit všechny parametry
de: Alle Parameter einrücken
es: Aplicar sangría a todos los parámetros
fr: Mettre en retrait tous les paramètres
it: Imposta rientro per tutti i parametri
ja: すべてのパラメーターにインデントを設定します
ko: 모든 매개 변수 들여쓰기
pl: Dodaj wcięcie dla wszystkich parametrów
pt_br: Recuar todos os parâmetros
ru: Добавить отступы для всех параметров
tr: Tüm parametreleri girintile
zh_hans: 缩进所有参数
zh_hant: 將所有參數縮排

source: Indent wrapped arguments
cs: Odsadit zalomené argumenty
de: Umschlossene Argumente einrücken
es: Argumentos con la sangría ajustada
fr: Mettre en retrait les arguments enveloppés
it: Imposta rientro per argomenti con ritorno a capo
ja: 折り返された引数にインデントを設定します
ko: 래핑된 인수 들여쓰기
pl: Dodaj wcięcie dla zawiniętych argumentów
pt_br: Recuar argumentos encapsulados
ru: Добавить отступы для свернутых аргументов
tr: Sarmalanan bağımsız değişkenleri girintile
zh_hans: 缩进包装的参数
zh_hant: 將包裝的引數縮排

source: Indent wrapped parameters
cs: Odsadit zalomené parametry
de: Einzug für umschlossene Parameter
es: Parámetros con la sangría ajustada
fr: Mettre en retrait les paramètres enveloppés
it: Imposta rientro per parametri con ritorno a capo
ja: 折り返されたパラメーターにインデントを設定します
ko: 래핑된 매개 변수 들여쓰기
pl: Dodaj wcięcie dla zawiniętych parametrów
pt_br: Recuar parâmetros encapsulados
ru: Создать отступы для свернутых параметров
tr: Sarmalanan parametreleri girintile
zh_hans: 缩进包装参数
zh_hant: 將換行參數縮排

source: Inline '{0}'
cs: Inline refaktoring metody {0}
de: "{0}" inline einbinden
es: En línea "{0}"
it: Imposta '{0}' come inline
ja: インライン '{0}'
ko: '{0}'을(를) 인라인으로 지정
pl: Wstaw środwierszowo metodę „{0}”
pt_br: Embutir '{0}'
ru: Встроенный метод "{0}"
tr: '{0}' öğesini satır içine al
zh_hans: 内联“{0}”
zh_hant: 內嵌 '{0}'

source: Inline and keep '{0}'
cs: Inline refaktoring metody {0} se zachováním deklarace
de: "{0}" inline einbinden und beibehalten
es: Alinear y mantener "{0}"
fr: Inline et conserver '{0}'
it: Imposta come inline e mantieni '{0}'
ja: インラインおよび '{0}' の保持
ko: '{0}'을(를) 인라인으로 지정 및 유지
pl: Wstaw środwierszowo i zachowaj metodę „{0}”
pt_br: Embutir e manter '{0}'
ru: Сделать "{0}" встроенным и сохранить его
tr: '{0}' öğesini satır içine al ve koru
zh_hans: 内联并保留“{0}”
zh_hant: 內嵌並保留 '{0}'

source: Inline temporary variable
cs: Dočasná vložená proměnná
de: Inline temporär variabel
es: Variable temporal en línea
it: Variabile temporanea inline
ja: インラインの一時変数
ko: 인라인 임시 변수
pl: Wstawiona zmienna tymczasowa
pt_br: Variável temporária embutida
ru: Встроить временную переменную
tr: Satır içi geçici değişken
zh_hans: 内联临时变量

source: Insufficient hexadecimal digits
de: Nicht genügend Hexadezimalziffern.
fr: Chiffres hexadécimaux insuffisants
it: Cifre esadecimali insufficienti
ja: 16 進数の数字が正しくありません
tr: Yetersiz onaltılık basamak
zh_hans: 无效的十六进制数字
zh_hant: 十六進位數位不足

source: Introduce constant
cs: Zavést konstantu
de: Konstante einfügen
es: Introducir la sangría
fr: Introduire une constante
it: Introduci costante
ja: 定数を導入します
ko: 상수 지정
pl: Wprowadź stałą
pt_br: Introduzir a constante
ru: Добавить константу
tr: Sabit ekle
zh_hans: 引入常量
zh_hant: 引進常數

source: Introduce field
cs: Zavést pole
de: Feld einführen
es: Introducir campo
fr: Introduire le champ
it: Introduci campo
ja: フィールドを導入します
ko: 필드 지정
pl: Wprowadź pole
pt_br: Introduzir campo
ru: Добавить поле
tr: Alan ekle
zh_hans: 介绍领域
zh_hant: 引進欄位

source: Introduce local
cs: Zavést místní
de: Lokale Variable einführen
es: Introducir local
fr: Introduire un élément local
it: Introduci variabile locale
ja: ローカルを導入します
ko: 로컬 소개
pl: Wprowadź zmienną lokalną
pt_br: Introduzir o local
ru: Добавить локальный оператор
tr: Yerel ekle
zh_hans: 引入局部
zh_hant: 引進區域函式

source: Introduce parameter for '{0}'
cs: Zavést parametr pro{0}
de: Parameter für "{0}" einführen
es: Parámetro Introduce para '{0}'
it: Introduci parametro per '{0}'
ja: '{0}' のパラメーターを導入する
ko: '{0}'에 대한 매개 변수 지정
pl: Wprowadź parametr dla elementu "{0}"
pt_br: Apresentar parâmetro para '{0}'
ru: Ввести параметр для "{0}"
tr: {0} için parametre ekle
zh_hans: 为 '{0}' 引入参数

source: Introduce parameter for all occurrences of '{0}'
cs: Zavést parametr pro všechny výskyty položky {0}
de: Parameter für alle Vorkommen von "{0}" einführen
es: Parámetro Introduce para todas las repeticiones de '{0}'
it: Introdurre il parametro per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対してパラメーターを導入する
ko: '{0}'의 모든 항목에 대한 매개 변수를 지정합니다.
pl: Wprowadź parametr dla wszystkich wystąpień elementu "{0}"
pt_br: Apresentar parâmetro para todas as ocorrências de '{0}'
ru: Введите параметр для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için parametre ekle
zh_hans: 为 '{0}' 的所有出现引入参数

source: Introduce query variable
cs: Zavést proměnnou dotazu
de: Abfragevariable bereitstellen
es: Introducir la variable de consulta
fr: Introduire la variable de requête
it: Introduci la variabile di query
ja: クエリ変数を導入します
ko: 쿼리 변수 지정
pl: Wprowadź zmienną zapytania
pt_br: Introduzir a variável de consulta
ru: Добавить переменную запроса
tr: Sorgu değişkeni ekle
zh_hans: 引入查询变量
zh_hant: 引進查詢變數

source: Invalid JSON pattern
cs: Neplatný vzor JSON
de: Ungültiges JSON-Muster
es: Patrón JSON no válido
it: Modello JSON non valido
ja: 無効な JSON パターン
ko: 잘못된 JSON 패턴
pl: Nieprawidłowy wzorzec JSON
pt_br: Padrão JSON inválido
ru: Недопустимый шаблон JSON
tr: Geçersiz JSON deseni
zh_hans: JSON 模式无效

source: Invalid constructor name
cs: Neplatný název konstruktoru
de: Ungültiger Konstruktorname
es: Nombre de constructor no válido
it: Nome costruttore non valido
ja: 無効なコンストラクター名
ko: 잘못된 생성자 이름
pl: Nieprawidłowa nazwa konstruktora
pt_br: Nome do construtor inválido
ru: Недопустимое имя конструктора
tr: Geçersiz oluşturucu adı
zh_hans: 构造函数名称无效

source: Invalid escape sequence
cs: Neplatná řídicí sekvence
de: Ungültige Escapesequenz
es: Secuencia de escape no válida
it: Sequenza di escape non valida
ja: 無効なエスケープ シーケンス
ko: 잘못된 이스케이프 시퀀스
pl: Nieprawidłowa sekwencja ucieczki
pt_br: Sequência de escape inválida
ru: Недопустимая escape-последовательность
tr: Geçersiz kaçış dizisi
zh_hans: 转义序列无效。

source: Invalid group name: Group names must begin with a word character
cs: Neplatný název skupiny: Názvy skupin musí začínat znakem slova.
de: Ungültiger Gruppenname: Gruppennamen müssen mit einem Wortzeichen beginnen.
es: Nombre de grupo no válido: nombres de grupo deben comenzar con un carácter de palabra
fr: Nom de groupe non valide : les noms de groupe doivent commencer par un caractère alphabétique
it: Nome di gruppo non valido: i nomi di gruppo devono iniziare con un carattere alfanumerico
ja: 無効なグループ名: グループ名は単語文字で始める必要があります
ko: 잘못된 그룹 이름: 그룹 이름은 단어 문자로 시작해야 합니다.
pl: Nieprawidłowa nazwa grupy: nazwy grup muszą rozpoczynać się od znaku wyrazu
pt_br: Nome de grupo inválido: nomes de grupos devem começar com um caractere de palavra
ru: Недопустимое имя группы: имя группы должно начинаться с буквы
tr: Geçersiz grup adı: grup adları bir sözcük karakteri ile başlamalıdır
zh_hans: 组名无效: 组名必须以单词字符开头
zh_hant: 群組名稱無效: 群組名稱必須以文字字元開頭

source: Invalid number
cs: Neplatné číslo
de: Ungültige Zahl
es: Número no válido
it: Numero non valido
ja: 無効な数字
ko: 잘못된 숫자
pl: Nieprawidłowy numer
pt_br: Número inválido
ru: Недопустимое число
tr: Geçersiz sayı
zh_hans: 无效数字

source: Invalid property name
cs: Neplatný název vlastnosti
de: Ungültiger Eigenschaftenname
es: Nombre de propiedad no válido
it: Nome proprietà non valido
ja: 無効なプロパティ名
ko: 잘못된 속성 이름
pl: Nieprawidłowa nazwa właściwości
pt_br: Nome de propriedade inválido
ru: Недопустимое имя свойства
tr: Geçersiz özellik adı
zh_hans: 属性名无效

source: Invalid regex pattern
cs: Neplatný vzor regulárního výrazu
de: Ungültiges Regex-Muster
es: Patrón regex no válido
it: Modello regex non valido
ja: 無効な RegEx パターン
ko: 잘못된 regex 패턴
pl: Nieprawidłowy wzorzec wyrażenia regularnego
pt_br: Padrão Regex inválido
ru: Недопустимый шаблон регулярного выражения
tr: Geçersiz normal ifade deseni
zh_hans: 无效 Regex 模式

source: Invalid selection.
cs: Neplatný výběr
de: Ungültige Auswahl.
es: Selección no válida.
it: Selezione non valida.
ja: 選択が無効です。
ko: 잘못된 선택 항목입니다.
pl: Nieprawidłowe zaznaczenie.
pt_br: Seleção inválida.
ru: Недопустимое выделение.
tr: Geçersiz seçim.
zh_hans: 无效的选择。

source: JSON issue: {0}
cs: Problém s JSON: {0}
de: JSON-Problem: {0}
es: Problema de JSON: {0}
it: Problema JSON: {0}
ja: JSON の問題: {0}
ko: JSON 문제: {0}
pl: Problem JSON: {0}
pt_br: Problema de JSON: {0}
ru: Проблема JSON: {0}
tr: JSON sorunu: {0}
zh_hans: JSON 问题: {0}

source: Invert conditional
cs: Převrátit podmínku
de: Bedingten Operator umkehren
es: Invertir condicional
fr: Inverser un élément conditionnel
it: Inverti espressione condizionale
ja: 条件を反転します
ko: 조건 반전
pl: Odwróć warunkowe
pt_br: Inverter condicional
ru: Инвертировать условный оператор
tr: Koşullu öğeyi ters çevir
zh_hans: 反转条件
zh_hant: 反轉條件

source: Load from: '{0}'
cs: Načíst z {0}
de: Laden von: {0}
es: Cargar desde: "{0}"
it: Carica da: '{0}'
ja: 読み込み元: '{0}'
ko: 로드 위치: '{0}'
pl: Załaduj z: „{0}”
pt_br: Carregar de: '{0}'
ru: Загрузить из: "{0}"
tr: Şuradan yükle: '{0}'
zh_hans: 从以下位置加载: "{0}"

source: Making a method an iterator requires restarting the application because is not supported by the runtime.
cs: Nastavení metody jako iterátor vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Festlegen einer Methode als Iterator erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para convertir un método en iterador, es necesario reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Per rendere un metodo un iteratore, è necessario riavviare l'applicazione perché non è supportata dal runtime.
ja: ランタイムでサポートされていないため、メソッドを反復子にするには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 메서드를 반복기로 만들려면 애플리케이션을 다시 시작해야 합니다.
pl: Ustanawianie metody interatorem wymaga ponownego uruchomienia aplikacji, ponieważ nie jest to obsługiwane przez środowisko uruchomieniowe.
pt_br: Tornar um método um iterador requer a reinicialização do aplicativo porque não há suporte para o tempo de execução.
ru: Чтобы сделать метод итератором, требуется перезапустить приложение, так как это не поддерживается средой выполнения.
tr: Bir metodu yineleyici yapmak çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 使方法成为迭代器需要重启应用程序，因为运行时不支持此操作。

source: Making a method asynchronous requires restarting the application because is not supported by the runtime.
cs: Nastavení metody jako asynchronní vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Festlegen einer Methode als asynchron erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para convertir un método en asincrónico, es necesario reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Per rendere un metodo asincrono, è necessario riavviare l'applicazione perché non è supportata dal runtime.
ja: ランタイムでサポートされていないため、メソッドを非同期にするには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 메서드를 비동기화하려면 애플리케이션을 다시 시작해야 합니다.
pl: Ustanawianie metody asynchroniczną wymaga ponownego uruchomienia aplikacji, ponieważ nie jest to obsługiwane przez środowisko uruchomieniowe.
pt_br: Tornar um método assíncrono requer reiniciar o aplicativo porque não há suporte para o tempo de execução.
ru: Чтобы сделать метод асинхронным, требуется перезапустить приложение, так как это не поддерживается средой выполнения.
tr: Bir metodu zaman uyumsuz yapmak çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 使方法异步需要重启应用程序，因为运行时不支持此操作。

source: malformed
de: fehlerhaft
fr: incorrecte
it: non valido
ja: 不正な形式
tr: Hatalı biçimlendirilmiş
zh_hans: 格式错误
zh_hant: 語式錯誤

# Malformed_character_escape
source: Malformed \p{X} character escape
cs: Chybně formátovaná řídicí sekvence znaků \p{X}
de: Falsch formatiertes \p{X}-Escapezeichen.
es: Escape de carácter incorrecto \p{X}
fr: Caractère d'échappement incorrect \p{X}
it: Sequenza di caratteri di escape \\p{X} non valida
ja: 間違った形式の \p{X} エスケープ文字です
ko: 형식이 잘못된 \p{X} 문자 이스케이프
pl: Źle sformułowana sekwencja ucieczki znaku \p{X}
pt_br: Escape de caractere malformado \p{X}
ru: Неправильная escape-последовательность \p{X}
tr: Hatalı biçimlendirilmiş \p{X} karakter kaçış
zh_hans: \p{X} 字符转义格式错误
zh_hant: \p{X} 字元逸出語式錯誤

# Malformed_named_back_reference
source: Malformed \k<...> named back reference
cs: Chybně naformátovaný pojmenovaný zpětný odkaz \k<...>
de: Falsch formatierter mit \k<...> benannter Verweis.
es: Referencia atrás con nombre \k<...> mal formado
fr: Référence arrière nommée \k<...> incorrecte
it: Backreference denominato \k<...> in formato non corretto
ja: 間違った形式の \k<...>名前付き逆参照です
ko: \k<...> 역참조 형식이 잘못되었습니다.
pl: Odwołanie wsteczne \k<...> ma nieprawidłową postać
pt_br: Referência inversa \k<...> mal formada
ru: Неправильная именованная обратная ссылка \k<...>
tr: Hatalı biçimlendirilmiş \k<...> arka başvuru adı
zh_hans: 名为“向后引用”的 \k<...> 格式不正确
zh_hant: 以 \k<...> 命名的反向參考語式錯誤

source: Merge with nested '{0}' statement
cs: Sloučit s vnořeným příkazem {0}
de: Mit geschachtelter {0}-Anweisung zusammenführen
es: Combinar con la instrucción "{0}" anidada
fr: Fusionner avec l'instruction '{0}' imbriquée
it: Unisci con istruzione '{0}' nidificata
ja: 入れ子になった '{0}' ステートメントとマージします
ko: 중첩 '{0}' 문과 병합
pl: Scal z zagnieżdżoną instrukcją „{0}”
pt_br: Mesclar com a instrução '{0}' aninhada
ru: Объединить с вложенным оператором "{0}"
tr: İç içe '{0}' deyimiyle birleştir
zh_hans: 与嵌套的 "{0}" 语句合并
zh_hant: 與巢狀 '{0}' 陳述式合併

source: Merge with next '{0}' statement
cs: Sloučit s dalším příkazem {0}
de: Mit nächster {0}-Anweisung zusammenführen
es: Combinar con la instrucción "{0}" siguiente
fr: Fusionner avec la prochaine instruction '{0}'
it: Unisci con istruzione '{0}' successiva
ja: 次の '{0}' ステートメントとマージします
ko: 다음 '{0}' 문과 병합
pl: Scal z następną instrukcją „{0}”
pt_br: Mesclar com a próxima instrução '{0}'
ru: Объединить со следующим оператором "{0}"
tr: Sonraki '{0}' deyimiyle birleştir
zh_hans: 与下一个 "{0}" 语句合并
zh_hant: 與下一個 '{0}' 陳述式合併

source: Merge with outer '{0}' statement
cs: Sloučit s vnějším příkazem {0}
de: Mit äußerer {0}-Anweisung zusammenführen
es: Combinar con la instrucción "{0}" externa
fr: Fusionner avec l'instruction '{0}' externe
it: Unisci con istruzione '{0}' esterna
ja: 外部の '{0}' ステートメントとマージします
ko: 외부 '{0}' 문과 병합
pl: Scal z zewnętrzną instrukcją „{0}”
pt_br: Mesclar com a instrução '{0}' externa
ru: Объединить с внешним оператором "{0}"
tr: Dıştaki '{0}' deyimiyle birleştir
zh_hans: 与外部 "{0}" 语句合并
zh_hant: 與外部 '{0}' 陳述式合併

source: Merge with previous '{0}' statement
cs: Sloučit s předchozím příkazem {0}
de: Mit vorheriger {0}-Anweisung zusammenführen
es: Combinar con la instrucción "{0}" anterior
fr: Fusionner avec la précédente instruction '{0}'
it: Unisci con istruzione '{0}' precedente
ja: 前の '{0}' ステートメントとマージします
ko: 이전 '{0}' 문과 병합
pl: Scal z poprzednią instrukcją „{0}”
pt_br: Mesclar com a instrução '{0}' anterior
ru: Объединить с предыдущим оператором "{0}"
tr: Önceki '{0}' deyimiyle birleştir
zh_hans: 与上一个 "{0}" 语句合并
zh_hant: 與上一個 '{0}' 陳述式合併

# MethodMustReturnStreamThatSupportsReadAndSeek
source: {0} must return a stream that supports read and seek operations.
cs: Metoda {0} musí vrátit stream, který podporuje operace čtení a hledání.
de: "{0}" muss einen Datenstrom zurückgeben, der Lese- und Suchvorgänge unterstützt.
es: {0} debe devolver una secuencia que admita operaciones de lectura y búsqueda.
fr: {0} doit retourner un flux qui prend en charge les opérations de lecture et de recherche.
it: {0} deve restituire un flusso che supporta operazioni di lettura e ricerca.
ja: {0} は、読み取りとシーク操作をサポートするストリームを返す必要があります。
ko: {0}은(는) 읽기 및 검색 작업을 지원하는 스트림을 반환해야 합니다.
pl: {0} musi zwrócić strumień, który obsługuje operacje odczytu i wyszukiwania.
pt_br: {0} precisa retornar um fluxo compatível com as operações de leitura e busca.
ru: {0} должен возвращать поток, который поддерживает операции чтения и поиска.
tr: {0} okuma ve arama işlemlerini destekleyen bir akış döndürmelidir.
zh_hans: {0} 必须返回支持读取和查找操作的流。
zh_hant: {0} 必須傳回支援讀取和搜尋作業的資料流。

source: Miscellaneous Files
cs: Různé soubory
de: Sonstige Dateien
es: Archivos varios
it: File esterni
ja: その他のファイル
ko: 기타 파일
pl: Różne pliki
pt_br: Arquivos Diversos
ru: Прочие файлы
tr: Diğer Dosyalar
zh_hans: 杂项文件

source: Missing control character
cs: Chybí řídicí znak
de: Fehlendes Steuerzeichen
es: Falta de carácter de control
fr: Caractère de contrôle manquant
it: Carattere di controllo mancante
ja: コントロール文字がありません
ko: 제어 문자가 없습니다.
pl: Brak znaku kontrolnego
pt_br: Caractere de controle ausente
ru: Отсутствует управляющий символ
tr: Eksik denetim karakteri
zh_hans: 缺少控制字符
zh_hant: 缺少控制字元

source: Missing property value
cs: Chybějící hodnota vlastnosti
de: Fehlender Eigenschaftswert
es: Falta el valor de la propiedad
it: Valore della proprietà mancante
ja: プロパティ値がありません
ko: 속성 값이 누락되었습니다.
pl: Brak wartości właściwości
pt_br: Valor da propriedade ausente
ru: Отсутствует значение свойства
tr: Özellik değeri eksik
zh_hans: 缺少属性值
