Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Reported diagnostic '{0}' has a source location '{1}' in file '{2}', which is outside of the given file.
cs: Zdroj vykazované diagnostiky {0} má umístění {1} v souboru {2}, což je mimo daný soubor.
de: Die gemeldete Diagnose "{0}" enthält einen Quellspeicherort "{1}" in der Datei "{2}", der sich außerhalb der angegebenen Datei befindet.
es: El diagnóstico notificado "{0}" tiene una ubicación de origen "{1}" en el archivo "{2}", que está fuera del archivo dado.
fr: Le diagnostic signalé '{0}' a un emplacement source '{1}' dans le fichier '{2}', qui se trouve en dehors du fichier donné.
it: Il percorso di origine '{1}' della diagnostica restituita '{0}' è incluso nel file '{2}', che non è presente nel file specificato.
ja: 報告された診断 '{0}' のソースの場所はファイル '{2}' 内の '{1}' ですが、これは指定されたファイルの外です。
ko: 보고된 진단 '{0}'의 소스 위치 '{1}'이(가) 지정된 파일의 범위 밖인 파일 '{2}'에 있습니다.
pl: Zgłoszone dane diagnostyczne „{0}” mają lokalizację źródłową „{1}” w pliku „{2}”, który jest spoza podanego pliku.
pt_br: O diagnóstico relatado '{0}' tem um local de origem '{1}' no arquivo '{2}', que está fora do arquivo fornecido.
ru: В отчете о диагностике "{0}" используется исходное расположение "{1}" в файле "{2}". Это расположение находится за пределами указанного файла.
tr: Bildirilen tanılamanın ('{0}') kaynak konumu olan '{1}', '{2}' dosyasında ve bu konum, belirtilen dosyanın dışında.
zh_hans: 报告的诊断“{0}”的源位置“{1}”位于文件“{2}”中，后者不是给定文件。
zh_hant: 回報之診斷 '{0}' 中的來源位置 '{1}' 位於檔案 '{2}' 內，而該檔案不在指定的檔案內。

source: in {0} (project {1})
cs: v {0} (projekt {1})
de: in "{0}" (Projekt "{1}")
es: en {0} (proyecto {1})
fr: dans {0} (projet {1})
it: in {0} (progetto {1})
ja: {0} (プロジェクト{1})
ko: {0}(프로젝트 {1})
pl: w {0} (projekt {1})
pt_br: em {0} (projeto {1})
ru: в {0} (проект {1})
tr: {0} içinde (proje {1})
zh_hans: 在 {0} (项目 {1})中
zh_hant: 在 {0} 中 (專案 {1})

source: Move declaration near reference
cs: Přesunout deklaraci do blízkosti odkazu
de: Deklaration nahe Referenz verschieben
es: Mover la declaración cerca de la referencia
fr: Déplacer la déclaration près de la référence
it: Sposta la dichiarazione accanto al riferimento
ja: 宣言を参照の近くに移動します
ko: 참조 근처로 선언 이동
pl: Przenieś deklarację blisko odwołania
pt_br: Mover declaração para próximo da referência
ru: Переместить объявление рядом со ссылкой
tr: Bildirimi başvurunun yanına taşı
zh_hans: 将声明移动至引用附近
zh_hant: 將宣告移近參考

source: Convert to full property
cs: Převést na celou vlastnost
de: In vollständige Eigenschaft konvertieren
es: Convertir en propiedad completa
fr: Convertir en propriété complète
it: Converti in proprietà completa
ja: 自動プロパティに変換する
ko: 전체 속성으로 변환
pl: Konwertuj na pełną właściwość
pt_br: Converter em propriedade completa
ru: Преобразовать в полное свойство
tr: Tam özelliğe dönüştür
zh_hans: 转换为完整属性
zh_hant: 轉換為完整屬性

source: Warning: Method overrides symbol from metadata
cs: Upozornění: Metoda potlačí symbol z metadat.
de: Warnung: Die Methode setzt das Symbol aus den Metadaten außer Kraft.
es: Advertencia: El método reemplaza el símbolo de los metadatos.
fr: Avertissement : La méthode remplace le symbole des métadonnées
it: Avviso: il metodo esegue l'override del simbolo dei metadati
ja: 警告: メソッドがメタデータのシンボルをオーバーライドします
ko: 경고: 메서드가 메타데이터의 기호를 재정의합니다.
pl: Ostrzeżenie: metoda zastępuje symbol z metadanych
pt_br: Aviso: o método substitui o símbolo de metadados
ru: Предупреждение. Метод переопределяет символ из метаданных.
tr: Uyarı: Metot, meta verideki sembolü geçersiz kılıyor
zh_hans: 警告: 方法将替代元数据中的符号
zh_hant: 警告: 方法會覆寫中繼資料的符號

source: Use {0}
cs: Použít {0}
de: {0} verwenden
es: Usar {0}
fr: Utiliser {0}
it: Usa {0}
ja: {0} を使用します
ko: {0} 사용
pl: Użyj {0}
pt_br: Usar {0}
ru: Использовать {0}
tr: {0} kullan
zh_hans: 使用 {0}
zh_hant: 使用 {0}

source: Add argument name '{0}' (including trailing arguments)
cs: Přidat název argumentu {0} (včetně koncových argumentů)
de: Argumentnamen "{0}" (einschließlich nachfolgender Argumente) hinzufügen
es: Agregar el nombre de argumento "{0}" (incluidos los argumentos finales)
fr: Ajouter le nom d'argument '{0}' (ainsi que les arguments de fin)
it: Aggiungi il nome di argomento '{0}' (inclusi gli argomenti finali)
ja: 引数の名前 '{0}' を追加します (末尾の引数を含む)
ko: 인수 이름 '{0}' 추가(후행 인수 포함)
pl: Dodaj nazwę argumentu „{0}” (w tym końcowe argumenty)
pt_br: Adicionar nome de argumento '{0}' (incluindo argumentos à direita)
ru: Добавьте имя аргумента "{0}" (включая конечные аргументы)
tr: '{0}' bağımsız değişken adını ekle (sondaki bağımsız değişkenler dahil)
zh_hans: 添加参数名“{0}”(包括尾随参数)
zh_hant: 新增引數名稱 '{0}' (包括結尾的引數)

source: local function
cs: lokální funkce
de: Lokale Funktion
es: función local
fr: fonction locale
it: funzione locale
ja: ローカル関数
ko: 로컬 함수
pl: funkcja lokalna
pt_br: função local
ru: локальная функция
tr: yerel işlev
zh_hans: 本地函数
zh_hant: 區域函式

source: indexer
es: indizador
fr: indexeur
it: indicizzatore
ja: インデクサー
ko: 인덱서
pl: indeksator
pt_br: indexador
ru: индексатор
tr: dizin oluşturucu
zh_hans: 索引器
zh_hant: 索引子

# Warning_colon_Collection_was_modified_during_iteration
source: Warning: Collection was modified during iteration.
cs: Upozornění: Během iterace se kolekce změnila.
de: Warnung: Die Sammlung wurde bei der Iteration geändert.
es: Advertencia: la colección se modificó durante la iteración.
fr: Avertissement : La collection a été modifiée durant l'itération.
it: Avviso: la raccolta è stata modificata durante l'iterazione.
ja: 警告: 反復処理中にコレクションが変更されました。
ko: 경고: 반복 중 컬렉션이 수정되었습니다.
pl: Ostrzeżenie: kolekcja została zmodyfikowana podczas iteracji.
pt_br: Aviso: a coleção foi modificada durante a iteração.
ru: Внимание! Коллекция изменена во время итерации.
tr: Uyarı: Yineleme sırasında koleksiyon değiştirildi.
zh_hans: 警告: 迭代期间已修改集合。
zh_hant: 警告: 集合已於反覆運算期間被修改

# Warning_colon_Iteration_variable_crossed_function_boundary
source: Warning: Iteration variable crossed function boundary.
cs: Upozornění: Proměnná iterace překročila hranici funkce.
de: Warnung: Die Iterationsvariable hat die Funktionsgrenze überschritten.
es: Advertencia: límite de función cruzada de variable de iteración.
fr: Avertissement : La variable d'itération a traversé la limite de fonction.
it: Avviso: la variabile di iterazione ha superato il limite della funzione.
ja: 警告: 繰り返し変数が関数の境界を超えました。
ko: 경고: 반복 변수가 함수 경계를 벗어났습니다.
pl: Ostrzeżenie: zmienna iteracji przekroczyła granicę funkcji.
pt_br: Aviso: a variável de iteração passou o limite da função.
ru: Внимание! Переменная итерации вышла за границу функции.
tr: Uyarı: Yineleme değişkeni, işlev sınırını geçti.
zh_hans: 警告: 迭代变量跨函数边界。
zh_hant: 警告: 反覆運算變數已跨越函式界線

source: universal full date/time
cs: univerzální datum a čas
de: Universelle(s) vollständige(s) Datum/Uhrzeit
es: fecha/hora completa universal
fr: date/heure complète universelle
it: Data/ora estesa universale
ja: 世界共通の完全な日付/時刻
ko: 범용 전체 날짜/시간
pl: uniwersalna pełna data/godzina
pt_br: data/hora universal por extenso
ru: Универсальный полный формат даты-времени
tr: evrensel tam tarih/saat
zh_hans: 通用完整日期/时间
zh_hant: 國際完整日期/時間

# universal_full_date_time_description
source: The "U" standard format specifier represents a custom date and time format string that is defined by a specified culture's DateTimeFormatInfo.FullDateTimePattern property. The pattern is the same as the "F" pattern. However, the DateTime value is automatically converted to UTC before it is formatted.
cs: Specifikátor standardního formátu U představuje řetězec vlastního formátu data a času definovaný vlastností DateTimeFormatInfo.FullDateTimePattern konkrétní jazykové verze. Vzor je stejný jako vzor F. Hodnota DateTime se ale před formátováním automaticky převede na UTC.
de: Der Standardformatbezeichner "U" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.FullDateTimePattern-Eigenschaft einer angegebenen Kultur definiert ist. Das Muster ist mit dem F-Muster identisch. Der DateTime-Wert wird jedoch automatisch in UTC konvertiert, bevor er formatiert wird.
es: El especificador de formato estándar "U" representa una cadena de formato de fecha y hora personalizada que está definida por una propiedad DateTimeFormatInfo.FullDateTimePattern de una referencia cultural especificada. El patrón es igual que el patrón "F", pero el valor de DateTime se cambia automáticamente a UTC antes de darle formato.
fr: Le spécificateur de format standard "U" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.FullDateTimePattern d'une culture spécifique. Le modèle est identique au modèle "F". Toutefois, la valeur DateTime est automatiquement convertie en heure UTC avant que le format souhaité ne lui soit appliqué.
it: L'identificatore di formato standard "U" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.FullDateTimePattern di impostazioni cultura specifiche. Lo schema è uguale a quello di "F". Il valore DateTime, tuttavia, viene convertito automaticamente in formato UTC prima di essere formattato.
ja: "U" 標準書式指定子は、指定されたカルチャの DateTimeFormatInfo.FullDateTimePattern プロパティで定義されるカスタム日時書式設定文字列を表します。このパターンは "F" パターンと同じです。ただし、DateTime 値は、書式設定される前に自動的に UTC に変換されます。
ko: "U" 표준 형식 지정자는 지정된 문화권의 DateTimeFormatInfo.FullDateTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 패턴은 "F" 패턴과 동일합니다. 그러나 DateTime 값은 형식이 지정되기 전에 자동으로 UTC로 변환됩니다.
pl: Standardowy specyfikator formatu „U” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.FullDateTimePattern określonej kultury. Wzorzec ten działa tak samo jak wzorzec „F”, jednak wartość DateTime jest automatycznie konwertowana na czas UTC przed formatowaniem.
pt_br: O especificador de formato padrão "U" representa uma cadeia de caracteres de formato personalizado de data e hora que é definida pela propriedade DateTimeFormatInfo.FullDateTimePattern de uma cultura especificada. O padrão é o mesmo que o padrão "F". No entanto, o valor DateTime é convertido automaticamente para UTC antes de ser formatado.
ru: Описатель стандартного формата "U" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.FullDateTimePattern заданных языка и региональных параметров. Этот шаблон совпадает с шаблоном "F". Однако перед форматированием значение DateTime автоматически преобразуется в формат UTC.
tr: "U" standart biçim belirticisi, belirtilen bir kültürün DateTimeFormatInfo.FullDateTimePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Desen, "F" deseniyle aynıdır. Ancak DateTime değeri biçimlendirilmeden önce otomatik olarak UTC'ye dönüştürülür.
zh_hans: "U" 标准格式说明符表示由指定区域性的 DateTimeFormatInfo.FullDateTimePattern 属性定义的自定义日期和时间格式字符串。模式与 "F" 模式相同。但在 DateTime 值进行格式设置之前，该值将自动转换为 UTC。
zh_hant: "U" 標準格式規範代表由指定文化特性 (Culture) DateTimeFormatInfo.FullDateTimePattern 屬性所定義的自訂日期和時間格式字串。其模式與 "F" 模式相同。不過，DateTime 值會在格式化前自動轉換為 UTC。

source: universal sortable date/time
cs: univerzální seřaditelné datum a čas
de: Universelle(s) sortierbare(s) Datum/Uhrzeit
es: fecha/hora universal que se puede ordenar
fr: date/heure universelle pouvant être triée
it: Data/ora ordinabile universale
ja: 世界共通の並べ替え可能な日付/時刻
ko: 범용 정렬 가능한 날짜/시간
pl: uniwersalna sortowalna data/godzina
pt_br: data/hora universal classificável
ru: Универсальный формат даты-времени для сортировки
tr: evrensel sıralanabilir tarih/saat
zh_hans: 通用可排序日期/时间
zh_hant: 國際可排序的日期/時間

# universal_sortable_date_time_description
source: The "u" standard format specifier represents a custom date and time format string that is defined by the DateTimeFormatInfo.UniversalSortableDateTimePattern property. The pattern reflects a defined standard, and the property is read-only. Therefore, it is always the same, regardless of the culture used or the format provider supplied. The custom format string is "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". When this standard format specifier is used, the formatting or parsing operation always uses the invariant culture. Although the result string should express a time as Coordinated Universal Time (UTC), no conversion of the original DateTime value is performed during the formatting operation. Therefore, you must convert a DateTime value to UTC by calling the DateTime.ToUniversalTime method before formatting it.
cs: Specifikátor standardního formátu u představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.UniversalSortableDateTimePattern. Vzor dodržuje definovaný standard a vlastnost je určená jen pro čtení. Proto je vždy stejná, bez ohledu na používanou jazykovou verzi nebo zadaného poskytovatele formátu. Řetězec vlastního formátu je yyyy'-'MM'-'dd HH':'mm':'ss'Z'. Když se tento specifikátor standardního formátu použije, operace formátování nebo parsování vždy použije invariantní jazykovou verzi. I když by výsledný řetězec měl vyjadřovat čas ve formátu UTC (Coordinated Universal Time), během operace formátování se původní hodnota DateTime nijak nepřevádí. Proto je nutné ji před formátováním převést na UTC pomocí metody DateTime.ToUniversalTime.
de: Der Standardformatbezeichner "u" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.UniversalSortableDateTimePattern-Eigenschaft definiert ist. Das Muster folgt einem definierten Standard, und die Eigenschaft ist schreibgeschützt. Daher ist sie immer gleich, unabhängig von der verwendeten Kultur oder dem angegebenen Formatanbieter. Die benutzerdefinierte Formatzeichenfolge lautet "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Bei Verwendung dieses Standardformatbezeichners wird bei Formatierung oder Analyse immer die invariante Kultur verwendet. Obwohl die Ergebniszeichenfolge einen Zeitwert als koordinierte Weltzeit (UTC) ausdrücken sollte, findet während der Formatierung keine Konvertierung des ursprünglichen DateTime-Werts statt. Deshalb müssen Sie einen DateTime-Wert vor der Formatierung durch Aufruf der DateTime.ToUniversalTime-Methode in UTC konvertieren.
es: El especificador de formato estándar "u" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.UniversalSortableDateTimePattern. El patrón refleja un estándar definido y la propiedad es de solo lectura. Por lo tanto, siempre es el mismo, independientemente de la referencia cultural utilizada o del proveedor de formato proporcionado. La cadena de formato personalizado es "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Cuando se usa este especificador de formato estándar, la operación de formato o análisis utiliza siempre la referencia cultural invariable. Aunque la cadena de resultado debe expresar una hora como hora universal coordinada (UTC), no se realizará ninguna conversión del valor DateTime original durante la operación de formato. Por lo tanto, debe convertir un valor DateTime a UTC llamando al método DateTime.ToUniversalTime antes de aplicarle formato.
fr: Le spécificateur de format standard "u" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.UniversalSortableDateTimePattern. Le modèle reflète une norme définie, et la propriété est en lecture seule. Elle est donc toujours identique, quelle que soit la culture utilisée ou le fournisseur de format indiqué. La chaîne de format personnalisée est "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Quand ce spécificateur de format standard est utilisé, l'opération qui consiste à appliquer un format ou à exécuter une analyse utilise toujours la culture invariante. Bien que la chaîne résultante soit censée exprimer une heure UTC, aucune conversion de la valeur DateTime d'origine n'est effectuée durant l'opération qui consiste à appliquer le format souhaité. Vous devez donc convertir une valeur DateTime au format UTC en appelant la méthode DateTime.ToUniversalTime avant de lui appliquer le format souhaité.
it: L'identificatore di formato standard "u" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.UniversalSortableDateTimePattern corrente. Lo schema rispecchia uno standard definito e la proprietà è di sola lettura. Sarà quindi sempre lo stesso, indipendentemente dalle impostazioni cultura usate o dal provider di formato specificato. La stringa di formato personalizzata è "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Quando si usa questo identificatore di formato standard, la formattazione o l'operazione di analisi usa sempre le impostazioni cultura inglese non dipendenti da paese/area geografica. Anche se la stringa di risultato deve esprimere un'ora in formato UTC (Coordinated Universal Time), non viene eseguita alcuna conversione del valore DateTime originale durante l'operazione di formattazione. È quindi necessario convertire un valore DateTime in formato UTC chiamando il metodo DateTime.ToUniversalTime prima di eseguire l'operazione di formattazione.
ja: "u" 標準書式指定子は、DateTimeFormatInfo.UniversalSortableDateTimePattern プロパティで定義されているカスタム日時書式設定文字列を表します。このパターンには定義済み標準が反映されています。また、プロパティは読み取り専用です。したがって、使用されているカルチャまたは指定された書式プロバイダーに関係なく、これは常に同じになります。カスタム書式設定文字列は "yyyy'-'MM'-'dd HH':'mm':'ss'Z'" です。この標準書式指定子が使用されている場合、書式設定操作または解析操作では常にインバリアント カルチャが使用されます。 書式設定後の文字列では、時刻が世界協定時刻 (UTC) として表されていなければなりませんが、書式設定操作によって元の DateTime 値が変換されることはありません。このため、書式設定する前に DateTime.ToUniversalTime メソッドを呼び出して、DateTime 値を UTC に変換する必要があります。
ko: "u" 표준 형식 지정자는 DateTimeFormatInfo.UniversalSortableDateTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 패턴은 정의된 표준을 반영하며, 속성은 읽기 전용입니다. 따라서 사용된 문화권이나 지정된 형식 공급자와 관계없이 항상 동일합니다. 사용자 지정 형식 문자열은 "yyyy'-'MM'-'dd HH':'mm':'ss'Z'"입니다. 이 표준 형식 지정자를 사용하면 형식 지정 또는 구문 분석 연산에서 항상 고정 문화권이 사용됩니다.. 결과 문자열은 시간을 UTC(협정 세계시)로 표현해야 하지만, 형식 지정 연산 중에 원래 DateTime 값의 변환이 수행되지 않습니다. 따라서 형식을 지정하기 전에 먼저 DateTime.ToUniversalTime 메서드를 호출하여 DateTime 값을 UTC로 변환해야 합니다.
pl: Standardowy specyfikator formatu „u” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.UniversalSortableDateTimePattern. Wzorzec odpowiada zdefiniowanemu standardowi, a właściwość jest tylko do odczytu. Dlatego jest on zawsze taki sam niezależnie od użytej kultury lub określonego dostawcy formatu. Niestandardowy ciąg formatu to „yyyy'-'MM'-'dd HH':'mm':'ss'Z'”. Gdy jest używany ten standardowy specyfikator formatu, operacja formatowania lub analizowania zawsze używa kultury niezmiennej. Mimo że ciąg wyniku powinien wyrażać godzinę za pomocą uniwersalnego czasu koordynowanego (UTC), podczas operacji formatowania nie jest wykonywana żadna konwersja oryginalnej wartości DateTime. Dlatego przed sformatowaniem wartości DateTime należy skonwertować ją na czas UTC za pomocą wywołania metody DateTime.ToUniversalTime.
pt_br: O especificador de formato padrão "u" representa uma cadeia de caracteres de formato personalizado de data e hora que é definida pela propriedade DateTimeFormatInfo.UniversalSortableDateTimePattern. O padrão reflete um padrão definido e a propriedade é somente leitura. Portanto, é sempre o mesmo, independentemente da cultura usada ou do provedor de formato fornecido. A cadeia de caracteres de formato personalizado é "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Quando esse especificador de formato padrão é usado, a operação de análise ou formatação sempre usa a cultura invariável. Embora a cadeia de caracteres de resultado deva expressar um horário como UTC (Tempo Universal Coordenado), nenhuma conversão do valor original DateTime é executada durante a operação de formatação. Portanto, você precisa converter um valor DateTime para UTC chamando o método DateTime.ToUniversalTime antes de formatá-lo.
ru: Описатель стандартного формата "u" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.UniversalSortableDateTimePattern. Шаблон отражает определенный стандарт, а само свойство доступно только для чтения. Таким образом, данное значение всегда одинаково, независимо от используемых языка и региональных параметров или указанного поставщика формата. Строка пользовательского формата имеет вид "yyyy'-'MM'-'dd HH':'mm':'ss'Z". Когда применяется этот описатель стандартного формата, операция форматирования или анализа всегда использует инвариантные язык и региональные параметры. Хотя результирующая строка должна выражать время в формате UTC, во время операции форматирования преобразование исходного значения DateTime не выполняется. Поэтому перед форматированием необходимо преобразовать значение DateTime в формат UTC, вызвав метод DateTime.ToUniversalTime.
tr: "U" standart biçim belirticisi, DateTimeFormatInfo.UniversalSortableDateTimePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Desen, tanımlanmış bir standardı yansıtır ve özellik salt okunurdur. Bu nedenle, kullanılan kültür veya girilen biçim sağlayıcı ne olursa olsun her zaman aynıdır. Özel biçim dizesi "yyyy'-'MM'-'dd HH':'mm':'ss'Z'". Bu standart biçim belirticisi kullanıldığında, biçimlendirme veya ayrıştırma işlemi her zaman sabit kültürü kullanır. Sonuç dizesi Eşgüdümlü Evrensel Saat (UTC) olarak bir saati ifade etmeliyse de biçimlendirme işlemi sırasında asıl DateTime değerinde dönüştürme işlemi yapılmaz. Bu nedenle bir DateTime değerini biçimlendirmeden önce DateTime.ToUniversalTime yöntemini çağırarak UTC'ye dönüştürmelisiniz.
zh_hans: "U" 标准格式说明符表示由 DateTimeFormatInfo.UniversalSortableDateTimePattern 属性定义的自定义日期和时间格式字符串。模式反映已定义的标准，并且属性是只读的。因此，无论使用何种区域性或提供格式提供程序，它始终是相同的。自定义格式字符串为 "yyyy'-'MM'-'dd HH':'mm':'ss'Z'"。使用此标准格式说明符时，格式设置或分析操作始终使用固定区域性。 虽然结果字符串应将时间表示为协调世界时(UTC)，但在格式设置操作期间不执行原始日期时间值的转换。因此，在设置 DateTime 格式之前，必须通过调用 DateTime.ToUniversalTime 方法将 DateTime 值转换为 UTC。
zh_hant: "u" 標準格式規範代表由 DateTimeFormatInfo.UniversalSortableDateTimePattern 屬性所定義的自訂日期和時間格式字串。此模式會反映出已定義的標準，且屬性為唯讀。因此，不管使用何種文化特性 (Culture) 或提供何種格式提供者，其永遠都相同。自訂格式字串為 "yyyy'-'MM'-'dd HH':'mm':'ss'Z'"。使用此標準格式規範時，格式化或剖析作業永遠不因文化特性而異。 雖然結果字串應以國際標準時間 (UTC) 表示時間，但在格式化作業期間，不會執行原始 DateTime 值的轉換。因此，您必須先呼叫 DateTime.ToUniversalTime 方法，將 DateTime 值轉換為 UTC，再將其格式化。

source: updating usages in containing member
cs: aktualizace použití v obsahujícím členu
de: Verwendungen in enthaltenden Members wird aktualisiert.
es: actualización de los usos en el miembro contenedor
fr: mise à jour des utilisations dans le membre conteneur
it: aggiornamento degli utilizzi nel membro contenitore
ja: それを含むメンバーの使用の更新
ko: 포함하는 멤버에서 사용을 업데이트하는 중
pl: aktualizowanie użyć w zawierającym elemencie członkowskim
pt_br: atualizando os usos em contém membros
ru: обновление директив usage во вложенном элементе
tr: üye içeren içinde güncelleştirme kullanımları
zh_hans: 更新包含成员的用法
zh_hant: 正在更新包含成員中的使用方式

source: updating usages in containing project
cs: aktualizace použití v obsahujícím projektu
de: Verwendungen im enthaltenden Projekt werden aktualisiert.
es: actualización de usos en el proyecto contenedor
fr: mise à jour des utilisations dans le projet conteneur
it: aggiornamento degli utilizzi nel progetto contenitore
ja: それを含むプロジェクトの使用の更新
ko: 포함하는 프로젝트에서 사용을 업데이트하는 중
pl: aktualizowanie użyć w projekcie zawierającym
pt_br: usos em que contém o projeto de atualização
ru: обновление директив usage во вложенном проекте
tr: projeyi içeren kullanımlar güncelleştiriliyor
zh_hans: 更新包含项目中的用法
zh_hant: 正在更新包含專案中的使用方式
