Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_balancing_group_long
source: A balancing group definition deletes the definition of a previously defined group and stores, in the current group, the interval between the previously defined group and the current group. 'name1' is the current group (optional), 'name2' is a previously defined group, and 'subexpression' is any valid regular expression pattern. The balancing group definition deletes the definition of name2 and stores the interval between name2 and name1 in name1. If no name2 group is defined, the match backtracks. Because deleting the last definition of name2 reveals the previous definition of name2, this construct lets you use the stack of captures for group name2 as a counter for keeping track of nested constructs such as parentheses or opening and closing brackets. The balancing group definition uses 'name2' as a stack. The beginning character of each nested construct is placed in the group and in its Group.Captures collection. When the closing character is matched, its corresponding opening character is removed from the group, and the Captures collection is decreased by one. After the opening and closing characters of all nested constructs have been matched, 'name1' is empty.
cs: Definice vyrovnávací skupiny odstraní definici dříve definované skupiny a uloží interval mezi dříve definovanou skupinou a aktuální skupinou do aktuální skupiny. Skupina name1 je aktuální skupina (volitelná), skupina name2 je dříve definovaná skupina a subexpression je libovolný platný vzor regulárního výrazu. Definice vyrovnávací skupiny odstraní definici skupiny name2 a uloží interval mezi skupinami name2 a name1 do skupiny name1. Pokud není definována žádná skupina name2, porovnávání se vrátí zpět. Vzhledem k tomu, že odstraněním poslední definice skupiny name2 se odkryje předchozí definice skupiny name2, umožňuje tento konstruktor použít zásobník zachycení pro skupinu name2 jako čítač pro uchování přehledu o vnořených konstruktorech, jako jsou kulaté nebo hranaté otevírací a uzavírací závorky. Definice vyrovnávací skupiny používá jako zásobník skupinu name2. Počáteční znak každého vnořeného konstruktoru se umístí do této skupiny a do její kolekce Group.Captures. Po nalezení uzavíracího znaku se odpovídající otevírací znak odebere ze skupiny a kolekce Captures se zmenší o jednu položku. Po nalezení otevíracích a uzavíracích znaků všech vnořených konstruktorů bude skupina name1 prázdná.
de: Eine Ausgleichsgruppendefinition löscht die Definition einer zuvor definierten Gruppe und speichert in der aktuellen Gruppe das Intervall zwischen der zuvor definierten Gruppe und der aktuellen Gruppe. „name1“ ist die aktuelle Gruppe (optional), „name2“ ist eine zuvor definierte Gruppe, und „Teilausdruck“ ist ein beliebiges gültiges Muster für reguläre Ausdrücke. Die Ausgleichsgruppendefinition löscht die Definition von „name2“ und speichert das Intervall zwischen „name2“ und „name1“ in „name1“. Wenn keine Gruppe namens „name2“ definiert ist, wird für die Übereinstimmung eine Rückverfolgung durchgeführt. Weil durch das Löschen der letzten Definition von „name2“ die vorherige Definition von „name2“ angezeigt wird, können Sie mithilfe dieses Konstrukts den Stapel von Erfassungen für die Gruppe „name2“ als Zähler für die Nachverfolgung geschachtelter Konstrukte wie z. B. öffnende und schließende Klammern verwenden. Die Ausgleichsgruppendefinition verwendet „name2“ als Stapel. Das Anfangszeichen der einzelnen geschachtelten Konstrukte wird in der Gruppe und in der zugehörigen Sammlung „Group.Captures“ platziert. Wenn das schließende Zeichen gefunden wurde, wird das entsprechende öffnende Zeichen aus der Gruppe entfernt, und die „Captures“-Sammlung wird um eins verringert. Nachdem die öffnenden und schließenden Zeichen aller geschachtelten Konstrukte abgeglichen wurden, ist „name1“ leer.
es: Una definición de grupo de equilibrio elimina la definición de un grupo definido anteriormente y almacena, en el grupo actual, el intervalo entre el grupo definido anteriormente y el grupo actual. "name1" es el grupo actual (opcional), "name2" es un grupo definido anteriormente y "subexpression" es cualquier patrón de expresión regular válido. La definición del grupo de equilibrio elimina la definición de name2 y almacena el intervalo entre name2 y name1 en name1. Si no se define un grupo de name2, la coincidencia se busca con retroceso. Como la eliminación de la última definición de name2 revela la definición anterior de name2, esta construcción permite usar la pila de capturas para el grupo name2 como contador para realizar el seguimiento de las construcciones anidadas, como los paréntesis o los corchetes de apertura y cierre. La definición del grupo de equilibrio usa "name2" como una pila. El carácter inicial de cada construcción anidada se coloca en el grupo y en su colección Group.Captures. Cuando coincide el carácter de cierre, se quita el carácter de apertura correspondiente del grupo y se quita uno de la colección Captures. Una vez que se han encontrado coincidencias de los caracteres de apertura y cierre de todas las construcciones anidadas, "name1" se queda vacío.
it: La definizione di gruppo di bilanciamento elimina la definizione di un gruppo definito in precedenza e archivia, nel gruppo corrente, l'intervallo tra il gruppo definito in precedenza e il gruppo corrente. 'name1' è il gruppo corrente (facoltativo), 'name2' è un gruppo definito in precedenza e 'subexpression' è qualsiasi criterio di espressione regolare valido. La definizione del gruppo di bilanciamento elimina la definizione di name2 e archivia l'intervallo tra name2 e name1 in name1. Se non viene definito alcun gruppo name2, viene eseguito il backtracking della corrispondenza. Dal momento che l'eliminazione dell'ultima definizione di name2 rivela la definizione precedente di name2, questo costrutto consente di usare lo stack di acquisizioni per il gruppo name2 come contatore per tenere traccia dei costrutti annidati, come ad esempio le parentesi o le parentesi quadre di apertura e chiusura. La definizione del gruppo di bilanciamento utilizza 'name2' come stack. Il carattere iniziale di ogni costrutto annidato viene inserito nel gruppo e nella relativa raccolta Group.Captures. Quando viene trovata una corrispondenza con il carattere di chiusura, il carattere di apertura corrispondente viene rimosso dal gruppo e la raccolta Captures viene ridotta di uno. Dopo che la corrispondenza dei caratteri di apertura e chiusura di tutti i costrutti annidati è stata trovata, 'name1' risulta vuoto.
ja: グループ定義の均等化では、既に定義されていたグループの定義を削除し、現在のグループにおいて、既に定義されていたグループと現在のグループの間の差分を保存します。 "name1" は現在のグループ (オプション) で、"name2" は既に定義されていたグループで、"subexpression" は有効な正規表現パターンです。グループ定義の均等化では、name2 の定義を削除し、name2 と name1 の間の差分を name1 に格納します。name2 グループが定義されていない場合、一致は差し戻します。name2 の最新の定義を削除すると、name2 の以前の定義が明らかになるため、このコンストラクトによって、かっこや左右の角かっこなど入れ子になったコンストラクトを追跡するカウンターとして name2 グループのキャプチャのスタックを使用できます。 グループ定義の均等化では、"name2" をスタックとして使用します。入れ子になった各コンストラクトの開始文字が、グループとその Group.Captures コレクションに配置されます。終了文字が一致すると、対応する開始文字がグループから削除され、Captures コレクションが 1 つ減らされます。入れ子になったすべてのコンストラクトの開始文字と終了文字が一致したら、"name1" は空になります。
ko: 균형 조정 그룹 정의는 이전에 정의된 그룹의 정의를 삭제하고, 이전에 정의된 그룹과 현재 그룹 사이의 간격을 현재 그룹에 저장합니다. 'name1'은 현재 그룹이고(선택 사항), 'name2'는 이전에 정의된 그룹이며, 'subexpression'은 유효한 정규식 패턴입니다. 균형 조정 그룹 정의는 name2의 정의를 삭제하고 name2와 name1 사이의 간격을 name1에 저장합니다. name2 그룹이 정의되어 있지 않으면 일치에서 역추적합니다. name2의 마지막 정의를 삭제하면 name2의 이전 정의가 표시되므로 이 구문을 통해 name2 그룹에 대한 캡처 스택을 괄호 또는 여는 대괄호 및 닫는 대괄호와 같은 중첩 구문을 추적하기 위한 카운터로 사용할 수 있습니다. 균형 조정 그룹 정의에서는 'name2'를 스택으로 사용합니다. 각 중첩 구문의 시작 문자는 그룹 및 해당 Group.Captures 컬렉션에 배치됩니다. 닫는 문자가 일치되면 해당하는 여는 문자가 그룹에서 제거되고 Captures 컬렉션이 하나 감소합니다. 모든 중첩 구문의 여는 문자와 닫는 문자가 일치되고 나면 'name1'은 비어 있는 상태가 됩니다.
pl: Definicja grupy dopasowywania usuwa definicję uprzednio sprecyzowanej grupy i zapisuje w aktualnej grupie interwał między poprzednio zdefiniowaną grupą a aktualną grupą. Element „name1” to aktualna grupa (opcjonalna), element „name2” to wcześniej zdefiniowana grupa, a element „subexpression” to dowolny prawidłowy wzorzec wyrażenia regularnego. Definicja grupy dopasowywania usuwa definicję elementu name2 i zapisuje interwał między elementami name2 i name1 w elemencie name1. Jeśli nie zdefiniowano grupy name2, następują śledzenia wsteczne dopasowania. Ponieważ usunięcie ostatniej definicji elementu name2 ujawnia jego poprzednią definicję, ta konstrukcja umożliwia użycie stosu przechwyceń dla grupy name2 jako licznika służącego do śledzenia zagnieżdżonych konstrukcji, takich jak nawiasy lub otwierające i zamykające nawiasy klamrowe. Definicja grupy dopasowywania używa elementu „name2” jako stosu. Początkowy znak każdej zagnieżdżonej konstrukcji jest umieszczany w grupie i w jej kolekcji Group.Captures. Po dopasowaniu znaku zamykającego odpowiadający mu znak otwierający jest usuwany z grupy, a kolekcja Captures jest zmniejszana o jeden. Po dopasowaniu otwierających i zamykających znaków wszystkich zagnieżdżonych konstrukcji element „name1” będzie pusty.
pt_br: Uma definição de grupo de balanceamento exclui a definição de um grupo definido anteriormente e armazena, no grupo atual, o intervalo entre o grupo definido anteriormente e o grupo atual. 'name1' é o grupo atual (opcional), 'name2' é um grupo definido anteriormente e 'subexpression' é qualquer padrão de expressão regular válido. A definição de grupo de balanceamento exclui a definição de name2 e armazena o intervalo entre name2 e name1 no name1. Se não for definido nenhum name2, a correspondência retrocederá. Como a exclusão da última definição de name2 revela a definição anterior de name2, essa construção permite usar a pilha de capturas para o grupo name2 como um contador para manter o controle de construções aninhadas, como parênteses ou colchetes de abertura e fechamento. A definição de grupo de balanceamento usa 'name2' como uma pilha. O caractere inicial de cada construção aninhada é colocada no grupo e em sua coleção Group.Captures. Quando o caractere de fechamento é correspondido, seu caractere de abertura correspondente é removido do grupo e a coleção Captures é reduzida em um. Após a correspondência dos caracteres de abertura e fechamento de todas as construções aninhadas, 'name1' estará vazio.
ru: Сбалансированное определение группы удаляет определение ранее определенной группы и сохраняет (в текущей группе) интервал между ранее определенной группой и текущей группой. Значение "имя1" является текущей группой (необязательная), "имя2" является ранее определенной группой, а "часть выражения" является любым допустимым шаблоном регулярного выражения. Сбалансированное определение группы удаляет определение "имя2" и сохраняет интервал между "имя2" и "имя1" в "имя1". Если группа "имя2" не определена, соответствие определяется по обратному отслеживанию. Так как удаление последнего определения "имя2" приводит к раскрытию предыдущего определения "имя2", эта конструкция позволяет использовать стек записей для группы "имя2" в качестве счетчика для отслеживания вложенных конструкций, таких как круглые скобки или открывающие и закрывающие скобки. Сбалансированное определение группы использует "имя2" в качестве стека. Начальный символ каждой вложенной конструкции помещается в группу и ее коллекцию Group.Captures. При появлении совпадения для закрывающего символа соответствующий ему открывающий символ удаляется из группы, а коллекция Captures уменьшается на единицу. После обнаружения совпадений для всех открывающих и закрывающих символов всех вложенных конструкций группа "имя1" остается пустой.
tr: Bir dengeleme grubu tanımı, geçerli grupta, önceden tanımlanmış grup ile geçerli grup arasındaki aralıkta, önceden tanımlanmış bir grubun ve depoların tanımını siler. 'name1' geçerli grup (isteğe bağlı), 'name2' önceden tanımlanmış bir grup ve 'subexpression' ise herhangi bir geçerli normal ifade desenidir. Dengeleme grubu tanımı name2'nin tanımını siler ve name2 ile name1 arasındaki aralığı name1'e depolar. Bir name2 grubu tanımlanmamışsa, eşleşme geri iz sürer. name2'nin son tanımını silmek, name2'nin önceki tanımını ortaya çıkardığından, bu yapı name2 grubu için yakalama yığınını, parantez veya açma ve kapama ayracı gibi iç içe yapıları izlemek için bir sayaç olarak kullanmanıza olanak sağlar. Dengeleme grubu tanımı 'name2' öğesini bir yığın olarak kullanır. Her iç içe yapının başlangıç karakteri, gruba ve grubun Group.Captures koleksiyonuna yerleştirilir. Kapanış karakteri eşleştiğinde, karşılık gelen açma karakteri gruptan kaldırılır ve Captures koleksiyonunda bir öğe azalır. İç içe tüm yapıların açılış ve kapanış karakterleri eşleştirildikten sonra, 'name1' boş olur.
zh_hans: 均衡组定义删除以前定义的组的定义，并在当前组中存储以前定义的组和当前组之间的时间间隔。 “name1” 是当前组(可选)，“name2” 是以前定义的组，而 “subexpression” 是任何有效的正则表达式模式。均衡组定义将删除 name2 的定义，并在 name1 中存储 name2 和 name1 之间的间隔。如果未定义 name2 组，则匹配回溯。由于删除 name2 的最后一个定义会发现 name2 的上一个定义，此构造使你能够将组 name2 的捕获堆栈用作计数器来跟踪嵌套构造(如括号或左括号和右括号)。 均衡组定义使用 “name2” 作为堆栈。每个嵌套构造的开始字符都放在该组中并位于其组中。捕获集合。匹配结束字符时，将从组中删除其相应的开始字符，并且捕获集合将减少 1。在所有嵌套构造的开始和结束字符都匹配后，“name1” 为空。

# Regex_balancing_group_short
source: balancing group
cs: vyrovnávací skupina
de: Ausgleichsgruppe
es: grupo de equilibrio
fr: groupe d'équilibrage
it: gruppo di bilanciamento
ja: グループの均等化
ko: 균형 조정 그룹
pl: grupa zrównoważona
pt_br: grupo de balanceamento
ru: группа балансировки
tr: dengeleme grubu
zh_hans: 均衡组
zh_hant: 平衡群組

# Regex_base_group
source: base-group
cs: základní skupina
de: Basisgruppe
es: grupo base
fr: groupe de base
it: gruppo di base
ja: ベース グループ
ko: 기본 그룹
pl: grupa podstawowa
pt_br: grupo base
ru: базовая группа
tr: temel grup
zh_hans: 基本组
zh_hant: 基底群組

# Regex_bell_character_long
source: Matches a bell (alarm) character, \u0007
cs: Shoda se znakem zvonku \u0007
de: Entspricht einem Glockenzeichen (Alarm), \u0007.
es: Coincide con un carácter de campana (alarma), \u0007
fr: Correspond au caractère de cloche (alarme), \u0007
it: Trova la corrispondenza di un carattere di controllo del segnale acustico di avviso \u0007
ja: ベル (アラーム) 文字 \u0007 に一致します
ko: 벨(경보) 문자 \u0007과 일치시킵니다.
pl: Pasuje do znaku dzwonka (alarmu) — \u0007
pt_br: Corresponde a um caractere de sino (alarme), \u0007
ru: Соответствует символу колокольчика (сигнала) \u0007
tr: Bir zil (alarm) karakteriyle (\u0007) eşleşir
zh_hans: 与响铃(警告)字符(\u0007)匹配
zh_hant: 比對鈴聲 (警示) 字元 \u0007

# Regex_bell_character_short
source: bell character
cs: znak zvonku
de: Glockenzeichen
es: carácter de campana
fr: caractère de cloche
it: carattere di controllo del segnale acustico di avviso
ja: ベル文字
ko: 벨 문자
pl: znak dzwonka
pt_br: caractere de sino
ru: символ колокольчика
tr: zil karakteri
zh_hans: 响铃字符
zh_hant: 鈴字元

# Regex_carriage_return_character_long
source: Matches a carriage-return character, \u000D. Note that \r is not equivalent to the newline character, \n.
cs: Shoda se znakem návratu na začátek řádku \u000D. Upozorňujeme, že \r není ekvivalentem znaku nového řádku \n.
de: Entspricht einem Wagenrücklaufzeichen, \u000D. Beachten Sie, dass "\r" nicht dem Zeilenvorschubzeichen "\n" entspricht.
es: Coincide con un carácter de retorno de carro, \u000D. Tenga en cuenta que \r no equivale al carácter de nueva línea, \n.
fr: Correspond au caractère de retour chariot, \u000D. Notez que \r n'est pas équivalent au caractère nouvelle ligne, \n.
it: Trova la corrispondenza di un carattere di ritorno a capo \u000D. Si noti che \r non equivale al carattere di nuova riga \n.
ja: 復帰文字 \u000D に一致します。\r は改行文字 \n と同じではないことにご注意ください。
ko: 캐리지 리턴 문자 \u000D와 일치시킵니다. \r은 줄 바꿈 문자 \n과 같지 않습니다.
pl: Pasuje do znaku powrotu karetki — \u000D. Zauważ, że znak \r nie jest równoważny znakowi nowego wiersza — \n.
pt_br: Corresponde a um caractere de retorno de carro, \u000D. Observe que \r não é equivalente ao caractere de nova linha, \n.
ru: Соответствует символу возврата каретки \u000D. Обратите внимание, что \r не эквивалентен символу новой строки \n.
tr: Bir satır başı karakteriyle (\u000D) eşleşir. \r karakterinin yeni satır karakteriyle (\n) eşdeğer olmadığını unutmayın.
zh_hans: 与回车符(\u000D)匹配。请注意，\r 与换行符(\n)不等效。
zh_hant: 比對歸位字元 \u000D。請注意，\r 不等同於新行字元 \n。

# Regex_carriage_return_character_short
source: carriage-return character
cs: znak návratu na začátek řádku
de: Wagenrücklaufzeichen
es: carácter de retorno de carro
fr: caractère de retour chariot
it: carattere di ritorno a capo
ja: 復帰文字
ko: 캐리지 리턴 문자
pl: znak powrotu karetki
pt_br: caractere de retorno de carro
ru: символ возврата каретки
tr: satır başı karakteri
zh_hans: 回车符
zh_hant: 歸位字元

# Regex_character_class_subtraction_long
source: Character class subtraction yields a set of characters that is the result of excluding the characters in one character class from another character class. 'base_group' is a positive or negative character group or range. The 'excluded_group' component is another positive or negative character group, or another character class subtraction expression (that is, you can nest character class subtraction expressions).
cs: Odčítání třídy znaků poskytuje sadu znaků, která je výsledkem vyloučení znaků v jedné třídě znaků z jiné třídy znaků. Base_group je pozitivní nebo negativní skupina znaků nebo rozsah. Komponenta excluded_group je jiná pozitivní nebo negativní skupina znaků nebo jiný výraz odčítání třídy znaků (to znamená, že výrazy odčítání třídy znaků lze vnořovat).
de: Die Zeichenklassensubtraktion ergibt einen Satz von Zeichen, der auf dem Ausschließen der Zeichen einer Zeichenklasse von einer anderen Zeichenklasse beruht. "base_group" ist eine positive oder negative Zeichengruppe bzw. ein positiver oder negativer Bereich. Die Komponente "excluded_group" ist eine andere positive oder negative Zeichengruppe oder ein anderer Ausdruck zur Zeichenklassensubtraktion (das heißt, Ausdrücke zur Zeichenklassensubtraktion können geschachtelt werden).
es: La sustracción de la clase de caracteres produce un conjunto de caracteres que es el resultado de excluir los caracteres en una clase de caracteres de otra clase de caracteres. "base_group" es un grupo o intervalo de caracteres positivos o negativos. El componente "excluded_group" es otro grupo de caracteres positivos o negativos, u otra expresión de sustracción de clases de caracteres (es decir, puede anidar expresiones de sustracción de clases de caracteres).
fr: La soustraction d'une classe de caractères génère un jeu de caractères qui résulte de l'exclusion des caractères d'une classe de caractères à partir d'une autre classe de caractères. 'groupe_base' est une plage ou un groupe de caractères positif ou négatif. Le composant 'groupe_exclu' est un autre groupe de caractères positif ou négatif, ou une autre expression de soustraction de classe de caractères (en d'autres termes, vous pouvez imbriquer des expressions de soustraction de classe de caractères).
it: La sottrazione di classi di caratteri produce un set di caratteri che è il risultato dell'esclusione dei caratteri di una classe di caratteri da un'altra classe di caratteri. 'base_group' è un gruppo o un intervallo di caratteri positivi o negativi. Il componente 'excluded_group' è un altro gruppo di caratteri positivi o negativi o un'altra espressione di sottrazione di classi di caratteri, ovvero è possibile annidare espressioni di sottrazione di classi di caratteri.
ja: 文字クラスの減算では、ある文字クラスから別の文字クラスの文字を除外した文字セットが生成されます。 'base_group' は文字グループまたは範囲の肯定または否定です。'excluded_group' コンポーネントは、別の文字グループの肯定または否定、つまり別の文字クラス減算式です (つまり、文字クラス減算式を入れ子にすることができます)。
ko: 문자 클래스 빼기를 사용하면 한 문자 클래스의 문자를 다른 문자 클래스에서 제외한 결과인 문자 집합을 얻게 됩니다. 'base_group'은 긍정 또는 부정 문자 그룹이거나 문자 범위입니다. 'excluded_group' 구성 요소는 다른 긍정 또는 부정 문자 그룹이거나 다른 문자 클래스 빼기 식입니다(즉, 문자 클래스 빼기 식을 중첩할 수 있음).
pl: Odejmowanie klas znaków daje zestaw znaków, który jest wynikiem wykluczenia znaków w jednej klasie znaków z innej klasy znaków. Element „grupa_podstawowa” to pozytywna lub negatywna grupa lub zakres znaków. Składnik „wykluczona_grupa” to inna pozytywna lub negatywna grupa znaków lub inne wyrażenie odejmowania klas znaków (co oznacza, że można zagnieżdżać wyrażenia odejmowania klas znaków).
pt_br: A subtração de classe de caracteres produz um conjunto de caracteres que é o resultado da exclusão de caracteres em uma classe de caracteres de outra classe de caracteres. 'base_group' é um grupo ou intervalo de caracteres positivos ou negativos. O componente 'excluded_group' é outro grupo de caracteres positivos ou negativos ou outra expressão de subtração de classe de caracteres (ou seja, você pode aninhar expressões de subtração de classes de caracteres).
ru: Вычитание класса символов дает набор символов, который является результатом исключения символов одного класса символов из другого класса символов. base_group является положительной или отрицательной группой символов или диапазоном. Компонент excluded_group — это другая положительная или отрицательная группа символов или другое выражение вычитания класса символов (то есть вы можете вкладывать выражения вычитания класса символов).
tr: Karakter sınıfı çıkarma işlemi, bir karakter sınıfındaki karakterlerin başka bir karakter sınıfından dışlanması sonucu oluşan bir karakter kümesi oluşturur. 'base_group' pozitif veya negatif bir karakter grubu veya aralığıdır. 'excluded_group' bileşeni başka bir pozitif veya negatif karakter grubu veya başka bir karakter sınıfı çıkarma ifadesidir (başka bir deyişle karakter sınıfı çıkarma ifadelerini iç içe yerleştirebilirsiniz).
zh_hans: 字符类减法生成一组字符，这是从另一个字符类中排除一个字符类中的字符后得到的。 "base_group" 为正或为负的字符组或范围。"excluded_group" 组件是另一个为正或为负的字符组，或其他字符类减法表达式(即，可以嵌套字符类减法表达式)。
zh_hant: 字元類別減法會產生一組字元，該組字元為將一個字元類別中的字元從另一個字元類別排除的結果。 'base_group' 是正或負的字元群組或範圍。'excluded_group' 元件是另一個正的或負的字元群組，或另一個字元類別減法運算式 (也就是說，您可以將字元類別減法運算式巢狀化)。

# Regex_character_class_subtraction_short
source: character class subtraction
cs: odčítání třídy znaků
de: Zeichenklassensubtraktion
es: sustracción de clase de caracteres
fr: soustraction de classe de caractères
it: sottrazione di classi di caratteri
ja: 文字クラスの減算
ko: 문자 클래스 빼기
pl: odejmowanie klas znaków
pt_br: subtração de classe de caracteres
ru: вычитание класса символов
tr: karakter sınıfı çıkarma
zh_hans: 字符类减法
zh_hant: 字元類別減法

# Regex_character_group
source: character-group
cs: skupina znaků
de: Zeichengruppe
es: grupo de caracteres
fr: groupe de caractères
it: gruppo di caratteri
ja: 文字グループ
ko: 문자 그룹
pl: grupa znaków
pt_br: grupo de caracteres
ru: группа символов
tr: karakter grubu
zh_hans: 字符组
zh_hant: 字元群組

# Regex_comment
source: comment
cs: komentář
de: Kommentar
es: comentario
fr: commentaire
it: commento
ja: コメント
ko: 주석
pl: komentarz
pt_br: comentário
ru: комментарий
tr: açıklama
zh_hans: 注释
zh_hant: 註解
