Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Introduce local for '{0}'
cs: Zavést lokální proměnnou pro {0}
de: Lokales Element für "{0}" bereitstellen
es: Introducir la variable local de '{0}'
fr: Introduire un élément local pour '{0}'
it: Introduce l'elemento locale per '{0}'
ja: '{0}' に対してローカルを導入します
ko: '{0}'에 대한 로컬 지정
pl: Wprowadź element lokalny dla elementu „{0}”
pt_br: Introduzir local para "{0}"
ru: Введите локальное значение для "{0}"
tr: '{0}' için yereli ortaya çıkar
zh_hans: 为“{0}”引入本地
zh_hant: 為 '{0}' 引進區域

source: Introduce constant for '{0}'
cs: Zavést konstantu pro {0}
de: Konstante für "{0}" bereitstellen
es: Introducir la constante de '{0}'
fr: Introduire une constante pour '{0}'
it: Introduce la costante per '{0}'
ja: '{0}' に対して定数を導入します
ko: '{0}'에 대한 상수 지정
pl: Wprowadź stałą dla elementu „{0}”
pt_br: Introduzir constante para "{0}"
ru: Введите константу для "{0}"
tr: '{0}' için sabiti ortaya çıkar
zh_hans: 为“{0}”引入常量
zh_hant: 為 '{0}' 引進常數

source: Introduce local constant for '{0}'
cs: Zavést místní konstantu pro {0}
de: Lokale Konstante für "{0}" bereitstellen
es: Introducir la constante local de '{0}'
fr: Introduire une constante locale pour '{0}'
it: Introduce la costante locale per '{0}'
ja: '{0}' に対してローカル定数を導入します
ko: '{0}'에 대한 지역 상수 지정
pl: Wprowadź stałą lokalną dla elementu „{0}”
pt_br: Introduzir constante local para "{0}"
ru: Введите локальную константу для "{0}"
tr: '{0}' için yerel sabiti ortaya çıkar
zh_hans: 为“{0}”引入局部常量
zh_hant: 為 '{0}' 引進區域常數

source: Introduce field for all occurrences of '{0}'
cs: Zavést pole pro všechny výskyty položky {0}
de: Feld für alle Vorkommen von "{0}" bereitstellen
es: Introducir el campo para todas las repeticiones de '{0}'
fr: Introduire un champ pour toutes les occurrences de '{0}'
it: Introduce il campo per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対してフィールドを導入します
ko: '{0}'의 모든 항목에 대한 필드 지정
pl: Wprowadź pole dla wszystkich wystąpień elementu „{0}”
pt_br: Introduzir campo para todas as ocorrências de "{0}"
ru: Введите поле для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için alanı ortaya çıkar
zh_hans: 为出现的所有“{0}”引入字段
zh_hant: 為所有出現 '{0}' 之處引進欄位

source: Introduce local for all occurrences of '{0}'
cs: Zavést lokální proměnnou pro všechny výskyty položky {0}
de: Lokales Element für alle Vorkommen von "{0}" bereitstellen
es: Introducir la variable local para todas las repeticiones de '{0}'
fr: Introduire un élément local pour toutes les occurrences de '{0}'
it: Introduce l'elemento locale per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対してローカルを導入します
ko: '{0}'의 모든 항목에 대한 로컬 지정
pl: Wprowadź element lokalny dla wszystkich wystąpień elementu „{0}”
pt_br: Introduzir local para todas as ocorrências de "{0}"
ru: Введите локальное значение для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için yereli ortaya çıkar
zh_hans: 为出现的所有“{0}”引入本地
zh_hant: 為所有出現 '{0}' 之處引進區域

source: Introduce constant for all occurrences of '{0}'
cs: Zavést konstantu pro všechny výskyty položky {0}
de: Konstante für alle Vorkommen von "{0}" bereitstellen
es: Introducir la constante para todas las repeticiones de '{0}'
fr: Introduire une constante pour toutes les occurrences de '{0}'
it: Introduce la costante per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対して定数を導入します
ko: '{0}'의 모든 항목에 대한 상수 지정
pl: Wprowadź stałą dla wszystkich wystąpień elementu „{0}”
pt_br: Introduzir constante para todas as ocorrências de "{0}"
ru: Введите константу для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için sabiti ortaya çıkar
zh_hans: 为出现的所有“{0}”引入常量
zh_hant: 為所有出現 '{0}' 之處引進常數

source: Introduce local constant for all occurrences of '{0}'
cs: Zavést místní konstantu pro všechny výskyty položky {0}
de: Lokale Konstante für alle Vorkommen von "{0}" bereitstellen
es: Introducir la constante local para todas las repeticiones de '{0}'
fr: Introduire une constante locale pour toutes les occurrences de '{0}'
it: Introduce la costante locale per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対してローカル定数を導入します
ko: '{0}'의 모든 항목에 대한 지역 상수 지정
pl: Wprowadź stałą lokalną dla wszystkich wystąpień elementu „{0}”
pt_br: Introduzir constante de local para todas as ocorrências de "{0}"
ru: Введите локальную константу для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için yerel sabiti ortaya çıkar
zh_hans: 为出现的所有“{0}”引入局部常量
zh_hant: 為所有出現 '{0}' 之處引進區域常數

source: Introduce query variable for all occurrences of '{0}'
cs: Zavést proměnnou dotazu pro všechny výskyty položky {0}
de: Abfragevariable für alle Vorkommen von "{0}" bereitstellen
es: Introducir la variable de consulta para todas las repeticiones de '{0}'
fr: Introduire une variable de requête pour toutes les occurrences de '{0}'
it: Introduce la variabile di query per tutte le occorrenze di '{0}'
ja: '{0}' のすべての発生に対してクエリ変数を導入します
ko: '{0}'의 모든 항목에 대한 쿼리 변수 지정
pl: Wprowadź zmienną zapytania dla wszystkich wystąpień elementu „{0}”
pt_br: Introduzir variável de consulta para todas as ocorrências de "{0}"
ru: Введите переменную запроса для всех вхождений "{0}"
tr: Tüm '{0}' oluşumları için sorgu değişkenini ortaya çıkar
zh_hans: 为出现的所有“{0}”引入查询变量
zh_hant: 為所有出現 '{0}' 之處引進查詢變數

source: Introduce query variable for '{0}'
cs: Zavést proměnnou dotazu pro {0}
de: Abfragevariable für "{0}" bereitstellen
es: Introducir la variable de consulta de '{0}'
fr: Introduire une variable de requête pour '{0}'
it: Introduce la variabile di query per '{0}'
ja: '{0}' に対してクエリ変数を導入します
ko: '{0}'에 대한 쿼리 변수 지정
pl: Wprowadź zmienną zapytania dla elementu „{0}”
pt_br: Introduzir variável de consulta para "{0}"
ru: Введите переменную запроса для "{0}"
tr: '{0}' için sorgu değişkenini ortaya çıkar
zh_hans: 为“{0}”引入查询变量
zh_hant: 為 '{0}' 引進查詢變數

source: is
cs: je
de: ist
es: es
fr: est
it: è
ja: は
ko: 은(는)
pl: jest
pt_br: é
ru: является
tr: olan
zh_hans: 是
zh_hant: 是

source: Represents an object whose operations will be resolved at runtime.
cs: Představuje objekty, jejichž operace se vyhodnotí za běhu.
de: Stellt ein Objekt dar, dessen Vorgänge zur Laufzeit aufgelöst werden.
es: Representa un objeto cuyas operaciones se resolverán en tiempo de ejecución.
fr: Représente un objet dont les opérations seront résolues au moment de l'exécution.
it: Rappresenta un oggetto le cui operazioni verranno risolte in fase di esecuzione.
ja: 操作が実行時に解決されるオブジェクトを表します。
ko: 런타임에 확인될 작업이 포함된 개체를 나타냅니다.
pl: Reprezentuje obiekt, którego operacje będą rozpoznane w czasie wykonania.
pt_br: Representa um objeto cujas operações serão resolvidas no tempo de execução.
ru: Представляет объект, операции которого будут разрешаться во время выполнения.
tr: İşlemleri çalışma zamanında çözümlenecek bir nesneyi temsil ediyor.
zh_hans: 表示将在运行时解析其操作的对象
zh_hant: 表示其作業將於執行階段解決的物件。

source: constant
cs: konstanta
de: Konstante
es: constante
fr: constante
it: costante
ja: 定数
ko: 상수
pl: stała
pt_br: constante
ru: константа
tr: sabit
zh_hans: 常量
zh_hant: 常數

source: field
cs: pole
de: Feld
es: Campo
fr: Champ
it: campo
ja: フィールド
ko: 필드
pl: pole
pt_br: Campo
ru: Поле
tr: alan
zh_hans: 字段
zh_hant: 欄位

source: local constant
cs: lokální konstanta
de: lokale Konstante
es: constante local
fr: constante locale
it: costante locale
ja: ローカル定数
ko: 지역 상수
pl: stała lokalna
pt_br: constante local
ru: локальная константа
tr: yerel sabit
zh_hans: 局部常量
zh_hant: 本機常數

source: local variable
cs: lokální proměnná
de: Lokale Variable
es: variable local
fr: variable locale
it: variabile locale
ja: ローカル変数
ko: 지역 변수
pl: zmienna lokalna
pt_br: variável local
ru: локальная переменная
tr: yerel değişken
zh_hans: 局部变量
zh_hant: 區域變數

source: label
cs: popisek
de: Bezeichnung
es: Etiqueta
fr: Étiquette
it: Etichetta
ja: ラベル
ko: 레이블
pl: etykieta
pt_br: Rótulo
ru: Этикетка
tr: etiket
zh_hans: 标签
zh_hant: 標籤

source: period/era
cs: období
de: Zeitraum/Epoche
es: período o era
fr: période/ère
it: Periodo/era
ja: 時代
ko: 기간/시대
pl: okres/era
pt_br: período/era
ru: период/эра
tr: dönem/devir
zh_hans: 期间/周期
zh_hant: 時期/年份

# period_era_description
source: The "g" or "gg" custom format specifiers (plus any number of additional "g" specifiers) represents the period or era, such as A.D. The formatting operation ignores this specifier if the date to be formatted doesn't have an associated period or era string. If the "g" format specifier is used without other custom format specifiers, it's interpreted as the "g" standard date and time format specifier.
cs: Specifikátory vlastního formátu g nebo gg (a libovolný počet dalších specifikátorů g) představují období, třeba př. n. l. Pokud datum, které se má formátovat, nemá přidružený řetězec období, operace formátování tento specifikátor ignoruje. Pokud se specifikátor formátu g použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času g.
de: Der benutzerdefinierte Formatbezeichner "g" oder "gg" (plus eine beliebige Anzahl zusätzlicher g-Bezeichner) repräsentiert ein Zeitalter oder eine Epoche, wie z. B. A. D. (Anno Domini). Dieser Bezeichner wird bei der Formatierung ignoriert, wenn dem zu formatierenden Datum keine Zeitalter- oder Epochenzeichenfolge zugeordnet ist. Bei Verwendung des Formatbezeichners "g" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "g" für Datum und Uhrzeit interpretiert.
es: Los especificadores de formato personalizado "g" o "gg" (más cualquier número de especificadores "g" adicionales) representan el período o la era, como D.C. La operación de formato omite este especificador si la fecha a la que se va a dar formato no tiene una cadena de período o era asociada. Si el especificador de formato "g" se usa sin otros especificadores de formato personalizado, se interpreta como el especificador de formato de fecha y hora estándar "g".
fr: Les spécificateurs de format personnalisés "g" ou "gg" (plus n'importe quel nombre de spécificateurs "g" supplémentaires) représentent la période ou l'ère, par exemple après J.-C. L'opération qui consiste à appliquer un format ignore ce spécificateur si la date visée n'a pas de chaîne de période ou d'ère associée. Si le spécificateur de format "g" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "g".
it: Gli identificatori di formato personalizzati "g" o "gg" (più qualsiasi numero di identificatori "g" aggiuntivi) rappresentano il periodo o l'era, ad esempio D.C. Questo identificatore viene ignorato dall'operazione di formattazione se la data da formattare non è associata a una stringa di periodo o di era. Se l'identificatore di formato "g" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "g".
ja: "g" または "gg" カスタム書式指定子 (任意の数の "g" 指定子を追加可能) は、A.D. などの時代 (年号) を表します。書式設定の対象となる日付に時代 (年号) を表す文字列が関連付けられていない場合、書式設定操作の際、この指定子は無視されます。 他のカスタム書式指定子が使用されていない場合、"g" は標準の日時書式指定子として解釈されます。
ko: "g" 또는 "gg" 사용자 지정 형식 지정자(및 임의 개수의 추가 "g" 지정자)는 기간 또는 시대(예: A.D.)를 나타냅니다. 형식 지정 연산은 형식을 지정할 날짜에 연결된 기간 또는 시대 문자열이 없으면 이 지정자를 무시합니다. 다른 사용자 지정 형식 지정자 없이 "g" 형식 지정자를 사용하면 "g" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Niestandardowe specyfikatory formatu „g” lub „gg” (oraz dowolna liczba dodatkowych specyfikatorów „g”) reprezentują okres lub erę taką jak A.D. Operacja formatowania ignoruje ten specyfikator, jeśli formatowana data nie ma skojarzonego ciągu okresu lub ery. Jeśli specyfikator formatu „g” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny „g”.
pt_br: Os especificadores de formato personalizado "g" ou "gg" (mais qualquer número de especificadores "g" adicionais) representam o período ou a era, como D.C. A operação de formatação ignorará o especificador se a data a ser formatada não tiver um período associado ou uma cadeia de caracteres de era. Se o especificador de formato "g" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "g".
ru: Описатели пользовательского формата "g" или "gg" (плюс любое число дополнительных описателей "g") представляют период или эру, например "время нашей эры". Операция форматирования игнорирует этот описатель, если форматируемая дата не имеет соответствующей строки периода или эры. Если описатель формата "g" используется без других описателей пользовательского формата, он интерпретируется как описатель "g" стандартного формата даты и времени.
tr: "g" veya "gg" özel biçim belirticileri (ve herhangi bir sayıda ek "g" belirticisi), A.D. gibi bir dönemi veya devri temsil eder. Biçimlendirilecek tarihin ilişkili bir dönem veya devir dizesi yoksa, biçimlendirme işlemi bu belirticiyi yoksayar. "g" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, "g" standart tarih ve saat biçimi belirticisi olarak yorumlanır.
zh_hans: "g" 或 "gg" 自定义格式说明符(另加任意数量的其他 "g" 说明符)表示期间或纪元，如果要设置格式的日期不具有关联的时期或纪元字符串，则格式操作将忽略该说明符。 如果使用 "g" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "g" 标准日期和时间格式说明符。
zh_hant: "g" 或 "gg" 自訂格式規範 (外加任意數目的額外 "g" 規範) 代表時期或年代 (例如西元)。若要格式化的日期沒有已建立關聯的時期或年代字串，則格式化作業就會忽略此規範。 如果使用 "g" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為 "g" 標準日期和時間格式規範。

source: property accessor
cs: Přistupující objekt vlastnosti
de: Eigenschaftenaccessor
es: descriptor de acceso de propiedades
it: funzione di accesso proprietà
ja: プロパティ アクセサー
ko: 속성 접근자
pl: metoda dostępu do właściwości
pt_br: acessador de propriedade
ru: метод доступа к свойству
tr: özellik erişeni
zh_hans: 属性访问器

source: range variable
cs: proměnná rozsahu
de: Bereichsvariable
es: variable de rango
fr: variable de plage
it: variabile di intervallo
ja: 範囲変数
ko: 범위 변수
pl: zmienna zakresu
pt_br: variável de intervalo
ru: переменная диапазона
tr: aralık değişkeni
zh_hans: 范围变量
zh_hant: 範圍變數

source: parameter
cs: parametr
es: parámetro
fr: paramètre
it: parametro
ja: パラメーター
ko: 매개 변수
pl: parametr
pt_br: parâmetro
ru: параметр
tr: parametre
zh_hans: 参数
zh_hant: 參數

source: in
cs: v
de: Ein
es: en
ja: 次の値のいずれか
pl: w
pt_br: Em
ru: Входной
zh_hans: 隶属
zh_hant: 在...中

# Summary_colon
source: Summary:
cs: Souhrn:
de: Zusammenfassung:
es: Resumen:
fr: Résumé :
it: Riepilogo:
ja: 概要:
ko: 요약:
pl: Podsumowanie:
pt_br: Resumo:
ru: Сводка:
tr: Özet:
zh_hans: 摘要:
zh_hant: 摘要:

source: Locals and parameters
cs: Místní hodnoty a parametry
de: Lokale Variablen und Parameter
es: Variables locales y parámetros
fr: Variables locales et paramètres
it: Variabili locali e parametri
ja: ローカルおよびパラメーター
ko: 로컬 항목 및 매개 변수
pl: Elementy lokalne i parametry
pt_br: Locais e parâmetros
ru: Локальные переменные и параметры
tr: Yerel öğeler ve parametreler
zh_hans: 局部变量和参数
zh_hant: 區域變數和參數

# Type_parameters_colon
source: Type parameters:
cs: Vložit parametry:
de: Typparameter:
es: Parámetros de tipo:
fr: Paramètres de type :
it: Parametri di tipo:
ja: 型パラメーター:
ko: 형식 매개 변수:
pl: Parametry typu:
pt_br: Parâmetros de Tipo:
ru: Параметры типа:
tr: Tür parametreleri:
zh_hans: 类型参数:
zh_hant: 類型參數:

# Returns_colon
source: Returns:
cs: Vrácení:
de: Rückgabewerte:
es: Devuelve:
fr: Retourne :
it: Valori restituiti:
ja: 戻り値:
ko: 반환 값:
pl: Zwraca:
pt_br: Devoluções:
ru: Возврат:
tr: Döndürülenler:
zh_hans: 返回结果:
zh_hant: 傳回:

# Exceptions_colon
source: Exceptions:
de: Ausnahmen:
it: Eccezioni:
ja: 例外:
tr: Özel Durumlar:
zh_hans: 异常:
zh_hant: 例外狀況:

# Remarks_colon
source: Remarks:
cs: Poznámky:
de: Hinweise:
es: Comentarios:
fr: Remarques :
it: Commenti:
ja: 注釈:
ko: 설명:
pl: Uwagi:
pt_br: Comentários:
ru: Примечания:
tr: Açıklamalar:
zh_hans: 言论：
zh_hant: 備註:

source: generating source for symbols of this type is not supported
cs: Generování zdroje pro symboly tohoto typu se nepodporuje.
de: Das Generieren der Symbolquelle dieses Typs wird nicht unterstützt
es: no está permitido generar código fuente para símbolos de este tipo
fr: La génération de code source pour les symboles de ce type n'est pas prise en charge
it: la generazione dell'origine per i simboli di questo tipo non è supportata
ja: このタイプのシンボルのソースの生成はサポートされていません
ko: 이 형식의 기호에 대한 소스는 생성할 수 없습니다.
pl: generowanie źródła dla symboli tego typu nie jest obsługiwane
pt_br: gerar fonte para símbolos deste tipo não é suportado
ru: создание источника для символов такого типа не поддерживается
tr: Bu türdeki semboller için kaynak üretme desteklenmiyor
zh_hans: 不支持为此类型符号生成源
zh_hant: 不支援產生此類型之符號的來源

source: Assembly
cs: sestavení
es: ensamblado
ja: アセンブリ
ko: 어셈블리
pl: zestaw
ru: сборка
tr: derleme
zh_hans: 程序集
zh_hant: 組件

source: location unknown
cs: neznámé umístění
de: Standort unbekannt
es: ubicación desconocida
fr: emplacement inconnu
it: percorso sconosciuto
ja: 不明な場所
ko: 위치를 알 수 없음
pl: lokalizacja nieznana
pt_br: local desconhecido
ru: расположение неизвестно
tr: Konum bilinmiyor
zh_hans: 未知的位置
zh_hant: 位置不明

# Unexpected_interface_member_kind_colon_0
source: Unexpected interface member kind: {0}
cs: Neočekávaný druh člena rozhraní: {0}
de: Unerwartete Schnittstellenelementart: {0}
es: Tipo de miembro de interfaz inesperado: {0}
fr: Genre de membre d'interface inattendu : {0}
it: Tipo di membro di interfaccia imprevisto: {0}
ja: 予期しないインターフェイス メンバーの種類: {0}
ko: 예기치 않은 인터페이스 멤버 종류: {0}
pl: Nieoczekiwany rodzaj składowej interfejsu: {0}
pt_br: Tipo de membro de interface inesperado: {0}
ru: Непредвиденный тип члена интерфейса: {0}
tr: Beklenmeyen arabirim üyesi türü: {0}
zh_hans: 意外的接口成员种类:{0}
zh_hant: 未預期的介面成員種類: {0}

source: The symbol does not have an icon.
cs: Symbol nemá ikonu.
de: Das Symbol hat kein Symbolbild.
es: El símbolo no tiene un icono.
fr: Le symbole ne possède pas d'icône.
it: Per il simbolo non esiste un'icona.
ja: シンボルにアイコンがありません。
ko: 기호에 아이콘이 없습니다.
pl: Symbol nie ma ikony.
pt_br: O símbolo não tem um ícone.
ru: Символ не имеет значка.
tr: Sembolde simge bulunmuyor.
zh_hans: 此符号无图标。
zh_hant: 這個符號沒有圖示。

# Asynchronous_method_cannot_have_ref_out_parameters_colon_bracket_0_bracket
source: Asynchronous method cannot have ref/out parameters : [{0}]
cs: Asynchronní metody nemůžou mít parametry ref/out: [{0}].
de: Asynchrone Methode darf keine ref/out-Parameter aufweisen : [{0}]
es: El método asincrónico no puede tener parámetros ref/out: [{0}]
fr: Une méthode asynchrone ne peut pas contenir des paramètres ref/out : [{0}]
it: Il metodo asincrono non può contenere parametri ref/out: [{0}]
ja: 非同期メソッドが ref/out パラメーターを持つことはできません : [{0}]
ko: 비동기 메서드에는 ref/out 매개 변수 [{0}]을(를) 포함할 수 없습니다.
pl: Metoda asynchroniczna nie może zawierać parametrów ref/out: [{0}]
pt_br: Método assíncrono não pode ter parâmetros ref/out: [{0}]
ru: Асинхронный метод не может иметь параметры ref/out: [{0}]
tr: Zaman uyumsuz yöntem ref/out parametrelerine sahip olamaz: [{0}]
zh_hans: 异步方法不能包含 ref/out 参数:[{0}]
zh_hant: 非同步方法不可有 ref/out 參數: [{0}]

source: The member is defined in metadata.
cs: Člen je definovaný v metadatech.
de: Das Element wird in den Metadaten definiert.
es: El miembro está definido en metadatos.
fr: Le membre est défini dans des métadonnées.
it: Il membro è definito nei metadati.
ja: メンバーは、メタデータで定義されます。
ko: 멤버가 메타데이터에 정의되어 있습니다.
pl: Składowa jest zdefiniowana w metadanych.
pt_br: O membro é definido em metadados.
ru: Член определен в метаданных.
tr: Meta veriler içinde tanımlı üye.
zh_hans: 此成员是在元数据中定义的。
zh_hant: 該成員定義於中繼資料內。

source: You can only change the signature of a constructor, indexer, method or delegate.
cs: Můžete změnit jenom signaturu konstruktoru, indexeru, metody nebo delegáta.
de: Sie können nur die Signatur eines Konstruktors, eines Indexers, einer Methode oder eines Delegaten ändern.
es: Solo se puede cambiar la firma de un constructor, indizador, método o delegado.
fr: Vous pouvez seulement modifier la signature d'un constructeur, d'un indexeur, d'une méthode ou d'un délégué.
it: È possibile modificare solo la firma di un costruttore, un indicizzatore, un metodo o un delegato.
ja: コンストラクター、インデクサー、メソッド、またはデリゲートのシグネチャのみ変更できます。
ko: 생성자, 인덱서, 메서드 또는 대리자의 서명만 변경할 수 있습니다.
pl: Możesz zmienić tylko sygnaturę konstruktora, indeksatora, metody lub delegata.
pt_br: Você só pode alterar a assinatura de um construtor, indexador, método ou delegate.
ru: Вы можете изменить только подпись конструктора, индексатора, метода или делегата.
tr: Yalnızca bir oluşturucunun, dizin oluşturucusunun, yöntemin veya temsilcinin imzasını değiştirebilirsiniz.
zh_hans: 只能更改构造函数、索引器、方法或委托的签名。
zh_hant: 您只能變更建構函式、索引子、方法或委派的簽章。

source: This symbol has related definitions or references in metadata. Changing its signature may result in build errors. Do you want to continue?
cs: Tento symbol má přidružené definice nebo odkazy v metadatech. Změna jeho podpisu může vést k chybám sestavení. Chcete pokračovat?
de: Definitionen oder Verweise im Zusammenhang mit diesem Symbol befinden sich in den Metadaten. Durch Ändern der Signatur können Fehler beim Erstellen auftreten. Möchten Sie fortfahren?
es: Este símbolo tiene definiciones o referencias relacionadas en metadatos. Cambiar la firma puede provocar errores de compilación. ¿Quiere continuar?
fr: Ce symbole possède des définitions ou des références associées dans les métadonnées. La modification de sa signature peut entraîner des erreurs de build. Voulez-vous continuer ?
it: Nei metadati di questo simbolo sono presenti definizioni o riferimenti correlati. Se si modifica la firma, potrebbero verificarsi errori di compilazione. Continuare?
ja: このシンボルはメタデータの関連する定義または参照を持っています。署名を変更すると、ビルド エラーが発生する場合があります。 続行しますか?
ko: 이 기호에는 메타데이터에 관련된 정의 또는 참조가 있습니다. 시그니처를 변경하면 빌드 오류가 발생할 수 있습니다. 계속하시겠습니까?
pl: Ten symbol zawiera powiązane definicje lub odwołania w metadanych. Zmiana jego sygnatury może spowodować błędy kompilacji. Czy chcesz kontynuować?
pt_br: Este símbolo possui definições relacionadas ou referências nos metadados. Alterar sua assinatura pode resultar em erros de compilação. Deseja continuar?
ru: Этот символ имеет связанные с ним определения или ссылки в метаданных. Изменение его подписи может привести к ошибкам сборки. Продолжить?
tr: Bu sembol meta verilerde ilgili tanımlara veya başvurulara sahiptir. İmzasını değiştirmek yapı hatalarına neden olabilir. Devam etmek istiyor musunuz?
zh_hans: 此符号在元数据中有相关定义或引用。更它的签名可能会造成生成错误。 想要继续吗?
zh_hant: 中繼資料內包含有此符號的相關定義或參考。變更其簽章可能會導致建置錯誤。 要繼續嗎?

source: Change signature...
cs: Změnit signaturu...
de: Signatur ändern...
es: Cambiar firma...
fr: Modifier la signature...
it: Modifica firma...
ja: 署名の変更...
ko: 시그니처 변경...
pl: Zmień sygnaturę...
pt_br: Alterar assinatura...
ru: Изменить подпись...
tr: İmzayı değiştir...
zh_hans: 更改签名...
zh_hant: 變更簽章...

source: Generate new type...
cs: Generovat nový typ...
de: Neuen Typ generieren...
es: Generar nuevo tipo...
fr: Générer un nouveau type...
it: Genera nuovo tipo...
ja: 新しい型の生成...
ko: 새 형식 생성...
pl: Generuj nowy typ...
pt_br: Gerar novo tipo...
ru: Создать новый тип...
tr: Yeni tür üret...
zh_hans: 生成新类型...
zh_hant: 產生新的類型...

source: User Diagnostic Analyzer Failure.
cs: Selhání uživatelského diagnostického analyzátoru
de: Benutzerfehler bei Diagnoseanalysetool.
es: Error del analizador de diagnóstico de usuario.
fr: Échec de l'analyseur de diagnostic utilisateur.
it: Errore dell'analizzatore diagnostico utente.
ja: ユーザー診断アナライザーが失敗しました。
ko: 사용자 진단 분석기 오류입니다.
pl: Błąd analizatora diagnostycznego użytkownika.
pt_br: Falha do Analisador de Diagnóstico do Usuário.
ru: Сбой диагностического анализатора пользователей.
tr: Kullanıcı Tanılama Çözümleyicisi Hatası.
zh_hans: 用户诊断分析器失败。
zh_hant: 使用者診斷分析器失敗。
