Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_inline_options_long
source: Enables or disables specific pattern matching options for the remainder of a regular expression. The options to enable are specified after the question mark, and the options to disable after the minus sign. The allowed options are: i Use case-insensitive matching. m Use multiline mode, where ^ and $ match the beginning and end of each line (instead of the beginning and end of the input string). s Use single-line mode, where the period (.) matches every character (instead of every character except \n). n Do not capture unnamed groups. The only valid captures are explicitly named or numbered groups of the form (?<name> subexpression). x Exclude unescaped white space from the pattern, and enable comments after a number sign (#).
cs: Povoluje nebo zakazuje specifické možnosti pro porovnávání vzorů pro zbytek regulárního výrazu. Možnosti, které se povolují, se zadávají za otazník a možnosti, které se zakazují, za symbol minus. Povolené možnosti: i Použije se porovnávání bez rozlišování malých a velkých písmen. m Použije se víceřádkový režim, kde ^ a $ odpovídají začátku a konci každého řádku (místo začátku a konce vstupního řetězce). s Použije se jednořádkový režim, kde tečka (.) odpovídá každému znaku (místo každému znaku kromě \n). n Nezachytává nepojmenované skupiny. Jediná platná zachycení představují explicitně pojmenované nebo číslované skupiny formuláře (? <name> subexpression). x Vyloučí ze vzoru prázdné znaky, které nejsou řídicími znaky, a povolí komentáře za symbolem čísla (#).
de: Aktiviert oder deaktiviert bestimmte Optionen zum Musterabgleich für den Rest eines regulären Ausdrucks. Die zu aktivierenden Optionen werden nach dem Fragezeichen und die zu deaktivierenden Optionen nach dem Minuszeichen angegeben. Zulässige Optionen: i Führt den Abgleich ohne Unterscheidung nach Groß-/Kleinschreibung durch. m Verwendet den mehrzeiligen Modus, wobei "^" und "$" mit Anfang und Ende jeder einzelnen Zeile übereinstimmen (anstelle von Anfang und Ende der Eingabezeichenfolge). s Verwendet den einzeiligen Modus, wobei der Punkt (.) mit jedem Zeichen übereinstimmt (anstelle von jedem Zeichen außer "\n"). n Erfasst keine unbenannten Gruppen. Die einzigen gültigen Erfassungen sind explizit benannte oder nummerierte Gruppen im Format (?<name> Teilausdruck). x Schließt Leerraum ohne Escapezeichen aus dem Muster aus und aktiviert Kommentare nach einem Nummernzeichen (#).
es: Habilita o deshabilita las opciones de coincidencia de patrones específicas para el resto de una expresión regular. Las opciones de habilitación se especifican después del signo de interrogación y las opciones de deshabilitación después del signo menos. Las opciones permitidas son: i Usar la coincidencia sin distinción de mayúsculas y minúsculas. m Usar el modo de varias líneas, donde ^ y $ coinciden con el principio y el final de cada línea (en lugar del principio y del final de la cadena de entrada). s Usar el modo de una sola línea, donde el punto (.) coincide con todos los caracteres (en lugar de todos los caracteres excepto \n). n No capturar grupos sin nombre. Las únicas capturas válidas son explícitamente o grupos con nombre o número con el formato (? <name> subexpresión). x Excluir el espacio en blanco sin escape del patrón y habilitar los comentarios después de un signo de número (#).
fr: Active ou désactive des options de critères spéciaux spécifiques pour le reste d'une expression régulière. Les options à activer sont spécifiées après le point d'interrogation, et les options à désactiver après le signe moins. Les options autorisées sont les suivantes : i Utilise la correspondance sans respect de la casse. m Utilise le mode multiligne, où ^ et $ correspondent au début et à la fin de chaque ligne (au lieu du début et de la fin de la chaîne d'entrée). s Utilise le mode monoligne, où le point (.) correspond à chaque caractère (au lieu de chaque caractère sauf \n). n Ne capture pas les groupes sans nom. Les seules captures valides sont des groupes explicitement nommés ou numérotés ayant la forme (?<nom> sous-expression). x Exclut les espaces blancs sans séquence d'échappement du modèle, et active les commentaires après un signe dièse (#).
it: Abilita o disabilita opzioni specifiche dei criteri di ricerca per il resto di un'espressione regolare. Le opzioni da abilitare vengono specificate dopo il punto interrogativo, mentre quelle da disabilitare vengono specificate dopo il segno meno. Le opzioni consentite sono: i Usa la corrispondenza che non fa distinzione tra maiuscole e minuscole. m Usa la modalità multiriga, in cui ^ e $ corrispondono all'inizio e alla fine di ogni riga anziché all'inizio e alla fine della stringa di input. s Usa la modalità a riga singola, in cui il punto (.) corrisponde a qualsiasi carattere anziché a ogni carattere eccetto \n. n Non acquisisce gruppi senza nome. Le uniche acquisizioni valide sono gruppi denominati o numerati in modo esplicito nel formato (?<nome> sottoespressione). x Esclude gli spazi vuoti senza caratteri di escape nel criterio e abilita i commenti dopo un simbolo di cancelletto (#).
ja: 正規表現の残りの部分の特定のパターン マッチング オプションを有効または無効にします。有効にするオプションは疑問符の後に指定し、無効にするオプションはマイナス記号の後に指定します。許可されているオプションは次のとおりです。 i 大文字と小文字を区別しない一致を使用します。 m ^ と $ は、(入力文字列の先頭および末尾ではなく) 各行の先頭および末尾と一致します。 s 単一行モードを使用します。このモードでは、ピリオド (.) は任意の 1 文字と一致します (\n を除くすべての文字の代用)。 n 名前のないグループをキャプチャしません。(?<name> subexpression) という形式で、 明示的に名前または番号が付加されたグループのみを有効なキャプチャ対象とします。 x エスケープされていない空白をパターンから除外し、番号記号 (#) の後ろの コメントを有効にします。
ko: 정규식의 나머지 부분에 대해 특정 패턴 일치 옵션을 사용하거나 사용하지 않도록 설정합니다. 사용하도록 설정하는 옵션은 물음표 뒤에 지정되며 사용하지 않도록 설정하는 옵션은 빼기 기호 뒤에 지정됩니다. 허용되는 옵션은 다음과 같습니다. i 대/소문자를 구분하지 않는 일치를 사용합니다. m 여러 줄 모드를 사용합니다. 여기서, ^ 및 $는 각 줄의 시작 및 끝과 일치시킵니다(입력 문자열의 시작 및 끝이 아님). s 한 줄 모드를 사용합니다. 여기서, 마침표(.)는 모든 문자(\n을 제외한 모든 문자가 아님)와 일치시킵니다. n 명명되지 않은 그룹을 캡처하지 않습니다. 양식(?<이름> 하위 식)의 명시적으로 명명된 그룹 또는 번호가 매겨진 그룹만 유효한 캡처입니다. x 이스케이프되지 않은 공백은 패턴에서 제외하고 주석은 숫자 기호(#) 다음에 사용합니다.
pl: Włącza lub wyłącza określone opcje dopasowania wzorca dla pozostałej części wyrażenia regularnego. Opcje do włączenia określa się po znaku zapytania, a opcje do wyłączenia określa się po znaku minus. Dozwolone opcje: i Użyj dopasowywania bez uwzględniania wielkości liter. m Użyj trybu wielowierszowego, gdzie znaki ^ i $ pasują na początku i na końcu każdego wiersza (zamiast na początku i na końcu ciągu wejściowego). s Użyj trybu jednowierszowego, gdzie kropka (.) pasuje do każdego znaku (zamiast do każdego znaku z wyjątkiem znaku \n). n Nie przechwytuj grup nienazwanych. Przechwytywane są tylko jawnie nazwane lub numerowane grupy w postaci (?<nazwa> podwyrażenie). x Wyklucz z wzorca białe znaki bez zmiany znaczenia i włącz komentarze po znaku numeru (#).
pt_br: Habilita ou desabilita as opções de correspondência de padrões específicas para o restante de uma expressão regular. As opções a serem habilitadas são especificadas após o ponto de interrogação e as opções a serem desabilitadas, após o sinal de menos. As opções permitidas são: i Usar a correspondência que não diferencia maiúsculas de minúsculas. m Usar o modo multilinha, no qual ^ e $ correspondem ao início e ao fim de cada linha (em vez do início e do fim da cadeia de caracteres de entrada). s Usar o modo de linha única, no qual o ponto (.) corresponde a cada caractere (em vez de cada caractere exceto \n). n Não capturar grupos sem nome. As únicas capturas válidas são os grupos nomeados ou numerados explicitamente do formato (?<name> subexpressão). x Excluir o espaço em branco sem escape do padrão e habilitar os comentários após um sinal de número (#).
ru: Включает или отключает конкретные параметры сопоставления шаблонов для оставшейся части регулярного выражения. Включаемые параметры указаны после вопросительного знака, а отключаемые параметры — после знака минус. Допустимые параметры: i Использовать сопоставление без учета регистра. m Использовать многострочный режим, где ^ и $ соответствуют началу и концу каждой строки (вместо начала и конца входной строки). s Использовать однострочный режим, где точка (.) соответствует каждому символу (а не каждому символу, кроме \n). n Не записывать неименованные группы. Для записи подходят только явно именованные или нумерованные группы формы (?<name> часть выражения). x Исключить неэкранированный пробел из шаблона и включить комментарии после символа решетки (#).
tr: Normal bir ifadenin kalanı için belirli desen eşleştirme seçeneklerini etkinleştirir veya devre dışı bırakır. Etkinleştirilecek seçenekler soru işaretinden sonra ve devre dışı bırakılacak seçenekler eksi işaretinden sonra belirtilir. İzin verilen seçenekler şunlardır: i Büyük/küçük harfe duyarsız eşleşme kullan. m ^ ve $ karakterlerinin her satırın başı ve sonuyla eşleştiği çok satırlı modu kullan (giriş dizesinin başı ve sonu yerine). s Noktanın (.) her karakter ile eşleştiği tek satırlı modu kullan (\n dışında her karakter yerine). n Adsız grupları yakalama. Yalnızca şu yakalamalar geçerlidir: formun açıkça adlandırılmış veya numaralandırılmış grupları (?<name> alt ifadesi). x Kaçışsız boşluğu desenden çıkar ve sayı işaretinden (#) sonra açıklamaları etkinleştir.
zh_hans: 为正则表达式的其余部分启用或禁用特定模式匹配选项。在问号后面指定要启用的选项，在减号后指定要禁用的选项。允许的选项有: i 使用不区分大小写的匹配。 m 使用多行模式，其中 ^ 和 $ 分别匹配每行的开头和结尾 (而不是输入字符串的开头和结尾)。 s 使用单行模式，其中句点(.)与每个字符 (而不是除 \n 之外的每个字符)匹配。 n 请勿捕获未命名的组。唯一有效的捕获已被显式 命名为或编码为(?<name> subexpression)形式的组。 x 请删除模式中的非转义空格，并 在数字符号(#)之后使用注释。
zh_hant: 對規則運算式的其餘部份啟用或停用特定的模式比對選項。要啟用的選項會在問號後指定，要停用的選項則在減號後。允許的選項為: i 使用不區分大小寫的比對。 m 使用多行模式，其中 ^ 和 $ 會比對各行的結尾 (而非輸入字串的開頭和結尾)。 s 使用單行模式，其中句點 (.) 會比對每個字元 (而不是 \n 除外的每個字元)。 n 請勿擷取未命名的群組。唯一有效的擷取為明確 命名或編號的格式群組 (?<name> 子運算式)。 x 從模式中排除未逸出的空白字元，並在 數字記號 (#) 後啟用註解。

# Regex_inline_options_short
source: inline options
cs: vložené možnosti
de: Inlineoptionen
es: opciones insertadas
fr: options incluses
it: opzioni inline
ja: インライン オプション
ko: 인라인 옵션
pl: opcje wewnętrzne
pt_br: opções embutidas
ru: встроенные параметры
tr: satır içi seçenekler
zh_hans: 内联选项
zh_hant: 內嵌選項

source: Regex issue: {0}
cs: Problém s regulárním výrazem: {0}
de: RegEx-Fehler: {0}
es: Problema de Regex: {0}
fr: Problème de regex : {0}
it: Problema di regex: {0}
ja: 正規表現の問題: {0}
ko: Regex 문제: {0}
pl: Problem z wyrażeniem regularnym: {0}
pt_br: Problema do Regex: {0}
ru: Проблема с регулярным выражением: {0}
tr: Regex sorunu: {0}
zh_hans: 正则表达式问题: {0}
zh_hant: Regex 問題: {0}

# Regex_letter_lowercase
source: letter, lowercase
cs: písmeno, malá písmena
de: Buchstabe, Kleinbuchstabe
es: letra, minúscula
fr: lettre, minuscule
it: alfanumerico, minuscolo
ja: 文字、小文字
ko: 문자, 소문자
pl: litera, mała
pt_br: letra, minúscula
ru: буква, строчная
tr: harf, küçük harf
zh_hans: 字母，小写
zh_hant: 字母，小寫

# Regex_letter_modifier
source: letter, modifier
cs: písmeno, modifikátor
de: Buchstabe, Modifizierer
es: letra, modificador
fr: lettre, modificateur
it: alfanumerico, modificatore
ja: 文字、修飾子
ko: 문자, 한정자
pl: litera, modyfikator
pt_br: letra, modificador
ru: буква, модификатор
tr: harf, değiştirici
zh_hans: 字母，修饰符
zh_hant: 字母，修飾元

# Regex_letter_other
source: letter, other
cs: písmeno, jiné
de: Buchstabe, sonstiger
es: letra, otro
fr: lettre, autre
it: alfanumerico, altro
ja: 文字、その他
ko: 문자, 기타
pl: litera, inna
pt_br: letra, outro
ru: буква, другая
tr: harf, diğer
zh_hans: 字母，其他
zh_hant: 字母，其他

# Regex_letter_titlecase
source: letter, titlecase
cs: písmeno, velká počáteční písmena
de: Buchstabe, erster Buchstabe groß
es: letra, tipo título
fr: lettre, première lettre des mots en majuscule
it: alfanumerico, titolo
ja: 文字、タイトル文字
ko: 문자, 첫 글자만 대문자
pl: litera, jak nazwy własne
pt_br: letra, inicial maiúscula
ru: буква, заглавная
tr: harf, ilk harfler büyük
zh_hans: 字母，首字母大写
zh_hant: 字母，字首大寫

# Regex_letter_uppercase
source: letter, uppercase
cs: písmeno, velká písmena
de: Buchstabe, Großbuchstabe
es: letra, mayúscula
fr: lettre, majuscule
it: alfanumerico, maiuscolo
ja: 文字、大文字
ko: 문자, 대문자
pl: litera, wielka
pt_br: letra, maiúscula
ru: буква, прописная
tr: harf, büyük harf
zh_hans: 字母，大写
zh_hant: 字母，大寫

# Regex_mark_enclosing
source: mark, enclosing
cs: značka, uzavření
de: Zeichen, einschließendes Zeichen
es: marca, de cierre
fr: marque, englobante
it: contrassegno, chiusura
ja: 結合文字、囲み
ko: 표시, 묶음
pl: znacznik, otaczający
pt_br: marca, delimitação
ru: метка, с включением
tr: işaret, kapsayan
zh_hans: 标记，封闭
zh_hant: 標記，封閉式

# Regex_mark_nonspacing
source: mark, nonspacing
cs: značka, bez mezer
de: Zeichen, Zeichen ohne eigene Breite
es: marca, sin espaciado
fr: marque, sans espacement
it: contrassegno, non spaziatura
ja: 結合文字、幅なし
ko: 표시, 공간을 차지하지 않음
pl: znacznik, nierozdzielający
pt_br: marca, não espaçamento
ru: метка, без пробелов
tr: işaret, aralıksız
zh_hans: 标记，非间距
zh_hant: 標記，不佔空間

# Regex_mark_spacing_combining
source: mark, spacing combining
cs: značka, kombinování mezer
de: Zeichen, Zeichen mit eigener Breite, Verbindung
es: marca, espaciado combinable
fr: marque, espacement combiné
it: contrassegno, spaziatura combinata
ja: 結合文字、幅あり
ko: 표시, 간격 결합
pl: znacznik, rozdzielający łączący
pt_br: marca, combinação de espaçamento
ru: метка, объединение интервалов
tr: işaretler, aralık birleştirme
zh_hans: 标记，间距组合
zh_hant: 標記，組合空間

# Regex_match_at_least_n_times_lazy_long
source: The {n,}? quantifier matches the preceding element at least n times, where n is any integer, but as few times as possible. It is the lazy counterpart of the greedy quantifier {n,}
cs: Kvantifikátor {n,}? najde shodu předchozího elementu nejméně n-krát, kde n je celé číslo, ale co nejméněkrát. Jedná se o líný protějšek hladového kvantifikátoru {n,}.
de: Der Quantifizierer "{n,}?" stimmt mit dem vorhergehenden Element mindestens n-mal, jedoch möglichst wenige Male überein. "n" steht hierbei für eine beliebige ganze Zahl. Dies ist das träge Äquivalent zum gierigen Quantifizierer "{n,}".
es: El cuantificador {n,}? coincide con el elemento anterior al menos n veces, donde n es cualquier entero, pero el menor número de veces que sea posible. Es el homólogo diferido del cuantificador expansivo {n,}
fr: Le quantificateur {n,}? recherche une correspondance avec l'élément précédent au moins n fois, où n est un entier, mais de manière aussi limitée possible. Il s'agit de l'équivalent paresseux du quantificateur gourmand {n,}
it: Il quantificatore {n,}? trova la corrispondenza con l'elemento precedente almeno n volte, dove n è qualsiasi numero intero, ma il minor numero di volte possibile. Si tratta della controparte lazy del quantificatore greedy {n,}
ja: {n,}? 量指定子は、直前の要素の n 回以上の繰り返しに一致します。ここで、n は任意の整数ですが、最も少ない回数に一致します。これは、最長一致の量指定子 {n,} に対応する、最短一致の量指定子です
ko: {n,}? 수량자는 n번 이상 이전 요소와 일치시키지만 가능한 한 적은 횟수로 일치시킵니다. 여기서, n은 정수입니다. 탐욕적 수량자 {n,}에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator {n,}? dopasowuje poprzedzający element co najmniej n razy, gdzie n jest dowolną liczbą całkowitą, lecz najmniejszą możliwą liczbę razy. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego {n,}.
pt_br: O quantificador {n,}? corresponde ao elemento precedente pelo menos n vezes, em que n é qualquer inteiro, mas o menor número de vezes possível. Ele é a contraparte lenta do quantificador greedy {n,}
ru: Квантификатор {n,}? соответствует предыдущему элементу по меньшей мере n раз, где n — любое целое число, при этом данное количество должно быть минимальным. Это "ленивый" аналог "жадного" квантификатора {n,}
tr: {n,}? niceleyicisi önceki öğeyle en az n kez eşleşir (burada n herhangi bir tamsayıdır), ancak bunu mümkün olduğunca az sayıda yapar. Bu, hızlı niceleyicinin gecikmeli karşılığıdır {n,}
zh_hans: {n,}? 限定符匹配前面的元素至少 n 次，其中 n 是任何整数，但次数尽可能少。它是贪婪限定符 {n,} 的惰性副本
zh_hant: {n,}? 數量詞會比對前置元素至少 n 次，其中 n 為任何整數，但盡可能壓低次數。這是與窮盡數量詞 {n,} 相對的少數優先概念

# Regex_match_at_least_n_times_lazy_short
source: match at least 'n' times (lazy)
cs: shoda nejméně n-krát (líný režim)
de: Mindestens n-malige Übereinstimmung (träge)
es: coincidir al menos "n" veces (diferido)
fr: rechercher une correspondance au moins 'n' fois (paresseux)
it: trova la corrispondenza almeno 'n' volte (corrispondenza lazy)
ja: 'n' 回以上一致 (最短一致)
ko: 'n'번 이상 일치(지연)
pl: dopasuj co najmniej „n” razy (powściągliwie)
pt_br: corresponder pelo menos 'n' vezes (lento)
ru: совпадение не менее "n" раз (ленивый)
tr: en az 'n' kez eşle (gecikmeli)
zh_hans: 至少匹配 "n" 次(惰性)
zh_hant: 至少符合 'n' 次 (延遲)

# Regex_match_at_least_n_times_long
source: The {n,} quantifier matches the preceding element at least n times, where n is any integer. {n,} is a greedy quantifier whose lazy equivalent is {n,}?
cs: Kvantifikátor {n,} najde shodu předchozího elementu nejméně n-krát, kde n je celé číslo. {n,} je hladový kvantifikátor, jehož líným ekvivalentem je {n,}?.
de: Der Quantifizierer "{n,}" stimmt mit dem vorhergehenden Element mindestens n-mal überein. "n" steht hierbei für eine beliebige ganze Zahl. "{n,}" ist ein gieriger Quantifizierer, dessen träges Äquivalent "{n,}?" lautet.
es: El cuantificador {n,} coincide con el elemento anterior al menos n veces, donde n es un entero. {n,} es un cuantificador expansivo cuyo equivalente diferido es {n,}?
fr: Le quantificateur {n,} recherche une correspondance avec l'élément précédent au moins n fois, où n est un entier. {n,} est un quantificateur gourmand dont l'équivalent paresseux est {n,}?
it: Il quantificatore {n,} trova la corrispondenza con l'elemento precedente almeno n volte, dove n è qualsiasi numero intero. {n,} è un quantificatore greedy il cui equivalente lazy è {n,}?
ja: {n,} 量指定子は、直前の要素の n 回以上の繰り返しに一致します。ここで、n は任意の整数です。{n,} は最長一致の量指定子であり、最短一致でこれに対応するのは {n,}? です
ko: {n,} 수량자는 n번 이상 이전 요소와 일치시킵니다. 여기서, n은 정수입니다. {n,}는 해당 게으른 수량자가 {n,}?인 탐욕적 수량자입니다.
pl: Kwantyfikator {n,} dopasowuje poprzedzający element co najmniej n razy, gdzie n jest dowolną liczbą całkowitą. Jest to kwantyfikator zachłanny, a jego powściągliwy odpowiednik to {n,}?.
pt_br: O quantificador {n,} corresponde ao elemento precedente pelo menos n vezes, em que n é qualquer número inteiro. {n,} é um quantificador greedy cujo equivalente lento é {n,}?
ru: Квантификатор {n,} соответствует предыдущему элементу по меньшей мере n раз, где n — любое целое число. {n,} — это "жадный" квантификатор, "ленивым" аналогом которого является {n,}?
tr: {n,} niceleyicisi önceki öğeyle en az n kez eşleşir (burada n herhangi bir tamsayıdır). {n,}, gecikmeli karşılığı {n,}? olan hızlı bir niceleyicidir
zh_hans: {n,} 限定符匹配前面的元素至少 n 次，其中 n 是任何整数。{n,} 是贪婪限定符，其惰性等效值为 {n,}?
zh_hant: {n,} 數量詞會比對前置元素至少 n 次，其中 n 為任何整數。{n,} 是窮盡數量詞，其少數優先的相對概念為 {n,}?

# Regex_match_at_least_n_times_short
source: match at least 'n' times
cs: shoda nejméně n-krát
de: Mindestens n-malige Übereinstimmung
es: coincidir al menos "n" veces
fr: rechercher une correspondance au moins 'n' fois
it: trova la corrispondenza almeno 'n' volte
ja: 'n' 回以上一致
ko: 'n'번 이상 일치
pl: dopasuj co najmniej „n” razy
pt_br: corresponder a pelo menos 'n' vezes
ru: совпадают по меньшей мере "n" раз
tr: en az 'n' kez eşleş
zh_hans: 至少匹配 "n" 次
zh_hant: 比對至少 'n' 次

# Regex_match_between_m_and_n_times_lazy_long
source: The {n,m}? quantifier matches the preceding element between n and m times, where n and m are integers, but as few times as possible. It is the lazy counterpart of the greedy quantifier {n,m}
cs: Kvantifikátor {n,m}? najde shodu předchozího elementu v rozmezí n-krát a m-krát, kde n a m jsou celá čísla, ale co nejméněkrát. Jedná se o líný protějšek hladového kvantifikátoru {n,m}.
de: Der Quantifizierer "{n,m}?" stimmt mit dem vorhergehenden Element zwischen n- und m-mal, jedoch möglichst wenige Male überein. "n" und "m" stehen hierbei für ganze Zahlen. Dies ist das träge Äquivalent zum gierigen Quantifizierer "{n,m}".
es: El cuantificador {n,m}? coincide con el elemento anterior entre n y m veces, donde n y m son enteros, pero el menor número de veces que sea posible. Es el homólogo diferido del cuantificador expansivo {n,m}
fr: Le quantificateur {n,m}? recherche une correspondance avec l'élément précédent entre n et m fois, où n et m sont des entiers, mais de manière aussi limitée possible. Il s'agit de l'équivalent paresseux du quantificateur gourmand {n,m}
it: Il quantificatore {n,m}? trova la corrispondenza con l'elemento precedente tra n e m volte, dove n e m sono numeri interi, ma il minor numero di volte possibile. Si tratta della controparte lazy del quantificatore greedy {n,m}
ja: {n,m}? 量指定子は、直前の要素の n 回から m 回までの繰り返しのうち、最も少ない繰り返しに一致します。ここで、n と m は整数です。これは、最長一致の量指定子 {n,m} に対応する、最短一致の量指定子です
ko: {n,m}? 수량자는 n 및 m번 사이로 이전 요소와 일치시키지만 가능한 한 적은 횟수로 일치시킵니다. 여기서, n 및 m은 정수입니다. 탐욕적 수량자 {n,m}에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator {n,m}? dopasowuje poprzedzający element od n do m razy, gdzie n i m to dowolne liczby całkowite, lecz najmniejszą możliwą liczbę razy. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego {n,m}.
pt_br: O quantificador {n,m}? corresponde ao elemento precedente entre n e m vezes, em que n e m são inteiros, mas o menor número de vezes possível. Ele é a contraparte lenta do quantificador greedy {n,m}
ru: Квантификатор {n,m}? соответствует предыдущему элементу от n до m раз, где n и m — любые целые числа, при этом данное количество должно быть минимальным. Это "ленивый" аналог "жадного" квантификатора {n,m}
tr: {n,m}? niceleyicisi, bir önceki öğeyle en az n ve en çok m kez eşleşir (burada n ve m tamsayıdır), ancak bunu olabildiğince az sayıda yapar. Bu, {n,m} hızlı niceleyicisinin gecikmeli karşılığıdır
zh_hans: {n,m}? 限定符匹配前面的元素 n 次和 m 次，其中 n 和 m 是整数，但次数尽可能少。它是贪婪限定符 {n, m} 的惰性副本
zh_hant: {n,m}? 數量詞會比對前置元素 n 到 m 次，其中 n 和 m 為整數，但盡可能壓低次數。這是與窮盡數量詞 {n,m} 相對的少數優先概念

# Regex_match_between_m_and_n_times_lazy_short
source: match at least 'n' times (lazy)
cs: shoda nejméně n-krát (líný režim)
de: Mindestens n-malige Übereinstimmung (träge)
es: coincidir al menos "n" veces (diferido)
fr: rechercher une correspondance au moins 'n' fois (paresseux)
it: trova la corrispondenza almeno 'n' volte (corrispondenza lazy)
ja: 'n' 回以上一致 (最短一致)
ko: 'n'번 이상 일치(지연)
pl: dopasuj co najmniej „n” razy (powściągliwie)
pt_br: corresponder pelo menos 'n' vezes (lento)
ru: совпадение не менее "n" раз (ленивый)
tr: en az 'n' kez eşle (gecikmeli)
zh_hans: 至少匹配 "n" 次(惰性)
zh_hant: 至少符合 'n' 次 (延遲)
