Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_negative_character_range_long
source: A negative character range specifies a list of characters that must not appear in an input string for a match to occur. 'firstCharacter' is the character that begins the range, and 'lastCharacter' is the character that ends the range. Two or more character ranges can be concatenated. For example, to specify the range of decimal digits from "0" through "9", the range of lowercase letters from "a" through "f", and the range of uppercase letters from "A" through "F", use [0-9a-fA-F].
cs: Negativní rozsah znaků určuje seznam znaků, které se nesmí vyskytovat ve vstupním řetězci, aby došlo ke shodě. firstCharacter je znak, kterým rozsah začíná, a lastCharacter je znak, kterým rozsah končí. Je možné zřetězit dva nebo více rozsahů znaků. Pokud chcete například zadat rozsah desítkových číslic od 0 do 9, rozsah malých písmen od a do f a rozsah velkých písmen od A do F, použijte [0-9A-fA-F].
de: Ein negativer Zeichenbereich gibt eine Liste von Zeichen an, die nicht in einer Eingabezeichenfolge vorkommen dürfen, damit eine Übereinstimmung vorliegt. "firstCharacter" entspricht dem ersten Zeichen und "lastCharacter" dem letzten Zeichen im Bereich. Mehrere Zeichenbereiche können verkettet werden. Um beispielsweise den Bereich der Dezimalstellen von "0" bis "9", den Bereich der Kleinbuchstaben von "a" bis "f" und den Bereich der Großbuchstaben von "A" bis "F" anzugeben, verwenden Sie "[0-9a-fA-F]".
es: Un intervalo de caracteres negativos especifica una lista de caracteres que no deben aparecer en una cadena de entrada para que se produzca una correspondencia. "firstCharacter" es el carácter con el que comienza el intervalo y "lastCharacter" es el carácter con el que finaliza el intervalo. Se pueden concatenar dos o más intervalos de caracteres. Por ejemplo, para especificar el intervalo de dígitos decimales de "0" a "9", el intervalo de letras minúsculas de "a" a "f" y el intervalo de letras mayúsculas de "A" a "F", utilice [0-9a-fA-F].
fr: Une plage de caractères négative spécifie une liste de caractères qui doivent être absents d'une chaîne d'entrée pour produire une correspondance. 'firstCharacter' est le caractère de début de plage, et 'lastCharacter' est le caractère de fin de plage. Vous pouvez concaténer au moins deux plages de caractères. Par exemple, pour spécifier la plage de chiffres décimaux allant de "0" à "9", la plage de lettres minuscules allant de "a" à "f" et la plage de lettres majuscules allant de "A" à "F", utilisez [0-9a-fA-F].
it: Un intervallo di caratteri negativi specifica un elenco di caratteri che non devono essere presenti in una stringa di input per trovare una corrispondenza. 'firstCharacter' è il carattere che inizia l'intervallo e 'lastCharacter' è il carattere che lo termina. Due o più intervalli di caratteri possono essere concatenati. Ad esempio, per specificare l'intervallo di cifre decimali comprese tra "0" e "9", l'intervallo di lettere minuscole comprese tra "a" e "f" e l'intervallo di lettere maiuscole comprese tra "A" e "F", usare [0-9a-fA-F].
ja: 文字範囲の否定では、入力文字列に含まれなければ一致と見なされる文字の一覧を指定します。'firstCharacter' は範囲の先頭の文字で、'lastCharacter' は範囲の末尾の文字です。 2 つ以上の文字範囲を連結することができます。たとえば、"0" から "9" の範囲の 10 進数、"a" から "f" の範囲の小文字、"A" から "F" の範囲の大文字を指定するには、[0-9a-fA-F] を使用します。
ko: 부정 문자 범위는 일치 항목을 찾을 입력 문자열에 표시되지 않아야 하는 문자 목록을 지정합니다. 'firstCharacter'는 범위를 시작하는 문자이고 'lastCharacter'는 범위를 끝내는 문자입니다. 둘 이상의 문자 범위를 연결할 수 있습니다. 예를 들어 "0"에서 "9"까지의 10진수 범위, "a"에서 "f"까지의 소문자 범위 및 "A"에서 "F"까지의 대문자 범위를 지정하려면 [0-9a-fA-F]를 사용합니다.
pl: Negatywny zakres znaków określa listę znaków, które nie mogą pojawić się w ciągu wejściowym, jeśli ma nastąpić dopasowanie. Element „firstCharacter” to znak rozpoczynający zakres, a element „lastCharacter” to znak kończący zakres. Można połączyć dwa lub więcej zakresów znaków. Na przykład aby określić zakres cyfr dziesiętnych od „0” do „9”, zakres małych liter od „a” do „f” i zakres wielkich liter od „A” do „F”, użyj elementu [0-9A-fA-F].
pt_br: Um intervalo de caracteres negativos especifica uma lista de caracteres que não podem aparecer em uma cadeia de caracteres de entrada para que uma correspondência ocorra. 'firstCharacter' é o caractere que inicia o intervalo e 'lastCharacter' é o caractere que termina o intervalo. Dois ou mais intervalos de caracteres podem ser concatenados. Por exemplo, para especificar o intervalo de dígitos decimais de "0" a "9", o intervalo de letras minúsculas de "a" até "f" e o intervalo de letras maiúsculas de "A" até "F", use [0-9a-fA-F].
ru: Отрицательный диапазон символов указывает список символов, которые не должны присутствовать во входной строке для выполняемой проверки соответствия. firstCharacter — это первый символ диапазона, а lastCharacter — последний. Можно сцепить два или более диапазонов символов. Например, чтобы указать диапазон десятичных цифр от 0 до 9, диапазон строчных букв от a до f и диапазон прописных букв от A до F, используйте [0-9a-fA-F].
tr: Negatif bir karakter aralığı, bir eşleştirme oluşması için giriş dizesinde görünmemesi gereken bir karakter listesi belirtir. 'firstCharacter' aralığı başlatan karakter ve 'lastCharacter' ise aralığı sonlandıran karakterdir. İki veya daha fazla karakter aralığı art arda eklenebilir. Örneğin, "0" ile "9" arasındaki ondalık sayıların aralığını, "a" ile "f" arasında küçük harflerin aralığını ve "A" ile "F" arasındaki büyük harflerin aralığını belirtmek için [0-9a-fA-F] kullanın.
zh_hans: 负字符范围指定不能出现在输入字符串中的字符列表，以使匹配发生。"firstCharacter" 是该范围的开始字符，而 "lastCharacter" 是该范围的结束字符。 可以连接两个或更多字符范围。例如，若要指定从 "0" 到 "9" 的十进制数字范围、从 "a" 到 "f" 的小写字母范围以及从 "A" 到 "F" 的大写字母范围，请使用 [0-9a-fA-F]。
zh_hant: 負的字元範圍會指定不應在輸入字串中出現的字元清單，以使比對可行。'firstCharacter' 是開始範圍的字元，'lastCharacter' 則是結束範圍的字元。 可串連二或多個字元範圍。舉例來說，如果要指定十進位數字的範圍 (從 "0" 到 "9")，則小寫字母的範圍為 "a" 到 "f"，大寫字母的範圍為 "A" 到 "F"，使用 [0-9a-fA-F]。

# Regex_negative_unicode_category_long
source: The regular expression construct \P{ name } matches any character that does not belong to a Unicode general category or named block, where name is the category abbreviation or named block name.
cs: Konstruktor regulárního výrazu \P{ name } odpovídá libovolnému znaku, který nepatří do obecné kategorie Unicode nebo pojmenovaného bloku, kde name je zkratka pro kategorii nebo název pojmenovaného bloku.
de: Das Konstrukt des regulären Ausdrucks "\P{ name }" entspricht einem beliebigen Zeichen, das zu keiner allgemeinen Unicode-Kategorie bzw. keinem benannten Block gehört, wobei "name" der Kategorieabkürzung oder dem Namen des benannten Blocks entspricht.
es: La construcción de expresión regular \P{ name } coincide con cualquier carácter que no pertenezca a una categoría general o bloque con nombre de Unicode, donde el nombre es la abreviatura de la categoría o el nombre del bloque con nombre.
fr: La construction d'expression régulière \P{ nom } correspond aux caractères qui n'appartiennent pas à une catégorie générale Unicode ou à un bloc nommé, nom étant l'abréviation de la catégorie ou le nom du bloc nommé.
it: Il costrutto di espressione regolare \P{ name } corrisponde a qualsiasi carattere non appartenente a una categoria generale Unicode o a un blocco denominato, dove name è l'abbreviazione della categoria o il nome del blocco denominato.
ja: 正規表現のコンストラクト \P{ name } は、Unicode 一般カテゴリにも名前付きブロックにも属さない任意の文字と一致します。ここで、name はカテゴリの省略形または名前付きブロックの名前です。
ko: 정규식 구문 \P{ name }는 유니코드 일반 범주 또는 명명된 블록에 속하지 않는 모든 문자와 일치시킵니다. 여기서, name은 범주 약어 또는 명명된 블록 이름입니다.
pl: Konstrukcja wyrażenia regularnego \P{ name } pasuje do dowolnego znaku, który nie należy do kategorii ogólnej znaków Unicode ani do bloku nazwanego, gdzie „nazwa” to skrót kategorii lub nazwa bloku nazwanego.
pt_br: O constructo de expressão regular \P{ name } corresponde a qualquer caractere que não pertença a uma categoria Unicode genérica nem a um bloco nomeado, em que o nome seja a abreviação da categoria ou o nome do bloco nomeado.
ru: Конструкция регулярного выражения \P{ name } соответствует любому символу, который не относится к общей категории Юникода или именованному блоку, где "имя" — это сокращение названия категории или имя именованного блока.
tr: \P{ name } normal ifade yapısı, Unicode genel kategorisine veya adın kategori kısaltması ya da adlandırılmış blok adı olduğu adlandırılmış bloğa ait olmayan herhangi bir karakterle eşleşir.
zh_hans: 正则表达式构造 \P{ name } 匹配不属于 Unicode 通用类别或命名块的任何字符，其中 "name" 是类别缩写或命名块名称。
zh_hant: 規則運算式建構 \P{ name } 會比對任何不屬於 Unicode 一般分類或具名區塊的字元，其中名稱為分類縮寫或具名區塊名稱。

# Regex_negative_unicode_category_short
source: negative unicode category
cs: negativní kategorie Unicode
de: Negative Unicode-Kategorie
es: categoría de Unicode negativa
fr: catégorie Unicode négative
it: categoria Unicode negativa
ja: Unicode カテゴリの否定
ko: 부정 유니코드 범주
pl: negatywna kategoria unicode
pt_br: categoria unicode negativa
ru: отрицательная категория Юникода
tr: negatif Unicode kategorisi
zh_hans: 负 unicode 类别
zh_hant: 負值 Unicode 分類

# Regex_new_line_character_long
source: Matches a new-line character, \u000A
cs: Shoda se znakem pro nový řádek \u000A
de: Entspricht einem Neue-Zeile-Zeichen, \u000A.
es: Coincide con un carácter de nueva línea, \u000A
fr: Correspond au caractère de nouvelle ligne, \u000A
it: Trova la corrispondenza di un carattere di nuova riga \u000A
ja: 改行文字 \u000A に一致します
ko: 줄 바꿈 문자 \u000A와 일치시킵니다.
pl: Pasuje do znaku nowego wiersza — \u000A
pt_br: Corresponde a um caractere de nova linha, \u000A
ru: Соответствует символу новой строки \u000A
tr: Yeni satır karakteriyle \u000A eşleşir
zh_hans: 与换行符(\u000A)匹配
zh_hant: 比對新行字元 \u000A

# Regex_new_line_character_short
source: new-line character
cs: znak pro nový řádek
de: Neue-Zeile-Zeichen
es: carácter de nueva línea
fr: caractère de nouvelle ligne
it: carattere di nuova riga
ja: 改行文字
ko: 줄 바꿈 문자
pl: znak nowego wiersza
pt_br: caractere de nova linha
ru: символ новой строки
tr: yeni satır karakteri
zh_hans: 换行符
zh_hant: 新行字元

# Regex_no
source: no
cs: ne
de: Nein
fr: non
ja: いいえ
ko: 아니요
pl: nie
pt_br: não
ru: нет
tr: hayır
zh_hans: 否
zh_hant: 否

# Regex_non_digit_character_long
source: \D matches any non-digit character. It is equivalent to the \P{Nd} regular expression pattern. If ECMAScript-compliant behavior is specified, \D is equivalent to [^0-9]
cs: \D odpovídá libovolnému nečíselnému znaku. Je ekvivalentem vzoru regulárního výrazu \P{Nd}. Pokud je zadané chování kompatibilní s ECMAScriptem, je \D ekvivalentem [^0-9].
de: "\D" entspricht einem beliebigen Zeichen, das keine Ziffer darstellt. Entspricht dem Muster für reguläre Ausdrücke "\P{Nd}". Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\D" gleichbedeutend mit "[^0-9]".
es: \D coincide con cualquier carácter que no sea un dígito. Equivalente al patrón de expresión regular \P{Nd}. Si se especifica un comportamiento compatible con ECMAScript, \D equivale a [^0-9]
fr: \D correspond à n'importe quel caractère non numérique. Il est équivalent au modèle d'expression régulière \P{Nd}. Si vous spécifiez un comportement conforme à ECMAScript, \D équivaut à [^0-9]
it: \D trova la corrispondenza con qualsiasi carattere non numerico. Equivale al criterio di ricerca di espressioni regolari \P{Nd}. Se viene specificato il comportamento conforme a ECMAScript, \D equivale a [^0-9]
ja: \D は、数字以外の任意の文字に一致します。\P{Nd} 正規表現パターンに相当します。 ECMAScript 準拠の動作が指定されている場合、\D は [^0-9] と同等です
ko: \D는 숫자가 아닌 문자와 일치시킵니다. \P{Nd} 정규식 패턴과 같습니다. ECMAScript 규격 동작을 지정한 경우 \D는 [^0-9]와 같습니다.
pl: Element \D pasuje do dowolnego znaku innego niż cyfra. Jest to równoważnik wzorca wyrażenia regularnego \P{Nd}. Jeśli zostanie określone zachowanie zgodne ze standardem ECMAScript, element \D jest równoważnikiem elementu [^0-9].
pt_br: \D corresponde a qualquer caractere que não seja um dígito. Ele equivale ao padrão de expressão regular \p{Nd}. Se o comportamento em conformidade com o ECMAScript for especificado, \D será equivalente a [^0-9]
ru: \D соответствует любому символу, не являющемуся цифрой. Это эквивалент шаблона регулярного выражения \P{Nd}. Если указано поведение, соответствующее ECMAScript, \D является эквивалентом [^0-9]
tr: \D rakam olmayan herhangi bir karakter ile eşleşir. \P{Nd} normal ifade deseniyle eşdeğerdir. ECMAScript uyumlu davranış belirtilmişse \D, [^0-9] ile eşdeğerdir
zh_hans: \D 与任何非数字字符匹配。它等效于 \P{Nd} 正则表达式模式。 如果指定了符合 ECMAScript 的行为，则 \P 等效于 [^0-9]
zh_hant: \D 符合所有非數字字元。其相當於 \P{Nd} 規則運算式模式。 如果有指定符合 ECMAScript 規範的行為，則 \d 相當於 [^0-9]

# Regex_non_digit_character_short
source: non-digit character
cs: nečíselný znak
de: Nicht-Ziffernzeichen
es: carácter que no es un dígito
fr: caractère non numérique
it: carattere non numerico
ja: 数字以外の文字
ko: 숫자가 아닌 문자
pl: znak inny niż cyfra
pt_br: caractere que não é dígito
ru: символ, не являющийся цифрой
tr: rakam olmayan karakter
zh_hans: 非数字字符
zh_hant: 非數字字元

# Regex_non_white_space_character_long
source: \S matches any non-white-space character. It is equivalent to the [^\f\n\r\t\v\x85\p{Z}] regular expression pattern, or the opposite of the regular expression pattern that is equivalent to \s, which matches white-space characters. If ECMAScript-compliant behavior is specified, \S is equivalent to [^ \f\n\r\t\v]
cs: \S odpovídá libovolnému neprázdnému znaku. Je ekvivalentem vzoru regulárního výrazu [^\f\n\r\t\v\x85\p{Z}] nebo opakem vzoru regulárního výrazu, který je ekvivalentem \s, který najde prázdné znaky. Pokud je zadané chování kompatibilní s ECMAScriptem, je \S ekvivalentem [^ \f\n\r\t\v].
de: "\S" entspricht einem beliebigen Nicht-Leerraumzeichen. Dies ist identisch mit dem Muster für reguläre Ausdrücke "[^\f\n\r\t\v\x85\p{Z}]" oder mit dem Gegenteil des Musters für reguläre Ausdrücke "\s", welches mit Leerraumzeichen übereinstimmt. Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\S" gleichbedeutend mit "[^ \f\n\r\t\v]".
es: \S coincide con cualquier carácter que no sea un espacio en blanco. Equivalente al patrón de expresión regular [^\f\n\r\t\v\x85\p{Z}], o el contrario del modelo de expresión regular equivalente a \s, que corresponde a los caracteres de espacio en blanco. Si se especifica un comportamiento compatible con ECMAScript, \S equivale a [^ \f\n\r\t\v]
fr: \S correspond à tout caractère autre qu'un espace blanc. Il est équivalent au modèle d'expression régulière [^\f\n\r\t\v\x85\p{Z}], ou à l'inverse du modèle d'expression régulière équivalent à \s, qui correspond aux espaces blancs. Si vous spécifiez un comportement conforme à ECMAScript, \S équivaut à [^ \f\n\r\t\v]
it: \S trova la corrispondenza di qualsiasi carattere diverso da uno spazio. Equivale al criterio di ricerca di espressioni regolari [^\f\n\r\t\v\x85\p{Z}] o è il contrario del criterio di ricerca di espressioni regolari equivalente a \s, che corrisponde a spazi vuoti. Se viene specificato il comportamento conforme a ECMAScript, \S equivale a [^ \f\n\r\t\v]
ja: \S は空白以外の任意の文字に一致します。これは、[^\f\n\r\t\v\x85\p{Z}] 正規表現パターンに相当します。また、\s (空白文字に一致) に相当する正規表現パターンの逆に相当します。 ECMAScript 準拠の動作が指定されている場合、\S は [^ \f\n\r\t\v] と同等です
ko: \S는 공백이 아닌 문자와 일치시킵니다. [^\f\n\r\t\v\x85\p{Z}] 정규식 패턴과 같거나, 공백 문자와 일치시키는 \s와 같은 정규식 패턴과 반대됩니다. ECMAScript 규격 동작을 지정한 경우 \S는 [^ \f\n\r\t\v]와 같습니다.
pl: Element \S pasuje do dowolnego znaku innego niż biały znak. Jest to równoważnik wzorca wyrażenia regularnego [^\f\n\r\t\v\x85\p{Z}] lub odwrotność wzorca wyrażenia regularnego \s, który pasuje do białych znaków. Jeśli zostało określone zachowanie zgodne ze standardem ECMAScript, element \S jest równoważny elementowi [^ \f\n\r\t\v].
pt_br: \S corresponde a qualquer caractere que não seja um espaço em branco. Ele equivale ao padrão de expressão regular [^\f\n\r\t\v\x85\p{Z}] ou ao oposto do padrão de expressão regular equivalente a \s, que corresponde a caracteres de espaço em branco. Se o comportamento em conformidade com o ECMAScript for especificado, \S será equivalente a [^ \f\n\r\t\v]
ru: \S соответствует любому символу, не являющемуся пробелом. Это эквивалент шаблона регулярного выражения [^\f\n\r\t\v\x85\p{Z}] либо противоположность шаблона регулярного выражения, эквивалентного \s, который сопоставляет символы пробелов. Если указано поведение, соответствующее ECMAScript, \S является эквивалентом [^ \f\n\r\t\v]
tr: \S boşluk olmayan herhangi bir karakter ile eşleşir. [^\f\n\r\t\v\x85\p{Z}] normal ifade deseniyle eşdeğerdir veya boşluk karakterleriyle eşleşen \s ile eşdeğer olan normal ifade deseninin tersidir. ECMAScript uyumlu davranış belirtilmişse \S, [^ \f\n\r\t\v] ile eşdeğerdir
zh_hans: \S 与任何非空格字符匹配。它等效于 [^\f\n\r\t\v\x85\p{Z}] 正则表达式模式，或与等效于 \s 的正则表达式模式(与空格字符匹配)的相反形式。 如果指定了符合 ECMAScript 的行为，则 \s 等效于 [^ \f\n\r\t\v]
zh_hant: \S 符合所有非空白字元的字元。其等同於 [^\f\n\r\t\v\x85\p{Z}] 規則運算式模式，或相當於 \s 之規則運算式模式的相反，其符合空白字元的字元。 如果有指定符合 ECMAScript 規範的行為，則 \S 相當於 [^ \f\n\r\t\v]

# Regex_non_white_space_character_short
source: non-white-space character
cs: neprázdný znak
de: Nicht-Leerraumzeichen
es: carácter que no es un espacio en blanco
fr: caractère autre qu'un espace blanc
it: carattere diverso da uno spazio vuoto
ja: 空白以外の文字
ko: 공백이 아닌 문자
pl: znak inny niż biały
pt_br: caractere que não é de espaço em branco
ru: символ, не являющийся пробелом
tr: boşluk olmayan karakter
zh_hans: 非空格字符
zh_hant: 非空白字元

# Regex_non_word_boundary_long
source: The \B anchor specifies that the match must not occur on a word boundary. It is the opposite of the \b anchor.
cs: Ukotvení \B určuje, že shoda se nesmí vyskytovat na hranici slova. Jedná se o opak ukotvení \b.
de: Der \B-Anker gibt an, dass die Übereinstimmung nicht an einer Wortgrenze auftreten darf. Dies ist das Gegenteil vom \b-Anker.
es: El delimitador \B especifica que la coincidencia no se debe producir en un límite de palabras. Es el opuesto del delimitador \b.
fr: L'ancre \B spécifie que la correspondance ne doit pas être effectuée sur une limite de mot. Il s'agit du contraire de l'ancre \b.
it: L'ancoraggio \B specifica che la corrispondenza non deve verificarsi in un confine di parola. Si tratta dell'effetto contrario rispetto all'ancoraggio \b.
ja: \B アンカーは、ワード境界では一致しないことを指定します。これは、\b アンカーと逆の働きをします。
ko: \B 앵커는 단어 경계에서 일치 항목을 찾도록 지정합니다. \b 앵커와 반대입니다.
pl: Kotwica \B określa, że dopasowanie nie może nastąpić na granicy słowa. Jest to przeciwieństwo kotwicy \b.
pt_br: A âncora \B especifica que a correspondência não pode ocorrer em um limite de palavra. Ela é o oposto da âncora \b.
ru: Привязка \B указывает, что соответствие не должно находиться на границе слов. Это противоположность привязки \b.
tr: \B yer işareti, eşleşmenin bir sözcük sınırında oluşmaması gerektiğini belirtir. Bu işaret, \b yer işaretinin tersidir.
zh_hans: \B 定位点指定匹配不得出现在字边界上。它与 \b 定位点相反。
zh_hant: \B 錨點會指定比對不得出現在字邊界。其為 \b 錨點的相反。

# Regex_non_word_boundary_short
source: non-word boundary
cs: mimo hranici slova
de: Nicht-Wortgrenze
es: límite que no es una palabra
fr: limite de non-mot
it: carattere che non costituisce un confine di parola
ja: ワード境界以外
ko: 단어가 아닌 경계
pl: granica inna niż słowa
pt_br: limite que não é de palavra
ru: граница не по словам
tr: sözcük olmayan sınır
zh_hans: 非字边界
zh_hant: 非字邊界
