Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_atomic_group_long
source: Atomic groups (known in some other regular expression engines as a nonbacktracking subexpression, an atomic subexpression, or a once-only subexpression) disable backtracking. The regular expression engine will match as many characters in the input string as it can. When no further match is possible, it will not backtrack to attempt alternate pattern matches. (That is, the subexpression matches only strings that would be matched by the subexpression alone; it does not attempt to match a string based on the subexpression and any subexpressions that follow it.) This option is recommended if you know that backtracking will not succeed. Preventing the regular expression engine from performing unnecessary searching improves performance.
cs: Atomové skupiny (označované v některých jiných modulech regulárních výrazů jako podvýrazy bez zpětného vyhledávání, atomické podvýrazy nebo jednorázové podvýrazy) zakazují zpětné vyhledávání. Modul regulárních výrazů najde shodu s co nejvíce znaky ve vstupním řetězci. Pokud se žádná další shoda nenajde, neprovede se zpětné vyhledávání za účelem pokusu o porovnávání alternativního vzoru. (To znamená, že dílčí výraz najde shodu jenom s řetězci, které by odpovídaly samotnému dílčímu výrazu. Nepokusí se porovnávat řetězec na základě dílčího výrazu a jakýchkoli dílčích výrazů, které následují.) Tato možnost se doporučuje, pokud víte, že zpětné vyhledávání nepovede k úspěchu. Když zabráníte, aby modul regulárních výrazů prováděl zbytečná hledání, zlepší se výkon.
de: Die Rückverfolgung wird durch atomische Gruppen deaktiviert (in anderen Engines für reguläre Ausdrücke als Teilausdruck ohne Rückverfolgung, atomischer Teilausdruck oder Teilausdruck mit einmaligem Abgleich bezeichnet). Die Engine für reguläre Ausdrücke gleicht so viele Zeichen in der Eingabezeichenfolge wie möglich ab. Wenn kein weiterer Abgleich möglich ist, wird keine Rückverfolgung durchgeführt, um alternative Musterabgleiche zu versuchen. (Das heißt, der Teilausdruck stimmt nur mit Zeichenfolgen überein, die dem Teilausdruck allein entsprechen; es wird nicht versucht, eine Zeichenfolge basierend auf dem Teilausdruck und allen nachfolgenden Teilausdrücken abzugleichen.) Diese Option empfiehlt sich, wenn Sie wissen, dass die Rückverfolgung nicht zum Erfolg führt. Indem Sie die Ausführung unnötiger Suchvorgänge durch die Engine für reguläre Ausdrücke verhindern, erzielen Sie eine verbesserte Leistung.
es: Los grupos atómicos (conocidos en algunos otros motores de expresiones regulares como subexpresión sin vuelta atrás, subexpresión atómica o subexpresión de una sola vez) deshabilitan la vuelta atrás. El motor de expresiones regulares coincidirá con tantos caracteres de la cadena de entrada como pueda. Cuando no sean posibles más coincidencias, no volverá atrás para intentar coincidencias de patrones alternativas. (Es decir, la subexpresión coincide únicamente con las cadenas que coincidan solo con la subexpresión; no intenta buscar coincidencias con una cadena en función de la subexpresión y de todas las subexpresiones que la sigan). Se recomienda esta opción si sabe que la vuelta atrás no será correcta. Evitar que el motor de expresiones regulares realice búsquedas innecesarias mejora el rendimiento.
fr: Les groupes atomiques (connus dans certains moteurs d'expressions régulières comme des sous-expressions sans retour sur trace, des sous-expressions atomiques ou des sous-expressions une fois uniquement) désactivent le retour sur trace. Le moteur d'expressions régulières recherche une correspondance avec autant de caractères que possible dans la chaîne d'entrée. Quand aucune autre correspondance n'est possible, il n'effectue pas de retour sur trace pour tenter de trouver d'autres correspondances de modèles. (En d'autres termes, la sous-expression correspond uniquement aux chaînes qui correspondent à la sous-expression seule, elle ne tente pas de rechercher une chaîne basée sur la sous-expression et les sous-expressions qui la suivent.) Cette option est recommandée si vous savez que le retour sur trace va être un échec. En empêchant le moteur d'expressions régulières d'effectuer des recherches inutiles, vous améliorez les performances.
it: I gruppi atomici (noti in alcuni motori delle espressioni regolari come sottoespressione di non backtracking, sottoespressione atomica o sottoespressione once-only) disabilitano il backtracking. Il motore delle espressioni regolari troverà la corrispondenza con il numero massimo possibile di caratteri nella stringa di input. Quando non sarà più possibile trovare altre corrispondenze, non eseguirà il backtracking per trovare corrispondenze alternative con i criteri. Viene quindi trovata la corrispondenza della sottoespressione solo con stringhe corrispondenti esclusivamente alla sottoespressione; non viene effettuato alcun tentativo per trovare la corrispondenza per una stringa in base alla sottoespressione e a qualsiasi sottoespressione successiva. Questa opzione è consigliata solo se si è certi che il backtracking avrà esito negativo. Impedendo al motore delle espressioni regolari di eseguire ricerche non necessarie è possibile notare un miglioramento delle prestazioni.
ja: アトミック グループ (バックトラッキングしない部分式、アトミック部分式、1 回のみの部分式などの他のいくつかの正規表現エンジンで認識される) はバックトラッキングを無効にします。正規表現エンジンは、入力文字列内のできるだけ多くの文字と一致します。一致する文字列が見つからなくなっても、バックトラッキングして代替パターン一致を試みることはありません。(つまり、部分式はその部分式単体と一致する文字列のみと一致します。部分式とその後続の部分式に基づく文字列の一致は試行しません。) バックトラッキングが成功しないことがわかっている場合は、このオプションを使用することをお勧めします。正規表現エンジンで不要な検索が実行されないようにすることで、パフォーマンスが向上します。
ko: 원자성 그룹(다른 정규식 엔진에서 역추적하지 않는 하위 식, 원자성 하위 식 또는 한 번만 하위 식이라고 함)은 역추적을 사용하지 않도록 설정합니다. 정규식 엔진은 입력 문자열에서 가능한 한 많은 문자와 일치시킵니다. 더 이상 일치 항목을 찾을 수 없으면 대체 패턴 일치 항목 찾기를 시도하도록 역추적하지 않습니다. 즉, 하위 식은 해당 하위 식 단독으로 일치되는 문자열만 일치시킵니다. 해당 하위 식과 그 뒤에 오는 하위 식을 기반으로 문자열을 일치시키지 않습니다. 이 옵션은 역추적이 성공하지 못할 것을 알고 있는 경우에 사용하는 것이 좋습니다. 정규식 엔진이 불필요한 검색을 수행하지 않도록 하면 성능이 향상됩니다.
pl: Grupy atomowe (określane w niektórych innych aparatach wyrażeń regularnych jako podwyrażenie bez cofania się, podwyrażenie niepodzielne lub podwyrażenie używane tylko raz) wyłączają cofanie się. Aparat wyrażeń regularnych dopasuje tyle znaków w ciągu wejściowym, ile to możliwe. Jeśli dalsze dopasowywanie nie będzie możliwe, nie nastąpi cofnięcie się w celu wypróbowania dopasowania alternatywnych wzorców. (Oznacza to, że podwyrażenie będzie dopasowywane tylko do ciągów, które zostałyby dopasowane przez samo podwyrażenie; nie jest podejmowana próba dopasowania ciągu na podstawie podwyrażenia i wszelkich podwyrażeń następujących po nim). Ta opcja jest zalecana, jeśli wiesz, że cofanie się nie powiedzie się. Zapobiega ona wykonywaniu niepotrzebnego przeszukiwania przez aparat wyrażeń regularnych, co poprawia wydajność.
pt_br: Grupos atômicos (conhecidos em alguns outros mecanismos de expressão regulares como uma subexpressão sem rastreamento inverso, uma subexpressão atômica ou uma subexpressão de apenas uma vez) desabilita o rastreamento inverso. O mecanismo de expressão regular corresponderá o máximo possível de caracteres em uma cadeia de caracteres de entrada possível. Quando não for mais possível corresponder, ele não fará o rastreamento inverso para tentar alternar as correspondências de padrão. (Ou seja, a subexpressão corresponderá somente às cadeias de caracteres que seriam correspondidas pela subexpressão sozinha. Ela não tentará corresponder a uma cadeia de caracteres com base na subexpressão e nas subexpressões seguintes.) Essa opção é recomendada quando você sabe que o rastreamento inverso não será bem-sucedido. Impedir o mecanismo de expressão regular de executar pesquisas desnecessárias melhora o desempenho.
ru: Атомарные группы (которые в некоторых других модулях обработки регулярных выражений также называются частями выражения без обратного отслеживания, атомарными частями выражения или частями выражения, сопоставляемыми один раз) отключают обратное отслеживание. Обработчик регулярных выражений будет сопоставлять максимально возможное число символов во входной строке. Если дальнейшее сопоставление невозможно, он не будет выполнять обратное отслеживание, чтобы попытаться определить альтернативные совпадения шаблона. (Таким образом, часть выражения соответствует только тем строкам, которые соответствовали бы ей одной; она не пытается сопоставить строку на основе части выражения и любых следующих за ней частей выражения.) Этот параметр рекомендуется использовать, если известно, что обратное отслеживание не даст результата. Запрет выполнять ненужный поиск для обработчика регулярных выражений улучшает производительность.
tr: Atomik gruplar (diğer bazı normal ifade altyapılarında geri izlemesiz alt ifade, atomik alt ifade veya tek seferlik alt ifade olarak da bilinir) geri izlemeyi devre dışı bırakır. Normal ifade altyapısı, giriş dizesindeki mümkün olduğunca çok sayıda karakterle eşleşir. Başka bir eşleşme mümkün olmadığında, diğer desen eşleşmelerini denemek için geri izleme işlemi yapmaz. (Yani alt ifade yalnızca alt ifade tarafından eşleşen dizelerle eşleşir; alt ifadeyi ve kendisini izleyen alt ifadeleri temel alan bir dizeyle eşleştirmeyi denemez.) Bu seçenek, geri izlemenin başarısız olacağını biliyorsanız önerilir. Normal ifade altyapısının gereksiz arama gerçekleştirmesini önlemek performansı artırır.
zh_hans: 原子组(在其他一些正则表达式引擎中称为非回溯子表达式、原子子表达式或一次性子表达式)禁用回溯。正则表达式引擎将匹配输入字符串中的多个字符。当无进一步的匹配时，它将不回溯以尝试匹配备用模式。(也就是说，子表达式只匹配那些将单独由子表达式匹配的字符串；它不会尝试根据子表达式和其后的任何子表达式匹配字符串。) 如果你知道回溯不会成功，建议使用此选项。防止正则表达式引擎执行不必要的搜索可提高性能。
zh_hant: 不可部分完成的群組 (在其他一些規則運算式引擎中，又稱為非回溯子運算式、不可部分完成的子運算式，或單次性子運算式) 會停用回溯。規則運算式引擎會盡可能地比對輸入字串中的字元。當無法再繼續比對時，不會再回溯嘗試比對替代樣式 (亦即，子運算式只會比對子運算式所要比對的字串，而不會嘗試比對子運算式中或其接續之任何子運算式中的字串)。 若已知不會繼續執行回溯，建議您使用此選項。禁止規則運算式引擎執行不必要的搜尋，將有助於提升效能。

# Regex_atomic_group_short
source: atomic group
cs: atomová skupina
de: atomische Gruppe
es: grupo atómico
fr: groupe atomique
it: gruppo atomico
ja: アトミック グループ
ko: 원자성 그룹
pl: grupa atomowa
pt_br: grupo atômico
ru: атомарная группа
tr: atomik grup
zh_hans: 原子组
zh_hant: 不可部分完成的群組

# Regex_backspace_character_long
source: Matches a backspace character, \u0008
cs: Shoda se znakem Backspace \u0008
de: Entspricht einem Rückschrittzeichen, \u0008.
es: Coincide con un carácter de retroceso, \u0008
fr: Correspond au caractère de retour arrière, \u0008
it: Trova la corrispondenza di un carattere backspace \u0008
ja: バックスペース文字 \u0008 に一致します
ko: 백스페이스 문자 \u0008과 일치시킵니다.
pl: Pasuje do znaku backspace — \u0008
pt_br: Corresponde a um caractere de backspace, \u0008
ru: Соответствует символу возврата \u0008
tr: Bir geri al karakteriyle (\u0008) eşleşir
zh_hans: 与退格键字符(\u0008)匹配
zh_hant: 比對退格鍵字元 \u0008

# Regex_backspace_character_short
source: backspace character
cs: znak Backspace
de: Rückschrittzeichen
es: carácter de retroceso
fr: caractère de retour arrière
it: carattere backspace
ja: バックスペース文字
ko: 백스페이스 문자
pl: znak backspace
pt_br: caractere de backspace
ru: символ возврата
tr: geri al karakteri
zh_hans: 退格键字符
zh_hant: 退格鍵字元
