Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_match_zero_or_one_time_long
source: The ? quantifier matches the preceding element zero or one time. It is equivalent to the {0,1} quantifier. ? is a greedy quantifier whose lazy equivalent is ??.
cs: Kvantifikátor ? najde shodu předchozího elementu 0krát nebo 1krát. Jedná se o ekvivalent kvantifikátoru {0,1}. ? je hladový kvantifikátor, jehož líným ekvivalentem je ??.
de: Der Quantifizierer "?" stimmt mit dem vorhergehenden Element null- oder einmal überein. Dieser Quantifizierer ist identisch mit "{0,1}". "?" ist ein gieriger Quantifizierer, dessen träges Äquivalent "??" lautet.
es: El cuantificador ? coincide con el elemento anterior cero veces o una. Es equivalente al cuantificador {0,1}. ? es un cuantificador expansivo cuyo equivalente diferido es ??.
fr: Le quantificateur ? recherche une correspondance avec l'élément précédent, zéro ou une fois. Il est équivalent au quantificateur {0,1}. ? est un quantificateur gourmand dont l'équivalent paresseux est ??.
it: Il quantificatore ? trova la corrispondenza con l'elemento precedente zero o una volta. Equivale al quantificatore {0,1}. ? è un quantificatore greedy il cui equivalente lazy è ??.
ja: ? 量指定子は、直前の要素の 0 回または 1 回の繰り返しに一致します。これは {0,1} 量指定子と同じです。? は最長一致の量指定子であり、最短一致でこれに対応するのは ?? です。
ko: ? 수량자는 0번 이상 이전 요소와 일치시킵니다. {0,1} 수량자와 같습니다. ?는 해당 게으른 수량자가 ??인 탐욕적 수량자입니다.
pl: Kwantyfikator ? dopasowuje poprzedzający element zero razy lub jeden raz. Jest to równoważnik kwantyfikatora {0,1}. Kwantyfikator ? jest zachłanny, a jego powściągliwy równoważnik to ??.
pt_br: O quantificador ? corresponde ao elemento precedente zero ou uma vez. Ele equivale ao quantificador {0,1}. ? é um quantificador greedy cujo equivalente lento é ??.
ru: Квантификатор ? соответствует предыдущему элементу ни одного раза или один раз. Это эквивалент квантификатора {0,1}. ? — это "жадный" квантификатор, "ленивым" аналогом которого является ??.
tr: ? niceleyicisi bir önceki öğeyle sıfır veya bir kez eşleşir. {0,1} niceleyicisi ile eşdeğerdir. ?, gecikmeli karşılığı ?? olan bir hızlı niceleyicidir.
zh_hans: ? 限定符匹配前面的元素零次或一次。它等效于 {0,1} 限定符。? 是贪婪限定符，其惰性等效项为 ??。
zh_hant: ? 數量詞會比對前置元素零或一次，相當於 {0,1} 數量詞。? 是窮盡數量詞，其少數優先的相對概念為 ??。

# Regex_match_zero_or_one_time_short
source: match zero or one time
cs: shoda 0krát nebo 1krát
de: Null- oder einmalige Übereinstimmung
es: coincidir cero veces o una vez
fr: rechercher une correspondance zéro ou une fois
it: trova la corrispondenza zero o una volta
ja: 0 回または 1 回一致
ko: 0 또는 1번 일치
pl: dopasuj zero razy lub jeden raz
pt_br: corresponder nenhuma ou uma vez
ru: совпадение ни одного раза или один раз
tr: sıfır veya bir kez eşleş
zh_hans: 匹配零次或一次
zh_hant: 比對零或一次

# Regex_matched_subexpression_long
source: This grouping construct captures a matched 'subexpression', where 'subexpression' is any valid regular expression pattern. Captures that use parentheses are numbered automatically from left to right based on the order of the opening parentheses in the regular expression, starting from one. The capture that is numbered zero is the text matched by the entire regular expression pattern.
cs: Tento seskupovací konstruktor zachytává porovnávaný dílčí výraz, kde dílčí výraz je libovolný platný vzor regulárního výrazu. Zachycení, která používají závorky, jsou automaticky číslována zleva doprava podle pořadí otevíracích závorek v regulárním výrazu, počínaje od hodnoty jedna. Zachycení s číslem nula je text odpovídající celému vzoru regulárního výrazu.
de: Dieses Gruppierungskonstrukt erfasst einen übereinstimmenden "Teilausdruck", wobei "Teilausdruck" für ein beliebiges gültiges Muster für reguläre Ausdrücke steht. Erfassungen, die Klammern verwenden, werden basierend auf der Reihenfolge der öffnenden Klammern im regulären Ausdruck beginnend bei 1 automatisch von links nach rechts nummeriert. Bei der Erfassung mit der Nummerierung 0 handelt es sich um den Text, der mit dem gesamten Muster für reguläre Ausdrücke übereinstimmt.
es: Esta construcción de agrupación captura una "subexpresión" coincidente, donde "subexpresión" es cualquier patrón de expresión regular válido. Las capturas que usan paréntesis se numeran automáticamente de izquierda a derecha según el orden de los paréntesis de apertura en la expresión regular, a partir de uno. La captura con número cero es el texto coincidente con el patrón de expresión regular completo.
fr: Cette construction de regroupement capture une 'sous-expression' correspondante, où 'sous-expression' représente un modèle d'expression régulière valide. Les captures qui utilisent des parenthèses sont numérotées automatiquement de gauche à droite en fonction de l'ordre des parenthèses ouvrantes dans l'expression régulière, à partir de l'une d'entre elles. La capture numérotée zéro représente le texte correspondant à l'intégralité du modèle d'expression régulière.
it: Questo costrutto di raggruppamento acquisisce una 'subexpression' corrispondente, in cui 'subexpression' è qualsiasi criterio di ricerca di espressioni regolari valido. Le acquisizioni che usano parentesi sono numerate automaticamente da sinistra verso destra in base all'ordine delle parentesi di apertura nell'espressione regolare, a partire da uno. L'acquisizione che viene numerata zero è il testo corrispondente all'intero criterio di ricerca di espressioni regolari.
ja: このグループ化構成体は、一致した 'subexpression' をキャプチャします。ここで、'subexpression' は任意の有効な正規表現パターンです。かっこを使用するキャプチャでは、正規表現の左かっこの順序に従って、左から右へ自動的に 1 から番号が付けられます。番号が 0 のキャプチャは、正規表現パターン全体に一致するテキストです。
ko: 이 그룹화 생성자는 일치하는 'subexpression'을 캡처합니다. 여기서, 'subexpression'은 임의의 유효한 정규식 패턴입니다. 괄호를 사용하는 캡처는 정규식의 여는 괄호 순서를 기준으로 왼쪽에서 오른쪽으로 1부터 자동으로 번호가 매겨집니다. 0으로 번호가 매겨진 캡처는 전체 정규식 패턴과 일치하는 텍스트입니다.
pl: Ta konstrukcja grupująca przechwytuje dopasowane „podwyrażenie”, gdzie „podwyrażenie” to dowolny prawidłowy wzorzec wyrażenia regularnego. Przechwycenia używające nawiasów są numerowane automatycznie od lewej do prawej na podstawie kolejności nawiasów otwierających w wyrażeniu regularnym, rozpoczynając od numeru jeden. Przechwycenie o numerze zero to tekst dopasowany przez cały wzorzec wyrażenia regularnego.
pt_br: Este constructo de agrupamento captura uma 'subexpression' correspondente, em que 'subexpression' é qualquer padrão de expressão regular válido. As capturas que usam parênteses são numeradas automaticamente da esquerda para a direita com base na ordem dos parênteses de abertura na expressão regular, começando com um. A captura numerada como zero é o texto correspondente ao padrão de expressão regular inteiro.
ru: Эта конструкция группировки записывает соответствующую "часть выражения", где "часть выражения" — это любой допустимый шаблон регулярного выражения. Записи, использующие круглые скобки, нумеруются автоматически слева направо в порядке открывающих скобок в регулярном выражении, начиная с первой. Запись с нулевым номером — это текст, совпадающий со всем шаблоном регулярного выражения.
tr: Bu gruplandırma yapısı, 'subexpression' öğesinin herhangi bir geçerli normal ifade deseni olduğu eşleşen bir 'subexpression' yakalar. Parantez kullanan yakalamalar, normal ifadedeki açma parantezlerinin sırasına göre soldan sağa birden başlayarak otomatik numaralandırılır. Sıfır olarak numaralandırılan yakalama, normal ifade deseninin tamamı tarafından eşleşen metindir.
zh_hans: 此分组构造捕获匹配的 "subexpression"，其中 "subexpression" 是任何有效的正则表达式模式。使用括号的捕获将根据正则表达式中左括号的顺序从 1 开始按从左到右的顺序自动编号。被编号为零的捕获是由整个正则表达式模式匹配的文本。
zh_hant: 這個分組建構會擷取相符的 'subexpression'，其中 'subexpression' 是任何有效的規則運算式模式。使用了括弧的擷取會自動根據規則運算式中的左括弧順序，從第一個開始從左到右加上編號。編號為零的擷取，是與整個規則運算式模式相符的文字。

# Regex_matched_subexpression_short
source: matched subexpression
cs: porovnávaný dílčí výraz
de: Übereinstimmender Teilausdruck
es: subexpresión coincidente
fr: sous-expression correspondante
it: sottoespressione corrispondente
ja: 一致した部分式
ko: 일치하는 하위 식
pl: dopasowane podwyrażenie
pt_br: subexpressão correspondente
ru: соответствующая часть выражения
tr: eşleşen alt ifade
zh_hans: 匹配的子表达式
zh_hant: 相符的子運算式

# Regex_name
source: name
cs: název
es: nombre
fr: nom
it: nome
ja: 名前
ko: 이름
pl: nazwa
pt_br: nome
ru: имя
tr: ad
zh_hans: 名称
zh_hant: 名稱

# Regex_name_or_number
source: name-or-number
cs: název nebo číslo
es: nombre o número
fr: nom-ou-numéro
it: nome o numero
ja: 名前付きまたは番号付き
ko: 이름 또는 번호
pl: nazwa lub numer
pt_br: nome ou número
ru: имя-или-число
tr: ad veya sayı
zh_hans: 名称或数字
zh_hant: 名稱或數目

# Regex_named_backreference_long
source: A named or numbered backreference. 'name' is the name of a capturing group defined in the regular expression pattern.
cs: Pojmenovaná nebo číslovaná zpětná reference. Název představuje název zachycující skupiny definované ve vzoru regulárního výrazu.
de: Ein benannter oder nummerierter Rückverweis. "Name" ist der Name einer Erfassungsgruppe, die im Muster für reguläre Ausdrücke definiert ist.
es: Una referencia inversa con nombre o numerada. "name" es el nombre de un grupo de captura definido en el patrón de expresión regular.
fr: Référence arrière nommée ou numérotée. 'nom' est le nom d'un groupe de capture défini dans le modèle d'expression régulière.
it: Backreference denominato o numerato. 'name' è il nome di un gruppo di acquisizione definito nel criterio di ricerca di espressioni regolari.
ja: 名前付きまたは番号付きの前方参照。 'name' は、正規表現パターンで定義されているキャプチャ グループの名前です。
ko: 명명되거나 번호가 매겨진 역참조입니다. 'name'은 정규식 패턴에 정의된 캡처링 그룹의 이름입니다.
pl: Nazwane lub numerowane odwołanie wsteczne. „Nazwa” to nazwa grupy przechwytującej zdefiniowanej we wzorcu wyrażenia regularnego.
pt_br: Uma referência inversa nomeada ou numerada. 'name' é o nome de um grupo de captura definido no padrão de expressão regular.
ru: Именованная или нумерованная обратная ссылка. Значение "имя" — это имя группы записи, определенное в шаблоне регулярного выражения.
tr: Adlandırılmış veya numaralandırılmış bir geri başvuru. 'name', normal ifade deseninde tanımlanan yakalama grubunun adıdır.
zh_hans: 已命名或已编号的向后引用。 "name" 是在正则表达式模式中定义的捕获组的名称。
zh_hant: 具名或編號反向參考。 'name' 是定義於規則運算式模式內的擷取群組名稱。

# Regex_named_backreference_short
source: named backreference
cs: pojmenovaná zpětná reference
de: Benannter Rückverweis
es: referencia inversa con nombre
fr: référence arrière nommée
it: backreference denominato
ja: 名前付き前方参照
ko: 명명된 역참조
pl: nazwane odwołanie wsteczne
pt_br: referência inversa nomeada
ru: именованная обратная ссылка
tr: adlandırılmış geri başvuru
zh_hans: 已命名的向后引用
zh_hant: 具名反向參考

# Regex_named_matched_subexpression_long
source: Captures a matched subexpression and lets you access it by name or by number. 'name' is a valid group name, and 'subexpression' is any valid regular expression pattern. 'name' must not contain any punctuation characters and cannot begin with a number. If the RegexOptions parameter of a regular expression pattern matching method includes the RegexOptions.ExplicitCapture flag, or if the n option is applied to this subexpression, the only way to capture a subexpression is to explicitly name capturing groups.
cs: Zachytává porovnávaný dílčí výraz a umožňuje k němu přístup pomocí názvu nebo čísla. Název je platný název skupiny a dílčí výraz je libovolný platný vzor regulárního výrazu. Název nesmí obsahovat znaky interpunkce a nesmí začínat číslicí. Pokud parametr RegexOptions metody odpovídající vzoru regulárního výrazu obsahuje příznak RegexOptions.ExplicitCapture nebo pokud je u daného dílčího výrazu použitá možnost n, je jediným způsobem, jak zachytit dílčí výraz, explicitní pojmenování zachycujících skupin.
de: Erfasst einen übereinstimmenden Teilausdruck und ermöglicht Ihnen den Zugriff darauf anhand des Namens oder der Nummer. "Name" ist ein gültiger Gruppenname, und "Teilausdruck" ist ein gültiges Muster für reguläre Ausdrücke. "Name" darf keine Satzzeichen enthalten und nicht mit einer Zahl beginnen. Wenn der RegexOptions-Parameter einer Methode zum Abgleich von Mustern für reguläre Ausdrücke das Flag "RegexOptions.ExplicitCapture" enthält oder wenn die Option "n" auf diesen Teilausdruck angewendet wird, besteht die einzige Möglichkeit zum Erfassen eines Unterausdrucks darin, die Erfassungsgruppen explizit zu benennen.
es: Captura una subexpresión coincidente y le permite acceder a ella por el nombre o el número. "name" es un nombre de grupo válido y "subexpression" es cualquier patrón de expresión regular válido. "name" no debe contener ningún carácter de puntuación y no puede comenzar con un número. Si el parámetro RegexOptions de un método de coincidencia de patrones de expresión regular incluye la marca RegexOptions.ExplicitCapture, o si la opción n se aplica a esta subexpresión, la única forma de capturar una subexpresión consiste en asignar un nombre explícito a los grupos de captura.
fr: Capture une sous-expression correspondante et vous permet d'y accéder par le nom ou le numéro. 'nom' est un nom de groupe valide, et 'sous-expression' est un modèle d'expression régulière valide. 'nom' ne doit contenir aucun caractère de ponctuation et ne peut pas commencer par un chiffre. Si le paramètre RegexOptions d'une méthode de critères spéciaux d'expression régulière inclut l'indicateur RegexOptions.ExplicitCapture, ou si l'option n est appliquée à cette sous-expression, le seul moyen de capturer une sous-expression est de nommer explicitement les groupes de capture.
it: Acquisisce una sottoespressione corrispondente e consente di accedervi tramite nome o numero. 'name' è un nome di gruppo valido e 'subexpression' è un qualsiasi criterio di ricerca di espressioni regolari valido. 'name' non deve contenere alcun simbolo di punteggiatura e non può iniziare con un numero. Se il parametro RegexOptions di un criterio di ricerca di espressioni regolari include il flag RegexOptions.ExplicitCapture o se l'opzione n viene applicata a questa sottoespressione, l'unico modo per acquisire una sottoespressione consiste nell'assegnare esplicitamente un nome ai gruppi di acquisizione.
ja: 一致した部分式をキャプチャし、名前または数字でアクセスできるようにします。 'name' は有効なグループ名であり、'subexpression' は有効な正規表現パターンです。'name' は、句読点文字を含めることができません。また、先頭を数字にすることもできません。 正規表現パターン マッチング メソッドの RegexOptions パラメーターに RegexOptions.ExplicitCapture フラグが含まれている場合や、n オプションがこの部分式に適用されている場合、部分式をキャプチャする唯一の方法は、キャプチャ グループを明示的に指定することです。
ko: 일치하는 하위 식을 캡처하고 이름 또는 번호를 통해 해당 하위 식에 액세스할 수 있도록 허용합니다. 'name'은 유효한 그룹 이름이고 'subexpression'은 유효한 정규식 패턴입니다. 'name'은 문장 부호 문자를 사용하지 않아야 하며 숫자로 시작할 수 없습니다. 정규식 패턴 일치 메서드의 RegexOptions 매개 변수에 RegexOptions.ExplicitCapture 플래그가 포함되어 있거나 이 하위 식에 n 옵션이 적용되는 경우 하위 식을 캡처하는 유일한 방법은 명시적으로 캡처링 그룹 이름을 지정하는 것입니다.
pl: Przechwytuje dopasowane podwyrażenie i umożliwia dostęp do niego za pomocą nazwy lub numeru. Element „nazwa” to prawidłowa nazwa grupy, a element „podwyrażenie” to dowolny prawidłowy wzorzec wyrażenia regularnego. Element „nazwa” nie może zawierać żadnych znaków interpunkcyjnych i nie może zaczynać się od cyfry. Jeśli parametr RegexOptions metody dopasowywania wzorca wyrażenia regularnego zawiera flagę RegexOptions.ExplicitCapture lub jeśli dla tego wyrażenia zastosowano opcję n, jedynym sposobem przechwycenia podwyrażenia jest jawne nazwanie grup przechwytujących.
pt_br: Captura uma subexpressão correspondida e permite que você a acesse por nome ou número. 'name' é um nome de grupo válido e 'subexpression' é qualquer padrão de expressão regular válido. 'name' não pode conter nenhum caractere de pontuação e não pode começar com um número. Se o parâmetro RegexOptions de um método de correspondência de padrões de expressão regular incluir o sinalizador RegexOptions.ExplicitCapture ou se a opção n for aplicada a essa subexpressão, a única maneira de capturar uma subexpressão será nomear explicitamente os grupos de captura.
ru: Записывает совпадающую часть выражения и позволяет вам обратиться к ней по имени или номеру. Значение "имя" — это допустимое имя группы, а "часть выражения" — любой допустимый шаблон регулярного выражения. Значение "имя" не должно содержать знаков пунктуации или начинаться с числа. Если параметр RegexOptions метода сопоставления шаблона регулярного выражения включает флаг RegexOptions.ExplicitCapture или если параметр n применяется к этой части выражения, единственным способом записи части выражения является явное именование групп записи.
tr: Eşleşen bir alt ifadeyi yakalar ve bu alt ifadeye ada veya numaraya göre erişmenizi sağlar. 'name' geçerli bir grup adı ve 'subexpression' herhangi bir geçerli normal ifade desenidir. 'name', hiçbir noktalama karakteri içermemelidir ve bir sayı ile başlayamaz. Normal ifade deseni eşleştirme yönteminin RegexOptions parametresi RegexOptions.ExplicitCapture bayrağını içeriyorsa veya n seçeneği bu alt ifadeye uygulanıyorsa, bir alt ifadeyi yakalamanın tek yolu yakalama gruplarını açıkça adlandırmaktır.
zh_hans: 捕获匹配的子表达式，以便按名称或按编号进行访问。 "name" 是有效的组名，而 "subexpression" 是任何有效的正则表达式模式。"name" 不得包含任何标点符号字符且不能以数字开头。 如果正则表达式模式匹配方法的 RegexOptions 参数包括 RegexOptions ExplicitCapture 标志，或者如果将 n 选项应用于此子表达式，则捕获子表达式的唯一方法是显式命名捕获组。
zh_hant: 擷取相符的子運算式並讓您根據名稱或數字加以存取。 'name' 應為有效的群組名稱，而 'subexpression' 則可為任何有效的規則運算式模式。'name' 不得包含任何標點符號字元，也不得以數字作為開頭。 如果規則運算式模式比對方法的 RegexOptions 參數包含 RegexOptions.ExplicitCapture 旗標，或 n 選項已套用至此子運算式，則擷取子運算式的唯一方法為明確地命名擷取群組。

# Regex_named_matched_subexpression_short
source: named matched subexpression
cs: pojmenovaný porovnávaný dílčí výraz
de: Benannter übereinstimmender Teilausdruck
es: subexpresión coincidente con nombre
fr: sous-expression correspondante nommée
it: sottoespressione corrispondente denominate
ja: 一致した名前付き部分式
ko: 명명된 일치하는 하위 식
pl: nazwane dopasowane podwyrażenie
pt_br: subexpressão de correspondência nomeada
ru: именованная соответствующая часть выражения
tr: adlandırılmış eşleşen alt ifade
zh_hans: 已命名匹配的子表达式
zh_hant: 具名的相符子運算式

# Regex_negative_character_group_long
source: A negative character group specifies a list of characters that must not appear in an input string for a match to occur. The list of characters are specified individually. Two or more character ranges can be concatenated. For example, to specify the range of decimal digits from "0" through "9", the range of lowercase letters from "a" through "f", and the range of uppercase letters from "A" through "F", use [0-9a-fA-F].
cs: Negativní skupina znaků určuje seznam znaků, které se nesmí vyskytovat ve vstupním řetězci, aby došlo ke shodě. Seznam znaků se zadává jednotlivě. Je možné zřetězit dva nebo více rozsahů znaků. Pokud chcete například zadat rozsah desítkových číslic od 0 do 9, rozsah malých písmen od a do f a rozsah velkých písmen od A do F, použijte [0-9A-fA-F].
de: Eine negative Zeichengruppe gibt eine Liste von Zeichen an, die nicht in einer Eingabezeichenfolge vorkommen dürfen, damit eine Übereinstimmung vorliegt. Die Zeichen in der Liste werden einzeln angegeben. Mehrere Zeichenbereiche können verkettet werden. Um beispielsweise den Bereich der Dezimalstellen von "0" bis "9", den Bereich der Kleinbuchstaben von "a" bis "f" und den Bereich der Großbuchstaben von "A" bis "F" anzugeben, verwenden Sie "[0-9a-fA-F]".
es: Un grupo de caracteres negativos especifica una lista de caracteres que no deben aparecer en una cadena de entrada para que se produzca una correspondencia. La lista de caracteres se especifica individualmente. Se pueden concatenar dos o más intervalos de caracteres. Por ejemplo, para especificar el intervalo de dígitos decimales de "0" a "9", el intervalo de letras minúsculas de "a" a "f" y el intervalo de letras mayúsculas de "A" a "F", utilice [0-9a-fA-F].
fr: Un groupe de caractères négatif spécifie une liste de caractères qui doivent être absents d'une chaîne d'entrée pour produire une correspondance. La liste des caractères est spécifiée individuellement. Vous pouvez concaténer au moins deux plages de caractères. Par exemple, pour spécifier la plage de chiffres décimaux allant de "0" à "9", la plage de lettres minuscules allant de "a" à "f" et la plage de lettres majuscules allant de "A" à "F", utilisez [0-9a-fA-F].
it: Un gruppo di caratteri negativi specifica un elenco di caratteri che non devono essere presenti in una stringa di input per trovare una corrispondenza. L'elenco di caratteri viene specificato singolarmente. Due o più intervalli di caratteri possono essere concatenati. Ad esempio, per specificare l'intervallo di cifre decimali comprese tra "0" e "9", l'intervallo di lettere minuscole comprese tra "a" e "f" e l'intervallo di lettere maiuscole comprese tra "A" e "F", usare [0-9a-fA-F].
ja: 文字グループの否定では、入力文字列に含まれなければ一致と見なされる文字の一覧を指定します。文字の一覧は個別に指定されます。 2 つ以上の文字範囲を連結することができます。たとえば、"0" から "9" の範囲の 10 進数、"a" から "f" の範囲の小文字、"A" から "F" の範囲の大文字を指定するには、[0-9a-fA-F] を使用します。
ko: 부정 문자 그룹은 일치 항목을 찾을 입력 문자열에 표시되지 않아야 하는 문자 목록을 지정합니다. 문자 목록은 개별적으로 지정됩니다. 둘 이상의 문자 범위를 연결할 수 있습니다. 예를 들어 "0"에서 "9"까지의 10진수 범위, "a"에서 "f"까지의 소문자 범위 및 "A"에서 "F"까지의 대문자 범위를 지정하려면 [0-9a-fA-F]를 사용합니다.
pl: Negatywna grupa znaków określa listę znaków, które nie mogą pojawić się w ciągu wejściowym, jeśli ma nastąpić dopasowanie. Znaki na liście są określane pojedynczo. Można połączyć dwa lub więcej zakresów znaków. Na przykład aby określić zakres cyfr dziesiętnych od „0” do „9”, zakres małych liter od „a” do „f” i zakres wielkich liter od „A” do „F”, użyj elementu [0-9A-fA-F].
pt_br: Um grupo de caracteres negativos especifica uma lista de caracteres que não podem aparecer em uma cadeia de caracteres de entrada para que uma correspondência ocorra. A lista de caracteres é especificada individualmente. Dois ou mais intervalos de caracteres podem ser concatenados. Por exemplo, para especificar o intervalo de dígitos decimais de "0" a "9", o intervalo de letras minúsculas de "a" até "f" e o intervalo de letras maiúsculas de "A" até "F", use [0-9a-fA-F].
ru: Отрицательная группа символов указывает список символов, которые не должны присутствовать во входной строке для выполняемой проверки соответствия. Список символов настраивается в индивидуальном порядке. Можно сцепить два или более диапазонов символов. Например, чтобы указать диапазон десятичных цифр от 0 до 9, диапазон строчных букв от a до f и диапазон прописных букв от A до F, используйте [0-9a-fA-F].
tr: Negatif bir karakter grubu, bir eşleştirme oluşması için giriş dizesinde görünmemesi gereken bir karakter listesi belirtir. Karakter listesi tek tek belirtilir. İki veya daha fazla karakter aralığı art arda eklenebilir. Örneğin, "0" ile "9" arasındaki ondalık basamakların aralığını, "a" ile "f" arasında küçük harflerin aralığını ve "A" ile "F" arasında büyük harflerin aralığını belirtmek için [0-9a-fA-F] kullanın.
zh_hans: 负字符组指定不能出现在匹配项的输入字符串中的字符列表。字符列表是单独指定的。 可以连接两个或更多字符范围。例如，若要指定从 "0" 到 "9" 的十进制数字范围、从 "a" 到 "f" 的小写字母范围以及从 "A" 到 "F" 的大写字母范围，请使用 [0-9a-fA-F]。
zh_hant: 負的字元群組會指定不應在輸入字串中出現的字元清單，以使比對可行。字元的清單會受個別指定。 可串連二或多個字元範圍。舉例來說，如果要指定十進位數字的範圍 (從 "0" 到 "9")，則小寫字母的範圍為 "a" 到 "f"，大寫字母的範圍為 "A" 到 "F"，使用 [0-9a-fA-F]。

# Regex_negative_character_group_short
source: negative character group
cs: negativní skupina znaků
de: Negative Zeichengruppe
es: grupo de caracteres negativos
fr: groupe de caractères négatif
it: gruppo di caratteri negativi
ja: 文字グループの否定
ko: 부정 문자 그룹
pl: negatywna grupa znaków
pt_br: grupo de caracteres negativos
ru: отрицательная группа символов
tr: negatif karakter grubu
zh_hans: 负字符组
zh_hant: 負值字元群組
