Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Probable JSON string detected
cs: Zjistil se pravděpodobný řetězec JSON
de: Wahrscheinliche JSON-Zeichenfolge erkannt
es: Cadena JSON probable detectada
it: Rilevata probabile stringa JSON
ja: JSON の可能性のある文字列が検出されました
ko: 가능한 JSON 문자열이 탐지됨
pl: Wykryto prawdopodobnie ciąg JSON
pt_br: Provável cadeia de caracteres JSON detectada
ru: Обнаружена возможная строка JSON
tr: Olası JSON dizesi algılandı
zh_hans: 检测到可能的 JSON 字符串

source: Properties not allowed in an array
cs: Vlastnosti nejsou v poli povolené
de: Nicht zulässige Eigenschaften in einem Array
es: Propiedades no permitidas en una matriz
it: Proprietà non consentite in una matrice
ja: 配列ではプロパティは使用できません
ko: 배열에는 속성을 사용할 수 없습니다.
pl: Właściwości niedozwolone w tablicy
pt_br: Propriedades não permitidas em uma matriz
ru: Свойства не разрешены в массиве
tr: Dizide özelliklere izin verilmiyor
zh_hans: 数组中不允许有属性

source: Property name must be a string
cs: Název vlastnosti musí být řetězec
de: Der Eigenschaftsname muss eine Zeichenfolge sein
es: El nombre de propiedad debe ser una cadena
it: Il nome della proprietà deve essere una stringa
ja: プロパティ名は文字列である必要があります
ko: 속성 이름은 문자열이어야 합니다.
pl: Nazwa właściwości musi być ciągiem
pt_br: O nome da propriedade deve ser uma cadeia de caracteres
ru: Имя свойства должно быть строкой
tr: Özellik adı dize olmalıdır
zh_hans: 属性名称必须为字符串

# Property_name_must_be_followed_by_a_colon
source: Property name must be followed by a ':'
cs: Za názvem vlastnosti musí následovat znak dvojtečky (:)
de: Auf den Eigenschaftennamen muss ein „:“ folgen
es: El nombre de la propiedad debe ir seguido de \":\"
it: Il nome della proprietà deve essere seguito da ':'
ja: プロパティ名の後には ':' を指定する必要があります
ko: 속성 이름 뒤에는 ':'이 있어야 합니다.
pl: Po nazwie właściwości musi następować znak „:”
pt_br: O nome da propriedade deve ser seguido de “:”
ru: После имени свойства должен быть указан символ \":\"
tr: Özellik adından sonra ':' olmalıdır
zh_hans: 属性名称后面必须跟有 \":\"

source: Property reference cannot be updated
cs: Odkaz na vlastnost se nedá aktualizovat.
de: Der Eigenschaftenverweis kann nicht aktualisiert werden.
es: No se puede actualizar la referencia de propiedad
fr: La référence de propriété ne peut pas être mise à jour
it: Non è possibile aggiornare il riferimento alla proprietà
ja: プロパティ参照を更新できません
ko: 속성 참조를 업데이트할 수 없습니다.
pl: Nie można zaktualizować referencji właściwości
pt_br: A referência de propriedade não pode ser atualizada
ru: Не удается обновить ссылку на свойство
tr: Özellik başvurusu güncelleştirilemiyor
zh_hans: 无法更新属性引用
zh_hant: 無法更新屬性參考

source: Pull '{0}' up
de: "{0}" nach oben ziehen
fr: Tirer '{0}' vers le haut
it: Esegui pull '{0}' al livello superiore
ja: 最大 '{0}' 個をプル
tr: '{0}' öğesini yukarı çek
zh_hans: 向上拉 "{0}"
zh_hant: 向上提取 ‘{0}’

source: Pull '{0}' up to '{1}'
de: "{0}" zu "{1}" ziehen
fr: Tirer '{0}' jusqu'à '{1}'
it: Esegui pull di '{0}' fino a '{1}'
ja: '{1}' まで '{0}' をプルします
tr: '{0}' öğesini '{1}' hedefine çek
zh_hans: 将 "{0}" 拉到 "{1}"
zh_hant: 提取 '{0}' 最多 '{1}’

source: Pull members up to base type...
cs: Povýšit členy na základní typ...
de: Member zum Basistyp ziehen...
es: Extraer miembros hasta el tipo de base...
fr: Tirer les membres jusqu'au type de base...
it: Esegui pull dei membri fino al tipo di base...
ja: 基本型のメンバーをプル...
ko: 기본 형식까지 멤버를 풀...
pl: Ściągnij składowe aż do typu bazowego...
pt_br: Efetuar pull de membros até o tipo base...
ru: Извлечь элементы до базового типа...
tr: Üyeleri temel türe çek...
zh_hans: 将成员拉到基类...
zh_hant: 將成員提取直到基底類型...

source: Pull selected members up
cs: Stáhnout vybrané členy nahoru
de: Ausgewählte Elemente nach oben ziehen
es: Subir miembros seleccionados
it: Pull dei membri selezionati fino a
ja: 選択したメンバーを選出
ko: 선택한 멤버를 위로 당깁니다.
pl: Wyciągnij wybrane elementy składowe w górę
pt_br: Efetuar pull dos membros selecionados para cima
ru: Вытянуть выбранные элементы вверх
tr: Seçili üyeleri yukarı çek
zh_hans: 向上拉取所选成员

source: Pull selected members up to {0}
de: Ausgewählte Elemente bis {0} ziehen
it: Pull dei membri selezionati fino a {0}
ja: 選択したメンバーを最大 {0} 人選出
tr: Seçili üyeleri {0} öğesine yukarı çek
zh_hans: 将所选成员向上拉取到 {0}

source: Quantifier {x,y} following nothing
de: Quantifizierer {x,y} nach nichts.
fr: Le quantificateur {x,y} ne suit rien
it: Il quantificatore {x,y} non segue alcun elemento
ja: 量指定子 {x,y} の前に何もありません
tr: Niceleyici {x,y} hiçbir şeyi takip etmiyor
zh_hans: 限定符 {x,y} 前没有任何内容
zh_hant: 數量詞 {x,y} 前面沒有任何項目

source: reference to undefined group
de: Verweis auf nicht definierte Gruppe
fr: référence à un groupe indéfini
it: riferimento a gruppo indefinito
ja: 未定義のグループへの参照
tr: tanımsız grubuna başvuru
zh_hans: 对未定义组的引用
zh_hant: 對未定義群組的參考

source: Reference to undefined group name {0}
de: Verweis auf nicht definierten Gruppennamen {0}
fr: Référence au nom de groupe indéfini {0}
it: Riferimento a nome di gruppo indefinito: {0}
ja: 未定義のグループ名 {0} への参照
tr: {0} tanımsız grup adı referansı
zh_hans: 对未定义的组名 {0} 的引用
zh_hant: 對未定義群組名稱 {0} 的參考

source: Reference to undefined group number {0}
cs: Odkaz na nedefinované číslo skupiny {0}
de: Verweis auf nicht definierte Gruppennummer {0}
es: Referencia al número de grupo indefinido {0}
fr: Référence à un numéro de groupe indéfini {0}
it: Riferimento a numero di gruppo indefinito: {0}
ja: 未定義のグループ番号 {0} への参照
pl: Odwołanie do niezdefiniowanego numeru grupy {0}
pt_br: Referência ao grupo número {0} indefinido
ru: Ссылка на неопределенный номер группы {0}
tr: Tanımlanmamış grup numarası {0} referansı
zh_hans: 对未定义的组编号 {0} 的引用
zh_hant: 參考未定義的群組號碼 {0}

# Regex_all_control_characters_long
source: All control characters. This includes the Cc, Cf, Cs, Co, and Cn categories.
cs: Všechny řídicí znaky. Patří k nim kategorie Cc, Cf, Cs, Co a Cn.
de: Alle Steuerzeichen. Hierzu gehören die Kategorien "Cc", "Cf", "Cs", "Co" und "Cn".
es: Todos los caracteres de control. Esto incluye las categorías Cc, Cf, Cs, Co y Cn.
fr: Tous les caractères de contrôle. Cela inclut les catégories Cc, Cf, Cs, Co et Cn.
it: Tutti i caratteri di controllo. Sono incluse le categorie Cc, Cf, Cs, Co e Cn.
ja: すべての制御文字。これには、Cc、Cf、Cs、Co、Cn カテゴリが含まれます。
ko: 모든 제어 문자입니다. Cc, Cf, Cs, Co 및 Cn 범주가 포함됩니다.
pl: Wszystkie znaki kontrolne. Obejmuje to kategorie Cc, Cf, Cs, Co i Cn.
pt_br: Todos os caracteres de controle. Isso inclui as categorias Cc, Cf, Cs, Co e Cn.
ru: Все управляющие символы. Сюда входят категории Cc, Cf, Cs, Co и Cn.
tr: Tüm denetim karakterleri. Buna Cc, Cf, Cs, Co ve Cn kategorileri dahildir.
zh_hans: 所有控制字符。这包括 Cc、Cf、Cs、Co 和 Cn 类别。
zh_hant: 所有控制字元。這包括了 Cc、Cf、Cs、Co 和 Cn 分類。

# Regex_all_control_characters_short
source: all control characters
cs: všechny řídicí znaky
de: Alle Steuerzeichen
es: todos los caracteres de control
fr: tous les caractères de contrôle
it: tutti i caratteri di controllo
ja: すべての制御文字
ko: 모든 제어 문자
pl: wszystkie znaki kontrolne
pt_br: todos os caracteres de controle
ru: все управляющие символы
tr: tüm denetim karakterleri
zh_hans: 所有控制字符
zh_hant: 所有控制字元

# Regex_all_diacritic_marks_long
source: All diacritic marks. This includes the Mn, Mc, and Me categories.
cs: Všechny značky diakritických znamének. Patří k nim kategorie Mn, Mc a Me.
de: Alle diakritischen Zeichen. Hierzu gehören die Kategorien "Mn", "Mc" und "Me".
es: Todas las marcas diacríticas. Esto incluye las categorías Mn, Mc y Me.
fr: Toutes les marques diacritiques. Cela inclut les catégories Mn, Mc et Me.
it: Tutti i contrassegni diacritici. Sono incluse le categorie Mn, Mc e Me.
ja: すべての分音記号マーク。これには Mn、Mc、Me カテゴリが含まれます。
ko: 모든 분음 부호입니다. Mn, Mc 및 Me 범주가 포함됩니다.
pl: Wszystkie znaki diakrytyczne. Obejmuje to kategorie Mn, Mc i Me.
pt_br: Todas as marcas diacríticas. Isso inclui as categorias Mn, Mc e Me.
ru: Все диакритические знаки. Сюда входят категории Mn, Mc и Me.
tr: Tüm aksan işaretleri. Buna Mn, Mc ve Me kategorileri dahildir.
zh_hans: 所有音调符号标记。这包括 "Mn"、"Mc" 和 "Me" 类别。
zh_hant: 所有變音符號標記。這包括了 Mn、Mc 和 Me 分類。

# Regex_all_diacritic_marks_short
source: all diacritic marks
cs: všechny značky diakritických znamének
de: Alle diakritischen Zeichen
es: todas las marcas diacríticas
fr: toutes les marques diacritiques
it: tutti i contrassegni diacritici
ja: すべての分音記号マーク
ko: 모든 분음 부호
pl: wszystkie znaki diakrytyczne
pt_br: todas as marcas diacríticas
ru: все диакритические знаки
tr: tüm aksan işaretleri
zh_hans: 所有音调符号标记
zh_hant: 所有變音符號標記

# Regex_all_letter_characters_long
source: All letter characters. This includes the Lu, Ll, Lt, Lm, and Lo characters.
cs: Všechny znaky písmen. Patří k nim znaky Lu, Ll, Lt, Lm a Lo.
de: Alle Buchstaben. Hierzu gehören die Zeichen "Lu", "Ll", "Lt", "Lm" und "Lo".
es: Todos los caracteres de letra. Esto incluye los caracteres Lu, Ll, Lt, Lm y Lo.
fr: Tous les caractères correspondant à des lettres. Cela inclut les caractères Lu, Ll, Lt, Lm et Lo.
it: Tutti i caratteri alfanumerici. Sono incluse le categorie Lu, Ll, Lt, Lm e Lo.
ja: すべての文字。これには、Lu、Ll、Lt、Lm、Lo 文字が含まれます。
ko: 모든 문자입니다. Lu, Ll, Lt, Lm 및 Lo 문자가 포함됩니다.
pl: Wszystkie litery. Obejmuje to znaki Lu, Ll, Lt, Lm i Lo.
pt_br: Todos os caracteres de letra. Isso inclui os caracteres Lu, Ll, Lt, Lm e Lo.
ru: Все буквенные символы. Сюда входят символы Lu, Ll, Lt, Lm и Lo.
tr: Tüm harf karakterleri. Buna Lu, Ll, Lt, Lm ve Lo karakterleri dahildir.
zh_hans: 所有字母字符。这包括 Lu、Ll、Lt、Lm 和 Lo 字符。
zh_hant: 所有字母字元。這包括了 Lu、Ll、Lt、Lm 和 Lo 字元。

# Regex_all_letter_characters_short
source: all letter characters
cs: všechny znaky písmen
de: Alle Buchstaben
es: todos los caracteres de letra
fr: tous les caractères correspondant à des lettres
it: tutti i caratteri alfanumerici
ja: すべての文字
ko: 모든 문자
pl: wszystkie litery
pt_br: todos os caracteres de letra
ru: все буквенные символы
tr: tüm harf karakterleri
zh_hans: 所有字母字符
zh_hant: 所有字母字元

# Regex_all_numbers_long
source: All numbers. This includes the Nd, Nl, and No categories.
cs: Všechna čísla. Patří k nim kategorie Nd, Nl a No.
de: Alle Zahlen. Hierzu gehören die Kategorien "Nd", "Nl" und "No".
es: Todos los números. Esto incluye las categorías Nd, Nl y No.
fr: Tous les nombres. Cela inclut les catégories Nd, Nl et No.
it: Tutti i numeri. Sono incluse le categorie Nd, Nl e No.
ja: すべての数。これには、Nd、Nl、No カテゴリが含まれます。
ko: 모든 숫자입니다. Nd, Nl 및 No 범주가 포함됩니다.
pl: Wszystkie cyfry. Obejmuje to kategorie Nd, Nl i No.
pt_br: Todos os números. Isso inclui as categorias Nd, Nl e No.
ru: Все числа. Сюда входят категории Nd, Nl и No.
tr: Tüm sayılar. Bunlara Nd, Nl ve No kategorileri dahildir.
zh_hans: 所有数字。这包括 Nd、Nl 和 No 类别。
zh_hant: 所有數字。這包括了 Nd、Nl 和 No 分類。

# Regex_all_numbers_short
source: all numbers
cs: všechna čísla
de: Alle Zahlen
es: todos los números
fr: tous les nombres
it: tutti i numeri
ja: すべての数
ko: 모든 숫자
pl: wszystkie cyfry
pt_br: todos os números
ru: все числа
tr: tüm sayılar
zh_hans: 所有数字
zh_hant: 所有數字

# Regex_all_punctuation_characters_long
source: All punctuation characters. This includes the Pc, Pd, Ps, Pe, Pi, Pf, and Po categories.
cs: Všechny znaky interpunkce. Patří k nim kategorie Pc, Pd, Ps, Pe, Pi, Pf a Po.
de: Alle Satzzeichen. Hierzu gehören die Kategorien "Pc", "Pd", "Ps", "Pe", "Pi", "Pf" und "Po".
es: Todos los caracteres de puntuación. Esto incluye las categorías Pc, Pd, Ps, Pe, Pi, Pf y Po.
fr: Tous les caractères de ponctuation. Cela inclut les catégories Pc, Pd, Ps, Pe, Pi, Pf et Po.
it: Tutti i caratteri di punteggiatura. Sono incluse le categorie Pc, Pd, Ps, Pe, Pi, Pf e Po.
ja: すべての句読点文字。これには、Pc、Pd、Ps、Pe、Pi、Pf、Po カテゴリが含まれます。
ko: 모든 문장 부호 문자입니다. Pc, Pd, Ps, Pe, Pi, Pf 및 Po 범주가 포함됩니다.
pl: Wszystkie znaki interpunkcyjne. Obejmuje to kategorie Pc, Pd, Ps, Pe, Pi, Pf i Po.
pt_br: Todos os caracteres de pontuação. Isso inclui as categorias Pc, Pd, Ps, Pe, Pi, Pf e Po.
ru: Все знаки препинания. Сюда входят категории Pc, Pd, Ps, Pe, Pi, Pf и Po.
tr: Tüm noktalama karakterleri. Buna Pc, Pd, Ps, Pe, Pi, Pf ve Po kategorileri dahildir.
zh_hans: 所有标点字符。这包括 Pc、Pd、Ps、Pe、Pi、Pf 和 Po 类别。
zh_hant: 所有標點符號字元。這包括了 Pc、Pd、Ps、Pe、Pi、Pf 和 Po 分類。

# Regex_all_punctuation_characters_short
source: all punctuation characters
cs: všechny znaky interpunkce
de: Alle Satzzeichen
es: todos los caracteres de puntuación
fr: tous les caractères de ponctuation
it: tutti i caratteri di punteggiatura
ja: すべての句読点文字
ko: 모든 문장 부호 문자
pl: wszystkie znaki interpunkcyjne
pt_br: todos os caracteres de pontuação
ru: все знаки препинания
tr: tüm noktalama karakterleri
zh_hans: 所有标点字符
zh_hant: 所有標點符號字元

# Regex_all_separator_characters_long
source: All separator characters. This includes the Zs, Zl, and Zp categories.
cs: Všechny oddělovací znaky. Patří k nim kategorie Zs, Zl a Zp.
de: Alle Trennzeichen. Hierzu gehören die Kategorien "Zs", "Zl" und "Zp".
es: Todos los caracteres separadores. Esto incluye las categorías Zs, Zl y Zp.
fr: Tous les caractères de séparation. Cela inclut les catégories Zs, Zl et Zp.
it: Tutti i caratteri separatori. Sono incluse le categorie Zs, Zl e Zp.
ja: すべての区切り文字。これには、Zs、Zl、Zp カテゴリが含まれます。
ko: 모든 구분 문자입니다. Zs, Zl 및 Zp 범주가 포함됩니다.
pl: Wszystkie znaki separatora. Obejmuje to kategorie Zs, Zl i Zp.
pt_br: Todos os caracteres separadores. Isso inclui as categorias Zs, Zl e Zp.
ru: Все символы-разделители. Сюда входят категории Zs, Zl и Zp.
tr: Tüm ayıraç karakterleri. Buna Zs, Zl ve Zp kategorileri dahildir.
zh_hans: 所有分隔符字符。这包括 Zs、Zl 和 Zp 类别。
zh_hant: 所有分隔符號字元。這包括了 Zs、Zl 和 Zp 分類。

# Regex_all_separator_characters_short
source: all separator characters
cs: všechny oddělovací znaky
de: Alle Trennzeichen
es: todos los caracteres separadores
fr: tous les caractères de séparation
it: tutti i caratteri separatori
ja: すべての区切り文字
ko: 모든 구분 문자
pl: wszystkie znaki separatora
pt_br: todos os caracteres separadores
ru: все символы-разделители
tr: tüm ayıraç karakterleri
zh_hans: 所有分隔符字符
zh_hant: 所有分隔符號字元

# Regex_all_symbols_long
source: All symbols. This includes the Sm, Sc, Sk, and So categories.
cs: Všechny symboly. Patří k nim kategorie Sm, Sc, Sk a So.
de: Alle Symbole. Hierzu gehören die Kategorien "Sm", "Sc", "Sk" und "So".
es: Todos los símbolos. Esto incluye las categorías Sm, Sc, Sk y So.
fr: Tous les symboles. Cela inclut les catégories Sm, Sc, Sk et So.
it: Tutti i simboli. Sono incluse le categorie Sm, Sc, Sk e So.
ja: すべての記号。これには、Sm、Sc、Sk、So カテゴリが含まれます。
ko: 모든 기호입니다. Sm, Sc, Sk 및 So 범주가 포함됩니다.
pl: Wszystkie symbole. Obejmuje to kategorie Sm, Sc, Sk i So.
pt_br: Todos os símbolos. Isso inclui as categorias Sm, Sc, Sk e So.
ru: Все символы. Сюда входят категории Sm, Sc, Sk и So.
tr: Tüm semboller. Buna Sm, Sc, Sk ve So kategorileri dahildir.
zh_hans: 所有符号。这包括 Sm、Sc、Sk 和 So 类别。
zh_hant: 所有符號。這包括了 Sm、Sc、Sk 和 So 分類。

# Regex_all_symbols_short
source: all symbols
cs: všechny symboly
de: Alle Symbole
es: todos los símbolos
fr: tous les symboles
it: tutti i simboli
ja: すべての記号
ko: 모든 기호
pl: wszystkie symbole
pt_br: todos os símbolos
ru: все символы
tr: tüm semboller
zh_hans: 所有符号
zh_hant: 所有符號

# Regex_alternation_long
source: You can use the vertical bar (|) character to match any one of a series of patterns, where the | character separates each pattern.
cs: Můžete použít znak svislé čáry (|), pokud se má položka shodovat s libovolným vzorem z řady, ve které znak | odděluje jednotlivé vzory.
de: Mit dem senkrechten Strich (|) können Sie eine beliebige Reihe von Mustern abgleichen, wobei das |-Zeichen die einzelnen Muster voneinander trennt.
es: Puede usar el carácter de barra vertical (|) para hacerlo coincidir con algún patrón de una serie, donde el carácter | el carácter separa cada patrón.
fr: Vous pouvez utiliser la barre verticale (|) pour faire correspondre une série de modèles, où le caractère | sépare chaque modèle.
it: È possibile usare la barra verticale (|) per trovare la corrispondenza con uno qualsiasi di una serie di criteri, dove i singoli criteri sono separati dal carattere |.
ja: 縦棒 (|) を使用して一連のパターンのいずれかに一致させることができます。| 文字を使用して各パターンを区切ります。
ko: 세로 막대(|) 문자를 사용하여 일련의 패턴 중 하나를 일치시킬 수 있습니다. 여기서 | 문자는 각 패턴을 구분합니다.
pl: Możesz użyć znaku pionowej kreski (|) w celu dopasowania dowolnego z serii wzorców, przy czym znak | oddziela poszczególne wzorce.
pt_br: Você pode usar o caractere de barra vertical (|) para corresponder a qualquer uma das séries de padrões, em que o caractere | separa cada padrão.
ru: Вы можете использовать символ вертикальной черты (|), чтобы сопоставить любую из серий шаблонов, где каждый шаблон отделяется символом |.
tr: Dikey çubuk (|) karakterini, | karakterinin her deseni ayırdığı bir dizi desenin herhangi biriyle eşleştirmek için kullanabilirsiniz.
zh_hans: 可以使用竖线(|)字符匹配一系列模式中的任何一个，其中 | 字符分隔每个模式。
zh_hant: 您可以使用分隔號 (|) 字元比對一系列模式中的任一模式，其中 | 字元會分隔各個模式。

# Regex_alternation_short
source: alternation
cs: alternace
de: Alternierung
es: alternación
fr: alternance
it: alternanza
ja: 代替
ko: 대체
pl: alternatywa
pt_br: alternação
ru: чередование
tr: değişim
zh_hans: 替换
zh_hant: 替代

# Regex_any_character_group_long
source: The period character (.) matches any character except \n (the newline character, \u000A). If a regular expression pattern is modified by the RegexOptions.Singleline option, or if the portion of the pattern that contains the . character class is modified by the 's' option, . matches any character.
cs: Znak tečky (.) odpovídá libovolnému znaku s výjimkou \n (znak nového řádku \u000A). Pokud je vzor regulárního výrazu modifikovaný možností RegexOptions.Singleline nebo pokud je část vzoru obsahující třídu znaků tečky modifikovaná parametrem s, pak znak tečky odpovídá libovolnému znaku.
de: Der Punkt (.) stimmt mit einem beliebigen Zeichen außer "\n" überein (das Zeilenvorschubzeichen, \u000A). Wenn ein Muster für einen regulären Ausdruck durch die Option "RegexOptions.Singleline" geändert wird oder wenn der Teil des Musters, der die Zeichenklasse "." enthält, durch die Option "s" verändert wird, stimmt "." mit jedem beliebigen Zeichen überein.
es: El carácter de punto (.) coincide con cualquier carácter excepto \n (el carácter de nueva línea, \u000A). Si la opción RegexOptions.SingleLine modifica un patrón de expresión regular o si la parte del patrón que contiene el carácter . se modifica mediante la opción "s", . coincide con cualquier carácter.
fr: Le point (.) correspond à n'importe quel caractère sauf \n (le caractère nouvelle ligne, \u000A). Si un modèle d'expression régulière est modifié par l'option RegexOptions.Singleline, ou si la partie du modèle qui contient la classe de caractères . est modifiée par l'option 's', le . correspond à n'importe quel caractère.
it: Il carattere punto (.) corrisponde a qualsiasi carattere tranne \n (carattere di nuova riga \u000A). Se un criterio di ricerca di espressioni regolari viene modificato dall'opzione RegexOptions.Singleline o se la parte del criterio contenente la classe di caratteri . viene modificata dall'opzione 's', . corrisponde a qualsiasi carattere.
ja: ピリオド文字 (.) は、\n (改行文字 \u000A) 以外の任意の文字に一致します。RegexOptions.Singleline オプションによって正規表現パターンが変更された場合、または . 文字クラスを含むパターンの部分が 's' オプションによって変更された場合、. は任意の文字と一致します。
ko: 마침표(.) 문자는 \n(줄 바꿈 문자, \u000A)을 제외한 모든 문자와 일치시킵니다. 정규식 패턴이 RegexOptions.Singleline 옵션으로 수정되거나 . 문자 클래스가 포함된 패턴의 일부가 's' 옵션으로 수정된 경우 .는 모든 문자와 일치시킵니다.
pl: Znak kropki (.) pasuje do dowolnego znaku oprócz \n (znaku nowego wiersza — \u000A). Jeśli wzorzec wyrażenia regularnego zostanie zmodyfikowany za pomocą opcji RegexOptions.Singleline lub jeśli część wzorca zawierająca klasę znaków . zostanie zmodyfikowana za pomocą opcji „s”, znak . będzie pasować do dowolnego znaku.
pt_br: O caractere de ponto (.) corresponde a qualquer caractere, exceto \n (o caractere de nova linha, \u000A). Se um padrão de expressão regular for modificado pela opção RegexOptions.Singleline ou se a parte do padrão que contém a classe de caractere . for modificada pela opção 's', . corresponderá a qualquer caractere.
ru: Символ точки (.) соответствует любому символу, кроме \n (символ новой строки, \u000A). Если шаблон регулярного выражения изменяется параметром RegexOptions.Singleline или если часть шаблона, содержащая класс символов ., изменяется параметром "s", . соответствует любому символу.
tr: Nokta karakteri (.) \n (yeni satır karakteri, \u000A) dışında herhangi bir karakterle eşleşir. Normal ifade deseni RegexOptions.Singleline seçeneği tarafından değiştirilirse veya desenin . karakteri sınıfını içeren kısmı 's' seçeneği tarafından değiştirilirse, . herhangi bir karakterle eşleşir.
zh_hans: 句点字符(.)匹配除 \n (换行符 \u000A)以外的任何字符。如果正则表达式模式已被 RegexOptions Singleline 选项修改，或者如果包含 ". " 字符类的模式部分已被 "s" 选项修改，则 ". " 可匹配任何字符。
zh_hant: 句點字元 (.) 會比對任何字元，\n (新行字元 \u000A) 除外。如果 RegexOptions.Singleline 選項修改了規則運算式模式，或 's' 選項修改了模式中包含 . 字元的那部分，. 就會比對任何字元。

# Regex_any_character_group_short
source: any character
cs: libovolný znak
de: Jedes Zeichen
es: cualquier carácter
fr: tout caractère
it: qualsiasi carattere
ja: 任意の文字
ko: 모든 문자
pl: dowolny znak
pt_br: qualquer caractere
ru: любой символ
tr: herhangi bir karakter
zh_hans: 任何字符
zh_hant: 任一字元
