Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# time_separator_description
source: The ":" custom format specifier represents the time separator, which is used to differentiate hours, minutes, and seconds. The appropriate localized time separator is retrieved from the DateTimeFormatInfo.TimeSeparator property of the current or specified culture. Note: To change the time separator for a particular date and time string, specify the separator character within a literal string delimiter. For example, the custom format string hh'_'dd'_'ss produces a result string in which "_" (an underscore) is always used as the time separator. To change the time separator for all dates for a culture, either change the value of the DateTimeFormatInfo.TimeSeparator property of the current culture, or instantiate a DateTimeFormatInfo object, assign the character to its TimeSeparator property, and call an overload of the formatting method that includes an IFormatProvider parameter. If the ":" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: Specifikátor vlastního formátu : představuje oddělovač času, pomocí kterého se odlišují hodiny, minuty a sekundy. Správný lokalizovaný oddělovač data se načítá z vlastnosti DateTimeFormatInfo.TimeSeparator aktuální nebo zadané jazykové verze. Poznámka: Pokud chcete změnit oddělovač času pro konkrétní řetězec data a času, zadejte znak oddělovače v oddělovači literálního řetězce. Například řetězec s vlastním formátem hh'_'dd'_'ss vytvoří výsledný řetězec, ve kterém se _ (podtržítko) vždy použije jako oddělovač času. Pokud chcete oddělovač času změnit pro všechna data v jazykové verzi, buď změňte hodnotu vlastnosti DateTimeFormatInfo.TimeSeparator aktuální jazykové verze, nebo vytvořte instanci objektu DateTimeFormatInfo, přiřaďte znak do jeho vlastnosti TimeSeparator a zavolejte přetížení metody formátování, která zahrnuje parametr IFormatProvider. Pokud se specifikátor formátu : použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času a vyvolá FormatException.
de: Der benutzerdefinierte Formatbezeichner ":" repräsentiert das Zeittrennzeichen, das zur Unterscheidung von Stunden, Minuten und Sekunden verwendet wird. Das geeignete lokalisierte Zeittrennzeichen wird aus der DateTimeFormatInfo.TimeSeparator-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen. Hinweis: Um das Zeittrennzeichen für eine bestimmte Datums- und Uhrzeitzeichenfolge zu ändern, geben Sie das Trennzeichen innerhalb eines Trennzeichens einer Literalzeichenfolge an. Beispielsweise erzeugt die benutzerdefinierte Formatzeichenfolge "hh'_'dd'_'ss" eine Ergebniszeichenfolge, in der stets "_" (ein Unterstrich) als Zeittrennzeichen verwendet wird. Um das Zeittrennzeichen für alle Datumswerte für eine Kultur zu ändern, ändern Sie entweder den Wert der DateTimeFormatInfo.TimeSeparator-Eigenschaft der aktuellen Kultur, oder instanziieren Sie ein DateTimeFormatInfo-Objekt, weisen Sie das Zeichen der zugehörigen TimeSeparator-Eigenschaft zu, und rufen Sie eine Überladung der Formatierungsmethode auf, die einen IFormatProvider-Parameter umfasst. Bei Verwendung des Formatbezeichners ":" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner für Datums- und Uhrzeitwerte interpretiert und löst eine FormatException aus.
es: El especificador de formato personalizado ":" representa el separador de hora, que se usa para diferenciar las horas, los minutos y los segundos. El separador de hora localizado apropiado se recupera de la propiedad DateTimeFormatInfo.TimeSeparator de la referencia cultural actual o especificada. Nota: Para cambiar el separador de hora de una cadena de fecha y hora determinada, especifique el carácter separador dentro de un delimitador de cadena literal. Por ejemplo, la cadena de formato personalizado hh'_'dd'_'ss genera una cadena de resultado en la que "_" (un carácter de subrayado) siempre se usa como separador de hora. Para cambiar el separador de hora de todas las fechas de una referencia cultural, cambie el valor de la propiedad DateTimeFormatInfo.TimeSeparator de la referencia cultural actual, o bien cree una instancia del objeto DateTimeFormatInfo, asigne el carácter a su propiedad TimeSeparator y llame a una sobrecarga del método de formato que incluye un parámetro IFormatProvider. Si el especificador de formato ":" se usa sin otros especificadores de formato personalizados, se interpreta como un especificador de formato de fecha y hora estándar y produce una excepción FormatException.
fr: Le spécificateur de format personnalisé ":" représente le séparateur d'heure, qui est utilisé pour différencier les heures, les minutes et les secondes. Le séparateur d'heure localisé approprié est récupéré à partir de la propriété DateTimeFormatInfo.TimeSeparator de la culture actuelle ou spécifiée. Remarque : Pour changer le séparateur d'heure d'une chaîne de date et d'heure particulière, spécifiez le caractère de séparation dans un délimiteur de chaîne littérale. Par exemple, la chaîne de format personnalisée hh'_'dd'_'ss produit une chaîne de résultat dans laquelle "_" (trait de soulignement) est toujours utilisé en tant que séparateur d'heure. Pour changer le séparateur d'heure de toutes les heures d'une culture, changez la valeur de la propriété DateTimeFormatInfo.TimeSeparator de la culture actuelle, ou instanciez un objet DateTimeFormatInfo, affectez le caractère à sa propriété TimeSeparator, puis appelez une surcharge de la méthode de format qui inclut un paramètre IFormatProvider. Si le spécificateur de format ":" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: L'identificatore di formato personalizzato ":" rappresenta il separatore di ora che viene usato per distinguere ore, minuti e secondi. Il separatore di ora localizzato appropriato viene recuperato dalla proprietà DateTimeFormatInfo.TimeSeparator delle impostazioni cultura correnti o specificate. Nota: per modificare il separatore di ora per una particolare stringa di data e ora, specificare il carattere separatore all'interno di un delimitatore di stringa letterale. La stringa con formato personalizzato hh'_'dd'_'ss, ad esempio, produce una stringa in cui come separatore di ora viene sempre usato "_" (carattere di sottolineatura). Per cambiare il separatore di ora per tutte le date per impostazioni cultura, modificare il valore della proprietà DateTimeFormatInfo.TimeSeparator per le impostazioni cultura correnti oppure creare un'istanza di un oggetto DateTimeFormatInfo, assegnare il carattere alla relativa proprietà TimeSeparator e chiamare un overload del metodo di formattazione che include un parametro IFormatProvider. Se l'identificatore di formato ":" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: ":" カスタム書式指定子は、時、分、および秒を区別するための時刻の区切り記号を表します。ローカライズされた適切な時刻の区切り記号は、現在のカルチャまたは指定されたカルチャの DateTimeFormatInfo.TimeSeparator プロパティから取得されます。 注: 特定の日付と時刻の文字列について時刻の区切り記号を変更するには、リテラル文字列の区切り記号内に区切り記号を指定します。たとえば、カスタム書式設定文字列 hh'_'dd'_'ss によって生成される結果文字列では、"_" (アンダースコア) が常に時刻の区切り記号として使用されます。カルチャのすべての日付について時刻の区切り記号を変更するには、現在のカルチャの DateTimeFormatInfo.TimeSeparator プロパティ値を変更するか、DateTimeFormatInfo オブジェクトのインスタンスを作成し、その TimeSeparator プロパティに文字を割り当てて、IFormatProvider パラメーターを含む書式設定メソッドのオーバーロードを呼び出します。 他のカスタム書式指定子が使用されていない場合、":" は標準の日時書式指定子として解釈され、FormatException をスローします。
ko: ":" 사용자 지정 형식 지정자는 시간, 분, 초를 구분하는 데 사용되는 시간 구분 기호를 나타냅니다. 지역화된 적절한 시간 구분 기호가 현재 문화권 또는 지정된 문화권의 DateTimeFormatInfo.TimeSeparator 속성에서 검색됩니다. 참고: 특정 날짜 및 시간 문자열의 시간 구분 기호를 변경하려면 리터럴 문자열 구분 기호 내에서 구분 기호 문자를 지정하세요. 예를 들어, 사용자 지정 형식 문자열 hh'_'dd'_'ss는 "_"(밑줄)이 항상 시간 구분 기호로 사용되는 결과 문자열을 생성합니다. 문화권의 모든 날짜에 대해 시간 구분 기호를 변경하려면 현재 문화권의 DateTimeFormatInfo.TimeSeparator 속성 값을 변경하거나 DateTimeFormatInfo 개체를 인스턴스화한 후 해당 TimeSeparator 속성에 문자를 할당하고 IFormatProvider 매개 변수를 포함하는 형식 지정 메서드의 오버로드를 호출하세요. 다른 사용자 지정 형식 지정자 없이 ":" 형식 지정자를 사용하면 표준 날짜 및 시간 형식 지정자로 해석되어 FormatException을 throw합니다.
pl: Niestandardowy specyfikator formatu „:” reprezentuje separator godziny, który jest używany do rozdzielania godzin, minut i sekund. Odpowiedni zlokalizowany separator godziny jest pobierany z właściwości DateTimeFormatInfo.TimeSeparator bieżącej lub określonej kultury. Uwaga: aby zmienić separator godziny dla określonego ciągu daty i godziny, określ znak separatora w ramach ogranicznika ciągu literału. Na przykład niestandardowy ciąg formatu hh'_'dd'_'ss tworzy ciąg wyniku, w którym znak „_” (podkreślenie) jest zawsze używany jako separator godziny. Aby zmienić separator godziny dla wszystkich dat kultury, zmień wartość właściwości DateTimeFormatInfo.TimeSeparator bieżącej kultury lub utwórz wystąpienie obiektu DateTimeFormatInfo, przypisz znak do jego właściwości TimeSeparator i wywołaj przeciążenie metody formatowania, które obejmuje parametr IFormatProvider. Jeśli specyfikator formatu „:” zostanie użyty bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny i powoduje zgłoszenie wyjątku FormatException.
pt_br: O especificador de formato personalizado ":" representa o separador de hora, que é usado para diferenciar horas, minutos e segundos. O separador de hora localizado apropriado é recuperado da propriedade DateTimeFormatInfo.TimeSeparator da cultura atual ou especificada. Observação: para alterar o separador de hora de uma determinada cadeia de caracteres de data e hora, especifique o caractere separador em um delimitador de cadeia de caracteres literal. Por exemplo, a cadeia de caracteres de formato personalizado hh'_'dd'_'ss produz uma cadeia de caracteres de resultado na qual "_" (um sublinhado) é sempre usado como o separador de hora. Para alterar o separador de hora para todas as datas para uma cultura, altere o valor da propriedade DateTimeFormatInfo.TimeSeparator da cultura atual ou crie uma instância de um objeto DateTimeFormatInfo, atribua o caractere à propriedade TimeSeparator e chame uma sobrecarga do método de formatação que inclui um parâmetro IFormatProvider. Se o especificador de formato ":" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: Описатель пользовательского формата ":" представляет разделитель компонентов времени, который позволяет различать часы, минуты и секунды. Соответствующий локализованный разделитель компонентов времени извлекается из свойства DateTimeFormatInfo.TimeSeparator текущих или заданных языка и региональных параметров. Примечание. Чтобы изменить разделитель компонентов времени для определенной строки даты и времени, укажите знак разделения в разделителе литеральной строки. Например, строка пользовательского формата hh'_'dd'_'ss дает результирующую строку, в которой "_" (символ подчеркивания) всегда используется в качестве разделителя компонентов времени. Чтобы изменить разделитель компонентов времени для всех дат для языка и региональных параметров, измените значение свойства DateTimeFormatInfo.TimeSeparator текущих языка и региональных параметров или создайте экземпляр объекта DateTimeFormatInfo, присвойте этот знак его свойству TimeSeparator и вызовите перегрузку метода форматирования, включающую параметр IFormatProvider. Если описатель формата ":" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: ":" özel biçim belirticisi saatleri, dakikaları ve saniyeleri ayırt etmek için kullanılan saat ayırıcısını temsil eder. Uygun yerelleştirilmiş saat ayırıcısı, geçerli veya belirtilen kültürün DateTimeFormatInfo.TimeSeparator özelliğinden alınır. Not: Belirli bir tarih ve saat dizesinin saat ayırıcısını değiştirmek için ayırıcı karakteri bir sabit dize sınırlayıcısı içinde belirtin. Örneğin, özel biçim dizesi ss'_'dd'_'nn, saat ayırıcısı olarak her zaman "_" (alt çizgi) kullanılan bir sonuç dizesi oluşturur. Bir kültürde tüm tarihlerin saat ayırıcısını değiştirmek için geçerli kültürün DateTimeFormatInfo.TimeSeparator özelliğinin değerini değiştirin ya da DateTimeFormatInfo nesnesinin bir örneğini oluşturun, karakteri TimeSeparator özelliğine atayın ve bir IFormatProvider parametresi içeren biçimlendirme yönteminin bir aşırı yüklemesini çağırın. ":" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: ":" 自定义格式说明符表示用于区分小时、分钟和秒的时间分隔符。可从当前或指定区域性的 DateTimeFormatInfo.TimeSeparator 属性中检索适当的本地化时间分隔符。 注意: 若要更改特定日期和时间字符串的时间分隔符，请在文本字符串分隔符中指定分隔符字符。例如，自定义格式字符串 hh'_'dd'_'ss 生成一个结果字符串，其中 "_" (下划线)始终用作时间分隔符。若要更改某个区域性的所有日期的时间分隔符，请更改当前区域性的 DateTimeFormatInfo.TimeSeparator 属性的值，或者实例化 DateTimeFormatInfo 对象，并将该字符分配给它的 TimeSeparator 属性，然后调用包含 IFormatProvider 参数的格式设置方法的重载。 如果使用 ":" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: ":" 自訂格式規範代表時間分隔符號，用於區分小時、分鐘和秒。系統會從目前或指定文化特性 (Culture) 的 DateTimeFormatInfo.TimeSeparator 屬性，擷取適當的當地語系化時間分隔符號。 注意: 若要變更特定日期和時間字串的時間分隔符號，請在常值字串分隔符號內指定分隔符號字元。例如，自訂格式字串 hh'_'dd'_'ss 會產生結果字串，其中 "_" (底線) 永遠用作時間分隔符號。若要針對文化特性 (Culture) 變更所有日期的時間分隔符號，請變更目前文化特性 (Culture) 的 DateTimeFormatInfo.TimeSeparator 屬性值，或將 DateTimeFormatInfo 物件具現化，將字元指派給其 TimeSeparator 屬性，並呼叫包含 IFormatProvider 參數之格式化方法的多載。 如果使用 ":" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為標準日期和時間格式規範，並擲回 FormatException。

source: time zone
cs: časové pásmo
de: Zeitzone
es: zona horaria
fr: fuseau horaire
it: Fuso orario
ja: タイム ゾーン
ko: 표준 시간대
pl: strefa czasowa
pt_br: fuso horário
ru: Часовой пояс
tr: saat dilimi
zh_hans: 时区
zh_hant: 時區
