Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_white_space_character_long
source: \s matches any white-space character. It is equivalent to the following escape sequences and Unicode categories: \f The form feed character, \u000C \n The newline character, \u000A \r The carriage return character, \u000D \t The tab character, \u0009 \v The vertical tab character, \u000B \x85 The ellipsis or NEXT LINE (NEL) character (…), \u0085 \p{Z} Matches any separator character If ECMAScript-compliant behavior is specified, \s is equivalent to [ \f\n\r\t\v]
cs: \s odpovídá jakémukoli prázdnému znaku. Je ekvivalentem následujících řídicích sekvencí a kategorií Unicode: \f znak pro novou stránku \u000C \n znak nového řádku \u000A \r znak návratu na začátek řádku \u000D \t znak tabulátoru \u0009 \v znak svislého tabulátoru \u000B \x85 znak tří teček nebo dalšího řádku (...) \u0085 \p{Z} shoda s libovolným znakem oddělovače Pokud je zadané chování kompatibilní s ECMAScriptem, je \s ekvivalentem [ \f\n\r\t\v].
de: "\s" stimmt mit einem beliebigen Leerraumzeichen überein. Entspricht den folgenden Escapesequenzen und Unicode-Kategorien: \f Das Seitenvorschubzeichen, \u000C \n Das Zeilenvorschubzeichen, \u000A \r Das Wagenrücklaufzeichen, \u000D \t Das Tabstoppzeichen, \u0009 \v Das vertikale Tabstoppzeichen, \u000B \x85 Das Auslassungszeichen oder NEL-Zeichen für die nächste Zeile (...), \u0085 \p{Z} Entspricht einem beliebigen Trennzeichen Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\s" gleichbedeutend mit "[\f\n\r\t\v]".
es: \s coincide con cualquier carácter de espacio en blanco. Equivale a las siguientes secuencias de escape y categorías Unicode: \f El carácter de avance de página, \u000C \n El carácter de nueva línea, \u000A \r El carácter de retorno de carro, \u000D \t El carácter de tabulación, \u0009 \v El carácter de tabulación vertical, \u000B \x85 El carácter de puntos suspensivos o NEXT LINE (NEL) (...), \u0085 \p{Z} Corresponde a cualquier carácter separador Si se especifica un comportamiento compatible con ECMAScript, \s equivale a [ \f\n\r\t\v]
fr: \s correspond à un caractère représentant un espace blanc. Il équivaut aux séquences d'échappement et aux catégories Unicode suivantes : \f Caractère de saut de page, \u000C \n Caractère nouvelle ligne, \u000A \r Caractère de retour chariot, \u000D \t Caractère de tabulation, \u0009 \v Caractère de tabulation verticale, \u000B \x85 Caractère des points de suspension ou NEL (NEXT LINE) (…), \u0085 \p{Z} Correspond à un caractère de séparation Si vous spécifiez un comportement conforme à ECMAScript, \s équivaut à [ \f\n\r\t\v]
it: \s trova la corrispondenza di qualsiasi carattere di spazio. Equivale alle sequenze di escape e alle categorie Unicode seguenti: \f Carattere di avanzamento modulo \u000C \n Carattere di nuova riga \u000A \r Carattere di ritorno a capo \u000D \t Carattere di tabulazione \u0009 \v Carattere di tabulazione verticale \u000B \x85 Puntini di sospensione o carattere NEXT LINE (NEL) (…) \u0085 \p{Z} Trova la corrispondenza di un qualsiasi carattere separatore Se viene specificato il comportamento conforme a ECMAScript, \s equivale a [ \f\n\r\t\v]
ja: \s は任意の空白文字に一致します。次のエスケープ シーケンスと Unicode カテゴリに相当します: \f フォーム フィード文字、\u000C \n 改行文字、\u000A \r 復帰文字、\u000D \t タブ文字、\u0009 \v 垂直タブ文字、\u000B \x85 省略記号または NEXT LINE (NEL) 文字 (...)、\u0085 \p{Z} 任意の区切り文字に一致します ECMAScript 準拠の動作が指定されている場合、\s は [ \f\n\r\t\v] と同等です
ko: \s는 공백 문자와 일치시킵니다. 다음 이스케이프 시퀀스 및 유니코드 범주와 같습니다. \f 용지 공급 문자, \u000C \n 줄 바꿈 문자, \u000A \r 캐리지 리턴 문자, \u000D \t 탭 문자, \u0009 \v 세로 탭 문자, \u000B \x85 줄임표 또는 NEXT LINE(NEL) 문자(…), \u0085 \p{Z} 구분 문자와 일치시킵니다. ECMAScript와 호환되는 동작을 지정한 경우 \s는 [ \f\n\r\t\v]와 같습니다.
pl: Element \s pasuje do dowolnego znaku innego niż biały. Jest to równoważne następującym sekwencjom ucieczki i kategoriom Unicode: \f Znak wysuwu strony — \u000C \n Znak nowego wiersza — \u000A \r Znak powrotu karetki — \u000D \t Znak tabulacji — \u0009 \v Znak tabulacji pionowej — \u000B \x85 Znak wielokropka lub następnego wiersza (NEL), (…) — \u0085 \p{Z} Pasuje do dowolnego znaku separatora Jeśli określono zachowanie zgodne ze standardem ECMAScript, element \s jest równoważny elementowi [ \f\n\r\t\v]
pt_br: \s corresponde a qualquer caractere de espaço em branco. Ele equivale às seguintes sequências de escape e categorias Unicode: \f O caractere de avanço de página, \u000C \n O caractere de nova linha, \u000A \r O caractere de retorno de carro, \u000D \t O caractere de tabulação, \u0009 \v O caractere de tabulação vertical, \u000B \x85 A elipse ou o caractere NEL (NOVA LINHA) (...), \u0085 \p{Z} Corresponde a qualquer caractere separador Se o comportamento em conformidade com o ECMAScript for especificado, \s será equivalente a [ \f\n\r\t\v]
ru: \s соответствует любому символу пробела. Она эквивалентна следующим escape-последовательностям и категориям Юникода: \f символ перевода страницы, \u000C \n символ новой строки, \u000A \r символ возврата каретки, \u000D \t знак табуляции, \u0009 \v знак вертикальной табуляции, \u000B \x85 многоточие или символ NEXT LINE (NEL)(…), \u0085 \p{Z} соответствует любому символу-разделителю Если указано поведение, соответствующее ECMAScript, \s является эквивалентом [ \f\n\r\t\v]
tr: \s herhangi bir boşluk karakteriyle eşleşir. Aşağıdaki kaçış dizileri ve Unicode kategorileriyle eşdeğerdir: \f Sonraki sayfaya geçme karakteri: \u000C \n Yeni satır karakteri: \u000A \r Satır başı karakteri: \u000D \t Sekme karakteri: \u0009 \v Dikey sekme karakteri: \u000B \x85 Üç nokta veya SONRAKİ SATIR (NEL) karakteri (...): \u0085 \p{Z} Herhangi bir ayıraç karakteriyle eşleşir ECMAScript uyumlu davranış belirtilmişse, \s değeri [ \f\n\r\t\v] ile eşdeğerdir
zh_hans: \s 与任何空格字符匹配。它等效于以下转义序列和 Unicode 类别: \f 换页符 \u000C \n 换行符 \u000A \rr 回车符 \u000D \t 制表符 \u0009 \v 垂直制表符 \u000B \x85 省略号或下一行(NEL)字符(…) \u0085 \p{Z} 匹配任何分隔符字符 如果指定了符合 ECMAScript 的行为，则 \s 等效于 [ \f\n\r\t\v]
zh_hant: \s 符合所有空白字元。其相當於以下逸出序列和 Unicode 分類: \f 換頁字元，\u000C \n 新行字元，\u000A \r 歸位字元，\u000D \t 定位字元，\u0009 \v 垂直定位字元，\u000B \x85 省略符號或 NEXT LINE (NEL) 字元 (…)，\u0085 \p{Z} 符合所有分隔符號字元 如果有指定符合 ECMAScript 規範的行為，則 \s 相當於 [ \f\n\r\t\v]

# Regex_white_space_character_short
source: white-space character
cs: prázdný znak
de: Leerraumzeichen
es: carácter de espacio en blanco
fr: caractère d'espace blanc
it: spazio vuoto
ja: 空白文字
ko: 공백 문자
pl: biały znak
pt_br: o caractere de espaço em branco
ru: символ пробела
tr: boşluk karakteri
zh_hans: 空格字符
zh_hant: 空白字元

# Regex_word_boundary_long
source: The \b anchor specifies that the match must occur on a boundary between a word character (the \w language element) and a non-word character (the \W language element). Word characters consist of alphanumeric characters and underscores; a non-word character is any character that is not alphanumeric or an underscore. The match may also occur on a word boundary at the beginning or end of the string. The \b anchor is frequently used to ensure that a subexpression matches an entire word instead of just the beginning or end of a word.
cs: Ukotvení \b určuje, že ke shodě musí dojít na hranici mezi znakem slova (element jazyka \w) a znakem, který není znakem slova (element jazyka \W). Mezi znaky slova patří alfanumerické znaky a podtržítka. Znak, který není znakem slova, je jakýkoli znak, který není alfanumerický ani podtržítko. Ke shodě může dojít i na hranici slova na začátku nebo na konci řetězce. Ukotvení \b se často používá k ověření, že dílčí výraz odpovídá celému slovu, nikoli jenom začátku nebo konci slova.
de: Der \b-Anker gibt an, dass die Übereinstimmung an einer Grenze zwischen einem Wortzeichen (dem \w-Sprachelement) und einem Nicht-Wortzeichen (dem \W-Sprachelement) erfolgen muss. Wortzeichen bestehen aus alphanumerischen Zeichen und Unterstrichen; ein Nicht-Wortzeichen ist ein beliebiges Zeichen, das nicht alphanumerisch oder ein Unterstrich ist. Die Übereinstimmung kann auch an einer Wortgrenze am Anfang oder Ende der Zeichenfolge auftreten. Der \b-Anker wird häufig verwendet, um sicherzustellen, dass ein Teilausdruck mit einem ganzen Wort statt nur mit dem Anfang oder Ende eines Worts übereinstimmt.
es: El delimitador \b especifica que la coincidencia debe producirse en un límite entre un carácter de palabra (el elemento de lenguaje \w) y un carácter que no sea de palabra (el elemento del lenguaje \W). Los caracteres de palabra se componen de caracteres alfanuméricos y de subrayado; un carácter que no es de palabra es cualquier carácter que no sea alfanumérico o de subrayado. La coincidencia también puede producirse en un límite de palabra al principio o al final de la cadena. El delimitador \b se usa con frecuencia para garantizar que una subexpresión coincide con una palabra completa en lugar de solo con el principio o el final de una palabra.
fr: L'ancre \b spécifie que la correspondance doit se trouver à la limite située entre un caractère de mot (élément de langage \w) et un caractère de non-mot (élément de langage \W). Les caractères de mots sont constitués de caractères alphanumériques et de traits de soulignement. Un caractère de non-mot est un caractère qui n'est pas alphanumérique ou qui n'est pas un trait de soulignement. La correspondance peut également se produire à une limite de mot, au début ou à la fin de la chaîne. L'ancre \b est fréquemment utilisée pour vérifier qu'une sous-expression correspond à un mot entier, et non simplement au début ou à la fin d'un mot.
it: L'ancoraggio \b specifica che la corrispondenza deve verificarsi in un confine tra un carattere alfanumerico (elemento del linguaggio \w) e uno non alfanumerico (elemento del linguaggio \W). I caratteri alfanumerici sono costituiti da lettere, cifre e caratteri di sottolineatura. Un carattere non alfanumerico è qualsiasi carattere diverso da lettere, cifre e carattere di sottolineatura. La corrispondenza può verificarsi anche in un confine di parola all'inizio o alla fine della stringa. L'ancoraggio \b viene usato di frequente per garantire che una sottoespressione corrisponda a un'intera parola anziché solo all'inizio o alla fine di una parola.
ja: \b アンカーは、ワード文字 (\w 言語要素) と単語以外の文字 (\W 言語要素) の境界で一致する必要があることを示します。単語文字は英数字とアンダースコアで構成され、単語以外の文字は、英数字でもアンダースコアでもない任意の文字で構成されます。文字列の先頭または末尾にあるワード境界でも一致する可能性があります。 \b アンカーは、部分式を単語の先頭または末尾ではなく単語全体に一致させる目的で頻繁に使用されます。
ko: \b 앵커는 단어 문자(\w 언어 요소)와 단어가 아닌 문자(\W 언어 요소) 사이의 경계에서 일치 항목을 찾도록 지정합니다. 단어 문자는 영숫자 문자 및 밑줄로 구성되고, 단어가 아닌 문자는 영숫자나 밑줄이 아닌 모든 문자입니다. 문자열의 시작 또는 끝부분 단어 경계에서 일치 항목을 찾을 수도 있습니다. \b 앵커는 하위 식이 단어의 시작 또는 끝부분이 아닌 전체 단어를 일치시키도록 하는 데 자주 사용됩니다.
pl: Kotwica \b określa, że dopasowanie musi nastąpić na granicy między znakiem słowa (elementem języka \w) a znakiem innym niż słowa (elementem języka \W). Znaki słowa obejmują znaki alfanumeryczne i podkreślenia; znaki inne niż słowa obejmują wszystkie pozostałe znaki. Dopasowanie może także nastąpić na granicy słowa na początku lub na końcu ciągu. Kotwica \b jest często używana w celu zapewnienia, że podwyrażenie pasuje do całego wyrazu, a nie tylko na początku lub końcu słowa.
pt_br: A âncora \b especifica que a correspondência precisa ocorrer em um limite entre um caractere de palavra (o elemento de linguagem \w) e um caractere que não seja de palavra (o elemento de linguagem \W). Os caracteres de palavra consistem em caracteres alfanuméricos e sublinhados; um caractere que não é de palavra é qualquer caractere que não é alfanumérico nem sublinhado. A correspondência também pode ocorrer em um limite de palavra no início ou no fim da cadeia de caracteres. A âncora \b é usada geralmente para garantir que uma subexpressão corresponda a uma palavra inteira em vez de apenas ao início ou ao fim de uma palavra.
ru: Привязка \b указывает, что соответствие должно находиться между символом слова (элемент языка \w) и символом, не образующим слово, (элемент языка \W). Символы слова состоят из буквенно-цифровых символов и символов подчеркивания; не образующий слово символ — это любой символ, не являющийся буквенно-цифровым и символом подчеркивания. Соответствие также может находиться на границе слов в начале или конце строки. Привязка \b часто используется для обеспечения того, что часть строки соответствует всему слову, а не только его началу или концу.
tr: \b yer işareti, eşleşmenin bir sözcük karakteri (\w dil öğesi) ile sözcük olmayan bir karakter (\W dil öğesi) arasındaki bir sınırda oluşması gerektiğini belirtir. Sözcük karakterleri, alfasayısal karakterlerden ve alt çizgilerden oluşur; sözcük olmayan karakter, alfasayısal veya alt çizgi olmayan herhangi bir karakterdir. Ayrıca dizenin başlangıcında veya sonunda bulunan bir sözcük sınırında da eşleşme gerçekleşebilir. \b yer işareti, sıklıkla bir alt ifadenin yalnızca sözcüğün başı veya sonu yerine tüm sözcükle eşleştiğinden emin olmak için kullanılır.
zh_hans: \b 定位点指定匹配必须出现在字词字符(\w 语言元素)和非字词字符(\w 语言元素)之间的边界上。字词字符由字母数字字符和下划线组成；非字词字符是任何不是字母数字或下划线的字符。匹配也可能出现在字符串开头或结尾的字边界上。 \b 定位点经常用于确保子表达式匹配整个字而不只是匹配字的开头或结尾。
zh_hant: \b 錨點會指定比對必須出現於文字字元 (\w 語言元素) 和非文字字元 (\W 語言元素) 之間的邊界上。文字字元由英數字元和底線組成; 非文字字元則為英數字元或底線除外的任何字元。比對也可能出現於字串開頭或結尾的文字邊界上。 \b 錨點通常用來確保子運算式會比對整個字組，而不是只比對字組的開頭或結尾。

# Regex_word_boundary_short
source: word boundary
cs: hranice slova
de: Wortgrenze
es: límite de palabra
fr: limite de mot
it: confine di parola
ja: ワード境界
ko: 단어 경계
pl: granica słowa
pt_br: limite de palavra
ru: граница слов
tr: sözcük sınırı
zh_hans: 字边界
zh_hant: 字邊界

# Regex_word_character_long
source: \w matches any word character. A word character is a member of any of the following Unicode categories: Ll Letter, Lowercase Lu Letter, Uppercase Lt Letter, Titlecase Lo Letter, Other Lm Letter, Modifier Mn Mark, Nonspacing Nd Number, Decimal Digit Pc Punctuation, Connector If ECMAScript-compliant behavior is specified, \w is equivalent to [a-zA-Z_0-9]
cs: \w odpovídá jakémukoli znaku slova. Znak slova je členem libovolné z následujících kategorií Unicode: Ll písmeno, malá písmena Lu písmeno, velká písmena Lt písmeno, velká počáteční písmena Lo písmeno, jiné Lm písmeno, modifikátor Mn značka, bez mezer Nd číslo, desítkové číslo Pc interpunkce, spojovník Pokud je zadané chování kompatibilní s ECMAScriptem, je \w ekvivalentem [a-zA-Z_0-9].
de: "\w" entspricht einem beliebigen Wortzeichen. Ein Wortzeichen gehört zu einer der folgenden Unicode-Kategorien: Ll Buchstabe, Kleinbuchstabe Lu Buchstabe, Großbuchstabe Lt Buchstabe, erster Buchstabe groß Lo Buchstabe, sonstige Lm Buchstabe, Modifizierer Mn Zeichen, Zeichen ohne eigene Breite Nd Zahl, Dezimalzahl Pc Interpunktion, Verbindung Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\w" gleichbedeutend mit "[a-zA-Z_0-9]".
es: \w coincide con cualquier carácter de palabra. Un carácter de palabra forma parte de cualquiera de las siguientes categorías Unicode: Ll Letra, minúscula Lu Letra, mayúscula Lt Letra, tipo título Lo Letra, otros Lm Letra, modificador Mn Marca, no espaciado Nd Número, dígito decimal Pc Puntuación, conector Si se especifica un comportamiento compatible con ECMAScript, \w equivale a [a-zA-Z_0-9]
fr: \w correspond à n'importe quel caractère de mot. Un caractère de mot appartient à l'une des catégories Unicode suivantes : Ll Lettre, Minuscule Lu Lettre, Majuscule Lt Lettre, Première lettre des mots en majuscule Lo Lettre, Autre Lm Lettre, Modificateur Mn Marque, Sans espacement Nd Nombre, Chiffre décimal Pc Ponctuation, Connecteur Si vous spécifiez un comportement conforme à ECMAScript, \w équivaut à [a-zA-Z_0-9]
it: \w trova la corrispondenza di qualsiasi carattere alfanumerico. Un carattere alfanumerico è un membro di una delle categorie Unicode seguenti: Ll Letter, Lowercase Lu Letter, Uppercase Lt Letter, Titlecase Lo Letter, Other Lm Letter, Modifier Mn Mark, Nonspacing Nd Number, Decimal Digit Pc Punctuation, Connector Se viene specificato il comportamento conforme a ECMAScript, \w equivale a [a-zA-Z_0-9]
ja: \w は任意の単語文字に一致します。単語文字は、次に示すいずれかの Unicode カテゴリのメンバーです: Ll 文字、小文字 Lu 文字、大文字 Lt 文字、タイトル文字 Lo 文字、その他 Lm 文字、修飾子 Mn 結合文字、幅なし Nd 数字、10 進数字 Pc 句読点、接続 ECMAScript 準拠の動作が指定されている場合、\w は [a-zA-Z_0-9] と同等です
ko: \w는 단어 문자와 일치시킵니다. 단어 문자는 다음 유니코드 범주의 멤버입니다. Ll 문자, 소문자 Lu 문자, 대문자 Lt 문자, 첫 글자만 대문자 Lo 문자, 기타 Lm 문자, 한정자 Mn 표시, 공간을 차지하지 않는 문자 Nd 숫자, 10진수 Pc 문장 부호, 연결선 ECMAScript 규격 동작을 지정한 경우 \w는 [a-zA-Z_0-9]와 같습니다.
pl: Element \w pasuje do dowolnego znaku słowa. Znak słowa należy do dowolnej z następujących kategorii Unicode: Ll Litera, mała Lu Litera, wielka Lt Litera, jak nazwy własne Lo Litera, inna Lm Litera, modyfikator Mn Znacznik, nierozdzielający Nd Cyfra, cyfra dziesiętna Pc Interpunkcja, łącznik Jeśli określono zachowanie zgodne ze standardem ECMAScript, element \w jest równoważny elementowi [a-zA-Z_0-9].
pt_br: \w corresponde a qualquer caractere de palavra. Um caractere de palavra é membro de qualquer uma das seguintes categorias Unicode: Ll Letra, Minúscula Lu Letra, Maiúscula Lt Letra, Inicial Maiúscula Lo Letra, Outro Lm Letra, Modificador Mn Marca, Não Espaçamento Nd Número, Dígito Decimal Pc Pontuação, Conector Se o comportamento em conformidade com o ECMAScript for especificado, \w será equivalente a [a-zA-Z_0-9]
ru: \w соответствует любому символу слова. Символ слова относится к любой из следующих категорий Юникода: Ll буква, строчная Lu буква, прописная Lt буква, заглавная Lo буква, другая Lm буква, модификатор Mn метка, без пробела Nd число, десятичная цифра Pc пунктуация, соединитель Если указано поведение, соответствующее ECMAScript, \w является эквивалентом [a-zA-Z_0-9]
tr: \w herhangi bir sözcük karakteriyle eşleşir. Bir sözcük karakteri şu Unicode kategorilerden herhangi birinin üyesidir: Ll Harf, Küçük Harf Lu Harf, Büyük Harf Lt Harf, İlk Harfler Büyük Lo Harf, Diğer Lm Harf, Değiştirici Mn İşaret, Aralıksız Nd Numara, Ondalık Sayı Pc Noktalama, Bağlayıcı ECMAScript uyumlu davranış belirtilmişse, \w [a-zA-Z_0-9] ile eşdeğerdir
zh_hans: \w 匹配任何字词字符。字词字符是以下任何 Unicode 类别中的成员之一: Ll 字母，小写 Lu 字母，大写 Lt 字母，首字母大写 Lo 字母，其他 Lm 字母，修饰符 Mn 标记，非间距 Nd 数字，十进制数字 Pc 标点，连接符 如果指定了符合 ECMAScript 的行为，则 \w 等效于 [a-zA-Z_0-9]
zh_hant: \w 符合所有字組字元。字組字元是以下任一 Unicode 分類的成員: Ll 字母，小寫 Lu 字母，大寫 Lt 字母，字首大寫 Lo 字母，其他 Lm 字母，修飾元 Mn 標記，非空格 Nd 數字，十進位數字 Pc 標點符號，接頭 如果有指定符合 ECMAScript 規範的行為，則 \w 相當於 [a-zA-Z_0-9]

# Regex_word_character_short
source: word character
cs: znak slova
de: Wortzeichen
es: carácter de palabra
fr: caractère de mot
it: carattere alfanumerico
ja: 単語文字
ko: 단어 문자
pl: znak słowa
pt_br: caractere de palavra
ru: символ слова
tr: sözcük karakteri
zh_hans: 字词字符
zh_hant: 文字字元

# Regex_yes
source: yes
cs: ano
de: Ja
es: sí
fr: oui
it: sì
ja: はい
ko: 예
pl: tak
pt_br: sim
ru: да
tr: evet
zh_hans: 是
zh_hant: 是
