Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# utc_hour_offset_2_digits_description
source: With DateTime values, the "zz" custom format specifier represents the signed offset of the local operating system's time zone from UTC, measured in hours. It doesn't reflect the value of an instance's DateTime.Kind property. For this reason, the "zz" format specifier is not recommended for use with DateTime values. With DateTimeOffset values, this format specifier represents the DateTimeOffset value's offset from UTC in hours. The offset is always displayed with a leading sign. A plus sign (+) indicates hours ahead of UTC, and a minus sign (-) indicates hours behind UTC. A single-digit offset is formatted with a leading zero.
cs: U hodnot DateTime specifikátor vlastního formátu zz představuje posun časového pásma místního operačního systému od UTC se znaménkem, který se měří v hodinách. Neodráží hodnotu vlastnosti DateTime.Kind instance. Z toho důvodu se specifikátor formátu zz nedoporučuje používat s hodnotami DateTime. U hodnot DateTimeOffset tento specifikátor formátu představuje posun hodnoty DateTimeOffset od času UTC v hodinách. Posun se vždy zobrazuje se znaménkem na začátku. Znaménko plus (+) označuje hodiny před UTC a znaménko minus (-) pak hodiny za UTC. Posun s jednou číslicí se formátuje s nulou na začátku.
de: Bei DateTime-Werten repräsentiert der benutzerdefinierte Formatbezeichner "zz" die Abweichung (einschließlich Vorzeichen) der Zeitzone des lokalen Betriebssystems von der koordinierten Weltzeit (UTC), gemessen in Stunden. Er spiegelt nicht den Wert einer Instanz der DateTime.Kind-Eigenschaft wider. Aus diesem Grund wird der Formatbezeichner "zz" nicht zur Verwendung mit DateTime-Werten empfohlen. Bei DateTimeOffset-Werten stellt dieser Formatbezeichner die Abweichung des DateTimeOffset-Wertes von UTC in Stunden dar. Die Abweichung wird immer mit einem Vorzeichen angezeigt. Ein Pluszeichen (+) steht für Stunden vor UTC, ein Minuszeichen (-) für Stunden nach UTC. Eine einstellige Abweichung wird mit einer führenden Null formatiert.
es: Con valores de DateTime, el especificador de formato personalizado "zz" representa el desfase con signo de la zona horaria del sistema operativo local respecto a la hora UTC, medido en horas. No refleja el valor de la propiedad DateTime.Kind de una instancia. Por este motivo, no se recomienda usar el especificador de formato "zz" con valores de DateTime. Con valores de DateTimeOffset, este especificador de formato representa el desfase del valor DateTimeOffset con respecto a la hora UTC en horas. El desfase se muestra siempre con un signo delante. Un signo más (+) indica las horas de adelanto respecto a la hora UTC y un signo menos (-) indica las horas de retraso respecto a la hora UTC. Cuando el desfase es de un solo dígito, se le pone un cero delante.
fr: Avec les valeurs DateTime, le spécificateur de format personnalisé "zz" représente le décalage signé du fuseau horaire du système d'exploitation local par rapport à l'heure UTC, en heures. Il ne reflète pas la valeur de la propriété DateTime.Kind d'une instance. C'est la raison pour laquelle l'utilisation du spécificateur de format "zz" n'est pas recommandée avec les valeurs DateTime. Avec les valeurs DateTimeOffset, ce spécificateur de format représente le décalage de la valeur DateTimeOffset par rapport à l'heure UTC, en heures. Le décalage est toujours affiché avec un signe de début. Le signe plus (+) indique les heures d'avance par rapport à l'heure UTC, et le signe moins (-) indique les heures de retard par rapport à l'heure UTC. Un décalage à un chiffre est présenté dans un format qui comporte un zéro de début.
it: Con valori DateTime, l'identificatore di formato personalizzato "zz" rappresenta la differenza dall'ora UTC con segno del fuso orario del sistema operativo locale, misurata in ore. Non rispecchia il valore della proprietà DateTime.Kind di un'istanza. Per questo motivo, non è consigliabile usare l'identificatore di formato "zz" con valori DateTime. Con valori DateTimeOffset, questo identificatore di formato rappresenta la differenza dall'ora UTC del valore DateTimeOffset in ore. La differenza viene sempre visualizzata con un segno iniziale. Un segno più (+) indica le ore in più e un segno meno (-) le ore in meno rispetto all'ora UTC. Un valore di differenza a una sola cifra viene formattato con uno zero iniziale.
ja: DateTime 値で使用した場合、"zz" カスタム書式指定子は、オペレーティング システムのローカル タイム ゾーンの、UTC を基準とした符号付きオフセット (時間単位) を表します。インスタンスの DateTime.Kind プロパティの値は反映されません。このため、DateTime 値に対して "zz" 書式指定子を使用することはお勧めしません。 DateTimeOffset 値で使用した場合、この書式指定子は DateTimeOffset 値の UTC を基準とするオフセット (時間単位) を表します。 このオフセットは、常に先頭の符号と共に表示されます。プラス記号 (+) は UTC より時間が進んでいることを示し、マイナス記号 (-) は UTC よりも時間が遅れていることを示します。1 桁のオフセットは、先行ゼロ付きで書式設定されます。
ko: DateTime 값의 경우, "zz" 사용자 지정 형식 지정자는 UTC에서 가져온 로컬 운영 체제의 표준 시간대의 부호 있는 오프셋을 나타내며(단위: 시간), 인스턴스의 DateTime.Kind 속성의 값을 반영하지 않습니다. 따라서 DateTime 값과 함께 "zz" 형식 지정자를 사용하는 것은 권장되지 않습니다. DateTimeOffset 값의 경우, 이 형식 지정자는 UTC에서 가져온 DateTimeOffset 값의 오프셋을 나타냅니다(단위: 시간). 오프셋은 항상 앞에 있는 부호와 함께 표시됩니다. 더하기 부호(+)는 UTC보다 앞선 시간을, 빼기 부호(-)는 UTC보다 늦은 시간을 나타냅니다. 한 자릿수 오프셋은 앞에 0이 있는 형식으로 지정됩니다.
pl: W przypadku wartości DateTime niestandardowy specyfikator formatu „zz” reprezentuje przesunięcie ze znakiem strefy czasowej lokalnego systemu operacyjnego względem czasu UTC wyrażone w godzinach. Nie uwzględnia on wartości właściwości DateTime.Kind wystąpienia. Z tego powodu nie zaleca się użycia specyfikatora formatu „zz” z wartościami DateTime. W przypadku wartości DateTimeOffset ten specyfikator formatu reprezentuje przesunięcie wartości DateTimeOffset względem czasu UTC w godzinach. Przesunięcie jest zawsze wyświetlane ze znakiem wiodącym. Znak plus (+) wskazuje godzinę po czasie UTC, a znak minus (-) wskazuje godzinę przed czasem UTC. Jednocyfrowa wartość przesunięcia jest formatowana przy użyciu wiodącego zera.
pt_br: Com valores DateTime, o especificador de formato personalizado "zz" representa o deslocamento assinado do fuso horário do sistema operacional local do UTC, medido em horas. Ele não reflete o valor da propriedade DateTime.Kind de uma instância. Por esse motivo, o especificador de formato "zz" não é recomendado para uso com valores DateTime. Com os valores de DateTimeOffset, este especificador de formato representa o deslocamento do valor de DateTimeOffset do UTC em horas. O deslocamento é sempre exibido com um sinal à esquerda. Um sinal de adição (+) indica horas à frente do UTC e um sinal de subtração (-) indica horas atrás do UTC. Um deslocamento de dígito único é formatado com um zero à esquerda.
ru: При использовании значений типа DateTime описатель пользовательского формата "zz" представляет значение смещения локального часового пояса операционной системы от UTC, имеющее знак и измеряемое в часах. Оно не отражает значение свойства DateTime.Kind экземпляра. Поэтому описатель формата "zz" не рекомендуется использовать со значениями DateTime. При использовании значений DateTimeOffset этот описатель формата представляет смещение значения DateTimeOffset от UTC в часах. Смещение всегда отображается с предшествующим знаком. Знак "плюс" (+) обозначает часы опережения UTC, а знак "минус" (-) — часы отставания от UTC. Смещение из одной цифры форматируется с начальным нулем.
tr: DateTime değerlerinde, "zz" özel biçim belirticisi, yerel işletim sisteminin saat diliminin UTC'den (saat cinsinden) işaretli uzaklığını gösterir. Bir örneğin DateTime.Kind özelliğinin değerini yansıtmaz. Bu nedenle, "zz" biçim belirticisinin DateTime değerleriyle kullanılması önerilmez. DateTimeOffset değerlerinde, bu biçim belirticisi, DateTimeOffset değerinin saat cinsinden UTC'den uzaklığını temsil eder. Uzaklık her zaman başında bir işaretle görüntülenir. Artı işareti (+) UTC'den önceki, eksi işareti (-) ise UTC'den sonraki saatleri gösterir. Tek haneli bir uzaklık, başına bir sıfır eklenerek biçimlendirilir.
zh_hans: 对于 DateTime 值，"zz" 自定义格式说明符表示本地操作系统的时区与 UTC 之间的有符号偏移量(以小时为单位)。它不反映实例的 DateTime.Kind 属性的值。因此，建议不要将 "zz" 格式说明符与 DateTime 值一起使用。 对于 DateTimeOffset 值，此格式说明符表示 DateTimeOffset 值与 UTC 的偏移量(以小时为单位)。 偏移量始终显示为带前导的符号。加号(+)表示小时数早于 UTC，减号(-)表示小时数迟于 UTC。一位数字的偏移量设置为带前导零的格式。
zh_hant: 使用 DateTime 值時，"zz" 自訂格式規範代表區域作業系統時區與 UTC 的帶正負號時差 (以小時為單位)，且不會反映出執行個體的 DateTime.Kind 屬性值。因此，建議不要搭配 DateTime 值使用 "zz" 格式規範。 對 DateTimeOffset 值而言，這個格式規範代表 DateTimeOffset 值的 UTC 時差 (以小時為單位)。 時差的開頭永遠會顯示正負號。正號 (+) 表示早於 UTC 的小時數，負號 (-) 則表示晚於 UTC 的小時數。個位數的時差開頭會填補零。

source: while loop
cs: smyčka while
de: „while“-Schleife
es: bucle while
it: ciclo while
ja: while ループ
ko: while 루프
pl: pętla while
pt_br: loop while
ru: Цикл while
tr: while döngüsü
zh_hans: while 循环

source: [x-y] range in reverse order
cs: Rozsah [x-y] je v obráceném pořadí.
de: [x-y]-Bereich in umgekehrter Reihenfolge
es: rango [x-y] en orden inverso
fr: Intervalle [x-y] dans l'ordre inverse
it: Intervallo [x-y] in ordine inverso
ja: [x-y] 範囲の順序が逆です
ko: [x-y] 범위가 역순으로 되어 있습니다.
pl: Zakres [x-y] w odwrotnej kolejności
pt_br: intervalo [x-y] em ordem inversa
ru: Диапазон [x-y] в обратном порядке
tr: [x-y] aralığı ters sırada
zh_hans: 按相反顺序排列的 [x-y] 范围
zh_hant: 反向排序的 [x-y] 範圍

source: year (1-2 digits)
cs: rok (1–2 číslice)
de: Jahr (1–2 Stellen)
es: año (1-2 dígitos)
fr: année (1 à 2 chiffres)
it: Anno (1-2 cifre)
ja: 年 (1 ～ 2 桁)
ko: 년(1~2자리)
pl: rok (1-2 cyfry)
pt_br: ano (1-2 dígitos)
ru: год (1–2 цифры)
tr: yıl (1-2 rakam)
zh_hans: 年(1-2 位数)
zh_hant: 年份 (1-2 位數)

# year_1_2_digits_description
source: The "y" custom format specifier represents the year as a one-digit or two-digit number. If the year has more than two digits, only the two low-order digits appear in the result. If the first digit of a two-digit year begins with a zero (for example, 2008), the number is formatted without a leading zero. If the "y" format specifier is used without other custom format specifiers, it's interpreted as the "y" standard date and time format specifier.
cs: Specifikátor vlastního formátu y reprezentuje rok jako jedno- nebo dvoumístné číslo. Pokud má rok více než dvě číslice, ve výsledku se budou nacházet jen dvě číslice nižšího řádu. Pokud první číslice dvoumístného roku začíná nulou (třeba 2008), číslo se formátuje bez nuly na začátku. Pokud se specifikátor formátu y použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času y.
de: Der benutzerdefinierte Formatbezeichner "y" repräsentiert das Jahr als ein- oder zweistellige Zahl. Wenn das Jahr mehr als zwei Stellen aufweist, werden im Ergebnis nur die zwei niederwertigen Stellen angezeigt. Beginnt die erste Stelle eines zweistelligen Jahres mit einer Null (z. B. 2008), wird die Zahl ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "y" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "y" für Datums- und Uhrzeitwerte interpretiert.
es: El especificador de formato personalizado "y" representa el año como un número de uno o dos dígitos. Si el año tiene más de dos dígitos, en el resultado solo aparecen los dos dígitos de orden inferior. Si el primer dígito de un año de dos dígitos es un cero (por ejemplo, 2008), no se le pone un cero delante al número. Si el especificador de formato "y" se usa sin otros especificadores de formato personalizados, se interpreta como el especificador de formato de fecha y hora estándar "y".
fr: Le spécificateur de format personnalisé "y" représente l'année sous la forme d'un nombre à un ou deux chiffres. Si l'année comporte plus de deux chiffres, seuls les deux chiffres de poids faible apparaissent dans le résultat. Si le premier chiffre d'une année à deux chiffres commence par un zéro (par exemple 2008), le nombre est présenté dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "y" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "y".
it: L'identificatore di formato personalizzato "y" rappresenta l'anno come numero a una cifra o a due cifre. Se l'anno ha più di due cifre, nel risultato vengono visualizzate solo le due cifre di ordine inferiore. Se la prima cifra di un anno a due cifre inizia con zero (ad esempio, 2008), il numero viene formattato senza zero iniziale. Se l'identificatore di formato "y" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "y".
ja: "Y" カスタム書式指定子は、年を1桁または2桁の数値として表します。年が2桁を超える場合は、2桁の下位桁のみが結果に表示されます。2桁の年の最初の桁がゼロで始まる場合 (たとえば 2008)、先頭に0を付けずに数値を書式設定します。 "Y" 書式指定子が、その他のカスタム書式指定子なしで使用されている場合、"y" は標準の日時書式指定子として解釈されます。
ko: "y" 사용자 지정 형식 지정자는 연도를 한 자릿수 또는 두 자릿수 숫자로 나타냅니다. 연도에 세 자릿수 이상이 있는 경우 결과에는 최하위 숫자 2개만 표시됩니다. 두 자릿수 연도의 첫 번째 숫자가 0으로 시작하면(예: 2008) 숫자는 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "y" 형식 지정자를 사용하면 "y" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Niestandardowy specyfikator formatu „y” reprezentuje rok w postaci liczby składającej się z jednej lub dwóch cyfr. Jeśli rok składa się z więcej niż dwóch cyfr, w wyniku pojawiają się tylko dwie najmniej znaczące cyfry. Jeśli pierwsza cyfra roku dwucyfrowego zaczyna się od zera (na przykład 2008), liczba jest formatowana bez zera wiodącego. Jeśli specyfikator formatu „y” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny „y”.
pt_br: O especificador de formato personalizado "y" representa o ano como um número de um ou dois dígitos. Se o ano tiver mais de dois dígitos, somente os dois dígitos de ordem baixa aparecerão no resultado. Se o primeiro dígito de um ano de dois dígitos começar com zero (por exemplo, 2008), o número será formatado sem um zero à esquerda. Se o especificador de formato "y" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "y".
ru: Описатель пользовательского формата "y" представляет год как число из одной или двух цифр. Если в значении года больше двух цифр, в результате появятся только два младших разряда. Если первый разряд такого двузначного года является нулевым (например, 2008), число форматируется без начального нуля. Если описатель формата "y" используется без других описателей пользовательского формата, он интерпретируется как описатель "y" стандартного формата даты и времени.
tr: "y" özel biçim belirticisi yılı bir rakamlı veya iki rakamlı bir sayı ile temsil eder. Yılda ikiden fazla rakam varsa, sonuçta yalnızca iki düşük değerli rakam görüntülenir. İki rakamlı bir yılın ilk rakamı sıfırsa (örneğin 2008), sayı başına sıfır eklenmeden biçimlendirilir. "y" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçimi belirticisi olarak yorumlanır.
zh_hans: "Y" 自定义格式说明符将年份表示为一位数字或两位数的数字。如果年份具有两个以上的数字，则结果中仅显示两个低序位数字。如果两位数年份的第一个数字以零开头(例如 2008)，则该数字的格式没有前导零。 如果使用 "y" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "y" 标准日期和时间格式说明符。
zh_hant: "y" 自訂格式規範會將年份表示為個位數或雙位數數字。如果該年份超過雙位數，則結果只會顯示到十位數。如果雙位數年份的第一個位數開頭為零 (例如 2008)，則該數字開頭不會填補零。 如果使用 "y" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為 "y" 標準日期和時間格式規範。

source: year (2 digits)
cs: rok (2 číslice)
de: Jahr (2 Stellen)
es: año (2 dígitos)
fr: année (2 chiffres)
it: Anno (2 cifre)
ja: 年 (2 桁)
ko: 년(2자리)
pl: rok (2 cyfry)
pt_br: ano (2 dígitos)
ru: год (2 цифры)
tr: yıl (2 rakam)
zh_hans: 年(2 位数)
zh_hant: 年份 (2 位數)
