Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Use_locally_installed_0_version_1_This_version_used_in_colon_2
source: Use locally installed '{0}' version '{1}' This version used in: {2}
cs: Použít místně nainstalovanou {0} verzi {1}. Tato verze se používá zde: {2}.
de: Lokal installierte Version "{1}" von "{0}" verwenden. Diese Version wird verwendet in: {2}
es: Usar la versión '{0}' instalada localmente '{1}' Esta versión se utiliza en: {2}
fr: Utiliser la version installée localement '{0}' '{1}' Version utilisée dans : {2}
it: Usa la versione '{1}' di '{0}' installata in locale Questa versione è usata {2}
ja: ローカルにインストールされた '{0}' バージョン '{1}' を使います このバージョンは {2} で使われています
ko: 로컬에 설치된 '{0}' 버전 '{1}' 사용 이 버전 사용 대상: {2}
pl: Użyj lokalnie zainstalowanej wersji „{0}” („{1}”) Ta wersja jest używana wersja: {2}
pt_br: Use a versão '{0}' instalada localmente '{1}' Essa versão é usada no: {2}
ru: Использовать локально установленное ПО "{0}" версии "{1}" Эта версия используется в: {2}
tr: '{0}' uygulamasının yerel olarak yüklü '{1}' sürümünü kullanın Bu sürüm şurada kullanılır: {2}
zh_hans: 使用本地安装的“{0}”版本“{1}” 此版本用于: {2}
zh_hant: 使用安裝於本機的 '{0}' 版本 '{1}' 此版本用於: {2}

source: Find and install latest version of '{0}'
cs: Najít a nainstalovat nejnovější verzi aplikace {0}
de: Nach aktueller Version von "{0}" suchen und diese installieren
es: Buscar e instalar la última versión de '{0}'
fr: Rechercher et installer la dernière version de '{0}'
it: Trova e installa l'ultima versione di '{0}'
ja: '{0}' の最新バージョンの検索とインストール
ko: '{0}'의 최신 버전 찾기 및 설치
pl: Znajdź i zainstaluj najnowszą wersję pakietu „{0}”
pt_br: Localizar e instalar a versão mais recente de '{0}'
ru: Найти и установить последнюю версию "{0}"
tr: Son '{0}' sürümünü bul ve yükle
zh_hans: 查找并安装最新版本的“{0}”
zh_hant: 尋找並安裝 '{0}' 的最新版本

source: Install with package manager...
cs: Nainstalovat s použitím Správce balíčků...
de: Mit Paket-Manager installieren...
es: Instalar con el Administrador de paquetes...
fr: Installer avec le gestionnaire de package...
it: Installa con Gestione pacchetti...
ja: パッケージ マネージャーを使ってインストール...
ko: 패키지 관리자를 사용하여 설치...
pl: Zainstaluj za pomocą menedżera pakietów...
pt_br: Instalar com o gerenciador de pacotes...
ru: Установить с помощью диспетчера пакетов...
tr: Paket yöneticisi ile yükle...
zh_hans: 使用包管理器安装...
zh_hant: 使用套件管理員安裝...

source: Install '{0} {1}'
cs: Nainstalovat {0} {1}
de: "{0} {1}" installieren
es: Instalar '{0} {1}'
fr: Installer '{0} {1}'
it: Installa '{0} {1}'
ja: {0} {1}' のインストール
ko: {0} {1}' 설치
pl: Zainstaluj pakiet „{0} {1}”
pt_br: Instalar '{0} {1}'
ru: Установить "{0} {1}"
tr: Şunu yükle: '{0} {1}'
zh_hans: 安装“{0} {1}”
zh_hant: 安裝 '{0} {1}'

source: Install version '{0}'
cs: Nainstalovat verzi {0}
de: Version "{0}" installieren
es: Instalar la versión '{0}'
fr: Installer la version '{0}'
it: Installa la versione '{0}'
ja: バージョン '{0}' のインストール
ko: '{0}' 버전 설치
pl: Zainstaluj wersję „{0}”
pt_br: Instalar a versão '{0}'
ru: Установить версию "{0}"
tr: '{0}' sürümünü yükle
zh_hans: 安装版本“{0}”
zh_hant: 安裝 '{0}' 版

source: Generate variable '{0}'
de: Variable "{0}" generieren
fr: Générer la variable '{0}'
it: Genera la variabile '{0}'
ja: 変数 '{0}' を生成する
tr: '{0}' değişkenini oluştur
zh_hans: 生成变量 {0}
zh_hant: 產生變數 '{0}'

source: Classes
cs: Třídy
de: Klassen
es: Clases
it: Classi
ja: クラス
ko: 클래스
pl: Klasy
ru: Классы
tr: Sınıflar
zh_hans: 类
zh_hant: 類別

source: Constants
cs: Konstanty
de: Konstanten
es: Constantes
fr: Constantes
it: Costanti
ja: 定数
ko: 상수
pl: Stałe
pt_br: Constantes
ru: Константы
tr: Sabitler
zh_hans: 常量
zh_hant: 常數

source: Delegates
cs: Delegáti
de: Delegaten
es: Delegados
fr: Délégués
it: Delegati
ja: デリゲート
ko: 대리자
pl: Delegaci
pt_br: Delega
ru: Делегаты
tr: Temsilciler
zh_hans: 委托
zh_hant: 委派

source: Enums
cs: Výčty
de: Enumerationen
es: Enumeraciones
it: Enumerazioni
ja: 列挙型
ko: 열거형
pl: Wyliczenia
ru: Перечисления
tr: Sabit Listeleri
zh_hans: 枚举
zh_hant: 列舉

source: Events
cs: Události
de: Ereignisse
es: Eventos
fr: Événements
it: Eventi
ja: イベント
ko: 이벤트
pl: Zdarzenia
pt_br: Eventos
ru: События
tr: Olaylar
zh_hans: 事件
zh_hant: 事件

source: Extension methods
cs: Metody rozšíření
de: Erweiterungsmethoden
es: Métodos de extensión
fr: Méthodes d'extension
it: Metodi di estensione
ja: 拡張メソッド
ko: 확장 메서드
pl: Metody rozszerzenia
pt_br: Métodos de extensão
ru: Методы расширения
tr: Genişletme metotları
zh_hans: 扩展方法
zh_hant: 擴充方法

source: Fields
cs: Pole
de: Felder
es: Campos
fr: Champs
it: Campi
ja: フィールド
ko: 필드
pl: Pola
pt_br: Campos
ru: Поля
tr: Alanlar
zh_hans: 字段
zh_hant: 欄位

source: Interfaces
cs: Rozhraní
de: Schnittstellen
it: Interfacce
ja: インターフェイス
ko: 인터페이스
pl: Interfejsy
ru: Интерфейсы
tr: Arabirimler
zh_hans: 接口
zh_hant: 介面

source: Methods
cs: Metody
de: Methoden
es: Métodos
fr: Méthodes
it: Metodi
ja: メソッド
ko: 메서드
pl: Metody
pt_br: Métodos
ru: Методы
tr: Metotlar
zh_hans: 方法
zh_hant: 方法

source: Modules
cs: Moduly
de: Module
es: Módulos
it: Moduli
ja: モジュール
ko: 모듈
pl: Moduły
pt_br: Módulos
ru: Модули
tr: Modüller
zh_hans: 模块
zh_hant: 模組

source: Namespaces
cs: Obory názvů
es: Espacios de nombres
fr: Espaces de noms
it: Spazi dei nomi
ja: 名前空間
ko: 네임스페이스
pl: Przestrzenie nazw
ru: Пространства имен
tr: Ad Uzayları
zh_hans: 命名空间
zh_hant: 命名空間

source: Properties
cs: Vlastnosti
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pl: Właściwości
pt_br: Propriedades
ru: Свойства
tr: Özellikler
zh_hans: 属性
zh_hant: 屬性

source: Structures
cs: Struktury
de: Strukturen
es: Estructuras
it: Strutture
ja: 構造
ko: 구조
pl: Struktury
pt_br: Estruturas
ru: Структуры
tr: Yapılar
zh_hans: 结构
zh_hant: 結構

# Parameters_colon
source: Parameters:
cs: Parametry:
de: Parameter:
es: Parámetros:
fr: Paramètres :
it: Parametri:
ja: パラメーター:
ko: 매개 변수:
pl: Parametry:
pt_br: Parâmetros:
ru: Параметры:
tr: Parametreler:
zh_hans: 参数:
zh_hant: 參數:

source: Variadic SignatureHelpItem must have at least one parameter.
cs: Variadické SignatureHelpItem musí mít nejmíň jeden parametr.
de: Variadic-SignatureHelpItem muss mindestens ein Parameter aufweisen.
es: El elemento variádico SignatureHelpItem debe tener al menos un parámetro.
fr: L'élément SignatureHelpItem variadique doit avoir au moins un paramètre.
it: L'elemento SignatureHelpItem variadic deve avere almeno un parametro.
ja: 可変個引数 SignatureHelpItem は、少なくとも 1 つのパラメーターが必要です。
ko: Variadic SignatureHelpItem에는 매개 변수가 하나 이상 있어야 합니다.
pl: Element SignatureHelpItem ze zmienną liczbą argumentów musi mieć co najmniej jeden parametr.
pt_br: Variadic SignatureHelpItem deve ter pelo menos um parâmetro.
ru: Variadic SignatureHelpItem должен иметь хотя бы один параметр.
tr: Bağımsız değişken içeren SignatureHelpItem en az bir parametreye sahip olmalıdır.
zh_hans: 可变参数 SignatureHelpItem 必须有至少一个参数。
zh_hant: Variadic SignatureHelpItem 至少必須要有一個參數。

source: Replace '{0}' with method
cs: Nahradit {0} metodou
de: "{0}" durch Methode ersetzen
es: Reemplazar '{0}' por un método
fr: Remplacer '{0}' par une méthode
it: Sostituisci '{0}' con il metodo
ja: '{0}' をメソッドに置換します
ko: '{0}'을(를) 메서드로 대체
pl: Zastąp element „{0}” metodą
pt_br: Substituir '{0}' com método
ru: Заменить "{0}" методом
tr: '{0}' yerine metot kullan
zh_hans: 将“{0}”替换为方法
zh_hant: 以方法取代 '{0}'

source: Replace '{0}' with methods
cs: Nahradit {0} metodami
de: "{0}" durch Methoden ersetzen
es: Reemplazar '{0}' por métodos
fr: Remplacer '{0}' par des méthodes
it: Sostituisci '{0}' con i metodi
ja: '{0}' をメソッドに置換します
ko: '{0}'을(를) 메서드로 대체
pl: Zastąp element „{0}” metodami
pt_br: Substituir '{0}' com métodos
ru: Заменить "{0}" методами
tr: '{0}' yerine metotlar kullan
zh_hans: 将“{0}”替换为方法
zh_hant: 以方法取代 '{0}'

source: Property referenced implicitly
cs: Na vlastnost se odkazuje implicitně.
de: Auf die Eigenschaft wird implizit verwiesen.
es: Propiedad a la que se hace referencia de forma implícita
fr: Propriété référencée implicitement
it: Proprietà con riferimenti impliciti
ja: 暗黙的に参照されているプロパティ
ko: 속성이 암시적으로 참조됩니다.
pl: Niejawne odwołanie do właściwości
pt_br: Propriedade referenciada implicitamente
ru: На свойство имеется неявная ссылка
tr: Özelliğe örtülü olarak başvurdu
zh_hans: 隐式引用的属性
zh_hant: 隱含參考的屬性

source: Property cannot safely be replaced with a method call
cs: Vlastnost se nedá bezpečně nahradit voláním metody.
de: Die Eigenschaft kann nicht sicher durch einen Methodenaufruf ersetzt werden.
es: La propiedad no se puede reemplazar por una llamada a un método de forma segura
fr: Impossible de remplacer la propriété de manière sécurisée par un appel de méthode
it: Non è possibile sostituire in modo sicuro la proprietà con una chiamata a un metodo
ja: プロパティをメソッド呼び出しに安全に置換することはできません
ko: 속성을 메서드 호출로 안전하게 대체할 수 없습니다.
pl: Właściwości nie można bezpiecznie zastąpić wywołaniem metody
pt_br: A propriedade não pode ser substituída com segurança com uma chamada de método
ru: Свойство нельзя безопасно заменить на вызов метода
tr: Özellik, bir metot çağrısı ile güvenli şekilde değiştirilemiyor
zh_hans: 不能将属性安全地替换为方法调用
zh_hant: 以方法呼叫取代屬性並不安全

source: Convert to interpolated string
cs: Převést na interpolovaný řetězec
de: In interpolierte Zeichenfolge konvertieren
es: Convertir a cadena interpolada
fr: Convertir en chaîne interpolée
it: Converti in stringa interpolata
ja: 補間された文字列に変換する
ko: 보간된 문자열로 변환
pl: Konwertuj na ciąg interpolowany
pt_br: Converter para cadeia de caracteres interpolada
ru: Преобразовать в интерполированную строку
tr: Araya alınmış dizeye dönüştür
zh_hans: 转换为插补字符串
zh_hant: 轉換為差補字串

source: Move type to {0}
cs: Přesunout typ do {0}
de: Typ in {0} verschieben
es: Mover tipo a {0}
fr: Déplacer le type vers {0}
it: Sposta il tipo in {0}
ja: 型を {0} に移動
ko: {0}(으)로 형식 이동
pl: Przenieś typ do {0}
pt_br: Mover tipo para {0}
ru: Переместить тип в {0}
tr: Türü {0} ile değiştir
zh_hans: 将类型移动到 {0}
zh_hant: 將類型移到 {0}

source: Rename file to {0}
cs: Přejmenovat soubor na {0}
de: Datei umbenennen in {0}
es: Cambiar nombre de archivo por {0}
fr: Renommer le fichier en {0}
it: Rinomina il file in {0}
ja: ファイル名を {0} に変更
ko: {0}(으)로 파일 이름 바꾸기
pl: Zmień nazwę pliku na {0}
pt_br: Renomear arquivo para {0}
ru: Переименовать файл в {0}
tr: Dosyayı {0} olarak yeniden adlandır
zh_hans: 将文件重命名为 {0}
zh_hant: 將檔案重新命名為 {0}

source: Rename type to {0}
cs: Přejmenovat typ na {0}
de: Typ umbenennen in {0}
es: Cambiar nombre de tipo por {0}
fr: Renommer le type en {0}
it: Rinomina il tipo in {0}
ja: 型の名前を {0} に変更
ko: {0}(으)로 형식 이름 바꾸기
pl: Zmień nazwę typu na {0}
pt_br: Renomear tipo para {0}
ru: Переименовать тип в {0}
tr: Tür {0} olarak yeniden adlandır
zh_hans: 将类型重命名为 {0}
zh_hant: 將類型重新命名為 {0}

# paren_Unknown_paren
source: (Unknown)
cs: (neznámé)
de: (Unbekannt)
es: (Desconocido)
fr: (Inconnu)
it: (Sconosciuto)
ja: (不明)
ko: (알 수 없음)
pl: (Nieznany)
pt_br: (Desconhecido)
ru: (Неизвестно)
tr: (Bilinmiyor)
zh_hans: (未知)
zh_hant: (未知)

source: Use framework type
cs: Použít typ architektury
de: Frameworktyp verwenden
es: Usar tipo de marco de trabajo
fr: Utiliser un type d'infrastructure
it: Usa il tipo di framework
ja: フレームワークの型を使用する
ko: Framework 형식 사용
pl: Użyj typu platformy
pt_br: Usar o tipo de estrutura
ru: Использовать тип платформы
tr: Çerçeve türü kullan
zh_hans: 使用框架类型
zh_hant: 使用架構類型

source: Install package '{0}'
cs: Nainstalovat balíček {0}
de: Paket "{0}" installieren
es: Instalar paquete '{0}'
fr: Installer le package '{0}'
it: Installa il pacchetto '{0}'
ja: パッケージ '{0}' のインストール
ko: '{0}' 패키지 설치
pl: Zainstaluj pakiet „{0}“
pt_br: Instalar o pacote '{0}'
ru: Установить пакет "{0}"
tr: '{0}' paketini yükle
zh_hans: 安装包“{0}”
zh_hant: 安裝套件 '{0}'

source: project {0}
cs: projekt {0}
de: Projekt "{0}"
es: proyecto {0}
fr: projet {0}
it: progetto {0}
ja: プロジェクト {0}
ko: 프로젝트 {0}
pl: projekt {0}
pt_br: projeto {0}
ru: проект: {0}
tr: proje {0}
zh_hans: 项目 {0}
zh_hant: 專案 {0}

source: Fully qualify '{0}'
cs: Plně kvalifikovat: {0}
de: "{0}" voll qualifizieren
es: '{0}' completo
fr: {0}' complet
it: Qualifica completamente '{0}'
ja: 完全修飾 '{0}'
ko: '{0}' 정규화
pl: W pełni kwalifikowany element „{0}”
pt_br: Qualificar '{0}' totalmente
ru: Определить полностью "{0}"
tr: '{0}' adını tam olarak belirtin
zh_hans: 完全限定“{0}”
zh_hant: 完整的 '{0}'

source: Remove reference to '{0}'.
cs: Odebrat odkaz na {0}
de: Verweis auf "{0}" entfernen.
es: Quitar referencia a '{0}'.
fr: Supprimez la référence à '{0}'.
it: Rimuove il riferimento a '{0}'.
ja: '{0}' への参照を削除します。
ko: '{0}'에 대한 참조를 제거합니다.
pl: Usuń odwołanie do elementu „{0}”.
pt_br: Remova a referência a '{0}'.
ru: Удалить ссылку на "{0}".
tr: '{0}' başvurusunu kaldırın.
zh_hans: 删除对“{0}”的引用。
zh_hant: 移除對 '{0}' 的參考。

source: Keywords
cs: Klíčová slova
de: Schlüsselwörter
es: Palabras clave
fr: Mots clés
it: Parole chiave
ja: キーワード
ko: 키워드
pl: Słowa kluczowe
pt_br: Palavras-chave
ru: Ключевые слова
tr: Anahtar Sözcükler
zh_hans: 关键字
zh_hant: 關鍵字

source: Snippets
cs: Fragmenty
de: Codeschnipsel
es: Fragmentos de código
fr: Extraits
it: Frammenti
ja: スニペット
ko: 코드 조각
pl: Fragmenty kodu
ru: Фрагменты кода
tr: Kod Parçacıkları
zh_hans: 片段
zh_hant: 程式碼片段

source: Remove document '{0}'
cs: Odebrat dokument {0}
de: Dokument "{0}" entfernen
es: Quitar documento "{0}"
fr: Supprimer le document '{0}'
it: Rimuovi il documento '{0}'
ja: ドキュメント '{0}' の削除
ko: 문서 '{0}' 제거
pl: Usuń dokument „{0}”
pt_br: Remover documento '{0}'
ru: Удалить документ "{0}"
tr: '{0}' belgesini kaldır
zh_hans: 删除文档“{0}”
zh_hant: 移除文件 '{0}'

source: Add document '{0}'
cs: Přidat dokument {0}
de: Dokument "{0}" hinzufügen
es: Agregar documento "{0}"
fr: Ajouter le document '{0}'
it: Aggiungi il documento '{0}'
ja: ドキュメント '{0}' の追加
ko: 문서 '{0}' 추가
pl: Dodaj dokument „{0}”
pt_br: Adicionar documento '{0}'
ru: Добавить документ "{0}"
tr: '{0}' belgesini ekle
zh_hans: 添加文档“{0}”
zh_hant: 新增文件 '{0}'

source: Add argument name '{0}'
cs: Přidat název argumentu {0}
de: Argumentnamen "{0}" hinzufügen
es: Agregar nombre de argumento "{0}"
fr: Ajouter le nom d'argument '{0}'
it: Aggiungi il nome di argomento '{0}'
ja: 引数名 '{0}' を追加する
ko: 인수 이름 '{0}' 추가
pl: Dodaj nazwę argumentu „{0}”
pt_br: Adicionar nome de argumento '{0}'
ru: Добавить имя аргумента "{0}"
tr: '{0}' bağımsız değişken adını ekle
zh_hans: 添加参数名“{0}”
zh_hant: 新增引數名稱 '{0}'

source: Remove unused variable
cs: Odebrat nepoužívanou proměnnou
de: Nicht verwendete Variable entfernen
es: Quitar variable no utilizada
fr: Supprimer la variable inutilisée
it: Rimuovi la variabile non usata
ja: 未使用の変数を削除する
ko: 사용하지 않는 변수 제거
pl: Usuń nieużywaną zmienną
pt_br: Remover variável não usada
ru: Удалить неиспользуемые переменные
tr: Kullanılmayan değişkeni kaldır
zh_hans: 删除未使用的变量
zh_hant: 移除未使用的變數

source: Convert to binary
cs: Převést do binární soustavy
de: In Binärformat konvertieren
es: Convertir a binario
fr: Convertir en valeur binaire
it: Converti in binario
ja: 2 進数に変換する
ko: 이진으로 변환
pl: Konwertuj na wartość binarną
pt_br: Converter em binário
ru: Преобразовать в двоичное
tr: İkiliye dönüştür
zh_hans: 转换为二进制
zh_hant: 轉換為二進位

source: Convert to decimal
cs: Převést do desítkové soustavy
de: In Dezimalformat konvertieren
es: Convertir a decimal
fr: Convertir en valeur décimale
it: Converti in decimale
ja: 10 進数に変換する
ko: 10진수로 변환
pl: Konwertuj na wartość dziesiętną
pt_br: Converter em decimal
ru: Преобразовать в десятичное
tr: Ondalığa dönüştür
zh_hans: 转换为十进制
zh_hant: 轉換為十進位

source: Convert to hex
cs: Převést do šestnáctkové soustavy
de: In 'hex' konvertieren
es: Convertir a hexadecimal
fr: Convertir en hexadécimal
it: Converti in hex
ja: 16 進数に変換する
ko: 16진수로 변환
pl: Konwertuj na wartość szesnastkową
pt_br: Converter para hexa
ru: Преобразовать в шестнадцатеричное
tr: Onaltılığa dönüştür
zh_hans: 转换为十六进制
zh_hant: 轉換為十六進位

source: Separate thousands
cs: Oddělit tisíce
de: Tausender trennen
es: Separar miles
fr: Séparer les milliers
it: Separa le migliaia
ja: 千単位で区切る
ko: 천 단위 구분
pl: Oddziel tysiące
pt_br: Separar milhares
ru: Разделять тысячи
tr: Binleri ayır
zh_hans: 分隔千分位
zh_hant: 分隔千分位

source: Separate words
cs: Oddělit slova
de: Wörter trennen
es: Separar palabras
fr: Séparer les mots
it: Separa le parole
ja: 単語で区切る
ko: 단어 구분
pl: Oddziel wyrazy
pt_br: Separar palavras
ru: Разделять слова
tr: Sözcükleri ayır
zh_hans: 分隔单词
zh_hant: 分隔字組

source: Separate nibbles
cs: Oddělit nibbly
de: Halbbytes trennen
es: Separar cuartetos
fr: Séparer les quartets
it: Separa i nibble
ja: ニブルで区切る
ko: 니블 구분
pl: Oddziel półbajty
pt_br: Separar nibbles
ru: Разделять полубайты
tr: Dörtlüleri ayır
zh_hans: 分隔半字节
zh_hant: 分隔半位元組

source: Remove separators
cs: Odebrat oddělovače
de: Trennzeichen entfernen
es: Quitar separadores
fr: Supprimer les séparateurs
it: Rimuovi i separatori
ja: 区切り記号を削除する
ko: 구분 기호 제거
pl: Usuń separatory
pt_br: Remover separadores
ru: Удалить разделители
tr: Ayırıcıları kaldır
zh_hans: 删除分隔符
zh_hant: 移除分隔符號

source: Generate constructor...
de: Konstruktor generieren…
fr: Générer le constructeur...
it: Genera il costruttore...
ja: コンストラクターを生成する...
tr: Oluşturucuyu oluştur...
zh_hans: 生成构造函数...
zh_hant: 產生建構函式...

source: Pick members to be used as constructor parameters
cs: Vyberte členy, kteří se mají použít jako parametry konstruktoru.
de: Member auswählen, die als Konstruktorparameter verwendet werden sollen
es: Seleccionar miembros para usarlos como parámetros del constructor
fr: Choisir les membres à utiliser comme paramètres de constructeur
it: Selezionare i membri da usare come parametri del costruttore
ja: コンストラクターのパラメーターとして使用するメンバーを選択する
ko: 생성자 매개 변수로 사용할 멤버 선택
pl: Wybierz składowe, które zostaną użyte jako parametry konstruktora
pt_br: Escolher membros para que sejam usados como parâmetros do construtor
ru: Выберите члены, которые будут использоваться как параметры конструктора
tr: Oluşturucu parametresi olarak kullanılacak üyeleri seçin
zh_hans: 选择成员用作构造函数参数
zh_hant: 選取要用作為建構函式參數的成員

source: Pick members to be used in Equals/GetHashCode
cs: Vyberte členy, kteří se mají použít v Equals/GetHashCode.
de: Member auswählen, die in "Equals"/"GetHashCode" verwendet werden sollen
es: Seleccionar miembros para usar en Equals/GetHashCode
fr: Choisir les membres à utiliser dans Equals/GetHashCode
it: Selezionare i membri da usare in Equals/GetHashCode
ja: Equals/GetHashCode で使用するメンバーを選択する
ko: Equals/GetHashCode에 사용할 멤버 선택
pl: Wybierz składowe, które zostaną użyte w elementach Equals/GetHashCode
pt_br: Escolher membros para que sejam usados em Equals/GetHashCode
ru: Выберите члены, которые будут использоваться в Equals/GetHashCode
tr: Equals/GetHashCode içinde kullanılacak üyeleri seçin
zh_hans: 选择成员用于 Equals/GetHashCode
zh_hant: 選取要用於 Equals/GetHashCode 中的成員

source: Generate overrides...
cs: Generovat přepsání...
de: Überschreibungen generieren…
es: Generar invalidaciones...
fr: Générer les substitutions...
it: Genera gli override...
ja: 上書きを生成する...
ko: 재정의 생성...
pl: Generuj zastąpienia...
pt_br: Gerar substituições...
ru: Создать переопределения...
tr: Geçersiz kılmaları oluştur...
zh_hans: 生成重写...
zh_hant: 產生覆寫...

source: Pick members to override
cs: Vyberte členy, které chcete přepsat.
de: Zu überschreibende Member auswählen
es: Seleccionar miembros para invalidar
fr: Choisir les membres à substituer
it: Selezionare i membri di cui eseguire l'override
ja: 上書きするメンバーを選択する
ko: 재정의할 멤버 선택
pl: Wybierz składowe do zastąpienia
pt_br: Escolher membros para substituir
ru: Выберите члены для переопределения
tr: Geçersiz kılınacak üyeleri seçin
zh_hans: 选择成员进行重写
zh_hant: 選取要覆寫的成員

source: Add null check
cs: Přidat kontrolu hodnot null
de: NULL-Überprüfung hinzufügen
es: Agregar comprobación de valores null
fr: Ajouter un contrôle de valeur null
it: Aggiungi il controllo Null
ja: null チェックを追加する
ko: null 검사 추가
pl: Dodaj sprawdzenie wartości null
pt_br: Adicionar verificação nula
ru: Добавить проверку значений NULL
tr: Null denetimi ekle
zh_hans: 添加 null 检查
zh_hant: 新增 null 檢查

source: Add 'string.IsNullOrEmpty' check
de: "string.IsNullOrEmpty"-Überprüfung hinzufügen
fr: Ajouter le contrôle 'string.IsNullOrEmpty'
it: Aggiungi il controllo 'string.IsNullOrEmpty'
ja: string.IsNullOrEmpty' チェックを追加する
tr: 'string.IsNullOrEmpty' denetimi ekle
zh_hans: 添加 "string.IsNullOrEmpty" 检查
zh_hant: 新增 'string.IsNullOrEmpty' 檢查

source: Add 'string.IsNullOrWhiteSpace' check
de: "string.IsNullOrWhiteSpace"-Überprüfung hinzufügen
fr: Ajouter le contrôle 'string.IsNullOrWhiteSpace'
it: Aggiungi il controllo 'string.IsNullOrWhiteSpace'
ja: string.IsNullOrWhiteSpace' チェックを追加する
tr: 'string.IsNullOrWhiteSpace' denetimi ekle
zh_hans: 添加 "string.IsNullOrWhiteSpace" 检查
zh_hant: 新增 'string.IsNullOrWhiteSpace' 檢查

source: Initialize field '{0}'
cs: Inicializovat pole {0}
de: Feld "{0}" initialisieren
es: Inicializar campo "{0}"
fr: Initialiser le champ '{0}'
it: Inizializza il campo '{0}'
ja: フィールド '{0}' を初期化する
ko: '{0}' 필드 초기화
pl: Inicjuj pole „{0}”
pt_br: Inicializar campo '{0}'
ru: Инициализировать поле "{0}"
tr: '{0}' alanını başlat
zh_hans: 初始化字段“{0}”
zh_hant: 初始化欄位 '{0}'

source: Initialize property '{0}'
cs: Inicializovat vlastnost {0}
de: Eigenschaft "{0}" initialisieren
es: Inicializar propiedad "{0}"
fr: Initialiser la propriété '{0}'
it: Inizializza la proprietà '{0}'
ja: プロパティ '{0}' を初期化する
ko: '{0}' 속성 초기화
pl: Inicjuj właściwość „{0}”
pt_br: Inicializar propriedade '{0}'
ru: Инициализировать свойство "{0}"
tr: '{0}' özelliğini başlat
zh_hans: 初始化属性“{0}”
zh_hant: 初始化屬性 '{0}'

source: Add null checks
de: NULL-Überprüfungen hinzufügen
fr: Ajouter des contrôles de valeur null
it: Aggiungi i controlli Null
ja: null チェックを追加する
tr: Null denetimleri ekle
zh_hans: 添加 null 检查
zh_hant: 新增 null 檢查

source: Generate operators
cs: Generovat operátory
de: Operatoren generieren
es: Generar operadores
fr: Générer les opérateurs
it: Genera gli operatori
ja: 演算子を生成する
ko: 연산자 생성
pl: Generuj operatory
pt_br: Gerar operadores
ru: Создать операторы
tr: İşleçleri oluştur
zh_hans: 生成运算符
zh_hant: 產生運算子

source: Implement {0}
cs: Implementovat {0}
de: {0} implementieren
es: Implementar {0}
fr: Implémenter {0}
it: Implementa {0}
ja: {0} を実装する
ko: {0} 구현
pl: Implementuj {0}
pt_br: Implementar {0}
ru: Реализация {0}
tr: {0} uygula
zh_hans: 实现 {0}
zh_hant: 實作 {0}

source: Reported diagnostic '{0}' has a source location in file '{1}', which is not part of the compilation being analyzed.
cs: Zdroj vykazované diagnostiky {0} je umístěný v souboru {1}, který není součástí analyzované kompilace.
de: Die gemeldete Diagnose "{0}" weist einen Quellspeicherort in der Datei "{1}" auf, die nicht Teil der Kompilierung ist, die analysiert wird.
es: El diagnóstico notificado "{0}" tiene una ubicación de origen en el archivo "{1}", que no forma parte de la compilación que se está analizando.
fr: Le diagnostic signalé '{0}' a un emplacement source dans le fichier '{1}', qui ne fait pas partie de la compilation en cours d'analyse.
it: Il percorso di origine della diagnostica restituita '{0}' è incluso nel file '{1}', che non fa parte della compilazione da analizzare.
ja: 報告された診断 '{0}' のソースの場所がファイル '{1}' にありますが、これは、分析対象のコンパイルの一部ではありません。
ko: 보고된 진단 '{0}'의 소스 위치가 분석되는 컴파일의 일부가 아닌 '{1}' 파일에 있습니다.
pl: Lokalizacja źródłowa zgłoszonych danych diagnostycznych „{0}” znajduje się w pliku „{1}”, który nie jest częścią analizowanej kompilacji.
pt_br: O diagnóstico relatado '{0}' tem um local de origem no arquivo '{1}', que não faz parte da compilação sendo analisada.
ru: В отчете о диагностике "{0}" используется исходное расположение "{1}", которое не входит в анализируемую компиляцию.
tr: Raporlanan '{0}' tanılamasının kaynak konumu, çözümlenen derlemenin bir parçası olmayan '{1}' dosyası içinde.
zh_hans: 报告的诊断“{0}”的源位置位于文件“{1}”中，后者不是要分析的编译的一部分。
zh_hant: 回報的診斷 '{0}' 在檔案 '{1}' 中具有來源位置，其不屬於正在進行分析的編譯。
