Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UnableToReadSourceFileOrPdb
source: Unable to read source file '{0}' or the PDB built for the containing project. Any changes made to this file while debugging won't be applied until its content matches the built source.
cs: Není možné přečíst zdrojový soubor {0} nebo soubor PDB sestavený pro projekt, který tyto soubory obsahuje. Případné změny provedené v tomto souboru během ladění se nepoužijí, dokud se jeho obsah nebude shodovat se sestaveným zdrojem.
de: Die Quelldatei "{0}" oder die für das enthaltende Projekt kompilierte PDB-Datei kann nicht gelesen werden. Alle Änderungen, die während des Debuggens an dieser Datei vorgenommen wurden, werden erst angewendet, wenn der Inhalt dem kompilierten Quellcode entspricht.
es: No se puede leer el archivo de código fuente "{0}" o el PDB compilado para el proyecto que lo contiene. Los cambios realizados en este archivo durante la depuración no se aplicarán hasta que su contenido coincida con el del código fuente compilado.
fr: Impossible de lire le fichier source '{0}' ou le PDB généré pour le projet conteneur. Les changements apportés à ce fichier durant le débogage ne seront pas appliqués tant que son contenu ne correspondra pas à la source générée.
it: Non è possibile leggere il file di origine '{0}' o il file PDB compilato per il progetto contenitore. Tutte le modifiche apportate a questo file durante il debug non verranno applicate finché il relativo contenuto non corrisponde al codice sorgente compilato.
ja: ソース ファイル '{0}'、またはそれを含むプロジェクト用にビルドされた PDB を読み取れません。デバッグ中にこのファイルに加えられた変更は、そのコンテンツがビルドされたソースと一致するまで適用されません。
ko: 소스 파일 '{0}' 또는 포함하는 프로젝트에 대해 빌드된 PDB를 읽을 수 없습니다. 디버그하는 동안 이 파일의 변경된 모든 내용은 해당 콘텐츠가 빌드된 소스와 일치할 때까지 적용되지 않습니다.
pl: Nie można odczytać pliku źródłowego „{0}” lub pliku PDB skompilowanego dla projektu, w którym jest on zawarty. Wszystkie zmiany wprowadzone w tym pliku podczas debugowania nie zostaną zastosowane do czasu, aż jego zawartość będzie zgodna ze skompilowanym źródłem.
pt_br: Não é possível ler o arquivo de origem '{0}' ou o PDB criado para o projeto que o contém. Todas as alterações feitas neste arquivo durante a depuração não serão aplicadas até que o conteúdo corresponda ao código-fonte compilado.
ru: Не удалось считать исходный файл "{0}" или PDB, созданный для содержащего проекта. Все изменения, внесенные в этот файл во время отладки, не будут применены, пока содержимое файла не будет соответствовать созданному источнику.
tr: '{0}' kaynak dosyası veya içeren proje için oluşturulan PDB okunamıyor. Hata ayıklama sırasında bu dosyada yapılan değişiklikler, dosyanın içeriği oluşturulan kaynakla eşleşene kadar uygulanmaz.
zh_hans: 无法读取源文件 "{0}" 或为包含项目生成的 PDB。在调试期间对此文件所做的任何更改都不会应用，直到其内容与生成的源匹配为止。
zh_hant: 無法讀取來源檔案 '{0}' 或為包含該檔案之專案所建置的 PDB。等到此檔案的內容與已建置的來源一致後，才會套用於偵錯期間對此檔案所做的所有變更。

source: Unknown property
cs: Neznámá vlastnost
de: Unbekannte Eigenschaft
es: Propiedad desconocida
fr: Propriété inconnue
it: Proprietà sconosciuta
ja: 不明なプロパティ
ko: 알 수 없는 속성
pl: Nieznana właściwość
pt_br: Propriedade desconhecida
ru: Неизвестное свойство
tr: Bilinmeyen Özellik
zh_hans: 未知属性
zh_hant: 未知屬性

source: Unknown property '{0}'
cs: Neznámá vlastnost {0}
de: Unbekannte Eigenschaft "{0}"
es: Propiedad desconocida '{0}'
fr: Propriété inconnue '{0}'
it: Proprietà sconosciuta '{0}'
ja: 不明なプロパティ '{0}'
ko: 알 수 없는 속성 '{0}'
pl: Nieznana właściwość „{0}”
pt_br: Propriedade desconhecida '{0}'
ru: Неизвестное свойство "{0}"
tr: 'Bilinmeyen {0}' özelliği
zh_hans: 未知属性“{0}”
zh_hant: 未知屬性 '{0}’

source: Unrecognized control character
cs: Nerozpoznaný řídicí znak
de: Unbekanntes Steuerzeichen
es: Carácter de control desconocido
fr: Caractère de contrôle non reconnu
it: Carattere di controllo non riconosciuto
ja: 認識されない制御文字
ko: 인식할 수 없는 제어 문자입니다.
pl: Nierozpoznany znak kontrolny
pt_br: Caractere de controle não reconhecido
ru: Не удалось распознать управляющий символ
tr: Tanınmayan denetim karakteri
zh_hans: 无法识别的控制字符
zh_hant: 無法識別的控制字元

source: Unrecognized escape sequence \{0}
cs: Nerozpoznaná řídicí sekvence \{0}
de: Unbekannte Escapesequenz \{0}.
es: Secuencia de escape no reconocida \{0}
fr: Séquence d'échappement non reconnue \{0}
it: Sequenza di escape non riconosciuta: \{0}
ja: 認識できないエスケープ シーケンス \{0}
ko: 인식할 수 없는 이스케이프 시퀀스 \{0}입니다.
pl: Nierozpoznana sekwencja ucieczki \{0}
pt_br: Sequência de escape não reconhecida \{0}
ru: Не удалось распознать escape-последовательность \{0}
tr: Tanınmayan çıkış sırası \{0}
zh_hans: 无法识别的转义序列 \{0}
zh_hant: 無法識別的逸出序列 \{0}

source: Unrecognized grouping construct
cs: Nerozpoznaný seskupovací konstrukt
de: Unbekanntes Gruppierungskonstrukt.
es: Construcción de agrupación no reconocida
fr: Construction de regroupement non reconnue
it: Costrutto di raggruppamento non riconosciuto
ja: 認識されないグループ化構成体
ko: 인식할 수 없는 그룹화 생성자입니다.
pl: Nierozpoznana konstrukcja grupująca
pt_br: Constructo de agrupamento não reconhecida
ru: Не удалось распознать конструкцию группировки
tr: Tanınmayan gruplama yapısı
zh_hans: 无法识别的分组构造
zh_hant: 無法識別的分組建構

# Unterminated_character_class_set
source: Unterminated [] set
cs: Nedokončená sada []
de: Nicht abgeschlossener []-Satz
es: Conjunto [] sin terminar
fr: Ensemble [] inachevé
it: Set di [] senza terminazione
ja: 未終了の [] セットです
ko: 종결되지 않은 [] 집합
pl: Niezakończony zestaw []
pt_br: Conjunto [] não finalizado
ru: Набор [] без признака завершения
tr: Sonlandırılmamış [] kümesi
zh_hans: [] 集未关闭
zh_hant: 未結束的 [] 組合

source: Unterminated comment
cs: Neukončený komentář
de: Nicht beendeter Kommentar
es: Comentario sin terminar
it: Commento senza terminazione
ja: コメントが終了していません
ko: 종결되지 않은 주석
pl: Niezakończony komentarz
pt_br: Comentário não terminado
ru: Незавершенный комментарий
tr: Sonlandırılmamış açıklama
zh_hans: 未终止的注释

# Unterminated_regex_comment
source: Unterminated (?#...) comment
cs: Neukončený komentář (?#...)
de: Nicht abgeschlossener (?#...)-Kommentar.
es: Comentario (?#...) sin terminar
fr: Commentaire (?#...) non terminé
it: Commento (?#...) senza terminazione
ja: 未終了の (?#...) コメントです
ko: 종격되지 않은 (?#...) 주석
pl: Niezakończony komentarz (?#...)
pt_br: Comentário (?#...) não finalizado
ru: Незавершенный комментарий (? #...)
tr: Sonlandırılmamış (?... #) yorum
zh_hans: (?#...) 注释未关闭
zh_hant: 未結束的 (?#...) 註解

source: Unterminated string
cs: Neukončený řetězec
de: Nicht abgeschlossene Zeichenfolge
es: Cadena sin terminar
it: Stringa senza terminazione
ja: 文字列が終了していません
ko: 종결되지 않은 문자열
pl: Niezakończony ciąg
pt_br: Cadeia de caracteres não terminada
ru: Незавершенная строка
tr: Sonlandırılmamış dize
zh_hans: 未终止的字符串

source: Unwrap all arguments
cs: Zrušit zalomení všech argumentů
de: Umbruch für alle Argumente aufheben
es: Desajustar todos los argumentos
fr: Désenvelopper tous les arguments
it: Annulla il ritorno a capo per tutti gli argomenti
ja: すべての引数の折り返しを解除
ko: 모든 인수 래핑 해제
pl: Odwijaj wszystkie argumenty
pt_br: Desencapsular todos os argumentos
ru: Развернуть все аргументы
tr: Tüm bağımsız değişkenlerin sarmalamasını kaldır
zh_hans: 展开所有参数
zh_hant: 將所有引數取消換行

source: Unwrap all elements
cs: Rozbalit všechny elementy
de: Entpacken aller Elemente
es: Desajustar todos los elementos
it: Annulla il wrapping di tutti gli elementi
ja: すべての要素の折り返しを解除する
ko: 모든 요소 래핑 해제
pl: Cofnij zawijanie wszystkich elementów
pt_br: Cancelar quebra de linha de todos os elementos
ru: Не переносить все элементы
tr: Tüm öğelerin sarmalamasını kaldır
zh_hans: 展开所有元素

source: Unwrap all parameters
cs: Zrušit zalomení všech parametrů
de: Umbruch für alle Parameter aufheben
es: Desajustar todos los parámetros
fr: Désenvelopper tous les paramètres
it: Annulla il ritorno a capo per tutti i parametri
ja: すべてのパラメーターの折り返しを解除します
ko: 모든 매개 변수 래핑 해제
pl: Odwijaj wszystkie parametry
pt_br: Desencapsular todos os parâmetros
ru: Развернуть все параметры
tr: Tüm parametrelerin sarmalamasını kaldır
zh_hans: 展开打开所有参数
zh_hant: 將所有參數取消換行

source: Unwrap and indent all arguments
cs: Zrušit zalomení všech argumentů a odsadit je
de: Umbruch für alle Argumente aufheben und einrücken
es: Desajustar todos los argumentos y aplicarles sangría
fr: Désenvelopper et mettre en retrait tous les arguments
it: Annulla il ritorno a capo e imposta il rientro per tutti gli argomenti
ja: 折り返しを解除してすべての引数にインデントを設定します
ko: 모든 인수 래핑 해제 및 들여쓰기
pl: Odwijaj wszystkie argumenty i dodawaj dla nich wcięcie
pt_br: Desencapsular e recuar todos os argumentos
ru: Развернуть все аргументы и удалить отступы для них
tr: Sarmalamayı kaldır ve tüm bağımsız değişkenleri girintile
zh_hans: 展开和缩进所有参数
zh_hant: 將所有引數取消換行並縮排

source: Unwrap and indent all parameters
cs: Zrušit zalomení všech parametrů a odsadit je
de: Umbruch für alle Parameter aufheben und einrücken
es: Desajustar todos los parámetros y aplicarles sangría
fr: Désenvelopper et mettre en retrait tous les paramètres
it: Annulla il ritorno a capo e imposta rientro per tutti i parametri
ja: 折り返しを解除し、すべてのパラメーターにインデントを設定します
ko: 모든 매개 변수 래핑 해제 및 들여쓰기
pl: Odwijaj wszystkie parametry i dodawaj dla nich wcięcie
pt_br: Desencapsular e recuar todos os parâmetros
ru: Развернуть все параметры и добавить отступы для них
tr: Sarmalamayı kaldır ve tüm parametreleri girintile
zh_hans: 展开和缩进所有参数
zh_hant: 將所有參數取消換行並縮排

source: Unwrap argument list
cs: Zrušit zalomení seznamu argumentů
de: Umbruch für Argumentliste aufheben
es: Desajustar la lista de argumentos
fr: Désenvelopper la liste d'arguments
it: Annulla il ritorno a capo per l'elenco di argomenti
ja: 引数リストの折り返しを解除
ko: 인수 목록 래핑 해제
pl: Odwijaj listę argumentów
pt_br: Desencapsular a lista de argumentos
ru: Развернуть список аргументов
tr: Bağımsız değişken listesinin sarmalamasını kaldır
zh_hans: 展开参数列表
zh_hant: 將引數清單取消換行

source: Unwrap call chain
cs: Zrušit zalomení posloupnosti volání
de: Umbruch für alle Aufrufkette aufheben
es: Desencapsular la cadena de llamadas
fr: Désenvelopper la chaîne d'appels
it: Annulla il ritorno a capo per la catena di chiamate
ja: 呼び出しチェーンの折り返し解除
ko: 호출 체인 래핑 해제
pl: Odwijaj łańcuch wywołań
pt_br: Desencapsular cadeia de chamadas
ru: Развернуть цепочку вызовов
tr: Çağrı zincirinin sarmalamasını kaldır
zh_hans: 展开调用链
zh_hant: 將呼叫鏈取消包裝

source: Unwrap collection
cs: Zrušit zalomení dlouhé kolekce
de: Umbruch der Sammlung aufheben
es: Desajustar colección
ja: コレクションの折り返しを解除
ko: 컬렉션 래핑 해제
pl: Odpakuj kolekcję
pt_br: Desencapsular coleção
ru: Распаковка коллекции
tr: Koleksiyonun sarmalamasını kaldır
zh_hans: 展开集合

source: Unwrap expression
cs: Zrušit zalomení výrazu
de: Umbruch für Ausdruck aufheben
es: Desajustar la expresión
fr: Désenvelopper l'expression
it: Annulla il ritorno a capo per l'espressione
ja: 式の折り返しを解除
ko: 식 래핑 해제
pl: Odwijaj wyrażenie
pt_br: Desencapsular a expressão
ru: Развернуть выражение
tr: İfadenin sarmalamasını kaldır
zh_hans: 展开表达式
zh_hant: 將運算式取消換行

source: Unwrap initializer
cs: Zrušit zalomení inicializátoru
de: Initialisierer entpacken
es: Desajustar inicializador
it: Annulla il wrapping dell'inizializzatore
ja: 初期化子の折り返しを解除する
ko: 이니셜라이저 래핑 해제
pl: Odpakuj inicjator
pt_br: Cancelar quebra de linha do inicializador
ru: Не переносить инициализатор
tr: Başlatıcının sarmalamasını kaldır
zh_hans: 展开初始化表达式

source: Unwrap parameter list
cs: Zrušit zalomení seznamu parametrů
de: Umbruch für Parameterliste aufheben
es: Desajustar la lista de parámetros
fr: Désenvelopper la liste de paramètres
it: Annulla il ritorno a capo per l'elenco di parametri
ja: パラメーター リストの折り返しを解除します
ko: 매개 변수 목록 래핑 해제
pl: Odwijaj listę parametrów
pt_br: Desencapsular a lista de parâmetros
ru: Развернуть список параметров
tr: Parametre listesinin sarmalamasını kaldır
zh_hans: 展开参数列表
zh_hant: 將參數清單取消換行

source: Updating '{0}' requires restarting the application.
cs: Aktualizace {0} vyžaduje restartování aplikace.
de: Das Aktualisieren von „{0}“ erfordert einen Neustart der Anwendung.
es: Para actualizar "{0}" es necesario reiniciar la aplicación.
it: Se si elimina '{0}', è necessario riavviare l'applicazione.
ja: '{0}' を更新するには、アプリケーションを再起動する必要があります。
ko: '{0}'을(를) 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja elementu „{0}” wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar '{0}' requer reiniciar o aplicativo.
ru: Для обновления "{0}" требуется перезапустить приложение.
tr: {0} öğesinin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新“{0}”需要重启应用程序。

source: Updating {0} within generic type or method requires restarting the application because is not supported by the runtime.
cs: Aktualizace {0} v rámci obecného typu nebo metody vyžaduje restartování aplikace, protože není podporována modulem runtime.
de: Das Aktualisieren {0} innerhalb des generischen Typs oder der generischen Methode erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: La actualización de {0} dentro de un tipo o método genérico requiere reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: L'aggiornamento di {0} all'interno del tipo o del metodo generico richiede il riavvio dell'applicazione perché non è supportato dal runtime.
ja: ランタイムでサポートされていないため、ジェネリック型またはメソッド内で {0} を更新するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 제네릭 형식 또는 메서드 내에서 {0}을(를) 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja {0} w ramach typu ogólnego lub metody wymaga ponownego uruchomienia aplikacji, ponieważ nie jest obsługiwana przez środowisko uruchomieniowe.
pt_br: A atualização {0} no tipo ou método genérico requer a reinicialização do aplicativo porque não há suporte para o runtime.
ru: Обновление {0} в универсальном типе или методе требует перезапуска приложения, поскольку это не поддерживается средой выполнения.
tr: Genel tür veya yöntem içinde {0} güncellemesi, çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在泛型类型或方法中更新 {0} 需要重新启动应用程序，因为它不受运行时支持。

source: Updating a {0} around an active statement requires restarting the application.
cs: Aktualizace {0} kolem aktivního příkazu vyžaduje restartování aplikace.
de: Das Aktualisieren einer {0} um eine aktive Anweisung erfordert einen Neustart der Anwendung.
es: Para actualizar un {0} alrededor de una instrucción de acción, es necesario reiniciar la aplicación.
it: Se si aggiorna un elemento {0} all'inizio di un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントの前後の {0} を更新するには、アプリケーションを再起動する必要があります。
ko: 활성 문 주변의 {0}을(를) 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie elementu {0} wokół aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar um {0} em torno de uma instrução ativa requer a reinicialização do aplicativo.
ru: Для обновления {0} вокруг активного оператора требуется перезапустить приложение.
tr: Etkin bir deyim etrafında bir {0} güncelleştirmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新活动语句周围的 {0} 需要重新启动应用程序。

source: Updating a complex statement containing an await expression requires restarting the application.
cs: Aktualizace komplexního příkazu obsahujícího výraz await vyžaduje restartování aplikace.
de: Das Aktualisieren einer komplexen Anweisung, die einen await-Ausdruck enthält, erfordert einen Neustart der Anwendung.
es: Para actualizar una instrucción compleja que contiene una expresión await, es necesario reiniciar la aplicación.
it: Se si aggiorna un'istruzione complessa contenente un'espressione await, è necessario riavviare l'applicazione.
ja: await 式を含む複雑なステートメントを更新するには、アプリケーションを再起動する必要があります。
ko: await 식을 포함하는 복잡한 문을 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja złożonej instrukcji zawierającej wyrażenie await wymaga ponownego uruchomienia aplikacji.
pt_br: A atualização de uma instrução complexa contendo uma expressão await requer a reinicialização do aplicativo.
ru: Для обновления сложного оператора, содержащего выражение await, требуется перезапустить приложение.
tr: Bir await ifadesi içeren karmaşık bir ifadenin güncelleştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新包含 await 表达式的复杂语句需要重启应用程序。

source: Updating an active statement requires restarting the application.
cs: Aktualizace aktivního příkazu vyžaduje restartování aplikace.
de: Das Aktualisieren einer aktiven Anweisung erfordert einen Neustart der Anwendung.
es: Para actualizar una instrucción de acción se requiere reiniciar la aplicación.
it: Se si aggiorna un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントを更新するには、アプリケーションを再起動する必要があります。
ko: 활성 명령문을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar uma instrução ativa requer a reinicialização do aplicativo.
ru: Для обновления активного оператора требуется перезапустить приложение.
tr: Etkin bir deyimi güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新活动语句需要重新启动应用程序。

source: Updating async or iterator modifier around an active statement requires restarting the application.
cs: Aktualizace modifikátoru async nebo iterator kolem aktivního příkazu vyžaduje restartování aplikace.
de: Das Aktualisieren eines asynchronen oder iteratormodifizierers um eine aktive Anweisung erfordert einen Neustart der Anwendung.
es: La actualización del modificador asincrónico async o iterador iterator alrededor de una instrucción de acción requiere reiniciar la aplicación.
it: Se si aggiorna il modificatore async o di iteratore in un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントの前後の async 修飾子または iterator 修飾子を更新するには、アプリケーションを再起動する必要があります。
ko: 활성 문 주변의 async 또는 iterator 수정자를 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie modyfikatora asynchronicznego lub modyfikatora moduły iterator wokół aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar o modificador async ou iterator em torno de uma instrução ativa requer a reinicialização do aplicativo.
ru: Для обновления модификатора async или iterator вокруг активного оператора требуется перезапустить приложение.
tr: Etkin bir deyim etrafında async veya iterator değiştiricisini güncelleştirmek uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新活动语句周围的 async 或 iterator 修饰符需要重新启动应用程序。

source: Updating async or iterator requires restarting the application because is not supported by the runtime.
cs: Aktualizace asnyc nebo iterátoru vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Aktualisieren asynchron oder als Iterator erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: La actualización asincrónica o del iterador requiere reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: L'aggiornamento asincrono o iteratore richiede il riavvio dell'applicazione perché non è supportato dal runtime.
ja: ランタイムでサポートされていないため、非同期または反復子を更新するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 비동기 또는 반복기를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja asynchroniczna lub iteratora wymaga ponownego uruchomienia aplikacji, ponieważ nie jest obsługiwana przez środowisko uruchomieniowe.
pt_br: A atualização assíncrona ou iterador requer a reinicialização do aplicativo porque não há suporte para o runtime.
ru: Обновление асинхронного режима или итератора требует перезапуска приложения, так как это не поддерживается средой выполнения.
tr: Zaman uyumsuz veya yineleyicinin güncellenmesi, çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新异步或迭代器需要重新启动应用程序，因为它不受运行时支持。

source: Updating a reloadable type (marked by {0}) or its member requires restarting the application because is not supported by the runtime.
cs: Aktualizace typu pro opětovné načtení (označeného {0}) nebo jeho člena vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Aktualisieren eines aufladbaren Typs (gekennzeichnet durch {0}) oder seines Elements erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para actualizar un tipo recargable (marcado por {0}) o su miembro, se requiere reiniciar la aplicación porque no es compatible con el runtime.
it: Se si carica un tipo ricaricabile (contrassegnato da {0}) o il relativo membro, è necessario riavviare l'applicazione perché il tipo non è supportato dal runtime.
ja: ランタイムでサポートされていないため、再読み込み可能な型 ({0} とマークされている) またはそのメンバーを更新するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원되지 않으므로 다시 로드할 수 있는 형식({0}(으)로 표시) 또는 해당 멤버를 업데이트하려면 애플리케이션을 다시 시작해야 합니다.
pl: Aktualizacja typu możliwego do załadowania ponownego (oznaczonego przez element {0}) lub jego składowej wymaga ponownego uruchomienia aplikacji, ponieważ nie jest ona obsługiwana przez środowisko uruchomieniowe.
pt_br: Atualizar um tipo recarregável (marcado por {0}) ou seu membro requer a reinicialização do aplicativo porque não é suportado pelo tempo de execução.
ru: Для обновления перезагружаемого типа (отмеченного атрибутом {0}) или его элемента требуется перезапустить приложение, так как обновление не поддерживается средой выполнения.
tr: Yeniden yüklenebilir bir türün ({0} tarafından işaretlenen) veya üyenin güncelleştirilmesi, çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新可重载类型(由 {0} 标记)或其成员需要重启应用程序，因为运行时不支持。

source: Updating the Handles clause of {0} requires restarting the application.
cs: Aktualizace klauzule Handles {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Handles-Klausel von {0} erfordert einen Neustart der Anwendung.
es: Para actualizar la cláusula Handles de {0} es necesario reiniciar la aplicación.
it: Se si aggiorna la clausola Handles di {0}, è necessario riavviare l'applicazione.
ja: {0} の Handles 句を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 Handles 절을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizowanie klauzuli procedur Handles elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar a cláusula Handles de {0} requer a reinicialização do aplicativo.
ru: Для обновления предложения Handles в {0} требуется перезапустить приложение.
tr: {0} Handles yan tümcesini güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的 Handles 子句需要重新启动应用程序。

source: Updating the Implements clause of a {0} requires restarting the application.
cs: Aktualizace klauzule Implements pro {0} vyžaduje restartování aplikace.
de: Das Aktualisieren der Implements-Klausel einer {0} erfordert einen Neustart der Anwendung.
es: Para actualizar la cláusula Implements de un {0} es necesario reiniciar la aplicación.
it: Se si aggiorna la clausola Implements di un elemento {0}, è necessario riavviare l'applicazione.
ja: {0} の Implements 句を更新するには、アプリケーションを再起動する必要があります。
ko: {0}의 Implements 절을 업데이트하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizacja klauzuli Implements słowa kluczowego {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Atualizar a cláusula Implements de um {0} requer a reinicialização do aplicativo.
ru: Для обновления предложения Implements в {0} требуется перезапустить приложение.
tr: {0} Implements yan tümcesini güncelleştirmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更新 {0} 的 Implements 子句需要重新启动应用程序。
