Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_match_between_m_and_n_times_long
source: The {n,m} quantifier matches the preceding element at least n times, but no more than m times, where n and m are integers. {n,m} is a greedy quantifier whose lazy equivalent is {n,m}?
cs: Kvantifikátor {n,m} najde shodu předchozího elementu nejméně n-krát, ale nejvíce m-krát, kde n a m jsou celá čísla. {n,m} je hladový kvantifikátor, jehož líným ekvivalentem je {n,m}?.
de: Der Quantifizierer "{n,m}" stimmt mit dem vorhergehenden Element mindestens n-mal, aber nicht häufiger als m-mal überein. "n" und "m" stehen hierbei für ganze Zahlen. "{n,m}" ist ein gieriger Quantifizierer, dessen träges Äquivalent "{n,m}?" lautet.
es: El cuantificador {n, m} coincide con el elemento anterior n veces como mínimo, pero no más de m veces, donde n y m son enteros. {n,m} es un cuantificador expansivo cuyo equivalente diferido es {n,m}?
fr: Le quantificateur {n,m} correspond à l'élément précédent au moins n fois, mais pas plus de m fois, où n et m sont des entiers. {n,m} est un quantificateur gourmand dont l'équivalent paresseux est {n,m}?
it: Il quantificatore {n,m} trova la corrispondenza con l'elemento precedente almeno n volte, ma non più di m volte, dove n e m sono numeri interi. {n,m} è un quantificatore greedy il cui equivalente lazy è {n,m}?
ja: {n,m} 量指定子は、直前の要素の n 回以上、m 回以下の繰り返しに一致します。ここで、n と m は整数です。{n,m} は最長一致の量指定子であり、最短一致でこれに対応するのは {n,m}? です
ko: {n,m} 수량자는 n번 이상 m번 이하로 이전 요소와 일치시킵니다. 여기서, n 및 m은 정수입니다. {n,m}는 해당 게으른 수량자가 {n,m}?인 탐욕적 수량자입니다.
pl: Kwantyfikator {n,m} dopasowuje poprzedzający element co najmniej n razy, lecz nie więcej niż m razy, gdzie n i m to liczby całkowite. {n,m} to kwantyfikator zachłanny, którego powściągliwy równoważnik to {n,m}?.
pt_br: O quantificador {n,m} corresponde ao elemento precedente pelo menos n vezes, mas no máximo m vezes, em que n e m são inteiros. {n,m} é um quantificador greedy cujo equivalente lento é {n,m}?
ru: Квантификатор {n,m} соответствует предыдущему элементу по меньшей мере n раз, но не более m раз, где n и m — любые целые числа. {n,m} — это "жадный" квантификатор, "ленивым" аналогом которого является {n,m}?
tr: {n,m} niceleyicisi, bir önceki öğeyle en az n ve en çok m kez eşleşir (burada n ve m tamsayıdır). {n,m}, gecikmeli karşılığı {n,m}? olan bir hızlı niceleyicidir
zh_hans: {n, m} 限定符匹配前面的元素至少 n 次，但不超过 m 次，其中 n 和 m 是整数。{n, m} 是贪婪限定符，其惰性等效值为 {n,m}?
zh_hant: {n,m} 數量詞會比對前置元素至少 n 次，但不超過 m 次，其中 n 和 m 為整數。{n,m} 是窮盡數量詞，其少數優先的相對概念為 {n,m}?

# Regex_match_between_m_and_n_times_short
source: match between 'm' and 'n' times
cs: shoda v rozmezí m-krát a n-krát
de: Zwischen m- und n-malige Übereinstimmung
es: coincidir entre "m" y "n" veces
fr: rechercher une correspondance entre 'm' et 'n' fois
it: trova la corrispondenza tra 'n' e 'm' volte
ja: 'm' 回から 'n' 回の一致
ko: 'm'에서 'n'번 사이 일치
pl: dopasuj od „m” do „n” razy
pt_br: corresponder entre 'm' e 'n' vezes
ru: совпадение от "m" до "n" раз
tr: en az 'n' ve en çok 'm' kez eşleş
zh_hans: 匹配次数介于 "m" 次和 "n" 次之间
zh_hant: 比對 'm' 到 'n' 次

# Regex_match_exactly_n_times_lazy_long
source: The {n}? quantifier matches the preceding element exactly n times, where n is any integer. It is the lazy counterpart of the greedy quantifier {n}+
cs: Kvantifikátor {n}? najde shodu předchozího elementu přesně n-krát, kde n je celé číslo. Jedná se o líný protějšek hladového kvantifikátoru {n}+.
de: Der Quantifizierer {n}? stimmt mit dem vorhergehenden Element genau n-mal überein. "n" steht hierbei für eine beliebige ganze Zahl. Dies ist das träge Äquivalent zum gierigen Quantifizierer "{n}+".
es: El cuantificador {n}? coincide exactamente n veces con el elemento anterior, donde n es un entero. Es el equivalente diferido del cuantificador expansivo {n}+
fr: Le quantificateur {n}? recherche une correspondance avec l'élément précédent exactement n fois, où n est un entier. Il s'agit de l'équivalent paresseux du quantificateur gourmand {n}+
it: Il quantificatore {n}? trova la corrispondenza con l'elemento precedente esattamente n volte, dove n è qualsiasi numero intero. Si tratta della controparte lazy del quantificatore greedy {n}+
ja: {n}? 量指定子は、直前の要素の n 回の繰り返しに一致します。ここで、n は任意の整数です。これは、最長一致の量指定子 {n}+ に対応する、最短一致の量指定子です
ko: {n}? 수량자는 정확히 n번을 이전 요소와 일치시킵니다. 여기서, n은 정수입니다. 탐욕적 수량자 {n}+에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator {n}? dopasowuje poprzedzający element dokładnie n razy, gdzie n jest dowolną liczbą całkowitą. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego {n}+.
pt_br: O quantificador {n}? corresponde ao elemento precedente exatamente n vezes, em que n é qualquer inteiro. Ele é a contraparte lenta do quantificador greedy {n}+
ru: Квантификатор {n}? соответствует предыдущему элементу ровно n раз, где n — любое целое число. Это "ленивый" аналог "жадного" квантификатора {n}+
tr: {n}? niceleyicisi, önceki öğe ile tam olarak n kez eşleşir (burada n herhangi bir tamsayıdır). Bu, {n}+ hızlı niceleyicisinin gecikmeli karşılığıdır
zh_hans: {n}? 限定符恰好匹配前面的元素 n 次，其中 n 是任何整数。它是贪婪限定符 {n}+ 的惰性副本
zh_hant: {n}? 數量詞會比對前置元素正好 n 次，其中 n 為任何整數。這是與窮盡數量詞 {n}+ 相對的少數優先概念

# Regex_match_exactly_n_times_lazy_short
source: match exactly 'n' times (lazy)
cs: shoda přesně n-krát (líný režim)
de: Genau n-malige Übereinstimmung (träge)
es: coincidir exactamente "n" veces (diferido)
fr: rechercher une correspondance exactement 'n' fois (paresseux)
it: trova la corrispondenza esatta 'n' volte (corrispondenza lazy)
ja: ちょうど 'n' 回一致 (最短一致)
ko: 정확하게 'n'번 일치(지연)
pl: dopasuj dokładnie „n” razy (powściągliwie)
pt_br: corresponder exatamente 'n' vezes (lento)
ru: совпадение ровно "n" раз (ленивый)
tr: tam olarak 'n' kez eşleş (gecikmeli)
zh_hans: 刚好匹配 "n" 次(惰性)
zh_hant: 比對正好 'n' 次 (少數優先)

# Regex_match_exactly_n_times_long
source: The {n} quantifier matches the preceding element exactly n times, where n is any integer. {n} is a greedy quantifier whose lazy equivalent is {n}?
cs: Kvantifikátor {n} najde shodu předchozího elementu přesně n-krát, kde n je libovolné celé číslo. {n} je hladový kvantifikátor, jehož líným ekvivalentem je {n}?.
de: Der Quantifizierer "{n}" stimmt mit dem vorhergehenden Element genau n-mal überein. "n" steht hierbei für eine beliebige ganze Zahl. "{n}" ist ein gieriger Quantifizierer, dessen träges Äquivalent "{n}?" lautet.
es: El cuantificador {n} coincide exactamente n veces con el elemento anterior, donde n es un entero. {n} es un cuantificador expansivo cuyo equivalente diferido es {n}?
fr: Le quantificateur {n} recherche une correspondance avec l'élément précédent exactement n fois, où n est un entier. {n} est un quantificateur gourmand dont l'équivalent paresseux est {n}?
it: Il quantificatore {n} trova la corrispondenza con l'elemento precedente esattamente n volte, dove n è qualsiasi numero intero. {n} è un quantificatore greedy il cui equivalente lazy è {n}?
ja: {n} 量指定子は、直前の要素の n 回の繰り返しに一致します。ここで、n は任意の整数です。{n} は最長一致の量指定子であり、最短一致でこれに対応するのは {n}? です
ko: {n} 수량자는 정확히 n번을 이전 요소와 일치시킵니다. 여기서, n은 정수입니다. {n}는 해당 게으른 수량자가 {n}?인 탐욕적 수량자입니다.
pl: Kwantyfikator {n} dopasowuje poprzedzający element dokładnie n razy, gdzie n jest dowolną liczbą całkowitą. {n} to kwantyfikator zachłanny, a jego powściągliwy równoważnik to {n}?.
pt_br: O quantificador {n} corresponde ao elemento precedente exatamente n vezes, em que n é qualquer número inteiro. {n} é um quantificador greedy cujo equivalente lento é {n}?
ru: Квантификатор {n} соответствует предыдущему элементу ровно n раз, где n — любое целое число. {n} — это "жадный" квантификатор, "ленивым" аналогом которого является {n}?
tr: {n} niceleyicisi, önceki öğe ile tam olarak n kez eşleşir (burada n herhangi bir tamsayıdır). {n}, gecikmeli karşılığı {n}? olan bir hızlı niceleyicidir
zh_hans: {n} 限定符恰好匹配前面的元素 n 次，其中 n 是任何整数。{n} 是贪婪限定符，其惰性等效值为 {n}?
zh_hant: {n} 數量詞會比對前置元素至少 n 次，其中 n 為任何整數。{n} 是窮盡數量詞，其少數優先的相對概念為 {n}?

# Regex_match_exactly_n_times_short
source: match exactly 'n' times
cs: shoda přesně n-krát
de: Genau n-malige Übereinstimmung
es: coincidir exactamente "n" veces
fr: rechercher une correspondance exactement 'n' fois
it: trova la corrispondenza esatta 'n' volte
ja: ちょうど 'n' 回一致
ko: 정확하게 'n'번 일치
pl: dopasuj dokładnie „n” razy
pt_br: corresponder exatamente 'n' vezes
ru: совпадение ровно "n" раз
tr: tam olarak 'n' kez eşleş
zh_hans: 刚好匹配 "n" 次
zh_hant: 比對正好 'n' 次

# Regex_match_one_or_more_times_lazy_long
source: The +? quantifier matches the preceding element one or more times, but as few times as possible. It is the lazy counterpart of the greedy quantifier +
cs: Kvantifikátor +? najde shodu předchozího elementu 1krát nebo vícekrát, ale co nejméněkrát. Jedná se o líný protějšek hladového kvantifikátoru +.
de: Der Quantifizierer "+?" stimmt mit dem vorhergehenden Element mindestens einmal, jedoch möglichst wenige Male überein. Dies ist das träge Äquivalent zum gierigen Quantifizierer "+".
es: El cuantificador +? coincide con el elemento anterior cero o más veces, pero el menor número de veces que sea posible. Es el homólogo diferido del cuantificador expansivo +
fr: Le quantificateur recherche une correspondance avec l'élément précédent, une ou plusieurs fois, mais de manière aussi limitée possible. Il s'agit de l'équivalent paresseux du quantificateur gourmand +
it: Il quantificatore +? trova la corrispondenza con l'elemento precedente una o più volte, ma il minor numero di volte possibile. Si tratta della controparte lazy del quantificatore greedy +
ja: +? 量指定子は、直前の要素の 1 回以上の繰り返しのうち、最も少ない繰り返しに一致します。これは、最長一致の量指定子 + に対応する、最短一致の量指定子です
ko: +? 수량자는 1번 이상 이전 요소와 일치시키지만 가능한 한 적은 횟수로 일치시킵니다. 탐욕적 수량자 +에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator +? dopasowuje poprzedzający element co najmniej raz, lecz możliwie jak najmniej razy. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego +.
pt_br: O quantificador +? corresponde ao elemento precedente uma ou mais vezes, mas o menor número de vezes possível. Ele é a contraparte lenta do quantificador greedy +
ru: Квантификатор +? соответствует предыдущему элементу один или несколько раз, при этом данное количество должно быть минимальным. Это "ленивый" аналог "жадного" квантификатора +
tr: +? niceleyicisi bir önceki öğeyle en az bir kez eşleşir, ancak bunu mümkün olduğunca az sayıda yapar. Bu, + hızlı niceleyicisinin gecikmeli karşılığıdır
zh_hans: +? 限定符匹配前面的元素一次或多次，但次数尽可能少。它是贪婪限定符 + 的惰性副本
zh_hant: +? 數量詞會比對前置元素一或多次，但盡可能壓低次數。這是與窮盡數量詞 + 相對的少數優先概念

# Regex_match_one_or_more_times_lazy_short
source: match one or more times (lazy)
cs: shoda 1krát nebo vícekrát (líný režim)
de: Mindestens einmalige Übereinstimmung (träge)
es: coincidir una o varias veces (diferido)
fr: rechercher une correspondance une ou plusieurs fois (paresseux)
it: trova la corrispondenza una o più volte (corrispondenza lazy)
ja: 1 回以上一致 (最短一致)
ko: 1번 이상 일치(지연)
pl: dopasuj co najmniej raz (powściągliwie)
pt_br: corresponder uma ou mais vezes (lento)
ru: совпадение один или несколько раз (ленивый)
tr: bir veya daha çok kez eşleş (en düşük kapsamlı)
zh_hans: 匹配一次或多次(惰性)
zh_hant: 比對一或多次 (少數優先)

# Regex_match_one_or_more_times_long
source: The + quantifier matches the preceding element one or more times. It is equivalent to the {1,} quantifier. + is a greedy quantifier whose lazy equivalent is +?.
cs: Kvantifikátor + najde shodu předchozího elementu 1krát nebo vícekrát. Jedná se o ekvivalent kvantifikátoru {1,}. + je hladový kvantifikátor, jehož líným ekvivalentem je +?.
de: Der Quantifizierer "+" stimmt mit dem vorhergehenden Element mindestens einmal überein. Dieser Quantifizierer ist identisch mit "{1,}". "+" ist ein gieriger Quantifizierer, dessen träges Äquivalent "+?" lautet.
es: El cuantificador + coincide con el elemento anterior una o más veces. Es equivalente al cuantificador {1,}. + es un cuantificador expansivo cuyo equivalente diferido es +?.
fr: Le quantificateur + recherche une correspondance avec l'élément précédent, une ou plusieurs fois. Il est équivalent au quantificateur {1,}. + est un quantificateur gourmand dont l'équivalent paresseux est +?.
it: Il quantificatore + trova la corrispondenza con l'elemento precedente una o più volte. Equivale al quantificatore {1,}. + è un quantificatore greedy il cui equivalente lazy è +?.
ja: + 量指定子は、直前の要素の 1 回以上の繰り返しに一致します。これは {1,} と同じです。+ は最長一致の量指定子であり、最短一致でこれに対応するのは +? です。
ko: + 수량자는 1번 이상 이전 요소와 일치시킵니다. {1,} 수량자와 같습니다. +는 해당 게으른 수량자가 +?인 탐욕적 수량자입니다.
pl: Kwantyfikator + dopasowuje poprzedzający element co najmniej raz. Jest to równoważnik kwantyfikatora {1,}. Kwantyfikator + jest zachłanny, a jego powściągliwy równoważnik to +?.
pt_br: O quantificador + corresponde ao elemento precedente uma ou mais vezes. Ele equivale ao quantificador {1,}. + é um quantificador greedy cujo equivalente lento é +?.
ru: Квантификатор + соответствует предыдущему элементу один или несколько раз. Это эквивалент квантификатора {1,}. + — это "жадный" квантификатор, "ленивым" аналогом которого является +?.
tr: + niceleyicisi bir önceki öğeyle en az bir kez eşleşir. {1,} niceleyicisi ile eşdeğerdir. +, gecikmeli karşılığı +? olan bir hızlı niceleyicidir.
zh_hans: + 限定符匹配前面的元素一次或多次。它等效于 {1,} 数量表示符。+ 是贪婪限定符，其惰性等效项为 +?。
zh_hant: + 數量詞會比對前置元素一或多次，等同於 {1,} 數量詞。+ 是窮盡數量詞，其少數優先的相對概念為 +?。

# Regex_match_one_or_more_times_short
source: match one or more times
cs: shoda 1krát nebo vícekrát
de: Mindestens einmalige Übereinstimmung
es: coincidir una o varias veces
fr: rechercher une correspondance une ou plusieurs fois
it: trova la corrispondenza una o più volte
ja: 1 回以上一致
ko: 1번 이상 일치
pl: dopasuj co najmniej raz
pt_br: corresponder uma ou mais vezes
ru: совпадение один или несколько раз
tr: en az bir kez eşleş
zh_hans: 匹配一次或多次
zh_hant: 比對一或多次

# Regex_match_zero_or_more_times_lazy_long
source: The *? quantifier matches the preceding element zero or more times, but as few times as possible. It is the lazy counterpart of the greedy quantifier *
cs: Kvantifikátor *? najde shodu předchozího elementu 0krát nebo vícekrát, ale co nejméněkrát. Jedná se o líný protějšek hladového kvantifikátoru *.
de: Der Quantifizierer "*?" stimmt mit dem vorhergehenden Element mindestens nullmal, jedoch möglichst wenige Male überein. Dies ist das träge Äquivalent zum gierigen Quantifizierer "*".
es: El cuantificador *? coincide con el elemento anterior cero o más veces, pero el menor número de veces que sea posible. Es el homólogo diferido del cuantificador expansivo *
fr: Le quantificateur *? recherche une correspondance avec l'élément précédent, zéro ou plusieurs fois, mais de manière aussi limitée possible. Il s'agit de l'équivalent paresseux du quantificateur gourmand *
it: Il quantificatore *? trova la corrispondenza con l'elemento precedente zero o più volte, ma il minor numero di volte possibile. Si tratta della controparte lazy del quantificatore greedy *
ja: *? 量指定子は、直前の要素の 0 回以上の繰り返しのうち、最も少ない繰り返しに一致します。これは、最長一致の量指定子 * に対応する、最短一致の量指定子です
ko: *? 수량자는 0번 이상 이전 요소와 일치시키지만 가능한 한 적은 횟수로 일치시킵니다. 탐욕적 수량자 *에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator *? dopasowuje poprzedzający element zero lub więcej razy, lecz możliwie jak najmniej razy. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego *.
pt_br: O quantificador *? corresponde ao elemento precedente zero ou mais vezes, mas o menor número de vezes possível. Ele é a contraparte lenta do quantificador greedy *
ru: Квантификатор *? соответствует предыдущему элементу ни одного или несколько раз, при этом данное количество должно быть минимальным. Это "ленивый" аналог "жадного" квантификатора *
tr: *? niceleyicisi bir önceki öğeyle sıfır veya daha çok kez eşleşir, ancak bunu mümkün olduğunca az sayıda yapar. Bu, * en yüksek kapsamlı niceleyicisinin en düşük kapsamlı karşılığıdır
zh_hans: *? 限定符匹配前导元素零次或多次，但次数尽可能少。它是贪婪限定符 * 的惰性副本
zh_hant: *? 數量詞會比對前置元素零或多次，但盡可能壓低次數。這是與窮盡數量詞 * 相對的少數優先概念

# Regex_match_zero_or_more_times_lazy_short
source: match zero or more times (lazy)
cs: shoda 0krát nebo vícekrát (líný režim)
de: Mindestens nullmalige Übereinstimmung (träge)
es: coincidir cero o más veces (diferido)
fr: rechercher une correspondance zéro ou plusieurs fois (paresseux)
it: trova la corrispondenza zero o più volte (corrispondenza lazy)
ja: 0 回以上一致 (最短一致)
ko: 0번 이상 일치(지연)
pl: dopasuj zero lub więcej razy (powściągliwie)
pt_br: corresponder zero ou mais vezes (lento)
ru: совпадение ни одного или несколько раз (ленивый)
tr: en az sıfır kez eşleş (gecikmeli)
zh_hans: 匹配零次或多次(惰性)
zh_hant: 比對零或多次 (少數優先)

# Regex_match_zero_or_more_times_long
source: The * quantifier matches the preceding element zero or more times. It is equivalent to the {0,} quantifier. * is a greedy quantifier whose lazy equivalent is *?.
cs: Kvantifikátor * najde shodu předchozího elementu 0krát nebo vícekrát. Jedná se o ekvivalent kvantifikátoru {0,}. * je hladový kvantifikátor, jehož líným ekvivalentem je *?.
de: Der Quantifizierer "*" stimmt mit dem vorhergehenden Element mindestens nullmal überein. Dieser Quantifizierer ist identisch mit "{0,}". "*" ist ein gieriger Quantifizierer, dessen träges Äquivalent "*?" lautet.
es: El cuantificador * coincide con el elemento anterior cero o más veces. Es equivalente al cuantificador {0,}. * es un cuantificador expansivo cuyo equivalente diferido es *?.
fr: Le quantificateur * recherche une correspondance avec l'élément précédent, zéro ou plusieurs fois. Il est équivalent au quantificateur {0,}. * est un quantificateur gourmand dont l'équivalent paresseux est *?.
it: Il quantificatore * trova la corrispondenza con l'elemento precedente zero o più volte. Equivale al quantificatore {0,}. * è un quantificatore greedy il cui equivalente lazy è *?.
ja: * 量指定子は、直前の要素の 0 回以上の繰り返しに一致します。これは {0,} と同じです。* は最長一致の量指定子で、最短一致でこれに対応するのは *? です。
ko: * 수량자는 0번 이상 이전 요소와 일치시킵니다. {0,} 수량자와 같습니다. *는 해당 게으른 수량자가 *?인 탐욕적 수량자입니다.
pl: Kwantyfikator + dopasowuje poprzedzający element zero lub więcej razy. Jest to równoważnik kwantyfikatora {0,}. Kwantyfikator * jest zachłanny, a jego powściągliwy równoważnik to *?.
pt_br: O quantificador * corresponde ao elemento precedente zero ou mais vezes. Ele equivale ao quantificador {0,}. * é um quantificador greedy cujo equivalente lento é *?.
ru: Квантификатор * соответствует предыдущему элементу ни одного или несколько раз. Это эквивалент квантификатора {0,}. * — это "жадный" квантификатор, "ленивым" аналогом которого является *?.
tr: * niceleyicisi bir önceki öğeyle en az sıfır kez eşleşir. {0,} niceleyicisi ile eşdeğerdir. *, gecikmeli karşılığı *? olan bir hızlı niceleyicidir.
zh_hans: * 限定符匹配前面的元素零次或多次。它等效于 {0,} 数量表示符。* 是贪婪限定符，其惰性等效项为 *?。
zh_hant: * 數量詞會比對前置元素零或多次，相當於 {0,} 數量詞。* 是窮盡數量詞，其少數優先的相對概念為 *?。

# Regex_match_zero_or_more_times_short
source: match zero or more times
cs: shoda 0krát nebo vícekrát
de: Mindestens nullmalige Übereinstimmung
es: coincidir cero o más veces
fr: rechercher une correspondance zéro ou plusieurs fois
it: trova la corrispondenza zero o più volte
ja: 0 回以上一致
ko: 0번 이상 일치
pl: dopasuj zero lub więcej razy
pt_br: corresponder zero ou mais vezes
ru: совпадение ни одного или несколько раз
tr: en az sıfır kez eşleş
zh_hans: 匹配零次或多次
zh_hant: 比對零或多次

# Regex_match_zero_or_one_time_lazy_long
source: The ?? quantifier matches the preceding element zero or one time, but as few times as possible. It is the lazy counterpart of the greedy quantifier ?
cs: Kvantifikátor ?? najde shodu předchozího elementu 0krát nebo 1krát, ale co nejméněkrát. Jedná se o líný protějšek hladového kvantifikátoru ?.
de: Der Quantifizierer "??" stimmt mit dem vorhergehenden Element null- oder einmal, jedoch möglichst wenige Male überein. Dies ist das träge Äquivalent zum gierigen Quantifizierer "?".
es: El cuantificador ?? coincide con el elemento anterior cero veces o una, pero el menor número de veces que sea posible. Es el homólogo diferido del cuantificador expansivo ?
fr: Le quantificateur ?? recherche une correspondance avec l'élément précédent, zéro ou une fois, mais de manière aussi limitée possible. Il s'agit de l'équivalent paresseux du quantificateur gourmand ?
it: Il quantificatore ?? trova la corrispondenza con l'elemento precedente zero o una volta, ma il minor numero di volte possibile. Si tratta della controparte lazy del quantificatore greedy ?
ja: ?? 量指定子は、直前の要素の 0 回または 1 回の繰り返しのうち、最も少ない繰り返しに一致します。これは、最長一致の量指定子 ? に対応する、最短一致の量指定子です
ko: ?? 수량자는 0번 이상 이전 요소와 일치시키지만 가능한 한 적은 횟수로 일치시킵니다. 탐욕적 수량자 ?에 대응되는 게으른 수량자입니다.
pl: Kwantyfikator ?? dopasowuje poprzedzający element zero lub więcej razy, lecz możliwie jak najmniej razy. Jest to powściągliwy odpowiednik kwantyfikatora zachłannego ?.
pt_br: O quantificador ?? corresponde ao elemento precedente zero ou uma vez, mas o menor número de vezes possível. Ele é a contraparte lenta do quantificador greedy ?
ru: Квантификатор ?? соответствует предыдущему элементу ни одного раза или один раз, при этом данное количество должно быть минимальным. Это "ленивый" аналог "жадного" квантификатора ?
tr: ?? niceleyicisi bir önceki öğeyle sıfır veya bir kez eşleşir, ancak bunu mümkün olduğunca az sayıda yapar. Bu, ? hızlı niceleyicisinin gecikmeli karşılığıdır
zh_hans: ?? 限定符匹配前面的元素零次或一次，但次数尽可能少。它是贪婪限定符 ? 的惰性副本
zh_hant: ?? 數量詞會比對前置元素零或一次，但盡可能壓低次數。這是與窮盡數量詞 ? 相對的少數優先概念

# Regex_match_zero_or_one_time_lazy_short
source: match zero or one time (lazy)
cs: shoda 0krát nebo 1krát (líný režim)
de: Null- oder einmalige Übereinstimmung (träge)
es: coincidir cero veces o una vez (diferido)
fr: rechercher une correspondance zéro ou une fois (paresseux)
it: trova la corrispondenza zero o una volta (corrispondenza lazy)
ja: 0 回または 1 回一致 (最短一致)
ko: 0 또는 1번 일치(지연)
pl: dopasuj zero razy lub jeden raz (powściągliwie)
pt_br: corresponder nenhuma ou uma vez (lento)
ru: совпадение ни одного раза или один раз (ленивый)
tr: sıfır veya bir kez eşleş (gecikmeli)
zh_hans: 匹配零次或一次(惰性)
zh_hant: 比對零或一次 (少數優先)
