Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# year_2_digits_description
source: The "yy" custom format specifier represents the year as a two-digit number. If the year has more than two digits, only the two low-order digits appear in the result. If the two-digit year has fewer than two significant digits, the number is padded with leading zeros to produce two digits. In a parsing operation, a two-digit year that is parsed using the "yy" custom format specifier is interpreted based on the Calendar.TwoDigitYearMax property of the format provider's current calendar. The following example parses the string representation of a date that has a two-digit year by using the default Gregorian calendar of the en-US culture, which, in this case, is the current culture. It then changes the current culture's CultureInfo object to use a GregorianCalendar object whose TwoDigitYearMax property has been modified.
cs: Specifikátor vlastního formátu yy reprezentuje rok jako dvoumístné číslo. Pokud má rok více než dvě číslice, ve výsledku se budou nacházet jen dvě číslice nižšího řádu. Pokud má dvoumístný rok méně než dvě platné číslice, číslo se doplní nulami na začátku, aby mělo dvě číslice. Při operaci parsování se dvoumístný rok parsovaný pomocí specifikátoru vlastního formátu interpretuje podle vlastnosti Calendar.TwoDigitYearMax aktuálního kalendáře poskytovatele formátu. Následující příklad parsuje řetězcovou reprezentaci data, která má dvoumístný rok, pomocí výchozího Gregoriánského kalendáře jazykové verze en-US, která je v tomto případě zároveň aktuální jazykovou verzí. Pak změní objekt CultureInfo aktuální jazykové verze tak, aby používala objekt GregorianCalendar, jehož vlastnost TwoDigitYearMax bude upravená.
de: Der benutzerdefinierte Formatbezeichner "yy" repräsentiert das Jahr als zweistellige Zahl. Wenn das Jahr mehr als zwei Stellen aufweist, werden im Ergebnis nur die zwei niederwertigen Stellen angezeigt. Umfasst das zweistellige Jahr weniger als zwei signifikante Stellen, wird die Zahl mit führenden Nullen aufgefüllt, um zwei Stellen zu erzeugen. Bei der Analyse eines zweistelligen Jahreswerts mit dem benutzerdefinierten Formatbezeichner "yy" wird das Jahr auf Grundlage der Calendar.TwoDigitYearMax-Eigenschaft des aktuellen Kalenders des Formatanbieters interpretiert. Das folgende Beispiel analysiert die Zeichenfolgendarstellung eines Datums mit zweistelliger Jahreszahl unter Verwendung des standardmäßigen gregorianischen Kalenders der Kultur "en-US" (in diesem Fall die aktuelle Kultur). Anschließend wird das CultureInfo-Objekt der aktuellen Kultur so geändert, dass ein GregorianCalendar-Objekt verwendet wird, dessen TwoDigitYearMax-Eigenschaft geändert wurde.
es: El especificador de formato personalizado "yy" representa el año como un número de dos dígitos. Si el año tiene más de dos dígitos, en el resultado solo aparecen los dos dígitos de orden inferior. Si el año de dos dígitos tiene menos de dos dígitos significativos, se le pone un cero delante al número para tener dos dígitos. En una operación de análisis, un año de dos dígitos que se analiza con el especificador de formato personalizado "yy" se interpreta en función de la propiedad Calendar.TwoDigitYearMax del calendario actual del proveedor de formato. En el ejemplo siguiente se analiza la representación de cadena de una fecha que tiene un año de dos dígitos con el calendario gregoriano predeterminado de la referencia cultural en-US, que, en este caso, es la referencia cultural actual. Después, se cambia el objeto CultureInfo de la referencia cultural actual para que use un objeto GregorianCalendar cuya propiedad TwoDigitYearMax se ha modificado.
fr: Le spécificateur de format personnalisé "yy" représente l'année sous la forme d'un nombre à deux chiffres. Si l'année comporte plus de deux chiffres, seuls les deux chiffres de poids faible apparaissent dans le résultat. Si l'année à deux chiffres comporte moins de deux chiffres significatifs, la valeur numérique est complétée avec des zéros de début pour produire deux chiffres. Dans une opération d'analyse, une année à deux chiffres analysée à l'aide du spécificateur de format personnalisé "yy" est interprétée en fonction de la propriété Calendar.TwoDigitYearMax du calendrier actuel du fournisseur de format. L'exemple suivant analyse la représentation sous forme de chaîne d'une date qui comporte une année à deux chiffres, à l'aide du calendrier grégorien par défaut de la culture en-US, qui, dans le cas présent, correspond à la culture actuelle. Il change ensuite l'objet CultureInfo de la culture actuelle pour utiliser un objet GregorianCalendar dont la propriété TwoDigitYearMax a été modifiée.
it: L'identificatore di formato personalizzato "yy" rappresenta l'anno come numero a due cifre. Se l'anno ha più di due cifre, nel risultato vengono visualizzate solo le due cifre di ordine inferiore. Se l'anno a due cifre ha meno di due cifre significative, prima del numero vengono aggiunti gli zeri necessari per ottenere due cifre. In un'operazione di analisi un anno a due cifre analizzato usando l'identificatore di formato personalizzato "yy" viene interpretato in base alla proprietà Calendar.TwoDigitYearMax del calendario corrente del provider di formato. Nell'esempio seguente viene analizzata la rappresentazione di stringa di una data con un anno a due cifre usando il calendario gregoriano predefinito delle impostazioni cultura en-US, che, in questo caso, sono le impostazioni cultura correnti. Modifica quindi l'oggetto CultureInfo delle impostazioni cultura correnti per usare un oggetto GregorianCalendar la cui proprietà TwoDigitYearMax è stata modificata.
ja: "yy" カスタム書式指定子は、年を 2 桁の数値として表します。年が 2 桁を超える場合、結果には下 2 桁のみが表示されます。有効数字 2 桁に満たない年については、先行ゼロが追加され 2 桁の数値で表されます。 解析操作では、"yy" カスタム書式指定子を使用して解析された 2 桁の年は、書式プロバイダーの現在のカレンダーの Calendar.TwoDigitYearMax プロパティに基づいて解釈されます。次の例は、2 桁の年を含む日付の文字列表現を、en-US カルチャ (このケースでは現在のカルチャ) の既定のグレゴリオ暦を使用して解析し、その後、現在のカルチャの CultureInfo オブジェクトを、TwoDigitYearMax プロパティが変更されている GregorianCalendar オブジェクトを使用するように変更しています。
ko: "yy" 사용자 지정 형식 지정자는 연도를 두 자릿수 숫자로 나타냅니다. 연도에 세 자릿수 이상이 있는 경우 결과에 최하위 숫자 2개만 표시됩니다. 두 자릿수 연도에 3개 미만의 유효숫자가 있는 경우 앞을 0으로 채워 두 자릿수를 생성합니다. 구문 분석 연산에서, "yy" 사용자 지정 형식 지정자를 사용하여 구문 분석되는 두 자릿수 연도는 형식 공급자의 현재 달력의 Calendar.TwoDigitYearMax 속성을 기준으로 해석됩니다. 다음 예제에서는 두 자릿수 연도를 갖는 날짜의 문자열 표현을 이 예제의 현재 문화권인 en-US 문화권의 기본 양력을 사용하여 구문 분석합니다. 그런 다음 TwoDigitYearMax 속성이 수정된 GregorianCalendar 개체를 사용하도록 현재 문화권의 CultureInfo 개체를 변경합니다.
pl: Niestandardowy specyfikator formatu „yy” reprezentuje rok w postaci liczby dwucyfrowej. Jeśli rok składa się z więcej niż dwóch cyfr, w wyniku pojawiają się tylko dwie najmniej znaczące cyfry. Jeśli rok dwucyfrowy ma mniej niż dwie cyfry znaczące, liczba jest uzupełniana zerami wiodącymi w celu uzyskania dwóch cyfr. W ramach operacji analizowania rok dwucyfrowy analizowany przy użyciu niestandardowego specyfikatora formatu „yy” jest interpretowany na podstawie właściwości Calendar.TwoDigitYearMax bieżącego kalendarza dostawcy formatu. Poniższy przykład przedstawia analizowanie reprezentacji ciągu daty, który zawiera rok dwucyfrowy, za pomocą domyślnego kalendarza gregoriańskiego kultury en-US, która w tym przypadku jest kulturą bieżącą. Następnie jest zmieniany obiekt CultureInfo bieżącej kultury, tak aby używał obiektu GregorianCalendar ze zmodyfikowaną właściwością TwoDigitYearMax.
pt_br: O especificador de formato personalizado "yy" representa o ano como um número de dois dígitos. Se o ano tiver mais de dois dígitos, somente os dois dígitos de ordem baixa aparecerão no resultado. Se o ano de dois dígitos tiver menos de dois dígitos significativos, o número será preenchido com zeros à esquerda para produzir dois dígitos. Em uma operação de análise, um ano de dois dígitos analisado usando o especificador de formato personalizado "yy" é interpretado com base na Propriedade Calendar.TwoDigitYearMax do calendário atual do provedor de formato. O exemplo a seguir analisa a representação de cadeia de caracteres de uma data que tem um ano de dois dígitos usando o calendário gregoriano padrão da cultura en-US, que, neste caso, é a cultura atual. Em seguida, altera o objeto CultureInfo da cultura atual para usar um objeto GregorianCalendar cuja propriedade TwoDigitYearMax foi modificada.
ru: Описатель пользовательского формата "yy" представляет год как число из двух цифр. Если в значении года больше двух значащих цифр, в результате появятся только два младших разряда. Если двузначное значение года содержит меньше двух значащих цифр, число дополняется начальными нулями, чтобы получить два разряда. В операции анализа двузначное значение года, проанализированное с использованием описателя пользовательского формата "yy", интерпретируется на основе Calendar.TwoDigitYearMax текущего календаря поставщика формата. В следующем примере строковое представление даты с двузначным годом анализируется с использованием григорианского календаря для языка и региональных параметров en-US, которые в данном случае являются текущими. Затем объект CultureInfo текущих языка и региональных параметров изменяется для использования объекта GregorianCalendar, свойство TwoDigitYearMax которого было изменено.
tr: "yy" özel biçim belirticisi yılı iki rakamlı bir sayı olarak temsil eder. Yılda iki rakamdan fazlası varsa, sonuçta yalnızca iki düşük değerli rakam görüntülenir. İki rakamlı yılda ikiden daha az anlamlı basamak varsa, iki rakam üretmek için sayının önüne sıfırlar eklenir. Bir ayrıştırma işleminde, "yy" özel biçim belirticisi kullanılarak ayrıştırılan iki rakamlı bir yıl, biçim sağlayıcının geçerli takvimindeki Calendar.TwoDigitYearMax özelliği temel alınarak yorumlanır. Aşağıdaki örnekte, iki rakamlı bir yılı olan bir tarihin dize gösterimi, geçerli kültür olan en-US kültürünün varsayılan Gregoryen takvimi kullanılarak ayrıştırılmaktadır. Daha sonra, geçerli kültürün CultureInfo nesnesi, TwoDigitYearMax özelliği değiştirilmiş bir GregorianCalendar nesnesini kullanacak şekilde değiştirilmektedir.
zh_hans: "yy" 自定义格式说明符将年份表示为两位数字。如果年份具有两个以上的数字，则结果中仅显示两个低序位数字。如果两位数的年份的有效数字少于两个，则用前导零填充该数字以生成两个数字。 在分析操作中，使用 "yy" 自定义格式说明符分析的两位数年份根据格式提供程序当前日历的 Calendar.TwoDigitYearMax 属性进行解释。下面的示例使用 en-US 区域性的默认公历日历(在本例中为当前区域性)分析具有两位数年份的日期的字符串表示形式。然后更改当前区域性的 CultureInfo 对象，以使用其 TwoDigitYearMax 属性已被修改的 GregorianCalendar 对象。
zh_hant: "yy" 自訂格式規範會將年份表示為雙位數數字。如果該年份超過雙位數，則結果只會顯示到十位數。如果雙位數年份的有效位數少於兩個，則會在該數字開頭填補零，以產生雙位數。 在剖析作業中，使用 "yy" 自訂格式規範剖析的雙位數年份，會依據格式提供者目前行事曆的 Calendar.TwoDigitYearMax 屬性來解譯。下列範例會使用 en-US 文化特性 (Culture) 的預設西曆，來剖析包含雙位數年份之日期的字串表示法，在此例中，en-US 文化特性 (Culture) 為目前的文化特性 (Culture)。接著會將目前文化特性 (Culture) 的 CultureInfo 物件，變更為使用已修改 TwoDigitYearMax 屬性的 GregorianCalendar 物件。

source: year (3-4 digits)
cs: rok (3–4 číslice)
de: Jahr (3–4 Stellen)
es: año (3-4 dígitos)
fr: année (3 à 4 chiffres)
it: Anno (3-4 cifre)
ja: 年 (3 ～ 4 桁)
ko: 년(3~4자리)
pl: rok (3-4 cyfry)
pt_br: ano (3-4 dígitos)
ru: год (3–4 цифры)
tr: yıl (3-4 rakam)
zh_hans: 年(3-4 位数)
zh_hant: 年份 (3-4 位數)

# year_3_4_digits_description
source: The "yyy" custom format specifier represents the year with a minimum of three digits. If the year has more than three significant digits, they are included in the result string. If the year has fewer than three digits, the number is padded with leading zeros to produce three digits.
cs: Specifikátor vlastního formátu yyy představuje rok s nejméně třemi číslicemi. Pokud má rok více než tři platné číslice, zahrnou se do výsledného řetězce. Pokud má rok méně než tři číslice, číslo se doplní nulami na začátku, aby mělo tři číslice.
de: Der benutzerdefinierte Formatbezeichner "yyy" repräsentiert das Jahr mit mindestens drei Stellen. Wenn das Jahr mehr als drei signifikante Stellen aufweist, werden diese in die Ergebniszeichenfolge eingeschlossen. Umfasst das Jahr weniger als drei Stellen, wird die Zahl mit führenden Nullen aufgefüllt, um drei Stellen zu erzeugen.
es: El especificador de formato personalizado "yyy" representa el año con un mínimo de tres dígitos. Si el año tiene más de tres dígitos significativos, se incluyen en la cadena de resultado. Si el año tiene menos de tres dígitos, se le ponen ceros delante al número hasta tener tres dígitos.
fr: Le spécificateur de format personnalisé "yyy" représente l'année sous la forme d'un nombre à trois chiffres au minimum. Si l'année comporte plus de trois chiffres significatifs, ils sont inclus dans la chaîne résultante. Si l'année comporte moins de trois chiffres, la valeur numérique est complétée avec des zéros de début pour produire trois chiffres.
it: L'identificatore di formato personalizzato "yyy" rappresenta l'anno con un minimo di tre cifre. Se l'anno ha più di tre cifre significative, queste vengono incluse nella stringa di risultato. Se l'anno ha meno di tre cifre, prima del numero vengono aggiunti gli zeri necessari per ottenere tre cifre.
ja: "yyy" カスタム書式指定子は、年を 3 桁以上で表します。年が有効数字 3 桁を超える場合、書式設定後の文字列にはすべての桁が表示されます。3 桁に満たない年については、先行ゼロが追加され 3 桁の数値で表されます。
ko: "yyy" 사용자 지정 형식 지정자는 세 자릿수 이상으로 연도를 나타냅니다. 연도에 4개 이상의 유효 숫자가 있는 경우 결과 문자열에 포함됩니다. 연도에 3개 미만의 유효 숫자가 있는 경우 앞을 0으로 채워 세 자릿수를 생성합니다.
pl: Niestandardowy specyfikator formatu „yyy” reprezentuje rok za pomocą minimalnie 3 cyfr. Jeśli rok ma więcej niż trzy cyfry znaczące, są one uwzględniane w ciągu wyniku. Jeśli rok ma mniej niż trzy cyfry, liczba jest uzupełniana zerami wiodącymi, tak aby otrzymać trzy cyfry.
pt_br: O especificador de formato personalizado "yyy" representa o ano com um mínimo de três dígitos. Se o ano tiver mais de três dígitos significativos, eles serão incluídos na cadeia de caracteres de resultado. Se o ano tiver menos de três dígitos, o número será preenchido com zeros à esquerda para produzir três dígitos.
ru: Описатель пользовательского формата "yyy" представляет год как число из по меньшей мере трех цифр. Если в значении года больше трех значащих цифр, они включаются в результирующую строку. Если значение года содержит меньше трех цифр, число дополняется начальными нулями, чтобы получить три разряда.
tr: "yyy" özel biçim belirticisi yılı minimum üç rakamla temsil eder. Yılda üçten fazla anlamlı basamak varsa, bunlar sonuç dizesine eklenir. Yılda üçten az rakam varsa, üç rakam üretmek için sayının başına sıfırlar eklenir.
zh_hans: "yyy" 自定义格式说明符表示最少为三位的年份。如果年份有三个以上的有效数字，则结果字符串中会显示所有数字。如果年份少于三位数，则用前导零填充该数字以生成三位数。
zh_hant: "yyy" 自訂格式規範代表最少三位數的年份。如果該年份有三個以上的有效位數，則這些位數會包含在結果字串中。如果年份少於三位數，則會在該數字開頭填補零，以產生三位數。

source: year (4 digits)
cs: rok (4 číslice)
de: Jahr (4 Stellen)
es: año (4 dígitos)
fr: année (4 chiffres)
it: Anno (4 cifre)
ja: 年 (4 桁)
ko: 년(4자리)
pl: rok (4 cyfry)
pt_br: ano (4 dígitos)
ru: год (4 цифры)
tr: yıl (4 rakam)
zh_hans: 年(4 位数字)
zh_hant: 年份 (4 位數)

# year_4_digits_description
source: The "yyyy" custom format specifier represents the year with a minimum of four digits. If the year has more than four significant digits, they are included in the result string. If the year has fewer than four digits, the number is padded with leading zeros to produce four digits.
cs: Specifikátor vlastního formátu yyyy představuje rok s nejméně čtyřmi číslicemi. Pokud má rok více než čtyři platné číslice, zahrnou se do výsledného řetězce. Pokud má rok méně než čtyři číslice, číslo se doplní nulami na začátku, aby mělo čtyři číslice.
de: Der benutzerdefinierte Formatbezeichner "yyyy" repräsentiert das Jahr mit mindestens vier Stellen. Wenn das Jahr mehr als vier signifikante Stellen aufweist, werden sie in die Ergebniszeichenfolge eingeschlossen. Umfasst das Jahr weniger als vier Stellen, wird die Zahl mit führenden Nullen aufgefüllt, um vier Stellen zu erzeugen.
es: El especificador de formato personalizado "yyyy" representa el año con un mínimo de cuatro dígitos. Si el año tiene más de cuatro dígitos significativos, se incluyen en la cadena de resultado. Si el año tiene menos de cuatro dígitos, se le ponen ceros delante al número hasta tener cuatro dígitos.
fr: Le spécificateur de format personnalisé "yyyy" représente l'année sous la forme d'un nombre à quatre chiffres au minimum. Si l'année comporte plus de quatre chiffres significatifs, ils sont inclus dans la chaîne résultante. Si l'année comporte moins de quatre chiffres, la valeur numérique est complétée avec des zéros de début pour produire quatre chiffres.
it: L'identificatore di formato personalizzato "yyyy" rappresenta l'anno con un minimo di quattro cifre. Se l'anno ha più di quattro cifre significative, queste vengono incluse nella stringa di risultato. Se l'anno ha meno di quattro cifre, prima del numero vengono aggiunti gli zeri necessari per ottenere quattro cifre.
ja: "yyyy" カスタム書式指定子は、年を 4 桁以上で表します。年が有効数字 4 桁を超える場合、書式設定後の文字列にはすべての桁が表示されます。4 桁に満たない年については、先行ゼロが追加され 4 桁の数値で表されます。
ko: "yyyy" 사용자 지정 형식 지정자는 네 자릿수 이상으로 연도를 나타냅니다. 연도에 5개 이상의 유효 숫자가 있는 경우 결과 문자열에 포함됩니다. 연도에 4개 미만의 유효 숫자가 있는 경우 앞을 0으로 채워 네 자릿수를 생성합니다.
pl: Niestandardowy specyfikator formatu „yyyy” reprezentuje rok za pomocą minimalnie 4 cyfr. Jeśli rok ma więcej niż cztery cyfry znaczące, są one uwzględniane w ciągu wyniku. Jeśli rok ma mniej niż cztery cyfry, liczba jest uzupełniana zerami wiodącymi, tak aby otrzymać cztery cyfry.
pt_br: O especificador de formato personalizado "yyyy" representa o ano com um mínimo de quatro dígitos. Se o ano tiver mais de quatro dígitos significativos, eles serão incluídos na cadeia de caracteres de resultado. Se o ano tiver menos de quatro dígitos, o número será preenchido com zeros à esquerda para produzir quatro dígitos.
ru: Описатель пользовательского формата "yyyy" представляет год как число из по меньшей мере четырех цифр. Если в значении года больше четырех значащих цифр, они включаются в результирующую строку. Если значение года содержит меньше четырех цифр, число дополняется начальными нулями, чтобы получить четыре разряда.
tr: "yyyy" özel biçim belirticisi yılı minimum dört rakamla temsil eder. Yılda dörtten fazla anlamlı basamak varsa, bunlar sonuç dizesine eklenir. Yılda dörtten az rakam varsa, dört rakam üretmek için sayının başına sıfırlar eklenir.
zh_hans: "yyyy" 自定义格式说明符表示最少为四位的年份。如果年份有四个以上的有效数字，则结果字符串中会显示所有数字。如果年份少于四位数，则用前导零填充该数字以生成四位数。
zh_hant: "yyyy" 自訂格式規範代表最少四位數的年份。如果該年份有四個以上的有效位數，則這些位數會包含在結果字串中。如果年份少於四位數，則會在該數字開頭填補零，以產生四位數。

source: year (5 digits)
cs: rok (5 číslic)
de: Jahr (5 Stellen)
es: año (5 dígitos)
fr: année (5 chiffres)
it: Anno (5 cifre)
ja: 年 (5 桁)
ko: 년(5자리)
pl: rok (5 cyfr)
pt_br: ano (5 dígitos)
ru: год (5 цифр)
tr: yıl (5 rakam)
zh_hans: 年(5 位数)
zh_hant: 年份 (5 位數)
