Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# date_separator_description
source: The "/" custom format specifier represents the date separator, which is used to differentiate years, months, and days. The appropriate localized date separator is retrieved from the DateTimeFormatInfo.DateSeparator property of the current or specified culture. Note: To change the date separator for a particular date and time string, specify the separator character within a literal string delimiter. For example, the custom format string mm'/'dd'/'yyyy produces a result string in which "/" is always used as the date separator. To change the date separator for all dates for a culture, either change the value of the DateTimeFormatInfo.DateSeparator property of the current culture, or instantiate a DateTimeFormatInfo object, assign the character to its DateSeparator property, and call an overload of the formatting method that includes an IFormatProvider parameter. If the "/" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: Specifikátor vlastního formátu / představuje oddělovač data, pomocí kterého se odlišují roky, měsíce a dny. Správný lokalizovaný oddělovač data se načítá z vlastnosti DateTimeFormatInfo.DateSeparator aktuální nebo zadané jazykové verze. Poznámka: Pokud chcete změnit oddělovač data pro konkrétní řetězec data a času, zadejte znak oddělovače v oddělovači literálního řetězce. Například řetězec s vlastním formátem mm'/'dd'/'yyyy vytvoří výsledný řetězec, ve kterém se / vždy použije jako oddělovač data. Pokud chcete oddělovač data změnit pro všechna data v jazykové verzi, buď změňte hodnotu vlastnosti DateTimeFormatInfo.DateSeparator aktuální jazykové verze, nebo vytvořte instanci objektu DateTimeFormatInfo, přiřaďte znak do jeho vlastnosti DateSeparator a zavolejte přetížení metody formátování, která zahrnuje parametr IFormatProvider. Pokud se specifikátor formátu / použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času a vyvolá FormatException.
de: Der benutzerdefinierte Formatbezeichner "/" repräsentiert das Datumstrennzeichen, das zur Unterscheidung von Jahren, Monaten und Tagen verwendet wird. Das geeignete lokalisierte Datumstrennzeichen wird aus der DateTimeFormatInfo.DateSeparator-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen. Hinweis: Um das Datumstrennzeichen für eine bestimmte Datums- und Uhrzeitzeichenfolge zu ändern, geben Sie das Trennzeichen innerhalb eines Trennzeichens einer Literalzeichenfolge an. Beispielsweise erzeugt die benutzerdefinierte Formatzeichenfolge "mm'/'dd'/'yyyy" eine Ergebniszeichenfolge, in der stets "/" als Datumstrennzeichen verwendet wird. Um das Datumstrennzeichen für alle Datumswerte für eine Kultur zu ändern, ändern Sie entweder den Wert der DateTimeFormatInfo.DateSeparator-Eigenschaft der aktuellen Kultur, oder instanziieren Sie ein DateTimeFormatInfo-Objekt, weisen Sie das Zeichen der zugehörigen DateSeparator-Eigenschaft zu, und rufen Sie eine Überladung der Formatierungsmethode auf, die einen IFormatProvider-Parameter umfasst. Bei Verwendung des Formatbezeichners "/" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner für Datums- und Uhrzeitwerte interpretiert und löst eine FormatException aus.
es: El especificador de formato personalizado "/" representa el separador de fecha, que se usa para diferenciar los años, los meses y los días. El separador de fecha localizado apropiado se recupera de la propiedad DateTimeFormatInfo.DateSeparator de la referencia cultural actual o especificada. Nota: Para cambiar el separador de fecha de una cadena de fecha y hora determinada, especifique el carácter separador dentro de un delimitador de cadena literal. Por ejemplo, la cadena de formato personalizado mm'/'dd'/'aaaa genera una cadena de resultado en la que "/" se usa siempre como el separador de fecha. Para cambiar el separador de fecha de todas las fechas de una referencia cultural, cambie el valor de la propiedad DateTimeFormatInfo.DateSeparator de la referencia cultural actual, o bien cree una instancia de un objeto DateTimeFormatInfo, asigne el carácter a su propiedad DateSeparator y llame a una sobrecarga del método de formato que incluye un parámetro IFormatProvider. Si el especificador de formato "/" se usa sin otros especificadores de formato personalizado, se interpreta como un especificador de formato de fecha y hora estándar y produce una excepción FormatException.
fr: Le spécificateur de format personnalisé "/" représente le séparateur de date, qui est utilisé pour différencier les années, les mois et les jours. Le séparateur de date localisé approprié est récupéré à partir de la propriété DateTimeFormatInfo.DateSeparator de la culture actuelle ou spécifiée. Remarque : Pour changer le séparateur de date d'une chaîne de date et d'heure particulière, spécifiez le caractère de séparation dans un délimiteur de chaîne littérale. Par exemple, la chaîne de format personnalisée mm'/'dd'/'yyyy produit une chaîne de résultat dans laquelle "/" est toujours utilisé en tant que séparateur de date. Pour changer le séparateur de date de toutes les dates d'une culture, changez la valeur de la propriété DateTimeFormatInfo.DateSeparator de la culture actuelle, ou instanciez un objet DateTimeFormatInfo, affectez le caractère à sa propriété DateSeparator, puis appelez une surcharge de la méthode de format qui inclut un paramètre IFormatProvider. Si le spécificateur de format "/" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: L'identificatore di formato personalizzato "/" rappresenta il separatore di data usato per distinguere anni, mesi e giorni. Il separatore di data localizzato appropriato viene recuperato dalla proprietà DateTimeFormatInfo.DateSeparator delle impostazioni cultura correnti o specificate. Nota: per modificare il separatore di data per una particolare stringa di data e ora, specificare il carattere separatore all'interno di un delimitatore di stringa letterale. La stringa con formato personalizzato mm'/'dd'/'yyyy, ad esempio, produce una stringa in cui come separatore di data viene sempre usato "/". Per cambiare il separatore di data per tutte le date per le impostazioni cultura, modificare il valore della proprietà DateTimeFormatInfo.DateSeparator per le impostazioni cultura correnti oppure creare un'istanza di un oggetto DateTimeFormatInfo, assegnare il carattere alla relativa proprietà DateSeparator e chiamare un overload del metodo di formattazione che include un parametro IFormatProvider. Se l'identificatore di formato "/" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: "/" カスタム書式指定子は、年、月、日を区別するために使用される日付の区切り記号を表します。適切なローカライズされた日付区切り記号は、現在の、または指定したカルチャの DateTimeFormatInfo.DateSeparator プロパティから取得されます。 注: 特定の日時文字列の日付の区切り記号を変更するには、リテラル文字列区切り記号で囲んで区切り文字を指定します。たとえば、カスタム書式指定文字列 mm'/'dd'/'yyyy では、"/" が常に日付区切り記号として使用されて結果文字列が生成されます。カルチャのすべての日付について日付区切り記号を変更するには、現在のカルチャの DateTimeFormatInfo.DateSeparator プロパティの値を変更するか、DateTimeFormatInfo オブジェクトをインスタンス化し、その DateSeparator プロパティに文字を割り当てて、IFormatProvider パラメーターを含む書式設定メソッドのオーバーロードを呼び出します。 "/" 書式指定子を他のカスタム書式指定子なしで使用すると、標準日時書式指定子として解釈され、FormatException がスローされます。
ko: "/" 사용자 지정 형식 지정자는 년, 월, 일을 구분하는 데 사용되는 날짜 구분 기호를 나타냅니다. 지역화된 적절한 날짜 구분 기호가 현재 문화권 또는 지정된 문화권의 DateTimeFormatInfo.DateSeparator 속성에서 검색됩니다. 참고: 특정 날짜 및 시간 문자열의 날짜 구분 기호를 변경하려면 리터럴 문자열 구분 기호 내에서 구분 기호 문자를 지정하세요. 예를 들어, 사용자 지정 형식 문자열 mm'/'dd'/'yyyy는 "/"가 항상 날짜 구분 기호로 사용되는 결과 문자열을 생성합니다. 문화권의 모든 날짜에 대해 날짜 구분 기호를 변경하려면 현재 문화권의 DateTimeFormatInfo.DateSeparator 속성 값을 변경하거나 DateTimeFormatInfo 개체를 인스턴스화한 후 해당 DateSeparator 속성에 문자를 할당하고 IFormatProvider 매개 변수를 포함하는 형식 지정 메서드의 오버로드를 호출하세요. 다른 사용자 지정 형식 지정자 없이 "/" 형식 지정자를 사용하면 표준 날짜 및 시간 형식 지정자로 해석되어 FormatException을 throw합니다.
pl: Indywidualny specyfikator formatu „/” reprezentuje separator daty, który służy do rozdzielania lat, miesięcy i dni. Odpowiedni zlokalizowany separator jest pobierany z właściwości DateTimeFormatInfo.DateSeparator bieżącej lub określonej kultury. Uwaga: Aby zmienić separator daty dla określonego ciągu daty i godziny, określ znak separatora w ograniczniku ciągu literału. Na przykład ciąg formatu niestandardowego mm'/'dd'/'yyyy daje ciąg wyniku, w którym znak „/” jest zawsze używany jako separator daty. Aby zmienić separator daty dla wszystkich dat w kulturze, zmień wartość właściwości DateTimeFormatInfo.DateSeparator bieżącej kultury lub utwórz wystąpienie obiektu DateTimeFormatInfo, przypisz dany znak do jego właściwości DateSeparator i wywołaj przeciążenie metody formatowania, która zawiera parametr IFormatProvider. Jeśli specyfikator formatu „/” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny i zwróci wyjątek FormatException.
pt_br: O especificador de formato personalizado "/" representa o separador de data, que é usado para diferenciar anos, meses e dias. O separador de data localizado apropriado é recuperado da propriedade DateTimeFormatInfo.DateSeparator da cultura atual ou especificada. Observação: para alterar o separador de data de uma determinada cadeia de caracteres de data e hora, especifique o caractere separador em um delimitador de cadeia de caracteres literal. Por exemplo, a cadeia de caracteres de formato personalizado mm'/'dd'/'yyyy produz uma cadeia de resultado na qual "/" é sempre usado como separador de data. Para alterar o separador de data para todas as datas para uma cultura, altere o valor da propriedade DateTimeFormatInfo.DateSeparator da cultura atual ou crie uma instância de um objeto DateTimeFormatInfo, atribua o caractere à sua propriedade DateSeparator e chame uma sobrecarga do método de formatação que inclui um parâmetro IFormatProvider. Se o especificador de formato "/" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: Описатель пользовательского формата "/" представляет разделитель компонентов даты, который позволяет различать годы, месяцы и дни. Соответствующий локализованный разделитель компонентов даты извлекается из свойства DateTimeFormatInfo.DateSeparator текущих или заданных языка и региональных параметров. Примечание. Чтобы изменить разделитель компонентов даты для определенной строки даты и времени, укажите знак разделения в разделителе литеральной строки. Например, строка пользовательского формата mm'/'dd'/'yyyy дает результирующую строку, в которой "/" всегда используется в качестве разделителя компонентов даты. Чтобы изменить разделитель компонентов даты для всех дат для языка и региональных параметров, измените значение свойства DateTimeFormatInfo.DateSeparator текущих языка и региональных параметров или создайте экземпляр объекта DateTimeFormatInfo, присвойте этот знак его свойству DateSeparator и вызовите перегрузку метода форматирования, включающую параметр IFormatProvider. Если описатель формата "/" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: "/" özel biçim belirticisi yılları, ayları ve günleri ayırt etmek için kullanılan tarih ayırıcısını temsil eder. Uygun yerelleştirilmiş tarih ayırıcısı, geçerli veya belirtilen kültürün DateTimeFormatInfo.DateSeparator özelliğinden alınır. Not: Belirli bir tarih ve saat dizesinin tarih ayırıcısını değiştirmek için ayırıcı karakteri bir sabit dize sınırlayıcısı içinde belirtin. Örneğin, özel biçim dizesi gg'/'aa'/'yyyy, tarih ayırıcısı olarak her zaman "/" kullanılan bir sonuç dizesi oluşturur. Bir kültürde tüm tarihlerin tarih ayırıcısını değiştirmek için geçerli kültürün DateTimeFormatInfo.DateSeparator özelliğinin değerini değiştirin ya da DateTimeFormatInfo nesnesinin bir örneğini oluşturun, karakteri DateSeparator özelliğine atayın ve bir IFormatProvider parametresi içeren biçimlendirme yönteminin bir aşırı yüklemesini çağırın. "/" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: "/" 自定义格式说明符表示用于区分年、月和日的日期分隔符。可从当前或指定区域性的 DateTimeFormatInfo.DateSeparator 属性中检索适当的本地化日期分隔符。 注意: 若要更改特定日期和时间字符串的日期分隔符，需要在文本字符串分隔符中指定分隔符字符。例如，自定义格式字符串 mm'/'dd'/'yyyy 会生成一个结果字符串，其中 "/" 始终用作日期分隔符。若要更改某个区域性的所有日期的日期分隔符，请更改当前区域性的 DateTimeFormatInfo.DateSeparator 属性的值，或者实例化 DateTimeFormatInfo 对象，并将该字符分配给它的 DateSeparator 属性，然后调用包含 IFormatProvider 参数的格式设置方法的重载。 如果使用 "/" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: "/" 自訂格式規範代表日期分隔符號，可用於區分年、月和日。系統會從目前文化特性或所指定文化特性的 DateTimeFormatInfo.DateSeparator 屬性，擷取適當的當地語系化日期分隔符號。 注意: 若要變更特定日期與時間字串的日期分隔符號，請在常值字串分隔符號內指定分隔符號字元。例如，自訂格式字串 mm'/'dd'/'yyyy 所產生的結果字串，一律會以 "/" 作為日期分隔符號。若要變更某項文化特性所有日期的日期分隔符號，請變更目前文化特性的 DateTimeFormatInfo.DateSeparator 屬性值，或是將 DateTimeFormatInfo 物件具現化、將字元指派給其 DateSeparator 屬性，然後呼叫包含 IFormatProvider 參數的格式化方法多載。 如果在使用 "/" 格式規範時沒有其他自訂格式規範，則會將其解譯為標準日期與時間格式規範，並擲回 FormatException。

source: day of the month (1-2 digits)
cs: den v měsíci (1–2 číslice)
de: Tag des Monats (1–2 Stellen)
es: día del mes (1-2 dígitos)
fr: jour du mois (1 à 2 chiffres)
it: Giorno del mese (1-2 cifre)
ja: 日 (1 - 2 桁)
ko: 일(1~2자리)
pl: dzień miesiąca (1–2 cyfr)
pt_br: dia do mês (1-2 dígitos)
ru: день месяца (1–2 цифры)
tr: ayın günü (1-2 rakam)
zh_hans: 一月中某天(1-2 位数)
zh_hant: 該月份第幾天 (1-2 位數)

# day_of_the_month_1_2_digits_description
source: The "d" custom format specifier represents the day of the month as a number from 1 through 31. A single-digit day is formatted without a leading zero. If the "d" format specifier is used without other custom format specifiers, it's interpreted as the "d" standard date and time format specifier.
cs: Specifikátor vlastního formátu d reprezentuje den v měsíci jako číslo od 1 do 31. Den s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu d použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času d.
de: Der benutzerdefinierte Formatbezeichner "d" repräsentiert den Tag des Monats als eine Zahl zwischen 1 und 31. Ein einstelliger Tageswert wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "d" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "d" für Datum und Uhrzeit interpretiert.
es: El especificador de formato personalizado "d" representa el día del mes como un número del 1 al 31. Un día con un solo dígito tiene un formato sin un cero inicial. Si el especificador de formato "d" se usa sin otros especificadores de formato personalizados, se interpreta como el especificador de formato de fecha y hora estándar "d".
fr: Le spécificateur de format personnalisé "d" représente le jour du mois sous la forme d'un nombre compris entre 1 et 31. Un jour à un chiffre est présenté dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "d" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "d".
it: L'identificatore di formato personalizzato "d" rappresenta il giorno del mese come numero compreso tra 1 e 31. Un giorno a una sola cifra viene formattato senza uno zero iniziale. Se l'identificatore di formato "d" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "d".
ja: "d" カスタム書式指定子は、日を 1 から 31 の数字として表します。1 桁の日は、先行ゼロなしで書式設定されます。 "d" 書式指定子を他のカスタム書式指定子なしで使用すると、"d" 標準日時書式指定子として解釈されます。
ko: "d" 사용자 지정 형식 지정자는 일을 1부터 31까지의 숫자로 나타냅니다. 한 자릿수 일은 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "d" 형식 지정자를 사용하면 "d" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Indywidualny specyfikator formatu „d” reprezentuje dzień miesiąca jako liczbę z zakresu od 1 do 31. Dzień 1-cyfrowy jest wyświetlany w formacie bez wiodącego zera. Jeśli specyfikator formatu „d” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny „d”.
pt_br: O especificador de formato personalizado "d" representa o dia do mês como um número de 1 a 31. Um dia de dígito único é formatado sem um zero à esquerda. Se o especificador de formato "d" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "d".
ru: Описатель пользовательского формата "d" представляет день месяца в виде числа от 1 до 31. Значение дня из одной цифры форматируется без начального нуля. Если описатель формата "d" используется без других описателей пользовательского формата, он интерпретируется как описатель "d" стандартного формата даты и времени.
tr: "d" özel biçim belirticisi, ayın gününü 1 ile 31 arasındaki bir sayı ile temsil eder. Tek haneli bir gün, başına sıfır konmadan biçimlendirilir. "d" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, "d" standart tarih ve saat biçimi belirticisi olarak yorumlanır.
zh_hans: "d" 自定义格式说明符将一月中某天表示为从 1 至 31 的数字。一位数字的日期设置为不带前导零的格式。 如果使用 "d" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "d" 标准日期和时间格式说明符。
zh_hant: "d" 自訂格式規範代表該月份的哪一天，以數字 1 到 31 表示。單一數字的日期格式，開頭不會出現零。 如果在使用 "d" 格式規範時沒有其他自訂格式規範，則會將其解譯為 "d" 標準日期與時間格式規範。

source: day of the month (2 digits)
cs: den v měsíci (2 číslice)
de: Tag des Monats (2 Stellen)
es: día del mes (2 dígitos)
fr: jour du mois (2 chiffres)
it: Giorno del mese (2 cifre)
ja: 日 (2 桁)
ko: 일(2자리)
pl: dzień miesiąca (2 cyfry)
pt_br: dia do mês (2 dígitos)
ru: день месяца (2 цифры)
tr: ayın günü (2 rakam)
zh_hans: 一月中某天(2 位数)
zh_hant: 該月份第幾天 (2 位數)

# day_of_the_month_2_digits_description
source: The "dd" custom format string represents the day of the month as a number from 01 through 31. A single-digit day is formatted with a leading zero.
cs: Specifikátor vlastního formátu dd reprezentuje den v měsíci jako číslo od 01 do 31. Den s jednou číslicí se formátuje s nulou na začátku.
de: Der benutzerdefinierte Formatbezeichner "dd" repräsentiert den Tag des Monats als eine Zahl zwischen 01 und 31. Ein einstelliger Tageswert wird mit einer führenden Null formatiert.
es: La cadena de formato personalizado "dd" representa el día del mes como un número del 01 al 31. Un día con un solo dígito tiene un formato con un cero inicial.
fr: La chaîne de format personnalisée "dd" représente le jour du mois sous la forme d'un nombre compris entre 01 et 31. Un jour à un chiffre est présenté dans un format qui comporte un zéro de début.
it: La stringa di formato personalizzata "dd" rappresenta il giorno del mese come numero compreso tra 01 e 31. Un giorno a una sola cifra viene formattato con uno zero iniziale.
ja: "dd" カスタム書式指定文字列は、日を 01 から 31 の数字として表します。1 桁の日は、先行ゼロ付きで書式設定されます。
ko: "dd" 사용자 지정 형식 문자열은 일을 01부터 31까지의 숫자로 나타냅니다. 한 자릿수 일은 앞에 0이 있는 형식으로 지정됩니다.
pl: Ciąg formatu niestandardowego „dd” reprezentuje dzień miesiąca jako liczbę z zakresu od 01 do 31. Dzień 1-cyfrowy jest wyświetlany w formacie z wiodącym zerem.
pt_br: A cadeia de caracteres de formato personalizado "dd" representa o dia do mês como um número de 01 a 31. Um dia de dígito único é formatado com um zero à esquerda.
ru: Описатель пользовательского формата "dd" представляет день месяца в виде числа от 01 до 31. Значение дня из одной цифры форматируется с начальным нулем.
tr: "dd" özel biçim dizesi, ayın gününü 01 ile 31 arasında bir sayı ile temsil eder. Tek haneli bir gün, başına sıfır eklenerek biçimlendirilir.
zh_hans: "dd" 自定义格式字符串将将一月中某天表示为从 01 至 31 的数字。一位数字的日期设置为带前导零的格式。
zh_hant: "dd" 自訂格式字串代表該月的第幾天，以數字 01 到 31 來表示。單一數字的日期格式，開頭不會出現零。

source: day of the week (abbreviated)
cs: den v týdnu (zkrácený)
de: Tag der Woche (abgekürzt)
es: día de la semana (abreviado)
fr: jour de la semaine (abrégé)
it: Giorno della settimana (abbreviato)
ja: 曜日 (省略)
ko: 요일(약식)
pl: dzień tygodnia (skrót)
pt_br: dia da semana (abreviado)
ru: День недели (сокращенно)
tr: haftanın günü (kısa)
zh_hans: 一周中某天(缩写)
zh_hant: 星期幾 (縮寫)

# day_of_the_week_abbreviated_description
source: The "ddd" custom format specifier represents the abbreviated name of the day of the week. The localized abbreviated name of the day of the week is retrieved from the DateTimeFormatInfo.AbbreviatedDayNames property of the current or specified culture.
cs: Specifikátor vlastního formátu ddd reprezentuje zkrácený název dne v týdnu. Lokalizovaný zkrácený název dne v týdnu se načítá z vlastnosti DateTimeFormatInfo.AbbreviatedDayNames aktuální nebo zadané jazykové verze.
de: Der benutzerdefinierte Formatbezeichner "ddd" repräsentiert den abgekürzten Namen des Wochentags. Der lokalisierte abgekürzte Name des Wochentags wird aus der DateTimeFormatInfo.AbbreviatedDayNames-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen.
es: El especificador de formato personalizado "ddd" representa el nombre abreviado del día de la semana. El nombre abreviado localizado del día de la semana se recupera de la propiedad DateTimeFormatInfo.AbbreviatedDayNames de la referencia cultural actual o especificada.
fr: Le spécificateur de format personnalisé "ddd" représente le nom abrégé du jour de la semaine. Le nom abrégé localisé du jour de la semaine est récupéré à partir de la propriété DateTimeFormatInfo.AbbreviatedDayNames de la culture actuelle ou spécifiée.
it: L'identificatore di formato personalizzato "ddd" rappresenta il nome abbreviato del giorno della settimana. Il nome abbreviato localizzato del giorno della settimana viene recuperato dalla proprietà DateTimeFormatInfo.AbbreviatedDayNames delle impostazioni cultura correnti o specificate.
ja: "ddd" カスタム書式指定子は、曜日の省略名を表します。曜日のローカライズされた省略名は、現在の、または指定したカルチャの DateTimeFormatInfo.AbbreviatedDayNames プロパティから取得されます。
ko: "ddd" 사용자 지정 형식 지정자는 요일의 약식 이름을 나타냅니다. 요일의 지역화된 약식 이름은 현재 문화권 지정된 문화권의 DateTimeFormatInfo.AbbreviatedDayNames 속성에서 검색됩니다.
pl: Indywidualny specyfikator formatu „ddd” reprezentuje skróconą nazwę dnia tygodnia. Zlokalizowana skrócona nazwa dnia tygodnia jest pobierana z właściwości DateTimeFormatInfo.AbbreviatedDayNames bieżącej lub określonej kultury.
pt_br: O especificador de formato personalizado "ddd" representa o nome abreviado do dia da semana. O nome abreviado localizado do dia da semana é recuperado da propriedade DateTimeFormatInfo.AbbreviatedDayNames da cultura atual ou especificada.
ru: Описатель пользовательского формата "ddd" представляет сокращенное название дня недели. Локализованное сокращенное название дня недели извлекается из свойства DateTimeFormatInfo.AbbreviatedDayNames текущих или заданных языка и региональных параметров.
tr: "ddd" özel biçim belirticisi, haftanın gününün kısaltılmış adını temsil eder. Haftanın gününün yerelleştirilmiş kısaltılmış adı, geçerli veya belirtilen kültürün DateTimeFormatInfo.AbbreviatedDayNames özelliğinden alınır.
zh_hans: "ddd" 自定义格式说明符表示一周中某天的缩写名称。可从当前或指定区域性的 DateTimeFormatInfo.AbbreviatedDayNames 属性中检索一周中某天的本地化缩写名称。
zh_hant: "ddd" 自訂格式規範代表星期幾的縮寫名稱。系統會從目前文化特性或指定文化特性的 DateTimeFormatInfo.AbbreviatedDayNames 屬性，擷取星期幾的當地語系化縮寫名稱。

source: day of the week (full)
cs: den v týdnu (úplný)
de: Tag der Woche (vollständig)
es: día de la semana (completo)
fr: jour de la semaine (complet)
it: Giorno della settimana (esteso)
ja: 曜日 (完全)
ko: 요일(전체)
pl: dzień tygodnia (pełna nazwa)
pt_br: dia da semana (completo)
ru: День недели (полностью)
tr: haftanın günü (tam)
zh_hans: 一周中某天(完整)
zh_hant: 星期幾 (完整)
