Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Updating the underlying type of '{0}' will prevent the debug session from continuing.
fr: La mise à jour du type sous-jacent de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的基礎類型，會造成偵錯工作階段無法繼續。

source: Updating the base class and/or base interface(s) of '{0}' will prevent the debug session from continuing.
fr: La mise à jour de la classe de base et/ou des interfaces de base de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的基底類別及 (或) 基底介面，會造成偵錯工作階段無法繼續。

source: Updating a field to an event or vice versa will prevent the debug session from continuing.
fr: La mise à jour d'un champ en événement ou vice versa empêche la session de débogage de se poursuivre.
zh_hant: 對事件更新欄位或對欄位更新事件，都會造成偵錯工作階段無法繼續。

source: Updating the kind of a type will prevent the debug session from continuing.
fr: La mise à jour du genre d'un type empêche la session de débogage de se poursuivre.
zh_hant: 更新類型種類，會造成偵錯工作階段無法繼續。

source: Updating the kind of an property/event accessor will prevent the debug session from continuing.
fr: La mise à jour du genre d'un accesseur de propriété/événement empêche la session de débogage de se poursuivre.
zh_hant: 更新屬性/事件存取子的種類，會造成偵錯工作階段無法繼續。

source: Updating the kind of a method (Sub/Function) will prevent the debug session from continuing.
fr: La mise à jour du genre d'une méthode (Sub/Function) empêche la session de débogage de se poursuivre.
zh_hant: 更新方法種類 (Sub/Function)，會造成偵錯工作階段無法繼續。

source: Updating the library name of Declare Statement will prevent the debug session from continuing.
fr: La mise à jour du nom de la bibliothèque de l'instruction Declare empêche la session de débogage de se poursuivre.
zh_hant: 更新 Declare 陳述式的程式庫名稱，會造成偵錯工作階段無法繼續。

source: Updating the alias of Declare Statement will prevent the debug session from continuing.
fr: La mise à jour de l'alias de l'instruction Declare empêche la session de débogage de se poursuivre.
zh_hant: 更新 Declare 陳述式的別名，會造成偵錯工作階段無法繼續。

source: Renaming '{0}' will prevent the debug session from continuing.
fr: Le changement de nom de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 重新命名 '{0}' 會造成偵錯工作階段無法繼續。

source: Adding '{0}' will prevent the debug session from continuing.
fr: L'ajout de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 加入 '{0}' 會造成偵錯工作階段無法繼續。

source: Adding an abstract '{0}' or overriding an inherited '{0}' will prevent the debug session from continuing.
fr: L'ajout d'un '{0}' abstrait ou la substitution d'un '{0}' hérité empêche la session de débogage de se poursuivre.
zh_hant: 加入抽象 '{0}' 或覆寫繼承的 '{0}' 會阻礙偵錯工作階段繼續進行。

source: Adding a MustOverride '{0}' or overriding an inherited '{0}' will prevent the debug session from continuing.
fr: L'ajout d'un MustOverride '{0}' ou la substitution d'un '{0}' hérité empêche la session de débogage de se poursuivre.
zh_hant: 加入 MustOverride '{0}' 或覆寫繼承的 '{0}' 會阻礙偵錯工作階段繼續進行。

source: Adding an extern '{0}' will prevent the debug session from continuing.
fr: L'ajout d'un '{0}' externe empêche la session de débogage de se poursuivre.
zh_hant: 加入外部 '{0}' 會造成偵錯工作階段無法繼續。

source: Adding an imported method will prevent the debug session from continuing.
fr: L'ajout d'une méthode importée empêche la session de débogage de se poursuivre.
zh_hant: 加入匯入的方法，會造成偵錯工作階段無法繼續。

source: Adding a user defined '{0}' will prevent the debug session from continuing.
fr: L'ajout d'un '{0}' défini par l'utilisateur empêche la session de débogage de se poursuivre.
zh_hant: 加入使用者定義的 '{0}'，會造成偵錯工作階段無法繼續。

source: Adding a generic '{0}' will prevent the debug session from continuing.
fr: L'ajout d'un '{0}' générique empêche la session de débogage de se poursuivre.
zh_hant: 加入泛型 '{0}'，會造成偵錯工作階段無法繼續。

source: Adding '{0}' around an active statement will prevent the debug session from continuing.
fr: L'ajout de '{0}' autour d'une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 在現用陳述式前後加入 '{0}'，會造成偵錯工作階段無法繼續。

source: Moving '{0}' will prevent the debug session from continuing.
fr: Le déplacement de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 移動 '{0}' 會造成偵錯工作階段無法繼續。

source: Deleting {0} will prevent the debug session from continuing.
fr: La suppression de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 刪除 '{0}' 會造成偵錯工作階段無法繼續。

source: Deleting '{0}' around an active statement will prevent the debug session from continuing.
fr: La suppression de '{0}' autour d'une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 刪除現用陳述式前後的 '{0}'，會造成偵錯工作階段無法繼續。

source: Adding a method body will prevent the debug session from continuing.
fr: L'ajout d'un corps de méthode empêche la session de débogage de se poursuivre.
zh_hant: 加入方法主體，會造成偵錯工作階段無法繼續。

source: Deleting a method body will prevent the debug session from continuing.
fr: La suppression d'un corps de méthode empêche la session de débogage de se poursuivre.
zh_hant: 刪除方法主體，會造成偵錯工作階段無法繼續。

source: Updating async or iterator modifier around an active statement will prevent the debug session from continuing.
fr: La mise à jour d'un modificateur async ou iterator autour d'une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 更新作用中陳述式前後的 async 或 iterator 修飾元，會造成偵錯工作階段無法繼續。

source: Modifying a generic method will prevent the debug session from continuing.
fr: La modification d'une méthode générique empêche la session de débogage de se poursuivre.
zh_hant: 修改泛型方法會造成偵錯工作階段無法繼續。

source: Modifying whitespace or comments in a generic '{0}' will prevent the debug session from continuing.
fr: La modification des espaces blancs ou des commentaires dans un '{0}' générique empêche la session de débogage de se poursuivre.
zh_hant: 修改泛型 '{0}' 中的空格或註解，會造成偵錯工作階段無法繼續。

source: Modifying a method inside the context of a generic type will prevent the debug session from continuing.
fr: La modification d'une méthode dans le contexte d'un type générique empêche la session de débogage de se poursuivre.
zh_hant: 修改泛型類型內容中的方法，會造成偵錯工作階段無法繼續。

source: Modifying whitespace or comments in '{0}' inside the context of a generic type will prevent the debug session from continuing.
fr: La modification des espaces blancs ou des commentaires dans '{0}' dans le contexte d'un type générique empêche la session de débogage de se poursuivre.
zh_hant: 修改泛型類型內容中之 '{0}' 內的空格或註解，會造成偵錯工作階段無法繼續。

source: Modifying the initializer of '{0}' in a generic type will prevent the debug session from continuing.
fr: La modification de l'initialiseur de '{0}' dans un type générique empêche la session de débogage de se poursuivre.
zh_hant: 修改泛型類別中 '{0}' 的初始設定式，會造成偵錯工作階段無法繼續。

source: Adding a constructor to a type with a field or property initializer that contains an anonymous function will prevent the debug session from continuing.
fr: L'ajout d'un constructeur à un type avec un initialiseur de champ ou de propriété contenant une fonction anonyme empêche la poursuite de la session de débogage.
zh_hant: 將建構函式加入類型，並附上包含會讓偵錯工作階段無法繼續的匿名函式欄位或屬性初始設定式。

source: Renaming a captured variable, from '{0}' to '{1}' will prevent the debug session from continuing.
fr: Renommer une variable capturée de '{0}' en '{1}' empêche la poursuite de la session de débogage.
zh_hant: 將擷取到的值從 '{0}' 重新命名為 '{1}' 會導致偵錯工作階段無法繼續。

source: Modifying a catch/finally handler with an active statement in the try block will prevent the debug session from continuing.
fr: La modification d'un gestionnaire catch/finally avec une instruction active dans le bloc try empêche la session de débogage de se poursuivre.
zh_hant: 修改 try 區塊中現用陳述式的 catch/finally 處理常式，會造成偵錯工作階段無法繼續。

source: Modifying a try/catch/finally statement when the finally block is active will prevent the debug session from continuing.
fr: La modification d'une instruction try/catch/finally lorsque le bloc finally est actif empêche la session de débogage de se poursuivre.
zh_hant: 當 Finally 區塊仍在作用中時修改 try/catch/finally 陳述式，會造成偵錯工作階段無法繼續。

source: Modifying a catch handler around an active statement will prevent the debug session from continuing.
fr: La modification d'un gestionnaire catch autour d'une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 修改現用陳述式前後的 catch 處理常式，會造成偵錯工作階段無法繼續。

source: Modifying '{0}' which contains the 'stackalloc' operator will prevent the debug session from continuing.
fr: La modification de '{0}' contenant l'opérateur 'stackalloc' empêche la session de débogage de se poursuivre.
zh_hant: 修改包含 'stackalloc' 運算子的 '{0}'，會造成偵錯工作階段無法繼續。

source: Modifying an active '{0}' which contains 'On Error' or 'Resume' statements will prevent the debug session from continuing.
fr: La modification d'un '{0}' actif contenant les instructions 'On Error' ou 'Resume' empêche la session de débogage de se poursuivre.
zh_hant: 修改包含 'On Error' 或 'Resume' 陳述式的現用 '{0}'，會造成偵錯工作階段無法繼續。

source: Modifying '{0}' which contains an Aggregate, Group By, or Join query clauses will prevent the debug session from continuing.
fr: La modification de '{0}', qui contient des clauses de requête Aggregate, Group By ou Join, empêche la session de débogage de se poursuivre.
zh_hant: 修改包含 Aggregate、Group By 或 Join 查詢子句的 '{0}'，會讓偵錯工作階段無法繼續。

source: Modifying source with experimental language features enabled will prevent the debug session from continuing.
fr: La modification de la source avec des fonctionnalités de langage expérimentales activées empêche la session de débogage de se poursuivre.
zh_hant: 修改具備實驗語言功能的來源，會造成偵錯工作階段無法繼續。

source: Updating an active statement will prevent the debug session from continuing.
fr: La mise à jour d'une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 更新現用陳述式會造成偵錯工作階段無法執行。

source: Removing {0} that contains an active statement will prevent the debug session from continuing.
fr: La suppression de '{0}' contenant une instruction active empêche la session de débogage de se poursuivre.
zh_hant: 移除包含現用陳述式的 '{0}'，會造成偵錯工作階段無法繼續。

source: Adding a new file will prevent the debug session from continuing.
fr: L'ajout d'un nouveau fichier empêche la session de débogage de se poursuivre.
zh_hant: 新增檔案會導致偵錯工作階段無法繼續。

source: Attribute '{0}' is missing. Updating an async method or an iterator will prevent the debug session from continuing.
fr: L'attribut '{0}' est manquant. La mise à jour d'une méthode async ou d'un itérateur empêche la session de débogage de se poursuivre.
zh_hant: 缺少屬性 '{0}'。更新非同步方法或迭代器會導致偵錯工作階段無法繼續。

source: Unknown symbol kind
fr: Genre de symbole inconnu
zh_hant: 符號種類不明

source: Generate abstract property '{1}.{0}'
fr: Générer la propriété abstraite '{1}.{0}'
zh_hant: 產生抽象屬性 '{1}.{0}'

source: Generate abstract method '{1}.{0}'
fr: Générer la méthode abstraite '{1}.{0}'
zh_hant: 產生抽象方法 '{1}.{0}'

source: Generate method '{1}.{0}'
fr: Générer la méthode '{1}.{0}'
zh_hant: 產生方法 '{1}.{0}'

source: Requested assembly already loaded from '{0}'.
fr: L'assembly demandé est déjà chargé à partir de '{0}'.
zh_hant: 已從 '{0}' 載入所要求的組件。

source: Simplify Names
fr: Simplifier les noms
zh_hant: 簡化名稱

source: Simplify Member Access
fr: Simplifier l'accès au membre
zh_hant: 簡化成員存取

source: Re-triage {0}(currently '{1}')
fr: Répétition du triage {0}(actuellement '{1}')
zh_hant: 重新分級 {0}(目前為 '{1}')

source: Argument cannot have a null element.
fr: L'argument ne peut pas avoir un élément null.
zh_hant: 引數不能有 null 元素。

source: Argument cannot be empty.
fr: L'argument ne peut pas être vide.
zh_hant: 引數不可為空白。

source: Reported diagnostic with ID '{0}' is not supported by the analyzer.
fr: Le diagnostic signalé avec l'ID '{0}' n'est pas pris en charge par l'analyseur.
zh_hant: 分析器不支援識別碼為 '{0}' 的回報診斷。

source: Modifying '{0}' which contains a static variable will prevent the debug session from continuing.
fr: La modification de '{0}', qui contient une variable statique, empêche la session de débogage de se poursuivre.
zh_hant: 修改包含靜態變數的 '{0}' 會讓偵錯工作階段無法繼續。

source: Make method synchronous
fr: Rendre la méthode synchrone
zh_hant: 讓方法同步

source: Locals
fr: Variables locales
zh_hant: 區域變數

source: Remove tag
fr: Supprimer une étiquette
zh_hant: 移除標記

source: Add missing param nodes
fr: Ajouter les nœuds de paramètre manquants
zh_hant: 新增遺失的參數節點

source: Make containing scope async
fr: Rendre la portée contenante async
zh_hant: 讓包含範圍非同步

source: Make containing scope async (return Task)
fr: Rendre la portée contenante async (retourner Task)
zh_hant: 讓包含範圍非同步 (傳回工作)

source: All lowercase
fr: Tout en minuscules
zh_hant: 允許小寫

source: All uppercase
fr: Tout en majuscules
zh_hant: 允許大寫

source: First word capitalized
fr: Premier mot en majuscule
zh_hant: 第一個字大寫

source: Pascal Case
fr: Casse Pascal
zh_hant: Pascal 命名法的大小寫

source: Take '{0}'
fr: Prendre '{0}'
zh_hant: 接受 '{0}'

source: Take both
fr: Prendre les deux
zh_hant: 接受兩者

source: Take bottom
fr: Prendre le bas
zh_hant: 接受底端

source: Take top
fr: Prendre le haut
zh_hant: 接受頂端

source: Add parameter to '{0}'
fr: Ajouter un paramètre à '{0}'
zh_hant: 將參數新增至 '{0}'

source: Add accessibility modifiers
fr: Ajouter des modificateurs d'accessibilité
zh_hant: 新增協助工具修飾元

source: Switching between a lambda and a local function will prevent the debug session from continuing.
fr: Le passage d'une expression lambda à une fonction locale empêche la session de débogage de se poursuivre.
zh_hant: 在 lambda 和區域函式之間切換會讓偵錯工作階段無法繼續進行。

source: Alias ambiguous type '{0}'
fr: Alias de type ambigu : '{0}'
zh_hant: 別名不明確類型 '{0}'

# Warning_colon_Collection_may_be_modified_during_iteration
source: Warning: Collection may be modified during iteration.
fr: Avertissement : La collection risque d'être modifiée durant l'itération.
zh_hant: 警告: 集合可能於反覆運算期間被修改
