Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: second (1-2 digits)
cs: sekunda (1–2 číslice)
de: Sekunde (1–2 Stellen)
es: segundo (1-2 dígitos)
fr: seconde (1 à 2 chiffres)
it: Secondo (1-2 cifre)
ja: 秒 (1 ～ 2 桁)
ko: 초(1~2자리)
pl: sekunda (1-2 cyfry)
pt_br: segundo (1-2 dígitos)
ru: секунда (1–2 цифры)
tr: saniye (1-2 rakam)
zh_hans: 秒(1-2 位数)
zh_hant: 秒 (1-2 位數)

# second_1_2_digits_description
source: The "s" custom format specifier represents the seconds as a number from 0 through 59. The result represents whole seconds that have passed since the last minute. A single-digit second is formatted without a leading zero. If the "s" format specifier is used without other custom format specifiers, it's interpreted as the "s" standard date and time format specifier.
cs: Specifikátor vlastního formátu s reprezentuje sekundy jako číslo od 0 do 59. Výsledek představuje celé sekundy, které uplynuly od poslední minuty. Sekunda s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu s použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času s.
de: Der benutzerdefinierte Formatbezeichner "s" repräsentiert die Sekunden als eine Zahl zwischen 0 und 59. Das Ergebnis steht für ganze Sekunden, die seit der letzten Minute vergangen sind. Ein einstelliger Sekundenwert wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "s" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "s" für Datum und Uhrzeit interpretiert.
es: El especificador de formato personalizado "s" representa los segundos como un número del 0 al 59. El resultado representa los segundos enteros que han transcurrido desde el último minuto. El formato de un segundo con un solo dígito se representa sin cero inicial. Si el especificador de formato "s" se usa sin otros especificadores de formato personalizado, se interpreta como el especificador de formato de fecha y hora estándar "s".
fr: Le spécificateur de format personnalisé "s" représente les secondes sous la forme d'un nombre compris entre 0 et 59. Le résultat correspond aux secondes entières qui se sont écoulées depuis la dernière minute. Une seconde à un chiffre est présentée dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "s" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "s".
it: L'identificatore di formato personalizzato "s" rappresenta i secondi come numero compreso tra 0 e 59. Il risultato rappresenta il numero intero di secondi passati dall'ultimo minuto. Un secondo costituito da una singola cifra viene formattato senza zero iniziale. Se l'identificatore di formato "s" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "s".
ja: "s" カスタム書式指定子は、秒を 0 から 59 までの数値として表します。この秒は、直前の分から経過した秒数です。1 桁の秒は、先行ゼロなしで書式設定されます。 他のカスタム書式指定子が使用されていない場合、"s" は標準の日時書式指定子として解釈されます。
ko: "s" 사용자 지정 형식 지정자는 초를 0부터 59까지의 숫자로 나타냅니다. 결과는 마지막 분으로부터 경과한 정수 초를 나타냅니다. 한 자릿수 초는 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "s" 형식 지정자를 사용하면 "s" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Niestandardowy specyfikator formatu „s” reprezentuje sekundy jako liczbę z zakresu od 0 do 59. Wynik reprezentuje całe sekundy, które upłynęły od ostatniej minuty. Jednocyfrowa wartość sekundy jest formatowana bez zera wiodącego. Jeśli specyfikator formatu „s” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny „s”.
pt_br: O especificador de formato personalizado "s" representa os segundos como um número de 0 a 59. O resultado representa segundos inteiros que passaram desde o último minuto. Um segundo de dígito único é formatado sem um zero à esquerda. Se o especificador de formato "s" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato de data e hora padrão "s".
ru: Описатель пользовательского формата "s" представляет секунды в виде числа от 0 до 59. Это число представляет собой целые секунды, истекшие с момента наступления последней минуты. Значение секунд из одной цифры форматируется без начального нуля. Если описатель формата "s" используется без других описателей пользовательского формата, он интерпретируется как описатель "s" стандартного формата даты и времени.
tr: "s" özel biçim belirticisi saniyeyi 0 ile 59 arasında bir sayı ile temsil eder. Sonuç, son dakikadan bu yana geçen tam saniyeleri gösterir. Tek haneli bir saniye, önüne sıfır konmadan biçimlendirilir. "s" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçim belirticisi olarak yorumlanır.
zh_hans: "S" 自定义格式说明符将秒表示为从 0 到 59 的数字。结果表示自前一分钟后经过的整秒数。一位数字的秒数设置为不带前导零的格式。 如果使用 "s" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "s" 标准日期和时间格式说明符。
zh_hant: "s" 自訂格式規範會將秒數表示為 0 到 59 之間的數字。其結果代表自上一分鐘以來所經過的整數秒數。個位數的秒數開頭不會填補零。 如果使用 "s" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為 "s" 標準日期和時間格式規範。

source: second (2 digits)
cs: sekunda (2 číslice)
de: Sekunde (2 Stellen)
es: segundo (2 dígitos)
fr: seconde (2 chiffres)
it: Secondo (2 cifre)
ja: 秒 (2 桁)
ko: 초(2자리)
pl: sekunda (2 cyfry)
pt_br: segundo (2 dígitos)
ru: секунда (2 цифры)
tr: saniye (2 rakam)
zh_hans: 秒(2 位数
zh_hant: 秒 (2 位數)

# second_2_digits_description
source: The "ss" custom format specifier (plus any number of additional "s" specifiers) represents the seconds as a number from 00 through 59. The result represents whole seconds that have passed since the last minute. A single-digit second is formatted with a leading zero.
cs: Specifikátor vlastního formátu ss (a libovolný počet dalších specifikátorů s) reprezentuje sekundu jako číslo od 00 do 59. Výsledek představuje celé sekundy, které uplynuly od poslední minuty. Sekunda s jednou číslicí se formátuje s nulou na začátku.
de: Der benutzerdefinierte Formatbezeichner "ss" (plus beliebig viele zusätzliche s-Bezeichner) repräsentiert die Sekunden als eine Zahl zwischen 00 und 59. Das Ergebnis steht für ganze Sekunden, die seit der letzten Minute vergangen sind. Ein einstelliger Sekundenwert wird mit einer führenden Null formatiert.
es: El especificador de formato personalizado "ss" (más cualquier número de especificadores "s" adicionales) representa los segundos como un número del 00 al 59. El resultado representa los segundos enteros que han transcurrido desde el último minuto. El formato de un segundo con un solo dígito se representa sin un cero inicial.
fr: Le spécificateur de format personnalisé "ss" (plus n'importe quel nombre de spécificateurs "s" supplémentaires) représente les secondes sous la forme d'un nombre compris entre 00 et 59. Le résultat correspond aux secondes entières qui se sont écoulées depuis la dernière minute. Une seconde à un chiffre est présentée dans un format qui comporte un zéro de début.
it: L'identificatore di formato personalizzato "ss" (più qualsiasi numero di identificatori "s" aggiuntivi) rappresenta i secondi come numero compreso tra 00 e 59. Il risultato rappresenta il numero intero di secondi passati dall'ultimo minuto. Un secondo costituito da una singola cifra viene formattato con uno zero iniziale.
ja: "ss" カスタム書式指定子 (任意の数の "s" 指定子を追加可能) は、秒を 00 から 59 までの数値として表します。この秒は、直前の分から経過した秒数です。1 桁の秒は、先行ゼロ付きで書式設定されます。
ko: "ss" 사용자 지정 형식 지정자(및 임의 개수의 추가 "s" 지정자)는 초를 00부터 59까지의 숫자로 나타냅니다. 결과는 마지막 분으로부터 경과한 정수 초를 나타냅니다. 한 자릿수 초는 앞에 0이 있는 형식으로 지정됩니다.
pl: Niestandardowy specyfikator formatu „ss” (oraz dowolna liczba dodatkowych specyfikatorów „s”) reprezentuje sekundę jako liczbę z zakresu od 00 do 59. Wartość sekundy reprezentuje całe sekundy, które upłynęły od ostatniej minuty. Jednocyfrowa wartość sekundy jest formatowana przy użyciu zera wiodącego.
pt_br: O especificador de formato personalizado "ss" (mais qualquer número de especificadores "s" adicionais) representa os segundos como um número de 00 a 59. O resultado representa segundos inteiros que passaram desde o último minuto. Um segundo de dígito único é formatado com um zero à esquerda.
ru: Описатель пользовательского формата "ss" (плюс любое число дополнительных описателей "s") представляет секунды в виде числа от 00 до 59. Это число представляет собой целые секунды, истекшие с момента наступления последней минуты. Значение секунд из одной цифры форматируется с начальным нулем.
tr: "ss" özel biçim belirticisi (ve herhangi bir sayıda ek "s" belirticisi) saniyeyi 00 ile 59 arasında bir sayı ile temsil eder. Sonuç, son dakikadan bu yana geçen tam saniyeleri gösterir. Tek haneli bir saniye, başına sıfır eklenerek biçimlendirilir.
zh_hans: "ss" 自定义格式说明符(另加任意数量的其他 "s" 说明符)将秒表示为从 00 到 59 的数字。结果表示自前一分钟后经过的整秒数。一位数字的秒数设置为带前导零的格式。
zh_hant: "ss" 自訂格式規範 (外加任意數目的額外 "s" 規範) 會將秒數表示為 00 到 59 之間的數字。其結果代表自上一分鐘以來所經過的整數秒數。個位數的秒數開頭會填補零。

source: short date
cs: krátké datum
de: Kurzes Datumsformat
es: fecha corta
fr: date courte
it: Data breve
ja: 日付 (短い形式)
ko: 간단한 날짜
pl: data krótka
pt_br: data abreviada
ru: Краткий формат даты
tr: kısa tarih
zh_hans: 短日期
zh_hant: 簡短日期

# short_date_description
source: The "d" standard format specifier represents a custom date and time format string that is defined by a specific culture's DateTimeFormatInfo.ShortDatePattern property. For example, the custom format string that is returned by the ShortDatePattern property of the invariant culture is "MM/dd/yyyy".
cs: Specifikátor standardního formátu d představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.ShortDatePattern konkrétní jazykové verze. Například řetězec vlastního formátu, který se vrátí pomocí vlastnosti ShortDatePattern pro invariantní jazykovou verzi, je MM/dd/yyyy.
de: Der Standardformatbezeichner "d" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.ShortDatePattern-Eigenschaft einer bestimmten Kultur definiert wird. Die von der ShortDatePattern-Eigenschaft der invarianten Kultur zurückgegebene benutzerdefinierte Formatzeichenfolge lautet beispielsweise "MM/dd/yyyy".
es: El especificador de formato estándar "d" representa una cadena de formato de fecha y hora personalizado definida por una propiedad DateTimeFormatInfo.ShortDatePattern de una referencia cultural específica. Por ejemplo, la cadena de formato personalizado devuelta por la propiedad ShortDatePattern de la referencia cultural invariable es "MM/DD/AAAA".
fr: Le spécificateur de format standard "d" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.ShortDatePattern d'une culture spécifique. Par exemple, la chaîne de format personnalisée retournée par la propriété ShortDatePattern de la culture invariante est "MM/dd/yyyy".
it: L'identificatore di formato standard "d" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.ShortDatePattern di impostazioni cultura specifiche. Ad esempio, la stringa di formato personalizzata restituita dalla proprietà ShortDatePattern delle impostazioni cultura inglese non dipendenti da paese/area geografica è "MM/dd/yyyy".
ja: "d" 標準書式指定子は、特定のカルチャの DateTimeFormatInfo.ShortDatePattern プロパティによって定義されたカスタム日時書式設定文字列を表します。たとえば、インバリアント カルチャの ShortDatePattern プロパティによって返されるカスタム書式設定文字列は "MM/dd/yyyy" です。
ko: "d" 표준 형식 지정자는 특정 문화권의 DateTimeFormatInfo.ShortDatePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 ShortDatePattern 속성이 반환하는 사용자 지정 형식 문자열은 "MM/dd/yyyy"입니다.
pl: Standardowy specyfikator formatu „d” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.ShortDatePattern konkretnej kultury. Na przykład niestandardowy ciąg formatu zwracany przez właściwość ShortDatePattern dla kultury niezmiennej to „MM/dd/yyyy”.
pt_br: O especificador de formato padrão "d" representa uma cadeia de caracteres de formato personalizado de data e hora que é definida pela propriedade DateTimeFormatInfo.ShortDatePattern de uma cultura específica. Por exemplo, a cadeia de caracteres de formato personalizado retornada pela propriedade ShortDatePattern da cultura invariável é "MM/dd/yyyy".
ru: Описатель стандартного формата "d" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.ShortDatePattern конкретных языка и региональных параметров. Например, строка пользовательского формата, возвращаемая свойством ShortDatePattern для инвариантных языка и региональных параметров, имеет вид "MM/dd/yyyy".
tr: "d" standart biçim belirticisi, belirli bir kültürün DateTimeFormatInfo.ShortDatePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültürün ShortDatePattern özelliği tarafından döndürülen özel biçim dizesi "MM/dd/yyyy"dir.
zh_hans: "D" 标准格式说明符表示由特定区域性的 DateTimeFormatInfo.ShortDatePattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的 ShortDatePattern 属性返回的自定义格式字符串为 "MM/dd/yyyy"。
zh_hant: "d" 標準格式規範代表由特定文化特性 (Culture) DateTimeFormatInfo.ShortDatePattern 屬性所定義的自訂日期和時間格式字串。例如，由不因文化特性而異之 ShortDatePattern 屬性所傳回的自訂格式字串為 "MM/dd/yyyy"。

source: short time
cs: krátký čas
de: Kurzes Uhrzeitformat
es: hora corta
fr: heure courte
it: Ora breve
ja: 時刻 (短い形式)
ko: 간단한 시간
pl: godzina krótka
pt_br: hora abreviada
ru: Краткий формат времени
tr: kısa saat
zh_hans: 短时间
zh_hant: 簡短時間

# short_time_description
source: The "t" standard format specifier represents a custom date and time format string that is defined by the current DateTimeFormatInfo.ShortTimePattern property. For example, the custom format string for the invariant culture is "HH:mm".
cs: Specifikátor standardního formátu t představuje řetězec vlastního formátu data a času, který se definuje pomocí aktuální vlastnosti DateTimeFormatInfo.ShortTimePattern. Například řetězec vlastního formátu pro invariantní jazykovou verzi je HH:mm.
de: Der Standardformatbezeichner "t" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die aktuelle DateTimeFormatInfo.ShortTimePattern-Eigenschaft definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "HH:mm".
es: El especificador de formato estándar "t" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.ShortTimePattern actual. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "HH:mm".
fr: Le spécificateur de format standard "t" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.ShortTimePattern actuelle. Par exemple, la chaîne de format personnalisée pour la culture invariante est "HH:mm".
it: L'identificatore di formato standard "t" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.ShortTimePattern corrente. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "HH:mm".
ja: "t" 標準書式指定子は、現在の DateTimeFormatInfo.ShortTimePattern プロパティによって定義されるカスタム日時書式設定文字列を表します。たとえば、インバリアント カルチャのカスタム書式設定文字列は "HH: mm" です。
ko: "t" 표준 형식 지정자는 현재 DateTimeFormatInfo.ShortTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "HH:mm"입니다.
pl: Standardowy specyfikator formatu „t” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez bieżącą właściwość DateTimeFormatInfo.ShortTimePattern. Na przykład niestandardowy ciąg formatu dla kultury niezmiennej to „HH:mm”.
pt_br: O especificador de formato padrão "t" representa uma cadeia de caracteres de formato de data e hora personalizada que é definida pela propriedade DateTimeFormatInfo.ShortTimePattern atual. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "HH:mm".
ru: Описатель стандартного формата "t" представляет строку пользовательского формата даты и времени, определяемую текущим свойством DateTimeFormatInfo.ShortTimePattern. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "HH:mm".
tr: "T" standart biçim belirticisi, geçerli DateTimeFormatInfo. ShortTimePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "HH:mm" şeklindedir.
zh_hans: "t" 标准格式说明符表示由当前 DateTimeFormatInfo.ShortTimePattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "HH:mm"。
zh_hant: "t" 標準格式規範代表由目前 DateTimeFormatInfo.ShortTimePattern 屬性所定義的自訂日期和時間格式字串。例如，不因文化特性而異的自訂格式字串為 "HH:mm"。

source: sortable date/time
cs: seřaditelné datum a čas
de: Sortierbare(s) Datum/Uhrzeit
es: fecha y hora ordenable
fr: date/heure pouvant être triée
it: Data/ora ordinabile
ja: 並べ替え可能な日付/時刻
ko: 정렬 가능한 날짜/시간
pl: sortowalna data/godzina
pt_br: data/hora classificável
ru: Формат даты-времени для сортировки
tr: sıralanabilir tarih/saat
zh_hans: 可排序日期/时间
zh_hant: 可排序的日期/時間
