Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# day_of_the_week_full_description
source: The "dddd" custom format specifier (plus any number of additional "d" specifiers) represents the full name of the day of the week. The localized name of the day of the week is retrieved from the DateTimeFormatInfo.DayNames property of the current or specified culture.
cs: Specifikátor vlastního formátu dddd (a libovolný počet dalších specifikátorů d) reprezentuje celý název dne v týdnu. Lokalizovaný název dne v týdnu se načítá z vlastnosti DateTimeFormatInfo.DayNames aktuální nebo zadané jazykové verze.
de: Der benutzerdefinierte Formatbezeichner "dddd" (plus beliebig viele zusätzliche d-Bezeichner) repräsentiert den vollständigen Namen des Wochentags. Der lokalisierte Name des Wochentags wird aus der DateTimeFormatInfo.DayNames-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen.
es: El especificador de formato personalizado "dddd" (más cualquier número de especificadores "d" adicionales) representa el nombre completo del día de la semana. El nombre localizado del día de la semana se recupera de la propiedad DateTimeFormatInfo.DayNames de la referencia cultural actual o especificada.
fr: Le spécificateur de format personnalisé "dddd" (plus n'importe quel nombre de spécificateurs "d" supplémentaires) représente le nom complet du jour de la semaine. Le nom localisé du jour de la semaine est récupéré à partir de la propriété DateTimeFormatInfo.DayNames de la culture actuelle ou spécifiée.
it: L'identificatore di formato personalizzato "dddd" (più qualsiasi numero di identificatori "d" aggiuntivi) rappresenta il nome esteso del giorno della settimana. Il nome localizzato del giorno della settimana viene recuperato dalla proprietà DateTimeFormatInfo.DayNames delle impostazioni cultura correnti o specificate.
ja: "dddd" カスタム書式指定子 (任意の数の "d" 指定子を追加できます) は、曜日の完全名を表します。曜日のローカライズされた名前は、現在の、または指定したカルチャの DateTimeFormatInfo.DayNames プロパティから取得されます。
ko: "dddd" 사용자 지정 형식 지정자(및 임의 개수의 추가 "d" 지정자)는 요일의 전체 이름을 나타냅니다. 요일의 지역화된 이름은 현재 문화권 또는 지정된 문화권의 DateTimeFormatInfo.DayNames 속성에서 검색됩니다.
pl: Indywidualny specyfikator formatu „dddd” (wraz z dowolną liczbą dodatkowych specyfikatorów „d”) reprezentuje pełną nazwę dnia tygodnia. Zlokalizowana nazwa dnia tygodnia jest pobierana z właściwości DateTimeFormatInfo.DayNames bieżącej lub określonej kultury.
pt_br: O especificador de formato personalizado "dddd" (mais qualquer número de especificadores "d" adicionais) representa o nome completo do dia da semana. O nome localizado do dia da semana é recuperado da propriedade DateTimeFormatInfo.DayNames da cultura atual ou especificada.
ru: Описатель пользовательского формата "dddd" (плюс любое число дополнительных описателей "d") представляет полное название дня недели. Локализованное название дня недели извлекается из свойства DateTimeFormatInfo.DayNames текущих или заданных языка и региональных параметров.
tr: "dddd" özel biçim belirticisi (ve herhangi bir sayıda "d" belirticisi) haftanın gününün tam adını temsil eder. Haftanın gününün yerelleştirilmiş adı, geçerli veya belirtilen kültürün DateTimeFormatInfo.DayNames özelliğinden alınır.
zh_hans: "dddd" 自定义格式说明符(另加任意数量的其他 "d" 说明符)表示一周中某天的完整名称。可从当前或指定区域性的 DateTimeFormatInfo.DayNames 属性中检索一周中某天的本地化名称。
zh_hant: "dddd" 自訂格式規範 (加上任意數目的其他 "d" 規範) 代表星期幾的完整名稱。系統會從目前文化特性或指定文化特性的 DateTimeFormatInfo.DayNames 屬性，擷取星期幾的當地語系化名稱。

source: discard
cs: proměnná typu discard
de: Ausschussvariable
es: descartar
it: variabile discard
ja: 破棄
ko: 무시 항목
pl: odrzuć
ru: отменить
tr: at
zh_hans: 放弃
zh_hant: 捨棄

source: else statement
cs: příkaz else
de: „else“-Anweisung
es: Instrucción else
it: istruzione else
ja: else ステートメント
ko: else 문
pl: inna instrukcja
pt_br: outra declaração
ru: инструкция else
tr: else deyimi
zh_hans: else 语句

source: embedded
cs: zapuštěná
de: Eingebettet
es: Incrustado
it: Incorporata
ja: 埋め込み
ko: 포함됨
pl: osadzone
pt_br: embutido
ru: внедренный
tr: gömülü
zh_hans: 嵌入源

source: external
de: Extern
es: externo
ja: 外部
ko: 외부
pl: zewnętrzny
pt_br: externo
ru: внешний
tr: dış
zh_hans: 外部源

source: foreach loop
cs: smyčka foreach
de: foreach-Schleife
es: bucle Foreach
it: ciclo foreach
ja: ForEach ループ
ko: foreach 루프
pl: pętla foreach
pt_br: loop foreach
ru: Цикл ForEach
tr: foreach döngüsü
zh_hans: Foreach 循环

source: from metadata
cs: z metadat
de: aus Metadaten
es: de metadatos
fr: à partir des métadonnées
it: da metadati
ja: メタデータから
ko: 메타데이터에서
pl: z metadanych
pt_br: de metadados
ru: из метаданных
tr: meta verilerden
zh_hans: 从元数据
zh_hant: 來自中繼資料

source: full long date/time
cs: celé dlouhé datum a čas
de: Vollständige(s) Datum/Uhrzeit (lang)
es: fecha/hora completa en formato largo
fr: date longue/heure longue (complet)
it: Ora estesa e data completa
ja: 完全な長い日付と時刻
ko: 자세한 전체 날짜/시간
pl: pełna długa data/godzina
pt_br: data/hora completa por extenso
ru: полный длинный формат даты и времени
tr: tam uzun tarih/saat
zh_hans: 完整长日期/时间
zh_hant: 完整日期/時間 (完整)

# full_long_date_time_description
source: The "F" standard format specifier represents a custom date and time format string that is defined by the current DateTimeFormatInfo.FullDateTimePattern property. For example, the custom format string for the invariant culture is "dddd, dd MMMM yyyy HH:mm:ss".
cs: Specifikátor standardního formátu F představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.FullDateTimePattern. Například řetězec vlastního formátu pro invariantní jazykovou verzi je dddd, dd MMMM yyyy HH:mm:ss.
de: Der Standardformatbezeichner "F" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitzeichenfolge, die durch die aktuelle DateTimeFormatInfo.FullDateTimePattern-Eigenschaft definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "dddd, dd MMMM yyyy HH:mm:ss".
es: El especificador de formato estándar "F" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.FullDateTimePattern actual. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "dddd, dd MMMM aaaa HH:mm:ss".
fr: Le spécificateur de format standard "F" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.FullDateTimePattern actuelle. Par exemple, la chaîne de format personnalisée pour la culture invariante est "dddd, dd MMMM yyyy HH:mm:ss".
it: L'identificatore di formato standard "F" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.FullDateTimePattern corrente. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "dddd, dd MMMM yyyy HH:mm:ss".
ja: "F" 標準書式指定子は、現在の DateTimeFormatInfo.FullDateTimePattern プロパティで定義されているカスタム日時書式指定文字列を表します。たとえば、インバリアント カルチャのカスタム書式指定文字列は "dddd, dd MMMM yyyy HH:mm:ss" です。
ko: "F" 표준 형식 지정자는 현재 DateTimeFormatInfo.FullDateTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "dddd, dd MMMM yyyy HH:mm:ss"입니다.
pl: Standardowy specyfikator formatu „F” reprezentuje niestandardowy ciąg formatu daty i godziny definiowany przez bieżącą właściwość DateTimeFormatInfo.FullDateTimePattern. Na przykład niestandardowy ciąg formatu dla kultury niezmiennej to „dddd, dd MMMM yyyy HH:mm:ss”.
pt_br: O especificador de formato padrão "F" representa uma cadeia de caracteres de formato de data e hora personalizada que é definida pela propriedade DateTimeFormatInfo. FullDateTimePattern atual. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "dddd, dd MMMM yyyy HH:mm:ss".
ru: Описатель стандартного формата "F" представляет строку пользовательского формата даты и времени, определяемую текущим свойством DateTimeFormatInfo.FullDateTimePattern. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "dddd, dd MMMM yyyy HH:mm:ss".
tr: "F" standart biçim belirticisi, geçerli DateTimeFormatInfo.FullDateTimePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "dddd, dd MMMM yyyy HH:mm:ss" şeklindedir.
zh_hans: "F" 标准格式说明符表示由当前 DateTimeFormatInfo FullDateTimePattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "dddd, dd MMMM yyyy HH:mm:ss"。
zh_hant: "F" 標準格式規範代表由目前 DateTimeFormatInfo.FullDateTimePattern 屬性所定義的自訂日期與時間格式字串。例如，不因文化特性而異的自訂格式字串為 "dddd, dd MMMM yyyy HH:mm:ss"。

source: full short date/time
cs: celé krátké datum a čas
de: Vollständige(s) Datum/Uhrzeit (kurz)
es: fecha/hora completa en formato corto
fr: date longue/heure courte (complet)
it: Ora breve e data estesa
ja: 完全な短い日付と時刻
ko: 간단한 전체 날짜/시간
pl: pełna krótka data/godzina
pt_br: data/hora abreviada por extenso
ru: полный краткий формат даты и времени
tr: tam kısa tarih/saat
zh_hans: 完整短日期/时间
zh_hant: 完整日期/時間 (簡短)

# full_short_date_time_description
source: The Full Date Short Time ("f") Format Specifier The "f" standard format specifier represents a combination of the long date ("D") and short time ("t") patterns, separated by a space.
cs: Specifikátor formátu úplného data a krátkého času (f) Specifikátor standardního formátu f představuje kombinaci vzorů dlouhého data (D) a krátkého času (t) oddělených mezerou.
de: Formatbezeichner für das Datum in Langform und die Uhrzeit in Kurzform ("f") Der Standardformatbezeichner "f" repräsentiert eine Kombination aus den Mustern für das lange Datumsformat ("D") und das kurze Uhrzeitformat ("t"), getrennt durch ein Leerzeichen.
es: Especificador de formato de fecha completa y hora corta ("f") El especificador de formato estándar "f" representa una combinación de los patrones de fecha larga ("D") y hora corta ("t"), separados por un espacio.
fr: Spécificateur de format complet de date longue et d'heure courte ("f") Le spécificateur de format standard "f" représente une combinaison des modèles de date longue ("D") et d'heure courte ("t"), séparés par un espace.
it: Identificatore di formato di ora breve e data estesa ("f") L'identificatore di formato standard "f" rappresenta una combinazione degli schemi di data estesa ("D") e ora breve ("t"), separati da uno spazio.
ja: 完全な日付と短い形式の時刻 ("f") 書式指定子 "f" 標準書式指定子は、長い形式の日付 ("D") と短い形式の時刻 ("t") のパターンの組み合わせをスペースで区切ったものを表します。
ko: 전체 날짜 간단한 시간("f") 형식 지정자 "f" 표준 형식 지정자는 공백으로 구분된 자세한 날짜("D") 패턴과 간단한 시간("t") 패턴의 조합을 나타냅니다.
pl: Specyfikator formatu pełnej daty i krótkiej godziny („f”) Standardowy specyfikator formatu „f” reprezentuje połączenie wzorców długiej daty(„D”) i krótkiej godziny („t”) rozdzielonych spacją.
pt_br: O Especificador de Formato de Data por Extenso Hora Abreviada ("f") O especificador de formato padrão "f" representa uma combinação de padrões de data por extenso ("D") e tempo abreviado ("t"), separados por um espaço.
ru: Описатель формата полной даты и краткого времени ("f") Описатель стандартного формата "f" представляет сочетание шаблонов длинной даты ("D") и краткого времени ("t"), разделенных пробелом.
tr: Tam Tarih Kısa Saat ("f") Biçim Belirticisi "F" standart biçim belirticisi, bir boşlukla ayrılmış olarak uzun tarih ("D") ve kısa saat ("t") desenlerinin bir birleşimini temsil eder.
zh_hans: 完整日期短时间("f")格式说明符 "f" 标准格式说明符表示长日期("D")和短时间("t")模式组合，用空格分隔。
zh_hant: 完整日期簡短時間 ("f") 的格式規範 "f" 標準格式規範代表完整日期 ("D") 與簡短時間 ("t") 模式的組合 (以空格分隔)。

source: general long date/time
cs: obecné dlouhé datum a čas
de: Allgemeine(s) Datum/Uhrzeit (lang)
es: fecha y hora general en formato largo
fr: date courte/heure longue (général)
it: Ora estesa e data generale
ja: 一般の長い日付と時刻
ko: 자세한 일반 날짜/시간
pl: ogólna data/godzina długa
pt_br: data/hora geral por extenso
ru: общий длинный формат даты и времени
tr: genel uzun tarih/saat
zh_hans: 常规长日期/时间
zh_hant: 一般日期/時間 (完整)

# general_long_date_time_description
source: The "G" standard format specifier represents a combination of the short date ("d") and long time ("T") patterns, separated by a space.
cs: Specifikátor standardního formátu G představuje kombinaci vzorů krátkého data (d) a dlouhého času (T) oddělených mezerou.
de: Der Standardformatbezeichner "G" repräsentiert eine Kombination aus den Mustern für das kurze Datumsformat ("d") und das lange Uhrzeitformat ("T"), getrennt durch ein Leerzeichen.
es: El especificador de formato estándar "G" representa una combinación de los patrones de fecha corta ("d") y hora larga ("T"), separados por un espacio.
fr: Le spécificateur de format standard "G" représente une combinaison des modèles de date courte ("d") et d'heure longue ("T"), séparés par un espace.
it: L'identificatore di formato standard "G" rappresenta una combinazione degli schemi di data breve ("d") e ora estesa ("T"), separati da uno spazio.
ja: "G" 標準書式指定子は、短い形式の日付 ("d") と長い形式の時刻 ("T") のパターンの組み合わせをスペースで区切ったものを表します。
ko: "G" 표준 형식 지정자는 공백으로 구분된 간단한 날짜("d") 패턴과 자세한 시간("T") 패턴의 조합을 나타냅니다.
pl: Standardowy specyfikator formatu „G” reprezentuje kombinację wzorców daty krótkiej („d”) i godziny długiej („T”) rozdzielonych spacją.
pt_br: O especificador de formato padrão "G" representa uma combinação dos padrões de data abreviada ("d") e hora por extenso ("T"), separados por um espaço.
ru: Описатель стандартного формата "G" представляет сочетание шаблонов краткой даты ("d") и полного времени ("T"), разделенных пробелом.
tr: "G" standart biçim belirticisi, boşlukla ayrılmış olarak kısa tarih ("d") ve uzun saat ("T") desenlerinin bir bileşimini temsil eder.
zh_hans: "G" 标准格式说明符表示短日期("d")和长时间("T")模式组合，用空格分隔。
zh_hant: "G" 標準格式規範代表簡短日期 ("d") 與完整時間 ("T") 模式的組合 (以空格分隔)。

source: general short date/time
cs: obecné krátké datum a čas
de: Allgemeine(s) Datum/Uhrzeit (kurz)
es: fecha y hora general en formato corto
fr: date courte/heure courte (général)
it: Ora breve e data generale
ja: 一般の短い日付と時刻
ko: 간단한 일반 날짜/시간
pl: ogólna data/godzina krótka
pt_br: data/hora abreviada geral
ru: общий краткий формат даты и времени
tr: genel kısa tarih/saat
zh_hans: 常规短日期/时间
zh_hant: 一般日期/時間 (簡短)

# general_short_date_time_description
source: The "g" standard format specifier represents a combination of the short date ("d") and short time ("t") patterns, separated by a space.
cs: Specifikátor standardního formátu g představuje kombinaci vzorů krátkého data (d) a krátkého času (t) oddělených mezerou.
de: Der Standardformatbezeichner "g" repräsentiert eine Kombination aus den Mustern für das kurze Datumsformat ("d") und das kurze Uhrzeitformat ("t"), getrennt durch ein Leerzeichen.
es: El especificador de formato estándar "g" representa una combinación de los patrones de fecha corta ("d") y hora corta ("t"), separados por un espacio.
fr: Le spécificateur de format standard "g" représente une combinaison des modèles de date courte ("d") et d'heure courte ("t"), séparés par un espace.
it: L'identificatore di formato standard "g" rappresenta una combinazione degli schemi di data breve ("d") e ora breve ("t"), separati da uno spazio.
ja: "g" 標準書式指定子は、短い形式の日付 ("d") と短い形式の時刻 ("t") のパターンの組み合わせをスペースで区切ったものを表します。
ko: "g" 표준 형식 지정자는 공백으로 구분된 간단한 날짜("d") 패턴과 간단한 시간("t") 패턴의 조합을 나타냅니다.
pl: Standardowy specyfikator formatu „g” reprezentuje kombinację wzorców daty krótkiej („d”) i godziny krótkiej („t”) rozdzielonych spacją.
pt_br: O especificador de formato padrão "g" representa uma combinação dos padrões de data abreviada ("d") e hora abreviada ("t"), separados por um espaço.
ru: Описатель стандартного формата "g" представляет сочетание шаблонов краткой даты ("d") и краткого времени ("t"), разделенных пробелом.
tr: "g" standart biçim belirticisi, boşlukla ayrılmış olarak kısa tarih ("d") ve kısa saat ("t") desenlerinin bir bileşimini temsil eder.
zh_hans: "g" 标准格式说明符表示短日期("d")和短时间("t")模式组合，用空格分隔。
zh_hant: "g" 標準格式規範代表簡短日期 ("d") 與簡短時間 ("t") 模式的組合 (以空格分隔)。

source: generic overload
cs: obecné přetížení
de: generische Überladung
es: sobrecarga genérica
fr: surcharge générique
it: overload generico
ja: ジェネリック オーバーロード
ko: 제네릭 오버로드
pl: przeciążenie ogólne
pt_br: sobrecarga genérica
ru: универсальная перегрузка
tr: genel aşırı yükleme
zh_hans: 泛型重载
zh_hant: 泛型多載

source: generic overloads
cs: obecná přetížení
de: generische Überladungen
es: sobrecargas genéricas
fr: surcharges génériques
it: overload generici
ja: ジェネリック オーバーロード
ko: 제네릭 오버로드
pl: przeciążenia ogólne
pt_br: sobrecargas genéricas
ru: универсальные перегрузки
tr: genel aşırı yüklemeler
zh_hans: 多个泛型重载
zh_hant: 泛型多載

source: get-only property
cs: vlastnost jenom pro načtení
de: „get-only“-Eigenschaft
es: propiedad get-only
it: proprietà di solo richiamo
ja: get 専用プロパティ
ko: get 전용 속성
pl: własność tylko do uzyskania
pt_br: propriedade get-only
ru: свойство, предназначенное только для получения
tr: yalnızca alınabilen özellik
zh_hans: get-only 属性

source: if statement
cs: příkaz if
de: Wenn-Anweisung
es: instrucción if
it: istruzione if
ja: If ステートメント
ko: If 문
pl: instrukcja if
pt_br: instrução if
ru: оператор if
tr: If deyimi
zh_hans: If 语句

source: in {0} ({1} - {2})
cs: v {0} ({1}–{2})
es: en {0} ({1} - {2})
fr: dans {0} ({1} - {2})
ja: {0} ({1} - {2}) 内
ko: {0}({1} - {2})에서
pl: w {0} ({1} — {2})
pt_br: em {0} ({1} – {2})
ru: в {0} ({1} — {2})
tr: {0} ({1}-{2}) içinde
zh_hans: 在 {0} ({1} - {2})
zh_hant: 在 {0} ({1} - {2})

source: in Source (attribute)
cs: in Source (atribut)
de: in Quelle (Attribut)
es: en el origen (atributo)
fr: dans la source (attribut)
it: nell'origine (attributo)
ja: ソース内 (属性)
ko: 소스(특성)
pl: w źródle (atrybut)
pt_br: na Origem (atributo)
ru: в источнике (атрибут)
tr: Kaynakta (öznitelik)
zh_hans: 在源(属性)中
zh_hant: 在來源中 (屬性)

source: into extracted method to invoke at call sites
cs: do extrahované metody pro vyvolání na místech volání
de: in extrahierte Methode zum Aufrufen bei Aufrufsites
es: en el método extraído para invocar en sitios de llamada
it: in un metodo estratto per richiamare i siti di chiamata
ja: 呼び出しサイトで呼び出すための抽出されたメソッド
ko: 호출 사이트에서 호출하기 위해 추출된 메서드로
pl: na wyodrębnioną metodę do wywołania w miejscach wywoływania
pt_br: para o método extraído para invocar sites de chamada
ru: в извлеченный метод для вызова на сайтах вызовов
tr: çağrı sitelerinde çağırmak için ayıklanan yönteme
zh_hans: 到已提取方法，以在调用站点上进行调用

source: into new overload
cs: do nového přetížení
de: in neue Überladung
es: a una nueva sobrecarga
it: nel nuovo overload
ja: 新しいオーバーロード
ko: 새 오버로드로
pl: na nowe przeciążenie
pt_br: em nova sobrecarga
ru: в новую перегрузку
tr: yeni aşırı yüklemeye
zh_hans: 到新重载

source: just this anonymous type
cs: jenom tento anonymní typ
de: nur dieser anonyme Typ
es: solo este tipo anónimo
it: solo questo tipo anonimo
ja: この匿名型のみ
ko: 이 익명 형식만
pl: tylko ten typ anonimowy
pt_br: apenas esse tipo anônimo
ru: только этот анонимный тип
tr: yalnızca bu anonim tip
zh_hans: 仅此匿名类型

source: long date
cs: dlouhé datum
de: Langes Datumsformat
es: fecha larga
fr: date longue
it: Data estesa
ja: 長い日付
ko: 자세한 날짜
pl: data długa
pt_br: data completa
ru: Длинный формат даты
tr: uzun tarih
zh_hans: 长日期
zh_hant: 完整日期

# long_date_description
source: The "D" standard format specifier represents a custom date and time format string that is defined by the current DateTimeFormatInfo.LongDatePattern property. For example, the custom format string for the invariant culture is "dddd, dd MMMM yyyy".
cs: Specifikátor standardního formátu D představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.LongDatePattern. Například řetězec vlastního formátu pro invariantní jazykovou verzi je dddd, dd MMMM yyyy.
de: Der Standardformatbezeichner "D" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die aktuelle DateTimeFormatInfo.LongDatePattern-Eigenschaft definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "dddd, dd MMMM yyyy".
es: El especificador de formato estándar "D" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.LongDatePattern actual. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "dddd, dd MMMM aaaa".
fr: Le spécificateur de format standard "D" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.LongDatePattern actuelle. Par exemple, la chaîne de format personnalisée pour la culture invariante est "dddd, dd MMMM yyyy".
it: L'identificatore di formato standard "D" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.LongDatePattern corrente. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "dddd, dd MMMM yyyy".
ja: "D" 標準書式指定子は、現在の DateTimeFormatInfo.LongDatePattern プロパティで定義されているカスタム日時書式指定文字列を表します。たとえば、インバリアント カルチャのカスタム書式指定文字列は "dddd, dd MMMM yyyy" です。
ko: "D" 표준 형식 지정자는 현재 DateTimeFormatInfo.LongDatePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "dddd, dd MMMM yyyy"입니다.
pl: Standardowy specyfikator formatu „D” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez bieżącą właściwość DateTimeFormatInfo.LongDatePattern. Na przykład niestandardowy ciąg formatu dla kultury niezmiennej to „dddd, dd MMMM yyyy”.
pt_br: O especificador de formato padrão "D" representa uma cadeia de caracteres de formato de data e hora personalizada que é definida pela propriedade DateTimeFormatInfo.LongDatePattern atual. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "dddd, dd MMMM yyyy".
ru: Описатель стандартного формата "D" представляет строку пользовательского формата даты и времени, определяемую текущим свойством DateTimeFormatInfo.LongDatePattern. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "dddd, dd MMMM yyyy".
tr: "D" standart biçim belirticisi, geçerli DateTimeFormatInfo.LongDatePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "dddd, dd MMMM yyyy"dir.
zh_hans: "D" 标准格式说明符表示由当前 DateTimeFormatInfo LongDatePattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "dddd, dd MMMM yyyy"。
zh_hant: "D" 標準格式規範代表由目前 DateTimeFormatInfo.LongDatePattern 屬性所定義的自訂日期與時間格式字串。例如，不因文化特性而異的自訂格式字串為 "dddd, dd MMMM yyyy"。

source: long time
cs: dlouhý čas
de: Langes Uhrzeitformat
es: hora larga
fr: heure longue
it: Ora estesa
ja: 長い時刻
ko: 자세한 시간
pl: godzina długa
pt_br: hora completa
ru: Длинный формат времени
tr: uzun saat
zh_hans: 长时间
zh_hant: 完整時間
