Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# long_time_description
source: The "T" standard format specifier represents a custom date and time format string that is defined by a specific culture's DateTimeFormatInfo.LongTimePattern property. For example, the custom format string for the invariant culture is "HH:mm:ss".
cs: Specifikátor standardního formátu T představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.LongTimePattern konkrétní jazykové verze. Například řetězec vlastního formátu pro invariantní jazykovou verzi je HH:mm:ss.
de: Der Standardformatbezeichner "T" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.LongTimePattern-Eigenschaft einer bestimmten Kultur definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "HH:mm:ss".
es: El especificador de formato estándar "T" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.LongTimePattern de una referencia cultural específica. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "HH:mm:ss".
fr: Le spécificateur de format standard "T" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.LongTimePattern d'une culture spécifique. Par exemple, la chaîne de format personnalisée pour la culture invariante est "HH:mm:ss".
it: L'identificatore di formato standard "T" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.LongTimePattern di impostazioni cultura specifiche. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "HH:mm:ss".
ja: "T" 標準書式指定子は、特定のカルチャの DateTimeFormatInfo.LongTimePattern プロパティで定義されているカスタム日時書式指定文字列を表します。たとえば、インバリアント カルチャのカスタム書式指定文字列は "HH:mm:ss" です。
ko: "T" 표준 형식 지정자는 특정 문화권의 DateTimeFormatInfo.LongTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "HH:mm:ss"입니다.
pl: Standardowy specyfikator formatu „T” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.LongTimePattern konkretnej kultury. Na przykład niestandardowy ciąg formatu dla kultury niezmiennej to „HH:mm:ss”.
pt_br: O especificador de formato padrão "T" representa uma cadeia de caracteres de formato personalizado de data e hora que é definida pela propriedade DateTimeFormatInfo.LongTimePattern de uma cultura específica. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "HH:mm:ss".
ru: Описатель стандартного формата "T" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.LongTimePattern конкретных языка и региональных параметров. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "HH:mm:ss".
tr: "T" standart biçim belirticisi, belirli bir kültürün DateTimeFormatInfo.LongTimePattern özelliği tarafından tanımlanan bir özel tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "HH:mm:ss" şeklindedir.
zh_hans: "T" 标准格式说明符表示由特定区域性的 DateTimeFormatInfo.LongTimePattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "HH:mm:ss"。
zh_hant: "T" 標準格式規範代表由特定文化特性的 DateTimeFormatInfo.LongTimePattern 屬性所定義的自訂日期與時間格式字串。例如，不因文化特性而異的自訂格式字串為 "HH:mm:ss"。

source: minute (1-2 digits)
cs: minuta (1–2 číslice)
de: Minute (1–2 Stellen)
es: minuto (1-2 dígitos)
fr: minute (1 à 2 chiffres)
it: Minuto (1-2 cifre)
ja: 分 (1 - 2 桁)
ko: 분(1~2자리)
pl: minuta (1-2 cyfry)
pt_br: minuto (1-2 dígitos)
ru: минута (1–2 цифры)
tr: dakika (1-2 rakam)
zh_hans: 分钟(1-2 位数)
zh_hant: 分鐘 (1-2 位數)

# minute_1_2_digits_description
source: The "m" custom format specifier represents the minute as a number from 0 through 59. The minute represents whole minutes that have passed since the last hour. A single-digit minute is formatted without a leading zero. If the "m" format specifier is used without other custom format specifiers, it's interpreted as the "m" standard date and time format specifier.
cs: Specifikátor vlastního formátu m reprezentuje minutu jako číslo od 0 do 59. Minuta představuje celé minuty, které uplynuly od poslední hodiny. Minuta s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu m použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času m.
de: Der benutzerdefinierte Formatbezeichner "m" repräsentiert die Minute als eine Zahl zwischen 0 und 59. Der Minutenwert steht für ganze Minuten, die seit der letzten Stunde vergangen sind. Ein einstelliger Minutenwert wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "m" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "m" für Datum und Uhrzeit interpretiert.
es: El especificador de formato personalizado "m" representa el minuto como un número del 0 al 59. El minuto representa los minutos enteros que han transcurrido desde la última hora. El formato de un minuto con un solo dígito se representa sin cero inicial. Si el especificador de formato "m" se usa sin otros especificadores de formato personalizado, se interpreta como el especificador de formato de fecha y hora estándar "m".
fr: Le spécificateur de format personnalisé "m" représente les minutes sous la forme d'un nombre compris entre 0 et 59. Le résultat correspond aux minutes entières qui se sont écoulées depuis la dernière heure. Une minute à un chiffre est présentée dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "m" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "m".
it: L'identificatore di formato personalizzato "m" rappresenta i minuti come numero compreso tra 0 e 59. Tali minuti rappresentano il numero intero di minuti passati dall'ultima ora. Un minuto costituito da una singola cifra viene formattato senza zero iniziale. Se l'identificatore di formato "m" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "m".
ja: "m" カスタム書式指定子は、分を 0 から 59 の数字として表します。分は、直前の時からの経過時間 (分単位) を表します。1 桁の分は、先行ゼロなしで書式設定されます。 "m" 書式指定子を他のカスタム書式指定子なしで使用すると、"m" 標準日時書式指定子として解釈されます。
ko: "m" 사용자 지정 형식 지정자는 분을 0부터 59까지의 숫자로 나타냅니다. 분은 마지막 정각으로부터 경과한 정수 분을 나타냅니다. 한 자릿수 분은 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "m" 형식 지정자를 사용하면 "m" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Niestandardowy specyfikator formatu „m” reprezentuje minutę jako liczbę z zakresu od 0 do 59. Wartość minuty reprezentuje całe minuty, które upłynęły od ostatniej godziny. Jednocyfrowa wartość minuty jest formatowana bez zera wiodącego. Jeśli specyfikator formatu „m” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny „m”.
pt_br: O especificador de formato personalizado "m" representa o minuto como um número de 0 a 59. O minuto representa minutos inteiros que passaram desde a última hora. Um minuto de dígito único é formatado sem um zero à esquerda. Se o especificador de formato "m" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "m".
ru: Описатель пользовательского формата "m" представляет минуту в виде числа от 0 до 59. Это число представляет собой целые минуты, истекшие с момента наступления последнего часа. Значение минуты из одной цифры форматируется без начального нуля. Если описатель формата "m" используется без других описателей пользовательского формата, он интерпретируется как описатель "m" стандартного формата даты и времени.
tr: "m" özel biçim belirticisi dakikayı 0 ile 59 arasında bir sayı ile temsil eder. Dakika, son saatten bu yana geçen tam dakikaları temsil eder. Tek haneli bir dakika, başına sıfır eklenmeden biçimlendirilir. "m" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçim belirticisi olarak yorumlanır.
zh_hans: "m" 自定义格式说明符将分钟表示为从 0 到 59 的数字。分钟表示自前一小时后经过的整分钟数。一位数字的分钟数设置为不带前导零的格式。 如果使用 "m" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "m" 标准日期和时间格式说明符。
zh_hant: "m" 自訂格式規範代表分鐘，以數字 0 到 59 表示。分鐘代表自上一個小時後所經過的整數分鐘數。單一數字的分鐘格式，開頭不會出現零。 如果在使用 "m" 格式規範時沒有其他自訂格式規範，則會將其解譯為 "m" 標準日期與時間格式規範。

source: minute (2 digits)
cs: minuta (2 číslice)
de: Minute (2 Stellen)
es: minuto (2 dígitos)
fr: minute (2 chiffres)
it: Minuto (2 cifre)
ja: 分 (2 桁)
ko: 분(2자리)
pl: minuta (2 cyfry)
pt_br: minuto (2 dígitos)
ru: минута (2 цифры)
tr: dakika (2 rakam)
zh_hans: 分钟(2 位数)
zh_hant: 分鐘 (2 位數)

# minute_2_digits_description
source: The "mm" custom format specifier (plus any number of additional "m" specifiers) represents the minute as a number from 00 through 59. The minute represents whole minutes that have passed since the last hour. A single-digit minute is formatted with a leading zero.
cs: Specifikátor vlastního formátu mm (a libovolný počet dalších specifikátorů m) reprezentuje minutu jako číslo od 00 do 59. Minuta představuje celé minuty, které uplynuly od poslední hodiny. Minuta s jednou číslicí se formátuje s nulou na začátku.
de: Der benutzerdefinierte Formatbezeichner "mm" (plus beliebig viele zusätzliche m-Bezeichner) repräsentiert die Minute als eine Zahl zwischen 00 und 59. Der Minutenwert steht für ganze Minuten, die seit der letzten Stunde vergangen sind. Ein einstelliger Minutenwert wird mit einer führenden Null formatiert.
es: El especificador de formato personalizado "mm" (más cualquier número de especificadores "m" adicionales) representa el minuto como un número del 00 al 59. El minuto representa los minutos enteros que han transcurrido desde la última hora. El formato de un minuto con un solo dígito se representa sin cero inicial.
fr: Le spécificateur de format personnalisé "mm" (plus n'importe quel nombre de spécificateurs "m" supplémentaires) représente les minutes sous la forme d'un nombre compris entre 00 et 59. Une minute à un chiffre est présentée dans un format qui comporte un zéro de début.
it: L'identificatore di formato personalizzato "mm" (più qualsiasi numero di identificatori "m" aggiuntivi) rappresenta i minuti come numero compreso tra 00 e 59. Tali minuti rappresentano il numero intero di minuti passati dall'ultima ora. Un minuto costituito da una singola cifra viene formattato con uno zero iniziale.
ja: "mm" カスタム書式指定子 (任意の数の "m" 指定子を追加できます) は、分を 00 から 59 の数字として表します。分は、直前の時からの経過時間 (分単位) を表します。1 桁の分は、先行ゼロ付きで書式設定されます。
ko: "mm" 사용자 지정 형식 지정자(및 임의 개수의 추가 "m" 지정자)는 분을 00부터 59까지의 숫자로 나타냅니다. 분은 마지막 정각으로부터 경과한 정수 분을 나타냅니다. 한 자릿수 분은 앞에 0이 있는 형식으로 지정됩니다.
pl: Niestandardowy specyfikator formatu „mm” (oraz dowolna liczba dodatkowych specyfikatorów „m”) reprezentuje minutę jako liczbę z zakresu od 00 do 59. Wartość minuty reprezentuje całe minuty, które upłynęły od ostatniej godziny. Jednocyfrowa wartość minuty jest formatowana za pomocą zera wiodącego.
pt_br: O especificador de formato personalizado "mm" (mais qualquer número de especificadores "m" adicionais) representa o minuto como um número de 00 a 59. O minuto representa minutos inteiros que passaram desde a última hora. Um minuto de dígito único é formatado com um zero à esquerda.
ru: Описатель пользовательского формата "mm" (плюс любое число дополнительных описателей "m") представляет минуту в виде числа от 00 до 59. Это число представляет собой целые минуты, истекшие с момента наступления последнего часа. Значение минуты из одной цифры форматируется с начальным нулем.
tr: "mm" özel biçim belirticisi (ve herhangi bir sayıda ek "m" belirticisi) dakikayı 00 ile 59 arasında bir sayı ile temsil eder. Dakika, son saatten bu yana geçen tam dakikaları temsil eder. Tek haneli bir dakika, başına sıfır eklenerek biçimlendirilir.
zh_hans: "mm" 自定义格式说明符(另加任意数量的其他 "m" 说明符)将分钟表示为从 00 至 59 的数字。分钟表示自前一小时后经过的整分钟数。一位数字的分钟数设置为带前导零的格式。
zh_hant: "mm" 自訂格式規範 (加上任意數目的其他 "m" 規範) 代表分鐘，以數字 00 到 59 表示。分鐘代表自上一個小時後，已經過的整數分鐘數。單一數字的分鐘格式，開頭不會出現零。

source: month (1-2 digits)
cs: měsíc (1–2 číslice)
de: Monate (1–2 Stellen)
es: mes (1-2 dígitos)
fr: mois (1 à 2 chiffres)
it: Mese (1-2 cifre)
ja: 月 (1 - 2 桁)
ko: 월(1~2자리)
pl: miesiąc (1-2 cyfry)
pt_br: mês (1-2 dígitos)
ru: месяц (1–2 цифры)
tr: ay (1-2 rakam)
zh_hans: 月(1-2 位数)
zh_hant: 月份 (1-2 位數)

# month_1_2_digits_description
source: The "M" custom format specifier represents the month as a number from 1 through 12 (or from 1 through 13 for calendars that have 13 months). A single-digit month is formatted without a leading zero. If the "M" format specifier is used without other custom format specifiers, it's interpreted as the "M" standard date and time format specifier.
cs: Specifikátor vlastního formátu M reprezentuje měsíc jako číslo od 1 do 12 (nebo od 1 do 13 pro kalendáře, které mají 13 měsíců). Den s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu M použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času M.
de: Der benutzerdefinierte Formatbezeichner "M" repräsentiert den Monat als eine Zahl zwischen 1 und 12 (bzw. zwischen 1 und 13 für Kalender mit 13 Monaten). Ein einstelliger Monatswert wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "M" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "M" für Datum und Uhrzeit interpretiert.
es: El especificador de formato personalizado "M" representa el mes como un número del 1 al 12 (o de 1 a 13 para los calendarios con 13 meses). El formato de un mes con un solo dígito se representa sin cero inicial. Si el especificador de formato "M" se usa sin otros especificadores de formato personalizado, se interpreta como el especificador de formato de fecha y hora estándar "M".
fr: Le spécificateur de format personnalisé "M" représente le mois sous la forme d'un nombre compris entre 1 et 12 (ou entre 1 et 13 pour les calendriers de 13 mois). Un mois à un chiffre est présenté dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "M" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard : "M".
it: L'identificatore di formato personalizzato "M" rappresenta il mese come numero compreso tra 1 e 12 (o tra 1 e 13 per i calendari con 13 mesi). Un mese a una sola cifra viene formattato senza zero iniziale. Se l'identificatore di formato "M" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard "M".
ja: "M" カスタム書式指定子は、月を 1 から 12 (13 か月のカレンダーの場合は 1 から 13) の数字として表します。1 桁の月は、先行ゼロなしで書式設定されます。 "M" 書式指定子を他のカスタム書式指定子なしで使用すると、"M" 標準日時書式指定子として解釈されます。
ko: "M" 사용자 지정 형식 지정자는 월을 1부터 12까지의 숫자(13개월이 있는 달력에서는 1부터 13까지의 숫자)로 나타냅니다. 한 자릿수 월은 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "M" 형식 지정자를 사용하면 "M" 표준 날짜 및 시간 형식 지정자로 해석됩니다.
pl: Niestandardowy specyfikator formatu „M” reprezentuje miesiąc jako liczbę z zakresu od 1 do 12 (lub od 1 do 13 dla kalendarzy z 13 miesiącami). Jednocyfrowa wartość miesiąca jest formatowana bez zera wiodącego. Jeśli specyfikator formatu „M” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny „M”.
pt_br: O especificador de formato personalizado "M" representa o mês como um número de 1 a 12 (ou de 1 a 13 para calendários com 13 meses). Um mês de dígito único é formatado sem um zero à esquerda. Se o especificador de formato "M" for usado sem outros especificadores de formato personalizado, ele será interpretado como o especificador de formato padrão de data e hora "M".
ru: Описатель пользовательского формата "M" представляет месяц в виде числа от 1 до 12 (или от 1 до 13 для календарей, состоящих из 13 месяцев). Значение месяца из одной цифры форматируется без начального нуля. Если описатель формата "M" используется без других описателей пользовательского формата, он интерпретируется как описатель "M" стандартного формата даты и времени.
tr: "M" özel biçim belirticisi ayı 1 ile 12 (veya 13 ayı olan takvimler için 1 ile 13) arasında bir sayı ile temsil eder. Tek haneli bir ay, başına sıfır eklenmeden biçimlendirilir. "A" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçimi belirticisi olarak yorumlanır.
zh_hans: "M" 自定义格式说明符将月份表示为从 1 至 12 (如果日历包含 13 个月，则为从 1 到 13)的数字。一位数字的月份设置为不带前导零的格式。 如果使用 "M" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "M" 标准日期和时间格式说明符。
zh_hant: "M" 自訂格式規範代表月份，以數字 1 到 12 表示 (若月曆有 13 個月，則以數字 1 到 13 表示)。單一數字的月份格式，開頭不會出現零。 如果在使用 "M" 格式規範時沒有其他自訂格式規範，則會將其解譯為 "M" 標準日期與時間格式規範。

source: month (2 digits)
cs: měsíc (2 číslice)
de: Monat (2 Stellen)
es: mes (2 dígitos)
fr: mois (2 chiffres)
it: Mese (2 cifre)
ja: 月 (2 桁)
ko: 월(2자리)
pl: miesiąc (2 cyfry)
pt_br: mês (2 dígitos)
ru: месяц (2 цифры)
tr: ay (2 rakam)
zh_hans: 月(2 位数)
zh_hant: 月份 (2 位數)

# month_2_digits_description
source: The "MM" custom format specifier represents the month as a number from 01 through 12 (or from 1 through 13 for calendars that have 13 months). A single-digit month is formatted with a leading zero.
cs: Specifikátor vlastního formátu MM reprezentuje den v měsíci jako číslo od 01 do 12 (nebo od 01 do 13 pro kalendáře, které mají 13 měsíců). Den s jednou číslicí se formátuje s nulou na začátku.
de: Der benutzerdefinierte Formatbezeichner "MM" repräsentiert den Monat als eine Zahl zwischen 01 und 12 (bzw. zwischen 1 und 13 für Kalender mit 13 Monaten). Ein einstelliger Monatswert wird mit einer führenden Null formatiert.
es: El especificador de formato personalizado "MM" representa el mes como un número del 01 al 12 (o de 1 a 13 para los calendarios con 13 meses). El formato de un mes con un solo dígito se representa sin cero inicial.
fr: Le spécificateur de format personnalisé "MM" représente le mois sous la forme d'un nombre compris entre 01 et 12 (ou entre 01 et 13 pour les calendriers de 13 mois). Un mois à un chiffre est présenté dans un format qui comporte un zéro de début.
it: L'identificatore di formato personalizzato "MM" rappresenta il mese come numero compreso tra 01 e 12 (o tra 1 e 13 per i calendari con 13 mesi). Un mese a una sola cifra viene formattato con uno zero iniziale.
ja: "MM" カスタム書式指定子は、月を 01 から 12 (13 か月のカレンダーの場合は 01 から 13) の数字として表します。1 桁の月は、先行ゼロ付きで書式設定されます。
ko: "MM" 사용자 지정 형식 지정자는 월을 01부터 12까지의 숫자(13개월이 있는 달력에서는 1부터 13까지의 숫자)로 나타냅니다. 한 자릿수 월은 앞에 0이 있는 형식으로 지정됩니다.
pl: Niestandardowy specyfikator formatu „MM” reprezentuje miesiąc jako liczbę z zakresu od 01 do 12 (lub od 01 do 13 dla kalendarzy z 13 miesiącami). Miesiąc jednocyfrowy jest formatowany przy użyciu zera wiodącego.
pt_br: O especificador de formato personalizado "MM" representa o mês como um número de 01 a 12 (ou de 1 a 13 para calendários com 13 meses). Um mês de dígito único é formatado com um zero à esquerda.
ru: Описатель пользовательского формата "MM" представляет месяц в виде числа от 1 до 12 (или от 1 до 13 для календарей, состоящих из 13 месяцев). Значение месяца из одной цифры форматируется с начальным нулем.
tr: "MM" özel biçim belirticisi, ayı 01 ile 12 (veya 13 ayı olan takvimler için 1 ile 13) arasında bir sayı olarak temsil eder. Tek haneli bir ay, başına sıfır eklenerek biçimlendirilir.
zh_hans: "MM" 自定义格式说明符将月份表示为从 01 至 12 (如果日历包含 13 个月，则为从 1 到 13)的数字。一位数字的月份设置为带前导零的格式。
zh_hant: "MM" 自訂格式規範代表月份，以數字 01 到 12 表示 (若月曆有 13 個月，則以數字 1 到 13 表示)。單一數字的月份格式，開頭不會出現零。

source: month (abbreviated)
cs: měsíc (zkrácený)
de: Monat (abgekürzt)
es: mes (abreviado)
fr: mois (abrégé)
it: Mese (abbreviato)
ja: 月 (省略)
ko: 월(약식)
pl: miesiąc (skrót)
pt_br: mês (abreviado)
ru: месяц (сокращенно)
tr: ay (kısa)
zh_hans: 月(缩写)
zh_hant: 月份 (縮寫)

# month_abbreviated_description
source: The "MMM" custom format specifier represents the abbreviated name of the month. The localized abbreviated name of the month is retrieved from the DateTimeFormatInfo.AbbreviatedMonthNames property of the current or specified culture.
cs: Specifikátor vlastního formátu MMM reprezentuje zkrácený název měsíce. Lokalizovaný zkrácený název měsíce se načítá z vlastnosti DateTimeFormatInfo.AbbreviatedMonthNames aktuální nebo zadané jazykové verze.
de: Der benutzerdefinierte Formatbezeichner "MMM" repräsentiert den abgekürzten Namen des Monats. Der lokalisierte abgekürzte Name des Monats wird aus der DateTimeFormatInfo.AbbreviatedMonthNames-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen.
es: El especificador de formato personalizado "MMM" representa el nombre abreviado del mes. El nombre abreviado adaptado del mes se recupera de la propiedad DateTimeFormatInfo.AbbreviatedMonthNames de la referencia cultural actual o especificada.
fr: Le spécificateur de format personnalisé "MMM" représente le nom abrégé du mois. Le nom abrégé localisé du mois est récupéré à partir de la propriété DateTimeFormatInfo.AbbreviatedMonthNames de la culture actuelle ou spécifiée.
it: L'identificatore di formato personalizzato "MMM" rappresenta il nome abbreviato del mese. Il nome abbreviato localizzato del mese viene recuperato dalla proprietà DateTimeFormatInfo.AbbreviatedMonthNames delle impostazioni cultura correnti o specificate.
ja: "MMM" カスタム書式指定子は、月の省略名を表します。ローカライズされた月の省略名は、現在のカルチャまたは指定したカルチャの DateTimeFormatInfo.AbbreviatedMonthNames プロパティから取得されます。
ko: "MMM" 사용자 지정 형식 지정자는 월의 약식 이름을 나타냅니다. 월의 지역화된 약식 이름은 현재 문화권 또는 지정된 문화권의 DateTimeFormatInfo.AbbreviatedMonthNames 속성에서 검색됩니다.
pl: Niestandardowy specyfikator formatu „MMM” reprezentujący skróconą nazwę miesiąca. Zlokalizowana skrócona nazwa miesiąca jest pobierana z właściwości DateTimeFormatInfo.AbbreviatedMonthNames bieżącej lub określonej kultury.
pt_br: O especificador de formato personalizado "MMM" representa o nome abreviado do mês. O nome abreviado localizado do mês é recuperado da propriedade DateTimeFormatInfo.AbbreviatedMonthNames da cultura atual ou especificada.
ru: Описатель пользовательского формата "MMM" представляет сокращенное название месяца. Локализованное сокращенное название месяца извлекается из свойства DateTimeFormatInfo.AbbreviatedMonthNames текущих или заданных языка и региональных параметров.
tr: "MMM" özel biçim belirticisi, ayın kısaltılmış adını temsil eder. Ayın yerelleştirilmiş kısaltılmış adı, geçerli veya belirtilen kültürün DateTimeFormatInfo.AbbreviatedMonthNames özelliğinden alınır.
zh_hans: "MMM" 自定义格式说明符表示月份的缩写名称。可从当前或指定区域性的 DateTimeFormatInfo.AbbreviatedMonthNames 属性中检索月份的本地化缩写名称。
zh_hant: "MMM" 自訂格式規範代表該月份的縮寫名稱。系統會從目前文化特性或指定文化特性的 DateTimeFormatInfo.AbbreviatedMonthNames 屬性，擷取該月份的當地語系化縮寫名稱。

source: month day
cs: den v měsíci
de: Tag des Monats
es: día del mes
fr: jour du mois
it: Giorno del mese
ja: 月日
ko: 월 일
pl: dzień miesiąca
pt_br: dia do mês
ru: День месяца
tr: ayın günü
zh_hans: 月日
zh_hant: 月日
