Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Adding {0} into an interface method requires restarting the application.
cs: Přidání {0} do metody rozhraní vyžaduje restartování aplikace.
de: Das Hinzufügen von {0} zu einer Schnittstellenmethode erfordert einen Neustart der Anwendung.
es: Para agregar {0} en un método de interfaz es necesario reiniciar la aplicación.
it: Se si aggiunge {0} in un metodo di interfaccia, è necessario riavviare l'applicazione.
ja: インターフェイス メソッドに {0} を追加するには、アプリケーションを再起動する必要があります。
ko: 인터페이스 메소드에 {0}을(를) 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie elementu {0} do metody interfejsu wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar {0} a um método de interface requer a reinicialização do aplicativo.
ru: Для добавления {0} в метод интерфейса требуется перезапустить приложение.
tr: Bir arabirim yöntemine {0} eklemek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将 {0} 添加到接口方法中需要重新启动应用程序。

source: Adding {0} into an interface requires restarting the application.
cs: Přidání {0} do rozhraní vyžaduje restartování aplikace.
de: Das Hinzufügen von {0} zu einer Schnittstelle erfordert einen Neustart der Anwendung.
es: Para agregar {0} en una interfaz se requiere reiniciar la aplicación.
it: Se si aggiunge {0} in un'interfaccia, è necessario riavviare l'applicazione.
ja: インターフェイスに {0} を追加するには、アプリケーションを再起動する必要があります。
ko: 인터페이스에 {0}을(를) 추가하려면 애플리케이션을 다시 시작해야 합니다.
pl: Dodanie elementu {0} do interfejsu wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar {0} a uma interface requer o reinício do aplicativo.
ru: Для добавления {0} в интерфейс требуется перезапустить приложение.
tr: Bir arabirime {0} eklenmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将 {0} 添加到接口需要重启应用程序。

source: Adding {0} requires restarting the application.
cs: Přidání {0} vyžaduje restartování aplikace.
de: Das Hinzufügen von {0} erfordert einen Neustart der Anwendung.
es: Para agregar {0} se requiere reiniciar la aplicación.
it: Se si aggiunge {0}, è necessario riavviare l'applicazione.
ja: {0} を追加するには、アプリケーションを再起動する必要があります。
ko: {0}을(를) 추가하려면 애플리케이션을 다시 시작해야 합니다.
pl: Dodanie elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar {0} requer reiniciar o aplicativo.
ru: Для добавления {0} требуется перезапустить приложение.
tr: {0} öğesinin eklenmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加 {0} 要求重启应用程序。

source: Adding {0} with the Handles clause requires restarting the application.
cs: Přidání {0} s klauzulí Handles vyžaduje restartování aplikace.
de: Das Hinzufügen von {0} mit der der Handles-Klausel erfordert einen Neustart der Anwendung.
es: Para agregar {0} con la cláusula Handles es necesario reiniciar la aplicación.
it: Se si aggiunge {0} con la clausola Handles, è necessario riavviare l'applicazione.
ja: Handles 句 に {0} を追加するには、アプリケーションを再起動する必要があります。
ko: Handles 절과 함께 {0}을(를) 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodawanie elementu {0} za pomocą klauzuli procedur Handles wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar {0} com a cláusula Handles requer a reinicialização do aplicativo.
ru: Для добавления {0} с предложением Handles требуется перезапустить приложение.
tr: Handles yan tümcesi ile {0} eklemek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 使用 Handles 子句添加 {0} 需要重新启动应用程序。

source: Adding a MustOverride {0} or overriding an inherited {0} requires restarting the application.
cs: Přidání {0} MustOverride nebo přepsání zděděného {0} vyžaduje restartování aplikace.
de: Das Hinzufügen einer „MustOverride“ {0} oder das Überschreiben eines geerbten {0} erfordert einen Neustart der Anwendung.
es: Para agregar un {0} MustOverride o invalidar un {0} heredado es necesario reiniciar la aplicación.
it: Se si aggiunge un elemento {0} MustOverride o si esegue l'override di un elemento {0} ereditato, è necessario riavviare l'applicazione.
ja: MustOverride {0} を追加するか、継承された {0} をオーバーライドするには、アプリケーションを再起動する必要があります。
ko: MustOverride {0}를 추가하거나 상속된 {0}를 재정의하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodawanie słowa kluczowego {0} MustOverride lub zastąpienie dziedziczonego elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um MustOverride {0} ou substituir um {0} herdado requer a reinicialização do aplicativo.
ru: Для добавления MustOverride {0} или переопределение унаследованного {0} требуется перезапустить приложение.
tr: Bir MustOverride {0} eklemek veya devralınmış bir {0} öğesini geçersiz kılmak uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加 MustOverride {0} 或替代继承的 {0} 需要重新启动应用程序。

source: Adding a constructor to a type with a field or property initializer that contains an anonymous function requires restarting the application.
cs: Přidání konstruktoru k typu s inicializátorem pole nebo vlastnosti, který obsahuje anonymní funkci, vyžaduje restartování aplikace.
de: Das Hinzufügen eines Konstruktors zu einem Typ mit einem Feld- oder Eigenschafteninitialisierer, der eine anonyme Funktion enthält, erfordert einen Neustart der Anwendung.
es: Para agregar un constructor a un tipo con un inicializador de campo o propiedad que contiene una función anónima, es necesario reiniciar la aplicación.
it: Se aggiunge un costruttore a un tipo con un inizializzatore di campo o proprietà che contiene una funzione anonima, è necessario riavviare l'applicazione.
ja: 匿名関数を含むフィールドまたはプロパティの初期化子を持つ型にコンストラクターを追加するには、アプリケーションを再起動する必要があります。
ko: 익명 함수가 포함된 필드 또는 속성 이니셜라이저가 있는 형식에 생성자를 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie konstruktora do typu z inicjatorem pola lub właściwości zawierającego funkcję anonimową wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um construtor a um tipo com um inicializador de campo ou propriedade que contém uma função anônima requer a reinicialização do aplicativo.
ru: Для добавления конструктора к типу с инициализатором поля или свойства, содержащим анонимную функцию, требуется перезапустить приложение.
tr: Anonim bir tür içeren alan veya özellik başlatıcısının bulunduğu bir türe oluşturucu eklenmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 使用包含匿名类型的字段或属性初始值设定项向类型添加构造函数需要重新启动应用程序。

source: Adding a method with an explicit interface specifier requires restarting the application.
cs: Přidání metody s explicitním specifikátorem rozhraní vyžaduje restartování aplikace.
de: Das Hinzufügen einer Methode mit einem expliziten Schnittstellenbezeichner erfordert einen Neustart der Anwendung.
es: Para agregar un método con un especificador de interfaz explícito, es necesario reiniciar la aplicación.
it: Se si aggiunge un metodo con un identificatore di interfaccia esplicito, è necessario riavviare l'applicazione.
ja: 明示的なインターフェイス指定子を含むメソッドを追加するには、アプリケーションを再起動する必要があります。
ko: 명시적 인터페이스 지정자를 사용하여 메서드를 추가하려면 애플리케이션을 다시 시작해야 합니다.
pl: Dodanie metody z jawnym specyfikatorem interfejsu wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um método com um especificador de interface explícito requer o reinício do aplicativo.
ru: Для добавления метода с явным описателем интерфейса требуется перезапустить приложение.
tr: Açık bir arabirim tanımlayıcısıyla bir yöntem eklemek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加具有显式接口说明符的方法需要重启应用程序。

source: Adding a new file requires restarting the application.
cs: Přidání nového souboru vyžaduje restartování aplikace.
de: Das Hinzufügen einer neuen Datei erfordert einen Neustart der Anwendung.
es: Para agregar un nuevo archivo es necesario reiniciar la aplicación.
it: Se si aggiunge un nuovo file, è necessario riavviare l'applicazione.
ja: 新しいファイルを追加するには、アプリケーションを再起動する必要があります。
ko: 새 파일을 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodawanie nowego pliku wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um novo arquivo requer a reinicialização do aplicativo.
ru: Для добавления нового файла требуется перезапустить приложение.
tr: Yeni bir dosya eklemek, uygulamanın yeniden başlatılmasını gerektir.
zh_hans: 添加新文件需要重新启动应用程序。

source: Adding a user defined {0} requires restarting the application.
cs: Přidání {0} definovaného uživatelem vyžaduje restartování aplikace.
de: Das Hinzufügen einer benutzerdefinierten {0} erfordert einen Neustart der Anwendung.
es: Para agregar un {0} definido por el usuario es necesario reiniciar la aplicación.
it: Se si aggiorna un elemento {0} definito dall'utente, è necessario riavviare l'applicazione.
ja: ユーザー定義 {0} を追加するには、アプリケーションを再起動する必要があります。
ko: 사용자 정의 {0}을(를) 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodanie zdefiniowanego przez użytkownika elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um {0} definido pelo usuário requer a reinicialização do aplicativo.
ru: Для добавления пользовательского {0} требуется перезапустить приложение.
tr: Kullanıcı tanımlı bir {0} eklemek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加用户定义的 {0} 需要重新启动应用程序。

source: Adding an abstract {0} or overriding an inherited {0} requires restarting the application.
cs: Přidání abstraktního {0} nebo přepsání zděděného {0} vyžaduje restartování aplikace.
de: Das Hinzufügen einer abstrakten {0} oder das Überschreiben einer geerbten {0} erfordert einen Neustart der Anwendung.
es: Para agregar un {0} abstracto o invalidar un {0} heredado, es necesario reiniciar la aplicación.
it: Se si aggiunge un elemento {0} astratto o si esegue l'override di un elemento {0} ereditato, è necessario riavviare l'applicazione.
ja: 抽象的な {0} を追加するか、継承された {0} をオーバーライドするには、アプリケーションを再起動する必要があります。
ko: 추상 {0}을(를) 추가하거나 상속된 {0}을(를) 재정의하려면 애플리케이션을 다시 시작해야 합니다.
pl: Dodanie abstrakcyjnego elementu {0} lub zastąpienie dziedziczonego elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um {0} abstrato ou substituir um {0} herdado requer o reinício do aplicativo.
ru: Для добавления абстрактного {0} или переопределения унаследованного {0} требуется перезапустить приложение.
tr: Özet {0} eklenmesi veya devralınmış bir {0} öğesinin geçersiz kılınması uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加抽象 {0} 或重写继承的 {0} 要求重启应用程序。

source: Adding an extern {0} requires restarting the application.
cs: Přidání {0} extern vyžaduje restartování aplikace.
de: Das Hinzufügen einer externen {0} erfordert einen Neustart der Anwendung.
es: Para agregar un {0} externo, es necesario reiniciar la aplicación.
it: Se si aggiunge un elemento {0} extern, è necessario riavviare l'applicazione.
ja: extern {0} を追加するには、アプリケーションを再起動する必要があります。
ko: extern {0}을(를) 추가하려면 애플리케이션을 다시 시작해야 합니다.
pl: Dodanie extern elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um {0} externo requer o reinício do aplicativo.
ru: Для добавления extern {0} требуется перезапустить приложение.
tr: Dış bir {0} eklenmesi(extern), uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 添加 extern {0} 需要重启应用程序。

source: Adding an imported method requires restarting the application.
cs: Přidání importované metody vyžaduje restartování aplikace.
de: Das Hinzufügen einer importierten Methode erfordert einen Neustart der Anwendung.
es: Para agregar un método importado es necesario reiniciar la aplicación.
it: Se si aggiunge un metodo importato, è necessario riavviare l'applicazione.
ja: インポートされたメソッドを追加するには、アプリケーションを再起動する必要があります。
ko: 가져온 메서드를 추가하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Dodawanie zaimportowanej metody wymaga ponownego uruchomienia aplikacji.
pt_br: Adicionar um método importado requer a reinicialização do aplicativo.
ru: Для добавления импортированного метода требуется перезапустить приложение.
tr: İçeri aktarılan bir yöntemin eklenmesi uygulamanın yeniden başlatılmasını gerektiriyor.
zh_hans: 添加导入的方法需要重新启动应用程序。

source: Align wrapped arguments
cs: Zarovnat zalomené argumenty
de: Umschlossene Argumente ausrichten
es: Alinear argumentos ajustados
fr: Aligner les arguments enveloppés
it: Allinea gli argomenti con ritorno a capo
ja: 折り返された引数を揃える
ko: 래핑된 인수 맞춤
pl: Wyrównaj zawinięte argumenty
pt_br: Alinhar argumentos encapsulados
ru: Выровнять свернутые аргументы
tr: Sarmalanan bağımsız değişkenleri hizala
zh_hans: 对齐包装的参数
zh_hant: 對齊包裝的引數

source: Align wrapped parameters
cs: Zarovnat zalomené parametry
de: Umschlossene Parameter ausrichten
es: Alinear parámetros ajustados
fr: Aligner les paramètres enveloppés
it: Allinea i parametri con ritorno a capo
ja: 折り返されたパラメーターを調整します
ko: 래핑된 매개 변수 맞춤
pl: Wyrównaj zawinięte parametry
pt_br: Alinhar os parâmetros encapsulados
ru: Выровнять свернутые параметры
tr: Sarmalanan parametreleri hizala
zh_hans: 对齐包装参数
zh_hant: 對齊包裝的參數

source: Alternation conditions cannot be comments
cs: Podmínky alternativního výrazu nemůžou být komentáře.
de: Wechselbedingungen dürfen keine Kommentare sein.
es: Las condiciones de alternancia no pueden ser comentarios
fr: Les conditions d'alternance ne peuvent pas être des commentaires
it: Le condizioni di alternanza non possono essere commenti
ja: 選択条件をコメントにできません
ko: 교체 조건은 주석이 될 수 없습니다.
pl: Warunki alternatywne nie mogą być komentarzami
pt_br: Condições de alternância não podem ser comentários
ru: Условия чередования не могут быть комментариями
tr: Değişim koşulları yorum olamaz
zh_hans: 替换条件不能是注释
zh_hant: 替代條件不可為註解

source: Alternation conditions do not capture and cannot be named
cs: Podmínky alternativního výrazu nezachytávají a nejde je pojmenovat.
de: Wechselbedingungen werden nicht erfasst und können nicht benannt werden.
es: Las condiciones de alternancia no se captan y se les puede poner un nombre
fr: Les conditions d'alternance n'effectuent pas de capture et ne peuvent pas être nommées
it: Le condizioni di alternanza non consentono l'acquisizione e non possono essere denominate
ja: 選択条件が捕捉されないため、名前を指定できません
ko: 교체 조건은 캡처하지 않고 이름을 지정할 수 없습니다.
pl: Warunki alternatywne nie przechwytują i nie mogą być nazywane
pt_br: Condições de alternância não capturam e não podem ser nomeadas
ru: Условия чередования не выполняют запись, и им невозможно присвоить имя
tr: Değişim koşulları yakalamak değil ve adlandırılamaz
zh_hans: 替换条件不捕获且不能命名
zh_hant: 替代條件不會擷取，也無法命名

source: An update that causes the return type of the implicit Main method to change requires restarting the application.
cs: Aktualizace, která způsobí změnu návratového typu implicitní metody Main, vyžaduje restartování aplikace.
de: Ein Update, das bewirkt, dass der Rückgabetyp der impliziten Main-Methode geändert wird, erfordert einen Neustart der Anwendung.
es: Una actualización que hace que el tipo de valor devuelto del método Main implícito cambie requiere reiniciar la aplicación.
it: Con un aggiornamento che causa la modifica del tipo restituito del metodo Main implicito è necessario riavviare l'applicazione.
ja: 暗黙的な Main メソッドの戻り値の型を変更する更新には、アプリケーションの再起動が必要です。
ko: 암시적 Main 메서드의 반환 유형이 변경되도록 하는 업데이트는 응용 프로그램을 다시 시작해야 합니다.
pl: Aktualizacja, która powoduje zmianę zwracanego typu niejawnej metody Main, wymaga ponownego uruchomienia aplikacji.
pt_br: Uma atualização que faz com que o tipo de retorno do método Main implícito seja alterado requer a reinicialização do aplicativo.
ru: Для обновления, приводящего к изменению возвращаемого типа неявного метода Main, требуется перезапустить приложение.
tr: Örtük Main yönteminin dönüş türü değişikliğine neden olan bir güncelleştirme, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 导致隐式 Main 方法的返回类型更改的更新需要重新启动应用程序。

source: Apply auto property preferences
cs: Použít předvolby automatických vlastností
de: Automatische Eigenschaftsvoreinstellungen anwenden
es: Aplicar preferencias de propiedad automática
it: Applica preferenze delle proprietà automatiche
ja: プロパティの基本設定を自動的に適用する
ko: 자동 속성 적용 기본 설정
pl: Zastosuj preferencje właściwości automatycznych
pt_br: Aplicar preferências de propriedade automática
ru: Применить настройки для автосвойства
tr: Otomatik özellik tercihlerini uygula
zh_hans: 应用自动属性首选项

source: Apply blank line preferences (experimental)
cs: Použít předvolby prázdných řádků (experimentální)
de: Anwenden von Leerzeilenvoreinstellungen (experimentell)
es: Aplicar preferencias de línea en blanco (experimental)
it: Applica preferenze riga vuota (sperimentale)
ja: 改行の基本設定を適用する (試験段階):
ko: 빈 줄 적용 기본 설정(실험적)
pl: Zastosuj preferencje pustego wiersza (eksperymentalne)
pt_br: Aplicar preferências de linha em branco (experimental):
ru: Применить настройки для пустой строки (экспериментальная функция)
tr: Boş satır tercihlerini uygula (deneysel):
zh_hans: 应用空白行首选项(实验性)

source: Apply coalesce expression preferences
cs: Použít předvolby slučovacích výrazů
de: Voreinstellungen für zusammengesetzte Ausdrücke anwenden
es: Aplicar preferencias de expresión de fusión
it: Applica preferenze delle espressioni di unione
ja: 結合式の基本設定を適用する
ko: 병합 식 적용 기본 설정
pl: Zastosuj preferencje wyrażenia łączenia
pt_br: Aplicar preferências de expressão de unir
ru: Применить настройки для выражения объединения
tr: Birleşim ifadesi tercihlerini uygula
zh_hans: 应用联合表达式首选项

source: Apply compound assignment preferences
cs: Použít předvolby složených přiřazení
de: Verbundzuweisungsvoreinstellungen anwenden
es: Aplicar preferencias de asignación compuesta
it: Applica preferenze di assegnazione composta
ja: 複合割り当ての基本設定を適用する
ko: 복합 할당 적용 기본 설정
pl: Zastosuj preferencje przypisywania złożonego
pt_br: Aplicar preferências de atribuição composta
ru: Применить настройки для составного назначения
tr: Bileşik atama tercihlerini uygula
zh_hans: 应用复合分配首选项

source: Apply conditional expression preferences
cs: Použít předvolby podmínky
de: Voreinstellungen für bedingte Ausdrücke anwenden
es: Aplicar preferencias de expresión condicional
it: Applica preferenze per le espressioni condizionali
ja: 条件式の基本設定を適用する
ko: 조건식 적용 기본 설정
pl: Zastosuj preferencje wyrażenia warunkowego
pt_br: Aplicar preferências de expressão condicional
ru: Применить настройки для условного выражения
tr: Koşullu ifade tercihlerini uygula
zh_hans: 应用条件表达式首选项

source: Apply file header preferences
cs: Použít předvolby hlaviček souborů
de: Dateiheadereinstellungen anwenden
es: Aplicar preferencias de encabezado de archivo
it: Applica le preferenze relative alle intestazioni di file
ja: ファイル ヘッダーの基本設定を適用する
ko: 파일 헤더 기본 설정 적용
pl: Zastosuj preferencje nagłówka pliku
pt_br: Aplicar as preferências de cabeçalho de arquivo
ru: Применить параметры заголовка файла
tr: Dosya üst bilgisi tercihlerini uygula
zh_hans: 应用文件头首选项

source: Apply inferred anonymous type member names preferences
cs: Použít odvozené předvolby pro názvy členů anonymního typu
de: Anwenden abgeleiteter Einstellungen für Membernamen des anonymen Typs
es: Aplicar preferencias de nombres de miembros de tipo anónimo inferidos
it: Applica preferenze dei nomi dei membri di tipo anonimo dedotti
ja: 推定された匿名型のメンバー名の基本設定を適用する
ko: 유추된 무명 형식 멤버 이름 적용 기본 설정
pl: Zastosuj preferencje dotyczące nazw członków typu anonimowego
pt_br: Aplicar preferências de nomes de membro do tipo anônimo inferido
ru: Применить настройки для выводимых имен членов анонимного типа
tr: Gösterilen anonim tip üye adlarını tercihlerini uygula
zh_hans: 应用推断匿名类型成员名称首选项

source: Apply language/framework type preferences
cs: Použít předvolby typu jazyka/architektury
de: Einstellungen zum Sprach-/Frameworktyp anwenden
es: Aplicar preferencias de tipo de lenguaje o marco
it: Applica le preferenze relative al tipo di linguaggio/framework
ja: 言語/フレームワークの型の基本設定を適用します
ko: 언어/프레임워크 형식 기본 설정 적용
pl: Zastosuj preferencje typu języka/platformy
pt_br: Aplicar as preferências de linguagem/tipo de estrutura
ru: Применять предпочтения для типа языка или платформы
tr: Dil/çerçeve türü tercihlerini uygula
zh_hans: 应用语言/框架类型首选项

source: Apply namespace matches folder preferences
cs: Použít předvolby pro složky se shodami oboru názvů
de: Anwenden von Namespace-Übereinstimmungen mit Ordnereinstellungen
es: Aplicar preferencias de la carpeta de coincidencias de espacios de nombres
it: Applica preferenze cartella delle corrispondenze dello spazio dei nomi
ja: 名前空間に一致するフォルダーの基本設定を適用する
ko: 네임스페이스와 폴더 일치 적용 기본 설정
pl: Zastosuj przestrzeń nazw zgodną z preferencjami folderów
pt_br: Aplicar namespace corresponde às preferências de pasta
ru: Применить настройки для пространства имен, соответствующего папке
tr: Ad alanını klasör tercihleri ile eşleştiğinde uygula
zh_hans: 应用命名空间匹配文件夹首选项

source: Apply null checking preferences
cs: Použít předvolby kontroly hodnoty null
de: Voreinstellungen für NULL-Überprüfung anwenden
es: Aplicar preferencias de comprobación NULL
it: Applica preferenze di controllo Null
ja: null チェックの基本設定を適用する
ko: Null 검사 적용 기본 설정
pl: Preferencje sprawdzania wartości null
pt_br: Aplicar preferências de verificação nula
ru: Применить настройки проверки \"null\"
tr: Null denetimi tercihlerini uygula
zh_hans: 应用 Null 检查首选项

source: Apply null propagation preferences
cs: Použít předvolby šíření hodnoty null
de: Nullverteilungsvoreinstellungen anwenden
es: Aplicar preferencias de propagación NULL
it: Applica preferenze di propagazione Null
ja: null 値の反映の基本設定を適用する
ko: Null 전파 적용 기본 설정
pl: Zastosuj preferencje propagacji wartości null
pt_br: Aplicar preferências de propagação nula
ru: Применить настройки для распространения значений NULL
tr: Null yayma tercihlerini uygula
zh_hans: 应用 null 传播首选项

source: Apply object/collection initialization preferences
cs: Použít předvolby inicializace objektu/kolekce
de: Einstellungen zur Objekt-/Sammlungsinitialisierung anwenden
es: Aplicar preferencias de inicialización de objetos o colecciones
it: Applica le preferenze di inizializzazione di oggetti/raccolte
ja: オブジェクト/コレクションの初期化の基本設定を適用します
ko: 개체/컬렉션 초기화 기본 설정 적용
pl: Zastosuj preferencje inicjowania obiektu/kolekcji
pt_br: Aplicar as preferências de inicialização de objeto/coleção
ru: Применять предпочтения для инициализации объекта или коллекции
tr: Nesne/koleksiyon başlatma tercihlerini uygula
zh_hans: 应用对象/集合初始化首选项

source: Apply object initializer preferences
cs: Použít předvolby inicializátoru objektů
de: Voreinstellungen für Objektinitialisierer anwenden
es: Aplicar preferencias del inicializador de objeto
it: Applica le preferenze dell'inizializzatore di oggetto
ja: オブジェクト初期化子の基本設定を適用する
ko: 개체 이니셜라이저 적용 기본 설정
pl: Zastosuj preferencje inicjatora obiektu
pt_br: Aplicar preferências de inicializador de objeto
ru: Применить настройки для инициализатора объектов
tr: Nesne başlatıcı tercihlerini uygula
zh_hans: 应用对象初始值设定项首选项

source: Apply parentheses preferences
cs: Použít předvolby závorek
de: Voreinstellungen für Klammern anwenden
es: Aplicar preferencias de paréntesis
it: Applica preferenze delle parentesi
ja: かっこの基本設定を適用する
ko: 괄호 적용 기본 설정
pl: Zastosuj preferencje nawiasów
pt_br: Aplicar preferências de parênteses
ru: Применить настройки для круглых скобок
tr: Parantez tercihlerini uygula
zh_hans: 应用括号首选项

source: Apply simplify boolean expression preferences
cs: Použít zjednodušené předvolby logických výrazů
de: Voreinstellungen für vereinfachende boolesche Ausdrücke anwenden
es: Aplicar preferencias de la expresión booleana simplificada
it: Applica preferenze delle espressioni booleane semplificate
ja: ブール式の簡略化に関する基本設定を適用する
ko: 부울 식 간소화 적용 기본 설정
pl: Zastosuj upraszczanie preferencji wyrażeń logicznych
pt_br: Aplicar simplificar preferências de expressão booliana
ru: Применить настройки для упрощения логических выражений
tr: Boole ifade tercihlerini basitleştirmeyi uygula
zh_hans: 应用简化布尔表达式首选项

source: Apply statement after block preferences (experimental)
cs: Použít příkaz po předvolbách blokování (experimentální)
de: Anweisung nach Blockvoreinstellungen anwenden (experimentell)
es: Aplicar la instrucción después de las preferencias de bloque (experimental)
it: Applica preferenze istruzione dopo blocco (sperimentale)
ja: ブロック後のステートメンの基本設定を適用する (試験段階)
ko: 블록 뒤에 문 적용 기본 설정(실험적)
pl: Zastosuj instrukcję po preferencjach blokowania (eksperymentalne)
pt_br: Aplicar instrução após preferências de bloco (experimental)
ru: Применить настройки для инструкции после блока (экспериментальная функция)
tr: Blok tercihleri sonrasında deyimi uygula (deneysel)
zh_hans: 在块首选项后应用语句(实验性)
