Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# _10000000ths_of_a_second_non_zero_description
source: The "FFFFFFF" custom format specifier represents the seven most significant digits of the seconds fraction; that is, it represents the ten millionths of a second in a date and time value. However, trailing zeros or seven zero digits aren't displayed. Although it's possible to display the ten millionths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu FFFFFFF představuje sedm platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje desetimiliontiny sekundy. Nezobrazují se ale nuly na konci ani sedm nulových číslic. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "FFFFFFF" repräsentiert die sieben signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Zehnmillionstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder sieben Nullstellen werden jedoch nicht angezeigt. Obwohl die Zehnmillionstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "FFFFFFF" representa los siete dígitos más significativos de la fracción de segundos, es decir, las diez millonésimas de segundo de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de siete ceros. Aunque es posible mostrar las diez millonésimas de un componente de segundos de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "FFFFFFF" représente les sept chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les dix millionièmes de seconde d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les sept chiffres correspondant à des zéros ne sont pas affichés. Bien qu'il soit possible d'afficher les dix millionièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "FFFFFFF" rappresenta le sette cifre più significative della frazione di secondi, ovvero i decimilionesimi di secondo in un valore di data e ora. Gli zeri finali o le cifre con sette zeri non vengono tuttavia visualizzati. Anche se è possibile visualizzare i decimilionesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "FFFFFFF" カスタム書式指定子は、秒の小数部分の有効数字上位 7 桁を表します。つまり、日時の値のうち、秒の小数部分を 10,000,000 分の 1 秒単位で表します。ただし、末尾の 0 や、7 桁連続の 0 は表示されません。 時刻値の 10,000,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "FFFFFFF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 7개를 나타냅니다. 즉, 날짜 및 시간 값에서 10,000,000분의 1초를 나타냅니다. 그러나 후행 0 또는 7개의 0은 표시되지 않습니다. 시간 값의 초 부분의 10,000,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „FFFFFFF” reprezentuje siedem najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje dziesięciomilionową część sekundy w wartości daty i godziny. Zera końcowe ani liczby z siedmioma zerami nie są jednak wyświetlane. Co prawda możliwe jest wyświetlenie składnika dziesięciomilionowej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "FFFFFFF" representa os sete dígitos mais significativos da fração de segundos. Ou seja, representa os dez milionésimos de segundo em um valor de data e hora. No entanto, zeros à direita ou sete dígitos de zero não são exibidos. Embora seja possível exibir os dez milionésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "FFFFFFF" представляет семь наиболее значащих цифр дробной части секунды; то есть он представляет десятимиллионные доли секунды в значении даты и времени. При этом конечные нули или семь нулевых разрядов не отображаются. Хотя десятимиллионные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "FFFFFFF" özel biçim belirticisi, saniye kesirinin en anlamlı yedi basamağını; yani bir tarih ve saat değerinde saniyenin on milyonda birini temsil eder. Ancak, sondaki sıfırlar veya yedi sıfır rakamı görüntülenmez. Bir saat değerinin saniyenin on milyonda birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "FFFFFFF" 自定义格式说明符表示秒部分的七个最高有效位；即在日期和时间值中表示千万分之一秒数。但不显示尾随零或七个零位。 虽然时间值的秒部分可以显示到千万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "FFFFFFF" 自訂格式規範代表秒小數部分的最大有效位數為七; 換句話說，其代表日期與時間值中的千萬分之一秒。但尾端為零或七個數字皆為零時，不會顯示零。 雖然時間值的千萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 1,000,000ths of a second
cs: Miliontiny sekundy
de: 1.000.000stel einer Sekunde
es: 1 millonésima parte de un segundo
fr: 1 000 000es de seconde
it: Milionesimi di secondo
ja: 1,000,000 分の 1 秒単位
ko: 1,000,000분의 1초
pl: 1/1 000 000 sekundy
pt_br: Milionésimos de um segundo
ru: 1 000 000-е доли секунды
tr: Saniyenin 1.000.000'da biri
zh_hans: 百万分之一秒
zh_hant: 1/1,000,000 秒

# _1000000ths_of_a_second_description
source: The "ffffff" custom format specifier represents the six most significant digits of the seconds fraction; that is, it represents the millionths of a second in a date and time value. Although it's possible to display the millionths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu ffffff představuje šest platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje miliontiny sekundy. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "ffffff" repräsentiert die sechs signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Millionstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Obwohl die Millionstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "ffffff" representa los seis dígitos más significativos de la fracción de segundos, es decir, las millonésimas de segundo de un valor de fecha y hora. Aunque es posible mostrar las millonésimas de un componente de segundos de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "ffffff" représente les six chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les millionièmes de seconde d'une valeur de date et d'heure. Bien qu'il soit possible d'afficher les millionièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "ffffff" rappresenta le sei cifre più significative della frazione di secondi, ovvero i milionesimi di secondo in un valore di data e ora. Anche se è possibile visualizzare i milionesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "ffffff" カスタム書式指定子は、秒の小数部分の有効数字上位 6 桁を表します。つまり、日時の値のうち、秒の小数部分を 1,000,000 分の 1 秒単位で表します。 時刻値の 1,000,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "ffffff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 6개를 나타냅니다. 즉, 날짜 및 시간 값에서 1,000,000분의 1초를 나타냅니다. 시간 값의 초 부분의 1,000,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „ffffff” reprezentuje sześć najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje milionową część sekundy w wartości daty i godziny. Co prawda możliwe jest wyświetlenie składnika milionowej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "FFFFFF" representa os seis dígitos mais significativos da fração de segundos. Ou seja, ele representa os milionésimos de segundo em um valor de data e hora. Embora seja possível exibir os milionésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "ffffff" представляет шесть наиболее значащих цифр дробной части секунды; то есть он представляет миллионные доли секунды в значении даты и времени. Хотя миллионные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "ffffff" özel biçim belirticisi, saniye kesirinin en anlamlı altı basamağını; yani bir tarih ve saat değerinde saniyenin milyonda birini temsil eder. Bir saat değerinin saniyenin milyonda birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "ffffff" 自定义格式说明符表示秒部分的六个最高有效位；即在日期和时间值中表示百万分之一秒数。 虽然时间值的秒部分可以显示到百万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "ffffff" 自訂格式規範代表秒小數部分的最大有效位數為六; 換句話說，其代表日期與時間值中的百萬分之一秒。 雖然時間值的百萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 1,000,000ths of a second (non-zero)
cs: Miliontiny sekundy (nenulové)
de: 1.000.000stel einer Sekunde (ungleich 0)
es: 1 millonésima parte de un segundo (no cero)
fr: 1 000 000es de seconde (non nul)
it: Milionesimi di secondo (diversi da zero)
ja: 1,000,000 分の 1 秒単位 (0 以外)
ko: 1,000,000분의 1초(0이 아님)
pl: 1/1 000 000 sekundy (wartrość inna niż zero)
pt_br: Milionésimos de um segundo (diferente de zero)
ru: 1 000 000-е доли секунды (не нуль)
tr: Saniyenin 1.000.000'da biri (sıfır olmayan)
zh_hans: 百万分之一秒(非零)
zh_hant: 1/1,000,000 秒 (非零)

# _1000000ths_of_a_second_non_zero_description
source: The "FFFFFF" custom format specifier represents the six most significant digits of the seconds fraction; that is, it represents the millionths of a second in a date and time value. However, trailing zeros or six zero digits aren't displayed. Although it's possible to display the millionths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu FFFFFF představuje šest platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje miliontiny sekundy. Nezobrazují se ale nuly na konci ani šest nulových číslic. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "FFFFFF" repräsentiert die sechs signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Millionstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder sechs Nullstellen werden jedoch nicht angezeigt. Obwohl die Millionstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "FFFFFF" representa los seis dígitos más significativos de la fracción de segundos, es decir, las millonésimas de segundo de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de seis ceros. Aunque es posible mostrar las millonésimas de un componente de segundos de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "FFFFFF" représente les six chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les millionièmes de seconde d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les six chiffres correspondant à des zéros ne sont pas affichés. Bien qu'il soit possible d'afficher les millionièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "FFFFFF" rappresenta le sei cifre più significative della frazione di secondi, ovvero i milionesimi di secondo in un valore di data e ora. Gli zeri finali o le cifre con sei zeri non vengono tuttavia visualizzati. Anche se è possibile visualizzare i milionesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "FFFFFF" カスタム書式指定子は、秒の小数部分の有効数字上位 6 桁を表します。つまり、日時の値のうち、秒の小数部分を 1,000,000 分の 1 秒単位で表します。ただし、末尾の 0 や、6 桁連続の 0 は表示されません。 時刻値の 1,000,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "FFFFFF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 6개를 나타냅니다. 즉, 날짜 및 시간 값에서 1,000,000분의 1초를 나타냅니다. 그러나 후행 0 또는 6개의 0은 표시되지 않습니다. 시간 값의 초 부분의 1,000,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „FFFFFF” reprezentuje sześć najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje milionową część sekundy w wartości daty i godziny. Zera końcowe ani liczby z sześcioma zerami nie są jednak wyświetlane. Co prawda możliwe jest wyświetlenie składnika milionowej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "FFFFFF" representa os seis dígitos mais significativos da fração de segundos. Ou seja, ele representa os milionésimos de segundo em um valor de data e hora. No entanto, zeros à direita ou seis dígitos de zero não são exibidos. Embora seja possível exibir os milionésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "FFFFFF" представляет шесть наиболее значащих цифр дробной части секунды; то есть он представляет миллионные доли секунды в значении даты и времени. При этом конечные нули или шесть нулевых разрядов не отображаются. Хотя миллионные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "FFFFFF" özel biçim belirticisi, saniye kesirinin en anlamlı altı basamağını; yani bir tarih ve saat değerinde saniyenin milyonda birini temsil eder. Ancak, sondaki sıfırlar veya altı sıfır rakamı görüntülenmez. Bir saat değerinin saniyenin milyonda birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "FFFFFF" 自定义格式说明符表示秒部分的六个最高有效位；即在日期和时间值中表示百万分之一秒数。但不显示尾随零或六个零位。 虽然时间值的秒部分可以显示到百万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "FFFFFF" 自訂格式規範代表秒小數部分的最大有效位數為六; 換句話說，其代表日期與時間值中的百萬分之一秒。但尾端為零或六個數字皆為零時，不會顯示零。 雖然時間值的百萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 100,000ths of a second
cs: Stotisíciny sekundy
de: 100.000stel einer Sekunde
es: 1 cienmilésima parte de un segundo
fr: 100 000es de seconde
it: Centomillesimi di secondo
ja: 100,000 分の 1 秒単位
ko: 100,000분의 1초
pl: 1/100 000 sekundy
pt_br: Cem milésimos de um segundo
ru: 100 000-е доли секунды
tr: Saniyenin 100.000'de biri
zh_hans: 十万分之一秒
zh_hant: 1/100,000 秒
