Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Renaming a captured variable, from '{0}' to '{1}' requires restarting the application.
cs: Změna názvu zachycené proměnné z {0} na {1} vyžaduje restartování aplikace.
de: Das Umbenennen einer erfassten Variablen von „{0}“ in „{1}“ erfordert einen Neustart der Anwendung.
es: Para cambiar el nombre de una variable capturada, de "{0}" a "{1}" es necesario reiniciar la aplicación.
it: Se si rinomina una variabile catturata da '{0}' a '{1}', è necessario riavviare l'applicazione.
ja: キャプチャした変数の名前を '{0}' から '{1}' に変更するには、アプリケーションを再起動する必要があります。
ko: 캡처된 변수의 이름을 '{0}'에서 '{1}'(으)로 바꾸려면 응용 프로그램을 다시 시작해야 합니다.
pl: Zmienianie nazwy przechwyconej zmiennej z "{0}" na "{1}" wymaga ponownego uruchomienia aplikacji.
pt_br: Renomear uma variável capturada de '{0}' para '{1}' requer a reinicialização do aplicativo.
ru: Для переименования зафиксированной переменной из "{0}" в "{1}" требуется перезапустить приложение.
tr: Yakalanan bir değişkenin '{0}' iken '{1}' olarak yeniden adlandırılması, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 将捕获的变量从“{0}”重命名为“{1}”需要重新启动应用程序。

source: Renaming anonymous type members is not yet supported.
de: Das Umbenennen von Elementen des Typs anonym wird noch nicht unterstützt.
it: La ridenominazione di membri con tipo anonimo non è ancora supportata.
ja: 匿名型メンバーの名前の変更は、まだサポートされていません。
tr: Anonim türdeki üyeleri yeniden adlandırma henüz desteklenmiyor.
zh_hans: 尚不支持重命名匿名类型成员。

source: Replace '{0}' with '{1}'
cs: Místo {0} použijte {1}
de: "{0}" durch "{1}" ersetzen
es: Reemplazar "{0}" por "{1}"
fr: Remplacer '{0}' par '{1}'
it: Sostituisci '{0}' con '{1}'
ja: '{0}' を '{1}' に置き換える
ko: '{0}'을(를) '{1}'(으)로 바꾸기
pl: Zamień element „{0}” na element „{1}”
pt_br: Substituir '{0}' por '{1}'
ru: Замените '{0}' на '{1}'
tr: '{0}' öğesini '{1}' ile değiştir
zh_hans: 将 "{0}" 替换为 "{1}"
zh_hant: 將 ‘{0}’ 取代為 ‘{1}'

source: Replace conditional expression with statements
cs: Nahradit podmíněný výraz pomocí příkazů
de: Bedingter Ausdruck durch Anweisungen ersetzen
es: Reemplazar expresión condicional con instrucciones
it: Sostituisci espressione condizionale con istruzioni
ja: 条件式をステートメントに置き換える
ko: 조건식을 명령문으로 바꾸기
pl: Zamień wyrażenie warunkowe na instrukcje
pt_br: Substituir expressão condicional por instruções
ru: Заменить условное выражение операторами
tr: Koşullu ifadeyi deyimlerle değiştirin
zh_hans: 将条件表达式替换为语句

source: required
cs: povinné
de: erforderlich
es: obligatorio
it: obbligatorio
ja: 必須
ko: 필수 사항
pl: wymagane
pt_br: obrigatório
ru: требуется
tr: gerekli
zh_hans: 必需

source: Resolve: '{0}'
cs: Přeložit: {0}
de: Auflösen: {0}
es: Resolver: "{0}"
it: Risolvi: '{0}'
ja: 解決: "{0}"
ko: 확인: '{0}'
pl: Rozpoznaj: „{0}”
pt_br: Resolver: '{0}'
ru: Разрешить: "{0}"
tr: Çözümle: '{0}'
zh_hans: 解析: "{0}"

source: Resolve module: '{0}' of '{1}'
cs: Přeložit modul: {0} z {1}
de: Modul auflösen: {0} von {1}
es: Resolver el módulo: "{0}" de "{1}"
it: Risolvi il modulo: '{0}' di '{1}'
ja: モジュールの解決: '{1}' の '{0}'
ko: 모듈 확인: '{0}'/'{1}'
pl: Rozpoznaj moduł: „{0}” z „{1}”
pt_br: Resolver o módulo: '{0}' de '{1}'
ru: Разрешить модуль: "{0}" из "{1}"
tr: '{1}' modül içinden '{0}' modülü çözümle
zh_hans: 解析模块: "{0}" 个(共 "{1}" 个)

source: Rude edit
cs: Hrubá úprava
de: Grobe Bearbeitung
es: Edición superficial
fr: Modification non applicable
it: Modifica non applicabile
ja: Rude 編集
ko: 편집 다시 실행
pl: Edycja reguły
pt_br: Edição rudimentar
ru: Грубая редакция
tr: İşlenmemiş düzenleme
zh_hans: 原始编辑
zh_hant: 粗略編輯

source: Run All Tests
cs: Spustit všechny testy
es: Ejecutar todas las pruebas
ko: 모든 테스트 실행
pl: Uruchom wszystkie testy
pt_br: Executar Todos os Testes
ru: Запустить все тесты
tr: Tüm Testleri Çalıştır
zh_hans: 运行所有测试

source: Run Test
cs: Spustit test
es: Ejecutar prueba
ko: 테스트 실행
pl: Wykonaj test
pt_br: Executar o teste
ru: Запуск теста
tr: Testi Çalıştır
zh_hans: 运行测试

source: Selection does not contain a valid token.
cs: Výběr neobsahuje platný token.
de: Auswahl enthält kein gültiges Token.
es: La selección no contiene un token válido
it: La selezione non contiene un token valido.
ja: 選択には有効なトークンは含まれません。
ko: 선택 항목에 유효한 토큰이 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera prawidłowego tokenu.
pt_br: A seleção não contém um token válido.
ru: Выделение не содержит допустимый токен.
tr: Seçim, geçerli bir belirteç içermiyor.
zh_hans: 所选内容不包含有效令牌。

source: Selection not contained inside a type.
cs: Výběr není obsažený v typu.
de: Die Auswahl ist nicht in keinem Typ enthalten.
es: La selección no está contenida dentro de un tipo.
it: La selezione non è contenuta all'interno di un tipo.
ja: 選択が型の内部に含まれていません。
ko: 선택 항목이 형식 내에 포함되어 있지 않습니다.
pl: Zaznaczenie nie jest uwzględnione w typie.
pt_br: Seleção não contida dentro de um tipo.
ru: Выделенный фрагмент не входит в тип.
tr: Seçim bir türün içinde yer almıyor.
zh_hans: 所选内容不包含在类型内。

source: Silent
cs: Tichý
de: Still
es: Silencioso
it: Invisibile
ja: サイレント
ko: 침묵
pl: Cichy
pt_br: Silencioso
ru: Тихий
tr: Sessiz
zh_hans: 无提示

source: Sort Imports or usings
cs: Seřadit importy nebo použití
de: Importe oder Verwendungen sortieren
es: Ordenar importaciones o usos
it: Ordinare importazioni o usi
ja: Import または using の並べ替え
ko: Import 또는 Using 정렬
pl: Sortuj importy lub użycia
pt_br: Classificar Importações ou usos
ru: Сортировать операторы Imports или директивы using
tr: İçeri Aktarmaları veya using'leri sırala
zh_hans: 对导入或 using 排序

source: Sort accessibility modifiers
cs: Seřadit modifikátory dostupnosti
de: Zugriffsmodifizierer sortieren
es: Ordenar modificadores de accesibilidad
it: Ordina i modificatori di accessibilità
ja: アクセシビリティ修飾子を並べ替える
ko: 접근성 한정자 정렬
pl: Sortuj modyfikatory dostępności
pt_br: Classificar modificadores de acessibilidade
ru: Сортировать модификаторы доступности
tr: Erişilebilirlik değiştiricilerini sırala
zh_hans: 对可访问性修饰符排序

source: Source code language information was not found in PDB.
cs: Informace o jazyku zdrojového kódu nebyly v souboru PDB nalezeny.
de: Die Informationen zur Quellcodesprache wurden in der PDB-Datei nicht gefunden.
es: No se encontró la información del lenguaje de código fuente en PDB.
it: Le informazioni sul linguaggio del codice sorgente non sono state trovate nel PDB.
ja: PDB にソース コードのプログラミング言語情報が見つかりませんでした。
ko: PDB에서 원본 코드 언어 정보를 찾을 수 없습니다.
pl: Nie znaleziono informacji o języku kodu źródłowego w pliku PDB.
pt_br: As informações de idioma do código-fonte não foram encontradas no PDB.
ru: Сведения о языке исходного кода не найдены в PDB-файле.
tr: Kaynak kodu dil bilgisi PDB'de bulunamadı.
zh_hans: 在 PDB 中找不到源代码语言信息。

# Source_is_a_reference_assembly
source: Source is a reference assembly, not enough information to find PDB.
cs: Zdroj je referenční sestavení, nedostatek informací pro vyhledání souboru PDB.
de: Die Quelle ist eine Referenzassembly. Es sind nicht genügend Informationen vorhanden, um die PDB-Datei zu finden.
es: El origen es un ensamblado de referencia, no hay suficiente información para encontrar el archivo PDB.
it: L'origine è un assembly di riferimento, informazioni insufficienti per trovare il PDB.
ja: ソースは参照アセンブリであり、PDB を見つけるのに十分な情報がありません。
ko: 원본은 참조 어셈블리이며 PDB를 찾을 수 있는 정보가 부족합니다.
pl: Źródło jest zestawem odwołania, brak wystarczających informacji do znalezienia pliku PDB.
pt_br: A origem é um assembly de referência, não há informações suficientes para localizar o PDB.
ru: Источник является базовой сборкой. Недостаточно сведений для поиска PDB-файла.
tr: Kaynak bir başvuru bütünleştirilmiş kodudur, PDB'yi bulmak için yeterli bilgi yoktur.
zh_hans: 源是引用程序集，信息不足，无法查找 PDB。

source: Split into consecutive '{0}' statements
cs: Rozdělit do následných příkazů {0}
de: In aufeinanderfolgende {0}-Anweisungen teilen
es: Dividir en instrucciones "{0}" consecutivas
fr: Diviser en instructions '{0}' consécutives
it: Dividi in istruzioni '{0}' consecutive
ja: 連続する '{0}' ステートメントに分割
ko: 연속 '{0}' 문으로 분할
pl: Podziel na kolejne instrukcje „{0}”
pt_br: Dividir em instruções '{0}' consecutivas
ru: Разделить на последовательные операторы "{0}"
tr: Ardışık '{0}' deyimlerine ayır
zh_hans: 拆分为连续的 "{0}" 语句
zh_hant: 分割成連續的 '{0}' 陳述式

source: Split into nested '{0}' statements
cs: Rozdělit do vnořených příkazů {0}
de: In geschachtelte {0}-Anweisungen teilen
es: Dividir en instrucciones "{0}" anidadas
fr: Diviser en instructions '{0}' imbriquées
it: Dividi in istruzioni '{0}' nidificate
ja: 入れ子になった '{0}' ステートメントに分割
ko: 중첩 '{0}' 문으로 분할
pl: Podziel na zagnieżdżone instrukcje „{0}”
pt_br: Dividir em instruções '{0}' aninhadas
ru: Разделить на вложенные операторы "{0}"
tr: İç içe '{0}' deyimlerine ayır
zh_hans: 拆分为嵌套的 "{0}" 语句
zh_hant: 分割成巢狀 '{0}' 陳述式

# StreamMustSupportReadAndSeek
source: Stream must support read and seek operations.
de: Stream muss Lese- und Suchvorgänge unterstützen.
fr: Le flux doit prendre en charge les opérations de lecture et de recherche.
it: Il flusso deve supportare operazioni di lettura e ricerca.
ja: ストリームは、読み取りとシーク操作をサポートする必要があります。
tr: Akış okuma ve arama işlemlerini desteklemelidir.
zh_hans: 流必须支持读取和搜寻操作。
zh_hant: 資料流必須支援讀取及搜尋作業。

# Strings_must_start_with_double_quote_not_single_quote
source: Strings must start with " not '
cs: Řetězce musí začínat ", ne '
de: Zeichenfolgen müssen mit " nicht ' beginnen
es: Las cadenas deben empezar por " not '
it: Le stringhe devono iniziare con " not '
ja: 文字列は "not' で始まる必要があります
ko: 문자열은 " not '으로 시작해야 합니다.
pl: Ciągi muszą zaczynać się od znaku „not”
pt_br: As cadeias de caracteres devem começar com " não '
ru: Строки должны начинаться с " не '
tr: Dizeler " değil ' ile başlamalıdır
zh_hans: 字符串必须以 \" not \" 开头

source: Suppress {0}
cs: Potlačit {0}
de: {0} unterdrücken
es: Suprimir {0}
fr: Supprimer {0}
it: Elimina {0}
ja: {0} の非表示
ko: {0}을(를) 표시하지 않음
pl: Pomiń element {0}
pt_br: Suprimir {0}
ru: Скрыть {0}
tr: {0} eylemini bastır
zh_hans: 抑制 {0}
zh_hant: 隱藏 {0}

# Switching_between_lambda_and_local_function_requires_restarting_the_application
source: Switching between a lambda and a local function requires restarting the application.
cs: Přepnutí mezi funkcí lambda a místní funkcí vyžaduje restartování aplikace.
de: Der Wechsel zwischen einer Lambda- und einer lokalen Funktion erfordert einen Neustart der Anwendung.
es: Para cambiar entre una expresión lambda y una función local, es necesario reiniciar la aplicación.
it: Se si passa da un'espressione lambda a una funzione locale, è necessario riavviare l'applicazione.
ja: ラムダとローカル関数を切り替えるには、アプリケーションを再起動する必要があります。
ko: 람다 함수와 로컬 함수 간에 전환하려면 애플리케이션을 다시 시작해야 합니다.
pl: Przełączenie między wyrażeniem lambda a funkcją lokalną wymaga ponownego uruchomienia aplikacji.
pt_br: Alternar entre um lambda e uma função local requer a reinicialização do aplicativo.
ru: Для переключения между лямбда-выражением и локальной функцией требуется перезапустить приложение.
tr: Bir lambda ve yerel bir işlev arasında geçiş yapılması, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 在 lambda 和本地函数之间切换需要重启应用程序。

source: Symbol found in assembly path '{0}'
cs: V cestě sestavení {0} byl nalezen symbol.
de: Das Symbol wurde unter dem Assemblypfad „{0}“ gefunden
es: Símbolo encontrado en la ruta de acceso del ensamblado '{0}'
it: Simbolo trovato nel percorso assembly '{0}'
ja: アセンブリ パス '{0}' にシンボルが見つかりました
ko: 어셈블리 경로 '{0}'에서 기호를 찾음
pl: Znaleziono symbol w ścieżce zestawu „{0}”
pt_br: Símbolo encontrado no caminho de montagem '{0}'
ru: Найден символ в пути сборки "{0}"
tr: “{0}” derleme yolunda sembol bulundu
zh_hans: 在程序集路径 "{0}" 中找到符号

source: Syntax error
cs: Chyba syntaxe
de: Syntaxfehler
es: Error de sintaxis
it: Errore di sintassi
ja: 構文エラー
ko: 구문 오류
pl: Błąd składniowy
pt_br: Erro de sintaxe
ru: Синтаксическая ошибка
tr: Söz dizimi hatası
zh_hans: 语法错误

# TODO_colon_free_unmanaged_resources_unmanaged_objects_and_override_finalizer
source: TODO: free unmanaged resources (unmanaged objects) and override finalizer
de: TODO: Nicht verwaltete Ressourcen (nicht verwaltete Objekte) freigeben und Finalizer überschreiben
fr: TODO: libérer les ressources non managées (objets non managés) et substituer le finaliseur
it: TODO: liberare risorse non gestite (oggetti non gestiti) ed eseguire l'override del finalizzatore
ja: TODO: アンマネージド リソース (アンマネージド オブジェクト) を解放し、ファイナライザーをオーバーライドします
zh_hans: TODO: 释放未托管的资源(未托管的对象)并重写终结器
zh_hant: TODO: 釋出非受控資源 (非受控物件) 並覆寫完成項

# TODO_colon_override_finalizer_only_if_0_has_code_to_free_unmanaged_resources
source: TODO: override finalizer only if '{0}' has code to free unmanaged resources
de: TODO: Finalizer nur überschreiben, wenn "{0}" Code für die Freigabe nicht verwalteter Ressourcen enthält
fr: TODO: substituer le finaliseur uniquement si '{0}' a du code pour libérer les ressources non managées
it: TODO: eseguire l'override del finalizzatore solo se '{0}' contiene codice per liberare risorse non gestite
ja: TODO: '{0}' にアンマネージド リソースを解放するコードが含まれる場合にのみ、ファイナライザーをオーバーライドします
zh_hans: TODO: 仅当“{0}”拥有用于释放未托管资源的代码时才替代终结器
zh_hant: TODO: 僅有當 '{0}' 具有會釋出非受控資源的程式碼時，才覆寫完成項

source: Target type matches
cs: Shody cílového typu
de: Übereinstimmungen mit Zieltyp
es: El tipo de destino coincide con
fr: Cibler les correspondances de types
it: Imposta destinazione per corrispondenze di tipo
ja: ターゲットの種類が一致します
ko: 대상 유형 일치
pl: Dopasowania typu docelowego
pt_br: Correspondências de tipos de destino
ru: Соответствия целевого типа
tr: Hedef tür eşleşmeleri
zh_hans: 目标类型匹配
zh_hant: 目標類型相符項目

# The_assembly_0_containing_type_1_references_NET_Framework
source: The assembly '{0}' containing type '{1}' references .NET Framework, which is not supported.
cs: Sestavení {0}, které obsahuje typ {1}, se odkazuje na architekturu .NET Framework, což se nepodporuje.
de: Die Assembly "{0}" mit dem Typ "{1}" verweist auf das .NET Framework. Dies wird nicht unterstützt.
es: El ensamblado "{0}" que contiene el tipo "{1}" hace referencia a .NET Framework, lo cual no se admite.
fr: L'assembly '{0}' contenant le type '{1}' référence le .NET Framework, ce qui n'est pas pris en charge.
it: L'assembly '{0}' che contiene il tipo '{1}' fa riferimento a .NET Framework, che non è supportato.
ja: 型 '{1}' を含むアセンブリ '{0}' が .NET Framework を参照しています。これはサポートされていません。
ko: '{1}' 형식을 포함하는 '{0}' 어셈블리가 지원되지 않는 .NET Framework를 참조합니다.
pl: Zestaw „{0}” zawierający typ „{1}” odwołuje się do platformy .NET Framework, co nie jest obsługiwane.
pt_br: O assembly '{0}' contendo o tipo '{1}' referencia o .NET Framework, mas não há suporte para isso.
ru: Сборка "{0}", содержащая тип "{1}", ссылается на платформу .NET Framework, которая не поддерживается.
tr: '{1}' türünü içeren '{0}' bütünleştirilmiş kodu, desteklenmeyen .NET Framework'e başvuruyor.
zh_hans: 包含类型“{1}”的程序集“{0}”引用了 .NET Framework，而此操作不受支持。
zh_hant: 包含類型 '{1}' 的組件 '{0}' 參考了 .NET Framework，此情形不受支援。

# The_assembly_0_references_compiler_version_1_newer_than_2
source: The analyzer assembly '{0}' references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
de: Die Analyzerassembly „{0}“ verweist auf Version „{1}“ des Compilers, die neuer ist als die aktuell ausgeführte Version „{2}“.
it: L'assembly dell'analizzatore '{0}' fa riferimento alla versione '{1}' del compilatore, che è più recente della versione attualmente in esecuzione '{2}'.
ja: アナライザー アセンブリ '{0}' は、コンパイラのバージョン '{1}' を参照しています。これは、現在実行中のバージョン '{2}' よりも新しいバージョンです。
tr: '{0}' çözümleyici bütünleştirilmiş kodu, derleyicinin şu anda çalışan '{2}' sürümünden daha yeni olan '{1}' sürümüne başvurur.
zh_hans: 分析器程序集“{0}”引用了编译器的版本“{1}”，该版本高于当前正在运行的版本“{2}”。

source: The selection contains a local function call without its declaration.
cs: Výběr obsahuje volání lokální funkce, aniž by byla deklarovaná.
de: Die Auswahl enthält einen lokalen Funktionsaufruf ohne Deklaration.
es: La selección contiene una llamada a una función local sin la declaración correspondiente.
fr: La sélection contient un appel de fonction locale sans sa déclaration.
it: La selezione contiene una chiamata di funzione locale senza la relativa dichiarazione.
ja: 選択範囲に、宣言のないローカル関数呼び出しが含まれています。
ko: 선언이 없는 로컬 함수 호출이 선택 영역에 있습니다.
pl: Zaznaczenie zawiera wywołanie funkcji lokalnej bez jego deklaracji.
pt_br: A seleção contém uma chamada de função local sem sua declaração.
ru: Выделенный фрагмент содержит вызов локальной функции без ее объявления.
tr: Seçim, bildirimi olmadan bir yerel işlev çağrısı içeriyor.
zh_hans: 所选内容包含不带声明的本地函数调用。
zh_hant: 選取範圍包含區域函式呼叫，但不含其宣告。

source: The symbol has no base.
cs: Tento symbol nemá žádný základ.
de: Das Symbol verfügt über keine Basis.
es: El símbolo no tiene base.
it: Non è presente alcuna base per il simbolo.
ja: シンボルにベースがありません。
ko: 기호에 베이스가 없습니다.
pl: Symbol nie ma wartości podstawowej.
pt_br: O símbolo não tem nenhuma base.
ru: У этого символа нет основания.
tr: Sembolde taban yok.
zh_hans: 符号没有基数。

source: The symbol has no implementations.
cs: Tento symbol nemá žádné implementace.
de: Das Symbol verfügt über keine Implementierungen.
es: El símbolo no tiene implementaciones.
it: Non sono presenti implementazioni per il simbolo.
ja: シンボルに実装がありません。
ko: 기호에 구현이 없습니다.
pl: Symbol nie ma implementacji.
pt_br: O símbolo não tem implementações.
ru: Этот символ не имеет реализации.
tr: Sembolde hiç uygulama yok.
zh_hans: 符号没有实现。

source: This {0} has {1} reference(s).
cs: Položka {0} obsahuje tento počet odkazů: {1}.
de: {0} hat {1} Verweise.
es: El elemento {0} tiene las siguientes referencias: {1}.
it: {0} ha {1} riferimento/i.
ja: この {0} には {1} 個の参照があります。
ko: 이 {0}에는 {1}개의 참조가 있습니다.
pl: Liczba odwołań dla {0}: {1}.
pt_br: Este {0} tem {1} referência(s).
ru: Cсылок у {0}: {1}.
tr: Bu {0}, {1} Başvuru içeriyor.
zh_hans: 此 {0} 具有 {1} 个引用。

# Timeout_SourceLink
source: Timed out trying to download source code from SourceLink. Subsequent requests may succeed.
cs: Při pokusu o stažení zdrojového kódu ze zdrojového odkazu vypršel časový limit. Následné žádosti můžou být úspěšné.
de: Timeout beim Herunterladen von Quellcode aus SourceLink. Nachfolgende Anforderungen sind möglicherweise erfolgreich.
es: Se agotó el tiempo de espera al intentar descargar el código fuente de SourceLink. Es posible que las solicitudes siguientes se realicen correctamente.
it: Timeout durante il tentativo di scaricare il codice sorgente da SourceLink. Le richieste successive potrebbero avere esito positivo.
ja: SourceLink からソース コードをダウンロードしようとしてタイムアウトしました。後続の要求は成功する可能性があります。
ko: SourceLink에서 원본 코드를 다운로드하는 동안 시간이 초과되었습니다. 후속 요청이 성공할 수 있습니다.
pl: Przekroczono limit czasu podczas próby pobrania kodu źródłowego z elementu SourceLink. Kolejne żądania mogą zakończyć się pomyślnie.
pt_br: Tempo limite esgotado ao tentar baixar o código-fonte do SourceLink. As solicitações subsequentes podem ser bem-sucedidas.
ru: Истекло время ожидания при попытке скачать исходный код из SourceLink. Последующие запросы могут быть успешными.
tr: SourceLink'ten kaynak kodu indirmeye çalışırken zaman aşımına uğradı. Sonraki istekler başarılı olabilir.
zh_hans: 尝试从 SourceLink 下载源代码时超时。如果继续尝试进行请求，有可能会成功。

# Timeout_symbol_server
source: Timed out trying to download PDB from symbol server. Subsequent requests may succeed.
cs: Při pokusu o stažení souboru PDB ze serveru symbolů vypršel časový limit. Následné žádosti můžou být úspěšné.
de: Timeout beim Herunterladen der PDB-Datei vom Symbolserver. Nachfolgende Anforderungen sind möglicherweise erfolgreich.
es: Se agotó el tiempo de espera al intentar descargar el archivo PDB del servidor de símbolos. Es posible que las solicitudes siguientes se realicen correctamente.
it: Timeout durante il tentativo di scaricare PDB dal server dei simboli. Le richieste successive potrebbero avere esito positivo.
ja: シンボル サーバーから PDB をダウンロードしようとしてタイムアウトしました。後続の要求は成功する可能性があります。
ko: 기호 서버에서 PDB를 다운로드하는 동안 시간이 초과되었습니다. 후속 요청이 성공할 수 있습니다.
pl: Przekroczono limit czasu podczas próby pobrania pliku PDB z serwera symboli. Kolejne żądania mogą zakończyć się pomyślnie.
pt_br: Tempo limite esgotado ao tentar fazer download do PDB do servidor de símbolos. As solicitações subsequentes podem ser bem-sucedidas.
ru: Истекло время ожидания при попытке скачать PDB-файл с сервера символов. Последующие запросы могут быть успешными.
tr: PDB'yi sembol sunucusundan indirmeye çalışırken zaman aşımına uğradı. Sonraki istekler başarılı olabilir.
zh_hans: 尝试从符号服务器下载 PDB 时超时。如果继续尝试进行请求，有可能会成功。

# Too_many_bars_in_conditional_grouping
source: Too many | in (?()|)
cs: Příliš mnoho znaků | ve výrazu (?()|)
de: Zu viele |-Zeichen in (?()|).
es: Demasiados | en (?()|)
fr: Trop de | dans (?()|)
it: Troppi | in (?()|)
ja: (?()|) で | が多すぎます
ko: (?()|)에 |가 너무 많습니다.
pl: Zbyt wiele znaków | w wyrażeniu (?()|)
pt_br: Muitos | em (?()|)
ru: Слишком много операторов "|" в "(?()|)"
tr: Çok fazla | içinde (?) (|)
zh_hans: (?()|) 中的 | 太多
zh_hant: (?()|) 中太多 |

# Too_many_close_parens
source: Too many )'s
cs: Příliš mnoho znaků )
de: Zu viele )-Zeichen.
es: Demasiados )
fr: Trop de )'s
it: Troppe parentesi di chiusura
ja: ) が多すぎます
ko: )가 너무 많습니다.
pl: Zbyt wiele znaków )
pt_br: Muitos )'s
ru: Слишком много закрывающих круглых скобок
tr: Çok fazla)'s
zh_hans: ")" 太多
zh_hant: 太多 )

source: Trailing comma not allowed
cs: Čárka na konci není povolená
de: Ein nachgestelltes Komma ist unzulässig
es: Coma final no permitida
it: Virgola finale non consentita
ja: 末尾にコンマは使用できない
ko: 후행 쉼표는 허용되지 않습니다.
pl: Końcowy przecinek jest niedozwolony.
pt_br: Vírgula à direita não permitida
ru: Завершающая запятая не разрешена
tr: Sona eklenen virgüle izin verilmiyor
zh_hans: 不允许使用尾随逗号

# Types_colon
source: Types:
cs: Typy:
de: Typen:
es: Tipos:
it: Tipi:
ja: 型:
ko: 형식:
pl: Typy:
pt_br: Tipos:
ru: Типы:
tr: Türler:
zh_hans: 类型:
