Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# _10000ths_of_a_second_non_zero_description
source: The "FFFF" custom format specifier represents the four most significant digits of the seconds fraction; that is, it represents the ten thousandths of a second in a date and time value. However, trailing zeros or four zero digits aren't displayed. Although it's possible to display the ten thousandths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu FFFF představuje čtyři platné číslice zlomku sekundy. To znamená, že v hodnotě data a času představuje desetitisíciny sekundy. Nezobrazují se ale nuly na konci ani čtyři nulové číslice. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "FFFF" repräsentiert die vier signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Zehntausendstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder vier Nullstellen werden jedoch nicht angezeigt. Obwohl die Zehntausendstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "FFFF" representa los cuatro dígitos más significativos de la fracción de segundos, es decir, las diezmilésimas de segundo de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de cuatro ceros. Aunque es posible mostrar la diezmilésima parte de un segundo de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "FFFF" représente les quatre chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les dix millièmes de seconde d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les quatre chiffres correspondant à des zéros ne sont pas affichés. Bien qu'il soit possible d'afficher les dix millièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "FFFF" rappresenta le quattro cifre più significative della frazione di secondi, ovvero i decimillesimi di secondo in un valore di data e ora. Gli zeri finali o le cifre con quattro zeri non vengono tuttavia visualizzati. Anche se è possibile visualizzare i decimillesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "FFFF" カスタム書式指定子は、秒の小数部分の有効数字上位 4 桁を表します。つまり、日時の値のうち、秒の小数部分を 10,000 分の 1 秒単位で表します。ただし、末尾の 0 や、4 桁連続の 0 は表示されません。 時刻値の 10,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "FFFF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 4개를 나타냅니다. 즉, 날짜 및 시간 값에서 10,000분의 1초를 나타냅니다. 그러나 후행 0 또는 4개의 0은 표시되지 않습니다. 시간 값의 초 부분의 10,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제에서의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „FFFF” reprezentuje cztery najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje dziesięciotysięczną część sekundy w wartości daty i godziny. Zera końcowe ani liczby z czterema zerami nie są jednak wyświetlane. Co prawda możliwe jest wyświetlenie składnika dziesięciotysięcznej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "FFFF" representa os quatro dígitos mais significativos da fração de segundos. Ou seja, representa os dez milésimos de segundo em um valor de data e hora. No entanto, zeros à direita ou quatro dígitos de zero não são exibidos. Embora seja possível exibir os dez milésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "FFFF" представляет четыре наиболее значащих цифры дробной части секунды; то есть он представляет десятитысячные доли секунды в значении даты и времени. При этом конечные нули или четыре нулевых разряда не отображаются. Хотя десятитысячные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "FFFF" özel biçim belirticisi, saniye kesirinin en anlamlı dört basamağını; yani bir tarih ve saat değerinde saniyenin on binde birini temsil eder. Ancak, sondaki sıfırlar veya dört sıfır rakamı görüntülenmez. Bir saat değerinin saniyenin on binde birlik bileşenini görüntülemek mümkün olmakla birlikte, bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "FFFF" 自定义格式说明符表示秒部分的四个最高有效位；即在日期和时间值中表示万分之一秒数。但是，不显示尾随零或四个零位。 虽然时间值的秒部分可以显示到万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "FFFF" 自訂格式規範代表秒小數部分的最大有效位數為四; 換句話說，其代表日期與時間值中的萬分之一秒。但尾端為零或四個數字皆為零時，不會顯示零。 雖然時間值的萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 1,000ths of a second
cs: Tisíciny sekundy
de: 1.000stel einer Sekunde
es: 1 milésima parte de un segundo
fr: 1 000es de seconde
it: Millisecondi
ja: 1,000 分の 1 秒単位
ko: 1,000분의 1초
pl: 1/1000 sekundy
pt_br: Milésimos de um segundo
ru: 1000-е доли секунды
tr: Saniyenin 1.000'de biri
zh_hans: 千分之一秒
zh_hant: 1/1,000 秒

# _1000ths_of_a_second_description
source: The "fff" custom format specifier represents the three most significant digits of the seconds fraction; that is, it represents the milliseconds in a date and time value.
cs: Specifikátor vlastního formátu fff představuje tři platné číslice zlomku sekundy. To znamená, že v hodnotě data a času představuje milisekundy.
de: Der benutzerdefinierte Formatbezeichner "fff" repräsentiert die drei signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Millisekunden in einem Datums- und Uhrzeitwert dar.
es: El especificador de formato personalizado "fff" representa los tres dígitos más significativos de la fracción de segundos, es decir, los milisegundos de un valor de fecha y hora.
fr: Le spécificateur de format personnalisé "fff" représente les trois chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les millisecondes d'une valeur de date et d'heure.
it: L'identificatore di formato personalizzato "fff" rappresenta le tre cifre più significative della frazione di secondi, ovvero i millisecondi in un valore di data e ora.
ja: "fff" カスタム書式指定子は、秒の小数部分の有効数字上位 3 桁を表します。つまり、日時の値のミリ秒を表します。
ko: "fff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 3개를 나타냅니다. 즉, 날짜 및 시간 값에서 1,000분의 1초를 나타냅니다.
pl: Indywidualny specyfikator formatu „fff” reprezentuje trzy najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje milisekundy w wartości daty i godziny.
pt_br: O especificador de formato personalizado "fff" representa os três dígitos mais significativos da fração de segundos. Ou seja, ele representa os milissegundos em um valor de data e hora.
ru: Описатель пользовательского формата "fff" представляет три наиболее значащих цифры в дробной части секунды, то есть представляет миллисекунды в значении даты и времени.
tr: "fff" özel biçim belirticisi, saniye kesirinin en anlamlı üç basamağını; yani bir tarih ve saat değerinde milisaniyeyi temsil eder.
zh_hans: "fff" 自定义格式说明符表示秒部分的三个最高有效位；即表示日期和时间值中的毫秒。
zh_hant: "fff" 自訂格式規範代表秒小數部分的最大有效位數為三; 換句話說，其代表日期與時間值中的毫秒。

source: 1,000ths of a second (non-zero)
cs: Tisíciny sekundy (nenulové)
de: 1.000stel einer Sekunde (ungleich 0)
es: 1 milésima parte de un segundo (no cero)
fr: 1 000es de seconde (non nul)
it: Millisecondi (diversi da zero)
ja: 1,000 分の 1 秒単位 (0 以外)
ko: 1,000분의 1초(0이 아님)
pl: 1/1000 sekundy (wartrość inna niż zero)
pt_br: Milésimos de um segundo (diferente de zero)
ru: 1000-е доли секунды (не нуль)
tr: Saniyenin 1.000'de biri (sıfır olmayan)
zh_hans: 千分之一秒(非零)
zh_hant: 1/1,000 秒 (非零)

# _1000ths_of_a_second_non_zero_description
source: The "FFF" custom format specifier represents the three most significant digits of the seconds fraction; that is, it represents the milliseconds in a date and time value. However, trailing zeros or three zero digits aren't displayed.
cs: Specifikátor vlastního formátu FFF představuje tři platné číslice zlomku sekundy. To znamená, že v hodnotě data a času představuje milisekundy. Nezobrazují se ale nuly na konci ani tři nulové číslice.
de: Der benutzerdefinierte Formatbezeichner "FFF" repräsentiert die drei signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Millisekunden in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder drei Nullstellen werden jedoch nicht angezeigt.
es: El especificador de formato personalizado "FFF" representa los tres dígitos más significativos de la fracción de segundos, es decir, los milisegundos de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de tres ceros.
fr: Le spécificateur de format personnalisé "FFF" représente les trois chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les millisecondes d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les trois chiffres correspondant à des zéros ne sont pas affichés.
it: L'identificatore di formato personalizzato "FFF" rappresenta le tre cifre più significative della frazione di secondi, ovvero i millisecondi in un valore di data e ora. Gli zeri finali o le cifre con tre zeri non vengono tuttavia visualizzati.
ja: "FFF" カスタム書式指定子は、秒の小数部分の有効数字上位 3 桁を表します。つまり、日時の値のミリ秒を表します。ただし、末尾の 0 や、3 桁連続の 0 は表示されません。
ko: "FFF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 3개를 나타냅니다. 즉, 날짜 및 시간 값에서 1,000분의 1초를 나타냅니다. 그러나 후행 0 또는 3개의 0은 표시되지 않습니다.
pl: Indywidualny specyfikator formatu „FFF” reprezentuje trzy najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje milisekundy w wartości daty i godziny. Zera końcowe ani liczby z trzema zerami nie są jednak wyświetlane.
pt_br: O especificador de formato personalizado "FFF" representa os três dígitos mais significativos da fração de segundos. Ou seja, ele representa os milissegundos em um valor de data e hora. No entanto, zeros à direita ou três dígitos de zero não são exibidos.
ru: Описатель пользовательского формата "FFF" представляет три наиболее значащих цифры в дробной части секунды, то есть представляет миллисекунды в значении даты и времени. При этом конечные нули или три нулевых разряда не отображаются.
tr: "FFF" özel biçim belirticisi, saniye kesirinin en anlamlı üç basamağını; yani bir tarih ve saat değerinde milisaniyeyi temsil eder. Ancak, sondaki sıfırlar veya üç sıfır rakamı görüntülenmez.
zh_hans: "FFF" 自定义格式说明符表示秒部分的三个最高有效位；即表示日期和时间值中的毫秒。但不显示尾随零或三个零位。
zh_hant: "FFF" 自訂格式規範代表秒小數部分的最大有效位數為三; 換句話說，其代表日期與時間值中的毫秒。但尾端為零或三個數字皆為零時，不會顯示零。

source: 100ths of a second
cs: Setiny sekundy
de: 100stel einer Sekunde
es: 1 cienmilésima parte de un segundo
fr: 100es de seconde
it: Centesimi di secondo
ja: 100 分の 1 秒単位
ko: 100분의 1초
pl: 1/100 sekundy
pt_br: Centésimos de um segundo
ru: 100-е доли секунды
tr: Saniyenin 100'de biri
zh_hans: 百分之一秒
zh_hant: 1/100 秒

# _100ths_of_a_second_description
source: The "ff" custom format specifier represents the two most significant digits of the seconds fraction; that is, it represents the hundredths of a second in a date and time value.
cs: Specifikátor vlastního formátu ff představuje dvě platné číslice zlomku sekundy. To znamená, že v hodnotě data a času představuje setiny sekundy.
de: Der benutzerdefinierte Formatbezeichner "ff" repräsentiert die zwei signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Hundertstelsekunden in einem Datums- und Uhrzeitwert dar.
es: El especificador de formato personalizado "ff" representa los dos dígitos más significativos de la fracción de segundos, es decir, la centésima parte de segundo de un valor de fecha y hora.
fr: Le spécificateur de format personnalisé "ff" représente les deux chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les centièmes de seconde d'une valeur de date et d'heure.
it: L'identificatore di formato personalizzato "ff" rappresenta le due cifre più significative della frazione di secondi, ovvero i centesimi di secondo in un valore di data e ora.
ja: "ff" カスタム書式指定子は、秒の小数部分の有効数字上位 2 桁を表します。つまり、日時の値のうち、秒の小数部分を 100 分の 1 秒単位で表します。
ko: "ff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 2개를 나타냅니다. 즉, 날짜 및 시간 값에서 100분의 1초를 나타냅니다.
pl: Indywidualny specyfikator formatu „ff” reprezentuje dwie najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje setną część sekundy w wartości daty i godziny.
pt_br: O especificador de formato personalizado "ff" representa os dois dígitos mais significativos da fração de segundos. Ou seja, ele representa os centésimos de segundo em um valor de data e hora.
ru: Описатель пользовательского формата "ff" представляет две наиболее значащих цифры в дробной части секунды, то есть представляет сотые доли секунды в значении даты и времени.
tr: "ff" özel biçim belirticisi, saniye kesirin en anlamlı iki basamağını; yani bir tarih ve saat değerinde saniyenin yüzde birini temsil eder.
zh_hans: "ff" 自定义格式说明符表示秒部分的两个最高有效位；即在日期和时间值中表示百分之一秒数。
zh_hant: "ff" 自訂格式規範代表秒小數部分的最大有效位數為二; 換句話說，其代表日期與時間值中的百分之一秒。

source: 100ths of a second (non-zero)
cs: Setiny sekundy (nenulové)
de: 100stel einer Sekunde (ungleich 0)
es: 1 cienmilésima parte de un segundo (no cero)
fr: 100es de seconde (non nul)
it: Centesimi di secondo (diversi da zero)
ja: 100 分の 1 秒単位 (0 以外)
ko: 100분의 1초(0이 아님)
pl: 1/100 sekundy (wartrość inna niż zero)
pt_br: Centésimos de segundo (diferente de zero)
ru: 100-е доли секунды (не нуль)
tr: Saniyenin 100'de biri (sıfır olmayan)
zh_hans: 百分之一秒(非零)
zh_hant: 1/100 秒 (非零)

# _100ths_of_a_second_non_zero_description
source: The "FF" custom format specifier represents the two most significant digits of the seconds fraction; that is, it represents the hundredths of a second in a date and time value. However, trailing zeros or two zero digits aren't displayed.
cs: Specifikátor vlastního formátu FF představuje dvě platné číslice zlomku sekundy. To znamená, že v hodnotě data a času představuje setiny sekundy. Nezobrazují se ale nuly na konci ani dvě nulové číslice.
de: Der benutzerdefinierte Formatbezeichner "FF" repräsentiert die zwei signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Hundertstelsekunden in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder zwei Nullstellen werden jedoch nicht angezeigt.
es: El especificador de formato personalizado "FF" representa los dos dígitos más significativos de la fracción de segundos, es decir, la centésima parte de un segundo de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de dos ceros.
fr: Le spécificateur de format personnalisé "FF" représente les deux chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les centièmes de seconde d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les deux chiffres correspondant à des zéros ne sont pas affichés.
it: L'identificatore di formato personalizzato "FF" rappresenta le due cifre più significative della frazione di secondi, ovvero i centesimi di secondo in un valore di data e ora. Gli zeri finali o le cifre con due zeri non vengono tuttavia visualizzati.
ja: "FF" カスタム書式指定子は、秒の小数部分の有効数字上位 2 桁を表します。つまり、日時の値のうち、秒の小数部分を 100 分の 1 秒単位で表します。ただし、末尾の 0 や、2 桁連続の 0 は表示されません。
ko: "FF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 2개를 나타냅니다. 즉, 날짜 및 시간 값에서 100분의 1초를 나타냅니다. 그러나 후행 0 또는 2개의 0은 표시되지 않습니다.
pl: Indywidualny specyfikator formatu „FF” reprezentuje dwie najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje setną część sekundy w wartości daty i godziny. Zera końcowe ani liczby z dwoma zerami nie są jednak wyświetlane.
pt_br: O especificador de formato personalizado "FF" representa os dois dígitos mais significativos da fração de segundos. Ou seja, ele representa os centésimos de segundo em um valor de data e hora. No entanto, zeros à direita ou dois dígitos de zero não são exibidos.
ru: Описатель пользовательского формата "FF" представляет две наиболее значащих цифры в дробной части секунды, то есть представляет сотые доли секунды в значении даты и времени. При этом конечные нули или два нулевых разряда не отображаются.
tr: "FF" özel biçim belirticisi, saniye kesirinin en anlamlı iki basamağını; yani bir tarih ve saat değerinde saniyenin yüzde birini temsil eder. Ancak sondaki sıfırlar veya iki sıfır rakamı görüntülenmez.
zh_hans: "FF" 自定义格式说明符表示秒部分的两个最高有效位；即在日期和时间值中表示百分之一秒数。但不显示尾随零或两个零位。
zh_hant: "FF" 自訂格式規範代表秒小數部分的最大有效位數為二; 換句話說，其代表日期與時間值中的百分之一秒。但尾端為零或兩個數字皆為零時，不會顯示零。

source: 10ths of a second
cs: Desetiny sekundy
de: Zehntel einer Sekunde
es: 1 diezmilésima parte de un segundo
fr: 10es de seconde
it: Decimi di secondo
ja: 10 分の 1 秒単位
ko: 10분의 1초
pl: 1/10 sekundy
pt_br: Décimos de segundo
ru: 10-е доли секунды
tr: Saniyenin 10'da biri
zh_hans: 十分之一秒
zh_hant: 1/10 秒
