Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_zero_width_positive_lookahead_assertion_long
source: A zero-width positive lookahead assertion, where for a match to be successful, the input string must match the regular expression pattern in 'subexpression'. The matched substring is not included in the match result. A zero-width positive lookahead assertion does not backtrack. Typically, a zero-width positive lookahead assertion is found at the end of a regular expression pattern. It defines a substring that must be found at the end of a string for a match to occur but that should not be included in the match. It is also useful for preventing excessive backtracking. You can use a zero-width positive lookahead assertion to ensure that a particular captured group begins with text that matches a subset of the pattern defined for that captured group.
cs: Pozitivní kontrolní výraz dopředného vyhledávání s nulovou délkou, při kterém úspěšná shoda nastane v případě, že vstupní řetězec odpovídá vzoru regulárního výrazu v dílčím výrazu. Odpovídající dílčí řetězec se do výsledku porovnávání nezahrnuje. Pozitivní kontrolní výraz dopředného vyhledávání s nulovou délkou neprovádí zpětné vyhledávání. Pozitivní kontrolní výraz dopředného vyhledávání s nulovou délkou se obvykle nachází na konci vzoru regulárního výrazu. Definuje dílčí řetězec, který musí být nalezen na konci řetězce, aby došlo ke shodě, ale který by shoda neměla zahrnovat. Je také užitečný k zabránění nadměrnému zpětnému vyhledávání. Pomocí pozitivního kontrolního výrazu dopředného vyhledávání s nulovou délkou můžete zajistit, aby určitá zachycující skupina začínala textem, který odpovídá podmnožině vzoru definovaného pro danou zachycující skupinu.
de: Eine positive Lookaheadassertion mit Nullbreite, bei der eine Übereinstimmung erfolgreich ist, wenn die Eingabezeichenfolge dem Muster für reguläre Ausdrücke im Teilausdruck entspricht. Die abgeglichene Zeichenfolge ist im Übereinstimmungsergebnis nicht enthalten. Für eine positive Lookaheadassertion wird keine Rückverfolgung durchgeführt. Eine positive Lookaheadassertion mit Nullbreite wird in der Regel am Ende eines Musters für reguläre Ausdrücke verwendet. Sie definiert eine Teilzeichenfolge, die sich am Ende einer Zeichenfolge befinden muss, damit eine Übereinstimmung vorliegt, die aber nicht in der Übereinstimmung enthalten sein darf. Sie eignet sich auch zum Verhindern einer übermäßigen Rückverfolgung. Mit einer positiven Lookaheadassertion mit Nullbreite können Sie sicherstellen, dass eine bestimmte erfasste Gruppe mit einem Text beginnt, der einer Teilmenge des für die erfasste Gruppe definierten Musters entspricht.
es: Una aserción de búsqueda anticipada (lookahead) positiva de ancho cero, donde para que una coincidencia sea correcta, la cadena de entrada debe coincidir con el modelo de expresión regular en "subexpresión". La subcadena coincidente no está incluida en el resultado de la coincidencia. Una aserción de búsqueda anticipada (lookahead) positiva de ancho cero no tiene seguimiento con retroceso. Normalmente, una aserción de búsqueda anticipada (lookahead) positiva de ancho cero se encuentra al final de un patrón de expresión regular. Define una subcadena que debe encontrarse al final de una cadena para que se produzca una coincidencia, pero que no debe incluirse en la coincidencia. También resulta útil para evitar un seguimiento con retroceso excesivo. Puede usar una aserción de búsqueda anticipada (lookahead) positiva de ancho cero para asegurarse de que un grupo capturado en particular empiece con texto que coincida con un subconjunto del patrón definido para ese grupo capturado.
fr: Assertion avant positive de largeur nulle, où, pour qu'une correspondance soit réussie, la chaîne d'entrée doit correspondre au modèle d'expression régulière de la 'sous-expression'. La sous-chaîne correspondante n'est pas incluse dans le résultat de la correspondance. Une assertion avant positive de largeur nulle n'effectue pas de rétroaction. En règle générale, une assertion avant positive de largeur nulle se trouve à la fin d'un modèle d'expression régulière. Elle définit une sous-chaîne qui doit se trouver à la fin d'une chaîne pour qu'une correspondance se produise mais qui ne doit pas être incluse dans la correspondance. Elle permet également d'empêcher un retour sur trace excessif. Vous pouvez utiliser une assertion avant positive de largeur nulle pour vérifier qu'un groupe capturé particulier commence par un texte correspondant à un sous-ensemble du modèle défini pour ce groupe capturé.
it: Asserzione lookahead positiva di larghezza zero, in cui per trovare una corrispondenza, la stringa di input deve corrispondere al criterio di ricerca di espressioni regolari in 'subexpression'. La sottostringa corrispondente non è inclusa nei risultati della corrispondenza. Un'asserzione lookahead positiva di larghezza zero non esegue il backtracking. In genere, un'asserzione lookahead positiva di larghezza zero viene trovata alla fine di un criterio di ricerca di espressioni regolari. Definisce una sottostringa che deve trovarsi alla fine di una stringa per stabilire una corrispondenza, ma che non deve essere inclusa nella corrispondenza. È anche utile per impedire un backtracking eccessivo. È possibile usare un'asserzione lookahead positiva di larghezza zero per assicurarsi che un particolare gruppo acquisito inizi con il testo che corrisponde a un subset del criterio definito per tale gruppo acquisito.
ja: ゼロ幅の肯定先読みアサーション。ここで、一致と見なされるためには、入力文字列が 'subexpression' の正規表現パターンと一致する必要がありますが、一致した部分文字列は一致結果には含まれません。ゼロ幅の肯定先読みアサーションはバックトラックしません。 通常、ゼロ幅の肯定先読みアサーションは正規表現パターンの末尾にあります。一致と見なされるには文字列の末尾にある必要がありますが、一致には含まれない部分文字列を定義します。これは、過度なバックトラッキングを防ぐためにも役立ちます。ゼロ幅の肯定先読みアサーションを使用して、特定のキャプチャされたグループの先頭テキストが、そのキャプチャされたグループに対して定義されたパターンのサブセットと一致するテキストになるようにすることができます。
ko: 너비가 0인 긍정 lookahead 어설션입니다. 여기서, 일치 항목을 찾으려면 입력 문자열이 'subexpression'의 정규식 패턴과 일치해야 합니다. 일치된 하위 문자열은 일치 결과에 포함되지 않습니다. 너비가 0인 긍정 lookahead 어설션은 역추적하지 않습니다. 일반적으로 너비가 0인 긍정 lookahead 어설션은 정규식 패턴 끝에 있습니다. 이 어설션은 일치 항목을 찾을 문자열 끝에 있어야 하지만 일치에 포함되면 안 되는 하위 문자열을 정의합니다. 또한, 과도한 역추적을 방지하는 데에도 유용합니다. 너비가 0인 긍정 lookahead 어설션을 사용하면 캡처된 특정 그룹이 이 캡처된 그룹에 정의된 패턴의 하위 집합과 일치하는 텍스트로 시작하도록 할 수 있습니다.
pl: Pozytywna asercja wyprzedzająca o zerowej szerokości, w przypadku której powodzenie dopasowania wymaga, aby ciąg wejściowy pasował do wzorca wyrażenia regularnego w „podwyrażeniu”. Dopasowany podciąg nie jest dołączany do wyniku dopasowania. Pozytywna asercja wyprzedzająca o zerowej szerokości nie wykonuje cofania się. Zwykle pozytywna asercja wyprzedzająca o zerowej szerokości znajduje się na końcu wzorca wyrażenia regularnego. Definiuje ona podciąg, który musi znajdować się na końcu ciągu, aby nastąpiło dopasowanie, lecz który nie powinien zostać dołączony do dopasowania. Jest także przydatna do ograniczenia nadmiernego cofania się. Pozytywnej asercji wyprzedzającej o zerowej szerokości możesz użyć, aby zapewnić, że konkretna przechwycona grupa zaczyna się tekstem pasującym do podzbioru wzorca definiującego tę przechwyconą grupę.
pt_br: Uma asserção lookahead positiva de largura zero, em que para que uma correspondência seja bem-sucedida, a cadeia de caracteres de entrada precisa corresponder ao padrão de expressão regular na 'subexpression'. A substring correspondente não é incluída no resultado correspondente. Uma asserção lookahead positiva de largura zero não retrocede. Normalmente, uma asserção lookahead positiva de largura zero é encontrada no final de um padrão de expressão regular. Ela define uma substring que precisa ser encontrada no final de uma cadeia de caracteres para que uma correspondência ocorra, mas que não deve ser incluída na correspondência. Ela também é útil para impedir o rastreamento inverso excessivo. Você pode usar uma asserção lookahead positiva de largura zero para garantir que um determinado grupo capturado comece com um texto que corresponda a um subconjunto do padrão definido para esse grupo capturado.
ru: Положительное утверждение просмотра вперед нулевой ширины, в котором для успешного сопоставления входная строка должна соответствовать шаблону регулярного выражения в части выражения. Соответствующая подстрока не включается в результат сравнения. Положительное упреждающее утверждение нулевой ширины не выполняет обратное отслеживание. Обычно такое утверждение находится в конце шаблона регулярного выражения. Оно определяет подстроку, которая должна быть найдена в конце строки для выполнения сравнения, но не может быть включена в него. Кроме того, это утверждение удобно использовать для предотвращения избыточного обратного отслеживания. Вы можете использовать положительное упреждающее утверждение нулевой ширины, чтобы убедиться, что определенная записанная группа начинается с текста, который соответствует подмножеству шаблона, определенного для этой записанной группы.
tr: Bir eşleşmenin başarılı olması için giriş dizesinin 'subexpression' içindeki normal ifade deseniyle eşleşmesi gerektiği sıfır genişlikli bir pozitif ileri yönlü onaylama. Eşleşen alt dize, eşleşme sonucuna dahil değildir. Sıfır genişlikli bir pozitif ileri yönlü onaylama geri izleme yapmaz. Sıfır genişlikli bir pozitif ileri yönlü onaylama genellikle normal ifade deseninin sonunda bulunur. Bir eşleşmenin gerçekleşmesi için bir dizenin sonunda bulunması, ancak eşleştirmeye dahil edilmemesi gereken bir alt dizeyi tanımlar. Aşırı geri izleme yapılmasını önlemek için de yararlıdır. Yakalanan belirli bir grubun, bu yakalanmış grup için tanımlanan desenin bir alt kümesiyle eşleşen metinle başladığından emin olmak için sıfır genişlikli bir pozitif ileri yönlü onaylama işlemi kullanabilirsiniz.
zh_hans: 零宽正向先行断言(即要成功匹配)，输入字符串必须与 "subexpression" 中的正则表达式模式匹配。匹配结果中不包括匹配的子字符串。零宽正向先行断言不回溯。 零宽正向先行断言通常出现在正则表达式模式的末尾。它定义一个子字符串，该字符串必须位于字符串的末尾(以便匹配发生)但不应包含在匹配中。它对于防止过度回溯也很有用。可以使用零宽正向先行断言来确保特定捕获的组以与为捕获的组定义的模式的子集匹配的文本开头。
zh_hant: 零寬正右合樣判斷提示，如果要使比對成功，則輸入字串必須符合 'subexpression' 中的規則運算式模式。符合的子字串不會包含在比對結果內。零寬度正 lookahead 判斷提示不會回溯。 一般來說，零寬度正 lookahead 判斷提示會出現在規則運算式模式的結尾。其會定義應出現在字串結尾以使比對發生，但不應包含在比對內的子字串。對於防止過度回溯來說，其也相當實用。您可以使用零寬度正 lookahead 判斷提示來確保特定已擷取群組會以符合為該已擷取群組定義之模式的子集開頭。

# Regex_zero_width_positive_lookahead_assertion_short
source: zero-width positive lookahead assertion
cs: pozitivní kontrolní výraz dopředného vyhledávání s nulovou délkou
de: Positive Lookaheadassertion mit Nullbreite
es: aserción de búsqueda anticipada (lookahead) positiva de ancho cero
fr: assertion avant positive de largeur nulle
it: asserzione lookahead positiva di larghezza zero
ja: ゼロ幅の肯定先読みアサーション
ko: 너비가 0인 긍정 lookahead 어설션
pl: pozytywna asercja wyprzedzająca o zerowej szerokości
pt_br: asserção lookahead positiva de largura zero
ru: положительное утверждение просмотра вперед нулевой ширины
tr: sıfır genişlikli pozitif ileri yönlü onaylama
zh_hans: 零宽正向先行断言
zh_hant: 零寬正值右合樣判斷提示

# Regex_zero_width_positive_lookbehind_assertion_long
source: A zero-width positive lookbehind assertion, where for a match to be successful, 'subexpression' must occur at the input string to the left of the current position. 'subexpression' is not included in the match result. A zero-width positive lookbehind assertion does not backtrack. Zero-width positive lookbehind assertions are typically used at the beginning of regular expressions. The pattern that they define is a precondition for a match, although it is not a part of the match result.
cs: Pozitivní kontrolní výraz zpětného vyhledávání s nulovou délkou, při kterém úspěšná shoda nastane v případě, že se dílčí výraz nachází ve vstupním řetězci nalevo od aktuální pozice. Dílčí výraz se do výsledku porovnávání nezahrnuje. Pozitivní kontrolní výraz zpětného vyhledávání s nulovou délkou neprovádí zpětné navracení. Pozitivní kontrolní výrazy zpětného vyhledávání s nulovou délkou se obvykle používají na začátku regulárních výrazů. Vzor, který definují, je podmínkou pro shodu, i když není součástí výsledku porovnávání.
de: Eine positive Lookbehindassertion mit Nullbreite, bei der eine Übereinstimmung erfolgreich ist, wenn "Teilausdruck" in der Eingabezeichenfolge links von der aktuellen Position vorliegt. "Teilausdruck" ist im Übereinstimmungsergebnis nicht enthalten. Bei einer positiven Lookbehindassertion mit Nullbreite wird keine Rückverfolgung durchgeführt. Positive Lookbehindassertionen mit Nullbreite werden normalerweise am Anfang regulärer Ausdrücke verwendet. Das von ihnen definierte Muster ist eine Vorbedingung für eine Übereinstimmung, auch wenn es nicht zum Übereinstimmungsergebnis gehört.
es: Una aserción de búsqueda retrasada (lookbehind) positiva de ancho cero, donde para que una coincidencia sea correcta, "subexpresión" debe aparecer en la cadena de entrada a la izquierda de la posición actual. "subexpresión" no se incluye en el resultado de la coincidencia. Una aserción de búsqueda retrasada (lookbehind) positiva de ancho cero no tiene seguimiento con retroceso. Las aserciones de búsqueda retrasada (lookbehind) positivas de ancho cero se usan normalmente al principio de las expresiones regulares. El patrón que definen es una condición previa para una coincidencia, aunque no forma parte del resultado de la coincidencia.
fr: Assertion arrière positive de largeur nulle, où, pour qu'une correspondance soit réussie, la 'sous-expression' doit apparaître dans la chaîne d'entrée à gauche de la position actuelle. La 'sous-expression' n'est pas incluse dans le résultat de la correspondance. Une assertion arrière positive de largeur nulle n'effectue pas de rétroaction. Les assertions arrière positives de largeur nulle sont généralement utilisées au début des expressions régulières. Le modèle qu'elles définissent est une condition préalable à une correspondance, bien qu'il ne fasse pas partie du résultat de la correspondance.
it: Asserzione lookbehind positiva di larghezza zero, in cui per trovare una corrispondenza, 'subexpression' deve trovarsi nella stringa di input a sinistra della posizione corrente. 'subexpression' non è incluso nei risultati della corrispondenza. Un'asserzione lookbehind positiva di larghezza zero non esegue il backtracking. Le asserzioni lookbehind positive di larghezza zero vengono usate in genere all'inizio delle espressioni regolari. Il criterio definito è una precondizione per una corrispondenza, anche se non fa parte del risultato della corrispondenza.
ja: ゼロ幅の肯定後読みアサーション。ここで、一致と見なされるためには、'subexpression' が入力文字列の現在の位置の左側に出現する必要がありますが、'subexpression' は一致結果には含まれません。ゼロ幅の肯定後読みアサーションはバックトラックしません。 通常、ゼロ幅の肯定後読みアサーションは正規表現の先頭で使用されます。定義されるパターンは一致の事前条件ですが、一致結果には含まれません。
ko: 너비가 0인 긍정 lookbehind 어설션입니다. 여기서, 일치 항목을 찾으려면 입력 문자열에서 현재 위치 왼쪽에 'subexpression'이 있어야 합니다. 'subexpression'은 일치 결과에 포함되지 않습니다. 너비가 0인 긍정 lookbehind 어설션은 역추적하지 않습니다. 너비가 0인 긍정 lookbehind 어설션은 일반적으로 정규식의 시작 부분에 사용됩니다. 어설션이 정의하는 패턴은 일치 항목의 사전 조건이지만 일치 결과에 포함되지 않습니다.
pl: Pozytywna asercja wsteczna o zerowej szerokości, w przypadku której powodzenie dopasowania wymaga, aby „podwyrażenie” występowało w ciągu wejściowym po lewej stronie bieżącej pozycji. „Podwyrażenie” nie jest dołączane do wyniku dopasowania. Pozytywna asercja wsteczna o zerowej szerokości nie wykonuje cofania. Pozytywne asercje wsteczne o zerowej szerokości są zwykle używane na początku wyrażeń regularnych. Definiowany przez nie wzorzec jest warunkiem wstępnym dopasowania, lecz sam nie jest częścią wyniku dopasowania.
pt_br: Uma asserção lookbehind positiva de largura zero, em que, para que uma correspondência seja bem-sucedida, a 'subexpression' precisa ocorrer na cadeia de caracteres de entrada à esquerda da posição atual. A 'subexpression' não é incluída no resultado correspondente. Uma asserção lookbehind positiva de largura zero não retrocede. As declarações de lookbehind positivas de largura zero normalmente são usadas no início de expressões regulares. O padrão que elas definem é uma pré-condição para uma correspondência, apesar de não fazer parte do resultado correspondente.
ru: Положительное утверждение просмотра назад нулевой ширины, где для успешного сопоставления "часть выражения" должна находиться во входной строке, слева от текущей позиции. "Часть выражения" не включается в результат сравнения. Такое утверждение не выполняет обратное отслеживание. Положительные отстающие утверждения просмотра назад обычно используются в начале регулярных выражений. Шаблон, который они определяют, является необходимым условием для совпадения, хотя и не входит в его результат.
tr: Bir eşleşmenin başarılı olması için geçerli konumun solundaki giriş dizesinde 'subexpression' oluşması gereken sıfır genişlikli bir pozitif geri yönlü onaylama işlemi. 'subexpression' eşleşme sonucuna dahil değildir. Sıfır genişlikli bir pozitif geri yönlü onaylama işlemi geri izleme yapmaz. Sıfır genişlikli pozitif geri yönlü onaylamalar genellikle normal ifadelerin başında kullanılır. Tanımladıkları desen eşleşme sonucunun bir parçası olmasa da, bir eşleşme ön koşuludur.
zh_hans: 零宽正向后行断言(即要成功匹配)，"subexpression" 必须出现在输入字符串的当前位置左侧。匹配结果中不包含 "subexpression"。零宽正向后行断言不会回溯。 零宽正向后行断言通常在正则表达式开头使用。它们定义的模式是匹配项的前提条件，尽管它不是匹配结果的一部分。
zh_hant: 零寬正左合樣判斷提示，如果要使比對成功，則 'subexpression' 必須於目前位置左側的輸入字串發生。'subexpression' 不會包含在比對結果內。零寬度正 lookbehind 判斷提示不會回溯。 零寬度正 lookbehind 判斷提示通常會用在規則運算式的開頭。其定義的模式是比對的前置條件，但不是比對結果的一部份。

# Regex_zero_width_positive_lookbehind_assertion_short
source: zero-width positive lookbehind assertion
cs: pozitivní kontrolní výraz zpětného vyhledávání s nulovou délkou
de: Positive Lookbehindassertion mit Nullbreite
es: aserción de búsqueda retrasada (lookbehind) positiva de ancho cero
fr: assertion arrière positive de largeur nulle
it: asserzione lookbehind positiva di larghezza zero
ja: ゼロ幅の肯定後読みアサーション
ko: 너비가 0인 긍정 lookbehind 어설션
pl: pozytywna asercja wsteczna o zerowej szerokości
pt_br: asserção lookbehind positiva de largura zero
ru: положительное утверждение просмотра назад нулевой ширины
tr: sıfır genişlikli pozitif geri yönlü onaylama
zh_hans: 零宽正向后行断言
zh_hant: 零寬正值左合樣判斷提示

source: Removal of document not supported
cs: Odebrání dokumentu se nepodporuje.
de: Das Entfernen des Dokuments wird nicht unterstützt.
es: No se admite la eliminación del documento
fr: Suppression du document non prise en charge
it: La rimozione del documento non è supportata
ja: ドキュメントの削除はサポートされていません
ko: 지원되지 않는 문서 제거
pl: Usunięcie dokumentu nie jest obsługiwane
pt_br: Não há suporte para a remoção do documento
ru: Удаление документа не поддерживается
tr: Belgenin kaldırılması desteklenmiyor
zh_hans: 不支持删除文档
zh_hant: 不支援移除文件

source: Remove unnecessary casts
cs: Odebrat nepotřebná přetypování
de: Nicht erforderliche Umwandlungen entfernen
es: Quitar conversiones innecesarias
it: Rimuovi i cast non necessari
ja: 不要なキャストを削除する
ko: 불필요한 캐스트 제거
pl: Usuń niepotrzebne rzutowania
pt_br: Remover conversões desnecessárias
ru: Удалить ненужные приведения
tr: Gereksiz atamaları kaldır
zh_hans: 删除不必要的转换

source: Remove unnecessary imports or usings
cs: Odebrat nepotřebné importy nebo použití
es: Quitar importaciones o usos innecesarios
ko: 불필요한 가져오기 또는 사용 제거
pl: Usuń niepotrzebne importy lub użycia
pt_br: Remover Importações ou usos desnecessários
ru: Удалить ненужные операции импорта или использования
tr: Gereksiz içeri aktarmaları veya kullanmaları kaldır
zh_hans: 移除不必要的导入或使用

source: Remove unused parameters
cs: Odebrat nepoužívané parametry
de: Nicht verwendete Parameter entfernen
es: Quitar parámetros no usados
it: Rimuovi parametri inutilizzati
ja: 未使用のパラメーターの削除
ko: 사용하지 않는 매개 변수 제거
pl: Usuń nieużywane parametry
pt_br: Remover parâmetros não utilizados
ru: Удалить неиспользуемый параметр
tr: Kullanılmayan parametreleri kaldır
zh_hans: 删除未使用的参数

source: Remove unused suppressions
cs: Odebrat nepoužívaná potlačení
de: Nicht verwendete Unterdrückungen entfernen
es: Quitar supresiones sin usar
it: Rimuovi eliminazioni inutilizzate
ja: 未使用の抑制を削除する
ko: 사용하지 않는 제거 제거
pl: Usuń nieużywane pominięcia
pt_br: Remover supressões não usadas
ru: Удалить неиспользуемые подавления
tr: Kullanılmayan gizlemeleri kaldır
zh_hans: 删除未使用的禁止显示

source: Remove unused variables
cs: Odebrat nepoužívané proměnné
de: Nicht verwendete Variablen entfernen
es: Quitar variables no utilizadas
it: Rimuovi le variabili non usate
ja: 未使用の変数を削除する
ko: 사용하지 않는 변수 제거
pl: Usuń nieużywane zmienne
pt_br: Remover variáveis não utilizadas
ru: Удалить неиспользуемые переменные
tr: Kullanılmayan değişkenleri kaldır
zh_hans: 删除未使用的变量

source: Removing {0} that contains an active statement requires restarting the application.
cs: Odstranění {0} s aktivním příkazem vyžaduje restartování aplikace.
de: Das Entfernen von {0}, die eine aktive Anweisung enthält, erfordert einen Neustart der Anwendung.
es: Para quitar {0} que contiene una instrucción de acción es necesario reiniciar la aplicación.
it: Se si rimuove {0} che contiene un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントを含む {0} を削除するには、アプリケーションを再起動する必要があります。
ko: 활성 문이 포함된 {0}을(를) 제거하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Usuwanie elementu {0}, który zawiera aktywną instrukcję, wymaga ponownego uruchomienia aplikacji.
pt_br: Remover {0} que contém uma instrução ativa requer a reinicialização do aplicativo.
ru: Для удаления {0} с активным оператором требуется перезапустить приложение.
tr: Etkin bir deyim içeren {0} öğesinin kaldırılması, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 删除包含活动语句的 {0} 需要重新启动应用程序。

source: Renaming {0} requires restarting the application.
cs: Přejmenování {0} vyžaduje restartování aplikace.
de: Das Umbenennen von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar el nombre de {0} es necesario reiniciar la aplicación.
it: Se si rinomina {0}, è necessario riavviare l'applicazione.
ja: {0} の名前を変更すると、アプリケーションを再起動する必要があります。
ko: {0} 이름을 바꾸려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana nazwy elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Renomear {0} requer reiniciar o aplicativo.
ru: Для переименования {0} требуется перезапустить приложение.
tr: {0} öğesinin yeniden adlandırılması, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 重命名 {0} 要求重启应用程序。

source: Renaming {0} requires restarting the application because it is not supported by the runtime.
cs: Změna názvu {0} vyžaduje restartování aplikace, protože tuto akci modul runtime nepodporuje.
de: Das Umbenennen von {0} erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para cambiar el nombre {0} se requiere reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Se si rinomina {0}, è necessario riavviare l'applicazione perché l'operazione non è supportata dal runtime.
ja: ランタイムでサポートされていないため、{0} の名前を変更するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 {0}의 이름을 바꾸려면 응용 프로그램을 다시 시작해야 합니다.
pl: Zmienianie nazwy elementu {0} wymaga ponownego uruchomienia aplikacji, ponieważ nie jest to obsługiwane przez środowisko uruchomieniowe.
pt_br: Renomear {0} requer a reinicialização do aplicativo porque não há suporte para ele no runtime.
ru: Для переименования {0} требуется перезапустить приложение, поскольку это не поддерживается средой выполнения.
tr: {0} öğesini yeniden adlandırmak çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 重命名 {0} 需要重新启动应用程序，因为运行时不支持它。
