Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_conditional_expression_match_long
source: This language element attempts to match one of two patterns depending on whether it can match an initial pattern. 'expression' is the initial pattern to match, 'yes' is the pattern to match if expression is matched, and 'no' is the optional pattern to match if expression is not matched.
cs: Tento element jazyka se pokusí najít shodu s jedním ze dvou vzorů na základě toho, jestli se najde shoda s počátečním vzorem. Expression je počáteční vzor, pro který se hledá shoda, yes je vzor, pro který se hledá shoda, pokud se pro expression najde shoda, a no je volitelný vzor, pro který se hledá shoda, pokud se pro expression nenajde shoda.
de: Dieses Sprachelement unternimmt den Abgleich mit einem von zwei Mustern abhängig davon, ob der Abgleich mit einem Anfangsmuster möglich ist. "expression" ist das anfängliche Muster für den Abgleich, "yes" ist das Muster, das bei Übereinstimmung des Ausdrucks abgeglichen werden soll, und "No" ist das optionale Muster, das abgeglichen werden soll, wenn der Ausdruck nicht übereinstimmt.
es: Este elemento del lenguaje intenta coincidir con uno de dos patrones en función de si puede coincidir con un patrón inicial. "expression" es el patrón inicial que debe coincidir, "yes" es el patrón que debe coincidir si la expresión coincide y "no" es el patrón opcional que debe coincidir si la expresión no coincide.
fr: Cet élément de langage tente d'établir une correspondance avec l'un des deux modèles, selon qu'il peut correspondre ou non à un modèle initial. 'expression' est le modèle initial à rechercher, 'oui' est le modèle à rechercher si 'expression' retourne une correspondance, et 'non' est le modèle facultatif à rechercher si 'expression' ne retourne aucune correspondance.
it: Questo elemento del linguaggio effettua un tentativo per trovare una corrispondenza con uno di due criteri, a seconda della possibilità di trovare una corrispondenza con un criterio iniziale. dove 'expression' è il criterio iniziale per la corrispondenza, 'yes' è il criterio di corrispondenza se viene trovata una corrispondenza per l'espressione e 'no' è il criterio facoltativo di corrispondenza se non viene trovata una corrispondenza per l'espressione.
ja: この言語要素では、最初のパターンに一致するかどうかに応じて、2 つのパターンのいずれかの照合を実行します。 'expression' は照合する最初のパターン、'yes' は expression が一致した場合に照合するパターン、'no' は expression が一致しなかった場合に照合するパターン (省略可能) です。
ko: 이 언어 요소는 초기 패턴과 일치시킬 수 있는지 여부에 따라 두 패턴 중 하나와 일치시키려고 시도합니다. 'expression'은 일치시킬 초기 패턴이며 'yes'는 식이 일치하는 경우 일치시킬 패턴이고 'no'는 식이 일치하지 않는 경우 일치시킬 선택적 패턴입니다.
pl: Ten element języka próbuje dopasować jeden z dwóch wzorców w zależności od tego, czy może dopasować wzorzec początkowy. Element „wyrażenie” to wzorzec początkowy do dopasowania, element „tak” to wzorzec do dopasowania w przypadku dopasowania wyrażenia, a element „nie” to opcjonalny wzorzec do dopasowania, jeśli wyrażenie nie zostanie dopasowane.
pt_br: Este elemento de linguagem tenta corresponder a um de dois padrões, dependendo da possibilidade de correspondência com um padrão inicial. 'expression' é o padrão inicial, 'yes' é o padrão quando a expressão é correspondida e 'no' é o padrão opcional quando a expressão não é correspondida.
ru: Этот элемент языка пытается соответствовать одному из двух шаблонов в зависимости от того, может ли он соответствовать исходному шаблону. expression является исходным шаблоном для проверки соответствия, yes является шаблоном, когда выражение имеет соответствие, а no является необязательным шаблоном для проверки соответствия, если выражение не имеет соответствия.
tr: Bu dil öğesi, başlangıç deseniyle eşleşip eşleşemediğine bağlı olarak iki desenden biriyle eşleşmeye çalışır. 'expression': eşleşecek ilk desen, 'yes': ifade eşleştiğinde eşleşecek olan desen ve 'no': ifade eşleşmediğinde eşleşecek olan isteğe bağlı desendir.
zh_hans: 此语言元素尝试匹配两种模式之一，具体取决于它是否可以与初始模式匹配。 "expression" 是要匹配的初始模式，如果表达式匹配，则 "yes" 是可匹配的模式；如果表达式不匹配，则 "no" 是可匹配的可选模式。。
zh_hant: 這個語言元素會根據是否可以比對初始模式，嘗試比對兩個模式的其中一個。 'expression' 是要比對的初始模式，若運算式相符，'yes' 即為要比對的模式; 若模式不相符，'no' 則為要比對的選擇性模式。

# Regex_conditional_expression_match_short
source: conditional expression match
cs: podmíněná shoda výrazu
de: Abgleich mit bedingtem Ausdruck
es: coincidencia de expresión condicional
fr: correspondance d'expression conditionnelle
it: corrispondenza di espressione condizionale
ja: 条件式の一致
ko: 조건식 일치
pl: warunkowe dopasowanie wyrażenia
pt_br: correspondência de expressão condicional
ru: условное соответствие выражения
tr: koşullu ifade eşleşmesi
zh_hans: 条件表达式匹配
zh_hant: 條件運算式比對

# Regex_conditional_group_match_long
source: This language element attempts to match one of two patterns depending on whether it has matched a specified capturing group. 'name' is the name (or number) of a capturing group, 'yes' is the expression to match if 'name' (or 'number') has a match, and 'no' is the optional expression to match if it does not.
cs: Tento element jazyka se pokusí najít shodu s jedním ze dvou vzorů na základě toho, jestli se najde shoda se zadanou zachycující skupinou. Name je název (nebo číslo) zachycující skupiny, yes je výraz, pro který se hledá shoda, pokud se daný název (nebo číslo) najde, a no je volitelný výraz, pro který se hledá shoda, pokud se tato položka nenajde.
de: Dieses Sprachelement unternimmt den Abgleich mit einem von zwei Mustern abhängig davon, ob eine Übereinstimmung mit einer angegebenen Erfassungsgruppe vorliegt. "name" ist der Name (oder die Zahl) einer Erfassungsgruppe, "yes" ist der Ausdruck, der bei einer Übereinstimmung für "name" (oder "number") abgeglichen werden soll, und "no" ist der optionale Ausdruck, der andernfalls abgeglichen wird.
es: Este elemento del lenguaje intenta coincidir con uno de dos patrones en función de si coincide con un grupo de captura especificado. "name" es el nombre (o número) de un grupo de capturas, "yes" es la expresión que debe coincidir si "name" (o "number") tiene una coincidencia y "no" es la expresión opcional para la coincidencia si no la tiene.
fr: Cet élément de langage tente d'établir une correspondance avec l'un des deux modèles, selon qu'il correspond ou non à un groupe de capture spécifié. 'nom' est le nom (ou le numéro) d'un groupe de capture, 'oui' est l'expression à rechercher si 'nom' (ou 'numéro') a une correspondance, et 'non' est l'expression facultative à rechercher dans le cas contraire.
it: Questo elemento del linguaggio effettua un tentativo per trovare una corrispondenza con uno di due criteri, a seconda dell'effettiva corrispondenza con un gruppo di acquisizione specificato. 'name' è il nome (o il numero) di un gruppo di acquisizione, 'yes' è l'espressione di cui trovare la corrispondenza se per 'name' (o 'number') è disponibile una corrispondenza e 'no' è l'espressione facoltativa di cui trovare la corrispondenza in caso contrario.
ja: この言語要素では、指定されたキャプチャ グループに一致するかどうかに応じて、2 つのパターンのいずれかを照合します。 'name' はキャプチャ グループの名前 (または番号)、'yes' は 'name' (または 'number') が一致する場合に照合する式です。'no' は一致しない場合に照合する省略可能な式です。
ko: 이 언어 요소는 지정한 캡처링 그룹과 일치시켰는지 여부에 따라 두 패턴 중 하나와 일치시키려고 시도합니다. 'name'은 캡처링 그룹의 이름(또는 번호)이며 'yes'는 'name'(또는 'number')에 일치 항목이 있는 경우 일치시킬 식이고 'no'는 일치 항목이 없는 경우 일치시킬 선택적 식입니다.
pl: Ten element języka próbuje dopasować jeden z dwóch wzorców w zależności od tego, czy pasuje do określonej grupy przechwytującej. Element „nazwa” to nazwa (lub numer) grupy przechwytującej, element „tak” to wyrażenie do dopasowania, jeśli element „nazwa” (lub „numer”) został dopasowany, a element „nie” to wyrażenie opcjonalne do dopasowania w przeciwnym przypadku.
pt_br: Este elemento de linguagem tenta corresponder a um de dois padrões, dependendo da correspondência a um grupo de captura especificado. 'name' é o nome (ou número) de um grupo de captura, 'yes' é a expressão a ser correspondida quando 'name' (ou 'number') é correspondido e 'no' é a expressão opcional a ser correspondida caso contrário.
ru: Этот элемент языка пытается соответствовать одному из двух шаблонов в зависимости от того, установил ли он соответствие указанной группе записи. name является именем (или номером) группы записи, yes является выражением для проверки соответствия, если name (или number) имеет соответствие, а no является необязательным выражением для проверки соответствия в противном случае.
tr: Bu dil öğesi, belirtilen bir yakalama grubuyla eşleşip eşleşmediğine bağlı olarak iki desenden biriyle eşleşmeye çalışır. 'name': bir yakalama grubunun adı (veya sayısı), 'yes': 'name' (veya 'number') bir eşleşme içeriyorsa eşleşecek olan ifade ve 'no': 'name' bir eşleşme içermiyorsa eşleşecek olan isteğe bağlı ifadedir.
zh_hans: 此语言元素尝试匹配两种模式之一，具体取决于它是否与指定的捕获组匹配。 "name" 是捕获组的名称(或编号)，"yes" 是在 "name" (或 "number") 具有匹配项的情况下匹配的表达式，"no" 是没有匹配的情况下可匹配的可选表达式。
zh_hant: 這個語言元素會根據是否與指定的擷取群組相符，嘗試比對兩個模式的其中一個。 'name' 是擷取群組的名稱 (或編號)，若 'name' (或 'number') 相符，'yes' 即為要比對的運算式; 若不相符，'no' 則為要比對的選擇性運算式。

# Regex_conditional_group_match_short
source: conditional group match
cs: podmíněná shoda skupiny
de: Abgleich mit bedingter Gruppe
es: coincidencia de grupo condicional
fr: correspondance de groupe conditionnelle
it: corrispondenza di gruppo condizionale
ja: 条件付きグループの一致
ko: 조건 그룹 일치
pl: warunkowe dopasowanie grupy
pt_br: correspondência de grupo condicional
ru: условное соответствие группы
tr: koşullu grup eşleşmesi
zh_hans: 条件组匹配
zh_hant: 條件式群組比對

# Regex_contiguous_matches_long
source: The \G anchor specifies that a match must occur at the point where the previous match ended. When you use this anchor with the Regex.Matches or Match.NextMatch method, it ensures that all matches are contiguous.
cs: Ukotvení \G určuje, že ke shodě musí dojít v místě, kde bylo předchozí porovnávání ukončeno. Pokud použijete toto ukotvení s metodou Regex.Matches nebo Match.NextMatch, zajistí se, že všechna porovnávání budou souvislá.
de: Der \G-Anker gibt an, dass eine Übereinstimmung an dem Punkt erfolgen muss, an dem die vorherige Übereinstimmung endete. Wenn Sie diesen Anker mit der Regex.Matches- oder der Match.NextMatch-Methode verwenden, wird sichergestellt, dass alle Übereinstimmungen zusammenhängen.
es: El delimitador \G especifica que se debe producir una coincidencia en el punto en el que finalizó la coincidencia anterior. Cuando se usa este delimitador con el método Regex.Matches o Match.NextMatch, se garantiza que todas las coincidencias sean contiguas.
fr: L'ancre \G spécifie qu'une correspondance doit exister à l'emplacement où la correspondance précédente a pris fin. Quand vous utilisez cette ancre avec la méthode Regex.Matches ou Match.NextMatch, elle vérifie que toutes les correspondances sont contiguës.
it: L'ancoraggio \G specifica che la corrispondenza deve verificarsi nel punto in cui è terminata la corrispondenza precedente. Se usato con il metodo Regex.Matches o Match.NextMatch, questo ancoraggio garantisce che tutte le corrispondenze siano contigue.
ja: \G アンカーは、前回の一致が終了した位置で一致する必要があることを指定します。このアンカーを Regex.Matches メソッドまたは Match.NextMatch メソッドと共に使用すると、すべての一致が連続することになります。
ko: \G 앵커는 이전 일치 항목 찾기가 끝난 지점에서 일치 항목을 찾도록 지정합니다. 이 앵커를 Regex.Matches 또는 Match.NextMatch 메서드와 함께 사용하면 모든 일치 항목이 연속되도록 합니다.
pl: Kotwica \G określa, że dopasowanie musi nastąpić w miejscu zakończenia poprzedniego dopasowania. Jeśli użyjesz tej kotwicy w połączeniu z metodą Regex.Matches lub Match.NextMatch, zapewni ona ciągłość wszystkich dopasowań.
pt_br: A âncora \G especifica que uma correspondência precisa ocorrer no ponto em que a correspondência anterior foi finalizada. Quando você usa essa âncora com o método Regex.Matchs ou Match.NextMatch, ela garante que todas as correspondências sejam contíguas.
ru: Привязка \G указывает, что соответствие должно находиться в том месте, где заканчивается предыдущее соответствие. При использовании этой привязки с методом Regex.Matches или Match.NextMatch она обеспечивает непрерывность всех соответствий.
tr: \G yer işareti, bir eşleşmenin önceki eşleşmenin sona erdiği noktada oluşması gerektiğini belirtir. Bu yer işaretini Regex.Matches veya Match.NextMatch yöntemiyle kullandığınızda, tüm eşleşmelerin bitişik olması sağlanır.
zh_hans: \G 定位点指定匹配必须出现在上一个匹配结束的点。在 Regex.Matches 或 Match.NextMatch 方法中使用此定位点可确保所有匹配项都是连续的。
zh_hant: \G 錨點會指定比對必須出現在前一個比對結束的地方。當您搭配 Regex.Matches 或 Match.NextMatch 方法使用這個錨點時，可以確保比對全都是一個接一個。

# Regex_contiguous_matches_short
source: contiguous matches
cs: souvislá porovnávání
de: Zusammenhängende Übereinstimmungen
es: coincidencias contiguas
fr: correspondances contiguës
it: corrispondenze contigue
ja: 連続した一致
ko: 연속 일치
pl: dopasowania ciągłe
pt_br: correspondências contíguas
ru: непрерывные соответствия
tr: bitişik eşleşmeler
zh_hans: 连续匹配
zh_hant: 連續相符項

# Regex_control_character_long
source: Matches an ASCII control character, where X is the letter of the control character. For example, \cC is CTRL-C.
cs: Shoda s řídicím znakem ASCII, kde X je písmeno řídicího znaku. Například \cC je CTRL-C.
de: Entspricht einem ASCII-Steuerzeichen, wobei "X" der Buchstabe des Steuerzeichens ist. Beispiel: "\cC" steht für STRG-C.
es: Coincide con un carácter de control ASCII, donde X es la letra del carácter de control. Por ejemplo, \cC es CTRL-C.
fr: Correspond au caractère de contrôle ASCII, où X est la lettre du caractère de contrôle. Exemple : \cC est CTRL-C.
it: Trova la corrispondenza di un carattere di controllo ASCII, dove X è la lettera del carattere di controllo. Ad esempio, \cC corrisponde a CTRL+C.
ja: ASCII 制御文字に一致します。X は制御文字の文字です。たとえば、\cC は CTRL-C を表します。
ko: ASCII 제어 문자와 일치시킵니다. 여기서, X는 제어 문자의 문자입니다. 예를 들어 \cC는 CTRL-C입니다.
pl: Pasuje do znaku kontrolnego ASCII, gdzie X jest literą znaku kontrolnego. Na przykład \cC oznacza CTRL-C.
pt_br: Corresponde a um caractere de controle ASCII, em que X é a letra do caractere de controle. Por exemplo, \cC é CTRL-C.
ru: Соответствует управляющему символу ASCII, где X — это буква управляющего символа. Например, \cC — это CTRL-C.
tr: ASCII denetim karakteriyle eşleşir (burada X, denetim karakterinin harfidir). Örneğin, \cC: CTRL-C.
zh_hans: 与 ASCII 控制字符匹配，其中 X 是控制字符的字母。例如, \cC 是 CTRL-C。
zh_hant: 比對 ASCII 控制字元，其中 X 是控制字元的字母。例如 \cC 為 CTRL-C。

# Regex_control_character_short
source: control character
cs: řídicí znak
de: Steuerzeichen
es: carácter de control
fr: caractère de contrôle
it: carattere di controllo
ja: 制御文字
ko: 제어 문자
pl: znak kontrolny
pt_br: caractere de controle
ru: управляющий символ
tr: denetim karakteri
zh_hans: 控制字符
zh_hant: 控制字元

# Regex_decimal_digit_character_long
source: \d matches any decimal digit. It is equivalent to the \p{Nd} regular expression pattern, which includes the standard decimal digits 0-9 as well as the decimal digits of a number of other character sets. If ECMAScript-compliant behavior is specified, \d is equivalent to [0-9]
cs: \d odpovídá libovolné desítkové číslici. Jde o ekvivalent vzoru regulárního výrazu \p{Nd}, který zahrnuje standardní desítkové číslice 0–9 a také desítkové číslice některých jiných znakových sad. Pokud je zadané chování kompatibilní s ECMAScriptem, je \d ekvivalentem [0-9].
de: "\d" entspricht einer beliebigen Dezimalzahl. Identisch mit dem Muster für reguläre Ausdrücke "\p{Nd}", welches die Standarddezimalzahlen 0–9 sowie die Dezimalzahlen einer Reihe anderer Zeichensätze enthält. Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\d" gleichbedeutend mit "[0-9]".
es: \d corresponde a cualquier dígito decimal. Equivale al patrón de expresión regular \P{Nd}, que incluye los dígitos decimales estándar 0-9, así como los dígitos decimales de otros conjuntos de caracteres. Si se especifica un comportamiento compatible con ECMAScript, \d equivale a [0-9]
fr: \d correspond à n'importe quel chiffre décimal. Il est équivalent au modèle d'expression régulière \p{Nd}, qui inclut les chiffres décimaux standard allant de 0 à 9 ainsi que les chiffres décimaux d'un certain nombre d'autres jeux de caractères. Si vous spécifiez un comportement conforme à ECMAScript, \d équivaut à [0-9]
it: \d trova la corrispondenza di qualsiasi cifra decimale. Equivale al criterio di ricerca di espressioni regolari \p{Nd}, che include le cifre decimali standard da 0 a 9 e le cifre decimali di altri set di caratteri. Se viene specificato il comportamento conforme a ECMAScript, \d equivale a [0-9]
ja: \d は任意の 10 進数に一致します。標準 10 進数の 0-9 とその他の文字セットの 10 進数を含む \p{Nd} 正規表現パターンに相当します。 ECMAScript 準拠の動作が指定されている場合、\d は [0-9] と同等です
ko: \d는 10진수와 일치시킵니다. 표준 10진수 0-9와 여러 다른 문자 집합의 10진수를 포함한 \p{Nd} 정규식 패턴과 같습니다. ECMAScript 규격 동작을 지정한 경우 \d는 [0-9]와 같습니다.
pl: Element \d pasuje do dowolnej cyfry dziesiętnej. Jest to równoważnik wzorca wyrażenia regularnego \p{Nd}, który obejmuje standardowe cyfry dziesiętne 0-9 oraz cyfry dziesiętne pewnych innych zestawów znaków. Jeśli zostanie określone zachowanie zgodne ze standardem ECMAScript, element \d jest równoważny elementowi [0-9].
pt_br: \d corresponde a qualquer dígito decimal. Equivale ao padrão de expressão regular \p{Nd}, que inclui os dígitos decimais padrão 0 a 9, bem como os dígitos decimais de vários outros conjuntos de caracteres. Se o comportamento em conformidade com o ECMAScript for especificado, \d será equivalente a [0-9]
ru: \d соответствует любой десятичной цифре. Это эквивалент шаблона регулярного выражения \p{Nd}, который включает в себя стандартные десятичные цифры 0–9, а также десятичные цифры из ряда других наборов символов. Если указано поведение, соответствующее ECMAScript, \d является эквивалентом [0–9].
tr: \d herhangi bir ondalık sayıyla eşleşir. Bu karakter, diğer birkaç karakter kümesinin ondalık sayılarının yanı sıra standart 0-9 ondalık sayılarının dahil olduğu \p{Nd} normal ifade deseniyle eşdeğerdir. ECMAScript uyumlu davranış belirtilmişse, \d [0-9] ile eşdeğerdir
zh_hans: \d 匹配任何十进制数字。它等效于 \p{Nd} 正则表达式模式，该模式包括标准十进制数字 0-9 以及许多其他字符集的小数位数。 如果指定了符合 ECMAScript 的行为，则 \d 等效于 [0-9]
zh_hant: \d 符合所有十進位數字。其相當於 \p{Nd} 規則運算式模式，其中包含標準十進位數字 0-9，以及一些其他字元集的十進位數字。 如果有指定符合 ECMAScript 規範的行為，則 \d 相當於 [0-9]

# Regex_decimal_digit_character_short
source: decimal-digit character
cs: znak desítkové číslice
de: Dezimalzahl
es: carácter de dígito decimal
fr: caractère de chiffre décimal
it: carattere di cifra decimale
ja: 10 進数の文字
ko: 10진수 문자
pl: znak cyfry dziesiętnej
pt_br: caractere de dígito decimal
ru: символ десятичной цифры
tr: ondalık sayı karakteri
zh_hans: 十进制数字字符
zh_hant: 十進位數字字元

# Regex_end_of_line_comment_long
source: A number sign (#) marks an x-mode comment, which starts at the unescaped # character at the end of the regular expression pattern and continues until the end of the line. To use this construct, you must either enable the x option (through inline options) or supply the RegexOptions.IgnorePatternWhitespace value to the option parameter when instantiating the Regex object or calling a static Regex method.
cs: Symbol čísla (#) označuje komentář v režimu X, který začíná znakem #, který není řídicím znakem, na konci vzoru regulárního výrazu a pokračuje do konce řádku. Pokud chcete použít tento konstruktor, musíte buď povolit možnost x (prostřednictvím vložených možností), nebo při vytváření instance objektu Regex nebo volání statické metody Regex zadat pro parametr možnosti hodnotu RegexOptions.IgnorePatternWhitespace.
de: Ein Nummernzeichen (#) markiert einen Kommentar im x-Modus, der am Ende des Musters für reguläre Ausdrücke bei dem #-Zeichen ohne Escapezeichen beginnt und bis zum Zeilenende fortgesetzt wird. Um dieses Konstrukt zu verwenden, müssen Sie entweder die x-Option (über Inlineoptionen) aktivieren oder den RegexOptions.IgnorePatternWhitespace-Wert beim Instanziieren des Regex-Objekts oder beim Aufrufen einer statischen Regex-Methode an den Optionsparameter übergeben.
es: Un signo de número (#) marca un comentario en modo x, que comienza en el carácter # sin escape al final del patrón de expresión regular y continúa hasta el final de la línea. Para usar esta construcción, debe habilitar la opción x (mediante opciones en línea) o proporcionar el valor RegexOptions.IgnorePatternWhitespace al parámetro option al crear una instancia del objeto Regex o llamar a un método estático Regex.
fr: Le signe dièse (#) marque un commentaire en mode x, qui commence au caractère # sans séquence d'échappement, à la fin du modèle d'expression régulière, et se poursuit jusqu'à la fin de la ligne. Pour utiliser cette construction, vous devez activer l'option x (via les options incluses) ou indiquer la valeur de RegexOptions.IgnorePatternWhitespace au paramètre d'option durant l'instanciation de l'objet Regex ou l'appel d'une méthode Regex statique.
it: Un cancelletto (#) contrassegna un commento in modalità x, che inizia in corrispondenza del carattere senza escape # alla fine del criterio di ricerca di espressioni regolari e continua fino alla fine della riga. Per usare questo costrutto, è necessario abilitare l'opzione x (con opzioni inline) o specificare il valore RegexOptions.IgnorePatternWhitespace per il parametro option quando si crea l'istanza dell'oggetto Regex o si chiama un metodo statico Regex.
ja: 番号記号 (#) は、正規表現パターンの最後にあるエスケープされていない # 文字から始まり、行の終わりまで続く x モードのコメントを示します。このコンストラクトを使用するには、Regex オブジェクトをインスタンス化するとき、または静的な Regex メソッドを呼び出すときに、x オプションを有効にする (インライン オプションを使用) か、オプション パラメーターに RegexOptions.IgnorePatternWhitespace 値を指定する必要があります。
ko: 숫자 기호(#)는 정규식 패턴의 끝에 있는 이스케이프되지 않은 # 문자에서 시작하고 줄의 끝까지 계속되는 x-모드 주석을 표시합니다. 이 구문을 사용하려면 인라인 옵션을 통해 x 옵션을 사용해야 합니다. 또는 Regex 개체를 인스턴스화하거나 정적 Regex 메서드를 호출할 때 RegexOptions.IgnorePatternWhitespace 값을 옵션 매개 변수에 제공해야 합니다.
pl: Znak numeru (#) oznacza komentarz w trybie x, który zaczyna się od znaku # bez zmiany znaczenia na końcu wzorca wyrażenia regularnego i jest kontynuowany do końca wiersza. Aby użyć tej konstrukcji, należy włączyć opcję x (za pośrednictwem opcji w tekście) lub podać wartość RegexOptions.IgnorePatternWhitespace w parametrze opcji podczas tworzenia wystąpienia obiektu Regex lub wywoływania metody statycznej obiektu Regex.
pt_br: Um sinal de número (#) marca um comentário de modo x, que começa no caractere # sem escape no final do padrão de expressão regular e continua até o fim da linha. Para usar esse constructo, habilite a opção x (por meio de opções embutidas) ou forneça o valor de RegexOptions.IgnorePatternWhitespace para o parâmetro de opção ao criar a instância do objeto Regex ou chamar um método Regex estático.
ru: Символ решетки (#) помечает комментарий x-mode, который начинается с неэкранированного символа # в конце шаблона регулярного выражения и продолжается до конца строки. Чтобы использовать эту конструкцию, нужно либо включить параметр x (посредством встроенных параметров), либо указать значение RegexOptions.IgnorePatternWhitespace для параметра option при создании экземпляра объекта Regex или вызове статического метода Regex.
tr: Bir sayı işareti (#) normal ifade deseninin sonunda kaçışsız # karakterden başlayan ve satırın sonuna kadar devam eden x-mode açıklamasını işaretler. Bu yapıyı kullanmak için, Regex nesnesinin örneği oluşturulurken ya da statik bir Regex yöntemi çağrılırken (satır içi seçenekler aracılığıyla) x seçeneğini etkinleştirmeniz veya seçenek parametresine RegexOptions.IgnorePatternWhitespace değerini sağlamanız gerekir.
zh_hans: 数字符号(#)标记 x 模式注释，该注释从正则表达式模式结尾处的非转义 # 字符开始，一直持续到行尾。若要使用此构造，必须启用 x 选项(通过内联选项)，或者在实例化 regex 对象或调用静态 regex 方法时向选项参数提供 RegexOptions 值。
zh_hant: 數字記號 (#) 會標記 x 模式註解，其會從規則運算式模式結尾的未逸出 # 字元開始，並繼續直到行結束為止。如果要使用此建構，您必須啟用 x 選項 (透過內嵌選項)，或於具現化 Regex 物件或呼叫靜態 Regex 方法時提供 RegexOptions.IgnorePatternWhitespace 值給選項參數。

# Regex_end_of_line_comment_short
source: end-of-line comment
cs: komentář na konci řádku
de: Kommentar am Zeilenende
es: comentario de fin de línea
fr: commentaire de fin de ligne
it: commento di fine riga
ja: 行末コメント
ko: 줄의 끝 주석
pl: komentarz na końcu wiersza
pt_br: comentário de fim da linha
ru: комментарий в конце строки
tr: satır sonu açıklaması
zh_hans: 行尾注释
zh_hant: 行結尾註解
