Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# sortable_date_time_description
source: The "s" standard format specifier represents a custom date and time format string that is defined by the DateTimeFormatInfo.SortableDateTimePattern property. The pattern reflects a defined standard (ISO 8601), and the property is read-only. Therefore, it is always the same, regardless of the culture used or the format provider supplied. The custom format string is "yyyy'-'MM'-'dd'T'HH':'mm':'ss". The purpose of the "s" format specifier is to produce result strings that sort consistently in ascending or descending order based on date and time values. As a result, although the "s" standard format specifier represents a date and time value in a consistent format, the formatting operation does not modify the value of the date and time object that is being formatted to reflect its DateTime.Kind property or its DateTimeOffset.Offset value. For example, the result strings produced by formatting the date and time values 2014-11-15T18:32:17+00:00 and 2014-11-15T18:32:17+08:00 are identical. When this standard format specifier is used, the formatting or parsing operation always uses the invariant culture.
cs: Specifikátor standardního formátu s představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.SortableDateTimePattern. Vzor dodržuje definovaný standard (ISO 8601) a vlastnost je určená jen pro čtení. Proto je vždy stejná, bez ohledu na používanou jazykovou verzi nebo zadaného poskytovatele formátu. Řetězec vlastního formátu je yyyy'-'MM'-'dd'T'HH':'mm':'ss. Účelem specifikátoru formátu s je vytvořit výsledné řetězce, které budou konzistentně seřazené vzestupně nebo sestupně podle hodnot data a času. Z toho důvodu operace formátování neupraví hodnotu formátovaného objektu data a času tak, aby odrážela vlastnost DateTime.Kind nebo její vlastnost DateTimeOffset.Offset, i když specifikátor standardního formátu s představuje hodnotu data a času v konzistentním formátu. Například výsledné řetězce vytvořené formátováním hodnot data a času 2014-11-15T18:32:17+00:00 a 2014-11-15T18:32:17+08:00 jsou totožné. Když se tento specifikátor standardního formátu použije, operace formátování nebo parsování vždy použije invariantní jazykovou verzi.
de: Der Standardformatbezeichner "s" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.SortableDateTimePattern-Eigenschaft definiert wird. Das Muster folgt einem definierten Standard (ISO 8601), und die Eigenschaft ist schreibgeschützt. Daher ist sie immer gleich, unabhängig von der verwendeten Kultur oder dem angegebenen Formatanbieter. Die benutzerdefinierte Formatzeichenfolge lautet "yyyy'-'MM'-'dd'T'HH':'mm':'ss". Der Zweck des Formatbezeichners "s" besteht darin, Ergebniszeichenfolgen zu erzeugen, die basierend auf Datums- und Uhrzeitwerten konsistent in aufsteigender oder absteigender Reihenfolge sortiert werden. Obwohl der Standardformatbezeichner "s" einen Datums- und Uhrzeitwert in einem konsistenten Format repräsentiert, wird der Wert des zu formatierenden Objekts für Datum und Uhrzeit bei der Formatierung nicht geändert, um die zugehörige DateTime.Kind-Eigenschaft oder den zugehörigen DateTimeOffset.Offset-Wert widerzuspiegeln. Beispielsweise sind die Ergebniszeichenfolgen, die bei Formatierung der Datums- und Uhrzeitwerte 2014-11-15T18:32:17+00:00 und 2014-11-15T18:32:17+08:00 generiert werden, identisch. Bei Verwendung dieses Standardformatbezeichners wird zur Formatierung oder Analyse immer die invariante Kultur verwendet.
es: El especificador de formato estándar "s" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.SortableDateTimePattern. El patrón refleja un estándar definido (ISO 8601) y la propiedad es de solo lectura. Por lo tanto, siempre es el mismo, independientemente de la referencia cultural utilizada o del proveedor de formato proporcionado. La cadena de formato personalizado es "yyyy'-'MM'-'dd'T'HH':'mm':'ss". La finalidad del especificador de formato "s" es producir cadenas de resultados que se ordenen coherentemente de forma ascendente o descendente según los valores de fecha y hora. Como resultado, aunque el especificador de formato estándar "s" representa un valor de fecha y hora en un formato coherente, la operación de formato no modifica el valor del objeto de fecha y hora al que se está dando formato para reflejar su propiedad DateTime.Kind o DateTimeOffset.Offset. Por ejemplo, las cadenas de resultados generadas por el formato de los valores de fecha y hora 2014-11-15T18:32:17+00:00 y 2014-11-15T18:32:17+08:00 son idénticas. Cuando se usa este especificador de formato estándar, la operación de formato o análisis utiliza siempre la referencia cultural invariable.
fr: Le spécificateur de format standard "s" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.SortableDateTimePattern. Le modèle reflète une norme définie (ISO 8601), et la propriété est en lecture seule. Elle est donc toujours identique, quelle que soit la culture utilisée ou le fournisseur de format indiqué. La chaîne de format personnalisée est "yyyy'-'MM'-'dd'T'HH':'mm':'ss". Le spécificateur de format "s" a pour but de produire des chaînes triées de manière cohérente dans l'ordre croissant ou décroissant en fonction des valeurs de date et d'heure. Ainsi, bien que le spécificateur de format standard "s" représente une valeur de date et d'heure dans un format cohérent, l'opération qui consiste à appliquer un format ne modifie pas la valeur de l'objet de date et d'heure visé pour refléter sa propriété DateTime.Kind ou sa valeur DateTimeOffset.Offset. Par exemple, les chaînes qui résultent de l'application du format souhaité aux valeurs de date et d'heure 2014-11-15T18:32:17+00:00 et 2014-11-15T18:32:17+08:00 sont identiques. Quand ce spécificateur de format standard est utilisé, l'opération qui consiste à appliquer un format ou à exécuter une analyse utilise toujours la culture invariante.
it: L'identificatore di formato standard "s" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.SortableDateTimePattern corrente. Lo schema rispecchia uno standard definito (ISO 8601) e la proprietà è di sola lettura. Sarà quindi sempre lo stesso, indipendentemente dalle impostazioni cultura usate o dal provider di formato specificato. La stringa di formato personalizzata è "yyyy'-'MM'-'dd'T'HH':'mm':'ss". L'identificatore di formato "s" ha lo scopo di produrre stringhe di risultati organizzate coerentemente in ordine crescente o decrescente, in base ai valori di data e ora. Di conseguenza, anche se l'identificatore di formato standard "s" rappresenta un valore di data e ora in un formato coerente, l'operazione di formattazione non modifica il valore dell'oggetto data e ora che viene formattato per rispecchiare la proprietà DateTime.Kind o il valore DateTimeOffset.Offset corrispondente. Ad esempio, le stringhe di risultati generate dalla formattazione dei valori di data e ora 2014-11-15T18:32:17+00:00 e 2014-11-15T18:32:17+08:00 sono identiche. Quando si usa questo identificatore di formato standard, la formattazione o l'operazione di analisi usa sempre le impostazioni cultura inglese non dipendenti da paese/area geografica.
ja: "s" 標準書式指定子は、DateTimeFormatInfo.SortableDateTimePattern プロパティで定義されているカスタム日時書式設定文字列を表します。このパターンには、定義済みの標準 (ISO 8601) が反映されています。また、プロパティは読み取り専用です。したがって、使用されているカルチャまたは指定された書式プロバイダーに関係なく、これは常に同じになります。カスタム書式設定文字列は、"yyyy'-'MM'-'dd'T'HH':'mm':'ss" です。 "s" 書式指定子の目的は、書式設定後の文字列が、日付と時刻の値に基づいて、一貫して昇順または降順に並べ替えられるようにすることです。そのため、"s" 標準書式指定子は、一貫性のある形式で日付と時刻の値を表しますが、書式設定操作によって、書式設定の対象となる日付と時刻のオブジェクトの値が、DateTime.Kind プロパティまたは DateTimeOffset.Offset プロパティを反映するために変更されることはありません。たとえば、2014-11-15T18:32:17+00:00 日時値と 2014-11-15T18:32:17+08:00 日時値を書式設定すると、同じ文字列が生成されます。 この標準書式指定子が使用されている場合、書式設定操作または解析操作では常にインバリアント カルチャが使用されます。
ko: "s" 표준 형식 지정자는 DateTimeFormatInfo.SortableDateTimePattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 패턴은 정의된 표준(ISO 8601)을 반영하며, 속성은 읽기 전용입니다. 따라서 사용된 문화권이나 지정된 형식 공급자와 관계없이 항상 동일합니다. 사용자 지정 형식 문자열은 "yyyy'-'MM'-'dd'T'HH':'mm':'ss"입니다. "s" 형식 지정자의 목표는 날짜 및 시간 값을 기준으로 일관성 있게 오름차순 또는 내림차순으로 정렬되는 결과 문자열을 생성하는 것입니다. 그 결과 "s" 표준 형식 지정자는 일관성 있는 형식으로 날짜 및 시간 값을 나타내긴 하지만 형식 지정 연산은 형식 지정 대상인 날짜 및 시간 개체가 그 DateTime.Kind 속성 또는 DateTimeOffset.Offset 값을 반영하도록 수정하지 않습니다. 예를 들어, 날짜 및 시간 값 2014-11-15T18:32:17+00:00과 2014-11-15T18:32:17+08:00의 형식을 지정하여 생성되는 결과 문자열은 동일합니다. 이 표준 형식 지정자를 사용하면 형식 지정 또는 구문 분석 연산에서 항상 고정 문화권이 사용됩니다.
pl: Standardowy specyfikator formatu „s” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.SortableDateTimePattern. Wzorzec odpowiada zdefiniowanemu standardowi (ISO 8601), a właściwość jest tylko do odczytu. Dlatego jest zawsze taki sam niezależnie od użytej kultury lub określonego dostawcy formatu. Niestandardowy ciąg formatu to „yyyy'-'MM'-'dd'T'HH':'mm':'ss”. Specyfikator formatu „s” jest przeznaczony do tworzenia ciągów wyniku, które można spójnie sortować w kolejności rosnącej lub malejącej na podstawie wartości daty i godziny. Dlatego mimo że standardowy specyfikator formatu „s” reprezentuje wartość daty i godziny w spójnym formacie, operacja formatowania nie modyfikuje wartości formatowanego obiektu daty i godziny w celu odzwierciedlenia jego właściwości DateTime.Kind lub wartości DateTimeOffset.Offset. Na przykład ciągi wyniku generowane przez formatowanie wartości daty i godziny 2014-11-15T18:32:17+00:00 oraz 2014-11-15T18:32:17+08:00 są identyczne. Gdy jest używany ten standardowy specyfikator formatu, operacja formatowania lub analizowania zawsze używa kultury niezmiennej.
pt_br: O especificador de formato padrão "s" representa uma cadeia de caracteres de formato personalizado de data e hora que é definida pela propriedade DateTimeFormatInfo.SortableDateTimePattern. O padrão reflete um padrão definido (ISO 8601) e a propriedade é somente leitura. Portanto, é sempre o mesmo, independentemente da cultura usada ou do provedor de formato fornecido. A cadeia de caracteres de formato personalizado é "yyyy'-'MM'-'dd'T'HH':'mm':'ss". O objetivo do especificador de formato "s" é produzir cadeias de caracteres de resultado que são classificadas consistentemente em ordem crescente ou decrescente com base nos valores de data e hora. Como resultado, embora o especificador de formato padrão "s" represente um valor de data e hora em um formato consistente, a operação de formatação não modifica o valor do objeto de data e hora que está sendo formatado para refletir sua propriedade DateTime.Kind ou seu valor DateTimeOffset.Offset. Por exemplo, as cadeias de caracteres de resultado produzidas pela formatação dos valores de data e hora 2014-11-15T18:32:17+00:00 e 2014-11-15T18:32:17+08:00 são idênticas. Quando esse especificador de formato padrão é usado, a operação de análise ou formatação sempre usa a cultura invariável.
ru: Описатель стандартного формата "s" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.SortableDateTimePattern. Шаблон отражает определенный стандарт (ISO 8601), а само свойство доступно только для чтения. Таким образом, данное значение всегда одинаково, независимо от используемых языка и региональных параметров или от указанного поставщика формата. Строка пользовательского формата имеет вид "yyyy'-'MM'-'dd'T'HH':'mm':'ss". Описатель формата "s" предназначен для получения результирующих строк, которые согласованным образом сортируются по возрастанию или убыванию на основе значений даты и времени. В результате, хотя описатель стандартного формата "s" представляет значение даты и времени в согласованном формате, операция форматирования не изменяет значение объекта даты и времени, которое форматируется, чтобы отразить его свойство DateTime.Kind или его значение DateTimeOffset.Offset. Например, результирующие строки, полученные при форматировании значений даты и времени 2014-11-15T18:32:17+00:00 и 2014-11-15T18:32:17+08:00, идентичны. Когда используется этот описатель стандартного формата, операция форматирования или анализа всегда использует инвариантные язык и региональные параметры.
tr: "s" standart biçim belirticisi, DateTimeFormatInfo.SortableDateTimePattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Desen, tanımlı bir standardı (ISO 8601) yansıtır ve özellik salt okunurdur. Bu nedenle, kullanılan kültür veya girilen biçim sağlayıcısı ne olursa olsun her zaman aynıdır. Özel biçim dizesi "yyyy'-'MM'-'dd'T'HH':'mm':'ss" şeklindedir. "s" biçim belirticisinin amacı, tarih ve saat değerlerine göre tutarlı olarak artan veya azalan düzende sıralanan sonuç dizeleri üretmelidir. Bu nedenle "s" standart biçim belirticisi bir tarih ve saat değerini tutarlı bir biçimde temsil etse de biçimlendirme işlemi biçimlendirilmekte olan tarih ve saat nesnesinin değerini nesnenin DateTime.Kind özelliğini veya DateTimeOffset.Offset değerini yansıtacak şekilde değiştirmez. Örneğin, 2014-11-15T18:32:17+00:00 ve 2014-11-15T18:32:17+08:00 tarih ve saat değerleri biçimlendirilerek oluşturulan sonuç dizeleri aynıdır. Bu standart biçim belirticisi kullanıldığında, biçimlendirme veya ayrıştırma işlemi her zaman sabit kültürü kullanır.
zh_hans: "s" 标准格式说明符表示由 DateTimeFormatInfo.SortableDateTimePattern 属性定义的自定义日期和时间格式字符串。该模式反映已定义的标准(ISO 8601)，并且该属性是只读的。因此，无论使用何种区域性或提供格式提供程序，它始终是相同的。自定义格式字符串为 "yyyy'-'MM'-'dd'T'HH':'mm':'ss"。 "s" 格式说明符的用途是生成结果字符串，该字符串根据日期和时间值以升序或降序顺序进行排序。因此，尽管 "s" 标准格式说明符以一致的格式表示日期和时间值，但该格式设置操作不会修改设置为反映其 DateTime.Kind 属性或其 DateTimeOffset.Offset 值的 date 和 time 对象的值。例如，通过设置日期和时间值(2014-11-15T18:32:17+00:00 和 2014-11-15T18:32:17+08:00)的格式生成的结果字符串是相同的。 使用此标准格式说明符时，格式设置或分析操作始终使用固定区域性。
zh_hant: "s" 標準格式規範代表由 DateTimeFormatInfo.SortableDateTimePattern 屬性所定義的自訂日期和時間格式字串。此模式會反映出已定義的標準 (ISO 8601)，且屬性為唯讀。因此，不管使用何種文化特性 (Culture) 或提供何種格式提供者，其永遠都相同。自訂格式字串為 "yyyy'-'MM'-'dd'T'HH':'mm':'ss"。 "s" 格式規範的用途為產生依日期和時間值一致地遞增或遞減排序的結果字串。因此，儘管 "s" 標準格式規範以一致的格式表示日期和時間值，但格式化作業並不會修改要格式化的日期和時間物件值，以反映其 DateTime.Kind 屬性或其 DateTimeOffset.Offset 值。例如，將日期和時間值 2014-11-15T18:32:17+00:00 和 2014-11-15T18:32:17+08:00 格式化所產生的結果字串會完全相同。 使用此標準格式規範時，格式化或剖析作業永遠不因文化特性而異。

source: static constructor
cs: statický konstruktor
de: statischer Konstruktor
es: constructor estático
it: costruttore statico
ja: 静的コンストラクター
ko: 정적 생성자
pl: konstruktor statyczny
pt_br: construtor estático
ru: статический конструктор
tr: statik oluşturucu
zh_hans: 静态构造函数

source: struct
cs: struktura
de: Struktur
es: estructura
ja: 構造体
ko: 구조체
pl: struktura
ru: структура
tr: 'Salt okunur yapı' tercihlerini uygula
zh_hans: 结构

source: 'symbol' cannot be a namespace.
cs: 'Symbol nemůže být obor názvů.
de: '"symbol" kann kein Namespace sein.
es: 'símbolo' no puede ser un espacio de nombres.
fr: 'symbol' ne peut pas être un espace de noms.
it: 'L'elemento 'symbol' non può essere uno spazio dei nomi.
ja: 'symbol' は名前空間にすることはできません。
ko: '기호'는 네임스페이스일 수 없습니다.
pl: 'Element „symbol” nie może być przestrzenią nazw.
pt_br: "símbolo" não pode ser um namespace.
ru: '"символ" не может быть пространством имен.
tr: 'symbol' bir ad alanı olamaz.
zh_hans: '“symbol” 不能为命名空间。
zh_hant: 'symbol' 不可為命名空間。

# symbol_kind_and_name_of_member_kind_and_name
source: {0} '{1}' of {2} '{3}'
cs: {0} {1} z celkového počtu {2} {3}
de: {0} "{1}" von {2} "{3}"
es: {0} '{1}' de {2} '{3}'
it: {0}: {1} di {2} {3}
ja: {2} '{3}' の {0} '{1}'
ko: {2} '{3}' 중 {0} '{1}'
pl: {0} „{1}” z {2} „{3}”
pt_br: {0} '{1}' de {2} '{3}'
ru: {0} ' {1} ' из {2} ' {3} '
zh_hans: {2}“{3}”的{0}“{1}”

source: time separator
cs: oddělovač času
de: Zeittrennzeichen
es: separador de la hora
fr: séparateur d'heure
it: Separatore di ora
ja: 時刻の区切り記号
ko: 시간 구분 기호
pl: separator godziny
pt_br: separador de hora
ru: разделитель компонентов времени
tr: zaman ayırıcısı
zh_hans: 时间分隔符
zh_hant: 時間分隔符號
