Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_non_word_character_long
source: \W matches any non-word character. It matches any character except for those in the following Unicode categories: Ll Letter, Lowercase Lu Letter, Uppercase Lt Letter, Titlecase Lo Letter, Other Lm Letter, Modifier Mn Mark, Nonspacing Nd Number, Decimal Digit Pc Punctuation, Connector If ECMAScript-compliant behavior is specified, \W is equivalent to [^a-zA-Z_0-9]
cs: \W odpovídá jakémukoli znaku, který není znakem slova. Odpovídá libovolnému znaku s výjimkou znaků v následujících kategoriích Unicode: Ll písmeno, malá písmena Lu písmeno, velká písmena Lt písmeno, velká počáteční písmena Lo písmeno, jiné Lm písmeno, modifikátor Mn značka, bez mezer Nd číslo, desítkové číslo Pc interpunkce, spojovník Pokud je zadané chování kompatibilní s ECMAScriptem, je \W ekvivalentem [^a-zA-Z_0-9].
de: "\W" entspricht einem beliebigen Nicht-Wortzeichen. Stimmt mit einem beliebigen Zeichen überein, das nicht in den folgenden Unicode-Kategorien enthalten ist: Ll Buchstabe, Kleinbuchstabe Lu Buchstabe, Großbuchstabe Lt Buchstabe, erster Buchstabe groß Lo Buchstabe, sonstige Lm Buchstabe, Modifizierer Mn Zeichen, Zeichen ohne eigene Breite Nd Zahl, Dezimalzahl Pc Interpunktion, Verbindung Wenn das ECMAScript-konforme Verhalten angegeben wird, ist "\W" gleichbedeutend mit "[^a-zA-Z_0-9]".
es: \W coincide con cualquier carácter que no sea una palabra. Coincide con cualquier carácter excepto los de las siguientes categorías Unicode: Ll Letra, minúscula Lu Letra, mayúscula Lt Letra, tipo título Lo Letra, otros Lm Letra, modificador Mn Marca, no espaciado Nd Número, dígito decimal Pc Puntuación, conector Si se especifica un comportamiento compatible con ECMAScript, \W equivale a [^a-zA-Z_0-9]
fr: \W correspond à un caractère de non-mot. Il correspond à n'importe quel caractère à l'exception de ceux des catégories Unicode suivantes : Ll Lettre, Minuscule Lu Lettre, Majuscule Lt Lettre, Première lettre des mots en majuscule Lo Lettre, Autre Lm Lettre, Modificateur Mn Marque, Sans espacement Nd Nombre, Chiffre décimal Pc Ponctuation, Connecteur Si vous spécifiez un comportement conforme à ECMAScript, \W équivaut à [^a-zA-Z_0-9]
it: \W trova la corrispondenza di qualsiasi carattere non alfabetico. Corrisponde a tutti i caratteri, ad eccezione di quelli inclusi nelle categorie Unicode seguenti: Ll Letter, Lowercase Lu Letter, Uppercase Lt Letter, Titlecase Lo Letter, Other Lm Letter, Modifier Mn Mark, Nonspacing Nd Number, Decimal Digit Pc Punctuation, Connector Se viene specificato il comportamento conforme a ECMAScript, \W equivale a [^a-zA-Z_0-9]
ja: \W は単語以外の文字に一致します。次に示す Unicode カテゴリのものを除く任意の文字と一致します。 Ll 文字、小文字 Lu 文字、大文字 Lt 文字、タイトル文字 Lo 文字、その他 Lm 文字、修飾子 Mn 結合文字、幅なし Nd 数字、10 進数字 Pc 句読点、接続 ECMAScript 準拠の動作が指定されている場合、\W は [^a-zA-Z_0-9] と同等です
ko: \W는 단어가 아닌 문자와 일치시킵니다. 다음 유니코드 범주의 문자를 제외한 모든 문자와 일치시킵니다. Ll 문자, 소문자 Lu 문자, 대문자 Lt 문자, 첫 글자만 대문자 Lo 문자, 기타 Lm 문자, 한정자 Mn 표시, 공간을 차지하지 않는 문자 Nd 숫자, 10진수 Pc 문장 부호, 연결선 ECMAScript 규격 동작을 지정한 경우 \W는 [^a-zA-Z_0-9]와 같습니다.
pl: Element \W pasuje do dowolnego znaku niebędącego częścią słowa. Pasuje do dowolnego znaku z wyjątkiem znaków należących do następujących kategorii Unicode: Ll Litera, mała Lu Litera, wielka Lt Litera, jak nazwy własne Lo Litera, inna Lm Litera, modyfikator Mn Znacznik, nierozdzielający Nd Cyfra, cyfra dziesiętna Pc Interpunkcja, łącznik Jeśli określono zachowanie zgodne ze standardem ECMAScript, element \W jest równoważny elementowi [^a-zA-Z_0-9].
pt_br: \W corresponde a qualquer caractere que não seja uma palavra. Ele corresponde a qualquer caractere, exceto os das categorias Unicode a seguir: Ll Letra, Minúscula Lu Letra, Maiúscula Lt Letra, Inicial Maiúscula Lo Letra, Outro Lm Letra, Modificador Mn Marca, Não Espaçamento Nd Número, Dígito Decimal Pc Pontuação, Conector Se o comportamento em conformidade com o ECMAScript for especificado, \W será equivalente a [^a-zA-Z_0-9]
ru: \W соответствует любому символу, не образующему слово. Он соответствует любому символу, кроме относящихся к следующим категориям Юникода: Ll буква, строчная Lu буква, прописная Lt буква, заглавная Lo буква, другая Lm буква, модификатор Mn метка, без пробела Nd число, десятичная цифра Pc пунктуация, соединитель Если указано поведение, соответствующее ECMAScript, \W является эквивалентом [^a-zA-Z_0-9]
tr: \W sözcük olmayan herhangi bir karakterle eşleşir. Aşağıdaki Unicode kategorilerinde bulunanlar dışındaki herhangi bir karakterle eşleşir: Ll Harf, Küçük Harf Lu Harf, Büyük Harf Lt Harf, İlk Harfler Büyük Lo Harf, Diğer Lm Harf, Değiştirici Mn İşaret, Aralıksız Nd Numara, Ondalık Sayı Pc Noktalama, Bağlayıcı ECMAScript uyumlu davranış belirtilmişse \W, [^a-zA-Z_0-9] ile eşdeğerdir
zh_hans: \w 与任何非字词字符匹配。它匹配除以下 Unicode 类别中的任何字符: Ll 字母，小写 Lu 字母，大写 Lt 字母，首字母大写 Lo 字母，其他 Lm 字母，修饰符 Mn 标记，非间距 Nd 数字，十进制数字 Pc 标点，连接符 如果指定了符合 ECMAScript 的行为，则 \W 等效于 [^a-zA-Z_0-9]
zh_hant: \W 符合所有非字組字元。其符合所有字元，但處於以下 Unicode 分類內的字元除外: Ll 字母，小寫 Lu 字母，大寫 Lt 字母，字首大寫 Lo 字母，其他 Lm 字母，修飾元 Mn 標記，非空格 Nd 數字，十進位數字 Pc 標點符號，接頭 如果有指定符合 ECMAScript 規範的行為，則 \W 相當於 [^a-zA-Z_0-9]

# Regex_non_word_character_short
source: non-word character
cs: znak, který není znakem slova
de: Nicht-Wortzeichen
es: carácter que no es una palabra
fr: caractère de non-mot
it: carattere non alfanumerico
ja: 単語以外の文字
ko: 단어가 아닌 문자
pl: znak nienależący do słowa
pt_br: caractere que não é palavra
ru: символ, не образующий слово
tr: sözcük olmayan karakter
zh_hans: 非字词字符
zh_hant: 非文字字元

# Regex_noncapturing_group_long
source: This construct does not capture the substring that is matched by a subexpression: The noncapturing group construct is typically used when a quantifier is applied to a group, but the substrings captured by the group are of no interest. If a regular expression includes nested grouping constructs, an outer noncapturing group construct does not apply to the inner nested group constructs.
cs: Tento konstruktor nezachycuje dílčí řetězec, který odpovídá dílčímu výrazu: Konstruktor nezachycující skupiny se obvykle používá, když se kvantifikátor aplikuje pro skupinu, ale dílčí řetězce zachycené skupinou uživatele nezajímají. Pokud regulární výraz obsahuje vnořené seskupovací konstruktory, vnější konstruktor nezachycující skupiny se neaplikuje na vnitřní vnořené konstruktory skupiny.
de: Dieses Konstrukt erfasst nicht die Teilzeichenfolge, die mit einem Teilausdruck übereinstimmt: Das Konstrukt der Nicht-Erfassungsgruppe wird normalerweise verwendet, wenn ein Quantifizierer auf eine Gruppe angewendet wird, die von der Gruppe erfassten Teilzeichenfolgen jedoch nicht relevant sind. Wenn ein regulärer Ausdruck geschachtelte Gruppierungskonstrukte enthält, gilt ein äußeres Konstrukt von Nicht-Erfassungsgruppen nicht für die inneren geschachtelten Gruppenkonstrukte.
es: Esta construcción no captura la subcadena que coincide con una subexpresión: La construcción de grupo que no captura se usa normalmente cuando un cuantificador se aplica a un grupo, pero las subcadenas capturadas por el grupo no tienen ningún interés. Si una expresión regular incluye construcciones de agrupación anidadas, una construcción de grupo que no captura externa no se aplica a las construcciones de grupo anidadas internas.
fr: Cette construction ne capture pas la sous-chaîne correspondant à une sous-expression : La construction de groupe sans capture est généralement utilisée quand un quantificateur est appliqué à un groupe, mais que les sous-chaînes capturées par le groupe ne présentent pas d'intérêt. Si une expression régulière inclut des constructions de regroupement imbriqué, une construction de groupe sans capture externe ne s'applique pas aux constructions de groupes imbriqués internes.
it: Questo costrutto non acquisisce la sottostringa corrispondente a una sottoespressione: Il costrutto del gruppo non di acquisizione viene generalmente usato quando un quantificatore è applicato a un gruppo, ma le sottostringhe acquisite dal gruppo non sono di alcun interesse. Se un'espressione regolare include costrutti di raggruppamento annidati, un costrutto del gruppo di non acquisizione esterno non si applica ai costrutti del gruppo annidati interni.
ja: このコンストラクトは、部分式で一致する部分文字列をキャプチャしません: 非キャプチャ グループのコンストラクトは通常、量指定子がグループに適用されても、グループによってキャプチャされた部分文字列が対象にならない場合に使用されます。 正規表現に、入れ子になったグループ化構成体が含まれている場合、外部の非キャプチャ グループ コンストラクトは内部の入れ子になったグループ コンストラクトに適用されません。
ko: 이 구문은 하위 식으로 일치되는 하위 문자열을 캡처하지 않습니다. 한정사가 그룹에 적용되는 경우 일반적으로 비캡처링 그룹 구문이 사용되지만 그룹에서 캡처된 하위 문자열과는 관련이 없습니다. 정규식에 중첩 그룹화 생성자가 포함되는 경우 외부 비캡처링 그룹 구문은 내부 중첩 그룹 구문에 적용되지 않습니다.
pl: Ta konstrukcja nie przechwytuje podciągu dopasowanego przez podwyrażenie: Konstrukcja grupy nieprzechwytującej jest zazwyczaj używana, gdy kwantyfikator stosuje się do grupy, lecz podciągi przechwycone przez grupę mogą zostać zignorowane. Jeśli wyrażenie regularne zawiera zagnieżdżone konstrukcje grupujące, konstrukcja zewnętrznej grupy nieprzechwytującej nie stosuje się do wewnętrznych zagnieżdżonych konstrukcji grup.
pt_br: Este constructo não captura a substring correspondida por uma subexpressão: O constructo do grupo que não é de captura geralmente é usado quando um quantificador é aplicado a um grupo, mas as substrings capturadas pelo grupo não são de interesse. Se uma expressão regular inclui constructos de agrupamento aninhado, um constructo externo de grupo de não captura não se aplica aos constructos internos de grupo aninhado.
ru: Эта конструкция не записывает подстроку, соответствующую части выражения: Конструкция группы без записи обычно используется, когда квантификатор применяется к группе, но подстроки, записанные группой, не представляют интереса. Если регулярное выражение содержит вложенные конструкциb группировки, внешняя конструкция группы без записи не применяется к внутренним вложенным конструкциям группы.
tr: Bu yapı bir alt ifade tarafından eşleştirilen alt dizeyi yakalamaz: Yakalama yapmayan grup yapısı genellikle bir gruba niceleyici uygulandığında kullanılır, ancak grup tarafından yakalanan alt dizelerle ilgilenilmez. Bir normal ifade iç içe gruplama yapıları içeriyorsa, dıştaki yakalama yapmayan grup yapısı içteki iç içe geçmiş grup yapılarına uygulanmaz.
zh_hans: 此构造不捕获由子表达式匹配的子字符串: 在将限定符应用于组时，通常使用非捕获组构造，但组捕获的子字符串不具有任何意义。 如果正则表达式包含嵌套的分组构造，则外部非捕获组构造不适用于内部嵌套的组构造。
zh_hant: 這個建構不會擷取子運算式比對的子字串: 非擷取群組建構通常在數量詞套用到群組時使用，但群組擷取的子字串不會有影響。 若規則運算式包含巢狀群組建構，外部非擷取群組建構就不會套用到內部巢狀群組建構。

# Regex_noncapturing_group_short
source: noncapturing group
cs: nezachycující skupina
de: Nicht-Erfassungsgruppe
es: Grupo que no captura
fr: groupe sans capture
it: gruppo di non acquisizione
ja: 非キャプチャ グループ
ko: 비캡처링 그룹
pl: grupa nieprzechwytująca
pt_br: grupo que não é de captura
ru: группа без записи
tr: yakalama yapmayan grup
zh_hans: 非捕获组
zh_hant: 非擷取群組

# Regex_number_decimal_digit
source: number, decimal digit
cs: číslo, desítkové číslo
de: Zahl, Dezimalzahl
es: número, dígito decimal
fr: nombre, chiffre décimal
it: numerico, cifra decimale
ja: 数字、10 進数字
ko: 숫자, 10진수
pl: cyfra, cyfra dziesiętna
pt_br: número, dígito decimal
ru: число, десятичная цифра
tr: sayı, ondalık sayı
zh_hans: 数字，十进制数字
zh_hant: 數字，十進位數字

# Regex_number_letter
source: number, letter
cs: číslo, písmeno
de: Zahl, Buchstabe
es: número, letra
fr: nombre, lettre
it: numerico, alfanumerico
ja: 数字、文字
ko: 숫자, 문자
pl: cyfra, litera
pt_br: número, letra
ru: число, буква
tr: sayı, harf
zh_hans: 数字，字母
zh_hant: 數字，字母

# Regex_number_other
source: number, other
cs: číslo, jiné
de: Zahl, sonstige
es: número, otro
fr: nombre, autre
it: numerico, altro
ja: 数字、その他
ko: 숫자, 기타
pl: cyfra, inna
pt_br: número, outro
ru: число, другое
tr: sayı, diğer
zh_hans: 数字，其他
zh_hant: 數字，其他

# Regex_numbered_backreference_long
source: A numbered backreference, where 'number' is the ordinal position of the capturing group in the regular expression. For example, \4 matches the contents of the fourth capturing group. There is an ambiguity between octal escape codes (such as \16) and \number backreferences that use the same notation. If the ambiguity is a problem, you can use the \k<name> notation, which is unambiguous and cannot be confused with octal character codes. Similarly, hexadecimal codes such as \xdd are unambiguous and cannot be confused with backreferences.
cs: Číslovaná zpětná reference, kde číslo je pořadové umístění zachycující skupiny v regulárním výrazu. Například \4 odpovídá obsahu čtvrté zachycující skupiny. Existuje nejednoznačnost mezi osmičkovými řídicími kódy (například \16) a zpětnými referencemi \číslo, které používají stejný zápis. Pokud nejednoznačnost způsobuje potíže, můžete použít zápis \k<name>, který je jednoznačný a nedá se zaměnit s osmičkovými kódy znaků. Stejně tak šestnáctkové kódy, například \xdd, jsou jednoznačné a nedají se zaměnit se zpětnými referencemi.
de: Ein nummerierter Rückverweis, wobei "zahl" für die Ordnungsposition der Erfassungsgruppe im regulären Ausdruck steht. Beispiel: \4 entspricht dem Inhalt der vierten Erfassungsgruppe. Es besteht eine Mehrdeutigkeit zwischen den Escapecodes für Oktalzahlen (z. B. \16) und den \zahl-Rückverweisen, die dieselbe Notation verwenden. Wenn die Mehrdeutigkeit ein Problem darstellt, können Sie die \k<name>-Notation verwenden, die eindeutig ist und nicht mit Oktalzeichencodes verwechselt werden kann. Ebenso eindeutig sind hexadezimale Codes wie \xdd, die nicht mit Rückverweisen verwechselt werden können.
es: Una referencia inversa numerada, donde "number" es la posición ordinal del grupo de captura en la expresión regular. Por ejemplo, \4 coincide con el contenido del cuarto grupo de captura. Existe una ambigüedad entre los códigos de escape octales (como \16) y las referencias inversas de \number que usan la misma notación. Si la ambigüedad es un problema, puede utilizar la notación \k<name>, que no es ambigua y no se puede confundir con códigos de caracteres octales. Del mismo modo, los códigos hexadecimales como \xdd son inequívocos y no se pueden confundir con referencias inversas.
fr: Référence arrière numérotée, où 'nombre' représente la position ordinale du groupe de capture dans l'expression régulière. Par exemple, \4 correspond au contenu du quatrième groupe de capture. Il existe une ambiguïté entre les codes d'échappement octaux (par exemple \16) et les références arrière \nnumérotées qui utilisent la même notation. Si l'ambiguïté pose un problème, vous pouvez utiliser la notation \k<nom>, qui est plus claire et qui ne peut pas être confondue avec les codes de caractère octaux. De même, les codes hexadécimaux tels que \xdd ne sont pas ambigus et ne peuvent pas être confondus avec les références arrière.
it: Backreference numerato, in cui 'number' è la posizione ordinale del gruppo di acquisizione nell'espressione regolare. Ad esempio, \4 corrisponde al contenuto del quarto gruppo di acquisizione. È presente un'ambiguità tra i codici di escape ottale, ad esempio \16, e i backreference \number che usano la stessa notazione. Se il problema è dovuto all'ambiguità, è possibile usare la notazione \k<name> che, non essendo ambigua, non può essere confusa con codici di caratteri ottali. Analogamente, i codici esadecimale come \xdd non sono ambigui e non possono essere confusi con backreference.
ja: 番号付き前方参照。ここで、'number' は、正規表現でのキャプチャ グループの位置を表す序数です。たとえば、\4 は 4 番目のキャプチャ グループの内容と一致します。 8 進数エスケープ コード (\16 など) と \number 前方参照は同じ表記を使用するため、あいまいさがあります。あいまいさが問題になる場合は、\k<name> 表記を使用できます。この表記はあいまいさがなく、8 進数文字コードと混同されません。同様に、\xdd などの 16 進数コードはあいまいさがなく、前方参照と混同されません。
ko: 번호가 매겨진 역참조입니다. 여기서 'number'는 정규식에 있는 캡처링 그룹의 서수 위치입니다. 예를 들어 \4는 네 번째 캡처링 그룹의 콘텐츠와 일치시킵니다. 8진수 이스케이프 코드(예: \16) 및 동일한 표기법을 사용하는 \number 역참조 사이에는 모호성이 있습니다. 모호성 문제가 발생하는 경우 명확하며 8진수 문자 코드와 혼동되지 않는 \k<이름> 표기법을 사용할 수 있습니다. 마찬가지로, \xdd와 같은 16진수 코드는 명확하며 역참조와 혼동되지 않습니다.
pl: Numerowane odwołanie wsteczne, gdzie element „numer” to numer kolejny grupy przechwytującej w wyrażeniu regularnym. Na przykład element \4 pasuje do zawartości czwartej grupy przechwytującej. Istnieje niejednoznaczność między ósemkowymi kodami ucieczki (takimi jak \16) i odwołaniami wstecznymi \numer, które używają tej samej notacji. Jeśli niejednoznaczność jest problemem, możesz użyć notacji \k<nazwa>, która jest jednoznaczna i której nie można pomylić z ósemkowymi kodami znaków. Podobnie kody szesnastkowe, takie jak \xdd, są jednoznaczne i nie można ich pomylić z odwołaniami wstecznymi.
pt_br: Uma referência inversa numerada, em que 'number' é a posição ordinal do grupo de captura na expressão regular. Por exemplo, \4 corresponde ao conteúdo do quarto grupo de captura. Há uma ambiguidade entre os códigos de escape octais (como \16) e as referências inversas \number que usam a mesma notação. Se a ambiguidade causar algum problema, use a notação \k<name>, que não é ambígua e não pode ser confundida com códigos de caracteres octais. Da mesma forma, os códigos hexadecimais como \xdd não são ambíguos e não podem ser confundidos com referências inversas.
ru: Нумерованная обратная ссылка, где "номер" — порядковый номер группы записи в регулярном выражении. Например, \4 соответствует содержимому четвертой группы записи. Существует неоднозначность между восьмеричными escape-кодами (например, \16) и обратными ссылками \number, которые используют одну и ту же нотацию. Если подобная неоднозначность является проблемой, можно использовать нотацию \k<name>, которая не является неоднозначной и не может быть перепутана с восьмеричными кодами символов. Аналогичным образом шестнадцатеричные коды, такие как \xdd, не являются неоднозначными и не могут быть перепутаны с обратными ссылками.
tr: 'number' öğesinin normal ifadede yakalama grubunun sıralı konumu olduğu numaralandırılmış bir geri başvuru. Örneğin, \4 dördüncü yakalama grubunun içerikleriyle eşleşir. Sekizlik kaçış kodları (\16 gibi) ile aynı gösterimi kullanan \number geri başvuruları arasında bir belirsizlik vardır. Belirsizlik bir sorun oluşturuyorsa, belirsiz olmayan ve sekizlik karakter kodlarıyla karıştırılamayacak olan \k<name> gösterimini kullanabilirsiniz. Benzer şekilde, \xdd gibi onaltılık kodlar da belirsiz değildir ve geri başvurularla karıştırılamaz.
zh_hans: 一个带编号的向后引用，其中 "number" 是正则表达式中捕获组的序号位置。例如，\4 与第四个捕获组的内容匹配。 八进制转义码(例如 \16) 和使用相同表示法的 \number 向后引用之间存在二义性。如果多义性是一个问题，则可以使用 \k<name> 表示法，该符号是明确的，不能与八进制字符代码混淆。同样，十六进制代码(如 \xdd)是明确的，不能与向后引用混淆。
zh_hant: 編號反向參考，其中 'number' 是擷取群組在規則運算式中的序數位置。舉例來說，\4 符合第四個擷取群組的內容。 如果八進位逸出代碼 (例如 \16) 和 \number 反向參考使用的標記法相同，則會出現模稜兩可的問題。如果模稜兩可的問題會造成麻煩，您可以使用 \k<名稱> 標記法，該標記法較為明確且不會與八進位逸出字元代碼搞混。同樣地，\xdd 等十六進位代碼也相當明確，不會與反向參考搞混。

# Regex_numbered_backreference_short
source: numbered backreference
cs: číslovaná zpětná reference
de: Nummerierter Rückverweis
es: referencia inversa numerada
fr: référence arrière numérotée
it: backreference numerato
ja: 番号付き前方参照
ko: 번호가 매겨진 역참조
pl: numerowane odwołanie wsteczne
pt_br: referência inversa numerada
ru: нумерованная обратная ссылка
tr: numaralandırılmış geri başvuru
zh_hans: 带编号的向后引用
zh_hant: 編號反向參考

# Regex_other_control
source: other, control
cs: jiné, řídicí
de: Sonstige, Steuerelement
es: otro, control
fr: autre, contrôle
it: altro, controllo
ja: その他、制御
ko: 기타, 제어
pl: inne, kontrolne
pt_br: outro, controle
ru: другое, управление
tr: diğer, denetim
zh_hans: 其他，控件
zh_hant: 其他，控制

# Regex_other_format
source: other, format
cs: jiné, formát
de: Sonstige, Format
es: otro, formato
fr: autre, format
it: altro, formato
ja: その他、書式
ko: 기타, 형식
pl: inne, formatujące
pt_br: outro, formato
ru: другой, формат
tr: diğer, biçim
zh_hans: 其他，格式
zh_hant: 其他，格式

# Regex_other_not_assigned
source: other, not assigned
cs: jiné, nepřiřazeno
de: Sonstige, nicht zugewiesen
es: otro, no asignado
fr: autre, non affecté
it: altro, non assegnato
ja: その他、未割り当て
ko: 기타, 할당되지 않음
pl: inne, nieprzypisane
pt_br: outro, não atribuído
ru: другое, не назначено
tr: diğer, atanmamış
zh_hans: 其他，未分配
zh_hant: 其他，未指派

# Regex_other_private_use
source: other, private use
cs: jiné, privátní použití
de: Sonstige, private Nutzung
es: otro, uso privado
fr: autre, usage privé
it: altro, uso privato
ja: その他、プライベート用途
ko: 기타, 프라이빗 사용
pl: inne, użytek prywatny
pt_br: outro, uso privado
ru: другое, частное использование
tr: diğer, özel kullanım
zh_hans: 其他，专用
zh_hant: 其他，私用

# Regex_other_surrogate
source: other, surrogate
cs: jiné, náhradní
de: Sonstige, Ersatzzeichen
es: otro, suplente
fr: autre, substitution
it: altro, surrogato
ja: その他、サロゲート
ko: 기타, 서로게이트
pl: inne, dwuskładnikowe
pt_br: outro, alternativo
ru: другое, суррогат
tr: diğer, vekil
zh_hans: 其他，代理项
zh_hant: 其他，代理

# Regex_positive_character_group_long
source: A positive character group specifies a list of characters, any one of which may appear in an input string for a match to occur.
cs: Pozitivní skupina znaků určuje seznam znaků, z nichž kterýkoli se může objevit ve vstupním řetězci, aby došlo ke shodě.
de: Eine positive Zeichengruppe gibt eine Liste von Zeichen an, von denen jedes in einer Eingabezeichenfolge enthalten sein kann, damit eine Übereinstimmung auftritt.
es: Un grupo de caracteres positivos especifica una lista de caracteres, cualquiera de los cuales puede aparecer en una cadena de entrada para que se produzca una coincidencia.
fr: Un groupe de caractères positif spécifie une liste de caractères, dont l'un d'entre eux peut apparaître dans une chaîne d'entrée pour produire une correspondance.
it: Un gruppo di caratteri positivi specifica un elenco di caratteri che possono essere presenti in una stringa di input per trovare una corrispondenza.
ja: 文字グループの肯定では、いずれかが入力文字列に含まれると一致と見なされる文字の一覧を指定します。
ko: 긍정 문자 그룹은 일치 항목을 찾을 입력 문자열에 표시될 수 있는 문자 목록을 지정합니다.
pl: Pozytywna grupa znaków określa listę znaków, z których dowolny może się pojawić się w ciągu wejściowym, aby nastąpiło dopasowanie.
pt_br: Um grupo de caracteres positivos especifica uma lista de caracteres, em que qualquer um deles pode aparecer em uma cadeia de caracteres de entrada para que uma correspondência ocorra.
ru: Положительная группа символов задает список символов, любой из которых может выводиться во входной строке для выполняемого сопоставления.
tr: Pozitif bir karakter grubu, herhangi biri bir eşleşme olması için giriş dizesinde görünebilir bir karakter listesini belirtir.
zh_hans: 正字符组指定字符列表，其中的任何一个字符都可能出现在输入字符串中，以使匹配发生。
zh_hant: 正的字元群組會指定字元清單，其中的任一字元都可能會出現在輸入字串中，以便比對發生。

# Regex_positive_character_group_short
source: positive character group
cs: pozitivní skupina znaků
de: Positive Zeichengruppe
es: grupo de caracteres positivos
fr: groupe de caractères positif
it: gruppo di caratteri positivi
ja: 文字グループの肯定
ko: 긍정 문자 그룹
pl: pozytywna grupa znaków
pt_br: grupo de caracteres positivos
ru: положительная группа символов
tr: pozitif karakter grubu
zh_hans: 正字符组
zh_hant: 正值字元群組
