Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Deleting {0} requires restarting the application because is not supported by the runtime.
cs: Odstranění {0} vyžaduje restartování aplikace, protože není podporováno modulem runtime.
de: Das Löschen von {0} erfordert einen Neustart der Anwendung, da es von der Laufzeit nicht unterstützt wird.
es: Para eliminar {0} se requiere reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Se si elimina {0}, è necessario riavviare l'applicazione perché l'operazione non è supportata dal runtime.
ja: ランタイムでサポートされていないため、{0} を削除するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 {0}을(를) 삭제하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Usunięcie {0} wymaga ponownego uruchomienia aplikacji, ponieważ nie jest to obsługiwane przez środowisko uruchomieniowe.
pt_br: A exclusão do {0} requer a reinicialização do aplicativo porque não é compatível com o tempo de execução.
ru: Для удаления {0} требуется перезапустить приложение, поскольку удаление не поддерживается средой выполнения.
tr: {0} öğesini silmek, çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 删除 {0} 需要重新启动应用程序，因为不受运行时支持。

source: Directives from '{0}'
cs: Direktivy z {0}
de: Richtlinien von '{0}'
es: Directivas de '{0}'
it: Direttive da '{0}'
ja: '{0}' からのディレクティブ
ko: '{0}'의 지시문
pl: Dyrektywy z „{0}”
pt_br: Diretrizes de '{0}'
ru: Директивы из "{0}"
tr: '{0}' yönergeleri
zh_hans: 来自'{0}'的指令

source: Dismiss
cs: Zavřít
es: Descartar
ko: 해제
pl: Odrzuć
pt_br: Ignorar
ru: Отклонить
tr: Kapat
zh_hans: 消除

source: Do not change this code. Put cleanup code in '{0}' method
de: Ändern Sie diesen Code nicht. Fügen Sie Bereinigungscode in der Methode "{0}" ein.
fr: Ne changez pas ce code. Placez le code de nettoyage dans la méthode '{0}'
it: Non modificare questo codice. Inserire il codice di pulizia nel metodo '{0}'
ja: このコードを変更しないでください。クリーンアップ コードを '{0}' メソッドに記述します
zh_hans: 不要更改此代码。请将清理代码放入“{0}”方法中
zh_hant: 請勿變更此程式碼。請將清除程式碼放入 '{0}' 方法

# DocumentIsOutOfSyncWithDebuggee
source: The current content of source file '{0}' does not match the built source. Any changes made to this file while debugging won't be applied until its content matches the built source.
cs: Aktuální obsah zdrojového souboru {0} se neshoduje se sestaveným zdrojem. Případné změny provedené v tomto souboru během ladění se nepoužijí, dokud se jeho obsah nebude shodovat se sestaveným zdrojem.
de: Der aktuelle Inhalt der Quelldatei "{0}" stimmt nicht mit dem kompilierten Quellcode überein. Alle Änderungen, die während des Debuggens an dieser Datei vorgenommen wurden, werden erst angewendet, wenn der Inhalt dem kompilierten Quellcode entspricht.
es: El contenido actual del archivo de código fuente "{0}" no coincide con el del código fuente compilado, así que los cambios realizados en este archivo durante la depuración no se aplicarán hasta que coincida.
fr: Le contenu actuel du fichier source '{0}' ne correspond pas à la source générée. Les changements apportés à ce fichier durant le débogage ne seront pas appliqués tant que son contenu ne correspondra pas à la source générée.
it: Il contenuto corrente del file di origine '{0}' non corrisponde al codice sorgente compilato. Tutte le modifiche apportate a questo file durante il debug non verranno applicate finché il relativo contenuto non corrisponde al codice sorgente compilato.
ja: ソース ファイル '{0}' の現在のコンテンツが、ビルドされたソースと一致しません。デバッグ中にこのファイルに加えられた変更は、そのコンテンツがビルドされたソースと一致するまで適用されません。
ko: 소스 파일 '{0}'의 현재 콘텐츠가 빌드된 소스와 일치하지 않습니다. 디버그하는 동안 이 파일의 변경된 모든 내용은 해당 콘텐츠가 빌드된 소스와 일치할 때까지 적용되지 않습니다.
pl: Bieżąca zawartość pliku źródłowego „{0}” nie pasuje do skompilowanego źródła. Wszystkie zmiany wprowadzone w tym pliku podczas debugowania nie zostaną zastosowane do czasu, aż jego zawartość będzie zgodna ze skompilowanym źródłem.
pt_br: O conteúdo atual do arquivo de origem '{0}' não corresponde à origem criada. Todas as alterações feitas neste arquivo durante a depuração não serão aplicadas até que o conteúdo corresponda à origem criada.
ru: Текущее содержимое исходного файла "{0}" не соответствует созданному источнику. Все изменения, внесенные в этот файл во время отладки, не будут применены, пока содержимое файла не будет соответствовать созданному источнику.
tr: '{0}' kaynak dosyasının geçerli içeriği, derlenen kaynakla eşleşmiyor. Hata ayıklama işlemi sırasında bu dosyada yapılan değişiklikler, dosyanın içeriği derlenen kaynakla eşleşene kadar uygulanmaz.
zh_hans: 源文件 "{0}" 的当前内容与生成的源不匹配。在调试期间对此文件所做的任何更改都不会应用，直到其内容与生成的源匹配为止。
zh_hant: 來源檔案 '{0}' 目前的內容與已建置的來源不一致。等到此檔案的內容與已建置的來源一致後，才會套用於偵錯期間對此檔案所做的所有變更。

source: Document must be contained in the workspace that created this service
cs: Dokument musí být obsažený v pracovním prostoru, který vytvořil tuto datovou službu
de: Dokument muss in dem Arbeitsbereich enthalten sein, der diesen Dienst erstellt hat
es: El documento debe estar contenido en el área de trabajo que creó este servicio
fr: Le document doit être contenu dans l'espace de travail qui a créé ce service
it: Il documento deve essere contenuto nell'area di lavoro che ha creato il servizio
ja: このサービスを作成したワークスペースにドキュメントが含まれている必要があります
ko: 문서가 이 서비스를 만든 작업 영역에 포함되어 있어야 합니다.
pl: Dokument musi się znajdować w obszarze roboczym użytym do utworzenia tej usługi
pt_br: O Documento deve estar contido no workspace que criou este serviço
ru: Документ должен находиться в рабочей области, в которой была создана эта служба.
tr: Belge, bu hizmeti oluşturan çalışma alanında yer almalıdır
zh_hans: 文件必须包含在创建此服务的工作区中
zh_hant: 文件必須包含在此服務所建立的工作區中

source: Edit and Continue
cs: Upravit a pokračovat
de: Bearbeiten und Fortfahren
es: Editar y continuar
fr: Modifier et continuer
it: Modifica e continuazione
ja: エディット コンティニュ
ko: 편집하며 계속하기
pl: Edytuj i kontynuuj
pt_br: Editar e Continuar
ru: Операция "Изменить и продолжить"
tr: Düzenle ve Devam Et
zh_hans: 编辑并继续
zh_hant: 編輯並繼續

# EditAndContinueDisallowedByProject
source: Changes made in project '{0}' require restarting the application: {1}
cs: Změny provedené v projektu {0} vyžadují restartování aplikace: {1}
de: Änderungen, die im Projekt "{0}" vorgenommen wurden, erfordern einen Neustart der Anwendung: {1}
es: Los cambios realizados en el proyecto "{0}" requieren reiniciar la aplicación: {1}
it: Le modifiche apportate nel progetto '{0}' richiedono il riavvio dell'applicazione: {1}
ja: プロジェクト '{0}' で加えられた変更にはアプリケーションの再起動が必要です: {1}
ko: ' {0}' 프로젝트에서 변경한 내용을 적용하려면 응용 프로그램 ‘{1}’을(를) 다시 시작 해야 합니다.
pl: Zmiany wprowadzone w projekcie „{0}” wymagają ponownego uruchomienia aplikacji: {1}
pt_br: As alterações feitas no projeto '{0}' requerem a reinicialização do aplicativo: {1}
ru: После внесения изменений в проект "{0}" необходимо перезапустить приложение: {1}
tr: '{0}' projesinde yapılan değişiklikler uygulamanın yeniden başlatılmasını gerektiriyor: {1}
zh_hans: 在项目“{0}”中所做的更改要求重新启动应用程序: {1}

source: Enable all JSON editor features
cs: Povolit všechny funkce editoru JSON
de: Alle JSON-Editor-Funktionen aktivieren
es: Habilitar todas las características del editor JSON
it: Abilita tutte le funzionalità dell'editor JSON
ja: すべての JSON エディター機能を有効にする
ko: 모든 JSON 편집기 기능 사용
pl: Włącz wszystkie funkcje edytora JSON
pt_br: Habilitar todos os recursos do editor JSON
ru: Включить все функции редактора JSON
tr: Tüm JSON düzenleyicisi özelliklerini etkinleştir
zh_hans: 启用所有 JSON 编辑器功能

source: Enum members
cs: Členové výčtu
de: Enumerationsmember
es: Miembros de enumeración
it: Membri enumerazione
ja: 列挙型メンバー
ko: 멤버 열거
pl: Składowe wyliczenia
pt_br: Membros de enumeração
ru: Элементы перечисления
tr: Sabit liste üyeleri
zh_hans: 枚举成员

# ErrorReadingFile
source: Error while reading file '{0}': {1}
cs: Při čtení souboru {0} došlo k chybě: {1}
de: Fehler beim Lesen der Datei "{0}": {1}
es: Error al leer el archivo "{0}": {1}
fr: Erreur durant la lecture du fichier '{0}' : {1}
it: Si è verificato un errore durante la lettura del file '{0}': {1}
ja: ファイル {0}' の読み取り中にエラーが発生しました: {1}
ko: '{0}' 파일을 읽는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas odczytywania pliku „{0}”: {1}
pt_br: Erro ao ler o arquivo '{0}': {1}
ru: Ошибка при чтении файла "{0}": {1}
tr: '{0}' dosyası okunurken hata: {1}
zh_hans: 读取文件“{0}”时出错: {1}
zh_hant: 讀取檔案 '{0}' 時發生錯誤: {1}

source: Error creating instance of CodeFixProvider
cs: Při vytváření instance CodeFixProvider došlo k chybě.
de: Fehler beim Erstellen der CodeFixProvider-Instanz
es: Error al crear la instancia de CodeFixProvider
fr: Erreur lors de la création de l'instance de CodeFixProvider
it: Si è verificato un errore durante la creazione dell'istanza di CodeFixProvider
ja: CodeFixProvider のインスタンスの作成でエラーが発生しました
ko: CodeFixProvider 인스턴스를 만드는 동안 오류가 발생했습니다.
pl: Błąd podczas tworzenia wystąpienia elementu CodeFixProvider
pt_br: Erro ao criar a instância de CodeFixProvider
ru: Ошибка при создании экземпляра CodeFixProvider.
tr: CodeFixProvider örneği oluşturulurken hata oluştu
zh_hans: 创建 CodeFixProvider 实例时出错
zh_hant: 建立 CodeFixProvider 的執行個體時發生錯誤

source: Error creating instance of CodeFixProvider '{0}'
cs: Při vytváření instance CodeFixProvider {0} došlo k chybě.
de: Fehler beim Erstellen der CodeFixProvider-Instanz "{0}".
es: Error al crear la instancia de CodeFixProvider "{0}"
fr: Erreur lors de la création de l'instance de CodeFixProvider '{0}'
it: Si è verificato un errore durante la creazione dell'istanza di CodeFixProvider '{0}'
ja: CodeFixProvider '{0}' のインスタンスの作成でエラーが発生しました
ko: CodeFixProvider '{0}' 인스턴스를 만드는 동안 오류가 발생했습니다.
pl: Błąd podczas tworzenia wystąpienia elementu CodeFixProvider „{0}”
pt_br: Erro ao criar instância de CodeFixProvider '{0}'
ru: Ошибка при создании экземпляра CodeFixProvider "{0}".
tr: '{0}' CodeFixProvider örneği oluşturulurken hata oluştu
zh_hans: 创建 CodeFixProvider“{0}”的实例时出错
zh_hant: 建立 CodeFixProvider '{0}' 的執行個體時發生錯誤

source: Error parsing comment
cs: Chyba při analýze komentáře
de: Fehler beim Analysieren des Kommentars
es: Error al analizar el comentario
it: Errore durante l'analisi del commento
ja: コメントの解析でエラーが発生しました
ko: 주석 구문 분석 오류
pl: Błąd podczas analizowania komentarza
pt_br: Erro ao analisar o comentário
ru: Ошибка разбора комментария
tr: Açıklama ayrıştırılırken hata oluştu
zh_hans: 分析注释时出错

source: Error reading PDB: '{0}'
cs: Chyba při čtení PDB: {0}
de: Fehler beim Lesen von PDB-Dateien: „{0}“
es: Error al leer PDB: '{0}'
it: Errore durante la lettura del PDB: '{0}'
ja: PDB: '{0}' の読み込み中にエラーが発生した
ko: PDB를 읽는 동안 오류 발생: '{0}'
pl: Błąd podczas odczytywania pliku PDB: „{0}”
pt_br: Erro ao ler PDB: '{0}'
ru: Ошибка чтения PDB-файла: "{0}"
tr: PDB okuma hatası: “{0}”
zh_hans: 读取 PDB 时出错:“{0}”

source: Example:
cs: Příklad:
de: Beispiel:
es: Ejemplo:
fr: Exemple :
it: Esempio:
ja: 例:
ko: 예:
pl: Przykład:
pt_br: Exemplo:
ru: Пример:
tr: Örnek:
zh_hans: 示例:
zh_hant: 範例:

source: Examples:
cs: Příklady:
de: Beispiele:
es: Ejemplos:
fr: Exemples :
it: Esempi:
ja: 例:
ko: 예:
pl: Przykłady:
pt_br: Exemplos:
ru: Примеры:
tr: Örnekler:
zh_hans: 示例:
zh_hant: 範例:

source: Extract base class...
cs: Extrahovat základní třídu...
de: Basisklasse extrahieren...
es: Extraer clase base...
fr: Extraire la classe de base...
it: Estrai classe di base...
ja: 基底クラスの抽出...
ko: 기본 클래스 추출...
pl: Wyodrębnij klasę bazową...
pt_br: Extrair a classe base...
ru: Извлечь базовый класс...
tr: Temel sınıfı ayıkla...
zh_hans: 提取基类...
zh_hant: 擷取基底類別...

source: Extract base record...
cs: Extrahovat základní record...
de: Base record extrahieren...
es: Extraer record base...
it: Estrai record di base...
ja: 基底 record を抽出...
ko: 기본 record 추출...
pl: Wyodrębnij record podstawowy...
pt_br: Extrair record base...
ru: Извлечь базовый объект record...
tr: Temel record öğesini ayıkla
zh_hans: 提取基本 record...

source: Extract interface...
cs: Extrahovat rozhraní...
de: Schnittstelle extrahieren...
es: Extraer interfaz...
fr: Extraire l'interface...
it: Estrai interfaccia...
ja: インターフェイスの抽出...
ko: 인터페이스 추출...
pl: Wyodrębnij interfejs...
pt_br: Extrair a interface...
ru: Извлечение интерфейса…
tr: Arabirimi ayıkla...
zh_hans: 提取接口...
zh_hant: 擷取介面...

source: Extract local function
cs: Extrahovat lokální funkci
de: Lokale Funktion extrahieren
es: Extraer función local
fr: Extraire la fonction locale
it: Estrai funzione locale
ja: ローカル関数の抽出
ko: 로컬 함수 추출
pl: Wyodrębnij funkcję lokalną
pt_br: Extrair a função local
ru: Извлечение локальной функции
tr: Yerel işlevi ayıkla
zh_hans: 提取本地函数
zh_hant: 擷取區域函式

source: Extract method
cs: Extrahovat metodu
de: Methode extrahieren
es: Extraer método
fr: Extraire une méthode
it: Estrai il metodo
ja: メソッドを抽出する
ko: 메서드 추출
pl: Wyodrębnij metodę
pt_br: Extrair método
ru: Извлечь метод
tr: Yöntemi ayıkla
zh_hans: 提取方法
zh_hant: 擷取方法

source: Failed to analyze data-flow for: {0}
cs: Nepovedlo se analyzovat tok dat pro: {0}
de: Fehler beim Analysieren des Datenflusses für: {0}
es: No se pudo analizar el flujo de datos para: {0}.
fr: Impossible d’analyser le flux de données pour : {0}
it: Non è stato possibile analizzare il flusso di dati per: {0}
ja: データ フローを分析できませんでした: {0}
ko: {0}의 데이터 흐름 분석 실패
pl: Nie można przeanalizować przepływu danych dla: {0}
pt_br: Falha ao analisar o fluxo de dados para: {0}
ru: Не удалось проанализировать поток данных для: {0}
tr: {0} için veri akışı analiz edilemedi
zh_hans: 未能分析 {0} 的数据流
zh_hant: 無法分析下列項目的資料流程: {0}

source: 'Find All References' not invoked on applicable symbol
cs: Funkce Najít všechny odkazy se nevyvolala u použitelného symbolu.
de: „Alle Verweise suchen“ wurde für das anwendbare Symbol nicht aufgerufen.
es: 'Buscar todas las referencias' no invocado en el símbolo aplicable
it: 'Trova tutti i riferimenti' non richiamato su un simbolo applicabile
ja: 該当するシンボルに対して 'Find All References' が呼び出されていません
ko: 해당 기호에서 '모든 참조 찾기'가 호출되지 않음
pl: Nie wywołano elementu „Znajdź wszystkie odwołania” dla odpowiedniego symbolu
pt_br: "Localizar Todas as Referências" não invocado no símbolo aplicável
ru: Метод "Найти все ссылки" не вызван для применимого символа
tr: Uygulanabilir sembolde 'Tüm Referansları Bul' çağrılmadı
zh_hans: 未对适用的符号调用“查找所有引用”

source: Fix All: {0}
cs: Opravit vše: {0}
es: Corregir todo: {0}
ko: 모두 수정: {0}
pl: Napraw wszystko: {0}
pt_br: Corrigir Tudo: {0}
ru: Исправить все: {0}
tr: Tümünü Düzelt: {0}
zh_hans: 全部修复: {0}

source: Fix typo '{0}'
cs: Opravit překlep {0}
de: Tippfehler "{0}" korrigieren
es: Corregir error de escritura "{0}"
fr: Corriger la faute de frappe '{0}'
it: Correggi l'errore di ortografia '{0}'
ja: '{0}' の入力ミスを修正します
ko: 오타 '{0}' 수정
pl: Popraw błąd pisowni „{0}”
pt_br: Corrigir erro de digitação '{0}'
ru: Исправьте опечатку "{0}"
tr: '{0}' yazım hatasını düzeltin
zh_hans: 修正笔误“{0}”
zh_hant: 修正錯字 '{0}'

source: Fixing '{0}'
cs: Probíhá oprava: {0}
de: Befestigung '{0}'
es: Corrigiendo '{0}'
it: Correzione di '{0}'
ja: '{0}' の修正中
ko: '{0}' 수정 중
pl: Naprawianie „{0}”
pt_br: Corrigindo '{0}'
ru: Исправление "{0}"
tr: '{0}' düzeltiliyor
zh_hans: 正在修复 "{0}"

source: Formatting document
cs: Formátuje se dokument.
de: Dokument wird formatiert
es: Aplicando formato al documento
fr: Mise en forme du document
it: Formattazione del documento
ja: ドキュメントの書式設定
ko: 문서 서식을 지정하는 중
pl: Trwa formatowanie dokumentu...
pt_br: Formatando documento
ru: Форматирование документа
tr: Belge biçimlendiriliyor
zh_hans: 设置文档格式
zh_hant: 正在將文件格式化

source: Found '{0}' assemblies for '{1}':
cs: Pro {1} se našlo několik ({0}) sestavení:
de: {0} Assemblys für "{1}" gefunden:
es: Se encontraron "{0}" ensamblados para "{1}":
it: Sono stati trovati '{0}' assembly per '{1}':
ja: '{1}' の '{0}' 個のアセンブリが見つかりました:
ko: '{1}'의 어셈블리를 '{0}'개 찾았습니다.
pl: Znaleziono zestawy („{0}”) dla elementu „{1}”:
pt_br: Foram encontrados '{0}' assemblies para '{1}':
ru: Обнаружены сборки ("{0}") для "{1}":
tr: '{1}' için '{0}' bütünleştirilmiş kod bulundu:
zh_hans: 找到 “{1}”的“{0}”个程序集:

source: Found PDB file at '{0}'
cs: V {0} se našel soubor PDB.
de: Die PDB-Datei wurde unter „{0}“ gefunden
es: Se encontró el archivo PDB en '{0}'
it: Trovato file PDB in '{0}'
ja: '{0}' で PDB ファイルが見つかりました
ko: '{0}'에서 PDB 파일을 찾음
pl: Znaleziono plik PDB w lokalizacji „{0}”
pt_br: Arquivo PDB encontrado em '{0}'
ru: Найден PDB-файл в "{0}"
tr: “{0}” konumunda PDB dosyası bulundu
zh_hans: 在“{0}”处找到 PDB 文件

source: Found PDB on symbol server.
cs: Soubor PDB byl nalezen na serveru symbolů.
de: Die PDB-Datei wurde auf dem Symbolserver gefunden.
es: Se encontró PDB en el servidor de símbolos.
it: È stato trovato il PDB nel server dei simboli.
ja: シンボル サーバーで PDB が見つかりました。
ko: 기호 서버에서 PDB를 찾았습니다.
pl: Znaleziono plik PDB na serwerze symboli.
pt_br: PDB encontrado no servidor de símbolo.
ru: Найден PDB-файл на сервере символов.
tr: Sembol sunucusunda PDB bulundu.
zh_hans: 在符号服务器上找到 PDB。

source: Found PDB on symbol server but could not read file.
cs: Soubor PDB se našel na serveru symbolů, ale nepovedlo se přečíst soubor.
de: Die PDB-Datei wurde auf dem Symbolserver gefunden, aber die Datei konnte jedoch nicht gelesen werden.
es: Se encontró PDB en el servidor de símbolos, pero no se pudo leer el archivo.
it: Il file PDB è stato trovato nel server dei simboli ma non è stato possibile leggere il file.
ja: シンボル サーバーで PDB が見つかりましたが、ファイルを読み取ることができませんでした。
ko: 기호 서버에서 PDB를 찾았지만 파일을 읽을 수 없습니다.
pl: Znaleziono plik PDB na serwerze symboli, ale nie można było odczytać pliku.
pt_br: PDB encontrado no servidor de símbolos, mas não foi possível ler o arquivo.
ru: Найден PDB-файл на сервере символов, но не удалось прочитать файл.
tr: Sembol sunucusunda PDB bulundu ancak dosya okunamadı.
zh_hans: 在符号服务器上找到 PDB，但无法读取文件。

source: Found embedded PDB file.
cs: Byl nalezen vložený soubor PDB.
de: Die eingebettete PDB-Datei wurde gefunden.
es: Se encontró un archivo PDB incrustado.
it: Trovato file PDB incorporato.
ja: 埋め込み PDB ファイルが見つかりました。
ko: 포함된 PDB 파일을 찾았습니다.
pl: Znaleziono osadzony plik PDB.
pt_br: Arquivo PDB incorporado encontrado.
ru: Найден внедренный PDB-файл.
tr: Gömülü PDB dosyası bulundu.
zh_hans: 找到嵌入的 PDB 文件。

source: Found exact match: '{0}'
cs: Našla se přesná shoda: {0}
de: Exakte Übereinstimmung gefunden: {0}
es: Se encontró una coincidencia exacta: "{0}"
it: È stata trovata una corrispondenza esatta: '{0}'
ja: 完全一致が見つかりました: '{0}'
ko: 정확하게 일치하는 항목을 찾았습니다. '{0}'
pl: Znaleziono dokładne dopasowanie: „{0}”
pt_br: Foi encontrada a correspondência exata: '{0}'
ru: Обнаружено точное совпадение: "{0}"
tr: Tam eşleşme bulundu: '{0}'
zh_hans: 找到完全匹配: "{0}"

source: Found higher version match: '{0}'
cs: Našla se shoda s vyšší verzí: {0}
de: Höhere Versionsübereinstimmung gefunden: {0}
es: Se encontró una coincidencia más alta con la versión: "{0}"
it: È stata trovata una versione corrispondente successiva: '{0}'
ja: 新しいバージョンの一致が見つかりました: '{0}'
ko: 일치하는 상위 버전을 찾았습니다. '{0}'
pl: Znaleziono dopasowanie wyższej wersji: „{0}”
pt_br: Foi encontrada uma correspondência de versão superior: '{0}'
ru: Обнаружено более высокое совпадение версий: "{0}"
tr: Daha yüksek bir sürüm eşleşmesi bulundu: '{0}'
zh_hans: 找到较高版本匹配: "{0}"

source: Found single assembly: '{0}'
cs: Našlo se jedno sestavení: {0}
de: Einzelne Assembly gefunden: {0}
es: Se encontró un solo ensamblado: "{0}"
it: È stato trovato un solo assembly: '{0}'
ja: 1 つのアセンブリが見つかりました: '{0}'
ko: 단일 어셈블리를 찾았습니다. '{0}'
pl: Znaleziono pojedynczy zestaw: „{0}”
pt_br: Foi encontrado um assembly: '{0}'
ru: Найдена одна сборка: "{0}"
tr: Tek bütünleştirilmiş kod bulundu: '{0}'
zh_hans: 找到单个程序集: "{0}"

source: Generate abstract method '{0}'
de: Abstrakte Methode „{0}“ generieren
it: Genera il metodo astratto '{0}'
ja: 抽象メソッド '{0}' を生成する
tr: '{0}' soyut metodunu üret
zh_hans: 生成抽象方法“{0}”

source: Generate abstract property '{0}'
de: Abstrakte Eigenschaft „{0}X generieren
it: Genera la proprietà astratta '{0}'
ja: 抽象プロパティ '{0}' を生成する
tr: '{0}' soyut özelliğini üret
zh_hans: 生成抽象属性“{0}”

source: Generate comparison operators
cs: Vygenerovat operátory porovnání
de: Vergleichsoperatoren generieren
es: Generar operadores de comparación
fr: Générer des opérateurs de comparaison
it: Genera gli operatori di confronto
ja: 比較演算子の生成
ko: 비교 연산자 생성
pl: Generuj operatory porównania
pt_br: Gerar operadores de comparação
ru: Создать операторы сравнения
tr: Karşılaştırma işleçlerini oluştur
zh_hans: 生成比较运算符
zh_hant: 產生比較運算子

source: Generate constant '{0}'
de: Konstante „{0}“ generieren
it: Genera la costante '{0}'
ja: 定数 '{0}' を生成する
tr: '{0}' sabitini üret
zh_hans: 生成常数“{0}”

source: Generate constructor in '{0}' (with fields)
de: Konstruktor in "{0}" (mit Feldern) generieren
fr: Générer le constructeur dans '{0}' (avec les champs)
it: Genera il costruttore in '{0}' (con campi)
ja: '{0}' にコンストラクターを生成します (フィールドを含む)
tr: '{0}' içinde oluşturucu üret (alanlarla birlikte)
zh_hans: 在“{0}”中生成构造函数(包含字段)
zh_hant: 在 '{0}' 中產生建構函式 (使用欄位)

source: Generate constructor in '{0}' (with properties)
de: Konstruktor in "{0}" (mit Eigenschaften) generieren
fr: Générer le constructeur dans '{0}' (avec les propriétés)
it: Genera il costruttore in '{0}' (con proprietà)
ja: '{0}' にコンストラクターを生成します (プロパティを含む)
tr: '{0}' içinde oluşturucu üret (özelliklerle birlikte)
zh_hans: 在“{0}”中生成构造函数(包含属性)
zh_hant: 在 '{0}' 中產生建構函式 (使用屬性)

source: Generate enum member '{0}'
de: Aufzählungselement „{0}“ generieren
it: Genera il membro di enumerazione '{0}'
ja: 列挙型メンバー '{0}' を生成する
tr: '{0}' sabit listesi üyesini üret
zh_hans: 生成枚举成员“{0}”

source: Generate field '{0}'
de: Feld „{0}“ generieren
it: Genera il campo '{0}'
ja: フィールド '{0}' を生成する
tr: '{0}' alanını üret
zh_hans: 生成字段“{0}”

source: Generate for '{0}'
cs: Vygenerovat pro {0}
de: Für "{0}" generieren
es: Generar para "{0}"
fr: Générer pour '{0}'
it: Genera per '{0}'
ja: '{0}' の生成
ko: '{0}'에 대해 생성
pl: Wygeneruj dla elementu „{0}”
pt_br: Gerar para '{0}'
ru: Создать для "{0}"
tr: '{0}' için oluştur
zh_hans: 为 "{0}" 生成
zh_hant: 為 '{0}' 產生

source: Generate method '{0}'
de: Methode „{0}“ generieren
it: Genera il metodo '{0}'
ja: メソッド '{0}' を生成する
tr: '{0}' metodunu üret
zh_hans: 生成方法“{0}”

source: Generate parameter '{0}'
de: Parameter "{0}" generieren
fr: Générer le paramètre '{0}'
it: Generare il parametro '{0}'
ja: パラメーター '{0}' の生成
tr: '{0}' parametresini üret
zh_hans: 生成参数 "{0}"
zh_hant: 產生參數 '{0}'

source: Generate parameter '{0}' (and overrides/implementations)
de: Parameter "{0}" (und Außerkraftsetzungen/Implementierungen) generieren
fr: Générer le paramètre '{0}' (et les substitutions/implémentations)
it: Generare il parametro '{0}' (e override/implementazioni)
ja: パラメーター '{0}' の生成 (およびオーバーライド/実装)
tr: '{0}' parametresini (ve geçersiz kılmaları/uygulamaları) üret
zh_hans: 生成参数 {0}(和重写/实现)
zh_hant: 產生參數 '{0}' (以及覆寫/實作)

source: Generate property '{0}'
de: Eigenschaft „{0}“ generieren
it: Genera la proprietà '{0}'
ja: プロパティ '{0}' を生成する
tr: '{0}' özelliğini üret
zh_hans: 生成属性“{0}”

source: Generate read-only field '{0}'
de: Schreibgeschütztes Feld „{0}“ generieren
it: Genera il campo di sola lettura '{0}'
ja: 読み取り専用フィールド '{0}' を生成する
tr: '{0}' salt okunur alanını üret
zh_hans: 生成只读字段“{0}”

source: Generate read-only property '{0}'
de: Schreibgeschützte Eigenschaft „{0}“ generieren
it: Genera la proprietà di sola lettura '{0}'
ja: 読み取り専用プロパティ '{0}' を生成する
tr: '{0}' salt okunur özelliğini üret
zh_hans: 生成只读属性“{0}”

# Illegal_backslash_at_end_of_pattern
source: Illegal \ at end of pattern
cs: Znak \ na konci vzorku je neplatný.
de: Nicht zulässiges \-Zeichen am Ende des Musters.
es: \ no válido al final del modelo
fr: Caractère \ non autorisé à la fin du modèle
it: Carattere \ non valido alla fine del criterio
ja: 無効\末尾のパターン
ko: 패턴 끝에 \를 사용할 수 없습니다.
pl: Niedozwolony znak \ na końcu wzorca
pt_br: \ ilegal no final do padrão
ru: Недопустимый символ "\" в конце шаблона
tr: Yasadışı \ model sonunda
zh_hans: 模式末尾的 \ 非法
zh_hant: 模式結尾使用 \ 不符合格式規定
