Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Semantic_search_only_supported_on_net_core
source: Semantic search is only supported when code analysis runs in a separate process on the latest .NET (see Tools > Options > Text Editor > C# > Advanced).
cs: Sémantické vyhledávání se podporuje jenom v případě, že se analýza kódu spouští v samostatném procesu na nejnovější verzi .NET (viz Nástroje > Možnosti > Textový editor > C# > Upřesnit).
es: La búsqueda semántica solo se admite cuando el análisis de código se ejecuta en un proceso independiente en la versión más reciente de .NET (consulte Herramientas > Opciones > Editor de texto > C# > Avanzadas).
pl: Wyszukiwanie semantyczne jest obsługiwane tylko wtedy, gdy analiza kodu jest uruchamiana w osobnym procesie na najnowszej platformie .NET (zobacz Narzędzia > Opcje > Edytor tekstów > C# > Zaawansowane).
pt_br: A pesquisa semântica só tem suporte quando a análise de código é executada em um processo separado no .NET mais recente (consulte Ferramentas > Opções > Editor de Texto > C# > Avançado).
ru: Семантический поиск поддерживается только в том случае, если анализ кода выполняется в отдельном процессе последней версии .NET (см. "Сервис" > "Параметры" > "Текстовый редактор" > "C#" > "Дополнительно").
tr: Anlamsal arama yalnızca kod analizi en son .NET üzerinde ayrı bir işlemde çalıştırıldığında desteklenir (Araçlar > Seçenekler > Metin Düzenleyici > C# > Gelişmiş seçeneğine bakın).

source: Simplify member access '{0}'
cs: Zjednodušit přístup ke členu {0}
es: Simplificar acceso a miembros "{0}"
ko: 멤버 액세스 '{0}' 단순화
pl: Uprość dostęp do składowej „{0}”
pt_br: Simplificar acesso do membro '{0}'
ru: Упрощение доступа для членов "{0}"

source: Simplify name '{0}'
cs: Zjednodušit název {0}
es: Simplificar nombre "{0}"
ko: '{0}' 이름 단순화
pl: Uprość nazwę „{0}”
pt_br: Simplificar nome '{0}'
ru: Упрощение имени "{0}"

source: Symbol search
cs: Hledání symbolů
es: Búsqueda de símbolos
ko: 기호 검색
pl: Wyszukiwanie symboli
pt_br: Pesquisa de símbolo
ru: Поиск символов

source: Symbols
cs: Symboly
es: Símbolos
ko: 기호
pl: Symbole
pt_br: Símbolos
ru: Символы
tr: Semboller

# The_assembly_0_references_compiler_version_1_newer_than_2
source: Analyzer assembly '{0}' cannot be used because it references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
cs: Sestavení analyzátoru{0} nelze použít, protože odkazuje na verzi {1} kompilátoru, která je novější než aktuálně spuštěná verze {2}.
es: El ensamblado del analizador “{0}” no se puede usar porque hace referencia a la versión “{1}” del compilador, que es más reciente que la versión “{2}” que se está ejecutando actualmente.
ko: 분석기 어셈블리 '{0}'은(는) 컴파일러의 '{1}' 버전을 참조하며, 이 버전은 현재 실행 중인 버전 '{2}'보다 최신 버전입니다.
pl: Zestaw analizatora „{0}” nie może być użyty, ponieważ odwołuje się do wersji „{1}” kompilatora, która jest nowsza niż obecnie uruchomiona wersja „{2}”.
pt_br: O assembly do analisador "{0}" não pode ser usado porque faz referência à versão "{1}" do compilador, que é mais recente do que a versão "{2}" em execução no momento.

source: Unable to create '{0}'
cs: Nepovedlo se vytvořit {0}
es: No se puede crear '{0}'
ko: {0}(을)를 만들 수 없음
pl: Nie można utworzyć „{0}”
pt_br: Não é possível criar '{0}'
ru: Не удается создать "{0}"

source: Unable to get the directory name for {0}.
cs: Nelze získat název adresáře pro {0}.
es: No se puede obtener el nombre del directorio para {0}.
pl: Nie można pobrać nazwy katalogu dla {0}.
pt_br: Não é possível obter o nome do diretório para {0}.

source: '{0}' cannot be negative
cs: Hodnota {0} nemůže být záporná.
es: “{0}” no puede ser negativo
pl: Wartość „{0}” nie może być ujemna
pt_br: "{0}" não pode ser negativo

source: '{0}' cannot be negative or zero
cs: Hodnota {0} nemůže být záporná nebo nulová.
es: “{0}” no puede ser negativo ni cero
pl: Wartość „{0}” nie może być ujemna ani równa zero
pt_br: "{0}" não pode ser negativo ou zero

source: '{0}' is not nullable aware.
cs: {0} nemá povolenou hodnotu null.
es: “{0}” no es compatible con valores anulables.
pl: Wartość „{0}” nie dopuszcza wartości null.
pt_br: "{0}" não reconhece anulabilidade.

source: extension block
cs: blok rozšíření
es: bloque de extensión
pl: blok rozszerzenia
pt_br: bloco de extensão

source: the content of the document is stale.
pl: zawartość dokumentu jest nieaktualna.

source: the project contains stale document '{0}'.
pl: projekt zawiera nieaktualny dokument „{0}”.

source: the project has not been built.
pl: projekt nie został skompilowany.

source: Add _null checks
cs: Přidat kontroly hodnot _null
es: Agregar comprobaciones de _null
ko: _null 검사 추가
pl: Dodaj sprawdzenia wartości _null
pt_br: Adicionar verificações _null
ru: Добавить проверки значений _null

source: Method '{0}' must be static and non-generic
tr: '{0}' yönteminin statik olması ve genel olmaması gerekir.

source: Method '{0}' must have a single parameter of type '{1}' and return '{2}'
tr: '{0}' yönteminin '{1}' türünde tek bir parametre olması ve '{2}' değerini döndürmesi gerekir

source: Query
tr: Sorgu

source: Semantic search query failed to compile
tr: Anlamsal arama sorgusu derlenemedi

source: Semantic search query terminated with exception
tr: Anlamsal arama sorgusu bir özel durumla sonlandırıldı

source: The query does not specify '{0}' method or top-level function
tr: Sorgu '{0}' yöntemini veya üst düzey işlev belirtmiyor

source: Unable to load type '{0}': '{1}'
tr: '{0}' türü yüklenemiyor: '{1}'

source: <class name>
cs: <název třídy>
es: <nombre de la clase>
pt_br: <nome da classe>
ru: <имя класса>

source: default>
cs: výchozí>
pt_br: padrão>

source: <interface name>
cs: <název rozhraní>
es: <nombre de la interfaz>
pt_br: <nome da interface>
ru: <имя интерфейса>

source: <namespace name>
cs: <název oboru názvů>
es: <nombre de espacio de nombres>
pt_br: <nome do namespace>
ru: <имя пространства имен>

source: Accessing captured variable '{0}' that hasn't been accessed before in {1} requires restarting the application.
it: Se si accede alla variabile catturata '{0}' a cui non è stato ancora eseguito l'accesso in {1}, è necessario riavviare l'applicazione.

source: Adding {0} that accesses captured variables '{1}' and '{2}' declared in different scopes requires restarting the application.
it: Se si aggiunge {0} che accede alle variabili catturate '{1}' e {2}' dichiarate in ambiti diversi, è necessario riavviare l'applicazione.

source: Awaited task returns '{0}'
fr: La tâche attendue retourne '{0}'
it: L'attività attesa restituisce '{0}'
zh_hant: 等待的工作會傳回 '{0}'

source: Capturing variable '{0}' that hasn't been captured before requires restarting the application.
it: Se si acquisisce la variabile '{0}' che non è stata acquisita prima, è necessario riavviare l'applicazione.

source: Ceasing to access captured variable '{0}' in {1} requires restarting the application.
it: Se si interrompe l'accesso alla variabile catturata '{0}' in {1}, è necessario riavviare l'applicazione.

source: Ceasing to capture variable '{0}' requires restarting the application.
it: Se si interrompe l'acquisizione della variabile '{0}', è necessario riavviare l'applicazione.

source: Deleting captured variable '{0}' requires restarting the application.
it: Se si elimina la variabile catturata '{0}', è necessario riavviare l'applicazione.

source: Remove unnecessary Imports or usings
it: Rimuovi importazioni o utilizzi non necessari

source: Removing {0} that accessed captured variables '{1}' and '{2}' declared in different scopes requires restarting the application.
it: Se si rimuove {0} che ha effettuato l'accesso alle variabili catturate '{1}' e {2}' dichiarate in ambiti diversi, è necessario riavviare l'applicazione.

source: Resolve conflict markers
de: Konfliktmarkierungen auflösen
fr: Résoudre les marqueurs de conflit
it: Risolvi gli indicatori di conflitto
ja: 競合マーカーの解決
zh_hant: 解決衝突標記

source: can't not construct final tree
fr: Impossible de construire l'arborescence finale
it: non è possibile costruire l'albero finale
zh_hant: 無法建構最終的樹狀結構

source: Changing source file '{0}' in a stale project has no effect until the project is rebuit.
pt_br: Alterar o arquivo de origem "{0}" em um projeto obsoleto não tem efeito até que o projeto seja reconstruído.

source: Add explicit cast
fr: Ajouter un cast explicite
zh_hant: 新增明確轉換

source: Add member name
fr: Ajouter le nom du membre
zh_hant: 新增成員名稱

source: Add parameter to '{0}' (and overrides/implementations)
fr: Ajouter un paramètre à '{0}' (et aux remplacements/implémentations)
zh_hant: 將參數新增至 '{0}' (以及覆寫/執行)

source: Adding '{0}' into an interface method will prevent the debug session from continuing.
fr: L'ajout de '{0}' à une méthode d'interface empêche la session de débogage de se poursuivre.
zh_hant: 將 '{0}' 新增至介面方法，會造成偵錯工作階段無法繼續。

source: Adding '{0}' into an interface will prevent the debug session from continuing.
fr: L'ajout de '{0}' à une interface empêche la session de débogage de se poursuivre.
zh_hant: 將 '{0}' 新增至介面，會造成偵錯工作階段無法繼續。

source: Adding a method with an explicit interface specifier will prevent the debug session from continuing.
fr: L'ajout d'une méthode avec un spécificateur d'interface explicite empêche la session de débogage de continuer.
zh_hant: 新增具有明確介面指定名稱的方法會導致偵錯工作階段無法繼續。

# ChangesNotAppliedWhileRunning
source: Changes made in project '{0}' will not be applied while the application is running
fr: Les changements apportés au projet '{0}' ne sont pas appliqués tant que l'application est en cours d'exécution
zh_hant: 將不會在應用程式執行時套用在專案 '{0}' 中所做的變更

source: Changing '{0}' from asynchronous to synchronous will prevent the debug session from continuing.
fr: Si vous changez '{0}' en le faisant passer d'asynchrone à synchrone, vous allez empêcher la session de débogage de se poursuivre.
zh_hant: 將 '{0}' 從非同步變更為同步，會造成偵錯工作階段無法繼續。

source: Changing '{0}' to '{1}' will prevent the debug session from continuing because it changes the shape of the state machine.
fr: Le remplacement de '{0}' par '{1}' va empêcher la session de débogage de se poursuivre, car cela change la forme de la machine à états.
zh_hant: 將 '{0}' 變更為 '{1}' 會變更狀態機器的圖形，進而使偵錯工作階段無法繼續。

source: Add to '{0}'
fr: Ajouter à '{0}'
zh_hant: 新增至 '{0}'

source: Convert type to '{0}'
fr: Convertir le type en '{0}'
zh_hant: 將類型轉換為 '{0}'

source: Edit and Continue disallowed by module
fr: Fonctionnalité Modifier et Continuer interdite par le module
zh_hant: 模組不允許編輯和繼續

# EditAndContinueDisallowedByProject
source: Changes made in project '{0}' will prevent the debug session from continuing: {1}
fr: Les changements apportés au projet '{0}' empêchent la session de débogage de se poursuivre : {1}
zh_hant: 在專案 '{0}' 中所做的變更將使偵錯工作階段無法繼續: {1}

source: Fix formatting
fr: Corriger la mise en forme
zh_hant: 修正格式化

source: Make class 'abstract'
fr: Rendre la classe 'abstract'
zh_hant: 將類別設為 'abstract'

# Make_member_static
source: Make static
fr: Rendre statique
zh_hant: 使其變成靜態

source: Modifying '{0}' which contains a switch expression will prevent the debug session from continuing.
fr: La modification de '{0}', qui contient une expression de switch, va empêcher la session de débogage de se poursuivre.
zh_hant: 修改包含參數運算式的 '{0}' 會讓偵錯工作階段無法繼續。

source: Modifying the body of '{0}' will prevent the debug session from continuing because the body has too many statements.
fr: Le fait de modifier le corps de '{0}' empêche la session de débogage de se poursuivre, car le corps contient trop d'instructions.
zh_hant: 因為 '{0}' 的主體有過多陳述式，所以修改該主體將導致偵錯工作階段無法繼續進行。

source: Modifying the body of '{0}' will prevent the debug session from continuing due to internal error: {1}
fr: Le fait de modifier le corps de '{0}' empêche la session de débogage de se poursuivre en raison d'une erreur interne : {1}
zh_hant: 因為內部錯誤，所以修改 '{0}' 的主體將導致偵錯工作階段無法繼續進行: {1}

source: Modifying source file '{0}' will prevent the debug session from continuing because the file is too big.
fr: Le fait de modifier le fichier source '{0}' empêche la session de débogage de se poursuivre, car le fichier est trop volumineux.
zh_hant: 因為來源檔案 '{0}' 過大，所以修改該檔案將導致偵錯工作階段無法繼續進行。

source: Modifying source file '{0}' will prevent the debug session from continuing due to internal error: {1}
fr: Le fait de modifier le fichier source '{0}' empêche la session de débogage de se poursuivre en raison d'une erreur interne : {1}
zh_hant: 因為內部錯誤，所以修改來源檔案 '{0}' 將導致偵錯工作階段無法繼續進行: {1}

source: Pull member(s) up to new base class...
fr: Tirer (pull) le ou les membres jusqu'à la nouvelle classe de base...
zh_hant: 將成員提取至新的基底類別...

# Regex_balancing_group_long
source: A balancing group definition deletes the definition of a previously defined group and stores, in the current group, the interval between the previously defined group and the current group. 'name1' is the current group (optional), 'name2' is a previously defined group, and 'subexpression' is any valid regular expression pattern. The balancing group definition deletes the definition of name2 and stores the interval between name2 and name1 in name1. If no name2 group is defined, the match backtracks. Because deleting the last definition of name2 reveals the previous definition of name2, this construct lets you use the stack of captures for group name2 as a counter for keeping track of nested constructs such as parentheses or opening and closing brackets. The balancing group definition uses 'name2' as a stack. The beginning character of each nested construct is placed in the group and in its Group.Captures collection. When the closing character is matched, its corresponding opening character is removed from the group, and the Captures collection is decreased by one. After the opening and closing characters of all nested constructs have been matched, 'name1' is empty.
fr: Une définition de groupe d'équilibrage supprime la définition d'un groupe défini et stocke, dans le groupe actuel, l'intervalle entre le groupe défini et le groupe actuel. 'nom1' est le groupe actuel facultatif, 'nom2' est un groupe défini et 'sous-expression' est un modèle d'expression régulière valide. La définition du groupe d'équilibrage supprime la définition de name2 et stocke l'intervalle entre name2 et name1 dans name1. Si aucun groupe name2 n'est défini, la correspondance fait l'objet d'une rétroaction. Dans la mesure où la suppression de la dernière définition de name2 révèle la définition précédente de name2, cette construction vous permet d'utiliser la pile de captures du groupe name2 en tant que compteur permettant d'effectuer le suivi des constructions imbriquées telles que les parenthèses ou les crochets d'ouverture et de fermeture. La définition du groupe d'équilibrage utilise 'nom2' en tant que pile. Le caractère de début de chaque construction imbriquée est placé dans le groupe et dans sa collection Group.Captures. Quand le caractère de fermeture correspond, le caractère d'ouverture correspondant est supprimé du groupe, et la collection Captures est réduite d'un élément. Une fois que les caractères d'ouverture et de fermeture de toutes les constructions imbriquées ont été mis en correspondance, 'nom1' est vide.
zh_hant: 平衡群組定義會刪除先前已定義群組的定義，並將先前定義的群組和目前群組間的間隔儲存在目前的群組內。 'name1' 是目前的群組 (選擇性)，'name2' 是先前定義的群組，'subexpression' 是任何有效的規則運算式模式。平衡群組定義會刪除 name2 的定義，並將 name2 與 name1 之間的間隔儲存在 name1 內。如果未指定 name2 群組，則比對會回溯。因為刪除 name2 的上一個定義會顯示 name2 先前的定義，所以此建構可讓您使用群組 name2 的擷取堆疊來作為計數器，用來追蹤括號或左右括弧等巢狀建構。 平衡群組定義會使用 'name2' 作為堆疊。各巢狀建構的開頭字元會置於群組和其 Group.Captures 集合內。符合右側字元時，會將其對應的左側字元從群組移除，使 Captures 集合減少一。當所有巢狀建構的左側和右側字元均相符後，'name1' 會空白。

# Regex_negative_character_range_short
source: negative character range
fr: plage de caractères négative
zh_hant: 負值字元範圍

source: Related method signatures found in metadata will not be updated.
fr: Les signatures de méthode associées dans les métadonnées ne sont pas mises à jour.
zh_hant: 將不會更新中繼資料中所找到的相關方法簽章。

source: Remove 'async' modifier
fr: Supprimer le modificateur 'async'
zh_hant: 移除 'async' 修飾元

source: Updating a '{0}' around an active statement will prevent the debug session from continuing.
fr: La mise à jour de '{0}' autour d'une instruction active va empêcher la session de débogage de se poursuivre.
zh_hant: 更新使用中陳述式前後的 '{0}'，會造成偵錯工作階段無法繼續。

source: Use block body for lambda expressions
fr: Utiliser le corps de bloc pour les expressions lambda
zh_hant: 使用 Lambda 運算式的區塊主體

source: Use expression body for lambda expressions
fr: Utiliser le corps d'expression pour les expressions lambda
zh_hant: 使用 Lambda 運算式的運算式主體

source: Use interpolated verbatim string
fr: Utiliser une chaîne verbatim interpolée
zh_hant: 使用插入的逐字字串

source: Generate enum member '{1}.{0}'
fr: Générer le membre enum '{1}.{0}'
zh_hant: 產生列舉成員 '{1}.{0}'

source: Generate constant '{1}.{0}'
fr: Générer la constante '{1}.{0}'
zh_hant: 產生常數 '{1}.{0}'

source: Generate read-only property '{1}.{0}'
fr: Générer la propriété en lecture seule '{1}.{0}'
zh_hant: 產生唯讀屬性 '{1}.{0}'

source: Generate property '{1}.{0}'
fr: Générer la propriété '{1}.{0}'
zh_hant: 產生屬性 '{1}.{0}'

source: Generate read-only field '{1}.{0}'
fr: Générer le champ en lecture seule '{1}.{0}'
zh_hant: 產生唯讀欄位 '{1}.{0}'

source: Generate field '{1}.{0}'
fr: Générer le champ '{1}.{0}'
zh_hant: 產生欄位 '{1}.{0}'

source: Global Namespace
fr: Espace de noms global
zh_hant: 全域命名空間

# Anonymous_Types_colon
source: Anonymous Types:
fr: Types anonymes :
zh_hant: 匿名類型:

source: Updating '{0}' will prevent the debug session from continuing.
fr: La mise à jour de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 會造成偵錯工作階段無法繼續。

source: Updating a complex statement containing an await expression will prevent the debug session from continuing.
fr: La mise à jour d'une instruction complexe contenant une expression await empêche la session de débogage de se poursuivre.
zh_hant: 更新包含 await 運算式的複雜陳述式會阻礙偵錯工作階段繼續進行。

source: Capturing variable '{0}' that hasn't been captured before will prevent the debug session from continuing.
fr: La capture de la variable '{0}' qui n'a pas déjà été capturée empêche la session de débogage de se poursuivre.
zh_hant: 擷取先前從未擷取過的變數 '{0}'，會讓偵錯工作階段無法繼續。

source: Ceasing to capture variable '{0}' will prevent the debug session from continuing.
fr: L'arrêt de la capture de la variable '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 停止擷取變數 '{0}' 會讓偵錯工作階段無法繼續。

source: Deleting captured variable '{0}' will prevent the debug session from continuing.
fr: La suppression de la variable capturée '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 刪除擷取到的變數 '{0}' 會導致偵錯工作階段無法繼續。

source: Changing the type of a captured variable '{0}' previously of type '{1}' will prevent the debug session from continuing.
fr: La modification du type d'une variable capturée '{0}' qui était auparavant du type '{1}' empêche la session de débogage de se poursuivre.
zh_hant: 將擷取到的變數 '{0}' 從先前的類型 '{1}' 變更為其他類型，會導致偵錯工作階段無法繼續。

source: Changing the parameters of '{0}' will prevent the debug session from continuing.
fr: La modification des paramètres de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 變更 '{0}' 的參數會讓偵錯工作階段無法繼續。

source: Changing the return type of '{0}' will prevent the debug session from continuing.
fr: Le changement du type de retour de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 變更 '{0}' 的傳回類型，會讓偵錯工作階段無法繼續。

source: Changing the type of '{0}' will prevent the debug session from continuing.
fr: La modification du type de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 變更 '{0}' 的類型會讓偵錯工作階段無法繼續。

source: Changing the declaration scope of a captured variable '{0}' will prevent the debug session from continuing.
fr: La modification de la portée de la déclaration d'une variable capturée '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 為擷取到的變數 '{0}' 變更宣告範圍，會導致偵錯工作階段無法繼續。

source: Accessing captured variable '{0}' that hasn't been accessed before in {1} will prevent the debug session from continuing.
fr: L'accès à la variable capturée '{0}' qui n'a pas fait l'objet d'un accès auparavant dans {1} empêche la session de débogage de se poursuivre.
zh_hant: 先前從未在 {1} 中存取過擷取到的變數 '{0}'，存取該變數會導致偵錯工作階段無法繼續。

source: Ceasing to access captured variable '{0}' in {1} will prevent the debug session from continuing.
fr: L'arrêt de l'accès à la variable capturée '{0}' dans {1} empêche la session de débogage de se poursuivre.
zh_hant: 停止存取 {1} 中擷取到的變數 '{0}'，會導致偵錯工作階段無法繼續。

source: Adding '{0}' that accesses captured variables '{1}' and '{2}' declared in different scopes will prevent the debug session from continuing.
fr: L'ajout de '{0}', qui accède aux variables capturées '{1}' et '{2}' déclarées dans des portées différentes, empêche la session de débogage de se poursuivre.
zh_hant: 擷取到的變數 '{1}' 及 '{2}' 具有不同的宣告範圍，新增存取這兩種變數的 '{0}' 會導致偵錯工作階段無法繼續。

source: Removing '{0}' that accessed captured variables '{1}' and '{2}' declared in different scopes will prevent the debug session from continuing.
fr: La suppression de '{0}', qui accède aux variables capturées '{1}' et '{2}' déclarées dans des portées différentes, empêche la session de débogage de se poursuivre.
zh_hant: 擷取到的變數 '{1}' 及 '{2}' 具有不同的宣告範圍，移除存取這兩種變數的 '{0}' 會導致偵錯工作階段無法繼續。

source: Adding '{0}' into a '{1}' will prevent the debug session from continuing.
fr: L'ajout de '{0}' dans un '{1}' empêche la session de débogage de se poursuivre.
zh_hant: 將 '{0}' 加入 '{1}'，會造成偵錯工作階段無法繼續。

source: Adding '{0}' into a class with explicit or sequential layout will prevent the debug session from continuing.
fr: L'ajout de '{0}' dans une classe avec une disposition explicite ou séquentielle empêche la session de débogage de se poursuivre.
zh_hant: 將 '{0}' 加入具有明確配置或循序配置的類別，會造成偵錯工作階段無法繼續。

source: Updating the modifiers of '{0}' will prevent the debug session from continuing.
fr: La mise à jour des modificateurs de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的修飾元，會造成偵錯工作階段無法繼續。

source: Updating the Handles clause of '{0}' will prevent the debug session from continuing.
fr: La mise à jour de la clause Handles de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的 Handles 子句，會造成偵錯工作階段無法繼續。

source: Adding '{0}' with the Handles clause will prevent the debug session from continuing.
fr: L'ajout de '{0}' avec la clause Handles empêchera la poursuite de la session de débogage.
zh_hant: 將 '{0}' 加入 Handles 子句會阻礙偵錯工作階段繼續執行。

source: Updating the Implements clause of a '{0}' will prevent the debug session from continuing.
fr: La mise à jour de la clause Implements de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的 Implements 子句，會造成偵錯工作階段無法繼續。

source: Changing the constraint from '{0}' to '{1}' will prevent the debug session from continuing.
fr: Le remplacement de la contrainte '{0}' en '{1}' empêche la session de débogage de se poursuivre.
zh_hant: 將條件約束從 '{0}' 變更為 '{1}'，會造成偵錯工作階段無法繼續。

source: Updating the variance of '{0}' will prevent the debug session from continuing.
fr: La mise à jour de la variance de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的變異數，會造成偵錯工作階段無法繼續。

source: Updating the type of '{0}' will prevent the debug session from continuing.
fr: La mise à jour du type de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的類型，會造成偵錯工作階段無法繼續。

source: Updating the initializer of '{0}' will prevent the debug session from continuing.
fr: La mise à jour de l'initialiseur de '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的初始設定式，會造成偵錯工作階段無法繼續。

source: Updating the size of a '{0}' will prevent the debug session from continuing.
fr: La mise à jour de la taille d'un '{0}' empêche la session de débogage de se poursuivre.
zh_hant: 更新 '{0}' 的大小，會造成偵錯工作階段無法繼續。
