Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_end_of_string_only_long
source: The \z anchor specifies that a match must occur at the end of the input string. Like the $ language element, \z ignores the RegexOptions.Multiline option. Unlike the \Z language element, \z does not match a \n character at the end of a string. Therefore, it can only match the last line of the input string.
cs: Ukotvení \z určuje, že ke shodě musí dojít na konci vstupního řetězce. Podobně jako element jazyka $ i \z ignoruje možnost RegexOptions.Multiline. Na rozdíl od elementu jazyka \Z nenajde \z shodu se znakem \n na konci řetězce. Proto může hledat shodu jenom v posledním řádku vstupního řetězce.
de: Der \z-Anker gibt an, dass eine Übereinstimmung am Ende der Eingabezeichenfolge erfolgen muss. Wie das $-Sprachelement ignoriert \z die Option "RegexOptions.Multiline". Im Gegensatz zum \Z-Sprachelement stimmt \z nicht mit einem \n-Zeichen am Ende einer Zeichenfolge überein. Daher ist nur eine Übereinstimmung mit der letzten Zeile der Eingabezeichenfolge möglich.
es: El delimitador \Z especifica que debe producirse una coincidencia al final de la cadena de entrada. Al igual que el elemento de lenguaje $, \z omite la opción RegexOptions.Multiline. A diferencia del elemento de lenguaje \Z, \z no coincide con un carácter \n al final de una cadena. Por lo tanto, solo puede coincidir con la última línea de la cadena de entrada.
fr: L'ancre \z spécifie qu'une correspondance doit exister à la fin de la chaîne d'entrée. Comme l'élément de langage $, \z ignore l'option RegexOptions.Multiline. Contrairement à l'élément de langage \Z, \z ne permet pas de rechercher une correspondance avec un \n caractère situé à la fin d'une chaîne. Il peut donc correspondre uniquement à la dernière ligne de la chaîne d'entrée.
it: L'ancoraggio \z specifica che la corrispondenza deve verificarsi alla fine della stringa di input. Come per l'elemento del linguaggio $, \z ignora l'opzione RegexOptions.Multiline. Diversamente dall'elemento del linguaggio \Z, \z non trova un carattere \n alla fine di una stringa. Di conseguenza, può trovare solo l'ultima riga della stringa di input.
ja: \z アンカーは、入力文字列の末尾で一致する必要があることを指定します。$ 言語要素と同様に、\z では RegexOptions.Multiline オプションが無視されます。\Z 言語要素とは異なり、\z は文字列末尾にある \n 文字には一致しません。したがって、入力文字列の最後の行にのみ一致することができます。
ko: \z 앵커는 입력 문자열의 끝부분에서 일치 항목을 찾도록 지정합니다. $ 언어 요소와 마찬가지로, \z는 RegexOptions.Multiline 옵션을 무시합니다. 하지만 \Z 언어 요소와 달리 \z는 문자열의 끝에 있는 \n 문자와 일치시키지 않습니다. 따라서 입력 문자열의 마지막 줄만 일치시킬 수 있습니다.
pl: Kotwica \z określa, że dopasowanie musi nastąpić na końcu ciągu wejściowego. Podobnie jak element języka $, element \z ignoruje opcję RegexOptions.Multiline. W przeciwieństwie do elementu języka \Z, element \z nie pasuje do znaku \n na końcu ciągu. Dlatego może pasować tylko do ostatniego wiersza ciągu wejściowego.
pt_br: A âncora \z especifica que uma correspondência precisa ocorrer no final da cadeia de caracteres de entrada. Como o elemento de linguagem $, \z ignora a opção RegexOptions.Multiline. Ao contrário do elemento de linguagem \Z, \z não corresponde a um caractere \n no final de uma cadeia de caracteres. Portanto, ele só pode corresponder à última linha da cadeia de caracteres de entrada.
ru: Привязка \z указывает, что соответствие должно находиться в конце входной строки. Как и элемент языка $, \z игнорирует параметр RegexOptions.Multiline. В отличие от элемента языка \Z, \z не соответствует символу \n в конце строки. Поэтому она может соответствовать только последней строке входной строки.
tr: \z yer işareti, giriş dizesinin sonunda bir eşleşmenin oluşması gerektiğini belirtir. $ dil öğesi gibi \z, RegexOptions.Multiline seçeneğini yoksayar. \Z dil öğesinin aksine \z, dizenin sonundaki bir \n karakteriyle eşleşmez. Bu nedenle, yalnızca giriş dizesinin son satırıyla eşleşebilir.
zh_hans: \z 定位点指定匹配必须出现在输入字符串的末尾。像 $ language 元素一样，\z 忽略了 RegexOptions 选项。与 \z 语言元素不同，\z 与字符串结尾的 \n 字符不匹配。因此，它只能匹配输入字符串的最后一行。
zh_hant: \z 錨點會指定比對必須出現在輸入字串的結尾。就像 $ 語言元素，\z 會忽略 RegexOptions.Multiline 選項。與 \Z 語言元素不同的是，\z 不會比對字串結尾的 \n 字元。因此，只能比對上一行的輸入字串。

# Regex_end_of_string_only_short
source: end of string only
cs: jen konec řetězce
de: Nur Ende der Zeichenfolge
es: solo el fin de la cadena
fr: fin de chaîne uniquement
it: solo fine di stringa
ja: 文字列の末尾のみ
ko: 문자열의 끝만
pl: tylko koniec ciągu
pt_br: fim da cadeia de caracteres somente
ru: только конец строки
tr: yalnızca dize sonu
zh_hans: 仅字符串末尾
zh_hant: 僅字串結尾

# Regex_end_of_string_or_before_ending_newline_long
source: The \Z anchor specifies that a match must occur at the end of the input string, or before \n at the end of the input string. It is identical to the $ anchor, except that \Z ignores the RegexOptions.Multiline option. Therefore, in a multiline string, it can only match the end of the last line, or the last line before \n. The \Z anchor matches \n but does not match \r\n (the CR/LF character combination). To match CR/LF, include \r?\Z in the regular expression pattern.
cs: Ukotvení \Z určuje, že ke shodě musí dojít na konci vstupního řetězce nebo před \n na konci vstupního řetězce. Je identické s ukotvením $, kromě toho, že \Z ignoruje možnost RegexOptions.Multiline. Proto ve víceřádkovém řetězci může najít shodu jenom na konci posledního řádku nebo v posledním řádku před \n. Ukotvení \Z najde shodu s \n, ale nenajde shodu s \r\n (kombinace znaků CR/LF). Pokud chcete hledat znaky CR/LF, zadejte do vzoru regulárního výrazu \r?\Z.
de: Der \Z-Anker gibt an, dass eine Übereinstimmung am Ende der Eingabezeichenfolge oder vor "\n" am Ende der Eingabezeichenfolge erfolgen muss. \Z ist mit dem $-Anker identisch, außer dass \Z die Option "RegexOptions.Multiline" ignoriert. Daher ist in einer mehrzeiligen Zeichenfolge nur eine Übereinstimmung mit dem Ende der letzten Zeile oder der letzten Zeile vor "\n" möglich. Der \Z-Anker entspricht "\n", stimmt jedoch nicht mit "\r\n" überein (CR/LF-Zeichenkombination). Schließen Sie "\r?\Z" in das Muster für reguläre Ausdrücke ein, um die Übereinstimmung mit CR/LF zu erreichen.
es: El delimitador \Z especifica que debe producirse una coincidencia al final de la cadena de entrada o antes de \n al final de la cadena de entrada. Es idéntico al delimitador $, excepto que \Z omite la opción RegexOptions.Multiline. Por lo tanto, en una cadena de varias líneas, solo puede coincidir con el final de la última línea o con la última línea antes de \n. El delimitador \Z coincide con \n, pero no con \r\n (la combinación de caracteres CR/LF). Para hacerlo coincidir con CR/LF, incluya \r?\Z en el patrón de expresión regular.
fr: L'ancre \Z spécifie qu'une correspondance doit exister à la fin de la chaîne d'entrée ou avant \n à la fin de la chaîne d'entrée. Elle est identique à l'ancre $, à ceci près que \Z ignore l'option RegexOptions.Multiline. Ainsi, dans une chaîne multiligne, elle peut correspondre uniquement à la fin de la dernière ligne, ou à la dernière ligne située avant \n. L'ancre \Z correspond à \n mais ne correspond pas à \r\n (combinaison de caractères CR/LF). Pour rechercher une correspondance avec CR/LF, ajoutez \r?\Z au modèle d'expression régulière.
it: L'ancoraggio \Z specifica che la corrispondenza deve verificarsi alla fine della stringa di input oppure prima di \n alla fine della stringa di input. L'ancoraggio è identico a $, ad eccezione del fatto che \Z ignora l'opzione RegexOptions.Multiline. Di conseguenza, in una stringa con più righe può trovare solo la fine dell'ultima riga oppure l'ultima riga prima di \n. L'ancoraggio \Z corrisponde a \n, ma non a \r\n (combinazione di caratteri CR/LF). Per trovare la combinazione di caratteri CR/LF, includere \r?\Z nel criterio di ricerca di espressioni regolari.
ja: \Z アンカーは、入力文字列の末尾、または入力文字列の末尾にある \n の前で一致する必要があることを指定します。これは $ アンカーと同じですが、\Z では RegexOptions.Multiline オプションが無視される点が異なります。したがって、複数行文字列では、最後の行の末尾か、\n の前の最後の行にのみ一致することができます。 \Z アンカーは \n に一致しますが、\r\n (CR/LF 文字の組み合わせ) には一致しません。CR/LF と一致させるには、\r?\Z を正規表現パターンに含めます。
ko: \Z 앵커는 입력 문자열의 끝부분이나 입력 문자열의 끝부분에 있는 \n 앞에서 일치 항목을 찾도록 지정합니다. \Z는 RegexOptions.Multiline 옵션을 무시한다는 점을 제외하고는 $ 앵커와 동일합니다. 따라서 여러 줄 문자열에서는 마지막 줄의 끝이나 \n 앞의 마지막 줄만 일치시킬 수 있습니다. \Z 앵커는 \n은 일치시키지만 \r\n(CR/LF 문자 조합)은 일치시키지 않습니다. CR/LF와 일치시키려면 정규식 패턴에 \r?\Z를 포함하세요.
pl: Kotwica \Z określa, że dopasowanie musi nastąpić na końcu ciągu wejściowego lub przed znakiem \n na końcu ciągu wejściowego. Jest ona identyczna z kotwicą $ z wyjątkiem tego, że element \Z ignoruje opcję RegexOptions.Multiline. Dlatego w przypadku ciągu wielowierszowego może zostać dopasowany tylko na końcu ostatniego wiersza lub w ostatnim wierszu przed znakiem \n. Kotwica \Z pasuje do znaku \n, ale nie do znaków \r\n (kombinacji znaków CR/LF). Aby dopasować znaki CR/LF, dołącz element \r?\Z do wzorca wyrażenia regularnego.
pt_br: A âncora \Z especifica que uma correspondência precisa ocorrer no final da cadeia de caracteres de entrada ou antes de \n no final da cadeia de caracteres de entrada. Ela é idêntica à âncora $, exceto que \Z ignora a opção RegexOptions.Multiline. Portanto, em uma cadeia de caracteres multilinha, ela pode corresponder somente ao final da última linha ou à última linha antes de \n. A âncora \Z corresponde a \n, mas não corresponde à \r\n (à combinação de caracteres CR/LF). Para corresponder a CR/LF, inclua \r?\Z no padrão de expressão regular.
ru: Привязка \Z указывает, что соответствие должно находиться в конце входной строки или перед \n в конце входной строки. Она идентична привязке $, за исключением того, что \Z игнорирует параметр RegexOptions.Multiline. Поэтому в многострочной строке она может соответствовать только концу последней строки или последней строке перед \n. Привязка \Z соответствует \n, но не соответствует значению \r\n (сочетание символов CR/LF). Чтобы обеспечить соответствие CR/LF, включите \r?\Z в шаблон регулярного выражения.
tr: \Z yer işareti, giriş dizesinin sonunda veya giriş dizesinin sonundaki \n karakterinden önce bir eşleşmenin oluşması gerektiğini belirtir. Bu karakter $ yer işareti ile aynıdır, ancak \Z, RegexOptions.Multiline seçeneğini yoksayar. Bu nedenle çok satırlı bir dizede yalnızca son satırın sonu veya \n karakterinden önceki son satır ile eşleşir. \Z yer işareti \n ile eşleşir, ancak \r\n (CR/LF karakter bileşimi) ile eşleşmez. CR/LF ile eşleştirmek Için, normal ifade desenine \r?\Z karakterini ekleyin.
zh_hans: \Z 定位点指定匹配必须出现在输入字符串的末尾或输入字符串的结尾处的 \n 之前。它与 $ 定位点相同，只不过 \Z 忽略了 RegexOptions 选项。因此，在多行字符串中，它只能匹配最后一行的结尾或 \n 前的最后一行。 \Z 定位点匹配 \n 但不匹配 \r\n (CR/LF 字符组合)。若要匹配 CR/LF，请在正则表达式模式中包含 \r?\Z。
zh_hant: \Z 錨點會指定比對必須出現在輸入字串的結尾或輸入字串結尾的 \n 之前。這與 $ 錨點相同，只是 \Z 會忽略 RegexOptions.Multiline 選項。因此，這只能比對上一行的結尾，或 \n 之前的上一行。 \Z 錨點會比對 \n，但不會比對 \r\n (CR/LF 字元的組合)。若要比對 CR/LF，請在規則運算式模式中加入 \r?\Z。

# Regex_end_of_string_or_before_ending_newline_short
source: end of string or before ending newline
cs: konec řetězce nebo před koncem nového řádku
de: Ende der Zeichenfolge oder vor dem endenden Zeilenumbruch
es: fin de cadena o antes de terminar la línea nueva
fr: fin de chaîne ou avant la fin d'une nouvelle ligne
it: fine di stringa o prima di terminare una nuova riga
ja: 文字列の末尾または最後の改行の前
ko: 문자열의 끝 또는 줄 바꿈 종료 전
pl: koniec ciągu lub przed końcowym znakiem nowego wiersza
pt_br: fim da cadeia de caracteres ou antes do fim da nova linha
ru: конец строки или до последнего символа новой строки
tr: dize sonu veya yeni satırı sonlandırmadan önce
zh_hans: 字符串末尾或结束换行符之前
zh_hant: 字串結尾或結尾的新行之前

# Regex_end_of_string_or_line_long
source: The $ anchor specifies that the preceding pattern must occur at the end of the input string, or before \n at the end of the input string. If you use $ with the RegexOptions.Multiline option, the match can also occur at the end of a line. The $ anchor matches \n but does not match \r\n (the combination of carriage return and newline characters, or CR/LF). To match the CR/LF character combination, include \r?$ in the regular expression pattern.
cs: Ukotvení $ určuje, že se předchozí vzor musí vyskytovat na konci vstupního řetězce nebo před \n na konci vstupního řetězce. Pokud použijete $ s možností RegexOptions.Multiline, může ke shodě dojít i na konci řádku. Ukotvení $ najde shodu s \n, ale nenajde shodu s \r\n (kombinace znaků návratu na začátek řádku a nového řádku, tedy znaků CR/LF). Pokud chcete hledat kombinaci znaků CR/LF, zadejte do vzoru regulárního výrazu \r?$.
de: Der $-Anker gibt an, dass das vorangehende Muster am Ende der Eingabezeichenfolge oder vor "\n" am Ende der Eingabezeichenfolge vorliegen muss. Wenn Sie $ mit der Option "RegexOptions.Multiline" verwenden, kann die Übereinstimmung auch am Ende einer Zeile erfolgen. Der $-Anker stimmt mit "\n", aber nicht mit "\r\n" überein (Kombination aus Wagenrücklauf- und Zeilenvorschubzeichen, auch CR/LF). Um der Kombination aus CR/LF-Zeichen zu entsprechen, schließen Sie "\r?$" in das Muster für reguläre Ausdrücke ein.
es: El delimitador $ especifica que el patrón anterior debe aparecer al final de la cadena de entrada, o antes de \n al final de la cadena de entrada. Si usa $ con la opción RegexOptions.Multiline, la coincidencia también puede producirse al final de una línea. El limitador $ coincide con \n pero no coincide con \r\n (la combinación de retorno de carro y caracteres de nueva línea, o CR/LF). Para hacer coincidir la combinación de caracteres CR/LF, incluya \r?$ en el patrón de expresión regular.
fr: L'ancre $ spécifie que le modèle précédent doit exister à la fin de la chaîne d'entrée ou avant \n à la fin de la chaîne d'entrée. Si vous utilisez $ avec l'option RegexOptions.Multiline, la correspondance peut également exister à la fin d'une ligne. L'ancre $ correspond à \n mais ne correspond pas à \r\n (combinaison de caractères de retour chariot et nouvelle ligne, c'est-à-dire CR/LF). Pour rechercher une correspondance avec la combinaison de caractères CR/LF, ajoutez \r?$ au modèle d'expression régulière.
it: L'ancoraggio $ specifica che il criterio precedente deve verificarsi alla fine della stringa di input oppure prima di \n alla fine della stringa di input. Se si usa $ con l'opzione RegexOptions.Multiline, la corrispondenza può verificarsi anche alla fine di una riga. L'ancoraggio $ corrisponde a \n, ma non a \r\n (combinazione di ritorno a capo e caratteri di nuova riga o CR/LF). Per trovare la combinazione di caratteri CR/LF, includere \r?$ nel criterio di ricerca di espressioni regolari.
ja: $ アンカーは、その前にあるパターンが、入力文字列の末尾、または入力文字列の末尾にある \n の前で一致する必要があることを指定します。RegexOptions.Multiline オプションを指定して $ を使用した場合は、行の末尾でも一致します。 $ アンカーは、\n に一致しますが、\r\n (復帰文字と改行文字の組み合わせ、つまり CR/LF) には一致しません。CR/LF 文字の組み合わせに一致させるには、正規表現パターンに \r?$ を含めます。
ko: $ 앵커는 입력 문자열의 끝부분이나 입력 문자열의 끝부분에 있는 \n 앞에 이전 패턴이 오도록 지정합니다. RegexOptions.Multiline 옵션과 함께 $를 사용하면 줄의 끝부분에서도 일치 항목을 찾을 수 있습니다. $ 앵커는 \n은 일치시키지만 \r\n(캐리지 리턴 및 줄 바꿈 문자 조합 또는 CR/LF)은 일치시키지 않습니다. CR/LF 문자 조합과 일치시키려면 정규식 패턴에 \r?$를 포함하세요.
pl: Kotwica $ określa, że poprzedzający wzorzec musi wystąpić na końcu ciągu wejściowego lub przed znakiem \n na końcu ciągu wejściowego. Jeśli użyjesz elementu $ z opcją RegexOptions.Multiline, dopasowanie może także nastąpić na końcu wiersza. Kotwica $ pasuje do znaku \n, lecz nie do znaków \r\n (kombinacji znaków powrotu karetki i nowego wiersza, czyli CR/LF). Aby dopasować kombinację znaków CR/LF, dołącz element \r?$ do wzorca wyrażenia regularnego.
pt_br: A âncora $ especifica que o padrão anterior precisa ocorrer no final da cadeia de caracteres de entrada ou antes de \n no final da cadeia de caracteres de entrada. Se você usar $ com a opção RegexOptions.Multiline, a correspondência também poderá ocorrer no final de uma linha. A âncora $ corresponde a \n, mas não corresponde a \r\n (a combinação dos caracteres de retorno de carro e de nova linha ou CR/LF). Para a âncora corresponder à combinação de caracteres CR/LF, inclua \r?$ no padrão de expressão regular.
ru: Привязка $ указывает, что предыдущий шаблон должен находиться в конце входной строки или перед \n в конце входной строки. Если использовать $ с параметром RegexOptions.Multiline, соответствие также может находиться в конце строки. Привязка $ соответствует \n, но не соответствует значению \r\n (сочетанию символа возврата каретки и символа новой строки, которое также обозначается как CR/LF). Чтобы обеспечить соответствие сочетанию символов CR/LF, включите \r?$ в шаблон регулярного выражения.
tr: $ yer işareti, önceki desenin giriş dizesinin sonunda veya giriş dizesinin sonundaki \n karakterinden önce gerçekleşmesi gerektiğini belirtir. $ yer işaretini RegexOptions.Multiline seçeneğiyle birlikte kullanırsanız, eşleşme bir satırın sonunda da olabilir. $ yer işareti \n ile eşleşir, ancak \r\n (satır başı ve yeni satır karakterlerinin bileşimi veya CR/LF) ile eşleşmez. CR/LF karakter bileşimiyle eşleştirmek Için, normal ifade desenine \r?$ ekleyin.
zh_hans: $ 定位点指定前面的模式必须出现在输入字符串的末尾或输入字符串结尾的 \n 之前。如果将 $ 与 RegexOptions 选项一起使用，则匹配也可以出现在行尾。 $ 定位点匹配 \n，但不匹配 \r\n (回车符和换行符的组合，或 CR/LF)。若要匹配 CR/LF 字符组合, 请在正则表达式模式中包括 \r?$。
zh_hant: $ 錨點會指定前置模式必須出現在輸入字串的結尾或輸入字串結尾的 \n 之前。若您搭配 RegexOptions.Multiline 選項使用 $，比對也可位於行的結尾。 $ 錨點會比對 \n，但不會比對 \r\n (歸位與新行字元的組合，或稱 CR/LF)。若要比對 CR/LF，請在規則運算式模式中加入 \r?$。

# Regex_end_of_string_or_line_short
source: end of string or line
cs: konec řetězce nebo řádku
de: Ende der Zeichenfolge oder Zeile
es: fin de cadena o línea
fr: fin de chaîne ou de ligne
it: fine di stringa o riga
ja: 文字列または行の末尾
ko: 문자열 또는 줄의 끝
pl: koniec ciągu lub wiersza
pt_br: fim da cadeia de caracteres ou da linha
ru: конец строковых данных или строки
tr: dize veya satır sonu
zh_hans: 字符串或行的结尾
zh_hant: 字串或行結尾

# Regex_escape_character_long
source: Matches an escape character, \u001B
cs: Shoda s řídicím znakem \u001B
de: Entspricht einem Escapezeichen, \u001B.
es: Coincide con un carácter de escape, \u001B
fr: Correspond au caractère d'échappement, \u001B
it: Trova la corrispondenza di un carattere di escape \u001B
ja: エスケープ文字 \u001B に一致します
ko: 이스케이프 문자 \u001B와 일치시킵니다.
pl: Pasuje do znaku ucieczki — \u001B
pt_br: Corresponde a um caractere de escape, \u001B
ru: Соответствует escape-символу \u001B
tr: Bir kaçış karakteriyle (\u001B) eşleşir
zh_hans: 与转义字符(\u001B)匹配
zh_hant: 比對逸出字元 \u001B

# Regex_escape_character_short
source: escape character
cs: řídicí znak
de: Escapezeichen
es: carácter de escape
fr: caractère d'échappement
it: carattere di escape
ja: エスケープ文字
ko: 이스케이프 문자
pl: znak ucieczki
pt_br: caractere de escape
ru: escape-символ
tr: kaçış karakteri
zh_hans: 转义字符
zh_hant: 逸出字元

# Regex_excluded_group
source: excluded-group
cs: vyloučená skupina
de: Ausschlussgruppe
es: grupo excluido
fr: groupe exclu
it: gruppo escluso
ja: 除外されたグループ
ko: 제외된 그룹
pl: grupa wykluczona
pt_br: grupo excluído
ru: исключенная группа
tr: hariç tutulan grup
zh_hans: 排除的组
zh_hant: 排除的群組

# Regex_expression
source: expression
cs: výraz
es: expresión
it: espressione
ja: 式
ko: 식
pl: wyrażenie
pt_br: expressão
ru: выражение
tr: ifade
zh_hans: 表达式
zh_hant: 運算式

# Regex_form_feed_character_long
source: Matches a form-feed character, \u000C
cs: Shoda se znakem pro novou stránku \u000C
de: Entspricht einem Seitenvorschubzeichen, \u000C.
es: Coincide con un carácter de avance de página, \u000C
fr: Correspond au caractère de saut de page, \u000C
it: Trova la corrispondenza di un carattere di avanzamento carta \u000C
ja: フォーム フィード文字 \u000C に一致します
ko: 용지 공급 문자 \u000C와 일치시킵니다.
pl: Pasuje do znaku wysuwu strony — \u000C
pt_br: Corresponde ao caractere de avanço de página, \u000C
ru: Соответствует символу перевода страницы \u000C
tr: Bir sonraki sayfaya geçme karakteriyle (\u000C) eşleşir
zh_hans: 与换页符(\u000C)匹配
zh_hant: 比對跳頁字元 \u000C

# Regex_form_feed_character_short
source: form-feed character
cs: znak pro novou stránku
de: Seitenvorschubzeichen
es: carácter de avance de página
fr: caractère de saut de page
it: carattere di avanzamento carta
ja: フォーム フィード文字
ko: 용지 공급 문자
pl: znak wysuwu strony
pt_br: caractere de avanço de página
ru: символ перевода страницы
tr: sonraki sayfaya geçme karakteri
zh_hans: 换页符
zh_hant: 跳頁字元
