Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# _100000ths_of_a_second_description
source: The "fffff" custom format specifier represents the five most significant digits of the seconds fraction; that is, it represents the hundred thousandths of a second in a date and time value. Although it's possible to display the hundred thousandths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu fffff představuje pět platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje stotisíciny sekundy. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "fffff" repräsentiert die fünf signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Hunderttausendstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Obwohl die Hunderttausendstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "fffff" representa los cinco dígitos más significativos de la fracción de segundos, es decir, las cienmilésimas de segundo de un valor de fecha y hora. Aunque se pueden mostrar las cienmilésimas de un componente de segundos de un valor de hora, es posible que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "fffff" représente les cinq chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les cents millièmes de seconde d'une valeur de date et d'heure. Bien qu'il soit possible d'afficher les cents millièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "fffff" rappresenta le cinque cifre più significative della frazione di secondi, ovvero i centomillesimi di secondo in un valore di data e ora. Anche se è possibile visualizzare i centomillesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "fffff" カスタム書式指定子は、秒の小数部分の有効数字上位 5 桁を表します。つまり、日時の値のうち、秒の小数部分を 100,000 分の 1 秒単位で表します。 時刻値の 100,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "fffff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 5개를 나타냅니다. 즉, 날짜 및 시간 값에서 100,000분의 1초를 나타냅니다. 시간 값의 초 부분의 100,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „fffff” reprezentuje pięć najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje stutysięczną część sekundy w wartości daty i godziny. Co prawda możliwe jest wyświetlenie składnika stutysięcznej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "fffff" representa os cinco dígitos mais significativos da fração de segundos. Ou seja, representa as centenas de milésimos de segundo em um valor de data e hora. Embora seja possível exibir as centenas de milésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "fffff" представляет пять наиболее значащих цифр дробной части секунды; то есть он представляет стотысячные доли секунды в значении даты и времени. Хотя стотысячные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "fffff" özel biçim belirticisi, saniye kesirinin en anlamlı beş basamağını; yani bir tarih ve saat değerinde saniyenin yüz binde birini temsil eder. Bir saat değerinin saniyenin yüz binde birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "fffff" 自定义格式说明符表示秒部分的五个最高有效位；即在日期和时间值中表示十万分之一秒数。 虽然时间值的秒部分可以显示到十万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "fffff" 自訂格式規範代表秒小數部分的最大有效位數為五; 換句話說，其代表日期與時間值中的十萬分之一秒。 雖然時間值的十萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 100,000ths of a second (non-zero)
cs: Stotisíciny sekundy (nenulové)
de: 100.000stel einer Sekunde (ungleich 0)
es: 1 cienmilésima parte de un segundo (no cero)
fr: 100 000es de seconde (non nul)
it: Centomillesimi di secondo (diversi da zero)
ja: 100,000 分の 1 秒単位 (0 以外)
ko: 100,000분의 1초(0이 아님)
pl: 1/100 000 sekundy (wartrość inna niż zero)
pt_br: Cem milésimos de um segundo (diferente de zero)
ru: 100 000-е доли секунды (не нуль)
tr: Saniyenin 100.000'de biri (sıfır olmayan)
zh_hans: 十万分之一秒(非零)
zh_hant: 1/100,000 秒 (非零)

# _100000ths_of_a_second_non_zero_description
source: The "FFFFF" custom format specifier represents the five most significant digits of the seconds fraction; that is, it represents the hundred thousandths of a second in a date and time value. However, trailing zeros or five zero digits aren't displayed. Although it's possible to display the hundred thousandths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu FFFFF představuje pět platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje stotisíciny sekundy. Nezobrazují se ale nuly na konci ani pět nulových číslic. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "FFFFF" repräsentiert die fünf signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Hunderttausendstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Nachgestellte Nullen oder fünf Nullstellen werden jedoch nicht angezeigt. Obwohl die Hunderttausendstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "FFFFF" representa los cinco dígitos más significativos de la fracción de segundos, es decir, las cienmilésimas de segundo de un valor de fecha y hora. Sin embargo, no se muestran los ceros finales ni los dígitos de cinco ceros. Aunque se pueden mostrar las cienmilésimas de un componente de segundos de un valor de hora, es posible que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "FFFFF" représente les cinq chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les cents millièmes de seconde d'une valeur de date et d'heure. Toutefois, les zéros de fin ou les cinq chiffres correspondant à des zéros ne sont pas affichés. Bien qu'il soit possible d'afficher les cents millièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "FFFFF" rappresenta le cinque cifre più significative della frazione di secondi, ovvero i centomillesimi di secondo in un valore di data e ora. Gli zeri finali o le cifre con cinque zeri non vengono tuttavia visualizzati. Anche se è possibile visualizzare i centomillesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "FFFFF" カスタム書式指定子は、秒の小数部分の有効数字上位 5 桁を表します。つまり、日時の値のうち、秒の小数部分を 100,000 分の 1 秒単位で表します。ただし、末尾の 0 や、5 桁連続の 0 は表示されません。 時刻値の 100,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "FFFFF" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 5개를 나타냅니다. 즉, 날짜 및 시간 값에서 100,000분의 1초를 나타냅니다. 그러나 후행 0 또는 5개의 0은 표시되지 않습니다. 시간 값의 초 부분의 100,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „FFFFF” reprezentuje pięć najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje stutysięczną część sekundy w wartości daty i godziny. Zera końcowe ani liczby z pięcioma zerami nie są jednak wyświetlane. Co prawda możliwe jest wyświetlenie składnika stutysięcznej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "FFFFF" representa os cinco dígitos mais significativos da fração de segundos. Ou seja, representa as centenas de milésimos de segundo em um valor de data e hora. No entanto, zeros à direita ou cinco dígitos de zero não são exibidos. Embora seja possível exibir as centenas de milésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "FFFFF" представляет пять наиболее значащих цифр дробной части секунды; то есть он представляет стотысячные доли секунды в значении даты и времени. При этом конечные нули или пять нулевых разрядов не отображаются. Хотя стотысячные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "FFFFF" özel biçim belirticisi, saniye kesirinin en anlamlı beş basamağını; yani bir tarih ve saat değerinde saniyenin yüz binde birini temsil eder. Ancak, sondaki sıfırlar veya beş sıfır rakamı görüntülenmez. Bir saat değerinin saniyenin yüz binde birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "FFFFF" 自定义格式说明符表示秒部分的五个最高有效位；即在日期和时间值中表示十万分之一秒数。但是，不显示尾随零或五个零位。 虽然时间值的秒部分可以显示到十万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "FFFFF" 自訂格式規範代表秒小數部分的最大有效位數為五; 換句話說，其代表日期與時間值中的十萬分之一秒。但尾端為零或五個數字皆為零時，不會顯示零。 雖然時間值的十萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 10,000ths of a second
cs: Desetitisíciny sekundy
de: 10.000stel einer Sekunde
es: 1 diezmilésima parte de un segundo
fr: 10 000es de seconde
it: Decimillesimi di secondo
ja: 10,000 分の 1 秒単位
ko: 10,000분의 1초
pl: 1/10 000 sekundy
pt_br: Dez milésimos de um segundo
ru: 10 000-е доли секунды
tr: Saniyenin 10.000'de biri
zh_hans: 万分之一秒
zh_hant: 1/10,000 秒

# _10000ths_of_a_second_description
source: The "ffff" custom format specifier represents the four most significant digits of the seconds fraction; that is, it represents the ten thousandths of a second in a date and time value. Although it's possible to display the ten thousandths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT version 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu ffff představuje čtyři platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje desetitisíciny sekundy. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT verze 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "ffff" repräsentiert die vier signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Zehntausendstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Obwohl die Zehntausendstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "ffff" representa los cuatro dígitos más significativos de la fracción de segundos, es decir, las diezmilésimas de segundo de un valor de fecha y hora. Aunque es posible mostrar las diezmilésimas de un componente de segundo de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT versión 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "ffff" représente les quatre chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les dix millièmes de seconde d'une valeur de date et d'heure. Bien qu'il soit possible d'afficher les dix millièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT version 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "ffff" rappresenta le quattro cifre più significative della frazione di secondi, ovvero i decimillesimi di secondo in un valore di data e ora. Anche se è possibile visualizzare i decimillesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "ffff" カスタム書式指定子は、秒の小数部分の有効数字上位 4 桁を表します。つまり、日時の値のうち、秒の小数部分を 10,000 分の 1 秒単位で表します。 時刻値の 10,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT バージョン 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "ffff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 4개를 나타냅니다. 즉, 날짜 및 시간 값에서 10,000분의 1초를 나타냅니다. 시간 값의 초 부분의 10,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 버전 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „ffff” reprezentuje cztery najbardziej znaczące cyfry ułamka sekundy; tzn. reprezentuje dziesięciotysięczną część sekundy w wartości daty i godziny. Co prawda możliwe jest wyświetlenie składnika dziesięciotysięcznej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "ffff" representa os quatro dígitos mais significativos da fração de segundos. Ou seja, representa os dez milésimos de segundo em um valor de data e hora. Embora seja possível exibir os dez milésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT versão 3.5 (e posterior) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "ffff" представляет четыре наиболее значащих цифры дробной части секунды; то есть он представляет десятитысячные доли секунды в значении даты и времени. Хотя десятитысячные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "ffff" özel biçim belirticisi, saniye kesirinin en anlamlı dört basamağını; yani bir tarih ve saat değerinde saniyenin on binde birini temsil eder. Bir saat değerinin saniyenin on binde birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin ölçebildiği en düşük zaman aralığına bağlıdır. Windows NT sürüm 3.5 (ve üstü) ile Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "ffff" 自定义格式说明符表示秒部分的四个最高有效位；即在日期和时间值中表示万分之一秒数。 虽然时间值的秒部分可以显示到万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "ffff" 自訂格式規範代表秒小數部分的最大有效位數為四; 換句話說，其代表日期與時間值中的萬分之一秒。 雖然時間值的萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 10,000ths of a second (non-zero)
cs: Desetitisíciny sekundy (nenulové)
de: 10.000stel einer Sekunde (ungleich 0)
es: 1 diezmilésima parte de un segundo (no cero)
fr: 10 000es de seconde (non nul)
it: Decimillesimi di secondo (diversi da zero)
ja: 10,000 分の 1 秒単位 (0 以外)
ko: 10,000분의 1초(0이 아님)
pl: 1/10 000 sekundy (wartrość inna niż zero)
pt_br: Dez milésimos de um segundo (diferente de zero)
ru: 10 000-е доли секунды (не нуль)
tr: Saniyenin 10.000'de biri (sıfır olmayan)
zh_hans: 万分之一秒(非零)
zh_hant: 1/10,000 秒 (非零)
