Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_positive_character_range_long
source: A positive character range specifies a range of characters, any one of which may appear in an input string for a match to occur. 'firstCharacter' is the character that begins the range and 'lastCharacter' is the character that ends the range.
cs: Pozitivní rozsah znaků určuje rozsah znaků, z nichž kterýkoli se může objevit ve vstupním řetězci, aby došlo ke shodě. firstCharacter je znak, kterým rozsah začíná, a lastCharacter je znak, kterým rozsah končí.
de: Ein positiver Zeichenbereich gibt einen Bereich von Zeichen an, von denen jedes in einer Eingabezeichenfolge enthalten sein kann, damit eine Übereinstimmung auftritt. "firstCharacter" ist das erste Zeichen und "lastCharacter" das letzte Zeichen des Bereichs.
es: Un intervalo de caracteres positivo especifica un intervalo de caracteres, cualquiera de los cuales puede aparecer en una cadena de entrada para que se produzca una coincidencia. "firstCharacter" es el carácter con el que comienza el intervalo y "lastCharacter" es el carácter cpm el que finaliza el intervalo.
fr: Une plage de caractères positive spécifie une plage de caractères, dont l'un d'entre eux peut apparaître dans une chaîne d'entrée pour produire une correspondance. 'firstCharacter' est le caractère de début de plage, et 'lastCharacter' est le caractère de fin de plage.
it: Un intervallo di caratteri positivi specifica un intervallo di caratteri che possono essere presenti in una stringa di input per trovare una corrispondenza. 'firstCharacter' è il carattere che inizia l'intervallo e 'lastCharacter' è il carattere che lo termina.
ja: 文字範囲の肯定では、いずれかが入力文字列に含まれると一致と見なされる文字の範囲を指定します。'firstCharacter' は範囲の先頭の文字で、'lastCharacter' は範囲の末尾の文字です。
ko: 긍정 문자 범위는 일치 항목을 찾을 입력 문자열에 표시될 수 있는 문자 범위를 지정합니다. 'firstCharacter'는 범위를 시작하는 문자이고 'lastCharacter'는 범위를 끝내는 문자입니다.
pl: Pozytywny zakres znaków określa zakres znaków, z których dowolny może się pojawić się w ciągu wejściowym, aby nastąpiło dopasowanie. Element „firstCharacter” to znak rozpoczynający zakres, a element „lastCharacter” to znak kończący zakres.
pt_br: Um intervalo de caracteres positivos especifica um intervalo de caracteres, em que qualquer um deles pode aparecer em uma cadeia de caracteres de entrada para que uma correspondência ocorra. 'firstCharacter' é o caractere que inicia o intervalo e 'lastCharacter' é o caractere que termina o intervalo.
ru: Положительная группа символов задает диапазон символов, любой из которых может выводиться во входной строке для выполняемого сопоставления. firstCharacter — это первый символ диапазона, а lastCharacter — последний.
tr: Pozitif bir karakter aralığı, herhangi bir eşleşme olması için giriş dizesinde görünebilir bir karakter aralığı belirtir. 'firstCharacter', aralığı başlatan karakter ve 'lastCharacter', aralığı sonlandıran karakterdir.
zh_hans: 正字符范围指定一个字符范围，其中的任何一个字符都可能出现在输入字符串中，以使匹配发生。 "firstCharacter" 是该范围的起始字符，而 "lastCharacter" 是该范围的结束字符。
zh_hant: 正的字元範圍會指定字元範圍，其中的任一字元都可能會出現在輸入字串中，以便比對發生。'firstCharacter' 是開始範圍的字元，'lastCharacter' 則是結束範圍的字元。

# Regex_positive_character_range_short
source: positive character range
cs: pozitivní rozsah znaků
de: Positiver Zeichenbereich
es: intervalo de caracteres positivos
fr: plage de caractères positive
it: intervallo di caratteri positivi
ja: 文字範囲の肯定
ko: 긍정 문자 범위
pl: pozytywny zakres znaków
pt_br: intervalo de caracteres positivos
ru: положительный диапазон символов
tr: pozitif karakter aralığı
zh_hans: 正字符范围
zh_hant: 正值字元範圍

# Regex_punctuation_close
source: punctuation, close
cs: interpunkce, uzavření
de: Interpunktion, schließen
es: puntuación, cerrar
fr: ponctuation, fermeture
it: punteggiatura, chiusura
ja: 句読点、閉じ
ko: 문장 부호, 닫기
pl: interpunkcja, zamknięcie
pt_br: pontuação, fechar
ru: пунктуация, закрытие
tr: noktalama, kapat
zh_hans: 标点，结束
zh_hant: 標點符號，封閉

# Regex_punctuation_connector
source: punctuation, connector
cs: interpunkce, spojovník
de: Interpunktion, Verbindung
es: puntuación, conector
fr: ponctuation, connecteur
it: punteggiatura, connettore
ja: 句読点、接続
ko: 문장 부호, 연결선
pl: interpunkcja, łącznik
pt_br: pontuação, conector
ru: пунктуация, соединитель
tr: noktalama, bağlayıcı
zh_hans: 标点，连接符
zh_hant: 標點符號，連接子

# Regex_punctuation_dash
source: punctuation, dash
cs: interpunkce, pomlčka
de: Interpunktion, Bindestrich
es: puntuación, guion
fr: ponctuation, tiret
it: punteggiatura, trattino
ja: 句読点、ダッシュ
ko: 문장 부호, 대시
pl: interpunkcja, myślnik
pt_br: pontuação, traço
ru: пунктуация, тире
tr: noktalama, tire
zh_hans: 标点，短划线
zh_hant: 標點符號，破折號

# Regex_punctuation_final_quote
source: punctuation, final quote
cs: interpunkce, koncová uvozovka
de: Interpunktion, schließendes Anführungszeichen
es: puntuación, comilla final
fr: ponctuation, guillemet final
it: punteggiatura, virgoletta finale
ja: 句読点、終了引用符
ko: 문장 부호, 마지막 따옴표
pl: interpunkcja, cudzysłów końcowy
pt_br: pontuação, aspa final
ru: пунктуация, конечная кавычка
tr: noktalama, son alıntı
zh_hans: 标点，右引号
zh_hant: 標點符號，最後引號

# Regex_punctuation_initial_quote
source: punctuation, initial quote
cs: interpunkce, počáteční uvozovka
de: Interpunktion, öffnendes Anführungszeichen
es: puntuación, comilla inicial
fr: ponctuation, guillemet initial
it: punteggiatura, virgoletta iniziale
ja: 句読点、開始引用符
ko: 문장 부호, 처음 따옴표
pl: interpunkcja, cudzysłów początkowy
pt_br: pontuação, aspa inicial
ru: пунктуация, начальная кавычка
tr: noktalama, ilk alıntı
zh_hans: 标点，左引号
zh_hant: 標點符號，初始引號

# Regex_punctuation_open
source: punctuation, open
cs: interpunkce, otevření
de: Interpunktion, öffnen
es: puntuación, abrir
fr: ponctuation, ouverture
it: punteggiatura, apertura
ja: 句読点、開き
ko: 문장 부호, 열기
pl: interpunkcja, otwarcie
pt_br: pontuação, abrir
ru: пунктуация, открытие
tr: noktalama, açık
zh_hans: 标点，开始
zh_hant: 標點符號，開放

# Regex_punctuation_other
source: punctuation, other
cs: interpunkce, jiné
de: Interpunktion, sonstige
es: puntuación, otro
fr: ponctuation, autre
it: punteggiatura, altro
ja: 句読点、その他
ko: 문장 부호, 기타
pl: interpunkcja, inne
pt_br: pontuação, outros
ru: пунктуация, другие
tr: noktalama, diğer
zh_hans: 标点，其他
zh_hant: 標點符號，其他

# Regex_separator_line
source: separator, line
cs: oddělovač, čára
de: Trennzeichen, Zeile
es: separador, línea
fr: séparateur, ligne
it: separatore, riga
ja: 区切り、行
ko: 구분 기호, 줄
pl: separator, wiersz
pt_br: separador, linha
ru: разделитель, строка
tr: ayıraç, satır
zh_hans: 分隔符，行
zh_hant: 分隔符號，線條

# Regex_separator_paragraph
source: separator, paragraph
cs: oddělovač, odstavec
de: Trennzeichen, Absatz
es: separador, párrafo
fr: séparateur, paragraphe
it: separatore, paragrafo
ja: 区切り、段落
ko: 구분 기호, 단락
pl: separator, akapit
pt_br: separador, parágrafo
ru: разделитель, абзац
tr: ayıraç, paragraf
zh_hans: 分隔符，段落
zh_hant: 分隔符號，段落

# Regex_separator_space
source: separator, space
cs: oddělovač, mezera
de: Trennzeichen, Leerzeichen
es: separador, espacio
fr: séparateur, espace
it: separatore, spazio
ja: 区切り、空白
ko: 구분 기호, 공백
pl: separator, spacja
pt_br: separador, espaço
ru: разделитель, пробел
tr: ayıraç, boşluk
zh_hans: 分隔符，空格
zh_hant: 分隔符號，空格

# Regex_start_of_string_only_long
source: The \A anchor specifies that a match must occur at the beginning of the input string. It is identical to the ^ anchor, except that \A ignores the RegexOptions.Multiline option. Therefore, it can only match the start of the first line in a multiline input string.
cs: Ukotvení \A určuje, že ke shodě musí dojít na začátku vstupního řetězce. Je identické s ukotvením ^, kromě toho, že \A ignoruje možnost RegexOptions.Multiline. Proto může hledat shodu jenom na začátku prvního řádku ve víceřádkovém vstupním řetězci.
de: Der \A-Anker gibt an, dass eine Übereinstimmung am Anfang der Eingabezeichenfolge erfolgen muss. Er ist identisch mit dem ^-Anker, mit der Ausnahme, dass \A die Option "RegexOptions.Multiline" ignoriert. Daher ist nur eine Übereinstimmung mit dem Anfang der ersten Zeile in einer mehrzeiligen Eingabezeichenfolge möglich.
es: El delimitador \A especifica que debe producirse una coincidencia al principio de la cadena de entrada. Es idéntico al delimitador ^, excepto que \A omite la opción RegexOptions.Multiline. Por lo tanto, solo puede coincidir con el inicio de la primera línea en una cadena de entrada de varias líneas.
fr: L'ancre \A spécifie qu'une correspondance doit exister au début de la chaîne d'entrée. Elle est identique à l'ancre ^, à ceci près que \A ignore l'option RegexOptions.Multiline. Ainsi, elle correspond uniquement au début de la première ligne d'une chaîne d'entrée multiligne.
it: L'ancoraggio \A specifica che la corrispondenza deve verificarsi all'inizio della stringa di input. L'ancoraggio è identico a ^, ad eccezione del fatto che \A ignora l'opzione RegexOptions.Multiline. Di conseguenza, può trovare solo l'inizio della prima riga in una stringa di input con più righe.
ja: \A アンカーは、入力文字列の先頭で一致する必要があることを指定します。これは ^ アンカーと同じですが、\A では RegexOptions.Multiline オプションが無視される点が異なります。したがって、複数行の入力文字列では最初の行の先頭にのみ一致することができます。
ko: \A 앵커는 입력 문자열의 시작 부분에서 일치 항목을 찾도록 지정합니다. \A가 RegexOptions.Multiline 옵션을 무시한다는 점을 제외하고는 ^ 앵커와 동일합니다. 따라서 여러 줄 입력 문자열에서 첫 번째 줄의 시작 부분만 찾을 수 있습니다.
pl: Kotwica \A określa, że dopasowanie musi nastąpić na początku ciągu wejściowego. Jest ona identyczna z kotwicą ^ z tym wyjątkiem, że kotwica \A ignoruje opcję RegexOptions.Multiline. Dlatego może pasować tylko na początku pierwszego wiersza wielowierszowego ciągu wejściowego.
pt_br: A âncora \A especifica que uma correspondência precisa ocorrer no início da cadeia de caracteres de entrada. Ela é idêntica à âncora ^, exceto que \A ignora a opção RegexOptions.Multiline. Portanto, ela só pode corresponder ao início da primeira linha em uma cadeia de caracteres de entrada multilinha.
ru: Привязка \A указывает, что совпадение должно находиться в начале входной строки. Она идентична привязке ^, за исключением того, что \A игнорирует параметр RegexOptions.Multiline. Поэтому она может соответствовать только началу первой строки в многострочной входной строке.
tr: \A yer işareti, giriş dizesinin başlangıcında bir eşleşmenin oluşması gerektiğini belirtir. ^ yer işaretiyle aynıdır, ancak \A RegexOptions.Multiline seçeneğini yoksayar. Bu nedenle, çok satırlı bir giriş dizesinde yalnızca ilk satırın başlangıcı ile eşleşebilir.
zh_hans: \A 定位点指定匹配必须出现在输入字符串的开头。它与 ^ 定位点相同，只不过 \A 忽略了 RegexOptions 选项。因此，它只能匹配多行输入字符串中第一行的开头。
zh_hant: \A 錨點會指定比對必須出現在輸入字串開頭。其與 ^ 錨點相同，差異在於 \A 會忽略 RegexOptions.Multiline 選項。因此，這個錨點只能多行輸入字串的第一行開頭。

# Regex_start_of_string_only_short
source: start of string only
cs: jen začátek řetězce
de: Nur Anfang der Zeichenfolge
es: solo el inicio de la cadena
fr: début de chaîne uniquement
it: solo inizio di stringa
ja: 文字列の先頭のみ
ko: 문자열의 시작만
pl: tylko początek ciągu
pt_br: somente início de cadeia de caracteres
ru: только начало строки
tr: yalnızca dize başlangıcı
zh_hans: 仅字符串的开头
zh_hant: 僅字串開頭

# Regex_start_of_string_or_line_long
source: The ^ anchor specifies that the following pattern must begin at the first character position of the string. If you use ^ with the RegexOptions.Multiline option, the match must occur at the beginning of each line.
cs: Ukotvení ^ určuje, že následující vzor musí začínat na pozici prvního znaku řetězce. Pokud použijete ^ s možností RegexOptions.Multiline, musí ke shodě dojít na začátku každého řádku.
de: Der ^-Anker gibt an, dass das folgende Muster an der ersten Zeichenposition der Zeichenfolge beginnen muss. Wenn Sie "^" mit der Option "RegexOptions.Multiline" verwenden, muss die Übereinstimmung am Anfang jeder Zeile erfolgen.
es: El delimitador ^ especifica que el siguiente patrón debe comenzar en la primera posición de carácter de la cadena. Si usa ^ con la opción RegexOptions.Multiline, la coincidencia debe producirse al principio de cada línea.
fr: L'ancre ^ spécifie que le modèle suivant doit commencer à la position du premier caractère de la chaîne. Si vous utilisez ^ avec l'option RegexOptions.Multiline, la correspondance doit exister au début de chaque ligne.
it: L'ancoraggio ^ specifica che il criterio seguente deve iniziare in corrispondenza della posizione del primo carattere della stringa. Se si usa ^ con l'opzione RegexOptions.Multiline, la corrispondenza deve verificarsi all'inizio di ogni riga.
ja: ^ アンカーは、その後に続くパターンが、文字列の最初の文字位置から始まる必要があることを指定します。RegexOptions.Multiline オプションを指定して ^ を使用した場合は、各行の先頭で一致する必要があります。
ko: ^ 앵커는 다음 패턴이 문자열의 첫 번째 문자 위치에서 시작하도록 지정합니다. ^ 기호를 RegexOptions.Multiline 옵션과 함께 사용하는 경우 각 줄의 시작 부분에 일치 항목이 있어야 합니다.
pl: Kotwica ^ określa, że następujący wzorzec musi rozpoczynać się od położenia pierwszego znaku ciągu. Jeśli użyjesz kotwicy ^ z opcją RegexOptions.Multiline, dopasowanie musi nastąpić na początku każdego wiersza.
pt_br: A âncora ^ especifica que o padrão a seguir precisa começar na primeira posição de caractere da cadeia de caracteres. Se você usar ^ com a opção RegexOptions.Multiline, a correspondência deverá ocorrer no início de cada linha.
ru: Привязка ^ указывает, что следующий шаблон должен начинаться с позиции первого знака строки. Если вы используете ^ с параметром RegexOptions.Multiline, совпадение должно находиться в начале каждой строки.
tr: ^ yer işareti, aşağıdaki desenin dizenin ilk karakter konumunda başlaması gerektiğini belirtir. ^ işaretini RegexOptions.Multiline seçeneğiyle kullanırsanız, eşleşme her satırın başlangıcında oluşmalıdır.
zh_hans: ^ 定位点指定以下模式必须从字符串的第一个字符位置开始。如果使用 ^ 和 RegexOptions 选项，则匹配必须出现在每行的开头。
zh_hant: ^ 錨點會指定下列模式必須從字串第一個字元的位置開始。如果您搭配 RegexOptions.Multiline 選項使用 ^，比對就必須出現在每一行的開頭。

# Regex_start_of_string_or_line_short
source: start of string or line
cs: začátek řetězce nebo řádku
de: Anfang der Zeichenfolge oder Zeile
es: Inicio de cadena o línea
fr: début de chaîne ou de ligne
it: inizio di stringa o riga
ja: 文字列または行の先頭
ko: 문자열 또는 줄의 시작
pl: początek ciągu lub wiersza
pt_br: início de cadeia de caracteres ou de linha
ru: начало строковых данных или строки
tr: dize veya satır başlangıcı
zh_hans: 字符串或行的开头
zh_hant: 字串或行開頭

# Regex_subexpression
source: subexpression
cs: dílčí výraz
de: Teilausdruck
es: subexpresión
fr: sous-expression
it: sottoespressione
ja: 部分式
ko: 하위 식
pl: podwyrażenie
pt_br: subexpressão
ru: часть выражения
tr: alt ifade
zh_hans: 子表达式
zh_hant: 子運算式

# Regex_symbol_currency
source: symbol, currency
cs: symbol, měna
de: Symbol, Währung
es: símbolo, moneda
fr: symbole, devise
it: simbolo, valuta
ja: 記号、通貨
ko: 기호, 통화
pl: symbol, waluta
pt_br: símbolo, moeda
ru: символ, валюта
tr: sembol, para birimi
zh_hans: 符号，货币
zh_hant: 符號，貨幣

# Regex_symbol_math
source: symbol, math
cs: symbol, matematický
de: Symbol, Mathematik
es: símbolo, matemático
fr: symbole, math
it: simbolo, matematica
ja: 記号、数学
ko: 기호, 수학
pl: symbol, matematyka
pt_br: símbolo, matemática
ru: символ, математика
tr: sembol, matematik
zh_hans: 符号，数学
zh_hant: 符號，數學

# Regex_symbol_modifier
source: symbol, modifier
cs: symbol, modifikátor
de: Symbol, Modifizierer
es: símbolo, modificador
fr: symbole, modificateur
it: simbolo, modificatore
ja: 記号、修飾子
ko: 기호, 한정자
pl: symbol, modyfikator
pt_br: símbolo, modificador
ru: символ, модификатор
tr: sembol, değiştirici
zh_hans: 符号，修饰符
zh_hant: 符號，修飾元

# Regex_symbol_other
source: symbol, other
cs: symbol, jiné
de: Symbol, sonstige
es: símbolo, otro
fr: symbole, autre
it: simbolo, altro
ja: 記号、その他
ko: 기호, 기타
pl: symbol, inny
pt_br: símbolo, outro
ru: символ, другое
tr: sembol, diğer
zh_hans: 符号，其他
zh_hant: 符號，其他

# Regex_tab_character_long
source: Matches a tab character, \u0009
cs: Shoda se znakem tabulátoru \u0009
de: Entspricht einem Tabstoppzeichen, \u0009.
es: Coincide con un carácter de tabulación, \u0009
fr: Correspond au caractère de tabulation, \u0009
it: Trova la corrispondenza di un carattere di tabulazione \u0009
ja: タブ文字 \u0009 に一致します
ko: 탭 문자 \u0009와 일치시킵니다.
pl: Pasuje do znaku tabulacji — \u0009
pt_br: Corresponde a um caractere de tabulação, \u0009
ru: Соответствует знаку табуляции \u0009
tr: Bir sekme karakteriyle (\u0009) eşleşir
zh_hans: 与制表符(\u0009)匹配
zh_hant: 比對定位字元 \u0009

# Regex_tab_character_short
source: tab character
cs: znak tabulátoru
de: Tabstoppzeichen
es: carácter de tabulación
fr: caractère de tabulation
it: carattere di tabulazione
ja: タブ文字
ko: 탭 문자
pl: znak tabulacji
pt_br: caractere de tabulação
ru: знак табуляции
tr: sekme karakteri
zh_hans: 制表符
zh_hant: 定位字元

# Regex_unicode_category_long
source: The regular expression construct \p{ name } matches any character that belongs to a Unicode general category or named block, where name is the category abbreviation or named block name.
cs: Konstruktor regulárního výrazu \p{ name } odpovídá libovolnému znaku, který patří do obecné kategorie Unicode nebo pojmenovaného bloku, kde name je zkratka pro kategorii nebo název pojmenovaného bloku.
de: Das Konstrukt des regulären Ausdrucks "\p{ name }" entspricht einem beliebigen Zeichen, das zu einer allgemeinen Unicode-Kategorie oder einem benannten Block gehört, wobei "name" der Kategorieabkürzung oder dem Namen des benannten Blocks entspricht.
es: El constructor de expresión regular \p{ name } coincide con cualquier carácter que pertenezca a una categoría general o bloque con nombre de Unicode, donde el nombre es la abreviatura de la categoría o el nombre del bloque con nombre.
fr: La construction d'expression régulière \p{ nom } correspond aux caractères qui appartiennent à une catégorie générale Unicode ou à un bloc nommé, nom étant l'abréviation de la catégorie ou le nom du bloc nommé.
it: Il costrutto di espressione regolare \p{ name } corrisponde a qualsiasi carattere appartenente a una categoria generale Unicode o a un blocco denominato, dove name è l'abbreviazione della categoria o il nome del blocco denominato.
ja: 正規表現のコンストラクト \p{ name } は、Unicode 一般カテゴリまたは名前付きブロックに属する任意の文字に一致します。ここで、name はカテゴリの省略形または名前付きブロックの名前です。
ko: 정규식 구문 \p{ name }는 유니코드 일반 범주 또는 명명된 블록에 속하는 모든 문자와 일치시킵니다. 여기서, name은 범주 약어 또는 명명된 블록 이름입니다.
pl: Konstrukcja wyrażenia regularnego \p{ name } pasuje do dowolnego znaku należącego do ogólnej kategorii Unicode lub bloku nazwanego, gdzie „nazwa” to skrót kategorii lub nazwa bloku nazwanego.
pt_br: O constructo de expressão regular \p{ name } corresponde a qualquer caractere que pertença a uma categoria genérica Unicode ou a um bloco nomeado, em que o nome seja a abreviação da categoria ou o nome do bloco nomeado.
ru: Конструкция регулярного выражения \p{ name } соответствует любому символу, который относится к общей категории Юникода или именованному блоку, где "имя" — это сокращение названия категории или имя именованного блока.
tr: \p{ name } normal ifade yapısı, bir Unicode genel kategorisine veya adın kategori kısaltması veya adlandırılmış blok adı olduğu adlandırılmış bloğa ait olan herhangi bir karakterle eşleşir.
zh_hans: 正则表达式构造 \p{ name } 匹配属于 Unicode 通用类别或命名块的任何字符，其中 "name" 是类别缩写或命名块名称。
zh_hant: 規則運算式建構 \P{ name } 會比對任何屬於 Unicode 一般分類或具名區塊的字元，其中名稱為分類縮寫或具名區塊名稱。

# Regex_unicode_category_short
source: unicode category
cs: kategorie Unicode
de: Unicode-Kategorie
es: categoría unicode
fr: catégorie Unicode
it: categoria Unicode
ja: Unicode カテゴリ
ko: 유니코드 범주
pl: kategoria unicode
pt_br: categoria unicode
ru: категория Юникода
tr: Unicode kategorisi
zh_hans: Unicode 类别
zh_hant: Unicode 分類

# Regex_unicode_escape_long
source: Matches a UTF-16 code unit whose value is #### hexadecimal.
cs: Shoda s jednotkou kódu UTF-16, jejíž šestnáctková hodnota je ####
de: Entspricht einer UTF-16-Codeeinheit, deren Wert hexadezimal (####) ist.
es: Coincide con una unidad de código UTF-16 cuyo valor es #### hexadecimal.
fr: Correspond à une unité de code UTF-16 dont la valeur est au format hexadécimal ####.
it: Trova la corrispondenza di un'unità di codice UTF-16 il cui valore è l'esadecimale ####.
ja: 値が #### 16 進数の UTF-16 コード単位に一致します。
ko: 값이 #### 16진수인 UTF-16 코드 단위와 일치시킵니다.
pl: Pasuje do jednostki kodu UTF-16, której wartość szesnastkowa to ####.
pt_br: Corresponde a uma unidade de código UTF-16 cujo valor é o hexadecimal ####.
ru: Соответствует блоку кода UTF-16, шестнадцатеричное значение которого равно ####.
tr: #### onaltılık değeri olan bir UTF-16 kod birimiyle eşleşir.
zh_hans: 与值为 ####十六进制的 utf-16 代码单元匹配。
zh_hant: 比對值為 #### 十六進位的 UTF-16 代碼單元。

# Regex_unicode_escape_short
source: unicode escape
cs: řídicí znak Unicode
de: Unicode-Escapezeichen
es: escape unicode
fr: échappement Unicode
it: carattere di escape Unicode
ja: Unicode エスケープ
ko: 유니코드 이스케이프
pl: znak ucieczki unicode
pt_br: escape unicode
ru: escape-символ Юникода
tr: Unicode kaçışı
zh_hans: Unicode 转义
zh_hant: unicode 逸出

# Regex_unicode_general_category_0
source: Unicode General Category: {0}
cs: Obecná kategorie Unicode: {0}
de: Allgemeine Unicode-Kategorie: {0}
es: Categoría General de Unicode: {0}
fr: Catégorie générale Unicode : {0}
it: Categoria generale Unicode: {0}
ja: Unicode 一般カテゴリ: {0}
ko: 유니코드 일반 범주: {0}
pl: Kategoria ogólna Unicode: {0}
pt_br: Categoria Geral Unicode: {0}
ru: Общая категория Юникода: {0}
tr: Unicode Genel Kategorisi: {0}
zh_hans: Unicode 通用类别: {0}
zh_hant: Unicode 一般分類: {0}

# Regex_vertical_tab_character_long
source: Matches a vertical-tab character, \u000B
cs: Shoda se znakem svislého tabulátoru \u000B
de: Entspricht einem vertikalen Tabstoppzeichen, \u000B.
es: Coincide con un carácter de tabulación vertical, \u000B
fr: Correspond au caractère de tabulation verticale, \u000B
it: Trova la corrispondenza di un carattere di tabulazione verticale \u000B
ja: 垂直タブ文字 \u000B に一致します
ko: 세로 탭 문자 \u000B와 일치시킵니다.
pl: Pasuje do znaku tabulacji pionowej — \u000B
pt_br: Corresponde a um caractere de tabulação vertical, \u000B
ru: Соответствует знаку вертикальной табуляции \u000B
tr: Dikey sekme karakteriyle (\u000B) eşleşir
zh_hans: 与垂直制表符(\u000B)匹配
zh_hant: 比對垂直定位字元 \u000B

# Regex_vertical_tab_character_short
source: vertical-tab character
cs: znak svislého tabulátoru
de: Vertikales Tabstoppzeichen
es: carácter de tabulación vertical
fr: caractère de tabulation verticale
it: carattere di tabulazione verticale
ja: 垂直タブ文字
ko: 세로 탭 문자
pl: znak tabulacji pionowej
pt_br: caractere de tabulação vertical
ru: знак вертикальной табуляции
tr: dikey sekme karakteri
zh_hans: 垂直制表符
zh_hant: 垂直定位字元
