Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# month_day_description
source: The "M" or "m" standard format specifier represents a custom date and time format string that is defined by the current DateTimeFormatInfo.MonthDayPattern property. For example, the custom format string for the invariant culture is "MMMM dd".
cs: Specifikátor standardního formátu M nebo m představuje řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.MonthDayPattern. Například řetězec vlastního formátu pro invariantní jazykovou verzi je MMMM dd.
de: Der Standardformatbezeichner "M" oder "m" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die aktuelle DateTimeFormatInfo.MonthDayPattern-Eigenschaft definiert ist. Die benutzerdefinierte Formatzeichenfolge für die invariante Kultur lautet beispielsweise "MMMM dd".
es: El especificador de formato estándar "M" o "m" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.MonthDayPattern actual. Por ejemplo, la cadena de formato personalizado para la referencia cultural invariable es "MMMM dd".
fr: Le spécificateur de format standard "M" ou "m" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.MonthDayPattern actuelle. Par exemple, la chaîne de format personnalisée pour la culture invariante est "MMMM dd".
it: L'identificatore di formato standard "M" o "m" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.MonthDayPattern corrente. Ad esempio, la stringa di formato personalizzata per le impostazioni cultura inglese non dipendenti da paese/area geografica è "MMMM dd".
ja: "M" または "m" 標準書式指定子は、現在の DateTimeFormatInfo.MonthDayPattern プロパティで定義されているカスタム日時書式指定文字列を表します。たとえば、インバリアント カルチャのカスタム書式指定文字列は "MMMM dd" です。
ko: "M" 또는 "m" 표준 형식 지정자는 현재 DateTimeFormatInfo.MonthDayPattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 예를 들어, 고정 문화권의 사용자 지정 형식 문자열은 "MMMM dd"입니다.
pl: Standardowy specyfikator formatu „M” lub „m” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez bieżącą właściwość DateTimeFormatInfo.MonthDayPattern. Na przykład niestandardowy ciąg formatu dla kultury niezmiennej to „MMMM dd”.
pt_br: O especificador de formato padrão "M" ou "m" representa uma cadeia de caracteres de formato personalizado de data e hora definida pela propriedade DateTimeFormatInfo.MonthDayPattern atual. Por exemplo, a cadeia de caracteres de formato personalizado para a cultura invariável é "MMMM dd".
ru: Описатель стандартного формата "M" или "m" представляет строку пользовательского формата даты и времени, определяемую текущим свойством DateTimeFormatInfo.MonthDayPattern. Например, строка пользовательского формата для инвариантных языка и региональных параметров имеет вид "MMMM dd".
tr: "M" veya "m" standart biçim belirticisi, geçerli DateTimeFormatInfo.MonthDayPattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Örneğin, sabit kültür için özel biçim dizesi "MMMM dd"dir.
zh_hans: "M" 或 "m" 标准格式说明符表示由当前 DateTimeFormatInfo.MonthDayPattern 属性定义的自定义日期和时间格式字符串。例如，固定区域性的自定义格式字符串为 "MMMM dd"。
zh_hant: "M" 或 "m" 標準格式規範代表由目前 DateTimeFormatInfo.MonthDayPattern 屬性所定義的自訂日期與時間格式字串。例如，不因文化特性而異的自訂格式字串為 "MMMM dd"。

source: month (full)
cs: měsíc (úplný)
de: Monat (vollständig)
es: mes (completo)
fr: mois (complet)
it: Mese (esteso)
ja: 月 (完全)
ko: 월(전체)
pl: miesiąc (pełny)
pt_br: mês (completo)
ru: месяц (полностью)
tr: ay (tam)
zh_hans: 月(完整)
zh_hant: 月份 (完整)

# month_full_description
source: The "MMMM" custom format specifier represents the full name of the month. The localized name of the month is retrieved from the DateTimeFormatInfo.MonthNames property of the current or specified culture.
cs: Specifikátor vlastního formátu MMMM reprezentuje celý název měsíce. Lokalizovaný název měsíce se načítá z vlastnosti DateTimeFormatInfo.MonthNames aktuální nebo zadané jazykové verze.
de: Der benutzerdefinierte Formatbezeichner "MMMM" repräsentiert den vollständigen Namen des Monats. Der lokalisierte Name des Monats wird aus der DateTimeFormatInfo.MonthNames-Eigenschaft der aktuellen oder angegebenen Kultur abgerufen.
es: El especificador de formato personalizado "MMMM" representa el nombre completo del mes. El nombre adaptado del mes se recupera de la propiedad DateTimeFormatInfo.AbbreviatedMonthNames de la referencia cultural actual o especificada.
fr: Le spécificateur de format personnalisé "MMMM" représente le nom complet du mois. Le nom localisé du mois est récupéré à partir de la propriété DateTimeFormatInfo.MonthNames de la culture actuelle ou spécifiée.
it: L'identificatore di formato personalizzato "MMMM" rappresenta il nome esteso del mese. Il nome localizzato del mese viene recuperato dalla proprietà DateTimeFormatInfo.MonthNames delle impostazioni cultura correnti o specificate.
ja: "MMMM" カスタム書式指定子は、月の完全名を表します。月のローカライズされた名前は、現在のカルチャまたは指定されたカルチャの DateTimeFormatInfo.MonthNames プロパティから取得されます。
ko: "MMMM" 사용자 지정 형식 지정자는 월의 전체 이름을 나타냅니다. 월의 지역화된 이름은 현재 문화권 또는 지정된 문화권의 DateTimeFormatInfo.MonthNames 속성에서 검색됩니다.
pl: Niestandardowy specyfikator formatu „MMMM” reprezentuje pełną nazwę miesiąca. Zlokalizowana nazwa miesiąca jest pobierana z właściwości DateTimeFormatInfo.MonthNames bieżącej lub określonej kultury.
pt_br: O especificador de formato personalizado "MMMM" representa o nome completo do mês. O nome localizado do mês é recuperado da propriedade DateTimeFormatInfo.MonthNames da cultura atual ou especificada.
ru: Описатель пользовательского формата "MMMM" представляет полное название месяца. Локализованное название месяца извлекается из свойства DateTimeFormatInfo.MonthNames текущих или заданных языка и региональных параметров.
tr: "MMMM" özel biçim belirticisi, ayın tam adını temsil eder. Ayın yerelleştirilmiş adı, geçerli veya belirtilen kültürün DateTimeFormatInfo.MonthNames özelliğinden alınır.
zh_hans: "MMMM" 自定义格式说明符表示月份的完整名称。可从当前或指定区域性的 DateTimeFormatInfo.MonthNames 属性中检索月份的本地化名称。
zh_hant: "MMMM" 自訂格式規範代表該月份的完整名稱。系統會從目前文化特性或指定文化特性的 DateTimeFormatInfo.MonthNames 屬性，擷取該月份的當地語系化名稱。

source: overload
cs: přetížení
de: Überladung
es: sobrecarga
fr: surcharge
ja: オーバーロード
ko: 오버로드
pl: przeciążenie
pt_br: sobrecarga
ru: перегрузка
tr: aşırı yükleme
zh_hans: 重载
zh_hant: 多載

source: overloads
cs: přetížení
de: Überladungen
es: sobrecargas
fr: surcharges
it: overload
ja: オーバーロード
ko: 오버로드
pl: przeciążenia
pt_br: sobrecargas
ru: перегрузки
tr: aşırı yüklemeler
zh_hans: 多个重载
zh_hant: 多載

source: {0} Keyword
cs: Klíčové slovo {0}
de: {0}-Schlüsselwort
es: {0} Palabra clave
fr: Mot clé {0}
it: Parola chiave di {0}
ja: {0} キーワード
ko: {0} 키워드
pl: Słowo kluczowe {0}
pt_br: {0} Palavra-chave
ru: Ключевое слово: {0}
tr: {0} Anahtar Sözcüğü
zh_hans: {0} 关键字
zh_hant: {0} 關鍵字

# Encapsulate_field_colon_0_and_use_property
source: Encapsulate field: '{0}' (and use property)
cs: Zapouzdřit pole: {0} (a použít vlastnost)
de: Feld kapseln: "{0}" (und Eigenschaft verwenden)
es: Encapsular campo: '{0}' (y usar propiedad)
fr: Encapsuler le champ : '{0}' (et utiliser la propriété)
it: Incapsula il campo '{0}' (e usa la proprietà)
ja: フィールドのカプセル化: '{0}' (およびプロパティを使用します)
ko: 필드 캡슐화: '{0}'(그리고 속성을 사용함)
pl: Hermetyzuj pole: „{0}” (i używaj właściwości)
pt_br: Encapsular campo: "{0}" (e usar propriedade)
ru: Инкапсулировать поле: "{0}" (и использовать свойство)
tr: Alanı kapsülle: '{0}' (ve özelliği kullan)
zh_hans: 封装字段:“{0}”(并使用属性)
zh_hant: 封裝欄位: '{0}' (並使用屬性)

# Encapsulate_field_colon_0_but_still_use_field
source: Encapsulate field: '{0}' (but still use field)
cs: Zapouzdřit pole: {0} (ale dál používat pole)
de: Feld kapseln: "{0}" (Feld jedoch weiterhin verwenden)
es: Encapsular campo: '{0}' (pero seguir usándolo)
fr: Encapsuler le champ : '{0}' (mais utiliser toujours le champ)
it: Incapsula il campo '{0}' (ma continua a usarlo)
ja: フィールドのカプセル化: '{0}' (ただし、フィールドを継続して使用します)
ko: 필드 캡슐화: '{0}'(그러나 여전히 필드를 사용함)
pl: Hermetyzuj pole: „{0}” (ale nadal używaj pola)
pt_br: Encapsular campo: "{0}" (mas ainda usar o campo)
ru: Инкапсулировать поле: "{0}" (но продолжать использовать поле)
tr: Alanı kapsülle: '{0}' (ancak alanı kullanmaya devam et)
zh_hans: 封装字段:“{0}”(但仍使用字段)
zh_hant: 封裝欄位: '{0}' (但仍使用欄位)

source: Encapsulate fields (and use property)
cs: Zapouzdřit pole (a použít vlastnost)
de: Felder kapseln (und Eigenschaft verwenden)
es: Encapsular campos (y usar propiedad)
fr: Encapsuler les champs (et utiliser la propriété)
it: Incapsula i campi (e usa la proprietà)
ja: フィールドのカプセル化 (およびプロパティを使用します)
ko: 필드 캡슐화(그리고 속성을 사용함)
pl: Hermetyzuj pola (i używaj właściwości)
pt_br: Encapsular campos (e usar propriedade)
ru: Инкапсулировать поля (и использовать свойство)
tr: Alanları kapsülle (ve özelliği kullanın)
zh_hans: 封装字段 (并使用属性)
zh_hant: 封裝欄位 (並使用屬性)

source: Encapsulate fields (but still use field)
cs: Zapouzdřit pole (ale dál používat pole)
de: Felder kapseln (Feld jedoch weiterhin verwenden)
es: Encapsular campos (pero seguir usando el campo)
fr: Encapsuler les champs (mais utiliser toujours le champ)
it: Incapsula i campi (ma continua a usarli)
ja: フィールドのカプセル化 (ただし、フィールドを継続して使用します)
ko: 필드 캡슐화(그러나 여전히 필드를 사용함)
pl: Hermetyzuj pola (ale nadal używaj pola)
pt_br: Encapsular campos (mas ainda usá-los)
ru: Инкапсулировать поля (но продолжать использовать поле)
tr: Alanları kapsülle (ancak alanı kullanmaya devam et)
zh_hans: 封装字段 (但仍使用字段)
zh_hant: 封裝欄位 (但仍使用欄位)

source: Could not extract interface: The selection is not inside a class/interface/struct.
cs: Nejde extrahovat rozhraní: Výběr nespadá do třídy/rozhraní/struktury.
de: Schnittstelle konnte nicht extrahiert werden: Die Auswahl befindet sich nicht in einer Klasse/Schnittstelle/Struktur.
es: No se pudo extraer la interfaz: la selección no está dentro de una clase/interfaz/estructura.
fr: Impossible d'extraire l'interface : la sélection n'est pas comprise dans une classe, une interface ou un struct.
it: Non è possibile estrarre l'interfaccia: la selezione non si trova all'interno di una classe/interfaccia/struct.
ja: インターフェイスを抽出できませんでした。 選択範囲がクラス/インターフェイス/構造体の内部にありません。
ko: 인터페이스를 추출할 수 없습니다. 선택 영역이 class/interface/struct 내부에 없습니다.
pl: Nie można wyodrębnić interfejsu: zaznaczenie nie znajduje się w ramach klasy, interfejsu lub struktury.
pt_br: Não foi possível extrair interface: a seleção não está dentro de uma classe/interface/struct.
ru: Не удалось извлечь интерфейс: выбранный элемент не находится внутри класса, интерфейса или структуры.
tr: Arabirim ayıklanamadı: Seçim bir sınıf/arabirim/yapı birimi içinde değil.
zh_hans: 无法提取接口:所选内容不在类/接口/结构中。
zh_hant: 無法擷取介面: 此選擇未落在 class/interface/struct 中。

source: Could not extract interface: The type does not contain any member that can be extracted to an interface.
cs: Nejde extrahovat rozhraní: Typ neobsahuje žádný člen, který by se dal extrahovat do rozhraní.
de: Schnittstelle konnte nicht extrahiert werden: Der Typ enthält kein Element, das in eine Schnittstelle extrahiert werden kann.
es: No se pudo extraer la interfaz: el tipo no contiene ningún miembro que se pueda extraer a una interfaz.
fr: Impossible d'extraire l'interface : le type ne contient aucun élément pouvant être extrait vers une interface.
it: Non è possibile estrarre l'interfaccia: il tipo non contiene membri che possono essere estratti in un'interfaccia.
ja: インターフェイスを抽出できませんでした。インターフェイスに抽出できるメンバーが型に含まれていません。
ko: 인터페이스를 추출할 수 없습니다. 형식에 인터페이스로 추출할 수 있는 멤버가 포함되어 있지 않습니다.
pl: Nie można wyodrębnić interfejsu: typ nie zawiera żadnej składowa, która może zostać wyodrębniona do interfejsu.
pt_br: Não foi possível extrair interface: O tipo não contém membros que podem ser extraídos para uma interface.
ru: Не удалось извлечь интерфейс: тип не содержит никаких членов, которые можно извлечь в интерфейс.
tr: Arabirim ayıklanamadı: Tür, arabirime çıkarılabilecek bir üye içermiyor.
zh_hans: 无法提取接口:此类型不含任何可以提取到接口的成员。
zh_hant: 無法擷取介面: 此類型不包含任何可以擷取至介面的成員。

source: Parameters' type or return type cannot be an anonymous type : [{0}]
cs: Typ nebo návratový typ parametrů nemůže být anonymní: [{0}].
de: Parametertyp oder Rückgabetyp können kein anonymer Typ sein : [{0}]
es: El tipo de los parámetros o el tipo de valor devuelto no puede ser un tipo anónimo: [{0}]
fr: Le type de paramètre ou le type de retour ne peut pas être un type anonyme : [{0}]
it: Il tipo o il tipo restituito dei parametri non può essere un tipo anonimo: [{0}]
ja: パラメーターの型または戻り値の型を匿名型にすることはできません: [{0}]
ko: 매개 변수 형식 또는 반환 형식은 익명 형식 [{0}]일 수 없습니다.
pl: Typ parametrów lub typ zwracany nie może być typu anonimowego: [{0}]
pt_br: Tipo dos parâmetros ou tipo de retorno não pode ser um tipo anônimo: [{0}]
ru: Тип параметров или возвращаемых данных не может иметь анонимный тип: [{0}]
tr: Parametrelerin türü veya dönüş türü anonim tür olamaz: [{0}]
zh_hans: 参数的类型或返回类型不能为匿名类型:[{0}]
zh_hant: 參數的類型或傳回類型不可為匿名類型: [{0}]

source: The selection contains no active statement.
cs: Výběr neobsahuje žádný aktivní příkaz.
de: Die Auswahl enthält keine aktive Anweisung.
es: La selección no contiene instrucciones activas.
fr: La sélection ne contient aucune instruction active.
it: La selezione non contiene istruzioni attive.
ja: 選択範囲にアクティブなステートメントが含まれていません。
ko: 선택 영역에 활성 문이 포함되어 있지 않습니다.
pl: Zaznaczenie nie zawiera żadnej aktywnej instrukcji.
pt_br: A seleção não contém instrução ativa.
ru: Выбранный элемент не содержит активный оператор.
tr: Seçim etkin deyim içermiyor.
zh_hans: 所选内容不含活动语句。
zh_hant: 選擇內容包含非現用的陳述式。

source: The selection contains an error or unknown type.
cs: Výběr obsahuje chybu nebo neznámý typ.
de: Die Auswahl enthält einen Fehler oder einen unbekannten Typen.
es: La selección contiene un error o un tipo desconocido.
fr: La sélection contient une erreur ou un type inconnu.
it: La selezione contiene un errore o un tipo sconosciuto.
ja: 選択範囲にエラーまたは不明な型が含まれています。
ko: 이 섹션에는 오류 또는 알 수 없는 형식이 포함되어 있습니다.
pl: Zaznaczenie zawiera błąd lub nieznany typ.
pt_br: A seleção contém um erro ou tipo desconhecido.
ru: Выбранный элемент содержит ошибку или неизвестный тип.
tr: Seçim bir hata veya bilinmeyen tür içeriyor.
zh_hans: 所选内容含错误或未知类型。
zh_hant: 選擇範圍包含錯誤或不明類型。

source: Type parameter '{0}' is hidden by another type parameter '{1}'.
cs: Parametr typu {0} je skrytý jiným parametrem typu {1}.
de: Typparameter "{0}" wird durch einen anderen Typparameter "{1}" verborgen.
es: El parámetro de tipo '{0}' está oculto por otro parámetro de tipo '{1}'.
fr: Le paramètre de type '{0}' est masqué par un autre paramètre de type '{1}'.
it: Il parametro di tipo '{0}' è nascosto da un altro parametro di tipo '{1}'.
ja: 型パラメーター '{0}' が別の型パラメーター '{1}' によって非表示になっています。
ko: '{0}' 형식 매개 변수가 다른 '{1}' 형식 매개 변수에 의해 숨겨집니다.
pl: Parametr typu „{0}” jest ukryty przez inny parametr typu „{1}”.
pt_br: Parâmetro de tipo "{0}" está oculto por outro parâmetro de tipo "{1}".
ru: Параметр типа "{0}" скрыт другим параметром типа "{1}".
tr: Tür parametresi '{0}' farklı bir tür parametresi olan '{1}' tarafından gizlendi.
zh_hans: 类型参数“{0}”被另一类型参数“{1}”隐藏。
zh_hant: 類型參數 '{0}' 已由另一個類型參數 '{1}' 隱藏。

source: The address of a variable is used inside the selected code.
cs: Adresa proměnné se používá ve vybraném kódu.
de: Die Adress einer Variable wird in dem ausgewählten Code verwendet.
es: La dirección de una variable se usa dentro del código seleccionado.
fr: L'adresse d'une variable est utilisée dans le code sélectionné.
it: Nel codice selezionato viene usato l'indirizzo di una variabile.
ja: 選択されたコード内に、変数のアドレスが使用されています。
ko: 변수 주소는 선택한 코드 내부에서 사용됩니다.
pl: Adres zmiennej został użyty w zaznaczonym kodzie.
pt_br: O endereço de uma variável é usado dentro do código selecionado.
ru: Этот адрес переменной используется внутри выбранного кода.
tr: Değişkenin adresi seçilen kod içinde kullanılıyor.
zh_hans: 变量的地址在选定代码内使用。
zh_hant: 此變數位址會用於選取的節點中。

source: Assigning to readonly fields must be done in a constructor : [{0}].
cs: Přiřazování k polím jen pro čtení se musí dělat v konstruktoru: [{0}].
de: Das Zuweisen zu schreibgeschützten Feldern muss in einem Konstruktor erfolgen: [{0}].
es: La asignación a campos de solo lectura se debe hacer en un constructor: [{0}].
fr: L'assignation à des champs en lecture seule doit se faire dans un constructeur : [{0}].
it: L'assegnazione a campi di sola lettura deve essere effettuata in un costruttore: [{0}].
ja: 読み取り専用フィールドへの割り当ては、コンストラクターで行う必要があります: [{0}] 。
ko: 생성자 [{0}]에서 읽기 전용 필드에 대한 할당 작업을 수행해야 합니다.
pl: Przypisywanie do pól tylko do odczytu musi zostać wykonane w konstruktorze: [{0}].
pt_br: A atribuição a campos somente leitura deve ser feita em um construtor: [{0}].
ru: Назначение значения полям, доступным только для чтения, следует выполнять в конструкторе: [{0}].
tr: Salt okunur alanlara atama bir oluşturucuda yapılmalıdır: [{0}].
zh_hans: 分配到只读字段必须在构造函数: [{0}] 中完成。
zh_hant: 指派給唯讀欄位必須在建構函式 [{0}] 中完成。

source: generated code is overlapping with hidden portion of the code
cs: Vygenerovaný kód se překrývá se skrytou částí kódu.
de: generierter Code überschneidet sich mit dem ausgeblendeten Teil des Codes
es: el código generado se superpone con la parte oculta del código
fr: Le code généré chevauche une partie cachée du code
it: il codice generato si sovrappone alla parte nascosta del codice
ja: 生成されたコードがコードの非表示の部分に重なっています
ko: 생성된 코드가 숨겨진 코드 부분과 겹쳐져 있습니다.
pl: wygenerowany kod pokrywa się z ukrytą częścią kodu
pt_br: o código gerado se sobrepõe à porção oculta do código
ru: созданный код накладывается на скрытую часть кода
tr: Üretilen kod kodun gizli bölümüyle çakışıyor
zh_hans: 生成的代码与代码隐藏部分重叠
zh_hant: 產生的程式碼與程式碼的隱藏部分重疊

source: Add optional parameters to '{0}'
cs: Přidat volitelné parametry do {0}
de: Optionale Parameter zu "{0}" hinzufügen
es: Agregar parámetros opcionales a "{0}"
fr: Ajouter des paramètres optionnels à '{0}'
it: Aggiungi i parametri facoltativi a '{0}'
ja: 省略可能なパラメーターを '{0}' に追加する
ko: '{0}'에 선택적 매개 변수 추가
pl: Dodaj opcjonalne parametry do elementu „{0}”
pt_br: Adicionar parâmetros opcionais ao '{0}'
ru: Добавить дополнительные параметры в "{0}"
tr: '{0}' öğesine isteğe bağlı parametreler ekle
zh_hans: 将可选参数添加到“{0}”
zh_hant: 將選用參數新增至 '{0}'

source: Add parameters to '{0}'
cs: Přidat parametry do {0}
de: Parameter zu "{0}" hinzufügen
es: Agregar parámetros a "{0}"
fr: Ajouter des paramètres à '{0}'
it: Aggiungi i parametri a '{0}'
ja: パラメーターを '{0}' に追加する
ko: '{0}'에 매개 변수 추가
pl: Dodaj parametry do elementu „{0}”
pt_br: Adicionar parâmetros ao '{0}'
ru: Добавить параметры в "{0}"
tr: '{0}' öğesine parametre ekle
zh_hans: 将参数添加到“{0}”
zh_hant: 將參數新增至 '{0}'

source: Generate delegating constructor '{0}({1})'
cs: Generovat delegující konstruktor {0}({1})
de: Delegierenden Konstruktor "{0}({1})" generieren
es: Generar el constructor delegado '{0}({1})'
fr: Générer le constructeur de délégation '{0}({1})'
it: Genera il costruttore delegante '{0}({1})'
ja: デリゲート コンストラクター '{0}({1})' を生成します
ko: 위임하는 생성자 '{0}({1})' 생성
pl: Generuj konstruktor delegowania „{0}({1})”
pt_br: Gerar construtor delegante "{0}({1})"
ru: Создать делегирующий конструктор "{0}({1})"
tr: {0}({1})' temsilci oluşturucusunu üret
zh_hans: 生成委托构造函数“{0}({1})”
zh_hant: 產生委派建構函式 '{0}({1})'

source: Generate constructor '{0}({1})'
de: Konstruktor "{0}({1})" generieren
fr: Générer le constructeur '{0}({1})'
it: Genera il costruttore '{0}({1})'
ja: コンストラクター '{0}({1})' を生成します
tr: {0}({1})' oluşturucusunu üret
zh_hans: 生成构造函数 “{0}({1})”
zh_hant: 產生建構函式 '{0}({1})'

source: Generate field assigning constructor '{0}({1})'
de: Feldzuweisungskonstruktor "{0}({1})" generieren
fr: Générer un constructeur d'assignation de champ '{0}({1})'
it: Genera il costruttore per l'assegnazione dei campi '{0}({1})'
ja: フィールドを割り当てるコンストラクター '{0}({1})' を生成します
tr: {0}({1})' alan atama oluşturucusunu üret
zh_hans: 生成字段分配构造函数“{0}({1})”
zh_hant: 產生欄位指派建構函式 '{0}({1})'

source: Generate Equals and GetHashCode
cs: Generovat Equals a GetHashCode
de: "Equals" und "GetHashCode" generieren
es: Generar Equals y GetHashCode
fr: Générer Equals et GetHashCode
it: Genera Equals e GetHashCode
ja: Equals および GetHashCode を生成する
ko: Equals 및 GetHashCode 생성
pl: Generuj element Equals i GetHashCode
pt_br: Gerar Equals e GetHashCode
ru: Создать Equals и GetHashCode
tr: Equals ve GetHashCode oluştur
zh_hans: 生成 Equals 和 GetHashCode
zh_hant: 產生 Equals 與 GetHashCode

source: Generate Equals(object)
de: "Equals(object)" generieren
fr: Générer Equals(object)
it: Genera Equals(oggetto)
ja: Equals(object) を生成する
tr: Equals(object) oluştur
zh_hans: 生成 Equals(object)
zh_hant: 產生 Equals(object)

source: Generate GetHashCode()
cs: Generovat GetHashCode()
de: "GetHashCode()" generieren
es: Generar "GetHashCode()"
fr: Générer GetHashCode()
it: Genera GetHashCode()
ja: GetHashCode() を生成する
ko: GetHashCode() 생성
pl: Generuj element GetHashCode()
pt_br: Gerar GetHashCode()
ru: Создать "GetHashCode()"
tr: GetHashCode() oluştur
zh_hans: 生成 GetHashCode()
zh_hant: 產生 GetHashCode()

source: Generate constructor in '{0}'
de: Konstruktor in "{0}" generieren
fr: Générer un constructeur dans '{0}'
it: Genera il costruttore in '{0}'
ja: '{0}' にコンストラクターを生成します
tr: '{0}' içinde oluşturucu üretin
zh_hans: 在“{0}”中生成构造函数
zh_hant: 在 '{0}' 中產生建構函式

source: Generate all
de: Alle generieren
fr: Générer tout
it: Genera tutto
ja: すべてを生成します
tr: Tümünü üret
zh_hans: 生成所有
zh_hant: 產生全部

source: Generate local '{0}'
de: Lokales "{0}" generieren
fr: Générer le '{0}' local
it: Genera l'elemento '{0}' locale
ja: ローカルの '{0}' を生成します
tr: Yerel '{0}' üretin
zh_hans: 生成本地“{0}”
zh_hant: 產生區域 '{0}'

source: Generate {0} '{1}' in new file
cs: Generovat {0} {1} v novém souboru
de: {0}-Objekt "{1}" in neuer Datei generieren
es: Generar {0} '{1}' en archivo nuevo
fr: Générer {0} '{1}' dans un nouveau fichier
it: Genera l'elemento {0} '{1}' nel nuovo file
ja: 新しいファイルに {0} '{1}' を生成する
ko: 새 파일에서 {0} '{1}' 생성
pl: Generuj element {0} „{1}” w nowym pliku
pt_br: Gerar {0} '{1}' no novo arquivo
ru: Создать {0} "{1}" в новом файле
tr: Yeni dosyada {0} '{1}' oluştur
zh_hans: 在新文件中生成 {0}“{1}”
zh_hant: 在新檔案中產生 {0} '{1}'

source: Generate nested {0} '{1}'
cs: Generovat vnořené {0} {1}
de: Geschachteltes {0}-Objekt "{1}" generieren
es: Generar {0} anidado '{1}'
fr: Générer un {0} '{1}' imbriqué
it: Genera l'elemento {0} '{1}' annidato
ja: 入れ子 {0} '{1}' を生成する
ko: 중첩된 {0} '{1}' 생성
pl: Generuj zagnieżdżony element {0} „{1}”
pt_br: Gerar {0} '{1}' aninhado
ru: Создать вложенный {0} "{1}"
tr: İç içe {0} '{1}' oluştur
zh_hans: 生成嵌套的 {0}“{1}”
zh_hant: 產生巢狀 {0} '{1}'

source: Implement interface abstractly
de: Schnittstelle abstrakt implementieren
fr: Implémenter l'interface abstraitement
it: Implementa l'interfaccia in modo astratto
ja: インタ フェースを抽象的に実装します
zh_hans: 以抽象方式实现接口
zh_hant: 以抽象方式實作介面

source: Implement interface through '{0}'
de: Schnittstelle über "{0}" implementieren
fr: Implémenter l'interface via '{0}'
it: Implementa l'interfaccia tramite '{0}'
ja: '{0}' を通じてインターフェイスを実装します
zh_hans: 通过“{0}”实现接口
zh_hant: 透過 '{0}' 實作介面

source: Implement interface
de: Schnittstelle implementieren
fr: Implémenter l'interface
it: Implementa l'interfaccia
ja: インターフェイスを実装します
zh_hans: 实现接口
zh_hant: 實作介面

source: Introduce field for '{0}'
cs: Zavést pole pro {0}
de: Feld für "{0}" bereitstellen
es: Introducir el campo de '{0}'
fr: Introduire un champ pour '{0}'
it: Introduce il campo per '{0}'
ja: '{0}' に対してフィールドを導入します
ko: '{0}'에 대한 필드 지정
pl: Wprowadź pole dla elementu „{0}”
pt_br: Encapsular campo para "{0}"
ru: Введите поле для "{0}"
tr: '{0}' için alanı ortaya çıkar
zh_hans: 为“{0}”引入字段
zh_hant: 為 '{0}' 引進欄位
