Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: You must rename an identifier.
cs: Musíte přejmenovat identifikátor.
de: Sie müssen einen Bezeichner umbenennen.
es: Debe cambiar el nombre de un identificador.
it: È necessario rinominare un identificatore.
ja: 識別子の名前を変更する必要があります。
ko: 식별자의 이름을 바꿔야 합니다.
pl: Należy zmienić nazwę identyfikatora.
pt_br: Você deve renomear um identificador.
ru: Необходимо переименовать идентификатор.
tr: Bir tanımlayıcıyı yeniden adlandırmalısınız.
zh_hans: 必须重命名标识符。

source: '{0}' bases
cs: Základy {0}
de: Basiswerte: “{0}”
es: Bases de “{0}”
it: Basi di '{0}'
ja: '{0}' ベース
ko: '{0}' 기본
pl: Wartości podstawowe „{0}”
pt_br: Bases '{0}'
ru: Основания: “{0}”
tr: '{0}' tabanları
zh_hans: “{0}”基数

source: '{0}' cannot be null or empty.
cs: Hodnota {0} nemůže být nulová a toto pole nemůže být prázdné.
de: "{0}" kann nicht NULL oder leer sein.
es: '{0}' no puede ser nulo ni estar vacío.
fr: « {0} » ne peut pas être vide ou avoir la valeur Null.
it: '{0}' non può essere null o vuoto.
ja: '{0}' を NULL または空にすることはできません。
ko: '{0}'은(는) Null이거나 비워 둘 수 없습니다.
pl: Element „{0}” nie może mieć wartości null ani być pusty.
pt_br: '{0}' não pode ser nulo nem vazio.
ru: "{0}" не может быть неопределенным или пустым.
tr: '{0}' null veya boş olamaz.
zh_hans: “{0}”不能为 null 或空。
zh_hant: '{0}' 不可為 Null 或空白。

source: '{0}' cannot be null or whitespace.
cs: Hodnota {0} nemůže být null ani prázdný znak.
de: "{0}" darf nicht NULL oder ein Leerraumzeichen sein.
es: "{0}" no puede ser NULL ni un espacio en blanco.
fr: '{0}' ne peut pas avoir une valeur null ou être un espace blanc.
it: '{0}' non può essere Null o uno spazio vuoto.
ja: '{0}' を null または空白にすることはできません。
ko: '{0}'은(는) null이거나 공백일 수 없습니다.
pl: Element „{0}” nie może mieć wartości null ani składać się ze znaków odstępu.
pt_br: '{0}' não pode ser nulo nem espaço em branco.
ru: "{0}" не может быть пустым или содержать только пробел.
tr: '{0}' null veya boşluk olamaz.
zh_hans: “{0}”不能为 null 或空白。
zh_hant: '{0}' 不得為 Null 或空白字元。

source: '{0}' expected
cs: Očekával se {0}
de: '{0}' erwartet
es: \"{0}\" esperado
it: '{0}' previsto
ja: '{0}' が必要です
ko: '{0}'이(가) 필요합니다.
pl: Oczekiwano: „{0}”
pt_br: “{0}” esperado
ru: Ожидалось значение {0}
tr: '{0}' bekleniyor
zh_hans: 应为 \"{0}\"

source: '{0}' found in embedded PDB.
cs: Ve vloženém souboru PDB se našel {0}.
de: „{0}“ wurde in einer eingebetteten PDB-Datei gefunden.
es: '{0}' encontrados en PDB incrustado.
it: '{0}' trovati nel PDB incorporato.
ja: 埋め込み PDB に '{0}' が見つかりました。
ko: 포함된 PDB에서 '{0}'을(를) 찾았습니다.
pl: Znaleziono „{0}” w osadzonym pliku PDB.
pt_br: '{0}' encontrado no PDB integrado.
ru: Найдено "{0}" во внедренном PDB-файле.
tr: “{0}”, gömülü PDB'de bulundu.
zh_hans: 在嵌入的 PDB 中找到“{0}”。

# _0_found_in_embedded_PDB_but_checksum_failed
source: '{0}' found in embedded PDB but checksum was wrong, or couldn't read temp file.
cs: Ve vloženém souboru PDB byl nalezen {0}, ale kontrolní součet byl chybný nebo nešlo přečíst dočasný soubor.
de: „{0}“ wurde in einer eingebetteten PDB-Datei gefunden, aber die Prüfsumme war falsch oder die temporäre Datei konnte nicht gelesen werden.
es: '{0}' encontró en el archivo PDB incrustado, pero la suma de comprobación era incorrecta o no pudo leer el archivo temporal.
it: '{0}' è stato trovato nel PDB incorporato, ma il checksum non è corretto o non è stato possibile leggere il file temporaneo.
ja: 埋め込み PDB に '{0}' が見つかりましたが、チェックサムが正しくないか、一時ファイルを読み取れませんでした。
ko: 포함된 PDB에서 '{0}'을(를) 찾았지만 체크섬이 잘못되었거나 임시 파일을 읽을 수 없습니다.
pl: Znaleziono „{0}” w osadzonym pliku PDB, ale suma kontrolna była nieprawidłowa lub nie można było odczytać pliku tymczasowego.
pt_br: '{0}' encontrado no PDB integrado, mas a soma de verificação estava errada ou não foi possível ler o arquivo temporário.
ru: Найдено "{0}" во внедренном PDB-файле, но контрольная сумма неверна или не удалось прочитать временный файл.
tr: “{0}” gömülü PDB'de bulundu ancak sağlama toplamı yanlıştı veya geçici dosyayı okuyamadı.
zh_hans: 在嵌入 PDB 中找到“{0}”，但校验和错误或无法读取临时文件。

# _0_found_in_embedded_PDB_but_could_not_write_file_1
source: '{0}' found in embedded PDB but could not write to temp file: '{1}'
cs: Ve vloženém souboru PDB se našel {0}, ale nebylo možné zapisovat do dočasného souboru: {1}
de: „{0}“ wurde in einer eingebetteten PDB-Datei gefunden, konnte aber nicht in die temporäre Datei schreiben: „{1}“
es: '{0}' encontró en el archivo PDB incrustado pero no pudo escribir en el archivo temporal: '{1}'
it: '{0}' trovato nel PDB incorporato ma non è stato possibile scrivere nel file temporaneo: '{1}'
ja: 埋め込み PDB に '{0}' が見つかりましたが、一時ファイルに書き込めませんでした: "{1}"
ko: 포함된 PDB에서 '{0}'을 찾았지만 임시 파일 '{1}'에 쓸 수 없습니다.
pl: Znaleziono „{0}” w osadzonym pliku PDB, ale nie można było zapisać do pliku tymczasowego: „{1}”
pt_br: '{0}' encontrado no PDB incorporado, mas não foi possível gravar no arquivo temporário: '{1}'
ru: Найдено "{0}" во внедренном PDB-файле, но не удалось выполнить запись во временном файле: "{1}"
tr: “{0}” gömülü PDB'de bulundu ancak geçici dosyaya yazamadı:”{1}”
zh_hans: 在嵌入的 PDB 中找到“{0}”，但无法写入临时文件:“{1}”

# _0_found_in_embedded_PDB_cached_source_file
source: '{0}' found in embedded PDB and found cached source file.
cs: Ve vloženém souboru PDB se našel {0} a zdrojový soubor uložený v mezipaměti.
de: „{0}“ wurde in der eingebetteten PDB-Datei und in der zwischengespeicherten Quelldatei gefunden.
es: '{0}' se encontró en el archivo PDB incrustado y se encontró el archivo de origen almacenado en caché.
it: '{0}' trovato nel PDB incorporato e trovato file di origine memorizzato nella cache.
ja: 埋め込み PDB に '{0}' が見つかり、キャッシュされたソース ファイルが見つかりました。
ko: 포함된 PDB에서 '{0}'을(를) 찾았으며 캐시된 원본 파일을 찾았습니다.
pl: Znaleziono „{0}” w osadzonym pliku PDB i znaleziono buforowany plik źródłowy.
pt_br: '{0}' encontrado no PDB incorporado e arquivo de origem em cache encontrado.
ru: Обнаружено "{0}" во внедренном PDB-файле и найден кэшированный исходный файл.
tr: “{0}” gömülü PDB'de bulundu ve önbelleğe alınmış kaynak dosya bulundu.
zh_hans: 在嵌入的 PDB 中找到“{0}”，并找到缓存的源文件。

source: '{0}' found in original location.
cs: {0} se našel v původním umístění.
de: „{0}“ wurde am ursprünglichen Speicherort gefunden.
es: '{0}' encontrados en la ubicación original.
it: '{0}' trovato nella posizione originale.
ja: 元の場所に '{0}' が見つかりました。
ko: 원래 위치에 '{0}'이(가) 있습니다.
pl: Znaleziono „{0}” w oryginalnej lokalizacji.
pt_br: '{0}' encontrado no local original.
ru: Найдено "{0}" в исходном расположении.
tr: “{0}” orijinal konumunda bulundu.
zh_hans: 在原始位置找到“{0}”。

# _0_found_in_original_location_but_checksum_failed
source: '{0}' found in original location but checksum was wrong, or couldn't read temp file.
cs: V původním umístění byl nalezen {0}, ale kontrolní součet byl chybný nebo nešlo přečíst dočasný soubor.
de: „{0}“ wurde am ursprünglichen Speicherort gefunden, aber die Prüfsumme war falsch oder die temporäre Datei konnte nicht gelesen werden.
es: '{0}' encontró en la ubicación original, pero la suma de comprobación era incorrecta o no pudo leer el archivo temporal.
it: '{0}' trovato nel percorso originale, ma il checksum non è corretto o non è stato possibile leggere il file temporaneo.
ja: 元の場所に '{0}' が見つかりましたが、チェックサムが正しくないか、一時ファイルを読み取れませんでした。
ko: '{0}'이(가) 원래 위치에서 발견되었지만 체크섬이 잘못되었거나 임시 파일을 읽을 수 없습니다.
pl: Znaleziono „{0}” w oryginalnej lokalizacji, ale suma kontrolna była nieprawidłowa lub nie można było odczytać pliku tymczasowego.
pt_br: '{0}' encontrado no local original, mas a soma de verificação estava errada ou não foi possível ler o arquivo temporário.
ru: Найдено "{0}" в исходном расположении, но контрольная сумма неверна или не удалось прочитать временный файл.
tr: “{0}” orijinal konumda bulundu ancak sağlama toplamı yanlıştı veya geçici dosyayı okuyamadı.
zh_hans: 在原始位置找到“{0}”，但校验和错误或无法读取临时文件。

source: '{0}' found via SourceLink.
cs: {0} se našel přes SourceLink.
de: „{0}“ wurde über SourceLink gefunden.
es: '{0}' encontró a través de SourceLink.
it: '{0}' trovato tramite SourceLink.
ja: '{0}' が SourceLink を通じて見つかりました。
ko: SourceLink를 통해 '{0}'을(를) 찾았습니다.
pl: Znaleziono „{0}” za pośrednictwem elementu SourceLink.
pt_br: '{0}' encontrado via SourceLink.
ru: Найдено "{0}" с помощью SourceLink.
tr: “{0}” SourceLink aracılığıyla bulundu.
zh_hans: 通过 SourceLink 找到“{0}”。

# _0_found_via_SourceLink_but_couldnt_read_file
source: '{0}' found via SourceLink but couldn't read temp file.
cs: {0} se našel přes SourceLink, ale nepovedlo se přečíst dočasný soubor.
de: „{0}“ wurde über SourceLink gefunden, aber die temporäre Datei konnte nicht gelesen werden.
es: '{0}' encontró a través de SourceLink pero no pudo leer el archivo temporal.
it: '{0}' trovato tramite SourceLink ma non è stato possibile leggere il file temporaneo.
ja: '{0}' が SourceLink を通じて見つかりましたが、一時ファイルを読み取ることができませんでした。
ko: SourceLink를 통해 '{0}'을(를) 찾았지만 임시 파일을 읽을 수 없습니다.
pl: Znaleziono „{0}” za pośrednictwem elementu SourceLink, ale nie można było odczytać pliku tymczasowego.
pt_br: '{0}' encontrado via SourceLink, mas não pôde ler o arquivo temporário.
ru: Найдено "{0}" с помощью SourceLink, но не удалось прочитать временный файл.
tr: “{0}” SourceLink aracılığıyla bulundu ancak geçici dosyayı okuyamadı.
zh_hans: 通过 SourceLink 找到“{0}”，但无法读取临时文件。

source: '{0}' implementations
cs: 'Implementace symbolů {0}
de: “{0}”-Implementierungen
es: Implementaciones de “{0}”
it: 'Implementazioni di '{0}'
ja: '{0}' の実装
ko: '{0}' 구현
pl: 'Implementacje „{0}”
pt_br: 'Implementações de '{0}'
ru: Реализации “{0}”
tr: '{0}' uygulamaları
zh_hans: “{0}”实现

source: '{0}' is not null here.
cs: {0} tady není null.
de: "{0}" ist hier nicht NULL.
es: "{0}" no es NULL aquí.
fr: '{0}' n'a pas une valeur null ici.
it: '{0}' non è Null in questo punto.
ja: ここでは、'{0}' は null ではありません。
ko: '{0}'은(는) 여기에서 null이 아닙니다.
pl: Element „{0}” nie ma wartości null w tym miejscu.
pt_br: '{0}' não é nulo aqui.
ru: Здесь "{0}" имеет значение, отличное от NULL.
tr: '{0}' burada null değil.
zh_hans: “{0}”在此处不为 null。
zh_hant: '{0}' 在此不是 null。

source: '{0}' items in cache
cs: Počet položek v mezipaměti: {0}
de: {0} Elemente im Cache
es: "{0}" elementos en caché
it: '{0}' elementi nella cache
ja: キャッシュ内の '{0}' 個の項目
ko: 캐시의 '{0}'개 항목
pl: Elementy w pamięci podręcznej: „{0}”
pt_br: '{0}' itens no cache
ru: Элементов в кэше: "{0}"
tr: Önbellekteki '{0}' öğe
zh_hans: 缓存中的 {0} 项

source: '{0}' literal not allowed
cs: Literál {0} není povolený.
de: '{0}' Literal nicht zulässig
es: Literal \"{0}\" no permitido
it: Valore letterale '{0}' non consentito
ja: '{0}' リテラルは使用できません
ko: '{0}' 리터럴을 사용할 수 없습니다.
pl: Literał „{0}” jest niedozwolony
pt_br: Literal de “{0}” não permitida
ru: Литерал {0} не разрешен
tr: '{0}' sabit değerine izin verilmiyor
zh_hans: 不允许 \"{0}\" 字面量

source: '{0}' may be null here.
cs: {0} tady může být null.
de: "{0}" darf hier NULL sein.
es: "{0}" puede ser NULL aquí.
fr: '{0}' a peut-être une valeur null ici.
it: '{0}' può essere Null in questo punto.
ja: ここでは、'{0}' は null である可能性があります。
ko: '{0}'은(는) 여기에서 null일 수 있습니다.
pl: Element „{0}” może mieć wartość null w tym miejscu.
pt_br: '{0}' pode ser nulo aqui.
ru: Здесь "{0}" может иметь значение NULL.
tr: '{0}' burada null olabilir.
zh_hans: “{0}”可能在此处为 null。
zh_hant: '{0}' 在此可能為 null。

# _0_reference_unquoted
source: {0} reference
cs: Počet odkazů: {0}
de: {0} Verweis
es: {0} referencia
it: {0} riferimento
ja: {0} 個の参照
ko: 참조 {0}개
pl: {0} odwołanie
pt_br: {0} referência
ru: Cсылок: {0}
tr: {0} başvuru
zh_hans: {0} 个引用

source: '{0}' references
cs: 'Reference symbolů {0}
de: “{0}”-Verweise
es: Referencias de “{0}”
it: 'Riferimenti di '{0}'
ja: '{0}' の参照
ko: '{0}' 참조
pl: 'Odwołania „{0}”
pt_br: '{0}' referências
ru: Ссылки “{0}”
tr: '{0}' başvuruları
zh_hans: “{0}”引用

# _0_references_unquoted
source: {0} references
cs: Počet odkazů: {0}
de: {0} Verweise
es: {0} referencias
it: {0} riferimenti
ja: {0} 個の参照
ko: 참조 {0}개
pl: Odwołania: {0}
pt_br: {0} referências
ru: Ссылок: {0}
tr: {0} başvuru
zh_hans: {0} 个引用

source: '{0}' unexpected
cs: Neočekávaný {0}
de: '{0}' unerwartet
es: \"{0}\" inesperado
it: '{0}' imprevisto
ja: 予期しない '{0}' です
ko: 예기치 않은 ‘{0}’
pl: Nieoczekiwany „{0}”
pt_br: “{0}” inesperado
ru: Непредусмотренное значение {0}
tr: '{0}' beklenmiyor
zh_hans: 意外的 \"{0}\"

source: 10,000,000ths of a second
cs: Desetimiliontiny sekundy
de: 10.000.000stel einer Sekunde
es: La diezmillonésima parte de un segundo
fr: 10 000 000es de seconde
it: Decimilionesimi di secondo
ja: 10,000,000 分の 1 秒単位
ko: 10,000,000분의 1초
pl: 1/10 000 000 sekundy
pt_br: Dez milionésimos de um segundo
ru: 10 000 000-е доли секунды
tr: Saniyenin 10.000.000'da biri
zh_hans: 千万分之一秒
zh_hant: 1/10,000,000 秒

# _10000000ths_of_a_second_description
source: The "fffffff" custom format specifier represents the seven most significant digits of the seconds fraction; that is, it represents the ten millionths of a second in a date and time value. Although it's possible to display the ten millionths of a second component of a time value, that value may not be meaningful. The precision of date and time values depends on the resolution of the system clock. On the Windows NT 3.5 (and later) and Windows Vista operating systems, the clock's resolution is approximately 10-15 milliseconds.
cs: Specifikátor vlastního formátu fffffff představuje sedm platných číslic zlomku sekundy. To znamená, že v hodnotě data a času představuje desetimiliontiny sekundy. Ačkoli je možné tuto část sekundy hodnoty času zobrazit, nemusí tato hodnota být významná. Přesnost hodnot data a času závisí na rozlišení systémových hodin. V operačních systémech Windows NT 3.5 (a novějších) a Windows Vista je rozlišení hodin přibližně 10–15 milisekund.
de: Der benutzerdefinierte Formatbezeichner "fffffff" repräsentiert die sieben signifikantesten Stellen des Sekundenbruchteils, d. h., er stellt die Zehnmillionstel einer Sekunde in einem Datums- und Uhrzeitwert dar. Obwohl die Zehnmillionstel der Sekundenkomponente eines Uhrzeitwerts angezeigt werden können, ist dieser Wert möglicherweise nicht aussagekräftig. Die Genauigkeit von Datums- und Uhrzeitwerten hängt von der Auflösung der Systemuhr ab. Bei den Betriebssystemen Windows NT 3.5 (und höher) und Windows Vista beträgt die Auflösung der Systemuhr ca. 10–15 Millisekunden.
es: El especificador de formato personalizado "fffffff" representa los siete dígitos más significativos de la fracción de segundos, es decir, las diez millonésimas de segundo de un valor de fecha y hora. Aunque es posible mostrar las diez millonésimas de un componente de segundos de un valor de hora, puede que ese valor no sea significativo. La precisión de los valores de fecha y hora depende de la resolución del reloj del sistema. En los sistemas operativos Windows NT 3.5 (y posterior) y Windows Vista, la resolución del reloj es aproximadamente de 10-15 milisegundos.
fr: Le spécificateur de format personnalisé "fffffff" représente les sept chiffres les plus significatifs de la fraction de seconde. En d'autres termes, il représente les dix millionièmes de seconde d'une valeur de date et d'heure. Bien qu'il soit possible d'afficher les dix millionièmes d'un deuxième composant d'une valeur de temps, cette valeur risque de ne pas être significative. La précision des valeurs de date et d'heure dépend de la résolution de l'horloge système. Sur les systèmes d'exploitation Windows NT 3.5 (et versions ultérieures) et Windows Vista, la résolution de l'horloge est d'environ 10 à 15 millisecondes.
it: L'identificatore di formato personalizzato "fffffff" rappresenta le sette cifre più significative della frazione di secondi, ovvero i decimilionesimi di secondo in un valore di data e ora. Anche se è possibile visualizzare i decimilionesimi di un componente relativo ai secondi di un valore di ora, tale valore potrebbe non essere significativo. La precisione dei valori di data e ora dipende dalla risoluzione del clock di sistema. Nei sistemi operativi Windows NT 3.5 e versioni successive e Windows Vista la risoluzione del clock è di circa 10-15 millisecondi.
ja: "fffffff" カスタム書式指定子は、秒の小数部分の有効数字上位 7 桁を表します。つまり、日時の値のうち、秒の小数部分を 10,000,000 分の 1 秒単位で表します。 時刻値の 10,000,000 分の 1 秒単位の部分を表示することはできますが、この値は意味がない場合があります。日時の値の精度は、システム時計の分解能に依存しています。Windows NT 3.5 以降および Windows Vista のオペレーティング システムでは、時計の分解能は約 10 から 15 ミリ秒です。
ko: "fffffff" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자 7개를 나타냅니다. 즉, 날짜 및 시간 값에서 10,000,000분의 1초를 나타냅니다. 시간 값의 초 부분의 10,000,000분의 1초를 표시하는 것이 가능하긴 하나, 이 값은 의미가 없을 수 있습니다. 날짜 및 시간 값의 정밀도는 시스템 시계의 해상도에 따라 달라집니다. Windows NT 3.5(및 이후 버전) 및 Windows Vista 운영 체제의 시계 해상도는 약 10~15밀리초입니다.
pl: Indywidualny specyfikator formatu „fffffff” reprezentuje siedem najbardziej znaczących cyfr ułamka sekundy; tzn. reprezentuje dziesięciomilionową część sekundy w wartości daty i godziny. Co prawda możliwe jest wyświetlenie składnika dziesięciomilionowej części sekundy wartości godziny, ale ta wartość może nie mieć znaczenia. Dokładność wartości daty i godziny zależy od rozdzielczości zegara systemowego. W systemach operacyjnych Windows NT 3.5 (i nowszych) oraz Windows Vista rozdzielczość zegara wynosi ok. 10–15 milisekund.
pt_br: O especificador de formato personalizado "fffffff" representa os sete dígitos mais significativos da fração de segundos. Ou seja, representa os dez milionésimos de segundo em um valor de data e hora. Embora seja possível exibir os dez milionésimos de um componente de segundo de um valor temporal, esse valor pode não ser significativo. A precisão dos valores de data e hora depende da resolução do relógio do sistema. Nos sistemas operacionais Windows NT 3.5 (e posteriores) e Windows Vista, a resolução do relógio é de aproximadamente 10-15 milissegundos.
ru: Описатель пользовательского формата "fffffff" представляет семь наиболее значащих цифр дробной части секунды; то есть он представляет десятимиллионные доли секунды в значении даты и времени. Хотя десятимиллионные доли второго компонента значения времени можно отобразить, это значение может быть неинформативным. Точность значений даты и времени зависит от разрешения системных часов. В операционных системах Windows NT 3.5 (и более поздних версий) и Windows Vista разрешение часов составляет приблизительно 10–15 мс.
tr: "fffffff" özel biçim belirticisi, saniye kesirinin en anlamlı yedi basamağını; yani bir tarih ve saat değerinde saniyenin on milyonda birini temsil eder. Bir saat değerinin saniyenin on milyonda birlik bileşenini görüntülemek mümkün olmakla birlikte bu değer anlamlı olmayabilir. Tarih ve saat değerlerinin duyarlığı sistem saatinin çözünürlüğüne bağlıdır. Windows NT 3.5 (ve üstü) ve Windows Vista işletim sistemlerinde saatin çözünürlüğü yaklaşık 10-15 milisaniyedir.
zh_hans: "fffffff" 自定义格式说明符表示秒部分的七个最高有效位；即在日期和时间值中表示千万分之一秒数。 虽然时间值的秒部分可以显示到千万分之一秒，但该值可能没有意义。日期和时间值的精度取决于系统时钟的分辨率。在 Windows NT 3.5 (及更高版本)和 Windows Vista 操作系统上，时钟的分辨率大约为 10-15 毫秒。
zh_hant: "fffffff" 自訂格式規範代表秒小數部分的最大有效位數為七; 換句話說，其代表日期與時間值中的千萬分之一秒。 雖然時間值的千萬分之一秒部分可以顯示，但該值可能沒有太大的意義。日期與時間值的精確度，取決於系統時鐘的分辨能力。在 Windows NT 3.5 (和更新版本) 以及 Windows Vista 作業系統上，時鐘的分辨能力大約為 10-15 毫秒。

source: 10,000,000ths of a second (non-zero)
cs: Desetimiliontiny sekundy (nenulové)
de: 10.000.000stel einer Sekunde (ungleich 0)
es: La diezmillonésima parte de un segundo (no cero)
fr: 10 000 000es de seconde (non nul)
it: Decimilionesimi di secondo (diversi da zero)
ja: 10,000,000 分の 1 秒単位 (0 以外)
ko: 10,000,000분의 1초(0이 아님)
pl: 1/10 000 000 sekundy (wartrość inna niż zero)
pt_br: Dez milionésimos de um segundo (diferente de zero)
ru: 10 000 000-е доли секунды (не нуль)
tr: Saniyenin 10.000.000'da biri (sıfır olmayan)
zh_hans: 千万分之一秒(非零)
zh_hant: 1/10,000,000 秒 (非零)
