Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Changing_pseudo_custom_attribute_0_of_1_requires_restarting_th_application
source: Changing pseudo-custom attribute '{0}' of {1} requires restarting the application
cs: Změna pseudovlastního atributu {0} u {1} vyžaduje restartování aplikace.
de: Das Ändern des pseudobenutzerdefinierten Attributs „{0}“ von {1} erfordert einen Neustart der Anwendung.
es: Para cambiar el atributo pseudo-personalizado "{0}" de {1} se requiere reiniciar la aplicación
it: Se si modifica l'attributo pseudo-personalizzato '{0}' di {1}, è necessario riavviare l'applicazione
ja: {0} の擬似カスタム属性 '{1}' を変更するには、アプリケーションを再起動する必要があります
ko: {1}의 허위 사용자 지정 특성 '{0}'을(를) 변경하려면 애플리케이션을 다시 시작해야 합니다.
pt_br: Alterar o atributo pseudo-personalizado '{0}' de {1} requer o reinício do aplicativo
ru: Для изменения псевдонастраиваемого атрибута "{0}" для {1} требуется перезапустить приложение.
tr: {1} öğesinin '{0}' sahte özel özniteliğinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir
zh_hans: 更改 {1} 的伪自定义属性“{0}”需要重启应用程序

source: Changing the containing namespace of '{0}' from '{1}' to '{2}' requires restarting the application
cs: Změna nadřazeného oboru názvů {0} z {1} na {2} vyžaduje restartování aplikace.
de: Um den enthaltenden Namespace von "{0}" von "{1}" in "{2}" zu ändern, muss die Anwendung neu gestartet werden
es: Para cambiar el espacio de nombres contenedor de '{0}' de '{1}' a '{2}' es necesario reiniciar la aplicación
it: Per modificare lo spazio dei nomi contenitore di '{0}' da '{1}' a '{2}' è necessario riavviare l'applicazione
ja: '{0}' の包含名前空間を '{1}' から '{2}' に変更するには、アプリケーションを再起動する必要があります
ko: '{0}'의 포함 네임스페이스를 '{1}'에서 '{2}'(으)로 변경하려면 애플리케이션을 다시 시작해야 합니다.
pt_br: Alterar o namespace que o contém '{0}' de '{1}' para '{2}' requer a reinicialização do aplicativo
ru: Чтобы изменить содержащее пространство имен "{0}" с "{1}" на "{2}", необходимо перезапустить приложение
tr: '{1}' olan '{0}' kapsayan ad alanının '{2}' olarak değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir
zh_hans: 将 '{0}' 的包含命名空间从 '{1}' 更改为'{2}' 需要重新启动应用程序

source: Changing the declaration scope of a captured variable '{0}' requires restarting the application.
cs: Změna oboru deklarace zachycené proměnné {0} vyžaduje restartování aplikace.
de: Das Ändern des Deklarationsbereichs einer erfassten Variablen „{0}“ erfordert einen Neustart der Anwendung.
es: Para cambiar el ámbito de declaración de una variable capturada "{0}" es necesario reiniciar la aplicación.
it: Se si modifica l'ambito di dichiarazione di una variabile catturata '{0}', è necessario riavviare l'applicazione.
ja: キャプチャした変数 '{0}' の宣言スコープを変更するには、アプリケーションを再起動する必要があります。
ko: 캡처된 변수 '{0}'의 선언 범위를 변경하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Zmienianie zakresu deklaracji przechwyconej zmiennej "{0}" wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar o escopo de declaração de uma variável capturada '{0}' requer a reinicialização do aplicativo.
ru: Для изменения области объявления зафиксированной переменной "{0}" требуется перезапустить приложение.
tr: Yakalanan bir '{0}' değişkeninin bildirim kapsamının değiştirilmesi uygulamanın yeniden başlatılmasını gerektir.
zh_hans: 更改捕获的变量“{0}”的声明范围需要重新启动应用程序。

source: Changing the parameters of {0} requires restarting the application.
cs: Změna parametrů {0} vyžaduje restartování aplikace.
de: Das Ändern von Parametern von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar los parámetros de {0} se requiere reiniciar la aplicación.
it: Se si modificano i parametri di {0}, è necessario riavviare l'applicazione.
ja: {0} のパラメーターを変更するには、アプリケーションを再起動する必要があります。
ko: {0}의 매개 변수를 변경하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Zmienianie parametrów elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar os parâmetros de {0} requer a reinicialização do aplicativo.
ru: Для изменения параметров {0} требуется перезапустить приложение.
tr: {0} parametrelerinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的参数需要重新启动应用程序。

source: Changing the return type of {0} requires restarting the application.
cs: Změna návratového typu {0} vyžaduje restartování aplikace.
de: Das Ändern des Rückgabetyps von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar el tipo de valor devuelto de {0} es necesario reiniciar la aplicación.
it: Se si modifica il tipo restituito di {0}, è necessario riavviare l'applicazione.
ja: {0} の戻り値の型を変更するには、アプリケーションを再起動する必要があります。
ko: {0}의 반환 형식을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana zwracanego typu elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar o tipo de retorno de {0} requer o reinício do aplicativo.
ru: Для изменения типа возвращаемого значения {0} требуется перезапустить приложение.
tr: {0} öğesinin dönüş türünün değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的返回类型需要重启应用程序。

source: Changing the signature of {0} requires restarting the application because is not supported by the runtime.
cs: Změna podpisu {0} vyžaduje restartování aplikace, protože ji modul runtime nepodporuje.
de: Das Ändern der Signatur von {0} erfordert einen Neustart der Anwendung, da es von der Runtime nicht unterstützt wird.
es: Para cambiar la firma de {0} es necesario reiniciar la aplicación porque no es compatible con el tiempo de ejecución.
it: Se si modifica la firma di {0}, è necessario riavviare l'applicazione perché l'operazione non è supportata dal runtime.
ja: ランタイムでサポートされていないため、{0} をの署名を変更するには、アプリケーションを再起動する必要があります。
ko: 런타임에서 지원하지 않기 때문에 {0} 서명을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmienianie podpisu {0} wymaga ponownego uruchomienia aplikacji, ponieważ nie jest to obsługiwane przez środowisko uruchomieniowe.
pt_br: A alteração da assinatura de {0} requer a reinicialização do aplicativo porque não há suporte com o tempo de execução.
ru: Для изменения подписи {0} требуется перезапустить приложение, так как это не поддерживается средой выполнения.
tr: {0} imzasının silinmesi, çalışma zamanı tarafından desteklenmediğinden uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的签名需要重新启动应用程序，因为不受运行时支持。

source: Changing the type of a captured variable '{0}' previously of type '{1}' requires restarting the application.
cs: Změna typu zachycené proměnné {0}, která měla dříve typ {1}, vyžaduje restartování aplikace.
de: Das Ändern des Typs einer erfassten Variablen „{0}“, die zuvor vom Typ „{1}“ war, erfordert einen Neustart der Anwendung.
es: Para cambiar el tipo de una variable capturada "{0}" anteriormente de tipo "{1}" es necesario reiniciar la aplicación.
it: Se si modifica il tipo di una variabile catturata '{0}', in precedenza di tipo '{1}', è necessario riavviare l'applicazione.
ja: 以前は '{1}' 型だったキャプチャされた変数 '{0}' の型を変更するには、アプリケーションを再起動する必要があります。
ko: 이전에 '{1}' 형식의 캡처된 변수 '{0}' 형식을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana typu przechwyconej zmiennej elementu „{0}” poprzednio typu „{1}” wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar o tipo de uma variável capturada '{0}' anteriormente do tipo '{1}' requer o reinício do aplicativo.
ru: Для изменения типа зафиксированной переменной "{0}", ранее имевшей тип "{1}", требуется перезапустить приложение.
tr: Daha önce '{1}' türünde olup yakalanan bir '{0}' değişkeninin türünün değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改类型为“{1}”的以前捕获变量“{0}”的类型需要重启应用程序。

source: Changing type parameters of {0} requires restarting the application.
cs: Změna parametrů obecného typu u {0} vyžaduje restartování aplikace.
de: Das Ändern von Typparametern von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar los parámetros de tipo de {0} es necesario reiniciar la aplicación.
it: Se si modificano i parametri di tipo di {0}, è necessario riavviare l'applicazione.
ja: {0} の型パラメーターを変更するには、アプリケーションを再起動する必要があります。
ko: {0}의 유형 매개 변수를 변경하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Zmiana parametrów typu elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Alterar os parâmetros de tipo de {0} requer a reinicialização do aplicativo.
ru: Для изменения параметров типа {0} требуется перезапустить приложение.
tr: {0} tür parametrelerinin değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的类型参数需要重新启动应用程序。

source: Changing visibility of {0} requires restarting the application.
cs: Změna viditelnosti {0} vyžaduje restartování aplikace.
de: Das Ändern der Sichtbarkeit von {0} erfordert einen Neustart der Anwendung.
es: Para cambiar la visibilidad de {0} es necesario reiniciar la aplicación.
it: Se si modifica la visibilità di {0}, è necessario riavviare l'applicazione.
ja: {0} の可視性を変更するには、アプリケーションを再起動する必要があります。
ko: {0} 표시 유형을 변경하려면 애플리케이션을 다시 시작해야 합니다.
pl: Zmiana widoczności elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: Para alterar a visibilidade de {0}, é necessário reiniciar o aplicativo.
ru: Для изменения видимости {0} требуется перезапустить приложение.
tr: {0} öğesinin görünürlüğünün değiştirilmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 更改 {0} 的可见性要求重启应用程序。

source: Chosen version: '{0}'
cs: Zvolená verze: {0}
de: Ausgewählte Version: {0}
es: Versión elegida: "{0}"
it: Versione selezionata: '{0}'
ja: 選択されたバージョン: '{0}'
ko: 선택한 버전: '{0}'
pl: Wybrana wersja: „{0}”
pt_br: Versão escolhida: '{0}'
ru: Выбранная версия: "{0}"
tr: Seçilen sürüm: '{0}'
zh_hans: 所选版本: "{0}"

source: Code snippet for '{0}'
cs: Fragment kódu pro {0}
de: Codeschnipsel für „{0}“
es: Fragmento de código para “{0}”
it: Frammento di codice per '{0}'
ja: '{0}' のコード スニペット
ko: '{0}'의 코드 조각
pl: Fragment kodu dla elementu „{0}”
pt_br: Trecho de código para '{0}'
ru: Фрагмент кода для "{0}"
tr: '{0}' için kod parçacığı
zh_hans: "{0}" 的代码片段

source: Comments not allowed
cs: Komentáře nejsou povolené
de: Nicht zulässige Kommentare
es: Comentarios no permitidos
it: Commenti non consentiti
ja: コメントは使用できません
ko: 주석이 허용되지 않습니다.
pl: Komentarze są niedozwolone
pt_br: Comentários não permitidos
ru: Комментарии не разрешены
tr: Açıklamalara izin verilmiyor
zh_hans: 不允许注释

source: Configure {0} code style
cs: Nakonfigurovat styl kódu {0}
de: Codeformat "{0}" konfigurieren
es: Configurar el estilo de código de {0}
fr: Configurer le style de code {0}
it: Configura lo stile del codice di {0}
ja: {0} コード スタイルの構成
ko: {0} 코드 스타일 구성
pl: Konfiguruj styl kodu {0}
pt_br: Configurar estilo de código de {0}
ru: Настройка стиля кода {0}
tr: {0} kod stilini yapılandır
zh_hans: 配置 {0} 代码样式
zh_hant: 設定 {0} 程式碼樣式

source: Configure {0} severity
cs: Nakonfigurovat závažnost {0}
de: Schweregrad "{0}" konfigurieren
es: Configurar la gravedad de {0}
fr: Configurer la gravité {0}
it: Configura la gravità di {0}
ja: {0} の重要度の構成
ko: {0} 심각도 구성
pl: Konfiguruj ważność {0}
pt_br: Configurar severidade de {0}
ru: Настройка серьезности {0}
tr: {0} önem derecesini yapılandır
zh_hans: 配置 {0} 严重性
zh_hant: 設定 {0} 嚴重性

source: Configure severity for all '{0}' analyzers
cs: Nakonfigurujte závažnost pro všechny analyzátory {0}.
de: Schweregrad für alle Analysetools für "{0}" konfigurieren
es: Configurar la gravedad de todos los analizadores ("{0}")
fr: Configurer la gravité pour tous les analyseurs '{0}'
it: Configura la gravità per tutti gli analizzatori di '{0}'
ja: すべての '{0}' アナライザーの重要度を構成します
ko: 모든 '{0}' 분석기에 대해 심각도 구성
pl: Konfiguruj ważność wszystkich analizatorów „{0}”
pt_br: Configurar gravidade para todos os analisadores '{0}'
ru: Настройка серьезности для всех анализаторов ("{0}")
tr: Tüm '{0}' çözümleyicileri için önem derecesini yapılandır
zh_hans: 为所有“{0}”分析器配置严重性
zh_hant: 設定所有 '{0}' 分析器的嚴重性

source: Configure severity for all analyzers
cs: Nakonfigurujte závažnost pro všechny analyzátory.
de: Schweregrad für alle Analysetools konfigurieren
es: Configurar la gravedad de todos los analizadores
fr: Configurer la gravité pour tous les analyseurs
it: Configura la gravità per tutti gli analizzatori
ja: すべてのアナライザーの重要度を構成します
ko: 모든 분석기에 대해 심각도 구성
pl: Konfiguruj ważność wszystkich analizatorów
pt_br: Configurar gravidade para todos os analisadores
ru: Настройка серьезности для всех анализаторов
tr: Tüm çözümleyiciler için önem derecesini yapılandır
zh_hans: 为所有分析器配置严重性
zh_hant: 設定所有分析器的嚴重性

source: Constructors not allowed
cs: Konstruktory nejsou povolené
de: Konstruktoren sind nicht zulässig
es: Constructores no permitidos
it: Costruttori non consentiti
ja: コンストラクターは使用できません
ko: 생성자를 사용할 수 없습니다.
pl: Konstruktory są niedozwolone
pt_br: Construtores não permitidos
ru: Конструкторы не разрешены
tr: Oluşturuculara izin verilmiyor
zh_hans: 不允许使用构造函数

source: Containing Member
cs: Obsahující člen
de: Enthaltender Member
es: Miembro contenedor
it: Membro contenitore
ja: 含んでいるメンバー
ko: 포함하는 멤버
pl: Zawierająca składowa
pt_br: Contendo Membro
ru: Содержащий член
tr: Kapsayan Üye
zh_hans: 包含成员

source: Containing Type
cs: Obsahující typ
de: Enthaltender Typ
es: Tipo contenedor
it: Tipo contenitore
ja: 含んでいる型
ko: 포함하는 형식
pl: Zawierający typ
pt_br: Contendo Tipo
ru: Содержащий тип
tr: Kapsayan Tür
zh_hans: 包含类型

source: Convert number
cs: Převést číslo
de: Zahl konvertieren
es: Convertir número
it: Converti numero
ja: 数値の変換
ko: 숫자 변환
pl: Konwertuj liczbę
pt_br: Converter número
ru: Преобразовать число
tr: Sayıyı dönüştür
zh_hans: 转换数字

source: Convert to LINQ
cs: Převést na LINQ
de: In LINQ konvertieren
es: Convertir a LINQ
fr: Convertir en LINQ
it: Converti in LINQ
ja: LINQ に変換
ko: LINQ로 변환
pl: Konwertuj na składnię LINQ
pt_br: Converter para LINQ
ru: Преобразовать в LINQ
tr: LINQ to dönüştürme
zh_hans: 转换为 LINQ
zh_hant: 轉換至 LINQ

source: Convert to class
cs: Převést na třídu
de: In Klasse konvertieren
es: Convertir a la clase
fr: Convertir en classe
it: Converti in classe
ja: クラスに変換
ko: 클래스로 변환
pl: Konwertuj na klasę
pt_br: Converter em classe
ru: Преобразовать в класс
tr: Sınıfa dönüştür
zh_hans: 转换为类
zh_hant: 轉換為類別

source: Convert to LINQ (call form)
cs: Převést na LINQ (volání formuláře)
de: In LINQ konvertieren (Aufrufformular)
es: Convertir a LINQ (formulario de llamada)
fr: Convertir en LINQ (formulaire d'appel)
it: Converti in LINQ (form di chiamata)
ja: LINQ (呼び出し形式) へ変換
ko: LINQ로 변환(통화 양식)
pl: Konwertuj na składnię LINQ (wywołaj formularz)
pt_br: Converter para LINQ (formulário de chamada)
ru: Преобразовать в LINQ (форма вызова)
tr: LINQ (görüşmesi formu) dönüştürmek
zh_hans: 转换为 LINQ (调用形式)
zh_hant: 轉換為 LINQ (呼叫表單)

source: Convert to record
cs: Převést na záznam
de: In Datensatz konvertieren
es: Convertir en registro
fr: Convertir en enregistrement
it: Converti in record
ja: レコードへの変換
ko: 레코드로 변환
pl: Konwertuj na rekord
pt_br: Converter em Registro
ru: Преобразовать в запись
tr: Kayda dönüştür
zh_hans: 转换为记录
zh_hant: 轉換為記錄

source: Convert to record struct
cs: Převést na strukturu záznamu
de: In Datensatzstruktur konvertieren
es: Convertir en registro de estructuras
it: Converti in struct di record
ja: レコード構造体に変換する
ko: 레코드 구조체로 변환
pl: Konwertuj na strukturę rekordów
pt_br: Converter em registro de struct
ru: Преобразовать в структуру записей
tr: Kayıt yapısına dönüştür
zh_hans: 转换为记录结构

source: Convert to struct
cs: Převést na strukturu
de: In Struktur konvertieren
es: Convertir a struct
fr: Convertir en struct
it: Converti in struct
ja: 構造体に変換
ko: 구조체로 변환
pl: Konwertuj na strukturę
pt_br: Converter para struct
ru: Преобразовать в структуру
tr: Yapıya dönüştür
zh_hans: 转换为结构
zh_hant: 轉換為結構

source: Convert to tuple
cs: Převést na řazenou kolekci členů
de: In Tupel konvertieren
es: Convertir a tupla
it: Converti in tupla
ja: タプルに変換
ko: 튜플로 변환
pl: Konwertuj na spójną kolekcję
pt_br: Converter a tupla
ru: Преобразовать в кортеж
tr: Başlığa dönüştür
zh_hans: 转换为元组

# Could_not_find_PDB_on_disk_or_embedded
source: Could not find portable PDB on disk or embedded.
cs: Na disku nebo vloženém disku se nepovedlo najít přenosný soubor PDB.
de: Die portierbare PDB-Datei wurde nicht auf dem Datenträger oder eingebettet gefunden.
es: No se pudo encontrar el archivo PDB portátil en el disco o incrustado.
it: Impossibile trovare PDB portabile su disco o incorporato.
ja: ポータブル PDB がディスクまたは埋め込みで見つかりませんでした。
ko: 디스크 또는 포함에서 이식 가능한 PDB를 찾을 수 없습니다.
pl: Nie można odnaleźć przenośnego pliku PDB na dysku lub w trybie osadzonym.
pt_br: Não foi possível encontrar PDB portátil no disco ou incorporado.
ru: Не удалось найти переносимый PDB-файл на диске или во внедренном источнике.
tr: Diskte veya gömülü olarak taşınabilir PDB bulunamadı.
zh_hans: 在磁盘或嵌入源上找不到可移植 PDB。

# Could_not_find_PDB_on_disk_or_embedded_or_server
source: Could not find PDB on disk, or embedded, or on a symbol server.
cs: Soubor PDB nelze najít na disku, vloženém nebo na serveru symbolů.
de: Die PDB-Datei wurde nicht auf dem Datenträger, eingebettet oder auf einem Symbolserver gefunden.
es: No se encontró el archivo PDB en el disco, incrustado o en un servidor de símbolos.
it: Impossibile trovare PDB su disco, incorporato o su un server di simboli.
ja: ディスク、埋め込み、またはシンボル サーバーで PDB が見つかりませんでした。
ko: 디스크에서 PDB를 찾거나 포함된 PDB 또는 기호 서버에서 PDB를 찾을 수 없습니다.
pl: Nie można odnaleźć pliku PDB na dysku, w trybie osadzonym lub na serwerze symboli.
pt_br: Não foi possível localizar o PDB no disco, integrado ou em um servidor de símbolo.
ru: Не удалось найти PDB-файл на диске, во внедренном источнике или на сервере символов.
tr: PDB diskte, gömülü veya bir sembol sunucusunda bulunamadı.
zh_hans: 在磁盘、嵌入源或符号服务器上找不到 PDB。

source: Could not find by name: '{0}'
cs: Nepovedlo se najít podle názvu: {0}
de: Der Name "{0}" wurde nicht gefunden.
es: No se pudo encontrar por el nombre "{0}"
it: Non è stato possibile eseguire la ricerca per nome: '{0}'
ja: 名前 '{0}' で見つけることができませんでした
ko: '{0}' 이름으로 찾을 수 없습니다.
pl: Nie można było odnaleźć według nazwy: „{0}”
pt_br: Não foi possível encontrá-lo por nome: '{0}'
ru: Не удалось найти по имени: "{0}"
tr: '{0}' adıyla bulunamadı
zh_hans: 无法按名称“{0}”查找

source: Could not find implementation of symbol '{0}'
cs: Nepovedlo se najít implementaci symbolu {0}.
de: Implementierung des Symbols '{0}' konnte nicht gefunden werden
es: No se pudo encontrar la implementación del símbolo '{0}'
it: Non è stato possibile trovare l'implementazione del simbolo '{0}'
ja: シンボル '{0}'の実装が見つかりませんでした
ko: '{0}' 기호의 구현을 찾을 수 없습니다.
pl: Nie można odnaleźć implementacji symbolu „{0}”
pt_br: Não foi possível localizar a implementação do símbolo '{0}'
ru: Не найдена реализация символа "{0}"
tr: '{0}' sembolünün uygulaması bulunamadı
zh_hans: 找不到符号 "{0}" 的实现

source: Create and assign field '{0}'
cs: Vytvořit a přiřadit pole {0}
de: Feld "{0}" erstellen und zuweisen
es: Crear y asignar campo "{0}"
fr: Créer et affecter le champ '{0}'
it: Crea e assegna il campo '{0}'
ja: フィールド '{0}' を作成して割り当てる
ko: '{0}' 필드 만들기 및 할당
pl: Utwórz i przypisz pole „{0}”
pt_br: Criar e atribuir o campo '{0}'
ru: Создать и назначить поле "{0}"
tr: '{0}' alanını oluştur ve ata
zh_hans: 创建字段 "{0}" 并赋值
zh_hant: 建立並指派欄位 '{0}'

source: Create and assign property '{0}'
cs: Vytvořit a přiřadit vlastnost {0}
de: Eigenschaft "{0}" erstellen und zuweisen
es: Crear y asignar propiedad "{0}"
fr: Créer et affecter la propriété '{0}'
it: Crea e assegna la proprietà '{0}'
ja: プロパティ '{0}' を作成して割り当てる
ko: '{0}' 속성 만들기 및 할당
pl: Utwórz i przypisz właściwość „{0}”
pt_br: Criar e atribuir a propriedade '{0}'
ru: Создать и назначить свойство "{0}"
tr: '{0}' özelliğini oluştur ve ata
zh_hans: 创建属性 "{0}" 并赋值
zh_hant: 建立並指派屬性 '{0}'

source: Create and assign remaining as fields
cs: Vytvořit a přiřadit zbývající položky jako pole
de: Verbleibende Elemente als Felder erstellen und zuweisen
es: Crear y asignar el resto como campos
fr: Créer et affecter ce qui reste en tant que champs
it: Crea e assegna rimanenti come campi
ja: 残りをフィールドとして作成して割り当てる
ko: 나머지를 만들고 필드로 할당합니다.
pl: Utwórz i przypisz pozostałe jako pola
pt_br: Criar e atribuir os restantes como campos
ru: Создать и назначить оставшиеся как поля
tr: Kalanları alan olarak oluştur ve ata
zh_hans: 创建其余部分并赋值为字段
zh_hant: 建立其餘項目並將其指派為欄位

source: Create and assign remaining as properties
cs: Vytvořit a přiřadit zbývající položky jako vlastnosti
de: Verbleibende Elemente als Eigenschaften erstellen und zuweisen
es: Crear y asignar el resto como propiedades
fr: Créer et affecter ce qui reste en tant que propriétés
it: Crea e assegna rimanenti come proprietà
ja: 残りをプロパティとして作成して割り当てる
ko: 나머지를 만들고 속성으로 할당합니다.
pl: Utwórz i przypisz pozostałe jako właściwości
pt_br: Criar e atribuir os restantes como propriedades
ru: Создать и назначить оставшиеся как свойства
tr: Kalanları özellik olarak oluştur ve ata
zh_hans: 创建其余部分并赋值为属性
zh_hant: 建立其餘項目並將其指派為屬性

source: Debug All Tests
cs: Ladit všechny testy
es: Depurar todas las pruebas
ko: 모든 테스트 디버그
pl: Debuguj wszystkie testy
pt_br: Depurar Todos os Testes
ru: Отладить все тесты
tr: Tüm Testlerin Hatalarını Ayıkla
zh_hans: 调试所有测试

source: Debug Test
cs: Ladit test
es: Depurar prueba
ko: 테스트 디버그
pl: Debuguj test
pt_br: Teste de Depuração
ru: Отладка теста
tr: Testin Hatalarını Ayıkla
zh_hans: 调试测试

source: Decompilation log
cs: Protokol o dekompilaci
de: Dekompilierungsprotokoll
es: Registro de descompilación
it: Log di decompilazione
ja: 逆コンパイルのログ
ko: 디컴파일 로그
pl: Dziennik dekompilacji
pt_br: Log de descompilação
ru: Журнал декомпиляции
tr: Kaynak koda dönüştürme günlüğü
zh_hans: 反编译日志

source: decompiled
cs: dekompilováno
de: Dekompiliert
es: descompilado
it: decompilato
ja: 逆コンパイル済み
ko: 디컴파일됨
pl: zdekompilowane
pt_br: descompilado
ru: декомпилировано
tr: kaynak koda dönüştürüldü
zh_hans: 反编译

source: Deconstruct locals for '{0}'
cs: Dekonstruovat místní hodnoty pro {0}
de: Lokale Elemente für „{0}“ dekonstruieren
es: Deconstruir variables locales para '{0}'
it: Locali di decostruzione per '{0}'
ja: '{0}' のローカルを分解します
ko: '{0}'에 대한 로컬 분해
pl: Dekonstrukcja elementów lokalnych dla '{0}'
pt_br: Desconstruir locais para "{0}"
ru: Деконструировать локальные объекты для "{0}"
tr: '{0}' için yerlileri yapısöküme uğratın
zh_hans: 解构“{0}”的局部变量

source: Deleting {0} around an active statement requires restarting the application.
cs: Odstranění {0} kolem aktivního příkazu vyžaduje restartování aplikace.
de: Das Löschen von {0} um eine aktive Anweisung erfordert einen Neustart der Anwendung.
es: Para eliminar {0} alrededor de una instrucción de acción se requiere reiniciar la aplicación.
it: Se si elimina {0} all'inizio di un'istruzione attiva, è necessario riavviare l'applicazione.
ja: アクティブ ステートメントの前後の {0} を削除するには、アプリケーションを再起動する必要があります。
ko: 활성 문 주변의 {0}을(를) 삭제하려면 응용 프로그램을 다시 시작해야 합니다.
pl: Usuwanie elementu {0} wokół aktywnej instrukcji wymaga ponownego uruchomienia aplikacji.
pt_br: Excluir {0} em torno de uma instrução ativa requer a reinicialização do aplicativo.
ru: Для удаления {0} вокруг активного оператора требуется перезапустить приложение.
tr: Etkin bir deyim etrafında {0} öğesini silmek, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 删除活动语句周围的 {0} 需要重新启动应用程序。

source: Deleting {0} requires restarting the application.
cs: Odstranění {0} vyžaduje restartování aplikace.
de: Das Löschen von {0} erfordert einen Neustart der Anwendung.
es: Para eliminar {0} es necesario reiniciar la aplicación.
it: Se si elimina {0}, è necessario riavviare l'applicazione.
ja: {0} を削除すると、アプリケーションを再起動する必要があります。
ko: {0}을(를) 삭제하려면 애플리케이션을 다시 시작해야 합니다.
pl: Usunięcie elementu {0} wymaga ponownego uruchomienia aplikacji.
pt_br: A exclusão de {0} requer o reinício do aplicativo.
ru: Для удаления {0} требуется перезапустить приложение.
tr: {0} öğesinin silinmesi, uygulamanın yeniden başlatılmasını gerektirir.
zh_hans: 删除 {0} 需要重启应用程序。
