Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: updating usages in containing type
cs: aktualizace použití v obsahujícím typu
de: Verwendungen im enthaltenden Typ aktualisieren
es: actualización de los usos en el tipo contenedor
fr: mise à jour des utilisations dans le type conteneur
it: aggiornamento degli utilizzi nel tipo contenitore
ja: それを含む型の使用の更新
ko: 포함하는 형식에서 사용을 업데이트하는 중
pl: aktualizowanie użyć w typie zawierającym
pt_br: usos em que contém o tipo de atualização
ru: обновление директив usage во вложенном типе
tr: türünü içeren içinde güncelleştirme kullanımları
zh_hans: 更新包含类型中的用法
zh_hant: 正在更新包含類型中的使用方式

source: updating usages in dependent projects
cs: aktualizace použití v závislých projektech
de: Verwendungen in abhängigen Projekten werden aktualisiert.
es: actualización de usos en proyectos dependientes
fr: mise à jour des utilisations dans les projets dépendants
it: aggiornamento degli utilizzi nei progetti dipendenti
ja: 依存プロジェクトの使用の更新
ko: 종속 프로젝트에서 사용을 업데이트하는 중
pl: aktualizowanie użyć w projektach zależnych
pt_br: atualizar usos em projetos dependentes
ru: обновление директив usage в зависимых проектах
tr: bağımlı projelerdeki kullanımlar güncelleştiriliyor
zh_hans: 更新相关项目中的用法
zh_hant: 正在更新相依專案中的使用方式

source: utc hour and minute offset
cs: posun hodiny a minuty proti UTC
de: UTC-Abweichung in Stunden und Minuten
es: desfase en horas y minutos respecto a UTC
fr: décalage des heures et des minutes UTC
it: Differenza dall'ora UTC in ore e minuti
ja: UTC 時間と分のオフセット
ko: UTC 시간 및 분 오프셋
pl: przesunięcie godziny i minuty utc
pt_br: diferença de hora e minuto UTC
ru: смещение от UTC в часах и минутах
tr: UTC saat ve dakika uzaklığı
zh_hans: utc 小时和分钟偏移量
zh_hant: utc 小時和分鐘時差

# utc_hour_and_minute_offset_description
source: With DateTime values, the "zzz" custom format specifier represents the signed offset of the local operating system's time zone from UTC, measured in hours and minutes. It doesn't reflect the value of an instance's DateTime.Kind property. For this reason, the "zzz" format specifier is not recommended for use with DateTime values. With DateTimeOffset values, this format specifier represents the DateTimeOffset value's offset from UTC in hours and minutes. The offset is always displayed with a leading sign. A plus sign (+) indicates hours ahead of UTC, and a minus sign (-) indicates hours behind UTC. A single-digit offset is formatted with a leading zero.
cs: U hodnot DateTime specifikátor vlastního formátu zzz představuje posun časového pásma místního operačního systému od UTC se znaménkem, který se měří v hodinách a minutách. Neodráží hodnotu vlastnosti DateTime.Kind instance. Z toho důvodu se specifikátor formátu zzz nedoporučuje používat s hodnotami DateTime. U hodnot DateTimeOffset tento specifikátor formátu představuje posun hodnoty DateTimeOffset od času UTC v hodinách a minutách. Posun se vždy zobrazuje se znaménkem na začátku. Znaménko plus (+) označuje hodiny před UTC a znaménko minus (-) pak hodiny za UTC. Posun s jednou číslicí se formátuje s nulou na začátku.
de: Bei DateTime-Werten repräsentiert der benutzerdefinierte Formatbezeichner "zzz" die Abweichung (einschließlich Vorzeichen) der Zeitzone des lokalen Betriebssystems von der koordinierten Weltzeit (UTC), gemessen in Stunden und Minuten. Er spiegelt nicht den Wert einer Instanz der DateTime.Kind-Eigenschaft wider. Aus diesem Grund wird der Formatbezeichner "zzz" nicht zur Verwendung mit DateTime-Werten empfohlen. Bei DateTimeOffset-Werten stellt dieser Formatbezeichner die Abweichung des DateTimeOffset-Wertes von UTC in Stunden und Minuten dar. Die Abweichung wird immer mit einem Vorzeichen angezeigt. Ein Pluszeichen (+) steht für Stunden vor UTC, ein Minuszeichen (-) für Stunden nach UTC. Eine einstellige Abweichung wird mit einer führenden Null formatiert.
es: Con los valores de DateTime, el especificador de formato personalizado "zzz" representa el desfase con signo de la zona horaria del sistema operativo local respecto a la hora UTC, medido en horas y minutos. No refleja el valor de la propiedad DateTime.Kind de una instancia. Por este motivo, no se recomienda usar el especificador de formato "zzz" con valores de DateTime. Con valores de DateTimeOffset, este especificador de formato representa el desfase del valor de DateTimeOffset con respecto a la hora UTC en horas y minutos. El desfase se muestra siempre con un signo delante. Un signo más (+) indica las horas de adelanto respecto a la hora UTC y un signo menos (-) indica las horas de retraso respecto a la hora UTC. Cuando el desfase es de un solo dígito, se le pone un cero delante.
fr: Avec les valeurs DateTime, le spécificateur de format personnalisé "zzz" représente le décalage signé du fuseau horaire du système d'exploitation local par rapport à l'heure UTC, en heures et en minutes. Il ne reflète pas la valeur de la propriété DateTime.Kind d'une instance. C'est la raison pour laquelle l'utilisation du spécificateur de format "zzz" n'est pas recommandée avec les valeurs DateTime. Avec les valeurs DateTimeOffset, ce spécificateur de format représente le décalage de la valeur DateTimeOffset par rapport à l'heure UTC, en heures et en minutes. Le décalage est toujours affiché avec un signe de début. Le signe plus (+) indique les heures d'avance par rapport à l'heure UTC, et le signe moins (-) indique les heures de retard par rapport à l'heure UTC. Un décalage à un chiffre est présenté dans un format qui comporte un zéro de début.
it: Con valori DateTime, l'identificatore di formato personalizzato "zzz" rappresenta la differenza dall'ora UTC con segno del fuso orario del sistema operativo locale, misurata in ore e minuti. Non rispecchia il valore della proprietà DateTime.Kind di un'istanza. Per questo motivo, non è consigliabile usare l'identificatore di formato "zzz" con valori DateTime. Con valori DateTimeOffset, questo identificatore di formato rappresenta la differenza dall'ora UTC del valore DateTimeOffset in ore e minuti. La differenza viene sempre visualizzata con un segno iniziale. Un segno più (+) indica le ore in più e un segno meno (-) le ore in meno rispetto all'ora UTC. Un valore di differenza a una sola cifra viene formattato con uno zero iniziale.
ja: DateTime 値の場合、"zzz" カスタム書式指定子は、オペレーティング システムのローカル タイム ゾーンの、UTC を基準とした符号付きオフセット (時間および分単位) を表します。インスタンスの DateTime.Kind プロパティの値は反映されません。このため、DateTime 値に対して "zzz" 書式指定子を使用することはお勧めしません。 DateTimeOffset 値を使用した場合、この書式指定子は、DateTimeOffset 値の UTC を基準とするオフセット (時間および分単位)を表します。 このオフセットは、常に先頭の符号と共に表示されます。プラス記号 (+) は UTC より時間が進んでいることを示し、マイナス記号 (-) は UTC よりも時間が遅れていることを示します。1 桁のオフセットは、先行ゼロ付きで書式設定されます。
ko: DateTime 값의 경우, "zzz" 사용자 지정 형식 지정자는 UTC에서 가져온 로컬 운영 체제의 표준 시간대의 부호 있는 오프셋을 나타내며(단위: 시간과 분), 인스턴스의 DateTime.Kind 속성의 값을 반영하지 않습니다. 따라서 DateTime 값과 함께 "zzz" 형식 지정자를 사용하는 것은 권장되지 않습니다. DateTimeOffset 값의 경우, 이 형식 지정자는 UTC에서 가져온 DateTimeOffset 값의 오프셋을 나타냅니다(단위: 시간과 분). 오프셋은 항상 앞에 있는 부호와 함께 표시됩니다. 더하기 부호(+)는 UTC보다 앞선 시간을, 빼기 부호(-)는 UTC보다 늦은 시간을 나타냅니다. 한 자릿수 오프셋은 앞에 0이 있는 형식으로 지정됩니다.
pl: W przypadku wartości DateTime niestandardowy specyfikator formatu „zzz” reprezentuje przesunięcie ze znakiem strefy czasowej lokalnego systemu operacyjnego względem czasu UTC wyrażone w godzinach i minutach. Nie uwzględnia on wartości właściwości DateTime.Kind wystąpienia. Z tego powodu nie zaleca się użycia specyfikatora formatu „zzz” z wartościami DateTime. W przypadku wartości DateTimeOffset ten specyfikator formatu reprezentuje przesunięcie wartości DateTimeOffset względem czasu UTC w godzinach i minutach. Przesunięcie jest zawsze wyświetlane ze znakiem wiodącym. Znak plus (+) wskazuje godzinę po czasie UTC, a znak minus (-) wskazuje godzinę przed czasem UTC. Jednocyfrowa wartość przesunięcia jest formatowana przy użyciu wiodącego zera.
pt_br: Com os valores DateTime, o especificador de formato personalizado "ZZZ" representa o deslocamento assinado do fuso horário do sistema operacional local do UTC, medido em horas e minutos. Ele não reflete o valor da propriedade DateTime.Kind de uma instância. Por esse motivo, o especificador de formato "ZZZ" não é recomendado para uso com valores DateTime. Com os valores de DateTimeOffset, este especificador de formato representa o deslocamento do valor de DateTimeOffset do UTC em horas e minutos. O deslocamento é sempre exibido com um sinal à esquerda. Um sinal de adição (+) indica horas à frente do UTC e um sinal de subtração (-) indica horas atrás do UTC. Um deslocamento de dígito único é formatado com um zero à esquerda.
ru: При использовании значений типа DateTime описатель пользовательского формата "zzz" представляет значение смещения локального часового пояса операционной системы от UTC, имеющее знак и измеряемое в часах и минутах. Оно не отражает значение свойства DateTime.Kind экземпляра. Поэтому описатель формата "zzz" не рекомендуется использовать со значениями DateTime. При использовании значений DateTimeOffset этот описатель формата представляет смещение значения DateTimeOffset от UTC в часах и минутах. Смещение всегда отображается с предшествующим знаком. Знак "плюс" (+) обозначает часы опережения UTC, а знак "минус" (-) — часы отставания от UTC. Смещение из одной цифры форматируется с начальным нулем.
tr: DateTime değerlerinde, "zzz" özel biçim belirticisi, yerel işletim sisteminin saat diliminin saat ve dakika cinsinden UTC'den işaretli uzaklığını temsil eder. Bir örneğin DateTime.Kind özelliğinin değerini yansıtmaz. Bu nedenle, "zzz" biçim belirticisinin DateTime değerleriyle kullanılması önerilmez. DateTimeOffset değerlerinde, bu biçim belirticisi, DateTimeOffset değerinin saat ve dakika cinsinden UTC'den uzaklığını temsil eder. Uzaklık her zaman başında bir işaretle görüntülenir. Artı işareti (+) UTC'den ilerideki, eksi işareti (-) ise UTC'den gerideki saatleri gösterir. Tek haneli bir uzaklık, başına bir sıfır eklenerek biçimlendirilir.
zh_hans: 对于 DateTime 值，"zzz" 自定义格式说明符表示本地操作系统的时区与 UTC 的有符号偏移量，以小时和分钟度量。它不反映实例的 DateTime.Kind 属性的值。因此，不建议将 "zzz" 格式说明符用于 DateTime 值。 对于 DateTimeOffset 值，此格式说明符表示 DateTimeOffset 值与 UTC 的偏移量(以小时和分钟为单位)。 偏移量始终显示为带有前导符号。加号(+)表示小时数早于 UTC，减号(-)指示小时数迟于 UTC。一位数字的偏移量设置为带前导零的格式。
zh_hant: 使用 DateTime 值時，"zzz" 自訂格式規範代表區域作業系統時區與 UTC 的帶正負號時差 (以小時與分鐘為單位)，且不會反映出執行個體的 DateTime.Kind 屬性值。因此，建議不要搭配 DateTime 值使用 "zzz" 格式規範。 對 DateTimeOffset 值而言，這個格式規範代表 DateTimeOffset 值的 UTC 時差 (以小時與分鐘為單位)。 時差的開頭永遠會顯示正負號。正號 (+) 表示早於 UTC 的小時數，負號 (-) 則表示晚於 UTC 的小時數。個位數的時差開頭會填補零。

source: utc hour offset (1-2 digits)
cs: posun hodin proti UTC (1–2 číslice)
de: UTC-Abweichung in Stunden (1–2 Stellen)
es: desfase respecto a la hora UTC (1-2 dígitos)
fr: décalage des heures UTC (1 à 2 chiffres)
it: Differenza dall'ora UTC in ore (1-2 cifre)
ja: UTC 時間のオフセット (1 ～ 2 桁)
ko: UTC 시간 오프셋(1~2자리)
pl: przesunięcie godziny utc (1-2 cyfry)
pt_br: diferença horária UTC (1-2 dígitos)
ru: смещение от UTC в часах (1–2 цифры)
tr: UTC saat uzaklığı (1-2 rakam)
zh_hans: utc 小时偏移量(1-2 位数)
zh_hant: utc 小時時差 (1-2 位數)

# utc_hour_offset_1_2_digits_description
source: With DateTime values, the "z" custom format specifier represents the signed offset of the local operating system's time zone from Coordinated Universal Time (UTC), measured in hours. It doesn't reflect the value of an instance's DateTime.Kind property. For this reason, the "z" format specifier is not recommended for use with DateTime values. With DateTimeOffset values, this format specifier represents the DateTimeOffset value's offset from UTC in hours. The offset is always displayed with a leading sign. A plus sign (+) indicates hours ahead of UTC, and a minus sign (-) indicates hours behind UTC. A single-digit offset is formatted without a leading zero. If the "z" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: U hodnot DateTime specifikátor vlastního formátu z představuje posun časového pásma místního operačního systému od koordinovaného univerzálního času (UTC) se znaménkem, který se měří v hodinách. Neodráží hodnotu vlastnosti DateTime.Kind instance. Z toho důvodu se specifikátor formátu z nedoporučuje používat s hodnotami DateTime. U hodnot DateTimeOffset tento specifikátor formátu představuje posun hodnoty DateTimeOffset od času UTC v hodinách. Posun se vždy zobrazuje se znaménkem na začátku. Znaménko plus (+) označuje hodiny před UTC a znaménko minus (-) pak hodiny za UTC. Posun s jednou číslicí se formátuje bez nuly na začátku. Pokud se specifikátor formátu z použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času a vyvolá FormatException.
de: Bei DateTime-Werten repräsentiert der benutzerdefinierte Formatbezeichner "z" die Abweichung (einschließlich Vorzeichen) der Zeitzone des lokalen Betriebssystems von der koordinierten Weltzeit (UTC), gemessen in Stunden. Er spiegelt nicht den Wert einer Instanz der DateTime.Kind-Eigenschaft wider. Aus diesem Grund wird der Formatbezeichner "z" nicht zur Verwendung mit DateTime-Werten empfohlen. Bei DateTimeOffset-Werten stellt dieser Formatbezeichner die Abweichung des DateTimeOffset-Wertes von UTC in Stunden dar. Die Abweichung wird immer mit einem Vorzeichen angezeigt. Ein Pluszeichen (+) steht für Stunden vor UTC, ein Minuszeichen (-) für Stunden nach UTC. Eine einstellige Abweichung wird ohne führende Null formatiert. Bei Verwendung des Formatbezeichners "z" ohne weitere Formatbezeichner wird er als Standardformatbezeichner für Datums- und Uhrzeitwerte interpretiert und löst eine FormatException aus.
es: Con los valores de DateTime, el especificador de formato personalizado "z" representa el desfase con signo de la zona horaria del sistema operativo local respecto a la hora UTC (hora universal coordinada), medido en horas y minutos. No refleja el valor de la propiedad DateTime.Kind de una instancia. Por este motivo, no se recomienda usar el especificador de formato "z" con valores de DateTime. Con valores de DateTimeOffset, este especificador de formato representa el desfase del valor de DateTimeOffset con respecto a la hora UTC en horas. El desfase se muestra siempre con un signo delante. Un signo más (+) indica las horas de adelanto respecto a la hora UTC y un signo menos (-) indica las horas de retraso respecto a la hora UTC. Cuando el desfase es de un solo dígito, se le pone un cero delante. Si el especificador de formato "z" se usa sin otros especificadores de formato personalizados, se interpreta como un especificador de formato de fecha y hora estándar y produce una excepción de formato (FormatException).
fr: Avec les valeurs DateTime, le spécificateur de format personnalisé "z" représente le décalage signé du fuseau horaire du système d'exploitation local par rapport à l'heure UTC, en heures. Il ne reflète pas la valeur de la propriété DateTime.Kind d'une instance. C'est la raison pour laquelle l'utilisation du spécificateur de format "z" n'est pas recommandée avec les valeurs DateTime. Avec les valeurs DateTimeOffset, ce spécificateur de format représente le décalage de la valeur DateTimeOffset par rapport à l'heure UTC, en heures. Le décalage est toujours affiché avec un signe de début. Le signe plus (+) indique les heures d'avance par rapport à l'heure UTC, et le signe moins (-) indique les heures de retard par rapport à l'heure UTC. Un décalage à un chiffre est présenté dans un format qui ne comporte aucun zéro de début. Si le spécificateur de format "z" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: Con valori DateTime, l'identificatore di formato personalizzato "z" rappresenta la differenza dall'ora UTC (Coordinated Universal Time) con segno del fuso orario del sistema operativo locale, misurata in ore. Non rispecchia il valore della proprietà DateTime.Kind di un'istanza. Per questo motivo, non è consigliabile usare l'identificatore di formato "z" con valori DateTime. Con valori DateTimeOffset, questo identificatore di formato rappresenta la differenza dall'ora UTC del valore DateTimeOffset in ore. La differenza viene sempre visualizzata con un segno iniziale. Un segno più (+) indica le ore in più e un segno meno (-) le ore in meno rispetto all'ora UTC. Un valore di differenza a una sola cifra viene formattato senza zero iniziale. Se l'identificatore di formato "z" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: DateTime 値で使用した場合、"z" カスタム書式指定子は、オペレーティング システムのローカル タイムゾーンの、世界協定時刻 (UTC) を基準とした符号付きオフセット (時間単位) を表します。インスタンスの DateTime.Kind プロパティの値は反映されません。このため、DateTime 値に対して "z" 書式指定子を使用することはお勧めできません。 DateTimeOffset 値で使用した場合、この書式指定子は DateTimeOffset 値の UTC を基準とするオフセット (時間単位) を表します。 このオフセットは、常に先頭の符号と共に表示されます。プラス記号 (+) は UTC より時間が進んでいることを示し、マイナス記号 (-) は UTC よりも時間が遅れていることを示します。1 桁のオフセットは、先行ゼロなしで書式設定されます。 他のカスタム書式指定子が使用されていない場合、"z" は標準の日時書式指定子として解釈され、FormatException をスローします。
ko: DateTime 값의 경우, "z" 사용자 지정 형식 지정자는 UTC(협정 세계시)에서 가져온 로컬 운영 체제의 표준 시간대의 부호 있는 오프셋을 나타내며(단위: 시간), 인스턴스의 DateTime.Kind 속성의 값을 반영하지 않습니다. 따라서 DateTime 값과 함께 "z" 형식 지정자를 사용하는 것은 권장되지 않습니다. DateTimeOffset 값의 경우, 이 형식 지정자는 UTC에서 가져온 DateTimeOffset 값의 오프셋을 나타냅니다(단위: 시간). 오프셋은 항상 앞에 있는 부호와 함께 표시됩니다. 더하기 부호(+)는 UTC보다 앞선 시간을, 빼기 부호(-)는 UTC보다 늦은 시간을 나타냅니다. 한 자릿수 오프셋은 앞에 0이 없는 형식으로 지정됩니다. 다른 사용자 지정 형식 지정자 없이 "z" 형식 지정자를 사용하면 표준 날짜 및 시간 형식으로 해석되어 FormatException을 throw합니다.
pl: W przypadku wartości DateTime niestandardowy specyfikator formatu „z” reprezentuje przesunięcie ze znakiem strefy czasowej lokalnego systemu operacyjnego względem uniwersalnego czasu koordynowanego (UTC) wyrażone w godzinach. Nie uwzględnia on wartości właściwości DateTime.Kind wystąpienia. Z tego powodu nie zaleca się użycia specyfikatora formatu „z” z wartościami DateTime. W przypadku wartości DateTimeOffset ten specyfikator formatu reprezentuje przesunięcie wartości DateTimeOffset względem czasu UTC w godzinach. Przesunięcie jest zawsze wyświetlane ze znakiem wiodącym. Znak plus (+) wskazuje godzinę po czasie UTC, a znak minus (-) wskazuje godzinę przed czasem UTC. Jednocyfrowa wartość przesunięcia jest formatowana przy użyciu wiodącego zera. Jeśli specyfikator formatu „z” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator daty i godziny i powoduje zgłoszenie wyjątku FormatException.
pt_br: Com valores DateTime, o especificador de formato personalizado "z" representa o deslocamento assinado do fuso horário do sistema operacional local do UTC (Tempo Universal Coordenado), medido em horas. Ele não reflete o valor da propriedade DateTime.Kind de uma instância. Por esse motivo, o especificador de formato "z" não é recomendado para uso com valores DateTime. Com os valores de DateTimeOffset, este especificador de formato representa o deslocamento do valor de DateTimeOffset do UTC em horas. O deslocamento é sempre exibido com um sinal à esquerda. Um sinal de adição (+) indica horas à frente do UTC e um sinal de subtração (-) indica horas atrás do UTC. Um deslocamento de dígito único é formatado sem um zero à esquerda. Se o especificador de formato "z" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: При использовании значений типа DateTime описатель пользовательского формата "z" представляет значение смещения локального часового пояса операционной системы от UTC, имеющее знак и измеряемое в часах. Оно не отражает значение свойства DateTime.Kind экземпляра. Поэтому описатель формата "z" не рекомендуется использовать со значениями DateTime. При использовании значений DateTimeOffset этот описатель формата представляет смещение значения DateTimeOffset от UTC в часах. Смещение всегда отображается с предшествующим знаком. Знак "плюс" (+) обозначает часы опережения UTC, а знак "минус" (-) — часы отставания от UTC. Смещение из одной цифры форматируется без начального нуля. Если описатель формата "z" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: DateTime değerlerinde, "z" özel biçim belirticisi, yerel işletim sisteminin saat diliminin Eşgüdümlü Evrensel Saat'ten (UTC) saat cinsinden ölçülen işaretli uzaklığını temsil eder. Herhangi bir örneğin DateTime.Kind özelliğinin değerini yansıtmaz. Bu nedenle "z" biçim belirticisinin DateTime değerleriyle kullanılması önerilmez. DateTimeOffset değerlerinde, bu biçim belirticisi, DateTimeOffset değerinin saat cinsinden UTC'den uzaklığını temsil eder. Uzaklık her zaman başında bir işaretle görüntülenir. Artı işareti (+) UTC'den önceki, eksi işareti (-) ise UTC'den sonraki saatleri gösterir. Tek haneli bir uzaklık, başına sıfır eklenmeden biçimlendirilir. "z" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: 对于 DateTime 值，"z" 自定义格式说明符表示本地操作系统的时区与协调世界时(UTC)的有符号偏移量(以小时为单位)。它不反映实例的 DateTime.Kind 属性的值。因此，不建议将 "z" 格式说明符用于 DateTime 值。 对于 DateTimeOffset 值，此格式说明符表示 DateTimeOffset 值与 UTC 的偏移量(以小时为单位)。 偏移量始终显示为带有前导符号。加号(+)表示小时数早于 UTC，减号(-)表示小时数迟于 UTC。一位数字的偏移量设置为不带前导零的格式。 如果使用 "z" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: 使用 DateTime 值時，"z" 自訂格式規範代表區域作業系統時區與國際標準時間 (UTC) 的帶正負號時差 (以小時為單位)，且不會反映出執行個體的 DateTime.Kind 屬性值。因此，建議不要搭配 DateTime 值使用 "z" 格式規範。 對 DateTimeOffset 值而言，這個格式規範代表 DateTimeOffset 值的 UTC 時差 (以小時為單位)。 時差的開頭永遠會顯示正負號。正號 (+) 表示早於 UTC 的小時數，負號 (-) 則表示晚於 UTC 的小時數。個位數的時差開頭不會填補零。 如果使用 "z" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為標準日期和時間格式規範，並擲回 FormatException。

source: utc hour offset (2 digits)
cs: posun hodin proti UTC (2 číslice)
de: UTC-Abweichung in Stunden (2 Stellen)
es: desfase respecto a la hora UTC (2 dígitos)
fr: décalage des heures UTC (2 chiffres)
it: Differenza dall'ora UTC in ore (2 cifre)
ja: UTC 時間のオフセット (2 桁)
ko: UTC 시간 오프셋(2자리)
pl: przesunięcie godziny UTC (2 cyfry)
pt_br: diferença horária UTC (2 dígitos)
ru: смещение от UTC в часах (2 цифры)
tr: UTC saat uzaklığı (2 rakam)
zh_hans: utc 小时偏移量(2 位数)
zh_hant: utc 小時時差 (2 位數)
