Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Regex_group_options_long
source: This grouping construct applies or disables the specified options within a subexpression. The options to enable are specified after the question mark, and the options to disable after the minus sign. The allowed options are: i Use case-insensitive matching. m Use multiline mode, where ^ and $ match the beginning and end of each line (instead of the beginning and end of the input string). s Use single-line mode, where the period (.) matches every character (instead of every character except \n). n Do not capture unnamed groups. The only valid captures are explicitly named or numbered groups of the form (?<name> subexpression). x Exclude unescaped white space from the pattern, and enable comments after a number sign (#).
cs: Tento seskupovací konstruktor povoluje nebo zakazuje možnosti zadané v rámci výrazu subexpression. Možnosti, které se povolují, se zadávají za otazník a možnosti, které se zakazují, za symbol minus. Povolené možnosti: i Použije se porovnávání bez rozlišování malých a velkých písmen. m Použije se víceřádkový režim, kde ^ a $ odpovídají začátku a konci každého řádku (místo začátku a konce vstupního řetězce). s Použije se jednořádkový režim, kde tečka (.) odpovídá každému znaku (místo každému znaku kromě \n). n Nezachytává nepojmenované skupiny. Jediná platná zachycení představují explicitně pojmenované nebo číslované skupiny formuláře (? <name> subexpression). x Vyloučí ze vzoru prázdné znaky, které nejsou řídicími znaky, a povolí komentáře za symbolem čísla (#).
de: Dieses Gruppierungskonstrukt wendet die angegebenen Optionen innerhalb eines Unterausdrucks an oder deaktiviert sie. Die zu aktivierenden Optionen werden nach dem Fragezeichen und die zu deaktivierenden Optionen nach dem Minuszeichen angegeben. Zulässige Optionen: i Führt den Abgleich ohne Unterscheidung nach Groß-/Kleinschreibung durch. m Verwendet den mehrzeiligen Modus, wobei "^" und "$" mit Anfang und Ende jeder einzelnen Zeile übereinstimmen (anstelle von Anfang und Ende der Eingabezeichenfolge). s Verwendet den einzeiligen Modus, wobei der Punkt (.) mit jedem Zeichen übereinstimmt (anstelle von jedem Zeichen außer "\n"). n Erfasst keine unbenannten Gruppen. Die einzigen gültigen Erfassungen sind explizit benannte oder nummerierte Gruppen im Format (?<name> Teilausdruck). x Schließt Leerraum ohne Escapezeichen aus dem Muster aus und aktiviert Kommentare nach einem Nummernzeichen (#).
es: Esta construcción de agrupación aplica o deshabilita las opciones especificadas dentro de una subexpresión. Las opciones de habilitación se especifican después del signo de interrogación y las opciones de deshabilitación después del signo menos. Las opciones permitidas son:\: i Usar la coincidencia sin distinción de mayúsculas y minúsculas. m Usar el modo de varias líneas, donde ^ y $ coinciden con el principio y el final de cada línea (en lugar del principio y del final de la cadena de entrada). s Usar el modo de una sola línea, donde el punto (.) coincide con todos los caracteres (en lugar de todos los caracteres excepto \n). n No capturar grupos sin nombre. Las únicas capturas válidas son explícitamente grupos con nombre o numerados con el formato (? <name> subexpresión). x Excluir el espacio en blanco sin escape del patrón y habilitar los comentarios después de un signo de número (#).
fr: Cette construction de regroupement applique ou désactive les options spécifiées dans une sous-expression. Les options à activer sont spécifiées après le point d'interrogation, et les options à désactiver après le signe moins. Les options autorisées sont les suivantes : i Utilise la correspondance sans respect de la casse. m Utilise le mode multiligne, où ^ et $ correspondent au début et à la fin de chaque ligne (au lieu du début et de la fin de la chaîne d'entrée). s Utilise le mode monoligne, où le point (.) correspond à chaque caractère (au lieu de chaque caractère sauf \n). n Ne capture pas les groupes sans nom. Les seules captures valides sont des groupes explicitement nommés ou numérotés ayant la forme (?<nom> sous-expression). x Exclut les espaces blancs sans séquence d'échappement du modèle, et active les commentaires après un signe dièse (#).
it: Questo costrutto di raggruppamento applica o disabilita le opzioni specificate all'interno di una sottoespressione. Le opzioni da abilitare vengono specificate dopo il punto interrogativo, mentre quelle da disabilitare vengono specificate dopo il segno meno. Le opzioni consentite sono: i Usa la corrispondenza che non fa distinzione tra maiuscole e minuscole. m Usa la modalità multiriga, in cui ^ e $ corrispondono all'inizio e alla fine di ogni riga anziché all'inizio e alla fine della stringa di input. s Usa la modalità a riga singola, in cui il punto (.) corrisponde a qualsiasi carattere anziché a ogni carattere eccetto \n. n Non acquisisce gruppi senza nome. Le uniche acquisizioni valide sono i gruppi denominati o numerati in modo esplicito in formato (?<nome> sottoespressione). x Esclude gli spazi vuoti senza caratteri di escape nel criterio e abilita i commenti dopo un simbolo di cancelletto (#).
ja: このグループ化構成体は、部分式内の指定されたオプションを適用するか無効にします。有効にするオプションは疑問符の後に指定し、無効にするオプションはマイナス記号の後に指定します。許可されているオプションは次のとおりです。 i 大文字と小文字を区別しない一致を使用します。 m ^ と $ は、(入力文字列の先頭および末尾ではなく) 各行の先頭および末尾と一致します。 s 単一行モードを使用します。このモードでは、ピリオド (.) は任意の 1 文字と一致します (\n を除くすべての文字の代用)。 n 名前のないグループをキャプチャしません。(?<name> subexpression) という形式で、 明示的に名前または番号が付加されたグループのみを有効なキャプチャ対象とします。 x エスケープされていない空白をパターンから除外し、 番号記号 (#) の後ろのコメントを有効にします。
ko: 이 그룹화 생성자는 하위 식 내에서 지정된 옵션을 적용하거나 사용하지 않도록 설정합니다. 사용하도록 설정하는 옵션은 물음표 뒤에 지정되며 사용하지 않도록 설정하는 옵션은 빼기 기호 뒤에 지정됩니다. 허용되는 옵션은 다음과 같습니다. i 대/소문자를 구분하지 않는 일치를 사용합니다. m 여러 줄 모드를 사용합니다. 여기서, ^ 및 $는 각 줄의 시작 및 끝과 일치시킵니다(입력 문자열의 시작 및 끝이 아님). s 한 줄 모드를 사용합니다. 여기서, 마침표(.)는 모든 문자(\n을 제외한 모든 문자가 아님)와 일치시킵니다. n 명명되지 않은 그룹을 캡처하지 않습니다. 양식(?<이름> 하위 식)의 명시적으로 명명된 그룹 또는 번호가 매겨진 그룹만 유효한 캡처입니다. x 이스케이프되지 않은 공백은 패턴에서 제외하고 주석은 숫자 기호(#) 다음에 사용합니다.
pl: Ta konstrukcja grupująca stosuje określone opcje dla podwyrażenia lub wyłącza je. Opcje do włączenia określa się po znaku zapytania, a opcje do wyłączenia po znaku minus. Dozwolone opcje: i Użyj dopasowywania bez uwzględniania wielkości liter. m Użyj trybu wielowierszowego, gdzie znaki ^ i $ pasują na początku i na końcu każdego wiersza (zamiast na początku i na końcu ciągu wejściowego). s Użyj trybu jednowierszowego, gdzie kropka (.) pasuje do każdego znaku (zamiast do każdego znaku z wyjątkiem znaku \n). n Nie przechwytuj grup nienazwanych. Przechwytywane są tylko jawnie nazwane lub numerowane grupy w postaci (?<nazwa> podwyrażenie). x Wyklucz z wzorca białe znaki bez zmiany znaczenia i włącz komentarze po znaku numeru (#).
pt_br: Este constructo de agrupamento aplica ou desabilita as opções especificadas dentro de uma subexpressão. As opções a serem habilitadas são especificadas após o ponto de interrogação e as opções a serem desabilitadas, após o sinal de menos. As opções permitidas são: i Usar a correspondência que não diferencia maiúsculas de minúsculas. m Usar o modo multilinha, em que ^ e $ correspondem ao início e ao fim de cada linha (em vez de ao início e ao fim da cadeia de caracteres de entrada). s Usar o modo de linha única, no qual o ponto (.) corresponde a cada caractere (em vez de a cada caractere exceto \n). n Não capturar os grupos sem nome. As únicas capturas válidas são os grupos nomeados ou numerados no formato (?<name> subexpressão). x Excluir o espaço em branco sem escape do padrão e habilitar os comentários após um sinal de número (#).
ru: Эта конструкция группировки включает или отключает указанные параметры в части выражения. Включаемые параметры указаны после вопросительного знака, а отключаемые параметры — после знака минус. Допустимые параметры: i Использовать сопоставление без учета регистра. m Использовать многострочный режим, где ^ и $ соответствуют началу и концу каждой строки (а не началу и концу входной строки). s Использовать однострочный режим, где точка (.) соответствует каждому символу (а не каждому символу, кроме \n). n Не записывать неименованные группы. Для записи подходят только явно именованные или нумерованные группы формы (?<name> часть выражения). x Исключить неэкранированный пробел из шаблона и включить комментарии после символа решетки (#).
tr: Bu gruplandırma yapısı, bir alt ifade içinde belirtilen seçenekleri uygular veya devre dışı bırakır. Etkinleştirilecek seçenekler soru işaretinden sonra ve devre dışı bırakılacak seçenekler eksi işaretinden sonra belirtilir. İzin verilen seçenekler şunlardır: i Büyük/küçük harfe duyarsız eşleşme kullan. m ^ ve $ işaretlerinin her satırın başı ve sonuyla eşleştiği çok satırlı modu kullan (giriş dizesinin başı ve sonu yerine). s Noktanın (.) her karakter ile eşleştiği tek satırlı modu kullan (\n dışında her karakter yerine). n Adsız grupları yakalama. Yalnızca şu yakalamalar geçerlidir: formun açıkça adlandırılmış veya numaralandırılmış grupları (?<ad> alt ifadesi). x Kaçışsız boşluğu desenden çıkar ve bir sayı işaretinden (#) sonra açıklamaları etkinleştir.
zh_hans: 此分组构造应用或禁用子表达式中的指定选项。在问号后指定要启用的选项，在减号后禁用的选项。允许的选项有: i 使用不区分大小写的匹配。 m 使用多行模式，其中 ^ 和 $ 分别匹配每行的开头和结尾 (而不是输入字符串的开头和结尾)。 s 使用单行模式，其中句点(.)与每个字符 (而不是除 \n 之外的每个字符)匹配。 n 请勿捕获未命名的组。唯一有效的捕获已被显式 命名为或编码为(?<name> subexpression)形式的组。 x 请删除模式中的非转义空格，并 在数字符号(#)之后使用注释。
zh_hant: 這個分組建構會在子運算式內套用或停用指定的選項。要啟用的選項會在問號後指定，要停用的選項則在減號後。允許的選項為: i 使用不區分大小寫的比對。 m 使用多行模式，其中 ^ 和 $ 會比對各行的結尾 (而非輸入字串的開頭和結尾)。 s 使用單行模式，其中句點 (.) 會比對每個字元 (而不是 \n 除外的每個字元)。 n 請勿擷取未命名的群組。唯一有效的擷取為明確 命名或編號的格式群組 (?<name> 子運算式)。 x 從模式中排除未逸出的空白字元，並在 數字記號 (#) 後啟用註解。

# Regex_group_options_short
source: group options
cs: seskupovací možnosti
de: Gruppenoptionen
es: opciones de grupo
fr: options de groupe
it: opzioni di raggruppamento
ja: グループ オプション
ko: 그룹 옵션
pl: opcje grupy
pt_br: opções de grupo
ru: параметры группы
tr: grup seçenekleri
zh_hans: 组选项
zh_hant: 群組選項

# Regex_hexadecimal_escape_long
source: Matches an ASCII character, where ## is a two-digit hexadecimal character code.
cs: Shoda se znakem ASCII, kde ## je dvouciferný šestnáctkový kód znaku
de: Entspricht einem ASCII-Zeichen, wobei ## ein zweistelliger hexadezimaler Zeichencode ist.
es: Coincide con un carácter ASCII, donde ## es un código de carácter hexadecimal de dos dígitos.
fr: Correspond à un caractère ASCII, où ## est un code de caractère hexadécimal à deux chiffres.
it: Trova la corrispondenza di un carattere ASCII dove nn è un codice carattere esadecimale a due cifre.
ja: ASCII 文字に一致します。## は、2 桁の 16 進数の文字コードです。
ko: ASCII 문자와 일치시킵니다. 여기서, ##은 두 자리 16진수 문자 코드입니다.
pl: Pasuje do znaku ASCII, gdzie ## to kod znaku w postaci dwóch cyfr szesnastkowych.
pt_br: Corresponde a um caractere ASCII, em que ## é um código de caractere hexadecimal de dois dígitos.
ru: Соответствует символу ASCII, где ## — это двузначный шестнадцатеричный код символа.
tr: ## karakterinin iki basamaklı onaltılık karakter kodu olduğu bir ASCII karakteriyle eşleşir.
zh_hans: 与 ASCII 字符匹配，其中 ## 是两位数的十六进制字符代码。
zh_hant: 比對 ASCII 字元，其中 ## 是兩位數的十六進位字元碼。

# Regex_hexadecimal_escape_short
source: hexadecimal escape
cs: šestnáctkový únikový znak
de: Hexadezimale Escapezeichen
es: escape hexadecimal
fr: échappement hexadécimal
it: carattere di escape esadecimale
ja: 16 進数のエスケープ
ko: 16진수 이스케이프
pl: szesnastkowy znak kontrolny
pt_br: escape hexadecimal
ru: шестнадцатеричный escape-символ
tr: onaltılık kaçış
zh_hans: 十六进制转义符
zh_hant: 十六進位逸出

# Regex_inline_comment_long
source: The (?# comment) construct lets you include an inline comment in a regular expression. The regular expression engine does not use any part of the comment in pattern matching, although the comment is included in the string that is returned by the Regex.ToString method. The comment ends at the first closing parenthesis.
cs: Konstruktor (?# komentář) umožňuje zahrnout vložený komentář do regulárního výrazu. Modul regulárních výrazů nepoužije při porovnávání vzorů žádnou část komentáře, i když je komentář obsažený v řetězci, který vrací metoda Regex.ToString. Komentář končí první uzavírací závorkou.
de: Mit dem Konstrukt (?# Kommentar) können Sie einen Inlinekommentar in einen regulären Ausdruck einbeziehen. Die Engine für reguläre Ausdrücke verwendet keinen Teil des Kommentars beim Musterabgleich, auch wenn der Kommentar in der Zeichenfolge enthalten ist, die von der Regex.ToString-Methode zurückgegeben wird. Der Kommentar endet bei der ersten schließenden Klammer.
es: La construcción (comentario ?#) permite incluir un comentario alineado en una expresión regular. El motor de expresiones regulares no usa ninguna parte del comentario en la coincidencia de patrones, aunque el comentario está incluido en la cadena devuelta por el método Regex.ToString. El comentario termina en el primer paréntesis de cierre.
fr: La construction (?# commentaire) vous permet d'inclure un commentaire dans une expression régulière. Le moteur d'expressions régulières n'utilise aucune partie du commentaire dans les critères spéciaux, bien que le commentaire soit inclus dans la chaîne retournée par la méthode Regex.ToString. Le commentaire finit à la première parenthèse fermante.
it: Il costrutto (?# comment) consente di includere un commento inline in un'espressione regolare. Il motore delle espressioni regolari non usa una parte del commento nei criteri di ricerca, anche se il commento è incluso nella stringa restituita dal metodo Regex.ToString. Il commento termina in corrispondenza della prima parentesi chiusa.
ja: (?# comment) コンストラクトを使用すると、正規表現にインライン コメントを含めることができます。Regex.ToString メソッドによって返される文字列にコメントが含まれますが、正規表現エンジンはパターン マッチングでコメントのどの部分も使用しません。コメントは、最初の終わりかっこで終了します。
ko: (?# comment) 구문에서는 정규식에 인라인 주석을 포함할 수 있습니다. Regex.ToString 메서드에서 반환된 문자열에 주석이 포함되어 있어도 정규식 엔진은 패턴 일치에 주석의 어떤 부분도 사용하지 않습니다. 주석은 첫 번째 닫는 괄호에서 종료됩니다.
pl: Konstrukcja (?# komentarz) umożliwia dołączenie komentarza w tekście do wyrażenia regularnego. Aparat wyrażeń regularnych nie używa żadnej części komentarza podczas dopasowywania wzorca, mimo że komentarz jest dołączony do ciągu zwracanego przez metodę Regex.ToString. Komentarz kończy się pierwszym nawiasem zamykającym.
pt_br: O constructo (?# comentário) permite incluir um comentário embutido em uma expressão regular. O mecanismo de expressão regular não usa nenhuma parte do comentário na correspondência de padrões, embora o comentário seja incluído na cadeia de caracteres retornada pelo método Regex.ToString. O comentário termina no primeiro parêntese de fechamento.
ru: Конструкция (?# comment) позволяет включить встроенный комментарий в регулярное выражение. Обработчик регулярных выражений не использует никакие части этого комментария при сравнении шаблонов, однако комментарий включается в строку, возвращаемую методом Regex.ToString. Комментарий заканчивается на первой закрывающей скобке.
tr: (?# comment) yapısı, bir normal ifadeye satır içi açıklama eklemenizi sağlar. Açıklama Regex.ToString yöntemi tarafından döndürülen dizeye dahil edilmiş olsa da, normal ifade altyapısı açıklamanın herhangi bir bölümünü desen eşleşmesinde kullanmaz. Açıklama ilk kapatma parantezinde sonlanır.
zh_hans: (?# comment)构造允许在正则表达式中包括内联注释。尽管注释包含在 Regex 方法返回的字符串中，但正则表达式引擎不使用模式匹配中注释的任何部分。注释以第一个右括号结束。
zh_hant: (?# comment) 建構可讓您在規則運算式中包含內嵌註解。雖然註解包含在 Regex.ToString 方法所傳回的字串中，但規則運算式引擎不會在模式比對中使用註解的任一部分。註解會在第一個右括弧處結束。

# Regex_inline_comment_short
source: inline comment
cs: vložený komentář
de: Inlinekommentar
es: comentario insertado
fr: commentaire inclus
it: commento inline
ja: インライン コメント
ko: 인라인 주석
pl: komentarz wewnętrzny
pt_br: comentário embutido
ru: встроенный комментарий
tr: satır içi açıklama
zh_hans: 内联注释
zh_hant: 內嵌註解
