Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# time_zone_description
source: The "K" custom format specifier represents the time zone information of a date and time value. When this format specifier is used with DateTime values, the result string is defined by the value of the DateTime.Kind property: For the local time zone (a DateTime.Kind property value of DateTimeKind.Local), this specifier is equivalent to the "zzz" specifier and produces a result string containing the local offset from Coordinated Universal Time (UTC); for example, "-07:00". For a UTC time (a DateTime.Kind property value of DateTimeKind.Utc), the result string includes a "Z" character to represent a UTC date. For a time from an unspecified time zone (a time whose DateTime.Kind property equals DateTimeKind.Unspecified), the result is equivalent to String.Empty. For DateTimeOffset values, the "K" format specifier is equivalent to the "zzz" format specifier, and produces a result string containing the DateTimeOffset value's offset from UTC. If the "K" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: Specifikátor vlastního formátu K představuje informaci o časovém pásmu hodnoty data a času. Když se tento specifikátor formátu použije spolu s hodnotami DateTime, výsledný řetězec je definovaný hodnotou vlastnosti DateTime.Kind: Pro místní časové pásmo (hodnota vlastnosti DateTime.Kind DateTimeKind.Local) je tento specifikátor ekvivalentní specifikátoru zzz a vytvoří výsledný řetězec, který bude obsahovat místní posun od koordinovaného univerzálního času (UTC), třeba -07:00. Pro čas UTC (hodnota vlastnosti DateTime.Kind DateTimeKind.Utc) výsledný řetězec zahrnuje znak Z, který představuje datum UTC. Pro čas z neurčeného časového pásma (čas, jehož vlastnost DateTime.Kind se rovná DateTimeKind.Unspecified) je výsledek ekvivalentní k String.Empty. Pro hodnoty DateTimeOffset je specifikátor formátu K ekvivalentní specifikátoru formátu zzz a vytváří výsledný řetězec, který obsahuje posun hodnoty DateTimeOffset proti UTC. Pokud se specifikátor formátu K použije bez dalších specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času a vyvolá FormatException.
de: Der benutzerdefinierte Formatbezeichner "K" repräsentiert die Zeitzoneninformation eines Datums- und Uhrzeitwerts. Bei Verwendung dieses Formatbezeichners mit DateTime-Werten wird die Ergebniszeichenfolge durch den Wert der DateTime.Kind-Eigenschaft definiert: Für die lokale Zeitzone (ein DateTime.Kind-Eigenschaftswert von DateTimeKind.Local) entspricht dieser Bezeichner dem Bezeichner "zzz" und erzeugt eine Ergebniszeichenfolge, die die lokale Abweichung von der koordinierten Weltzeit (UTC) enthält, z. B. "-07:00". Für eine UTC-Zeit (ein DateTime.Kind-Eigenschaftswert von DateTimeKind.Utc) enthält die Ergebniszeichenfolge ein Zeichen "Z" zur Darstellung eines UTC-Datums. Für einen Zeitwert einer nicht angegebenen Zeitzone (ein Zeitwert, dessen DateTime.Kind-Eigenschaft "DateTimeKind.Unspecified" lautet) ist das Ergebnis äquivalent zu "String.Empty". Für DateTimeOffset-Werte ist der Formatbezeichner "K" äquivalent zum Formatbezeichner "zzz" und erzeugt eine Ergebniszeichenfolge, die das Offset des DateTimeOffset-Werts von UTC enthält. Bei Verwendung des Formatbezeichners "K" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner für Datums- und Uhrzeitwerte interpretiert und löst eine FormatException aus.
es: El especificador de formato personalizado "K" representa la información de zona horaria de un valor de fecha y hora. Cuando se usa este especificador de formato con valores DateTime, la cadena de resultado se define por el valor de la propiedad DateTime.Kind: En el caso de la zona horaria local (valor de la propiedad DateTime.Kind de DateTimeKind.Local), este especificador es equivalente al especificador "zzz" y genera una cadena de resultado que contiene el desplazamiento local de la hora universal coordinada (UTC); por ejemplo, "-07:00". Para una hora UTC (un valor de propiedad DateTime. Kind de DateTimeKind. UTC), la cadena de resultado incluye un carácter "Z" para representar una fecha UTC. Para una hora de una zona horaria no especificada (una hora cuya propiedad DateTime. Kind igual a DateTimeKind. no especificada), el resultado es equivalente a String. Empty. Para los valores de DateTimeOffset, el especificador de formato "K" es equivalente al especificador de formato "Zzz" y genera una cadena de resultado que contiene el desplazamiento del valor DateTimeOffset con respecto a la hora UTC. Si el especificador de formato "K" se usa sin otros especificadores de formato personalizado, se interpreta como un especificador de formato de fecha y hora estándar y produce una FormatException.
fr: Le spécificateur de format personnalisé "K" représente les informations de fuseau horaire d'une valeur de date et d'heure. Quand ce spécificateur de format est utilisé avec des valeurs DateTime, la chaîne résultante est définie par la valeur de la propriété DateTime.Kind : Pour le fuseau horaire local (valeur de propriété DateTime.Kind de DateTimeKind.Local), ce spécificateur est équivalent au spécificateur "zzz". Il produit une chaîne contenant le décalage local par rapport à l'heure UTC, par exemple "-07:00". Pour une heure UTC (valeur de propriété DateTime.Kind de DateTimeKind.Utc), la chaîne résultante inclut un caractère "Z" qui représente une date UTC. Pour une heure provenant d'un fuseau horaire non spécifié (heure dont la propriété DateTime.Kind est égale à DateTimeKind.Unspecified), le résultat est équivalent à String.Empty. Pour les valeurs DateTimeOffset, le spécificateur de format "K" est équivalent au spécificateur de format "zzz". Il produit une chaîne qui contient le décalage de la valeur DateTimeOffset par rapport à l'heure UTC. Si le spécificateur de format "K" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: L'identificatore di formato personalizzato "K" rappresenta le informazioni sul fuso orario di un valore di data e ora. Quando questo identificatore di formato viene usato con valori DateTime, la stringa di risultato viene definita dal valore della proprietà DateTime.Kind: Per il fuso orario locale (un valore della proprietà DateTime.Kind uguale a DateTimeKind.Local) questo identificatore è equivalente all'identificatore "zzz" e genera una stringa di risultato che contiene la differenza locale dall'ora UTC (Coordinated Universal Time), ad esempio "-07.00". Per un'ora UTC (un valore della proprietà DateTime.Kind uguale a DateTimeKind.Utc) la stringa di risultato include un carattere "Z" per rappresentare una data UTC. Per un'ora di un fuso orario non specificato (un'ora la cui proprietà DateTime.Kind è uguale a DateTimeKind.Unspecified) il risultato è equivalente a String.Empty. Per i valori DateTimeOffset, l'identificatore di formato "K" è equivalente all'identificatore di formato "zzz" e genera una stringa di risultato che contiene la diffenza dall'ora UTC del valore DateTimeOffset. Se l'identificatore di formato "K" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: "K" カスタム書式指定子は、日付と時刻の値のタイム ゾーン情報を表します。この書式指定子が DateTime 値で使用されている場合、書式設定後の文字列は DateTime.Kind プロパティの値によって定義されます。 ローカル タイム ゾーンの場合 (DateTime.Kind プロパティ値が DateTimeKind.Local)、この指定子は "zzz" 指定子と同じで、書式設定後の文字列には世界協定時刻 (UTC) からのローカル オフセット ("-07:00" など) が含まれます。 UTC 時刻の場合 (DateTime.Kind プロパティ値が DateTimeKind.Utc)、書式設定後の文字列には UTC 日付を表す "Z" 文字が含まれます。 タイム ゾーンが指定されていない時刻の場合 (時間の DateTime.Kind プロパティが DateTimeKind.Unspecified)、結果は String.Empty と同じになります。 "K" 書式指定子を DateTimeOffset 値で使用した場合、この指定子は "zzz" 書式指定子と同じになり、書式設定後の文字列には、DateTimeOffset 値の UTC を基準としたオフセットが含まれます。 他のカスタム書式指定子が使用されていない場合、"K" は標準の日時書式指定子として解釈され、FormatException をスローします。
ko: "K" 사용자 지정 형식 지정자는 날짜 및 시간 값의 표준 시간대 정보를 나타냅니다. 이 형식 지정자를 DateTime 값과 함께 사용하면 결과 문자열은 DateTime.Kind 속성의 값으로 정의됩니다. 현지 표준 시간대(DateTimeKind.Local의 DateTime.Kind 속성 값)의 경우, 이 지정자는 "zzz" 지정자와 동일하며 UTC(협정 세계시)에서 가져온 로컬 오프셋을 포함하는 결과 문자열을 생성합니다. 예를 들면 "-07:00"과 같습니다. UTC 시간(DateTimeKind.Utc의 DateTime.Kind 속성 값)의 경우, 결과 문자열은 UTC 날짜를 나타내는 "Z" 문자를 포함합니다. 지정되지 않은 표준 시간대의 시간(DateTime.Kind 속성 값이 DateTimeKind.Unspecified와 같은 시간)의 경우, 결과는 String.Empty와 동일합니다. DateTimeOffset 값의 경우, "K" 형식 지정자는 "zzz" 형식 지정자와 동일하며 UTC에서 가져온 DateTimeOffset 값의 오프셋을 포함하는 결과 문자열을 생성합니다. 다른 사용자 지정 형식 지정자 없이 "K" 형식 지정자를 사용하면 표준 날짜 및 시간 형식 지정자로 해석되어 FormatException을 throw합니다.
pl: Niestandardowy specyfikator formatu „K” reprezentuje informacje o strefie czasowej dla wartości daty i godziny. Jeśli ten specyfikator formatu jest używany dla wartości DateTime, ciąg wyniku jest definiowany przez wartość właściwości DateTime.Kind: W przypadku lokalnej strefy czasowej (właściwość DateTime.Kind o wartości DateTimeKind.Local) ten specyfikator jest równoważny specyfikatorowi „zzz” i tworzy ciąg wyniku zawierający przesunięcie lokalne względem uniwersalnego czasu koordynowanego (UTC), na przykład „-07:00”. W przypadku czasu UTC (właściwość DateTime.Kind o wartości DateTimeKind.Utc) ciąg wyniku zawiera znak „Z” reprezentujący datę UTC. W przypadku godziny z nieokreślonej strefy czasowej (właściwość DateTime.Kind o wartości DateTimeKind.Unspecified) wynik jest równoważny wartości String.Empty. W przypadku wartości typu DateTimeOffset specyfikator formatu „K” jest równoważny specyfikatorowi formatu „zzz”" i tworzy ciąg wyniku zawierający przesunięcie wartości DateTimeOffset względem czasu UTC. Jeśli specyfikator formatu „K” jest używany bez innych niestandardowych specyfikatorów formatu, jest on interpretowany jako standardowy specyfikator formatu daty i godziny i powoduje zgłoszenie wyjątku FormatException.
pt_br: O especificador de formato personalizado "K" representa as informações de fuso horário de um valor de data e hora. Quando esse especificador de formato é usado com valores DateTime, a cadeia de caracteres de resultado é definida pelo valor da propriedade DateTime.Kind: Para o fuso horário local (um valor da propriedade DateTime.Kind de DateTimeKind.Local), este especificador é equivalente ao especificador "zzz" e produz uma cadeia de caracteres de resultado contendo o deslocamento local do UTC (Tempo Universal Coordenado); por exemplo, "-07:00". Para uma hora UTC (um valor de propriedade DateTime.Kind de DateTimeKind.Utc), a cadeia de caracteres de resultado inclui um caractere "Z" para representar uma data UTC. Para um horário de um fuso horário não especificado (uma hora cuja propriedade DateTime.Kind seja igual a DateTimeKind.Unspecified), o resultado é equivalente a String.Empty. Para os valores de DateTimeOffset, o especificador de formato "K" é equivalente ao especificador de formato "zzz" e produz uma cadeia de caracteres de resultado contendo o deslocamento do valor de DateTimeOffset do UTC. Se o especificador de formato "K" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: Описатель пользовательского формата "K" представляет сведения о часовом поясе для значения даты и времени. Если этот описатель формата используется со значениями DateTime, результирующая строка определяется значением свойства DateTime.Kind: Для локального часового пояса (значение DateTimeKind.Local свойства DateTime.Kind) этот описатель равнозначен описателю "zzz" и дает результирующую строку, содержащую локальное смещение от UTC, например, "-07:00". Для времени в формате UTC (значение DateTimeKind.Utc свойства DateTime.Kind) результирующая строка включает символ "Z" для обозначения даты в формате UTC. Для времени из неуказанного часового пояса (значение DateTimeKind.Unspecified свойства DateTime.Kind) результат эквивалентен String.Empty. Для значений DateTimeOffset описатель формата "K" равнозначен описателю формата "zzz" и дает результирующую строку, содержащую смещение значения DateTimeOffset от UTC. Если описатель формата "K" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: "K" özel biçim belirticisi tarih ve saat değerinin saat dilimi bilgisini temsil eder. Bu biçim belirticisi DateTime değerleriyle kullanıldığında, sonuç dizesi DateTime.Kind özelliğinin değeriyle tanımlanır: Yerel saat dilimi (DateTimeKind.Local olan bir DateTime.Kind özellik değeri) için bu belirtici "zzz" belirticisi ile eşdeğerdir ve Eşgüdümlü Evrensel Saat'e (UTC) göre yerel uzaklığı içeren bir sonuç dizesi üretir; örneğin, "-07:00". Bir UTC saati (DateTimeKind.Utc'nin DateTime.Kind özellik değeri) için sonuç dizesi, UTC tarihinin temsil edilebilmesi için bir "Z" karakteri içerir. Belirtilmemiş bir saat diliminden (DateTime.Kind özelliği DateTimeKind.Unspecified değerine eşit olan) bir saat için sonuç String.Empty ile eşdeğerdir. DateTimeOffset değerleri için "K" biçim belirticisi "zzz" biçim belirticisine eşdeğerdir ve DateTimeOffset değerinin UTC'den uzaklığını içeren bir sonuç dizesi üretir. "K" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: "K" 自定义格式说明符表示日期和时间值的时区信息。将此格式说明符与 DateTime 值一起使用时，结果字符串由 DateTime.Kind 属性的值定义: 对于本地时区(DateTimeKind.Local 的 DateTime.Kind 属性值)，此说明符等效于 "zzz" 说明符，并生成包含协调世界时(UTC)的本地偏移量的结果字符串；例如 "-07:00"。 对于 UTC 时间(DateTimeKind.Utc 的 DateTime.Kind 属性值)，结果字符串包含表示 UTC 日期的 "Z" 字符。 对于未指定时区的时间(其 DateTime.Kind 属性等于 DateTimeKind.Unspecified 的时间)，其结果等效于 String.Empty。 对于 DateTimeOffset 值，"K" 格式说明符等效于 "zzz" 格式说明符，并生成一个包含来自 UTC 的 DateTimeOffset 值偏移量的结果字符串。 如果使用 "K" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: "K" 自訂格式規範代表日期和時間值的時區資訊。當此格式規範與 DateTime 值一起使用時，結果字串會由 DateTime.Kind 屬性的值定義: 對於區域時區 (DateTimeKind.Local 的 DateTime.Kind 屬性值)，此規範相當於 "zzz" 規範，並會產生結果字串，其包含區域時間與國際標準時間 (UTC) 的時差; 例如 "-07:00"。 對於 UTC 時間 (DateTimeKind.Utc 的 DateTime.Kind 屬性值)，結果字串會包含表示 UTC 日期的 "Z" 字元。 對於未指定時區的時間 (DateTime.Kind 屬性等於 DateTimeKind.Unspecified 的時間)，結果會等於 String.Empty。 對於 DateTimeOffset 值，"K" 格式規範相當於 "zzz" 格式規範，並會產生結果字串，其包含 DateTimeOffset 值的 UTC 時差。 如果使用 "K" 格式規範，而且沒有其他自訂格式規範，則會將其解譯為標準日期和時間格式規範，並擲回 FormatException。

source: type
cs: typ
de: Typ
es: tipo
it: tipo
ja: 型
ko: 유형
pl: typ
pt_br: tipo
ru: тип
tr: tür
zh_hans: 类型

source: type constraint
cs: omezení typu
de: Typeinschränkung
es: restricción de tipo
fr: contrainte de type
it: vincolo di tipo
ja: 型制約
ko: 형식 제약 조건
pl: ograniczenie typu
pt_br: restrição de tipo
ru: ограничение типа
tr: tür kısıtlaması
zh_hans: 类型约束
zh_hant: 類型條件約束

source: type parameter
cs: parametr typu
de: Typparameter
es: parámetro de tipo
fr: paramètre de type
it: parametro di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: parametr typu
pt_br: parâmetro de tipo
ru: параметр типа
tr: tür parametresi
zh_hans: 类型形参
zh_hant: 類型參數

source: attribute
cs: atribut
de: Attribut
es: atributo
fr: attribut
it: attributo
ja: 属性
ko: 특성
pl: atrybut
pt_br: atributo
ru: атрибут
tr: öznitelik
zh_hans: 属性
zh_hant: 屬性

source: Replace '{0}' and '{1}' with property
cs: Nahradit {0} a {1} vlastností
de: "{0}" und "{1}" durch Eigenschaft ersetzen
es: Reemplazar '{0}' y '{1}' por la propiedad
fr: Remplacer '{0}' et '{1}' par une propriété
it: Sostituisci '{0}' e '{1}' con la proprietà
ja: '{0}' および '{1}' をプロパティと置換する
ko: 속성으로 '{0}' 및 '{1}' 바꾸기
pl: Zastąp elementy „{0}” i „{1}” właściwością
pt_br: Substituir "{0}" e "{1}" por propriedades
ru: Заменить "{0}" и "{1}" свойством
tr: '{0}' ve '{1}' öğesini özellikle değiştir
zh_hans: 使用属性替代“{0}”和“{1}”
zh_hant: 以屬性取代 '{0}' 和 '{1}'

source: Replace '{0}' with property
cs: Nahradit {0} vlastností
de: "{0}" durch Eigenschaft ersetzen
es: Reemplazar '{0}' por la propiedad
fr: Remplacer '{0}' par une propriété
it: Sostituisci '{0}' con la proprietà
ja: '{0}' をプロパティを置換する
ko: 속성으로 '{0}' 바꾸기
pl: Zastąp element „{0}” właściwością
pt_br: Substituir "{0}" por uma propriedade
ru: Заменить "{0}" свойством
tr: '{0}' öğesini özellikle değiştir
zh_hans: 使用属性替代“{0}”
zh_hant: 以屬性取代 '{0}'

source: Method referenced implicitly
cs: Implicitně odkazovaná metoda
de: Methode, auf die implizit verwiesen wird
es: Método al que se hace referencia implícita
fr: Méthode référencée implicitement
it: Metodo con riferimenti impliciti
ja: 暗黙的に参照されたメソッド
ko: 메서드가 암시적으로 참조됨
pl: Metoda z odwołaniem utworzonym niejawnie
pt_br: Método referenciado implicitamente
ru: Неявная ссылка на метод
tr: Örtülü olarak başvurulan metot
zh_hans: 隐式引用的方法
zh_hant: 隱含參考的方法

source: Generate type '{0}'
cs: Generovat typ {0}
de: Typ "{0}" generieren
es: Generar tipo '{0}'
fr: Générer le type '{0}'
it: Genera il tipo '{0}'
ja: 型 '{0}' を生成する
ko: '{0}' 형식 생성
pl: Generuj typ „{0}”
pt_br: Gerar tipo '{0}'
ru: Создать тип "{0}"
tr: '{0}' türünü oluştur
zh_hans: 生成类型“{0}”
zh_hant: 產生類型 '{0}'

source: Generate {0} '{1}'
cs: Generovat {0} {1}
de: {0}-Objekt "{1}" generieren
es: Generar {0} '{1}'
fr: Générer {0} '{1}'
it: Genera l'elemento {0} '{1}'
ja: {0} '{1}' を生成する
ko: {0} '{1}' 생성
pl: Generuj element {0} „{1}”
pt_br: Gerar {0} '{1}'
ru: Создать {0} "{1}"
tr: {0} '{1}' oluştur
zh_hans: 生成 {0}“{1}”
zh_hant: 產生 {0} '{1}'

source: Change '{0}' to '{1}'.
cs: Změnit {0} na {1}
de: Ändern Sie "{0}" in "{1}".
es: Cambie '{0}' a '{1}'.
fr: Changer '{0}' en '{1}'.
it: Cambia '{0}' in '{1}'.
ja: '{0}' を '{1}' に変更します。
ko: '{0}'을(를) '{1}'(으)로 변경합니다.
pl: Zmień element „{0}” na „{1}”.
pt_br: Alterar '{0}' para '{1}'.
ru: Измените "{0}" на "{1}".
tr: '{0}' öğesini '{1}' olarak değiştirin.
zh_hans: 将“{0}”更改为“{1}”。
zh_hant: 將 '{0}' 變更為 '{1}'。

source: Non-invoked method cannot be replaced with property.
cs: Nevyvolávaná metoda nejde nahradit vlastností.
de: Eine nicht aufgerufene Methode kann nicht durch eine Eigenschaft ersetzt werden.
es: El método no invocado no se puede reemplazar por la propiedad.
fr: Une méthode non appelée ne peut pas être remplacée par une propriété.
it: Non è possibile sostituire il metodo non richiamato con la proprietà.
ja: 呼び出されていないメソッドはプロパティと置換できません。
ko: 호출되지 않은 메서드는 속성으로 대체될 수 없습니다.
pl: Niewywołanej metody nie można zastąpić właściwością.
pt_br: O método não invocado não pode ser substituído por uma propriedade.
ru: Невызванный метод нельзя заменить свойством.
tr: Çağrılmayan metodun yerine özellik konulamaz.
zh_hans: 无法使用属性替代非被调用方法。
zh_hant: 非叫用的方法無法由屬性取代。

source: Only methods with a single argument, which is not an out variable declaration, can be replaced with a property.
cs: Vlastností jdou nahradit jenom metody s jedním argumentem, který nepředstavuje deklaraci externí proměnné.
de: Nur Methoden mit einem einzelnen Argument, das keine out-Variablendeklaration ist, können durch eine Eigenschaft ersetzt werden.
es: Solo los métodos que tienen un solo argumento, que no es una declaración de variable out, se pueden reemplazar por una propiedad.
fr: Seules les méthodes avec un seul argument, qui n'est pas une déclaration de variable de sortie, peuvent être remplacées par une propriété.
it: È possibile sostituire con una proprietà solo i metodi con un singolo argomento non corrispondente a una dichiarazione di variabile out.
ja: 出力変数の宣言ではない、単一の引数を持つメソッドのみ、プロパティに置き換えることができます。
ko: 출력 변수 선언이 아닌, 단일 인수를 사용하는 메서드만 속성으로 대체될 수 있습니다.
pl: Tylko metody z pojedynczym argumentem, który nie jest deklaracją zmiennej wyjściowej, można zastąpić właściwością.
pt_br: Somente os métodos com um único argumento, que não é uma declaração de variável externa, podem ser substituídos por uma propriedade.
ru: Заменить на свойство можно только методы с одним аргументом, который не является объявлением внешней переменной.
tr: Yalnızca, out değişkeni bildirimi olmayan tek bağımsız değişkenli metotlar bir özellikle değiştirilebilir.
zh_hans: 只有带一个参数，不是化出变量声明的方法可以使用属性进行替换。
zh_hant: 只有具備非 out 變數宣告之單一引數的方法可以由屬性取代。

# An_instance_of_analyzer_0_cannot_be_created_from_1_colon_2
source: An instance of analyzer {0} cannot be created from {1}: {2}.
cs: Instance analyzátoru {0} nejde vytvořit z {1}: {2}.
de: Eine Instanz des Analysetools "{0}" kann nicht aus {1} erstellt werden: {2}.
es: No se puede crear una instancia de analizador {0} desde {1}: {2}.
fr: Impossible de créer une instance de l'analyseur {0} à partir de {1} : {2}.
it: Non è possibile creare un'istanza dell'analizzatore {0} da {1}: {2}.
ja: アナライザー {0} のインスタンスは {1}: {2} から作成できません。
ko: {0} 분석기 인스턴스는 {1}에서 만들 수 없습니다. {2}
pl: Nie można utworzyć wystąpienia analizatora {0} z elementu {1}: {2}.
pt_br: Uma instância do analisador de {0} não pode ser criada de {1} : {2}.
ru: Экземпляр анализатора {0} невозможно создать из {1}: {2}.
tr: {0} çözümleyicisinin bir örneği {1}: {2} öğesinden oluşturulamaz.
zh_hans: 无法从 {1}: {2} 创建分析器实例 {0}。
zh_hant: 無法從 {1}: {2} 建立分析器 {0} 的執行個體。

source: The assembly {0} does not contain any analyzers.
cs: Sestavení {0} neobsahuje žádné analyzátory.
de: Die Assembly "{0}" enthält keine Analysetools.
es: El ensamblado {0} no contiene ningún analizador.
fr: L'assembly {0} ne contient pas d'analyseurs.
it: L'assembly {0} non contiene analizzatori.
ja: アセンブリ {0} にアナライザーは含まれていません。
ko: {0} 어셈블리에는 분석기가 포함되어 있지 않습니다.
pl: Zestaw {0} nie zawiera żadnych analizatorów.
pt_br: O assembly {0} não contém quaisquer analisadores.
ru: Сборка {0} не содержит анализаторов.
tr: {0} derlemesi hiçbir çözümleyici içermiyor.
zh_hans: 程序集 {0} 不包含任何分析器。
zh_hant: 組件 {0} 不包含任何分析器。

# Unable_to_load_Analyzer_assembly_0_colon_1
source: Unable to load Analyzer assembly {0}: {1}
cs: Nejde načíst sestavení analyzátoru {0}: {1}.
de: Fehler beim Laden der Assembly "{0}" des Analysetools: {1}
es: No se puede cargar el ensamblado del analizador {0}: {1}
fr: Impossible de charger l'assembly Analyseur {0} : {1}
it: Non è possibile caricare l'assembly dell'analizzatore {0}: {1}
ja: アナライザーのアセンブリ {0}: {1} を読み込むことができません
ko: {0} 분석기 어셈블리를 로드할 수 없습니다. {1}
pl: Nie można załadować zestawu analizatora {0}: {1}
pt_br: Não é possível carregar o assembly do Analisador {0} : {1}
ru: Не удалось загрузить сборку анализатора {0}: {1}
tr: Çözümleyici derlemesi {0}: {1} yüklenemiyor
zh_hans: 无法加载分析器程序集 {0}: {1}
zh_hant: 無法載入分析器組件 {0}: {1}

source: from {0}
cs: z: {0}
de: aus {0}
es: desde {0}
fr: de {0}
it: da {0}
ja: {0} から
ko: 소스: {0}
pl: z {0}
pt_br: de {0}
ru: из {0}
tr: Şuradan: {0}
zh_hans: 自 {0}
zh_hant: 來自 {0}

source: Find and install latest version
cs: Najít a nainstalovat nejnovější verzi
de: Nach aktueller Version suchen und diese installieren
es: Buscar e instalar la última versión
fr: Rechercher et installer la dernière version
it: Trova e installa l'ultima versione
ja: 最新バージョンの検索とインストール
ko: 최신 버전 찾기 및 설치
pl: Znajdź i zainstaluj najnowszą wersję
pt_br: Localizar e instalar a versão mais recente
ru: Найти и установить последнюю версию
tr: Son sürümü bul ve yükle
zh_hans: 查找并安装最新版本
zh_hant: 尋找並安裝最新版本

source: Use local version '{0}'
cs: Použít místní verzi {0}
de: Lokale Version "{0}" verwenden
es: Usar la versión local '{0}'
fr: Utiliser la version locale '{0}'
it: Usa la versione locale '{0}'
ja: ローカル バージョン '{0}' を使用する
ko: 로컬 버전 '{0}' 사용
pl: Użyj wersji lokalnej „{0}”
pt_br: Usar a versão local '{0}'
ru: Использовать локальную версию "{0}"
tr: Yerel sürüm olan '{0}' sürümünü kullan
zh_hans: 使用本地版本“{0}”
zh_hant: 使用本機版本 '{0}'
