Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Analyzer '{0}' threw an exception of type '{1}' with message '{2}'.
cs: Analyzátor {0} způsobil výjimku typu {1} se zprávou {2}.
de: Die Analyse "{0}" hat eine Ausnahme vom Typ "{1}" mit der Meldung "{2}" ausgelöst.
es: El analizador '{0}' produjo una excepción de tipo '{1}' con el mensaje '{2}'.
fr: L'analyseur '{0}' a levé une exception de type {1} avec le message '{2}'.
it: L'analizzatore '{0}' ha generato un'eccezione di tipo '{1}'. Messaggio: '{2}'.
ja: アナライザー '{0}' が型 '{1}' の例外をメッセージ '{2}' 付きでスローしました。
ko: 분석기 '{0}'에서 '{2}' 메시지와 함께 '{1}' 형식의 예외를 throw했습니다.
pl: Analizator „{0}” zgłosił wyjątek typu „{1}” z komunikatem „{2}”.
pt_br: O analisador '{0}' gerou uma exceção do tipo '{1}' com a mensagem '{2}'.
ru: Анализатор "{0}" создал исключение типа "{1}" с сообщением "{2}".
tr: '{0}' çözümleyicisi '{2}' iletisiyle '{1}' türünde bir özel durum oluşturdu.
zh_hans: 分析器“{0}”抛出类型为“{1}”的异常，并显示消息“{2}”。
zh_hant: 分析器 '{0}' 擲回類型 '{1}' 的例外狀況，訊息為 '{2}'。

# Analyzer_0_threw_the_following_exception_colon_1
source: Analyzer '{0}' threw the following exception: '{1}'.
cs: Analyzátor {0} vrátil následující výjimku: {1}.
de: Das Analysetool "{0}" hat die folgende Ausnahme ausgelöst: "{1}".
es: El analizador '{0}' inició la siguiente excepción: '{1}'.
fr: L'analyseur '{0}' a levé l'exception suivante : '{1}'.
it: L'analizzatore '{0}' ha generato l'eccezione seguente: '{1}'.
ja: アナライザー '{0}'が、次の例をスローしました: '{1}'。
ko: '{0}' 분석기에서 다음 예외를 throw했습니다. '{1}'
pl: Analizator „{0}” zgłosił następujący wyjątek: „{1}”.
pt_br: O analisador '{0}' gerou a seguinte exceção: '{1}'.
ru: Анализатор "{0}" создал следующее исключение: "{1}".
tr: '{0}' çözümleyicisi şu özel durumu oluşturdu: '{1}'.
zh_hans: 分析器“{0}”引发了以下异常: “{1}”。
zh_hant: 分析器 '{0}' 擲回下列例外狀況: '{1}'。

source: Remove qualification
cs: Odebrat kvalifikaci
de: Qualifizierung entfernen
es: Quitar cualificación
fr: Supprimer une qualification
it: Rimuovi qualificazione
ja: 修飾子を削除
ko: 한정자 제거
pl: Usuń kwalifikacje
pt_br: Remover qualificação
ru: Удалить квалификацию
tr: Nitelemeyi kaldır
zh_hans: 删除限定
zh_hant: 移除限定性條件

source: Unknown error occurred
cs: Došlo k neznámé chybě.
de: Unbekannter Fehler aufgetreten
es: Se ha producido un error desconocido
fr: Une erreur inconnue s'est produite
it: Si è verificato un errore sconosciuto
ja: 不明なエラーが発生しました
ko: 알 수 없는 오류 발생
pl: Wystąpił nieznany błąd
pt_br: Erro desconhecido
ru: Возникла неизвестная ошибка
tr: Bilinmeyen hata oluştu
zh_hans: 发生未知错误
zh_hant: 發生不明錯誤

source: Available
cs: K dispozici
de: Verfügbar
es: Disponible
fr: Disponibilité
it: Disponibile
ja: 利用可能
ko: 사용할 수 있는
pl: Dostępne
pt_br: Disponível
ru: Доступные
tr: Kullanılabilir
zh_hans: 可用
zh_hant: 可用

source: Not Available ⚠
cs: Není k dispozici ⚠
de: Nicht verfügbar ⚠
es: No disponible ⚠
fr: Non disponible
it: Non disponibile ⚠
ja: 使用できません ⚠
ko: 사용할 수 없음 ⚠
pl: Niedostępne ⚠
pt_br: Não Disponível ⚠
ru: Недоступно ⚠
tr: Kullanılabilir Değil ⚠
zh_hans: 不可用 ⚠
zh_hant: 無法使用

source: in Source
cs: ve zdroji
de: In Quelle
es: En origen
fr: dans la source
it: nell'origine
ja: ソース内
ko: 소스
pl: w źródle
pt_br: na Fonte
ru: в исходном
tr: Kaynakta
zh_hans: 在源中
zh_hant: 在原始程式檔中

source: in Suppression File
cs: V souboru potlačení
de: In Unterdrückungsdatei
es: En archivo de supresión
fr: dans le fichier de suppression
it: nel file di eliminazione
ja: 抑制ファイル内
ko: 비표시 오류(Suppression) 파일
pl: w pliku pominięć
pt_br: no Arquivo de Supressão
ru: в файле подавляемых предупреждений
tr: Gizleme Dosyasında
zh_hans: 在禁止显示文件中
zh_hant: 在隱藏項目檔中

source: Remove Suppression {0}
cs: Odebrat potlačení {0}
de: Unterdrückung "{0}" entfernen
es: Quitar supresión {0}
fr: Retirer la suppression {0}
it: Rimuovi eliminazione {0}
ja: 抑制 {0} を削除します
ko: 비표시 오류(Suppression) {0} 제거
pl: Usuń pominięcie {0}
pt_br: Remover a Supressão {0}
ru: Удалить подавление {0}
tr: {0} Gizlemesini Kaldır
zh_hans: 删除禁止显示 {0}
zh_hant: 移除隱藏項目 {0}

source: Remove Suppression
cs: Odebrat potlačení
de: Unterdrückung entfernen
es: Quitar supresión
fr: Retirer la suppression
it: Rimuovi eliminazione
ja: 抑制の削除
ko: 비표시 오류(Suppression) 제거
pl: Usuń pominięcie
pt_br: Remover Supressão
ru: Удалить подавление
tr: Gizlemeyi Kaldır
zh_hans: 删除禁止显示
zh_hant: 移除隱藏項目

source: <Pending>
cs: <Čeká>
de: <Ausstehend>
es: <pendiente>
fr: <En attente>
it: <In sospeso>
ja: <保留中>
ko: <보류 중>
pl: <Oczekujące>
pt_br: <Pendente>
ru: <Ожидание>
tr: <bekleyen>
zh_hans: <挂起>
zh_hant: <暫止>

# Note_colon_Tab_twice_to_insert_the_0_snippet
source: Note: Tab twice to insert the '{0}' snippet.
cs: Poznámka: Pro vložení fragmentu {0} stiskněte dvakrát tabulátor.
de: Hinweis: Drücken Sie zweimal die TAB-TASTE, um den Schnipsel "{0}" einzufügen.
es: Nota: Presione dos veces la tecla Tab para insertar el fragmento de código '{0}'.
fr: Remarque : appuyez deux fois sur la touche Tab pour insérer l'extrait de code '{0}'.
it: Nota: premere due volte TAB per inserire il frammento di codice '{0}'.
ja: メモ: '{0}' スニペットを挿入するには、Tab キーを 2 回押してください。
ko: 참고: '{0}' 코드 조각을 삽입하려면 두 번 탭하세요.
pl: Uwaga: naciśnij dwa razy klawisz Tab, aby wstawić fragment kodu „{0}”.
pt_br: Observação: pressione Tab duas vezes para inserir o snippet '{0}'.
ru: Примечание. Два раза нажмите клавишу TAB, чтобы вставить фрагмент кода "{0}".
tr: Not: '{0}' kod parçacığını eklemek için iki kez sekme yapın.
zh_hans: 注意: 两次 Tab 插入“{0}”片段。
zh_hant: 注意: 按兩次 Tab 鍵即可插入 '{0}' 程式碼片段。

source: Implement interface explicitly with Dispose pattern
de: Schnittstelle explizit mit Dispose-Muster implementieren
fr: Implémenter l'interface explicitement avec le modèle Dispose
it: Implementa l'interfaccia in modo esplicito con il criterio Dispose
ja: 破棄パターンを使って明示的にインターフェイスを実装します
zh_hans: 通过释放模式显式实现接口
zh_hant: 使用 Dispose 模式明確地實作介面

source: Implement interface with Dispose pattern
de: Schnittstelle mit Dispose-Muster implementieren
fr: Implémenter l'interface avec le modèle Dispose
it: Implementa l'interfaccia con il criterio Dispose
ja: 破棄パターンを使ってインターフェイスを実装します
zh_hans: 通过释放模式实现接口
zh_hant: 使用 Dispose 模式實作介面

source: Computing fix all occurrences code fix...
cs: Vypočítává se oprava kódu pro opravu všech výskytů...
de: Berechnen der Codefehlerbehebung für alle Vorkommen...
es: Calculando corrección de todas las repeticiones de corrección de código...
fr: Calcul de la correction de toutes les occurrences (correction du code)...
it: Calcolo di tutte le occorrenze da correggere nel codice...
ja: 出現箇所をすべて修正するコード修正プログラムを計算しています...
ko: 모든 항목 코드 수정 사항을 계산하는 중...
pl: Trwa obliczanie poprawki kodu naprawiającej wszystkie obliczenia...
pt_br: Computando a correção de todas as correções de código de ocorrências…
ru: Вычисление изменения кода для исправления всех вхождений...
tr: Geçtiği her yerde düzeltme kod düzeltmesi hesaplanıyor...
zh_hans: 正在计算“修复所有出现的地方”代码修复...
zh_hant: 正在計算修正所有出現程式碼修正之處...

source: Fix all occurrences
cs: Opravit všechny výskyty
de: Alle Vorkommen korrigieren
es: Corregir todas las repeticiones
fr: Corriger toutes les occurrences
it: Correggi tutte le occorrenze
ja: すべての出現箇所を修正します
ko: 모든 발생 수정
pl: Popraw wszystkie wystąpienia
pt_br: Corrigir todas as ocorrências
ru: Исправить все случаи
tr: Tüm oluşumları düzelt
zh_hans: 修复所有出现的地方
zh_hant: 修正所有發生次數

source: Document
cs: Dokument
de: Dokument
es: Documento
it: Documento
ja: ドキュメント
ko: 문서
pl: Dokument
pt_br: Documento
ru: Документ
tr: Belge
zh_hans: 文档
zh_hant: 文件

source: Project
cs: Projekt
de: Projekt
es: Proyecto
fr: Projet
it: PROGETTO
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: PROJE
zh_hans: 项目
zh_hant: 專案

source: Solution
cs: Řešení
de: Projektmappe
es: Solución
it: Soluzione
ja: ソリューション
ko: 솔루션
pl: Rozwiązanie
pt_br: Solução
ru: Решение
tr: Çözüm
zh_hans: 解决方案
zh_hant: 解決方案

# TODO_colon_dispose_managed_state_managed_objects
source: TODO: dispose managed state (managed objects)
de: TODO: Verwalteten Zustand (verwaltete Objekte) bereinigen
fr: TODO: supprimer l'état managé (objets managés)
it: TODO: eliminare lo stato gestito (oggetti gestiti)
ja: TODO: マネージド状態を破棄します (マネージド オブジェクト)
zh_hans: TODO: 释放托管状态(托管对象)
zh_hant: TODO: 處置受控狀態 (受控物件)

# TODO_colon_set_large_fields_to_null
source: TODO: set large fields to null
de: TODO: Große Felder auf NULL setzen
fr: TODO: affecter aux grands champs une valeur null
it: TODO: impostare campi di grandi dimensioni su Null
ja: TODO: 大きなフィールドを null に設定します
zh_hans: TODO: 将大型字段设置为 null
zh_hant: TODO: 將大型欄位設為 Null

# Compiler2
source: Compiler
cs: Kompilátor
es: Compilador
fr: Compilateur
it: Compilatore
ja: コンパイラ
ko: 컴파일러
pl: Kompilator
pt_br: Compilador
ru: Компилятор
tr: Derleyici
zh_hans: 编译器
zh_hant: 編譯器

source: Live
cs: Živě
es: Activo
fr: En direct
it: In tempo reale
ja: ライブ
ko: 라이브
pl: Na żywo
pt_br: Ao Vivo
ru: В реальном времени
tr: Canlı
zh_hans: 活动
zh_hant: 即時

source: enum value
cs: hodnota enum
de: enum – Wert
es: valor de enumeración
fr: valeur enum
it: valore di enumerazione
ja: enum 値
ko: enum 값
pl: wartość enum
pt_br: valor de enum
ru: значение enum
tr: enum değeri
zh_hans: enum 值
zh_hant: enum 值

source: const field
cs: Pole const
de: const – Feld
es: campo const
fr: Champ const
it: campo const
ja: const フィールド
ko: const 필드
pl: pole const
pt_br: campo const
ru: поле const
tr: const alanı
zh_hans: const 字段
zh_hant: const 欄位

source: method
cs: metoda
de: Methode
es: método
fr: méthode
it: metodo
ja: メソッド
ko: 메서드
pl: metoda
pt_br: método
ru: метод
tr: yöntem
zh_hans: 方法
zh_hant: 方法

source: operator
cs: operátor
es: Operador
fr: Opérateur
it: operatore
ja: 演算子
ko: 운영자
pt_br: Operador
ru: Оператор
tr: işleç
zh_hans: 运算符
zh_hant: 運算子

source: constructor
cs: konstruktor
de: Konstruktor
fr: constructeur
it: costruttore
ja: コンストラクター
ko: 생성자
pl: konstruktor
pt_br: construtor
ru: конструктор
tr: oluşturucu
zh_hans: 构造函数
zh_hant: 建構函式

source: auto-property
cs: automatická vlastnost
de: Auto-Eigenschaft
es: propiedad automática
fr: auto-propriété
it: proprietà automatica
ja: 自動プロパティ
ko: Auto 속성
pl: właściwość automatyczna
pt_br: propriedade automática
ru: автосвойство
tr: otomatik özellik
zh_hans: 自动属性
zh_hant: Auto 屬性

source: property
cs: vlastnost
de: Eigenschaft
es: Propiedad
fr: propriété
it: proprietà
ja: プロパティ
ko: 속성
pl: właściwość
pt_br: propriedade
ru: Свойство
tr: özellik
zh_hans: 属性
zh_hant: 屬性

source: event accessor
cs: přístupový objekt události
de: Ereignisaccessor
es: descriptor de acceso de eventos
fr: accesseur d'événement
it: funzione di accesso eventi
ja: イベント アクセサー
ko: 이벤트 접근자
pl: metoda dostępu do zdarzeń
pt_br: acessador de evento
ru: метод доступа к событию
tr: olay erişeni
zh_hans: 事件访问器
zh_hant: 事件存取子

source: rfc1123 date/time
cs: datum a čas rfc1123
de: RFC1123-Datum/Uhrzeit
es: fecha y hora de rfc1123
fr: date/heure (rfc1123)
it: Data/ora RFC 1123
ja: rfc1123 日付/時刻
ko: rfc1123 날짜/시간
pl: data/godzina zgodna z rfc1123
pt_br: data/hora rfc1123
ru: дата и время в формате RFC1123
tr: rfc1123 tarih/saat
zh_hans: rfc1123 日期/时间
zh_hant: rfc1123 日期/時間

# rfc1123_date_time_description
source: The "R" or "r" standard format specifier represents a custom date and time format string that is defined by the DateTimeFormatInfo.RFC1123Pattern property. The pattern reflects a defined standard, and the property is read-only. Therefore, it is always the same, regardless of the culture used or the format provider supplied. The custom format string is "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". When this standard format specifier is used, the formatting or parsing operation always uses the invariant culture.
cs: Specifikátory standardního formátu R nebo r představují řetězec vlastního formátu data a času, který se definuje pomocí vlastnosti DateTimeFormatInfo.RFC1123Pattern. Vzor dodržuje definovaný standard a vlastnost je určená jen pro čtení. Proto je vždy stejná, bez ohledu na používanou jazykovou verzi nebo zadaného poskytovatele formátu. Řetězec vlastního formátu je ddd, dd MMM yyyy HH':'mm':'ss 'GMT'. Když se tento specifikátor standardního formátu použije, operace formátování nebo parsování vždy použije invariantní jazykovou verzi.
de: Der Standardformatbezeichner "R" oder "r" repräsentiert eine benutzerdefinierte Datums- und Uhrzeitformatzeichenfolge, die durch die DateTimeFormatInfo.RFC1123Pattern-Eigenschaft definiert ist. Das Muster folgt einem definierten Standard, und die Eigenschaft ist schreibgeschützt. Daher ist sie immer gleich, unabhängig von der verwendeten Kultur oder dem angegebenen Formatanbieter. Die benutzerdefinierte Formatzeichenfolge lautet "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Bei Verwendung dieses Standardformatbezeichners wird für die Formatierung oder Analyse immer die invariante Kultur verwendet.
es: El especificador de formato estándar "R" o "r" representa una cadena de formato de fecha y hora personalizado que está definida por la propiedad DateTimeFormatInfo.RFC1123Pattern. El patrón refleja un estándar definido y la propiedad es de solo lectura. Por lo tanto, siempre es el mismo, independientemente de la referencia cultural utilizada o del proveedor de formato proporcionado. La cadena de formato personalizado es "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Cuando se usa este especificador de formato estándar, la operación de formato o análisis utiliza siempre la referencia cultural invariable.
fr: Le spécificateur de format standard "R" ou "r" représente une chaîne de format de date et d'heure personnalisée, qui est définie par la propriété DateTimeFormatInfo.RFC1123Pattern. Le modèle reflète une norme définie, et la propriété est en lecture seule. Elle est donc toujours identique, quelle que soit la culture utilisée ou le fournisseur de format indiqué. La chaîne de format personnalisée est "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Quand ce spécificateur de format standard est utilisé, l'opération qui consiste à appliquer un format ou à exécuter une analyse utilise toujours la culture invariante.
it: L'identificatore di formato standard "R" o "r" rappresenta una stringa di formato di data e ora personalizzata definita dalla proprietà DateTimeFormatInfo.RFC1123Pattern corrente. Lo schema rispecchia uno standard definito e la proprietà è di sola lettura. Sarà quindi sempre lo stesso, indipendentemente dalle impostazioni cultura usate o dal provider di formato specificato. La stringa di formato personalizzata è "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Quando si usa questo identificatore di formato standard, la formattazione o l'operazione di analisi usa sempre le impostazioni cultura inglese non dipendenti da paese/area geografica.
ja: "R" または "r" 標準書式指定子は、DateTimeFormatInfo.RFC1123Pattern プロパティで定義されているカスタム日時書式設定文字列を表します。このパターンには定義済み標準が反映されています。また、プロパティは読み取り専用です。したがって、使用されているカルチャまたは指定された書式プロバイダーに関係なく、これは常に同じになります。カスタム書式設定文字列は "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'" です。この標準書式指定子が使用されている場合、書式設定操作または解析操作では常にインバリアント カルチャが使用されます。
ko: "R" 또는 "r" 표준 형식 지정자는 DateTimeFormatInfo.RFC1123Pattern 속성으로 정의되는 사용자 지정 날짜 및 시간 형식 문자열을 나타냅니다. 패턴은 정의된 표준을 반영하며, 속성은 읽기 전용입니다. 따라서 사용된 문화권이나 지정된 형식 공급자와 관계없이 항상 동일합니다. 사용자 지정 형식 문자열은 "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'"입니다. 이 표준 형식 지정자를 사용하면 형식 지정 또는 구문 분석 연산에서 항상 고정 문화권이 사용됩니다.
pl: Standardowy specyfikator formatu „R” lub „r” reprezentuje niestandardowy ciąg formatu daty i godziny zdefiniowany przez właściwość DateTimeFormatInfo.RFC1123Pattern. Wzorzec odpowiada zdefiniowanemu standardowi, a właściwość jest tylko do odczytu. Dlatego jest on zawsze taki sam niezależnie od użytej kultury lub określonego dostawcy formatu. Niestandardowy ciąg formatu to „ddd, dd MMM yyyy HH':'mm':'ss 'GMT'”. Gdy jest używany ten standardowy specyfikator formatu, operacja formatowania lub analizowania zawsze używa kultury niezmiennej.
pt_br: O especificador de formato padrão "R" ou "r" representa uma cadeia de caracteres de formato de data e hora personalizado definida pela propriedade DateTimeFormatInfo.RFC1123Pattern. O padrão reflete um padrão definido e a propriedade é somente leitura. Portanto, é sempre o mesmo, independentemente da cultura usada ou do provedor de formato fornecido. A cadeia de caracteres de formato personalizado é "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Quando esse especificador de formato padrão é usado, a operação de análise ou formatação sempre usa a cultura invariável.
ru: Описатель стандартного формата "R" или "r" представляет строку пользовательского формата даты и времени, определяемую свойством DateTimeFormatInfo.RFC1123Pattern. Шаблон отражает определенный стандарт, а само свойство доступно только для чтения. Таким образом, данное значение всегда одинаково, независимо от используемых языка и региональных параметров или от указанного поставщика формата. Строка пользовательского формата имеет вид "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'". Когда используется этот описатель стандартного формата, операция форматирования или анализа всегда использует инвариантные язык и региональные параметры.
tr: "R" veya "r" standart biçim belirticisi, DateTimeFormatInfo.RFC1123Pattern özelliği tarafından tanımlanan özel bir tarih ve saat biçimi dizesini temsil eder. Desen, tanımlanmış bir standardı yansıtır ve özellik salt okunurdur. Bu nedenle, kullanılan kültür veya girilen biçim sağlayıcısı ne olursa olsun her zaman aynıdır. Özel biçim dizesi "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'" şeklindedir. Bu standart biçim belirticisi kullanıldığında, biçimlendirme veya ayrıştırma işlemi her zaman sabit kültürü kullanır.
zh_hans: "R" 或 "r" 标准格式说明符表示由 DateTimeFormatInfo.RFC1123Pattern 属性定义的自定义日期和时间格式字符串。模式反映已定义的标准，并且属性是只读的。因此，无论使用何种区域性或提供格式提供程序，它始终是相同的。自定义格式字符串为 "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'"。使用此标准格式说明符时，格式设置或分析操作始终使用固定区域性。
zh_hant: "R" 或 "r" 標準格式規範代表由 DateTimeFormatInfo.RFC1123Pattern 屬性所定義的自訂日期和時間格式字串。此模式會反映出已定義的標準，且屬性為唯讀。因此，不管使用何種文化特性 (Culture) 或提供何種格式提供者，其始終都相同。自訂格式字串為 "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'"。使用此標準格式規範時，格式化或剖析作業永遠不因文化特性而異。

source: round-trip date/time
cs: datum a čas typu round-trip
de: Roundtrip-Datum/Uhrzeit
es: fecha y hora de recorrido de ida y vuelta
fr: date/heure (aller-retour)
it: Data/ora round trip
ja: ラウンドトリップ日付/時刻
ko: 왕복 날짜/시간
pl: data/godzina rundy
pt_br: data/hora de viagem de ida e volta
ru: дата и время для кругового пути
tr: gidiş dönüş tarihi/saati
zh_hans: 往返日期/时间
zh_hant: 來回行程日期/時間
