Repository: dotnet/roslyn
Catalog: src/Features/Core/Portable/xlf/FeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# _10ths_of_a_second_description
source: The "f" custom format specifier represents the most significant digit of the seconds fraction; that is, it represents the tenths of a second in a date and time value. If the "f" format specifier is used without other format specifiers, it's interpreted as the "f" standard date and time format specifier. When you use "f" format specifiers as part of a format string supplied to the ParseExact or TryParseExact method, the number of "f" format specifiers indicates the number of most significant digits of the seconds fraction that must be present to successfully parse the string.
cs: Specifikátor vlastního formátu "f" představuje platné číslici zlomku sekund. To znamená, že v hodnotě data a času představuje desetiny sekundy. Pokud se specifikátor formátu "f" použije bez jiných specifikátorů formátu, interpretuje se jako standardní specifikátor formátu data a času "f". Když specifikátor formátu "f" použijete v rámci řetězce formátu, který se předává metodám ParseExact nebo TryParseExact, počet specifikátorů formátu "f" určuje počet platných číslic zlomku sekundy, který musí být k dispozici pro úspěšné parsování řetězce.
de: Der benutzerdefinierte Formatbezeichner "f" repräsentiert die signifikanteste Stelle des Sekundenbruchteils, d.h., er stellt die Zehntelsekunden in einem Datums- und Uhrzeitwert dar. Bei Verwendung des Formatbezeichners "f" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "f" für Datum und Uhrzeit interpretiert. Bei Verwendung des Formatbezeichners "f" als Teil einer Formatzeichenfolge zur Übergabe an die ParseExact- oder TryParseExact-Methode gibt die "f"-Formatbezeichneranzahl die Anzahl der signifikantesten Stellen des Sekundenbruchteils an, die vorhanden sein müssen, um die Zeichenfolge erfolgreich zu analysieren.
es: El especificador de formato personalizado "f" representa el dígito más significativo de la fracción de segundos, es decir, las décimas de segundo de un valor de fecha y hora. Si el especificador de formato "f" se usa sin otros especificadores de formato, se interpreta como el especificador de formato de fecha y hora estándar "f". Cuando se usan especificadores de formato "f" como parte de una cadena de formato proporcionada al método ParseExact o TryParseExact, el número de especificadores de formato "f" indica el número de dígitos más significativos de la fracción de segundos que deben estar presentes para analizar correctamente la cadena.
fr: Le spécificateur de format personnalisé "f" représente le chiffre le plus significatif de la fraction de seconde. En d'autres termes, il représente les dixièmes de seconde d'une valeur de date et d'heure. Si le spécificateur de format "f" est utilisé sans autres spécificateurs de format, il est interprété en tant que spécificateur de format de date et d'heure standard : "f". Quand vous utilisez les spécificateurs de format "f" dans le cadre d'une chaîne de format fournie à la méthode ParseExact, TryParseExact, ParseExact ou TryParseExact, le nombre de spécificateurs de format "f" indique le nombre de chiffres les plus significatifs de la fraction de seconde qui doivent être présents pour permettre une analyse correcte de la chaîne.
it: L'identificatore di formato personalizzato "f" rappresenta la cifra più significativa della frazione di secondi, ovvero i decimi di secondo in un valore di data e ora. Se l'identificatore di formato "f" viene usato senza altri identificatori di formato, viene interpretato come l'identificatore di formato di data e ora standard "f". Quando si usano identificatori di formato "f" come parte di una stringa di formato fornita al metodo ParseExact o TryParseExact, il numero di identificatori di formato "f" indica il numero di cifre più significative della frazione di secondi che deve essere presente per analizzare correttamente la stringa.
ja: "f" カスタム書式指定子は、秒の小数部分の有効数字最上位桁を表します。つまり、日時値の秒の小数部分を 10 分の 1 秒単位で表します。 "f" 書式指定子を他の書式指定子なしで使用すると、"f" 標準日時書式指定子として解釈されます。 "f" 書式指定子を、ParseExact、または TryParseExact メソッドに指定する書式文字列の一部として使用した場合、"f" 書式指定子の数は、文字列を正常に解析するために必要な秒の小数点以下の有効桁数を示します。
ko: "f" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자를 나타냅니다. 즉, 날짜 및 시간 값에서 10분의 1초를 나타냅니다. 다른 형식 지정자 없이 "f" 형식 지정자를 사용하면 "f" 표준 날짜 및 시간 형식 지정자로 해석됩니다. ParseExact 또는 TryParseExact 메서드로 제공되는 형식 문자열의 일부로 "f" 형식 지정자를 사용할 경우 "f" 형식 지정자의 개수는 초 부분에서 문자열을 성공적으로 구문 분석하려면 존재해야 하는 가장 유효한 숫자의 개수를 나타냅니다.
pl: Specyfikator formatu niestandardowego "f" reprezentuje najbardziej znaczącą cyfrę ułamka sekundy; tzn. reprezentuje część dziesiętną sekundy w wartości daty i godziny. Jeśli specyfikator formatu "f" zostanie użyty bez innych specyfikatorów formatu, będzie to interpretowane jako specyfikator standardowego formatu daty i godziny "f". Gdy specyfikatory formatu "f" są używane jako część ciągu formatu podanego dla metody ParseExact lub TryParseExact, liczba specyfikatorów formatu "f" będzie wskazywać liczbę najważniejszych cyfr ułamka sekund, jaka musi być obecna, aby pomyślnie przeanalizować dany ciąg.
pt_br: O especificador de formato personalizado "f" representa o dígito mais significativo da fração de segundos; ou seja, ele representa os décimos de segundo em um valor de data e hora. Se o especificador de formato "f" for usado sem outros especificadores de formato, ele será interpretado como o especificador de formato padrão de data e hora "f". Quando você usa especificadores de formato "f" como parte de uma cadeia de caracteres de formato fornecida ao método ParseExact ou TryParseExact, o número de especificadores de formato "f" indica o número de dígitos mais significativos da fração de segundos que devem estar presentes para analisar a cadeia de caracteres com sucesso.
ru: Описатель пользовательского формата "f" представляет наиболее значащую цифру в дробной части секунды, то есть представляет десятые доли секунды в значении даты и времени. Если описатель формата "f" используется без других описателей формата, он интерпретируется как описатель стандартного формата даты и времени "f". При использовании описателей формата "f" в качестве части строки формата, передаваемой методу ParseExact или TryParseExact, число описателей формата "f" указывает количество наиболее значащих цифр в дробной части секунды, которые должны присутствовать для успешного анализа строки.
tr: "f" özel biçim tanımlayıcı, saniye kesrinin en anlamlı basamağını; yani bir tarih ve saat değerinde saniyenin onda birini temsil eder. "f" biçim tanımlayıcı başka biçim tanımlayıcılar olmadan kullanılırsa, "f" standart tarih ve saat biçim tanımlayıcı olarak yorumlanır. "f" biçim tanımlayıcı ParseExact veya TryParseExact yöntemine sağlanan bir biçim dizesinde kullanıldığında, "f" biçim tanımlayıcıların sayısı, dizenin başarıyla ayrıştırılması için saniye kesirinde bulunması gereken en anlamlı basamak sayısını gösterir.
zh_hans: "f" 自定义格式说明符表示秒部分的最高有效位；即表示日期和时间值中的十分之一秒数。 如果在没有其他自定义格式说明符的情况下使用 "f" 格式说明符，则该说明符将被解释为 "f" 标准日期和时间格式说明符。 将 "f" 格式说明符用作提供给 ParseExact 或 TryParseExact 方法的格式字符串的一部分时，"f" 格式说明符的数目会指示成功分析字符串时必须存在的秒部分的最高有效位的数目。
zh_hant: "f" 自訂格式規範代表秒小數部分的最大有效位數; 換句話說，其代表日期與時間值中的十分之一秒。 如果在使用 "f" 格式規範時沒有其他格式規範，則會將其解譯為 "f" 標準日期與時間格式規範。 對 ParseExact、TryParseExact、ParseExact 或 TryParseExact 方法所提供的格式字串包含 "f" 格式規範時，"f" 格式規範的數字，代表成功剖析字串所必須出現的秒小數部分最大有效位數。

source: 10ths of a second (non-zero)
cs: Desetiny sekundy (nenulové)
de: Zehntel einer Sekunde (ungleich 0)
es: 1 diezmilésima parte de un segundo (no cero)
fr: 10es de seconde (non nul)
it: Decimi di secondo (diversi da zero)
ja: 10 分の 1 秒単位 (0 以外)
ko: 10분의 1초(0이 아님)
pl: 1/10 sekundy (wartrość inna niż zero)
pt_br: Décimos de segundo (diferente de zero)
ru: 10-е доли секунды (не нуль)
tr: Saniyenin 10'da biri (sıfır olmayan)
zh_hans: 十分之一秒(非零)
zh_hant: 1/10 秒 (非零)

# _10ths_of_a_second_non_zero_description
source: The "F" custom format specifier represents the most significant digit of the seconds fraction; that is, it represents the tenths of a second in a date and time value. Nothing is displayed if the digit is zero. If the "F" format specifier is used without other format specifiers, it's interpreted as the "F" standard date and time format specifier. The number of "F" format specifiers used with the ParseExact, TryParseExact, ParseExact, or TryParseExact method indicates the maximum number of most significant digits of the seconds fraction that can be present to successfully parse the string.
cs: Specifikátor vlastního formátu F představuje platné číslici zlomku sekund. To znamená, že v hodnotě data a času představuje desetiny sekundy. Pokud je číslicí nula, nic se nezobrazí. Pokud se specifikátor formátu F použije bez jiných specifikátorů formátu, interpretuje se jako standardní specifikátor formátu data a času F. Počet specifikátorů formátu F použitý v metodě ParseExact, TryParseExact, ParseExact nebo TryParseExact udává maximální počet platných číslic zlomku sekundy, který může být k dispozici pro úspěšné parsování řetězce.
de: Der benutzerdefinierte Formatbezeichner "F" repräsentiert die signifikanteste Stelle des Sekundenbruchteils, d. h., er stellt die Zehntelsekunden in einem Datums- und Uhrzeitwert dar. Wenn die Stelle 0 lautet, wird nichts angezeigt. Bei Verwendung des Formatbezeichners "f" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner "f" für Datum und Uhrzeit interpretiert. Bei Verwendung des Formatbezeichners "f" als Teil einer Formatzeichenfolge zur Übergabe an die ParseExact-, TryParseExact-, ParseExact- oder TryParseExact-Methode gibt die f-Formatbezeichneranzahl die Anzahl der signifikantesten Stellen des Sekundenbruchteils an, die vorhanden sein müssen, um die Zeichenfolge erfolgreich zu analysieren.
es: El especificador de formato personalizado "F" representa el dígito más significativo de la fracción de segundos, es decir, representa las décimas de segundo en un valor de fecha y hora. Si el dígito es cero, no se muestra nada. Si el especificador de formato "F" se usa sin otros especificadores de formato, se interpreta como el especificador de formato de fecha y hora estándar "F". El número de especificadores de formato "F" que se usan con los métodos ParseExact, TryParseExact, ParseExact o TryParseExact indica el número máximo de dígitos más significativos de la fracción de segundos que puede haber para analizar correctamente la cadena.
fr: Le spécificateur de format personnalisé "F" représente le chiffre le plus significatif de la fraction de seconde. En d'autres termes, il représente les dixièmes de seconde d'une valeur de date et d'heure. Rien ne s'affiche si le chiffre est zéro. Si le spécificateur de format "F" est utilisé sans autres spécificateurs de format, il est interprété en tant que spécificateur de format de date et d'heure standard : "F". Le nombre de spécificateurs de format "F" utilisés avec la méthode ParseExact, TryParseExact, ParseExact ou TryParseExact indique le nombre maximal de chiffres les plus significatifs de la fraction de seconde qui peuvent être présents pour permettre une analyse correcte de la chaîne.
it: L'identificatore di formato personalizzato "F" rappresenta la cifra più significativa della frazione di secondi, ovvero i decimi di secondo in un valore di data e ora. Se la cifra è zero, non viene visualizzato nulla. Se l'identificatore di formato "F" viene usato senza altri identificatori di formato, viene interpretato come l'identificatore di formato di data e ora standard "F". Il numero di identificatoti di formato "F" usati con il metodo ParseExact, TryParseExact, ParseExact o TryParseExact indica il numero massimo di cifre più significative della frazione di secondi che possono essere presenti per analizzare correttamente la stringa.
ja: "F" カスタム書式指定子は、秒の小数部分の有効数字最上位桁を表します。つまり、日時値の秒の少数部分を 10 分の 1 秒単位で表します。この桁が 0 の場合は、何も表示されません。 "F" 書式指定子を他の書式指定子なしで使用すると、"F" 標準日時書式指定子として解釈されます。 ParseExact、TryParseExact、ParseExact、または TryParseExact メソッドと共に使用される "F" 書式指定子の数は、文字列を正常に解析するために存在して構わない秒の小数部分の最大桁数を示します。
ko: "F" 사용자 지정 형식 지정자는 초 부분의 가장 유효한 숫자를 나타냅니다. 즉, 날짜 및 시간 값에서 10분의 1초를 나타냅니다. 이 숫자가 0이면 아무것도 표시되지 않습니다. 다른 형식 지정자 없이 "F" 형식 지정자를 사용하면 "F" 표준 날짜 및 시간 형식 지정자로 해석됩니다. ParseExact, TryParseExact, ParseExact 또는 TryParseExact 메서드에서 사용되는 "F" 형식 지정자의 개수는 초 부분에서 문자열을 성공적으로 구문 분석하기 위해 존재할 수 있는 가장 유효한 숫자의 최대 개수를 나타냅니다.
pl: Indywidualny specyfikator formatu „F” reprezentuje najbardziej znaczącą cyfrę ułamka sekundy; tzn. reprezentuje dziesiątą część sekundy w wartości daty i godziny. Jeśli tą cyfrą jest zero, nic nie jest wyświetlane. Jeśli specyfikator formatu „F” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny „F”. Liczba specyfikatorów formatu „f” używanych z metodą ParseExact, TryParseExact, ParseExact lub TryParseExact wskazuje maksymalną liczbę najważniejszych cyfr ułamka sekund, jaka może być reprezentowana, aby pomyślnie przeanalizować ciąg.
pt_br: O especificador de formato personalizado "F" representa o dígito mais significativo da fração de segundos; ou seja, ele representa os décimos de segundo em um valor de data e hora. Nada será exibido se o dígito for zero. Se o especificador de formato "F" for usado sem outros especificadores de formato, ele será interpretado como o especificador de formato padrão de data e hora "F". O número de especificadores de formato "F" usados com o método ParseExact, TryParseExact, ParseExact ou TryParseExact indica o número máximo de dígitos significativos da fração de segundos que podem estar presentes para analisar a cadeia de caracteres com êxito.
ru: Описатель пользовательского формата "F" представляет наиболее значащую цифру в дробной части секунды, то есть представляет десятые доли секунды в значении даты и времени. Если разряд равен нулю, ничего не отображается. Если описатель формата "F" используется без других описателей формата, он интерпретируется как описатель стандартного формата даты и времени "F". Число описателей формата "F", используемых с методом ParseExact, TryParseExact, ParseExact или TryParseExact, указывает максимальное количество наиболее значащих цифр в дробной части секунды, которые должны присутствовать для успешного анализа строки.
tr: "F" özel biçim belirticisi, saniye kesirinin en anlamlı basamağını; yani bir tarih ve saat değerinde saniyenin onda birini temsil eder. Rakam sıfırsa hiçbir şey görüntülenmez. "F" biçim belirticisi başka biçim belirticileri olmadan kullanılırsa, standart tarih ve saat biçim belirticisi "F" olarak yorumlanır. Parse, TryParse, ParseExact veya TryParseExact yöntemi ile kullanılan "F" biçim belirticilerinin sayısı, dizenin başarıyla ayrıştırılması için saniye kesirinde bulunabilecek maksimum anlamlı rakam sayısını gösterir.
zh_hans: "F" 自定义格式说明符表示秒部分的最高有效位；即在日期和时间值中表示十分之一秒数。如果数字为零，则不显示任何内容。 如果使用 "F" 格式说明符而没有其他自定义格式说明符，则该说明符将被解释为 "F" 标准日期和时间格式说明符。 ParseExact、TryParseExact、ParseExact 或 TryParseExact 方法中的 "F" 格式说明符的数目指示能够成功分析的字符串的秒部分的最高有效位的最大数目。
zh_hant: "F" 自訂格式規範代表秒小數部分的最大有效位數; 換句話說，其代表日期與時間值中的十分之一秒。如果數字為零，即不會顯示。 如果在使用 "F" 格式規範時沒有其他格式規範，則會將其解譯為 "F" 標準日期與時間格式規範。 使用 ParseExact、TryParseExact、ParseExact 或 TryParseExact 方法時，所使用的 "F" 格式規範數字，代表成功剖析字串所能出現秒小數部分的最大有效位數。

source: 12 hour clock (1-2 digits)
cs: 12hodinový formát (1–2 číslice)
de: 12-Stunden-Format (1–2 Stellen)
es: Reloj de 12 horas (1-2 dígitos)
fr: Horloge de 12 heures (1 à 2 chiffres)
it: Orario in formato 12 ore (1-2 cifre)
ja: 12 時間制 (1 - 2 桁)
ko: 12시간제(1~2자리)
pl: Zegar 12-godzinny (1–2 cyfr)
pt_br: Relógio de 12 horas (1-2 dígitos)
ru: 12-часовой формат времени (1–2 цифры)
tr: 12 saatlik düzen (1-2 rakam)
zh_hans: 12 小时制(1-2 位数)
zh_hant: 12 小時制 (1-2 位數)

# _12_hour_clock_1_2_digits_description
source: The "h" custom format specifier represents the hour as a number from 1 through 12; that is, the hour is represented by a 12-hour clock that counts the whole hours since midnight or noon. A particular hour after midnight is indistinguishable from the same hour after noon. The hour is not rounded, and a single-digit hour is formatted without a leading zero. For example, given a time of 5:43 in the morning or afternoon, this custom format specifier displays "5". If the "h" format specifier is used without other custom format specifiers, it's interpreted as a standard date and time format specifier and throws a FormatException.
cs: Specifikátor vlastního formátu h reprezentuje hodinu jako číslo od 1 do 12. To znamená, že hodina je reprezentována ve 12hodinovém formátu, který počítá celé hodiny od půlnoci do poledne. Konkrétní hodina po půlnoci se nijak neliší od stejné hodiny po poledni. Hodina se nezaokrouhluje a jednočíselná hodina se formátuje bez nuly na začátku. Když je například ráno nebo odpoledne 5:43, tento specifikátor vlastního formátu zobrazí 5. Pokud se specifikátor formátu h zadá bez jiných specifikátorů vlastního formátu, interpretuje se jako standardní specifikátor formátu data a času a vyvolá FormatException.
de: Der benutzerdefinierte Formatbezeichner "h" repräsentiert die Stunde als eine Zahl zwischen 1 und 12, d. h., die Stunde wird in einem 12-Stunden-Format dargestellt, bei dem die ganzen Stunden seit Mitternacht oder Mittag gezählt werden. Eine bestimmte Stunde nach Mitternacht ist nicht von der gleichen Stunde nach Mittag unterscheidbar. Der Stundenwert wird nicht gerundet, und ein einstelliger Stundenwert wird ohne führende Null formatiert. Beispielsweise zeigt dieser benutzerdefinierte Formatbezeichner bei der Uhrzeit 5:43 morgens oder nachmittags den Wert "5" an. Bei Verwendung des Formatbezeichners "h" ohne weitere benutzerdefinierte Formatbezeichner wird er als Standardformatbezeichner für Datum und Uhrzeit interpretiert und löst eine FormatException aus.
es: El especificador de formato personalizado "h" representa la hora como un número del 1 al 12, es decir, mediante un reloj de 12 horas que cuenta las horas enteras desde la medianoche o el mediodía. Una hora determinada después de la medianoche no se distingue de la misma hora después del mediodía. La hora no se redondea y el formato de una hora de un solo dígito es sin un cero inicial. Por ejemplo, a las 5:43 de la mañana o de la tarde, este especificador de formato personalizado muestra "5". Si el especificador de formato "h" se usa sin otros especificadores de formato personalizado, se interpreta como un especificador de formato de fecha y hora estándar y produce una excepción FormatException.
fr: Le spécificateur de format personnalisé "h" représente l'heure sous la forme d'un nombre compris entre 1 et 12. En d'autres termes, l'heure est représentée par une horloge de 12 heures qui compte les heures entières depuis minuit ou midi. Vous ne pouvez pas différencier une heure particulière après minuit et la même heure après midi. L'heure n'est pas arrondie, et une heure à un chiffre est présentée dans un format qui ne comporte aucun zéro de début. Par exemple, s'il est 5:43 du matin ou de l'après-midi, le spécificateur de format personnalisé affiche "5". Si le spécificateur de format "h" est utilisé sans autres spécificateurs de format personnalisés, il est interprété en tant que spécificateur de format de date et d'heure standard, et lève une exception FormatException.
it: L'identificatore di formato personalizzato "h" rappresenta l'ora come numero compreso tra 1 e 12, ovvero l'ora rappresentata nell'orario in formato 12 ore in base al quale il conteggio riparte da mezzanotte o da mezzogiorno. Una particolare ora dopo mezzanotte non è distinguibile dalla stessa ora dopo mezzogiorno. L'ora non viene arrotondata e se è costituita da una singola cifra viene formattata senza zero iniziale. Se viene, ad esempio, specificata un'ora equivalente alle 5:43 della mattina o del pomeriggio, tramite questo identificatore di formato personalizzato viene visualizzato "5". Se l'identificatore di formato "h" viene usato senza altri identificatori di formato personalizzati, viene interpretato come l'identificatore di formato di data e ora standard e viene generato un evento FormatException.
ja: "h" カスタム書式指定子は、時を 1 から 12 の数字で表します。つまり、午前 0 時または午後 0 時からの時間をカウントする 12 時間制で時が表されます。午前 0 時からカウントした特定の時は、正午からカウントした同じ時と区別できません。時は丸められず、1 桁の時は先行ゼロなしで書式設定されます。たとえば、午前または午後の 5:43 という時刻の場合、このカスタム書式指定子では "5" が表示されます。 "h" 書式指定子を他のカスタム書式指定子なしで使用すると、標準日時書式指定子として解釈され、FormatException がスローされます。
ko: "h" 사용자 지정 형식 지정자는 시간을 1부터 12까지의 숫자로 나타냅니다. 즉, 시간은 자정 또는 정오부터 경과한 정수 시간을 계산하는 12시간제로 표현됩니다. 자정 이후의 특정 시간은 정오 이후의 동일한 시간과 구분되지 않습니다. 시간은 반올림되지 않으며, 한 자릿수 시간은 앞에 0이 없는 형식으로 지정됩니다. 예를 들어, 오전 또는 오후 5:43이라는 시간이 지정되면 이 사용자 지정 형식 지정자는 "5"를 표시합니다. 다른 사용자 지정 형식 지정자 없이 "h" 형식 지정자를 사용하면 표준 날짜 및 시간 형식 지정자로 해석되어 FormatException을 throw합니다.
pl: Indywidualny specyfikator formatu „h” reprezentuje godzinę jako liczbę z zakresu od 1 do 12; tzn. godzina jest reprezentowana przez 12-godzinny zegar liczący pełne godziny od północy lub południa. Określona godzina po północy jest nie do odróżnienia od tej samej godziny po południu. Godzina nie jest zaokrąglana, a godzina 1-cyfrowa jest wyświetlana w formacie bez wiodącego zera. Na przykład w przypadku godziny 5:43 rano lub po południu ten indywidualny specyfikator formatu wyświetla wartość „5”. Jeśli specyfikator formatu „h” zostanie użyty bez innych indywidualnych specyfikatorów formatu, będzie interpretowany jako standardowy specyfikator daty i godziny i zwróci wyjątek FormatException.
pt_br: O especificador de formato personalizado "h" representa a hora como um número de 1 a 12. Ou seja, a hora é representada por um relógio de 12 horas que conta todas as horas desde a meia-noite ou o meio-dia. Uma determinada hora após a meia-noite é indistinguível da mesma hora após o meio-dia. A hora não é arredondada e uma hora de dígito único é formatada sem um zero à esquerda. Por exemplo, dado um horário de 5:43 na manhã ou à tarde, este especificador de formato personalizado exibe "5". Se o especificador de formato "h" for usado sem outros especificadores de formato personalizado, ele será interpretado como um especificador de formato padrão de data e hora e gerará uma FormatException.
ru: Описатель пользовательского формата "h" представляет час в виде числа от 1 до 12, то есть час представлен в 12-часовом формате, который подсчитывает целые часы, начиная с полуночи или с полудня. Определенный час после полуночи невозможно отличить от такого же часа после полудня. Значение часа не округляется, а значение часа из одной цифры форматируется без начального нуля. Например, для времени 5:43 утра или вечера этот описатель пользовательского формата выводит "5". Если описатель формата "h" используется без других описателей пользовательского формата, он интерпретируется как описатель стандартного формата даты и времени и вызывает исключение FormatException.
tr: "h" özel biçim belirticisi saati 1 ile 12 arasında bir sayı ile temsil eder; yani saat, gece yarısı veya öğleden beri geçen saat sayısını belirten 12 saatlik bir düzen ile temsil edilir. Gece yarısından sonraki belirli bir saat, öğleden sonraki aynı saatten ayırt edilemez. Saat yuvarlanmaz ve tek haneli bir saat, önüne sıfır konmadan biçimlendirilir. Örneğin, sabah veya öğleden sonra saat 5:43 için bu özel biçim belirticisi "5" görüntüler. "h" biçim belirticisi başka özel biçim belirticileri olmadan kullanılırsa, standart bir tarih ve saat biçimi belirticisi olarak yorumlanır ve bir FormatException oluşturur.
zh_hans: "h" 自定义格式说明符将小时表示为从 1 到 12 的数字；即通过 12 小时制表示小时，自午夜或中午开始对整小时计数。因此，午夜后经过的某特定小时数与中午过后的相同小时数无法加以区分。小时数不进行舍入，一位数字的小时数设置为不带前导零的格式。例如，给定上午或下午时间为 5:43，则此自定义格式说明符显示为 "5"。 如果使用 "h" 格式说明符而没有其他自定义格式说明符，该说明符将被解释为标准日期和时间格式说明符，并引发 FormatException。
zh_hant: "h" 自訂格式規範代表小時，以數字 1 到 12 表示; 換句話說，小時即為自午夜或中午起所經過的整數時數，是 12 小時制。午夜後經過特定小時數與中午後經過相同的小時數，會無法區別。小時不會四捨五入，而單一數字的小時格式，開頭不會出現零。例如，假設時間為上午或下午的 5:43，此自訂格式規範會顯示 "5"。 如果在使用 "h" 格式規範時沒有其他自訂格式規範，則會將其解譯為標準日期與時間格式規範，並擲回 FormatException。
