Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Can't compare positions from different text snapshots
cs: Nejde porovnat pozice z různých textových snímků.
de: Positionen aus unterschiedlichen Textmomentaufnahmen konnten nicht verglichen werden
es: No se puede comparar posiciones desde distintas instantáneas de texto
fr: Impossible de comparer les positions de différents instantanés de texte
it: Non è possibile confrontare le posizioni da snapshot testo diversi
ja: 異なるテキスト スナップショットから位置を比較できません
ko: 다른 텍스트 스냅샷에서 위치를 비교할 수 없습니다.
pl: Nie można porównać pozycji z różnych migawek tekstu
pt_br: Não é possível comparar as posições de instantâneos de textos diferentes
ru: Не удается сравнить позиции из различных снимков текста
tr: Konumlar farklı metin anlık görüntülerinden karşılaştırılamıyor
zh_hans: 无法比较不同文本快照的位置
zh_hant: 無法比較不同文字快照的位置

source: XML Doc Comments - Entity Reference
cs: Komentáře XML – odkaz na entitu
de: XML-Dok-Kommentare - Entitätsverweis
es: Comentarios de documentación XML: referencia de entidad
fr: Commentaires documentation XML - Référence de l'entité
it: Commenti in formato documentazione XML - Riferimento a entità
ja: XML ドキュメント コメント - エンティティ参照
ko: XML 문서 주석 - 엔터티 참조
pl: Komentarze dokumentacji XML — odwołanie do jednostki
pt_br: Comentário da documentação XML - Referência de Entidade
ru: Комментарии XML Doc — ссылки на сущности
tr: XML Belge Açıklamaları - Varlık Başvurusu
zh_hans: XML 文档注释 - 实体引用
zh_hant: XML 文件註解 - 實體參考

source: XML Doc Comments - Name
cs: Komentáře XML – název
de: XML-Dok-Kommentare - Name
es: Comentarios de documentación XML: nombre
fr: Commentaires documentation XML - Nom
it: Commenti in formato documentazione XML - Nome
ja: XML ドキュメント コメント - 名前
ko: XML 문서 주석 - 이름
pl: Komentarze dokumentacji XML — nazwa
pt_br: Comentário da documentação XML - Nome
ru: Комментарии XML-документа — имя
tr: XML Belge Açıklamaları - Ad
zh_hans: XML 文档注释 - 名称
zh_hant: XML 文件註解 - 名稱

source: XML Doc Comments - Processing Instruction
cs: Komentáře XML – pokyn ke zpracování
de: XML-Dok-Kommentare - Verarbeitungsanweisung
es: Comentarios de documentación XML: instrucción de procesamiento
fr: Commentaires documentation XML - Instruction de traitement
it: Commenti in formato documentazione XML - Istruzione di elaborazione
ja: XML ドキュメント コメント - 処理命令
ko: XML 문서 주석 - 처리 명령
pl: Komentarze dokumentacji XML — instrukcja przetwarzania
pt_br: Comentário da documentação XML - Instrução de Processamento
ru: Комментарии XML Doc — инструкции по обработке
tr: XML Belge Açıklamaları - İşleme Yönergesi
zh_hans: XML 文档注释 - 处理指令
zh_hant: XML 文件註解 - 處理指示

source: Active Statement
cs: Aktivní příkaz
de: Aktive Anweisung
es: Instrucción de acción
fr: Instruction active
it: Istruzione attiva
ja: アクティブなステートメント
ko: 활성 문
pl: Aktywna instrukcja
pt_br: Instrução Ativa
ru: Активный оператор
tr: Etkin Deyim
zh_hans: 活动语句
zh_hant: 現用陳述式

source: Loading Peek information...
cs: Načítají se informace pro náhled...
de: Vorschauinformationen werden geladen...
es: Cargando información para ver el código sin salir...
fr: Chargement des informations d'aperçu...
it: Caricamento delle informazioni di anteprima...
ja: ピーク情報を読み込んでいます...
ko: 정보 피킹을 로드하는 중...
pl: Trwa ładowanie informacji o wglądzie...
pt_br: Carregando informações de Espiada...
ru: Загрузка информации обзора...
tr: Göz Atma bilgileri yükleniyor...
zh_hans: 正在加载速览信息…
zh_hant: 正在載入瞄核資訊...

source: Peek
cs: Náhled
de: Einsehen
es: Ver el código sin salir
fr: Aperçu
it: Anteprima
ja: ピーク
ko: 피킹
pl: Wgląd
pt_br: Espiada
ru: Обзор
tr: Göz At
zh_hans: 速览
zh_hant: 瞄核

# Apply1
source: _Apply
cs: _Aplikovat
de: Ü_bernehmen
es: _Aplicar
fr: _Appliquer
it: _Applica
ja: 適用(_A)
ko: 적용(_A)
pl: _Zastosuj
pt_br: _Aplicar
ru: _Применить
tr: _Uygula
zh_hans: 应用(_A)
zh_hant: 套用(_A)

source: Include _overload(s)
cs: Za_hrnout přetížení
de: _Overload(s) einbeziehen
es: Incluir _sobrecarga(s)
fr: Inclure les _surchages
it: Includi _overload
ja: オーバーロードを含める(_O)
ko: 오버로드 포함(_O)
pl: Uwzględnij prz_eciążenia
pt_br: Incluir _overload(s)
ru: Включить _перегрузки
tr: _Aşırı yükleme ekle
zh_hans: 包括重载(_O)
zh_hant: 包含多載( _O)

source: Include _comments
cs: Zahrnout _komentáře
de: _Kommentare einbeziehen
es: Incluir _comentarios
fr: Inclure les _commentaires
it: Includi _commenti
ja: コメントを含める(_C)
ko: 주석 포함(_C)
pl: Uwzględnij _komentarze
pt_br: Incluir _comments
ru: Включить _комментарии
tr: _Açıklamaları ekle
zh_hans: 包括备注(_C)
zh_hant: 包括註解( _C)

source: Include _strings
cs: _Zahrnout řetězce
de: _Zeichenfolgen einbeziehen
es: Incluir _cadenas
fr: Inclure les _chaînes
it: Includi _stringhe
ja: 文字列を含める(_S)
ko: 문자열 포함(_S)
pl: Uwzględnij _ciągi
pt_br: Incluir _strings
ru: Включить _строки
tr: _Dizeleri Ekle
zh_hans: 包括字符串(_S)
zh_hant: 包括字串( _S)

# Apply2
source: Apply
cs: Použít
de: Anwenden
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
ko: 적용
pl: Zastosuj
pt_br: Aplicar
ru: Применить
tr: Uygula
zh_hans: 应用
zh_hant: 套用

source: Change Signature
cs: Změnit signaturu
de: Signatur ändern
es: Cambiar firma
fr: Modifier la signature
it: Cambia firma
ja: 署名の変更
ko: 시그니처 변경
pl: Zmień sygnaturę
pt_br: Alterar Assinatura
ru: Изменить сигнатуру
tr: İmzayı Değiştir
zh_hans: 更改签名
zh_hant: 變更簽章

source: Preview Changes - {0}
cs: Náhled změn – {0}
de: Vorschau der Änderungen - {0}
es: Vista previa de los cambios: {0}
fr: Aperçu des modifications - {0}
it: Anteprima modifiche - {0}
ja: 変更のプレビュー - {0}
ko: 변경 내용 미리 보기 - {0}
pl: Podgląd zmian — {0}
pt_br: Visualizar Alterações - {0}
ru: Просмотреть изменения — {0}
tr: Değişiklikleri Ön İzle - {0}
zh_hans: 预览更改 - {0}
zh_hant: 預覽變更 - {0}

# Preview_Code_Changes_colon
source: Preview Code Changes:
cs: Náhled změn kódu:
de: Vorschau der Codeänderungen:
es: Vista previa de cambios de código:
fr: Aperçu des modifications du code :
it: Anteprima modifiche codice:
ja: コード変更のプレビュー:
ko: 코드 변경 내용 미리 보기:
pl: Podgląd zmian kodu:
pt_br: Visualizar Alterações de Código:
ru: Просмотр изменений кода:
tr: Kod Değişikliklerini Ön İzle:
zh_hans: 预览代码更改:
zh_hant: 預覽程式碼變更:

source: Preview Changes
cs: Náhled změn
de: Vorschau der Änderungen
es: Vista previa de los cambios
fr: Aperçu des modifications
it: Anteprima modifiche
ja: 変更のプレビュー
ko: 변경 내용 미리 보기
pl: Podgląd zmian
pt_br: Visualizar Alterações
ru: Просмотреть изменения
tr: Değişiklikleri Önizle
zh_hans: 预览更改
zh_hant: 預覽變更

source: Format Paste
it: Formatta testo incollato
ja: 書式の貼り付け
pl: Formatuj wklejoną zawartość
tr: Yapıştırmayı Biçimlendir
zh_hans: 格式粘贴

source: Formatting pasted text...
cs: Formátuje se vložený text...
de: Eingefügter Text wird formatiert...
es: Dando formato al texto pegado...
fr: Mise en forme du texte collé...
it: Formattazione del testo incollato...
ja: 貼り付けたテキストを書式設定しています...
ko: 붙여넣은 텍스트의 서식을 지정하는 중...
pl: Trwa formatowanie wklejonego tekstu...
pt_br: Formatando texto colado...
ru: Идет форматирование вставленного текста...
tr: Yapıştırılan metin biçimlendiriliyor...
zh_hans: 正在设置已粘贴文本的格式...
zh_hant: 正在格式化貼上的文字...

source: The definition of the object is hidden.
cs: Definice objektu je skrytá.
de: Die Definition des Objekts ist ausgeblendet.
es: La definición del objeto está oculta.
fr: La définition de l'objet est masquée.
it: La definizione dell'oggetto è nascosta.
ja: オブジェクトの定義が非表示になっています。
ko: 개체의 정의가 숨겨집니다.
pl: Definicja obiektu jest ukryta.
pt_br: A definição do objeto está oculta.
ru: Определение объекта скрыто.
tr: Nesnenin tanımı gizlidir.
zh_hans: 对象的定义被隐藏。
zh_hant: 物件的定義為隱藏。

source: Automatic Formatting
cs: Automatické formátování
de: Automatische Formatierung
es: Formato automático
fr: Mise en forme automatique
it: Formattazione automatica
ja: 自動書式
ko: 자동 서식
pl: Formatowanie automatyczne
pt_br: Formatação Automática
ru: Автоматическое форматирование
tr: Otomatik Biçimlendirme
zh_hans: 自动设置格式
zh_hant: 自動格式化

source: We can fix the error by not making struct "out/ref" parameter(s). Do you want to proceed?
cs: Chybu můžeme opravit tím, že nevytvoříme parametry out/ref struktury. Chcete pokračovat?
de: Wir können den Fehler beheben, indem die Struktur der "out/ref"-Parameter nicht erstellt wird. Möchten Sie fortfahren?
fr: Nous pouvons corriger l'erreur en ne créant pas de paramètre(s) "out/ref" dans le struct. Voulez-vous continuer ?
it: Per correggere l'errore, non verranno creati i parametri "out/ref" dello struct. Continuare?
ja: 構造体の "out/ref" パラメーターを作成しないことによって、エラーを解決できます。 続行しますか?
ko: 구조체 "out/ref" 매개 변수를 만들지 않는 방법으로 오류를 수정할 수 있습니다. 계속하시겠습니까?
pl: Możemy naprawić ten błąd, pomijając utworzenie parametrów struktury „out/ref”. Czy chcesz kontynuować?
pt_br: Podemos corrigir o erro ao não fazer struct de parâmetro(s) "out/ref". Deseja continuar?
ru: Можно устранить ошибку без создания параметров "out/ref" структуры. Вы хотите продолжить?
tr: Yapı "out/ref" parametrelerini yapmayarak hatayı düzeltebiliriz. Devam etmek istiyor musunuz?
zh_hans: 通过不构建结构 "out/ref" 参数，可以修复此错误。 想要继续吗?

# Change_Signature_colon
source: Change Signature:
cs: Změnit signaturu:
de: Signatur ändern:
es: Cambiar firma:
fr: Modifier la signature :
it: Cambia firma:
ja: 署名の変更:
ko: 시그니처 변경:
pl: Zmień sygnaturę:
pt_br: Alterar Assinatura:
ru: Изменить сигнатуру:
tr: İmzayı Değiştir:
zh_hans: 更改签名:
zh_hant: 變更簽章:

# Rename_0_to_1_colon
source: Rename '{0}' to '{1}':
cs: Přejmenovat '{0}' na '{1}':
de: Bennennen Sie "{0}" in "{1}" um:
es: Cambiar el nombre de '{0}' a '{1}':
fr: Renommer '{0}' en '{1}' :
it: Rinomina '{0}' in '{1}':
ja: '{0}' の名前を '{1}' に変更します:
ko: '{0}'에서 '{1}'(으)로 이름 바꾸기:
pl: Zmień nazwę elementu „{0}” na „{1}”:
pt_br: Renomear '{0}' para '{1}':
ru: Переименование "{0}" в "{1}":
tr: '{0}' öğesini '{1}' olarak yeniden adlandır:
zh_hans: 将“{0}”重命名为“{1}”:
zh_hant: 將 '{0}' 重新命名為 '{1}':

# Encapsulate_Field_colon
source: Encapsulate Field:
cs: Obaluje pole:
de: Feld kapseln:
es: Encapsular campo:
fr: Encapsuler le champ :
it: Incapsula campo:
ja: フィールドのカプセル化:
ko: 필드 캡슐화:
pl: Hermetyzuj pole:
pt_br: Encapsular Campo:
ru: Инкапсулировать поле:
tr: Alanı Kapsa:
zh_hans: 封装字段:
zh_hant: 封裝欄位:

source: Call Hierarchy
cs: Hierarchie volání
de: Aufrufhierarchie
es: Jerarquía de llamadas
fr: Hiérarchie d'appels
it: Gerarchia di chiamata
ja: 呼び出し階層
ko: 호출 계층 구조
pl: Hierarchia wywołań
pt_br: Hierarquia de Chamada
ru: Иерархия вызовов
tr: Çağrı Hiyerarşisi
zh_hans: 调用层次结构
zh_hant: 呼叫階層

source: Calls To '{0}'
cs: Volání '{0}'
de: Aufrufe an "{0}"
es: Llamadas a '{0}'
fr: Appels à '{0}'
it: Chiamate a '{0}'
ja: '{0}' への呼び出し
ko: '{0}'에 대한 호출
pl: Wywołania elementu „{0}”
pt_br: Chamadas para '{0}'
ru: Вызовы к "{0}"
tr: '{0}' Öğesine Çağrılar
zh_hans: 调用“{0}”
zh_hant: 呼叫目標 '{0}'

source: Calls To Base Member '{0}'
cs: Volání základního členu '{0}'
de: Aufrufe an das Basismember "{0}"
es: Llamadas al miembro base '{0}'
fr: Appels au membre de base '{0}'
it: Chiamate al membro di base '{0}'
ja: 基本メンバー '{0}' への呼び出し
ko: '{0}' 기본 멤버에 대한 호출
pl: Wywołania składowej bazowej „{0}”
pt_br: Chamadas para Membro Base '{0}'
ru: Вызовы базового члена "{0}"
tr: Temel Üye '{0}' Çağrıları
zh_hans: 对基类成员“{0}”的调用
zh_hant: 呼叫至基底成員 '{0}'

source: Calls To Interface Implementation '{0}'
cs: Volání implementace rozhraní '{0}'
de: Aufrufe an die Schnittstellenimplementierung "{0}"
es: Llamadas a la implementación de interfaz '{0}'
fr: Appels à l'implémentation d'interface '{0}'
it: Chiamate all'implementazione dell'interfaccia '{0}'
ja: インターフェイスの実装 '{0}' への呼び出し
ko: '{0}' 인터페이스 구현에 대한 호출
pl: Wywołania implementacji interfejsu „{0}”
pt_br: Chamadas para Implementação de Interface '{0}'
ru: Вызовы реализации интерфейса "{0}"
tr: '{0}' Arayüz Uygulama Çağrıları
zh_hans: 对接口实现“{0}”的调用
zh_hant: 呼叫至介面實作 '{0}'

source: Computing Call Hierarchy Information
it: Elaborazione informazioni su gerarchia di chiamata
ja: 呼び出し階層情報を計算しています
pl: Informacje o hierarchii wywołań obliczeń
tr: Çağrı Hiyerarşisi Bilgileri Hesaplanıyor
zh_hans: 计算调用层次结构信息

source: Implements '{0}'
cs: Implementuje '{0}'
de: Implementiert "{0}"
es: Implementa '{0}'
fr: Implémente '{0}'
it: Implementa '{0}'
ja: '{0}' を実装します
ko: '{0}' 구현
pl: Implementuje element „{0}”
pt_br: Implementa '{0}'
ru: Реализует "{0}"
tr: '{0}' öğesini uygular
zh_hans: 实现“{0}”
zh_hant: 實作 '{0}'

source: Initializers
cs: Inicializátory
de: Initialisierer
es: Inicializadores
fr: Initialiseurs
it: Inizializzatori
ja: 初期化子
ko: 이니셜라이저
pl: Inicjatory
pt_br: Inicializadores
ru: Инициализаторы
tr: Başlatıcılar
zh_hans: 初始值设定项
zh_hant: 初始設定式

source: References To Field '{0}'
cs: Odkazy do pole '{0}'
de: Verweise auf Feld "{0}"
es: Referencias al campo '{0}'
fr: Références au champ '{0}'
it: Riferimenti al campo '{0}'
ja: フィールド '{0}' への参照
ko: '{0}' 필드에 대한 참조
pl: Odwołania do pola „{0}”
pt_br: Referências ao Campo '{0}'
ru: Ссылки на поле "{0}"
tr: '{0}' Alanına Yapılan Başvurular
zh_hans: 对字段“{0}”的引用
zh_hant: 參考欄位 '{0}'

source: Calls To Overrides
cs: Volání přepsaných
de: Aufrufe an Overrides
es: Llamadas a invalidaciones
fr: Appels aux substitutions
it: Chiamate agli override
ja: オーバーライドへの呼び出し
ko: 재정의에 대한 호출
pl: Wywołania przesłonięć
pt_br: Chamadas para Substituições
ru: Вызовы переопределений
tr: Geçersiz Kılma Çağrıları
zh_hans: 对重写的调用
zh_hant: 呼叫至覆寫

# Preview_changes1
source: _Preview changes
cs: _Náhled změn
de: _Änderungen in der Vorschau anzeigen
es: _Vista previa de cambios
fr: Afficher un a_perçu des modifications
it: _Anteprima modifiche
ja: 変更のプレビュー(_P)
ko: 변경 사항 미리 보기(_P)
pl: _Wyświetl podgląd zmian
pt_br: Alterações de _Preview
ru: _Изменения в предварительной версии
tr: Değişiklikleri _Önizle
zh_hans: 预览更改(_P)
zh_hant: 預覽變更(_P)

# Apply3
source: Apply
cs: Použít
de: Anwenden
fr: Appliquer
it: Applica
ja: 適用
ko: 적용
pl: Zastosuj
pt_br: Aplicar
ru: Применить
tr: Uygula
zh_hans: 应用

source: Cancel
cs: Zrušit
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
zh_hans: 取消
zh_hant: 取消

source: Changes
cs: Změny
de: Änderungen
es: Cambios
fr: Modifications
it: Modifiche
ja: 変更
ko: 변경 내용
pl: Zmiany
pt_br: Alterações
ru: Изменения
tr: Değişiklikler
zh_hans: 更改
zh_hant: 變更

# Preview_changes2
source: Preview changes
cs: Zobrazit náhled změn
de: Änderungen in Vorschau anzeigen
es: Vista previa de cambios
fr: Aperçu des modifications
it: Anteprima modifiche
ja: 変更のプレビュー
ko: 변경 내용 미리 보기
pl: Podgląd zmian
pt_br: Visualizar alterações
ru: Предварительный просмотр изменений
tr: Değişiklikleri önizle
zh_hans: 预览更改
zh_hant: 預覽變更

source: IntelliSense Commit Formatting
it: Formattazione commit IntelliSense
ja: IntelliSense のコミットの書式設定
pl: Formatowanie potwierdzenia funkcji IntelliSense
tr: IntelliSense Biçimlendirmeyi İşle
zh_hans: IntelliSense 提交格式

source: Rename Tracking
cs: Sledování přejmenování
de: Nachverfolgung umbenennen
es: Cambiar el nombre del seguimiento
fr: Renommer le suivi
it: Verifica ridenominazione
ja: 名前変更の追跡
ko: 추적 이름 바꾸기
pl: Śledzenie zmiany nazw
pt_br: Renomear Acompanhamento
ru: Отслеживание переименования
tr: İzlemeyi Yeniden Adlandır
zh_hans: 重命名跟踪
zh_hant: 重新命名追蹤

# Removing_0_from_1_with_content_colon
source: Removing '{0}' from '{1}' with content:
cs: Odebírání {0} z {1} s obsahem:
de: "{0}" wird aus "{1}" entfernt mit Inhalt:
es: Quitando "{0}" de "{1}" con contenido:
fr: Suppression de '{0}' dans '{1}' avec le contenu :
it: Rimozione di '{0}' da '{1}' con contenuto:
ja: コンテンツを含む '{0}' を '{1}' から削除しています:
ko: 다음 내용과 함께 '{1}'에서 '{0}'을(를) 제거 중:
pl: Usuwanie elementu „{0}” z elementu „{1}” z zawartością:
pt_br: Removendo '{0}' de '{1}' com conteúdo:
ru: Идет удаление "{0}" из "{1}" с содержимым:
tr: '{0}' öğesi, içeriği şu olan '{1}' öğesinden kaldırılıyor:
zh_hans: 将“{0}”连带内容从“{1}”删除:
zh_hant: 從包含下列內容的 '{1}' 移除 '{0}':

source: '{0}' does not support the '{1}' operation. However, it may contain nested '{2}'s (see '{2}.{3}') that support this operation.
it: '{0}' non supporta l'operazione '{1}', ma può contenere elementi '{2}' annidati (vedere '{2}.{3}') che supportano questa operazione.
ja: '{0}' は '{1}' の操作をサポートしません。ただし、この操作をサポートする入れ子になった '{2}' を含めることはできます ('{2}.{3}' を参照)。
pl: 'Element „{0}” nie obsługuje operacji „{1}”. Może jednak zawierać zagnieżdżone elementy {2} (zobacz „{2}.{3}”) obsługujące tę operację.
tr: '{0}', '{1}' işlemini desteklemiyor. Ancak bu işlemi destekleyen iç içe '{2}' (bkz. '{2}.{3}') içerebilir.
zh_hans: “{0}”不支持“{1}”操作。但是，它可能包含支持此操作的嵌套“{2}”(参见“{2}.{3}”)。

source: Brace Completion
cs: Uzavírání hranatých závorek
de: Klammerabschluss
es: Finalización de llave
fr: Fin de l'accolade
it: Completamento parentesi graffa
ja: かっこ完了
ko: 중괄호 완성
pl: Uzupełnianie nawiasów
pt_br: Preenchimento de Chaves
ru: Завершение скобок
tr: Küme Ayracı Tamamlama
zh_hans: 大括号完成
zh_hant: 以大括號完成

source: Cannot apply operation while a rename session is active.
cs: Operace nejde použít, pokud je aktivní relace přejmenování.
de: Der Vorgang kann nicht angewendet werden, während eine Umbenennungssitzung aktiv ist.
es: No se puede aplicar la operación mientras la sesión de cambio de nombre está activa.
fr: Impossible d'appliquer l'opération pendant qu'une session de changement de nom est active.
it: Non è possibile applicare l'operazione mentre è attiva una sessione di ridenominazione.
ja: 名前変更セッションがアクティブな間は、操作を適用できません。
ko: 이름 바꾸기 세션이 활성인 동안에는 작업을 적용할 수 없습니다.
pl: Nie można zastosować operacji, podczas gdy sesja zmiany nazwy jest aktywna.
pt_br: Não é possível aplicar a operação enquanto uma sessão de renomeação está ativa.
ru: Невозможно применить операцию при активном сеансе переименования.
tr: İşlem bir yeniden adlandırma oturumu etkinken uygulanamaz.
zh_hans: 重命名会话处于活动状态时无法应用操作。
zh_hant: 重新命名工作階段使用中時無法套用作業。

source: The rename tracking session was cancelled and is no longer available.
cs: Relace sledování přejmenování se zrušila a už není dostupná.
de: Die Nachverfolgungssitzung für den Umbenennungsvorgang wurde abgebrochen und ist nicht mehr verfügbar.
es: Se canceló la sesión de seguimiento de cambio de nombre y ya no está disponible.
fr: La session de suivi du changement de nom a été annulée, et n'est plus disponible.
it: La sessione di verifica della ridenominazione è stata annullata e non è più disponibile.
ja: 名前変更の追跡セッションが取り消され、使用できなくなりました。
ko: 이름 바꾸기 추적 세션이 취소되었고 더 이상 사용할 수 없습니다.
pl: Sesja śledzenia zmiany nazwy została anulowana i nie jest już dostępna.
pt_br: A sessão de acompanhamento de renomeação foi cancelada e não está mais disponível.
ru: Сеанс отслеживания переименования отменен и больше не доступен.
tr: Yeniden adlandırma izleme oturumu iptal edildi ve artık kullanılamaz.
zh_hans: 重命名跟踪会话已取消，且不再可用。
zh_hant: 重新命名追蹤工作階段已取消且無法使用。

source: Highlighted Written Reference
cs: Zvýrazněný písemný odkaz
de: Geschriebene Referenz hervorgehoben
es: Referencia por escrito resaltada
fr: Référence écrite mise en surbrillance
it: Riferimento scritto evidenziato
ja: 強調表示された書き込み参照
ko: 강조 표시되어 작성된 참조
pl: Wyróżnione zapisane odwołanie
pt_br: Referência Escrita Realçada
ru: Выделенная записанная ссылка
tr: Vurgulanan Yazılı Başvuru
zh_hans: 突出显示的书面引用
zh_hant: 反白顯示的書面參考

source: Cursor must be on a member name.
cs: Kurzor musí být na názvu člena.
de: Der Cursor muss sich auf einem Membernamen befinden.
es: El cursor debe estar sobre un nombre de miembro.
fr: Le curseur doit se trouver sur un nom de membre.
it: Il cursore deve trovarsi sul nome di un membro.
ja: カーソルはメンバー名の上に置く必要があります。
ko: 커서는 멤버 이름에 있어야 합니다.
pl: Kursor musi być na nazwie składowej.
pt_br: O cursor deve estar em um nome do membro.
ru: Курсор должен находиться на имени элемента.
tr: İmleç bir üye adının üstünde olmalıdır.
zh_hans: 游标必须位于成员名称。
zh_hant: 資料指標必須為成員名稱。

source: Brace Matching
cs: Párování závorek
de: Zugehörige Klammer
es: Coincidencia de llaves
fr: Correspondance des accolades
it: Corrispondenza parentesi graffe
ja: かっこの一致
ko: 중괄호 일치
pl: Dopasowywanie nawiasów klamrowych
pt_br: Correspondência de Chaves
ru: Соответствие скобок
tr: Ayraç Eşleştirme
zh_hans: 大括号匹配
zh_hant: 括號對稱

source: Locating implementations...
cs: Vyhledávají se implementace...
de: Implementierungen werden gesucht...
es: Buscando implementaciones...
fr: Recherche d'implémentations...
it: Individuazione delle implementazioni...
ja: 実装を探しています...
ko: 구현을 찾는 중...
pl: Trwa lokalizowanie implementacji...
pt_br: Localizando implementações...
ru: Поиск реализаций...
tr: Uygulamalar bulunuyor...
zh_hans: 正在查找实现...
zh_hant: 正在尋找實作...

source: Go To Implementation
cs: Přejít na implementaci
de: Zur Implementierung wechseln
es: Ir a implementación
fr: Accéder à l'implémentation
it: Vai all'implementazione
ja: 実装に移動
ko: 구현으로 이동
pl: Przejdź do implementacji
pt_br: Ir Para Implementação
ru: Перейти к реализации
tr: Uygulamaya Git
zh_hans: 转到实现
zh_hant: 前往實作

# New_name_colon_0
source: New name: {0}
cs: Nový název: {0}
de: Neuer Name: "{0}"
fr: Nouveau nom : {0}
it: Nuovo nome: {0}
ja: 新しい名前: {0}
ko: 새 이름: {0}
pl: Nowa nazwa: {0}
pt_br: Novo nome: {0}
ru: Новое имя: {0}
tr: Yeni ad: {0}
zh_hans: 新名称: {0}

source: Modify any highlighted location to begin renaming.
cs: Přejmenování zahájíte úpravou jakéhokoli zvýrazněného umístění.
de: Alle hervorgehobenen Speicherorte ändern, um mit dem Umbenennen zu beginnen.
fr: Modifiez les emplacements en surbrillance pour commencer le renommage.
it: Modificare eventuali percorsi evidenziati prima di avviare la ridenominazione.
ja: 名前の変更を始めるには、強調表示された場所を変更してください。
ko: 이름 변경을 시작할 강조 표시된 위치를 수정합니다.
pl: Aby rozpocząć zmienianie nazwy, zmodyfikuj wszystkie wyróżnione lokalizacje.
pt_br: Modifique qualquer local realçado para iniciar a renomeação.
ru: Измените любое выделенное место, чтобы начать переименование.
tr: Yeniden adlandırmaya başlamak için vurgulanan tüm konumları değiştirin.
zh_hans: 修改任意突出显示的位置以开始重命名。

source: Paste
cs: Vložit
de: Einfügen
es: Pegar
fr: Coller
it: Incolla
ja: 貼り付け
ko: 붙여넣기
pl: Wklej
pt_br: Colar
ru: Вставить
tr: Yapıştır
zh_hans: 粘贴
zh_hant: 貼上

source: Navigating...
cs: Probíhá navigace...
de: Navigation...
es: Navegando...
fr: Navigation...
it: Spostamento...
ja: 移動中...
ko: 탐색하는 중...
pl: Trwa przechodzenie...
pt_br: Navegando...
ru: Идет переход...
tr: Gidiliyor...
zh_hans: 正在导航...
zh_hant: 正在巡覽...

source: Suggestion ellipses (…)
it: Puntini di sospensione di suggerimento (…)
ja: 提案事項の省略記号 (…)
pl: Wielokropki sugestii (…)
tr: Öneri üç noktası (…)
zh_hans: 建议使用省略号(…)

source: '{0}' declarations
cs: 'Deklarace symbolů {0}
de: "{0}"-Deklarationen
es: 'Declaraciones de "{0}"
fr: 'Déclarations '{0}'
it: 'Dichiarazioni di '{0}'
ja: '{0}' の宣言
ko: '{0}' 선언
pl: 'Deklaracje „{0}”
pt_br: 'Declarações de '{0}'
ru: 'Объявления "{0}"
tr: '{0}' bildirimleri
zh_hans: “{0}”声明
zh_hant: '{0}' 宣告

source: Inline Rename Conflict
cs: Konflikt při přejmenovávání na řádku
de: Inlineumbenennungskonflikt
es: Conflicto de cambio de nombre en línea
fr: Conflit de changement de nom inline
it: Ridenominazione inline - Conflitto
ja: インラインの名前変更の競合
ko: 인라인 이름 바꾸기 충돌
pl: Rozwiązano konflikt z operacją zmiany nazwy wstawionego elementu
pt_br: Conflito de Renomeação Embutida
ru: Конфликт встроенного переименования
tr: Satır İçi Yeniden Adlandırma Çakışması
zh_hans: 内联重命名冲突
zh_hant: 內嵌重新命名衝突已解決

source: Inline Rename Field Background and Border
cs: Pozadí a ohraničení pole při přejmenovávání na řádku
de: Hintergrund und Rahmen des Felds zur Inlineumbenennung
es: Borde y fondo del campo de cambio de nombre en línea
fr: Arrière-plan et bordure du champ de changement de nom inline
it: Ridenominazione inline - Sfondo e bordo del campo
ja: インラインの名前変更フィールドの背景と枠線
ko: 인라인 이름 바꾸기 필드 배경 및 테두리
pl: Tło i obramowanie pola zmiany nazwy wstawionego elementu
pt_br: Borda e Tela de Fundo do Campo de Renomeação Embutida
ru: Цвет фона и цвет границы поля "Встроенное переименование"
tr: Satır İçi Alan Arka Planını ve Kenarlığı Yeniden Adlandır
zh_hans: 内联重命名字段背景或边框
zh_hant: 內嵌重新命名欄位的背景與框線
