Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# An_inline_rename_session_is_active_for_identifier_0
source: An inline rename session is active for identifier '{0}'. Invoke inline rename again to access additional options. You may continue to edit the identifier being renamed at any time.
cs: Relace přejmenování na řádku je pro identifikátor {0} aktivní. Pokud chcete získat přístup k dalším možnostem, znovu volejte přejmenování na řádku. Můžete kdykoli pokračovat v úpravách identifikátoru, který se přejmenovává.
de: Für den Bezeichner "{0}" ist eine Inline-Umbenennungssitzung aktiv. Rufen Sie die Inline-Umbenennung erneut auf, um auf zusätzliche Optionen zuzugreifen. Sie können den Bezeichner, der gerade umbenannt wird, jederzeit weiterbearbeiten.
fr: Une session de renommage inline est active pour l'identificateur '{0}'. Appelez à nouveau le renommage inline pour accéder à des options supplémentaires. Vous pouvez continuer à modifier l'identificateur renommé à tout moment.
ja: 識別子 '{0}' のインラインの名前変更セッションがアクティブです。追加オプションにアクセスするには、インラインの名前変更をもう一度呼び出します。名前を変更する識別子はいつでも引き続き編集できます。
ko: 식별자 '{0}'의 인라인 이름 바꾸기 세션이 활성 상태입니다. 추가 옵션에 액세스하려면 인라인 이름 바꾸기를 다시 호출하세요. 언제든지 이름을 바꾸려는 식별자를 계속 편집할 수 있습니다.
pl: Wbudowana sesja zmieniania nazwy jest aktywna dla identyfikatora „{0}”. Wywołaj ponownie wbudowane zmienianie nazwy, aby uzyskać dostęp do dodatkowych opcji. W dowolnym momencie możesz kontynuować edytowanie identyfikatora, którego nazwa jest zmieniana.
pt_br: Uma sessão de renomeação embutida está ativa para o identificador '{0}'. Invoque a renomeação embutida novamente para acessar opções adicionais. Você pode continuar a editar o identificador que está sendo renomeado a qualquer momento.
ru: Встроенный сеанс переименования активен для идентификатора "{0}". Снова вызовите встроенное переименование, чтобы получить доступ к дополнительным параметрам. Вы можете в любое время продолжить изменение переименованного идентификатора.
tr: '{0}' tanımlayıcısı için bir satır içi yeniden adlandırma oturumu etkin. Ek seçeneklere erişmek için satır içi yeniden adlandırmayı tekrar çağırın. İstediğiniz zaman yeniden adlandırılan tanımlayıcıyı düzenlemeye devam edebilirsiniz.
zh_hans: 标识符“{0}”的内联重命名会话处于活动状态。再次调用内联重命名以访问其他选项。可随时继续编辑正在重命名的标识符。

source: Applying changes
cs: Aplikují se změny.
de: Änderungen werden übernommen
es: Aplicando cambios
fr: Application des changements
it: Applicazione delle modifiche in corso
ja: 変更の適用
ko: 변경 내용 적용
pl: Stosowanie zmian
pt_br: Aplicando mudanças
ru: Применение изменений
tr: Değişiklikler uygulanıyor
zh_hans: 应用更改
zh_hant: 正在套用變更

source: Cannot navigate to the symbol under the caret.
cs: Nejde navigovat k symbolu pod stříškou.
de: Navigieren zu dem Symbol unter dem Caret nicht möglich.
fr: Impossible de naviguer jusqu'au symbole sous le caret.
it: Non è possibile passare al simbolo sotto il punto di inserimento.
ja: カレットの下のシンボルに移動できません。
ko: 캐럿에서 기호를 탐색할 수 없습니다.
pt_br: Não é possível navegar para o símbolo sob o cursor.
ru: Не удается перейти к символу, на котором находится курсор.
tr: Giriş işareti altında sembole gidilemiyor.
zh_hans: 无法导航到插入点下面的符号。

source: Change configuration
it: Cambia la configurazione
ja: 構成の変更
pl: Zmień konfigurację
tr: Değiştir yapılandırma
zh_hans: 更改配置

source: Code cleanup is not configured
it: La pulizia del codice non è configurata
ja: コード クリーンアップは構成されていません
pl: Nie skonfigurowano oczyszczania kodu
tr: Kod temizleme yapılandırılmadı
zh_hans: 未配置代码清理

source: Configure it now
it: Configura ora
ja: 今すぐ構成する
pl: Skonfiguruj je teraz
tr: Hemen yapılandırın
zh_hans: 立即配置

source: Do not prefer 'this.' or 'Me.'
cs: Nepreferovat this. ani Me.
de: "this." oder "Me." nicht bevorzugen
es: No preferir "this." ni "Me."
fr: Ne pas préférer 'this.' ou 'Me.'
ko: 'this.' 또는 'Me.'를 기본으로 사용하지 마세요.
pl: Nie preferuj zapisu „this.” lub „me.”
pt_br: Não preferir 'this.' nem 'Me'.
ru: Не предпочитать "this." или "Me".
tr: 'this.' veya 'Me.' tercih etme
zh_hans: 不首选 "this." 或 "Me."
zh_hant: 不建議使用 'this.' 或 'Me.'

source: Do not show this message again
it: Non visualizzare più questo messaggio
ja: 今後、このメッセージを表示しない
pl: Nie pokazuj tego komunikatu ponownie
tr: Bu iletiyi bir daha gösterme
zh_hans: 不再显示此消息

source: Do you still want to proceed? This may produce broken code.
cs: Chcete přesto pokračovat? Výsledkem může být poškozený kód.
de: Möchten Sie dennoch fortfahren? Möglicherweise wird fehlerhafter Code generiert.
es: ¿Desea continuar? Esto puede producir código roto.
fr: Voulez-vous continuer ? Le code sera interrompu.
it: Procedere comunque? Il codice ottenuto potrebbe essere danneggiato.
ja: 続行しますか。破損状態のコードが生成される可能性があります。
ko: 계속하시겠습니까? 계속하면 손상된 코드가 생성될 수 있습니다.
pl: Czy nadal chcesz kontynuować? Może to spowodować uszkodzenie kodu.
pt_br: Ainda quer continuar? Isso pode produzir código desfeito.
ru: Вы действительно хотите продолжить? Это может привести к появлению нерабочего кода.
tr: Yine de devam etmek istiyor musunuz? Bu işlem sonucunda bozuk kod oluşturulabilir.
zh_hans: 是否仍要继续? 这可能会导致代码损坏。
zh_hant: 仍要繼續嗎? 這可能產生中斷的程式碼。

source: Execute Suggested Action
cs: Provést navrhovanou akci
de: Vorgeschlagene Aktion ausführen
es: Ejecutar acción recomendada
fr: Exécuter l'action suggérée
ko: 제안된 작업 실행
pl: Wykonaj sugerowaną akcję
pt_br: Executar a Ação Sugerida
ru: Выполнить предложенное действие
tr: Önerilen Eylemi Yürüt
zh_hans: 执行建议的操作
zh_hant: 執行建議動作

# Expander_display_text
source: items from unimported namespaces
cs: položky z neimportovaných oborů názvů
de: Elemente aus nicht importierten Namespaces
es: elementos de espacios de nombres no importados
fr: éléments provenant d'espaces de noms non importés
ja: インポートされていない名前空間の項目
ko: 가져오지 않은 네임스페이스의 항목
pl: elementy z nieimportowanych przestrzeni nazw
pt_br: itens de namespaces não importados
ru: элементы из неимпортированных пространств имен
tr: içeri aktarılmayan ad alanlarındaki öğeler
zh_hans: 未导入命名空间中的项
zh_hant: 來自未匯入命名空間的項目

# Expander_image_element
source: Expander
cs: Rozbalování
de: Erweiterung
es: Expansor
ja: 展開コントロール
ko: 확장기
pl: Ekspander
pt_br: Expansor
ru: Расширитель
tr: Genişletici
zh_hans: 扩展器
zh_hant: 展開器

source: Extract method encountered the following issues:
cs: Při extrahování metody došlo k následujícím problémům:
de: Beim Extrahieren der Methode sind folgende Fehler aufgetreten:
es: El método de extracción detectó los siguientes problemas:
fr: La méthode Extract a rencontré les problèmes suivants :
it: Il metodo di estrazione ha rilevato i problemi seguenti:
ja: メソッドの抽出で次の問題が発生しました:
ko: 메서드 추출에서 다음 문제가 발생했습니다.
pl: Metoda ekstrakcji napotkała następujące problemy:
pt_br: O método de extração encontrou os seguintes problemas:
ru: При работе метода извлечения возникли следующие ошибки:
tr: Ayıklama metodu aşağıdaki sorunlarla karşılaştı:
zh_hans: Extract 方法遇到以下问题:
zh_hant: 擷取方法發生下列問題:

# Filter_image_element
source: Filter
cs: Filtr
es: Filtrar
fr: Filtrer
it: Filtro
ja: フィルター
ko: 필터
pl: Filtr
pt_br: Filtrar
ru: Фильтр
tr: Filtre
zh_hans: 筛选
zh_hant: 篩選

source: Format Document performed additional cleanup
it: Formatta documento ha eseguito una pulizia aggiuntiva
ja: ドキュメントのフォーマットで追加のクリーンアップが実行されました
pl: Funkcja formatowania dokumentu wykonała dodatkowe czyszczenie
tr: Biçimi belge ek temizleme işlemi
zh_hans: 格式文档执行了额外的清理

source: Get help for '{0}'
cs: Získat nápovědu pro: {0}
de: Hilfe zu "{0}" abrufen
es: Obtener ayuda para "{0}"
fr: Obtenir de l'aide pour '{0}'
ko: '{0}'에 대한 도움 받기
pl: Uzyskaj pomoc dla „{0}”
pt_br: Obter ajuda para '{0}'
ru: Получить справку для "{0}"
tr: '{0}' için yardım alın
zh_hans: 获取有关“{0}”的帮助
zh_hant: 取得 '{0}' 的說明

source: Gathering Suggestions - '{0}'
pl: Zbieranie sugestii — „{0}”
tr: Öneriler Toplanıyor - '{0}'
zh_hans: 正在收集建议 -“{0}”

source: Gathering Suggestions - Waiting for the solution to fully load
pl: Zbieranie sugestii — oczekiwanie na pełne załadowanie rozwiązania
tr: Öneriler Toplanıyor - Çözümün tam olarak yüklenmesi bekleniyor
zh_hans: 正在收集建议 - 正在等待解决方案完全加载

source: Go To Base
cs: Přejít na základní typ
de: Zu Basis wechseln
es: Ir a base
fr: Accéder à la base
ja: 基本へ移動
ko: 기본으로 이동
pl: Przejdź do podstawy
pt_br: Ir Para a Base
ru: Перейти к базовому
tr: Tabana Git
zh_hans: 转到基础映像
zh_hant: 移至基底

# In_arithmetic_binary_operators
source: In arithmetic operators
cs: V aritmetických operátorech
de: In arithmetischen Operatoren
es: En los operadores aritméticos
fr: Dans les opérateurs arithmétiques
ko: 산술 연산자
pl: W operatorach arytmetycznych
pt_br: Em operadores aritméticos
ru: В арифметических операторах
tr: Aritmetik operatörlerde
zh_hans: 在算术运算符中
zh_hant: 在算術運算子中

source: In other binary operators
cs: V jiných binárních operátorech
de: In anderen binären Operatoren
es: En otros operadores binarios
fr: Dans d'autres opérateurs binaires
ko: 기타 이항 연산자
pl: W innych operatorach binarnych
pt_br: Em outros operadores binários
ru: В других бинарных операторах
tr: Diğer ikili operatörlerde
zh_hans: 在其他二进制运算符中
zh_hant: 在其他二元運算子中

# In_relational_binary_operators
source: In relational operators
cs: V relačních operátorech
de: In relationalen Operatoren
es: En los operadores relacionales
fr: Dans les opérateurs relationnels
ko: 관계 연산자
pl: W operatorach relacyjnych
pt_br: Em operadores relacionais
ru: В реляционных операторах
tr: İlişkisel operatörlerde
zh_hans: 在关系运算符中
zh_hant: 在關係運算子中

source: Indentation Size
cs: Velikost odsazení
de: Einzugsgröße
es: Tamaño de sangría
fr: Taille de la mise en retrait
ko: 들여쓰기 크기
pl: Rozmiar wcięcia
pt_br: Tamanho do Recuo
ru: Размер отступа
tr: Girintileme Boyutu
zh_hans: 缩进大小
zh_hant: 縮排大小

source: Inline Diagnostics - Error
cs: Vložená diagnostika – Chyba
de: Inline-Diagnose – Fehler
es: Diagnósticos integrados: error
fr: Diagnostics en ligne – Erreur
ko: 인라인 진단 - 오류
pl: Diagnostyka w tekście — błąd
pt_br: Diagnóstico em linha - Erro
ru: Встроенная диагностика — ошибка
tr: Satır İçi Tanılama - Hata
zh_hans: 内联诊断 - 错误
zh_hant: 內嵌診斷 - 錯誤

source: Inline Diagnostics - Rude Edit
cs: Vložená diagnostika – Hrubá úprava
de: Inlinediagnose – NIcht unterstützte Bearbeitung
es: Diagnósticos integrados: edición superficial
fr: Diagnostics en ligne – Modification grossière
ko: 인라인 진단 - Rude 편집
pl: Diagnostyka w tekście — edycja nagła
pt_br: Diagnóstico em linha - Edição Rudimentar
ru: Встроенная диагностика — грубое редактирование
tr: Satır İçi Tanılama - İşlenmemiş Düzenleme
zh_hans: 内联诊断 - 原始编辑
zh_hant: 內嵌診斷 - 粗略編輯

source: Inline Diagnostics - Warning
cs: Vložená diagnostika – Upozornění
de: Inline-Diagnose – Warnung
es: Diagnóstico integrado: advertencia
fr: Diagnostics en ligne – Avertissement
ko: 인라인 진단 - 경고
pl: Diagnostyka w tekście — ostrzeżenie
pt_br: Diagnóstico em linha - Aviso
ru: Встроенная диагностика — предупреждение
tr: Satır İçi Tanılama - Uyarı
zh_hans: 内联诊断 - 警告
zh_hant: 內嵌診斷 - 警告

source: Inline Hints
cs: Vložené nápovědy
de: Inlinehinweise
es: Sugerencias insertadas
fr: Indicateurs inline
ja: インラインのヒント
ko: 인라인 힌트
pl: Wskazówki w tekście
pt_br: Dicas Embutidas
ru: Встроенные подсказки
tr: Satır İçi İpuçları
zh_hans: 内联提示
zh_hant: 內嵌提示

source: Insert Final Newline
cs: Vložit poslední nový řádek
de: Abschließenden Zeilenumbruch einfügen
es: Insertar nueva línea final
fr: Insérer une nouvelle ligne finale
ko: 최종 줄 바꿈 삽입
pl: Wstaw końcowy znak nowego wiersza
pt_br: Inserir Nova Linha Final
ru: Вставить заключительную новую строку
tr: Son Yeni Satır Ekle
zh_hans: 在最后插入一个新行
zh_hant: 插入最後一個新行

source: Invalid assembly name
cs: Neplatný název sestavení
de: Ungültiger Assemblyname.
es: Nombre de ensamblado no válido
fr: Nom d'assembly non valide
it: Nome di assembly non valido
ja: 無効なアセンブリ名
ko: 잘못된 어셈블리 이름
pl: Nieprawidłowa nazwa zestawu
pt_br: Nome do assembly inválido
ru: Недопустимое имя сборки
tr: Geçersiz derleme adı
zh_hans: 程序集名称无效
zh_hant: 組件名稱無效

source: Invalid characters in assembly name
cs: Neplatné znaky v názvu sestavení
de: Assemblyname enthält ungültige Zeichen.
es: Caracteres no válidos en el nombre de ensamblado
fr: Caractères non valides dans le nom de l'assembly
it: Caratteri non validi nel nome dell'assembly
ja: アセンブリ名に無効な文字があります
ko: 어셈블리 이름에 잘못된 문자가 있음
pl: Nieprawidłowe znaki w nazwie zestawu
pt_br: Caracteres inválidos no nome do assembly
ru: Недопустимые символы в имени сборки
tr: Derleme adında geçersiz karakterler
zh_hans: 程序集名称中有无效字符
zh_hant: 組件名稱包含無效的字元

source: JSON in string literal - Array
cs: JSON v řetězcovém literálu – pole
de: JSON im Zeichenfolgenliteral – Array
es: JSON en el literal de cadena: matriz
fr: JSON dans le littéral de chaîne - Tableau
ko: 문자열 리터럴의 JSON - 배열
pt_br: JSON na literal da cadeia de caractere — Matriz
ru: JSON в строковом литерале — массив
tr: Sabit değerli dizede JSON - Dizi
zh_hans: 字符串字面量中的 JSON - 数组
zh_hant: 字串常值中的 JSON - 陣列

source: JSON in string literal - Comment
cs: JSON v řetězcovém literálu – komentář
de: JSON im Zeichenfolgenliteral – Kommentar
es: JSON en el literal de cadena: comentario
fr: JSON dans le littéral de chaîne - Commentaire
ko: 문자열 리터럴의 JSON - 주석
pt_br: JSON na literal da cadeia de caractere — Comentário
ru: JSON в строковом литерале — комментарий
tr: Sabit değerli dizede JSON - Açıklama
zh_hans: 字符串字面量中的 JSON - 注释
zh_hant: 字串常值中的 JSON - 註解

source: JSON in string literal - Constructor Name
cs: JSON v řetězcovém literálu – název konstruktoru
de: JSON im Zeichenfolgenliteral – Konstruktorname
es: JSON en el literal de cadena: nombre del constructor
fr: JSON dans le littéral de chaîne - Nom du constructeur
ko: 문자열 리터럴의 JSON - 생성자 이름
pt_br: JSON na literal da cadeia de caractere — Nome do Construtor
ru: JSON в строковом литерале — имя конструктора
tr: Sabit değerli dizede JSON - Oluşturucu Adı
zh_hans: 字符串字面量中的 JSON - 构造函数名称
zh_hant: 字串常值中的 JSON - 建構函式名稱

source: JSON in string literal - Keyword
cs: JSON v řetězcovém literálu – klíčové slovo
de: JSON im Zeichenfolgenliteral – Schlüsselwort
es: JSON en el literal de cadena: palabra clave
fr: JSON dans le littéral de chaîne - Mot clé
ko: 문자열 리터럴의 JSON - 키워드
pt_br: JSON na literal da cadeia de caractere — Palavra-Chave
ru: JSON в строковом литерале — ключевое слово
tr: Sabit değerli dizede JSON - Anahtar sözcük
zh_hans: 字符串字面量中的 JSON - 关键字
zh_hant: 字串常值中的 JSON - 關鍵字

source: JSON in string literal - Number
cs: JSON v řetězcovém literálu – číslo
de: JSON im Zeichenfolgenliteral – Zahl
es: JSON en el literal de cadena: número
fr: JSON dans le littéral de chaîne - Numéro
ko: 문자열 리터럴의 JSON - 숫자
pt_br: JSON na literal da cadeia de caractere — Número
ru: JSON в строковом литерале — число
tr: Sabit değerli dizede JSON - Sayı
zh_hans: 字符串字面量中的 JSON - 数字
zh_hant: 字串常值中的 JSON - 數字

source: JSON in string literal - Object
cs: JSON v řetězcovém literálu – objekt
de: JSON im Zeichenfolgenliteral – Objekt
es: JSON en el literal de cadena: objeto
fr: JSON dans le littéral de chaîne - Objet
ko: 문자열 리터럴의 JSON - 개체
pt_br: JSON na literal da cadeia de caractere — Objeto
ru: JSON в строковом литерале — объект
tr: Sabit değerli dizede JSON - Nesne
zh_hans: 字符串字面量中的 JSON - 对象
zh_hant: 字串常值中的 JSON - 物件

source: JSON in string literal - Operator
cs: JSON v řetězcovém literálu – operátor
de: JSON im Zeichenfolgenliteral – Operator
es: JSON en el literal de cadena: operador
fr: JSON dans le littéral de chaîne - Opérateur
ko: 문자열 리터럴의 JSON - 연산자
pt_br: JSON na literal da cadeia de caractere — Operador
ru: JSON в строковом литерале — оператор
tr: Sabit değerli dizede JSON - İşleç
zh_hans: 字符串字面量中的 JSON - 运算符
zh_hant: 字串常值中的 JSON - 運算子

source: JSON in string literal - Property Name
cs: JSON v řetězcovém literálu – název vlastnosti
de: JSON im Zeichenfolgenliteral – Eigenschaftenname
es: JSON en el literal de cadena: nombre de propiedad
fr: JSON dans le littéral de chaîne - Nom de la propriété
ko: 문자열 리터럴의 JSON - 속성 이름
pt_br: JSON na literal da cadeia de caractere — Nome da Propriedade
ru: JSON в строковом литерале — имя свойства
tr: Sabit değerli dizede JSON - Özellik Adı
zh_hans: 字符串字面量中的 JSON - 属性名称
zh_hant: 字串常值中的 JSON - 屬性名稱

source: JSON in string literal - Punctuation
cs: JSON v řetězcovém literálu – interpunkce
de: JSON im Zeichenfolgenliteral – Interpunktion
es: JSON en el literal de cadena: puntuación
fr: JSON dans le littéral de chaîne - Ponctuation
ko: 문자열 리터럴의 JSON - 문장 부호
pt_br: JSON na literal da cadeia de caractere — Pontuação
ru: JSON в строковом литерале — пунктуация
tr: Sabit değerli dizede JSON - Noktalama
zh_hans: 字符串字面量中的 JSON - 标点符号
zh_hant: 字串常值中的 JSON - 標點符號

source: JSON in string literal - String
cs: JSON v řetězcovém literálu – řetězec
de: JSON im Zeichenfolgenliteral – Zeichenfolge
es: JSON en el literal de cadena: cadena
fr: JSON dans le littéral de chaîne - Chaîne
ko: 문자열 리터럴의 JSON - 문자열
pt_br: JSON na literal da cadeia de caractere — Cadeia de Caracteres
ru: JSON в строковом литерале — строка
tr: Sabit değerli dizede JSON - Dize
zh_hans: 字符串字面量中的 JSON - 字符串
zh_hant: 字串常值中的 JSON - 字串

source: JSON in string literal - Text
cs: JSON v řetězcovém literálu – text
de: JSON im Zeichenfolgenliteral – Text
es: JSON en el literal de cadena: texto
fr: JSON dans le littéral de chaîne - Texte
ko: 문자열 리터럴의 JSON - 텍스트
pt_br: JSON na literal da cadeia de caractere — Texto
ru: JSON в строковом литерале — текст
tr: Sabit değerli dizede JSON - Metin
zh_hans: 字符串字面量中的 JSON - 文本
zh_hant: 字串常值中的 JSON - 文字

source: Keyword - Control
cs: Klíčové slovo – Control
de: Schlüsselwort – Steuerung
es: Palabras clave: control
fr: Mot clé - contrôle
it: Parola chiave - Controllo
ja: キーワード - コントロール
ko: 키워드 - 제어
pl: Słowo kluczowe — kontrolka
pt_br: Palavra-chave – Controle
ru: Ключевое слово — управление
tr: Anahtar Sözcük - Denetim
zh_hans: 关键字-控制
zh_hant: 關鍵字 - 控制項

# Language_client_initialization_failed
source: {0} failed to initialize. Status = {1}. Exception = {2}
cs: Inicializace {0} se nepodařila. Stav = {1}. Výjimka = {2}
de: {0} konnte nicht initialisiert werden. Status = {1}. Ausnahme = {2}
es: No se pudo inicializar {0}. Estado = {1}. Excepción = {2}
fr: {0} n’a pas pu s’initialiser. État = {1}. Exception = {2}
ko: {0}을(를) 초기화하지 못했습니다. 상태 = {1}. 예외 = {2}
pl: Zainicjowanie języka {0} zakończyło się niepowodzeniem. Stan = {1}. Wyjątek = {2}
pt_br: {0} falhou ao inicializar. Status = {1}. Exceção = {2}
ru: Не удалось инициализировать {0}. Состояние = {1}. Исключение = {2}
tr: {0} başlatılamadı. Durum = {1}. Özel durum = {2}
zh_hans: 无法初始化 {0}。状态 = {1}。异常 = {2}
zh_hant: {0} 無法初始化。狀態 = {1}。例外狀況 = {2}

source: Locating bases...
cs: Hledají se báze...
de: Basen werden gesucht...
es: Buscando las bases...
fr: Localisation des bases...
ja: ベースを検索しています...
ko: 베이스를 찾는 중...
pl: Trwa lokalizowanie baz...
pt_br: Localizando as bases...
ru: Обнаружение баз…
tr: Tabanlar bulunuyor...
zh_hans: 正在查找基...
zh_hant: 正在尋找基底...

source: New Line
cs: Nový řádek
de: Zeilenumbruch
es: Nueva línea
fr: Nouvelle ligne
ko: 줄 바꿈
pl: Nowy wiersz
pt_br: Nova Linha
ru: Новая строка
tr: Yeni Satır
zh_hans: 新行
zh_hant: 新行

source: No
cs: Ne
de: Nein
fr: Non
ko: 아니요
pl: Nie
pt_br: Não
ru: Нет
tr: Hayır
zh_hans: 否
zh_hant: 否

source: Operator - Overloaded
cs: Operátor – přetížení
de: Operator - überladen
es: Operador: sobrecargado
fr: Opérateur - surchargé
it: Operatore - Overload
ja: 演算子 - オーバーロード
ko: 연산자 - 오버로드됨
pl: Operator — przeciążony
pt_br: Operador – Sobrecarregado
ru: Оператор — перегружен
tr: İşleç - Aşırı Yüklenmiş
zh_hans: 运算符-重载
zh_hant: 運算子 - 多載

source: Paste Tracking
cs: Sledování vkládání
de: Nachverfolgung von Einfügevorgängen
es: Seguimiento de pegado
fr: Suivi du collage
it: Verifica Incolla
ja: 追跡の貼り付け
ko: 붙여넣기 추적
pl: Śledzenie wklejania
pt_br: Colar Acompanhamento
ru: Вставить отслеживание
tr: İzleme Yapıştır
zh_hans: 粘贴跟踪信息
zh_hant: 貼上追蹤

source: Prefer 'is null' for reference equality checks
cs: U kontrol rovnosti odkazů dávat přednost možnosti is null
de: "is null" für Verweisübereinstimmungsprüfungen vorziehen
es: Preferir “is null” para comprobaciones de igualdad de referencias
fr: Préférer 'is nul' pour les vérifications d'égalité de référence
ko: 참조 같음 검사에 대해 'is null' 선호
pl: Preferuj wyrażenie „is null” w przypadku sprawdzeń odwołań pod kątem równości
pt_br: Preferir 'is null' para as verificações de igualdade de referência
ru: Использовать "is null" вместо проверки ссылок на равенство.
tr: Başvuru eşitliği denetimleri için 'is null'ı tercih et
zh_hans: 引用相等检查偏好 “is null”
zh_hant: 參考相等檢查最好使用 'is null'

source: Prefer 'this.' or 'Me.'
cs: Preferovat this. nebo Me.
de: "this." oder "Me." bevorzugen
es: Preferir "this." o "Me."
fr: Préférer 'this.' ou 'Me.'
ko: 'this.' 또는 'Me.'를 기본으로 사용하세요.
pl: Preferuj zapis „this.” lub „me.”
pt_br: Preferir 'this.' ou 'Me.'
ru: Предпочитать "this." или "Me".
tr: 'this.' veya 'Me.' tercih et
zh_hans: 首选 "this." 或 "Me."
zh_hant: 建議使用 'this.' 或 'Me.'

source: Preprocessor Text
cs: Text preprocesoru
de: Präprozessortext
es: Texto del preprocesador
fr: Texte du préprocesseur
it: Testo preprocessore
ja: プリプロセッサ テキスト
ko: 전처리기 텍스트
pl: Tekst preprocesora
pt_br: Texto de Pré-Processador
ru: Текст препроцессора
tr: Ön İşlemci Metni
zh_hans: 预处理器文本
zh_hant: 前置處理器文字

source: Punctuation
cs: Interpunkce
de: Interpunktion
es: Puntuación
fr: Ponctuation
it: Punteggiatura
ja: 句読点
ko: 문장 부호
pl: Interpunkcja
pt_br: Pontuação
ru: Пунктуация
tr: Noktalama İşareti
zh_hans: 标点
zh_hant: 標點符號

source: Qualify event access with 'this' or 'Me'
cs: Kvalifikovat přístup k události pomocí this nebo Me
de: Ereigniszugriff mit "this" oder "Me" qualifizieren
es: Calificar acceso a evento con "this" o "Me"
fr: Qualifier l'accès à l'événement avec 'this' ou 'Me'
ko: 'this' 또는 'Me'를 사용하여 이벤트 액세스를 한정합니다.
pl: Kwalifikuj dostęp do zdarzenia przy użyciu zapisu „this.” lub „me.”
pt_br: Qualificar o acesso de evento com 'this' ou 'Me'
ru: Квалифицировать доступ к событию с помощью "this" или "Me"
tr: Olay erişimini 'this' veya 'Me' ile nitele
zh_hans: 使用 "this" 限定事件访问
zh_hant: 以 'this' 或 'Me' 限定事件存取

source: Qualify field access with 'this' or 'Me'
cs: Kvalifikovat přístup k poli pomocí this nebo Me
de: Feldzugriff mit "this" oder "Me" qualifizieren
es: Calificar acceso a campo con "this" o "Me"
fr: Qualifier l'accès au champ avec 'this' ou 'Me'
ko: 'this' 또는 'Me'를 사용하여 필드 액세스를 한정합니다.
pl: Kwalifikuj dostęp do pola przy użyciu zapisu „this.” lub „me.”
pt_br: Qualificar o acesso de campo com 'this' ou 'Me'
ru: Квалифицировать доступ к полю с помощью "this" или "Me"
tr: Alan erişimini 'this' veya 'Me' ile nitele
zh_hans: 使用 "this" 或 "Me" 限定字段访问
zh_hant: 以 'this' 或 'Me' 限定欄位存取

source: Qualify method access with 'this' or 'Me'
cs: Kvalifikovat přístup k metodě pomocí this nebo Me
de: Methodenzugriff mit "this" oder "Me" qualifizieren
es: Calificar acceso a método con "this" o "Me"
fr: Qualifier l'accès à la méthode avec 'this' ou 'Me'
ko: 'this' 또는 'Me'를 사용하여 메서드 액세스를 한정합니다.
pl: Kwalifikuj dostęp do metody przy użyciu zapisu „this.” lub „me.”
pt_br: Qualificar o acesso de método com 'this' ou 'Me'
ru: Квалифицировать доступ к методу с помощью "this" или "Me"
tr: Metot erişimini 'this' veya 'Me' ile nitele
zh_hans: 使用 "this" 或 "Me" 限定方法访问
zh_hant: 以 'this' 或 'Me' 限定方法存取

source: Qualify property access with 'this' or 'Me'
cs: Kvalifikovat přístup k vlastnosti pomocí this nebo Me
de: Eigenschaftenzugriff mit "this" oder "Me" qualifizieren
es: Calificar acceso a propiedad con "this" o "Me"
fr: Qualifier l'accès à la propriété avec 'this' ou 'Me'
ko: 'this' 또는 'Me'를 사용하여 속성 액세스를 한정합니다.
pl: Kwalifikuj dostęp do właściwości przy użyciu zapisu „this.” lub „me.”
pt_br: Qualificar o acesso de propriedade com 'this' ou 'Me'
ru: Квалифицировать доступ к свойству с помощью "this" или "Me"
tr: Özellik erişimini 'this' veya 'Me' ile nitele
zh_hans: 使用 "this" 或 "Me" 限定属性访问
zh_hant: 以 'this' 或 'Me' 限定屬性存取
