Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: VB XML Literals - Text
cs: Literály VB XML – text
de: VB XML-Literale - Text
es: Literal VB XML: texto
fr: Littéraux XML VB - Texte
it: Valori letterali XML VB - Testo
ja: VB XML リテラル - テキスト
ko: VB XML 리터럴 - 텍스트
pl: Literały XML języka VB — tekst
pt_br: Literais XML do VB - Texto
ru: Литералы XML VB — текст
tr: VB XML Sabit Değerleri - Metin
zh_hans: VB XML 文本 - 文本
zh_hant: VB XML 常值 - 文字

source: XML Doc Comments - Attribute Quotes
cs: Komentáře XML – uvozovky atributu
de: XML-Dok-Kommentare - Attributanführungszeichen
es: Comentarios de documentación XML: comillas de atributo
fr: Commentaires documentation XML - Guillemets d'attribut
it: Commenti in formato documentazione XML - Virgolette attributo
ja: XML ドキュメント コメント - 属性の引用符
ko: XML 문서 주석 - 특성 인용 문자
pl: Komentarze dokumentacji XML — cudzysłowy atrybutu
pt_br: Comentário da documentação XML - Aspas de Atributo
ru: Комментарии XML Doc — кавычки атрибутов
tr: XML Belge Açıklamaları - Öznitelik Tırnak İşaretleri
zh_hans: XML 文档注释 - 属性引号
zh_hant: XML 文件註解 - 屬性引號

source: XML Doc Comments - Attribute Value
cs: Komentáře XML – hodnota atributu
de: XML-Dok-Kommentare - Attributwert
es: Comentarios de documentación XML: valor de atributo
fr: Commentaires documentation XML - Valeur d'attribut
it: Commenti in formato documentazione XML - Valore attributo
ja: XML ドキュメント コメント - 属性値
ko: XML 문서 주석 - 특성 값
pl: Komentarze dokumentacji XML — wartość atrybutu
pt_br: Comentário da documentação XML - Valor de Atributo
ru: Комментарии XML Doc — значения атрибутов
tr: XML Belge Açıklamaları - Öznitelik Değeri
zh_hans: XML 文档注释 - 属性值
zh_hant: XML 文件註解 - 屬性值

source: Unnecessary Code
it: Codice non necessario
ja: 不要なコード
pl: Zbędny kod
tr: Gereksiz Kod
zh_hans: 不必要的代码

source: Rude Edit
cs: Hrubá úprava
de: Nicht unterstützte Bearbeitung
es: Edición superficial
fr: Modification non applicable
it: Modifica non applicabile
ja: Rude 編集
ko: 편집 다시 실행
pl: Edycja blokująca
pt_br: Edição Rudimentar
ru: Грубая редакция
tr: İşlenmemiş Düzenleme
zh_hans: 原始编辑
zh_hant: 粗略編輯

source: Rename will update 1 reference in 1 file.
cs: Při přejmenování dojde k aktualizaci 1 odkazu v 1 souboru.
de: Durch das Umbenennen wird ein Verweis in einer Datei aktualisiert.
es: Al cambiar el nombre se actualizará 1 referencia en 1 archivo.
fr: Le renommage va entraîner la mise à jour de 1 référence dans 1 fichier.
it: Con la ridenominazione verrà aggiornato un riferimento in un file.
ja: 名前を変更すると、1 ファイル内の 1 つの参照が更新されます。
ko: 이름 바꾸기로 1개의 파일에서 1개의 참조가 업데이트됩니다.
pl: Zmiana nazwy spowoduje zaktualizowanie 1 odwołania w 1 pliku.
pt_br: Renomear atualizará 1 referência em 1 arquivo.
ru: При переименовании будет обновлена одна ссылка в одном файле.
tr: Yeniden adlandırma işlemi 1 dosyadaki 1 başvuruyu güncelleştirecek.
zh_hans: 重命名将更新 1 个文件中的 1 个引用。
zh_hant: 重新命名會更新 1 個檔案中的 1 個參考。

source: Rename will update {0} references in 1 file.
cs: Při přejmenování dojde k aktualizaci {0} odkazů v 1 souboru.
de: Durch das Umbenennen werden {0} Verweise in einer Datei aktualisiert.
es: Al cambiar el nombre se actualizarán {0} referencias en 1 archivo.
fr: Le renommage va entraîner la mise à jour de {0} références dans 1 fichier.
it: Con la ridenominazione verranno aggiornati {0} riferimenti in un file.
ja: 名前を変更すると、1 ファイル内の {0} 個の参照が更新されます。
ko: 이름 바꾸기로 1개의 파일에서 {0}개의 참조가 업데이트됩니다.
pl: Zmiana nazwy spowoduje zaktualizowanie odwołań ({0}) w 1 pliku.
pt_br: Renomear atualizará {0} referências em 1 arquivo.
ru: При переименовании будут обновлены ссылки в количестве {0} шт. в одном файле.
tr: Yeniden adlandırma işlemi 1 dosyadaki {0} başvuruyu güncelleştirecek.
zh_hans: 重命名将更新 1 个文件中的 {0} 个引用。
zh_hant: 重新命名會更新 1 個檔案中的 {0} 個參考。

source: Rename will update {0} references in {1} files.
cs: Při přejmenování dojde k aktualizaci {0} odkazů v {1} souborech.
de: Durch das Umbenennen werden {0} Verweise in {1} Dateien aktualisiert.
es: Al cambiar el nombre se actualizarán {0} referencias en {1} archivos.
fr: Le renommage va entraîner la mise à jour de {0} références dans {1} fichiers.
it: Con la ridenominazione verranno aggiornati {0} riferimenti in {1} file.
ja: 名前を変更すると、{1} 個のファイル内の {0} 個の参照が更新されます。
ko: 이름 바꾸기로 {1}개의 파일에서 {0}개의 참조가 업데이트됩니다.
pl: Zmiana nazwy spowoduje zaktualizowanie odwołań ({0}) w plikach ({1}).
pt_br: Renomear atualizará {0} referências em {1} arquivos.
ru: При переименовании будут обновлены ссылки в количестве {0} шт. в следующем числе файлов: {1}.
tr: Yeniden adlandırma işlemi {1} dosyadaki {0} başvuruyu güncelleştirecek.
zh_hans: 重命名将更新 {1} 个文件中的 {0} 个引用。
zh_hant: 重新命名會更新 {1} 個檔案中的 {0} 個參考。

source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
ko: 예
pl: Tak
pt_br: Sim
ru: Да
tr: Evet
zh_hans: 是
zh_hant: 是

source: You cannot rename this element because it is contained in a read-only file.
cs: Tento element nejde přejmenovat, protože je obsažen v souboru jen pro čtení.
de: Dieses Element kann nicht umbenannt werden, weil es in einer schreibgeschützten Datei enthalten ist.
es: No se puede cambiar el nombre de este elemento porque está incluido en un archivo de solo lectura.
fr: Vous ne pouvez pas renommer cet élément, car il est contenu dans un fichier en lecture seule.
ja: この要素は、読み取り専用ファイルに含まれているため、名前を変更できません。
ko: 이 요소는 읽기 전용 파일에 포함되어 있으므로 이름을 바꿀 수 없습니다.
pl: Nie możesz zmienić nazwy tego elementu, ponieważ jest on zawarty w pliku tylko do odczytu.
pt_br: Você não pode renomear este elemento porque ele está contido em um arquivo somente leitura.
ru: Невозможно переименовать этот элемент, так как он содержится в файле, доступном только для чтения.
tr: Salt okunur bir dosyada bulunduğundan bu öğeyi yeniden adlandıramazsınız.
zh_hans: 无法重命名此元素，因为它包含在只读文件中。
zh_hant: 因為此項目包含在唯讀檔案中，所以無法重新命名。

source: You cannot rename this element because it is in a location that cannot be navigated to.
cs: Tento element nejde přejmenovat, protože se nachází v umístění, na které nejde přejít.
de: Dieses Element kann nicht umbenannt werden, weil es sich an einem Speicherort befindet, zu dem nicht navigiert werden kann.
es: No se puede cambiar el nombre de este elemento porque está en una ubicación a la que no se puede navegar.
fr: Vous ne pouvez pas renommer cet élément, car il se trouve dans un emplacement inaccessible.
ja: この要素は、移動できない場所にあるため、名前を変更できません。
ko: 이 요소는 탐색할 수 없는 위치에 있으므로 이름을 바꿀 수 없습니다.
pl: Nie możesz zmienić nazwy tego elementu, ponieważ znajduje się on w lokalizacji, do której nie można nawigować.
pt_br: Você não pode renomear este elemento porque ele está em um local para o qual não é possível navegar.
ru: Невозможно переименовать этот элемент, так как он находится в расположении, к которому невозможно перейти.
tr: Gezintiyle ulaşılamayan bir konumda bulunduğundan bu öğeyi yeniden adlandıramazsınız.
zh_hans: 无法重命名此元素，因为它位于无法导航到的位置。
zh_hant: 因為無法瀏覽到此項目的所在位置，所以無法予以重新命名。

source: {0} conflict(s) will be resolved
cs: Vyřeší se tento počet konfliktů: {0}.
de: {0} Konflikt(e) werden gelöst
es: Se va(n) a resolver {0} conflicto(s)
fr: {0} conflit(s) seront résolus
it: Verranno risolti {0} conflitti
ja: {0} 個の競合が解決されます
ko: 충돌 {0}개가 해결됩니다.
pl: Następująca liczba konfliktów zostanie rozwiązana: {0}
pt_br: {0} conflito(s) será(ão) resolvido(s)
ru: Конфликтов будет разрешено: {0}
tr: {0} çakışmaları çözümlenecek
zh_hans: 将解决 {0} 个冲突
zh_hant: 將解決 {0} 項衝突

source: '{0}' implemented members
cs: Implementované členy {0}
de: {0} implementierte Member
es: Miembros implementados: "{0}"
fr: '{0}' membres implémentés
ja: '{0}' が実装されたメンバー
ko: 구현된 멤버 '{0}'개
pl: Zaimplementowane składowe: „{0}”
pt_br: '{0}' membros implementados
ru: Реализованные члены "{0}"
tr: '{0}' uygulanan üye
zh_hans: “{0}”个实现的成员
zh_hant: 已實作 '{0}' 的成員

source: {0} unresolvable conflict(s)
cs: Počet nevyřešených konfliktů: {0}
de: {0} nicht lösbare(r) Konflikt(e)
es: {0} conflicto(s) sin solución
fr: {0} conflit(s) ne pouvant pas être résolu(s)
it: {0} conflitti non risolti
ja: 未解決の競合 {0}
ko: 해결할 수 없는 충돌 {0}개
pl: Liczba nierozwiązanych konfliktów: {0}
pt_br: {0} conflito(s) não solucionável(is)
ru: {0} неразрешимые конфликты
tr: {0} çözümlenemeyen çakışma
zh_hans: {0} 个无法解决的冲突
zh_hant: 有 {0} 個未解決的衝突

source: Applying "{0}"...
it: Applicazione di "{0}"...
ja: "{0}" を適用しています...
pl: Trwa stosowanie elementu „{0}”...
tr: "{0}" uygulanıyor...
zh_hans: 正在应用 “{0}”...

# Adding_0_to_1_with_content_colon
source: Adding '{0}' to '{1}' with content:
cs: Přidává se {0} do {1} s obsahem:
de: "{0}" wird zu "{1}" hinzugefügt mit dem Inhalt:
es: Agregando '{0}' a '{1}' con contenido:
fr: Ajout de '{0}' à '{1}' avec le contenu :
it: Aggiunta di '{0}' a '{1}' con contenuto:
ja: コンテンツを含む '{0}' を '{1}' に追加しています:
ko: 다음 콘텐츠가 있는 '{1}'에 대한 '{0}' 추가 중:
pl: Trwa dodawanie elementu „{0}” do elementu „{1}” z zawartością:
pt_br: Adicionando "{0}" a "{1}" com conteúdo:
ru: Добавление "{0}" к "{1}" с содержимым:
tr: '{0}' şu içerik ile '{1}' üzerine ekleniyor:
zh_hans: 将“{0}”添加到具有内容的“{1}”:
zh_hant: 將 '{0}' 加入包含下列內容的 '{1}':

source: Adding project '{0}'
cs: Přidává se projekt {0}.
de: Projekt "{0}" wird hinzugefügt
es: Agregando proyecto '{0}'
fr: Ajout du projet '{0}'
it: Aggiunta del progetto '{0}'
ja: プロジェクト '{0}' を追加しています
ko: '{0}' 프로젝트 추가 중
pl: Trwa dodawanie projektu „{0}”
pt_br: Adicionando projeto "{0}"
ru: Добавление проекта "{0}"
tr: '{0}' projesi ekleniyor
zh_hans: 添加项目“{0}”
zh_hant: 正在加入專案 '{0}'

source: Removing project '{0}'
cs: Odebírá se projekt {0}.
de: Projekt "{0}" wird entfernt
es: Quitando el proyecto '{0}'
fr: Suppression du projet '{0}'
it: Rimozione del progetto '{0}'
ja: プロジェクト '{0}' を削除しています
ko: '{0}' 프로젝트를 제거하는 중
pl: Trwa usuwanie projektu „{0}”
pt_br: Removendo projeto "{0}"
ru: Удаление проекта "{0}"
tr: '{0}' projesi kaldırılıyor
zh_hans: 删除项目“{0}”
zh_hant: 移除專案 '{0}'

source: Changing project references for '{0}'
cs: Změní se odkazy na projekt pro {0}.
de: Projektverweise für "{0}" werden geändert
es: Cambiando referencias del proyecto a '{0}'
fr: Modification des références de projet pour '{0}'
it: Modifica dei riferimenti del progetto per '{0}'
ja: プロジェクトの参照 '{0}' を変更しています
ko: '{0}'에 대한 프로젝트 참조 변경 중
pl: Trwa zmienianie odwołań projektu dla elementu „{0}”
pt_br: Alterar referências de projeto para "{0}"
ru: Изменение ссылок проекта для "{0}"
tr: '{0}' için proje başvuruları değiştiriliyor
zh_hans: 更改“{0}”的项目引用
zh_hant: 變更 '{0}' 的專案參考

source: Adding reference '{0}' to '{1}'
cs: Přidává se odkaz {0} do {1}.
de: Referenz "{0}" wird zu "{1}" hinzugefügt
es: Agregando referencia '{0}' a '{1}'
fr: Ajout de la référence '{0}' à '{1}'
it: Aggiunta del riferimento '{0}' a '{1}'
ja: 参照 '{0}' を '{1}' に追加しています
ko: '{1}'에 대한 '{0}' 참조 추가 중
pl: Trwa dodawanie odwołania „{0}” do elementu „{1}”
pt_br: Adicionando referência "{0}" a "{1}"
ru: Добавление ссылки "{0}" в "{1}"
tr: '{0}' başvurusu '{1}' üzerine ekleniyor
zh_hans: 将引用“{0}”添加到“{1}”
zh_hant: 將參考 '{0}' 加入 '{1}'

source: Removing reference '{0}' from '{1}'
cs: Odebírá se odkaz {0} z {1}.
de: Referenz "{0}" wird aus "{1}" entfernt
es: Quitando la referencia '{0}' de '{1}'
fr: Suppression de la référence '{0}' de '{1}'
it: Rimozione del riferimento '{0}' da '{1}'
ja: 参照 '{0}' を '{1}' から削除しています
ko: '{1}'에서 '{0}' 참조를 제거하는 중
pl: Trwa usuwanie odwołania „{0}” z „{1}”
pt_br: Removendo referência "{0}" de "{1}"
ru: Удаление ссылки "{0}" из "{1}"
tr: '{0}' başvurusu '{1}' üzerinden kaldırılıyor
zh_hans: 从“{1}”中删除引用“{0}”
zh_hant: 從 '{1}' 移除參考 '{0}'

source: Adding analyzer reference '{0}' to '{1}'
cs: Přidává se odkaz analyzátoru {0} do {1}.
de: Analysereferenz "{0}" wird zu "{1}" hinzugefügt
es: Agregando referencia de analizador '{0}' a '{1}'
fr: Ajout d'une référence d'analyseur '{0}' à '{1}'
it: Aggiunta del riferimento '{0}' dell'analizzatore a '{1}'
ja: アナライザーの参照 '{0}' を '{1}' に追加しています
ko: '{1}'에 대한 '{0}' 분석기 참조 추가 중
pl: Trwa dodawanie odwołania do analizatora „{0}” do elementu „{1}”
pt_br: Adicionando referência de analisador "{0}" a "{1}"
ru: Добавление ссылки анализатора "{0}" к "{1}"
tr: Çözümleyici başvurusu '{0}', '{1}' üzerine ekleniyor
zh_hans: 将分析器引用 “{0}”添加到“{1}”
zh_hant: 將分析器參考 '{0}' 加入 '{1}'

source: Removing analyzer reference '{0}' from '{1}'
cs: Odebírá se odkaz analyzátoru {0} z {1}.
de: Analyseverweis "{0}" wird aus "{1}" entfernt
es: Quitando la referencia de analizador '{0}' de '{1}'
fr: Suppression de la référence de l'analyseur '{0}' de '{1}'
it: Rimozione del riferimento '{0}' dell'analizzatore da '{1}'
ja: アナライザーの参照 '{0}' を '{1}' から削除しています
ko: '{1}'에서 '{0}' 분석기 참조를 제거하는 중
pl: Trwa usuwanie odwołania do analizatora „{0}” z „{1}”
pt_br: Removendo referência do analisador "{0}" de "{1}"
ru: Удаление ссылки анализатора "{0}" из "{1}"
tr: Çözümleyici başvurusu '{0}', '{1}' üzerinden kaldırılıyor
zh_hans: 从“{1}”中删除分析器引用“{0}”
zh_hant: 移除 '{1}' 的分析器參考 '{0}'

source: XML End Tag Completion
cs: Dokončení koncové značky XML
de: XML-End-Tag-Abschluss
es: Finalización de la etiqueta de fin XML
fr: Finalisation de la balise de fin XML
it: Completamento tag finale XML
ja: XML 終了タグ補完
ko: XML 끝 태그 완료
pl: Uzupełnianie tagów końcowych języka XML
pt_br: Conclusão da Marca de Fim do XML
ru: Завершение конечных тегов XML
tr: XML Bitiş Etiketi Tamamlaması
zh_hans: XML 结束标记完成
zh_hant: XML 結束標記完成

source: Completing Tag
cs: Dokončovací značka
de: Abschluss-Tag
es: Completando etiqueta
fr: Finalisation de la balise
it: Tag completamento
ja: タグ補完
ko: 태그 완료 중
pl: Uzupełnianie tagu
pt_br: Completando a Tag
ru: Завершающий тег
tr: Etiket Tamamlanıyor
zh_hans: 正在完成标记
zh_hant: 完成標籤

source: Encapsulate Field
cs: Zapouzdřit pole
de: Feld kapseln
es: Encapsular campo
fr: Encapsuler le champ
it: Incapsula campo
ja: フィールドのカプセル化
ko: 필드 캡슐화
pl: Hermetyzuj pole
pt_br: Encapsular Campo
ru: Инкапсулировать поле
tr: Alanı Kapsülle
zh_hans: 封装字段
zh_hant: 封裝欄位

source: Applying "Encapsulate Field" refactoring...
it: Applicazione del refactoring per "Incapsula campo"...
ja: "フィールドのカプセル化" リファクタリングを適用しています...
pl: Trwa stosowanie refaktoryzacji „Hermetyzuj pole”...
tr: "Alanı Yalıtma" yeniden düzenlemesi uygulanıyor...
zh_hans: 正在应用 “封装字段”重构...

source: Please select the definition of the field to encapsulate.
cs: Vyberte prosím definici pole k zapouzdření.
de: Wählen Sie die Definition des zu kapselnden Felds aus.
es: Seleccione la definición del campo que quiere encapsular.
fr: Sélectionnez la définition du champ à encapsuler.
it: Selezionare la definizione del campo da incapsulare.
ja: カプセル化するフィールドの定義を選択してください。
ko: 캡슐화할 필드의 정의를 선택하세요.
pl: Wybierz definicję pola, które ma zostać zahermetyzowane.
pt_br: Selecione a definição do campo a encapsular.
ru: Выберите определение поля, которое нужно инкапсулировать.
tr: Lütfen yalıtılacak alanın tanımını seçin.
zh_hans: 请选择要封装字段的定义。
zh_hant: 請為要封裝的欄位選取定義。

source: Given Workspace doesn't support Undo
cs: Daný pracovní prostor nepodporuje vrácení akce zpátky.
de: Angegebener Arbeitsbereich unterstützt die Funktion "Rückgängig" nicht
es: El área de trabajo dada no permite deshacer
fr: L'espace de travail donné ne prend pas en charge la fonction Annuler
it: L'area di lavoro specificata non supporta l'annullamento di operazioni
ja: 指定されたワークスペースは元に戻す操作をサポートしていません
ko: 지정한 작업 영역에서 실행을 취소할 수 없습니다.
pl: Dany obszar roboczy nie obsługuje operacji cofania
pt_br: Workspace fornecido não suporta Desfazer
ru: Заданная рабочая область не поддерживает отмену
tr: Verilen Çalışma Alanı, Geri Alma'yı desteklemez
zh_hans: 给定的工作区不支持撤销
zh_hant: 指定的工作區不支援復原

source: Searching...
cs: Hledá se...
de: Suche läuft...
es: Buscando...
fr: Recherche...
it: Ricerca...
ja: 検索しています...
ko: 검색 중...
pl: Trwa wyszukiwanie...
pt_br: Pesquisando...
ru: Идет поиск...
tr: Aranıyor...
zh_hans: 正在搜索...
zh_hant: 正在搜尋...

source: Canceled.
cs: Zrušilo se.
de: Abgebrochen.
es: Cancelado.
fr: Annulé.
it: Operazione annullata.
ja: キャンセルされました。
ko: 취소되었습니다.
pl: Anulowano.
pt_br: Cancelado.
ru: Отменено.
tr: İptal Edildi.
zh_hans: 已取消。
zh_hant: 已取消。

source: No information found.
cs: Nenašly se žádné informace.
de: Keine Informationen gefunden.
es: No se encontró información.
fr: Informations introuvables.
it: Non sono state trovate informazioni.
ja: 情報が見つかりません。
ko: 정보를 찾을 수 없습니다.
pl: Nie znaleziono informacji.
pt_br: Nenhuma informação encontrada.
ru: Информация не найдена.
tr: Bilgi bulunamadı.
zh_hans: 未找到信息。
zh_hant: 找不到資訊。

source: No usages found.
it: Non sono stati trovati utilizzi.
ja: 使用状況が見つかりません。
pl: Nie znaleziono użyć
tr: Kullanım bulunamadı.
zh_hans: 未找到用法。

source: Implements
cs: Implementuje
de: Implementiert
es: Implementa
fr: Implémente
it: Implementa
ja: 実装
ko: 구현
pl: Implementuje
pt_br: Implementos
ru: Реализует
tr: Uygulanan
zh_hans: 实现
zh_hant: 實作

source: Implemented By
cs: Implementoval:
de: Implementiert von
es: Implementado por
fr: Implémenté par
it: Implementato da
ja: 実装先
ko: 구현자
pl: Zaimplementowane przez
pt_br: Implementado por
ru: Реализуется
tr: Uygulayan
zh_hans: 实现者
zh_hant: 實作者

source: Overrides
cs: Přepisuje
de: Überschreibungen
es: Invalidaciones
fr: Substitutions
it: Esegue l'override
ja: オーバーライド
ko: 재정의
pl: Przesłania
pt_br: Substitui
ru: Переопределяет
tr: Geçersiz Kılan
zh_hans: 重写
zh_hant: 覆寫

source: Overridden By
cs: Přepsáno čím:
de: Überschrieben von
es: Invalidado por
fr: Remplacée par
it: Sottoposto a override da
ja: オーバーライド元
ko: 재정의 수행자
pl: Przesłonione przez
pt_br: Substituído por
ru: Переопределяется
tr: Geçersiz Kılınan
zh_hans: 重写者
zh_hant: 覆寫者

source: Directly Called In
it: Chiamato in modo diretto
ja: 直接に呼び出し済み
pl: Wywołane bezpośrednio
tr: Doğrudan Çağrılma Yeri
zh_hans: 直接调入

source: Indirectly Called In
it: Chiamato in modo indiretto
ja: 間接的に呼び出し済み
pl: Wywołane pośrednio
tr: Dolaylı Olarak Çağrılma Yeri
zh_hans: 间接调入

source: Called In
it: Chiamato
ja: 呼び出し済み
pl: Wywołane
tr: Çağrılma Yeri
zh_hans: 调入

source: Referenced In
it: Con riferimenti in
ja: 参照先
pl: Przywoływane w
tr: Başvuru Yeri
zh_hans: 引用于

source: No references found.
cs: Nenašly se žádné odkazy.
de: Keine Verweise gefunden.
es: No se encontraron referencias.
fr: Référence introuvable.
it: Non sono stati trovati riferimenti.
ja: 参照が見つかりません。
ko: 참조를 찾을 수 없습니다.
pl: Nie znaleziono odwołań.
pt_br: Nenhuma referência encontrada.
ru: Ссылки не найдены.
tr: Başvuru bulunamadı.
zh_hans: 未找到引用。
zh_hant: 找不到參考。

source: No derived types found.
it: Non sono stati trovati tipi derivati.
ja: 派生型が見つかりません。
pl: Nie znaleziono typów pochodnych.
tr: Türetilmiş tür bulunamadı.
zh_hans: 未找到派生类型。

source: No implementations found.
it: Non sono state trovate implementazioni.
ja: 実装が見つかりません。
pl: Nie znaleziono implementacji.
tr: Uygulama bulunamadı.
zh_hans: 未找到实现。

source: {0} - (Line {1})
it: {0} - (riga {1})
ja: {0} - (行 {1})
pl: {0} — (wiersz {1})
tr: {0} - (Satır {1})
zh_hans: {0} - (第 {1} 行)

source: Class Parts
it: Parti di classe
ja: クラスの部品
pl: Części klasy
tr: Sınıf Parçaları
zh_hans: 类部件

source: Struct Parts
it: Parti struct
ja: 構造体の部品
pl: Części struktury
tr: Yapı Parçaları
zh_hans: 结构部件

source: Interface Parts
it: Parti interfaccia
ja: インターフェイス パーツ
pl: Części interfejsu
tr: Arabirim Parçaları
zh_hans: 接口部件

source: Type Parts
it: Parti tipo
ja: 型の部品
pl: Części typu
tr: Tür Parçaları
zh_hans: 类型部件

source: Inherits
cs: Dědí
de: Erbt
es: Hereda
fr: Hérite
it: Eredita
ja: 継承
ko: 상속
pl: Dziedziczy
pt_br: Herda
ru: Наследует
tr: Devralınan
zh_hans: 继承
zh_hant: 繼承

source: Inherited By
it: Ereditato da
ja: 継承先
pl: Dziedziczone przez
tr: Devralan
zh_hans: 继承者

source: Already tracking document with identical key
it: La verifica del documento con chiave identica è già in corso
ja: 同じキーを持つドキュメントを既に追跡しています
pl: Dokument z identycznym kluczem jest już śledzony
tr: Belge zaten özdeş anahtar ile izleniyor
zh_hans: 已使用等价键跟踪文档

source: document is not currently being tracked
it: al momento il documento non è sottoposto a verifica
ja: ドキュメントが現在追跡されていません
pl: dokument obecnie nie jest śledzony
tr: Belge şu anda izlenmiyor
zh_hans: 当前未跟踪文档

source: Computing Rename information...
cs: Vypočítávají se informace o přejmenování...
de: Umbenennungsinformationen werden berechnet...
es: Calculando información de Cambiar nombre...
fr: Calcul des informations de changement de nom...
it: Elaborazione delle informazioni per la ridenominazione...
ja: 名前の変更情報を計算しています...
ko: 이름 바꾸기 정보 계산 중...
pl: Trwa obliczanie informacji dotyczących zmiany nazwy...
pt_br: Computando informações de Renomeação...
ru: Вычисление информации переименования...
tr: Yeniden Adlandırma bilgileri hesaplanıyor...
zh_hans: 正在计算重命名信息...
zh_hant: 正在計算重新命名資訊...

source: Updating files...
cs: Aktualizují se soubory...
de: Dateien werden aktualisiert...
es: Actualizando archivos...
fr: Mise à jour des fichiers...
it: Aggiornamento dei file...
ja: ファイルを更新しています...
ko: 파일 업데이트 중...
pl: Trwa aktualizowanie plików...
pt_br: Atualizando arquivos...
ru: Идет обновление файлов...
tr: Dosyalar güncelleştiriliyor...
zh_hans: 正在更新文件...
zh_hant: 正在更新檔案...

source: Rename operation was cancelled or is not valid
cs: Operace přejmenování je zrušená nebo není platná
de: Der Umbenennungsvorgang wurde abgebrochen oder ist nicht gültig.
es: La operación de cambio de nombre se canceló o no es válida
fr: Le changement de nom a été annulé ou n'est pas valide
it: L'operazione di ridenominazione è stata annullata o non è valida
ja: 名前の変更操作は取り消されたか、または検証されていません
ko: 이름 바꾸기 작업이 취소되었거나 잘못되었습니다.
pl: Operacja zmiany nazwy została anulowana lub nie jest prawidłowa
pt_br: A operação de renomear foi cancelada ou não é válida
ru: Операция переименования была отменена или является недопустимой.
tr: Yeniden adlandırma işlemi iptal edildi veya geçerli değil
zh_hans: 重命名操作已取消或无效
zh_hant: 重新命名作業已取消或無效

source: Rename Symbol
cs: Přejmenovat symbol
de: Symbol umbenennen
es: Cambiar el nombre del símbolo
fr: Renommer le symbole
it: Rinomina simbolo
ja: シンボルの名前変更
ko: 기호 이름 바꾸기
pl: Zmień nazwę symbolu
pt_br: Renomear Símbolo
ru: Переименовать символ
tr: Sembolü Yeniden Adlandır
zh_hans: 重命名符号
zh_hant: 重新命名符號

source: Text Buffer Change
cs: Změnit vyrovnávací paměť textu
de: Textpufferänderung
es: Cambio de búfer de texto
fr: Modification de la mémoire tampon de texte
it: Modifica al buffer di testo
ja: テキスト バッファーの変更
ko: 텍스트 버퍼 변경
pl: Zmiana buforu tekstu
pt_br: Alteração no Buffer de Texto
ru: Изменение буфера текста
tr: Metin Arabelleği Değişikliği
zh_hans: 文本缓冲区更改
zh_hant: 文字緩衝區變更

source: Rename operation was not properly completed. Some file might not have been updated.
cs: Operace přejmenování nebyla řádně dokončená. Některý soubor nemusel být aktualizovaný.
de: Der Umbenennungsvorgang wurde nicht ordnungsgemäß abgeschlossen. Möglicherweise wurden manche Dateien nicht aktualisiert.
es: La operación de cambio de nombre no se completó correctamente. Puede que algún archivo no se haya actualizado.
fr: Le changement de nom ne s'est pas effectué correctement. Certains fichiers risquent de ne pas avoir été mis à jour.
it: L'operazione di ridenominazione non è stata completata correttamente. Alcuni file potrebbero non essere stati aggiornati.
ja: 名前の変更操作は正常に終了しませんでした。ファイルのいくつかは更新されなかった可能性があります。
ko: 이름 바꾸기 작업이 제대로 완료되지 않았습니다. 일부 파일이 업데이트되지 않았을 수 있습니다.
pl: Operacja zmiany nazwy nie została prawidłowo ukończona. Niektóre pliki mogły nie zostać zaktualizowane.
pt_br: A operação de renomear não foi corretamente concluída. Algum arquivo pode não ter sido atualizado.
ru: Операция переименования завершена неправильно. Некоторые файлы должны быть обновлены.
tr: Yeniden adlandırma işlemi uygun şekilde tamamlanmadı. Bazı dosyalar güncelleştirilmemiş olabilir.
zh_hans: 重命名操作未正确完成。可能未更新某个文件。
zh_hant: 重新命名作業未正確完成。部分檔案可能尚未更新。

source: Rename '{0}' to '{1}'
cs: Přejmenovat {0} na {1}
de: "{0}" in "{1}" umbenennen
fr: Renommer '{0}' en '{1}'
it: Rinomina '{0}' in '{1}'
ja: '{0}' を '{1}' に名前変更
ko: '{1}'(으)로 '{0}' 이름 바꾸기
pl: Zmień nazwę elementu „{0}” na „{1}”
pt_br: Renomear "{0}" para "{1}"
ru: Переименовать "{0}" в "{1}"
tr: '{0}' öğesini '{1}' olarak yeniden adlandır
zh_hans: 将“{0}” 重命名为“{1}”
