Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesWpfResources.*.xlf
Languages: cs, de, zh_hant

source: Building Project
cs: Sestavování projektu
de: Projekt wird erstellt
zh_hant: 正在建置專案

source: Copying selection to Interactive Window.
cs: Výběr se kopíruje do okna Interactive.
de: Die Auswahl wird in Interactive-Fenster kopiert.
zh_hant: 正在將選取範圍複製到互動視窗。

source: Enter to rename, Shift+Enter to preview
cs: Stisknutím klávesy Enter přejmenujete, stisknutím kombinace kláves Shift+Enter zobrazíte náhled
de: Eingabetaste zum Umbenennen, Umschalt+Eingabetaste zur Vorschau
zh_hant: Enter 鍵以重新命名，Shift+Enter 以預覽

# Enter_to_rename_shift_enter_to_preview_ctrl_space_for_ai_suggestion
source: Enter to rename, Shift+Enter to preview, Ctrl+Space for rename suggestions
cs: Enter pro přejmenování, Shift+Enter zobrazí náhled, Ctrl+Mezerník pro návrhy přejmenování
de: EINGABETASTE zum Umbenennen, UMSCHALT+EINGABETASTE für die Vorschau, STRG+LEERTASTE für Umbenennungsvorschläge
zh_hant: Enter 鍵以重新命名，Shift+Enter 鍵以預覽，Ctrl+Space 鍵以尋求重新命名建議

source: Error performing rename: '{0}'
cs: Nepovedlo se provést přejmenování: {0}
de: Fehler beim Umbenennen: "{0}"
zh_hant: 執行重新命名時發生錯誤: '{0}'

source: Executing selection in Interactive Window.
cs: Výběr se spouští v okně Interactive.
de: Die Auswahl wird im Interactive-Fenster ausgeführt.
zh_hant: 正在於互動視窗中執行選取範圍。

source: Generating suggestions...
cs: Generování návrhů…
de: Vorschläge werden generiert...
zh_hant: 正在產生建議...

# Get_AI_suggestions
source: Get AI-powered rename suggestions (Ctrl+Space)
cs: Získejte návrhy přejmenování využívající umělou inteligenci (Ctrl+Mezerník)
de: KI-gestützte Umbenennungsvorschläge abrufen (STRG+LEERTASTE)
zh_hant: 取得 AI 支援的重新命名建議 (Ctrl+Space)

source: Interactive host process platform
cs: Interaktivní platforma procesů hostitelů
de: Interaktive Hostprozessplattform
zh_hant: 互動式主機處理序平台

source: Reset the execution environment to the initial state and keep history, with the option to switch the runtime of the host process.
cs: Resetujte spouštěcí prostředí do počátečního stavu a zachovejte historii s možností přepnout modul runtime hostitelského procesu.
de: Setzen Sie die Ausführungsumgebung auf den Anfangszustand zurück, und behalten Sie den Verlauf bei, mit der Option, die Runtime des Hostprozesses zu wechseln.
zh_hant: 使用切換主機處理序的執行階段選項，將執行環境重設為初始狀態並保留歷程記錄。

source: Reset to a clean environment (only mscorlib referenced), do not run initialization script.
cs: Obnoví čisté prostředí (jenom s odkazem na mscorlib), nespustí inicializační skript.
de: Setzt auf eine saubere Umgebung zurück (nur Verweis auf "mscorlib") und führt das Initialisierungsskript nicht aus.
zh_hant: 重設為初始環境 (僅參考 mscorlib)，不要執行初始化指令碼。

source: Resetting Interactive
cs: Znovu se nastavuje interaktivní stav.
de: Interactives Element wird zurückgesetzt
zh_hant: 正在重設互動

source: Resetting execution engine.
cs: Resetuje se prováděcí modul.
de: Das Ausführungsmodul wird zurückgesetzt.
zh_hant: 正在重設執行引擎。

source: The CurrentWindow property may only be assigned once.
cs: Vlastnost CurrentWindow se dá přiřadit jenom jednou.
de: Die Eigenschaft "CurrentWindow" kann nur ein Mal zugewiesen werden.
zh_hant: CurrentWindow 屬性只能受指派一次。

# Toggle_AI_suggestions
source: Toggle rename suggestions (Ctrl+Space)
cs: Přepnout návrhy na přejmenování (Ctrl+Mezerník)
de: Umbenennungsvorschläge umschalten (STRG+LEERTASTE)
zh_hant: 切換重新命名建議 (Ctrl+空格鍵)
