Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Preview Warning
cs: Upozornění verze Preview
de: Vorschau der Warnung anzeigen
es: Vista previa de advertencia
fr: Avertissement sur la pré-version
it: Avviso di anteprima
ja: 警告のプレビュー
ko: 경고 미리 보기
pl: Ostrzeżenie (wersja zapoznawcza)
pt_br: Aviso de Visualização
ru: Предварительный просмотр предупреждения
tr: Önizleme Uyarısı
zh_hans: 预览警告
zh_hant: 預覽警告

source: (external)
cs: (externí)
de: (extern)
es: (externo)
fr: (externe)
ja: (外部)
ko: (외부)
pl: (zewnętrzne)
pt_br: (externo)
ru: (внешний)
tr: (dış)
zh_hans: (外部)
zh_hant: (外部)

source: Automatic Line Ender
cs: Automatický ukončovač řádků
de: Automatisches Zeilenende
es: Finalizador de líneas automático
fr: Fin de ligne automatique
it: Fine riga automatico
ja: 行の自動終了
ko: 자동 줄 끝내기
pl: Automatyczne kończenie wiersza
pt_br: Finalizador de Linha Automático
ru: Автоматическое окончание строки
tr: Otomatik Satır Sonlandırıcısı
zh_hans: 最终自动行
zh_hant: 自動加入行尾工具

source: Automatically completing...
cs: Automaticky se dokončuje...
de: Wird automatisch ergänzt...
es: Completando automáticamente...
fr: Finalisation automatique...
it: Completamento automatico in...
ja: 自動補完しています...
ko: 자동 완성 중...
pl: Trwa automatyczne uzupełnianie...
pt_br: Concluindo automaticamente...
ru: Автоматическое завершение...
tr: Otomatik olarak tamamlanıyor...
zh_hans: 正在自动完成...
zh_hant: 自動完成中...

source: Automatic Pair Completion
it: Completamento coppia automatico
ja: ペアの自動補完
pl: Automatyczne uzupełnianie par
tr: Otomatik Çift Tamamlaması
zh_hans: 自动配对完成

source: An active inline rename session is still active. Complete it before starting a new one.
cs: Současná relace přejmenování na řádku je pořád aktivní. Než začnete novou, dokončete ji.
de: Eine aktive Inline-Umbenennungssitzung ist noch aktiv. Beenden Sie sie, bevor Sie eine neue starten.
es: Una sesión de cambio de nombre en línea sigue activa. Complétela antes de iniciar otra.
fr: Une session de changement de nom inline est toujours active. Terminez-la avant d'en commencer une nouvelle.
it: Una sessione di ridenominazione inline è ancora attiva. Completarla prima di avviarne una nuova.
ja: アクティブなインラインの名前変更セッションがアクティブなままです。新しいセッションを開始する前に完了してください。
ko: 활성 인라인 이름 바꾸기 세션이 여전히 활성화되어 있습니다. 새 세션을 시작하기 전에 완료하세요.
pl: Aktywna sesja operacji zmiany nazwy wstawionego elementu nie została jeszcze zakończona. Zakończ ją przed uruchomieniem nowej sesji.
pt_br: Uma sessão de renomeação embutida ativa ainda está ativa. Conclua-a antes de iniciar uma nova.
ru: Встроенный сеанс переименования еще активен. Завершите его прежде, чем начинать новый.
tr: Etkin bir satır içi yeniden adlandırma oturumu hala etkin. Yenisini başlatmadan önce bunu tamamlayın.
zh_hans: 有效的内联重命名会话仍处于活动状态。在开始一个新会话前完成它。
zh_hant: 現用內嵌重新命名工作階段仍在執行中。請先加以結束，然後再啟動新的工作階段。

source: The buffer is not part of a workspace.
it: Il buffer non fa parte di un'area di lavoro.
ja: バッファーはワークスペースの一部ではありません。
pl: Bufor nie jest częścią obszaru roboczego.
tr: Arabellek bir çalışma alanının parçası değil.
zh_hans: 缓冲区不是工作区的一部分。

source: The token is not contained in the workspace.
it: Il token non è contenuto nell'area di lavoro.
ja: トークンはワークスペースに含まれていません。
pl: Token nie znajduje się w obszarze roboczym.
tr: Belirteç çalışma alanında yer almaz.
zh_hans: 工作区中不包含该标记。

source: You must rename an identifier.
it: È necessario rinominare un identificatore.
ja: 識別子の名前を変更する必要があります。
pl: Należy zmienić nazwę identyfikatora.
tr: Bir tanımlayıcıyı yeniden adlandırmalısınız.

source: You cannot rename this element.
it: Non è possibile rinominare questo elemento.
ja: この要素の名前を変更することはできません。
pl: Nie można zmienić nazwy tego elementu.
tr: Bu öğeyi yeniden adlandıramazsınız.

source: Please resolve errors in your code before renaming this element.
it: Prima di rinominare l'elemento risolvere gli errori nel codice.
ja: この要素の名前を変更する前に、コード内のエラーを解決してください。
pl: Przed zmianą nazwy tego elementu napraw problemy występujące w kodzie.
tr: Bu öğeyi yeniden adlandırmadan önce lütfen kodunuzdaki hataları çözümleyin.

source: You cannot rename operators.
it: Non è possibile rinominare gli operatori.
ja: 演算子の名前を変更することはできません。
pl: Nie można zmienić nazw operatorów.
tr: Operatörleri yeniden adlandıramazsınız.

source: You cannot rename elements that are defined in metadata.
it: Non è possibile rinominare elementi definiti nei metadati.
ja: メタデータで定義されている要素の名前を変更することはできません。
pl: Nie można zmienić nazw elementów zdefiniowanych w metadanych.
tr: Meta verilerde tanımlanan öğeleri yeniden adlandıramazsınız.

source: You cannot rename elements from previous submissions.
it: Non è possibile rinominare elementi di invii precedenti.
ja: 前の送信からの要素の名前を変更することはできません。
pl: Nie można zmienić nazw elementów pochodzących z poprzednich przesłanych elementów.
tr: Öğeleri önceki gönderimlerden yeniden adlandıramazsınız.

source: Navigation Bars
cs: Navigační panely
de: Navigationsleisten
es: Barras de navegación
fr: Barres de navigation
it: Barre di spostamento
ja: ナビゲーション バー
ko: 탐색 모음
pl: Paski nawigacji
pt_br: Barras de Navegação
ru: Панели навигации
tr: Gezinti Çubukları
zh_hans: 导航栏
zh_hant: 導覽列

source: Refreshing navigation bars...
cs: Aktualizují se navigační panely...
de: Navigationsleisten werden aktualisiert...
es: Actualizando barras de navegación...
fr: Actualisation des barres de navigation...
it: Aggiornamento delle barre di spostamento in corso...
ja: ナビゲーション バーを更新しています...
ko: 탐색 모음을 새로 고치는 중...
pl: Trwa odświeżanie pasków nawigacji...
pt_br: Atualizando barras de navegação...
ru: Идет обновление панелей переходов...
tr: Gezinti çubukları yenileniyor...
zh_hans: 正在刷新导航栏...
zh_hant: 正在重新整理導覽列...

source: Format Token
it: Formatta token
ja: 書式トークン
pl: Token formatu
tr: Belirteci Biçimlendir
zh_hans: 设置标记的格式

source: Find References
cs: Najít odkazy
de: Verweise suchen
es: Buscar referencias
fr: Recherche de références
it: Trova riferimenti
ja: 参照の検索
ko: 참조 찾기
pl: Znajdź odwołania
pt_br: Localizar Referências
ru: Найти ссылки
tr: Başvuruları Bul
zh_hans: 查找引用
zh_hant: 尋找參考

source: Finding references...
it: Ricerca dei riferimenti in corso...
ja: 参照を検索しています...
pl: Trwa znajdowanie odwołań...
tr: Başvurular bulunuyor...
zh_hans: 正在查找引用...

source: Finding references of "{0}"...
it: Ricerca dei riferimenti di "{0}"...
ja: "{0}" の参照を検索しています...
pl: Trwa znajdowanie odwołań dla elementu „{0}”...
tr: "{0}" başvuruları bulunuyor...
zh_hans: 正在查找“{0}”的引用...

source: Comment Selection
cs: Výběr komentáře
de: Kommentar für Auswahl
es: Selección con comentarios
fr: Commenter la sélection
it: Commenta selezione
ja: 選択範囲のコメント
ko: 선택 영역을 주석으로 처리
pl: Zakomentuj zaznaczenie
pt_br: Comentar Seleção
ru: Закомментировать выделенный фрагмент
tr: Seçimi Açıklama Satırı Yap
zh_hans: 注释选定内容
zh_hant: 註解選取範圍

source: Uncomment Selection
cs: Odkomentovat výběr
de: Kommentar aus Auswahl entfernen
es: Selección sin comentarios
fr: Annuler le commentaire de la sélection
it: Rimuovi commento selezione
ja: 選択範囲のコメントを解除
ko: 선택 영역의 주석 처리 제거
pl: Odkomentuj zaznaczenie
pt_br: Remover Comentários da Seleção
ru: Раскомментировать выделенный фрагмент
tr: Seçimi İşletilir Koda Çevir
zh_hans: 取消注释选定内容
zh_hant: 取消註解選取範圍

source: Commenting currently selected text...
cs: Přidává se komentář k aktuálně vybranému textu...
de: Aktuell markierten Text kommentieren...
es: Comentando el texto seleccionado actualmente...
fr: Ajout de commentaires au texte actuellement sélectionné...
it: Inserimento di commenti sul testo attualmente selezionato...
ja: 現在選択されているテキストをコメントにしています...
ko: 현재 선택한 텍스트를 주석으로 처리하는 중...
pl: Trwa dodawanie komentarza do aktualnie zaznaczonego tekstu...
pt_br: Comentando o texto selecionado no momento...
ru: Комментирование выбранного текста...
tr: Seçilen metne açıklama ekleniyor...
zh_hans: 正在对当前所选文本进行注释...
zh_hant: 正在將目前所選文字設為註解...

source: Uncommenting currently selected text...
cs: Odstraňuje se komentování aktuálně vybraného textu...
de: Die Kommentierung des aktuell markierten Texts wird aufgehoben...
es: Quitando los comentarios del texto seleccionado actualmente...
fr: Suppression des marques de commentaire du texte sélectionné...
it: Rimozione del commento sul testo attualmente selezionato...
ja: 現在選択されているテキストをコメント解除しています...
ko: 현재 선택한 텍스트의 주석 처리를 제거하는 중...
pl: Trwa usuwanie komentarza do aktualnie zaznaczonego tekstu...
pt_br: Removendo marca de comentário do texto selecionado no momento...
ru: Раскомментирование выбранного текста...
tr: Seçili metnin açıklaması kaldırılıyor...
zh_hans: 正在取消对当前所选文本的注释...
zh_hant: 正在取消註解目前選取的文字...

source: Insert new line
cs: Vložit nový řádek
de: Neue Zeile einfügen
es: Insertar nueva línea
fr: Insérer une nouvelle ligne
it: Inserisci nuova riga
ja: 改行の挿入
ko: 새 줄 삽입
pl: Wstaw nowy wiersz
pt_br: Inserir Nova Linha
ru: Вставить новую строку
tr: Yeni Satır Ekle
zh_hans: 插入新行
zh_hant: 插入新行

source: Documentation Comment
cs: Dokumentační komentář
de: Dokumentationskommentar
es: Comentario de documentación
fr: Commentaire de documentation
it: Commento documentazione
ja: ドキュメントのコメント
ko: 문서 주석
pl: Komentarz do dokumentacji
pt_br: Comentário de Documentação
ru: Комментарий к документации
tr: Belge Açıklaması
zh_hans: 文档注释
zh_hant: 文件註解

source: Inserting documentation comment...
cs: Vkládá se dokumentační komentář...
de: Der Dokumentationskommentar wird eingefügt...
es: Insertando comentario de documentación...
fr: Insertion d'un commentaire de documentation...
it: Inserimento del commento sulla documentazione...
ja: ドキュメントのコメントを挿入しています...
ko: 문서 주석 삽입 중...
pl: Trwa wstawianie komentarza do dokumentacji...
pt_br: Inserindo comentário da documentação...
ru: Вставка комментария документации...
tr: Belge açıklaması ekleniyor...
zh_hans: 正在插入文档注释...
zh_hant: 正在插入文件註解...

source: Extract Method
cs: Extrahovat metodu
de: Methode extrahieren
es: Extraer método
fr: Extraire la méthode
it: Estrai metodo
ja: メソッドの抽出
ko: 메서드 추출
pl: Wyodrębnianie metody
pt_br: Extrair Método
ru: Извлечение метода
tr: Metodu Ayıkla
zh_hans: 提取方法
zh_hant: 擷取方法

source: Applying "Extract Method" refactoring...
cs: Použije se refaktoring Extrahovat metodu...
de: Refactoring "Methode extrahieren" wird angewendet...
es: Aplicando la refactorización "Extraer método"...
fr: Application de la refactorisation "Extraire la méthode"...
it: Applicazione del refactoring per "Estrai metodo"...
ja: "メソッドの抽出" リファクタリングを適用しています...
ko: "메서드 추출" 리팩토링 적용 중...
pl: Trwa stosowanie refaktoryzacji „Wyodrębnij metodę”...
pt_br: Aplicando refatoração "Extrair Método"...
ru: Применение рефакторинга "метода извлечения"...
tr: "Yöntemi Ayıklama" yeniden düzenlemesi uygulanıyor...
zh_hans: 正在应用“提取方法”重构...
zh_hant: 正在套用「擷取方法」重構...

source: Format Document
it: Formatta documento
ja: ドキュメントのフォーマット
pl: Formatuj dokument
tr: Belgeyi Biçimlendir
zh_hans: 设置文档的格式

source: Formatting document...
cs: Formátuje se dokument...
de: Dokument wird formatiert...
es: Dando formato al documento...
fr: Mise en forme du document...
it: Formattazione del documento...
ja: ドキュメントを書式設定しています...
ko: 문서 서식을 지정하는 중...
pl: Trwa formatowanie dokumentu...
pt_br: Formatando documento...
ru: Идет форматирование документа...
tr: Belge biçimlendiriliyor...
zh_hans: 正在设置文档格式...
zh_hant: 正在格式化文件...

source: Formatting
cs: Formátování
de: Formatierung
es: Formato
fr: Mise en forme
it: Formattazione
ja: 書式設定
ko: 서식
pl: Formatowanie
pt_br: Formatação
ru: Форматирование
tr: Biçimlendirme
zh_hans: 格式设置
zh_hant: 格式化

source: Format Selection
it: Formatta selezione
ja: 選択範囲のフォーマット
pl: Formatuj zaznaczenie
tr: Biçim Seçimi
zh_hans: 设置选定内容的格式

source: Formatting currently selected text...
cs: Formátuje se aktuálně vybraný text...
de: Aktuell markierter Text wird formatiert...
es: Dando formato al texto seleccionado actualmente...
fr: Mise en forme du texte actuellement sélectionné...
it: Formattazione del testo attualmente selezionato...
ja: 現在選択されているテキストを書式設定しています...
ko: 현재 선택한 텍스트의 서식을 지정하는 중...
pl: Trwa formatowanie aktualnie zaznaczonego tekstu...
pt_br: Formatando texto selecionado no momento...
ru: Идет форматирование выбранного текста...
tr: Seçilen metin biçimlendiriliyor...
zh_hans: 正在设置当前所选文本的格式...
zh_hant: 正在格式化目前選取的文字...

source: Go to Definition
cs: Přejít k definici
de: Gehe zu Definition
es: Ir a definición
fr: Atteindre la définition
it: Vai a definizione
ja: 定義へ移動
ko: 정의로 이동
pl: Przejdź do definicji
pt_br: Ir para Definição
ru: Перейти к определению
tr: Tanıma Git
zh_hans: 转到定义
zh_hant: 移至定義

source: Navigating to definition...
cs: Naviguje se na definici...
de: Navigation zu Definition...
es: Navegando a la definición...
fr: Navigation jusqu'à la définition...
it: Passaggio alla definizione...
ja: 定義に移動しています...
ko: 정의를 탐색하는 중...
pl: Trwa przechodzenie do definicji...
pt_br: Navegando para definição...
ru: Переход к определению...
tr: Tanıma gidiliyor...
zh_hans: 正在导航到定义...
zh_hant: 正在巡覽至定義...

source: Organize Document
cs: Uspořádat dokument
de: Dokument organisieren
es: Organizar documento
fr: Organiser le document
it: Organizza documento
ja: ドキュメントの整理
ko: 문서 구성
pl: Organizuj dokument
pt_br: Organizar Documento
ru: Упорядочить документ
tr: Belgeyi Düzenle
zh_hans: 组织文档
zh_hant: 整理文件

source: Organizing document...
cs: Uspořádává se dokument...
de: Dokument wird organisiert...
es: Organizando documento...
fr: Organisation du document...
it: Organizzazione del documento...
ja: ドキュメントを整理しています...
ko: 문서 구성 중...
pl: Trwa organizowanie dokumentu...
pt_br: Organizando documento...
ru: Идет упорядочивание документа...
tr: Belge düzenleniyor...
zh_hans: 正在组织文档...
zh_hant: 正在整理文件...

source: Highlighted Definition
cs: Zvýrazněná definice
de: Hervorgehobene Definition
es: Definición resaltada
fr: Définition mise en surbrillance
it: Definizione evidenziata
ja: 強調表示の定義
ko: 강조 표시된 정의
pl: Wyróżniona definicja
pt_br: Definição Realçada
ru: Выделенное определение
tr: Vurgulanan Tanım
zh_hans: 突出显示的定义
zh_hant: 反白顯示的定義

source: The new name is not a valid identifier.
cs: Nový název není platným identifikátorem.
de: Der neue Name ist kein gültiger Bezeichner.
es: El nuevo nombre no es un identificador válido.
fr: Le nouveau nom est un identificateur non valide.
it: Il nuovo nome non è un identificatore valido.
ja: 新しい名前は、有効な識別子ではありません。
ko: 새 이름이 유효한 식별자가 아닙니다.
pl: Nowa nazwa nie jest prawidłowym identyfikatorem.
pt_br: O novo nome não é um identificador válido.
ru: Новое имя не является допустимым идентификатором.
tr: Yeni ad geçerli bir tanımlayıcı değil.
zh_hans: 新名称不是有效的标识符。
zh_hant: 新名稱不是有效的識別項。

source: Inline Rename Fixup
cs: Oprava přejmenování na řádku
de: Inline-Umbenennungskorrektur
es: Corrección de cambio de nombre en línea
fr: Correction du changement de nom inline
it: Ridenominazione inline - Correzione
ja: インラインの名前変更の Fixup
ko: 인라인 이름 바꾸기 픽스업
pl: Naprawa operacji zmiany nazwy wstawionego elementu
pt_br: Correção de Renomeação Embutida
ru: Исправление встроенного переименования
tr: Satır İçi Yeniden Adlandırma Düzeltmesi
zh_hans: 内联重命名修复
zh_hant: 內嵌重新命名修復

source: Inline Rename Resolved Conflict
it: Ridenominazione inline - Conflitto risolto
ja: インラインの名前変更の競合を解決しました
pl: Rozwiązano konflikt z operacją zmiany nazwy wstawionego elementu
tr: Satır İçi Yeniden Adlandırma Çözümlenen Çakışması
zh_hans: 内联重命名已解决冲突

source: Inline Rename
cs: Přejmenování na řádku
de: Inline-Umbenennung
es: Cambio de nombre en línea
fr: Changement de nom inline
it: Ridenominazione inline
ja: インラインの名前変更
ko: 인라인 이름 바꾸기
pl: Operacja zmiany nazwy wstawionego elementu
pt_br: Renomeação embutida
ru: Встроенное переименование
tr: Satır İçi Yeniden Adlandırma
zh_hans: 内联重命名
zh_hant: 內嵌重新命名

source: Rename
cs: Přejmenovat
de: umbenennen
es: Cambiar nombre
fr: renommer
it: Rinomina
ja: 名前の変更
ko: 이름 바꾸기
pl: Zmień nazwę
pt_br: renomear
ru: Переименование
tr: Yeniden adlandır
zh_hans: 重命名
zh_hant: 重新命名

source: Start Rename
cs: Začít přejmenování
de: Umbenennen beginnen
es: Iniciar el cambio de nombre
fr: Démarrer le changement de nom
it: Avvia ridenominazione
ja: 名前の変更を開始
ko: 이름 바꾸기 시작
pl: Rozpocznij zmienianie nazw
pt_br: Iniciar Renomeação
ru: Начать переименование
tr: Yeniden Adlandırmayı Başlat
zh_hans: 开始重命名
zh_hant: 開始重新命名

source: Display conflict resolutions
it: Visualizza le risoluzioni dei conflitti
ja: 競合する解像度の表示
pl: Wyświetl rozwiązane konflikty
tr: Çakışma çözümlemelerini görüntüle
zh_hans: 显示冲突解决方法

source: Finding token to rename...
cs: Hledá se token k přejmenování...
de: Umzubenennendes Token wird gesucht...
es: Buscando token al que cambiar el nombre...
fr: Recherche du jeton à renommer...
it: Ricerca del token da rinominare...
ja: 名前を変更するトークンを検索しています...
ko: 이름을 바꿀 토큰을 찾는 중...
pl: Trwa znajdowanie tokenu, którego nazwa ma zostać zmieniona...
pt_br: Localizando token para renomear...
ru: Поиск токена для переименования...
tr: Yeniden adlandırılacak belirteç bulunuyor...
zh_hans: 正在查找要重命名的标记...
zh_hant: 正在尋找要重新命名的語彙基元...

source: Conflict
cs: Konflikt
de: Konflikt
es: Conflicto
fr: Conflit
it: Conflitto
ja: 競合
ko: 충돌
pl: Konflikt
pt_br: Conflito
ru: Конфликт
tr: Çakışma
zh_hans: 冲突
zh_hant: 衝突

source: Text Navigation
cs: Navigace v textu
es: Navegación de texto
fr: Navigation texte
it: Navigazione testo
ja: テキストのナビゲーション
ko: 텍스트 탐색
pl: Nawigacja w tekście
pt_br: Navegação de Texto
ru: Навигация по тексту
tr: Metin Gezintisi
zh_hans: 文本导航
zh_hant: 文字導覽

source: Finding word extent...
cs: Hledá se rozsah slov...
de: Wortumfang wird gesucht...
es: Buscando extensión de la palabra...
fr: Recherche de l'étendue du mot...
it: Ricerca dell'estensione parola...
ja: 単語の範囲を検索しています...
ko: 단어 범위를 찾는 중...
pl: Trwa znajdowanie zakresu słowa...
pt_br: Localizando de extensão de palavra...
ru: Поиск экстента слова...
tr: Sözcük kapsamı bulunuyor...
zh_hans: 正在查找单词范围...
zh_hant: 正在尋找單字範圍...

source: Finding enclosing span...
cs: Hledá se uzavírající rozpětí...
de: Einschließender Bereich wird gesucht...
es: Buscando intervalo envolvente...
fr: Recherche de l'étendue fermante...
it: Ricerca dell'elemento span di inclusione...
ja: 囲む範囲を検索しています...
ko: 바깥쪽 범위를 찾는 중...
pl: Trwa znajdowanie zakresu otaczającego...
pt_br: Localizando alcance de delimitação...
ru: Поиск вмещающего диапазона...
tr: Kapsayan yayılım bulunuyor...
zh_hans: 正在寻找封闭范围...
zh_hant: 正在尋找封閉式 Span...

source: Finding span of next sibling...
cs: Hledá se rozpětí další položky na stejné úrovni...
de: Bereich des nächsten gleichgeordneten Elements wird gesucht...
es: Buscando intervalo del siguiente elemento del mismo nivel...
fr: Recherche de l'étendue du frère suivant...
it: Ricerca dell'elemento span dell'elemento di pari livello successivo...
ja: 次の兄弟の範囲を検索しています...
ko: 다음 형제의 범위를 찾는 중...
pl: Trwa znajdowanie zakresu następnego elementu na tym samym poziomie...
pt_br: Localizando a extensão do próximo irmão...
ru: Поиск диапазона следующего одноуровневого элемента...
tr: Sonraki eşdüzeyin yayılımı bulunuyor...
zh_hans: 正在查找下一个同级的范围...
zh_hant: 正在尋找下一個同層級的 Span...

source: Finding span of previous sibling...
cs: Hledá se rozpětí předchozí položky na stejné úrovni...
de: Bereich des vorherigen gleichgeordneten Elements wird gesucht...
es: Buscando intervalo del anterior elemento del mismo nivel...
fr: Recherche de l'étendue du frère précédent...
it: Ricerca dell'elemento span dell'elemento di pari livello precedente...
ja: 前の兄弟の範囲を検索しています...
ko: 이전 형제의 범위를 찾는 중...
pl: Trwa znajdowanie zakresu poprzedniego elementu na tym samym poziomie...
pt_br: Localizando a extensão do irmão anterior...
ru: Поиск диапазона предыдущего одноуровневого элемента...
tr: Önceki eşdüzeyin yayılımı bulunuyor...
zh_hans: 正在查找上一个同级的范围...
zh_hant: 正在尋找上一個同層級的 Span......

# Rename_colon_0
source: Rename: {0}
cs: Přejmenovat: {0}
de: Umbenennen: {0}
fr: Renommer : {0}
it: Rinomina: {0}
ja: {0} の名前変更
ko: 이름 바꾸기: {0}
pl: Zmień nazwę: {0}
pt_br: Renomear: {0}
ru: Переименовать: {0}
tr: Yeniden adlandırma: {0}
zh_hans: 重命名: {0}

source: Light bulb session is already dismissed.
it: La sessione lampadina è già stata chiusa.
ja: 電球セッションは既に閉鎖されています。
pl: Sesję prezentowania pomysłów już odrzucono.
tr: Ampul oturumu zaten kapatıldı.
zh_hans: 灯泡会话已解除。

source: Automatic Pair Completion End Point Marker Color
it: Colore marcatore punto finale per completamento coppia automatico
ja: ペアの自動補完の終点のマーカーの色
pl: Kolor znacznika punktu końcowego automatycznego uzupełniania par
tr: Otomatik Çift Tamamlaması Bitiş Noktası İşaret Rengi
zh_hans: 自动配对完成终点标记颜色

source: Renaming anonymous type members is not yet supported.
it: La ridenominazione di membri con tipo anonimo non è ancora supportata.
ja: 匿名型メンバーの名前の変更は、まだサポートされていません。
pl: Zmienianie nazwy anonimowych składowych typu nie jest jeszcze obsługiwane.
tr: Anonim türdeki üyeleri yeniden adlandırma henüz desteklenmiyor.

source: Engine must be attached to an Interactive Window.
cs: Stroj musí být připojený k oknu Interactive.
de: Engine muss an das Interactive-Fenster angefügt werden.
es: El motor debe estar asociado a una ventana interactiva.
fr: Le moteur doit être attaché à une fenêtre interactive.
it: Il motore deve essere collegato a una finestra interattiva.
ja: インタラクティブ ウィンドウにエンジンを関連付ける必要があります。
ko: 엔진은 대화형 창에 연결되어 있어야 합니다.
pl: Aparat musi być dołączony do okna Interactive.
pt_br: O Mecanismo deve ser anexado a uma Janela Interativa.
ru: Модуль должен быть подключен к Интерактивному окну.
tr: Altyapı, Etkileşimli Pencere'ye iliştirilmelidir.
zh_hans: 引擎必须附加到“交互窗口”。
zh_hant: 引擎必須連結到互動視窗。

source: Changes the current prompt settings.
it: Cambia le impostazioni correnti del prompt.
ja: 現在のプロンプトの設定を変更します。
pl: Zmienia bieżące ustawienia monitu.
tr: Geçerli istem ayarlarını değiştirir.
zh_hans: 更改当前提示设置。

# Unexpected_text_colon_0
source: Unexpected text: '{0}'
it: Testo imprevisto: '{0}'
ja: 予期しないテキスト: '{0}'
pl: Nieoczekiwany tekst: „{0}”
tr: Beklenmeyen metin: '{0}'
zh_hans: 意外的文本:“{0}”

source: The triggerSpan is not included in the given workspace.
cs: triggerSpan není obsažený v pracovním prostoru.
de: Die triggerSpan ist im angegebenen Arbeitsbereich nicht enthalten.
es: El triggerSpan no está incluido en el área de trabajo.
fr: triggerSpan n'est pas inclus dans l'espace de travail donné.
it: L'elemento triggerSpan non è incluso nell'area di lavoro specificata.
ja: triggerSpan は指定されたワークスペースに含まれていません。
ko: triggerSpan이 지정한 작업 영역에 포함되어 있지 않습니다.
pl: Element triggerSpan nie jest dołączony do danego obszaru roboczego.
pt_br: O triggerSpan não está incluído no workspace fornecido.
ru: Этот triggerSpan не входит в данную рабочую область.
tr: triggerSpan verilen çalışma alanında yer almaz.
zh_hans: 给定工作区中不包括 triggerSpan。
zh_hant: 指定的工作區未包含 triggerSpan。

source: This session has already been dismissed.
cs: Tato relace už je zavřená.
de: Diese Sitzung wurde bereits beendet.
es: Esta sesión ya se ha descartado.
fr: Cette session a déjà été fermée.
it: Questa sessione è già stata chiusa.
ja: このセッションは既に終了しています。
ko: 이 세션은 이미 해제되었습니다.
pl: Ta sesja została już odrzucona.
pt_br: Esta sessão já foi descartada.
ru: Этот сеанс уже закрыт.
tr: Bu oturum zaten bırakıldı.
zh_hans: 已解除该会话。
zh_hant: 此工作階段已關閉。

source: The transaction is already complete.
cs: Transakce je už dokončená.
de: Die Transaktion ist bereits abgeschlossen.
es: La transacción ya está completa.
fr: La transaction est déjà terminée.
it: La transazione è già completata.
ja: トランザクションが既に完了します。
ko: 트랜잭션이 이미 완료되었습니다.
pl: Transakcja jest już ukończona.
pt_br: A transação já está concluída.
ru: Транзакция уже выполнена.
tr: İşlem zaten tamamlandı.
zh_hans: 该事务已完成。
zh_hant: 交易已完成。

source: Not a source error, line/column unavailable
it: L'errore non dipende dall'origine. La riga o la colonna non è disponibile.
ja: ソース エラーではなく、行/列を使用できません
pl: To nie jest błąd źródła. Brak dostępnego wiersza/kolumny
tr: Kaynak hatası değil, satır/sütun kullanılamıyor
zh_hans: 不是源错误，行/列不可用
