Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Inline Rename Field Text
cs: Text pole při přejmenovávání na řádku
de: Text für das Feld zur Inlineumbenennung
es: Texto del campo de cambio de nombre en línea
fr: Texte du champ de changement de nom inline
it: Ridenominazione inline - Campo di testo
ja: インラインの名前変更フィールドのテキスト
ko: 인라인 이름 바꾸기 필드 텍스트
pl: Tekst pola zmiany nazwy wstawionego elementu
pt_br: Texto do Campo de Renomeação Embutida
ru: Текст поля "Встроенное переименование"
tr: Satır İçi Alan Metnini Yeniden Adlandır
zh_hans: 内联重命名字段文本
zh_hant: 內嵌重新命名欄位的文字

source: Block Comment Editing
cs: Blokovat úpravy komentářů
de: Blockkommentarbearbeitung
es: Bloquear la edición de comentarios
fr: Bloquer la modification des commentaires
it: Blocca modifica dei commenti
ja: コメント編集のブロック
ko: 주석 편집 차단
pl: Edytowanie komentarzy blokowych
pt_br: Bloquear Edição de Comentário
ru: Изменение блочных комментариев
tr: Açıklama Düzenlemeyi Engelle
zh_hans: 阻止注释编辑
zh_hant: 區塊註解編輯

source: Comment/Uncomment Selection
cs: Okomentovat/odkomentovat výběr
de: Auswahl auskommentieren/Auskommentierung aufheben
es: Poner/Quitar marca de comentario a la selección
fr: Commenter/décommenter la sélection
it: Aggiungi/Rimuovi commento selezione
ja: 選択範囲のコメント/コメント解除
ko: 선택 영역 주석 처리/주석 처리 제거
pl: Zakomentuj/odkomentuj zaznaczenie
pt_br: Comentar/Remover Marca de Comentário da Seleção
ru: Закомментировать/раскомментировать выбранный фрагмент
tr: Seçimi Açıklama Satırı Yap/Seçimin Açıklamasını Kaldır
zh_hans: 注释/取消注释选定内容
zh_hant: 註解/取消註解選取範圍

source: Code Completion
it: Completamento codice
ja: コード補完
pl: Uzupełnianie kodu
tr: Kod Tamamlama
zh_hans: 代码完成

source: Execute In Interactive
cs: Provést v interaktivní součásti
de: In interaktivem Fenster ausführen
es: Ejecutar en modo interactivo
fr: Exécuter en mode interactif
it: Esegui in finestra interattiva
ja: 対話形式で実行
ko: 대화형으로 실행
pl: Wykonaj w trybie interaktywnym
pt_br: Executar em Interativo
ru: Выполнять в интерактивном режиме
tr: Etkileşimli içinde Yürüt
zh_hans: 交互执行
zh_hant: 以互動方式執行

source: Extract Interface
cs: Extrahovat rozhraní
de: Schnittstelle extrahieren
es: Extraer interfaz
fr: Extraire l'interface
it: Estrai interfaccia
ja: インターフェイスの抽出
ko: 인터페이스 추출
pl: Wyodrębnij interfejs
pt_br: Extrair a Interface
ru: Извлечь интерфейс
tr: Arabirimi Ayıkla
zh_hans: 提取接口
zh_hant: 擷取介面

source: Go To Adjacent Member
cs: Přejít na sousední člen
de: Zu angrenzendem Member wechseln
es: Ir a miembro adyacente
fr: Atteindre le membre adjacent
it: Vai al membro adiacente
ja: 隣接するメンバーに移動
ko: 인접 멤버로 이동
pl: Przejdź do sąsiadującej składowej
pt_br: Ir para Membro Adjacente
ru: Перейти к смежному элементу
tr: Bitişik Üyeye Git
zh_hans: 转到相邻成员
zh_hant: 移至相鄰成員

source: Interactive
de: Interaktiv
es: Interactivo
fr: Interactif
it: Finestra interattiva
ja: 対話型
ko: 대화형
pl: Interaktywne
pt_br: Interativo
ru: Интерактивный режим
tr: Etkileşimli
zh_hans: 交互
zh_hant: 互動式

source: Paste in Interactive
cs: Vložit do Interactive
de: In interaktivem Fenster einfügen
es: Pegar en interactivo
fr: Coller en mode interactif
it: Incolla in finestra interattiva
ja: 対話形式で貼り付け
ko: 대화형으로 붙여넣기
pl: Wklej w trybie interaktywnym
pt_br: Colar em Interativo
ru: Вставить в интерактивном режиме
tr: Etkileşimli Pencereye Yapıştır
zh_hans: 交互粘贴
zh_hant: 以互動方式貼上

# Navigate_To_Highlight_Reference
source: Navigate To Highlighted Reference
cs: Přejít na zvýrazněný odkaz
de: Zu hervorgehobenem Verweis navigieren
es: Navegar a referencia resaltada
fr: Naviguer vers la référence en surbrillance
it: Passa al riferimento evidenziato
ja: 強調表示された参照へ移動
ko: 강조 표시 참조로 이동
pl: Przejdź do wyróżnionego odwołania
pt_br: Navegar para Referência Realçada
ru: Перейти к выделенной ссылке
tr: Vurgulanan Başvuruya Git
zh_hans: 导航到突出显示引用
zh_hant: 巡覽至反白顯示的參考

source: Outlining
cs: Sbalení
de: Gliederung
es: Esquematización
fr: Mode plan
it: Struttura
ja: アウトライン
ko: 개요
pl: Konspekt
pt_br: Estrutura de Tópicos
ru: Структура
tr: Ana Hat
zh_hans: 大纲
zh_hant: 大綱

source: Regex - Comment
cs: Regulární výrazy – komentář
de: RegEx - Kommentar
es: Regex - comentario
fr: Regex - commentaire
ko: Regex - 주석
pl: Wyrażenie regularne — komentarz
pt_br: Regex – Comentário
ru: Регулярные выражения — комментарий
tr: Regex - yorum
zh_hans: 正则表达式 - 注释
zh_hant: Regex - 註解

source: Regex - Character Class
cs: Regulární výrazy – třída znaků
de: RegEx - Zeichenklasse
es: Regex - clase de caracteres
fr: Regex - classe de caractères
ko: Regex - 문자 클래스
pl: Wyrażenie regularne — klasa znaków
pt_br: Regex - Classe de Caracteres
ru: Регулярные выражения — класс символов
tr: Regex - karakter sınıfı
zh_hans: 正则表达式 - 字符类
zh_hant: Regex - 字元類別

source: Regex - Alternation
cs: Regulární výrazy – alternace
de: RegEx - Wechsel
es: Regex - alternancia
fr: Regex - alternance
ko: Regex - 교체
pl: Wyrażenie regularne — alternatywa
pt_br: Regex – Alternância
ru: Регулярные выражения — чередование
tr: Regex - münavebe
zh_hans: 正则表达式 - 交替
zh_hant: Regex - 替代

source: Regex - Anchor
cs: Regulární výrazy – ukotvení
de: RegEx - Anker
es: Regex - ancla
fr: Regex - ancre
ko: Regex - 앵커
pl: Wyrażenie regularne — kotwica
pt_br: Regex – Âncora
ru: Регулярные выражения — якорь
tr: Regex - çapa
zh_hans: 正则表达式 - 定位标记
zh_hant: Regex - 錨點

source: Regex - Quantifier
cs: Regulární výrazy – kvantifikátor
de: RegEx - Quantifizierer
es: Regex - cuantificador
fr: Regex - quantificateur
ko: Regex - 수량자
pl: Wyrażenie regularne — kwantyfikator
pt_br: Regex – Quantificador
ru: Регулярные выражения — квантификатор
tr: Regex - Niceleyici
zh_hans: 正则表达式 - 限定符
zh_hant: Regex - 數量詞

source: Regex - Self Escaped Character
cs: Regulární výrazy – znak uvozující sebe sama
de: RegEx - Selbstständiges Escapezeichen
es: Regex - carácter de autoescape
fr: Regex - caractère auto-échappé
ko: Regex - 자체 이스케이프한 문자
pl: Wyrażenie regularne — znak będący sam dla siebie znakiem ucieczki
pt_br: Regex – Caractere de Escape Próprio
ru: Регулярные выражения — символ с самостоятельным экранированием
tr: Regex - kendi karakter kaçtı
zh_hans: 正则表达式 - 自转义字符
zh_hant: Regex - 自我逸出字元

source: Regex - Grouping
cs: Regulární výrazy – seskupování
de: RegEx - Gruppierung
es: Regex - agrupación
fr: Regex - regroupement
ko: Regex - 그룹화
pl: Wyrażenie regularne — grupowanie
pt_br: Regex – Agrupamento
ru: Регулярные выражения — группировка
tr: Regex - gruplandırma
zh_hans: 正则表达式 - 分组
zh_hant: Regex - 群組

source: Regex - Text
cs: Regulární výrazy – text
es: Regex - texto
fr: Regex - texte
ko: Regex - 텍스트
pl: Wyrażenie regularne — tekst
pt_br: Regex – Texto
ru: Регулярные выражения — текст
tr: Regex - metin
zh_hans: 正则表达式 - 文本
zh_hant: Regex - 文字

source: Regex - Other Escape
cs: Regulární výrazy – ostatní řídicí znaky
de: RegEx - Anderes Escapezeichen
es: Regex - otro Escape
fr: Regex - autre échappement
ko: Regex - 기타 이스케이프
pl: Wyrażenie regularne — inna sekwencja ucieczki
pt_br: Regex – Outro Escape
ru: Регулярные выражения — другая escape-последовательность
tr: Regex - diğer kaçış
zh_hans: 正则表达式 - 其他转义
zh_hant: Regex - 其他逸出

source: Rename Tracking Cancellation
cs: Zrušení sledování přejmenování
de: Abbruch der Umbenennungsnachverfolgung
es: Cancelación de seguimiento de cambio de nombre
fr: Annulation du suivi de renommage
it: Annullamento verifica ridenominazione
ja: 名前変更の追跡取り消し
ko: 추적 이름 바꾸기 취소
pl: Anulowanie śledzenia zmiany nazw
pt_br: Renomear Cancelamento de Acompanhamento
ru: Отмена отслеживания переименования
tr: İzleme İptal Etmeyi Yeniden Adlandır
zh_hans: 重命名跟踪取消
zh_hant: 重新命名追蹤取消

source: Signature Help
cs: Nápověda k signatuře
de: Signaturhilfe
es: Ayuda de signatura
fr: Aide sur les signatures
it: Guida per la firma
ja: シグネチャ ヘルプ
ko: 시그니처 도움말
pl: Pomoc dotycząca sygnatury
pt_br: Ajuda da Assinatura
ru: Справка по сигнатурам
tr: İmza Yardımı
zh_hans: 签名帮助
zh_hant: 簽章說明

source: Smart Token Formatter
it: Formattatore di token intelligente
ja: スマート トークン フォーマッタ
pl: Inteligentny element formatujący tokeny
tr: Akıllı Belirteç Biçimlendirici
zh_hans: 智能令牌格式化程序

source: Computing 'Encapsulate Field' information
cs: Výpočet informací Encapsulate Field
de: Berechnen von "Kapselungsfeld"-Informationen
es: Calculando información de "Encapsular campo"
fr: Calcul des informations « Encapsuler le champ »
ko: 'Encapsulate Field' 정보 계산
pt_br: Computando informações de 'Encapsular Campo'
ru: Вычисление сведений "Инкапсуляция поля"
zh_hans: 计算“封装字段”信息
zh_hant: 正在計算 [封裝欄位] 資訊

source: Rename operation could not complete due to external change to workspace
cs: Operaci přejmenování se nepovedlo dokončit kvůli externí změně pracovního prostoru.
de: Der Umbenennungsvorgang konnte aufgrund einer externen Änderung am Arbeitsbereich nicht abgeschlossen werden
es: No se pudo completar la operación de cambio de nombre debido a un cambio externo en el área de trabajo
fr: L’opération de changement de nom n’a pas pu se terminer en raison d’une modification externe de l’espace de travail
ko: 작업 영역에 대한 외부 변경으로 인해 이름 바꾸기 작업을 완료할 수 없습니다.
pt_br: Não foi possível concluir a operação de renomeação devido a uma alteração externa no espaço de trabalho
ru: Не удалось выполнить операцию переименования из-за внешнего изменения рабочей области
zh_hans: 由于工作区的外部更改，重命名操作无法完成
zh_hant: 由於工作區的外部變更，無法完成重新命名作業

source: Roslyn Test Code
es: Código de prueba de Roslyn
fr: Code de test de Roslyn
ko: Roslyn 테스트 코드
pt_br: Código de Teste do Roslyn
ru: Тестовый код Roslyn
zh_hans: Roslyn 测试代码
zh_hant: Roslyn 測試程式碼

source: Roslyn Test Code Markup
cs: Roslyn – revize testovacího kódu
es: Marcado de código de prueba de Roslyn
fr: Balisage du code de test Roslyn
ko: Roslyn 테스트 코드 마크업
pt_br: Marcação de Código de Teste Roslyn
ru: Разметка тестового кода Roslyn
zh_hans: Roslyn 测试代码标记
zh_hant: Roslyn 測試程式碼標記

source: {0} (Esc to cancel)
cs: {0} (zrušíte klávesou Esc)
de: {0} (Esc zum Abbrechen)
es: {0} (Escape para cancelar)
fr: {0} (Échap pour annuler)
ko: {0}(취소하려면 Esc)
pt_br: {0} (Esc para cancelar)
ru: {0} (для отмены нажмите клавишу ESC)
zh_hans: {0} (Esc 取消)
zh_hant: {0} (按 Esc 取消)

source: An error occurred while generating documentation for this code.
cs: Při generování dokumentace pro tento kód došlo k chybě.
de: Fehler beim Generieren der Dokumentation für diesen Code
es: Se ha producido un error al generar la documentación para este código.
fr: Une erreur s'est produite lors de la génération de la documentation pour ce code.
ko: 이 코드에 대한 설명서를 생성하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao gerar a documentação para este código.
ru: Произошла ошибка при создании документации для этого кода.
zh_hant: 產生此程式碼的文件時發生錯誤。

source: Copilot thinking...
cs: Copilot přemýšlí…
de: Copilot überlegt...
es: Copilot pensando...
fr: Réflexion Copilot...
pt_br: Copilot pensando...
ru: Copilot думает...
zh_hant: Copilot 思考中...

source: Describe with Copilot
cs: Popis s využitím Copilotu
de: Mit Copilot beschreiben
fr: Décrire avec Copilot
pt_br: Descrever com o Copilot
ru: Описать с помощью Copilot

# Generate_summary_with_Copilot
source: Generate summary with Copilot (might be inaccurate)
cs: Vygenerovat souhrn pomocí Copilotu (může být nepřesné)
de: Zusammenfassung mit Copilot generieren (möglicherweise ungenau)
es: Generar resumen con Copilot (puede ser inexacto)
fr: Générer un résumé avec Copilot (peut être inexact)
pt_br: Gerar resumo com o Copilot (pode ser impreciso)
ru: Создать сводку с помощью Copilot (результат может быть неточным)
zh_hant: 使用 Copilot 產生摘要 (可能不準確)

source: Obsolete symbol
cs: Zastaralý symbol
de: Veraltetes Symbol
es: Símbolo obsoleto
fr: Symbole obsolète
ko: 사용되지 않는 기호
pt_br: Símbolo obsoleto
ru: Устаревший символ
zh_hant: 已淘汰的符號

source: On-the-fly documentation
cs: Průběžná dokumentace
de: On-The-Fly-Dokumentation
es: Documentación sobre la marcha
fr: Documentation à la volée
ko: 온더플라이 설명서
pt_br: Documentação dinâmica
ru: Документация на лету
zh_hant: 即時文件

source: Refine using Copilot
cs: Upřesnit pomocí Copilotu
de: Mit Copilot verfeinern
es: Refinar con Copilot
fr: Affiner en utilisant Copilot
ko: Copilot을 사용하여 구체화
pt_br: Refinar usando o Copilot
ru: Уточнить с помощью Copilot
zh_hant: 使用 Copilot 縮小搜尋範圍

source: Run
cs: Spustit
de: Ausführen
es: Ejecutar
fr: Exécuter
ko: 실행
pt_br: Executar
ru: Выполнить
zh_hant: 執行

source: '{0}' declarations and interceptors
cs: Deklarace a zachycovací objekty {0}
es: Declaraciones "{0}" e interceptores
ru: Объявления "{0}" и перехватчики
zh_hant: '{0}' 宣告和攔截器

source: '{0}' intercepted locations
cs: Zachycená místa: {0}
de: Abgefangene Speicherorte „{0}“
es: '{0}' ubicaciones interceptadas
fr: « {0} » emplacements interceptés
pt_br: Locais "{0}" interceptados
ru: Перехваченные расположения: "{0}"
zh_hant: '{0}' 已攔截的位置

source: AI-generated content may be inaccurate
ko: AI 생성 콘텐츠는 부정확할 수 있습니다.

source: GitHub Copilot thinking...
ko: GitHub Copilot이 생각하는 중...

source: Show an AI generated summary of this code
ko: 이 코드의 AI 생성 요약 표시

source: Tell me more
ko: 자세한 정보

source: The symbol has no base.
it: Non è presente alcuna base per il simbolo.
ja: シンボルにベースがありません。

source: '{0}' bases
it: Basi di '{0}'
ja: '{0}' ベース

source: Smart Indenting
it: Rientro automatico
ja: スマート インデント

source: The symbol has no implementations.
it: Non sono presenti implementazioni per il simbolo.
ja: シンボルに実装がありません。

source: '{0}' references
it: 'Riferimenti di '{0}'
ja: '{0}' の参照

source: '{0}' implementations
it: 'Implementazioni di '{0}'
ja: '{0}' の実装

source: Chat limit reached, [upgrade now] or wait for the limit to reset.
es: Se alcanzó el límite de chats, [upgrade now] o esperar a que se restablezca el límite.
zh_hant: 已達到聊天限制，[upgrade now] 或等候重設限制。

# Operation_is_not_ready_for_0_yet_see_task_center_for_more_detail
source: Operation is not ready for "{0}" yet. See bottom left corner for more details.
it: L'operazione non è ancora pronta per "{0}". Per maggiori dettagli, vedere l'angolo in basso a sinistra.

source: Document must be contained in the workspace that created this service
it: Il documento deve essere contenuto nell'area di lavoro che ha creato il servizio

source: from metadata
it: da metadati

source: 'symbol' cannot be a namespace.
it: 'L'elemento 'symbol' non può essere uno spazio dei nomi.

source: Fix all occurrences in
it: Correggi tutte le occorrenze in
