Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core/xlf/EditorFeaturesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Reassigned variable
cs: Znovu přiřazená proměnná
de: Neu zugewiesene Variable
es: Variable reasignada
fr: Variable réaffectée
ko: 다시 할당된 변수
pl: Ponownie przypisane zmienne
pt_br: Reatribuir variável
ru: Переназначенная переменная
tr: Yeniden atanan değişken
zh_hans: 重新分配的变量
zh_hant: 重新指派的變數

# Rename_file_name_doesnt_match
source: Rename _file (type does not match file name)
cs: Přejmenovat _soubor (typ neodpovídá názvu souboru)
de: _Datei umbenennen (Typ entspricht nicht dem Dateinamen)
es: Ca_mbiar nombre de archivo (el tipo no coincide con el nombre de archivo)
fr: Renommer le _fichier (le type ne correspond pas au nom du fichier)
ja: ファイル名の変更 (種類がファイル名と一致しません)(_F)
ko: 파일 이름 바꾸기(형식이 파일 이름과 일치하지 않음)(_F)
pl: Zmień nazwę _pliku (typ nie zgadza się z nazwą pliku)
pt_br: Renomear _arquivo (o tipo não corresponde ao nome do arquivo)
ru: Переименовать фай_л (тип не соответствует имени файла)
tr: _Dosyayı yeniden adlandır (tür, dosya adıyla eşleşmiyor)
zh_hans: 重命名文件(类型与文件名不匹配)(_F)
zh_hant: 重新命名檔案 (類型不符合檔案名稱)(_F)

# Rename_file_partial_type
source: Rename _file (not allowed on partial types)
cs: Přejmenovat _soubor (nepovoleno pro dílčí typy)
de: _Datei umbenennen (bei partiellen Typen nicht zulässig)
es: Ca_mbiar nombre de archivo (no se permite en tipos parciales)
fr: Renommer le _fichier (non autorisé sur les types partiels)
ja: ファイル名の変更 (部分型では許可されません)(_F)
ko: 파일 이름 바꾸기(부분 형식에서 허용되지 않음)(_F)
pl: Zmień nazwę _pliku (niedozwolone dla typów częściowych)
pt_br: Renomear _arquivo (não permitido em tipos parciais)
ru: Переименовать фай_л (недопустимо для разделяемых типов)
tr: _Dosya adını değiştir (kısmi türlerde izin verilmez)
zh_hans: 重命名文件(不允许在分部类型上使用)(_F)
zh_hant: 重新命名檔案 (在部分類型上不允許)(_F)

source: Rename symbol's _file
cs: Přejmenovat _soubor symbolu
de: _Datei des Symbols umbenennen
es: Cambiar nombre del _archivo del símbolo
fr: Renommer le _fichier du symbole
ja: シンボルのファイルの名前を変更する(_F)
ko: 기호의 파일 이름 바꾸기(_F)
pl: Zmień nazwę _pliku symbolu
pt_br: Renomear o _arquivo do símbolo
ru: Переименовать _файл с символом
tr: Sembolün _dosyasını yeniden adlandır
zh_hans: 重命名包含符号的文件(_F)
zh_hant: 為符號的檔案重新命名(_F)

source: Split comment
cs: Dělený komentář
de: Kommentar teilen
es: Dividir comentario
fr: Diviser le commentaire
ja: コメントの分割
ko: 주석 분할
pl: Podziel komentarz
pt_br: Dividir o comentário
ru: Разделительный комментарий
tr: Açıklamayı böl
zh_hans: 拆分注释
zh_hant: 分割註解

source: String - Escape Character
cs: Řetězec – řídicí znak
de: Zeichenfolge - Escape-Zeichen
es: String - carácter de Escape
fr: Chaîne - caractère d'échappement
it: Stringa - Carattere di escape
ja: 文字列 - エスケープ文字
ko: 문자열 - 이스케이프 문자
pl: Ciąg — znak ucieczki
pt_br: String - caractere de Escape
ru: Строка — escape-символ
tr: Dize - Kaçış Karakteri
zh_hans: 字符串 - 转义字符
zh_hant: 字串 - 逸出字元

source: Symbol - Static
cs: Symbol – statický
de: Symbol – statisch
es: Símbolo: estático
fr: Symbole - statique
it: Simbolo - Statico
ja: シンボル - 静的
ko: 기호 - 정적
pl: Symbol — statyczny
pt_br: Símbolo – Estático
ru: Символ — статический
tr: Sembol - statik
zh_hans: 符号-静态
zh_hant: 符號 - 靜態

source: Tab Size
cs: Velikost tabulátoru
de: Tabstoppgröße
es: Tamaño de tabulación
fr: Taille des tabulations
ko: 탭 크기
pl: Rozmiar tabulacji
pt_br: Tamanho da Tabulação
ru: Размер интервала табуляции
tr: Sekme Boyutu
zh_hans: 制表符大小
zh_hant: 索引標籤大小

source: The results may be incomplete due to the solution still loading projects.
cs: Výsledky mohou být neúplné, protože řešení stále načítá projekty.
de: Die Ergebnisse sind möglicherweise unvollständig, da die Projektmappe noch Projekte lädt.
es: Los resultados pueden estar incompletos porque la solución aún está cargando proyectos.
fr: Les résultats sont peut-être incomplets, car la solution est toujours en train de charger des projets.
ko: 솔루션이 아직 프로젝트를 로드하는 중이므로 결과가 불완전할 수 있습니다.
pl: Wyniki mogą być niekompletne, ponieważ rozwiązanie nadal ładuje projekty.
pt_br: Os resultados podem estar incompletos porque a solução ainda está carregando projetos.
ru: Результаты могут быть неполными, поскольку решение еще загружает проекты.
tr: Çözüm projeleri hala yüklemediğinden sonuçlar tamamlanmamış olabilir.
zh_hans: 由于解决方案仍在加载项目，结果可能不完整。
zh_hant: 結果可能不完整，因為方案仍在載入專案。

source: Toggle Block Comment
cs: Přepnout komentář k bloku
de: Kommentarblock ein/aus
es: Alternar comentario de bloque
fr: Activer/désactiver le commentaire de bloc
it: Attiva/Disattiva commento per il blocco
ja: ブロック コメントの切り替え
ko: 블록 주석 토글
pl: Przełącz komentarz blokowy
pt_br: Ativar/Desativar Comentário de Bloco
ru: Переключить комментарий блока
tr: Blok Açıklamasını Aç/Kapat
zh_hans: 切换为块注释
zh_hant: 切換區塊註解

source: Toggle Line Comment
cs: Přepnout komentář k řádku
de: Kommentarzeile ein/aus
es: Alternar comentario de línea
fr: Activer/désactiver le commentaire de ligne
it: Attiva/Disattiva commento per la riga
ja: 行コメントの切り替え
ko: 줄 주석 토글
pl: Przełącz komentarz wiersza
pt_br: Ativar/Desativar Comentário de Linha
ru: Переключить комментарий строки
tr: Satır Açıklamasını Aç/Kapat
zh_hans: 切换为行注释
zh_hant: 切換行註解

source: Toggling block comment...
cs: Přepíná se komentář k bloku...
de: Kommentarblock wird ein-/ausgeschaltet...
es: Alternando comentario de bloque...
fr: Activation/désactivation du commentaire de bloc...
it: Attivazione/disattivazione del commento per il blocco...
ja: ブロック コメントを切り替えています...
ko: 블록 주석을 토글하는 중...
pl: Trwa przełączanie komentarza blokowego...
pt_br: Ativando/desativando o comentário de bloco...
ru: Переключение комментария блока...
tr: Blok açıklaması değiştiriliyor...
zh_hans: 正在切换为块注释...
zh_hant: 正在切換區塊註解...

source: Toggling line comment...
cs: Přepíná se komentář k řádku...
de: Kommentarzeile wird ein-/ausgeschaltet...
es: Alternando comentario de línea...
fr: Activation/désactivation du commentaire de ligne...
it: Attivazione/disattivazione del commento per la riga...
ja: 行コメントを切り替えています...
ko: 줄 주석을 토글하는 중...
pl: Trwa przełączanie komentarza wiersza...
pt_br: Ativando/desativando o comentário de linha...
ru: Переключение комментария строки...
tr: Satır açıklaması değiştiriliyor...
zh_hans: 正在切换为行注释...
zh_hant: 正在切換行註解...

source: Use Tabs
cs: Používat tabulátory
de: Tabstopps verwenden
es: Usar tabulaciones
fr: Utiliser les tabulations
ko: 탭 사용
pl: Użyj tabulatorów
pt_br: Usar Tabulações
ru: Использовать вкладки
tr: Sekmeleri Kullan
zh_hans: 使用制表符
zh_hant: 使用索引標籤

source: User Members - Constants
cs: Uživatelské členy – konstanty
de: Benutzermember – Konstanten
es: Usuarios miembros: constantes
fr: Membres utilisateurs - constantes
it: Membri utente - Costanti
ja: ユーザー メンバー - 定数
ko: 사용자 멤버 - 상수
pl: Składowe użytkowników — stałe
pt_br: Membros de Usuário – Constantes
ru: Участники-пользователи — константы
tr: Kullanıcı Üyeler - Sabitler
zh_hans: 用户成员-常量
zh_hant: 使用者成員 - 常數

source: User Members - Enum Members
cs: Uživatelské členy – členy výčtu
de: Benutzermember – Enumerationsmember
es: Usuarios miembros: miembros de enumeración
fr: Membres utilisateurs - membres Enum
it: Membri utente - Membri enumerazione
ja: ユーザー メンバー - 列挙型メンバー
ko: 사용자 멤버 - 열거형 멤버
pl: Składowe użytkowników — składowe wyliczenia
pt_br: Membros de Usuário – Membros Enum
ru: Участники-пользователи — элементы перечисления
tr: Kullanıcı Üyeleri - Sabit Liste Üyeleri
zh_hans: 用户成员-枚举成员
zh_hant: 使用者成員 - 列舉成員

source: User Members - Events
cs: Uživatelské členy – události
de: Benutzermember – Ereignisse
es: Usuarios miembros: eventos
fr: Membres utilisateurs - événements
it: Membri utente - Eventi
ja: ユーザー メンバー - イベント
ko: 사용자 멤버 - 이벤트
pl: Składowe użytkowników — zdarzenia
pt_br: Membros de Usuário – Eventos
ru: Пользователи-участники — события
tr: Kullanıcı Üyeler - Olaylar
zh_hans: 用户成员-活动
zh_hant: 使用者成員 - 事件

source: User Members - Extension Methods
cs: Uživatelské členy – rozšiřující metody
de: Benutzermember – Erweiterungsmethoden
es: Usuarios miembros: métodos de extensión
fr: Membres utilisateurs - méthodes d'extension
it: Membri utente - Metodi di estensione
ja: ユーザー メンバー - 拡張メソッド
ko: 사용자 멤버 - 확장 메서드
pl: Składowe użytkowników — metody rozszerzenia
pt_br: Membros de Usuário – Métodos de Extensão
ru: Участники-пользователи — методы расширения
tr: Kullanıcı Üyeler - Uzantı Metotları
zh_hans: 用户成员-扩展方法
zh_hant: 使用者成員 - 擴充方法

source: User Members - Fields
cs: Uživatelské členy – pole
de: Benutzermember – Felder
es: Usuarios miembros: campos
fr: Membres utilisateurs - champs
it: Membri utente - Campi
ja: ユーザー メンバー - フィールド
ko: 사용자 멤버 - 필드
pl: Składowe użytkowników — pola
pt_br: Membros de Usuário – Campos
ru: Участники-пользователи — поля
tr: Kullanıcı Üyeler - Alanlar
zh_hans: 用户成员-字段
zh_hant: 使用者成員 - 欄位

source: User Members - Labels
cs: Uživatelské členy – návěstí
de: Benutzermember – Bezeichner
es: Usuarios miembros: etiquetas
fr: Membres utilisateurs - étiquettes
it: Membri utente - Etichette
ja: ユーザー メンバー - ラベル
ko: 사용자 멤버 - 레이블
pl: Składowe użytkowników — etykiety
pt_br: Membros de Usuário – Rótulos
ru: Участники-пользователи — метки
tr: Kullanıcı Üyeler - Etiketler
zh_hans: 用户成员-标签
zh_hant: 使用者成員 - 標籤

source: User Members - Locals
cs: Uživatelské členy – místní
de: Benutzermember – lokale Variablen
es: Usuarios miembros: locales
fr: Membres utilisateurs - éléments locaux
it: Membri utente - Variabili locali
ja: ユーザー メンバー - ローカル
ko: 사용자 멤버 - 로컬
pl: Składowe użytkowników — zmienne lokalne
pt_br: Membros de Usuário – Locais
ru: Участники-пользователи — локальные
tr: Kullanıcı Üyeler - Yereller
zh_hans: 用户成员-本地
zh_hant: 使用者成員 - 區域函式

source: User Members - Methods
cs: Uživatelské členy – metody
de: Benutzermember – Methoden
es: Usuarios miembros: métodos
fr: Membres utilisateurs - méthodes
it: Membri utente - Metodi
ja: ユーザー メンバー - メソッド
ko: 사용자 멤버 - 메서드
pl: Składowe użytkowników — metody
pt_br: Membros de Usuário – Métodos
ru: Участники-пользователи — методы
tr: Kullanıcı Üyeler - Metotlar
zh_hans: 用户成员-方法
zh_hant: 使用者成員 - 方法

source: User Members - Namespaces
cs: Uživatelské členy – obory názvů
de: Benutzermember – Namespaces
es: Usuarios miembros: espacios de nombres
fr: Membres utilisateurs - espaces de noms
it: Membri utente - Spazi dei nomi
ja: ユーザー メンバー - 名前空間
ko: 사용자 멤버 - 네임스페이스
pl: Składowe użytkowników — przestrzenie nazw
pt_br: Membros de Usuário – Namespaces
ru: Участники-пользователи — пространства имен
tr: Kullanıcı Üyeleri - Ad Alanları
zh_hans: 用户成员-命名空间
zh_hant: 使用者成員 - 命名空間

source: User Members - Parameters
cs: Uživatelské členy – parametry
de: Benutzermember – Parameter
es: Usuarios miembros: parámetros
fr: Membres utilisateurs - paramètres
it: Membri utente - Parametri
ja: ユーザー メンバー - パラメーター
ko: 사용자 멤버 - 매개 변수
pl: Składowe użytkowników — parametry
pt_br: Membros de Usuário – Parâmetros
ru: Участники-пользователи — параметры
tr: Kullanıcı Üyeler - Parametreler
zh_hans: 用户成员-参数
zh_hant: 使用者成員 - 參數

source: User Members - Properties
cs: Uživatelské členy – vlastnosti
de: Benutzermember – Eigenschaften
es: Usuarios miembros: propiedades
fr: Membres utilisateurs - propriétés
it: Membri utente - Proprietà
ja: ユーザー メンバー - プロパティ
ko: 사용자 멤버 - 속성
pl: Składowe użytkowników — właściwości
pt_br: Membros de Usuário – Propriedades
ru: Участники-пользователи — свойства
tr: Kullanıcı Üyeler - Özellikler
zh_hans: 用户成员-属性
zh_hant: 使用者成員 - 屬性

source: User Types - Classes
cs: Uživatelské typy – třídy
de: Benutzertypen - Klassen
es: Tipos de usuario: clases
fr: Types d'utilisateurs - Classes
it: Tipi utente - Classi
ja: ユーザー タイプ - クラス
ko: 사용자 형식 - 클래스
pl: Typy użytkownika — klasy
pt_br: Tipos de Usuário - Classes
ru: Пользовательские типы — классы
tr: Kullanıcı Türleri - Sınıflar
zh_hans: 用户类型 - 类
zh_hant: 使用者類型 - 類別

source: User Types - Delegates
cs: Uživatelské typy – delegáti
de: Benutzertypen - Delegaten
es: Tipos de usuario: delegados
fr: Types d'utilisateurs - Délégués
it: Tipi utente - Delegati
ja: ユーザー タイプ - デリゲート
ko: 사용자 형식 - 대리자
pl: Typy użytkownika — delegaty
pt_br: Tipos de Usuário - Representantes
ru: Пользовательские типы — делегаты
tr: Kullanıcı Türleri - Temsilciler
zh_hans: 用户类型 - 委托
zh_hant: 使用者類型 - 委派

source: User Types - Enums
cs: Uživatelské typy – výčty
de: Benutzertypen - Aufzählungen
es: Tipos de usuario: enumeraciones
fr: Types d'utilisateurs - Enums
it: Tipi utente - Enumerazioni
ja: ユーザー タイプ - 列挙型
ko: 사용자 형식 - 열거형
pl: Typy użytkownika — wyliczeniowe
pt_br: Tipos de Usuário - Enums
ru: Пользовательские типы — перечисления
tr: Kullanıcı Türleri - Sabit Listeleri
zh_hans: 用户类型 - 枚举
zh_hant: 使用者類型 - 列舉

source: User Types - Interfaces
cs: Uživatelské typy – rozhraní
de: Benutzertypen - Schnittstellen
es: Tipos de usuario: interfaces
fr: Types d'utilisateurs - Interfaces
it: Tipi utente - Interfacce
ja: ユーザー タイプ - インターフェイス
ko: 사용자 형식 - 인터페이스
pl: Typy użytkownika — interfejsy
pt_br: Tipos de Usuário - Interfaces
ru: Пользовательские типы — интерфейсы
tr: Kullanıcı Türleri - Arabirimler
zh_hans: 用户类型 - 接口
zh_hant: 使用者類型 - 介面

source: User Types - Record Structs
cs: Typy uživatelů – Struktury záznamů
de: Benutzertypen: Datensatzstrukturen
es: Tipos de usuario: Registrar estructuras
fr: Types d’utilisateurs - Structs d’enregistrement
ko: 사용자 유형 - 레코드 구조체
pl: Typy użytkowników — struktury rekordów
pt_br: Tipos de usuário - Registro de structs
ru: Пользовательские типы — структуры записей
tr: Kullanıcı Türleri - Kayıt Yapıları
zh_hans: 用户类型 - 记录结构
zh_hant: 使用者類型 - 記錄結構

source: User Types - Records
cs: Typy uživatelů – Záznamy
de: Benutzertypen – Datensätze
es: Tipos de usuario: registros
fr: Types d'utilisateur - Enregistrements
ja: ユーザー タイプ - レコード
ko: 사용자 유형 - 레코드
pl: Typy użytkownika — rekordy
pt_br: Tipos de Usuário – Registros
ru: Пользовательские типы — записи
tr: Kullanıcı Türleri - Kayıtlar
zh_hans: 用户类型 - 记录
zh_hant: 使用者類型 - 記錄

source: User Types - Structures
cs: Uživatelské typy – struktury
de: Benutzertypen - Strukturen
es: Tipos de usuario: estructuras
fr: Types d'utilisateurs - Structures
it: Tipi utente - Strutture
ja: ユーザー タイプ - 構造体
ko: 사용자 형식 - 구조
pl: Typy użytkownika — struktury
pt_br: Tipos de Usuário - Estruturas
ru: Пользовательские типы — структуры
tr: Kullanıcı Türleri - Yapılar
zh_hans: 用户类型 - 结构
zh_hant: 使用者類型 - 結構

source: User Types - Type Parameters
cs: Uživatelské typy – parametry typu
de: Benutzertypen - Typparameter
es: Tipos de usuario: parámetros de tipo
fr: Types d'utilisateurs - Paramètres de type
it: Tipi utente - Parametri di tipo
ja: ユーザー タイプ - 型パラメーター
ko: 사용자 형식 - 형식 매개 변수
pl: Typy użytkownika — parametry typu
pt_br: Tipos de Usuário - Parâmetros de Tipo
ru: Пользовательские типы — параметры типа
tr: Kullanıcı Türleri - Tür Parametreleri
zh_hans: 用户类型 - 类型参数
zh_hant: 使用者類型 - 類型參數

source: String - Verbatim
cs: Řetězec – Verbatim
de: Zeichenfolge - ausführlich
es: Cadena: textual
fr: Chaîne textuelle
it: Stringa - Verbatim
ja: 文字列 - Verbatim
ko: 문자열 - 축자
pl: Ciąg — dosłowne wyrażenie
pt_br: Cadeia de caracteres - Textual
ru: Строка — Verbatim
tr: Dize - Verbatim
zh_hans: 字符串 - 逐字字符串
zh_hant: 字串 - 逐字

source: Waiting for background work to finish...
cs: Čeká se na dokončení aktivity na pozadí...
de: Es wird auf den Abschluss von Hintergrundaufgaben gewartet...
es: Esperando a que finalice el trabajo en segundo plano...
fr: En attente de la fin du travail en arrière-plan...
ja: バックグラウンド作業が終了するのを待っています...
ko: 백그라운드 작업이 완료될 때까지 대기 중...
pl: Oczekiwanie na zakończenie pracy w tle...
pt_br: Aguardando a conclusão do trabalho em segundo plano...
ru: Ожидание завершения фоновой работы…
tr: Arka plan çalışmasının bitmesi bekleniyor...
zh_hans: 正在等待后台工作完成...
zh_hant: 正在等候背景工作完成...

# Warning_image_element
source: Warning
cs: Upozornění
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
ja: 警告
ko: 경고
pl: Ostrzeżenie
pt_br: Aviso
ru: Предупреждение
tr: Uyarı
zh_hans: 警告
zh_hant: 警告

source: XML Doc Comments - Attribute Name
cs: Komentáře XML – název atributu
de: XML-Dok-Kommentare- Attributname
es: Comentarios de documentación XML: nombre de atributo
fr: Commentaires documentation XML - Nom d'attribut
it: Commenti in formato documentazione XML - Nome attributo
ja: XML ドキュメント コメント - 属性名
ko: XML 문서 주석 - 특성 이름
pl: Komentarze dokumentacji XML — nazwa atrybutu
pt_br: Comentário da documentação XML - Nome de Atributo
ru: Комментарии XML Doc — имена атрибутов
tr: XML Belge Açıklamaları - Öznitelik Adı
zh_hans: XML 文档注释 - 属性名
zh_hant: XML 文件註解 - 屬性名稱

source: XML Doc Comments - CData Section
cs: Komentáře XML – sekce CData
de: XML-Dok-Kommentare - CData-Abschnitt
es: Comentarios de documentación XML: sección CData
fr: Commentaires documentation XML - Section CData
it: Commenti in formato documentazione XML - Sezione CData
ja: XML ドキュメント コメント - CData セクション
ko: XML 문서 주석 - CData 섹션
pl: Komentarze dokumentacji XML — sekcja CData
pt_br: Comentário da documentação XML - Seção CData
ru: Комментарии XML Doc — раздел CData
tr: XML Belge Açıklamaları - CData Bölümü
zh_hans: XML 文档注释 - CData 节
zh_hant: XML 文件註解 - CData 區段

source: XML Doc Comments - Text
cs: Komentáře XML – text
de: XML-Dok-Kommentare - Text
es: Comentarios de documentación XML: texto
fr: Commentaires documentation XML - Texte
it: Commenti in formato documentazione XML - Testo
ja: XML ドキュメント コメント - テキスト
ko: XML 문서 주석 - 텍스트
pl: Komentarze dokumentacji XML — tekst
pt_br: Comentário da documentação XML - Texto
ru: Комментарии XML-документа — текст
tr: XML Belge Açıklamaları - Metin
zh_hans: XML 文档注释 - 文本
zh_hant: XML 文件註解 - 文字

source: XML Doc Comments - Delimiter
cs: Komentáře XML – oddělovač
de: XML-Dok-Kommentare - Trennzeichen
es: Comentarios de documentación XML: delimitador
fr: Commentaires documentation XML - Délimiteur
it: Commenti in formato documentazione XML - Delimitatore
ja: XML ドキュメント コメント - 区切り記号
ko: XML 문서 주석 - 구분 기호
pl: Komentarze dokumentacji XML — ogranicznik
pt_br: Comentário da documentação XML - Delimitador
ru: Комментарии XML-документа — разделитель
tr: XML Belge Açıklamaları - Sınırlayıcı
zh_hans: XML 文档注释 - 分隔符
zh_hant: XML 文件註解 - 分隔符號

source: XML Doc Comments - Comment
cs: Komentáře XML – komentář
de: XML-Dok-Kommentare - Kommentar
es: Comentarios de documentación XML: comentario
fr: Commentaires documentation XML - Commentaire
it: Commenti in formato documentazione XML - Commento
ja: XML ドキュメント コメント - コメント
ko: XML 문서 주석 - 주석
pl: Komentarze dokumentacji XML — komentarz
pt_br: Comentário da documentação XML - Comentário
ru: Комментарии XML-документа — комментарий
tr: XML Belge Açıklamaları - Açıklama
zh_hans: XML 文档注释 - 注释
zh_hant: XML 文件註解 - 註解

source: User Types - Modules
cs: Uživatelské typy – moduly
de: Benutzertypen - Module
es: Tipos de usuario: módulos
fr: Types d'utilisateurs - Modules
it: Tipi utente - Moduli
ja: ユーザー タイプ - モジュール
ko: 사용자 형식 - 모듈
pl: Typy użytkownika — moduły
pt_br: Tipos de Usuário - Módulos
ru: Пользовательские типы — модули
tr: Kullanıcı Türleri - Modüller
zh_hans: 用户类型 - 模块
zh_hant: 使用者類型 - 模組

source: VB XML Literals - Attribute Name
cs: Literály VB XML – název atributu
de: VB XML-Literale - Attributname
es: Literal VB XML: nombre de atributo
fr: Littéraux XML VB - Nom d'attribut
it: Valori letterali XML VB - Nome attributo
ja: VB XML リテラル - 属性名
ko: VB XML 리터럴 - 특성 이름
pl: Literały XML języka VB — nazwa atrybutu
pt_br: Literais XML do VB - Nome de Atributo
ru: Литералы VB XML — имена атрибутов
tr: VB XML Sabit Değerleri - Öznitelik Adı
zh_hans: VB XML 文本 - 属性名
zh_hant: VB XML 常值 - 屬性名稱

source: VB XML Literals - Attribute Quotes
cs: Literály VB XML – uvozovky atributu
de: VB XML-Literale - Attributanführungszeichen
es: Literal VB XML: comillas de atributo
fr: Littéraux XML VB - Guillemets d'attribut
it: Valori letterali XML VB - Virgolette attributo
ja: VB XML リテラル - 属性の引用符
ko: VB XML 리터럴 - 특성 인용 문자
pl: Literały XML języka VB — cudzysłowy atrybutu
pt_br: Literais XML do VB - Aspas de Atributo
ru: Литералы VB XML — кавычки атрибутов
tr: VB XML Sabit Değerleri - Öznitelik Tırnak İşaretleri
zh_hans: VB XML 文本 - 属性引号
zh_hant: VB XML 常值 - 屬性引號

source: VB XML Literals - Attribute Value
cs: Literály VB XML – hodnota atributu
de: VB XML-Literale - Attributwert
es: Literal VB XML: valor de atributo
fr: Littéraux XML VB - Valeur d'attribut
it: Valori letterali XML VB - Valore attributo
ja: VB XML リテラル - 属性値
ko: VB XML 리터럴 - 특성 값
pl: Literały XML języka VB — wartość atrybutu
pt_br: Literais XML do VB - Valor de Atributo
ru: Литералы VB XML — значения атрибутов
tr: VB XML Sabit Değerleri - Öznitelik Değeri
zh_hans: VB XML 文本 - 属性值
zh_hant: VB XML 常值 - 屬性值

source: VB XML Literals - CData Section
cs: Literály VB XML – sekce CData
de: VB XML-Literale - CData-Abschnitt
es: Literal VB XML: sección CData
fr: Littéraux XML VB - Section CData
it: Valori letterali XML VB - Sezione CData
ja: VB XML リテラル - CData セクション
ko: VB XML 리터럴 - CData 섹션
pl: Literały XML języka VB — sekcja CData
pt_br: Literais XML do VB - Seção CData
ru: Литералы VB XML — раздел CData
tr: VB XML Sabit Değerleri - CData Bölümü
zh_hans: VB XML 文本 - CData 节
zh_hant: VB XML 常值 - CData 區段

source: VB XML Literals - Comment
cs: Literály VB XML – komentář
de: VB XML-Literale - Kommentar
es: Literal VB XML: comentario
fr: Littéraux XML VB - Commentaire
it: Valori letterali XML VB - Commento
ja: VB XML リテラル - コメント
ko: VB XML 리터럴 - 주석
pl: Literały XML języka VB — komentarz
pt_br: Literais XML do VB - Comentário
ru: Литералы XML VB — комментарий
tr: VB XML Sabit Değerleri - Açıklama
zh_hans: VB XML 文本 - 注释
zh_hant: VB XML 常值 - 註解

source: VB XML Literals - Delimiter
cs: Literály VB XML – oddělovač
de: VB XML-Literale - Trennzeichen
es: Literal VB XML: delimitador
fr: Littéraux XML VB - Délimiteur
it: Valori letterali XML VB - Delimitatore
ja: VB XML リテラル - 区切り記号
ko: VB XML 리터럴 - 구분 기호
pl: Literały XML języka VB — ogranicznik
pt_br: Literais XML do VB - Delimitador
ru: Литералы XML VB — разделитель
tr: VB XML Sabit Değerleri - Sınırlayıcı
zh_hans: VB XML 文本 - 分隔符
zh_hant: VB XML 常值 - 分隔符號

source: VB XML Literals - Embedded Expression
cs: Literály VB XML – vložený výraz
de: VB XML-Literale - Eingebetteter Ausdruck
es: Literal VB XML: expresión insertada
fr: Littéraux XML VB - Expression incorporée
it: Valori letterali XML VB - Espressione incorporata
ja: VB XML リテラル - 埋め込み式
ko: VB XML 리터럴 - 포함 식
pl: Literały XML języka VB — osadzone wyrażenie
pt_br: Literais XML do VB - Expressão Inserida
ru: Литералы VB XML — встроенные выражения
tr: VB XML Sabit Değerleri - Gömülü İfade
zh_hans: VB XML 文本 - 嵌入式表达式
zh_hant: VB XML 常值 - 內嵌運算式

source: VB XML Literals - Entity Reference
cs: Literály VB XML – odkaz na entitu
de: VB XML-Literale - Entitätsverweis
es: Literal VB XML: referencia de entidad
fr: Littéraux XML VB - Référence de l'entité
it: Valori letterali XML VB - Riferimento a entità
ja: VB XML リテラル - エンティティ参照
ko: VB XML 리터럴 - 엔터티 참조
pl: Literały XML języka VB — odwołanie do jednostki
pt_br: Literais XML do VB - Referência de Entidade
ru: Литералы VB XML — ссылки на сущности
tr: VB XML Sabit Değerleri - Varlık Başvurusu
zh_hans: VB XML 文本 - 实体引用
zh_hant: VB XML 常值 - 實體參考

source: VB XML Literals - Name
cs: Literály VB XML – název
de: VB XML-Literale - Name
es: Literal VB XML: nombre
fr: Littéraux XML VB - Nom
it: Valori letterali XML VB - Nome
ja: VB XML リテラル - 名前
ko: VB XML 리터럴 - 이름
pl: Literały XML języka VB — nazwa
pt_br: Literais XML do VB - Nome
ru: Литералы XML VB — имя
tr: VB XML Sabit Değerleri - Ad
zh_hans: VB XML 文本 - 名称
zh_hant: VB XML 常值 - 名稱

source: VB XML Literals - Processing Instruction
cs: Literály VB XML – pokyn ke zpracování
de: VB XML-Literale - Verarbeitungsanweisung
es: Literal VB XML: instrucción de procesamiento
fr: Littéraux XML VB - Instruction de traitement
it: Valori letterali XML VB - Istruzione di elaborazione
ja: VB XML リテラル - 処理命令
ko: VB XML 리터럴 - 처리 명령
pl: Literały XML języka VB — instrukcja przetwarzania
pt_br: Literais XML do VB - Instrução de Processamento
ru: Литералы VB XML — инструкции по обработке
tr: VB XML Sabit Değerleri - İşleme Yönergesi
zh_hans: VB XML 文本 - 处理指令
zh_hant: VB XML 常值 - 處理指示
