Repository: dotnet/roslyn
Catalog: src/PerformanceSensitiveAnalyzers/CSharp/xlf/AnalyzersResources.*.xlf
Languages: es, fr, it, ko, pl, ru, tr

# ClosureCaptureRuleMessage
source: The compiler will emit a class that will hold this as a field to allow capturing of this closure
es: El compilador emitirá una clase que lo contiene como campo para permitir la captura de esta clausura.
fr: Le compilateur va émettre une classe qui conservera ceci en tant que champ pour permettre la capture de cette fermeture
it: Il compilatore creerà una classe che conterrà questo valore come campo per consentire l'acquisizione di questa chiusura
ko: 컴파일러는 이 Closure의 캡처를 허용하도록 이 항목을 필드로 포함할 클래스를 내보냅니다.
pl: Kompilator będzie emitował klasę, która będzie przechowywała ten element jako pole, aby zezwolić na przechwytywanie tego zamknięcia
ru: Компилятор будет выводить класс, содержащий этот объект в качестве поля, чтобы разрешить захват такого замыкания
tr: Derleyici, bu kapanışın yakalanmasını sağlamak için bunu bir alan olarak tutacak bir sınıf üretir

# ClosureCaptureRuleTitle
source: Display class allocation to capture closure
es: Mostrar la asignación de clase para capturar la clausura
fr: Afficher l'allocation de classe pour capturer la fermeture
it: Visualizza allocazione della classe per l'acquisizione della chiusura
ko: Closure를 캡처하기 위한 클래스 할당 표시
pl: Wyświetl alokację klasy do przechwytywania zamknięcia
ru: Отображение выделения класса для захвата замыкания
tr: Kapanış yakalamak için sınıf ayırmayı görüntüle

# ClosureDriverRuleMessage
source: Heap allocation of closure Captures: {0}
es: Asignación del montón de las capturas de clausura: {0}
fr: Allocation de tas des captures de fermeture : {0}
it: Allocazione heap di acquisizioni chiusura: {0}
ko: Closure 캡처의 힙 할당: {0}
pl: Alokacja sterty przechwyceń zamknięcia: {0}
ru: Выделение кучи для захватов замыкания: {0}
tr: Kapanış Yakalamalarının yığın ayırması: {0}

# ClosureDriverRuleTitle
source: Closure Allocation Source
es: Origen de la asignación de clausura
fr: Source d'allocation de fermeture
it: Origine allocazione chiusura
ko: Closure 할당 소스
pl: Źródło alokacji zamknięcia
ru: Источник выделения замыкания
tr: Kapanış Ayırma Kaynağı

# DelegateOnStructInstanceRuleMessage
source: Struct instance method being used for delegate creation, this will result in a boxing instruction
es: Método de instancia de struct que se usa para la creación de delegado, lo que dará como resultado una instrucción de conversión boxing.
fr: Dans la mesure où la méthode d'instance de struct est utilisée pour la création de délégué, cela va donner lieu à une instruction boxing
it: Per la creazione di delegati viene usato il metodo di istanza struct. Verrà generata un'istruzione di conversione boxing
ko: 대리자 생성에 사용되는 구조체 인스턴스 메서드, 이로 인해 boxing 지침이 발생함
pl: Metoda wystąpienia struktury jest używana do utworzenia delegata, co spowoduje instrukcję konwersji boxing
ru: Метод экземпляра структуры используется для создания делегата, это приведет к инструкции упаковки-преобразования
tr: Yapı örneği metodu temsilci oluşturmak için kullanılıyor. Bu durum kutulama yönergesine neden olur

# DelegateOnStructInstanceRuleTitle
source: Delegate on struct instance caused a boxing allocation
es: El delegado en la instancia de struct causó una asignación de conversión boxing
fr: Le délégué sur l'instance de struct a entraîné une allocation boxing
it: Il delegato sull'istanza struct ha causato un'allocazione di conversione boxing
ko: 구조체 인스턴스의 대리자로 인해 Boxing 할당이 발생함
pl: Delegat w wystąpieniu struktury spowodował alokację z konwersją boxing
ru: Делегат в экземпляре структуры вызвал выделение упаковки-преобразования
tr: Yapı örneğindeki temsilci kutulama ayırmasına neden oldu

# LambaOrAnonymousMethodInGenericMethodRuleMessage
source: Considering moving this out of the generic method
es: Considere la posibilidad de extraerlo del método genérico
fr: Envisager de sortir ceci de la méthode générique
it: Verrà spostato all'esterno del metodo generico
ko: 제네릭 메서드 외부로 이동 고려
pl: Rozważanie przeniesienia tego poza metodę ogólną
ru: Учитывая его перемещение из универсального метода
tr: Bunun genel metodun dışına taşınması düşünülüyor

# LambaOrAnonymousMethodInGenericMethodRuleTitle
source: Lambda or anonymous method in a generic method allocates a delegate instance
es: Una expresión lambda o un método anónimo en un método genérico asigna una instancia de delegado
fr: Une expression lambda ou une méthode anonyme dans une méthode générique alloue une instance de délégué
it: Il metodo anonimo o l'espressione lambda in un metodo generico implica l'allocazione di un'istanza di delegato
ko: 제네릭 메서드의 람다 또는 무명 메서드는 대리자 인스턴스를 할당합니다.
pl: Wyrażenie lambda lub metoda anonimowa w metodzie ogólnej alokuje wystąpienie delegata
ru: Лямбда-выражение или анонимный метод в универсальном методе выделяет экземпляр делегата
tr: Genel bir metottaki lambda veya anonim metot bir temsilci örneği ayırır

# MethodGroupAllocationRuleMessage
source: This will allocate a delegate instance
es: Asignará una instancia de delegado
fr: Ceci va allouer une instance de délégué
it: Verrà allocata un'istanza di delegato
ko: 이렇게 하면 대리자 인스턴스가 할당됩니다.
pl: Spowoduje to alokowanie wystąpienia delegata
ru: Эта операция выделит экземпляр делегата
tr: Bu bir temsilci örneğini ayırır

# MethodGroupAllocationRuleTitle
source: Delegate allocation from a method group
es: Asignación de delegado desde un grupo de métodos
fr: Allocation de délégué à partir d'un groupe de méthodes
it: Allocazione del delegato da un gruppo di metodi
ko: 메서드 그룹의 대리자 할당
pl: Alokacja delegata z grupy metod
ru: Выделение делегата из группы методов
tr: Bir metot grubundan temsilci ayırma

# ParamsParameterRuleMessage
source: This call site is calling into a function with a 'params' parameter. This results in an array allocation even if no parameter is passed in for the params parameter
es: Este sitio de llamada invoca a una función con un parámetro "params". Esto da como resultado una asignación de matriz, aunque no se haya pasado ningún parámetro para "params".
fr: Ce site d'appel appelle une fonction avec un paramètre 'params'. Cela se traduit par une allocation de tableau même si aucun paramètre n'est passé pour le paramètre params
it: Questo sito di chiamata chiama una funzione con un parametro 'params'. Viene generata un'allocazione di matrice anche se non viene passato alcun parametro per params
ko: 이 호출 사이트가 'params' 매개 변수가 있는 함수를 호출하고 있습니다. 이로 인해 params 매개 변수에 대해 매개 변수가 전달되지 않는 경우에도 배열 할당이 발생합니다.
pl: Ta lokacja wywołania wywołuje funkcję z parametrem „params”. Powoduje to alokację tablicy nawet wtedy, gdy dla parametru params nie jest przekazywany żaden parametr
ru: Это место вызова направляет в функцию вызов с параметром "params". Это приводит к выделению массива, даже если для параметра params не передается никакое значение
tr: Bu çağrı sitesi 'params' parametresi ile bir işleve çağrı yapıyor. params parametresiyle geçirilen bir parametre olmasa bile bu durum bir dizi ayırmasına neden olur

# ParamsParameterRuleTitle
source: Array allocation for params parameter
es: Asignación de matriz para el parámetro params
fr: Allocation de tableau pour le paramètre params
it: Allocazione di matrice per parametro params
ko: params 매개 변수의 배열 할당
pl: Alokacja tablicy dla parametru params
ru: Выделение массива для параметра params
tr: params parametresi için dizi ayırma

# ReadonlyMethodGroupAllocationRuleMessage
source: This will allocate a delegate instance
es: Asignará una instancia de delegado
fr: Ceci va allouer une instance de délégué
it: Verrà allocata un'istanza di delegato
ko: 이렇게 하면 대리자 인스턴스가 할당됩니다.
pl: Spowoduje to alokowanie wystąpienia delegata
ru: Эта операция выделит экземпляр делегата
tr: Bu bir temsilci örneğini ayırır

# ReadonlyMethodGroupAllocationRuleTitle
source: Delegate allocation from a method group
es: Asignación de delegado desde un grupo de métodos
fr: Allocation de délégué à partir d'un groupe de méthodes
it: Allocazione del delegato da un gruppo di metodi
ko: 메서드 그룹의 대리자 할당
pl: Alokacja delegata z grupy metod
ru: Выделение делегата из группы методов
tr: Bir metot grubundan temsilci ayırma

# ReferenceTypeEnumeratorRuleMessage
source: Non-ValueType enumerator may result in a heap allocation
es: Un enumerador distinto de ValueType puede producir una asignación del montón
fr: Un énumérateur non ValueType peut entraîner une allocation de tas
it: L'enumeratore non ValueType può causare un'allocazione heap
ko: 비 ValueType 열거자를 사용하면 힙 할당이 발생할 수 있습니다.
pl: Moduł wyliczający inny niż ValueType może skutkować alokacją sterty
ru: Перечислитель, отличный от ValueType, может привести к выделению кучи
tr: ValueType olmayan numaralandırıcı bir yığın ayırmaya neden olabilir

# ReferenceTypeEnumeratorRuleTitle
source: Possible allocation of reference type enumerator
es: Posible asignación del enumerador de tipo de referencia
fr: Allocation possible d'un énumérateur de type référence
it: Possibile allocazione di enumeratore di tipo riferimento
ko: 참조 형식 열거자의 가능한 할당
pl: Możliwa alokacja modułu wyliczającego typ referencyjny
ru: Возможное выделение перечислителя ссылочного типа
tr: Başvuru türü numaralandırıcısının olası ayırması

# StringConcatenationAllocationRuleMessage
source: Considering using StringBuilder
es: Considere la posibilidad de usar StringBuilder
fr: Utilisation envisagée de StringBuilder
it: Verrà usato StringBuilder
ko: StringBuilder 사용 고려
pl: Rozważanie używania klasy StringBuilder
ru: Учитывая использование StringBuilder
tr: StringBuilder kullanılması düşünülüyor

# StringConcatenationAllocationRuleTitle
source: Implicit string concatenation allocation
es: Asignación implícita de concatenación de cadenas
fr: Allocation implicite de concaténation de chaînes
it: Allocazione implicita di concatenazioni di stringhe
ko: 암시적 문자열 연결 할당
pl: Niejawna alokacja łączenia ciągów
ru: Неявное выделение объединения строк
tr: Örtük dize birleştirmesini ayırma

# ValueTypeNonOverridenCallRuleMessage
source: Non-overridden virtual method call on a value type adds a boxing or constrained instruction
es: La llamada de método virtual no reemplazado en un tipo de valor agrega una instrucción de conversión boxing o restringida.
fr: Un appel de méthode virtuelle non substituée sur un type valeur ajoute une instruction boxing ou contrainte
it: La chiamata a un metodo virtuale non sottoposto a override su un tipo valore implica l'aggiunta di un'istruzione di conversione boxing o vincolata
ko: 값 형식에 대한 재정의되지 않은 가상 메서드 호출은 boxing 또는 제한된 지침을 추가합니다.
pl: Nieprzesłonięte wywołanie metody wirtualnej dla typu wartości dodaje konwersję boxing instrukcji z ograniczeniami
ru: Непереопределенный вызов виртуального метода для типа значения добавляет инструкцию упаковки-преобразования или ограниченную инструкцию
tr: Bir değer türü üzerindeki geçersiz kılınmayan sanal metot çağrısı bir kutulama veya kısıtlanmış yönerge ekler

# ValueTypeNonOverridenCallRuleTitle
source: Non-overridden virtual method call on value type
es: Llamada de método virtual no reemplazado en el tipo de valor
fr: Appel de méthode virtuelle non substituée sur le type valeur
it: Chiamata a un metodo virtuale non sottoposta a override sul tipo valore
ko: 값 형식에 대한 재정의되지 않은 가상 메서드 호출
pl: Nieprzesłonięte wywołanie metody wirtualnej dla typu wartości
ru: Непереопределенный вызов виртуального метода для типа значения
tr: Değer türü üzerindeki geçersiz kılınmayan sanal metot çağrısı

# ValueTypeToReferenceTypeConversionRuleMessage
source: Value type to reference type conversion causes boxing at call site (here), and unboxing at the callee-site. Consider using generics if applicable
es: La conversión del tipo de valor al tipo de referencia genera una conversión boxing en el sitio de llamada (aquí) y otra de tipo unboxing en el sitio del destinatario. Considere la posibilidad de usar valores genéricos, si procede.
fr: La conversion d'un type valeur en type référence entraîne un boxing sur le site d'appel (ici), et une conversion unboxing sur le site appelé. Utiliser des génériques, le cas échéant
it: La conversione da tipo valore a tipo riferimento causa la conversione boxing nel sito di chiamata (qui) e la conversione unboxing nel sito chiamato. Se applicabile, provare a usare generics
ko: 값 형식에서 참조 형식으로 변환하면 호출 사이트(여기)에서 boxing되고 호출 수신자 사이트에서 unboxing됩니다. 해당하는 경우 제네릭을 사용하는 것이 좋습니다.
pl: Konwersja typu wartości na typ referencyjny powoduje konwersję boxing w lokacji wywołania (tutaj) i w konwersję unboxing w lokacji wywoływanej. Rozważ użycie typów ogólnych, jeśli mają zastosowanie
ru: Преобразование типа значения в ссылочный тип приводит к упаковке-преобразованию в месте вызова (здесь) и распаковке в месте вызываемого объекта. Рекомендуется по возможности использовать универсальные шаблоны
tr: Değer türünden başvuru türüne dönüştürme, çağrı sitesinde (burada) kutulamaya ve çağrılan sitede ise kutudan çıkarmaya neden olur. Varsa genel türleri kullanmayı deneyin

# ValueTypeToReferenceTypeConversionRuleTitle
source: Value type to reference type conversion causing boxing allocation
es: La conversión del tipo de valor al tipo de referencia causa una asignación de conversión boxing
fr: La conversion d'un type valeur en type référence entraîne une allocation boxing
it: Conversione da tipo valore a tipo riferimento che causa l'allocazione della conversione boxing
ko: boxing 할당을 초래하는 값 형식에서 참조 형식으로 변환
pl: Konwersja typu wartości na typ referencyjny powoduje alokację z konwersją boxing
ru: Преобразование типа значения в ссылочный тип приводит к выделению упаковки-преобразования
tr: Değer türünden başvuru türüne dönüştürme, kutulama ayırmasına neden oluyor

# ValueTypeToReferenceTypeInAStringConcatenationRuleMessage
source: Value type ({0}) is being boxed to a reference type for a string concatenation.
es: Se está aplicando una conversión boxing del tipo de valor ({0}) a un tipo de referencia para una concatenación de cadenas.
fr: Le type valeur ({0}) est converti (boxed) en type référence pour une concaténation de chaîne.
it: Verrà eseguita la conversione boxing del tipo valore ({0}) in un tipo riferimento per una concatenazione di stringhe.
ko: 값 형식({0})이 문자열 연결을 위해 참조 형식으로 boxing됩니다.
pl: Typ wartości ({0}) jest poddawany konwersji boxing na typ referencyjny dla łączenia ciągów.
ru: Тип значения ({0}) подвергается упаковке-преобразованию в ссылочный тип для объединения строк.
tr: ({0}) değer türü dize birleştirmesi için bir başvuru türüne kutulanıyor.

# ValueTypeToReferenceTypeInAStringConcatenationRuleTitle
source: Value type to reference type conversion allocation for string concatenation
es: Asignación de conversión de tipo de valor a tipo de referencia para la concatenación de cadenas
fr: Allocation de conversion de type valeur en type référence pour la concaténation de chaînes
it: Allocazione della conversione da tipo valore a tipo riferimento per la concatenazione di stringhe
ko: 문자열 연결을 위한 값 형식에서 참조 형식으로 변환 할당
pl: Alokacja konwersji typu wartości na typ referencyjny dla łączenia ciągów
ru: Выделение преобразования типа значения в ссылочный тип для объединения строк
tr: Dize birleştirmesi için değer türünden başvuru türüne dönüştürme ayırması
