Repository: dotnet/roslyn
Catalog: src/Analyzers/Core/CodeFixes/xlf/CodeFixesResources.*.xlf
Languages: cs, es, ko, pl, pt_br, ru, tr

source: Add blank line after block
cs: Přidat za blok prázdný řádek
es: Agregar una línea en blanco después del bloque
ko: 블록 뒤에 빈 줄 추가
pl: Dodaj pusty wiersz po bloku
pt_br: Adicionar uma linha em branco após o bloco
ru: Добавить пустую строку после блока
tr: Bloktan sonra boş satır ekleme

source: Add both
cs: Přidat obojí
es: Agregar ambos
ko: 둘 다 추가
pl: Dodaj oba
pt_br: Adicionar ambos
ru: Добавить оба
tr: Her ikisini de ekle

source: Add default case
cs: Přidat výchozí malá a velká písmena
es: Agregar caso predeterminado
ko: Default Case 추가
pl: Dodaj przypadek domyślny
pt_br: Adicionar caso padrão
ru: Добавить вариант по умолчанию
tr: Varsayılan durum ekle

source: Add explicit cast
cs: Přidat explicitní přetypování
ko: 명시적 캐스트 추가
pl: Dodaj rzutowanie jawne
ru: Добавить явное приведение
tr: Açık tür dönüştürme ekle

source: Add file header
cs: Přidat hlavičku souboru
es: Agregar encabezado de archivo
ko: 파일 헤더 추가
pl: Dodaj nagłówek pliku
pt_br: Adicionar cabeçalho de arquivo
ru: Добавить заголовок файла
tr: Dosya üst bilgisi ekle

source: Add member name
cs: Přidat název členu
es: Agregar nombre de miembro
ko: 멤버 이름 추가
pl: Dodaj nazwę składowej
pt_br: Adicionar o nome do membro
ru: Добавить имя элемента
tr: Üye adı Ekle

source: Add missing param nodes
cs: Přidat chybějící uzly parametrů
es: Agregar nodos de parámetros que faltan
ko: 누락된 매개 변수 노드 추가
pl: Dodaj brakujące węzły parametrów
pt_br: Adicionar nós de parâmetro ausentes
ru: Добавить отсутствующие узлы параметров
tr: Eksik parametre düğümlerini ekle

source: Add parameter to '{0}'
cs: Přidat parametr do {0}
es: Agregar parámetro a "{0}"
ko: '{0}'에 매개 변수 추가
pl: Dodaj parametr do elementu „{0}”
pt_br: Adicionar parâmetro ao '{0}'
ru: Добавить параметр в "{0}"
tr: '{0}' öğesine parametre ekle

source: Add parameter to '{0}' (and overrides/implementations)
cs: Přidat parametr do {0} (a přepsání/implementace)
es: Agregar un parámetro a “{0}” (y reemplazos/implementaciones)
ko: '{0}'(및 재정의/구현)에 매개 변수 추가
pl: Dodaj parametr do elementu „{0}” (oraz przesłonięć/implementacji)
pt_br: Adicionar parâmetro ao '{0}' (e substituições/implementações)
ru: Добавить параметр в "{0}" (а также переопределения или реализации)
tr: '{0}' öğesine (ve geçersiz kılmalara/uygulamalara) parametre ekle

source: Add to '{0}'
cs: Přidat do {0}
es: Agregar a “{0}”
ko: '{0}'에 추가
pl: Dodaj do elementu „{0}”
pt_br: Adicionar para '{0}'
ru: Добавить в "{0}"
tr: '{0}' öğesine ekle

source: Alias ambiguous type '{0}'
cs: Alias nejednoznačného typu {0}
es: Tipo de alias ambiguo "{0}"
ko: 별칭 모호한 형식 '{0}'
pl: Niejednoznaczny typ aliasu „{0}”
pt_br: Tipo de alias ambíguo '{0}'
ru: Неоднозначный тип псевдонима "{0}"
tr: Diğer ad belirsiz '{0}' türünde

source: Convert type to '{0}'
cs: Převést typ na {0}
es: Convertir tipo en "{0}"
ko: 형식을 '{0}'(으)로 변환
pl: Konwertuj typ na „{0}”
pt_br: Converter o tipo em '{0}'
ru: Преобразовать тип в "{0}"
tr: Türü '{0}' olarak dönüştür

source: Do not change this code. Put cleanup code in '{0}' method
cs: Neměňte tento kód. Kód pro vyčištění vložte do metody {0}.
es: No cambie este código. Coloque el código de limpieza en el método "{0}".
ko: 이 코드를 변경하지 마세요. '{0}' 메서드에 정리 코드를 입력합니다.
pl: Nie zmieniaj tego kodu. Umieść kod czyszczący w metodzie „{0}”.
pt_br: Não altere este código. Coloque o código de limpeza no método '{0}'
ru: Не изменяйте этот код. Разместите код очистки в методе "{0}".
tr: Bu kodu değiştirmeyin. Temizleme kodunu '{0}' metodunun içine yerleştirin.

source: Fix all occurrences in
cs: Opravit všechny výskyty v
es: Corregir todas las repeticiones de
ko: 다음 위치에서 모든 발생 수정
pl: Popraw wszystkie wystąpienia w
pt_br: Corrigir todas as ocorrências em
ru: Исправить все случаи в
tr: Tüm oluşumları şurada düzelt:

# Fix_name_violation_colon_0
source: Fix name violation: {0}
cs: Opravit porušení názvu: {0}
es: Corregir infracción de nombre: {0}
ko: 이름 위반 수정: {0}
pl: Rozwiąż problem z naruszeniem nazwy: {0}
pt_br: Corrigir violação de nome: {0}
ru: Устраните нарушение имени: {0}
tr: Ad ihlalini düzelt: {0}

source: Generate abstract method '{0}'
cs: Generovat abstraktní metodu {0}
es: Generar método abstracto "{0}"
ko: '{0}' 요약 메서드 생성
pl: Generuj metodę abstrakcyjną „{0}”
pt_br: Gerar o método abstrato '{0}'
ru: Создать абстрактный метод "{0}"
tr: '{0}' soyut metodunu üret

source: Generate abstract property '{0}'
cs: Generovat abstraktní vlastnost {0}
es: Generar propiedad abstracta "{0}"
ko: '{0}' 요약 속성 생성
pl: Generuj właściwość abstrakcyjną „{0}”
pt_br: Gerar a propriedade abstrata '{0}'
ru: Создать абстрактное свойство "{0}"
tr: '{0}' soyut özelliğini üret

source: Generate all
cs: Generovat všechno
es: Generar todo
ko: 모두 생성
pl: Generuj wszystko
pt_br: Gerar todos
ru: Создать все
tr: Tümünü üret

source: Generate constant '{0}'
cs: Generovat konstantu {0}
es: Generar constante "{0}"
ko: '{0}' 상수 생성
pl: Generuj stałą „{0}”
pt_br: Gerar constante '{0}'
ru: Создать константу "{0}"
tr: '{0}' sabitini üret

source: Generate constructor '{0}({1})'
cs: Generovat konstruktor {0}({1})
es: Generar el constructor '{0}({1})'
ko: 생성자 '{0}({1})' 생성
pl: Generuj konstruktor „{0}({1})”
pt_br: Gerar construtor "{0}({1})"
ru: Создать конструктор "{0}({1})"
tr: {0}({1})' oluşturucusunu üret

source: Generate constructor in '{0}'
cs: Generovat konstruktor v: {0}
es: Generar constructor en '{0}'
ko: '{0}'에서 생성자 생성
pl: Generuj konstruktor w elemencie „{0}”
pt_br: Gerar construtor em '{0}'
ru: Создайте конструктор в "{0}"
tr: '{0}' içinde oluşturucu üretin

source: Generate constructor in '{0}' (with fields)
cs: Vygenerovat konstruktor v {0} (s poli)
es: Generar un constructor en "{0}" (con campos)
ko: '{0}'에 생성자 생성(필드 포함)
pl: Generuj konstruktor w elemencie „{0}” (z polami)
pt_br: Gerar o construtor em '{0}' (com campos)
ru: Создать конструктор в "{0}" (с полями)
tr: '{0}' içinde oluşturucu üret (alanlarla birlikte)

source: Generate constructor in '{0}' (with properties)
cs: Vygenerovat konstruktor v {0} (s vlastnostmi)
es: Generar un constructor en "{0}" (con propiedades)
ko: '{0}'에 생성자 생성(속성 포함)
pl: Generuj konstruktor w elemencie „{0}” (z właściwościami)
pt_br: Gerar o construtor em '{0}' (com propriedades)
ru: Создать конструктор в "{0}" (со свойствами)
tr: '{0}' içinde oluşturucu üret (özelliklerle birlikte)

source: Generate enum member '{0}'
cs: Generovat člena výčtu {0}
es: Generar miembro de enumeración "{0}"
ko: '{0}' 열거형 멤버 생성
pl: Generuj składową wyliczenia „{0}”
pt_br: Gerar o membro de enumeração '{0}'
ru: Создать элемент перечисления "{0}"
tr: '{0}' sabit listesi üyesini üret

source: Generate explicit conversion operator in '{0}'
cs: Generovat explicitní operátor převodu v {0}
es: Generar operador de conversión explícito en '{0}'
ko: '{0}'에서 명시적 변환 연산자 생성
pl: Generuj operator jawnej konwersji w elemencie „{0}”
pt_br: Gerar um operador de conversão explícita em '{0}'
ru: Создать явный оператор преобразования в "{0}"
tr: '{0}' içinde açık dönüşüm işleci oluştur

source: Generate field '{0}'
cs: Generovat pole {0}
es: Generar campo "{0}"
ko: '{0}' 필드 생성
pl: Generuj pole „{0}”
pt_br: Gerar campo '{0}'
ru: Создать поле "{0}"
tr: '{0}' alanını üret

source: Generate field assigning constructor '{0}({1})'
cs: Generovat konstruktor přiřazující pole {0}({1})
es: Generar campo asignando constructor '{0}({1})'
ko: 생성자 '{0}({1})'을(를) 할당하는 필드 생성
pl: Generuj konstruktor przypisujący pola „{0}({1})”
pt_br: Gerar construtor de atribuição de campo "{0}({1})"
ru: Создать назначающий поля конструктор "{0}({1})"
tr: {0}({1})' alan atama oluşturucusunu üret

source: Generate implicit conversion operator in '{0}'
cs: Generovat implicitní operátor převodu v {0}
es: Generar operador de conversión implícito en '{0}'
ko: '{0}'에서 암시적 변환 연산자 생성
pl: Generuj operator niejawnej konwersji w elemencie „{0}”
pt_br: Gerar um operador de conversão implícita em '{0}'
ru: Создать неявный оператор преобразования в "{0}"
tr: '{0}' içinde örtük dönüşüm işleci oluştur

source: Generate local '{0}'
cs: Generovat místní: {0}
es: Generar la variable local '{0}'
ko: '{0}' 로컬을 생성합니다.
pl: Generuj lokalny element „{0}”
pt_br: Gerar local '{0}'
ru: Создайте локальную переменную "{0}"
tr: Yerel '{0}' üretin

source: Generate method '{0}'
cs: Generovat metodu {0}
es: Generar método "{0}"
ko: ‘{0}’ 메서드 생성
pl: Generuj metodę „{0}”
pt_br: Gerar método '{0}'
ru: Создать метод "{0}"
tr: '{0}' metodunu üret

source: Generate narrowing conversion in '{0}'
cs: Generovat zužující převod v {0}
es: Generar conversión de restricción en "{0}"
ko: '{0}'에서 축소 변환 생성
pl: Generuj konwersję zawężającą w elemencie „{0}”
pt_br: Gerar conversão de restrição no '{0}'
ru: Создайте сужающее преобразование в "{0}"
tr: '{0}' öğesinde daraltma dönüştürmesi oluştur

source: Generate parameter '{0}'
cs: Generovat parametr {0}
es: Generar el parámetro "{0}"
ko: '{0}' 매개 변수 생성
pl: Generuj parametr „{0}”
pt_br: Gerar o parâmetro '{0}'
ru: Создать параметр "{0}"
tr: '{0}' parametresini üret

source: Generate parameter '{0}' (and overrides/implementations)
cs: Generovat parametr {0} (a přepsání/implementace)
es: Generar el parámetro "{0}" (y reemplazos/implementaciones)
ko: '{0}' 매개 변수(및 재정의/구현) 생성
pl: Generowanie parametru „{0}” (i przesłonięć/implementacji)
pt_br: Gerar o parâmetro '{0}' (e as substituições/implementações)
ru: Создать параметр "{0}" (а также переопределения или реализации)
tr: '{0}' parametresini (ve geçersiz kılmaları/uygulamaları) üret

source: Generate property '{0}'
cs: Generovat vlastnost {0}
es: Generar propiedad "{0}"
ko: '{0}' 속성 생성
pl: Generuj właściwość „{0}”
pt_br: Gerar propriedade '{0}'
ru: Создать свойство "{0}"
tr: '{0}' özelliğini üret

source: Generate read-only field '{0}'
cs: Generovat pole {0} jen pro čtení
es: Generar un campo de sólo lectura "{0}"
ko: '{0}' 읽기 전용 필드 생성
pl: Generuj pole tylko do odczytu „{0}”
pt_br: Gerar o campo somente leitura '{0}'
ru: Создать поле только для чтения "{0}"
tr: '{0}' salt okunur alanını üret

source: Generate read-only property '{0}'
cs: Generovat vlastnost {0} jen pro čtení
es: Generar propiedad de solo lectura "{0}"
ko: '{0}' 읽기 전용 속성 생성
pl: Generuj właściwość tylko do odczytu „{0}”
pt_br: Gerar a propriedade somente leitura '{0}'
ru: Создать свойство только для чтения "{0}"
tr: '{0}' salt okunur özelliğini üret

source: Generate variable '{0}'
cs: Generovat proměnnou {0}
es: Generar variable '{0}'
ko: '{0}' 변수 생성
pl: Generuj zmienną „{0}”
pt_br: Gerar variável '{0}'
ru: Создать переменную "{0}"
tr: '{0}' değişkenini oluştur

source: Generate widening conversion in '{0}'
cs: Generovat rozšiřující konverzi v {0}
es: Generar conversión de ampliación en "{0}"
ko: '{0}'에서 확대 변환 생성
pl: Generuj konwersję rozszerzającą w elemencie „{0}”
pt_br: Gerar conversão de expansão no '{0}'
ru: Создайте расширяющееся преобразование в "{0}"
tr: '{0}' öğesinde genişletme dönüşümü oluştur

source: Implement all members explicitly
cs: Implementovat všechny členy explicitně
es: Implementar todos los miembros de forma explícita
ko: 모든 멤버를 명시적으로 구현
pl: Jawnie zaimplementuj wszystkie składowe
pt_br: Implementar todos os membros explicitamente
ru: Реализовать все элементы явно
tr: Tüm üyeleri açıkça uygula

source: Implement interface
cs: Implementujte rozhraní.
es: Implementar interfaz
ko: 인터페이스 구현
pl: Zaimplementuj interfejs
pt_br: Implementar a interface
ru: Реализовать интерфейс
tr: Arabirimi uygula

source: Implement interface abstractly
cs: Implementovat rozhraní abstraktně
es: Implementar interfaz de forma abstracta
ko: 추상적으로 인터페이스 구현
pl: Implementuj interfejs abstrakcyjnie
pt_br: Implementar interface de forma abstrata
ru: Реализовать интерфейс абстрактно
tr: Arabirimi soyut olarak uygula

source: Implement interface explicitly with Dispose pattern
cs: Implementovat rozhraní explicitně se vzorem Dispose
es: Implementar la interfaz de forma explícita con el patrón de Dispose
ko: 인터페이스를 Dispose 패턴으로 명시적으로 구현
pl: Jawnie implementuj interfejs za pomocą wzorca likwidacji
pt_br: Implementar interface explicitamente com Padrão de descarte
ru: Явно внедрите интерфейс с шаблоном освобождения
tr: Ara birimi açık olarak Dispose düzeniyle uygula

source: Implement interface through '{0}'
cs: Implementovat rozhraní přes {0}
es: Implementar interfaz a través de '{0}'
ko: '{0}'을(를) 통해 인터페이스 구현
pl: Implementuj interfejs za pomocą elementu „{0}”
pt_br: Implementar interface por meio de "{0}"
ru: Реализовать интерфейс через "{0}"
tr: Arabirimi '{0}' aracılığıyla uygula

source: Implement interface with Dispose pattern
cs: Implementovat rozhraní se vzorem Dispose
es: Implementar la interfaz con el patrón de Dispose
ko: 인터페이스를 Dispose 패턴으로 구현
pl: Implementuj interfejs za pomocą wzorca likwidacji
pt_br: Implementar interface com Padrão de descarte
ru: Внедрите интерфейс с шаблоном освобождения
tr: Ara birimi Dispose düzeniyle uygula

source: Implement remaining members explicitly
cs: Implementovat zbývající členy explicitně
es: Implementar los miembros restantes de forma explícita
ko: 나머지 멤버를 명시적으로 구현
pl: Jawnie zaimplementuj pozostałe składowe
pt_br: Implementar os membros restantes explicitamente
ru: Реализовать оставшиеся элементы явно
tr: Kalan üyeleri açıkça uygula

source: Make class 'abstract'
cs: Nastavit třídu jako abstract
es: Convertir la clase en "abstract"
ko: 'abstract' 클래스 만들기
pl: Ustaw specyfikator „abstract” dla klasy
pt_br: Tornar a classe 'abstract'
ru: Сделать класс абстрактным
tr: Sınıfı 'abstract' yap

# Make_member_static
source: Make static
cs: Nastavit jako statickou
es: Hacer estático
ko: 정적으로 만들기
pl: Ustaw jako statyczne
pt_br: Tornar estático
ru: Сделать статическим
tr: Statik yap

source: Make method synchronous
cs: Nastavit metodu jako synchronní
ko: 메서드를 동기 메서드로 설정
pl: Ustaw metodę jako synchroniczną
ru: Преобразовать метод в синхронный
tr: Metodu zaman uyumlu hale getir

source: Make type partial
cs: Nastavit typ jako částečný
es: Convertir el tipo en parcial
ko: 형식을 부분 형식으로 만들기
pl: Ustaw typ jako częściowy
pt_br: Tornar o tipo parcial
ru: Сделать тип частичным
tr: Türü kısmi hale getir

source: Related method signatures found in metadata will not be updated.
cs: Podpisy souvisejících metod nalezené v metadatech se nebudou aktualizovat.
es: Las signaturas de método relacionadas encontradas en los metadatos no se actualizarán.
ko: 메타데이터에서 찾은 관련 메서드 시그니처가 업데이트되지 않습니다.
pl: Sygnatury powiązanych metod znalezione w metadanych nie zostaną zaktualizowane.
pt_br: As assinaturas de método relacionadas encontradas nos metadados não serão atualizadas.
ru: Связанные сигнатуры методов, найденные в метаданных, не будут обновлены.
tr: Meta verilerde bulunan ilgili metot imzaları güncelleştirilmez.

source: Remove 'async' modifier
cs: Odebrat modifikátor async
es: Quitar el modificador "async"
ko: 'async' 한정자 제거
pl: Usuń modyfikator „async”
pt_br: Remover o modificador 'async'
ru: Удалить модификатор "async"
tr: 'async' değiştiricisini kaldırın

source: Remove extra blank lines
cs: Odebrat nadbytečné prázdné řádky
es: Quitar líneas en blanco adicionales
ko: 여분의 빈 줄 제거
pl: Usuń dodatkowe puste wiersze
pt_br: Remover as linhas em branco extras
ru: Удалите лишние пустые строки
tr: Fazladan boş satırları kaldır

source: Remove redundant assignment
cs: Odebrat redundantní přiřazení
es: Quitar asignación redundante
ko: 중복 할당 제거
pl: Usuń nadmiarowe przypisanie
pt_br: Remover a atribuição redundante
ru: Удалить избыточное присваивание
tr: Gereksiz atamayı kaldır

source: Remove tag
cs: Odebrat značku
es: Quitar etiqueta
ko: 태그 제거
pl: Usuń tag
pt_br: Remover tag
ru: Удалить тег
tr: Etiketi Kaldır

source: Suppress or configure issues
cs: Potlačit nebo konfigurovat problémy
es: Suprimir o configurar incidencias
ko: 문제 표시 안 함 또는 구성
pl: Problemy z pomijaniem lub konfigurowaniem
pt_br: Suprimir ou configurar problemas
ru: Подавление проблем или настройка уровня их серьезности
tr: Sorunları gizle veya yapılandır

# TODO_colon_dispose_managed_state_managed_objects
source: TODO: dispose managed state (managed objects)
cs: TODO: Uvolněte spravovaný stav (spravované objekty).
es: TODO: eliminar el estado administrado (objetos administrados)
ko: TODO: 관리형 상태(관리형 개체)를 삭제합니다.
pl: TODO: Wyczyścić stan zarządzany (obiekty zarządzane)
pt_br: TODO: descartar o estado gerenciado (objetos gerenciados)
ru: TODO: освободить управляемое состояние (управляемые объекты)
tr: TODO: yönetilen durumu (yönetilen nesneleri) atın

# TODO_colon_free_unmanaged_resources_unmanaged_objects_and_override_finalizer
source: TODO: free unmanaged resources (unmanaged objects) and override finalizer
cs: TODO: Uvolněte nespravované prostředky (nespravované objekty) a přepište finalizační metodu.
es: TODO: liberar los recursos no administrados (objetos no administrados) y reemplazar el finalizador
ko: TODO: 비관리형 리소스(비관리형 개체)를 해제하고 종료자를 재정의합니다.
pl: TODO: Zwolnić niezarządzane zasoby (niezarządzane obiekty) i przesłonić finalizator
pt_br: TODO: liberar recursos não gerenciados (objetos não gerenciados) e substituir o finalizador
ru: TODO: освободить неуправляемые ресурсы (неуправляемые объекты) и переопределить метод завершения
tr: TODO: yönetilmeyen kaynakları (yönetilmeyen nesneleri) serbest bırakın ve sonlandırıcıyı geçersiz kılın

# TODO_colon_override_finalizer_only_if_0_has_code_to_free_unmanaged_resources
source: TODO: override finalizer only if '{0}' has code to free unmanaged resources
cs: TODO: Finalizační metodu přepište, jen pokud metoda {0} obsahuje kód pro uvolnění nespravovaných prostředků.
es: TODO: reemplazar el finalizador solo si "{0}" tiene código para liberar los recursos no administrados
ko: TODO: 비관리형 리소스를 해제하는 코드가 '{0}'에 포함된 경우에만 종료자를 재정의합니다.
pl: TODO: Przesłonić finalizator tylko w sytuacji, gdy powyższa metoda „{0}” zawiera kod służący do zwalniania niezarządzanych zasobów
pt_br: TODO: substituir o finalizador somente se '{0}' tiver o código para liberar recursos não gerenciados
ru: TODO: переопределить метод завершения, только если "{0}" содержит код для освобождения неуправляемых ресурсов
tr: TODO: sonlandırıcıyı yalnızca '{0}' içinde yönetilmeyen kaynakları serbest bırakacak kod varsa geçersiz kılın

# TODO_colon_set_large_fields_to_null
source: TODO: set large fields to null
cs: TODO: Nastavte velká pole na hodnotu null.
es: TODO: establecer los campos grandes como NULL
ko: TODO: 큰 필드를 null로 설정합니다.
pl: TODO: Ustawić wartość null dla dużych pól
pt_br: TODO: definir campos grandes como nulos
ru: TODO: установить значение NULL для больших полей
tr: TODO: büyük alanları null olarak ayarlayın

source: Take '{0}'
cs: Vzít {0}
es: Tomar "{0}"
ko: '{0}' 사용
pl: Przyjmij „{0}”
pt_br: Obter '{0}'
ru: Принимать "{0}"
tr: '{0}' al

source: Take both
cs: Vzít obojí
es: Tomar ambas
ko: 둘 다 사용
pl: Przyjmij oba
pt_br: Obter ambos
ru: Принимать оба
tr: Her ikisini de al

source: Take bottom
cs: Vzít dolní
es: Tomar parte inferior
ko: 맨 아래 사용
pl: Przyjmij dół
pt_br: Obter inferior
ru: Принимать нижнее
tr: Alttakini al

source: Take top
cs: Vzít horní
es: Tomar parte superior
ko: 맨 위 사용
pl: Przyjmij górę
pt_br: Obter superior
ru: Принимать верхнее
tr: Üsttekini al

source: Update suppression format
cs: Aktualizovat formát potlačení
es: Actualizar el formato de eliminación
ko: 제거 형식 업데이트
pl: Aktualizuj format pomijania
pt_br: Atualizar o formato de supressão
ru: Обновите формат подавления.
tr: Yinelenen uyarıları engelleme biçimini güncelleştir

# Use_discard_underscore
source: Use discard '_'
cs: Použít zahození _
es: Usar opción de descarte "_"
ko: 무시 항목 '_' 사용
pl: Użyj odrzucenia „_”
pt_br: Usar o descarte de '_'
ru: Используйте символ удаления "_"
tr: '_' atmasını kullan

source: Use discarded local
cs: Použít zahozenou místní
es: Usar el local descartado
ko: 무시된 로컬 사용
pl: Użyj odrzuconej zmiennej lokalnej
pt_br: Usar local descartado
ru: Использовать удаленный локальный оператор
tr: Atılmış yereli kullan

source: {0} (may change semantics)
cs: {0} (může změnit sémantiku)
es: {0} (puede cambiar la semántica)
ko: {0} (의미 체계를 변경할 수 있음)
pl: {0} (może zmienić semantykę)
pt_br: {0} (pode alterar a semântica)
ru: {0} (может изменить семантику)
tr: {0} (semantiği değiştirebilir)

# May_be_neccessary_in_other_project_this_document_is_linked_in
source: May be necessary in other project this document is linked in
es: Puede ser necesario en otro proyecto al que esté vinculado este documento
pt_br: Pode ser necessário em outro projeto em que este documento esteja vinculado
