Repository: dotnet/roslyn
Catalog: src/Text.Analyzers/Core/xlf/TextAnalyzersResources.*.xlf
Languages: es, pt_br, zh_hans, zh_hant

# IdentifiersShouldBeSpelledCorrectlyTitle
source: Identifiers should be spelled correctly
es: Los identificadores deben estar escritos correctamente.
pt_br: Identificadores devem ter grafia correta
zh_hans: 标识符应正确拼写
zh_hant: 識別項的拼字應正確

# IdentifiersShouldBeSpelledCorrectlyDescription
source: The name of an externally visible identifier contains one or more words that are not recognized by the Microsoft spelling checker library.
es: El nombre de un identificador visible externamente contiene una o varias palabras que la biblioteca del corrector ortográficos de Microsoft no reconoce.
pt_br: O nome de um identificador visível externamente contém uma ou mais palavras não reconhecidas pela biblioteca do verificador ortográfico da Microsoft.
zh_hans: 对外部可见的标识符的名称包含一个或多个未被 Microsoft 拼写检查库识别的单词。
zh_hant: 外部可見的識別項名稱，包含一或多個 Microsoft 拼字檢查程式庫無法辨識的字。

# IdentifiersShouldBeSpelledCorrectlyMessageAssembly
source: Correct the spelling of '{0}' in assembly name {1}
es: Corrija la ortografía de "{0}" en el nombre de ensamblado {1}.
pt_br: Corrija a ortografia de '{0}' no nome do assembly {1}

# IdentifiersShouldBeSpelledCorrectlyMessageNamespace
source: Correct the spelling of '{0}' in namespace name '{1}'
es: Corrija la ortografía de "{0}" en el nombre del espacio de nombres "{1}".
pt_br: Corrija a ortografia de '{0}' no nome do namespace '{1}'

# IdentifiersShouldBeSpelledCorrectlyMessageType
source: Correct the spelling of '{0}' in type name {1}
es: Corrija la ortografía de "{0}" en el nombre de tipo {1}.
pt_br: Corrija a ortografia de '{0}' no nome de tipo {1}

# IdentifiersShouldBeSpelledCorrectlyMessageMember
source: Correct the spelling of '{0}' in member name {1} or remove it entirely if it represents any sort of Hungarian notation
es: Corrija la ortografía de "{0}" en el nombre de miembro {1} o quítelo totalmente si representa algún tipo de notación húngara.
pt_br: Corrija a ortografia de '{0}' no nome de membro {1} ou remova-o inteiramente caso ele represente qualquer tipo de notação húngara

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameter
source: In method {0}, correct the spelling of '{1}' in parameter name {2} or remove it entirely if it represents any sort of Hungarian notation
es: En el método {0}, corrija la ortografía de "{1}" en el nombre de parámetro {2} o quítelo totalmente si representa algún tipo de notación húngara.
pt_br: No método {0}, corrija a ortografia de '{1}' no nome de parâmetro {2} ou remova-o inteiramente caso ele represente qualquer tipo de notação húngara

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameter
source: In delegate {0}, correct the spelling of '{1}' in parameter name {2} or remove it entirely if it represents any sort of Hungarian notation
es: En el delegado {0}, corrija la ortografía de "{1}" en el nombre de parámetro {2} o quítelo totalmente si representa algún tipo de notación húngara.
pt_br: No delegado {0}, corrija a ortografia de '{1}' no nome de parâmetro {2} ou remova-o inteiramente caso ele represente qualquer tipo de notação húngara

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameter
source: On type {0}, correct the spelling of '{1}' in generic type parameter name {2}
es: En el tipo {0}, corrija la ortografía de "{1}" en el nombre de parámetro de tipo genérico {2}.
pt_br: No tipo {0}, corrija a ortografia de '{1}' no nome de parâmetro de tipo genérico {2}

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameter
source: On method {0}, correct the spelling of '{1}' in generic type parameter name {2}
es: En el método {0}, corrija la ortografía de "{1}" en el nombre de parámetro de tipo genérico {2}.
pt_br: No método {0}, corrija a ortografia de '{1}' no nome de parâmetro de tipo genérico {2}

# IdentifiersShouldBeSpelledCorrectlyMessageAssemblyMoreMeaningfulName
source: Consider providing a more meaningful name than assembly name {0}
es: Considere proporcionar un nombre más significativo que el nombre del ensamblado {0}.
pt_br: Considere fornecer um nome mais relevante do que o nome de assembly {0}

# IdentifiersShouldBeSpelledCorrectlyMessageNamespaceMoreMeaningfulName
source: Consider providing a more meaningful name than namespace name '{0}'
es: Considere proporcionar un nombre más significativo que el nombre del espacio de nombres {0}.
pt_br: Considere fornecer um nome mais relevante do que o nome de namespace '{0}'

# IdentifiersShouldBeSpelledCorrectlyMessageTypeMoreMeaningfulName
source: Consider providing a more meaningful name than type name {0}
es: Considere proporcionar un nombre más significativo que el nombre del tipo {0}.
pt_br: Considere fornecer um nome mais relevante do que o nome de tipo {0}

# IdentifiersShouldBeSpelledCorrectlyMessageMemberMoreMeaningfulName
source: Consider providing a more meaningful name than member name {0}
es: Considere proporcionar un nombre más significativo que el nombre del miembro {0}.
pt_br: Considere fornecer um nome mais relevante do que o nome de membro {0}

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameterMoreMeaningfulName
source: In method {0}, consider providing a more meaningful name than parameter name {1}
es: En el método {0}, considere proporcionar un nombre más significativo que el nombre del parámetro {1}.
pt_br: No método {0}, considere fornecer um nome mais relevante do que o nome de parâmetro {1}

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameterMoreMeaningfulName
source: In delegate {0}, consider providing a more meaningful name than parameter name {1}
es: En el delegado {0}, considere proporcionar un nombre más significativo que el nombre del parámetro {1}.
pt_br: No delegado {0}, considere fornecer um nome mais relevante do que o nome de parâmetro {1}

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameterMoreMeaningfulName
source: On type {0}, consider providing a more meaningful name than generic type parameter name {1}
es: En el tipo {0}, considere proporcionar un nombre más significativo que el nombre del parámetro de tipo genérico {1}.
pt_br: No tipo {0}, considere fornecer um nome mais significativo do que o nome de parâmetro de tipo genérico {1}

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameterMoreMeaningfulName
source: On method {0}, consider providing a more meaningful name than generic type parameter name {1}
es: En el método {0}, considere proporcionar un nombre más significativo que el nombre del parámetro de tipo genérico {1}.
pt_br: No método {0}, considere fornecer um nome mais significativo do que o nome de parâmetro de tipo genérico {1}

# CategoryNaming
source: Naming
es: Nomenclatura
pt_br: Nomenclatura
zh_hans: 命名
zh_hant: 命名

# IdentifiersShouldBeSpelledCorrectlyMessageAssembly
source: Correct the spelling of '{0}' in assembly name {1}.
zh_hans: 更正程序集名称 {1} 中“{0}”的拼写。
zh_hant: 更正組件名稱 {1} 中 '{0}' 的拼字。

# IdentifiersShouldBeSpelledCorrectlyMessageNamespace
source: Correct the spelling of '{0}' in namespace name '{1}'.
zh_hans: 更正名称空间名称“{1}”中“{0}”的拼写。
zh_hant: 更正命名空間名稱 '{1}' 中 '{0}' 的拼字。

# IdentifiersShouldBeSpelledCorrectlyMessageType
source: Correct the spelling of '{0}' in type name {1}.
zh_hans: 更正类型名称 {1} 中“{0}”的拼写。
zh_hant: 更正類型名稱 {1} 中 '{0}' 的拼字。

# IdentifiersShouldBeSpelledCorrectlyMessageMember
source: Correct the spelling of '{0}' in member name {1} or remove it entirely if it represents any sort of Hungarian notation.
zh_hans: 更正成员名称 {1} 中“{0}”的拼写；如果它表示任何类型的匈牙利表示法，可完全删除它。
zh_hant: 更正成員名稱 {1} 中 '{0}' 的拼字，或是如果它代表任何類型的匈牙利標記法，則將其整個移除。

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameter
source: In method {0}, correct the spelling of '{1}' in parameter name {2} or remove it entirely if it represents any sort of Hungarian notation.
zh_hans: 在方法 {0} 中，更正参数名称 {2} 中“{1}”的拼写；如果它代表任何类型的匈牙利表示法，可完全删除它。
zh_hant: 在方法 {0} 中，更正參數名稱 {2} 中 '{1}' 的拼字，或是如果它代表任何類型的匈牙利標記法，則將其整個移除。

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameter
source: In delegate {0}, correct the spelling of '{1}' in parameter name {2} or remove it entirely if it represents any sort of Hungarian notation.
zh_hans: 在委托 {0} 中，更正参数名称 {2} 中“{1}”的拼写；如果它代表任何类型的匈牙利表示法，可完全删除它。
zh_hant: 在委派 {0} 中，更正參數名稱 {2} 中 '{1}' 的拼字，或是如果它代表任何類型的匈牙利標記法，則將其整個移除。

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameter
source: On type {0}, correct the spelling of '{1}' in generic type parameter name {2}.
zh_hans: 在类型 {0} 中，更正泛型类型参数名称 {2} 中“{1}”的拼写。
zh_hant: 在類型 {0} 上，更正泛型型別參數名稱 {2} 中 '{1}' 的拼字。

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameter
source: On method {0}, correct the spelling of '{1}' in generic type parameter name {2}.
zh_hans: 在方法 {0} 中，更正泛型类型参数名称 {2} 中“{1}”的拼写。
zh_hant: 在方法 {0} 上，更正泛型型別參數名稱 {2} 中 '{1}' 的拼字。

# IdentifiersShouldBeSpelledCorrectlyMessageAssemblyMoreMeaningfulName
source: Consider providing a more meaningful name than assembly name {0}.
zh_hans: 请考虑将程序集名称 {0} 改为一个意义更明确的名称。
zh_hant: 請考慮提供較組件名稱 {0} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageNamespaceMoreMeaningfulName
source: Consider providing a more meaningful name than namespace name '{0}'.
zh_hans: 请考虑将命名空间名称“{0}”改为一个意义更明确的名称。
zh_hant: 請考慮提供較命名空間名稱 '{0}' 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageTypeMoreMeaningfulName
source: Consider providing a more meaningful name than type name {0}.
zh_hans: 请考虑将类型名称 {0} 改为一个意义更明确的名称。
zh_hant: 請考慮提供較類型名稱 {0} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageMemberMoreMeaningfulName
source: Consider providing a more meaningful name than member name {0}.
zh_hans: 请考虑将成员名称 {0} 改为一个意义更明确的名称。
zh_hant: 請考慮提供較成員名稱 {0} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageMemberParameterMoreMeaningfulName
source: In method {0}, consider providing a more meaningful name than parameter name {1}.
zh_hans: 在方法 {0} 中，请考虑将参数名称 {1} 改为一个意义更明确的名称。
zh_hant: 請考慮在方法 {0} 中，提供較參數名稱 {1} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageDelegateParameterMoreMeaningfulName
source: In delegate {0}, consider providing a more meaningful name than parameter name {1}.
zh_hans: 在委托 {0} 中，请考虑将参数名称 {1} 改为一个意义更明确的名称。
zh_hant: 請考慮在委派 {0} 中，提供較參數名稱 {1} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageTypeTypeParameterMoreMeaningfulName
source: On type {0}, consider providing a more meaningful name than generic type parameter name {1}.
zh_hans: 在类型 {0} 中，请考虑将泛型类型参数名称 {1} 改为一个意义更明确的名称。
zh_hant: 請考慮在類型 {0} 上，提供較泛型型別參數名稱 {1} 更具意義的名稱。

# IdentifiersShouldBeSpelledCorrectlyMessageMethodTypeParameterMoreMeaningfulName
source: On method {0}, consider providing a more meaningful name than generic type parameter name {1}.
zh_hans: 在方法 {0} 中，请考虑将泛型类型参数名称 {1} 改为一个意义更明确的名称。
zh_hant: 請考慮在方法 {0} 上，提供較泛型型別參數名稱 {1} 更具意義的名稱。
