Repository: dotnet/roslyn
Catalog: src/Scripting/Core/xlf/ScriptingResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CannotSetLanguageSpecificOption
source: Cannot set {0} specific option {1} because the options were already configured for a different language.
cs: Pro {0} nelze nastavit specifickou možnost {1}, protože možnosti už byly nakonfigurovány pro jiný jazyk.
de: Die spezifische Option "{1}" für "{0}" kann nicht festgelegt werden, weil die Optionen bereits für eine andere Sprache konfiguriert wurden.
es: No se puede establecer la opción específica {0} {1} porque las opciones ya estaban configuradas para otro lenguaje.
fr: Impossible de définir l'option spécifique {0} {1}, car les options ont déjà été configurées pour un autre langage.
it: Non è possibile impostare l'opzione {1} specifica di {0} perché le opzioni sono già state configurate per un linguaggio diverso.
ja: {0} 固有のオプション {1} を設定できません。オプションが異なる言語用に既に構成されているためです。
ko: 옵션이 다른 언어에 대해 이미 구성되어 있으므로 {0} 특정 옵션 {1}을(를) 설정할 수 없습니다.
pl: Nie można ustawić opcji {1} specyficznej dla elementu {0}, ponieważ opcje zostały już skonfigurowane dla innego języka.
pt_br: Não é possível definir a opção {1} específica de {0} porque as opções já foram configuradas para um idioma diferente.
ru: Не удается задать параметр {1}, связанный с {0}, так как эти параметры уже настроены для другого языка.
tr: Seçenekler zaten farklı bir dil için yapılandırıldığından {0}'e özgü {1} seçeneği ayarlanamıyor.
zh_hans: 无法设置 {0} 特定选项 {1}，因为已为其他语言配置了这些选项。
zh_hant: 因為選項已經針對其他語言設定，所以無法設定 {0} 特定選項 {1}。

# StackOverflowWhileEvaluating
source: !<Stack overflow while evaluating object>
cs: !<Přetečení zásobníku během vyhodnocování objektu>
de: !<Stapelüberlauf beim Auswerten des Objekts.>
es: !<Desbordamiento de pila al evaluar objeto>
fr: !<Dépassement de capacité de la pile durant l'évaluation de l'objet>
it: !<Overflow dello stack durante la valutazione dell'oggetto>
ja: !<オブジェクトの評価中にスタック オーバーフローが発生しました>
ko: !<개체를 평가하는 동안 스택 오버플로가 발생함>
pl: !<Przepełnienie stosu podczas szacowania obiektu>
pt_br: !<Estouro de pilha durante a avaliação do objeto>
ru: !<Переполнение стека при вычислении объекта>
tr: !<Nesne değerlendirilirken yığın taşması>
zh_hans: !<计算对象时堆栈溢出>
zh_hant: !<評估物件時發生堆疊溢位>

# CantAssignTo
source: Can't assign '{0}' to '{1}'.
cs: {0} se nedá přiřadit {1}.
de: "{0}" kann "{1}" nicht zugewiesen werden.
es: No se puede asignar '{0}' a '{1}'.
fr: Impossible d'assigner '{0}' à '{1}'.
it: Non è possibile assegnare '{0}' a '{1}'.
ja: '{0}' を '{1}' に割り当てられません。
ko: '{0}'을(를) '{1}'에 할당할 수 없습니다.
pl: Nie można przypisać „{0}” do „{1}”.
pt_br: Não foi possível atribuir '{0}' a '{1}'.
ru: Не удается назначить "{0}" для "{1}".
tr: {1}' öğesine '{0}' atanamıyor.
zh_hans: 无法将“{0}”分配给“{1}”。
zh_hant: 無法將 '{0}' 指派給 '{1}'。

source: Expected an assembly reference.
cs: Očekával se odkaz na sestavení.
de: Ein Assemblyverweis wurde erwartet.
es: Se esperaba una referencia de ensamblado.
fr: Référence d'assembly attendue.
it: È previsto un riferimento ad assembly.
ja: アセンブリ参照が必要です。
ko: 어셈블리 참조가 필요합니다.
pl: Oczekiwano odwołania do zestawu.
pt_br: Referência de assembly esperado.
ru: Ожидалась ссылка на сборку.
tr: Bir derleme başvurusu bekleniyordu.
zh_hans: 需要一个程序集引用。
zh_hant: 必須是組件參考。

# DisplayNameOrPathCannotBe
source: Display name or path cannot be empty.
cs: Zobrazovaný název ani cesta nemůžou být prázdné.
de: Der Anzeigename oder Pfad darf nicht leer sein.
es: El nombre para mostrar o la ruta de acceso no pueden estar vacíos.
fr: Le nom complet ou le chemin d'accès ne peuvent pas être vides.
it: Il nome visualizzato o il percorso non può essere vuoto.
ja: 表示名またはパスを空にはできません。
ko: 표시 이름이나 경로는 비워 둘 수 없습니다.
pl: Ścieżka lub nazwa wyświetlana nie może być pusta.
pt_br: Nome de exibição ou caminho não pode estar vazio.
ru: Отображаемое имя или путь не могут быть пустыми.
tr: Görünen ad veya yol boş olamaz.
zh_hans: 显示名称或路径不能为空。
zh_hant: 顯示名稱或路徑不可為空白。

source: Absolute path expected
cs: Očekávala se absolutní cesta.
de: Absoluter Pfad erwartet.
es: Ruta de acceso absoluta esperada.
fr: Chemin d'accès absolu attendu
it: È previsto il percorso assoluto
ja: 絶対パスが必要です
ko: 절대 경로가 필요합니다.
pl: Oczekiwano ścieżki bezwzględnej
pt_br: Caminho absoluto esperado
ru: Ожидался абсолютный путь
tr: Mutlak yol bekleniyor
zh_hans: 预期的绝对路径
zh_hant: 必須是絕對路徑

# GlobalsNotAssignable
source: The globals of type '{0}' is not assignable to '{1}'
cs: Globální proměnné typu {0} se nedají přiřadit {1}.
de: Die globalen Variablen vom Typ "{0}" können "{1}" nicht zugewiesen werden.
es: Las variables globales de tipo '{0}' no se pueden asignar a '{1}'
fr: Les variables globales de type '{0}' ne peuvent pas être assignées à '{1}'
it: Le variabili globali di tipo '{0}' non sono assegnabili a '{1}'
ja: タイプ '{0}' のグローバル変数は、'{1}' に割り当てることはできません
ko: '{0}' 형식의 전역 변수는 '{1}'에 할당할 수 없습니다.
pl: Wartości globalnych typu „{0}” nie można przypisać do elementu „{1}”.
pt_br: Os globais do tipo '{0}' não podem ser atribuídos a '{1}'
ru: Объект Globals типа "{0}" не поддерживает назначение "{1}"
tr: {0}' türündeki genel değişkenler '{1}' öğesine atanamaz
zh_hans: 类型为“{0}”的全局数值不能赋值给“{1}”
zh_hant: 類型 '{0}' 的全域變數不可指派給 '{1}'

# StartingStateIncompatible
source: Starting state was incompatible with script.
cs: Počáteční stav nebyl kompatibilní se skriptem.
de: Der Anfangszustand war mit dem Skript nicht kompatibel.
es: El estado de inicio no era compatible con el script.
fr: L'état de départ était incompatible avec le script.
it: Lo stato iniziale non è compatibile con lo script.
ja: 開始状態にスクリプトとの互換性がありませんでした。
ko: 시작 상태가 스크립트와 호환되지 않습니다.
pl: Stan początkowy był niezgodny ze skryptem.
pt_br: O estado inicial não era compatível com o script.
ru: Начальное состояние было несовместимо со скриптом.
tr: Başlangıç durumu betik ile uyumsuzdu.
zh_hans: 正在启动状态与脚本不兼容。
zh_hant: 開始狀態與指令碼不相容。

source: Invalid assembly name
cs: Neplatný název sestavení
de: Ungültiger Assemblyname.
es: Nombre de ensamblado no válido
fr: Nom d'assembly non valide
it: Nome di assembly non valido
ja: 無効なアセンブリ名
ko: 잘못된 어셈블리 이름
pl: Nieprawidłowa nazwa zestawu
pt_br: Nome do assembly inválido
ru: Недопустимое имя сборки
tr: Geçersiz derleme adı
zh_hans: 程序集名称无效
zh_hant: 組件名稱無效

source: Invalid characters in assemblyName
cs: Neplatné znaky v assemblyName
de: Ungültige Zeichen in "assemblyName".
es: Caracteres no válidos en assemblyName
fr: Caractères non valides dans assemblyName
it: Caratteri non validi nel nome dell'assembly
ja: assemblyName の無効な文字
ko: assemblyName의 잘못된 문자
pl: Nieprawidłowe znaki w nazwie assemblyName
pt_br: Caracteres inválidos no assemblyName
ru: Недопустимые символы в assemblyName
tr: assemblyName içinde geçersiz karakterler
zh_hans: assemblyName 中的字符无效
zh_hant: assemblyName 中的無效字元

# ScriptRequiresGlobalVariables
source: The script requires access to global variables but none were given
cs: Skript vyžaduje přístup ke globálním proměnným, žádná ale není zadaná.
de: Das Skript erfordert Zugriff auf globale Variablen, aber es wurden keine globalen Variablen angegeben.
es: El script necesita tener acceso a las variables globales, pero este acceso aún no se otorgó
fr: Le script a besoin d'accéder aux variables globales mais aucune d'entre elles n'a été fournie
it: Lo script richiede l'accesso a variabili globali, ma non ne è stata specificata nessuna
ja: スクリプトにグローバル変数へのアクセスが必要ですが、何も指定されませんでした
ko: 스크립트에서 전역 변수에 액세스해야 하지만 전역 변수가 제공되지 않았습니다.
pl: Skrypt wymaga praw dostępu do zmiennych globalnych, ale jeszcze ich nie nadano
pt_br: O script requer acesso às variáveis globais, mas esse acesso não foi fornecido
ru: Скрипту требуется доступ к глобальным переменным, который не был предоставлен
tr: Betik genel değişkenlere erişimi gerektiriyor ancak hiçbiri verilmemiş
zh_hans: 此脚本需要能够访问全局变量，但未给予任何全局变量
zh_hant: 指令碼需要全域變數存取權，但未提供

# GlobalVariablesWithoutGlobalType
source: Global variables passed to a script without a global type
cs: Globální proměnné se předaly skriptu bez globálního typu.
de: Globale Variablen wurden ohne einen globalen Typ an ein Skript übergeben.
es: Variables globales pasadas a un script sin un tipo global
fr: Variables globales passées à un script sans type global
it: A uno script sono state passate variabili globali senza un tipo globale
ja: グローバル タイプを指定せずにスクリプトに渡されたグローバル変数
ko: 전역 변수가 전역 형식 없이 스크립트에 전달되었습니다.
pl: Zmienne globalne przekazane do skryptu bez typu globalnego
pt_br: Variáveis globais passadas para um script sem um tipo global
ru: Глобальные переменные переданы в скрипт без глобального типа
tr: Genel tür içermeyen bir betiğe geçirilen genel değişkenler
zh_hans: 传递到脚本的全局变量未设置全局类型
zh_hant: 傳遞至沒有全域類型之指令碼的全域變數

# PlusAdditionalError
source: + additional {0} error
cs: + další {0} chyba
de: + {0} weiterer Fehler
es: + error {0} adicional
fr: + {0} erreur supplémentaire
it: + {0} altro errore
ja: + さらに {0} 件のエラー
ko: 외 {0}개의 추가 오류
pl: + dodatkowy błąd ({0})
pt_br: + {0} outro erro
ru: + дополнительная ошибка: {0}
tr: + {0} hata daha
zh_hans: + 其他一个 {0} 错误
zh_hant: + 其他 {0} 錯誤

# PlusAdditionalErrors
source: + additional {0} errors
cs: + počet dalších chyb: {0}
de: + {0} weitere Fehler
es: + errores {0} adicionales
fr: + {0} erreurs supplémentaires
it: + altri {0} errori
ja: + さらに {0} 件のエラー
ko: 외 {0}개의 추가 오류
pl: + dodatkowe błędy ({0})
pt_br: + {0} outros erros
ru: + дополнительные ошибки: {0}
tr: + {0} hata daha
zh_hans: + 其他几个 {0} 错误
zh_hant: + 其他 {0} 錯誤

# AtFileLine
source: at {0} : {1}
cs: na {0} : {1}
de: in {0} : {1}
es: en {0} : {1}
fr: à {0} : {1}
it: a {0}: {1}
ja: 場所 {0} : {1}
ko: 위치: {0} : {1}
pt_br: em {0}: {1}
ru: в {0} : {1}
tr: konum {0} : {1}
zh_hans: 在 {0} : {1}
zh_hant: 在 {0} : {1}

# CannotSetReadOnlyVariable
source: Cannot set a read-only variable
cs: Nejde nastavit proměnnou jen pro čtení.
de: Eine schreibgeschützte Variable kann nicht festgelegt werden.
es: No se puede establecer una variable de solo lectura
fr: Impossible de définir une variable en lecture seule
it: Non è possibile impostare una variabile di sola lettura
ja: 読み取り専用変数を設定できません
ko: 읽기 전용 변수를 설정할 수 없습니다.
pl: Nie można ustawić zmiennej tylko do odczytu
pt_br: Não é possível definir uma variável somente leitura
ru: Невозможно задать переменную только для чтения
tr: Salt okunur bir değişken ayarlanamaz
zh_hans: 无法设置只读变量
zh_hant: 無法設定唯讀變數

# CannotSetConstantVariable
source: Cannot set a constant variable
cs: Nejde nastavit konstantní proměnnou.
de: Eine konstante Variable kann nicht festgelegt werden.
es: No se puede establecer una variable constante
fr: Impossible de définir une variable constante
it: Non è possibile impostare una variabile costante
ja: 定数変数を設定できません
ko: 상수 변수를 설정할 수 없습니다.
pl: Nie można ustawić zmiennej stałej
pt_br: Não é possível definir uma variável constante
ru: Невозможно задать постоянную переменную
tr: Sabit bir değişken ayarlanamaz
zh_hans: 无法设置常量变量
zh_hant: 無法設定常數變數

# HelpPrompt
source: Type "#help" for more information.
cs: Zadáním #help si zobrazíte víc informací.
de: Weitere Informationen erhalten Sie nach der Eingabe von "#help".
es: Escriba "#help" para más información.
fr: Tapez "#help" pour plus d'informations.
it: Per altre informazioni, digitare "#help".
ja: 詳細については、「#help」と入力します。
ko: 자세한 내용을 보려면 "#help"를 입력하세요.
pl: Wpisz polecenie „#help”, aby uzyskać więcej informacji.
pt_br: Digite "#help" para obter mais informações.
ru: Введите "#help" для получения дополнительных сведений.
tr: Daha fazla bilgi için "#help" yazın.
zh_hans: 键入“#help”，了解更多信息。
zh_hant: 如需詳細資訊，請輸入 "#help"。

# HelpText
source: Keyboard shortcuts: Enter If the current submission appears to be complete, evaluate it. Otherwise, insert a new line. Escape Clear the current submission. UpArrow Replace the current submission with a previous submission. DownArrow Replace the current submission with a subsequent submission (after having previously navigated backwards). Ctrl-C Exit the REPL. REPL commands: #help Display help on available commands and key bindings. Script directives: #r Add a metadata reference to specified assembly and all its dependencies, e.g. #r "myLib.dll". #load Load specified script file and execute it, e.g. #load "myScript.csx".
cs: Klávesové zkratky: Enter Pokud se aktuální odeslání jeví jako kompletní, vyhodnotí ho. Jinak vloží nový řádek. Escape Vymaže aktuální odeslání. Šipka nahoru Nahradí aktuální odeslání předchozím odesláním. Šipka dolů Nahradí aktuální odeslání následujícím odesláním (po předchozí navigaci směrem zpět). Ctrl+C Ukončí REPL. Příkazy REPL: #help Zobrazí nápovědu k dostupným příkazům a vazbám kláves. Direktivy skriptu: #r Přidá odkazy metadat k určenému sestavení a všem jeho závislostem, třeba #r "myLib.dll". #load Načte zadaný soubor skriptu a spustí ho, třeba #load "myScript.csx".
de: Tastaturkurzbefehle: EINGABETASTE Wertet die aktuelle Übermittlung aus, wenn diese abgeschlossen zu sein scheint. Fügt andernfalls eine neue Zeile ein. ESC-TASTE Löscht die aktuelle Übermittlung. NACH-OBEN-TASTE Ersetzt die aktuelle Übermittlung durch eine vorherige Übermittlung. NACH-UNTEN-TASTE Ersetzt die aktuelle Übermittlung durch eine nachfolgende Übermittlung (nach vorheriger Rückwärtsnavigation). STRG+C Beendet die REPL. REPL-Befehle: "#help" Zeigt Hilfe zu den verfügbaren Befehlen und Tastenzuordnungen an. Skriptdirektiven: #r Fügt einer angegebenen Assembly und allen ihren Abhängigkeiten einen Metadatenverweis hinzu. Beispiel: #r "myLib.dll". #load Lädt die angegebene Skriptdatei und führt sie aus. Beispiel: #load "myScript.csx".
es: Métodos abreviados de teclado: Entrar Si el envío actual parece estar completo, evalúelo. De lo contrario, inserte una nueva línea. Esc Borre el envío actual. Flecha arriba Reemplace el envío actual por uno anterior. Flecha abajo Reemplace el envío actual por uno posterior (tras haber navegado hacia atrás). Ctrl-C Salir de REPL. Comandos REPL: #help Mostrar ayuda sobre los comandos y los enlaces de teclado disponibles. Directivas de script: #r Agregue una referencia de metadatos al ensamblado especificado y todas sus dependencias, p. ej. #r "myLib.dll". #load Cargue el archivo de script especificado y ejecútelos, p. ej. #load "myScript.csx".
fr: Raccourcis clavier : Entrée Si la soumission actuelle semble achevée, l'évaluer. Sinon, insérer une nouvelle ligne. Échap Effacer la soumission actuelle. Flèche haut Remplacer la soumission actuelle par une soumission antérieure. Flèche bas Remplacer la soumission actuelle par une autre soumission (après avoir navigué vers l'arrière). Ctrl-C Quitter REPL. Commandes REPL : #help Afficher l'aide sur les commandes disponibles et les combinaisons de touche. Directives de script : #r Ajouter une référence de métadonnées à l'assembly spécifié et toutes ses dépendances. Exemple : #r "myLib.dll". #load Charger le fichier de script spécifié et l'exécuter. Exemple : #load "myScript.csx".
it: Tasti di scelta rapida: INVIO Valuta se l'invio corrente sembra completo; in caso contrario, inserisce una nuova riga. ESC Cancella l'invio corrente. Freccia SU Sostituisce l'invio corrente con uno precedente. Freccia GIÙ Sostituisce l'invio corrente con uno successivo dopo che è stato eseguito uno spostamento all'indietro. CTRL+C Esce da REPL. Comandi REPL: #help Visualizza la guida relativa ai comandi e i tasti di scelta rapida disponibili. Direttive script: #r Aggiunge un riferimento ai metadati all'assembly specificato e a tutte le relative dipendenze, ad esempio #r "LibPersonale.dll". #load Carica il file di script specificato e lo esegue, ad esempio #load "ScriptPersonale.csx".
ja: キーボード ショートカット: Enter 現在の送信が完全と思われる場合には、それを評価します。そうでない場合には、改行を挿入します。 Escape 現在の送信をクリアします。 UpArrow 現在の送信を前の送信に置き換えます。 DownArrow 現在の送信を次の送信に置き換えます (前に戻っている場合) 。 Ctrl-C REPL を終了します。 REPL コマンド: #help 利用可能なコマンドとキー バインディングに関するヘルプを表示します。 スクリプト ディレクティブ: #r 指定されたアセンブリとそのすべての依存関係へのメタデータ参照を追加します (例: #r "myLib.dll")。 #load 指定されたスクリプト ファイルを読み込んで実行します (例: #load "myScript.csx")。
ko: 바로 가기 키: Enter 현재 제출이 완료된 것으로 보이는 경우 평가하고 그렇지 않으면 새 줄을 삽입합니다. Esc 현재 제출을 지웁니다. 위쪽 화살표 현재 제출을 이전 제출로 바꿉니다. 아래쪽 화살표 현재 제출을 이후 제출로 바꿉니다(미리 뒤로 이동한 후). Ctrl-C REPL을 종료합니다. REPL 명령: #help 사용 가능한 명령 및 키 바인딩에 대한 도움말을 표시합니다. 스크립트 지시문: #r 지정한 어셈블리 및 모든 해당 종속성에 대한 메타데이터 참조를 추가합니다(예: #r "myLib.dll"). #load 지정한 스크립트 파일을 로드하고 실행합니다(예: #load "myScript.csx").
pl: Skróty klawiaturowe: Enter Jeśli wprowadzane dane są kompletne, przeprowadź dla nich obliczenia. W przeciwnym razie wstaw nowy wiersz. Escape Wyczyść aktualnie wprowadzone dane. Strzałka w górę Zastąp aktualnie wprowadzone dane danymi wprowadzonymi poprzednio. Strzałka w dół Zastąp aktualnie wprowadzone dane kolejnymi danymi (po wcześniejszej nawigacji wstecz). Ctrl+C Zamknij konsolę REPL. Polecenia REPL: #help Wyświetl pomoc dla dostępnych poleceń i powiązań klawiszy. Dyrektywy skryptu: #r Dodaj odwołanie do metadanych do określonego zestawu i wszystkich jego zależności, np. #r "myLib.dll". #load Załaduj określony plik skryptu i wykonaj go, np. #load "myScript.csx".
pt_br: Atalhos de teclado: Enter Se o envio atual parece estar concluído, avalie-o. Caso contrário, insira uma nova linha. Escape Limpe o envio atual. UpArrow Substitua o envio atual por um envio anterior. DownArrow Substitua o envio atual por um envio subsequente (após ter anteriormente navegado para trás). Ctrl-C Saia do REPL. Comandos REPL: #help Exiba a ajuda sobre associações de teclas e comandos e disponíveis. Diretivas de script: #r Adicione uma referência de metadados para o assembly especificado e todas as suas dependências, por ex., #r "myLib.dll". #load Carregue o arquivo de script especificado e execute-o, por ex., #load "myScript.csx".
ru: Сочетания клавиш Клавиша ВВОД Если текущая отправка завершена, вычисляет ее. В противном случае добавляет новую строку. Клавиша ESC Очищает текущую отправку. Клавиша СТРЕЛКА ВВЕРХ Заменяет текущую отправку на предыдущую. Клавиша СТРЕЛКА ВНИЗ Заменяет текущую отправку на последующую (после предыдущего перехода в обратном порядке). Клавиши CTRL+C Выход из REPL. Команды цикла "Чтение — вычисление — печать": #help Отображает справку по текущим командам и сочетаниям клавиш. Директивы скрипта #r Добавляет ссылку на метаданные в указанную сборку и все ее зависимости, например #r myLib.dll. #load Загружает указанный файл скрипта и выполняет его, например #load myScript.csx.
tr: Klavye kısayolları: Enter Geçerli gönderim tamamlanmış görünüyorsa değerlendir. Aksi takdirde, yeni bir satır ekle. Escape Geçerli gönderimi sil. Yukarı Ok Geçerli gönderimi önceki bir gönderimle değiştir. Aşağı Ok Geçerli gönderimi sonraki bir gönderimle değiştir (daha önce geriye gittikten sonra). Ctrl-C REPL'den çık. REPL komutları: #help Kullanılabilir komutlarda ve anahtar bağlamalarında yardımı görüntüle. Betik yönergeleri: #r Belirtilen bütünleştirilmiş koda ve tüm bağımlılıklarına bir meta veri başvurusu ekle, ör. #r "myLib.dll". #load Belirtilen betik dosyasını yükle ve çalıştır, ör. #load "myScript.csx".
zh_hans: 键盘快捷方式: Enter 如果显示当前提交完成，则对其进行求值。否则，插入新行。 Esc 清除当前提交。 向上键 将当前提交替换为前一个提交。 向下键 将当前提交替换为后一个提交(在之前已向后导航之后)。 Ctrl-C 退出 REPL。 REPL 命令: #help 显示有关可用命令和密钥绑定的帮助。 脚本指令: #r 添加对指定程序集及其所有依赖项的元数据引用，例如 #r "myLib.dll"。 #load 加载指定的脚本文件并执行，例如 #load "myScript.csx"。
zh_hant: 鍵盤快速鍵: Enter 如果目前提交似乎已完成，會加以評估。否則會插入新行。 Escape 清除目前的提交。 UpArrow 以上一個提交取代目前的提交。 DownArrow 以下一個提交取代目前的提交 (前一個向後巡覽之後)。 Ctrl-C 結束 REPL。 REPL 命令: #help 顯示可用命令與金鑰繫結的說明。 指令碼指示詞: #r 將中繼資料參考加入指定的組件及其所有相依性中，例如 #r "myLib.dll"。 #load 載入指定的指令碼檔案並加以執行，例如 #load "myScript.csx"。

# AssemblyAlreadyLoaded
source: Assembly '{0}, Version={1}' has already been loaded from '{2}'. A different assembly with the same name and version can't be loaded: '{3}'.
cs: Sestavení {0} verze {1} už bylo z {2} načteno. Odlišné sestavení se stejným názvem a verzí nelze načíst: {3}.
de: Die Assembly "{0}, Version={1}" wurde bereits von "{2}" geladen. Eine andere Assembly mit demselben Namen und derselben Version kann nicht geladen werden: {3}.
es: Ya se ha cargado el ensamblado "{0}, versión = {1}" desde "{2}". No se puede cargar un ensamblado distinto con el mismo nombre y la misma versión: "{3}".
fr: L'assembly '{0}, version={1}' a déjà été chargé à partir de '{2}'. Impossible de charger un autre assembly portant le même nom et ayant la même version : '{3}'.
it: L'assembly '{0}, Version={1}' è già stato caricato da '{2}'. Non è possibile caricare un assembly con lo stesso nome e la stessa versione: '{3}'.
ja: アセンブリ '{0}, Version={1}' は既に '{2}' から読み込まれています。名前とバージョンが同じで別のアセンブリは読み込まれません: '{3}'。
ko: 어셈블리 '{0}, 버전={1}'이(가) '{2}'에서 이미 로드되었습니다. 이름과 버전이 같은 다른 어셈블리를 로드할 수 없습니다. '{3}'.
pl: Zestaw „{0}”, wersja =„{1}” został już załadowany z „{2}”. Nie można załadować innego zestawu o takiej samej nazwie i wersji: „{3}”.
pt_br: Assembly '{0}, Versão ={1}' já foi carregado de '{2}'. Um assembly diferente com o mesmo nome e versão não pode ser carregado: '{3}'.
ru: Сборка "{0}" версии "{1}" уже загружена из "{2}". Нельзя загрузить другую сборку с тем же именем и версией: "{3}".
tr: Derleme '{0}, Sürüm ={1}', daha önce '{2}' konumundan yüklendi. Aynı ad ve sürümde farklı bir derleme yüklenemez: '{3}'.
zh_hans: 已从“{2}”加载程序集“{0}，版本={1}”。无法加载另一个具有相同名称和版本的程序集:“{3}”。
zh_hant: 組件 '{0}，版本 ={1}' 已從 '{2}' 載入。具有相同名稱和版本的不同組件不得載入: '{3}'。

# AssemblyAlreadyLoadedNotSigned
source: Assembly '{0}' has already been loaded from '{1}'. A different assembly with the same name can't be loaded unless it's signed: '{2}'.
cs: Sestavení {0} už bylo z {1} načteno. Odlišné sestavení se stejným názvem nelze načíst, pokud není podepsané: {2}.
de: Die Assembly "{0}" wurde bereits von "{1}" geladen. Eine andere Assembly mit demselben Namen und derselben Version nur geladen werden, wenn sie signiert ist: {2}.
es: Ya se ha cargado el ensamblado "{0}" desde "{1}". No se puede cargar un ensamblado distinto con el mismo nombre, a menos que esté firmado: "{2}".
fr: L'assembly '{0}' a déjà été chargé à partir de '{1}'. Impossible de charger un autre assembly portant le même nom à moins qu'il ne soit signé : '{2}'.
it: L'assembly '{0}' è già stato caricato da '{1}'. Non è possibile caricare un assembly diverso con lo stesso nome a meno che non sia firmato: '{2}'.
ja: アセンブリ '{0}' は既に '{1}' から読み込まれています。名前が同じで別のアセンブリは署名されていない限り読み込まれません: '{2}'。
ko: '{0}' 어셈블리가 '{1}'에서 이미 로드되었습니다. 이름이 같은 다른 어셈블리는 서명되지 않은 경우 로드할 수 없습니다. '{2}'.
pl: Zestaw „{0}” został już załadowany z „{1}”. Nie można załadować innego zestawu o takiej samej nazwie, chyba że jest podpisany: „{2}”.
pt_br: O Assembly '{0}' já foi carregado de '{1}'. Não é possível carregar um assembly diferente com o mesmo nome, a menos que ele esteja assinado: '{2}'.
ru: Сборка "{0}" уже загружена из "{1}". Нельзя загрузить другую сборку с тем же именем, если она не подписана: "{2}".
tr: {0}' derlemesi daha önce '{1}' konumundan yüklendi. İmzalı olmadığı sürece aynı ada sahip başka bir derleme yüklenemez: '{2}'.
zh_hans: 已从“{1}”加载程序集“{0}”。无法加载另一个具有相同名称的程序集，除非向其签名:“{2}”。
zh_hant: 組件 '{0}' 已從 '{1}' 載入。具有相同名稱的不同組件除非已簽章，否則不得載入: '{2}'。
