Repository: dotnet/roslyn
Catalog: src/EditorFeatures/VisualBasic/xlf/VBEditorResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Case Correction
cs: Oprava velkých a malých písmen
de: Fallkorrektur
es: Corrección de mayúsculas/minúsculas
fr: Correction de la casse
ja: 大文字小文字の修正
ko: 대/소문자 수정
pl: Poprawianie wielkości liter
pt_br: Correção de Caso
tr: Büyük/Küçük Harf Düzeltmesi
zh_hans: 大小写更正
zh_hant: 大小寫修正

source: Correcting word casing...
cs: Opravují se velká a malá písmena u slov...
de: Wortschreibweise wird korrigiert...
es: Corrigiendo uso de mayúsculas/minúsculas...
fr: Correction de la casse des mots...
ja: 単語の大文字と小文字を修正しています...
ko: 단어 대/소문자 수정 중...
pl: Trwa poprawianie wielkości liter w słowie...
pt_br: Corrigindo maiúsculas e minúsculas de palavras...
tr: Sözcük büyük/küçük harfleri düzeltiliyor...
zh_hans: 正在更正单词的大小写...
zh_hant: 正在修正文字大小寫...

source: New
cs: Nový
es: Nuevo
fr: Nouveau
ja: 新規作成
ko: 새로 만들기
pl: Nowy
tr: Yeni
zh_hant: 新建

source: ({0} Events)
cs: (Počet událostí: {0})
es: ({0} eventos)
fr: ({0} événements)
ja: ({0} イベント)
ko: ({0} 이벤트)
pl: (Zdarzenia: {0})
tr: ({0} Olay)
zh_hant: ({0} 個事件)

source: This call is required by the designer.
cs: Toto volání je vyžadované návrhářem.
de: Dieser Aufruf ist für den Designer erforderlich.
es: Esta llamada es exigida por el diseñador.
fr: Cet appel est requis par le concepteur.
ja: この呼び出しはデザイナーで必要です。
ko: 디자이너에서 이 호출이 필요합니다.
pl: To wywołanie jest wymagane przez projektanta.
pt_br: Esta chamada é requerida pelo designer.
ru: Этот вызов является обязательным для конструктора.
tr: Bu çağrı tasarımcı için gerekli.
zh_hans: 此调用是设计器所必需的。
zh_hant: 設計工具需要此呼叫。

source: Add any initialization after the InitializeComponent() call.
cs: Přidejte libovolnou inicializaci po volání InitializeComponent().
de: Fügen Sie Initialisierungen nach dem InitializeComponent()-Aufruf hinzu.
es: Agregue cualquier inicialización después de la llamada a InitializeComponent().
fr: Ajoutez une initialisation quelconque après l'appel InitializeComponent().
ja: InitializeComponent() 呼び出しの後で初期化を追加します。
ko: InitializeComponent() 호출 뒤에 초기화 코드를 추가하세요.
pl: Dodaj inicjowanie po wywołaniu funkcji InitializeComponent().
pt_br: Adicione qualquer inicialização após a chamada InitializeComponent().
ru: Добавить код инициализации после вызова InitializeComponent().
tr: InitializeComponent() çağrısından sonra başlangıç değer ekleyin.
zh_hans: 在 InitializeComponent() 调用之后添加任何初始化。
zh_hant: 在 InitializeComponent() 呼叫之後加入所有初始設定。

source: End Construct
cs: Koncová konstrukce
de: Endkonstrukt
es: Terminar construcción
fr: Construction de fin
ja: コンストラクターの終了
ko: 구문 종료
pl: Konstrukcja końcowa
pt_br: Finalizar Construção
ru: Закончить конструкцию
tr: Bitiş Yapısı
zh_hans: 最终构造
zh_hant: End 建構

source: Smart Indenting
cs: Chytré odsazování
de: Intelligenter Einzug
es: Sangría inteligente
fr: Retrait intelligent
ja: スマート インデント
ko: 스마트 들여쓰기
pl: Inteligentne tworzenie wcięć
pt_br: Recuo Inteligente
tr: Akıllı Girintileme
zh_hans: 智能缩进
zh_hant: 智慧縮排

source: Format Document
cs: Formátovat dokument
de: Dokument formatieren
es: Dar formato al documento
fr: Mettre le document en forme
ja: ドキュメントのフォーマット
ko: 문서 서식
pl: Formatuj dokument
pt_br: Formatar Documento
tr: Belgeyi Biçimlendir
zh_hant: 格式化文件

source: Formatting Document...
cs: Formátuje se dokument...
de: Dokument wird formatiert...
es: Aplicando formato al documento...
fr: Mise en forme du document...
ja: ドキュメントをフォーマットしています...
ko: 문서 서식을 지정하는 중...
pl: Trwa formatowanie dokumentu...
pt_br: Formatando documento...
ru: Идет форматирование документа...
tr: Belge Biçimlendiriliyor...
zh_hans: 正在设置文档格式...
zh_hant: 正在格式化文件...

source: Insert new line
cs: Vložit nový řádek
de: Neue Zeile einfügen
es: Insertar nueva línea
fr: Insérer une nouvelle ligne
ja: 改行の挿入
ko: 새 줄 삽입
pl: Wstaw nowy wiersz
pt_br: Inserir Nova Linha
ru: Вставить новую строку
tr: Yeni satır ekle
zh_hans: 插入新行
zh_hant: 插入新行

source: Format Paste
cs: Vložit formát
de: Format einfügen
es: Pegado de formato
fr: Mettre en forme lors du collage
ja: 書式の貼り付け
ko: 서식 붙여넣기
pl: Formatuj wklejoną zawartość
pt_br: Colar Formato
tr: Yapıştırmayı Biçimlendir
zh_hans: 格式粘贴
zh_hant: 貼上格式

source: Formatting pasted text...
cs: Formátuje se vložený text...
de: Eingefügter Text wird formatiert...
es: Dando formato al texto pegado...
fr: Mise en forme du texte collé...
ja: 貼り付けたテキストを書式設定しています...
ko: 붙여넣은 텍스트의 서식을 지정하는 중...
pl: Trwa formatowanie wklejonego tekstu...
pt_br: Formatando texto colado...
ru: Идет форматирование вставленного текста...
tr: Yapıştırılan metin biçimlendiriliyor...
zh_hans: 正在设置已粘贴文本的格式...
zh_hant: 正在格式化貼上的文字...

source: Paste
cs: Vložit
de: Einfügen
es: Pegar
fr: Coller
ja: 貼り付け
ko: 붙여넣기
pl: Wklej
pt_br: Colar
ru: Вставить
tr: Yapıştır
zh_hans: 粘贴
zh_hant: 貼上

source: Format on Save
cs: Formátovat při uložení
de: Format wird gespeichert
es: Aplicar formato al guardar
fr: Mettre en forme lors de l'enregistrement
ja: 保存の形式
ko: 저장 시 서식 지정
pl: Sformatuj przy zapisywaniu
pt_br: Formatar em Salvar
ru: Форматировать при сохранении
tr: Kaydetmede Biçimlendir
zh_hans: 在保存时格式化
zh_hant: 儲存時格式化

source: Committing line
cs: Potvrzují se zmměny řádku.
de: Zeile wird committet
es: Confirmando línea
fr: Validation de ligne
ja: 行をコミットしています
ko: 줄 커밋 중
pl: Zatwierdzanie wiersza
pt_br: Confirmando linha
ru: Строка выполнения
tr: Satır işleniyor
zh_hans: 正在提交行
zh_hant: 正在認可程式行

source: Visual Basic Pretty List
cs: Visual Basic formátování typu Pretty List
de: Visual Basic - Automatische Strukturierung
es: Lista descriptiva de Visual Basic
fr: Liste automatique Visual Basic
ja: Visual Basic の再フォーマット
ko: Visual Basic 서식 다시 적용
pl: Formatowanie kodu języka Visual Basic
pt_br: Reformatação Automática do Visual Basic
ru: Изящный список Visual Basic
tr: Visual Basic Düzgün Listesi
zh_hans: Visual Basic 整齐列表
zh_hant: Visual Basic 美化清單

source: <Multiple Types>
es: <Varios tipos>
fr: <Plusieurs types>
ja: <複数の種類>

source: not supported
cs: nepodporované
de: nicht unterstützt
es: no compatible
fr: non pris en charge
ja: サポートされていません
ko: 지원되지 않음
pl: nieobsługiwane
pt_br: não suportado
ru: не поддерживается
tr: Desteklenmiyor
zh_hans: 不支持
zh_hant: 不支援

source: Generate Member
cs: Generovat člen
de: Mitglied generieren
es: Generar miembro
fr: Générer le membre
ja: メンバーの生成
ko: 멤버 생성
pl: Wygeneruj składową
pt_br: Gerar Membro
ru: Создать член
tr: Üye Üret
zh_hans: 生成成员
zh_hant: 產生成員

source: Line commit
cs: Potvrzení změn řádku
de: Zeilencommit
es: Confirmación de línea
fr: Validation de ligne
ja: 行コミット
ko: 줄 커밋
pl: Zatwierdzenie wiersza
pt_br: Confirmação de linha
ru: Фиксация строки
tr: Satır işleme
zh_hans: 行提交
zh_hant: 行認可

source: Implement Abstract Class Or Interface
cs: Implementovat abstraktní třídu nebo rozhraní
de: Abstrakte Klasse oder Schnittstelle implementieren
es: Implementar interfaz o clase abstracta
fr: Implémenter une interface ou une classe abstraite
ja: 抽象クラスまたはインターフェイスの実装
ko: 추상 클래스 또는 인터페이스 구현
pl: Implementuj klasę abstrakcyjną lub interfejs
pt_br: Implementar Classe Abstrata ou Interface
ru: Реализовать абстрактный класс или интерфейс
tr: Abstract Sınıfını veya Interface Uygula
zh_hans: 实现抽象类或接口
zh_hant: 實作抽象類別或介面

source: Add Missing Imports on Paste
de: Beim Einfügen fehlende import-Anweisungen hinzufügen
pt_br: Adicionar as Importações Ausentes ao Colar
ru: Добавить недостающие директивы import при вставке
zh_hans: 粘贴时添加缺少的 Imports

source: Adding missing imports...
de: Fehlende import-Anweisungen werden hinzugefügt...
pt_br: Adicionando as importações ausentes...
ru: Добавление недостающих директив import…
zh_hans: 正在添加缺少的 imports…
