Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# CompareSymbolsCorrectlyTitle
source: Compare symbols correctly
de: Symbole ordnungsgemäß vergleichen
fr: Comparer les symboles correctement
ja: シンボルを正しく比較する
ko: 기호를 올바르게 비교
tr: Simgeleri doğru karşılaştır
zh_hans: 正确比较符号

# ConfigureGeneratedCodeAnalysisDescription
source: Configure generated code analysis
de: Konfigurieren der Analyse von generiertem Code
fr: Configurer l'analyse du code générée
ja: 生成されたコード分析を構成します
ko: 생성된 코드 분석 구성
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析

# DeclareDiagnosticIdInAnalyzerReleaseMessage
source: Rule '{0}' is not part of any analyzer release.
ja: ルール '{0}' は、どのアナライザー リリースにも含まれていません。

# DeclareDiagnosticIdInAnalyzerReleaseTitle
source: Add analyzer diagnostic IDs to analyzer release.
ja: アナライザー診断 ID をアナライザー リリースに追加します。

# DefineDiagnosticDescriptionCorrectlyMessage
source: The diagnostic description should be one or multiple sentences ending with a punctuation sign.
ja: 診断の説明は、句読点で終わる 1 つまたは複数の文にする必要があります。

# DefineDiagnosticMessageCorrectlyMessage
source: The diagnostic message should not contain any line return character and should either be a single sentence without a trailing period or a multi-sentences with a trailing period.
ja: 診断メッセージには改行文字を含めないでください。また、末尾にピリオドが付いていない 1 つの文か、末尾にピリオドが付いた複数の文にする必要があります。

# DefineDiagnosticTitleCorrectlyMessage
source: The diagnostic title should not contain a period or any line return character
ja: 診断タイトルには、ピリオドも改行文字も含めないでください

# DoNotUseReservedDiagnosticIdMessage
source: '{0}' is a reserved diagnostic ID.
ja: '{0}' は予約済みの診断 ID です。

# DoNotUseReservedDiagnosticIdTitle
source: Do not use reserved diagnostic IDs.
ja: 予約済みの診断 ID を使用しないでください。

# EnableAnalyzerReleaseTrackingRuleDescription
source: Enabling release tracking for analyzer packages helps in tracking and documenting the analyzer diagnostics that ship and/or change with each analyzer release. See details at https://github.com/dotnet/roslyn-analyzers/blob/master/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
ja: アナライザー パッケージのリリース追跡を有効にすると、各アナライザー リリースで配布または変更されるアナライザー診断の追跡とドキュメント化に役立ちます。詳細については、https://github.com/dotnet/roslyn-analyzers/blob/master/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md をご覧ください。

# EnableConcurrentExecutionDescription
source: Enable concurrent execution
de: Gleichzeitige Ausführung aktivieren
fr: Activer l'exécution simultanée
ja: 同時実行を有効にします
ko: 동시 실행 사용
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行

# InvalidEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an invalid entry '{1}'.
ja: アナライザー リリース ファイル '{0}' に無効なエントリ '{1}' があります。

# InvalidEntryInAnalyzerReleasesFileRuleTitle
source: Invalid entry in analyzer release file.
ja: アナライザー リリース ファイルに無効なエントリがあります。

# InvalidHeaderInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has a missing or invalid release header '{1}'.
ja: アナライザー リリース ファイル '{0}' のリリース ヘッダー '{1}' が存在しないか、無効です。

# InvalidUndetectedEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an entry with one or more 'Undetected' fields that need to be manually filled in '{1}'.
ja: アナライザー リリース ファイル '{0}' には、'{1}' に手動で入力する必要がある 1 つ以上の '未検出' フィールドを持つエントリがあります。

# MissingAttributeMessage
source: Missing '{0}' attribute.
de: Fehlendes {0}-Attribut.
es: Falta el atributo “{0}”.
fr: Attribut '{0}' manquant.
it: Manca l'attributo '{0}'.
ja: '{0}' 属性がありません。
ko: '{0}' 특성이 없습니다.
tr: '{0}' özniteliği eksik.
zh_hans: 缺少“{0}”特性。

# MissingDiagnosticAnalyzerAttributeTitle
source: Missing diagnostic analyzer attribute.
de: Fehlendes Attribut für Diagnoseanalysetool.
es: Falta el atributo del analizador de diagnóstico.
fr: Attribut d'analyseur de diagnostic manquant.
it: Manca l'attributo dell'analizzatore di diagnostica.
ja: 診断アナライザー属性がありません。
ko: 진단 분석기 특성이 없습니다.
tr: Tanılama çözümleyicisi özniteliği eksik.
zh_hans: 缺少诊断分析器特性。

# AddLanguageSupportToAnalyzerTitle
source: Recommend adding language support to diagnostic analyzer.
de: Empfehlung zum Hinzufügen von Sprachunterstützung zum Diagnoseanalysetool
es: Se recomienda agregar compatibilidad con lenguajes al analizador de diagnóstico.
fr: Recommandez l'ajout à l'analyseur de diagnostic d'une prise en charge des langages.
it: Consigliare l'aggiunta del supporto per la lingua all'analizzatore di diagnostica.
ja: 診断アナライザーに言語サポートを追加することをお勧めします。
ko: 진단 분석기에 언어 지원을 추가하는 것이 좋습니다.
tr: Tanılama çözümleyicisine dil desteği eklemeniz önerilir.
zh_hans: 建议向诊断分析器添加语言支持。

# MissingSymbolKindArgumentToRegisterActionMessage
source: Specify at least one SymbolKind of interest when registering a symbol analyzer action.
de: Geben Sie bei der Registrierung einer Symbolanalyseaktion mindestens einen relevanten SymbolKind-Wert an.
es: Especifique al menos un elemento SymbolKind de interés al registrar una acción del analizador de símbolos.
fr: Spécifiez au moins un SymbolKind d'intérêt au moment d'inscrire une action d'analyseur de symbole.
it: Specificare almeno un elemento SymbolKind di interesse durante la registrazione di un'azione dell'analizzatore di simboli.
ja: シンボル アナライザー アクションを登録する際に、関心のある SymbolKind を 1 つ以上指定してください。
ko: 기호 분석기 작업을 등록할 때 관심 있는 SymbolKind를 하나 이상 지정하세요.
tr: Bir sembol çözümleyici eylemi kaydedilirken en az bir ilgili SymbolKind belirtin.
zh_hans: 注册符号分析器操作时，至少指定一个感兴趣的 SymbolKind。

# MissingSyntaxKindArgumentToRegisterActionMessage
source: Specify at least one SyntaxKind of interest when registering a syntax node analyzer action.
de: Geben Sie bei der Registrierung einer Syntaxknotenanalyse-Aktion mindestens einen relevanten SymbolKind-Wert an.
es: Especifique al menos un elemento SyntaxKind de interés al registrar una acción del analizador de nodos de sintaxis.
fr: Spécifiez au moins un SyntaxKind d'intérêt au moment d'inscrire une action d'analyseur de nœud de syntaxe.
it: Specificare almeno un elemento SyntaxKind di interesse durante la registrazione di un'azione dell'analizzatore di nodi della sintassi.
ja: 構文ノード アナライザー アクションを登録する際に、関心のある SyntaxKind を 1 つ以上指定してください。
ko: 구문 노드 분석기 작업을 등록할 때 관심 있는 SyntaxKind를 하나 이상 지정하세요.
tr: Bir söz dizimi düğümü çözümleyici eylemi kaydedilirken en az bir ilgili SyntaxKind belirtin.
zh_hans: 注册语法节点分析器操作时，至少指定一个感兴趣的 SyntaxKind。

# MissingOperationKindArgumentToRegisterActionMessage
source: Specify at least one OperationKind of interest when registering an operation analyzer action.
de: Geben Sie bei der Registrierung einer Vorgangsanalyseaktion mindestens einen relevanten OperationKind-Wert an.
es: Especifique al menos un elemento OperationKind de interés al registrar una acción del analizador de operaciones.
fr: Spécifiez au moins un OperationKind d'intérêt au moment d'inscrire une action d'analyseur d'opération.
it: Specificare almeno un elemento OperationKind di interesse durante la registrazione di un'azione dell'analizzatore di operazioni.
ja: 操作アナライザー アクションを登録する際に、関心のある OperationKind を 1 つ以上指定してください。
ko: 작업 분석기 작업을 등록할 때 관심 있는 OperationKind를 하나 이상 지정하세요.
tr: Bir işlem çözümleyici eylemi kaydedilirken en az bir ilgili OperationKind belirtin.
zh_hans: 注册操作分析器操作时，至少指定一个感兴趣的 OperationKind。

# MissingKindArgumentToRegisterActionTitle
source: Missing kind argument when registering an analyzer action.
de: Fehlendes kind-Argument beim Registrieren einer Analyseaktion.
es: Falta un argumento de tipo al registrar una acción del analizador.
fr: Argument kind manquant au moment d'inscrire une action d'analyseur.
it: Durante la registrazione di un'azione dell'analizzatore manca un argomento di tipo.
ja: アナライザー アクションを登録するときに kind 引数がありません。
ko: 분석기 작업을 등록할 때 지정할 종류 인수가 없습니다.
tr: Bir çözümleyici eylemi kaydedilirken tür bağımsız değişkeni eksik.
zh_hans: 注册分析器操作时缺少 kind 参数。

# ProvideCustomTagsInDescriptorMessage
source: Consider providing a non-null 'customTags' to diagnostic descriptor constructor to enable metatada filtering of diagnostic descriptors.
ja: 診断記述子のメタデータ フィルターを有効にするため、null 以外の 'customTags' を診断記述子コンストラクターに提供することをご検討ください。

# ProvideCustomTagsInDescriptorTitle
source: Provide non-null 'customTags' value to diagnostic descriptor constructor.
ja: null 以外の 'customTags' 値を診断記述子コンストラクターに提供してください。

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleMessage
source: Rule '{0}' has duplicate entry between release '{1}' and release '{2}'.
ja: ルール '{0}' に、リリース '{1}' とリリース '{2}' の間で重複しているエントリがあります。

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleTitle
source: Remove duplicate entries for diagnostic ID between analyzer releases.
ja: アナライザー リリース間で診断 ID の重複しているエントリを削除します。

# RemoveDuplicateEntriesForAnalyzerReleaseRuleMessage
source: Rule '{0}' has more then one entry for release '{1}' in analyzer release file '{2}'.
ja: アナライザー リリース ファイル '{2}' で、ルール '{0}' にリリース '{1}' のエントリが複数あります。

# RemoveDuplicateEntriesForAnalyzerReleaseRuleTitle
source: Remove duplicate entries for diagnostic ID in the same analyzer release.
ja: 同じアナライザー リリースで診断 ID の重複しているエントリを削除します。

# RemoveShippedDeletedDiagnosticIdTitle
source: Shipped diagnostic IDs that are no longer reported should have an entry in the 'Removed Rules' table in unshipped file.
ja: 報告されなくなった出荷済みの診断 ID には、未出荷ファイルの '削除されたルール' テーブルにエントリが必要です。

# RemoveUnshippedDeletedDiagnosticIdMessage
source: Rule '{0}' is part of the next unshipped analyzer release, but is not a supported diagnostic for any analyzer.
ja: ルール '{0}' は、次回の未出荷のアナライザー リリースに含まれていますが、いずれかのアナライザーでサポートされている診断ではありません。

# RemoveUnshippedDeletedDiagnosticIdTitle
source: Do not add removed analyzer diagnostic IDs to unshipped analyzer release.
ja: 削除したアナライザー診断 ID を未出荷のアナライザー リリースに追加しないでください。

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdMessage
source: Rule '{0}' is marked as removed in the latest analyzer release, but is still being reported.
ja: ルール '{0}' は、最新のアナライザー リリースで削除済みとしてマークされていますが、まだ報告されています。

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdTitle
source: Diagnostic IDs marked as removed in analyzer release file should not be reported by analyzers.
ja: アナライザー リリース ファイルで削除済みとマークされている診断 ID は、アナライザーによって報告されないはずです。

# UnsupportedSymbolKindArgumentToRegisterActionMessage
source: SymbolKind '{0}' is not supported for symbol analyzer actions.
de: Der SymbolKind-Wert "{0}" wird für Symbolanalyseaktionen nicht unterstützt.
es: El argumento SymbolKind “{0}” no se admite para las acciones del analizador de símbolos.
fr: Le SymbolKind '{0}' n'est pas pris en charge pour les actions d'analyseur de symbole.
it: L'elemento SymbolKind '{0}' non è supportato per le azioni dell'analizzatore di simboli.
ja: SymbolKind '{0}' は、シンボル アナライザー アクションではサポートされていません。
ko: SymbolKind '{0}'이(가) 기호 분석기 작업에 대해 지원되지 않습니다.
tr: SymbolKind '{0}' sembol çözümleyici eylemleri için desteklenmiyor.
zh_hans: 符号分析器操作不支持 SymbolKind“{0}”。

# UnsupportedSymbolKindArgumentToRegisterActionTitle
source: Unsupported SymbolKind argument when registering a symbol analyzer action.
de: Nicht unterstütztes SymbolKind-Argument beim Registrieren einer Symbolanalyseaktion.
es: Argumento SymbolKind no admitido al registrar una acción del analizador de símbolos.
fr: Argument SymbolKind non pris en charge au moment d'inscrire une action d'analyseur de symbole.
it: L'argomento SymbolKind non è supportato durante la registrazione di un'azione dell'analizzatore di simboli.
ja: シンボル アナライザー アクションの登録時にサポートされていない SymbolKind 引数です。
ko: 기호 분석기 작업을 등록할 때 지원되지 않는 SymbolKind 인수입니다.
tr: Sembol çözümleyici eylemi kaydedilirken desteklenmeyen SymbolKind bağımsız değişkeni.
zh_hans: 注册符号分析器操作时不支持 SymbolKind 参数。

# InvalidReportDiagnosticMessage
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor '{0}'.
de: ReportDiagnostic wurde mit einem nicht unterstützten DiagnosticDescriptor "{0}" aufgerufen.
es: Se invocó a ReportDiagnostic con un elemento DiagnosticDescriptor “{0}” no admitido.
fr: ReportDiagnostic appelé avec un DiagnosticDescriptor '{0}' non pris en charge.
it: ReportDiagnostic è stato richiamato con un elemento DiagnosticDescriptor '{0}' non supportato.
ja: ReportDiagnostic が、サポートされていない DiagnosticDescriptor '{0}' で呼び出されました。
ko: 지원되지 않는 DiagnosticDescriptor '{0}'을(를) 사용하여 호출된 ReportDiagnostic입니다.
tr: ReportDiagnostic desteklenmeyen bir DiagnosticDescriptor '{0}' ile çağrıldı.
zh_hans: 使用不受支持的 DiagnosticDescriptor“{0}”调用了 ReportDiagnostic。

# InvalidReportDiagnosticTitle
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor.
de: ReportDiagnostic wurde mit einem nicht unterstützten DiagnosticDescriptor aufgerufen.
es: Se invocó a ReportDiagnostic con un elemento DiagnosticDescriptor no admitido.
fr: ReportDiagnostic appelé avec un DiagnosticDescriptor non pris en charge.
it: ReportDiagnostic è stato richiamato con un elemento DiagnosticDescriptor non supportato.
ja: ReportDiagnostic が、サポートされていない DiagnosticDescriptor で呼び出されました。
ko: 지원되지 않는 DiagnosticDescriptor를 사용하여 호출된 ReportDiagnostic입니다.
tr: ReportDiagnostic desteklenmeyen bir DiagnosticDescriptor ile çağrıldı.
zh_hans: 使用不受支持的 DiagnosticDescriptor 调用了 ReportDiagnostic。

# InvalidSyntaxKindTypeArgumentMessage
source: Type argument '{0}' for type parameter '{1}' of method '{2}' is not a SyntaxKind enum.
de: Das Typargument "{0}" für den Typparameter "{1}" der Methode "{2}" ist keine SyntaxKind-Enumeration.
es: El argumento de tipo “{0}” para el parámetro de tipo “{1}” del método “{2}” no es una enumeración SyntaxKind.
fr: L'argument de type '{0}' pour le paramètre de type '{1}' de la méthode '{2}' n'est pas un enum SyntaxKind.
it: L'argomento tipo '{0}' per il parametro di tipo '{1}' del metodo '{2}' non è un'enumerazione SyntaxKind.
ja: メソッド '{2}' の型パラメーター '{1}' の型引数 '{0}' が、SyntaxKind 列挙型ではありません。
ko: '{2}' 메서드의 '{1}' 형식 매개 변수에 대한 '{0}' 형식 인수는 SyntaxKind 열거형이 아닙니다.
tr: '{2}' yönteminin tür parametresi '{1}' için tür bağımsız değişkeni '{0}' bir SyntaxKind sabit listesi değil.
zh_hans: 对方法“{2}”的类型形参“{1}”而言，类型实参“{0}”不是 SyntaxKind 枚举。

# InvalidSyntaxKindTypeArgumentTitle
source: Invalid type argument for DiagnosticAnalyzer's Register method.
de: Ungültiges Typargument für die Register-Methode von DiagnosticAnalyzer.
es: Argumento de tipo no válido para el método Register de DiagnosticAnalyzer.
fr: Argument de type non valide pour la méthode Register de DiagnosticAnalyzer.
it: L'argomento tipo per il metodo Register di DiagnosticAnalyzer non è valido.
ja: DiagnosticAnalyzer の Register メソッドの型引数が無効です。
ko: DiagnosticAnalyzer의 Register 메서드에 대한 형식 인수가 잘못되었습니다.
tr: DiagnosticAnalyzer’ın Register yöntemi için tür bağımsız değişkeni geçersiz.
zh_hans: DiagnosticAnalyzer 的 Register 方法的类型参数无效。

# StartActionWithOnlyEndActionTitle
source: Start action has no registered non-end actions.
de: Für die Startaktion wurden keine Nicht-Endaktionen registriert.
es: La acción de inicio no tiene registrada ninguna acción no final.
fr: L'action de démarrage n'a aucune action inscrite qui n'est pas une action de fin.
it: Per l'azione di avvio non esistono azioni non di fine registrate.
ja: 開始アクションには、終了以外の登録済みアクションがありません。
ko: 시작 작업에 등록된 비종료 작업이 없습니다.
tr: Başlangıç eyleminin kayıtlı bitiş eylemi olmayan eylemi yok.
zh_hans: 启动操作未注册有任何非结束操作。

# StartActionWithNoRegisteredActionsTitle
source: Start action has no registered actions.
de: Für die Startaktion wurden keine Aktionen registriert.
es: La acción de inicio no tiene ninguna acción registrada.
fr: L'action de démarrage n'a aucune action inscrite.
it: Per l'azione di avvio non esistono azioni registrate.
ja: 開始アクションに登録済みアクションがありません。
ko: 시작 작업에 등록된 작업이 없습니다.
tr: Başlangıç eyleminin kayıtlı eylemi yok.
zh_hans: 启动操作未注册有任何操作。

# StatefulAnalyzerRegisterActionsDescription
source: An analyzer start action enables performing stateful analysis over a given code unit, such as a code block, compilation, etc. Careful design is necessary to achieve efficient analyzer execution without memory leaks. Use the following guidelines for writing such analyzers: 1. Define a new scope for the registered start action, possibly with a private nested type for analyzing each code unit. 2. If required, define and initialize state in the start action. 3. Register at least one non-end action that refers to this state in the start action. If no such action is necessary, consider replacing the start action with a non-start action. For example, a CodeBlockStartAction with no registered actions or only a registered CodeBlockEndAction should be replaced with a CodeBlockAction. 4. If required, register an end action to report diagnostics based on the final state.
de: Eine Startaktion für das Analysetool ermöglicht die Durchführung einer zustandsbehafteten Analyse über eine bestimmte Codeeinheit wie einen Codeblock, eine Kompilierung etc. Ein sorgfältiges Design ist erforderlich, um eine effiziente Ausführung des Analysetools ohne Arbeitsspeicherverluste zu erzielen. Beachten Sie beim Schreiben solcher Analysen die folgenden Richtlinien: 1. Definieren Sie einen neuen Geltungsbereich für die registrierte Startaktion, möglicherweise mit einem privaten geschachtelten Typ für die Analyse der einzelnen Codeeinheiten. 2. Definieren und initialisieren Sie bei Bedarf den Zustand in der Startaktion. 3. Registrieren Sie mindestens eine Nicht-Endaktion, die auf diesen Zustand in der Startaktion verweist. Falls keine solche Aktion erforderlich ist, ziehen Sie in Betracht, die Startaktion durch eine Nicht-Startaktion zu ersetzen. Beispielsweise sollte eine CodeBlockStartAction ohne registrierte Aktionen oder mit nur einer registrierten CodeBlockEndAction durch eine CodeBlockAction ersetzt werden. 4. Registrieren Sie bei Bedarf eine Endaktion, um die Diagnose basierend auf dem Endzustand zu melden.
es: Una acción de inicio del analizador permite realizar un análisis con estado de una unidad de código dada, como un bloque de código, una compilación, etc. Realice un diseño minucioso para lograr una ejecución eficiente del analizador sin fugas de memoria. Siga las instrucciones a continuación para escribir este tipo de analizadores: 1. Defina un nuevo ámbito para la acción de inicio registrada, posiblemente con un tipo anidado privado para analizar cada unidad de código. 2. Si se requiere, defina e inicialice el estado en la acción de inicio. 3. Registre al menos una acción no final que haga referencia a este estado en la acción de inicio. Si no es necesaria una acción de este tipo, considere reemplazar la acción de inicio por otra que no lo sea. Por ejemplo, una acción CodeBlockStartAction sin acciones registradas o solo una acción CodeBlockEndAction registrada deberían reemplazarse por una acción CodeBlockAction. 4. Si se requiere, registre una acción de final para notificar los diagnósticos en función del estado final.
fr: Une action de démarrage de l'analyseur permet d'effectuer une analyse avec état sur une unité de code donnée, par exemple un bloc de code, une compilation, etc. Vous devez effectuer un design soigné pour obtenir une exécution efficace de l'analyseur, sans fuites de mémoire. Utilisez les recommandations suivantes pour écrire des analyseurs de ce type : 1. Définissez une nouvelle portée pour l'action de démarrage inscrite, éventuellement avec un type imbriqué privé pour analyser chaque unité de code. 2. Si nécessaire, définissez et initialisez l'état dans l'action de démarrage. 3. Inscrivez au moins une action qui n'est pas une action de fin et qui fait référence à cet état dans l'action de démarrage. Si aucune action de ce type n'est nécessaire, remplacez l'action de démarrage par une action qui n'est pas une action de fin. Par exemple, un CodeBlockStartAction sans action inscrite ou uniquement un CodeBlockEndAction inscrit doit être remplacé par CodeBlockAction. 4. Si nécessaire, inscrivez une action de fin de pour créer un rapport de diagnostics en fonction de l'état final.
it: Un'azione di avvio dell'analizzatore consente di eseguire un'analisi con stato su una data unità di codice, ad esempio un blocco di codice, una compilazione e così via. Per rendere più efficiente l'esecuzione degli analizzatori ed evitare perdite di memoria, è necessaria un'attenta progettazione. Per scrivere tali analizzatori, attenersi alle linea guida seguenti: 1. Definire un nuovo ambito per l'azione di avvio registrata, possibilmente con un tipo nidificato privato per l'analisi delle singole unità di codice. 2. Se necessario, definire e inizializzare lo stato nell'azione di avvio. 3. Registrare almeno un'azione non di fine che fa riferimento a questo stato nell'azione di avvio. Se una tale azione non è necessaria, provare a sostituire l'azione di avvio con un'azione non di avvio. Ad esempio un elemento CodeBlockStartAction senza azioni registrate o un solo elemento CodeBlockEndAction registrato deve essere sostituito da un elemento CodeBlockAction. 4. Se necessario, registrare un'azione di fine per restituire i dati di diagnostica in base allo stato finale.
ja: アナライザーの開始アクションにより、特定のコード単位 (コード ブロック、コンパイルなど) に対するステートフル分析の実行が可能になります。メモリ リークを発生させずに効率的にアナライザーを実行できるようにするには、慎重に設計する必要があります。そのようなアナライザーを記述する場合は、以下のガイドラインに従ってください。 1.登録した開始アクション用に新しいスコープを定義します。できれば、各コード単位を分析するために、プライベートな入れ子にされた型を使用します。 2.必要に応じて、開始アクションで状態を定義し、初期化します。 3.開始アクションのこの状態を参照する終了以外のアクションを 1 つ以上登録します。このようなアクションが不要な場合は、開始アクションを開始以外のアクションに置き換えることを検討します。たとえば、アクションが登録されていない CodeBlockStartAction や登録された単独の CodeBlockEndAction は、CodeBlockAction に置き換える必要があります。 4.必要に応じて、最終状態に基づく診断を報告するために、終了アクションを登録します。
ko: 분석기 시작 작업을 통해 코드 블록, 컴파일 등의 특정 코드 단위에서 상태 저장 분석을 수행할 수 있습니다. 분석기를 메모리 손실 없이 효율적으로 실행하려면 신중한 설계가 필요합니다. 이러한 분석기를 쓰려면 다음 지침을 사용하세요. 1. 등록된 시작 작업에 대해 각 코드 단위를 분석하기 위한 private 중첩 형식이 있는 새 범위를 정의합니다. 2. 필요한 경우 시작 작업에서 상태를 정의하고 초기화합니다. 3. 시작 작업에서 이 상태를 참조하는 비종료 작업을 하나 이상 등록합니다. 이러한 작업이 필요하지 않은 경우 시작 작업을 비종료 작업으로 바꾸세요. 예를 들어 등록된 작업이 없는 CodeBlockStartAction 또는 등록된 CodeBlockEndAction만 CodeBlockAction으로 바꿀 수 있습니다. 4. 필요한 경우 종료 작업을 등록하여 최종 상태를 기준으로 진단을 보고합니다.
tr: Bir çözümleyici başlatma eylemi bir kod bloğu, derleme vb. bir belirli kod birimi üzerinde durum bilgisi olan çözümleme gerçekleştirmeye olanak sağlar. Bellek sızıntısı olmadan verimli çözümleyici yürütmesi sağlamak için dikkatli tasarım gereklidir. Bu tür çözümleyiciler yazmak için aşağıdaki kılavuzu kullanın: 1. Olası olarak her kod birimini çözümlemek için özel bir iç içe geçmiş tür ile kayıtlı başlatma eylemi için yeni bir kapsam tanımlayın. 2. Gerekirse, durumu başlangıç eyleminde tanımlayın ve başlatın. 3. Başlangıç eyleminde bu duruma başvuran en az bir bitiş eylemi olmayan eylem kaydedin. Böyle bir eyleme gerek yoksa, başlangıç eylemini başlangıç eylemi olmayan bir eylemle değiştirmeyi düşünün. Örneğin, kayıtlı eylemi olmayan veya yalnızca kayıtlı bir CodeBlockEndAction’ı olan bir CodeBlockStartAction, bir CodeBlockAction ile değiştirilmelidir. 4. Gerekirse, son durumu temel alan tanılamaları raporlamak için bir bitiş eylemi kaydedin.
zh_hans: 分析器启动操作可以对给定的代码单元(如代码块、编译等)执行有状态分析。细致的设计是实现分析器高效执行和保证内存不泄露的必要条件。使用以下准则编写此类分析器: 1.为已注册的启动操作定义新的作用域，可能需要一个私有嵌套类型用于分析每个代码单元。 2.必要时，请在启动操作中定义和初始化状态。 3.至少在启动操作中注册一个引用此状态的非结束操作。如果不需要此类操作，请考虑将启动操作替换为非启动操作。例如，未注册有操作或仅注册了一个 CodeBlockEndAction 的 CodeBlockStartAction 应替换为 CodeBlockAction。 4.必要时，请注册一个结束操作，根据最终状态对诊断进行报告。

# UpdateDiagnosticIdInAnalyzerReleaseTitle
source: Ensure up-to-date entry for analyzer diagnostic IDs are added to analyzer release.
ja: アナライザー診断 ID の最新のエントリがアナライザー リリースに追加されていることを確認してください。
