Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullForFieldMessage
source: A call to 'SemanticModel.GetDeclaredSymbol({0})' will always return 'null'
cs: Volání SemanticModel.GetDeclaredSymbol ({0}) vždy vrátí null.
pt_br: Uma chamada para “SemanticModel.GetDeclaredSymbol({0})” sempre retornará “null”

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullMessage
source: A call to 'SemanticModel.GetDeclaredSymbol({0})' will always return 'null'
cs: Volání SemanticModel.GetDeclaredSymbol ({0}) vždy vrátí null.
pt_br: Uma chamada para “SemanticModel.GetDeclaredSymbol({0})” sempre retornará “null”

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullTitle
source: This call to 'SemanticModel.GetDeclaredSymbol()' will always return 'null'
cs: Toto volání SemanticModel.GetDeclaredSymbol vždy vrátí null.
pt_br: Essa chamada para “SemanticModel.GetDeclaredSymbol()” sempre retornará “null”

# SymbolIsBannedInAnalyzersDescription
source: The symbol has been marked as banned for use in analyzers, and an alternate should be used instead.
cs: Symbol byl označen jako zakázaný pro použití v analyzátorech a místo toho by se měla použít náhrada.
pt_br: O símbolo foi marcado como proibido para uso em analisadores. É necessário usar um símbolo alternativo.

# SymbolIsBannedInAnalyzersMessage
source: The symbol '{0}' is banned for use by analyzers{1}
cs: Symbol {0} je zakázaný pro použití analyzátory {1}
pt_br: O símbolo '{0}' está proibido para uso pelos analisadores{1}

# SymbolIsBannedInAnalyzersTitle
source: Do not use APIs banned for analyzers
cs: Nepoužívat rozhraní API zakázaná pro analyzátory
pt_br: Não usar APIs proibidas para analisadores

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdDescription
source: Diagnostic IDs marked as removed in analyzer release file should not be reported by analyzers.
cs: ID diagnostiky označená jako odebraná v souboru vydané verze analyzátoru by analyzátory neměly ohlašovat
ja: アナライザー リリース ファイルで削除済みとマークされている診断 ID は、アナライザーによって報告されないはずです。
pt_br: As IDs de diagnóstico marcadas como removidas no arquivo de versão do analisador não devem ser relatadas pelos analisadores.

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdMessage
source: Rule '{0}' is marked as removed in the latest analyzer release, but is still being reported
cs: Pravidlo {0} se v nejnovější vydané verzi analyzátoru označilo jako odebrané, ale stále se ohlašuje.
pt_br: A regra '{0}' está marcada como removida na última versão do analisador, mas ainda está sendo relatada

# UnexpectedAnalyzerDiagnosticForRemovedDiagnosticIdTitle
source: Diagnostic IDs marked as removed in analyzer release file should not be reported by analyzers
cs: ID diagnostiky označená jako odebraná v souboru vydané verze analyzátoru by analyzátory neměly ohlašovat
pt_br: As IDs de diagnóstico marcadas como removidas no arquivo de versão do analisador não devem ser relatadas pelos analisadores

# UnsupportedSymbolKindArgumentToRegisterActionMessage
source: SymbolKind '{0}' is not supported for symbol analyzer actions
cs: U akcí analyzátoru symbolů se SymbolKind {0} nepodporuje.
pt_br: Não há suporte para SymbolKind '{0}' para ações de analisador de símbolo

# UnsupportedSymbolKindArgumentToRegisterActionTitle
source: Unsupported SymbolKind argument when registering a symbol analyzer action
cs: Při registraci akce analyzátoru symbolů byl zadán nepodporovaný argument SymbolKind
pt_br: Argumento SymbolKind sem suporte ao registrar uma ação de analisador de símbolo

# InvalidReportDiagnosticMessage
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor '{0}'
cs: Funkce ReportDiagnostic vyvolala nepodporovaný DiagnosticDescriptor {0}.
pt_br: ReportDiagnostic invocado com um DiagnosticDescriptor '{0}' sem suporte

# InvalidReportDiagnosticTitle
source: ReportDiagnostic invoked with an unsupported DiagnosticDescriptor
cs: Funkce ReportDiagnostic vyvolala nepodporovaný DiagnosticDescriptor
pt_br: ReportDiagnostic invocado com um DiagnosticDescriptor sem suporte

# InvalidReportDiagnosticDescription
source: ReportDiagnostic should only be invoked with supported DiagnosticDescriptors that are returned from DiagnosticAnalyzer.SupportedDiagnostics property. Otherwise, the reported diagnostic will be filtered out by the analysis engine.
cs: Funkce ReportDiagnostic by se měla volat jenom s podporovanými popisovači diagnostiky, které se vrací z vlastnosti DiagnosticAnalyzer.SupportedDiagnostics. V opačném případě modul analýzy reportovanou diagnostiku vyfiltruje.
de: ReportDiagnostic darf nur mit unterstützten DiagnosticDescriptors aufgerufen werden, die von der Eigenschaft "DiagnosticAnalyzer.SupportedDiagnostics" zurückgegeben werden. Andernfalls wird die gemeldete Diagnose durch die Analyse-Engine herausgefiltert.
es: ReportDiagnostic solo debe invocarse con elementos DiagnosticDescriptor admitidos que devuelve la propiedad DiagnosticAnalyzer.SupportedDiagnostics. De lo contrario, el motor de análisis descartará el diagnóstico notificado.
fr: ReportDiagnostic doit être appelé uniquement avec les DiagnosticDescriptors retournés à partir de la propriété DiagnosticAnalyzer.SupportedDiagnostics. Sinon, le diagnostic rapporté est filtré par le moteur d'analyse.
it: ReportDiagnostic deve essere richiamato solo con elementi DiagnosticDescriptor supportati restituiti dalla proprietà DiagnosticAnalyzer.SupportedDiagnostics. In caso contrario, la diagnostica restituita verrà filtrata dal motore di analisi.
ja: ReportDiagnostic の呼び出しには、DiagnosticAnalyzer.SupportedDiagnostics プロパティから返される、サポートされている DiagnosticDescriptor のみを使用する必要があります。そうしないと、報告された診断は分析エンジンによってフィルターで除外されます。
ko: ReportDiagnostic은 DiagnosticAnalyzer.SupportedDiagnostics 속성에서 반환된 지원되는 DiagnosticDescriptors를 통해서만 호출되어야 합니다. 그러지 않으면 보고된 진단이 분석 엔진에 의해 필터링됩니다.
pt_br: ReportDiagnostic só deve ser invocado com DiagnosticDescriptors com suporte retornados da propriedade DiagnosticAnalyzer.SupportedDiagnostics. Caso contrário, o diagnóstico reportado será filtrado pelo mecanismo de análise.
tr: ReportDiagnostic yalnızca DiagnosticAnalyzer.SupportedDiagnostics özelliğinden döndürülen desteklenen DiagnosticDescriptors ile çağrılmalıdır. Aksi takdirde, raporlanan tanılama çözümleme altyapısı tarafından filtrelenir.
zh_hans: 仅应使用从 DiagnosticAnalyzer.SupportedDiagnostics 属性返回的受支持的 DiagnosticDescriptors 调用 ReportDiagnostic。否则，分析引擎将过滤掉所报告的诊断。

# InvalidSyntaxKindTypeArgumentMessage
source: Type argument '{0}' for type parameter '{1}' of method '{2}' is not a SyntaxKind enum
cs: Argument typu {0} pro parametr typu {1} metody{2} není výčtem SyntaxKind.
pt_br: O argumento de tipo '{0}' para o parâmetro de tipo '{1}' do método '{2}' não é uma enumeração SyntaxKind

# InvalidSyntaxKindTypeArgumentTitle
source: Invalid type argument for DiagnosticAnalyzer's Register method
cs: Neplatný argument typu pro metodu registrace u diagnostického analyzátoru
pt_br: Argumento de tipo inválido para o método Register de DiagnosticAnalyzer

# InvalidSyntaxKindTypeArgumentDescription
source: DiagnosticAnalyzer's language-specific Register methods, such as RegisterSyntaxNodeAction, RegisterCodeBlockStartAction and RegisterCodeBlockEndAction, expect a language-specific 'SyntaxKind' type argument for it's '{0}' type parameter. Otherwise, the registered analyzer action can never be invoked during analysis.
cs: Metody registrace u diagnostického analyzátoru pro konkrétní jazyky, například RegisterSyntaxNodeAction, RegisterCodeBlockStartAction a RegisterCodeBlockEndAction, očekávají pro svůj parametr typu {0} argument typu SyntaxKind pro konkrétní jazyk. V opačném případě se registrovaná akce analyzátoru nikdy při analýze nevyvolá.
de: Die sprachspezifischen Register-Methoden von DiagnosticAnalyzer, beispielsweise "RegisterSyntaxNodeAction", "RegisterCodeBlockStartAction" und "RegisterCodeBlockEndAction", erwarten ein sprachspezifisches SyntaxKind-Typargument für den zugehörigen Typparameter "{0}". Andernfalls kann die registrierte Analyseaktion während der Analyse nicht aufgerufen werden.
es: Los métodos Register específicos de lenguaje de DiagnosticAnalyzer, como RegisterSyntaxNodeAction, RegisterCodeBlockStartAction y RegisterCodeBlockEndAction, esperan un argumento de tipo “SyntaxKind” específico de lenguaje para el parámetro de tipo “{0}”. De lo contrario, la acción del analizador registrada no se puede invocar nunca durante el análisis.
fr: Les méthodes Register spécifiques au langage de DiagnosticAnalyzer, par exemple RegisterSyntaxNodeAction, RegisterCodeBlockStartAction et RegisterCodeBlockEndAction, attendent un argument de type 'SyntaxKind' spécifique au langage pour son paramètre de type '{0}'. Sinon, l'action d'analyseur inscrite ne peut jamais être appelée durant l'analyse.
it: Con i metodi Register specifici della lingua di DiagnosticAnalyzer, come RegisterSyntaxNodeAction, RegisterCodeBlockStartAction e RegisterCodeBlockEndAction, è previsto un argomento tipo 'SyntaxKind' specifico della lingua per il parametro di tipo '{0}'. In caso contrario, l'azione registrata dell'analizzatore non può essere mai richiamata durante l'analisi.
ja: DiagnosticAnalyzer の言語固有の Register メソッド (RegisterSyntaxNodeAction、RegisterCodeBlockStartAction、RegisterCodeBlockEndAction など) には、'{0}' 型パラメーターとして言語固有の 'SyntaxKind' 型引数が必要です。そうでない場合、登録されたアナライザー アクションを分析中に呼び出すことはできません。
ko: RegisterSyntaxNodeAction, RegisterCodeBlockStartAction 및 RegisterCodeBlockEndAction 등의 DiagnosticAnalyzer의 언어 특정 Register 메서드에는 '{0}' 형식 매개 변수에 대한 언어 특정 'SyntaxKind' 형식 인수를 사용해야 합니다. 그러지 않으면 등록된 분석기 작업이 분석하는 동안 호출되지 않습니다.
pt_br: Os métodos Register específicos a um idioma do DiagnosticAnalyzer, como RegisterSyntaxNodeAction, RegisterCodeBlockStartAction e RegisterCodeBlockEndAction esperam um argumento de tipo 'SyntaxKind' específico a um idioma para o parâmetro de tipo '{0}' dele. Caso contrário, a ação do analisador registrada nunca pode ser invocada durante a análise.
tr: DiagnosticAnalyzer’ın dile özgü Register yöntemleri (örneğin RegisterSyntaxNodeAction, RegisterCodeBlockStartAction ve RegisterCodeBlockEndAction) '{0}' tür parametresi için dile özgü bir 'SyntaxKind' tür bağımsız değişkeni bekliyor. Aksi takdirde, kayıtlı çözümleyici eylemi çözümleme sırasında hiçbir zaman çağrılamaz.
zh_hans: DiagnosticAnalyzer 的语言特定的 Register 方法，例如 RegisterSyntaxNodeAction、RegisterCodeBlockStartAction 和 RegisterCodeBlockEndAction，需要一个语言特定的 "SyntaxKind" 类型实参用于“{0}”类型形参。否则，分析过程中将不会调用已注册的分析器操作。

# StartActionWithOnlyEndActionTitle
source: Start action has no registered non-end actions
cs: Spouštěcí akce nemá žádné registrované neukončovací akce
pt_br: A ação inicial não tem ações não finais registradas

# StartActionWithNoRegisteredActionsMessage
source: '{0}' does not register any analyzer actions. Consider moving actions registered in '{1}' that depend on this start action to '{0}'.
cs: {0} neregistruje žádné akce analyzátoru. Zvažte přesunutí akcí registrovaných v {1}, které závisí na této spouštěcí akci, do {0}.
de: "{0}" registriert keine Analyseaktionen. Ziehen Sie in Betracht, in "{1}" registrierte Aktionen, die von dieser Startaktion abhängen, nach "{0}" zu verschieben.
es: “{0}” no registra ninguna acción del analizador. Considere mover las acciones registradas en “{1}” dependientes de esta acción de inicio a “{0}”.
fr: '{0}' n'inscrit aucune action d'analyseur. Déplacez les actions inscrites dans '{1}' et qui dépendent de cette action de démarrage vers '{0}'.
it: '{0}' non registra alcuna azione dell'analizzatore. Provare a spostare in '{0}' le azioni registrate in '{1}' che dipendono da questa azione di avvio.
ja: '{0}' はアナライザー アクションを登録していません。この開始アクションに依存する、'{1}' に登録されたアクションを '{0}' に移動することを検討してください。
ko: '{0}'은(는) 분석기 작업을 등록하지 않습니다. 이 시작 작업에 종속된 '{1}'에 등록된 작업을 '{0}'(으)로 이동하세요.
pt_br: '{0}' não registra nenhuma ação do analisador. Considere mover ações registradas em '{1}' que dependem desta ação inicial para '{0}'.
tr: '{0}' herhangi bir çözümleyici eylemini kaydetmez. Bu başlangıç eylemine bağımlı olan '{1}' içinde kayıtlı eylemleri '{0}' içine taşımayı düşünün.
zh_hans: “{0}”没有注册任何分析器操作。请考虑将“{1}”中注册的依赖于此启动操作的操作移动到“{0}”。

# StartActionWithNoRegisteredActionsTitle
source: Start action has no registered actions
cs: Spouštěcí akce nemá žádné registrované akce
pt_br: A ação inicial não tem ações registradas

# StartActionWithOnlyEndActionMessage
source: '{0}' does not register any analyzer actions, except for a '{1}'. Consider replacing this start/end action pair with a '{2}' or moving actions registered in '{3}' that depend on this start action to '{0}'.
cs: {0} neregistruje žádné akce analyzátoru s výjimkou {1}. Zvažte nahrazení této dvojice spouštěcí a ukončovací akce akcí {2} nebo přesunutí akcí zaregistrovaných v {3}, které závisí na této spouštěcí akci, do {0}.
de: "{0}" registriert keine Analyseaktionen mit Ausnahme von "{1}". Ziehen Sie in Betracht, dieses Paar aus Start-/Endaktion durch "{2}" zu ersetzen oder die in "{3}" registrierten Aktionen, die von dieser Startaktion abhängen, nach "{0}" zu verschieben.
es: “{0}” no registra ninguna acción del analizador, excepto “{1}”. Considere reemplazar este par de acciones de inicio/final por un objeto “{2}” o mover las acciones registradas en “{3}” que dependen de esta acción de inicio a “{0}”.
fr: '{0}' n'inscrit aucune action d'analyseur, à l'exception de '{1}'. Remplacez cette paire d'actions de début/fin par '{2}', ou déplacez les actions inscrites dans '{3}' et qui dépendent de cette action de démarrage vers '{0}'.
it: '{0}' non registra alcuna azione dell'analizzatore, ad eccezione di '{1}'. Provare a sostituire questa coppia di azioni di avvio/fine con un elemento '{2}' o a spostare in '{0}' le azioni registrate in '{3}' che dipendono da questa azione di avvio.
ja: '{0}' は、'{1}' 以外のアナライザー アクションを登録していません。この開始/終了アクションのペアを '{2}' に置き換えるか、この開始アクションに依存する、'{3}' に登録されたアクションを '{0}' に移動することを検討してください。
ko: '{0}'은(는) '{1}'을(를) 제외하고 분석기 작업을 등록하지 않았습니다. 이 시작/종료 작업 쌍을 '{2}'(으)로 바꾸거나 이 시작 작업에 종속된 '{3}'에 등록된 작업을 '{0}'(으)로 이동하세요.
pt_br: '{0}' não registra nenhuma ação do analisador, exceto por um '{1}'. Considere substituir este par de ações iniciais/finais com um '{2}' ou mover as ações registradas em '{3}' que dependem dessa ação inicial para '{0}'.
tr: '{0}' bir '{1}' hariç herhangi bir çözümleyici eylemini kaydetmez. Bu başlangıç/bitiş eylem çiftini '{2}' ile eşlemeyi veya bu başlangıç eylemine bağımlı olan '{3}' içinde kayıtlı eylemleri '{0}' içine taşımayı düşünün.
zh_hans: “{0}”没有注册除“{1}”以外的任何分析器操作。请考虑将此启动/结束操作对替换为“{2}”，或将“{3}”中注册的依赖于此启动操作的操作移动到“{0}”。

# StatefulAnalyzerRegisterActionsDescription
source: An analyzer start action enables performing stateful analysis over a given code unit, such as a code block, compilation, etc. Careful design is necessary to achieve efficient analyzer execution without memory leaks. Use the following guidelines for writing such analyzers: 1. Define a new scope for the registered start action, possibly with a private nested type for analyzing each code unit. 2. If required, define and initialize state in the start action. 3. Register at least one non-end action that refers to this state in the start action. If no such action is necessary, consider replacing the start action with a non-start action. For example, a CodeBlockStartAction with no registered actions or only a registered CodeBlockEndAction should be replaced with a CodeBlockAction. 4. If required, register an end action to report diagnostics based on the final state.
cs: Spouštěcí akce analyzátoru umožňuje provádět stavové analýzy u dané jednotky kódu, například u bloku kódu, kompilace atd. Uvážlivý návrh je nezbytný, aby bylo možné zajistit efektivní funkci analyzátoru a nedocházelo k nevracení paměti. Při psaní takových analyzátorů se řiďte následujícími pokyny: 1. Pro registrovanou spouštěcí akci definujte nový obor, nejlépe s privátním vnořeným typem pro analýzu jednotlivých jednotek kódu. 2. Pokud je to potřeba, definujte a inicializujte stav ve spouštěcí akci. 3. Zaregistrujte alespoň jednu neukončovací akci, která odkazuje na tento stav ve spouštěcí akci. Pokud žádnou takovou akci nepotřebujete, zvažte nahrazení spouštěcí akce neukončovací akcí. Například akci CodeBlockStartAction bez registrovaných akcí nebo s pouze zaregistrovanou akcí CodeBlockEndAction byste měli nahradit akcí CodeBlockAction. 4. Pokud je to potřeba, zaregistrujte ukončovací akci, která bude reportovat diagnostiku na základě koncového stavu.
pt_br: Uma ação inicial do analisador permite realizar análises com estado em uma determinada unidade de código, como um bloco de código, compilação etc. É necessário projetar cuidadosamente para realizar a execução eficiente do analisador sem perdas de memória. Use as diretrizes a seguir para gravar esses analisadores: 1. Defina um novo escopo para a ação inicial registrada, possivelmente com um tipo aninhado privado para analisar cada unidade de código. 2. Se necessário, defina e inicialize o estado na ação inicial. 3. Registre pelo menos uma ação não final que referencia esse estado na ação inicial. Se nenhuma ação assim for necessária, considere substituir a ação inicial por uma ação não inicial. Por exemplo, um CodeBlockStartAction com ações não registradas ou apenas um CodeBlockEndAction registrado deve ser substituído por um CodeBlockAction. 4. Se necessário, registre uma ação final para relatar o diagnóstico com base no estado final.

# UpdateDiagnosticIdInAnalyzerReleaseDescription
source: Ensure up-to-date entry for analyzer diagnostic IDs are added to analyzer release.
cs: Ujistit se, že se do vydané verze analyzátoru přidávají aktuální položky pro ID diagnostiky analyzátoru
ja: アナライザー診断 ID の最新のエントリがアナライザー リリースに追加されていることを確認してください。
pt_br: Verifique se a entrada atualizada das IDs de diagnóstico do analisador foi adicionada à versão do analisador.

# UpdateDiagnosticIdInAnalyzerReleaseMessage
source: Rule '{0}' has a changed 'Category' or 'Severity' from the last release. Either revert the update(s) in source or add a new up-to-date entry to unshipped release file.
cs: Pravidlo {0} má od poslední vydané verze změněné hodnoty Category nebo Severity. Buď vraťte aktualizace ve zdroji, nebo přidejte novou aktuální položku do nevydaného souboru verze.
ja: ルール '{0}' の 'カテゴリ' または '重要度' が前回のリリースから変更されています。ソースの更新を元に戻すか、未出荷のリリース ファイルに新しい最新のエントリを追加してください。
pt_br: A regra '{0}' tem uma 'Categoria' ou uma 'Severidade' alterada em relação à última versão. Reverta as atualizações na origem ou adicione uma nova entrada atualizada ao arquivo de versão não enviado.

# UpdateDiagnosticIdInAnalyzerReleaseTitle
source: Ensure up-to-date entry for analyzer diagnostic IDs are added to analyzer release
cs: Ujistit se, že se do vydané verze analyzátoru přidávají aktuální položky pro ID diagnostiky analyzátoru
pt_br: Verifique se a entrada atualizada das IDs de diagnóstico do analisador foi adicionada à versão do analisador

# UpdateEntryForDiagnosticIdInAnalyzerReleaseCodeFixTitle
source: Update rule entry in unshipped release file
cs: Aktualizovat položku pravidla v nevydaném souboru verze
ja: 未出荷リリース ファイルのルール エントリの更新
pt_br: Atualizar a entrada de regra no arquivo de versão não enviado

# UseLocalizableStringsInDescriptorMessage
source: Consider providing localizable arguments of type '{0}' to diagnostic descriptor constructor to ensure the descriptor is localizable
cs: Zvažte, že byste konstruktoru diagnostického popisovače poskytovali lokalizovatelné argumenty typu {0}, abyste zajistili možnost lokalizace popisovače.
pt_br: Considere fornecer argumentos localizáveis do tipo '{0}' para o construtor de descritor de diagnóstico para garantir que o descritor seja localizável

# UseLocalizableStringsInDescriptorTitle
source: Provide localizable arguments to diagnostic descriptor constructor
cs: Poskytněte konstruktoru diagnostického popisovače lokalizovatelné argumenty
pt_br: Forneça argumentos localizáveis para o construtor de descritor de diagnóstico
