Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# OverrideGetFixAllProviderMessage
source: '{0}' registers one or more code fixes, but does not override the method 'CodeFixProvider.GetFixAllProvider'. Override this method and provide a non-null FixAllProvider for FixAll support, potentially 'WellKnownFixAllProviders.BatchFixer', or 'null' to explicitly disable FixAll support.
cs: {0} registruje jednu nebo více oprav kódu, ale nepřepisuje metodu CodeFixProvider.GetFixAllProvider. Přepište tuto metodu a poskytněte nenulového zprostředkovatele FixAllProvider, který bude podporovat FixAll (například WellKnownFixAllProviders.BatchFixer), nebo zadejte hodnotu null, která podporu pro FixAll explicitně zakáže.
de: "{0}" registriert mindestens eine Codefehlerbehebung, aber überschreibt nicht die Methode "CodeFixProvider.GetFixAllProvider". Überschreiben Sie diese Methode, und stellen Sie einen FixAllProvider ungleich NULL für FixAll-Unterstützung bereit, etwa "WellKnownFixAllProviders.BatchFixer" oder "null", um die FixAll-Unterstützung explizit zu deaktivieren.
fr: '{0}' inscrit un ou plusieurs correctifs de code, mais ne substitue pas la méthode 'CodeFixProvider.GetFixAllProvider'. Substituez cette méthode et fournissez un FixAllProvider non-null pour la prise en charge de FixAll, éventuellement 'WellKnownFixAllProviders.BatchFixer', ou 'null' pour désactiver explicitement la prise en charge de FixAll.
ja: '{0}' は 1 つ以上のコード修正プログラムを登録しますが、メソッド 'CodeFixProvider.GetFixAllProvider' をオーバーライドしません。このメソッドをオーバーライドして、NULL 以外の FixAllProvider ('WellKnownFixAllProviders.BatchFixer' など) を FixAll サポートのために提供するか、'null' を指定して FixAll サポートを明示的に無効にしてください。
ko: '{0}'은(는) 하나 이상의 코드 수정 사항을 등록하지만 'CodeFixProvider.GetFixAllProvider' 메서드를 재정의하지 않습니다. 이 메서드를 재정의하고 FixAll 지원에 대해 null이 아닌 FixAllProvider(잠재적으로 'WellKnownFixAllProviders.BatchFixer')를 제공하세요. 'null'은 FixAll 지원을 명시적으로 사용하지 않습니다.
pt_br: '{0}' registra uma ou mais correções de código, mas não substitui o método 'CodeFixProvider.GetFixAllProvider'. Substitua este método e forneça um FixAllProvider não nulo para suporte a FixAll, potencialmente 'WellKnownFixAllProviders.BatchFixer' ou 'null' para desabilitar explicitamente o suporte a FixAll.
tr: '{0}' bir veya daha fazla kod düzeltmesi kaydediyor ancak 'CodeFixProvider.GetFixAllProvider' metodunu geçersiz kılmıyor. Bu metodu geçersiz kılın ve FixAll desteği için 'WellKnownFixAllProviders.BatchFixer' gibi null olmayan bir FixAllProvider sağlayın veya FixAll desteğini açıkça devre dışı bırakmak için 'null' sağlayın.
zh_hans: “{0}”注册了一个或多个代码修补程序，但是未重写方法 "CodeFixProvider.GetFixAllProvider"。请重写该方法并向 FixAll 支持提供非 null 型 FixAllProvider (可能为 "WellKnownFixAllProviders.BatchFixer")或提供 "null" 以显式启用 FixAll 支持。

# OverrideGetFixAllProviderDescription
source: A CodeFixProvider should provide FixAll support to enable users to fix multiple instances of the underlying diagnostic with a single code fix. See documentation at https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md for further details.
cs: Zprostředkovatel CodeFixProvider by měl poskytovat podporu pro FixAll, aby uživatelé mohli opravit více instancí příslušné diagnostiky pomocí jedné opravy kódu. Další podrobnosti najdete v dokumentaci na adrese https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md.
pt_br: Um CodeFixProvider deve dar suporte a FixAll para permitir que os usuários corrijam várias instâncias do diagnóstico subjacente com apenas uma correção de código. Confira a documentação em https://github.com/dotnet/roslyn/blob/main/docs/analyzers/FixAllProvider.md para obter mais detalhes.

# OverrideGetFixAllProviderCodeFixTitle
source: Override GetFixAllProvider.
cs: Přepište zprostředkovatele GetFixAllProvider.
de: Überschreiben Sie GetFixAllProvider.
fr: Substituez GetFixAllProvider.
ja: GetFixAllProvider をオーバーライドします。
ko: GetFixAllProvider를 재정의하세요.
pt_br: Substitua GetFixAllProvider.
tr: GetFixAllProvider’ı geçersiz kılın.
zh_hans: 重写 GetFixAllProvider。

# ProvideHelpUriInDescriptorMessage
source: Consider providing a non-null 'helpLinkUri' to diagnostic descriptor constructor to show information when this diagnostic appears in the error list
cs: Zvažte možnost poskytnout konstruktoru popisovače diagnostiky nenulový parametr helpLinkUri, který umožní zobrazit další informace, když se tato diagnostika objeví v seznamu chyb.
pt_br: Considere fornecer um 'helpLinkUri' não nulo para o construtor de descritor de diagnóstico para mostrar informações quando este diagnóstico aparece na lista de erros

# ProvideHelpUriInDescriptorTitle
source: Provide non-null 'helpLinkUri' value to diagnostic descriptor constructor
cs: Poskytněte konstruktoru popisovače diagnostiky nenulový parametr helpLinkUri
pt_br: Forneça um valor de 'helpLinkUri' não nulo para o construtor de descritor de diagnóstico

# ProvideHelpUriInDescriptorDescription
source: The 'helpLinkUri' value is used to show information when this diagnostic in the error list. Every analyzer should have a helpLinkUri specified which points to a help page that does not change over time.
cs: Hodnota helpLinkUri se použije k zobrazení dalších informací, když se tato diagnostika objeví v seznamu chyb. Každý analyzátor by měl mít zadaný parametr helpLinkUri směřující na stránku nápovědy, která se v průběhu času nemění.
de: Der helpLinkUri-Wert wird verwendet, um Informationen anzuzeigen, wenn diese Diagnose in der Fehlerliste erscheint. Jedes Analysetool sollte mithilfe eines helpLinkUri-Werts auf eine Hilfeseite zeigen, die sich im Laufe der Zeit nicht ändert.
fr: La valeur 'helpLinkUri' est utilisée pour afficher des informations quand ce diagnostic figure dans la liste des erreurs. Un helpLinkUri qui pointe vers une page d'aide qui ne change pas au fil du temps doit être spécifié pour chaque analyseur.
ja: 'helpLinkUri' 値は、この診断がエラー一覧に表示されたときに情報を表示するために使用されます。すべてのアナライザーには、経時的に変化しないヘルプ ページを指す helpLinkUri が指定されている必要があります。
ko: 'helpLinkUri' 값은 이 진단이 오류 목록에 표시될 때 정보를 표시하는 데 사용됩니다. 모든 분석기에 시간이 지나도 변경되지 않는 도움말 페이지를 가리키는 지정된 helpLinkUri가 있어야 합니다.
pt_br: O valor de 'helpLinkUri' é usado para mostrar informações quando esse diagnóstico aparece na lista de erros. Todo analisador deve ter um helpLinkUri especificado que aponta para uma página de ajuda que não é alterada com o passar do tempo.
tr: 'helpLinkUri' değeri, bu tanılama hata listesinde olduğunda bilgi görüntülemek için kullanılır. Her çözümleyici için zaman içinde değişmeyen bir yardım sayfasına işaret eden bir helpLinkUri belirtilmelidir.
zh_hans: "helpLinkUri" 值用于在错误列表中出现该诊断时显示信息。应对每个分析器指定一个 helpLinkUri，用于指向一个不会随时间推移而更改的帮助页面。

# DiagnosticIdMustBeInSpecifiedFormatTitle
source: DiagnosticId for analyzers must be in specified format
cs: DiagnosticId pro analyzátory musí být v zadaném formátu
pt_br: A DiagnosticId para analisadores precisa estar no formato especificado

# DiagnosticIdMustBeInSpecifiedFormatMessage
source: Diagnostic Id '{0}' belonging to category '{1}' is not in the required range and/or format '{2}' specified in the file '{3}'
cs: ID diagnostiky {0}, které patří do kategorie {1}, není v požadovaném rozmezí a/nebo formátu {2} zadaném v souboru {3}.
pt_br: A ID de diagnóstico '{0}' pertencente à categoria '{1}' não está no intervalo e/ou no formato necessário '{2}' especificado no arquivo '{3}'

# DiagnosticIdMustBeInSpecifiedFormatDescription
source: DiagnosticId for analyzers must be in specified format.
cs: DiagnosticId pro analyzátory musí být v zadaném formátu.
de: Die DiagnosticId für das Analysetool muss im angegebenen Format vorliegen.
fr: Le DiagnosticId pour les analyseurs doit être au format spécifié.
ja: アナライザーの診断 ID は、指定された形式に準拠している必要があります。
ko: 분석기에 대한 진단 ID는 지정된 형식이어야 합니다.
pt_br: A DiagnosticId para analisadores deve estar no formato especificado.
tr: Çözümleyiciler için DiagnosticId belirtilen biçimde olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为指定格式。

# UseUniqueDiagnosticIdTitle
source: DiagnosticId must be unique across analyzers
cs: DiagnosticId musí být u každého analyzátoru jedinečné
pt_br: A DiagnosticId precisa ser exclusiva entre os analisadores

# UseUniqueDiagnosticIdMessage
source: Diagnostic Id '{0}' is already used by analyzer '{1}'. Please use a different diagnostic ID.
cs: ID diagnostiky {0} už používá analyzátor {1}. Použijte prosím jiné ID diagnostiky.
de: Die Diagnose-ID "{0}" wird bereits vom Analysetool "{1}" verwendet. Verwenden Sie eine andere Diagnose-ID
fr: L'ID de diagnostic '{0}' est déjà utilisé par l'analyseur '{1}'. Utilisez un ID de diagnostic différent.
ja: 診断 ID '{0}' はアナライザー '{1}' によって既に使用されています。別の診断 ID をご使用ください。
ko: 진단 ID '{0}'이(가) 분석기 '{1}'에서 이미 사용되고 있습니다. 다른 진단 ID를 사용하세요.
pt_br: A ID de diagnóstico '{0}' já está sendo usada pelo analisador '{1}'. Use uma ID de diagnóstico diferente.
tr: '{0}' tanılama kimliği zaten '{1}' çözümleyicisi tarafından kullanılıyor. Lütfen farklı bir tanılama kimliği kullanın.
zh_hans: 诊断 Id“{0}”已被分析器“{1}”使用。请使用其他诊断 ID。

# UseUniqueDiagnosticIdDescription
source: DiagnosticId must be unique across analyzers.
cs: DiagnosticId musí být u každého analyzátoru jedinečné.
de: Die DiagnosticId muss für jedes Analysetool eindeutig sein.
fr: Le DiagnosticId doit être unique sur l'ensemble des analyseurs.
ja: 診断 ID は、アナライザーをまたいで一意である必要があります。
ko: 진단 ID는 분석기 간에 고유해야 합니다.
pt_br: A DiagnosticId deve ser exclusiva entre os analisadores.
tr: DiagnosticId çözümleyiciler arasında benzersiz olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须唯一。

# UseCategoriesFromSpecifiedRangeTitle
source: Category for analyzers must be from the specified values
cs: Kategorie pro analyzátory musí být jedna ze zadaných hodnot
pt_br: A categoria dos analisadores precisa ser um dos valores especificados

# UseCategoriesFromSpecifiedRangeMessage
source: Category '{0}' is not from the allowed categories specified in the file '{1}'
cs: Kategorie {0} nepatří mezi povolené kategorie zadané v souboru {1}.
pt_br: A categoria '{0}' não é uma das categorias permitidas especificadas no arquivo '{1}'

# UseCategoriesFromSpecifiedRangeDescription
source: Category for analyzers must be from the specified values.
cs: Kategorie pro analyzátory musí být jedna ze zadaných hodnot.
de: Die Kategorie für Analysetools muss einem der angegebenen Werte entsprechen.
fr: La catégorie pour les analyseurs doit provenir des valeurs spécifiées.
ja: アナライザーのカテゴリは、指定された値からのものである必要があります。
ko: 분석기에 대한 범주는 지정된 값이어야 합니다.
pt_br: A categoria dos analisadores deve ser um dos valores especificados.
tr: Çözümleyiciler için kategori belirtilen değerlerden biri olmalıdır.
zh_hans: 分析器的类别必须源自指定的值。

# AnalyzerCategoryAndIdRangeFileInvalidTitle
source: Invalid entry in analyzer category and diagnostic ID range specification file
cs: V souboru specifikací kategorií analyzátorů a rozmezí ID diagnostiky je neplatná položka
pt_br: Entrada inválida no arquivo de especificação de intervalo de ID de diagnóstico e de categoria do analisador

# AnalyzerCategoryAndIdRangeFileInvalidMessage
source: Invalid entry '{0}' in analyzer category and diagnostic ID range specification file '{1}'
cs: V souboru specifikací kategorií analyzátorů a rozmezí ID diagnostiky {1} je neplatná položka {0}.
pt_br: Entrada inválida '{0}' no arquivo de especificação de intervalo de ID de diagnóstico e de categoria do analisador '{1}'

# AnalyzerCategoryAndIdRangeFileInvalidDescription
source: Invalid entry in analyzer category and diagnostic ID range specification file.
cs: V souboru specifikací kategorií analyzátorů a rozmezí ID diagnostiky je neplatná položka.
de: Ungültiger Eintrag in der Spezifikationsdatei für Kategorien und Diagnose-ID-Bereich der Analysetools.
fr: Entrée non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic.
ja: アナライザーのカテゴリと診断 ID 範囲の指定ファイルのエントリが無効です。
ko: 분석기 범주 및 진단 ID 범위 지정 파일의 항목이 잘못되었습니다.
pt_br: Entrada inválida no arquivo de especificação de intervalo de ID de diagnóstico e de categoria do analisador.
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasında geçersiz girdi.
zh_hans: 分析器类别和诊断 ID 范围规定文件中的条目无效。

# DiagnosticIdMustBeAConstantTitle
source: DiagnosticId for analyzers must be a non-null constant
cs: DiagnosticId pro analyzátory musí být nenulová konstanta
pt_br: A DiagnosticId para analisadores precisa ser uma constante não nula

# DiagnosticIdMustBeAConstantMessage
source: Diagnostic Id for rule '{0}' must be a non-null constant
cs: ID diagnostiky pro pravidlo {0} musí být nenulová konstanta.
pt_br: A ID de diagnóstico para a regra '{0}' precisa ser uma constante não nula

# DiagnosticIdMustBeAConstantDescription
source: DiagnosticId for analyzers must be a non-null constant.
cs: DiagnosticId pro analyzátory musí být nenulová konstanta.
de: Die DiagnosticId für Analysetools muss eine Konstante ungleich NULL sein.
fr: Le DiagnosticId pour les analyseurs doit être une constante non-null.
ja: アナライザーの診断 ID は、NULL 以外の定数である必要があります。
ko: 분석기에 대한 진단 ID는 null이 아닌 상수여야 합니다.
pt_br: A DiagnosticId para analisadores deve ser uma constante não nula.
tr: Çözümleyiciler için DiagnosticId null olmayan bir sabit değer olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为非 null 常量。

# DoNotUseTypesFromAssemblyRuleDescription
source: Diagnostic analyzer types should not use types from Workspaces assemblies. Workspaces assemblies are only available when the analyzer executes in Visual Studio IDE live analysis, but are not available during command line build. Referencing types from Workspaces assemblies will lead to runtime exception during analyzer execution in command line build.
cs: Typy diagnostických analyzátorů by neměly používat typy ze sestavení pracovních prostorů. Sestavení pracovních prostorů jsou dostupná jen při spuštění analyzátoru v živé analýze integrovaného vývojového prostředí Visual Studio, ale nejsou dostupná při sestavování z příkazového řádku. Odkazování na typy ze sestavení pracovních prostorů způsobí výjimku modulu runtime během spuštění analyzátoru při sestavení z příkazového řádku.
de: Diagnoseanalysetypen dürfen keine Typen aus Arbeitsbereichassemblys verwenden. Arbeitsbereichassemblys sind nur verfügbar, wenn das Analysetool in der Visual Studio IDE-Liveanalyse ausgeführt wird, nicht jedoch während einer Builderstellung über die Befehlszeile. Das Referenzieren von Typen aus Arbeitsbereichassemblys führt zu Laufzeitausnahmen bei der Analyseausführung während der Builderstellung über die Befehlszeile.
fr: Les types d'analyseur de diagnostic ne doivent pas utiliser les types d'assemblys Espaces de travail. Les assemblys Espaces de travail sont disponibles uniquement quand l'analyseur s'exécute dans l'analyse en direct de l'IDE Visual Studio, mais ne sont pas disponibles pendant l'exécution de la ligne de commande build. Le référencement de types d'assemblys Espaces de travail lève une exception de runtime pendant l'exécution de l'analyseur dans la ligne de commande build.
ja: 診断アナライザーの型は、ワークスペースのアセンブリの型を使用すべきではありません。ワークスペース アセンブリは、Visual Studio IDE ライブ分析でアナライザーが実行される場合にのみ使用できますが、コマンド ライン ビルド中は使用できません。ワークスペース アセンブリの型を参照すると、コマンド ライン ビルドでのアナライザーの実行中にランタイム例外が発生します。
ko: 진단 분석기 형식은 작업 영역 어셈블리의 형식을 사용해서는 안 됩니다. 작업 영역 어셈블리는 분석기가 Visual Studio IDE 라이브 분석에서 실행될 때에만 사용 가능하지만, 명령줄 빌드 중에는 사용할 수 없습니다. 작업 영역 어셈블리의 형식을 참조하면 명령줄 빌드에서 분석기 실행 중 런타임 예외가 발생합니다.
pt_br: Os tipos do analisador de diagnóstico não devem usar tipos de Assemblies de workspaces. Esses Assemblies estão disponíveis apenas quando o analisador é executado na análise dinâmica do IDE do Visual Studio, mas não estão disponíveis durante o build da linha de comando. Referenciar tipos de Assemblies de workspaces levará a uma exceção de tempo de execução durante a execução do analisador no build de linha de comando.
tr: Tanılama çözümleyicisi türleri, Çalışma Alanları bütünleştirilmiş kodlarından alınan türleri kullanmamalıdır. Çalışma Alanları bütünleştirilmiş kodları yalnızca çözümleyici Visual Studio IDE canlı analizinde yürütülüyorsa kullanılabilir, ancak komut satırı derlemesi sırasında kullanılamaz. Çalışma Alanları bütünleştirilmiş kodlarından türlere başvurulması, komut satırı derlemesinde çözümleyici yürütüldüğü sırada çalışma zamanı özel durumuna yol açar.
zh_hans: 诊断分析器类型不应使用 Workspaces 程序集中的类型。分析器在 Visual Studio IDE 实时分析中执行时，Workspaces 程序集才可用，但在命令行生成期间不可用。命令行生成中的分析器执行期间，从 Workspaces 程序集引用类型将导致运行时异常。

# DoNotUseTypesFromAssemblyRuleTitle
source: Do not use types from Workspaces assembly in an analyzer
cs: Nepoužívejte v analyzátoru typy ze sestavení pracovních prostorů.
de: Verwenden Sie im Analysetool keine Typen aus Arbeitsbereichassemblys.
fr: Ne pas utiliser les types d'assembly Espaces de travail dans un analyseur
ja: アナライザーでワークスペース アセンブリからの型を使用しないでください
ko: 분석기에서 작업 영역 어셈블리의 형식을 사용하지 마세요.
pt_br: Não use tipos de Assembly de workspaces em um analisador
tr: Bir çözümleyicide Çalışma Alanları bütünleştirilmiş kodundan alınan türleri kullanmayın
zh_hans: 不要在分析器中使用来自 Workspaces 程序集的类型

# DoNotUseTypesFromAssemblyRuleIndirectMessage
source: Change diagnostic analyzer type '{0}' to remove all direct and/or indirect accesses to type(s) '{1}', which access type(s) '{2}'
cs: Změnou typu diagnostického analyzátoru {0} odeberte všechny přímé a/nebo nepřímé přístupy k typům {1}, které mají přístup k typům {2}.
de: Ändern Sie den Diagnoseanalysetyp "{0}", um alle direkten und/oder indirekten Zugriffe auf die Typen "{1}" zu entfernen, die auf die Typen "{2}" zugreifen.
fr: Changer le type d'analyseur de diagnostic '{0}' pour supprimer tous les accès directs et/ou indirects aux types '{1}', qui accèdent aux types '{2}'
ja: 診断アナライザーの型 '{0}' を変更して、型 '{1}' へのすべての直接アクセスおよび/または間接アクセス (型 '{2}' にアクセスする) を削除します
ko: 진단 분석기 형식 '{0}'을(를) 변경하여 '{1}' 형식에 대해 액세스 형식이 '{2}'인 모든 직접 및/또는 간접 액세스를 제거합니다.
pt_br: Altere o tipo de analisador de diagnóstico '{0}' para remover todos os acessos diretos e/ou indiretos aos tipos '{1}', que acessam os tipos '{2}'
tr: '{2}' türüne erişen '{1}' türüne doğrudan veya dolaylı tüm erişimleri kaldırmak için tanılama çözümleyici türünü ('{0}') değiştirin
zh_hans: 更改诊断分析器类型“{0}”，删除对访问类型“{2}”的类型“{1}”的所有的直接和/或间接访问

# DoNotUseTypesFromAssemblyRuleDirectMessage
source: Change diagnostic analyzer type '{0}' to remove all direct accesses to type(s) '{1}'
cs: Změnou typu diagnostického analyzátoru {0} odeberte všechny přímé přístupy k typům {1}.
de: Ändern Sie den Diagnoseanalysetyp "{0}", um alle direkten Zugriffe auf die Typen "{1}" zu entfernen.
fr: Changer le type d'analyseur de diagnostic '{0}' pour supprimer tous les accès directs aux types '{1}'
ja: 診断アナライザーの型 '{0}' を変更して、型 '{1}' へのすべての直接アクセスを削除します
ko: 진단 분석기 형식 '{0}'을(를) 변경하여 '{1}' 형식에 대해 모든 직접 액세스를 제거합니다.
pt_br: Altere o tipo de analisador de diagnóstico '{0}' para remover todos os acessos diretos aos tipos '{1}'
tr: '{1}' türüne yönelik tüm doğrudan erişimleri kaldırmak için tanılama çözümleyici türünü ('{0}') değiştirin
zh_hans: 更改诊断分析器类型“{0}”以删除对类型“{1}”的所有直接访问

# UpgradeMSBuildWorkspaceDescription
source: MSBuildWorkspace has moved to the Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet package and there are breaking API changes.
cs: MSBuildWorkspace se přesunul do balíčku NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild a v rozhraní API došlo ke změnám, které mohou způsobit nefunkčnost.
de: MSBuildWorkspace wurde in das NuGet-Paket "Microsoft.CodeAnalysis.Workspaces.MSBuild" verschoben, in dem Breaking Changes an APIs vorgenommen wurden.
fr: MSBuildWorkspace a été déplacé vers le package Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet. Il existe des changements d'API importants.
ja: MSBuildWorkspace が Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet パッケージに移動したため、ビルド ブレークを引き起こす API の変更が生じています。
ko: MSBuildWorkspace가 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 패키지로 이동되었으며 새로운 API 변경 내용이 있습니다.
pt_br: O MSBuildWorkspace foi movido para o pacote do NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild e há alterações da falha da API.
tr: MSBuildWorkspace, Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet paketini taşıdı ve hataya neden olan API değişiklikleri var.
zh_hans: MSBuildWorkspace 已经转移到了 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 包，并且存在中断的 API 更改。

# UpgradeMSBuildWorkspaceMessage
source: Please upgrade MSBuildWorkspace by adding a package reference to the Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet package. See https://go.microsoft.com/fwlink/?linkid=874285 for details on using MSBuildWorkspace successfully.
cs: Upgradujte prosím MSBuildWorkspace přidáním odkazu na balíček do balíčku NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Podrobnosti o úspěšném použití MSBuildWorkspace najdete zde: https://go.microsoft.com/fwlink/?linkid=874285.
de: Führen Sie ein Upgrade für MSBuildWorkspace durch, indem Sie einen Paketverweis auf das NuGet-Paket "Microsoft.CodeAnalysis.Workspaces.MSBuild" hinzufügen. Einzelheiten zur richtigen Verwendung von MSBuildWorkspace finden Sie unter https://go.microsoft.com/fwlink/?linkid=874285.
fr: Mettez à niveau MSBuildWorkspace en ajoutant une référence de package au package NuGet Microsoft.CodeAnalysis.Workspaces.MSBuild. Pour plus d'informations sur l'utilisation correcte de MSBuildWorkspace, consultez https://go.microsoft.com/fwlink/?linkid=874285.
ja: MSBuildWorkspace をアップグレードして、Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet パッケージに対するパッケージ参照を追加してください。MSBuildWorkspace を正しく使用するための詳細については、https://go.microsoft.com/fwlink/?linkid=874285 をご覧ください。
ko: Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 패키지에 패키지 참조를 추가하여 MSBuildWorkspace를 업그레이드하세요. 성공적인 MSBuildWorkspace 사용에 대한 자세한 내용은 https://go.microsoft.com/fwlink/?linkid=874285를 참조하세요.
pt_br: Atualize o MSBuildWorkspace adicionando uma referência de pacote ao pacote Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet. Confira https://go.microsoft.com/fwlink/?linkid=874285 para obter detalhes de como usar o MSBuildWorkspace com sucesso.
tr: Lütfen Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet paketine bir paket başvurusu ekleyerek MSBuildWorkspace’i yükseltin. MSBuildWorkspace’i başarıyla kullanma hakkında ayrıntılı bilgi için bkz. https://go.microsoft.com/fwlink/?linkid=874285.
zh_hans: 请通过向 Microsoft.CodeAnalysis.Workspaces.MSBuild NuGet 包添加包引用来升级 MSBuildWorkspace。有关成功使用 MSBuildWorkspace 的详细信息，请参阅 https://go.microsoft.com/fwlink/?linkid=874285。

# UpgradeMSBuildWorkspaceTitle
source: Upgrade MSBuildWorkspace
cs: Upgradovat MSBuildWorkspace
de: Upgrade von MSBuildWorkspace
fr: Mettre à niveau MSBuildWorkspace
ja: MSBuildWorkspace のアップグレード
ko: MSBuildWorkspace 업그레이드
pt_br: Atualizar o MSBuildWorkspace
tr: MSBuildWorkspace’i yükseltir
zh_hans: 升级 MSBuildWorkspace

# ClassIsNotDiagnosticAnalyzerMessage
source: Inherit type '{0}' from DiagnosticAnalyzer or remove the DiagnosticAnalyzerAttribute(s).
ja: DiagnosticAnalyzer から型 '{0}' を継承するか、DiagnosticAnalyzerAttribute を削除してください。

# ClassIsNotDiagnosticAnalyzerTitle
source: Types marked with DiagnosticAnalyzerAttribute(s) should inherit from DiagnosticAnalyzer.
ja: DiagnosticAnalyzerAttribute でマークされている型は DiagnosticAnalyzer から継承する必要があります。

# CompareSymbolsCorrectlyCodeFix
source: Compare symbols correctly
de: Symbole ordnungsgemäß vergleichen
fr: Comparer les symboles correctement
ja: シンボルを正しく比較する
ko: 기호를 올바르게 비교
tr: Simgeleri doğru karşılaştır
zh_hans: 正确比较符号

# CompareSymbolsCorrectlyDescription
source: Symbols should be compared for equality, not identity.
fr: La comparaison des symboles doit porter sur l'égalité, pas sur l'identité.
ja: シンボルは、ID ではなく等値で比較する必要があります。
ko: 기호는 ID가 아니라 같은지 비교해야 합니다.
zh_hans: 符号应比较相等性，而不是标识。

# CompareSymbolsCorrectlyMessage
source: Compare symbols correctly
de: Symbole ordnungsgemäß vergleichen
fr: Comparer les symboles correctement
ja: シンボルを正しく比較する
ko: 기호를 올바르게 비교
tr: Simgeleri doğru karşılaştır
zh_hans: 正确比较符号
