Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# AddCompilationEndCustomTagDescription
source: 'DiagnosticDescriptor' assigned to field is used to report a compilation end diagnostic, but the 'DiagnosticDescriptor' constructor used to initialize it does not pass in the required custom tag "CompilationEnd". See documentation for 'WellKnownDiagnosticTags.CompilationEnd' for details.
cs: Popisovač DiagnosticDescriptor přiřazený k poli se používá k hlášení diagnostiky ukončení kompilace, ale konstruktor DiagnosticDescriptor použitý k jeho inicializaci nepředává požadovanou vlastní značku CompilationEnd. Podrobnosti najdete v dokumentaci k WellKnownDiagnosticTags.CompilationEnd.
pt_br: O "DiagnosticDescriptor" atribuído ao campo é usado para relatar um diagnóstico final de compilação, mas o construtor "DiagnosticDescriptor" usado para inicializá-lo não passa na marca personalizada necessária "CompilationEnd". Confira a documentação de "WellKnownDiagnosticTags.CompilationEnd" para obter detalhes.

# AddCompilationEndCustomTagMessage
source: Add "CompilationEnd" custom tag to the diagnostic descriptor used to initialize field '{0}' as it is used to report a compilation end diagnostic
cs: Přidat vlastní značku CompilationEnd do popisovače diagnostiky, který se používá k inicializaci pole {0}, protože slouží k nahlášení diagnostiky ukončení kompilace
pt_br: Adicionar a marca personalizada "CompilationEnd" ao descritor de diagnóstico usado para inicializar o campo "{0}" como ele é usado para relatar um diagnóstico final de compilação

# AddCompilationEndCustomTagTitle
source: Add "CompilationEnd" custom tag to compilation end diagnostic descriptor
cs: Přidat vlastní značku CompilationEnd do popisovače diagnostiky ukončení kompilace
pt_br: Adicionar a marca personalizada "CompilationEnd" ao descritor de diagnóstico final de compilação

# AddEntryForDiagnosticIdInAnalyzerReleaseCodeFixTitle
source: Add rule entry to unshipped release file
cs: Přidat položku pravidla k nevydanému souboru verze
ja: 未出荷のリリース ファイルへのルール エントリの追加
pt_br: Adicionar uma entrada de regra ao arquivo de versão não enviado

# ClassIsNotDiagnosticAnalyzerMessage
source: Inherit type '{0}' from DiagnosticAnalyzer or remove the DiagnosticAnalyzerAttribute(s)
cs: Zděďte typ {0} z DiagnosticAnalyzer, nebo odeberte atributy DiagnosticAnalyzerAttribute.
pt_br: Herdar o tipo '{0}' de DiagnosticAnalyzer ou remover os DiagnosticAnalyzerAttributes

# ClassIsNotDiagnosticAnalyzerTitle
source: Types marked with DiagnosticAnalyzerAttribute(s) should inherit from DiagnosticAnalyzer
cs: Typy označené jako DiagnosticAnalyzerAttribute by měly dědit z DiagnosticAnalyzer
pt_br: Os tipos marcados com DiagnosticAnalyzerAttributes devem ser herdados de DiagnosticAnalyzer

# CompareSymbolsCorrectlyCodeFix
source: Use a 'SymbolEqualityComparer' for symbol comparison
cs: K porovnání symbolů použít SymbolEqualityComparer
pt_br: Usar um ' SymbolEqualityComparer ' para a comparação de símbolos

# CompareSymbolsCorrectlyDescription
source: Symbols should be compared for equality, not identity. Use an overload accepting an 'IEqualityComparer' and pass 'SymbolEqualityComparer'.
cs: Symboly by se měly porovnávat podle rovnosti, nikoli identity. Použijte přetížení, které přijímá IEqualityComparer, a předejte SymbolEqualityComparer.
pt_br: Os símbolos devem ser comparados quanto à igualdade, não quanto à identidade. Use uma sobrecarga que aceite um 'IEqualityComparer' e passe 'SymbolEqualityComparer'.

# CompareSymbolsCorrectlyDescriptionGetHashCode
source: Symbols should be compared for equality, not identity. An explicit call to 'GetHashCode' will likely result in the wrong behavior.
cs: Symboly by se měly porovnávat podle rovnosti, nikoli identity. Explicitní volání GetHashCode pravděpodobně způsobí nesprávné chování.
pt_br: Os símbolos devem ser comparados quanto à igualdade, não quanto à identidade. Uma chamada explícita para 'GetHashCode' provavelmente resultará no comportamento errado.

# CompareSymbolsCorrectlyMessage
source: Use 'SymbolEqualityComparer' when comparing symbols
cs: Při porovnávání symbolů použít SymbolEqualityComparer
pt_br: Use ' SymbolEqualityComparer ' ao comparar símbolos

# CompareSymbolsCorrectlyTitle
source: Symbols should be compared for equality
cs: Symboly by se měly porovnat podle rovnosti.
pt_br: Os símbolos devem ser comparados quanto à igualdade

# ConfigureGeneratedCodeAnalysisFix
source: Configure generated code analysis
cs: Nakonfigurovat analýzu vygenerovaného kódu
de: Konfigurieren der Analyse von generiertem Code
fr: Configurer l'analyse du code générée
ja: 生成されたコード分析を構成します
ko: 생성된 코드 분석 구성
pt_br: Configurar análise de código gerado
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析

# ConfigureGeneratedCodeAnalysisMessage
source: Configure generated code analysis
cs: Nakonfigurovat analýzu vygenerovaného kódu
de: Konfigurieren der Analyse von generiertem Code
fr: Configurer l'analyse du code générée
ja: 生成されたコード分析を構成します
ko: 생성된 코드 분석 구성
pt_br: Configurar análise de código gerado
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析

# ConfigureGeneratedCodeAnalysisTitle
source: Configure generated code analysis
cs: Nakonfigurovat analýzu vygenerovaného kódu
de: Konfigurieren der Analyse von generiertem Code
fr: Configurer l'analyse du code générée
ja: 生成されたコード分析を構成します
ko: 생성된 코드 분석 구성
pt_br: Configurar análise de código gerado
tr: Oluşturulan kod analizini yapılandır
zh_hans: 配置生成的代码分析

# DeclareDiagnosticIdInAnalyzerReleaseDescription
source: All supported analyzer diagnostic IDs should be part of an analyzer release.
cs: Všechna podporovaná ID diagnostiky analyzátoru by měla být součástí verze analyzátoru.
ja: サポートされているすべてのアナライザー診断 ID は、アナライザー リリースに含まれている必要があります。
pt_br: Todas as IDs de diagnóstico do analisador com suporte devem fazer parte de uma versão do analisador.

# DeclareDiagnosticIdInAnalyzerReleaseMessage
source: Rule '{0}' is not part of any analyzer release
cs: Pravidlo {0} není součástí žádné verze analyzátoru.
pt_br: A regra '{0}' não faz parte de nenhuma versão do analisador

# DeclareDiagnosticIdInAnalyzerReleaseTitle
source: Add analyzer diagnostic IDs to analyzer release
cs: Přidat ID diagnostiky analyzátoru do verze analyzátoru
pt_br: Adicione as IDs de diagnóstico do analisador à versão do analisador

# DefineDiagnosticDescriptionCorrectlyMessage
source: The diagnostic description should be one or multiple sentences ending with a punctuation sign and should not have any leading or trailing whitespaces
cs: Popis diagnostiky by měl být jedna nebo několik vět, které končí znakem interpunkce a které na začátku ani na konci nemají žádné prázdné znaky.
pt_br: A descrição do diagnóstico deve ter uma ou várias frases que terminam com um sinal de pontuação e não deve ter espaços em branco à esquerda nem à direita

# DefineDiagnosticDescriptionCorrectlyTitle
source: Define diagnostic description correctly
cs: Definujte správně diagnostický popis
ja: 診断の説明を正しく定義する
pt_br: Definir a descrição de diagnóstico corretamente

# DefineDiagnosticMessageCorrectlyMessage
source: The diagnostic message should not contain any line return character nor any leading or trailing whitespaces and should either be a single sentence without a trailing period or a multi-sentences with a trailing period
cs: Diagnostická zpráva by neměla obsahovat žádný znak konce řádku ani žádné prázdné znaky na začátku a na konci. Zároveň by to měla být buď jedna věta bez tečky na konci, nebo více vět s tečkou na konci.
pt_br: A mensagem de diagnóstico não deve conter nenhum caractere de retorno de linha nem espaços em branco à esquerda ou à direita e deve ser uma frase única sem um ponto à direita ou várias frases com um ponto à direita

# DefineDiagnosticMessageCorrectlyTitle
source: Define diagnostic message correctly
cs: Definujte správně diagnostickou zprávu
ja: 診断メッセージを正しく定義する
pt_br: Definir a mensagem de diagnóstico corretamente

# DefineDiagnosticTitleCorrectlyMessage
source: The diagnostic title should not contain a period, nor any line return character, nor any leading or trailing whitespaces
cs: Název diagnostiky by neměl obsahovat tečku, znak konce řádku ani prázdné znaky na začátku a na konci.
pt_br: O título do diagnóstico não deve conter um ponto nem outros caracteres de retorno de linha nem espaços em branco à esquerda ou à direita

# DefineDiagnosticTitleCorrectlyTitle
source: Define diagnostic title correctly
cs: Definujte správně nadpis diagnostiky
ja: 診断タイトルを正しく定義する
pt_br: Definir o título de diagnóstico corretamente

# DoNotDeclareCSharpCompilerFeatureInAssemblyWithVisualBasicReferenceMessage
source: This C# compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.VisualBasic. The Microsoft.CodeAnalysis.VisualBasic assembly is not always provided during C# compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
cs: Toto rozšíření kompilátoru jazyka C# by nemělo být implementováno v sestavení obsahujícím odkaz na Microsoft.CodeAnalysis.VisualBasic. Sestavení Microsoft.CodeAnalysis.VisualBasic není vždy poskytováno během kompilačních scénářů jazyka C#, takže odkazy na něj by mohly způsobit, že se rozšíření kompilátoru bude chovat nepředvídatelně.
pt_br: Esta extensão de compilador C# não deve ser implementada em um assembly contendo uma referência a Microsoft.CodeAnalysis.VisualBasic. O assembly Microsoft.CodeAnalysis.VisualBasic nem sempre é fornecido durante os cenários de compilação C#, portanto, as referências a ele podem fazer com que a extensão do compilador se comporte de forma imprevisível.

# DoNotDeclareCompilerFeatureInAssemblyWithUnsupportedTargetFrameworkMessage
source: This compiler extension should not be implemented in an assembly with target framework '{0}'. References to other target frameworks will cause the compiler to behave unpredictably.
cs: Toto rozšíření kompilátoru by nemělo být implementováno v sestavení s cílovou architekturou {0}. Odkazy na jiné cílové architektury způsobí, že se kompilátor bude chovat nepředvídatelně.
pt_br: Essa extensão do compilador não deve ser implementada em um assembly com estrutura de destino ''{0}''. As referências a outras estruturas de destino fará com que o compilador se comporte de forma imprevisível.

source: Types which implement compiler extension points should only be declared in assemblies targeting netstandard2.0. More specific target frameworks are only available in a subset of supported compilation scenarios, so targeting them may cause the feature to behave unpredictably.
cs: Typy, které implementují body rozšíření kompilátoru, by měly být deklarovány pouze v sestaveních cílených na netstandard2.0. Konkrétnější cílové architektury jsou k dispozici pouze v podmnožině podporovaných scénářů kompilace, takže cílení na ně může způsobit, že se funkce bude chovat nepředvídatelně.
pt_br: Os tipos que implementam pontos de extensão do compilador devem ser declarados somente em assemblies direcionados a netstandard2.0. As estruturas de destino mais específicas só estão disponíveis em um subconjunto de cenários de compilação com suporte, portanto, direcioná-los pode fazer com que o recurso se comporte de forma imprevisível.

# DoNotDeclareCompilerFeatureInAssemblyWithUnsupportedTargetFrameworkRuleTitle
source: Compiler extensions should be implemented in assemblies targeting netstandard2.0
cs: Rozšíření kompilátoru by měla být implementována v sestavách cílících na netstandard2.0.
pt_br: As extensões do compilador devem ser implementadas em assemblies direcionados ao netstandard2.0

# DoNotDeclareCompilerFeatureInAssemblyWithWorkspacesReferenceMessage
source: This compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.Workspaces. The Microsoft.CodeAnalysis.Workspaces assembly is not provided during command line compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
cs: Toto rozšíření kompilátoru by nemělo být implementováno v sestavení obsahujícím odkaz na Microsoft.CodeAnalysis.Workspaces. Sestavení Microsoft.CodeAnalysis.Workspaces se během scénářů kompilace příkazového řádku neposkytuje, takže odkazy na něj by mohly způsobit, že se rozšíření kompilátoru bude chovat nepředvídatelně.
pt_br: Esta extensão de compilador não deve ser implementada em um assembly contendo uma referência a Microsoft.CodeAnalysis.Workspaces. O assembly Microsoft.CodeAnalysis.Workspaces não é fornecido durante cenários de compilação de linha de comando, portanto, referências a ele podem fazer com que a extensão do compilador se comporte de forma imprevisível.

# DoNotDeclareVisualBasicCompilerFeatureInAssemblyWithCSharpReferenceMessage
source: This Visual Basic compiler extension should not be implemented in an assembly containing a reference to Microsoft.CodeAnalysis.CSharp. The Microsoft.CodeAnalysis.CSharp assembly is not always provided during Visual Basic compilation scenarios, so references to it could cause the compiler extension to behave unpredictably.
cs: Toto rozšíření kompilátoru Visual Basic by nemělo být implementováno v sestavení obsahujícím odkaz na Microsoft.CodeAnalysis.CSharp. Sestavení Microsoft.CodeAnalysis.CSharp není vždy poskytováno během Visual Basic scénářů kompilace, takže odkazy na něj by mohly způsobit, že se rozšíření kompilátoru bude chovat nepředvídatelně.
pt_br: Esta extensão de compilador do Visual Basic não deve ser implementada em um assembly contendo uma referência a Microsoft.CodeAnalysis.CSharp. O assembly Microsoft.CodeAnalysis.CSharp nem sempre é fornecido durante os cenários de compilação do Visual Basic, portanto, referências a ele podem fazer com que a extensão do compilador tenha um comportamento imprevisível.

# DoNotRegisterCompilerTypesWithBadAssemblyReferenceRuleDescription
source: Types which implement compiler extension points should not be declared in assemblies that contain references to assemblies which are not provided by all compilation scenarios. Doing so may cause the feature to behave unpredictably.
cs: Typy, které implementují rozšiřující body kompilátoru, by neměly být deklarovány v sestaveních, která obsahují odkazy na sestavení, která nejsou poskytována všemi scénáři kompilace. To může způsobit, že se funkce bude chovat nepředvídatelně.
pt_br: Tipos que implementam pontos de extensão do compilador não devem ser declarados em assemblies que contenham referências a assemblies que não são fornecidos por todos os cenários de compilação. Isso pode fazer com que o recurso tenha um comportamento imprevisível.

# DoNotRegisterCompilerTypesWithBadAssemblyReferenceRuleTitle
source: Compiler extensions should be implemented in assemblies with compiler-provided references
cs: Rozšíření kompilátoru by se měla implementovat v sestaveních s odkazy poskytnutými kompilátorem.
pt_br: As extensões do compilador devem ser implementadas em assemblies com referências fornecidas pelo compilador

# DoNotUseCompilationGetSemanticModelDescription
source: 'GetSemanticModel' is an expensive method to invoke within a diagnostic analyzer because it creates a completely new semantic model, which does not share compilation data with the compiler or other analyzers. This incurs an additional performance cost during semantic analysis. Instead, consider registering a different analyzer action which allows used of a shared 'SemanticModel', such as 'RegisterOperationAction', 'RegisterSyntaxNodeAction', or 'RegisterSemanticModelAction'.
cs: GetSemanticModel je náročná metoda na to, aby se volala v diagnostickém analyzátoru, protože vytváří zcela nový sémantický model, který nesdílí data kompilace s kompilátorem nebo jinými analyzátory. To dále snižuje výkon během analýzy sémantiky. Zvažte místo toho možnost zaregistrovat jinou akci analyzátoru, která umožňuje používat sdílený SemanticModel, třeba RegisterOperationAction, RegisterSyntaxNodeAction nebo RegisterSemanticModelAction.
ja: 'GetSemanticModel' は、コンパイラやその他のアナライザーとコンパイル データを共有しないまったく新しいセマンティック モデルを作成するため、診断アナライザー内で呼び出すのにコストの高い方法です。セマンティック分析中に追加のパフォーマンス コストが発生します。代わりに、'RegisterOperationAction'、'RegisterSyntaxNodeAction'、'RegisterSemanticModelAction' など、共有されている 'SemanticModel' を使用できる別のアナライザー操作を登録することをご検討ください。
pt_br: 'GetSemanticModel' é um método caro para ser invocado em um analisador de diagnóstico porque ele cria um modelo semântico completamente novo, que não compartilha dados de compilação com o compilador ou com outros analisadores. Isso gera um custo de desempenho adicional durante a análise semântica. Nesse caso, considere o registro de uma ação do analisador diferente que permita o uso de um 'SemanticModel' compartilhado, como 'RegisterOperationAction', 'RegisterSyntaxNodeAction' ou 'RegisterSemanticModelAction'.

# DoNotUseCompilationGetSemanticModelMessage
source: Do not invoke Compilation.GetSemanticModel() method within a diagnostic analyzer
cs: Nevolejte metodu Compilation.GetSemanticModel() v diagnostickém analyzátoru
ja: 診断アナライザー内で Compilation.GetSemanticModel() メソッドを呼び出さないでください
pt_br: Não invocar o método Compilation.GetSemanticModel() em um analisador de diagnóstico

# DoNotUseCompilationGetSemanticModelTitle
source: Do not invoke Compilation.GetSemanticModel() method within a diagnostic analyzer
cs: Nevolejte metodu Compilation.GetSemanticModel() v diagnostickém analyzátoru
ja: 診断アナライザー内での Compilation.GetSemanticModel() メソッドの呼び出し禁止
pt_br: Não invocar o método Compilation.GetSemanticModel() em um analisador de diagnóstico

# DoNotUseReservedDiagnosticIdDescription
source: DiagnosticId for analyzers should not use reserved IDs.
cs: Hodnoty DiagnosticId pro analyzátory by neměly používat rezervovaná ID.
ja: アナライザーの診断 ID には、予約済み ID を使用しないでください。
pt_br: A DiagnosticId dos analisadores não deve usar IDs reservadas.

# DoNotUseReservedDiagnosticIdMessage
source: '{0}' is a reserved diagnostic ID
cs: {0} je rezervované ID diagnostiky.
pt_br: '{0}' é uma ID de diagnóstico reservada

# DoNotUseReservedDiagnosticIdTitle
source: Do not use reserved diagnostic IDs
cs: Nepoužívejte rezervovaná ID diagnostiky
pt_br: Não use IDs de diagnóstico reservadas

# EnableAnalyzerReleaseTrackingRuleDescription
source: Enabling release tracking for analyzer packages helps in tracking and documenting the analyzer diagnostics that ship and/or change with each analyzer release. See details at https://github.com/dotnet/roslyn-analyzers/blob/main/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
cs: Když se pro balíčky analyzátoru povolí sledování vydaných verzí, pomůže to sledovat a dokumentovat diagnostiky analyzátoru, které se dodávají a mění s každou jeho vydanou verzí. Podrobnosti najdete na adrese https://github.com/dotnet/roslyn-analyzers/blob/main/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.
pt_br: A habilitação do acompanhamento de versão dos pacotes do analisador ajuda a acompanhar e documentar o diagnóstico do analisador que é fornecido e/ou alterado com cada versão do analisador. Veja os detalhes em https://github.com/dotnet/roslyn-analyzers/blob/main/src/Microsoft.CodeAnalysis.Analyzers/ReleaseTrackingAnalyzers.Help.md.

# EnableAnalyzerReleaseTrackingRuleMessage
source: Enable analyzer release tracking for the analyzer project containing rule '{0}'
cs: Povolit sledování vydaných verzí analyzátoru pro projekt analyzátoru, který obsahuje pravidlo {0}
ja: 規則 '{0}' を含むアナライザー プロジェクトのアナライザー リリース追跡を有効にします
pt_br: Habilitar o acompanhamento de versão do analisador para o projeto do analisador que contém a regra '{0}'

# EnableAnalyzerReleaseTrackingRuleTitle
source: Enable analyzer release tracking
cs: Povolit sledování vydaných verzí analyzátoru
ja: アナライザー リリース追跡を有効にする
pt_br: Habilitar o acompanhamento de versão do analisador

# EnableConcurrentExecutionFix
source: Enable concurrent execution
cs: Povolit souběžné provádění
de: Gleichzeitige Ausführung aktivieren
fr: Activer l'exécution simultanée
ja: 同時実行を有効にします
ko: 동시 실행 사용
pt_br: Habilitar execução simultânea
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行

# EnableConcurrentExecutionMessage
source: Enable concurrent execution
cs: Povolit souběžné provádění
de: Gleichzeitige Ausführung aktivieren
fr: Activer l'exécution simultanée
ja: 同時実行を有効にします
ko: 동시 실행 사용
pt_br: Habilitar execução simultânea
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行

# EnableConcurrentExecutionTitle
source: Enable concurrent execution
cs: Povolit souběžné provádění
de: Gleichzeitige Ausführung aktivieren
fr: Activer l'exécution simultanée
ja: 同時実行を有効にします
ko: 동시 실행 사용
pt_br: Habilitar execução simultânea
tr: Eşzamanlı yürütmeyi etkinleştir
zh_hans: 启用并发执行

# InvalidEntryInAnalyzerReleasesFileRuleDescription
source: Invalid entry in analyzer release file.
cs: Neplatná položka v souboru vydané verze analyzátoru
ja: アナライザー リリース ファイルに無効なエントリがあります。
pt_br: Entrada inválida no arquivo de versão do analisador.

# InvalidEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an invalid entry '{1}'
cs: Soubor vydané verze analyzátoru {0} má neplatnou položku {1}.
pt_br: O arquivo de versão do analisador '{0}' tem uma entrada inválida '{1}'

# InvalidEntryInAnalyzerReleasesFileRuleTitle
source: Invalid entry in analyzer release file
cs: Neplatná položka v souboru vydané verze analyzátoru
pt_br: Entrada inválida no arquivo de versão do analisador

# InvalidHeaderInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has a missing or invalid release header '{1}'
cs: V souboru vydané verze analyzátoru {0} chybí nebo není platná hlavička vydané verze {1}.
pt_br: O arquivo de versão do analisador '{0}' tem um cabeçalho de versão inválido ou ausente '{1}'

source: Analyzer release file '{0}' has an invalid '{1}' entry without a prior shipped release for the rule '{2}'. Instead, add a separate '{1}' entry for the rule in unshipped release file.
cs: Soubor vydané verze analyzátoru {0} má neplatnou položku {1} bez dříve vydané verze pro pravidlo {2}. Místo ní přidejte samostatnou položku {1} pro pravidlo v nevydaném souboru verze.
ja: アナライザー リリース ファイル '{0}' に、前の出荷済みリリースが存在しない、ルール '{2}' の無効な '{1}' エントリがあります。代わりに、未出荷のリリース ファイルにそのルールの別個の '{1}' エントリを追加してください。
pt_br: O arquivo de versão do analisador '{0}' tem uma entrada '{1}' inválida sem uma versão anterior enviada para a regra '{2}'. Nesse caso, adicione uma entrada '{1}' separada para a regra no arquivo de versão não enviado.

# InvalidUndetectedEntryInAnalyzerReleasesFileRuleMessage
source: Analyzer release file '{0}' has an entry with one or more 'Undetected' fields that need to be manually filled in '{1}'
cs: Soubor vydané verze analyzátoru {0} má položku s nejméně jedním polem Undetected, které se v {1} musí vyplnit ručně.
pt_br: O arquivo de versão do analisador '{0}' tem uma entrada com um ou mais campos 'Não detectados' que precisam ser preenchidos manualmente em '{1}'

# MissingAttributeMessage
source: Missing '{0}' attribute
cs: Chybí atribut {0}.
pt_br: Atributo '{0}' ausente

# MissingDiagnosticAnalyzerAttributeTitle
source: Missing diagnostic analyzer attribute
cs: Chybí atribut diagnostického analyzátoru
pt_br: Atributo do analisador de diagnóstico ausente
