Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# UseLocalizableStringsInDescriptorMessage
source: Consider providing localizable arguments of type '{0}' to diagnostic descriptor constructor to ensure the descriptor is localizable.
de: Ziehen Sie die Bereitstellung lokalisierbarer Argumente vom Typ "{0}" für den Konstruktor des Diagnosedeskriptors in Betracht, um sicherzustellen, dass der Deskriptor lokalisierbar ist.
es: Considere proporcionar argumentos localizables de tipo “{0}” al constructor descriptor de diagnósticos para asegurarse de que el descriptor es localizable.
fr: Fournissez des arguments localisables de type '{0}' au constructeur de descripteur de diagnostic pour vérifier que le descripteur est localisable.
it: Provare a fornire argomenti localizzabili di tipo '{0}' al costruttore del descrittore di diagnostica per garantire che sia localizzabile.
ja: 診断記述子コンストラクターに型 '{0}' のローカライズ可能な引数を指定して記述子をローカライズ可能にすることを検討してください。
ko: '{0}' 형식의 현지화할 수 있는 인수를 진단 설명자 생성자에 제공하여 설명자를 현지화할 수 있는지 확인하세요.
tr: Tanımlayıcının yerelleştirilebilir olduğundan emin olmak için tanılama tanımlayıcısına '{0}' türünde yerelleştirilebilir bağımsız değişkenler sağlamayı düşünün.
zh_hans: 请考虑为诊断描述符构造函数提供类型“{0}”的可本地化参数，以确保描述符可本地化。

# UseLocalizableStringsInDescriptorTitle
source: Provide localizable arguments to diagnostic descriptor constructor.
de: Stellen Sie dem Konstruktor des Diagnosedeskriptors lokalisierbare Argumente bereit.
es: Proporcione argumentos localizables al constructor descriptor de diagnósticos.
fr: Fournissez des arguments localisables au constructeur de descripteur de diagnostic.
it: Fornire argomenti localizzabili al costruttore del descrittore di diagnostica.
ja: 診断記述子コンストラクターにローカライズ可能な引数を指定します。
ko: 현지화할 수 있는 인수를 진단 설명자 생성자에 제공하세요.
tr: Tanılama tanımlayıcı oluşturucusuna yerelleştirilebilir bağımsız değişkenler sağlayın.
zh_hans: 为诊断描述符构造函数提供可本地化的参数。

# DoNotStorePerCompilationDataOntoFieldsMessage
source: Avoid storing per-compilation data of type '{0}' into the fields of a diagnostic analyzer.
de: Vermeiden Sie die Speicherung kompilierungsbezogener Daten des Typs "{0}" in den Feldern eines Diagnoseanalysetools.
es: Evite almacenar datos por compilación de tipo “{0}” en los campos de un analizador de diagnóstico.
fr: Évitez de stocker des données par compilation de type '{0}' dans les champs d'un analyseur de diagnostic.
it: Evitare di archiviare dati per compilazione di tipo '{0}' nei campi di un analizzatore di diagnostica.
ja: コンパイルごとの型 '{0}' のデータを診断アナライザーのフィールドに格納しないようにしてください。
ko: '{0}' 형식의 컴파일당 데이터를 진단 분석기의 필드에 저장하지 마세요.
tr: Tanılama çözümleyicisinin alanlarına '{0}' türünde derleme başına veriler depolamaktan kaçının.
zh_hans: 不要将类型为“{0}”的每次编译的数据存储到诊断分析器的字段中。

# DoNotStorePerCompilationDataOntoFieldsTitle
source: Avoid storing per-compilation data into the fields of a diagnostic analyzer.
de: Vermeiden Sie die Speicherung kompilierungsbezogener Daten in den Feldern eines Diagnoseanalysetools.
es: Evite almacenar datos por compilación en los campos de un analizador de diagnóstico.
fr: Évitez de stocker des données par compilation dans les champs d'un analyseur de diagnostic.
it: Evitare di archiviare dati per compilazione nei campi di un analizzatore di diagnostica.
ja: コンパイルごとのデータを診断アナライザーのフィールドに格納しないようにします。
ko: 컴파일당 데이터를 진단 분석기의 필드에 저장하지 마세요.
tr: Tanılama çözümleyicisinin alanlarına derleme başına veriler depolamaktan kaçının.
zh_hans: 不要将每次编译的数据存储到诊断分析器的字段中。

# InternalImplementationOnlyMessage
source: Type {0} cannot implement interface {1} because {1} is not available for public implementation.
de: Der Typ "{0}" kann die Schnittstelle "{1}" nicht implementieren, weil "{1}" für die öffentliche Implementierung nicht zur Verfügung steht.
es: El tipo {0} no puede implementar la interfaz {1} porque {1} no está disponible para la implementación pública.
fr: Le type {0} ne peut pas implémenter l'interface {1}, car {1} n'est pas disponible pour une implémentation publique.
it: Il tipo {0} non può implementare l'interfaccia {1} perché {1} non è disponibile per l'implementazione pubblica.
ja: 型 {0} はインターフェイス {1} を実装できません。{1} は公開実装に使用できません。
ko: {1}을(를) 공용 구현할 수 없으므로 {0} 형식은 {1} 인터페이스를 구현할 수 없습니다.
tr: {1} genel uygulama için kullanılabilir olmadığından, {0} {1} arabirimini uygulayamıyor.
zh_hans: 类型 {0} 无法实现接口 {1}，因为 {1} 不适用于公共实现。

# InternalImplementationOnlyTitle
source: Only internal implementations of this interface are allowed.
de: Es sind nur interne Implementierungen dieser Schnittstelle zulässig.
es: Solo se permiten implementaciones internas de esta interfaz.
fr: Seules les implémentations internes de cette interface sont autorisées.
it: Sono consentite solo implementazioni interne di questa interfaccia.
ja: 許可されているのは、このインターフェイスの内部実装のみです。
ko: 이 인터페이스의 내부 구현만 허용됩니다.
tr: Yalnızca bu arabirimini iç uygulamalarına izin verilir.
zh_hans: 只允许此接口的内部实现。

# CreateCodeActionWithEquivalenceKeyMessage
source: Provide an explicit argument for optional parameter '{0}', which is non-null and unique for each kind of code action created by this fixer.
de: Geben Sie ein explizites Argument für den optionalen Parameter "{0}" an, das nicht NULL und für jede Art von durch diese Korrektur erstellten Aktionen eindeutig ist.
fr: Fournissez un argument explicite pour le paramètre optionnel '{0}', qui soit non-Null et unique pour chaque genre d'action de code créée par ce correcteur.
ja: 省略可能なパラメーター '{0}' に明示的な引数を指定してください。この引数は、null ではなく、この修正ツールによって作成された各種類のコード アクション内で一意です。
ko: 이 수정 도구에서 만들어진 각 종류의 코드 작업에 대해 고유하고 null이 아닌 선택적 매개 변수 '{0}'에 대한 명시적 인수를 제공하세요.
tr: İsteğe bağlı '{0}' parametresi için, null olmayan ve bu düzeltici tarafından oluşturulan her kod eylemi için benzersiz olan bir açık bağımsız değişken sağlayın.
zh_hans: 为可选形参“{0}”提供一个显式实参，该形参对于此修复程序创建的各种代码操作均为非 null 且是唯一的。

# CreateCodeActionWithEquivalenceKeyTitle
source: Create code actions should have a unique EquivalenceKey for FixAll occurrences support.
de: Aktionen zum Erstellen von Code müssen einen eindeutigen EquivalenceKey aufweisen, um die Korrektur aller Vorkommen zu unterstützen.
es: Las acciones de creación de código deben tener un elemento EquivalenceKey único para admitir las repeticiones de FixAll.
fr: Les actions de code créées doivent avoir un EquivalenceKey unique pour la prise en charge des occurrences de FixAll.
it: Le azioni codice create devono includere un elemento EquivalenceKey univoco per il supporto delle occorrenze di FixAll.
ja: コードの作成アクションには、FixAll の出現箇所をサポートするために、一意の EquivalenceKey が必要です。
ko: 코드 만들기 작업에는 FixAll 발생 지원을 위한 고유 EquivalenceKey가 있어야 합니다.
tr: Kod oluşturma eylemlerinin FixAll olayları desteği için benzersiz bir EquivalenceKey’e sahip olması gerekir.
zh_hans: 创建代码操作应具备 FixAll 事件支持的唯一 EquivalenceKey。

# OverrideCodeActionEquivalenceKeyTitle
source: Use code actions that have a unique EquivalenceKey for FixAll occurrences support.
de: Verwenden Sie Codeaktionen mit einem eindeutigen EquivalenceKey, um die Korrektur aller Vorkommen zu unterstützen.
es: Use acciones de código con un elemento EquivalenceKey único para admitir las repeticiones de FixAll.
fr: Utilisez les actions de code ayant un EquivalenceKey unique pour la prise en charge des occurrences de FixAll.
it: Usare azioni codice con un elemento EquivalenceKey univoco per il supporto delle occorrenze di FixAll.
ja: FixAll の出現箇所をサポートするために、一意の EquivalenceKey を持つコード アクションを使用します。
ko: FixAll 발생 지원을 위한 고유 EquivalenceKey가 있는 코드 작업을 사용하세요.
tr: FixAll olayları desteği için benzersiz bir EquivalenceKey’e sahip kod eylemleri kullanın.
zh_hans: 使用具备 FixAll 事件支持的唯一 EquivalenceKey 的代码操作。

# DoNotIgnoreReturnValueOnImmutableObjectMethodInvocationTitle
source: Do not ignore values returned by methods on immutable objects.
de: Keine von Methoden zu unveränderlichen Objekten zurückgegebenen Werte ignorieren
es: No omitir los valores devueltos por métodos en objetos inmutables.
fr: N'ignorez pas les valeurs retournées par les méthodes sur les objets non modifiables.
it: Non ignorare i valori restituiti dai metodi su oggetti non modificabili.
ja: 不変オブジェクトのメソッドによって返される値を無視しないでください。
ko: 변경할 수 없는 개체의 메서드에서 반환된 값을 무시하지 마세요.
tr: Sabit nesneler üzerinde yöntemler tarafından döndürülen değerleri yoksaymayın.
zh_hans: 不要忽略通过不可变对象上的方法返回的值。

# OverrideGetFixAllProviderTitle
source: Code fix providers should provide FixAll support.
de: CodeFixProvider sollte FixAll-Unterstützung bereitstellen.
fr: Les fournisseurs de correctifs de code doivent prendre en charge FixAll.
ja: コード修正プログラム プロバイダーは、FixAll サポートを提供する必要があります。
ko: 코드 수정 사항 공급자가 FixAll 지원을 제공해야 합니다.
tr: Kod düzeltme sağlayıcıları FixAll desteği sağlamalıdır.
zh_hans: 代码修复提供程序应提供 FixAll 支持。

# OverrideGetFixAllProviderDescription
source: A CodeFixProvider should provide FixAll support to enable users to fix multiple instances of the underlying diagnostic with a single code fix. See documenation at https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md for further details.
de: Ein CodeFixProvider sollte FixAll-Unterstützung bereitstellen, um mehrere Instanzen der zugrunde liegenden Diagnose mit einer einzigen Codefehlerbehebung zu korrigieren. Weitere Informationen finden Sie in der Dokumentation unter https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md.
fr: Un CodeFixProvider doit prendre en charge de FixAll pour permettre aux utilisateurs de corriger plusieurs instances du diagnostic sous-jacent avec un seul correctif de code. Pour plus de détails, consultez la documentation à l'adresse https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md.
ja: CodeFixProvider はユーザーが基本となる診断の複数のインスタンスを 1 つのコード修正プログラムで修正できるようにするために、FixAll サポートを提供する必要があります。詳細については、https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md をご覧ください。
ko: 사용자가 단일 코드 수정 사항을 사용하여 기본 진단의 여러 인스턴스를 수정할 수 있도록 하려면 CodeFixProvider가 FixAll 지원을 제공해야 합니다. 자세한 내용은 https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md에 있는 문서를 참조하세요.
tr: CodeFixProvider, kullanıcıların tek bir kod düzeltmesiyle temel tanılamanın birden çok örneğini düzeltebilmesi için FixAll desteği sağlamalıdır. Daha fazla ayrıntı için https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md adresindeki belgelere bakın.
zh_hans: CodeFixProvider 应提供 FixAll 支持，以允许用户通过单个代码修补程序修复基础诊断的多个实例。有关更多详细信息，请参阅 https://github.com/dotnet/roslyn/blob/master/docs/analyzers/FixAllProvider.md 中的文档。

# ProvideHelpUriInDescriptorMessage
source: Consider providing a non-null 'helpLinkUri' to diagnostic descriptor constructor to show information when this diagnostic appears in the error list.
de: Erwägen Sie die Bereitstellung eines "helpLinkUri" ungleich NULL zum Konstruktor des Diagnosedeskriptors, um Informationen anzuzeigen, wenn diese Diagnose in der Fehlerliste erscheint.
fr: Envisagez de fournir un 'helpLinkUri' non-null au constructeur du descripteur de diagnostic pour afficher des informations quand ce diagnostic apparaît dans la liste des erreurs.
ja: この診断がエラー一覧に表示されたときに情報を表示するために、NULL 以外の 'helpLinkUri' を診断記述子コンストラクターに提供することをご検討ください。
ko: null이 아닌 'helpLinkUri'를 진단 설명자 생성자에 제공하여 이 진단이 오류 목록에 표시될 때 정보를 표시하세요.
tr: Bu tanılama hata listesinde görüntülendiğinde bilgileri sağlamak için tanılama açıklayıcısı oluşturucusuna null olmayan bir 'helpLinkUri' sağlamayı düşünün.
zh_hans: 请考虑向诊断描述符构造函数提供一个非 null 型 "helpLinkUri"，以在错误列表中出现该诊断时显示信息。

# ProvideHelpUriInDescriptorTitle
source: Provide non-null 'helpLinkUri' value to diagnostic descriptor constructor.
de: Geben Sie einen helpLinkUri-Wert ungleich NULL zum Konstruktor des Diagnosedeskriptors an.
fr: Fournissez une valeur "helpLinkUri" non-null au constructeur du descripteur de diagnostic.
ja: NULL 以外の 'helpLinkUri' 値を診断記述子コンストラクターに提供します。
ko: null이 아닌 'helpLinkUri' 값을 진단 설명자 생성자에 제공하세요.
tr: Tanılama açıklayıcısı oluşturucusuna null olmayan 'helpLinkUri' değeri sağlayın.
zh_hans: 向诊断描述符构造函数提供非 null 型 "helpLinkUri" 值。

# DiagnosticIdMustBeInSpecifiedFormatTitle
source: DiagnosticId for analyzers must be in specified format.
de: Die DiagnosticId für das Analysetool muss im angegebenen Format vorliegen.
fr: Le DiagnosticId pour les analyseurs doit être au format spécifié.
ja: アナライザーの診断 ID は、指定された形式に準拠している必要があります。
ko: 분석기에 대한 진단 ID는 지정된 형식이어야 합니다.
tr: Çözümleyiciler için DiagnosticId belirtilen biçimde olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为指定格式。

# DiagnosticIdMustBeInSpecifiedFormatMessage
source: Diagnostic Id '{0}' belonging to category '{1}' is not in the required range and/or format '{2}' specified in the file '{3}'.
de: Die Diagnose-ID "{0}" der Kategorie "{1}" liegt nicht im erforderliche Bereich und/oder weist nicht das in der Datei "{3}" angegebene Format "{2}" auf.
fr: L'ID de diagnostic '{0}' appartenant à la catégorie '{1}' n'est pas dans la plage et/ou au format '{2}' exigé spécifié dans le fichier '{3}'.
ja: カテゴリ '{1}' に属している診断 ID '{0}' は必要な範囲にないか、ファイル '{3}' で指定されている形式 '{2}' でないか、その両方です。
ko: 범주 '{1}'에 속하는 진단 ID '{0}'이(가) 필요한 범위 내에 있지 않고/않거나 '{3}' 파일에 지정된 '{2}' 형식이 아닙니다.
tr: '{1}' kategorisine ait '{0}' tanılama kimliği, '{3}' dosyasında belirtilen gerekli '{2}' aralığında ve/veya biçiminde değil.
zh_hans: 属于类别“{1}”的诊断 Id“{0}”不符合文件“{3}”中指定的要求范围和/或格式“{2}”。

# UseUniqueDiagnosticIdTitle
source: DiagnosticId must be unique across analyzers.
de: Die DiagnosticId muss für jedes Analysetool eindeutig sein.
fr: Le DiagnosticId doit être unique sur l'ensemble des analyseurs.
ja: 診断 ID は、アナライザーをまたいで一意である必要があります。
ko: 진단 ID는 분석기 간에 고유해야 합니다.
tr: DiagnosticId çözümleyiciler arasında benzersiz olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须唯一。

# UseCategoriesFromSpecifiedRangeTitle
source: Category for analyzers must be from the specified values.
de: Die Kategorie für Analysetools muss einem der angegebenen Werte entsprechen.
fr: La catégorie pour les analyseurs doit provenir des valeurs spécifiées.
ja: アナライザーのカテゴリは、指定された値からのものである必要があります。
ko: 분석기에 대한 범주는 지정된 값이어야 합니다.
tr: Çözümleyiciler için kategori belirtilen değerlerden biri olmalıdır.
zh_hans: 分析器的类别必须源自指定的值。

# UseCategoriesFromSpecifiedRangeMessage
source: Category '{0}' is not from the allowed categories specified in the file '{1}'.
de: Die Kategorie "{0}" ist nicht in den zulässigen Kategorien enthalten, die in der Datei "{1}" angegeben sind.
fr: La catégorie '{0}' ne provient pas des catégories autorisées spécifiées dans le fichier '{1}'.
ja: カテゴリ '{0}' は、ファイル '{1}' で指定された、許可されたカテゴリからのものではありません。
ko: 범주 '{0}'이(가) '{1}' 파일에 지정된 허용되는 범주가 아닙니다.
tr: '{0}' kategorisi '{1}' dosyasında belirtilen izin verilen kategoriler arasında değil.
zh_hans: 类别“{0}”不属于文件“{1}”中指定的允许类别

# AnalyzerCategoryAndIdRangeFileInvalidTitle
source: Invalid entry in analyzer category and diagnostic ID range specification file.
de: Ungültiger Eintrag in der Spezifikationsdatei für Kategorien und Diagnose-ID-Bereich der Analysetools.
fr: Entrée non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic.
ja: アナライザーのカテゴリと診断 ID 範囲の指定ファイルのエントリが無効です。
ko: 분석기 범주 및 진단 ID 범위 지정 파일의 항목이 잘못되었습니다.
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasında geçersiz girdi.
zh_hans: 分析器类别和诊断 ID 范围规定文件中的条目无效。

# AnalyzerCategoryAndIdRangeFileInvalidMessage
source: Invalid entry '{0}' in analyzer category and diagnostic ID range specification file '{1}'.
de: Ungültiger Eintrag "{0}" in der Spezifikationsdatei "{1}" für Kategorien und Diagnose-ID-Bereich der Analysetools.
fr: Entrée '{0}' non valide dans le fichier de spécification de la catégorie de l'analyseur et de la plage d'ID de diagnostic '{1}'.
ja: アナライザーのカテゴリと診断 ID 範囲の指定ファイル '{1}' のエントリ '{0}' が無効です。
ko: 분석기 범주 및 진단 ID 범위 지정 파일 '{1}'의 항목 '{0}'이(가) 잘못되었습니다.
tr: Çözümleyici kategorisi ve tanılama kimliği aralık belirtimi dosyasında ('{1}') geçersiz '{0}' girdisi.
zh_hans: 分析器类别和诊断 ID 范围规定文件“{1}”中的条目“{0}”无效。

# DiagnosticIdMustBeAConstantTitle
source: DiagnosticId for analyzers must be a non-null constant.
de: Die DiagnosticId für Analysetools muss eine Konstante ungleich NULL sein.
fr: Le DiagnosticId pour les analyseurs doit être une constante non-null.
ja: アナライザーの診断 ID は、NULL 以外の定数である必要があります。
ko: 분석기에 대한 진단 ID는 null이 아닌 상수여야 합니다.
tr: Çözümleyiciler için DiagnosticId null olmayan bir sabit değer olmalıdır.
zh_hans: 分析器的 DiagnosticId 必须为非 null 常量。

# DiagnosticIdMustBeAConstantMessage
source: Diagnostic Id for rule '{0}' must be a non-null constant.
de: Die Diagnose-ID für die Regel "{0}" muss eine Konstant ungleich NULL sein.
fr: L'ID de diagnostic pour la règle '{0}' doit être une constante non-null.
ja: ルール '{0}' の診断 ID は、NULL 以外の定数である必要があります。
ko: 규칙 '{0}'에 대한 진단 ID는 null이 아닌 상수여야 합니다.
tr: '{0}' kuralı için DiagnosticId null olmayan bir sabit değer olmalıdır.
zh_hans: 规则“{0}”的诊断 ID 必须为非 null 常量。

# CompareSymbolsCorrectlyDescription
source: Symbols should be compared for equality with an EqualityComparer.
de: Symbole sollten hinsichtlich Gleichheit verglichen werden, nicht hinsichtlich Identität.
tr: Semboller kimlik değil eşitlik için karşılaştırılmalıdır.

# CodeActionNeedsEquivalenceKeyDescription
source: A CodeFixProvider that intends to support fix all occurrences must classify the registered code actions into equivalence classes by assigning it an explicit, non-null equivalence key which is unique across all registered code actions by this fixer. This enables the FixAllProvider to fix all diagnostics in the required scope by applying code actions from this fixer that are in the equivalence class of the trigger code action.
es: Un objeto CodeFixProvider destinado a reparar todas las repeticiones debe clasificar las acciones de código registradas en clases de equivalencia. Para ello, debe asignarles una clave de equivalencia explícita no NULL que es única en todas las acciones de código registradas por este reparador. Esto permite a FixAllProvider corregir todos los diagnósticos del ámbito requerido mediante la aplicación de acciones de código de este reparador que están en la clase de equivalencia de la acción de código desencadenador.
it: Un elemento CodeFixProvider che intende supportare la correzione di tutte le occorrenze deve classificare le azioni codice registrate nelle classi di equivalenza assegnando una chiave di equivalenza non Null che sia univoca in tutte le azioni codice registrate di questa utilità di correzione. In questo modo FixAllProvider potrà correggere tutte le diagnostiche nell'ambito richiesto applicando codici azioni di questa utilità di correzione che sono inclusi nella classe di equivalenza dell'azione codice di attivazione.

# CreateCodeActionWithEquivalenceKeyMessage
source: Provide an explicit argument for optional parameter '{0}', which is non-null and unique across all code actions created by this fixer.
es: Proporcione un argumento explícito para el parámetro “{0}” opcional, no NULL y único en todas las acciones de código creadas por este reparador.
it: Fornire un argomento esplicito per il parametro facoltativo '{0}', che sia non Null e univoco in tutte le azioni codice create da questa utilità di correzione.
