Repository: dotnet/roslyn
Catalog: src/Microsoft.CodeAnalysis.Analyzers/Core/xlf/CodeAnalysisDiagnosticsResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pt_br, tr, zh_hans

# MissingDiagnosticAnalyzerAttributeDescription
source: Non-abstract sub-types of DiagnosticAnalyzer should be marked with DiagnosticAnalyzerAttribute(s). The argument to this attribute(s), if any, determine the supported languages for the analyzer. Analyzer types without this attribute will be ignored by the analysis engine.
cs: Neabstraktní podtypy diagnostického analyzátoru musí být označeny atributy DiagnosticAnalyzerAttribute. Argument těchto atributů, pokud existuje, určuje podporované jazyky analyzátoru. Modul analýzy bude typy analyzátoru s tímto atributem ignorovat.
de: Nicht abstrakte Untertypen von DiagnosticAnalyzer müssen mit "DiagnosticAnalyzerAttribute(s)" markiert werden. Das Argument für diese Attribute, falls vorhanden, legt die unterstützten Sprachen für die Analyse fest. Analysetypen ohne dieses Attribut werden von der Analyse-Engine ignoriert.
es: Los subtipos no abstractos de DiagnosticAnalyzer deben marcarse con el atributo DiagnosticAnalyzerAttribute. El argumento de estos atributos, si lo hay, determina los lenguajes admitidos para el analizador. El motor de análisis omite los tipos de analizador sin este atributo.
fr: Les sous-types non abstraits de DiagnosticAnalyzer doivent être marqués avec DiagnosticAnalyzerAttribute(s). L'argument de cet attribut (ou de ces attributs), le cas échéant, détermine les langages pris en charge pour l'analyseur. Les types de l'analyseur qui n'ont pas cet attribut sont ignorés par le moteur d'analyse.
it: I sottotipi non astratti di dell'analizzatore DiagnosticAnalyzer devono essere contrassegnati con uno o più elementi DiagnosticAnalyzerAttribute. L'eventuale argomento di questi attributi determina le lingue supportate per l'analizzatore. I tipi di analizzatore senza questo attributo verranno ignorati dal motore di analisi.
ja: DiagnosticAnalyzer の非抽象サブ型は、DiagnosticAnalyzerAttribute でマークする必要があります。この属性の引数が存在する場合は、アナライザーでサポートされる言語が決まります。この属性を持たないアナライザーの種類は、分析エンジンに無視されます。
ko: DiagnosticAnalyzer의 비추상 하위 형식은 DiagnosticAnalyzerAttribute로 표시되어야 합니다. 이 특성에 대한 인수가 있는 경우 해당 인수가 분석기에 지원되는 언어를 결정합니다. 이 특성이 없는 분석기 형식은 분석 엔진에 의해 무시됩니다.
pt_br: Subtipos não abstratos de DiagnosticAnalyzer devem ser marcados com DiagnosticAnalyzerAttribute(s). O argumento para estes atributos, se houver, determina as linguagens com suporte para o analisador. Os tipos de analisador sem este atributo serão ignorados pelo mecanismo de análise.
tr: Soyut olmayan DiagnosticAnalyzer alt türleri DiagnosticAnalyzerAttribute(s) ile işaretlenmelidir. Bu özniteliklerin bağımsız değişkenleri, varsa, çözümleyici için desteklenen dilleri belirler. Bu özniteliğe sahip olmayan çözümleyici türleri çözümleme altyapısı tarafından yoksayılır.
zh_hans: DiagnosticAnalyzer 的非抽象子类型应使用 DiagnosticAnalyzerAttribute 标记。此特性的参数；如果有，则可确定分析器支持的语言。分析引擎将忽略未带此特性的分析器类型。

# AddLanguageSupportToAnalyzerMessage
source: Diagnostic analyzer '{0}' may be able to support both C# and Visual Basic. Consider adding an argument to DiagnosticAnalyzerAttribute for '{1}' language support.
cs: Je možné, že diagnostický analyzátor {0} bude podporovat jak C#, tak i Visual Basic. Zvažte přidání argumentu do atributu DiagnosticAnalyzerAttribute, aby bylo možné podporovat jazyk {1}.
de: Das Diagnoseanalysetool "{0}" kann möglicherweise sowohl C# als auch Visual Basic unterstützen. Ziehen Sie in Betracht, DiagnosticAnalyzerAttribute ein Argument für die Sprachunterstützung "{1}" hinzuzufügen.
es: El analizador de diagnóstico “{0}” admite tanto C# como Visual Basic. Considere agregar un argumento a DiagnosticAnalyzerAttribute para la compatibilidad con el lenguaje de “{1}”.
fr: L'analyseur de diagnostic '{0}' peut prendre en charge C# et Visual Basic. Ajoutez un argument à DiagnosticAnalyzerAttribute pour la prise en charge du langage '{1}'.
it: L'analizzatore di diagnostica '{0}' potrebbe riuscire a supportare sia C# che Visual Basic. Provare ad aggiungere a DiagnosticAnalyzerAttribute un argomento per includere il supporto per la lingua '{1}'.
ja: 診断アナライザー '{0}' は、C# と Visual Basic の両方をサポートできる場合があります。'{1}' 言語をサポートするために、DiagnosticAnalyzerAttribute に引数を追加することを検討してください。
ko: '{0}' 진단 분석기는 C# 및 Visual Basic을 모두 지원할 수 있습니다. '{1}' 언어 지원을 위해 DiagnosticAnalyzerAttribute에 대한 인수를 추가하세요.
pt_br: Talvez o analisador de diagnóstico '{0}' possa dar suporte a C# e a Visual Basic. Considere adicionar um argumento a DiagnosticAnalyzerAttribute para obter suporte à linguagem '{1}'.
tr: Tanılama çözümleyicisi '{0}' hem C# hem de Visual Basic’i destekleyebilir. '{1}' dil desteği için DiagnosticAnalyzerAttribute’a bir bağımsız değişken eklemeyi düşünün.
zh_hans: 诊断分析器“{0}”可能可以支持 C# 和 Visual Basic。请考虑向“{1}”语言支持的 DiagnosticAnalyzerAttribute 添加一个参数。

# AddLanguageSupportToAnalyzerTitle
source: Recommend adding language support to diagnostic analyzer
cs: Do diagnostického analyzátoru doporučujeme přidat podporu jazyků
pt_br: Recomende adicionar suporte à linguagem ao analisador de diagnóstico

# AddLanguageSupportToAnalyzerDescription
source: Diagnostic analyzer is marked as supporting only one language, but the analyzer assembly doesn't seem to refer to any language specific CodeAnalysis assemblies, and so is likely to work for more than one language. Consider adding an additional language argument to DiagnosticAnalyzerAttribute.
cs: Diagnostický analyzátor má podporovat pouze jeden jazyk, ale sestavení analyzátoru podle všeho neodkazuje na žádná sestavení CodeAnalysis pro konkrétní jazyk, a tak pravděpodobně bude fungovat pro více jazyků. Zvažte přidání argumentu pro další jazyk do atributu DiagnosticAnalyzerAttribute.
de: Das Diagnoseanalysetool ist für die Unterstützung von nur einer Sprache markiert, die Analyseassembly verweist jedoch offenbar auf keine sprachspezifischen CodeAnalysis-Assemblys und funktioniert daher wahrscheinlich für mehrere Sprachen. Ziehen Sie in Betracht, DiagnosticAnalyzerAttribute ein weiteres Sprachargument hinzuzufügen.
es: El analizador de diagnóstico está marcado como compatible con un solo lenguaje, pero el ensamblado del analizador no parece hacer referencia a ningún ensamblado CodeAnalysis específico de un lenguaje, por lo que es posible que funcione para más de un lenguaje. Considere agregar un argumento de lenguaje adicional a DiagnosticAnalyzerAttribute.
fr: Il est indiqué que l'analyseur de diagnostic prend en charge un seul langage. Toutefois, l'assembly de l'analyseur ne semble pas faire référence à des assemblys CodeAnalysis spécifiques à un langage. Il est donc susceptible de fonctionner pour plusieurs langages. Ajoutez un argument de langage supplémentaire à DiagnosticAnalyzerAttribute.
it: L'analizzatore di diagnostica è contrassegnato in modo da supportare una sola lingua, ma l'assembly dell'analizzatore non sembra fare riferimento ad alcun assembly CodeAnalysis specifico della lingua, di conseguenza è probabile che funziono per più lingue. Provare ad aggiungere a DiagnosticAnalyzerAttribute un argomento per una lingua aggiuntiva.
ja: 診断アナライザーは、1 つの言語のみをサポートするように設定されていますが、アナライザー アセンブリは言語固有の CodeAnalysis アセンブリを参照しないようです。そのため、複数の言語で動作する可能性があります。DiagnosticAnalyzerAttribute に言語引数をさらに追加することを検討してください。
ko: 진단 분석기는 1개의 언어만 지원하는 것으로 표시되지만, 분석기 어셈블리가 언어 특정 CodeAnalysis 어셈블리를 참조하지 않는 것으로 보이므로 2개 이상의 언어로 작업할 가능성이 있습니다. DiagnosticAnalyzerAttribute에 언어 인수를 추가하세요.
pt_br: O analisador de diagnóstico é marcado como dando suporte a apenas uma linguagem, mas o assembly do analisador não parece referenciar nenhum assembly CodeAnalysis específico a uma linguagem e, portanto, é provável que ele funcione para mais de uma linguagem. Considere adicionar um argumento de linguagem adicional a DiagnosticAnalyzerAttribute.
tr: Tanılama çözümleyicisi yalnızca bir dili destekliyor olarak işaretlenmiş ancak çözümleyici bütünleştirilmiş kodu herhangi bir dile özgü CodeAnalysis bütünleştirilmiş koduna başvuruyor gibi görünmediğinden birden çok dil için çalışması olasıdır. DiagnosticAnalyzerAttribute’a bir ek dil bağımsız değişkeni eklemeyi düşünün.
zh_hans: 诊断分析器标记为仅支持一种语言，但分析器程序集貌似未引用语言特定的任何 CodeAnalysis 程序集，因此可能会适用于多种语言。请考虑向 DiagnosticAnalyzerAttribute 添加其他语言参数。

# ApplyDiagnosticAnalyzerAttribute_1
source: Apply DiagnosticAnalyzer attribute for '{0}'.
cs: Použijte atribut DiagnosticAnalyzer pro {0}.
de: Wenden Sie das DiagnosticAnalyzer-Attribut für "{0}" an.
es: Aplique el atributo DiagnosticAnalyzer para “{0}”.
fr: Appliquez l'attribut DiagnosticAnalyzer pour '{0}'.
it: Applicare l'attributo DiagnosticAnalyzer per '{0}'.
ja: '{0}' に DiagnosticAnalyzer 属性を適用します。
ko: '{0}'에 대한 DiagnosticAnalyzer 특성을 적용하세요.
pt_br: Aplique o atributo DiagnosticAnalyzer para '{0}'.
tr: '{0}' için DiagnosticAnalyzer özniteliğini uygulayın.
zh_hans: 为“{0}”应用 DiagnosticAnalyzer 特性。

# ApplyDiagnosticAnalyzerAttribute_2
source: Apply DiagnosticAnalyzer attribute for both '{0}' and '{1}'.
cs: Použijte atribut DiagnosticAnalyzer jak pro {0}, tak i pro {1}.
de: Wenden Sie das DiagnosticAnalyzer-Attribut sowohl für "{0}" als auch für "{1}" an.
es: Aplique el atributo DiagnosticAnalyzer para “{0}” y “{1}”.
fr: Appliquez l'attribut DiagnosticAnalyzer pour '{0}' et '{1}'.
it: Applicare l'attributo DiagnosticAnalyzer sia per '{0}' che per '{1}'.
ja: '{0}' と '{1}' の両方に DiagnosticAnalyzer 属性を適用します。
ko: '{0}' 및 '{1}'에 대한 DiagnosticAnalyzer 특성을 적용하세요.
pt_br: Aplique o atributo DiagnosticAnalyzer para '{0}' e para '{1}'.
tr: Hem '{0}' hem de '{1}' için DiagnosticAnalyzer özniteliğini uygulayın.
zh_hans: 为“{0}”和“{1}”应用 DiagnosticAnalyzer 特性。

# MissingSymbolKindArgumentToRegisterActionMessage
source: Specify at least one SymbolKind of interest when registering a symbol analyzer action
cs: Při registraci akce analyzátoru symbolů zadejte minimálně jeden požadovaný SymbolKind.
pt_br: Especifique pelo menos um SymbolKind de interesse ao registrar uma ação de analisador de símbolo

# MissingSyntaxKindArgumentToRegisterActionMessage
source: Specify at least one SyntaxKind of interest when registering a syntax node analyzer action
cs: Při registraci akce analyzátoru uzlů syntaxe zadejte minimálně jeden požadovaný SyntaxKind.
pt_br: Especifique pelo menos um SyntaxKind de interesse ao registrar uma ação de analisador de nó de sintaxe

# MissingOperationKindArgumentToRegisterActionMessage
source: Specify at least one OperationKind of interest when registering an operation analyzer action
cs: Při registraci akce analyzátoru operací zadejte minimálně jeden požadovaný OperationKind.
pt_br: Especifique pelo menos um OperationKind de interesse ao registrar uma ação do analisador de operações

# MissingKindArgumentToRegisterActionTitle
source: Missing kind argument when registering an analyzer action
cs: Při registraci akce analyzátoru chybí argument druhu
pt_br: Argumento de variante ausente ao registrar uma ação do analisador

# MissingKindArgumentToRegisterActionDescription
source: You must specify at least one syntax, symbol or operation kind when registering a syntax, symbol, or operation analyzer action respectively. Otherwise, the registered action will never be invoked during analysis.
cs: Při registraci analyzátoru syntaxe, symbolů nebo operací musíte zadat minimálně jeden druh syntaxe, symbolu nebo operace. V opačném případě se registrovaná akce nikdy při analýze nevyvolá.
de: Sie müssen mindestens eine Variante für Syntax, Symbol oder Vorgang angeben, wenn Sie eine Syntax-, Symbol- oder Vorgangsanalyseaktion registrieren. Andernfalls wird die registrierte Aktion während der Analyse nicht aufgerufen.
es: Debe especificar al menos un tipo de sintaxis, símbolo u operación al registrar una acción del analizador de sintaxis, símbolos u operaciones respectivamente. De lo contrario, la acción registrada no se invocará nunca durante el análisis.
fr: Vous devez spécifier au moins un genre de syntaxe, de symbole ou d'opération au moment d'inscrire une action d'analyseur de syntaxe, de symbole ou d'opération. Sinon, l'action inscrite n'est jamais appelée durant l'analyse.
it: Quando si registra un'azione dell'analizzatore di sintassi, operazioni o simboli, è necessario specificare rispettivamente almeno un tipo di sintassi, operazione o simbolo. In caso contrario, l'azione registrata non verrà mai richiamata durante l'analisi.
ja: 構文、シンボル、または操作のアナライザー アクションをそれぞれ登録するときに、少なくとも 1 つの構文、シンボル、または操作の種類を指定する必要があります。そうしないと、登録済みのアクションは分析中に呼び出されません。
ko: 구문, 기호 또는 작업 분석기 작업을 각각 등록할 때 하나 이상의 구문, 기호 또는 작업 종류를 지정해야 합니다. 지정하지 않으면 등록된 작업이 분석하는 동안 호출되지 않습니다.
pt_br: É necessário especificar pelo menos um tipo de sintaxe, de símbolo ou de operação ao registrar uma ação de analisador de sintaxe, símbolo ou operação, respectivamente. Caso contrário, a ação registrada nunca será invocada durante a análise.
tr: Bir söz dizimi, sembol veya işlem çözümleyicisi eylemi eklerken en az bir söz dizimi, sembol veya işlem türü belirtmeniz gerekir. Aksi takdirde, kayıtlı eylem çözümleme sırasında hiçbir zaman çağrılmaz.
zh_hans: 分别注册语法、符号或操作分析器动作时，必须至少指定一种语法、符号或操作类型。否则，分析过程中将不会调用已注册的操作。

# NoSettingSpecifiedSymbolIsBannedInAnalyzersDescription
source: A project containing analyzers or source generators should specify the property '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'.
cs: Projekt obsahující analyzátory nebo zdrojové generátory by měl určovat vlastnost <EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>.
pt_br: Um projeto que contém analisadores ou geradores de origem deve especificar a propriedade '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'.

# NoSettingSpecifiedSymbolIsBannedInAnalyzersMessage
source: '{0}': A project containing analyzers or source generators should specify the property '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
cs: {0}: Projekt obsahující analyzátory nebo zdrojové generátory by měl určovat vlastnost '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'
pt_br: '{0}': um projeto que contém analisadores ou geradores de origem deve especificar a propriedade '<EnforceExtendedAnalyzerRules>true</EnforceExtendedAnalyzerRules>'

# NoSettingSpecifiedSymbolIsBannedInAnalyzersTitle
source: Specify analyzer banned API enforcement setting
cs: Zadat nastavení vynucení rozhraní API se zakázanými analyzátory
pt_br: Especificar a configuração de imposição de API banida pelo analisador

# PreferIsKindDescription
source: Prefer 'syntax.IsKind(kind)' to 'syntax.Kind() == kind' when checking syntax kinds. Code using 'IsKind' is slightly more efficient at runtime, so consistent use of this form where applicable helps improve performance in complex analysis scenarios.
cs: Při kontrole typů syntaxe upřednostňovat syntax.IsKind(kind) před syntax.Kind() == kind. Kód, který používá IsKind, je za běhu o něco efektivnější, proto konzistentní používání tohoto tvaru tam, kde je to možné, pomáhá zlepšit výkon ve scénářích komplexní analýzy.
pt_br: Preferir 'syntax.IsKind(kind)' em vez de 'syntax.Kind() == kind' ao verificar os tipos de sintaxe. O código que usa 'IsKind' é um pouco mais eficiente no runtime, portanto o uso consistente deste formulário, nas circunstâncias em que ele se aplica, ajuda a aprimorar o desempenho em cenários de análise complexos.

# PreferIsKindFix
source: Use 'IsKind' instead of 'Kind'
cs: Použijte IsKind místo Kind.
pt_br: Usar 'IsKind' em vez de 'Kind'

# PreferIsKindMessage
source: Prefer 'IsKind' for checking syntax kinds
cs: Při kontrole typů syntaxí upřednostňujte IsKind.
pt_br: Preferir 'IsKind' para verificar os tipos de sintaxe

# PreferIsKindTitle
source: Prefer 'IsKind' for checking syntax kinds
cs: Při kontrole typů syntaxí upřednostňovat IsKind
pt_br: Preferir 'IsKind' para verificar os tipos de sintaxe

# ProvideCustomTagsInDescriptorDescription
source: The 'customTags' value is used as a way to enable specific actions and filters on diagnostic descriptors based on the specific values of the tags. Every Roslyn analyzer should have at least one tag from the 'WellKnownDiagnosticTags' class.
cs: Hodnota customTags se používá jako způsob, jak povolit konkrétní akce a filtry v diagnostických popisovačích na základě konkrétních hodnot značek. Každý analyzátor Roslyn by měl mít alespoň jednu značku z třídy WellKnownDiagnosticTags.
ja: 'customTags' 値は、タグの特定の値に基づいて診断記述子に対して特定のアクションとフィルターを有効にする方法として使用されます。すべての Roslyn アナライザーには、'WellKnownDiagnosticTags' クラスのタグが少なくとも 1 つ必要です。
pt_br: O valor 'customTags' é usado como uma maneira de habilitar as ações e os filtros específicos nos descritores de diagnóstico com base nos valores específicos das marcas. Todo analisador de Roslyn deve ter pelo menos uma marca da classe 'WellKnownDiagnosticTags'.

# ProvideCustomTagsInDescriptorMessage
source: Consider providing a non-null 'customTags' to diagnostic descriptor constructor to enable metatada filtering of diagnostic descriptors
cs: Pokud chcete povolit filtrování metadat diagnostických popisovačů, zvažte poskytnutí nenulové hodnoty customTags pro konstruktor diagnostických popisovačů.
pt_br: Considere fornecer um 'customTags' não nulo ao construtor de descritor de diagnóstico para habilitar a filtragem de metadados de descritores de diagnóstico

# ProvideCustomTagsInDescriptorTitle
source: Provide non-null 'customTags' value to diagnostic descriptor constructor
cs: Poskytněte konstruktoru diagnostických popisovačů nenulovou hodnotu customTags
pt_br: Forneça um valor de 'customTags' não nulo para o construtor de descritor de diagnóstico

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleDescription
source: Remove duplicate entries for diagnostic ID between analyzer releases.
cs: Odebrat duplicitní položky pro ID diagnostiky mezi vydanými verzemi analyzátoru
ja: アナライザー リリース間で診断 ID の重複しているエントリを削除します。
pt_br: Remova as entradas duplicadas da ID de diagnóstico entre as versões do analisador.

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleMessage
source: Rule '{0}' has duplicate entry between release '{1}' and release '{2}'
cs: Pravidlo {0} má duplicitní položku mezi vydanými verzemi {1} a {2}.
pt_br: A regra '{0}' tem uma entrada duplicada entre a versão '{1}' e a versão '{2}'

# RemoveDuplicateEntriesBetweenAnalyzerReleasesRuleTitle
source: Remove duplicate entries for diagnostic ID between analyzer releases
cs: Odebrat duplicitní položky pro ID diagnostiky mezi vydanými verzemi analyzátoru
pt_br: Remova as entradas duplicadas da ID de diagnóstico entre as versões do analisador

# RemoveDuplicateEntriesForAnalyzerReleaseRuleDescription
source: Remove duplicate entries for diagnostic ID in the same analyzer release.
cs: Odebrat duplicitní položky pro ID diagnostiky ve stejné vydané verzi analyzátoru
ja: 同じアナライザー リリースで診断 ID の重複しているエントリを削除します。
pt_br: Remova as entradas duplicadas da ID de diagnóstico na mesma versão do analisador.

# RemoveDuplicateEntriesForAnalyzerReleaseRuleMessage
source: Rule '{0}' has more then one entry for release '{1}' in analyzer release file '{2}'
cs: Pravidlo {0} má více než jednu položku pro vydanou verzi {1} v souboru vydané verze analyzátoru {2}.
pt_br: A regra '{0}' tem mais de uma entrada para a versão '{1}' no arquivo de versão do analisador '{2}'

# RemoveDuplicateEntriesForAnalyzerReleaseRuleTitle
source: Remove duplicate entries for diagnostic ID in the same analyzer release
cs: Odebrat duplicitní položky pro ID diagnostiky ve stejné vydané verzi analyzátoru
pt_br: Remova as entradas duplicadas da ID de diagnóstico na mesma versão do analisador

# RemoveShippedDeletedDiagnosticIdDescription
source: Shipped diagnostic IDs that are no longer reported should have an entry in the 'Removed Rules' table in unshipped file.
cs: Vydaná ID diagnostiky, která se už neohlašují, by měla mít položku v tabulce Removed Rules v nevydaném souboru
ja: 報告されなくなった出荷済みの診断 ID には、未出荷ファイルの '削除されたルール' テーブルにエントリが必要です。
pt_br: As IDs de diagnóstico enviadas que não são mais relatadas devem ter uma entrada na tabela 'Regras Removidas' no arquivo não enviado.

# RemoveShippedDeletedDiagnosticIdMessage
source: Rule '{0}' was shipped in analyzer release '{1}', but is no longer a supported diagnostic for any analyzer. Add an entry for this rule in a 'Removed Rules' table to unshipped file.
cs: Pravidlo {0} se dodávalo ve vydané verzi analyzátoru {1}, ale už není podporovanou diagnostikou v žádném analyzátoru. Přidejte položku pro toto pravidlo do tabulky Removed Rules nevydaného souboru.
ja: ルール '{0}' はアナライザー リリース '{1}' で出荷されましたが、アナライザーに対してサポートされる診断ではなくなりました。未出荷のファイルに対して、このルールのエントリを '削除されたルール' テーブルに追加してください。
pt_br: A regra '{0}' foi enviada na versão do analisador '{1}', mas não é mais um diagnóstico compatível com nenhum analisador. Adicione uma entrada para essa regra em uma tabela 'Regras Removidas' ao arquivo não enviado.

# RemoveShippedDeletedDiagnosticIdTitle
source: Shipped diagnostic IDs that are no longer reported should have an entry in the 'Removed Rules' table in unshipped file
cs: Vydaná ID diagnostiky, která se už neohlašují, by měla mít položku v tabulce Removed Rules v nevydaném souboru
pt_br: As IDs de diagnóstico enviadas que não são mais relatadas devem ter uma entrada na tabela 'Regras Removidas' no arquivo não enviado

# RemoveUnshippedDeletedDiagnosticIdDescription
source: Entries for analyzer diagnostic IDs that are no longer reported and never shipped can be removed from unshipped analyzer release.
cs: Položky pro ID diagnostiky analyzátoru, které se už neohlašují a nedodávají se, se dají odebrat z nevydané verze analyzátoru.
ja: 報告されなくなり、出荷されたことのないアナライザー診断 ID のエントリは、未出荷のアナライザー リリースから削除できます。
pt_br: As entradas das IDs de diagnóstico do analisador que não são mais relatadas e nunca são enviadas podem ser removidas da versão do analisador não enviada.

# RemoveUnshippedDeletedDiagnosticIdMessage
source: Rule '{0}' is part of the next unshipped analyzer release, but is not a supported diagnostic for any analyzer
cs: Pravidlo {0} je součástí další nevydané verze analyzátoru, ale není podporovanou diagnostikou žádného analyzátoru.
pt_br: A regra '{0}' faz parte da próxima versão do analisador não enviada, mas não é um diagnóstico compatível com nenhum analisador

# RemoveUnshippedDeletedDiagnosticIdTitle
source: Do not add removed analyzer diagnostic IDs to unshipped analyzer release
cs: Nepřidávat odebraná ID diagnostiky analyzátoru do nevydané verze analyzátoru
pt_br: Não adicione as IDs de diagnóstico do analisador removidas à versão do analisador não enviada

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullDescription
source: Calling 'SemanticModel.GetDeclaredSymbol' with on certain types inheriting from 'SyntaxNode', for example 'GlobalStatementSyntax' and 'IncompleteMemberSyntax' will always return 'null'.
cs: Volání SemanticModel.GetDeclaredSymbol s určitými typy děděnými z SyntaxNode, například GlobalStatementSyntax a IncompleteMemberSyntax, vždy vrátí null.
pt_br: Chamar “SemanticModel.GetDeclaredSymbol” em determinados tipos herdados de “SyntaxNode”, por exemplo, “GlobalStatementSyntax” e “IncompleteMemberSyntax” sempre retornará “null”.

# SemanticModelGetDeclaredSymbolAlwaysReturnsNullForFieldDescription
source: Calling 'SemanticModel.GetDeclaredSymbol' with an argument of type 'FieldDeclarationSyntax' or 'EventFieldDeclarationSyntax' will always return 'null'. Call 'GetDeclaredSymbol' with the variable declarators from the field instead.
cs: Volání SemanticModel.GetDeclaredSymbol s argumentem typu FieldDeclarationSyntax nebo EventFieldDeclarationSyntax vždy vrátí null. Místo toho volejte GetDeclaredSymbol s deklarátory proměnných z pole.
pt_br: Chamar “SemanticModel.GetDeclaredSymbol” com um argumento do tipo “FieldDeclarationSyntax” ou “EventFieldDeclarationSyntax” sempre retornará “null”. Em vez disso, chame “GetDeclaredSymbol” com os declaradores de variável do campo.
