Repository: dotnet/roslyn
Catalog: src/Tools/ExternalAccess/FSharp/xlf/ExternalAccessFSharpResources.*.xlf
Languages: cs, es, ja, pt_br, ru, tr, zh_hans, zh_hant

# AddAssemblyReference
source: Add an assembly reference to '{0}'
cs: Přidat odkaz na sestavení do {0}
es: Agregar una referencia de ensamblado a "{0}"
ja: アセンブリ参照を '{0}' に追加します
pt_br: Adicionar uma referência de assembly a '{0}'
ru: Добавить ссылку на сборку в "{0}"
tr: '{0}' öğesine bir derleme başvurusu ekle
zh_hans: 将程序集引用添加到 "{0}"
zh_hant: 將元件參考新增到 '{0}'

source: Add 'new' keyword
cs: Přidat klíčové slovo new
es: Agregar la palabra clave "new"
ja: 'new' キーワードの追加
pt_br: Adicionar a palavra-chave 'new'
ru: Добавить ключевое слово "new"
tr: 'new' anahtar sözcüğünü ekle
zh_hans: 添加 "new" 关键字
zh_hant: 新增 'new' 關鍵字

# AddProjectReference
source: Add a project reference to '{0}'
cs: Přidat odkaz na projekt do {0}
es: Agregar una referencia de proyecto a "{0}"
ja: プロジェクト参照を '{0}' に追加します
pt_br: Adicionar uma referência de projeto a '{0}'
ru: Добавить ссылку на проект в "{0}"
tr: '{0}' öğesine proje başvurusu ekle
zh_hans: 将项目引用添加到 "{0}"
zh_hant: 新專案參考新增到 '{0}'

# CannotDetermineSymbol
source: Cannot determine the symbol under the caret
cs: Nelze určit symbol pod kurzorem.
es: No se puede determinar el símbolo que hay debajo del símbolo de intercalación.
ja: カレットの下のシンボルを決定できません
pt_br: Não é possível determinar o símbolo sob o cursor
ru: Не удается определить символ, на котором находится курсор.
tr: Giriş işareti altındaki sembol belirlenemiyor.
zh_hans: 无法确定插入点下面的符号。
zh_hant: 無法判斷插入點下的符號

# CannotNavigateUnknown
source: Cannot navigate to the requested location
cs: Na požadované umístění nelze přejít.
es: No se puede navegar a la ubicación solicitada.
ja: 要求された場所に移動できません
pt_br: Não é possível navegar para a localização solicitada
ru: Не удается перейти к запрошенному расположению.
tr: İstenen konuma gidilemiyor
zh_hans: 无法导航到请求的位置
zh_hant: 無法瀏覽到要求的位置

# ExceptionsHeader
source: Exceptions:
cs: Výjimky:
es: Excepciones:
ja: 例外:
pt_br: Exceções:
ru: Исключения:
tr: Özel Durumlar:
zh_hans: 异常:
zh_hant: 例外狀況:

# FSharpDisposablesClassificationType
source: F# Disposable Types
cs: F# – uvolnitelné typy
es: Tipos de F# que admiten Dispose
ja: F# の破棄可能な型
pt_br: Tipos Descartáveis F#
ru: Освобождаемые типы F#
tr: F# Atılabilir Türleri
zh_hans: F# 可处置类型
zh_hant: F# 可處置的類型

# FSharpFunctionsOrMethodsClassificationType
source: F# Functions / Methods
cs: F# – funkce/metody
es: Métodos o funciones de F#
ja: F# の関数/メソッド
pt_br: Funções/Métodos F#
ru: Функции и методы F#
tr: F # İşlevleri/Metotları
zh_hans: F# 函数/方法
zh_hant: F# 函式/方法

# FSharpMutableVarsClassificationType
source: F# Mutable Variables / Reference Cells
cs: F# – měnitelné proměnné / buňky odkazu
es: Celdas de referencia o variables mutables de F#
ja: F# の変更可能な変数/参照セル
pt_br: Variáveis Mutáveis/Células de Referência F#
ru: Изменяемые переменные и ссылки на ячейки F#
tr: F# Değişebilir Değişkenleri/Başvuru Hücreleri
zh_hans: F# 可变变量/引用单元格
zh_hant: F# 可變變數/參考儲存格

# FSharpPrintfFormatClassificationType
source: F# Printf Format
cs: F# – formát printf
es: Formato printf de F#
ja: F# の Printf 形式
pt_br: Formato Printf F#
ru: Формат printf F#
tr: F# Printf Biçimi
zh_hans: F# Printf 格式
zh_hant: F# Printf 格式

# FSharpPropertiesClassificationType
source: F# Properties
cs: F# – vlastnosti
es: Propiedades de F#
ja: F# のプロパティ
pt_br: Propriedades F#
ru: Свойства F#
tr: F# Özellikleri
zh_hans: F# 属性
zh_hant: F# 屬性

# GenericParametersHeader
source: Generic parameters:
cs: Obecné parametry:
es: Parámetros genéricos:
ja: ジェネリック パラメーター:
pt_br: Parâmetros genéricos:
ru: Общие параметры:
tr: Genel parametreler:
zh_hans: 泛型参数:
zh_hant: 泛型參數:

source: Implement interface
cs: Implementujte rozhraní.
es: Implementar interfaz
ja: インターフェイスを実装します
pt_br: Implementar a interface
ru: Реализовать интерфейс
tr: Arabirimi uygula
zh_hans: 实现接口
zh_hant: 實作介面

source: Implement interface without type annotation
cs: Implementovat rozhraní bez anotace typu
es: Implementar la interfaz sin la anotación de tipo
ja: 型の注釈なしでインターフェイスを実装します
pt_br: Implementar a interface sem anotação de tipo
ru: Реализовать интерфейс без аннотации типа
tr: Tür ek açıklaması olmadan arabirimi uygula
zh_hans: 实现接口而不使用类型注释
zh_hant: 在沒有型別註釋的情況下實作介面

# LocatingSymbol
source: Locating the symbol under the caret...
cs: Vyhledává se symbol pod kurzorem...
es: Buscando el símbolo que hay debajo del símbolo de intercalación...
ja: カレットの下のシンボルを検索しています...
pt_br: Localizando o símbolo sob o cursor...
ru: Поиск символа, на котором находится курсор…
tr: Giriş işareti altındaki sembol bulunuyor...
zh_hans: 正在查找插入点下面的符号...
zh_hant: 正在尋找插入點下的符號...

source: Name can be simplified.
cs: Název se dá zjednodušit.
es: El nombre se puede simplificar.
ja: 名前を簡略化できます。
pt_br: Nome pode ser simplificado.
ru: Имя может быть упрощено.
tr: Ad basitleştirilebilir.
zh_hans: 可以简化名称。
zh_hant: 可以簡化名稱。

# NavigateToFailed
source: Navigate to symbol failed: {0}
cs: Nepovedlo se přejít na symbol: {0}
es: Error al navegar al símbolo: {0}
ja: シンボルに移動できませんでした: {0}
pt_br: Falha ao navegar até o símbolo: {0}
ru: Не удалось перейти к символу: {0}
tr: Sembole gidilemedi: {0}
zh_hans: 导航到符号失败: {0}
zh_hant: 無法瀏覽到符號: {0}

# NavigatingTo
source: Navigating to symbol...
cs: Přechází se na symbol...
es: Navegando al símbolo...
ja: シンボルに移動しています...
pt_br: Navegando para o símbolo...
ru: Переход к символу…
tr: Sembole gidiliyor...
zh_hans: 正在导航到符号...
zh_hant: 正在瀏覽到符號...

# PrefixValueNameWithUnderscore
source: Prefix '{0}' with underscore
cs: Předpona {0} s podtržítkem
es: Prefijo "{0}" con guion bajo
ja: アンダースコアを含むプレフィックス '{0}'
pt_br: Prefixar '{0}' com um sublinhado
ru: Добавить префикс в виде символа подчеркивания к "{0}"
tr: '{0}' için ön ek olarak alt çizgi kullan
zh_hans: 带下划线的前缀 "{0}"
zh_hant: 有底線的前置詞 '{0}'

# RemoveUnusedOpens
source: Remove unused open declarations
cs: Odebrat nepoužívané otevřené deklarace
es: Quitar declaraciones abiertas sin usar
ja: 未使用の open 宣言の削除
pt_br: Remover as declarações abertas não usadas
ru: Удалить неиспользуемые объявления open
tr: Kullanılmayan açık bildirimleri kaldır
zh_hans: 删除未使用的开放声明
zh_hant: 移除未使用的開放式宣告

# RenameValueToDoubleUnderscore
source: Rename '{0}' to '__'
cs: Přejmenovat {0} na __
es: Cambiar el nombre de "{0}" a "__"
ja: '{0}' の名前を '__' に変更
pt_br: Renomear '{0}' para '__'
ru: Переименовать "{0}" в "__"
tr: '{0}' öğesini '__' olarak yeniden adlandır
zh_hans: 将 "{0}" 重命名为 "__"
zh_hant: 將 '{0}' 重新命名為 '__'

# RenameValueToUnderscore
source: Rename '{0}' to '_'
cs: Přejmenovat {0} na _
es: Cambiar el nombre de "{0}" a "_"
ja: '{0}' の名前を '_' に変更
pt_br: Renomear '{0}' para '_'
ru: Переименовать "{0}" в "_"
tr: '{0}' öğesini '_' olarak yeniden adlandır
zh_hans: 将 "{0}" 重命名为 "_"
zh_hant: 將 '{0}' 重新命名為 '_'

source: Simplify name
cs: Zjednodušit název
es: Simplificar nombre
ja: 名前の単純化
pt_br: Simplificar o nome
ru: Упростить имя
tr: Adı basitleştir
zh_hans: 简化名称
zh_hant: 簡化名稱

source: The value is unused
cs: Hodnota se nepoužívá.
es: El valor está sin usar
ja: 値は使用されていません
pt_br: O valor não é usado
ru: Значение не используется
tr: Değer kullanılmıyor
zh_hans: 未使用该值
zh_hant: 此值未使用

# UnusedOpens
source: Open declaration can be removed.
cs: Otevřenou deklaraci je možné odebrat.
es: La declaración abierta se puede quitar.
ja: open 宣言は削除することができます。
pt_br: A declaração aberta pode ser removida.
ru: Объявление open может быть удалено.
tr: Açık bildirim kaldırılabilir.
zh_hans: 可以删除开放的声明。
zh_hant: 可以移除開放式宣告。
