Repository: dotnet/roslyn
Catalog: src/Analyzers/VisualBasic/CodeFixes/xlf/VisualBasicCodeFixesResources.*.xlf
Languages: cs, fr, pl, pt_br, zh_hans

source: Add 'Me.'
cs: Přidejte položku Me.
fr: Ajouter 'Me.'
pl: Dodaj „mnie”.
pt_br: Adicionar 'Me.'
zh_hans: 添加 "Me."

source: Add <Obsolete>
cs: Přidat <Obsolete>
fr: Ajouter <Obsolete>
pl: Dodaj oznaczenie <Obsolete>
pt_br: Adicionar <Obsolete>
zh_hans: 添加 <Obsolete>

source: Convert {0} to Iterator
cs: Převést {0} na iterátor
fr: Convertir {0} en itérateur
pl: Konwertuj element {0} na iterator
pt_br: Converter {0} para Iterador
zh_hans: 将{0}转换为迭代器

source: Convert 'GetType' to 'NameOf'
cs: Převést GetType na NameOf
fr: Convertir 'GetType' en 'NameOf'
pl: Konwertuj element „GetType” na element „NameOf”
pt_br: Converter 'GetType' em 'NameOf'
zh_hans: 将 "GetType" 转换为 "NameOf"

source: Make {0} an Async Function.
cs: Převeď {0} na asynchronní funkci Async.
fr: Faire de {0} une fonction Async.
pl: Ustaw funkcję {0} jako funkcję asynchroniczną.
pt_br: Tornar {0} uma Função Assíncrona.
zh_hans: 使 {0} 为异步函数。

source: Make '{0}' inheritable
cs: Nastavit dědičnost pro {0}
fr: Rendre '{0}' héritable
pl: Ustaw element „{0}” jako dziedziczony
pt_br: Alterar '{0}' para herdável
zh_hans: 使 "{0}" 可继承

source: Make Async Function
cs: Převést na asynchronní funkci
fr: Rendre la fonction asynchrone
pl: Ustaw funkcję jako asynchroniczną
pt_br: Tornar a função assíncrona
zh_hans: 使成为异步函数

source: Make Async Sub
cs: Převést na asynchronní proceduru Sub
fr: Rendre le Sub asynchrone
pl: Ustaw podprocedurę jako asynchroniczną
pt_br: Tornar Sub Assíncrona
zh_hans: 使成为异步 Sub

source: Remove unnecessary imports
cs: Odebrat nepotřebné importy
fr: Supprimer les importations inutiles
pt_br: Remover as Importações desnecessárias
zh_hans: 移除不必要的导入

source: Replace 'Return' with 'Yield
cs: Nahradit příkaz Return příkazem Yield
fr: Remplacer 'Return' par 'Yield
pl: Zamień instrukcję „Return” na instrukcję „Yield”
pt_br: Substituir "Return" por "Yield"
zh_hans: 将 "Return" 替换为 "Yield

source: Simplify object creation
cs: Zjednodušit vytváření objektů
fr: Simplifier la création d’objets
pl: Upraszczanie tworzenia obiektu
pt_br: Simplifique a criação de objetos
zh_hans: 简化对象创建
