Repository: dotnet/roslyn
Catalog: src/Workspaces/Remote/Core/xlf/RemoteWorkspacesResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FeatureName_AssetSynchronization
source: Asset synchronization
cs: Synchronizace prostředků
de: Objektsynchronisierung
es: Sincronización de recursos
fr: Synchronisation des ressources
it: Sincronizzazione degli asset
ja: 資産の同期
ko: 자산 동기화
pl: Synchronizacja elementów zawartości
pt_br: Sincronização de ativos
ru: Синхронизация ресурсов
tr: Varlık eşitleme
zh_hans: 资产同步
zh_hant: 資產同步

# FeatureName_AsynchronousOperationListener
source: Asynchronous operation listener
cs: Naslouchací proces asynchronní operace
de: Listener für asynchrone Vorgänge
es: Cliente de escucha de operaciones asincrónicas
fr: Écouteur d'opérations asynchrones
it: Listener di operazioni asincrone
ja: 非同期操作リスナー
ko: 비동기 작업 수신기
pl: Odbiornik operacji asynchronicznej
pt_br: Ouvinte de operação assíncrona
ru: Прослушиватель асинхронных операций
tr: Asenkron işlem dinleyicisi
zh_hans: 异步操作侦听器
zh_hant: 非同步作業接聽程式

# FeatureName_CodeLensReferences
source: CodeLens references
cs: Odkazy CodeLens
de: CodeLens-Verweise
es: Referencias de CodeLens
fr: Références CodeLens
it: Riferimenti a CodeLens
ja: CodeLens の参照
ko: CodeLens 참조
pl: Odwołania CodeLens
pt_br: Referências CodeLens
ru: Ссылки на CodeLens
tr: CodeLens başvuruları
zh_hans: CodeLens 引用
zh_hant: CodeLens 參考

# FeatureName_CompilationAvailable
source: Project semantics availability
cs: Dostupnost sémantiky projektu
de: Verfügbarkeit der Projektsemantik
es: Disponibilidad de semántica del proyecto
fr: Disponibilité de la sémantique du projet
it: Disponibilità semantica del progetto
ja: プロジェクト セマンティクスの可用性
ko: 프로젝트 의미 체계 가용성
pl: Dostępność semantyki projektu
pt_br: Disponibilidade da semântica do projeto
ru: Доступность семантики проекта
tr: Proje semantiği kullanılabilirliği
zh_hans: 项目语义可用性
zh_hant: 專案語意學可用性

# FeatureName_ConvertTupleToStructCodeRefactoring
source: Convert tuple to struct refactoring
cs: Převést řazenou kolekci členů na refaktoring struktury
de: Tupel in Strukturrefactoring konvertieren
es: Convertir tupla en refactorización de estructura
fr: Refactorisation de la conversion de tuple en struct
it: Conversione della tupla nel refactoring dello struct
ja: タプルを構造体のリファクタリングに変換する
ko: 튜플을 구조체 리팩터링으로 변환
pl: Refaktoryzacja konwersji krotki na strukturę
pt_br: Converter a tupla em refatoração de struct
ru: Преобразовать кортеж в рефакторинг структуры
tr: Demeti yapıya dönüştürme yeniden düzenlemesi
zh_hans: 将元组转换为结构重构
zh_hant: 將元組轉換為結構重構

# FeatureName_CopilotChangeAnalysis
source: Copilot change analysis
de: Copilot-Änderungsanalyse
ja: Copilot の変更分析

# FeatureName_CopilotProposalAdjuster
source: Copilot proposal adjuster
de: Copilot-Vorschlagsanpassung
ja: Copilot 提案調整ツール

# FeatureName_DependentTypeFinder
source: Dependent type finder
cs: Vyhledávání závislých typů
de: Suche nach abhängigen Typen
es: Localizador de tipos dependientes
fr: Outil de recherche de type dépendant
it: Strumento di ricerca tipi dipendenti
ja: 依存型の検索
ko: 종속 형식 찾기
pl: Wyszukiwanie typów zależnych
pt_br: Localizador de tipo dependente
ru: Поиск зависимых типов
tr: Bağımlı tür bulucu
zh_hans: 依赖类型查找器
zh_hant: 相依類型尋找工具

# FeatureName_DesignerAttributeDiscovery
source: DesignerAttribute discovery
cs: Zjišťování DesignerAttribute
de: DesignerAttribute-Ermittlung
es: Detección de DesignerAttribute
fr: Détection de DesignerAttribute
it: Individuazione di DesignerAttribute
ja: DesignerAttribute の検出
ko: DesignerAttribute 검색
pl: Odnajdywanie elementu DesignerAttribute
pt_br: Descoberta de DesignerAttribute
ru: Обнаружение DesignerAttribute
tr: DesignerAttribute bulma
zh_hans: DesignerAttribute 发现
zh_hant: DesignerAttribute 探索

# FeatureName_DiagnosticAnalyzer
source: Diagnostic analyzer runner
cs: Spouštěč diagnostického analyzátoru
de: Runner für Diagnoseanalysetool
es: Ejecutor del analizador de diagnóstico
fr: Exécuteur d'analyseur de diagnostic
it: Strumento di esecuzione dell'analizzatore diagnostico
ja: 診断アナライザー ランナー
ko: 진단 분석기 실행기
pl: Moduł uruchamiający analizatora diagnostyki
pt_br: Executor do analisador de diagnóstico
ru: Средство запуска диагностического анализатора
tr: Tanılama çözümleyicisi çalıştırıcı
zh_hans: 诊断分析器运行程序
zh_hant: 診斷分析器執行器

# FeatureName_DocumentHighlights
source: Document highlights
cs: Zvýraznění dokumentu
de: Dokumenthighlights
es: Elementos destacados del documento
fr: Grandes lignes du document
it: Evidenziazioni del documento
ja: ドキュメント強調表示
ko: 문서 하이라이트
pl: Wyróżnienia dokumentów
pt_br: Documentos em destaques
ru: Основные моменты документа
tr: Belgedeki önemli noktalar
zh_hans: 文档亮点
zh_hant: 文件重點

# FeatureName_EditAndContinue
source: Edit and Continue
cs: Upravit a pokračovat
de: Bearbeiten und fortfahren
es: Editar y continuar
fr: Modifier et continuer
it: Modifica e continuazione
ja: エディット コンティニュ
ko: 편집하며 계속하기
pl: Edytuj i kontynuuj
pt_br: Editar e Continuar
ru: Изменить и продолжить
tr: Düzenle ve Devam Et
zh_hans: 编辑并继续
zh_hant: 編輯並繼續

# FeatureName_EncapsulateField
source: Encapsulate field refactoring
cs: Zabalit refaktoring pole
de: Feldrefactoring kapseln
es: Encapsular la refactorización de campo
fr: Refactorisation de l'encapsulation de champ
it: Refactoring di Incapsula campo
ja: フィールドのカプセル化のリファクタリング
ko: 필드 리팩터링 캡슐화
pl: Refaktoryzacja hermetyzacji pola
pt_br: Encapsular a refatoração de campo
ru: Рефакторинг инкапсуляции поля
tr: Alanı kapsülleme yeniden düzenlemesi
zh_hans: 封装字段重构
zh_hant: 封裝欄位重構

# FeatureName_ExtensionMemberImportCompletion
source: Extension member import completion
de: Abschluss des Importvorgangs für Erweiterungselemente

# FeatureName_ExtensionMessageHandler
source: Extension message handler
de: Erweiterungsmeldungshandler
ja: 拡張メッセージ ハンドラー

# FeatureName_FindUsages
source: Find usages
cs: Vyhledat využití
de: Verwendungen suchen
es: Buscar usos
fr: Recherche d'usages
it: Utilizzi di Trova
ja: 使用状況の検索
ko: 사용량 찾기
pl: Znajdź użycia
pt_br: Localizar usos
ru: Поиск использований
tr: Kullanımları bul
zh_hans: 查找使用情况
zh_hant: 尋找使用方式

# FeatureName_FullyQualify
source: Fully qualify
cs: Plně kvalifikovat
de: Vollqualifiziert
es: Completo
fr: Qualifier entièrement
it: Qualificare completamente
ja: 完全修飾
ko: 정규화
pl: W pełni kwalifikowany
pt_br: Totalmente qualificado
ru: Определить полностью
tr: Tam olarak nitele
zh_hans: 完全限定
zh_hant: 完全符合資格

# FeatureName_GlobalNotificationDelivery
source: Global notification delivery
cs: Doručování globálních oznámení
de: Globale Benachrichtigungsübermittlung
es: Entrega de notificaciones globales
fr: Remise de notification globale
it: Recapito delle notifiche globali
ja: グローバル通知の配信
ko: 전역 알림 배달
pl: Dostarczanie powiadomień globalnych
pt_br: Entrega de notificação global
ru: Доставка глобальных уведомлений
tr: Genel bildirim teslimi
zh_hans: 全局通知传送
zh_hant: 全域通知傳遞

# FeatureName_InheritanceMargin
source: Inheritance margin
cs: Míra dědičnosti
de: Vererbungsrand
es: Margen de herencia
fr: Marge d’héritage
it: Margine di ereditarietà
ja: 継承の余白
ko: 상속 여백
pl: Margines dziedziczenia
pt_br: Margem de herança
ru: Граница наследования
tr: Devralma boşluğu
zh_hans: 继承边距
zh_hant: 繼承邊界

# FeatureName_Initialization
source: Initialization
de: Initialisierung
ja: 初期化

# FeatureName_KeepAlive
source: Keep alive service
cs: Služba responzivity
de: Keepalive-Dienst
es: Mantener el servicio activo
fr: Maintenir le service actif
it: Servizio keep-alive
ja: キープ アライブ サービス
ko: 서비스 연결 유지
pl: Utrzymywanie aktywności usługi
pt_br: Serviço Keep alive
ru: Служба проверки активности
tr: Etkin tutma hizmeti
zh_hans: 保持活动状态的服务
zh_hant: 保持運作服務

# FeatureName_LegacySolutionEventsAggregation
source: Solution Events
cs: Události řešení
de: Lösungsereignisse
es: Eventos de solución
fr: Événements de solution
it: Eventi della soluzione
ja: ソリューション イベント
ko: 솔루션 이벤트
pl: Zdarzenia rozwiązania
pt_br: Eventos da Solução
ru: События решения
tr: Çözüm Olayları
zh_hans: 解决方案事件
zh_hant: 解决方案事件

# FeatureName_MissingImportDiscovery
source: Missing import discovery
cs: Chybí zjišťování importů
de: Fehlende Importermittlung
es: Detección de importaciones que faltan
fr: Détection d'importation manquante
it: Individuazione delle importazioni mancanti
ja: 不足しているインポートの検出
ko: 가져오기 검색 없음
pl: Odnajdywanie brakujących importów
pt_br: Descoberta de importação ausente
ru: Отсутствует обнаружение импорта
tr: İçeri aktarma bulma eksik
zh_hans: 缺少导入发现
zh_hant: 缺少匯入探索

# FeatureName_NavigateToSearch
source: Navigate to
cs: Přejít na
de: Navigieren zu
es: Navegar a
fr: Accéder à
it: Passa a
ja: 移動
ko: 다음 탐색
pl: Przejdź do
pt_br: Navegar para
ru: Перейти к
tr: Şuraya gidin:
zh_hans: 导航到
zh_hant: 導覽至

# FeatureName_NavigationBarItem
source: Navigation bar
cs: Navigační panel
de: Navigationsleiste
es: Barra de navegación
fr: Barre de navigation
it: Barra di spostamento
ja: ナビゲーション バー
ko: 탐색 모음
pl: Pasek nawigacyjny
pt_br: Barra de navegação
ru: Панель навигации
tr: Gezinti çubuğu
zh_hans: 导航栏
zh_hant: 導覽列

# FeatureName_ProcessTelemetry
source: Process telemetry
cs: Zpracovat telemetrii
de: Telemetriedaten verarbeiten
es: Telemetría de procesos
fr: Télémétrie du processus
it: Processo di telemetria
ja: プロセス テレメトリ
ko: 프로세스 원격 측정
pl: Przetwarzanie telemetrii
pt_br: Telemetria de processo
ru: Телеметрия процессов
tr: İşlem telemetrisi
zh_hans: 进程遥测
zh_hant: 流程遙測

# FeatureName_ProjectTelemetry
source: Project telemetry collection
cs: Shromažďování telemetrie projektu
de: Projekttelemetriesammlung
es: Recopilación de telemetría del proyecto
fr: Collecte de la télémétrie du projet
it: Raccolta dei dati di telemetria del progetto
ja: プロジェクト テレメトリ コレクション
ko: 프로젝트 원격 분석 컬렉션
pl: Kolekcja telemetrii projektu
pt_br: Coleção de telemetria do projeto
ru: Сбор данных телеметрии проекта
tr: Proje telemetri koleksiyonu
zh_hans: 项目遥测集合
zh_hant: 專案遙測集合

# FeatureName_RelatedDocuments
source: Related documents
cs: Související dokumenty
de: Zugehörige Dokumente
ja: 関連ドキュメント
ko: 관련 문서
pl: Powiązane dokumenty
ru: Связанные документы
zh_hans: 相关文档
zh_hant: 相關文件

# FeatureName_Renamer
source: Rename
cs: Přejmenovat
de: Umbenennen
es: Cambiar nombre
fr: Renommer
it: Rinomina
ja: 名前の変更
ko: 이름 바꾸기
pl: Zmień nazwę
pt_br: Renomear
ru: Переименовать
tr: Yeniden adlandır
zh_hans: 重命名
zh_hant: 重新命名

# FeatureName_SemanticClassification
source: Semantic classification
cs: Sémantická klasifikace
de: Semantische Klassifizierung
es: Clasificación semántica
fr: Classification sémantique
it: Classificazione semantica
ja: セマンティック分類
ko: 의미 체계 분류
pl: Klasyfikacja semantyczna
pt_br: Classificação semântica
ru: Семантическая классификация
tr: Anlamsal sınıflandırma
zh_hans: 语义分类
zh_hant: 語意分類

# FeatureName_SemanticSearch
source: Semantic search
cs: Sémantické vyhledávání
de: Semantische Suche
es: Búsqueda semántica
fr: Recherche sémantique
it: Ricerca semantica
ja: セマンティック検索
ko: 의미 체계 검색
pl: Wyszukiwanie semantyczne
ru: Семантический поиск
tr: Anlamsal arama
zh_hans: 语义搜索
zh_hant: 語意搜尋

# FeatureName_SolutionAssetProvider
source: Asset provider
cs: Poskytovatel prostředků
de: Objektanbieter
es: Proveedor de recursos
fr: Fournisseur de ressources
it: Provider di asset
ja: 資産プロバイダー
ko: 자산 공급자
pl: Dostawca elementów zawartości
pt_br: Provedor de ativos
ru: Поставщик ресурсов
tr: Varlık sağlayıcısı
zh_hans: 资产提供商
zh_hant: 資產提供者

# FeatureName_SourceGeneration
source: Source generation
cs: Generování zdroje
de: Quellgenerierung
es: Generación de origen
fr: Génération de la source
it: Generazione origine
ja: ソースの生成
ko: 원본 생성
pl: Generowanie źródła
pt_br: Geração de origem
ru: Создание источника
tr: Kaynak oluşturma
zh_hans: 源生成
zh_hant: 來源產生

# FeatureName_SymbolFinder
source: Symbol finder
cs: Vyhledávání symbolů
de: Symbolsuche
es: Localizador de símbolos
fr: Outil de recherche de symboles
it: Strumento di ricerca simboli
ja: シンボル検索
ko: 기호 찾기
pl: Wyszukiwanie symboli
pt_br: Localizador de símbolo
ru: Поиск символов
tr: Sembol bulucu
zh_hans: 符号查找器
zh_hant: 符號尋找工具

# FeatureName_SymbolSearchUpdate
source: Symbol search
cs: Hledání symbolů
de: Symbolsuche
es: Búsqueda de símbolos
fr: Recherche de symboles
it: Ricerca simboli
ja: シンボルの検索
ko: 기호 검색
pl: Wyszukiwanie symboli
pt_br: Pesquisa de símbolo
ru: Поиск символов
tr: Sembol araması
zh_hans: 符号搜索
zh_hant: 符號搜尋

# FeatureName_TaskList
source: Task list
cs: Seznam úkolů
de: Aufgabenliste
es: Lista de tareas
fr: Liste de tâches
it: Elenco attività
ja: タスク一覧
ko: 작업 목록
pl: Lista zadań
pt_br: Lista de tarefas
ru: Список задач
tr: Görev listesi
zh_hans: 任务列表
zh_hant: 工作清單

# FeatureName_UnitTestingSearch
source: Unit testing search
cs: Hledání v testování částí
de: Komponententestsuche
es: Búsqueda de pruebas unitarias
fr: Recherche de tests unitaires
it: Ricerca unit test
ja: 単体テストの検索
ko: 단위 테스트 검색
pl: Wyszukiwanie testów jednostkowych
pt_br: Pesquisa de teste de unidade
ru: Поиск модульного тестирования
tr: Birim testi araması
zh_hans: 单元测试搜索
zh_hant: 單元測試搜尋

# FeatureName_UnusedReferenceAnalysis
source: Unused reference analysis
cs: Nepoužité referenční analýzy
de: Nicht verwendete Referenzanalyse
es: Análisis de referencia inutilizado
fr: Analyse de référence inutilisée
it: Analisi di riferimento non utilizzata
ja: 未使用の参照分析
ko: 사용되지 않는 참조 분석
pl: Nieużywane analizy referencyjne
pt_br: Análise de referência não usada
ru: Анализ неиспользуемых ссылок
tr: Kullanılmayan başvuru analizi
zh_hans: 未使用的引用分析
zh_hant: 未使用的參考分析

# FeatureName_ValueTracking
source: Value Tracking
cs: Sledování hodnot
de: Wertnachverfolgung
es: Seguimiento de valores
fr: Suivi de la valeur
it: Rilevamento dei valori
ja: 値の追跡
ko: 값 추적
pl: Śledzenie wartości
pt_br: Rastreamento de Valor
ru: Отслеживание значений
tr: Değer Takibi
zh_hans: 值跟踪
zh_hant: 值追蹤

# Feature_0_is_currently_unavailable_due_to_an_intermittent_error
source: Feature '{0}' is currently unavailable due to an intermittent error, please try again later: '{1}'
cs: Kvůli přechodné chybě není funkce {0} momentálně k dispozici. Zkuste to prosím znovu později: {1}
de: Das Feature "{0}" ist aufgrund eines zeitweiligen Fehlers momentan nicht verfügbar. Versuchen Sie es später noch mal: "{1}"
es: La característica "{0}" no está disponible debido a un error intermitente; vuelva a intentarlo más tarde: "{1}"
fr: La fonctionnalité '{0}' est non disponible en raison d'une erreur intermittente. Réessayez plus tard : '{1}'
it: La funzionalità '{0}' non è attualmente disponibile a causa di un errore intermittente. Riprovare più tardi: '{1}'
ja: 間欠的なエラーのため、機能 '{0}' は現在使用できません。後でもう一度お試しください: '{1}'
ko: 일시적 오류로 인해 기능 '{0}'을(를) 현재 사용할 수 없습니다. 나중에 다시 시도하세요. '{1}'
pl: Funkcja „{0}” jest obecnie niedostępna z powodu sporadycznego błędu, spróbuj ponownie później: „{1}”
pt_br: O recurso '{0}' não está disponível no momento devido a um erro intermitente. Faça uma nova tentativa mais tarde: '{1}'
ru: Функция "{0}" сейчас недоступна из-за временной ошибки. Повторите попытку позже: "{1}".
tr: '{0}' özelliği, aralıklı bir hata nedeniyle şu anda kullanılamıyor. Lütfen daha sonra yeniden deneyin: '{1}'
zh_hans: 功能“{0}”当前不可用，因为出现间歇性错误，请稍后重试:“{1}”
zh_hant: 因為發生間歇性錯誤，所以 '{0}' 功能目前無法使用，請稍後再試: '{1}'

source: Feature '{0}' is currently unavailable due to an internal error.
cs: Kvůli vnitřní chybě není funkce {0} momentálně k dispozici.
de: Das Feature "{0}" ist aufgrund eines internen Fehlers momentan nicht verfügbar.
es: La característica "{0}" no está disponible debido a un error interno.
fr: La fonctionnalité '{0}' est non disponible en raison d'une erreur interne.
it: La funzionalità '{0}' non è attualmente disponibile a causa di un errore interno.
ja: 内部エラーのため、機能 '{0}' は現在使用できません。
ko: 내부 오류로 인해 현재 기능 '{0}'을(를) 사용할 수 없습니다.
pl: Funkcja „{0}” jest obecnie niedostępna z powodu błędu wewnętrznego.
pt_br: O recurso '{0}' não está disponível no momento devido a um erro interno.
ru: Функция "{0}" сейчас недоступна из-за внутренней ошибки.
tr: '{0}' özelliği bir iç hata nedeniyle şu anda kullanılamıyor.
zh_hans: 由于内部错误，功能“{0}”当前不可用。
zh_hant: 因為發生內部錯誤，所以 '{0}' 功能目前無法使用。

# Feature_0_is_currently_unavailable_host_shutting_down
source: Feature '{0}' is currently unavailable since {1} is shutting down.
cs: Funkce {0} není momentálně k dispozici, protože {1} se vypíná.
de: Das Feature "{0}" ist momentan nicht verfügbar, weil "{1}" heruntergefahren wird.
es: La característica "{0}" no está disponible porque {1} se está apagando.
fr: La fonctionnalité '{0}' est non disponible, car {1} est en cours d'arrêt.
it: La funzionalità '{0}' non è attualmente disponibile perché è in corso l'arresto di {1}.
ja: {1} がシャットダウン中のため、機能 '{0}' は現在使用できません。
ko: {1}을(를) 종료하는 중이므로 현재 기능 '{0}'을(를) 사용할 수 없습니다.
pl: Funkcja „{0}” jest obecnie niedostępna, ponieważ host {1} jest zamykany.
pt_br: O recurso '{0}' não está disponível no momento porque o {1} está sendo desligado.
ru: Функция "{0}" сейчас недоступна, так как {1} завершает работу.
tr: {1} kapanmakta olduğundan '{0}' özelliği şu anda kullanılamıyor.
zh_hans: 功能“{0}”当前不可用，因为 {1} 正在关闭。
zh_hant: 因為 {1} 正在關閉，所以 '{0}' 功能目前無法使用。

# FeatureName_StackTraceExplorer
source: Stack Trace Explorer
cs: Průzkumník trasování zásobníku
es: Explorador de seguimiento de pila
fr: Explorateur de traces de pile
it: Esplora analisi dello stack
ja: スタック トレース エクスプローラー
ko: 스택 추적 탐색기
pl: Eksplorator śladu stosu
pt_br: Explorador de Rastreamento de Pilha
ru: Обозреватель трассировки стека
tr: Yığın İzlemesi Gezgini
zh_hans: 堆栈跟踪资源管理器
zh_hant: 堆疊追蹤總管

# FeatureName_ExtensionMethodImportCompletion
source: Extension method import completion
es: Finalización de la importación del método de extensión
fr: Exécution de l'importation de méthode d'extension
it: Completamento dell'importazione del metodo di estensione
pl: Uzupełnianie importu metody rozszerzenia
pt_br: Conclusão da importação do método de extensão
tr: Genişletme yöntemini içeri aktarma işlemi tamamlandı
