Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadCallerFilePathParamWithoutDefaultValue
source: The CallerFilePathAttribute may only be applied to parameters with default values
cs: Atribut CallerFilePathAttribute jde použít jenom pro parametry s výchozími hodnotami.
de: Das CallerFilePathAttribute kann nur auf Parameter mit Standardwerten angewendet werden.
es: CallerFilePathAttribute solo se puede aplicar a parámetros con valores predeterminados
fr: Le CallerFilePathAttribute peut seulement être appliqué aux paramètres avec des valeurs par défaut
it: CallerFilePathAttribute può essere applicato solo a parametri con valori predefiniti
ja: CallerFilePathAttribute は、既定値を含むパラメーターにのみ適用できます
ko: CallerFilePathAttribute는 기본값이 있는 매개 변수에만 적용할 수 있습니다.
pl: Atrybut CallerFilePathAttribute można stosować wyłącznie do parametrów mających wartości domyślne.
pt_br: O CallerFilePathAttribute só pode ser aplicado a parâmetros com valores padrão
ru: CallerFilePathAttribute можно применять только к параметрам со значениями по умолчанию.
tr: CallerFilePathAttribute yalnızca varsayılan değeri olan parametrelere uygulanabilir
zh_hans: CallerFilePathAttribute 只能应用于具有默认值的参数
zh_hant: CallerFilePathAttribute 只能套用至具有預設值的參數

# ERR_BadCallerMemberNameParamWithoutDefaultValue
source: The CallerMemberNameAttribute may only be applied to parameters with default values
cs: Atribut CallerMemberNameAttribute jde použít jenom pro parametry s výchozími hodnotami.
de: Das CallerMemberNameAttribute kann nur auf Parameter mit Standardwerten angewendet werden.
es: CallerMemberNameAttribute solo se puede aplicar a parámetros con valores predeterminados
fr: Le CallerMemberNameAttribute peut seulement être appliqué aux paramètres avec des valeurs par défaut
it: CallerMemberNameAttribute può essere applicato solo a parametri con valori predefiniti
ja: CallerMemberNameAttribute は、既定値を含むパラメーターにのみ適用できます
ko: CallerMemberNameAttribute는 기본값이 있는 매개 변수에만 적용할 수 있습니다.
pl: Atrybut CallerMemberNameAttribute można stosować wyłącznie do parametrów mających wartości domyślne.
pt_br: O CallerMemberNameAttribute só pode ser aplicado a parâmetros com valores padrão
ru: CallerMemberNameAttribute можно применять только к параметрам со значениями по умолчанию.
tr: CallerMemberNameAttribute yalnızca varsayılan değeri olan parametrelere uygulanabilir
zh_hans: CallerMemberNameAttribute 只能应用于具有默认值的参数
zh_hant: CallerMemberNameAttribute 只能套用至具有預設值的參數

# WRN_CallerLineNumberParamForUnconsumedLocation
source: The CallerLineNumberAttribute applied to parameter '{0}' will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerLineNumberAttribute použitý u parametru {0} nebude mít žádný účinek, protože se aplikuje u člena, který se používá v kontextech nepovolujících volitelné argumenty.
de: Das auf Parameter "{0}" angewendete CallerLineNumberAttribute hat keine Auswirkung, da es auf einen Member in Kontexten angewendet wird, die keine optionalen Argumente zulassen.
es: El CallerLineNumberAttribute aplicado al parámetro '{0}' no tendrá efecto porque se aplica a un miembro que se usa en contextos que no permiten argumentos opcionales
fr: CallerLineNumberAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: CallerLineNumberAttribute applicato al parametro '{0}' non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: パラメーター '{0}' に適用された CallerLineNumberAttribute は、省略可能な引数を許可しないコンテキストで使用されるメンバーに適用されるため無効となります
ko: {0}' 매개 변수에 적용되는 CallerLineNumberAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerLineNumberAttribute do parametru „{0}” nie odniesie żadnego skutku, ponieważ dotyczy składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerLineNumberAttribute aplicado ao parâmetro "{0}" não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem argumentos opcionais
ru: Применение атрибута CallerLineNumberAttribute к параметру "{0}" ни к чему не приводит, поскольку атрибут применяется к члену, который используется в контекстах, запрещающих необязательные аргументы.
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlardan kullanılan bir üye için geçerli olduğundan, '{0}' parametresine uygulanan CallerLineNumberAttribute öğesinin hiçbir etkisi olmaz
zh_hans: 应用于形参“{0}”的 CallerLineNumberAttribute 将不起任何作用，因为它适用于不允许指定可选实参的上下文中使用的成员
zh_hant: 套用到參數 '{0}' 的 CallerLineNumberAttribute 將沒有作用，因為它套用到了不允許選擇性引數的內容中所使用之成員

# WRN_CallerLineNumberParamForUnconsumedLocation_Title
source: The CallerLineNumberAttribute will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerLineNumberAttribute nebude mít žádný efekt, protože platí pro člena, který se používá v kontextech nedovolujících nepovinné argumenty.
de: Das CallerLineNumberAttribute hat keine Auswirkungen, da es für ein Element gilt, das in Kontexten verwendet wird, die keine optionalen Argumente zulassen
es: El atributo CallerLineNumberAttribute no tendrá efecto porque se aplica a un miembro que se utiliza en contextos que no permiten argumentos opcionales
fr: CallerLineNumberAttribute n'aura pas d'effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas d'arguments facultatifs
it: CallerLineNumberAttribute non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: CallerLineNumberAttribute は、オプションの引数を許可していないコンテキストで使用されるメンバーに適用されるため、効果がありません
ko: CallerLineNumberAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerLineNumberAttribute nie odniesie żadnego skutku, ponieważ dotyczy on składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerLineNumberAttribute não tem efeito porque ele se aplica a um membro que é usado em contextos que não aceitam argumentos opcionais
ru: Атрибут CallerLineNumberAttribute не будет работать, так как он применяется к члену, который используется в контекстах, не допускающих дополнительные аргументы
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üye için geçerli olduğundan CallerLineNumberAttribute öğesinin etkisi olmayacak
zh_hans: CallerLineNumberAttribute 将不起任何作用，因为它适用于不允许可选参数的上下文中使用的成员
zh_hant: CallerLineNumberAttribute 將沒有效果，因為它所套用到的成員是用在不允許選擇性引數的內容

# WRN_CallerFilePathParamForUnconsumedLocation
source: The CallerFilePathAttribute applied to parameter '{0}' will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerFilePathAttribute použitý u parametru {0} nebude mít žádný vliv, protože se vztahuje na člen, který je použitý v kontextech nepovolujících volitelné argumenty.
de: Das auf den Parameter "{0}" angewendete "CallerFilePathAttribute" besitzt keine Auswirkungen, weil es für einen Member gilt, der in Kontexten verwendet wird, in denen optionale Argumente unzulässig sind.
es: El CallerFilePathAttribute aplicado al parámetro '{0}' no tendrá efecto porque se aplica a un miembro que se usa en contextos que no permiten argumentos opcionales
fr: CallerFilePathAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: L'elemento CallerFilePathAttribute applicato al parametro '{0}' non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: オプションの引数が許可されないコンテキストで使用されるメンバーに適用されるため、パラメーター '{0}' に適用された CallerFilePathAttribute は無効になります
ko: {0}' 매개 변수에 적용된 CallerFilePathAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Atrybut CallerFilePathAttribute zastosowany do parametru „{0}” nie będzie mieć efektu, ponieważ jest stosowany do składowej używanej w kontekście, który nie zezwala na korzystanie z argumentów opcjonalnych
pt_br: O atributo CallerFilePathAttribute aplicado ao parâmetro "{0}" não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem o uso de argumentos opcionais
ru: Применение атрибута CallerFilePathAttribute к параметру "{0}" ни к чему не приводит, поскольку атрибут применяется к члену, который используется в контекстах, запрещающих необязательные аргументы.
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üye için geçerli olduğundan '{0}' parametresine uygulanan CallerFilePathAttribute'un bir etkisi yoktur
zh_hans: 应用到参数“{0}”的 CallerFilePathAttribute 将不起作用，因为它应用到的成员在不允许使用可选参数的上下文中使用
zh_hant: 套用到參數 '{0}' 的 CallerFilePathAttribute 將沒有作用，因為它套用到不允許選擇性引數的內容中所使用的成員

# WRN_CallerFilePathParamForUnconsumedLocation_Title
source: The CallerFilePathAttribute will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerFilePathAttribute nebude mít žádný vliv, protože se vztahuje na člen, který je použitý v kontextech nepovolujících volitelné argumenty.
de: Das "CallerFilePathAttribute" besitzt keine Auswirkungen, weil es für einen Member gilt, der in Kontexten verwendet wird, in denen optionale Argumente unzulässig sind.
es: El CallerFilePathAttribute no tendrá efecto porque se aplica a un miembro que se usa en contextos que no permiten argumentos opcionales
fr: CallerFilePathAttribute n'aura pas d'effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas d'arguments facultatifs
it: L'elemento CallerFilePathAttribute non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: オプションの引数が許可されないコンテキストで使用されるメンバーに適用されるため、CallerFilePathAttribute は無効になります
ko: CallerFilePathAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Atrybut CallerFilePathAttribute nie będzie mieć efektu, ponieważ jest stosowany do składowej używanej w kontekście, który nie zezwala na korzystanie z argumentów opcjonalnych
pt_br: O atributo CallerFilePathAttribute não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem o uso de argumentos opcionais
ru: Атрибут CallerFilePathAttribute не будет работать, так как он применяется к члену, который используется в контекстах, не допускающих необязательные аргументы.
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üye için geçerli olduğundan CallerFilePathAttribute'un bir etkisi yoktur
zh_hans: CallerFilePathAttribute 将不起作用，因为它应用到的成员在不允许使用可选参数的上下文中使用
zh_hant: CallerFilePathAttribute 將沒有作用，因為它套用到不允許選擇性引數的內容中所使用的成員

# WRN_CallerMemberNameParamForUnconsumedLocation
source: The CallerMemberNameAttribute applied to parameter '{0}' will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerMemberNameAttribute použitý u parametru {0} nebude mít žádný účinek, protože se aplikuje u člena, který se používá v kontextech nepovolujících volitelné argumenty.
de: Das auf Parameter "{0}" angewendete CallerMemberNameAttribute hat keine Auswirkung, da es auf einen Member in Kontexten angewendet wird, die keine optionalen Argumente zulassen.
es: El CallerMemberNameAttribute aplicado al parámetro '{0}' no tendrá efecto porque se aplica a un miembro que se usa en contextos que no permiten argumentos opcionales
fr: CallerMemberNameAttribute, appliqué au paramètre '{0}', n'aura aucun effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: CallerMemberNameAttribute applicato al parametro '{0}' non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: パラメーター '{0}' に適用された CallerMemberNameAttribute は、省略可能な引数を許可しないコンテキストで使用されるメンバーに適用されるため無効となります
ko: {0}' 매개 변수에 적용되는 CallerMemberNameAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerMemberNameAttribute do parametru „{0}” nie odniesie żadnego skutku, ponieważ dotyczy składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerMemberNameAttribute aplicado ao parâmetro "{0}" não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem argumentos opcionais
ru: Применение атрибута CallerMemberNameAttribute к параметру "{0}" ни к чему не приводит, поскольку атрибут применяется к члену, который используется в контекстах, запрещающих необязательные аргументы.
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üyeye uygulandığından '{0}' parametresine uygulanan CallerMemberNameAttribute değerinin hiçbir etkisi olmayacaktır
zh_hans: 应用于形参“{0}”的 CallerMemberNameAttribute 将不起任何作用，因为它适用于不允许指定可选实参的上下文中使用的成员
zh_hant: 套用到參數 '{0}' 的 CallerMemberNameAttribute 將沒有作用，因為它套用到了不允許選擇性引數的內容中所使用之成員

# WRN_CallerMemberNameParamForUnconsumedLocation_Title
source: The CallerMemberNameAttribute will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: CallerMemberNameAttribute nebude mít žádný efekt, protože platí pro člena, který se používá v kontextech nedovolujících nepovinné argumenty.
de: Das CallerMemberNameAttribute hat keine Auswirkungen, da es für einen Member gilt, das in Kontexten verwendet wird, die keine optionalen Argumente zulassen
es: El atributo CallerMemberNameAttribute no tendrá efecto porque se aplica a un miembro que se utiliza en contextos que no permiten argumentos opcionales
fr: CallerMemberNameAttribute n'aura pas d'effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas d'arguments facultatifs
it: CallerMemberNameAttribute non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: CallerMemberNameAttribute は、オプションの引数を許可していないコンテキストで使用されるメンバーに適用されるため、効果がありません
ko: CallerMemberNameAttribute는 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerMemberNameAttribute nie odniesie żadnego skutku, ponieważ dotyczy on składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerMemberNameAttribute não tem efeito porque ele se aplica a um membro que é usado em contextos que não aceitam argumentos opcionais
ru: Атрибут CallerMemberNameAttribute не будет работать, так как он применяется к члену, который используется в контекстах, не допускающих дополнительные аргументы
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üye için geçerli olduğundan CallerMemberNameAttribute öğesinin etkisi olmayacak
zh_hans: CallerMemberNameAttribute 将不起任何作用，因为它适用于不允许可选参数的上下文中使用的成员
zh_hant: CallerMemberNameAttribute 將沒有效果，因為它所套用到的成員是用在不允許選擇性引數的內容

# ERR_NoEntryPoint
source: Program does not contain a static 'Main' method suitable for an entry point
cs: Program neobsahuje statickou metodu Main vhodnou pro vstupní bod.
de: Das Programm enthält keine als Einstiegspunkt geeignete statische Main-Methode.
es: El programa no contiene ningún método 'Main' estático adecuado para un punto de entrada
fr: Le programme ne contient pas de méthode 'Main' statique adaptée à un point d'entrée
it: Il programma non contiene un metodo 'Main' statico appropriato per un punto di ingresso
ja: プログラムは、エントリ ポイントに適切な静的 'Main' メソッドを含んでいません
ko: 프로그램에는 진입점에 적합한 정적 'Main' 메서드가 포함되어 있지 않습니다.
pl: Program nie zawiera statycznej metody „Main” odpowiedniej jako punkt wejścia
pt_br: Programa não contém um método "Main" estático adequado para um ponto de entrada
ru: Программа не содержит статического метода "Main", подходящего для точки входа.
tr: Program, giriş noktası için uygun bir statik 'Main' yöntemi içermiyor
zh_hans: 程序不包含适合于入口点的静态 "Main" 方法
zh_hant: 程式未包含適合進入點的靜態 'Main' 方法

# ERR_ArrayInitializerIncorrectLength
source: An array initializer of length '{0}' is expected
cs: Očekává se inicializátor pole s délkou {0}.
de: Es wird ein Arrayinitialisierer der Länge "{0}" erwartet.
es: Se espera un inicializador de matriz con la longitud '{0}'
fr: Un initialiseur de tableau de longueur '{0}' est attendu
it: È previsto un inizializzatore di matrice di lunghezza '{0}'
ja: 長さが '{0}' の配列初期化子が必要です
ko: 길이가 '{0}'인 배열 이니셜라이저가 필요합니다
pl: Oczekiwano inicjatora tablicy o długości „{0}”
pt_br: Inicializador de matriz de comprimento "{0}" é esperado
ru: Требуется инициализатор массива длиной "{0}".
tr: {0}' yüksekliğinin bir dizi başlatıcısı bekleniyor
zh_hans: 应为一个长度为“{0}”的数组初始值设定项
zh_hant: 必須是長度為 '{0}' 的陣列初始設定式

# ERR_ArrayInitializerExpected
source: A nested array initializer is expected
cs: Očekává se inicializátor vnořeného pole.
de: Ein geschachtelter Arrayinitialisierer wird erwartet.
es: Se espera un inicializador de matriz anidada
fr: Un initialiseur de tableau imbriqué est attendu
it: È previsto un inizializzatore di matrice annidato
ja: 入れ子になった配列初期化子が必要です
ko: 중첩 배열 이니셜라이저가 필요합니다.
pl: Oczekiwano zagnieżdżonego inicjatora tablicy
pt_br: Esperava-se um inicializador de matriz aninhada
ru: Требуется вложенный инициализатор массива.
tr: İç içe bir dizi başlatıcısı bekleniyor
zh_hans: 应输入嵌套数组初始值设定项
zh_hant: 必須是巢狀的陣列初始設定式

# ERR_IllegalVarianceSyntax
source: Invalid variance modifier. Only interface and delegate type parameters can be specified as variant.
cs: Modifikátor odchylky je neplatný. Jako variant můžou být určeny jenom parametry typu delegát nebo rozhraní.
de: Ungültiger Varianzmodifizierer. Nur Schnittstellen- und Delegattypparameter können als Variante angegeben werden.
es: Modificador de varianza no válido. Solo se pueden especificar como variantes parámetros de tipo de interfaz y delegado.
fr: Modificateur de variance non valide. Seuls les paramètres de type d'interface et délégué peuvent être spécifiés comme étant variants.
it: Il modificatore di varianza non è valido. Si possono specificare come varianti solo i parametri di tipo interfaccia o delegato.
ja: 無効な変性修飾子です。バリアントとして指定できるのは、インターフェイスおよびデリゲートの型パラメーターだけです。
ko: 가변성(variance) 한정자가 잘못되었습니다. 인터페이스 및 대리자 형식 매개 변수만 variant로 지정할 수 있습니다.
pl: Nieprawidłowy modyfikator wariancji. Jako wariant można określić tylko parametry typu interface i delegate.
pt_br: Modificador de variância inválido. Apenas os parâmetros do tipo de representante e de interface podem ser especificados como variante.
ru: Недопустимый модификатор вариантности. В качестве варианта допускается указывать только параметры типа интерфейса и делегата.
tr: Geçersiz varyans değiştiricisi. Yalnızca arabirim ve temsilci tür parametreleri varyant olarak belirtilebilir.
zh_hans: 变型修饰符无效。只有接口和委托类型的参数可以指定为变量。
zh_hant: 變異數修飾元無效。只有介面及委派類型參數才可指定為變異數。

# ERR_UnexpectedAliasedName
source: Unexpected use of an aliased name
cs: Neočekávané použití názvu v aliasu
de: Unerwartetes Verwenden eines Aliasnamens.
es: Uso inesperado de un nombre con alias
fr: Utilisation inattendue d'un nom doté d'un alias
it: Uso imprevisto di un nome con alias
ja: エイリアス名の予期しない使用方法です
ko: 예기치 않은 별칭이 지정된 이름의 사용입니다.
pl: Nieoczekiwane użycie nazwy z aliasem
pt_br: Uso inesperado de um nome com alias
ru: Неожиданное использование псевдонима.
tr: Takma adlı bir adın beklenmeyen kullanımı
zh_hans: 意外使用了别名
zh_hant: 未預期的別名用法

# ERR_UnexpectedGenericName
source: Unexpected use of a generic name
cs: Neočekávané použití obecného názvu
de: Unerwartete Verwendung eines generischen Namens.
es: Uso inesperado de un nombre genérico
fr: Utilisation inattendue d'un nom générique
it: Uso imprevisto di un nome generico
ja: ジェネリック名の予期しない使用方法です
ko: 예기치 않은 제네릭 이름의 사용입니다.
pl: Nieoczekiwane użycie nazwy ogólnej
pt_br: Uso inesperado de um nome genérico
ru: Неожиданное использование универсального имени.
tr: Genel bir adın beklenmeyen kullanımı
zh_hans: 意外使用了通用名称
zh_hant: 未預期的泛型名稱用法

# ERR_UnexpectedUnboundGenericName
source: Unexpected use of an unbound generic name
cs: Neočekávané použití odvázaného obecného názvu
de: Unerwartete Verwendung eines ungebundenen generischen Namens.
es: Uso inesperado de un nombre genérico sin enlazar
fr: Utilisation inattendue d'un nom générique indépendant
it: Uso imprevisto di un nome generico non associato
ja: バインドされていないジェネリック名の予期しない使用方法です
ko: 예기치 않게 바인딩되지 않은 제네릭 이름이 사용되었습니다.
pl: Nieoczekiwane użycie niepowiązanej nazwy ogólnej
pt_br: Uso inesperado de um nome genérico não associado
ru: Неожиданное использование несвязанного универсального имени.
tr: İlişkisiz genel bir adın beklenmeyen kullanımı
zh_hans: 意外使用了未绑定的通用名称
zh_hant: 未預期的未繫結泛型名稱用法

# ERR_GlobalStatement
source: Expressions and statements can only occur in a method body
cs: Výrazy a příkazy se můžou vyskytnout jenom v těle metody.
de: Ausdrücke und Anweisungen können nur in einem Methodenkörper verwendet werden.
es: Las expresiones y las instrucciones solo pueden aparecer en un cuerpo de método
fr: Les expressions et instructions ne peuvent figurer que dans le corps de méthode
it: Espressioni e istruzioni possono essere usate solo in un corpo del metodo
ja: 式とステートメントはメソッド本体でのみ発生します
ko: 식과 문은 메서드 본문에만 발생할 수 있습니다.
pl: Wyrażenia i instrukcje mogą znajdować się tylko w treści metody
pt_br: Expressões e instruções podem ocorrer somente em um corpo do método
ru: Выражения и операторы можно использовать только в теле метода.
tr: İfadeler ve deyimler yalnızca bir yöntem gövdesinde oluşabilir
zh_hans: 表达式和语句只能在方法主体中出现
zh_hant: 運算式與陳述式只可出現在方法主體中

# ERR_NamedArgumentForArray
source: An array access may not have a named argument specifier
cs: Přístup k poli nemůže mít specifikátor pojmenovaného argumentu.
de: Ein Arrayzugriff verfügt möglicherweise nicht über einen benannten Argumentspezifizierer.
es: Un acceso de matriz no puede tener un especificador de argumento con nombre
fr: L'accès au tableau ne peut pas avoir un spécificateur d'argument nommé
it: Un accesso a matrice non può includere un identificatore di argomento denominato
ja: 配列のアクセスには名前付き引数の指定子を指定できません
ko: 배열 액세스에는 명명된 인수 지정자를 사용할 수 없습니다.
pl: Dostęp do tablicy nie może mieć specyfikatora argumentu nazwanego
pt_br: Um acesso à matriz não pode ter um especificador de argumento nomeado
ru: Возможно, для доступа к массиву отсутствует спецификатор именованного аргумента.
tr: Dizi erişiminin adlandırılmış bağımsız değişken belirticisi olamaz
zh_hans: 数组访问可能没有命名参数说明符
zh_hant: 陣列存取不能有具名引數規範

# ERR_DefaultValueNotAllowed
source: Default values are not valid in this context.
cs: Výchozí hodnoty nejsou v tomto kontextu platné.
de: Standardwerte sind in diesem Kontext nicht gültig.
es: Los valores predeterminados no son válidos en este contexto.
fr: Les valeurs par défaut ne sont pas valides dans ce contexte.
it: I parametri predefiniti non sono validi in questo contesto.
ja: このコンテキストでは、既定値は無効です。
ko: 이 컨텍스트에서는 기본값은 유효하지 않습니다.
pl: Wartości domyślne w tym kontekście są nieprawidłowe.
pt_br: Valores padrão não são válidos neste contexto.
ru: В этом контексте значения по умолчанию недействительны.
tr: Varsayılan değerler bu bağlamda geçerli değil.
zh_hans: 默认值在此上下文中无效。
zh_hant: 預設值在此內容中無效。

# ERR_CantOpenIcon
source: Error opening icon file {0} -- {1}
cs: Chyba při otevírání souboru ikony {0} -- {1}
de: Fehler beim Öffnen der Symboldatei "{0}": {1}
es: Error al abrir el archivo de icono {0}: {1}
fr: Erreur lors de l'ouverture du fichier d'icône {0} -- {1}
it: Si è verificato un errore durante l'apertura del file icona {0} - {1}
ja: アイコン ファイル {0} を開く際にエラーが発生しました -- {1}
ko: {0} 아이콘 파일을 여는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas otwierania pliku ikony {0} — {1}
pt_br: Erro ao abrir o arquivo de ícones {0} -- {1}
ru: Ошибка при открытии файла значка {0} — {1}
tr: {0} ikon dosyası açılırken hata -- {1}
zh_hans: 打开图标文件 {0} 时出错 -- {1}
zh_hant: 開啟圖示檔 {0} 時發生錯誤 -- {1}
