Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_SwitchExpressionValueExpected
source: The switch expression must be a value; found '{0}'.
cs: Výraz switch musí být hodnota. Bylo nalezeno: {0}.
de: Der switch-Ausdruck muss ein Wert sein. Gefunden wurde "{0}".
es: La expresión switch debe ser un valor. Se encontró {0}.
fr: L'expression switch doit être une valeur. '{0}' trouvé.
it: L'espressione switch deve essere un valore. È stato trovato '{0}'.
ja: switch 式は値である必要があります。'{0}' が見つかりました。
ko: switch 식은 값이어야 하는데 '{0}'을(를) 찾았습니다.
pl: Wyrażenie switch musi być wartością; znaleziono element „{0}”.
pt_br: A expressão switch deve ser um valor. {0} foi encontrado.
ru: Выражение оператора switch должно быть значением; найдено "{0}".
tr: Switch ifadesi bir değer olmalıdır; '{0}' bulundu.
zh_hans: switch 表达式必须是一个值；找到的是“{0}”。
zh_hant: switch 運算式必須是值; 但找到的是 '{0}'。

# ERR_PatternWrongType
source: An expression of type '{0}' cannot be handled by a pattern of type '{1}'.
cs: Výraz typu {0} nelze zpracovat vzorem typu {1}.
de: Ein Ausdruck vom Typ "{0}" kann nicht von einem Muster vom Typ "{1}" verarbeitet werden.
es: Un patrón de tipo "{1}" no puede controlar una expresión de tipo "{0}".
fr: Une expression de type '{0}' ne peut pas être gérée par un modèle de type '{1}'.
it: Un'espressione di tipo '{0}' non può essere gestita da un criterio di tipo '{1}'.
ja: 種類 '{0}' の式は、種類 '{1}' のパターンで処理することができません。
ko: {0}' 형식의 식을 '{1}' 형식의 패턴으로 처리할 수 없습니다.
pl: Wyrażenie typu „{0}” nie może być obsługiwane przez wzorzec typu „{1}”.
pt_br: Uma expressão do tipo '{0}' não pode ser manipulada por um padrão do tipo '{1}'.
ru: Выражение типа "{0}" не может быть обработано шаблоном типа "{1}".
tr: {0}' türündeki bir ifade, '{1}' türündeki bir desenle işlenemez.
zh_hans: “{1}”类型的模式无法处理“{0}”类型的表达式。
zh_hant: 類型為 '{1}' 的模式無法處理類型為 '{0}' 的運算式。

# WRN_AttributeIgnoredWhenPublicSigning
source: Attribute '{0}' is ignored when public signing is specified.
cs: Atribut {0} se ignoruje, když je zadané veřejné podepisování.
de: Das Attribut "{0}" wird ignoriert, wenn öffentliche Signierung angegeben wird.
es: El atributo "{0}" se ignora cuando se especifica la firma pública.
fr: L'attribut '{0}' est ignoré quand une signature publique est spécifiée.
it: L'attributo '{0}' viene ignorato quando si specifica la firma pubblica.
ja: 公開署名が指定されると、属性 '{0}' は無視されます。
ko: 공개 서명이 지정된 경우 '{0}' 특성이 무시됩니다.
pl: Atrybut „{0}” jest ignorowany w przypadku określenia podpisywania publicznego.
pt_br: O atributo '{0}' é ignorado quando a autenticação pública é especificada.
ru: Атрибут "{0}" пропускается при указании общедоступного подписывания.
tr: Ortak imzalama belirtildiğinde '{0}' özniteliği yoksayılır.
zh_hans: 指定公共签名时，将忽略特性“{0}”。
zh_hant: 如有指定公用簽章，屬性 '{0}' 將予忽略。

# WRN_AttributeIgnoredWhenPublicSigning_Title
source: Attribute is ignored when public signing is specified.
cs: Atribut se ignoruje, když je zadané veřejné podepisování.
de: Das Attribut wird ignoriert, wenn öffentliche Signierung angegeben wird.
es: El atributo se omite cuando se especifica la firma pública.
fr: L'attribut est ignoré quand une signature publique est spécifiée.
it: L'attributo viene ignorato quando si specifica la firma pubblica.
ja: 公開署名が指定されると、属性は無視されます。
ko: 공개 서명이 지정된 경우 특성이 무시됩니다.
pl: Atrybut jest ignorowany w przypadku określenia podpisywania publicznego.
pt_br: O atributo é ignorado quando a autenticação pública é especificada.
ru: Атрибут пропускается при указании общедоступного подписывания.
tr: Ortak imzalama belirtildiğinde öznitelik yoksayılır.
zh_hans: 指定公共签名时，将忽略特性。
zh_hant: 如有指定公用簽章，屬性將予忽略。

# ERR_OptionMustBeAbsolutePath
source: Option '{0}' must be an absolute path.
cs: Možnost {0} musí být absolutní cesta.
de: Die Option "{0}" muss ein absoluter Pfad sein.
es: La opción '{0}' debe ser una ruta de acceso absoluta.
fr: L'option '{0}' doit être un chemin absolu.
it: L'opzione '{0}' deve essere un percorso assoluto.
ja: オプション '{0}' は絶対パスにする必要があります。
ko: 옵션 '{0}'은(는) 절대 경로여야 합니다.
pl: Opcja „{0}” musi być ścieżką bezwzględną.
pt_br: A opção '{0}' deve ser um caminho absoluto.
ru: Параметр "{0}" должен быть абсолютным путем.
tr: {0}' seçeneği mutlak yol olmalıdır.
zh_hans: 选项“{0}”必须是绝对路径。
zh_hant: 選項 '{0}' 必須是絕對路徑。

# ERR_ConversionNotTupleCompatible
source: Tuple with {0} elements cannot be converted to type '{1}'.
cs: Řazená kolekce členů s {0} elementy se nedá převést na typ {1}.
de: Ein Tupel mit {0} Elementen kann nicht in den Typ "{1}" konvertiert werden.
es: La tupla con {0} elementos no se puede convertir al tipo '{1}'.
fr: Impossible de convertir un tuple avec {0} éléments en type '{1}'.
it: Non è possibile convertire la tupla con {0} elementi nel tipo '{1}'.
ja: {0} 要素でのタプルを型 '{1}' に変換できません。
ko: {0}개 요소가 있는 튜플을 '{1}' 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować krotki z {0} elementami na typ „{1}”.
pt_br: A tupla com {0} elementos não pode ser convertida para o tipo '{1}'.
ru: Кортеж со следующим числом элементов: {0} невозможно преобразовать в тип "{1}".
tr: {0} öğesi olan tanımlama grubu '{1}' türüne dönüştürülemez.
zh_hans: 包含 {0} 个元素的元组不能转换为类型 "{1}"。
zh_hant: 具有 {0} 元素的 Tuple 無法轉換為類型 '{1}'。

# IDS_FeatureOutVar
source: out variable declaration
cs: deklarace externí proměnné
de: out-Variablendeklaration
es: declaración de variable out
fr: déclaration de variable de sortie
it: dichiarazione di variabile out
ja: 出力変数の宣言
ko: 출력 변수 선언
pl: deklaracja zmiennej wyjściowej
pt_br: declaração de variável externa
ru: объявление переменной с параметром OUT
tr: out değişkeni bildirimi
zh_hans: 化出变量声明
zh_hant: out 變數宣告

# ERR_TypeInferenceFailedForImplicitlyTypedOutVariable
source: Cannot infer the type of implicitly-typed out variable '{0}'.
cs: Nejde odvodit typ implicitně typované externí proměnné {0}.
de: Der Typ der implizit typisierten out-Variablen "{0}" kann nicht abgeleitet werden.
es: No se puede inferir el tipo de variable out con tipo implícito '{0}'.
fr: Impossible de déduire le type de variable de sortie implicitement typée. '{0}'.
it: Non è possibile dedurre il tipo della variabile out '{0}' tipizzata in modo implicito.
ja: 暗黙的に型指定された out 変数 '{0}' の型を推論できません。
ko: 암시적으로 형식화된 출력 변수 '{0}'의 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu zmiennej wyjściowej z niejawnym typem „{0}”.
pt_br: Não é possível inferir o tipo da variável out de tipo implícito '{0}'.
ru: Невозможно определить тип неявно типизированной переменной "out" "{0}".
tr: Türü örtük olarak belirlenen '{0}' out değişkeninin türü çıkarsanamıyor.
zh_hans: 无法推断出隐式类型化 out 变量“{0}”的类型。
zh_hant: 無法推斷隱含型別 out 變數 '{0}' 的類型。

# ERR_TypeInferenceFailedForImplicitlyTypedDeconstructionVariable
source: Cannot infer the type of implicitly-typed deconstruction variable '{0}'.
cs: Nejde odvodit typ dekonstrukční proměnné {0} s implicitním typem.
de: Der Typ der implizit typisierten Dekonstruktionsvariablen "{0}" kann nicht abgeleitet werden.
es: No se puede inferir el tipo de variable de desconstrucción con tipo implícito '{0}'.
fr: Impossible de déduire le type de la variable de déconstruction implicitement typée '{0}'.
it: Non è possibile dedurre il tipo della variabile di decostruzione '{0}' tipizzata in modo implicito.
ja: 暗黙的に型指定された分解変数 '{0}' の型を推論できません。
ko: 암시적으로 형식화된 분해 변수 '{0}'의 형식을 유추할 수 없습니다.
pl: Nie można wnioskować typu wprowadzonej niejawnie zmiennej dekonstrukcji „{0}“.
pt_br: Não é possível inferir o tipo da variável de desconstrução digitada implicitamente '{0}'.
ru: Не удается вывести тип переменной неявно типизированных деконструирований "{0}".
tr: Türü örtük olarak belirlenen '{0}' ayrıştırma değişkeninin türü çıkarsanamıyor.
zh_hans: 无法推断隐式类型的析构变量“{0}”的类型。
zh_hant: 無法推斷隱含型別解構變數 '{0}' 的類型。

# ERR_DiscardTypeInferenceFailed
source: Cannot infer the type of implicitly-typed discard.
cs: Nejde odvodit typ zahození s implicitním typem.
de: Der Typ des implizit typisierten Verwerfungsvorgangs kann nicht abgeleitet werden.
es: No se puede deducir el tipo de descarte con tipo implícito.
fr: Impossible de déduire le type d'une variable implicitement typée abandonnée.
it: Non è possibile dedurre il tipo della variabile discard tipizzata in modo implicito.
ja: 暗黙的に型指定された破棄の型を推論できません。
ko: 암시적으로 형식화된 삭제 형식을 유추할 수 없습니다.
pl: Nie można wywnioskować typu odrzucenia o typie określonym niejawnie.
pt_br: Não é possível inferir o tipo de descarte de tipo implícito.
ru: Невозможно определить тип неявно типизированной отмены.
tr: Türü örtük olarak belirlenmiş atma türü çıkarsanamıyor.
zh_hans: 无法推断隐式类型放弃的类型。
zh_hant: 無法推斷隱含型別捨棄的類型。

# ERR_DeconstructWrongCardinality
source: Cannot deconstruct a tuple of '{0}' elements into '{1}' variables.
cs: Řazenou kolekci členů s {0} prvky nejde dekonstruovat na proměnné {1}.
de: Ein Tupel von "{0}" Elementen kann nicht in "{1}" Variablen dekonstruiert werden.
es: No se puede deconstruir una tupla de '{0}' elementos en '{1}' variables.
fr: Impossible de déconstruire un tuple de '{0}' éléments en '{1}' variables.
it: Non è possibile decostruire una tupla di '{0}' elementi in '{1}' variabili.
ja: '{0}' 要素のタプルを '{1}' 変数に分解することはできません。
ko: {0}' 요소의 튜플을 '{1}' 변수로 분해할 수 없습니다.
pl: Nie można dekonstruować krotki „{0}” elementów do „{1}” zmiennych.
pt_br: Não é possível desconstruir uma tupla de '{0}' elementos em '{1}' variáveis.
ru: Невозможно деконструировать кортеж элементов "{0}" на переменные "{1}".
tr: {0}' öğelerinden oluşan bir demet '{1}' değişkenlerine ayrıştırılamıyor.
zh_hans: 无法将“{0}”元素的元组析构为“{1}”变量。
zh_hant: 無法將 '{0}' 項目的元組解構為 '{1}' 變數。

# ERR_CannotDeconstructDynamic
source: Cannot deconstruct dynamic objects.
cs: Dynamické objekty nejde dekonstruovat.
de: Dynamische Objekte können nicht dekonstruiert werden.
es: No se pueden deconstruir los objetos dinámicos.
fr: Impossible de déconstruire des objets dynamiques.
it: Non è possibile decostruire oggetti dinamici.
ja: 動的オブジェクトを分解することはできません。
ko: 동적 개체를 분해할 수 없습니다.
pl: Nie można dekonstruować obiektów dynamicznych.
pt_br: Não é possível desconstruir objetos dinâmicos.
ru: Невозможно деконструировать динамические объекты.
tr: Dinamik nesneler ayrıştırılamıyor.
zh_hans: 无法析构动态对象。
zh_hant: 無法解構動態物件。

# ERR_DeconstructTooFewElements
source: Deconstruction must contain at least two variables.
cs: Dekonstrukce musí obsahovat aspoň dvě proměnné.
de: Die Dekonstruktion muss mindestens zwei Variablen enthalten.
es: La desconstrucción debe contener al menos dos variables.
fr: La déconstruction doit contenir au moins deux variables.
it: La decostruzione deve contenere almeno due variabili.
ja: 分解は少なくとも 2 つの変数を含む必要があります。
ko: 분해에는 변수가 두 개 이상 있어야 합니다.
pl: Dekonstrukcja musi zawierać co najmniej dwie zmienne.
pt_br: A desconstrução deve conter pelo menos duas variáveis.
ru: Деконструирование должно иметь не менее двух переменных.
tr: Ayrıştırma en az iki değişken içermelidir.
zh_hans: 析构函数必须包含至少两个变量。
zh_hant: 解構必須包含至少兩個變數。

# WRN_TupleLiteralNameMismatch
source: The tuple element name '{0}' is ignored because a different name or no name is specified by the target type '{1}'.
cs: Název elementu řazené kolekce členů {0} se ignoruje, protože cílovým typem {1} je určený jiný nebo žádný název.
de: Der Tupelelementname "{0}" wird ignoriert, da vom Zieltyp "{1}" ein anderer oder kein Name angegeben ist.
es: No se tiene en cuenta el nombre de elemento de tupla "{0}" porque el tipo de destino "{1}" ha especificado otro nombre o no ha especificado ninguno.
fr: Le nom d'élément tuple '{0}' est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié par le type cible '{1}'.
it: Il nome dell'elemento di tupla '{0}' viene ignorato perché nel tipo di destinazione '{1}' è specificato un nome diverso o non è specificato alcun nome.
ja: ターゲット型 '{1}' によって異なる名前が指定されている、または名前が何も指定されていないため、タプル要素名 '{0}' は無視されます。
ko: 튜플 요소 이름 '{0}'은(는) 대상 형식 '{1}'에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki „{0}” została zignorowana, ponieważ typ elementu docelowego „{1}” określa inną nazwę lub nie określa żadnej nazwy.
pt_br: O nome do elemento de tupla '{0}' foi ignorado porque um nome diferente ou nenhum nome foi especificado pelo tipo de destino '{1}'.
ru: Имя элемента кортежа "{0}" игнорируется, так как целевым типом "{1}" задано другое имя либо имя не задано.
tr: {0}' demet öğesi adı, hedef tür olan '{1}' tarafından farklı bir ad belirtildiği veya hiçbir ad belirtilmediği için yoksayılıyor.
zh_hans: 由于目标类型“{1}”指定了其他名称或未指定名称，因此元组元素名称“{0}”被忽略。
zh_hant: 因為目標類型 '{1}' 指定了不同的名稱或未指定名稱，所以會忽略元組項目名稱 '{0}'。

# WRN_TupleLiteralNameMismatch_Title
source: The tuple element name is ignored because a different name or no name is specified by the assignment target.
cs: Název elementu řazené kolekce členů se ignoruje, protože cílem přiřazení je určený jiný nebo žádný název.
de: Der Tupelelementname wird ignoriert, da vom Zuweisungsziel ein anderer oder kein Name angegeben ist.
es: No se tiene en cuenta el nombre de elemento de tupla porque el destino de la asignación ha especificado otro nombre o no ha especificado ninguno.
fr: Le nom d'élément tuple est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié par la cible de l'assignation.
it: Il nome dell'elemento di tupla viene ignorato perché nella destinazione di assegnazione è specificato un nome diverso o non è specificato alcun nome.
ja: 代入先によって異なる名前が指定されているか、名前が何も指定されていないため、タプル要素名は無視されます。
ko: 튜플 요소 이름은 할당 대상에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki została zignorowana, ponieważ element docelowy przypisania określa inną nazwę lub nie określa żadnej nazwy.
pt_br: O nome do elemento de tupla é ignorado porque um nome diferente ou nenhum nome foi especificado pelo destino de atribuição.
ru: Имя элемента кортежа игнорируется, так как целевым объектом назначения задано другое имя либо имя не задано.
tr: Demet öğesi adı, atama hedefi tarafından farklı bir ad belirtildiği veya hiçbir ad belirtilmediği için yoksayılıyor.
zh_hans: 由于分配目标指定了其他名称或未指定名称，因此元组元素名称被忽略。
zh_hant: 因為指派目標指定了不同的名稱或未指定名稱，所以會忽略元組項目名稱。

# ERR_PredefinedValueTupleTypeMustBeStruct
source: Predefined type '{0}' must be a struct.
cs: Předdefinovaný typ {0} musí být struktura.
de: Der vordefinierte Typ "{0}" muss eine Struktur sein.
es: El tipo '{0}' predefinido debe ser un elemento struct.
fr: Le type prédéfini '{0}' doit être un struct.
it: Il tipo predefinito '{0}' deve essere uno struct.
ja: 定義済みの型 '{0}' は構造体である必要があります。
ko: 미리 정의된 형식 '{0}'은(는) 구조체여야 합니다.
pl: Wstępnie zdefiniowany typ „{0}” musi być strukturą.
pt_br: O tipo predefinido '{0}' deve ser um struct.
ru: Предопределенный тип "{0}" должен быть структурой.
tr: Önceden tanımlanmış '{0}' türü bir yapı olmalıdır.
zh_hans: 预定义类型“{0}”必须是一个结构。
zh_hant: 預先定義的類型 '{0}' 必須為結構。

# ERR_NewWithTupleTypeSyntax
source: 'new' cannot be used with tuple type. Use a tuple literal expression instead.
cs: 'new není možné použít s typem řazené kolekce členů. Použijte raději literálový výraz řazené kolekce členů.
de: 'Mit dem Tupeltyp kann "new" nicht verwendet werden. Verwenden Sie stattdessen einen literalen Tupelausdruck.
es: '"new" no se puede usar con un tipo de tupla. Use una expresión literal de tupla en su lugar.
fr: 'Impossible d'utiliser 'new' avec le type tuple. Utilisez une expression littérale de tuple à la place.
it: 'Non è possibile usare 'new' con il tipo tupla. Usare un'espressione letterale di tupla.
ja: 'new' はタプル型では併用できません。代わりに、タプル リテラル式を使用します。
ko: 'new'는 튜플 형식과 함께 사용할 수 없습니다. 대신 튜플 리터럴 식을 사용하세요.
pl: 'Atrybutu „new” nie można użyć z typem krotki. Użyj wyrażenia literału krotki.
pt_br: 'new' não pode ser usado com o tipo da tupla. Use uma expressão literal da tupla no lugar.
ru: '"new" невозможно использовать с типом кортежа. Вместо этого используйте литеральное выражение кортежа.
tr: 'new' demet türü ile kullanılamaz. Bunun yerine demet sabit ifadesi kullanın.
zh_hans: "new" 不能与元组类型共同使用。请改用元组字面量表达式。
zh_hant: 'new' 不得搭配元組類型使用。請改用元組常值運算式。

# ERR_DeconstructionVarFormDisallowsSpecificType
source: Deconstruction 'var (...)' form disallows a specific type for 'var'.
cs: Forma dekonstrukce var (...) neumožňuje použít pro var konkrétní typ.
de: Durch die Dekonstruktion der Form "var (...)" wird ein bestimmter Typ für "var" unzulässig.
es: El formato de desconstrucción 'var (...)' no permite especificar un tipo determinado para 'var'.
fr: La déconstruction de 'var (...)' form interdit un type spécifique pour 'var'.
it: Nel form di decostruzione 'var (...)' non è consentito un tipo specifico per 'var'.
ja: 分解 `変数 (...)` フォームは特定の種類の '変数' を許可しません。
ko: 분해 'var (...)' 양식에서는 'var'에 특정 형식을 사용할 수 없습니다.
pl: Forma „var (...)” dekonstrukcji nie zezwala na specyficzny typ wartości „var”.
pt_br: O formulário de desconstrução 'var (...)' não permite um tipo específico para 'var'.
ru: Форма деконструирования "var (...)" не разрешает использовать конкретный тип для "var".
tr: var (...)' biçiminin ayrıştırması, 'var' için belirli bir türe izin vermiyor.
zh_hans: “var (...)”形式的解构表达式不允许将“var”替换为某一特定类型。
zh_hant: 解構 `var (...)` 表單不允許 'var' 的特定類型。

# ERR_TupleElementNamesAttributeMissing
source: Cannot define a class or member that utilizes tuples because the compiler required type '{0}' cannot be found. Are you missing a reference?
cs: Nejde definovat třídu nebo člen, který používá řazenou kolekci členů, protože se nenašel kompilátor požadovaný typem {0}. Chybí vám odkaz?
de: Es kann keine Klasse bzw. kein Member definiert werden, die oder der Tupel verwendet, weil der für den Compiler erforderliche Typ "{0}" nicht gefunden wurde. Fehlt ggf. ein Verweis?
es: No se puede definir una clase o un miembro que utiliza tuplas porque no se encuentra el tipo requerido de compilador '{0}'. ¿Falta alguna referencia?
fr: Impossible de définir une classe ou un membre qui utilise des tuples, car le type '{0}' nécessaire au compilateur est introuvable. Une référence est-elle manquante ?
it: Non è possibile definire una classe o un membro che usa tuple perché non è stato trovato il tipo '{0}' richiesto dal compilatore. Probabilmente manca un riferimento.
ja: コンパイラの必須型 '{0}' が見つからないため、タプルを利用するクラスまたはメンバーを定義できません。参照が指定されていることを確認してください。
ko: 컴파일러에서 요구하는 '{0}' 형식을 찾지 못했기 때문에 튜플을 사용하는 클래스 또는 멤버를 정의할 수 없습니다. 참조가 있는지 확인하세요.
pl: Nie można zdefiniować klasy lub składowej, która wykorzystuje krotki, ponieważ nie można znaleźć wymaganego typu kompilatora „{0}”. Czy brakuje odwołania?
pt_br: Não é possível definir uma classe ou membro que utiliza tuplas porque o tipo '{0}' necessário de compilador não pode ser localizado. Uma referência está ausente?
ru: Невозможно определить класс или элемент, использующий кортежи, так как не удалось найти необходимый тип компилятора ({0}). Отсутствует ссылка?
tr: {0}' türünü gerektiren derleyici bulunamadığından demetleri kullanan sınıf veya üye tanımlanamıyor. Bir başvuru eksik olabilir mi?
zh_hans: 由于找不到编译器必需的类型“{0}”，因此无法使用元组来定义类或成员。是否缺少引用?
zh_hant: 因為找不到編譯器所需的類型 '{0}'，所以無法定義利用元組的類別或成員。是否遺漏參考?

# ERR_ExplicitTupleElementNamesAttribute
source: Cannot reference 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitly. Use the tuple syntax to define tuple names.
cs: System.Runtime.CompilerServices.TupleElementNamesAttribute nejde odkazovat explicitně. K definici názvů řazené kolekce členů použijte její syntaxi.
de: Auf "System.Runtime.CompilerServices.TupleElementNamesAttribute" kann nicht explizit verwiesen werden. Verwenden Sie die Tupelsyntax zum Definieren von Tuplenamen.
es: No se puede hacer referencia a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explícitamente. Use la sintaxis de tupla para definir nombres de tupla.
fr: Impossible de référencer 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitement. Utilisez la syntaxe des tuples pour définir les noms de tuples.
it: Non è possibile fare riferimento a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' in modo esplicito. Usare la sintassi della tupla per definire i nomi di tupla.
ja: System.Runtime.CompilerServices.TupleElementNamesAttribute' を明示的に参照できません。タプル構文を使用してタプル名を定義します。
ko: System.Runtime.CompilerServices.TupleElementNamesAttribute'를 명시적으로 참조할 수 없습니다. 튜플 구문을 사용하여 튜플 이름을 정의하세요.
pl: Nie można odwołać się do atrybutu „System.Runtime.CompilerServices.TupleElementNamesAttribute” jawnie. Użyj składni krotek, aby zdefiniować nazwy krotek.
pt_br: Não é possível fazer referência a 'System.Runtime.CompilerServices.TupleElementNamesAttribute' explicitamente. Use a sintaxe de tupla para definir os nomes das tuplas.
ru: Невозможно явным образом добавить ссылку на "System.Runtime.CompilerServices.TupleElementNamesAttribute". Используйте синтаксис кортежа для определения имен кортежа.
tr: System.Runtime.CompilerServices.TupleElementNamesAttribute' öğesine açıkça başvurulamıyor. Demet adlarını tanımlamak için demet söz dizimini kullanın.
zh_hans: 无法显式引用 "System.Runtime.CompilerServices.TupleElementNamesAttribute"。请使用元组语法指定元组名称。
zh_hant: 無法明確參考 'System.Runtime.CompilerServices.TupleElementNamesAttribute'。請使用元組語法定義元組名稱。

# ERR_ExpressionTreeContainsOutVariable
source: An expression tree may not contain an out argument variable declaration.
cs: Strom výrazů nesmí obsahovat deklaraci proměnné argumentu out.
de: Ein Ausdrucksbaum darf keine Variablendeklaration mit einem out-Argument enthalten.
es: Un árbol de expresión no puede contener una declaración de variable de argumento out.
fr: Une arborescence de l'expression ne peut pas contenir une déclaration de variable d'argument out.
it: Un albero delle espressioni non può contenere una dichiarazione di variabile argomento out.
ja: 式のツリーは、出力引数の変数宣言を含むことはできません。
ko: 식 트리에는 out 인수 변수 선언을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać deklaracji zmiennej argumentu wyjściowego.
pt_br: Uma árvore de expressão não pode conter uma declaração de variável de argumento out.
ru: Дерево выражений не может содержать объявление переменной аргумента out.
tr: İfade ağacı, out bağımsız değişkeni bildirimi içeremez.
zh_hans: 表达式树不能包含输出参数变量声明。
zh_hant: 運算式樹狀架構不得包含 out 引數變數宣告。

# ERR_ExpressionTreeContainsDiscard
source: An expression tree may not contain a discard.
cs: Strom výrazů nesmí obsahovat zahození.
de: Eine Ausdrucksbaumstruktur enthält "discard" unter Umständen nicht.
es: Un árbol de expresión no puede contener un descarte.
fr: Une arborescence de l'expression ne peut pas contenir d'abandon.
it: Un albero delle espressioni non può contenere una funzionalità discard.
ja: 式ツリーに discard を含めることはできません。
ko: 식 트리에 취소를 사용할 수 없습니다.
pl: Drzewo wyrażeń nie może zawierać odrzucenia.
pt_br: Uma árvore de expressão não pode conter um descarte.
ru: Дерево выражений не может содержать отмену.
tr: İfade ağacı bir atma eylemi içeremez.
zh_hans: 表达式树不能包含放弃。
zh_hant: 運算式樹狀架構不可包含 discard。

# ERR_ExpressionTreeContainsIsMatch
source: An expression tree may not contain an 'is' pattern-matching operator.
cs: Strom výrazů nesmí obsahovat operátor odpovídající vzoru is.
de: Ein Ausdrucksbaum darf keinen Mustervergleichsoperator "is" enthalten.
es: Un árbol de expresión no puede contener un operador de coincidencia de patrones 'is'.
fr: Une arborescence de l'expression ne peut pas contenir l'opérateur de comparaison avec critères spéciaux 'is'.
it: Un albero delle espressioni non può contenere un operatore dei criteri di ricerca 'is'.
ja: 式のツリーは、'is' パターン マッチング演算子を含むことはできません。
ko: 식 트리에는 'is' 패턴 일치 연산자를 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać operatora zgodnego z wzorcem „is”.
pt_br: Uma árvore de expressão não pode conter um operador 'is' com padrões correspondentes.
ru: Дерево выражений не может содержать оператор соответствия шаблону is.
tr: İfade ağacı, 'is' desen eşleştirme işleci içeremez.
zh_hans: 表达式树不能包含 "is" 模式匹配运算符。
zh_hant: 運算式樹狀架構不得包含 'is' 模式比對運算子。
