Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RefReturnScopedParameter2
source: Cannot return by reference a member of parameter '{0}' because it is scoped to the current method
cs: Člen parametru {0} není možné vrátit podle odkazu, protože je přiřazen k aktuální metodě.
fr: Impossible de retourner par référence un membre du paramètre '{0}', car il est étendu à la méthode actuelle
it: Non è possibile restituire per riferimento un membro del parametro '{0}' perché ha come ambito il metodo corrente
ja: 現在のメソッドに範囲指定されているため、パラメーター '{0}' のメンバーを参照渡しで返すことはできません
pl: Nie można zwrócić przez odwołanie składowej parametru „{0}”, ponieważ jest on ograniczony do bieżącej metody
pt_br: Não é possível retornar por referência um membro do parâmetro '{0}' porque está no escopo do método atual
ru: Не удается вернуть по ссылке элемент параметра "{0}", так как он имеет область действия текущего метода
zh_hans: 无法按引用参数“{0}”的成员返回，因为它的作用域为当前方法
zh_hant: 無法藉傳址方式傳回參數 '{0}' 的成員，因為它的範圍是目前的方法

# ERR_RefReturningPropertiesCannotBeRequired
source: Ref returning properties cannot be required.
cs: Ref vracející vlastnosti se nedá vyžadovat.
fr: Impossible d’exiger une référence retournant des propriétés.
it: Il riferimento che restituisce le proprietà non può essere obbligatorio.
ja: プロパティを返す参照は必要ありません。
pl: Odwołanie zwracające właściwości nie może być wymagane.
pt_br: Não se pode exigir a devolução de propriedades de referência.
ru: Возвращаемые свойства ссылки не могут быть обязательными.
zh_hans: Ref 返回属性是必需的。
zh_hant: 無法要求 Ref 傳回屬性。

# ERR_RefStructConstraintAlreadySpecified
source: 'ref struct' is already specified.
fr: « ref struct » est déjà spécifié.
it: 'ref struct' è già specificato.
pl: „Struktura ref” jest już określona.
pt_br: "ref struct" já está especificado.
ru: "ref struct" уже указан.
zh_hans: 已指定“ref 结构”。
zh_hant: 已指定了 'ref struct'。

# ERR_RefStructDoesNotSupportDefaultInterfaceImplementationForMember
source: '{0}' cannot implement interface member '{1}' for ref struct '{2}'.
fr: « {0} » ne peut pas implémenter le membre d’interface « {1} » pour le type ref struct « {2} ».
it: '{0}' non può implementare il membro di interfaccia '{1}' per il ref struct '{2}'.
pl: Element „{0}” nie może zaimplementować składowej interfejsu „{1}” dla struktury ref „{2}”.
pt_br: "{0}" não pode implementar o membro da interface "{1}" para o ref struct "{2}".
ru: "{0}" не удается реализовать элемент интерфейса "{1}" для ref struct "{2}".
zh_hans: "{0}" 无法实现 ref 结构 "{2}" 的接口成员 "{1}"。
zh_hant: '{0}' 無法為 ref struct '{2}' 實作介面成員'{1}'。

# ERR_RelationalPatternWithNaN
source: Relational patterns may not be used for a floating-point NaN.
cs: Relační vzory se nedají použít pro hodnotu Není číslo s plovoucí desetinnou čárkou.
fr: Les modèles relationnels ne peuvent pas être utilisés pour une valeur NaN à virgule flottante.
it: Non è possibile usare i criteri relazionali per un valore NaN a virgola mobile.
ja: リレーショナル パターンは、浮動小数点の NaN に使用することはできません。
pl: Wzorców relacyjnych nie można używać na potrzeby zmiennoprzecinkowej wartości NaN.
pt_br: Os padrões relacionais não podem ser usados para um NaN de ponto flutuante.
ru: Реляционные шаблоны не могут использоваться для NaN с плавающей запятой.
zh_hans: 关系模式可能不能用于浮点 NaN。
zh_hant: 浮點 NaN 不可使用關聯性模式。

# ERR_RequiredMemberCannotBeHidden
source: Required member '{0}' cannot be hidden by '{1}'.
cs: Požadovaný člen {0} nemůže být skrytý {1}.
fr: Le '{0}' de membre requis ne peut pas être masqué par '{1}'.
it: Il membro obbligatorio '{0}' non può essere nascosto da '{1}'.
ja: 必要なメンバー '{0}' を '{1}' で非表示にすることはできません。
pl: Wymagana składowa „{0}” nie może być ukrywana przez „{1}”.
pt_br: O membro requerido '{0}' não pode ser ocultado por '{1}'.
ru: Требуемый элемент "{0}" не может быть скрыт элементом "{1}".
zh_hans: '{0}' 无法隐藏所需的成员 '{1}'。
zh_hant: '{1}' 無法隱藏必要成員 '{0}'。

# ERR_RequiredMemberCannotBeLessVisibleThanContainingType
source: Required member '{0}' cannot be less visible or have a setter less visible than the containing type '{1}'.
cs: Požadovaný člen {0} nemůže být méně viditelný nebo mít metodu setter méně viditelnou než obsahující typ {1}.
fr: Le membre obligatoire '{0}' ne peut pas être moins visible ou avoir un setter moins visible que le type conteneur '{1}'.
it: Il membro obbligatorio '{0}' non può essere meno visibile o avere un setter meno visibile del tipo contenitore '{1}'.
ja: 必要なメンバー '{0}' の表示を減らす、また含まれる型の '{1}' より小さいセッターの表示を設定することはできません。
pl: Wymagana składowa „{0}” nie może być mniej widoczna lub mieć metody ustawiającej mniej widocznej niż typ zawierający „{1}”.
pt_br: O membro requerido '{0}' pode ser menos visível ou ter um setter menos visível do que o tipo que o contém'{1}'.
ru: Обязательный элемент "{0}" или его метод задания не может быть менее видимым, чем содержащий тип "{1}".
zh_hans: 所需成员 '{0}' 的可见性不能低于包含类型 '{1}' 的可见性或更小。
zh_hant: 必要成員 '{0}' 可見度不能較低，或 setter 的可見程度低於包含的類型 '{1}'。

# ERR_RequiredMemberMustBeSet
source: Required member '{0}' must be set in the object initializer or attribute constructor.
cs: V inicializátoru objektu nebo konstruktoru atributu musí být nastaven požadovaný člen {0}.
fr: Le membre obligatoire '{0}' doit être défini dans l’initialiseur d’objet ou le constructeur d’attribut.
it: Il membro obbligatorio '{0}' deve essere impostato nell'inizializzatore di oggetto o nel costruttore dell’attributo.
ja: 必要なメンバー '{0}' は、オブジェクト初期化子または属性コンストラクターに設定する必要があります。
pl: Wymagana składowa „{0}” musi być ustawiona w konstruktorze inicjatora obiektów lub atrybutów.
pt_br: O membro requerido '{0}' deve ser definido no inicializador de objeto ou construtor do atributo.
ru: Необходимо задать обязательный элемент "{0}" в инициализаторе объектов или в конструкторе атрибутов.
zh_hans: 必须在对象初始值设定项或属性构造函数中设置所需的成员'{0}'。
zh_hant: 必須在物件初始設定式或屬性建構函式中設定必要的成員 '{0}'。

# ERR_RequiredMemberMustBeSettable
source: Required member '{0}' must be settable.
cs: Požadovaný člen {0} musí být nastavitelný.
fr: Le membre obligatoire '{0}' doit être définissable.
it: Il membro obbligatorio '{0}' deve essere impostabile.
ja: 必要なメンバー '{0}' は設定可能である必要があります。
pl: Wymagana składowa „{0}” musi być konfigurowalna.
pt_br: O membro requerido '{0}' deve ser ajustável.
ru: Обязательный элемент "{0}" должен быть задаваемым.
zh_hans: 必需的成员 '{0}' 必须可设置。
zh_hant: 必要的成員 '{0}' 必須可設定。

# ERR_RequiredMembersBaseTypeInvalid
source: The required members list for the base type '{0}' is malformed and cannot be interpreted. To use this constructor, apply the 'SetsRequiredMembers' attribute.
cs: Seznam požadovaných členů pro základní typ {0} je poškozený a nelze ho interpretovat. Pokud chcete použít tento konstruktor, použijte atribut SetsRequiredMembers.
fr: La liste des membres requis pour le type de base '{0}' est incorrecte et ne peut pas être interprétée. Pour utiliser ce constructeur, appliquez l’attribut 'SetsRequiredMembers'.
it: L'elenco dei membri obbligatori per il tipo di base '{0}' non è valido e non può essere interpretato. Per utilizzare questo costruttore, applicare l'attributo 'SetsRequiredMembers'.
ja: 基本データ型 '{0}' に必要なメンバーの一覧の形式が正しくないため、解釈できません。このコンストラクターを使用するには、'SetsRequiredMembers' 属性を適用してください。
pl: Lista wymaganych składowych dla typu podstawowego „{0}” jest źle sformułowana i nie można jej zinterpretować. Aby użyć tego konstruktora, zastosuj atrybut „SetsRequiredMembers”.
pt_br: A lista de membros requeridos para o tipo base '{0}' está malformada e não pode ser interpretada. Para usar este construtor, aplique o atributo 'SetsRequiredMembers'.
ru: Неправильный формат списка обязательных элементов для базового типа "{0}", его не удается интерпретировать. Чтобы использовать этот конструктор, примените атрибут "SetsRequiredMembers".
zh_hans: 基类型 '{0}' 的必需成员列表格式不正确，无法解释。若要使用此构造函数，请应用 'SetsRequiredMembers' 属性。
zh_hant: 基底類型 '{0}' 所需的成員清單格式錯誤，無法解譯。若要使用此建構函式，請套用 'SetsRequiredMembers' 屬性。

# ERR_RequiredMembersInvalid
source: The required members list for '{0}' is malformed and cannot be interpreted.
cs: Seznam požadovaných členů pro {0} má chybný formát a nelze ho interpretovat.
fr: La liste des membres requis pour «{0}» est incorrecte et ne peut pas être interprétée.
it: L'elenco dei membri obbligatori per '{0}' non è valido e non può essere interpretato.
ja: '{0}' に必要なメンバーの一覧の形式が正しくないため、解釈できません。
pl: Lista wymaganych składowych dla „{0}” jest źle sformułowana i nie można jej zinterpretować.
pt_br: A lista de membros requeridos '{0}' está malformada e não pode ser interpretada.
ru: Неправильный формат списка обязательных элементов для "{0}", его не удается интерпретировать.
zh_hans: '{0}' 所需的成员列表格式不正确，无法解释。
zh_hant: '{0}' 的必要成員清單格式錯誤，無法解譯。

# ERR_RequiredMembersMustBeAssignedValue
source: Required member '{0}' must be assigned a value, it cannot use a nested member or collection initializer.
cs: Požadovanému členu {0} musí být přiřazena hodnota, nemůže používat vnořený člen nebo inicializátor kolekce.
fr: Une valeur doit être affectée au membre obligatoire '{0}', il ne peut pas utiliser de membre imbriqué ou d’initialiseur de collection.
it: Al membro obbligatorio '{0}' deve essere assegnato un valore, non può utilizzare un membro annidato o un inizializzatore di insieme.
ja: 必要なメンバー '{0}' に値を割り当てる必要があります。入れ子になったメンバーまたはコレクション初期化子を使用することはできません。
pl: Wymagana składowa „{0}” musi mieć przypisaną wartość, nie może używać zagnieżdżonej składowej ani inicjatora kolekcji.
pt_br: O membro requerido '{0}' deve ser atribuído um valor, ele não pode usar um membro aninhado ou um inicializador de coleção.
ru: Обязательному элементу "{0}" должно быть назначено значение, он не может использовать вложенный элемент или инициализатор коллекции.
zh_hans: 必须为所需成员'{0}'分配一个值，它不能使用嵌套成员或集合初始值设定项。
zh_hant: 必要的成員 '{0}' 必須指派值，它無法使用巢狀成員或集合初始設定式。

# ERR_RequiredNameDisallowed
source: Types and aliases cannot be named 'required'.
cs: Typy a aliasy nemůžou mít název required.
fr: Les types et alias ne peuvent pas être nommés « required ».
it: I tipi e gli alias non possono essere denominati 'obbligatori'.
ja: 型とエイリアスに 'required' という名前を付けることはできません。
pl: Typy i aliasy nie mogą mieć nazwy „required”.
pt_br: Tipos e pseudônimos não podem ser nomeados 'requeridos'.
ru: У типов и псевдонимов не может быть имя "required".
zh_hans: 类型和别名不能命名为 “required”。
zh_hant: 類型和別名不能命名為 'required'。

# ERR_EmbeddedAttributeMustFollowPattern
source: The type 'Microsoft.CodeAnalysis.EmbeddedAttribute' must be non-generic, internal, non-file, sealed, non-static, have a parameterless constructor, inherit from System.Attribute, and be able to be applied to any type.
it: Il tipo 'Microsoft.CodeAnalysis.EmbeddedAttribute' deve essere non generico, interno, sealed, non statico, avere un costruttore senza parametri, ereditare da System.Attribute e poter essere applicato a qualsiasi tipo.
pt_br: O tipo "Microsoft.CodeAnalysis.EmbeddedAttribute" deve ser não genérico, interno, não arquivo, lacrado, não estático, ter um construtor sem parâmetros, herdar de System.Attribute e ser aplicado a qualquer tipo.
ru: Тип "Microsoft.CodeAnalysis.EmbeddedAttribute" должен быть неуниверсанным, внутренним, запечатанным, нестатическим, иметь конструктор без параметров, наследовать от System.Attribute и иметь возможность применяться к любому типу.
zh_hans: 类型 “Microsoft.CodeAnalysis.EmbeddedAttribute” 必须是非泛型、内部、密封的非静态构造函数、具有无参数构造函数、从 System.Attribute 继承，并且能够应用于任何类型。

# ERR_RuntimeDoesNotSupportByRefLikeGenerics
source: Target runtime doesn't support by-ref-like generics.
fr: Le runtime cible ne prend pas en charge les génériques by-ref-like.
it: Il runtime di destinazione non supporta generics simili a by-ref.
pl: Docelowe środowisko uruchomieniowe nie obsługuje typów ogólnych by-ref-like.
pt_br: O runtime de destino não dá suporte a genéricos by-ref-like.
ru: Целевая среда выполнения не поддерживает параметрические полиморфизмы, подобные ref.
zh_hans: 目标运行时不支持类似 ref 的泛型。
zh_hant: 目標執行階段不支援泛型之類 by-ref-。

# ERR_RuntimeDoesNotSupportCovariantPropertiesOfClasses
source: '{0}': Target runtime doesn't support covariant types in overrides. Type must be '{2}' to match overridden member '{1}'
cs: {0}: Cílový modul runtime nepodporuje v přepisech kovariantní typy. Typ musí být {2}, aby odpovídal přepsanému členu {1}.
fr: '{0}' : le runtime cible ne prend pas en charge les types covariants dans les substitutions. Le type doit être '{2}' pour correspondre au membre substitué '{1}'
it: '{0}': il runtime di destinazione non supporta tipi covarianti negli override. Il tipo deve essere '{2}' in modo da corrispondere al membro '{1}' di cui è stato eseguito l'override
ja: '{0}': ターゲットのランタイムはオーバーライドで covariant 型をサポートしていません。型は、オーバーライドされるメンバー '{1}' と一致する '{2}' にする必要があります
pl: „{0}”: docelowe środowisko uruchomieniowe nie obsługuje typów kowariantnych w przesłonięciach. Typem musi być „{2}”, aby zachować zgodność z przesłoniętą składową „{1}”.
pt_br: '{0}': o runtime de destino não dá suporte a tipos covariantes em substituições. O tipo precisa ser '{2}' para corresponder ao membro substituído '{1}'
ru: "{0}": целевая среда выполнения не поддерживает ковариантные типы в переопределениях. Для сопоставления переопределенного элемента "{1}" необходимо использовать тип "{2}".
zh_hans: “{0}”: 目标运行时不支持替代中的协变类型。类型必须为“{2}”才能匹配替代成员“{1}”
zh_hant: '{0}': 在覆寫中，目標執行階段不支援 Covariant 類型。類型必須是 '{2}'，才符合覆寫的成員 '{1}'

# ERR_RuntimeDoesNotSupportCovariantReturnsOfClasses
source: '{0}': Target runtime doesn't support covariant return types in overrides. Return type must be '{2}' to match overridden member '{1}'
cs: {0}: Cílový modul runtime nepodporuje v přepisech kovariantní návratové typy. Návratový typ musí být {2}, aby odpovídal přepsanému členu {1}.
fr: '{0}' : le runtime cible ne prend pas en charge les types de retour covariants dans les substitutions. Le type de retour doit être '{2}' pour correspondre au membre substitué '{1}'
it: '{0}': il runtime di destinazione non supporta tipi restituiti covarianti negli override. Il tipo restituito deve essere '{2}' in modo da corrispondere al membro '{1}' di cui è stato eseguito l'override
ja: '{0}': ターゲットのランタイムはオーバーライドで戻り値の型 covariant をサポートしていません。戻り値の型は、オーバーライドされるメンバー '{1}' と一致する '{2}' にする必要があります
pl: „{0}”: docelowe środowisko uruchomieniowe nie obsługuje kowariantnych typów zwracanych w przesłonięciach. Typem zwracanym musi być „{2}”, aby zachować zgodność z przesłoniętą składową „{1}”.
pt_br: '{0}': o runtime de destino não dá suporte a tipos de retorno covariantes em substituições. O tipo de retorno precisa ser '{2}' para corresponder ao membro substituído '{1}'
ru: "{0}": целевая среда выполнения не поддерживает ковариантные возвращаемые типы в переопределениях. Для сопоставления переопределенного элемента "{1}" необходимо использовать возвращаемый тип "{2}".
zh_hans: “{0}”: 目标运行时不支持替代中的协变返回类型。返回类型必须为“{2}”才能匹配替代成员“{1}”
zh_hant: '{0}': 在覆寫中，目標執行階段不支援 Covariant 傳回型別。傳回型別必須是 '{2}'，才符合覆寫的成員 '{1}'

# ERR_RuntimeDoesNotSupportInlineArrayTypes
source: Target runtime doesn't support inline array types.
fr: L'environnement d'exécution cible ne prend pas en charge les types de tableau en ligne.
it: Il runtime di destinazione non supporta i tipi di matrice inline.
ja: ターゲットのランタイムはインライン配列型をサポートしていません。
pl: Docelowe środowisko uruchomieniowe nie obsługuje typów tablic śródwierszowych.
pt_br: O runtime de destino não dá suporte a tipos de matriz embutido.
ru: Целевая среда выполнения не поддерживает встроенные типы массивов.
zh_hans: 目标运行时不支持内联数组类型。
zh_hant: 目標執行階段不支援內嵌陣列類型。

# ERR_RuntimeDoesNotSupportProtectedAccessForInterfaceMember
source: Target runtime doesn't support 'protected', 'protected internal', or 'private protected' accessibility for a member of an interface.
cs: Cílový modul runtime nepodporuje pro člena rozhraní přístupnost na úrovni Protected, Protected internal nebo Private protected.
de: Die Zugriffsoptionen "protected", "protected internal" oder "private protected" werden von der Zielruntime für einen Member einer Schnittstelle nicht unterstützt.
es: El entorno de ejecución de destino no admite la accesibilidad protegida, protegida interna o protegida privada para un miembro de una interfaz.
fr: Le runtime cible ne prend pas en charge l'accessibilité 'protected', 'protected internal' ou 'private protected' d'un membre d'interface.
it: Il runtime di destinazione non supporta l'accessibilità 'protected', 'protected internal' o 'private protected' per un membro di un'interfaccia.
ja: ターゲット ランタイムは、インターフェイスのメンバーに対して 'protected'、'protected internal'、'private protected' アクセシビリティをサポートしていません。
ko: 대상 런타임이 인터페이스 멤버의 'protected', 'protected internal' 또는 'private protected' 접근성을 지원하지 않습니다.
pl: Docelowe środowisko uruchomieniowe nie obsługuje specyfikatorów dostępu „protected”, „protected internal” i „private protected” dla składowej interfejsu.
pt_br: O runtime de destino não é compatível com a acessibilidade 'protected', 'protected internal' ou 'private protected' para um membro de uma interface.
ru: Целевая среда выполнения не поддерживает специальные возможности "защищенный", "внутренний защищенный" или "частный защищенный" для члена интерфейса.
tr: Hedef çalışma zamanı, bir arabirim üyesi için 'protected', 'protected internal' veya 'private protected' erişilebilirliğini desteklemez.
zh_hans: 目标运行时不支持对接口的成员使用 "protected"、"protected internal" 或 "private protected" 辅助功能。
zh_hant: 目標執行階段不支援介面成員的 'protected'、'protected internal' 或 'private protected' 存取權。

# ERR_RuntimeDoesNotSupportRefFields
source: Target runtime doesn't support ref fields.
cs: Cílový modul runtime nepodporuje referenční pole.
fr: Le runtime cible ne prend pas en charge les champs de référence.
it: Il runtime di destinazione non supporta i campi di riferimento.
ja: 対象のランタイムは ref フィールドをサポートしていません。
pl: Docelowe środowisko uruchomieniowe nie obsługuje pól referencyjnych.
pt_br: O tempo de execução de destino não dá suporte a campos de ref.
ru: Целевая среда выполнения не поддерживает поля ссылок.
zh_hans: 目标运行时不支持 ref 字段。
zh_hant: 目標執行時間不支援 ref 欄位。

# ERR_RuntimeDoesNotSupportStaticAbstractMembersInInterfaces
source: Target runtime doesn't support static abstract members in interfaces.
cs: Cílový modul runtime nepodporuje statické abstraktní členy v rozhraních.
fr: Le runtime cible ne prend pas en charge les membres abstraits statiques dans les interfaces.
it: Il runtime di destinazione non supporta membri astratti statici nelle interfacce.
ja: ターゲット ランタイムでは、インターフェイスの静的な抽象メンバーをサポートしていません。
pl: Docelowe środowisko uruchomieniowe nie obsługuje statycznych składowych abstrakcyjnych w interfejsach.
pt_br: O runtime de destino não dá suporte aos membros abstratos estáticos em interfaces.
ru: Целевая среда выполнения не поддерживает статические абстрактные элементы в интерфейсах.
zh_hans: 目标运行时不支持接口中的静态抽象成员。
zh_hant: 目標執行階段不支援介面中的靜態抽象成員。

# ERR_RuntimeDoesNotSupportStaticAbstractMembersInInterfacesForMember
source: '{0}' cannot implement interface member '{1}' in type '{2}' because the target runtime doesn't support static abstract members in interfaces.
cs: {0} nemůže implementovat člena rozhraní {1} v typu {2}, protože cílový modul runtime nepodporuje v rozhraní statické abstraktní členy.
fr: '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}', car le runtime cible ne prend pas en charge les membres abstraits statiques dans les interfaces.
it: '{0}' non può implementare il membro di interfaccia '{1}' nel tipo '{2}' perché il runtime di destinazione non supporta membri astratti statici nelle interfacce.
ja: ターゲットのランタイムは、インターフェイス内の静的な抽象メンバーをサポートしていないため、'{0}' は型 '{2}' のインターフェイス メンバー '{1}' を実装できません。
pl: Atrybut "{0}" nie może implementować składowej interfejsu "{1}" w typie "{2}", ponieważ docelowe środowisko uruchomieniowe nie obsługuje statycznych składowych abstrakcyjnych w interfejsach.
pt_br: '{0}' não pode implementar o membro de interface '{1}' no tipo '{2}' porque o runtime de destino não dá suporte aos membros abstratos estáticos em interfaces.
ru: "{0}" не может реализовать элемент интерфейса "{1}" в типе "{2}", поскольку целевая среда выполнения не поддерживает статические абстрактные элементы в интерфейсах.
zh_hans: “{0}”无法在类型“{1}”中实现接口成员“{2}”，因为目标运行时不支持接口中的静态抽象成员。
zh_hant: 因為目標執行階段不支援介面中靜態抽象成員，所以 '{0}' 無法在類型 '{2}' 中實作介面成員 '{1}'。

# ERR_RuntimeDoesNotSupportUnmanagedDefaultCallConv
source: The target runtime doesn't support extensible or runtime-environment default calling conventions.
cs: Cílový modul runtime nepodporuje rozšiřitelné konvence volání ani konvence volání výchozí pro prostředí modulu runtime.
fr: Le runtime cible ne prend pas en charge les conventions d'appel par défaut des environnements extensibles ou d'exécution.
it: Il runtime di destinazione non supporta convenzioni di chiamata predefinite estendibili o dell'ambiente di runtime.
ja: ターゲット ランタイムは、拡張可能またはランタイム環境の既定の呼び出し規則をサポートしていません。
pl: Docelowe środowisko uruchomieniowe nie obsługuje rozszerzalnych ani domyślnych dla środowiska uruchomieniowego konwencji wywoływania.
pt_br: O runtime de destino não dá suporte a convenções de chamada padrão extensíveis ou de ambiente de runtime.
ru: Целевая среда выполнения не поддерживает расширяемые или принадлежащие среде выполнения соглашения о вызовах по умолчанию.
zh_hans: 目标运行时不支持可扩展或运行时环境默认调用约定。
zh_hant: 目標執行階段不支援可延伸或執行階段環境的預設呼叫慣例。

# ERR_ScopedAfterInOutRefReadonly
source: The 'scoped' modifier cannot come after an 'in', 'out', 'ref' or 'readonly' modifier.
pt_br: O modificador "scoped" não pode vir após um modificador "in", "out", "ref" ou "readonly".

# ERR_ScopedDiscard
source: The 'scoped' modifier cannot be used with discard.
cs: Modifikátor scoped nejde použít s proměnnou typu discard.
fr: Le modificateur « Scoped » ne peut pas être utilisé avec discard.
it: Non è possibile usare il modificatore 'scoped' con discard.
ja: 'scoped' 修飾子を discard と共に使用することはできません。
pl: Modyfikator „scoped” nie może być używany z odrzuceniem.
pt_br: O modificador 'scoped' não pode ser usado com descarte.
ru: Модификатор "scoped" нельзя использовать с отменой.
zh_hans: "scoped" 修饰符不能与 discard 一起使用。
zh_hant: 'scoped' 修飾元不能與捨棄一起使用。

# ERR_ScopedMismatchInParameterOfOverrideOrImplementation
source: The 'scoped' modifier of parameter '{0}' doesn't match overridden or implemented member.
cs: Modifikátor scoped parametru {0} neodpovídá přepsanému nebo implementovanému členu.
fr: Le modificateur 'scoped' du paramètre '{0}' ne correspond pas au membre substitué ou implémenté.
it: Il modificatore 'scoped' del parametro '{0}' non corrisponde al membro sottoposto a override o implementato.
ja: パラメーター '{0}' の 'scoped' 修飾子が、オーバーライドされたメンバーまたは実装されたメンバーと一致しません。
pl: Modyfikator „scoped” parametru „{0}” nie jest zgodny z przesłoniętą lub zaimplementowaną składową.
pt_br: O modificador 'scoped' do parâmetro '{0}' não corresponde ao membro substituído ou implementado.
ru: Модификатор "scoped" параметра "{0}" не совпадает с переопределенным или реализованным членом.
zh_hans: 参数 "{0}" 的 "scoped" 修饰符与被重写或实现的成员不匹配。
zh_hant: 參數 '{0}' 的 'scoped' 修飾元不符合覆寫或實作的成員。

# ERR_ScopedMismatchInParameterOfPartial
source: The 'scoped' modifier of parameter '{0}' doesn't match partial definition.
fr: Le modificateur « scoped » du paramètre « {0} » ne correspond pas à la définition partielle.
it: Il modificatore 'scoped' del parametro '{0}' non corrisponde alla definizione parziale.
pl: Modyfikator „scoped” parametru „{0}” nie jest zgodny z częściową definicją.
pt_br: O modificador "scoped" do parâmetro "{0}" não corresponde à definição parcial.
ru: Модификатор "scoped" параметра "{0}" не соответствует частичному определению.
zh_hans: 参数 "{0}" 的 "scoped" 修饰符与分部定义不匹配。
zh_hant: 參數 '{0}' 的 'scoped' 修飾元與部分定義不相符。
