Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UnimplementedCommandLineSwitch
source: The command line switch '{0}' is not yet implemented and was ignored.
cs: Přepínač příkazového řádku {0} ještě není implementovaný, a tak se ignoroval.
de: Der Befehlszeilenschalter '{0}' ist noch nicht implementiert und wurde ignoriert.
es: El modificador de línea de comandos '{0}' todavía no se ha implementado y se ha omitido.
fr: Le commutateur de ligne de commande '{0}' n'est pas encore implémenté et a été ignoré.
it: L'opzione '{0}' della riga di comando non è ancora implementata ed è stata ignorata.
ja: コマンド ライン スイッチ '{0}' はまだ実装されていないため、無視されました。
ko: 명령줄 스위치 '{0}'이(가) 아직 구현되지 않아 무시되었습니다.
pl: Przełącznik wiersza polecenia „{0}” nie został jeszcze wdrożony i został zignorowany.
pt_br: A opção de linha de comando "{0}" ainda não está implementada e foi ignorada.
ru: Переключатель командной строки "{0}" еще не реализован и был пропущен.
tr: {0}' komut satırı geçişi henüz uygulanmadı ve yoksayıldı.
zh_hans: 命令行开关“{0}”尚未实现，已忽略。
zh_hant: 命令列參數 '{0}' 尚未獲實作，已忽略。

# WRN_UnimplementedCommandLineSwitch_Title
source: Command line switch is not yet implemented
cs: Přepínač příkazového řádku zatím není implementovaný.
de: Der Befehlszeilenschalter wurde noch nicht implementiert.
es: El switch de la línea de comandos aún no está implementado
fr: Le commutateur de ligne de commande n’est pas encore implémenté
it: L'opzione della riga di comando non è ancora implementata
ja: コマンド ライン スイッチはまだ実装されていません
ko: 명령줄 스위치가 아직 구현되지 않았습니다.
pl: Przełącznik wiersza polecenia nie jest jeszcze zaimplementowany
pt_br: Opção de linha de comando ainda não implementada
ru: Переключатель командной строки еще не реализован
tr: Komut satırı anahtarı henüz uygulanmadı
zh_hans: 命令行开关尚未实现
zh_hant: 尚未實作命令列參數

# ERR_ModuleEmitFailure
source: Failed to emit module '{0}': {1}
cs: Nepovedlo se vygenerovat modul {0}: {1}
de: Fehler beim Ausgeben von Modul "{0}": {1}
es: No se pudo emitir el módulo "{0}": {1}
fr: Échec de l'émission du module '{0}' : {1}
it: Non è stato possibile creare il modulo '{0}': {1}
ja: モジュール '{0}' の生成に失敗しました: {1}
ko: 모듈 '{0}'을(를) 내보내지 못했습니다. {1}
pl: Wyemitowanie modułu „{0}” nie powiodło się: {1}
pt_br: Falha ao emitir o módulo '{0}': {1}
ru: Не удалось выдать модуль "{0}": {1}
tr: '{0}' modülü gösterilemedi: {1}
zh_hans: 未能发出模块“{0}”: {1}
zh_hant: 無法發出模組 '{0}': {1}

# ERR_FixedLocalInLambda
source: Cannot use fixed local '{0}' inside an anonymous method, lambda expression, or query expression
cs: Pevnou lokální proměnnou {0} nejde použít v anonymní metodě, lambda výrazu nebo výrazu dotazu.
de: "{0}" (fest und lokal) kann nicht innerhalb einer anonymen Methode, eines Lambdaausdrucks oder eines Abfrageausdrucks verwendet werden.
es: No se puede usar el valor local fijo '{0}' dentro de un método anónimo, una expresión lambda o una expresión de consulta
fr: Impossible d'utiliser la variable locale fixe '{0}' dans une méthode anonyme, une expression lambda ou une expression de requête
it: Non è possibile usare la variabile locale fissa '{0}' in un metodo anonimo, in un'espressione lambda o in un'espressione di query
ja: 匿名メソッド、ラムダ式、またはクエリ式の内部では、固定のローカルな '{0}' は使用できません
ko: 무명 메서드, 람다 식 또는 쿼리 식에는 '{0}' 고정 로컬을 사용할 수 없습니다.
pl: Ustalonego, lokalnego elementu „{0}” nie można używać w metodzie anonimowej, wyrażeniu lambda ani wyrażeniu zapytania
pt_br: Não é possível usar o local fixo "{0}" dentro de um método anônimo, expressão lambda ou expressão de consulta
ru: Не удается использовать фиксированную локальную переменную "{0}" внутри анонимного метода, лямбда-выражения или выражения запроса.
tr: Anonim yöntem, lambda ifadesi veya sorgu ifadesi içinde sabit yerel '{0}' kullanılamaz
zh_hans: 在匿名方法、lambda 表达式或查询表达式中不能使用固定的局部变量“{0}”
zh_hant: 無法在匿名方法、Lambda 運算式或查詢運算式中，使用固定的區域變數 '{0}'

# ERR_ExpressionTreeContainsNamedArgument
source: An expression tree may not contain a named argument specification
cs: Strom výrazu nemůže obsahovat specifikaci pojmenovaného argumentu.
de: Ein Ausdrucksbaum darf keine benannte Argumentspezifikation enthalten.
es: Un árbol de expresión no puede contener una especificación de argumento con nombre
fr: Une arborescence de l'expression ne peut pas contenir une spécification d'argument nommé
it: L'albero delle espressioni non può contenere una specifica di argomento denominato
ja: 名前付き引数の指定を式ツリーに含めることはできません
ko: 식 트리에는 명명된 인수 사양을 포함할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać specyfikacji argumentu nazwanego
pt_br: Uma árvore de expressão não pode conter uma especificação de argumento nomeado
ru: Дерево выражения не может содержать спецификацию именованного аргумента.
tr: Bir ifade ağacı adlandırılmış bir bağımsız değişken belirtimi içeremez
zh_hans: 表达式树可能不包含命名参数规范
zh_hant: 運算式樹狀結構不可包含具名引數規格

# ERR_ExpressionTreeContainsOptionalArgument
source: An expression tree may not contain a call or invocation that uses optional arguments
cs: Strom výrazu nemůže obsahovat volání, které používá nepovinné argumenty.
de: Ein Ausdrucksbaum darf keinen Aufruf enthalten, in dem optionale Argumente verwendet werden.
es: Un árbol de expresión no puede contener una llamada o invocación que use argumentos opcionales
fr: Une arborescence de l'expression ne peut pas contenir un appel qui utilise des arguments facultatifs
it: Un albero delle espressioni non può contenere una chiamata che usa argomenti facoltativi
ja: 省略可能な引数を使用する呼び出しを式ツリーに含めることはできません
ko: 식 트리에는 선택적 인수를 사용하는 호출을 포함할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać połączenia lub wywołania, które używa argumentów opcjonalnych
pt_br: Uma árvore de expressão não pode conter chamada ou invocação que use argumentos opcionais
ru: Дерево выражения не может содержать вызов, для которого используются необязательные аргументы.
tr: Bir ifade ağacı isteğe bağlı bağımsız değişkenler kullanan bir çağrı içeremez
zh_hans: 表达式树可能不包含使用可选参数的调用
zh_hant: 運算式樹狀結構不可包含使用選擇性引數的呼叫或引動過程

# ERR_ExpressionTreeContainsIndexedProperty
source: An expression tree may not contain an indexed property
cs: Strom výrazu nemůže obsahovat indexovanou vlastnost.
de: Ausdrucksbäume dürfen keine indizierten Eigenschaften enthalten.
es: Un árbol de expresión no puede contener una propiedad indizada
fr: Une arborescence de l'expression ne peut pas contenir une propriété indexée
it: L'albero delle espressioni non può contenere una proprietà indicizzata
ja: 式ツリーにインデックス付きプロパティを含めることはできません
ko: 식 트리에는 인덱싱된 속성을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać właściwości indeksowanej
pt_br: Uma árvore de expressão não pode conter uma propriedade indexada
ru: Дерево выражения не может содержать индексированное свойство.
tr: Bir ifade ağacı dizini erişimli bir özellik içeremez
zh_hans: 表达式树不能包含索引属性
zh_hant: 運算式樹狀結構不可包含具備索引的屬性

# ERR_IndexedPropertyRequiresParams
source: Indexed property '{0}' has non-optional arguments which must be provided
cs: Indexovaná vlastnost {0} má argumenty, které nejsou nepovinné a je třeba je zadat.
de: Die indizierte Eigenschaft "{0}" besitzt nicht optionale Argumente, die bereitgestellt werden müssen.
es: La propiedad indizada '{0}' tiene argumentos no opcionales que se deben proporcionar
fr: La propriété indexée '{0}' a des arguments non facultatifs qui doivent être fournis
it: La proprietà indicizzata '{0}' include argomenti non facoltativi che devono essere specificati
ja: インデックス付きプロパティ '{0}' には、省略できない引数を指定する必要があります
ko: 인덱싱된 속성 '{0}'에 반드시 제공되어야 하는 필수 인수가 있습니다.
pl: Właściwość indeksowana „{0}” ma nieopcjonalne argumenty, które muszą być określone
pt_br: Propriedade indexada "{0}" tem argumentos não opcionais que devem ser fornecidos
ru: Индексированное свойство "{0}" содержит необязательные аргументы, которые необходимо указать
tr: {0}' dizine alınan özelliğinin sağlanması gereken isteğe bağlı olmayan bağımsız değişkenleri var
zh_hans: 索引属性“{0}”具有必须提供的非可选参数
zh_hant: 索引屬性 '{0}' 有必須提供的非選擇性引數

# ERR_IndexedPropertyMustHaveAllOptionalParams
source: Indexed property '{0}' must have all arguments optional
cs: Indexovaná vlastnost {0} musí mít všechny argumenty volitelné.
de: Alle Argumente der indizierten Eigenschaft "{0}" müssen optional sein.
es: La propiedad indizada '{0}' debe tener todos los argumentos opcionales
fr: Tous les arguments de la propriété indexée '{0}' doivent être facultatifs
it: La proprietà indicizzata '{0}' deve includere tutti argomenti facoltativi
ja: インデックス付きプロパティ '{0}' では、すべての引数が省略可能である必要があります
ko: 인덱싱된 속성 '{0}'에 모든 선택적 인수가 있어야 합니다.
pl: Właściwość indeksowana „{0}” musi mieć wszystkie argumenty opcjonalne
pt_br: Propriedade indexada "{0}" deve ter todos os argumentos opcionais
ru: У индексированного свойства "{0}" все аргументы должны быть необязательными
tr: {0}' dizine alınan özelliğinin tüm bağımsız değişkenleri isteğe bağlı olmalıdır
zh_hans: 索引属性“{0}”的所有参数都必须可选
zh_hant: 索引屬性 '{0}' 的所有引數都必須是選擇性引數

# ERR_SpecialByRefInLambda
source: Instance of type '{0}' cannot be used inside a nested function, query expression, iterator block or async method
cs: Instance typu {0} nelze použít uvnitř vnořené funkce, výrazu dotazu, bloku iterátoru nebo asynchronní metody.
de: Eine Instanz des Typs "{0}" kann nicht in einer geschachtelten Funktion, einem Abfrageausdruck, einem Iteratorblock oder einer Async-Methode verwendet werden.
es: La instancia de tipo "{0}" no se puede usar dentro de una función anidada, una expresión de consulta, un bloque iterador ni un método asincrónico.
fr: Impossible d'utiliser une instance de type '{0}' dans une fonction imbriquée, une expression de requête, un bloc itérateur ou une méthode async
it: L'istanza di tipo '{0}' non può essere usata all'interno di una funzione annidata, un'espressione di query, un blocco iteratore o un metodo asincrono
ja: 型 '{0}' のインスタンスは、入れ子になった関数、クエリ式、反復子ブロック、または非同期メソッドの中では使用できません
ko: {0}' 형식의 인스턴스는 중첩된 함수, 쿼리 식, 반복기 블록 또는 비동기 메서드 내에서 사용할 수 없습니다.
pl: Wystąpienia typu „{0}” nie można użyć wewnątrz funkcji zagnieżdżonej, wyrażenia zapytania, bloku iteratora ani metody asynchronicznej
pt_br: A instância do tipo '{0}' não pode ser usada dentro de uma função aninhada, expressão de consulta, bloco de iteradores ou método assíncrono
ru: Экземпляр типа "{0}" нельзя использовать внутри вложенной функции, выражения запроса, блока итератора или асинхронного метода.
tr: {0}' türünün örneği iç içe geçmiş bir işlevde, sorgu ifadesinde, yineleyici bloğunda veya zaman uyumsuz bir metotta kullanılamaz
zh_hans: “{0}”类型的实例不能在嵌套函数、查询表达式、迭代器块或异步方法中使用
zh_hant: 類型 '{0}' 的執行個體不可用於巢狀函式、查詢運算式、迭代區塊或非同步方法中

# ERR_SecurityAttributeMissingAction
source: First argument to a security attribute must be a valid SecurityAction
cs: První argument atributu zabezpečení musí být platný SecurityAction.
de: Das erste Argument eines Sicherheitsattributs muss eine gültige SecurityAction sein.
es: El primer argumento de un atributo de seguridad debe ser una SecurityAction válida
fr: Le premier argument d'un attribut de sécurité doit être un SecurityAction valide
it: Il primo argomento di un attributo di sicurezza deve essere un elemento SecurityAction valido
ja: セキュリティ属性の最初の引数は有効な SecurityAction である必要があります
ko: 보안 특성에 대한 첫 번째 인수는 유효한 SecurityAction이어야 합니다.
pl: Pierwszy argument atrybutu zabezpieczeń musi być prawidłową wartością SecurityAction
pt_br: Primeiro argumento para um atributo de segurança deve ser uma SecurityAction válida
ru: Первым аргументом атрибута безопасности должен быть допустимый SecurityAction.
tr: Bir güvenlik özniteliğinin ilk bağımsız değişkeni geçerli bir SecurityAction olmalıdır
zh_hans: 安全特性的第一个参数必须是有效的 SecurityAction
zh_hant: 安全屬性的第一個引數必須是有效的 SecurityAction

# ERR_SecurityAttributeInvalidAction
source: Security attribute '{0}' has an invalid SecurityAction value '{1}'
cs: Atribut zabezpečení {0} má neplatnou hodnotu SecurityAction {1}.
de: Das Sicherheitsattribut "{0}" weist einen ungültigen SecurityAction-Wert "{1}" auf.
es: El atributo de seguridad '{0}' tiene un valor '{1}' de SecurityAction no válido
fr: L'attribut de sécurité '{0}' a une valeur SecurityAction '{1}' non valide
it: L'attributo di sicurezza '{0}' ha un valore SecurityAction '{1}' non valido
ja: セキュリティ属性 '{0}' に無効な SecurityAction の値 '{1}' があります
ko: {0}' 보안 특성에 있는 SecurityAction 값('{1}')이 잘못되었습니다.
pl: Atrybut zabezpieczeń „{0}” ma nieprawidłową wartość SecurityAction „{1}”
pt_br: Atributo de segurança "{0}" tem um valor SecurityAction inválido "{1}"
ru: Атрибут безопасности "{0}" имеет недопустимое значение SecurityAction "{1}".
tr: {0}' güvenlik özniteliğinin geçersiz bir SecurityAction değeri '{1}' var
zh_hans: 安全特性“{0}”具有无效 SecurityAction 值“{1}”
zh_hant: 安全屬性 '{0}' 出現無效的 SecurityAction 值 '{1}'

# ERR_SecurityAttributeInvalidActionAssembly
source: SecurityAction value '{0}' is invalid for security attributes applied to an assembly
cs: Hodnota SecurityAction {0} není platná pro atributy zabezpečení použité u sestavení.
de: Der SecurityAction-Wert "{0}" ist ungültig für Sicherheitsattribute, die auf eine Assembly angewendet werden.
es: El valor '{0}' de SecurityAction no es válido para los atributos de seguridad aplicados a un ensamblado
fr: La valeur SecurityAction '{0}' n'est pas valide pour les attributs de sécurité appliqués à un assembly
it: Il valore '{0}' di SecurityAction non è valido per gli attributi di sicurezza applicati a un assembly
ja: SecurityAction の値 '{0}' は、アセンブリに適用されたセキュリティ属性に対して無効です
ko: 어셈블리에 적용된 보안 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest nieprawidłowa dla atrybutów zabezpieczeń zastosowanych dla zestawu
pt_br: Valor SecurityAction "{0}" é inválido para atributos de segurança aplicados a um assembly
ru: Значение SecurityAction "{0}" недопустимо для атрибутов безопасности, применяемых к сборке
tr: SecurityAction değeri '{0}' bir derlemeye uygulanan güvenlik öznitelikleri için geçersiz
zh_hans: SecurityAction 值“{0}”对于应用于程序集的安全特性无效
zh_hant: SecurityAction 值 '{0}' 對套用至組件的安全屬性無效

# ERR_SecurityAttributeInvalidActionTypeOrMethod
source: SecurityAction value '{0}' is invalid for security attributes applied to a type or a method
cs: Hodnota SecurityAction {0} není platná pro atributy zabezpečení použité u typu nebo metody.
de: Der SecurityAction-Wert "{0}" ist ungültig für Sicherheitsattribute, die auf einen Typ oder eine Methode angewendet werden.
es: El valor '{0}' de SecurityAction no es válido para los atributos de seguridad aplicados a un tipo o método
fr: La valeur SecurityAction '{0}' n'est pas valide pour les attributs de sécurité appliqués à un type ou à une méthode
it: Il valore '{0}' di SecurityAction non è valido per gli attributi di sicurezza applicati a un tipo o a un metodo
ja: SecurityAction の値 '{0}' は、型またはメソッドに適用するセキュリティ属性に対して無効です
ko: 형식 또는 메서드에 적용된 보안 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest nieprawidłowa dla atrybutów zabezpieczeń zastosowanych dla typu lub metody
pt_br: Valor SecurityAction "{0}" é inválido para atributos de segurança aplicados a um tipo ou um método
ru: Значение SecurityAction "{0}" недопустимо для атрибутов безопасности, применяемых к типу или методу.
tr: SecurityAction değeri '{0}' bir türe veya yönteme uygulanan güvenlik öznitelikleri için geçersiz
zh_hans: SecurityAction 值“{0}”对于应用于类型或方法的安全特性无效
zh_hant: SecurityAction 值 '{0}' 對套用至類型或方法的安全屬性無效

# ERR_PrincipalPermissionInvalidAction
source: SecurityAction value '{0}' is invalid for PrincipalPermission attribute
cs: Hodnota SecurityAction {0} není platná pro atribut PrincipalPermission.
de: Der SecurityAction-Wert "{0}" ist für das PrincipalPermission-Attribut ungültig.
es: El valor '{0}' de SecurityAction no es válido para el atributo PrincipalPermission
fr: La valeur SecurityAction '{0}' n'est pas valide pour l'attribut PrincipalPermission
it: Il valore '{0}' di SecurityAction non è valido per l'attributo PrincipalPermission
ja: SecurityAction の値 '{0}' が属性 PrincipalPermission に対して無効です
ko: PrincipalPermission 특성에 대한 SecurityAction 값('{0}')이 잘못되었습니다.
pl: Wartość SecurityAction „{0}” jest nieprawidłowa dla atrybutu PrincipalPermission
pt_br: Valor SecurityAction "{0}" é inválido para o atributo PrincipalPermission
ru: Значение SecurityAction "{0}" недопустимо для атрибута PrincipalPermission.
tr: SecurityAction değeri '{0}', PrincipalPermission özniteliği için geçersiz
zh_hans: SecurityAction 值“{0}”对于 PrincipalPermission 特性无效
zh_hant: SecurityAction 值 '{0}' 對 PrincipalPermission 屬性無效

# ERR_FeatureNotValidInExpressionTree
source: An expression tree may not contain '{0}'
cs: Strom výrazu nesmí obsahovat {0}.
de: Ein Ausdrucksbaum darf "{0}" nicht enthalten.
es: Un árbol de expresión no puede contener '{0}'
fr: Une arborescence d'expression ne peut pas contenir '{0}'
it: Un albero delle espressioni non può contenere '{0}'
ja: 式ツリーに '{0}' を含めることはできません
ko: 식 트리는 '{0}'을(를) 포함할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać „{0}”
pt_br: Uma árvore de expressão não pode conter "{0}"
ru: Дерево выражения не может содержать "{0}".
tr: Bir ifade ağacı '{0}' öğesini içermeyebilir
zh_hans: 表达式树不能包含“{0}”
zh_hant: 運算式樹狀結構不可包含 '{0}'

# ERR_PermissionSetAttributeInvalidFile
source: Unable to resolve file path '{0}' specified for the named argument '{1}' for PermissionSet attribute
cs: Nejde vyřešit cestu k souboru {0} zadanému pro pojmenovaný argument {1} pro atribut PermissionSet.
de: Fehler beim Auflösen des Dateipfads "{0}", der für das benannte Argument "{1}" für das PermissionSet-Attribut angegeben wurde.
es: No se pudo resolver la ruta de acceso de archivo '{0}' especificada para el argumento con nombre '{1}' del atributo PermissionSet
fr: Impossible de résoudre le chemin d'accès au fichier '{0}' spécifié pour l'argument nommé '{1}' de l'attribut PermissionSet
it: Non è possibile risolvere il percorso del file '{0}' specificato per l'argomento denominato '{1}' per l'attributo PermissionSet
ja: PermissionSet 属性の名前付き引数 '{1}' に対して指定されたファイル パス '{0}' を解決できません
ko: PermissionSet 특성에 대해 명명된 인수 '{1}'에 지정된 '{0}' 파일 경로를 확인할 수 없습니다.
pl: Nie można rozpoznać ścieżki pliku „{0}” określonej dla argumentu nazwanego „{1}” atrybutu PermissionSet
pt_br: Não é possível resolver o caminho de arquivo "{0}" especificado para o argumento nomeado "{1}" para o atributo PermissionSet
ru: Не удается разрешить путь файла "{0}", определенный для именованного аргумента "{1}" атрибута PermissionSet.
tr: PermissionSet özniteliği için '{1}' adlandırılmış bağımsız değişkeni için belirtilen '{0}' dosya yolu çözümlenemiyor
zh_hans: 无法解析为 PermissionSet 特性的命名参数“{1}”指定的文件路径“{0}”
zh_hant: 無法解析為 PermissionSet 屬性的具名引數 '{1}' 所指定之檔案路徑 '{0}'

# ERR_PermissionSetAttributeFileReadError
source: Error reading file '{0}' specified for the named argument '{1}' for PermissionSet attribute: '{2}'
cs: Chyba při čtení souboru {0} zadaného pro pojmenovaný argument {1} pro atribut PermissionSet: {2}
de: Fehler beim Lesen der Datei "{0}", die für das benannte Argument "{1}" für das PermissionSet-Attribut angegeben wurde: "{2}"
es: Error al leer el archivo '{0}' especificado para el argumento con nombre '{1}' del atributo PermissionSet: '{2}'
fr: Erreur lors de la lecture du fichier '{0}' spécifié pour l'argument nommé '{1}' pour l'attribut PermissionSet : '{2}'
it: Si è verificato un errore durante la lettura del file '{0}' specificato per l'argomento denominato '{1}' per l'attributo PermissionSet: '{2}'
ja: PermissionSet 属性 ('{2}') の名前付き引数 '{1}' に対して指定されたファイル '{0}' の読み取り中にエラーが発生しました
ko: PermissionSet 특성에 대해 명명된 인수 '{1}'에 지정된 '{0}' 파일을 읽는 동안 오류가 발생했습니다. '{2}'
pl: Błąd podczas odczytu pliku „{0}” określonego przez argument nazwany „{1}” atrybutu PermissionSet: „{2}”
pt_br: Erro ao ler arquivo "{0}" especificado para o argumento nomeado "{1}" para o atributo PermissionSet: "{2}"
ru: Ошибка чтения файла "{0}", указанного для именованного аргумента "{1}" для атрибута PermissionSet: '{2}'
tr: PermissionSet özniteliği için '{1}' adlandırılmış bağımsız değişkeni için belirtilen '{0}' dosyası okunurken hata: '{2}'
zh_hans: 读取为 PermissionSet 特性的命名参数“{1}”指定的文件“{0}”时出错:“{2}”
zh_hant: 讀取為 PermissionSet 屬性的具名引數 '{1}' 所定之檔案 '{0}' 時，發生錯誤: '{2}'

# ERR_GlobalSingleTypeNameNotFoundFwd
source: The type name '{0}' could not be found in the global namespace. This type has been forwarded to assembly '{1}' Consider adding a reference to that assembly.
cs: Název typu {0} se nepovedlo najít v globálním oboru názvů. Tento typ se předal do sestavení {1}. Zvažte přidání odkazu do tohoto sestavení.
de: Der Typname "{0}" konnte nicht im globalen Namespace gefunden werden. Dieser Typ wurde an Assembly "{1}" weitergeleitet. Sie sollten einen Verweis auf die Assembly hinzufügen.
es: No se encuentra el nombre de tipo '{0}' en el espacio de nombres global. Este tipo se ha reenviado al ensamblado '{1}'. Puede agregar una referencia a ese ensamblado.
fr: Nom de type '{0}' introuvable dans l'espace de noms global. Ce type a été transmis à l'assembly '{1}'. Ajoutez une référence à cet assembly.
it: Il nome di tipo '{0}' non è stato trovato nello spazio dei nomi globale. Il tipo è stato inoltrato all'assembly '{1}'. Provare ad aggiungere un riferimento all'assembly.
ja: 型名 '{0}' がグローバル名前空間に見つかりませんでした。この型はアセンブリ '{1}' に転送されています。このアセンブリに参照を追加することを検討してください。
ko: 전역 네임스페이스에 형식 이름 '{0}'이(가) 없습니다. 이 형식은 '{1}' 어셈블리에 전달되었습니다. 해당 어셈블리에 대한 참조를 추가하세요.
pl: Nie można odnaleźć nazwy typu „{0}” w globalnej przestrzeni nazw. Ten typ został przesłany dalej do zestawu „{1}”. Rozważ możliwość dodania odwołania do tego zestawu.
pt_br: O nome do tipo "{0}" não pode ser encontrado no namespace global. Este tipo foi encaminhado para o assembly "{1}" Considere adicionar uma referência a esse assembly.
ru: Не удалось найти имя типа "{0}" в глобальном пространстве имен. Этот тип был отправлен в сборку "{1}". Попробуйте добавить ссылку на эту сборку.
tr: {0}' tür adı genel ad uzayında bulunamıyor. Bu tür, '{1}' derlemesine gönderildi. Şu derlemeye bir başvuru eklemeyi dikkate alın.
zh_hans: 未能在全局命名空间中找到类型名“{0}”。此类型已转发到程序集“{1}”。请考虑添加对该程序集的引用。
zh_hant: 全域命名空間中找不到類型名稱 '{0}'。此類型已轉送到組件 '{1}'，請考慮加入該組件的參考。

# ERR_DottedTypeNameNotFoundInNSFwd
source: The type name '{0}' could not be found in the namespace '{1}'. This type has been forwarded to assembly '{2}' Consider adding a reference to that assembly.
cs: Název typu {0} se nepovedlo najít v oboru názvů {1}. Tento typ se předal do sestavení {2}. Zvažte přidání odkazu do tohoto sestavení.
de: Der Typname "{0}" konnte nicht im Namespace "{1}" gefunden werden. Dieser Typ wurde an Assembly "{2}" weitergeleitet. Sie sollten einen Verweis auf die Assembly hinzufügen.
es: No se encuentra el nombre de tipo '{0}' en el espacio de nombres '{1}'. Este tipo se ha reenviado al ensamblado '{2}'. Puede agregar una referencia a ese ensamblado.
fr: Nom de type '{0}' introuvable dans l'espace de noms '{1}'. Ce type a été transmis à l'assembly '{2}'. Ajoutez une référence à cet assembly.
it: Il nome di tipo '{0}' non è stato trovato nello spazio dei nomi '{1}'. Il tipo è stato inoltrato all'assembly '{2}'. Provare ad aggiungere un riferimento all'assembly.
ja: 型名 '{0}' は名前空間 '{1}' に見つかりませんでした。この型はアセンブリ '{2}' に転送されました。このアセンブリへの参照を追加することを検討してください。
ko: 네임스페이스 '{1}'에 형식 이름 '{0}'이(가) 없습니다. 이 형식은 '{2}' 어셈블리에 전달되었습니다. 해당 어셈블리에 대한 참조를 추가하세요.
pl: Nie można odnaleźć nazwy typu „{0}” w przestrzeni nazw „{1}”. Ten typ został przesłany dalej do zestawu „{2}”. Rozważ możliwość dodania odwołania do tego zestawu.
pt_br: O nome do tipo "{0}" não pode ser encontrado no namespace "{1}". Este tipo foi encaminhado para o assembly "{2}" Considere adicionar uma referência a esse assembly.
ru: Не удалось найти имя типа "{0}" в пространстве имен "{1}". Этот тип был отправлен в сборку "{2}". Попробуйте добавить ссылку на эту сборку.
tr: {0}' tür adı '{1}' ad alanında bulunamadı. Bu tür '{2}' derlemesine iletilmiş Bu derlemeye bir başvuru eklemeyi deneyin.
zh_hans: 未能在命名空间“{1}”中找到类型名“{0}”。此类型已转发到程序集“{2}”。请考虑添加对该程序集的引用。
zh_hant: 命名空間 '{1}' 中找不到類型名稱 '{0}'。此類型已轉送到組件 '{2}'，請考慮加入該組件的參考。
