Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ReturnTypeIsStaticClass_Title
source: Static types cannot be used as return types
cs: Statické typy se nedají používat jako typy vracených hodnot
fr: Les types statiques ne peuvent pas être utilisés en tant que types de retour
it: I tipi statici non possono essere usati come tipi restituiti
ja: スタティック型を戻り値の型として使用することはできない
pl: Typów statycznych nie można używać jako typów zwracanych
pt_br: Tipos estáticos não podem ser usados como tipos de retorno
ru: Статические типы не могут использоваться в качестве возвращаемых типов
zh_hans: 静态类型不能用作返回类型
zh_hant: 靜態類型不可用作傳回型別

# WRN_ShouldNotReturn
source: A method marked [DoesNotReturn] should not return.
cs: Metoda označená jako [DoesNotReturn] by neměla vracet hodnotu
de: Eine mit [DoesNotReturn] gekennzeichnete Methode darf nicht zurückgegeben werden.
es: Un método marcado [DoesNotReturn] no debe devolver.
fr: Une méthode marquée [DoesNotReturn] ne doit pas être retournée.
it: Un metodo contrassegnato con [DoesNotReturn] non deve essere terminare normalmente.
ja: [DoesNotReturn] とマークされたメソッドを返すことはできません。
ko: [DoesNotReturn]으로 표시된 메서드는 반환하지 않아야 합니다.
pl: Metoda z oznaczeniem [DoesNotReturn] nie powinna zwracać wartości.
pt_br: Um método marcado como [DoesNotReturn] não deve ser retornado.
ru: Метод, помеченный [DoesNotReturn], не должен возвращать значение.
zh_hans: 不应返回标记为 [DoesNotReturn] 的方法。
zh_hant: 標記 [DoesNotReturn] 的方法不應傳回。

# WRN_ShouldNotReturn_Title
source: A method marked [DoesNotReturn] should not return.
cs: Metoda označená jako [DoesNotReturn] by se neměla ukončit standardním způsobem
de: Eine mit [DoesNotReturn] gekennzeichnete Methode darf nicht zurückgegeben werden.
es: Un método marcado [DoesNotReturn] no debe devolver.
fr: Une méthode marquée [DoesNotReturn] ne doit pas être retournée.
it: Un metodo contrassegnato con [DoesNotReturn] non deve essere terminare normalmente.
ja: [DoesNotReturn] とマークされたメソッドの返却禁止。
ko: [DoesNotReturn]으로 표시된 메서드는 반환하지 않아야 합니다.
pl: Metoda z oznaczeniem [DoesNotReturn] nie powinna zwracać wartości.
pt_br: Um método marcado como [DoesNotReturn] não deve ser retornado.
ru: Метод, помеченный [DoesNotReturn], не должен возвращать значение.
zh_hans: 不应返回标记为 [DoesNotReturn] 的方法。
zh_hant: 標記 [DoesNotReturn] 的方法不應傳回。

# WRN_StaticInAsOrIs
source: The second operand of an 'is' or 'as' operator may not be static type '{0}'
cs: Druhý operand operátoru is nebo as nesmí být statického typu {0}.
fr: Le second opérande d'un opérateur 'is' ou 'as' ne peut pas être du type static '{0}'
it: Il secondo operando di un operatore 'is' o 'as' non può essere di tipo statico '{0}'
ja: is' または 'as' 演算子の 2 番目のオペランドはスタティック型 '{0}' にすることはできません
pl: Drugi operand operatora „is” lub „as” nie może być typem statycznym „{0}”
pt_br: O segundo operando de um operador "is" ou "as" não pode ser do tipo estático "{0}"
ru: Второй операнд оператора "is" или "as" не может быть статического типа "{0}".
zh_hans: “is”或“as”运算符的第二个操作数不能是静态类型“{0}”
zh_hant: is' 或 'as' 運算子的第二個運算元不可為靜態類型 '{0}'

# WRN_StaticInAsOrIs_Title
source: The second operand of an 'is' or 'as' operator may not be a static type
cs: Druhý operand operátoru is nebo as nesmí být statického typu
fr: Le second opérande d'un opérateur 'is' ou 'as' ne peut pas être un type static
it: Il secondo operando di un operatore 'is' o 'as' non può essere un tipo statico
ja: 'is' または 'as' 演算子の 2 番目のオペランドは static 型にすることはできません
pl: Drugi operand operatora „is” lub „as” nie może być typem statycznym
pt_br: O segundo operando de um operador 'is' ou 'as' não pode ser do tipo estático
ru: Второй операнд оператора "is" или "as" не может иметь статический тип
zh_hans: “is”或“as”运算符的第二个操作数不能是静态类型
zh_hant: 'is' 或 'as' 運算子的第二個運算元不可為靜態類型

# WRN_SwitchExpressionNotExhaustive
source: The switch expression does not handle all possible values of its input type (it is not exhaustive). For example, the pattern '{0}' is not covered.
cs: Výraz switch nezachycuje všechny možné hodnoty vstupního typu (není úplný). Nezachycuje například vzor {0}.
fr: L'expression switch ne prend pas en charge toutes les valeurs possibles de son type d'entrée (elle n'est pas exhaustive). Par exemple, le modèle '{0}' n'est pas couvert.
it: L'espressione switch non gestisce tutti i possibili valori del relativo tipo di input (non è esaustiva). Ad esempio, il criterio '{0}' non è coperto.
ja: この switch 式では入力型の可能な値がすべて扱われるわけではありません (すべてが網羅されているわけではありません)。たとえば、パターン '{0}' がカバーされていません。
pl: Wyrażenie switch nie obsługuje wszystkich możliwych wartości typu wejściowego (nie jest wyczerpujące). Na przykład nie jest uwzględniony wzorzec „{0}”.
pt_br: A expressão switch não manipula todos os valores possíveis do tipo de entrada (ela não é exaustiva). Por exemplo, o padrão '{0}' não é coberto.
ru: Выражение switch не обрабатывает все возможные типы входных значений (не является исчерпывающим). Например, шаблон "{0}" не охвачен.
zh_hans: switch 表达式不处理其输入类型的所有可能的值(它不是穷举)。例如，模式“{0}”未包含在内。
zh_hant: switch 運算式未處理其輸入類型的所有可能值 (未徹底處理)。例如，未涵蓋模式 '{0}'。

# WRN_SwitchExpressionNotExhaustiveForNull
source: The switch expression does not handle some null inputs (it is not exhaustive). For example, the pattern '{0}' is not covered.
cs: Výraz switch nezachycuje všechny některé vstupy null (není úplný). Nezachycuje například vzor {0}.
fr: L'expression switch ne prend pas en charge certaines entrées ayant une valeur null (elle n'est pas exhaustive). Par exemple, le modèle '{0}' n'est pas couvert.
it: L'espressione switch non gestisce alcuni input Null (non è esaustiva). Ad esempio, il criterio '{0}' non è coperto.
ja: この switch 式では一部の null 入力が処理されません (すべてが網羅されているわけではありません)。たとえば、パターン '{0}' がカバーされていません。
pl: Wyrażenie switch nie obsługuje niektórych danych wejściowych o wartości null (nie jest wyczerpujące). Na przykład nie jest uwzględniony wzorzec „{0}”.
pt_br: A expressão switch não manipula algumas entradas nulas (ela não é exaustiva). Por exemplo, o padrão '{0}' não é coberto.
ru: Выражение switch не обрабатывает некоторые входные значения, равные null (не является исчерпывающим). Например, шаблон "{0}" не охвачен.
zh_hans: switch 表达式未处理某些 null 输入(它并不是穷举)。例如，模式“{0}”未包含在内。
zh_hant: switch 運算式未處理部分 null 輸入 (未徹底處理)。例如，未涵蓋模式 '{0}'。

# WRN_SwitchExpressionNotExhaustiveForNullWithWhen
source: The switch expression does not handle some null inputs (it is not exhaustive). For example, the pattern '{0}' is not covered. However, a pattern with a 'when' clause might successfully match this value.
cs: Výraz switch nezpracovává některé vstupy null (není úplný). Například vzor {0} není vyřešený. Vzor s klauzulí when však může této hodnotě úspěšně odpovídat.
fr: L'expression switch ne gère pas certaines entrées null (elle n'est pas exhaustive). Par exemple, le modèle '{0}' n'est pas couvert. Toutefois, un modèle avec une clause 'when' peut correspondre à cette valeur.
it: L'espressione switch non gestisce alcuni input Null (non è esaustiva). Ad esempio, il criterio '{0}' non è coperto. Un criterio con una clausola 'when' potrebbe però corrispondere a questo valore.
ja: 一部の null 入力が switch 式で処理されません (すべてが網羅されてはいません)。たとえば、パターン '{0}' がカバーされていません。ただし、'when' 句を含むパターンがこの値と一致する可能性があります。
pl: Wyrażenie switch nie obsługuje niektórych danych wejściowych o wartości null (nie jest kompletne). Na przykład wzorzec „{0}” nie jest uwzględniony. Jednak wzorzec z klauzulą „when” może być zgodny z tą wartością.
pt_br: A expressão switch não manipula algumas entradas nulas (não é geral). Por exemplo, o padrão '{0}' não é coberto. No entanto, um padrão com uma cláusula 'when' pode corresponder a esse valor com êxito.
ru: Выражение switch не обрабатывает некоторые входные значения null (не является исчерпывающим). Например, шаблон "{0}" не охвачен. Однако шаблон с предложением "when" может соответствовать этому значению.
zh_hans: Switch 表达式不会处理一些 null 输入(它不是穷举)。例如，模式“{0}”未包含在内。但是，带有 "when" 子句的模式可能成功匹配此值。
zh_hant: Switch 運算式未處理某些 Null 輸入 (其並不詳盡)。例如，未涵蓋模式 '{0}'。但具有 'when' 子句的模式可能可以成功與這個值相符。

# WRN_SwitchExpressionNotExhaustiveForNullWithWhen_Title
source: The switch expression does not handle some null inputs.
cs: Výraz switch nezpracovává některé vstupy s hodnotou null.
fr: L'expression switch ne prend pas en charge certaines entrées ayant une valeur null.
it: L'espressione switch non gestisce alcuni input Null.
ja: switch 式が一部の null 入力を処理しません。
pl: Wyrażenie switch nie obsługuje niektórych danych wejściowych o wartości null.
pt_br: A expressão switch não manipula algumas entradas nulas.
ru: Выражение switch не обрабатывает некоторые входные данные NULL.
zh_hans: Switch 表达式不会处理某些为 null 的输入。
zh_hant: Switch 運算式未處理某些 null 輸入。

# WRN_SwitchExpressionNotExhaustiveForNull_Title
source: The switch expression does not handle some null inputs.
cs: Výraz switch nezpracovává některé vstupy s hodnotou null.
de: Der switch-Ausdruck verarbeitet einige NULL-Eingaben nicht.
es: La expresión switch no controla algunas entradas de tipo NULL.
fr: L'expression switch ne prend pas en charge certaines entrées ayant une valeur null.
it: L'espressione switch non gestisce alcuni input Null.
ja: switch 式が一部の null 入力を処理しません。
ko: switch 식은 일부 null 입력을 처리하지 않습니다.
pl: Wyrażenie switch nie obsługuje niektórych danych wejściowych o wartości null.
pt_br: A expressão switch não manipula algumas entradas nulas.
ru: Выражение switch не обрабатывает некоторые входные данные NULL.
tr: Switch ifadesi bazı null girişleri işlemiyor.
zh_hans: Switch 表达式不会处理某些为 null 的输入。
zh_hant: Switch 運算式未處理某些 null 輸入。

# WRN_SwitchExpressionNotExhaustiveWithWhen
source: The switch expression does not handle all possible values of its input type (it is not exhaustive). For example, the pattern '{0}' is not covered. However, a pattern with a 'when' clause might successfully match this value.
cs: Výraz switch nezpracovává všechny možné hodnoty typu svého vstupu (není úplný). Například vzor {0} není vyřešený. Vzor s klauzulí when však může této hodnotě úspěšně odpovídat.
fr: L'expression switch ne prend pas en charge toutes les valeurs possibles de son type d'entrée (elle n'est pas exhaustive). Par exemple, le modèle '{0}' n'est pas couvert. Toutefois, un modèle avec une clause 'when' peut correspondre à cette valeur.
it: L'espressione switch non gestisce tutti i possibili valori del relativo tipo di input (non è esaustiva). Ad esempio, il criterio '{0}' non è coperto. Un criterio con una clausola 'when' potrebbe però corrispondere a questo valore.
ja: 入力型の可能な値の一部が switch 式で処理されません (すべてが網羅されてはいません)。たとえば、パターン '{0}' がカバーされていません。ただし、'when' 句を含むパターンがこの値と一致する可能性があります。
pl: Wyrażenie switch nie obsługuje wszystkich możliwych wartości jego typu danych wejściowych (nie jest kompletne). Na przykład wzorzec „{0}” nie jest uwzględniony. Jednak wzorzec z klauzulą „when” może być zgodny z tą wartością.
pt_br: A expressão switch não manipula todos os valores possíveis do seu tipo de entrada (isso não é geral). Por exemplo, o padrão '{0}' não é coberto. No entanto, um padrão com uma cláusula 'when' pode corresponder a esse valor com êxito.
ru: Выражение switch не обрабатывает все возможные значения входного типа (не является исчерпывающим). Например, шаблон "{0}" не охвачен. Однако шаблон с предложением "when" может соответствовать этому значению.
zh_hans: Switch 表达式不会处理其输入类型的所有可能值(它不是穷举)。例如，模式“{0}”未包含在内。但是，带有 "when" 子句的模式可能成功匹配此值。
zh_hant: Switch 運算式不會處理其輸入類型所有可能的值 (其並不詳盡)。例如，未涵蓋模式 '{0}'。但具有 'when' 子句的模式可能可以成功與這個值相符。

# WRN_SwitchExpressionNotExhaustiveWithWhen_Title
source: The switch expression does not handle all possible values of its input type (it is not exhaustive).
cs: Výraz switch nezpracovává všechny možné hodnoty svého vstupního typu (není úplný).
fr: L'expression switch ne prend pas en charge toutes les valeurs possibles de son type d'entrée (elle n'est pas exhaustive).
it: L'espressione switch non gestisce tutti i possibili valori del relativo tipo di input (non è esaustiva).
ja: switch 式が入力の種類で可能なすべての値を処理していません (すべてを網羅していません)。
pl: Wyrażenie switch nie obsługuje wszystkich możliwych wartości jego typu danych wejściowych (nie jest kompletne).
pt_br: A expressão switch não manipula todos os valores possíveis de seu tipo de entrada (não é exaustiva).
ru: Выражение switch обрабатывает не все возможные значения своего типа входных данных (оно не полное).
zh_hans: switch 表达式不会处理属于其输入类型的所有可能值(它并非详尽无遗)。
zh_hant: switch 運算式未處理其輸入類型可能的值 (並非全部)。

# WRN_SwitchExpressionNotExhaustive_Title
source: The switch expression does not handle all possible values of its input type (it is not exhaustive).
cs: Výraz switch nezpracovává všechny možné hodnoty svého vstupního typu (není úplný)
de: Der switch-Ausdruck verarbeitet nicht alle möglichen Werte des zugehörigen Eingabetyps (nicht umfassend).
es: La expresión switch no controla todos los valores posibles de su tipo de entrada (no es exhaustiva).
fr: L'expression switch ne prend pas en charge toutes les valeurs possibles de son type d'entrée (elle n'est pas exhaustive).
it: L'espressione switch non gestisce tutti i possibili valori del relativo tipo di input (non è esaustiva).
ja: switch 式が入力の種類で可能なすべての値を処理していません (すべてを網羅していません)。
ko: switch 식에서 입력 형식의 가능한 값을 모두 처리하지는 않습니다(전체 아님).
pl: Wyrażenie switch nie obsługuje wszystkich możliwych wartości jego typu danych wejściowych (nie jest kompletne).
pt_br: A expressão switch não manipula todos os valores possíveis de seu tipo de entrada (não é exaustiva).
ru: Выражение switch обрабатывает не все возможные значения своего типа входных данных (оно не полное).
tr: Switch ifadesi giriş türünün tüm olası değerlerini işlemiyor. (İfade tam kapsamlı değil.)
zh_hans: switch 表达式不会处理属于其输入类型的所有可能值(它并非详尽无遗)。
zh_hant: switch 運算式未處理其輸入類型可能的值 (並非全部)。

# WRN_TargetDifferentRefness
source: Reference kind modifier of parameter '{0}' doesn't match the corresponding parameter '{1}' in target.
fr: Le modificateur de genre de référence du paramètre « {0} » ne correspond pas au paramètre « {1} » correspondant dans la cible.
it: Il modificatore del tipo di riferimento del parametro '{0}' non corrisponde al parametro corrispondente '{1}' nella destinazione.
ja: パラメーター '{0}' の参照の種類修飾子が、ターゲット内の対応するパラメーター '{1}' と一致しません。
pl: Modyfikator rodzaju odwołania parametru „{0}” nie jest zgodny z odpowiadającym mu parametrem „{1}” w lokalizacji docelowej.
pt_br: O modificador de tipo de referência do parâmetro '{0}' não corresponde ao parâmetro '{1}' correspondente no destino.
ru: Модификатор типа ссылки параметра "{0}" не совпадает с соответствующим параметром "{1}" в целевом объекте.
zh_hans: 参数“{0}”的引用类型修饰符与目标中的相应参数“{1}”不匹配。
zh_hant: 參數 '{0}' 的參考種類修飾元不符合目標中的對應參數 '{1}'。

# WRN_TargetDifferentRefness_Title
source: Reference kind modifier of parameter doesn't match the corresponding parameter in target.
fr: Le modificateur de genre de référence du paramètre ne correspond pas au paramètre correspondant dans la cible.
it: Il modificatore del tipo di riferimento del parametro non corrisponde al parametro corrispondente nella destinazione.
ja: パラメーターの参照の種類修飾子が、ターゲット内の対応するパラメーターと一致しません。
pl: Modyfikator rodzaju odwołania parametru nie jest zgodny z odpowiadającym mu parametrem w lokalizacji docelowej.
pt_br: O modificador de tipo de referência do parâmetro não corresponde ao parâmetro correspondente no destino.
ru: Модификатор типа ссылки параметра не совпадает с соответствующим параметром в целевом объекте.
zh_hans: 参数的引用类型修饰符与目标中的相应参数不匹配。
zh_hant: 參數的參考種類修飾元不符合目標中的對應參數。

# WRN_ThrowPossibleNull
source: Thrown value may be null.
cs: Vyvolaná hodnota může být null.
de: Der ausgelöste Wert darf NULL sein.
es: El valor generado puede ser NULL.
fr: La valeur levée est peut-être null.
it: Il valore generato può essere Null.
ja: スローされた値が null である可能性があります。
ko: Throw된 값이 null일 수 있습니다.
pl: Zgłoszona wartość może być równa null.
pt_br: O valor gerado pode ser nulo.
ru: Выданное значение может быть равно NULL.
tr: Oluşturulan değer null olabilir.
zh_hans: 抛出的值可能为 null。
zh_hant: 擲回值可能為 null。

# WRN_ThrowPossibleNull_Title
source: Thrown value may be null.
cs: Vyvolaná hodnota může být null.
de: Der ausgelöste Wert darf NULL sein.
es: El valor generado puede ser NULL.
fr: La valeur levée est peut-être null.
it: Il valore generato può essere Null.
ja: スローされた値が null である可能性があります。
ko: Throw된 값이 null일 수 있습니다.
pl: Zgłoszona wartość może być równa null.
pt_br: O valor gerado pode ser nulo.
ru: Выданное значение может быть равно NULL.
tr: Oluşturulan değer null olabilir.
zh_hans: 抛出的值可能为 null。
zh_hant: 擲回值可能為 null。

# WRN_TopLevelNullabilityMismatchInParameterTypeOnExplicitImplementation
source: Nullability of reference types in type of parameter '{0}' doesn't match implemented member '{1}' (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} neodpovídá implementovanému členu {1} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type du paramètre '{0}' ne correspond pas au membre implémenté '{1}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' non corrisponde al membro implementato '{1}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーター '{0}' の型における参照型の NULL 値の許容が、実装されるメンバー '{1}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru „{0}” nie jest zgodne z zaimplementowaną składową „{1}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro '{0}' não corresponde ao membro implementado '{1}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра "{0}" не соответствует реализованному элементу "{1}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数“{0}”类型中引用类型的为 Null 性与实现的成员“{1}”不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型 '{0}' 中參考型別是否可為 NULL 的情況，與實作的成員 '{1}' 不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInParameterTypeOnExplicitImplementation_Title
source: Nullability of reference types in type of parameter doesn't match implemented member (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá implementovanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type du paramètre ne correspond pas au membre implémenté (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al membro implementato, probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーターの型における参照型の NULL 値の許容が、実装されるメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru nie jest zgodne z zaimplementowaną składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro não corresponde ao membro implementado (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра не соответствует реализованному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数类型中引用类型的为 Null 性与实现的成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型中參考型別是否可為 NULL 的情況，與實作的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInParameterTypeOnImplicitImplementation
source: Nullability of reference types in type of parameter '{0}' of '{1}' doesn't match implicitly implemented member '{2}' (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} z {1} neodpovídá implicitně implementovanému členu {2} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type du paramètre '{0}' de '{1}' ne correspond pas au membre implémenté implicitement '{2}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' di '{1}' non corrisponde al membro implementato in modo implicito '{2}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: '{1}' のパラメーター '{0}' の型における参照型の NULL 値の許容が、暗黙的に実装されるメンバー '{2}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru „{0}” z elementu „{1}” nie jest zgodne z zaimplementowaną składową „{2}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro '{0}' de '{1}' não corresponde ao membro implementado implicitamente '{2}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра "{0}" объекта "{1}" не соответствует неявно реализованному элементу "{2}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: “{1}”的参数“{0}”类型中引用类型的为 Null 性与隐式实现的成员“{2}”不匹配(可能是由于为 Null 性特性)。
zh_hant: '{1}' 的 '{0}' 參數類型中，參考型別是否可為 NULL 的情況，與隱含實作的成員 '{2}' 不相符 (可能的原因是屬性可為 NULL)。

# WRN_TopLevelNullabilityMismatchInParameterTypeOnImplicitImplementation_Title
source: Nullability of reference types in type of parameter doesn't match implicitly implemented member (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá implicitně implementovanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type du paramètre ne correspond pas au membre implémenté implicitement (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al membro implementato in modo implicito, probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーターの型における参照型の NULL 値の許容が、暗黙的に実装されるメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru nie jest zgodne z niejawnie zaimplementowaną składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro não corresponde ao membro implementado implicitamente (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра не соответствует неявно реализованному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数类型中引用类型的为 Null 性与隐式实现的成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型中參考型別是否可為 NULL 的情況，與隱含實作的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInParameterTypeOnOverride
source: Nullability of type of parameter '{0}' doesn't match overridden member (possibly because of nullability attributes).
cs: Možnost použití hodnoty null u typu parametru {0} neodpovídá přepsanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité de type du paramètre '{0}' ne correspond pas au membre substitué (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null del tipo del parametro '{0}' non corrisponde al membro di cui è stato eseguito l'override, probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーター '{0}' の型の NULL 値の許容が、オーバーライドされたメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typu parametru „{0}” nie jest zgodne z przesłoniętą składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade do tipo de parâmetro '{0}' não corresponde ao membro substituído (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для типа параметра "{0}" не соответствует переопределенному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数“{0}”类型的为 Null 性与重写成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型 '{0}' 是否可為 NULL 的情況，與覆寫的成員不相符 (可能的原因是屬性可為 NULL )。
