Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_DynamicDispatchToConditionalMethod
source: The dynamically dispatched call to method '{0}' may fail at runtime because one or more applicable overloads are conditional methods.
cs: Dynamicky volané volání do metody {0} se za běhu nemusí zdařit, protože nejmíň jedno použitelné přetížení je podmíněná metoda.
de: Der dynamisch gebundene Aufruf von Methode "{0}" verursacht möglicherweise einen Fehler zur Laufzeit, weil es sich bei mindestens einer geltenden Überladung um eine bedingte Methode handelt.
es: La llamada al método '{0}' enviada de forma dinámica puede dar error en tiempo de ejecución porque una o varias sobrecargas aplicables son métodos condicionales.
fr: L'appel dispatché dynamiquement à la méthode '{0}' peut échouer au moment de l'exécution, car une ou plusieurs surcharges applicables sont des méthodes conditionnelles.
it: La chiamata al metodo '{0}' inviata in modo dinamico potrebbe non riuscire in fase di esecuzione perché uno o più overload applicabili sono metodi condizionali.
ja: 適用可能な 1 つ以上のオーバーロードが条件付きメソッドであるため、動的ディスパッチされたメソッド '{0}' の呼び出しは実行時に失敗する可能性があります。
ko: 적용 가능한 하나 이상의 오버로드가 조건부 메서드이므로 '{0}' 메서드에 대해 동적으로 디스패치된 호출이 런타임에 실패할 수 있습니다.
pl: Dynamicznie przydzielane wywołanie metody „{0}” może nie powieść się w czasie wykonywania, ponieważ co najmniej jedno z przeciążeń, które można zastosować, to metoda warunkowa.
pt_br: A chamada dinamicamente vinculada para o método "{0}" pode falhar em runtime porque um ou mais sobrecargas aplicáveis são métodos condicionais.
ru: Вызов метода "{0}" с динамической диспетчеризацией может привести к ошибке во время выполнения, поскольку одна или несколько применимых перегрузок являются условными методами.
tr: {0}' yöntemine dinamik olarak gönderilen çağrı çalışma zamanında hata verebilir çünkü bir veya daha fazla uygulanabilir aşırı yüklemeler koşullu yöntemlerdir.
zh_hans: 动态调度的方法“{0}”调用可能会在运行时失败，因为一个或多个适用的重载为条件方法。
zh_hant: 以動態方式將呼叫分派至方法 '{0}' 可能會在執行階段失敗，因為有一個或多個適用的多載為條件式方法。

# WRN_DynamicDispatchToConditionalMethod_Title
source: Dynamically dispatched call may fail at runtime because one or more applicable overloads are conditional methods
cs: Dynamicky volané volání může za běhu selhat, protože nejmíň jedno použitelné přetížení představuje podmíněnou metodu.
de: Ein dynamisch gebundener Aufruf verursacht möglicherweise einen Fehler zur Laufzeit, da mindestens eine anwendbare Überladung eine bedingte Methode ist.
es: La llamada distribuida dinámicamente puede fallar en el tiempo de ejecución porque una o más sobrecargas aplicables son métodos condicionales
fr: L'appel dispatché dynamiquement peut échouer au moment de l'exécution, car une ou plusieurs surcharges applicables sont des méthodes conditionnelles
it: La chiamata inviata in modo dinamico potrebbe non riuscire in fase di esecuzione perché uno o più overload applicabili sono metodi condizionali
ja: 適用可能な 1 つ以上のオーバーロードが条件付きメソッドであるため、動的ディスパッチされた呼び出しは実行時に失敗することがあります
ko: 하나 이상의 적용 가능한 오버로드가 조건부 메서드이므로 동적으로 디스패치된 호출이 런타임에 실패할 수 있습니다.
pl: Dynamicznie przydzielane wywołanie może nie powieść się w czasie wykonywania, ponieważ co najmniej jedno z przeciążeń, które można zastosować, to metoda warunkowa
pt_br: Uma chamada vinculada dinamicamente pode falhar no tempo de execução porque uma ou mais sobrecargas aplicáveis são métodos condicionais
ru: Может произойти сбой динамически диспетчеризируемого вызова во время выполнения, так как одна или несколько применимых перегрузок являются условными методами
tr: Bir veya daha fazla uygulanabilir aşırı yükleme koşullu yöntemler olduğundan dinamik olarak gönderilen çağrı çalışma zamanında başarısız olabilir
zh_hans: 动态调度的调用可能会在运行时失败，因为一个或多个适用的重载为条件方法
zh_hant: 以動態分派的呼叫可能會在執行階段失敗，因為一個或多個適用的多載是條件式方法

# ERR_BadArgTypeDynamicExtension
source: '{0}' has no applicable method named '{1}' but appears to have an extension method by that name. Extension methods cannot be dynamically dispatched. Consider casting the dynamic arguments or calling the extension method without the extension method syntax.
cs: {0} nemá žádnou použitelnou metodu s názvem {1}, ale zřejmě má metodu rozšíření s tímto názvem. Metody rozšíření se nedají volat dynamicky. Zvažte použití dynamických argumentů nebo volání metody rozšíření bez syntaxe metody rozšíření.
de: '"{0}" weist keine gültige Methode namens "{1}" auf, verfügt aber offenbar über eine Erweiterungsmethode mit diesem Namen. Erweiterungsmethoden können nicht dynamisch gebunden werden. Wandeln Sie die dynamischen Argumente um, oder rufen Sie die Erweiterungsmethode ohne die Syntax von Erweiterungsmethoden auf.
es: '{0}' no tiene ningún método aplicable denominado '{1}', pero tiene un método de extensión con ese nombre. Los métodos de extensión no se pueden enviar de forma dinámica. Puede convertir los argumentos dinámicos o llamar al método de extensión sin la sintaxis de método de extensión.
fr: '{0}' n'a aucune méthode applicable nommée '{1}' mais semble avoir une méthode d'extension portant ce nom. Les méthodes d'extension ne peuvent pas être dispatchées dynamiquement. Effectuez un cast des arguments dynamiques ou appelez la méthode d'extension sans la syntaxe de méthode d'extension.
it: '{0}' non contiene alcun metodo applicabile denominato '{1}' ma apparentemente include un metodo di estensione con tale nome. I metodi di estensione non possono essere inviati dinamicamente. Provare a eseguire il cast degli argomenti dinamici o a chiamare il metodo di estensione senza la relativa sintassi.
ja: '{0}' には、'{1}'という名前の該当するメソッドがありませんが、同じ名前の拡張メソッドがあるようです。拡張メソッドは動的ディスパッチできません。動的引数をキャストするか、または拡張メソッド構文を使用しないで拡張メソッドを呼び出すことを検討してください。
ko: '{0}'에 이름이 '{1}'인 적용 가능한 메서드가 없지만 이 이름의 확장 메서드는 있습니다. 확장 메서드는 동적으로 발송할 수 없습니다. 동적 인수를 캐스팅하거나 확장 메서드 구문 없이 확장 메서드를 호출해 보세요.
pl: „{0}” nie ma odpowiedniej metody o nazwie „{1}”, ale wygląda na to, że ma metodę rozszerzenia o tej nazwie. Metody rozszerzenia nie mogą być przydzielane dynamicznie. Rozważ rzutowanie dynamicznych argumentów lub wywołanie metody rozszerzenia bez składni metody rozszerzenia.
pt_br: "{0}" não tem nenhum método aplicável nomeado "{1}" mas parece ter um método de extensão com esse nome. Métodos de extensão não podem ser vinculados dinamicamente. Considere a possibilidade de converter os argumentos dinâmicos ou chamar o método de extensão sem a sintaxe do método de extensão.
ru: "{0}" не имеет применимого метода с именем "{1}", но, по-видимому, имеет метод расширения с таким именем. Методы расширения диспетчеризовать динамически. Попробуйте привести динамические аргументы или вызвать метод расширения без использования синтаксиса метода расширения.
tr: '{0}', '{1}' adlı uygun bir yönteme sahip değil, ancak bu adda bir genişletme yöntemine sahip gibi görünüyor. Genişletme yöntemleri dinamik olarak dağıtılamaz. Dinamik bağımsız değişkenlere tür atamayı veya genişletme yöntemini genişletme yöntemi sözdizimi olmadan çağırmayı düşünün.
zh_hans: “{0}”不具有名为“{1}”的适用方法，但是似乎有该名称的扩展方法。无法动态调度扩展方法。请考虑强制转换动态参数或在不使用扩展方法语法的情况下调用扩展方法。
zh_hant: '{0}' 沒有名稱為 '{1}' 的適用方法，但似乎有使用該名稱的擴充方法。擴充方法不可以動態方式分派。請考慮將動態引數轉型，或不要利用擴充方法語法來呼叫擴充方法。

# WRN_CallerFilePathPreferredOverCallerMemberName
source: The CallerMemberNameAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerFilePathAttribute.
cs: CallerMemberNameAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho CallerFilePathAttribute.
de: Das auf Parameter "{0}" angewendete CallerMemberNameAttribute hat keine Auswirkung. Es wird vom CallerFilePathAttribute überschrieben.
es: El CallerMemberNameAttribute aplicado al parámetro '{0}' no tendrá efecto. Lo invalida el CallerFilePathAttribute.
fr: CallerMemberNameAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerFilePathAttribute.
it: CallerMemberNameAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerFilePathAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerMemberNameAttribute は、CallerFilePathAttribute.によってオーバーライドされるため無効となります。
ko: {0}' 매개 변수에 적용되는 CallerMemberNameAttribute는 효과가 없습니다. CallerFilePathAttribute에서 재정의합니다.
pl: Zastosowanie elementu CallerMemberNameAttribute do parametru „{0}” nie odniesie żadnego skutku. Jest on przesłaniany przez element CallerFilePathAttribute.
pt_br: O CallerMemberNameAttribute aplicado ao parâmetro "{0}" não terá efeito. Ele é substituído pelo CallerFilePathAttribute.
ru: Применение CallerMemberNameAttribute к параметру "{0}" ни к чему не приведет. Он переопределяется с помощью CallerFilePathAttribute.
tr: {0}' parametresi için geçerli olan CallerMemberNameAttribute öğesinin hiçbir etkisi olmaz. CallerFilePathAttribute tarafından geçersiz kılındı.
zh_hans: 应用于参数“{0}”的 CallerMemberNameAttribute 将不起任何作用。它由 CallerFilePathAttribute 重写。
zh_hant: 套用到參數 '{0}' 的 CallerMemberNameAttribute 將沒有作用，因為 CallerFilePathAttribute 會覆寫它。

# WRN_CallerFilePathPreferredOverCallerMemberName_Title
source: The CallerMemberNameAttribute will have no effect; it is overridden by the CallerFilePathAttribute
cs: CallerMemberNameAttribute nebude mít žádný efekt. Přepisuje ho CallerFilePathAttribute.
de: Das CallerMemberNameAttribute hat keine Auswirkung; es wird von dem CallerFilePathAttribute überschrieben
es: El atributo CallerMemberNameAttribute no tendrá efecto: lo reemplaza el atributo CallerFilePathAttribute
fr: CallerMemberNameAttribute n'aura pas d'effet ; il est remplacé par CallerFilePathAttribute
it: CallerMemberNameAttribute non avrà alcun effetto. CallerFilePathAttribute ne eseguirà l'override
ja: CallerMemberNameAttribute は効果がなく、CallerFilePathAttribute によってオーバーライドされます
ko: CallerMemberNameAttribute는 CallerFilePathAttribute에 의해 재정의되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerMemberNameAttribute nie odniesie żadnego skutku; zostanie on przesłonięty przez element CallerFilePathAttribute
pt_br: O CallerMemberNameAttribute não terá nenhum efeito; ele é substituído pelo CallerFilePathAttribute
ru: Атрибут CallerMemberNameAttribute не будет работать: он переопределяется атрибутом CallerFilePathAttribute
tr: CallerMemberNameAttribute öğesinin etkisi olmayacak; CallerFilePathAttribute tarafından geçersiz kılındı
zh_hans: CallerMemberNameAttribute 将不起任何作用；它由 CallerFilePathAttribute 重写
zh_hant: CallerMemberNameAttribute 將沒有效果; CallerFilePathAttribute 會覆寫它

# WRN_CallerLineNumberPreferredOverCallerMemberName
source: The CallerMemberNameAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerLineNumberAttribute.
cs: CallerMemberNameAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho CallerLineNumberAttribute.
de: Das auf Parameter "{0}" angewendete CallerMemberNameAttribute hat keine Auswirkung. Es wird vom CallerLineNumberAttribute überschrieben.
es: El CallerMemberNameAttribute aplicado al parámetro '{0}' no tendrá efecto. Lo invalida el CallerLineNumberAttribute.
fr: CallerMemberNameAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerLineNumberAttribute.
it: CallerMemberNameAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerMemberNameAttribute は、CallerLineNumberAttribute によってオーバーライドされるため無効となります。
ko: {0}' 매개 변수에 적용되는 CallerMemberNameAttribute는 효과가 없습니다. CallerLineNumberAttribute에서 재정의합니다.
pl: Zastosowanie elementu CallerMemberNameAttribute do parametru „{0}” nie odniesie żadnego skutku. Jest on przesłaniany przez element CallerLineNumberAttribute.
pt_br: O CallerMemberNameAttribute aplicado ao parâmetro "{0}" não terá efeito. Ele é substituído pelo CallerLineNumberAttribute.
ru: Применение CallerMemberNameAttribute к параметру "{0}" ни к чему не приведет. Он переопределяется с помощью CallerLineNumberAttribute.
tr: {0}' parametresine uygulanan CallerMemberNameAttribute değerinin hiçbir etkisi olmayacaktır. CallerLineNumberAttribute tarafından geçersiz kılınmıştır.
zh_hans: 应用于参数“{0}”的 CallerMemberNameAttribute 将不起任何作用。它由 CallerLineNumberAttribute 重写。
zh_hant: 套用到參數 '{0}' 的 CallerMemberNameAttribute 將沒有作用，因為 CallerLineNumberAttribute 會覆寫它。

# WRN_CallerLineNumberPreferredOverCallerMemberName_Title
source: The CallerMemberNameAttribute will have no effect; it is overridden by the CallerLineNumberAttribute
cs: CallerMemberNameAttribute nebude mít žádný efekt. Přepisuje ho CallerLineNumberAttribute.
de: Das CallerMemberNameAttribute hat keine Auswirkungen; es wird von dem CallerLineNumberAttribute überschrieben
es: El atributo CallerMemberNameAttribute no tendrá efecto: lo reemplaza el atributo CallerLineNumberAttribute
fr: CallerMemberNameAttribute n'aura pas d'effet ; il est remplacé par CallerLineNumberAttribute
it: CallerMemberNameAttribute non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override
ja: CallerMemberNameAttribute は効果がなく、CallerLineNumberAttribute によってオーバーライドされます
ko: CallerMemberNameAttribute는 CallerLineNumberAttribute에 의해 재정의되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerMemberNameAttribute nie odniesie żadnego skutku; zostanie on przesłonięty przez element CallerLineNumberAttribute
pt_br: O CallerMemberNameAttribute não terá nenhum efeito; ele é substituído pelo CallerLineNumberAttribute
ru: Атрибут CallerMemberNameAttribute не будет работать: он переопределяется атрибутом CallerLineNumberAttribute
tr: CallerMemberNameAttribute öğesinin etkisi olmayacak; CallerLineNumberAttribute tarafından geçersiz kılındı
zh_hans: CallerMemberNameAttribute 将不起任何作用；它由 CallerLineNumberAttribute 重写
zh_hant: CallerMemberNameAttribute 將沒有效果; CallerLineNumberAttribute 會覆寫它

# WRN_CallerLineNumberPreferredOverCallerFilePath
source: The CallerFilePathAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerLineNumberAttribute.
cs: CallerFilePathAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho CallerLineNumberAttribute.
de: Das auf Parameter "{0}" angewendete CallerFilePathAttribute hat keine Auswirkung. Es wird vom CallerLineNumberAttribute überschrieben.
es: El CallerFilePathAttribute aplicado al parámetro '{0}' no tendrá efecto. Lo invalida el CallerLineNumberAttribute.
fr: CallerFilePathAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerLineNumberAttribute.
it: CallerFilePathAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerFilePathAttribute は、CallerLineNumberAttribute によってオーバーライドされるため無効となります。
ko: {0}' 매개 변수에 적용되는 CallerFilePathAttribute는 효과가 없습니다. CallerLineNumberAttribute에서 재정의합니다.
pl: Zastosowanie elementu CallerFilePathAttribute do parametru „{0}” nie odniesie żadnego skutku. Jest on przesłaniany przez element CallerLineNumberAttribute.
pt_br: O CallerFilePathAttribute aplicado ao parâmetro "{0}" não terá efeito. Ele é substituído pelo CallerLineNumberAttribute.
ru: Применение CallerFilePathAttribute к параметру "{0}" ни к чему не приведет. Он переопределяется с помощью CallerLineNumberAttribute.
tr: {0}' parametresi için geçerli olan CallerFilePathAttribute öğesinin hiçbir etkisi olmaz. CallerLineNumberAttribute tarafından geçersiz kılındı.
zh_hans: 应用于参数“{0}”的 CallerFilePathAttribute 将不起任何作用。它由 CallerLineNumberAttribute 重写。
zh_hant: 套用到參數 '{0}' 的 CallerFilePathAttribute 將沒有作用，因為 CallerLineNumberAttribute 會覆寫它。

# WRN_CallerLineNumberPreferredOverCallerFilePath_Title
source: The CallerFilePathAttribute will have no effect; it is overridden by the CallerLineNumberAttribute
cs: CallerFilePathAttribute nebude mít žádný efekt. Přepisuje ho CallerLineNumberAttribute.
de: Das CallerFilePathAttribute hat keine Auswirkungen; es wird von dem CallerLineNumberAttribute überschrieben
es: El atributo CallerFilePathAttribute no tendrá efecto: lo reemplaza el atributo CallerLineNumberAttribute
fr: CallerFilePathAttribute n'aura pas d'effet ; il est remplacé par CallerLineNumberAttribute
it: CallerFilePathAttribute non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override
ja: CallerFilePathAttribute は効果がなく、CallerLineNumberAttribute によってオーバーライドされます
ko: CallerFilePathAttribute는 CallerLineNumberAttribute에 의해 재정의되므로 효과가 없습니다.
pl: Zastosowanie elementu CallerFilePathAttribute nie odniesie żadnego skutku; zostanie on przesłonięty przez element CallerLineNumberAttribute
pt_br: O CallerFilePathAttribute não terá nenhum efeito; ele é substituído pelo CallerLineNumberAttribute
ru: Атрибут CallerFilePathAttribute не будет работать: он переопределяется атрибутом CallerLineNumberAttribute
tr: CallerFilePathAttribute öğesinin etkisi olmayacak; CallerLineNumberAttribute tarafından geçersiz kılındı
zh_hans: CallerFilePathAttribute 将不起任何作用；它由 CallerLineNumberAttribute 重写
zh_hant: CallerFilePathAttribute 將沒有效果; CallerLineNumberAttribute 會覆寫它

# ERR_InvalidDynamicCondition
source: Expression must be implicitly convertible to Boolean or its type '{0}' must not be an interface and must define operator '{1}'.
it: L'espressione deve essere convertibile in modo implicito in un valore booleano oppure il relativo tipo '{0}' deve definire l'operatore '{1}'.
pt_br: A expressão deve ser implicitamente conversível em booliano ou seu tipo "{0}" não deve ser uma interface e deve definir o operador "{1}".
zh_hans: 表达式必须可隐式转换为布尔值，或其类型“{0}”必须定义运算符“{1}”。

# ERR_MixingWinRTEventWithRegular
source: '{0}' cannot implement '{1}' because '{2}' is a Windows Runtime event and '{3}' is a regular .NET event.
cs: {0} nemůže implementovat {1}, protože {2} je událost Windows Runtimu a {3} je normální událost .NET.
de: '"{0}" kann "{1}" nicht implementieren, da "{2}" ein Windows-Runtime-Ereignis und "{3}" ein reguläres .NET-Ereignis ist.
es: '{0}' no puede implementar '{1}' porque '{2}' es un evento de Windows Runtime y '{3}' es un evento normal de .NET.
fr: '{0}' ne peut pas implémenter '{1}', car '{2}' est un événement Windows Runtime et '{3}' est un événement .NET normal.
it: '{0}' non può implementare '{1}' perché '{2}' è un evento Windows Runtime e '{3}' è un evento .NET normale.
ja: '{2}' は Windows ランタイム イベントで、'{3}' は通常の .NET イベントであるため、'{0}' は '{1}' を実装できません。
ko: '{2}'은(는) Windows Runtime 이벤트이고 '{3}'은(는) 일반 .NET 이벤트이므로 '{0}'에서 '{1}'을(를) 구현할 수 없습니다.
pl: 'Element „{0}” nie może implementować elementu „{1}”, ponieważ „{2}” to zdarzenie środowiska wykonawczego systemu Windows, a „{3}” to zwykłe zdarzenie środowiska .NET.
pt_br: '{0}' não pode implementar '{1}' porque '{2}' é um evento de Windows Runtime e '{3}' é um evento regular do .NET.
ru: "{0}" не может реализовать "{1}", так как "{2}" является событием среды выполнения Windows и "{3}" является регулярным событием .NET.
tr: '{2}' bir Windows Çalışma Zamanı olayı ve '{3}' bir düzenli .NET olayı olduğundan '{0}' '{1}' öğesini uygulayamıyor.
zh_hans: “{0}”无法实现“{1}”，因为“{2}”是 Windows 运行时事件，“{3}”是常规 .NET 事件。
zh_hant: '{0}' 不可實作 '{1}'，因為 '{2}' 是 Windows 執行階段事件，而 '{3}' 是一般 .NET 事件。

# ERR_NewCoClassOnLink
source: Interop type '{0}' cannot be embedded. Use the applicable interface instead.
cs: Typ spolupráce {0} nemůže být vložený. Místo něho použijte použitelné rozhraní.
de: Der Interoptyp "{0}" kann nicht eingebettet werden. Verwenden Sie stattdessen die entsprechende Schnittstelle.
es: El tipo de interoperabilidad '{0}' no se puede incrustar. En su lugar, use la interfaz aplicable.
fr: Impossible d'incorporer le type interop '{0}'. Utilisez plutôt l'interface applicable.
it: Non è possibile incorporare il tipo di interoperabilità '{0}'. Usare l'interfaccia applicabile.
ja: 相互運用型 '{0}' を埋め込むことができません。該当するインターフェイスを使用してください。
ko: Interop 형식 '{0}'을(를) 포함할 수 없습니다. 적용 가능한 인터페이스를 대신 사용하세요.
pl: Nie można osadzić typu międzyoperacyjnego „{0}”. Użyj zamiast tego odpowiedniego interfejsu.
pt_br: Tipo de interoperabilidade "{0}" não pode ser incorporado. Ao invés disso, use a interface aplicável.
ru: Не удается внедрить тип взаимодействия "{0}". Используйте вместо него доступный интерфейс.
tr: {0}' birlikte çalışma türü gömülemiyor. Bunun yerine uygulanabilir arabirim kullanın.
zh_hans: 无法嵌入互操作类型“{0}”。请改用适用的接口。
zh_hant: 無法內嵌 Interop 類型 '{0}'。請改用適當的介面。

# ERR_NoPIANestedType
source: Type '{0}' cannot be embedded because it is a nested type. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože je vnořeným typem. Zvažte nastavení vlastnosti Vložit typy spolupráce na false.
de: Der Typ "{0}" kann nicht eingebettet werden, da es sich um einen geschachtelten Typ handelt. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf "False" fest.
es: El tipo '{0}' no se puede incrustar porque es un tipo anidado. Puede establecer la propiedad 'Incrustar tipos de interoperabilidad' en false.
fr: Impossible d'incorporer le type '{0}', car il s'agit d'un type imbriqué. Attribuez à la propriété 'Incorporer les types interop' la valeur false.
it: Non è possibile incorporare il tipo '{0}' perché è un tipo annidato. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' は入れ子型であるため埋め込むことができません。'相互運用機能型の埋め込み' プロパティを false に設定することを検討してください。
ko: {0}' 형식은 중첩 형식이기 때문에 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정하세요.
pl: Typu „{0}” nie można osadzić, ponieważ to jest typ zagnieżdżony. Rozważ ustawienie właściwości „Osadź typy międzyoperacyjne” na wartość false.
pt_br: Tipo "{0}" não pode ser inserido porque ele é de um tipo aninhado. Considere configurar a propriedade "Inserir Tipos de Interoperabilidade" como falsa.
ru: Не удается внедрить тип "{0}", так как он является вложенным. Попробуйте задать свойству "Внедрить типы взаимодействия" значение False.
tr: İç içe yerleştirilmiş bir tür olduğundan '{0}' türü gömülemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入类型“{0}”，因为它是嵌套类型。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 無法內嵌類型 '{0}'，因為其為巢狀類型。請考慮將 [內嵌 Interop 類型] 屬性設定為 false。

# ERR_GenericsUsedInNoPIAType
source: Type '{0}' cannot be embedded because it has a generic argument. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože má obecný argument. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Typ "{0}" kann nicht eingebettet werden, da er ein generisches Argument besitzt. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf "False" fest.
es: El tipo '{0}' no se puede incrustar porque tiene un argumento genérico. Puede establecer la propiedad 'Incrustar tipos de interoperabilidad' en false.
fr: Impossible d'incorporer le type '{0}', car il a un argument générique. Attribuez à la propriété 'Incorporer les types interop' la valeur false.
it: Non è possibile incorporare il tipo '{0}' perché contiene un argomento generico. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' にはジェネリック引数があるため、この型を埋め込むことはできません。'相互運用型の埋め込み' プロパティを false に設定することを検討してください。
ko: '{0}' 형식에 제네릭 인수가 있으므로 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정하세요.
pl: Typ „{0}” nie może być osadzony, ponieważ ma on argument ogólny. Rozważ ustawienie wartości false dla właściwości „Osadź typy międzyoperacyjne”.
pt_br: Tipo "{0}" não pode ser incorporado porque ele tem um argumento genérico. Considere definir a propriedade "Incorporar Tipos de Interoperabilidade" como falso.
ru: Не удается внедрить тип "{0}", так как он имеет универсальный аргумент. Попробуйте задать свойству "Внедрить типы взаимодействия" значение False.
tr: {0}' türünün genel bir bağımsız değişkeni olduğunda bu tür gömülemiyor. 'Embed Interop Types' özelliğini false olarak ayarlayabilirsiniz.
zh_hans: 无法嵌入类型“{0}”，因为它有泛型参数。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 無法內嵌類型 '{0}'，因為它有泛型引數。請考慮將 [內嵌 Interop 類型] 屬性設定為 false。
