Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CLS_NoAbstractMembers_Title
source: Only CLS-compliant members can be abstract
cs: Jenom členy kompatibilní se specifikací CLS můžou být abstraktní.
de: Nur CLS-kompatible Elemente können abstrakt sein
es: Solo los miembros conformes a CLS pueden ser abstractos
fr: Seuls les membres conformes CLS peuvent être abstraits
it: Solo i membri conformi a CLS possono essere di tipo abstract
ja: 抽象化できるのは CLS 準拠メンバーのみです
ko: CLS 규격 멤버만 abstract일 수 있습니다.
pl: Tylko składowe zgodne ze specyfikacją CLS mogą być abstrakcyjne
pt_br: Somente membros em conformidade com CLS podem ser abstratos
ru: Только члены, совместимые с CLS, могут быть абстрактными
tr: Yalnızca CLS uyumlu üyeler soyut olabilir
zh_hans: 只有符合 CLS 的成员才能是抽象的
zh_hant: 只有符合 CLS 規範的成員，才可為抽象

# WRN_CLS_NotOnModules
source: You must specify the CLSCompliant attribute on the assembly, not the module, to enable CLS compliance checking
cs: Pokud chcete povolit kontrolu kompatibility se specifikací CLS, musíte zadat atribut CLSCompliant sestavení, ne modulu.
de: Sie müssen das CLSCompliant-Attribut in der Assembly statt im Modul angeben, um die CLS-Kompatibilitätsprüfung zu aktivieren.
es: Debe especificar el atributo CLSCompliant en el ensamblado, no en el módulo, para habilitar la comprobación de conformidad con CLS
fr: Vous devez spécifier l'attribut CLSCompliant sur l'assembly, non sur le module, pour activer la vérification de la conformité CLS
it: Per abilitare il controllo di conformità a CLS, è necessario specificare l'attributo CLSCompliant nell'assembly, non nel modulo
ja: CLS コンプライアンス チェックのためにモジュールではなく、アセンブリに CLSCompliant 属性を指定してください
ko: CLS 규격 검사를 사용하려면 모듈이 아니라 어셈블리에 CLSCompliant 특성을 지정해야 합니다.
pl: Aby włączyć sprawdzanie zgodności ze specyfikacją CLS, należy określić atrybut CLSCompliant dla zestawu, a nie dla modułu
pt_br: Especifique o atributo CLSCompliant no assembly, não no módulo, para habilitar a verificação de conformidade com CLS
ru: Для включения проверки на соответствие CLS следует назначить сборке, а не модулю, атрибут CLSCompliant.
tr: CLS uyumluluğu denetimini etkinleştirmek için CLSCompliant özniteliğini modülde değil derlemede belirtmelisiniz
zh_hans: 必须在程序集而不是模块上指定 CLSCompliant 特性，以便启用 CLS 遵从性检查
zh_hant: 您必須在組件 (而非模組) 上指定 CLSCompliant 屬性，以啟用 CLS 合規性檢查

# WRN_CLS_NotOnModules_Title
source: You must specify the CLSCompliant attribute on the assembly, not the module, to enable CLS compliance checking
cs: Pokud chcete povolit kontrolu kompatibility se specifikací CLS, musíte zadat atribut CLSCompliant sestavení, ne modulu.
de: Sie müssen das CLSCompliant-Attribut in der Assembly statt im Modul angeben, um die CLS-Kompatibilitätsprüfung zu aktivieren.
es: Debe especificar el atributo CLSCompliant en el ensamblado, no en el módulo, para habilitar la comprobación de conformidad con CLS
fr: Vous devez spécifier l'attribut CLSCompliant sur l'assembly, non sur le module, pour activer la vérification de la conformité CLS
it: Per abilitare il controllo di conformità a CLS, è necessario specificare l'attributo CLSCompliant nell'assembly, non nel modulo
ja: CLS コンプライアンス チェックのためにモジュールではなく、アセンブリに CLSCompliant 属性を指定してください
ko: CLS 규격 검사를 사용하려면 모듈이 아니라 어셈블리에 CLSCompliant 특성을 지정해야 합니다.
pl: Aby włączyć sprawdzanie zgodności ze specyfikacją CLS, należy określić atrybut CLSCompliant dla zestawu, a nie dla modułu
pt_br: Especifique o atributo CLSCompliant no assembly, não no módulo, para habilitar a verificação de conformidade com CLS
ru: Для включения проверки на соответствие CLS следует назначить сборке, а не модулю, атрибут CLSCompliant.
tr: CLS uyumluluğu denetimini etkinleştirmek için CLSCompliant özniteliğini modülde değil derlemede belirtmelisiniz
zh_hans: 必须在程序集而不是模块上指定 CLSCompliant 特性，以便启用 CLS 遵从性检查
zh_hant: 您必須在組件 (而非模組) 上指定 CLSCompliant 屬性，以啟用 CLS 合規性檢查

# WRN_CLS_ModuleMissingCLS
source: Added modules must be marked with the CLSCompliant attribute to match the assembly
cs: Aby přidávané moduly odpovídaly sestavení, musí být označené atributem CLSCompliant.
de: Hinzugefügte Module müssen mit dem CLSCompliant-Attribut markiert werden, damit sie mit der Assembly übereinstimmen.
es: Los módulos agregados se deben marcar con el atributo CLSCompliant para que coincidan con el ensamblado
fr: Les modules ajoutés doivent être marqués avec l'attribut CLSCompliant pour correspondre à l'assembly
it: I moduli aggiunti devono essere contrassegnati con l'attributo CLSCompliant per corrispondere all'assembly
ja: 追加されたモジュールは、アセンブリに一致するように CLSCompliant 属性と共に設定されなければなりません
ko: 추가된 모듈은 어셈블리와 일치하도록 CLSCompliant 특성으로 표시되어야 합니다.
pl: Dodane moduły muszą być oznaczone atrybutem CLSCompliant, aby były zgodne z zestawem
pt_br: Módulos adicionados devem ser marcados com o atributo CLSCompliant para corresponder ao assembly
ru: Добавленные модули должны быть помечены атрибутом CLSCompliant, чтобы соответствовать этой сборке.
tr: Eklenen modüllerin derlemeyle eşleşebilmesi için CLSCompliant özniteliğiyle işaretlenmesi gerekir
zh_hans: 添加的模块必须用 CLSCompliant 特性标记才能与程序集匹配
zh_hant: 新增的模組必須以 CLSCompliant 屬性標記，才能與這個組件相符

# WRN_CLS_ModuleMissingCLS_Title
source: Added modules must be marked with the CLSCompliant attribute to match the assembly
cs: Aby přidávané moduly odpovídaly sestavení, musí být označené atributem CLSCompliant.
de: Hinzugefügte Module müssen mit dem CLSCompliant-Attribut markiert werden, damit sie mit der Assembly übereinstimmen.
es: Los módulos agregados se deben marcar con el atributo CLSCompliant para que coincidan con el ensamblado
fr: Les modules ajoutés doivent être marqués avec l'attribut CLSCompliant pour correspondre à l'assembly
it: I moduli aggiunti devono essere contrassegnati con l'attributo CLSCompliant per corrispondere all'assembly
ja: 追加されたモジュールは、アセンブリに一致するように CLSCompliant 属性と共に設定されなければなりません
ko: 추가된 모듈은 어셈블리와 일치하도록 CLSCompliant 특성으로 표시되어야 합니다.
pl: Dodane moduły muszą być oznaczone atrybutem CLSCompliant, aby były zgodne z zestawem
pt_br: Módulos adicionados devem ser marcados com o atributo CLSCompliant para corresponder ao assembly
ru: Добавленные модули должны быть помечены атрибутом CLSCompliant, чтобы соответствовать этой сборке.
tr: Eklenen modüllerin derlemeyle eşleşebilmesi için CLSCompliant özniteliğiyle işaretlenmesi gerekir
zh_hans: 添加的模块必须用 CLSCompliant 特性标记才能与程序集匹配
zh_hant: 新增的模組必須以 CLSCompliant 屬性標記，才能與這個組件相符

# WRN_CLS_AssemblyNotCLS
source: '{0}' cannot be marked as CLS-compliant because the assembly does not have a CLSCompliant attribute
cs: {0} nejde označit jako kompatibilní se specifikací CLS, protože sestavení nemá atribut CLSCompliant.
de: '"{0}" kann nicht als CLS-kompatibel markiert werden, da die Assembly kein CLSCompliant-Attribut besitzt.
es: '{0}' no se puede marcar como conforme a CLS porque el ensamblado no tiene ningún atributo CLSCompliant
fr: 'Impossible de marquer '{0}' comme conforme CLS, car l'assembly n'a pas d'attribut CLSCompliant
it: '{0}' non può essere contrassegnato come conforme a CLS perché l'assembly non ha un attributo CLSCompliant
ja: 'アセンブリには属性 CLSCompliant がないため、'{0}' をCLS 準拠として設定できません
ko: '어셈블리에 CLSCompliant 특성이 없으므로 '{0}'을(를) CLS 규격으로 표시할 수 없습니다.
pl: 'Elementu „{0}” nie można oznaczyć jako zgodnego ze specyfikacją CLS, ponieważ zestaw nie ma atrybutu CLSCompliant
pt_br: "{0}" não pode ser marcado como em comformidade com CLS porque o assembly não tem um atributo CLSCompliant
ru: "{0}" не может быть помечен как совместимый с CLS, поскольку сборка не имеет атрибута CLSCompliant.
tr: 'Derlemenin CLSCompliant özniteliği olmadığından '{0}' CLS uyumlu olarak işaretlenemiyor
zh_hans: '由于程序集没有 CLSCompliant 特性，因此不能将“{0}”标记为符合 CLS
zh_hant: '因為組件沒有 CLSCompliant 屬性，所以 '{0}' 不可標記為符合 CLS 規範

# WRN_CLS_AssemblyNotCLS_Title
source: Type or member cannot be marked as CLS-compliant because the assembly does not have a CLSCompliant attribute
cs: Typ nebo člen nejde označit jako kompatibilní se specifikací CLS, protože sestavení nemá atribut CLSCompliant.
de: Typ oder Element kann nicht als CLS-kompatibel markiert werden, da die Assembly kein CLSCompliant-Attribut besitzt
es: No se puede marcar al tipo o al miembro como conformes a CLS porque el ensamblador no tiene un atributo CLSCompliant
fr: Vous ne pouvez pas indiquer que le type ou le membre est conforme CLS, car l'assembly n'a pas d'attribut CLSCompliant
it: Il tipo o il membro non può essere contrassegnato come conforme a CLS perché l'assembly non ha un attributo CLSCompliant
ja: アセンブリに CLSCompliant 属性がないため、型またはメンバーは CLS 準拠として設定できません
ko: 어셈블리에 CLSCompliant 특성이 없으므로 형식 또는 멤버를 CLS 규격으로 표시할 수 없습니다.
pl: Nie można oznaczyć typu lub składowej jako zgodnej ze specyfikacją CLS, ponieważ zestaw nie ma atrybutu CLSCompliant
pt_br: O tipo ou membro não pode ser marcado como em comformidade com CLS porque o assembly não possui um atributo CLSCompliant
ru: Тип или член не может быть помечен как совместимый с CLS, так как сборка не содержит атрибут CLSCompliant
tr: Derleme bir CLSCompliant özniteliğine sahip olmadığından tür veya üye CLS uyumlu olarak işaretlenemez
zh_hans: 由于程序集没有 CLSCompliant 特性，因此不能将类型或成员标记为符合 CLS
zh_hant: 因為組件沒有 CLSCompliant 屬性，所以類型或成員不可標記為符合 CLS 規範

# WRN_CLS_BadAttributeType
source: '{0}' has no accessible constructors which use only CLS-compliant types
cs: {0} nemá žádné přístupné konstruktory, které používají jenom typy kompatibilní se specifikací CLS.
de: '"{0}" hat keine zugreifbaren Konstruktoren, die nur CLS-kompatible Typen verwenden.
es: '{0}' no tiene constructores accesibles que usen solo tipos conformes a CLS
fr: '{0}' n'a aucun constructeur accessible qui utilise uniquement des types conformes CLS
it: '{0}' non ha costruttori accessibili che usano solo tipi conformi a CLS
ja: '{0}' は CLS 準拠型のみを使用するコンストラクターにアクセスできません
ko: '{0}'에는 CLS 규격 형식만 사용하는 액세스 가능 생성자가 없습니다.
pl: 'Element „{0}” nie ma dostępnych konstruktorów używających tylko typów zgodnych ze specyfikacją CLS
pt_br: "{0}" não tem construtores acessíveis que usam somente tipos em conformidade com CLS
ru: "{0}" не имеет доступных конструкторов, которые используют совместимые с CLS типы.
tr: '{0}', yalnızca CLS uyumlu türler kullanan hiçbir erişilebilir oluşturucuya sahip değil
zh_hans: “{0}”没有只使用符合 CLS 类型的可访问的构造函数
zh_hant: '{0}' 沒有僅使用符合 CLS 規範之類型的可存取建構函式

# WRN_CLS_BadAttributeType_Title
source: Type has no accessible constructors which use only CLS-compliant types
cs: Typ nemá žádné přístupné konstruktory, které používají jenom typy kompatibilní se specifikací CLS.
de: Typ besitzt keine zugänglichen Konstruktoren, die nur CLS-kompatible Typen verwenden
es: EL tipo no tiene constructores accesibles que solo usen tipos conforme a CLS
fr: Le type n'a pas de constructeur accessible utilisant uniquement des types conformes CLS
it: Il tipo non contiene costruttori accessibili che usano solo tipi conformi a CLS
ja: 型には、CLS 準拠型のみを使用する、アクセス可能なコンストラクターがありません
ko: 형식에는 CLS 규격 형식만 사용하는 액세스 가능 생성자가 없습니다.
pl: Typ nie ma dostępnych konstruktorów używających tylko typów zgodnych ze specyfikacją CLS
pt_br: O tipo não tem nenhum construtor acessível que use somente tipos em conformidade com CLS
ru: Тип не содержит доступных конструкторов, которые используют только совместимые с CLS типы
tr: Tür yalnızca CLS uyumlu türler kullanan hiçbir erişilebilir oluşturucuya sahip değil
zh_hans: 类型没有只使用符合 CLS 类型的可访问的构造函数
zh_hant: 類型沒有僅使用符合 CLS 規範之類型的可存取建構函式

# WRN_CLS_ArrayArgumentToAttribute
source: Arrays as attribute arguments is not CLS-compliant
cs: Pole jako argumenty atributu nejsou kompatibilní se specifikací CLS.
de: Arrays als Attributargumente sind nicht CLS-kompatibel.
es: El uso de matrices como argumentos de atributo no es conforme a CLS
fr: L'utilisation de tableaux en tant qu'arguments d'attributs n'est pas conforme CLS
it: L'utilizzo di matrici come argomenti di attributi non è conforme alle specifiche CLS
ja: 属性の引数としての配列は CLS 準拠ではありません
ko: 특성 인수로 사용된 배열은 CLS 규격이 아닙니다.
pl: Użycie tablic jako argumentów atrybutów jest niezgodne ze specyfikacją CLS
pt_br: Matrizes como argumentos de atributo não tem conformidade com CLS
ru: Использование массивов как аргументов атрибутов в CLS не разрешено
tr: Öznitelik bağımsız değişkenleri olarak kullanılan diziler CLS uyumlu değildir
zh_hans: 作为特性参数的数组不符合 CLS
zh_hant: 以陣列做為屬性引數不符合 CLS 規範

# WRN_CLS_ArrayArgumentToAttribute_Title
source: Arrays as attribute arguments is not CLS-compliant
cs: Pole jako argumenty atributu nejsou kompatibilní se specifikací CLS.
de: Arrays als Attributargumente sind nicht CLS-kompatibel.
es: El uso de matrices como argumentos de atributo no es conforme a CLS
fr: L'utilisation de tableaux en tant qu'arguments d'attributs n'est pas conforme CLS
it: L'utilizzo di matrici come argomenti di attributi non è conforme alle specifiche CLS
ja: 属性の引数としての配列は CLS 準拠ではありません
ko: 특성 인수로 사용된 배열은 CLS 규격이 아닙니다.
pl: Użycie tablic jako argumentów atrybutów jest niezgodne ze specyfikacją CLS
pt_br: Matrizes como argumentos de atributo não tem conformidade com CLS
ru: Использование массивов как аргументов атрибутов в CLS не разрешено
tr: Öznitelik bağımsız değişkenleri olarak kullanılan diziler CLS uyumlu değildir
zh_hans: 作为特性参数的数组不符合 CLS
zh_hant: 以陣列做為屬性引數不符合 CLS 規範

# WRN_CLS_NotOnModules2
source: You cannot specify the CLSCompliant attribute on a module that differs from the CLSCompliant attribute on the assembly
cs: Nejde zadat atribut CLSCompliant u modulu, který se liší od atributu CLSCompliant sestavení.
de: Das CLSCompliant-Attribut kann nicht für ein Modul angegeben werden, das sich vom CLSCompliant-Attribut der Assembly unterscheidet.
es: No se puede especificar el atributo CLSCompliant en un módulo que sea distinto del atributo CLSCompliant del ensamblado
fr: Vous ne pouvez pas spécifier l'attribut CLSCompliant sur un module qui diffère de l'attribut CLSCompliant de l'assembly
it: Impossibile specificare l'attributo CLSCompliant su un modulo che differisce dall'attributo CLSCompliant sull'assembly
ja: アセンブリの CLSCompliant 属性と異なるモジュールの CLSCompliant 属性は指定できません
ko: 어셈블리의 CLSCompliant 특성과 다른 모듈의 CLSCompliant 특성을 지정할 수 없습니다.
pl: Nie można określić atrybutu CLSCompliant w module, który różni się od atrybutu CLSCompliant w zestawie
pt_br: Você não pode especificar o atributo CLSCompliant em um módulo diferente do atributo CLSCompliant no assembly
ru: Невозможно задать аргумент CLSCompliant в модуле, который отличается от атрибута CLSCompliant в сборке.
tr: Derlemedeki CLSCompliant özniteliğinden farklı olan bir modülde CLSCompliant özniteliğini belirtemezsiniz
zh_hans: 不能在模块上指定与程序集的 CLSCompliant 特性不同的 CLSCompliant 特性
zh_hant: 在模組上指定的 CLSCompliant 屬性不能與組件上的 CLSCompliant 屬性不同

# WRN_CLS_NotOnModules2_Title
source: You cannot specify the CLSCompliant attribute on a module that differs from the CLSCompliant attribute on the assembly
cs: Nejde zadat atribut CLSCompliant u modulu, který se liší od atributu CLSCompliant sestavení.
de: Das CLSCompliant-Attribut kann nicht für ein Modul angegeben werden, das sich vom CLSCompliant-Attribut der Assembly unterscheidet.
es: No se puede especificar el atributo CLSCompliant en un módulo que sea distinto del atributo CLSCompliant del ensamblado
fr: Vous ne pouvez pas spécifier l'attribut CLSCompliant sur un module qui diffère de l'attribut CLSCompliant de l'assembly
it: Impossibile specificare l'attributo CLSCompliant su un modulo che differisce dall'attributo CLSCompliant sull'assembly
ja: アセンブリの CLSCompliant 属性と異なるモジュールの CLSCompliant 属性は指定できません
ko: 어셈블리의 CLSCompliant 특성과 다른 모듈의 CLSCompliant 특성을 지정할 수 없습니다.
pl: Nie można określić atrybutu CLSCompliant w module, który różni się od atrybutu CLSCompliant w zestawie
pt_br: Você não pode especificar o atributo CLSCompliant em um módulo diferente do atributo CLSCompliant no assembly
ru: Невозможно задать аргумент CLSCompliant в модуле, который отличается от атрибута CLSCompliant в сборке.
tr: Derlemedeki CLSCompliant özniteliğinden farklı olan bir modülde CLSCompliant özniteliğini belirtemezsiniz
zh_hans: 不能在模块上指定与程序集的 CLSCompliant 特性不同的 CLSCompliant 特性
zh_hant: 在模組上指定的 CLSCompliant 屬性不能與組件上的 CLSCompliant 屬性不同

# WRN_CLS_IllegalTrueInFalse
source: '{0}' cannot be marked as CLS-compliant because it is a member of non-CLS-compliant type '{1}'
cs: {0} nejde označit jako kompatibilní se specifikací CLS, protože se jedná o člen typu {1}, který není kompatibilní se specifikací CLS.
de: '"{0}" ist ein Member des nicht CLS-kompatiblen Typs "{1}" und kann daher nicht als CLS-kompatibel markiert werden.
es: '{0}' no se puede marcar como conforme a CLS porque es miembro del tipo '{1}' no conforme a CLS
fr: 'Impossible de marquer '{0}' comme conforme CLS, car il s'agit d'un membre de type '{1}' non conforme CLS
it: 'Non è possibile contrassegnare '{0}' come conforme a CLS perché è un membro del tipo non conforme a CLS '{1}'
ja: '{0}' は CLS に準拠していない型 '{1}' のメンバーであるため、CLS 準拠として設定できません
ko: '{0}'은(는) CLS 규격이 아닌 '{1}' 형식의 멤버이므로 CLS 규격으로 표시할 수 없습니다.
pl: 'Elementu „{0}” nie można oznaczyć jako zgodnego ze specyfikacją CLS, ponieważ jest to składowa typu „{1}” niezgodnego ze specyfikacją CLS
pt_br: "{0}" não pode ser marcado como em conformidade com CLS porque é membro do tipo não tem conformidade com CLS "{1}"
ru: "{0}" не может быть помечен как совместимый с CLS, поскольку является членом типа "{1}", несовместимого с CLS.
tr: 'CLS uyumsuz '{1}' türünün üyesi olduğundan '{0}' CLS uyumlu olarak işaretlenemez
zh_hans: “{0}”是不符合 CLS 的类型“{1}”的成员，因此不能将其标记为符合 CLS
zh_hant: '因為 '{0}' 是不符合 CLS 規範之類型 '{1}' 的成員，所以不可標記為符合 CLS 規範

# WRN_CLS_IllegalTrueInFalse_Title
source: Type cannot be marked as CLS-compliant because it is a member of non-CLS-compliant type
cs: Typ nejde označit jako kompatibilní se specifikací CLS, protože se jedná o člen typu, který není kompatibilní se specifikací CLS.
de: Typ kann nicht als CLS-kompatibel, da es ein Element des Typs nicht CLS-kompatibel ist
es: No se puede marcar al tipo como conforme a CLS porque es miembro de un tipo no conforme a CLS
fr: Impossible d'indiquer que ce type est conforme CLS, car il est membre d'un type non conforme CLS
it: Non è possibile contrassegnare il tipo come conforme a CLS perché è un membro del tipo non conforme a CLS
ja: 型は CLS に準拠していない型のメンバーになっているため、CLS 準拠として設定できません
ko: 형식은 CLS 규격이 아닌 형식의 멤버이므로 CLS 규격으로 표시할 수 없습니다.
pl: Nie można oznaczyć typu jako zgodnego ze specyfikacją CLS, ponieważ jest to składowa typu niezgodnego ze specyfikacją CLS
pt_br: O tipo não pode ser marcado como em conformidade com CLS por ser membro de um tipo sem conformidade com CLS
ru: Тип невозможно пометить как совместимый с CLS, так как он является членом несовместимого с CLS типа
tr: CLS uyumlu olmayan türün üyesi olduğundan, tür CLS uyumlu olarak işaretlenemez
zh_hans: 类型是不符合 CLS 的类型的成员，因此不能将其标记为符合 CLS
zh_hant: 因為類型是不符合 CLS 規範之類型的成員，所以不可標記為符合 CLS 規範

# WRN_CLS_MeaninglessOnPrivateType
source: CLS compliance checking will not be performed on '{0}' because it is not visible from outside this assembly
cs: Pro prvek {0} se neprovede kontrola kompatibility se specifikací CLS, protože není viditelný mimo toto sestavení.
de: Die CLS-Kompatibilitätsprüfung wird nicht für "{0}" ausgeführt (ist außerhalb der Assembly nicht sichtbar).
es: La comprobación de conformidad con CLS no se realizará en '{0}' porque no es visible desde fuera de este ensamblado
fr: La vérification de conformité CLS ne sera pas effectuée sur '{0}', car il n'est pas visible hors de cet assembly
it: Il controllo di conformità a CLS non verrà eseguito in '{0}' perché non è visibile all'esterno dell'assembly
ja: '{0}' はこのアセンブリの外から認識できないため、CLS 準拠の確認は実行されません
ko: {0}'은(는) 이 어셈블리 외부에 노출되지 않으므로 CLS 규격 검사를 수행하지 않습니다.
pl: Sprawdzanie zgodności ze specyfikacja CLS nie zostanie wykonane dla elementu „{0}”, ponieważ nie jest on widoczny spoza tego zestawu
pt_br: Verificação de compatibilidade com CLS não será executada em "{0}" porque ele não é visível de fora deste assembly
ru: Проверка на соответствие CLS не будет выполнена для "{0}", поскольку он не видим за пределами данной сборки.
tr: Bu derleme dışından görülemediğinden, CLS uyumluluk denetimi '{0}' üzerinde gerçekleştirilemez
zh_hans: “{0}”在此程序集外部不可见，因此不会对它执行 CLS 遵从性检查
zh_hant: 將不會在 '{0}' 上執行 CLS 合規性檢查，因為從此組件之外無法看到它

# WRN_CLS_MeaninglessOnPrivateType_Title
source: CLS compliance checking will not be performed because it is not visible from outside this assembly
cs: Kontrola kompatibility se specifikací CLS se neprovede, protože není viditelná zvnějšku tohoto sestavení.
de: Die CLS-Kompatibilitätsüberprüfung wird nicht ausgeführt, da sie von außerhalb dieser Assembly nicht sichtbar ist
es: No se puede realizar la comprobación de conformidad a CLS porque no es visible fuera de este ensamblador
fr: La vérification de conformité CLS ne sera pas effectuée, car l'objet inspecté n'est pas visible hors de cet assembly
it: Il controllo di conformità a CLS non verrà eseguito perché non è visibile all'esterno dell'assembly
ja: CLS 準拠の確認は、このアセンブリの外から認識できないため実行されません
ko: 이 어셈블리 외부에 노출되지 않으므로 CLS 규격 검사를 수행하지 않습니다.
pl: Sprawdzanie zgodności ze specyfikacja CLS nie zostanie wykonane, ponieważ nie jest on widoczny spoza tego zestawu
pt_br: A verificação de compatibilidade com CLS não será executada porque ela não é vista de fora deste assembly
ru: Проверка совместимости с CLS не будет выполнена, так как она не видима за пределами этой сборки
tr: Bu derlemenin dışından görülemediğinden CLS uyumluluk denetimi gerçekleştirilmeyecek
zh_hans: CLS 遵从性检查在此程序集外部不可见，因此不会执行它
zh_hant: 將不會執行 CLS 合規性檢查，因為這個組件不是外部可見的

# WRN_CLS_AssemblyNotCLS2
source: '{0}' does not need a CLSCompliant attribute because the assembly does not have a CLSCompliant attribute
cs: {0} nepotřebuje atribut CLSCompliant, protože sestavení nemá atribut CLSCompliant.
de: '"{0}" erfordert kein CLSCompliant-Attribut, da die Assembly kein CLSCompliant-Attribut aufweist.
es: '{0}' no necesita ningún atributo CLSCompliant porque el ensamblado no tiene ningún atributo CLSCompliant
fr: '{0}' n'a pas besoin d'attribut CLSCompliant, car l'assembly n'en a pas
it: '{0}' non necessita di un attributo CLSCompliant perché l'assembly non ha un attributo CLSCompliant
ja: 'アセンブリには属性 CLSCompliant がないため、'{0}' に属性 CLSCompliant は不要です
ko: '어셈블리에 CLSCompliant 특성이 없으므로 '{0}'에 CLSCompliant 특성이 필요하지 않습니다.
pl: 'Element „{0}” nie wymaga atrybutu CLSCompliant, ponieważ zestaw nie ma atrybutu CLSCompliant
pt_br: "{0}" não necessista de um atributo CLSCompliant porque o assembly não tem um atributo CLSCompliant
ru: "{0}" не требуется атрибут CLSCompliant, так как сборка не имеет атрибута CLSCompliant.
tr: 'Derlemenin CLSCompliant özniteliği olmadığından '{0}' için CLSCompliant özniteliği gerekmiyor
zh_hans: '由于程序集没有 CLSCompliant 特性，因此“{0}”不需要 CLSCompliant 特性
zh_hant: '{0}' 不需要 CLSCompliant 屬性，因為組件並沒有 CLSCompliant 屬性
