Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CollectionExpressionRefStructSpreadMayAllocate
source: Collection expression of type '{0}' may incur unexpected heap allocations due to the use of '..' spreads. Consider explicitly creating an array, then converting to '{0}' to make the allocation explicit.
fr: L’expression de collection de type « {0} » peut entraîner des allocations de segment de mémoire inattendues en raison de l’utilisation de spreads « .. ». Envisagez de créer explicitement un tableau, puis convertissez-le en « {0} » pour rendre l’allocation explicite.
it: L'espressione di raccolta di tipo '{0}' può comportare allocazioni di heap impreviste a causa dell'uso di spread '..'. Provare a creare in modo esplicito una matrice, quindi a convertirla in '{0}' per rendere esplicita l'allocazione.
ja: 型 '{0}' のコレクション式では、'..' 拡散が使用されているため、予期しないヒープ割り当てが発生する可能性があります。配列を明示的に作成してから、'{0}' に変換して割り当てを明示的にすることを検討してください。
pl: Wyrażenie kolekcji typu „{0}” może spowodować nieoczekiwane alokacje sterty z powodu użycia „.”. Rozważ jawne utworzenie tablicy, a następnie przekonwertowanie na „{0}”, aby jawnie utworzyć alokację.
pt_br: A expressão de coleção do tipo '{0}' pode incorrer em alocações de heap inesperadas devido ao uso de spreads '..'. Considere a possibilidade de criar explicitamente uma matriz e, em seguida, converter para '{0}' para tornar a alocação explícita.
ru: Выражение коллекции типа "{0}" может привести к непредвиденным выделениям кучи из-за использования расширений "..". Рассмотрите возможность явного создания массива, а затем преобразования в "{0}", чтобы сделать выделение явным.
zh_hans: 类型为“{0}”的集合表达式可能会由于使用 “..” 展开而产生意外的堆分配。请考虑显式创建数组，然后转换为“{0}”以显式分配。
zh_hant: 類型 '{0}' 的集合運算式可能會因使用了 '..' 擴張而產生未預期的堆積配置。請考慮明確地建立陣列，然後轉換為 '{0}' 以使配置明確化。

# WRN_CollectionExpressionRefStructSpreadMayAllocate_Title
source: Collection expression may incur unexpected heap allocations due to use of '..' spreads. Consider explicitly creating an array, then converting to the final type to make the allocation explicit.
fr: L’expression de collection peut entraîner des allocations de segment de mémoire inattendues en raison d’une utilisation de spreads « .. ». Envisagez de créer explicitement un tableau, puis convertissez-le en type final pour rendre l’allocation explicite.
it: L'espressione di raccolta può comportare allocazioni di heap impreviste a causa dell'uso di spread '..'. Provare a creare in modo esplicito una matrice, quindi a convertirla nel tipo finale per rendere esplicita l'allocazione.
ja: '..' 拡散が使用されているため、コレクション式で予期しないヒープ割り当てが発生する可能性があります。配列を明示的に作成してから、最後の型に変換して割り当てを明示的にすることを検討してください。
pl: Wyrażenie kolekcji może spowodować nieoczekiwane alokacje sterty z powodu użycia spreadów „.”. Rozważ jawne utworzenie tablicy, a następnie przekonwertowanie na typ końcowy, aby jawnie utworzyć alokację.
pt_br: A expressão Collection pode incorrer em alocações inesperadas de heap devido ao uso de spreads '..'. Considere a possibilidade de criar explicitamente uma matriz e, em seguida, converter para o tipo final para tornar a alocação explícita.
ru: Выражение коллекции может привести к непредвиденным выделениям кучи из-за использования расширений "..". Рассмотрите возможность явного создания массива, а затем преобразования в конечный тип, чтобы сделать выделение явным.
zh_hans: 集合表达式可能会由于使用 “..” 展开而产生意外的堆分配。请考虑显式创建数组，然后转换为最终类型以显式分配。
zh_hant: 集合運算式可能會因使用了 '..' 擴張而產生未預期的堆積配置。請考慮明確地建立陣列，然後轉換為最後類型以使配置明確化。

# WRN_CompileTimeCheckedOverflow
source: The operation may overflow '{0}' at runtime (use 'unchecked' syntax to override)
cs: Operace může při běhu přetéct {0} (pro přepis použijte syntaxi unchecked)
fr: L'opération peut dépasser {0}' au moment de l'exécution (utilisez la syntaxe 'unchecked' pour passer outre).
it: Con l’operazione può verificarsi un overflow '{0} 'in fase di esecuzione. Usare la sintassi 'unchecked' per eseguire l'override
ja: 実行時に操作がオーバーフロー '{0}' する可能性があります (オーバーライドするには 'unchecked' 構文を使用してください)
pl: Operacja może się przepełnić w środowisku uruchomieniowym „{0}” (użyj składni „niezaznaczone”, aby zastąpić)
pt_br: A operação pode estourar '{0}' em tempo de execução (use a sintaxe 'não verificada' para substituir)
ru: Операция может привести к переполнению "{0}" в среде выполнения (для переопределения используйте синтаксис "unchecked")
zh_hans: 操作可能在运行时溢出“{0}”(请使用“unchecked”语法替代)
zh_hant: 作業在執行階段可能會溢位 '{0}' (請使用 'unchecked' 語法覆寫)

# WRN_CompileTimeCheckedOverflow_Title
source: The operation may overflow at runtime (use 'unchecked' syntax to override)
cs: Operace může při běhu přetéct (pro přepis použijte syntaxi unchecked)
fr: L'opération peut déborder au moment de l'exécution (utilisez la syntaxe 'unchecked' pour passer outre).
it: Con l’operazione può verificarsi un overflow in fase di esecuzione. Usare la sintassi 'unchecked' per eseguire l'override
ja: 実行時に操作がオーバーフローする可能性があります (オーバーライドするには 'unchecked' 構文を使用してください)
pl: Operacja może się przepełnić w środowisku uruchomieniowym (użyj składni „niezaznaczone”, aby zastąpić)
pt_br: A operação pode estourar em tempo de execução (use a sintaxe 'não verificada' para substituir)
ru: Операция может привести к переполнению в среде выполнения (для переопределения используйте синтаксис "unchecked")
zh_hans: 操作可能在运行时溢出(请使用“unchecked”语法替代)
zh_hant: 作業在執行階段可能會溢位 (請使用 'unchecked' 語法覆寫)

# WRN_ConvertingLock
source: A value of type 'System.Threading.Lock' converted to a different type will use likely unintended monitor-based locking in 'lock' statement.
fr: Une valeur de type « System.Threading.Lock » convertie en un autre type va probablement utiliser un verrouillage inattendu basé sur un moniteur dans l’instruction « lock ».
it: Un valore di tipo 'System.Threading.Lock' convertito in un tipo diverso userà probabilmente un blocco basato su monitoraggio non intenzionale nell'istruzione 'lock'.
pl: Wartość typu „System.Threading.Lock” przekonwertowana na inny typ użyje prawdopodobnie niezamierzonego blokowania opartego na monitorze w instrukcji „zablokuj”.
pt_br: Um valor do tipo "System.Threading.Lock" convertido em um tipo diferente usará o bloqueio baseado em monitor provavelmente não intencional na instrução "lock".
ru: Значение типа "System.Threading.Lock", преобразованное в другой тип, будет использовать (скорее всего, непреднамеренную) блокировку на основе монитора в инструкции "lock".
zh_hans: 转换为不同类型的类型“System.Threading.Lock”的值将在“lock”语句中使用可能意外的基于监视器的锁定。
zh_hant: 型別 'System.Threading.Lock' 轉換為不同型別的值，在 'lock' 陳述式中可能會使用非預期的監視器型鎖定。

# WRN_ConvertingLock_Title
source: A value of type 'System.Threading.Lock' converted to a different type will use likely unintended monitor-based locking in 'lock' statement.
fr: Une valeur de type « System.Threading.Lock » convertie en un autre type va probablement utiliser un verrouillage inattendu basé sur un moniteur dans l’instruction « lock ».
it: Un valore di tipo 'System.Threading.Lock' convertito in un tipo diverso userà probabilmente un blocco basato su monitoraggio non intenzionale nell'istruzione 'lock'.
pl: Wartość typu „System.Threading.Lock” przekonwertowana na inny typ użyje prawdopodobnie niezamierzonego blokowania opartego na monitorze w instrukcji „zablokuj”.
pt_br: Um valor do tipo "System.Threading.Lock" convertido em um tipo diferente usará o bloqueio baseado em monitor provavelmente não intencional na instrução "lock".
ru: Значение типа "System.Threading.Lock", преобразованное в другой тип, будет использовать (скорее всего, непреднамеренную) блокировку на основе монитора в инструкции "lock".
zh_hans: 转换为不同类型的类型“System.Threading.Lock”的值将在“lock”语句中使用可能意外的基于监视器的锁定。
zh_hant: 型別 'System.Threading.Lock' 轉換為不同型別的值，在 'lock' 陳述式中可能會使用非預期的監視器型鎖定。

# WRN_DoNotCompareFunctionPointers
source: Comparison of function pointers might yield an unexpected result, since pointers to the same function may be distinct.
cs: Porovnání ukazatelů funkcí může přinést neočekávaný výsledek, protože ukazatele na stejnou funkci můžou být rozdílné.
fr: La comparaison des pointeurs de fonction peut donner un résultat inattendu, car les pointeurs vers la même fonction peuvent être distincts.
it: Il confronto dei puntatori a funzione potrebbe produrre un risultato imprevisto perché i puntatori alla stessa funzione possono essere distinti.
ja: 同じ関数へのポインターがそれぞれ異なっている可能性があるため、関数ポインターの比較によって予期しない結果が生成されるおそれがあります。
pl: Porównanie wskaźników funkcji może zwrócić nieoczekiwany wynik, ponieważ wskaźniki do tej samej funkcji mogą być różne.
pt_br: A comparação de ponteiros de função pode gerar um resultado inesperado, pois os ponteiros para a mesma função podem ser diferentes.
ru: Сравнение указателей на функции может привести к непредвиденному результату, так как указатели на одну и ту же функцию могут быть разными.
zh_hans: 函数指针比较可能产生意外的结果，因为指向同一函数的指针可能是不同的。
zh_hant: 因為同一個函式的指標可能截然不同，所以比較函式指標可能會產生非預期的結果。

# WRN_DoNotCompareFunctionPointers_Title
source: Do not compare function pointer values
cs: Neporovnávat hodnoty ukazatelů funkcí
fr: Ne pas comparer les valeurs des pointeurs de fonction
it: Non confrontare valori del puntatore a funzione
ja: 関数ポインター値を比較しない
pl: Nie porównuj wartości wskaźników funkcji
pt_br: Não comparar valores de ponteiro de função
ru: Не сравнивайте значения указателей на функции
zh_hans: 不比较函数指针值
zh_hant: 不要比較函式指標值

# WRN_DuplicateAnalyzerReference
source: Analyzer reference '{0}' specified multiple times
cs: Odkaz analyzátoru {0} byl zadán vícekrát
fr: Référence de l’analyseur '{0}' spécifiée plusieurs fois
it: Il riferimento '{0}' dell'analizzatore è stato specificato più volte
ja: 複数回指定されたアナライザー参照 '{0}'
pl: Odwołanie analizatora „{0}” określono wiele razy
pt_br: Referência do analisador '{0}' especificada várias vezes
ru: Ссылка анализатора "{0}" указана несколько раз
zh_hans: 已多次指定分析器引用“{0}”
zh_hant: 已指定多次分析器參考 '{0}'

# WRN_DuplicateAnalyzerReference_Title
source: Analyzer reference specified multiple times
cs: Odkaz analyzátoru byl zadán vícekrát
fr: Référence de l’analyseur spécifiée plusieurs fois
it: Riferimento analizzatore specificato più volte
ja: 複数回指定されたアナライザー参照
pl: Odwołanie do analizatora określono wiele razy
pt_br: Referência do analisador especificada várias vezes
ru: Ссылка на анализатор указана несколько раз
zh_hans: 已多次指定分析器引用
zh_hant: 已指定多次分析器參考

# WRN_EscapeStackAlloc
source: A result of a stackalloc expression of type '{0}' in this context may be exposed outside of the containing method
cs: Výsledek výrazu stackalloc typu {0} v tomto kontextu může být vystaven mimo obsahující metodu
fr: Un résultat d'une expression stackalloc de type '{0}' dans ce contexte peut être exposé en dehors de la méthode conteneur
it: Un risultato di un'espressione stackalloc di tipo '{0}' in questo contesto può essere esposto all'esterno del metodo contenitore
ja: このコンテキストにおけるこの種類 '{0}' の stackalloc 式の結果は、それを含んでいるメソッドの外部に公開される可能性があります
pl: Nie można używać wyniku wyrażenia stackalloc typu „{0}” w tym kontekście, ponieważ może zostać ujawniony poza metodą zawierającą
pt_br: Um resultado de uma expressão stackalloc do tipo '{0}' nesse contexto pode ser exposto fora do método que o contém
ru: Результат выражения stackalloc типа "{0}" в этом контексте может быть представлен за пределами содержащего его метода.
zh_hans: 此上下文中类型“{0}”的 stackalloc 表达式的结果可能会在包含方法以外公开
zh_hant: 此內容中類型 '{0}' 的 stackalloc 運算式結果可能會公開在包含方法之外

# WRN_EscapeStackAlloc_Title
source: A result of a stackalloc expression of this type in this context may be exposed outside of the containing method
cs: Výsledek výrazu stackalloc tohoto typu v tomto kontextu může být vystaven mimo obsahující metodu
fr: Un résultat d'une expression stackalloc de ce type dans ce contexte peut être exposé en dehors de la méthode conteneur
it: Un risultato di un'espressione stackalloc di questo tipo in questo contesto può essere esposto all'esterno del metodo contenitore
ja: このコンテキストにおけるこの種類の stackalloc 式の結果は、それを含んでいるメソッドの外部に公開される可能性があります
pl: Wynik wyrażenia stackalloc tego typu w tym kontekście może być uwidoczniony poza metodą zawierającą
pt_br: Um resultado de uma expressão stackalloc desse tipo neste contexto pode ser exposto fora do método que o contém
ru: Результат выражения stackalloc этого типа в этом контексте может быть представлен за пределами содержащего его метода.
zh_hans: 此上下文中此类型 stackalloc 表达式的结果可能会在包含方法之外公开
zh_hant: 此內容中此類型的 stackalloc 運算式結果可能會公開在包含方法之外

# WRN_EscapeVariable
source: Use of variable '{0}' in this context may expose referenced variables outside of their declaration scope
cs: Použití proměnné {0} v tomto kontextu může vystavit odkazované proměnné mimo rozsah jejich oboru.
fr: Utiliser la variable '{0}' dans ce contexte peut exposer des variables de référence en dehors de leur étendue de déclaration
it: L'uso della variabile '{0}' in questo contesto può esporre le variabili a cui si fa riferimento all'esterno del relativo ambito di dichiarazione
ja: このコンテキストでの変数 '{0}' の使用は、参照される変数が宣言のスコープ外に公開される可能性があります
pl: Nie można używać zmiennej „{0}” w tym kontekście, ponieważ może uwidaczniać odwoływane zmienne poza ich zakresem deklaracji
pt_br: O uso da variável '{0}' nesse contexto pode expor variáveis referenciadas fora de seu escopo de declaração
ru: Использование переменной "{0}" в этом контексте может выставить ссылочные переменные за пределы области их объявления.
zh_hans: 在此上下文中使用变量“{0}”可能会在变量声明范围以外公开所引用的变量
zh_hant: 在此內容中使用變數 '{0}'，可能會將參考的變數公開在其宣告範圍外

# WRN_EscapeVariable_Title
source: Use of variable in this context may expose referenced variables outside of their declaration scope
cs: Použití proměnné v tomto kontextu může vystavit odkazované proměnné mimo rozsah jejich oboru.
fr: Utiliser la variable dans ce contexte peut exposer des variables de référence en dehors de leur étendue de déclaration
it: L'uso di variabili in questo contesto potrebbe esporre le variabili a cui si fa riferimento al di fuori dell'ambito della dichiarazione
ja: このコンテキストでの変数の使用は、参照される変数が宣言のスコープ外に公開される可能性があります
pl: Nie można używać zmiennej w tym kontekście, ponieważ może uwidaczniać odwoływane zmienne poza ich zakresem deklaracji
pt_br: O uso de variável neste contexto pode expor variáveis referenciadas fora de seu escopo de declaração
ru: Использование переменной в этом контексте может представить ссылочные переменные за пределами области их объявления.
zh_hans: 在此上下文中使用变量可能会在变量声明范围以外公开所引用的变量
zh_hant: 在此內容中使用變數，可能會將參考的變數公開在其宣告範圍外

# WRN_ExperimentalWithMessage
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates: '{1}'. Suppress this diagnostic to proceed.
fr: « {0} » est utilisé à des fins d’évaluation uniquement et est susceptible d’être modifié ou supprimé dans les futures mises à jour : « {1} ». Supprimez ce diagnostic pour continuer.
it: "{0}" viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri: "{1}". Eliminare questa diagnostica per continuare.
pt_br: '{0}' é apenas para fins de avaliação e está sujeito a alterações ou remoção em futuras atualizações: '{1}'. Suprima este diagnóstico para continuar.
ru: "{0}" предназначен только для оценки и может быть изменен или удален в будущих обновлениях: "{1}". Чтобы продолжить, скройте эту диагностику.
zh_hans: “{0}”仅用于评估，在将来的更新中可能会被更改或删除：“{1}”。取消此诊断以继续。

# WRN_ExperimentalWithMessage_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates. Suppress this diagnostic to proceed.
fr: Le type est utilisé à des fins d’évaluation uniquement et est susceptible d’être modifié ou supprimé dans les futures mises à jour. Supprimez ce diagnostic pour continuer.
it: Type viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri. Elimina questa diagnostica per continuare.
pt_br: O tipo é apenas para fins de avaliação e está sujeito a alterações ou remoção em atualizações futuras. Suprima este diagnóstico para continuar.
ru: Тип предназначен только для оценки и может быть изменен или удален в будущих обновлениях. Чтобы продолжить, скройте эту диагностику.
zh_hans: 类型仅用于评估，在将来的更新中可能会被更改或删除。取消此诊断以继续。

# WRN_FieldIsAmbiguous
source: In language version {0}, the 'field' keyword binds to a synthesized backing field for the property. To avoid generating a synthesized backing field, and to refer to the existing member, use 'this.field' or '@field' instead.
fr: Dans la version linguistique {0}, le mot-clé « field » se lie à un champ de support synthétisé pour la propriété. Pour éviter de générer un champ de support synthétisé et pour faire référence au membre existant, utilisez plutôt « this.field » ou « @field ».
it: Nella versione del linguaggio {0}, la parola chiave 'field' è associata a un campo di supporto sintetizzato per la proprietà. Per evitare di generare un campo di supporto sintetizzato e fare riferimento al membro esistente, utilizzare 'this.field' o '@field'.
pt_br: Na versão da linguagem {0}, a palavra-chave ''field'' é associada a um campo de suporte sintetizado para a propriedade. Para evitar a geração de um campo de suporte sintetizado e para se referir ao membro existente, use 'this.field' ou '@field'.
ru: В версии языка {0} ключевое слово "field" привязывается к синтезированному резервному полю для свойства. Чтобы не создавать синтезированное резервное поле и ссылаться на существующий элемент, используйте вместо этого "this.field" или "@field".
zh_hans: 在语言版本 {0} 中，‘field’ 关键字绑定到属性的合成后备字段。要避免生成合成后备字段并引用现有成员，请改用 ‘this.field’ 或 ‘@field’。

# WRN_FieldIsAmbiguous_Title
source: The 'field' keyword binds to a synthesized backing field for the property.
fr: Le mot-clé « field » se lie à un champ de support synthétisé pour la propriété.
it: La parola chiave 'field' è associata a un campo di supporto sintetizzato per la proprietà.
pt_br: A palavra-chave ''field'' é associada a um campo de suporte sintetizado para a propriedade.
ru: Ключевое слово "field" привязывается к синтезированному резервному полю для свойства.
zh_hans: “字段”关键字绑定到属性的合成后备字段。

# WRN_InlineArrayConversionOperatorNotUsed
source: Inline array conversion operator will not be used for conversion from expression of the declaring type.
fr: L’opérateur de conversion de tableau inlined ne sera pas utilisé pour la conversion à partir de l’expression du type déclarant.
it: L'operatore di conversione della matrice inline non verrà usato per la conversione dell’espressione del tipo dichiarante.
ja: インライン配列変換演算子は、宣言する型の式からの変換には使用されません。
pl: Operator konwersji tablicy wbudowanej nie będzie używany do konwersji z wyrażenia typu deklarującego.
pt_br: O operador de conversão de matriz em linha não será usado para a conversão da expressão do tipo declarativo.
ru: Оператор преобразования встроенного массива не будет использоваться для преобразования из выражения объявляющего типа.
zh_hans: 内联数组转换运算符将不会用于从声明类型的表达式进行转换。
zh_hant: 內嵌陣列轉換運算子不會用於從宣告類型的運算式進行轉換。

# WRN_InlineArrayConversionOperatorNotUsed_Title
source: Inline array conversion operator will not be used for conversion from expression of the declaring type.
fr: L’opérateur de conversion de tableau inlined ne sera pas utilisé pour la conversion à partir de l’expression du type déclarant.
it: L'operatore di conversione della matrice inline non verrà usato per la conversione dell’espressione del tipo dichiarante.
ja: インライン配列変換演算子は、宣言する型の式からの変換には使用されません。
pl: Operator konwersji tablicy wbudowanej nie będzie używany do konwersji z wyrażenia typu deklarującego.
pt_br: O operador de conversão de matriz em linha não será usado para a conversão da expressão do tipo declarativo.
ru: Оператор преобразования встроенного массива не будет использоваться для преобразования из выражения объявляющего типа.
zh_hans: 内联数组转换运算符将不会用于从声明类型的表达式进行转换。
zh_hant: 內嵌陣列轉換運算子不會用於從宣告類型的運算式進行轉換。

# WRN_InlineArrayIndexerNotUsed
source: Inline array indexer will not be used for element access expression.
fr: L’indexeur du tableau inlined ne sera pas utilisée pour l’expression d’accès à l’élément.
it: L'indicizzatore di matrice inline non verrà usato per l'espressione di accesso agli elementi.
ja: インライン配列インデクサーは要素アクセス式には使用されません。
pl: Indeksator tablicy wbudowanej nie będzie używany na potrzeby wyrażenia dostępu do elementów.
pt_br: O indexador de matriz em linha não será usado para a expressão de acesso ao elemento.
ru: Индексатор встроенного массива не будет использоваться для выражения доступа к элементу.
zh_hans: 内联数组索引器将不会用于元素访问表达式。
zh_hant: 內嵌陣列索引子不會用於元素存取運算式。

# WRN_InlineArrayIndexerNotUsed_Title
source: Inline array indexer will not be used for element access expression.
fr: L’indexeur du tableau inlined ne sera pas utilisée pour l’expression d’accès à l’élément.
it: L'indicizzatore di matrice inline non verrà usato per l'espressione di accesso agli elementi.
ja: インライン配列インデクサーは要素アクセス式には使用されません。
pl: Indeksator tablicy wbudowanej nie będzie używany na potrzeby wyrażenia dostępu do elementów.
pt_br: O indexador de matriz em linha não será usado para a expressão de acesso ao elemento.
ru: Индексатор встроенного массива не будет использоваться для выражения доступа к элементу.
zh_hans: 内联数组索引器将不会用于元素访问表达式。
zh_hant: 內嵌陣列索引子不會用於元素存取運算式。

# WRN_InlineArrayNotSupportedByLanguage
source: 'Inline arrays' language feature is not supported for an inline array type that is not valid as a type argument, or has element type that is not valid as a type argument.
fr: La fonctionnalité de langage « inline arrays » n’est pas prise en charge pour un type de tableau inlined non valide en tant qu’argument de type ou dont le type d’élément n’est pas valide en tant qu’argument de type.
it: La funzionalità del linguaggio 'Matrici inline' non è supportata per un tipo di matrice inline che non è valido come argomento di tipo o che ha un tipo di elemento non valido come argomento di tipo.
pl: Funkcja języka „Tablice wbudowane” nie jest obsługiwana w przypadku typu tablicy wbudowanej, który jest nieprawidłowy jako argument typu lub ma typ elementu, który jest nieprawidłowy jako argument typu.
pt_br: O recurso de linguagem 'Inline arrays' não é compatível com um tipo de matriz em linha que não seja válido como argumento de tipo ou que tenha um tipo de elemento que não seja válido como argumento de tipo.
ru: Функция языка "Встроенные массивы" не поддерживается для встроенного типа массива, который недопустим в качестве аргумента типа или использует тип элемента, недопустимый в качестве аргумента типа.
zh_hans: 作为类型参数无效，或具有作为类型参数无效的元素类型的内联数组类型不支持“内联数组”语言功能。
zh_hant: 作為無效類型參數或具有作為無效類型參數之元素類型的内嵌陣列類型，都不支援「内嵌陣列」語言功能。

# WRN_InlineArrayNotSupportedByLanguage_Title
source: 'Inline arrays' language feature is not supported for an inline array type that is not valid as a type argument, or has element type that is not valid as a type argument.
fr: La fonctionnalité de langage « inline arrays » n’est pas prise en charge pour un type de tableau inlined non valide en tant qu’argument de type ou dont le type d’élément n’est pas valide en tant qu’argument de type.
it: La funzionalità del linguaggio 'Matrici inline' non è supportata per un tipo di matrice inline che non è valido come argomento di tipo o che ha un tipo di elemento non valido come argomento di tipo.
pl: Funkcja języka „Tablice wbudowane” nie jest obsługiwana w przypadku typu tablicy wbudowanej, który jest nieprawidłowy jako argument typu lub ma typ elementu, który jest nieprawidłowy jako argument typu.
pt_br: O recurso de linguagem 'Inline arrays' não é compatível com um tipo de matriz em linha que não seja válido como argumento de tipo ou que tenha um tipo de elemento que não seja válido como argumento de tipo.
ru: Функция языка "Встроенные массивы" не поддерживается для встроенного типа массива, который недопустим в качестве аргумента типа или использует тип элемента, недопустимый в качестве аргумента типа.
zh_hans: 作为类型参数无效，或具有作为类型参数无效的元素类型的内联数组类型不支持“内联数组”语言功能。
zh_hant: 作為無效類型參數或具有作為無效類型參數之元素類型的内嵌陣列類型，都不支援「内嵌陣列」語言功能。
