Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_SameFullNameThisAggNs_Title
source: Type conflicts with imported namespace
cs: Typ je v konfliktu s importovaným oborem názvů.
de: Typenkonflikte mit importiertem Namespace
es: El tipo entra en conflicto con un espacio de nombres importado
fr: Le type est en conflit avec l'espace de noms importé
it: Il tipo è in conflitto con lo spazio dei nomi importato
ja: 型がインポートされた名前空間と競合しています
ko: 형식이 가져온 네임스페이스와 충돌합니다.
pl: Typ powoduje konflikt z zaimportowaną przestrzenią nazw
pt_br: Conflitos de tipo com o namespace importado
ru: Тип конфликтует с импортированным пространством имен
tr: Tür içe aktarılan ad alanıyla çakışıyor
zh_hans: 类型与导入命名空间冲突
zh_hant: 類型與所匯入的命名空間衝突

# ERR_SameFullNameThisAggThisNs
source: The type '{1}' in '{0}' conflicts with the namespace '{3}' in '{2}'
cs: Typ {1} v {0} je v konfliktu s oborem názvů {3} v {2}.
de: Der Typ "{1}" in "{0}" steht in Konflikt mit dem Namespace "{3}" in "{2}".
es: El tipo '{1}' de '{0}' está en conflicto con el espacio de nombres '{3}' de '{2}'
fr: Le type '{1}' dans '{0}' est en conflit avec l'espace de noms '{3}' dans '{2}'
it: Il tipo '{1}' in '{0}' è in conflitto con lo spazio dei nomi '{3}' in '{2}'
ja: '{0}' の型 '{1}' が '{2}' の名前空間 '{3}' と競合しています
ko: {0}'의 '{1}' 형식이 '{2}'의 '{3}' 네임스페이스와 충돌합니다.
pl: Typ „{1}” w elemencie „{0}” powoduje konflikt z przestrzenią nazw „{3}” w elemencie „{2}”
pt_br: O tipo "{1}" em "{0}" está em conflito com o namespace "{3}" em "{2}"
ru: Тип "{1}" в "{0}" конфликтует с пространством имен "{3}" в "{2}".
tr: {0}' öğesindeki '{1}' türü '{2}' öğesindeki '{3}' ad alanı ile çakışıyor
zh_hans: “{0}”中的类型“{1}”与“{2}”中的命名空间“{3}”冲突
zh_hant: '{0}' 中的類型 '{1}' 與 '{2}' 中的命名空間 '{3}' 相衝突

# ERR_ExternAfterElements
source: An extern alias declaration must precede all other elements defined in the namespace
cs: Deklarace externího aliasu musí předcházet všem ostatním prvkům definovaným v oboru názvů.
de: Eine externe Aliasdeklaration muss allen anderen im Namespace definierten Elementen vorangehen.
es: La declaración de un alias externo debe preceder a los demás elementos definidos en el espacio de nombres
fr: Une déclaration d'alias extern doit précéder tous les autres éléments définis dans l'espace de noms
it: Una dichiarazione di alias extern deve precedere tutti gli altri elementi definiti nello spazio dei nomi
ja: extern エイリアス宣言は、名前空間で定義された他のすべての要素の前に指定しなければなりません
ko: extern 별칭 선언은 네임스페이스에 정의된 다른 모든 요소보다 앞에 와야 합니다.
pl: Deklaracja aliasu zewnętrznego musi poprzedzać wszystkie inne elementy zdefiniowane w przestrzeni nazw
pt_br: Uma declaração de alias externa deve preceder todos os outros elementos definidos no namespace
ru: Объявление внешнего псевдонима должно предшествовать всем другим элементам, определенным в пространстве имен.
tr: Bir extern diğer ad bildirimi, ad uzayında tanımlanan diğer tüm öğelerden önce gelmelidir
zh_hans: 外部别名声明必须位于命名空间中定义的所有其他元素之前
zh_hant: 外部別名宣告必須位於命名空間中所有其他定義的元素之前

# WRN_GlobalAliasDefn
source: Defining an alias named 'global' is ill-advised since 'global::' always references the global namespace and not an alias
cs: Definování aliasu s názvem global se nedoporučuje, protože global:: vždycky odkazuje na globální obor názvů, ne na alias.
de: Es sollte kein Alias mit dem Namen "global" definiert werden, da "global::" immer ein Verweis auf den globalen Namespace und nicht auf einen Alias ist.
es: No es aconsejable definir ningún alias denominado 'global' porque 'global::' siempre hace referencia al espacio de nombres global y no a un alias
fr: La définition d'un alias nommé 'global' n'est pas très judicieuse dans la mesure où 'global::' fait toujours référence à l'espace de noms global et non à un alias
it: Si consiglia di non assegnare il nome 'global' a un alias perché 'global::' fa sempre riferimento allo spazio dei nomi globale e non a un alias
ja: global::' はエイリアスではなく常にグローバル名前空間を参照するため、'global' という名前のエイリアスを定義することはお勧めしません
ko: global::'은 별칭이 아니라 전역 네임스페이스를 항상 참조하므로 별칭 이름을 'global'로 정의하지 않는 것이 좋습니다.
pl: Definiowanie aliasu o nazwie „global” jest niezalecane, ponieważ łańcuch „global::” zawsze odwołuje się do globalnej przestrzeni nazw, a nie do aliasu
pt_br: A definição de um alias denominado 'global' não é recomendável, pois 'global::' sempre faz referência ao namespace global, e não a um alias
ru: Определение псевдонима с именем "global" не рекомендуется из-за того, что "global::" всегда указывает на глобальное пространство имен и не является псевдонимом.
tr: global::' bir diğer ada değil her zaman genel ad uzayına başvurduğundan, 'global' adlı bir diğer ad tanımlanması önerilmez
zh_hans: 由于 "global::" 总是引用全局命名空间而非别名，因此定义一个名为 "global" 的别名是欠妥的
zh_hant: 最好不要定義名為 'global' 的別名，因為 'global::' 一定會去參考全域命名空間，而不會去參考別名

# WRN_GlobalAliasDefn_Title
source: Defining an alias named 'global' is ill-advised
cs: Definování aliasu s názvem global se nedoporučuje.
de: Es sollte kein Alias mit dem Namen " global" definiert werden
es: No se recomienda definir un alias con el nombre 'global'
fr: La définition d'un alias nommé 'global' n'est pas recommandée
it: È consigliabile non assegnare il nome 'global' a un alias
ja: global' という名前のエイリアスを定義することはお勧めしません
ko: 별칭 이름을 'global'로 정의하지 않는 것이 좋습니다.
pl: Nie zaleca się definiowania aliasu o nazwie „global”
pt_br: Não é recomendável definir um alias denominado 'global'
ru: Определение псевдонима с именем global не рекомендуется
tr: global' adlı bir diğer ad tanımlanması önerilmez
zh_hans: 定义名为 "global" 的别名是欠妥的
zh_hant: 最好不要定義名為 'global' 的別名

# ERR_SealedStaticClass
source: '{0}': a type cannot be both static and sealed
cs: {0}: Typ nemůže být zároveň statický i zapečetěný.
fr: '{0}' : un type ne peut pas être à la fois static et sealed
it: '{0}': un tipo non può essere sia statico che sealed
ja: '{0}': 型に static と sealed の両方を指定することはできません
pl: „{0}”: typ nie może być jednocześnie statyczny i zapieczętowany
pt_br: '{0}': um tipo não pode ser tanto estático quanto selado
ru: "{0}": тип не может быть одновременно статическим и запечатанным.
zh_hans: “{0}”: 类型不能既是静态的又是密封的
zh_hant: '{0}': 類型不可同時為靜態及密封

# ERR_PrivateAbstractAccessor
source: '{0}': abstract properties cannot have private accessors
cs: {0}: Abstraktní vlastnosti nemůžou mít privátní přistupující objekty.
de: '"{0}": Abstrakte Eigenschaften können keine private-Accessoren haben.
es: '{0}': las propiedades abstractas no pueden tener descriptores de acceso privados
fr: '{0}' : les propriétés abstraites ne peuvent pas avoir d'accesseurs private
it: '{0}': le proprietà astratte non possono avere funzioni di accesso private
ja: '{0}': 抽象プロパティにプライベート アクセサーは指定できません
ko: '{0}': 추상 속성에는 프라이빗 접근자를 사용할 수 없습니다.
pl: „{0}”: właściwości abstrakcyjne nie mogą mieć prywatnych metod dostępu
pt_br: "{0}": propriedades abstratas não podem ter acessadores particulares
ru: "{0}": абстрактные свойства не могут иметь закрытых методов доступа.
tr: '{0}': soyut özellikler özel erişenlere sahip olamaz
zh_hans: “{0}”: 抽象属性不能具有专用访问器
zh_hant: '{0}': 抽象屬性不可有私用存取子

# ERR_ValueExpected
source: Syntax error; value expected
cs: Chyba syntaxe: Očekávala se hodnota.
de: Syntaxfehler. Wert erwartet.
es: Error de sintaxis; se esperaba un valor
fr: Erreur de syntaxe ; valeur attendue
it: Errore di sintassi: è previsto un valore
ja: 構文エラーです。値が必要です
ko: 구문 오류입니다. 값이 필요합니다.
pl: Błąd składni; oczekiwano wartości
pt_br: Erro de sintaxe, valor esperado
ru: Синтаксическая ошибка; требуется значение.
tr: Sözdizimi hatası; değer bekleniyor
zh_hans: 语法错误，应为值
zh_hant: 語法錯誤; 應為值

# ERR_UnboxNotLValue
source: Cannot modify the result of an unboxing conversion
cs: Nejde změnit výsledek unboxingového převodu.
de: Das Ergebnis einer Unboxingkonvertierung kann nicht geändert werden.
es: No se puede modificar el resultado de una conversión unboxing
fr: Impossible de modifier le résultat d'une conversion unboxing
it: Non è possibile modificare il risultato di una conversione unboxing
ja: アンボックス変換の結果を変更できません
ko: unboxing 변환 결과는 수정할 수 없습니다.
pl: Nie można zmodyfikować wyniku konwersji rozpakowującej
pt_br: Não é possível modificar o resultado de uma conversão unboxing
ru: Невозможно изменить результат преобразования при распаковке.
tr: Bir paket açma dönüşümünün sonucu değiştirilemez
zh_hans: 无法修改取消装箱转换的结果
zh_hant: 無法修改 Unboxing 轉換的結果

# ERR_AnonMethGrpInForEach
source: Foreach cannot operate on a '{0}'. Did you intend to invoke the '{0}'?
cs: Příkaz foreach nejde použít pro {0}. Měli jste v úmyslu vyvolat {0}?
de: Foreach kann nicht für "{0}" verwendet werden. Wollten Sie "{0}" aufrufen?
es: Foreach no puede funcionar en un '{0}'. ¿Intentó invocar el '{0}'?
fr: Foreach ne peut pas fonctionner sur un '{0}'. Souhaitiez-vous appeler '{0}' ?
it: L'istruzione foreach non può funzionare con '{0}'. Si intendeva richiamare '{0}'?
ja: Foreach は '{0}' 上で使用できません。'{0}' を呼び出しますか?
ko: {0}'에서는 foreach를 수행할 수 없습니다. '{0}'을(를) 호출하시겠습니까?
pl: Instrukcja foreach nie może działać względem elementu „{0}”. Czy element „{0}” miał być wywołany?
pt_br: Foreach não pode operar em um "{0}". Você pretendia invocar o "{0}"?
ru: Работа оператора Foreach в "{0}" невозможна. Действительно вызвать "{0}"?
tr: Foreach '{0}' üzerinde çalışamaz. '{0}' öğesini çağırmayı mı istiyordunuz?
zh_hans: Foreach 不能操作“{0}”。是否要调用“{0}”?
zh_hant: Foreach 無法在 '{0}' 上運作。原本是要叫用 '{0}' 嗎?

# ERR_BadIncDecRetType
source: The return type for ++ or -- operator must match the parameter type or be derived from the parameter type
cs: Typ vrácené hodnoty operátorů ++ a -- musí odpovídat danému typu parametru nebo z něho musí být odvozený.
de: Der Rückgabetyp für den Operator ++ oder -- muss der Parametertyp sein oder vom Parametertyp abgeleitet werden.
es: El tipo de valor devuelto para los operadores ++ o -- debe coincidir con el tipo de parámetro o derivarse de este
fr: Le type de retour pour l'opérateur ++ ou -- doit correspondre au type de paramètre ou en être dérivé
it: Il tipo restituito per l'operatore ++ o -- deve essere uguale o derivare dal tipo che lo contiene
ja: ++ または -- 演算子の戻り値の型は、パラメーター型と一致するか、パラメーター型から派生する必要があります
ko: ++ 또는 -- 연산자의 반환 형식은 매개 변수 형식이거나 매개 변수 형식에서 파생되어야 합니다.
pl: Typ zwracany przez operator ++ lub -- musi odpowiadać typowi parametru lub pochodzić od typu parametru
pt_br: O tipo de retorno para o operador ++ ou -- deve corresponder ao tipo de parâmetro ou ser derivado do tipo de parâmetro
ru: Возвращаемый тип оператора ++ или -- должен соответствовать типу параметра или быть производным от типа параметра.
tr: ++ veya -- işleci için dönüş türü parametre türüyle eşleşmeli ya da parametre türünden türemelidir
zh_hans: ++ 或 -- 运算符的返回类型必须与参数类型匹配或从参数类型派生
zh_hant: ++ 或 -- 運算子的傳回類型，必須符合此參數類型或衍生自此參數類型

# ERR_RefValBoundWithClass
source: '{0}': cannot specify both a constraint class and the 'class' or 'struct' constraint
cs: {0}: Nejde zadat třídu omezení a zároveň omezení class nebo struct.
de: '"{0}": Eine Einschränkungsklasse kann nicht gleichzeitig mit einer class- oder struct-Einschränkung angegeben werden.
es: '{0}': no se puede especificar a la vez una clase de restricción y la restricción 'class' o 'struct'
fr: '{0}' : impossible de spécifier à la fois une classe de contrainte et la contrainte 'class' ou 'struct'
it: '{0}': non è possibile specificare sia una classe constraint che il vincolo 'class' o 'struct'
ja: '{0}': 制約クラスと 'class' または 'struct' 制約の両方を指定することはできません
ko: '{0}': constraint 클래스와 'class' 또는 'struct' 제약 조건을 둘 다 지정할 수는 없습니다.
pl: „{0}”: nie można jednocześnie określić klasy ograniczenia i ograniczenia „class” lub „struct”
pt_br: "{0}": não é possível especificar uma classe de restrição e a restrição "class" ou "struct"
ru: "{0}": невозможно одновременно задать класс ограничения и ограничения "class" или "struct".
tr: '{0}': hem bir kısıtlama sınıfı hem de 'class' veya 'struct' kısıtlaması belirtilemez
zh_hans: “{0}”: 不能既指定约束类又指定“class”或“struct”约束
zh_hant: '{0}': 不可在指定條件約束類型的同時，又指定 'class' 或 'struct' 條件約束

# ERR_NewBoundWithVal
source: The 'new()' constraint cannot be used with the 'struct' constraint
cs: Omezení new() nejde používat s omezením struct.
de: Die new()-Einschränkung kann nicht mit der struct-Einschränkung verwendet werden.
es: La restricción 'new()' no se puede utilizar con la restricción 'struct'
fr: La contrainte 'new()' ne peut pas être utilisée avec la contrainte 'struct'
it: Non è possibile usare il vincolo 'new()' con il vincolo 'struct'
ja: new()' 制約は 'struct' 制約と一緒には使用できません
ko: new()' 제약 조건은 'struct' 제약 조건과 함께 사용할 수 없습니다.
pl: Ograniczenie „new()” nie może być używane z ograniczeniem „struct”
pt_br: A restrição 'new()' não pode ser usada com a restrição 'struct'
ru: Ограничение "new()" невозможно использовать вместе с ограничением "struct".
tr: new()' kısıtlaması 'struct' kısıtlamasıyla kullanılamaz
zh_hans: "new()" 约束不能与 "struct" 约束一起使用
zh_hant: new()' 條件約束不能和 'struct' 條件約束一起使用

# ERR_RefConstraintNotSatisfied
source: The type '{2}' must be a reference type in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Typ {2} musí být typ odkazu, aby ho bylo možné používat jako parametr {1} v obecném typu nebo metodě {0}.
de: Der Typ "{2}" muss ein Referenztyp sein, damit er als {1}-Parameter im generischen Typ oder in der generischen Methode "{0}" verwendet werden kann.
es: El tipo '{2}' debe ser un tipo de referencia para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'
fr: Le type '{2}' doit être un type référence afin d'être utilisé comme paramètre '{1}' dans le type ou la méthode générique '{0}'
it: Il tipo '{2}' deve essere un tipo riferimento per poter essere usato come parametro '{1}' nel metodo o nel tipo generico '{0}'
ja: 型 '{2}' は、ジェネリック型のパラメーター '{1}'、またはメソッド '{0}' として使用するために、参照型でなければなりません
ko: 제네릭 형식 또는 메서드 '{0}'에서 '{2}' 형식을 '{1}' 매개 변수로 사용하려면 해당 형식이 참조 형식이어야 합니다.
pl: Typ „{2}” musi być typem referencyjnym, aby można było używać go jako parametru „{1}” w typie ogólnym lub metodzie ogólnej „{0}”.
pt_br: O tipo "{2}" deve ser um tipo de referência para que seja usado como parâmetro "{1}" no tipo ou método genérico "{0}"
ru: Тип "{2}" должен быть ссылочным типом для его использования в качестве параметра "{1}" в универсальном типе или методе "{0}".
tr: {2}' türünün '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için bir başvuru türü olması gerekir
zh_hans: 类型“{2}”必须是引用类型才能用作泛型类型或方法“{0}”中的参数“{1}”
zh_hant: 類型 '{2}' 必須是參考類型，才可在泛型類型或方法 '{0}' 中用做為參數 '{1}'

# ERR_ValConstraintNotSatisfied
source: The type '{2}' must be a non-nullable value type in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Typ {2} musí být typ, který nemůže mít hodnotu null, aby ho bylo možné používat jako parametr {1} v obecném typu nebo metodě {0}.
de: Der Typ "{2}" muss ein Non-Nullable-Werttyp sein, wenn er als {1}-Parameter im generischen Typ oder in der generischen Methode "{0}" verwendet werden soll.
es: El tipo '{2}' debe ser un tipo de valor que no acepte valores NULL para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'
fr: Le type '{2}' doit être un type valeur non-nullable afin d'être utilisé comme paramètre '{1}' dans le type ou la méthode générique '{0}'
it: Il tipo '{2}' deve essere un tipo valore che non ammette i valori Null per poter essere usato come parametro '{1}' nel metodo o nel tipo generico '{0}'
ja: 型 '{2}' は、ジェネリック型のパラメーター '{1}'、またはメソッド '{0}' として使用するために、Null 非許容の値型でなければなりません
ko: 제네릭 형식 또는 메서드 '{0}'에서 '{2}' 형식을 '{1}' 매개 변수로 사용하려면 해당 형식이 null을 허용하지 않는 값 형식이어야 합니다.
pl: Typ „{2}” musi być nienullowalnym typem wartości, aby można było użyć go jako parametru „{1}” w typie ogólnym lub metodzie ogólnej „{0}”.
pt_br: O tipo '{2}' deve ser um tipo de valor não anulável para que seja usado como parâmetro '{1}' no tipo ou método genérico '{0}'
ru: Для использования в качестве параметра "{1}" в универсальном типе или методе "{0}" тип "{2}" должен быть типом значения, не допускающим значения Null.
tr: {2}' türünün '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için null yapılamayan bir değer türü olması gerekir
zh_hans: 类型“{2}”必须是不可为 null 值的类型，才能用作泛型类型或方法“{0}”中的参数“{1}”
zh_hant: 類型 '{2}' 必須是不可為 null 的實值類型，才可在泛型類型或方法 '{0}' 中用做為參數 '{1}'

# ERR_CircularConstraint
source: Circular constraint dependency involving '{0}' and '{1}'
cs: Cyklická závislost omezení zahrnující {0} a {1}
de: Einschränkungsringabhängigkeit zwischen "{0}" und "{1}"
es: Dependencia de restricción circular que implica '{0}' y '{1}'
fr: Dépendance de contrainte circulaire utilisant '{0}' et '{1}'
it: Dipendenza di vincolo circolare che interessa '{0}' e '{1}'
ja: '{0}' と '{1}' を含む、循環制約の依存関係です
ko: {0}' 및 '{1}'과(와) 관련된 순환 제약 조건 종속성입니다.
pl: Cykliczna zależność ograniczenia obejmująca elementy „{0}” i „{1}”.
pt_br: Dependência de restrição circular envolvendo "{0}" e "{1}"
ru: Циклическая зависимость ограничений включает "{0}" и "{1}".
tr: {0}' ve '{1}' ile bağlantılı döngüsel kısıtlama bağımlılığı
zh_hans: 涉及“{0}”和“{1}”的循环约束依赖项
zh_hant: 循環條件約束相依性包括 '{0}' 和 '{1}'

# ERR_BaseConstraintConflict
source: Type parameter '{0}' inherits conflicting constraints '{1}' and '{2}'
cs: Parametr typu {0} dědí konfliktní omezení {1} a {2}.
de: Der {0}-Typparameter erbt die in Konflikt stehenden Einschränkungen "{1}" und "{2}".
es: El parámetro de tipo '{0}' hereda las restricciones conflictivas '{1}' y '{2}'
fr: Le paramètre de type '{0}' hérite des contraintes en conflit '{1}' et '{2}'
it: Il parametro di tipo '{0}' eredita i vincoli in conflitto '{1}' e '{2}'
ja: 型パラメーター '{0}' は、競合する制約 '{1}' および '{2}' を継承します
ko: 형식 매개 변수 '{0}'이(가) 상속하는 '{1}' 및 '{2}' 제약 조건이 충돌합니다.
pl: Parametr typu „{0}” dziedziczy powodujące konflikt ograniczenia „{1}” i „{2}”.
pt_br: O parâmetro de tipo "{0}" herda as restrições conflitantes "{1}" e "{2}"
ru: Параметр типа "{0}" наследует конфликтующие ограничения "{1}" и "{2}".
tr: {0}' tür parametresi çakışan '{1}' ve '{2}' kısıtlamalarını devralıyor
zh_hans: 类型参数“{0}”继承了彼此冲突的“{1}”和“{2}”约束
zh_hant: 類型參數 '{0}' 繼承了衝突的條件約束 '{1}' 和 '{2}'

# ERR_ConWithValCon
source: Type parameter '{1}' has the 'struct' constraint so '{1}' cannot be used as a constraint for '{0}'
cs: Parametr typu {1} má omezení struct, takže není možné používat {1} jako omezení pro {0}.
de: Der {1}-Typparameter enthält die Einschränkung "struct". "{1}" kann daher nicht als Einschränkung für "{0}" verwendet werden.
es: El parámetro de tipo '{1}' tiene la restricción 'struct'; por tanto, '{1}' no se puede usar como restricción para '{0}'
fr: Le paramètre de type '{1}' a la contrainte 'struct', donc '{1}' ne peut pas être utilisé comme contrainte pour '{0}'
it: Il parametro di tipo '{1}' ha il vincolo 'struct'. Non è quindi possibile usare '{1}' come vincolo per '{0}'
ja: 型パラメーター '{1}' は 'struct' 制約を含むので、'{0}' の制約として '{1}' を使用することはできません
ko: 형식 매개 변수 '{1}'에 'struct' 제약 조건이 있으므로 '{1}'은(는) '{0}'에 대한 제약 조건으로 사용할 수 없습니다.
pl: Parametr typu „{1}” ma ograniczenie „struct”, dlatego elementu „{1}” nie można użyć jako ograniczenia dla „{0}”.
pt_br: O parâmetro de tipo "{1}" tem a restrição "struct" e, por isso, "{1}" não pode ser usado como uma restrição de "{0}"
ru: Параметр типа "{1}" имеет ограничение "struct", поэтому "{1}" не может использоваться в качестве ограничения для "{0}".
tr: {1}' tür parametresinde 'struct' kısıtlaması olduğundan '{1}' '{0}' için kısıtlama olarak kullanılamaz
zh_hans: 类型参数“{1}”具有 "struct" 约束，因此“{1}”不能用作“{0}”的约束
zh_hant: 類型參數 '{1}' 有 'struct' 條件約束，因此 '{1}' 不可做為 '{0}' 的條件約束

# ERR_AmbigUDConv
source: Ambiguous user defined conversions '{0}' and '{1}' when converting from '{2}' to '{3}'
cs: Při převodu typu {2} na typ {3} došlo k uživatelem definovaným nejednoznačným převodům typu {0} na typ {1}.
de: Mehrdeutige benutzerdefinierte Konvertierungen von "{0}" und "{1}" bei der Konvertierung von "{2}" in "{3}".
es: Conversiones ambiguas definidas por el usuario '{0}' y '{1}' al convertir de '{2}' a '{3}'
fr: Conversions définies par l'utilisateur ambiguës '{0}' et '{1}' lors de la conversion de '{2}' en '{3}'
it: Le conversioni '{0}' e '{1}' definite dall'utente durante la conversione da '{2}' a '{3}' sono ambigue
ja: '{2}' から '{3}' へ変換するときの、あいまいなユーザー定義の変換 '{0}' および '{1}' です
ko: {2}'에서 '{3}(으)로 변환하는 동안 모호한 사용자 정의 변환 '{0}' 및 '{1}'이(가) 발생했습니다.
pl: Niejednoznaczne zdefiniowane przez użytkownika konwersje „{0}” i „{1}” podczas konwertowania z „{2}” na „{3}”.
pt_br: Conversões ambíguas definidas por usuário "{0}" e "{1}" ao realizar a conversão de "{2}" em "{3}"
ru: Неоднозначные пользовательские преобразования "{0}" и "{1}" при преобразовании из "{2}" в "{3}".
tr: {2}' iken '{3}' olarak dönüştürülürken belirsiz kullanıcı tanımlı '{0}' ve '{1}' dönüşümleri yapıldı.
zh_hans: 从“{2}”转换为“{3}”时，用户定义的转换“{0}”和“{1}”具有二义性
zh_hant: 從 '{2}' 轉換成 '{3}' 時，使用者定義的轉換 '{0}' 與 '{1}' 模稜兩可

# WRN_AlwaysNull
source: The result of the expression is always 'null' of type '{0}'
cs: Výsledek výrazu je vždy hodnota null typu {0}.
de: Das Ergebnis des Ausdrucks ist immer NULL vom Typ "{0}".
es: El resultado de la expresión siempre es 'NULL' de tipo '{0}'
fr: Le résultat de l'expression est toujours 'null' de type '{0}'
it: Il risultato dell'espressione è sempre 'null' di tipo '{0}'
ja: 式の結果は常に型 '{0}' の 'null' になります
ko: 식의 결과 값은 항상 '{0}' 형식의 'null'입니다.
pl: Wynikiem wyrażenia jest zawsze element „null” typu „{0}”
pt_br: O resultado da expressão sempre é "null" do tipo "{0}"
ru: Результатом этого выражения всегда будет "Null" типа "{0}".
tr: İfadenin sonucu her zaman '{0}' türünün 'null' değeridir
zh_hans: 表达式的结果总是“{0}”类型的“null”
zh_hant: 運算式的結果一律會是類型 '{0}' 的 'null'

# WRN_AlwaysNull_Title
source: The result of the expression is always 'null'
cs: Výsledek výrazu je vždycky null.
de: Das Ergebnis des Ausdrucks lautet immer 'null'
es: El resultado de la expresión siempre es 'null'
fr: Le résultat de l'expression est toujours 'null'
it: Il risultato dell'espressione è sempre 'null'
ja: 式の結果が常に 'null' です
ko: 식의 결과는 항상 'null'입니다.
pl: Wynikiem wyrażenia jest zawsze wartość „null”
pt_br: O resultado da expressão é sempre 'null'
ru: Результат выражения — всегда NULL
tr: İfadenin sonucu her zaman 'null'
zh_hans: 表达式的结果总是 "null"
zh_hant: 運算式的結果一律是 'null'

# ERR_RefReturnThis
source: Cannot return 'this' by reference.
cs: Nejde vrátit this pomocí odkazu.
de: "this" kann nicht als Verweis zurückgegeben werden.
es: No se puede devolver "this" por referencia.
fr: Impossible de retourner 'this' par référence.
it: Non è possibile restituire 'this' per riferimento.
ja: 参照渡しで 'this' を返すことはできません。
ko: this'를 참조로 반환할 수 없습니다.
pl: Nie można zwrócić elementu „this” przez referencję.
pt_br: Não é possível retornar 'this' por referência.
ru: Невозможно вернуть this по ссылке.
tr: This' başvuruya göre döndürülemez.
zh_hans: 不能通过引用返回 "this"。
zh_hant: 無法藉傳址方式傳回「這個」。

# ERR_AttributeCtorInParameter
source: Cannot use attribute constructor '{0}' because it has 'in' or 'ref readonly' parameters.
fr: Impossible d'utiliser le constructeur d'attribut « {0} » car il a des paramètres « in » ou « ref readonly ».
it: Non è possibile utilizzare il costruttore dell'attributo '{0}' perché contiene parametri 'in' o 'ref readonly'.
ja: 'in' または 'ref readonly' パラメーターがあるため、属性のコンストラクター '{0}' を使用できません。
pl: Nie można użyć konstruktora atrybutu „{0}”, ponieważ ma on parametry „in” lub „ref readonly”.
pt_br: Não é possível usar o construtor de atributo '{0}' porque ele possui parâmetros 'in' ou 'ref readonly'.
ru: Невозможно использовать конструктор атрибута "{0}", так как он содержит параметры "in" или "ref readonly".
zh_hans: 无法使用属性构造函数 "{0}"，因为它具有 "in" 或 "ref readonly" 参数。
zh_hant: 無法使用屬性 constructor '{0}'，因為它有 'in' 或 'ref readonly' 參數。
