Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_CSCHelp
source: Visual C# Compiler Options - OUTPUT FILES - -out:<file> Specify output file name (default: base name of file with main class or first file) -target:exe Build a console executable (default) (Short form: -t:exe) -target:winexe Build a Windows executable (Short form: -t:winexe) -target:library Build a library (Short form: -t:library) -target:module Build a module that can be added to another assembly (Short form: -t:module) -target:appcontainerexe Build an Appcontainer executable (Short form: -t:appcontainerexe) -target:winmdobj Build a Windows Runtime intermediate file that is consumed by WinMDExp (Short form: -t:winmdobj) -doc:<file> XML Documentation file to generate -refout:<file> Reference assembly output to generate -platform:<string> Limit which platforms this code can run on: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred, or anycpu. The default is anycpu. - INPUT FILES - -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications -reference:<alias>=<file> Reference metadata from the specified assembly file using the given alias (Short form: -r) -reference:<file list> Reference metadata from the specified assembly files (Short form: -r) -addmodule:<file list> Link the specified modules into this assembly -link:<file list> Embed metadata from the specified interop assembly files (Short form: -l) -analyzer:<file list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. -embed Embed all source files in the PDB. -embed:<file list> Embed specific files in the PDB. - RESOURCES - -win32res:<file> Specify a Win32 resource file (.res) -win32icon:<file> Use this icon for the output -win32manifest:<file> Specify a Win32 manifest file (.xml) -nowin32manifest Do not include the default Win32 manifest -resource:<resinfo> Embed the specified resource (Short form: -res) -linkresource:<resinfo> Link the specified resource to this assembly (Short form: -linkres) Where the resinfo format is <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] Emit debugging information -debug:{full|pdbonly|portable|embedded} Specify debugging type ('full' is default, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the target .dll or .exe) -optimize[+|-] Enable optimizations (Short form: -o) -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -warnaserror[+|-] Report all warnings as errors -warnaserror[+|-]:<warn list> Report specific warnings as errors -warn:<n> Set warning level (0-4) (Short form: -w) -nowarn:<warn list> Disable specific warning messages -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. - LANGUAGE - -checked[+|-] Generate overflow checks -unsafe[+|-] Allow 'unsafe' code -define:<symbol list> Define conditional compilation symbol(s) (Short form: -d) -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `latest` (latest version, including minor versions), `default` (same as `latest`), `latestmajor` (latest version, excluding minor versions), `preview` (latest version, including features in unsupported preview), or specific versions like `6` or `7.1` -nullable[+|-] Specify nullable context option enable|disable. -nullable:{enable|disable|warnings|annotations} Specify nullable context option enable|disable|warnings|annotations. - SECURITY - -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key -keyfile:<file> Specify a strong name key file -keycontainer:<string> Specify a strong name key container -highentropyva[+|-] Enable high-entropy ASLR - MISCELLANEOUS - @<file> Read response file for more options -help Display this usage message (Short form: -?) -nologo Suppress compiler copyright message -noconfig Do not auto include CSC.RSP file -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<address> Base address for the library to be built -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<n> Specify the codepage to use when opening source files -utf8output Output compiler messages in UTF-8 encoding -main:<type> Specify the type that contains the entry point (ignore all other possible entry points) (Short form: -m) -fullpaths Compiler generates fully qualified paths -filealign:<n> Specify the alignment used for output file sections -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -pdb:<file> Specify debug information file name (default: output file name with .pdb extension) -errorendlocation Output line and column of the end location of each error -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -nostdlib[+|-] Do not reference standard library (mscorlib.dll) -subsystemversion:<string> Specify subsystem version of this assembly -lib:<file list> Specify additional directories to search in for references -errorreport:<string> Specify how to handle internal compiler errors: prompt, send, queue, or none. The default is queue. -appconfig:<file> Specify an application configuration file containing assembly binding settings -moduleassemblyname:<string> Name of the assembly which this module will be a part of -modulename:<string> Specify the name of the source module
tr: Visual C# Derleyici Seçenekleri - ÇIKIŞ DOSYALARI - -out:<dosya> Çıkış dosyası adını belirt (varsayılan: ana sınıfı içeren dosyanın veya ilk dosyanın temel adı) -target:exe Konsol yürütülebilir dosyası oluştur (varsayılan) (Kısa biçim: -t:exe) -target:winexe Windows yürütülebilir dosyası oluştur (Kısa biçim: -t:winexe) -target:library Kitaplık derle (Kısa biçim: -t:library) -target:module Başka bir bütünleştirilmiş koda eklenebilecek bir modül oluştur (Kısa biçim: -t:module) -target:appcontainerexe Appcontainer yürütülebilir dosyası oluştur (Kısa biçim: -t:appcontainerexe) -target:winmdobj WinMDExp tarafından kullanılan bir Windows Çalışma Zamanı ara dosyası oluştur (Kısa biçim: -t:winmdobj) -doc:<dosya> Oluşturulacak XML Belge dosyası -refout:<dosya> Oluşturulacak başvuru bütünleştirilmiş kodu çıkışı -platform:<dize> Bu kodun çalıştırılabileceği platformları sınırlandır: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred veya anycpu. Varsayılan: anycpu. - GİRİŞ DOSYALARI - -recurse:<joker karakter> Geçerli dizindeki ve alt dizinlerdeki tüm dosyaları Joker karakter belirtimlerine göre ekle -reference:<diğer ad>=<dosya> Verilen diğer adı kullanan belirtilen bütünleştirilmiş kod dosyasındaki meta verilere başvur (Kısa biçim: -r) -reference:<dosya listesi> Belirtilen bütünleştirilmiş kod dosyalarındaki meta verilere başvur (Kısa biçim: -r) -addmodule:<dosya listesi> Belirtilen modülleri bu bütünleştirilmiş koda bağla -link:<dosya listesi> Belirtilen birlikte çalışma bütünleştirilmiş kod dosyalarındaki meta verileri ekle (Kısa biçim: -l) -analyzer:<dosya listesi> Çözümleyicileri bu bütünleştirilmiş koddan çalıştır (Kısa biçim: -a) -additionalfile:<dosya listesi> Kod oluşturmayı doğrudan etkilemeyen ancak hata ve uyarılar oluşturmak için çözümleyicilerin kullanabileceği ek dosyalar. -embed Tüm kaynak dosyalarını PDB'ye ekle. -embed:<dosya listesi> Belirli dosyaları PDB'ye ekle. - KAYNAKLAR - -win32res:<dosya> Bir Win32 kaynak dosyası (.res) belirt -win32icon:<dosya> Çıkış için bu simgeyi kullan -win32manifest:<dosya> Bir Win32 bildirim dosyası (.xml) belirt -nowin32manifest Varsayılan Win32 bildirimini dahil etme -resource:<kaynak bilgileri> Belirtilen kaynağı ekle (Kısa biçim: -res) -linkresource:<kaynak bilgileri> Belirtilen kaynağı bu bütünleştirilmiş koda bağla (Kısa biçim: -linkres) Burada kaynak bilgileri <dosya>[,<dize adı>[,public|private]] biçimindedir - KOD OLUŞTURMA - -debug[+|-] Hata ayıklama bilgilerini göster -debug:{full|pdbonly|portable|embedded} Hata ayıklama türünü belirt ('full' varsayılan, 'portable' platformlar arası biçim, 'embedded' ise hedef .dll veya .exe dosyasına eklenmiş platformlar arası bir biçimdir) -optimize[+|-] İyileştirmeleri etkinleştir (Kısa biçim: -o) -deterministic Belirlenimci bir bütünleştirilmiş kod oluştur (modül sürümü GUID'si ve zaman damgası dahil) -refonly Ana çıkış yerine bir başvuru bütünleştirilmiş kodu oluştur -instrument:TestCoverage Kapsam bilgilerini toplamak üzere izleme eklenmiş bir bütünleştirilmiş kod oluştur -sourcelink:<dosya> PDB'ye eklenecek kaynak bağlantı bilgileri. - HATALAR VE UYARILAR - -warnaserror[+|-] Tüm uyarıları hata olarak bildir -warnaserror[+|-]:<uyarı listesi> Belirli uyarıları hata olarak bildir -warn:<n> Uyarı düzeyini ayarla (0-4) (Kısa biçim: -w) -nowarn:<uyarı listesi> Belirli uyarı iletilerini devre dışı bırak -ruleset:<dosya> Belirli tanılamaları devre dışı bırakan bir kural kümesi dosyası belirt. -errorlog:<dosya>[,version=<sarif_sürümü>] Tüm derleyici ve çözümleyici tanılamalarını günlüğe kaydetmek için bir dosya belirt. sarif_sürümü:{1|2|2.1} Varsayılan: 1 sürümüdür. 2 ve 2.1 sürümlerinin her ikisi de SARIF 2.1.0 sürümü anlamına gelir. -reportanalyzer Yürütme zamanı gibi ek çözümleyici bilgilerini bildir. - DİL - -checked[+|-] Taşma denetimleri oluştur -unsafe[+|-] 'Güvenli olmayan' koda izin ver -define:<sembol listesi> Koşullu derleme sembolleri tanımla (Kısa biçim: -d) -langversion:? Dil sürümü için izin verilen değerleri görüntüle -langversion:<dize> Dil sürümünü belirt. Örneğin: `latest` (ikincil sürümleri de içeren en son sürüm), `default` (`latest` ile aynı) `latestmajor` (ikincil sürümler hariç en son sürüm), `preview` (desteklenmeyen önizleme sürümündeki özellikleri içeren en son sürüm) ya da `6` veya `7.1` gibi belirli sürümler -nullable[+|-] Null değer atanabilir bağlam seçeneğini enable|disable olarak belirt. -nullable:{enable|disable|warnings|annotations} Null değer atanabilir bağlam seçeneğini enable|disable|warnings|annotations olarak belirt. - GÜVENLİK - -delaysign[+|-] Bütünleştirilmiş kodu, tanımlayıcı ad anahtarının yalnızca genel kısmıyla geç imzala -publicsign[+|-] Bütünleştirilmiş kodu, tanımlayıcı ad anahtarının yalnızca genel kısmıyla genel olarak imzala -keyfile:<dosya> Bir tanımlayıcı ad anahtarı dosyası belirt -keycontainer:<dize> Bir tanımlayıcı ad anahtarı kapsayıcısı belirt -highentropyva[+|-] Yüksek entropili ASLR'yi etkinleştir - ÇEŞİTLİ - @<dosya> Daha fazla seçenek için yanıt dosyasını oku -help Bu kullanım iletisini görüntüle (Kısa biçim: -?) -nologo Derleyici telif hakkı iletisini görüntüleme -noconfig CSC.RSP dosyasını otomatik olarak dahil etme -parallel[+|-] Eşzamanlı derleme. -version Derleyici sürüm numarasını görüntüle ve çıkış yap. - GELİŞMİŞ - -baseaddress:<adres> Oluşturulacak kitaplığın taban adresi -checksumalgorithm:<alg> PDB'de depolanan kaynak dosyanın sağlama toplamını hesaplama algoritmasını belirt. Desteklenen değerler: SHA1 veya SHA256 (varsayılan). -codepage:<n> Kaynak dosyalarını açarken kullanılacak kod sayfasını belirt -utf8output Derleyici iletilerini UTF-8 kodlamasında görüntüle -main:<tür> Giriş noktasını içeren türü belirt (diğer tüm olası giriş noktalarını yoksay) (Kısa biçim: -m) -fullpaths Derleyici, tam yollar oluşturur -filealign:<n> Çıkış dosyasının bölümleri için kullanılan hizalamayı belirtin -pathmap:<A1>=<D1>,<A2>=<D2>,... Derleyici tarafından gösterilen kaynak yolu adları için bir eşleme belirtin. -pdb:<dosya> Hata ayıklama bilgileri dosyasının adını belirt (varsayılan: çıkış dosyasının adı ve .pdb uzantısı) -errorendlocation Her hatanın bitiş konumunun satır ve sütununu göster -preferreduilang Tercih edilen çıkış dilinin adını belirt. -nosdkpath Standart kitaplık bütünleştirilmiş kodlarında varsayılan SDK yolunu aramayı devre dışı bırak. -nostdlib[+|-] Standart kitaplığa (mscorlib.dll) başvuru yapma -subsystemversion:<dize> Bu bütünleştirilmiş kodu alt sistem sürümünü belirt -lib:<dosya listesi> İçinde başvuruların aranacağı ek dizinleri belirt -errorreport:<dize> İç derleyici hatalarının nasıl işleneceğini belirt: prompt, send, queue veya none. Varsayılan: queue. -appconfig:<dosya> Bütünleştirilmiş kod bağlama ayarlarını içeren bir uygulama yapılandırma dosyası belirt -moduleassemblyname:<dize> Bu modülün parçası olacağı bütünleştirilmiş kodun adı -modulename:<dize> Kaynak modülün adını belirt

# ERR_DllImportOnGenericMethod
source: The DllImport attribute cannot be applied to a method that is generic or contained in a generic type.
tr: DllImport özniteliği genel veya genel bir türde barındırılan bir yönteme uygulanamaz.

# ERR_LocalFunctionMissingBody
source: '{0}' is a local function and must therefore always have a body.
tr: '{0}' yerel bir işlev olduğundan her zaman gövdesi olmalıdır.
