Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoNamespacePrivate
source: Elements defined in a namespace cannot be explicitly declared as private, protected, protected internal, or private protected
cs: Elementy definované v názvovém prostoru nelze explicitně deklarovat jako private, protected, protected internal nebo private protected.
de: Die in einem Namespace definierten Elemente dürfen nicht explizit als "private", "protected", "protected internal" oder "private protected" deklariert werden.
es: Los elementos definidos en un espacio de nombres no se pueden declarar explícitamente como private, protected, protected internal o private protected.
fr: Les éléments définis dans un espace de noms ne peuvent pas être explicitement déclarés comme private, protected ou protected internal ou private protected
it: Gli elementi definiti in uno spazio dei nomi non possono essere dichiarati in modo esplicito come private, protected, protected internal o private protected
ja: 名前空間で定義された要素は明示的に private、protected、protected internal、または private protected に宣言することはできません
ko: 네임스페이스에 정의된 요소는 명시적으로 private, protected, protected internal 또는 private protected로 선언할 수 없습니다.
pl: Elementów definiowanych w przestrzeni nazw nie można jawnie deklarować jako prywatnych, chronionych, chronionych wewnętrznych lub prywatnych chronionych
pt_br: Os elementos definidos em um namespace não podem ser declarados explicitamente como privados, protegidos, protegidos internamente ou protegidos de forma privada
ru: Элементы, определенные в пространстве имен, нельзя объявлять в явном виде как частные, защищенные, защищенные внутренние или частные защищенные.
tr: Ad alanında tanımlanan öğeler private, protected, protected internal veya private protected olarak açıkça bildirilemez
zh_hans: 命名空间中定义的元素无法显式声明为 private、protected、protected internal 或 private protected
zh_hant: 在命名空間中定義的元素無法明確宣告為 private、protected、protected internal 或 private protected

# ERR_BadVarDecl
source: Expected ; or = (cannot specify constructor arguments in declaration)
cs: Očekával se znak ; nebo = (v deklaraci nejde zadat argumenty konstruktoru).
de: ";" oder "=" erwartet. (Konstruktorargumente können nicht in einer Deklaration angegeben werden.)
es: Se esperaba ; o = (no se pueden especificar argumentos de constructor en la declaración)
fr: ; ou = attendu (impossible de spécifier des arguments de constructeur dans une déclaration)
it: È previsto il segno ; oppure = (non è possibile specificare gli argomenti del costruttore nella dichiarazione)
ja: ; または = を指定してください (宣言の中にコンストラクター引数は指定できません)
ko: ; 또는 =가 필요합니다. 선언에서는 생성자 인수를 지정할 수 없습니다.
pl: Oczekiwano znaku ; lub = (w deklaracji nie można określić argumentów konstruktora).
pt_br: ; ou = esperado (não é possível especificar argumentos de construtor na declaração)
ru: Требуется ";" или "=" (невозможно задать аргументы конструктора в объявлении).
tr: ; veya = bekleniyor (bildirimde oluşturucu bağımsız değişkenleri belirtilemez)
zh_hans: 应输入 ";" 或 "="(无法在声明中指定构造函数参数)
zh_hant: 必須是 ; 或 = (無法在宣告中指定建構函式引數)

# ERR_UsingAfterElements
source: A using clause must precede all other elements defined in the namespace except extern alias declarations
cs: Klauzule using musí předcházet všem ostatním prvkům definovaným v oboru názvů s výjimkou deklarací externích aliasů.
de: Eine using-Klausel muss allen anderen im Namespace definierten Elementen mit Ausnahme externer Aliasdeklarationen vorangehen.
es: Una cláusula using debe preceder al resto de elementos definidos en el espacio de nombres, excepto las declaraciones de alias externos
fr: Une clause using doit précéder tous les autres éléments définis dans l'espace de noms sauf les déclarations d'alias extern
it: La clausola using deve precedere tutti gli altri elementi definiti nello spazio dei nomi ad eccezione delle dichiarazioni di alias extern
ja: using 句は、extern エイリアス宣言以外の、名前空間で定義された他のすべての要素の前に使用しなければなりません
ko: extern 별칭 선언을 제외하고 using 절은 네임스페이스에 정의된 다른 모든 요소보다 앞에 와야 합니다.
pl: Klauzula „using” musi występować przed wszystkimi innymi elementami zdefiniowanymi w przestrzeni nazw poza deklaracjami aliasów zewnętrznych.
pt_br: Uma cláusula using deve preceder todos os outros elementos definidos no namespace, exceto as declarações de alias externas
ru: Предложение Using должно предшествовать любым другим элементам пространства имен кроме объявлений внешних псевдонимов.
tr: Using yan tümcesi extern diğer ad bildirimleri dışında ad uzayında tanımlanan diğer tüm öğelerden önce gelmelidir
zh_hans: using 子句必须位于命名空间中定义的所有其他元素之前(外部别名声明除外)
zh_hant: using 子句必須位於所有其他命名空間中所定義的元素之前 (外部別名宣告除外)

# ERR_BadBinOpArgs
source: Overloaded binary operator '{0}' takes two parameters
cs: Přetěžovaný binární operátor {0} používá dva parametry.
de: Der überladene binäre Operator "{0}" nimmt zwei Parameter an.
es: El operador binario sobrecargado '{0}' toma dos parámetros
fr: L'opérateur binaire surchargé '{0}' prend deux paramètres
it: L'operatore binario di overload '{0}' accetta due parametri
ja: オーバーロードされた 2 項演算子 '{0}' に指定できるパラメーター数は 2 です
ko: 오버로드된 '{0}' 이항 연산자는 매개 변수를 두 개 사용합니다.
pl: Przeciążony operator binarny „{0}” przyjmuje dwa parametry
pt_br: Operador binário sobrecarregado "{0}" obtém dois parâmetros
ru: Перегруженный бинарный оператор "{0}" принимает два параметра.
tr: Fazla yüklenmiş '{0}' ikili işleci iki parametre alır
zh_hans: 重载的二元运算符“{0}”采用两个参数
zh_hant: 多載二元運算子 '{0}' 接受兩個參數

# ERR_BadUnOpArgs
source: Overloaded unary operator '{0}' takes one parameter
cs: Přetěžovaný unární operátor {0} převezme jeden parametr.
de: Der überladene unäre Operator "{0}" nimmt einen Parameter an.
es: El operador unario sobrecargado '{0}' toma un parámetro
fr: L'opérateur unaire surchargé '{0}' prend un paramètre
it: L'operatore unario di overload '{0}' accetta un parametro
ja: オーバーロードされた単項演算子 '{0}' に指定できるパラメーター数は 1 です
ko: 오버로드된 '{0}' 단항 연산자는 매개 변수를 한 개 사용합니다.
pl: Przeciążony operator jednoargumentowy „{0}” przyjmuje jeden parametr
pt_br: Operador unário sobrecarregado "{0}" obtém um parâmetro
ru: Перегруженный унарный оператор "{0}" принимает один параметр.
tr: Fazla yüklenmiş '{0}' tek işlem işleci bir parametre alır
zh_hans: 重载的一元运算符“{0}”采用一个参数
zh_hant: 多載一元運算子 '{0}' 接受一個參數

# ERR_NoVoidParameter
source: Invalid parameter type 'void'
cs: Neplatný typ parametru void
de: Ungültiger Parametertyp "void".
es: El tipo de parámetro 'void' no es válido
fr: Type de paramètre non valide 'void'
it: Tipo parametro 'void' non è valido
ja: void は無効なパラメーター型です
ko: void' 매개 변수 형식이 잘못되었습니다.
pl: Nieprawidłowy typ parametru (void)
pt_br: Tipo de parâmetro 'void' inválido
ru: Параметр имеет недопустимый тип "void".
tr: Geçersiz parametre türü 'void'
zh_hans: 参数类型 "void" 无效
zh_hant: 參數類型 'void' 無效

# ERR_DuplicateAlias
source: The using alias '{0}' appeared previously in this namespace
cs: Alias using {0} se objevil dřív v tomto oboru názvů.
de: Der using-Alias "{0}" ist bereits vorher in diesem Namespace aufgetreten.
es: El alias using '{0}' aparece previamente en este espacio de nombres
fr: L'alias using '{0}' est apparu précédemment dans cet espace de noms
it: Using Alias '{0}' è già presente nello spazio dei nomi
ja: using エイリアス '{0}' は以前にこの名前空間で使用されています
ko: using 별칭 '{0}'을(를) 이전에 이 네임스페이스에서 사용했습니다.
pl: Alias użycia „{0}” pojawił się poprzednio w tej przestrzeni nazw
pt_br: O alias using "{0}" exibido anteriormente neste namespace
ru: Псевдоним using "{0}" ранее встречался в этом пространстве имен.
tr: {0}' using diğer adı bu ad alanında daha önce göründü
zh_hans: using 别名“{0}”以前在此命名空间中出现过
zh_hant: using 別名 '{0}' 之前曾出現於此命名空間中

# ERR_BadProtectedAccess
source: Cannot access protected member '{0}' via a qualifier of type '{1}'; the qualifier must be of type '{2}' (or derived from it)
cs: K chráněnému členu {0} nejde přistupovat prostřednictvím kvalifikátoru typu {1}. Kvalifikátor musí být typu {2} (nebo musí být od tohoto typu odvozen).
de: Auf den geschützten Member "{0}" kann nicht über einen Qualifizierer vom Typ "{1}" zugegriffen werden. Der Qualifizierer muss vom Typ "{2}" (oder von ihm abgeleitet) sein.
es: No se puede obtener acceso al miembro protegido '{0}' a través de un calificador del tipo '{1}'; el calificador debe ser del tipo '{2}' (o derivado de este)
fr: Impossible d'accéder au membre protégé '{0}' par l'intermédiaire d'un qualificateur de type '{1}' ; le qualificateur doit être de type '{2}' (ou dérivé de celui-ci)
it: Non è possibile accedere al membro protetto '{0}' tramite un qualificatore di tipo '{1}'. Il qualificatore deve essere di tipo '{2}' o derivato da esso
ja: '{1}' 型の修飾子をとおしてプロテクト メンバー '{0}' にアクセスすることはできません。修飾子は '{2}' 型、またはそれから派生したものでなければなりません
ko: {1}' 형식의 한정자를 통해 보호된 멤버 '{0}'에 액세스할 수 없습니다. 한정자는 '{2}' 형식이거나 여기에서 파생된 형식이어야 합니다.
pl: Nie można uzyskać dostępu do składowej chronionej „{0}” za pośrednictwem kwalifikatora typu „{1}”. Wymagany jest kwalifikator typu „{2}” (lub typu pochodzącego od tego typu).
pt_br: Não é possível acessar membro protegido "{0}" através de um qualificador do tipo "{1}"; o qualificador deve ser do tipo "{2}" (ou derivado dele)
ru: Доступ к защищенному члену "{0}" через квалификатор типа "{1}" невозможен; квалификатор должен иметь тип "{2}" (или производный от него тип).
tr: {0}' korunan üyesine '{1}' türündeki niteleyici kullanılarak erişilemez; niteleyici '{2}' türünde (veya bundan türetilmiş) olmalıdır
zh_hans: 无法通过“{1}”类型的限定符访问受保护的成员“{0}”；限定符必须是“{2}”类型(或者从该类型派生)
zh_hant: 無法經由類型 '{1}' 的限定詞，來存取保護的成員 '{0}'; 限定詞必須是類型 '{2}' (或從其衍生的類型)

# ERR_AddModuleAssembly
source: '{0}' cannot be added to this assembly because it already is an assembly
cs: {0} se nemůže přidat do tohoto sestavení, protože už to sestavení je.
de: '"{0}" kann dieser Assembly nicht hinzugefügt werden, da es bereits eine Assembly ist.
es: '{0}' no se puede agregar a este ensamblado porque ya es un ensamblado
fr: '{0}' ne peut pas être ajouté à cet assembly, car il s'agit déjà d'un assembly
it: 'Non è possibile aggiungere '{0}' a questo assembly perché è già un assembly
ja: '{0}' は既にアセンブリなのでこのアセンブリに加えることはできません
ko: '{0}'은(는) 이미 어셈블리이므로 이 어셈블리에 추가할 수 없습니다.
pl: 'Nie można dodać elementu „{0}” do tego zestawu, ponieważ jest to już zestaw
pt_br: "{0}" não pode ser adicionado a este assembly porque já é um assembly
ru: "{0}" не может быть добавлен к этой сборке, так как он уже там находится.
tr: 'Zaten bir derleme olduğundan '{0}' bu derlemeye eklenemiyor
zh_hans: “{0}”无法添加到此程序集，因为它已是程序集
zh_hant: '{0}' 因為已是組件，所以無法加入此組件中

# ERR_BindToBogusProp2
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor methods '{1}' or '{2}'
cs: Vlastnost, indexer nebo událost {0} nejsou tímto jazykem podporované. Zkuste přímo volat metody přistupujícího objektu {1} nebo {2}.
de: Die Eigenschaft, der Indexer oder das Ereignis "{0}" wird von der Sprache nicht unterstützt. Rufen Sie die {1}- oder {2}-Accessormethoden direkt auf.
es: El idioma no admite la propiedad, el indizador o el evento '{0}'; intente llamar directamente a los métodos del descriptor de acceso '{1}' o '{2}'
fr: La propriété, l'indexeur ou l'événement '{0}' n'est pas pris en charge par le langage ; essayez d'appeler directement les méthodes d'accesseur '{1}' ou '{2}'
it: La proprietà, l'indicizzatore o l'evento '{0}' non è supportato dal linguaggio. Provare a chiamare direttamente i metodi della funzione di accesso '{1}' o '{2}'
ja: プロパティ、インデクサー、またはイベント '{0}' はこの言語でサポートされていません。アクセサー メソッドの '{1}' または '{2}' を直接呼び出してください
ko: {0}' 속성, 인덱서 또는 이벤트는 이 언어에서 지원되지 않습니다. '{1}' 또는 '{2}' 접근자 메서드를 직접 호출해 보세요.
pl: Właściwość, indeksator lub zdarzenie „{0}” nie jest obsługiwane przez język. Spróbuj bezpośrednio wywołać metody dostępu „{1}” lub „{2}”.
pt_br: O idioma não dá suporte à propriedade, ao indexador ou ao evento "{0}"; tente chamar diretamente o método de acessador "{1}" ou "{2}"
ru: Свойство, индексатор или событие "{0}" не поддерживается в данном языке; попытайтесь вызвать методы доступа "{1}" или "{2}" напрямую.
tr: {0}' özelliği, dizin erişimcisi veya olayı dil tarafından desteklenmiyor; '{1}' veya '{2}' erişimci yöntemlerini doğrudan çağırmayı deneyin
zh_hans: 属性、索引器或事件“{0}”不受现用语言支持；请尝试直接调用访问器方法“{1}”或“{2}”
zh_hant: 此語言不支援屬性、索引子或事件 '{0}'; 請嘗試直接呼叫存取子方法 '{1}' 或 '{2}'

# ERR_BindToBogusProp1
source: Property, indexer, or event '{0}' is not supported by the language; try directly calling accessor method '{1}'
cs: Vlastnost, indexer nebo událost {0} nejsou tímto jazykem podporované. Zkuste přímo volat metodu přistupujícího objektu {1}.
de: Die Eigenschaft, der Indexer oder das Ereignis "{0}" wird von der Sprache nicht unterstützt. Rufen Sie die {1}-Accessormethode direkt auf.
es: El idioma no admite la propiedad, el indizador o el evento '{0}'; intente llamar directamente al método del descriptor de acceso '{1}'
fr: La propriété, l'indexeur ou l'événement '{0}' n'est pas pris en charge par le langage ; essayez d'appeler directement la méthode d'accesseur '{1}'
it: La proprietà, l'indicizzatore o l'evento '{0}' non è supportato dal linguaggio. Provare a chiamare direttamente il metodo della funzione di accesso '{1}'
ja: プロパティ、インデクサー、またはイベント '{0}' はこの言語でサポートされていません。アクセサー メソッドの '{1}' を直接呼び出してください
ko: {0}' 속성, 인덱서 또는 이벤트는 이 언어에서 지원되지 않습니다. '{1}' 접근자 메서드를 직접 호출해 보세요.
pl: Właściwość, indeksator lub zdarzenie „{0}” nie jest obsługiwane przez język. Spróbuj bezpośrednio wywołać metodę dostępu „{1}”.
pt_br: O idioma não dá suporte à propriedade, ao indexador ou ao evento "{0}"; tente chamar diretamente o método de acessador "{1}"
ru: Свойство, индексатор или событие "{0}" не поддерживается в данном языке; попытайтесь вызвать метод доступа "{1}" напрямую.
tr: {0}' özelliği, dizin erişimcisi veya olayı dil tarafından desteklenmiyor; '{1}' erişimci yöntemini doğrudan çağırmayı deneyin
zh_hans: 属性、索引器或事件“{0}”不受现用语言支持；请尝试直接调用访问器方法“{1}”
zh_hant: 此語言不支援屬性、索引子或事件 '{0}'; 請嘗試直接呼叫存取子方法 '{1}'

# ERR_NoVoidHere
source: Keyword 'void' cannot be used in this context
cs: Klíčové slovo void nejde v tomto kontextu použít.
de: Das void-Schlüsselwort kann in diesem Kontext nicht verwendet werden.
es: La palabra clave 'void' no se puede usar en este contexto
fr: Le mot clé 'void' ne peut pas être utilisé dans ce contexte
it: Non è possibile usare la parola chiave 'void' in questo contesto
ja: キーワード void はこのコンテキストで使用できません
ko: 이 컨텍스트에는 'void' 키워드를 사용할 수 없습니다.
pl: W tym kontekście nie można użyć słowa kluczowego „void”.
pt_br: A palavra-chave 'void' não pode ser usada neste contexto
ru: Использование ключевого слова "void" в этом контексте недопустимо.
tr: void' anahtar sözcüğü bu bağlamda kullanılmaz
zh_hans: 关键字 "void" 不能在此上下文中使用
zh_hant: 在此內容中不可使用關鍵字 'void'

# ERR_IndexerNeedsParam
source: Indexers must have at least one parameter
cs: Indexery musí mít nejmíň jeden parametr.
de: Indexer müssen mindestens einen Parameter haben.
es: Los indizadores deben tener al menos un parámetro
fr: Les indexeurs doivent posséder au moins un paramètre
it: Gli indicizzatori devono avere almeno un parametro
ja: インデクサーには最低パラメーターが 1 つ必要です
ko: 인덱서에 매개 변수를 하나 이상 지정해야 합니다.
pl: Dla indeksatora trzeba zdefiniować co najmniej jeden parametr.
pt_br: Indexadores devem ter no mínimo um parâmetro
ru: Индексаторы должны иметь хотя бы один параметр.
tr: Dizin oluşturucuların en az bir parametresi olmalıdır
zh_hans: 索引器必须至少有一个参数
zh_hant: 索引子至少要有一個參數

# ERR_BadArraySyntax
source: Array type specifier, [], must appear before parameter name
cs: Před názvem parametru musí být uvedený specifikátor typu pole [].
de: Der Arraytypspezifizierer [] muss vor dem Parameternamen stehen.
es: El especificador de tipo de matriz, [], debe ir delante del nombre del parámetro
fr: Le spécificateur de type tableau, [], doit apparaître avant le nom de paramètre
it: L'identificatore del tipo matrice, [], deve trovarsi prima del nome del parametro
ja: 配列型の指定子の角かっこ、[]、は、パラメーター名の前に使用してください
ko: 배열 형식 지정자인 []은 매개 변수 이름 앞에 사용해야 합니다.
pl: Specyfikator typu tablicy — [] — musi wystąpić przed nazwą parametru.
pt_br: O especificador de tipo de matriz, [], deve aparecer antes do nome de parâmetro
ru: Спецификатор типа массива, [], должен располагаться перед именем параметра.
tr: Dizi türü belirleyicisi [], parametre adından önce gelmelidir
zh_hans: 数组类型说明符 [] 必须出现在参数名之前
zh_hant: 陣列類型規範 [] 必須出現在參數名稱之前

# ERR_BadOperatorSyntax
source: Declaration is not valid; use '{0} operator <dest-type> (...' instead
cs: Deklarace není platná. Místo toho použijte: {0} operátor <dest-type> (...
de: Ungültige Deklaration. Verwenden Sie stattdessen "{0}-Operator <Zieltyp> (...".
es: La declaración no es válida; en su lugar, use 'operador {0} <tipo de destino> (...'
fr: Déclaration non valide ; utilisez plutôt l'opérateur '{0} <dest-type> (...'
it: La dichiarazione non è valida. Usare '{0} operator <tipo distruttore> (...'
ja: 不適切な宣言です。代わりに '{0} 演算子 <dest 型> (...' を使用してください。
ko: 선언이 잘못되었습니다. 대신 '{0} operator <dest-type> (...'을 사용하세요.
pl: Nieprawidłowa deklaracja; zamiast niej użyj konstrukcji „{0} operator <typ_docelowy> (...”
pt_br: Declaração não é válida; ao invés disso, use "{0} operador <dest-type> (..."
ru: Объявление недействительно; используйте "{0} оператор <результирующий тип> (..." вместо
tr: Bildirim geçerli değil; bunun yerine '{0} işleç < hedef-tür> (...' kullanın
zh_hans: 声明无效；请改用“{0} operator <dest-type> (...”
zh_hant: 宣告無效; 請改用 '{0} operator <dest-type> (...'。

# ERR_MainClassNotFound
source: Could not find '{0}' specified for Main method
cs: Prvek {0} zadaný pro metodu Main se nenašel.
de: "{0}", angegeben für die Main-Methode, konnte nicht gefunden werden.
es: No se encontró '{0}' especificado para el método Main
fr: {0}' spécifié pour la méthode Main est introuvable
it: Non è stato trovato l'elemento '{0}' specificato per il metodo Main
ja: Main メソッドに指定された '{0}' が見つかりませんでした
ko: Main 메서드에 지정된 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć elementu „{0}” określonego dla metody Main
pt_br: Não foi possível encontrar "{0}" especificado para o método Main
ru: Не удалось найти "{0}", определенного для метода Main.
tr: Main yöntemi için belirtilen '{0}' bulunamadı
zh_hans: 未能找到为 Main 方法指定的“{0}”
zh_hant: 找不到為 Main 方法所指定的 '{0}'

# ERR_MainClassNotClass
source: '{0}' specified for Main method must be a non-generic class, record, struct, or interface
cs: Typ {0} zadaný pro metodu Main musí být neobecná třída, záznam, struktura nebo rozhraní.
fr: Le '{0}' spécifié pour la méthode Main doit être une classe, un enregistrement, un struct ou une interface non générique
it: L'elemento '{0}' specificato per il metodo Main deve essere una classe, un record, un'interfaccia o uno struct non generico valido
ja: Main メソッドに指定された '{0}' は、非ジェネリックのクラス、レコード、構造体、またはインターフェイスでなければなりません
pl: Element „{0}” określony dla metody Main musi być nieogólną klasą, rekordem, strukturą lub interfejsem
pt_br: O '{0}' especificado para o método Main precisa ser uma classe, um registro, um struct ou uma interface não genérica
ru: "{0}", определенный для метода Main, должен быть неуниверсальным классом, записью, структурой или интерфейсом.
zh_hans: 为 Main 方法指定的“{0}”必须是非泛型类、记录、结构或接口
zh_hant: 為 Main 方法指定的 '{0}' 必須為非泛型類別、記錄、結構或介面

# ERR_NoMainInClass
source: '{0}' does not have a suitable static 'Main' method
cs: {0} nemá vhodnou statickou metodu Main.
de: '"{0}" hat keine passende statische Main-Methode.
es: "{0}" no tiene un método "Main" estático adecuado.
fr: '{0}' n'a pas de méthode 'Main' statique appropriée
it: '{0}' non contiene un metodo 'Main' statico appropriato
ja: '{0}' は適切な静的 Main メソッドを含んでいません
ko: '{0}'에 적합한 정적 Main 메서드가 없습니다.
pl: Element „{0}” nie ma odpowiedniej statycznej metody „Main”
pt_br: '{0}' não tem um método 'Main' estático adequado
ru: "{0}" не имеет подходящего статического метода Main.
tr: '{0}' uygun bir statik Main yöntemine sahip değil
zh_hans: “{0}”没有合适的静态 'Main' 方法
zh_hant: '{0}' 沒有適合的靜態 Main 方法

# ERR_OutputNeedsName
source: Outputs without source must have the /out option specified
cs: U výstupu bez zdroje musí být zadaný přepínač /out.
de: Für Ausgaben ohne Quelle muss die Option /out angeben werden.
es: Los resultados sin origen deben tener la opción /out especificada
fr: L'option /out doit être spécifiée pour les sorties dépourvues de source
it: Per gli output senza origine occorre specificare l'opzione /out
ja: ソースのない出力には、/out オプションを指定しなければなりません
ko: 소스 없는 출력의 경우 /out 옵션을 지정해야 합니다.
pl: Dla wyjść bez źródła trzeba określić opcję /out.
pt_br: Saídas sem origem devem ter a opção /out especificada
ru: Для создания результирующего файла без исходных текстов должен быть задан параметр /out.
tr: Kaynağı olmayan çıkışlar için /out seçeneği belirtilmelidir
zh_hans: 必须为没有源的输出指定 /out 选项
zh_hant: 沒有來源的輸出必須有指定的 /out 選項

# ERR_CantHaveWin32ResAndManifest
source: Conflicting options specified: Win32 resource file; Win32 manifest
cs: Jsou zadané konfliktní možnosti: soubor prostředků Win32, manifest Win32.
de: Die angegebenen Optionen führen zu einem Konflikt: Win32-Ressourcendatei; Win32-Manifest
es: Se especificaron opciones que están en conflicto: archivo de recursos de Win32; manifiesto de Win32
fr: Options spécifiées en conflit : fichier de ressources Win32 ; manifeste Win32
it: Sono state specificate opzioni in conflitto: file di risorse Win32; manifesto Win32
ja: 競合するオプションが指定されました: Win32 リソース ファイル、Win32 マニフェスト
ko: Win32 리소스 파일과 Win32 매니페스트는 서로 충돌하므로 함께 지정할 수 없습니다.
pl: Określono opcje powodujące konflikt: plik zasobów Win32; manifest Win32
pt_br: Opções de conflito especificadas: Arquivo de recurso Win32; manifesto Win32
ru: Заданы несовместимые параметры: файл ресурсов Win32; манифест Win32.
tr: Çakışan seçenekler belirtildi: Win32 kaynak dosyası; Win32 bildirimi
zh_hans: 指定了冲突的选项: Win32 资源文件；Win32 清单
zh_hant: 指定的選項衝突: Win32 資源檔; Win32 資訊清單

# ERR_CantHaveWin32ResAndIcon
source: Conflicting options specified: Win32 resource file; Win32 icon
cs: Jsou zadané konfliktní možnosti: soubor prostředků Win32, ikona Win32.
de: Die angegebenen Optionen führen zu einem Konflikt: Win32-Ressourcendatei; Win32-Symbol
es: Se especificaron opciones conflictivas: archivo de recursos de Win32; icono de Win32
fr: Options spécifiées en conflit : fichier de ressources Win32 ; icône Win32
it: Sono state specificate opzioni in conflitto: file di risorse Win32; icona Win32
ja: 競合するオプションが指定されました: Win32 リソース ファイル、Win32 アイコン
ko: Win32 리소스 파일과 Win32 아이콘 옵션은 서로 충돌하므로 함께 지정할 수 없습니다.
pl: Określono opcje powodujące konflikt: plik zasobów Win32; ikona Win32.
pt_br: Opções conflitantes especificadas: arquivo de recursos do Win32; ícone do Win32
ru: Заданы несовместимые параметры: файл ресурсов Win32; значок Win32.
tr: Çakışan seçenekler belirtildi: Win32 kaynak dosyası; Win32 simgesi
zh_hans: 指定的选项冲突: Win32 资源文件；Win32 图标
zh_hant: 指定的選項衝突: Win32 資源檔; Win32 圖示

# ERR_CantReadResource
source: Error reading resource '{0}' -- '{1}'
cs: Chyba při čtení prostředku {0} -- {1}
de: Fehler beim Lesen der Ressource "{0}": "{1}"
es: Error al leer el recurso '{0}': '{1}'
fr: Erreur lors de la lecture de la ressource '{0}' -- '{1}'
it: Si è verificato un errore durante la lettura della risorsa '{0}' - '{1}'
ja: リソース '{0}' を読み込み中にエラーが発生しました -- '{1}'
ko: {0}' 리소스 파일을 읽는 동안 오류가 발생했습니다. '{1}'
pl: Błąd podczas odczytywania zasobu „{0}” — „{1}”
pt_br: Erro ao ler o recurso "{0}" -- "{1}"
ru: Ошибка чтения ресурса "{0}" — "{1}".
tr: {0}' kaynağı okunurken hata -- '{1}'
zh_hans: 读取资源“{0}”时出错 --“{1}”
zh_hant: 讀取資源 '{0}' 時發生錯誤 -- '{1}'
