Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_EscapeStackAlloc
source: A result of a stackalloc expression of type '{0}' cannot be used in this context because it may be exposed outside of the containing method
cs: Výsledek výrazu stackalloc typu {0} nejde v tomto kontextu použít, protože může být vystavený mimo obsahující metodu.
de: Ein Ergebnis eines stackalloc-Ausdrucks vom Typ "{0}" kann in diesem Kontext nicht verwendet werden, weil es dadurch möglicherweise außerhalb der enthaltenden Methode verfügbar gemacht wird.
es: El resultado de una expresión stackalloc de tipo "{0}" no se puede usar en este contexto porque puede exponerse fuera del método contenedor.
fr: Impossible d'utiliser un résultat d'une expression stackalloc de type '{0}' dans ce contexte, car il peut être exposé en dehors de la méthode conteneur
it: Non è possibile usare un risultato di un'espressione a stackalloc di tipo '{0}' in questo contesto perché potrebbe essere esposta all'esterno del metodo che la contiene
ja: stackalloc 式の型 '{0}' の結果は、それを含んでいるメソッドの外部に公開される可能性があるため、このコンテキストでは使用できません
ko: {0}' 형식 stackalloc 식의 결과는 포함하는 메서드 외부에 노출되는 있으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: Nie można używać wyniku wyrażenia stackalloc typu „{0}” w tym kontekście, ponieważ może zostać ujawniony poza metodą zawierającą
pt_br: Um resultado de uma expressão stackalloc do tipo '{0}' não pode ser usado nesse contexto porque ele pode ser exposto fora do método que o contém
ru: Результат выражения stackalloc типа "{0}" нельзя использовать в этом контексте, так как он может быть доступен вне содержащего метода.
tr: {0}' türündeki bir stackalloc ifadesinin sonucu, içerik metodunun dışında kullanıma sunulabileceğinden bu bağlamda kullanılamaz
zh_hans: 不能在此上下文中使用类型“{0}”的 stackalloc 表达式的结果，因为它可能会在包含方法以外公开
zh_hant: 無法在此內容中使用類型 '{0}' 的 stackalloc 運算式結果，因為它會公開在包含方法之外

# ERR_InitializeByValueVariableWithReference
source: Cannot initialize a by-value variable with a reference
cs: Proměnnou podle hodnoty nejde inicializovat odkazem.
de: Eine by-value-Variable kann nicht mit einem Verweis initialisiert werden.
es: No se puede inicializar una variable por valor con una referencia.
fr: Impossible d'initialiser une variable par valeur avec une référence
it: Non è possibile inizializzare una variabile per valore con un riferimento
ja: 参照を使用して値渡し変数を初期化することはできません
ko: 참조를 사용하여 값 형식 변수를 초기화할 수 없습니다.
pl: Nie można zainicjować zmiennej dostępnej przez wartość za pomocą odwołania
pt_br: Não é possível inicializar uma variável by-value com uma referência
ru: Невозможно инициализировать ссылкой переменную по значению
tr: Değere göre değişken, bir başvuru ile başlatılamaz
zh_hans: 无法使用引用初始化按值变量
zh_hant: 無法使用參考將傳值變數初始化

# ERR_InitializeByReferenceVariableWithValue
source: Cannot initialize a by-reference variable with a value
cs: Proměnnou podle odkazu nejde inicializovat hodnotou.
de: Eine by-reference-Variable kann nicht mit einem Wert initialisiert werden.
es: No se puede inicializar una variable por referencia con un valor.
fr: Impossible d'initialiser une variable par référence avec une valeur
it: Non è possibile inizializzare una variabile per riferimento con un valore
ja: 値を使用して参照渡し変数を初期化することはできません
ko: 값을 사용하여 참조 형식 변수를 초기화할 수 없습니다.
pl: Nie można zainicjować zmiennej dostępnej przez odwołanie za pomocą wartości
pt_br: Não é possível inicializar uma variável por referência com um valor
ru: Невозможно инициализировать значением переменную по ссылке
tr: Başvuruya göre değişken, bir değer ile başlatılamaz
zh_hans: 无法使用值初始化按引用变量
zh_hant: 無法使用值將傳址變數初始化

# ERR_RefAssignmentMustHaveIdentityConversion
source: The expression must be of type '{0}' because it is being assigned by reference
cs: Výraz musí být typu {0}, protože se přiřazuje pomocí odkazu.
de: Der Ausdruck muss vom Typ "{0}" sein, weil er als Verweis zugewiesen wird.
es: La expresión debe ser de tipo '{0}' porque se asigna por referencia.
fr: L'expression doit être de type '{0}', car elle est assignée par référence
it: L'espressione deve essere di tipo '{0}' perché verrà assegnata per riferimento
ja: 式は参照渡しで割り当てられるため、型 '{0}' でなければなりません
ko: 이 식은 참조로 할당 중이므로 '{0}' 형식이어야 합니다.
pl: Wyrażenie musi być typu „{0}”, ponieważ jest przypisywane przez referencję
pt_br: A expressão deve ser do tipo '{0}' porque ela está sendo atribuída por referência
ru: Выражение должно иметь тип "{0}", так как ему назначается значение по ссылке
tr: İfade başvuru ile atandığından '{0}' türünde olmalıdır
zh_hans: 表达式必须为“{0}”类型，因为它通过引用赋值
zh_hant: 運算式的類型必須是類型 '{0}'，因為其藉傳址方式指派

# ERR_ByReferenceVariableMustBeInitialized
source: A declaration of a by-reference variable must have an initializer
cs: Deklarace proměnné podle odkazu musí mít inicializátor.
de: Eine Deklaration einer by-reference-Variablen muss einen Initialisierer aufweisen.
es: La declaración de una variable por referencia debe tener un inicializador.
fr: Une déclaration de variable par référence doit avoir un initialiseur
it: Una dichiarazione di una variabile per riferimento deve contenere un inizializzatore
ja: 参照渡し変数の宣言には初期化子が必要です
ko: by-reference 변수의 선언에 이니셜라이저가 있어야 합니다.
pl: Deklaracja zmiennej dostępnej przez odwołanie musi mieć inicjator
pt_br: A declaração de uma variável por referência deve ter um inicializador
ru: Объявление переменной по ссылке должно иметь инициализатор
tr: Başvuruya göre değişken bildirimi bir başlatıcıya sahip olmalıdır
zh_hans: 按引用变量的声明必须有初始值设定项
zh_hant: 傳址變數的宣告必須具有初始設定式

# ERR_AnonDelegateCantUseLocal
source: Cannot use ref local '{0}' inside an anonymous method, lambda expression, or query expression
cs: Místní hodnotu odkazu {0} nejde použít uvnitř anonymní metody, výrazu lambda nebo výrazu dotazu.
de: Der lokale Verweis "{0}" kann nicht in einer anonymen Methode, einem Lambdaausdruck oder einem Abfrageausdruck verwendet werden.
es: No se puede usar la variable local de tipo ref '{0}' dentro de un método anónimo, una expresión lambda o una expresión de consulta.
fr: Impossible d'utiliser ref local '{0}' dans une méthode anonyme, une expression lambda ou une expression de requête
it: Non è possibile usare la variabile locale ref '{0}' in un metodo anonimo, in un'espressione lambda o in un'espressione di query
ja: 匿名メソッド、ラムダ式、クエリ式内で ref ローカル変数 '{0}' は使用できません
ko: 무명 메서드, 람다 식 또는 쿼리 식에는 참조 로컬 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można użyć zmiennej lokalnej typu ref „{0}” wewnątrz metody anonimowej, wyrażenia lambda ani wyrażenia zapytania
pt_br: Não é possível usar a referência local '{0}' em um método anônimo, expressão lambda ou expressão de consulta
ru: Невозможно использовать локальную переменную ref "{0}" внутри анонимного метода, лямбда-выражения или выражения запроса
tr: {0}' ref yerel değeri bir anonim metotta, lambda ifadesinde veya sorgu ifadesinde kullanılamaz
zh_hans: 不能在匿名方法、lambda 表达式或查询表达式内使用 ref 局部变量“{0}”
zh_hant: 無法在匿名方法、Lambda 運算式或查詢運算式中使用參考本機 '{0}'

# ERR_RefReturningCallAndAwait
source: A reference returned by a call to '{0}' cannot be preserved across 'await' or 'yield' boundary.
fr: Une référence renvoyée par un appel à '{0}' ne peut pas être conservée à travers la limite 'wait' ou 'yield'.
it: Non è possibile mantenere un riferimento restituito da una chiamata a '{0}' oltre il limite 'await' o 'yield'.
ja: '{0}' への呼び出しによって返された参照は、'await' または 'yield' 境界を越えて保持することはできません。
pl: Odwołanie zwrócone przez wywołanie „{0}” nie może zostać zachowane w granicach „await” lub „yield”.
pt_br: Uma referência retornada por uma chamada para '{0}' não pode ser preservada no limite 'await' ou 'yield'.
ru: Ссылка, возвращенная вызовом ' {0} ', не может быть сохранена за границей 'wait' или 'yield'.
zh_hans: 调用“{0}”所返回的引用不能跨 "await" 或 "yield" 边界保留。
zh_hant: 對 '{0}' 之呼叫所傳回的參考無法在 'await' 或 'yield' 界限間保留。

# ERR_RefConditionalAndAwait
source: 'await' cannot be used in an expression containing a ref conditional operator
cs: 'Await nejde použít ve výrazu, který obsahuje podmíněný operátor REF.
de: '"await" kann nicht in einem Ausdruck mit einem bedingten ref-Operator verwendet werden.
es: 'No se puede usar "await" en una expresión que contiene un operador condicional ref.
fr: 'await' ne peut pas être utilisé dans une expression contenant un opérateur conditionnel ref
it: 'Non è possibile usare 'await' in un'espressione contenente un operatore condizionale ref
ja: 'await' は、ref 条件演算子を含む式の中で使用できません
ko: 'ref 조건 연산자를 포함하는 식에는 'await'를 사용할 수 없습니다.
pl: 'Element „await” nie może być używany w wyrażeniu zawierającym operator warunkowy ref
pt_br: 'await' não pode ser usado em uma expressão que contém um operador condicional de referência
ru: 'await не может использоваться в выражении, содержащем условный оператор ref
tr: 'await', başvuru koşullu operatörü içeren bir deyim içinde kullanılamaz
zh_hans: '不能在包含 ref 条件运算符的表达式中使用 "await"
zh_hant: '包含 ref 條件運算子的運算式無法使用 'await'

# ERR_RefConditionalNeedsTwoRefs
source: Both conditional operator values must be ref values or neither may be a ref value
cs: Obě hodnoty podmíněného operátoru musí být hodnoty ref nebo ani jedna z nich nesmí být hodnota ref.
de: Entweder beide bedingten Operatorwerte müssen ref-Werte sein oder keiner von beiden.
es: Ambos valores de operador condicional deben ser valores ref o ninguno de ellos debe ser un valor ref.
fr: Les deux valeurs d'opérateur conditionnel doivent être des valeurs ref. Sinon, aucune d'elles ne doit être une valeur ref
it: Entrambi i valori dell'operatore condizionale devono essere valori ref, altrimenti nessuno potrà esserlo
ja: 条件演算子の両辺の値は、両方とも ref 値にするか、両方とも ref 以外の値にする必要があります
ko: 조건 연산자 값은 모두 ref 값이거나 모두 ref 값이 아니어야 합니다.
pl: Obie wartości operatora warunkowego muszą być wartościami ref lub żadna z nich nie może być wartością ref
pt_br: Ambos os valores de operador condicional devem ser valores de referência ou nenhum pode ser um valor de referência
ru: Либо оба значения ссылочного оператора должны быть ссылочными, либо ни одно из них не должно быть ссылочным
tr: Her iki koşul operatörü değeri de başvuru değeri olmalı ya da hiçbiri başvuru değeri olmamalıdır
zh_hans: 这两个条件运算符的值必须都是 ref 值或者都不是 ref 值
zh_hant: 這兩個條件運算子的值都必須是 ref 值，或兩個都不是 ref 值

# ERR_RefConditionalDifferentTypes
source: The expression must be of type '{0}' to match the alternative ref value
cs: Výraz musí být typu {0}, aby odpovídal alternativní hodnotě ref.
de: Der Ausdruck muss vom Typ "{0}" sein, um dem alternativen ref-Wert zu entsprechen.
es: La expresión debe ser de tipo "{0}" para que coincida con el valor ref alternativo.
fr: L'expression doit être de type '{0}' pour correspondre à la valeur ref de remplacement
it: L'espressione deve essere di tipo '{0}' per essere uguale al valore ref alternativo
ja: 式は、代替 ref 値と一致するために、型 '{0}' である必要があります
ko: 대체 ref 값과 일치하려면 식이 '{0}' 형식이어야 합니다.
pl: Wyrażenie musi być typu „{0}”, aby było zgodne z alternatywną wartością ref
pt_br: A expressão deve ser do tipo '{0}' para corresponder ao valor de referência alternativo
ru: Для соответствия альтернативному ссылочному значению выражение должно иметь тип "{0}"
tr: Alternatif başvuru değeriyle eşleşmesi için deyimin '{0}' türünde olması gerekir
zh_hans: 表达式必须为与替代 ref 值相匹配的类型“{0}”
zh_hant: 運算式類型必須是 '{0}'，才符合替代的 ref 值

# ERR_ExpressionTreeContainsLocalFunction
source: An expression tree may not contain a reference to a local function
cs: Strom výrazů nesmí obsahovat odkaz na místní funkci.
de: Eine Ausdrucksbaumstruktur enthält möglicherweise keinen Verweis auf eine lokale Funktion.
es: Un árbol de expresión no puede contener una referencia a una función local.
fr: Une arborescence de l'expression ne peut pas contenir de référence à une fonction locale
it: Un albero delle espressioni non può contenere un riferimento a una funzione locale
ja: 式ツリーには、ローカル関数への参照が含まれていない可能性があります
ko: 식 트리에는 로컬 함수에 대한 참조를 포함할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać odwołania do funkcji lokalnej
pt_br: Uma árvore de expressão não pode conter uma referência a uma função local
ru: Дерево выражений не может содержать ссылку на локальную функцию
tr: İfade ağacı, bir yerel işleve başvuru içeremez
zh_hans: 表达式树不能包含对本地函数的引用
zh_hant: 運算式樹狀目錄不可包含區域函式的參考

# ERR_DynamicLocalFunctionParamsParameter
source: Cannot pass argument with dynamic type to params parameter '{0}' of local function '{1}'.
cs: Nejde předat argument dynamického typu s parametrem params {0} místní funkce {1}.
de: Ein Argument mit einem dynamischen Typ kann nicht an den params-Parameter "{0}" der lokalen Funktion "{1}" übergeben werden.
es: No se puede pasar un argumento de tipo dinámico al parámetro params '{0}' de la función local '{1}'.
fr: Impossible de passer un argument avec un type dynamique au paramètre params '{0}' de la fonction locale '{1}'.
it: Non è possibile passare l'argomento con tipo dinamico al parametro params '{0}' della funzione locale '{1}'.
ja: 動的な型の引数をローカル 関数 '{1}' の params パラメーター '{0}' に渡すことはできません。
ko: 동적 형식의 인수를 로컬 함수 '{1}'의 params 매개 변수 '{0}'에 전달할 수 없습니다.
pl: Nie można przekazać argumentu z dynamicznym typem do parametru params „{0}” lokalnej funkcji „{1}”.
pt_br: Não é possível passar argumento com tipo dinâmico para parâmetro params '{0}' da função local '{1}'.
ru: Нельзя передать аргумент динамического типа в параметр params "{0}" локальной функции "{1}".
tr: Dinamik türdeki bağımsız değişken, '{1}' yerel işlevinin '{0}' params parametresine geçirilemez.
zh_hans: 不能将具有动态类型的实参传递给本地函数“{1}”的 params 形参“{0}”。
zh_hant: 無法將具有動態類型的引數傳遞給本機函式 '{1}' 的 params 參數 '{0}'。

# SyntaxTreeIsNotASubmission
source: Syntax tree should be created from a submission.
cs: Strom syntaxe by se měl vytvořit z odeslání.
de: Der Syntaxbaum sollte aus einer Übermittlung erstellt werden.
es: El árbol de sintaxis debe crearse desde un envío.
fr: L'arborescence de syntaxe doit être créée à partir d'une soumission.
it: L'albero della sintassi deve essere creato da un invio.
ja: 構文ツリーは、送信から作成する必要があります。
ko: 구문 트리가 전송에서 만들어져야 합니다.
pl: Drzewo składni powinno zostać utworzone na podstawie przesłanych danych.
pt_br: A árvore de sintaxe deve ser criada de uma submissão.
ru: Дерево синтаксиса должно быть создано из отправки.
tr: Söz dizimi ağacı bir göndermeden oluşturulmalıdır.
zh_hans: 应从提交创建语法树。
zh_hant: 提交時就應該建立語法樹狀結構。

# ERR_TooManyUserStrings
source: Combined length of user strings used by the program exceeds allowed limit. Try to decrease use of string literals or try the EXPERIMENTAL feature flag 'experimental-data-section-string-literals'.
fr: La longueur combinée des chaînes utilisateur utilisées par le programme dépasse la limite autorisée. Essayez de réduire l’utilisation des chaînes de caractères ou essayez l’option EXPÉRIMENTALE « experimental-data-section-string-literals ».
it: La lunghezza combinata delle stringhe utente usate dal programma supera il limite consentito. Provare a ridurre l'uso dei valori letterali stringa o provare il flag di funzionalità SPERIMENTALE "experimental-data-section-string-literals".
pt_br: O comprimento combinado de cadeias de caracteres de usuário usado pelo programa excede o limite permitido. Tente diminuir o uso de literais de cadeia de caracteres ou experimente o sinalizador de recurso EXPERIMENTAL 'experimental-data-section-string-literals'.
ru: Объединенная длина пользовательских строк, используемых программой, превышает допустимый предел. Попробуйте уменьшить использование строковых литералов или попробуйте ЭКСПЕРИМЕНТАЛЬНЫЙ флаг функции "experimental-data-section-string-literals".
zh_hans: 该程序所使用的用户字符串的合并后长度超出所允许的限制。请尝试减少字符串文本的使用，或试用 EXPERIMENTAL 功能标志 ‘experimental-data-section-string-literals’。

# ERR_PatternNullableType
source: It is not legal to use nullable type '{0}?' in a pattern; use the underlying type '{0}' instead.
cs: Ve vzoru se nepovoluje použití typu s možnou hodnotou null {0}?. Místo toho použijte základní typ {0}.
fr: Il n'est pas correct d'utiliser le type Nullable '{0}?' dans un modèle. Utilisez le type sous-jacent '{0}' à la place.
it: Non è consentito usare il tipo nullable '{0}?' in un criterio. Usare il tipo sottostante '{0}'.
ja: パターンで Null 許容型 '{0}?' を使用することはできません。代わりに基になる型 '{0}' をご使用ください。
pl: Użycie typu dopuszczającego wartość null „{0}?” jest niedozwolone we wzorcu. Użyj zamiast tego bazowego typu „{0}”.
pt_br: É ilegal usar o tipo que permite valor nulo '{0}?' em um padrão. Nesse caso, use o tipo subjacente '{0}'.
ru: В шаблоне не может использоваться тип "{0}", допускающий значение NULL. Используйте вместо него базовый тип "{0}".
zh_hans: 在模式中使用可以为 null 的类型“{0}?”是非法的；请改用基础类型“{0}”。
zh_hant: 在樣式中使用可為 Null 的類型 '{0}' 不合法。請改用基礎類型 '{0}'。

# ERR_PeWritingFailure
source: An error occurred while writing the output file: {0}.
cs: Při zápisu výstupního souboru došlo k chybě: {0}.
de: Fehler beim Schreiben der Ausgabedatei: {0}.
es: Error al escribir en el archivo de salida: {0}.
fr: Une erreur s'est produite durant l'écriture du fichier de sortie : {0}.
it: Si è verificato un errore durante la scrittura del file di output: {0}.
ja: 出力ファイルの書き込み中にエラーが発生しました: {0}。
ko: 출력 파일을 쓰는 동안 오류가 발생함: {0}.
pl: Wystąpił błąd podczas zapisywania pliku wyjściowego: {0}.
pt_br: Ocorreu um erro ao gravar o arquivo de saída: {0}.
ru: Произошла ошибка при записи выходного файла: {0}.
tr: Çıkış dosyası yazılırken hata oluştu: {0}.
zh_hans: 写入输出文件时出错: {0}。
zh_hant: 寫入輸出檔案時發生錯誤: {0}。

# ERR_TupleDuplicateElementName
source: Tuple element names must be unique.
cs: Názvy elementů řazené kolekce členů musí být jedinečné.
de: Tupelelementnamen müssen eindeutig sein.
es: Los nombres de elemento de tupla deben ser únicos.
fr: Les noms d'éléments d'un tuple doivent être uniques.
it: I nomi di elementi di tupla devono essere univoci.
ja: タプル要素名は一意である必要があります。
ko: 튜플 요소 이름은 고유해야 합니다.
pl: Nazwy elementów krotek muszą być unikatowe.
pt_br: Os nomes de elemento de tupla devem ser exclusivos.
ru: Имена элементов кортежа должны быть уникальными.
tr: Demet öğesi adları benzersiz olmalıdır.
zh_hans: 元组元素名称必须是唯一的。
zh_hant: 元組元素名稱不得重複。

# ERR_TupleReservedElementName
source: Tuple element name '{0}' is only allowed at position {1}.
cs: Název elementu řazené kolekce členů {0} je povolený jenom v pozici {1}.
de: Der Tupelelementname "{0}" ist nur an Position {1} zulässig.
es: El nombre '{0}' del elemento de tupla solo se permite en la posición {1}.
fr: Le nom d'élément de tuple '{0}' est uniquement autorisé à la position {1}.
it: Il nome di elemento di tupla '{0}' è consentito solo alla posizione {1}.
ja: タプル要素名 '{0}' は位置 {1} でのみ使用できます。
ko: 튜플 요소 이름 '{0}'은(는) {1} 위치에서만 허용됩니다.
pl: Nazwa elementu krotki „{0}“ jest dozwolona tylko na pozycji {1}.
pt_br: O nome do elemento de tupla '{0}' é permitido somente na posição {1}.
ru: Имя элемента кортежа "{0}" допускается только в позиции {1}.
tr: {0}' demet öğesi adına yalnızca {1} konumunda izin verilir.
zh_hans: 只允许位置 {1} 使用元组元素名称“{0}”。
zh_hant: 只有位置 {1} 允許元組元素名稱 '{0}'。

# ERR_TupleReservedElementNameAnyPosition
source: Tuple element name '{0}' is disallowed at any position.
cs: Název elementu řazené kolekce členů {0} je zakázaný v jakékoliv pozici.
de: Der Tupelelementname "{0}" ist an keiner Position zulässig.
es: El nombre '{0}' del elemento de tupla no se permite en ninguna posición.
fr: Le nom d'élément de tuple '{0}' est interdit à toutes les positions.
it: Il nome di elemento di tupla '{0}' non è consentito in nessuna posizione.
ja: タプル要素名 '{0}' はいずれの位置でも使用できません。
ko: 튜플 요소 이름 '{0}'은(는) 어떤 위치에서도 허용되지 않습니다.
pl: Nazwa elementu krotki „{0}“ nie jest dozwolona na żadnej pozycji.
pt_br: O nome do elemento de tupla '{0}' não é permitido em qualquer posição.
ru: Имя элемента кортежа "{0}" не допускается ни в одной позиции.
tr: {0}' demet öğesi adına hiçbir konumda izin verilmez.
zh_hans: 任何位置都不允许使用元组元素名称“{0}”。
zh_hant: 任何位置都不允許元組元素名稱 '{0}'。

# ERR_PredefinedTypeMemberNotFoundInAssembly
source: Member '{0}' was not found on type '{1}' from assembly '{2}'.
cs: Nenašel se člen {0} v typu {1} ze sestavení {2}.
de: Der Member "{0}" wurde für den Typ "{1}" in der Assembly "{2}" nicht gefunden.
es: El miembro '{0}' no se encontró en el tipo '{1}' del ensamblado '{2}'.
fr: Le membre '{0}' est introuvable sur le type '{1}' de l'assembly '{2}'.
it: Il membro '{0}' non è stato trovato nel tipo '{1}' dell'assembly '{2}'.
ja: メンバー '{0}' はアセンブリ '{2}' の型 '{1}' に見つかりませんでした。
ko: 어셈블리 '{2}'에서 형식 '{1}'의 멤버 '{0}'이(가) 발견되지 않았습니다.
pl: Nie znaleziono składowej „{0}” dla typu „{1}” z zestawu „{2}”.
pt_br: O membro '{0}' não foi encontrado no tipo '{1}' do assembly '{2}'.
ru: Член "{0}" не найден в типе "{1}" из сборки "{2}".
tr: {2}' bütünleştirilmiş kodundaki '{1}' türü üzerinde '{0}' üyesi bulunamadı.
zh_hans: 未在程序集“{2}”中找到类型“{1}”上的成员“{0}”。
zh_hant: 在組件 '{2}' 的類型 '{1}' 上找不到成員 '{0}'。

# IDS_FeatureTuples
source: tuples
cs: řazené kolekce členů
de: Tupel
es: tuplas
it: tuple
ja: タプル
ko: 튜플
pl: krotki
pt_br: tuplas
ru: кортежи
tr: demetler
zh_hans: 元组
zh_hant: 元組

# ERR_MissingDeconstruct
source: No suitable 'Deconstruct' instance or extension method was found for type '{0}', with {1} out parameters and a void return type.
cs: Pro typ {0} s výstupními parametry ({1}) a návratovým typem void se nenašla žádná vhodná instance Deconstruct nebo rozšiřující metoda.
de: Für den Typ "{0}" mit {1} out-Parametern und einem void-Rückgabetyp wurde keine passende Dekonstruktionsinstanz oder Erweiterungsmethode gefunden.
es: No se encontró un método de extensión o instancia "Deconstruct" adecuado para el tipo "{0}", con {1} parámetros out y un tipo de valor devuelto void.
fr: Instance ou méthode d'extension 'Deconstruct' appropriée introuvable pour le type '{0}', avec les paramètres de sortie {1} et un type de retour void.
it: Non sono stati trovati metodi di estensione o istanze di 'Deconstruct' idonee per il tipo '{0}', con {1} parametri out e un tipo restituito void.
ja: {1} out パラメーターと void 戻り値の型を持つ、型 '{0}' の適切な分解インスタンスまたは拡張メソッドが見つかりませんでした。
ko: {1} out 매개 변수 및 void 반환 형식을 사용하는 '{0}' 형식에 대한 적절한 분해 인스턴스 또는 확장 메서드를 찾을 수 없습니다.
pl: Nie znaleziono odpowiedniego wystąpienia „Deconstruct” lub metody rozszerzenia dla typu „{0}” z {1} parametrami wyjściowymi i typem zwracanym void.
pt_br: Nenhuma instância nem método de extensão 'Deconstruct' adequado foi localizado para o tipo '{0}' com {1} parâmetros de saída e um tipo de retorno nulo.
ru: Для типа "{0}" не найден подходящий экземпляр деконструкции или метод расширения с типом возвращаемого значения void и следующим числом параметров out: {1}.
tr: {0}' türü için {1} out parametresi ve void dönüş türü içeren uygun Deconstruct örneği veya genişletme metodu bulunamadı.
zh_hans: 找不到类型“{0}”适用的 Deconstruct 实例或扩展方法，输出参数为 {1}，返回类型为 void。
zh_hant: 使用 {1} out 參數及 void 傳回型別找不到適合類型 '{0}' 的解構執行個體或擴充方法。

# ERR_DeconstructRequiresExpression
source: Deconstruct assignment requires an expression with a type on the right-hand-side.
cs: Dekonstrukční přiřazení vyžaduje výraz s typem na pravé straně.
de: Für die Dekonstruktionszuweisung ist ein Ausdruck mit einem Typ auf der rechten Seite erforderlich.
es: La asignación de deconstrucción requiere una expresión con un tipo en el lado derecho.
fr: L'assignation de déconstruction nécessite une expression avec un type du côté droit.
it: L'assegnazione di decostruzione richiede un'espressione con un tipo sul lato destro.
ja: 分解の代入には、右側の型を持つ式が必要です。
ko: 할당을 분해하려면 오른쪽에 형식이 있는 식이 필요합니다.
pl: Przypisanie dekonstrukcji wymaga wyrażenia o typie podanym po prawej stronie.
pt_br: Desconstruir uma atribuição requer uma expressão com um tipo no lado direito.
ru: Назначению деконструкции требуется выражение с типом справа.
tr: Ayrıştırma ataması sağ tarafında tür bulunan bir ifade gerektirir.
zh_hans: 析构任务要求表达式属于右侧的某个类型。
zh_hant: 需要具有右邊類型的運算式，才能解構指派。
