Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_IllegalFixedType
source: Fixed size buffer type must be one of the following: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float or double
cs: Typ vyrovnávací paměti pevné velikosti musí být následující: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float nebo double.
de: Puffer fester Größe müssen einen der folgenden Typen aufweisen: "bool", "byte", "short", "int", "long", "char", "sbyte", "ushort", "uint", "ulong", "float" oder "double".
es: El tipo de búfer de tamaño fijo debe pertenecer a uno de los tipos siguientes: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float o double
fr: Le type de mémoire tampon de taille fixe doit être : bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float ou double
it: Il tipo di buffer a dimensione fissa deve essere uno dei seguenti: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float o double
ja: 固定サイズ バッファーの型は次のうちの 1 つでなければなりません: bool、byte、short、int、long、char、sbyte、ushort、uint、ulong、float または double
ko: 고정 크기 버퍼는 bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float 또는 double 형식 중 하나여야 합니다.
pl: Typ buforu o ustalonym rozmiarze musi być jednym z następujących typów: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float lub double.
pt_br: Tipo de buffer de tamanho fixo deve ser um dos valores a seguir: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float ou doublé
ru: Тип буфера фиксированного размера должен входить в следующий список: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float или double.
tr: Sabit boyutlu arabellek türü şunlardan biri olmalıdır: bool, byte, short, int, long, char, sbyte, ushort, uint, ulong, float veya double
zh_hans: 固定大小的缓冲区类型必须为下列类型之一: bool、byte、short、int、long、char、sbyte、ushort、uint、ulong、float 或 double
zh_hant: 固定大小緩衝區類型必須是下列其中一項: bool、byte、short、int、long、char、sbyte、ushort、uint、ulong、float 或 double

# ERR_FixedOverflow
source: Fixed size buffer of length {0} and type '{1}' is too big
cs: Vyrovnávací paměť pevné velikosti s délkou {0} a typem {1} je moc velká.
de: Der Puffer fester Größe mit Länge "{0}" und vom Typ "{1}" ist zu groß.
es: El búfer de tamaño fijo de longitud {0} y tipo '{1}' es demasiado grande
fr: La mémoire tampon de taille fixe de longueur {0} et de type '{1}' est trop volumineuse
it: Il buffer a dimensione fissa di lunghezza {0} e di tipo '{1}' è troppo grande
ja: 長さ {0}、型 '{1}' の固定サイズ バッファーは大きすぎます
ko: 길이가 {0}인 '{1}' 형식의 고정 크기 버퍼가 너무 큽니다.
pl: Bufor o ustalonym rozmiarze o długości {0} i typie „{1}” jest za duży
pt_br: Buffer de tamanho fixo de comprimento {0} e tipo "{1}" é muito grande
ru: Буфер фиксированного размера с длиной {0} и типом "{1}" слишком велик.
tr: {0} uzunluğu ve '{1}' türünün sabit boyutlu arabelleği çok büyük
zh_hans: 长度为 {0}、类型为“{1}”的固定大小缓冲区太大
zh_hant: 長度為 {0} 且類型為 '{1}' 的固定大小緩衝區太大

# ERR_InvalidFixedArraySize
source: Fixed size buffers must have a length greater than zero
cs: Vyrovnávací paměti pevné velikosti mají délku větší než nula.
de: Puffer fester Größe müssen länger als 0 (null) sein.
es: Los búferes de tamaño fijo deben tener una longitud mayor que cero
fr: Les mémoires tampons de taille fixe doivent avoir une longueur supérieure à zéro
it: La lunghezza dei buffer a dimensione fissa deve essere maggiore di zero
ja: 固定サイズ バッファーには、0 よりも大きい値を指定しなければなりません
ko: 고정 크기 버퍼의 길이는 0보다 커야 합니다.
pl: Bufory o ustalonym rozmiarze muszą mieć długość większą niż zero.
pt_br: O tamanho dos buffers de tamanho fixo deve ser maior que zero
ru: Буферы фиксированного размера должны иметь ненулевую длину.
tr: Sabit boyutlu arabelleklerin uzunluğu sıfırdan büyük olmalıdır
zh_hans: 固定大小缓冲区的长度必须大于零
zh_hant: 固定大小緩衝區的長度必須大於零

# ERR_FixedBufferNotFixed
source: You cannot use fixed size buffers contained in unfixed expressions. Try using the fixed statement.
cs: Vyrovnávací paměti pevné velikosti obsažené ve volném výrazu nejde používat. Použijte příkaz fixed.
de: Sie können keine Puffer fester Größe verwenden, die in nicht festen Ausdrücken enthalten sind. Verwenden Sie die fixed-Anweisung.
es: No puede utilizar los búferes de tamaño fijo contenidos en expresiones de tipo unfixed. Pruebe a usar la instrucción "fixed".
fr: Vous ne pouvez pas utiliser des mémoires tampons de taille fixe contenues dans des expressions non fixed. Essayez d'utiliser l'instruction fixed.
it: Impossibile utilizzare buffer a dimensione fissa contenuti in espressioni unfixed. Provare a utilizzare l'istruzione fixed.
ja: fixed でない式に含まれる固定サイズ バッファーは使用できません。fixed ステートメントを使用してください。
ko: 고정되지 않은 식에 포함된 고정 크기 버퍼는 사용할 수 없습니다. fixed 문을 사용하세요.
pl: Nie można użyć buforów o ustalonym rozmiarze zawartych w wyrażeniach unfixed. Spróbuj użyć instrukcji fixed.
pt_br: Você não pode usar buffers de tamanho fixo contidos em expressões unfixed. Tente usar a instrução fixed.
ru: Невозможно использовать буферы фиксированного размера в нефиксированных выражениях. Попробуйте использовать оператор fixed.
tr: Sabitlenmemiş ifadelerde sabit boyutlu arabellek kullanamazsınız. fixed deyimini kullanmayı deneyin.
zh_hans: 不能使用非固定表达式中包含的固定大小缓冲区。请尝试使用 fixed 语句。
zh_hant: 您不能使用包含在 unfixed 運算式中的固定大小緩衝區。請嘗試使用 fixed 陳述式。

# ERR_AttributeNotOnAccessor
source: Attribute '{0}' is not valid on property or event accessors. It is only valid on '{1}' declarations.
cs: Atribut {0} není platný pro přistupující objekty vlastnosti nebo události. Je platný jenom pro deklarace {1}.
de: Das Attribut "{0}" ist bei Accessoren für Eigenschaften und Ereignisse nicht gültig. Es ist nur bei {1}-Deklarationen gültig.
es: El atributo '{0}' no es válido en descriptores de acceso de propiedades o eventos. Solo es válido en declaraciones '{1}'.
fr: L'attribut '{0}' n'est pas valide dans les accesseurs de propriété ou d'événement. Il n'est valide que dans les déclarations '{1}'.
it: L'attributo '{0}' non è valido nelle funzioni di accesso a proprietà o eventi. È valido solo nelle dichiarazioni di '{1}'.
ja: 属性 '{0}' はプロパティまたはイベントのアクセサーでは無効です。'{1}' 宣言でのみ有効です。
ko: 속성 또는 이벤트 접근자에서는 '{0}' 특성이 유효하지 않습니다. 이 특성은 '{1}' 선언에만 유효합니다.
pl: Atrybut „{0}” nie jest prawidłowy w metodach dostępu do właściwości lub zdarzeń. Jest on prawidłowy tylko w deklaracjach „{1}”.
pt_br: Atributo "{0}" não é válido em acessadores de propriedade ou evento. Ele é válido somente em declarações "{1}".
ru: Атрибут "{0}" нельзя использовать в методах доступа к свойствам или событиям. Он допустим только для объявлений "{1}".
tr: {0}' özniteliği özellik veya olay erişimcilerinde geçerli değil. Yalnızca '{1}' bildirimlerinde geçerlidir.
zh_hans: 特性“{0}”对属性或事件访问器无效。它仅对“{1}”声明有效。
zh_hant: 屬性 '{0}' 在屬性或事件存取子上無效。其只有在 '{1}' 宣告上才有效。

# WRN_InvalidSearchPathDir
source: Invalid search path '{0}' specified in '{1}' -- '{2}'
cs: Neplatná vyhledávací cesta {0} zadaná v {1} -- {2}
de: Ungültiger Suchpfad "{0}" in "{1}": "{2}"
es: Se ha especificado una ruta de acceso de búsqueda '{0}' no válida en '{1}': '{2}'
fr: Chemin de recherche '{0}' non valide spécifié dans '{1}' -- '{2}'
it: Il percorso di ricerca '{0}' specificato in '{1}' non è valido - '{2}'
ja: '{1}' で指定された無効な検索パス '{0}' です -- '{2}'
ko: 잘못된 검색 경로 '{0}'이(가) '{1}'에 지정되었습니다. '{2}'
pl: Określono nieprawidłową ścieżkę wyszukiwania „{0}” w elemencie „{1}” — „{2}”
pt_br: Caminho de pesquisa inválido "{0}" especificado em "{1}" -- "{2}"
ru: Недопустимый путь для поиска "{0}" указан в "{1}" — "{2}"
tr: {1}' öğesinde belirtilen geçersiz aram yolu '{0}' -- '{2}'
zh_hans: “{1}”中指定的搜索路径“{0}”无效 --“{2}”
zh_hant: 在 '{1}' 中指定了的搜尋路徑 '{0}' 無效 -- '{2}'

# WRN_InvalidSearchPathDir_Title
source: Invalid search path specified
cs: Byla zadaná neplatná vyhledávací cesta.
de: Ungültiger Suchpfad angegeben
es: Ruta de búsqueda especificada no válida
fr: Le chemin de recherche spécifié n'est pas correct
it: Il percorso di ricerca specificato non è valido
ja: 無効な検索パスが指定されています
ko: 지정한 검색 경로가 잘못되었습니다.
pl: Określono nieprawidłową ścieżkę wyszukiwania
pt_br: Caminho de pesquisa especificado inválido
ru: Указан недопустимый путь поиска
tr: Geçersiz arama yolu belirtildi
zh_hans: 指定的搜索路径无效
zh_hant: 指定的搜尋路徑無效

# ERR_IllegalVarArgs
source: __arglist is not valid in this context
cs: Klíčové slovo __arglist není v tomto kontextu platné.
de: "__arglist" ist in diesem Kontext nicht gültig.
es: __arglist no es válido en este contexto
fr: __arglist n'est pas valide dans ce contexte
it: __arglist non è valido in questo contesto
ja: __arglist は、このコンテキストでは無効です
ko: 이 컨텍스트에는 __arglist를 사용할 수 없습니다.
pl: Element „__arglist” jest nieprawidłowy w tym kontekście.
pt_br: __arglist não é válido neste contexto
ru: __arglist недопустим в этом контексте.
tr: __arglist bu bağlamda geçerli değildir
zh_hans: __arglist 在此上下文中无效
zh_hant: __arglist 在此內容中無效

# ERR_IllegalParams
source: params is not valid in this context
cs: Klíčové slovo params není v tomto kontextu platné.
de: "params" ist in diesem Kontext nicht gültig.
es: params no es válido en este contexto
fr: params n'est pas valide dans ce contexte
it: params non è valido in questo contesto
ja: params はこのコンテキストでは有効ではありません
ko: 이 컨텍스트에서는 params가 유효하지 않습니다.
pl: Element params jest nieprawidłowy w tym kontekście.
pt_br: params não é válido neste contexto
ru: params недопустим в этом контексте.
tr: params bu bağlamda geçerli değildir
zh_hans: params 在此上下文中无效
zh_hant: params 在此內容中無效

# ERR_BadModifiersOnNamespace
source: A namespace declaration cannot have modifiers or attributes
cs: Deklarace oboru názvů nemůže mít modifikátory ani atributy.
de: Eine Namespacedeklaration darf keine Modifizierer oder Attribute aufweisen.
es: Una declaración de espacio de nombres no puede tener modificadores ni atributos
fr: Une déclaration d'espace de noms ne peut pas avoir de modificateurs ou d'attributs
it: Una dichiarazione di spazio dei nomi non può avere modificatori o attributi
ja: 名前空間の宣言に、修飾子または属性を指定することはできません
ko: 네임스페이스 선언에는 한정자 또는 특성을 사용할 수 없습니다.
pl: Deklaracja przestrzeni nazw nie może mieć modyfikatorów ani atrybutów.
pt_br: Uma declaração de namespace não pode ter modificadores nem atributos
ru: Объявление пространства имен не может содержать модификаторы или атрибуты.
tr: Bir ad uzayı bildiriminde değiştiriciler veya öznitelikler olamaz
zh_hans: 命名空间声明不能有修饰符或特性
zh_hant: 命名空間宣告不能有修飾元或屬性

# ERR_BadPlatformType
source: Invalid option '{0}' for /platform; must be anycpu, x86, Itanium, arm, arm64 or x64
cs: Neplatná možnost {0} pro /platform. Musí být anycpu, x86, Itanium, arm, arm64 nebo x64.
de: Ungültige Option "{0}" für /platform. Gültige Werte sind "anycpu", "x86", "Itanium", "arm", "arm64" oder "x64".
es: Opción "{0}" no válida para /platform; debe ser anycpu, x86, Itanium, arm, arm64 o x64
fr: Option non valide '{0}' pour /platform ; la valeur doit être anycpu, x86, Itanium, arm, arm64 ou x64
it: L'opzione '{0}' non è valida per /platform. Specificare anycpu, x86, Itanium, arm, arm64 o x64
ja: /platform に対するオプション '{0}' が無効です。anycpu、x86、Itanium、arm、arm64、x64 を指定してください
ko: /platform에 대해 잘못된 '{0}' 옵션입니다. anycpu, x86, Itanium, arm, arm64 또는 x64여야 합니다.
pl: Nieprawidłowa opcja „{0}” dla opcji /platform; wymagana wartość to anycpu, x86, Itanium, arm, arm64 lub x64
pt_br: Opção inválida '{0}' para /platform; precisa ser anycpu, x86, Itanium, arm, arm64 ou x64
ru: Недопустимый параметр "{0}" для /platform; должен быть anycpu, x86, Itanium, arm, arm64 или x64
tr: /platform için geçersiz '{0}' seçeneği; anycpu, x86, Itanium, arm, arm64 veya x64 olmalıdır
zh_hans: 选项“{0}”对 /platform 无效；必须是 anycpu、x86、Itanium、arm、arm64 或 x64
zh_hant: /platform 的 '{0}' 選項無效; 必須是 anycpu、x86、Itanium、arm、arm64 或 x64

# ERR_ThisStructNotInAnonMeth
source: Anonymous methods, lambda expressions, query expressions, and local functions inside structs cannot access instance members of 'this'. Consider copying 'this' to a local variable outside the anonymous method, lambda expression, query expression, or local function and using the local instead.
cs: Anonymní metody, výrazy lambda, výrazy dotazu a místní funkce uvnitř struktur nemají přístup ke členům instance this. Jako náhradu zkopírujte objekt this do lokální proměnné vně anonymní metody, výrazu lambda, výrazu dotazu nebo místní funkce a použijte tuto lokální proměnnou.
fr: Les méthodes anonymes, les expressions lambda, les expressions de requête et les fonctions locales contenues dans les structs ne peuvent pas accéder aux membres d'instance de 'this'. Copiez 'this' dans une variable locale en dehors de la méthode anonyme, de l'expression lambda ou de l'expression de requête ou de la fonction locale, et utilisez la variable locale à la place.
it: I metodi anonimi, le espressioni lambda, le espressioni di query e le funzioni locali all'interno delle strutture non possono accedere ai membri di istanza di 'this'. Provare a copiare 'this' in una variabile locale all'esterno del metodo anonimo, dell'espressione lambda, dell'espressione di query o della funzione locale e usare tale variabile locale.
ja: 構造体内部の匿名メソッド、ラムダ式、クエリ式、またはローカル関数は、'this' のインスタンス メンバーにアクセスできません。匿名メソッド、ラムダ式、クエリ式、またはローカル関数の外部のローカル変数に 'this' をコピーして、そのローカルをご使用ください。
pl: Anonimowe metody, wyrażenia lambda, wyrażenia zapytania i funkcje lokalne wewnątrz struktur nie mogą uzyskiwać dostępu do składowych wystąpień elementu „this”. Rozważ możliwość skopiowania elementu „this” do zmiennej lokalnej poza metodą anonimową, wyrażeniem lambda, wyrażeniem zapytania lub funkcją lokalną i użycie zamiast niego zmiennej lokalnej.
pt_br: Os métodos anônimos, as expressões lambda, as expressões de consulta e as funções locais dentro de structs não podem acessar membros de instância 'this'. Considere copiar 'this' para uma variável local fora do método anônimo, da expressão lambda, da expressão de consulta ou da função local e usar o local em seu lugar.
ru: Анонимные методы, лямбда-выражения, выражения запроса и локальные функции внутри структуры не имеют доступа к элементам экземпляра "this". Возможно, следует скопировать "this" в локальную переменную за пределами анонимного метода, лямбда-выражения, выражения запроса или локальной функции и использовать эту локальную переменную.
zh_hans: 结构内部的匿名方法、lambda 表达式、查询表达式和局部函数无法访问 "this" 的实例成员。请考虑将 "this" 复制到匿名方法、lambda 表达式、查询表达式或局部函数外部的某个局部变量并改用该局部变量。
zh_hant: 結構內部的匿名方法、Lambda 運算式及查詢運算式，皆無法存取 'this' 的執行個體成員。請考慮將 'this' 複製到匿名方法、Lambda 運算式、查詢運算式或本機函式外部的區域變數，並改用該區域變數。

# ERR_NoConvToIDisp
source: '{0}': type used in a using statement must implement 'System.IDisposable'.
fr: '{0}' : le type utilisé dans une instruction en utilisant doit implémenter « System.IDisposable ».
it: '{0}': il tipo usato in un'istruzione using deve implementare 'System.IDisposable'.
pl: „{0}”: typ użyty w instrukcji using musi implementować typ „System.IDisposable”.
pt_br: '{0}': o tipo usado em uma instrução 'using' deve implementar 'System.IDisposable'.
ru: "{0}": тип, используемый в операторе using, должен реализовывать "System.IDisposable".
zh_hans: '{0}': using 语句中使用的类型必须实现 'System.IDisposable'。
zh_hant: '{0}': using 陳述式中使用的類型必須可以隱含轉換為 'System.IDisposable'。

# ERR_BadParamRef
source: Parameter {0} must be declared with the '{1}' keyword
cs: Parametr {0} se musí deklarovat s klíčovým slovem {1}.
de: Der Parameter "{0}" muss mit dem Schlüsselwort "{1}" deklariert werden.
es: El parámetro {0} se debe declarar con la palabra clave '{1}'
fr: Le paramètre {0} doit être déclaré avec le mot clé '{1}'
it: Il parametro {0} deve essere dichiarato con la parola chiave '{1}'
ja: パラメーター {0} はキーワード '{1}' で宣言する必要があります
ko: {0} 매개 변수는 '{1}' 키워드를 사용하여 선언해야 합니다.
pl: Parametr „{0}” musi być deklarowany za pomocą słowa kluczowego „{1}”
pt_br: Parâmetro {0} deve ser declarado com a palavra-chave "{1}"
ru: Параметр {0} должен быть объявлен с ключевым словом "{1}".
tr: Parametre {0} '{1}' anahtar sözcüğü ile ifade edilmelidir
zh_hans: 参数 {0} 必须使用“{1}”关键字进行声明
zh_hant: 參數 {0} 必須以 '{1}' 關鍵字宣告

# ERR_BadParamExtraRef
source: Parameter {0} should not be declared with the '{1}' keyword
cs: Parametr {0} by se neměl deklarovat s klíčovým slovem {1}.
de: Der Parameter "{0}" sollte nicht mit dem Schlüsselwort "{1}" deklariert werden.
es: El parámetro {0} no se debe declarar con la palabra clave '{1}'
fr: Le paramètre {0} ne doit pas être déclaré avec le mot clé '{1}'
it: Il parametro {0} non deve essere dichiarato con la parola chiave '{1}'
ja: パラメーター {0} はキーワード '{1}' で宣言しないでください
ko: {0} 매개 변수는 '{1}' 키워드를 사용하여 선언할 수 없습니다.
pl: Parametr {0} nie powinien być deklarowany za pomocą słowa kluczowego „{1}”
pt_br: Parâmetro {0} não deve ser declarado com a palavra-chave "{1}"
ru: Параметр {0} должен быть объявлен с ключевым словом "{1}".
tr: Parametre {0} '{1}' anahtar sözcüğü ile ifade edilmemelidir
zh_hans: 参数 {0} 不应使用“{1}”关键字进行声明
zh_hant: 參數 {0} 不可以 '{1}' 關鍵字宣告

# ERR_BadParamType
source: Parameter {0} is declared as type '{1}{2}' but should be '{3}{4}'
cs: Parametr {0} se deklaruje jako typ {1}{2}, ale mělo by jít o {3}{4}.
de: Der Parameter "{0}" ist als Typ "{1}{2}" deklariert, sollte aber "{3}{4}" sein.
es: El parámetro {0} se declara como tipo '{1}{2}', pero debería ser '{3}{4}'
fr: Le paramètre {0} est déclaré comme type '{1}{2}' mais doit être '{3}{4}'
it: Il parametro {0} è dichiarato come tipo '{1}{2}', ma deve essere '{3}{4}'
ja: パラメーター {0} は '{1}{2}' 型として宣言しますが、'{3}{4}' である必要があります
ko: {0} 매개 변수가 '{1}{2}' 형식으로 선언되었지만 '{3}{4}' 형식이어야 합니다.
pl: Parametr {0} jest deklarowany jako typ „{1}{2}”, a powinien być „{3}{4}”
pt_br: Parâmetro {0} é declarado como tipo "{1}{2}", mas deve ser "{3}{4}"
ru: Параметр {0} объявлен как тип "{1}{2}" вместо "{3}{4}".
tr: Parametre {0} '{1}{2}' türü olarak ifade edilir ancak '{3}{4}' olmalıdır
zh_hans: 参数 {0} 声明为类型“{1}{2}”，但它应为“{3}{4}”
zh_hant: 參數 {0} 宣告為類型 '{1}{2}'，但應該是 '{3}{4}'

# ERR_BadExternIdentifier
source: Invalid extern alias for '/reference'; '{0}' is not a valid identifier
cs: Neplatný externí alias pro parametr /reference; {0} je neplatný identifikátor.
de: Ungültiger externer Alias für /reference. "{0}" ist kein gültiger Bezeichner.
es: Alias externo no válido para '/reference'; '{0}' no es un identificador válido
fr: Alias extern non valide pour '/reference' ; '{0}' n'est pas un identificateur valide
it: L'alias extern non è valido per '/reference'. '{0}' non è un identificatore valido
ja: /reference' の無効な extern エイリアスです。'{0}' は無効な識別子です
ko: /reference'에 대해 잘못된 extern 별칭입니다. '{0}'이(가) 유효한 식별자가 아닙니다.
pl: Nieprawidłowy alias zewnętrzny dla opcji „/reference”; wartość „{0}” nie jest prawidłowym identyfikatorem
pt_br: Alias extern inválido para "/reference"; "{0}" não é um identificador válido
ru: Недопустимый внешний псевдоним для /reference; "{0}" является недопустимым идентификатором.
tr: /reference' için geçersiz extern diğer adı; '{0}' geçerli bir belirtici değil
zh_hans: “/reference”的外部别名无效；“{0}”不是有效的标识符
zh_hant: /reference' 的外部別名無效; '{0}' 不是有效的識別項

# ERR_AliasMissingFile
source: Invalid reference alias option: '{0}=' -- missing filename
cs: Neplatný parametr aliasu odkazu: {0}= – nenašel se název souboru.
de: Ungültige Verweisaliasoption: "{0}=". Fehlender Dateiname.
es: Opción de alias de referencia no válida: '{0}=', falta el nombre de archivo
fr: Option d'alias de référence non valide : '{0}=' -- nom de fichier manquant
it: L'opzione dell'alias di riferimento non è valida: '{0}='. Manca il nome file
ja: 無効な参照エイリアス オプションです: '{0}=' -- ファイル名が指定されていません
ko: 잘못된 참조 별칭 옵션입니다. '{0}=' -- 파일 이름이 없습니다.
pl: Nieprawidłowa opcja aliasu odwołania: „{0}=” — brak nazwy pliku
pt_br: Opção de alias de referência inválida: "{0}=" -- nome de arquivo ausente
ru: Недопустимый параметр псевдонима ссылки: "{0}=" — не указано имя файла
tr: Geçersiz başvuru diğer adı seçeneği: '{0}=' -- dosya adı eksik
zh_hans: 无效的引用别名选项:“{0}=”-- 缺少文件名
zh_hant: 參考別名選項無效: '{0}=' -- 遺漏檔案名稱

# ERR_GlobalExternAlias
source: You cannot redefine the global extern alias
cs: Nejde předefinovat globální externí alias.
de: Sie können den globalen externen Alias nicht neu definieren.
es: No se puede definir de nuevo el alias externo global
fr: Vous ne pouvez pas redéfinir l'alias extern global
it: Non è possibile ridefinire l'alias extern globale
ja: グローバルの extern エイリアスは再定義できません
ko: 전역 extern 별칭을 다시 정의할 수 없습니다.
pl: Nie można ponownie zdefiniować globalnego aliasu zewnętrznego
pt_br: Você não pode redefinir o alias externo global
ru: Нельзя переопределять глобальный внешний псевдоним.
tr: Genel extern diğer adını yeniden tanımlayamazsınız
zh_hans: 不能重新定义全局外部别名
zh_hant: 您不能重新定義全域外部別名

# ERR_MissingTypeInSource
source: Reference to type '{0}' claims it is defined in this assembly, but it is not defined in source or any added modules
cs: Odkaz na typ {0} se deklaruje jako definovaný v tomto sestavení, ale není definovaný ve zdroji ani v žádných přidaných modulech.
de: Der Verweis auf Typ "{0}" wurde angeblich in dieser Assembly definiert, aber er ist weder in der Quelle noch in einem der hinzugefügten Module definiert.
es: La referencia al tipo '{0}' confirma que está definida en este ensamblado, pero no lo está ni en el código fuente ni en los módulos agregados
fr: Une référence au type '{0}' déclare qu'il est défini dans cet assembly, mais il n'est pas défini dans la source ou dans les modules ajoutés
it: Il riferimento al tipo '{0}' dichiara di essere definito in questo assembly, ma non è definito nell'origine né nei moduli aggiunti
ja: 型 '{0}' への参照では、このアセンブリで定義されていると指定されていますが、ソースまたは追加モジュール内では定義されていません
ko: {0}' 형식에 대한 참조는 이 어셈블리에 정의된 것으로 되어 있지만 소스 또는 추가된 모듈에 정의되어 있지 않습니다.
pl: Odwołanie do typu „{0}” określa, że jest zdefiniowane w tym zestawie, lecz nie jest zdefiniowane w module źródłowym ani w żadnym z dodanych modułów
pt_br: Referência ao tipo "{0}" declara que ele está definido neste assembly, mas não está definido no código-fonte ou quaisquer módulo adicionados
ru: Ссылка на тип "{0}" требует его определения в данной сборке, однако он не определен в исходном тексте программы или добавленных модулях.
tr: {0}' türüne başvuru bu derlemede tanımlandığını belirtiyor, ancak kaynak veya herhangi bir eklenen modülde tanımlanmadı
zh_hans: 对类型“{0}”的引用声称在此程序集中定义了该类型，但源代码或任何添加的模块中并未定义该类型
zh_hant: 類型 '{0}' 的參考表示它定義在此組件中，但是在原始檔或任何加入的模組中都未定義它

# ERR_MissingTypeInAssembly
source: Reference to type '{0}' claims it is defined in '{1}', but it could not be found
cs: Odkaz na typ {0} se deklaruje jako definovaný v rámci {1}, ale nenašel.
de: Der Verweis auf Typ "{0}" wurde angeblich in "{1}" deklariert, konnte jedoch nicht gefunden werden.
es: La referencia al tipo '{0}' confirma que está definida en '{1}', pero no se encontró
fr: Une référence au type '{0}' déclare qu'il est défini dans '{1}', mais il est introuvable
it: Il riferimento al tipo '{0}' dichiara di essere definito in '{1}', ma non è stato trovato
ja: 型 '{0}' への参照では、'{1}' で定義されていると指定されていますが、見つかりませんでした
ko: {0}' 형식에 대한 참조는 '{1}'에 정의된 것으로 되어 있지만 찾을 수 없습니다.
pl: Odwołanie do typu „{0}” określa, że jest zdefiniowane w elemencie „{1}”, lecz nie można go znaleźć
pt_br: Referência ao tipo "{0}" declara que ele é definido em "{1}", mas não pode ser encontrado
ru: Ссылка на тип "{0}" требует его определения в "{1}", но его не удалось найти.
tr: {0}' türüne başvuru '{1}' tanımlandığını belirtiyor, ancak bulunamadı
zh_hans: 对类型“{0}”的引用声称该类型是在“{1}”中定义的，但未能找到
zh_hant: 類型 '{0}' 的參考表示它定義在 '{1}' 中，但找不到
