Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RefReadonlyNotField2
source: Members of {0} '{1}' cannot be used as a ref or out value because it is a readonly variable
cs: Členy {0} {1} nejde použít jako hodnotu ref nebo out, protože je to proměnná jen pro čtení.
de: Member von {0} "{1}" können nicht als ref- oder out-Wert verwendet werden, weil es sich um eine schreibgeschützte Variable handelt.
es: Los miembros de {0} "{1}" no se pueden usar como valor out o ref porque es una variable readonly.
fr: Impossible d'utiliser les membres de {0} '{1}' en tant que valeur ref ou out, car il s'agit d'une variable en lecture seule
it: Non è possibile usare i membri di {0} '{1}' come valore ref o out perché è una variabile di sola lettura
ja: {0} '{1}' のメンバーは読み取り専用の変数であるため、ref 値としても out 値としても使用できません
ko: {0} '{1}'의 멤버는 읽기 전용 변수이므로 ref 또는 out 값으로 사용할 수 없습니다.
pl: Składowe elementu {0} „{1}” nie mogą być używane jako wartość ref ani out, ponieważ jest to zmienna tylko do odczytu
pt_br: Membros de {0} '{1}' não podem ser usados como um valor de referência ou out porque ela é uma variável somente leitura
ru: Члены {0} "{1}" невозможно использовать как значения ref или out, так как это переменная только для чтения
tr: {0} '{1}' üyeleri salt okunur değişken olduğundan ref veya out değeri olarak kullanılamaz
zh_hans: {0} '{1}' 的成员不能作为 ref 或 out 值使用，因为它是只读变量
zh_hant: {0} '{1}' 的成員不可用為 ref 或 out 值，因為它是唯讀變數

# ERR_AssignReadonlyNotField
source: Cannot assign to {0} '{1}' or use it as the right hand side of a ref assignment because it is a readonly variable
cs: Není možné k {0} {1} nebo jej použít jako pravou stranu přiřazení odkazu, protože se jedná o proměnnou pouze pro čtení
fr: Impossible d’assigner à {0} '{1}' ou de l’utiliser comme partie droite d’une affectation ref, car il s’agit d’une variable en lecture seule
it: Non è possibile assegnare '{1}' a {0} o usarlo come lato destro di un'assegnazione di riferimento perché è una variabile readonly
ja: {0} に割り当てることができません。'{1}' は読み取り専用変数であるため、ref 割り当ての右辺として使用することはできません。
pl: Nie można przypisać do {0} „{1}” lub użyć go jako prawej strony przypisania odwołania, ponieważ jest to zmienna tylko do odczytu
pt_br: Não é possível atribuir a {0} '{1}' ou usá-lo como o lado direito de uma atribuição ref porque é uma variável somente leitura
ru: Не удается назначить {0} "{1}" или использовать это как правую часть назначения ref, поскольку это переменная только для чтения
zh_hans: 无法分配给 {0}“{1}”，或将其用作 ref 分配的右侧，因为它是只读变量
zh_hant: 無法指派給 {0} '{1}'，或將其用在 ref 指派的右邊，因為它是唯讀變數

# ERR_AssignReadonlyNotField2
source: Cannot assign to a member of {0} '{1}' or use it as the right hand side of a ref assignment because it is a readonly variable
cs: Není možné přiřadit členovi {0} {1} nebo jej použít jako pravou stranu přiřazení odkazu, protože se jedná o proměnnou pouze pro čtení
fr: Impossible d’assigner à un membre de {0} '{1}' ou de l’utiliser comme partie droite d’une affectation ref, car il s’agit d’une variable en lecture seule
it: Non è possibile assegnare '{1}' a un membro di {0} o usarlo come lato destro di un'assegnazione di riferimento perché è una variabile readonly
ja: {0} のメンバーに割り当てることができません。'{1}' は読み取り専用変数であるため、ref 割り当ての右辺として使用することはできません。
pl: Nie można przypisać składowej{0} „{1}” lub użyć jej jako prawej strony przypisania odwołania, ponieważ jest to zmienna tylko do odczytu
pt_br: Não é possível atribuir a um membro de {0} '{1}' ou usá-lo como o lado direito de uma atribuição ref porque é uma variável somente leitura
ru: Не удается назначить участнику {0} "{1}" или использовать это как правую часть назначения ref, поскольку это переменная только для чтения
zh_hans: 无法分配给 {0}“{1}”的成员，或将其用作 ref 分配的右侧，因为它是只读变量
zh_hant: 無法指派給 {0} '{1}' 的成員，或將其用在 ref 指派的右邊，因為它是唯讀變數

# ERR_RefReturnReadonlyNotField
source: Cannot return {0} '{1}' by writable reference because it is a readonly variable
cs: Nejde vrátit {0} {1} zapisovatelným odkazem, protože to je proměnná jen pro čtení.
de: Die Rückgabe von {0} "{1}" als schreibbarer Verweis ist nicht möglich, weil es sich um eine schreibgeschützte Variable handelt.
es: No se puede devolver {0} "{1}" por referencia grabable porque es una variable readonly.
fr: Impossible de retourner {0} '{1}' par référence accessible en écriture, car il s'agit d'une variable en lecture seule
it: Non è possibile restituire {0} '{1}' per riferimento scrivibile perché è una variabile di sola lettura
ja: {0} '{1}' は読み取り専用の変数であるため、書き込み可能な参照によって返すことはできません
ko: {0} '{1}'은(는) 읽기 전용 변수이므로 쓰기 가능 참조로 반환할 수 없습니다.
pl: Nie można zwrócić elementu {0} „{1}” przez zapisywalne odwołanie, ponieważ jest to zmienna tylko do odczytu
pt_br: Não é possível retornar {0} '{1}' por referência gravável porque ela é uma variável somente leitura
ru: Невозможно вернуть {0} "{1}" по ссылке для записи, так как это переменная только для чтения
tr: {0} '{1}', salt okunur değişken olduğundan yazılabilir başvuru ile döndürülemez
zh_hans: 不能通过可写的引用返回 {0} '{1}'，因为它是只读变量
zh_hant: 無法以可寫入傳址方式傳回 {0} '{1}'，因為它是唯讀變數

# ERR_RefReturnReadonlyNotField2
source: Members of {0} '{1}' cannot be returned by writable reference because it is a readonly variable
cs: Členy {0} {1} nejde vrátit zapisovatelným odkazem, protože to je proměnná jen pro čtení.
de: Member von {0} "{1}" können nicht als schreibbarer Verweis zurückgegeben werden, weil es sich um eine schreibgeschützte Variable handelt.
es: Los miembros de {0} "{1}" no se pueden devolver por referencia grabable porque es una variable readonly.
fr: Impossible de retourner les membres de {0} '{1}' par référence accessible en écriture, car il s'agit d'une variable en lecture seule
it: Non è possibile restituire i membri di {0} '{1}' per riferimento scrivibile perché è una variabile di sola lettura
ja: {0} '{1}' のメンバーは読み取り専用の変数であるため、書き込み可能な参照によって返すことはできません
ko: {0} '{1}'의 멤버는 읽기 전용 변수이므로 쓰기 가능 참조로 반환할 수 없습니다.
pl: Składowe elementu {0} „{1}” nie mogą być zwracane przez zapisywalne odwołanie, ponieważ jest to zmienna tylko do odczytu
pt_br: Membros de {0} '{1}' não podem ser retornados por referência gravável porque ela é uma variável somente leitura
ru: Члены {0} "{1}" невозможно вернуть по ссылке для записи, так как это переменная только для чтения
tr: {0} '{1}' üyeleri, salt okunur değişken olduğundan yazılabilir başvuru ile döndürülemez
zh_hans: 不能通过可写的引用返回 {0} '{1}' 的成员，因为它是只读变量
zh_hant: 無法以可寫入傳址方式傳回 {0} '{1}' 的成員，因為它是唯讀變數

# ERR_AssgReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be assigned to (except in a static constructor or a variable initializer)
cs: Pole statických polí jen pro čtení {0} nejde přiřadit (kromě případu, kdy se nacházejí uvnitř statického konstruktoru nebo inicializátoru proměnné).
de: Für Felder eines statischen schreibgeschützten Felds "{0}" ist eine Zuweisung nicht möglich (außer in einem statischen Konstruktor oder einem Variableninitialisierer).
es: No se puede asignar a los campos del campo estático de solo lectura '{0}' (excepto en un constructor estático o un inicializador de variable)
fr: Impossible d'assigner les champs du champ readonly statique '{0}' (sauf s'ils appartiennent à un constructeur statique ou un initialiseur de variable)
it: Non è possibile effettuare un'assegnazione a campi del campo statico di sola lettura '{0}' (tranne che in un costruttore statico o in un inizializzatore di variabile)
ja: 静的読み取り専用フィールド '{0}' のフィールドへの割り当てはできません (静的コンストラクターまたは変数初期化子では可)
ko: 정적 읽기 전용 필드 '{0}'의 필드에는 할당할 수 없습니다. 단 정적 생성자 또는 변수 이니셜라이저에서는 예외입니다.
pl: Polom statycznego pola tylko do odczytu „{0}” nie można przypisać wartości (z wyjątkiem pól w konstruktorze statycznym lub inicjatorze zmiennych).
pt_br: Campos do campo estático somente leitura "{0}" não podem ser atribuídos (exceto em um construtor estático ou inicializador de variável)
ru: Присваивание значений полям доступного только для чтения статического поля "{0}" допускается только в статическом конструкторе и в инициализаторе переменных.
tr: {0}' statik salt okunur alanının alanlarına (statik oluşturucu veya değişken başlatıcı dışında) atama yapılamaz
zh_hans: 无法为静态只读字段“{0}”的字段赋值(在静态构造函数或变量初始值设定项中除外)
zh_hant: 無法指派為靜態唯讀欄位 '{0}' 的欄位 (除非在靜態建構函式或變數初始設定式中)

# ERR_RefReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be used as a ref or out value (except in a static constructor)
cs: Pole statického pole jen pro čtení {0} nejde použít jako hodnotu Ref nebo Out (kromě případu, kdy se nacházejí uvnitř statického konstruktoru).
de: Felder des statischen schreibgeschützten Felds "{0}" können (außer in einem statischen Konstruktor) nicht als ref- oder out-Wert verwendet werden.
es: No se pueden usar campos del campo estático de solo lectura '{0}' como valores out o ref (excepto en un constructor estático).
fr: Impossible d'utiliser les champs du champ readonly statique '{0}' en tant que valeur ref ou out (sauf dans un constructeur statique)
it: Non è possibile usare i campi del campo di sola lettura statico '{0}' come valore out o ref (tranne che in un costruttore statico)
ja: 静的な読み取り専用フィールド '{0}' のフィールドを ref 値または out 値として使用することはできません (静的コンストラクターでは可)
ko: 정적 읽기 전용 필드 '{0}'의 필드는 ref 또는 out 값으로 사용할 수 없습니다. 단 정적 생성자에서는 예외입니다.
pl: Pól pola statycznego tylko do odczytu „{0}” nie można użyć jako wartości ref ani out (z wyjątkiem sytuacji, gdy znajdują się w konstruktorze statycznym)
pt_br: Os campos do campo somente leitura estático '{0}' não podem ser usados como um valor ref ou out (exceto em um construtor estático)
ru: Поля доступного только для чтения статического поля "{0}" можно использовать как значение ref или out только в статическом конструкторе
tr: {0}' statik salt okunur alanının alanları (statik oluşturucu dışında) ref veya out değeri olarak kullanılamaz
zh_hans: 无法将静态只读字段“{0}”的字段用作 ref 或 out 值(静态构造函数中除外)
zh_hant: 無法將靜態唯讀欄位 '{0}' 的欄位用作為 ref 或 out 值 (除非在靜態建構函式中)

# ERR_AssgReadonlyLocal2Cause
source: Cannot modify members of '{0}' because it is a '{1}'
cs: Členy z {0} nejde upravit, protože jde o {1}.
de: "{0}" ist "{1}", daher können die zugehörigen Member nicht geändert werden.
es: Los miembros de '{0}' no se pueden modificar porque es un '{1}'
fr: Impossible de supprimer les membres de '{0}', car il s'agit d'un '{1}'
it: Non è possibile modificare i membri di '{0}' perché è '{1}'
ja: '{0}' のメンバーは '{1}' であるため変更できません
ko: {1}'인 '{0}'의 멤버는 수정할 수 없습니다.
pl: Nie można zmodyfikować składowych „{0}”, ponieważ jest to „{1}”
pt_br: Não é possível modificar membros de "{0}" porque ele é um "{1}"
ru: Невозможно изменить члены "{0}", так как это "{1}".
tr: Bir '{1}' olduğundan '{0}' üyeleri değiştirilemiyor
zh_hans: “{0}”是一个“{1}”，因此无法修改其成员
zh_hant: 無法修改 '{0}' 的成員，因為其為 '{1}'

# ERR_RefReadonlyLocal2Cause
source: Cannot use fields of '{0}' as a ref or out value because it is a '{1}'
cs: Pole elementu {0} nejde použít jako hodnotu Ref nebo Out, protože je {1}.
de: Felder von "{0}" dürfen nicht als ref- oder out-Wert verwendet werden, weil es sich um ein {1}-Objekt handelt.
es: No se pueden usar campos de '{0}' como valores out o ref porque es un '{1}'.
fr: Impossible d'utiliser les champs de '{0}' en tant que valeur ref ou out, car il s'agit d'un '{1}'
it: Non è possibile usare i campi di '{0}' come valore out o ref perché è '{1}'
ja: '{0}' は '{1}' であるため、そのフィールドを ref 値または out 値として使用することはできません
ko: {0}'의 필드는 '{1}'이므로 ref 또는 out 값으로 사용할 수 없습니다.
pl: Nie można użyć pól elementu „{0}” jako wartości ref ani out, ponieważ jest to element „{1}”
pt_br: Não é possível usar campos de '{0}' como um valor ref ou out porque ele é um '{1}'
ru: Невозможно использовать поля "{0}" как значение ref или out, так как это "{1}"
tr: Bir '{1}' olduğundan '{0}' alanları ref veya out değeri olarak kullanılamaz
zh_hans: “{0}”是一个“{1}”，其字段不能用作 ref 或 out 值
zh_hant: 無法將 '{0}' 的欄位用作為 ref 或 out 值，因其為 '{1}'

# ERR_AssgReadonlyLocalCause
source: Cannot assign to '{0}' because it is a '{1}'
cs: K položce nejde přiřadit {0}, protože je typu {1}.
de: "{0}" ist "{1}". Eine Zuweisung ist daher nicht möglich.
es: No se puede asignar a '{0}' porque es '{1}'
fr: Impossible d'assigner à '{0}', car il s'agit d'un '{1}'
it: Non è possibile assegnare a '{0}' perché è '{1}'
ja: '{0}' は '{1}' であるため、これに割り当てることはできません
ko: {1}'인 '{0}'에는 할당할 수 없습니다.
pl: Nie można przypisać wartości do elementu „{0}”, ponieważ jest to „{1}”.
pt_br: Não é possível atribuir a "{0}" porque ele é um "{1}"
ru: Невозможно присвоить "{0}" значение, так как он является "{1}".
tr: {1}' olduğu için '{0}' öğesine atama yapılamaz
zh_hans: 无法为“{0}”赋值，因为它是“{1}”
zh_hant: 無法指派給 '{0}'，因為其為 '{1}'

# ERR_RefReadonlyLocalCause
source: Cannot use '{0}' as a ref or out value because it is a '{1}'
cs: {0} nejde použít jako hodnotu Ref nebo Out, protože je {1}.
de: "{0}" kann nicht als ref- oder out-Wert verwendet werden, weil es sich um ein {1}-Objekt handelt.
es: No se puede usar '{0}' como valor out o ref porque es un '{1}'.
fr: Impossible d'utiliser '{0}' en tant que valeur ref ou out, car il s'agit d'un '{1}'
it: Non è possibile usare '{0}' come valore out o ref perché è '{1}'
ja: '{0}' は '{1}' であるため、ref 値または out 値として使用することはできません
ko: {0}'은(는) '{1}'이므로 ref 또는 out 값으로 사용할 수 없습니다.
pl: Nie można użyć elementu „{0}” jako wartości ref ani out, ponieważ jest to element „{1}”.
pt_br: Não é possível usar '{0}' como um valor ref ou out porque ele é '{1}'
ru: Невозможно вернуть "{0}" как значение ref или out, так как это "{1}"
tr: Bir '{1}' olduğundan '{0}' öğesi ref veya out değeri olarak kullanılamaz
zh_hans: “{0}”是一个“{1}”，无法用作 ref 或 out 值
zh_hant: 無法將 '{0}' 用作為 ref 或 out 值，因其為 '{1}'

# WRN_ErrorOverride
source: {0}. See also error CS{1}.
cs: {0}. Viz taky chyba CS{1}.
de: {0}. Siehe auch Fehler CS{1}.
es: {0}. Vea también el error CS{1}.
fr: {0}. Voir aussi l'erreur CS{1}.
it: {0}. Vedere anche l'errore CS{1}.
ja: {0}。エラー CS{1} を参照してください。
ko: {0}. 오류 CS{1}도 참조하세요.
pl: {0}. Patrz także błąd CS{1}.
pt_br: {0}. Veja também o erro CS{1}.
ru: {0}. См. также ошибку CS{1}.
tr: {0}. Ayrıca bkz. hata CS{1}.
zh_hans: {0}。另请参见错误 CS{1}。
zh_hant: {0}。請參閱錯誤 CS{1}。

# WRN_ErrorOverride_Title
source: Warning is overriding an error
cs: Varování přepisuje chybu.
de: Warnung überschreibt einen Fehler
es: La advertencia está remplazando a un error
fr: L'avertissement remplace une erreur
it: Override di un errore con un avviso
ja: 警告がエラーをオーバーライドしています
ko: 경고에서 오류를 재정의합니다.
pl: Ostrzeżenie przesłania błąd
pt_br: O aviso está substituindo um erro
ru: Предупреждение переопределяет ошибку
tr: Uyarı bir hatayı geçersiz kılıyor
zh_hans: 警告正在重写错误
zh_hant: 警告會覆寫錯誤

# WRN_ErrorOverride_Description
source: The compiler emits this warning when it overrides an error with a warning. For information about the problem, search for the error code mentioned.
cs: Kompilátor vydá toto varování, když přepíše chybu varováním. Informace o tomto problému vyhledejte podle uvedeného kódu chyby.
de: Der Compiler gibt diese Warnung aus, wenn er einen Fehler mit einer Warnung überschreibt. Weitere Informationen zu dem Problem finden Sie, indem Sie nach dem angegebenen Fehlercode suchen.
es: El compilador emite esta advertencia cuando reemplaza un error con una advertencia. Para obtener información sobre el problema, busque el código de error mencionado.
fr: Le compilateur émet cet avertissement lorsqu'il remplace une erreur par un avertissement. Pour plus d'informations sur ce problème, recherchez le code d'erreur indiqué.
it: Il compilatore genera questo avviso quando esegue l'override di un errore con un avviso. Per informazioni sul problema, cercare il codice errore indicato.
ja: コンパイラは、警告付きのエラーをオーバーライドしたときにこの警告を生成します。この問題の詳細については、上記のエラー コードを検索してください。
ko: 컴파일러에서 오류를 경고로 재정의할 때 이 경고를 발생합니다. 문제에 대한 자세한 내용을 보려면 언급된 오류 코드를 검색하세요.
pl: Kompilator emituje to ostrzeżenie w przypadku przesłonięcia błędu z ostrzeżeniem. Aby uzyskać informacje dotyczące tego problemu, wyszukaj podany kod błędu.
pt_br: O compilador emite esse aviso quando substitui um erro com um aviso. Para obter informações sobre o problema, procure o código de erro mencionado.
ru: Компилятор определяет это предупреждение, когда оно переопределяет ошибку с предупреждением. Для получения дополнительных сведений о проблеме выполните поиск упомянутой ошибки кода.
tr: Derleyici bir uyarıyla hatayı geçersiz kıldığında bu uyarıyı gösterir. Sorun hakkında bilgi için, bahsedilen hata kodunu arayın.
zh_hans: 编译器在将错误重写为警告时发出此警告。有关该问题的信息，请搜索提到的错误代码。
zh_hant: 編譯器將錯誤覆寫為警告時會發出此警告。如需此問題的相關資訊，請搜尋提及的錯誤碼。

# ERR_AnonMethToNonDel
source: Cannot convert {0} to type '{1}' because it is not a delegate type
cs: {0} nejde převést na typ {1}, protože to není typ delegáta.
de: "{0}" kann nicht in den Typ "{1}" konvertiert werden, da es kein Delegattyp ist.
es: No se puede convertir {0} en el tipo '{1}' porque no es un tipo delegado
fr: Impossible de convertir {0} en type '{1}', car il ne s'agit pas d'un type délégué
it: Non è possibile convertire {0} nel tipo '{1}' perché non è un tipo delegato
ja: {0} はデリゲート型ではないため、'{1}' 型に変換できません
ko: {0}은(는) 대리자 형식이 아니므로 '{1}' 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować elementu {0} na typ „{1}”, ponieważ nie jest to typ delegowany
pt_br: Não é possível converter {0} para o tipo "{1}" porque ele não é um tipo delegado
ru: Не удается преобразовать {0} к типу "{1}", так как он не является типом делегата.
tr: {0} temsilci türünde olmadığından '{1}' türüne dönüştürülemiyor
zh_hans: 无法将 {0} 转换为类型“{1}”，原因是它不是委托类型
zh_hant: 無法將 {0} 轉換成類型 '{1}'，因為其非委派類型

# ERR_CantConvAnonMethParams
source: Cannot convert {0} to type '{1}' because the parameter types do not match the delegate parameter types
cs: {0} nejde převést na typ {1}, protože typy parametrů se neshodují s typy parametrů delegáta.
de: "{0}" kann nicht in den Typ "{1}" konvertiert werden, weil die Parametertypen nicht den Delegatparametertypen entsprechen.
es: No se puede convertir {0} en el tipo "{1}" porque los tipos de parámetros no coinciden con los tipos de parámetros delegados
fr: Impossible de convertir {0} en type '{1}', car les types de paramètre ne correspondent pas aux types de paramètre délégués
it: Non è possibile convertire {0} nel tipo '{1}' perché i tipi di parametro non corrispondono ai tipi di parametro del delegato
ja: パラメーター型がデリゲート パラメーター型と一致しないため、{0} を型 '{1}' に変換することはできません
ko: 매개 변수 형식이 대리자 매개 변수 형식과 일치하지 않으므로 {0}을(를) 형식 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować elementu {0} na typ „{1}”, ponieważ typy parametrów nie pasują do typów parametru delegowanego
pt_br: Não é possível converter {0} para o tipo '{1}' porque os tipos de parâmetro não correspondem aos tipos de parâmetro delegados
ru: Невозможно преобразовать {0} в тип "{1}", так как типы параметров не совпадают с типами параметров делегата
tr: Parametre türleri temsilci parametre türleriyle eşleşmediğinden {0}, '{1}' türüne dönüştürülemiyor
zh_hans: 无法将 {0} 转换为类型“{1}”，原因是参数类型与委托参数类型不匹配
zh_hant: 因為參數類型與委派參數類型不符，所以無法將 {0} 轉換為類型 '{1}'

# ERR_CantConvAnonMethReturns
source: Cannot convert {0} to intended delegate type because some of the return types in the block are not implicitly convertible to the delegate return type
cs: {0} nejde převést na zamýšlený typ delegáta, protože některé z návratových typů v bloku nejsou implicitně převeditelné na návratový typ tohoto delegáta.
de: "{0}" kann nicht in den gewünschten Delegattyp konvertiert werden, weil einige der Rückgabetypen im Block nicht implizit in den Delegatrückgabetyp konvertiert werden können.
es: No se puede convertir {0} en el tipo delegado indicado porque algunos de los tipos de valores devueltos del bloque no se pueden convertir implícitamente en el tipo de valor devuelto del delegado
fr: Impossible de convertir {0} dans le type de délégué souhaité, car certains types de retour ne sont pas implicitement convertibles en type de retour délégué
it: Non è possibile convertire '{0}' nel tipo delegato previsto perché alcuni dei tipi restituiti nel blocco non sono convertibili in modo implicito nel tipo restituito del delegato
ja: デリゲート戻り値の型に暗黙的に変換できない戻り値の型がブロック内にあるため、{0} を目的のデリゲート型に変換できません
ko: 블록의 반환 형식 중 일부를 암시적으로 대리자 반환 형식으로 변환할 수 없으므로 {0}을(를) 지정한 대리자 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować bloku „{0}” na zamierzony typ delegowany, ponieważ niektóre typy zwracane występujące w bloku nie umożliwiają niejawnej konwersji na zwracany typ delegowany
pt_br: Não é possível converter {0} para o tipo delegate pretendido porque alguns dos tipos de retorno no bloco não são implicitamente conversíveis para o tipo de retorno delegate
ru: Не удается преобразовать {0} в требуемый тип делегата, так как некоторые возвращаемые типы блока не могут быть неявно преобразованы в возвращаемый тип делегата.
tr: Bloktaki dönüş türlerinden bazıları örtük olarak temsilci dönüş türüne dönüştürülebilir olmadığından {0} istenen temsilci türüne dönüştürülemiyor
zh_hans: 无法将 {0} 转换为预期委托类型，因为块中的某些返回类型不可隐式转换为委托返回类型
zh_hant: 無法將 {0} 轉換成想要的委派類型，因為區塊中的某些傳回類型，無法隱含轉換成委派傳回類型

# ERR_BadAsyncReturnExpression
source: Since this is an async method, the return expression must be of type '{0}' rather than '{1}'
cs: Protože se jedná o asynchronní metodu, vrácený výraz musí být typu {0} a ne typu {1}.
fr: S'agissant d'une méthode asynchrone, l'expression de retour doit être de type « {0} » plutôt que « {1} »
it: Poiché si tratta di un metodo asincrono, l'espressione restituita deve essere di tipo '{0}' anziché '{1}'
ja: これは非同期メソッドであるため、return 式は '{0}' ではなく '{1}' 型である必要があります
pl: Ponieważ jest to metoda asynchroniczna, zwracane wyrażenie musi być typu „{0}”, a nie „{1}”
pt_br: Como este é um método assíncrono, a expressão de retorno deve ser do tipo "{0}" em vez de "{1}"
ru: Поскольку данный метод является асинхронным, возвращаемое выражение должно относиться к типу "{0}", а не к типу "{1}".
zh_hans: 这是一个异步方法，因此返回表达式的类型必须为“{0}”而不是“{1}”
zh_hant: 因為此為非同步方法，所以傳回運算式的類型必須是 '{0}' 而非 '{1}'

# ERR_CantConvAsyncAnonFuncReturns
source: Cannot convert async {0} to delegate type '{1}'. An async {0} may return void, Task or Task<T>, none of which are convertible to '{1}'.
cs: Asynchronní metodu {0} nejde převést na typ delegáta {1}. Asynchronní metoda {0} může vracet hodnoty typu void, Task nebo Task< T> , z nichž žádnou nejde převést na typ {1}.
de: Async {0} kann nicht in Delegattyp "{1}" konvertiert werden. Async {0} gibt möglicherweise "void", "Task" oder "Task< T> " zurück. Diese können nicht in "{1}" konvertiert werden.
es: No se puede convertir el elemento {0} asincrónico en el tipo delegado '{1}'. Un elemento {0} asincrónico puede devolver void, Task o Task<T>, ninguno de los cuales se puede convertir en '{1}'.
fr: Impossible de convertir {0} async en type délégué '{1}'. Un {0} async peut retourner void, Task ou Task<T>, aucun n'étant convertible en '{1}'.
it: Non è possibile convertire il metodo async {0} nel tipo delegato '{1}'. Un metodo async {0} può restituire un valore nullo, Task o Task<T>, nessuno dei quali è convertibile in '{1}'.
ja: 非同期の {0} をデリゲート型 '{1}' に変換できません。非同期の {0} は void、Task、または Task<T> を返しますが、いずれも '{1}' に変換することができません。
ko: 비동기 {0}을(를) 대리자 형식 '{1}'(으)로 변환할 수 없습니다. 비동기 {0}은(는) void, Task 또는 Task<T>를 반환할 수 있는데, 세 형식 모두 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować elementu async {0} na typ delegowany „{1}”. Element async {0} może zwrócić wartość void, Task lub Task<T>, a żadne z tych typów nie mogą być przekonwertowane na „{1}”.
pt_br: Não é possível converter async {0} para tipo delegate "{1}". Um async {0} podem retornar void, Task ou Task<T>, nenhum dos quais são conversíveis para "{1}".
ru: Не удается преобразовать асинхронный тип {0} в тип делегата "{1}". Асинхронный тип {0} может возвращать значения Void, Task или Task<T>, ни одно из которых не преобразуется в "{1}".
tr: Zaman uyumsuz {0}, '{1}' temsilci türüne dönüştürülemez. Zaman uyumsuz {0} void, Task veya Task< T> döndürebilir ve bunların hiçbiri '{1}' türüne dönüştürülemez.
zh_hans: 无法将异步 {0} 转换为委托类型“{1}”。异步 {0} 可能会返回 void、Task 或 Task<T>，这些都不可转换为“{1}”。
zh_hant: 無法將非同步 {0} 轉換成委派類型 '{1}'。非同步 {0} 可能會傳回 void、Task 或 Task<T>，而這些都無法轉換成 '{1}'。
