Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NullabilityMismatchInTypeParameterConstraint
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. Nullability of type argument '{3}' doesn't match constraint type '{1}'.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Typ argumentu {3} s možnou hodnotou null neodpovídá typu omezení {1}.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Die NULL-Zulässigkeit des Typarguments "{3}" entspricht nicht dem Einschränkungstyp "{1}".
es: El tipo "{3}" no se puede usar como parámetro de tipo "{2}" en el tipo o método genérico "{0}". La nulabilidad del argumento de tipo "{3}" no coincide con el tipo de restricción "{1}".
fr: Impossible d'utiliser le type '{3}' en tant que paramètre de type '{2}' dans le type ou la méthode générique '{0}'. La nullabilité de l'argument de type '{3}' ne correspond pas au type de contrainte '{1}'.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Il supporto dei valori Null dell'argomento di tipo '{3}' non corrisponde al tipo di vincolo '{1}'.
ja: 型 '{3}' を、ジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用することはできません。型引数 '{3}' の Null 許容性が制約型 '{1}' と一致しません。
ko: '{3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}' 형식 인수의 Null 허용 여부가 '{1}' 제약 조건 형식과 일치하지 않습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Obsługa wartości null w argumencie typu „{3}” jest niezgodna z typem ograniczenia „{1}”.
pt_br: O tipo '{3}' não pode ser usado como parâmetro de tipo '{2}' no tipo ou método genérico '{0}'. A anulabilidade do argumento de tipo '{3}' não corresponde ao tipo de restrição '{1}'.
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Допустимость значения NULL для аргумента типа "{3}" не соответствует типу ограничения "{1}".
tr: {3}' türü '{0}' genel türü veya metodu için '{2}' tür parametresi olarak kullanılamıyor. '{3}' tür bağımsız değişkeninin boş değer atanabilirliği, '{1}' kısıtlama türüyle eşleşmiyor.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。类型参数“{3}”的为 Null 性与约束类型“{1}”不匹配。
zh_hant: 型別 '{3}' 無法作為型別參數 '{2}' 用於泛型型別或方法 '{0}' 中。型別引數 '{3}' 的可 Null 性與條件約束型別 '{1}' 不符合。

# WRN_NullabilityMismatchInTypeParameterConstraint_Title
source: The type cannot be used as type parameter in the generic type or method. Nullability of type argument doesn't match constraint type.
cs: Typ nejde použít jako parametr typu v obecném typu nebo metodě. Typ argumentu s možnou hodnotou null neodpovídá typu omezení.
de: Der Typ kann nicht als Typparameter im generischen Typ oder in der generischen Methode verwendet werden. Die NULL-Zulässigkeit des Typarguments entspricht nicht dem Einschränkungstyp.
es: El tipo no se puede usar como parámetro de tipo en el tipo o método genérico. La nulabilidad del argumento de tipo no coincide con el tipo de restricción
fr: Impossible d'utiliser le type en tant que paramètre de type dans le type ou la méthode générique. La nullabilité de l'argument de type ne correspond pas au type de contrainte.
it: Non è possibile usare il tipo come parametro di tipo nel tipo generico o nel metodo. Il supporto dei valori Null dell'argomento tipo non corrisponde al tipo di vincolo.
ja: この型を、ジェネリック型またはメソッド内で型パラメーターとして使用することはできません。型引数の Null 許容性が制約型と一致しません。
ko: 형식은 제네릭 형식 또는 메서드에서 형식 매개 변수로 사용할 수 없습니다. 형식 인수의 Null 허용 여부가 제약 조건 형식과 일치하지 않습니다.
pl: Nie można użyć typu jako parametru typu w typie ogólnym lub metodzie. Obsługa wartości null w argumencie typu jest niezgodna z typem ograniczenia.
pt_br: O tipo não pode ser usado como parâmetro de tipo no tipo ou método genérico. A anulabilidade do argumento de tipo não corresponde ao tipo de restrição.
ru: Тип не может быть использован как параметр типа в универсальном типе или методе. Допустимость значения NULL для аргумента типа не соответствует типу ограничения.
tr: Tür, genel tür veya metot için tür parametresi olarak kullanılamıyor. Tür bağımsız değişkeninin boş değer atanabilirliği, kısıtlama türüyle eşleşmiyor.
zh_hans: 类型不能用作泛型类型或方法中的类型参数。类型参数的为 Null 性与约束类型不匹配。
zh_hant: 型別無法作為型別參數用於泛型型別或方法中。型別引數的可 Null 性與條件約束型別不符合。

# WRN_NullabilityMismatchInTypeParameterNotNullConstraint
source: The type '{2}' cannot be used as type parameter '{1}' in the generic type or method '{0}'. Nullability of type argument '{2}' doesn't match 'notnull' constraint.
cs: Typ {2} nejde použít jako parametr typu {1} v obecném typu nebo metodě {0}. Argument typu {2} s možnou hodnotou null neodpovídá omezení notnull.
de: Der Typ "{2}" kann nicht als Typparameter "{1}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Die NULL-Zulässigkeit des Typarguments "{2}" entspricht nicht der notnull-Einschränkung.
es: El tipo "{2}" no se puede usar como parámetro de tipo "{1}" en el método o tipo genérico "{0}". La nulabilidad del argumento de tipo "{2}" no coincide con la restricción "notnull".
fr: Impossible d'utiliser le type '{2}' en tant que paramètre de type '{1}' dans le type ou la méthode générique '{0}'. La nullabilité de l'argument de type '{2}' ne correspond pas à la contrainte 'notnull'.
it: Non è possibile usare il tipo '{2}' come parametro di tipo '{1}' nel tipo generico o nel metodo '{0}'. Il supporto dei valori Null dell'argomento tipo '{2}' non corrisponde al vincolo 'notnull'.
ja: 型 '{2}' を、ジェネリック型またはメソッド '{0}' 内で型パラメーター '{1}' として使用することはできません。型引数 '{2}' の Null 許容性が 'notnull' 制約と一致しません。
ko: '{2}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{1}' 형식 매개 변수로 사용할 수 없습니다. '{2}' 형식 인수의 Null 허용 여부가 'notnull' 제약 조건과 일치하지 않습니다.
pl: Nie można użyć typu „{2}” jako parametru typu „{1}” w typie ogólnym lub metodzie „{0}”. Obsługa wartości null w argumencie typu „{2}” jest niezgodna z ograniczeniem „notnull”.
pt_br: O tipo '{2}' não pode ser usado como parâmetro de tipo '{1}' no tipo ou método genérico '{0}'. A nulidade do argumento de tipo '{2}' não corresponde à restrição 'notnull'.
ru: Тип "{2}" не может быть использован как параметр типа "{1}" в универсальном типе или методе "{0}". Допустимость значения NULL для аргумента типа "{2}" не соответствует ограничению "notnull".
tr: '{2}' türü, '{0}' genel türü veya metodu için '{1}' tür parametresi olarak kullanılamıyor. '{2}' tür bağımsız değişkeninin boş değer atanabilirliği, 'notnull' kısıtlamasıyla eşleşmiyor.
zh_hans: 类型“{2}”不能用作泛型类型或方法“{0}”中的类型参数“{1}”。类型参数“{2}”的为 Null 性与 "notnull" 约束不匹配。
zh_hant: 型別 '{2}' 無法作為型別參數 '{1}' 用於泛型型別或方法 '{0}' 中。型別引數 '{2}' 的可 Null 性與 'notnull' 限制式不符合。

# WRN_NullabilityMismatchInTypeParameterNotNullConstraint_Title
source: The type cannot be used as type parameter in the generic type or method. Nullability of type argument doesn't match 'notnull' constraint.
cs: Typ nejde použít jako parametr typu v obecném typu nebo metodě. Argument typu s možnou hodnotou null neodpovídá omezení notnull.
de: Der Typ kann nicht als Typparameter im generischen Typ oder in der generischen Methode verwendet werden. Die NULL-Zulässigkeit des Typarguments entspricht nicht der notnull-Einschränkung.
es: El tipo no se puede usar como parámetro de tipo en el método o tipo genérico. La nulabilidad del argumento de tipo no coincide con la restricción "notnull"
fr: Impossible d'utiliser le type en tant que paramètre de type dans le type ou la méthode générique. La nullabilité de l'argument de type ne correspond pas à la contrainte 'notnull'.
it: Non è possibile usare il tipo come parametro di tipo nel tipo generico o nel metodo. Il supporto dei valori Null dell'argomento tipo non corrisponde al vincolo 'notnull'.
ja: この型を、ジェネリック型またはメソッド内で型パラメーターとして使用することはできません。型引数の Null 許容性が 'notnull' 制約と一致しません。
ko: 형식은 제네릭 형식 또는 메서드에서 형식 매개 변수로 사용할 수 없습니다. 형식 인수의 Null 허용 여부가 'notnull' 제약 조건과 일치하지 않습니다.
pl: Nie można użyć typu jako parametru typu w typie ogólnym lub metodzie. Obsługa wartości null w argumencie typu jest niezgodna z ograniczeniem „notnull”.
pt_br: O tipo não pode ser usado como parâmetro de tipo no tipo ou método genérico. A nulidade do argumento de tipo não corresponde à restrição 'notnull'.
ru: Тип не может быть использован как параметр типа в универсальном типе или методе. Допустимость значения NULL для аргумента типа не соответствует ограничению "notnull".
tr: Tür, genel tür veya metot için tür parametresi olarak kullanılamıyor. Tür bağımsız değişkeninin boş değer atanabilirliği, 'notnull' kısıtlamasıyla eşleşmiyor.
zh_hans: 类型不能用作泛型类型或方法中的类型参数。类型参数的为 Null 性与 "notnull" 约束不匹配。
zh_hant: 型別無法作為型別參數用於泛型型別或方法中。型別引數的可 Null 性與 'notnull' 限制式不符合。

# WRN_NullabilityMismatchInTypeParameterReferenceTypeConstraint
source: The type '{2}' cannot be used as type parameter '{1}' in the generic type or method '{0}'. Nullability of type argument '{2}' doesn't match 'class' constraint.
cs: Typ {2} nejde použít jako parametr typu {1} v obecném typu nebo metodě {0}. Typ argumentu {2} s možnou hodnotou null neodpovídá omezení třídy.
de: Der Typ "{2}" kann nicht als Typparameter "{1}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Die NULL-Zulässigkeit des Typarguments "{2}" entspricht nicht der class-Einschränkung.
es: El tipo "{2}" no se puede usar como parámetro de tipo "{1}" en el tipo o método genérico "{0}". La nulabilidad del argumento de tipo "{2}" no coincide con la restricción "class".
fr: Impossible d'utiliser le type '{2}' en tant que paramètre de type '{1}' dans le type ou la méthode générique '{0}'. La nullabilité de l'argument de type '{2}' ne correspond pas à la contrainte 'class'.
it: Non è possibile usare il tipo '{2}' come parametro di tipo '{1}' nel tipo generico o nel metodo '{0}'. Il supporto dei valori Null dell'argomento tipo '{2}' non corrisponde al vincolo 'class'.
ja: 型 '{2}' を、ジェネリック型またはメソッド '{0}' 内で型パラメーター '{1}' として使用することはできません。型引数 '{2}' の Null 許容性が 'class' 制約と一致しません。
ko: '{2}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{1}' 형식 매개 변수로 사용할 수 없습니다. '{2}' 형식 인수의 Null 허용 여부가 'class' 제약 조건과 일치하지 않습니다.
pl: Nie można użyć typu „{2}” jako parametru typu „{1}” w typie ogólnym lub metodzie „{0}”. Obsługa wartości null w argumencie typu „{2}” jest niezgodna z ograniczeniem „class”.
pt_br: O tipo '{2}' não pode ser usado como parâmetro de tipo '{1}' no tipo ou método genérico '{0}'. A anulabilidade do argumento de tipo '{2}' não corresponde à restrição 'class'.
ru: Тип "{2}" не может быть использован как параметр типа "{1}" в универсальном типе или методе "{0}". Допустимость значения NULL для аргумента типа "{2}" не соответствует ограничению "class".
tr: '{2}' türü '{0}' genel türü veya metodu için '{1}' tür parametresi olarak kullanılamıyor. '{2}' tür bağımsız değişkeninin boş değer atanabilirliği, 'class' kısıtlamasıyla eşleşmiyor.
zh_hans: 类型“{2}”不能用作泛型类型或方法“{0}”中的类型参数“{1}”。类型参数“{2}”的为 Null 性与 “class” 约束不匹配。
zh_hant: 型別 '{2}' 無法作為型別參數 '{1}' 用於泛型型別或方法 '{0}' 中。型別引數 '{2}' 的可 Null 性與 'class' 條件約束不符合。

# WRN_NullabilityMismatchInTypeParameterReferenceTypeConstraint_Title
source: The type cannot be used as type parameter in the generic type or method. Nullability of type argument doesn't match 'class' constraint.
cs: Typ nejde použít jako parametr typu v obecném typu nebo metodě. Typ argumentu s možnou hodnotou null neodpovídá omezení třídy.
de: Der Typ kann nicht als Typparameter im generischen Typ oder in der generischen Methode verwendet werden. Die NULL-Zulässigkeit des Typarguments entspricht nicht der class-Einschränkung.
es: El tipo no se puede usar como parámetro de tipo en el tipo o método genérico. La nulabilidad del argumento de tipo no coincide con la restricción "class"
fr: Impossible d'utiliser le type en tant que paramètre de type dans le type ou la méthode générique. La nullabilité de l'argument de type ne correspond pas à la contrainte 'class'.
it: Non è possibile usare il tipo come parametro di tipo nel tipo generico o nel metodo. Il supporto dei valori Null dell'argomento tipo non corrisponde al vincolo 'class'.
ja: この型を、ジェネリック型またはメソッド内で型パラメーターとして使用することはできません。型引数の Null 許容性が 'class' 制約と一致しません。
ko: 형식은 제네릭 형식 또는 메서드에서 형식 매개 변수로 사용할 수 없습니다. 형식 인수의 Null 허용 여부가 'class' 제약 조건과 일치하지 않습니다.
pl: Nie można użyć typu jako parametru typu w typie ogólnym lub metodzie. Obsługa wartości null w argumencie typu jest niezgodna z ograniczeniem „class”.
pt_br: O tipo não pode ser usado como parâmetro de tipo no tipo ou método genérico. A anulabilidade do argumento de tipo não corresponde à restrição 'class'.
ru: Тип не может быть использован как параметр типа в универсальном типе или методе. Допустимость значения NULL для аргумента типа не соответствует ограничению "class".
tr: Tür, genel tür veya metot için tür parametresi olarak kullanılamıyor. Tür bağımsız değişkeninin boş değer atanabilirliği, 'class' kısıtlamasıyla eşleşmiyor.
zh_hans: 类型不能用作泛型类型或方法中的类型参数。类型参数的为 Null 性与 “class” 约束不匹配。
zh_hant: 型別無法作為型別參數用於泛型型別或方法中。型別引數的可 Null 性與 'class' 條件約束不符合。

# WRN_NullableValueTypeMayBeNull
source: Nullable value type may be null.
cs: Typ hodnoty, která připouští hodnotu null, nemůže být null.
de: Ein Werttyp, der NULL zulässt, kann NULL sein.
es: Un tipo que acepta valores NULL puede ser nulo.
fr: Le type valeur Nullable peut avoir une valeur null.
it: Il tipo valore nullable non può essere Null.
ja: Null 許容値型は Null になる場合があります。
ko: Nullable 값 형식이 null일 수 있습니다.
pl: Typ wartości dopuszczający wartość null może być równy null.
pt_br: O tipo de valor de nulidade pode ser nulo.
ru: Тип значения, допускающего NULL, может быть NULL.
tr: Boş değer atanabilir değer türü null olabilir.
zh_hans: 可为 null 的值类型可为 null。
zh_hant: 可為 Null 的實值型別可為 Null。

# WRN_NullableValueTypeMayBeNull_Title
source: Nullable value type may be null.
cs: Typ hodnoty, která připouští hodnotu null, nemůže být null.
de: Ein Werttyp, der NULL zulässt, kann NULL sein.
es: Un tipo que acepta valores NULL puede ser nulo.
fr: Le type valeur Nullable peut avoir une valeur null.
it: Il tipo valore nullable non può essere Null.
ja: Null 許容値型は Null になる場合があります。
ko: Nullable 값 형식이 null일 수 있습니다.
pl: Typ wartości dopuszczający wartość null może być równy null.
pt_br: O tipo de valor de nulidade pode ser nulo.
ru: Тип значения, допускающего NULL, может быть NULL.
tr: Boş değer atanabilir değer türü null olabilir.
zh_hans: 可为 null 的值类型可为 null。
zh_hant: 可為 Null 的實值型別可為 Null。

# WRN_ParamUnassigned
source: The out parameter '{0}' must be assigned to before control leaves the current method
cs: Parametr out {0} se musí přiřadit ještě předtím, než aktuální metoda předá řízení.
fr: Le paramètre out '{0}' doit être assigné avant que le contrôle quitte la méthode actuelle
it: Il parametro out '{0}' deve essere assegnato prima che il controllo lasci il metodo corrente
ja: out パラメーター '{0}' はコントロールが現在のメソッドを抜ける前に割り当てられる必要があります
pl: Wartość parametru ze specyfikatorem out „{0}” musi być przypisana zanim sterowanie wyjdzie z bieżącej metody
pt_br: O parâmetro out "{0}" deve ser atribuído antes que o controle saia do método atual
ru: До передачи управления из текущего метода параметру, помеченному ключевым словом out, "{0}" должно быть присвоено значение.
zh_hans: 控制离开当前方法之前必须对 out 参数“{0}”赋值
zh_hant: 在程式控制權脫離目前的方法之前，必須指派 out 參數 '{0}'

# WRN_ParamUnassigned_Title
source: An out parameter must be assigned to before control leaves the method
cs: Parametr out se musí přiřadit ještě předtím, než metoda předá řízení
fr: Un paramètre out doit être assigné avant que le contrôle ne quitte la méthode
it: È necessario assegnare un parametro out prima che il controllo esca dal metodo
ja: out パラメーターは、制御がメソッドを抜ける前に割り当てる必要があります
pl: Wartość parametru ze specyfikatorem out musi być przypisana, zanim sterowanie wyjdzie z metody
pt_br: O parâmetro out precisa ser atribuído antes que o controle saia do método
ru: Параметру out должно быть присвоено значение до передачи управления из метода
zh_hans: 控制离开方法之前必须对 out 参数赋值
zh_hant: 在控制權離開方法之前，必須指派 out 參數

# WRN_ParameterConditionallyDisallowsNull
source: Parameter '{0}' must have a non-null value when exiting with '{1}'.
cs: Parametr {0} musí mít při ukončení s návratovou hodnotou {1} hodnotu jinou než null.
fr: Le paramètre '{0}' doit avoir une valeur non null au moment de la sortie avec '{1}'.
it: Il parametro '{0}' deve avere un valore non Null quando viene terminato con '{1}'.
ja: '{1}' で終了する場合、パラメーター '{0}' には null 以外の値が含まれている必要があります。
pl: Parametr „{0}” musi mieć wartość inną niż null podczas kończenia działania z wartością „{1}”.
pt_br: O parâmetro '{0}' deve ter um valor não nulo durante a saída com '{1}'.
ru: Параметр "{0}" должен иметь значение, отличное от NULL, при выходе с "{1}".
zh_hans: 当使用 "{1}" 退出时，参数 "{0}" 必须具有非 null 值。
zh_hant: 參數 '{0}' 在以 '{1}' 結束時必須具有非 Null 值。

# WRN_ParameterConditionallyDisallowsNull_Title
source: Parameter must have a non-null value when exiting in some condition.
cs: Parametr musí mít při ukončení za určité podmínky hodnotu jinou než null
fr: Le paramètre doit avoir une valeur non null au moment de la sortie dans certaines conditions.
it: Il parametro deve avere un valore non Null quando viene terminato in determinate condizioni.
ja: 一部の条件で終了するとき、パラメーターには null 以外の値が含まれている必要があります。
pl: Parametr musi mieć wartość inną niż null podczas kończenia działania w pewnym stanie.
pt_br: O parâmetro deve ter um valor não nulo durante a saída em alguma condição.
ru: Параметр должен иметь значение, отличное от NULL, при выходе в определенном состоянии.
zh_hans: 在某些条件下退出时，参数必须具有非 null 值。
zh_hant: 參數在某些條件下結束時必須具有非 Null 值。

# WRN_ParameterDisallowsNull
source: Parameter '{0}' must have a non-null value when exiting.
cs: Parametr {0} musí mít při ukončení hodnotu jinou než null.
fr: Le paramètre '{0}' doit avoir une valeur non null au moment de la sortie.
it: Il parametro '{0}' deve avere un valore non Null quando viene terminato.
ja: 終了時にパラメーター '{0}' には null 以外の値が含まれている必要があります。
pl: Parametr „{0}” musi mieć wartość inną niż null podczas kończenia działania.
pt_br: O parâmetro '{0}' deve ter um valor não nulo ao sair.
ru: Параметр "{0}" должен иметь значение, отличное от NULL, при выходе.
zh_hans: 退出时，参数 "{0}" 必须具有非 null 值。
zh_hant: 參數 '{0}' 在結束時必須具有非 Null 值。

# WRN_ParameterDisallowsNull_Title
source: Parameter must have a non-null value when exiting.
cs: Parametr musí mít při ukončení hodnotu jinou než null
fr: Le paramètre doit avoir une valeur non null au moment de la sortie.
it: Il parametro deve avere un valore non Null quando viene terminato.
ja: 終了時にパラメーターには null 以外の値が含まれている必要があります。
pl: Parametr musi mieć wartość inną niż null podczas kończenia działania.
pt_br: O parâmetro deve ter um valor não nulo ao sair.
ru: Параметр должен иметь значение, отличное от NULL, при выходе.
zh_hans: 退出时，参数必须具有非 null 值。
zh_hant: 參數在結束時必須具有非 Null 值。

# WRN_ParameterIsStaticClass
source: '{0}': static types cannot be used as parameters
cs: {0}: Statické typy nejde používat jako parametry.
fr: '{0}' : les types static ne peuvent pas être utilisés comme paramètres
it: '{0}': i tipi statici non possono essere usati come parametri
ja: '{0}': スタティック型はパラメーターとして使用することはできません
pl: „{0}”: typów statycznych nie można użyć jako parametrów
pt_br: "{0}": classes static não podem ser utilizadas como parâmetros
ru: "{0}": нельзя использовать статические типы в качестве параметров.
zh_hans: “{0}”: 静态类型不能用作参数
zh_hant: '{0}': 靜態類型不可用做為參數

# WRN_ParameterIsStaticClass_Title
source: Static types cannot be used as parameters
cs: Statické typy se nedají používat jako parametry
fr: Les types statiques ne peuvent pas être utilisés en tant que paramètres
it: I tipi statici non possono essere usati come parametri
ja: スタティック型をパラメーターとして使用することはできない
pl: Typów statycznych nie można używać jako parametrów
pt_br: Tipos estáticos não podem ser usados como parâmetros
ru: Статические типы не могут использоваться в качестве параметров
zh_hans: 静态类型不能用作参数
zh_hant: 靜態類型不可用作參數

# WRN_PrecedenceInversion
source: Operator '{0}' cannot be used here due to precedence. Use parentheses to disambiguate.
cs: Operátor {0} se tady nedá použít kvůli prioritám. Odstraňte nejednoznačnost pomocí závorek.
fr: L'opérateur '{0}' ne peut pas être utilisé ici en raison de la précédence. Utilisez des parenthèses pour lever l'ambiguïté.
it: A causa della precedenza, non è possibile usare l'operatore '{0}' in questo punto. Usare le parentesi per evitare ambiguità.
ja: 優先順位の理由から、こちらで演算子 '{0}' は使用できません。かっこを使用して明確にしてください。
pl: Nie można użyć operatora „{0}” w tym miejscu z powodu pierwszeństwa. Użyj nawiasów w celu rozróżnienia.
pt_br: O operador '{0}' não pode ser usado aqui devido à precedência. Use parênteses para desambiguação.
ru: Не удается использовать оператор "{0}" в этом месте из-за приоритета. Для устранения неоднозначности используйте круглые скобки.
zh_hans: 由于优先级，无法在此处使用运算符“{0}”。使用括号可消除歧义。
zh_hant: 因為受限於優先順序，所以無法在此使用運算子 '{0}'。請使用括弧消除歧義。

# WRN_PrecedenceInversion_Title
source: Operator cannot be used here due to precedence.
cs: Operátor se tady nedá použít kvůli prioritám
fr: L'opérateur ne peut pas être utilisé ici en raison de la précédence.
it: A causa della precedenza, non è possibile usare l'operatore in questo punto.
ja: 優先順位の理由から、こちらで演算子は使用できません。
pl: Nie można użyć operatora w tym miejscu z powodu pierwszeństwa.
pt_br: O operador não pode ser usado aqui devido à precedência.
ru: Не удается использовать оператор в этом месте из-за приоритета
zh_hans: 由于优先级，无法在此处使用运算符。
zh_hant: 因為受限於優先順序，所以無法在此使用運算子。

# WRN_PatternNotPublicOrNotInstance
source: '{0}' does not implement the '{1}' pattern. '{2}' is not a public instance or extension method.
cs: {0} neimplementuje vzor {1}. {2} není veřejná metoda instance nebo rozšíření.
fr: '{0}' n'implémente pas le modèle '{1}'. '{2}' n'est pas une méthode d'extension ou d'instance publique.
it: '{0}' non implementa il criterio '{1}'. '{2}' non è un metodo di estensione o istanza pubblico.
ja: '{0}' は、パターン '{1}' を実装しません。'{2}' は、パブリック インスタンスまたは拡張メソッドではありません。
pl: Element „{0}” nie implementuje wzorca „{1}”. Element „{2}” nie jest wystąpieniem publicznym ani metodą rozszerzenia.
pt_br: '{0}' não implementa o padrão '{1}'. '{2}' não é um método de extensão ou de instância pública.
ru: "{0}" не реализует шаблон "{1}". "{2}" не является общедоступным экземпляром либо методом расширения.
zh_hans: “{0}”不实现“{1}”模式。“{2}”不是公共实例或扩展方法。
zh_hant: 因為 '{2}' 並非公用執行個體或延伸模組方法，所以 '{0}' 未實作 '{1}' 模式。

# WRN_PatternNotPublicOrNotInstance_Title
source: Type does not implement the collection pattern; member is is not a public instance or extension method.
cs: Typ neimplementuje vzor kolekce. Člen není veřejná metoda instance nebo rozšíření
fr: Le type n'implémente pas le modèle de collection ; le membre n'est pas une méthode d'extension ou d'instance publique.
it: Il tipo non implementa il criterio di raccolta. Il membro non è un metodo di estensione o istanza pubblico.
ja: 型は、コレクション パターンを実装しません。メンバーはパブリック インスタンスまたは拡張メソッドではありません。
pl: Typ nie implementuje wzorca kolekcji; składowa nie jest publicznym wystąpieniem ani metodą rozszerzenia.
pt_br: O tipo não implementa o padrão de coleção; o membro não é um método de extensão ou de instância pública.
ru: Тип не реализует шаблон коллекции; член не является общедоступным экземпляром или методом расширения.
zh_hans: 类型不实现集合模式；成员不是公共实例或扩展方法。
zh_hant: 型別未實作集合模式; 成員非公用執行個體或延伸模組方法。

# WRN_ReturnTypeIsStaticClass
source: '{0}': static types cannot be used as return types
cs: {0}: Statické typy nejde používat jako typy vracených hodnot.
fr: '{0}' : les types static ne peuvent pas être utilisés en tant que types de retour
it: '{0}': i tipi statici non possono essere usati come tipi restituiti
ja: '{0}': スタティック型を戻り値の型として使用することはできません
pl: „{0}”: typów statycznych nie można użyć jako typów w instrukcji return
pt_br: "{0}": tipos static não podem ser usados como tipos de retorno
ru: "{0}": нельзя использовать статические типы в качестве возвращаемых типов.
zh_hans: “{0}”: 静态类型不能用作返回类型
zh_hant: '{0}': 靜態類型不可用做為傳回類型
