Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CallingFinalizeDeprecated
source: Destructors and object.Finalize cannot be called directly. Consider calling IDisposable.Dispose if available.
cs: Destruktory a metodu object.Finalize nejde volat přímo. Zvažte možnost volání metody IDisposable.Dispose, pokud je k dispozici.
de: Destruktoren und object.Finalize können nicht direkt aufgerufen werden. Rufen Sie IDisposable.Dispose auf, sofern verfügbar.
es: Los destructores y object.Finalize no se pueden llamar directamente. Puede llamar a IDisposable.Dispose si está disponible.
fr: Impossible d'appeler directement des destructeurs et object.Finalize. Appelez IDisposable.Dispose s'il est disponible.
it: Impossibile chiamare direttamente i distruttori e object.Finalize. Provare a chiamare IDisposable.Dispose se disponibile.
ja: デストラクター と object.Finalize を直接呼び出すことはできません。使用可能であれば IDisposable.Dispose を呼び出してください。
ko: 소멸자 및 object.Finalize는 직접 호출할 수 없습니다. 가능한 경우 IDisposable.Dispose를 호출하세요.
pl: Destruktory i metoda object.Finalize nie mogą być bezpośrednio wywoływane. Rozważ wywołanie metody IDisposable.Dispose, jeżeli jest dostępna.
pt_br: Destruidores e object.Finalize não podem ser chamados diretamente. Chame IDisposable.Dispose, se disponível.
ru: Непосредственный вызов деструкторов и функций object.Finalize запрещен. Рекомендуется вызов функции IDisposable.Dispose, если она доступна.
tr: Yıkıcılar ve object.Finalize doğrudan çağrılamaz. Kullanılabiliyorsa IDisposable.Dispose çağırmayı düşünün.
zh_hans: 无法直接调用析构函数和 object.Finalize。如果可用，请考虑调用 IDisposable.Dispose。
zh_hant: 無法直接呼叫解構函式與 object.Finalize。請考慮呼叫 IDisposable.Dispose (若有的話)。

# ERR_SingleTypeNameNotFound
source: The type or namespace name '{0}' could not be found (are you missing a using directive or an assembly reference?)
cs: Typ nebo název oboru názvů {0} se nenašel. (Nechybí direktiva using nebo odkaz na sestavení?)
de: Der Typ- oder Namespacename "{0}" wurde nicht gefunden (möglicherweise fehlt eine using-Direktive oder ein Assemblyverweis).
es: El nombre del tipo o del espacio de nombres '{0}' no se encontró (¿falta una directiva using o una referencia de ensamblado?)
fr: Le nom de type ou d'espace de noms '{0}' est introuvable (vous manque-t-il une directive using ou une référence d'assembly ?)
it: Il nome di tipo o di spazio dei nomi '{0}' non è stato trovato. Probabilmente manca una direttiva using o un riferimento all'assembly.
ja: 型または名前空間の名前 '{0}' が見つかりませんでした (using ディレクティブまたはアセンブリ参照が指定されていることを確認してください)
ko: {0}' 형식 또는 네임스페이스 이름을 찾을 수 없습니다. using 지시문 또는 어셈블리 참조가 있는지 확인하세요.
pl: Nie można znaleźć nazwy typu lub przestrzeni nazw „{0}” (brak dyrektywy using lub odwołania do zestawu?)
pt_br: O nome do tipo ou do namespace "{0}" não pode ser encontrado (está faltando uma diretiva using ou uma referência de assembly?)
ru: Не удалось найти тип или имя пространства имен "{0}" (возможно, отсутствует директива using или ссылка на сборку).
tr: {0}' türü veya ad alanı adı bulunamadı (bir using yönergeniz veya derleme başvurunuz mu eksik?)
zh_hans: 未能找到类型或命名空间名“{0}”(是否缺少 using 指令或程序集引用?)
zh_hant: 找不到類型或命名空間名稱 '{0}' (是否遺漏了 using 指示詞或組件參考?)

# ERR_NegativeStackAllocSize
source: Cannot use a negative size with stackalloc
cs: Ve výrazu stackalloc nejde použít zápornou velikost.
de: Mit "stackalloc" kann keine negative Größe verwendet werden.
es: No se puede utilizar un tamaño negativo con stackalloc
fr: Impossible d'utiliser une taille négative avec stackalloc
it: Impossibile utilizzare dimensioni negative con stackalloc
ja: stackalloc で負のサイズを使うことはできません
ko: stackalloc에는 음수 크기를 사용할 수 없습니다.
pl: Nie można użyć ujemnego rozmiaru w przypadku słowa kluczowego stackalloc
pt_br: Não é possível usar um tamanho negativo com stackalloc
ru: stackalloc не может использоваться вместе с отрицательным размером.
tr: stackalloc ile negatif boyut kullanılamaz
zh_hans: 无法对 stackalloc 采用负值大小
zh_hant: stackalloc 無法使用負值大小

# ERR_NegativeArraySize
source: Cannot create an array with a negative size
cs: Nejde vytvořit pole se zápornou velikostí.
de: Ein Array mit einer negativen Größe kann nicht erstellt werden.
es: No se puede crear una matriz con un tamaño negativo
fr: Impossible de créer un tableau avec une taille négative
it: Non è possibile creare matrici con dimensioni negative
ja: 負のサイズで配列を作成することはできません
ko: 음수 크기의 배열은 만들 수 없습니다.
pl: Nie można utworzyć tablicy z ujemnym rozmiarem
pt_br: Não é possível criar uma matriz com um tamanho negativo
ru: Невозможно создать массив с отрицательным размером.
tr: Boyutu negatif olan dizi oluşturulamaz
zh_hans: 无法创建大小为负值的数组
zh_hant: 無法以負值大小建立陣列

# ERR_OverrideFinalizeDeprecated
source: Do not override object.Finalize. Instead, provide a destructor.
cs: Nepřepisujte metodu object.Finalize. Raději použijte destruktor.
de: Überschreiben Sie nicht object.Finalize, sondern stellen Sie einen Destruktor bereit.
es: No invalide object.Finalize. En su lugar, proporcione un destructor.
fr: Ne pas substituer object.Finalize. Fournir un destructeur à la place.
it: Non eseguire l'override di object.Finalize. Fornire un distruttore.
ja: object.Finalize をオーバーライドしないでください。代わりにデストラクターを提供してください。
ko: object.Finalize를 재정의하는 대신 소멸자를 제공하세요.
pl: Nie przesłaniaj metody object.Finalize. Zamiast tego udostępnij destruktor.
pt_br: Em vez de substituir object.Finalize, forneça um destruidor.
ru: Не следует переопределять object.Finalize. Укажите деструктор.
tr: object.Finalize'ı geçersiz kılmayın. Bunun yerine bir yıkıcı sağlayın.
zh_hans: 请不要重写 object.Finalize，而是提供一个析构函数。
zh_hant: 請勿覆寫 object.Finalize，請改為提供解構函式。

# ERR_CallingBaseFinalizeDeprecated
source: Do not directly call your base type Finalize method. It is called automatically from your destructor.
cs: Nevolejte přímo metodu Finalize základního typu. Tuto metodu volá automaticky destruktor.
fr: N'appelez pas directement votre méthode Finalize du type de base. Elle est automatiquement appelée à partir de votre destructeur.
it: Non chiamare direttamente il metodo Finalize del tipo di base. Viene chiamato automaticamente dal distruttore.
ja: 基本データ型の Finalize メソッドを直接呼び出さないでください。デストラクターから自動的に呼び出されます。
pl: Nie wywołuj bezpośrednio metody Finalize typu bazowego. Metoda jest wywoływana automatycznie z destruktora.
pt_br: Não chame diretamente o método Finalize do tipo base. Ele é chamado automaticamente pelo destruidor.
ru: Не вызывайте метод Finalize базового типа напрямую. Он вызывается автоматически из деструктора.
zh_hans: 不要直接调用基类型 Finalize 方法。它将从析构函数中自动调用。
zh_hant: 請勿直接呼叫您的基底類型 Finalize 方法。其會從您的解構函式自動呼叫。

# WRN_NegativeArrayIndex
source: Indexing an array with a negative index (array indices always start at zero)
cs: Došlo k indexování pole záporným indexem (indexy polí vždy začínají hodnotou 0).
de: Indizierung eines Arrays mit einem negativen Index (Arrayindizes starten immer mit Null).
es: Indizando una matriz con un índice negativo (los índices de matriz siempre comienzan por cero)
fr: Indexation d'un tableau avec un index négatif (les index de tableau commencent toujours à zéro)
it: Indicizzazione di una matrice con indice negativo. Gli indici di matrice iniziano sempre da zero
ja: 負のインデックスで配列します。配列は常にゼロからの開始を示します
ko: 음수 인덱스를 사용하여 배열을 인덱싱했습니다. 배열 인덱스는 항상 0부터 시작합니다.
pl: Indeksowanie tablicy z ujemnym indeksem (indeksy tablicy zawsze rozpoczynają się od zera)
pt_br: Indexando uma matriz com um índice negativo (índices de matriz sempre começam em zero)
ru: Индексирование массива с отрицательным индексом (индексы массива всегда начинаются с нуля)
tr: Bir dizi için negatif dizin kullanılıyor (dizi dizinleri her zaman sıfırdan başlar)
zh_hans: 用负索引对数组进行索引(数组索引总是从零开始)
zh_hant: 正在以負值索引檢索陣列 (陣列索引一律從 0 開始)

# WRN_NegativeArrayIndex_Title
source: Indexing an array with a negative index
cs: Došlo k indexování pole záporným indexem.
de: Indiziert einen Array mit einem negativen Index
es: Indexando una matriz con un índice negativo
fr: Indexation d'un tableau avec un index négatif
it: Indicizzazione di una matrice con un indice negativo
ja: 負のインデックスで配列をインデックス付けしています
ko: 음수 인덱스를 사용하여 배열을 인덱싱했습니다.
pl: Indeksowanie tablicy z ujemnym indeksem
pt_br: Indexando uma matriz com um índice negativo
ru: Индексация массива с отрицательным индексом
tr: Negatif dizin ile bir dizi dizine alınıyor
zh_hans: 正在使用负值对数组编制索引
zh_hant: 對具有負索引的陣列編製索引

# WRN_BadRefCompareLeft
source: Possible unintended reference comparison; to get a value comparison, cast the left hand side to type '{0}'
cs: Možná došlo k neúmyslnému porovnání ukazatelů; chcete-li porovnat hodnoty, přetypujte levou stranu na typ {0}.
de: Unbeabsichtigter Verweisvergleich. Wandeln Sie die linke Seite in den Typ "{0}" um, um einen Wertvergleich durchzuführen.
es: Posible comparación de referencias no intencionada; para obtener una comparación de valores, convierta el lado de la izquierda en el tipo '{0}'
fr: Possibilité d'une comparaison de références involontaire ; pour obtenir une comparaison de valeurs, effectuez un cast de la partie gauche en type '{0}'
it: È probabile che il confronto dei riferimenti non sia intenzionale. Per confrontare i valori, eseguire il cast dell'espressione di sinistra sul tipo '{0}'
ja: 予期しない参照比較です。比較値を取得するには型 '{0}' に左辺をキャストしてください
ko: 의도하지 않은 참조 비교가 있을 수 있습니다. 값 비교를 가져오려면 왼쪽을 '{0}' 형식으로 캐스팅하세요.
pl: Możliwe niezamierzone porównanie odwołań. Aby porównać wartości, wykonaj rzutowanie lewej strony na typ „{0}”
pt_br: Comparação de referência não intencional possível; para obter uma comparação de valor, converta o lado esquerdo para o tipo "{0}"
ru: Возможно, непреднамеренное сравнение ссылок; для получения сравнения значений приведите левую часть к типу "{0}".
tr: Olası istenmeden yapılan başvuru karşılaştırması; değer karşılaştırması almak için sol tarafı '{0}' türüne atayın
zh_hans: 可能非有意的引用比较；若要获取值比较，请将左边转换为类型“{0}”
zh_hant: 可能誤用了參考比較; 若要進行數值比較，請將左側轉型為類型 '{0}'

# WRN_BadRefCompareLeft_Title
source: Possible unintended reference comparison; left hand side needs cast
cs: Pravděpodobně došlo k neúmyslnému porovnání odkazů. Je třeba přetypovat levou stranu.
de: Möglicher unbeabsichtigter Referenzvergleich; linke Seite muss umgewandelt werden.
es: Posible comparación de referencias involuntaria: El lado de la mano izquierda necesita conversión
fr: Possibilité d'une comparaison de références involontaire ; la partie gauche a besoin d'un cast
it: Possibile confronto non intenzionale dei riferimenti. Eseguire il cast del lato sinistro
ja: 予期しない参照比較です。左辺をキャストする必要があります
ko: 의도하지 않은 참조 비교가 있을 수 있습니다. 왼쪽을 캐스팅해야 합니다.
pl: Możliwe niezamierzone porównanie odwołań; lewa strona wymaga rzutowania
pt_br: Possível comparação de referência inesperada; o lado esquerdo precisa de conversão
ru: Возможно, использовано непреднамеренное сравнение ссылок: для левой стороны требуется приведение
tr: İstenmeden yapılmış olabilecek başvuru karşılaştırması, sol taraf için atama gerekiyor
zh_hans: 可能非有意的引用比较；左侧需要强制转换
zh_hant: 可能誤用參考比較; 左端需要轉換

# WRN_BadRefCompareRight
source: Possible unintended reference comparison; to get a value comparison, cast the right hand side to type '{0}'
cs: Možná došlo k neúmyslnému porovnání ukazatelů; chcete-li porovnat hodnoty, přetypujte pravou stranu na typ {0}.
de: Unbeabsichtigter Verweisvergleich. Wandeln Sie die rechte Seite in den Typ "{0}" um, um einen Wertvergleich durchzuführen.
es: Posible comparación de referencias no intencionada; para obtener una comparación de valores, convierta el lado de la derecha en el tipo '{0}'
fr: Possibilité d'une comparaison de références involontaire ; pour obtenir une comparaison de valeurs, effectuez un cast de la partie droite en type '{0}'
it: È probabile che il confronto dei riferimenti non sia intenzionale. Per confrontare i valori, eseguire il cast dell'espressione di destra sul tipo '{0}'
ja: 予期しない参照比較です。比較値を取得するには型 '{0}' に右辺をキャストしてください
ko: 의도하지 않은 참조 비교가 있을 수 있습니다. 값 비교를 가져오려면 오른쪽을 '{0}' 형식으로 캐스팅하세요.
pl: Możliwe niezamierzone porównanie odwołań. Aby porównać wartości, wykonaj rzutowanie prawej strony na typ „{0}”
pt_br: Comparação de referência não intencional possível; para obter uma comparação de valor, converta o lado direito no tipo "{0}"
ru: Возможно, непреднамеренное сравнение ссылок; для получения сравнения значений приведите правую часть к типу "{0}".
tr: Olası istenmeden yapılan başvuru karşılaştırması; değer karşılaştırması almak için sağ tarafı '{0}' türüne atayın
zh_hans: 可能非有意的引用比较；若要获取值比较，请将右边转换为类型“{0}”
zh_hant: 可能誤用了參考比較; 若要進行數值比較，請將右側轉型為類型 '{0}'

# WRN_BadRefCompareRight_Title
source: Possible unintended reference comparison; right hand side needs cast
cs: Pravděpodobně došlo k neúmyslnému porovnání odkazů. Je třeba přetypovat pravou stranu.
de: Möglicher unbeabsichtigter Referenzvergleich; rechte Seite muss umgewandelt werden
es: Posible comparación de referencias involuntaria. El lado de la mano derecha necesita conversión
fr: Possibilité d'une comparaison de références involontaire ; la partie droite a besoin d'un cast
it: Possibile confronto non intenzionale dei riferimenti. Eseguire il cast del lato destro
ja: 予期しない参照比較です。右辺をキャストする必要があります
ko: 의도하지 않은 참조 비교가 있을 수 있습니다. 오른쪽을 캐스팅해야 합니다.
pl: Możliwe niezamierzone porównanie odwołań; prawa strona wymaga rzutowania
pt_br: Possível comparação de referência inesperada; o lado direito precisa de conversão
ru: Возможно, использовано непреднамеренное сравнение ссылок: для правой стороны требуется приведение
tr: İstenmeden yapılmış olabilecek başvuru karşılaştırması, sağ taraf için atama gerekiyor
zh_hans: 可能非有意的引用比较；右侧需要强制转换
zh_hant: 可能誤用參考比較; 右端需要轉換

# ERR_BadCastInFixed
source: The right hand side of a fixed statement assignment may not be a cast expression
cs: Pravá strana přiřazení příkazu fixed nemůže být výrazem přetypování.
de: Die rechte Seite einer fixed-Anweisungszuweisung darf kein Umwandlungsausdruck sein.
es: El lado derecho de una asignación de instrucción "fixed" no puede ser una expresión de conversión
fr: La partie droite d'une assignation d'instruction fixed peut ne pas être une expression de cast
it: La parte destra dell'assegnazione di un'istruzione fixed non può essere un'espressione cast
ja: fixed ステートメントの代入式の右辺はキャスト式ではない可能性があります
ko: fixed 문의 오른쪽에는 캐스트 식을 할당할 수 없습니다.
pl: Prawa strona przypisania instrukcji fixed nie może być wyrażeniem rzutowania
pt_br: É possível que o lado direito de uma atribuição de instrução fixed não seja uma expressão de conversão
ru: Правая часть назначения оператора fixed не может быть выражением приведения типа.
tr: Fixed deyimi atamasının sağ tarafı bir dönüştürme ifadesi olamaz
zh_hans: fixed 语句赋值的右边不能是强制转换表达式
zh_hant: fixed 陳述式指派的右側，不可為 cast 運算式

# ERR_StackallocInCatchFinally
source: stackalloc may not be used in a catch or finally block
cs: Výraz stackalloc nejde použít v bloku catch nebo finally.
de: "stackalloc" darf nicht in einem catch- oder finally-Block verwendet werden.
es: stackalloc no se puede usar en un bloque catch o finally
fr: stackalloc ne peut être utilisé dans un bloc catch ou finally
it: stackalloc non può essere usato in un blocco catch o finally
ja: stackalloc は catch または finally ブロックで使用されない可能性があります
ko: stackalloc는 catch 또는 finally 블록에 사용할 수 없습니다.
pl: Słowo kluczowe stackalloc nie może być używane w bloku catch lub finally
pt_br: stackalloc não pode ser usado em um bloco catch ou finally
ru: stackalloc не может использоваться в блоке catch или в блоке finally.
tr: stackalloc bir catch veya finally bloğunda kullanılamaz
zh_hans: stackalloc 不能用在 catch 或 finally 块中
zh_hant: 在 catch 或 finally 區塊中不可使用 stackalloc

# ERR_VarargsLast
source: An __arglist parameter must be the last parameter in a parameter list
cs: Parametr __arglist musí být posledním parametrem v seznamu parametrů
fr: Le paramètre __arglist doit être le dernier paramètre spécifié dans une liste de paramètres
it: Un parametro __arglist deve essere l'ultimo parametro in un elenco di parametri
ja: __arglist パラメーターは、パラメーター リストの最後のパラメーターでなければなりません
pl: Parametr __arglist musi być ostatnim parametrem formalnej listy parametrów
pt_br: Um parâmetro __arglist deve ser o último parâmetro em uma lista de parâmetros
ru: Параметр __arglist должен быть последним в списке параметров.
zh_hans: __arglist 参数必须是参数列表中的最后一个参数
zh_hant: __arglist 參數必須是參數清單的最後一個參數

# ERR_MissingPartial
source: Missing partial modifier on declaration of type '{0}'; another partial declaration of this type exists
cs: Chybí částečný modifikátor deklarace typu {0}; existuje jiná částečná deklarace tohoto typu.
de: Ein partial-Modifizierer in der Deklaration des Typs "{0}" fehlt. Es ist eine andere partielle Deklaration dieses Typs vorhanden.
es: Falta el modificador parcial en la declaración de tipo '{0}'; existe otra declaración parcial de este tipo
fr: Modificateur partiel manquant dans la déclaration de type '{0}' ; il existe une autre déclaration partielle de ce type
it: Manca il modificatore parziale nella dichiarazione di tipo '{0}'. È presente un'altra dichiarazione parziale di questo tipo
ja: partial 修飾子が型 '{0}' にありません。この型の別の部分宣言が存在します
ko: {0}' 형식의 선언에 partial 한정자가 없습니다. 형식이 같은 다른 partial 선언이 이미 있습니다.
pl: Brak częściowego modyfikatora w deklaracji typu „{0}”. Istnieje inna częściowa deklaracja tego typu
pt_br: Modificador parcial ausente na declaração do tipo "{0}"; existe outra declaração parcial deste tipo
ru: Отсутствует модификатор partial в объявлении типа "{0}"; существует другое разделяемое объявление этого типа.
tr: {0}' türündeki bildirimde partial değiştiricisi eksik; bu türün başka bir partial bildirimi var
zh_hans: 类型“{0}”的声明上缺少 partial 修饰符；存在此类型的其他分部声明
zh_hant: 類型 '{0}' 的宣告中遺漏 partial 修飾元; 還存在此類型的其他部分宣告

# ERR_PartialTypeKindConflict
source: Partial declarations of '{0}' must be all classes, all record classes, all structs, all record structs, or all interfaces
cs: Částečné deklarace {0} musí být jen třídy, jen třídy záznamů, jen struktury, jen struktury záznamů nebo jen rozhraní.
fr: Les déclarations partielles de '{0}' doivent être toutes les classes, toutes les classes d’enregistrement, tous les structs, tous les structs d’enregistrement ou toutes les interfaces
it: Le dichiarazioni parziali di '{0}' devono essere costituite solo da classi, classi di record, struct di record o interfacce
ja: '{0}' の partial 宣言は、すべてのクラス、すべてのレコード クラス、すべての構造体、すべてのレコード構造体、すべてのインターフェイスのいずれかにする必要があります
pl: Wszystkie częściowe deklaracje elementu "{0}" muszą być klasami, klasami rekordów, strukturami rekordów lub interfejsami
pt_br: As declarações parciais de '{0}' precisam ser todas classes, todas classes de registros, structs, todos registros de structs ou todas as interfaces
ru: Все разделяемые объявления "{0}" должны относиться к одному типу (классы, классы записей, записи, структуры, структуры записей или интерфейсы)
zh_hans: '{0}' 的部分声明必须为所有类、所有记录、所有结构、所有记录结构或所有接口
zh_hant: '{0}' 中有一部分宣告必須全是類別、全是記錄類別、全是結構、全是記錄結構，或全是介面

# ERR_PartialModifierConflict
source: Partial declarations of '{0}' have conflicting accessibility modifiers
cs: Částečné deklarace {0} mají konfliktní modifikátory dostupnosti.
de: Partielle Deklarationen von "{0}" haben Zugriffsmodifizierer, die miteinander einen Konflikt verursachen.
es: Las declaraciones parciales de '{0}' tienen modificadores de accesibilidad que entran en conflicto
fr: Les déclarations partielles de '{0}' ont des modificateurs d'accessibilité en conflit
it: Le dichiarazioni parziali di '{0}' contengono modificatori di accessibilità in conflitto
ja: '{0}' の partial 宣言には競合するアクセシビリティ修飾子が含まれています
ko: {0}'의 partial 선언에 충돌하는 액세스 가능성 한정자가 포함되어 있습니다.
pl: Modyfikatory dostępu częściowych deklaracji elementu „{0}” powodują konflikt
pt_br: Declarações parciais de "{0}" têm modificadores de acessibilidade conflitantes
ru: Конфликт модификаторов доступа в разделяемых объявлениях "{0}".
tr: {0}' öğesinin kısmi bildirimleri çakışan erişilebilirlik değiştiricilerine sahip
zh_hans: “{0}”的分部声明包含冲突的可访问性修饰符
zh_hant: '{0}' 的部分宣告出現相 衝突的存取範圍修飾元

# ERR_PartialMultipleBases
source: Partial declarations of '{0}' must not specify different base classes
cs: Částečné deklarace {0} nesmí určovat různé základní třídy.
de: Partielle Deklarationen von "{0}" dürfen keine unterschiedlichen Basisklassen angeben.
es: Las declaraciones parciales de '{0}' no deben especificar clases base diferentes
fr: Les déclarations partielles de '{0}' ne doivent pas spécifier des classes de base différentes
it: Le dichiarazioni parziali di '{0}' non devono specificare classi base diverse
ja: '{0}' の partial 宣言では、異なる基底クラスを指定してはいけません
ko: {0}'의 partial 선언에는 서로 다른 기본 클래스를 지정할 수 없습니다.
pl: Częściowe deklaracje elementu „{0}” nie mogą określać różnych klas bazowych
pt_br: Declarações parciais de "{0}" não devem especificar classes base diferentes
ru: Разделяемые объявления "{0}" не должны указывать различные базовые классы.
tr: {0}' öğesinin kısmi bildirimleri farklı temel sınıflar belirtmemelidir
zh_hans: “{0}”的分部声明一定不能指定不同的基类
zh_hant: '{0}' 的部分宣告不得指定不同的基底類別

# ERR_PartialWrongTypeParams
source: Partial declarations of '{0}' must have the same type parameter names in the same order
cs: Částečné deklarace {0} musí mít stejné názvy parametrů typů ve stejném pořadí.
de: Partielle Deklarationen von "{0}" müssen die gleichen Typparameternamen in der gleichen Reihenfolge aufweisen.
es: Las declaraciones parciales de '{0}' deben tener los mismos nombres de parámetros de tipo en el mismo orden
fr: Les déclarations partielles de '{0}' doivent avoir les mêmes noms de paramètre de type dans le même ordre
it: Le dichiarazioni parziali di '{0}' devono avere gli stessi nomi di parametro di tipo nello stesso ordine
ja: '{0}' の partial 宣言では、同じ型パラメーター名を同じ順序で指定しなければなりません
ko: {0}'의 partial 선언은 형식 매개 변수 이름과 그 순서가 같아야 합니다.
pl: Częściowe deklaracje elementu „{0}” muszą mieć takie same nazwy parametrów typu w takiej samej kolejności
pt_br: Declarações parciais de "{0}" devem ter os mesmos nomes de parâmetro de tipo na mesma ordem
ru: В разделяемых объявлениях "{0}" имена параметров типов и их порядок должны быть одинаковыми.
tr: {0}' öğesinin kısmi bildirimleri aynı sırada aynı tür parametresi adlarına sahip olmalıdır
zh_hans: “{0}”的分部声明必须具有顺序相同的相同类型参数名
zh_hant: '{0}' 的部分宣告必須要有相同順序的相同類型參數名稱

# ERR_PartialWrongConstraints
source: Partial declarations of '{0}' have inconsistent constraints for type parameter '{1}'
cs: Částečné deklarace {0} mají nekonzistentní omezení parametru typu {1}.
de: Partielle Deklarationen von "{0}" weisen inkonsistente Einschränkungen für den {1}-Typparameter auf.
es: Las declaraciones parciales de '{0}' tienen restricciones incoherentes para el parámetro de tipo '{1}'
fr: Les déclarations partielles de '{0}' ont des contraintes incohérentes pour le paramètre de type '{1}'
it: Le dichiarazioni parziali di '{0}' contengono vincoli incoerenti per il parametro di tipo '{1}'
ja: '{0}' の partial 宣言には、型パラメーター '{1}' に対して矛盾する制約が含まれています
ko: {0}'의 partial 선언에는 '{1}' 형식 매개 변수의 제약 조건에 일관성이 없습니다.
pl: Częściowe deklaracje elementu „{0}” mają niezgodne ograniczenia parametru typu „{1}”
pt_br: Declarações parciais de "{0}" têm restrições inconsistentes para o parâmetro de tipo "{1}"
ru: Несовместимые ограничения для параметров типа "{1}" в разделяемых объявлениях "{0}".
tr: {0}' öğesinin kısmi bildirimleri, '{1}' tür parametresi için tutarsız kısıtlamalara sahip
zh_hans: “{0}”的分部声明对类型参数“{1}”具有不一致的约束
zh_hant: '{0}' 的部分宣告對類型參數 '{1}' 有不一致的條件約束
