Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UnreferencedField_Title
source: Field is never used
cs: Pole se nikdy nepoužívá.
de: Feld wird niemals verwendet
es: Nunca se usa el campo
fr: Le champ n'est jamais utilisé
it: Il campo non viene mai usato
ja: フィールドは使用されていません
ko: 필드가 사용되지 않습니다.
pl: Pole nie jest nigdy używane
pt_br: O campo nunca é usado
ru: Поле не используется
tr: Alan hiç kullanılmadı
zh_hans: 字段从未使用过
zh_hant: 從未使用過欄位

# ERR_UseDefViolationField
source: Use of possibly unassigned field '{0}'
cs: Použila se možná nepřiřazené pole {0}.
de: Verwendung des möglicherweise nicht zugewiesenen Felds "{0}".
es: Uso del campo '{0}' posiblemente sin asignar
fr: Utilisation d'un champ potentiellement non assigné '{0}'
it: Uso del campo '{0}' probabilmente non assegnato
ja: フィールド '{0}' は、割り当てられていない可能性があります
ko: 할당되지 않은 '{0}' 필드를 사용하고 있는 것 같습니다.
pl: Użycie prawdopodobnie nieprzypisanego pola „{0}”
pt_br: Uso de campo possivelmente não atribuído "{0}"
ru: Использование поля "{0}", которому, возможно, не присвоено значение.
tr: Atanmamış olabilen '{0}' alanının kullanımı
zh_hans: 使用了可能未赋值的字段“{0}”
zh_hant: 使用可能未指派的欄位 '{0}'

# ERR_UseDefViolationProperty
source: Use of possibly unassigned auto-implemented property '{0}'
cs: Použití pravděpodobně nepřiřazené automaticky implementované vlastnosti {0}
de: Verwenden einer möglicherweise nicht zugewiesenen, automatisch implementierten Eigenschaft "{0}"
es: Uso de una propiedad implementada automáticamente posiblemente sin asignar '{0}'
fr: Utilisation d'une propriété implémentée automatiquement éventuellement non assignée : '{0}'
it: Uso della proprietà implementata automaticamente '{0}' probabilmente non assegnata
ja: 割り当てられていない可能性のある自動実装プロパティ '{0}' の使用
ko: 할당되지 않은 자동 구현 속성 '{0}'을(를) 사용하고 있는 것 같습니다.
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości „{0}”
pt_br: Uso de propriedades autoimplementadas possivelmente não atribuídas '{0}'
ru: Использование автоматически реализованного свойства "{0}", которому, возможно, не присвоено значение
tr: Atanmamış olabilecek otomatik uygulanmış '{0}' özelliğinin kullanımı
zh_hans: 使用可能未赋值的自动实现的属性“{0}”
zh_hant: 可能使用了未指派的自動實作屬性 '{0}'

# ERR_AmbigQM
source: Type of conditional expression cannot be determined because '{0}' and '{1}' implicitly convert to one another
cs: Typ podmíněného výrazu nejde určit, protože {0} a {1} se implicitně převádějí jeden na druhého.
de: Der Typ des bedingten Ausdrucks kann nicht bestimmt werden, da "{0}" und "{1}" implizit ineinander konvertiert werden.
es: No se puede determinar el tipo de expresión condicional porque '{0}' y '{1}' se convierten implícitamente uno en el otro
fr: Impossible de déterminer le type d'expression conditionnelle, car '{0}' et '{1}' sont convertis implicitement l'un en l'autre
it: Non è possibile determinare il tipo di espressione condizionale perché '{0}' e '{1}' sono reciprocamente convertibili in modo implicito
ja: '{0}' と '{1}' が暗黙的に変換し合うため、条件式の型がわかりません
ko: {0}'과(와) '{1}'은(는) 서로 암시적으로 변환되므로 조건식의 형식을 확인할 수 없습니다.
pl: Nie można określić typu wyrażenia warunkowego, ponieważ elementy „{0}” i „{1}” są wzajemnie niejawnie konwertowane
pt_br: Tipo de expressão condicional não pode ser determinado porque "{0}" e "{1}" se convertem implicitamente um no outro
ru: Невозможно определить тип условного выражения, так как "{0}" и "{1}" неявно преобразовываются друг в друга.
tr: {0}' ve '{1}' örtülü olarak birbirine dönüştüğünden koşullu ifadenin türü belirlenemiyor
zh_hans: 无法确定条件表达式的类型，因为“{0}”和“{1}”可相互隐式转换
zh_hant: 無法判斷條件運算式的類型，因為 '{0}' 和 '{1}' 會互相隱含轉換

# ERR_InvalidQM
source: Type of conditional expression cannot be determined because there is no implicit conversion between '{0}' and '{1}'
cs: Nejde zjistit typ podmíněného výrazu, protože mezi typy {0} a {1} nedochází k implicitnímu převodu
de: Der Typ des bedingten Ausdrucks kann nicht bestimmt werden, weil keine implizite Konvertierung zwischen "{0}" und "{1}" erfolgt.
es: No se puede determinar el tipo de la expresión condicional porque no hay una conversión implícita entre '{0}' y '{1}'
fr: Impossible de déterminer le type d'expression conditionnelle, car il n'existe pas de conversion implicite entre '{0}' et '{1}'
it: Non è possibile determinare il tipo di espressione condizionale perché non esiste conversione implicita tra '{0}' e '{1}'
ja: '{0}' と '{1}' の間に暗黙的な変換がないため、条件式の型がわかりません
ko: {0}'과(와) '{1}' 사이에 암시적 변환이 없으므로 조건식의 형식을 확인할 수 없습니다.
pl: Nie można określić typu wyrażenia warunkowego, ponieważ nie istnieje niejawna konwersja między elementem „{0}” i „{1}”
pt_br: Tipo de expressão condicional não pode ser determinado porque não há conversão implícita entre "{0}" e "{1}"
ru: Не удается определить тип условного выражения, так как неявного преобразования между "{0}" и "{1}" не существует.
tr: {0}' ve '{1}' arasında hiçbir açık dönüştürme olmadığından koşul ifadesinin türü belirlenemiyor
zh_hans: 无法确定条件表达式的类型，因为“{0}”和“{1}”之间没有隐式转换
zh_hant: 無法確認條件運算式的類型，因為 '{0}' 和 '{1}' 之間沒有隱含轉換

# ERR_NoBaseClass
source: A base class is required for a 'base' reference
cs: Pro odkaz base se vyžaduje základní typ.
de: Für einen base-Verweis ist eine Basisklasse erforderlich.
es: Clase base requerida para una referencia 'base'
fr: Une classe de base est requise pour une référence 'base'
it: È necessaria una classe base per il riferimento 'base'
ja: base' 参照には基底クラスが必要です
ko: base' 참조에는 기본 클래스가 필요합니다.
pl: Klasa bazowa jest wymagana dla odwołania „base”
pt_br: Uma classe base é necessária para uma referência "base"
ru: Для ссылки "base" требуется базовый класс.
tr: Bir 'base' başvurusu için temel sınıf gerekir
zh_hans: "base" 引用需要基类
zh_hant: base' 參考需要基底類別

# ERR_BaseIllegal
source: Use of keyword 'base' is not valid in this context
cs: Použití klíčového slova base není v tomto kontextu platné.
de: Die Verwendung des base-Schlüsselworts ist in diesem Kontext nicht gültig.
es: El uso de la palabra clave 'base' no es válido en este contexto
fr: L'utilisation du mot clé 'base' n'est pas valide dans ce contexte
it: Utilizzo della parola chiave 'base' non valido in questo contesto
ja: キーワード 'base' の使用はこのコンテキストでは有効ではありません
ko: 이 컨텍스트에서는 'base' 키워드를 사용할 수 없습니다.
pl: Użycie słowa kluczowego „base” jest nieprawidłowe w tym kontekście
pt_br: O uso da palavra-chave "base" não é válido neste contexto
ru: Использование ключевого слова "base" в этом контексте не допускается.
tr: base' anahtar sözcüğünün kullanımı bu bağlamda geçerli değil
zh_hans: 在此上下文中使用关键字 "base" 无效
zh_hant: 在此內容中使用關鍵字 'base' 無效

# ERR_ObjectProhibited
source: Member '{0}' cannot be accessed with an instance reference; qualify it with a type name instead
cs: K členovi {0} nejde přistupovat pomocí odkazu na instanci. Namísto toho použijte kvalifikaci pomocí názvu typu.
de: Auf den Member "{0}" kann nicht mit einem Instanzverweis zugegriffen werden. Qualifizieren Sie ihn stattdessen mit einem Typnamen.
es: No se puede obtener acceso al miembro '{0}' con una referencia de instancia; califíquelo con un nombre de tipo en su lugar
fr: Le membre '{0}' est inaccessible avec une référence d'instance ; qualifiez-le avec un nom de type
it: Non è possibile accedere al membro '{0}' con un riferimento all'istanza. Qualificarlo con un nome di tipo
ja: インスタンス参照でメンバー '{0}' にアクセスできません。代わりに型名を使用してください
ko: {0}' 멤버는 인스턴스 참조를 사용하여 액세스할 수 없습니다. 대신 형식 이름을 사용하여 한정하세요.
pl: Nie można uzyskać dostępu do składowej „{0}” przy użyciu odwołania do wystąpienia. Należy użyć nazwy typu jako kwalifikatora.
pt_br: O membro "{0}" não pode ser acessado com uma referência de instância; qualifique-o com um nome de tipo
ru: Доступ к члену "{0}" через ссылку на экземпляр невозможен; вместо этого уточните его, указав имя типа.
tr: Örnek başvurusuyla '{0}' üyesine erişilemez; bunun yerine bir tür adıyla niteleyin
zh_hans: 无法使用实例引用来访问成员“{0}”；请改用类型名来限定它
zh_hant: 成員 '{0}' 無法以執行個體參考進行存取; 請改用類型名稱

# ERR_ParamUnassigned
source: The out parameter '{0}' must be assigned to before control leaves the current method
cs: Parametr out {0} se musí přiřadit ještě předtím, než aktuální metoda předá řízení.
de: Der out-Parameter "{0}" muss eine Zuweisung erhalten, bevor die Steuerung die aktuelle Methode verlässt.
es: Es necesario asignar el parámetro '{0}' out antes de que el control abandone el método actual
fr: Le paramètre out '{0}' doit être assigné avant que le contrôle quitte la méthode actuelle
it: Il parametro out '{0}' deve essere assegnato prima che il controllo lasci il metodo corrente
ja: out パラメーター '{0}' はコントロールが現在のメソッドを抜ける前に割り当てられる必要があります
ko: 제어가 현재 메서드를 벗어나기 전에 '{0}' out 매개 변수를 할당해야 합니다.
pl: Wartość parametru ze specyfikatorem out „{0}” musi być przypisana zanim sterowanie wyjdzie z bieżącej metody
pt_br: O parâmetro out "{0}" deve ser atribuído antes que o controle saia do método atual
ru: До передачи управления из текущего метода параметру, помеченному ключевым словом out, "{0}" должно быть присвоено значение.
tr: Out parametresi '{0}' denetim geçerli yöntemi terk etmeden önce atanmalıdır
zh_hans: 控制离开当前方法之前必须对 out 参数“{0}”赋值
zh_hant: 在程式控制權脫離目前的方法之前，必須指派 out 參數 '{0}'

# ERR_InvalidArray
source: Invalid rank specifier: expected ',' or ']'
cs: Specifikátor rozsahu je neplatný. Očekávala se čárka (,) nebo pravá hranatá závorka ].
de: Ungültiger Rangbezeichner: Erwartet wird "," oder "]".
es: Especificador de rango no válido: se esperaba ',' o ']'
fr: Spécificateur de rang non valide : ',' ou ']' attendu
it: L'identificatore del numero di dimensioni non è valido: è previsto ',' o ']'
ja: 無効な次元指定子です: ',' または ']' を指定してください
ko: 잘못된 차수 지정자입니다. ',' 또는 ']'가 필요합니다.
pl: Nieprawidłowy specyfikator rangi: oczekiwano „,” lub „]”
pt_br: Especificador de classificação inválido: era esperado "," ou "]"
ru: Недопустимый спецификатор ранга: требуется "," или "]".
tr: Geçersiz sıra belirticisi: ',' veya ']' bekleniyor
zh_hans: 无效的秩说明符: 应为“,”或“]”
zh_hant: 陣序規範無效: 必須是 ',' 或 ']'

# ERR_ExternHasBody
source: '{0}' cannot be extern and declare a body
cs: {0} nemůže být extern a deklarovat tělo.
de: '"{0}" kann nicht extern sein und Text deklarieren.
es: '{0}' no puede ser externo y declarar un cuerpo
fr: '{0}' ne peut pas être extern et déclarer un corps
it: '{0}' non può essere di tipo extern e dichiarare un corpo
ja: '{0}' を extern にして、本体を宣言することはできません
ko: '{0}'은(는) extern일 수 없으며 본문을 선언합니다.
pl: 'Element „{0}” nie może być zewnętrzny ani deklarować treści
pt_br: "{0}" não pode ser externo e declarar um corpo
ru: "{0}" не может одновременно быть внешним и объявлять тело.
tr: '{0}' hem extern olup hem de gövde bildiremez
zh_hans: “{0}”不能是外部的，也无法声明主体
zh_hant: '{0}' 不可同時為外部並宣告主體

# ERR_ExternHasConstructorInitializer
source: '{0}' cannot be extern and have a constructor initializer
cs: {0} nemůže být extern a mít inicializátor konstruktoru.
de: '{0}' darf nicht extern sein und keinen Konstruktor/Initialisierer aufweisen
es: '{0}' no puede ser externo y tener un inicializador de constructor
fr: '{0}' ne peut pas être externe et avoir un initialiseur de constructeur
it: '{0}' non può essere di tipo extern e contenere un inizializzatore di costruttore
ja: '{0}' を extern にして、コンストラクター初期化子を含めることはできません
ko: '{0}'은(는) extern일 수 없으며 생성자 이니셜라이저가 있으면 안 됩니다.
pl: 'Element „{0}” nie może być zewnętrzny ani zawierać inicjatora konstruktora
pt_br: '{0}' não pode ser externo e possui um inicializador de construtor
ru: 'Параметр "{0}" не может быть внешним и иметь инициализатор конструктора
tr: '{0}' extern ise oluşturucu başlatıcısına sahip olamaz
zh_hans: “{0}”不能是外部的，也不能具有构造函数初始值设定项
zh_hant: '{0}' 不可同時為外部並具有建構函式初始設定式

# ERR_AbstractAndExtern
source: '{0}' cannot be both extern and abstract
cs: {0} nemůže být extern i abstract.
de: '"{0}" kann nicht gleichzeitig extern und abstrakt sein.
es: '{0}' no puede ser externo y abstracto a la vez
fr: '{0}' ne peut pas être à la fois extern et abstract
it: '{0}' non può essere contemporaneamente di tipo extern e abstract
ja: '{0}' に extern と abstract の両方を指定することはできません
ko: '{0}'은(는) extern 및 abstract일 수 없습니다.
pl: 'Element „{0}” nie może być zewnętrzny i abstrakcyjny
pt_br: "{0}" não pode ser extern e abstract
ru: "{0}" не может одновременно внешним и абстрактным.
tr: '{0}' hem dış hem soyut olamaz
zh_hans: “{0}”不能既是外部的又是抽象的
zh_hant: '{0}' 不可同時為外部與抽象

# ERR_BadAttributeParamType
source: Attribute constructor parameter '{0}' has type '{1}', which is not a valid attribute parameter type
cs: Parametr {0} konstruktoru atributu má typ {1}, což není platný typ pro parametr atributu.
de: Der Attributkonstruktorparameter "{0}" hat den Typ "{1}", dies ist kein gültiger Attributparametertyp.
es: El parámetro del constructor de atributo '{0}' tiene el tipo '{1}', que no es un tipo de parámetro de atributo válido
fr: Le paramètre de constructeur d'attribut '{0}' est de type '{1}', qui n'est pas un type de paramètre d'attribut valide
it: Il tipo del parametro di costruttore di attributo '{0}' è '{1}' che però non è un tipo di parametro di attributo valido
ja: 属性コンストラクターのパラメーター '{0}' には型 '{1}' がありますが、これは無効な属性パラメーター型です
ko: 특성 생성자 매개 변수 '{0}'이(가) 유효한 특성 매개 변수 형식이 아닌 '{1}' 형식을 사용하고 있습니다.
pl: Parametr „{0}” konstruktora atrybutu jest typu „{1}”, który nie jest prawidłowym typem parametru atrybutu
pt_br: Parâmetro de construtor de atributo "{0}" tem tipo "{1}", o qual não é um tipo de parâmetro de atributo válido
ru: Параметр конструктора атрибута "{0}" имеет тип "{1}", который является недопустимым типом параметра атрибута.
tr: Öznitelik oluşturucu parametresi '{0}' geçerli bir öznitelik parametresi türü olmayan '{1}' türüne sahiptir
zh_hans: 特性构造函数参数“{0}”具有类型“{1}”，这不是有效特性参数类型
zh_hant: 屬性建構函式參數 '{0}' 的類型為 '{1}'，但是該類型不是有效的屬性參數類型

# ERR_BadAttributeArgument
source: An attribute argument must be a constant expression, typeof expression or array creation expression of an attribute parameter type
cs: Argumentem atributu musí být konstantní výraz, výraz typeof nebo výraz vytvoření pole s typem parametru atributu.
de: Ein Attributargument muss ein constant-, typeof- oder Arrayerstellungsausdruck eines Attributparametertyps sein.
es: Un argumento de atributo debe ser una expresión constante, una expresión typeof o una expresión de creación de matrices de un tipo de parámetro de atributo
fr: Un argument d'attribut doit être une expression constante, une expression typeof ou une expression de création de tableau d'un type de paramètre d'attribut
it: L'argomento di un attributo deve essere un'espressione costante, un'espressione typeof o un'espressione per la creazione di matrici di un tipo di parametro dell'attributo
ja: 属性引数は、定数式、typeof 式、または属性パラメーター型の配列の作成式でなければなりません
ko: 특성 인수는 특성 매개 변수 형식의 배열 생성 식, 상수 식 또는 typeof 식이어야 합니다.
pl: Argument atrybutu musi być wyrażeniem stałej, wyrażeniem TypeOf lub wyrażeniem tworzenia tablicy typu parametru atrybutu
pt_br: Um argumento attribute deve ser uma expressão constant, typeof ou array creation de um tipo de parâmetro attribute
ru: Аргументом атрибута должно быть константное выражение, выражение typeof или выражение создания массива того же типа, что и параметр атрибута.
tr: Öznitelik bağımsız değişkeni bir öznitelik parametresi türünün dizi oluşturma ifadesi, sabit bir ifade veya typeof ifadesi olmalıdır
zh_hans: 特性实参必须是特性形参类型的常量表达式、typeof 表达式或数组创建表达式
zh_hant: 屬性引數必須是常數運算式、typeof 運算式或屬性參數類型的陣列建立運算式

# ERR_BadAttributeParamDefaultArgument
source: Attribute constructor parameter '{0}' is optional, but no default parameter value was specified.
cs: Parametr {0} konstruktoru atributu je nepovinný, ale nebyla zadaná žádná výchozí hodnota parametru.
de: Der Attributkonstruktorparameter "{0}" ist optional, aber ein Standardparameterwert wurde nicht angegeben.
es: El parámetro del constructor de atributo '{0}' es opcional, pero no se especificó ningún valor de parámetro predeterminado.
fr: Le paramètre de constructeur d'attribut '{0}' est facultatif, mais aucune valeur de paramètre par défaut n'a été spécifiée.
it: Il parametro di costruttore di attributo '{0}' è facoltativo, ma non sono stati specificati valori di parametro predefiniti.
ja: 属性コンストラクターのパラメーター '{0}' は省略可能ですが、既定のパラメーター値が指定されていませんでした。
ko: 특성 생성자 매개 변수 '{0}'은(는) 선택 사항이지만 기본 매개 변수 값이 지정되지 않았습니다.
pl: Parametr „{0}” konstruktora atrybutu jest opcjonalny, ale nie została podana wartość domyślna parametru.
pt_br: Parâmetro de construtor de atributo "{0}" é opcional, mas nenhum valor de parâmetro padrão foi especificado.
ru: Параметр конструктора атрибута "{0}" необязателен, однако значение параметра по умолчанию указано не было.
tr: Öznitelik oluşturucu parametresi '{0}' isteğe bağlıdır, ancak hiçbir varsayılan parametre değeri belirtilmedi.
zh_hans: 特性构造函数参数“{0}”是可选的，但是未指定默认参数值。
zh_hant: 屬性建構函式參數 '{0}' 為選擇性參數，但並未指定預設參數值。

# WRN_IsAlwaysTrue
source: The given expression is always of the provided ('{0}') type
cs: Tento výraz je vždy zadaného typu ({0}).
de: Der angegebene Ausdruck ist immer vom bereitgestellten ("{0}") Typ.
es: La expresión dada siempre es del tipo proporcionado ('{0}')
fr: L'expression donnée est toujours du type fourni ('{0}')
it: L'espressione specificata è sempre del tipo fornito ('{0}')
ja: 式は常に指定された型 ('{0}') です
ko: 지정된 식은 항상 제공된 ('{0}') 형식입니다.
pl: Podane wyrażenie jest zawsze określonego typu („{0}”)
pt_br: A expressão fornecida sempre é do tipo ("{0}") fornecido
ru: Данное выражение всегда имеет указанный тип ("{0}")
tr: Verilen ifade her zaman sağlanan ('{0}') türündedir
zh_hans: 给定表达式始终为所提供的(“{0}”)类型
zh_hant: 指定的運算式一律會是提供的 ('{0}') 類型

# WRN_IsAlwaysTrue_Title
source: 'is' expression's given expression is always of the provided type
cs: 'Daný výraz is je vždycky zadaného typu.
de: 'Der angegebene Ausdruck für den 'is'-Ausdruck ist immer der angegebene Typ
es: 'La expresión dada de la expresión "is" siempre tiene el tipo provisto
fr: 'L'expression donnée de l'expression 'is' est toujours du type fourni
it: 'L'espressione specificata dell'espressione 'is' è sempre del tipo fornito
ja: 'is' 式の指定された式は常に指定された型です
ko: 'is' 식의 지정된 식이 항상 제공된 형식입니다.
pl: 'Podane wyrażenie wyrażenia „is” zawsze ma podany typ
pt_br: 'A expressão 'is' determinada sempre é do tipo fornecido
ru: 'Выражение, заданное выражению is всегда имеет указанный тип
tr: 'is' ifadesinin verilen ifadesi her zaman sağlanan türe aittir
zh_hans: '"is" 表达式的给定表达式始终是所提供的类型
zh_hant: 'is' 運算式的指定運算式一律會是提供的類型

# WRN_IsAlwaysFalse
source: The given expression is never of the provided ('{0}') type
cs: Tento výraz nikdy není zadaného typu ({0}).
de: Der angegebene Ausdruck ist nie vom bereitgestellten ("{0}") Typ.
es: La expresión dada nunca es del tipo proporcionado ('{0}')
fr: L'expression donnée n'est jamais du type fourni ('{0}')
it: L'espressione specificata non è mai del tipo fornito ('{0}')
ja: 式は指定された型 ('{0}') ではありません
ko: 지정된 식은 제공된 ('{0}') 형식이 아닙니다.
pl: Podane wyrażenie nigdy nie jest określonego typu („{0}”)
pt_br: A expressão fornecida nunca é do ("{0}") tipo fornecido
ru: Данное выражение никогда не имеет указанный тип ("{0}")
tr: Verilen ifade hiçbir zaman sağlanan ('{0}') türünde değildir
zh_hans: 给定表达式始终不是所提供的(“{0}”)类型
zh_hant: 指定的運算式絕不是提供的 ('{0}') 類型

# WRN_IsAlwaysFalse_Title
source: 'is' expression's given expression is never of the provided type
cs: 'Daný výraz is není nikdy zadaného typu.
de: 'Der angegebene Ausdruck für den 'is'-Ausdruck darf niemals der angegebene Typ sein
es: 'La expresión dada de la expresión "is" nunca tiene el tipo provisto
fr: 'L'expression donnée de l'expression 'is' n'est jamais du type fourni
it: 'L'espressione specificata dell'espressione 'is' non è mai del tipo fornito
ja: 'is' 式の指定された式は指定された型ではありません
ko: 'is' 식의 지정된 식이 제공된 형식이 아닙니다.
pl: 'Podane wyrażenie wyrażenia „is” nigdy nie ma podanego typu
pt_br: 'A expressão 'is' determinada nunca é do tipo fornecido
ru: 'Выражение, заданное выражению is не может иметь указанный тип
tr: 'is' ifadesinin verilen ifadesi sağlanan türden değil
zh_hans: '"is" 表达式的给定表达式始终不是所提供的类型
zh_hant: 'is' 運算式的指定運算式絕不是提供的類型

# ERR_LockNeedsReference
source: '{0}' is not a reference type as required by the lock statement
cs: {0} není typu odkaz, jak vyžaduje příkaz lock
de: '"{0}" ist kein Referenztyp, wie er für die lock-Anweisung erforderlich ist.
es: '{0}' no es el tipo de referencia que requiere la instrucción lock
fr: '{0}' n'est pas un type référence requis par l'instruction lock
it: '{0}' non è un tipo riferimento richiesto dall'istruzione lock
ja: '{0}' は lock ステートメントによって要求された参照型ではありません
ko: '{0}'은(는) lock 문에 필요한 참조 형식이 아닙니다.
pl: „{0}” to nie jest typ referencyjny wymagany przez instrukcję lock
pt_br: "{0}" não é um tipo de referência como necessário pela instrução lock
ru: "{0}" не является ссылочным типом, как требуется в операторе lock.
tr: '{0}' kilit deyimi tarafından gereken bir başvuru türü değil
zh_hans: “{0}”不是 lock 语句要求的引用类型
zh_hant: '{0}' 不是 lock 陳述式所需的參考類型

# ERR_NullNotValid
source: Use of null is not valid in this context
cs: Použití hodnoty NULL není v tomto kontextu platné.
de: Die Verwendung von NULL ist in diesem Kontext ungültig.
es: No se permite utilizar NULL en este contexto
fr: L'utilisation de null n'est pas valide dans ce contexte
it: L'utilizzo di null non è valido in questo contesto
ja: null はこのコンテキストでは使用できません
ko: 이 컨텍스트에서는 null을 사용할 수 없습니다.
pl: Użycie wartości null jest nieprawidłowe w tym kontekście
pt_br: O uso de null não é válido neste contexto
ru: Использование NULL в этом контексте не допускается.
tr: Bu bağlamda null kullanımı geçerli değil
zh_hans: 在此上下文中使用 null 无效
zh_hant: 在此內容中使用 null 無效

# ERR_DefaultLiteralNotValid
source: Use of default literal is not valid in this context
cs: Použití výchozího literálu není v tomto kontextu platné.
de: Die Verwendung des Standardliterals ist in diesem Kontext nicht gültig.
es: El uso del literal predeterminado no es válido en este contexto.
fr: L'utilisation d'un littéral par défaut est non valide dans ce contexte
it: In questo contesto non è possibile usare il valore letterale predefinito
ja: このコンテキストでの既定のリテラルの使用は無効です
ko: 이 컨텍스트에서는 기본 리터럴을 사용할 수 없습니다.
pl: Użycie domyślnego literału nie jest prawidłowe w tym kontekście
pt_br: O uso do literal padrão não é válido neste contexto
ru: Использование литерала по умолчанию недопустимо в этом контексте.
tr: Default sabit değerinin kullanımı bu bağlamda geçerli değil
zh_hans: 在此上下文中不可使用 default 字面量
zh_hant: 在此內容中使用預設常值無效

# ERR_ArgsInvalid
source: The __arglist construct is valid only within a variable argument method
cs: Konstrukce __arglist je platná jenom v rámci metody s proměnnými argumenty.
de: Das __arglist-Konstrukt ist nur innerhalb einer Variablenargumentmethode gültig.
es: La construcción __arglist solo es válida dentro de un método de argumento de variable
fr: La construction __arglist est valide uniquement avec une méthode à arguments de variables
it: Il costrutto __arglist è valido solo all'interno di un metodo con argomenti variabili
ja: __arglist 構文は可変個の引数メソッド内でのみ有効です
ko: __arglist 구문은 가변 인수 메서드 내에서만 사용할 수 있습니다.
pl: Konstrukcja __arglist jest prawidłowa tylko wewnątrz metody argumentu zmiennej
pt_br: O construtor __arglist só é válido dentro de um método de argumento variável
ru: Конструкция __arglist допускается только в методе с переменным числом аргументов.
tr: __arglist oluşturucusu yalnızca değişken sayıda bağımsız değişkenli bir yöntem içinde geçerlidir
zh_hans: __arglist 构造只在变量参数方法中有效
zh_hant: __arglist 建構函式只有在變數引數方法中才有效
