Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DerivingFromATyVar
source: Cannot derive from '{0}' because it is a type parameter
cs: Nejde odvozovat z parametru {0}, protože je to parametr typu.
de: Die Ableitung von "{0}" ist nicht möglich, weil es sich um einen Typparameter handelt.
es: No puede derivar de '{0}' porque es un parámetro de tipo
fr: Dérivation de '{0}' impossible, car il s'agit d'un paramètre de type
it: Non è possibile derivare da '{0}' perché è un parametro di tipo
ja: '{0}' は型パラメーターであるため、派生させることはできません
ko: 형식 매개 변수이므로 '{0}'에서 파생될 수 없습니다.
pl: Nie może pochodzić od „{0}”, ponieważ jest to parametr typu
pt_br: Não é possível derivar de "{0}" porque ele é um parâmetro de tipo
ru: Невозможно наследовать от "{0}", так как он не является параметром типа.
tr: Bir tür parametresi olduğundan '{0}' öğesinden türetilemez
zh_hans: “{0}”是一个类型参数，无法从它进行派生
zh_hant: 無法從 '{0}' 衍生，因為其為類型參數

# ERR_DuplicateTypeParameter
source: Duplicate type parameter '{0}'
cs: Duplicitní parametr typu {0}
de: Doppelter "{0}"-Typparameter.
es: Parámetro de tipo duplicado '{0}'
fr: Paramètre de type '{0}' en double
it: Parametro di tipo '{0}' duplicato
ja: 型パラメーター '{0}' が重複しています
ko: 중복된 '{0}' 형식 매개 변수입니다.
pl: Zduplikowany parametr typu „{0}”
pt_br: Duplicar atributo de tipo "{0}"
ru: Повторяющийся параметр типа "{0}"
tr: Yinelenen tür parametresi '{0}'
zh_hans: 重复的类型参数“{0}”
zh_hant: 類型參數 '{0}' 重複

# WRN_TypeParameterSameAsOuterTypeParameter
source: Type parameter '{0}' has the same name as the type parameter from outer type '{1}'
cs: Parametr typu {0} má stejný název jako parametr typu z vnějšího typu {1}.
de: Der {0}-Typparameter hat den gleichen Namen wie der Typparameter des äußeren Typs "{1}"
es: El parámetro de tipo '{0}' tiene el mismo nombre que el parámetro de tipo del tipo externo '{1}'
fr: Le paramètre de type '{0}' a le même nom que le paramètre de type du type externe '{1}'
it: Il parametro di tipo '{0}' ha lo stesso nome del parametro del tipo outer '{1}'
ja: 型パラメーター '{0}' は、外の型からの型パラメーター '{1}' と同じ名前です
ko: {0}' 형식 매개 변수가 외부 형식 '{1}'의 형식 매개 변수와 이름이 같습니다.
pl: Parametr typu „{0}” ma tę samą nazwę co parametr typu zewnętrznego „{1}”
pt_br: Parâmetro de tipo "{0}" tem o mesmo nome do parâmetro de tipo de tipo externo "{1}"
ru: Имя типа параметра "{0}" совпадает с именем типа параметра внешнего типа "{1}".
tr: {0}' tür parametresi, '{1}' dış türünden tür parametresi ile aynı ada sahip
zh_hans: 类型参数“{0}”与外部类型“{1}”中的类型参数同名
zh_hant: 類型參數 '{0}' 與外部類型 '{1}' 的類型參數名稱相同

# WRN_TypeParameterSameAsOuterTypeParameter_Title
source: Type parameter has the same name as the type parameter from outer type
cs: Parametr typu má stejný název jako parametr typu z vnějšího typu.
de: Typparameter hat denselben Namen wie der Typparameter des äußeren Typs
es: El parámetro de tipo tiene el mismo nombre que el parámetro de tipo de un tipo externo
fr: Le paramètre de type a le même nom que le paramètre de type du type externe
it: Il parametro di tipo ha lo stesso nome del parametro del tipo outer
ja: 型パラメーターの名前は、外の型からの型パラメーターと同じ名前です
ko: 형식 매개 변수가 외부 형식의 형식 매개 변수와 이름이 같습니다.
pl: Parametr typu ma tę samą nazwę co parametr typu zewnętrznego
pt_br: O parâmetro de tipo tem o mesmo nome que o parâmetro de tipo do tipo externo
ru: Параметр типа имеет то же имя, что и параметр, указанный во внешнем типе
tr: Tür parametresi dış türden tür parametresi ile aynı ada sahip
zh_hans: 类型参数与外部类型中的类型参数同名
zh_hant: 類型參數與外部類型的類型參數名稱相同

# ERR_TypeVariableSameAsParent
source: Type parameter '{0}' has the same name as the containing type, or method
cs: Parametr typu {0} má stejný název jako nadřazený typ nebo metoda.
de: Der {0}-Typparameter hat den gleichen Namen wie der enthaltende Typ bzw. die enthaltende Methode.
es: El parámetro de tipo '{0}' tiene el mismo nombre que el tipo contenedor o el método
fr: Le paramètre de type '{0}' a le même nom que le type conteneur ou la méthode
it: Il parametro di tipo '{0}' ha lo stesso nome del tipo che lo contiene o del metodo
ja: 型のパラメーター '{0}' は、含む型またはメソッドと同じ名前を持っています
ko: {0}' 형식 매개 변수의 이름이 포함하는 형식 또는 메서드의 이름과 같습니다.
pl: Parametr typu „{0}” ma tę samą nazwę co zawierający typ lub metoda
pt_br: Parâmetro de tipo "{0}" tem o mesmo nome do tipo recipiente ou do método
ru: Параметр типа "{0}" совпадает с именем вмещающего типа или метода.
tr: {0}' tür parametresi içeren tür veya yöntem ile aynı ada sahip
zh_hans: 类型参数“{0}”与包含类型或方法同名
zh_hant: 類型參數 '{0}' 與包含類型或方法的名稱相同

# ERR_UnifyingInterfaceInstantiations
source: '{0}' cannot implement both '{1}' and '{2}' because they may unify for some type parameter substitutions
cs: {0} nemůže implementovat {1} a zároveň {2}, protože u některých náhrad parametrů typu může dojít k jejich sjednocení.
de: '"{0}" kann nicht gleichzeitig "{1}" und "{2}" implementieren, da diese für einige Typparameterersetzungen zusammengeführt werden können.
es: '{0}' no puede implementar '{1}' y '{2}' a la vez porque se pueden unificar para algunas sustituciones de parámetros de tipo
fr: '{0}' ne peut pas implémenter '{1}' et '{2}', car ils peuvent être réunis pour des substitutions de paramètre de type
it: '{0}' non può implementare sia '{1}' che '{2}' perché potrebbero unificarsi per alcune sostituzioni di parametro di tipo
ja: '型パラメーターの代用に対して統合している可能性があるため、'{0}' は '{1}' と '{2}' の両方を実装することはできません
ko: '{1}'과(와) '{2}'은(는) 일부 형식 매개 변수를 대체할 때 통합될 수 있으므로 '{0}'에서는 둘 다 구현할 수 없습니다.
pl: 'Element „{0}” nie może implementować jednocześnie elementu „{1}” i „{2}”, ponieważ mogą się one łączyć przy niektórych podstawieniach parametrów typu.
pt_br: "{0}" não pode implementar "{1}" e "{2}" porque eles podem se unificar em algumas substituições de parâmetro de tipo
ru: "{0}" не в состоянии реализовать ни "{1}", ни "{2}", так как они могут быть идентичными для некоторых подстановок параметров типа.
tr: '{0}', bazı tür parametresi değişimleri için birleşebileceklerinden hem '{1}' öğesini hem '{2}' öğesini uygulayamaz
zh_hans: “{0}”不能同时实现“{1}”和“{2}”，原因是它们可以统一以进行某些类型参数替换
zh_hant: '{0}' 不可同時實作 '{1}' 和 '{2}'，因為它們可能會整合某些類型參數的替代

# ERR_TyVarNotFoundInConstraint
source: '{1}' does not define type parameter '{0}'
cs: {1} nedefinuje parametr typu {0}.
de: '"{1}" definiert nicht den Typparameter "{0}"
es: '{1}' no define el parámetro de tipo '{0}'
fr: '{1}' ne définit pas le paramètre de type '{0}'
it: '{1}' non definisce il parametro di tipo '{0}'
ja: '{1}' は、型のパラメーター '{0}' を定義しません
ko: '{1}'은(는) '{0}' 형식 매개 변수를 정의하지 않습니다.
pl: Element „{1}” nie definiuje parametru typu „{0}”
pt_br: "{1}" não define parâmetro de tipo "{0}"
ru: "{1}" не определяет параметр типа "{0}"
tr: '{1}', '{0}' tür parametresini tanımlamaz
zh_hans: “{1}”未定义类型参数“{0}”
zh_hant: '{1}' 未定義類型參數 '{0}'

# ERR_BadBoundType
source: '{0}' is not a valid constraint. A type used as a constraint must be an interface, a non-sealed class or a type parameter.
cs: {0} není platné omezení. Typ použitý jako omezení musí být rozhraní, nezapečetěná třída nebo parametr typu.
de: '"{0}" ist keine gültige Einschränkung. Ein Typ, der als Einschränkung verwendet wird, muss eine Schnittstelle, eine nicht versiegelte Klasse oder ein Typparameter sein.
es: '{0}' no es una restricción válida. Un tipo usado como restricción debe ser una interfaz, una clase no sellada o un parámetro de tipo.
fr: '{0}' n'est pas une contrainte valide. Un type utilisé comme contrainte doit être une interface, une classe non-sealed ou un paramètre de type.
it: '{0}' non è un vincolo valido. Un tipo usato come vincolo deve essere un'interfaccia, una classe non sealed o un parametro di tipo.
ja: '{0}' は有効な制約ではありません。制約として使用された型はインターフェイス、非シール クラス、または型パラメーターでなければなりません。
ko: '{0}'은(는) 유효한 제약 조건이 아닙니다. 제약 조건으로 사용되는 형식은 인터페이스, 봉인되지 않은 클래스 또는 형식 매개 변수여야 합니다.
pl: „{0}” to nieprawidłowy typ ograniczenia. Typ używany jako ograniczenie musi być interfejsem, klasą niezapieczętowaną lub parametrem typu.
pt_br: "{0}" não é uma restrição válida. Um tipo usado como uma restrição deve ser uma interface, uma classe não selada ou um parâmetro de tipo.
ru: "{0}" не является допустимым ограничением. Тип, использованный в качестве ограничения, должен быть интерфейсом, незапечатанным классом или параметром-типом.
tr: '{0}' geçerli bir kısıtlama değil. Kısıtlama olarak kullanılan bir türün arabirim, korumalı olmayan bir sınıf veya tür parametresi olması gerekir.
zh_hans: “{0}”不是有效的约束。作为约束使用的类型必须是接口、非密封类或类型参数。
zh_hant: '{0}' 不是有效的條件約束。用做為條件約束的類型，必須是介面、非密封類別或類型參數。

# ERR_SpecialTypeAsBound
source: Constraint cannot be special class '{0}'
cs: Omezení nemůže být speciální třída {0}.
de: Die Einschränkung kann nicht die spezielle {0}-Klasse sein.
es: La restricción no puede ser la clase especial '{0}'
fr: La contrainte ne peut pas être la classe spéciale '{0}'
it: Il vincolo non può essere la classe speciale '{0}'
ja: 制約は特殊クラス '{0}' にすることはできません
ko: 제약 조건은 '{0}' 특수 클래스가 될 수 없습니다.
pl: Ograniczenie nie może być specjalną klasą „{0}”
pt_br: Restrição não pode ser classe especial "{0}"
ru: Ограничение не может быть специальным классом "{0}"
tr: Kısıtlama '{0}' özel sınıfı olamaz
zh_hans: 约束不能是特殊类“{0}”
zh_hant: 條件約束不可為特殊類別 '{0}'

# ERR_BadVisBound
source: Inconsistent accessibility: constraint type '{1}' is less accessible than '{0}'
cs: Nekonzistentní dostupnost: Typ omezení {1} je míň dostupný než {0}.
de: Inkonsistenter Zugriff: Einschränkungstyp "{1}" ist weniger zugreifbar als "{0}".
es: Incoherencia de accesibilidad: el tipo de restricción '{1}' es menos accesible que '{0}'
fr: Accessibilité incohérente : le type de contrainte '{1}' est moins accessible que '{0}'
it: Accessibilità incoerente: il tipo di vincolo '{1}' è meno accessibile di '{0}'
ja: アクセシビリティに一貫性がありません。制約型 '{1}' のアクセシビリティは '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 제약 조건 형식이 '{0}'보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ ograniczony „{1}” jest mniej dostępny niż „{0}”
pt_br: Acessibilidade inconsistente: tipo de restrição "{1}" é menos acessível do que "{0}"
ru: Несогласованность по доступности: доступность типа ограничения "{1}" ниже доступности "{0}"
tr: Tutarsız erişilebilirlik: '{1}' kısıtlama türü, '{0}' öğesinden daha az erişilebilir
zh_hans: 可访问性不一致: 约束类型“{1}”的可访问性低于“{0}”
zh_hant: 不一致的存取範圍: 條件約束類型 '{1}' 比 '{0}' 的存取範圍小

# ERR_LookupInTypeVariable
source: Cannot do non-virtual member lookup in '{0}' because it is a type parameter
cs: Nejde vyhledávat nevirtuálního člena v {0}, protože se jedná o parametr typu.
fr: Impossible d’effectuer une recherche de membre non virtuel dans '{0}', car il s’agit d’un paramètre de type
it: Non è possibile eseguire la ricerca di membri non virtuali in '{0}' perché è un parametro di tipo
ja: '{0}' で非 virtual メンバー参照を実行できません。これは型パラメーターであるためです
pl: Nie można wyszukać składowej innej niż wirtualna w elemencie „{0}”, ponieważ to jest parametr typu
pt_br: Não é possível fazer pesquisa de membro não virtual em '{0}' porque ele é um parâmetro de tipo
ru: Невозможно выполнить поиск невиртуального члена в "{0}", поскольку это параметр типа
zh_hans: 由于 "{0}" 是一个类型参数，无法在其中执行非虚拟成员查找
zh_hant: 無法在 '{0}' 中進行非虛擬的成員查詢，因為其為型別參數

# ERR_BadConstraintType
source: Invalid constraint type. A type used as a constraint must be an interface, a non-sealed class or a type parameter.
cs: Neplatný typ omezení. Typ použitý jako omezení musí být rozhraní, nezapečetěná třída nebo parametr typu.
de: Ungültiger Einschränkungstyp. Ein Typ, der als Einschränkung verwendet wird, muss eine Schnittstelle, eine nicht versiegelte Klasse oder ein Typparameter sein.
es: Tipo de restricción no válida. Un tipo utilizado como restricción debe ser una interfaz, una clase no sellada o un parámetro de tipo.
fr: Type de contrainte non valide. Un type utilisé comme contrainte doit être une interface, une classe non-sealed ou un paramètre de type.
it: Il tipo vincolo non è valido. Un tipo usato come vincolo deve essere un'interfaccia, una classe non sealed o un parametro di tipo.
ja: 無効な制約型です。制約として使用された型はインターフェイス、非シール クラス、または型パラメーターでなければなりません。
ko: 잘못된 제약 조건 형식입니다. 제약 조건으로 사용되는 형식은 인터페이스, 봉인되지 않은 클래스 또는 형식 매개 변수여야 합니다.
pl: Nieprawidłowy typ ograniczenia. Typ używany jako ograniczenie musi być interfejsem, klasą niezapieczętowaną lub parametrem typu.
pt_br: Tipo de restrição inválido. Um tipo usado como restrição deve ser uma interface, uma classe não sealed ou um parâmetro de tipo.
ru: Недопустимый тип ограничения. Тип, использованный в качестве ограничения, должен быть интерфейсом, незапечатанным классом или параметром-типом.
tr: Geçersiz kısıtlama türü. Kısıtlama olarak kullanılan bir türün bir arabirim, korumalı olmayan bir sınıf veya bir tür parametresi olması gerekir.
zh_hans: 约束类型无效。作为约束使用的类型必须是接口、非密封类或类型形参。
zh_hant: 條件約束類型無效。用做為條件約束的類型，必須是介面、非密封類別或類型參數。

# ERR_InstanceMemberInStaticClass
source: '{0}': cannot declare instance members in a static class
cs: {0}: Nejde deklarovat členy instance ve statické třídě.
de: '"{0}": Instanzmember können nicht in einer statischen Klasse deklariert werden.
es: '{0}': no se puede declarar miembros de instancia en una clase estática
fr: '{0}' : impossible de déclarer des membres d'instance dans une classe static
it: '{0}': non è possibile dichiarare i membri di istanza in una classe statica
ja: '{0}': 静的クラスでインスタンスのメンバーを宣言することはできません
ko: '{0}': 정적 클래스에 인스턴스 멤버를 선언할 수 없습니다.
pl: „{0}”: nie można zadeklarować składowych wystąpienia w klasie statycznej
pt_br: "{0}": não pode declarar membros de instância em uma classe estática
ru: "{0}": нельзя объявлять члены экземпляра в статическом классе.
tr: '{0}': bir statik sınıftaki örnek üyeleri ifade edemez
zh_hans: “{0}”: 不能在静态类中声明实例成员
zh_hant: '{0}': 不可在靜態類別中宣告執行個體成員

# ERR_StaticBaseClass
source: '{1}': cannot derive from static class '{0}'
cs: {1}: Nejde odvodit ze statické třídy {0}.
de: '"{1}": Von der statischen {0}-Klasse kann nicht abgeleitet werden.
es: '{1}': no se puede derivar de la clase estática '{0}'
fr: '{1}' : dérivation impossible à partir de la classe static '{0}'
it: '{1}' non può derivare dalla classe statica '{0}'
ja: '{1}': 静的クラス '{0}' から派生することはできません
ko: '{1}': 정적 클래스 '{0}'에서 파생될 수 없습니다.
pl: „{1}”: nie można utworzyć na podstawie klasy statycznej „{0}”
pt_br: "{1}": não pode derivar da classe static "{0}"
ru: "{1}": не может быть производным от статического класса "{0}"
tr: '{1}': '{0}' statik sınıfından türetilemiyor
zh_hans: “{0}”: 无法从静态类“{1}”派生
zh_hant: '{1}': 不可衍生自靜態類別 '{0}'

# ERR_ConstructorInStaticClass
source: Static classes cannot have instance constructors
cs: Statické třídy nemůžou mít konstruktory instancí.
de: Statische Klassen können keine Instanzenkonstruktoren haben.
es: Las clases estáticas no pueden tener constructores de instancia
fr: Les classes static ne peuvent pas avoir de constructeurs d'instance
it: Le classi statiche non possono avere costruttori di istanze
ja: 静的クラスにはコンストラクターを指定できません
ko: 정적 클래스는 인스턴스 생성자를 포함할 수 없습니다.
pl: Klasy statyczne nie mogą mieć konstruktorów wystąpienia.
pt_br: Classes static não podem ter construtores de instância
ru: Статические классы не могут иметь конструкторы экземпляров.
tr: Statik sınıflarda örnek oluşturucular olamaz
zh_hans: 静态类不能有实例构造函数
zh_hant: 靜態類別不能有執行個體建構函式

# ERR_DestructorInStaticClass
source: Static classes cannot contain destructors
cs: Statické třídy nemůžou obsahovat destruktory.
de: Statische Klassen können keine Destruktoren enthalten.
es: Las clases estáticas no pueden contener destructores
fr: Les classes static ne peuvent pas contenir de destructeurs
it: Le classi statiche non possono contenere distruttori
ja: 静的クラスにデストラクターを含めることはできません
ko: 정적 클래스는 소멸자를 포함할 수 없습니다.
pl: Klasy statyczne nie mogą zawierać destruktorów
pt_br: Classes static não podem conter destruidores
ru: Статические классы не могут содержать деструкторы.
tr: Statik sınıflar yıkıcı içeremez
zh_hans: 静态类不能包含析构函数
zh_hant: 靜態類別不能包含解構函式

# ERR_InstantiatingStaticClass
source: Cannot create an instance of the static class '{0}'
cs: Nejde vytvořit instanci statické třídy {0}.
de: Es kann keine Instanz der statischen "{0}"-Klasse erstellt werden.
es: No se puede crear ninguna instancia de la clase estática '{0}'
fr: Impossible de créer une instance de la classe static '{0}'
it: Non è possibile creare un'istanza della classe statica '{0}'
ja: 静的クラス '{0}' のインスタンスを作成することはできません
ko: {0}' 정적 클래스의 인스턴스를 만들 수 없습니다.
pl: Nie można utworzyć wystąpienia klasy statycznej „{0}”
pt_br: Não é possível criar uma instância da classe estática "{0}"
ru: Не удается создать экземпляр статического класса "{0}".
tr: {0}' statik sınıfının bir örneğini oluşturamaz
zh_hans: 无法创建静态类“{0}”的实例
zh_hant: 無法建立靜態類別 '{0}' 的執行個體

# ERR_StaticDerivedFromNonObject
source: Static class '{0}' cannot derive from type '{1}'. Static classes must derive from object.
cs: Statická třída {0} se nemůže odvozovat z typu {1}. Tyto třídy se musí odvozovat z objektu.
de: Die statische {0}-Klasse kann nicht vom Typ "{1}" abgeleitet werden. Statische Klassen müssen von einem Objekt abgeleitet werden.
es: La clase estática '{0}' no se puede derivar del tipo '{1}'. Las clases estáticas se deben derivar del objeto.
fr: La classe static '{0}' ne peut pas dériver du type '{1}'. Les classes static doivent dériver d'un objet.
it: La classe statica '{0}' non può derivare dal tipo '{1}'. Le classi statiche devono derivare dall'oggetto.
ja: 静的クラス '{0}' は型 '{1}' から派生することはできません。静的クラスはオブジェクトから派生する必要があります。
ko: 정적 클래스 '{0}'은(는) '{1}' 형식에서 파생될 수 없습니다. 정적 클래스는 개체에서 파생되어야 합니다.
pl: Klasa statyczna „{0}” nie może pochodzić od typu „{1}”. Klasy statyczne muszą pochodzić od obiektu.
pt_br: Classe static "{0}" não pode derivar do tipo "{1}". Classes static devem derivar do objeto.
ru: Статический класс "{0}" не может быть производным от типа "{1}". Статические классы должны быть производными от object.
tr: {0}' statik sınıfı '{1}' türünden türeyemez. Statik sınıflar nesneden türemelidir.
zh_hans: 静态类“{0}”不能从类型“{1}”派生。静态类必须从对象派生。
zh_hant: 靜態類別 '{0}' 不可衍生自類型 '{1}'。靜態類別必須衍生自 object。

# ERR_StaticClassInterfaceImpl
source: '{0}': static classes cannot implement interfaces
cs: {0}: Statické třídy nemůžou implementovat rozhraní.
de: '"{0}": Statische Klassen können keine Schnittstellen implementieren.
es: '{0}': las clases estáticas no pueden implementar interfaces
fr: '{0}' : les classes static ne peuvent pas implémenter d'interfaces
it: '{0}': le classi statiche non possono implementare interfacce
ja: '{0}': 静的クラスはインターフェイスを実装することができません
ko: '{0}': 정적 클래스는 인터페이스를 구현할 수 없습니다.
pl: „{0}”: klasy statyczne nie mogą implementować interfejsów
pt_br: "{0}": classes static não podem implementar interfaces
ru: "{0}": реализация интерфейсов статическими классами невозможна.
tr: '{0}': statik sınıfları arabirimler uygulayamaz
zh_hans: “{0}”: 静态类不能实现接口
zh_hant: '{0}': 靜態類別無法實作介面

# ERR_OperatorInStaticClass
source: '{0}': static classes cannot contain user-defined operators
cs: {0}: Statické třídy nemůžou obsahovat operátory definované uživatelem.
de: '"{0}": Statische Klassen können keine benutzerdefinierten Operatoren enthalten.
es: '{0}': las clases estáticas no pueden contener operadores definidos por el usuario
fr: '{0}' : les classes static ne peuvent pas contenir d'opérateurs définis par l'utilisateur
it: '{0}': le classi statiche non possono contenere operatori definiti dall'utente
ja: '{0}': 静的クラスにユーザー定義の演算子を含めることはできません
ko: '{0}': 정적 클래스는 사용자 정의 연산자를 포함할 수 없습니다.
pl: „{0}”: klasy statyczne nie mogą zawierać operatorów zdefiniowanych przez użytkownika
pt_br: "{0}": classes static não podem conter operadores definidos pelo usuário
ru: "{0}": статические классы не могут содержать определяемых пользователем операторов.
tr: '{0}': statik sınıflar kullanıcı tanımlı işleçler içeremez
zh_hans: “{0}”: 静态类不能包含用户定义的运算符
zh_hant: '{0}': 靜態類別不可包含使用者定義的運算子

# ERR_ConvertToStaticClass
source: Cannot convert to static type '{0}'
cs: Nejde převést na statický typ {0}.
de: Die Konvertierung in den statischen Typ "{0}" ist nicht möglich.
es: No se puede convertir en el tipo estático '{0}'
fr: Impossible de convertir en type static '{0}'
it: Non è possibile convertire nel tipo statico '{0}'
ja: スタティック型 '{0}' へ変換できません
ko: {0}' 정적 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować na typ statyczny „{0}”.
pt_br: Não é possível converter em tipo estático "{0}"
ru: Не удается преобразовать в статический тип "{0}".
tr: {0}' statik türüne dönüştürülemiyor
zh_hans: 无法转换为静态类型“{0}”
zh_hant: 無法轉換成靜態類型 '{0}'

# ERR_ConstraintIsStaticClass
source: '{0}': static classes cannot be used as constraints
cs: {0}: Statické třídy nejde používat jako omezení.
de: '"{0}": Statische Klassen können nicht als Einschränkungen verwendet werden.
es: '{0}': las clases estáticas no se pueden usar como restricciones
fr: '{0}' : les classes static ne peuvent pas être utilisées en tant que contraintes
it: '{0}': non si possono usare classi statiche come vincoli
ja: '{0}': 静的クラスは、制約として使用することはできません
ko: '{0}': 정적 클래스는 제약 조건으로 사용할 수 없습니다.
pl: „{0}”: klas statycznych nie można używać jako ograniczeń
pt_br: "{0}": classes estáticas não podem ser utilizadas como restrições
ru: "{0}": нельзя использовать статические классы в качестве ограничений.
tr: '{0}': statik sınıflar kısıtlama olarak kullanılamaz
zh_hans: “{0}”: 静态类不能用作约束
zh_hant: '{0}': 靜態類別不可用做為條件約束

# ERR_GenericArgIsStaticClass
source: '{0}': static types cannot be used as type arguments
cs: {0}: Statické typy nejde používat jako argumenty typu.
de: '{0}: Statische Typen können nicht als Typargumente verwendet werden.
es: '{0}': los tipos estáticos no se pueden usar como argumentos de tipo
fr: '{0}' : impossible d'utiliser les types static en tant qu'arguments de type
it: '{0}': i tipi statici non possono essere usati come argomenti di tipo
ja: '{0}': スタティック型を型引数として使用することはできません
ko: '{0}': 정적 형식은 형식 인수로 사용할 수 없습니다.
pl: „{0}”: typów statycznych nie można używać jako argumentów typu.
pt_br: "{0}": tipos estáticos não podem ser usados como argumentos de tipo
ru: "{0}": нельзя использовать статические типы в качестве аргументов типов.
tr: '{0}': statik türler tür bağımsız değişkeni olarak kullanılamaz
zh_hans: “{0}”: 静态类型不能用作类型参数
zh_hant: '{0}': 靜態類型不可用做為類型引數

# ERR_ArrayOfStaticClass
source: '{0}': array elements cannot be of static type
cs: {0}: Prvky pole nemůžou být statického typu.
de: '"{0}": Arrayelemente können keinen statischen Typ aufweisen.
es: '{0}': los elementos de matriz no pueden ser de tipo estático
fr: '{0}' : les éléments de tableau ne peuvent pas être de type static
it: '{0}': gli elementi di matrice non possono essere di tipo statico
ja: '{0}': 配列要素をスタティック型にすることはできません
ko: '{0}': 배열 요소는 정적 형식일 수 없습니다.
pl: „{0}”: elementy tablicy nie mogą być typu statycznego
pt_br: "{0}": elementos de matriz não podem ser do tipo static
ru: "{0}": элементы массива не могут быть статического типа.
tr: '{0}': dizi öğeleri statik türünde olamaz
zh_hans: “{0}”: 数组元素不能是静态类型的
zh_hant: '{0}': 陣列元素不可為靜態類型

# ERR_IndexerInStaticClass
source: '{0}': cannot declare indexers in a static class
cs: {0}: Nejde deklarovat indexery ve statické třídě.
de: '"{0}": Indexer können nicht in einer statischen Klasse deklariert werden.
es: '{0}': no se pueden declarar indizadores en una clase estática
fr: '{0}' : impossible de déclarer des indexeurs dans une classe static
it: '{0}': non è possibile dichiarare indicizzatori in una classe statica
ja: '{0}': 静的クラスでインデクサーを宣言することはできません
ko: '{0}': 정적 클래스에는 인덱서를 선언할 수 없습니다.
pl: „{0}”: nie można zadeklarować indeksatorów w klasie statycznej
pt_br: "{0}": não pode declarar indexadores em uma classe estática
ru: "{0}": нельзя объявлять индексаторы в статическом классе.
tr: '{0}': statik sınıfında dizin oluşturucu bildirilemez
zh_hans: “{0}”: 不能在静态类中声明索引器
zh_hant: '{0}': 不可在靜態類別中宣告索引子
