Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ReferencedAssemblyReferencesLinkedPIA_Description
source: You have added a reference to an assembly using /link (Embed Interop Types property set to True). This instructs the compiler to embed interop type information from that assembly. However, the compiler cannot embed interop type information from that assembly because another assembly that you have referenced also references that assembly using /reference (Embed Interop Types property set to False). To embed interop type information for both assemblies, use /link for references to each assembly (set the Embed Interop Types property to True). To remove the warning, you can use /reference instead (set the Embed Interop Types property to False). In this case, a primary interop assembly (PIA) provides interop type information.
cs: Přidali jste odkaz na sestavení pomocí parametru /link (vlastnost Přibalit definované typy nastavená na True). Tím se kompilátoru dává instrukce, aby vložil informace o typech spolupráce z tohoto sestavení. Kompilátor ale nemůže tyto informace z tohoto sestavení vložit, protože jiné sestavení, na které jste nastavili odkaz, odkazuje taky na toto sestavení, a to pomocí parametru /reference (vlastnost Přibalit definované typy nastavená na False). Pokud chcete vložit informace o typech spolupráce pro obě sestavení, odkazujte na každé z nich pomocí parametru /link (vlastnost Přibalit definované typy nastavená na True). Pokud chcete odstranit toto varování, můžete místo toho použít /reference (vlastnost Přibalit definované typy nastavená na False). V tomto případě uvedené informace poskytne primární definiční sestavení (PIA).
de: Sie haben einen Verweis zu einer Assembly hinzugefügt mifhilte von /link (Einbetten der Interoptypen-Eigenschaft auf True festegelegt). Dadurch wird der Compiler angewiesen, die Interoptypeninformationen aus der Assembly einzubetten. Der Compiler kann jedoch keine Interoptypeninformationen aus der Assembly einbetten, da eine andere Assembly, auf die Sie verweisen, auch auf diese Assembly verweist mithilfe von /reference (Einbetten der Interoptypen-Eigenschaft auf False festegelegt.) Um Interoptypeninformationen für beide Assemblys einzubetten, verwenden Sie /link für die Verweise zu den einzelnen Assemblys (Einbetten der Interoptypen-Eigenschaft auf True festlegen). Um die Warnung zu beheben, können Sie stattdessen /reference verwenden (Einbetten der Interoptypen-Eigenschaft auf False festlegen). In diesem Fall stellt eine primäre Interop-Assembly (PIA) Interoptypeninformationen bereit.
es: Ha añadido una referencia a un ensamblado con /link (con la propiedad Embed Interop Types establecida como verdadera). Esto instruye al compilador para que inserte información del tipo de interoperabilidad desde ese ensamblado. Sin embargo, el compilador no puede insertar información del tipo de interoperabilidad desde ese ensamblado porque hay otro ensamblado que ha referenciado que hace referencia a ese ensamblado con /reference (con la propiedad Embed Interop Types establecida como falsa). Para insertar información del tipo de interoperabilidad en ambos ensamblados, use /link para las referencias de ambos ensamblados (establezca la propiedad Embed Interop Types como verdadera). Para eliminar la advertencia puede usar /reference (establezca la propiedad Embed Interop Types como falsa). En este caso, un ensamblado de interoperabilidad primario (PIA) provee información del tipo de interoperabilidad.
fr: Vous avez ajouté une référence à un assembly en utilisant /link (la propriété Incorporer les types interop est définie sur True). Cette commande ordonne au compilateur d'incorporer les informations de type interop à partir de cet assembly. Cependant, le compilateur ne peut pas incorporer les informations de type interop à partir de cet assembly, car un autre assembly que vous avez référencé référence également cet assembly en utilisant /reference (la propriété Incorporer les types interop est définie sur False). Pour incorporer les informations de type interop pour chaque assembly, utilisez la commande /link pour les références de chaque assembly (définissez la propriété Incorporer les types interop sur True). Pour supprimer l'avertissement, vous pouvez utiliser la commande /reference (définissez la propriété Incorporer les types interop sur False). Dans ce cas, un assembly PIA (Primary Interop Assembly) fournit des informations de type interop.
it: Per aggiungere un riferimento a un assembly, è stato usato /link (proprietà Incorpora tipi di interoperabilità impostata su True). Questo parametro indica al compilatore di incorporare le informazioni sui tipi di interoperabilità da tale assembly. Il compilatore non è però in grado di incorporare tali informazioni dall'assembly perché anche un altro assembly a cui viene fatto riferimento fa riferimento a tale assembly tramite /reference (proprietà Incorpora tipi di interoperabilità impostata su False). Per incorporare le informazioni sui tipi di interoperabilità per entrambi gli assembly, usare /link per i riferimenti ai singoli assembly (impostare la proprietà Incorpora tipi di interoperabilità su True). Per rimuovere l'avviso, è invece possibile usare /reference (impostare la proprietà Incorpora tipi di interoperabilità su False). In questo caso, le informazioni sui tipi di interoperabilità verranno fornite da un assembly di interoperabilità primario.
ja: /link (相互運用機能型の埋め込みプロパティを True に設定する) を使用して、アセンブリへの参照を追加しました。これを実行することで、コンパイラにそのアセンブリから相互運用の型情報を埋め込むよう指示します。しかし、参照した別のアセンブリが /reference (相互運用機能型の埋め込みプロパティを False に設定する) を使用してそのアセンブリを参照しているため、コンパイラはそのアセンブリの相互運用の型情報を埋め込むことができません。 両方のアセンブリの相互運用の型情報を埋め込むには、各アセンブリへの参照に /link (相互運用機能型の埋め込みプロパティを True に設定する) を使用します。 警告を取り除くには、代わりに /reference (相互運用機能型の埋め込みプロパティを False に設定) を使用します。この場合、プライマリ相互運用機能アセンブリ (PIA) が相互運用の型情報を提供します。
ko: /link를 사용하여 어셈블리에 대한 참조를 추가했습니다(Interop 형식 포함 속성을 True로 설정). 이는 해당 어셈블리의 interop 유형 정보를 포함하도록 컴파일러에 지시합니다. 그러나 참조한 다른 어셈블리에서도 /reference를 사용하여 해당 어셈블리를 참조하므로 컴파일러에서 해당 어셈블리의 interop 형식 정보를 포함할 수 없습니다(Interop 형식 포함 속성을 False로 설정). 두 어셈블리에 대한 interop 형식 정보를 포함하려면 각 어셈블리에 대한 참조에 대해 /link를 사용합니다(Interop 형식 포함 속성을 True로 설정). 경고를 제거하려면 /reference를 대신 사용할 수 있습니다(Interop 형식 포함 속성을 False로 설정). 이 경우 PIA(주 interop 어셈블리)는 interop 형식 정보를 제공합니다.
pl: Dodano odwołanie do zestawu przy użyciu opcji /link (ustawienie wartości True dla właściwości Osadź typy międzyoperacyjne). Nakazuje to kompilatorowi osadzenie informacji o typie międzyoperacyjnym z tego zestawu. Jednak kompilator nie może osadzić informacji o typie międzyoperacyjnym z tego zestawu, ponieważ inny przywoływany zestaw odwołuje się do tego zestawu przy użyciu opcji /reference (ustawienie wartości False dla właściwości Osadź typy międzyoperacyjne). Aby osadzić informacje o typie międzyoperacyjnym dla obu zestawów, użyj opcji /link dla odwołań do każdego zestawu (ustaw wartość True dla właściwości Osadź typy międzyoperacyjne). Aby usunąć ostrzeżenie, możesz zamiast tego użyć opcji /reference (ustaw wartość False dla właściwości Osadź typy międzyoperacyjne). W takiej sytuacji informacje o typie międzyoperacyjnym udostępnia podstawowy zestaw międzyoperacyjny.
pt_br: Você adicionou uma referência a um assembly usando /link (propriedade Incorporar Tipos de Interoperabilidade definida como Verdadeiro). Isso instrui o compilador a incorporar as informações de tipo de interoperabilidade desse assembly. No entanto, o compilador não pode incorporar informações de tipo de interoperabilidade desse assembly porque outro conjunto que você referenciou também faz referência a esse assembly usando /reference (propriedade Incorporar Tipos de Interoperabilidade definida como Falso). Para incorporar informações de tipo de interoperabilidade para os dois assemblies, use /link para fazer referência a cada assembly (defina a propriedade Incorporar Tipos de Interoperabilidade para Verdadeiro). Para remover o aviso, você pode usar o /reference em vez disso (defina a propriedade Incorporar Tipos de Interoperabilidade como Falso). Nesse caso, um PIA (assembly de interoperabilidade primário) fornece informações de tipo de interoperabilidade.
ru: Вы добавили ссылку на сборку с помощью /link (для свойства "Внедрять типы взаимодействия" задано значение true). Это сообщает компилятору, что следует внедрять сведения о типе взаимодействия из этой сборки. Однако компилятор не может внедрять сведения о типе взаимодействия из этой сборки, так как сборка, на которую указывает ссылка, также ссылается на сборку, использующую /reference (для свойства "Внедрять типы взаимодействия" задано значение false). Чтобы внедрить сведения о типах взаимодействия в обе сборки, используйте /link для ссылок на каждую сборку (задайте для свойства "Внедрять типы взаимодействия" значение true). Чтобы удалить предупреждение, можно использовать /reference (задайте для свойства "Внедрять типы взаимодействия" значение false). В этом случае основная сборка взаимодействия предоставит сведения о типе взаимодействия.
tr: /link (Birlikte Çalışma Türlerini Katıştır özelliği True olarak ayarlandı) kullanarak bir derlemeye başvuru eklediniz. Bu derleyiciye bu derlemeden birlikte çalışma türleri bilgilerini katıştırmasını söyler. Ancak, başvuruda bulunduğunuz başka bir derleme de /reference (Birlikte Çalışma Türlerini Katıştır özelliği False olarak ayarlanmış) kullanarak bu derlemeye başvurduğundan, derleyici bu derlemeden birlikte çalışma türü bilgilerini katıştıramıyor. Birlikte çalışma türü bilgilerini her iki derlemeden de katıştırmak için, her bir derlemeye başvurular için /link kullanın (Birlikte Çalışma Türlerini Katıştır özelliğini True olarak ayarlayın). Uyarıyı kaldırmak için, /reference kullanabilirsiniz (Birlikte Çalışma Türlerini Katıştır özelliğini False olarak ayarlayın). Bu durumda, birincil birlikte çalışma bütünleştirilmiş kodu (PIA), birlikte çalışma türü bilgilerini sağlar.
zh_hans: 你已使用 /link (“嵌入互操作类型”属性设置为 True)将引用添加到程序集。这指示编译器从此程序集嵌入互操作类型信息。但是由于已引用的另一个程序集也使用 /reference (“嵌入互操作类型属性”设置为 False)引用了此程序集，因此编译器不能从此程序集嵌入互操作类型信息。 要为两个程序集嵌入互操作类型信息，请对每个程序集的引用使用 /link (“嵌入互操作类型”属性设置为 True)。 要移除警告，可改用 /reference (“嵌入互操作类型”属性设置为 False)。在此情况下，主互操作程序集(PIA)会提供互操作类型信息。
zh_hant: 您已使用 /link 新增組件參考 (內嵌 Interop 類型屬性設定為 True)。這會指示編譯器內嵌該組件中的 Interop 類型資訊。不過，編譯器無法內嵌該組件中的 Interop 類型資訊，因為您已參考的另一個組件也會使用 /reference 來參考該組件 (內嵌 Interop 類型屬性設定為 False)。 若要內嵌兩個組件的 Interop 類型資訊，請針對每一個組件參考使用 /link (內嵌 Interop 類型屬性設定為 True)。 若要移除警告，您可以改用 /reference (內嵌 Interop 類型屬性設定為 False)。在此情況下，主要 Interop 組件 (PIA) 會提供 Interop 類型資訊。

# ERR_GenericsUsedAcrossAssemblies
source: Type '{0}' from assembly '{1}' cannot be used across assembly boundaries because it has a generic type argument that is an embedded interop type.
cs: Typ {0} ze sestavení {1} se nedá použít přes hranice sestavení, protože má argument obecného typu, který je vloženým definičním typem.
de: Der Typ "{0}" aus der Assembly "{1}" kann nichtüber Assemblygrenzen hinweg verwendet werden, da er ein generisches Typargument besitzt, bei dem es sich um einen eingebetteten Interoptyp handelt.
es: El tipo "{0}" del ensamblado "{1}" no se puede usar en los distintos límites de ensamblado porque tiene un argumento de tipo genérico que es un tipo de interoperabilidad incrustado.
fr: Impossible d'utiliser le type '{0}' de l'assembly '{1}' au-delà des limites de l'assembly, car il a un argument de type générique qui est un type interop incorporé.
it: Non è possibile usare il tipo '{0}' dell'assembly '{1}' tra limiti di assembly perché contiene un argomento tipo generico che corrisponde a un tipo di interoperabilità incorporato.
ja: アセンブリ '{1}' の型 '{0}' には、埋め込み相互運用型のジェネリック型引数があるため、アセンブリ境界を越えて使用することはできません。
ko: {1}' 어셈블리의 '{0}' 형식에 포함된 interop 형식인 제네릭 형식 인수가 있기 때문에 이 형식을 다른 어셈블리에서 사용할 수 없습니다.
pl: Typ „{0}” z zestawu „{1}” nie może być używany między granicami zestawów, ponieważ ma argument typu ogólnego, który jest osadzonym typem międzyoperacyjnym.
pt_br: O tipo "{0}" do assembly '{1}' não pode ser usado em limites de assembly porque ele tem um argumento de tipo genérico que é um tipo de interoperabilidade inserido.
ru: Тип "{0}" из сборки "{1}" не может быть использован за границами сборки, так как имеет аргумент универсального типа, являющийся внедренным типом взаимодействия.
tr: {1}' bütünleştirilmiş kodundaki '{0}' türü, gömülü birlikte çalışma türü olan bir genel tür bağımsız değişkeni içerdiğinden bütünleştirilmiş kod sınırları arasında kullanılamaz.
zh_hans: 无法跨程序集边界使用程序集“{1}”中的类型“{0}”，因为它有身为嵌入的互操作类型的泛型类型参数。
zh_hant: 因為組件 '{1}' 的類型 '{0}' 具有屬於內嵌 Interop 類型的泛型類型引數，所以不可跨組件的界限使用。

# ERR_NoCanonicalView
source: Cannot find the interop type that matches the embedded interop type '{0}'. Are you missing an assembly reference?
cs: Nejde najít typ spolupráce, který odpovídá vloženému typu {0}. Nechybí odkaz na sestavení?
de: Der Interoptyp, der mit dem eingebetteten Interoptyp "{0}" übereinstimmt, wurde nicht gefunden. Möglicherweise fehlt ein Assemblyverweis.
es: No se encuentra el tipo de interoperabilidad que coincide con el tipo de interoperabilidad incrustado '{0}'. ¿Falta alguna referencia de ensamblado?
fr: Le type interop qui correspond au type interop incorporé '{0}' est introuvable. Vous manque-t-il une référence d'assembly ?
it: Il tipo di interoperabilità corrispondente al tipo di interoperabilità incorporato '{0}' non è stato trovato. Probabilmente manca un riferimento all'assembly.
ja: 埋め込み相互運用型 '{0}' と一致する相互運用型が見つかりません。アセンブリ参照が指定されていることを確認してください。
ko: 포함된 interop 형식 '{0}'과(와) 일치하는 interop 형식을 찾을 수 없습니다. 어셈블리 참조가 있는지 확인하세요.
pl: Nie można znaleźć typu międzyoperacyjnego zgodnego z osadzonym typem międzyoperacyjnym „{0}”. Czy brakuje odwołania do zestawu?
pt_br: Não é possível encontrar o tipo de interoperabilidade que corresponda ao tipo de interoperabilidade inserido "{0}". Está faltando uma referência de assembly?
ru: Не удается найти тип взаимодействия, соответствующий внедренному типу взаимодействия "{0}". Возможно, отсутствует ссылка на сборку.
tr: Gömülü birlikte çalışma türü '{0}' ile eşleşen birlikte çalışma türü bulunamıyor. Bir derleme başvurunuz mu eksik?
zh_hans: 找不到与嵌入互操作类型“{0}”相匹配的互操作类型。是否缺少程序集引用?
zh_hant: 找不到符合內嵌 Interop 類型 '{0}' 的 Interop 類型。是否遺漏了組件參考?

# ERR_NetModuleNameMismatch
source: Module name '{0}' stored in '{1}' must match its filename.
cs: Název modulu {0} uložený v {1} musí odpovídat svému názvu souboru.
de: Der in "{1}" gespeicherte Modulname "{0}" muss mit seinem Dateinamen übereinstimmen.
es: El nombre de archivo '{0}' almacenado en '{1}' debe coincidir con su nombre de archivo.
fr: Le nom de module '{0}' stocké dans '{1}' doit correspondre à son nom de fichier.
it: Il nome modulo '{0}' memorizzato in '{1}' deve corrispondere al relativo nome di file.
ja: '{1}' に格納されているモジュール名 '{0}' はファイル名と一致する必要があります。
ko: {1}'에 저장된 '{0}' 모듈 이름은 파일 이름과 일치해야 합니다.
pl: Nazwa modułu „{0}” przechowywana w elemencie „{1}” musi być zgodna z nazwą jego pliku.
pt_br: Nome do módulo "{0}" armazenado em "{1}" deve coincidir com seu filename.
ru: Имя модуля "{0}", сохраненное в "{1}", должно соответствовать его имени файла.
tr: {1}' öğesinde depolanan '{0}' modül adı dosya adıyla eşleşmelidir.
zh_hans: 存储在“{1}”中的模块名“{0}”必须与其文件名匹配。
zh_hant: 儲存在 '{1}' 中的模組名稱 '{0}'，必須符合其檔案名稱。

# ERR_BadModuleName
source: Invalid module name: {0}
cs: Neplatný název modulu: {0}
de: Ungültiger Modulname: {0}
es: Nombre de módulo no válido: {0}
fr: Nom de module non valide : {0}
it: Nome di modulo non valido: {0}
ja: 無効なモジュール名: {0}
ko: 잘못된 모듈 이름: {0}
pl: Nieprawidłowa nazwa modułu: {0}
pt_br: Nome de módulo inválido: {0}
ru: Недопустимое имя модуля: {0}
tr: Modül adı geçersiz: {0}
zh_hans: 无效的模块名称: {0}
zh_hant: 模組名稱 {0} 無效

# ERR_BadCompilationOptionValue
source: Invalid '{0}' value: '{1}'.
cs: Neplatná hodnota {0}: {1}
de: Ungültiger Wert "{0}": "{1}".
es: Valor de '{0}' no válido: '{1}'.
fr: Valeur de '{0}' non valide : '{1}'.
it: Il valore di '{0}' non è valido: '{1}'.
ja: '{0}' の値 '{1}' は無効です。
ko: 잘못된 '{0}' 값입니다('{1}').
pl: Nieprawidłowa wartość „{0}”: „{1}”.
pt_br: Valor "{0}" inválido: "{1}".
ru: Недопустимое значение "{0}": '{1}'.
tr: Geçersiz '{0}' değeri: '{1}'.
zh_hans: “{0}”值无效:“{1}”。
zh_hant: 無效的 '{0}' 值: '{1}'。

# ERR_BadAppConfigPath
source: AppConfigPath must be absolute.
cs: AppConfigPath musí být absolutní.
de: AppConfigPath muss absolut sein.
es: AppConfigPath debe ser absoluto.
fr: AppConfigPath doit être absolu.
it: AppConfigPath deve essere assoluto.
ja: AppConfigPath は絶対パスである必要があります。
ko: AppConfigPath는 절대 경로여야 합니다.
pl: Ścieżka AppConfigPath musi być bezwzględna.
pt_br: AppConfigPath deve ser absoluto.
ru: AppConfigPath должен быть абсолютным.
tr: AppConfigPath mutlak olmalıdır.
zh_hans: AppConfigPath 必须是绝对的。
zh_hant: AppConfigPath 必須是絕對路徑。

# WRN_AssemblyAttributeFromModuleIsOverridden
source: Attribute '{0}' from module '{1}' will be ignored in favor of the instance appearing in source
cs: Atribut {0} z modulu {1} se bude ignorovat ve prospěch instance, která se objeví ve zdroji.
de: Das Attribut "{0}" aus dem Modul "{1}" wird ignoriert, stattdessen wird die Instanz der Quelle verwendet.
es: El atributo '{0}' del módulo '{1}' se omitirá a favor de la instancia que aparece en el origen
fr: L'attribut '{0}' du module '{1}' sera ignoré au profit de l'instance présente dans la source
it: L'attributo '{0}' del modulo '{1}' verrà ignorato e verrà usata l'istanza presente nell'origine
ja: モジュール '{1}' の属性 '{0}' は、ソースに表示されるインスタンスのために無視されます
ko: {1}' 모듈의 '{0}' 특성은 소스에 나타나는 인스턴스를 위해 무시됩니다.
pl: Atrybut „{0}” z modułu „{1}” zostanie zignorowany na korzyść wystąpienia w źródle
pt_br: Atributo "{0}" do módulo "{1}" será ignorado em favor da instância que aparece na fonte
ru: Атрибут "{0}" модуля "{1}" будет игнорироваться, вместо него используется экземпляр в источнике.
tr: {1}' modülünden '{0}' özniteliği, kaynakta görünen örneğin yararına yoksayılacak
zh_hans: 来自模块“{1}”的特性“{0}”将忽略，以便支持源中出现的实例
zh_hant: 將會忽略模組 '{1}' 中的屬性 '{0}'，改用出現在來源中的執行個體

# WRN_AssemblyAttributeFromModuleIsOverridden_Title
source: Attribute will be ignored in favor of the instance appearing in source
cs: Atribut se bude ignorovat ve prospěch instance zobrazené ve zdroji.
de: Attribut wird ignoriert, damit die in der Quelle angezeigte Instanz bevorzugt werden kann
es: Se ignorará el atributo en beneficio de la instancia que aparece en la fuente
fr: L'attribut sera ignoré en faveur de l'instance présente dans la source
it: L'attributo verrà ignorato e verrà usata l'istanza presente nell'origine
ja: インスタンスがソースに表示されるため、属性は無視されます
ko: 소스에 표시되는 인스턴스를 위해 특성이 무시됨
pl: Atrybut zostanie zignorowany na rzecz wystąpienia w źródle
pt_br: O atributo será ignorado em prol da instância que aparece na fonte
ru: Вместо атрибута будет использоваться экземпляр, отображающийся в источнике
tr: Kaynakta görünen örnek için öznitelik yoksayılacak
zh_hans: 将忽略特性，以便支持源中出现的实例
zh_hant: 因來源中出現的執行個體，將會忽略屬性

# ERR_CmdOptionConflictsSource
source: Attribute '{0}' given in a source file conflicts with option '{1}'.
cs: Atribut {0} daný ve zdrojovém souboru je v konfliktu s možností {1}.
de: Das in einer Quelldatei angegebene Attribut "{0}" steht mit der Option "{1}" in Konflikt.
es: El atributo '{0}' indicado en un archivo de origen entra en conflicto con la opción '{1}'.
fr: L'attribut '{0}' spécifié dans un fichier source est en conflit avec l'option '{1}'.
it: L'attributo '{0}' specificato in un file di origine è in conflitto con l'opzione '{1}'.
ja: ソース ファイルで指定された属性 '{0}' はオプション '{1}' と競合しています。
ko: 소스 파일에 지정된 '{0}' 특성이 '{1}' 옵션과 충돌합니다.
pl: Atrybut „{0}” podany w pliku źródłowym jest w konflikcie z opcją „{1}”.
pt_br: O atributo '{0}' fornecido em um arquivo de origem conflita com a opção '{1}'.
ru: Атрибут "{0}", заданный в исходном файле, конфликтует с параметром "{1}".
tr: Bir kaynak dosyada verilen '{0}' özniteliği '{1}' seçeneği ile çakışıyor.
zh_hans: 源文件中提供的特定“{0}”与选项“{1}”冲突。
zh_hant: 原始程式檔中所提供的屬性 '{0}'，與選項 '{1}' 相衝突。

# ERR_FixedBufferTooManyDimensions
source: A fixed buffer may only have one dimension.
cs: Pevná vyrovnávací paměť může mít jen jednu dimenzi.
de: Ein fester Puffer darf nur eine Dimension aufweisen.
es: Un búfer fijo solo puede tener una dimensión.
fr: Une mémoire tampon fixe ne peut avoir qu'une seule dimension.
it: Un buffer fisso può avere una sola dimensione.
ja: 固定バッファーには 1 次元のみを指定できます。
ko: 고정 버퍼에는 1차원만 사용할 수 있습니다.
pl: Ustalony bufor może mieć tylko jeden wymiar.
pt_br: Um buffer fixo pode ter somente uma dimensão.
ru: Буфер фиксированного размера может иметь только одно измерение.
tr: Sabit bir arabelleğin yalnızca bir boyutu olabilir.
zh_hans: 固定缓冲区只能有一个维度。
zh_hant: 固定緩衝區只能有一個維度。

# WRN_ReferencedAssemblyDoesNotHaveStrongName
source: Referenced assembly '{0}' does not have a strong name.
cs: Odkazované sestavení {0} nemá silný název.
de: Die referenzierte Assembly "{0}" besitzt keinen starken Namen.
es: El ensamblado '{0}' al que se hace referencia no tiene un nombre seguro.
fr: L'assembly référencé '{0}' n'a pas de nom fort.
it: L'assembly '{0}' al quale si fa riferimento non ha un nome sicuro.
ja: 参照アセンブリ '{0}' には厳密な名前がありません。
ko: 참조된 어셈블리 '{0}'에 강력한 이름이 없습니다.
pl: Przywoływany zestaw „{0}” nie ma silnej nazwy.
pt_br: Assembly referenciado "{0}" não tem um nome forte.
ru: У сборки "{0}", на которую дается ссылка, нет строгого имени.
tr: {0}' başvurulan derlemesinin güçlü bir adı yok.
zh_hans: 引用程序集“{0}”没有强名称。
zh_hant: 參考組件 '{0}' 沒有強式名稱。

# WRN_ReferencedAssemblyDoesNotHaveStrongName_Title
source: Referenced assembly does not have a strong name
cs: Odkazované sestavení nemá silný název.
de: Referenzierte Assembly hat keinen starken Namen
es: El ensamblado al que se hace referencia no tiene un nombre seguro
fr: L'assembly référencé n'a pas de nom fort
it: L'assembly di riferimento non ha un nome sicuro
ja: 参照されているアセンブリには、厳密な名前がありません
ko: 참조된 어셈블리는 강력한 이름을 사용하지 않습니다.
pl: Przywoływany zestaw nie ma silnej nazwy
pt_br: Assembly referenciado sem um nome forte
ru: Сборка, на которую указывает ссылка, не имеет строгого имени
tr: Başvurulan derlemenin güçlü bir adı yok
zh_hans: 引用程序集没有强名称
zh_hant: 參考的組件沒有強式名稱

# ERR_InvalidSignaturePublicKey
source: Invalid signature public key specified in AssemblySignatureKeyAttribute.
cs: V atributu AssemblySignatureKeyAttribute je uvedený neplatný veřejný klíč podpisu.
de: Im AssemblySignatureKeyAttribute wurde ein öffentlicher Schlüssel mit ungültiger Signatur angegeben.
es: Se especificó una clave pública de firma no válida en AssemblySignatureKeyAttribute.
fr: Une clé publique de signature non valide a été spécifiée dans AssemblySignatureKeyAttribute.
it: La chiave pubblica di firma specificata in AssemblySignatureKeyAttribute non è valida.
ja: 無効な署名公開キーが AssemblySignatureKeyAttribute で指定されました。
ko: AssemblySignatureKeyAttribute에 잘못된 시그니처 공개 키가 지정되었습니다.
pl: W atrybucie AssemblySignatureKeyAttribute określono nieprawidłowy klucz publiczny sygnatury.
pt_br: Chave pública de assinatura inválida especificada em AssemblySignatureKeyAttribute.
ru: В AssemblySignatureKeyAttribute определен недопустимый открытый ключ подписи.
tr: AssemblySignatureKeyAttribute içinde geçersiz imza ortak anahtarı belirtildi.
zh_hans: 在 AssemblySignatureKeyAttribute 中指定的签名公钥无效。
zh_hant: AssemblySignatureKeyAttribute 中指定的簽章公開金鑰無效。
