Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UnassignedThisSupportedVersion
source: Control is returned to caller before field '{0}' is explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Volajícímu se vrátí ovládací prvek před explicitním přiřazením pole{0}, což způsobí předchozí implicitní přiřazení default.
fr: Le contrôle est retourné à l’appelant avant que le champ '{0}' ne soit explicitement attribué, ce qui provoque une attribution implicite précédente de 'default'.
it: Il controllo viene restituito al chiamante prima che il campo '{0}' sia assegnato in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: フィールド '{0}' が明示的に割り当てられる前にコントロールが呼び出し元に返され、先行する暗黙的な代入が 'default' になります。
pl: Kontrolka jest zwracana do obiektu wywołującego przed jawnym przypisaniem pola „{0}”, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O controle é devolvido ao chamador antes que o campo '{0}' seja explicitamente atribuído, causando uma atribuição implícita anterior de 'default'.
ru: Контроль возвращается вызывающему элементу до явного назначения поля "{0}", что приводит к предшествующему неявному назначению "default"
zh_hans: 在显式分配字段'{0}'之前，将向调用方返回控件，从而导致前面的隐式分配为“default”。
zh_hant: 在明確指派欄位 '{0}' 之前會先將控制項傳回呼叫者，導致先前隱含的指派為 'default'。

# WRN_UnassignedThisSupportedVersion_Title
source: Control is returned to caller before field is explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Volajícímu se vrátí ovládací prvek před explicitním přiřazením pole, což způsobí předchozí implicitní přiřazení default.
fr: Le contrôle est retourné à l’appelant avant que le champ ne soit explicitement affecté, ce qui provoque une attribution implicite précédente de « default ».
it: Il controllo viene restituito al chiamante prima che il campo sia assegnato in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: フィールドが明示的に割り当てられる前にコントロールが呼び出し元に返され、先行する暗黙的な代入が 'default' になります。
pl: Kontrolka jest zwracana do obiektu wywołującego przed jawnym przypisaniem pola, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O controle é devolvido ao chamador antes que o campo seja explicitamente atribuído, causando uma atribuição implícita anterior de 'default'.
ru: Контроль возвращается вызывающему элементу до явного назначения поля, что приводит к предшествующему неявному назначению "default"
zh_hans: 在显式分配字段之前，将向调用方返回控件，从而导致前面的隐式分配为 'default'。
zh_hant: 在明確指派欄位之前會先將控制項傳回呼叫者，導致先前隱含的指派為 'default'。

# WRN_UnassignedThisUnsupportedVersion
source: Field '{0}' must be fully assigned before control is returned to the caller. Consider updating to language version '{1}' to auto-default the field.
cs: Před vrácením řízení volajícímu se musí plně přiřadit pole {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení pole.
fr: Le champ '{0}' doit être entièrement attribué avant que le contrôle soit retourné à l’appelant. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement le champ par défaut.
it: Il campo '{0}' deve essere assegnato completamente prima che il controllo sia restituito al chiamante. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente il campo come predefinito.
ja: コントロールを呼び出し元に返す前に、フィールド '{0}' を完全に割り当てる必要があります。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Pole „{0}” musi być w pełni przypisane, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie pola do wersji językowej „{1}”, aby automatycznie ustawić domyślne pole.
pt_br: O campo '{0}' deve ser totalmente atribuída antes que o controle seja devolvido ao chamador. Considere atualizar para a versão de linguagem '{1}' para auto-padrão do campo.
ru: Поле '{0}' должно быть полностью назначенным перед возвратом контроля вызывающему элементу. Попробуйте обновить поле до языковой версии "{1}", чтобы автоматически применить значение по умолчанию.
zh_hans: 必须先完全分配字段 '{0}' ，然后才能将控件返回给调用方。请考虑更新到语言版本 '{1}' 以自动默认字段。
zh_hant: 在控制項傳回呼叫者之前，必須先完全指派欄位 '{0}'。請考慮更新至語言版本 '{1}' 以自動預設欄位。

# WRN_UnassignedThisUnsupportedVersion_Title
source: Fields of a struct must be fully assigned in a constructor before control is returned to the caller. Consider updating the language version to auto-default the field.
cs: Před vrácením řízení volajícímu se musí v konstruktoru plně přiřadit pole struktury. Zvažte aktualizaci jazykové verze na automatické výchozí nastavení pole.
fr: Les champs d’un struct doivent être entièrement assignés dans un constructeur avant que le contrôle soit retourné à l’appelant. Envisagez de mettre à jour la version du langage pour qu’elle corresponde à la valeur par défaut automatique du champ.
it: I campi di uno struct devono essere completamente assegnati in un costruttore prima che il controllo sia restituito al chiamante. Provare ad aggiornare la versione del linguaggio per impostare automaticamente il campo come predefinito.
ja: 構造体のフィールドは、コントロールが呼び出し元に返される前にコンストラクターに完全に割り当てられている必要があります。言語バージョンを更新してフィールドを自動で既定にすることを検討してください。
pl: Pola struktury muszą być w pełni przypisane w konstruktorze, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie wersji języka w celu automatycznego ustawienia domyślnego pola.
pt_br: Os campos de um struct devem ser totalmente atribuídos em um construtor antes que o controle seja devolvido ao chamador. Considere atualizar a versão de linguagem para auto-padrão do campo.
ru: Поля структуры должны быть полностью назначены в конструкторе перед возвратом контроля вызывающему элементу. Попробуйте обновить языковую версию, чтобы автоматически применить значение по умолчанию к этому полю.
zh_hans: 在将控件返回给调用方之前，必须在构造函数中完全分配结构的字段。请考虑更新语言版本以自动默认字段。
zh_hant: 在控制項傳回呼叫者之前，必須先在建構函式中完全指派結構的欄位。請考慮更新至語言版本以自動預設欄位。

# WRN_UnboxPossibleNull
source: Unboxing a possibly null value.
cs: Rozbalení možné hodnoty null
de: Unboxing eines möglichen NULL-Werts.
es: Conversión unboxing a un valor posiblemente NULL.
fr: Conversion unboxing d'une valeur peut-être null.
it: Conversione unboxing di un possibile valore Null.
ja: null の可能性がある値をボックス化解除しています。
ko: 가능한 null 값을 unboxing합니다.
pl: Konwersja unboxing wartości, która może być wartością null.
pt_br: Executando a conversão unboxing de um valor possivelmente nulo.
ru: Распаковка-преобразование вероятного значения NULL.
tr: Olası bir null değeri kutudan çıkarma.
zh_hans: 取消装箱可能为 null 的值。
zh_hant: Unboxing 可能 null 值。

# WRN_UnboxPossibleNull_Title
source: Unboxing a possibly null value.
cs: Rozbalení možné hodnoty null
de: Unboxing eines möglichen NULL-Werts.
es: Conversión unboxing a un valor posiblemente NULL.
fr: Conversion unboxing d'une valeur peut-être null.
it: Conversione unboxing di un possibile valore Null.
ja: null の可能性がある値をボックス化解除しています。
ko: 가능한 null 값을 unboxing합니다.
pl: Konwersja unboxing wartości, która może być wartością null.
pt_br: Executando a conversão unboxing de um valor possivelmente nulo.
ru: Распаковка-преобразование вероятного значения NULL.
tr: Olası bir null değeri kutudan çıkarma.
zh_hans: 取消装箱可能为 null 的值。
zh_hant: Unboxing 可能 null 值。

# WRN_UnconsumedEnumeratorCancellationAttributeUsage
source: The EnumeratorCancellationAttribute applied to parameter '{0}' will have no effect. The attribute is only effective on a parameter of type CancellationToken in an async-iterator method returning IAsyncEnumerable
cs: EnumeratorCancellationAttribute, který se používá u parametru {0}, nebude mít žádný účinek. Tento atribut je platný jenom u parametru typu CancellationToken v metodě async-iterator, která vrací IAsyncEnumerable.
de: Das auf den Parameter "{0}" angewendete EnumeratorCancellationAttribute hat keine Auswirkungen. Das Attribut ist nur für einen Parameter vom Typ "CancellationToken" in einer async-iterator-Methode gültig, die IAsyncEnumerable zurückgibt.
es: El valor de EnumeratorCancellationAttribute aplicado al parámetro "{0}" no surtirá efecto. El atributo solo es efectivo en un parámetro de tipo CancellationToken en un método iterador asincrónico que devuelve IAsyncEnumerable
fr: Le EnumeratorCancellationAttribute appliqué au paramètre '{0}' n'aura aucun effet. L'attribut s'applique uniquement à un paramètre de type CancellationToken dans une méthode d'itérateur asynchrone qui retourne IAsyncEnumerable
it: L'attributo EnumeratorCancellationAttribute applicato al parametro '{0}' non avrà alcun effetto. L'attributo ha effetto solo su un parametro di tipo CancellationToken in un metodo di iteratore asincrono che restituisce IAsyncEnumerable
ja: パラメーター '{0}' に適用された EnumeratorCancellationAttribute は効果がありません。この属性は、IAsyncEnumerable を返す非同期反復子メソッドの CancellationToken 型のパラメーターに対してのみ効果があります
ko: '{0}' 매개 변수에 적용된 EnumeratorCancellationAttribute는 영향을 주지 않습니다. 이 특성은 IAsyncEnumerable을 반환하는 비동기 반복기 메서드에 있는 CancellationToken 형식의 매개 변수에만 유효합니다.
pl: Atrybut EnumeratorCancellationAttribute zastosowany dla parametru „{0}” nie będzie miał żadnego efektu. Atrybut jest uwzględniany tylko dla parametru typu CancellationToken w asynchronicznej metodzie iteratora zwracającej interfejs IAsyncEnumerable.
pt_br: O EnumeratorCancellationAttribute aplicado ao parâmetro '{0}' não terá efeito. O atributo é eficaz somente em um parâmetro do tipo CancellationToken em um método iterador assíncrono que retorna IAsyncEnumerable
ru: Атрибут EnumeratorCancellationAttribute, применяемый к параметру "{0}", не будет оказывать никакого влияния. Этот атрибут действует только для параметра типа CancellationToken в методе асинхронного итератора, возвращающем IAsyncEnumerable.
tr: '{0}' parametresine uygulanan EnumeratorCancellationAttribute hiçbir etkiye sahip olmayacak. Öznitelik yalnızca, IAsyncEnumerable döndüren bir async-iterator yönteminde bulunan CancellationToken türündeki bir parametre üzerinde etkilidir
zh_hans: 应用于参数 "{0}" 的 EnumeratorCancellationAttribute 将不起任何作用。该属性仅在返回 IAsyncEnumerable 的异步迭代器方法中 CancellationToken 类型的参数上有效
zh_hant: 套用到參數 '{0}' 的 EnumeratorCancellationAttribute 不會有任何作用。屬性只有在會傳回 IAsyncEnumerable 的非同步迭代器方法中，在類型 CancellationToken 的參數上才有效

# WRN_UnconsumedEnumeratorCancellationAttributeUsage_Title
source: The EnumeratorCancellationAttribute will have no effect. The attribute is only effective on a parameter of type CancellationToken in an async-iterator method returning IAsyncEnumerable
cs: EnumeratorCancellationAttribute nebude mít žádný účinek. Tento atribut je platný jenom u parametru typu CancellationToken v metodě async-iterator, která vrací IAsyncEnumerable.
de: Das EnumeratorCancellationAttribute hat keine Auswirkungen. Das Attribut ist nur für einen Parameter vom Typ "CancellationToken" in einer async-iterator-Methode gültig, die IAsyncEnumerable zurückgibt.
es: El valor de EnumeratorCancellationAttribute no surtirá efecto. El atributo solo es efectivo en un parámetro de tipo CancellationToken en un método iterador asincrónico que devuelve IAsyncEnumerable
fr: EnumeratorCancellationAttribute n'aura aucun effet. L'attribut s'applique uniquement à un paramètre de type CancellationToken dans une méthode d'itérateur asynchrone qui retourne IAsyncEnumerable
it: L'attributo EnumeratorCancellationAttribute non avrà alcun effetto. L'attributo ha effetto solo su un parametro di tipo CancellationToken in un metodo di iteratore asincrono che restituisce IAsyncEnumerable
ja: EnumeratorCancellationAttribute は効果がありません。この属性は、IAsyncEnumerable を返す非同期反復子メソッドの CancellationToken 型のパラメーターに対してのみ効果があります
ko: EnumeratorCancellationAttribute는 영향을 주지 않습니다. 이 특성은 IAsyncEnumerable을 반환하는 비동기 반복기 메서드에 있는 CancellationToken 형식의 매개 변수에만 유효합니다.
pl: Atrybut EnumeratorCancellationAttribute nie będzie miał żadnego efektu. Atrybut jest uwzględniany tylko dla parametru typu CancellationToken w asynchronicznej metodzie iteratora zwracającej interfejs IAsyncEnumerable.
pt_br: O EnumeratorCancellationAttribute não terá efeito. O atributo é eficaz somente em um parâmetro do tipo CancellationToken em um método iterador assíncrono que retorna IAsyncEnumerable
ru: Атрибут EnumeratorCancellationAttribute не будет оказывать никакого влияния. Этот атрибут действует только для параметра типа CancellationToken в методе асинхронного итератора, возвращающем IAsyncEnumerable.
tr: EnumeratorCancellationAttribute hiçbir etkiye sahip olmayacak. Öznitelik yalnızca, IAsyncEnumerable döndüren bir async-iterator yönteminde bulunan CancellationToken türündeki bir parametre üzerinde etkilidir
zh_hans: EnumeratorCancellationAttribute 将不起任何作用。该属性仅在返回 IAsyncEnumerable 的异步迭代器方法中 CancellationToken 类型的参数上有效
zh_hant: EnumeratorCancellationAttribute 不會有任何作用。屬性只有在會傳回 IAsyncEnumerable 的非同步迭代器方法中，在類型 CancellationToken 的參數上才有效

# WRN_UndecoratedCancellationTokenParameter
source: Async-iterator '{0}' has one or more parameters of type 'CancellationToken' but none of them is decorated with the 'EnumeratorCancellation' attribute, so the cancellation token parameter from the generated 'IAsyncEnumerable<>.GetAsyncEnumerator' will be unconsumed
cs: Asynchronní iterátor {0} má jeden nebo více parametrů typu CancellationToken, ale žádný z nich není dekorovaný atributem EnumeratorCancellation, takže parametr tokenu zrušení z vygenerovaného výrazu IAsyncEnumerable<>.GetAsyncEnumerator se nespotřebuje.
de: Der Async-Iterator "{0}" weist mindestens einen Parameter vom Typ "CancellationToken" auf, aber keiner der Parameter umfasst das Attribut "EnumeratorCancellation", deshalb wird der Parameter für das Abbruchtoken aus dem generierten "IAsyncEnumerable<>.GetAsyncEnumerator" nicht verwendet.
es: El iterador de asincronía "{0}" tiene uno o más parámetros de tipo "CancellationToken", pero en ninguno se incluye el atributo "EnumeratorCancellation", por lo que el parámetro de token de cancelación del objeto "IAsyncEnumerable<>.GetAsyncEnumerator" generado no se consumirá
fr: L'itérateur asynchrone '{0}' a un ou plusieurs paramètres de type 'CancellationToken' mais aucun d'entre eux n'est décoré avec l'attribut 'EnumeratorCancellation'. Le paramètre de jeton d'annulation du 'IAsyncEnumerable<>.GetAsyncEnumerator' généré n'est donc pas consommé
it: L'elemento '{0}' di iteratore asincrono include uno o più parametri di tipo 'CancellationToken', ma nessuno di essi è decorato con l'attributo 'EnumeratorCancellation', di conseguenza il parametro del token di annullamento restituito dall'elemento 'IAsyncEnumerable<>.GetAsyncEnumerator' generato non verrà utilizzato
ja: 非同期反復子 '{0}' には型 'CancellationToken' の 1 つ以上のパラメーターがありますが、'EnumeratorCancellation' 属性で修飾されているパラメーターはありません。そのため、生成された 'IAsyncEnumerable<>.GetAsyncEnumerator' からの取り消しトークン パラメーターは使用されません
ko: 비동기 반복기 '{0}'에 'CancellationToken' 형식의 매개 변수가 하나 이상 있지만, 이 중 'EnumeratorCancellation' 특성으로 데코레이트된 매개 변수가 없으므로 생성된 'IAsyncEnumerable<>.GetAsyncEnumerator'에서 취소 토큰 매개 변수가 사용되지 않습니다.
pl: Iterator asynchroniczny „{0}” ma co najmniej jeden parametr typu „CancellationToken”, ale żaden z nich nie ma atrybutu „EnumeratorCancellation” i dlatego zostanie wykorzystany parametr tokenu anulowania z wygenerowanego elementu „IAsyncEnumerable<>.GetAsyncEnumerator”
pt_br: O iterador assíncrono '{0}' tem um ou mais parâmetros do tipo 'CancellationToken', mas nenhum deles está decorado com o atributo 'EnumeratorCancellation', portanto, o parâmetro de token de cancelamento do 'IAsyncEnumerable<>.GetAsyncEnumerator' gerado não será consumido
ru: Асинхронный итератор "{0}" имеет один или несколько параметров типа "CancellationToken", но ни один из них не снабжен атрибутом "EnumeratorCancellation", поэтому параметр токена отмены из созданного "IAsyncEnumerable<>.GetAsyncEnumerator" не будет использован.
tr: Zaman uyumsuz '{0}' yineleyicisinde 'CancellationToken' türünde bir veya daha fazla parametre var ancak bunların hiçbiri 'EnumeratorCancellation' özniteliği ile dekore edilmemiş, bu nedenle oluşturulan 'IAsyncEnumerable<>.GetAsyncEnumerator' öğesindeki iptal belirteci parametresi tüketilmeyecek
zh_hans: 异步迭代器“{0}”具有一个或多个类型为 "CancellationToken" 的参数，但它们都未用 "EnumeratorCancellation" 属性修饰，因此将不使用所生成的 "IAsyncEnumerable<>.GetAsyncEnumerator" 中的取消令牌参数
zh_hant: 非同步迭代器 '{0}' 有一或多個類型 'CancellationToken' 的參數，但因為沒有任何參數有裝飾 'EnumeratorCancellation' 屬性，所以將不會取用來自已產生 'IAsyncEnumerable<>.GetAsyncEnumerator' 的取消權杖參數

# WRN_UndecoratedCancellationTokenParameter_Title
source: Async-iterator member has one or more parameters of type 'CancellationToken' but none of them is decorated with the 'EnumeratorCancellation' attribute, so the cancellation token parameter from the generated 'IAsyncEnumerable<>.GetAsyncEnumerator' will be unconsumed
cs: Člen asynchronního iterátoru má jeden nebo více parametrů typu CancellationToken, ale žádný z nich není dekorovaný atributem EnumeratorCancellation, takže parametr tokenu zrušení z vygenerovaného výrazu IAsyncEnumerable<>.GetAsyncEnumerator se nespotřebuje.
de: Der Async-Iterator-Member weist mindestens einen Parameter vom Typ "CancellationToken" auf, aber keiner der Parameter umfasst das Attribut "EnumeratorCancellation", deshalb wird der Parameter für das Abbruchtoken aus dem generierten "IAsyncEnumerable<>.GetAsyncEnumerator" nicht verwendet.
es: El miembro del iterador de asincronía tiene uno o más parámetros de tipo "CancellationToken", pero en ninguno se incluye el atributo "EnumeratorCancellation", por lo que el parámetro de token de cancelación del objeto "IAsyncEnumerable<>.GetAsyncEnumerator" generado no se consumirá
fr: Le membre d'itérateur asynchrone a un ou plusieurs paramètres de type 'CancellationToken' mais aucun d'entre eux n'est décoré avec l'attribut 'EnumeratorCancellation'. Le paramètre de jeton d'annulation du 'IAsyncEnumerable<>.GetAsyncEnumerator' généré n'est donc pas consommé
it: Il membro di iteratore asincrono include uno o più parametri di tipo 'CancellationToken', ma nessuno di essi è decorato con l'attributo 'EnumeratorCancellation', di conseguenza il parametro del token di annullamento restituito dall'elemento 'IAsyncEnumerable<>.GetAsyncEnumerator' generato non verrà utilizzato
ja: 非同期反復子メンバーには型 'CancellationToken' の 1 つ以上のパラメーターがありますが、'EnumeratorCancellation' 属性で修飾されているパラメーターはありません。そのため、生成された 'IAsyncEnumerable<>.GetAsyncEnumerator' からの取り消しトークン パラメーターは使用されません
ko: 비동기 반복기 멤버에 'CancellationToken' 형식의 매개 변수가 하나 이상 있지만, 이 중 'EnumeratorCancellation' 특성으로 데코레이트된 매개 변수가 없으므로 생성된 'IAsyncEnumerable<>.GetAsyncEnumerator'에서 취소 토큰 매개 변수가 사용되지 않음
pl: Składowa iteratora asynchronicznego ma co najmniej jeden parametr typu „CancellationToken”, ale żaden z nich nie ma atrybutu „EnumeratorCancellation” i dlatego zostanie wykorzystany parametr tokenu anulowania z wygenerowanego elementu „IAsyncEnumerable<>.GetAsyncEnumerator”
pt_br: O membro do iterador assíncrono tem um ou mais parâmetros do tipo 'CancellationToken', mas nenhum deles está decorado com o atributo 'EnumeratorCancellation', portanto, o parâmetro de token de cancelamento do 'IAsyncEnumerable<>.GetAsyncEnumerator' gerado não será consumido
ru: Элемент асинхронного итератора имеет один или несколько параметров типа "CancellationToken", но ни один из них не снабжен атрибутом "EnumeratorCancellation", поэтому параметр токена отмены из созданного "IAsyncEnumerable<>.GetAsyncEnumerator" не будет использован.
tr: Zaman uyumsuz yineleyici üyesinde 'CancellationToken' türünde bir veya daha fazla parametre var ancak bunların hiçbiri 'EnumeratorCancellation' özniteliği ile dekore edilmemiş, bu nedenle oluşturulan 'IAsyncEnumerable<>.GetAsyncEnumerator' öğesindeki iptal belirteci parametresi tüketilmeyecek
zh_hans: 异步迭代器成员具有一个或多个类型为 "CancellationToken" 的参数，但它们都未用 "EnumeratorCancellation" 属性修饰，因此将不使用所生成的 "IAsyncEnumerable<>.GetAsyncEnumerator" 中的取消令牌参数
zh_hant: 非同步迭代器成員有一或多個類型 'CancellationToken' 的參數，但因為沒有任何參數有裝飾 'EnumeratorCancellation' 屬性，所以將不會取用來自已產生 'IAsyncEnumerable<>.GetAsyncEnumerator' 的取消權杖參數

# WRN_UninitializedNonNullableBackingField
source: Non-nullable {0} '{1}' must contain a non-null value when exiting constructor. Consider adding the 'required' modifier, or declaring the {0} as nullable, or safely handling the case where 'field' is null in the 'get' accessor.
it: L'elemento {0} '{1}' che non ammette i valori Null deve contenere un valore non Null all'uscita dal costruttore. Prendere in considerazione l'aggiunta del modificatore 'required' o la dichiarazione come {0} che ammette i valori Null, oppure l'aggiunta di attributi '[field: MaybeNull, AllowNull]'.
pt_br: A {0} não anulável "{1}" precisa conter um valor não nulo ao sair do construtor. Considere adicionar o modificador "obrigatório" ou declarar o {0} como anulável ou tratar com segurança o caso em que "field" é nulo no acessador "get".
ru: {0} "{1}", не допускающий значения NULL, должен содержать значение, отличное от NULL, при выходе из конструктора. Рассмотрите возможность добавить модификатор "required", объявить {0} как допускающее значение NULL или добавить атрибуты "[field: MaybeNull, AllowNull]".
zh_hans: 在退出构造函数时，不可为 null 的 {0} ‘{1}’ 必须包含非 null 值。请考虑添加 ‘required’ 修饰符，或将 {0} 声明为可为 null，或添加 ‘[field: MaybeNull, AllowNull]’ 特性。

# WRN_UninitializedNonNullableBackingField_Title
source: Non-nullable property must contain a non-null value when exiting constructor. Consider adding the 'required' modifier, or declaring the property as nullable, or safely handling the case where 'field' is null in the 'get' accessor.
it: La proprietà che non ammette i valori Null deve contenere un valore non Null all'uscita dal costruttore. Provare ad aggiungere il modificatore 'required', a dichiarare la proprietà come che ammette i valori Null, oppure ad aggiungere gli attributi '[field: MaybeNull, AllowNull]'.
pt_br: A propriedade não anulável deve conter um valor não nulo ao sair do construtor. Considere adicionar o modificador "obrigatório" ou declarar a propriedade como anulável ou tratar com segurança o caso em que "field" é nulo no acessador "get".
ru: Свойство, не допускающее значения NULL, должно содержать значение, отличное от NULL, при выходе из конструктора. Рассмотрите возможность добавить модификатор "required", объявить свойство как допускающее значение NULL или добавить атрибуты "[field: MaybeNull, AllowNull]".
zh_hans: 退出构造函数时，不可为 null 的属性必须包含非 null 值。请考虑添加 ‘required’ 修饰符，或将属性声明为可为 null，或添加 ‘[field: MaybeNull, AllowNull]’ 特性。

# WRN_UninitializedNonNullableField
source: Non-nullable {0} '{1}' must contain a non-null value when exiting constructor. Consider adding the 'required' modifier or declaring the {0} as nullable.
fr: Le {0} « {1} » non-nullable doit contenir une valeur autre que Null lors de la fermeture du constructeur. Envisagez d’ajouter le modificateur « required » ou de déclarer le {0} comme pouvant accepter la valeur Null.
it: L'elemento {0} '{1}' non nullable deve contenere un valore non Null all'uscita dal costruttore. Prendere in considerazione l'aggiunta del modificatore 'required' o la dichiarazione di {0} come nullable.
pl: Niedopuszczający wartości null element {0} „{1}” musi zawierać wartość inną niż null podczas kończenia działania konstruktora. Rozważ dodanie modyfikatora „required” lub zadeklarowanie {0} jako dopuszczającego wartość null.
pt_br: O {0} não anulável '{1}' precisa conter um valor não nulo ao sair do construtor. Considere adicionar o modificador "obrigatório" ou declarar o {0} como anulável.
ru: {0} "{1}", не допускающий значения NULL, должен содержать значение, отличное от NULL, при выходе из конструктора. Рассмотрите возможность добавления модификатора "required" или объявления значения {0}, допускающего значение NULL.
zh_hans: 在退出构造函数时，不可为 null 的 {0} "{1}" 必须包含非 null 值。请考虑添加 "required" 修饰符或将该 {0} 声明为可为 null。
zh_hant: 退出建構函式時，不可為 Null 的 {0} '{1}' 必須包含非 Null 值。請考慮新增 'required' 修飾元，或將 {0} 宣告為可以為 Null。
