Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CLS_BadFieldPropType_Description
source: A public, protected, or protected internal variable must be of a type that is compliant with the Common Language Specification (CLS).
cs: Veřejná, chráněná nebo interně chráněná proměnná musí být typu, který je kompatibilní se specifikací CLS (Common Language Specification).
de: Eine öffentliche, geschützte oder eine interne, geschützte Variable muss ein Typ sein, dermit der Common Language Specification (CLS) kompatibel ist.
es: Una variable interna pública o protegida debe ser de un tipo conforme a Common Language Specification (CLS).
fr: Le type d'une variable publique, protégée ou protégée en interne doit être conforme CLS.
it: Una variabile public, protected o protected internal deve essere di tipo conforme a CLS (Common Language Specification).
ja: public、protected、または protected internal 変数は、 共通言語仕様 (CLS) に準拠した型である必要があります。
ko: public, protected 또는 protected internal 변수는 CLS(공용 언어 사양)를 따르는 형식이어야 합니다.
pl: Typ zmiennej publicznej, chronionej zmiennej lub chronionej zmiennej wewnętrznej musi być zgodny ze specyfikacją CLS (Common Language Specification).
pt_br: Uma variável pública, protegida ou protegida internamente deve ser de um tipo em conformidade com a Common Language Specification (CLS).
ru: Открытая, защищенная или защищенная внутренняя переменная должна иметь тип, совместимый с CLS.
tr: Genel, korumalı veya korumalı iç değişken Ortak Dil Belirtimi (CLS) ile uyumlu bir türe sahip olmalıdır.
zh_hans: public、protected 或 protected internal 变量必须属于符合公共语言规范(CLS)的类型。
zh_hant: 公用、保護或保護內部變數的類型必須符合 Common Language Specification (CLS) 規範。

# WRN_CLS_BadIdentifierCase
source: Identifier '{0}' differing only in case is not CLS-compliant
cs: Identifikátor {0} lišící se jenom použitím velkých a malých písmen není kompatibilní se specifikací CLS.
de: Der Bezeichner "{0}", der sich nur hinsichtlich der Groß- und Kleinschreibung unterscheidet, ist nicht CLS-kompatibel.
es: El identificador '{0}' que solo se diferencia por el uso de mayúsculas o minúsculas no es conforme a CLS
fr: L'identificateur '{0}', qui se différencie uniquement dans case, n'est pas conforme CLS
it: L'identificatore '{0}' che differisce solo per l'uso di caratteri maiuscoli o minuscoli non è conforme a CLS
ja: 大文字、小文字の違いのみの識別子 '{0}' は CLS に準拠していません
ko: 대/소문자만 다른 '{0}' 식별자가 CLS 규격이 아닙니다.
pl: Identyfikator „{0}” różniący się tylko wielkością liter nie jest zgodny ze specyfikacją CLS
pt_br: Identificador "{0}" diferindo somente se não tem conformidade com CLS
ru: Идентификатор "{0}", отличающийся только регистром, несовместим с CLS.
tr: Yalnızca büyük küçük harfte fark gösteren '{0}' tanımlayıcısı CLS uyumlu değil
zh_hans: 仅大小写不同的标识符“{0}”不符合 CLS
zh_hant: 只有大小寫不相同的識別項 '{0}'，不符合 CLS 規範

# WRN_CLS_BadIdentifierCase_Title
source: Identifier differing only in case is not CLS-compliant
cs: Identifikátor lišící se jenom použitím velkých a malých písmen není kompatibilní se specifikací CLS.
de: Bezeichner weist nur ab, wenn er nicht CLS-kompatibel ist
es: El identificador difiere solo en caso de que no sea conforme a CLS
fr: Un identificateur qui se différencie uniquement par la casse n'est pas conforme CLS
it: L'identificatore che differisce solo per l'uso di caratteri maiuscoli o minuscoli non è conforme a CLS
ja: 大文字、小文字の違いのみの識別子は CLS に準拠していません
ko: 대/소문자만 다른 식별자가 CLS 규격이 아닙니다.
pl: Identyfikator różniący się tylko wielkością liter nie jest zgodny ze specyfikacją CLS
pt_br: O identificador difere somente quando não tem conformidade com CLS
ru: Идентификатор, отличающийся только регистром, несовместим с CLS
tr: Yalnızca büyük-küçük harfi farklı olan tanımlayıcı CLS uyumlu değil
zh_hans: 仅大小写不同的标识符不符合 CLS
zh_hant: 只有大小寫不同的識別項，不符合 CLS 規範

# WRN_CLS_OverloadRefOut
source: Overloaded method '{0}' differing only in ref or out, or in array rank, is not CLS-compliant
cs: Přetěžovaná metoda {0} lišící se jen parametrem ref nebo out nebo rozměrem pole není kompatibilní se specifikací CLS.
de: Die überladene {0}-Methode, die sich nur nach "ref" , "out" oder dem Arrayrang unterscheidet, ist nicht CLS-kompatibel.
es: El método sobrecargado '{0}' que solo se diferencia en out o ref, o en el rango de matriz, no es conforme a CLS
fr: La méthode surchargée '{0}', qui se différencie uniquement au niveau de ref ou out ou du rang de tableau, n'est pas conforme CLS
it: Il metodo di overload '{0}' che differisce solo per out o ref o per numero di dimensioni della matrice non è conforme a CLS
ja: ref、out、または配列のランクのみが異なるオーバーロード メソッド '{0}' は、CLS に準拠していません
ko: ref, out 또는 배열 차수만 다른 오버로드된 '{0}' 메서드는 CLS 규격이 아닙니다.
pl: Przeciążona metoda „{0}” różniąca się tylko specyfikacją ref lub out parametru lub rangą tablicy nie jest zgodna ze specyfikacją CLS
pt_br: Metódo sobrecarregado "{0}" diferindo somente em ref ou out, ou em classificação de matriz não tem conformidade com CLS
ru: Перегруженный метод "{0}", отличающийся только параметром с ключевым словом ref или out, либо рангом массива, несовместимы с CLS.
tr: Yalnızca ref veya out öğelerinde ya da dizi derecesinde fark gösteren '{0}' aşırı yüklü yöntemi CLS uyumlu değil
zh_hans: 仅 ref 或 out 有区别，或者仅数组秩不同的重载方法“{0}”不符合 CLS
zh_hant: 只有 ref/out 或陣列陣序差異的多載方法 '{0}'，不符合 CLS 規範

# WRN_CLS_OverloadRefOut_Title
source: Overloaded method differing only in ref or out, or in array rank, is not CLS-compliant
cs: Přetěžovaná metoda lišící se jen parametrem ref nebo out nebo rozměrem pole není kompatibilní se specifikací CLS.
de: Die überladene Methode weicht nur hinsichtlich des Verweises oder der Ausgabe ab, oder des Arrayrangs, und ist nicht CLS-kompatibel
es: El método sobrecargado solo difiere en ref o out, o bien en el rango de matriz. No es conforme a CLS
fr: La méthode surchargée qui se différencie uniquement au niveau de ref ou out ou du rang de tableau n'est pas conforme CLS
it: Il metodo di overload, che differisce solo per out o ref o per numero di dimensioni della matrice, non è conforme a CLS
ja: ref、out、または配列のランクのみが異なるオーバーロード メソッドは、CLS に準拠していません
ko: ref, out 또는 배열 차수만 다른 오버로드된 메서드는 CLS 규격이 아닙니다.
pl: Przeciążona metoda różniąca się tylko parametrem ref lub out albo rangą tablicy nie jest zgodna ze specyfikacją CLS
pt_br: O método sobrecarregado diferindo somente em ref ou out, ou a classificação de matriz, não tem conformidade com CLS
ru: Перегруженный метод, отличающийся только в параметре ref или out или в ранге массива, несовместим с CLS
tr: Yalnızca ref veya out ya da dizi sırasında farklılık gösteren aşırı yüklü yöntem CLS uyumlu değil
zh_hans: 仅 ref 或 out 有区别，或者仅数组秩的重载方法不符合 CLS
zh_hant: 只有 ref/out 或陣列陣序差異的多載方法，不符合 CLS 規範

# WRN_CLS_OverloadUnnamed
source: Overloaded method '{0}' differing only by unnamed array types is not CLS-compliant
cs: Přetěžovaná metoda {0} lišící se jenom nepojmenovanými typy pole není kompatibilní se specifikací CLS.
de: Die überladene {0}-Methode, die sich nur durch unbenannte Arraytypen unterscheidet, ist nicht CLS-kompatibel.
es: El método sobrecargado '{0}' que solo se diferencia por tipos de matriz sin nombre no es conforme a CLS
fr: La méthode surchargée '{0}', qui se différencie uniquement par les types de tableau sans nom, n'est pas conforme CLS
it: Il metodo di overload '{0}' che differisce solo per i tipi matrice senza nome non è conforme a CLS
ja: 名前のない配列型のみが異なるオーバーロードされたメソッド '{0}' は、CLS に準拠していません
ko: 명명되지 않은 배열 형식만 다른 오버로드된 '{0}' 메서드는 CLS 규격이 아닙니다.
pl: Przeciążona metoda „{0}” różniąca się tylko nienazwanymi typami tablicy nie jest zgodna ze specyfikacją CLS
pt_br: Metódo sobrecarregado "{0}" diferindo somente por tipos de matriz não nomeados não tem conformidade com CLS
ru: Перегруженный метод "{0}", отличающий только типами массивов без имен, несовместим с CLS.
tr: Yalnızca adlandırılmamış dizi türlerinde fark gösteren '{0}' aşırı yüklü yöntemi CLS uyumlu değil
zh_hans: 仅未命名数组类型不同的重载方法“{0}”不符合 CLS
zh_hant: 只有未命名陣列類型有差異的多載方法 '{0}'，不符合 CLS 規範

# WRN_CLS_OverloadUnnamed_Title
source: Overloaded method differing only by unnamed array types is not CLS-compliant
cs: Přetěžovaná metoda lišící se jenom nepojmenovanými typy pole není kompatibilní se specifikací CLS.
de: Die überladene Methode unterscheidet sich nur darin, dass nicht benannte Arraytypen nicht CLS-kompatibel sind
es: El método sobrecargado que solo difiere por tipos de matriz sin nombre no es conforme a CLS
fr: La méthode surchargée, qui se différencie uniquement par les types de tableau sans nom, n'est pas conforme CLS
it: Il metodo di overload, che differisce solo per i tipi matrice senza nome, non è conforme a CLS
ja: 名前のない配列型のみが異なるオーバーロード メソッドは CLS に準拠していません
ko: 명명되지 않은 배열 형식만 다른 오버로드된 메서드는 CLS 규격이 아닙니다.
pl: Przeciążona metoda różniąca się tylko nienazwanymi typami tablicy nie jest zgodna ze specyfikacją CLS
pt_br: O método sobrecarregado diferindo somente pelos tipos de matriz sem nome não tem conformidade com CLS
ru: Перегруженный метод, отличающийся только типами неименованных массивов, несовместим с CLS
tr: Yalnızca adsız dizi türleri tarafından farklılık gösteren aşırı yüklü yöntem CLS uyumlu değil
zh_hans: 仅未命名数组类型不同的重载方法不符合 CLS
zh_hant: 只有未命名陣列類型有差異的多載方法，不符合 CLS 規範

# WRN_CLS_OverloadUnnamed_Description
source: This error occurs if you have an overloaded method that takes a jagged array and the only difference between the method signatures is the element type of the array. To avoid this error, consider using a rectangular array rather than a jagged array; use an additional parameter to disambiguate the function call; rename one or more of the overloaded methods; or, if CLS Compliance is not needed, remove the CLSCompliantAttribute attribute.
cs: Tato chyba se objeví, pokud máte přetěžovanou metodu, která přebírá vícenásobné pole, a jediný rozdíl mezi signaturami metody je typ elementu tohoto pole. Aby nedošlo k této chybě, zvažte použití pravoúhlého pole namísto vícenásobného, použijte další parametr, aby volání této funkce bylo jednoznačné, přejmenujte nejmíň jednu přetěžovanou metodu nebo (pokud kompatibilita s CLS není nutná) odeberte atribut CLSCompliantAttribute.
de: Dieser Fehler tritt auf, wenn Sie eine überladene Methode besitzen, die ein verzweigtes Array aufnimmt, liegt der einzige Unterschied zwischen den Methodensignaturen im Elementtyp des Arrays. Um diesen Fehler zu vermeiden, sollte ein rechteckiges Array in Betracht gezogen werden, statt eines verzweigten Arrays; verwenden Sie einen zusätzlichen Parameter, um den Funktionsaufruf eindeutig zu machen; benennen Sie eine oder mehrere der überladenen Methoden um; oder falls keine CLS-Kompatibilität erforderlich ist, entfernen Sie das CLSCompliantAttribute-Attribut.
es: Este error se produce cuando tiene un método sobrecargado que toma una matriz escalonada y cuando la única diferencia entre firmas del método es el tipo de elemento del rango. Para evitar este error, considere utilizar una matriz rectangular en vez de una matriz escalonada. Utilice un parámetro adicional para desambiguar la función de llamada. Cambie el nombre de uno o de varios métodos sobrecargados. Si no necesita la conformidad a CLS, elimine el atributo CLSCompliantAttribute.
fr: Cette erreur survient si vous avez une méthode surchargée qui prend un tableau en escalier et que la seule différence entre les signatures de méthode est le type d'élément du tableau. Pour éviter cette erreur, nous vous conseillons les méthodes suivantes : utilisez un tableau rectangulaire plutôt qu'un tableau en escalier, utilisez un paramètre supplémentaire pour supprimer l'ambiguïté de l'appel de fonction, renommez une ou plusieurs des méthodes surchargées ou, si la conformité CLS est facultative, supprimez l'attribut CLSCompliantAttribute.
it: Questo errore si verifica quando si usa un metodo di overload che accetta una matrice irregolare e le firme del metodo si differenziano solo per il tipo di elemento della matrice. Per evitare questo errore, provare a usare una matrice rettangolare invece di una irregolare, aggiungere un parametro in modo da evitare ambiguità nella chiamata della funzione oppure rinominare uno o più metodi di overload. In alternativa, se la compatibilità con CLS non è necessaria, rimuovere l'attributo CLSCompliantAttribute.
ja: このエラーは、ジャグ配列を受け取るオーバーロード メソッドがあり、かつメソッドのシグネチャの唯一の違いが配列の要素型である場合に発生します。このエラーを回避するには、ジャグ配列ではなく四角形配列の使用を検討するか、追加のパラメーターを使用して関数呼び出しを明確にするか、1 つ以上のオーバーロードされたメソッドの名前を変更するか、または、CLS 準拠が不要の場合は CLSCompliantAttribute 属性を削除します。
ko: 이 오류는 가변 배열을 사용하는 오버로드된 메서드가 있고 메서드 서명 간에 배열의 요소 형식만 다른 경우에 발생합니다. 이 오류를 방지하려면 가변 배열 대신 직사각형 배열을 사용하고, 추가 매개 변수를 사용하여 함수 호출을 명확하게 구분하고, 하나 이상의 오버로드된 메서드 이름을 바꾸세요. 또는 CLS 규격이 필요하지 않은 경우 CLSCompliantAttribute 특성을 제거하세요.
pl: Ten błąd występuje, gdy przeciążona metoda korzysta z tablicy nieregularnej i jedyną różnicą między sygnaturami metod jest typ elementu tablicy. Aby uniknąć tego błędu, rozważ użycie tablicy regularnej zamiast tablicy nieregularnej, użyj dodatkowego parametru w celu odróżnienia wywołania funkcji, zmień nazwy przeciążonych metod lub usuń atrybut CLSCompliantAttribute, jeśli zgodność ze specyfikacją CLS nie jest wymagana.
pt_br: Este erro ocorre se você tiver um método sobrecarregado que usa uma matriz denteada e a única diferença entre as assinaturas do método é o tipo de elemento da matriz. Para evitar esse erro, considere usar uma matriz retangular em vez de uma matriz denteada, usar um parâmetro adicional para desambiguar a chamada de função, renomear um ou mais dos métodos sobrecarregados ou, se não for necessária conformidade com CLS, remova o atributo CLSCompliantAttribute.
ru: Эта ошибка происходит, если перегруженный метод получает массив массивов, и единственное отличие между подписями методов — тип элементов массива. Чтобы избежать этой ошибки, рассмотрите возможность использования прямоугольного массива вместо массива массивов; используйте дополнительный параметр, чтобы разрешить неоднозначность вызова функции, переименуйте один или несколько перегруженных методов или, если совместимость с CLS не требуется, удалите атрибут CLSCompliantAttribute.
tr: Bu hata, basit bir dizi alan aşırı yüklü bir yönteminiz varsa ve yöntem imzaları arasındaki tek fark dizinin öğe türü ise oluşur. Bu hatadan kaçınmak için, basit dizi yerine dikdörtgen dizi kullanmayı deneyin; işlev çağrısını netleştirmek için ek bir parametre kullanın; aşırı yüklü yöntemlerden birini veya birden fazlasını yeniden adlandırın ya da CLS Uyumluluğu gerekmiyorsa, CLSCompliantAttribute özniteliğini kaldırın.
zh_hans: 如果具有采用交错数组的重载方法并且方法签名之间的唯一差异是该数组的元素类型时，则会发生此错误。要避免此错误，请考虑使用矩形数组而不是交错数组；使用附加参数区分函数调用；重命名一个或多个重载方法；或是，如果无需符合 CLS，请移除 CLSCompliantAttribute 特性。
zh_hant: 如果您的多載方法採用不規則陣列，而且方法簽章之間的唯一差異是陣列的項目類型，則會發生此錯誤。若要避免此錯誤，請考慮使用矩形陣列，而非不規則陣列; 請使用其他參數來釐清函式呼叫; 請重新命名一個或多個多載方法; 或者，如果不需要符合 CLS 規範，請移除 CLSCompliantAttribute 屬性。

# WRN_CLS_BadIdentifier
source: Identifier '{0}' is not CLS-compliant
cs: Identifikátor {0} není kompatibilní se specifikací CLS.
de: Der Bezeichner "{0}" ist nicht CLS-kompatibel.
es: El identificador '{0}' no es conforme a CLS
fr: L'identificateur '{0}' n'est pas conforme CLS
it: L'identificatore '{0}' non è conforme a CLS
ja: 識別子 '{0}' は CLS に準拠していません
ko: {0}' 식별자가 CLS 규격이 아닙니다.
pl: Identyfikator „{0}” nie jest zgodny ze specyfikacją CLS
pt_br: Identificador "{0}" não tem conformidade com CLS
ru: Идентификатор "{0}" несовместим с CLS.
tr: {0}' tanımlayıcısı CLS uyumlu değil
zh_hans: 标识符“{0}”不符合 CLS
zh_hant: 識別項 '{0}' 不符合 CLS 規範

# WRN_CLS_BadIdentifier_Title
source: Identifier is not CLS-compliant
cs: Identifikátor není kompatibilní se specifikací CLS.
de: Bezeichner ist nicht CLS-kompatibel
es: El identificador no es conforme a CLS
fr: L'identificateur n'est pas conforme CLS
it: L'identificatore non è conforme a CLS
ja: 識別子が CLS に準拠していません
ko: 식별자가 CLS 규격이 아닙니다.
pl: Identyfikator nie jest zgodny ze specyfikacją CLS
pt_br: Identificador não tem conformidade com CLS
ru: Идентификатор несовместим с CLS
tr: Tanımlayıcı CLS uyumlu değil
zh_hans: 标识符不符合 CLS
zh_hant: 識別項不符合 CLS 規範

# WRN_CLS_BadBase
source: '{0}': base type '{1}' is not CLS-compliant
cs: {0}: Základní typ {1} není kompatibilní se specifikací CLS.
de: '"{0}": Basistyp "{1}" ist nicht CLS-kompatibel.
es: '{0}': el tipo base '{1}' no es conforme a CLS
fr: '{0}' : le type de base '{1}' n'est pas conforme CLS
it: '{0}': il tipo di base '{1}' non è conforme a CLS
ja: '{0}': 基本型 '{1}' は CLS に準拠していません
ko: '{0}': '{1}' 기본 형식이 CLS 규격이 아닙니다.
pl: „{0}”: typ podstawowy „{1}” nie jest zgodny ze specyfikacją CLS
pt_br: "{0}": tipo base "{1}" não tem conformidade com CLS
ru: "{0}": базовый тип "{1}" несовместим с CLS.
tr: '{0}': '{1}' temel türü CLS uyumlu değil
zh_hans: “{0}”: 基类型“{1}”不符合 CLS
zh_hant: '{0}': 基底類型 '{1}' 不符合 CLS 規範

# WRN_CLS_BadBase_Title
source: Base type is not CLS-compliant
cs: Základní typ není kompatibilní se specifikací CLS.
de: Basistyp ist nicht CLS-kompatibel
es: El tipo de base no es conforme a CLS
fr: Le type de base n'est pas conforme CLS
it: Il tipo di base non è conforme a CLS
ja: 基本型は CLS に準拠していません
ko: 기본 형식이 CLS 규격이 아닙니다.
pl: Typ podstawowy nie jest zgodny ze specyfikacją CLS
pt_br: Tipo base não tem conformidade com CLS
ru: Базовый тип несовместим с CLS
tr: Temel tür CLS uyumlu değil
zh_hans: 基类型不符合 CLS
zh_hant: 基底類型不符合 CLS 規範

# WRN_CLS_BadBase_Description
source: A base type was marked as not having to be compliant with the Common Language Specification (CLS) in an assembly that was marked as being CLS compliant. Either remove the attribute that specifies the assembly is CLS compliant or remove the attribute that indicates the type is not CLS compliant.
cs: Základní typ byl označený tak, že nemusí být kompatibilní se specifikací CLS (Common Language Specification) v sestavení, které bylo označené jako kompatibilní s CLS. Buď odeberte atribut, který sestavení určuje jako kompatibilní s CLS, nebo odeberte atribut, který označuje typ jako nekompatibilní s CLS.
de: Ein Basistyp wurde so gekennzeichnet, dass er nicht mit der Common Language Specification (CLS) in einer Assembly kompatibel sein muss, die als CLS.kompatibel markiert wurde. Entfernen Sie entweder das Attribut, das angibt, dass die Assembly CLS-kompatibel ist oder entfernen Sie das Attribut, das angibt, dass der Typ nicht CLS-kompatibel ist.
es: Se ha marcado al tipo de base para que no tenga que ser conforme a Common Language Specification (CLS) en un ensamblador que se ha marcado como conforme a CLS. Elimine el atributo que especifica que el ensamblador es conforme a CLS o elimine el atributo que indica que el tipo no es conforme a CLS.
fr: Un type de base est marqué comme n'ayant pas besoin d'être conforme CLS dans un assembly marqué comme devant être conforme CLS. Veuillez supprimer l'attribut indiquant que l'assembly est conforme CLS ou supprimer l'attribut indiquant que le type n'est pas conforme CLS.
it: In un assembly contrassegnato come conforme a CLS (Common Language Specification) è stato specificato un tipo di base non conforme a CLS. Rimuovere l'attributo che contrassegna l'assembly come conforme a CLS oppure l'attributo che indica il tipo come non conforme a CLS.
ja: 基本型は、共通言語仕様 (CLS) 準拠であるとしたアセンブリで CLS への準拠が不要であると設定されました。アセンブリが CLS 準拠であると指定する属性を削除するか、型が CLS 準拠ではないことを示す属性を削除してください。
ko: 기본 형식은 CLS(공용 언어 사양) 규격으로 표시된 어셈블리에서 CLS를 따를 필요가 없는 것으로 표시되었습니다. 어셈블리가 CLS 규격인 것으로 지정하는 특성을 제거하거나 형식이 CLS 규격이 아님을 나타내는 특성을 제거하세요.
pl: Typ podstawowy został oznaczony jako element, który nie musi być zgodny ze specyfikacją CLS (Common Language Specification), w zestawie oznaczonym jako zgodny ze specyfikacją CLS. Usuń atrybut określający, że zestaw jest zgodny ze specyfikacją CLS, lub usuń atrybut określający, że typ nie jest zgodny ze specyfikacją CLS.
pt_br: Um tipo base foi marcado como sem necessidade de estar em conformidade com a Common Language Specification (CLS) em um assembly que foi marcado como em conformidade com CLS. Remova o atributo que especifica que o assembly está em conformidade com CLS ou aquele que indica que o tipo não tem conformidade com CLS.
ru: Базовый тип помечен как несовместимый с CLS в сборке, помеченной как совместимая с CLS. Удалите атрибут, указывающий совместимость сборки с CLS, или удалите атрибут, указывающий несовместимость типа с CLS.
tr: Bir temel tür, CLS uyumlu olarak işaretlenmiş bir derlemede Ortak Dil Belirtimi (CLS) ile uyumlu olmak zorunda değil şeklinde işaretlendi. Derlemenin CLS uyumlu olduğunu belirten özniteliği ya da türün CLS uyumlu olmadığını gösteren özniteliği kaldırın.
zh_hans: 基类型在标记为符合公共语言规范(CLS)的程序集中标记为不必符合 CLS。移除指定程序集符合 CLS 的特性或移除指示类型不符合 CLS 的特性。
zh_hant: 在標記為符合 CLS 規範的組件中，基底類型標記為不需要符合 Common Language Specification (CLS) 規範。移除指定組件符合 CLS 規範的屬性，或移除指出類型不符合 CLS 規範的屬性。

# WRN_CLS_BadInterfaceMember
source: '{0}': CLS-compliant interfaces must have only CLS-compliant members
cs: {0}: Rozhraní kompatibilní se specifikací CLS musí obsahovat jenom členy kompatibilní se specifikací CLS.
de: '"{0}": CLS-kompatible Schnittstellen dürfen nur CLS-kompatible Member aufweisen.
es: '{0}': las interfaces conformes a CLS solo pueden tener miembros conformes a CLS
fr: '{0}' : les interfaces conformes CLS doivent avoir uniquement des membres conformes CLS
it: '{0}': le interfacce compatibili con CLS devono avere solo membri conformi a CLS
ja: '{0}': CLS 準拠のインターフェイスは CLS 準拠メンバーのみを含まなければなりません
ko: '{0}': CLS 규격 인터페이스는 CLS 규격 멤버만 포함할 수 있습니다.
pl: „{0}”: interfejsy zgodne ze specyfikacją CLS muszą mieć tylko składowe zgodne ze specyfikacją CLS
pt_br: "{0}": Interfaces em conformidade com CLS devem ter somente membros em conformidade com CLS
ru: "{0}": совместимые с CLS интерфейсы должны иметь только совместимые с CLS члены.
tr: '{0}': CLS uyumlu arabirimlerin yalnızca CLS uyumlu üyeleri olmalıdır
zh_hans: “{0}”: 符合 CLS 的接口必须仅有符合 CLS 的成员
zh_hant: '{0}': 符合 CLS 規範的介面內，所有成員都必須符合 CLS 規範

# WRN_CLS_BadInterfaceMember_Title
source: CLS-compliant interfaces must have only CLS-compliant members
cs: Rozhraní kompatibilní se specifikací CLS musí obsahovat jenom členy kompatibilní se specifikací CLS.
de: CLS-kompatible Schnittstellen dürfen nur CLS-kompatible Elemente besitzen
es: Las interfaces conformes a CLS solo pueden contener miembros conformes a CLS
fr: Les interfaces conformes CLS doivent uniquement avoir des membres conformes CLS
it: Le interfacce compatibili con CLS devono contenere solo membri conformi a CLS
ja: CLS 準拠のインターフェイスは CLS 準拠のメンバーのみを持つ必要があります
ko: CLS 규격 인터페이스는 CLS 규격 멤버만 포함할 수 있습니다.
pl: Interfejsy zgodne ze specyfikacją CLS muszą mieć tylko składowe zgodne ze specyfikacją CLS
pt_br: Interfaces em conformidade com CLS devem ter somente membros em conformidade com CLS
ru: Интерфейсы, совместимые с CLS, должны включать только совместимые с CLS члены
tr: CLS uyumlu arabirimler yalnızca CLS uyumlu üyelere sahip olmalı
zh_hans: 符合 CLS 的接口必须仅有符合 CLS 的成员
zh_hant: 符合 CLS 規範的介面內，所有成員都必須符合 CLS 規範

# WRN_CLS_NoAbstractMembers
source: '{0}': only CLS-compliant members can be abstract
cs: {0}: Jenom členy kompatibilní se specifikací CLS můžou být abstraktní.
de: '"{0}": Nur CLS-kompatible Member können abstrakt sein.
es: '{0}': solo los miembros conformes a CLS pueden ser abstractos
fr: '{0}' : seuls les membres conformes CLS peuvent être abstract
it: '{0}': solo i membri conformi a CLS possono essere di tipo abstract
ja: '{0}': 抽象化できるのは CLS 準拠メンバーのみです
ko: '{0}': CLS 규격 멤버만 abstract일 수 있습니다.
pl: „{0}”: tylko składowe zgodne ze specyfikacją CLS mogą być abstrakcyjne
pt_br: "{0}": somente membros em conformidade com CLS podem ser abstratos
ru: "{0}": только совместимые с CLS члены могут быть абстрактными.
tr: '{0}': yalnızca CLS uyumlu üyeler soyut olabilir
zh_hans: “{0}”: 只有符合 CLS 的成员才能是抽象的
zh_hant: '{0}': 只有符合 CLS 規範的成員，才可為抽象
