Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_MostSpecificImplementationIsNotFound
source: Interface member '{0}' does not have a most specific implementation. Neither '{1}', nor '{2}' are most specific.
cs: Člen rozhraní {0} nemá nejvíce specifickou implementaci. {1} ani {2} nejsou nejvíce specifické.
de: Der Schnittstellenmember "{0}" weist keine spezifischste Implementierung auf. Weder "{1}" noch "{2}" sind am spezifischsten.
es: El miembro de interfaz "{0}" no tiene una implementación más específica. Ni "{1}" ni "{2}" son los más específicos.
fr: Le membre d'interface '{0}' n'a pas l'implémentation la plus spécifique. '{1}' et '{2}' ne sont pas les plus spécifiques.
it: Il membro di interfaccia '{0}' non contiene un'implementazione più specifica. Né '{1}' né '{2}' sono più specifiche.
ja: インターフェイス メンバー '{0}' には最も固有な実装がありません。'{1}' と '{2}' のどちらも最も固有なものではありません。
ko: 인터페이스 멤버 '{0}'에 가장 한정적인 구현이 없습니다. '{1}', '{2}' 모두 가장 한정적이지 않습니다.
pl: Składowa interfejsu „{0}” nie ma najbardziej specyficznej implementacji. Ani implementacja „{1}”, ani „{2}” nie jest najbardziej specyficzna.
pt_br: O membro de interface '{0}' não tem uma implementação mais específica. Nem '{1}' nem '{2}' são mais específicos.
ru: Член интерфейса "{0}" не имеет наиболее конкретной реализации. Ни "{1}", ни "{2}" не являются наиболее конкретными.
tr: '{0}' arabirim üyesinin en belirgin bir uygulaması yok. Ne '{1} ', ne de '{2}' en belirgin değil.
zh_hans: 接口成员 "{0}" 没有最具体的实现。"{1}" 和 "{2}" 都不是最具体的。
zh_hant: 介面成員 '{0}' 沒有最具體的實作。'{1}' 和 '{2}' 都不是最具體的。

# ERR_CannotMatchOnINumberBase
source: Cannot use a numeric constant or relational pattern on '{0}' because it inherits from or extends 'INumberBase<T>'. Consider using a type pattern to narrow to a specifc numeric type.
cs: Nelze použít číselnou konstantu ani relační vzor pro „{0}“, protože dědí z nebo rozšiřuje INumberBase<T>. Zvažte použití vzoru typu k zúžení na konkrétní číselný typ.
ja: 'INumberBase<T>' を継承または拡張しているため、'{0}' で数値定数またはリレーショナル パターンを使用することはできません。指定された数値型に絞り込むために、型パターンを使用することを検討してください。
pl: Nie można użyć stałej liczbowej lub wzorca relacyjnego w „{0}”, ponieważ dziedziczy on lub rozszerza element "INumberBase<T>". Rozważ użycie wzorca typu w celu zawężenia do określonego typu liczbowego.
zh_hant: 無法在 '{0}' 上使用數值常數或關聯式模式，因為它繼承自或延伸 'INumberBase<T>'。請考慮使用類型模式來縮小為特定數數值型別。

# ERR_CollectionBuilderAttributeMethodNotFound
source: Could not find an accessible '{0}' method with the expected signature: a static method with a single parameter of type 'ReadOnlySpan<{1}>' and return type '{2}'.
it: Non è stato possibile trovare un metodo accessibile '{0}' con la firma prevista: un metodo statico con un singolo parametro di tipo 'ReadOnlySpan<{1}>' e di tipo restituito '{2}'.
ja: 必要なシグネチャを持つアクセス可能な '{0}' メソッドが見つかりませんでした:'ReadOnlySpan<{1}>' 型の単一パラメーターを持つ静的メソッドと戻り値の型 '{2}'。
pl: Nie można odnaleźć dostępnej metody „{0}” z oczekiwanym podpisem: metoda statyczna z pojedynczym parametrem typu „ReadOnlySpan<{1}>” i zwracanym typem „{2}”.
ru: Не удалось найти доступный метод "{0}" с ожидаемой подписью: статический метод с одним параметром типа "ReadOnlySpan<{1}>" и типом возвращаемого значения "{2}".
zh_hans: 找不到具有预期签名的可访问“{0}”方法: 具有类型为“ReadOnlySpan<{1}>”且返回类型为“{2}”的单个参数的静态方法。
zh_hant: 找不到具有預期簽章的可存取 '{0}' 方法：具有類型 'ReadOnlySpan<{1}>' 的單一參數，且傳回類型 '{2}' 的靜態方法。

# ERR_ExpressionTreeContainsUtf8StringLiterals
source: An expression tree may not contain UTF-8 string conversion or literal.
cs: Strom výrazů nesmí obsahovat převod řetězce UTF-8 nebo literál.
ja: 式ツリーに UTF-8 文字列変換またはリテラルを含めることはできません。
pl: Drzewo wyrażenia nie może zawierać konwersji ciągu UTF-8 ani literału.
zh_hant: 運算式樹狀結構不能包含 UTF-8 字串轉換或常值。

# ERR_FeatureNotAvailableInVersion8_0
source: Feature '{0}' is not available in C# 8.0. Please use language version {1} or greater.
cs: Funkce {0} není v C# 8.0 dostupná. Použijte prosím jazykovou verzi {1} nebo větší.
de: Das Feature "{0}" ist in C# 8.0 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 8.0. Use la versión {1} del lenguaje o una posterior.
ja: 機能 '{0}' は C# 8.0 では使用できません。言語バージョン {1} 以上を使用してください。
ko: '{0}' 기능은 C# 8.0에서 사용할 수 없습니다. 언어 버전 {1} 이상을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 8.0. Użyj języka w wersji {1} lub nowszej.
tr: '{0}' özelliği C# 8.0'da kullanılamaz. Lütfen {1} veya daha yüksek bir dil sürümü kullanın.
zh_hant: C# 8.0 中無法使用功能 '{0}'。請使用 {1} 或更新的語言版本。

# ERR_InterceptorPathNotInCompilationWithUnmappedCandidate
source: Cannot intercept: Path '{0}' is unmapped. Expected mapped path '{1}'.
ja: インターセプトできません。パス '{0}' がマップされていません。マップされたパス '{1}' が必要です。
pl: Nie można przechwycić: Ścieżka „{0}” jest niezmapowana. Oczekiwano zmapowanej ścieżki „{1}”.
zh_hant: 無法攔截:路徑 '{0}' 未對應。預期的對應路徑 '{1}'。

# ERR_NotInstanceInvalidInterpolatedStringHandlerArgumentName
source: '{0}' is not an instance method, the receiver cannot be an interpolated string handler argument.
cs: {0} není instanční metoda. Přijímač nemůže být argumentem obslužné rutiny interpolovaného řetězce.
ja: '{0}' はインスタンス メソッドではありません。レシーバーを、補間された文字列ハンドラー引数にすることはできません。
pl: "{0}" nie jest metodą wystąpienia, a odbiorca nie może być argumentem procedury obsługi ciągu interpolowanego.
zh_hant: '{0}' 不是執行個體方法，接收器不可為差補字串處理常式引數。

# ERR_ParameterNullCheckingNotSupported
source: The 'parameter null-checking' feature is not supported.
cs: Funkce parameter null-checking se nepodporuje.
ja: 'parameter null-checking' 機能はサポートされていません。
pl: Funkcja „sprawdzanie wartości null parametru” nie jest obsługiwana.
zh_hant: 不支援 'parameter null-checking' 功能。

# ERR_PartialPropertyTypeDifference
source: Both partial property declarations must have the same type.
pl: Obie deklaracje właściwości częściowych muszą mieć ten sam typ.
zh_hant: 兩個部分屬性宣告都必須有相同型別。

# ERR_RefAssignValEscapeWider
source: Cannot ref-assign '{1}' to '{0}' because '{1}' has a wider value escape scope than '{0}' allowing assignment through '{0}' of values with narrower escapes scopes than '{1}'.
cs: Tento odkaz přiřazuje {1} k {0}, protože {1} má širší obor řídicích hodnot než {0}, který povoluje přiřazení prostřednictvím {0} hodnot s užšími řídicími obory než {1}.
ja: '{1}' を '{0}' に参照割り当てできません。'{1}' には '{0}' よりも広い値エスケープ スコープがあり、'{0}' を使用して '{1}' より狭いエスケープ スコープを持つ値の割り当てが許可されています。
pl: Nie można przypisać wartości ref „{1}” do „{0}”, ponieważ „{1}” ma szerszy zakres ucieczki wartości niż „{0}”, umożliwiając przypisanie za pośrednictwem „{0}” wartości z węższymi zakresami ucieczki niż „{1}”.
zh_hant: 無法參考指派 '{1}' 給 '{0}'，因為 '{1}' 具有比 '{0}' 更寬的值逸出範圍，允許透過 '{0}' 的值指派，其逸出範圍比 '{1}' 更窄。

# ERR_SimpleProgramDisallowsMainType
source: Cannot specify /main if there is a compilation unit with top-level statements.
cs: Pokud existuje jednotka kompilace s příkazy nejvyšší úrovně, nedá se zadat /main.
ja: トップレベルのステートメントを含むコンパイル ユニットがある場合、/main を指定することはできません。
pl: Nie można określić opcji /main, jeśli istnieje jednostka kompilacji z instrukcjami najwyższego poziomu.
zh_hant: 如果有編譯單位包含最上層陳述式，就無法指定 /main。

# ERR_SingleElementPositionalPatternRequiresDisambiguation
source: A single-element deconstruct pattern requires some other syntax for disambiguation. It is recommended to add a discard designator '_' after the close paren ')'.
cs: Vzor deconstruct s jedním elementem vyžaduje určitou další syntaxi pro zajištění jednoznačnosti. Doporučuje se přidat označení discard „_“ za koncovou závorku „)“.
de: Ein aus einem Element bestehendes deconstruct-Muster erfordert zur Vermeidung einer Mehrdeutigkeit eine etwas andere Syntax. Es wird empfohlen, nach der schließenden Klammer ")" einen discard-Kennzeichner "_" hinzuzufügen.
es: Un patrón de deconstrucción de un solo elemento requiere más sintaxis para la desambiguación. Se recomienda agregar un designador de descarte "_" después del paréntesis de cierre ")".
ja: 単一要素の分解パターンには、あいまいさを排除するための他の構文が必要です。破棄指定子 '_' を閉じかっこ ')' の後に追加することをお勧めします。
ko: 단일 요소 분해 패턴은 명확성을 위해 다른 구문이 필요합니다. 닫는 괄호 ')' 뒤에 무시 항목 지정자 '_'을 추가하는 것이 좋습니다.
pl: Wzorzec dekonstrukcji z jednym elementem wymaga innej składni w celu ujednoznacznienia. Zaleca się dodanie desygnatora odrzucania „_” po nawiasie zamykającym „)”.
tr: Tek öğeli bir ayrıştırma deseni, kesinleştirme için başka bir söz dizimi gerektirir. ')' kapanış parantezinden sonra '_' atma belirleyicisinin eklenmesi önerilir.
zh_hant: 單一元素解構模式需要一些其他語法才能使其明確。建議在右括弧 ')' 後新增捨棄指示項 '_'。

# ERR_UnsupportedTypeForSlicePattern
source: Slice patterns may not be used for a value of type '{0}'.
cs: Vzory řezů se nedají používat pro hodnotu typu {0}.
ja: スライス パターンは、'{0}' 型の値に使用されない可能性があります。
pl: Wzorców wycinków nie można używać na potrzeby wartości typu „{0}”.
zh_hant: 類型 '{0}' 的值不可使用切片模式。

# IDS_FeatureLambdaAttributes
source: lambda attributes
cs: atributy lambda
fr: attributs lambda
it: attributi lambda
ja: ラムダ属性
pl: atrybuty lambda
ru: лямбда-атрибуты
zh_hans: Lambda 属性
zh_hant: Lambda 屬性

# IDS_OverloadResolutionPriority
source: overload resolution priority
pl: priorytet rozwiązywania przeciążenia

# INF_IdentifierConflictWithContextualKeyword_Title
source: Identifier is a contextual keyword, with a specific meaning, in a later language version.
pl: Identyfikator jest kontekstowym słowem kluczowym o określonym znaczeniu w późniejszej wersji językowej.
zh_hant: 識別碼是在較新語言版本中具有特定意義的內容相關關鍵字。

# WRN_AnalyzerReferencesNewerCompiler
source: The analyzer assembly '{0}' references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
cs: Sestavení analyzátoru {0} odkazuje na verzi {1} kompilátoru, která je novější než aktuálně spuštěná verze {2}.
ja: アナライザー アセンブリ '{0}' は、コンパイラのバージョン '{1}' を参照しています。これは、現在実行中のバージョン '{2}' よりも新しいバージョンです。
pl: Zestaw analizatora „{0}” odwołuje się do wersji „{1}” kompilatora, która jest nowsza niż obecnie uruchomiona wersja „{2}”.
zh_hant: 分析程式組件 '{0}' 參考編譯器的版本 '{1}' ，比目前執行的版本 '{2}' 還要新。

# WRN_AnalyzerReferencesNewerCompiler_Title
source: The analyzer assembly references a newer version of the compiler than the currently running version.
cs: Sestavení analyzátoru odkazuje na novější verzi kompilátoru, než je aktuálně spuštěná verze.
ja: アナライザー アセンブリが参照しるコンパイラのバージョンは、現在実行中のバージョンよりも新しいです。
pl: Zestaw analizatora odwołuje się do nowszej wersji kompilatora niż obecnie uruchomiona wersja.
zh_hant: 分析程式組件參考的編譯器版本比目前執行的版本新。

# WRN_AttrDependentTypeNotAllowed
source: Type '{0}' cannot be used in this context because it cannot be represented in metadata.
cs: Typ {0} nelze v tomto kontextu použít, protože se nedá reprezentovat v metadatech.
ja: 型 '{0}' は、メタデータで表現できないため、このコンテキストでは使用できません。
pl: Typ „{0}” nie może być używany w tym kontekście, ponieważ nie może być reprezentowany w metadanych.
zh_hant: 無法在此內容中使用類型 '{0}'，因為它無法在中繼資料中表示。

# WRN_AttrDependentTypeNotAllowed_Title
source: Type cannot be used in this context because it cannot be represented in metadata.
cs: Typ nelze v tomto kontextu použít, protože se nedá reprezentovat v metadatech.
ja: 型は、メタデータで表現できないため、このコンテキストで使用することはできません。
pl: Typ nie może być używany w tym kontekście, ponieważ nie może być reprezentowany w metadanych.
zh_hant: 無法在此內容中使用類型，因為它無法在中繼資料中表示。

# WRN_CallArgMixing
source: This combination of arguments to '{0}' may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: Tato kombinace argumentů parametru {0} může vystavit proměnné, na které odkazuje parametr {1}, mimo obor jejich deklarace
ja: '{0}' に対するこの引数の組み合わせは、パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Ta kombinacja argumentów „{0}” może uwidaczniać zmienne przywoływane przez parametr „{1}” poza zakresem deklaracji
zh_hant: 對 '{0}' 使用此引數組合，會在其宣告範圍外公開參數 '{1}' 所參考的變數

# WRN_CallArgMixing_Title
source: This combination of arguments may expose variables referenced by parameter outside of their declaration scope
cs: Tato kombinace argumentů parametru může vystavit proměnné, na které odkazuje parametr, mimo obor jejich deklarace
ja: この引数の組み合わせは、パラメーターによって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Ta kombinacja argumentów może uwidaczniać zmienne przywoływane przez parametr poza zakresem deklaracji
zh_hant: 此引數組合會在其宣告範圍外公開參數所參考的變數

# WRN_EscapeCall
source: Use of result of '{0}' in this context may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: Použití výsledku {0} v tomto kontextu může vystavit proměnné, na které odkazuje parametr {1}, mimo rozsah jejich oboru.
ja: このコンテキストで '{0}' の結果を使用すると、パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Użycie wyniku „{0}” w tym kontekście może uwidocznić zmienne przywoływane przez parametr „{1}” poza zakresem deklaracji
zh_hant: 在此內容中使用 '{0}' 的結果，可能會將參數 '{1}' 參考的變數公開在其宣告範圍外

# WRN_EscapeCall2
source: Use of member of result of '{0}' in this context may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: Použití člena výsledku {0} v tomto kontextu může vystavit proměnné, na které odkazuje parametr {1}, mimo rozsah jejich oboru.
ja: このコンテキストで '{0}' の結果のメンバーを使用すると、パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Nie można używać składowej wyniku elementu „{0}” w tym kontekście, ponieważ może uwidaczniać zmienne przywoływane przez parametr „{1}” poza ich zakresem deklaracji
zh_hant: 此內容中使用 '{0}' 的結果成員，可能會將參數 '{1}' 參考的變數公開在其宣告範圍外

# WRN_EscapeCall2_Title
source: Use of member of result in this context may expose variables referenced by parameter outside of their declaration scope
cs: Použití člena výsledku v tomto kontextu může vystavit proměnné, na které odkazuje parametr, mimo rozsah jejich oboru
ja: このコンテキストで結果のメンバーを使用すると、パラメーターによって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Nie można używać składowej wyniku elementu w tym kontekście, ponieważ może uwidaczniać zmienne przywoływane przez parametr poza ich zakresem deklaracji
zh_hant: 無法在此內容中使用結果的成員，因為它會將參數參考的變數公開在其宣告範圍外

# WRN_EscapeCall_Title
source: Use of result in this context may expose variables referenced by parameter outside of their declaration scope
cs: Použití výsledku v tomto kontextu může vystavit proměnné, na které odkazuje parametr, mimo rozsah jejich oboru
ja: このコンテキストで結果を使用すると、パラメーターによって参照される変数が宣言のスコープ外に公開される可能性があります
pl: Użycie wyniku w tym kontekście może uwidaczniać zmienne przywoływane przez parametr poza zakresem deklaracji
zh_hant: 在此內容中使用結果，可能會將參數參考的變數公開在其宣告範圍外

# WRN_PartialPropertySignatureDifference
source: Partial property declarations '{0}' and '{1}' have signature differences.
pl: Deklaracje właściwości częściowych „{0}” i „{1}” mają różnice w sygnaturach.
zh_hant: 部分屬性宣告 '{0}' 和 '{1}' 有簽章差異。

# WRN_PartialPropertySignatureDifference_Title
source: Partial property declarations have signature differences.
pl: Deklaracje właściwości częściowych różnią się sygnaturami.
zh_hant: 部分屬性宣告有簽章差異。

# WRN_RefAssignValEscapeWider
source: This ref-assigns '{1}' to '{0}' but '{1}' has a wider value escape scope than '{0}' allowing assignment through '{0}' of values with narrower escapes scopes than '{1}'.
cs: Tento odkaz přiřazuje {1} k {0}, ale {1} má širší obor řídicích hodnot než {0}, který povoluje přiřazení prostřednictvím {0} hodnot s užšími řídicími obory než {1}.
ja: この参照は '{1}' に '{0}' を割り当てますが、'{1}' の値のエスケープ スコープは、'{0}' よりも狭いエスケープ スコープを持つ値の'{0}' を介した割り当てを許可する '{1}' よりも広い値のエスケープ スコープを持っています。
pl: Ta wartość ref przypisuje „{1}” do „{0}”, ale „{1}” ma szerszy zakres ucieczki wartości niż „{0}”, umożliwiając przypisanie za pośrednictwem „{0}” wartości z węższymi zakresami ucieczki niż „{1}”.
zh_hant: 此參考指派 '{1}' 給 '{0}' 但 '{1}' 具有比 '{0}' 更寬的值逸出範圍，允許透過 '{0}' 的值指派，其逸出範圍比 '{1}' 更窄。
