Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_OpTFRetType
source: The return type of operator True or False must be bool
cs: Vrácená hodnota operátorů True a False musí být typu bool.
de: Der Rückgabetyp des True- oder False-Operators muss boolesch sein.
es: El tipo de valor devuelto del operador True o False debe ser bool
fr: Le type de retour de l'opérateur True ou False doit être bool
it: Il tipo restituito dell'operatore True o False deve essere booleano
ja: 演算子 true または false の戻り値の型はブール型でなければなりません
ko: True 또는 False 연산자의 반환 형식은 bool이어야 합니다.
pl: Typ zwracany operatora True lub False musi być typem logicznym
pt_br: O tipo de retorno do operador True ou False deve ser bool
ru: Тип возвращаемого значения операторов Истина и Ложь должен быть логическим.
tr: True veya False işlecinin dönüş türü bool olmalıdır
zh_hans: 运算符 True 或 False 的返回类型必须是 bool
zh_hant: 運算子 True 或 False 的傳回類型必須為 bool

# ERR_OperatorNeedsMatch
source: The operator '{0}' requires a matching operator '{1}' to also be defined
cs: Operátor {0} vyžaduje, aby byl definovaný i odpovídající operátor {1}.
de: Für den Operator "{0}" muss außerdem ein übereinstimmender Operator "{1}" definiert werden.
es: El operador '{0}' requiere que también se defina un operador coincidente '{1}'
fr: L'opérateur '{0}' exige qu'un opérateur correspondant '{1}' soit aussi défini
it: L'operatore '{0}' richiede che sia definito anche un operatore '{1}' corrispondente
ja: 演算子 '{0}' を定義するには、合致する演算子 '{1}' が必要です
ko: {0}' 연산자를 사용하려면 짝이 되는 '{1}' 연산자도 정의해야 합니다.
pl: Operator „{0}” wymaga zdefiniowanego zgodnego operatora „{1}”
pt_br: O operador "{0}" requer que um operador correspondente "{1}" também seja definido
ru: Для оператора "{0}" требуется, чтобы был определен соответствующий оператор "{1}".
tr: {0}' işleci '{1}' öğesinin de tanımlanmasını gerektirir
zh_hans: 运算符“{0}”要求也要定义匹配的运算符“{1}”
zh_hant: 運算子 '{0}' 需要也同時定義對稱的運算子 '{1}'

# ERR_BadBoolOp
source: In order to be applicable as a short circuit operator a user-defined logical operator ('{0}') must have the same return type and parameter types
cs: Pokud má být uživatelem definovaný logický operátor ({0}) použitelný jako operátor zkráceného vyhodnocení, musí vracet hodnotu stejného typu a mít stejné typy parametrů.
de: Um als Kurzschlussoperator anwendbar zu sein, müssen der Rückgabetyp und die Parametertypen eines benutzerdefinierten logischen Operators ("{0}") übereinstimmen.
es: Para que se pueda aplicar un operador de cortocircuito, el operador lógico definido por el usuario ('{0}') debe tener el mismo tipo de valor devuelto y los mismos tipos de parámetros
fr: Pour être applicable en tant qu'opérateur de court-circuit, un opérateur logique défini par l'utilisateur ('{0}') doit avoir le même type de retour et les mêmes types de paramètre
it: Per essere usato come operatore di corto circuito, un operatore logico definito dall'utente ('{0}') deve avere lo stesso tipo restituito e gli stessi tipi di parametro
ja: short circuit 演算子として適用するためには、ユーザー定義の論理演算子 ('{0}') が同じ戻り値の型とパラメーター型を持つ必要があります
ko: 사용자 정의 논리 연산자('{0}')를 단락(short circuit) 연산자로 사용하려면 동일한 반환 형식과 매개 변수 형식을 사용해야 합니다.
pl: Aby istniała możliwość zastosowania zdefiniowanego przez użytkownika operatora logicznego („{0}”) jako operatora „short circuit”, musi on mieć taki sam typ zwracany i typy parametrów
pt_br: Para ser aplicável como um operador de circuito pequeno, um operador lógico definido pelo usuário ("{0}") deve ter o mesmo tipo de retorno e tipos de parâmetro
ru: Для использования в качестве логического оператора краткой записи пользовательский логический оператор ("{0}") должен иметь такой же возвращаемый тип и типы параметров.
tr: Kısa devre işleci olarak uygulanabilmesi için, kullanıcı tanımlı bir mantıksal işleç ('{0}') aynı dönüş türü ve parametre türlerine sahip olmalıdır
zh_hans: 为了可以像短路运算符一样应用，用户定义的逻辑运算符(“{0}”)的返回类型和参数类型必须相同
zh_hant: 為了可以當成最少運算 (Short Circuit) 運算子使用，使用者定義的邏輯運算子 ('{0}') 必須具有相同的傳回類型與參數類型

# ERR_MustHaveOpTF
source: In order for '{0}' to be applicable as a short circuit operator, its declaring type '{1}' must define operator true and operator false
cs: Aby byl {0} použitelný jako operátor zkráceného vyhodnocení, musí jeho deklarující typ {1} definovat operátor true a operátor false.
de: Damit "{0}" als Kurzschlussoperator anwendbar ist, muss der deklarierende Typ "{1}" einen Operator "true" und einen Operator "false" definieren.
es: Para que '{0}' sea aplicable como operador de cortocircuito, su tipo declarativo '{1}' debe definir un operador true y otro false
fr: Pour que '{0}' soit applicable en tant qu'opérateur de court-circuit, son type déclarant '{1}' doit définir l'opérateur true et l'opérateur false
it: Per poter usare '{0}' come operatore di corto circuito, il tipo dichiarante '{1}' deve definire l'operatore True e l'operatore False
ja: '{0}' が short circuit 演算子として適用されるためには、宣言する型 '{1}' で true 演算子と false 演算子を定義する必要があります
ko: {0}'을(를) 단락(short circuit) 연산자로 사용하려면 선언 형식 '{1}'이(가) true 및 false 연산자를 정의해야 합니다.
pl: Aby element „{0}” można było zastosować jako operator „short circuit”, jego typ deklarujący „{1}” musi definiować operatory true i false
pt_br: Para que "{0}" seja aplicável como um operador de circuito pequeno, seu tipo declarativo "{1}" deve definir o operador verdadeiro e operador falso
ru: Чтобы применить "{0}" в качестве логического оператора краткой записи, его объявляющий тип "{1}" должен определять оператор True и оператор False.
tr: {0}' öğesinin kısa devre işleci olarak uygulanabilmesi için, '{1}' bildirim türünün işleç true ve işleç false değerlerini tanımlaması gerekir
zh_hans: 为了使“{0}”可以像短路运算符一样应用，其声明类型“{1}”必须定义运算符 true 和运算符 false
zh_hant: 為了讓 '{0}' 可以當成最少運算 (short circuit) 的運算子使用，其宣告類型 '{1}' 必須定義運算子 true 和運算子 false

# WRN_UnreferencedVarAssg
source: The variable '{0}' is assigned but its value is never used
cs: Proměnná {0} má přiřazenou hodnotu, ale nikdy se nepoužívá.
de: Die Variable "{0}" ist zugewiesen, ihr Wert wird aber nie verwendet.
es: La variable '{0}' está asignada pero su valor nunca se usa
fr: La variable '{0}' est assignée, mais sa valeur n'est jamais utilisée
it: La variabile '{0}' è assegnata, ma il suo valore non viene mai usato
ja: 変数 '{0}' は割り当てられていますが、その値は使用されていません
ko: {0}' 할당되었지만 사용되지 않았습니다.
pl: Zmienna „{0}” jest przypisana, lecz jej wartość nie jest nigdy używana
pt_br: A variável "{0}" é atribuída, mas seu valor nunca é usado
ru: Переменной "{0}" присвоено значение, но оно ни разу не использовано.
tr: {0}' değişkeni atanır ancak değeri hiçbir zaman kullanılmaz
zh_hans: 变量“{0}”已被赋值，但从未使用过它的值
zh_hant: 已指派變數 '{0}'，但是從未使用過它的值

# WRN_UnreferencedVarAssg_Title
source: Variable is assigned but its value is never used
cs: Proměnná má přiřazenou hodnotu, ale nikdy se nepoužívá.
de: Variable ist zugewiesen, der Wert wird jedoch niemals verwendet
es: La variable está asignada pero nunca se usa su valor
fr: La variable est assignée mais sa valeur n'est jamais utilisée
it: La variabile è assegnata, ma il suo valore non viene mai usato
ja: 変数は割り当てられていますが、その値は使用されていません
ko: 변수가 할당되었지만 해당 값이 사용되지 않았습니다.
pl: Zmienna jest przypisana, ale jej wartość nie jest nigdy używana
pt_br: A variável é atribuída, mas seu valor nunca é usado
ru: Переменная назначена, но ее значение не используется
tr: Değişken atandı ancak değeri hiç kullanılmadı
zh_hans: 变量已被赋值，但从未使用过它的值
zh_hant: 已指派變數，但從未使用過其值

# ERR_CheckedOverflow
source: The operation overflows at compile time in checked mode
cs: Během kompilace v režimu kontroly došlo k přetečení.
de: Vorgangsüberlauf während der Kompilierzeit im aktivierten Modus.
es: La operación se desborda en el momento de la compilación en modo checked
fr: L'opération engendre un dépassement de capacité au moment de la compilation dans le mode checked
it: Operazione in overflow in fase di compilazione in modalità checked
ja: この操作はチェック モードでコンパイルしたときにオーバーフローします
ko: checked 모드에서 컴파일하면 작업이 오버플로됩니다.
pl: Operacja przepełnia się w czasie kompilowania w trybie sprawdzonym
pt_br: A operação estoura o tempo de compilação no modo de ativação
ru: Переполнение при выполнении операции во время компиляции в режиме проверки.
tr: İşlem denetlenen modda derleme zamanında taşıyor
zh_hans: 在 checked 模式下，运算在编译时溢出
zh_hant: 檢查模式下，作業於編譯時期溢位

# ERR_ConstOutOfRangeChecked
source: Constant value '{0}' cannot be converted to a '{1}' (use 'unchecked' syntax to override)
cs: Konstantní hodnotu {0} nejde převést na typ {1} (k přepsání jde použít syntaxi unchecked).
de: Der Konstantenwert "{0}" kann nicht in "{1}" konvertiert werden (verwenden Sie zum Außerkraftsetzen die unchecked-Syntax).
es: El valor constante '{0}' no se puede convertir en '{1}' (use la sintaxis 'unchecked' para invalidar)
fr: Impossible de convertir la valeur de constante '{0}' en '{1}' (utilisez la syntaxe 'unchecked)
it: Il valore costante '{0}' non può essere convertito in '{1}'. Usare la sintassi 'unchecked' per eseguire l'override
ja: 定数値 '{0}' は '{1}' に変換できません (unchecked 構文を使ってオーバーライドしてください)
ko: {0}' 상수 값을 '{1}'(으)로 변환할 수 없습니다. 재정의하려면 'unchecked' 구문을 사용하세요.
pl: Nie można przekonwertować wartości stałej „{0}” na „{1}” (w celu przesłonięcia należy użyć składni instrukcji „unchecked”).
pt_br: O valor de constante "{0}" não pode ser convertido em "{1}" (use a sintaxe "unchecked" para substituir)
ru: Постоянное значение "{0}" не может быть преобразовано в "{1}" (для переопределения используйте синтаксис "unchecked").
tr: {0}' sabit değeri bir '{1}' değerine dönüştürülemez (geçersiz kılmak için 'unchecked' sözdizimini kullanın)
zh_hans: 常量值“{0}”无法转换为“{1}”(使用 "unchecked" 语法重写)
zh_hant: 常數值 '{0}' 不可轉換成 '{1}' (請使用 'unchecked' 語法覆寫)

# ERR_BadVarargs
source: A method with vararg cannot be generic, be in a generic type, or have a params parameter
cs: Metoda s parametrem vararg nemůže být obecná, být obecného typu nebo mít pole parametr params.
de: Eine Methode mit "vararg" kann nicht generisch sein, in einem generischen Typ vorliegen oder einen params-Parameter besitzen.
es: Un método con vararg no puede ser genérico, estar en un tipo genérico ni tener un parámetro params
fr: Une méthode avec vararg ne peut pas être générique, se trouver dans un type générique ou avoir un paramètre params
it: Un metodo con vararg non può essere generico, non può essere in un tipo generico né contenere una matrice di parametri
ja: vararg を使用するメソッドは、ジェネリックにしたり、ジェネリック型に含めたりできません。また、params パラメーターを持つこともできません
ko: vararg가 있는 메서드는 제네릭이거나 제네릭 형식일 수 없으며 params 매개 변수를 포함할 수 없습니다.
pl: Metoda z atrybutem vararg nie może być ogólna, znajdować się w typie ogólnym ani mieć parametru params
pt_br: Um método com vararg não pode ser genérico, estar em um tipo genérico ou ter um parâmetro params
ru: Метод с vararg не может быть универсальным, иметь универсальный тип или параметр params
tr: Vararg içeren bir yöntem genel olamaz, genel türde olamaz veya params parametresine sahip olamaz
zh_hans: 带有 vararg 的方法不能是泛型，不能属于泛型类型，也不能具有 params 参数
zh_hant: 具有 vararg 的方法不可為泛型、泛型類型或是具有 params 參數

# ERR_IllegalArglist
source: An __arglist expression may only appear inside of a call or new expression
cs: Výraz __arglist může být jedině uvnitř volání nebo výrazu new.
de: Ein __arglist-Ausdruck darf nur in einem call- oder new-Ausdruck enthalten sein.
es: La expresión __arglist solo puede aparecer dentro de una llamada o una expresión new
fr: Une expression __arglist ne peut apparaître qu'à l'intérieur d'un appel ou d'une expression new
it: Un'espressione __arglist può trovarsi solo all'interno di una chiamata o di un'espressione new
ja: __arglist 式は呼び出し、または new 式の中でのみ有効です
ko: __arglist 식은 call 또는 new 식 내부에만 있어야 합니다.
pl: Wyrażenie __arglist może się pojawić tylko wewnątrz wywołania lub nowego wyrażenia
pt_br: A expressão __arglist só pode aparecer dentro de uma expressão de chamada ou expressão new
ru: Выражение __arglist может появляться только в вызове или в выражении new.
tr: __arglist ifadesi yalnızca call veya new ifadesinde görünebilir
zh_hans: __arglist 表达式只能出现在调用或 new 表达式内部
zh_hant: __arglist 運算式只可出現於呼叫或 new 運算式中

# ERR_IllegalUnsafe
source: Unsafe code may only appear if compiling with /unsafe
cs: Nebezpečný kód může vzniknout jenom při kompilaci s přepínačem /unsafe.
de: Unsicherer Code wird nur angezeigt, wenn mit /unsafe kompiliert wird.
es: El código no seguro solo puede aparecer si se compila con /unsafe
fr: Du code unsafe ne peut apparaître qu'en cas de compilation avec /unsafe
it: Il codice di tipo unsafe è ammesso solo se si compila con /unsafe
ja: アンセーフ コードは /unsafe でコンパイルした場合のみ有効です
ko: 안전하지 않은 코드는 /unsafe를 사용하여 컴파일하는 경우에만 나타날 수 있습니다.
pl: Niebezpieczny kod może się pojawić tylko w przypadku kompilowania przy użyciu opcji /unsafe
pt_br: Um código sem segurança só pode aparecer se a compilação for com /unsafe
ru: Небезопасный код может использоваться только при компиляции с параметром /unsafe.
tr: Unsafe kod yalnızca /unsafe ile derleme yapılırsa görünebilir
zh_hans: 不安全代码只会在使用 /unsafe 编译的情况下出现
zh_hant: 只有在編譯時指定了 /unsafe，才會出現 unsafe 程式碼

# ERR_AmbigMember
source: Ambiguity between '{0}' and '{1}'
cs: Došlo k nejednoznačnosti mezi metodami nebo vlastnostmi {0} a {1}.
de: Mehrdeutigkeit zwischen "{0}" und "{1}"
es: Ambigüedad entre '{0}' y '{1}'
fr: Ambiguïté entre '{0}' et '{1}'
it: Ambiguità tra '{0}' e '{1}'
ja: '{0}' と '{1}' 間があいまいです
ko: {0}'과(와) '{1}' 사이에 모호성이 있습니다.
pl: Niejednoznaczność pomiędzy „{0}” i „{1}”
pt_br: Ambiguidade entre "{0}" e "{1}"
ru: Неоднозначность между "{0}" и "{1}"
tr: {0}' ve '{1}' arasında belirsizlik var
zh_hans: 在“{0}”和“{1}”之间具有二义性
zh_hant: '{0}' 與 '{1}' 之間模稜兩可

# ERR_BadForeachDecl
source: Type and identifier are both required in a foreach statement
cs: V příkazu foreach se vyžaduje typ i identifikátor.
de: Ein Typ und ein Bezeichner sind in einer foreach-Anweisung erforderlich.
es: En una instrucción foreach se requieren un tipo y un identificador
fr: Le type et l'identificateur sont tous deux requis dans une instruction foreach
it: In un'istruzione foreach sono necessari sia il tipo che l'identificatore
ja: foreach ステートメントには、型と識別子の両方が必要です
ko: foreach 문에는 형식과 식별자가 모두 필요합니다.
pl: W instrukcji foreach wymagany jest typ i identyfikator
pt_br: Um tipo e um identificador são necessários em uma instrução foreach
ru: В операторе foreach требуется указать и тип, и идентификатор.
tr: Bir foreach deyiminde hem tür hem tanımlayıcı gereklidir
zh_hans: 在 foreach 语句中，类型和标识符都是必需的
zh_hant: 在 foreach 陳述式中同時需要類型與識別項

# ERR_ParamsLast
source: A params parameter must be the last parameter in a parameter list
cs: Parametr params musí být posledním parametrem v seznamu parametrů
fr: Un paramètre params doit être le dernier paramètre dans une liste de paramètres
it: Un parametro params deve essere l'ultimo parametro in un elenco di parametri
ja: params パラメーターは、パラメーター リストの最後のパラメーターでなければなりません
pl: Parametr params musi być ostatnim parametrem na liście parametrów formalnych
pt_br: Um parâmetro params deve ser o último parâmetro em uma lista de parâmetros
ru: Параметр params должен быть последним в списке параметров.
zh_hans: params 参数必须是参数列表中的最后一个参数
zh_hant: params 參數必須是參數清單中的最後一個參數

# ERR_SizeofUnsafe
source: '{0}' does not have a predefined size, therefore sizeof can only be used in an unsafe context
cs: {0} nemá předdefinovanou velikost. Operátor sizeof jde proto použít jenom v nezabezpečeném kontextu.
de: "{0}" enthält keine vordefinierte Größe, sizeof kann daher nur in einem ungeschützten Kontext verwendet werden.
es: "{0}" no tiene un tamaño predefinido; por tanto, sizeof solo se puede usar en un contexto no seguro
fr: Dans la mesure où '{0}' n'a aucune taille prédéfinie, sizeof peut uniquement être utilisé dans un contexte non sécurisé
it: '{0}' non ha una dimensione predefinita, quindi sizeof può essere usato solo in un contesto di tipo unsafe
ja: '{0}' には定義済みのサイズが指定されていないため、sizeof は unsafe コンテキストでのみ使用できます
ko: '{0}'에 미리 정의된 크기가 없으므로 sizeof는 안전하지 않은 컨텍스트에서만 사용할 수 있습니다.
pl: Element „{0}” nie ma wstępnie zdefiniowanego rozmiaru, dlatego operatora sizeof można użyć tylko w kontekście słowa kluczowego unsafe
pt_br: '{0}' não tem um tamanho predefinido, portanto, sizeof só pode ser usado em um contexto desprotegido
ru: "{0}" не имеет предопределенный размер, поэтому оператор sizeof может использоваться только в небезопасном (unsafe) контексте
tr: '{0}' öğesi önceden tanımlı boyuta sahip değil, bu nedenle sizeof yalnızca güvenli olmayan bir bağlamda kullanılabilir
zh_hans: “{0}”没有预定义的大小，因此 sizeof 只能在不安全的上下文中使用
zh_hant: '{0}' 沒有預先定義的大小，因此 sizeof 只能用於 unsafe 內容

# ERR_DottedTypeNameNotFoundInNS
source: The type or namespace name '{0}' does not exist in the namespace '{1}' (are you missing an assembly reference?)
cs: Typ nebo název oboru názvů {0} neexistuje v oboru názvů {1}. (Nechybí odkaz na sestavení?)
de: Der Typ- oder Namespacename "{0}" ist im Namespace "{1}" nicht vorhanden. (Möglicherweise fehlt ein Assemblyverweis.)
es: El tipo o el nombre del espacio de nombres '{0}' no existe en el espacio de nombres '{1}' (¿falta alguna referencia de ensamblado?)
fr: Le nom de type ou d'espace de noms '{0}' n'existe pas dans l'espace de noms '{1}' (vous manque-t-il une référence d'assembly ?)
it: Il tipo o il nome dello spazio dei nomi '{0}' non esiste nello spazio dei nomi '{1}'. Probabilmente manca un riferimento all'assembly.
ja: 型または名前空間の名前 '{0}' が名前空間 '{1}' に存在しません (アセンブリ参照があることを確認してください)
ko: {1}' 네임스페이스에 '{0}' 형식 또는 네임스페이스 이름이 없습니다. 어셈블리 참조가 있는지 확인하세요.
pl: Typ lub przestrzeń nazw „{0}” nie występuje w przestrzeni nazw „{1}” (czy nie brakuje odwołania do zestawu?)
pt_br: O nome de tipo ou namespace "{0}" não existe no namespace "{1}" (você está sem uma referência de assembly?)
ru: Тип или имя пространства имен "{0}" не существует в пространстве имен "{1}" (возможно, отсутствует ссылка на сборку).
tr: {0}' tür veya ad alanı adı '{1}' ad alanında yok (bir derleme başvurunuz mu eksik?)
zh_hans: 命名空间“{1}”中不存在类型或命名空间名“{0}”(是否缺少程序集引用?)
zh_hant: 命名空間 '{1}' 中沒有類型或命名空間名稱 '{0}' (是否遺漏了組件參考?)

# ERR_FieldInitRefNonstatic
source: A field initializer cannot reference the non-static field, method, or property '{0}'
cs: Inicializátor pole nemůže odkazovat na nestatické pole, metodu nebo vlastnost {0}.
de: Ein Feldinitialisierer kann nicht auf das nicht statische Feld bzw. die nicht statische Methode oder Eigenschaft "{0}" verweisen.
es: Un inicializador de campo no puede hacer referencia al campo, método o propiedad no estáticos '{0}'
fr: Un initialiseur de champ ne peut pas faire référence au champ, à la méthode ou à la propriété non statique '{0}'
it: Un inizializzatore di campo non può fare riferimento alla proprietà, al metodo o al campo non statico '{0}'
ja: フィールド初期化子は、静的でないフィールド、メソッド、またはプロパティ '{0}' を参照できません
ko: 필드 이니셜라이저는 static이 아닌 필드, 메서드 또는 '{0}' 속성을 참조할 수 없습니다.
pl: Inicjator pola nie może odwoływać się do niestatycznego pola, metody lub właściwości „{0}”.
pt_br: Um inicializador de campo não pode referenciar o campo, o método ou a propriedade não estática "{0}"
ru: Инициализатор поля не может обращаться к нестатическому полю, методу или свойству "{0}".
tr: Alan başlatıcı '{0}' statik olmayan alanına, yöntemine veya özelliğine başvuramaz
zh_hans: 字段初始值设定项无法引用非静态字段、方法或属性“{0}”
zh_hant: 欄位初始設定式無法參考非靜態欄位、方法或屬性 '{0}'

# ERR_SealedNonOverride
source: '{0}' cannot be sealed because it is not an override
cs: {0} nejde zapečetit, protože to není přepis.
de: '"{0}" ist keine Überschreibung und kann daher nicht versiegelt werden.
es: '{0}' no puede estar sellado porque no es una invalidación
fr: '{0}' ne peut pas être sealed, car il ne s'agit pas d'une substitution
it: '{0}' non può essere sealed perché non è un override
ja: 'override ではないため、'{0}' をシールすることはできません
ko: '{0}'은(는) override가 아니므로 sealed가 될 수 없습니다.
pl: 'Elementu „{0}” nie można zapieczętować, ponieważ nie jest przesłonięciem
pt_br: "{0}" não pode ser sealed porque não é uma substituição
ru: "{0}" не может быть запечатанным, т. к. не содержит модификатора override.
tr: 'Bir geçersiz kılma olmadığından '{0}' korunamıyor
zh_hans: '因为“{0}”不是重写，所以无法将其密封
zh_hant: '因為 '{0}' 不是 override，所以無法密封

# ERR_CantOverrideSealed
source: '{0}': cannot override inherited member '{1}' because it is sealed
cs: {0}: Nejde přepsat zděděný člen {1}, protože je zapečetěný.
de: '"{0}": Der geerbte Member "{1}" kann nicht überschrieben werden, da er versiegelt ist.
es: '{0}': no se puede invalidar el miembro heredado '{1}' porque está sellado
fr: '{0}' : impossible de substituer le membre hérité '{1}', car il est sealed
it: '{0}': non è possibile eseguire l'override del membro ereditato '{1}' perché è sealed
ja: '{0}': 継承されたメンバー '{1}' はシールされているため、オーバーライドできません
ko: '{0}': 상속된 '{1}' 멤버는 봉인되어 있으므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić odziedziczonej składowej „{1}”, ponieważ jest ona zapieczętowana
pt_br: "{0}": não é possível substituir o membro herdado "{1}" porque ele é sealed
ru: "{0}": невозможно переопределить наследуемый член "{1}", так как он запечатан.
tr: '{0}': korumalı olduğundan '{1}' devralınmış üyesi geçersiz kılınamaz
zh_hans: “{0}”: 继承成员“{1}”是密封的，无法进行重写
zh_hant: '{0}': 無法覆寫繼承的成員 '{1}'，因為其已密封

# ERR_VoidError
source: The operation in question is undefined on void pointers
cs: Příslušná operace není definovaná pro ukazatele typu void.
de: Der Vorgang ist für void-Zeiger nicht definiert.
es: La operación en cuestión no está definida en punteros void
fr: L'opération en question n'est pas définie sur les pointeurs void
it: L'operazione è indefinita sui puntatori a void
ja: 問題の操作は void ポインターで定義されていません
ko: 요청한 작업이 void 포인터에 정의되어 있지 않습니다.
pl: Rozpatrywana operacja jest niezdefiniowana we wskaźnikach void
pt_br: A operação em questão não está definida nos ponteiros void
ru: При указателях на объекты неизвестного типа данная операция не определена.
tr: Söz konusu işlem void işaretçilerde tanımsızdır
zh_hans: 相关操作在 void 指针上未定义
zh_hant: 在 Void 指標上未定義有問題的作業

# ERR_ConditionalOnOverride
source: The Conditional attribute is not valid on '{0}' because it is an override method
cs: Atribut Conditional není pro {0} platný, protože je to metoda override.
de: Das Conditional-Attribut ist für "{0}" nicht gültig, da es eine Überschreibungsmethode ist.
es: El atributo Conditional no es válido en '{0}' porque es un método de reemplazo
fr: L'attribut Conditional n'est pas valide sur '{0}', car il s'agit d'une méthode override
it: L'attributo Conditional non è valido per '{0}' perché è un metodo di override
ja: 条件付き属性はオーバーライド メソッドであるため、 '{0}' では無効です
ko: {0}'은(는) 재정의 메서드이기 때문에 Conditional 특성이 유효하지 않습니다.
pl: Atrybut Conditional jest nieprawidłowy w elemencie „{0}”, ponieważ jest to metoda przesłonięcia
pt_br: O atributo Conditional não é válido em "{0}" porque é um método override
ru: Недопустимый атрибут Conditional для "{0}", так как он является методом переопределения.
tr: Conditional özniteliği, bir geçersiz kılma yöntemi olduğundan '{0}' üzerinde geçerli değil
zh_hans: Conditional 特性在“{0}”上无效，因为该特性是重写方法
zh_hant: Conditional 屬性在 '{0}' 上無效，因為其為覆寫方法

# ERR_PointerInAsOrIs
source: Neither 'is' nor 'as' is valid on pointer types
cs: Klíčová slova is a as nejsou platná pro ukazatele.
de: "is" und "as" sind keine gültigen Zeigertypen.
es: Ni 'is' ni 'as' son válidos como tipos de puntero
fr: is' et 'as' ne sont pas valides sur les types pointeur
it: is' o 'as' non valido per tipi puntatore
ja: is' と 'as' のどちらもポインター型では無効です
ko: 포인터 형식에는 'is' 또는 'as'를 사용할 수 없습니다.
pl: W typach wskaźnika nie można używać operatorów „is” ani „as”
pt_br: is' e 'as' não são válidos em tipos de ponteiro
ru: Ни "is", ни "as" недопустимы в типах указателей.
tr: is' ve 'as', işaretçi türlerinde geçerli değildir
zh_hans: "is" 和 "as" 在指针类型上都无效
zh_hant: is' 或 'as' 在指標類型上都無效
