Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ScopedMismatchInParameterOfTarget
source: The 'scoped' modifier of parameter '{0}' doesn't match target '{1}'.
cs: Modifikátor scoped parametru {0} neodpovídá cílovému objektu {1}.
fr: Le modificateur 'scoped' du paramètre '{0}' ne correspond pas au '{1}' cible.
it: Il modificatore 'scoped' del parametro '{0}' non corrisponde all'elemento '{1}' di destinazione.
ja: パラメーター '{0}' の 'scoped' 修飾子がターゲット '{1}'と一致しません。
pl: Modyfikator „scoped” 'parametru „{0}” nie jest zgodny z 'elementem docelowym „{1}”.
pt_br: O modificador 'scoped' do parâmetro '{0}' não corresponde ao parâmetro de '{1}'.
ru: Модификатор "scoped" параметра "{0}" не соответствует целевому "{1}".
zh_hans: 参数 "{0}" 的 "scoped" 修饰符与目标 "{1}" 不匹配。
zh_hant: 參數 '{0}' 的 'scoped' 修飾元不符合目標 '{1}'。

# ERR_ScopedRefAndRefStructOnly
source: The 'scoped' modifier can be used for refs and ref struct values only.
cs: Modifikátor scoped se dá použít jen pro hodnoty refs a ref struct.
fr: Le modificateur 'scoped' ne peut être utilisé que pour les valeurs refs et ref struct.
it: Il modificatore 'scoped' può essere usato solo per i riferimenti e i valori ref struct.
ja: 'scoped' 修飾子は refs および ref 構造体の値にのみ使用できます。
pl: Modyfikator „scoped" może być używany tylko w przypadku odwołań i wartości struktury referencyjnej.
pt_br: O modificador 'scoped' só pode ser usado para valores de struct refs e ref.
ru: Модификатор "scoped" можно использовать только для ref и для значений ref struct.
zh_hans: "scoped" 修饰符只能用于 refs 和 ref 结构值。
zh_hant: 'scoped' 修飾元只能用於 refs 和 ref 結構值。

# ERR_ScopedTypeNameDisallowed
source: Types and aliases cannot be named 'scoped'.
cs: Typy a aliasy nemůžou mít název „scoped“.
fr: Les types et alias ne peuvent pas être nommés 'scoped'.
it: I tipi e gli alias non possono essere denominati 'con ambito'.
ja: 型とエイリアスに 'scoped' という名前を付けることはできません。
pl: Typy i aliasy nie mogą mieć nazwy „scoped”.
pt_br: Tipos e pseudônimos não podem ser nomeados como 'scoped'.
ru: У типов и псевдонимов не может быть имя "scoped".
zh_hans: 类型和别名不能为 "scoped"。
zh_hant: 類型和別名不能命名為 'scoped'。

# ERR_ScriptsAndSubmissionsCannotHaveRequiredMembers
source: Required members are not allowed on the top level of a script or submission.
cs: Povinní členové nejsou povoleni na nejvyšší úrovni skriptu nebo odeslání.
fr: Les membres requis ne sont pas autorisés au niveau supérieur d’un script ou d’une soumission.
it: I membri obbligatori non sono consentiti al primo livello di uno script o di un invio.
ja: 必要なメンバーは、スクリプトまたは送信の最上位レベルでは許可されていません。
pl: Wymagane składowe są niedozwolone na najwyższym poziomie skryptu lub żądania przesłania.
pt_br: Os membros necessários não são permitidos no nível superior de um script ou envio.
ru: Обязательные члены не разрешены на верхнем уровне сценария или отправки.
zh_hans: 所需成员不在脚本或提交的顶层受允许。
zh_hant: 指令碼或提交的頂層不允許必要的成員。

# ERR_SealedAPIInRecord
source: '{0}' cannot be sealed because containing record is not sealed.
cs: Typ {0} nemůže být zapečetěný, protože není zapečetěný obsahující záznam.
fr: '{0}' ne peut pas être sealed, car l'enregistrement contenant n'est pas sealed.
it: '{0}' non può essere sealed perché il record contenitore non è sealed.
ja: '{0}' を sealed にすることはできません。これが含まれているレコードが sealed ではないためです。
pl: Element „{0}” nie może być zapieczętowany, ponieważ zawierający go rekord nie jest zapieczętowany.
pt_br: '{0}' não pode ser selado porque o registro contentor não está selado.
ru: "{0}" не может быть запечатанным, поскольку содержащая его запись не является запечатанной.
zh_hans: “{0}”不能密封，因为包含的记录未密封。
zh_hant: 因為未密封內含的記錄，所以無法密封 '{0}'。

# ERR_SignatureMismatchInRecord
source: Record member '{0}' must return '{1}'.
cs: Člen záznamu {0} musí vracet {1}.
fr: Le membre d'enregistrement '{0}' doit retourner '{1}'.
it: Il membro di record '{0}' deve restituire '{1}'.
ja: レコード メンバー '{0}' は '{1}' を返す必要があります。
pl: Składowa rekordu „{0}” musi zwracać wartość „{1}”.
pt_br: O membro do registro '{0}' precisa retornar '{1}'.
ru: Элемент записи "{0}" должен возвращать "{1}".
zh_hans: 记录成员“{0}”必须返回“{1}”。
zh_hant: 記錄成員 '{0}' 必須傳回 '{1}'。

# ERR_SimpleProgramIsEmpty
source: At least one top-level statement must be non-empty.
cs: Musíte zadat aspoň jeden příkaz nejvyšší úrovně.
fr: Au moins une instruction de niveau supérieur ne doit pas être vide.
it: Almeno un'istruzione di primo livello deve essere non vuota.
ja: 少なくとも 1 つの最上位のステートメントを空以外にする必要があります。
pl: Co najmniej jedna instrukcja najwyższego poziomu nie może być pusta.
pt_br: Pelo menos uma instrução de nível superior não pode estar vazia.
ru: По крайней мере один оператор верхнего уровня не должен быть пустым.
zh_hans: 至少一个顶级语句必须为非空。
zh_hant: 至少一個最上層陳述式必須是非空白。

# ERR_SimpleProgramLocalIsReferencedOutsideOfTopLevelStatement
source: Cannot use local variable or local function '{0}' declared in a top-level statement in this context.
cs: Místní proměnná nebo místní funkce {0} deklarovaná v příkazu nejvyšší úrovně v tomto kontextu se nedá použít.
fr: Impossible d'utiliser une variable locale ou une fonction locale '{0}' déclarée dans une instruction de niveau supérieur dans ce contexte.
it: In questo contesto non è possibile usare la variabile locale o la funzione locale '{0}' dichiarata in un'istruzione di primo livello.
ja: このコンテキストでは、トップレベルのステートメントで宣言されたローカル変数またはローカル関数 '{0}' を使用することはできません。
pl: W tym kontekście nie można użyć zmiennej lokalnej ani funkcji lokalnej „{0}” zadeklarowanej w instrukcji najwyższego poziomu.
pt_br: Não é possível usar a variável local ou a função local '{0}' declarada em uma instrução de nível superior neste contexto.
ru: Невозможно использовать локальную переменную или локальную функцию "{0}", объявленную в инструкции верхнего уровня в этом контексте.
zh_hans: 在此上下文中，无法使用在顶级语句中声明的局部变量或本地函数“{0}”。
zh_hant: 在此內容中，無法使用最上層陳述式中宣告的區域變數或區域函式 '{0}'。

# ERR_SimpleProgramMultipleUnitsWithTopLevelStatements
source: Only one compilation unit can have top-level statements.
cs: Příkazy nejvyšší úrovně může mít jen jedna jednotka kompilace.
fr: Une seule unité de compilation peut avoir des instructions de niveau supérieur.
it: Le istruzioni di primo livello possono essere presenti solo in un'unica unità di compilazione.
ja: トップレベルのステートメントを持つことができるのは、1 つのコンパイル ユニットのみです。
pl: Tylko jedna jednostka kompilacji może mieć instrukcje najwyższego poziomu.
pt_br: Apenas uma unidade de compilação pode ter instruções de nível superior.
ru: Только одна единица компиляции может содержать инструкции верхнего уровня.
zh_hans: 只有一个编译单元可具有顶级语句。
zh_hant: 只能有一個編譯單位包含最上層陳述式。

# ERR_SimpleProgramNotAnExecutable
source: Program using top-level statements must be an executable.
cs: Program, který používá příkazy nejvyšší úrovně, musí být spustitelný.
fr: Le programme qui utilise des instructions de niveau supérieur doit être un exécutable.
it: Il programma che usa istruzioni di primo livello deve essere un eseguibile.
ja: トップレベルのステートメントを使用するプログラムは、実行可能ファイルである必要があります。
pl: Program korzystający z instrukcji najwyższego poziomu musi być plikiem wykonywalnym.
pt_br: O programa que usa as instruções de nível superior precisa ser um executável.
ru: Программы, использующие инструкции верхнего уровня, должны быть исполняемыми.
zh_hans: 使用顶级语句的程序必须是可执行文件。
zh_hant: 使用最上層陳述式的程式必須是可執行檔。

# ERR_SingleInapplicableBinaryOperator
source: Operator cannot be applied to operands of type '{0}' and '{1}'. The closest inapplicable candidate is '{2}'
pt_br: O operador não pode ser aplicado a operandos dos tipos "{0}" e "{1}". O candidato inaplicável mais próximo é "{2}"

# ERR_SingleInapplicableUnaryOperator
source: Operator cannot be applied to operand of type '{0}'. The closest inapplicable candidate is '{1}'
pt_br: O operador não pode ser aplicado ao operando do tipo "{0}". O candidato inaplicável mais próximo é "{1}"

# ERR_SpreadMissingMember
source: Spread operator '..' cannot operate on variables of type '{0}' because '{0}' does not contain a public instance or extension definition for '{1}'
fr: L’opérateur spread « .. » ne peut pas fonctionner sur des variables de type « {0} », car « {0} » ne contient pas de définition d’extension ou d’instance publique pour « {1} »
it: L'operatore spread '..' non può operare su variabili di tipo '{0}' perché '{0}' non contiene un'istanza pubblica o una definizione di estensione per '{1}'
pl: Operator rozłożenia „..” nie może operować na zmiennych typu „{0}”, ponieważ „{0}” nie zawiera publicznego wystąpienia lub definicji rozszerzenia dla elementu „{1}”
pt_br: O operador de propagação '..' não pode operar em variáveis do tipo '{0}' porque '{0}' não contém uma instância pública ou definição de extensão para '{1}'
ru: Оператор расширения ".." не работает с переменными типа "{0}", так как "{0}" не содержит открытое определение экземпляра или расширения для "{1}"
zh_hans: 由于“{0}”不包含“{1}”的公共实例或扩展定义，因此展开运算符 “...” 不能作用于“{0}”类型的变量
zh_hant: 擴展運算子 '..' 無法在類型 '{0}' 的變數上運作，因為 '{0}' 不包含 '{1}' 的公用執行個體或延伸模組定義

# ERR_StaticAPIInRecord
source: Record member '{0}' may not be static.
cs: Člen záznamu {0} nemůže být statický.
fr: Le membre d'enregistrement '{0}' ne peut pas être static.
it: Il membro di record '{0}' non può essere statico.
ja: レコード メンバー '{0}' を static にすることはできません。
pl: Składowa rekordu „{0}” nie może być statyczna.
pt_br: O membro do registro '{0}' não pode ser estático.
ru: Элемент записи "{0}" не может быть статическим.
zh_hans: 记录成员“{0}”可能不是静态的。
zh_hant: 記錄成員 '{0}' 不可以是靜態。

# ERR_StaticAnonymousFunctionCannotCaptureThis
source: A static anonymous function cannot contain a reference to 'this' or 'base'.
cs: Statická anonymní funkce nemůže obsahovat odkaz na this nebo base.
fr: Une fonction anonyme statique ne peut pas contenir de référence à 'this' ou 'base'.
it: Una funzione anonima statica non può contenere un riferimento a 'this' o 'base'.
ja: 静的な匿名関数に 'this' または 'base' への参照を含めることはできません。
pl: Statyczna funkcja anonimowa nie może zawierać odwołania do elementu „this” lub „base”.
pt_br: Uma função anônima estática não pode conter uma referência a 'this' ou a 'base'.
ru: Статическая анонимная функция не может содержать ссылку на "this" или "base".
zh_hans: 静态匿名函数不能包含对 "this" 或 "base" 的引用。
zh_hant: 靜態匿名函式不可包含對 'this' 或 'base' 的參考。

# ERR_StaticAnonymousFunctionCannotCaptureVariable
source: A static anonymous function cannot contain a reference to '{0}'.
cs: Statická anonymní funkce nemůže obsahovat odkaz na {0}.
fr: Une fonction anonyme statique ne peut pas contenir de référence à '{0}'.
it: Una funzione anonima statica non può contenere un riferimento a '{0}'.
ja: 静的な匿名関数に '{0}' への参照を含めることはできません。
pl: Statyczna funkcja anonimowa nie może zawierać odwołania do elementu „{0}”.
pt_br: Uma função anônima estática não pode conter uma referência a '{0}'.
ru: Статическая анонимная функция не может содержать ссылку на "{0}".
zh_hans: 静态匿名函数不能包含对“{0}”的引用。
zh_hant: 靜態匿名函式不可包含對 '{0}' 的參考。

# ERR_StaticLocalFunctionCannotCaptureThis
source: A static local function cannot contain a reference to 'this' or 'base'.
cs: Statická lokální funkce nesmí obsahovat odkaz na this nebo base.
de: Eine statische lokale Funktion kann keinen Verweis auf "this" oder "base" enthalten.
es: Una función local estática no puede contener una referencia a "this" o "base".
fr: Une fonction locale statique ne peut pas contenir de référence à 'this' ou 'base'.
it: Una funzione locale statica non può contenere un riferimento a 'this' o 'base'.
ja: 静的なローカル関数に 'this' または 'base' への参照を含めることはできません。
ko: 정적 로컬 함수는 'this' 또는 'base'에 대한 참조를 포함할 수 없습니다.
pl: Statyczna funkcja lokalna nie może zawierać odwołania do elementu „this” lub „base”.
pt_br: Uma função local estática não pode conter uma referência a 'this' ou a 'base'.
ru: Статическая локальная функция не может содержать ссылку на "this" или "base".
tr: Statik bir yerel işlev, 'this' veya 'base' başvurusu içeremez.
zh_hans: 静态本地函数不能包含对 "this" 或 "base" 的引用。
zh_hant: 靜態區域函式不可包含對 'this' 或 'base' 的參考。

# ERR_StaticLocalFunctionCannotCaptureVariable
source: A static local function cannot contain a reference to '{0}'.
cs: Statická lokální funkce nesmí obsahovat odkaz na {0}.
de: Eine statische lokale Funktion kann keinen Verweis auf "{0}" enthalten.
es: Una función local estática no puede contener una referencia a "{0}".
fr: Une fonction locale statique ne peut pas contenir de référence à '{0}'.
it: Una funzione locale statica non può contenere un riferimento a '{0}'.
ja: 静的なローカル関数に '{0}' への参照を含めることはできません。
ko: 정적 로컬 함수는 '{0}'에 대한 참조를 포함할 수 없습니다.
pl: Statyczna funkcja lokalna nie może zawierać odwołania do elementu „{0}”.
pt_br: Uma função local estática não pode conter uma referência a '{0}'.
ru: Статическая локальная функция не может содержать ссылку на "{0}".
tr: Statik bir yerel işlev, '{0}' başvurusu içeremez.
zh_hans: 静态本地函数不能包含对“{0}”的引用。
zh_hant: 靜態區域函式不可包含對 '{0}' 的參考。

# ERR_StaticMemberCantBeReadOnly
source: Static member '{0}' cannot be marked 'readonly'.
cs: Statický člen {0} se nedá označit modifikátorem readonly.
de: Der statische Member "{0}" kann nicht als "readonly" markiert werden.
es: El miembro estático "{0}" no se puede marcar como "readonly".
fr: Le membre statique '{0}' ne peut pas être marqué 'readonly'.
it: Il membro statico '{0}' non può essere contrassegnato come 'readonly'.
ja: 静的メンバー '{0}' を 'readonly' とマークすることはできません。
ko: 정적 멤버 '{0}'을(를) 'readonly'로 표시할 수 없습니다.
pl: Składowa statyczna „{0}” nie może być oznaczona jako „readonly”.
pt_br: O membro estático '{0}' não pode ser marcado como 'readonly'.
ru: Статический член "{0}" не может быть помечен как readonly.
tr: '{0}' statik üyesi 'readonly' olarak işaretlenemez.
zh_hans: 静态成员 "{0}" 不能标记为 "readonly"。
zh_hant: 靜態成員 '{0}' 不能標記為 'readonly'。

# ERR_StdInOptionProvidedButConsoleInputIsNotRedirected
source: stdin argument '-' is specified, but input has not been redirected from the standard input stream.
cs: Zadal se argument stdin -, ale vstup se nepřesměroval na stream standardního vstupu.
fr: L'argument stdin '-' est spécifié, mais l'entrée n'a pas été redirigée à partir du flux d'entrée standard.
it: è stato specificato l'argomento stdin '-', ma l'input non è stato reindirizzato dal flusso di input standard.
ja: stdin 引数 '-' が指定されていますが、入力が標準入力ストリームからリダイレクトされていません。
pl: określono argument stdin „-”, ale dane wejściowe nie zostały przekierowane ze standardowego strumienia wejściowego.
pt_br: O argumento stdin '-' foi especificado, mas a entrada não foi redirecionada do fluxo de entrada padrão.
ru: Указан аргумент stdin "-", но входные данные не были перенаправлены из стандартного входного потока.
zh_hans: 已指定 stdin 参数 "-"，但尚未从标准输入流重定向输入。
zh_hant: 已指定 stdin 引數 '-'，但尚未從標準輸入資料流重新導向輸入。

# ERR_StringMustStartWithQuoteCharacter
source: String must start with quote character: "
cs: Řetězec musí začínat znakem uvozovek: "
fr: La chaîne doit commencer par le guillemet : "
it: La stringa deve iniziare con le virgolette: "
ja: 文字列の先頭は引用符文字である必要があります: "
pl: Ciąg musi rozpoczynać się znakiem cudzysłowu: "
pt_br: A cadeia de caracteres deve começar com o caractere de aspa: "
ru: Строка должна начинаться с символа кавычки "
zh_hans: 字符串必须以引号字符开头: "
zh_hant: 字串的開頭必須是引號字元: "

# ERR_StructHasInitializersAndNoDeclaredConstructor
source: A 'struct' with field initializers must include an explicitly declared constructor.
cs: Položka „struct“ s inicializátory pole musí obsahovat explicitně deklarovaný konstruktor.
fr: Un 'struct' avec des initialiseurs de champ doit inclure un constructeur explicitement déclaré.
it: Un elemento 'struct' con inizializzatori di campo deve includere un costruttore dichiarato in modo esplicito.
ja: フィールド初期化子を持つ 'struct' には、明示的に宣言されたコンストラクターを含める必要があります。
pl: Element „struct” z inicjatorami pól musi zawierać jawnie zadeklarowanego konstruktora.
pt_br: Uma 'estrutura' com inicializadores de campo deve incluir um construtor declarado explicitamente.
ru: Параметр struct с инициализаторами полей должен включать явно объявленный конструктор.
zh_hans: 具有字段初始值设定项的“结构”必须包含显式声明的构造函数。
zh_hant: 具有欄位初始設定式的 'struct' 必須包含明確宣告的建構函式。

# ERR_StructLayoutAndExtendedLayout
source: Use of 'StructLayoutAttribute' and 'ExtendedLayoutAttribute' on the same type is not allowed.
pt_br: O uso de "StructLayoutAttribute" e "ExtendedLayoutAttribute" no mesmo tipo não é permitido.

# ERR_StructLayoutCyclePrimaryConstructorParameter
source: Struct primary constructor parameter '{0}' of type '{1}' causes a cycle in the struct layout
cs: Parametr primárního konstruktoru struktury {0} typu{1} způsobuje cyklus v rozložení struktury.
fr: Le paramètre de constructeur principal struct '{0}' de type '{1}' provoque un cycle dans la disposition du struct
it: Il parametro del costruttore primario struct '{0}' di tipo '{1}' causa un ciclo nel layout dello struct
ja: 型 '{1}' の構造体のプライマリ コンストラクター パラメーター '{0}' により、構造体レイアウトで循環が発生します
pl: Podstawowy parametr konstruktora struktury '{0}' typu '{1}' powoduje cykl w układzie struktury
pt_br: O parâmetro do construtor primário struct "{0}" do tipo "{1}" causa um ciclo no layout do struct
ru: Параметр основного конструктора структуры "{0}" типа "{1}" вызывает цикл в макете структуры
zh_hans: 类型为“{1}”的结构主构造函数参数“{0}”导致结构布局中出现循环
zh_hant: 類型 '{1}' 的結構主要建構函式參數 '{0}' 在結構配置中導致循環

# ERR_SwitchArmSubsumed
source: The pattern is unreachable. It has already been handled by a previous arm of the switch expression or it is impossible to match.
cs: Vzor není dostupný. Už se zpracoval v jiné části výrazu switch nebo není možné pro něj najít shodu.
fr: Le modèle est inaccessible. Il a déjà été traité par un bras précédent de l'expression switch ou la mise en correspondance est impossible.
it: Il criterio non è raggiungibile. È già stato gestito da un elemento precedente dell'espressione switch oppure non è possibile trovare una corrispondenza.
ja: このパターンには到達できません。これは、switch 式の以前のアームによって既に処理されたか、一致させることができません。
pl: Wzorzec jest nieosiągalny. Został on już obsłużony przez poprzednie odgałęzienie wyrażenia switch albo nie można go dopasować.
pt_br: O padrão não está acessível. Ele já foi manipulado por um ARM anterior da expressão do comutador ou não é possível fazer a correspondência.
ru: Шаблон является недоступным. Он уже был обработан в предыдущем блоке выражения switch или условие для него не может быть выполнено.
zh_hans: 该模式不可访问。它已由 switch 表达式的前一个 arm 处理或无法匹配。
zh_hant: 無法使用此樣式。switch 運算式的上一個 arm 已處理了此樣式，或其無法比對。

# ERR_SwitchCaseSubsumed
source: The switch case is unreachable. It has already been handled by a previous case or it is impossible to match.
cs: Případ příkazu switch není dostupný. Už se zpracoval v jiném případu nebo není možné pro něj najít shodu.
fr: L'instruction switch case est inaccessible. Elle a déjà été traitée par un cas précédent ou la mise en correspondance est impossible.
it: Lo switch case on è raggiungibile. È già stato gestito da un case precedente oppure non è possibile trovare una corrispondenza.
ja: switch ケースに到達できません。以前のケースで既に処理されたか、一致させることができません。
pl: Przypadek switch jest nieosiągalny. Został on już obsłużony przez poprzednią instrukcję case albo nie można go dopasować.
pt_br: O caso do comutador não está acessível. Ele já foi manipulado por um caso anterior ou não é possível fazer a correspondência.
ru: Блок выражения switch case является недоступным. Он уже был обработан в предыдущем блоке или условие для него не может быть выполнено.
zh_hans: 该 switch case 不可访问。它已由上一 case 处理或无法匹配。
zh_hant: 無法使用此 switch 案例。switch 運算式的上一個 arm 已處理了此樣式，或其無法比對。

# ERR_SwitchExpressionNoBestType
source: No best type was found for the switch expression.
cs: Pro výraz switch se nenašel žádný optimální typ.
de: Es wurde kein optimaler Typ für den switch-Ausdruck gefunden.
es: No se encontró el mejor tipo para la expresión switch.
fr: Il n'existe aucun meilleur type pour l'expression switch.
it: Non è stato trovato alcun tipo ottimale per l'espressione switch.
ja: switch 式に最適な型が見つかりませんでした。
ko: switch 식에 적합한 형식이 없습니다.
pl: Nie znaleziono najlepszego typu dla wyrażenia switch.
pt_br: Não foi encontrado um tipo melhor para a expressão switch.
ru: Не удалось найти лучший тип для выражения switch.
tr: Switch deyimi için en iyi tür bulunamadı.
zh_hans: 没有为 switch 表达式找到最佳类型。
zh_hant: 找不到 switch 運算式的最佳類型。

# ERR_SwitchGoverningExpressionRequiresParens
source: Parentheses are required around the switch governing expression.
cs: Řídící výraz switch je nutné uzavřít do závorek.
de: Der Ausdruck zur Steuerung von Schaltern muss in Klammern eingeschlossen werden.
es: La expresión switch aplicable requiere paréntesis.
fr: Des parenthèses sont obligatoires autour de l'expression régissant switch.
it: L'espressione che gestisce lo switch deve essere racchiusa tra parentesi.
ja: switch を制御する式の周囲にはかっこが必要です。
ko: 식을 제어하는 switch 주위에 괄호가 필요합니다.
pl: Wymagane są nawiasy wokół wyrażenia sterującego instrukcją switch.
pt_br: É necessário colocar a expressão que rege a switch entre parênteses.
ru: Вокруг главного выражения switch требуются скобки.
tr: Switch yönetim ifadesinin parantez içine alınması gerekir.
zh_hans: switch governing 表达式的周围需要括号。
zh_hant: switch 主導的運算式前後必須有括弧。

# ERR_SymbolDefinedInAssembly
source: '{0}' is defined in assembly '{1}'.
fr: '{0}' est défini dans l’assemblée '{1}'.
it: '{0}' è definito nell'assembly '{1}'.
ja: '{0}' はアセンブリ '{1}' で定義されています。
pl: „{0}” jest zdefiniowany w zestawie „{1}”.
pt_br: '{0}' é definido no assembly '{1}'.
ru: '{0}' определен в сборке '{1}'.
zh_hans: “{0}”在程序集“{1}”中定义。
zh_hant: '{0}' 於組件 '{1}' 中定義。

# ERR_TooManyCloseBracesForRawString
source: The interpolated raw string literal does not start with enough '$' characters to allow this many consecutive closing braces as content.
cs: Interpolovaný literál nezpracovaného řetězce nezačíná dostatečným počtem znaků $, aby bylo možné takový počet po sobě jdoucích koncových složených závorek povolit jako obsah.
fr: Le littéral de chaîne brute interpolée ne commence pas par suffisamment de caractères '$' pour autoriser autant d’accolades fermante consécutives comme contenu.
it: Il valore letterale stringa non elaborata interpolato non inizia con un numero di caratteri '$' sufficiente per consentire il contenuto di questo numero di parentesi graffe di chiusura consecutive.
ja: 補間された生文字列リテラルの先頭に十分な数の '$' 文字がないため、連続する終わり波かっこをコンテンツとして使用できません。
pl: Interpolowany literał nieprzetworzonego ciągu nie zaczyna się od wystarczającej liczby znaków „$”, aby zezwolić na następującą liczbę kolejnych zamykających nawiasów klamrowych jako zawartość.
pt_br: A literal da cadeia de caracteres bruta interpolada não começa com caracteres “$” suficientes para permitir esse número de chaves de fechamento consecutivas como conteúdo.
ru: Интерполированный литерал необработанной строки не начинается с достаточного количества символов \"$\", чтобы разрешить использование такого же количества последовательных закрывающих фигурных скобок в качестве содержимого.
zh_hans: 内插原始字符串字面量的开头没有足够的 \"$\" 字符以允许将这么多连续的右大括号作为内容。
zh_hant: 差補原始字串常值開頭沒有足夠的 '$' 字元數，因此無法允許這麼多連續的右大括弧做為內容。
