Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NullAsNonNullable_Title
source: Cannot convert null literal to non-nullable reference type.
cs: Literál null nejde převést na odkazový typ, který nemůže mít hodnotu null.
de: Ein NULL-Literal kann nicht in einen Non-Nullable-Verweistyp konvertiert werden.
es: No se puede convertir un literal NULL en un tipo de referencia que no acepta valores NULL.
fr: Impossible de convertir un littéral ayant une valeur null en type référence non-nullable.
it: Non è possibile convertire il valore letterale Null in tipo riferimento che non ammette i valori Null.
ja: null リテラルを null 非許容参照型に変換できません。
ko: Null 리터럴을 null을 허용하지 않는 참조 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować literału o wartości null na nienullowalny typ referencyjny.
pt_br: Não é possível converter um literal nulo em um tipo de referência não anulável.
ru: Литерал, равный NULL, не может быть преобразован в ссылочный тип, не допускающий значение NULL.
tr: Null sabit değer, boş değer atanamayan başvuru türüne dönüştürülemiyor.
zh_hans: 无法将 null 字面量转换为非 null 的引用类型。
zh_hant: 無法將 null 常值轉換成不可為 Null 的參考型別。

# WRN_NullReferenceArgument
source: Possible null reference argument for parameter '{0}' in '{1}'.
cs: V parametru {0} v {1} může být argument s odkazem null.
de: Mögliches Nullverweisargument für den Parameter "{0}" in "{1}".
es: Posible argumento de referencia nulo para el parámetro "{0}" en "{1}".
fr: Existence possible d'un argument de référence null pour le paramètre '{0}' dans '{1}'.
it: Possibile argomento di riferimento Null per il parametro '{0}' in '{1}'.
ja: '{1}' 内のパラメーター '{0}' に Null 参照引数がある可能性があります。
ko: '{1}'의 매개 변수 '{0}'에 대한 가능한 null 참조 인수입니다.
pl: Możliwy argument odwołania o wartości null dla parametru „{0}” w „{1}”.
pt_br: Possível argumento de referência nula para o parâmetro '{0}' em '{1}'.
ru: Возможно, аргумент-ссылка, допускающий значение NULL, для параметра "{0}" в "{1}".
tr: '{1}' içindeki '{0}' parametresi için olası null başvuru bağımsız değişkeni.
zh_hans: “{1}”中的形参“{0}”可能传入 null 引用实参。
zh_hant: '{1}' 中的參數 '{0}' 可能有 Null 參考引數。

# WRN_NullReferenceArgument_Title
source: Possible null reference argument.
cs: Může jít o argument s odkazem null.
de: Mögliches Nullverweisargument.
es: Posible argumento de referencia nulo
fr: Existence possible d'un argument de référence null.
it: Possibile argomento di riferimento Null.
ja: Null 参照引数の可能性があります。
ko: 가능한 null 참조 인수입니다.
pl: Możliwy argument odwołania o wartości null.
pt_br: Possível argumento de referência nula.
ru: Возможно, аргумент-ссылка, допускающий значение NULL.
tr: Olası null başvuru bağımsız değişkeni.
zh_hans: 引用类型参数可能为 null。
zh_hant: 可能有 Null 參考引數。

# WRN_NullReferenceAssignment
source: Possible null reference assignment.
cs: Může jít o přiřazení s odkazem null.
de: Mögliche Nullverweiszuweisung.
es: Posible asignación de referencia nula.
fr: Existence possible d'une assignation de référence null.
it: Possibile assegnazione di riferimento Null.
ja: Null 参照代入の可能性があります。
ko: 가능한 null 참조 할당입니다.
pl: Możliwe przypisanie odwołania o wartości null.
pt_br: Possível atribuição de referência nula.
ru: Возможно, назначение-ссылка, допускающее значение NULL.
tr: Olası null başvuru ataması.
zh_hans: 可能的 null 引用赋值。
zh_hant: 可能有 Null 參考指派。

# WRN_NullReferenceAssignment_Title
source: Possible null reference assignment.
cs: Může jít o přiřazení s odkazem null.
de: Mögliche Nullverweiszuweisung.
es: Posible asignación de referencia nula
fr: Existence possible d'une assignation de référence null.
it: Possibile assegnazione di riferimento Null.
ja: Null 参照代入の可能性があります。
ko: 가능한 null 참조 할당입니다.
pl: Możliwe przypisanie odwołania o wartości null.
pt_br: Possível atribuição de referência nula.
ru: Возможно, назначение-ссылка, допускающее значение NULL.
tr: Olası null başvuru ataması.
zh_hans: 引用类型赋值可能为 null。
zh_hant: 可能有 Null 參考指派。

# WRN_NullReferenceInitializer
source: Object or collection initializer implicitly dereferences possibly null member '{0}'.
cs: Inicializátor objektu nebo kolekce implicitně přistupuje přes ukazatel ke členovi {0}, který může být null.
de: Der Objekt- oder Sammlungsinitialisierer dereferenziert implizit den Member "{0}", der möglicherweise NULL ist.
es: El inicializador de objeto o colección desreferencia el miembro "{0}" posiblemente NULL de forma implícita.
fr: L'initialiseur d'objet ou de collection déréférence implicitement le membre susceptible d'avoir une valeur null '{0}'.
it: L'inizializzatore di oggetto o di raccolta dereferenzia in modo implicito il membro Null '{0}'.
ja: オブジェクトまたはコレクション初期化子が、null の可能性があるメンバー '{0}' を暗黙的に逆参照しています。
ko: 개체 또는 컬렉션 이니셜라이저가 가능한 null 멤버 '{0}'을(를) 암시적으로 역참조합니다.
pl: Inicjator obiektu lub kolekcji niejawnie wyłuskuje składową o możliwej wartości null „{0}”.
pt_br: O inicializador de objeto ou coleção desreferencia implicitamente o membro possivelmente nulo '{0}'.
ru: Инициализатор объекта или коллекции неявно разыменовывает член "{0}", который может быть равен NULL.
tr: Nesne veya koleksiyon başlatıcısı, null olma olasılığına sahip '{0}' üyesine örtük olarak başvuruyor.
zh_hans: 对象或集合初始值设定项会隐式解引用可能为 null 的成员“{0}”。
zh_hant: 物件或集合初始設定式意味會解除參考可能的 null 成員 '{0}'。

# WRN_NullReferenceInitializer_Title
source: Object or collection initializer implicitly dereferences possibly null member.
cs: Inicializátor objektu nebo kolekce implicitně přistupuje přes ukazatel ke členovi, který může být null
de: Der Objekt- oder Sammlungsinitialisierer dereferenziert implizit einen Member, der möglicherweise NULL ist.
es: El inicializador de objeto o colección desreferencia el miembro posiblemente NULL de forma implícita.
fr: L'initialiseur d'objet ou de collection déréférence implicitement le membre susceptible d'avoir une valeur null.
it: L'inizializzatore di oggetto o di raccolta dereferenzia in modo implicito il membro Null.
ja: オブジェクトまたはコレクション初期化子が、null の可能性があるメンバーを暗黙的に逆参照しています。
ko: 개체 또는 컬렉션 이니셜라이저가 가능한 null 멤버를 암시적으로 역참조합니다.
pl: Inicjator obiektu lub kolekcji niejawnie wyłuskuje składową o możliwej wartości null.
pt_br: O inicializador de objeto ou coleção desreferencia implicitamente o membro possivelmente nulo.
ru: Инициализатор объекта или коллекции неявно разыменовывает член, который может быть равен NULL.
tr: Nesne veya koleksiyon başlatıcısı, null olma olasılığına sahip üyeye örtük olarak başvuruyor.
zh_hans: 对象或集合初始值设定项会隐式取消引用可能为 null 的成员。
zh_hant: 物件或集合初始設定式意味會解除參考可能為 null 的成員。

# WRN_NullReferenceReceiver
source: Dereference of a possibly null reference.
cs: Přístup přes ukazatel k možnému odkazu s hodnotou null
de: Dereferenzierung eines möglichen Nullverweises.
es: Desreferencia de una referencia posiblemente NULL.
fr: Déréférencement d'une éventuelle référence null.
it: Dereferenziamento di un possibile riferimento Null.
ja: null 参照の可能性があるものの逆参照です。
ko: 가능한 null 참조의 역참조입니다.
pl: Wyłuskanie odwołania, które może mieć wartość null.
pt_br: Desreferência de uma referência possivelmente nula.
ru: Разыменование вероятной пустой ссылки.
tr: Olası bir null başvurunun başvurma işlemi.
zh_hans: 解引用可能出现空引用。
zh_hant: 可能 null 參考的取值 (dereference)。

# WRN_NullReferenceReceiver_Title
source: Dereference of a possibly null reference.
cs: Přístup přes ukazatel k možnému odkazu s hodnotou null
de: Dereferenzierung eines möglichen Nullverweises.
es: Desreferencia de una referencia posiblemente NULL.
fr: Déréférencement d'une éventuelle référence null.
it: Dereferenziamento di un possibile riferimento Null.
ja: null 参照の可能性があるものの逆参照です。
ko: 가능한 null 참조의 역참조입니다.
pl: Wyłuskanie odwołania, które może mieć wartość null.
pt_br: Desreferência de uma referência possivelmente nula.
ru: Разыменование вероятной пустой ссылки.
tr: Olası bir null başvurunun başvurma işlemi.
zh_hans: 解引用可能出现空引用。
zh_hant: 可能 null 參考的取值 (dereference)。

# WRN_NullReferenceReturn
source: Possible null reference return.
cs: Může jít o vrácený odkaz null.
de: Mögliche Nullverweisrückgabe.
es: Posible tipo de valor devuelto de referencia nulo.
fr: Existence possible d'un retour de référence null.
it: Possibile restituzione di riferimento Null.
ja: Null 参照戻り値である可能性があります。
ko: 가능한 null 참조 반환입니다.
pl: Możliwe zwrócenie odwołania o wartości null.
pt_br: Possível retorno de referência nula.
ru: Возможно, возврат ссылки, допускающей значение NULL.
tr: Olası null başvuru dönüşü.
zh_hans: 可能返回 null 引用。
zh_hant: 可能有 Null 參考傳回。

# WRN_NullReferenceReturn_Title
source: Possible null reference return.
cs: Může jít o vrácený odkaz null.
de: Mögliche Nullverweisrückgabe.
es: Posible tipo de valor devuelto de referencia nulo
fr: Existence possible d'un retour de référence null.
it: Possibile restituzione di riferimento Null.
ja: Null 参照戻り値である可能性があります。
ko: 가능한 null 참조 반환입니다.
pl: Możliwe zwrócenie odwołania o wartości null.
pt_br: Possível retorno de referência nula.
ru: Возможно, возврат ссылки, допускающей значение NULL.
tr: Olası null başvuru dönüşü.
zh_hans: 可能返回 null 引用。
zh_hant: 可能有 Null 參考傳回。

# WRN_NullabilityMismatchInArgument
source: Argument of type '{0}' cannot be used for parameter '{2}' of type '{1}' in '{3}' due to differences in the nullability of reference types.
cs: Argument typu {0} nejde použít pro parametr {2} typu {1} v {3} z důvodu rozdílů v možnostech použití hodnoty null u odkazových typů.
de: Das Argument vom Typ "{0}" kann aufgrund von Unterschieden in der NULL-Zulässigkeit von Verweistypen nicht für den Parameter "{2}" vom Typ "{1}" in "{3}" verwendet werden.
es: El argumento de tipo "{0}" no se puede usar para el parámetro "{2}" de tipo "{1}" en "{3}" debido a las diferencias en la nulabilidad de los tipos de referencia.
fr: Impossible d'utiliser l'argument de type '{0}' pour le paramètre '{2}' de type '{1}' dans '{3}'. En effet, il existe des différences dans l'acceptation des valeurs null par les types référence.
it: Non è possibile usare l'argomento di tipo '{0}' per il parametro '{2}' di tipo '{1}' in '{3}' a causa delle differenze nel supporto dei valori Null dei tipi riferimento.
ja: 型 '{0}' の引数は、参照型の NULL 値の許容の違いにより、'{3}' の型 '{1}' のパラメーター '{2}' には使用できません。
ko: 참조 형식의 null 허용 여부 차이로 인해 '{3}'에서 '{1}' 형식 '{2}' 매개 변수에 대해 '{0}' 형식 인수를 사용할 수 없습니다.
pl: Argumentu typu „{0}” nie można użyć dla parametru „{2}” typu „{1}” w elemencie „{3}” z powodu różnic w dopuszczalności wartości null przez typy referencyjne.
pt_br: O argumento do tipo '{0}' não pode ser usado para o parâmetro '{2}' do tipo '{1}' em '{3}' devido a diferenças na nulidade dos tipos de referência.
ru: Аргумент типа "{0}" запрещено использовать для параметра "{2}" типа "{1}" в "{3}" из-за различий в отношении допустимости значений NULL для ссылочных типов.
tr: '{0}' türündeki bağımsız değişken, başvuru türlerinin null atanabilirlik farklılıkları nedeniyle '{3}' içinde '{1}' türündeki '{2}' parametresi için kullanılamaz.
zh_hans: 由于引用类型的可为 null 性差异，{0} 类型的实参不能用于 {3} 中 {1} 类型的形参 {2}。
zh_hant: 因為參考型別的可 NULL 性有所差異，所以無法針對 '{3}' 內類型 '{1}' 的參數 '{2}' 使用類型 '{0}' 的引數。

# WRN_NullabilityMismatchInArgumentForOutput
source: Argument of type '{0}' cannot be used as an output of type '{1}' for parameter '{2}' in '{3}' due to differences in the nullability of reference types.
cs: Argument typu {0} nejde použít jako výstup typu {1} pro parametr {2} v {3} z důvodu rozdílů v možnostech použití hodnoty null u odkazových typů.
de: Das Argument vom Typ "{0}" kann aufgrund von Unterschieden bei der NULL-Zulässigkeit von Verweistypen nicht als Ausgabe vom Typ "{1}" für den Parameter "{2}" in "{3}" verwendet werden.
es: El argumento de tipo "{0}" no se puede usar como salida de tipo "{1}" para el parámetro "{2}" en "{3}" debido a las diferencias en la nulabilidad de los tipos de referencia.
fr: Impossible d'utiliser l'argument de type '{0}' en tant que sortie de type '{1}' pour le paramètre '{2}' dans '{3}'. En effet, il existe des différences dans l'acceptation des valeurs null par les types référence.
it: Non è possibile usare l'argomento di tipo '{0}' come output del tipo '{1}' per il parametro '{2}' in '{3}' a causa delle differenze nel supporto dei valori Null dei tipi riferimento.
ja: 型 '{0}' の引数は、参照型の NULL 値の許容の違いにより、'{3}' のパラメーター '{2}' に対して型 '{1}' の出力として使用することはできません。
ko: 참조 형식의 null 허용 여부 차이로 인해 '{3}'에서 '{2}' 매개 변수의 '{1}' 형식 출력으로 '{0}' 형식 인수를 사용할 수 없습니다.
pl: Argumentu typu „{0}” nie można użyć jako danych wyjściowych typu „{1}” dla parametru „{2}” w elemencie „{3}” z powodu różnic w dopuszczalności wartości null przez typy referencyjne.
pt_br: O argumento do tipo '{0}' não pode ser usado como uma saída do tipo '{1}' do parâmetro '{2}' em '{3}' devido a diferenças na nulidade dos tipos de referência.
ru: Аргумент типа "{0}" запрещено использовать в качестве выходных данных типа "{1}" для параметра "{2}" в "{3}" из-за различий в отношении допустимости значений NULL для ссылочных типов.
tr: '{0}' türündeki bağımsız değişken, başvuru türlerinin null atanabilirlik farklılıkları nedeniyle '{3}' içinde '{2}' parametresi için '{1}' türündeki bir çıkış olarak kullanılamaz.
zh_hans: 由于引用类型的可为 null 性差异，{0} 类型的实参不能用作 {3} 中 {1} 类型的形参 {2} 的输出。
zh_hant: 因為參考型別的可 NULL 性有所差異，所以無法將類型 '{0}' 的引數用作 '{3}' 中參數 '{2}' 的類型 '{1}' 輸出。

# WRN_NullabilityMismatchInArgumentForOutput_Title
source: Argument cannot be used as an output for parameter due to differences in the nullability of reference types.
cs: Argument nejde použít jako výstup pro parametr z důvodu rozdílů v možnostech použití hodnoty null u odkazových typů.
de: Das Argument kann aufgrund von Unterschieden bei der NULL-Zulässigkeit von Verweistypen nicht als Ausgabe für den Parameter verwendet werden.
es: El argumento no se puede usar como salida para el parámetro debido a las diferencias en la nulabilidad de los tipos de referencia.
fr: Impossible d'utiliser l'argument en tant que sortie du paramètre, car il existe des différences dans l'acceptation des valeurs null par les types référence.
it: Non è possibile usare l'argomento come output per il parametro a causa delle differenze nel supporto dei valori Null dei tipi riferimento.
ja: 参照型の NULL 値の許容の違いにより、引数をパラメーターの出力として使用することはできません。
ko: 참조 형식의 null 허용 여부 차이로 인해 매개 변수의 출력으로 인수를 사용할 수 없습니다.
pl: Argumentu nie można użyć jako danych wyjściowych dla parametru z powodu różnic w dopuszczalności wartości null przez typy referencyjne.
pt_br: O argumento não pode ser usado como uma saída do parâmetro devido a diferenças na nulidade dos tipos de referência.
ru: Аргумент запрещено использовать в качестве выходных данных для параметра из-за различий в отношении допустимости значений NULL для ссылочных типов.
tr: Bağımsız değişken, başvuru türlerinin null atanabilirlik farklılıkları nedeniyle parametre için çıkış olarak kullanılamaz.
zh_hans: 由于引用类型的可为 null 性差异，实参不能用作形参的输出。
zh_hant: 因為參考型別的可 NULL 性有所差異，所以引數無法用作參數的輸出。

# WRN_NullabilityMismatchInArgument_Title
source: Argument cannot be used for parameter due to differences in the nullability of reference types.
cs: Argument nejde použít pro parametr z důvodu rozdílů v možnostech použití hodnoty null u odkazových typů.
de: Das Argument kann aufgrund von Unterschieden bei der NULL-Zulässigkeit von Verweistypen nicht für den Parameter verwendet werden.
es: El argumento no se puede usar para el parámetro debido a las diferencias en la nulabilidad de los tipos de referencia.
fr: Impossible d'utiliser l'argument pour le paramètre, car il existe des différences dans l'acceptation des valeurs null par les types référence.
it: Non è possibile usare l'argomento per il parametro a causa delle differenze nel supporto dei valori Null dei tipi riferimento.
ja: 参照型の NULL 値の許容の違いにより、パラメーターに引数を使用できません。
ko: 참조 형식의 null 허용 여부 차이로 인해 매개 변수에 대해 인수를 사용할 수 없습니다.
pl: Argumentu nie można użyć dla parametru z powodu różnic w dopuszczalności wartości null przez typy referencyjne.
pt_br: O argumento não pode ser usado para o parâmetro devido a diferenças na nulidade dos tipos de referência.
ru: Аргумент запрещено использовать для параметра из-за различий в отношении допустимости значений NULL для ссылочных типов.
tr: Bağımsız değişken, başvuru türlerinin null atanabilirlik farklılıkları nedeniyle parametre için kullanılamaz.
zh_hans: 由于引用类型的可为 null 性差异，实参不能用于形参。
zh_hant: 因為參考型別的可 NULL 性有所差異，所以引數無法用於參數。

# WRN_NullabilityMismatchInAssignment
source: Nullability of reference types in value of type '{0}' doesn't match target type '{1}'.
cs: Typ odkazu s možnou hodnotou null v hodnotě typu {0} neodpovídá cílovému typu {1}.
de: Die NULL-Zulässigkeit von Verweistypen im Wert vom Typ "{0}" entspricht nicht dem Zieltyp "{1}".
es: La nulabilidad de los tipos de referencia en el valor de tipo "{0}" no coincide con el tipo de destino "{1}".
fr: La nullabilité des types référence dans la valeur de type '{0}' ne correspond pas au type cible '{1}'.
it: Il supporto dei valori Null dei tipi riferimento nel valore di tipo '{0}' non corrisponde al tipo di destinazione '{1}'.
ja: '{0}' 型の値における参照型の Null 許容性が、対象の型 '{1}' と一致しません。
ko: '{0}' 형식의 값에 있는 참조 형식 Null 허용 여부가 '{1}' 대상 형식과 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w wartości typu „{0}” jest niezgodna z typem docelowym „{1}”.
pt_br: A anulabilidade de tipos de referência no valor do tipo '{0}' não corresponde ao tipo de destino '{1}'.
ru: Допустимость значения NULL в значении типа "{0}" не соответствует целевому типу "{1}".
tr: '{0}' türündeki değerdeki başvuru türlerinin boş değer atanabilirliği '{1}' hedef türü ile eşleşmiyor.
zh_hans: 类型“{0}”的值中引用类型的为 Null 性与目标类型“{1}”不匹配。
zh_hant: 型別 '{0}' 的值中參考型別可 Null 性與目標型別 '{1}' 不符合。

# WRN_NullabilityMismatchInAssignment_Title
source: Nullability of reference types in value doesn't match target type.
cs: Typ odkazu s možnou hodnotou null v hodnotě neodpovídá cílovému typu.
de: Die NULL-Zulässigkeit von Verweistypen im Wert entspricht nicht dem Zieltyp.
es: La nulabilidad de los tipos de referencia del valor no coincide con el tipo de destino
fr: La nullabilité des types référence dans la valeur ne correspond pas au type cible.
it: Il supporto dei valori Null dei tipi riferimento nel valore non corrisponde al tipo di destinazione.
ja: 値における参照型の Null 許容性が、対象の型と一致しません。
ko: 값에 있는 참조 형식 Null 허용 여부가 대상 형식과 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w wartości jest niezgodna z typem docelowym.
pt_br: A anulabilidade de tipos de referência no valor não corresponde ao tipo de destino.
ru: Допустимость значения NULL для ссылочных типов в значении не соответствует целевому типу.
tr: Değerdeki başvuru türlerinin boş değer atanabilirliği hedef tür ile eşleşmiyor.
zh_hans: 值中的引用类型的为 Null 性与目标类型不匹配。
zh_hant: 值中參考型別的可 Null 性與目標型別不符合。

# WRN_NullabilityMismatchInConstraintsOnImplicitImplementation
source: Nullability in constraints for type parameter '{0}' of method '{1}' doesn't match the constraints for type parameter '{2}' of interface method '{3}'. Consider using an explicit interface implementation instead.
cs: Možná hodnota null v omezení parametru typu {0} metody {1} neodpovídá omezením parametru typu {2} metody rozhraní {3}. Zkuste raději použít explicitní implementaci rozhraní.
de: Die NULL-Zulässigkeit in Einschränkungen für den Typparameter "{0}" der Methode "{1}" entspricht nicht den Einschränkungen für den Typparameter "{2}" der Schnittstellenmethode "{3}". Verwenden Sie stattdessen eine explizite Schnittstellenimplementierung.
es: La nulabilidad de las restricciones del parámetro de tipo "{0}" del método "{1}" no coincide con las restricciones del parámetro de tipo "{2}" del método de interfaz "{3}". Considere usar una implementación de interfaz explícita en su lugar.
fr: La nullabilité dans les contraintes pour le paramètre de type '{0}' de la méthode '{1}' ne correspond pas aux contraintes pour le paramètre de type '{2}' de la méthode d'interface '{3}'. Utilisez une implémentation d'interface explicite à la place.
it: Il supporto dei valori Null nei vincoli per il parametro di tipo '{0}' del metodo '{1}' non corrisponde ai vincoli per il parametro di tipo '{2}' del metodo di interfaccia '{3}'. Provare a usare un'implementazione esplicita dell'interfaccia.
ja: メソッド '{1}' の型パラメーター '{0}' に対する制約の Null 許容性が、インターフェイス メソッド '{3}' の型パラメーター '{2}' に対する制約と一致しません。明示的なインターフェイスの実装を使用することをお勧めします。
ko: '{1}' 메서드의 '{0}' 형식 매개 변수에 대한 제약 조건의 Null 허용 여부가 '{3}' 인터페이스 메서드의 '{2}' 형식 매개 변수에 대한 제약 조건과 일치하지 않습니다. 명시적 인터페이스 구현을 대신 사용하세요.
pl: Obsługa wartości null w ograniczeniach dla parametru typu „{0}” metody „{1}” jest niezgodna z ograniczeniami parametru typu „{2}” metody interfejsu „{3}”. Rozważ użycie jawnej implementacji interfejsu.
pt_br: A anulabilidade em restrições para parâmetro de tipo '{0}' do método '{1}' não corresponde às restrições para o parâmetro de tipo '{2}' do método de interface '{3}'. Em vez disso, considere a possibilidade de usar uma implementação de interface explícita.
ru: Допустимость значения NULL в ограничениях для параметра типа "{0}" метода "{1}" не соответствует ограничениям параметра типа "{2}" метода интерфейса "{3}". Рассмотрите возможность явной реализации интерфейса.
tr: {1}' metodunun '{0}' tür parametresi için kısıtlamalardaki boş değer atanabilirlik, '{3}' arabirim metodunun '{2}' tür parametresi için kısıtlamalarla eşleşmiyor. Bunun yerine açık bir arabirim uygulaması kullanmayı düşünün.
zh_hans: 方法“{1}”的类型参数“{0}”的约束中的为 Null 性与接口方法“{3}”的类型参数“{2}”的约束不匹配。请考虑改用显式接口实现。
zh_hant: 方法 '{1}' 的型別參數 '{0}' 條件約束可 Null 性與介面方法 '{3}' 的型別參數 '{2}' 條件約束不符合。請考慮改用明確的介面實作。

# WRN_NullabilityMismatchInConstraintsOnImplicitImplementation_Title
source: Nullability in constraints for type parameter doesn't match the constraints for type parameter in implicitly implemented interface method'.
cs: Možná hodnota null v omezeních parametru typu neodpovídá omezením parametru typu v implicitně implementované metodě rozhraní.
de: Die NULL-Zulässigkeit in Einschränkungen für den Typparameter entspricht nicht den Einschränkungen für den Typparameter in der implizit implementierten Schnittstellenmethode.
es: La nulabilidad de las restricciones del parámetro de tipo no coincide con las restricciones del parámetro de tipo del método de interfaz implementado de forma implícita
fr: La nullabilité dans les contraintes pour le paramètre de type ne correspond pas aux contraintes pour le paramètre de type dans la méthode d'interface implémentée implicitement.
it: Il supporto dei valori Null nei vincoli del parametro di tipo non corrisponde ai vincoli per il parametro di tipo nel metodo di interfaccia implementato in modo implicito.
ja: 型パラメーターの制約の Null 許容性が、暗黙的に実装されたインターフェイス メソッドの型パラメーターの制約と一致しません。
ko: 형식 매개 변수에 대한 제약 조건의 Null 허용 여부가 암시적으로 구현된 인터페이스 메서드의 형식 매개 변수에 대한 제약 조건과 일치하지 않습니다.
pl: Obsługa wartości null w ograniczeniach dla parametru typu jest niezgodna z ograniczeniami parametru typu w niejawnie implementowanej metodzie interfejsu.
pt_br: A anulabilidade em restrições para parâmetro de tipo não corresponde às restrições para parâmetro de tipo em método de interface implicitamente implementado.
ru: Допустимость значения NULL в ограничениях для параметра типа не соответствует ограничениям параметра типа в явно реализованном методе интерфейса.
tr: Tür parametresi için kısıtlamalardaki boş değer atanabilirlik, örtük olarak uygulanan arabirim metodundaki tür parametresi için kısıtlamalarla eşleşmiyor.
zh_hans: 类型参数的约束中的为 Null 性与隐式实现接口方法中的类型参数的约束不匹配。
zh_hant: 方法的型別參數條件約束與介面方法的型別參數條件約束不符合。請考慮改用隱含的介面實作。
