Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InconsistentIndexerNames
source: Two indexers have different names; the IndexerName attribute must be used with the same name on every indexer within a type
cs: Dva indexery mají stejný název. Atribut IndexerName musí být v rámci jednoho typu použitý se stejným názvem pro každý indexer.
de: Zwei Indexer haben unterschiedliche Namen. Das IndexerName-Attribut muss für jeden Indexer in einem Typ mit dem gleichen Namen verwendet werden.
es: Dos indizadores tienen nombres distintos; el atributo IndexerName se debe utilizar con el mismo nombre en todos los indizadores de un tipo
fr: Deux indexeurs ont des noms différents ; l'attribut IndexerName doit être utilisé avec le même nom sur chaque indexeur d'un type
it: Due indicizzatori hanno nomi diversi. L'attributo IndexerName deve essere usato con lo stesso nome in ogni indicizzatore all'interno di un tipo
ja: 2 つのインデクサーの名前が違います。1 つの型の中のそれぞれのインデクサーの IndexerName 属性は、同じでなければなりません
ko: 두 인덱서의 이름이 다릅니다. IndexerName 특성은 한 형식 안의 모든 인덱서에 대해서는 같은 이름으로 사용되어야 합니다.
pl: Istnieją dwa indeksatory o różnych nazwach. Dla każdego indeksatora w określonym typie należy użyć atrybutu IndexerName o takiej samej nazwie.
pt_br: Dois indexadores têm nomes diferentes. O atributo IndexerName deve ser usado com o mesmo nome em cada indexador dentro de um tipo
ru: Имена двух индексаторов различаются; для каждого индексатора в пределах типа следует использовать атрибут IndexerName с одним и тем же именем.
tr: İki dizin erişimcisi farklı adlara sahip; IndexerName özniteliği bir tür içindeki her dizin erişimcisinde aynı adla kullanılmalıdır
zh_hans: 两个索引器的名称不同；在类型中的每个索引器上的 IndexerName 特性都必须使用相同的名称
zh_hant: 兩個索引子具有不同的名稱; 類型中每個索引子上都必須使用同名的 IndexerName 屬性

# ERR_ComImportWithUserCtor
source: A class with the ComImport attribute cannot have a user-defined constructor
cs: Třída s atributem ComImport nemůže mít konstruktor definovaný uživatelem.
de: Eine Klasse mit dem ComImport-Attribut kann keinen benutzerdefinierten Konstruktor haben.
es: Una clase con el atributo ComImport no puede tener un constructor definido por el usuario
fr: Une classe avec l'attribut ComImport ne peut pas avoir un constructeur défini par l'utilisateur
it: Una classe con l'attributo ComImport non può avere un costruttore definito dall'utente
ja: ComImport 属性を持つクラスはユーザー定義のコンストラクターを持てません
ko: ComImport 특성이 있는 클래스에는 사용자 정의 생성자를 사용할 수 없습니다.
pl: W klasie z atrybutem ComImport nie może występować konstruktor zdefiniowany przez użytkownika.
pt_br: A classe com o atributo ComImport não pode ter um construtor definido pelo usuário
ru: Класс с атрибутом ComImport не может иметь определенного пользователем конструктора.
tr: ComImport özniteliğine sahip bir sınıfın kullanıcı tanımlı oluşturucusu olamaz
zh_hans: 具有 ComImport 特性的类不能有用户定义的构造函数
zh_hant: 擁有 ComImport 屬性的類別無法有使用者定義的建構函式

# ERR_FieldCantHaveVoidType
source: Field cannot have void type
cs: Pole nemůže být typu void.
de: Ein Feld kann keinen void-Typ aufweisen.
es: El campo no puede tener un tipo void
fr: Un champ ne peut pas être de type void
it: Il campo non può essere di tipo void
ja: フィールドは void 型を持てません
ko: 필드에는 void 형식을 사용할 수 없습니다.
pl: Typ pola nie może być typem void
pt_br: O campo não pode ter tipo void
ru: Поле не может иметь тип void.
tr: Alan void türüne sahip olamaz
zh_hans: 字段不能有 void 类型
zh_hant: 欄位不能有 void 類型

# WRN_NonObsoleteOverridingObsolete
source: Member '{0}' overrides obsolete member '{1}'. Add the Obsolete attribute to '{0}'.
cs: Člen {0} přepisuje zastaralý člen {1}. Přidejte ke členu {0} atribut Obsolete.
de: Der Member "{0}" überschreibt den veralteten Member "{1}". Fügen Sie das Obsolete-Attribut zu "{0}" hinzu.
es: El miembro '{0}' invalida el miembro obsoleto '{1}'. Agregue el atributo Obsolete a '{0}'.
fr: Le membre '{0}' se substitue au membre obsolète '{1}'. Ajoutez l'attribut Obsolete à '{0}'.
it: Il membro '{0}' esegue l'override del membro obsoleto '{1}'. Aggiungere l'attributo Obsolete a '{0}'.
ja: メンバー '{0}' は古い形式のメンバー '{1}' をオーバーライドします。Obsolete 属性を '{0}' に追加してください。
ko: {0}' 멤버는 사용되지 않는 멤버 '{1}'을(를) 재정의합니다. '{0}'에 Obsolete 특성을 추가하세요.
pl: Składowa „{0}” przesłania przestarzałą składową „{1}”. Dodaj atrybut Obsolete do składowej „{0}”.
pt_br: Membro "{0}" substitui o membro obsoleto "{1}". Adicione o atributo Obsolete a "{0}".
ru: Член "{0}" переопределяет устаревший член "{1}". Добавьте к "{0}" атрибут Obsolete.
tr: {0}' üyesi kullanılmayan '{1}' üyesini geçersiz kılar. Obsolete özniteliği '{0}' öğesine ekleyin.
zh_hans: 成员“{0}”将重写过时的成员“{1}”。请向“{0}”中添加 Obsolete 特性。
zh_hant: 成員 '{0}' 會覆寫過時的成員 '{1}'。請將 Obsolete 屬性加入 '{0}'。

# WRN_NonObsoleteOverridingObsolete_Title
source: Member overrides obsolete member
cs: Člen přepisuje nezastaralý člen.
de: Element überschreibt veraltetes Element
es: El miembro invalida los miembros obsoletos
fr: Un membre se substitue au membre obsolète
it: Il membro esegue l'override del membro obsoleto
ja: メンバーは古い形式のメンバーをオーバーライドします
ko: 멤버가 사용되지 않는 멤버를 재정의합니다.
pl: Składowa przesłania przestarzałą składową
pt_br: O membro substitui o membro obsoleto
ru: Член переопределяет устаревший член
tr: Üye eski üyeyi geçersiz kılar
zh_hans: 成员将重写过时的成员
zh_hant: 成員會覆寫過時成員

# ERR_SystemVoid
source: System.Void cannot be used from C# -- use typeof(void) to get the void type object
cs: Nejde použít konstrukci System.Void jazyka C#. Objekt typu void získáte pomocí syntaxe typeof(void).
de: System.Void kann nicht in C# verwendet werden. Sie können das void-Typobjekt mit typeof(void) abfragen.
es: System.Void no se puede usar en C#; use typeof(void) para obtener el objeto de tipo void
fr: Impossible d'utiliser System.Void dans C# : utilisez typeof(void) pour obtenir l'objet de type void
it: Non è possibile usare System.Void da C#. Usare typeof(void) per ottenere l'oggetto di tipo void
ja: System.Void は C# から使用できません。void 型オブジェクトを取得するには typeof(void) を使用してください
ko: System.Void는 C#에서 사용할 수 없습니다. void 형식 개체를 가져오려면 typeof(void)를 사용하세요.
pl: W języku C# nie można użyć elementu System.Void. Aby uzyskać obiekt typu void, użyj elementu typeof(void).
pt_br: System.Void não pode ser usado no C# -- use typeof(void) para obter o objeto de tipo void
ru: System.Void из C# использоваться не может -- для получения объекта типа void используйте typeof(void).
tr: System.Void C# içinden kullanılamaz; void türdeki nesneyi almak için typeof(void) kullanın
zh_hans: 在 C# 中无法使用 System.Void -- 使用 typeof(void)获取 void 类型对象
zh_hant: 無法從 C# 使用 System.Void -- 請使用 typeof(void) 取得 void 類型物件

# WRN_BitwiseOrSignExtend
source: Bitwise-or operator used on a sign-extended operand; consider casting to a smaller unsigned type first
cs: Logický bitový operátor or se použil pro operand s rozšířeným podpisem. Zvažte nejprve možnost přetypování na menší nepodepsaný typ.
de: Bitweiser OR-Operator wird für einen signaturerweiterten Operanden verwendet. Es wird empfohlen, zuerst eine Umwandlung in einen kleineren unsignierten Typ durchzuführen.
es: Operador OR bit a bit usado en un operando con extensión de signo; puede convertir primero a un tipo sin signo más pequeño
fr: Opérateur de bits or utilisé sur un opérande de signe étendu ; effectuez un cast en type plus faible non signé
it: L'operatore OR bit per bit viene usato su un operando con segno esteso. Prima di usarlo, provare a eseguire il cast su un tipo più piccolo e senza segno
ja: Bitwise-or 演算子が sign-extended オペランドで使用されています。まず、小さい符号なしの型をキャストしてみてください
ko: 부호 확장 피연산자에 비트 OR 연산자를 사용했습니다. 더 작은 부호 없는 형식으로 먼저 캐스팅하세요.
pl: Operator LUB działający na bitach został użyty względem argumentu ze znakiem. Rozważ możliwość wcześniejszego rzutowania na mniejszy typ bez znaku.
pt_br: Operador OR bit a bit usado em um operando de assinatura estendida; é recomendável realizar a conversão em um tipo menor sem assinatura primeiro
ru: Побитовый оператор "ИЛИ" применен к операнду, расширенному знаком; рекомендуется предварительное приведение к меньшему беззнаковому типу
tr: İşaret bölümü eklenen bir işlenen üzerinde bit düzeyinde OR işleci kullanılıyor; önce daha küçük bir işaretsiz türe dönüştürmeyi düşünün
zh_hans: 在经符号扩展的操作数上使用了按位“或”运算符；请考虑首先强制转换为较小的无符号类型
zh_hant: 用於 sign-extend 運算元的 Bitwise-or 運算子; 請先考慮轉換為較小的不帶正負號類型

# WRN_BitwiseOrSignExtend_Title
source: Bitwise-or operator used on a sign-extended operand
cs: Bitový operátor or byl použitý pro operand s rozšířeným podpisem.
de: Bitweiser OR-Operator, der bei einem signaturerweiterten Operanden verwendet wurde.
es: Operador OR bit a bit utilizado en un operando de extensión de signo
fr: Opérateur OU au niveau du bit utilisé sur un opérande de signe étendu
it: Operatore OR bit per bit usato su un operando con segno esteso
ja: 符号拡張されたオペランドでビットごとの or 演算子が使用されました
ko: 부호 확장된 피연산자에 비트 OR 연산자를 사용했습니다.
pl: Użyto operatora bitowego OR w argumencie operacji z rozszerzonym znakiem
pt_br: Bit a bit ou operador usado em um operando de assinatura estendida
ru: Битовая операция или оператор, использовавшийся в операнде с расширением знака
tr: İşaret genişletilmiş işlenen üzerinde bit düzeyi OR işleci kullanılıyor
zh_hans: 对进行了带符号扩展的操作数使用了按位或运算符
zh_hant: 用於 sign-extended 運算元上的 Bitwise-or 運算子

# WRN_BitwiseOrSignExtend_Description
source: The compiler implicitly widened and sign-extended a variable, and then used the resulting value in a bitwise OR operation. This can result in unexpected behavior.
cs: Kompilátor implicitně rozšířil proměnnou a doplnil k ní podpis. Výslednou hodnotu pak použil v bitovém porovnání NEBO operaci. Výsledkem může být neočekávané chování.
de: Der Compiler hat eine Variable implizit und signaturerweitert. Anschließend hat er den daraus resultierenden Wert in einem bitweisen OR-Vorgang verwendet. Das kann zu unerwartetem Verhalten führen.
es: El compilador amplió y extendió el signo de una variable. Luego, utilizó el valor resultante en una operación OR bit a bit. Esto puede provocar un comportamiento inesperado.
fr: Le compilateur a étendu une variable et son signe de façon implicite, avant d'utiliser la valeur obtenue dans une opération OR au niveau du bit. Ceci peut entraîner un comportement inattendu.
it: Il compilatore ha ampliato ed esteso con segno in modo implicito una variabile, usando quindi il valore risultante in un'operazione OR bit per bit. Questa operazione potrebbe causare comportamenti imprevisti.
ja: コンパイラは、変数を暗黙に拡張し、符号拡張してから、ビットごとの OR 演算の結果の値を使用しました。これにより、予期しない動作が発生することがあります。
ko: 컴파일러에서 변수를 암시적으로 넓히고 부호 확장한 다음 비트 OR 연산에서 결과 값을 사용했습니다. 예기치 않은 동작이 발생할 수 있습니다.
pl: Kompilator niejawnie poszerzył zmienną i rozszerzył jej znak, a następnie użył wartości wynikowej w operacji bitowej OR. Może to powodować nieoczekiwane działanie.
pt_br: O compilador ampliou e estendeu a assinatura de uma variável implicitamente, usando posteriormente o valor resultante em uma operação ou bit a bit. Isso pode resultar em um comportamento inesperado.
ru: Компилятор неявно расширил переменную с расширением знака, а затем использовал полученное значение в битовой или обычной операции. Это может вызвать непредсказуемое поведение.
tr: Derleyici bir değişkeni örtülü olarak genişletti ve işaret genişletti, ardından sonuç değerini bir bit düzeyi OR işlecinde kullandı. Bu beklenmeyen davranışa neden olabilir.
zh_hans: 编译器对某个变量进行了隐式拓展和带符号扩展，然后在按位或操作中使用生成的值。这可能会导致意外行为。
zh_hant: 編譯器會隱含地擴大，而且 sign-extended 變數，然後在位元 OR 運算中使用結果值。這可能會導致非預期的行為。

# ERR_VolatileStruct
source: '{0}': a volatile field cannot be of the type '{1}'
cs: {0}: Pole s modifikátorem volatile nemůže být {1}.
de: '"{0}": Ein flüchtiges Feld kann nicht vom Typ "{1}" sein
es: '{0}': un campo volátil no puede ser del tipo '{1}'
fr: '{0}' : un champ volatile ne peut pas être de type '{1}'
it: '{0}': un campo volatile non può essere di tipo '{1}'
ja: '{0}': volatile フィールドの型を '{1}' にすることはできません
ko: '{0}': volatile 필드는 '{1}' 형식일 수 없습니다.
pl: „{0}”: pole nietrwałe nie może być typu „{1}”
pt_br: "{0}": um campo volátil não pode ser do tipo "{1}"
ru: "{0}": изменяемое поле не может быть типа "{1}"
tr: '{0}': geçici bir alan '{1}' türüne sahip olamaz
zh_hans: “{0}”: 可变字段的类型不能是“{1}”
zh_hant: '{0}': Volatile 欄位不可為類型 '{1}'

# ERR_VolatileAndReadonly
source: '{0}': a field cannot be both volatile and readonly
cs: {0}: U pole nejde použít současně volatile i readonly.
de: '"{0}": Ein Feld kann nicht gleichzeitig flüchtig und schreibgeschützt sein.
es: '{0}': un campo no puede ser tanto volátil como de solo lectura
fr: '{0}' : un champ ne peut pas être à la fois volatile et readonly
it: '{0}': un campo non può essere sia volatile che di sola lettura
ja: '{0}': フィールドに volatile と readonly の両方を指定することはできません
ko: '{0}': 필드는 volatile이면서 readonly일 수 없습니다.
pl: „{0}”: pole nie może być jednocześnie nietrwałe i tylko do odczytu
pt_br: "{0}": um campo não pode ser volátil e somente leitura
ru: "{0}": поле не может быть одновременно изменяемым и доступным только для чтения
tr: '{0}': bir alan hem geçici hem de salt okunur olamaz
zh_hans: “{0}”: 字段不能既是可变的又是只读的
zh_hant: '{0}': 欄位不可同時為 volatile 和 readonly

# ERR_AbstractField
source: The modifier 'abstract' is not valid on fields. Try using a property instead.
cs: Modifikátor abstract není pro pole platný. Místo něho zkuste použít vlastnost.
de: Der "abstract"-Modifizierer ist für Felder nicht gültig. Verwenden Sie stattdessen eine Eigenschaft.
es: El modificador 'abstract' no es válido en los campos. Pruebe a usar una propiedad en su lugar.
fr: Le modificateur 'abstract' n'est pas valide dans les champs. Essayez d'utiliser une propriété à la place.
it: Il modificatore 'abstract' non è valido nei campi. Provare a utilizzare una proprietà.
ja: 修飾子 'abstract' はフィールドで有効ではありません。プロパティを使用してください。
ko: 필드의 'abstract' 한정자가 유효하지 않습니다. 대신 속성을 사용해 보세요.
pl: Modyfikator „abstract” w polach jest nieprawidłowy. Spróbuj zamiast niego użyć właściwości.
pt_br: O modificador 'abstract' não é válido em campos. Em vez disso, tente usar uma propriedade.
ru: Для полей модификатор метода "abstract" недопустим. Вместо этого попробуйте использовать свойство.
tr: abstract' değiştiricisi alanlarda geçerli değildir. Yerine bir özellik kullanmayı deneyin.
zh_hans: 修饰符 "abstract" 对于字段无效。请尝试改用属性。
zh_hant: 修飾元 'abstract' 在欄位上無效。請嘗試改用屬性。

# ERR_BogusExplicitImpl
source: '{0}' cannot implement '{1}' because it is not supported by the language
cs: {0} nemůže implementovat {1}, protože ho tento jazyk nepodporuje.
de: '"{1}" wird von der Sprache nicht unterstützt und kann deshalb von "{0}" nicht implementiert werden.
es: '{0}' no puede implementar '{1}' porque el idioma no lo admite
fr: '{0}' ne peut pas implémenter '{1}', car ceci n'est pas pris en charge par le langage
it: '{0}' non può implementare '{1}' perché non è supportato dal linguaggio
ja: '{0}' はこの言語でサポートされていないため、'{1}' で実装できません
ko: '{0}'은(는) 언어에서 지원되지 않으므로 '{1}'을(를) 구현할 수 없습니다.
pl: „{0}” nie może implementować „{1}”, ponieważ nie jest to obsługiwane przez język
pt_br: "{0}" não pode implementar "{1}" porque o idioma não dá suporte a ele
ru: "{0}" не удается реализовать "{1}", так как он не поддерживается в данном языке.
tr: '{0}' dil tarafından desteklenmediğinden '{1}' öğesini uygulayamıyor
zh_hans: “{0}”无法实现“{1}”，因为该语言不支持它
zh_hant: '{0}' 不可實作 '{1}'，因為此語言不支援它

# ERR_ExplicitMethodImplAccessor
source: '{0}' explicit method implementation cannot implement '{1}' because it is an accessor
cs: 'Explicitní implementace metody {0} nemůže implementovat {1}, protože se jedná o přistupující objekt.
de: 'Die explizite Methodenimplementierung "{0}" ist ein Accessor und kann "{1}" daher nicht implementieren.
es: 'La implementación del método explícito '{0}' no puede implementar '{1}' porque es un descriptor de acceso
fr: 'L'implémentation de la méthode explicite '{0}' ne peut pas implémenter '{1}', car il s'agit d'un accesseur
it: 'L'implementazione esplicita del metodo '{0}' non può implementare '{1}' perché è una funzione di accesso
ja: '{0}' 明示的なメソッドの実装で、アクセサーである '{1}' を実装することはできません
ko: '명시적 메서드 구현에서 '{0}'은(는) 접근자이므로 '{1}'을(를) 구현할 수 없습니다.
pl: 'Jawna implementacja metody „{0}” nie może implementować elementu „{1}”, ponieważ jest to metoda dostępu
pt_br: 'A implementação de método explícito "{0}" não pode implementar "{1}" porque é um acessador
ru: 'Невозможно реализовать "{0}" через явную реализацию метода "{1}", так как он является методом доступа.
tr: '{0}' açık yöntem uygulaması, bir erişimci olduğundan '{1}' öğesini uygulayamaz
zh_hans: “{0}”显式方法实现无法实现“{1}”，因为它是一个访问器
zh_hant: '{0}' 明確方法實作無法實作 '{1}'，因為其為存取子

# WRN_CoClassWithoutComImport
source: '{0}' interface marked with 'CoClassAttribute' not marked with 'ComImportAttribute'
cs: 'Rozhraní {0} s deklarací CoClassAttribute neobsahuje deklaraci ComImportAttribute.
de: 'Die {0}-Schnittstelle wurde mit CoClassAttribute und nicht mit ComImportAttribute markiert.
es: 'La interfaz '{0}' marcada con 'CoClassAttribute' no está marcada con 'ComImportAttribute'
fr: 'Interface '{0}' marquée avec 'CoClassAttribute' et non avec 'ComImportAttribute'
it: 'L'interfaccia '{0}' contrassegnata con 'CoClassAttribute' non è contrassegnata con 'ComImportAttribute'
ja: '{0}' インターフェイスは、'CoClassAttribute' でマークされていますが、'ComImportAttribute' ではマークされていません
ko: '{0}' 인터페이스는 'CoClassAttribute'로 표시되어 있고 'ComImportAttribute'로 표시되어 있지 않습니다.
pl: 'Interfejs „{0}” z oznaczeniem „CoClassAttribute” nie ma oznaczenia „ComImportAttribute”
pt_br: "{0}" interface marcada com "CoClassAttribute" não marcada com "ComImportAttribute"
ru: '"Интерфейс "{0}" помечен с помощью "CoClassAttribute" и не помечен с помощью "ComImportAttribute".
tr: '{0}' arabirimi 'CoClassAttribute' ile işaretlenmiş 'ComImportAttribute' ile işaretlenmemiş
zh_hans: “{0}”接口标记为“CoClassAttribute”而不是“ComImportAttribute”
zh_hant: '{0}' 介面標記為 'CoClassAttribute'，而非標記為 'ComImportAttribute'

# WRN_CoClassWithoutComImport_Title
source: Interface marked with 'CoClassAttribute' not marked with 'ComImportAttribute'
cs: Rozhraní s deklarací CoClassAttribute neobsahuje deklaraci ComImportAttribute.
de: Schnittstelle markiert mit 'CoClassAttribute', nicht mit 'ComImportAttribute'
es: La interfaz marcada con el atributo 'CoClassAttribute' no está marcada con el atributo 'ComImportAttribute'
fr: Interface marquée avec 'CoClassAttribute' et non avec 'ComImportAttribute'
it: L'interfaccia contrassegnata con 'CoClassAttribute' non è contrassegnata con 'ComImportAttribute'
ja: インターフェイスは、'ComImportAttribute' ではなく、'CoClassAttribute' に設定されました
ko: 인터페이스는 'CoClassAttribute'로 표시되어 있고 'ComImportAttribute'로 표시되어 있지 않습니다.
pl: Interfejs z oznaczeniem „CoClassAttribute” nie ma oznaczenia „ComImportAttribute”
pt_br: Interface marcada com 'CoClassAttribute', não com 'ComImportAttribute'
ru: Интерфейс, помеченный как CoClassAttribute, не помечен как ComImportAttribute
tr: CoClassAttribute' ile işaretlenen arabirim 'ComImportAttribute' ile işaretlenmedi
zh_hans: 接口标记为 "CoClassAttribute" 而不是 "ComImportAttribute"
zh_hant: 介面標記為 'CoClassAttribute'，而非標記為 'ComImportAttribute'

# ERR_ConditionalWithOutParam
source: Conditional member '{0}' cannot have an out parameter
cs: Podmíněný člen {0} nemůže mít parametr out.
de: Der bedingte Member "{0}" kann keinen out-Parameter enthalten.
es: El miembro condicional '{0}' no puede tener ningún parámetro out
fr: Le membre conditionnel '{0}' ne peut pas avoir un paramètre out
it: Il membro condizionale '{0}' non può avere un parametro out
ja: 条件付きメンバー '{0}' には out パラメーターを指定できません
ko: {0}' 조건부 멤버에는 out 매개 변수를 사용할 수 없습니다.
pl: Warunkowa składowa „{0}” nie może mieć parametru wyjściowego
pt_br: Membro condicional "{0}" não pode ter um parâmetro out
ru: Член с атрибутом Conditional "{0}" не может иметь параметр с ключевым словом out.
tr: {0}' Conditional üyesinin out parametresi olamaz
zh_hans: 条件成员“{0}”不能有 out 参数
zh_hant: Conditional 成員 '{0}' 不可有 out 參數

# ERR_AccessorImplementingMethod
source: Accessor '{0}' cannot implement interface member '{1}' for type '{2}'. Use an explicit interface implementation.
cs: Přistupující objekt {0} nemůže implementovat člen rozhraní {1} pro typ {2}. Použijte explicitní implementaci rozhraní.
de: Accessor "{0}" kann Schnittstellenmember "{1}" für Typ "{2}" nicht implementieren. Verwenden Sie eine explizite Schnittstellenimplementierung.
es: El descriptor de acceso '{0}' no puede implementar el miembro de interfaz '{1}' para el tipo '{2}'. Use una implementación de interfaz explícita.
fr: L'accesseur '{0}' ne peut pas implémenter le membre d'interface '{1}' pour le type '{2}'. Utilisez une implémentation d'interface explicite.
it: La funzione di accesso '{0}' non può implementare il membro di interfaccia '{1}' per il tipo '{2}'. Usare un'implementazione esplicita dell'interfaccia.
ja: アクセサー '{0}' は、インターフェイス メンバー '{1}' を型 '{2}' に対して実装できません。明示的なインターフェイスの実装を使用してください。
ko: {0}' 접근자는 '{2}' 형식에 대해 '{1}' 인터페이스 멤버를 구현할 수 없습니다. 명시적 인터페이스 구현을 사용하세요.
pl: Metoda dostępu „{0}” nie może implementować składowej interfejsu „{1}” dla typu „{2}”. Należy użyć implementacji interfejsu jawnego.
pt_br: O acessador "{0}" não pode implementar membro de interface "{1}" para o tipo "{2}". Use uma implementação de interface explícita.
ru: Метод доступа "{0}" не может реализовать член интерфейса "{1}" для типа "{2}". Используйте явную реализацию интерфейса.
tr: {0}' erişimcisi '{2}' türü için '{1}' arabirim üyesini uygulayamıyor. Açık bir arabirim uygulaması kullanın.
zh_hans: 访问器“{0}”无法实现类型“{2}”的接口成员“{1}” 请使用显式接口实现。
zh_hant: 存取子 '{0}' 無法為類型 '{2}' 實作介面成員 '{1}'。請使用明確的介面實作。

# ERR_AliasQualAsExpression
source: The namespace alias qualifier '::' always resolves to a type or namespace so is illegal here. Consider using '.' instead.
cs: Kvalifikátor aliasu oboru názvů (::) se vždycky vyhodnotí jako typ nebo obor názvů, takže je tady neplatný. Místo něho zvažte použití kvalifikátoru . (tečka).
de: Der Namespacealias-Qualifizierer "::" wird immer zu einem Typ oder Namespace aufgelöst und ist somit an dieser Stelle ungültig. Verwenden Sie stattdessen ".".
es: El calificador de alias del espacio de nombres '::' siempre se resuelve en un tipo o espacio de nombres, por tanto, aquí no es válido. En su lugar puede usar '.'.
fr: Le qualificateur d'alias d'espace de noms '::' est toujours résolu en type ou en espace de noms ; il est donc non conforme ici. Utilisez '.' à la place.
it: Il qualificatore di alias '::' dello spazio dei nomi viene sempre risolto in un tipo o in uno spazio dei nomi e non è pertanto valido in questa posizione. Si consiglia di utilizzare '.'.
ja: 名前空間エイリアス修飾子 '::' は、常に型または名前空間を解決するので、ここでは無効です。'.' を使用してください。
ko: 네임스페이스 별칭 한정자 '::'은 항상 형식 또는 네임스페이스를 확인하므로 여기에 사용할 수 없습니다. 대신 '.'를 사용하세요.
pl: Kwalifikator aliasu przestrzeni nazw „::” jest zawsze rozpoznawany jako typ lub przestrzeń nazw, dlatego jest tutaj niedozwolony. Zamiast niego rozważ możliwość użycia kwalifikatora „.”.
pt_br: O qualificador alias de namespace '::' sempre é resolvido em um tipo ou namespace, por isso é inválido aqui. Use '.' em seu lugar.
ru: Квалификатор псевдонима пространства имен "::" всегда разрешается в тип или пространство имен, что в данном случае недопустимо. Рассмотрите возможность использования ".".
tr: Ad uzayı diğer ad niteleyicisi '::' her zaman bir türe veya ad alanına çözümlendiğinden burada geçersizdir. Yerine '.' kullanabilirsiniz.
zh_hans: 命名空间别名限定符 "::" 始终解析为类型或命名空间，因此在这里是非法的。请考虑改用 "."。
zh_hant: 命名空間別名限定詞 '::' 一定會解析為類型或命名空間，所以不能用在這裡。請考慮用 '.' 替代。
