Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_UnsupportedCompilerFeature
source: '{0}' requires compiler feature '{1}', which is not supported by this version of the C# compiler.
cs: {0} vyžaduje funkci kompilátoru {1}, což tato verze kompilátoru C# nepodporuje.
fr: '{0}' nécessite la fonctionnalité de compilateur '{1}', qui n’est pas prise en charge par cette version du compilateur C#.
it: '{0}' richiede la funzionalità del compilatore '{1}', che non è supportata da questa versione del compilatore C#.
ja: '{0}' にはコンパイラ機能 '{1}' が必要ですが、このバージョンのC## コンパイラではサポートされていません。
pl: „{0}” wymaga funkcji kompilatora „{1}”, która nie jest obsługiwana przez tę wersję kompilatora języka C#.
pt_br: '{0}' requer o recurso de compilador '{1}', o que não é suportado por esta versão do compilador de C#.
ru: Для "{0}" требуется функция компилятора "{1}", которая не поддерживается в этой версии компилятора C#.
zh_hans: '{0}' 需要编译器功能 '{1}'，此版本的 C# 编译器不支持此功能。
zh_hant: '{0}' 需要編譯器功能 '{1}'，此版本的 C# 編譯器不支援此功能。

# ERR_UnsupportedFeatureInRuntimeAsync
source: Method '{0}' uses a feature that is not supported by runtime async currently. Opt the method out of runtime async by attributing it with 'System.Runtime.CompilerServices.RuntimeAsyncMethodGenerationAttribute(false)'.
pt_br: O método "{0}" usa um recurso que não é suportado pelo runtime assíncrono no momento. Recuse o método de runtime assíncrono atribuindo-o a "System.Runtime.CompilerServices.RuntimeAsyncMethodGenerationAttribute(false)".

# ERR_UnsupportedPrimaryConstructorParameterCapturingRef
source: Cannot use ref, out, or in primary constructor parameter '{0}' inside an instance member
cs: Uvnitř členu instance nejde použít parametr primárního konstruktoru {0} typu odkaz, výstup nebo vstup.
fr: Impossible d’utiliser le paramètre de constructeur principal '{0}' avec ref, out ou in à l’intérieur d’un membre d’instance.
it: Non è possibile usare il parametro ref, out o in del costruttore primario '{0}' all'interno di un membro di istanza
ja: インスタンス メンバー内のプライマリ コンストラクター パラメーター '{0}' では ref、out、in を使用できません
pl: Nie można użyć ref, out lub w podstawowym parametrze konstruktora '{0}' wewnątrz elementu członkowskiego wystąpienia
pt_br: Não é possível usar ref, out ou no parâmetro de construtor primário "{0}" dentro de um membro da instância
ru: Невозможно использовать параметр основного конструктора "{0}" с модификаторами ref, out или in внутри элемента экземпляра
zh_hans: 无法在实例成员内的主构造函数参数 “{0}” 中使用 ref、out 或
zh_hant: 無法在執行個體成員內使用 ref、out 或 in 主要建立建構函式參數 '{0}'

# ERR_UnsupportedPrimaryConstructorParameterCapturingRefAny
source: Cannot use primary constructor parameter of type '{0}' inside an instance member
fr: Impossible d'utiliser le paramètre de constructeur principal de type '{0}' dans un membre d'instance
it: Non è possibile usare il parametro del costruttore primario di tipo '{0}' all'interno di un membro di istanza
ja: インスタンス メンバー内に ref に似た型を持つプライマリ コンストラクター パラメーター '{0}' を使用することはできません
pl: Nie można użyć podstawowego parametru konstruktora typu „{0}” wewnątrz składowej wystąpienia
pt_br: Não é possível usar o parâmetro de construtor primário do tipo '{0}' dentro de um membro da instância
ru: Невозможно использовать первичный параметр конструктора типа "{0}" внутри элемента экземпляра
zh_hans: 无法在实例成员中使用类型为 "{0}" 的主构造函数参数
zh_hant: 無法使用執行個體成員內類型 '{0}' 的主要建構函式參數

# ERR_UnsupportedPrimaryConstructorParameterCapturingRefLike
source: Cannot use primary constructor parameter '{0}' that has ref-like type inside an instance member
cs: Nejde použít parametr primárního konstruktoru {0}, který má uvnitř členu instance typ podobný odkazu.
fr: Nous n’avons pas pu utiliser le paramètre de constructeur principal '{0}' qui a un type de référence similaire à l’intérieur d’un membre d’instance
it: Non è possibile usare il parametro del costruttore primario '{0}' con un tipo simile a ref all'interno di un membro di istanza
ja: インスタンス メンバー内に ref に似た型を持つプライマリ コンストラクター パラメーター '{0}' を使用することはできません
pl: Nie można użyć podstawowego parametru konstruktora '{0}', który ma typ przypominający odwołanie wewnątrz składowej wystąpienia
pt_br: Não é possível usar o parâmetro de construtor primário "{0}" que tem o tipo ref-like dentro de um membro de instância
ru: Невозможно использовать параметр основного конструктора "{0}" типа ref-like внутри элемента экземпляра
zh_hans: 无法使用实例成员内具有 ref-like 类型的主构造函数参数 “{0}”
zh_hant: 無法使用執行個體成員內具有類似參考類型的主要建立函式參數 '{0}'

# ERR_UnsupportedTypeForListPattern
source: List patterns may not be used for a value of type '{0}'.
cs: Vzory seznamů se nedají používat pro hodnotu typu {0}.
fr: Les modèles de liste ne peuvent pas être utilisés pour une valeur de type '{0}'.
it: Non è possibile usare i modelli di elenco per un valore di tipo '{0}'.
ja: リスト パターンは、'{0}' 型の値に使用されない可能性があります。
pl: Wzorców list nie można używać na potrzeby wartości typu „{0}”.
pt_br: Os padrões de lista não podem ser usados para um valor do tipo '{0}'.
ru: Шаблоны списка не могут использоваться для значений типа "{0}".
zh_hans: 列表模式不能用于类型为“{0}”的值。
zh_hant: 類型 '{0}' 的值不可使用清單模式。

# ERR_UnterminatedRawString
source: Unterminated raw string literal.
cs: Neukončený literál nezpracovaného řetězce.
fr: Littéral de chaîne brute inachevé.
it: Valore letterale stringa senza terminazione.
ja: 生文字列リテラルが終了していません。
pl: Niezakończony literał ciągu znaków.
pt_br: Literal de cadeia de caracteres não terminada.
ru: Незавершенный литерал необработанной строки.
zh_hans: 未终止的字符串字面量。
zh_hant: 未結束的原始字串常值。

# ERR_UseDefViolationFieldUnsupportedVersion
source: Use of possibly unassigned field '{0}'. Consider updating to language version '{1}' to auto-default the field.
cs: Použití potenciálně nepřiřazeného pole {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení pole.
fr: Utilisation d’un '{0}' de champ éventuellement non attribué. Envisagez de mettre à jour vers la version de langage '{1}' pour utiliser la valeur par défaut automatique du champ.
it: Uso del campo probabilmente non assegnato '{0}'. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente il campo come predefinito.
ja: 割り当てられていない可能性のあるフィールド '{0}' を使用しています。フィールドを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanego pola „{0}”. Rozważ zaktualizowanie pola do wersji językowej „{1}”, aby automatycznie ustawić domyślne pole.
pt_br: Uso de campo possivelmente não atribuído '{0}'. Considere atualizar para a versão de linguagem '{1}' para auto-padrão do campo.
ru: Используется поле "{0}", которое может быть не назначено. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未分配的字段 '{0}'。请考虑更新到语言版本 '{1}' 以自动默认字段。
zh_hant: 使用可能未指派的欄位 '{0}'。請考慮更新語言版本 '{1}' 以自動預設欄位。

# ERR_UseDefViolationPropertyUnsupportedVersion
source: Use of possibly unassigned auto-implemented property '{0}'. Consider updating to language version '{1}' to auto-default the property.
cs: Použití potenciálně nepřiřazené automaticky implementované vlastnosti {0}. Zvažte aktualizaci jazykové verze {1} na automaticky výchozí vlastnost.
fr: Utilisation de la propriété implémentée automatiquement «{0}» éventuellement non assignée. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement la propriété par défaut.
it: Utilizzo della proprietà implementata automaticamente probabilmente non assegnata '{0}'. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente la proprietà come predefinita.
ja: 割り当てられていない可能性のある自動実装プロパティ '{0}' を使用しています。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości „{0}”. Rozważ zaktualizowanie do wersji językowej „{1}”, aby automatycznie ustawić domyślną właściwości.
pt_br: O uso de propriedade auto-implementada possivelmente não atribuída '{0}'. Considere atualizar para a versão de linguagem '{1}' para auto-padrão da propriedade.
ru: Используется автоматически реализуемое свойство "{0}", которое может быть не назначено. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未赋值的自动实现的属性 '{0}'。请考虑更新到语言版本 '{1}' 以自动默认属性。
zh_hant: 使用可能未指派的自動實作屬性 '{0}'。請考慮更新語言版本 '{1}' 以自動預設屬性。

# ERR_UseDefViolationThisUnsupportedVersion
source: The 'this' object cannot be used before all of its fields have been assigned. Consider updating to language version '{0}' to auto-default the unassigned fields.
cs: Objekt this nelze použít před přiřazením všech jeho polí. Zvažte aktualizaci na jazykovou verzi {0} na automatické výchozí nastavení nepřiřazených polí.
fr: Impossible d’utiliser l’objet 'this' avant l’affectation de tous ses champs. Envisagez de mettre à jour vers la version de langage '{0}' pour définir automatiquement les champs non attribués par défaut.
it: Impossibile utilizzare l'oggetto 'this' prima dell'assegnazione di tutti i relativi campi. Provare a eseguire l'aggiornamento alla versione del linguaggio '{0}' per impostare come predefiniti automaticamente i campi non assegnati.
ja: すべてのフィールドが割り当てられる前に、'this' オブジェクトを使用することはできません。割り当てられていないフィールドを自動既定値にするため '{0}' 言語バージョンに更新することを検討してください。
pl: Nie można użyć obiektu „this” przed przypisaniem wszystkich jego pól. Rozważ zaktualizowanie nieprzypisanych pól do wersji językowej „{0}”, aby automatycznie ustawić domyślne pola niezaznaczone.
pt_br: O objeto 'this' não pode ser usado antes que todos os seus campos serem atribuídos. Considere atualizar para a versão de linguagem '{0}' para auto-padrão dos campos não atribuídos.
ru: Нельзя использовать объект "this", пока не будут назначены все его поля. Попробуйте обновить до языковой версии "{0}", чтобы автоматически применить значения по умолчанию к неназначенным полям.
zh_hans: 在分配“this”对象的所有字段之前，无法使用该对象。请考虑更新到语言版本 '{0}' 以自动默认未分配的字段。
zh_hant: 在指派 'this' 物件的所有欄位之前，無法使用該物件。請考慮更新語言版本 '{0}'，以自動預設未指派的欄位。

# ERR_ValueParameterSameNameAsExtensionParameter
source: 'value': an automatically-generated parameter name conflicts with an extension parameter name
pt_br: "value": um nome de parâmetro gerado automaticamente está em conflito com um nome de parâmetro de extensão

# ERR_ValueParameterSameNameAsExtensionTypeParameter
source: 'value': an automatically-generated parameter name conflicts with an extension type parameter name
pt_br: "value": um nome de parâmetro gerado automaticamente está em conflito com um nome de parâmetro de tipo de extensão

# ERR_VariableDeclarationNamedField
source: In language version {0}, 'field' is a keyword within a property accessor. Rename the variable or use the identifier '@field' instead.
pt_br: Na versão do idioma {0}, "field" é uma palavra-chave dentro de um acessador de propriedade. Renomeie a variável ou use o identificador "@field".

# ERR_WrongArityAsyncReturn
source: A generic task-like return type was expected, but the type '{0}' found in 'AsyncMethodBuilder' attribute was not suitable. It must be an unbound generic type of arity one, and its containing type (if any) must be non-generic.
cs: Očekával se obecný návratový typ podobný úloze, ale typ {0} nalezený v atributu AsyncMethodBuilder nebyl vhodný. Musí se jednat o nevázaný obecný typ arity a jeho nadřazený typ (pokud existuje) nesmí být obecný.
fr: Un type de retour de type tâche générique est attendu, mais le type « {0} » trouvé dans l’attribut ’AsyncMethodBuilder’ n’était pas approprié. Il doit s’agir d’un type générique indépendant d’arité One, et son type conteneur (le cas échéant) doit être non générique.
it: È previsto un tipo restituito simile a un'attività generica, ma il tipo '{0}' trovato nell'attributo 'AsyncMethodBuilder' non è idoneo. Deve essere un tipo generico non associato di grado uno e il tipo che lo contiene (se presente) deve essere non generico.
ja: 汎用タスクのような戻り値の型が必要ですが、'AsyncMethodBuilder' 属性で見つかった型 '{0}' が適切ではありませんでした。アリティの非バインド ジェネリック型である必要があり、それを含む型 (存在する場合) は非ジェネリックでなければなりません。
pl: Oczekiwano zwracanego typu podobnego do zadania ogólnego, ale typ "{0}" znaleziony w atrybucie "AsyncMethodBuilder" był nieodpowiedni. Musi to być niepowiązany typ ogólny jednego argumentu, a zawarty w nim typ (jeśli występuje), nie może być ogólny.
pt_br: Um tipo de retorno semelhante à tarefa genérica era esperado, mas o tipo '{0}' encontrado no atributo 'AsyncMethodBuilder' não era adequado. Ele deve ser um tipo genérico não associado de arity um e seu tipo recipiente (se houver) deve ser não genérico.
ru: Ожидался универсальный возвращаемый тип, схожий с задачей, но тип "{0}", обнаруженный в атрибуте "AsyncMethodBuilder", не подходит. Требуется неограниченный универсальный тип c арностью 1, а его содержащий тип (если есть) не должен быть универсальным
zh_hans: 应为泛用类任务返回类型，但在“AsyncMethodBuilder”属性中发现的类型“{0}”不合适。它必须是 arity one 的未绑定泛型类型，并且其包含类型(如果有)必须为非泛用。
zh_hant: 應存在類似泛型工作的傳回型別，但在 'AsyncMethodBuilder' 屬性中找到的類型 '{0}' 不適用。它必須是 arity one 的未綁定泛型型別，並且其包含類型 (如果有) 必須是非泛型。

# HDN_DuplicateWithGlobalUsing
source: The using directive for '{0}' appeared previously as global using
cs: Direktiva using pro {0} se dříve zobrazovala jako globální direktiva using.
fr: La directive using pour « {0} » est apparue précédemment comme using global
it: La direttiva using per '{0}' è già presente come using globale
ja: '{0}' の using ディレクティブは、以前に global using として使用されています
pl: Dyrektywa użycia w przypadku "{0}" pojawiła się wcześniej jako użycie globalne
pt_br: A diretiva using para '{0}' apareceu anteriormente como using global
ru: Директива using "{0}" ранее использовалась в качестве глобальной
zh_hans: “{0}”的 Using 指令在以前显示为全局使用
zh_hant: '{0}' 的 using 指示詞先前顯示為全域 using

# HDN_DuplicateWithGlobalUsing_Title
source: The using directive appeared previously as global using
cs: Direktiva using se dříve zobrazovala jako globální direktiva using
fr: La directive using est apparue précédemment comme using global
it: La direttiva using è già presente come using globale
ja: using ディレクティブは、以前に global using として使用されています
pl: Dyrektywa użycia pojawiła się wcześniej jako użycie globalne
pt_br: A diretiva using apareceu anteriormente como using global
ru: Директива using ранее использовалась в качестве глобальной
zh_hans: Using 指令在以前显示为全局使用
zh_hant: Using 指示詞先前顯示為全域 using

# HDN_RedundantPattern
source: The pattern is redundant.
pt_br: O padrão é redundante.

# HDN_RedundantPatternStackGuard
source: The pattern is too complex to analyze for redundancy.
pt_br: O padrão é muito complexo para analisar a redundância.

# HDN_RedundantPatternStackGuard_Title
source: The pattern is too complex to analyze for redundancy.
pt_br: O padrão é muito complexo para analisar a redundância.

# HDN_RedundantPattern_Title
source: The pattern is redundant.
pt_br: O padrão é redundante.

# IDS_ArrayAccess
source: array access
cs: přístup k poli
fr: accès au tableau
it: accesso all'array
ja: 配列アクセス
pl: dostęp do macierzy
pt_br: acesso à matriz
ru: доступ к массиву
zh_hans: 数组访问
zh_hant: 陣列存取

# IDS_AsyncMethodBuilderOverride
source: async method builder override
cs: přepsání tvůrce asynchronní metody
fr: Remplacement du générateur de méthode asynchrone
it: override del generatore di metodi asincroni
ja: 非同期メソッド ビルダーのオーバーライド
pl: zastąpienie konstruktora metodą asynchroniczną
pt_br: substituição do construtor de método assíncrono
ru: переопределение построителя методов async
zh_hans: 异步方法生成器替代
zh_hant: 非同步方法建立器覆寫

# IDS_CollectionExpression
source: collection expression
pt_br: expressão de coleção

# IDS_FeatureAllowsRefStructConstraint
source: allows ref struct constraint
fr: autorise la contrainte de struct ref
it: consente il vincolo di struct di riferimento
pl: zezwala na ograniczenie ref struct
pt_br: permite a restrição de ref struct
ru: разрешает ограничение структуры "ref"
zh_hans: 允许 ref struct 约束
zh_hant: 允許參考結構限制式

# IDS_FeatureAutoDefaultStructs
source: auto default struct fields
cs: pole s automatickou výchozí strukturou
fr: champs de struct par défaut automatique
it: campi struct predefiniti in automatico
ja: 自動既定の構造体フィールド
pl: pola automatycznej struktury domyślnej
pt_br: campos de struct para auto-padrão
ru: автоматически применять значения по умолчанию к полям структуры
zh_hans: 自动默认结构字段
zh_hant: 自動預設結構欄位

# IDS_FeatureCheckedUserDefinedOperators
source: checked user-defined operators
cs: zaškrtnuté uživatelem definované operátory
fr: opérateurs définis par l’utilisateur vérifiés
it: operatori definiti dall'utente controllati
ja: チェックされたユーザー定義演算子
pl: zaznaczone operatory zdefiniowane przez użytkownika
pt_br: operadores verificados, definidos pelo usuário
ru: проверенные операторы, определяемые пользователем
zh_hans: 选中的用户定义运算符
zh_hant: 已檢查使用者定義的運算子

# IDS_FeatureCollectionExpressions
source: collection expressions
fr: expressions de collection
it: espressioni di raccolta
pl: wyrażenia kolekcji
pt_br: expressões de coleção
ru: выражения коллекции
zh_hans: 集合表达式
zh_hant: 集合運算式

# IDS_FeatureCovariantReturnsForOverrides
source: covariant returns
cs: kovariantní návratové hodnoty
fr: retours covariants
it: tipi restituiti covarianti
ja: covariant の戻り値
pl: zwroty kowariantne
pt_br: retornos de covariante
ru: ковариантные возвращаемые значения
zh_hans: 协变返回
zh_hant: Covariant 傳回

# IDS_FeatureDiscards
source: discards
fr: discards (éléments ignorés)
it: rimozioni
ja: ディスカード
pl: odrzucenia
pt_br: descarte
ru: пустые переменные
zh_hans: 弃元
zh_hant: Discard

# IDS_FeatureDisposalPattern
source: pattern-based disposal
cs: vyřazení na základě vzoru
fr: élimination basée sur un modèle
it: eliminazione basata su criteri
ja: パターン ベースの廃棄
pl: likwidacja oparta na wzorcu
pt_br: descarte baseado em padrões
ru: аннулирование на основе шаблона
zh_hans: 基于模式的处置
zh_hant: 模式型處置

# IDS_FeatureExtendedPropertyPatterns
source: extended property patterns
cs: vzory rozšířených vlastností
fr: modèles de propriétés étendues
it: criteri di proprietà estesa
ja: 拡張プロパティ パターン
pl: wzorce właściwości rozszerzonych
pt_br: padrões de propriedade estendida
ru: шаблоны расширенных свойств
zh_hans: 扩展的属性模式
zh_hant: 擴充屬性模式

# IDS_FeatureExtensions
source: extensions
pt_br: extensões

# IDS_FeatureFieldKeyword
source: field keyword
fr: mot-clé du champ
it: parola chiave campo
pl: słowo kluczowe pola
pt_br: campo palavra-chave
ru: ключевое слово поля
zh_hans: 字段关键字

# IDS_FeatureFileScopedNamespace
source: file-scoped namespace
cs: obor názvů pro celý soubor
fr: espace de noms inclus dans l'étendue de fichier
it: spazio dei nomi con ambito file
ja: ファイルスコープの名前空間
pl: przestrzeń nazw z określonym zakresem plików
pt_br: namespace de escopo de arquivo
ru: пространство имен с файловой областью
zh_hans: 文件范围内的命名空间
zh_hant: 以檔案為範圍的命名空間

# IDS_FeatureFileTypes
source: file types
cs: typy souborů
fr: types de fichier
it: tipi di file
ja: ファイルの種類
pl: typy plików
pt_br: tipos de arquivo
ru: типы файлов
zh_hans: 文件类型
zh_hant: 檔案類型

# IDS_FeatureFirstClassSpan
source: first-class Span types
fr: types Span de première classe
it: tipi Span di prima classe
pt_br: tipos de Span de primeira classe
ru: типы диапазона первого класса
zh_hans: 一流范围类型

# IDS_FeatureGenericAttributes
source: generic attributes
cs: obecné atributy
fr: attributs génériques
it: attributi generici
ja: 汎用属性
pl: atrybuty ogólne
pt_br: atributos genéricos
ru: универсальные атрибуты
zh_hans: 通用属性
zh_hant: 一般屬性

# IDS_FeatureGlobalUsing
source: global using directive
cs: globální direktiva using
fr: directive using globale
it: direttiva using globale
ja: グローバル using ディレクティブ
pl: globalne przy użyciu dyrektywy
pt_br: diretiva de uso global
ru: глобальная директива using
zh_hans: 全局 using 指令
zh_hant: 全域 using 指示詞

# IDS_FeatureImplicitIndexerInitializer
source: implicit indexer initializer
fr: initialiseur d’indexeur implicite
it: inizializzatore indicizzatore implicito
pl: niejawny inicjator indeksatora
pt_br: inicializador de indexador implícito
ru: неявный инициализатор индексатора
zh_hans: 隐式索引器初始值设定项
zh_hant: 隱含索引子初始設定式

# IDS_FeatureImplicitObjectCreation
source: target-typed object creation
cs: Vytvoření objektu s cílovým typem
fr: création d'un objet typé cible
it: creazione di oggetti con tipo di destinazione
ja: target-typed オブジェクトの作成
pl: tworzenie obiektu z typem docelowym
pt_br: criação de objeto de tipo de destino
ru: создание объекта с типом целевого объекта
zh_hans: 创建目标类型对象
zh_hant: 建立具目標類型的物件

# IDS_FeatureImprovedInterpolatedStrings
source: interpolated string handlers
cs: obslužné rutiny interpolovaných řetězců
fr: gestionnaires de chaînes interpolées
it: gestori di stringhe interpolate
ja: 補間された文字列ハンドラー
pl: procedury obsługi ciągów interpolowanych
pt_br: manipuladores de cadeia de caracteres interpolada
ru: обработчики интерполированных строк
zh_hans: 内插字符串处理程序
zh_hant: 差補字串處理常式

# IDS_FeatureInferredDelegateType
source: inferred delegate type
cs: odvozený typ delegáta
fr: type délégué déduit
it: tipo di delegato dedotto
ja: 推論されたデリゲート型
pl: Typ delegowania wywnioskowanego
pt_br: tipo representante inferido
ru: выводимый тип делегата
zh_hans: 推断的委托类型
zh_hant: 推斷委派類型

# IDS_FeatureInlineArrays
source: inline arrays
fr: tableaux en ligne
it: matrici inline
ja: インライン配列
pl: tablice śródwierszowe
pt_br: matrizes embutidas
ru: встроенные массивы
zh_hans: 内联数组
zh_hant: 內嵌陣列

# IDS_FeatureInstanceMemberInNameof
source: instance member in 'nameof'
fr: membre d'instance dans 'nameof'
it: membro di istanza in 'nameof'
ja: 'nameof' のインスタンス メンバー
pl: składowa wystąpienia w elemencie „nameof”
pt_br: membro da instância em 'nameof'
ru: элемент экземпляра в "nameof"
zh_hans: "nameof" 中的实例成员
zh_hant: 'nameof' 中的執行個體成員

# IDS_FeatureLambdaOptionalParameters
source: lambda optional parameters
cs: volitelné parametry lambda
fr: paramètres optionnels d’expression lambda
it: parametri facoltativi lambda
ja: ラムダの省略可能なパラメーター
pl: opcjonalne parametry wyrażenia lambda
pt_br: Parâmetros opcionais lambda
ru: дополнительные параметры лямбды
zh_hans: lambda 可选参数
zh_hant: Lambda 選用參數

# IDS_FeatureLambdaParamsArray
source: lambda params array
cs: pole parametrů lambda
fr: tableau des paramètres de l’expression lambda
it: matrice di parametri lambda
ja: ラムダ パラメーター配列
pl: tablica parametrów lambda
pt_br: Matriz de parâmetros lambda
ru: массив лямбда-параметров
zh_hans: lambda 参数数组
zh_hant: Lambda 參數陣列

# IDS_FeatureLambdaReturnType
source: lambda return type
cs: návratový typ lambda
fr: type de retour lambda
it: tipo restituito dell'espressione lambda
ja: ラムダ戻り値の型
pl: zwracany typ lambda
pt_br: tipo de retorno de lambda
ru: тип возвращаемого значения лямбда
zh_hans: lambda 返回类型
zh_hant: lambda 傳回型別

# IDS_FeatureListPattern
source: list pattern
cs: vzor seznamu
fr: modèle de liste
it: modello di elenco
ja: リスト パターン
pl: wzorzec listy
pt_br: padrão de lista
ru: шаблон списка
zh_hans: 列表模式
zh_hant: 清單模式

# IDS_FeatureLockObject
source: Lock object
fr: Verrouiller des objets
it: Blocca oggetto
pl: Zablokuj obiekt
pt_br: Bloquear objeto
ru: Блокировать объект
zh_hans: 锁定对象
zh_hant: 鎖定物件

# IDS_FeatureNewLinesInInterpolations
source: newlines in interpolations
cs: nové řádky v interpolacích
fr: sauts de ligne dans les interpolations
it: nuove linee nelle interpolazioni
ja: 補間における改行
pl: nowe wiersze w interpolacjach
pt_br: novas linhas em interpolações
ru: новые линии в интерполяции
zh_hans: 内插中的换行符
zh_hant: 插補中的新行

# IDS_FeatureNullConditionalAssignment
source: null conditional assignment
pt_br: atribuição condicional nula

# IDS_FeatureOverloadResolutionPriority
source: overload resolution priority
fr: priorité de résolution de surcharge
it: priorità di risoluzione dell'overload
pt_br: Prioridade de resolução de sobrecarga
ru: приоритет разрешения перегрузки
zh_hans: 重载解析优先级
