Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ReturnNotNullIfNotNull_Title
source: Return value must be non-null because parameter is non-null.
cs: Návratová hodnota musí být jiná než null, protože parametr není null
fr: La valeur de retour doit être non null, car le paramètre a une valeur non null.
it: Il valore restituito deve essere non Null perché il parametro è non Null.
ja: パラメーターが null 以外であるため、戻り値は null 以外でなければなりません。
pl: Wartość zwracana musi być inna niż null, ponieważ parametr ma wartość inną niż null.
pt_br: O valor retornado precisa ser não nulo porque o parâmetro não é nulo.
ru: Возвращаемое значение должно быть отлично от NULL, так как параметр имеет значение, отличное от NULL.
zh_hans: 由于参数为非 null，因此返回值必须为非 null。
zh_hant: 因為參數不是 null，所以傳回值必須非 null。

# WRN_ScopedMismatchInParameterOfOverrideOrImplementation
source: The 'scoped' modifier of parameter '{0}' doesn't match overridden or implemented member.
cs: Modifikátor scoped parametru {0} neodpovídá přepsanému nebo implementovanému členu.
fr: Le modificateur 'scoped' du paramètre '{0}' ne correspond pas au membre substitué ou implémenté.
it: Il modificatore 'scoped' del parametro '{0}' non corrisponde al membro sottoposto a override o implementato.
ja: パラメーター '{0}' の 'scoped' 修飾子が、オーバーライドされたメンバーまたは実装されたメンバーと一致しません。
pl: Modyfikator „scoped” parametru „{0}” nie jest zgodny z przesłoniętą lub zaimplementowaną składową.
pt_br: O modificador 'scoped' do parâmetro '{0}' não corresponde ao membro substituído ou implementado.
ru: Модификатор "scoped" параметра "{0}" не совпадает с переопределенным или реализованным членом.
zh_hans: 参数 "{0}" 的 "scoped" 修饰符与被重写或实现的成员不匹配。
zh_hant: 參數 '{0}' 的 'scoped' 修飾元不符合覆寫或實作的成員。

# WRN_ScopedMismatchInParameterOfOverrideOrImplementation_Title
source: The 'scoped' modifier of parameter doesn't match overridden or implemented member.
cs: Modifikátor scoped parametru neodpovídá přepsanému nebo implementovanému členu.
fr: Le modificateur 'scoped' du paramètre ne correspond pas au membre substitué ou implémenté.
it: Il modificatore 'scoped' del parametro non corrisponde al membro sottoposto a override o implementato.
ja: パラメーターの 'scoped' 修飾子が、オーバーライドされたメンバーまたは実装されたメンバーと一致しません。
pl: Modyfikator „scoped” parametru nie jest zgodny z przesłoniętą lub zaimplementowaną składową.
pt_br: O modificador 'scoped' do parâmetro não corresponde ao membro substituído ou implementado.
ru: Модификатор "scoped" параметра не соответствует переопределенному или реализованному элементу.
zh_hans: 参数的 “scoped” 修饰符与被替代或被实现的成员不匹配。
zh_hant: 參數的 'scoped' 修飾元不符合覆寫或實作的成員。

# WRN_ScopedMismatchInParameterOfTarget
source: The 'scoped' modifier of parameter '{0}' doesn't match target '{1}'.
cs: Modifikátor scoped parametru {0} neodpovídá cílovému objektu {1}.
fr: Le modificateur 'scoped' du paramètre '{0}' ne correspond pas au '{1}' cible.
it: Il modificatore 'scoped' del parametro '{0}' non corrisponde all'elemento '{1}' di destinazione.
ja: パラメーター '{0}' の 'scoped' 修飾子がターゲット '{1}'と一致しません。
pl: Modyfikator „scoped” 'parametru „{0}” nie jest zgodny z 'elementem docelowym „{1}”.
pt_br: O modificador 'scoped' do parâmetro '{0}' não corresponde ao parâmetro de '{1}'.
ru: Модификатор "scoped" параметра "{0}" не соответствует целевому "{1}".
zh_hans: 参数 "{0}" 的 "scoped" 修饰符与目标 "{1}" 不匹配。
zh_hant: 參數 '{0}' 的 'scoped' 修飾元不符合目標 '{1}'。

# WRN_ScopedMismatchInParameterOfTarget_Title
source: The 'scoped' modifier of parameter doesn't match target.
cs: Modifikátor scoped parametru neodpovídá cílovému objektu.
fr: Le modificateur 'scoped' du paramètre ne correspond pas à la cible.
it: Il modificatore 'scoped' del parametro non corrisponde alla destinazione.
ja: パラメーターの 'scoped' 修飾子がターゲットと一致しません。
pl: Modyfikator „scoped” parametru nie jest zgodny z elementem docelowym.
pt_br: O modificador 'scoped' do parâmetro não corresponde ao destino.
ru: Модификатор "scoped" параметра не соответствует целевому объекту.
zh_hans: 参数的 “scoped” 修饰符与目标不匹配。
zh_hant: 參數的 'scoped' 修飾元不符合目標。

# WRN_SwitchExpressionNotExhaustiveWithUnnamedEnumValue
source: The switch expression does not handle some values of its input type (it is not exhaustive) involving an unnamed enum value. For example, the pattern '{0}' is not covered.
cs: Výraz switch nezachycuje některé hodnoty vstupního typu (není úplný) včetně nepojmenované hodnoty výčtu. Nezachycuje například vzor {0}.
fr: L'expression switch ne prend pas en charge certaines valeurs de son type d'entrée (elle n'est pas exhaustive) impliquant une valeur enum sans nom. Par exemple, le modèle '{0}' n'est pas couvert.
it: L'espressione switch non gestisce alcuni valori del relativo tipo di input (non è esaustiva) che interessa un valore di enumerazione senza nome. Ad esempio, il criterio '{0}' non è coperto.
ja: switch 式では、名前なしの列挙値を含む入力の種類の一部の値が処理されません (すべてが網羅されているわけではありません)。たとえば、パターン '{0}' がカバーされていません。
pl: Wyrażenie switch nie obsługuje niektórych wartości typu wejściowego (nie jest wyczerpujące) obejmujących nienazwaną wartość wyliczenia. Na przykład nie jest uwzględniony wzorzec „{0}”.
pt_br: A expressão switch não lida com alguns valores do seu tipo de entrada (sem limitação) que envolvem um valor de enumeração não nomeado. Por exemplo, o padrão '{0}' não está coberto.
ru: Выражение switch не обрабатывает некоторые типы входных значений, в том числе неименованное значение перечисления (не является исчерпывающим). Например, не охвачен шаблон "{0}".
zh_hans: switch 表达式不会处理其输入类型的某些值(它不是穷举)，这包括未命名的枚举值。例如，模式“{0}”未包含在内。
zh_hant: 遇到未命名的列舉值時，switch 運算式不會處理其輸入類型的某些值 (未徹底處理)。例如，未涵蓋模式 '{0}'。

# WRN_SwitchExpressionNotExhaustiveWithUnnamedEnumValue_Title
source: The switch expression does not handle some values of its input type (it is not exhaustive) involving an unnamed enum value.
cs: Výraz switch nezachycuje některé hodnoty vstupního typu (není úplný) včetně nepojmenované hodnoty výčtu.
fr: L'expression switch ne prend pas en charge certaines valeurs de son type d'entrée (elle n'est pas exhaustive) impliquant une valeur enum sans nom.
it: L'espressione switch non gestisce alcuni valori del relativo tipo di input (non è esaustiva) che interessa un valore di enumerazione senza nome.
ja: switch 式では、名前なしの列挙値を含む入力の種類の一部の値が処理されない (すべてを網羅していない)。
pl: Wyrażenie switch nie obsługuje niektórych wartości typu wejściowego (nie jest wyczerpujące) obejmujących nienazwaną wartość wyliczenia.
pt_br: A expressão switch não lida com alguns valores do seu tipo de entrada (sem limitação) que envolvem um valor de enumeração não nomeado.
ru: Выражение switch не обрабатывает некоторые типы входных значений, в том числе неименованное значение перечисления (не является исчерпывающим).
zh_hans: switch 表达式不会处理其输入类型的某些值(它不是穷举)，这包括未命名的枚举值。
zh_hant: 遇到未命名的列舉值時，switch 運算式不會處理其輸入類型的某些值 (未徹底處理)。

# WRN_SyncAndAsyncEntryPoints
source: Method '{0}' will not be used as an entry point because a synchronous entry point '{1}' was found.
cs: Metoda {0} se nepoužije jako vstupní bod, protože se našel synchronní vstupní bod {1}.
fr: La méthode '{0}' ne sera pas utilisée en tant que point d'entrée, car un point d'entrée synchrone '{1}' a été trouvé.
it: Il metodo '{0}' non verrà usato come punto di ingresso perché è stato trovato un punto di ingresso sincrono '{1}'.
ja: 同期エントリ ポイント '{1}' が検出されたため、メソッド '{0}' はエントリ ポイントとして使用されません。
pl: Metoda „{0}” nie będzie używana jako punkt wejścia, ponieważ znaleziono synchroniczny punkt wejścia „{1}”.
pt_br: O método '{0}' não será usado como ponto de entrada porque um ponto de entrada síncrono '{1}' foi encontrado.
ru: Метод "{0}" не будет использоваться в качестве точки входа, так как была найдена синхронная точка входа "{1}".
zh_hans: 方法“{0}”将不会用作入口点，因为找到了同步入口点“{1}”。
zh_hant: 因為找到同步進入點 '{1}'，所以方法 '{0}' 無法作為進入點。

# ERR_TypeNotFound
source: Type '{0}' is not defined.
cs: Typ {0} není definovaný.
fr: Le type '{0}' n'est pas défini.
it: Il tipo '{0}' non è definito.
ja: 型 '{0}' は定義されていません。
pl: Typ „{0}” nie został zdefiniowany.
pt_br: O tipo '{0}' não está definido.
ru: Тип "{0}" не определен.
zh_hans: 未定义类型“{0}”。
zh_hant: 類型 '{0}' 未定義。

# ERR_UnexpectedArgumentList
source: Unexpected argument list.
cs: Neočekávaný seznam argumentů
fr: Liste d'arguments inattendue.
it: Elenco di argomenti imprevisto.
ja: 予期しない引数リストです。
pl: Nieoczekiwana lista argumentów.
pt_br: Lista de argumentos inesperados.
ru: Непредвиденный список аргументов.
zh_hans: 意外的参数列表。
zh_hant: 未預期的引數清單。

# ERR_UnexpectedOrMissingConstructorInitializerInRecord
source: A constructor declared in a type with parameter list must have 'this' constructor initializer.
cs: Konstruktor deklarovaný v typu se seznamem parametrů musí mít inicializátor konstruktoru this.
fr: Un constructeur déclaré dans un type avec une liste de paramètres doit avoir 'this' initialisateur de constructeur.
it: Un costruttore dichiarato in un record con elenco di parametri deve includere l'inizializzatore di costruttore 'this'.
ja: パラメーター リストを持つ型で宣言されたコンストラクターには、'this' コンストラクター初期化子が必要です。
pl: Konstruktor zadeklarowany w typie z listą parametrów musi mieć „ten” inicjalizator konstruktora.
pt_br: Um construtor declarado em um tipo com uma lista de parâmetros deve ter o inicializador de construtor 'this'.
ru: Конструктор, объявленный в типе со списком параметров, должен содержать инициализатор конструктора "this".
zh_hans: 在带参数列表的类型中声明的构造函数必须拥有“this”构造函数初始化表达式。
zh_hant: 在類型中宣告、具有參數清單的建構函式，必須具有 'this' 建構函式初始設定式。

# ERR_UnexpectedVarianceStaticMember
source: Invalid variance: The type parameter '{1}' must be {3} valid on '{0}' unless language version '{4}' or greater is used. '{1}' is {2}.
cs: Neplatná odchylka: Parametr typu {1} musí být {3} platný v {0}, pokud není použita verze jazyka {4} nebo vyšší. {1} je {2}.
fr: Variance non valide : le paramètre de type '{1}' doit être {3} valide sur '{0}' sauf si la version de langage '{4}' ou une version supérieure est utilisée. '{1}' est {2}.
it: Varianza non valida: il parametro di tipo '{1}' deve essere {3} valido in '{0}' a meno che non venga usata la versione '{4}' o successiva del linguaggio. '{1}' è {2}.
ja: 無効な変性: 言語バージョン '{4}' 以上が使用されていない限り、型パラメーター '{1}' は '{0}' で {3} が有効である必要があります。'{1}' は {2} です。
pl: Nieprawidłowa wariancja: parametr typu „{1}” musi być {3} prawidłowy w elemencie „{0}”, chyba że jest używana wersja języka „{4}” lub nowsza. „{1}” to {2}.
pt_br: Variância inválida: o parâmetro de tipo '{1}' precisa ser {3} válido em '{0}', a menos que seja usada a versão de idioma '{4}' ou superiores. '{1}' é {2}.
ru: Недопустимая вариантность: если не используется как минимум версия языка "{4}", параметр типа "{1}" должен быть допустимым ({3}) для "{0}". Состояние "{1}": {2}.
zh_hans: 无效的变型: 除非使用了语言版本“{4}”或更高版本，否则类型参数“{1}”在“{0}”上必须是 {3} 有效的。“{1}”是 {2}。
zh_hant: 變異數無效: 除非使用語言版本 '{4}' 或更高版本，否則型別參數 '{1}' 在 '{0}' 上須為 {3} 有效。'{1}' 是 {2}。

# ERR_UnmanagedBoundWithClass
source: '{0}': cannot specify both a constraint class and the 'unmanaged' constraint
cs: {0}: Nejde zadat třídu omezení a zároveň omezení unmanaged.
de: "{0}": Eine Einschränkungsklasse kann nicht gleichzeitig mit einer unmanaged-Einschränkung angegeben werden.
es: "{0}": no se puede especificar a la vez una clase de restricción y la restricción "unmanaged"
fr: '{0}' : impossible de spécifier à la fois une classe de contrainte et la contrainte 'unmanaged'
it: '{0}': non è possibile specificare sia una classe constraint che il vincolo 'unmanaged'
ja: '{0}': 制約クラスと 'unmanaged' 制約の両方を指定することはできません
ko: '{0}': constraint 클래스와 'unmanaged' 제약 조건을 둘 다 지정할 수는 없습니다.
pl: „{0}”: nie można jednocześnie określić klasy ograniczenia i ograniczenia „unmanaged”
pt_br: '{0}': não é possível especificar uma classe de restrição e a restrição 'unmanaged'
ru: "{0}": невозможно одновременно задать класс ограничения и ограничение "unmanaged"
tr: '{0}': hem bir kısıtlama sınıfı hem de 'unmanaged' kısıtlaması belirtilemez
zh_hans: “{0}”: 不能既指定约束类又指定 “unmanaged” 约束
zh_hant: '{0}': 不可在指定條件約束類型的同時，又指定 'unmanaged' 條件約束

# ERR_UnmanagedCallersOnlyMethodOrTypeCannotBeGeneric
source: Methods attributed with 'UnmanagedCallersOnly' cannot have generic type parameters and cannot be declared in a generic type.
cs: Metody, které mají atribut UnmanagedCallersOnly, nemůžou mít obecné typy parametrů a nedají se deklarovat v obecném typu.
fr: Les méthodes ayant pour attribut 'UnmanagedCallersOnly' ne peuvent pas avoir de paramètres de type générique et ne peuvent pas être déclarées dans un type générique.
it: I metodi attribuiti con 'UnmanagedCallersOnly' non possono avere parametri di tipo generico e non possono essere dichiarati in un tipo generico.
ja: 'UnmanagedCallersOnly' という属性を持つメソッドは、ジェネリック型パラメーターを持つことができません。また、ジェネリック型で宣言することはできません。
pl: Metody z atrybutem „UnmanagedCallersOnly” nie mogą mieć parametrów typu ogólnego i nie mogą być deklarowane w typie ogólnym.
pt_br: Os métodos atribuídos com 'UnmanagedCallersOnly' não podem ter parâmetros de tipo genérico e não podem ser declarados em um tipo genérico.
ru: Методы с атрибутом "UnmanagedCallersOnly" не могут иметь параметры универсального типа и не могут быть объявлены в универсальном типе.
zh_hans: 使用 "UnmanagedCallersOnly" 特性化的方法不能具有泛型类型参数，也不能在泛型类型中声明。
zh_hant: 使用 'UnmanagedCallersOnly' 屬性化的方法不能具有泛型型別參數，而且不能在泛型型別中宣告。

# ERR_UnmanagedCallersOnlyRequiresStatic
source: 'UnmanagedCallersOnly' can only be applied to ordinary static non-abstract, non-virtual methods or static local functions.
cs: UnmanagedCallersOnly se dá použít jen pro běžné statické neabstraktní, nevirtuální metody nebo statické místní funkce.
fr: 'UnmanagedCallersOnly' ne peut être appliqué qu’à des méthodes statiques non abstraites ou non virtuelles ordinaires ou à des fonctions locales statiques.
it: 'UnmanagedCallersOnly' può essere applicato solo a metodi ordinari statici, non astratti e non virtuali, o a funzioni locali statiche.
ja: 'UnmanagedCallersOnly' は、通常の静的な非抽象的、仮想でないメソッドまたは静的なローカル関数にのみ適用できます。
pl: Element „UnmanagedCallersOnly” można stosować tylko do zwykłych statycznych metod nieabstrakcyjnych lub statycznych funkcji lokalnych.
pt_br: 'UnmanagedCallersOnly' só pode ser aplicado a métodos estáticos comuns não abstratos, não virtuais ou funções locais estáticas.
ru: "UnmanagedCallersOnly" может применяться только к обычным статическим неабстрактным и невиртуальным методам или к статическим локальным функциям.
zh_hans: 'UnmanagedCallersOnly' 只能应用于普通静态非抽象、非虚拟方法或静态本地函数。
zh_hant: 'UnmanagedCallersOnly' 僅適用於一般靜態非抽象方法、非虛擬方法或靜態區域函式。

# ERR_UnmanagedConstraintNotSatisfied
source: The type '{2}' must be a non-nullable value type, along with all fields at any level of nesting, in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: Typ {2} musí být typ, který nemůže mít hodnotu null, ani nesmí v žádné úrovni vnoření obsahovat pole, které by ji povolovalo, aby se dal použít jako parametr {1} v obecném typu nebo metodě {0}.
de: Der Typ "{2}" muss, ebenso wie sämtliche Felder auf jeder Schachtelungsebene, ein Non-Nullable-Typ sein, wenn er als {1}-Parameter im generischen Typ oder in der generischen Methode "{0}" verwendet werden soll.
es: "{2}" debe ser un tipo de valor que no acepta valores NULL, junto con todos los campos de cualquier nivel de anidamiento, para poder usarlo como parámetro "{1}" en el tipo o método genérico "{0}"
fr: Le type '{2}' doit être un type valeur non-nullable, ainsi que l'ensemble des champs à tous les niveaux d'imbrication, pour pouvoir être utilisé en tant que paramètre '{1}' dans le type ou la méthode générique '{0}'
it: Il tipo '{2}' deve essere un tipo valore che non ammette i valori Null, unitamente a tutti i campi a ogni livello di annidamento, per poter essere usato come parametro '{1}' nel tipo o metodo generico '{0}'
ja: 型 '{2}' と、入れ子になっているあらゆるレベルのすべてのフィールドは、ジェネリック型またはメソッド '{0}' のパラメーター '{1}' として使用するために、Null 非許容の値型でなければなりません
ko: 제네릭 형식 또는 메서드 '{0}'에서 모든 중첩 수준의 모든 필드와 함께 '{2}' 형식을 '{1}' 매개 변수로 사용하려면 해당 형식이 null을 허용하지 않는 값 형식이어야 합니다.
pl: Typ „{2}” musi być nienullowalnym typem wartości (podobnie jak wszystkie pola na wszystkich poziomach zagnieżdżenia), aby można było używać go jako parametru „{1}” w typie ogólnym lub metodzie ogólnej „{0}”
pt_br: O tipo '{2}' deve ser um tipo de valor não anulável, juntamente com todos os campos em qualquer nível de aninhamento, para ser usado como um parâmetro '{1}' no tipo genérico ou no método '{0}'
ru: Чтобы тип "{2}" можно было использовать как параметр "{1}" в универсальном типе метода "{0}", он должен быть типом значения, который, как и все поля на любом уровне вложения, не допускает значения NULL.
tr: '{0}' genel türü veya yönteminde '{1}' parametresi olarak kullanılabilmesi için '{2}' türünün, herhangi bir iç içe geçme düzeyindeki tüm alanlarla birlikte null yapılamayan bir değer türü olması gerekir
zh_hans: 类型“{2}”必须是不可为 null 值的类型，且包括任何嵌套级别的所有字段，才能用作泛型类型或方法“{0}”中的参数“{1}”
zh_hant: 類型 '{2}' 及任何巢狀層級的所有欄位必須是不可為 null 的值類型，如此才能在泛型型別或方法 '{0}' 中將其用為參數 '{1}'

# ERR_UnsupportedCallingConvention
source: The calling convention of '{0}' is not supported by the language.
cs: Jazyk nepodporuje konvenci volání {0}.
fr: La convention d'appel de '{0}' n'est pas prise en charge par le langage.
it: La convenzione di chiamata di '{0}' non è supportata dal linguaggio.
ja: '{0}' の呼び出し規則は、この言語ではサポートされていません。
pl: Konwencja wywoływania elementu „{0}” nie jest obsługiwana przez język.
pt_br: A linguagem não dá suporte à convenção de chamada '{0}'.
ru: Соглашение о вызовах "{0}" не поддерживается в данном языке.
zh_hans: 语言不支持“{0}”的调用约定。
zh_hant: 語言不支援 '{0}' 的呼叫慣例。

# ERR_UnsupportedTypeForRelationalPattern
source: Relational patterns may not be used for a value of type '{0}'.
cs: Relační vzory se nedají používat pro hodnotu typu {0}.
fr: Les modèles relationnels ne peuvent pas être utilisés pour une valeur de type '{0}'.
it: Non è possibile usare i criteri relazionali per un valore di tipo '{0}'.
ja: リレーショナル パターンは、'{0}' 型の値に使用することはできません。
pl: Wzorców relacyjnych nie można używać na potrzeby wartości typu „{0}”.
pt_br: Os padrões relacionais não podem ser usados para um valor do tipo '{0}'.
ru: Реляционные шаблоны не могут использоваться для значений типа "{0}".
zh_hans: 关系模式可能不能用于“{0}”类型的值。
zh_hant: 類型 '{0}' 的值不可使用關聯性模式。

# ERR_UsingVarInSwitchCase
source: A using variable cannot be used directly within a switch section (consider using braces).
cs: Proměnnou using není možné v sekci switch použít přímo (zvažte použití složených závorek).
de: Eine using-Variable kann nicht direkt in einem switch-Abschnitt verwendet werden (erwägen Sie die Verwendung von geschweiften Klammern).
es: Una variable using no se puede usar directamente en una sección switch (considere el uso de llaves).
fr: Impossible d'utiliser une variable using directement dans une section switch (utilisez des accolades).
it: Non è possibile usare una variabile using direttamente in una sezione di switch; provare a usare le parentesi graffe.
ja: using 変数を switch セクションで直接使用することはできません (波かっこの使用をご検討ください)。
ko: using 변수를 switch 섹션 내에 직접 사용할 수 없습니다. 중괄호를 사용하세요.
pl: Nie można użyć zmiennej użycia bezpośrednio w sekcji instrukcji switch (rozważ użycie nawiasów klamrowych).
pt_br: Uma variável using não pode ser usada diretamente em uma seção de switch (considere o uso de chaves).
ru: Переменную using невозможно использовать напрямую в разделе switch (рекомендуется использовать скобки).
tr: Bir using değişkeni, switch bölümü içinde doğrudan kullanılamaz (ayraç kullanmayı deneyin).
zh_hans: Using 变量不能直接在 switch 部分中使用（请考虑使用大括号）。
zh_hant: 不可直接在 switch 區段內使用 using 變數 (建議使用大括弧)。

# ERR_VarMayNotBindToType
source: The syntax 'var' for a pattern is not permitted to refer to a type, but '{0}' is in scope here.
cs: U syntaxe var pro vzor se nepovoluje odkazování na typ, ale {0} je tady v rámci rozsahu.
de: Die Syntax "var" für ein Muster darf nicht zum Verweis auf einen Typen verwendet werden, "{0}" ist jedoch im Bereich enthalten.
es: La sintaxis "var" de un patrón no puede hacer referencia a un tipo, pero "{0}" está dentro del ámbito aquí.
fr: La syntaxe 'var' d'un modèle n'est pas autorisée à faire référence à un type, mais '{0}' est dans l'étendue ici.
it: Per fare riferimento a un tipo, non è consentito usare la sintassi 'var' per un criterio, ma in questo '{0}' è incluso nell'ambito.
ja: 型を参照するためにパターンに構文 'var' を使用することは許可されていませんが、ここでは '{0}' がスコープ内にあります。
ko: 패턴의 'var' 구문은 형식 참조가 허용되지 않지만 '{0}'은(는) 여기서 범위 내에 있습니다.
pl: Składnia „var” dla wzorca nie może odwoływać się do typu, ale element „{0}” należy tutaj do zakresu.
pt_br: A sintaxe 'var' de um padrão não pode referenciar um tipo, mas '{0}' está no escopo aqui.
ru: Синтаксису "var" для шаблона запрещено ссылаться на тип, но "{0}" здесь входит в область.
tr: Bir desene yönelik 'var' söz diziminin bir türe başvurmasına izin verilmez, ancak burada '{0}' kapsam dahilinde.
zh_hans: 模式的语法 "var" 不允许引用类型，但“{0}”在此范围内。
zh_hant: 不允許模式的語法 'var' 參考類型，但 '{0}' 在此處的範圍中。

# ERR_VarianceInterfaceNesting
source: Enums, classes, and structures cannot be declared in an interface that has an 'in' or 'out' type parameter.
cs: Výčty, třídy a struktury není možné deklarovat v rozhraní, které má parametr typu in/out.
de: Enumerationen, Klassen und Strukturen können nicht in Schnittstellen mit Parametern vom Typ "in" oder "out" deklariert werden.
es: Las enumeraciones, las clases y las estructuras no se pueden declarar en una interfaz que tenga un parámetro de tipo "in" o "out".
fr: Les enums, les classes et les structures ne peuvent pas être déclarés dans une interface contenant un paramètre de type 'in' ou 'out'.
it: Non è possibile dichiarare enumerazioni, classi e strutture in un'interfaccia che contiene un parametro di tipo 'in' o 'out'.
ja: 'in' または 'out' の型パラメーターを持つインターフェイス内では、列挙体、クラス、および構造体を宣言することはできません。
ko: 'in' 또는 'out' 형식 매개 변수가 있는 인터페이스에서 열거형, 클래스, 구조체를 선언할 수 없습니다.
pl: Wyliczenia, klasy i struktury nie mogą być deklarowane w interfejsie mającym parametr typu „in” lub „out”.
pt_br: Não é possível declarar enumerações, classes e estruturas em uma interface que tenha um parâmetro de tipo 'in' ou 'out'.
ru: Перечисления, классы и структуры не могут быть объявлены в интерфейсе, имеющем параметр типа "In" или "Out".
tr: Sabit listeleri, sınıflar ve yapılar 'in' veya 'out' tür parametresine sahip bir arabirimde bildirilemez.
zh_hans: 无法在含有 "in" 或 "out" 类型参数的接口中声明枚举、类和结构。
zh_hant: 無法在有 'in' 或 'out' 型別參數的介面中宣告列舉、類別和結構。

# ERR_WrongFuncPtrCallingConvention
source: Calling convention of '{0}' is not compatible with '{1}'.
cs: Konvence volání pro {0} není kompatibilní s {1}.
fr: La convention d'appel de '{0}' n'est pas compatible avec '{1}'.
it: La convenzione di chiamata di '{0}' non è compatibile con '{1}'.
ja: '{0}' の呼び出し規則は '{1}' と互換性がありません。
pl: Konwencja wywołania elementu „{0}” jest niezgodna z elementem „{1}”.
pt_br: A convenção de chamada '{0}' não é compatível com '{1}'.
ru: Соглашение о вызовах "{0}" несовместимо с "{1}".
zh_hans: “{0}”的调用约定与“{1}”不兼容。
zh_hant: '{0}' 的呼叫慣例與 '{1}' 不相容。
