Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_CSCHelp
source: Visual C# Compiler Options - OUTPUT FILES - -out:<file> Specify output file name (default: base name of file with main class or first file) -target:exe Build a console executable (default) (Short form: -t:exe) -target:winexe Build a Windows executable (Short form: -t:winexe) -target:library Build a library (Short form: -t:library) -target:module Build a module that can be added to another assembly (Short form: -t:module) -target:appcontainerexe Build an Appcontainer executable (Short form: -t:appcontainerexe) -target:winmdobj Build a Windows Runtime intermediate file that is consumed by WinMDExp (Short form: -t:winmdobj) -doc:<file> XML Documentation file to generate -refout:<file> Reference assembly output to generate -platform:<string> Limit which platforms this code can run on: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred, or anycpu. The default is anycpu. - INPUT FILES - -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications -reference:<alias>=<file> Reference metadata from the specified assembly file using the given alias (Short form: -r) -reference:<file list> Reference metadata from the specified assembly files (Short form: -r) -addmodule:<file list> Link the specified modules into this assembly -link:<file list> Embed metadata from the specified interop assembly files (Short form: -l) -analyzer:<file list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. -embed Embed all source files in the PDB. -embed:<file list> Embed specific files in the PDB. - RESOURCES - -win32res:<file> Specify a Win32 resource file (.res) -win32icon:<file> Use this icon for the output -win32manifest:<file> Specify a Win32 manifest file (.xml) -nowin32manifest Do not include the default Win32 manifest -resource:<resinfo> Embed the specified resource (Short form: -res) -linkresource:<resinfo> Link the specified resource to this assembly (Short form: -linkres) Where the resinfo format is <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] Emit debugging information -debug:{full|pdbonly|portable|embedded} Specify debugging type ('full' is default, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the target .dll or .exe) -optimize[+|-] Enable optimizations (Short form: -o) -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -warnaserror[+|-] Report all warnings as errors -warnaserror[+|-]:<warn list> Report specific warnings as errors (use "nullable" for all nullability warnings) -warn:<n> Set warning level (0-4) (Short form: -w) -nowarn:<warn list> Disable specific warning messages (use "nullable" for all nullability warnings) -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. - LANGUAGE - -checked[+|-] Generate overflow checks -unsafe[+|-] Allow 'unsafe' code -define:<symbol list> Define conditional compilation symbol(s) (Short form: -d) -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `latest` (latest version, including minor versions), `default` (same as `latest`), `latestmajor` (latest version, excluding minor versions), `preview` (latest version, including features in unsupported preview), or specific versions like `6` or `7.1` -nullable[+|-] Specify nullable context option enable|disable. -nullable:{enable|disable|warnings|annotations} Specify nullable context option enable|disable|warnings|annotations. - SECURITY - -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key -keyfile:<file> Specify a strong name key file -keycontainer:<string> Specify a strong name key container -highentropyva[+|-] Enable high-entropy ASLR - MISCELLANEOUS - @<file> Read response file for more options -help Display this usage message (Short form: -?) -nologo Suppress compiler copyright message -noconfig Do not auto include CSC.RSP file -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<address> Base address for the library to be built -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<n> Specify the codepage to use when opening source files -utf8output Output compiler messages in UTF-8 encoding -main:<type> Specify the type that contains the entry point (ignore all other possible entry points) (Short form: -m) -fullpaths Compiler generates fully qualified paths -filealign:<n> Specify the alignment used for output file sections -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -pdb:<file> Specify debug information file name (default: output file name with .pdb extension) -errorendlocation Output line and column of the end location of each error -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -nostdlib[+|-] Do not reference standard library (mscorlib.dll) -subsystemversion:<string> Specify subsystem version of this assembly -lib:<file list> Specify additional directories to search in for references -errorreport:<string> Specify how to handle internal compiler errors: prompt, send, queue, or none. The default is queue. -appconfig:<file> Specify an application configuration file containing assembly binding settings -moduleassemblyname:<string> Name of the assembly which this module will be a part of -modulename:<string> Specify the name of the source module
de: Visual C#-Compileroptionen – AUSGABEDATEIEN – -out:<Datei> Gibt den Namen der Ausgabedatei an (Standardeinstellung: Basisname der Datei mit der Hauptklasse oder der ersten Datei). -target:exe Erstellt eine ausführbare Konsolendatei (Standardeinstellung) (Kurzform: -t:exe). -target:winexe Erstellt eine ausführbare Windows-Datei (Kurzform: -t:winexe). -target:library Erstellt eine Bibliothek (Kurzform: -t:library). -target:module Erstellt ein Modul, das einer anderen Assembly hinzugefügt werden kann (Kurzform: -t:module). -target:appcontainerexe Erstellt eine ausführbare App-Containerdatei (Kurzform: -t:appcontainerexe). -target:winmdobj Erstellt eine Windows-Runtime-Zwischendatei, die von WinMDExp verwendet wird (Kurzform: -t:winmdobj). -doc:<Datei> Die zu generierende XML-Dokumentationsdatei. -refout:<Datei> Die zu generierende Referenzassemblyausgabe. -platform:<Zeichenfolge> Schränkt ein, auf welchen Plattformen dieser Code ausgeführt werden kann: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred oder anycpu. Die Standardeinstellung ist "anycpu". – EINGABEDATEIEN – -recurse:<Platzhalter> Schließt alle Dateien im aktuellen Verzeichnis und in Unterverzeichnissen gemäß Platzhalter- spezifikationen ein. -reference:<Alias>=<Datei> Verweist auf Metadaten aus der angegebenen Assembly- datei mithilfe eines angegebenen Alias (Kurzform: -r). -reference:<Dateiliste> Verweist auf Metadaten aus den angegebenen Assembly- dateien (Kurzform: -r). -addmodule:<Dateiliste> Verknüpft die angegebenen Module in dieser Assembly. -link:<Dateiliste> Bettet Metadaten der angegebenen Interop- assemblydateien ein (Kurzform: -l). -analyzer:<Dateiliste> Führt die Analyse aus dieser Assembly aus (Kurzform: -a). -additionalfile:<Dateiliste> Zusätzliche Dateien, die sich nicht direkt auf die Code- generierung auswirken, aber von der Analyse zum Generieren von Fehlern oder Warnungen verwendet werden können. -embed Bettet alle Quelldateien in die PDB-Datei ein. -embed:<Dateiliste> Bettet bestimmte Dateien in die PDB-Datei ein. – RESSOURCEN – -win32res:<Datei> Gibt eine Win32-Ressourcendatei (RES-Datei) an. -win32icon:<Datei> Verwendet dieses Symbol für die Ausgabe. -win32manifest:<Datei> Gibt eine Win32-Manifestdatei (XML-Datei) an. -nowin32manifest Schließt das Win32-Standardmanifest nicht ein. -resource:<resinfo> Bettet die angegebene Ressource ein (Kurzform: -res). -linkresource:<resinfo> Verknüpft die angegebene Ressource mit dieser Assembly (Kurzform: -linkres). Dabei lautet das resinfo-Format <Datei>[,<Zeichenfolgenname>[,public|private]] – CODEGENERIERUNG – -debug[+|-] Gibt Debuginformationen aus. -debug:{full|pdbonly|portable|embedded} Gibt den Debugtyp an ("full" ist der Standardwert, "portable" ist ein plattformübergreifendes Format, "embedded" ist ein plattformübergreifendes Format, das in die Ziel-DLL oder -EXE eingebettet ist). -optimize[+|-] Aktiviert Optimierungen (Kurzform: -o) -deterministic Generiert eine deterministische Assembly (einschließlich Modulversion-GUID und Zeitstempel). -refonly Generiert eine Referenzassembly anstelle der Hauptausgabe. -instrument:TestCoverage Generiert eine Assembly, die für die Erfassung von Code Coverage-Informationen instrumentiert ist. -sourcelink:<Datei> Quelllinkinformationen zum Einbetten in PDB-Dateien. – FEHLER UND WARNUNGEN – -warnaserror[+|-] Meldet alle Warnungen als Fehler. -warnaserror[+|-]:<Warnungsliste> Meldet bestimmte Warnungen als Fehler. -warn:<n> Legt die Warnstufe fest (0–4) (Kurzform: -w). -nowarn:<Warnungsliste> Deaktiviert bestimmte Warnmeldungen. -ruleset:<Datei> Gibt eine Regelsatzdatei an, die bestimmte Diagnosevorgänge deaktiviert. -errorlog:<Datei>[,version=<sarif_version>] Gibt eine Datei zur Protokollierung aller Diagnosevorgänge von Compiler und Analyzer an. sarif_version:{1|2|2.1} Standardwerte sind 1. 2 und 2.1, beide beziehen sich auf SARIF-Version 2.1.0. -reportanalyzer Meldet zusätzliche Analyseinformationen wie etwa die Ausführungszeit. – SPRACHE – -checked[+|-] Generiert Überlaufüberprüfungen. -unsafe[+|-] Lässt "unsicheren" Code zu. -define:<Symbolliste> Definiert bedingte Kompilationssymbole (Kurz- form: -d). -langversion:? Zeigt die zulässigen Werte für die Sprachversion an. -langversion:<Zeichenfolge> Gibt die Sprachversion an: "latest" (neueste Version, einschließlich Nebenversionen), "default" (die gleiche Version wie bei "latest"), "latestmajor" (neueste Version, außer Nebenversionen), "preview" (neueste Version, einschließlich Features in der nicht unterstützten Vorschauversion) oder bestimmte Versionen wie "6" oder "7.1". -nullable[+|-] Legt die Option für Nullwerte zulassenden Kontext fest: enable|disable. -nullable:{enable|disable|warnings|annotations} Legt die Option für Nullwerte zulassenden Kontext fest: enable|disable|warnings|annotations. – SICHERHEIT – -delaysign[+|-] Signiert die Assembly verzögert nur mit dem öffentlichen Teil des starken Namensschlüssels. -publicsign[+|-] Signiert die Assembly öffentlich nur mit dem öffentlichen Teil des starken Namensschlüssels. -keyfile:<Datei> Gibt eine Datei für den starken Namensschlüssel an. -keycontainer:<Zeichenfolge> Gibt einen Container für den starken Namensschlüssel an. -highentropyva[+|-] Aktiviert ASLR mit hoher Entropie. – VERSCHIEDENES – @<Datei> Weitere Optionen finden Sie in der Antwortdatei. -help Zeigt diese Syntaxmeldung an (Kurzform: -?). -nologo Unterdrückt die Copyrightmeldung des Compilers. -noconfig Schließt die CSC.RSP-Datei nicht automatisch ein. -parallel[+|-] Paralleler Build. -version Zeigt die Compilerversionsnummer und die Beendigung an. – ERWEITERT – -baseaddress:<Adresse> Die Basisadresse für die zu erstellende Bibliothek. -checksumalgorithm:<alg> Gibt einen Algorithmus für das Berechnen der Quelldatei- prüfsumme an, die in der PDB-Datei gespeichert ist. Unterstützte Werte: SHA1 oder SHA256 (Standard). -codepage:<n> Gibt die beim Öffnen von Quelldateien zu verwendende Codepage an. -utf8output Gibt Compilermeldungen in UTF-8-Codierung aus. -main:<Typ> Gibt den Typ an, der den Einstiegspunkt enthält (alle anderen möglichen Einstiegspunkte werden ignoriert) (Kurz- form: -m). -fullpaths Der Compiler generiert vollqualifizierte Pfade. -filealign:<n> Gibt die Ausrichtung an, die für Ausgabedateiabschnitte verwendet werden soll. -pathmap:<K1>=<V1>,<K2>=<V2>,... Gibt eine Zuordnung für die Quellpfadnamen an, die vom Compiler ausgegeben werden. -pdb:<Datei> Gibt den Namen der Debuginformationsdatei an (Standard: Ausgabe des Dateinamens mit PDB-Erweiterung). -errorendlocation Gibt für jeden Fehler die Zeile und Spalte des Endpunkts aus. -preferreduilang Gibt den Namen der bevorzugten Ausgabesprache an. -nosdkpath Deaktiviert die Suche nach dem SDK-Standardpfad für Standardbibliotheksassemblys. -nostdlib[+|-] Kein Verweis auf die Standardbibliothek (mscorlib.dll). -subsystemversion:<Zeichenfolge> Gibt die Subsystemversion dieser Assembly an. -lib:<Dateiliste> Gibt zusätzliche Verzeichnisse an, in denen nach Verweisen gesucht werden soll. -errorreport:<Zeichenfolge> Gibt die Verarbeitung interner Compilerfehler an: "prompt", "send", "queue" oder "none". Der Standardwert lautet "queue". -appconfig:<Datei> Gibt eine Anwendungskonfigurationsdatei mit Assemblybindungseinstellungen an. -moduleassemblyname:<Zeichenfolge> Der Name der Assembly, zu der dieses Modul gehören wird. -modulename:<Zeichenfolge> Gibt den Quellmodulnamen an.
es: Opciones del compilador de Visual C# - ARCHIVOS DE SALIDA - -out:<archivo> Especifica el nombre del archivo de salida (el valor predeterminado: nombre base del archivo con la clase principal o el primer archivo) -target:exe Compila un archivo ejecutable de consola (predeterminado) (forma corta: -t:exe) -target:winexe Compila un archivo ejecutable de Windows (forma corta: -t:winexe) -target:library Compila una biblioteca (forma corta: -t:library) -target:module Compila un módulo que se puede agregar a otro ensamblado (forma corta: -t:module) -target:appcontainerexe Compila un archivo ejecutable Appcontainer (forma corta: -t:appcontainerexe) -target:winmdobj Compila un archivo intermedio de Windows Runtime para que consuma WinMDExp (forma corta: -t:winmdobj) -doc:<archivo> Archivo de documentación XML que se va a generar -refout:<archivo> Salida de ensamblado de referencia para generar -platform:<cadena> Limita en qué plataformas se puede ejecutar este código: x86, Itanium, x64, arm, anycpu32bitpreferred o anycpu. La predeterminada es anycpu. - ARCHIVOS DE ENTRADA - -recurse:<comodín> Incluye todos los archivos del directorio actual y los subdirectorios de acuerdo con las especificaciones del comodín -reference:<alias>=<archivo> Metadatos de referencia del archivo de ensamblado especificado mediante el alias dado (forma corta: -r) -reference:<lista de archivos> Metadatos de referencia de los archivos de ensamblado especificados (forma corta: -r) -addmodule:<lista de archivos> Vincula los módulos especificados en este ensamblado -link:<lista de archivos> Inserta metadatos de los archivos de ensamblado de interoperabilidad especificados (forma corta: -l) -analyzer:<lista de archivos> Ejecuta los analizadores de este ensamblado (forma corta: -a) -additionalfile:<lista de archivos> Archivos adicionales que no afectan directamente a la generación de código pero que pueden usar los analizadores para producir errores o advertencias. -embed Inserta todos los archivos de origen en el PDB. -embed:<lista de archivos> Inserta los archivos especificados en el PDB - RECURSOS - -win32res:<archivo> Especifica un archivo de recursos Win32 (.res) -win32icon:<archivo> Usa este icono para la salida -win32manifest:<archivo> Especifica un archivo de manifiesto Win32 (.xml) -nowin32manifest No incluye el manifiesto Win32 predeterminado -resource:<resinfo> Insertar el recurso especificado (forma corta: -res) -linkresource:<info recurso> Vincula el recurso especificado con este ensamblado (forma corta: -linkres) Donde el formato de resinfo es <archivo>[,<nombre de cadena>[,public|private]] - GENERACIÓN DE CÓDIGO - -debug[+|-] Emite información de depuración -debug:{full|pdbonly|portable|embedded} Especifica el tipo de depuración ("full"' es el valor predeterminado, "portable" es un formato multiplataforma, "embedded" es un formato multiplataforma insertado en el archivo .dll o .exe de destino) -optimize[+|-] Permite optimizaciones (forma corta: -o) -deterministic Produce un ensamblado determinista (que incluye el GUID y la marca de tiempo de la versión del módulo) -refonly Produce un ensamblado de referencia en lugar de la salida principal -instrument:TestCoverage Produce un ensamblado instrumentado para recopilar información de cobertura -sourcelink:<archivo> Información del vínculo de origen para insertar en el PDB. - ERRORES Y ADVERTENCIAS - -warnaserror[+|-] Notifica todas las advertencias como errores -warnaserror[+|-]:<lista de advertencias> Notifica advertencias específicas como errores -warn:<n> Establece el nivel de advertencia (de 0 a 4) (forma corta: -w) -nowarn:<lista de advertencias> Deshabilita mensajes de advertencia específicos -ruleset:<archivo> Especifica un archivo de conjunto de reglas que deshabilite diagnósticos específicos. -errorlog:<archivo>[,version=<versión_de_sarif >] Especifica un archivo para registrar todos los diagnósticos del compilador y el analizador. sarif_version:{1|2|2.1} El valor predeterminado es 1. 2 y 2.1 significa SARIF versión 2.1.0. -reportanalyzer Notifica información adicional del analizador, como el tiempo de ejecución. - LENGUAJE - -checked[+|-] Genera comprobaciones de desbordamiento -unsafe[+|-] Permite código "no seguro" -define:<lista de símbolos> Define símbolos de compilación condicional (forma corta: -d) -langversion:? Muestra los valores permitidos para la versión de lenguaje\ r -langversion:<cadena> Especifica la versión de lenguaje como “latest” (última versión, incluidas las secundarias, “default” (igual que “latest”), “latestmajor” (última versión, excluidas las secundarias), “preview” (última versión, incluidas las características en la versión preliminar no admitida) o versiones específicas como “6” o “7.1” -nullable[+|-] Especifique la opción de contexto anulable enable|disable. -nullable:{enable|disable|warnings|annotations} Especifique la opción de contexto anulable enable|disable|warnings|annotations. - SEGURIDAD - -delaysign[+|-] Retrasa la firma del ensamblado usando solo la parte pública de la clave de nombre seguro -publicsign[+|-] Publica la firma del ensamblado usando solo la parte pública de la clave de nombre seguro -keyfile:<archivo> Especifica un archivo de clave de nombre seguro -keycontainer:<cadena> Especifica un contenedor de claves de nombres seguros -highentropyva[+|-] Habilita ASLR de alta entropía - VARIOS - @<archivo> Lee el archivo de respuesta para ver más opciones -help Muestra este mensaje de uso (forma corta: -?) -nologo Suprime el mensaje de copyright del compilador -noconfig No incluye automáticamente el archivo CSC.RSP -parallel[+|-] Compilación simultánea. -version Muestra el número de versión del compilador y cierra. - AVANZADO - -baseaddress:<dirección> Dirección base de la biblioteca que se compilará -checksumalgorithm:<alg> Especifica el algoritmo para calcular la suma de comprobación del archivo de origen almacenado en PDB. Los valores admitidos son: SHA1 o SHA256 (predeterminado). -codepage:<n> Especifica la página de código que se usará al abrir los archivos de origen -utf8output Mensajes de compilador de salida en codificación UTF-8 -main:<tipo> Especifica el tipo que contiene el punto de entrada (ignora todos los demás puntos de entrada posibles) (Forma corta: -m) -fullpaths El compilador genera rutas de acceso completas -filealign:<n> Especifica la alineación usada para las secciones del archivo de salida -pathmap:<K1>=<V1>,<K2>=<V2>,... Especifica una asignación para los nombres de rutas de acceso de origen emitidos por el compilador. -pdb:<archivo> Especifica el nombre de archivo de información de depuración (valor predeterminado: nombre de archivo de salida con la extensión .pdb) -errorendlocation Línea y columna de salida de la ubicación final de cada error -preferreduilang Especifica el nombre del lenguaje de salida preferido. -nosdkpath Deshabilita la búsqueda de la ruta del SDK predeterminada para los ensamblados de biblioteca estándar. -nostdlib[+|-] No hace referencia a la biblioteca estándar (mscorlib.dll) -subsystemversion:<cadena> Especifica la versión del subsistema de este ensamblado -lib:<lista de archivos> Especifica directorios adicionales en los que buscar referencias -errorreport:<cadena> Especifica cómo tratar los errores internos del compilador: avisar, enviar, poner en cola o ninguno. El valor predeterminado es poner en cola. -appconfig:<archivo> Especifica un archivo de configuración de aplicación que contenga opciones de enlace de ensamblado -moduleassemblyname:<cadena> Nombre del ensamblado del que esté módulo formará parte -modulename:<cadena> Especifica el nombre del módulo de origen
ko: Visual C# 컴파일러 옵션 - 출력 파일 - -out:<파일> 출력 파일 이름을 지정합니다(기본값: 주 클래스가 있는 파일 또는 첫 번째 파일의 기본 이름). -target:exe 콘솔 실행 파일을 빌드합니다(기본값). (약식: -t:exe) -target:winexe Windows 실행 파일을 빌드합니다. (약식: -t:winexe) -target:library 라이브러리를 빌드합니다. (약식: -t:library) -target:module 다른 어셈블리에 추가할 수 있는 모듈을 빌드합니다. (약식: -t:module) -target:appcontainerexe Appcontainer 실행 파일을 빌드합니다. (약식: -t:appcontainerexe) -target:winmdobj WinMDExp에서 사용되는 Windows 런타임 중간 파일을 빌드합니다. (약식: -t:winmdobj) -doc:<파일> 생성할 XML 문서 파일입니다. -refout:<파일> 생성할 참조 어셈블리 출력입니다. -platform:<문자열> 이 코드를 실행할 수 있는 플랫폼을 x86, Itanium, x64, arm, arm64, anycpu32bitpreferred 또는 anycpu로 제한합니다. 기본값은 anycpu입니다. - 입력 파일 - -recurse:<와일드카드> 와일드카드 지정에 따라 현재 디렉터리와 하위 디렉터리에 있는 모든 파일을 포함합니다. -reference:<별칭>=<파일> 지정한 어셈블리 파일의 메타데이터를 지정된 별칭으로 참조합니다. (약식: -r) -reference:<파일 목록> 지정한 어셈블리 파일의 메타데이터를 참조합니다. (약식: -r) -addmodule:<파일 목록> 지정한 모듈을 이 어셈블리에 연결합니다. -link:<파일 목록> 지정된 interop 어셈블리 파일의 메타데이터를 포함합니다. (약식: -l) -analyzer:<파일 목록> 이 어셈블리에서 분석기를 실행합니다. (약식: -a) -additionalfile:<파일 목록> 코드 생성에 직접 영향을 주지 않지만 오류 또는 경고 생성을 위해 분석기에서 사용될 수 있는 추가 파일입니다. -embed PDB에 모든 소스 파일을 포함합니다. -embed:<파일 목록> PDB에 특정 파일을 포함합니다. - 리소스 - -win32res:<파일> Win32 리소스 파일(.res)을 지정합니다. -win32icon:<파일> 이 아이콘을 출력에 사용합니다. -win32manifest:<파일> Win32 매니페스트 파일(.xml)을 지정합니다. -nowin32manifest 기본 Win32 매니페스트를 포함하지 않습니다. -resource:<resinfo> 지정한 리소스를 포함합니다. (약식: -res) -linkresource:<resinfo> 지정한 리소스를 이 어셈블리에 연결합니다. (약식: -linkres) 여기서, resinfo 형식은 <파일>[,<문자열 이름>[,public|private]]입니다. - 코드 생성 - -debug[+|-] 디버깅 정보를 내보냅니다. -debug:{full|pdbonly|portable|embedded} 디버깅 형식을 지정합니다. 기본값은 'full'이고, 'portable'은 플랫폼 간 형식이며, 'embedded'는 대상 .dll 또는 .exe에 포함된 플랫폼 간 형식입니다. -optimize[+|-] 최적화를 사용하도록 설정합니다. (약식: -o) -deterministic 결정적 어셈블리를 생성합니다(모듈 버전 GUID 및 타임스탬프 포함). -refonly 주 출력 대신 참조 어셈블리를 생성합니다. -instrument:TestCoverage 검사 정보를 수집하기 위해 계측한 어셈블리를 생성합니다. -sourcelink:<파일> PDB에 포함할 소스 링크 정보입니다. - 오류 및 경고 - -warnaserror[+|-] 모든 경고를 오류로 보고합니다. -warnaserror[+|-]:<경고 목록> 특정 경고를 오류로 보고합니다. -warn:<n> 경고 수준(0~4)을 설정합니다. (약식: -w) -nowarn:<경고 목록> 특정 경고 메시지를 사용하지 않도록 설정합니다. -ruleset:<파일> 특정 진단을 사용하지 않도록 하는 규칙 집합 파일을 지정합니다. -errorlog:<파일>[,version=<sarif_version>] 모든 컴파일러 및 분석기 진단을 기록할 파일을 지정합니다. sarif_version:{1|2|2.1} 기본값 1. 2와 2.1은 모두 SARIF 버전 2.1.0을 의미합니다. -reportanalyzer 추가 분석기 정보(예: 실행 시간)를 보고합니다. - 언어 - -checked[+|-] 오버플로 검사를 생성합니다. -unsafe[+|-] 'unsafe' 코드를 허용합니다. -define:<기호 목록> 조건부 컴파일 기호를 정의합니다. (약식: -d) -langversion:? 언어 버전에 허용되는 값을 표시합니다. -langversion:<문자열> 언어 버전을 'latest'(최신 버전, 부 버전 포함), 'default'('latest'와 같음), 'latestmajor'(최신 버전, 부 버전 제외), 'preview'(최신 버전, 지원되지 않는 미리 보기의 기능 포함) 또는 특정 버전(예: '6' 또는 '7.1')으로 지정합니다. -nullable[+|-] nullable 컨텍스트 옵션 enable|disable을 지정합니다. -nullable:{enable|disable|warnings|annotations} nullable 컨텍스트 옵션 enable|disable|warnings|annotations를 지정합니다. - 보안 - -delaysign[+|-] 강력한 이름 키의 공개 부분만 사용하여 어셈블리 서명을 연기합니다. -publicsign[+|-] 강력한 이름 키의 공개 부분만 사용하여 어셈블리를 공개 서명합니다. -keyfile:<파일> 강력한 이름 키 파일을 지정합니다. -keycontainer:<문자열> 강력한 이름 키 컨테이너를 지정합니다. -highentropyva[+|-] 높은 엔트로피 ASLR을 사용하도록 설정합니다. - 기타 - @<파일> 추가 옵션에 대한 지시 파일을 읽습니다. -help 사용법 메시지를 표시합니다. (약식: -?) -nologo 컴파일러 저작권 메시지를 표시하지 않습니다. -noconfig CSC.RSP 파일을 자동으로 포함하지 않습니다. -parallel[+|-] 동시 빌드입니다. -version 컴파일러 버전 번호를 표시하고 종료합니다. - 고급 - -baseaddress:<주소> 빌드할 라이브러리의 기준 주소입니다. -checksumalgorithm:<alg> PDB에 저장된 소스 파일 체크섬을 계산하기 위한 알고리즘을 지정합니다. 지원되는 값은 SHA1 또는 SHA256(기본값)입니다. -codepage:<n> 소스 파일을 열 때 사용할 코드 페이지를 지정합니다. -utf8output 컴파일러 메시지를 UTF-8 인코딩으로 출력합니다. -main:<형식> 진입점이 포함된 형식을 지정합니다(다른 모든 가능한 진입점 무시). (약식: -m) -fullpaths 컴파일러가 정규화된 경로를 생성합니다. -filealign:<n> 출력 파일 섹션에 사용되는 맞춤을 지정합니다. -pathmap:<K1>=<V1>,<K2>=<V2>,... 컴파일러에서 출력된 소스 경로 이름에 대한 매핑을 지정합니다. -pdb:<파일> 디버그 정보 파일 이름을 지정합니다(기본값: 확장명이 .pdb인 출력 파일 이름). -errorendlocation 각 오류의 끝 위치에 해당하는 줄과 열을 출력합니다. -preferreduilang 기본 출력 언어 이름을 지정합니다. -nosdkpath 기본 SDK 경로에서 표준 라이브러리 어셈블리를 검색하지 않도록 설정합니다. -nostdlib[+|-] 표준 라이브러리(mscorlib.dll)를 참조하지 않습니다. -subsystemversion:<문자열> 이 어셈블리의 하위 시스템 버전을 지정합니다. -lib:<파일 목록> 참조를 위해 검색할 추가 디렉터리를 지정합니다. -errorreport:<문자열> 내부 컴파일러 오류를 처리하는 방법을 prompt, send, queue 또는 none으로 지정합니다. 기본값은 queue입니다. -appconfig:<파일> 어셈블리 바인딩 설정을 포함하는 애플리케이션 구성 파일을 지정합니다. -moduleassemblyname:<문자열> 이 모듈이 속할 어셈블리의 이름입니다. -modulename:<문자열> 소스 모듈의 이름을 지정합니다.
