Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_SingleLineCommentInExpressionHole
source: A single-line comment may not be used in an interpolated string.
cs: V interpolovaném řetězci se nemůže používat jednořádkový komentář.
de: Ein einzeiliger Kommentar darf in einer interpolierten Zeichenfolge nicht verwendet werden.
es: Es posible que no se use un comentario de una sola línea en una cadena interpolada.
ja: 補間された文字列の中で単一行コメントを使用することはできません。
ko: 보간된 문자열에는 한 줄로 된 주석을 사용할 수 없습니다.
pl: W ciągu interpolowanym nie można użyć jednowierszowego komentarza.
tr: Tek satırlık bir yorum, araya alınmış bir dizede kullanılamaz.
zh_hant: 差補字串中不能使用單行註解。

# ERR_RefReturnReadonlyLocal
source: Cannot return '{0}' by reference because it is read-only
cs: {0} nejde vrátit pomocí odkazu, protože je to hodnota jen pro čtení.
de: "{0}" kann nicht als Verweis zurückgegeben werden, weil ein Schreibschutz besteht.
es: {0}' no se puede devolver por referencia porque es de solo lectura.
ja: 読み取り専用であるため、'{0}' を参照渡しで返すことはできません
ko: {0}'은(는) 읽기 전용이므로 참조로 반환할 수 없습니다.
pl: Elementu „{0}” nie można zwrócić przez referencję, ponieważ jest tylko do odczytu
tr: {0}' öğesi salt okunur olduğundan başvuru ile döndürülemez
zh_hant: 無法藉傳址方式傳回 '{0}'，因其為唯讀

# ERR_RefReturnReadonlyLocalCause
source: Cannot return '{0}' by reference because it is a '{1}'
cs: {0} nejde vrátit pomocí odkazu, protože je to {1}.
de: "{0}" kann nicht als Verweis zurückgegeben werden, weil es sich um ein {1}-Element handelt.
es: {0}' no se puede devolver por referencia porque es un '{1}'.
ja: '{1}' であるため、'{0}' を参照渡しで返すことはできません
ko: {0}'은(는) '{1}'이므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić elementu „{0}” przez referencję, ponieważ to jest element „{1}”
tr: {0}' öğesi bir '{1}' olduğundan başvuru ile döndürülemez
zh_hant: 無法藉傳址方式傳回 '{0}'，因其為 '{1}'

# ERR_TooManyUserStrings
source: Combined length of user strings used by the program exceeds allowed limit. Try to decrease use of string literals.
cs: Kombinovaná délka uživatelských řetězců, které používá tento program, překročila povolený limit. Zkuste omezit použití řetězcových literálů.
de: Die kombinierte Länge der vom Programm verwendeten Benutzerzeichenfolgen überschreitet den zulässigen Grenzwert. Versuchen Sie, die Verwendung von Zeichenfolgenliteralen zu verringern.
es: La longitud combinada de las cadenas de usuario que el programa utiliza supera el límite permitido. Intente disminuir el uso de literales de cadena.
ja: プログラムで使うユーザー文字列の長さの合計が許可されている制限を超えています。文字列リテラルの使用を減らしてください。
ko: 프로그램에서 사용하는 사용자 문자열의 결합된 길이가 허용 한도를 초과합니다. 문자열 리터럴의 사용을 줄여 보세요.
pl: Całkowita długość ciągów użytkownika używanych przez program przekracza dozwolony limit. Spróbuj ograniczyć użycie literałów ciągów.
tr: Program tarafından kullanılan kullanıcı dizelerinin toplam uzunluğu, izin verilen sınırı aşıyor. Dize sabit değerlerinin kullanımını azaltmayı deneyin.
zh_hant: 程式所使用的使用者字串加起來長度超過允許限制。請嘗試減少使用字串常值。

# ERR_ImplicitlyTypedOutVariableUsedInTheSameArgumentList
source: Reference to an implicitly-typed out variable '{0}' is not permitted in the same argument list.
cs: Odkaz na implicitně typovanou externí proměnnou {0} není povolený ve stejném seznamu argumentů.
de: Ein Verweis auf eine implizit typisierte out-Variable "{0}" ist in der gleichen Argumentliste unzulässig.
es: No se permite la referencia a una variable out con tipo implícito '{0}' en la misma lista de argumentos.
ja: 暗黙的に型指定された out 変数 '{0}' への参照は、同じ引数リストでは使用できません。
ko: 동일한 인수 목록에서 암시적으로 형식화된 출력 변수 '{0}'에 대한 참조는 허용되지 않습니다.
pl: Odwołanie do zmiennej wyjściowej z niejawnym typem „{0}” jest niedozwolone na tej samej liście argumentów.
tr: Türü örtük olarak belirlenen '{0}' out değişkenine başvuruya aynı bağımsız değişken listesinde izin verilmez.
zh_hant: 不允許在相同引數清單中參考隱含型別 out 變數 '{0}'。

# ERR_CompilerAndLanguageVersion
source: Compiler version: '{0}'. Language version: {1}.
cs: Verze kompilátoru: {0}. Jazyková verze: {1}
de: Compilerversion: "{0}". Sprachversion: {1}.
es: Versión de compilador: "{0}". Versión de lenguaje: {1}.
ja: コンパイラ バージョン: '{0}'。言語バージョン: {1}。
ko: 컴파일러 버전: '{0}'. 언어 버전: {1}.
pl: Wersja kompilatora: „{0}”. Wersja języka: {1}.
tr: Derleyici sürümü: '{0}'. Dil sürümü: {1}.
zh_hant: 編譯器版本: '{0}'。語言版本: {1}。

# ERR_InvalidDebugInfo
source: Unable to read debug information of method '{0}' (token 0x{1:X8}) from assembly '{2}'
cs: Informace o ladění metody {0} (token 0x{1:X8}) ze sestavení {2} nelze přečíst.
de: Die Debuginformationen der Methode "{0}" (Token 0x{1:X8}) können nicht aus der Assembly "{2}" gelesen werden.
es: No se puede leer la información de depuración del método "{0}" (token 0x{1:X8}) desde el ensamblado "{2}".
ja: メソッド '{0}' (トークン 0x{1:X8}) のデバッグ情報をアセンブリ '{2}' から読み取ることができません
ko: {2}' 어셈블리에서 '{0}' 메서드(토큰 0x{1:X8})의 디버그 정보를 읽을 수 없습니다.
pl: Nie można odczytać informacji debugowania metody „{0}” (token 0x{1:X8}) z zestawu „{2}”
tr: {2}' bütünleştirilmiş kodundan '{0}' metodunun hata ayıklama bilgileri okunamıyor (belirteç 0x{1:X8})
zh_hant: 無法從組件 '{2}' 讀取方法 '{0}' 的偵錯資訊 (權杖 0x{1:X8})

# ERR_BadSpecialByRefIterator
source: foreach statement cannot operate on enumerators of type '{0}' in async or iterator methods because '{0}' is a ref struct or a type parameter that allows ref struct.
zh_hant: foreach 陳述式無法對 async 或 iterator 方法中 '{0}' 類型的列舉值運作，因為 '{0}' 是 ref struct 或允許 ref struct 的型別參數。

# ERR_InterceptorsFeatureNotEnabled
source: The 'interceptors' experimental feature is not enabled in this namespace. Add '{0}' to your project.
ja: 'インターセプター' の実験的な機能は、この名前空間では有効になっていません。プロジェクトに '{0}' を追加します。
zh_hant: 未在此命名空間中啟用「攔截器」實驗功能。將 '{0}' 新增至您的專案。

# INF_IdentifierConflictWithContextualKeyword
source: '{0}' is a contextual keyword in property accessors starting in language version {1}. Use '@{0}' instead.
zh_hant: '{0}' 是從語言版本 {1} 開始之屬性存取子中的內容相關關鍵字。請改用 '@{0}'。

# ERR_InitializerOnNonAutoProperty
source: Only auto-implemented properties can have initializers.
cs: Jenom automaticky implementované vlastnosti můžou mít inicializátory.
de: Nur automatisch implementierte Eigenschaften können Initialisierer aufweisen.
es: Solo las propiedades implementadas automáticamente pueden tener inicializadores.
ja: 自動実装プロパティのみが初期化子を持つことができます。
ko: 자동 구현 속성만 이니셜라이저를 사용할 수 있습니다.
tr: Yalnızca otomatik uygulanan özelliklerin başlatıcıları olabilir.
zh_hant: 只有自動實作的屬性可以有初始設定式。

# WRN_WarningDirective
source: #warning: '{0}'
es: #advertencia: '{0}'
zh_hans: #警告:“{0}”

# ERR_BadSpecialByRefUsing
source: A using statement resource of type '{0}' cannot be used in async methods or async lambda expressions.
cs: Prostředek použitého příkazu typu {0} nejde použít v asynchronních metodách ani v asynchronních výrazech lambda.
ja: 型 '{0}' の using ステートメント リソースは、非同期メソッドまたは非同期ラムダ式では使用できません。

# ERR_NoConvToIAsyncDispWrongAsync
source: '{0}': type used in an asynchronous using statement must be implicitly convertible to 'System.IAsyncDisposable' or implement a suitable 'DisposeAsync' method. Did you mean 'using' rather than 'await using'?
cs: {0}: typ použitý v asynchronním příkazu using musí být implicitně převoditelný na System.IAsyncDisposable nebo musí implementovat odpovídající metodu DisposeAsync. Měli jste v úmyslu použít using nebo await using?
de: "{0}": Der in einer asynchronen using-Anweisung verwendete Typ muss implizit in "System.IAsyncDisposable" konvertiert werden können oder eine geeignete DisposeAsync-Methode implementieren. Meinten Sie "using" anstelle von "await using"?
es: "{0}": el tipo usado en una instrucción using asincrónica debe poder convertirse de forma implícita en "System.IAsyncDisposable" o implementar un método "DisposeAsync" adecuado. ¿Quiso decir "using" en lugar de "await using"?
ja: '{0}': 非同期 using ステートメントで使用される型は、暗黙的に 'System.IAsyncDisposable' に変換可能であるか、適切な 'DisposeAsync' メソッドを実装する必要があります。'await using' ではなく 'using' ですか?
ko: '{0}': 비동기 using 문에 사용된 형식은 암시적으로 'System.IAsyncDisposable'로 변환할 수 있거나 적합한 'DisposeAsync' 메서드를 구현해야 합니다. 'await using' 대신 'using'을 사용하시겠습니까?
tr: '{0}': Asenkron bir using deyiminde kullanılan tür örtük olarak 'System.IAsyncDisposable' arabirimine dönüştürebilir olmalı veya uygun bir 'DisposeAsync' metodunu uygulamalıdır. 'await using' yerine 'using' mi kullanmak istediniz?

# ERR_NoConvToIDispWrongAsync
source: '{0}': type used in a using statement must be implicitly convertible to 'System.IDisposable'. Did you mean 'await using' rather than 'using'?
cs: {0}: Typ použitý v příkazu using musí být implicitně převoditelný na System.IDisposable. Neměli jste v úmyslu použít await using místo using?
de: "{0}": Der in einer using-Anweisung verwendete Typ muss implizit in "System.IDisposable" konvertierbar sein. Meinten Sie "await using" anstelle von "using"?
es: "{0}": el tipo usado en una instrucción using debe poder convertirse implícitamente en "System.IDisposable". ¿Quiso decir "await using" en lugar de "using"?
ja: '{0}': using ステートメントで使用される型は、暗黙的に 'System.IDisposable' への変換が可能でなければなりません。'using' ではなく 'await using' ですか?
ko: '{0}': using 문에 사용된 형식은 암시적으로 'System.IDisposable'로 변환할 수 있어야 합니다. 'using' 대신 'await using'을 사용하시겠습니까?
tr: '{0}': using deyiminde kullanılan tür örtük olarak 'System.IDisposable' arabirimine dönüştürülebilir olmalıdır. 'using' yerine 'await using' mi kullanmak istediniz?

# ERR_PartialMethodAccessibilityDifference
source: Both partial method declarations must have identical accessibility modifiers.
cs: Obě deklarace částečných metod musí mít shodné modifikátory přístupnosti.
ja: 両方の部分メソッド宣言には、同じアクセシビリティ修飾子を指定する必要があります。

# ERR_PartialMethodExtendedModDifference
source: Both partial method declarations must have identical combinations of 'virtual', 'override', 'sealed', and 'new' modifiers.
cs: Obě deklarace částečných metod musí mít shodné kombinace modifikátorů virtual, override, sealed a new.
ja: 両方の部分メソッド宣言には、'virtual'、'override'、'sealed'、'new' 修飾子の同じ組み合わせを指定する必要があります。

# ERR_PartialMethodReadOnlyDifference
source: Both partial method declarations must be readonly or neither may be readonly
cs: Obě deklarace částečné metody musí mít modifikátor readonly, nebo nesmí mít modifikátor readonly žádná z nich.
de: Entweder beide oder keine der partiellen Methodendeklarationen müssen als "readonly" festgelegt werden.
es: Ambas declaraciones de métodos parciales deben ser de solo lectura o ninguna de ellas puede ser de solo lectura
ja: 部分メソッド宣言は、両方とも readonly であるか、両方とも readonly でないかのいずれかである必要があります
ko: 두 부분 메서드(Partial method) 선언 모두 readonly이거나 readonly가 아니어야 합니다.
tr: İki kısmi yöntem bildiriminin de saltokunur olması ya da hiçbirinin saltokunur olmaması gerekir

# ERR_PartialMethodRefReturnDifference
source: Partial method declarations must have matching ref return values.
cs: Deklarace částečných metod musí mít odpovídající referenční návratové hodnoty.
ja: 部分メソッドの宣言には、一致する ref 戻り値が必要です。

# ERR_ScopedMismatchInParameterOfPartial
source: The 'scoped' modifier of parameter '{0}' doesn't match partial method declaration.
cs: Modifikátor scoped parametru {0} neodpovídá částečné deklaraci metody.
ja: パラメーター '{0}' の 'scoped' 修飾子が部分メソッド宣言と一致しません。

# ERR_UnscopedRefAttributeInterfaceImplementation
source: UnscopedRefAttribute cannot be applied to an interface implementation.
cs: UnscopedRefAttribute nelze použít na implementaci rozhraní.
ja: UnscopedRefAttribute をインターフェイスの実装に適用することはできません。

# ERR_UnscopedRefAttributeUnsupportedMemberTarget
source: UnscopedRefAttribute can only be applied to struct instance methods and properties, and cannot be applied to constructors or init-only members.
cs: Atribut UnscopedRefAttribute lze použít pouze pro metody a vlastnosti instance struktury a nelze ho použít u konstruktorů nebo členů init-only.
ja: UnscopedRefAttribute は構造体インスタンスのメソッドとプロパティにのみ適用でき、コンストラクターまたは init のみのメンバーには適用できません。

# IDS_ImplicitIndexerInitializer
source: implicit indexer initializer
ja: 暗黙的なインデクサー初期化子

# IDS_StringEscapeCharacter
source: string escape character
ja: 文字列エスケープ文字

# WRN_UninitializedNonNullableField
source: Non-nullable {0} '{1}' must contain a non-null value when exiting constructor. Consider declaring the {0} as nullable.
cs: Proměnná {0} {1}, která nemůže být null, musí při ukončování konstruktoru obsahovat hodnotu, která není null. Zvažte možnost deklarovat {0} jako proměnnou s možnou hodnotou null.
ja: null 非許容の {0} '{1}' には、コンストラクターの終了時に null 以外の値が入っていなければなりません。{0} を Null 許容として宣言することをご検討ください。

# WRN_UninitializedNonNullableField_Title
source: Non-nullable field must contain a non-null value when exiting constructor. Consider declaring as nullable.
cs: Pole, které nemůže být null, musí při ukončování konstruktoru obsahovat hodnotu, která není null. Zvažte možnost deklarovat ho jako pole s možnou hodnotou null.
ja: null 非許容のフィールドには、コンストラクターの終了時に null 以外の値が入っていなければなりません。Null 許容として宣言することをご検討ください。

# ERR_ParamsMustBeArray
source: The params parameter must be a single dimensional array
cs: Parametr params musí být jednorozměrné pole.
de: Der params-Parameter muss ein eindimensionales Array sein.
es: El parámetro params debe ser una matriz unidimensional
ja: params パラメーターは 1 次元配列でなければなりません
ko: 매개 변수 배열은 1차원 배열이어야 합니다.
tr: Params parametresi tek boyutlu bir dizi olmalıdır

# ERR_PartialMisplaced
source: The 'partial' modifier can only appear immediately before 'class', 'record', 'struct', 'interface', or a method return type.
cs: Modifikátor partial se může objevit jen bezprostředně před klíčovými slovy class, record, struct, interface nebo návratovým typem metody.
ja: 'partial' 修飾子は、'class'、'record'、'struct'、'interface'、またはメソッドの戻り値の型の直前にのみ指定できます。

# ERR_NewBoundMustBeLast
source: The new() constraint must be the last constraint specified
cs: Omezení new() musí být poslední zadané omezení.
de: Die new()-Einschränkung muss zuletzt angegeben werden.
es: La restricción new() debe ser la última restricción especificada
ja: new() 制約は最後に指定する制約でなければなりません
ko: new() 제약 조건은 마지막에 지정해야 합니다.
tr: new() kısıtlaması belirtilen son kısıtlama olmalıdır

# ERR_ExplicitParamArray
source: Do not use 'System.ParamArrayAttribute'. Use the 'params' keyword instead.
cs: Nepoužívejte atribut System.ParamArrayAttribute. Použijte místo něj klíčové slovo params.
de: Verwenden Sie nicht System.ParamArrayAttribute, sondern das params-Schlüsselwort.
es: No use 'System.ParamArrayAttribute'. Use la palabra clave 'params' en su lugar.
ja: System.ParamArrayAttribute' を使用しないでください。代わりに 'params' キーワードを使用してください。
ko: System.ParamArrayAttribute'를 사용하지 않고, 대신 'params' 키워드를 사용하세요.
tr: System.ParamArrayAttribute' kullanmayın. Bunun yerine 'params' anahtar sözcüğünü kullanın.

# ERR_RefStructInterfaceImpl
source: '{0}': ref structs cannot implement interfaces
cs: {0}: Struktury REF nemůžou implementovat rozhraní.
de: '{0}: Referenzstrukturen können keine Schnittstellen implementieren.
es: '"{0}": las estructuras ref no pueden implementar interfaces.
ja: '{0}': ref 構造体はインターフェイスを実装できません
ko: '{0}': ref struct에서 인터페이스를 구현할 수 없습니다.
tr: '{0}': başvuru yapı birimleri arabirim uygulayamaz

# ERR_PartialMethodInvalidModifier
source: A partial method cannot have the 'abstract' modifier
cs: Částečná metoda nemůže mít modifikátor abstract.
ja: 部分メソッドに 'abstract' 修飾子を指定することはできません

# ERR_PartialMethodOnlyInPartialClass
source: A partial method must be declared within a partial type
cs: Částečná metoda musí být deklarovaná uvnitř částečného typu.
ja: 部分メソッドは、部分型内で宣言される必要があります

# ERR_PartialMethodNotExplicit
source: A partial method may not explicitly implement an interface method
cs: Částečná metoda nesmí explicitně implementovat metodu rozhraní.
de: Eine partielle Methode darf Schnittstellenmethoden nicht explizit implementieren.
es: Un método parcial no puede implementar explícitamente un método de interfaz
ja: 部分メソッドは、インターフェイス メソッドを明示的に実装できないことがあります
ko: 부분 메서드(Partial Method)는 인터페이스 메서드를 명시적으로 구현할 수 없습니다.
tr: Kısmi bir yöntem bir arabirim yöntemini açık olarak uygulayamaz

# ERR_PartialMethodParamsDifference
source: Both partial method declarations must use a params parameter or neither may use a params parameter
cs: Obě deklarace částečné metody musí používat parametr params nebo ho nepoužívat.
de: Beide partiellen Methodendeklarationen müssen einen params-Parameter verwenden, oder keine von beiden darf einen params-Parameter verwenden.
es: Ambas declaraciones de métodos parciales deben usar un parámetro params; si no, ninguna podrá usarlo
ja: 部分メソッド宣言は、両方とも params パラメーターを使用するか、両方とも params パラメーターを使用しないかのいずれかである必要があります
ko: 두 부분 메서드(Partial Method) 선언 모두 params 매개 변수를 사용하거나 params 매개 변수를 사용할 수 없습니다.
tr: Her iki kısmi yöntem bildirimi de bir params parametresi kullanmalı ya da hiçbiri kullanmamalıdır

# ERR_PartialMethodInconsistentTupleNames
source: Both partial method declarations, '{0}' and '{1}', must use the same tuple element names.
cs: V deklaracích metod, {0} a {1} se musí používat stejné názvy prvků řazené kolekce členů.
de: Die beiden partiellen Methodendeklarationen ("{0}" und "{1}") müssen die gleichen Tupelelementnamen verwenden.
es: Ambas declaraciones de método parcial, '{0}' y '{1}', deben usar los mismos nombres de elementos de tupla.
ja: 部分メソッド宣言 '{0}' および '{1}' は、どちらも同じタプル要素名を使用する必要があります。
ko: 두 부분 메서드(Partial Method) 선언 '{0}' 및 '{1}' 모두에서 동일한 튜플 요소 이름을 사용해야 합니다.
tr: Kısmi metot bildirimlerinin ikisi de ('{0}' ve '{1}') aynı demet öğesi adını kullanmalıdır.

# ERR_PartialMethodStaticDifference
source: Both partial method declarations must be static or neither may be static
cs: Obě deklarace částečné metody musí být statické, nebo nesmí být statická žádná z nich.
de: Beide partiellen Methodendeklarationen müssen statisch sein, oder keine von beiden darf statisch sein.
es: Ambas declaraciones de método parcial deben ser estáticas o ninguna de ellas puede ser estática
ja: 部分メソッド宣言は、両方とも static であるか、両方とも static でないかのいずれかである必要があります
ko: 두 부분 메서드(Partial Method) 선언 모두 static이거나 static이 아니어야 합니다.
tr: İki kısmi yöntem bildiriminin de statik olması ya da hiçbirinin statik olmaması gerekir

# ERR_PartialMethodUnsafeDifference
source: Both partial method declarations must be unsafe or neither may be unsafe
cs: Obě deklarace částečné metody musí být nezabezpečené, nebo nesmí být nezabezpečená žádná z nich.
de: Beide partiellen Methodendeklarationen müssen unsicher sein, oder keine von beiden darf unsicher sein.
es: Ambas declaraciones de métodos parciales deben ser no seguras o ninguna de ellas puede ser no segura
ja: 部分メソッド宣言は、両方とも unsafe であるか、両方とも unsafe でないかのいずれかである必要があります
ko: 두 부분 메서드(Partial Method) 선언 모두 unsafe이거나 unsafe가 아니어야 합니다.
tr: İki kısmi yöntem bildiriminin de güvensiz olması ya da hiçbirinin güvensiz olmaması gerekir

# ERR_IllegalInnerUnsafe
source: Unsafe code may not appear in iterators
cs: Iterátory nesmí obsahovat nezabezpečený kód.
de: Unsicherer Code wird möglicherweise nicht in Iteratoren angezeigt.
es: No puede aparecer código no seguro en iteradores
ja: アンセーフ コードは反復子には記述できません
ko: 반복기에는 안전하지 않은 코드를 사용할 수 없습니다.
tr: Güvenli olmayan kod yineleyicilerde görünmeyebilir

# ERR_NoConvToIDisp
source: '{0}': type used in a using statement must be implicitly convertible to 'System.IDisposable'.
cs: {0}: Typ použitý v příkazu using musí být implicitně převeditelný na System.IDisposable.
de: "{0}": Der in einer using-Anweisung verwendete Typ muss implizit in "System.IDisposable" konvertierbar sein.
es: "{0}": el tipo usado en una instrucción using debe poder convertirse implícitamente en "System.IDisposable".
ja: '{0}': using ステートメントで使用される型は、暗黙的に 'System.IDisposable' への変換が可能でなければなりません。
ko: '{0}': using 문에 사용된 형식은 암시적으로 'System.IDisposable'로 변환할 수 있어야 합니다.
tr: '{0}': using deyiminde kullanılan tür örtük olarak 'System.IDisposable' arabirimine dönüştürülebilir olmalıdır.

# ERR_ByRefTypeAndAwait
source: 'await' cannot be used in an expression containing the type '{0}'
cs: 'Operátor await nejde použít ve výrazu, který obsahuje typ {0}.
de: '"await" kann nicht in einem Ausdruck verwendet werden, der den Typ "{0}" enthält
es: 'await' no se puede usar en una expresión que contenga el tipo '{0}'
ja: 'await' は、型 '{0}' を含む式では使用できません
ko: 'await'는 '{0}' 형식이 포함된 식에 사용할 수 없습니다.
tr: 'await', '{0}' türünü içeren bir ifadede kullanılamaz

# ERR_BadSpecialByRefLocal
source: Parameters or locals of type '{0}' cannot be declared in async methods or async lambda expressions.
cs: Parametry nebo lokální proměnné typu {0} nemůžou být deklarované v asynchronních metodách nebo asynchronních výrazech lambda.
ja: '{0}' 型のパラメーターまたはローカルは、非同期メソッドまたは非同期ラムダ式で宣言することができません。

# ERR_BadSpecialByRefIterator
source: foreach statement cannot operate on enumerators of type '{0}' in async or iterator methods because '{0}' is a ref struct.
cs: Výraz foreach nejde použít na enumerátorech typu {0} v asynchronních metodách nebo metodách iterátoru, protože {0} je struktura REF.
de: Die foreach-Anweisung kann nicht für Enumeratoren vom Typ "{0}" in asynchronen oder Iteratormethoden verwendet werden, weil "{0}" eine Referenzstruktur ist.
es: La instrucción foreach no puede funcionar en enumeradores de tipo "{0}" en métodos async o iterator porque "{0}" es una estructura ref.
ja: '{0}' は ref 構造体であるため、非同期または反復子のメソッド内で型 '{0}' の列挙子に対して foreach ステートメントは機能しません。
ko: {0}'은(는) ref struct이므로 비동기 또는 반복기 메서드의 '{0}' 형식 열거자에서 foreach 문을 수행할 수 없습니다.
tr: {0}' bir başvuru yapısı olduğundan foreach deyimi, async veya iterator metotlarındaki '{0}' türü numaralandırıcılar üzerinde çalışamaz.

# ERR_DefaultValueForParamsParameter
source: Cannot specify a default value for a parameter array
cs: Nejde zadat výchozí hodnotu pro pole parametrů.
de: Es kann kein Standardwert für ein Parameterarray angegeben werden.
es: No se puede especificar un valor predeterminado para una matriz de parámetros
ja: パラメーター配列には既定値を指定できません
ko: 매개 변수 배열의 기본값을 지정할 수 없습니다.
tr: Parametre dizisi için varsayılan değer belirtilemez

# ERR_BadIteratorLocalType
source: Iterators cannot have by-reference locals
cs: Iterátory nemůžou mít lokální proměnné podle odkazu.
de: Iteratoren dürfen keine lokalen by-reference-Elemente aufweisen.
es: Los iteradores no pueden tener variables locales por referencia.
ja: 反復子は参照渡しのローカル変数を持つことができません
ko: 반복기에 by-reference 로컬을 사용할 수 없습니다.
tr: Yineleyiciler başvuruya göre yerel değerlere sahip olamaz

# ERR_BadAsyncLocalType
source: Async methods cannot have by-reference locals
cs: Asynchronní metody nemůžou mít lokální proměnné podle odkazu.
de: Asynchrone Methoden dürfen keine lokalen by-reference-Elemente aufweisen.
es: Los métodos asincrónicos no pueden tener variables locales por referencia.
ja: 非同期メソッドは参照渡しのローカル変数を持つことができません
ko: 비동기 메서드에 by-reference 로컬을 사용할 수 없습니다.
tr: Zaman uyumsuz metotlar başvuruya göre yerel değerlere sahip olamaz

# ERR_NoConvToIAsyncDisp
source: '{0}': type used in an asynchronous using statement must be implicitly convertible to 'System.IAsyncDisposable' or implement a suitable 'DisposeAsync' method.
cs: {0}: typ použitý v asynchronním příkazu using musí být implicitně převoditelný na System.IAsyncDisposable nebo musí implementovat odpovídající metodu DisposeAsync.
de: "{0}": Der in einer asynchronen using-Anweisung verwendete Typ muss implizit in "System.IAsyncDisposable" konvertiert werden können oder eine geeignete DisposeAsync-Methode implementieren.
es: "{0}": el tipo usado en una instrucción using asincrónica debe poder convertirse de forma implícita en "System.IAsyncDisposable" o implementar un método "DisposeAsync" adecuado.
ja: '{0}': 非同期 using ステートメントで使用される型は、暗黙的に 'System.IAsyncDisposable' に変換可能であるか、適切な 'DisposeAsync' メソッドを実装する必要があります。
ko: '{0}': 비동기 using 문에 사용된 형식은 암시적으로 'System.IAsyncDisposable'로 변환할 수 있거나 적합한 'DisposeAsync' 메서드를 구현해야 합니다.
tr: '{0}': Asenkron bir using deyiminde kullanılan tür örtük olarak 'System.IAsyncDisposable' arabirimine dönüştürebilir olmalı veya uygun bir 'DisposeAsync' metodunu uygulamalıdır.

# ERR_EncUpdateFailedDelegateTypeChanged
source: Cannot update because an inferred delegate type has changed.
cs: Nelze aktualizovat, protože se změnil odvozený typ delegáta.
