Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ParameterIsStaticClass
source: '{0}': static types cannot be used as parameters
cs: {0}: Statické typy nejde používat jako parametry.
de: '"{0}": Statische Typen können nicht als Parameter verwendet werden.
es: '{0}': los tipos estáticos no se pueden usar como parámetros
fr: '{0}' : les types static ne peuvent pas être utilisés comme paramètres
it: '{0}': i tipi statici non possono essere usati come parametri
ja: '{0}': スタティック型はパラメーターとして使用することはできません
ko: '{0}': 정적 형식은 매개 변수로 사용할 수 없습니다.
pl: „{0}”: typów statycznych nie można użyć jako parametrów
pt_br: "{0}": classes static não podem ser utilizadas como parâmetros
ru: "{0}": нельзя использовать статические типы в качестве параметров.
tr: '{0}': statik türler parametre olarak kullanılamaz
zh_hans: “{0}”: 静态类型不能用作参数
zh_hant: '{0}': 靜態類型不可用做為參數

# ERR_ReturnTypeIsStaticClass
source: '{0}': static types cannot be used as return types
cs: {0}: Statické typy nejde používat jako typy vracených hodnot.
de: '{0}: Statische Typen können nicht als Rückgabetypen verwendet werden.
es: '{0}': los tipos estáticos no se pueden usar como tipos de valores devueltos
fr: '{0}' : les types static ne peuvent pas être utilisés en tant que types de retour
it: '{0}': i tipi statici non possono essere usati come tipi restituiti
ja: '{0}': スタティック型を戻り値の型として使用することはできません
ko: '{0}': 정적 형식은 반환 형식으로 사용할 수 없습니다.
pl: „{0}”: typów statycznych nie można użyć jako typów w instrukcji return
pt_br: "{0}": tipos static não podem ser usados como tipos de retorno
ru: "{0}": нельзя использовать статические типы в качестве возвращаемых типов.
tr: '{0}': statik türler dönüş türleri olarak kullanılamaz
zh_hans: “{0}”: 静态类型不能用作返回类型
zh_hant: '{0}': 靜態類型不可用做為傳回類型

# ERR_VarDeclIsStaticClass
source: Cannot declare a variable of static type '{0}'
cs: Nejde deklarovat proměnnou statického typu {0}.
de: Die Variable des statischen Typs "{0}" kann nicht deklariert werden.
es: No se puede declarar una variable de tipo estático '{0}'
fr: Impossible de déclarer une variable de type static '{0}'
it: Non è possibile dichiarare una variabile di tipo statico '{0}'
ja: スタティック型 '{0}' の変数を宣言することはできません
ko: {0}' 정적 형식의 변수를 선언할 수 없습니다.
pl: Nie można zadeklarować zmiennej typu statycznego „{0}”
pt_br: Não é possível declarar uma variável de tipo static "{0}"
ru: Не удается объявить переменную статического типа "{0}"
tr: {0}' statik türünün bir değişkeni ifade edilemiyor
zh_hans: 无法声明静态类型“{0}”的变量
zh_hant: 無法宣告靜態類型 '{0}' 的變數

# ERR_BadEmptyThrowInFinally
source: A throw statement with no arguments is not allowed in a finally clause that is nested inside the nearest enclosing catch clause
cs: Příkaz throw bez argumentů není povolený v klauzuli finally, která je vnořená do nejbližší uzavírající klauzule catch.
de: In einer finally-Klausel, die in der nächsten einschließenden catch-Klausel geschachtelt ist, ist keine throw-Anweisung ohne Argumente zulässig.
es: No se permite una instrucción throw sin argumentos en una cláusula finally anidada en la cláusula catch más cercana
fr: Une instruction throw sans argument n'est pas autorisée dans une clause finally qui est imbriquée dans la clause catch englobante la plus proche
it: L'utilizzo dell'istruzione throw senza argomenti non è consentito in una clausola finally annidata all'interno della clausola catch di inclusione più vicina
ja: 引数のない throw ステートメントは、すぐ外側にある catch 句の中に入れ子にされた finally 句の中で使用することはできません
ko: 바로 바깥쪽 catch 절에 중첩된 finally 절에는 인수가 없는 throw 문을 사용할 수 없습니다.
pl: Instrukcja throw bez argumentów jest niedozwolona w klauzuli finally zagnieżdżonej w najbliższej otaczającej klauzuli catch.
pt_br: Não é permitida uma instrução throw sem argumentos em uma cláusula finally que está aninhada dentro da cláusula catch delimitadora mais próxima
ru: Недопустимо использовать оператор throw без аргументов в предложении finally, которая находится в ближайшем вложенном предложении catch.
tr: Bağımsız değişken içermeyen bir throw deyimi, en yakın kapsayan catch yan tümcesinin içindeki bir finally yan tümcesinde kullanılamaz
zh_hans: 最近的封闭 catch 子句内嵌套的 finally 语句中不允许使用不带参数的 throw 语句
zh_hant: 最內層 catch 子句中巢狀 finally 子句不允許沒有引數的 throw 陳述式

# ERR_InvalidSpecifier
source: '{0}' is not a valid format specifier
cs: {0} není platným specifikátorem formátu.
de: '"{0}" ist kein gültiger Formatbezeichner.
es: '{0}' no es un especificador de formato válido
fr: '{0}' n'est pas un spécificateur de format valide
it: '{0}' non è un identificatore di formato valido
ja: '{0}' は有効な形式指定子ではありません
ko: '{0}'은(는) 유효한 서식 지정자가 아닙니다.
pl: „{0}” nie jest prawidłowym specyfikatorem formatu
pt_br: "{0}" não é um especificador de formato válido
ru: "{0}" не является допустимым описателем формата.
tr: '{0}' geçerli bir biçim belirtici değil
zh_hans: “{0}”不是有效的格式说明符
zh_hant: '{0}' 不是有效的格式規範

# WRN_AssignmentToLockOrDispose
source: Possibly incorrect assignment to local '{0}' which is the argument to a using or lock statement. The Dispose call or unlocking will happen on the original value of the local.
cs: Možná existuje nesprávné přiřazení místní proměnné {0}, která je argumentem příkazu using nebo lock. Volání Dispose nebo odemknutí se provede u původní hodnoty místní proměnné.
de: "{0}" (lokal) dient als Argument für eine using- oder lock-Anweisung, hat jedoch möglicherweise einen falschen Wert zugewiesen bekommen. Der Dispose-Aufruf bzw. das Aufheben der Sperre erfolgt für den ursprünglichen Wert der lokalen Variablen.
es: Asignación posiblemente incorrecta a la variable local '{0}', que es el argumento pasado a una instrucción using o lock. La llamada Dispose o el desbloqueo se producirán en el valor original de la variable local.
fr: Assignation potentiellement incorrecte à la variable locale '{0}', qui est l'argument d'une instruction using ou lock. L'appel Dispose ou le déverrouillage se produira sur la valeur d'origine de la variable locale.
it: È probabile che l'assegnazione all'elemento '{0}' locale, che rappresenta l'argomento di un'istruzione using o lock, non sia corretta. La chiamata Dispose o lo sblocco verrà eseguito sul valore originale dell'elemento locale.
ja: using または lock ステートメントの引数であるローカルの '{0}' への代入が間違っている可能性があります。Dispose の呼び出しまたはロック解除がローカルの元の値で実行されます。
ko: using 또는 lock 문의 인수인 지역 변수 '{0}'에 대한 할당이 잘못되었을 수 있습니다. 지역 변수의 원래 값에 대해 Dispose 호출 또는 잠금 해제가 수행됩니다.
pl: Prawdopodobnie niepoprawne przypisanie do elementu lokalnego „{0}”, który jest argumentem instrukcji using lub lock. Wywołanie metody Dispose lub odblokowanie nastąpi dla oryginalnej wartości elementu lokalnego.
pt_br: Atribuição possivelmente incorreta ao local "{0}" que é o argumento para uma instrução using ou lock. A chamada Dispose desbloqueio ou acontecerá no valor original do local.
ru: Возможно, неправильное назначение локальной переменной "{0}", которая является аргументом оператора using или lock. Вызов Dispose или разблокирование произойдет на ее оригинальном значении.
tr: Using veya lock deyimine bağımsız değişken olan '{0}' yerel değeri için büyük olasılıkla hatalı atama yapılmış. Yerel öğenin özgün değerinde Dispose çağrısı veya kilit açma gerçekleştirilecek.
zh_hans: 对局部变量“{0}”的赋值可能不正确，该变量是 using 或 lock 语句的参数。Dispose 调用或解锁将发生在该局部变量的原始值上。
zh_hant: 可能對引數 '{0}' 進行了不正確的指派，而其為 using 或 lock 陳述式的引數。此區域變數的原始值，將會發生 Dispose 呼叫或解除鎖定。

# WRN_AssignmentToLockOrDispose_Title
source: Possibly incorrect assignment to local which is the argument to a using or lock statement
cs: Pravděpodobně nesprávné přiřazení místní hodnotě, která je argumentem příkazu using nebo lock
de: Möglicherweise falsche Zuweisung zur lokalen Ressource, die das Argument zu einer using- oder lock-Anweisung ist.
es: Posiblemente una asignación incorrecta a local, que es el argumento a una instrucción using o lock
fr: Assignation potentiellement incorrecte à la variable locale qui est l'argument d'une instruction using ou lock
it: È probabile che l'assegnazione alla variabile locale, che rappresenta l'argomento di un'istruzione using o lock, non sia corretta
ja: using または lock ステートメントの引数であるローカルへの代入が正しくない可能性があります
ko: using 또는 lock 문의 인수인 지역 변수에 대한 할당이 잘못되었을 수 있습니다.
pl: Możliwe niepoprawne przypisanie do zmiennej lokalnej będącej argumentem instrukcji using lub lock
pt_br: Atribuição possivelmente incorreta ao local que é o argumento para uma instrução using ou lock
ru: Возможно, используется недопустимое назначение для локального параметра, который является аргументом оператора using или lock
tr: Using veya lock deyimine bağımsız değişken olan yerel değeri için büyük olasılıkla hatalı atama yapılmış
zh_hans: 对局部变量的赋值可能不正确，该变量是 using 或 lock 语句的参数
zh_hant: 可能不正確地指派給其為 using 或 lock 陳述式引數的本機

# ERR_ForwardedTypeInThisAssembly
source: Type '{0}' is defined in this assembly, but a type forwarder is specified for it
cs: V tomto sestavení je definovaný typ {0}, je ale pro něj zadané předávání typů.
de: Der Typ "{0}" ist zwar in dieser Assembly definiert, es wurde aber eine Typweiterleitung für ihn festgelegt.
es: El tipo '{0}' está definido en este ensamblado, pero se ha especificado un reenviador de tipos para él
fr: Le type '{0}' est défini dans cet assembly, mais un redirecteur de type est spécifié pour ce type
it: Il tipo '{0}' è definito in questo assembly, ma per esso è specificato un server d'inoltro dei tipi
ja: 型 '{0}' はこのアセンブリ内で定義されていますが、これには型フォワーダーが指定されています
ko: {0}' 형식이 이 어셈블리에 정의되었지만 형식 전달자가 지정되었습니다.
pl: Typ „{0}” jest zdefiniowany w tym zestawie, ale zdefiniowano dla niego funkcję przesyłania typu dalej
pt_br: Tipo "{0}" está definido neste assembly, mas um encaminhador de tipo está especificado para ele
ru: Тип "{0}" определен в этой сборке, но для нее указан метод передачи типа.
tr: {0}' türü bu derlemede tanımlanır, ancak bunun için bir tür ileticisi belirtilir
zh_hans: 类型“{0}”是在此程序集中定义的，但又为它指定了一个类型转发器
zh_hant: 類型 '{0}' 定義於此組件中，但已為其指定類型轉送子

# ERR_ForwardedTypeIsNested
source: Cannot forward type '{0}' because it is a nested type of '{1}'
cs: Nejde předat typ {0}, protože se jedná o vnořený typ {1}.
de: Der Typ "{0}" ist ein geschachtelter Typ von "{1}" und kann daher nicht weitergeleitet werden.
es: El tipo '{0}' no se puede reenviar porque es un tipo anidado de '{1}'
fr: Impossible de transmettre le type '{0}', car il s'agit d'un type imbriqué de '{1}'
it: Non è possibile inoltrare il tipo '{0}' perché è un tipo annidato di '{1}'
ja: 型 '{0}' は、'{1}' の入れ子にされた型なので、転送できません
ko: {0}' 형식은 '{1}'의 중첩 형식이므로 전달할 수 없습니다.
pl: Nie można przesłać typu „{0}”, ponieważ jest to zagnieżdżony typ „{1}”
pt_br: Não é possível encaminhar o tipo "{0}" porque ele é um tipo aninhado de "{1}"
ru: Не удается переадресовать тип "{0}", так как он является вложенным типом "{1}".
tr: {1}' öğesinin iç içe yerleştirilmiş bir türü olduğundan '{0}' türü iletilemiyor
zh_hans: 类型“{0}”是“{1}”的嵌套类型，无法转发
zh_hant: 無法轉送類型 '{0}'，因為其為 '{1}' 的巢狀類型

# ERR_CycleInTypeForwarder
source: The type forwarder for type '{0}' in assembly '{1}' causes a cycle
cs: Předávání typů pro typ {0} v sestavení {1} způsobuje zacyklení.
de: Die Typweiterleitung für den Typ "{0}" in der Assembly "{1}" verursacht eine Schleife.
es: El reenviador del tipo '{0}' en el ensamblado '{1}' crea un ciclo
fr: Le redirecteur de type pour le type '{0}' dans l'assembly '{1}' provoque un cycle
it: Il server d'inoltro del tipo '{0}' nell'assembly '{1}' causa un ciclo
ja: アセンブリ '{1}' にある '{0}' の型フォワーダーで循環が発生します
ko: {0}' 형식에 대한 형식 전달자가 '{1}' 어셈블리에서 순환됩니다.
pl: Funkcja przesyłania dalej dla typu „{0}” w zestawie „{1}” powoduje wystąpienie cyklu
pt_br: O encaminhador de tipo para o tipo "{0}" no assembly "{1}" gera um ciclo
ru: Метод передачи типа для типа "{0}" в сборке "{1}" приводит к циклу.
tr: {1}' derlemesindeki '{0}' türü için tür ileticisi bir döngüye neden oluyor
zh_hans: 程序集“{1}”中类型“{0}”的类型转发器导致循环
zh_hant: 組件 '{1}' 中類型 '{0}' 的類型轉送子造成循環

# ERR_AssemblyNameOnNonModule
source: The /moduleassemblyname option may only be specified when building a target type of 'module'
cs: Parametr /moduleassemblyname jde zadat jenom při vytváření typu cíle module.
de: Die Option /moduleassemblyname kann nur beim Erstellen des Zieltyps "module" angegeben werden.
es: La opción /moduleassemblyname únicamente se puede especificar cuando cree un tipo de destino de 'module'
fr: L'option /moduleassemblyname ne peut être spécifiée que lors de la génération d'un type cible de 'module'
it: L'opzione /moduleassemblyname può essere specificata solo durante la compilazione del tipo di destinazione di 'module'
ja: /moduleassemblyname オプションは 'module' のターゲット型をビルドするときのみ指定できます
ko: /moduleassemblyname 옵션은 빌드하는 대상 형식이 'module'인 경우에만 지정할 수 있습니다.
pl: Opcję /moduleassemblyname można określić tylko w przypadku kompilowania elementu docelowego typu „module”.
pt_br: A opção /moduleassemblyname só pode ser especificada ao criar um tipo de destino de 'module'
ru: Параметр /moduleassemblyname может использоваться только при сборке модуля.
tr: /moduleassemblyname seçeneği yalnızca 'module' öğesinin hedef türü oluşturulurken belirtilebilir
zh_hans: 只有在生成 "module" 目标类型时才能指定 /moduleassemblyname 选项
zh_hant: 只有在建置 'module' 的目標類型時，才可指定 /moduleassemblyname 選項

# ERR_InvalidAssemblyName
source: Assembly reference '{0}' is invalid and cannot be resolved
cs: Odkaz na sestavení {0} je neplatný a nedá se vyhodnotit.
de: Der Assemblyverweis "{0}" ist ungültig und kann nicht aufgelöst werden.
es: La referencia de ensamblado '{0}' no es válida y no se puede resolver
fr: La référence d'assembly '{0}' n'est pas valide et ne peut pas être résolue
it: Il riferimento all'assembly '{0}' non è valido e non può essere risolto
ja: アセンブリ参照 '{0}' は無効であり、解決できません
ko: {0}' 어셈블리 참조가 잘못되어 확인할 수 없습니다.
pl: Odwołanie do zestawu „{0}” jest nieprawidłowe i nie można go rozpoznać
pt_br: Referência do assembly "{0}" é inválida e não pode ser resolvida
ru: Ссылка сборки "{0}" является недопустимой и не может быть разрешена.
tr: {0}' derleme başvurusu geçersiz ve çözümlenemez
zh_hans: 程序集引用“{0}”无效，无法解析
zh_hant: 組件參考 '{0}' 無效，無法解析

# ERR_InvalidFwdType
source: Invalid type specified as an argument for TypeForwardedTo attribute
cs: Neplatný typ zadaný jako argument atributu TypeForwardedTo
de: Ein ungültiger Typ wurde als Argument für das TypeForwardedTo-Attribut angegeben.
es: Tipo no válido especificado como argumento para el atributo TypeForwardedTo
fr: Type non valide spécifié comme argument pour l'attribut TypeForwardedTo
it: Tipo non valido specificato come argomento dell'attributo TypeForwardedTo
ja: 無効な型が TypeForwardedTo 属性の引数として指定されました
ko: TypeForwardedTo 특성의 인수로 잘못된 형식이 지정되었습니다.
pl: Określono nieprawidłowy typ jako argument dla atrybutu TypeForwardedTo.
pt_br: Tipo inválido especificado como argumento para o atributo TypeForwardedTo
ru: В качестве аргумента для атрибута TypeForwardedTo указан недопустимый тип.
tr: TypeForwardedTo özniteliği için bağımsız değişken olarak geçersiz tür belirtildi
zh_hans: 指定为 TypeForwardedTo 特性的参数的类型无效
zh_hant: 指定做為 TypeForwardedTo 屬性引數的類型無效

# ERR_CloseUnimplementedInterfaceMemberStatic
source: '{0}' does not implement instance interface member '{1}'. '{2}' cannot implement the interface member because it is static.
cs: {0} neimplementuje člen rozhraní {1}. {2} nemůže implementovat člen rozhraní, protože je statické.
fr: « {0} » n'implémente pas le membre d'interface d’instance « {1} ». « {2} » ne peut pas implémenter le membre d'interface, car il est static.
it: '{0}' non implementa il membro di interfaccia istanza '{1}'. '{2}' non può implementare il membro di interfaccia perché è di tipo statico.
ja: '{0}' は、インスタンス インターフェイス メンバー '{1}' を実装していません。'{2}' は静的であるため、インターフェイス メンバーを実装できません。
pl: Element „{0}” nie implementuje składowej interfejsu wystąpienia „{1}”. Element „{2}” nie może zaimplementować składowej interfejsu, ponieważ jest ona statyczna.
pt_br: '{0}' não implementa o membro da interface de instância '{1}'. '{2}' não pode implementar o membro da interface porque ele é estático.
ru: "{0}" не реализует элемент экземпляра интерфейса "{1}". "{2}" не может реализовать элемент интерфейса, потому что он является статическим.
zh_hans: “{0}”未实现实例接口成员“{1}”。“{2}”无法实现接口成员，因为它是静态成员。
zh_hant: '{0}' 未實作執行個體介面成員 '{1}'。因為 '{2}' 為靜態，所以無法實作介面成員。

# ERR_CloseUnimplementedInterfaceMemberNotPublic
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement an interface member because it is not public.
cs: {0} neimplementuje člen rozhraní {1}. {2} nemůže implementovat člen rozhraní, protože není veřejné.
de: '"{0}" implementiert den Schnittstellenmember "{1}" nicht. "{2}" ist nicht öffentlich und kann daher keinen Schnittstellenmember implementieren.
es: '{0}' no implementa el miembro de interfaz '{1}'. '{2}' no puede implementar un miembro de interfaz porque no es público.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. '{2}' ne peut pas implémenter un membre d'interface, car il n'est pas public.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare un membro di interfaccia perché non è pubblico.
ja: '{0}' は、インターフェイス メンバー '{1}' を実装していません。'{2}' は public ではないため、インターフェイス メンバーを実装できません。
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다. '{2}'은(는) public이 아니므로 인터페이스 멤버를 구현할 수 없습니다.
pl: 'Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może implementować składowej interfejsu, ponieważ jest niepubliczna.
pt_br: "{0}" não implementa membro de interface "{1}". "{2}" não pode implementar um membro de interface, pois não é público.
ru: "{0}" не реализует член интерфейса "{1}". '{2}" не может реализовать член интерфейса, потому что он не является открытым.
tr: '{0}, '{1}' arabirim üyesini uygulamıyor. '{2}' ortak olmadığından bir arabirim üyesi uygulayamaz.
zh_hans: “{0}”不实现接口成员“{1}”。“{2}”无法实现接口成员，因为它不是公共的。
zh_hant: '{0}' 未實作介面成員 '{1}'。'{2}' 無法實作介面成員，因為其並非公用。

# ERR_CloseUnimplementedInterfaceMemberWrongReturnType
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement '{1}' because it does not have the matching return type of '{3}'.
cs: {0} neimplementuje člen rozhraní {1}. {2} nemůže implementovat člen {1}, protože nemá odpovídající návratový typ {3}.
de: '"{0}" implementiert den Schnittstellenmember "{1}" nicht. "{2}" hat nicht den entsprechenden Rückgabetyp "{3}" und kann "{1}" daher nicht implementieren.
es: '{0}' no implementa el miembro de interfaz '{1}'. '{2}' no puede implementar '{1}' porque no tiene el tipo de valor devuelto coincidente de '{3}'.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. '{2}' ne peut pas implémenter '{1}', car il ne possède pas le type de retour correspondant '{3}'.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare '{1}' perché non ha il tipo restituito corrispondente di '{3}'.
ja: '{0}' は、インターフェイス メンバー '{1}' を実装していません。'{2}' は一致する '{3}' の戻り値の型を持たないため、'{1}' を実装できません。
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다. '{2}'에 일치하는 반환 형식 '{3}'이(가) 없으므로 '{1}'을(를) 구현할 수 없습니다.
pl: 'Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może implementować elementu „{1}”, ponieważ brak pasującego zwracanego typu „{3}”.
pt_br: "{0}" não implementa membro de interface "{1}". "{2}" não pode implementar "{1}" porqu não tem o tipo de retorno correspondente de "{3}".
ru: "{0}" не реализует член интерфейса "{1}". '{2}" не может реализовать "{1}", потому что не имеет соответствующего возвращаемого типа "{3}".
tr: '{0}, '{1}' arabirim üyesini uygulamıyor. '{3}' eşleşen dönüş türüne sahip olmadığından '{2}' '{1}' öğesini uygulayamaz.
zh_hans: “{0}”不实现接口成员“{1}”。“{2}”无法实现“{1}”，因为它没有“{3}”的匹配返回类型。
zh_hant: '{0}' 未實作介面成員 '{1}'。'{2}' 無法實作 '{1}'，因為其沒有符合的傳回類型 '{3}'。

# ERR_DuplicateTypeForwarder
source: '{0}' duplicate TypeForwardedToAttribute
cs: 'Duplicitní TypeForwardedToAttribute {0}
de: '"{0}" TypeForwardedToAttribute-Duplikat
es: 'Elemento TypeForwardedToAttribute duplicado en '{0}'
fr: '{0}' est un doublon de TypeForwardedToAttribute
it: 'TypeForwardedToAttribute è duplicato in '{0}'
ja: '{0}' TypeForwardedToAttribute が重複しています
ko: '{0}'에서 TypeForwardedToAttribute가 중복됩니다.
pl: „{0}” zduplikowany atrybut TypeForwardedToAttribute
pt_br: "{0}" duplicar TypeForwardedToAttribute
ru: "{0}" повторяющийся TypeForwardedToAttribute
tr: '{0}' yinelenen TypeForwardedToAttribute
zh_hans: “{0}”与 TypeForwardedToAttribute 重复
zh_hant: '{0}' 與 TypeForwardedToAttribute 重複

# ERR_ExpectedSelectOrGroup
source: A query body must end with a select clause or a group clause
cs: Za tělem dotazu musí následovat klauzule select nebo group.
de: Auf einen Abfragetext muss eine Select-Klausel oder Group-Klausel folgen.
es: El cuerpo de una consulta debe terminar con una cláusula select o group
fr: Un corps de requête doit terminer par une clause select ou une clause group
it: Il corpo di una query deve terminare con una clausola select o group
ja: クエリ本体の後には select 句または group 句が必要です
ko: 쿼리 본문은 select 절 또는 group 절로 끝나야 합니다.
pl: Treść zapytania musi kończyć się klauzulą „select” lub „group”.
pt_br: O corpo de uma consulta deve terminar com uma cláusula select ou group
ru: Тело запроса должно заканчиваться предложением select или предложением group.
tr: Sorgu gövdesi bir select veya group yan tümcesi ile sonlanmalıdır
zh_hans: 查询正文必须以 select 或 group 子句结尾
zh_hant: 查詢主體必須以 select 或 group 子句結尾

# ERR_ExpectedContextualKeywordOn
source: Expected contextual keyword 'on'
cs: Očekávalo se kontextové klíčové slovo on.
de: Kontextabhängiges Schlüsselwort "on" erwartet.
es: Se esperaba la palabra clave contextual 'on'
fr: Mot clé contextuel 'on' attendu
it: È prevista la parola chiave contestuale 'on'
ja: コンテキスト キーワード 'on' が必要です
ko: 상황별 키워드 'on'이 필요합니다.
pl: Oczekiwano kontekstowego słowa kluczowego „on”
pt_br: Palavra-chave contextual esperada 'on'
ru: Требуется контекстное ключевое слово "on".
tr: Beklenen bağlamsal anahtar sözcük: 'on'
zh_hans: 应为上下文关键字 "on"
zh_hant: 必須是內容關鍵字 'on'

# ERR_ExpectedContextualKeywordEquals
source: Expected contextual keyword 'equals'
cs: Očekávalo se kontextové klíčové slovo equals.
de: Kontextabhängiges Schlüsselwort "equals" erwartet.
es: Se esperaba la palabra clave contextual 'equals'
fr: Mot clé contextuel 'equals' attendu
it: È prevista la parola chiave contestuale 'equals'
ja: コンテキスト キーワード 'equals' が必要です
ko: 상황별 키워드 'equals'가 필요합니다.
pl: Oczekiwano kontekstowego słowa kluczowego „equals”
pt_br: Palavra-chave contextual esperada 'equals'
ru: Требуется контекстное ключевое слово "equals".
tr: Beklenen bağlamsal anahtar sözcük: 'equals'
zh_hans: 应为上下文关键字 "equals"
zh_hant: 必須是內容關鍵字 'equals'

# ERR_ExpectedContextualKeywordBy
source: Expected contextual keyword 'by'
cs: Očekávalo se kontextové klíčové slovo by.
de: Kontextabhängiges Schlüsselwort "by" erwartet.
es: Se esperaba la palabra clave contextual 'by'
fr: Mot clé contextuel 'by' attendu
it: È prevista la parola chiave contestuale 'by'
ja: コンテキスト キーワード 'by' が必要です
ko: 상황별 키워드 'by'가 필요합니다.
pl: Oczekiwano kontekstowego słowa kluczowego „by”
pt_br: Palavra-chave contextual esperada 'by'
ru: Требуется контекстное ключевое слово "by".
tr: Beklenen bağlamsal anahtar sözcük: 'by'
zh_hans: 应为上下文关键字 "by"
zh_hant: 必須是內容關鍵字 'by'
