Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NewOrOverrideExpected_Title
source: Member hides inherited member; missing override keyword
cs: Člen skrývá zděděný člen. Chybí klíčové slovo override.
de: Element blendet vererbtes Element aus; fehlendes Überschreibungsschlüsselwort
es: El miembro oculta el miembro heredado. Falta una contraseña de invalidación
fr: Un membre masque un membre hérité ; le mot clé override est manquant
it: Il membro nasconde il membro ereditato. Manca la parola chiave override
ja: メンバーは継承されたメンバーを非表示にします。override キーワードがありません
ko: 멤버가 상속된 멤버를 숨깁니다. override 키워드가 없습니다.
pl: Składowa ukrywa dziedziczoną składową; brak słowa kluczowego override
pt_br: O membro oculta o membro herdado; palavra-chave substituta ausente
ru: Член скрывает унаследованный член: отсутствует ключевое слово переопределения
tr: Üye devralınmış üyeyi gizler; geçersiz kılma anahtar sözcüğü eksik
zh_hans: 成员隐藏继承的成员；缺少关键字 override
zh_hant: 成員隱藏所繼承的成員; 遺漏 override 關鍵字

# ERR_OverrideNotExpected
source: '{0}': no suitable method found to override
cs: {0}: Nenašla se vhodná metoda k přepsání.
de: '"{0}": Es wurde keine passende Methode zum Überschreiben gefunden.
es: '{0}': no se encontró ningún miembro adecuado para invalidar
fr: '{0}' : aucune méthode appropriée n'a été trouvée pour la substitution
it: '{0}': non sono stati trovati metodi appropriati per eseguire l'override
ja: '{0}': オーバーライドする適切なメソッドが見つかりませんでした
ko: '{0}': 재정의할 적절한 메서드를 찾을 수 없습니다.
pl: „{0}”: nie znaleziono odpowiedniej metody do przesłonięcia
pt_br: "{0}": não encontrado nenhum método adequado para substituição
ru: "{0}": не найден метод, пригодный для переопределения.
tr: '{0}': geçersiz kılmak için uygun yöntem bulunamadı
zh_hans: “{0}”: 没有找到适合的方法来重写
zh_hant: '{0}': 未找到任何合適的方法可覆寫

# ERR_NamespaceUnexpected
source: A namespace cannot directly contain members such as fields, methods or statements
cs: Obor názvů nemůže přímo obsahovat členy, jako jsou pole, metody nebo příkazy.
fr: Un espace de noms ne peut pas contenir directement des membres tels que des champs, des méthodes ou des instructions
it: Uno spazio dei nomi non può contenere direttamente membri come campi, metodi o istruzioni
ja: 名前空間にフィールドやメソッド、またはステートメントのようなメンバーを直接含めることはできません
pl: Przestrzeń nazw nie może bezpośrednio zawierać składowych takich jak pola, metody lub instrukcje
pt_br: Um namespace não pode conter diretamente membros, como campos, métodos ou instruções
ru: Пространство имен не может напрямую включать в себя такие элементы, как методы или операторы
zh_hans: 命名空间不能直接包含字段、方法或语句之类的成员
zh_hant: 命名空間不能直接包含如欄位、方法或陳述式等成員

# ERR_NoSuchMember
source: '{0}' does not contain a definition for '{1}'
cs: {0} neobsahuje definici pro {1}.
de: '"{0}" enthält keine Definition für "{1}".
es: '{0}' no contiene una definición para '{1}'
fr: '{0}' ne contient pas de définition pour '{1}'
it: '{0}' non contiene una definizione per '{1}'
ja: '{0}' に '{1}' の定義がありません
ko: '{0}'에는 '{1}'에 대한 정의가 포함되어 있지 않습니다.
pl: 'Element „{0}” nie zawiera definicji „{1}”.
pt_br: "{0}" não contém uma definição para "{1}"
ru: "{0}" не содержит определение для "{1}".
tr: '{0}' bir '{1}' tanımı içermiyor
zh_hans: “{0}”未包含“{1}”的定义
zh_hant: '{0}' 未包含 '{1}' 的定義

# ERR_BadSKknown
source: '{0}' is a {1} but is used like a {2}
cs: {0} je {1}, ale používá se jako {2}.
de: '"{0}" ist "{1}", wird aber wie "{2}" verwendet.
es: '{0}' es {1} pero se usa como {2}
fr: '{0}' est un {1} mais est utilisé comme un {2}
it: '{0}' è {1} ma è usato come {2}
ja: '{0}' は {1} ですが、{2} のように使用されています
ko: '{0}'은(는) {1}이지만 {2}처럼 사용됩니다.
pl: 'Element „{0}” to element {1}, ale jest używany jak element {2}
pt_br: "{0}" é um {1}, mas é usado como um {2}
ru: "{0}" является {1}, но используется как {2}.
tr: '{0}' bir {1} öğesidir ancak {2} olarak kullanılır
zh_hans: “{0}”是 {1}，但此处被当做 {2} 来使用
zh_hant: '{0}' 是 {1}，但卻當成 {2} 使用

# ERR_BadSKunknown
source: '{0}' is a {1}, which is not valid in the given context
cs: {0} je {1}, což není platné v daném kontextu.
de: '"{0}" ist "{1}" und im angegebenen Kontext nicht gültig.
es: '{0}' es {1}, que no es válida en el contexto indicado
fr: '{0}' est un {1}, qui n'est pas valide dans le contexte donné
it: '{0}' è un '{1}', che non è un costrutto valido nel contesto specificato
ja: '{0}' は {1} です。これは特定のコンテンツでは無効になります
ko: '{0}'은(는) 지정한 컨텍스트에서 유효하지 않은 {1}입니다.
pl: 'Element „{0}” to element „{1}”, który jest nieprawidłowy w podanym kontekście
pt_br: "{0}" é um {1}, que não é válido no contexto fornecido
ru: "{0}" является {1}, который недопустим в данном контексте.
tr: '{0}' verilen bağlamda geçerli olmayan bir {1} öğesidir
zh_hans: “{0}”是一个 {1}，这在给定的上下文中无效
zh_hant: '{0}' 是 {1}，其在指定內容中無效

# ERR_ObjectRequired
source: An object reference is required for the non-static field, method, or property '{0}'
cs: Pro nestatické pole, metodu nebo vlastnost {0} se vyžaduje odkaz na objekt.
de: Für das nicht statische Feld, die Methode oder die Eigenschaft "{0}" ist ein Objektverweis erforderlich.
es: Se requiere una referencia de objeto para el campo, método o propiedad '{0}' no estáticos
fr: Une référence d'objet est requise pour la propriété, la méthode ou le champ non statique '{0}'
it: È necessario un riferimento all'oggetto per la proprietà, il metodo o il campo non statico '{0}'
ja: 静的でないフィールド、メソッド、またはプロパティ '{0}' で、オブジェクト参照が必要です
ko: static이 아닌 필드, 메서드 또는 속성 '{0}'에 개체 참조가 필요합니다.
pl: Dla niestatycznego pola, metody lub właściwości „{0}” wymagane jest odwołanie do obiektu.
pt_br: Uma referência de objeto é necessária para o campo, o método ou a propriedade "{0}" não estática
ru: Для нестатического поля, метода или свойства "{0}" требуется ссылка на объект.
tr: {0}' statik olmayan alanı, yöntemi veya özelliği için nesne başvurusu gerekiyor
zh_hans: 对象引用对于非静态的字段、方法或属性“{0}”是必需的
zh_hant: 需要有物件參考，才可使用非靜態欄位、方法或屬性 '{0}'

# ERR_AmbigCall
source: The call is ambiguous between the following methods or properties: '{0}' and '{1}'
cs: Volání je nejednoznačné mezi následujícími metodami nebo vlastnostmi: {0} a {1}.
de: Der Aufruf unterscheidet nicht eindeutig zwischen den folgenden Methoden oder Eigenschaften: "{0}" und "{1}"
es: La llamada es ambigua entre los métodos o las propiedades siguientes: '{0}' y '{1}'
fr: L'appel est ambigu entre les méthodes ou propriétés suivantes : '{0}' et '{1}'
it: La chiamata è ambigua tra i seguenti metodi o proprietà: '{0}' e '{1}'
ja: 次のメソッドまたはプロパティ間で呼び出しが不適切です: '{0}' と '{1}'
ko: {0}' 및 '{1}'의 메서드 또는 속성 간 호출이 모호합니다.
pl: Wystąpiło niejednoznaczne wywołanie między następującymi dwiema metodami lub właściwościami: „{0}” i „{1}”
pt_br: A chamada é ambígua entre os seguintes métodos ou propriedades: "{0}" e "{1}"
ru: Неоднозначный вызов следующих методов или свойств: "{0}" и "{1}"
tr: Çağrı şu yöntem veya özellikler arasında belirsiz: '{0}' ve '{1}'
zh_hans: 以下方法或属性之间的调用具有二义性:“{0}”和“{1}”
zh_hant: 以下方法或屬性之間的呼叫模稜兩可: '{0}' 和 '{1}'

# ERR_BadAccess
source: '{0}' is inaccessible due to its protection level
cs: 'Typ {0} je vzhledem k úrovni ochrany nepřístupný.
de: 'Der Zugriff auf "{0}" ist aufgrund des Schutzgrads nicht möglich.
es: '{0}' no es accesible debido a su nivel de protección
fr: '{0}' est inaccessible en raison de son niveau de protection
it: '{0}' non è accessibile a causa del livello di protezione
ja: '{0}' はアクセスできない保護レベルになっています
ko: '보호 수준 때문에 '{0}'에 액세스할 수 없습니다.
pl: 'Element „{0}” jest niedostępny z powodu swojego poziomu ochrony.
pt_br: "{0}" é inacessível devido ao seu nível de proteção
ru: "{0}" недоступен из-за его уровня защиты.
tr: '{0}' öğesine koruma düzeyi nedeniyle erişilemiyor
zh_hans: “{0}”不可访问，因为它具有一定的保护级别
zh_hant: '{0}' 由於其保護層級之故，所以無法存取

# ERR_MethDelegateMismatch
source: No overload for '{0}' matches delegate '{1}'
cs: Žádná přetížená metoda {0} neodpovídá delegátovi {1}.
de: Keine Überladung für "{0}" stimmt mit dem Delegaten "{1}" überein.
es: Ninguna sobrecarga correspondiente a '{0}' coincide con el delegado '{1}'
fr: Aucune surcharge pour '{0}' ne correspond au délégué '{1}'
it: Nessun overload per '{0}' corrisponde al delegato '{1}'
ja: デリゲート '{1}' に一致する '{0}' のオーバーロードはありません
ko: {1}' 대리자와 일치하는 '{0}'에 대한 오버로드가 없습니다.
pl: Żadne z przeciążeń dla elementu „{0}” nie pasuje do delegata „{1}”.
pt_br: Nenhuma sobrecarga de "{0}" corresponde ao representante "{1}"
ru: Нет перегруженного метода для "{0}", который соответствует делегату "{1}".
tr: Hiçbir '{0}' yeniden yüklemesi '{1}' temsilcisiyle eşleşmiyor
zh_hans: “{0}”没有与委托“{1}”匹配的重载
zh_hant: '{0}' 沒有任何多載符合委派 '{1}'

# ERR_RetObjectRequired
source: An object of a type convertible to '{0}' is required
cs: Vyžaduje se objekt typu, který se dá převést na {0}.
de: Ein Objekt oder Typ ist erforderlich, der in "{0}" konvertiert werden kann.
es: Se requiere un objeto cuyo tipo se pueda convertir en '{0}'
fr: Un objet d'un type convertible en '{0}' est requis
it: È necessario un oggetto di un tipo convertibile in '{0}'
ja: '{0}' に変換可能な型のオブジェクトが必要です
ko: {0}'(으)로 변환할 수 있는 형식의 개체가 필요합니다.
pl: Wymagany jest obiekt, który można przekonwertować na typ „{0}”
pt_br: Um objeto de tipo conversível em "{0}" é necessário
ru: Требуется объект с типом, приводимым к "{0}".
tr: {0}' öğesine dönüştürülebilir bir türün nesnesi gerekir
zh_hans: 需要一个类型可转换为“{0}”的对象
zh_hant: 需要可轉換成 '{0}' 之類型的物件

# ERR_RetNoObjectRequired
source: Since '{0}' returns void, a return keyword must not be followed by an object expression
cs: Protože {0} vrací void, nesmí za klíčovým slovem return následovat výraz objektu.
de: Da "{0}" "void" zurückgibt, darf auf ein Rückgabeschlüsselwort kein Objektausdruck folgen.
es: Como '{0}' devuelve void, una palabra clave return no debe ir seguida de una expresión de objeto
fr: Comme '{0}' retourne void, un mot clé return ne doit pas être suivi d'une expression d'objet
it: Poiché '{0}' restituisce un valore nullo, una parola chiave di restituzione non deve essere seguita da un'espressione di oggetto
ja: '{0}' は void 型を返すため、キーワード return の後にオブジェクト式を指定することはできません
ko: {0}'이(가) void를 반환하므로 return 키워드 뒤에 개체 식이 나오면 안 됩니다.
pl: Ponieważ element „{0}” zwraca wartość typu void, po słowie kluczowym nie może występować wyrażenie obiektu
pt_br: Como "{0}" retorna void, uma palavra-chave return não deve ser seguida por uma expressão de objeto
ru: Так как "{0}" возвращает значение void, поэтому после ключевого слова return не должно присутствовать выражение объекта.
tr: {0}' void döndürdüğünden, bir dönüş anahtar sözcüğü bir nesne ifadesi tarafından izlenmemelidir
zh_hans: 由于“{0}”返回 void，返回关键字后面不得有对象表达式
zh_hant: 因為 '{0}' 傳回了 void，所以 return 關鍵字之後不可接著物件運算式

# ERR_LocalDuplicate
source: A local variable or function named '{0}' is already defined in this scope
cs: Lokální proměnná nebo funkce s názvem {0} je už v tomto oboru definovaná.
de: Eine lokale Variable oder Funktion mit dem Namen "{0}" ist bereits in diesem Bereich definiert.
es: Una variable o función local denominada '{0}' ya se ha definido en este ámbito
fr: Une variable ou une fonction locale nommée '{0}' est déjà définie dans cette portée
it: In questo ambito è già definita una funzione o una variabile locale denominata '{0}'
ja: '{0}' という名前のローカル変数または関数はこのスコープで既に定義されています
ko: 이름이 '{0}'인 지역 변수 또는 함수가 이미 이 범위 안에 정의되어 있습니다.
pl: Lokalna zmienna lub funkcja o nazwie „{0}” została już zdefiniowana w tym zakresie
pt_br: Uma variável de local ou função denominada '{0}' já está definida neste escopo
ru: Локальная переменная или функция с именем "{0}" уже определена в этой области.
tr: {0}' adlı yerel bir değişken veya işlev bu kapsamda zaten tanımlanmış
zh_hans: 已在此范围定义了名为“{0}”的局部变量或函数
zh_hant: 已經在此範圍內定義名為 '{0}' 的區域變數或函式

# ERR_AssgLvalueExpected
source: The left-hand side of an assignment must be a variable, property or indexer
cs: Levou stranou přiřazení musí být proměnná, vlastnost nebo indexer.
de: Die linke Seite einer Zuweisung muss eine Variable, eine Eigenschaft oder ein Indexer sein.
es: La parte izquierda de una asignación debe ser una variable, una propiedad o un indizador
fr: La partie gauche d'une assignation doit être une variable, une propriété ou un indexeur
it: La parte sinistra di un'assegnazione deve essere una variabile, una proprietà o un indicizzatore
ja: 代入式の左辺には変数、プロパティ、またはインデクサーを指定してください
ko: 할당식의 왼쪽은 변수, 속성 또는 인덱서여야 합니다.
pl: Lewa strona przypisania musi być zmienną, właściwością lub indeksatorem
pt_br: O lado esquerdo de uma atribuição deve ser uma variável, uma propriedade ou um indexador
ru: Левая часть выражения назначения должна быть переменной, свойством или индексатором.
tr: Atamanın sol tarafındaki değişken, özellik veya dizin oluşturucu olmalıdır
zh_hans: 赋值号左边必须是变量、属性或索引器
zh_hant: 指派的左側必須是變數、屬性或索引子

# ERR_StaticConstParam
source: '{0}': a static constructor must be parameterless
cs: {0}: Statický konstruktor musí být bez parametrů.
de: '"{0}": Ein statischer Konstruktor muss parameterlos sein.
es: '{0}': un constructor estático no debe tener parámetros
fr: '{0}' : un constructeur statique ne doit pas avoir de paramètres
it: '{0}': un costruttore statico non deve avere parametri
ja: '{0}': 静的コンストラクターにパラメーターがあってはなりません
ko: '{0}': 정적 생성자에는 매개 변수가 없어야 합니다.
pl: „{0}”: konstruktor statyczny nie może mieć parametrów
pt_br: "{0}": um construtor estático não deve ter parâmetros
ru: "{0}": статический конструктор не должен иметь параметров.
tr: '{0}': bir statik oluşturucusu parametresiz olmalıdır
zh_hans: “{0}”: 静态构造函数必须无参数
zh_hant: '{0}': 靜態建構函式不能使用參數

# ERR_NotConstantExpression
source: The expression being assigned to '{0}' must be constant
cs: Výraz přiřazovaný proměnné {0} musí být konstantou.
de: Der "{0}" zugewiesene Ausdruck muss konstant sein.
es: La expresión que se asigne a '{0}' debe ser constante
fr: L'expression assignée à '{0}' doit être constante
it: L'espressione da assegnare a '{0}' deve essere costante
ja: '{0}' に割り当てられた式は定数でなければなりません
ko: {0}'에 할당할 식은 상수여야 합니다.
pl: Wyrażenie przypisane do elementu „{0}” musi być stałą
pt_br: A expressão que está sendo atribuída a "{0}" deve ser constante
ru: Назначаемое для "{0}" выражение должно быть константным.
tr: {0}' atanan ifade sabit olmalıdır
zh_hans: 指派给“{0}”的表达式必须是常量
zh_hant: 指派至 '{0}' 的運算式必須為常數

# ERR_NotNullConstRefField
source: '{0}' is of type '{1}'. A const field of a reference type other than string can only be initialized with null.
cs: {0} je typu {1}. Pole const s jiným než řetězcovým typem odkazu jde inicializovat jenom hodnotou null.
de: '"{0}" hat den Typ "{1}". Ein Konstantenfeld mit einem anderen Referenztyp als "String" kann nur mit NULL initialisiert werden.
es: '{0}' es de tipo '{1}'. Un campo const de un tipo de referencia que no sea de cadena solo se puede inicializar con NULL.
fr: '{0}' est de type '{1}'. Un champ const d'un type référence autre que string ne peut être initialisé qu'avec null.
it: '{0}' è di tipo '{1}'. Il campo const di un tipo riferimento diverso da stringa può essere inizializzato solo con Null.
ja: '{0}' の型は '{1}' です。文字列以外の参照型の const フィールドは null でのみ初期化できます。
ko: '{0}'의 형식이 '{1}'입니다. 참조 형식이 문자열이 아닌 const 필드는 null로만 초기화할 수 있습니다.
pl: 'Typ elementu „{0}” to „{1}”. Pole stałe typu referencyjnego innego niż string można zainicjować tylko przy użyciu wartości null.
pt_br: "{0}" é do tipo "{1}". Um campo const de um tipo de referência diferente de cadeia de caracteres pode somente ser inicializado com null.
ru: "{0}" является типом "{1}". Константное поле ссылочного типа, отличного от string, может инициализироваться только значением Null.
tr: '{0}', '{1}' türüne sahip. Dizeden başka bir başvuru türünün const alanı yalnızca null ile başlatılabilir.
zh_hans: “{0}”的类型为“{1}”。只能用 Null 对引用类型(字符串除外)的常量字段进行初始化。
zh_hant: '{0}' 為類型 '{1}'。非字串之參考類型的 const 欄位，只能以 null 初始設定。

# ERR_LocalIllegallyOverrides
source: A local or parameter named '{0}' cannot be declared in this scope because that name is used in an enclosing local scope to define a local or parameter
cs: Místní proměnná nebo parametr s názvem {0} se nedá deklarovat v tomto oboru, protože se tento název používá v uzavírajícím místním oboru pro definování místní proměnné nebo parametru.
de: Eine lokale Variable oder ein Parameter namens "{0}" kann in diesem Bereich nicht deklariert werden, da der Name in einem einschließenden lokalen Bereich zur Definition einer lokalen Variablen oder eines Parameters verwendet wird.
es: Una variable local o un parámetro denominados '{0}' no se pueden declarar en este ámbito porque ese nombre se está usando en un ámbito local envolvente para definir una variable local o un parámetro
fr: Impossible de déclarer une variable locale ou un paramètre nommé '{0}' dans cette portée, car ce nom est utilisé dans une portée locale englobante pour définir une variable locale ou un paramètre
it: Non è possibile dichiarare in questo ambito una variabile locale o un parametro denominato '{0}' perché tale nome viene usato in un ambito locale di inclusione per definire una variabile locale o un parametro
ja: ローカルまたはパラメーター '{0}' は、その名前が外側のローカルのスコープでローカルやパラメーターの定義に使用されているため、このスコープでは宣言できません
ko: 이름이 '{0}'인 지역 또는 매개 변수는 이 범위에서 선언될 수 없습니다. 해당 이름이 지역 또는 매개 변수를 정의하기 위해 바깥쪽 지역 범위에서 사용되었습니다.
pl: Element lokalny lub parametr o nazwie „{0}” nie może zostać zadeklarowany w tym zakresie, ponieważ ta nazwa jest już użyta w otaczającym zakresie lokalnym do zdefiniowania elementu lokalnego lub parametru
pt_br: Um local ou um parâmetro denominado "{0}" não pode ser declarado neste escopo porque esse nome é usado em um escopo delimitador de local para definir um local ou parâmetro
ru: Локальная переменная или параметр с именем "{0}" нельзя объявить в данной области, так как это имя используется во включающей локальной области для определения локальной переменной или параметра
tr: {0}' adlı bir yerel veya parametre, bu ad bir kapanış yerel kapsamında bir yereli veya parametreyi tanımlamak için kullanıldığından bu kapsamda ifade edilemiyor
zh_hans: 无法在此范围中声明名为“{0}”的局部变量或参数，因为该名称在封闭局部范围中用于定义局部变量或参数
zh_hant: 無法在此範圍宣告名為 '{0}' 的區域變數或參數，因為該名稱已用於封入區域變數範圍，以定義區域變數或參數

# ERR_BadUsingNamespace
source: A 'using namespace' directive can only be applied to namespaces; '{0}' is a type not a namespace. Consider a 'using static' directive instead
cs: Direktivu using namespace jde uplatnit jenom u oborů názvů; {0} je typ, ne obor názvů. Zkuste radši použít direktivu using static.
de: Eine "using-Namespace"-Anweisung kann nur auf Namespaces angewendet werden. "{0}" ist ein Typ und kein Namespace. Verwenden Sie stattdessen eine "using static"-Anweisung
es: Las directivas de uso de espacio de nombres solo se pueden aplicar a espacios de nombres. '{0}' es un tipo, no un espacio de nombres. Puede que deba utilizar una directiva de uso de versión estática en su lugar
fr: Une directive 'using namespace' ne peut être appliquée qu'aux espaces de noms ; '{0}' est un type, pas un espace de noms. Utilisez plutôt une directive 'using static'
it: Una direttiva using dello spazio dei nomi può essere applicata solo a spazi dei nomi. '{0}' è un tipo, non uno spazio dei nomi. Provare a usare una direttiva 'using static'
ja: using namespace' ディレクティブは名前空間に対してのみ適用できます。'{0}' は名前空間ではなく型です。代わりに 'using static' ディレクティブを使用することを検討してください。
ko: using namespace' 지시문은 네임스페이스에만 적용할 수 있습니다. '{0}'은(는) 네임스페이스가 아니라 형식입니다. 대신 'using static' 지시문을 사용하세요.
pl: Dyrektywa „using namespace” może być stosowana tylko do przestrzeni nazw. Element „{0}” to typ, a nie przestrzeń nazw. Zamiast tego rozważ użycie dyrektywy „using static”
pt_br: Uma diretiva de 'usando namespace' pode apenas ser aplicada a namespaces; '{0}' é um tipo, não um namespace. Considere uma diretiva 'usando estático'
ru: Директива "using namespace" может применяться только к пространствам имен; "{0}" является типом, а не пространством имен. Используйте директиву "using static"
tr: using namespace' yönergesi yalnızca ad alanlarına uygulanabilir; '{0}', bir ad alanı değil, türdür. Bunun yerine 'using static' yönergesi uygulayabilirsiniz
zh_hans: “using namespace”指令只能应用于命名空间；“{0}”是一个类型而不是命名空间。请考虑改用“using static”指令
zh_hant: using namespace' 指示詞只能套用至命名空間; '{0}' 是類型而非命名空間。請考慮改用 'using static' 指示詞

# ERR_BadUsingType
source: A 'using static' directive can only be applied to types; '{0}' is a namespace not a type. Consider a 'using namespace' directive instead
cs: Direktiva using static se dá použít jenom u typů; {0} je obor názvů, ne typ. Zkuste radši použít direktivu using namespace.
de: Eine "using static"-Anweisung kann nur auf Typen angewendet werden. "{0}" ist ein Namespace und kein Typ. Verwenden Sie stattdessen eine "using namespace"-Anweisung
es: Las directivas de uso de versión estática solo se pueden aplicar a tipos. '{0}' es un espacio de nombres, no un tipo. Puede que deba utilizar una directiva de uso de espacio de nombres en su lugar
fr: Une directive 'using static' ne peut être appliquée qu'aux types ; '{0}' est un espace de noms, pas un type. Utilisez plutôt une directive 'using namespace'
it: Una direttiva 'using static' può essere applicata solo a tipi. '{0}' è uno spazio dei nomi, non un tipo. Provare a usare una direttiva 'using namespace'
ja: using static' ディレクティブは型に対してのみ適用できます。'{0}' は型ではなく名前空間です。代わりに 'using namespace' ディレクティブを使用することを検討してください。
ko: using static' 지시문은 형식에만 적용할 수 있습니다. '{0}'은(는) 형식이 아니라 네임스페이스입니다. 대신 'using namespace' 지시문을 사용하세요.
pl: Dyrektywa „using static” może być stosowana tylko do typów. Element „{0}” to przestrzeń nazw, a nie typ. Zamiast tego rozważ użycie dyrektywy „using namespace”
pt_br: Uma diretiva de 'usando estático' pode apenas ser aplicada a tipos; '{0}' é um namespace, não um tipo. Considere uma diretiva 'usando namespace'
ru: Директива "using static" может применяться только к типам; "{0}" является пространством имен, а не типом. Используйте директиву "using namespace"
tr: using static' yönergesi yalnızca türlere uygulanabilir; '{0}', bir tür değil, alan adıdır. Bunun yerine 'using namespace' yönergesi uygulayabilirsiniz
zh_hans: “using static” 指令只能应用于类型；“{0}”是一个命名空间而不是类型。请考虑改用“using namespace”指令
zh_hant: using static' 指示詞只能套用至類型; '{0}' 是命名空間而非類型。請考慮改用 'using namespace' 指示詞

# ERR_NoAliasHere
source: A 'using static' directive cannot be used to declare an alias
cs: Direktiva using static se nedá použít k deklarování aliasu.
de: using static-Anweisungen können nicht zum Deklarieren eines Alias verwendet werden
es: No se puede usar una directiva de uso de versión estática para declarar un alias
fr: Une directive 'using static' ne peut pas être utilisée pour déclarer un alias
it: Non è possibile usare una direttiva 'using static' per dichiarare un alias
ja: using static' ディレクティブはエイリアスの宣言には使用できません
ko: using static' 지시문을 사용하여 별칭을 선언할 수는 없습니다.
pl: Za pomocą dyrektywy „using static” nie można deklarować aliasu
pt_br: Uma diretiva 'usando estático' não pode ser usada para declarar um alias
ru: Невозможно использовать директиву "using static" для объявления псевдонима
tr: Bir 'using static' yönergesi, diğer ad bildirmek için kullanılamaz
zh_hans: “using static”指令不能用于声明别名
zh_hant: using static' 指示詞不能用來宣告別名

# ERR_NoBreakOrCont
source: No enclosing loop out of which to break or continue
cs: Příkazy break a continue nejsou uvedené ve smyčce.
de: Keine einschließende Schleife, aus der angehalten und fortgefahren werden kann.
es: No hay ningún bucle envolvente desde el que interrumpir o continuar
fr: Absence de boucle englobant 'break' ou 'continue'
it: Non esiste alcun ciclo di inclusione all'esterno del quale interrompere o continuare
ja: break または continue に対応するループがありません
ko: break 또는 continue되어 빠져 나갈 루프가 없습니다.
pl: Brak pętli otaczającej, w której ma nastąpić przerwanie lub kontynuowanie
pt_br: Nenhum loop delimitador a partir do qual quebrar ou continuar
ru: Отсутствует внешний цикл для прерывания или продолжения.
tr: Durdurulacak veya devam ettirilecek kapsayan bir döngü yok
zh_hans: 没有要中断或继续的封闭循环
zh_hant: 沒有可中斷或繼續的封閉式迴圈
