Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NullableUnconstrainedTypeParameter
source: A nullable type parameter must be known to be a value type or non-nullable reference type unless language version '{0}' or greater is used. Consider changing the language version or adding a 'class', 'struct', or type constraint.
cs: Pokud se nepoužívá verze jazyka {0} nebo novější, musí být pro parametr typu s možnou hodnotou null známo, že má typ hodnoty nebo typ odkazu, který není možné nastavit na null. Zvažte možnost změnit verzi jazyka nebo přidat class, struct nebo omezení typu.
fr: Un paramètre de type nullable doit être connu pour pouvoir être un type valeur ou un type référence non-nullable, sauf si le langage version '{0}' ou ultérieure est utilisé. Pensez à changer la version du langage ou à ajouter une contrainte 'class', 'struct' ou de type.
it: Un parametro di tipo nullable deve essere noto per essere un tipo valore o un tipo riferimento non nullable, a meno che non venga usata la versione '{0}' o successiva del linguaggio. Provare a cambiare la versione del linguaggio o ad aggiungere un vincolo di tipo, 'class' o 'struct'.
ja: 言語バージョン '{0}' 以上を使用していない限り、null 許容の型パラメーターは値の型または null 非許容の参照型であることがわかっている必要があります。言語バージョンを変更するか、'class'、'struct'、または型制約を追加することをご検討ください。
pl: Parametr typu przyjmującego wartość null musi być znany jako typ wartości lub typ odwołania niedopuszczający wartości null, chyba że zostanie użyta wersja języka „{0}” lub nowsza. Rozważ zmianę wersji języka lub dodanie ograniczenia „class”, „struct” lub „type”.
pt_br: Um parâmetro de tipo que permite valor nulo precisa ser conhecido como um tipo de valor ou um tipo de referência não anulável, a menos que seja usada a versão da linguagem '{0}' ou superior. Considere alterar a versão da linguagem ou adicionar uma restrição 'class', 'struct' ou de tipo.
ru: Параметр типа, допускающий значение null, должен представлять собой тип значения или ссылку на тип, не допускающую значение null, если не используется версия языка "{0}" или выше. Попробуйте изменить версию языка или добавить ограничение "class", "struct" или ограничение типа.
zh_hans: 可以为 null 的类型参数必须已知为值类型或不可以为 null 的引用类型，除非使用了语言版本“{0}”或更高版本。请考虑更改语言版本或添加 "class"、"struct" 或类型约束。
zh_hant: 除非使用語言版本 '{0}' 或更新版本，否則就必須知道可為 Null 的型別參數是實值型別還是不可為 Null 的參考型別。請考慮變更語言版本，或新增 'class'、'struct' 或類型條件約束。

# ERR_OmittedTypeArgument
source: Omitting the type argument is not allowed in the current context
cs: V aktuálním kontextu se vynechání argumentu typu nepodporuje.
fr: L'omission de l'argument de type n'est pas autorisée dans le contexte actuel
it: Nel contesto corrente non è possibile omettere l'argomento tipo
ja: 型引数を省略することは、現在のコンテキストでは許可されません
pl: Pominięcie argumentu typu jest niedozwolone w bieżącym kontekście
pt_br: Omitir o argumento de tipo não é permitido no contexto atual
ru: Пропуск аргумента типа в текущем контексте не допускается.
zh_hans: 当前上下文中不允许省略类型参数
zh_hant: 不允許在目前的內容中省略型別引數

# ERR_OperatorCantBeChecked
source: User-defined operator '{0}' cannot be declared checked
cs: Uživatelsky definovaný operátor {0} nejde deklarovat zaškrtnutý.
fr: Impossible de vérifier l’opérateur défini par l’utilisateur '{0}'
it: Impossibile dichiarare controllato l'operatore '{0}' definito dall'utente
ja: ユーザー定義演算子 '{0}' はチェック済みと宣言できません。
pl: Nie można zadeklarować operatora „{0}” zdefiniowanego przez użytkownika
pt_br: O operador definido pelo usuário '{0}' não pode ser declarado verificado
ru: Невозможно объявить определяемый пользователем оператор "{0}" как проверенный
zh_hans: 用户定义的运算符 '{0}' 无法声明为已验证
zh_hant: 使用者定義的運算子 '{0}' 無法宣告為已檢查

# ERR_OperatorInExtensionOfStaticClass
source: An extension block extending a static class cannot contain user-defined operators
pt_br: Um bloco de extensão que estende uma classe estática não pode conter operadores definidos pelo usuário

# ERR_OperatorMismatchOnOverride
source: '{0}': cannot override inherited member '{1}' because one of them is not an operator.
pt_br: "{0}": não é possível substituir o membro herdado "{1}" porque um deles não é um operador.

# ERR_OperatorMustReturnVoid
source: The return type for this operator must be void
pt_br: O tipo de retorno para este operador deve ser nulo

# ERR_OperatorsMustBePublic
source: User-defined operator '{0}' must be declared public
pt_br: O operador definido pelo usuário "{0}" deve ser declarado público

# ERR_OperatorsMustBeStaticAndPublic
source: User-defined operator '{0}' must be declared static and public
pt_br: O operador definido pelo usuário "{0}" deve ser declarado como static e public

# ERR_OutAttrOnRefReadonlyParam
source: A ref readonly parameter cannot have the Out attribute.
fr: Un paramètre ref readonly ne peut pas avoir l’attribut Out.
it: Un parametro ref readonly non può avere l'attributo Out.
ja: ref 読み取り専用パラメーターに Out 属性を指定することはできません。
pl: Parametr ref readonly nie może mieć atrybutu Out.
pt_br: Um parâmetro ref readonly não pode ter o atributo Out.
ru: Параметр ref, доступный только для чтения, не может иметь атрибут Out.
zh_hans: ref readonly 参数不能具有 Out 属性。
zh_hant: ref readonly 參數不能有 Out 屬性。

# ERR_OutVariableCannotBeByRef
source: An out variable cannot be declared as a ref local
cs: Výstupní proměnná nemůže být deklarovaná jako lokální proměnná podle odkazu.
de: Eine out-Variable kann nicht als lokales ref-Element deklariert werden.
es: Una variable out no se puede declarar como ref local
fr: Impossible de déclarer une variable out en tant que variable locale ref
it: Non è possibile dichiarare una variabile out come variabile locale ref
ja: out 変数を ref ローカルと宣言することはできません
ko: 출력 변수는 참조 로컬로 선언할 수 없습니다.
pl: Zmiennej out nie można zadeklarować jako lokalnej zmiennej ref
pt_br: Uma variável out não pode ser declarada como uma referência local
ru: Выходная переменная не может быть объявлена как локальная переменная ref
tr: Bir out değişkeni ref yerel değeri olarak bildirilemez
zh_hans: out 变量无法声明为 ref 局部变量
zh_hant: out 變數不可宣告為 ref local

# ERR_OverrideDefaultConstraintNotSatisfied
source: Method '{0}' specifies a 'default' constraint for type parameter '{1}', but corresponding type parameter '{2}' of overridden or explicitly implemented method '{3}' is constrained to a reference type or a value type.
cs: Metoda {0} určuje omezení default pro parametr typu {1}, ale odpovídající parametr typu {2} přepsané nebo explicitně implementované metody {3} není omezený na typ odkazu nebo hodnoty.
fr: La méthode '{0}' spécifie une contrainte 'default' pour le paramètre de type '{1}', mais le paramètre de type '{2}' correspondant de la méthode substituée ou explicitement implémentée '{3}' est limité à un type référence ou à un type valeur.
it: Il metodo '{0}' specifica un vincolo 'default' per il parametro di tipo '{1}', ma il parametro di tipo corrispondente '{2}' del metodo '{3}' sottoposto a override o implementato in modo esplicito è vincolato a un tipo riferimento a un tipo valore.
ja: メソッド '{0}' は、型パラメーター '{1}' に対して 'default' 制約を指定していますが、オーバーライドされた、または明示的に実装されたメソッド '{3}' の対応する型パラメーター '{2}' は、参照型または値の型に制約されています。
pl: Metoda „{0}” określa ograniczenie „default” dla parametru typu „{1}”, lecz odpowiadający parametr typu „{2}” przesłoniętej lub jawnie zaimplementowanej metody „{3}” jest ograniczony do typu odwołania lub typu wartości.
pt_br: O método '{0}' especifica uma restrição 'default' para o parâmetro de tipo '{1}', mas o parâmetro de tipo correspondente '{2}' do método substituído ou implementado explicitamente '{3}' está restrito por um tipo de referência ou um tipo de valor.
ru: Метод "{0}" задает ограничение "default" для параметра типа "{1}", но соответствующий параметр типа "{2}" переопределенного или явно реализованного метода "{3}" ограничен и может представлять собой только тип ссылки или тип значения.
zh_hans: 方法“{0}”为类型参数“{1}”指定了 "default" 约束，但被替代的或显式实现的方法“{3}”的对应类型参数“{2}” 仅限于引用类型或值类型。
zh_hant: 方法 '{0}' 會為型別參數 '{1}' 指定 'default' 條件約束，但覆寫或明確實作方法 '{3}' 的對應型別參數 '{2}' 會限制為參考型別或實值型別。

# ERR_OverrideMustHaveRequired
source: '{0}' must be required because it overrides required member '{1}'
cs: {0} musí být požadováno, protože přepíše požadovaný člen {1}
fr: '{0}' doit être obligatoire, car il remplace le membre requis '{1}'
it: '{0}' deve essere obbligatorio perché esegue l’override del membro obbligatorio '{1}'
ja: 必要なメンバー'{1}'をオーバーライドするため、'{0}' が必須です
pl: „{0}” musi być wymagana, ponieważ przesłania wymaganą składową „{1}”
pt_br: '{0}' deve ser requerido porque substitui o membro requerido '{1}'
ru: Необходимо требовать "{0}" до переопределения обязательного элемента "{1}"
zh_hans: 必须需要'{0}'，因为它会覆盖必需的成员 '{1}'
zh_hant: '{0}' 必須為必要項目，因為它會覆蓋必要的成員 '{1}'

# ERR_OverrideRefConstraintNotSatisfied
source: Method '{0}' specifies a 'class' constraint for type parameter '{1}', but corresponding type parameter '{2}' of overridden or explicitly implemented method '{3}' is not a reference type.
cs: Metoda {0} určuje omezení class pro parametr typu {1}, ale odpovídající parametr typu {2} přepsané nebo explicitně implementované metody {3} není odkazový typ.
de: Die Methode "{0}" gibt eine class-Einschränkung für den Typparameter "{1}" an, aber der zugehörige Typparameter "{2}" der außer Kraft gesetzten oder explizit implementierten Methode "{3}" ist kein Verweistyp.
es: El método "{0}" especifica una restricción "class" para el parámetro de tipo "{1}", pero el parámetro de tipo correspondiente "{2}" de los métodos invalidados o implementados explícitamente "{3}" no es un tipo de referencia.
fr: La méthode '{0}' spécifie une contrainte 'class' pour le paramètre de type '{1}', mais le paramètre de type '{2}' correspondant de la méthode substituée ou explicitement implémentée '{3}' n'est pas un type référence.
it: Il metodo '{0}' specifica un vincolo 'class' per il parametro di tipo '{1}', ma il parametro di tipo corrispondente '{2}' del metodo '{3}' sottoposto a override o implementato in modo esplicito non è un tipo riferimento.
ja: メソッド '{0}' は、型パラメーター '{1}' に対して 'class' 制約を指定していますが、オーバーライドされた、または明示的に実装されたメソッド '{3}' の対応する型パラメーター '{2}' は参照型ではありません。
ko: '{0}' 메서드는 형식 매개 변수 '{1}'의 'class' 제약 조건을 지정하지만 재정의되었거나 명시적으로 구현된 '{3}' 메서드의 해당 형식 매개 변수 '{2}'이(가) 참조 형식이 아닙니다.
pl: Metoda „{0}” określa ograniczenie „class” dla parametru typu „{1}”, lecz odpowiadający parametr typu „{2}” przesłoniętej lub jawnie zaimplementowanej metody „{3}” nie jest typem referencyjnym.
pt_br: O método '{0}' especifica uma restrição de 'class' para o parâmetro de tipo '{1}', mas o parâmetro de tipo correspondente '{2}' do método substituído ou implementado explicitamente '{3}' não é um tipo de referência.
ru: Метод "{0}" задает ограничение class для параметра типа "{1}", но соответствующий параметр типа "{2}" переопределенного или явно реализованного метода "{3}" не является ссылочным типом.
tr: '{0}' yöntemi, '{1}' tür parametresi için bir 'class' kısıtlaması belirtiyor, ancak geçersiz kılınan veya açıkça uygulanan '{3}' yönteminin karşılık gelen '{2}' tür parametresi bir başvuru türü değil.
zh_hans: 方法 "{0}" 为类型参数 "{1}" 指定了 "class" 约束，但重写的或显式实现的方法 "{3}" 的对应类型参数 "{2}" 不是引用类型。
zh_hant: 方法 '{0}' 會為型別參數 '{1}' 指定 'class' 條件約束，但覆寫或明確實作的方法 '{3}' 對應型別參數 '{2}' 不屬於參考型別。

# ERR_OverrideValConstraintNotSatisfied
source: Method '{0}' specifies a 'struct' constraint for type parameter '{1}', but corresponding type parameter '{2}' of overridden or explicitly implemented method '{3}' is not a non-nullable value type.
cs: Metoda {0} určuje omezení struct pro parametr typu {1}, ale odpovídající parametr typu {2} přepsané nebo explicitně implementované metody {3} není typ, který nemůže mít hodnotu null.
de: Die Methode "{0}" gibt eine struct-Einschränkung für den Typparameter "{1}" an, aber der zugehörige Typparameter "{2}" der außer Kraft gesetzten oder explizit implementierten Methode "{3}" ist kein Non-Nullable-Werttyp.
es: El método "{0}" especifica una restricción "struct" para el parámetro de tipo "{1}", pero el parámetro de tipo correspondiente "{2}" de los métodos invalidados o implementados explícitamente "{3}" no es un tipo de valor que acepta valores NULL.
fr: La méthode '{0}' spécifie une contrainte 'struct' pour le paramètre de type '{1}', mais le paramètre de type '{2}' correspondant de la méthode substituée ou explicitement implémentée '{3}' n'est pas un type valeur non-nullable.
it: Il metodo '{0}' specifica un vincolo 'struct' per il parametro di tipo '{1}', ma il parametro di tipo corrispondente '{2}' del metodo '{3}' sottoposto a override o implementato in modo esplicito non è un tipo valore che non ammette valori Null.
ja: メソッド '{0}' は、型パラメーター '{1}' に対して 'struct' 制約を指定していますが、オーバーライドされた、または明示的に実装されたメソッド '{3}' の対応する型パラメーター '{2}' は NULL 非許容の値型ではありません。
ko: '{0}' 메서드는 형식 매개 변수 '{1}'의 'struct' 제약 조건을 지정하지만 재정의되었거나 명시적으로 구현된 '{3}' 메서드의 해당 형식 매개 변수 '{2}'이(가) null을 허용하지 않는 값 형식이 아닙니다.
pl: Metoda „{0}” określa ograniczenie „struct” dla parametru typu „{1}”, lecz odpowiadający parametr typu „{2}” przesłoniętej lub jawnie zaimplementowanej metody „{3}” nie jest nienullowalnym typem wartości.
pt_br: O método '{0}' especifica uma restrição 'struct' para o parâmetro de tipo '{1}', mas o parâmetro de tipo correspondente '{2}' do método substituído ou implementado explicitamente '{3}' não é um tipo de valor não anulável.
ru: Метод "{0}" задает ограничение struct для параметра типа "{1}", но соответствующий параметр типа "{2}" переопределенного или явно реализованного метода "{3}" не является типом значения, не допускающим значение NULL.
tr: '{0}' yöntemi, '{1}' tür parametresi için bir 'struct' kısıtlaması belirtiyor, ancak geçersiz kılınan veya açıkça uygulanan '{3}' yönteminin karşılık gelen '{2}' tür parametresi boş değer atanamaz bir tip değil.
zh_hans: 方法 "{0}" 为类型参数 "{1}" 指定了 "struct" 约束，但重写的或显式实现的方法 "{3}" 的相应类型参数 "{2}" 不是不可为 null 的值类型。
zh_hant: 方法 '{0}' 會為型別參數 '{1}' 指定 'struct' 條件約束，但覆寫或明確實作的方法 '{3}' 對應型別參數 '{2}' 是不可為 Null 實值型別。

# ERR_PPIgnoredFollowsIf
source: '#:' directives cannot be after '#if' directive
pt_br: Diretivas "#:" não podem estar após a diretiva "#if"

# ERR_PPIgnoredFollowsToken
source: '#:' directives cannot be after first token in file
pt_br: Diretivas "#:" não podem ser após o primeiro token no arquivo

# ERR_PPIgnoredNeedsFileBasedProgram
source: '#:' directives can be only used in file-based programs ('-features:FileBasedProgram')
pt_br: Diretivas "#:" só podem ser usadas em programas baseados em arquivo ("-features:FileBasedProgram")

# ERR_PPShebangInProjectBasedProgram
source: '#!' directives can be only used in scripts or file-based programs
pt_br: Diretivas "#!" só podem ser usadas em scripts ou programas baseados em arquivo

# ERR_ParamsCollectionConstructorDoesntInitializeRequiredMember
source: Constructor '{0}' leaves required member '{1}' uninitialized.
fr: Le constructeur « {0} » laisse le membre « {1} » requis non initialisé.
it: Il costruttore '{0}' lascia non inizializzato il membro richiesto '{1}'.
pl: Konstruktor „{0}” pozostawia wymaganą składową "{1}".
pt_br: O construtor '{0}' deixa o membro obrigatório '{1}' não inicializado.
ru: Конструктор "{0}" оставляет необходимый элемент "{1}" не инициализированным.
zh_hans: 构造函数“{0}”的必需成员“{1}”未初始化。
zh_hant: 建構函式 '{0}' 未初始化必要的成員 '{1}'。

# ERR_ParamsCollectionExpressionTree
source: An expression tree may not contain an expanded form of non-array params collection parameter.
fr: Une arborescence d’expression ne peut pas contenir une forme développée de paramètre de collection de params non-tableau.
it: Un albero delle espressioni non può contenere un formato espanso di parametro di raccolta dei parametri non di matrice.
pl: Drzewo wyrażeń nie może zawierać rozszerzonej formy parametru kolekcji params innego niż tablica.
pt_br: Uma árvore de expressão não pode conter uma forma expandida de parâmetro de coleção de params que não seja uma matriz.
ru: Дерево выражений не может содержать расширенную форму параметра коллекции params, не являющегося массивом.
zh_hans: 表达式树不能包含非数组 params 集合参数的展开形式。
zh_hant: 運算式樹狀架構不能包含展開的非陣列參數集合參數形式。

# ERR_ParamsCollectionExtensionAddMethod
source: '{0}' does not contain a definition for a suitable instance 'Add' method
fr: « {0} » ne contient pas de définition pour une méthode « Add » d’instance appropriée
it: '{0}' non contiene una definizione per un metodo 'Add' di istanza appropriato
pl: Element „{0}” nie zawiera definicji odpowiedniej metody „Dodaj” wystąpienia
pt_br: '{0}' não contém uma definição para um método 'Add' de instância adequado
ru: "{0}" не содержит определения для подходящего экземпляра метода "Add"
zh_hans: “{0}”不包含适合的实例“Add”方法的定义
zh_hant: '{0}' 不包含適當執行個體 'Add' 方法的定義

# ERR_ParamsCollectionInfiniteChainOfConstructorCalls
source: Creation of params collection '{0}' results in an infinite chain of invocation of constructor '{1}'.
fr: La création de la collection de params « {0} » entraîne une chaîne infinie d’invocation du constructeur « {1} ».
it: La creazione della raccolta di parametri '{0}' comporta una catena infinita di chiamate del costruttore '{1}'.
pl: Utworzenie kolekcji parametrów „{0}” powoduje nieskończony łańcuch wywołania konstruktora „{1}”.
pt_br: A criação da coleção de params '{0}' resulta em uma cadeia infinita de invocação do construtor '{1}'.
ru: Создание коллекции params "{0}" приводит к бесконечной цепочке вызовов конструктора "{1}".
zh_hans: 创建 params 集合“{0}”导致构造函数“{1}”调用的无限链。
zh_hant: 建立參數集合 '{0}' 產生無限鏈結的建構函式 '{1}' 叫用。

# ERR_ParamsCollectionMissingConstructor
source: Non-array params collection type must have an applicable constructor that can be called with no arguments.
fr: Le type de collection de params non-tableau doit avoir un constructeur applicable que vous pouvez appeler sans argument.
it: Il tipo di raccolta dei parametri non di matrice deve avere un costruttore applicabile che può essere chiamato senza argomenti.
pl: Typ kolekcji niebędący tablicą parametrów musi mieć odpowiedni konstruktor, który można wywołać bez argumentów.
pt_br: Tipos de coleção de params que não sejam matrizes devem ter um construtor aplicável que possa ser chamado sem argumentos.
ru: Тип коллекции params, не являющийся массивом, должен иметь применимый конструктор, который можно вызывать без аргументов.
zh_hans: 非数组 params 集合类型必须拥有适用的构造函数，且该函数可以在无参数的情况下调用。
zh_hant: 非陣列參數集合型別必須具有可在不帶引數的情況下呼叫的適用建構函式。

# ERR_ParamsMemberCannotBeLessVisibleThanDeclaringMember
source: Method '{0}' cannot be less visible than the member with params collection '{1}'.
fr: La méthode « {0} » peut pas être moins visible que le membre avec la collection de params « {1} ».
it: Il metodo '{0}' non può essere meno visibile del membro con raccolta parametri '{1}'.
pl: Metoda „{0}” nie może być mniej widoczna niż składowa z kolekcją parametrów „{1}”.
pt_br: O método '{0}' não pode ter uma visibilidade menor que o membro com a coleção de params '{1}'.
ru: Метод "{0}" не может быть менее видимым, чем элемент с коллекцией параметров "{1}".
zh_hans: 方法“{0}”的可见性不能小于具有 params 集合“{1}”的成员。
zh_hant: 方法 '{0}' 不能小於具有參數集合 '{1}' 的成員。

# ERR_ParamsMustBeCollection
source: The params parameter must have a valid collection type
fr: Le paramètre params doit avoir un type de collection valide
it: Il parametro params deve avere un tipo di raccolta valido
pl: Parametr params musi mieć prawidłowy typ kolekcji
pt_br: O parâmetro params deve ter um tipo de coleção válido
ru: Параметр params должен иметь допустимый тип коллекции.
zh_hans: Params 参数必须具有有效的集合类型
zh_hant: params 參數必須具有有效的集合型別

# ERR_PartialConstructorInitializer
source: '{0}': only the implementing declaration of a partial constructor can have an initializer
pt_br: "{0}": somente a declaração de implementação de um construtor parcial pode ter um inicializador

# ERR_PartialEventInitializer
source: '{0}': partial event cannot have initializer
pt_br: "{0}": evento parcial não pode ter inicializador

# ERR_PartialMemberAccessibilityDifference
source: Both partial member declarations must have identical accessibility modifiers.
fr: Les deux déclarations de membres partiels doivent avoir des modificateurs d'accessibilité identiques.
it: I modificatori di accessibilità devono essere identici in entrambe le dichiarazioni di membro parziale.
pl: Obie częściowe deklaracje elementów członkowskich muszą mieć identyczne modyfikatory dostępności.
pt_br: As duas declarações de membros parciais precisam ter modificadores de acessibilidade idênticos.
ru: У обоих объявлений частичного члена должны быть идентичные модификаторы доступа.
zh_hans: 这两个分部成员声明必须具有相同的可访问性修饰符。
zh_hant: 兩個部分成員宣告都必須具有完全相同的協助工具修飾元。

# ERR_PartialMemberCannotBeAbstract
source: A partial member cannot have the 'abstract' modifier
fr: Un membre partiel ne peut pas avoir le modificateur « abstract »
it: Un membro parziale non può contenere il modificatore 'abstract'
pl: Częściowy element członkowski nie może mieć modyfikatora „abstract”
pt_br: Um membro parcial não pode ter o modificador "abstract"
ru: У частичного члена не может быть модификатора "abstract"
zh_hans: 分部成员不能具有 "abstract" 修饰符
zh_hant: 部分成員不能有 'abstract' 修飾元

# ERR_PartialMemberDuplicateDefinition
source: Partial member '{0}' may not have multiple defining declarations.
pt_br: O membro parcial "{0}" pode não ter várias declarações de definição.

# ERR_PartialMemberDuplicateImplementation
source: Partial member '{0}' may not have multiple implementing declarations.
pt_br: O membro parcial "{0}" pode não ter várias declarações de implementação.

# ERR_PartialMemberInconsistentTupleNames
source: Both partial member declarations, '{0}' and '{1}', must use the same tuple element names.
fr: Les deux déclarations de membres partiels, « {0} » et « {1} », doivent utiliser les mêmes noms d'éléments tuple.
it: Entrambe le dichiarazioni di membro parziale '{0}' e '{1}' devono usare gli stessi nomi di elementi di tupla.
pl: Obie deklaracje częściowych elementów członkowskich, „{0}” i „{1}”, muszą korzystać z tych samych nazw elementów krotki.
pt_br: As duas declarações de membros parciais, "{0}" e "{1}", precisam usar os mesmos nomes de elementos de tupla.
ru: Оба определения частичного члена "{0}" и "{1}" должны использовать одинаковые имена элементов кортежа.
zh_hans: 这两个分部成员声明(“{0}”和“{1}”)都必须使用相同的元组元素名称。
zh_hant: 兩個部份成員宣告 '{0}' 和 '{1}' 都必須使用相同的 Tuple 元素名稱。

# ERR_PartialMemberMissingDefinition
source: Partial member '{0}' must have a definition part.
pt_br: O membro parcial "{0}" deve ter uma parte de definição.

# ERR_PartialMemberMissingImplementation
source: Partial member '{0}' must have an implementation part.
pt_br: O membro parcial "{0}" deve ter uma parte de implementação.

# ERR_PartialMemberOnlyInPartialClass
source: A partial member must be declared within a partial type
fr: Un membre partiel doit être déclaré dans un type partiel
it: Un membro parziale deve essere dichiarato in un tipo parziale
pl: Częściowy element członkowski musi być zadeklarowany w ramach częściowego typu
pt_br: Um membro parcial precisa ser declarado dentro de um tipo parcial
ru: Частичный член должен быть объявлен из частичного типа
zh_hans: 分部成员必须在分部类型内声明
zh_hant: 部分成員必須在部分型別內宣告

# ERR_PartialMemberParamsDifference
source: Both partial member declarations must use a params parameter or neither may use a params parameter
fr: Les deux déclarations de membres partiels doivent utiliser un paramètre params ou aucune ne peut utiliser un paramètre params
it: Entrambe le dichiarazioni di membro parziale devono usare un parametro params, altrimenti nessuna delle due potrà usarlo
pl: Obie częściowe deklaracje elementów członkowskich muszą używać parametru params lub żadna z nich nie może używać parametru params
pt_br: As duas declarações de membros parciais precisam usar um parâmetro params ou nenhuma delas pode usar um parâmetro params
ru: Оба объявления частичного члена должны использовать параметр "params" или оба не должны использовать параметр "params"
zh_hans: 这两个分部成员声明必须都使用或者都不使用 params 参数
zh_hant: 兩個部分成員宣告都必須使用 params 參數，或兩者都不使用 params 參數
