Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ParameterNotValidForType
source: Parameter not valid for the specified unmanaged type.
cs: Parametr není platný pro zadaný nespravovaný typ.
de: Der Parameter ist für den angegebenen nicht verwalteten Typ nicht gültig.
es: Parámetro no válido para el tipo no administrado especificado.
fr: Paramètre non valide pour le type non managé spécifié.
it: Il parametro non è valido per il tipo non gestito specificato.
ja: パラメーターは指定されたアンマネージ型に対して無効です。
ko: 지정한 관리되지 않은 형식에 대한 매개 변수가 잘못되었습니다.
pl: Parametr jest nieprawidłowy dla określonego niezarządzanego typu.
pt_br: Parâmetro não é válido para o tipo não gerenciado especificado.
ru: Недопустимый параметр для указанного неуправляемого типа.
tr: Parametre belirtilen yönetilmeyen tür için geçerli değil.
zh_hans: 参数对于指定非托管类型无效。
zh_hant: 參數對於指定的 Unmanaged 類型無效。

# ERR_AttributeParameterRequired1
source: Attribute parameter '{0}' must be specified.
cs: Parametr atributu {0} musí být zadaný.
de: Der Attributparameter "{0}" muss angegeben werden.
es: Hay que especificar el parámetro de atributo '{0}'.
fr: Le paramètre d'attribut '{0}' doit être spécifié.
it: È necessario specificare il parametro di attributo '{0}'.
ja: 属性パラメーター '{0}' を指定する必要があります。
ko: {0}' 특성 매개 변수를 지정해야 합니다.
pl: Należy podać parametr atrybutu „{0}”.
pt_br: Parâmetro do atributo "{0}" deve ser especificado.
ru: Должен быть указан параметр атрибута "{0}".
tr: {0}' öznitelik parametresi belirtilmelidir.
zh_hans: 必须指定特性参数“{0}”。
zh_hant: 必須指定屬性參數 '{0}'。

# ERR_AttributeParameterRequired2
source: Attribute parameter '{0}' or '{1}' must be specified.
cs: Parametr atributu {0} nebo {1} musí být zadaný.
de: Der Attributparameter "{0}" oder "{1}" muss angegeben werden.
es: Hay que especificar el parámetro de atributo '{0}' o '{1}'.
fr: Le paramètre d'attribut '{0}' ou '{1}' doit être spécifié.
it: È necessario specificare il parametro di attributo '{0}' o '{1}'.
ja: 属性パラメーター '{0}' または '{1}' を指定する必要があります。
ko: {0}' 또는 '{1}' 특성 매개 변수를 지정해야 합니다.
pl: Należy podać parametr atrybutu „{0}” lub „{1}”.
pt_br: Parâmetro do atributo "{0}" ou "{1}" deve ser especificado.
ru: Должен быть указан параметр атрибута "{0}" или "{1}".
tr: {0}' veya '{1}' öznitelik parametresi belirtilmelidir.
zh_hans: 必须指定特性参数“{0}”或“{1}”。
zh_hant: 必須指定屬性參數 '{0}' 或 '{1}'。

# ERR_MarshalUnmanagedTypeNotValidForFields
source: Unmanaged type '{0}' not valid for fields.
cs: Nespravovaný typ {0} není platný pro pole.
de: Der verwaltete Typ "{0}" ist für Felder nicht gültig.
es: El tipo '{0}' sin administrar no es válido para los campos.
fr: Type non managé '{0}' non valide pour les champs.
it: Il tipo non gestito '{0}' non è valido per i campi.
ja: アンマネージ型 '{0}' はフィールドに対して無効です。
ko: 관리되지 않은 형식 '{0}'은(는) 필드에서 유효하지 않습니다.
pl: Niezarządzany typ „{0}” jest nieprawidłowy dla pól.
pt_br: Tipo não gerenciado "{0}" não é válido para campos.
ru: Неуправляемый тип "{0}" недопустим для полей.
tr: Yönetilmeyen tür '{0}' alanlar için geçerli değil.
zh_hans: 非托管类型“{0}”对于字段无效。
zh_hant: Unmanaged 類型 '{0}' 對欄位無效。

# ERR_MarshalUnmanagedTypeOnlyValidForFields
source: Unmanaged type '{0}' is only valid for fields.
cs: Nespravovaný typ {0} je platný jenom pro pole.
de: Der verwaltete Typ "{0}" ist nur für Felder gültig.
es: El tipo '{0}' sin administrar solo es válido para los campos.
fr: Le type non managé '{0}' n'est valide que pour les champs.
it: Il tipo non gestito '{0}' è valido solo per i campi.
ja: アンマネージ型 '{0}' はフィールドに対してのみ有効です。
ko: 관리되지 않은 형식 '{0}'은(는) 필드에서만 유효합니다.
pl: Niezarządzany typ „{0}” jest prawidłowy tylko dla pól.
pt_br: Tipo não gerenciado "{0}" é válido somente para campos.
ru: Неуправляемый тип "{0}" допустим только для полей.
tr: Yönetilmeyen tür '{0}' yalnızca alanlar için geçerlidir.
zh_hans: 非托管类型“{0}”仅对字段有效。
zh_hant: Unmanaged 類型 '{0}' 只對欄位有效。

# ERR_AttributeOnBadSymbolType
source: Attribute '{0}' is not valid on this declaration type. It is only valid on '{1}' declarations.
cs: Atribut {0} není platný pro deklaraci tohoto typu. Je platný jenom pro deklarace {1}.
de: Das Attribut "{0}" ist bei diesem Deklarationstyp nicht gültig. Es ist nur bei {1}-Deklarationen gültig.
es: El atributo '{0}' no es válido en este tipo de declaración. Solo es válido en declaraciones '{1}'.
fr: L'attribut '{0}' n'est pas valide dans ce type de déclaration. Il n'est valide que dans les déclarations '{1}'.
it: L'attributo '{0}' non è valido in questo tipo di dichiarazione. È valido solo in dichiarazioni di '{1}'.
ja: 属性 '{0}' はこの宣言型では無効です。'{1}' 宣言でのみ有効です。
ko: 이 선언 형식에서는 '{0}' 특성이 유효하지 않습니다. 이 특성은 '{1}' 선언에서만 유효합니다.
pl: W tej deklaracji typu atrybut „{0}” jest nieprawidłowy. Jest on prawidłowy tylko w deklaracjach „{1}”.
pt_br: Atributo "{0}" não é válido neste tipo de declaração. Ele é válido somente em "{1}" declarações.
ru: Атрибут "{0}" не допускается для этого типа объявления. Он допустим только для объявлений "{1}".
tr: {0}' özniteliği bu bildirim türünde geçerli değil. Yalnızca '{1}' bildirimlerinde geçerlidir.
zh_hans: 特性“{0}”对此声明类型无效。它仅对“{1}”声明有效。
zh_hant: 屬性 '{0}' 在此宣告類型上無效。其只有在 '{1}' 宣告上才有效。

# ERR_FloatOverflow
source: Floating-point constant is outside the range of type '{0}'
cs: Konstanta s pohyblivou řádovou čárkou je mimo rozsah typu {0}.
de: Die Gleitkommakonstante liegt außerhalb des Bereichs von Typ "{0}".
es: La constante de punto flotante está fuera del intervalo del tipo '{0}'
fr: La constante à virgule flottante sort de la plage du type '{0}'
it: La costante a virgola mobile non è inclusa nell'intervallo di tipo '{0}'
ja: 浮動小数点定数が型 '{0}' の範囲外です
ko: 부동 소수점 상수가 '{0}' 형식 범위 밖에 있습니다.
pl: Wartość stałej zmiennoprzecinkowej jest spoza zakresu typu „{0}”
pt_br: Constante de ponto flutuante está fora do intervalo do tipo "{0}"
ru: Константа с плавающей запятой вне допустимого диапазона для типа "{0}".
tr: Kayan noktalı sabit '{0}' türünün aralığı dışında
zh_hans: 浮点常量超出“{0}”类型的范围
zh_hant: 浮點常數的值超出類型 '{0}' 的範圍

# ERR_ComImportWithoutUuidAttribute
source: The Guid attribute must be specified with the ComImport attribute
cs: Atribut Guid musí být zadaný současně s atributem ComImport.
de: Das Guid-Attribut muss mit dem ComImport-Attribut angegeben werden.
es: El atributo Guid se debe especificar con el atributo ComImport
fr: L'attribut Guid doit être spécifié avec l'attribut ComImport
it: L'attributo Guid deve essere specificato con l'attributo ComImport
ja: Guid 属性は ComImport 属性を使って指定する必要があります
ko: Guid 특성은 ComImport 특성과 함께 지정해야 합니다.
pl: Atrybut Guid musi być określony z atrybutem ComImport
pt_br: O atributo Guid deve ser especificado com o atributo ComImport
ru: Вместе с атрибутом ComImport следует задать атрибут Guid.
tr: Guid özniteliği ComImport özniteliğiyle birlikte belirtilmelidir
zh_hans: Guid 特性必须用 ComImport 特性指定
zh_hant: 指定 Guid 屬性時必須同時指定 ComImport 屬性

# ERR_InvalidNamedArgument
source: Invalid value for named attribute argument '{0}'
cs: Neplatná hodnota argumentu {0} pojmenovaného atributu
de: Ungültiger Wert für das benannte Attributargument "{0}".
es: Valor no válido para el argumento '{0}' del atributo con nombre
fr: Valeur non valide pour l'argument d'attribut nommé '{0}'
it: Il valore dell'argomento di attributo denominato '{0}' non è valido
ja: 名前付き属性の引数 '{0}' の値が無効です
ko: 명명된 특성 인수 '{0}'에 대해 잘못된 값입니다.
pl: Nieprawidłowa wartość nazwanego argumentu atrybutu „{0}”
pt_br: Valor inválido para o argumento de atributo denominado "{0}"
ru: Недопустимое значение именованного аргумента атрибута "{0}".
tr: Adlandırılan öznitelik bağımsız değişkeni '{0}' için geçersiz değer
zh_hans: 命名特性参数“{0}”的值无效
zh_hant: 具名屬性引數 '{0}' 的值無效

# ERR_DllImportOnInvalidMethod
source: The DllImport attribute must be specified on a method marked 'extern' that is either 'static' or an extension member
it: L'attributo DllImport deve essere specificato in un metodo contrassegnato come 'static' ed 'extern'
pt_br: O atributo DllImport deve ser especificado em um método marcado como "extern" que seja "static" ou um membro de extensão
ru: Атрибут DllImport должен быть указан для метода, который помечен как "static" и "extern".
zh_hans: 必须在标记为 "static" 和 "extern" 的方法上指定 DllImport 特性

# ERR_DllImportOnGenericMethod
source: The DllImport attribute cannot be applied to a method that is generic or contained in a generic method or type.
cs: Atribut DllImport se nedá použít u metody, která je obecná nebo obsažená v obecné metodě nebo typu.
de: Das DllImport-Attribut kann nicht auf eine generische oder in einem generischen Typ enthaltene Methode angewendet werden.
es: El atributo DllImport no se puede aplicar a un método que sea genérico o esté contenido en un tipo genérico.
fr: Impossible d'appliquer l'attribut DllImport à une méthode générique ou contenue dans une méthode ou un type générique.
it: Non è possibile applicare l'attributo DllImport a un metodo generico o contenuto in un tipo o un metodo generico.
ja: DllImport 属性は、ジェネリックであるメソッドに適用することも、ジェネリック メソッドまたは型に含めることもできません。
ko: DllImport 특성은 제네릭이거나 제네릭 형식에 포함된 메서드에 적용할 수 없습니다.
pl: Atrybut DllImport nie może być zastosowany do metody, która jest ogólna lub zawarta w metodzie ogólnej lub typie ogólnym.
pt_br: O atributo DllImport não pode ser aplicado a um método que seja genérico ou esteja contido em um método ou tipo genérico.
ru: Атрибут DllImport не может применяться для универсального метода или метода, содержащегося в универсальном методе или типе.
zh_hans: DllImport 特性不能应用于属于泛型类型的方法，或者包含在泛型方法/类型中。
zh_hant: DllImport 屬性無法套用至泛型方法，或包含在泛型方法或類型中。

# ERR_FieldCantBeRefAny
source: Field or property cannot be of type '{0}'
cs: Pole nebo vlastnost nemůže být typu {0}.
de: Das Feld oder die Eigenschaft kann nicht vom Typ "{0}" sein.
es: El campo o la propiedad no pueden ser del tipo '{0}'
fr: Ni le champ, ni la propriété ne peuvent être de type '{0}'
it: Il campo o la proprietà non può essere di tipo '{0}'
ja: フィールドまたはプロパティに型 '{0}' を指定することはできません
ko: 필드 또는 속성은 '{0}' 형식일 수 없습니다.
pl: Pole ani właściwość nie może mieć typu „{0}”
pt_br: Campo ou propriedade não pode ser do tipo "{0}"
ru: Поле или свойство не может иметь тип "{0}".
tr: Alan veya özellik '{0}' türünde olamaz
zh_hans: 字段或属性不能是“{0}”类型
zh_hant: 欄位或屬性不可為類型 '{0}'

# ERR_FieldAutoPropCantBeByRefLike
source: Field or auto-implemented property cannot be of type '{0}' unless it is an instance member of a ref struct.
cs: Vlastnost pole nebo automaticky implementovaná vlastnost nemůže být typu {0}, pokud není členem instance struktury REF.
de: Ein Feld oder eine automatisch implementierte Eigenschaft darf nur dann vom Typ "{0}" sein, wenn es sich um einen Instanzmember einer Referenzstruktur handelt.
es: Un campo o una propiedad implementada automáticamente no pueden ser de tipo "{0}", a menos que sea un miembro de instancia de una estructura ref.
fr: Le champ ou la propriété implémentée automatiquement ne peut pas être de type '{0}', sauf s'il s'agit d'un membre d'instance d'un struct par référence.
it: La proprietà di campo o implementata automaticamente non può essere di tipo '{0}' a meno che non sia un membro di istanza di uno struct ref.
ja: フィールドまたは自動実装プロパティは、それが ref 構造体のインスタンス メンバーである場合を除いて、型 '{0}' にすることができません。
ko: 필드 또는 자동 구현 속성은 ref struct의 인스턴스 멤버인 경우 외에는 '{0}' 형식일 수 없습니다.
pl: Pole lub automatycznie implementowana właściwość nie może być typu „{0}”, chyba że jest to składowa struktury ref.
pt_br: O campo ou a propriedade autoimplementada não pode ser do tipo '{0}', a menos que seja um membro de instância de uma struct de referência.
ru: Поле или автоматически реализуемое свойство не может быть типа "{0}", если это не член экземпляра ссылочной структуры.
tr: Bir başvuru yapı biriminin örnek üyesi olmadığı sürece alan veya otomatik uygulanan özellik, '{0}' türünde olamaz.
zh_hans: 字段或自动实现的属性不能是类型“{0}”，除非它是 ref 结构的实例成员。
zh_hant: 欄位或自動實作屬性的類型不可為 '{0}'，除非它是 ref struct 的執行個體成員。

# ERR_ArrayElementCantBeRefAny
source: Array elements cannot be of type '{0}'
cs: Prvky pole nemůžou být typu {0}.
de: Arrayelemente können nicht vom Typ "{0}" sein.
es: Los elementos de matriz no pueden ser del tipo '{0}'
fr: Les éléments de tableau ne peuvent pas être de type '{0}'
it: Gli elementi di una matrice non possono essere di tipo '{0}'
ja: 配列要素を '{0}' 型にすることはできません
ko: 배열 요소는 '{0}' 형식일 수 없습니다.
pl: W tablicy nie mogą występować elementy typu „{0}”
pt_br: Elementos de matriz não podem ser do tipo "{0}"
ru: Элементы массива не могут иметь тип "{0}".
tr: Dizi öğeleri '{0}' türünde olamaz
zh_hans: 数组元素不能是“{0}”类型
zh_hant: 陣列元素不可為類型 '{0}'

# WRN_DeprecatedSymbol
source: '{0}' is obsolete
cs: 'Prvek {0} je zastaralý.
de: '"{0}" ist veraltet.
es: '{0}' está obsoleto
fr: '{0}' est obsolète
it: '{0}' è obsoleto
ja: '{0}' は古い形式です
ko: '{0}'은(는) 사용되지 않습니다.
pl: 'Element „{0}” jest przestarzały
pt_br: "{0}" está obsoleto
ru: "{0}" является устаревшим.
tr: '{0}' artık kullanılmıyor
zh_hans: “{0}”已过时
zh_hant: '{0}' 已經過時

# WRN_DeprecatedSymbol_Title
source: Type or member is obsolete
cs: Typ nebo člen je zastaralý.
de: Typ oder Element ist veraltet
es: El tipo o el miembro están obsoletos
fr: Le type ou le membre est obsolète
it: Il tipo o il membro è obsoleto
ja: 型またはメンバーが旧型式です
ko: 형식 또는 멤버는 사용되지 않습니다.
pl: Typ lub składowa jest przestarzała
pt_br: O tipo ou membro é obsoleto
ru: Тип или член устарел
tr: Tür veya üye artık kullanılmıyor
zh_hans: 类型或成员已过时
zh_hant: 類型或成員已經過時

# ERR_NotAnAttributeClass
source: '{0}' is not an attribute class
cs: {0} není třída atributu.
de: '"{0}" ist keine Attributklasse.
es: '{0}' no es una clase de atributos
fr: '{0}' n'est pas une classe d'attributs
it: '{0}' non è una classe Attribute
ja: '{0}' は属性クラスではありません
ko: '{0}'은(는) 특성 클래스가 아닙니다.
pl: „{0}” to nie jest klasa atrybutu
pt_br: "{0}" não é uma classe de atributo
ru: "{0}" не является классом атрибута.
tr: '{0}' bir öznitelik sınıfı değildir
zh_hans: “{0}”不是特性类
zh_hant: '{0}' 不是屬性類別

# ERR_BadNamedAttributeArgument
source: '{0}' is not a valid named attribute argument. Named attribute arguments must be fields which are not readonly, static, or const, or read-write properties which are public and not static.
cs: {0} není platný argument pojmenovaného atributu. Argumenty pojmenovaného atributu musí být pole, pro která nebyla použitá deklarace readonly, static ani const, nebo vlastnosti pro čtení i zápis, které jsou veřejné a nejsou statické.
de: '"{0}" ist kein gültiges benanntes Attributargument. Benannte Attributargumente müssen entweder Felder sein, die nicht schreibgeschützt, statisch oder konstant sind, oder Eigenschaften mit Lese- und Schreibzugriff, die öffentlich und nicht statisch sind.
es: '{0}' no es un argumento de atributo con nombre válido. Los argumentos de atributo con nombre deben ser campos que no sean readonly, static ni const, o bien propiedades read-write que sean public y no static.
fr: '{0}' n'est pas un argument d'attribut nommé valide. Les arguments d'attribut nommé doivent être des champs qui ne sont pas readonly, statiques ou constants, ou des propriétés en lecture-écriture qui sont publiques et non statiques.
it: '{0}' non è un argomento di attributo denominato valido. Gli argomenti di attributo denominati devono essere campi che non siano di sola lettura, statici o costanti oppure proprietà di lettura/scrittura che siano pubbliche e non statiche.
ja: '{0}' は有効な名前付き属性引数ではありません。名前付き属性引数は、読み取り専用、static、const、または公開され、静的でない読み書き可能なプロパティ以外のフィールドである必要があります。
ko: '명명된 특성 인수 '{0}'이(가) 잘못되었습니다. 명명된 특성 인수는 readonly, static 또는 const가 아닌 필드이거나 static이 아닌 public 읽기/쓰기 속성이어야 합니다.
pl: „{0}” nie jest prawidłowym argumentem nazwanego atrybutu. Argumentami nazwanego atrybutu muszą być pola, które nie są tylko do odczytu i nie są statyczne ani stałe, lub właściwości do odczytu/zapisu, które są publiczne, ale nie statyczne.
pt_br: "{0}" é não um argumento de atributo nomeado válido. Argumentos de atributo nomeado devem ser campos que não são propriedades readonly, static ou const ou read-write que são públicas e não estáticas.
ru: "{0}" недопустимый именованный аргумент атрибута. Аргументы именованного атрибута должны быть полями без описателей readonly, static и const или открытыми нестатическими свойствами с доступом на чтение и запись.
tr: '{0}' geçerli bir adlandırılmış öznitelik bağımsız değişkeni değil. Adlandırılmış öznitelik bağımsız değişkenleri salt okunur, statik, sabit olmayan alanlar veya ortak olan ve statik olmayan okuma/yazma özellikleri olmalıdır.
zh_hans: “{0}”不是有效的命名特性参数。命名特性参数必须是非只读、非静态或非常数的字段，或者是公共的和非静态的读写属性。
zh_hant: '{0}' 不是有效的具名屬性引數。具名屬性引數必須為欄位，且不可為 readonly、static 或 const，也不可以是 public 且非 static 的 read-write 屬性。

# WRN_DeprecatedSymbolStr
source: '{0}' is obsolete: '{1}'
cs: {0} je zastaralá: {1}.
de: '"{0}" ist veraltet: "{1}"
es: '{0}' está obsoleto: '{1}'
fr: '{0}' est obsolète : '{1}'
it: '{0}' è obsoleto: '{1}'
ja: '{0}' は旧形式です ('{1}')
ko: '{0}'은(는) 사용되지 않습니다. '{1}'
pl: 'Element „{0}” jest przestarzały: „{1}”
pt_br: "{0}" é obsoleto: "{1}"
ru: "{0}" является устаревшим: '{1}'
tr: '{0}' artık kullanılmıyor: '{1}'
zh_hans: “{0}”已过时:“{1}”
zh_hant: '{0}' 已經過時: '{1}'

# WRN_DeprecatedSymbolStr_Title
source: Type or member is obsolete
cs: Typ nebo člen je zastaralý.
de: Typ oder Element ist veraltet
es: El tipo o el miembro están obsoletos
fr: Le type ou le membre est obsolète
it: Il tipo o il membro è obsoleto
ja: 型またはメンバーが旧型式です
ko: 형식 또는 멤버는 사용되지 않습니다.
pl: Typ lub składowa jest przestarzała
pt_br: O tipo ou membro é obsoleto
ru: Тип или член устарел
tr: Tür veya üye artık kullanılmıyor
zh_hans: 类型或成员已过时
zh_hant: 類型或成員已經過時

# ERR_DeprecatedSymbolStr
source: '{0}' is obsolete: '{1}'
cs: {0} je zastaralá: {1}.
de: '"{0}" ist veraltet: "{1}"
es: '{0}' está obsoleto: '{1}'
fr: '{0}' est obsolète : '{1}'
it: '{0}' è obsoleto: '{1}'
ja: '{0}' は旧形式です ('{1}')
ko: '{0}'은(는) 사용되지 않습니다. '{1}'
pl: 'Element „{0}” jest przestarzały: „{1}”
pt_br: "{0}" é obsoleto: "{1}"
ru: "{0}" является устаревшим: '{1}'
tr: '{0}' artık kullanılmıyor: '{1}'
zh_hans: “{0}”已过时:“{1}”
zh_hant: '{0}' 已經過時: '{1}'

# ERR_IndexerCantHaveVoidType
source: Indexers cannot have void type
cs: Indexer nemůže být typu void.
de: Indexer können keinen leeren Typ haben.
es: Los indizadores no pueden tener un tipo void
fr: Les indexeurs ne peuvent pas être de type void
it: Gli indicizzatori non possono avere tipi void
ja: インデクサーに void 型を指定できません
ko: 인덱서에는 void 형식을 사용할 수 없습니다.
pl: Indeksowanie nie może być typu void
pt_br: Indexadores não podem ter o tipo void
ru: Индексатор не может иметь тип void.
tr: Dizin oluşturucular void türünde olamaz
zh_hans: 索引器不能有 void 类型
zh_hant: 索引子不能有 void 的類型

# ERR_VirtualPrivate
source: '{0}': virtual or abstract members cannot be private
cs: {0}: Virtuální nebo abstraktní členy nemůžou být privátní.
de: '"{0}": Virtuelle oder abstrakte Member können nicht privat sein.
es: '{0}': los miembros virtuales o abstractos no pueden ser privados
fr: '{0}' : les membres virtual ou abstract ne peuvent pas être private
it: '{0}': i membri virtuali o astratti non possono essere privati
ja: '{0}': 仮想または抽象メンバーには、private を指定できません
ko: '{0}': 가상 또는 추상 멤버는 프라이빗일 수 없습니다.
pl: „{0}”: wirtualne ani abstrakcyjne składowe nie mogą być prywatne
pt_br: "{0}": membros virtuais ou abstratos não podem ser privados
ru: "{0}": виртуальные и абстрактные члены не могут быть закрытыми.
tr: '{0}': sanal veya soyut üyeler özel olamaz
zh_hans: “{0}”: 虚拟成员或抽象成员不能是私有的
zh_hant: '{0}': 虛擬或抽象成員不可為私用

# ERR_ArrayInitToNonArrayType
source: Can only use array initializer expressions to assign to array types. Try using a new expression instead.
cs: Výrazy inicializátoru pole jde používat jenom pro přiřazení k typům pole. Zkuste použít výraz new.
de: Arrayinitialisiererausdrücke können nur zum Zuordnen von Arraytypen verwendet werden. Verwenden Sie stattdessen einen new-Ausdruck.
es: Solo se pueden usar expresiones de inicializador de matriz como asignación a tipos de matriz. Pruebe a utilizar una expresión new en su lugar.
fr: Les expressions d'initialiseur de tableau ne peuvent être utilisées que pour assigner des types tableau. Essayez plutôt d'utiliser une expression new.
it: Solo espressioni di inizializzazione di matrice possono essere utilizzate per assegnare a tipi matrice. Provare a utilizzare un'espressione new.
ja: 配列型を割り当てるには配列初期化子式だけを使用してください。new 式を使用してください。
ko: 배열 이니셜라이저 식은 배열 형식에 할당하는 데에만 사용할 수 있습니다. 대신 new 식을 사용해 보세요.
pl: Wyrażenia inicjatora tablicy mogą być używane tylko w celu przypisania wartości do typów tablicowych. Zamiast tego spróbuj użyć wyrażenia „new”.
pt_br: Só é possível usar expressões de inicializador de matriz para atribuir a tipos de matriz. Tente usar uma expressão new.
ru: Назначение типов массивов разрешено только через выражения инициализации массивов. Используйте выражение с оператором new.
tr: Dizi türlerine atama yapmak için yalnızca dizi başlatıcı ifadeleri kullanılabilir. Bunun yerine bir new ifadesi kullanmayı deneyin.
zh_hans: 只能使用数组初始值设定项表达式为数组类型赋值。请尝试改用 new 表达式。
zh_hant: 只可使用陣列初始設定式運算式，指派給陣列類型。請嘗試改用 new 運算式。

# ERR_ArrayInitInBadPlace
source: Array initializers can only be used in a variable or field initializer. Try using a new expression instead.
cs: Inicializátory pole jde používat jenom v inicializátoru pole nebo proměnné. Zkuste použít výraz new.
de: Arrayinitialisierer können nur in einer Variablen oder einem Feldinitialisierer verwendet werden. Verwenden Sie stattdessen einen new-Ausdruck.
es: Los inicializadores de matriz solo se pueden utilizar en un inicializador de variable o campo. Pruebe a usar una expresión new en su lugar.
fr: Les initialiseurs de tableau ne peuvent être utilisés que dans un initialiseur de champ ou de variable. Essayez plutôt d'utiliser une expression new.
it: Gli inizializzatori di matrice possono essere usati solo in un inizializzatore di campo o di variabile. Provare a usare un'espressione new.
ja: 配列初期化子は変数かフィールド初期化子の中でのみ使用できます。new 式を使用してください。
ko: 배열 이니셜라이저는 변수 또는 필드 이니셜라이저에서만 사용할 수 있습니다. 대신 new 식을 사용해 보세요.
pl: Inicjatora tablicy można użyć tylko w inicjatorze zmiennej lub pola. Zamiast tego spróbuj użyć wyrażenia „new”.
pt_br: Inicializadores de matriz só podem ser usados em um inicializador de campo ou variável. Tente usar uma expressão new.
ru: Инициализаторы массивов могут использоваться только в инициализаторах переменных или полей. Используйте выражение с оператором new.
tr: Dizi başlatıcıları yalnızca değişkende veya alan başlatıcısında kullanılabilir. Bunun yerine bir new ifadesi kullanmayı deneyin.
zh_hans: 数组初始值设定项只能在变量或字段初始值设定项中使用。请尝试改用 new 表达式。
zh_hant: 陣列初始設定式只可用於變數或欄位初始設定式中。請嘗試改用 new 運算式。
