Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_SequentialOnPartialClass
source: There is no defined ordering between fields in multiple declarations of partial struct '{0}'. To specify an ordering, all instance fields must be in the same declaration.
cs: Mezi poli více deklarací částečné třídy nebo struktury {0} není žádné definované řazení. Pokud chcete zadat řazení, musí být všechna pole instancí ve stejné deklaraci.
de: Es gibt keine festgelegte Reihenfolge für die Felder in mehreren Deklarationen der partiellen Struktur "{0}". Um eine Reihenfolge anzugeben, müssen sich alle Instanzenfelder in der gleichen Deklaration befinden.
es: No hay ningún orden definido entre campos en varias declaraciones de estructura parcial '{0}'. Para especificar un orden, todos los campos de instancia deben estar en la misma declaración.
fr: Il n'existe pas de classement défini entre les champs dans plusieurs déclarations de la structure partielle '{0}'. Pour spécifier un classement, tous les champs d'instance doivent se trouver dans la même déclaration.
it: Non è stato definito nessun ordine tra i campi in più dichiarazioni di struct parziale '{0}'. Per specificare un ordine, tutti i campi dell'istanza devono essere inclusi nella stessa dichiarazione.
ja: 部分的な構造体 '{0}' の複数の宣言内にあるフィールド間に、定義された順序がありません。順序を指定するには、すべてのインスタンス フィールドが同じ宣言内になければなりません。
ko: partial 구조체 '{0}'의 여러 선언에서 필드 간 순서가 정의되어 있지 않습니다. 순서를 지정하려면 모든 인스턴스 필드가 같은 선언에 있어야 합니다.
pl: Nie ma zdefiniowanej kolejności pól w wielu deklaracjach częściowej struktury „{0}”. Aby określić kolejność, wszystkie pola wystąpienia muszą znajdować się w tej samej deklaracji.
pt_br: Não há ordenação definida entre os campos em várias declarações de estrutura partial "{0}". Para especificar uma ordenação, todos os campos de instância devem estar na mesma declaração.
ru: Нет определенного порядка полей при нескольких объявлениях разделяемой структуры "{0}". Чтобы определить порядок, все поля экземпляра должны быть в одном объявлении.
tr: {0}' kısmi sınıfının veya yapı biriminin birden çok bildiriminde alanlar arasında tanımlı sıralama yok. Sıralama belirtmek için, tüm örnek alanları aynı bildirimde olmalıdır.
zh_hans: 在分部结构“{0}”的多个声明中的字段之间没有已定义的排序方式。要指定排序方式，所有实例字段必须位于同一声明中。
zh_hant: 在部分結構 '{0}' 的多重宣告中，欄位之間沒有已定義的順序。若要指定順序，所有執行個體欄位都必須在同一個宣告中。

# WRN_SequentialOnPartialClass_Title
source: There is no defined ordering between fields in multiple declarations of partial struct
cs: Není nadefinované řazení mezi poli ve více deklaracích částečné struktury.
de: Keine definierte Sortierung zwischen Feldern in mehreren Deklarationen der partiellen Struktur.
es: No hay un orden específico entre los campos en declaraciones múltiples de la estructura parcial
fr: Il n'existe pas de classement défini entre les champs dans plusieurs déclarations de struct partiel
it: In più dichiarazioni della struct parziale non è stato definito nessun ordinamento tra campi
ja: 部分的な構造体の複数の宣言内にあるフィールド間に定義された順序がありません
ko: partial 구조체의 여러 선언에서 필드 간 순서가 정의되어 있지 않습니다.
pl: Brak zdefiniowanej kolejności pól w wielu deklaracjach częściowej struktury
pt_br: Não há nenhuma ordem definida entre os campos em várias declarações de estrutura parcial
ru: Не определен порядок полей в нескольких декларациях разделяемой структуры
tr: Kısmi yapının birden çok bildirimindeki alanlar arasında tanımlanmış sıralama yok
zh_hans: 在分部结构的多个声明中的字段之间没有已定义的排序方式
zh_hant: 在多個局部結構宣告中，欄位之間未定義順序

# ERR_BadConstType
source: The type '{0}' cannot be declared const
cs: Typ {0} nemůže být deklarovaný jako const.
de: Der Typ "{0}" kann nicht als konstant deklariert werden.
es: El tipo '{0}' no se puede declarar como const
fr: Le type '{0}' ne peut pas être déclaré const
it: Il tipo '{0}' non può essere dichiarato come const
ja: 型 '{0}' を const 宣言することはできません
ko: {0}' 형식은 const로 선언할 수 없습니다.
pl: Typu „{0}” nie można zadeklarować jako const
pt_br: O tipo "{0}" não pode ser declarado const
ru: Тип "{0}" не может быть объявлен как const.
tr: {0}' türü sabit olarak bildirilemez
zh_hans: 不能将类型“{0}”声明为 const
zh_hant: 類型 '{0}' 不可宣告為 const

# ERR_NoNewTyvar
source: Cannot create an instance of the variable type '{0}' because it does not have the new() constraint
cs: Nejde vytvořit instanci proměnné typu {0}, protože nemá omezení new().
de: Es kann keine Instanz des Variablentyps "{0}" erstellt werden, weil er keine new()-Einschränkung aufweist.
es: No se puede crear una instancia del tipo de variable '{0}' porque no tiene la restricción new()
fr: Impossible de créer une instance du type de variable '{0}', car il n'a pas de contrainte new()
it: Non è possibile creare un'istanza del tipo di variabile '{0}' perché non include il vincolo new()
ja: 変数型 '{0}' のインスタンスは、new() 制約を含まないため、作成できません
ko: {0}' 변수 형식에 new() 제약 조건이 없으므로 이 변수 형식의 인스턴스를 만들 수 없습니다.
pl: Nie można utworzyć wystąpienia typu zmiennej „{0}”, ponieważ nie ma ograniczenia new()
pt_br: Não é possível criar uma instância do tipo de variável "{0}" porque ela não tem a restrição new()
ru: Не удается создать экземпляр переменной типа "{0}", так как у нее отсутствуют ограничения new().
tr: New() kısıtlamasına sahip olmadığından '{0}' değişken türünün bir örneği oluşturulamıyor
zh_hans: 变量类型“{0}”没有 new() 约束，因此无法创建该类型的实例
zh_hant: 無法建立變數類型 '{0}' 的執行個體，因為其無 new() 條件約束

# ERR_BadArity
source: Using the generic {1} '{0}' requires {2} type arguments
cs: Použití obecného prvku {1} {0} vyžaduje tento počet argumentů typů: {2}.
de: Die Verwendung von {1} "{0}" (generisch) erfordert {2}-Typargumente.
es: El uso de {1} de tipo genérico '{0}' requiere argumentos de tipo {2}
fr: L'utilisation du {1} générique '{0}' nécessite des arguments de type {2}
it: L'uso del tipo generico {1} '{0}' richiede argomenti di tipo {2}
ja: ジェネリック {1} '{0}' を使用するには、{2} 型引数が必要です
ko: 제네릭 {1} '{0}'을(를) 사용하려면 {2} 형식 인수가 필요합니다.
pl: Użycie ogólnego elementu {1} „{0}” wymaga argumentów typu „{2}”
pt_br: Usar o genérico {1} "{0}" requer {2} argumentos de tipo
ru: Использование универсального {1} "{0}" требует аргументы типа {2}.
tr: Genel {1} '{0}' kullanmak için {2} türü bağımsız değişkenler gerekir
zh_hans: 使用泛型 {1}“{0}”需要 {2} 个类型参数
zh_hant: 使用泛型 {1} '{0}' 時需要 {2} 個類型引數

# ERR_BadTypeArgument
source: The type '{0}' may not be used as a type argument
cs: Typ {0} nejde použít jako argument typu.
de: Der {0}-Typ kann nicht als Typargument verwendet werden.
es: El tipo '{0}' no se puede usar como argumento de tipo
fr: Le type '{0}' ne peut pas être utilisé comme argument de type
it: Il tipo '{0}' non può essere usato come argomento di tipo
ja: 型 '{0}' は型引数として使用できません
ko: {0}' 형식은 형식 인수로 사용할 수 없습니다.
pl: Typu „{0}” nie można użyć jako argumentu typu.
pt_br: O tipo "{0}" não pode ser usado como um argumento de tipo
ru: Тип "{0}" не может использоваться в качестве аргумента типа
tr: {0}' türü, tür bağımsız değişkeni olarak kullanılamaz.
zh_hans: 类型“{0}”不能用作类型参数
zh_hant: 類型 '{0}' 不可用做類型引數

# ERR_TypeArgsNotAllowed
source: The {1} '{0}' cannot be used with type arguments
cs: {1} {0} nejde použít s argumenty typů.
de: {1} "{0}" kann nicht mit Typargumenten verwendet werden.
es: {1} '{0}' no se puede usar con argumentos de tipo
fr: Impossible d'utiliser le {1} '{0}' avec des arguments de type
it: Non è possibile usare {1} '{0}' con argomenti di tipo
ja: {1} '{0}' は型引数と一緒には使用できません
ko: {1} '{0}'은(는) 형식 인수와 함께 사용할 수 없습니다.
pl: Elementu {1} „{0}” nie można używać z argumentami typu.
pt_br: O {1} "{0}" não pode ser usado com argumentos de tipo
ru: {1} "{0}" нельзя использовать с аргументами типа
tr: {1} '{0}' öğesi, tür bağımsız değişkenleri ile kullanılamaz
zh_hans: {1}“{0}”不能与类型参数一起使用
zh_hant: {1} '{0}' 不可搭配類型引數一起使用

# ERR_HasNoTypeVars
source: The non-generic {1} '{0}' cannot be used with type arguments
cs: Neobecnou možnost {1} {0} nejde použít s argumenty typů.
de: {1} "{0}" ist nicht generisch und kann daher nicht mit Typargumenten verwendet werden.
es: El {1} '{0}' no genérico no se puede usar con argumentos de tipo
fr: Impossible d'utiliser le {1} '{0}' non générique avec des arguments de type
it: {1} '{0}' non generico non può essere usato con argomenti di tipo
ja: 非ジェネリック {1} '{0}' は型引数と一緒には使用できません
ko: 제네릭이 아닌 {1} '{0}'은(는) 형식 인수와 함께 사용할 수 없습니다.
pl: Nieogólnego elementu {1} „{0}” nie można używać z argumentami typu.
pt_br: O {1} não genérico "{0}" não pode ser usado como argumentos de tipo
ru: Неуниверсальный {1} "{0}" нельзя использовать с аргументами типа.
tr: Genel olmayan {1} '{0}' öğesi, tür bağımsız değişkenleriyle kullanılamaz
zh_hans: 非泛型 {1}“{0}”不能与类型参数一起使用
zh_hant: 非泛型 {1} '{0}' 不可搭配類型引數一起使用

# ERR_NewConstraintNotSatisfied
source: '{2}' must be a non-abstract type with a public parameterless constructor in order to use it as parameter '{1}' in the generic type or method '{0}'
cs: 'Objekt {2} musí být neabstraktního typu s veřejným konstruktorem bez parametrů, jinak jej nejde použít jako parametr {1} v obecném typu nebo metodě {0}.
de: '"{2}" muss ein nicht abstrakter Typ mit einem öffentlichen parameterlosen Konstruktor sein, um im generischen Typ oder in der generischen {0}-Methode als {1}-Parameter verwendet werden zu können.
es: '{2}' debe ser un tipo no abstracto con un constructor público sin parámetros para poder usarlo como parámetro '{1}' en el tipo o método genérico '{0}'
fr: '{2}' doit être un type non abstrait avec un constructeur sans paramètre public afin de l'utiliser comme paramètre '{1}' dans le type ou la méthode générique '{0}'
it: '{2}' deve essere un tipo non astratto con un costruttore pubblico senza parametri per poter essere usato come parametro '{1}' nel tipo o nel metodo generico '{0}'
ja: '{2}' は、ジェネリック型またはメソッド '{0}' 内でパラメーター '{1}' として使用するために、パブリック パラメーターなしのコンストラクターを持つ非抽象型でなければなりません
ko: '제네릭 형식 또는 메서드 '{0}'에서 '{1}' 매개 변수로 사용하려면 '{2}'이(가) 매개 변수가 없는 public 생성자를 사용하는 비추상 형식이어야 합니다.
pl: 'Element „{2}” musi być typem nieabstrakcyjnym z publicznym konstruktorem bez parametrów, aby można go było użyć jako parametru „{1}” w typie ogólnym lub metodzie „{0}”.
pt_br: "{2}" deve ser um tipo non-abstract com um construtor público sem-parâmetros para que possa ser usado como parâmetro "{1}" no tipo ou método genérico "{0}"
ru: '{2}" должен быть неабстрактным типом и иметь открытый конструктор без параметров, чтобы использовать его в качестве параметра "{1}" в универсальном типе или методе "{0}".
tr: '{2}' türünün '{0}' genel türünde veya yönteminde '{1}' parametresi olarak kullanabilmesi için genel bir parametresiz oluşturucu içeren, soyut olmayan bir tür olması gerekir
zh_hans: “{2}”必须是具有公共的无参数构造函数的非抽象类型，才能用作泛型类型或方法“{0}”中的参数“{1}”
zh_hant: '{2}' 必須是具有公用無參數建構函式的非抽象類型，才可在泛型類型或方法 '{0}' 中用做為參數 '{1}'

# ERR_GenericConstraintNotSatisfiedRefType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no implicit reference conversion from '{3}' to '{1}'.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Neexistuje žádný implicitní převod odkazu z {3} na {1}.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Es ist keine implizite Verweiskonvertierung von "{3}" in "{1}" vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay ninguna conversión de referencia implícita de '{3}' a '{1}'.
fr: Impossible d'utiliser le type '{3}' comme paramètre de type '{2}' dans le type ou la méthode générique '{0}'. Il n'y a pas de conversion de référence implicite de '{3}' en '{1}'.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Non esistono conversioni implicite di riferimenti da '{3}' a '{1}'.
ja: 型 '{3}' はジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用できません。'{3}' から '{1}' への暗黙的な参照変換がありません。
ko: {3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 암시적 참조 변환이 없습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Brak niejawnej konwersji odwołania z typu „{3}” na „{1}”.
pt_br: O tipo "{3}" não pode ser usado como parâmetro de tipo "{2}" no tipo ou método genérico "{0}". Não há conversão de referência implícita de "{3}" em "{1}".
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Нет преобразования неявной ссылки из "{3}" в "{1}".
tr: {3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' türünden '{1}' türüne örtük bir başvuru dönüştürmesi yoktur.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。没有从“{3}”到“{1}”的隐式引用转换。
zh_hant: 類型 '{3}' 不可用做為泛型類型或方法 '{0}' 中的類型參數 '{2}'。沒有從 '{3}' 到 '{1}' 的隱含參考轉換。

# ERR_GenericConstraintNotSatisfiedNullableEnum
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Typ {3} s možnou hodnotou null nevyhovuje omezení {1}.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Der Typ "{3}", der NULL-Werte zulässt, entspricht nicht der Einschränkung von "{1}".
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. El tipo que acepta valores NULL '{3}' no cumple la restricción de '{1}'.
fr: Impossible d'utiliser le type '{3}' comme paramètre de type '{2}' dans le type ou la méthode générique '{0}'. Le type Nullable '{3}' ne satisfait pas la contrainte de '{1}'.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Il tipo nullable '{3}' non soddisfa il vincolo di '{1}'.
ja: 型 '{3}' はジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用できません。Null 許容型 '{3}' は、'{1}' の制約を満たしていません。
ko: {3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}' null 허용 형식이 '{1}' 제약 조건을 충족하지 않습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Typ zerowalny „{3}” nie spełnia ograniczenia elementu „{1}”.
pt_br: O tipo "{3}" não pode ser usado como parâmetro de tipo "{2}" no tipo ou método genérico "{0}". O tipo "{3}" que permite valores nulos não satisfaz a restrição de "{1}".
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Тип "{3}", допускающий значение Null, не соответствует ограничению "{1}".
tr: {3}' türü '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' null yapılabilir türü, '{1}' kısıtlamasını karşılamıyor.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。可以为 null 的类型“{3}”不满足“{1}”的约束。
zh_hant: 類型 '{3}' 不可用做為泛型類型或方法 '{0}' 中的類型參數 '{2}'。可為 Null 的類型 '{3}' 無法滿足 '{1}' 的條件約束。

# ERR_GenericConstraintNotSatisfiedNullableInterface
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. The nullable type '{3}' does not satisfy the constraint of '{1}'. Nullable types can not satisfy any interface constraints.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Typ {3} s možnou hodnotou null nevyhovuje omezení {1}. Typy s možnou hodnotou null nemůžou vyhovět žádným omezením rozhraní.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Der Typ "{3}", der NULL-Werte zulässt, entspricht nicht der Einschränkung von "{1}". Typen, die NULL-Werte zulassen, können Schnittstelleneinschränkungen nicht entsprechen.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. El tipo que acepta valores NULL '{3}' no cumple la restricción de '{1}'. Los tipos que aceptan valores NULL no pueden cumplir restricciones de interfaz.
fr: Impossible d'utiliser le type '{3}' comme paramètre de type '{2}' dans le type ou la méthode générique '{0}'. Le type Nullable '{3}' ne satisfait pas la contrainte de '{1}'. Les types Nullable ne peuvent pas satisfaire les contraintes d'interface.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel tipo o metodo generico '{0}'. Il tipo nullable '{3}' non soddisfa il vincolo di '{1}'. I tipi nullable non soddisfano i vincoli di interfaccia.
ja: 型 '{3}' はジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用できません。Null 許容型 '{3}' は、'{1}' の制約を満たしていません。Null 許容型はインターフェイス制約を満たすことはできません。
ko: {3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}' null 허용 형식이 '{1}' 제약 조건을 충족하지 않습니다. null 허용 형식은 어떠한 인터페이스 제약 조건도 만족할 수 없습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Typ zerowalny „{3}” nie spełnia ograniczenia elementu „{1}”. Typy zerowalne nie mogą spełniać żadnych ograniczeń interfejsów.
pt_br: O tipo "{3}" não pode ser usado como parâmetro de tipo "{2}" no tipo ou método genérico "{0}". O tipo "{3}" que permite valores nulos não satisfaz a restrição de "{1}". Os tipos que permitem valores nulos não satisfazem as restrições de interface.
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Тип "{3}", допускающий значение Null, не соответствует ограничению "{1}". Типы, допускающие значение Null, не соответствуют никаким ограничениям интерфейсов.
tr: {3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' null yapılabilir türü '{1}' kısıtlamasını karşılamıyor. Null olabilen türler hiçbir arabirim kısıtlamasını karşılamaz.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。可以为 null 的类型“{3}”不满足“{1}”的约束。可以为 null 的类型不能满足任何接口约束。
zh_hant: 類型 '{3}' 不可用做為泛型類型或方法 '{0}' 中的類型參數 '{2}'。可為 Null 的類型 '{3}' 無法滿足 '{1}' 的條件約束。可為 Null 的類型無法滿足任何介面條件約束。

# ERR_GenericConstraintNotSatisfiedTyVar
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion or type parameter conversion from '{3}' to '{1}'.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Neexistuje žádný převod na uzavřené určení ani převod typu parametru z {3} na {1}.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Es ist keine Boxing-Konvertierung oder Typparameterkonvertierung von "{3}" in "{1}" vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay conversión boxing ni conversión de parámetro de tipo de '{3}' a '{1}'.
fr: Impossible d'utiliser le type '{3}' comme paramètre de type '{2}' dans le type ou la méthode générique '{0}'. Il n'y a pas de conversion boxing ou de conversion de paramètre de type de '{3}' en '{1}'.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Non esistono conversioni boxing o conversioni di parametri di tipo da '{3}' a '{1}'.
ja: 型 '{3}' はジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用できません。'{3}' から '{1}' へのボックス変換または型パラメーター変換がありません。
ko: {3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 boxing 변환 또는 형식 매개 변수 변환이 없습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Brak konwersji pakującej lub konwersji parametru typu z „{3}” na „{1}”.
pt_br: O tipo "{3}" não pode ser usado como parâmetro de tipo "{2}" no tipo ou método genérico "{0}". Não há conversão boxing ou conversão de parâmetro de tipo de "{3}" em "{1}".
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Нет преобразования-упаковки или преобразования параметра типа из "{3}" в "{1}".
tr: {3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' türünden '{1}' türüne bir paketleme dönüşümü veya tür parametresi dönüşümü yoktur.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。没有从“{3}”到“{1}”的装箱转换或类型参数转换。
zh_hant: 類型 '{3}' 不可用做為泛型類型或方法 '{0}' 中的類型參數 '{2}'。沒有從 '{3}' 到 '{1}' 的 Boxing 轉換或類型參數轉換。

# ERR_GenericConstraintNotSatisfiedValType
source: The type '{3}' cannot be used as type parameter '{2}' in the generic type or method '{0}'. There is no boxing conversion from '{3}' to '{1}'.
cs: Typ {3} nejde použít jako parametr typu {2} v obecném typu nebo metodě {0}. Neexistuje žádný převod na uzavřené určení z {3} na {1}.
de: Der Typ "{3}" kann nicht als Typparameter "{2}" im generischen Typ oder in der generischen Methode "{0}" verwendet werden. Es ist keine Boxing-Konvertierung von "{3}" in "{1}" vorhanden.
es: El tipo '{3}' no se puede usar como parámetro de tipo '{2}' en el tipo o método genérico '{0}'. No hay conversión boxing de '{3}' a '{1}'.
fr: Impossible d'utiliser le type '{3}' comme paramètre de type '{2}' dans le type ou la méthode générique '{0}'. Il n'y a pas de conversion boxing de '{3}' en '{1}'.
it: Non è possibile usare il tipo '{3}' come parametro di tipo '{2}' nel metodo o nel tipo generico '{0}'. Non esistono conversioni boxing da '{3}' a '{1}'.
ja: 型 '{3}' はジェネリック型またはメソッド '{0}' 内で型パラメーター '{2}' として使用できません。'{3}' から '{1}' へのボックス変換がありません。
ko: {3}' 형식은 제네릭 형식 또는 '{0}' 메서드에서 '{2}' 형식 매개 변수로 사용할 수 없습니다. '{3}'에서 '{1}'(으)로의 boxing 변환이 없습니다.
pl: Nie można użyć typu „{3}” jako parametru typu „{2}” w typie ogólnym lub metodzie „{0}”. Brak konwersji pakującej z „{3}” na „{1}”.
pt_br: O tipo "{3}" não pode ser usado como parâmetro de tipo "{2}" no tipo ou método genérico "{0}". Não há conversão boxing de "{3}" em "{1}".
ru: Тип "{3}" не может быть использован как параметр типа "{2}" в универсальном типе или методе "{0}". Нет преобразования-упаковки из "{3}" в "{1}".
tr: {3}' türü, '{0}' genel türü veya yöntemi için '{2}' tür parametresi olarak kullanılamaz. '{3}' türünden '{1}' türüne paketleme dönüşümü yoktur.
zh_hans: 类型“{3}”不能用作泛型类型或方法“{0}”中的类型参数“{2}”。没有从“{3}”到“{1}”的装箱转换。
zh_hant: 類型 '{3}' 不可用做為泛型類型或方法 '{0}' 中的類型參數 '{2}'。沒有從 '{3}' 到 '{1}' 的 Boxing 轉換。

# ERR_DuplicateGeneratedName
source: The parameter name '{0}' conflicts with an automatically-generated parameter name
cs: Název parametru {0} je v konfliktu s automaticky generovaným názvem parametru.
de: Der Parametername "{0}" verursacht einen Konflikt mit einem automatisch generierten Parameternamen.
es: El nombre de parámetro '{0}' entra en conflicto con un nombre de parámetro generado automáticamente
fr: Le nom de paramètre '{0}' est en conflit avec un nom de paramètre généré automatiquement
it: Il nome di parametro '{0}' è in conflitto con un nome di parametro generato automaticamente
ja: パラメーター名 '{0}' が自動生成されたパラメーター名と競合しています
ko: 매개 변수 이름 '{0}'이(가) 자동으로 생성된 매개 변수 이름과 충돌합니다.
pl: Nazwa parametru „{0}” powoduje konflikt z nazwą parametru generowaną automatycznie
pt_br: O nome de parâmetro "{0}" está em conflito com um nome de parâmetro gerado automaticamente
ru: Имя параметра "{0}" конфликтует с автоматически созданным именем параметра.
tr: {0}' parametre adı otomatik oluşturulmuş bir parametre adı ile çakışıyor
zh_hans: 参数名“{0}”与某个自动生成的参数名冲突
zh_hant: 參數名稱 '{0}' 與自動產生的參數名稱衝突
