Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_MultiplePredefTypes
source: The predefined type '{0}' is defined in multiple assemblies in the global alias; using definition from '{1}'
cs: Předdefinovaný typ {0} je definovaný ve více sestaveních v globálním aliasu; použije se definice z {1}.
de: Der vordefinierte Typ "{0}" ist in mehreren Assemblys im globalen Alias definiert. Die Definition aus "{1}" wird verwendet.
es: El tipo predefinido '{0}' está definido en varios ensamblados del alias global; se usa la definición de '{1}'
fr: Le type prédéfini '{0}' est défini dans plusieurs assemblys de l'alias global ; utilisation de la définition de '{1}'
it: Il tipo predefinito '{0}' è definito in più assembly nell'alias globale. Verrà usata la definizione contenuta in '{1}'
ja: 定義済みの型 '{0}' は、グローバル エイリアスの複数のアセンブリ内で定義されています。'{1}' からの定義を使用してください
ko: 미리 정의된 형식 '{0}'이(가) 전역 별칭의 여러 어셈블리에 정의되었습니다. '{1}'의 정의를 사용합니다.
pl: Wstępnie zdefiniowany typ „{0}” jest zdefiniowany w wielu zestawach aliasu globalnego. Zostanie użyta definicja z elementu „{1}”.
pt_br: O tipo pré-definido "{0}" está definido em vários assemblies no alias global; usando definição de "{1}"
ru: Предопределенный тип "{0}" определен в нескольких сборках в глобальном псевдониме; используется описание из "{1}"
tr: {0}' öntanımlı türü '{1}' öğesinden tanım kullanarak genel diğer addaki birden çok derlemede tanımlandı
zh_hans: 预定义类型“{0}”是在全局别名的多个程序集中定义的；将使用“{1}”中的定义
zh_hant: 預先定義的類型 '{0}' 在全域別名的多個組件中都有定義; 請使用 '{1}' 中的定義

# WRN_MultiplePredefTypes_Title
source: Predefined type is defined in multiple assemblies in the global alias
cs: Předdefinovaný typ je definovaný ve více sestaveních v globálním aliasu.
de: Der vordefinierte Typ is in mehreren Assemblys im globalen Alias definiert
es: El tipo predefinido está definido en varios ensamblajes en el alias global
fr: Un type prédéfini est défini dans plusieurs assemblys de l'alias global
it: Il tipo predefinito è definito in più assembly nell'alias globale
ja: グローバル エイリアスの複数のアセンブリで定義済みの型が定義されています
ko: 미리 정의된 형식이 전역 별칭의 여러 어셈블리에 정의되어 있습니다.
pl: Wstępnie zdefiniowany typ występuje w wielu zestawach w aliasie globalnym
pt_br: O tipo predefinido está definido em vários assemblies no alias global
ru: Предопределенный тип определяется в нескольких сборках глобального псевдонима
tr: Öntanımlı tür genel diğer addaki birden çok derlemede tanımlanır
zh_hans: 预定义类型是在全局别名的多个程序集中定义的
zh_hant: 預先定義的類型定義在全域別名的多個組件中

# WRN_MultiplePredefTypes_Description
source: This error occurs when a predefined system type such as System.Int32 is found in two assemblies. One way this can happen is if you are referencing mscorlib or System.Runtime.dll from two different places, such as trying to run two versions of the .NET Framework side-by-side.
cs: K této chybě dojde, když se předdefinovaný systémový typ, jako je System.Int32, nachází ve dvou sestaveních. Jedna z možností, jak se to může stát, je, že odkazujete na mscorlib nebo System.Runtime.dll, ze dvou různých míst, například při pokusu spustit dvě verze .NET Framework vedle sebe.
de: Dieser Fehler tritt auf, wenn der vordefinierte Systemtyp, wie z. B. System.Int32, in zwei Assemblys gefunden wird. Das kann auftreten, wenn Sie von zwei unterschiedlichen Stellen auf mscorlib oder System.Runtime.dll verweisen, z. B., indem Sie versuchen, zwei Versionen des .NET Framework nebeneinander auszuführen.
es: Este error se produce cuando un tipo de sistema predefinido como System.Int32 se encuentra en dos ensamblajes. Una forma de que esto suceda es si hace referencia a mscorlib o System.Runtime.dll desde dos lugares diferentes, como si intentase ejecutar dos versiones de .NET Framework en paralelo.
fr: Cette erreur survient quand un type de système prédéfini tel que System.Int32 est trouvé dans deux assemblys. Cela peut se produire quand vous référencez mscorlib ou System.Runtime.dll depuis deux emplacements différents, comme si vous tentiez d'exécuter deux versions du .NET Framework côte à côte.
it: Questo errore si verifica quando in due assembly viene trovato un tipo di sistema predefinito, come System.Int32. Questa situazione può verificarsi, ad esempio, se si fa riferimento a mscorlib o a System.Runtime.dll da due punti diversi, nel tentativo di eseguire due versioni affiancate di .NET Framework.
ja: このエラーは、System.Int32 などの定義済みのシステム型が 2 つのアセンブリで見つかった場合に発生します。これが起こりうる 1 つの方法は、.NET Framework の 2 つのバージョンを同時に実行するなど、2 つの異なる場所から mscorlib または System.Runtime.dll を参照した場合です。
ko: 이 오류는 미리 정의한 시스템 형식(예: System.Int32)이 두 어셈블리에 있는 경우에 발생합니다. 이 오류는 서로 다른 두 위치에서 mscorlib 또는 System.Runtime.dll을 참조할 경우(두 버전의 .NET Framework를 나란히 실행할 경우)에 발생할 수 있습니다.
pl: Ten błąd występuje w przypadku odnalezienia wstępnie zdefiniowanego typu, takiego jak System.Int32, w dwóch zestawach. Może się tak dziać, gdy utworzono odwołanie do elementu mscorlib lub biblioteki System.Runtime.dll w dwóch różnych miejscach, na przykład podczas próby uruchomienia dwóch wersji programu .NET Framework obok siebie.
pt_br: Este erro ocorre quando um tipo predefinido do sistema, como System.Int32, encontra-se em dois assemblies. Uma forma que pode fazer isso acontecer é referenciar mscorlib ou System.Runtime.dll de dois lugares diferentes, por exemplo, tentando executar duas versões de .NET Framework lado a lado.
ru: Эта ошибка происходит, когда предопределенный тип системы, например System.Int32, находится в двух сборках. Единственная причина этого — ссылка на mscorlib или System.Runtime.dll из двух разных расположений, например, при попытке запустить две версии .NET Framework одновременно.
tr: Bu hata iki derlemede System.Int32 gibi öntanımlı bir sistem türü bulunduğunda oluşur. Bunun oluşabileceği yollardan biri, .NET Framework'ün iki sürümünü yan yana çalıştırmaya çalışmak gibi mscorlib veya System.Runtime.dll öğelerine iki farklı yerden başvurmanızdır.
zh_hans: 在两个程序集中找到预定义系统类型(如 System.Int32)时会发生此错误。可能发生这种情况的一种方式是从两个不同位置引用 mscorlib 或 System.Runtime.dll (如尝试并行运行两个版本的 .NET Framework)。
zh_hant: 如果在兩個組件中找到預先定義的系統類型 (例如 System.Int32)，則會發生此錯誤。可能發生此狀況的其中一種原因是參考兩個不同位置的 mscorlib 或 System.Runtime.dll，例如嘗試並排執行兩個版本的 .NET Framework。

# ERR_LocalCantBeFixedAndHoisted
source: Local '{0}' or its members cannot have their address taken and be used inside an anonymous method or lambda expression
cs: Adresu místní proměnné {0} ani jejích členů nejde vzít a použít uvnitř anonymní metody nebo lambda výrazu.
de: Die Adressen von "{0}" (lokal) oder der entsprechenden Member können nicht übernommen und in einer anonymen Methode oder einem Lambdaausdruck verwendet werden.
es: La variable local '{0}' o sus miembros no pueden ceder su dirección para usarse en un método anónimo o una expresión lambda
fr: L'adresse de la variable locale '{0}' ou de ses membres ne peut pas être prise et utilisée dans une méthode anonyme ou une expression lambda
it: Non è possibile accettare e usare gli indirizzi dell'elemento '{0}' locale o dei rispettivi membri all'interno di un metodo anonimo o di un'espressione lambda
ja: ローカル '{0}' またはそのメンバーは、アドレスを与えることも、匿名メソッドまたはラムダ式の内部で使用されることもできません
ko: 지역 '{0}' 또는 해당 멤버의 주소를 가져와 무명 메서드 또는 람다 식 안에 사용할 수 없습니다.
pl: Adresu elementu lokalnego „{0}” lub jego składowych nie można pobrać i użyć wewnątrz metody anonimowej lub wyrażenia lambda.
pt_br: Local "{0}" ou seus membros não podem ter seu endereço obtido nem serem usados dentro de uma método anônimo ou expressão lambda
ru: Локаль "{0}" или его члены не могут получить свои адреса и использоваться внутри анонимного метода или лямбда-выражения
tr: Yerel '{0}' veya üyelerinin adresleri alınıp anonim bir yöntem veya lambda ifadesinde kullanılamaz
zh_hans: 局部变量“{0}”或其成员的地址不能用作匿名方法的参数，也不能在匿名方法或 lambda 表达式内部使用
zh_hant: 無法取得區域變數 '{0}' 或其成員的位址，這些也無法用於匿名方法或 Lambda 運算式內部

# WRN_TooManyLinesForDebugger
source: Source file has exceeded the limit of 16,707,565 lines representable in the PDB; debug information will be incorrect
cs: U zdrojového souboru se překročil limit 16 707 565 řádků, které může soubor PDB obsahovat. Ladicí informace budou nesprávné.
de: Die Quelldatei hat das Limit von 16.707.565 Zeilen überschritten, die in der PDB dargestellt werden können. Die Debuginformationen sind falsch.
es: El archivo de código fuente ha superado el límite de 16.707.565 líneas representables en el PDB. La información de depuración no será correcta.
fr: Le fichier source a dépassé la limite de 16 707 565 lignes pouvant être représentées dans le PDB ; les informations de débogage seront incorrectes
it: Limite di 16.707.565 righe rappresentabili nel PDB superato nel file di origine: le informazioni di debug non saranno corrette
ja: ソース ファイルは、PDB 内で表せる 16,707,565 行の限界を超えているため、デバッグ情報は不正確になります
ko: 소스 파일의 줄 수가 PDB에 표시할 수 있는 16,707,565줄을 초과했습니다. 디버그 정보가 올바르지 않을 수 있습니다.
pl: Plik źródłowy przekroczył limit 16 707 565 wierszy reprezentowanych w pliku PDB; informacje o debugowaniu będą niepoprawne
pt_br: O arquivo de origem excedeu o limite de 16.707.565 linhas representáveis no PDB; as informações de depuração estarão incorretas
ru: Файл с исходным текстом программы превысил установленный в PDB-файле предел в 16 707 565 строк; отладочная информация будет неправильной
tr: Kaynak dosyası PDB'de görüntülenebilecek 16.707.565 satır sınırını aştı; hata ayıklama bilgileri hatalı olacak
zh_hans: 源文件已超过在 PDB 中可表示的 16,707,565 行的限制；调试信息将不正确
zh_hant: 原始程式檔已超過 PDB 所能顯示的上限 16,707,565 行; 偵錯資訊可能會不正確

# WRN_TooManyLinesForDebugger_Title
source: Source file has exceeded the limit of 16,707,565 lines representable in the PDB; debug information will be incorrect
cs: U zdrojového souboru se překročil limit 16 707 565 řádků, které může soubor PDB obsahovat. Ladicí informace budou nesprávné.
de: Die Quelldatei hat das Limit von 16.707.565 Zeilen überschritten, die in der PDB dargestellt werden können. Die Debuginformationen sind falsch.
es: El archivo de código fuente ha superado el límite de 16.707.565 líneas representables en el PDB. La información de depuración no será correcta.
fr: Le fichier source a dépassé la limite de 16 707 565 lignes pouvant être représentées dans le PDB ; les informations de débogage seront incorrectes
it: Limite di 16.707.565 righe rappresentabili nel PDB superato nel file di origine: le informazioni di debug non saranno corrette
ja: ソース ファイルは、PDB 内で表せる 16,707,565 行の限界を超えているため、デバッグ情報は不正確になります
ko: 소스 파일의 줄 수가 PDB에 표시할 수 있는 16,707,565줄을 초과했습니다. 디버그 정보가 올바르지 않을 수 있습니다.
pl: Plik źródłowy przekroczył limit 16 707 565 wierszy reprezentowanych w pliku PDB; informacje o debugowaniu będą niepoprawne
pt_br: O arquivo de origem excedeu o limite de 16.707.565 linhas representáveis no PDB; as informações de depuração estarão incorretas
ru: Файл с исходным текстом программы превысил установленный в PDB-файле предел в 16 707 565 строк; отладочная информация будет неправильной
tr: Kaynak dosyası PDB'de görüntülenebilecek 16.707.565 satır sınırını aştı; hata ayıklama bilgileri hatalı olacak
zh_hans: 源文件已超过在 PDB 中可表示的 16,707,565 行的限制；调试信息将不正确
zh_hant: 原始程式檔已超過 PDB 所能顯示的上限 16,707,565 行; 偵錯資訊可能會不正確

# ERR_CantConvAnonMethNoParams
source: Cannot convert anonymous method block without a parameter list to delegate type '{0}' because it has one or more out parameters
cs: Blok anonymní metody bez seznamu parametrů nejde převést na typ delegáta {0}, protože má nejmíň jeden parametr out.
de: Ein anonymer Methodenblock ohne Parameterliste kann nicht in den Delegattyp "{0}" konvertiert werden, da er mindestens einen out-Parameter aufweist.
es: No se puede convertir el bloque de método anónimo sin una lista de parámetros en el tipo delegado '{0}' porque tiene uno o varios parámetros out
fr: Impossible de convertir un bloc de méthode anonyme sans une liste de paramètres en type délégué '{0}', car il compte un ou plusieurs paramètres out
it: Non è possibile convertire il blocco di metodi anonimi senza elenco parametri nel tipo delegato '{0}' perché contiene uno o più parametri out
ja: デリゲート型 '{0}' には 1 つ以上の out パラメーターが含まれているため、パラメーター リストを含まない匿名メソッド ブロックをこのデリゲート型に変換することはできません
ko: {0}' 대리자 형식에 out 매개 변수가 하나 이상 있으므로 매개 변수 목록이 없는 무명 메서드 블록을 이 대리자 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować bloku metody anonimowej bez listy parametrów na typ delegowany „{0}”, ponieważ ma on jeden lub kilka parametrów out
pt_br: Não é possível converter bloco de métodos anônimos sem uma lista de parâmetros de tipo delegate "{0}" porque ele tem um ou mais parâmetros out
ru: Невозможно преобразовать блок анонимного метода без списка параметров в тип делегата "{0}", так как он имеет один или несколько выходных параметров.
tr: Bir veya daha fazla out parametresi olduğundan parametre listesi olmayan anonim yöntem bloğu '{0}' temsilci türüne dönüştürülemiyor
zh_hans: 无法将不含参数列表的匿名方法块转换为委托类型“{0}”，原因是该方法块具有一个或多个 out 参数
zh_hant: 無法將沒有參數清單的匿名方法區塊，轉換成委派類型 '{0}'，因為其有一或多個 out 參數

# ERR_ConditionalOnNonAttributeClass
source: Attribute '{0}' is only valid on methods or attribute classes
cs: Atribut {0} je platný jenom pro metody nebo třídy atributů.
de: Das "{0}"-Attribut ist nur für Methoden oder Attributklassen gültig.
es: El atributo '{0}' solo es válido en métodos o clases de atributos
fr: L'attribut '{0}' n'est valide que sur les méthodes ou les classes d'attributs
it: L'attributo '{0}' è valido solo per metodi o classi Attribute
ja: 属性 '{0}' は、メソッドまたは属性クラスでのみ有効です
ko: {0}' 특성은 메서드 또는 특성 클래스에서만 유효합니다.
pl: Atrybut „{0}” jest prawidłowy tylko w przypadku metod lub klas atrybutów
pt_br: Atributo "{0}" é somente válido em métodos ou classes de atributo
ru: Атрибут "{0}" допустим только для методов или классов атрибутов.
tr: {0}' özniteliği yalnızca yöntemlerde veya öznitelik sınıflarında geçerlidir
zh_hans: 特性“{0}”仅对方法或特性类有效
zh_hant: 屬性 '{0}' 只有在方法或屬性類別上才有效

# WRN_CallOnNonAgileField
source: Accessing a member on '{0}' may cause a runtime exception because it is a field of a marshal-by-reference class
cs: Přístup ke členovi na {0} může způsobit výjimku za běhu, protože se jedná o pole třídy marshal-by-reference.
de: Das Zugreifen auf einen Member auf "{0}" kann zu einer Laufzeitausnahme führen, da es sich hierbei um ein Feld einer "Marshal by Reference"-Klasse handelt.
es: El acceso a un miembro en '{0}' podría provocar una excepción en tiempo de ejecución, ya que es un campo de una clase de serialización por referencia.
fr: L'accès à un membre de '{0}' peut occasionner une exception runtime, car il s'agit d'un champ d'une classe de marshaling par référence
it: L'accesso a un membro di '{0}' potrebbe causare un'eccezione in fase di esecuzione perché è un campo di una classe con marshalling per riferimento
ja: 参照渡しのマーシャリングクラスのフィールドであるため、'{0}' のメンバーにアクセスすると、ランタイム例外が発生する可能性があります
ko: {0}'은(는) 참조로 마샬링하는 클래스의 필드이므로 이 필드의 멤버에 액세스하면 런타임 예외가 발생할 수 있습니다.
pl: Dostęp do składowej elementu „{0}” może spowodować wystąpienie wyjątku czasu wykonywania, ponieważ to jest pole w klasie marshal-by-reference
pt_br: Acessar um membro em "{0}" pode causar uma exceção de runtime porque é um campo de uma classe marshaling por referência
ru: Доступ к члену в "{0}" может вызвать исключение времени исполнения, поскольку он является полем класса, который маршалируется по ссылке.
tr: Bir başvuruya göre sıralama sınıfının alanı olduğundan '{0}' öğesinde bir üyeye erişmek çalışma zamanı istisnasına neden olabilir
zh_hans: 由于“{0}”是引用封送类的字段，访问上面的成员可能导致运行时异常
zh_hant: 存取 '{0}' 上的成員可能會造成執行階段例外狀況，因為其為傳址封送類別的欄位

# WRN_CallOnNonAgileField_Title
source: Accessing a member on a field of a marshal-by-reference class may cause a runtime exception
cs: Přístup ke členovi v poli třídy marshal-by-reference může způsobit běhovou výjimku.
de: Beim Zugriff auf ein Element zu einem Feld einer "Marshal by Reference"-Klasse kann eine Laufzeitausnahme ausgelöst werden
es: El acceso a un miembro en un campo de una clase de serialización por referencia puede causar una excepción en tiempo de ejecución.
fr: L'accès à un membre sur le champ d'une classe de marshaling par référence peut entraîner une exception de runtime
it: L'accesso a un membro in un campo di una classe con marshalling per riferimento potrebbe causare un'eccezione in fase di esecuzione
ja: 参照渡しのマーシャリングクラスのフィールドのメンバーにアクセスすると、ランタイム例外が発生する可能性があります
ko: 참조로 마샬링하는 클래스의 필드에 있는 멤버에 액세스하면 런타임 예외가 발생할 수 있습니다.
pl: Dostęp do składowej pola w klasie marshal-by-reference może spowodować wystąpienie wyjątku czasu wykonywania
pt_br: Acessar um membro em um campo de uma classe de marshaling por referência pode gerar uma exceção de tempo de execução
ru: Доступ к члену в поле класса маршалинга по ссылке может вызвать исключение времени выполнения
tr: Başvuruya göre sıralanan bir sınıfın alanında üyeye erişmek çalışma zamanı özel durumuna neden olabilir
zh_hans: 访问引用封送类的字段上的成员可能导致运行时异常
zh_hant: 存取傳址封送類別之欄位上的成員，可能會導致執行階段例外狀況

# WRN_CallOnNonAgileField_Description
source: This warning occurs when you try to call a method, property, or indexer on a member of a class that derives from MarshalByRefObject, and the member is a value type. Objects that inherit from MarshalByRefObject are typically intended to be marshaled by reference across an application domain. If any code ever attempts to directly access the value-type member of such an object across an application domain, a runtime exception will occur. To resolve the warning, first copy the member into a local variable and call the method on that variable.
cs: Toto varování se vyskytne, když se pokusíte volat metodu, vlastnost nebo indexer u členu třídy, která se odvozuje z objektu MarshalByRefObject, a tento člen je typu hodnota. Objekty, které dědí z objektu MarshalByRefObject, jsou obvykle zamýšlené tak, že se budou zařazovat podle odkazů v aplikační doméně. Pokud se nějaký kód někdy pokusí o přímý přístup ke členu typu hodnota takového objektu někde v aplikační doméně, dojde k výjimce běhu modulu runtime. Pokud chcete vyřešit toto varování, zkopírujte nejdřív člen do místní proměnné a pak u ní vyvolejte uvedenou metodu.
de: Diese Warnung tritt auf, wenn Sie versuchen eine Methode, Eigenschaft oder einen Indexer eines Elements einer Klasse aufzurufen, die vom MarshalByRefObject abgeleitet wird, und es sich bei dem Element um einen Werttyp handelt. Objekte, die vom MarshalByRefObject vererbt werden, dienen in der Regel dazu, als Verweis in einer Anwendungsdomäne gemarshallt zu werden. Wenn über den Code versucht wird, direkt auf das Werttypelement eines solchen Objekts einer Anwendungsdomäne zuzugreifen, tritt eine Laufzeitausnahme auf. Um diese Warnung zu beheben, kopieren Sie zunächst das Element in eine lokale Variable und rufen Sie dann die Methode der Variable auf.
es: Esta advertencia se produce cuando intenta llamar a un método, a una propiedad o a un indizador en un miembro de una clase que deriva de MarshalByRefObject y el miembro es un tipo de valor. Los objetos que se heredan de MarshallByRefObject suelen estar diseñados para serializarse por referencia a través del dominio de una aplicación. Si, alguna vez, algún tipo de código intenta acceder directamente al miembro del tipo de valor de un objeto así a través del dominio de una aplicación, se producirá una excepción en tiempo de ejecución. Para resolver la advertencia, primero debe copiar el miembro en una variable local y llamar al método en esa variable.
fr: Cet avertissement survient lorsque vous essayez d'appeler une méthode, une propriété ou un indexeur sur le membre d'une classe dérivant de MarshalByRefObject, et que ce membre est un type de valeur. Les objets héritant de MarshalByRefObject doivent généralement être marshalés par référence dans un domaine d'application. Si un code tente d'accéder directement au membre de type valeur d'un tel objet dans un domaine d'application, cela entraîne une exception de runtime. Pour résoudre cet avertissement, veuillez d'abord copier le membre dans une variable locale, avant d'appeler la méthode sur cette variable.
it: Questo avviso viene visualizzato quando prova a chiamare un metodo, una proprietà o un indicizzatore su un membro di una classe derivante da MarshalByRefObject e tale membro è un tipo valore. Il marshalling degli oggetti che ereditano da MarshalByRefObject viene in genere effettuato per riferimento in un dominio applicazione. Qualora un codice provi ad accedere direttamente al membro di tipo valore di tale oggetto in un dominio applicazione, si verificherà un'eccezione in fase di esecuzione. Per risolvere il problema, copiare innanzitutto il membro in una variabile locale e chiamare il metodo su tale variabile.
ja: この警告は、MarshalByRefObject から派生したクラスのメンバーにあるメソッド、プロパティ、またはインデクサーを呼び出し、かつメンバーが値の型である場合に発生します。MarshalByRefObject から継承するオブジェクトは、通常はアプリケーション ドメイン間の参照渡しによってマーシャリングされることになっています。コードがこのようなアプリケーション ドメイン間のオブジェクトの値の型のメンバーに直接アクセスすると、ランタイム例外が発生します。警告を解決するには、まずメンバーをローカル変数にコピーしてから、その変数でメソッドを呼び出します。
ko: 이 경고는 MarshalByRefObject에서 파생되는 클래스 멤버에 대한 메서드, 속성 또는 인덱서를 호출하려고 하고, 멤버가 값 형식일 때 발생합니다. MarshalByRefObject에서 상속되는 개체는 일반적으로 애플리케이션 도메인 전체에서 참조로 마샬링됩니다. 애플리케이션 도메인에서 그런 개체의 값 형식 멤버에 직접 액세스하려고 시도하는 코드가 있을 경우 런타임 예외가 발생합니다. 이 경고를 해결하려면 먼저 멤버를 지역 변수에 복사하고 해당 변수에 대한 메서드를 호출합니다.
pl: To ostrzeżenie występuje, gdy w przypadku próby wywołania metody, właściwości lub indeksatora w składowej klasy pochodnej elementu MarshalByRefObject składowa jest typem wartości. Obiekty dziedziczące po elemencie MarshalByRefObject zwykle powinny być kierowane przez referencję w domenie aplikacji. Jeśli kod spróbuje bezpośrednio uzyskać dostęp do składowej typu wartości takiego obiektu w domenie aplikacji, wystąpi wyjątek czasu wykonywania. Aby rozwiązać problem podany w ostrzeżeniu, skopiuj składową do zmiennej lokalnej i wywołaj metodę w tej zmiennej.
pt_br: Este aviso ocorre quando você tentar chamar um método, propriedade ou indexador em um membro de uma classe que é derivada de MarshalByRefObject, e o membro é um tipo de valor. Objetos herdados de MarshalByRefObject geralmente são destinados a ser empacotado por referência em um domínio de aplicativo. Se um código tentar acessar o membro de tipo de valor de tal objeto diretamente em um domínio de aplicativo, ocorrerá uma exceção de tempo de execução. Para resolver o aviso, primeiro copie o membro em uma variável local e chame o método nessa variável.
ru: Это предупреждение возникает при попытке вызвать метод, свойство или индексатор в члене или классе, производном от MarshalByRefObject; при этом член является типом значения. Объекты, наследуемые от MarshalByRefObject, обычно упаковываются по ссылке в домене приложений. Если код пытается получить прямой доступ к члену типа значения такого объекта в домене приложений, возникнет исключение времени выполнения. Чтобы устранить предупреждение, сначала скопируйте член в локальную переменную и вызовите метод в этой переменной.
tr: Bu uyarı, MarshalByRefObject öğesinden türeyen bir sınıfın üyesindeki bir yöntemi, özelliği veya dizin oluşturucuyu çağırmaya çalıştığınızda ve üye bir değer türü olduğunda oluşur. MarshalByRefObject öğesinden alınan nesneler genellikle uygulama etki alanı genelinde başvuruya göre sıralanır. Bir uygulama etki alanı genelinde bir nesne gibi değer türü üyesine herhangi bir kod doğrudan erişmeye çalışırsa, çalışma zamanı özel durumu oluşur. Uyarıyı çözümlemek için, öncelikle üyeyi yerel bir değişkene kopyalayın ve değişkende yöntemi çağır.
zh_hans: 尝试对从 MarshalByRefObject 派生的类的成员调用方法、属性或索引器，并且成员具有值类型时，会出现此警告。从 MarshalByRefObject 继承的对象通常旨在跨应用程序域进行引用封送。如果任何代码尝试跨应用程序域直接访问这样一个对象的值类型成员，则会出现运行时异常。要解决该警告，请先将成员复制到本地变量中，然后对该变量调用方法。
zh_hant: 如果嘗試在類別衍生自 MarshalByRefObject 的成員上呼叫方法、屬性或索引子，而且成員是實值類型，則會發生此警告。繼承自 MarshalByRefObject 的物件通常是要透過參考跨應用程式定義域進行封送處理。如果任何程式碼曾經嘗試跨應用程式定義域直接存取這類物件的 value-type 成員，則會發生執行階段例外狀況。若要解決此警告，請先將成員複製至區域變數，並對該變數呼叫此方法。

# WRN_InvalidNumber
source: Invalid number
cs: Neplatné číslo
de: Ungültige Zahl.
es: Número no válido
fr: Nombre non valide
it: Numero non valido
ja: 無効な数字です
ko: 잘못된 숫자입니다.
pl: Nieprawidłowy numer
pt_br: Número inválido
ru: Недопустимое число
tr: Geçersiz sayı
zh_hans: 无效数字
zh_hant: 數字無效
