Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CallingConventionTypeIsInvalid
source: Cannot use '{0}' as a calling convention modifier.
cs: {0} se nedá použít jako modifikátor konvence volání.
fr: Impossible d'utiliser '{0}' comme modificateur de convention d'appel.
it: Non è possibile usare '{0}' come modificatore di convenzione di chiamata.
ja: 呼び出し規則修飾子として '{0}' を使用することはできません。
pl: Nie można użyć elementu „{0}” jako modyfikatora konwencji wywoływania.
pt_br: Não é possível usar '{0}' como um modificador de convenção de chamada.
ru: Невозможно использовать "{0}" в качестве модификатора соглашения о вызовах.
zh_hans: 不能将“{0}”用作调用约定修饰符。
zh_hant: 無法使用 '{0}' 作為呼叫慣例修飾元。

# CallingConventionTypesRequireUnmanaged
source: Passing '{0}' is not valid unless '{1}' is 'SignatureCallingConvention.Unmanaged'.
cs: Pokud {1} není SignatureCallingConvention.Unmanaged, předání hodnoty {0} není platné.
fr: Le passage de '{0}' n'est pas valide, sauf si '{1}' est 'SignatureCallingConvention.Unmanaged'.
it: Non è possibile '{0}' a meno che '{1}' non sia 'SignatureCallingConvention.Unmanaged'.
ja: '{1}' が 'SignatureCallingConvention.Unmanaged' でない限り、'{0}' を渡すことは無効です。
pl: Przekazywanie elementu „{0}” jest nieprawidłowe, chyba że element „{1}” ma wartość „SignatureCallingConvention.Unmanaged".
pt_br: A passagem de '{0}' não é válida a menos que '{1}' seja 'SignatureCallingConvention.Unmanaged'.
ru: Передача "{0}" недопустима, если "{1}" является "SignatureCallingConvention.Unmanaged".
zh_hans: 传递“{0}”无效，除非“{1}”是 "SignatureCallingConvention.Unmanaged"。
zh_hant: 除非 '{1}' 為 'SignatureCallingConvention'，否則傳遞 '{0}' 無效。

# CannotCreateConstructedFromConstructed
source: Cannot create constructed generic type from another constructed generic type.
cs: Konstruovaný obecný typ nejde vytvořit z jiného konstruovaného obecného typu.
de: Es kann kein konstruierter generischer Typ aus einem anderen konstruierten generischen Typ erstellt werden.
es: No se puede crear un tipo genérico construido a partir de otro tipo genérico construido.
fr: Impossible de créer un type générique construit à partir d'un autre type générique construit.
it: Non è possibile creare un tipo generico costruito a partire da un altro tipo generico costruito.
ja: 別の構築済みジェネリック型から、構築済みジェネリック型を作成できません。
ko: 다른 생성된 제네릭 형식에서 생성된 제네릭 형식을 만들 수 없습니다.
pl: Nie można utworzyć konstruowanego typu ogólnego z innego konstruowanego typu ogólnego.
pt_br: Não é possível criar um tipo genérico construído com base em outro tipo genérico construído.
ru: Не удается создать сконструированный универсальный тип из другого сконструированного универсального типа.
tr: Oluşturulmuş genel tür, başka bir oluşturulmuş genel türden oluşturulamaz.
zh_hans: 无法从另一个构造泛型类型创建构造泛型类型。
zh_hant: 無法從另一個建構的泛型型別建立建構的泛型型別。

# CannotCreateConstructedFromNongeneric
source: Cannot create constructed generic type from non-generic type.
cs: Konstruovaný obecný typ nejde vytvořit z jiného než obecného typu.
de: Es kann kein konstruierter generischer Typ aus einem nicht generischen Typ erstellt werden.
es: No se puede crear un tipo genérico construido a partir de un tipo no genérico.
fr: Impossible de créer un type générique construit à partir d'un type non générique.
it: Non è possibile creare un tipo generico costruito a partire da un tipo non generico.
ja: 非ジェネリック型から、構築済みジェネリック型を作成できません。
ko: 제네릭이 아닌 형식에서 생성된 제네릭 형식을 만들 수 없습니다.
pl: Nie można utworzyć konstruowanego typu ogólnego z typu nieogólnego.
pt_br: Não é possível criar um tipo genérico construído com base em um tipo não genérico.
ru: Не удается создать сконструированный универсальный тип из неуниверсального типа.
tr: Oluşturulmuş genel tür, genel olmayan türden oluşturulamaz.
zh_hans: 无法从非泛型类型创建构造泛型类型。
zh_hant: 無法從另一個非泛型型別建立建構的泛型型別。

# ERR_AbstractConversionNotInvolvingContainedType
source: User-defined conversion in an interface must convert to or from a type parameter on the enclosing type constrained to the enclosing type
cs: Převod definovaný uživatelem v rozhraní musí převádět do nebo z parametru obecného typu na uzavírajícím typu omezeném na uzavírající typ.
fr: La conversion définie par l'utilisateur dans une interface doit convertir vers ou depuis un paramètre de type sur le type englobant contraint au type englobant.
it: La conversione definita dall'utente in un'interfaccia deve essere convertita da o in un parametro di tipo nel tipo di inclusione vincolato al tipo di inclusione
ja: インターフェイス内のユーザー定義の変換では、それを囲む型に制約されたそれを囲む型の型パラメーターとの間で変換する必要があります
pl: Konwersja zdefiniowana przez użytkownika w interfejsie musi być skonwertowana na lub z parametru typu w przypadku typu otaczającego ograniczonego do typu otaczającego
pt_br: A conversão definida pelo usuário em uma interface deve converter de ou para um parâmetro de tipo no tipo delimitador restrito ao tipo delimitador
ru: Определяемое пользователем преобразование в интерфейсе должно выполнять преобразование в параметр типа или из параметра типа для включающего типа, ограниченного включающим типом
zh_hans: 接口中的用户定义转换必须转换为或转换自封闭类型约束为封闭类型的类型参数
zh_hant: 介面中的使用者定義轉換必須轉換成類型參數，或從被限制為封閉類型的封閉類型上的型別參數轉換

# ERR_AbstractEventHasAccessors
source: '{0}': abstract event cannot use event accessor syntax
cs: {0}: abstraktní událost nemůže používat syntaxi přístupového objektu události.
de: {0}: Das abstrakte Ereignis kann die Ereignisaccessorsyntax nicht verwenden.
es: "{0}": un evento abstracto no puede usar la sintaxis de descriptor de acceso de eventos
fr: '{0}' : un événement abstrait ne peut pas utiliser une syntaxe d'accesseur d'événement
it: '{0}': l'evento astratto non può usare la sintassi della funzione di accesso agli eventi
ja: '{0}': 抽象イベントはイベント アクセサーの構文を使用できません
ko: '{0}': 추상 이벤트는 이벤트 접근자 구문을 사용할 수 없습니다.
pl: „{0}”: zdarzenie abstrakcyjne nie może używać składni metody dostępu zdarzenia
pt_br: '{0}': o evento abstrato não pode usar a sintaxe do acessador de eventos
ru: "{0}": абстрактное событие не может использовать синтаксис метода доступа к событиям.
tr: '{0}': soyut olay, olay erişeni söz dizimini kullanamaz
zh_hans: “{0}”: 抽象事件不可使用事件访问器语法
zh_hant: '{0}' 抽象事件無法使用事件存取子語法

# ERR_AddressOfInIterator
source: The '&' operator cannot be used on parameters or local variables in iterator methods.
fr: L’opérateur « & » ne peut pas être utilisé sur des paramètres ou des variables locales dans des méthodes d’itérateur.
it: L'operatore '&' non può essere usato su parametri o variabili locali in metodi iteratore.
pl: Operatora „&” nie można używać dla parametrów ani zmiennych lokalnych w metodach iteratora.
pt_br: O operador "&" não pode ser usado em parâmetros ou variáveis locais em métodos de iterador.
ru: Оператор "&" нельзя использовать с параметрами или локальными переменными в методах итераторов.
zh_hans: "&" 运算符不能用于迭代器方法中的参数或局部变量。
zh_hant: 迭代器方法的參數或區域變數不得使用 '&' 運算子。

# ERR_AddressOfMethodGroupInExpressionTree
source: '&' on method groups cannot be used in expression trees
cs: '&' pro skupiny metod se nedá použít ve stromech výrazů.
fr: '&' des groupes de méthodes ne peut pas être utilisé dans les arborescences d'expression
it: Non è possibile usare '&' su gruppi di metodi in alberi delle espressioni
ja: メソッド グループの '&' を式ツリーで使用することはできません
pl: Znak „&” dla grup metod nie może być używany w drzewach wyrażeń
pt_br: '&' nos grupos de métodos não pode ser usado em árvores de expressão
ru: "&" в группах методов не может использоваться в деревьях выражений
zh_hans: 不可在表达式树中使用方法组上的 "&"
zh_hant: 不得在運算式樹狀架構中對方法群組使用 '&'

# ERR_AddressOfToNonFunctionPointer
source: Cannot convert &method group '{0}' to non-function pointer type '{1}'.
cs: Skupina &method {0} se nedá převést na typ ukazatele, který neukazuje na funkci ({1}).
fr: Impossible de convertir le groupe '{0}' de &method en type de pointeur non-fonction '{1}'.
it: Non è possibile convertire il gruppo di &metodi '{0}' nel tipo di puntatore non a funzione '{1}'.
ja: &method グループ '{0}' を関数以外のポインター型 '{1}' に変換することはできません。
pl: Nie można przekonwertować grupy &metod „{0}” na typ wskaźnikowy elementu innego niż funkcja „{1}”.
pt_br: Não é possível converter o grupo de &métodos '{0}' no tipo de ponteiro que não é de função '{1}'.
ru: Невозможно преобразовать тип группы &методов "{0}" в указатель не на функцию "{1}".
zh_hans: 无法将方法组“{0}”转换为非函数指针类型“{1}”(&M)。
zh_hant: 無法將方法群組 '{0}' 轉換成非函式指標類型 '{1}'(&M)

# ERR_AllowsClauseMustBeLast
source: The 'allows' constraint clause must be the last constraint specified
fr: La clause de contrainte « allow » doit être la dernière contrainte spécifiée
it: La clausola del vincolo 'allows' deve essere l'ultimo vincolo specificato
pl: Klauzula ograniczenia „allows” musi być ostatnim określonym ograniczeniem
pt_br: A cláusula de restrição "allows" deve ser a última restrição especificada
ru: Предложение ограничения "allows" должно быть последним указанным ограничением
zh_hans: "allows" 约束子句必须是指定的最后一个约束
zh_hant: 'allows' 限制式子句必須是最後一個指定的限制式

# ERR_AltInterpolatedVerbatimStringsNotAvailable
source: To use '@$' instead of '$@' for an interpolated verbatim string, please use language version '{0}' or greater.
cs: Pokud chcete pro interpolovaný doslovný řetězec použít @$ místo $@, použijte verzi jazyka {0} nebo vyšší.
de: Um für eine interpolierte ausführliche Zeichenfolge "@$" anstelle von "$@" zu verwenden, benötigen Sie Sprachversion {0} oder höher.
es: Para usar "@$" en lugar de "$@" para una cadena textual interpolada, use la versión "{0}" del lenguaje o una posterior.
fr: Pour utiliser '@$' à la place de '$@' pour une chaîne verbatim interpolée, utilisez la version de langage '{0}' ou une version ultérieure.
it: Per usare '@$' invece di '$@' per una stringa verbatim interpolata, usare la versione '{0}' o versioni successive del linguaggio.
ja: 挿入される逐語的文字列で '$@' の代わりに '@$' を使用するには、言語バージョン '{0}' 以上をご使用ください。
ko: 보간된 축자 문자열에 '$@' 대신 '@$'를 사용하려면 언어 버전 '{0}' 이상을 사용하세요.
pl: Aby użyć elementu „@$” zamiast elementu „$@” w interpolowanym ciągu dosłownym, użyj wersji języka „{0}” lub nowszej.
pt_br: Para usar '@$' em vez de '$@' em uma cadeia de caracteres verbatim interpolada, use a versão de linguagem {0} ou superior.
ru: Чтобы применять "@$" вместо "$@" для интерполированной буквальной строки, следует использовать версию языка "{0}" или более позднюю.
tr: İlişkilendirilmiş tam bir dize için '$@' yerine '@$' kullanmak amacıyla lütfen '{0}' veya daha yüksek bir dil sürümü kullanın.
zh_hans: 若要对内插逐字字符串使用 "@$" 而不是 "$@"，请使用语言版本 {0} 或更高版本。
zh_hant: 若要在插入的逐字字串使用 '@$' 而不是 '$@'，請使用 '{0}' 或更高的語言版本。

# ERR_AmbigBinaryOpsOnDefault
source: Operator '{0}' is ambiguous on operands '{1}' and '{2}'
cs: Operátor {0} je na operandech {1} a {2} nejednoznačný.
fr: L'opérateur '{0}' est ambigu pour les opérandes '{1}' et '{2}'
it: L'operatore '{0}' è ambiguo sugli operandi '{1}' e '{2}'
ja: '{1}' および '{2}' のオペランドの演算子 '{0}' があいまいです
pl: Operator „{0}” jest niejednoznaczny dla operandów „{1}” i „{2}”
pt_br: O operador '{0}' é ambíguo em operandos '{1}' e '{2}'
ru: Оператор "{0}" для операндов "{1}" и "{2}" является неоднозначным.
zh_hans: 运算符 "{0}" 对操作数 "{1}" 和 "{2}" 不明确
zh_hant: 運算元 '{1}' 和 '{2}' 上的運算子 '{0}' 模稜兩可

# ERR_AmbigBinaryOpsOnUnconstrainedDefault
source: Operator '{0}' cannot be applied to 'default' and operand of type '{1}' because it is a type parameter that is not known to be a reference type
cs: Operátor {0} nejde použít pro default a operand typu {1}, protože se jedná o parametr typu, který není znám jako odkazový typ.
de: Der Operator "{0}" kann nicht auf "default" und den Operanden vom Typ "{1}" angewendet werden, weil es sich um einen Typparameter handelt, der nicht als Verweistyp bekannt ist.
es: No se puede aplicar el operador "{0}" a "Predeterminado" y a un operando de tipo "{1}", ya que es un parámetro de tipo del que no se conoce que sea un tipo de referencia.
fr: L'opérateur '{0}' ne peut pas être appliqué à 'default' et à l'opérande de type '{1}', car il s'agit d'un paramètre de type qui n'est pas connu en tant que type référence
it: Non è possibile applicare l'operatore '{0}' a 'default ' e all'operando di tipo '{1}' perché è un parametro di tipo non noto come tipo riferimento
ja: 演算子 '{0}' は、参照型として認識されていない型パラメーターであるため、型 '{1}' の 'default' およびオペランドに適用できません
ko: '{0}' 연산자는 참조 형식인 것으로 알려지지 않은 형식 매개 변수이므로 'default' 및 '{1}' 형식의 피연산자에 적용할 수 없습니다.
pl: Nie można zastosować operatora „{0}” do elementu „default” i operandu typu „{1}”, ponieważ jest to parametr typu, który nie jest znany jako typ referencyjny
pt_br: O operador '{0}' não pode ser aplicado a 'default' e ao operando do tipo '{1}' porque é um parâmetro de tipo que não é conhecido como um tipo de referência
ru: Оператор "{0}" не может быть применен к "default" и операнду типа "{1}", так как это параметр типа, который не является ссылочным типом.
tr: '{0}' işleci, başvuru türü olduğu bilinmeyen bir tür parametresi olduğundan 'default' öğesine ve '{1}' türünde işlenene uygulanamıyor
zh_hans: 运算符“{0}”不能应用于 "default" 和类型为“{1}”的操作数，因为它是一个类型参数，而且不是已知的引用类型
zh_hant: 無法將運算子 '{0}' 套用至 'default' 和類型為 '{1}' 的運算元，原因是其為未知參考型別的型別參數

# ERR_AmbigExtension
source: The extension resolution is ambiguous between the following members: '{0}' and '{1}'
pt_br: A resolução de extensão é ambígua entre os seguintes membros: "{0}" e "{1}"

# ERR_AmbigOperator
source: Operator resolution is ambiguous between the following members: '{0}' and '{1}'
pt_br: A resolução do operador é ambígua entre os seguintes membros: "{0}" e "{1}"

# ERR_AmbiguousPrimaryConstructorParameterAsColorColorReceiver
source: Identifier '{0}' is ambiguous between type '{1}' and parameter '{2}' in this context.
cs: Identifikátor {0} je v tomto kontextu nejednoznačný mezi typem {1} a parametrem {2}.
fr: L’identificateur '{0}' est ambiguë entre le type '{1}' et le paramètre '{2}' dans ce contexte.
it: L'identificatore '{0}' è ambiguo tra il tipo '{1}' e il parametro '{2}'.
ja: 識別子 '{0}' は、このコンテキストの型 '{1}' とパラメーター '{2}' の間であいまいです。
pl: Identyfikator '{0}' jest niejednoznaczny między typem '{1}' i parametrem '{2}' w tym kontekście.
pt_br: O identificador "{0}" é ambíguo entre o tipo "{1}" e o parâmetro "{2}" neste contexto.
ru: Идентификатор "{0}" является неоднозначным между типом "{1}" и параметром "{2}" в этом контексте.
zh_hans: 在此上下文中，标识符“{0}”在类型“{1}”和参数“{2}”之间不明确。
zh_hant: 在此內容中，類型 '{1}' 與參數 '{2}' 之間的識別碼 '{0}' 不明確。

# ERR_AnnotationDisallowedInObjectCreation
source: Cannot use a nullable reference type in object creation.
cs: K vytvoření objektu nejde použít typ odkazu s možnou hodnotou null.
de: Ein Nullable-Verweistyp kann bei der Objekterstellung nicht verwendet werden.
es: No se puede usar un tipo de referencia que acepte valores NULL en la creación de objetos.
fr: Impossible d'utiliser un type référence Nullable dans la création d'objet.
it: Non è possibile usare un tipo riferimento nullable durante la creazione di oggetti.
ja: オブジェクト作成では Null 許容参照型を使用できません。
ko: nullable 참조 형식은 개체를 만드는 데 사용할 수 없습니다.
pl: Nie można użyć typu referencyjnego dopuszczającego wartość null podczas tworzenia obiektu.
pt_br: Não é possível usar um tipo de referência que permite valor nulo na criação do objeto.
ru: При создании объекта невозможно использовать ссылочный тип, допускающий значения NULL.
tr: Nesne oluşturma içinde boş değer atanabilir bir başvuru türü kullanılamaz.
zh_hans: 无法在对象创建中使用可为 null 的引用类型。
zh_hant: 無法在建立物件時使用可為 Null 的參考型別。

# ERR_AnonDelegateCantUseRefLike
source: Cannot use parameter '{0}' that has ref-like type inside an anonymous method, lambda expression, query expression, or local function
cs: Parametr {0}, který má typ podobný odkazu, nejde použít uvnitř anonymní metody, výrazu lambda, výrazu dotazu nebo místní funkce.
fr: Impossible d’utiliser le paramètre '{0}' qui a un type de référence similaire à une référence à l’intérieur d’une méthode anonyme, d’une expression lambda, d’une expression de requête ou d’une fonction locale.
it: Non è possibile usare il parametro '{0}' con tipo simile a ref all'interno di un metodo anonimo, di un'espressione lambda, di un'espressione di query o di una funzione locale
ja: 匿名メソッド、ラムダ式、クエリ式、またはローカル関数内で ref に似た型を持つパラメーター '{0}' を使用することはできません
pl: Nie można użyć parametru '{0}', który ma typ przypominający odwołanie wewnątrz metody anonimowej, wyrażenia lambda, wyrażenia zapytania lub funkcji lokalnej
pt_br: Não é possível usar o parâmetro "{0}" que tenha o tipo ref-like dentro de um método anônimo, expressão lambda, expressão de consulta ou função local
ru: Невозможно использовать параметр "{0}" типа ref-like внутри анонимного метода, лямбда-выражения, выражения запроса или локальной функции
zh_hans: 无法使用匿名方法、lambda 表达式、查询表达式或局部函数内具有 ref-like 类型的参数“{0}”
zh_hant: 無法使用在匿名方法、Lambda 運算式、查詢運算式或區域函式內具有類似參考類型的參數 '{0}'

# ERR_AnonDelegateCantUseStructPrimaryConstructorParameterCaptured
source: Anonymous methods, lambda expressions, query expressions, and local functions inside a struct cannot access primary constructor parameter also used inside an instance member
cs: Anonymní metody, výrazy lambda, výrazy dotazů a místní funkce uvnitř struktury nemají přístup k parametru primárního konstruktoru, který se používá také uvnitř členu instance.
fr: Les méthodes anonymes, les expressions lambda, les expressions de requête et les fonctions locales à l’intérieur d’une structure ne peuvent pas accéder au paramètre primaire du constructeur également utilisé à l’intérieur d’un membre de l’instance.
it: Metodi anonimi, espressioni lambda, espressioni di query e funzioni locali all'interno di uno struct non possono accedere al parametro del costruttore primario usato anche all'interno di un membro di istanza
ja: 構造体内の匿名メソッド、ラムダ式、クエリ式、ローカル関数は、インスタンス メンバー内でも使用されるプライマリ コンストラクター パラメーターにアクセスできません
pl: Metody anonimowe, wyrażenia lambda, wyrażenia zapytań i funkcje lokalne wewnątrz struktury nie mogą uzyskać dostępu do głównego parametru konstruktora używanego również wewnątrz członka wystąpienia.
pt_br: Métodos anônimos, expressões lambda, expressões de consulta e funções locais dentro de um struct não podem acessar o parâmetro de construtor primário também usado dentro de um membro de instância
ru: Анонимные методы, лямбда-выражения, выражения запроса и локальные функции внутри структуры не могут получить доступ к параметру основного конструктора, также используемому внутри элемента экземпляра
zh_hans: 结构内的匿名方法、lambda 表达式、查询表达式和局部函数无法访问同时在实例成员内使用的主构造函数参数
zh_hant: 結構內的匿名方法、Lambda 運算式、查詢運算式和區域函式無法存取也在執行個體成員內使用的主要建構函式參數

# ERR_AnonDelegateCantUseStructPrimaryConstructorParameterInMember
source: Anonymous methods, lambda expressions, query expressions, and local functions inside an instance member of a struct cannot access primary constructor parameter
cs: Anonymní metody, výrazy lambda, výrazy dotazů a místní funkce uvnitř členu instance struktury nemají přístup k parametru primárního konstruktoru.
fr: Les méthodes anonymes, les expressions lambda, les expressions de requête et les fonctions locales dans un membre d’instance d’un struct ne peuvent pas accéder au paramètre du constructeur principal
it: Metodi anonimi, espressioni lambda, espressioni di query e funzioni locali all'interno di un membro di istanza di uno struct non possono accedere al parametro del costruttore primario
ja: 構造体のインスタンス メンバー内の匿名メソッド、ラムダ式、クエリ式、ローカル関数は、プライマリ コンストラクター パラメーターにアクセスできません
pl: Metody anonimowe, wyrażenia lambda, wyrażenia zapytań i funkcje lokalne wewnątrz członka instancji struktury nie mają dostępu do głównego parametru konstruktora.
pt_br: Métodos anônimos, expressões lambda, expressões de consulta e funções locais dentro de um membro de instância de um struct não podem acessar o parâmetro do construtor primário
ru: Анонимные методы, лямбда-выражения, выражения запроса и локальные функции внутри элемента экземпляра структуры не могут получить доступ к параметру основного конструктора
zh_hans: 结构的实例成员内的匿名方法、lambda 表达式、查询表达式和局部函数无法访问主构造函数参数
zh_hant: 結構的執行個體成員內的匿名方法、Lambda 運算式、查詢運算式和區域函式無法存取主要建構函式參數

# ERR_ArgumentNameInITuplePattern
source: Element names are not permitted when pattern-matching via 'System.Runtime.CompilerServices.ITuple'.
cs: Názvy elementů nejsou povolené při porovnávání vzorů přes System.Runtime.CompilerServices.ITuple.
de: Elementnamen sind bei einem Musterabgleich über "System.Runtime.CompilerServices.ITuple" nicht erlaubt.
es: No se permiten nombres de elemento cuando se lleva a cabo la coincidencia de patrones con "System.Runtime.CompilerServices.ITuple".
fr: Les noms d'éléments ne sont pas autorisés durant l'utilisation de critères spéciaux via 'System.Runtime.CompilerServices.ITuple'.
it: I nomi di elemento non sono consentiti quando si definiscono criteri di ricerca tramite 'System.Runtime.CompilerServices.ITuple'.
ja: 'System.Runtime.CompilerServices.ITuple' を使用してパターン マッチングを行う場合、要素名を使用することはできません。
ko: 'System.Runtime.CompilerServices.ITuple'을 통한 패턴 일치 시 요소 이름은 허용되지 않습니다.
pl: Nazwy elementów nie są dozwolone przy dopasowywaniu wzorca za pośrednictwem elementu „System.Runtime.CompilerServices.ITuple”.
pt_br: Os nomes de elemento não são permitidos em caso de correspondência de padrões por meio de 'System.Runtime.CompilerServices.ITuple'.
ru: Имена элементов запрещены при сопоставлении шаблонов с помощью "System.Runtime.CompilerServices.ITuple".
tr: 'System.Runtime.CompilerServices.ITuple' aracılığıyla desen eşleştirme gerçekleştirilirken öğe adlarına izin verilmez.
zh_hans: 通过 "System.Runtime.CompilerServices.ITuple" 进行模式匹配时，不允许使用元素名称。
zh_hant: 當透過 'System.Runtime.CompilerServices.ITuple' 進行模式比對時，不允許元素名稱。

# ERR_AsNullableType
source: It is not legal to use nullable reference type '{0}?' in an as expression; use the underlying type '{0}' instead.
cs: Ve výrazu as se nepovoluje použití typu odkazu s možnou hodnotou null {0}?; místo toho použijte základní typ {0}.
de: Es ist unzulässig, den Nullable-Verweistyp "{0}?" in einem as-Ausdruck zu verwenden. Verwenden Sie stattdessen den zugrunde liegenden Typ "{0}".
es: No se puede usar el tipo "{0}?" que acepta valores NULL en una expresión as; use en su lugar el tipo "{0}" subyacente.
fr: Il n'est pas correct d'utiliser le type de référence Nullable '{0}?' dans une expression as. Utilisez le type sous-jacent '{0}' à la place.
it: Non è consentito usare il tipo riferimento nullable '{0}?' in un'espressione as. Usare il tipo sottostante '{0}'.
ja: as 式で Null 許容参照型 '{0}?' を使用することはできません。代わりに基になる型 '{0}' をご使用ください。
ko: 식에 nullable 참조 형식 '{0}'을(를) 사용하는 것은 올바르지 않습니다. 대신 기본 형식 '{0}'을(를) 사용하세요.
pl: Użycie typu odwołania dopuszczającego wartość null „{0}?” w wyrażeniu „as” jest niedozwolone. Zamiast tego użyj bazowego typu „{0}”.
pt_br: É ilegal usar o tipo de referência anulável '{0}?' em uma expressão as; use o tipo subjacente '{0}' em seu lugar.
ru: Недопустимо использовать ссылочный тип "{0}", допускающий значения NULL, в выражении "as". Используйте вместо него базовый тип "{0}".
tr: Boş değer atanabilir '{0}?' başvuru türünün bir as ifadesinde kullanılması yasaktır; bunun yerine temel alınan '{0}' türünü kullanın.
zh_hans: 在 as 表达式中使用可以为 null 的引用类型“{0}?”是非法的；请改用基础类型“{0}”。
zh_hant: 在運算式中使用可為 Null 的參考型別 '{0}?' 不合法，請改用基礎類型 '{0}'。
