Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NullPropagatingOpInExpressionTree
source: An expression tree lambda may not contain a null propagating operator.
cs: Strom výrazu lambda nesmí obsahovat operátor šířící null.
de: Ein Ausdrucksbaumstruktur-Lambda darf keinen null propagierenden Operator enthalten.
es: Una expresión lambda de árbol de expresión no puede contener un operador de propagación NULL.
fr: Une arborescence d'expression lambda ne peut pas contenir un opérateur de propagation null.
it: Un'espressione lambda dell'albero delle espressioni non può contenere un operatore di propagazione Null.
ja: 式ツリーのラムダに null 伝搬演算子を含めることはできません。
ko: 람다 식 트리에는 null 전파 연산자가 포함될 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać operatora propagowania wartości null.
pt_br: Uma árvore de expressão da expressão lambda não pode conter um operador nulo em propagação.
ru: Лямбда дерева выражения не может содержать оператор распространения значений NULL.
tr: Bir ifade ağacı lambdası null değerini yayan bir işleç içeremez.
zh_hans: 表达式树 Lambda 不能包含空传播运算符。
zh_hant: 運算式樹狀架構 Lambda 不可包含 null 散佈運算子。

# ERR_DictionaryInitializerInExpressionTree
source: An expression tree lambda may not contain a dictionary initializer.
cs: Strom výrazu lambda nesmí obsahovat inicializátor slovníku.
de: Ein Ausdrucksbaumstruktur-Lambda darf keinen Wörterbuchinitialisierer enthalten.
es: Una expresión lambda de árbol de expresión no puede contener un inicializador de diccionarios.
fr: Une arborescence d'expression lambda ne peut pas contenir un initialiseur de dictionnaire.
it: Un'espressione lambda dell'albero delle espressioni non può contenere un inizializzatore di dizionario.
ja: 式ツリーのラムダに辞書初期化子を含めることはできません。
ko: 람다 식 트리에는 사전 이니셜라이저가 포함될 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać inicjatora słownika.
pt_br: Uma árvore de expressão da expressão lambda não pode conter um inicializador de dicionário.
ru: Лямбда дерева выражения не может содержать инициализатор словаря.
tr: Bir ifade ağacı lambdası bir sözlük başlatıcısı içeremez.
zh_hans: 表达式树 lambda 不能包含一个字典初始值设定项。
zh_hant: 運算式樹狀架構 Lambda 不可包含字典初始設定式。

# ERR_ExtensionCollectionElementInitializerInExpressionTree
source: An extension Add method is not supported for a collection initializer in an expression lambda.
cs: Rozšiřující metoda Add není pro inicializátor kolekce v lambda výrazu podporovaná.
de: Add-Methoden für Erweiterungen werden für Sammlungsinitialisierer in einem Ausdruckslambda nicht unterstützt.
es: No se admite un método Add de extensión para un inicializador de colección en un lambda de expresión.
fr: Une méthode Add d'extension n'est pas prise en charge pour un initialiseur de collection dans une expression lambda.
it: Un metodo Add di estensione non è supportato per un inizializzatore di raccolta in un'espressione lambda.
ja: 拡張 Add メソッドは、ラムダ式のコレクション初期化子ではサポートされていません。
ko: 람다 식의 컬렉션 이니셜라이저에 대해서는 확장 추가 메서드가 지원되지 않습니다.
pl: Metoda Add rozszerzenia nie jest obsługiwana w przypadku inicjatora kolekcji w operatorze lambda wyrażenia.
pt_br: Não há suporte para um método de Adição de extensão para um inicializador de coleção em uma expressão lambda.
ru: Расширение "Добавление метода" не поддерживается для инициализатора коллекции в лямбда-выражении.
tr: Bir lambda ifadesinde koleksiyon başlatıcısı için uzantı Add yöntemi desteklenmiyor.
zh_hans: 表达式 lambda 中的集合初始值设定项不支持扩展 Add 方法。
zh_hant: 運算式 Lambda 中的集合初始設定式不支援擴充功能 Add 方法。

# IDS_FeatureNameof
source: nameof operator
cs: operátor nameof
es: nombre de operador
fr: opérateur nameof
it: operatore nameof
ja: nameof 演算子
ko: nameof 연산자
pl: operator nameof
pt_br: nome do operador
ru: оператор nameof
tr: nameof işleci
zh_hans: nameof 运算符
zh_hant: nameof 運算子

# IDS_FeatureDictionaryInitializer
source: dictionary initializer
cs: inicializátor slovníku
de: Wörterbuchinitialisierer
es: inicializador de diccionarios
fr: initialiseur de dictionnaire
it: inizializzatore di dizionario
ja: 辞書初期化子
ko: 사전 이니셜라이저
pl: inicjator słownika
pt_br: inicializador de dicionário
ru: инициализатор словаря
tr: sözlük başlatıcısı
zh_hans: 字典初始值设定项
zh_hant: 字典初始設定式

# ERR_UnclosedExpressionHole
source: Missing close delimiter '}' for interpolated expression started with '{'.
cs: Chybí uzavírací oddělovač } pro interpolovaný výraz začínající na {.
de: Das schließende Trennzeichen "}" fehlt für den interpolierten Ausdruck, der mit "{" beginnt.
es: Falta el delimitador de cierre '}' de la expresión interpolada que empieza por '{'.
fr: Délimiteur de fin '}' manquant pour l'expression interpolée qui débute par '{'.
it: Manca il delimitatore '}' di chiusura per l'espressione interpolata che inizia con '{'.
ja: {' で始まる挿入式の終了区切り文字 '}' がありません。
ko: {'로 시작하는 보간된 식의 닫는 구분 기호 '}'가 없습니다.
pl: Brak zamykającego znaku ograniczającego „}” dla interpolowanego wyrażenia rozpoczynającego się od znaku „{”.
pt_br: Delimitador de fechamento ausente '}' para expressão interpolada iniciada com '{'.
ru: Отсутствует закрывающий разделитель "}" для интерполированного выражения, начинающегося с "{".
tr: {' ile başlatılan ara değerli bir ifadede eksik '}' kapatma sınırlayıcısı.
zh_hans: 以“{”开头的插补的表达式缺少结束分隔符“}”。
zh_hant: 以 '{' 開頭的插入運算式遺漏結束分隔符號 '}'

# ERR_InsufficientStack
source: An expression is too long or complex to compile
cs: Výraz je pro zkompilování moc dlouhý nebo složitý.
de: Ein Ausdruck ist zu lang oder zu komplex für eine Kompilierung.
es: Una expresión es demasiado larga o compleja para compilarla
fr: Une expression est trop longue ou complexe à compiler
it: Espressione troppo lunga o complessa per essere compilata
ja: 式が長すぎるか複雑すぎるため、コンパイルできません
ko: 식이 너무 길거나 복잡하여 컴파일할 수 없습니다.
pl: Wyrażenie jest zbyt długie lub zbyt złożone do skompilowania
pt_br: Uma expressão é muito longa ou complexa para ser compilada
ru: Выражение слишком длинное или сложное для компиляции
tr: İfade, derlemek için çok uzun veya çok karmaşık
zh_hans: 表达式太长或者过于复杂，无法编译
zh_hant: 運算式太長或太複雜，造成編譯困難

# ERR_ExpressionHasNoName
source: Expression does not have a name.
cs: Výraz není pojmenovaný.
de: Ausdruck hat keinen Namen.
es: La expresión no tiene un nombre.
fr: L'expression n'a pas de nom.
it: L'espressione non ha un nome.
ja: 式に名前がありません。
ko: 식에 이름이 없습니다.
pl: Wyrażenie nie ma nazwy.
pt_br: A expressão não tem um nome.
ru: Выражение не имеет имени.
tr: İfade bir ada sahip değil.
zh_hans: 表达式不具有名称。
zh_hant: 運算式沒有名稱。

# ERR_SubexpressionNotInNameof
source: Sub-expression cannot be used in an argument to nameof.
cs: Dílčí výraz se jako argument nameof nedá použít.
de: Unterausdruck kann nicht in einem Argument für "nameof" verwendet werden.
es: La subexpresión no se puede usar en un argumento de nameof.
fr: Une sous-expression ne peut pas être utilisée dans un argument de nameof.
it: Non è possibile usare l'espressione secondaria in un argomento di nameof.
ja: サブ式は nameof への引数に使用できません。
ko: 부분식은 nameof에 대한 인수에서 사용할 수 없습니다.
pl: Podwyrażenie nie może być używane w argumencie operatora „nameof”.
pt_br: A subexpressão não pode ser usada em um argumento para nameof.
ru: Невозможно использовать подвыражение в аргументе nameof.
tr: Alt ifade bir nameof bağımsız değişkeninde kullanılamaz.
zh_hans: 子表达式不能在 nameof 的参数中使用。
zh_hant: nameof 的引數中不可使用子運算式。

# ERR_AliasQualifiedNameNotAnExpression
source: An alias-qualified name is not an expression.
cs: Název kvalifikovaný pomocí aliasu není výraz.
de: Ein aliasqualifizierter Name ist kein Ausdruck.
es: Un nombre calificado con el alias no es una expresión.
fr: Un nom qualifié d'alias n'est pas une expression.
it: Un nome qualificato da alias non è un'espressione.
ja: エイリアスで修飾された名前は式ではありません。
ko: 정규화된 별칭 이름은 식이 아닙니다.
pl: Nazwa kwalifikowana za pomocą aliasu nie jest wyrażeniem.
pt_br: Um nome qualificado para alias não é uma expressão.
ru: Полное имя псевдонима не является выражением.
tr: Diğer adla nitelenmiş ad, bir ifade değil.
zh_hans: 别名限定名称不是表达式。
zh_hant: 別名限定的名稱不是運算式。

# ERR_NameofMethodGroupWithTypeParameters
source: Type parameters are not allowed on a method group as an argument to 'nameof'.
cs: Parametry typu se u skupiny metod nedají použít jako argument nameof.
de: Typparameter sind in einer Methodengruppe als Argument für "nameof" nicht zulässig.
es: Los parámetros de tipo no se permiten en un grupo de método como argumento de "nameof".
fr: Les paramètres de type ne sont pas autorisés sur un groupe de méthodes en tant qu'argument pour 'nameof'.
it: In un gruppo di metodi non sono consentiti parametri di tipo usati come argomento di 'nameof'.
ja: 型パラメーターは、メソッド グループで 'nameof' への引数として使用できません。
ko: 형식 매개 변수는 메서드 그룹에서 'nameof'에 대한 인수로 허용되지 않습니다.
pl: Parametry typu nie są dozwolone w grupie metod jako argument operatora „nameof”.
pt_br: Os parâmetros de tipo não são permitidos em um grupo de métodos como um argumento para 'nameof'.
ru: Параметры типа не разрешены в группе методов в качестве аргумента "nameof".
tr: Metot grubunda, tür parametrelerine 'nameof' bağımsız değişkeni olarak izin verilmez.
zh_hans: 类型参数不允许在方法组中作为 "nameof" 的参数使用。
zh_hant: 方法群組上不可使用類型參數做為 'nameof' 的引數。

# NoNoneSearchCriteria
source: SearchCriteria is expected.
cs: Očekává se třída SearchCriteria.
de: SearchCriteria wird erwartet.
es: Se espera SearchCriteria.
fr: SearchCriteria est attendu.
it: È previsto SearchCriteria.
ja: SearchCriteria が必要です。
ko: SearchCriteria가 필요합니다.
pl: Oczekiwano elementu SearchCriteria.
pt_br: SearchCriteria é esperado.
ru: Ожидается SearchCriteria.
tr: SearchCriteria bekleniyor.
zh_hans: 需要 SearchCriteria。
zh_hant: 必須是 SearchCriteria。

# ERR_InvalidAssemblyCulture
source: Assembly culture strings may not contain embedded NUL characters.
cs: Řetězce jazykové verze sestavení nesmí obsahovat vložené znaky NUL.
de: Assemblykultur-Zeichenfolgen dürfen keine eingebetteten NUL-Zeichen enthalten.
es: Las cadenas de referencia cultural de ensamblado no pueden contener caracteres NULL incrustados.
fr: Les chaînes de culture d'assembly ne peuvent pas contenir de caractères null incorporés.
it: Le stringhe delle impostazioni cultura dell'assembly potrebbero non contenere caratteri NUL incorporati.
ja: アセンブリ カルチャ文字列に埋め込み NUL 文字を含めることはできません。
ko: 어셈블리 문화권 문자열에는 포함된 NUL 문자가 포함되지 않을 수 있습니다.
pl: Ciągi kultury zestawu nie mogą zawierać osadzonych znaków NUL.
pt_br: As cadeias de caracteres de cultura de assembly podem não conter caracteres NUL incorporados.
ru: Строки языка и региональных параметров сборки могут не содержать встроенных символов NULL.
tr: Derleme kültürü dizeleri gömülü NUL karakterler içeremez.
zh_hans: 程序集区域性字符串可能不包含嵌入式 NUL 字符。
zh_hant: 組件文化特性字串可能不包含內嵌的 NUL 字元。

# IDS_FeatureUsingStatic
source: using static
de: verwendet statische
es: uso de versión estática
pt_br: usando estático
zh_hant: 使用靜態

# IDS_FeatureInterpolatedStrings
source: interpolated strings
cs: interpolované řetězce
de: Interpolierte Zeichenfolgen
es: cadenas interpoladas
fr: chaînes interpolées
it: stringhe interpolate
ja: 補間された文字列
ko: 보간된 문자열
pl: ciągi interpolowane
pt_br: cadeias de caracteres interpoladas
ru: интерполированные строки
tr: aradeğerlendirme dizeleri
zh_hans: 内插字符串
zh_hant: 內插字串

# IDS_AwaitInCatchAndFinally
source: await in catch blocks and finally blocks
cs: očekávat v blocích catch a blocích finally
de: "await" in Catch-Blöcken und Finally-Blöcken
es: await en bloques catch y finally
fr: attendre dans des blocs catch et des blocs finally
it: await in blocchi catch e blocchi finally
ja: catch ブロックおよび finally ブロックで待機
ko: catch 블록 및 finally 블록의 await
pl: Instrukcja await w blokach catch i finally
pt_br: aguardar em blocos variáveis e blocos finais
ru: ожидать в блоках "Catch" и "Finally"
tr: catch ve finally bloklarında await
zh_hans: 在 catch 块和 finally 块中等待
zh_hant: 等待於 catch 區塊與 finally 區塊中

# IDS_FeatureBinaryLiteral
source: binary literals
cs: binární literály
de: binäre Literale
es: literales binarios
fr: littéraux binaires
it: valori letterali binari
ja: バイナリ リテラル
ko: 이진 리터럴
pl: literały binarne
pt_br: literais binários
ru: двоичные литералы
tr: ikili sabit değerler
zh_hans: 二进制文字
zh_hant: 二進位常值

# IDS_FeatureDigitSeparator
source: digit separators
cs: oddělovače číslic
de: Zifferntrennzeichen
es: separadores de dígitos
fr: séparateurs numériques
it: separatori di cifra
ja: 桁区切り記号
ko: 숫자 구분 기호
pl: separatory cyfr
pt_br: separadores de dígito
ru: цифровые разделители
tr: basamak ayırıcılar
zh_hans: 数字分隔符
zh_hant: 數字分隔符號

# IDS_FeatureLocalFunctions
source: local functions
cs: místní funkce
de: lokale Funktionen
es: funciones locales
fr: fonctions locales
it: funzioni locali
ja: ローカル関数
ko: 로컬 함수
pl: funkcje lokalne
pt_br: funções locais
ru: локальные функции
tr: yerel işlevler
zh_hans: 本地函数
zh_hant: 區域函式

# ERR_UnescapedCurly
source: A '{0}' character must be escaped (by doubling) in an interpolated string.
cs: Znak {0} musí být v interpolovaném řetězci uvozený (zdvojeným znakem).
de: {0}-Zeichen müssen in interpolierten Zeichenfolgen (durch Verdoppeln) maskiert werden.
es: El carácter '{0}' se debe escapar (duplicándose) en las cadenas interpoladas.
fr: Un caractère '{0}' doit faire l'objet d'une séquence d'échappement (par doublement) dans une chaîne interpolée.
it: In una stringa interpolata è necessario specificare il carattere di escape di un carattere '{0}' raddoppiandolo.
ja: 文字 '{0}' は、補間された文字列内で (二重にすることで) エスケープする必要があります。
ko: {0}' 문자는 보간된 문자열에서 이중으로 사용하여 이스케이프해야 합니다.
pl: W przypadku znaku „{0}” należy zastosować ucieczkę (przez wpisanie dwóch takich znaków) w ciągu interpolowanym.
pt_br: Um caractere '{0}' deve ser de escape (ao duplicar) em uma cadeia de caracteres interpolada.
ru: Символ "{0}" необходимо экранировать (путем дублирования) в интерполированной строке.
tr: Bir '{0}' karakteri, bir aradeğerlendirme dizesinde (yineleme yapılarak) atlatılmalıdır.
zh_hans: 在内插字符串中，必需对“{0}”字符进行转义(通过加倍)。
zh_hant: 在差補字串中，必須將 '{0}' 字元逸出 (重複兩次)。

# ERR_EscapedCurly
source: A '{0}' character may only be escaped by doubling '{0}{0}' in an interpolated string.
cs: V interpolovaném řetězci může být znak {0} uvozený jenom zdvojeným znakem ({0}{0}).
de: Ein "{0}"-Zeichen kann nur durch Verdoppelung "{0}{0}" in einer interpolierten Zeichenfolge maskiert werden.
es: El carácter '{0}' solo se puede escapar duplicando '{0}{0}' en una cadena interpolada.
fr: Un caractère '{0}' ne peut faire l'objet d'une séquence d'échappement qu'en doublant '{0}{0}' dans une chaîne interpolée.
it: In una stringa interpolata è possibile specificare il carattere di escape di un carattere '{0}' raddoppiando '{0}{0}'.
ja: 文字 '{0}' は、補間された文字列内で '{0}{0}' を二重にすることでのみエスケープできます。
ko: {0}' 문자는 보간된 문자열에서 '{0}{0}'처럼 이중으로 사용하는 방법으로만 이스케이프할 수 있습니다.
pl: W przypadku znaku „{0}” ucieczkę można zastosować tylko przez wpisanie dwóch znaków „{0}{0}” w ciągu interpolowanym.
pt_br: Um caractere '{0}' somente deve ser de escape ao duplicar '{0}{0}' em uma cadeia de caracteres interpolada.
ru: Символ "{0}" можно экранировать только двойными символами "{0}{0}" в интерполированной строке.
tr: Bir '{0}' karakteri, yalnızca bir aradeğerlendirme dizesinde '{0}{0}' karakterinin yinelenmesiyle atlatılabilir.
zh_hans: 在内插字符串中，仅可通过加倍“{0}{0}”对“{0}”字符进行转义。
zh_hant: 在差補字串中，只能以重複兩次 ('{0}{0}') 的方式，將 '{0}' 字元逸出。

# ERR_TrailingWhitespaceInFormatSpecifier
source: A format specifier may not contain trailing whitespace.
cs: Specifikátor formátu nesmí na konci obsahovat mezeru.
de: Formatbezeichner dürfen keine nachgestellten Leerzeichen enthalten.
es: Los especificadores de formato no pueden contener espacios en blanco al final.
fr: Un spécificateur de format ne doit contenir aucun espace blanc de fin.
it: Un identificatore di formato non può contenere uno spazio vuoto finale.
ja: 書式指定子に末尾の空白を含めることはできません。
ko: 형식 지정자는 후행 공백을 포함할 수 없습니다.
pl: Specyfikator formatu nie może kończyć się białym znakiem.
pt_br: Um especificador de formato não pode conter espaço em branco à direita.
ru: Спецификатор формата не должен оканчиваться пробелом.
tr: Biçim belirticisinin sonunda boşluk olamaz.
zh_hans: 格式说明符不能包含尾随空格。
zh_hant: 格式規範的尾端不可以是空白字元。

# ERR_EmptyFormatSpecifier
source: Empty format specifier.
cs: Prázdný specifikátor formátu
de: Leerer Formatbezeichner.
es: Especificador de formato vacío.
fr: Spécificateur de format vide.
it: Identificatore di formato vuoto.
ja: 書式指定子が空です。
ko: 형식 지정자가 비어 있습니다.
pl: Pusty specyfikator formatu.
pt_br: Especificador de formato vazio.
ru: Пустой спецификатор формата.
tr: Boş biçim belirticisi.
zh_hans: 空格式说明符。
zh_hant: 空白的格式規範。

# ERR_ErrorInReferencedAssembly
source: There is an error in a referenced assembly '{0}'.
cs: V odkazovaném sestavení {0} je chyba.
de: In einer referenzierten Assembly '{0}' liegt ein Fehler vor.
es: Hay un error en un ensamblado al que se hace referencia: '{0}'.
fr: Il existe une erreur dans un assembly référencé '{0}'.
it: Un assembly di riferimento '{0}' contiene un errore.
ja: 参照アセンブリ '{0}' にエラーがあります。
ko: 참조되는 어셈블리 '{0}'에 오류가 있습니다.
pl: Wystąpił błąd w przywoływanym zestawie „{0}”.
pt_br: Há um erro em um assembly referenciado '{0}'.
ru: Ошибка в связанной сборке "{0}".
tr: Başvurulan derleme '{0}' içinde bir hata var.
zh_hans: 引用的程序集“{0}”中有错误。
zh_hant: 參考組件 '{0}' 中有錯誤。

# ERR_ExpressionOrDeclarationExpected
source: Expression or declaration statement expected.
cs: Očekával se příkaz s výrazem nebo deklarací.
de: Ausdruck oder Deklarationsanweisung erwartet.
es: Se esperaba una instrucción de expresión o de declaración.
fr: Expression ou instruction de déclaration attendue.
it: È prevista l'istruzione di dichiarazione o l'espressione.
ja: 式または宣言文が必要です。
ko: 식 또는 선언문이 필요합니다.
pl: Oczekiwano wyrażenia lub instrukcji deklaracji.
pt_br: Expressão ou declaração de instrução esperada.
ru: Ожидался оператор выражения или оператор объявления.
tr: İfade veya bildirim deyimi bekleniyor.
zh_hans: 应是表达式或声明语句。
zh_hant: 必須是運算式或宣告陳述式。

# ERR_NameofExtensionMethod
source: Extension method groups are not allowed as an argument to 'nameof'.
cs: Skupiny metod rozšíření nejsou povolené jako argument pro nameof.
de: Erweiterungsmethodengruppen sind als Argument für 'nameof' nicht zulässig.
es: Los grupos de métodos de extensión como argumento de 'nameof' no están permitidos.
fr: Les groupes de méthode d'extension ne sont pas autorisés en tant qu'arguments pour 'nameof'.
it: Come argomento di 'nameof' non sono consentiti gruppi di metodi di estensione.
ja: 拡張メソッドのグループは、'nameof' の引数として許可されていません。
ko: 확장 메서드 그룹은 'nameof'에 대한 인수로 사용할 수 없습니다.
pl: Grupy metod rozszerzeń nie są dozwolone jako argument elementu „nameof”.
pt_br: Grupos de métodos de extensão não são permitidos como um argumento para 'nameof'.
ru: Группы метода выражения недопустимо использовать в качестве аргумента для nameof.
tr: Genişletme yöntemi gruplarına 'nameof' bağımsız değişkeni olarak izin verilmedi.
zh_hans: 扩展方法组不允许作为 "nameof" 的参数。
zh_hant: 擴充方法群組不允許做為 'nameof' 的引數。

# WRN_AlignmentMagnitude
source: Alignment value {0} has a magnitude greater than {1} and may result in a large formatted string.
cs: Hodnota zarovnání {0} má velikost větší než {1} a jejím výsledkem může být velký formátovaný řetězec.
de: Ausrichtungswert {0} hat einen Wert größer {1} und kann eine große formatierte Zeichenfolge zur Folge haben.
es: El valor de alineación {0} tiene una magnitud superior a {1} y puede dar lugar a una cadena con formato grande.
fr: La valeur d'alignement {0} a une magnitude supérieure à {1} et peut générer une chaîne formatée volumineuse.
it: La grandezza del valore di allineamento {0} è maggiore di {1} e può comportare la creazione di una stringa formattata di grandi dimensioni.
ja: 配置の値 {0} は大きさが {1} を上回り、大型のフォーマットの文字列になる可能性があります。
ko: 맞춤 값 {0}은(는) {1}보다 커서 큰 형식 문자열로 표시될 수 있습니다.
pl: Wartość wyrównania {0} jest większa niż {1} i może powodować powstanie ciągu w dużym formacie.
pt_br: O valor do alinhamento {0} possui uma magnitude maior que {1}, podendo resultar em uma grande cadeia de caracteres formatada.
ru: Величина значения выравнивания {0} больше, чем {1}; это может привести к возникновению большой форматированной строки.
tr: Hizalama değeri {0}, {1} öğesinden büyük bir boyuta sahiptir ve büyük bir biçimlendirilmiş dize ile sonuçlanabilir.
zh_hans: 对齐值 {0} 具有大于 {1} 的度量值，可能产生较大的格式化字符串。
zh_hant: 對齊值 {0} 的範圍大於 {1}，而且可能會導致大型格式化字串。

# HDN_UnusedExternAlias_Title
source: Unused extern alias
cs: Nepoužívaný externí alias
de: Nicht verwendeter externer Alias
es: Alias externo sin usar
fr: Alias extern non utilisé
it: Alias extern non usato
ja: extern エイリアスは未使用です
ko: 사용하지 않는 extern 별칭
pl: Nieużywany alias zewnętrzny
pt_br: Alias externo não usado
ru: Неиспользованный внешний псевдоним
tr: Kullanılmayan extern diğer adı
zh_hans: 未使用的外部别名
zh_hant: 未使用的外部別名

# HDN_UnusedUsingDirective_Title
source: Unnecessary using directive
cs: Nepotřebná direktiva using
de: Nicht erforderliche using-Direktive
es: Directiva Using innecesaria
fr: Directive using non nécessaire
it: Direttiva using non necessaria
ja: using ディレクティブは不要です
ko: 불필요한 using 지시문
pl: Niepotrzebna dyrektywa using
pt_br: Diretiva de uso desnecessária
ru: Ненужная директива using
tr: Gereksiz using yönergesi
zh_hans: 不需要的 using 指令
zh_hant: 不必要的 using 指示詞

# INF_UnableToLoadSomeTypesInAnalyzer_Title
source: Skip loading types in analyzer assembly that fail due to a ReflectionTypeLoadException
cs: Přeskočí načtení typů v sestavení analyzátoru, které selžou kvůli výjimce ReflectionTypeLoadException.
de: Das Laden von Typen in der Analyseassembly überspringen, bei denen durch eine ReflectionTypeLoadException ein Fehler auftrat.
es: Omitir la carga de los tipos con errores en el ensamblado de analizador debido a ReflectionTypeLoadException
fr: Ignorer le chargement de types dans un assembly d’analyseur qui échouent en raison d’une ReflectionTypeLoadException
it: Ignora il caricamento dei tipi nell'assembly dell'analizzatore che non riescono a causa di un'eccezione ReflectionTypeLoadException
ja: ReflectionTypeLoadException のために失敗したアナライザーのアセンブリ内の型の読み込みをスキップします
ko: ReflectionTypeLoadException으로 인해 실패한 분석기 어셈블리에서 형식 로드를 건너뜀
pl: Pomiń ładowanie typów w zestawie analizatora zakończonych niepowodzeniem z powodu wyjątku ReflectionTypeLoadException
pt_br: Ignorar tipos de carregamento no assembly analisador que falharem devido a uma ReflectionTypeLoadException
ru: Пропуск загрузки типов в сборке анализатора, завершившихся сбоем из-за ReflectionTypeLoadException
tr: Bir ReflectionTypeLoadException nedeniyle başarısız olan çözümleyici derlemesinde türleri yüklemeyi atlayın
zh_hans: 跳过加载分析器程序集中因 ReflectionTypeLoadException 而失败的类型
zh_hant: 跳過載入分析器組件中因 ReflectionTypeLoadException 而失敗的類型

# WRN_AlignmentMagnitude_Title
source: Alignment value has a magnitude that may result in a large formatted string
cs: Hodnota zarovnání má velikost, jejímž výsledkem může být velký formátovaný řetězec.
de: Der Ausrichtungswert weist eine Größe auf, die eine große formatierte Zeichenfolge zur Folge haben kann.
es: El valor de alineación tiene una magnitud que puede dar lugar a una cadena con formato grande
fr: La valeur d'alignement a une magnitude pouvant générer une chaîne formatée volumineuse
it: La grandezza del valore di allineamento è tale da comportare la creazione di una stringa formattata di grandi dimensioni
ja: 配置の値は、大型のフォーマットの文字列になる可能性がある大きさです
ko: 맞춤 값에 큰 형식 문자열로 표시되는 크기가 있음
pl: Wartość wyrównania może powodować powstanie ciągu w dużym formacie
pt_br: O valor do alinhamento tem uma magnitude que pode resultar em uma grande cadeia de caracteres formatada
ru: Величина значения выравнивания может привести к возникновению большой форматированной строки
tr: Hizalama değeri, büyük bir biçimlendirilmiş dize ile sonuçlanabilecek bir boyuta sahip
zh_hans: 对齐值具有可能产生较大的格式化字符串的度量值
zh_hant: 對齊值的範圍可能會導致大型格式化字串
