Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ChainingSpeculativeModelIsNotSupported
source: Chaining speculative semantic model is not supported. You should create a speculative model from the non-speculative ParentModel.
cs: Zřetězení spekulativního sémantického modelu se nepodporuje. Měli byste vytvořit spekulativní model z nespekulativního modelu ParentModel.
de: Die Verkettung eines spekulativen semantischen Modells wird nicht unterstützt. Sie sollten ein spekulatives Modell aus dem nicht spekulativen ParentModel erstellen.
es: No se puede encadenar el modelo semántico especulativo. Tiene que crear un modelo especulativo desde el modelo principal no especulativo.
fr: Le chaînage d'un modèle sémantique spéculatif n'est pas pris en charge. Vous devez créer un modèle spéculatif à partir du ParentModel non spéculatif.
it: Il concatenamento del modello semantico speculativo non è supportato. È necessario creare un modello speculativo dal modello ParentModel non speculativo.
ja: 予測セマンティック モデルのチェーンはサポートしていません。非予測 ParentModel から予測モデルを作成する必要があります。
ko: 이론적 의미 체계 모델 연결은 지원되지 않습니다. 비이론적 ParentModel에서 이론적 모델을 만들어야 합니다.
pl: Tworzenie łańcuchów spekulacyjnego modelu semantycznego nie jest obsługiwane. Należy utworzyć model spekulacyjny z nadrzędnego modelu niespekulacyjnego.
pt_br: Não há suporte ao encadeamento do modelo semântico especulativo. Você deve criar um modelo especulativo com base no ParentModel não especulativo.
ru: Построение цепочки наблюдающей семантической модели не поддерживается. Необходимо создать наблюдающую модель из ненаблюдающей ParentModel.
tr: Kurgusal anlam modelini zincirleme desteklenmiyor. Kurgusal olmayan ParentModel öğesinden kurgusal bir model oluşturmalısınız.
zh_hans: 不支持链接推理语义模型。应从非推理 ParentModel 创建推理模型。
zh_hant: 不支援鏈結理論式語意模型。應從非理論式 ParentModel 建立理論式模型。

# IDS_ToolName
source: Microsoft (R) Visual C# Compiler
cs: Kompilátor Microsoft (R) Visual C#
es: Compilador de Microsoft (R) Visual C#
fr: Compilateur Microsoft (R) Visual C#
it: Compilatore Microsoft (R) Visual C#
ko: Microsoft (R) Visual C# 컴파일러
pl: Kompilator Microsoft (R) Visual C#
pt_br: Compilador do Microsoft (R) Visual C#
ru: Компилятор Microsoft (R) Visual C#
tr: Microsoft (R) Visual C# Derleyicisi
zh_hans: Microsoft(R) Visual C# 编译器
zh_hant: Microsoft (R) Visual C# 編譯器

# IDS_LogoLine1
source: {0} version {1}
cs: {0} verze {1}
es: {0} versión {1}
it: {0} versione {1}
ja: {0} バージョン {1}
ko: {0} 버전 {1}
pl: {0} w wersji {1}
pt_br: {0} versão {1}
ru: {0} версии {1}
tr: {0} sürüm {1}
zh_hans: {0} 版本 {1}
zh_hant: {0} 版 {1}

# IDS_LogoLine2
source: Copyright (C) Microsoft Corporation. All rights reserved.
cs: Copyright (C) Microsoft Corporation. Všechna práva vyhrazena.
de: Copyright (C) Microsoft Corporation. Alle Rechte vorbehalten.
es: Copyright (C) Microsoft Corporation. Todos los derechos reservados.
fr: Copyright (C) Microsoft Corporation. Tous droits réservés.
it: Copyright (C) Microsoft Corporation. Tutti i diritti sono riservati.
pl: Copyright (C) Microsoft Corporation. Wszelkie prawa zastrzeżone.
pt_br: Copyright (C) Microsoft Corporation. Todos os direitos reservados.
ru: © Корпорация Майкрософт (Microsoft Corporation). Все права защищены.
tr: Telif hakkı (C) Microsoft Corporation. Tüm hakları saklıdır.
zh_hans: 版权所有(C) Microsoft Corporation。保留所有权利。
zh_hant: Copyright (C) Microsoft Corporation. 著作權所有，並保留一切權利。

# IDS_LangVersions
source: Supported language versions:
cs: Podporované jazykové verze:
de: Unterstützte Sprachversionen:
es: Versiones de lenguaje admitidas:
fr: Versions de langage prises en charge :
it: Versioni del linguaggio supportate:
ja: サポートされる言語バージョン:
ko: 지원되는 언어 버전:
pl: Obsługiwane wersje językowe:
pt_br: Versões de linguagens com suporte:
ru: Поддерживаемые языковые версии:
tr: Desteklenen dil sürümleri:
zh_hans: 支持的语言版本:
zh_hant: 支援的語言版本:

# ERR_ComImportWithInitializers
source: '{0}': a class with the ComImport attribute cannot specify field initializers.
cs: {0}: Třída s atributem ComImport nemůže určovat inicializátory polí.
de: "{0}": Eine Klasse mit dem ComImport-Attribut kann keine Feldinitialisierer angeben.
es: "{0}": una clase con el atributo ComImport no puede especificar inicializadores de campo.
fr: '{0}' : une classe avec l'attribut ComImport ne peut pas spécifier d'initialiseurs de champ.
it: '{0}': una classe con l'attributo ComImport non può specificare inizializzatori di campo.
ja: '{0}': ComImport 属性を含むクラスにフィールド初期化子を指定することはできません。
ko: '{0}': ComImport 특성이 있는 클래스는 필드 이니셜라이저를 지정할 수 없습니다.
pl: „{0}”: klasa o atrybucie ComImport nie może określać inicjatorów pola.
pt_br: "{0}": uma classe com o atributo ComImport não pode especificar inicializadores de campo.
ru: "{0}": класс с атрибутом ComImport не может указывать инициализаторы полей.
tr: '{0}': ComImport özniteliğine sahip sınıf alan başlatıcıları belirtemez.
zh_hans: “{0}”: 具有 ComImport 特性的类不能指定字段初始值设定项。
zh_hant: '{0}': 具有 ComImport 屬性的類別不可指定欄位初始設定式。

# WRN_PdbLocalNameTooLong
source: Local name '{0}' is too long for PDB. Consider shortening or compiling without /debug.
cs: Místní název {0} je moc dlouhý pro PDB. Zvažte jeho zkrácení nebo kompilaci bez /debug.
de: Der lokale Name "{0}" ist für PDB zu lang. Kürzen Sie ihn, oder führen Sie die Kompilierung ohne /debug durch.
es: El nombre local '{0}' es demasiado largo para PDB. Puede acortar o compilar sin /debug.
fr: Le nom local '{0}' est trop long pour PDB. Raccourcissez-le ou compilez sans /debug.
it: Il nome locale '{0}' è troppo lungo per for PDB. Provare ad abbreviarlo oppure a compilare senza /debug.
ja: ローカル名 '{0}' は PDB に対して長すぎます。短縮するか、/debug なしでコンパイルすることを検討してください。
ko: PDB에 대한 '{0}' 로컬 이름이 너무 깁니다. 줄이거나 /debug 없이 컴파일하세요.
pl: Lokalna nazwa „{0}” jest za długa dla pliku PDB. Rozważ skrócenie jej lub skompilowanie bez opcji /debug.
pt_br: Nome local "{0}" é muito longo para PDB. Considere reduzir ou compilar sem /debug.
ru: Слишком длинное локальное имя "{0}" для PDB. Попробуйте сократить или компилировать без /debug.
tr: {0}' yerel adı PDB için çok uzun. Kısaltmayı veya /debug olmadan derlemeyi deneyin.
zh_hans: 本地名称“{0}”对于 PDB 太长。请考虑缩短或在不使用 /debug 的情况下编译。
zh_hant: 區域變數名稱 '{0}' 對 PDB 而言太長。請考慮將其縮短，或在編譯時不要使用 /debug。

# WRN_PdbLocalNameTooLong_Title
source: Local name is too long for PDB
cs: Lokální název je moc dlouhý pro PDB.
de: Lokaler Name ist zu lang für PDB
es: El nombre local es demasiado largo para PDB
fr: Le nom local est trop long pour PDB
it: Il nome locale è troppo lungo per PDB
ja: PDB のローカル名が長すぎます
ko: 로컬 이름이 너무 길어서 PDB에 사용할 수 없습니다.
pl: Nazwa lokalna jest za długa dla pliku PDB
pt_br: O nome do local é muito longo para o PDB
ru: Локальное имя слишком длинное для PDB-файла
tr: Yerel ad PDB için çok uzun
zh_hans: 本地名称对于 PDB 太长
zh_hant: PDB 的本機名稱太長

# ERR_RetNoObjectRequiredLambda
source: Anonymous function converted to a void returning delegate cannot return a value
cs: Anonymní funkce převedená na void, která vrací delegáta, nemůže vracet hodnotu.
de: Eine anonyme Funktion, die in einen "void" zurückgebenden Delegaten konvertiert wurde, kann keinen Wert zurückgeben.
es: Una función anónima convertida en un delegado que devuelve void no puede devolver un valor
fr: Une fonction anonyme convertie en délégué retournant void ne peut pas retourner une valeur
it: La funzione anonima convertita in un delegato che restituisce un valore nullo non può restituire un valore
ja: void に変換されデリゲートを返す匿名関数は、値を返すことができません
ko: void 반환 대리자로 변환된 익명 함수는 값을 반환할 수 없습니다.
pl: Funkcja anonimowa przekonwertowana na delegata zwracającego typ void nie może zwracać wartości
pt_br: Função anônima convertida para um representante de retorno void não pode retornar um valor
ru: Анонимная функция, преобразованная в делегата, возвращающего void, не может возвращать значение.
tr: Void döndüren bir temsilciye dönüştürülmüş anonim işlev bir değer dönüştüremez
zh_hans: 转换为 void 返回委托的匿名函数不能返回值
zh_hant: 轉換成 void 傳回委派的匿名函式，不可傳回值

# ERR_TaskRetNoObjectRequiredLambda
source: Async lambda expression converted to a '{0}' returning delegate cannot return a value
cs: Asynchronní výraz lambda převedený na návratový delegát {0}nemůže vrátit hodnotu.
fr: Une expression lambda convertie en délégué retournant « {0} » ne peut pas retourner une valeur
it: L'espressione lambda asincrona convertita in un delegato che restituisce '{0}' non può restituire un valore
ja: デリゲートを返す '{0}' に変換された非同期ラムダ式は値を返すことができません
pl: Asynchroniczne wyrażenie lambda przekonwertowana na delegata zwracającego „{0}” nie może zwracać wartości
pt_br: A expressão lambda assíncrona convertida em um representante de retorno '{0}' não pode retornar um valor
ru: Асинхронное лямбда-выражение, преобразованное в делегата, возвращающего "{0}", не может возвращать значение
zh_hans: 转换为 "{0}" 的异步 lambda 表达式无法返回值
zh_hant: 轉換成 '{0}' 傳回委派的非同步 Lambda 運算式，不可傳回值

# WRN_AnalyzerCannotBeCreated
source: An instance of analyzer {0} cannot be created from {1} : {2}.
cs: Instance analyzátoru {0} nejde vytvořit z {1} : {2}.
de: Eine Instanz des {0}-Analyzers kann nicht aus {1} erstellt werden: {2}.
es: No se puede crear una instancia de analizador {0} desde {1} : {2}.
fr: Impossible de créer une instance de l'analyseur {0} à partir de {1} : {2}.
it: Non è possibile creare un'istanza dell'analizzatore {0} da {1} : {2}.
ja: アナライザー {0} のインスタンスは {1} ({2}) から作成できません。
ko: {0} 분석기 인스턴스는 {1}에서 만들 수 없습니다({2}).
pl: Wystąpienia analizatora {0} nie można utworzyć z elementu {1}: {2}.
pt_br: Uma instância do analisador de {0} não pode ser criada de {1} : {2}.
ru: Экземпляр анализатора {0} невозможно создать из {1} : {2}"
tr: {0} çözümleyicisinin bir örneği {1} : {2} öğesinden oluşturulamaz.
zh_hans: 无法从 {1} 创建分析器 {0} 的实例: {2}。
zh_hant: 不可從 {1} 建立分析器 {0} 的執行個體: {2}。

# WRN_AnalyzerCannotBeCreated_Title
source: An analyzer instance cannot be created
cs: Nedá se vytvořit instance analyzátoru.
de: Es konnte keine Analyseinstanz erstellt werden
es: No se puede crear una instancia de analizador
fr: Désolé... Nous ne pouvons pas créer d'instance d'analyseur
it: Non è possibile creare un'istanza dell'analizzatore
ja: アナライザーのインスタンスを作成できません
ko: 분석기 인스턴스를 만들 수 없음
pl: Nie można utworzyć wystąpienia analizatora
pt_br: Não é possível criar uma instância do analisador
ru: Невозможно создать экземпляр анализатора
tr: Bir çözümleyici örneği oluşturulamıyor
zh_hans: 无法创建分析器实例
zh_hant: 無法建立分析器執行個體

# WRN_NoAnalyzerInAssembly
source: The assembly {0} does not contain any analyzers.
cs: Sestavení {0} neobsahuje žádné analyzátory.
de: Die Assembly "{0}" enthält keine Analyzer.
es: El ensamblado {0} no contiene ningún analizador.
fr: L'assembly {0} ne contient pas d'analyseurs.
it: L'assembly {0} non contiene analizzatori.
ja: アセンブリ {0} にアナライザーは含まれていません。
ko: {0} 어셈블리에는 분석기가 포함되어 있지 않습니다.
pl: Zestaw {0} nie zawiera żadnych analizatorów.
pt_br: O assembly {0} não contém quaisquer analisadores.
ru: Сборка {0} не содержит анализаторов.
tr: {0} derlemesi hiçbir çözümleyici içermiyor.
zh_hans: 程序集 {0} 不包含任何分析器。
zh_hant: 組件 {0} 不包含任何分析器。

# WRN_NoAnalyzerInAssembly_Title
source: Assembly does not contain any analyzers
cs: Sestavení neobsahuje žádné analyzátory.
de: Assembly enthält keine Analysen
es: El ensamblado no contiene ningún analizador
fr: L'assembly ne contient pas d'analyseur
it: L'assembly non contiene analizzatori
ja: アセンブリに、アナライザーが含まれていません
ko: 어셈블리에는 분석기가 포함되어 있지 않습니다.
pl: Zestaw nie zawiera analizatorów
pt_br: O assembly não contém analisadores
ru: Сборка не содержит анализаторов
tr: Derleme hiçbir çözümleyici içermiyor
zh_hans: 程序集不包含任何分析器
zh_hant: 組件不包含任何分析器

# WRN_UnableToLoadAnalyzer
source: Unable to load Analyzer assembly {0} : {1}
cs: Nejde načíst sestavení analyzátoru {0} : {1}.
de: Fehler beim Laden der Analyzer-Assembly {0}: {1}
es: No se puede cargar el ensamblado del analizador {0}: {1}
fr: Impossible de charger l'assembly Analyseur {0} : {1}
it: Non è possibile caricare l'assembly dell'analizzatore {0}: {1}
ja: アナライザーのアセンブリ {0} ({1}) を読み込むことができません
ko: {0} 분석기 어셈블리를 로드할 수 없습니다({1}).
pl: Nie można załadować zestawu analizatora {0}: {1}
pt_br: Não é possível carregar o assembly do Analisador {0} : {1}
ru: Не удается загрузить сборку Analyzer {0}: {1}
tr: Çözümleyici derlemesi {0} : {1} yüklenemiyor
zh_hans: 无法加载分析器程序集 {0}: {1}
zh_hant: 無法載入分析器組件 {0} : {1}

# WRN_UnableToLoadAnalyzer_Title
source: Unable to load Analyzer assembly
cs: Nejde načíst sestavení analyzátoru.
de: Analyseassembly konnte nicht geladen werden
es: No es posible cargar el ensamblaje del analizador
fr: Impossible de charger l'assembly Analyseur
it: Non è possibile caricare l'assembly dell'analizzatore
ja: アナライザーのアセンブリを読み込むことができません
ko: 분석기 어셈블리를 로드할 수 없습니다.
pl: Nie można załadować zestawu analizatora
pt_br: Não é possível carregar o assembly do analisador
ru: Не удалось загрузить сборку анализатора
tr: Çözümleyici derlemesi yüklenemiyor
zh_hans: 无法加载分析器程序集
zh_hant: 無法載入分析器組件

# INF_UnableToLoadSomeTypesInAnalyzer
source: Skipping some types in analyzer assembly {0} due to a ReflectionTypeLoadException : {1}.
cs: Přeskočí se některé typy v sestavení analyzátoru {0} kvůli výjimce ReflectionTypeLoadException: {1}.
de: Einige Typen werden in der Analyzer-Assembly {0} aufgrund von ReflectionTypeLoadException übersprungen: {1}.
es: Omisión de algunos tipos en el ensamblado de analizador {0} por una ReflectionTypeLoadException: {1}.
fr: Certains types contenus dans l'assembly analyseur {0} ont été ignorés pour cause de ReflectionTypeLoadException : {1}.
it: Alcuni tipi nell'assembly dell'analizzatore {0} verranno ignorati a causa di un'eccezione ReflectionTypeLoadException: {1}.
ja: ReflectionTypeLoadException ({1}) のため、アナライザー アセンブリ {0} の一部の型をスキップしています。
ko: ReflectionTypeLoadException로 인해 {0} 분석기 어셈블리에서 일부 형식을 건너뜁니다({1}).
pl: Niektóre typy zestawu analizatora {0} zostaną pominięte z powodu wyjątku ReflectionTypeLoadException: {1}.
pt_br: Ignorando a alguns tipos de assembly de analisador {0} devido a uma ReflectionTypeLoadException: {1}.
ru: Пропуск некоторых типов в сборке анализатора {0} из-за исключения ReflectionTypeLoadException: {1}.
tr: Bir ReflectionTypeLoadException nedeniyle {0} çözümleyici derleyicisinde bazı türler atlanıyor: {1}.
zh_hans: 正在跳过分析器程序集 {0} 中的某些类型，因为出现 ReflectionTypeLoadException: {1}。
zh_hant: 因為 ReflectionTypeLoadException 之故，所以略過分析器組件 {0} 中的某些類型: {1}。

# ERR_CantReadRulesetFile
source: Error reading ruleset file {0} - {1}
cs: Chyba při čtení souboru sady pravidel {0} - {1}
de: Fehler beim Lesen der RULESET-Datei "{0}": {1}
es: Error al leer el archivo de conjunto de reglas {0}: {1}
fr: Erreur lors de la lecture du fichier ruleset {0} - {1}
it: Si è verificato un errore durante la lettura del file del set di regole {0} - {1}
ja: 規則セット ファイル {0} を読み込み中にエラーが発生しました - {1}
ko: {0} ruleset 파일을 읽는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas odczytywania pliku zestawu reguł {0} — {1}
pt_br: Erro ao ler arquivo de conjunto de regras {0} - {1}
ru: Ошибка при чтении файла с набором правил {0} — {1}
tr: {0} kural kümesi dosyası okunurken hata - {1}
zh_hans: 读取规则集文件 {0} 时出错 - {1}
zh_hant: 讀取規則集檔案 {0} 時發生錯誤 - {1}

# ERR_BadPdbData
source: Error reading debug information for '{0}'
cs: Chyba při čtení informací ladění pro {0}
de: Fehler beim Lesen der Debuginformationen für "{0}"
es: Error al leer información de depuración de '{0}'
fr: Erreur lors de la lecture des informations de débogage pour '{0}'
it: Si è verificato un errore durante la lettura delle informazioni di debug per '{0}'
ja: '{0}' のデバッグ情報の読み取りエラー
ko: {0}'에 대한 디버그 정보 읽기 오류
pl: Błąd podczas odczytywania informacji dotyczących debugowania elementu „{0}”
pt_br: Erro ao ler as informações de depuração para '{0}'
ru: Ошибка чтения отладочной информации для "{0}"
tr: {0}' için hata ayıklama bilgileri okunurken hata oluştu
zh_hans: 读取“{0}”的调试信息时出错
zh_hant: 讀取 '{0}' 的偵錯資訊時發生錯誤

# IDS_OperationCausedStackOverflow
source: Operation caused a stack overflow.
cs: Operace způsobila přetečení zásobníku.
de: Der Vorgang verursachte einen Stapelüberlauf.
es: La operación ha provocado un desbordamiento de pila.
fr: L'opération a provoqué un dépassement de capacité de la pile.
it: L'operazione ha causato un overflow dello stack.
ja: この操作によってスタック オーバーフローが発生しました。
ko: 작업하는 동안 스택 오버플로가 발생했습니다.
pl: Operacja spowodowała przepełnienie stosu.
pt_br: A operação causou um estouro de pilha.
ru: Операция вызвала переполнение стека.
tr: İşlem yığın taşmasına neden oldu.
zh_hans: 操作导致堆栈溢出。
zh_hant: 作業導致了堆疊溢位。

# WRN_IdentifierOrNumericLiteralExpected
source: Expected identifier or numeric literal.
cs: Očekával se identifikátor nebo číselný literál.
de: Es wurde ein Bezeichner oder ein numerisches Literal erwartet.
es: Se esperaba un identificador o un literal numérico.
fr: Identificateur ou littéral numérique attendu.
it: È previsto un identificatore o un valore letterale.
ja: 識別子または数値リテラルが必要です。
ko: 식별자 또는 숫자 리터럴이 필요합니다.
pl: Oczekiwano identyfikatora lub literału liczbowego.
pt_br: Identificador esperado ou literal numérico.
ru: Ожидается идентификатор или численный литерал.
tr: Tanımlayıcı veya sayısal sabit değer bekleniyordu.
zh_hans: 应为标识符或数字参数。
zh_hant: 必須是識別項或數值常值。

# WRN_IdentifierOrNumericLiteralExpected_Title
source: Expected identifier or numeric literal
cs: Očekával se identifikátor nebo číselný literál.
de: Es wurde ein Bezeichner oder ein numerisches Literal erwartet.
es: Identificador o literal numérico esperado
fr: Identificateur ou littéral numérique attendu
it: È previsto un identificatore o un valore letterale
ja: 識別子または数値リテラルが必要です
ko: 식별자 또는 숫자 리터럴이 필요합니다.
pl: Oczekiwano identyfikatora lub literału liczbowego
pt_br: Identificador esperado ou literal numérico
ru: Ожидается идентификатор или численный литерал
tr: Beklenen tanımlayıcı veya sayısal dize
zh_hans: 应为标识符或数字参数
zh_hant: 必須是識別項或數值常值

# ERR_InitializerOnNonAutoProperty
source: Only auto-implemented properties, or properties that use the 'field' keyword, can have initializers.
fr: Seules les propriétés implémentées automatiquement, ou les propriétés qui utilisent le mot-clé 'field', peuvent avoir des initialiseurs.
it: Solo le proprietà implementate automaticamente o le proprietà che usano la parola chiave 'field' possono avere inizializzatori.
pl: Tylko właściwości zaimplementowane automatycznie mogą mieć inicjatory.
pt_br: Somente as propriedades autoimplementadas, ou as propriedades que usam a palavra-chave ''field'', podem ter inicializadores.
ru: Только автоматически реализованные свойства или свойства, использующие ключевое слово "field", могут содержать инициализаторы.
zh_hans: 只有自动实现的属性或使用 ‘field’ 关键字的属性才能具有初始值设定项。

# ERR_AutoPropertyMustHaveGetAccessor
source: Auto-implemented properties must have get accessors.
cs: Automaticky implementované vlastnosti musí mít přistupující objekty get.
de: Automatisch implementierte Eigenschaften müssen get-Accessoren aufweisen.
es: Las propiedades implementadas automáticamente deben tener descriptores de acceso get.
fr: Les propriétés implémentées automatiquement doivent avoir des accesseurs get.
it: Le proprietà implementate automaticamente devono avere funzioni di accesso get.
ja: 自動実装プロパティは get アクセサーを持つ必要があります。
ko: 자동 구현 속성은 접근자를 가져와야 합니다.
pl: Właściwości zaimplementowane automatycznie w interfejsach muszą mieć metody dostępu get.
pt_br: Propriedades autoimplementadas devem ter acessadores get.
ru: Автоматически реализованные свойства должны иметь методы доступа get.
tr: Otomatik uygulanan özelliklerin get erişeni olmalıdır.
zh_hans: 自动实现的属性必须具有 get 访问器。
zh_hant: 自動實作的屬性必須要有 get 存取子。

# ERR_AutoPropertyMustOverrideSet
source: Auto-implemented properties must override all accessors of the overridden property.
cs: Automaticky implementované vlastnosti musí přepsat všechny přistupující objekty přepsané vlastnosti.
de: Automatisch implementierte Eigenschaften müssen alle Accessoren der überschriebenen Eigenschaft überschreiben.
es: Las propiedades implementadas automáticamente deben invalidar todos los descriptores de acceso de la propiedad invalidada.
fr: Les propriétés implémentées automatiquement doivent substituer tous les accesseurs de la propriété substituée.
it: Le proprietà implementate automaticamente devono sostituire tutte le funzioni di accesso della proprietà sostituita.
ja: 自動実装プロパティは、オーバーライドされたプロパティのすべてのアクセサーをオーバーライドする必要があります。
ko: 자동 구현 속성은 재정의된 속성의 모든 접근자를 재정의해야 합니다.
pl: Automatycznie implementowane właściwości muszą przesłaniać wszystkie metody dostępu przesłanianej właściwości.
pt_br: Propriedades autoimplementadas devem substituir todos os acessadores de propriedade substituída.
ru: Автоматически реализуемые свойства должны переопределять все методы доступа переопределенного свойства.
tr: Otomatik uygulanan özellikler geçersiz kılınan özelliğin tüm erişicilerini geçersiz kılmalıdır.
zh_hans: 自动实现的属性必须覆盖被覆盖属性的所有访问器。
zh_hant: 自動實作的屬性必須覆寫已覆寫屬性的所有存取子。

# ERR_EncodinglessSyntaxTree
source: Cannot emit debug information for a source text without encoding.
cs: Nejde vygenerovat ladicí informace pro zdrojový text bez kódování.
de: Debuginformationen für einen Quelltext können nur codiert ausgegeben werden.
es: No se puede emitir información de depuración para un texto de origen sin descodificar.
fr: Impossible d'émettre des informations de débogage pour un texte source sans encodage.
it: Non è possibile creare le informazioni di debug per un testo di origine senza codifica.
ja: エンコーディングせずにソース テキストのデバッグ情報を作成することはできません。
ko: 인코딩하지 않고 원본 텍스트에 대한 디버그 정보를 생성할 수 없습니다.
pl: Nie można wyemitować informacji debugowania dla tekstu źródłowego bez kodowania.
pt_br: Não é possível emitir informações de depuração para um texto de origem sem codificação.
ru: Не удается выдать отладочную информацию для исходного текста без кодировки.
tr: Kodlama olmadan bir kaynak metin için hata ayıklama bilgileri yayılamıyor.
zh_hans: 无法在不进行编码的情况下发出源文本的调试信息。
zh_hant: 無法在不編碼的情況下，對原始程式文字發出偵錯資訊。

# ERR_BlockBodyAndExpressionBody
source: Block bodies and expression bodies cannot both be provided.
cs: Nejde zadat těla bloků i těla výrazů.
de: Blocktexte und Ausdruckstexte können nicht bereitgestellt werden.
es: No se pueden proporcionar tanto los cuerpos de bloque como los cuerpos de expresión.
fr: Vous ne pouvez pas spécifier à la fois des corps de bloc et des corps d'expression.
it: Non è possibile specificare sia corpi di blocchi che corpi di espressioni.
ja: ブロック本体と式本体を両方とも指定することはできません。
ko: 블록 본문과 식 본문을 둘 다 제공할 수는 없습니다.
pl: Treści bloku i treści wyrażenia nie mogą być jednocześnie udostępnione.
pt_br: Corpos de bloco e de expressão não podem ser ambos fornecidos.
ru: Нельзя указывать тела блоков одновременно с телами выражений.
tr: Blok gövdeleri ve ifade gövdeleri birlikte sağlanamaz.
zh_hans: 不能同时提供程序块主体与表达式主体。
zh_hant: 不可同時提供區塊主體與運算式主體。

# ERR_SwitchFallOut
source: Control cannot fall out of switch from final case label ('{0}')
cs: Řízení nemůže opustit příkaz switch z posledního příkazu case ('{0}')
de: Die Steuerung kann nicht von der abschließenden case-Bezeichnung ("{0}") aus dem switch-Ausdruck übergeben werden.
es: El control no puede quedar fuera del modificador de la etiqueta de caso final ('{0}')
fr: Le contrôle ne peut pas sortir du commutateur à partir de l'étiquette case finale ('{0}')
it: Control non può uscire dall'opzione dall'etichetta case finale ('{0}')
ja: コントロールは switch の最後の case ラベル ('{0}') から出ることができません
ko: 최종 case 레이블('{0}')의 스위치에서 제어를 이동할 수 없습니다.
pl: Kontrolka nie może wykraczać poza przełącznik z końcowej etykiety case („{0}”)
pt_br: O controle não pode ficar fora do switch do rótulo de caso final ('{0}')
ru: Управление не может выйти за пределы переключателя с окончательной меткой case ("{0}")
tr: Denetim, son durum etiketi geçişi dışında kalamaz ('{0}')
zh_hans: 控件无法从最终用例标签(“{0}”)脱离开关
zh_hant: 控制項的位置不可位於最後一個 case 標籤 ('{0}') 的參數之外
