Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_InvalidNumber_Title
source: Invalid number
cs: Neplatné číslo
de: Ungültige Zahl.
es: Número no válido
fr: Nombre non valide
it: Numero non valido
ja: 無効な数字です
ko: 잘못된 숫자입니다.
pl: Nieprawidłowy numer
pt_br: Número inválido
ru: Недопустимое число
tr: Geçersiz sayı
zh_hans: 无效数字
zh_hant: 數字無效

# WRN_IllegalPPChecksum
source: Invalid #pragma checksum syntax; should be #pragma checksum "filename" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
cs: Syntaxe #pragma checksum není platná. Správná syntaxe: #pragma checksum "název_souboru" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
de: Ungültige #pragma checksum-Syntax; muss lauten: #pragma checksum "Dateiname" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
es: Sintaxis de #pragma checksum no válida; debe ser #pragma checksum "nombre de archivo" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
fr: Syntaxe de #pragma checksum non valide ; doit être #pragma checksum "nom_fichier" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
it: Sintassi #pragma checksum non valida: dovrebbe essere #pragma checksum "nomefile" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
ja: 無効な #pragma checksum 構文です。有効な #pragma checksum は、"filename" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..." です
ko: #pragma checksum 구문이 잘못되었습니다. #pragma checksum "filename" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."이어야 합니다.
pl: Nieprawidłowa składnia sumy kontrolnej #pragma checksum; powinna być następująca: #pragma checksum "nazwa_pliku" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
pt_br: Sintaxe de #pragma checksum inválida; deve ser #pragma checksum "nome_de_arquivo" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
ru: Неверный синтаксис #pragma checksum; должно быть #pragma checksum "имя файла" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
tr: Geçersiz #pragma checksum sözdizimi; #pragma checksum "dosya_adı" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..." olmalı
zh_hans: 无效的 #pragma checksum 语法；应为 #pragma checksum "filename" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."
zh_hant: #pragma checksum 語法無效; 應該是 #pragma checksum "filename" "{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}" "XXXX..."

# WRN_IllegalPPChecksum_Title
source: Invalid #pragma checksum syntax
cs: Neplatná syntaxe kontrolního součtu #pragma
de: Ungültige #pragma-Prüfsummensyntax
es: Sintaxis de suma de comprobación de #pragma no válida
fr: Syntaxe de checksum #pragma incorrecte
it: La sintassi del checksum della direttiva #pragma non è valida
ja: 無効な #pragma チェックサム構文です
ko: #pragma checksum 구문이 잘못되었습니다.
pl: Nieprawidłowa składnia sumy kontrolnej #pragma
pt_br: Sintaxe de soma de verificação #pragma inválida
ru: Недопустимый синтаксис контрольной суммы #pragma
tr: Geçersiz #pragma sağlama toplamı sözdizimi
zh_hans: #pragma checksum 语法无效
zh_hant: #pragma 總和檢查碼語法無效

# WRN_EndOfPPLineExpected
source: Single-line comment or end-of-line expected
cs: Očekával se jednořádkový komentář nebo konec řádku.
de: Einzeiliger Kommentar oder Zeilenende erwartet.
es: Se esperaba un comentario de una línea o un fin de línea
fr: Commentaire sur une seule ligne ou fin de ligne attendue
it: È previsto un commento su una sola riga o la fine riga
ja: 単一行コメントか行末が必要です
ko: 한 줄로 된 주석이나 줄의 끝이 필요합니다.
pl: Oczekiwano jednowierszowego komentarza lub znacznika końca wiersza.
pt_br: Comentário de linha única ou fim da linha esperado
ru: Требуется однострочный комментарий или признак конца строки.
tr: Tek satırlık açıklama veya satır sonu bekleniyor
zh_hans: 应输入单行注释或行尾
zh_hant: 必須是單行註解或行結尾

# WRN_EndOfPPLineExpected_Title
source: Single-line comment or end-of-line expected after #pragma directive
cs: Po direktivě #pragma se očekával jednořádkový komentář nebo konec řádku.
de: Einzeiliger Kommentar oder Zeilenende erwartet nach #pragma-Direktive
es: Se esperaba un comentario de una línea o un fin de línea después de la directiva #pragma
fr: Commentaire sur une seule ligne ou fin de ligne attendue après la directive #pragma
it: Dopo la direttiva #pragma è previsto un commento su una sola riga o la fine riga
ja: #pragma ディレクティブの後に、単一行コメントか行末が必要です
ko: #pragma 지시문 뒤에는 한 줄로 된 주석 또는 줄의 끝이 필요합니다.
pl: Oczekiwano jednowierszowego komentarza lub znacznika końca wiersza po dyrektywie #pragma
pt_br: Comentário de linha única ou fim da linha esperado após a diretiva #pragma
ru: После директивы #pragma ожидается комментарий длиной в одну строку или комментарий в конце строки
tr: #pragma yönergesinden sonra tek satırlı açıklama veya satır sonu beklenir
zh_hans: #pragma 指令之后应是单行注释或行尾
zh_hant: #pragma 指示詞後面必須有單行註解或行結尾

# WRN_ConflictingChecksum
source: Different checksum values given for '{0}'
cs: Pro {0} jsou zadané různé hodnoty kontrolního součtu.
de: Für "{0}" wurden verschiedene Prüfsummenwerte angegeben.
es: Se han proporcionado distintos valores de suma de comprobación para '{0}'
fr: Valeurs de checksum différentes spécifiées pour '{0}'
it: Sono stati specificati valori di checksum diversi per '{0}'
ja: '{0}' に異なるチェックサム値が指定されています
ko: {0}'에 대해 서로 다른 체크섬 값이 지정되었습니다.
pl: Podano różne sumy kontrolne dla elementu „{0}”
pt_br: Valores diferentes de checksum fornecidos para "{0}"
ru: Для "{0}" даны разные контрольные суммы.
tr: {0}' için verilen farklı sağlama toplamı değerleri
zh_hans: 为“{0}”提供了不同的校验和值
zh_hant: 為 '{0}' 指定了不同的總和檢查碼值

# WRN_ConflictingChecksum_Title
source: Different #pragma checksum values given
cs: Jsou zadané různé hodnoty kontrolního součtu direktivy #pragma.
de: Unterschiedliche #pragma-Prüfsummenwerte angegeben
es: Se han proporcionado diferentes valores de suma de comprobación de #pragma
fr: Valeurs de checksum différentes spécifiées pour #pragma
it: Sono stati assegnati valori di checksum diversi alla direttiva #pragma
ja: 異なる #pragma チェックサム値が指定されています
ko: 서로 다른 #pragma 체크섬 값이 지정되었습니다.
pl: Podano różne wartości sumy kontrolnej #pragma
pt_br: Valores de soma de verificação #pragma diferentes foram fornecidos
ru: Заданы разные значения контрольной суммы #pragma
tr: Farklı #pragma sağlama toplamı değerleri verildi
zh_hans: 提供了不同的 #pragma 校验和值
zh_hant: 指定不同的 #pragma 總和檢查碼值

# WRN_InvalidAssemblyName
source: Assembly reference '{0}' is invalid and cannot be resolved
cs: Odkaz na sestavení {0} je neplatný a nedá se vyhodnotit.
de: Der Assemblyverweis "{0}" ist ungültig und kann nicht aufgelöst werden.
es: La referencia de ensamblado '{0}' no es válida y no se puede resolver
fr: La référence d'assembly '{0}' n'est pas valide et ne peut pas être résolue
it: Il riferimento all'assembly '{0}' non è valido e non può essere risolto
ja: アセンブリ参照 '{0}' は無効であり、解決できません
ko: {0}' 어셈블리 참조가 잘못되어 확인할 수 없습니다.
pl: Odwołanie do zestawu „{0}” jest nieprawidłowe i nie można go rozpoznać
pt_br: Referência do assembly "{0}" é inválida e não pode ser resolvida
ru: Ссылка сборки "{0}" является недопустимой и не может быть разрешена.
tr: {0}' derleme başvurusu geçersiz ve çözümlenemez
zh_hans: 程序集引用“{0}”无效，无法解析
zh_hant: 組件參考 '{0}' 無效，無法解析

# WRN_InvalidAssemblyName_Title
source: Assembly reference is invalid and cannot be resolved
cs: Odkaz na sestavení je neplatný a nedá se vyhodnotit.
de: Der Assemblyverweis ist ungültig und kann nicht aufgelöst werden.
es: La referencia de ensamblado no es válida y no se puede resolver
fr: La référence d'assembly n'est pas valide et ne peut pas être résolue
it: Il riferimento all'assembly non è valido e non può essere risolto
ja: アセンブリ参照が無効で、解決できません
ko: 어셈블리 참조가 잘못되어 확인할 수 없습니다.
pl: Odwołanie do zestawu jest nieprawidłowe i nie można go rozpoznać
pt_br: A referência de assembly é inválida e não pode ser resolvida
ru: Ссылка на сборку недопустима и не может быть разрешена
tr: Derleme başvurusu geçersiz ve çözümlenemiyor
zh_hans: 程序集引用无效，无法解析
zh_hant: 組件參考無效，無法進行解析

# WRN_InvalidAssemblyName_Description
source: This warning indicates that an attribute, such as InternalsVisibleToAttribute, was not specified correctly.
cs: Toto varování indikuje, že některý atribut, třeba InternalsVisibleToAttribute, nebyl zadaný správně.
de: Diese Warnung gibt an, dass ein Attribut, wie z. B. InternalsVisibleToAttribute, nicht richtig angegeben wurde.
es: Esta advertencia indica que un atributo, como InternalsVisibleToAttribute, no se especificó correctamente.
fr: Cet avertissement indique qu'un attribut, tel que InternalsVisibleToAttribute, n'a pas été spécifié correctement.
it: Questo avviso indica che un attributo, ad esempio InternalsVisibleToAttribute, non è stato specificato correttamente.
ja: この警告は、InternalsVisibleToAttribute などの属性が正しく指定されていないことを示します。
ko: 이 경고는 특성(예: InternalsVisibleToAttribute)이 올바르게 지정되지 않았음을 나타냅니다.
pl: To ostrzeżenie oznacza, że nie określono poprawnie atrybutu, takiego jak InternalsVisibleToAttribute.
pt_br: Este aviso indica que um atributo, como InternalsVisibleToAttribute, não foi especificado corretamente.
ru: Это предупреждение указывает, что атрибут, например InternalsVisibleToAttribute, был указан неправильно.
tr: Bu uyarı, InternalsVisibleToAttribute gibi bir özniteliğin doğru belirtilmediğini gösterir.
zh_hans: 此警告指示特性(如 InternalsVisibleToAttribute)未正确指定。
zh_hant: 此警告指出未正確地指定屬性 (例如 InternalsVisibleToAttribute)。

# WRN_UnifyReferenceMajMin
source: Assuming assembly reference '{0}' used by '{1}' matches identity '{2}' of '{3}', you may need to supply runtime policy
cs: Předpokládá se, že odkaz na sestavení {0}, který používá {1}, odpovídá identitě {2} pro {3}. Možná budete muset zadat zásady pro běh.
de: Es wird angenommen, dass der von "{1}" verwendete Assemblyverweis "{0}" mit "{2}" von "{3}" übereinstimmt. Möglicherweise müssen Sie eine Laufzeitrichtlinie bereitstellen.
es: Suponiendo que la referencia del ensamblado '{0}' usada por '{1}' coincide con la identidad '{2}' de '{3}', puede que necesite proporcionar la directiva en tiempo de ejecución
fr: En supposant que la référence d'assembly '{0}' utilisée par '{1}' correspond à l'identité '{2}' de '{3}', il se peut que vous deviez fournir une stratégie runtime
it: Se il riferimento all'assembly '{0}' usato da '{1}' corrisponde all'identità '{2}' di '{3}', potrebbe essere necessario fornire i criteri di runtime
ja: '{1}' によって使用されるアセンブリ参照 '{0}' が '{3}' の ID '{2}' と一致すると仮定して、実行時ポリシーを指定する必要がある可能性があります
ko: {1}'이(가) 사용하는 '{0}' 어셈블리 참조가 '{3}'의 '{2}'과(와) 일치하는 것으로 간주합니다. 런타임 정책을 지정해야 합니다.
pl: Przyjęto, że odwołanie do zestawu „{0}” używane przez element „{1}” jest zgodne z tożsamością „{2}” elementu „{3}” — może być konieczne określenie zasad wykonywania
pt_br: Presumindo que a referência de assembly "{0}" usada por "{1}" corresponde a identidade "{2}" de "{3}", talvez seja necessário fornecer a diretiva de runtime
ru: При предположении, что ссылка на сборку "{0}", используемая "{1}", совпадает с удостоверением "{2}"для "{3}", возможно, потребуется задать политику среды выполнения
tr: {1}' tarafından kullanılan '{0}' derleme başvurusunun '{3}' öğesinin '{2}' kimliğiyle eşleştiği varsayıldığında, çalışma zamanı ilkesi sağlamanız gerekebilir
zh_hans: 假定“{1}”使用的程序集引用“{0}”与“{3}”的标识“{2}”匹配，您可能需要提供运行时策略
zh_hant: 假設 '{1}' 所使用的組件參考 '{0}' 符合 '{3}' 的識別 '{2}'，您可能會需要提供執行階段原則

# WRN_UnifyReferenceMajMin_Title
source: Assuming assembly reference matches identity
cs: Předpokládá se, že odkaz na sestavení odpovídá identitě.
de: Es wird davon ausgegangen, dass der Assemblyverweis mit der Identität übereinstimmt
es: Asumiendo que la referencia al ensamblaje coincide con la identidad
fr: En supposant que la référence d'assembly correspond à l'identité
it: Il riferimento all'assembly verrà considerato come corrispondente all'identità
ja: アセンブリ参照が ID と一致すると仮定します
ko: 어셈블리 참조가 ID와 일치하는 것으로 간주합니다.
pl: Przyjęto, że odwołanie do zestawu jest zgodne z tożsamością
pt_br: Presume-se que a referência do assembly coincide com a identidade
ru: Предполагается, что ссылка на сборку совпадает с удостоверением
tr: Derleme başvurusunun kimlikle eşleştiği varsayılıyor
zh_hans: 假定程序集引用与标识匹配
zh_hant: 假設組件參考符合識別

# WRN_UnifyReferenceMajMin_Description
source: The two assemblies differ in release and/or version number. For unification to occur, you must specify directives in the application's .config file, and you must provide the correct strong name of an assembly.
cs: Tato dvě sestavení se liší číslem vydání nebo verze. Aby mohlo proběhnout sjednocení, musíte zadat direktivy v souboru .config aplikace a musíte poskytnout správný silný název sestavení.
de: Die zwei Assemblys unterscheiden sich in Release- und/oder Versionsnummer. Damit eine Vereinheitlichung vorgenommen wird, müssen Sie in der Konfigurationsdatei der Anwendung Direktiven angeben. Zudem müssen Sie den korrekten starken Namen einer Assembly angeben.
es: Los dos ensamblajes difieren en el número de versión y/o compilación. Para que haya unificación, debe especificar directivas en el archivo .config de la aplicación y debe proveer el nombre seguro correcto de un ensamblaje.
fr: Les numéros de mise en production et/ou de version des deux assemblys diffèrent. Pour procéder à l'unification, veuillez spécifier les directives adéquates dans le fichier .config de l'application et fournir le nom fort correct d'un assembly.
it: I due assembly differiscono per versione e/o numero di versione. Per consentire l'unifocazione, è necessario specificare le direttive nel file config dell'applicazione e specificare il nome sicuro corretto di un assembly.
ja: 2 つのアセンブリはリリースまたはバージョン番号が異なります。統一するには、アプリケーションの .config ファイルにディレクティブを指定するとともに、アセンブリの厳密な名前を正しく付ける必要があります。
ko: 두 어셈블리의 릴리스 및/또는 버전 번호가 다릅니다. 통합하려면 애플리케이션의 .config 파일에서 지시문을 지정하고 어셈블리의 강력한 이름을 올바르게 제공해야 합니다.
pl: Te dwa zestawy różnią się numerem wydania i/lub wersji. Aby można było wykonać ujednolicenie, musisz określić dyrektywy w pliku config aplikacji i podać poprawną silną nazwę zestawu.
pt_br: Dois assemblies diferem no número de versão. Para que a união ocorra, você deve especificar as diretivas no arquivo .config do aplicativo e fornecer o nome forte correto de um assembly.
ru: Две сборки отличаются номером выпуска или версии. Для унификации необходимо указать директивы в CONFIG-файле приложения и предоставить допустимое строгое имя сборки.
tr: İki derlemenin sürümü ve/veya sürüm numarası farklı. Birleşmenin gerçekleşmesi için, uygulamanın .config dosyasındaki yönergeleri belirtmeniz ve derlemenin doğru güçlü adını sağlamanız gerekir.
zh_hans: 两个程序集的版本和/或版本号不同。为进行统一，必须在应用程序的 .config 文件中指定指令，并且必须提供程序集的正确强名称。
zh_hant: 兩個組件的版次和 (或) 版本號碼不同。若要進行統一，您必須在應用程式的 .config 檔案中指定指示詞，而且您必須提供組件的正確強式名稱。

# WRN_UnifyReferenceBldRev
source: Assuming assembly reference '{0}' used by '{1}' matches identity '{2}' of '{3}', you may need to supply runtime policy
cs: Předpokládá se, že odkaz na sestavení {0}, který používá {1}, odpovídá identitě {2} pro {3}. Možná budete muset zadat zásady pro běh.
de: Es wird angenommen, dass der von "{1}" verwendete Assemblyverweis "{0}" mit "{2}" von "{3}" übereinstimmt. Möglicherweise müssen Sie eine Laufzeitrichtlinie bereitstellen.
es: Suponiendo que la referencia del ensamblado '{0}' usada por '{1}' coincide con la identidad '{2}' de '{3}', puede que necesite proporcionar la directiva en tiempo de ejecución
fr: En supposant que la référence d'assembly '{0}' utilisée par '{1}' correspond à l'identité '{2}' de '{3}', il se peut que vous deviez fournir une stratégie runtime
it: Se il riferimento all'assembly '{0}' usato da '{1}' corrisponde all'identità '{2}' di '{3}', potrebbe essere necessario fornire i criteri di runtime
ja: '{1}' によって使用されるアセンブリ参照 '{0}' が '{3}' の ID '{2}' と一致すると仮定して、実行時ポリシーを指定する必要がある可能性があります
ko: {1}'이(가) 사용하는 '{0}' 어셈블리 참조가 '{3}'의 '{2}'과(와) 일치하는 것으로 간주합니다. 런타임 정책을 지정해야 합니다.
pl: Przyjęto, że odwołanie do zestawu „{0}” używane przez element „{1}” jest zgodne z tożsamością „{2}” elementu „{3}” — może być konieczne określenie zasad wykonywania
pt_br: Presumindo que a referência de assembly "{0}" usada por "{1}" corresponde a identidade "{2}" de "{3}", talvez seja necessário fornecer a diretiva de runtime
ru: При предположении, что ссылка на сборку "{0}", используемая "{1}", совпадает с удостоверением "{2}"для "{3}", возможно, потребуется задать политику среды выполнения
tr: {1}' tarafından kullanılan '{0}' derleme başvurusunun '{3}' öğesinin '{2}' kimliğiyle eşleştiği varsayıldığında, çalışma zamanı ilkesi sağlamanız gerekebilir
zh_hans: 假定“{1}”使用的程序集引用“{0}”与“{3}”的标识“{2}”匹配，您可能需要提供运行时策略
zh_hant: 假設 '{1}' 所使用的組件參考 '{0}' 符合 '{3}' 的識別 '{2}'，您可能會需要提供執行階段原則

# WRN_UnifyReferenceBldRev_Title
source: Assuming assembly reference matches identity
cs: Předpokládá se, že odkaz na sestavení odpovídá identitě.
de: Es wird davon ausgegangen, dass der Assemblyverweis mit der Identität übereinstimmt
es: Asumiendo que la referencia al ensamblaje coincide con la identidad
fr: En supposant que la référence d'assembly correspond à l'identité
it: Il riferimento all'assembly verrà considerato come corrispondente all'identità
ja: アセンブリ参照が ID と一致すると仮定します
ko: 어셈블리 참조가 ID와 일치하는 것으로 간주합니다.
pl: Przyjęto, że odwołanie do zestawu jest zgodne z tożsamością
pt_br: Presume-se que a referência do assembly coincide com a identidade
ru: Предполагается, что ссылка на сборку совпадает с удостоверением
tr: Derleme başvurusunun kimlikle eşleştiği varsayılıyor
zh_hans: 假定程序集引用与标识匹配
zh_hant: 假設組件參考符合識別

# WRN_UnifyReferenceBldRev_Description
source: The two assemblies differ in release and/or version number. For unification to occur, you must specify directives in the application's .config file, and you must provide the correct strong name of an assembly.
cs: Tato dvě sestavení se liší číslem vydání nebo verze. Aby mohlo proběhnout sjednocení, musíte zadat direktivy v souboru .config aplikace a musíte poskytnout správný silný název sestavení.
de: Die zwei Assemblys unterscheiden sich in Release- und/oder Versionsnummer. Damit eine Vereinheitlichung vorgenommen wird, müssen Sie in der Konfigurationsdatei der Anwendung Direktiven angeben. Zudem müssen Sie den korrekten starken Namen einer Assembly angeben.
es: Los dos ensamblajes difieren en el número de versión y/o compilación. Para que haya unificación, debe especificar directivas en el archivo .config de la aplicación y debe proveer el nombre seguro correcto de un ensamblaje.
fr: Les numéros de mise en production et/ou de version des deux assemblys diffèrent. Pour procéder à l'unification, veuillez spécifier les directives adéquates dans le fichier .config de l'application et fournir le nom fort correct d'un assembly.
it: I due assembly differiscono per versione e/o numero di versione. Per consentire l'unifocazione, è necessario specificare le direttive nel file config dell'applicazione e specificare il nome sicuro corretto di un assembly.
ja: 2 つのアセンブリはリリースまたはバージョン番号が異なります。統一するには、アプリケーションの .config ファイルにディレクティブを指定するとともに、アセンブリの厳密な名前を正しく付ける必要があります。
ko: 두 어셈블리의 릴리스 및/또는 버전 번호가 다릅니다. 통합하려면 애플리케이션의 .config 파일에서 지시문을 지정하고 어셈블리의 강력한 이름을 올바르게 제공해야 합니다.
pl: Te dwa zestawy różnią się numerem wydania i/lub wersji. Aby można było wykonać ujednolicenie, musisz określić dyrektywy w pliku config aplikacji i podać poprawną silną nazwę zestawu.
pt_br: Dois assemblies diferem no número de versão. Para que a união ocorra, você deve especificar as diretivas no arquivo .config do aplicativo e fornecer o nome forte correto de um assembly.
ru: Две сборки отличаются номером выпуска или версии. Для унификации необходимо указать директивы в CONFIG-файле приложения и предоставить допустимое строгое имя сборки.
tr: İki derlemenin sürümü ve/veya sürüm numarası farklı. Birleşmenin gerçekleşmesi için, uygulamanın .config dosyasındaki yönergeleri belirtmeniz ve derlemenin doğru güçlü adını sağlamanız gerekir.
zh_hans: 两个程序集的版本和/或版本号不同。为进行统一，必须在应用程序的 .config 文件中指定指令，并且必须提供程序集的正确强名称。
zh_hant: 兩個組件的版次和 (或) 版本號碼不同。若要進行統一，您必須在應用程式的 .config 檔案中指定指示詞，而且您必須提供組件的正確強式名稱。

# ERR_DuplicateImport
source: Multiple assemblies with equivalent identity have been imported: '{0}' and '{1}'. Remove one of the duplicate references.
cs: Naimportovalo se víc sestavení s ekvivalentní identitou: {0} a {1}. Odeberte jeden z duplicitních odkazů.
de: Mehrere Assemblys mit äquivalenter Identität wurden importiert: "{0}" und "{1}". Entfernen Sie einen der doppelten Verweise.
es: Se han importado varios ensamblados con identidad equivalente: '{0}' y '{1}'. Quite una de las referencias duplicadas.
fr: Plusieurs assemblys ayant une identité équivalente ont été importés : '{0}' et '{1}'. Supprimez une des références en double.
it: Sono stati importati più assembly con identità equivalenti: '{0}' e '{1}'. Rimuovere uno dei riferimenti duplicati.
ja: ID が同一の複数のアセンブリ ('{0}' と '{1}') がインポートされました。重複している参照の一方を削除します。
ko: ID가 동일한 여러 어셈블리를 가져왔습니다('{0}', '{1}'). 중복된 참조 중 하나를 제거하세요.
pl: Zostało zaimportowanych wiele zestawów o równoważnej tożsamości: „{0}” i „{1}”. Usuń jedno ze zduplikowanych odwołań.
pt_br: Vários assemblies com identidade equivalente foram importados: "{0}" e "{1}". Remova uma das referências duplicadas.
ru: Импортировано несколько сборок с одинаковыми удостоверениями: "{0}" и "{1}". Удалите одну из повторяющихся ссылок.
tr: Eşdeğer kimlikli birden çok derleme içeri aktarıldı: '{0}' ve '{1}'. Yinelenen başvurulardan birini kaldırın.
zh_hans: 导入了具有等效标识的多个程序集:“{0}”和“{1}”。请删除重复引用之一。
zh_hant: 已匯入具有相同識別的多個組件: '{0}' 和 '{1}'。請移除其中一個重複的參考。

# ERR_DuplicateImportSimple
source: An assembly with the same simple name '{0}' has already been imported. Try removing one of the references (e.g. '{1}') or sign them to enable side-by-side.
cs: Už se naimportovalo sestavení se stejným jednoduchým názvem {0}. Zkuste odebrat jeden z odkazů (např. {1}) nebo je podepište, aby mohly fungovat vedle sebe.
de: Es wurde bereits eine Assembly mit dem einfachen Namen "{0}" importiert. Entfernen Sie einen der Verweise (z. B. "{1}"), oder signieren Sie die Verweise, damit sie parallel verwendet werden können.
es: Ya se ha importado un ensamblado con el mismo nombre sencillo '{0}'. Intente quitar una de las referencias (por ej., '{1}') o fírmelas para habilitar la función en paralelo.
fr: Un assembly avec le même nom simple '{0}' a déjà été importé. Essayez de supprimer une des références (par exemple, '{1}') ou signez-les pour permettre le côte à côte.
it: Un assembly con lo stesso nome semplice '{0}' è già stato importato. Provare a rimuovere uno dei riferimenti, ad esempio '{1}', oppure firmarli per consentire l'affiancamento.
ja: 同じ簡易名 '{0}' でアセンブリが既にインポートされています。参照の 1 つ (例: '{1}') を削除するか、サイド バイ サイドを有効にするために署名してください。
ko: 단순한 이름 '{0}'이(가) 같은 어셈블리를 이미 가져왔습니다. 참조 중 하나(예: '{1}')를 제거하거나 side-by-side를 사용할 수 있도록 서명하세요.
pl: Zestaw o tej samej prostej nazwie „{0}” został już zaimportowany. Spróbuj usunąć jedno z odwołań (np. „{1}”) lub podpisz je, aby umożliwić działanie obok siebie.
pt_br: Um assembly com o mesmo nome simples "{0}" já foi importado. Tente remover uma das referências (por exemplo: "{1}") ou assine-as para ativar lado a lado.
ru: Сборка с аналогичным простым именем "{0}" уже была импортирована. Попробуйте удалить одну из ссылок (например "{1}") или подпишите их для параллельного использования.
tr: Aynı '{0}' kolay adına sahip derleme zaten alınmış. Başvurulardan birini kaldırmayı (örn. '{1}') veya yan yana etkinleştirmek için imzalamayı deneyin.
zh_hans: 已导入具有相同简单名称“{0}”的程序集。请尝试删除这些引用之一(例如“{1}”)，或对它们进行签名以并行启用。
zh_hant: 匯入了具有相同簡單名稱 '{0}' 的組件。請嘗試移除其中一個參考 (例如 '{1}')，或簽署它們以啟用並存。
