Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_GivenExpressionAlwaysMatchesConstant_Title
source: The given expression always matches the provided constant.
cs: Daný výraz vždy odpovídá zadané konstantě.
de: Der angegebene Ausdruck stimmt immer mit der angegebenen Konstante überein.
es: La expresión dada coincide siempre con la constante proporcionada.
fr: L'expression donnée correspond toujours à la constante fournie.
it: L'espressione specificata corrisponde sempre alla costante fornita.
ja: 指定された式は指定された定数と必ず一致します。
ko: 지정한 식은 항상 제공한 상수와 일치합니다.
pl: Dane wyrażenie jest zawsze zgodne z podaną stałą.
pt_br: A expressão fornecida sempre corresponde à constante fornecida.
ru: Указанное выражение всегда соответствует предоставленной константе.
tr: Belirtilen ifade her zaman sağlanan sabitle eşleşir.
zh_hans: 给定的表达式始终与提供的常量匹配。
zh_hant: 指定的運算式永遠符合提供的常數。

# WRN_GivenExpressionAlwaysMatchesPattern
source: The given expression always matches the provided pattern.
cs: Daný výraz vždy odpovídá zadanému vzoru.
fr: L'expression donnée correspond toujours au modèle fourni.
it: L'espressione specificata corrisponde sempre al criterio specificato.
ja: 指定された式は指定されたパターンと常に一致します。
pl: Dane wyrażenie zawsze jest zgodne z podanym wzorcem.
pt_br: A expressão fornecida sempre corresponde ao padrão fornecido.
ru: Указанное выражение всегда соответствует предоставленному шаблону.
zh_hans: 给定的表达式始终与提供的模式匹配。
zh_hant: 指定的運算式一律不比對提供的樣式。

# WRN_GivenExpressionAlwaysMatchesPattern_Title
source: The given expression always matches the provided pattern.
cs: Daný výraz vždy odpovídá zadanému vzoru.
fr: L'expression donnée correspond toujours au modèle fourni.
it: L'espressione specificata corrisponde sempre al criterio specificato.
ja: 指定された式は指定されたパターンと常に一致します。
pl: Dane wyrażenie zawsze jest zgodne z podanym wzorcem.
pt_br: A expressão fornecida sempre corresponde ao padrão fornecido.
ru: Указанное выражение всегда соответствует предоставленному шаблону.
zh_hans: 给定的表达式始终与提供的模式匹配。
zh_hant: 指定的運算式一律不比對提供的樣式。

# WRN_GivenExpressionNeverMatchesPattern
source: The given expression never matches the provided pattern.
cs: Daný výraz nikdy neodpovídá zadané konstantě.
de: Der angegebene Ausdruck stimmt nie mit dem angegebenen Muster überein.
es: La expresión dada no coincide nunca con el patrón proporcionado.
fr: L'expression donnée ne correspond jamais au modèle fourni.
it: L'espressione specificata non corrisponde mai al criterio fornito.
ja: 指定された式は指定されたパターンと絶対に一致しません。
ko: 지정한 식은 제공한 패턴과 일치하지 않습니다.
pl: Dane wyrażenie nigdy nie jest zgodne z podanym wzorcem.
pt_br: A expressão fornecida nunca corresponde ao padrão fornecido.
ru: Указанное выражение никогда не соответствует предоставленному шаблону.
tr: Belirtilen ifade, sağlanan desenle asla eşleşmez.
zh_hans: 给定的表达式永远不会与提供的模式匹配。
zh_hant: 指定的運算式永遠不符合提供的模式。

# WRN_GivenExpressionNeverMatchesPattern_Title
source: The given expression never matches the provided pattern.
cs: Daný výraz nikdy neodpovídá zadané konstantě.
de: Der angegebene Ausdruck stimmt nie mit dem angegebenen Muster überein.
es: La expresión dada no coincide nunca con el patrón proporcionado.
fr: L'expression donnée ne correspond jamais au modèle fourni.
it: L'espressione specificata non corrisponde mai al criterio fornito.
ja: 指定された式は指定されたパターンと絶対に一致しません。
ko: 지정한 식은 제공한 패턴과 일치하지 않습니다.
pl: Dane wyrażenie nigdy nie jest zgodne z podanym wzorcem.
pt_br: A expressão fornecida nunca corresponde ao padrão fornecido.
ru: Указанное выражение никогда не соответствует предоставленному шаблону.
tr: Belirtilen ifade, sağlanan desenle asla eşleşmez.
zh_hans: 给定的表达式永远不会与提供的模式匹配。
zh_hant: 指定的運算式永遠不符合提供的模式。

# WRN_ImplicitCopyInReadOnlyMember
source: Call to non-readonly member '{0}' from a 'readonly' member results in an implicit copy of '{1}'.
cs: Volání člena {0}, který nemá modifikátor readonly, ze člena s modifikátorem readonly má za následek implicitní kopii {1}.
de: Der Aufruf eines nicht schreibgeschützten Members "{0}" aus einem readonly-Member führt zu einer impliziten Kopie von "{1}".
es: La llamada a un miembro "{0}" que no es de solo lectura desde un miembro "readonly" da como resultado una copia implícita de "{1}".
fr: L'appel au membre '{0}' non readonly à partir d'un membre 'readonly' génère une copie implicite de '{1}'.
it: La chiamata a un membro '{0}' non readonly da un membro 'readonly' comporta una copia esplicita di '{1}'.
ja: 'readonly' メンバーから readonly 以外のメンバー '{0}' を呼び出すと、'{1}' の暗黙のコピーが生成されます。
ko: 'readonly' 멤버에서 readonly 멤버가 아닌 '{0}' 멤버를 호출하면 '{1}'의 암시적 복사본이 생성됩니다.
pl: Wywołanie składowej innej niż tylko do odczytu „{0}” ze składowej zadeklarowanej jako „readonly” może spowodować niejawne utworzenie kopii elementu „{1}”.
pt_br: A chamada para um membro que não é readonly '{0}' de um membro 'readonly' resulta em uma cópia implícita de '{1}'.
ru: Вызов члена "{0}", не являющегося доступным только для чтения, из члена readonly приводит к появлению неявной копии "{1}".
tr: 'readonly' üyesinden saltokunur olmayan '{0}' üyesine yapılan çağrı, '{1}' öğesinin örtük bir kopyası ile sonuçlanır.
zh_hans: 从 "readonly" 成员调用非 readonly 成员 "{0}" 将产生 "{1}" 的隐式副本。
zh_hant: 從 'readonly' 成員呼叫非 readonly 成員 '{0}' 會產生 '{1}' 的隱含複本。

# WRN_ImplicitCopyInReadOnlyMember_Title
source: Call to non-readonly member from a 'readonly' member results in an implicit copy.
cs: Volání člena, který nemá modifikátor readonly, ze člena s modifikátorem readonly má za následek implicitní kopii.
de: Der Aufruf eines nicht schreibgeschützten Members aus einem readonly-Member führt zu einer impliziten Kopie.
es: La llamada a un miembro que no es de solo lectura desde un miembro "readonly" da como resultado una copia implícita.
fr: L'appel au membre non readonly à partir d'un membre 'readonly' génère une copie implicite.
it: La chiamata a un membro non readonly da un membro 'readonly' comporta una copia esplicita.
ja: 'readonly' メンバーから readonly 以外のメンバーを呼び出すと、暗黙のコピーが生成されます。
ko: 'readonly' 멤버에서 readonly 멤버가 아닌 멤버를 호출하면 암시적 복사본이 생성됩니다.
pl: Wywołanie składowej innej niż tylko do odczytu ze składowej zadeklarowanej jako „readonly” może spowodować niejawne utworzenie kopii.
pt_br: A chamada para um membro que não é readonly de um membro 'readonly' resulta em uma cópia implícita.
ru: Вызов члена, не являющегося доступным только для чтения, из члена readonly приводит к появлению неявной копии.
tr: 'readonly' üyesinden saltokunur olmayan üyeye yapılan çağrı, örtülü bir kopya ile sonuçlanır.
zh_hans: 从 "readonly" 成员调用非 readonly 成员将产生一个隐式副本。
zh_hant: 從 'readonly' 成員呼叫非 readonly 成員會產生隱含複本。

# WRN_IsPatternAlways
source: An expression of type '{0}' always matches the provided pattern.
cs: Výraz typu {0} vždy odpovídá poskytnutému vzoru.
fr: Une expression de type '{0}' correspond toujours au modèle fourni.
it: Un'espressione di tipo '{0}' corrisponde sempre al criterio specificato.
ja: 型 '{0}' の式は指定されたパターンと常に一致します。
pl: Wyrażenie typu „{0}” jest zawsze zgodne z podanym wzorcem.
pt_br: Uma expressão do tipo '{0}' sempre corresponde ao padrão fornecido.
ru: Выражение типа "{0}" всегда соответствует предоставленному шаблону.
zh_hans: 类型“{0}”的表达式始终与提供的模式匹配。
zh_hant: 類型為 '{0}' 的運算式必須比對提供的樣式。

# WRN_IsPatternAlways_Title
source: The input always matches the provided pattern.
cs: Vstup vždy odpovídá zadanému vzoru
fr: L'entrée correspond toujours au modèle fourni.
it: L'input corrisponde sempre al criterio specificato.
ja: 入力は、指定されたパターンと常に一致します。
pl: Dane wejściowe zawsze są zgodne z podanym wzorcem.
pt_br: A entrada sempre corresponde ao padrão fornecido.
ru: Входные данные всегда соответствуют предоставленному шаблону.
zh_hans: 输入始终与提供的模式匹配。
zh_hant: 輸入必須比對提供的樣式。

# WRN_IsTypeNamedUnderscore
source: The name '_' refers to the type '{0}', not the discard pattern. Use '@_' for the type, or 'var _' to discard.
cs: Název „_“ odkazuje na typ {0}, ne vzor discard. Použijte „@_“ pro tento typ nebo „var _“ pro zahození.
de: Der Name "_" verweist auf den Typ "{0}", nicht auf das discard-Muster. Verwenden Sie "@_" für den Typ oder "var _" zum Verwerfen.
es: El nombre "_" hace referencia al tipo "{0}", no al patrón de descarte. Use "@_" para el tipo o "var _" para el descarte.
fr: Le nom '_' fait référence au type '{0}', pas au modèle d'abandon. Utilisez '@_' pour le type, ou 'var _' pour abandonner.
it: Il nome '_' fa riferimento al tipo '{0}' e non al criterio di eliminazione. Usare '@_' per il tipo oppure 'var _' per eliminare.
ja: 名前 '_' は、破棄パターンではなく型 '{0}' を参照しています。型の場合は '@_' を、破棄する場合は 'var _' をご使用ください。
ko: '_' 이름은 '{0}' 형식을 참조하며, 무시 패턴은 참조하지 않습니다. 형식에 '@_'을 사용하거나, 무시하려면 'var _'을 사용하세요.
pl: Nazwa „_” odwołuje się do typu „{0}”, a nie do wzorca odrzucania. Użyj elementu „@_” aby odwołać się do typu, lub użyj elementu „var _”, aby odrzucić wartość.
pt_br: O nome '_' refere-se ao tipo '{0}', não ao padrão de descarte. Use '@_' para o tipo ou 'var _' para descarte.
ru: Имя "_" ссылается на тип "{0}", а не на шаблон отмены. Используйте "@_" в качестве типа или "var _" для отмены.
tr: '_' adı atma desenine değil '{0}' türüne başvuruyor. Tür için '@_' adını veya atmak için 'var _' adını kullanın.
zh_hans: 名称 "_" 引用类型“{0}”，而不引用放弃模式。对于类型，请使用 "@_"；对于弃用，请使用 "var _"。
zh_hant: 名稱 '_' 參考類型 '{0}'，而非捨棄模式。請為類型使用 '@_'，或使用 'var _' 捨棄。

# WRN_IsTypeNamedUnderscore_Title
source: Do not use '_' to refer to the type in an is-type expression.
cs: Nepoužívejte „_“ jako odkaz na typ ve výrazu is-type.
de: Verwenden Sie "_" nicht zum Verweis auf den Typ in einem is-type-Ausdruck.
es: No use "_" para hacer referencia al tipo en una expresión is-type.
fr: N'utilisez pas '_' pour faire référence au type dans une expression is-type.
it: Non usare '_' per fare riferimento al tipo in un'espressione is-type.
ja: is 型の式の中で型を参照するために '_' を使用しないでください。
ko: '_'을 사용하여 is-type 식의 형식을 참조하지 마세요.
pl: Nie używaj elementu „_” w celu odwoływania się do typu w wyrażeniu „is” z typem.
pt_br: Não use '_' para referir-se ao tipo em uma expressão is-type.
ru: Не используйте "_" для ссылки на тип в выражении is-type.
tr: '_' adını bir is-type ifadesindeki türe başvurmak için kullanmayın.
zh_hans: 请勿使用 "_" 引用 is-type 表达式中的类型。
zh_hant: 請勿使用 '_' 參考 is-type 運算式中的類型。

# WRN_MemberNotNull
source: Member '{0}' must have a non-null value when exiting.
cs: Člen {0} musí mít při ukončení hodnotu jinou než null.
fr: Le membre '{0}' doit avoir une valeur non null au moment de la sortie.
it: Il membro '{0}' deve avere un valore non Null quando viene terminato.
ja: 終了時にメンバー '{0}' には null 以外の値が含まれている必要があります。
pl: Składowa „{0}” musi mieć wartość inną niż null podczas kończenia działania.
pt_br: O membro '{0}' deve ter um valor não nulo durante a saída.
ru: Элемент "{0}" должен иметь значение, отличное от NULL, при выходе.
zh_hans: 退出时，成员“{0}”必须具有非 null 值。
zh_hant: 成員 '{0}' 在結束時必須具有非 Null 值。

# WRN_MemberNotNullBadMember
source: Member '{0}' cannot be used in this attribute.
cs: Člen {0} se v tomto atributu nedá použít.
fr: Le membre '{0}' ne peut pas être utilisé dans cet attribut.
it: Non è possibile usare il membro '{0}' in questo attributo.
ja: メンバー '{0}' をこの属性で使用することはできません。
pl: Nie można użyć składowej „{0}” w tym atrybucie.
pt_br: O membro '{0}' não pode ser usado nesse atributo.
ru: Элемент "{0}" не может использоваться в этом атрибуте.
zh_hans: 不能在此特性中使用成员“{0}”。
zh_hant: 成員 '{0}' 不可用於此屬性中。

# WRN_MemberNotNullBadMember_Title
source: Member cannot be used in this attribute.
cs: Člen se v tomto atributu nedá použít.
fr: Le membre ne peut pas être utilisé dans cet attribut.
it: Non è possibile usare il membro in questo attributo.
ja: メンバーをこの属性で使用することはできません。
pl: Nie można użyć składowej w tym atrybucie.
pt_br: O membro não pode ser usado nesse atributo.
ru: Элемент не может использоваться в этом атрибуте.
zh_hans: 不能在此特性中使用此成员。
zh_hant: 成員不可用於此屬性中。

# WRN_MemberNotNullWhen
source: Member '{0}' must have a non-null value when exiting with '{1}'.
cs: Člen {0} musí mít při ukončení s návratovou hodnotou {1} hodnotu jinou než null.
fr: Le membre '{0}' doit avoir une valeur non null au moment de la sortie avec '{1}'.
it: Il membro '{0}' deve avere un valore non Null quando viene terminato con '{1}'.
ja: '{1}' で終了する場合、メンバー '{0}' には null 以外の値が含まれている必要があります。
pl: Składowa „{0}” musi mieć wartość inną niż null podczas kończenia działania z wartością „{1}”.
pt_br: O membro '{0}' deve ter um valor não nulo durante a saída com '{1}'.
ru: Элемент "{0}" должен иметь значение, отличное от NULL, при выходе с "{1}".
zh_hans: 当使用“{1}”退出时，成员“{0}”必须具有非 null 值。
zh_hant: 成員 '{0}' 在以 '{1}' 結束時必須具有非 Null 值。

# WRN_MemberNotNullWhen_Title
source: Member must have a non-null value when exiting in some condition.
cs: Člen musí mít při ukončení za určité podmínky hodnotu jinou než null
fr: Le membre doit avoir une valeur non null au moment de la sortie dans certaines conditions.
it: Il membro deve avere un valore non Null quando viene terminato in determinate condizioni.
ja: 一部の条件で終了するとき、メンバーには null 以外の値が含まれている必要があります。
pl: Składowa musi mieć wartość inną niż null podczas kończenia działania w pewnym stanie.
pt_br: O membro deve ter um valor não nulo durante a saída em alguma condição.
ru: Элемент должен иметь значение, отличное от NULL, при выходе в определенном состоянии.
zh_hans: 在某些条件下退出时，成员必须具有非 null 值。
zh_hant: 成員在某些條件下結束時必須具有非 Null 值。

# WRN_MemberNotNull_Title
source: Member must have a non-null value when exiting.
cs: Člen musí mít při ukončení hodnotu jinou než null
fr: Le membre doit avoir une valeur non null au moment de la sortie.
it: Il membro deve avere un valore non Null quando viene terminato.
ja: 終了時にメンバーには null 以外の値が含まれている必要があります。
pl: Składowa musi mieć wartość inną niż null podczas kończenia działania.
pt_br: O membro deve ter um valor não nulo ao sair.
ru: Элемент должен иметь значение, отличное от NULL, при выходе.
zh_hans: 退出时，成员必须具有非 null 值。
zh_hant: 成員在結束時必須具有非 Null 值。

# WRN_MissingNonNullTypesContextForAnnotation
source: The annotation for nullable reference types should only be used in code within a '#nullable' annotations context.
cs: Poznámka u typů odkazů s možnou hodnotou null by se měla v kódu používat jenom v kontextu poznámek #nullable.
de: Die Anmerkung für Nullable-Verweistypen darf nur in Code innerhalb eines #nullable-Anmerkungskontexts verwendet werden.
es: La anotación para tipos de referencia que aceptan valores NULL solo debe usarse en el código dentro de un contexto de anotaciones "#nullable".
fr: L'annotation pour les types référence Nullable doit être utilisée uniquement dans le code au sein d'un contexte d'annotations '#nullable'.
it: L'annotazione per i tipi riferimento nullable deve essere usata solo nel codice in un contesto di annotations '#nullable'.
ja: '#nullable' 注釈コンテキスト内のコードでのみ、Null 許容参照型の注釈を使用する必要があります。
ko: nullable 참조 형식에 대한 주석은 코드에서 '#nullable' 주석 컨텍스트 내에만 사용되어야 합니다.
pl: Adnotacja dla typów referencyjnych dopuszczających wartość null powinna być używana tylko w kodzie z kontekstem adnotacji „#nullable”.
pt_br: A anotação para tipos de referência anuláveis deve ser usada apenas em código em um contexto de anotações '#nullable'.
ru: Аннотацию для ссылочных типов, допускающих значения NULL, следует использовать в коде только в контексте аннотаций "#nullable".
tr: Boş değer atanabilir başvuru türleri için ek açıklama kodda yalnızca bir '#nullable' ek açıklama bağlamı içinde kullanılmalıdır.
zh_hans: 只能在 "#nullable" 注释上下文内的代码中使用可为 null 的引用类型的注释。
zh_hant: 可為 Null 的參考型別註釋應只用於 '#nullable' 註釋內容中的程式碼。

# WRN_MissingNonNullTypesContextForAnnotationInGeneratedCode
source: The annotation for nullable reference types should only be used in code within a '#nullable' annotations context. Auto-generated code requires an explicit '#nullable' directive in source.
cs: Poznámka pro typy odkazů s možnou hodnotou null by se měla používat jenom v kódu v rámci kontextu poznámek #nullable. Automaticky vygenerovaný kód vyžaduje explicitní direktivu #nullable ve zdroji.
de: Die Anmerkung für Nullable-Verweistypen darf nur in Code innerhalb eines #nullable-Anmerkungskontexts verwendet werden. Für automatisch generierten Code ist eine explizite #nullable-Anweisung in der Quelle erforderlich.
es: La anotación de tipos de referencia que aceptan valores NULL solo se debe usar en el código en un contexto de anotaciones "#nullable". El código generado automáticamente requiere una directiva "#nullable" explícita en el código fuente.
fr: L'annotation pour les types référence Nullable doit être utilisée uniquement dans le code au sein d'un contexte d'annotations '#nullable'. Le code généré automatiquement nécessite une directive '#nullable' explicite dans la source.
it: L'annotazione per i tipi riferimento nullable deve essere usata solo nel codice all'interno di un contesto di annotazioni '#nullable'. Il codice generato automaticamente richiede una direttiva '#nullable' esplicita nell'origine.
ja: Null 許容参照型の注釈は、'#nullable' 注釈のコンテキスト内のコードでのみ使用する必要があります。自動生成されたコードには、ソースに明示的な '#nullable' ディレクティブが必要です。
ko: Nullable 참조 형식에 대한 주석은 '#nullable' 주석 컨텍스트 내의 코드에서만 사용해야 합니다. 자동 생성된 코드에는 소스에 명시적 '#nullable' 지시문이 필요합니다.
pl: Adnotacja dla typów referencyjnych dopuszczających wartość null powinna być używana w kodzie tylko w ramach kontekstu adnotacji „#nullable”. Wygenerowany automatycznie kod wymaga jawnej dyrektywy „#nullable” w źródle.
pt_br: A anotação para tipos de referência anuláveis só deve ser usada no código em um contexto de anotações '#nullable'. O código gerado automaticamente exige uma diretiva '#nullable' explícita na origem.
ru: Заметка к ссылочным типам, допускающим значение NULL, должна использоваться в коде только в контексте заметок "#nullable". Автоматически создаваемый исходный код требует директиву "#nullable" в явном виде.
tr: Null atanabilir başvuru türleri için ek açıklama yalnızca bir '#nullable' ek açıklama bağlamı içinde kodda kullanılmalıdır. Otomatik oluşturulan kod kaynakta açık bir '#nullable' yönergesi gerektirir.
zh_hans: 对可为 null 的引用类型的批注只应在 "#nullable" 批注上下文中的代码中使用。自动生成的代码要求在源中使用显式 "#nullable" 指令。
zh_hant: 因為可為 null 之參考型別的註釋應只於 '#nullable' 註釋內容的程式碼中使用。自動產生的的程式碼需要來源中的明確 '#nullable' 指示詞。

# WRN_MissingNonNullTypesContextForAnnotationInGeneratedCode_Title
source: The annotation for nullable reference types should only be used in code within a '#nullable' annotations context. Auto-generated code requires an explicit '#nullable' directive in source.
cs: Poznámka pro typy odkazů s možnou hodnotou null by se měla používat jenom v kódu v rámci kontextu poznámek #nullable. Automaticky vygenerovaný kód vyžaduje explicitní direktivu #nullable ve zdroji.
de: Die Anmerkung für Nullable-Verweistypen darf nur in Code innerhalb eines #nullable-Anmerkungskontexts verwendet werden. Für automatisch generierten Code ist eine explizite #nullable-Anweisung in der Quelle erforderlich.
es: La anotación de tipos de referencia que aceptan valores NULL solo se debe usar en el código en un contexto de anotaciones "#nullable". El código generado automáticamente requiere una directiva "#nullable" explícita en el código fuente.
fr: L'annotation pour les types référence Nullable doit être utilisée uniquement dans le code au sein d'un contexte d'annotations '#nullable'. Le code généré automatiquement nécessite une directive '#nullable' explicite dans la source.
it: L'annotazione per i tipi riferimento nullable deve essere usata solo nel codice all'interno di un contesto di annotazioni '#nullable'. Il codice generato automaticamente richiede una direttiva '#nullable' esplicita nell'origine.
ja: Null 許容参照型の注釈は、'#nullable' 注釈のコンテキスト内のコードでのみ使用する必要があります。自動生成されたコードには、ソースに明示的な '#nullable' ディレクティブが必要です。
ko: Nullable 참조 형식에 대한 주석은 '#nullable' 주석 컨텍스트 내의 코드에서만 사용해야 합니다. 자동 생성된 코드에는 소스에 명시적 '#nullable' 지시문이 필요합니다.
pl: Adnotacja dla typów referencyjnych dopuszczających wartość null powinna być używana w kodzie tylko w ramach kontekstu adnotacji „#nullable”. Wygenerowany automatycznie kod wymaga jawnej dyrektywy „#nullable” w źródle.
pt_br: A anotação para tipos de referência anuláveis só deve ser usada no código em um contexto de anotações '#nullable'. O código gerado automaticamente exige uma diretiva '#nullable' explícita na origem.
ru: Заметка к ссылочным типам, допускающим значение NULL, должна использоваться в коде только в контексте заметок "#nullable". Автоматически создаваемый исходный код требует директиву "#nullable" в явном виде.
tr: Null atanabilir başvuru türleri için ek açıklama yalnızca bir '#nullable' ek açıklama bağlamı içinde kodda kullanılmalıdır. Otomatik oluşturulan kod kaynakta açık bir '#nullable' yönergesi gerektirir.
zh_hans: 对可为 null 的引用类型的批注只应在 "#nullable" 批注上下文中的代码中使用。自动生成的代码要求在源中使用显式 "#nullable" 指令。
zh_hant: 因為可為 null 之參考型別的註釋應只於 '#nullable' 註釋內容的程式碼中使用。自動產生的的程式碼需要來源中的明確 '#nullable' 指示詞。

# WRN_MissingNonNullTypesContextForAnnotation_Title
source: The annotation for nullable reference types should only be used in code within a '#nullable' annotations context.
cs: Poznámka u typů odkazů s možnou hodnotou null by se měla v kódu používat jenom v kontextu poznámek #nullable.
de: Die Anmerkung für Nullable-Verweistypen darf nur in Code innerhalb eines #nullable-Anmerkungskontexts verwendet werden.
es: La anotación para tipos de referencia que aceptan valores NULL solo debe usarse en el código dentro de un contexto de anotaciones "#nullable".
fr: L'annotation pour les types référence Nullable doit être utilisée uniquement dans le code au sein d'un contexte d'annotations '#nullable'.
it: L'annotazione per i tipi riferimento nullable deve essere usata solo nel codice in un contesto di annotations '#nullable'.
ja: '#nullable' 注釈コンテキスト内のコードでのみ、Null 許容参照型の注釈を使用する必要があります。
ko: nullable 참조 형식에 대한 주석은 코드에서 '#nullable' 주석 컨텍스트 내에만 사용되어야 합니다.
pl: Adnotacja dla typów referencyjnych dopuszczających wartość null powinna być używana tylko w kodzie z kontekstem adnotacji „#nullable”.
pt_br: A anotação para tipos de referência anuláveis deve ser usada apenas em código em um contexto de anotações '#nullable'.
ru: Аннотацию для ссылочных типов, допускающих значения NULL, следует использовать в коде только в контексте аннотаций "#nullable".
tr: Boş değer atanabilir başvuru türleri için ek açıklama kodda yalnızca bir '#nullable' ek açıklama bağlamı içinde kullanılmalıdır.
zh_hans: 只能在 "#nullable" 注释上下文内的代码中使用可为 null 的引用类型的注释。
zh_hant: 可為 Null 的參考型別註釋應只用於 '#nullable' 註釋內容中的程式碼。

# WRN_NullAsNonNullable
source: Cannot convert null literal to non-nullable reference type.
cs: Literál null nejde převést na odkazový typ, který nemůže mít hodnotu null.
de: Ein NULL-Literal kann nicht in einen Non-Nullable-Verweistyp konvertiert werden.
es: No se puede convertir un literal NULL en un tipo de referencia que no acepta valores NULL.
fr: Impossible de convertir un littéral ayant une valeur null en type référence non-nullable.
it: Non è possibile convertire il valore letterale Null in tipo riferimento che non ammette i valori Null.
ja: null リテラルを null 非許容参照型に変換できません。
ko: Null 리터럴을 null을 허용하지 않는 참조 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować literału o wartości null na nienullowalny typ referencyjny.
pt_br: Não é possível converter um literal nulo em um tipo de referência não anulável.
ru: Литерал, равный NULL, не может быть преобразован в ссылочный тип, не допускающий значение NULL.
tr: Null sabit değer, boş değer atanamayan başvuru türüne dönüştürülemiyor.
zh_hans: 无法将 null 字面量转换为非 null 的引用类型。
zh_hant: 無法將 null 常值轉換成不可為 Null 的參考型別。
