Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_FeatureParameterlessStructConstructors
source: parameterless struct constructors
cs: konstruktory struktury bez parametrů
fr: constructeurs de struct sans paramètre
it: costruttori struct senza parametri
ja: パラメーターのない構造体コンストラクター
pl: Konstruktory struktury bez parametrów
pt_br: construtores struct sem parâmetros
ru: конструкторы структуры без параметров
zh_hans: 参数结构构造函数
zh_hant: 無參數結構建構函式

# IDS_FeatureParamsCollections
source: params collections
fr: collections de params
it: raccolte parametri
pl: kolekcje params
pt_br: coleções de params
ru: коллекции params
zh_hans: Params 集合
zh_hant: 參數集合

# IDS_FeaturePartialEventsAndConstructors
source: partial events and constructors
pt_br: eventos parciais e construtores

# IDS_FeaturePositionalFieldsInRecords
source: positional fields in records
cs: pozice polí v záznamech
fr: champs positionnels dans les enregistrements
it: campi posizionali nei record
ja: レコード内の位置指定フィールド
pl: pola pozycyjne w rekordach
pt_br: campos posicionais nos registros
ru: позиционные поля в записях
zh_hans: 记录中的位置字段
zh_hant: 記錄中的位置欄位

# IDS_FeaturePrimaryConstructors
source: primary constructors
cs: primární konstruktory
fr: constructeurs principaux
it: costruttori primari
ja: プライマリ コンストラクター
pl: konstruktory podstawowe
pt_br: construtores primários
ru: основные конструкторы
zh_hans: 主构造函数
zh_hant: 主要建構函式

# IDS_FeatureRawStringLiterals
source: raw string literals
cs: literály nezpracovaného řetězce
fr: littéraux de chaîne brute
it: valori letterali stringa non elaborati
ja: 生文字列リテラル
pl: literały nieprzetworzonego ciągu
pt_br: literais de cadeia de caracteres bruta
ru: литералы необработанных строк
zh_hans: 原始字符串字面量
zh_hant: 原始字串常值

# IDS_FeatureRecordStructs
source: record structs
cs: struktury záznamů
fr: structs d’enregistrement
it: struct di record
ja: レコード構造体
pl: struktury rekordów
pt_br: registrar structs
ru: структуры записей
zh_hans: 记录结构
zh_hant: 記錄結構

# IDS_FeatureRefFields
source: ref fields
cs: pole ref
fr: champs ref
it: campi ref
ja: ref フィールド
pl: pola referencyjne
pt_br: campos ref
ru: поля ref
zh_hans: ref 字段
zh_hant: ref 欄位

# IDS_FeatureRefReadonlyParameters
source: ref readonly parameters
fr: paramètres ref readonly
it: parametri di sola lettura ref
ja: ref 読み取り専用パラメーター
pl: parametry tylko do odczytu ref
pt_br: parâmetros ref readonly
ru: Параметры ref, доступные только для чтения
zh_hans: ref readonly 参数
zh_hant: ref readonly 參數

# IDS_FeatureRefStructInterfaces
source: ref struct interfaces
fr: interfaces de type ref struct
it: interfacce ref struct
pl: interfejsy struktury ref
pt_br: interfaces de ref struct
ru: интерфейсы ref struct
zh_hans: ref 结构接口
zh_hant: ref struct 介面

# IDS_FeatureRefUnsafeInIteratorAsync
source: ref and unsafe in async and iterator methods
fr: ref et unsafe dans des méthodes asynchrones et d’itérateur
it: ref e unsafe nei metodi asincroni e iteratori
pl: „ref” i „unsafe” w metodach asynchronicznych i iteracyjnych
pt_br: ref e unsafe em métodos assíncronos e iteradores
ru: ref и unsafe в асинхронных и итераторных методах
zh_hans: 异步方法和迭代器方法中的 ref 和 unsafe
zh_hant: 非同步和迭代器方法中的 ref 和 unsafe

# IDS_FeatureRelaxedShiftOperator
source: relaxed shift operator
cs: uvolněný operátor směny
fr: opérateur shift souple
it: operatore di spostamento rilassato
ja: 緩和されたシフト演算子
pl: operator swobodnej zmiany
pt_br: operador de deslocamento flexível
ru: нестрогий оператор сдвига
zh_hans: 移位运算符
zh_hant: 寬鬆移位 (Shift) 運算子

# IDS_FeatureRequiredMembers
source: required members
cs: požadovaní členové
fr: membres obligatoires
it: membri obbligatori
ja: 必要なメンバー
pl: wymagane składowe
pt_br: membros requeridos
ru: обязательные элементы
zh_hans: 必需成员
zh_hant: 必要成員

# IDS_FeatureSealedToStringInRecord
source: sealed ToString in record
cs: zapečetěný ToString v záznamu
fr: ToString scellé dans l’enregistrement
it: ToString sealed nel record
ja: レコードでシールされた ToString
pl: zapieczętowany obiekt ToString w rekordzie
pt_br: ToString selado no registro
ru: запечатанный ToString в записи
zh_hans: 记录的密封 ToString
zh_hant: 記錄中有密封的 ToString

# IDS_FeatureSimpleLambdaParameterModifiers
source: simple lambda parameter modifiers
pt_br: modificadores de parâmetro lambda simples

# IDS_FeatureStringEscapeCharacter
source: string escape character
fr: caractère d’échappement de chaîne
it: carattere di escape stringa
pl: ciąg — znak ucieczki
pt_br: cadeia de caracteres de escape
ru: escape-символ строки
zh_hans: 字符串转义字符
zh_hant: 字串逸出字元

# IDS_FeatureStructFieldInitializers
source: struct field initializers
cs: Inicializátory polí struktury
fr: initialiseurs de champ de struct
it: inizializzatori di campo struct
ja: 構造体フィールド初期化子
pl: inicjatory pola struktury
pt_br: inicializadores de campo de struct
ru: инициализаторы полей структуры
zh_hans: 结构字段初始化表达式
zh_hant: 結構欄位初始設定式

# IDS_FeatureUnboundGenericTypesInNameof
source: unbound generic types in nameof operator
fr: types génériques indépendants dans l’opérateur nameof
it: tipi generici non collegati nell'operatore nameof
pt_br: tipos genéricos não associados no operador nameof
ru: не привязанные универсальные типы в операторе nameof
zh_hans: nameof 运算符中的未绑定泛型类型

# IDS_FeatureUnsignedRightShift
source: unsigned right shift
cs: nepodepsaný pravý posun
fr: shift droit non signé
it: spostamento a destra senza segno
ja: 符号なし右シフト
pl: niepodpisane przesunięcie w prawo
pt_br: deslocamento direito não atribuído
ru: сдвиг вправо без знака
zh_hans: 未签名的右移位
zh_hant: 未簽署右移位

# IDS_FeatureUserDefinedCompoundAssignmentOperators
source: user-defined compound assignment operators
pt_br: operadores de atribuição composta definidos pelo usuário

# IDS_FeatureUtf8StringLiterals
source: UTF-8 string literals
cs: Řetězcové literály UTF-8
fr: Littéraux de chaîne UTF-8
it: Valori letterali stringa UTF-8
ja: UTF-8 文字列リテラル
pl: Literały ciągu UTF-8
pt_br: Cadeia de caracteres UTF-8 literais
ru: Строковые литералы UTF-8
zh_hans: UTF-8 字符串文本
zh_hant: UTF-8 字串常值

# IDS_FeatureUsingTypeAlias
source: using type alias
cs: pomocí aliasu typu
fr: utilisation de l’alias de type
it: Alias di tipo using
ja: using 型のエイリアス
pl: przy użyciu aliasu typu
pt_br: usando tipo alias
ru: использование псевдонима типа
zh_hans: 使用类型别名
zh_hant: 使用類型別名

# IDS_FeatureWithOnAnonymousTypes
source: with on anonymous types
cs: s anonymními typy
fr: avec sur les types anonymes
it: con tipi anonimi
ja: 匿名型の場合
pl: przy użyciu typów anonimowych
pt_br: com tipos anônimos
ru: с использованием анонимных типов
zh_hans: 在匿名类型上
zh_hant: 在匿名型別上

# IDS_FeatureStaticAbstractMembersInInterfaces
source: static abstract members in interfaces
cs: statické abstraktní členy v rozhraní
fr: membres abstraits statiques dans les interfaces
it: membri astratti statici nelle interfacce
ja: インターフェイスの静的な要約メンバー
pl: statyczne abstrakcyjne składowe w interfejsach
pt_br: membros abstratos estáticos em interfaces
ru: абстрактные статические элементы в интерфейсах
zh_hans: 接口中的静态抽象成员
zh_hant: 介面中的靜態抽象成員

# IDS_FeatureWithOnStructs
source: with on structs
cs: se strukturami
fr: avec sur structs
it: con struct
ja: 構造体の場合
pl: przy użyciu struktur
pt_br: com estruturas
ru: с использованием структур
zh_hans: 在结构上
zh_hant: 在結構上

# IDS_FeatureSpanCharConstantPattern
source: pattern matching ReadOnly/Span<char> on constant string
cs: vzor odpovídající ReadOnly/Span<char> na konstantním řetězci
fr: modèle correspondant à ReadOnly/Span<char> sur une chaîne constante
it: criterio corrispondente a ReadOnly/Span<char> su stringa costante
ja: 定数文字列の ReadOnly/Span<char> に一致するパターン
pl: dopasowanie wzorca ReadOnly/Span<char> w ciągu stałym
pt_br: padrões correspondentes a ReadOnly/Span<char> na cadeia de caracteres constante
ru: сопоставление шаблонов ReadOnly/Span<char> в строке константы
zh_hans: 与常量字符串上的 ReadOnly/Span<char> 匹配的模式
zh_hant: 常數字串上的模式比對 ReadOnly/Span<char>

# IDS_Missing
source: <missing>
fr: <manquant>
pt_br: <ausente>

# IDS_PointerElementAccess
source: pointer element access
cs: přístup k elementu ukazatele
fr: accès à l’élément de pointeur
it: accesso all'elemento puntatore
ja: ポインター要素アクセス
pl: dostęp do elementu wskaźnika
pt_br: acesso ao elemento de ponteiro
ru: доступ к элементу указателя
zh_hans: 指针元素访问
zh_hant: 指標元素存取

# IDS_SK_ARRAY
source: array
fr: déployer
it: matrice
ja: 配列
pl: tablica
pt_br: matriz
ru: множество
zh_hans: 数组
zh_hant: 陣列

# IDS_SK_DYNAMIC
source: dynamic
fr: dynamique
it: dinamico
ja: ダイナミック
pl: dynamiczny
pt_br: dinâmica
ru: динамический
zh_hans: 动态
zh_hant: 動態

# IDS_SK_FUNCTION_POINTER
source: function pointer
fr: pointeur de fonction
it: Puntatore funzione
ja: 関数ポインター
pl: wskaźnik funkcji
pt_br: ponteiro de função
ru: указатель функции
zh_hans: 函数指针
zh_hant: 函式指標

# IDS_SK_POINTER
source: pointer
fr: aiguille
it: indicatore di misura
ja: ポインター
pl: wskaźnik
pt_br: ponteiro
ru: указатель
zh_hans: 指针
zh_hant: 指標

# INF_TooManyBoundLambdas
source: Compiling requires binding the lambda expression at least {0} times. Consider declaring the lambda expression with explicit parameter types, or if the containing method call is generic, consider using explicit type arguments.
fr: La compilation nécessite la liaison de l’expression lambda au moins {0} fois. Envisagez de déclarer l’expression lambda avec des types de paramètre explicites ou, si l’appel de méthode conteneur est générique, utilisez des arguments de type explicite.
it: La compilazione richiede l'associazione dell'espressione lambda almeno {0}volte. È consigliabile dichiarare l'espressione lambda con tipi di parametro espliciti oppure, se la chiamata al metodo contenitore è generica, provare a usare argomenti di tipo esplicito.
pl: Kompilowanie wymaga powiązania wyrażenia lambda co najmniej {0} razy. Rozważ zadeklarowanie wyrażenia lambda z jawnymi typami parametrów lub jeśli zawarte wywołanie metody jest ogólne, rozważ użycie jawnych argumentów typu.
pt_br: A compilação requer a associação da expressão lambda pelo menos {0} vezes. Considere declarar a expressão lambda com tipos de parâmetro explícitos ou, se a chamada de método que a contém for genérica, considere o uso de argumentos de tipo explícito.
ru: Компиляция требует по крайней мере {0}-кратной привязки лямбда-выражения. Рассмотрите возможность объявления лямбда-выражения с явными типами параметров или, если содержащий его вызов метода является универсальным, рассмотрите возможность использования аргументов явного типа.
zh_hans: 编译时需要绑定 lambda 表达式至少 {0} 次。请考虑使用显式参数类型声明 lambda 表达式，如果包含的方法调用是泛型的，请考虑使用显式类型参数。
zh_hant: 編譯至少需要繫結 Lambda 運算式 {0} 次。請考慮在宣告 Lambda 運算式時，指定明確的參數類型；若包含了泛型方法呼叫，請考慮使用明確的類型引數。

# INF_TooManyBoundLambdas_Title
source: Compiling requires binding the lambda expression many times. Consider declaring the lambda expression with explicit parameter types, or if the containing method call is generic, consider using explicit type arguments.
fr: La compilation nécessite la liaison de l’expression lambda de nombreuses fois. Envisagez de déclarer l’expression lambda avec des types de paramètre explicites ou, si l’appel de méthode conteneur est générique, utilisez des arguments de type explicite.
it: La compilazione richiede l'associazione dell'espressione lambda molte volte. È consigliabile dichiarare l'espressione lambda con tipi di parametro espliciti oppure, se la chiamata al metodo contenitore è generica, provare a usare argomenti di tipo esplicito.
pl: Kompilowanie wymaga powiązania wyrażenia lambda wiele razy. Rozważ zadeklarowanie wyrażenia lambda z jawnymi typami parametrów lub jeśli zawarte wywołanie metody jest ogólne, rozważ użycie jawnych argumentów typu.
pt_br: A compilação requer a associação da expressão lambda muitas vezes. Considere declarar a expressão lambda com tipos de parâmetro explícitos ou, se a chamada de método que a contém for genérica, considere o uso de argumentos de tipo explícito.
ru: Компиляция требует многократной привязки лямбда-выражения. Рассмотрите возможность объявления лямбда-выражения с явными типами параметров или, если содержащий его вызов метода является универсальным, рассмотрите возможность использования аргументов явного типа.
zh_hans: 编译时需要多次绑定 lambda 表达式。请考虑使用显式参数类型声明 lambda 表达式，如果包含的方法调用是泛型的，请考虑使用显式类型参数。
zh_hant: 編譯需要多次繫結 Lambda 運算式。請考慮在宣告 Lambda 運算式時，指定明確的參數類型；若包含了泛型方法呼叫，請考慮使用明確的類型引數。

# ISpreadOperationIsNotCSharpSpread
source: {0} is not a valid C# spread operation
fr: {0} n’est pas une opération de propagation C# valide
it: {0} non è un'operazione estensione C# valida
ja: {0} は有効な C# 分散演算ではありません
pl: {0} nie jest prawidłową operacją rozłożenia w języku C#
pt_br: {0} não é uma operação de espalhamento C# válida
ru: {0} не является допустимой операцией расширения C#
zh_hans: {0} 不是有效的 C# 分布操作
zh_hant: {0} 不是有效的 C# spread 作業

# NodeIsNotAwaitUsingDeclaration
source: 'node' is not an 'await using' declaration
pt_br: "node" não é uma declaração "await using"

# NodeIsNotAwaitUsingStatement
source: 'node' is not an 'await using' statement
pt_br: "node" não é uma instrução "await using"

# ParameterRequiresTypeOrIdentifier
source: ParameterSyntax requires either a type or an identifier.
pt_br: ParameterSyntax requer um tipo ou um identificador.

# WRN_AccessorDoesNotUseBackingField
source: The '{0}' accessor of property '{1}' should use 'field' because the other accessor is using it.
fr: L’accesseur '{0}' de la propriété '{1}' doit utiliser 'field', car l’autre accesseur l’utilise.
it: La funzione di accesso '{0}' della proprietà '{1}' deve usare 'field' perché è utilizzata dall'altra funzione di accesso.
pt_br: O '{0}' da propriedade '{1}' deve usar 'field' porque o outro acessador o está usando.
ru: Метод '{0}' доступа к '{1}' должен использовать "field", так как он используется другим методом доступа.
zh_hans: 属性 '{1}' 的 '{0}' 访问器应使用“field”，因为其他访问器正在使用它。

# WRN_AccessorDoesNotUseBackingField_Title
source: Property accessor should use 'field' because the other accessor is using it.
fr: L’accesseur de propriété doit utiliser 'field', car l’autre accesseur l’utilise.
it: La funzione di accesso delle proprietà deve usare 'field' perché è in uso dall'altra funzione di accesso.
pt_br: O acessador de propriedade deve usar 'field' porque o outro acessador o está usando.
ru: Метод доступа к свойству должен использовать "field", так как он используется другим методом доступа.
zh_hans: 属性访问器应使用 “field”，因为另一个访问器正在使用它。

# WRN_AddressOfInAsync
source: The '&' operator should not be used on parameters or local variables in async methods.
cs: Operátor „&“ by se neměl používat u parametrů nebo místních proměnných v asynchronních metodách.
fr: L’opérateur '&' ne doit pas être utilisé sur les paramètres ou les variables locales dans les méthodes asynchrones.
it: L'operatore '&' non deve essere usato su parametri o variabili locali in metodi asincroni.
ja: '&' 演算子は、非同期メソッドのパラメーターまたはローカル変数では使用できません。
pl: Operator „&” nie powinien być używany w parametrach ani zmiennych lokalnych w metodach asynchronicznych.
pt_br: O operador '&' não deve ser usado em parâmetros ou variáveis locais em métodos assíncronos.
ru: Оператор "&" не следует использовать для параметров или локальных переменных в асинхронных методах.
zh_hans: '&' 运算符不应用于异步方法中的参数或局部变量。
zh_hant: '&' 運算子不應該用於非同步方法中的參數或區域變數。

# WRN_AddressOfInAsync_Title
source: The '&' operator should not be used on parameters or local variables in async methods.
cs: Operátor „&“ by se neměl používat u parametrů nebo místních proměnných v asynchronních metodách.
fr: L’opérateur '&' ne doit pas être utilisé sur les paramètres ou les variables locales dans les méthodes asynchrones.
it: L'operatore '&' non deve essere usato su parametri o variabili locali in metodi asincroni.
ja: '&' 演算子は、非同期メソッドのパラメーターまたはローカル変数では使用できません。
pl: Operator „&” nie powinien być używany w parametrach ani zmiennych lokalnych w metodach asynchronicznych.
pt_br: O operador '&' não deve ser usado em parâmetros ou variáveis locais em métodos assíncronos.
ru: Оператор "&" не следует использовать для параметров или локальных переменных в асинхронных методах.
zh_hans: '&' 运算符不应用于异步方法中的参数或局部变量。
zh_hant: '&' 運算子不應該用於非同步方法中的參數或區域變數。

# WRN_AnalyzerReferencesFramework
source: The assembly '{0}' containing type '{1}' references .NET Framework, which is not supported.
cs: Sestavení {0}, které obsahuje typ {1}, se odkazuje na architekturu .NET Framework, což se nepodporuje.
fr: L'assembly '{0}' contenant le type '{1}' référence le .NET Framework, ce qui n'est pas pris en charge.
it: L'assembly '{0}' che contiene il tipo '{1}' fa riferimento a .NET Framework, che non è supportato.
ja: 型 '{1}' を含むアセンブリ '{0}' が .NET Framework を参照しています。これはサポートされていません。
pl: Zestaw „{0}” zawierający typ „{1}” odwołuje się do platformy .NET Framework, co nie jest obsługiwane.
pt_br: O assembly '{0}' contendo o tipo '{1}' referencia o .NET Framework, mas não há suporte para isso.
ru: Сборка "{0}", содержащая тип "{1}", ссылается на платформу .NET Framework, которая не поддерживается.
zh_hans: 包含类型“{1}”的程序集“{0}”引用了 .NET Framework，而此操作不受支持。
zh_hant: 包含類型 '{1}' 的組件 '{0}' 參考了 .NET Framework，此情形不受支援。

# WRN_AnalyzerReferencesFramework_Title
source: The loaded assembly references .NET Framework, which is not supported.
cs: Načtené sestavení se odkazuje na architekturu .NET Framework, což se nepodporuje
fr: L'assembly chargé référence le .NET Framework, ce qui n'est pas pris en charge.
it: L'assembly caricato fa riferimento a .NET Framework, che non è supportato.
ja: 読み込まれたアセンブリが .NET Framework を参照しています。これはサポートされていません。
pl: Załadowany zestaw odwołuje się do platformy .NET Framework, co nie jest obsługiwane.
pt_br: O assembly carregado referencia o .NET Framework, mas não há suporte para isso.
ru: Загруженная сборка ссылается на платформу .NET Framework, которая не поддерживается.
zh_hans: 加载的程序集引用了 .NET Framework，而此操作不受支持。
zh_hant: 載入的組件參考了 .NET Framework，此情形不受支援。

# WRN_AnalyzerReferencesNewerCompiler
source: Analyzer assembly '{0}' cannot be used because it references version '{1}' of the compiler, which is newer than the currently running version '{2}'.
it: L'assembly dell'analizzatore '{0}' fa riferimento alla versione '{1}' del compilatore, che è più recente della versione attualmente in esecuzione '{2}'.
pt_br: O assembly do analisador "{0}" não pode ser usado porque faz referência à versão "{1}" do compilador, que é mais recente do que a versão em execução no momento "{2}".
ru: Сборка анализатора "{0}" ссылается на версию "{1}" компилятора, являющуюся более новой, чем версия "{2}".
zh_hans: 分析器程序集“{0}”引用了编译器的版本“{1}”，该版本高于当前正在运行的版本“{2}”。

# WRN_AnalyzerReferencesNewerCompiler_Title
source: Analyzer assembly cannot be used because it references a newer version of the compiler than the currently running version.
it: L'assembly dell'analizzatore fa riferimento alla versione del compilatore, che è più recente della versione attualmente in esecuzione.
pt_br: O assembly do analisador não pode ser usado porque faz referência a uma versão mais recente do compilador do que a versão em execução no momento.
ru: Сборка анализатора ссылается на более новую версию компилятора, чем установленная сейчас.
zh_hans: 分析器程序集引用的编译器版本高于当前正在运行的版本。

# WRN_ArgExpectedIn
source: Argument {0} should be passed with the 'in' keyword
fr: L’argument {0} doit être passé avec le mot clé « in »
it: L'argomento {0} deve essere passato con la parola chiave 'in'
pl: Argument {0} powinien być przekazywany za pomocą słowa kluczowego „in”
pt_br: O argumento {0} deve ser passado com a palavra-chave 'in'
ru: Аргумент {0} должен передаваться с использованием ключевого слова "in"
zh_hans: 应使用 “in” 关键字传递参数 {0}
zh_hant: 引數 {0} 應該以 'in' 的關鍵字傳遞

# WRN_ArgExpectedIn_Title
source: Argument should be passed with the 'in' keyword
fr: L’argument doit être passé avec le mot clé « in »
it: L'argomento deve essere passato con la parola chiave 'in'
pl: Argument powinien być przekazywany za pomocą słowa kluczowego „in”
pt_br: O argumento deve ser passado com a palavra-chave 'in'
ru: Аргумент должен передаваться с использованием ключевого слова "in"
zh_hans: 应使用 “in” 关键字传递参数
zh_hant: 引數應該以 'in' 的關鍵字傳遞

# WRN_ArgExpectedRefOrIn
source: Argument {0} should be passed with 'ref' or 'in' keyword
fr: L’argument {0} doit être passé avec le mot clé « ref » ou « in »
it: L'argomento {0} deve essere passato con la parola chiave 'ref' o 'in'
ja: 引数 {0} は 'ref' または 'in' キーワード (keyword)と共に渡す必要があります
pl: Argument {0} powinien być przekazywany za pomocą słowa kluczowego „ref” lub „in”
pt_br: O argumento {0} deve ser passado com a palavra-chave 'ref' ou 'in'
ru: Аргумент {0} должен передаваться с использованием ключевого слова "ref" или "in"
zh_hans: 应使用 “ref” 或 “in” 关键字传递参数 {0}
zh_hant: 引數 {0} 應該以 'ref' 或 'in' 的關鍵字傳遞

# WRN_ArgExpectedRefOrIn_Title
source: Argument should be passed with 'ref' or 'in' keyword
fr: L’argument doit être passé avec le mot clé « ref » ou « in »
it: L'argomento deve essere passato con la parola chiave 'ref' o 'in'
ja: 引数は 'ref' または 'in' キーワード (keyword)で渡す必要があります
pl: Argument powinien być przekazywany za pomocą słowa kluczowego „ref” lub „in”
pt_br: O argumento deve ser passado com a palavra-chave 'ref' ou 'in'
ru: Аргумент должен передаваться с использованием ключевого слова "ref" или "in"
zh_hans: 应使用 “ref” 或 “in” 关键字传递参数
zh_hant: 引數應該以 'ref' 或 'in' 的關鍵字傳遞

# WRN_BadArgRef
source: The 'ref' modifier for argument {0} corresponding to 'in' parameter is equivalent to 'in'. Consider using 'in' instead.
fr: Le modificateur « ref » de l’argument {0} correspondant au paramètre « in » est équivalent à « in ». Envisagez d’utiliser « in » à la place.
it: Il modificatore 'ref' per l'argomento {0} corrispondente al parametro 'in' equivale a 'in'. Provare a usare 'in'.
ja: 'in' パラメーターに対応する引数 {0} の 'ref' 修飾子が 'in' と同じです。代わりに 'in' を使用することを検討してください。
pl: Modyfikator „ref” dla argumentu {0} odpowiadającego parametrowi „in” jest równoważny parametrowi „in”. Zamiast tego rozważ użycie parametru „in”.
pt_br: O modificador 'ref' do argumento {0} correspondente ao parâmetro 'in' é equivalente a 'in'. Considere usar 'in' em vez disso.
ru: Модификатор "ref" для аргумента {0}, соответствующего параметру "in", эквивалентен "in". Попробуйте вместо этого использовать "in".
zh_hans: 与 “in” 参数对应的参数 {0} 的 “ref” 修饰符等效于 “in”。请考虑改用 “in”。
zh_hant: 對應至 'in' 參數之引數 {0} 的 'ref' 修飾元相當於 'in'。請考慮改為使用 'in'。

# WRN_BadArgRef_Title
source: The 'ref' modifier for an argument corresponding to 'in' parameter is equivalent to 'in'. Consider using 'in' instead.
fr: Le modificateur « ref » d’un argument correspondant au paramètre « in » est équivalent à « in ». Envisagez d’utiliser « in » à la place.
it: Il modificatore 'ref' per un argomento corrispondente al parametro 'in' equivale a 'in'. Provare a usare 'in'.
ja: 'in' パラメーターに対応する引数の 'ref' 修飾子は 'in' と同じです。代わりに 'in' を使用することを検討してください。
pl: Modyfikator „ref” dla argumentu odpowiadającego parametrowi „in” jest równoważny parametrowi „in”. Zamiast tego rozważ użycie parametru „in”.
pt_br: O modificador 'ref' do argumento correspondente ao parâmetro 'in' é equivalente a 'in'. Considere usar 'in' em vez disso.
ru: Модификатор "ref" для аргумента, соответствующего параметру "in", эквивалентен "in". Попробуйте вместо этого использовать "in".
zh_hans: 与 “in” 参数对应的参数的 “ref” 修饰符等效于 “in”。请考虑改用 “in”。
zh_hant: 對應至 'in' 參數之引數的 'ref' 修飾元相當於 'in'。請考慮改為使用 'in'。

# WRN_ByValArraySizeConstRequired
source: Attribute parameter 'SizeConst' must be specified.
fr: Vous devez spécifier un paramètre d’attribut « SizeConst ».
it: È necessario specificare il parametro di attributo 'SizeConst'.
pl: Należy określić parametr atrybutu „SizeConst”.
pt_br: O parâmetro de atribuição 'SizeConst' deve ser especificado.
ru: Должен быть указан параметр атрибута "SizeConst".
zh_hans: 必须指定属性参数 “SizeConst”。
zh_hant: 必須指定屬性參數 'SizeConst'。
