Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_PartialMethodCannotHaveOutParameters
source: A partial method cannot have out parameters
de: Eine partielle Methode darf keine out-Parameter enthalten.
es: Un método parcial no puede tener parámetros out
ko: 부분 메서드(Partial Method)에는 out 매개 변수를 사용할 수 없습니다.
tr: Kısmi bir yöntemin out parametreleri olamaz

# ERR_PartialMethodMustReturnVoid
source: Partial methods must have a void return type
de: Partielle Methoden müssen einen void-Rückgabetyp haben.
es: Los métodos parciales deben tener un tipo de valor devuelto void
ko: 부분 메서드(Partial Method)의 반환 형식은 void여야 합니다.
tr: Kısmi yöntemlerin dönüş türü void olmalıdır

# ERR_UnassignedThisAutoProperty
source: Auto-implemented property '{0}' must be fully assigned before control is returned to the caller.
de: Die automatisch implementierte Eigenschaft "{0}" muss vollständig zugewiesen werden, bevor das Steuerelement an den Aufrufer zurückgegeben wird.
es: La propiedad '{0}' implementada automáticamente se debe asignar completamente antes de devolver el control al llamador.
ko: 제어가 호출자에게 반환되기 전에 자동으로 구현된 '{0}' 속성이 완전히 할당되어야 합니다.
tr: Denetimin çağırana dönmesi için otomatik uygulanan '{0}' özelliğine tam atama yapılmış olması gerekir.

# ERR_InvalidMemberDecl
source: Invalid token '{0}' in class, struct, or interface member declaration
de: Ungültiges Token "{0}" in Klassen-, Struktur- oder Schnittstellenmemberdeklaration.
es: El token '{0}' no es válido en una clase, una estructura o una declaración de miembro de interfaz
ko: 클래스, 구조체 또는 인터페이스 멤버 선언에 잘못된 '{0}' 토큰이 있습니다.
tr: Sınıf, yapı veya arabirim üye bildiriminde geçersiz belirteç '{0}'

# ERR_BadNewExpr
source: A new expression requires (), [], or {} after type
de: Für einen new-Ausdruck ist nach type (), [] oder {} erforderlich.
es: Una expresión new requiere (), [] o {} después del tipo
ko: new 식은 형식 뒤에 (), [], 또는 {}가 필요합니다.
tr: Bir new ifadesinde türden sonra (), [] veya {} gerekir

# ERR_MainClassNotClass
source: '{0}' specified for Main method must be a non-generic class, struct, or interface
de: '"{0}", angegeben für die Main-Methode, muss eine nicht generische Klasse, Struktur oder Schnittstelle sein.
es: La "{0}" especificada para el método Main debe ser una clase, estructura o interfaz no genérica
ko: Main 메서드에 지정된 '{0}'은(는) 제네릭이 아닌 클래스, 구조체 또는 인터페이스여야 합니다.
tr: Main yöntemi için belirtilen '{0}' genel olmayan sınıf, yapı veya arabirim olmalıdır

# ERR_ForEachMissingMember
source: foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance definition for '{1}'
de: Eine foreach-Anweisung kann nicht für Variablen vom Typ "{0}" verwendet werden, da "{0}" keine öffentliche Instanzendefinition für "{1}" enthält.
es: La instrucción foreach no puede funcionar en variables de tipo "{0}" porque "{0}" no contiene ninguna definición de instancia pública para "{1}"
ko: '{0}' 형식 변수에서 foreach 문을 수행할 수 없습니다. '{0}'에는 '{1}'에 대한 공용 인스턴스 정의가 없기 때문입니다.
tr: {0}' bir '{1}' ortak örnek tanımı içermediğinden veya erişilemez olduğundan foreach deyimi '{0}' türündeki değişkenlerde çalışamaz

# ERR_MethodReturnCantBeRefAny
source: Method or delegate cannot return type '{0}'
de: Die Methode oder der Delegat kann den Typ "{0}" nicht zurückgeben.
es: El método o el delegado no pueden devolver el tipo '{0}'
ko: 메서드 또는 대리자는 '{0}' 형식을 반환할 수 없습니다.
tr: Yöntem veya temsilci '{0}' türünü döndüremiyor

# ERR_AmbiguousAttribute
source: '{0}' is ambiguous between '{1}' and '{2}'; use either '@{0}' or '{0}Attribute'
de: '"{0}" ist für "{1}" und "{2}" mehrdeutig. Verwenden Sie "@{0}" oder "{0}Attribute".
es: '{0}' es ambiguo entre '{1}' y '{2}'; use '@{0}' o '{0}Attribute'
ko: '{0}'이(가) '{1}'과(와) '{2}' 사이에서 모호합니다. '@{0}' 또는 '{0}Attribute'를 사용하세요.
tr: '{0}', '{1}' ile '{2}' arasında belirsiz bir başvuru; '@{0}' veya '{0}Attribute' kullanın

# ERR_UnsafeIteratorArgType
source: Iterators cannot have unsafe parameters or yield types
de: Iteratoren dürfen keine unsicheren Parameter oder yield-Typen aufweisen.
es: Los iteradores no pueden tener parámetros no seguros o tipos yield
ko: 반복기에 안전하지 않은 매개 변수 또는 yield 형식을 사용할 수 없습니다.
tr: Yineleyicilerin unsafe parametreleri veya yield türleri olamaz

# ERR_AssgReadonly
source: A readonly field cannot be assigned to (except in a constructor of the class in which the field is defined or a variable initializer))
de: Einem schreibgeschützten Feld kann nichts zugewiesen werden (außer in einem Konstruktor der Klasse, in der das Feld definiert ist, oder in einem Variableninitialisierer).
es: No se puede asignar un campo de solo lectura (excepto en un constructor de la clase en la que se define el campo o en un inicializador de variable)
ko: 읽기 전용 필드에는 할당할 수 없습니다. 단, 필드가 정의된 클래스의 생성자 또는 변수 이니셜라이저에서는 예외입니다.
tr: Salt okunur bir alana atama yapılamaz (alanın tanımlandığı veya değişken başlatıcısı olduğu sınıfın oluşturucusunda olması dışında)

# ERR_AssignReadonlyNotField
source: Cannot assign to {0} '{1}' because it is a readonly variable
de: Eine Zuweisung zu {0} "{1}" ist nicht möglich, weil es sich um eine schreibgeschützte Variable handelt.
es: No se puede asignar a {0} "{1}" porque es una variable readonly.
ko: 읽기 전용 변수이므로 {0} '{1}'에 할당할 수 없습니다.
tr: Salt okunur değişken olduğundan {0} '{1}' hedefine atama yapılamaz

# ERR_AssignReadonlyNotField2
source: Cannot assign to a member of {0} '{1}' because it is a readonly variable
de: Eine Zuweisung zu einem Member von {0} "{1}" ist nicht möglich, weil es sich um eine schreibgeschützte Variable handelt.
es: No se puede asignar a un miembro de {0} "{1}" porque es una variable readonly.
ko: 읽기 전용 변수이므로 {0} '{1}'의 멤버에 할당할 수 없습니다.
tr: Salt okunur değişken olduğundan bir {0} '{1}' üyesine atama yapılamaz

# ERR_BadAsyncReturnExpression
source: Since this is an async method, the return expression must be of type '{0}' rather than 'Task<{0}>'
de: Da es sich um eine asynchrone Methode handelt, muss der Rückgabeausdruck vom Typ "{0}" anstelle von "Task<{0}>" sein.
es: Como este es un método asincrónico, la expresión devuelta debe ser de tipo '{0}' en lugar de 'Task<{0}>'
ko: 비동기 메서드이기 때문에 이 메서드의 반환 식은 'Task<{0}>' 형식이 아니라 '{0}' 형식이어야 합니다.
tr: Bu zaman uyumsuz bir yöntem olduğundan, dönüş ifadesi 'Task<{0}>' yerine '{0}' türünde olmalıdır

# ERR_ThisStructNotInAnonMeth
source: Anonymous methods, lambda expressions, and query expressions inside structs cannot access instance members of 'this'. Consider copying 'this' to a local variable outside the anonymous method, lambda expression or query expression and using the local instead.
de: Anonyme Methoden, Lambdaausdrücke und Abfrageausdrücke innerhalb von Strukturen können nicht auf Instanzmember von "this" zugreifen. Kopieren Sie "this" in eine lokale Variable außerhalb der anonymen Methode, des Lambdaausdrucks oder des Abfrageausdrucks, und verwenden Sie die lokale Variable.
es: Los métodos anónimos, las expresiones lambda y las expresiones de consulta incluidos en estructuras no pueden obtener acceso a miembros de instancia de 'this'. Puede copiar 'this' en una variable local fuera del método anónimo, la expresión lambda o la expresión de consulta y usar la variable local en su lugar.
ko: 구조체 안의 무명 메서드, 람다 식 및 쿼리 식은 'this'의 인스턴스 멤버에 액세스할 수 없습니다. 'this'를 무명 메서드, 람다 식 또는 쿼리 식 외부에 있는 지역 변수에 복사한 다음 이 지역 변수를 대신 사용하세요.
tr: Struct içindeki anonim yöntemler, lambda ifadeleri ve sorgu ifadeleri 'this' değişkeninin örnek üyelerine erişemez. Bunun yerine 'this' öğesini anonim yöntemin, lambda ifadesinin veya sorgu ifadesinin dışındaki yerel değişkene kopyalamayı ve yereli kullanmayı deneyin.

# ERR_BadWarningLevel
source: Warning level must be in the range 0-4
de: Die Warnstufe muss zwischen 0 und 4 liegen.
es: El nivel de advertencia debe estar en el intervalo 0-4
ko: 경고 수준은 0부터 4까지의 범위에 있어야 합니다.
tr: Uyarı düzeyi 0-4 aralığında olmalıdır

# ERR_QueryNoProviderStandard
source: Could not find an implementation of the query pattern for source type '{0}'. '{1}' not found. Are you missing a reference to 'System.Core.dll' or a using directive for 'System.Linq'?
de: Es konnte keine Implementierung des Abfragemusters für den Quelltyp "{0}" gefunden werden. "{1}" wurde nicht gefunden. Fehlt möglicherweise ein Verweis auf "System.Core.dll" oder eine Using-Direktive für "System.Linq"?
es: No se encontró ninguna implementación del patrón de consulta para el tipo de origen '{0}'. No se encontró '{1}'. ¿Falta alguna referencia a 'System.Core.dll' o alguna directiva using para 'System.Linq'?
ko: 소스 형식 '{0}'에 대해 구현된 쿼리 패턴을 찾을 수 없습니다. '{1}'을(를) 찾을 수 없습니다. 'System.Core.dll'에 대한 참조 또는 'System.Linq'에 대한 using 지시문이 있는지 확인하세요.
tr: {0}' sorgu türü için sorgu deseninin bir uygulaması bulunamadı. '{1}' bulunamadı. Bir 'System.Core.dll' başvurusunu mu unuttunuz veya bir 'System.Linq' yönergesi mi kullanıyorsunuz?

# WRN_MultipleRuntimeOverrideMatches
source: Member '{1}' overrides '{0}'. There are multiple override candidates at run-time. It is implementation dependent which method will be called.
de: Der Member "{1}" überschreibt "{0}". Zur Laufzeit sind mehrere Kandidaten zum Überschreiben verfügbar. Die aufgerufene Methode ist implementierungsabhängig.
es: El miembro '{1}' invalida '{0}'. Hay varios candidatos de invalidación en tiempo de ejecución. El método que se llamará depende de la implementación.
ko: {1}' 멤버는 '{0}'을(를) 재정의합니다. 런타임에 여러 재정의 후보가 있습니다. 호출되는 메서드는 구현에 따라 다릅니다.
tr: {1}' üyesi '{0}' öğesini geçersiz kılıyor. Çalışma zamanında birden fazla geçersiz kılma adayı var. Hangi yöntemin çağrılacağı uygulamaya bağımlıdır.

# ERR_TaskRetNoObjectRequired
source: Since '{0}' is an async method that returns 'Task', a return keyword must not be followed by an object expression. Did you intend to return 'Task<T>'?
de: Da "{0}" eine Async-Methode ist, die "Task" zurückgibt, darf nach einem Rückgabeschlüsselwort kein Objektausdruck folgen. Wollten Sie "Task<T>" zurückgeben?
es: Como '{0}' es un método asincrónico que devuelve 'Task', una palabra clave return no debe ir seguida de una expresión de objeto. ¿Intentó devolver 'Task<T>'?
ko: {0}'이(가) 'Task'를 반환하는 비동기 메서드이므로 return 키워드 뒤에 개체 식이 나오면 안 됩니다. 'Task<T>'를 반환하려고 했습니까?
tr: {0}' 'Task' döndüren zaman uyumsuz bir yöntem olduğundan, dönüş anahtar sözcüğü bir nesne ifadesi tarafından izlenmemelidir. 'Task<T>' döndürmek mi istiyordunuz?

# ERR_UnsafeAsyncArgType
source: Async methods cannot have unsafe parameters or return types
de: Async-Methoden dürfen über keine unsicheren Parameter oder Rückgabetypen verfügen.
es: Los métodos asincrónicos no pueden tener parámetros no seguros o tipos de valor devuelto
ko: 비동기 메서드에는 안전하지 않은 매개 변수 또는 반환 형식을 사용할 수 없습니다.
tr: Zaman uyumsuz yöntemlerin güvenli olmayan parametreleri veya dönüş türleri olamaz

# ERR_BadSpecialByRefLocal
source: Parameters or locals of type '{0}' cannot be declared in async methods or lambda expressions.
de: Parameter oder lokale Variablen des Typs "{0}" können nicht in Async-Methoden oder Lambdaausdrücken deklariert werden.
es: Los parámetros o las variables locales de tipo '{0}' no se pueden declarar en métodos asincrónicos o expresiones lambda.
ko: {0}' 형식의 매개 변수 또는 로컬은 비동기 메서드나 람다 식에서 선언할 수 없습니다.
tr: Zaman uyumsuz yöntemlerde veya lambda ifadelerinde '{0}' türündeki parametrelerin veya yerel öğelerin bildirimi yapılamaz

# WRN_MainIgnored
source: The entry point of the program is global script code; ignoring '{0}' entry point.
de: Der Einstiegspunkt des Programms ist globaler Skriptcode. Der Einstiegspunkt "{0}" wird ignoriert.
es: El punto de entrada del programa es código de script global: se omite el punto de entrada '{0}'.
ko: 프로그램의 진입점은 전역 스크립트 코드이므로 '{0}' 진입점을 무시합니다.
tr: Programın giriş noktası genel betik kodudur; '{0}' giriş noktası yoksayılıyor.

# WRN_MainIgnored_Title
source: The entry point of the program is global script code; ignoring entry point
de: Der Einstiegspunkt des Programms ist globaler Skriptcode; der Einstiegspunkt wird ignoriert.
es: El punto de entrada del programa es código de script global. Ignorando punto de entrada
ko: 프로그램의 진입점이 전역 스크립트 코드이며 진입점을 무시함
tr: Programın giriş noktası genel betik kodudur, giriş noktası yoksayılıyor

# ERR_StaticInAsOrIs
source: The second operand of an 'is' or 'as' operator may not be static type '{0}'
de: Der zweite Operand eines is- oder as-Operators darf nicht den statischen Typ "{0}" aufweisen.
es: El segundo operando de un operador 'is' o 'as' no puede ser el tipo estático '{0}'
ko: is' 또는 'as' 연산자의 두 번째 피연산자는 '{0}' 정적 형식일 수 없습니다.
tr: Bir 'is' veya 'as' işlecinin ikinci işleneni '{0}' statik türü olmayabilir

# ERR_InvalidVersionFormat
source: The specified version string does not conform to the required format - major[.minor[.build[.revision]]]
de: Die angegebene Versionszeichenfolge entspricht nicht dem erforderlichen Format: Hauptversion[.Nebenversion[.Build[.Revision]]]
es: La cadena de versión especificada no se ajusta al formato requerido: principal[.secundaria[.compilación[.revisión]]]
ko: 지정한 버전 문자열이 필요한 형식 major[.minor[.build[.revision]]]을 따르지 않습니다.
tr: Belirtilen sürüm dizesi gereken biçime uymuyor - major[.minor[.build[.revision]]]

# ERR_InvalidVersionFormatDeterministic
source: The specified version string contains wildcards, which are not compatible with determinism. Either remove wildcards from the version string, or disable determinism for this compilation
de: Die angegebene Versionszeichenfolge enthält Platzhalter, die mit Determinismus nicht kompatibel sind. Entfernen Sie die Platzhalter aus der Versionszeichenfolge, oder deaktivieren Sie Determinismus für diese Kompilierung.
es: La versión especificada contiene comodines, que no son compatibles con la determinación. Quite los comodines de la cadena de versión o deshabilite la determinación para esta compilación.
ko: 지정한 버전 문자열에는 결정성과 호환되지 않는 와일드카드가 포함되어 있습니다. 버전 문자열에서 와일드카드를 제거하거나 이 컴파일에 대해 결정성을 사용하지 않도록 설정하세요.
tr: Belirtilen sürüm dizesi gerekircilikle uyumlu olmayan joker karakterler içeriyor. Joker karakterleri sürüm dizesinden kaldırın veya bu derleme için gerekirciliği devre dışı bırakın

# ERR_InvalidVersionFormat2
source: The specified version string does not conform to the required format - major.minor.build.revision (without wildcards)
de: Die angegebene Versionszeichenfolge weist nicht das erforderliche Format auf: Hauptversion.Nebenversion.Build.Revision (ohne Platzhalter)
es: La cadena de versión especificada no se ajusta al formato requerido: principal.secundaria.compilación.revisión (sin comodines)
ko: 지정한 버전 문자열이 필요한 형식 major.minor.build.revision(와일드카드 없음)을 따르지 않습니다.
tr: Belirtilen sürüm dizesi gerekli biçime uygun değil - ana.ikincil.derleme.düzeltme (joker karakter olmadan)

# WRN_InvalidVersionFormat
source: The specified version string does not conform to the recommended format - major.minor.build.revision
de: Die angegebene Versionszeichenfolge entspricht nicht dem empfohlenen Format: Hauptversion.Nebenversion.Build.Revision
es: La cadena de versión especificada no se ajusta al formato recomendado: principal,secundaria,compilación,revisión
ko: 지정한 버전 문자열이 권장 형식 major.minor.build.revision을 따르지 않습니다.
tr: Belirtilen sürüm dizesi önerilen biçime uymuyor - major.minor.build.revision

# ERR_NoCorrespondingArgument
source: There is no argument given that corresponds to the required formal parameter '{0}' of '{1}'
de: Es wurde kein Argument angegeben, das dem formalen Parameter "{0}" von "{1}" entspricht.
es: No se ha dado ningún argumento que corresponda al parámetro formal requerido '{0}' de '{1}'
ko: {1}'에서 필요한 정식 매개 변수 '{0}'에 해당하는 제공된 인수가 없습니다.
tr: {1}' öğesinin gereken resmi '{0}' parametresine karşılık gelen hiçbir bağımsız değişken yok

# ERR_IteratorInInteractive
source: Yield statements may not appear at the top level in interactive code.
de: Yield-Anweisungen dürfen nicht in der obersten Ebene von interaktivem Code enthalten sein.
es: Las instrucciones yield pueden no aparecer en el nivel superior del código interactivo.
ko: Yield 문이 대화형 코드의 최상위 수준에 표시되지 않을 수 있습니다.
tr: Yield deyimleri etkileşimli kodun en üst düzeyinde görünmeyebilir.

# ERR_ByRefReturnUnsupported
source: By-reference return type 'ref {0}' is not supported.
de: Der Rückgabetyp "ref {0}" des Referenzparameters wird nicht unterstützt.
es: El tipo de valor devuelto por referencia 'ref {0}' no es compatible.
ko: by-reference 반환 형식 'ref {0}'은(는) 지원되지 않습니다.
tr: Başvuruya göre dönüş türü 'ref {0}' desteklenmiyor.

source: tree not part of compilation
de: Der Baum ist nicht Teil der Kompilierung.
es: el árbol no forma parte de la compilación
ko: 트리는 컴파일의 일부가 아닙니다.
tr: ağaç derlemenin parçası değildir

# ERR_FeatureIsUnimplemented
source: Feature '{0}' is not implemented in this compiler.
de: Das Feature "{0}" ist in diesem Compiler nicht implementiert.
es: La característica '{0}' no está implementada en este compilador.
ko: 이 컴파일러에는 '{0}' 기능이 구현되어 있지 않습니다.
tr: {0}' özelliği bu derleyicide uygulanmaz.

# ERR_TaskRetNoObjectRequiredLambda
source: Async lambda expression converted to a 'Task' returning delegate cannot return a value. Did you intend to return 'Task<T>'?
de: Ein Async-Lambdaausdruck, der in einen "Task" zurückgebenden Delegaten konvertiert wurde, kann keinen Wert zurückgeben. Wollten Sie "Task<T>" zurückgeben?
es: Una expresión lambda asincrónica convertida en un delegado que devuelve 'Task' no puede devolver un valor. ¿Intentó devolver 'Task<T>'?
ko: Task' 반환 대기자로 변환된 비동기 람다 식은 값을 반환할 수 없습니다. 'Task<T>'를 반환하려고 했습니까?
tr: Bir 'Task' döndüren temsilciye dönüştürülmüş zaman uyumsuz lambda ifadesi bir değer döndüremez. 'Task<T>' döndürmek mi istiyordunuz?

# ERR_RefReturnReadonlyLocal2Cause
source: Cannot return fields of '{0}' by reference because it is a '{1}'
de: Felder von "{0}" können nicht als Verweis zurückgegeben werden, weil es sich um ein {1}-Element handelt.
es: Los campos de '{0}' no se pueden devolver por referencia porque es un '{1}'.
ko: {0}'의 필드는 '{1}'이므로 참조로 반환할 수 없습니다.
tr: {0}' bir '{1}' olduğundan alanları başvuru ile döndürülemez

# ERR_RefReturnParameter
source: Cannot return a parameter by reference '{0}' because it is not a ref or out parameter
de: Ein Parameter kann nicht als Verweis "{0}" zurückgegeben werden, weil es sich nicht um einen ref- oder out-Parameter handelt.
es: No se pude devolver por referencia un parámetro '{0}' porque no es de tipo ref o out.
ko: {0}' 매개 변수는 ref 또는 out 매개 변수가 아니므로 참조로 반환할 수 없습니다.
tr: {0}' parametresi bir ref veya out parametresi olmadığından başvuru ile döndürülemez

# ERR_EscapeLocal
source: Cannot use local '{0}' in this context because it may expose referenced variables outside of their declaration scope
de: "{0}" (lokal) kann in diesem Kontext nicht verwendet werden, weil referenzierte Variablen dadurch möglicherweise außerhalb ihres Deklarationsbereichs verfügbar gemacht werden.
es: No se puede usar un elemento "{0}" local en este contexto porque puede exponer variables a las que se hace referencia fuera de su ámbito de declaración.
ko: 로컬 '{0}'은(는) 선언 범위 외부의 참조 변수를 노출할 수 있으므로 이 컨텍스트에서 사용할 수 없습니다.
tr: Yerel '{0}', başvurulan değişkenleri kendi bildirim kapsamı dışında kullanıma sunabileceğinden bu bağlamda kullanılamaz

# ERR_PatternNullableType
source: It is not legal to use nullable type '{0}' in a pattern; use the underlying type '{1}' instead.
de: Es ist unzulässig, den Nullable-Typ "{0}" in einem Muster zu verwenden. Verwenden Sie stattdessen den zugrunde liegenden Typ "{1}".
es: No se puede usar el tipo '{0}' que acepta valores NULL en un patrón; utilice el tipo '{1}' subyacente.
ko: 패턴에 nullable 형식 '{0}'을(를) 사용하는 것은 올바르지 않습니다. 대신 기본 형식 '{1}'을(를) 사용하세요.
tr: Boş değer atanabilir '{0}' türünün bir desende kullanılması yasaktır; bunun yerine temel alınan '{1}' türünü kullanın.

# ERR_MixedDeconstructionUnsupported
source: A deconstruction cannot mix declarations and expressions on the left-hand-side.
de: Eine Dekonstruktion kann Deklarationen und Ausdrücke auf der linken Seite nicht mischen.
es: Una deconstrucción no puede mezclar declaraciones y expresiones en el lado izquierdo.
ko: 분해는 왼쪽에 선언과 식을 혼합할 수 없습니다.
tr: Ayrıştırma deyiminin sol tarafında, bildirim ve ifadeler birlikte kullanılamaz.

# ERR_AttributesInLocalFuncDecl
source: Attributes are not allowed on local function parameters or type parameters
de: Attribute sind bei lokalen Funktionsparametern oder Typenparametern nicht zulässig.
es: No se permiten atributos en los parámetros de tipo o parámetros de funciones locales.
ko: 특성은 로컬 함수 매개 변수 또는 형식 매개 변수에서 사용할 수 없습니다.
tr: Yerel işlev parametrelerinde veya tür parametrelerinde özniteliklere izin verilmez

# ERR_InterfacesCantContainConversionOrEqualityOperators
source: Interfaces cannot contain conversion, equality, or inequality operators
de: Schnittstellen können keine Konvertierungs-, Gleichheits- oder Ungleichheitsoperatoren enthalten.
es: Las interfaces no pueden contener operadores de conversión, igualdad o desigualdad
ko: 인터페이스에는 변환, 같음 또는 같지 않음 연산자가 포함될 수 없습니다.
tr: Arabirimler dönüştürme, eşitlik veya eşitsizlik işleçleri içeremez

# ERR_DefaultInterfaceImplementationModifier
source: The modifier '{0}' is not valid for this item in C# {1}. Please use language version '{2}' or greater.
de: Der Modifizierer "{0}" ist für dieses Element in C# {1} ungültig. Verwenden Sie Sprachversion {2} oder höher.
es: El modificador "{0}" no es válido para este elemento en C# {1}. Use la versión de lenguaje "{2}" o una posterior.
ko: C# {1}의 이 항목에는 '{0}' 한정자가 유효하지 않습니다. 언어 버전 '{2}' 이상을 사용하세요.
tr: '{0}' değiştiricisi bu öğe için C# {1} sürümünde geçerli değil. Lütfen '{2}' veya daha yüksek bir dil sürümü kullanın.

# ERR_ImplicitImplementationOfNonPublicInterfaceMember
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implicitly implement a non-public member.
de: Der Schnittstellenmember "{1}" wird von "{0}" nicht implementiert. Ein nicht öffentlicher Member kann von "{2}" nicht implizit implementiert werden.
es: "{0}" no implementa el miembro de interfaz "{1}". "{2}" no puede implementar implícitamente un miembro que no sea público.
ko: '{0}'은(는) 인터페이스 멤버 '{1}'을(를) 구현하지 않습니다. '{2}'은(는) public이 아닌 멤버를 암시적으로 구현할 수 없습니다.
tr: '{0}, '{1}' arabirim üyesini uygulamıyor. '{2}' genel olmayan bir üyeyi örtük olarak uygulayamaz.

# ERR_LanguageVersionDoesNotSupportDefaultInterfaceImplementationForMember
source: '{0}' cannot implement interface member '{1}' in type '{2}' because feature '{3}' is not available in C# {4}. Please use language version '{5}' or greater.
de: "{0}" kann den Schnittstellenmember "{1}" im Typ "{2}" nicht implementieren, weil das Feature "{3}" in C# {4} nicht verfügbar ist. Verwenden Sie Sprachversion {5} oder höher.
es: "{0}" no puede implementar el miembro de interfaz "{1}" en el tipo "{2}" porque la característica "{3}" no está disponible en C# {4}. Use la versión de idioma "{5}" o una posterior.
ko: '{3}' 기능을 C# {4}에서 사용할 수 없으므로 '{0}'이(가) '{2}' 형식의 인터페이스 멤버 '{1}'을(를) 구현할 수 없습니다. 언어 버전 '{5}' 이상을 사용하세요.
tr: '{3}' özelliği C# {4} sürümünde kullanılamadığından '{0}', '{2}' türündeki '{1}' arabirim üyesini uygulayamaz. Lütfen '{5}' veya daha yüksek bir dil sürümü kullanın.
