Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadModifierLocation
source: Member modifier '{0}' must precede the member type and name
cs: Modifikátor členu {0} musí předcházet jeho názvu a typu.
de: Der Membermodifizierer "{0}" muss dem Membertyp und -namen vorangehen.
es: El modificador de miembro '{0}' debe ir delante del tipo y nombre de miembro
fr: La modificateur de membre '{0}' doit précéder le type et le nom de membre
it: Il modificatore del membro '{0}' deve precedere il nome e il tipo del membro
ja: メンバーの種類と名前の前にメンバー修飾子'{0}' が必要です
ko: {0}' 멤버 한정자는 멤버 형식과 이름 앞에 와야 합니다.
pl: Modyfikator składowej „{0}” musi wystąpić przed definicją typu i nazwy składowej
pt_br: Modificador de membro "{0}" deve preceder o nome e o tipo de membro
ru: Модификатор члена "{0}" должен указываться перед типом и именем члена.
tr: {0}' üye değiştiricisi üye türünden ve adından önce gelmelidir
zh_hans: 成员修饰符“{0}”必须位于成员类型和名称之前
zh_hant: 成員修飾元 '{0}' 必須在成員類型與名稱之前

# ERR_MissingArraySize
source: Array creation must have array size or array initializer
cs: Při vytváření pole musí být k dispozici velikost pole nebo inicializátor pole.
de: Für die Arrayerstellung ist eine Arraygröße oder ein Arrayinitialisierer erforderlich.
es: La creación de matriz debe disponer de un tamaño de matriz o un inicializador de matriz
fr: La création de tableau doit posséder une taille de tableau ou un initialiseur de tableau
it: Per la creazione della matrice occorre specificare la dimensione della matrice o l'inizializzatore della matrice
ja: 配列を作成するには、配列のサイズまたは配列の初期化子を指定する必要があります
ko: 배열을 만들 때에는 배열 크기 또는 배열 이니셜라이저가 있어야 합니다.
pl: Do utworzenia tablicy wymagane jest określenie rozmiaru tablicy lub inicjatora tablicy.
pt_br: A criação de matriz deve ter tamanho de matriz ou inicializador de matriz
ru: При создании массива следует указать размер массива или инициализатор массива.
tr: Dizi oluşturmak için dizi boyutu ve dizi başlatıcısı belirtilmelidir
zh_hans: 数组创建必须有数组大小或数组初始值设定项
zh_hant: 建立陣列必須有陣列大小或陣列初始設定式

# WRN_UnprocessedXMLComment
source: XML comment is not placed on a valid language element
cs: Komentář XML není umístěný v platném prvku jazyka.
de: Der XML-Kommentar ist auf keinem gültigen Sprachelement abgelegt.
es: El comentario XML no está situado en un elemento válido del idioma
fr: Le commentaire XML n'est pas placé dans un élément valide du langage
it: Il commento XML non si trova in un elemento di linguaggio valido
ja: XML コメントが有効な言語要素の中にありません
ko: XML 주석이 유효한 언어 요소에 배치되어 있지 않습니다.
pl: Komentarz XML nie został umieszczony w prawidłowym elemencie języka
pt_br: O comentário XML não está inserido em um elemento de linguagem válido
ru: За XML-комментарием не следует допустимый элемент языка
tr: XML açıklaması geçerli bir dil öğesine koyulmamış
zh_hans: XML 注释没有放在有效语言元素上
zh_hant: XML 註解沒有放置在有效的語言項目前

# WRN_UnprocessedXMLComment_Title
source: XML comment is not placed on a valid language element
cs: Komentář XML není umístěný v platném prvku jazyka.
de: Der XML-Kommentar ist auf keinem gültigen Sprachelement abgelegt.
es: El comentario XML no está situado en un elemento válido del idioma
fr: Le commentaire XML n'est pas placé dans un élément valide du langage
it: Il commento XML non si trova in un elemento di linguaggio valido
ja: XML コメントが有効な言語要素の中にありません
ko: XML 주석이 유효한 언어 요소에 배치되어 있지 않습니다.
pl: Komentarz XML nie został umieszczony w prawidłowym elemencie języka
pt_br: O comentário XML não está inserido em um elemento de linguagem válido
ru: За XML-комментарием не следует допустимый элемент языка
tr: XML açıklaması geçerli bir dil öğesine koyulmamış
zh_hans: XML 注释没有放在有效语言元素上
zh_hant: XML 註解沒有放置在有效的語言項目前

# WRN_FailedInclude
source: Unable to include XML fragment '{1}' of file '{0}' -- {2}
cs: Nejde zahrnout fragment XML {1} ze souboru {0} -- {2}
de: Das XML-Fragment "{1}" der Datei "{0}" kann nicht einbezogen werden: {2}
es: No se puede incluir el fragmento de código XML '{1}' del archivo '{0}': {2}
fr: Impossible d'inclure le fragment XML '{1}' du fichier '{0}' -- {2}
it: Non è possibile includere il frammento XML '{1}' del file '{0}' - {2}
ja: ファイル '{0}' の XML フラグメント '{1}' を含めることができません -- {2}
ko: {0}' 파일의 '{1}' XML 조각을 포함할 수 없습니다. {2}
pl: Nie można dołączyć fragmentu XML „{1}” pliku „{0}” — {2}
pt_br: Não é possível incluir fragmento XML "{1}" do arquivo "{0}" -- {2}
ru: Не удалось включить фрагмент XML "{1}" файла "{0}" — {2}.
tr: {0}' dosyasının '{1}' XML parçası eklenemiyor -- {2}
zh_hans: 无法包括文件“{0}”的 XML 段落“{1}”-- {2}
zh_hant: 無法納入檔案 '{0}' 的 XML 片段 '{1}' -- {2}

# WRN_FailedInclude_Title
source: Unable to include XML fragment
cs: Nejde zahrnout fragment XML.
de: Das XML-Fragment kann nicht eingeschlossen werden.
es: No se puede incluir el fragmento XML
fr: Impossible d'inclure le fragment XML
it: Non è possibile includere il frammento XML
ja: XML フラグメントを含めることができません
ko: XML 조각을 포함할 수 없습니다.
pl: Nie można dołączyć fragmentu XML
pt_br: Não é possível incluir fragmento XML
ru: Не удалось включить фрагмент XML
tr: XML parçası eklenemedi
zh_hans: 无法包括 XML 段落
zh_hant: 無法包含 XML 片段

# WRN_InvalidInclude
source: Invalid XML include element -- {0}
cs: Neplatný prvek direktivy include XML -- {0}
de: Ungültiges XML-Include-Element: {0}
es: Elemento de inclusión XML no válido: {0}
fr: Élément include XML non valide -- {0}
it: L'elemento di inclusione XML non è valido - {0}
ja: 無効な XML のインクルード要素です -- {0}
ko: 잘못된 XML 포함 요소입니다. {0}
pl: Nieprawidłowy element include w kodzie XML — {0}
pt_br: Elemento XML include inválido -- {0}
ru: Недопустимый элемент включения для XML — {0}
tr: Geçersiz XML ekleme öğesi -- {0}
zh_hans: 无效的 XML 包含元素 -- {0}
zh_hant: XML include 元素無效 -- {0}

# WRN_InvalidInclude_Title
source: Invalid XML include element
cs: Neplatný prvek direktivy include XML
de: Ungültiges XML-Include-Element
es: Elemento de inclusión XML no válido
fr: Élément include XML incorrect
it: L'elemento di inclusione XML non è valido
ja: 無効な XML のインクルード要素です
ko: XML 포함 요소가 잘못되었습니다.
pl: Nieprawidłowy element include w kodzie XML
pt_br: XML inválido para incluir elemento
ru: Недопустимый элемент включения для XML
tr: Geçersiz XML öğe içeriyor
zh_hans: XML 包含元素无效
zh_hant: 無效的 XML include 項目

# WRN_MissingXMLComment
source: Missing XML comment for publicly visible type or member '{0}'
cs: Komentář XML pro veřejně viditelný typ nebo člen {0} se nenašel.
de: Der XML-Kommentar für den öffentlich sichtbaren Typ oder Member "{0}" fehlt.
es: Falta el comentario XML para el tipo o miembro visible de forma pública '{0}'
fr: Commentaire XML manquant pour le type ou le membre visible publiquement '{0}'
it: Manca il commento XML per il tipo o il membro '{0}' visibile pubblicamente
ja: 公開されている型またはメンバー '{0}' の XML コメントがありません
ko: 공개된 '{0}' 멤버 또는 형식에 대한 XML 주석이 없습니다.
pl: Brak komentarza XML dla widocznego publicznie typu lub składowej „{0}”
pt_br: Comentário XML ausente para tipo publicamente visível ou membro "{0}"
ru: Отсутствует комментарий XML для публично видимого типа или члена "{0}"
tr: Genel olarak görülebilir tür veya '{0}' üyesi için XML yorumu eksik
zh_hans: 缺少对公共可见类型或成员“{0}”的 XML 注释
zh_hant: 遺漏公用可見類型或成員 '{0}' 的 XML 註解

# WRN_MissingXMLComment_Title
source: Missing XML comment for publicly visible type or member
cs: Komentář XML pro veřejně viditelný typ nebo člen se nenašel.
de: Fehledes XML-Kommentar für öffentlich sichtbaren Typ oder Element
es: Falta el comentario XML para el tipo o miembro visible públicamente
fr: Commentaire XML manquant pour le type ou le membre visible publiquement
it: Manca il commento XML per il tipo o il membro visibile pubblicamente
ja: 公開されている型またはメンバーの XML コメントがありません
ko: 공개된 형식 또는 멤버에 대한 XML 주석이 없습니다.
pl: Brak komentarza XML dla widocznego publicznie typu lub składowej
pt_br: O comentário XML ausente não foi encontrado para o tipo ou membro visível publicamente
ru: Отсутствует комментарий XML для открытого видимого типа или члена
tr: Genel olarak görülebilir tür veya üye için eksik XML açıklaması
zh_hans: 缺少对公共可见类型或成员的 XML 注释
zh_hant: 遺漏公用可見類型或成員的 XML 註解

# WRN_MissingXMLComment_Description
source: The /doc compiler option was specified, but one or more constructs did not have comments.
cs: Byla zadaná možnost kompilátoru /doc, ale nejmíň jedna konstrukce neměla komentáře.
de: Die /doc-Cmpileroption wurde angegeben, ein oder mehrere Konstrukte besitzen jedoch keine Kommentare.
es: Se especificó la opción del compilador /doc, pero una o más construcciones no tenían comentarios.
fr: L'option de compilateur /doc a été spécifiée, mais un ou plusieurs constructeurs n'avaient pas de commentaires.
it: È stata specificata l'opzione /doc del compilatore, ma per uno o più costrutti non sono disponibili commenti.
ja: /doc コンパイラ オプションが指定されましたが、1 つ以上のコンストラクトにコメントがありませんでした。
ko: /doc 컴파일러 옵션을 지정했지만 하나 이상의 구문에 주석이 없습니다.
pl: Określono opcję kompilatora /doc, ale co najmniej jedna konstrukcja nie ma komentarzy.
pt_br: A opção de compilador /doc foi especificada, mas um ou mais construtores não tinha comentários.
ru: Указан параметр компилятора /doc, но одна или несколько конструкций не содержат комментарии.
tr: /doc derleyici seçeneği belirtildi, ancak bir veya daha fazla yapının açıklaması yoktu.
zh_hans: 指定了 /doc 编译器选项，但是一个或多个构造没有注释。
zh_hant: 已指定 /doc 編譯器選項，但是一個或多個建構沒有註解。

# WRN_XMLParseIncludeError
source: Badly formed XML in included comments file -- '{0}'
cs: Chybně vytvořený kód XML v zahrnutém souboru komentáře -- {0}
de: Ungültiger XML-Code in der enthaltenen Kommentardatei: "{0}"
es: XML con formato incorrecto en el archivo de comentarios de inclusión: '{0}'
fr: Le fichier de commentaires inclus comporte du code XML incorrect -- '{0}'
it: Nel file dei commenti incluso è presente codice XML in formato non corretto: '{0}'
ja: コメント ファイルの中の XML 形式が正しくありません -- '{0}'
ko: 포함된 주석 파일에 잘못된 형식의 XML이 있습니다. '{0}'
pl: Nieprawidłowo sformułowany kod XML znajduje się w pliku komentarzy — „{0}”
pt_br: XML mal formada no arquivo de comentários incluído -- "{0}"
ru: Некорректный XML во включенном файле комментариев — "{0}".
tr: Eklenen yorumlar dosyasında kötü biçimli XML -- '{0}'
zh_hans: 所包含的注释文件中有格式错误的 XML --“{0}”
zh_hant: Include 註解檔中的 XML 格式錯誤 -- '{0}'

# WRN_XMLParseIncludeError_Title
source: Badly formed XML in included comments file
cs: Chybně vytvořený kód XML v zahrnutém souboru komentářů
de: XML-Dokument in der einbezogenen Kommentardatei weist ein ungültiges Format auf
es: Hay XML formado incorrectamente en el archivo de comentarios incluido
fr: Le fichier de commentaires inclus comporte du code XML incorrect
it: Nel file dei commenti incluso è presente codice XML in formato errato
ja: 組み込みコメント ファイルの中の XML 形式が正しくありません
ko: 포함된 주석 파일에 잘못된 형식의 XML이 있습니다.
pl: Nieprawidłowo sformułowany kod XML w pliku komentarzy
pt_br: XML malformado no arquivo de comentários incluído
ru: Неправильно сформированный XML во включенном файле комментариев
tr: Ekli açıklamalar dosyasında kötü biçimlendirilmiş XML
zh_hans: 所包含的注释文件中有格式错误的 XML
zh_hant: Include 註解檔中的 XML 格式錯誤

# ERR_BadDelArgCount
source: Delegate '{0}' does not take {1} arguments
cs: Delegát {0} nepřevezme tento počet argumentů: {1}.
de: Delegat "{0}" nimmt keine {1} Argumente an.
es: El delegado '{0}' no toma {1} argumentos
fr: Le délégué '{0}' n'accepte pas d'arguments {1}
it: Il delegato '{0}' non accetta argomenti {1}
ja: デリゲート '{0}' には引数 {1} を指定できません
ko: {0}' 대리자는 인수를 {1}개 사용하지 않습니다.
pl: Delegat „{0}” nie przyjmuje argumentów {1}
pt_br: Delegado "{0}" não obtém {1} argumentos
ru: Делегат "{0}" не принимает аргументы {1}.
tr: Temsilci '{0}', {1} bağımsız değişkenleri almaz
zh_hans: 委托“{0}”未采用 {1} 个参数
zh_hant: 委派 '{0}' 不接受 {1} 個引數

# ERR_UnexpectedSemicolon
source: Semicolon after method or accessor block is not valid
cs: Středník není platný za metodou nebo blokem přistupujícího objektu.
de: Unzulässiges Semikolon nach der Methode oder dem Accessorblock.
es: El punto y coma después del bloque de métodos o de descriptores de acceso no es válido
fr: Point-virgule non valide après un bloc de méthode ou d'accesseur
it: Non è possibile inserire un punto e virgola dopo un blocco di metodo o di funzione di accesso
ja: メソッドまたはアクセサー ブロックの後のセミコロンの使用が正しくありません
ko: 메서드 또는 접근자 블록 뒤의 세미콜론이 잘못되었습니다.
pl: Użycie średnika po bloku metody lub metody dostępu jest nieprawidłowe.
pt_br: Ponto-e-vírgula após bloco de acessador ou método não é válido
ru: Использование точки с запятой после блока метода или доступа недопустимо.
tr: Yöntem veya erişimci bloğundan sonraki noktalı virgül geçerli değil
zh_hans: 方法或访问器块后面的分号无效
zh_hant: 方法或存取子區塊後的分號無效

# ERR_MethodReturnCantBeRefAny
source: The return type of a method, delegate, or function pointer cannot be '{0}'
cs: Návratový typ metody, delegáta nebo ukazatele na funkci nemůže být {0}.
fr: Le type de retour d'une méthode, d'un délégué ou d'un pointeur de fonction ne peut pas être '{0}'
it: Il tipo restituito di un metodo, delegato o puntatore a funzione non può essere '{0}'
ja: メソッド、デリゲート、または関数ポインターの戻り値の型を '{0}' にすることはできません
pl: Typem zwracanym metody, delegata lub wskaźnika funkcji nie może być „{0}”
pt_br: O tipo de retorno de um método, de um representante ou de um ponteiro de função não pode ser '{0}'
ru: Тип возвращаемого значения метода, делегата или указателя на функцию не может иметь значение "{0}".
zh_hans: 方法、委托或函数指针的返回类型不能是“{0}”
zh_hant: 方法、委派或函式指標的傳回型別不得為 '{0}'

# ERR_CompileCancelled
source: Compilation cancelled by user
cs: Kompilaci zrušil uživatel.
de: Die Kompilierung wurde vom Benutzer abgebrochen.
es: Compilación cancelada por el usuario
fr: Compilation annulée par l'utilisateur
it: Compilazione annullata dall'utente
ja: ユーザーによりコンパイルが取り消されました
ko: 사용자가 컴파일을 취소했습니다.
pl: Kompilacja anulowana przez użytkownika
pt_br: Compilação cancelada pelo usuário
ru: Компиляция отменена пользователем.
tr: Derleme kullanıcı tarafından iptal edildi
zh_hans: 编译被用户取消
zh_hant: 使用者取消了編譯

# ERR_MethodArgCantBeRefAny
source: Cannot make reference to variable of type '{0}'
cs: Nejde vytvořit odkaz na proměnnou typu {0}.
de: Ein Verweis auf die Variable mit dem Typ "{0}" kann nicht erstellt werden.
es: No se puede establecer una referencia a una variable de tipo '{0}'
fr: Impossible de faire référence à une variable de type '{0}'
it: Non è possibile creare il riferimento alla variabile di tipo '{0}'
ja: 型 '{0}' の変数を参照できません
ko: {0}' 형식의 변수에 참조를 만들 수 없습니다.
pl: Nie można przywołać zmiennej typu „{0}”
pt_br: Não é possível fazer referência à variável do tipo "{0}"
ru: Не удается сделать ссылку на переменную типа "{0}".
tr: {0}' türünün değişkenine başvuru yapılamıyor
zh_hans: 无法引用类型为“{0}”的变量
zh_hant: 無法製作類型 '{0}' 之變數的參考

# ERR_AssgReadonlyLocal
source: Cannot assign to '{0}' because it is read-only
cs: K položce nejde přiřadit {0}, protože je jen pro čtení.
de: "{0}" ist schreibgeschützt. Eine Zuweisung ist daher nicht möglich.
es: No se puede asignar a '{0}' porque es de solo lectura
fr: Impossible d'assigner à '{0}', car il est en lecture seule
it: Non è possibile assegnare a '{0}' perché è di sola lettura
ja: 読み取り専用であるため '{0}' に割り当てできません
ko: 읽기 전용인 '{0}'에는 할당할 수 없습니다.
pl: Nie można przypisać wartości do elementu „{0}” ponieważ jest on tylko do odczytu
pt_br: Não é possível atribuir a "{0}" porque ele é somente leitura
ru: Невозможно присвоить значение "{0}", так как он доступен только для чтения.
tr: Salt okunur olduğu için '{0}' öğesine atama yapılamaz
zh_hans: 无法为“{0}”赋值，因为它是只读的
zh_hant: 無法指派給 '{0}'，因為其為唯讀

# ERR_RefReadonlyLocal
source: Cannot use '{0}' as a ref or out value because it is read-only
cs: {0} nejde použít jako hodnotu Ref nebo Out, protože je jen pro čtení.
de: "{0}" darf nicht als ref- oder out-Wert verwendet werden, weil ein Schreibschutz besteht.
es: No se puede usar '{0}' como valor out o ref porque es de solo lectura.
fr: Impossible d'utiliser '{0}' en tant que valeur ref ou out, car il est en lecture seule
it: Non è possibile usare '{0}' come valore out o ref perché è di sola lettura
ja: '{0}' は読み取り専用なので、ref 値または out 値として使用できません
ko: {0}'은(는) 읽기 전용이므로 ref 또는 out 값으로 사용할 수 없습니다.
pl: Nie można użyć elementu „{0}” jako wartości ref ani out, ponieważ jest to element tylko do odczytu
pt_br: Não é possível usar '{0}' como um valor ref ou out porque ele é somente leitura
ru: Невозможно использовать "{0}" как значение ref или out, так как он доступен только для чтения
tr: Salt okunur olduğundan '{0}' bir ref veya out değeri olarak kullanılamaz
zh_hans: “{0}”是只读的，无法用作 ref 或 out 值
zh_hant: 無法將 '{0}' 用作為 ref 或 out 值，因其為唯讀

# ERR_CantUseRequiredAttribute
source: The RequiredAttribute attribute is not permitted on C# types
cs: Atribut RequiredAttribute není povolený pro typy C#.
de: Das RequiredAttribute-Attribut ist in C#-Typen unzulässig.
es: No se permite el atributo RequiredAttribute en tipos C#
fr: L'attribut RequiredAttribute n'est pas autorisé sur les types C#
it: L'attributo RequiredAttribute non è consentito per i tipi C#
ja: 属性 RequiredAttribute は C# 型で許可されていません
ko: RequiredAttribute 특성은 C# 형식에서 허용되지 않습니다.
pl: Atrybut RequiredAttribute jest niedozwolony dla typów C#
pt_br: O atributo RequiredAttribute não é permitido em tipos C#
ru: Атрибут RequiredAttribute не разрешен для типов C#.
tr: RequiredAttribute özniteliğine C# türlerinde izin verilmiyor
zh_hans: C# 类型上不允许有 RequiredAttribute 特性
zh_hant: C# 類型上不可使用 RequiredAttribute 屬性

# ERR_NoModifiersOnAccessor
source: Modifiers cannot be placed on event accessor declarations
cs: Modifikátory nejde umístit do deklarace přistupujícího objektu události.
de: Modifizierer können nicht in Ereignisaccessordeklarationen platziert werden.
es: No se pueden colocar modificadores en declaraciones de descriptores de acceso de eventos
fr: Les modificateurs ne peuvent pas être placés sur des déclarations d'accesseurs d'événement
it: Non è possibile inserire modificatori nelle dichiarazioni delle funzioni di accesso agli eventi
ja: 修飾子をイベント アクセサー宣言に付属させることはできません
ko: 이벤트 접근자 선언에는 한정자를 추가할 수 없습니다.
pl: Nie można używać modyfikatorów w deklaracjach metod dostępu do zdarzeń.
pt_br: Modificadores não podem ser colocados em declarações de acessador de evento
ru: Модификаторы нельзя размещать в объявлениях методов доступа к событиям.
tr: Değiştiriciler olay erişimcisi bildirimlerine koyulamaz
zh_hans: 修饰符不能放置在事件访问器声明上
zh_hant: 修飾元不能置於事件存取子宣告中

# ERR_ParamsCantBeWithModifier
source: The params parameter cannot be declared as {0}
cs: Parametr params nejde deklarovat jako {0}.
de: Der params-Parameter kann nicht als "{0}" deklariert werden.
es: El parámetro params no se puede declarar como {0}.
fr: Impossible de déclarer le paramètre params en tant que {0}
it: Non è possibile dichiarare il parametro params come {0}
ja: params パラメーターは、{0} として宣言することはできません
ko: params 매개 변수는 {0}(으)로 선언될 수 없습니다.
pl: Parametr params nie może zostać zadeklarowany jako {0}
pt_br: O parâmetro params não pode ser declarado como {0}
ru: Параметр params не может объявляться с ключевым словом {0}
tr: params parametresi {0} olarak tanımlanamaz
zh_hans: params 参数不能声明为 {0}
zh_hant: params 參數不可宣告為 {0}

# ERR_ReturnNotLValue
source: Cannot modify the return value of '{0}' because it is not a variable
cs: Vrácenou hodnotu {0} nejde změnit, protože se nejedná o proměnnou.
de: Der Rückgabewert von "{0}" ist keine Variable und kann daher nicht geändert werden.
es: No se puede modificar el valor devuelto de '{0}' porque no es una variable
fr: Impossible de modifier la valeur de retour de '{0}' car il ne s'agit pas d'une variable
it: Non è possibile modificare il valore restituito di '{0}' perché non è una variabile
ja: 変数ではないため、'{0}' の戻り値を変更できません
ko: {0}'은(는) 변수가 아니므로 해당 반환 값을 수정할 수 없습니다.
pl: Nie można zmodyfikować zwracanej wartości „{0}”, ponieważ nie jest to zmienna.
pt_br: Não é possível modificar o valor de retorno "{0}" porque ele não é uma variável
ru: Не удалось изменить возвращаемое значение "{0}", т. к. оно не является переменной.
tr: Bir değişken olmadığından '{0}' öğesinin dönüş değeri değiştirilemez
zh_hans: 无法修改“{0}”的返回值，因为它不是变量
zh_hant: 無法修改 '{0}' 的傳回值，因為其非變數

# ERR_MissingCoClass
source: The managed coclass wrapper class '{0}' for interface '{1}' cannot be found (are you missing an assembly reference?)
cs: Spravovaná třída obálky coclass {0} pro rozhraní {1} se nedá najít. (Nechybí odkaz na sestavení?)
de: Die verwaltete Co-Klassen-Wrapperklasse "{0}" für die "{1}"-Schnittstelle kann nicht gefunden werden. (Möglicherweise fehlt ein Assemblyverweis.)
es: No se encuentra la clase contenedora '{0}' de la coclase administrada para la interfaz '{1}' (¿falta alguna referencia de ensamblado?)
fr: La classe wrapper de coclasse managée '{0}' pour l'interface '{1}' est introuvable (vous manque-t-il une référence d'assembly ?)
it: La classe wrapper '{0}' della coclasse gestita per l'interfaccia '{1}' non è stata trovata. Probabilmente manca un riferimento all'assembly.
ja: インターフェイス '{1}' のマネージ コクラス ラッパー クラス '{0}' が見つかりません (アセンブリ参照が存在することを確認してください)
ko: {1}' 인터페이스에 대해 관리되는 coclass 래퍼 클래스 '{0}'을(를) 찾을 수 없습니다. 어셈블리 참조가 있는지 확인하세요.
pl: Nie można znaleźć zarządzanej klasy otoki coclass „{0}” interfejsu „{1}” (brak odwołania do zestawu?)
pt_br: A classe coclass wrapper gerenciada "{0}" para a interface "{1}" não pode ser encontrada (está faltando uma referência de assembly?)
ru: Не удается найти управляемый класс-оболочку coclass "{0}" для интерфейса "{1}" (возможно, была пропущена ссылка на сборку).
tr: {1}' arabiriminin '{0}' yönetilen coclass sarmalayıcı sınıfı bulunamıyor (bir derleme başvurunuz mu eksik?)
zh_hans: 无法找到接口“{1}”的托管组件类包装器类“{0}”(是否缺少程序集引用?)
zh_hant: 找不到介面 '{1}' 的 Managed coclass 包裝函式類別 '{0}' (是否遺漏了組件參考?)

# ERR_AmbiguousAttribute
source: '{0}' is ambiguous between '{1}' and '{2}'. Either use '@{0}' or explicitly include the 'Attribute' suffix.
cs: Klíčové slovo {0} je nejednoznačné mezi hodnotami {1} a {2}. Buď použijte parametr @{0} nebo explicitně zadejte příponu Attribute.
fr: « {0} » est ambigu entre « {1} » et « {2} ». Utilisez « @{0} » ou incluez explicitement le suffixe « Attribute ».
it: '{0}' è ambiguo tra '{1}' e '{2}'. Usare '@{0}' oppure includere in modo esplicito il suffisso 'Attribute'.
ja: '{0}' が '{1}' と '{2}' の間であいまいです。' @{0}' を使用するか、'属性' サフィックスを明示的に含めてください。
pl: Element „{0}” nie jest jednoznaczny w zakresie od „{1}” do „{2}”. Użyj opcji „@{0}” lub jawnie uwzględnij sufiks „Attribute”.
pt_br: '{0}' é ambíguo entre '{1}' e '{2}'. Use '@{0}' ou inclua explicitamente o sufixo 'Attribute'.
ru: "{0}" является неоднозначным между "{1}" и "{2}". Используйте "@{0}" или явно добавьте суффикс Attribute.
zh_hans: “{1}”与“{2}”之间的“{0}”不明确。请使用“@{0}”或明确包含“属性”后缀。
zh_hant: '{0}' 在 '{1}' 和 '{2}' 之間不明確。使用 '@{0}' 或明確包含 'Attribute' 尾碼。

# ERR_BadArgExtraRef
source: Argument {0} may not be passed with the '{1}' keyword
cs: Argument {0} se nesmí předávat s klíčovým slovem {1}.
de: Das Argument "{0}" kann nicht mit dem Schlüsselwort "{1}" übergeben werden.
es: El argumento {0} no se debe pasar con la palabra clave '{1}'
fr: L'argument {0} ne doit pas être passé avec le mot clé '{1}'
it: Non è possibile passare l'argomento {0} con la parola chiave '{1}'
ja: 引数 {0} はキーワード '{1}' と共に渡すことはできません
ko: {0} 인수는 '{1}' 키워드와 함께 전달할 수 없습니다.
pl: Argumentu „{0}” nie można przekazać ze słowem kluczowym „{1}”
pt_br: O argumento {0} não deve ser transmitido com a palavra-chave '{1}'
ru: Аргумент "{0}" не должен передаваться с ключевым словом "{1}".
tr: {0} bağımsız değişkeni '{1}' anahtar sözcüğüyle geçirilemez
zh_hans: 参数 {0} 不可与关键字“{1}”一起传递
zh_hant: 傳遞引數 {0} 時不可包含 '{1}' 關鍵字
