Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_FilePathCannotBeConvertedToUtf8
source: File-local type '{0}' cannot be used because the containing file path cannot be converted into the equivalent UTF-8 byte representation. {1}
cs: Místní typ souboru {0} není možné použít, protože cestu k souboru není možné převést na ekvivalentní reprezentaci UTF-8 bajtů.{1}
fr: Impossible d’utiliser le type de fichier local '{0}', car le chemin d’accès du fichier conteneur ne peut pas être converti en représentation d’octet UTF-8 équivalente. {1}
it: Non è possibile utilizzare il tipo locale di file '{0}' perché il percorso del file contenitore non può essere convertito nella rappresentazione di byte UTF-8 equivalente. {1}
ja: ファイル ローカル型 '{0}' は、含んでいるファイル パスを同等の UTF-8 バイト表現に変換できないため使用できません。{1}
pl: Nie można użyć typu pliku lokalnego „{0}”, ponieważ zawierającej ścieżki pliku nie można przekonwertować na równoważną reprezentację bajtów UTF-8. {1}
pt_br: O tipo de arquivo local '{0}' não pode ser usado porque o caminho do arquivo que o contém não pode ser convertido na representação de byte UTF-8 equivalente. {1}
ru: Невозможно использовать локальный для файла тип "{0}", так как путь к содержащему файлу не может быть преобразован в эквивалентное байтовое представление UTF-8. {1}
zh_hans: 无法使用文件本地类型“{0}”，因为包含的文件路径无法转换为等效的 UTF-8 字节表示形式。{1}
zh_hant: 無法使用檔案-本機類型 '{0}'，因為無法將包含的檔案路徑轉換成相等的 UTF-8 位元組標記法。{1}

# ERR_FileScopedAndNormalNamespace
source: Source file can not contain both file-scoped and normal namespace declarations.
cs: Zdrojový soubor nemůže obsahovat deklarace normálních oborů názvů i oborů názvů pro celý soubor.
fr: Le fichier source ne peut pas contenir à la fois des déclarations d'espace de nom de fichier et d'espace de nom normal.
it: Il file di origine non può contenere sia dichiarazioni di spazio dei nomi normali che con ambito file.
ja: ソース ファイルには、ファイルスコープと通常の名前空間の両方の宣言を含めることはできません。
pl: Plik źródłowy nie może zawierać deklaracji przestrzeni nazw z określonym zakresem plików ani deklaracji zwykłych przestrzeni nazw.
pt_br: O arquivo de origem não pode conter declarações de namespace normal e escopo de arquivo.
ru: Исходный файл не может содержать объявления пространства имен с файловой областью и объявления обычных пространств имен одновременно.
zh_hans: 源文件不能同时包含文件范围内和普通命名空间的声明。
zh_hant: 來源檔案不能同時包含以檔案為範圍和一般的命名空間宣告。

# ERR_FileScopedNamespaceNotBeforeAllMembers
source: File-scoped namespace must precede all other members in a file.
cs: Obor názvů pro celý soubor musí předcházet všem ostatním členům v souboru.
fr: Un espace de noms de portée de fichier doit précéder tous les autres membres d’un fichier.
it: Lo spazio dei nomi con ambito file deve precedere tutti gli altri membri di un file.
ja: ファイルスコープの名前空間は、ファイル内の他のすべてのメンバーの前に指定する必要があります。
pl: Przestrzeń nazw z określonym zakresem plików musi poprzedzać wszystkie inne składowe w pliku.
pt_br: O namespace de escopo de arquivo deve preceder todos os outros membros em um arquivo.
ru: Пространство имен с файловой областью должно быть раньше всех остальных элементов в файле.
zh_hans: 文件范围内的命名空间必须位于文件中所有其他成员之前。
zh_hant: 以檔為範圍的命名空間必須在檔案中的所有其他成員之前。

# ERR_FileTypeBase
source: File-local type '{0}' cannot be used as a base type of non-file-local type '{1}'.
cs: Místní typ souboru {0} nelze použít jako základní typ místního typu souboru {1}.
fr: Le type local de fichier '{0}' ne peut pas être utilisé comme type de base de type non local de fichier '{1}'.
it: Impossibile utilizzare il tipo locale file '{0}' come tipo di base di tipo non locale '{1}'.
ja: ファイル ローカル型 '{0}' は、ファイル ローカル型 '{1}' 以外の基本データ型として使用できません。
pl: Typ pliku lokalnego „{0}” nie może być używany jako typ podstawowy typu innego niż plik lokalny „{1}”.
pt_br: O tipo local de arquivo '{0}' não pode ser usado como um tipo base de tipo não local do arquivo '{1}'.
ru: Невозможно использовать локальный для файла тип "{0}" в качестве базового типа для нелокального типа "{1}".
zh_hans: 文件本地类型 "{0}" 不能用作非文件本地类型 "{1}" 的基类型。
zh_hant: 檔案-本機類型 '{0}' 不能做為非檔案-本機類型 '{1}' 的基底類型。

# ERR_FileTypeDisallowedInSignature
source: File-local type '{0}' cannot be used in a member signature in non-file-local type '{1}'.
cs: Místní typ souboru {0} nelze použít v podpisu člena v nesouborovém místním typu{1}.
fr: Le type local de fichier '{0}' ne peut pas être utilisé dans une signature de membre dans un type non local de fichier '{1}'.
it: Impossibile utilizzare il tipo file-local '{0}' in una firma del membro nel tipo non locale di file '{1}'.
ja: ファイル ローカル型 '{0}' は、ファイル ローカル型 '{1}' 以外のメンバーの署名として使用できません。
pl: Nie można użyć typu pliku lokalnego „{0}” w sygnaturze elementu składowego w typie innym niż plik lokalny „{1}”.
pt_br: O tipo de arquivo local '{0}' não pode ser usado em uma assinatura de membro no tipo não local do arquivo '{1}'.
ru: Невозможно использовать локальный для файла тип "{0}" в подписи элемента нелокального типа "{1}".
zh_hans: 文件本地类型 "{0}" 不能在非文件本地类型 "{1}" 的成员签名中使用。
zh_hant: 檔案-本機類型 '{0}' 不能用於非檔案本機類型 '{1}' 的成員簽章。

# ERR_FileTypeNameDisallowed
source: Types and aliases cannot be named 'file'.
cs: Typy a aliasy nemůžou mít název file.
fr: Les types et alias ne peuvent pas être nommés 'fichier'.
it: I tipi e gli alias non possono essere denominati 'file'.
ja: 型とエイリアスに 'file' という名前を付けることはできません。
pl: Typy i aliasy nie mogą mieć nazwy „file”.
pt_br: Tipos e pseudônimos não podem ser chamados de 'file'.
ru: У типов и псевдонимов не может быть имя "file".
zh_hans: 类型和别名不能为 "file"。
zh_hant: 類型和別名不能命名為 'file'。

# ERR_FileTypeNested
source: File-local type '{0}' must be defined in a top level type; '{0}' is a nested type.
cs: Místní typ souboru{0}musí být definován v typu nejvyšší úrovně. „{0}“ je vnořený typ.
fr: Le type de fichier local '{0}' doit être défini dans un type de niveau supérieur; '{0}' est un type imbriqué.
it: Il tipo locale del file '{0}' deve essere definito in un tipo di primo livello; '{0}' è un tipo annidato.
ja: ファイル ローカル型 '{0}' は、最上位レベルの型で定義する必要があります。'{0}' は入れ子にされた型です。
pl: Typ pliku lokalnego „{0}” musi być zdefiniowany w typie najwyższego poziomu; „{0}” jest typem zagnieżdżonym.
pt_br: O tipo de arquivo local '{0}' deve ser definido em um tipo de nível superior; '{0}' é um tipo aninhado.
ru: Локальный для файла тип "{0}" должен быть определен в типе верхнего уровня. "{0}" является вложенным типом.
zh_hans: 文件本地类型 "{0}" 必须在顶级类型中定义; "{0}" 是嵌套类型。
zh_hant: 檔案-本機類型 '{0}' 必須在最上層類型中定義; '{0}' 是巢狀類型。

# ERR_FileTypeNoExplicitAccessibility
source: File-local type '{0}' cannot use accessibility modifiers.
cs: Místní typ souboru{0}nemůže používat modifikátory přístupnosti.
fr: Le type local de fichier '{0}' ne peut pas utiliser de modificateurs d’accessibilité.
it: Il tipo locale del file '{0}' non può usare modificatori di accessibilità.
ja: ファイル ローカル型 '{0}' はアクセシビリティ修飾子を使用することはできません。
pl: Typ pliku lokalnego „{0}” nie może używać modyfikatorów ułatwień dostępu.
pt_br: O tipo de arquivo local '{0}' não pode usar modificadores de acessibilidade.
ru: Локальный для файла тип "{0}" не может использовать модификаторы специальных возможностей.
zh_hans: 文件本地类型 "{0}" 无法使用辅助功能修饰符。
zh_hant: 檔案-本機類型 '{0}' 無法使用協助工具修飾元。

# ERR_FileTypeNonUniquePath
source: File-local type '{0}' must be declared in a file with a unique path. Path '{1}' is used in multiple files.
cs: Místní typ souboru {0} musí být deklarován v souboru s jedinečnou cestou. Cesta {1} se používá ve více souborech.
fr: Le type de fichier local '{0}' doit être déclaré dans un fichier avec un chemin d’accès unique. Le chemin d’accès '{1}' est utilisé dans plusieurs fichiers.
it: Il tipo locale di file '{0}' deve essere dichiarato in un file con un percorso univoco. Il percorso '{1}' viene usato in più file.
ja: ファイル ローカル型 '{0}' は、一意のパスを持つファイル内で宣言する必要があります。パス '{1}'は複数のファイルで使用されます。
pl: Typ pliku lokalnego „{0}” musi być zadeklarowany w pliku z unikatową ścieżką. Ścieżka „{1}” jest używana w wielu plikach.
pt_br: O tipo de arquivo local '{0}' deve ser declarado em um arquivo com um caminho único. O caminho '{1}' é usado em vários arquivos.
ru: Локальный для файла тип "{0}" должен быть объявлен в файле с уникальным путем. Путь "{1}" используется в нескольких файлах.
zh_hans: 必须在具有唯一路径的文件中声明文件本地类型“{0}”。路径“{1}”已用于多个文件。
zh_hant: 檔案-本機類型 '{0}' 必須在具有唯一路徑的檔案中宣告。路徑 '{1}' 用於多個檔案。

# ERR_FixedFieldMustNotBeRef
source: A fixed field must not be a ref field.
cs: Pevné pole nesmí být pole ref.
fr: Un champ fixe ne doit pas être un champ ref.
it: Un campo fisso non deve essere un campo ref.
ja: 固定フィールドを ref フィールドにすることはできません。
pl: Pole stałe nie może być polem referencyjnym.
pt_br: Um campo fixo não deve ser um campo ref.
ru: Фиксированное поле не должно быть полем ref.
zh_hans: 固定字段不能是 ref 字段。
zh_hant: 修正的欄位不能是 ref 欄位。

# ERR_ForEachMissingMemberWrongAsync
source: foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance or extension definition for '{1}'. Did you mean 'await foreach' rather than 'foreach'?
cs: Příkaz foreach nejde použít pro proměnné typu {0}, protože {0} neobsahuje veřejnou definici instance nebo rozšíření pro {1}. Měli jste v úmyslu await foreach místo foreach?
fr: L'instruction foreach ne peut pas fonctionner sur des variables de type '{0}', car '{0}' ne contient pas de définition d'extension ou d'instance publique pour '{1}'. Vouliez-vous dire 'await foreach' plutôt que 'foreach' ?
it: L'istruzione foreach non può funzionare con variabili di tipo '{0}' perché '{0}' non contiene una definizione di istanza o estensione pubblica per '{1}'. Si intendeva 'await foreach' invece di 'foreach'?
ja: '{0}' は '{1}' のパブリック インスタンスまたは拡張機能の定義を含んでいないため、型 '{0}' の変数に対して foreach ステートメントを使用することはできません。'foreach' ではなく 'await foreach' ですか?
pl: Instrukcja foreach nie może operować na zmiennych typu „{0}”, ponieważ typ „{0}” nie zawiera publicznego wystąpienia lub definicji rozszerzenia dla elementu „{1}”. Czy planowano użyć instrukcji „await foreach”, a nie „foreach”?
pt_br: A instrução foreach não pode operar em variáveis do tipo '{0}' porque '{0}' não contém uma definição de extensão ou de instância pública para '{1}'. Você quis dizer 'await foreach' em vez de 'foreach'?
ru: Оператор foreach не работает с переменными типа "{0}", так как "{0}" не содержит открытое определение экземпляра или расширения для "{1}" Возможно, вы имели в виду "await foreach", а не "foreach"?
zh_hans: “{0}”不包含“{1}”的公共实例或扩展定义，因此 foreach 语句不能作用于“{0}”类型的变量。是否希望使用 "await foreach" 而非 "foreach"?
zh_hant: 因為 '{0}' 不包含 '{1}' 的公用執行個體或延伸模組定義，所以 foreach 陳述式無法在型別 '{0}' 的變數上運作。您指的是 'await foreach' 而不是 'foreach' 嗎?

# ERR_FuncPtrMethMustBeStatic
source: Cannot create a function pointer for '{0}' because it is not a static method
cs: Pro {0} se nedá vytvořit ukazatel na funkci, protože to není statická metoda.
fr: Impossible de créer un pointeur de fonction pour '{0}', car il ne s'agit pas d'une méthode statique
it: Non è possibile creare un puntatore a funzione per '{0}' perché non è un metodo statico
ja: '{0}' は静的メソッドではないため、関数ポインターを作成できません
pl: Nie można utworzyć wskaźnika funkcji dla elementu „{0}”, ponieważ nie jest to metoda statyczna
pt_br: Não é possível criar um ponteiro de função para '{0}' porque ele não é um método estático
ru: Не удается создать указатель на функцию для "{0}", поскольку эта функция не является статическим методом.
zh_hans: 无法为“{0}”创建函数指针，因为它不是静态方法
zh_hant: 因為函式指標不是靜態方法，所以無法建立 '{0}' 的函式指標

# ERR_FuncPtrRefMismatch
source: Ref mismatch between '{0}' and function pointer '{1}'
cs: Mezi {0} a ukazatelem na funkci {1} se neshoduje odkaz.
fr: Incompatibilité de référence entre '{0}' et le pointeur de fonction '{1}'
it: Modificatore di riferimento non corrispondente tra '{0}' e il puntatore a funzione '{1}'
ja: '{0}' と関数ポインター '{1}' で参照が一致しません
pl: Niezgodność odwołań między metodą „{0}” a wskaźnikiem funkcji „{1}”
pt_br: Referências incompatíveis entre '{0}' e o ponteiro de função '{1}'
ru: Несоответствие ссылок между "{0}" и указателем на функцию "{1}".
zh_hans: “{0}”和函数指针“{1}”之间的引用不匹配
zh_hant: '{0}' 與函式指標 '{1}' 之間的參考不符

# ERR_FunctionPointerTypesInAttributeNotSupported
source: Using a function pointer type in this context is not supported.
cs: Použití typu ukazatele funkce v tomto kontextu není podporováno.
fr: L’utilisation d’un type de pointeur de fonction dans ce contexte n’est pas prise en charge.
it: L'uso di un tipo di puntatore a funzione in questo contesto non è supportato.
ja: このコンテキストでの関数ポインター型の使用はサポートされていません。
pl: Używanie typu wskaźnika funkcji w tym kontekście nie jest obsługiwane.
pt_br: Não há suporte para o uso de um tipo de ponteiro de função neste contexto.
ru: Использование типа указателя функции в этом контексте не поддерживается.
zh_hans: 不支持在此上下文中使用函数指针类型。
zh_hant: 不支援在此內容中使用函式指標類型。

# ERR_FunctionPointersCannotBeCalledWithNamedArguments
source: A function pointer cannot be called with named arguments.
cs: Ukazatel na funkci se nedá zavolat s pojmenovanými argumenty.
fr: Impossible d'appeler un pointeur de fonction avec des arguments nommés.
it: Non è possibile chiamare un puntatore a funzione con argomenti denominati.
ja: 関数ポインターを名前付き引数で呼び出すことはできません。
pl: Nie można wywołać wskaźnika funkcji przy użyciu argumentów nazwanych.
pt_br: Um ponteiro de função não pode ser chamado com argumentos nomeados.
ru: Невозможно вызвать указатель на функцию с именованными аргументами.
zh_hans: 不能使用命名参数调用函数指针。
zh_hant: 無法以具名引數呼叫函式指標。

# ERR_GenericConstraintNotSatisfiedInterfaceWithStaticAbstractMembers
source: The interface '{0}' cannot be used as type argument. Static member '{1}' does not have a most specific implementation in the interface.
cs: Rozhraní {0} nejde použít jako argument typu. Statický člen {1} nemá nejvíce specifickou implementaci v rozhraní.
fr: L’interface «{0}» ne peut pas être utilisée comme argument de type. Le membre statique '{1}' n’a pas d’implémentation la plus spécifique dans l’interface.
it: L'interfaccia '{0}' non può essere usata come argomenti tipo. Il membro statico '{1}' non contiene un'implementazione più specifica nell'interfaccia.
ja: インターフェイス '{0}' は型引数として使用できません。静的メンバー '{1}' は、インターフェイスに最も限定的な実装がありません。
pl: Interfejs „{0}” nie może być używany jako argument typu. Składowa statyczna „{1}” nie ma najbardziej specyficznej implementacji w interfejsie.
pt_br: A interface '{0}' não pode ser usada como argumento de tipo. O membro estático '{1}' não tem uma implementação mais específica na interface.
ru: Невозможно использовать интерфейс "{0}" в качестве аргумента типа. У статического члена "{1}" нет наиболее конкретной реализации в интерфейсе.
zh_hans: 接口 "{0}" 不能用作类型参数。静态成员 "{1}" 在接口中没有最具体的实现。
zh_hant: 介面 '{0}' 不可用做為型別引數。靜態成員 '{1}' 在介面中沒有最具體的實作。

# ERR_GlobalUsingInNamespace
source: A global using directive cannot be used in a namespace declaration.
cs: Globální direktiva using se nedá použít v deklaraci oboru názvů.
fr: Une directive using globale ne peut pas être utilisée dans une déclaration d’espace de noms.
it: Non è possibile usare una direttiva using globale in una dichiarazione dello spazio dei nomi.
ja: グローバル using ディレクティブを名前空間宣言で使用することはできません。
pl: Nie można użyć globalnych używających dyrektywy w deklaracji przestrzeni nazw.
pt_br: Uma diretiva de uso global não pode ser usada em uma declaração de namespace.
ru: Глобальную директиву using нельзя использовать в объявлении пространства имен.
zh_hans: 不能在命名空间声明中使用全局 using 指令。
zh_hant: 全域 using 指示詞不能用在命名空間宣告中。

# ERR_GlobalUsingOutOfOrder
source: A global using directive must precede all non-global using directives.
cs: Globální direktiva using musí předcházet všem direktivám using, které nejsou globální.
fr: Une directive using globale doit précéder toutes les directives using non globales.
it: Una direttiva sull'utilizzo globale deve precedere tutte le direttiva non sull'uso non globale.
ja: グローバル using ディレクティブは、すべての非グローバル using ディレクティブの前に指定する必要があります。
pl: Globalne używające dyrektywy muszą poprzedzać wszystkie nieglobalne używające dyrektywy.
pt_br: Uma diretiva de uso global deve preceder todas as diretivas de uso não global.
ru: Глобальная директива using должна предшествовать всем неглобальным директивам using.
zh_hans: 全局 using 指令必须位于所有非全局 using 指令之前。
zh_hant: 全域 using 指示詞必須在所有非全域 using 指示詞之前。

# ERR_GlobalUsingStaticFileType
source: File-local type '{0}' cannot be used in a 'global using static' directive.
cs: Místní typ souboru {0} nejde použít v direktivě „global using static“.
fr: Le type local de fichier '{0}' ne peut pas être utilisé dans une directive 'global using static'.
it: Non è possibile utilizzare il tipo file locale '{0}' in una direttiva 'global using static'.
ja: ファイル ローカル型 '{0}' は、'global using static' ディレクティブでは使用できません。
pl: Nie można użyć typu pliku lokalnego „{0}” w dyrektywie „global using static”.
pt_br: O tipo de arquivo local '{0}' não pode ser usado em uma diretiva 'global using static'.
ru: Невозможно использовать локальный для файла тип "{0}" в директиве "global using static".
zh_hans: 文件本地类型 "{0}" 不能在 "global using static" 指令中使用。
zh_hant: 檔案-本機類型 '{0}' 不能用在 'global using static' 指示詞中。

# ERR_GoToBackwardJumpOverUsingVar
source: A goto cannot jump to a location before a using declaration within the same block.
cs: Příkaz goto nemůže přejít na místo před deklarací using ve stejném bloku.
de: Mit "goto" kann nicht an eine Position vor einer using-Deklaration im selben Block gesprungen werden.
es: Una instrucción goto no puede saltar a una ubicación antes que una declaración using dentro del mismo bloque.
fr: Un goto ne peut pas accéder à un emplacement avant une déclaration using dans le même bloc.
it: Un'istruzione goto non può passare a una posizione che precede una dichiarazione using all'interno dello stesso blocco.
ja: goto は同じブロック内の using 宣言より前の位置にはジャンプできません。
ko: goto는 동일한 블록 내의 using 선언 앞 위치로 이동할 수 없습니다.
pl: Instrukcja goto nie może przechodzić do lokalizacji występującej przed deklaracją using w tym samym bloku.
pt_br: Um goto não pode saltar para um local antes de uma declaração using no mesmo bloco.
ru: Оператор goto не может переходить к расположению раньше объявления using в том же блоке.
tr: Bir goto, aynı blok içinde yer alan using bildiriminden önceki bir konuma atlayamaz.
zh_hans: goto 无法跳转到同一块中 using 声明之前的某个位置。
zh_hant: 在相同區塊內，goto 不可跳到 using 宣告前的位置。

# ERR_GoToForwardJumpOverUsingVar
source: A goto cannot jump to a location after a using declaration.
cs: Příkaz goto nemůže přejít na místo za deklarací using.
de: Mit "goto" kann nicht an eine Position hinter einer using-Deklaration gesprungen werden.
es: Una instrucción goto no puede saltar a una ubicación después de una declaración using.
fr: Un goto ne peut pas accéder à un emplacement après une déclaration using.
it: Un'istruzione goto non può passare a una posizione successiva a una dichiarazione using.
ja: goto は using 宣言より後の位置にはジャンプできません。
ko: goto는 using 선언 뒤 위치로 이동할 수 없습니다.
pl: Instrukcja goto nie może przechodzić do lokalizacji występującej po deklaracji using.
pt_br: Um goto não pode saltar para um local antes de uma declaração using.
ru: Оператор goto не может переходить к расположению после объявления using.
tr: Bir goto, using bildiriminden sonraki bir konuma atlayamaz.
zh_hans: goto 无法跳转到 using 声明后的某个位置。
zh_hant: goto 不可跳到 using 宣告後的位置。

# ERR_HiddenPositionalMember
source: The positional member '{0}' found corresponding to this parameter is hidden.
cs: Poziční člen {0}, který odpovídá tomuto parametru je skrytý.
fr: Le membre '{0}' positionnel trouvé correspondant à ce paramètre est masqué.
it: Il membro posizionale '{0}' trovato e corrispondente a questo parametro è nascosto.
ja: このパラメーターに対応する位置にあるメンバー '{0}' が非表示になっています。
pl: Odnaleziony członek pozycyjny „{0}” odpowiadający temu parametrowi jest ukryty.
pt_br: O membro posicional “{0}” encontrado correspondente a este parâmetro está oculto.
ru: Обнаруженный позиционный элемент "{0}", соответствующий этому параметру, скрыт.
zh_hans: 已隐藏找到的此参数相应位置成员“{0}”。
zh_hant: 找到之與此參數對應的「{0}」位置成員已隱藏。

# ERR_IllegalAtSequence
source: Sequence of '@' characters is not allowed. A verbatim string or identifier can only have one '@' character and a raw string cannot have any.
cs: Posloupnost znaků @ se nepovoluje. Doslovný řetězec nebo identifikátor může obsahovat pouze jeden znak @ a nezpracovaná hodnota nemůže obsahovat žádný z těchto znaků.
fr: La séquence de caractères '@' n'est pas autorisée. Une chaîne de caractères ou un identifiant verbatim ne peut comporter qu'un seul caractère '@' et une chaîne de caractères brute ne peut en comporter aucun.
it: Sequenza di caratteri '@' non consentita. Una stringa o un identificatore verbatim può contenere un solo carattere '@' e una stringa non elaborata non può contenere alcun carattere.
ja: '@' 文字のシーケンスは使用できません。逐語的文字列または識別子に使用できる '@' 文字は 1 つだけです。生文字列には何も含めることはできません。
pl: Sekwencja znaków „@” jest niedozwolona. Ciąg lub identyfikator dosłownego ciągu może zawierać tylko jeden znak „@”, a nieprzetworzony ciąg nie może zawierać żadnego znaku.
pt_br: A sequência de caracteres “@” não é permitida. Uma cadeia de caracteres verbatim ou um identificador só podem ter um caractere “@” e uma cadeia de caracteres bruta não pode ter nenhum.
ru: Последовательность символов \"@\" не разрешена. Буквальная строка или идентификатор может содержать только один символ \"@\", а необработанная строка не может содержать их вообще.
zh_hans: 不允许使用 \"@\" 字符的序列。逐字字符串或标识符只能有一个 \"@\" 字符，原始字符串不能包含任何字符。
zh_hant: 不允許 '@' 字元序列。逐字字串或識別碼只可有一個 '@' 字元，而原始字串不可有任何字元。

# ERR_IllegalSuppression
source: The suppression operator is not allowed in this context
cs: Operátor potlačení není v tomto kontextu povolený.
de: Ein Unterdrückungsoperator ist in diesem Kontext unzulässig.
es: No se permite el operador de supresión en este contexto.
fr: L'opérateur de suppression n'est pas autorisé dans ce contexte
it: L'operatore di eliminazione non è consentito in questo contesto
ja: このコンテキストでは抑制演算子が許可されていません
ko: 이 컨텍스트에서는 비표시 오류(Suppression) 연산자를 사용할 수 없습니다.
pl: Operator pominięcia jest niedozwolony w tym kontekście
pt_br: O operador de supressão não é permitido neste contexto
ru: Оператор подавления недопустим в данном контексте.
tr: Gizleme işlecine bu bağlamda izin verilmez
zh_hans: 此上下文中不允许使用抑制运算符
zh_hant: 此內容不允許隱藏項目運算子

# ERR_ImplicitConversionOperatorCantBeChecked
source: An 'implicit' user-defined conversion operator cannot be declared checked
cs: Uživatelsky definovaný operátor převodu implicit nelze deklarovat jako zaškrtnutý.
fr: Impossible de déclarer un opérateur de conversion 'implicite' défini par l’utilisateur
it: Impossibile dichiarare controllato un operatore di conversione 'implicit' definito dall'utente
ja: 'implicit' ユーザー定義変換演算子はチェック済みと宣言できません
pl: Nie można zadeklarować zaznaczonego operatora konwersji zdefiniowanego przez użytkownika „implicit”
pt_br: Um operador de conversão 'implicit' definido pelo usuário não pode ser declarado verificado
ru: Невозможно объявить определяемый пользователем оператор преобразования с параметром "implicit" как проверенный
zh_hans: 无法将“隐式”自定义转换运算符声明为已验证
zh_hant: 無法將「隱式」使用者定義轉換運算子宣告為已檢查
