Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_OutputWriteFailed
source: Could not write to output file '{0}' -- '{1}'
cs: Do výstupního souboru {0} nejde zapisovat -- {1}.
de: In die Ausgabedatei "{0}" konnte nicht geschrieben werden: "{1}"
es: No se puede escribir en el archivo de salida '{0}': '{1}'
fr: Impossible d'écrire dans le fichier de sortie '{0}' -- '{1}'
it: Non è possibile scrivere nel file di output '{0}' - '{1}'
ja: 出力ファイル '{0}' に書き込めませんでした -- '{1}'
ko: 출력 파일 '{0}'에 쓸 수 없습니다. '{1}'
pl: Nie można zapisać do pliku wyjściowego „{0}” — „{1}”
pt_br: Não foi possível gravar no arquivo de saída "{0}" -- "{1}"
ru: Не удалось произвести запись в выходной файл "{0}" — "{1}".
tr: {0}' çıkış dosyasına yazılamadı -- '{1}'
zh_hans: 未能写入输出文件“{0}”--“{1}”
zh_hant: 無法寫入輸出檔 '{0}' -- '{1}'

# ERR_MultipleEntryPoints
source: Program has more than one entry point defined. Compile with /main to specify the type that contains the entry point.
cs: Program má definovaný víc než jeden vstupní bod. V kompilaci použijte /main určující typ, který vstupní bod obsahuje.
de: Für das Programm sind mehrere Einstiegspunkte definiert. Kompilieren Sie mit /main, um den Typ anzugeben, der den Einstiegspunkt enthält.
es: El programa tiene más de un punto de entrada definido. Compile con /main para especificar el tipo que contiene el punto de entrada.
fr: Plusieurs points d'entrée sont définis dans le programme. Compilez avec l'option /main pour spécifier le type qui contient le point d'entrée.
it: Nel programma è definito più di un punto di ingresso. Compilare con /main per specificare il tipo contenente il punto di ingresso.
ja: プログラムで複数のエントリ ポイントが定義されています。エントリ ポイントを含む型を指定するには、/main でコンパイルしてください。
ko: 프로그램에 진입점이 두 개 이상 정의되어 있습니다. /main으로 컴파일하여 진입점이 포함된 형식을 지정하세요.
pl: W programie zdefiniowano więcej niż jeden punkt wejścia. Skompiluj z opcją /main, aby określić typ zawierający punkt wejścia.
pt_br: Programa tem mais de um ponto de entrada definido. Compilar com /main para especificar o tipo que contém o ponto de entrada.
ru: Для программы определено несколько точек входа. Компиляция с /main позволит указать тип, содержащий точку входа.
tr: Programda birden fazla giriş noktası tanımlanmış. Giriş noktasını içeren türü belirtmek için /main ile derleyin.
zh_hans: 程序定义了多个入口点。使用 /main (指定包含入口点的类型)进行编译。
zh_hant: 程式已定義了一個以上的進入點。請以 /main 進行編譯，以指定包含進入點的類型。

# ERR_BadBinaryOps
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}'
cs: Operátor {0} nejde použít na operandy typu {1} a {2}.
de: Der {0}-Operator kann nicht auf Operanden vom Typ "{1}" und "{2}" angewendet werden.
es: El operador '{0}' no se puede aplicar a operandos del tipo '{1}' y '{2}'
fr: Impossible d'appliquer l'opérateur '{0}' aux opérandes de type '{1}' et '{2}'
it: Non è possibile applicare l'operatore '{0}' a operandi di tipo '{1}' e '{2}'
ja: 演算子 '{0}' を '{1}' と '{2}' 型のオペランドに適用することはできません
ko: {0}' 연산자는 '{1}' 및 '{2}' 형식의 피연산자에 적용할 수 없습니다.
pl: Nie można zastosować operatora „{0}” do argumentów operacji typu „{1}” lub „{2}”.
pt_br: O operador "{0}" não pode ser aplicado a operandos dos tipos "{1}" e "{2}"
ru: Оператор "{0}" невозможно применить к операнду типа "{1}" и "{2}".
tr: {0}' işleci '{1}' ve '{2}' türündeki işlenenlere uygulanamaz
zh_hans: 运算符“{0}”无法应用于“{1}”和“{2}”类型的操作数
zh_hant: 運算子 '{0}' 不可套用至類型為 '{1}' 和 '{2}' 的運算元

# ERR_IntDivByZero
source: Division by constant zero
cs: Dělení nulovou konstantou
de: Division durch Konstante 0 (null).
es: División entre constante cero
fr: Division par zéro constant
it: Divisione per la costante zero
ja: 定数 0 による除算です
ko: 상수 0으로 나누었습니다.
pl: Dzielenie przez wartość stałą wynoszącą zero
pt_br: Divisão por zero constante
ru: Деление на константу, равную нулю
tr: Sıfır sabitine bölme
zh_hans: 被常数零除
zh_hant: 除以常數零

# ERR_BadIndexLHS
source: Cannot apply indexing with [] to an expression of type '{0}'
cs: Ve výrazu typu {0} nejde použít indexování pomocí hranatých závorek ([]).
de: Eine Indizierung mit [] kann nicht auf einen Ausdruck vom Typ "{0}" angewendet werden.
es: No se puede aplicar la indización con [] a una expresión del tipo '{0}'
fr: Impossible d'appliquer l'indexation à l'aide de [] à une expression de type '{0}'
it: Non è possibile applicare l'indicizzazione con [] a un'espressione di tipo '{0}'
ja: 角かっこ [] 付きインデックスを '{0}' 型の式に適用することはできません
ko: []을 사용하는 인덱싱을 '{0}' 형식의 식에 적용할 수 없습니다.
pl: Do wyrażenia typu „{0}” nie można zastosować indeksowania przy użyciu konstrukcji [].
pt_br: Não é possível aplicar a indexação com [] a uma expressão do tipo "{0}"
ru: Не удается применить индексирование через [] к выражению типа "{0}".
tr: {0}' türündeki bir ifadeye [] ile indis erişimi uygulanamaz
zh_hans: 无法将带 [] 的索引应用于“{0}”类型的表达式
zh_hant: 無法套用有 [] 的索引至類型為 '{0}' 的運算式

# ERR_BadIndexCount
source: Wrong number of indices inside []; expected {0}
cs: Špatné číslo indexu uvnitř []; očekává se {0}.
de: Falsche Anzahl von Indizes in []. {0} erwartet.
es: Número incorrecto de índices dentro de []; se esperaba {0}.
fr: Nombre d'index incorrect dans [] ; {0} attendu
it: Il numero di indici in [] è errato. Il numero previsto è {0}
ja: 角かっこ [] 内のインデックス数が正しくありません。正しい数は {0} です
ko: [] 내부의 인덱스 수가 잘못되었습니다. {0}개가 필요합니다.
pl: Wewnątrz konstrukcji [] występuje niewłaściwa liczba indeksów. Oczekiwana liczba: {0}
pt_br: Número incorreto de índices dentro de []; esperado {0}
ru: Неверное число индексов в []; требуется {0}.
tr: [] içinde yanlış sayıda dizin var; {0} olması bekleniyor
zh_hans: [] 内的索引数错误，应为 {0}
zh_hant: [] 內的索引數目錯誤; 必須是 {0}

# ERR_BadUnaryOp
source: Operator '{0}' cannot be applied to operand of type '{1}'
cs: Operátor {0} nejde použít na operand typu {1}.
de: Der {0}-Operator kann nicht auf einen Operanden vom Typ "{1}" angewendet werden.
es: El operador '{0}' no se puede aplicar al operando del tipo '{1}'
fr: Impossible d'appliquer l'opérateur '{0}' à un opérande de type '{1}'
it: Non è possibile applicare l'operatore '{0}' all'operando di tipo '{1}'
ja: 演算子 '{0}' は '{1}' 型のオペランドに適用できません
ko: {0}' 연산자는 '{1}' 형식의 피연산자에 적용할 수 없습니다.
pl: Nie można zastosować operatora „{0}” do argumentu operacji typu „{1}”.
pt_br: O operador "{0}" não pode ser aplicado ao operando do tipo "{1}"
ru: Оператор "{0}" невозможно применить к операнду типа "{1}".
tr: {0}' işleci '{1}' türündeki işlenene uygulanamaz
zh_hans: 运算符“{0}”无法应用于“{1}”类型的操作数
zh_hant: 運算子 '{0}' 不可套用至類型為 '{1}' 的運算元

# ERR_ThisInStaticMeth
source: Keyword 'this' is not valid in a static property, static method, or static field initializer
cs: Klíčové slovo this není platné ve statické vlastnosti, ve statické metodě ani ve statickém inicializátoru pole.
de: Das this-Schlüsselwort ist in einer statischen Eigenschaft/Methode oder einem statischen Feldinitialisierer nicht gültig.
es: La palabra clave 'this' no es válida en una propiedad, método o inicializador de campo estáticos
fr: Le mot clé 'this' n'est pas valide dans un initialiseur de propriété statique, de méthode statique ou de champ statique
it: La parola chiave 'this' non può essere utilizzata in una proprietà statica, in un metodo statico o nell'inizializzatore di un campo statico
ja: キーワード 'this' は、静的プロパティ、静的メソッド、または静的フィールド初期化子では無効です
ko: 정적 속성, 정적 메서드 또는 정적 필드 이니셜라이저에는 'this' 키워드를 사용할 수 없습니다.
pl: W przypadku statycznej właściwości, statycznej metody lub statycznego inicjatora pola użycie słowa kluczowego „this” jest nieprawidłowe
pt_br: A palavra-chave 'this' não é válida em uma propriedade, um método ou um inicializador de campo estático
ru: Ключевое слово "this" не может использоваться в инициализаторах статических свойств, методов или полей.
tr: this' anahtar sözcüğü statik özellikte, statik yöntemde veya statik alan başlatıcısında geçerli değildir
zh_hans: 关键字 "this" 在静态属性、静态方法或静态字段初始值设定项中无效
zh_hant: 關鍵字 'this' 在靜態屬性、靜態方法或靜態欄位初始設定式中無效

# ERR_ThisInBadContext
source: Keyword 'this' is not available in the current context
cs: Klíčové slovo this není v aktuálním kontextu k dispozici.
de: Das this-Schlüsselwort ist im aktuellen Kontext nicht verfügbar.
es: La palabra clave 'this' no está disponible en el contexto actual
fr: Le mot clé 'this' n'est pas disponible dans le contexte actuel
it: La parola chiave 'this' non è disponibile nel contesto corrente
ja: キーワード 'this' は現在のコンテキストでは使用できません
ko: 현재 컨텍스트에서는 'this' 키워드를 사용할 수 없습니다.
pl: W bieżącym kontekście słowo kluczowe „this” jest niedostępne
pt_br: A palavra-chave 'this' não está disponível no contexto atual
ru: Ключевое слово "this" неприменимо в текущем контексте.
tr: this' anahtar sözcüğü bu bağlamda kullanılamaz
zh_hans: 关键字 "this" 在当前上下文中不可用
zh_hant: 關鍵字 'this' 在目前內容中無法使用

# WRN_InvalidMainSig
source: '{0}' has the wrong signature to be an entry point
cs: {0} nemá správný podpis, takže nemůže být vstupním bodem.
de: '"{0}" hat die falsche Signatur, um ein Einstiegspunkt zu sein.
es: '{0}' tiene una firma incorrecta para ser un punto de entrada
fr: '{0}' n'a pas la signature appropriée pour être un point d'entrée
it: '{0}' non può essere un punto di ingresso perché la firma è errata
ja: '{0}' で間違った認証が使われています。エントリ ポイントとして使用することはできません
ko: '{0}'의 시그니처가 잘못되어 진입점이 될 수 없습니다.
pl: 'Element „{0}” ma nieprawidłową sygnaturę i nie może być punktem wejścia
pt_br: "{0}" tem a assinatura incorreta para ser um ponto de entrada
ru: "{0}" имеет неправильную сигнатуру и не может быть точкой входа
tr: '{0}' giriş noktası olacak yanlış imzaya sahip
zh_hans: “{0}”的签名错误，不能作为入口点
zh_hant: '{0}' 的進入點簽章錯誤

# WRN_InvalidMainSig_Title
source: Method has the wrong signature to be an entry point
cs: Metoda nemá správný podpis, takže nemůže být vstupním bodem.
de: Methode weist als Einstiegspunkt die falsche Signatur auf
es: El método tiene la firma incorrecta para ser un punto de entrada
fr: La méthode n'a pas la signature appropriée pour être un point d'entrée
it: Il metodo non può essere un punto di ingresso perché la firma è errata
ja: メソッドに、エントリ ポイントになる不適切な署名があります
ko: 메서드의 서명이 잘못되어 진입점이 될 수 없습니다.
pl: Metoda ma nieprawidłową sygnaturę i nie może być punktem wejścia
pt_br: O método tem a assinatura incorreta para ser um ponto de entrada
ru: Метод содержит неправильную подпись и не может быть точкой входа
tr: Yöntemin imzası giriş noktası olmak için yanlış
zh_hans: 方法的签名错误，不能作为入口点
zh_hant: 方法的進入點簽章錯誤

# ERR_NoImplicitConv
source: Cannot implicitly convert type '{0}' to '{1}'
cs: Typ {0} nejde implicitně převést na typ {1}.
de: Der Typ "{0}" kann nicht implizit in "{1}" konvertiert werden.
es: No se puede convertir implícitamente el tipo '{0}' en '{1}'
fr: Impossible de convertir implicitement le type '{0}' en '{1}'
it: Non è possibile convertire in modo implicito il tipo '{0}' in '{1}'
ja: 型 '{0}' を '{1}' に暗黙的に変換できません
ko: 암시적으로 '{0}' 형식을 '{1}' 형식으로 변환할 수 없습니다.
pl: Nie można niejawnie przekonwertować typu „{0}” na „{1}”.
pt_br: Não é possível converter implicitamente tipo "{0}" em "{1}"
ru: Не удается неявно преобразовать тип "{0}" в "{1}".
tr: {0}' türü örtülü olarak '{1}' türüne dönüştürülemez
zh_hans: 无法将类型“{0}”隐式转换为“{1}”
zh_hant: 無法將類型 '{0}' 隱含轉換成 '{1}'

# ERR_NoExplicitConv
source: Cannot convert type '{0}' to '{1}'
cs: Typ {0} nejde převést na typ {1}.
de: Der Typ "{0}" kann nicht in "{1}" konvertiert werden.
es: No se puede convertir el tipo '{0}' en '{1}'
fr: Impossible de convertir le type '{0}' en '{1}'
it: Non è possibile convertire il tipo '{0}' in '{1}'
ja: 型 '{0}' を '{1}' に変換できません
ko: {0}' 형식을 '{1}' 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować typu „{0}” na „{1}”.
pt_br: Não é possível converter tipo "{0}" em "{1}"
ru: Не удается преобразовать тип "{0}" в "{1}"
tr: {0}' türü '{1}' olarak dönüştürülemiyor.
zh_hans: 无法将类型“{0}”转换为“{1}”
zh_hant: 無法將類型 '{0}' 轉換成 '{1}'

# ERR_ConstOutOfRange
source: Constant value '{0}' cannot be converted to a '{1}'
cs: Konstantní hodnotu {0} nejde převést na typ {1}.
de: Der Konstantenwert "{0}" kann nicht in "{1}" konvertiert werden.
es: El valor constante '{0}' no se puede convertir en '{1}'
fr: Impossible de convertir la valeur de constante '{0}' en '{1}'
it: Non è possibile convertire il valore costante '{0}' in '{1}'
ja: 定数値 '{0}' を '{1}' に変換できません
ko: {0}' 상수 값을 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości stałej „{0}” na „{1}”.
pt_br: O valor de constante "{0}" não pode ser convertido em "{1}"
ru: Значение константы "{0}" не может быть преобразовано в "{1}".
tr: {0}' sabit değeri bir '{1}' değerine dönüştürülemez.
zh_hans: 常量值“{0}”无法转换为“{1}”
zh_hant: 常數值 '{0}' 不可轉換成 '{1}'

# ERR_AmbigBinaryOps
source: Operator '{0}' is ambiguous on operands of type '{1}' and '{2}'
cs: Operátor {0} je nejednoznačný na operandech typu {1} a {2}.
de: Der {0}-Operator ist bei Operanden vom Typ "{1}" und "{2}" mehrdeutig.
es: El operador '{0}' es ambiguo en operandos del tipo '{1}' y '{2}'
fr: L'opérateur '{0}' est ambigu pour des opérandes de type '{1}' et '{2}'
it: L'operatore '{0}' è ambiguo su operandi di tipo '{1}' e '{2}'
ja: 型 '{1}' および '{2}' のオペランドの演算子 '{0}' があいまいです
ko: {0}' 연산자가 모호하여 '{1}' 및 '{2}' 형식의 피연산자에 사용할 수 없습니다.
pl: Operator „{0}” jest niejednoznaczny dla operandów typu „{1}” i „{2}”
pt_br: O operador "{0}" é ambíguo em operandos dos tipos "{1}" e "{2}"
ru: Оператор "{0}" для операнда типа "{1}" и "{2}" является неоднозначным.
tr: {0}' işleci, '{1}' ve '{2}' türündeki işlenenler üzerinde belirsizdir
zh_hans: 运算符“{0}”对于“{1}”和“{2}”类型的操作数具有二义性
zh_hant: 運算子 '{0}' 在類型為 '{1}' 和 '{2}' 的運算元上模稜兩可

# ERR_AmbigUnaryOp
source: Operator '{0}' is ambiguous on an operand of type '{1}'
cs: Operátor {0} je nejednoznačný na operandu typu {1}.
de: Der {0}-Operator ist für einen Operanden vom Typ "{1}" mehrdeutig.
es: El operador '{0}' es ambiguo en un operando del tipo '{1}'
fr: L'opérateur '{0}' est ambigu pour un opérande de type '{1}'
it: L'operatore '{0}' è ambiguo su un operando di tipo '{1}'
ja: 演算子 '{0}' は型 '{1}' のオペランドに対してあいまいです
ko: {0}' 연산자가 모호하여 '{1}' 형식의 피연산자에 사용할 수 없습니다.
pl: Dla argumentu operacji typu „{0}” operator „{1}” jest niejednoznaczny.
pt_br: O operador "{0}" é ambíguo em um operando do tipo "{1}"
ru: Оператор "{0}" для операнда типа "{1}" является неоднозначным.
tr: {0}' işleci, '{1}' türündeki bir işlenen üzerinde belirsizdir
zh_hans: 运算符“{0}”对于“{1}”类型的操作数具有二义性
zh_hant: 運算子 '{0}' 在類型為 '{1}' 的運算元上模稜兩可

# ERR_InAttrOnOutParam
source: An out parameter cannot have the In attribute
cs: Parametr out nemůže obsahovat atribut In.
de: Ein out-Parameter kann kein In-Attribut haben.
es: Un parámetro Out no puede tener un atributo In
fr: Un paramètre out ne peut pas avoir l'attribut In
it: Un parametro out non può avere l'attributo In
ja: out パラメーターに in 属性を指定することはできません
ko: out 매개 변수에는 In 특성을 사용할 수 없습니다.
pl: W parametrze wyjściowym nie może występować atrybut wejściowy.
pt_br: Um parâmetro out não pode ter atributo In
ru: Выходной параметр не может иметь атрибут In.
tr: Bir out parametresinin In özniteliği olamaz
zh_hans: out 参数不能具有 In 特性
zh_hant: out 參數不能有 In 屬性

# ERR_ValueCantBeNull
source: Cannot convert null to '{0}' because it is a non-nullable value type
cs: Hodnotu null nejde převést na typ {0}, protože se jedná o typ, který nemůže mít hodnotu null.
de: NULL kann nicht in {0} konvertiert werden, weil es sich um einen Non-Nullable-Werttyp handelt.
es: No se puede convertir NULL en '{0}' porque es un tipo de valor que no acepta valores NULL.
fr: Impossible de convertir null en '{0}' parce qu'il s'agit d'un type valeur non-nullable
it: Non è possibile convertire Null in '{0}' perché è un tipo valore che non ammette i valori Null
ja: Null 非許容の値型であるため、Null を '{0}' に変換できません
ko: {0}'은(는) null을 허용하지 않는 값 형식이므로 null을 이 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości null na „{0}”, ponieważ jest to nienullowalny typ wartości
pt_br: Não é possível converter o valor nulo em '{0}' porque ele não é um tipo de valor não anulável
ru: Не удается преобразовать значение NULL в "{0}", поскольку этот тип значений не допускает значение NULL.
tr: Null yapılamayan bir değer türü olduğundan, null değeri '{0}' türüne dönüştürülemiyor
zh_hans: 无法将 null 转换为“{0}”，因为后者是不可为 null 的值类型
zh_hant: 無法將 null 轉換成 '{0}'，因為它是不可為 null 的實值類型

# ERR_NoExplicitBuiltinConv
source: Cannot convert type '{0}' to '{1}' via a reference conversion, boxing conversion, unboxing conversion, wrapping conversion, or null type conversion
cs: Typ {0} nejde převést na {1} prostřednictvím převodu odkazu, převodu zabalení, převodu rozbalení, převodu obálky nebo převodu s hodnotou null.
de: Der Typ "{0}" kann nicht mit einer Verweiskonvertierung, einer Boxing-Konvertierung, einer Unboxing-Konvertierung, einer Umbruchkonvertierung oder einer NULL-Typkonvertierung in "{1}" konvertiert werden.
es: No se puede convertir el tipo '{0}' en '{1}' mediante una conversión de referencia, boxing, unboxing, de ajuste del texto o de tipo NULL
fr: Impossible de convertir le type '{0}' en '{1}' via une conversion de référence, une conversion boxing, une conversion unboxing, une conversion wrapping ou une conversion null type
it: Non è possibile convertire il tipo '{0}' in '{1}' tramite una conversione di riferimenti, una conversione boxing, una conversione unboxing, una conversione wrapping o una conversione del tipo Null
ja: 参照の変換、ボックス変換、アンボックス変換、折り返しの変換、または null 型の変換で、型 '{0}' を '{1}' に変換できません
ko: 참조 변환, boxing 변환, unboxing 변환, 래핑 변환 또는 null 형식 변환을 통해 '{0}' 형식을 '{1}'(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować typu „{0}” na „{1}” za pomocą konwersji odwołania, konwersji pakującej, konwersji rozpakowującej, konwersji opakowującej ani konwersji na typ zerowy
pt_br: Não é possível converter o tipo "{0}" para "{1}" por meio de uma conversão de referência, de boxing, de unboxing, de quebra de linha ou conversão de tipo nulo
ru: Не удается преобразовать тип "{0}" в "{1}" с помощью преобразования ссылок, упаковки-преобразования, распаковки-преобразования, преобразования в оболочку или преобразования типа Null
tr: {0}' türü başvuru dönüştürmesi, paketleme dönüştürmesi, paketi açma dönüştürmesi, sarmalama dönüştürmesi veya null türü dönüştürmesi yoluyla '{1}' türüne dönüştürülemiyor
zh_hans: 无法通过引用转换、装箱转换、取消装箱转换、包装转换或 null 类型转换将类型“{0}”转换为“{1}”
zh_hant: 無法透過參考轉換、boxing 轉換、unboxing 轉換、wrapping 轉換或 null 類型轉換，來將類型 '{0}' 轉換成 '{1}'

# FTL_DebugEmitFailure
source: Unexpected error writing debug information -- '{0}'
cs: Neočekávaná chyba při zápisu ladicích informací -- {0}
de: Unerwarteter Fehler beim Schreiben der Debuginformationen: "{0}".
es: Error inesperado al escribir la información de depuración: '{0}'
fr: Erreur inattendue lors de l'écriture des informations de débogage -- '{0}'
it: Si è verificato un errore imprevisto durante la scrittura delle informazioni di debug - '{0}'
ja: デバッグ情報の書き込み中に予期しないエラーが発生しました -- '{0}'
ko: 디버그 정보를 쓰는 동안 예기치 않은 오류가 발생했습니다. '{0}'
pl: Wystąpił nieoczekiwany błąd podczas zapisywania informacji debugowania — „{0}”
pt_br: Erro inesperado ao gravar informações de depuração -- "{0}"
ru: Неожиданная ошибка при записи информации отладки — "{0}".
tr: Hata ayıklama bilgileri yazılırken beklenmeyen hata -- '{0}'
zh_hans: 写入调试信息时出错 --“{0}”
zh_hant: 寫入偵錯資訊時發生未預期的錯誤 -- '{0}'

# ERR_BadVisReturnType
source: Inconsistent accessibility: return type '{1}' is less accessible than method '{0}'
cs: Nekonzistentní dostupnost: Typ vrácené hodnoty {1} je míň dostupný než metoda {0}.
de: Inkonsistenter Zugriff: Rückgabetyp "{1}" ist weniger zugreifbar als Methode "{0}".
es: Incoherencia de accesibilidad: el tipo de valor devuelto '{1}' es menos accesible que el método '{0}'
fr: Accessibilité incohérente : le type de retour '{1}' est moins accessible que la méthode '{0}'
it: Accessibilità incoerente: il tipo restituito '{1}' è meno accessibile del metodo '{0}'
ja: アクセシビリティに一貫性がありません。戻り値の型 '{1}' のアクセシビリティはメソッド '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 반환 형식이 '{0}' 메서드보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ zwracany „{1}” jest mniej dostępny niż metoda „{0}”
pt_br: Acessibilidade inconsistente: tipo de retorno "{1}" é menos acessível do que o método "{0}"
ru: Несогласованность по доступности: доступность возвращаемого типа "{1}" ниже доступности метода "{0}"
tr: Tutarsız erişilebilirlik: '{1}' dönüş türü, '{0}' yönteminden daha az erişilebilir
zh_hans: 可访问性不一致: 返回类型“{1}”的可访问性低于方法“{0}”
zh_hant: 不一致的存取範圍: 傳回類型 '{1}' 比方法 '{0}' 的存取範圍小

# ERR_BadVisParamType
source: Inconsistent accessibility: parameter type '{1}' is less accessible than method '{0}'
cs: Nekonzistentní dostupnost: Typ parametru {1} je míň dostupný než metoda {0}.
de: Inkonsistenter Zugriff: Parametertyp "{1}" ist weniger zugreifbar als Methode "{0}".
es: Incoherencia de accesibilidad: el tipo de parámetro '{1}' es menos accesible que el método '{0}'
fr: Accessibilité incohérente : le type de paramètre '{1}' est moins accessible que la méthode '{0}'
it: Accessibilità incoerente: il tipo parametro '{1}' è meno accessibile del metodo '{0}'
ja: アクセシビリティに一貫性がありません。パラメーター型 '{1}' のアクセシビリティはメソッド '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 매개 변수 형식이 '{0}' 메서드보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ parametru „{1}” jest mniej dostępny niż metoda „{0}”
pt_br: Acessibilidade inconsistente: tipo de parâmetro "{1}" é menos acessível do que o método "{0}"
ru: Несогласованность по доступности: доступность типа параметра "{1}" ниже доступности метода "{0}"
tr: Tutarsız erişilebilirlik: '{1}' parametre türü, '{0}' yönteminden daha az erişilebilir
zh_hans: 可访问性不一致: 参数类型“{1}”的可访问性低于方法“{0}”
zh_hant: 不一致的存取範圍: 參數類型 '{1}' 比方法 '{0}' 的存取範圍小

# ERR_BadVisFieldType
source: Inconsistent accessibility: field type '{1}' is less accessible than field '{0}'
cs: Nekonzistentní dostupnost: Typ pole {1} je míň dostupný než pole {0}.
de: Inkonsistenter Zugriff: Feldtyp "{1}" ist weniger zugreifbar als Feld "{0}".
es: Incoherencia de accesibilidad: el tipo de campo '{1}' es menos accesible que el campo '{0}'
fr: Accessibilité incohérente : le type de champ '{1}' est moins accessible que le champ '{0}'
it: Accessibilità incoerente: il tipo di campo '{1}' è meno accessibile del campo '{0}'
ja: アクセシビリティに一貫性がありません。フィールド型 '{1}' のアクセシビリティはフィールド '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 필드 형식이 '{0}' 필드보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ pola „{1}” jest mniej dostępny niż pole „{0}”
pt_br: Acessibilidade inconsistente: tipo de campo "{1}" é menos acessível do que o campo "{0}"
ru: Несогласованность по доступности: доступность типа поля "{1}" ниже доступности поля "{0}"
tr: Tutarsız erişilebilirlik: '{1}' alan türü, '{0}' alanından daha az erişilebilir
zh_hans: 可访问性不一致: 字段类型“{1}”的可访问性低于字段“{0}”
zh_hant: 不一致的存取範圍: 欄位類型 '{1}' 比欄位 '{0}' 的存取範圍小

# ERR_BadVisPropertyType
source: Inconsistent accessibility: property type '{1}' is less accessible than property '{0}'
cs: Nekonzistentní dostupnost: Typ vlastnosti {1} je míň dostupný než vlastnost {0}.
de: Inkonsistenter Zugriff: Eigenschaftentyp "{1}" ist weniger zugreifbar als Eigenschaft "{0}".
es: Incoherencia de accesibilidad: el tipo de propiedad '{1}' es menos accesible que la propiedad '{0}'
fr: Accessibilité incohérente : le type de propriété '{1}' est moins accessible que la propriété '{0}'
it: Accessibilità incoerente: il tipo di proprietà '{1}' è meno accessibile della proprietà '{0}'
ja: アクセシビリティに一貫性がありません。プロパティ型 '{1}' のアクセシビリティはプロパティ '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 속성 형식이 '{0}' 속성보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ właściwości „{1}” jest mniej dostępny niż właściwość „{0}”
pt_br: Acessibilidade inconsistente: tipo de propriedade "{1}" é menos acessível do que a propriedade "{0}"
ru: Несогласованность по доступности: доступность типа свойства "{1}" ниже доступности свойства "{0}"
tr: Tutarsız erişilebilirlik: '{1}' özellik türü, '{0}' özelliğinden daha az erişilebilir
zh_hans: 可访问性不一致: 属性类型“{1}”的可访问性低于属性“{0}”
zh_hant: 不一致的存取範圍: 屬性類型 '{1}' 比屬性 '{0}' 的存取範圍小
