Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_Return
source: return
cs: návratový
fr: de retour
it: restituito
ja: 戻り値
pl: zwracanego
pt_br: retorno
ru: возвращаемый
zh_hans: 返回
zh_hant: 傳回

# IDS_ThrowExpression
source: <throw expression>
cs: <výraz throw>
de: throw-Ausdruck
es: <expresión throw>
fr: <expression throw>
it: <espressione throw>
ja: <スロー式>
ko: <Throw 식>
pl: <wyrażenie throw>
pt_br: <expressão throw>
ru: <выражение throw>
tr: <throw ifadesi>
zh_hans: <throw 表达式>
zh_hant: <throw 運算式>

# IDS_RELATEDERROR
source: (Location of symbol related to previous error)
cs: (Umístění symbolu vzhledem k předchozí chybě)
de: (Position des Symbols für den vorherigen Fehler)
es: (Ubicación del símbolo relacionado con el error anterior)
fr: (Emplacement du symbole par rapport à l'erreur précédente)
it: (Posizione del simbolo relativo all'errore precedente)
ja: (以前のエラーに関連するシンボルの位置)
ko: (이전 오류와 관련된 기호 위치)
pl: (Lokalizacja symbolu związanego z poprzednim błędem)
pt_br: (Local do símbolo relacionado ao erro anterior)
ru: (Местоположение символа, связанного с предыдущей ошибкой)
tr: (Önceki hatayla ilgili sembolün konumu)
zh_hans: (与前一个错误相关的符号位置)
zh_hant: (與之前錯誤相關符號的位置)

# IDS_RELATEDWARNING
source: (Location of symbol related to previous warning)
cs: (Umístění symbolu vzhledem k předchozímu upozornění)
de: (Position des Symbols für die vorherige Warnung)
es: (Ubicación del símbolo relacionado con la advertencia anterior)
fr: (Emplacement du symbole par rapport à l'avertissement précédent)
it: (Posizione del simbolo relativo all'avviso precedente)
ja: (以前のエラーに関連する警告の位置)
ko: (이전 경고와 관련된 기호 위치)
pl: (Lokalizacja symbolu związanego z poprzednim ostrzeżeniem)
pt_br: (Local do símbolo relacionado ao aviso anterior)
ru: (Местоположение символа, связанного с предыдущим предупреждением)
tr: (Önceki uyarıyla ilgili sembolün konumu)
zh_hans: (与前一个警告相关的符号位置)
zh_hant: (與之前警告相關符號的位置)

# IDS_TopLevelStatements
source: top-level statements
cs: příkazy nejvyšší úrovně
fr: instructions de niveau supérieur
it: istruzioni di primo livello
ja: トップレベルのステートメント
pl: instrukcje najwyższego poziomu
pt_br: instruções de nível superior
ru: инструкции верхнего уровня
zh_hans: 顶级语句
zh_hant: 最上層陳述式

# IDS_XMLIGNORED2
source: Badly formed XML file "{0}" cannot be included
cs: Chybně vytvořený soubor XML {0} nejde zahrnout.
de: Ungültiger XML-Code. Datei "{0}" kann nicht einbezogen werden.
es: El archivo XML con formato incorrecto "{0}" no se puede incluir
fr: Impossible d'inclure le fichier XML "{0}" incorrect
it: Il formato XML non è valido. Non è possibile includere il file "{0}"
ja: XML ファイル "{0}" の形式が正しくないため、含めることができません
ko: 잘못된 형식의 XML 파일 "{0}"을(를) 포함할 수 없습니다.
pl: Nie można dołączyć nieprawidłowo sformułowanego pliku XML „{0}”
pt_br: Arquivo XML mal formado "{0}" não pode ser incluído
ru: Невозможно включить некорректный файл XML "{0}".
tr: Kötü biçimli XML dosyası "{0}" eklenemez
zh_hans: 无法包括格式错误的 XML 文件“{0}”
zh_hant: 無法納入格式錯誤的 XML 檔 "{0}"

# IDS_XMLFAILEDINCLUDE
source: Failed to insert some or all of included XML
cs: Vložení části nebo veškerého zahrnutého kódu XML se nezdařilo.
de: Der enthaltene XML-Abschnitt konnte nur teilweise oder gar nicht eingefügt werden.
es: Error al insertar algunos de los XML de inclusión o todos ellos
fr: Impossible d'insérer tout ou partie du code XML inclus
it: Non è stato possibile inserire alcuni o tutti gli XML inclusi
ja: 含められている XML のいくつか、またはすべてを挿入できませんでした
ko: 포함된 XML의 일부 또는 전부를 삽입하지 못했습니다.
pl: Nie można wstawić części lub całości dołączonego kodu XML
pt_br: Falha ao inserir alguns ou todos os XML incluídos
ru: Сбой при вставке некоторых или всех включенных XML
tr: Dahil edilen XML'nin bir kısmı veya tamamı eklenemedi
zh_hans: 未能插入某些或全部所包含的 XML
zh_hant: 無法插入某些或所有 include 的 XML

# IDS_XMLBADINCLUDE
source: Include tag is invalid
cs: Značka Include je neplatná.
de: Ungültiges Include-Tag
es: La etiqueta de inclusión no es válida
fr: Balise include non valide
it: Il tag di inclusione non è valido
ja: インクルード タグが無効です
ko: Include 태그가 잘못되었습니다.
pl: Tag Include jest nieprawidłowy
pt_br: Tag include inválida
ru: Недопустимый тег Include
tr: Include etiketi geçersiz
zh_hans: 包含标记无效
zh_hant: Include 標籤無效

# IDS_XMLNOINCLUDE
source: No matching elements were found for the following include tag
cs: Pro následující značku include se nenašly žádné vyhovující prvky.
de: Für folgendes Include-Tag wurden keine übereinstimmenden Elemente gefunden.
es: No se encontraron elementos coincidentes para la siguiente etiqueta de inclusión
fr: Aucun élément correspondant n'a été trouvé pour la balise include suivante
it: Elemento corrispondente non trovato per il seguente tag di inclusione
ja: 次のインクルード タグで一致する要素が見つかりませんでした
ko: 다음 include 태그와 짝이 맞는 요소를 찾을 수 없습니다.
pl: Dla następującego tagu Include nie znaleziono żadnych zgodnych elementów
pt_br: Nenhum elemento correspondente foi encontrado na seguinte tag include
ru: Не обнаружено элементов, соответствующих тегу include.
tr: Aşağıdaki include etiketiyle eşleşen bir öğe bulunamadı
zh_hans: 未找到下列包含标记的匹配元素
zh_hant: 找不到與下列 include 標籤相符的項目

# IDS_XMLMISSINGINCLUDEFILE
source: Missing file attribute
cs: Atribut souboru se nenašel.
de: Dateiattribut fehlt
es: Falta el atributo de archivo
fr: Attribut file manquant
it: Manca l'attributo file
ja: ファイル属性がありません
ko: 파일 특성이 없습니다.
pl: Brak atrybutu pliku
pt_br: Atributo de arquivo ausente
ru: Отсутствует атрибут file
tr: Dosya özniteliği eksik
zh_hans: 缺少文件特性
zh_hant: 遺漏檔案屬性

# IDS_XMLMISSINGINCLUDEPATH
source: Missing path attribute
cs: Atribut cesty se nenašel.
de: Pfadattribut fehlt
es: Falta el atributo 'path'
fr: Attribut path manquant
it: Manca l'attributo path
ja: パス属性がありません
ko: path 특성이 없습니다.
pl: Brak atrybutu ścieżki
pt_br: Atributo de caminho ausente
ru: Отсутствует атрибут path
tr: Yol özniteliği eksik
zh_hans: 缺少路径特性
zh_hant: 遺漏路徑屬性

# IDS_GlobalNamespace
source: <global namespace>
cs: <globální obor názvů>
de: <globaler Namespace>
es: <espacio de nombres global>
fr: <espace de noms global>
it: <spazio dei nomi globale>
ja: <グローバル名前空間>
ko: <전역 네임스페이스>
pl: <globalna przestrzeń nazw>
pt_br: <namespace global>
ru: <глобальное пространство имен>
tr: <genel ad uzayı>
zh_hans: <全局命名空间>
zh_hant: <全域命名空間>

# IDS_FeatureGenerics
source: generics
cs: obecné
de: Generika
es: genéricos
fr: génériques
ja: ジェネリック
ko: 제네릭
pl: ogólne
pt_br: genéricos
ru: универсальные типы
tr: genel türler
zh_hans: 泛型
zh_hant: 泛型

# IDS_FeatureAnonDelegates
source: anonymous methods
cs: anonymní metody
de: Anonyme Methoden
es: métodos anónimos
fr: méthodes anonymes
it: metodi anonimi
ja: 匿名メソッド
ko: 무명 메서드
pl: metody anonimowe
pt_br: métodos anônimos
ru: анонимные методы
tr: anonim yöntemler
zh_hans: 匿名方法
zh_hant: 匿名方法

# IDS_FeatureModuleAttrLoc
source: module as an attribute target specifier
cs: modul jako cílový specifikátor atributů
de: Modul als Attributzielspezifizierer
es: módulo como especificador de destino de atributo
fr: module en tant que spécificateur cible d'attribut
it: modulo come un identificatore di destinazione dell'attributo
ja: 属性ターゲット指定子としてのモジュール
ko: 모듈(특성 대상 지정자)
pl: moduł jako specyfikator elementu docelowego atrybutu
pt_br: módulo como um especificador de destino de atributo
ru: модуль как спецификатор конечного объекта атрибута
tr: öznitelik hedef belirticisi olarak modül
zh_hans: 作为特性目标说明符的模块
zh_hant: 模組做為屬性目標規範

# IDS_FeatureGlobalNamespace
source: namespace alias qualifier
cs: kvalifikátor aliasu oboru názvů
de: Namespacealias-Qualifizierer
es: calificador de alias de espacio de nombres
fr: qualificateur d'alias d'espace de noms
it: qualificatore di alias dello spazio dei nomi
ja: 名前空間のエイリアス修飾子
ko: 네임스페이스 별칭 한정자
pl: kwalifikator aliasu przestrzeni nazw
pt_br: qualificador alias de namespace
ru: квалификатор псевдонима пространства имен
tr: ad alanı diğer ad niteleyicisi
zh_hans: 命名空间别名限定符
zh_hant: 命名空間別名限定詞

# IDS_FeatureFixedBuffer
source: fixed size buffers
cs: vyrovnávací paměti pevné velikosti
de: Puffer fester Größe
es: búferes de tamaño fijo
fr: mémoires tampons de taille fixe
it: buffer a dimensione fissa
ja: 固定サイズ バッファー
ko: 고정 크기 버퍼
pl: bufory o ustalonym rozmiarze
pt_br: buffers de tamanho fixo
ru: буферы фиксированного размера
tr: sabit boyutlu arabellekler
zh_hans: 固定大小缓冲区
zh_hant: 固定大小緩衝區

# IDS_FeatureStaticClasses
source: static classes
cs: statické třídy
de: statische Klassen
es: clases estáticas
fr: classes static
it: classi statiche
ja: 静的クラス
ko: 정적 클래스
pl: klasy statyczne
pt_br: classes static
ru: статические классы
tr: statik sınıflar
zh_hans: 静态类
zh_hant: 靜態類別

# IDS_FeatureReadOnlyStructs
source: readonly structs
cs: struktury jen pro čtení
de: schreibgeschützte Strukturen
es: estructuras readonly
fr: structs en lecture seule
it: struct di sola lettura
ja: 読み取り専用の構造体
ko: 읽기 전용 구조체
pl: struktury tylko do odczytu
pt_br: structs somente leitura
ru: структуры только для чтения
tr: salt okunur yapılar
zh_hans: 只读结构
zh_hant: 唯讀結構

# IDS_FeaturePartialTypes
source: partial types
cs: částečné typy
de: partielle Typen
es: tipos parciales
fr: types partiels
it: tipi parziali
ja: partial 型
ko: 부분 형식(Partial Type)
pl: typy częściowe
pt_br: tipos parciais
ru: разделяемые типы
tr: kısmi türler
zh_hans: 分部类型
zh_hant: 部分類型

# IDS_FeatureAsync
source: async function
cs: asynchronní funkce
de: Async-Funktion
es: función asincrónica
fr: fonction async
it: funzione asincrona
ja: 非同期関数
ko: 비동기 함수
pl: funkcja async
pt_br: função assíncrona
ru: асинхронная функция
tr: zaman uyumsuz işlev
zh_hans: 异步函数
zh_hant: 非同步函式

# IDS_FeatureSwitchOnBool
source: switch on boolean type
cs: přepínač založený na typu boolean
de: Schalter für booleschen Typ
es: activar tipo booleano
fr: commutateur sur type booléen
it: opzione su tipo booleano
ja: ブール型の switch
ko: 부울 형식으로 전환
pl: włącz typ wartości logicznej
pt_br: opção em tipo booleano
ru: выбор по значению логического типа
tr: boole türünde switch
zh_hans: 启用布尔值类型
zh_hant: 布林類型的參數

# IDS_MethodGroup
source: method group
cs: skupina metod
de: Methodengruppe
es: grupo de métodos
fr: groupe de méthodes
it: gruppo di metodi
ja: メソッド グループ
ko: 메서드 그룹
pl: grupa metod
pt_br: grupo de métodos
ru: группа методов
tr: yöntem grubu
zh_hans: 方法组
zh_hant: 方法群組

# IDS_AnonMethod
source: anonymous method
cs: anonymní metoda
de: anonyme Methode
es: método anónimo
fr: méthode anonyme
it: metodo anonimo
ja: 匿名メソッド
ko: 무명 메서드
pl: metoda anonimowa
pt_br: método anônimo
ru: анонимный метод
tr: anonim metot
zh_hans: 匿名方法
zh_hant: 匿名方法

# IDS_Lambda
source: lambda expression
cs: výraz lambda
de: Lambdaausdruck
es: expresión lambda
fr: expression lambda
it: espressione lambda
ja: ラムダ式
ko: 람다 식
pl: wyrażenie lambda
pt_br: expressão lambda
ru: лямбда-выражение
tr: lambda ifadesi
zh_hans: lambda 表达式
zh_hant: Lambda 運算式

# IDS_Collection
source: collection
cs: kolekce
de: Sammlung
es: colección
it: raccolta
ja: (コレクション)
ko: 컬렉션
pl: kolekcja
pt_br: coleção
ru: коллекция
tr: koleksiyon
zh_hans: 集合
zh_hant: 集合

# IDS_FeaturePropertyAccessorMods
source: access modifiers on properties
cs: modifikátory přístupu pro vlastnosti
de: Zugriffsmodifizierer für Eigenschaften
es: modificadores de acceso en propiedades
fr: modificateurs d'accès sur des propriétés
it: modificatori di accesso sulle proprietà
ja: プロパティのアクセス修飾子
ko: 속성에 대한 액세스 한정자
pl: modyfikatory dostępu we właściwościach
pt_br: modificadores de acesso nas propriedades
ru: модификаторы доступа в свойствах
tr: özelliklerdeki erişim değiştiricileri
zh_hans: 属性的访问修饰符
zh_hant: 屬性的存取修飾詞

# IDS_FeatureExternAlias
source: extern alias
cs: externí alias
de: externer Alias
es: alias externo
fr: alias extern
it: alias extern
ja: extern エイリアス
ko: extern 별칭
pl: alias zewnętrzny
pt_br: alias externo
ru: внешний псевдоним
tr: extern diğer adı
zh_hans: 外部别名
zh_hant: 外部別名

# IDS_FeatureIterators
source: iterators
cs: iterátory
de: Iteratoren
es: iteradores
fr: itérateurs
it: iteratori
ja: 反復子
ko: 반복기
pl: iteratory
pt_br: iteradores
ru: итераторы
tr: yineleyiciler
zh_hans: 迭代器
zh_hant: 迭代器

# IDS_FeatureDefault
source: default operator
cs: výchozí operátor
de: Standardoperator
es: operador predeterminado
fr: opérateur par défaut
it: operatore predefinito
ja: 既定の演算子
ko: 기본 연산자
pl: operator domyślny
pt_br: operador padrão
ru: оператор по умолчанию
tr: varsayılan işleç
zh_hans: 默认运算符
zh_hant: 預設運算子

# IDS_FeatureDefaultLiteral
source: default literal
cs: výchozí literál
de: Standardliteral
es: literal predeterminado
fr: littéral par défaut
it: valore letterale predefinito
ja: 既定のリテラル
ko: 기본 리터럴
pl: domyślny literał
pt_br: literal padrão
ru: литерал по умолчанию
tr: varsayılan sabit değer
zh_hans: default 字面量
zh_hant: 預設常值

# IDS_FeaturePrivateProtected
source: private protected
de: privat geschützt
pl: prywatny chroniony
pt_br: protegido de forma privada
ru: частный защищенный

# IDS_FeatureNullable
source: nullable types
cs: typy s povolenou hodnotou null
de: Typen, die NULL-Werte zulassen
es: tipos que aceptan valores NULL
fr: types Nullable
it: tipi nullable
ja: Null 許容型
ko: nullable 형식
pl: typy dopuszczające wartość null
pt_br: tipos anuláveis
ru: типы, допускающие значение NULL
tr: null yapılabilir türler
zh_hans: 可以为 null 的类型
zh_hant: 可為 Null 的類型

# IDS_FeaturePatternMatching
source: pattern matching
cs: porovnávání vzorů
de: Musterabgleich
es: coincidencia de patrones
fr: critères spéciaux
it: criteri di ricerca
ja: パターン マッチング
ko: 패턴 일치
pl: dopasowanie wzorca
pt_br: correspondência de padrões
ru: сопоставление шаблону
tr: desen eşleştirme
zh_hans: 模式匹配
zh_hant: 模式比對

# IDS_FeatureExpressionBodiedAccessor
source: expression body property accessor
cs: přístupový objekt vlastnosti textu výrazu
de: Eigenschaftszugriffsmethode für Ausdruckskörper
es: descriptor de acceso de propiedades del cuerpo de expresión
fr: accesseur de propriété du corps d'expression
it: funzione di accesso alla proprietà del corpo dell'espressione
ja: 式本体のプロパティ アクセサー
ko: 식 본문 속성 접근자
pl: metoda dostępu właściwości treści wyrażenia
pt_br: acessador da propriedade do corpo da expressão
ru: метод доступа к свойству тела выражения
tr: ifade gövdesi özellik erişimcisi
zh_hans: 表达式主体属性访问器
zh_hant: 運算式主體屬性存取子

# IDS_FeatureExpressionBodiedDeOrConstructor
source: expression body constructor and destructor
cs: konstruktor a destruktor textu výrazu
de: Konstruktor und Destruktor für Ausdruckskörper
es: constructor y destructor del cuerpo de expresión
fr: constructeur et destructeur du corps d'expression
it: costruttore e decostruttore del corpo dell'espressione
ja: 式本体のコンストラクターとデストラクター
ko: 식 본문 생성자 및 소멸자
pl: konstruktor i destruktor treści wyrażenia
pt_br: destruidor e construtor do corpo da expressão
ru: конструктор и деструктор тела выражения
tr: ifade gövdesi oluşturucusu ve yıkıcısı
zh_hans: 表达式主体构造函数和析构函数
zh_hant: 運算式主體建構函式及解構函式

# IDS_FeatureThrowExpression
source: throw expression
cs: výraz throw
de: throw-Ausdruck
es: expresión throw
fr: expression throw
it: espressione throw
ja: スロー式
ko: Throw 식
pl: wyrażenie throw
pt_br: expressão throw
ru: выражение Throw
tr: throw ifadesi
zh_hans: throw 表达式
zh_hant: Throw 運算式

# IDS_FeatureImplicitArray
source: implicitly typed array
cs: implicitně typované pole
de: implizit typisiertes Array
es: matriz con tipo implícito
fr: tableau implicitement typé
it: matrice tipizzata in modo implicito
ja: 暗黙的に型指定された配列
ko: 암시적으로 형식화된 배열
pl: niejawnie typizowana tablica
pt_br: matriz digitada implicitamente
ru: неявно типизированный массив
tr: türü örtük olarak belirlenmiş dizi
zh_hans: 隐式类型的数组
zh_hant: 隱含類型陣列

# IDS_FeatureImplicitLocal
source: implicitly typed local variable
cs: implicitně typovaná lokální proměnná
de: implizit typisierte lokale Variable
es: variable local con tipo implícito
fr: variable locale implicitement typée
it: variabile locale tipizzata in modo implicito
ja: 暗黙的に型指定されたローカル変数
ko: 암시적으로 형식화된 지역 변수
pl: niejawnie typizowana zmienna lokalna
pt_br: variável local digitada implicitamente
ru: неявно типизированная локальная переменная
tr: türü örtük olarak belirlenmiş yerel değişken
zh_hans: 隐式类型的局部变量
zh_hant: 隱含類型區域變數

# IDS_FeatureAnonymousTypes
source: anonymous types
cs: anonymní typy
de: anonyme Typen
es: tipos anónimos
fr: types anonymes
it: tipi anonimi
ja: 匿名型
ko: 익명 형식
pl: typy anonimowe
pt_br: tipos anônimos
ru: анонимные типы
tr: anonim türler
zh_hans: 匿名类型
zh_hant: 匿名類型

# IDS_FeatureAutoImplementedProperties
source: automatically implemented properties
cs: automaticky implementované vlastnosti
de: automatisch implementierte Eigenschaften
es: propiedades implementadas automáticamente
fr: propriétés automatiquement implémentées
it: proprietà implementate automaticamente
ja: 自動的に実装されたプロパティ
ko: 자동으로 구현된 속성
pl: automatycznie zaimplementowane właściwości
pt_br: propriedades implementadas automaticamente
ru: автоматически реализованные свойства
tr: otomatik olarak uygulanan özellikler
zh_hans: 自动实现的属性
zh_hant: 自動實作的屬性

# IDS_FeatureReadonlyAutoImplementedProperties
source: readonly automatically implemented properties
cs: automaticky implementované vlastnosti jen pro čtení
de: Schreibgeschützte automatisch implementierte Eigenschaften
es: propiedades de solo lectura implementadas automáticamente
fr: readonly a implémenté automatiquement les propriétés
it: proprietà implementate automaticamente di sola lettura
ja: 読み取り専用の自動実装プロパティ
ko: 자동으로 구현된 읽기 전용 속성
pl: automatycznie implementowane właściwości tylko do odczytu
pt_br: propriedades somente leitura implementadas automaticamente
ru: автоматически реализуемые свойства только для чтения
tr: readonly otomatik olarak uygulanan özellikler
zh_hans: 自动实现 readonly 的属性
zh_hant: 自動實作的唯讀屬性

# IDS_FeatureObjectInitializer
source: object initializer
cs: inicializátor objektu
de: Objektinitialisierer
es: inicializador de objeto
fr: initialiseur d'objet
it: inizializzatore di oggetto
ja: オブジェクト初期化子
ko: 개체 이니셜라이저
pl: inicjator obiektu
pt_br: inicializador de objeto
ru: инициализатор объекта
tr: nesne başlatıcı
zh_hans: 对象初始值设定项
zh_hant: 物件初始設定式

# IDS_FeatureCollectionInitializer
source: collection initializer
cs: inicializátor kolekce
de: Sammlungsinitialisierer
es: inicializador de colección
fr: initialiseur de collection
it: inizializzatore di raccolta
ja: コレクション初期化子
ko: 컬렉션 이니셜라이저
pl: inicjator kolekcji
pt_br: inicializador de coleção
ru: инциализатор коллекции
tr: koleksiyon başlatıcı
zh_hans: 集合初始值设定项
zh_hant: 集合初始設定式

# IDS_FeatureQueryExpression
source: query expression
cs: výraz dotazu
de: Abfrageausdruck
es: expresión de consulta
fr: expression de requête
it: espressione di query
ja: クエリ式
ko: 쿼리 식
pl: wyrażenie zapytania
pt_br: expressão de consulta
ru: выражение запроса
tr: sorgu ifadesi
zh_hans: 查询表达式
zh_hant: 查詢運算式

# IDS_FeatureExtensionMethod
source: extension method
cs: metoda rozšíření
de: Erweiterungsmethode
es: método de extensión
fr: méthode d'extension
it: metodo di estensione
ja: 拡張メソッド
ko: 확장 메서드
pl: metoda rozszerzenia
pt_br: método de extensão
ru: метод расширения
tr: genişletme yöntemi
zh_hans: 扩展方法
zh_hant: 擴充方法

# IDS_FeaturePartialMethod
source: partial method
cs: částečná metoda
de: partielle Methode
es: método parcial
fr: méthode partielle
it: metodo parziale
ja: 部分メソッド
ko: 부분 메서드(Partial Method)
pl: metoda częściowa
pt_br: método parcial
ru: разделяемый метод
tr: kısmi yöntem
zh_hans: 分部方法
zh_hant: 部分方法

# IDS_SK_METHOD
source: method
cs: metoda
de: Methode
es: método
fr: méthode
it: metodo
ja: メソッド
ko: 메서드
pl: metoda
pt_br: método
ru: метод
tr: yöntem
zh_hans: 方法
zh_hant: 方法

# IDS_SK_TYPE
source: type
cs: typ
de: Typ
es: tipo
it: tipo
ja: 種類
ko: 형식
pl: typ
pt_br: tipo
ru: тип
tr: tür
zh_hans: 类型
zh_hant: 類型

# IDS_SK_FIELD
source: field
cs: pole
de: Feld
es: campo
fr: champ
it: campo
ja: フィールド
ko: 필드
pl: pole
pt_br: campo
ru: поле
tr: alan
zh_hans: 字段
zh_hant: 欄位

# IDS_SK_PROPERTY
source: property
cs: vlastnost
de: Eigenschaft
es: propiedad
fr: propriété
it: proprietà
ja: プロパティ
ko: 속성
pl: właściwość
pt_br: propriedade
ru: свойство
tr: özellik
zh_hans: 属性
zh_hant: 屬性

# IDS_SK_UNKNOWN
source: element
es: elemento
fr: élément
it: elemento
ja: 要素
ko: 요소
pt_br: elemento
ru: элемент
tr: öğe
zh_hans: 元素
zh_hant: 元素

# IDS_SK_VARIABLE
source: variable
cs: proměnná
it: variabile
ja: 変数
ko: 변수
pl: zmienna
pt_br: variável
ru: переменная
tr: değişken
zh_hans: 变量
zh_hant: 變數

# IDS_SK_LABEL
source: label
cs: popisek
de: Bezeichnung
es: etiqueta
fr: étiquette
it: etichetta
ja: ラベル
ko: 레이블
pl: etykieta
pt_br: rótulo
ru: метка
tr: etiket
zh_hans: 标签
zh_hant: 標籤

# IDS_SK_EVENT
source: event
cs: událost
de: Ereignis
es: evento
fr: événement
it: evento
ja: イベント
ko: 이벤트
pl: zdarzenie
pt_br: evento
ru: событие
tr: olay
zh_hans: 事件
zh_hant: 事件

# IDS_SK_TYVAR
source: type parameter
cs: parametr typu
de: Typparameter
es: parámetro de tipo
fr: paramètre de type
it: parametro di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: parametr typu
pt_br: parâmetro de tipo
ru: параметр типа
tr: tür parametresi
zh_hans: 类型形参
zh_hant: 類型參數

# IDS_SK_ALIAS
source: using alias
cs: alias using
es: alias using
fr: alias using
ja: using エイリアス
ko: using 별칭
pl: alias użycia
pt_br: alias using
ru: псевдоним using
tr: diğer ad kullanma
zh_hans: using 别名
zh_hant: 使用別名

# IDS_SK_EXTERNALIAS
source: extern alias
cs: externí alias
de: externer Alias
es: alias externo
fr: alias extern
it: alias extern
ja: extern エイリアス
ko: extern 별칭
pl: alias zewnętrzny
pt_br: alias externo
ru: внешний псевдоним
tr: extern diğer adı
zh_hans: 外部别名
zh_hant: 外部別名

# IDS_SK_CONSTRUCTOR
source: constructor
cs: konstruktor
de: Konstruktor
fr: constructeur
it: costruttore
ja: コンストラクター
ko: 생성자
pl: konstruktor
pt_br: construtor
ru: конструктор
tr: oluşturucu
zh_hans: 构造函数
zh_hant: 建構函式

# IDS_FOREACHLOCAL
source: foreach iteration variable
cs: iterační proměnná foreach
de: foreach-Iterationsvariable
es: variable de iteración foreach
fr: variable d'itération foreach
it: variabile di iterazione foreach
ja: foreach 繰り返し変数
ko: foreach 반복 변수
pl: zmienna iteracji foreach
pt_br: variável de iteração foreach
ru: переменная цикла foreach
tr: foreach yineleme değişkeni
zh_hans: foreach 迭代变量
zh_hant: foreach 反覆運算變數

# IDS_FIXEDLOCAL
source: fixed variable
cs: pevná proměnná
es: variable fixed
fr: variable fixed
it: variabile fixed
ja: 固定変数
ko: fixed 변수
pl: zmienna ustalona
pt_br: variável fixed
ru: переменная fixed
tr: sabit değişken
zh_hans: 固定变量
zh_hant: 固定變數

# IDS_USINGLOCAL
source: using variable
cs: proměnná using
es: variable using
fr: variable using
it: variabile using
ja: using 変数
ko: using 변수
pl: zmienna użycia
pt_br: variável using
ru: переменная using
tr: using değişkeni
zh_hans: using 变量
zh_hant: 使用變數

# IDS_Invariantly
source: invariantly
cs: invariantně
de: invariant
es: de forma no variante
fr: par invariance
it: in invarianza
ja: 不変
ko: 불변(invariantly)
pl: niezmiennie
pt_br: invariantement
ru: инвариантно
tr: invaryant olarak
zh_hans: 固定式
zh_hant: 非 Variant 方式

# IDS_FeatureDynamic
source: dynamic
cs: dynamický
de: Dynamisch
es: dinámico
fr: dynamique
it: dinamico
ja: ダイナミック
ko: 동적
pl: dynamiczny
pt_br: dinâmica
ru: динамический
tr: dinamik
zh_hans: 动态
zh_hant: 動態

# IDS_FeatureNamedArgument
source: named argument
cs: pojmenovaný argument
de: benanntes Argument
es: argumento con nombre
fr: argument nommé
it: argomento denominato
ja: 名前付き引数
ko: 명명된 인수
pl: argument nazwany
pt_br: argumento nomeado
ru: именованный аргумент
tr: adlandırılmış bağımsız değişken
zh_hans: 命名参数
zh_hant: 具名引數

# IDS_FeatureOptionalParameter
source: optional parameter
cs: volitelný parametr
de: optionaler Parameter
es: parámetro opcional
fr: paramètre facultatif
it: parametro facoltativo
ja: 省略可能なパラメーター
ko: 선택적 매개 변수
pl: parametr opcjonalny
pt_br: parâmetro opcional
ru: необязательный параметр
tr: isteğe bağlı parametre
zh_hans: 可选参数
zh_hant: 選擇性參數
