Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ExpressionTreeCantContainNullCoalescingAssignment
source: An expression tree may not contain a null coalescing assignment
cs: Strom výrazu nesmí obsahovat přiřazení představující sloučení s hodnotou null.
de: Eine Ausdrucksstruktur darf keine NULL-Zusammenfügungszuweisung enthalten.
es: Un árbol de expresión no puede contener una asignación de fusión nula.
fr: Une arborescence de l'expression ne peut pas contenir d'assignation de fusion ayant une valeur null
it: Un albero delle espressioni non può contenere un'espressione Null di coalescenza
ja: 式ツリーに null 合体代入を含めることはできません
ko: 식 트리에는 null 병합 할당을 사용할 수 없습니다.
pl: Drzewo wyrażeń nie może zawierać przypisania łączącego wartość null
pt_br: Uma árvore de expressão não pode conter uma atribuição de união nula
ru: Дерево выражений не может содержать назначение объединения со значением NULL.
tr: İfade ağacı, null birleştirme ataması içeremez
zh_hans: 表达式树可能不包含空的合并赋值
zh_hant: 運算式樹狀結構不可包含 null 聯合指派

# ERR_ExpressionTreeCantContainRefStruct
source: Expression tree cannot contain value of ref struct or restricted type '{0}'.
cs: Strom výrazu nemůže obsahovat hodnotu struktury REF ani zakázaný typ {0}.
de: Eine Ausdrucksstruktur darf keinen Wert vom Typ "ref struct" oder vom eingeschränkten Typ "{0}" enthalten.
es: Un árbol de expresión no puede contener un valor de estructura ref ni el tipo restringido “{0}”.
fr: Une arborescence de l'expression ne peut pas contenir de valeur de struct par référence ou de type restreint '{0}'.
it: L'albero delle espressioni non può contenere il valore '{0}' per lo struct ref o il tipo limitato.
ja: 式ツリーに ref 構造体または制限がある型 '{0}' の値を含めることはできません。
ko: 식 트리에는 ref struct 값 또는 제한된 형식 '{0}'을(를) 사용할 수 없습니다.
pl: Drzewo wyrażeń nie może zawierać wartości elementu ref struct ani typu ograniczonego „{0}”.
pt_br: A árvore de expressão não pode conter um valor de struct de referência ou o tipo restrito '{0}'.
ru: Дерево выражений не может содержать значение ref struct или ограниченный тип "{0}".
tr: İfade ağacı, ref yapısında veya kısıtlanmış '{0}' türünde değer içeremez.
zh_hans: 表达式树不能包含 ref 结构或受限类型“{0}”的值。
zh_hant: 運算式樹狀架構不可包含 ref 結構或限制型別 '{0}' 的值。

# ERR_ExpressionTreeContainsAbstractStaticMemberAccess
source: An expression tree may not contain an access of static virtual or abstract interface member
cs: Strom výrazů nesmí obsahovat přístup statického virtuálního člena nebo člena abstraktního rozhraní.
fr: Une arborescence d’expressions ne peut pas contenir d’accès à un membre d’interface virtuelle ou abstraite statique
it: Un albero delle espressioni può non contenere un accesso del membro di interfaccia statico astratto o virtuale
ja: 式ツリーに静的仮想または抽象インターフェイス メンバーへのアクセス権を含めることはできません
pl: Drzewo wyrażenia nie może zawierać dostępu do statycznej składowej abstrakcyjnej lub wirtualnej w interfejsie
pt_br: Uma árvore de expressão pode não conter um acesso de membro de interface de abstrato estático ou virtual
ru: Дерево выражения не может содержать доступ к статическому виртуальному или абстрактному элементу интерфейса.
zh_hans: 表达式树可能不包含静态虚拟或抽象接口成员的访问权限
zh_hant: 運算式樹狀架構不可包含靜態虛擬或抽象介面成員的存取權

# ERR_ExpressionTreeContainsCollectionExpression
source: An expression tree may not contain a collection expression.
fr: Une arborescence de l’expression ne peut pas contenir une expression de collection.
it: Un albero delle espressioni non può contenere un'espressione di raccolta.
pl: Drzewo wyrażenia nie może zawierać wyrażenia kolekcji.
pt_br: Uma árvore de expressão não pode conter uma expressão de coleção.
ru: Дерево выражения не может содержать выражение коллекции.
zh_hans: 表达式树不能包含集合表达式。
zh_hant: 運算式樹狀架構不得包含集合運算式。

# ERR_ExpressionTreeContainsExtensionBasedConditionalLogicalOperator
source: An expression tree may not contain '&&' or '||' operators that use extension user defined operators.
pt_br: Uma árvore de expressão não pode conter operadores "&&" ou "||" que usam operadores de extensão definidos pelo usuário.

# ERR_ExpressionTreeContainsExtensionPropertyAccess
source: An expression tree may not contain an extension property access
pt_br: Uma árvore de expressão não pode conter um acesso à propriedade de extensão

# ERR_ExpressionTreeContainsFromEndIndexExpression
source: An expression tree may not contain a from-end index ('^') expression.
cs: Strom výrazů nesmí obsahovat výraz indexu od-do (^).
fr: Une arborescence de l'expression ne peut pas contenir d'expression d'index partant de la fin ('^').
it: Un albero delle espressioni non può contenere un'espressione di indice from end ('^').
ja: 式ツリーに、from-end インデックス ('^') 式を含めることはできません。
pl: Drzewo wyrażeń nie może zawierać wyrażenia „od końca indeksu” („^”).
pt_br: Uma árvore de expressão não pode conter uma expressão de índice de front-end ('^').
ru: Дерево выражений не может содержать выражение индекса, отсчитываемого с конца ("^").
zh_hans: 表达式树不能包含 from-end 索引("^")表达式。
zh_hant: 運算式樹狀架構不可包含 from-end index ('^') 運算式。

# ERR_ExpressionTreeContainsInlineArrayOperation
source: An expression tree may not contain an inline array access or conversion
fr: Une arborescence d'expressions ne peut pas contenir d'accès ou de conversion de tableau en ligne
it: Un albero delle espressioni non può contenere un accesso o una conversione di matrice inline
ja: 式ツリーにインライン配列アクセスまたは変換を含めることはできません
pl: Drzewo wyrażenia nie może zawierać dostępu do tablicy śródwierszowej ani konwersji
pt_br: Uma árvore de expressão não pode conter um acesso ou conversão de matriz embutida
ru: Дерево выражения не может содержать встроенный доступ к массиву или преобразование
zh_hans: 表达式树不能包含内联数组访问或转换
zh_hant: 運算式樹狀架構不可包含內嵌陣列存取或轉換

# ERR_ExpressionTreeContainsInterpolatedStringHandlerConversion
source: An expression tree may not contain an interpolated string handler conversion.
cs: Strom výrazů nesmí obsahovat převod obslužné rutiny interpolovaného řetězce.
fr: Une arborescence de l’expression ne peut pas contenir une conversion de gestionnaire de chaîne interpolée.
it: Un albero delle espressioni non può contenere una conversione del gestore di stringhe interpolate.
ja: 式ツリーには、補間された文字列ハンドラー変換を含めることはできません。
pl: Drzewo wyrażenia nie może zawierać konwersji procedury obsługi ciągu interpolowanego.
pt_br: Uma árvore de expressão pode não conter uma conversão de manipulador de cadeia de caracteres interpolada.
ru: Дерево выражения не может содержать преобразование обработчика интерполированных строк.
zh_hans: 表达式树可能不包含内插字符串处理程序转换。
zh_hant: 運算式樹狀架構不可包含差補字串處理常式轉換。

# ERR_ExpressionTreeContainsNamedArgumentOutOfPosition
source: An expression tree may not contain a named argument specification out of position
pt_br: Uma árvore de expressão não pode conter uma especificação de argumento nomeado fora de posição

# ERR_ExpressionTreeContainsPatternImplicitIndexer
source: An expression tree may not contain a pattern System.Index or System.Range indexer access
cs: Strom výrazů možná neobsahuje vzor přístupu indexeru System.Index nebo System.Range.
fr: Une arborescence de l'expression ne peut pas contenir de modèle d'accès à l'indexeur System.Index ou System.Range
it: Un albero delle espressioni non può contenere un accesso a indicizzatore System.Index o System.Range di criterio
ja: 式ツリーに、System.Index または System.Range インデクサー アクセスのパターンを含めることはできません
pl: Drzewo wyrażenia nie może zawierać dostępu do indeksatora z wzorcem System.Index lub System.Range
pt_br: Uma árvore de expressão não pode conter um padrão System.Index ou acesso do indexador System.Range
ru: Дерево выражения не может содержать доступ к индексатору System.Index или System.Range шаблона.
zh_hans: 表达式树不能包含模式 System.Index 或 System.Range 索引器访问
zh_hant: 運算式樹狀架構不可包含 System.Index 或 System.Range 索引子存取模式

# ERR_ExpressionTreeContainsRangeExpression
source: An expression tree may not contain a range ('..') expression.
cs: Strom výrazů nesmí obsahovat výraz rozsahu (..).
fr: Une arborescence de l'expression ne peut pas contenir d'expression de plage ('..').
it: Un albero delle espressioni non può contenere un'espressione ('..').
ja: 式ツリーに範囲 ('..') 式を含めることはできません。
pl: Drzewo wyrażeń nie może zawierać wyrażenia zakresu („..”).
pt_br: Uma árvore de expressão não pode conter uma expressão de intervalo ('..').
ru: Дерево выражений не может содержать выражение диапазона ("..").
zh_hans: 表达式树不能包含范围("..")表达式。
zh_hant: 運算式樹狀架構不可包含 range ('..') 運算式。

# ERR_ExpressionTreeContainsSwitchExpression
source: An expression tree may not contain a switch expression.
cs: Strom výrazů nesmí obsahovat výraz switch.
de: Eine Ausdrucksstruktur darf keinen switch-Ausdruck enthalten.
es: Un árbol de expresión no puede contener una expresión switch.
fr: Une arborescence de l'expression ne peut pas contenir d'expression switch.
it: Un albero delle espressioni non può contenere un'espressione switch.
ja: 式ツリーに switch 式を含めることはできません。
ko: 식 트리에는 switch 식이 포함될 수 없습니다.
pl: Drzewo wyrażeń nie może zawierać wyrażenia switch.
pt_br: Uma árvore de expressão não pode conter uma expressão switch.
ru: Дерево выражений не может содержать выражение switch.
tr: İfade ağacı, switch ifadesi içeremez.
zh_hans: 表达式树不能包含 switch 表达式。
zh_hant: 運算式樹狀結構不可包含 switch 運算式。

# ERR_ExpressionTreeContainsTupleBinOp
source: An expression tree may not contain a tuple == or != operator
cs: Strom výrazů nesmí obsahovat operátor řazené kolekce členů == nebo !=.
de: Eine Ausdrucksbaumstruktur darf keinen ==- oder !=-Tupeloperator enthalten.
es: Un árbol de expresión no puede contener un operador de tupla == o !=.
fr: Une arborescence de l'expression ne peut pas contenir un opérateur de tuple == ou !=
it: Un albero delle espressioni non può contenere un operatore == o != di tupla
ja: 式ツリーにタプルの == または != 演算子を含めることはできません
ko: 식 트리에는 튜플 == 또는 != 연산자를 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać operatora == ani != krotki.
pt_br: Uma árvore de expressão não pode conter um operador == ou != de tupla
ru: Дерево выражений не может содержать оператор == или != кортежа.
tr: İfade ağacı, demetin == veya != işlecini içeremez.
zh_hans: 表达式树不能包含元组 == 或 != 运算符
zh_hant: 運算式樹狀架構不得包含元組 == 或 != 運算子

# ERR_ExpressionTreeContainsWithExpression
source: An expression tree may not contain a with-expression.
cs: Strom výrazů nesmí obsahovat výraz with.
fr: Une arborescence de l'expression ne peut pas contenir d'expression with.
it: Un albero delle espressioni non può contenere un'espressione with.
ja: 式ツリーは、with 式を含むことはできません
pl: Drzewo wyrażeń nie może zawierać wyrażenia with.
pt_br: Uma árvore de expressão não pode conter uma expressão with.
ru: Дерево выражения не может содержать выражение with.
zh_hans: 表达式树不能包含 with 表达式。
zh_hant: 運算式樹狀架構不得包含 with 運算式。

# ERR_ExtensionBlockCollision
source: This extension block collides with another extension block. They result in conflicting content-based type names in metadata, so must be in separate enclosing static classes.
pt_br: Esse bloco de extensão colide com outro bloco de extensão. Eles resultam em nomes de tipo baseados em conteúdo conflitantes nos metadados, portanto, devem estar em classes estáticas delimitadas separadamente.

# ERR_ExtensionDisallowsMember
source: This member is not allowed in an extension block
pt_br: Este membro não é permitido em um bloco de extensão

# ERR_ExtensionDisallowsName
source: Extension declarations may not have a name.
pt_br: Declarações de extensão podem não ter um nome.

# ERR_ExtensionParameterDisallowsDefaultValue
source: The receiver parameter of an extension cannot have a default value
pt_br: O parâmetro de receptor de uma extensão não pode ter um valor padrão

# ERR_ExtensionParameterInStaticContext
source: Static members cannot access the value of extension parameter '{0}'.
pt_br: Membros estáticos não podem acessar o valor do parâmetro de extensão "{0}".

# ERR_ExtensionResolutionFailed
source: '{0}' does not contain a definition for '{1}' and no accessible extension member '{1}' for receiver of type '{0}' could be found (are you missing a using directive or an assembly reference?)
pt_br: "{0}" não contém uma definição para "{1}" e nenhum membro de extensão acessível "{1}" para o receptor do tipo "{0}" pôde ser encontrado (está faltando uma diretiva using ou uma referência de assembly?)

# ERR_ExtensionTypeNameDisallowed
source: Types and aliases cannot be named 'extension'.
pt_br: Tipos e aliases não podem ser nomeados como "extension".

# ERR_ExternEventInitializer
source: '{0}': extern event cannot have initializer
cs: {0}: Externí událost nemůže mít inicializátor.
de: "{0}": Externes Ereignis darf keinen Initialisierer aufweisen.
es: "{0}": un evento externo no puede tener un inicializador
fr: '{0}' : un événement extern ne peut pas avoir d'initialiseur
it: '{0}': l'evento extern non può avere inizializzatori
ja: '{0}': extern イベントは初期化子を持つことができません
ko: '{0}': extern 이벤트에는 이니셜라이저를 사용할 수 없습니다.
pl: „{0}”: zdarzenie extern nie może mieć inicjatora
pt_br: '{0}': o evento externo não pode ter inicializador
ru: "{0}": внешнее событие не может иметь инициализатор
tr: '{0}': dış etkinliğin başlatıcısı olamaz
zh_hans: “{0}”: 外部事件不能有初始值设定项
zh_hant: '{0}': 外部事件不可有初始設定式

# ERR_FeatureInPreview
source: The feature '{0}' is currently in Preview and *unsupported*. To use Preview features, use the 'preview' language version.
cs: Funkce {0} je aktuálně ve verzi Preview a je *nepodporovaná*. Pokud chcete používat funkce Preview, použijte jazykovou verzi preview.
de: Das Feature "{0}" befindet sich zurzeit in der Vorschau und wird *nicht unterstützt*. Um Previewfunktionen zu nutzen, verwenden Sie die Sprachversion "Preview".
es: La característica "{0}" se encuentra actualmente en vista previa y *no se admite*. Para usar características en vista previa, utilice la versión de idioma "vista previa".
fr: La fonctionnalité '{0}' est actuellement en préversion et *n'est pas prise en charge*. Pour utiliser les fonctionnalités en préversion, utilisez la version de langage 'preview'.
it: La funzionalità '{0}' è attualmente disponibile in anteprima e *non è supportata*. Per usare funzionalità in anteprima, scegliere la versione del linguaggio 'preview'.
ja: 機能 '{0}' は現在、プレビュー段階であり、*サポートされていません*。プレビュー機能を使用するには、'preview' 言語バージョンを使用してください。
ko: '{0}' 기능은 현재 미리 보기로 제공되며 *지원되지 않습니다*. 미리 보기 기능을 사용하려면 '미리 보기' 언어 버전을 사용하세요.
pl: Funkcja „{0}” jest obecnie w wersji zapoznawczej i jest *nieobsługiwana*. Aby używać funkcji w wersji zapoznawczej, skorzystaj z wersji języka w wersji zapoznawczej.
pt_br: O recurso '{0}' está atualmente na Versão Prévia e *sem suporte*. Para usar os recursos da Versão Prévia, use a versão de linguagem da "versão prévia".
ru: Функция "{0}" сейчас находится на этапе предварительной версии и *является неподдерживаемой*. Для работы с предварительными версиями функций используйте версию языка "preview".
tr: '{0}' özelliği şu anda Önizleme aşamasındadır ve *desteklenmemektedir*. Önizleme özelliklerini kullanmak için 'önizleme' dil sürümünü kullanın.
zh_hans: 功能“{0}”当前为预览版且*不受支持*。要使用预览版功能，请使用“预览”语言版本。
zh_hant: 功能 '{0}' 目前處於預覽階段，且*不受支援*。若要使用預覽功能，請使用「預覽語言」版本。

# ERR_FeatureIsExperimental
source: Feature '{0}' is experimental and unsupported; use '/features:{1}' to enable.
cs: Funkce {0} je zkušební, a proto není podporovaná. K aktivaci použijte /features:{1}.
de: Das Feature "{0}" ist experimentell und wird nicht unterstützt. Verwenden Sie zur Aktivierung "/features:{1}".
es: La característica "{0}" es experimental y no se admite. Use "/features:{1}" para habilitarla.
fr: La fonctionnalité '{0}' est expérimentale et non prise en charge. Utilisez '/features:{1}' pour l'activer.
it: La funzionalità '{0}' è sperimentale e non è supportata. Per abilitare, usare '/features:{1}'.
ja: 機能 '{0}' は試験段階であり、サポートされていません。有効にするには '/features:{1}' をご使用ください。
ko: 기능 '{0}'은(는) 실험적이며 지원되지 않습니다. 사용하도록 설정하려면 '/features:{1}'을(를) 사용하세요.
pl: Funkcja „{0}” jest eksperymentalna i nieobsługiwana. Aby ją włączyć, użyj parametru „/features:{1}”.
pt_br: O recurso '{0}' é experimental e sem suporte; use '/features:{1}' para habilitar.
ru: Функция "{0}" является экспериментальной и не поддерживается; используйте "/features:{1}" для включения.
tr: '{0}' özelliği deneyseldir ve desteklenmez; etkinleştirmek için '/features:{1}' kullanın.
zh_hans: 功能“{0}”是实验性的且不受支持；请使用“/features:{1}”来启用。
zh_hant: 功能 '{0}' 仍在實驗階段且不具支援；請使用 '/features:{1}' 來啟用。

# ERR_FeatureNotAvailableInVersion10
source: Feature '{0}' is not available in C# 10.0. Please use language version {1} or greater.
cs: Funkce {0} není v C# 10.0 dostupná. Použijte prosím jazykovou verzi {1} nebo novější.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 9.0. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 10.0. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 10.0 では使用できません。言語バージョン {1} 以上を使用してください。
pl: Funkcja "{0}" nie jest dostępna w języku C# 10.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível no C# 10.0. Use a versão da linguagem {1} ou superior.
ru: Функция "{0}" недоступна в C# 10.0. Используйте версию языка {1} или более позднюю.
zh_hans: 功能“{0}”在 C# 10.0 中不可用。请使用语言版本 {1} 或更高版本。
zh_hant: C# 10.0 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion11
source: Feature '{0}' is not available in C# 11.0. Please use language version {1} or greater.
cs: Funkce{0}není v jazyce C# 11.0 k dispozici. Použijte prosím jazyková verze {1} nebo vyšší.
fr: La fonctionnalité '{0}' n’est pas disponible en C# 11.0. Veuillez utiliser la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 11.0. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 11.0 では使用できません。{1} 以上の言語バージョンをお使いください。
pl: Funkcja „{0}” nie jest dostępna w języku C# 11.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível no C# 11.0. Use a versão do idioma {1} ou superior.
ru: Функция "{0}" недоступна в C# 11.0. Используйте язык версии {1} или более поздней.
zh_hans: 功能“{0}”在 C# 11.0 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 11.0. 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion12
source: Feature '{0}' is not available in C# 12.0. Please use language version {1} or greater.
fr: La fonctionnalité « {0} » n’est pas disponible en C# 12.0. Veuillez utiliser la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 12.0. Usare la versione del linguaggio {1} o versione successiva.
pl: Funkcja „{0}” nie jest dostępna w języku C# 12.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 12.0. Use a versão da linguagem {1} ou superior.
ru: Функция "{0}" недоступна в C# 12.0. Используйте язык версии {1} или более поздней.
zh_hans: 功能“{0}”在 C# 12.0 中不可用。请使用语言版本 {1} 或更高版本。
zh_hant: C# 12.0. 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion13
source: Feature '{0}' is not available in C# 13.0. Please use language version {1} or greater.
fr: La fonctionnalité '{0}' n'est pas disponible dans C# 13.0. Veuillez utiliser la version linguistique {1} ou supérieure.
it: La funzionalità '{0}' non è disponibile in C# 13.0. Usare la versione del linguaggio {1} o successiva.
pl: Funkcja „{0}” nie jest dostępna w wersji języka C# 13.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso "{0}" não está disponível no C# 13.0. Use a versão da linguagem {1} ou superior.
ru: Функция "{0}" недоступна в C# 13.0. Используйте язык версии {1} или более поздней.
zh_hans: 功能 '{0}' 在 C# 13.0 中不可用。请使用语言版本 {1} 或更高版本。

# ERR_FeatureNotAvailableInVersion14
source: Feature '{0}' is not available in C# 14.0. Please use language version {1} or greater.
pt_br: O recurso "{0}" não está disponível no C# 14.0. Use a versão do idioma {1} ou superior.

# ERR_FeatureNotAvailableInVersion8
source: Feature '{0}' is not available in C# 8.0. Please use language version {1} or greater.
cs: Funkce {0} není v C# 8.0 dostupná. Použijte prosím jazykovou verzi {1} nebo větší.
de: Das Feature "{0}" ist in C# 8.0 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 8.0. Use la versión {1} del lenguaje o una posterior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 8.0. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 8.0. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 8.0 では使用できません。言語バージョン {1} 以上を使用してください。
ko: '{0}' 기능은 C# 8.0에서 사용할 수 없습니다. 언어 버전 {1} 이상을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 8.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 8.0. Use a versão de linguagem {1} ou superior.
ru: Функция "{0}" недоступна в C# 8.0. Используйте версию языка {1} или более позднюю.
tr: '{0}' özelliği C# 8.0'da kullanılamaz. Lütfen {1} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 功能“{0}”在 C# 8.0 中不可用。请使用语言版本 {1} 或更高版本。
zh_hant: C# 8.0 中無法使用功能 '{0}'。請使用 {1} 或更新的語言版本。

# ERR_FeatureNotAvailableInVersion9
source: Feature '{0}' is not available in C# 9.0. Please use language version {1} or greater.
cs: Funkce {0} není v C# 9.0 dostupná. Použijte prosím jazykovou verzi {1} nebo větší.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 9.0. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 9.0. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 9.0 では使用できません。言語バージョン {1} 以上を使用してください。
pl: Funkcja „{0}” nie jest dostępna w języku C# 9.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível no C# 9.0. Use a versão da linguagem {1} ou superior.
ru: Функция "{0}" недоступна в C# 9.0. Используйте как минимум версию языка {1}.
zh_hans: 功能“{0}”在 C# 9.0 中不可用。请使用语言版本 {1} 或更高版本。
zh_hant: 在 C# 9.0 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FieldLikeEventCantBeReadOnly
source: Field-like event '{0}' cannot be 'readonly'.
cs: Událost podobná poli {0} nemůže mít modifikátor readonly.
de: Ein feldähnliches Ereignis "{0}" darf nicht "readonly" sein.
es: El evento de tipo campo "{0}" no puede ser "readonly".
fr: L'événement de type champ '{0}' ne peut pas être 'readonly'.
it: L'evento simile a campo '{0}' non può essere 'readonly'.
ja: フィールドに類似したイベント '{0}' を 'readonly' にすることはできません。
ko: 필드와 유사한 이벤트 '{0}'이(가) 'readonly'일 수 없습니다.
pl: Zdarzenie-pole „{0}” nie może być zadeklarowane jako „readonly”.
pt_br: O evento '{0}' semelhante ao de campo não pode ser 'readonly'.
ru: Подобное полю событие "{0}" не может быть readonly.
tr: Alan benzeri '{0}' olayı 'readonly' olamaz.
zh_hans: 类似字段的事件 "{0}" 不能为 "readonly"。
zh_hant: 類似欄位的事件 '{0}' 不能是 'readonly'。

# ERR_FileLocalDuplicateNameInNS
source: The namespace '{1}' already contains a definition for '{0}' in this file.
cs: Obor názvů {1} již obsahuje definici pro {0} v tomto souboru.
fr: L'espace de noms '{1}' contient déjà une définition pour '{0}' dans ce fichier.
it: Lo spazio dei nomi '{1}' contiene già una definizione per '{0}' in questo file.
ja: 名前空間 '{1}' は、このファイルの '{0}' の定義を既に含んでいます。
pl: Przestrzeń nazw „{1}” już zawiera definicję dla „{0}” w tym pliku.
pt_br: O namespace '{1}' já contém uma definição para '{0}' neste arquivo.
ru: Пространство имен "{1}" уже содержит определение для "{0}" в этом файле.
zh_hans: 命名空间“{1}”已包含此文件中“{0}”的定义
zh_hant: 命名空間 '{1}' 已在此檔案中包含 '{0}' 的定義。
