Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_DefaultValueForUnconsumedLocation_Title
source: The default value specified will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: Určená výchozí hodnota nebude mít žádný efekt, protože platí pro člena, který se používá v kontextech nedovolujících nepovinné argumenty.
de: Der angegebene Standardwert hat keine Auswirkungen, da es für ein Element gilt, das in Kontexten verwendet wird, die keine optionalen Argumente zulassen
es: El valor por defecto especificado no tendrá efecto porque se aplica a un miembro que se utiliza en contextos que no permiten argumentos opcionales
fr: La valeur par défaut spécifiée pour le paramètre n'aura aucun effet, car elle s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: Il valore predefinito specificato non avrà effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: 指定されている既定値は、省略可能な引数を許可しないコンテキストで使用されるメンバーに適用されるため、効果がありません
ko: 지정된 기본값은 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Zastosowanie określonej wartości domyślnej nie odniesie żadnego skutku, ponieważ dotyczy ona składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O valor padrão especificado não tem efeito porque ele se aplica a um membro que é usado em contextos que não aceitam argumentos opcionais
ru: Указанное значение по умолчанию не будет работать, так как оно применяется к члену, который используется в контекстах, не допускающих дополнительные аргументы
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bağlamlarda kullanılan bir üye için geçerli olduğundan belirtilen varsayılan değerin etkisi olmayacak
zh_hans: 指定的默认值将不起任何作用，因为它适用于不允许可选参数的上下文中使用的成员
zh_hant: 指定的預設值將沒有效果，因為它所套用到的成員是用在不允許選擇性引數的內容

# ERR_PublicKeyFileFailure
source: Error signing output with public key from file '{0}' -- {1}
cs: Chyba při podepisování výstupu pomocí veřejného klíče ze souboru {0} -- {1}
de: Fehler beim Signieren der Ausgabe mit einem öffentlichen Schlüssel aus der Datei "{0}": {1}
es: Error al firmar la salida con una clave pública del archivo '{0}': {1}
fr: Erreur lors de la signature de la sortie avec une clé publique du fichier '{0}' -- {1}
it: Si è verificato un errore durante la firma dell'output con la chiave pubblica del file '{0}' - {1}
ja: ファイル '{0}' から公開キーで出力に署名する際にエラーが発生しました -- {1}
ko: {0}' 파일에서 공용 키를 사용하여 출력에 서명하는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas podpisywania danych wyjściowych za pomocą klucza publicznego z pliku „{0}” — {1}
pt_br: Erro ao assinar a saída com a chave pública do arquivo "{0}" -- {1}
ru: Ошибка при подписи выхода открытым ключом из файла "{0}" — {1}.
tr: {0}' dosyasından ortak anahtarla çıkış imzalanırken hata -- {1}
zh_hans: 使用来自文件“{0}”的公钥对输出签名时出错 -- {1}
zh_hant: 使用檔案 '{0}' 的公開金鑰簽署輸出時發生錯誤 -- {1}

# ERR_PublicKeyContainerFailure
source: Error signing output with public key from container '{0}' -- {1}
cs: Chyba při podepisování výstupu pomocí veřejného klíče z kontejneru {0} -- {1}
de: Fehler beim Signieren der Ausgabe mit einem öffentlichen Schlüssel aus dem Container "{0}": {1}
es: Error al firmar la salida con una clave pública del contenedor '{0}': {1}
fr: Erreur lors de la signature de la sortie avec une clé publique du conteneur '{0}' -- {1}
it: Si è verificato un errore durante la firma dell'output con la chiave pubblica del contenitore '{0}' - {1}
ja: コンテナー '{0}' から公開キーで出力に署名する際にエラーが発生しました -- {1}
ko: {0}' 컨테이너에서 공용 키를 사용하여 출력에 서명하는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas podpisywania danych wyjściowych za pomocą klucza publicznego z kontenera „{0}” — {1}
pt_br: Erro ao assinar a saída com a chave pública do recipiente "{0}" -- {1}
ru: Ошибка при подписи выхода открытым ключом из контейнера "{0}" — {1}.
tr: {0}' kapsayıcısından ortak anahtarla çıkış imzalanırken hata -- {1}
zh_hans: 使用来自容器“{0}”的公钥对输出签名时出错 -- {1}
zh_hant: 使用容器 '{0}' 的公開金鑰簽署輸出時發生錯誤 -- {1}

# ERR_BadDynamicTypeof
source: The typeof operator cannot be used on the dynamic type
cs: Operátor typeof nejde použít na tento dynamický typ.
de: Der TypeOf-Operator kann nicht für den dynamischen Typ verwendet werden.
es: El operador typeof no se puede usar en el tipo dinámico
fr: L'opérateur typeof ne peut pas être utilisé sur le type dynamic
it: Non è possibile usare l'operatore typeof nel tipo dinamico
ja: 動的な型では typeof 演算子を使用できません
ko: typeof 연산자는 동적 유형에 사용할 수 없습니다.
pl: Operator typeof nie może zostać użyty dla typu dynamicznego
pt_br: O operador typeof não pode ser usado no tipo dinâmico
ru: Оператор typeof не может использоваться для динамического типа.
tr: Dinamik tür üzerinde typeof işleci kullanılamaz
zh_hans: typeof 运算符不能用在动态类型上
zh_hant: typeof 運算子不能用於動態類型上

# ERR_ExpressionTreeContainsDynamicOperation
source: An expression tree may not contain a dynamic operation
cs: Strom výrazu nemůže obsahovat dynamickou operaci.
de: Ein Ausdrucksbaum darf keinen dynamischen Vorgang enthalten.
es: Un árbol de expresión no puede contener una operación dinámica
fr: Une arborescence de l'expression ne peut pas contenir une opération dynamique
it: Un albero delle espressioni non può contenere un'operazione dinamica
ja: 式ツリーに動的な操作を含めることはできません
ko: 식 트리에는 동적 연산을 포함할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać operacji dynamicznej
pt_br: Uma árvore de expressões não pode conter uma operação dinâmica
ru: Дерево выражения не может содержать динамическую операцию.
tr: Bir ifade ağacı dinamik bir işlem içeremez
zh_hans: 表达式树不能包含动态操作
zh_hant: 運算式樹狀結構不可包含動態作業

# ERR_BadAsyncExpressionTree
source: Async lambda expressions cannot be converted to expression trees
cs: Asynchronní výrazy lambda nejde převést na stromy výrazů.
de: Async-Lambdaausdrücke können nicht in Ausdrucksbäume konvertiert werden.
es: Las expresiones lambda asincrónicas no se pueden convertir en árboles de expresión
fr: Les expressions lambda Async ne peuvent pas être converties en arborescences de l'expression
it: Le espressioni lambda asincrone non possono essere convertite in alberi delle espressioni
ja: 非同期ラムダ式を式ツリーに変換することはできません
ko: 비동기 람다 식을 식 트리로 변환할 수 없습니다.
pl: Asynchronicznych wyrażeń lambda nie można konwertować na drzewa wyrażeń.
pt_br: As expressões lambda assíncronas não podem ser convertidas em árvores de expressões
ru: Асинхронные лямбда-выражения невозможно преобразовывать в деревья выражений.
tr: Zaman uyumsuz lambda ifadeleri ifade ağaçlarına dönüştürülemez
zh_hans: 异步 lambda 表达式无法转换为表达式树
zh_hant: 非同步 Lambda 運算式不可轉換成運算式樹狀結構

# ERR_DynamicAttributeMissing
source: Cannot define a class or member that utilizes 'dynamic' because the compiler required type '{0}' cannot be found. Are you missing a reference?
cs: Nejde definovat třídu nebo člen, který používá typ dynamic, protože se nedá najít typ {0} požadovaný kompilátorem. Nechybí odkaz?
de: Eine Klasse oder ein Member vom Typ "dynamic" kann nicht definiert werden, weil der vom Compiler benötigte Typ "{0}" nicht gefunden wurde. Fehlt möglicherweise ein Verweis?
es: No se puede definir una clase o un miembro que use 'dynamic', porque no se encuentra el tipo '{0}' requerido por el compilador. ¿Falta alguna referencia?
fr: Impossible de définir une classe ou un membre qui utilise 'dynamic', car le type requis par le compilateur '{0}' est introuvable. Vous manque-t-il une référence ?
it: Non è possibile definire una classe o un membro che usa 'dynamic' perché non è stato trovato il tipo '{0}' richiesto dal compilatore. Probabilmente manca un riferimento.
ja: コンパイラの必須型 '{0}' が見つからないため、'dynamic' を利用するクラスまたはメンバーを定義できません。参照が指定されていることを確認してください。
ko: 컴파일러에서 요구하는 '{0}' 형식을 찾지 못했기 때문에 'dynamic'을 사용하는 클래스 또는 멤버를 정의할 수 없습니다. 참조가 있는지 확인하세요.
pl: Nie można zdefiniować klasy ani składowej korzystającej z typu „dynamic”, ponieważ nie można odnaleźć wymaganego przez kompilator typu „{0}”. Czy brakuje odwołania?
pt_br: Não é possível definir uma classe ou membro que utiliza "dynamic" porque o tipo necessário pelo compilador "{0}" não pode ser encontrado.
ru: Не удается определить класс или член, использующий dynamic, так как не удается найти требуемый компилятором тип "{0}". Возможно, отсутствует ссылка.
tr: Derleyicinin gereken '{0}' türü bulunamadığından 'dynamic' kullanan bir sınıf veya üye tanımlanamıyor. Bir başvuruyu eksik mi bıraktınız?
zh_hans: 无法定义使用“dynamic”的类或成员，因为找不到编译器所需的类型“{0}”。是否缺少引用?
zh_hant: 無法定義利用 'dynamic' 的類別或成員，因為找不到編譯器的必要類型 '{0}'。是否遺漏了參考?

# ERR_CannotPassNullForFriendAssembly
source: Cannot pass null for friend assembly name
cs: Jako název sestavení typu Friend nejde předat hodnotu Null.
de: Als Friend-Assemblyname kann nicht NULL übergeben werden.
es: No se puede pasar un valor NULL como nombre de ensamblado de confianza
fr: Impossible de passer null pour un nom d'assembly friend
it: Non è possibile passare Null per il nome assembly Friend
ja: フレンド アセンブリ名に null を渡すことはできません
ko: null 또는 friend 어셈블리 이름을 전달할 수 없습니다.
pl: Nie można przekazać wartości null dla nazwy przyjaznego zestawu
pt_br: Não é possível passar null para nome de assembly amigável
ru: Невозможно передать значение NULL в качестве имени дружественной сборки.
tr: Friend derleme adı için null geçilemez
zh_hans: 无法为友元程序集名称传递 null
zh_hant: 無法傳遞 Null 做為 Friend 組件名稱

# ERR_SignButNoPrivateKey
source: Key file '{0}' is missing the private key needed for signing
cs: V souboru klíče {0} chybí privátní klíč potřebný k podepsání.
de: In der Schlüsseldatei "{0}" fehlt der für die Signierung erforderliche private Schlüssel.
es: Al archivo de clave '{0}' le falta la clave privada necesaria para firmar
fr: Le fichier de clé '{0}' ne comprend pas la clé privée nécessaire à la signature
it: Nel file di chiave '{0}' manca la chiave privata necessaria per la firma
ja: 署名に必要な、キー ファイル '{0}' のプライベート キーがありません
ko: {0}' 키 파일에 서명에 필요한 프라이빗 키가 없습니다.
pl: W pliku klucza „{0}” brakuje klucza prywatnego potrzebnego do podpisania
pt_br: Arquivo de chave "{0}" está sem a chave portátil necessária para assinatura
ru: В файле ключа "{0}" отсутствует закрытый ключ, необходимый для подписи.
tr: {0}' anahtar dosyasında imzalama için gereken özel anahtar eksik
zh_hans: 密钥文件“{0}”缺少签名所需的私钥
zh_hant: 金鑰檔案 '{0}' 遺漏簽署所需的私密金鑰

# ERR_PublicSignButNoKey
source: Public signing was specified and requires a public key, but no public key was specified.
cs: Byl určený veřejný podpis, který vyžaduje veřejný klíč, nebyl ale zadaný žádný veřejný klíč.
de: Öffentliche Signierung wurde angegeben. Für diese ist ein öffentlicher Schlüssel erforderlich. Es wurde aber kein öffentlicher Schlüssel angegeben.
es: Se especificó la firma pública y se requiere una clave pública, pero no se ha especificado ninguna.
fr: La signature publique a été spécifiée et nécessite une clé publique. Toutefois, aucune clé publique n'a été spécifiée.
it: È stata specificata la firma pubblica per la quale è necessaria una chiave pubblica, che però non è stata specificata.
ja: 公開署名が指定され、公開キーを必要としますが、公開キーは指定されていません。
ko: 공개 서명이 지정되었으며 공개 키가 있어야 하지만 공개 키가 지정되지 않았습니다.
pl: Określono publiczne podpisywanie, które wymaga klucza publicznego, lecz nie podano klucza publicznego.
pt_br: A autenticação pública foi especificada e requer uma chave pública, mas nenhuma chave pública foi especificada.
ru: Указано общедоступное подписывание, для которого требуется открытый ключ, но он не указан.
tr: Ortak imzalama belirtildi ve ortak anahtar gerekiyor, ancak ortak anahtar belirtilmedi.
zh_hans: 指定了公共签名并需要公钥，但未指定公钥。
zh_hant: 公開簽章已指定且需要公開金鑰，但並未指定任何公開金鑰。

# ERR_PublicSignNetModule
source: Public signing is not supported for netmodules.
cs: Veřejné podepisování netmodulů se nepodporuje.
de: Öffentliche Signierung wird für Netmodule nicht unterstützt.
es: No se admite la firma pública para netmodules.
fr: La signature publique n'est pas prise en charge pour les netmodules.
it: La firma pubblica non è supportata per gli elementi netmodule.
ja: netmodule では公開署名はサポートされていません。
ko: netmodule에 대해 공개 서명이 지원되지 않습니다.
pl: Publiczne podpisywanie nie jest obsługiwane w przypadku modułów sieciowych.
pt_br: Não há suporte para autenticação pública dos netmodules.
ru: Общедоступные подписи не поддерживаются для netmodule.
tr: Ortak imzalama, netmodule'ler için desteklenmiyor.
zh_hans: netmodule 不支持公共签名。
zh_hant: 對 netmodule 不支援公開簽署。

# WRN_DelaySignButNoKey
source: Delay signing was specified and requires a public key, but no public key was specified
cs: Je určené zpožděné podepsání, které vyžaduje veřejný klíč, ale není zadaný žádný veřejný klíč.
de: Verzögertes Signieren wurde angegeben und erfordert einen öffentlichen Schlüssel, es wurde aber kein öffentlicher Schlüssel angegeben.
es: Se especificó un retraso en la firma y esto requiere una clave pública, pero no se ha especificado ninguna
fr: La signature différée a été spécifiée et nécessite une clé publique, mais aucune clé publique n'a été spécifiée
it: È stata specificata la firma ritardata per la quale è necessaria una chiave pubblica che però non è stata specificata
ja: 遅延署名が指定されたため、公開キーが必要ですが、公開キーが指定されませんでした
ko: 서명 연기가 지정되어 공개 키가 필요하지만 지정된 공개 키가 없습니다.
pl: Określono podpisywanie opóźnione wymagające klucza publicznego, ale nie określono klucza publicznego
pt_br: A assinatura atrasada foi especificada e requer uma chave pública, mas nenhuma chave pública foi especificada
ru: Была указана отложенная подпись, для которой требуется открытый ключ, но открытый ключ не был указан
tr: Gecikmeli imzalama belirtildi ve ortak anahtar gerektiriyor, ancak ortak anahtar belirtilmedi
zh_hans: 指定了延迟签名，这需要公钥，但是未指定任何公钥
zh_hant: 指定了延遲簽署且需要公開金鑰，但未指定任何公開金鑰

# WRN_DelaySignButNoKey_Title
source: Delay signing was specified and requires a public key, but no public key was specified
cs: Je určené zpožděné podepsání, které vyžaduje veřejný klíč, ale není zadaný žádný veřejný klíč.
de: Verzögertes Signieren wurde angegeben und erfordert einen öffentlichen Schlüssel, es wurde aber kein öffentlicher Schlüssel angegeben.
es: Se especificó un retraso en la firma y esto requiere una clave pública, pero no se ha especificado ninguna
fr: La signature différée a été spécifiée et nécessite une clé publique, mais aucune clé publique n'a été spécifiée
it: È stata specificata la firma ritardata per la quale è necessaria una chiave pubblica che però non è stata specificata
ja: 遅延署名が指定されたため、公開キーが必要ですが、公開キーが指定されませんでした
ko: 서명 연기가 지정되어 공개 키가 필요하지만 지정된 공개 키가 없습니다.
pl: Określono podpisywanie opóźnione wymagające klucza publicznego, ale nie określono klucza publicznego
pt_br: A assinatura atrasada foi especificada e requer uma chave pública, mas nenhuma chave pública foi especificada
ru: Была указана отложенная подпись, для которой требуется открытый ключ, но открытый ключ не был указан
tr: Gecikmeli imzalama belirtildi ve ortak anahtar gerektiriyor, ancak ortak anahtar belirtilmedi
zh_hans: 指定了延迟签名，这需要公钥，但是未指定任何公钥
zh_hant: 指定了延遲簽署且需要公開金鑰，但未指定任何公開金鑰

# ERR_InvalidVersionFormat
source: The specified version string '{0}' does not conform to the required format - major[.minor[.build[.revision]]]
cs: Zadaný řetězec verze „{0}“ neodpovídá požadovanému formátu – hlavní_verze[.podverze[.build[.revize]]]
fr: La chaîne de version spécifiée '{0}' n’est pas conforme au format requis - major[.minor[.build[.revision]]]
it: La stringa di versione specificata '{0}' non è conforme al formato richiesto: principale[.secondaria[.build[.revisione]]]
ja: 指定したバージョン文字列 '{0}' は、必要な形式 (major[.minor[.build[.revision]]]) に従っていません。
pl: Określony ciąg wersji „{0}” jest niezgodny z wymaganym formatem — major[.minor[.build[.revision]]]
pt_br: A cadeia de caracteres de versão especificada '{0}' não está de acordo com o formato requerido - major[.minor[.build[.revision]]]
ru: Указанная строка версии "{0}" не соответствует требуемому формату: основной номер[.дополнительный номер[.сборка[.редакция]]]
zh_hans: 指定版本字符串 '{0}' 不符合所需格式 - major[.minor[.build[.revision]]]
zh_hant: 指定的版本字串 '{0}' 不符合所需的格式 - major[.minor[.build[.revision]]]

# ERR_InvalidVersionFormatDeterministic
source: The specified version string '{0}' contains wildcards, which are not compatible with determinism. Either remove wildcards from the version string, or disable determinism for this compilation
cs: Zadaný řetězec verze „{0}“ obsahuje zástupné znaky, které nejsou kompatibilní s determinismem. Odeberte zástupné znaky z řetězce verze nebo zakažte determinismus pro tuto kompilaci.
fr: La chaîne de version spécifiée '{0}' contient des caractères génériques qui ne sont pas compatibles avec le déterminisme. Supprimez les caractères génériques de la chaîne de version ou désactivez le déterminisme pour cette compilation
it: La stringa di versione specificata '{0}' contiene caratteri jolly e questo non è compatibile con il determinismo. Rimuovere i caratteri jolly dalla stringa di versione o disabilitare il determinismo per questa compilazione
ja: 指定されたバージョン文字列 '{0}' には、決定性と互換性のないワイルドカードが含まれています。バージョン文字列からワイルドカードを削除するか、このコンパイルの決定性を無効にしてください。
pl: Określony ciąg wersji „{0}” zawiera znaki wieloznaczne, które nie są zgodne z determinizmem. Usuń znaki wieloznaczne z ciągu wersji lub wyłącz determinizm dla tej kompilacji
pt_br: A cadeia de caracteres de versão especificada '{0}' contém curingas, que não são compatíveis com o determinismo. Remova os curingas da cadeia de caracteres da versão ou desative o determinismo para esta compilação
ru: Указанная строка версии "{0}" содержит подстановочные знаки, которые несовместимы с детерминизмом. Удалите подстановочные знаки из строки версии или отключите детерминизм для этой компиляции
zh_hans: 指定的版本字符串 '{0}' 包含通配符，这与确定性不兼容。请删除版本字符串中的通配符，或禁用此编译的确定性。
zh_hant: 指定的版本字串 '{0}' 包含萬用字元，但這與確定性不相容。請移除版本字串中的萬用字元，或停用此編譯的確定性。

# ERR_InvalidVersionFormat2
source: The specified version string '{0}' does not conform to the required format - major.minor.build.revision (without wildcards)
cs: Zadaný řetězec verze „{0}“ neodpovídá požadovanému formátu – major.minor.build.revision (bez zástupných znaků).
fr: La chaîne de version spécifiée '{0}' n’est pas conforme au format requis : major.minor.build.revision (sans caractères génériques)
it: La stringa di versione specificata '{0}' non è conforme al formato richiesto: principale.secondaria.build.revisione (senza caratteri jolly)
ja: 指定したバージョン文字列 '{0}' は、必要な形式 (major.minor.build.revision、ワイルドカードなし) に従っていません。
pl: Określony ciąg wersji „{0}” nie jest zgodny z wymaganym formatem — major.minor.build.revision (bez znaków wieloznacznych)
pt_br: A cadeia de caracteres de versão especificada '{0}' não está em conformidade com o formato necessário - major.minor.build.revision (sem curingas)
ru: Указанная строка версии "{0}" не соответствует требуемому формату: основной номер.дополнительный номер.сборка.редакция (без подстановочных знаков)
zh_hans: 指定的版本字符串 '{0}' 不符合所需格式 - major.minor.build.revision (不带通配符)
zh_hant: 指定的版本字串 '{0}' 不符合所需的格式: major.minor.build.revision (不含萬用字元)

# WRN_InvalidVersionFormat
source: The specified version string '{0}' does not conform to the recommended format - major.minor.build.revision
cs: Zadaný řetězec verze „{0}“ neodpovídá doporučenému formátu – major.minor.build.revision.
fr: La chaîne de version spécifiée '{0}' n’est pas conforme au format recommandé : major.minor.build.revision
it: La stringa di versione specificata '{0}' non è conforme al formato consigliato: principale.secondaria.build.revisione
ja: 指定したバージョン文字列 '{0}' は、推奨される形式 (major.minor.build.revision) に従っていません
pl: Określony ciąg wersji „{0}” nie jest zgodny z zalecanym formatem — major.minor.build.revision
pt_br: A cadeia de caracteres de versão especificada '{0}' não está em conformidade com o formato recomendado - major.minor.build.revision
ru: Указанная строка версии "{0}" не соответствует рекомендованному формату: основной номер.дополнительный номер.сборка.редакция
zh_hans: 指定版本字符串 '{0}' 不符合建议格式 - major.minor.build.revision
zh_hant: 指定的版本字串 '{0}' 不符合建議的格式 - major.minor.build.revision

# WRN_InvalidVersionFormat_Title
source: The specified version string does not conform to the recommended format - major.minor.build.revision
cs: Zadaný řetězec verze není v souladu s doporučeným formátem – hlavní_verze.dílčí_verze.build.revize.
de: Die angegebene Versionszeichenfolge entspricht nicht dem empfohlenen Format: Hauptversion.Nebenversion.Build.Revision
es: La cadena de versión especificada no se ajusta al formato recomendado: principal,secundaria,compilación,revisión
fr: Le format de la chaîne de version spécifiée n'est pas conforme au format requis - major.minor.build.revision
it: La stringa di versione specificata non è conforme al formato consigliato: principale.secondaria.build.revisione
ja: 指定したバージョン文字列は、推奨される形式 (major.minor.build.revision) に従っていません
ko: 지정한 버전 문자열이 권장 형식 major.minor.build.revision을 따르지 않습니다.
pl: Określony ciąg wersji nie jest zgodny z zalecanym formatem — wersja_główna.wersja_pomocnicza.kompilacja.poprawka
pt_br: A cadeia de caracteres de versão especificada não está de acordo com o formato recomendado - major.minor.build.revision
ru: Указанная строка версии не соответствует рекомендованному формату — основной номер.дополнительный номер.сборка.редакция
tr: Belirtilen sürüm dizesi önerilen biçime uymuyor - major.minor.build.revision
zh_hans: 指定版本字符串不符合建议格式 - major.minor.build.revision
zh_hant: 指定的版本字串不符合建議的格式 - major.minor.build.revision

# ERR_InvalidAssemblyCultureForExe
source: Executables cannot be satellite assemblies; culture should always be empty
cs: Spustitelné soubory nemůžou být satelitními sestaveními; jazyková verze by vždy měla být prázdná.
de: Ausführbare Dateien können keine Satellitenassemblys sein. Kulturen sollten immer leer sein.
es: Los archivos ejecutables no pueden ser ensamblados satélite y no deben tener referencia cultural
fr: Les exécutables ne peuvent pas être des assemblys satellites ; la culture doit toujours être vide
it: I file eseguibili non possono essere assembly satellite. Il campo relativo alle impostazioni cultura deve essere sempre vuoto
ja: 実行可能ファイルをサテライト アセンブリにできません。カルチャは常に空でなければなりません
ko: 실행 파일은 위성 어셈블리일 수 없습니다. 문화권은 항상 비워 두어야 합니다.
pl: Pliki wykonywalne nie mogą być zestawami satelity, element Culture powinien zawsze być pusty
pt_br: Executáveis não podem ser assemblies satélites; cultura deve estar sempre vazia
ru: Исполняемые файлы не могут быть вспомогательными сборками; язык и региональные параметры должны быть пустыми.
tr: Yürütülebilir dosyalar yardımcı derleme olamaz; kültür her zaman boş olmalıdır
zh_hans: 可执行文件不能是附属程序集；区域性应始终为空
zh_hant: 可執行檔不可為附屬組件; 文化特性需保留為空白

# ERR_NoCorrespondingArgument
source: There is no argument given that corresponds to the required parameter '{0}' of '{1}'
cs: Není zadán žádný argument, který by odpovídal požadovanému parametru {0} v {1}
fr: Parmi les arguments spécifiés, aucun ne correspond au paramètre obligatoire '{0}' de '{1}'
it: Non è stato specificato alcun argomento corrispondente al parametro obbligatorio '{0}' di '{1}'
ja: '{0}' の必要なパラメーター '{1}' に対応する特定の引数がありません
pl: Nie podano argumentu odpowiadającego wymaganemu parametrowi „{0}” z „{1}”
pt_br: Não há nenhum argumento fornecido que corresponda ao parâmetro necessário '{0}' de '{1}'
ru: Отсутствует аргумент, соответствующий требуемому параметру "{0}" из "{1}".
zh_hans: 未提供与“{1}”的所需参数“{0}”对应的参数
zh_hant: 未提供任何可對應到 '{1}' 之必要參數 '{0}' 的引數
