Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_OverrideWithConstraints
source: Constraints for override and explicit interface implementation methods are inherited from the base method, so they cannot be specified directly, except for either a 'class', or a 'struct' constraint.
cs: Omezení pro metody přepsání a explicitní implementace rozhraní se dědí ze základní metody, nejde je tedy zadat přímo, s výjimkou omezení class nebo struct.
de: Einschränkungen für Außerkraftsetzungs- und explizite Schnittstellenimplementierungsmethoden werden von der Basismethode geerbt und können daher nur für eine class- oder eine struct-Einschränkung direkt angegeben werden.
es: Las restricciones para métodos de invalidación y de implementación de interfaz explícita se heredan del método base; por tanto, no se pueden especificar directamente, excepto para una restricción de tipo "class" o "struct".
fr: Les contraintes des méthodes d'implémentation d'interface par remplacement et explicites sont héritées de la méthode de base. Elles ne peuvent donc pas être spécifiées directement, sauf pour une contrainte 'class' ou 'struct'.
it: I vincoli per i metodi di override e di implementazione esplicita dell'interfaccia sono ereditati dal metodo base, quindi non possono essere specificati direttamente, ad eccezione di un vincolo 'class' o 'struct'.
ja: オーバーライドおよび明示的なインターフェイスの実装メソッドの制約は、基本メソッドから継承されるので、'class' または 'struct' 制約の場合を除いて直接指定できません。
ko: 재정의 및 명시적 인터페이스 구현 메서드에 대한 제약 조건은 기본 메서드에서 상속되므로 'class' 또는 'struct' 제약 조건을 제외하고는 직접 지정할 수 없습니다.
pl: Ograniczenia dla przesłoniętych i jawnych metod implementacji interfejsu są dziedziczone z metody podstawowej, dlatego nie mogą być określone bezpośrednio, chyba że są to ograniczenia „class” lub „struct”.
pt_br: As restrições para métodos de substituição e de implementação explícita da interface são herdadas do método base, portanto, elas não podem ser especificadas diretamente, com exceção de uma restrição 'class' ou 'struct'.
ru: Ограничения для переопределения и явные методы реализации интерфейса унаследованы от базового метода, поэтому они не могут быть указаны напрямую, кроме ограничения class или struct.
tr: Geçersiz kılma ve açık arabirim uygulama yöntemlerinin kısıtlamaları temel yöntemden devralınır ve bu nedenle, bir 'class' veya 'struct' kısıtlaması dışında doğrudan belirtilemez.
zh_hans: 重写和显式接口实现方法的约束是从基方法继承的，因此不能直接指定这些约束，除非指定 "class" 或 "struct" 约束。
zh_hant: 覆寫及明確介面實作方法的條件約束，繼承自基底方法，所以無法直接指定，但 'class' 或 'struct' 限制式除外。

# ERR_AmbigOverride
source: The inherited members '{0}' and '{1}' have the same signature in type '{2}', so they cannot be overridden
cs: Zděděné členy {0} a {1} mají stejný podpis v typu {2}, takže je nejde přepsat.
de: Die geerbten Member "{0}" und "{1}" weisen die gleiche Signatur im Typ "{2}" auf, sie können also nicht überschrieben werden.
es: Los miembros heredados '{0}' y '{1}' tienen la misma firma en el tipo '{2}', por lo que no se pueden reemplazar
fr: Les membres hérités '{0}' et '{1}' ayant la même signature dans le type '{2}', ils ne peuvent pas être substitués
it: I membri ereditati '{0}' e '{1}' hanno la stessa firma nel tipo '{2}', pertanto non possono essere sottoposti a override
ja: 継承したメンバー '{0}' と '{1}' に '{2}' 型の同じ署名があるためオーバーライドできません
ko: 상속된 멤버 '{0}'과(와) '{1}'은(는) '{2}' 형식에 같은 시그니처가 있으므로 재정의할 수 없습니다.
pl: Dziedziczone składowe „{0}” i „{1}” mają tę samą sygnaturę w typie „{2}”, dlatego nie mogą być przesłaniane
pt_br: Os membros herdados "{0}" e "{1}" têm a mesma assinatura no tipo "{2}", portanto, eles não podem ser substituídos
ru: Наследуемые члены "{0}" и "{1}" имеют одинаковую сигнатуру в типе "{2}", поэтому их нельзя переопределить.
tr: {0}' ve '{1}' devralınan üyeleri '{2}' türünde aynı imzaya sahip ve bu nedenle geçersiz kılınamazlar
zh_hans: 继承的成员“{0}”和“{1}”在类型“{2}”中具有相同的签名，因此不能重写这些成员
zh_hant: 繼承的成員 '{0}' 和 '{1}'，在類型 '{2}' 中有相同的簽章，所以無法覆寫

# ERR_DecConstError
source: Evaluation of the decimal constant expression failed
cs: Vyhodnocování výrazu desítkové konstanty se nepovedlo.
de: Fehler bei der Auswertung des Dezimalkonstantenausdrucks.
es: No se pudo realizar la evaluación de la expresión de la constante decimal y se produjo un error
fr: Échec de l'évaluation de l'expression constante décimale
it: La valutazione dell'espressione costante decimale non è riuscita
ja: 10 進数の定数式の評価に失敗しました
ko: 10진수 상수 식을 계산하지 못했습니다.
pl: Obliczenie wyrażenia ze stałą dziesiętną nie powiodło się
pt_br: Falha na avaliação da expressão decimal constante
ru: Ошибка при вычислении выражения десятичной константы.
tr: Ondalık sabit ifadenin değerlendirilmesi başarısız oldu
zh_hans: 计算十进制常量表达式失败
zh_hant: 運算十進位常數運算式失敗

# WRN_CmpAlwaysFalse
source: Comparing with null of type '{0}' always produces 'false'
cs: Výsledkem porovnání s hodnotou null typu {0} je vždycky false.
de: Beim Vergleich mit NULL vom Typ "{0}" wird immer "False" zurückgegeben.
es: La comparación con NULL de tipo '{0}' siempre genera 'false'
fr: La comparaison avec null de type '{0}' produit toujours 'false'
it: Il confronto con il valore Null di tipo '{0}' restituisce sempre 'false'
ja: 型 '{0}' の null と比較すると、いつも 'false' を生成します
ko: {0}' 형식의 null과 비교하면 결과는 항상 'false'입니다.
pl: Porównanie z wartością null typu „{0}” zawsze daje wartość „false”
pt_br: Comparação com null do tipo "{0}" sempre produz "false"
ru: Операция сравнения со значением Null типа "{0}" всегда возвращает False.
tr: {0}' türünün null değeri ile karşılaştırma her zaman 'false' üretir
zh_hans: 与类型为“{0}”的 null 进行比较始终产生“false”
zh_hant: 與類型 '{0}' 的 null 進行比較，一律會產生 'false'

# WRN_CmpAlwaysFalse_Title
source: Comparing with null of struct type always produces 'false'
cs: Výsledkem porovnání s typem struct je vždycky false.
de: Der Vergleich mit dem Strukturtyp Null führt immer zu 'false'
es: Comparar con tipos de estructura o nulos siempre produce 'false'
fr: La comparaison avec null de type struct produit toujours 'false'
it: Il confronto con il valore Null di tipo struct restituisce sempre 'false'
ja: 構造体型の null と比較するといつも 'false' を生成します
ko: 구조체 형식의 null과 비교하면 결과는 항상 'false'입니다.
pl: Porównanie z wartością null typu struktury zawsze zwraca wartość „false”
pt_br: Comparação com nulo do tipo struct sempre produz 'false'
ru: Сравнение со значением NULL или типом структуры всегда вызывает false
tr: Yapı türünün null değeri ile karşılaştırma her zaman 'false' değerini üretir
zh_hans: 与结构类型的 null 进行比较始终产生 "false"
zh_hant: 與 struct 類型的 null 進行比較，一律會產生 'false'

# WRN_FinalizeMethod
source: Introducing a 'Finalize' method can interfere with destructor invocation. Did you intend to declare a destructor?
cs: Zavedení metody Finalize může vést k potížím s voláním destruktoru. Měli jste v úmyslu deklarovat destruktor?
de: Eine neue Finalize-Methode kann den Aufruf eines Destruktors stören. Wollten Sie einen Destruktor deklarieren?
es: La introducción de un método 'Finalize' puede afectar a la invocación del destructor. ¿Quería declarar un destructor?
fr: L'introduction d'une méthode 'Finalize' peut interférer avec un appel destructeur. Souhaitiez-vous déclarer un destructeur ?
it: L'introduzione di un metodo 'Finalize' può interferire con la chiamata di un distruttore. Si desiderava dichiarare un distruttore?
ja: Finalize' メソッドを導入すると、デストラクターの呼び出しに影響する可能性があります。デストラクターを宣言しようとしましたか?
ko: Finalize' 메서드를 사용하면 소멸자를 호출하는 데 방해가 될 수 있습니다. 소멸자를 선언하시겠습니까?
pl: Wprowadzenie metody „Finalize” może zakłócać wywołanie destruktora. Czy zamierzane było zadeklarowanie destruktora?
pt_br: A introdução de um método 'Finalize' pode interferir na invocação do destruidor. Você pretendia declarar um destruidor?
ru: Введение метода Finalize может помешать вызову деструктора. Предполагается объявить деструктор?
tr: Finalize' yönteminin sunulması yıkıcı çağrılmasını engelleyebilir. Bir yıkıcı bildirmek mi istiyordunuz?
zh_hans: 引入 "Finalize" 方法会妨碍析构函数调用。是否希望声明析构函数?
zh_hant: 引進可能會妨礙解構函式引動過程的 'Finalize' 方法。是否想要宣告解構函式?

# WRN_FinalizeMethod_Title
source: Introducing a 'Finalize' method can interfere with destructor invocation
cs: Zavedení metody Finalize se může rušit s vyvoláním destruktoru.
de: Eine neue Finalize-Methode kann den Aufruf eines Destruktors stören
es: Introducir un método 'Finalize' afectar a la invocación del destructor
fr: L'introduction d'une méthode 'Finalize' peut interférer avec un appel destructeur
it: L'introduzione di un metodo 'Finalize' può interferire con la chiamata di un distruttore
ja: Finalize' メソッドを導入すると、デストラクターの呼び出しに影響する可能性があります
ko: Finalize' 메서드를 사용하면 소멸자를 호출하는 데 방해가 될 수 있습니다.
pl: Wprowadzenie metody „Finalize” może zakłócać wywołanie destruktora
pt_br: Apresentar um método 'Finalize' pode interferir na invocação do destruidor
ru: Введение метода Finalize может помешать вызову деструктора
tr: Finalize' yönteminin sunulması yok edici çağrılmasını engelleyebilir
zh_hans: 引入 "Finalize" 方法可能会妨碍析构函数调用
zh_hant: 採用 'Finalize' 方法可能會妨礙解構函式的引動過程

# WRN_FinalizeMethod_Description
source: This warning occurs when you create a class with a method whose signature is public virtual void Finalize. If such a class is used as a base class and if the deriving class defines a destructor, the destructor will override the base class Finalize method, not Finalize.
cs: Toto varování se objeví, pokud vytvoříte třídu s metodou, jejíž podpis je veřejný virtuální void Finalize. Pokud se taková třída používá jako základní třída a pokud odvozující třída definuje destruktor, přepíše tento destruktor metodu Finalize základní třídy, ne samotné Finalize.
de: Diese Warnung tritt auf, wenn Sie eine Klasse mit einer Methode erstellen, dessen Signatur eine öffentliche, virtuell virtuelle ungültige Finalize-Methode ist. Wenn solch eine Klasse als Basisklasse verwendet wird und die ableitende Klasse einen Destruktor definiert, überschreibt der Destruktor die Finalize-Methode der Basisklasse.
es: Esta advertencia se produce cuando crea una clase con un método cuya firma es public virtual void Finalize. Si se utiliza una clase de este tipo como clase base y si la clase derivada define un destructor, este reemplazará al método Finalize de la clase base, no a Finalize.
fr: Cet avertissement survient lorsque vous créez une classe avec une méthode dont la signature est public virtual void Finalize. Si une telle classe est utilisée en tant que classe de base et si la classe dérivée définit un destructeur, celui-ci remplacera la méthode Finalize de la classe de base, et non Finalize.
it: Questo avviso viene visualizzato quando si crea una classe con un metodo la cui firma è public virtual void Finalize. Se si usa tale classe come classe base e se la classe di derivazione definisce un distruttore, il distruttore eseguirà l'override del metodo Finalize della classe base e non di Finalize.
ja: この警告は、シグネチャが public virtual void Finalize であるメソッドを持つクラスを作成したときに発生します。 このようなクラスが基本クラスとして使用され、派生クラスがデストラクターを定義している場合、デストラクターは Finalize ではなく、基本クラスの Finalize メソッドをオーバーライドします。
ko: 이 경고는 서명이 공용 가상 void Finalize인 메서드를 포함하는 클래스를 만들 때 발생합니다. 그런 클래스를 기본 클래스로 사용하고 파생 클래스에서 소멸자를 정의하는 경우 소멸자는 Finalize가 아닌 기본 클래스 Finalize 메서드를 재정의합니다.
pl: To ostrzeżenie występuje w przypadku utworzenia klasy przy użyciu metody, której sygnatura to publiczny wirtualny element void Finalize. Jeśli taka klasa zostanie użyta jako klasa bazowa i klasa pochodna definiuje destruktor, ten destruktor przesłoni metodę Finalize klasy bazowej, a nie element Finalize.
pt_br: Este aviso ocorre quando você cria uma classe com um método cuja assinatura é o vazio virtual Finalize público. Se tal classe for usada como uma classe base e se a classe derivada definir um destruidor, o destruidor substituirá o método Finalize da classe básica, não o Finalize.
ru: Это предупреждение возникает, когда создается класс с методом, подпись которого является открытым, виртуальным, недействительным методом Finalize. Если такой класс используется в качестве базового, а производный класс определяет деструктор, то деструктор переопределит метод Finalize базового класса, а не метод Finalize производного класса.
tr: İmzası genel sanal geçersiz Finalize olan bir yöntemle bir sınıf oluşturduğunuzda bu uyarı oluşur. Bu sınıf temel sınıf olarak kullanılırsa ve türetilen sınıf bir yıkıcı tanımlarsa, yıkıcı Finalize'ı değil, temel sınıf Finalize yöntemini geçersiz kılar.
zh_hans: 创建的类具有签名为 public virtual void Finalize 的方法时，会出现此警告。 如果将这样一个类用作基类，并且如果派生类定义一个析构函数，则该析构函数会重写基类 Finalize 方法，而不是 Finalize。
zh_hant: 如果用以建立類別的方法，其簽章是公用虛擬 void Finalize，則會發生此警告。 如果這類類別用做基底類別，而且衍生類別定義解構函式，則解構函式會覆寫基底類別 Finalize 方法，而非 Finalize。

# ERR_ExplicitImplParams
source: '{0}' should not have a params parameter since '{1}' does not
cs: 'Pro {0} by neměl být nastavený parametr params, protože {1} ho nemá.
de: '"{0}" sollte keinen params-Parameter enthalten, da auch "{1}" keinen enthält.
es: '{0}' no debe tener un parámetro params porque '{1}' tampoco lo tiene
fr: '{0}' ne doit pas avoir de paramètre params, car '{1}' n'en possède pas
it: '{0}' non deve contenere un parametro params perché '{1}' non ne ha
ja: '{1}' には params パラメーターがないため、'{0}' は params パラメーターを持つことができません
ko: '{1}'이(가) 없어 '{0}'에 params 매개 변수를 사용할 수 없습니다.
pl: 'Element „{0}” nie powinien mieć parametru params, ponieważ nie ma go element „{1}”
pt_br: "{0}" não deve ter um parâmetro params porque "{1}" não tem um
ru: "{0}" не должен иметь параметр params, так как у "{1}" его нет.
tr: '{1}' öğesinde olmadığından '{0}' öğesinde de params parametresi olmamalıdır
zh_hans: '由于“{1}”没有 params 数组，因此“{0}”也不应当有 params 参数
zh_hant: '{0}' 不應有 params 參數，因為 '{1}' 沒有此參數

# WRN_GotoCaseShouldConvert
source: The 'goto case' value is not implicitly convertible to type '{0}'
cs: Hodnotu goto case nejde implicitně převést na typ {0}.
de: Der "goto case"-Wert kann nicht implizit in den Typ "{0}" konvertiert werden.
es: El valor 'goto case' no se puede convertir implícitamente en el tipo '{0}'
fr: La valeur 'goto case' n'est pas implicitement convertible en type '{0}'
it: Il valore 'goto case' non è convertibile in modo implicito nel tipo '{0}'
ja: goto case' 値は型 '{0}' に暗黙的に変換できません
ko: goto case' 값은 '{0}' 형식으로 암시적으로 변환할 수 없습니다.
pl: Wartości „goto case” nie można jawnie przekonwertować na typ „{0}”
pt_br: O valor "goto case" não é implicitamente conversível para o tipo "{0}"
ru: Значение "goto case" невозможно неявно преобразовать в тип "{0}".
tr: goto case' değeri '{0}' türüne açıkça dönüştürülemez
zh_hans: “goto case”值不可隐式转换为类型“{0}”
zh_hant: goto case' 值未隱含轉換成類型 '{0}'

# WRN_GotoCaseShouldConvert_Title
source: The 'goto case' value is not implicitly convertible to the switch type
cs: Hodnotu goto case nejde implicitně převést na typ přepínače.
de: Der 'goto case'-Wert kann nicht implizit in den Schaltertyp konvertiert werden
es: El valor "goto case" no es implícitamente convertible al tipo switch
fr: La valeur 'goto case' n'est pas implicitement convertible en type switch
it: Il valore 'goto case' non è convertibile in modo implicito nel tipo switch
ja: goto case' 値はスイッチ型に暗黙的に変換できません
ko: goto case' 값은 스위치 형식으로 암시적으로 변환할 수 없습니다.
pl: Nie można niejawnie przekonwertować wartości „goto case” na typ przełącznika
pt_br: O valor 'goto case' não é implicitamente conversível para o tipo da opção
ru: Значение "goto case" не может быть неявно преобразовано в тип switch
tr: goto case' değeri anahtar türüne örtük olarak dönüştürülemez
zh_hans: "goto case" 值不可隐式转换为开关类型
zh_hant: goto case' 值未隱含轉換成參數類型

# ERR_MethodImplementingAccessor
source: Method '{0}' cannot implement interface accessor '{1}' for type '{2}'. Use an explicit interface implementation.
cs: Metoda {0} nemůže implementovat přistupující objekt rozhraní {1} pro typ {2}. Použijte explicitní implementaci rozhraní.
de: Methode "{0}" kann Schnittstellenaccessor "{1}" für Typ "{2}" nicht implementieren. Verwenden Sie eine explizite Schnittstellenimplementierung.
es: El método '{0}' no puede implementar el descriptor de acceso de la interfaz '{1}' para el tipo '{2}'. Use una implementación de interfaz explícita.
fr: La méthode '{0}' ne peut pas implémenter l'accesseur d'interface '{1}' pour le type '{2}'. Utilisez une implémentation d'interface explicite.
it: Il metodo '{0}' non può implementare la funzione di accesso di interfaccia '{1}' per il tipo '{2}'. Usare un'implementazione esplicita dell'interfaccia.
ja: メソッド '{0}' は、型 '{2}' のインターフェイス アクセサー '{1}' を実装できません。明示的なインターフェイス実装を使用してください。
ko: {0}' 메서드는 '{2}' 형식의 인터페이스 접근자 '{1}'을(를) 구현할 수 없습니다. 명시적 인터페이스 구현을 사용하세요.
pl: Metoda „{0}” nie może implementować metody dostępu interfejsu „{1}” dla typu „{2}”. Użyj jawnej implementacji interfejsu.
pt_br: Método "{0}" não pode implementar o acessador de interface "{1}" para o tipo "{2}". Use uma implementação de interface explícita.
ru: Метод "{0}" не может реализовать метод доступа интерфейса "{1}" для типа "{2}". Используйте явную реализацию интерфейса.
tr: {0}' yöntemi, '{2}' türü için '{1}' arabirim erişenini uygulayamıyor. Açık bir arabirim uygulaması kullanın.
zh_hans: 方法“{0}”无法实现类型“{2}”的接口访问器“{1}” 请使用显式接口实现。
zh_hant: 方法 '{0}' 無法實作類型 '{2}' 的介面存取子 '{1}'。請使用明確介面實作。

# WRN_NubExprIsConstBool
source: The result of the expression is always '{0}' since a value of type '{1}' is never equal to 'null' of type '{2}'
cs: Výsledek výrazu je vždycky {0}, protože hodnota typu {1} se nikdy nerovná hodnotě null typu {2}.
de: Das Ergebnis des Ausdrucks ist immer "{0}", da ein Wert vom Typ "{1}" niemals NULL vom Typ "{2}" ist.
es: El resultado de la expresión siempre es '{0}' porque un valor del tipo '{1}' nunca es igual a 'NULL' de tipo '{2}'
fr: Le résultat de l'expression est toujours '{0}', car une valeur de type '{1}' n'est jamais égale à 'null' du type '{2}'
it: Il risultato dell'espressione è sempre '{0}' perché un valore di tipo '{1}' non è mai uguale a 'null' di tipo '{2}'
ja: 型 '{1}' の値が型 '{2}' の 'null' に等しくなることはないので、式の結果は常に '{0}' になります
ko: {1}' 형식의 값은 '{2}' 형식의 'null'과 같을 수 없으므로 식 결과는 항상 '{0}'입니다.
pl: Wynik wyrażenia to zawsze „{0}”, ponieważ wartość typu „{1}” nigdy nie jest równa wartości „null” typu „{2}”
pt_br: O resultado da expressão é sempre '{0}', pois um valor do tipo '{1}' nunca é igual a "null" do tipo '{2}'
ru: Результат выражения всегда равен "{0}", поскольку значение типа "{1}" никогда не равно Null типа "{2}"
tr: {1}' türünün değeri asla '{2}' türünün 'null' değerine eşit olmadığından ifadenin sonucu her zaman '{0}'
zh_hans: 由于“{1}”类型的值永不等于“{2}”类型的 "null"，该表达式的结果始终为“{0}”
zh_hant: 運算式的結果一律會是 '{0}'，因為類型 '{1}' 的值絕對不會等於類型 '{2}' 的 'null'

# WRN_NubExprIsConstBool_Title
source: The result of the expression is always the same since a value of this type is never equal to 'null'
cs: Výsledek výrazu je vždycky stejný, protože hodnota tohoto typu se nikdy nerovná hodnotě null.
de: Das Ergebnis des Ausdrucks lautet immer gleich, da ein Wert dieses Typs niemals 'null' entspricht
es: El resultado de la expresión siempre es el mismo ya que un valor de este tipo siempre es igual a "null"
fr: Le résultat de l'expression est toujours le même, car une valeur de ce type n'est jamais égale à 'null'
it: Il risultato dell'espressione è sempre lo stesso perché un valore di questo tipo non è mai uguale a 'null'
ja: この型の値が 'null' に等しくなることはないので、式の結果は常に同じです
ko: 이 형식의 값은 'null'과 같을 수 없으므로 식의 결과가 항상 동일합니다.
pl: Wynik wyrażenia jest zawsze taki sam, ponieważ wartość tego typu nigdy nie jest równa wartości „null”
pt_br: O resultado da expressão é sempre o mesmo, pois um valor deste tipo nunca é 'null'
ru: Результат значения всегда одинаковый, так как значение этого типа никогда не равно NULL
tr: Bu türün bir değeri hiçbir zaman 'null' değerine eşit olmadığından ifadenin sonucu her zaman aynıdır
zh_hans: 由于此类型的值永不等于 "null"，该表达式的结果始终相同
zh_hant: 運算式的結果一律會相同，因為此類型的值絕對不會等於 'null'

# WRN_NubExprIsConstBool2
source: The result of the expression is always '{0}' since a value of type '{1}' is never equal to 'null' of type '{2}'
cs: Výsledek výrazu je vždycky {0}, protože hodnota typu {1} se nikdy nerovná hodnotě null typu {2}.
de: Das Ergebnis des Ausdrucks ist immer "{0}", da ein Wert vom Typ "{1}" niemals NULL vom Typ "{2}" ist.
es: El resultado de la expresión siempre es '{0}' porque un valor del tipo '{1}' nunca es igual a 'NULL' de tipo '{2}'
fr: Le résultat de l'expression est toujours '{0}', car une valeur de type '{1}' n'est jamais égale à 'null' du type '{2}'
it: Il risultato dell'espressione è sempre '{0}' perché un valore di tipo '{1}' non è mai uguale a 'null' di tipo '{2}'
ja: 型 '{1}' の値が型 '{2}' の 'null' に等しくなることはないので、式の結果は常に '{0}' になります
ko: {1}' 형식의 값은 '{2}' 형식의 'null'과 같을 수 없으므로 식 결과는 항상 '{0}'입니다.
pl: Wynik wyrażenia to zawsze „{0}”, ponieważ wartość typu „{1}” nigdy nie jest równa wartości „null” typu „{2}”
pt_br: O resultado da expressão é sempre '{0}', pois um valor do tipo '{1}' nunca é igual a "null" do tipo '{2}'
ru: Результат выражения всегда равен "{0}", поскольку значение типа "{1}" никогда не равно Null типа "{2}"
tr: {1}' türünün değeri asla '{2}' türünün 'null' değerine eşit olmadığından ifadenin sonucu her zaman '{0}'
zh_hans: 由于“{1}”类型的值永不等于“{2}”类型的 "null"，该表达式的结果始终为“{0}”
zh_hant: 運算式的結果一律會是 '{0}'，因為類型 '{1}' 的值絕對不會等於類型 '{2}' 的 'null'

# WRN_NubExprIsConstBool2_Title
source: The result of the expression is always the same since a value of this type is never equal to 'null'
cs: Výsledek výrazu je vždycky stejný, protože hodnota tohoto typu se nikdy nerovná hodnotě null.
de: Das Ergebnis des Ausdrucks lautet immer gleich, da ein Wert dieses Typs niemals 'null' entspricht
es: El resultado de la expresión siempre es el mismo ya que un valor de este tipo siempre es igual a "null"
fr: Le résultat de l'expression est toujours le même, car une valeur de ce type n'est jamais égale à 'null'
it: Il risultato dell'espressione è sempre lo stesso perché un valore di questo tipo non è mai uguale a 'null'
ja: この型の値が 'null' に等しくなることはないので、式の結果は常に同じです
ko: 이 형식의 값은 'null'과 같을 수 없으므로 식의 결과가 항상 동일합니다.
pl: Wynik wyrażenia jest zawsze taki sam, ponieważ wartość tego typu nigdy nie jest równa wartości „null”
pt_br: O resultado da expressão é sempre o mesmo, pois um valor deste tipo nunca é 'null'
ru: Результат значения всегда одинаковый, так как значение этого типа никогда не равно NULL
tr: Bu türün bir değeri hiçbir zaman 'null' değerine eşit olmadığından ifadenin sonucu her zaman aynıdır
zh_hans: 由于此类型的值永不等于 "null"，该表达式的结果始终相同
zh_hant: 運算式的結果一律會相同，因為此類型的值絕對不會等於 'null'
