Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InteropStructContainsMethods
source: Embedded interop struct '{0}' can contain only public instance fields.
cs: Vložená struktura spolupráce {0} může obsahovat jenom veřejné položky instance.
de: Die eingebettete Interopstruktur "{0}" kann nur öffentliche Instanzfelder enthalten.
es: La estructura de interoperabilidad incrustada '{0}' solo puede contener campos de instancia públicos.
fr: La structure d'interopérabilité incorporée '{0}' ne peut contenir que des champs d'instance publics.
it: Lo struct di interoperabilità incorporato '{0}' può contenere solo campi di istanza pubblici.
ja: 埋め込み相互運用構造体 '{0}' には、パブリック インスタンス フィールドのみを含めることができます。
ko: 포함된 interop 구조체 '{0}'은(는) public 인스턴스 필드만 포함할 수 있습니다.
pl: Osadzona struktura międzyoperacyjna „{0}” może zawierać tylko publiczne pola wystąpień.
pt_br: Estrutura de interoperabilidade inserida "{0}" pode conter apenas campos de instância pública.
ru: Внедренная структура взаимодействия "{0}" может содержать только открытые экземпляры полей.
tr: Gömülü birlikte çalışma yapısı '{0}' yalnızca ortak örnek alanları içerebilir.
zh_hans: 嵌入互操作结构“{0}”只能包含公共实例字段。
zh_hant: 內嵌 Interop 結構 '{0}' 只可包含公用執行個體欄位。

# ERR_WinRtEventPassedByRef
source: A Windows Runtime event may not be passed as an out or ref parameter.
cs: Událost Windows Runtimu se nesmí předat jako parametr out nebo ref.
de: Ein Windows-Runtime-Ereignis darf nicht als out- oder ref-Parameter übergeben werden.
es: Un evento de Windows Runtime no se puede pasar como parámetro out o ref.
fr: Un événement Windows Runtime ne peut pas être passé comme paramètre out ou ref.
it: Un evento Windows Runtime non può essere passato come parametro out o ref.
ja: Windows ランタイム イベントを out または ref のパラメーターとして渡すことはできません。
ko: Windows Runtime 이벤트를 out 또는 ref 매개 변수로 전달할 수 없습니다.
pl: Zdarzenia środowiska wykonawczego systemu Windows nie można przekazać jako parametru ze specyfikatorem out lub ref.
pt_br: Um evento de Windows Runtime não pode ser passado como parâmetro out ou ref.
ru: Событие среды выполнения Windows не может передаваться как параметр out или ref.
tr: Bir Windows Çalışma Zamanı olayı out veya ref parametresi olarak geçirilemeyebilir.
zh_hans: 无法作为 out 或 ref 参数传递 Windows 运行时事件。
zh_hant: Windows 執行階段事件不可以 out 或 ref 參數形式傳遞。

# ERR_MissingMethodOnSourceInterface
source: Source interface '{0}' is missing method '{1}' which is required to embed event '{2}'.
cs: Zdrojovému rozhraní {0} chybí metoda {1}, která se vyžaduje pro vložení události {2}.
de: Für die Quellschnittstelle "{0}" fehlt die Methode "{1}", die zum Einbetten des Ereignisses "{2}" notwendig ist.
es: A la interfaz de origen '{0}' le falta el método '{1}', que es necesario para incrustar el evento '{2}'.
fr: L'interface source '{0}' n'a pas de méthode '{1}', qui est requise pour incorporer l'événement '{2}'.
it: Nell'interfaccia di origine '{0}' manca il metodo '{1}' necessario per incorporare l'evento '{2}'.
ja: ソース インターフェイス '{0}' に、イベント '{2}' を埋め込むために必要なメソッド '{1}' がありません。
ko: 소스 인터페이스 '{0}'에는 '{2}' 이벤트를 포함하는 데 필요한 '{1}' 메서드가 없습니다.
pl: Interfejs źródłowy „{0}” nie zawiera metody „{1}” wymaganej do osadzenia zdarzenia „{2}”.
pt_br: Interface de origem "{0}" está sem o método "{1}" que é necessário para incorporar o evento "{2}".
ru: В исходном интерфейсе "{0}" отсутствует метод "{1}", обязательный для внедрения события "{2}".
tr: {0}' kaynak arabiriminde '{2}' olayını katıştırmak için gerekli olan '{1}' yöntemi eksik.
zh_hans: 源接口“{0}”缺少方法“{1}”，此方法对嵌入事件“{2}”是必需的。
zh_hant: 來源介面 '{0}' 遺漏了內嵌事件 '{2}' 所需的方法 '{1}'。

# ERR_MissingSourceInterface
source: Interface '{0}' has an invalid source interface which is required to embed event '{1}'.
cs: Rozhraní {0} má neplatné zdrojové rozhraní, které se vyžaduje pro vložení události {1}.
de: Schnittstelle "{0}" besitzt eine ungültige Quellschnittstelle, die zum Einbetten von Ereignis "{1}" erforderlich ist.
es: La interfaz '{0}' tiene una interfaz de origen no válida necesaria para incrustar el evento '{1}'.
fr: L'interface '{0}' a une interface source non valide qui est nécessaire à l'incorporation de l'événement '{1}'.
it: L'interfaccia '{0}' contiene un'interfaccia di origine non valida che è necessaria per incorporare l'evento '{1}'.
ja: イベント '{1}' の埋め込みに必要な、インターフェイス '{0}' のソース インターフェイスが無効です。
ko: {0}' 인터페이스에는 '{1}' 이벤트를 포함하는 데 필요한 소스 인터페이스가 잘못 포함되어 있습니다.
pl: Interfejs „{0}” zawiera nieprawidłowy interfejs źródłowy wymagany do osadzenia zdarzenia „{1}”.
pt_br: Interface "{0}" tem uma interface de origem inválida que é necessária para incorporar o evento "{1}".
ru: Интерфейс "{0}" имеет недопустимый исходный интерфейс, который требуется для внедрения события "{1}".
tr: {0}' arabiriminde '{1}' olayını katıştırmak için gereken geçersiz bir kaynak arabirimi var.
zh_hans: 接口“{0}”的源接口无效，该源接口是嵌入事件“{1}”所必需的。
zh_hant: 介面 '{0}' 的來源介面無效，但內嵌事件 '{1}' 需要該介面。

# ERR_InteropTypeMissingAttribute
source: Interop type '{0}' cannot be embedded because it is missing the required '{1}' attribute.
cs: Typ spolupráce {0} nemůže být vložený, protože postrádá požadovaný atribut {1}.
de: Der Interoptyp "{0}" kann nicht eingebettet werden, da er nicht das erforderliche {1}-Attribut aufweist.
es: El tipo de interoperabilidad '{0}' no se puede incrustar porque le falta el atributo '{1}' requerido.
fr: Impossible d'incorporer le type interop '{0}', car il lui manque l'attribut '{1}' obligatoire.
it: Non è possibile incorporare il tipo di interoperabilità '{0}' perché manca l'attributo obbligatorio '{1}'.
ja: 相互運用型 '{0}' は、必須の '{1}' 属性がないため、埋め込むことができません。
ko: 필수 '{1}' 특성이 없으므로 Interop 형식 '{0}'을(를) 포함할 수 없습니다.
pl: Nie można osadzić typu międzyoperacyjnego „{0}”, ponieważ brakuje w nim wymaganego atrybutu „{1}”.
pt_br: Tipo de interoperabilidade "{0}" não pode ser inserido porque está faltando o atributo "{1}" necessário.
ru: Не удается внедрить тип взаимодействия "{0}", так как у него отсутствует обязательный атрибут "{1}".
tr: Gereken '{1}' özniteliği eksik olduğundan birlikte çalışma türü '{0}' eklenemiyor.
zh_hans: 无法嵌入互操作类型“{0}”，因为它缺少必需的“{1}”特性。
zh_hant: 無法內嵌 Interop 類型 '{0}'，因為其遺漏必要的 '{1}' 屬性。

# ERR_NoPIAAssemblyMissingAttribute
source: Cannot embed interop types from assembly '{0}' because it is missing the '{1}' attribute.
cs: Nejde vložit typy spolupráce pro sestavení {0}, protože postrádá atribut {1}.
de: Aus Assembly "{0}" können keine Interoptypen eingebettet werden, da das {1}-Attribut fehlt.
es: No se pueden incrustar tipos de interoperabilidad desde el ensamblado '{0}' porque no tiene el atributo '{1}'.
fr: Impossible d'incorporer les types interop de l'assembly '{0}', car l'attribut '{1}' est manquant.
it: Non è possibile incorporare i tipi di interoperabilità dall'assembly '{0}' perché manca l'attributo '{1}'.
ja: アセンブリ '{0}' に '{1}' 属性が指定されていないため、このアセンブリから相互運用型を埋め込むことはできません。
ko: 어셈블리 '{0}'에 '{1}' 특성이 없으므로 이 어셈블리의 interop 형식을 포함할 수 없습니다.
pl: Nie można osadzić typów międzyoperacyjnych z zestawu „{0}”, ponieważ brakuje atrybutu „{1}”.
pt_br: Não é possível inserir tipos de interoperabilidade do assembly "{0}" porque ele está sem o "{1}" atributo.
ru: Не удается внедрить типы взаимодействия из сборки "{0}" из-за отсутствия в ней атрибута "{1}".
tr: {1}' özniteliği eksik olduğundan '{0}' derlemesinden birlikte çalışma türleri katıştırılamıyor.
zh_hans: 无法嵌入来自程序集“{0}”的互操作类型，因为它缺少“{1}”特性。
zh_hant: 無法從組件 '{0}' 內嵌 Interop 類型，因為其遺漏了 '{1}' 屬性。

# ERR_NoPIAAssemblyMissingAttributes
source: Cannot embed interop types from assembly '{0}' because it is missing either the '{1}' attribute or the '{2}' attribute.
cs: Nejde vložit typy spolupráce ze sestavení {0}, protože postrádá buď atribut {1}, nebo atribut {2}.
de: Aus Assembly "{0}" können keine Interoptypen eingebettet werden, da entweder das {1}-Attribut oder das {2}-Attribut fehlt.
es: No se pueden incrustar tipos de interoperabilidad desde el ensamblado '{0}' porque le falta el atributo '{1}' o '{2}'.
fr: Impossible d'incorporer les types interop de l'assembly '{0}', car l'attribut '{1}' ou '{2}' est manquant.
it: Non è possibile incorporare i tipi di interoperabilità dall'assembly '{0}' perché manca l'attributo '{1}' o '{2}'.
ja: アセンブリ '{0}' には '{1}' 属性または '{2}' 属性が指定されていないため、このアセンブリから相互運用型を埋め込むことはできません。
ko: 어셈블리 '{0}'에 '{1}' 특성 또는 '{2}' 특성이 없으므로 이 어셈블리의 interop 형식을 포함할 수 없습니다.
pl: Nie można osadzić typów międzyoperacyjnych z zestawu „{0}”, ponieważ brakuje atrybutu „{1}” lub „{2}”.
pt_br: Não é possível inserir tipos de interoperabilidade do assembly "{0}" porque ele está sem o atributo "{1}" ou o atributo "{2}".
ru: Внедрение типов взаимодействия из сборки "{0}" невозможно, так как у нее отсутствует атрибут "{1}" или атрибут "{2}".
tr: {1}' veya '{2}' özniteliği eksik olduğundan '{0}' derlemesinden birlikte çalışma türleri katıştırılamıyor.
zh_hans: 无法嵌入来自程序集“{0}”的互操作类型，因为它缺少“{1}”特性或“{2}”特性。
zh_hant: 無法從組件 '{0}' 內嵌 Interop 類型，因為其遺漏了 '{1}' 屬性或 '{2}' 屬性。

# ERR_InteropTypesWithSameNameAndGuid
source: Cannot embed interop type '{0}' found in both assembly '{1}' and '{2}'. Consider setting the 'Embed Interop Types' property to false.
cs: Nejde vložit typ spolupráce {0} nalezený v sestavení {1} i {2}. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Interoptyp "{0}", der sowohl in Assembly "{1}" als auch in Assembly "{2}" gefunden wurde, kann nicht eingebettet werden. Legen Sie die Eigenschaft "Interoptypen einbetten" auf "False" fest.
es: No se puede incrustar el tipo de interoperabilidad '{0}' encontrado en los ensamblados '{1}' y '{2}'. Puede establecer la propiedad 'Incrustar tipos de interoperabilidad' en false.
fr: Impossible d'incorporer le type interop '{0}' trouvé dans les assemblys '{1}' et '{2}'. Attribuez à la propriété 'Incorporer les types interop' la valeur false.
it: Non è possibile incorporare il tipo di interoperabilità '{0}' trovato negli assembly '{1}' e '{2}'. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su False.
ja: アセンブリ '{1}' および '{2}' の両方に見つかった相互運用型 '{0}' は埋め込むことができません。'相互運用機能型の埋め込み' プロパティを false に設定することを検討してください。
ko: 어셈블리 '{1}'과(와) '{2}' 모두에 있는 interop 형식 '{0}'을(를) 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정하세요.
pl: Nie można osadzić typu międzyoperacyjnego „{0}” znajdującego się jednocześnie w zestawach „{1}” i „{2}”. Rozważ ustawienie wartości false dla właściwości „Osadź typy międzyoperacyjne”.
pt_br: Não é possível inserir o tipo de interoperabilidade "{0}" encontrado em ambos os assemblies "{1}" e "{2}". Considere configurar a propriedade "Incorporar Tipos de Interoperabilidade" como falsa.
ru: Не удается внедрить тип взаимодействия "{0}", находящийся в обеих сборках "{1}" и "{2}". Попробуйте задать свойству "Внедрить типы взаимодействия" значение False.
tr: {1}' ve '{2}' derlemelerinde bulunan birlikte çalışma türü '{0}' eklenemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入在程序集“{1}”和“{2}”中同时找到的互操作类型“{0}”。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 無法內嵌組件 '{1}' 和 '{2}' 中都有的 Interop 類型 '{0}'。請考慮將 [內嵌 Interop 類型] 屬性設定為 false。

# ERR_LocalTypeNameClash
source: Embedding the interop type '{0}' from assembly '{1}' causes a name clash in the current assembly. Consider setting the 'Embed Interop Types' property to false.
cs: Vložení typu spolupráce {0} ze sestavení {1} způsobí konflikt názvů v aktuálním sestavení. Zvažte nastavení vlastnosti Vložit typy spolupráce na false.
de: Durch Einbetten des Interoptyps "{0}" aus der Assembly "{1}" wird ein Namenskonflikt in der aktuellen Assembly verursacht. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf "False" fest.
es: Si se incrusta el tipo de interoperabilidad '{0}' desde el ensamblado '{1}', se producirá un conflicto de nombre en el ensamblado actual. Puede establecer la propiedad 'Incrustar tipos de interoperabilidad' en false.
fr: L'incorporation du type interop '{0}' de l'assembly '{1}' entraîne un conflit de noms dans l'assembly actuel. Attribuez à la propriété 'Incorporer les types interop' la valeur false.
it: L'incorporamento del tipo di interoperabilità '{0}' dall'assembly '{1}' causa un conflitto di nomi nell'assembly corrente. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: アセンブリ '{1}' から相互運用型 '{0}' を埋め込むと、現在のアセンブリで名前の競合が発生します。'相互運用機能型の埋め込み' プロパティを false に設定することを検討してください。
ko: {1}' 어셈블리의 interop 형식 '{0}'을(를) 포함하면 현재 어셈블리에서 이름 충돌이 발생합니다. 'Interop 형식 포함' 속성을 false로 설정하세요.
pl: Osadzenie typu międzyoperacyjnego „{0}” z zestawu „{1}” powoduje konflikt nazw w bieżącym zestawie. Rozważ ustawienie wartości false dla właściwości „Osadź typy międzyoperacyjne”.
pt_br: Incorporar o tipo de interoperabilidade "{0}" do assembly "{1}" causa um conflito de nome no assembly atual. Considere definir a propriedade "Incorporar Tipos de Interoperabilidade" como falsa.
ru: Внедрение типа взаимодействия "{0}" из сборки "{1}" служит причиной конфликта имен в текущей сборке. Попробуйте задать свойству "Внедрить типы взаимодействия" значение False.
tr: {1}' derlemesinden '{0}' birlikte çalışma türünün katıştırılması geçerli derlemede ad çakışmasına neden oluyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 嵌入来自程序集“{1}”的互操作类型“{0}”会导致当前程序集中发生名称冲突。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 從組件 '{1}' 內嵌 Interop 類型 '{0}'，會造成目前組件中的名稱衝相突。請考慮將 [內嵌 Interop 類型] 屬性設定為 false。

# WRN_ReferencedAssemblyReferencesLinkedPIA
source: A reference was created to embedded interop assembly '{0}' because of an indirect reference to that assembly created by assembly '{1}'. Consider changing the 'Embed Interop Types' property on either assembly.
cs: Vytvořil se odkaz na vložené sestavení vzájemné spolupráce {0}, protože existuje nepřímý odkaz na toto sestavení ze sestavení {1}. Zvažte změnu vlastnosti Vložit typy vzájemné spolupráce u obou sestavení.
de: Es wurde ein Verweis auf die eingebettete Interopassembly "{0}" aufgrund eines indirekten Verweises auf diese Assembly, der von Assembly "{1}" erstellt wurde, erstellt. Ändern Sie ggf. für beide Assemblys die Eigenschaft "Interoptypen einbetten".
es: Se creó una referencia al ensamblado de interoperabilidad '{0}' incrustado debido a una referencia indirecta a ese ensamblado creado por el ensamblado '{1}'. Puede cambiar la propiedad 'Incrustar tipos de interoperabilidad' en cualquiera de los ensamblados.
fr: Une référence a été créée pour l'assembly d'interopérabilité incorporé '{0}' en raison d'une référence indirecte à cet assembly créée par l'assembly '{1}'. Modifiez la propriété 'Incorporer les types interop' sur l'un ou l'autre de ces assemblys.
it: È stato creato un riferimento all'assembly di interoperabilità '{0}' incorporato a causa di un riferimento indiretto a tale assembly creato dall'assembly '{1}'. Provare a modificare la proprietà 'Incorpora tipi di interoperabilità' in uno degli assembly.
ja: 間接的な参照がアセンブリ '{1}' によって作成されたため、埋め込み相互運用機能アセンブリ '{0}' への参照が作成されました。いずれかのアセンブリで '相互運用型の埋め込み' プロパティを変更することを検討してください。
ko: {1}' 어셈블리에서 만든 어셈블리에 대한 간접 참조 때문에 포함된 interop 어셈블리 '{0}'에 대한 참조를 만들었습니다. 두 어셈블리 중 하나에서 'Interop 형식 포함' 속성을 변경하세요.
pl: Utworzono odwołanie do osadzonego zestawu międzyoperacyjnego „{0}” z powodu pośredniego odwołania do tego zestawu utworzonego przez zestaw „{1}”. Rozważ zmianę właściwości „Osadź typy międzyoperacyjne” w jednym z zestawów.
pt_br: Foi criada uma referência ao assembly de interoperabilidade inserido "{0}" devido a uma referência indireta ao assembly criado pelo assembly "{1}". Considere alterar a propriedade "Inseir Tipos de Interoperabilidade" em qualquer assembly.
ru: Была создана ссылка на внедренную сборку взаимодействия "{0}", поскольку существует косвенная ссылка на эту сборку, созданная сборкой "{1}". Рассмотрите возможность изменения свойства "Внедрять типы взаимодействия" в любой сборке.
tr: {1}' derlemesi tarafından '{0}' gömülü birlikte çalışma derlemesine dolaylı bir başvuru oluşturulduğundan, bu birlikte çalışma derlemesine yönelik bir başvuru oluşturuldu. İki derlemeden birinde 'Embed Interop Types' özelliğini değiştirebilirsiniz.
zh_hans: 由于程序集“{1}”创建了对嵌入互操作程序集“{0}”的间接引用，因此创建了对该程序集的引用。请考虑更改其中一个程序集的“嵌入互操作类型”属性。
zh_hant: 已建立內嵌 Interop 組件 '{0}' 的參考，因為該組件的間接參考已由組件 '{1}' 所建立。請考慮變更其中任一組件的 [內嵌 Interop 類型] 屬性。

# WRN_ReferencedAssemblyReferencesLinkedPIA_Title
source: A reference was created to embedded interop assembly because of an indirect assembly reference
cs: Byl vytvořený odkaz na vložené definiční sestavení z důvodu nepřímého odkazu na toto sestavení.
de: Aufgrund eines indirekten Assemblyverweises wurde ein Verweis zur eingebetteten Interop-Assembly erstellt
es: Se creó una referencia para el ensamblaje de interoperabilidad incrustado debido a una referencia al ensamblaje indirecta
fr: Une référence a été créée pour l'assembly d'interopérabilité incorporé en raison d'une référence indirecte à cet assembly
it: È stato creato un riferimento all'assembly di interoperabilità incorporato a causa di un riferimento indiretto a tale assembly
ja: 間接的なアセンブリの参照があるため、埋め込み相互運用機能アセンブリに対して参照が作成されました
ko: 간접 어셈블리 참조로 인해 포함된 interop 어셈블리에 대한 참조를 만들었습니다.
pl: Utworzono odwołanie do osadzonego zestawu międzyoperacyjnego z powodu pośredniego odwołania do tego zestawu
pt_br: Foi criada uma referência ao assembly de interoperabilidade inserido devido a uma referência de assembly indireta
ru: Создана ссылка на внедренную сборку взаимодействия из-за непрямой ссылки на сборку
tr: Dolaylı derleme başvurusundan dolayı, gömülü birlikte çalışma derlemesine bir başvuru oluşturuldu
zh_hans: 由于使用间接程序集引用，因此创建了对嵌入互操作程序集的引用
zh_hant: 已建立內嵌 Interop 組件的參考，因為參考間接組件
