Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NewConstraintCannotHaveRequiredMembers
source: '{2}' cannot satisfy the 'new()' constraint on parameter '{1}' in the generic type or or method '{0}' because '{2}' has required members.
cs: {2} nemůže splňovat omezení new() u parametru {1} v obecném typu nebo metodě {0}, protože {2} má požadované členy.
fr: '{2}' ne peut pas satisfaire la contrainte 'new()' sur le paramètre '{1}' dans le type générique ou la méthode '{0}', car '{2}' a des membres obligatoires.
it: '{2}' non è in grado di soddisfare il vincolo 'new()' sul parametro '{1}' nel tipo generico o nel metodo '{0}' perché '{2}' contiene membri obbligatori.
ja: '{2}'に必要なメンバーがあるため、'{2}' は、ジェネリック型またはメソッド '{0}'のパラメーター '{1}' の 'new()' 制約を満たすことができません。
pl: „{2}” nie może spełnić ograniczenia „new()” dla parametru „{1}” w typie ogólnym lub metodzie „{0}”, ponieważ „{2}” ma wymagane elementy członkowskie.
pt_br: '{2}' não pode satisfazer a restrição 'new()' no parâmetro '{1}' no tipo genérico ou método '{0}' porque '{2}' tem membros requeridos.
ru: "{2}" не соответствует ограничению "new()" параметра "{1}" в универсальном типе или методе "{0}", поскольку у "{2}" есть обязательные элементы.
zh_hans: '{2}' 无法满足泛型类型或方法 '{1}'中参数 '{0}'的 'new()' 约束，因为 '{2}'具有必需的成员。
zh_hant: '{2}' 無法滿足泛型型別或方法 '{0}' 中參數 '{1}' 的 'new()' 限制式，因為 '{2}' 具有必要的成員。

# ERR_NewlinesAreNotAllowedInsideANonVerbatimInterpolatedString
source: Newlines inside a non-verbatim interpolated string are not supported in C# {0}. Please use language version {1} or greater.
cs: V jazyce C# {0} se nové řádky uvnitř neliterálního interpolovaného řetězce nepodporují. Použijte prosím verzi jazyka {1} nebo novější.
fr: Les nouvelles lignes à l'intérieur d'une chaîne interpolée non textuelle ne sont pas prises en charge en C# {0}. Veuillez utiliser la version linguistique {1} ou supérieure.
it: Nuove linee all'interno di una stringa interpolata non verbatim non sono supportate in C# {0}. Usare la versione del linguaggio {1} o le versioni successive.
ja: 非逐語的な補間された文字列内の改行は、C# {0} ではサポートされていません。{1} またはそれ以上の言語バージョンを使用してください。
pl: Nowe wiersze wewnątrz ciągu interpolowanego nie będącego ciągiem dosłownym nie są obsługiwane w {0} języka C#. Użyj wersji językowej {1} lub nowszej.
pt_br: Novas linhas dentro de uma cadeia de caracteres interpolada não textual não são suportadas no C# {0}. Use a versão {1} da linguagem ou superior.
ru: Новые строки внутри небуквальной интерполированной строки не поддерживаются в C# {0}. Используйте версию языка {1} или более позднюю.
zh_hans: C# {0}不支持非逐字内插字符串内的换行符。请使用语言版本 {1} 或更高版本。
zh_hant: C# {0} 不支援非逐字差補字串內的新行。請使用語言版本 {1} 或更高版本。

# ERR_NoConvToIAsyncDispWrongAsync
source: '{0}': type used in an asynchronous using statement must implement 'System.IAsyncDisposable' or implement a suitable 'DisposeAsync' method. Did you mean 'using' rather than 'await using'?
fr: '{0}' : le type utilisé dans une instruction en utilisant asynchrone doit implémenter « System.IAsyncDisposable » ou implémenter une méthode « DisposeAsync » appropriée. Vouliez-vous dire « utiliser » plutôt que « attendre d’utiliser » ?
it: '{0}': il tipo usato in un'istruzione using asincrona deve implementare 'System.IAsyncDisposable' o implementare un metodo 'DisposeAsync' adatto. Si intendeva 'using' invece di 'await using'?
pl: „{0}”: typ użyty w asynchronicznej instrukcji using musi implementować typ „System.IAsyncDisposable” lub odpowiednią metodę „DisposeAsync”. Czy chodzi Ci o instrukcję „using” zamiast „await using”?
pt_br: '{0}': o tipo usado em uma instrução using assíncrona deve implementar 'System.IAsyncDisposable' ou implementar um método 'DisposeAsync' adequado. Você quis dizer 'using' em vez de 'await using'?
ru: "{0}": тип, используемый в асинхронном операторе using, должен допускать реализовывать "System.IAsyncDisposable" или подходящий метод "DisposeAsync". Возможно, вы имели в виду "using", а не "await using"?
zh_hans: '{0}': 异步 using 语句中使用的类型必须实现 'System.IAsyncDisposable' 或实现适用的 'DisposeAsync' 方法。是否希望使用 'using' 而非 'await using'?
zh_hant: '{0}': 在非同步 using 陳述式中使用的類型，必須可隱含地轉換為 'System.IAsyncDisposable' 或實作合適的 'DisposeAsync' 方法。您指的是否為 'using'，而非 'await using'?

# ERR_NoConvToIDispWrongAsync
source: '{0}': type used in a using statement must implement 'System.IDisposable'. Did you mean 'await using' rather than 'using'?
fr: '{0}' : le type utilisé dans une instruction en utilisant doit implémenter « System.IDisposable ». Vouliez-vous dire « attendre d'utiliser » plutôt que « utiliser » ?
it: '{0}': il tipo usato in un'istruzione using deve implementare 'System.IDisposable'. Si intendeva 'await using' invece di 'using'?
pl: „{0}”: typ użyty w instrukcji using musi implementować typ „System.IDisposable”. Czy chodzi Ci o instrukcję „await using” zamiast „using”?
pt_br: '{0}': o tipo usado em uma instrução 'using' deve implementar 'System.IDisposable'. Você quis dizer 'await using' em vez de 'using'?
ru: "{0}": тип, используемый в операторе using, должен реализовывать "System.IDisposable". Возможно, вы имели в виду "await using", а не "using"?
zh_hans: '{0}': using 语句中使用的类型必须实现 'System.IDisposable'。是否希望使用 'await using' 而非 'using'?
zh_hant: '{0}': using 陳述式中使用的類型必須可以隱含轉換為 'System.IDisposable'。您指的是 'await using' 而不是 'using' 嗎?

# ERR_NoConversionForCallerArgumentExpressionParam
source: CallerArgumentExpressionAttribute cannot be applied because there are no standard conversions from type '{0}' to type '{1}'
cs: Atribut CallerArgumentExpressionAttribute nejde použít, protože neexistuje žádný standardní převod z typu {0} na {1}.
fr: Impossible d'appliquer CallerArgumentExpressionAttribute, car il n'existe pas de conversion standard du type '{0}' en type '{1}'
it: Non è possibile applicare CallerArgumentExpressionAttribute perché non sono presenti conversioni standard dal tipo '{0}' al tipo '{1}'
ja: 型 '{0}' を型 '{1}' に変換する標準変換が存在しないため、CallerArgumentExpressionAttribute を適用することはできません
pl: Nie można zastosować atrybutu CallerArgumentExpressionAttribute, ponieważ nie ma standardowych konwersji z typu "{0}" na typ "{1}"
pt_br: CallerArgumentExpressionAttribute não pode ser aplicado porque não há conversões padrão do tipo '{0}' para o tipo '{1}'
ru: Невозможно применить CallerArgumentExpressionAttribute, поскольку нет стандартных преобразований из типа "{0}" в тип "{1}".
zh_hans: 无法应用 CallerFilePathAttribute，因为不存在从类型“{0}”到类型“{1}”的标准转换
zh_hant: 無法套用 CallerArgumentExpressionAttribute，因為從類型 '{0}' 到類型 '{1}' 沒有標準轉換

# ERR_NoCopyConstructorInBaseType
source: No accessible copy constructor found in base type '{0}'.
cs: V základním typu {0} se nenašel žádný přístupný kopírovací konstruktor.
fr: Aucun constructeur de copie accessible n'a été trouvé dans le type de base '{0}'.
it: Non è stato trovato alcun costruttore di copia accessibile nel tipo di base '{0}'.
ja: 基本型 '{0}' にアクセス可能なコピー コンストラクターが見つかりませんでした。
pl: W typie podstawowym „{0}” nie znaleziono dostępnego konstruktora kopiującego.
pt_br: Não foi encontrado nenhum construtor de cópia acessível no tipo base '{0}'.
ru: Доступный конструктор копий не найден в базовом типе "{0}".
zh_hans: 在基类型“{0}”中找不到可访问的复制构造函数。
zh_hant: 在基底類型 '{0}' 中找不到可存取的複製建構函式。

# ERR_NoDelegateConstraint
source: Keyword 'delegate' cannot be used as a constraint. Did you mean 'System.Delegate'?
cs: Klíčové slovo delegate nelze použít jako omezení. Měli jste na mysli System.Delegate?
fr: Le mot clé « délégué » ne peut pas être utilisé comme contrainte. Vouliez-vous dire « System.Delegate » ?
it: Impossibile utilizzare la parola chiave 'delegate' come vincolo. Si intendeva 'System.Delegate'?
ja: キーワード 'delegate' は制約として使用できません。'System.Delegate' のつもりでしたか?
pl: Słowo kluczowe „delegat” nie może być używane jako ograniczenie. Czy chodziło Ci o „System.Delegate”?
pt_br: A palavra-chave “delegate” não pode ser usada como uma restrição. Você quis dizer “System.Delegate”?
ru: Ключевое слово \"delegate\" не может использоваться в качестве ограничения. Возможно, вы имели в виду \"System.Delegate\"?
zh_hans: 关键字 \"delegate\" 不能用作约束。你的意思是 \"System.Delegate\" 吗?
zh_hant: 關鍵字 'delegate' 無法做為限制式。您是指 'System.Delegate'?

# ERR_NoEnumConstraint
source: Keyword 'enum' cannot be used as a constraint. Did you mean 'struct, System.Enum'?
cs: Klíčové slovo enum nelze použít jako omezení. Měli jste na mysli struct, System.Enum?
fr: Le mot clé 'enum' ne peut pas être utilisé comme contrainte. Vouliez-vous dire « struct, System.Enum » ?
it: Impossibile utilizzare la parola chiave 'enum' come vincolo. Si intendeva 'struct, System.Enum'?
ja: キーワード 'enum' は制約として使用できません。'struct, System.Enum' のつもりでしたか?
pl: Słowo kluczowe „enum” nie może być używane jako ograniczenie. Czy chodziło Ci o „struct, System.Enum”?
pt_br: A palavra-chave “enum” não pode ser usada como uma restrição. Você quis dizer “struct, System.Enum”?
ru: Ключевое слово \"enum\" не может использоваться в качестве ограничения. Возможно, вы имели в виду \"struct, System.Enum\"?
zh_hans: 关键字 \"enum\" 不能用作约束。你的意思是 \"struct, System.Enum\" 吗?
zh_hant: 關鍵字 'enum' 無法做為限制式。您是指 'struct, System.Enum'?

# ERR_NoImplicitConvTargetTypedConditional
source: Conditional expression is not valid in language version {0} because a common type was not found between '{1}' and '{2}'. To use a target-typed conversion, upgrade to language version {3} or greater.
cs: Logický výraz není platný ve verzi jazyka {0}, protože mezi {1} a {2} se nenašel společný typ. Pokud chcete použít převod na cílový typ, upgradujte na jazykovou verzi {3} nebo vyšší.
fr: L’expression conditionnelle n’est pas valide dans la version de langage {0}, car il n’existe pas de type commun entre « {1} » et « {2} ». Pour utiliser une conversion de type cible, effectuez une mise à niveau vers la version de langage {3} ou ultérieure.
it: L'espressione condizionale non è valida nella versione del linguaggio {0} perché non è stato trovato un tipo comune tra '{1}' e '{2}'. Per usare una conversione tipizzata come destinazione, eseguire l'aggiornamento alla versione {3} o a versioni successive del linguaggio.
ja: '{1}' と '{2}' の間に共通の型が見つからないため、言語バージョン {0} で条件式が無効です。ターゲットにより型指定された変換を使用するには、言語バージョン {3} 以上にアップグレードしてください。
pl: Wyrażenie warunkowe nie jest prawidłowe w wersji językowej {0} ponieważ nie znaleziono typu wspólnego między "{1}" i "{2}". Aby użyć konwersji z typem docelowym, uaktualnij do wersji językowej {3} lub nowszej.
pt_br: A expressão condicional não é válida na versão de linguagem {0} porque não foi encontrado um tipo comum entre '{1}' e '{2}'. Para usar uma conversão com tipo de destino, atualize para a versão de linguagem {3} ou posterior.
ru: Условное выражение недопустимо в версии языка {0}, поскольку между "{1}" и "{2}" не найден общий тип. Для использования преобразования с целевым типом обновите язык до версии {3} или более поздней.
zh_hans: 语言版本 {0} 中的条件表达式无效，因为在“{1}”和“{2}”之间未找到通用类型。如需使用目标类型转换，请升级到语言版本 {3} 或更高版本。
zh_hant: 因為在 '{1}' 和 '{2}' 之間找不到通用類型，所以在語言版本 {0} 中條件運算式無效。若要使用以目標為類型的轉換，請升級至語言版本 {3} 或更高版本。

# ERR_NoModifiersOnUsing
source: Modifiers cannot be placed on using declarations
fr: Les modificateurs ne peuvent pas être placés en utilisant des déclarations
it: Non è possibile inserire modificatori nelle dichiarazioni using
pl: Modyfikatorów nie można umieszczać przy użyciu deklaracji usług
pt_br: Os modificadores não podem ser colocados em declarações de uso
ru: Модификаторы нельзя разместить при использовании объявлений.
zh_hans: 修饰符不能放置在 using 声明上
zh_hant: 修飾元不能置於 using 宣告中

# ERR_NoOutputDirectory
source: Output directory could not be determined
cs: Nepovedlo se určit výstupní adresář.
fr: Impossible de déterminer le répertoire de sortie
it: Non è stato possibile individuare la directory di output
ja: 出力ディレクトリを特定できませんでした
pl: Nie można było określić katalogu wyjściowego
pt_br: Não foi possível determinar o diretório de saída
ru: Не удалось определить выходной каталог
zh_hans: 无法确定输出目录
zh_hant: 無法判斷輸出目錄

# ERR_NonPrivateAPIInRecord
source: Record member '{0}' must be private.
cs: Člen záznamu {0} musí být privátní.
fr: Le membre d'enregistrement '{0}' doit être privé.
it: Il membro del record '{0}' deve essere privato.
ja: レコード メンバー '{0}' は private でなければなりません。
pl: Składowa rekordu „{0}” musi być prywatna.
pt_br: O membro do registro '{0}' precisa ser privado.
ru: Элемент записи "{0}" должен быть закрытым.
zh_hans: 记录成员“{0}”必须是非公开的。
zh_hant: 記錄成員 '{0}' 必須為私人。

# ERR_NonProtectedAPIInRecord
source: Record member '{0}' must be protected.
cs: Člen záznamu {0} musí být chráněný.
fr: Le membre d'enregistrement '{0}' doit être protégé.
it: Il membro del record '{0}' deve essere protetto.
ja: レコード メンバー '{0}' は protected でなければなりません。
pl: Składowa rekordu „{0}” musi być chroniona.
pt_br: O membro do registro '{0}' precisa ser protegido.
ru: Элемент записи "{0}" должен быть защищенным.
zh_hans: 必须保护记录成员“{0}”。
zh_hant: 記錄成員 '{0}' 必須受保護。

# ERR_NonPublicAPIInRecord
source: Record member '{0}' must be public.
cs: Člen záznamu {0} musí být veřejný.
fr: Le membre d'enregistrement '{0}' doit être public.
it: Il membro del record '{0}' deve essere pubblico.
ja: レコード メンバー '{0}' は public でなければなりません。
pl: Składowa rekordu „{0}” musi być publiczna.
pt_br: O membro do registro '{0}' precisa ser público.
ru: Элемент записи "{0}" должен быть открытым.
zh_hans: 记录成员“{0}”必须是公共的。
zh_hant: 記錄成員 '{0}' 必須為公用。

# ERR_NonPublicParameterlessStructConstructor
source: The parameterless struct constructor must be 'public'.
cs: Konstruktor struktury bez parametrů musí být public.
fr: Le constructeur de structure sans paramètre doit être « public ».
it: Il costruttore struct senza parametri deve essere 'public'.
ja: パラメーターなしの構造体コンストラクターは 'パブリック' でなければなりません。
pl: Konstruktor struktury bez parametrów musi mieć wartość „public”.
pt_br: O Construtor struct sem parâmetros deve ser 'Public'.
ru: Конструктор структуры без параметров должен быть публичным.
zh_hans: 参数结构构造函数必须是“public”。
zh_hant: 無參數結構建構函式必須是 'public'。

# ERR_NotEnoughCloseBracesForRawString
source: The interpolation must end with the same number of closing braces as the number of '$' characters that the raw string literal started with.
cs: Interpolace musí končit stejným počtem uzavíracích složených závorek jako počet znaků $, kterými začal literál nezpracovaného řetězce.
fr: L'interpolation doit se terminer par le même nombre d'accolades fermantes que le nombre de caractères'$' par lesquels le littéral de la chaîne brute a commencé.
it: L'interpolazione deve terminare con lo stesso numero di parentesi graffe di chiusura del numero di caratteri '$' con cui è iniziato il valore letterale stringa non elaborato.
ja: 補間は、生文字列リテラルの開始文字である '$' の数と同じ数の終わり波かっこで終わる必要があります。
pl: Interpolacja musi kończyć się taką samą liczbą zamykających nawiasów klamrowych jak liczba znaków „$” które rozpoczynają literał nieprzetworzonego ciągu.
pt_br: A interpolação deve terminar com o mesmo número de chaves de fechamento que o número de caracteres “$” com o qual a literal da cadeia de caracteres bruta começou.
ru: Интерполяция должна заканчиваться количеством закрывающих фигурных скобок, совпадающим с количеством символов \"$\", с которых начинается литерал необработанной строки.
zh_hans: 内插必须以与原始字符串字面量开始的 \"$\" 字符数相同的右大括号数结束。
zh_hant: 內插補點結尾的右括弧數目必須與原始字串常值開頭的 '$' 字元數相同。

# ERR_NotEnoughQuotesForRawString
source: Not enough quotes for raw string literal.
cs: Pro literál nezpracovaného řetězce není dost uvozovek.
fr: Guillemets insuffisants pour le littéral de chaîne brute
it: Virgolette insufficienti per il valore letterale stringa non elaborato.
ja: 生文字列リテラルに十分な数の引用符がありません。
pl: Za mało cudzysłowów dla literału nieprzetworzonego ciągu.
pt_br: Não há aspas suficientes para a literal da cadeia de caracteres bruta.
ru: Недостаточно кавычек для литерала необработанной строки.
zh_hans: 原始字符串字面量的引号不足。
zh_hant: 原始字串常值的引號不足。

# ERR_NotInstanceInvalidInterpolatedStringHandlerArgumentName
source: '{0}' is not an instance method, the receiver or extension receiver parameter cannot be an interpolated string handler argument.
it: '{0}' non è un metodo di istanza. Il ricevitore non può essere un argomento del gestore di stringhe interpolate.
pt_br: "{0}" não é um método de instância, o receptor ou o parâmetro do receptor de extensão não pode ser um argumento de manipulador de cadeia de caracteres interpolado.
ru: Поскольку "{0}" не является методом экземпляра, получатель не может быть аргументом обработчика интерполированных строк.
zh_hans: “{0}”不是实例方法，接收器不能是内插字符串处理程序参数。

# ERR_NotOverridableAPIInRecord
source: '{0}' must allow overriding because the containing record is not sealed.
cs: {0} musí povolovat přepisování, protože obsahující záznam není zapečetěný.
fr: '{0}' doit autoriser la substitution, car l'enregistrement contenant n'est pas sealed.
it: '{0}' deve consentire l'override perché il record contenitore non è sealed.
ja: '{0}' ではオーバーライドを許可する必要があります。これが含まれているレコードが sealed ではないためです。
pl: Element „{0}” musi zezwalać na przesłanianie, ponieważ zawierający go rekord nie jest zapieczętowany.
pt_br: '{0}' precisa permitir a substituição porque o registro contentor não está selado.
ru: "{0}" должен допускать переопределение, поскольку содержащая его запись не является запечатанной.
zh_hans: “{0}”必须允许替代，因为包含的记录未密封。
zh_hant: '{0}' 必須允許覆寫，因為包含的記錄並未密封。

# ERR_NotRefStructConstraintNotSatisfied
source: The type '{2}' may not be a ref struct or a type parameter allowing ref structs in order to use it as parameter '{1}' in the generic type or method '{0}'
fr: Le type « {2} » ne peut pas être un type struct ref ou un paramètre de type autorisant des ref structs afin de l’utiliser comme paramètre « {1} » dans le type ou la méthode générique « {0} »
it: Il tipo '{2}' non può essere un ref struct o un parametro di tipo che consente ref struct perché possa essere utilizzato come parametro '{1}' nel tipo generico o nel metodo '{0}'
pl: Typ „{2}” nie może być strukturą ref ani parametrem typu zezwalającym na struktury ref, aby użyć go jako parametru „{1}” w typie ogólnym lub metodzie „{0}”
pt_br: O tipo "{2}" pode não ser um ref struct ou um parâmetro de tipo que permite ref structs para ser usado como parâmetro "{1}" no tipo genérico ou método "{0}"
ru: Тип "{2}" не может быть ссылочной структурой или параметром типа, позволяющим использовать ссылочные структуры в качестве параметра "{1}" в универсальном типе или методе "{0}".
zh_hans: 类型 "{2}" 不能是 ref 结构或允许 ref 结构的类型参数，以便在泛型类型或方法 "{0}" 中将其用作参数 "{1}"
zh_hant: 類型 '{2}' 不得為 ref struct，也不得為允許 ref struct 的型別參數，才能在泛型型別或方法 '{0}' 中將其用為參數 '{1}'

# ERR_NullInvalidInterpolatedStringHandlerArgumentName
source: null is not a valid parameter name. To get access to the receiver of an instance method, use the empty string as the parameter name.
cs: null není platný název parametru. Pokud chcete získat přístup k příjemci instanční metody, použijte jako název parametru prázdný řetězec.
fr: null n'est pas un nom de paramètre valide. Pour avoir accès au récepteur d'une méthode d'instance, utilisez la chaîne vide comme nom de paramètre.
it: Null non è un nome di parametro valido. Per ottenere l'accesso al ricevitore di un metodo di istanza, usare la stringa vuota come nome del parametro.
ja: null は有効なパラメーター名ではありません。インスタンス メソッドのレシーバーへのアクセスを取得するには、パラメーター名として空の文字列を使用します。
pl: Wartość null nie jest prawidłową nazwą parametru. Aby uzyskać dostęp do odbiorcy metody wystąpienia, użyj pustego ciągu jako nazwy parametru.
pt_br: null não é um nome de parâmetro válido. Para obter acesso ao receptor de um método de instância, use a cadeia de caracteres vazia como o nome do parâmetro.
ru: "Null" не является допустимым именем параметра. Для получения доступа к приемнику метода экземпляра используйте пустую строку в качестве имени параметра.
zh_hans: null 不是有效的参数名称。若要获取对实例方法接收器的访问权限，请使用空字符串作为参数名。
zh_hant: null 不是有效的參數名稱。若要取得執行個體方法接收器的存取權，請使用空字串做為參數名稱。

# ERR_NullableDirectiveQualifierExpected
source: Expected 'enable', 'disable', or 'restore'
cs: Očekávala se hodnota enable, disable nebo restore.
de: "enable", "disable" oder "restore" erwartet.
es: Se esperaba "enable", "disable" o "restore".
fr: 'enable', 'disable' ou 'restore' attendu
it: È previsto 'enable', 'disable' o 'restore'
ja: 'enable'、'disable'、'restore' のいずれかが必要でした
ko: 'enable', 'disable' 또는 'restore'가 필요합니다.
pl: Oczekiwano opcji „enable”, „disable” lub „restore”
pt_br: Esperava-se 'enable', 'disable' ou 'restore'
ru: Ожидается "enable", "disable" или "restore"
tr: 'enable', 'disable' veya 'restore' bekleniyor
zh_hans: 应为 "enable"、"disable" 或 "restore"
zh_hant: 應為 'enable'、'disable' 或 'restore'

# ERR_NullableDirectiveTargetExpected
source: Expected 'warnings', 'annotations', or end of directive
cs: Očekávala se možnost warnings nebo annotations nebo konec direktivy.
de: Erwartet wurde "warnings", "annotations" oder das Ende der Anweisung.
es: Se esperaban "advertencias", "anotaciones" o el final de la directiva
fr: 'warnings', 'annotations' ou fin de directive attendu
it: È previsto 'warnings', 'annotations' o la fine della direttiva
ja: 'warnings'、'annotations'、またはディレクティブの終わりが必要です
ko: 'warnings', 'annotations' 또는 지시문의 끝이 필요합니다.
pl: Oczekiwano opcji „warnings” lub „annotations” albo końca dyrektywy
pt_br: 'Warnings', 'annotations' ou fim de diretiva esperado
ru: Ожидаемые значения: "warnings", "annotations" или конец директивы
tr: 'Uyarılar', 'ek açıklama' veya yönergenin sonu bekleniyordu
zh_hans: 应为“警告”、“注释”或指令结束
zh_hant: 必須是 'warnings'、'annotations' 或指示詞結尾

# ERR_NullableOptionNotAvailable
source: Invalid '{0}' value: '{1}' for C# {2}. Please use language version '{3}' or greater.
cs: Neplatná hodnota {0}: {1} pro jazyk C# {2}. Použijte prosím verzi jazyka {3} nebo vyšší.
de: Ungültiger Wert für "{0}": "{1}" für C# {2}. Verwenden Sie Sprachversion {3} oder höher.
es: Valor "{0}" no válido: "{1}" para C# {2}. Use la versión del lenguaje "{3}" o una posterior.
fr: Valeur '{0}' non valide : '{1}' pour C# {2}. Utilisez la version de langage '{3}' ou une version ultérieure.
it: Valore '{1}' di '{0}' non valido per C# {2}. Usare la versione {3} o versioni successive del linguaggio.
ja: '{0}' 値が無効です: C# {2} に対する '{1}'。言語バージョン '{3}' 以上をご使用ください。
ko: C# {2}의 '{0}' 값 '{1}'이(가) 잘못되었습니다. 언어 버전 '{3}' 이상을 사용하세요.
pl: Nieprawidłowa wartość „{0}”: „{1}” dla języka C# {2}. Użyj wersji języka „{3}” lub nowszej.
pt_br: Valor de '{0}' inválido: '{1}' para C# {2}. Use a versão da linguagem '{3}' ou superior.
ru: Недопустимое значение "{0}": "{1}" для C# {2}. Используйте версию языка "{3}" или более позднюю.
tr: C# {2} için geçersiz '{0}' değeri: '{1}'. Lütfen '{3}' veya daha yüksek bir dil sürümü kullanın.
zh_hans: 无效的 {0} 值: C# {2} 的“{1}”。请使用语言版本 {3} 或更高版本。
zh_hant: '{0}' 值無效: 若是 C# {2}，則為 '{1}'。請使用 '{3}' 或更高的語言版本。
