Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_VarargsAsync
source: __arglist is not allowed in the parameter list of async methods
cs: Klíčové slovo __arglist není povolené v seznamu parametrů asynchronních metod.
de: __arglist ist in der Parameterliste von Async-Methoden nicht zulässig.
es: No se permite __arglist en la lista de parámetros de métodos asincrónicos
fr: __arglist n'est pas autorisé dans la liste de paramètres de méthodes async
it: __arglist non è consentito nell'elenco di parametri di metodi asincroni
ja: __arglist は、非同期メソッドのパラメーター リストに含めることはできません
ko: __arglist는 비동기 메서드의 매개 변수 목록에 사용할 수 없습니다.
pl: Element „__arglist” jest niedozwolony na liście parametrów metod asynchronicznych.
pt_br: __arglist não é permitido na lista de parâmetros dos métodos assíncronos
ru: Недопустимо использовать __arglist в списке параметров асинхронного метода.
tr: Zaman uyumsuz yöntemlerin parametre listesinde __arglist kullanılamaz
zh_hans: 异步方法的参数列表中不允许有 __arglist
zh_hant: 非同步方法的參數清單中不可出現 __arglist

# ERR_ByRefTypeAndAwait
source: Instance of type '{0}' cannot be preserved across 'await' or 'yield' boundary.
fr: L’instance de type « {0} » ne peut pas être conservée au-delà de la limite « await » ou « yield ».
it: Non è possibile mantenere l'istanza di tipo '{0}' tra i limiti 'await' o 'yield'.
pl: Nie można zachować wystąpienia typu „{0}” w granicach „await” lub „yield”.
pt_br: A instância do tipo "{0}" não pode ser preservada entre o limite "await" ou "yield".
ru: Экземпляр типа "{0}" не может быть сохранен за границей "await" или "yield".
zh_hans: 无法跨 "await" 或 "yield" 边界保留 "{0}" 类型的实例。
zh_hant: 無法保留 'await' 或 'yield' 界限之間的執行個體類型 '{0}'。

# ERR_UnsafeAsyncArgType
source: Async methods cannot have pointer type parameters
cs: Asynchronní metody nemůžou mít návratové typy nebo parametry, které nejsou bezpečné.
fr: Les méthodes asynchrones ne peuvent pas avoir de paramètres de type pointeur
it: I metodi asincroni non possono avere parametri di tipo puntatore
ja: 非同期メソッドにポインター型パラメーターを指定することはできません
pl: Metody asynchroniczne nie mogą mieć parametrów typu wskaźnika
pt_br: Os métodos assíncronos não podem ter parâmetros de tipo de ponteiro
ru: Асинхронные методы не могут использовать параметры типа указателя
zh_hans: 异步方法不能具有指针类型参数
zh_hant: 非同步方法不能具有指標型別參數

# ERR_BadAsyncArgType
source: Async methods cannot have ref, in or out parameters
cs: Asynchronní metody nemůžou mít parametry ref, in nebo out.
de: Async-Methoden dürfen keinen ref-, in- oder out-Parameter enthalten.
es: Los métodos asincrónicos no pueden tener parámetros ref, in ni out
fr: Les méthodes Async ne doivent pas avoir de paramètres ref, in ou out
it: I metodi asincroni non possono avere parametri in, our o ref
ja: 非同期メソッドには ref、in、out パラメーターを指定できません
ko: 비동기 메서드에는 ref, in 또는 out 매개 변수를 사용할 수 없습니다.
pl: Metody asynchroniczne nie mogą zawierać parametrów ref, in ani out
pt_br: Os métodos assíncronos não podem ter parâmetros ref, in ou out
ru: Асинхронные методы не могут иметь параметры ref, in или out
tr: Zaman uyumsuz metotlarda ref, in veya out parametreleri olamaz
zh_hans: 异步方法不能使用 ref、in 或 out 参数
zh_hant: 非同步方法不可出現 ref、in 或 out 參數

# ERR_BadAwaitWithoutAsync
source: The 'await' operator can only be used when contained within a method or lambda expression marked with the 'async' modifier
cs: Operátor await jde použít, jenom pokud je obsažen v metodě nebo výrazu lambda označeném pomocí modifikátoru async.
de: Der await-Operator kann nur verwendet werden, wenn er in einer Methode oder einem Lambdaausdruck enthalten ist, die bzw. der mit dem async-Modifizierer markiert ist.
es: El operador 'await' solo se puede usar cuando está contenido dentro de un método o una expresión lambda marcada con el modificador 'async'
fr: L'opérateur 'await' peut seulement être utilisé lorsqu'il est contenu dans une méthode ou une expression lambda marquée avec le modificateur 'async'
it: L'operatore 'await' può essere usato solo quando è contenuto in un metodo o un'espressione lambda contrassegnata con il modificatore 'async'
ja: await' 演算子は、'async' 修飾子が指定されているメソッドまたはラムダ式に含まれている場合にのみ使用できます
ko: await' 연산자는 'async' 한정자로 표시된 메서드나 람다 식 내에 포함된 경우에만 사용할 수 있습니다.
pl: Operatora „await” można używać tylko wtedy, gdy zawierająca go metoda lub wyrażenie lambda zostaną oznaczone modyfikatorem „async”.
pt_br: O operador 'await' só poderá ser usado quando contido em um método ou expressão lambda marcada com o modificador 'async'
ru: Оператор await можно использовать, только если он содержится в методе или лямбда-выражении, помеченном модификатором async.
tr: await' işleci yalnızca bir yöntem içinde veya lambda ifadesi 'async' değiştiricisi ile işaretlendiğinde kullanılabilir
zh_hans: "await" 运算符只能在它包含于标有“async”修饰符的方法或 lambda 表达式中时使用
zh_hant: await' 運算子只有在包含於以 'async' 修飾元標記的方法或 Lambda 運算式中時，才可使用

# ERR_BadAwaitWithoutAsyncLambda
source: The 'await' operator can only be used within an async {0}. Consider marking this {0} with the 'async' modifier.
cs: Operátor await jde použít jenom v asynchronní metodě {0}. Zvažte označení této metody modifikátorem async.
de: Der "await"-Operator kann nur mit Async-{0} verwendet werden. Markieren Sie ggf. {0} mit dem "async"-Modifizierer.
es: El operador 'await' solo se puede usar dentro de un {0} asincrónico. Puede marcar este {0} con el modificador 'async'.
fr: L'opérateur 'await' ne peut être utilisé que dans un {0} asynchrone. Marquez ce {0} avec le modificateur 'async'.
it: L'operatore 'await' può essere usato solo all'interno di un {0} asincrono. Contrassegnare questo {0} con il modificatore 'async'.
ja: await' 演算子は、非同期の {0} でのみ使用できます。この {0} を 'async' 修飾子でマークすることを検討してください。
ko: await' 연산자는 비동기 {0} 내에서만 사용할 수 있습니다. 'async' 한정자로 이 {0}을(를) 표시하세요.
pl: Operatora „await” można używać tylko w elemencie asynchronicznym {0}. Rozważ oznaczenie elementu {0} za pomocą modyfikatora „async”.
pt_br: O operador "await" pode somente ser usado em async {0}. Considere a possibilidade de marcar este {0} com o modificador "async".
ru: Оператор "await" можно использовать только в методах с модификатором async {0}. Попробуйте пометить {0} модификатором "async".
tr: Await' işleci yalnızca zaman uyumsuz bir {0} ile kullanılabilir. Bu {0} öğesini 'async' değiştiricisi ile işaretlemeyi düşünün.
zh_hans: “await”运算符只能在异步 {0} 中使用。请考虑使用“async”修饰符标记此 {0}。
zh_hant: await' 運算子只可用在非同步 {0} 中。請考慮以 'async' 修飾元標記此 {0}。

# ERR_BadAwaitWithoutAsyncMethod
source: The 'await' operator can only be used within an async method. Consider marking this method with the 'async' modifier and changing its return type to 'Task<{0}>'.
cs: Operátor await jde použít jenom v asynchronních metodách. Zvažte označení této metody modifikátorem async a změnu jejího návratového typu na Task<{0}>.
de: Der "await"-Operator kann nur in einer Async-Methode verwendet werden. Markieren Sie ggf. diese Methode mit dem "async"-Modifizierer, und ändern Sie deren Rückgabetyp in "Task<{0}>".
es: El operador 'await' solo se puede usar dentro de un método asincrónico. Puede marcar este método con el modificador 'async' y cambiar su tipo de valor devuelto a 'Task<{0}>'.
fr: L'opérateur 'await' ne peut être utilisé que dans une méthode async. Marquez cette méthode avec le modificateur 'async' et changez son type de retour en 'Task'<{0}>'.
it: L'operatore 'await' può essere usato solo all'interno di un metodo asincrono. Provare a contrassegnare questo metodo con il modificatore 'async' e modificare il tipo restituito su 'Task<{0}>'.
ja: await' 演算子は、非同期メソッド内でのみ使用できます。このメソッドを 'async' 修飾子でマークし、戻り値の型を 'Task<{0}>' に変更することを検討してください。
ko: await' 연산자는 비동기 메서드 내에서만 사용할 수 있습니다. 'async' 한정자로 이 메서드를 표시하고 해당 반환 형식을 'Task<{0}>'로 변경하세요.
pl: Operatora „await” można używać tylko w metodzie asynchronicznej. Rozważ oznaczenie tej metody za pomocą modyfikatora „async” i zmianę jej typu zwracanego na „Task<{0}>”.
pt_br: O operador "await" pode somente ser usado em um método assíncrono. Considere a possibilidade de marcar este método com o modificador "async" e alterar seu tipo de retorno para "Task<{0}>".
ru: Оператор await можно использовать только в методах с модификатором async. Consider marking this method with the 'async' modifier and changing its return type to 'Task<{0}>'.
tr: await' işleci yalnızca bir async metot içerisinde kullanılabilir. Bu metodu 'async' değiştiricisi ile işaretlemeyi ve dönüş tipini 'Task<{0}>' olarak değiştirmeyi düşünün.
zh_hans: “await”运算符只能在异步方法中使用。请考虑使用“async”修饰符标记此方法，并将其返回类型更改为“Task<{0}>”。
zh_hant: await' 運算子只可用在非同步方法中。請考慮以 'async' 修飾元標記此方法，並將其傳回類型變更為 'Task<{0}>'。

# ERR_BadAwaitWithoutVoidAsyncMethod
source: The 'await' operator can only be used within an async method. Consider marking this method with the 'async' modifier and changing its return type to 'Task'.
cs: Operátor await jde použít jenom v asynchronní metodě. Zvažte označení této metody pomocí modifikátoru async a změnu jejího návratového typu na Task.
de: Der "await"-Operator kann nur innerhalb einer Async-Methode verwendet werden. Markieren Sie ggf. diese Methode mit dem "async"-Modifizierer, und ändern Sie deren Rückgabetyp in "Task".
es: El operador 'await' solo se puede usar dentro de un método asincrónico. Puede marcar este método con el modificador 'async' y cambiar su tipo de valor devuelto a 'Task'.
fr: L'opérateur 'await' peut seulement être utilisé dans une méthode async. Marquez cette méthode avec le modificateur 'async' et changez son type de retour en 'Task'.
it: L'operatore 'await' può essere usato solo all'interno di un metodo asincrono. Provare a contrassegnare questo metodo con il modificatore 'async' e modificare il tipo restituito su 'Task'.
ja: await' 演算子は、非同期メソッド内でのみ使用できます。このメソッドに 'async' 修飾子を指定し、戻り値の型を 'Task' に変更することを検討してください。
ko: await' 연산자는 비동기 메서드 내에서만 사용할 수 있습니다. 'async' 한정자로 이 메서드를 표시하고 해당 반환 형식을 'Task'로 변경하세요.
pl: Operatora „await” można używać tylko wewnątrz metody asynchronicznej. Rozważ możliwość oznaczenia tej metody za pomocą modyfikatora „async” i zmiany zwracanego przez nią typu na „Task”.
pt_br: O operador 'await' só pode ser usado em um método assíncrono. Considere marcar esse método com o modificador 'async' e alterar seu tipo de retorno para 'Task'.
ru: Оператор await можно использовать только в методах с модификатором async. Попробуйте пометить этот метод модификатором async и изменить тип его возвращаемого значения на Task.
tr: await' işleci yalnızca zaman uyumsuz bir yöntemle kullanılabilir. Bu yöntemi 'async' değiştiricisi ile işaretlemeyi ve dönüş türünü 'Task' olarak değiştirmeyi düşünün.
zh_hans: "await" 运算符只能用于异步方法中。请考虑用 "async" 修饰符标记此方法，并将其返回类型更改为 "Task"。
zh_hant: await' 運算子只可用於非同步方法中。請考慮以 'async' 修飾元標記此方法，並將其傳回類型變更為 'Task'。

# ERR_BadAwaitInFinally
source: Cannot await in the body of a finally clause
cs: Nejde použít operátor await v těle klauzule finally.
de: Kann nicht im Text einer finally-Klausel warten
es: No se puede usar await en el cuerpo de una cláusula finally
fr: Impossible d'attendre dans le corps d'une clause finally
it: Non è possibile includere un elemento await nel corpo di una clausola finally
ja: finally 句の本体で待機することはできません
ko: finally 절의 본문에서는 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania w treści klauzuli „finally”.
pt_br: Não é possível esperar no corpo de uma cláusula finally
ru: Невозможно ожидание в теле предложения finally.
tr: finally yan tümcesinin gövdesinde await kullanılamaz
zh_hans: 无法在 finally 子句体中等待
zh_hant: 無法在 finally 子句的主體中等候

# ERR_BadAwaitInCatch
source: Cannot await in a catch clause
cs: Operátor await nejde použít v klauzuli catch.
de: Kann nicht in einer catch-Klausel warten.
es: No se puede usar await en una cláusula catch
fr: Impossible d'attendre dans une clause catch
it: Non è possibile includere un elemento await in una clausola catch
ja: catch 句を待機することはできません
ko: catch 절에서 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania wewnątrz klauzuli „catch”
pt_br: Não é possível aguardar em uma cláusula catch
ru: Невозможное ожидание в предложении catch.
tr: Catch yan tümcesinde await kullanılamaz
zh_hans: 无法在 catch 子句中等待
zh_hant: 無法在 catch 子句中等候

# ERR_BadAwaitInCatchFilter
source: Cannot await in the filter expression of a catch clause
cs: Nejde použít operátor await ve výrazu filtru klauzule catch.
de: Kann nicht im Filterausdruck einer catch-Klausel warten.
es: No se puede usar await en la expresión de filtro de una cláusula catch
fr: Impossible d'attendre dans l'expression de filtre d'une clause catch
it: Non è possibile includere un elemento await nell'espressione di filtro di una clausola catch
ja: catch 句のフィルター式を待機することはできません
ko: catch 절의 필터 식에서 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania w wyrażeniu filtru klauzuli „catch”
pt_br: Não é possível aguardar na expressão do filtro de uma cláusula catch
ru: Невозможное ожидание в выражении фильтра предложения catch.
tr: Catch yan tümcesinin filtre ifadesinde await kullanılamaz
zh_hans: 无法在 catch 子句的筛选器表达式中等待
zh_hant: 無法在 catch 子句的篩選條件運算式中等候

# ERR_BadAwaitInLock
source: Cannot await in the body of a lock statement
cs: Operátor await nejde použít v příkazu lock.
de: Kann nicht im Text einer lock-Anweisung warten.
es: No se puede usar await en el cuerpo de una instrucción lock
fr: Impossible d'attendre dans le corps d'une instruction lock
it: Non è possibile includere un elemento await nel corpo di un'istruzione lock
ja: lock ステートメントの本体で待機することはできません
ko: lock 문의 본문에서 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania w treści instrukcji „lock”
pt_br: Não é possível aguardar no corpo de uma instrução lock
ru: Невозможное ожидание в теле оператора lock.
tr: Bir kilit durumunun gövdesinde await kullanılamaz
zh_hans: 无法在 lock 语句体中等待
zh_hant: 無法在 lock 陳述式的主體中等候

# ERR_BadAwaitInStaticVariableInitializer
source: The 'await' operator cannot be used in a static script variable initializer.
cs: Operátor await nejde použít v inicializátoru proměnné statického skriptu.
de: Der Operator "await" kann nicht in einem statischen Skriptvariableninitialisierer verwendet werden.
es: El operador 'await' no se puede usar en un inicializador de variable de script estático.
fr: L'opérateur 'await' ne peut pas être utilisé dans un initialiseur de variable de script statique.
it: Non è possibile usare l'operatore 'await' in un inizializzatore di variabile script statico.
ja: await' 演算子は、静的なスクリプト変数初期化子では使用できません。
ko: await' 연산자는 정적 스크립트 변수 이니셜라이저에서 사용할 수 없습니다.
pl: Operatora „await” nie można użyć w inicjalizatorze statycznej zmiennej skryptu.
pt_br: O operador 'await' não pode ser usado em um inicializador de variável de script estático.
ru: Оператор "await" невозможно использовать в инициализаторе статической переменной скрипта.
tr: Await' işleci bir statik betik değişken başlatıcısında kullanılamaz.
zh_hans: 静态脚本变量初始值设定项中不可使用 "await" 运算符。
zh_hant: await' 運算子不可用於靜態指令碼變數初始設定式。

# ERR_AwaitInUnsafeContext
source: Cannot await in an unsafe context
cs: Operátor await nejde použít v nezabezpečeném kontextu.
de: Kann nicht in unsicherem Kontext warten.
es: No se puede usar await en un contexto no seguro.
fr: Impossible d'attendre dans un contexte unsafe
it: Non è possibile attendere in un contesto non sicuro
ja: unsafe コンテキストで待機することはできません
ko: 안전하지 않은 컨텍스트에서는 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania w kontekście słowa kluczowego „unsafe”.
pt_br: Não é possível esperar em um contexto sem segurança
ru: Невозможно ожидание в небезопасном контексте.
tr: Güvenli olmayan bir bağlamda await kullanılamaz
zh_hans: 无法在不安全的上下文中等待
zh_hant: 無法在不安全的內容中等候

# ERR_BadAsyncLacksBody
source: The 'async' modifier can only be used in methods that have a body.
cs: Modifikátor async se dá použít jenom v metodách, které mají tělo.
de: Der Modifizierer "async" kann nur in Methoden verwendet werden, die über einen Textkörper verfügen.
es: El modificador 'async' solo se puede usar en métodos que tengan un cuerpo.
fr: Le modificateur 'async' ne peut être utilisé que dans des méthodes ayant un corps.
it: Il modificatore 'async' può essere usato solo nei metodi con un corpo.
ja: async' 修飾子は、本体があるメソッドでのみ使用できます。
ko: async' 한정자는 본문이 있는 메서드에서만 사용할 수 있습니다.
pl: Modyfikatora „async” można używać tylko w metodach mających treść.
pt_br: O modificador 'async' só pode ser usado em métodos que têm um corpo.
ru: Модификатор "async" можно использовать только в методах, имеющих тело.
tr: Async' değiştiricisi yalnızca gövdesi olan metotlarda kullanılabilir.
zh_hans: 只能在具有正文的方法中使用 "async" 修饰符。
zh_hant: async' 修飾元只可用於具有主體的方法。

# ERR_SecurityCriticalOrSecuritySafeCriticalOnAsync
source: Security attribute '{0}' cannot be applied to an Async method.
cs: Atribut zabezpečení {0} nejde použít pro metodu Async.
de: Das Sicherheitsattribut "{0}" kann nicht auf eine Async-Methode angewendet werden.
es: El atributo de seguridad '{0}' no se puede aplicar a un método Async.
fr: Impossible d'appliquer l'attribut de sécurité '{0}' à une méthode Async.
it: Non è possibile applicare l'attributo di sicurezza '{0}' a un metodo Async
ja: セキュリティ属性 '{0}' を非同期メソッドに適用することはできません。
ko: {0}' 보안 특성은 비동기 메서드에 적용할 수 없습니다.
pl: Atrybutu zabezpieczeń „{0}” nie można zastosować dla metody asynchronicznej.
pt_br: Atributo de segurança "{0}" não pode ser aplicado a um método Assíncrono.
ru: Атрибут безопасности "{0}" нельзя применить к асинхронному методу.
tr: {0}' güvenlik özniteliği bir Async yöntemine uygulanamaz.
zh_hans: 安全特性“{0}”不可应用于异步方法。
zh_hant: 安全屬性 '{0}' 無法套用至非同步方法。

# ERR_SecurityCriticalOrSecuritySafeCriticalOnAsyncInClassOrStruct
source: Async methods are not allowed in an Interface, Class, or Structure which has the 'SecurityCritical' or 'SecuritySafeCritical' attribute.
cs: Asynchronní metody nejsou povolené v rozhraní, třídě nebo struktuře, které mají atribut SecurityCritical nebo SecuritySafeCritical.
de: Async-Methoden sind in Schnittstellen, Klassen, Strukturen, die die Attribute "SecurityCritical" oder "SecuritySafeCritical" aufweisen, nicht zulässig.
es: Los métodos Async no se permiten en interfaces, clases ni estructuras que tienen el atributo 'SecurityCritical' o 'SecuritySafeCritical'.
fr: Les méthodes Async ne sont pas autorisées dans une interface, une classe ou une structure qui a un attribut 'SecurityCritical' ou 'SecuritySafeCritical'.
it: I metodi asincroni non sono consentiti in un'interfaccia, una classe o una struttura che ha l'attributo 'SecurityCritical' o 'SecuritySafeCritical'.
ja: 非同期メソッドは、'SecurityCritical' または 'SecuritySafeCritical' 属性を持つインターフェイス、クラス、または構造体では許可されていません。
ko: 특성이 'SecurityCritical' 또는 'SecuritySafeCritical'인 인터페이스, 클래스 또는 구조에서는 비동기 메서드가 허용되지 않습니다.
pl: Metody asynchroniczne są niedozwolone w interfejsach, klasach lub strukturach z atrybutem „SecurityCritical” lub „SecuritySafeCritical”.
pt_br: Métodos assíncronos não são permitidos em uma Interface, Classe ou Estrutura que tem o atributo "SecurityCritical" ou "SecuritySafeCritical".
ru: Не допускается использование асинхронных методов в интерфейсе, классе или структуре с атрибутом "SecurityCritical" или "SecuritySafeCritical".
tr: Async yöntemlerine 'SecurityCritical' veya 'SecuritySafeCritical' özniteliğine sahip bir Arabirim, Sınıf veya Yapıda izin verilmez.
zh_hans: 在具有“SecurityCritical”或“SecuritySafeCritical”特性的接口、类或结构中，不允许使用异步方法。
zh_hant: 具有 'SecurityCritical' 或 'SecuritySafeCritical' 屬性的介面、類別或結構中，不可使用非同步方法。

# ERR_BadAwaitInQuery
source: The 'await' operator may only be used in a query expression within the first collection expression of the initial 'from' clause or within the collection expression of a 'join' clause
cs: Operátor await jde použít jenom ve výrazu dotazu v rámci první kolekce výrazu počáteční klauzule from nebo v rámci výrazu kolekce klauzule join.
de: Der await-Operator kann in einem Abfrageausdruck nur innerhalb des ersten Sammlungsausdrucks der ursprünglichen from-Klausel oder innerhalb des Sammlungsausdrucks einer join-Klausel verwendet werden.
es: El operador 'await' solo se puede usar en una expresión de consulta dentro de la primera expresión de colección de la cláusula 'from' inicial o de la expresión de colección de una cláusula 'join'
fr: L'opérateur 'await' peut seulement être utilisé dans une expression de requête dans la première expression de collection de la clause 'from' initiale ou dans l'expression de collection d'une clause 'join'
it: È possibile usare l'operatore 'await' solo in espressioni di query all'interno della prima espressione di raccolta della clausola 'from' iniziale o all'interno dell'espressione di raccolta di una clausola 'join'
ja: await' 演算子は、最初の 'from' 句の最初のコレクション式、または 'join' 句のコレクション式に含まれるクエリ式でのみ使用できます
ko: await' 연산자는 초기 'from' 절의 첫 번째 Collection 식이나 'join' 절의 Collection 식 내의 쿼리 식에서만 사용할 수 있습니다.
pl: Operatora „await” można użyć tylko w wyrażeniu zapytania w pierwszym wyrażeniu kolekcji początkowej klauzuli „from” albo w wyrażeniu kolekcji klauzuli „join”.
pt_br: O operador 'await' só pode ser usado em uma expressão de consulta na primeira expressão de coleção da cláusula 'from' inicial ou na expressão de coleção de uma cláusula 'join'
ru: Оператор await можно использовать только в выражении запроса в первом выражении коллекции начального предложения From или в выражении коллекции предложения Join.
tr: await' işleci yalnızca başlangıçtaki 'from' yan tümcesinin ilk koleksiyon ifadesinin içindeki ya da bir 'join' yan tümcesinin toplama ifadesinin içindeki bir sorgu ifadesinde kullanılabilir
zh_hans: "await" 运算符只能用在初始 "from" 子句的第一个集合表达式或 "join" 子句的集合表达式内的查询表达式中
zh_hant: await' 運算子只能用在初始 'from' 子句的第一個集合運算式或 'join' 子句的集合運算式中的查詢運算式

# WRN_UnobservedAwaitableExpression
source: Because this call is not awaited, execution of the current method continues before the call is completed. Consider applying the 'await' operator to the result of the call.
cs: Protože se toto volání neočekává, vykonávání aktuální metody pokračuje před dokončením volání. Zvažte použití operátoru await na výsledek volání.
de: Da auf diesen Aufruf nicht gewartet wird, wird die Ausführung der aktuellen Methode vor Abschluss des Aufrufs fortgesetzt. Ziehen Sie ein Anwenden des "Await"-Operators auf das Ergebnis des Aufrufs in Betracht.
es: Como esta llamada no es 'awaited', la ejecución del método actual continuará antes de que se complete la llamada. Puede aplicar el operador 'await' al resultado de la llamada.
fr: Dans la mesure où cet appel n'est pas attendu, l'exécution de la méthode actuelle continue avant la fin de l'appel. Envisagez d'appliquer l'opérateur 'await' au résultat de l'appel.
it: Non è possibile attendere la chiamata, pertanto l'esecuzione del metodo corrente continuerà prima del completamento della chiamata. Provare ad applicare l'operatore 'await' al risultato della chiamata.
ja: この呼び出しを待たないため、現在のメソッドの実行は、呼び出しが完了するまで続行します。呼び出しの結果に 'await' 演算子を適用することを検討してください。
ko: 이 호출이 대기되지 않으므로 호출이 완료되기 전에 현재 메서드가 계속 실행됩니다. 호출 결과에 'await' 연산자를 적용해 보세요.
pl: Ponieważ to wywołanie nie jest oczekiwane, wykonywanie bieżącej metody będzie kontynuowane bez oczekiwania na ukończenie wywołania. Rozważ możliwość zastosowania operatora „await” do wyniku wywołania.
pt_br: Como esta chamada não é aguardada, a execução do método atual continua antes da conclusão da chamada. Considere aplicar o operador 'await' ao resultado da chamada.
ru: Поскольку этот вызов не ожидается, выполнение текущего метода продолжается до завершения вызова. Попробуйте применить оператор await к результату вызова.
tr: Bu çağrı beklenmediğinden, çağrı tamamlanmadan geçerli yöntemin yürütülmesi devam eder. Çağrının sonucuna 'await' işlecini eklemeyi düşünün.
zh_hans: 由于此调用不会等待，因此在此调用完成之前将会继续执行当前方法。请考虑将 "await" 运算符应用于调用结果。
zh_hant: 因為未等候此呼叫，所以在呼叫完成之前會繼續執行目前的方法。請考慮將 'await' 運算子套用至呼叫的結果。
