Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ConstantStringTooLong
source: Length of String constant resulting from concatenation exceeds System.Int32.MaxValue. Try splitting the string into multiple constants.
cs: Délka konstanty String, která je výsledkem zřetězení, překračuje hodnotu System.Int32.MaxValue. Zkuste rozdělit řetězec na více konstant.
de: Die Länge der aus der Verkettung resultierenden Zeichenfolgenkonstante überschreitet System.Int32.MaxValue. Teilen Sie die Zeichenfolge in mehrere Konstanten auf.
es: La longitud de la constante de cadena resultante de la concatenación supera el valor System.Int32.MaxValue. Pruebe a dividir la cadena en varias constantes.
fr: La longueur de la constante de chaîne qui résulte de la concaténation dépasse System.Int32.MaxValue. Essayez de diviser la chaîne en plusieurs constantes.
it: La lunghezza della costante di stringa risultante dalla concatenazione supera il valore di System.Int32.MaxValue. Provare a dividere la stringa in più costanti.
ja: 連結の結果による文字列定数の長さが、System.Int32.MaxValue を超えています。文字列を複数の定数に分割してみてください。
ko: 연결에서 생성된 문자열 상수의 길이가 System.Int32.MaxValue를 초과합니다. 문자열을 여러 상수로 분할해 보세요.
pl: Długość stałej typu String w wyniku łączenia przekracza wartość System.Int32.MaxValue. Spróbuj podzielić ciąg na wiele stałych.
pt_br: O comprimento da Constante de cadeia de caracteres resultante da concatenação excede o System.Int32.MaxValue. Tente dividir a cadeia de caracteres em várias constantes.
ru: Длина строковой константы, полученной в результате объединения, превышает значение System.Int32.MaxValue. Попробуйте разделить строку на несколько констант.
tr: Birleştirmeden kaynaklanan Dize sabitinin uzunluğu System.Int32.MaxValue değerini aşıyor. Dizeyi birden çok sabit olacak şekilde bölmeyi deneyin.
zh_hans: 由串联所得的字符串常量长度超过了 System.Int32.MaxValue。请尝试将字符串拆分为多个常量。
zh_hant: 從串連產生的字串常數長度超過 System.Int32.MaxValue。請嘗試將字串分割為多個常數。

# ERR_TupleTooFewElements
source: Tuple must contain at least two elements.
cs: Řazená kolekce členů musí obsahovat minimálně dva elementy.
de: Das Tupel muss mindestens zwei Elemente enthalten.
es: Una tupla debe contener al menos dos elementos.
fr: Le tuple doit contenir au moins deux éléments.
it: La tupla deve contenere almeno due elementi.
ja: タプルには 2 つ以上の要素が必要です。
ko: 튜플에는 요소가 두 개 이상 있어야 합니다.
pl: Krotka musi zawierać co najmniej dwa elementy.
pt_br: A tupla deve conter pelo menos dois elementos.
ru: Кортеж должен содержать по меньшей мере два элемента.
tr: Demet en az iki öğe içermelidir.
zh_hans: 元组必须包含至少两个元素。
zh_hant: 元組必須包含至少兩個項目。

# ERR_DebugEntryPointNotSourceMethodDefinition
source: Debug entry point must be a definition of a method declared in the current compilation.
cs: Vstupní bod ladění musí být definicí metody deklarované v aktuální kompilaci.
de: Der Debugeinstiegspunkt muss eine Definition einer Methode sein, die in der aktuellen Kompilierung deklariert ist.
es: El punto de entrada de depuración debe ser una definición de un método declarado en la compilación actual.
fr: Le point d'entrée de débogage doit être une définition d'une méthode déclarée dans la compilation actuelle.
it: Il punto di ingresso del debug deve essere una definizione di un metodo nella compilazione corrente.
ja: デバッグ エントリ ポイントは、現在のコンパイルで宣言されたメソッドの定義でなければなりません。
ko: 디버그 진입점은 현재 컴파일에서 선언된 메서드의 정의여야 합니다.
pl: Punkt wejściowy debugowania musi być definicją metody zadeklarowanej w bieżącej kompilacji.
pt_br: O ponto de entrada da depuração deve ser uma definição de um método declarado na compilação atual.
ru: Точкой входа отладки должно быть определение метода, объявленное в текущей компиляции.
tr: Hata ayıklama giriş noktası, geçerli derlemede bildirilmiş bir metodun tanımı olmalıdır.
zh_hans: 调试入口点必须是当前编译中声明的方法的定义。
zh_hant: 偵錯進入點必須是目前編譯中所宣告方法的定義。

# ERR_LoadDirectiveOnlyAllowedInScripts
source: #load is only allowed in scripts
cs: #load se povoluje jenom ve skriptech
de: "#load" ist nur in Skripts zulässig.
es: #load solo se permite en scripts
fr: #load n'est autorisé que dans les scripts
it: #load è consentito solo negli script
ja: #load は、スクリプト内でのみ許可されています
ko: #load만 스크립트에서 허용됩니다.
pl: element #load jest dozwolony tylko w skryptach
pt_br: #load só pode ser usado em scripts
ru: #load допускается только в скриптах
tr: Yalnızca betiklerde #load için izin verilir
zh_hans: 只允许在脚本中使用 #load
zh_hant: #load 只允許用於指令碼

# ERR_PPLoadFollowsToken
source: Cannot use #load after first token in file
cs: Za prvním tokenem v souboru se nedá použít #load.
de: "#Load" kann nicht nach dem ersten Token in der Datei verwendet werden.
es: No se puede usar #load después del primer token del archivo
fr: Impossible d'utiliser #load à la suite du premier jeton du fichier
it: Non è possibile usare #load dopo il primo token del file
ja: ファイルの最初のトークンの後は、#load を使用できません
ko: 파일에서 첫 토큰 뒤에 #load를 사용할 수 없습니다.
pl: Nie można używać elementu #load po pierwszym tokenie w pliku
pt_br: Não é permitido usar #load após o primeiro token do arquivo
ru: Нельзя использовать #load после первого токена в файле
tr: Dosyadaki ilk belirteçten sonra #load kullanılamaz
zh_hans: 文件中的第一个令牌后面不得使用 #load
zh_hant: 無法在檔案中第一個語彙基元後使用 #load

source: Could not find file.
cs: Nepovedlo se najít soubor.
de: Die Datei wurde nicht gefunden.
es: No se encontró el archivo.
fr: Fichier introuvable.
it: Il file non è stato trovato.
ja: ファイルが見つかりませんでした。
ko: 파일을 찾을 수 없습니다.
pl: Nie można znaleźć pliku.
pt_br: Não foi possível encontrar o arquivo.
ru: Не удалось найти файл.
tr: Dosya bulunamadı.
zh_hans: 无法找到文件。
zh_hant: 找不到檔案。

# SyntaxTreeFromLoadNoRemoveReplace
source: SyntaxTree resulted from a #load directive and cannot be removed or replaced directly.
cs: SyntaxTree je výsledkem direktivy #load a nedá se odebrat nebo nahradit přímo.
de: SyntaxTree ist das Ergebnis einer #load-Direktive und kann nicht direkt entfernt oder ersetzt werden.
es: SyntaxTree se obtuvo de una directiva #load y no se puede quitar ni reemplazar directamente.
fr: Le SyntaxTree résulte d'une directive #load, et ne peut pas être supprimé ou remplacé directement.
it: L'elemento SyntaxTree deriva da una direttiva #load e non può essere rimosso o sostituito direttamente.
ja: SyntaxTree は #load ディレクティブから発生しているため、直接的に削除または置換できません。
ko: SyntaxTree는 #load 지시문에서 생성되었으며 직접 제거하거나 바꿀 수 없습니다.
pl: Element SyntaxTree jest wynikiem dyrektywy #load i nie można go bezpośrednio usunąć ani zastąpić.
pt_br: A SyntaxTree o é resultado de uma diretiva #load e não pode ser removida nem substituída diretamente.
ru: SyntaxTree получено из директивы #load и не может быть удалено или перемещено напрямую.
tr: SyntaxTree bir #load yönergesinden kaynaklandığından doğrudan kaldırılamaz veya değiştirilemez.
zh_hans: #load 指令生成了 SyntaxTree，并且无法直接删除或替代此 SyntaxTree。
zh_hant: SyntaxTree 從 #load 指示詞所產生，無法直接移除或取代。

# ERR_SourceFileReferencesNotSupported
source: Source file references are not supported.
cs: Odkazy na zdrojový soubor se nepodporují.
de: Quelldateiverweise werden nicht unterstützt.
es: Las referencias de archivo de origen no son compatibles.
fr: Les références du fichier source ne sont pas prises en charge.
it: I riferimenti al file di origine non sono supportati.
ja: ソース ファイル参照はサポートされていません。
ko: 소스 파일 참조는 지원되지 않습니다.
pl: Odwołania do plików źródłowych nie są obsługiwane.
pt_br: Não há suporte às referências do arquivo de origem.
ru: Ссылки на исходный файл не поддерживаются.
tr: Kaynak dosya başvuruları desteklenmiyor.
zh_hans: 不支持源文件引用。
zh_hant: 不支援原始程式檔參考。

# ERR_InvalidPathMap
source: The pathmap option was incorrectly formatted.
cs: Možnost pathmap nebyla správně naformátovaná.
de: Die pathmap-Option war falsch formatiert.
es: La opción pathmap no tenía el formato correcto.
fr: Le format de l'option pathmap est incorrect.
it: Il formato dell'opzione pathmap non è corretto.
ja: pathmap オプションが正しく書式設定されていませんでした。
ko: pathmap 옵션의 형식이 잘못되었습니다.
pl: Opcja pathmap jest nieprawidłowo sformatowana.
pt_br: A opção pathmap foi formatada incorretamente.
ru: Неправильный формат параметра pathmap.
tr: Pathmap seçeneği doğru şekilde biçimlendirilmedi.
zh_hans: 路径映射选项的格式不正确。
zh_hant: pathmap 選項格式不正確。

# ERR_InvalidReal
source: Invalid real literal.
cs: Neplatný literál real
de: Ungültiges Literal für reelle Zahlen.
es: Literal real no válido.
fr: Littéral réel non valide.
it: Il valore letterale reale non è valido.
ja: 実数値リテラルが正しくありません。
ko: 실수 리터럴이 잘못되었습니다.
pl: Nieprawidłowy literał liczby rzeczywistej.
pt_br: Literal real inválido.
ru: Недопустимый реальный литерал.
tr: Geçersiz gerçek sabit değer.
zh_hans: 无效的实数。
zh_hant: 無效的實際常值。

# ERR_AutoPropertyCannotBeRefReturning
source: Auto-implemented properties cannot return by reference
cs: Automaticky implementované vlastnosti nejde vrátit pomocí odkazu.
de: Für automatisch implementierte Eigenschaften darf keine Rückgabe als Verweis erfolgen.
es: Las propiedades implementadas automáticamente no pueden devolver datos por referencia.
fr: Les propriétés implémentées automatiquement ne peuvent pas effectuer de retour par référence
it: Le proprietà implementate automaticamente non possono essere restituite per riferimento
ja: 自動実装プロパティは参照渡しで返すことができません
ko: 자동 구현 속성은 참조로 반환할 수 없습니다.
pl: Właściwości zaimplementowane automatycznie nie mogą zwracać wartości przez referencję
pt_br: As propriedades autoimplementadas não podem retornar por referência
ru: Автоматически реализованные свойства не могут возвращать данные по ссылке
tr: Otomatik olarak uygulanan özellikler başvuru ile döndürülemez
zh_hans: 自动实现的属性无法通过引用返回
zh_hant: 無法藉傳址方式傳回自動實作屬性

# ERR_RefPropertyMustHaveGetAccessor
source: Properties which return by reference must have a get accessor
cs: Vlastnosti, které vracejí pomocí odkazu, musí mít přístupový objekt get.
de: Eigenschaften, deren Rückgabe als Verweis erfolgt, müssen einen get-Accessor besitzen
es: Las propiedades que devuelven datos por referencia deben tener un descriptor de acceso get.
fr: Les propriétés qui effectuent un retour par référence doivent avoir un accesseur get
it: Le proprietà che vengono restituite per riferimento devono contenere una funzione di accesso get
ja: 参照渡しで返すプロパティは get アクセサーを持たなければなりません
ko: 참조로 반환하는 속성에 get 접근자를 사용할 수 없습니다.
pl: Właściwości zwracające wartość przez referencję muszą mieć metodę dostępu get
pt_br: As propriedades que retornam por referência devem ter um acessador get
ru: Свойства, возвращающие данные по ссылке, должны иметь метод доступа get
tr: Başvuru ile döndürülen özellikler get erişimcisine sahip olmalıdır
zh_hans: 通过引用返回的属性必须有 get 访问器
zh_hant: 藉傳址方式傳回的屬性必須有 get 存取子

# ERR_RefPropertyCannotHaveSetAccessor
source: Properties which return by reference cannot have set accessors
cs: Vlastnosti, které vracejí pomocí odkazu, nemůžou mít přístupové objekty set.
de: Eigenschaften, deren Rückgabe als Verweis erfolgt, dürfen keine set-Accessoren besitzen.
es: Las propiedades que devuelven datos por referencia no pueden tener descriptores de acceso.
fr: Les propriétés qui effectuent un retour par référence ne peuvent pas avoir d'accesseurs set
it: Le proprietà che vengono restituite per riferimento non possono contenere funzioni di accesso set
ja: 参照渡しで返すプロパティは set アクセサーを持つことができません
ko: 참조로 반환하는 속성에 set 접근자를 사용할 수 없습니다.
pl: Właściwości zwracające wartość przez referencję nie mogą mieć metod dostępu set
pt_br: As propriedades que retornam por referência não podem ter acessadores definidos
ru: Свойства, возвращающие данные по ссылке, не могут иметь методы доступа set
tr: Başvuru ile döndürülen özellikler set erişimcilerine sahip olamaz
zh_hans: 通过引用返回的属性不能有 set 访问器
zh_hant: 藉傳址方式傳回的屬性不能有 set 存取子

# ERR_CantChangeRefReturnOnOverride
source: '{0}' must match by reference return of overridden member '{1}'
cs: {0} musí odpovídat návratu pomocí odkazu přepsaného člena {1}.
de: '"{0}" muss mit der Rückgabe des außer Kraft gesetzten Members "{1}" als Verweis übereinstimmen.
es: '"{0}" debe coincidir por referencia con el tipo de valor devuelto del miembro invalidado "{1}".
fr: '{0}' doit correspondre au retour par référence du membre substitué '{1}'
it: '{0}' deve corrispondere per riferimento al valore restituito del membro '{1}' di cui è stato eseguito l'override
ja: '{0}' は、オーバーライドされるメンバー '{1}' の参照渡しの戻り値に一致する必要があります
ko: '{0}'은(는) 재정의된 멤버 '{1}'의 참조에 의한 반환과 일치해야 합니다.
pl: Element „{0}” musi odpowiadać zwracanej przez referencję przesłoniętej składowej „{1}”
pt_br: '{0}' deve corresponder ao retorno por referência de membro substituído '{1}'
ru: "{0}" должен соответствовать возвращаемому по ссылке типу переопределенного члена "{1}"
tr: '{0}', '{1}' üyesinin başvuru dönüşüyle eşleşmelidir
zh_hans: “{0}”必须与重写成员“{1}”的引用返回匹配
zh_hant: '{0}' 必須符合覆寫成員 '{1}' 的藉傳址方式傳回

# ERR_MustNotHaveRefReturn
source: By-reference returns may only be used in methods that return by reference
cs: Vrácení podle odkazu se dají používat jenom v metodách, které vracejí pomocí odkazu.
de: By-reference-Rückgaben können nur in Methoden verwendet werden, deren Rückgabe als Verweis erfolgt.
es: Las devoluciones por referencia solo se pueden usar en métodos que devuelven datos por referencia.
fr: Les retours par référence ne peuvent être utilisés que dans les méthodes qui effectuent un retour par référence
it: I valori restituiti per riferimento possono essere usati solo in metodi che vengono restituiti per riferimento
ja: 参照渡しの返却は、参照で返すメソッドでのみ使用できます
ko: 참조 방식 반환은 참조로 반환하는 메서드에서만 사용할 수 있습니다.
pl: Wartości zwracane przez referencję mogą być używane tylko w metodach zwracających wartość przez referencję
pt_br: Retornos por referência podem ser usados somente em métodos que são retornados por referência
ru: Возвращаемые по ссылке данные можно использовать только в методах, которые возвращают данные по ссылке
tr: Başvuru ile dönüşler yalnızca başvuru ile döndürülen metotlarda kullanılabilir
zh_hans: 通过引用返回只能在通过引用返回的方法中使用
zh_hant: 藉傳址傳回只能用於藉傳址方式傳回的方法

# ERR_MustHaveRefReturn
source: By-value returns may only be used in methods that return by value
cs: Vrácení podle hodnoty se dají používat jenom v metodách, které vracejí podle hodnoty.
de: By-value-Rückgaben können nur in Methoden verwendet werden, deren Rückgabe nach Wert erfolgt.
es: Las devoluciones por valor solo se pueden usar en métodos que devuelven datos por valor.
fr: Les retours par valeur ne peuvent être utilisés que dans les méthodes qui effectuent un retour par valeur
it: I valori restituiti per valore possono essere usati solo in metodi che vengono restituiti per valore
ja: 値渡しの返却は、値渡しで返すメソッドでのみ使用できます
ko: By-value 반환은 값으로 반환하는 메서드에서만 사용할 수 있습니다.
pl: Wartości zwracanych przez wartość można użyć tylko w metodach zwracających wartość
pt_br: Retornos by-value podem ser usados somente em métodos que retornam um valor
ru: Возвращаемые по значению данные можно использовать только в методах, которые возвращают данные по значению
tr: Değer ile dönüşler yalnızca değer ile döndürülen metotlarda kullanılabilir
zh_hans: 按值返回只能在按值返回的方法中使用
zh_hant: 傳值傳回只能用於以傳值方式傳回的方法

# ERR_RefReturnMustHaveIdentityConversion
source: The return expression must be of type '{0}' because this method returns by reference
cs: Návratový výraz musí být typu {0}, protože tato metoda vrací pomocí odkazu.
de: Der Rückgabeausdruck muss vom Typ "{0}" sein, weil die Rückgabe dieser Methode als Verweis erfolgt.
es: La expresión return debe ser de tipo '{0}' porque este método devuelve datos por referencia.
fr: L'expression de retour doit être de type '{0}', car cette méthode effectue un retour par référence
it: L'espressione restituita deve essere di tipo '{0}' perché questo metodo viene restituito per riferimento
ja: このメソッドは参照渡しで返すため、return 式の型は '{0}' でなければなりません
ko: 이 메서드는 참조로 반환하므로 반환 식은 '{0}' 형식이어야 합니다.
pl: Zwracane wyrażenie musi być typu „{0}”, ponieważ ta metoda zwraca wartość przez referencję
pt_br: A expressão de retorno deve ser do tipo '{0}' porque esse método é retornado por referência
ru: Выражение return должно иметь тип "{0}", так как этот метод возвращает данные по ссылке
tr: Bu metot başvuru ile döndürüldüğünden, dönüş ifadesi '{0}' türünde olmalıdır
zh_hans: 返回表达式必须为“{0}”类型，因为此方法通过引用返回
zh_hant: 傳回運算式的類型必須是類型 '{0}'，因為此方法藉傳址方式傳回

# ERR_CloseUnimplementedInterfaceMemberWrongRefReturn
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement '{1}' because it does not have matching return by reference.
cs: {0} neimplementuje člena rozhraní {1}. {2} nemůže implementovat {1}, protože nemá odpovídající návrat pomocí odkazu.
de: '"{0}" implementiert nicht den Schnittstellenmember "{1}". "{2}" kann "{1}" nicht implementieren, weil keine übereinstimmende Rückgabe als Verweis vorliegt.
es: '"{0}" no implementa el miembro de interfaz "{1}". "{2}" no puede implementar "{1}" porque no tiene un tipo de valor devuelto coincidente por referencia.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. '{2}' ne peut pas implémenter '{1}', car il n'a pas de retour par référence correspondant.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare '{1}' perché non contiene il valore restituito corrispondente per riferimento.
ja: '{0}' はインターフェイス メンバー '{1}' を実装しません。'{2}' は参照渡しで返される対応する値がないため、'{1}' を実装できません。
ko: '{0}'은(는) 인터페이스 멤버 '{1}'을(를) 구현하지 않습니다. '{2}'은(는) 참조에 의한 일치되는 반환 값이 없으므로 '{1}'을(를) 구현할 수 없습니다.
pl: Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może implementować elementu „{1}”, ponieważ nie ma pasującej wartości zwracanej przez referencję.
pt_br: '{0}' não implementa o membro de inferface '{1}'. O '{2}' não pode implementar '{1}' porque ele não tem retorno correspondente por referência.
ru: "{0}" не реализует член интерфейса "{1}". "{2}" не может реализовать "{1}", так как он не имеет соответствующего возвращаемого по ссылке типа.
tr: '{0}', '{1}' arabirim üyesini uygulamıyor. '{2}', başvuruyla eşleşen dönüşü olmadığından '{1}' uygulayamaz.
zh_hans: “{0}”未实现接口成员“{1}”。“{2}”无法实现“{1}”，因为它与引用返回不匹配。
zh_hant: '{0}' 未實作介面成員 '{1}'。因為 '{2}' 沒有相符的藉傳址方式傳回，所以無法實作 '{1}'。

# ERR_BadIteratorReturnRef
source: The body of '{0}' cannot be an iterator block because '{0}' returns by reference
cs: Hlavní část objektu {0} nemůže představovat blok iterátoru, protože {0} se vrací pomocí odkazu.
de: Der Text "{0}" darf kein Iteratorblock sein, weil die Rückgabe von "{0}" als Verweis erfolgt.
es: El cuerpo de '{0}' no puede ser un bloque de iteradores porque '{0}' devuelve datos por referencia.
fr: Le corps de '{0}' ne peut pas être un bloc itérateur, car '{0}' effectue un retour par référence
it: Il corpo di '{0}' non può essere un blocco iteratore perché '{0}' viene restituito per riferimento
ja: '{0}' は参照渡しで返すため、'{0}' の本文を反復子ブロックにすることはできません
ko: {0}'이(가) 참조로 반환되므로 '{0}'의 본문은 반복기 블록이 될 수 없습니다.
pl: Treść elementu „{0}” nie może być blokiem iteratora, ponieważ element „{0}” zwraca wartość przez referencję
pt_br: O corpo de '{0}' não pode ser um bloco de iteradores, pois '{0}' é retornado por referência
ru: Тело "{0}" не может быть блоком итератора, так как "{0}" возвращает данные по ссылке
tr: {0}' başvuru ile döndürüldüğünden, '{0}' gövdesi bir yineleyici bloğu olamaz
zh_hans: “{0}”的主体不能是迭代器块，因为“{0}”通过引用返回
zh_hant: '{0}' 的主體不可是迭代區塊，因為 '{0}' 是藉傳址方式傳回

# ERR_BadRefReturnExpressionTree
source: Lambda expressions that return by reference cannot be converted to expression trees
cs: Výrazy lambda, které se vrací pomocí odkazu, nejde převést na stromy výrazů.
de: Lambdaausdrücke, deren Rückgabe als Verweis erfolgt, können nicht in Ausdrucksbäume konvertiert werden.
es: Las expresiones lambda que devuelven datos por referencia no se pueden convertir en árboles de expresión.
fr: Les expressions lambda qui effectuent un retour par référence ne peuvent pas être converties en arborescences d'expression
it: Non è possibile convertire in alberi delle espressioni le espressioni lambda che vengono restituite per riferimento
ja: 参照渡しで返すラムダ式は、式ツリーに変換できません
ko: 참조로 반환하는 람다 식을 식 트리로 변환할 수 없습니다.
pl: Wyrażeń lambda, które zwracają wartość przez referencję, nie można przekonwertować na drzewa wyrażeń
pt_br: Expressões lambda que retornam por referência não podem ser convertidas para árvores de expressão
ru: Лямбда-выражения, возвращающие данные по ссылке, невозможно преобразовать в деревья выражений
tr: Başvuru ile döndürülen lambda ifadeleri, ifade ağaçlarına dönüştürülemez
zh_hans: 通过引用返回的 Lambda 表达式不能转换为表达式树
zh_hant: 無法將藉傳址方式傳回的 Lambda 運算式轉換為運算式樹狀架構

# ERR_RefReturningCallInExpressionTree
source: An expression tree lambda may not contain a call to a method, property, or indexer that returns by reference
cs: Lambda stromu výrazů nesmí obsahovat volání do metody, vlastnosti nebo indexeru, které vrací pomocí odkazu.
de: Der Lambdaausdruck eines Ausdrucksbaums darf keinen Aufruf einer Methode, einer Eigenschaft oder eines Indexers enthalten, deren bzw. dessen Rückgabe als Verweis erfolgt.
es: Un lambda de árbol de expresión no puede contener una llamada a un método, una propiedad o un indexador que devuelva datos por referencia.
fr: Une arborescence d'expression lambda ne peut pas contenir d'appel à une méthode, une propriété ou un indexeur qui effectue un retour par référence
it: Un'espressione lambda dell'albero delle espressioni non può contenere una chiamata a un metodo, a una proprietà o a un indicizzatore che viene restituito per riferimento
ja: 式ツリーのラムダには、参照渡しで返すメソッド、プロパティ、インデクサーの呼び出しを含めることができません
ko: 람다 식 트리에는 참조로 반환하는 메서드, 속성 또는 인덱서에 대한 호출을 사용할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać wywołania metody, właściwości ani indeksatora, który zwraca wartość przez referencję
pt_br: O lambda da árvore de expressão pode não conter uma chamada para um método, propriedade ou indexador que é retornado por referência
ru: Дерево лямбда-выражения не может содержать вызов метода, свойства или индексатора, который возвращает данные по ссылке
tr: İfade ağacı lambdası, başvuru ile döndürülen bir metoda, özelliğe veya dizin oluşturucuya yönelik bir çağrı içeremez
zh_hans: 表达式树 lambda 不能包含对通过引用返回的方法、属性或索引器的调用
zh_hant: 運算式樹狀架構 Lambda 不能包含呼叫藉傳址方式傳回的方法、屬性或索引子

# ERR_RefReturnLvalueExpected
source: An expression cannot be used in this context because it may not be passed or returned by reference
cs: Výraz nelze v tomto kontextu použít, protože nesmí být předaný nebo vrácený pomocí odkazu.
de: Ein Ausdruck kann in diesem Kontext nicht verwendet werden, weil er möglicherweise nicht als Verweis übergeben oder zurückgegeben wird.
es: No se puede usar una expresión en este contexto porque no se puede pasar ni devolver por referencia.
fr: Impossible d'utiliser une expression dans ce contexte, car elle ne peut pas être passée ou retournée par référence
it: Non è possibile usare un'espressione in questo contesto perché non può essere passata o restituita per riferimento
ja: 参照渡しによって渡したり返したりすることができないため、このコンテキストで使用できない式があります
ko: 식은 참조로 전달되거나 반환될 수 없으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: Nie można użyć wyrażenia w tym kontekście, ponieważ może ono nie zostać przekazane lub zwrócone przez referencję
pt_br: Uma expressão não pode ser usada nesse contexto, pois ela pode não ser ignorada ou retornada por referência
ru: Невозможно использовать выражение в этом контексте, так как его невозможно передать или вернуть по ссылке
tr: Başvuru ile geçirilemeyeceğinden veya döndürülemeyeceğinden, bu bağlamda bir ifade kullanılamaz
zh_hans: 不能在此上下文中使用表达式，因为表达式无法通过引用传递或返回
zh_hant: 因為參考可能不會傳遞或傳回運算式，所以無法於此內容中使用運算式
