Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UseDefViolationThisUnsupportedVersion
source: The 'this' object cannot be used before all of its fields have been assigned. Consider updating to language version '{0}' to auto-default the unassigned fields.
cs: Objekt this nelze použít před přiřazením všech jeho polí. Zvažte aktualizaci na jazykovou verzi {0} na automatické výchozí nastavení nepřiřazených polí.
fr: Impossible d’utiliser l’objet 'this' avant l’affectation de tous ses champs. Envisagez de mettre à jour vers la version de langage '{0}' pour définir automatiquement les champs non attribués par défaut.
it: Impossibile utilizzare l'oggetto 'this' prima dell'assegnazione di tutti i relativi campi. Provare a eseguire l'aggiornamento alla versione del linguaggio '{0}' per impostare come predefiniti automaticamente i campi non assegnati.
ja: すべてのフィールドが割り当てられる前に、'this' オブジェクトを使用することはできません。割り当てられていないフィールドを自動既定値にするため '{0}' 言語バージョンに更新することを検討してください。
pl: Nie można użyć obiektu „this” przed przypisaniem wszystkich jego pól. Rozważ zaktualizowanie nieprzypisanych pól do wersji językowej „{0}”, aby automatycznie ustawić domyślne pola niezaznaczone.
pt_br: O objeto 'this' não pode ser usado antes que todos os seus campos serem atribuídos. Considere atualizar para a versão de linguagem '{0}' para auto-padrão dos campos não atribuídos.
ru: Нельзя использовать объект "this", пока не будут назначены все его поля. Попробуйте обновить до языковой версии "{0}", чтобы автоматически применить значения по умолчанию к неназначенным полям.
zh_hans: 在分配“this”对象的所有字段之前，无法使用该对象。请考虑更新到语言版本 '{0}' 以自动默认未分配的字段。
zh_hant: 在指派 'this' 物件的所有欄位之前，無法使用該物件。請考慮更新語言版本 '{0}'，以自動預設未指派的欄位。

# WRN_UseDefViolationThisUnsupportedVersion_Title
source: The 'this' object cannot be used in a constructor before all of its fields have been assigned. Consider updating the language version to auto-default the unassigned fields.
cs: Objekt this nelze použít v konstruktoru před přiřazením všech jeho polí. Zvažte aktualizaci na jazykovou verzi na automatické výchozí nastavení nepřiřazených polí.
fr: L’objet « this » ne peut pas être utilisé dans un constructeur avant que tous ses champs aient été affectés. Envisagez de mettre à jour la version du langage pour qu’elle utilise automatiquement les champs non attribués par défaut.
it: Impossibile utilizzare l'oggetto 'this' in un costruttore prima che siano stati assegnati tutti i suoi campi. Provare ad aggiornare la versione del linguaggio per impostare automaticamente come predefiniti i campi non assegnati.
ja: すべてのフィールドが割り当てられる前に、'this' オブジェクトをコンストラクターで使用することはできません。割り当てられていないフィールドを自動既定値にするため言語バージョンを更新することを検討してください。
pl: Nie można użyć obiektu „this” przed przypisaniem wszystkich jego pól. Rozważ zaktualizowanie nieprzypisanych pól do wersji językowej, aby automatycznie ustawić domyślne pola niezaznaczone.
pt_br: O objeto 'this' não pode ser usado em um construtor antes de todos os seus campos terem sido atribuídos. Considere atualizar a versão de linguagem para auto-padrão nos campos não atribuídos.
ru: Нельзя использовать объект "this" в конструкторе, пока не будут назначены все его поля. Попробуйте обновить языковую версию, чтобы автоматически применить значения по умолчанию к неназначенным полям.
zh_hans: 在对 "this" 对象的所有字段赋值之前，不能在构造函数中使用 "this" 对象。请考虑更新语言版本以自动默认未分配的字段。
zh_hant: 在指派 'this' 物件的所有欄位之前，無法在建構函式中使用。請考慮更新語言版本，以自動預設未指派的欄位。

# WRN_UseDefViolation_Title
source: Use of unassigned local variable
cs: Použila se nepřiřazená lokální proměnná
fr: Utilisation d'une variable locale non assignée
it: Uso della variabile locale non assegnata
ja: 割り当てられていないローカル変数の使用
pl: Użyto nieprzypisanej zmiennej lokalnej
pt_br: Uso de variável local não atribuída
ru: Использование локальной переменной, которой не присвоено значение
zh_hans: 使用未赋值的局部变量
zh_hant: 使用未指派的區域變數

# WRN_WindowsExperimental
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates.
fr: '{0}' est utilisé à des fins d'évaluation uniquement. Il sera peut-être changé ou supprimé au cours des prochaines mises à jour.
it: '{0}' viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri.
ja: '{0}' は、評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。
pl: 'Element „{0}” jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach.
pt_br: '{0}' é para fins de avaliação somente e está sujeito a alterações ou remoções em atualizações futuras.
ru: "{0}" предназначен только для оценки и может быть изменен или удален в будущих обновлениях.
zh_hans: “{0}”仅用于评估，在将来的更新中可能会被更改或删除。
zh_hant: '{0}' 僅供評估之用。後續更新時可能會有所變更或移除。

# WRN_WindowsExperimental_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates.
fr: Le type est utilisé à des fins d'évaluation uniquement. Il sera peut-être changé ou supprimé au cours des prochaines mises à jour.
it: Type viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri.
ja: 型は評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。
pl: Typ jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach.
pt_br: O tipo destina-se somente para fins de avaliação e está sujeito a alterações ou remoções em atualizações futuras.
ru: Тип предназначен только для оценки и может быть изменен или удален в будущих обновлениях.
zh_hans: 类型仅用于评估，在将来的更新中可能会被更改或删除。
zh_hant: 類型僅供評估之用。後續更新時可能會有所變更或移除。

# XML_InvalidToken
source: The character(s) '{0}' cannot be used at this location.
cs: Znaky {0} se na tomto místě nedají použít.
de: Zeichen "{0}" können an dieser Stelle nicht verwendet werden.
es: El/los carácter/caracteres '{0}' no se puede/n usar en esta ubicación.
fr: Impossible d'utiliser le(s) caractère(s) '{0}' à cet emplacement.
it: Non è possibile usare il carattere o i caratteri '{0}' in questa posizione.
ja: 文字 '{0}' はこの位置では使用できません。
ko: {0}' 문자를 이 위치에 사용할 수 없습니다.
pl: Znaków „{0}” nie można użyć w tej lokalizacji.
pt_br: O(s) caractere(s) "{0}" não pode(m) ser usado(s) neste local.
ru: В этом месте нельзя использовать символы "{0}".
tr: {0}' karakterleri bu konumda kullanılamaz.
zh_hans: 此位置无法使用字符“{0}”。
zh_hant: 此位置不可使用字元 '{0}'。

# XML_IncorrectComment
source: Incorrect syntax was used in a comment.
cs: V komentáři se používá nesprávná syntaxe.
de: Im Kommentar wurde eine falsche Syntax verwendet.
es: Se ha usado sintaxis incorrecta en un comentario.
fr: Une syntaxe incorrecte a été utilisée dans un commentaire.
it: In un commento è stato usata sintassi errata.
ja: コメントで正しくない構文が使用されました。
ko: 주석에 잘못된 구문이 사용되었습니다.
pl: Użyto nieprawidłowej składni w komentarzu.
pt_br: Foi usada uma sintaxe incorreta em um comentário.
ru: Неверный синтаксис комментария.
tr: Bir yorumda yanlış sözdizimi kullanıldı.
zh_hans: 注释中使用的语法不正确。
zh_hant: 註解中使用的語法錯誤。

# XML_InvalidCharEntity
source: An invalid character was found inside an entity reference.
cs: Uvnitř odkazu na entitu se našel neplatný znak.
de: Innerhalb eines Entitätsverweises wurde ein ungültiges Zeichen gefunden.
es: Se encontró un carácter no válido dentro de una referencia de entidad.
fr: Un caractère non valide a été trouvé dans une référence d'entité.
it: All'interno di un riferimento di entità è stato trovato un carattere non valido.
ja: エンティティ参照内に無効な文字が見つかりました。
ko: 엔터티 참조 내에서 잘못된 문자를 찾았습니다.
pl: Znaleziono nieprawidłowy znak wewnątrz odwołania do jednostki.
pt_br: Um caractere inválido foi encontrado dentro de uma referência de entidade.
ru: В ссылке на сущность используется недопустимый символ.
tr: Bir varlık başvurusu içinde geçersiz bir karakter bulundu.
zh_hans: 实体引用中发现无效字符。
zh_hant: 實體參考中發現無效的字元。

# XML_ExpectedEndOfTag
source: Expected '>' or '/>' to close tag '{0}'.
cs: Očekával se řetězec > nebo /> uzavírající značku {0}.
de: ">" oder "/>" zum Schließen des Tags "{0}" wurde erwartet.
es: Se esperaba '>' o '/>' para cerrar la etiqueta '{0}'.
fr: >' ou '/>' était attendu pour fermer la balise '{0}'.
it: È previsto '>' o '/>' come tag di chiusura '{0}'.
ja: タグ '{0}' を閉じるには、'>' または '/>' が必要です。
ko: {0}' 닫기 태그에 '>' 또는 '/>'가 필요합니다.
pl: Oczekiwano ciągu „>” lub „/>” zamykającego tag „{0}”.
pt_br: ">" ou "/>" está faltando para fechar a tag "{0}".
ru: Ожидался ">" или " />" для закрытия тега "{0}".
tr: {0}' etiketini kapatmak için '>' veya '/>' bekleniyor.
zh_hans: 需要“>”或“/>”来结束标记“{0}”。
zh_hant: 必須以 '>' 或 '/>' 做為結束標籤 '{0}'。

# XML_ExpectedIdentifier
source: An identifier was expected.
cs: Očekával se identifikátor.
de: Es wurde ein Bezeichner erwartet.
es: Se esperaba un identificador.
fr: Un identificateur était attendu.
it: Era previsto un identificatore.
ja: 識別子が必要でした。
ko: 식별자가 필요합니다.
pl: Oczekiwano identyfikatora.
pt_br: Um identificador era esperado.
ru: Требуется идентификатор.
tr: Bir tanımlayıcı beklendi.
zh_hans: 应为标识符。
zh_hant: 必須是識別項。

# XML_InvalidUnicodeChar
source: Invalid unicode character.
cs: Neplatný znak unicode
de: Ungültiges Unicode-Zeichen.
es: Carácter Unicode no válido.
fr: Caractère Unicode non valide.
it: Il carattere Unicode non è valido.
ja: 無効な Unicode 文字です。
ko: 잘못된 유니코드 문자입니다.
pl: Nieprawidłowy znak Unicode.
pt_br: Caractere unicode inválido.
ru: Недопустимый символ Юникода.
tr: Geçersiz unicode karakteri.
zh_hans: Unicode 字符无效。
zh_hant: Unicode 字元無效。

# XML_InvalidWhitespace
source: Whitespace is not allowed at this location.
cs: Prázdný znak není v tomto místě povolený.
de: An dieser Stelle sind keine Leerzeichen zugelassen.
es: No se permite un espacio en blanco en esta ubicación.
fr: L'espace blanc n'est pas autorisé à cet emplacement.
it: Lo spazio vuoto non è consentito in questa posizione.
ja: この位置では空白は許可されていません。
ko: 이 위치에는 공백이 허용되지 않습니다.
pl: Białe znaki są niedozwolone w tej lokalizacji.
pt_br: Espaço em branco não é permitido neste local.
ru: В этом месте пробел не допускается.
tr: Boşluğa bu konumda izin verilmiyor.
zh_hans: 此位置不允许使用空格。
zh_hant: 此位置不可使用空白。

# XML_LessThanInAttributeValue
source: The character '<' cannot be used in an attribute value.
cs: Znak '<' se nedá použít v hodnotě atributu.
de: Das Zeichen "<" kann in einem Attributwert nicht verwendet werden.
es: El carácter '<' no se puede usar en un valor de atributo.
fr: Le caractère '<' ne peut pas être utilisé dans une valeur d'attribut.
it: Non è possibile usare il carattere '<' in un valore di attributo.
ja: 属性値に文字 '<' は使用できません。
ko: 특성 값에 '<' 문자를 사용할 수 없습니다.
pl: Znaku „<” nie można użyć w wartości atrybutu.
pt_br: O caractere "<" não pode ser usado em um valor de atributo.
ru: Символ "<" нельзя использовать в значении атрибута.
tr: <' karakteri bir öznitelik değerinde kullanılamaz.
zh_hans: 不能在特性值中使用字符“<”。
zh_hant: 屬性值中不可使用字元 '<'。

# XML_MissingEqualsAttribute
source: Missing equals sign between attribute and attribute value.
cs: Mezi atributem a jeho hodnotou chybí znaménko rovná se.
de: Das Gleichheitszeichen zwischen Attribut und Attributwert fehlt.
es: Falta el signo igual entre el atributo y el valor de atributo.
fr: Signe égal manquant entre l'attribut et la valeur d'attribut.
it: Manca il segno di uguale tra l'attributo e il valore di attributo.
ja: 属性と属性値の間に等号がありません。
ko: 특성과 특성 값 사이에 등호가 없습니다.
pl: Brak znaku równości między atrybutem i wartością atrybutu.
pt_br: Ausência de sinal de igual entre atributo e o valor de atributo.
ru: Отсутствует знак равенства между атрибутом и его значением.
tr: Öznitelik ve öznitelik değeri arasında eşittir işareti eksik.
zh_hans: 特性与特性值之间缺少等号。
zh_hant: 屬性與屬性值之間少了等號。

# XML_RefUndefinedEntity_1
source: Reference to undefined entity '{0}'.
cs: Odkaz na nedefinovanou entitu {0}
de: Verweis auf nicht definierte Entität "{0}".
es: Referencia a entidad sin definir '{0}'.
fr: Référence à l'entité non définie '{0}'.
it: Riferimento a un'entità '{0}' non definita.
ja: 未定義のエンティティ '{0}' への参照です。
ko: 정의되지 않은 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezdefiniowanej jednostki „{0}”.
pt_br: Referência à entidade indefinida "{0}".
ru: Ссылка на неопределенную сущность "{0}".
tr: {0}' tanımlanmamış varlığına başvuru.
zh_hans: 引用未定义的实体“{0}”。
zh_hant: 參考未定義的實體 '{0}'。

# XML_StringLiteralNoStartQuote
source: A string literal was expected, but no opening quotation mark was found.
cs: Očekával se řetězcový literál, ale nenašly se úvodní uvozovky.
de: Ein Zeichenfolgenliteral wurde erwartet, es wurde aber kein öffnendes Anführungszeichen gefunden.
es: Se esperaba un literal de cadena, pero no se encontró la comilla de apertura.
fr: Un littéral de chaîne était attendu, mais aucun guillemet ouvrant n'a été trouvé.
it: Era previsto un valore letterale di tipo stringa, ma non sono state trovate virgolette inglesi aperte.
ja: 文字列リテラルが必要でしたが、始まりの引用符が見つかりませんでした。
ko: 문자열 리터럴이 필요하지만 여는 큰따옴표가 없습니다.
pl: Oczekiwano literału ciągu, lecz nie znaleziono otwierającego znaku cudzysłowu.
pt_br: Um literal de cadeia de caracteres era esperado, mas nenhuma aspa de abertura foi encontrada.
ru: Ожидался литерал строки, однако знак открывающих кавычек обнаружен не был.
tr: Dize hazır bilgisi bekleniyordu, ancak açma tırnağı işareti bulunamadı.
zh_hans: 应是字符串，但是找不到左引号。
zh_hant: 必須是字串常值，但未找到左引號。

# XML_StringLiteralNoEndQuote
source: Missing closing quotation mark for string literal.
cs: U řetězcového literálu chybí koncové uvozovky.
de: Für das Zeichenfolgenliteral fehlt das schließende Anführungszeichen.
es: Falta la comilla de cierre en el literal de cadena.
fr: Guillemet fermant manquant pour le littéral de chaîne.
it: Mancano le virgolette inglesi chiuse per il valore letterale di tipo stringa.
ja: 文字列リテラルに終わりの引用符がありません。
ko: 문자열 리터럴에 닫는 큰따옴표가 없습니다.
pl: Brak zamykającego znaku cudzysłowu dla literału ciągu.
pt_br: Aspa de fechamento ausente para o literal da cadeia de caracteres.
ru: Отсутствуют закрывающие кавычки у литерала строки.
tr: Dize değişmezi için kapanış tırnak işareti eksik.
zh_hans: 字符串缺少右引号。
zh_hant: 遺漏字串常值的右引號。

# XML_StringLiteralNonAsciiQuote
source: Non-ASCII quotations marks may not be used around string literals.
cs: U řetězcových literálů se nesmí používat jiné uvozovky než ASCII.
de: Zeichenfolgenliterale dürfen nur von ASCII-Anführungszeichen umschlossen werden.
es: No se pueden usar comillas no ASCII en los literales de cadena.
fr: Les guillemets non ASCII ne peuvent pas être utilisés avec les littéraux de chaîne.
it: Non è possibile usare virgolette non ASCII per racchiudere valori letterali di tipo stringa.
ja: ASCII 以外の引用符は、文字列リテラルを囲むために使用できません。
ko: ASCII가 아닌 따옴표는 문자열 리터럴 주위에 사용할 수 없습니다.
pl: Nie można używać znaków cudzysłowu spoza zestawu znaków ASCII wokół literałów ciągu.
pt_br: Aspas não ASCII não podem ser usadas em literais de cadeia de caracteres.
ru: Не допускается использование знаков кавычек в кодировке, отличной от ASCII, до и после литералов строки.
tr: ASCII olmayan tırnak işaretleri dize değişmezleri çevresinde kullanılamayabilir.
zh_hans: 不能在字符串周围使用非 ASCII 问号。
zh_hant: 字串常值前後不可使用非 ASCII 引號。

# XML_EndTagNotExpected
source: End tag was not expected at this location.
cs: Na tomto místě se neočekávala koncová značka.
de: An dieser Stelle wurde kein Endtag erwartet.
es: No se esperaba una etiqueta final en esta ubicación.
fr: Une balise de fin n'était pas attendue à cet emplacement.
it: Il tag finale non era previsto in questa posizione.
ja: この位置では、終了タグは不要でした。
ko: 이 위치에서 끝 태그가 필요하지 않습니다.
pl: Tag końcowy jest nieoczekiwany w tej lokalizacji.
pt_br: Tag de fim não era esperada neste local.
ru: Конечный тег в этом месте не ожидался.
tr: Bitiş etiketi bu konumda beklenmedi.
zh_hans: 在此位置不应为结束标记。
zh_hant: 此位置不可出現結束標籤。

# XML_ElementTypeMatch
source: End tag '{0}' does not match the start tag '{1}'.
cs: Koncová značka {0} neodpovídá počáteční značce {1}.
de: Das Endtag "{0}" stimmt nicht mit dem Starttag "{1}" überein.
es: La etiqueta final '{0}' no coincide con la etiqueta de inicio '{1}'.
fr: La balise de fin '{0}' ne correspond pas à la balise de début '{1}'.
it: Il tag finale '{0}' non corrisponde al tag iniziale '{1}'.
ja: 終了タグ '{0}' が開始タグ '{1}' と一致しません。
ko: {0}' 끝 태그가 '{1}' 시작 태그와 일치하지 않습니다.
pl: Tag końcowy „{0}” nie jest zgodny z tagiem początkowym „{1}”.
pt_br: Tag de fim "{0}" não corresponde à tag de início "{1}".
ru: Конечный тег "{0}" не соответствует начальному тегу "{1}".
tr: {0}' bitiş etiketi '{1}' başlangıç etiketi ile eşleşmiyor.
zh_hans: 结束标记“{0}”与开始标记“{1}”不匹配。
zh_hant: 結束標籤 '{0}' 與起始標籤 '{1}' 不對稱。

# XML_EndTagExpected
source: Expected an end tag for element '{0}'.
cs: Očekávala se koncová značka pro element {0}.
de: Ein Endtag für Element "{0}" wurde erwartet.
es: Se esperaba una etiqueta final para el elemento '{0}'.
fr: Une balise de fin était attendue pour l'élément '{0}'.
it: È previsto un tag finale per l'elemento '{0}'.
ja: 要素 '{0}' に終了タグが必要です。
ko: {0}' 요소에 대한 끝 태그가 필요합니다.
pl: Oczekiwano tagu końcowego dla elementu „{0}”.
pt_br: Espera-se uma tag de fim para o elemento "{0}".
ru: Требуется конечный тег для элемента "{0}".
tr: {0}' öğesi için bir bitiş etiketi bekleniyor.
zh_hans: 元素“{0}”需要结束标记。
zh_hant: 必須是元素 '{0}' 的結束標籤。

# XML_WhitespaceMissing
source: Required white space was missing.
cs: Chybí požadovaná mezera.
de: Das erforderliche Leerzeichen fehlt.
es: Falta el espacio en blanco necesario.
fr: L'espace blanc obligatoire est manquant.
it: Manca lo spazio vuoto obbligatorio.
ja: 必要な空白がありませんでした。
ko: 필요한 공백이 없습니다.
pl: Brak wymaganego białego znaku.
pt_br: Espaço em branco necessário estava ausente.
ru: Отсутствует требуемый пробел.
tr: Gerekli boşluk eksik.
zh_hans: 缺少所需空格。
zh_hant: 遺漏了必要的空格。

# XML_ExpectedEndOfXml
source: Unexpected character at this location.
cs: Neočekávaný znak na tomto místě
de: Unerwartetes Zeichen an dieser Stelle.
es: Carácter inesperado en esta ubicación.
fr: Caractère inattendu à cet emplacement.
it: Il carattere non è previsto in questa posizione.
ja: この位置には予期しない文字です。
ko: 이 위치에 예기치 않은 문자가 있습니다.
pl: Nieoczekiwany znak w tej lokalizacji.
pt_br: Caractere inesperado neste local.
ru: Непредвиденный символ в этом месте.
tr: Bu konumda beklenmeyen karakter.
zh_hans: 此位置出现意外字符。
zh_hant: 此位置處找到未預期的字元。

# XML_CDataEndTagNotAllowed
source: The literal string ']]>' is not allowed in element content.
cs: V obsahu elementu není povolený řetězec literálu ']]>'.
de: Die Literalzeichenfolge "]]>" ist in Inhaltselementen nicht zugelassen.
es: La cadena literal ']]>' no se permite en el contenido de elemento.
fr: La chaîne littérale ']]>' n'est pas autorisée dans le contenu de l'élément.
it: La stringa letterale ']]>' non è consentita nel contenuto dell'elemento.
ja: リテラル文字列 ']]>' は要素コンテンツでは許可されていません。
ko: 요소 콘텐츠에는 ']]>' 리터럴 문자열이 허용되지 않습니다.
pl: Ciąg literału „]]>” jest niedozwolony w zawartości elementu.
pt_br: A cadeia de caracteres literal "]]>" não é permitida no conteúdo do elemento.
ru: Использование строки литерала "]]>" в содержимом элемента не допускается.
tr: Değişmez ']]>' dizesine öğe içeriğinde izin verilmez.
zh_hans: 元素内容中不允许使用字符串“]]>”。
zh_hant: 常值字串 ']]>' 不可用在元素內容中。

# XML_DuplicateAttribute
source: Duplicate '{0}' attribute
cs: Duplicitní atribut {0}
de: Doppeltes Attribut "{0}".
es: Atributo '{0}' duplicado
fr: Attribut '{0}' en double
it: L'attributo '{0}' è duplicato
ja: '{0}' 属性が重複しています
ko: {0}' 특성이 중복되었습니다.
pl: Zduplikowany atrybut „{0}”
pt_br: Duplicar atributo "{0}"
ru: Повторяющийся атрибут "{0}"
tr: Yinelenen '{0}' özniteliği
zh_hans: “{0}”特性重复
zh_hant: '{0}' 屬性重複

# ERR_NoMetadataFile
source: Metadata file '{0}' could not be found
cs: Soubor metadat {0} se nenašel.
de: Metadatendatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de metadatos '{0}'
fr: Fichier de métadonnées '{0}' introuvable
it: Il file di metadati '{0}' non è stato trovato
ja: メタデータ ファイル '{0}' が見つかりませんでした
ko: {0}' 메타데이터 파일을 찾을 수 없습니다.
pl: Nie można znaleźć pliku metadanych „{0}”
pt_br: Arquivo de origem "{0}" não pode ser encontrado
ru: Не удалось найти файл метаданных "{0}".
tr: Meta veri dosyası '{0}' bulunamadı
zh_hans: 未能找到元数据文件“{0}”
zh_hant: 找不到中繼資料檔 '{0}'

# ERR_MetadataReferencesNotSupported
source: Metadata references are not supported.
cs: Odkazy v metadatech se nepodporují.
de: Metadatenverweise werden nicht unterstützt.
es: Las referencias de metadatos no son compatibles.
fr: Les références de métadonnées ne sont pas prises en charge.
it: I riferimenti ai metadati non sono supportati.
ja: メタデータ参照はサポートされていません。
ko: 메타데이터 참조는 지원되지 않습니다.
pl: Odwołania do metadanych nie są obsługiwane.
pt_br: Não há suporte a referências de metadados.
ru: Ссылки на метаданные не поддерживаются.
tr: Meta veri başvuruları desteklenmiyor.
zh_hans: 不支持元数据引用。
zh_hant: 不支援中繼資料參考。

# FTL_MetadataCantOpenFile
source: Metadata file '{0}' could not be opened -- {1}
cs: Soubor metadat {0} nešel otevřít -- {1}
de: Metadatendatei "{0}" konnte nicht geöffnet werden: {1}
es: No se pudo abrir el archivo de metadatos '{0}': {1}
fr: Impossible d'ouvrir le fichier de métadonnées '{0}' -- {1}
it: Non è possibile aprire il file di metadati '{0}' - '{1}'
ja: メタデータ ファイル '{0}' を開けませんでした -- {1}
ko: {0}' 메타데이터 파일을 열 수 없습니다. {1}
pl: Nie można otworzyć pliku metadanych „{0}” — {1}
pt_br: Arquivo de metadados "{0}" não pode ser aberto -- {1}
ru: Не удалось открыть файл метаданных "{0}" — {1}
tr: {0}' meta veri dosyası açılamadı -- {1}
zh_hans: 无法打开元数据文件“{0}”-- {1}
zh_hant: 無法開啟中繼資料檔'{0}' -- {1}

# ERR_NoTypeDef
source: The type '{0}' is defined in an assembly that is not referenced. You must add a reference to assembly '{1}'.
cs: Typ {0} je definovaný jako sestavení, na které se neodkazuje. Je nutné přidat odkaz na sestavení {1}.
de: Der Typ "{0}" ist in einer nicht referenzierten Assembly definiert. Fügen Sie einen Verweis auf die Assembly "{1}" hinzu.
es: El tipo '{0}' está definido en un ensamblado al que no se hace referencia. Debe agregar una referencia al ensamblado '{1}'.
fr: Le type '{0}' est défini dans un assembly qui n'est pas référencé. Vous devez ajouter une référence à l'assembly '{1}'.
it: Il tipo '{0}' è definito in un assembly di cui manca il riferimento. Aggiungere un riferimento all'assembly '{1}'.
ja: 型 '{0}' は、参照されていないアセンブリに定義されています。アセンブリ '{1}' に参照を追加する必要があります。
ko: {0}' 형식이 참조되지 않은 어셈블리에 정의되었습니다. '{1}' 어셈블리에 참조를 추가해야 합니다.
pl: Typ „{0}” jest zdefiniowany w nieprzywoływanym zestawie. Musisz dodać odwołanie do zestawu „{1}”.
pt_br: O tipo "{0}" está definido em um assembly que não é referenciado. Você deve adicionar uma referência ao assembly "{1}".
ru: Тип "{0}" определен в сборке, на которую нет ссылки. Следует добавить ссылку на сборку "{1}".
tr: {0}' başvurulmayan bir derlemede tanımlandı. '{1}' derlemesine bir başvuru eklemelisiniz.
zh_hans: 类型“{0}”在未引用的程序集中定义。必须添加对程序集“{1}”的引用。
zh_hant: 類型 '{0}' 定義在未參考的組件中。您必須加入組件 '{1}' 的參考。

# ERR_NoTypeDefFromModule
source: The type '{0}' is defined in a module that has not been added. You must add the module '{1}'.
cs: Typ {0} je definovaný v modulu, který jste nepřidali. Musíte přidat modul {1}.
de: Der Typ "{0}" wurde in einem nicht hinzugefügten Modul definiert. Sie müssen das Modul "{1}" hinzufügen.
es: El tipo '{0}' está definido en un módulo que todavía no se ha agregado. Debe agregar el módulo '{1}'.
fr: Le type '{0}' est défini dans un module qui n'a pas été ajouté. Vous devez ajouter le module '{1}'.
it: Il tipo '{0}' è definito in un modulo che non è stato ancora aggiunto. È necessario aggiungere il modulo '{1}'.
ja: 型 '{0}' は、追加されていないモジュールに定義されています。モジュール '{1}' を追加する必要があります。
ko: {0}' 형식이 추가되지 않은 모듈에 정의되었습니다. '{1}' 모듈을 추가해야 합니다.
pl: Typ „{0}” jest zdefiniowany w module, który nie został dodany. Musisz dodać moduł „{1}”.
pt_br: O tipo "{0}" está definido em um módulo não foi adicionado. Você deve adicionar o módulo "{1}".
ru: Тип "{0}" определен в модуле, который еще не был добавлен. Необходимо добавить модуль "{1}".
tr: {0}' türü henüz eklenmemiş bir modülde tanımlandı. '{1}' modülünü eklemelisiniz.
zh_hans: 类型“{0}”在未添加的模块中定义。必须添加模块“{1}”。
zh_hant: 類型 '{0}' 定義在未加入的模組中。您必須加入模組 '{1}'。
