Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_BadXMLRefTypeVar
source: XML comment has cref attribute '{0}' that refers to a type parameter
cs: Komentář XML má atribut cref {0}, který odkazuje na parametr typu.
de: Der XML-Kommentar enthält ein cref-Attribut "{0}", das auf einen Typparameter verweist.
es: El comentario XML tiene un atributo cref '{0}' que hace referencia a un parámetro de tipo
fr: L'attribut cref '{0}' du commentaire XML fait référence à un paramètre de type
it: Il commento XML contiene l'attributo cref '{0}' che fa riferimento a un parametro di tipo
ja: XML コメントに型パラメーターを参照する cref 属性 '{0}' が指定されています
ko: XML 주석에 형식 매개 변수를 참조하는 '{0}' cref 특성이 있습니다.
pl: Komentarz XML zawiera atrybut cref „{0}” przywołujący parametr typu
pt_br: O comentário XML tem atributo cref "{0}" que refere-se a um parâmetro de tipo
ru: Комментарий XML для "{0}" имеет атрибут cref, который ссылается на параметр типа.
tr: XML yorumu bir tür parametresine başvuran '{0}' cref özniteliğine sahip
zh_hans: XML 注释中有引用类型参数的 cref 特性“{0}”
zh_hant: XML 註解具有參考類型參數的 cref 屬性 '{0}'

# WRN_BadXMLRefTypeVar_Title
source: XML comment has cref attribute that refers to a type parameter
cs: Komentář XML má atribut cref, který odkazuje na parametr typu.
de: XML-Kommentar weist ein cref-Attribut auf, das sich auf einen Typparameter bezieht.
es: El comentario XML tiene un atributo cref que hace referencia a un parámetro de tipo
fr: Le commentaire XML possède un attribut cref qui fait référence à un paramètre de type
it: Il commento XML contiene l'attributo cref che fa riferimento a un parametro di tipo
ja: XML コメントに型パラメーターを参照する cref 属性があります
ko: XML 주석에 형식 매개 변수를 참조하는 cref 특성이 있습니다.
pl: Komentarz XML zawiera atrybut cref przywołujący parametr typu
pt_br: O comentário XML tem um atributo cref que faz referência a um parâmetro de tipo
ru: Атрибут cref комментария XML ссылается на параметр типа
tr: XML açıklaması bir tür parametresine başvuran cref özniteliğine sahip
zh_hans: XML 注释中有引用类型参数的 cref 特性
zh_hant: XML 註解具有參考類型參數的 cref 屬性

# ERR_FriendAssemblyBadArgs
source: Friend assembly reference '{0}' is invalid. InternalsVisibleTo declarations cannot have a version, culture, public key token, or processor architecture specified.
cs: Odkaz na sestavení {0} typu Friend je neplatný. V deklaracích InternalsVisibleTo nesmí být zadaná verze, jazykové prostředí, token veřejného klíče ani architektura procesoru.
de: Der friend-Assemblyverweis "{0}" ist ungültig. Für InternalsVisibleTo-Deklarationen kann keine Version, keine Kultur, kein öffentliches Schlüsseltoken und keine Prozessorarchitektur angegeben werden.
es: La referencia de ensamblado de confianza '{0}' no es válida. Las declaraciones InternalsVisibleTo no pueden tener especificada una versión, una referencia cultural, un token de clave pública ni una arquitectura de procesador.
fr: La référence d'assembly Friend '{0}' n'est pas valide. Les déclarations InternalsVisibleTo ne peuvent pas avoir une version, une culture, un jeton de clé publique ou une architecture de processeur spécifié.
it: Il riferimento all'assembly Friend {0} non è valido. Nelle dichiarazioni InternalsVisibleTo non è possibile specificare la versione, le impostazioni cultura, il token di chiave pubblica o l'architettura del processore.
ja: フレンド アセンブリ参照 '{0}' は無効です。InternalsVisibleTo 宣言にバージョン、カルチャ、公開キー トークン、またはプロセッサ属性を指定することはできません。
ko: Friend 어셈블리 참조 '{0}'이(가) 잘못되었습니다. InternalsVisibleTo 선언에는 버전, 문화권, 공개 키 토큰 또는 프로세서 아키텍처를 지정할 수 없습니다.
pl: Odwołanie do przyjaznego zestawu „{0}” jest nieprawidłowe. Deklaracje InternalsVisibleTo nie mogą mieć określonej wersji, kultury, tokena klucza publicznego ani architektury procesora.
pt_br: Referência do assembly Friend "{0}" é inválido. Declarações InternalsVisibleTo não podem ter uma versão, cultura, token de chave pública ou arquitetura de processador especificada.
ru: Недопустимая дружественная ссылка на сборку "{0}". Объявления InternalsVisibleTo не содержат определения версии, языка и региональных параметров, токена открытого ключа или архитектуры процессора.
tr: {0}' friend derleme başvurusu geçersiz. InternalsVisibleTo bildirimlerinde sürüm, kültür, ortak anahtar simgesi veya işlemci mimarisi belirtilemez.
zh_hans: 友元程序集引用“{0}”无效。不能在 InternalsVisibleTo 声明中指定版本、区域性、公钥标记或处理器架构。
zh_hant: Friend 組件參考 '{0}' 無效。InternalsVisibleTo 宣告不可指定版本、文化特性、公開金鑰語彙基元或處理器架構。

# ERR_FriendAssemblySNReq
source: Friend assembly reference '{0}' is invalid. Strong-name signed assemblies must specify a public key in their InternalsVisibleTo declarations.
cs: Odkaz na sestavení {0} typu Friend je neplatný. V deklaracích InternalsVisibleTo musí být u podepsaných sestavení se silným názvem uvedený veřejný klíč.
de: Der friend-Assemblyverweis "{0}" ist ungültig. Signierte Assemblys mit starkem Namen müssen in ihren InternalsVisibleTo-Deklarationen einen öffentlichen Schlüssel angeben.
es: La referencia de ensamblado de confianza '{0}' no es válida. Los ensamblados firmados con nombre seguro deben especificar una clave pública en sus declaraciones InternalsVisibleTo.
fr: La référence d'assembly Friend '{0}' n'est pas valide. Les assemblys signés avec un nom fort doivent spécifier une clé publique dans leurs déclarations InternalsVisibleTo.
it: Il riferimento {0} all'assembly Friend non è valido. Gli assembly firmati con nome sicuro devono specificare una chiave pubblica nelle rispettive dichiarazioni InternalsVisibleTo.
ja: フレンド アセンブリ参照 '{0}' は無効です。厳密な名前の署名つきアセンブリはその InternalsVisibleTo 宣言内で公開キーを指定しなければなりません。
ko: Friend 어셈블리 참조 '{0}'이(가) 잘못되었습니다. 강력한 이름의 서명된 어셈블리에는 InternalsVisibleTo 선언에 공개 키를 지정해야 합니다.
pl: Odwołanie do przyjaznego zestawu „{0}” jest nieprawidłowe. Zestawy podpisane silnymi nazwami muszą określać klucz publiczny w swoich deklaracjach InternalsVisibleTo.
pt_br: Referência do assembly Friend "{0}" é inválida. Assemblies assinados com nome forte devem especificar uma chave pública em suas declarações InternalsVisibleTo.
ru: Недопустимая дружественная ссылка на сборку "{0}". Сборки, подписанные строгим именем, должны содержать в объявлении InternalsVisibleTo открытый ключ.
tr: {0}' friend derleme başvurusu geçersiz. Kesin ad imzalı derlemelerin kendi InternalsVisibleTo bildirmelerinde bir ortak anahtar belirtmesi gerekir.
zh_hans: 友元程序集引用“{0}”无效。强名称签名的程序集必须在其 InternalsVisibleTo 声明中指定一个公钥。
zh_hant: Friend 組件參考 '{0}' 無效。以強式名稱簽署的組件，在其 InternalsVisibleTo 宣告中必須指定公開金鑰。

# ERR_DelegateOnNullable
source: Cannot bind delegate to '{0}' because it is a member of 'System.Nullable<T>'
cs: Nejde vytvořit vazbu delegáta s {0}, protože je členem struktury System.Nullable<T>.
de: Der Delegat kann nicht an "{0}" gebunden werden, da er ein Member von "System.Nullable<T>" ist.
es: No se puede enlazar el delegado con '{0}' porque es un miembro de 'System.Nullable<T>'
fr: Impossible de lier le délégué à '{0}' car il s'agit d'un membre de 'System.Nullable<T>'
it: Non è possibile associare il delegato a '{0}' perché è un membro di 'System.Nullable<T>'
ja: System.Nullable<T>' のメンバーであるため、デリゲートを '{0}' にバインドできません
ko: {0}'은(는) 'System.Nullable<T>'의 멤버이므로 대리자를 바인딩할 수 없습니다.
pl: Nie można powiązać obiektu delegowanego z elementem „{0}”, ponieważ jest to składowa typu „System.Nullable<T>”.
pt_br: Não é possível associar o representante a "{0}" porque ele é membro de "System.Nullable<T>"
ru: Не удается привязать делегат к "{0}", так как он является членом "System.Nullable<T>".
tr: Temsilci, 'System.Nullable<T>' üyesi olduğundan '{0}' öğesine bağlanamaz
zh_hans: 无法将委托绑定到作为 "System.Nullable<T>" 成员的“{0}”
zh_hant: 無法將委派繫結至 '{0}'，因為其為 'System.Nullable<T>' 的成員。

# ERR_BadCtorArgCount
source: '{0}' does not contain a constructor that takes {1} arguments
cs: {0} neobsahuje konstruktor, který přebírá tento počet argumentů: {1}.
de: '"{0}" enthält keinen Konstruktor, der {1} Argumente annimmt.
es: '{0}' no contiene un constructor que tome {1} argumentos
fr: '{0}' ne contient pas de constructeur qui accepte des arguments {1}
it: '{0}' non contiene un costruttore che accetta argomenti {1}
ja: '{0}' には、引数 {1} を指定するコンストラクターは含まれていません
ko: '{0}'에는 인수를 {1}개 사용하는 생성자가 포함되어 있지 않습니다.
pl: 'Element „{0}” nie zawiera konstruktora przyjmującego następującą liczbę argumentów: {1}
pt_br: "{0}" não contém um construtor que aceita {1} argumentos
ru: "{0}" не содержит конструктор, который принимает аргументы {1}.
tr: '{0}', {1} bağımsız değişkenlerini alan bir oluşturucu içermiyor
zh_hans: “{0}”不包含采用 {1} 个参数的构造函数
zh_hant: '{0}' 未包含使用 {1} 個引數的建構函式

# ERR_GlobalAttributesNotFirst
source: Assembly and module attributes must precede all other elements defined in a file except using clauses and extern alias declarations
cs: Atributy sestavení a modulu musí předcházet přede všemi ostatními prvky definovanými v souboru s výjimkou klauzulí using a deklarací externích aliasů.
de: Assembly- und Modulattribute müssen vor allen anderen in einer Datei definierten Elementen mit Ausnahme von using-Klauseln und externen Aliasdeklarationen angegeben werden.
es: Los atributos de módulo y ensamblado deben ir delante de los demás elementos definidos en un archivo, excepto las cláusulas using y las declaraciones de alias externos
fr: Les attributs de l'assembly et du module doivent précéder tous les autres éléments définis dans un fichier à l'exception des clauses using et des déclarations d'alias extern
it: Gli attributi di modulo e assembly devono precedere tutti gli altri elementi definiti in un file ad eccezione delle clausole using e delle dichiarazioni di alias extern
ja: アセンブリ属性とモジュール属性は、句および extern エイリアス宣言を使用する場合を除き、ファイルで定義された他のすべての要素の前に指定しなければなりません
ko: using 절과 extern 별칭 선언을 제외하고 어셈블리 특성과 모듈 특성은 파일에 정의된 다른 모든 요소보다 앞에 와야 합니다.
pl: Atrybuty zestawu i modułu muszą występować przed wszystkimi innymi elementami zdefiniowanymi w pliku poza klauzulami using i deklaracjami aliasów zewnętrznych
pt_br: Os atributos assembly e module devem preceder todos os outros elementos definidos em um arquivo, exceto as cláusulas using e as declarações de alias externas
ru: Атрибуты сборки и модуля должны находиться перед всеми остальными элементами в файле, кроме предложений using и описаний внешних псевдонимов.
tr: Assembly ve module öznitelikleri, using yan tümceleri ve extern diğer ad bildirimleri dışında dosyada tanımlanan diğer tüm öğelerden önce gelmelidir
zh_hans: 程序集和模块特性必须位于文件中定义的所有其他元素之前(using 子句和外部别名声明除外)
zh_hant: 組件和模組屬性必須位於檔案中所有定義的其他項目之前 (using 子句與外部別名宣告除外)

# ERR_ExpressionExpected
source: Expected expression
cs: Očekával se výraz.
de: Ausdruck erwartet.
es: Se esperaba una expresión
fr: Expression attendue
it: È prevista l'espressione
ja: 式が必要です
ko: 식이 필요합니다.
pl: Oczekiwano wyrażenia
pt_br: Expressão esperada
ru: Требуется выражение.
tr: İfade bekleniyor
zh_hans: 应为表达式
zh_hant: 必須是運算式

# ERR_InvalidSubsystemVersion
source: Invalid version {0} for /subsystemversion. The version must be 6.02 or greater for ARM or AppContainerExe, and 4.00 or greater otherwise
cs: Neplatná verze {0} pro /subsystemversion. Verze musí být 6.02 nebo vyšší pro ARM nebo AppContainerExe a 4.00 nebo vyšší v ostatních případech.
de: Ungültige Version "{0}" für /subsystemversion. Die Version muss 6.02 oder höher für ARM oder AppContainerExe sein, andernfalls 4.00 oder höher.
es: Versión {0} no válida para /subsystemversion. La versión debe ser 6.02 o posterior para ARM o AppContainerExe, y 4.00 o posterior en caso contrario
fr: Version {0} non valide pour /subsystemversion. La version doit être 6.02 ou supérieure pour ARM ou AppContainerExe, et 4.00 ou supérieure dans les autres cas
it: La versione {0} non è valida per /subsystemversion. La versione deve essere 6.02 o successiva per ARM o AppContainerExe e 4.00 o successiva negli altri casi
ja: /subsystemversion のバージョン {0} は無効です。バージョンは、ARM または AppContainerExe の場合は 6.02 以上、それ以外の場合は 4.00 以上である必要があります。
ko: /subsystemversion에 대해 잘못된 버전({0})입니다. 버전은 ARM 또는 AppContainerExe의 경우 6.02 이상이어야 하고, 그 외의 경우 4.00 이상이어야 합니다.
pl: Nieprawidłowa wersja „{0}” dla opcji /subsystemversion. Wymagana jest 6.02 lub nowsza dla ARM lub AppContainerExe oraz wersja 4.00 lub nowsza w pozostałych przypadkach
pt_br: Versão inválida {0} para /subsystemversion. A versão deve ser 6.02 ou posterior para ARM ou AppContainerExe e 4.00 ou superior
ru: Недопустимое значение версии {0} для /subsystemversion. Для ARM или AppContainerExe должна быть указана версия 6.02, в остальных случаях - версия 4.00 или выше
tr: /subsystemversion için geçersiz {0} sürümü. Sürüm ARM veya AppContainerExe için 6.02 veya üstü, diğerleri için ise 4.00 veya üstü olmalıdır
zh_hans: 版本 {0} 对于 /subsystemversion 无效。对于 ARM 或 AppContainerExe，此版本必须是 6.02 或更高，其他情况下必须为 4.00 或更高
zh_hant: /subsystemversion 的版本 {0} 無效。ARM 或 AppContainerExe 的版本必須是 6.02 (含) 以上的版本，其他則必須是 4.00 (含) 以上的版本。

# ERR_InteropMethodWithBody
source: Embedded interop method '{0}' contains a body.
cs: Vložená metoda spolupráce {0} obsahuje tělo.
de: Die eingebettete Interopmethode "{0}" enthält Text.
es: El método de interoperabilidad incrustado '{0}' contiene un cuerpo.
fr: La méthode interop incorporée '{0}' contient un corps.
it: Il metodo di interoperabilità incorporato '{0}' contiene un corpo.
ja: 埋め込み相互運用メソッド '{0}' には本体が含まれます。
ko: 포함된 interop 메서드 '{0}'에 본문이 있습니다.
pl: Osadzona metoda międzyoperacyjna „{0}” zawiera treść.
pt_br: Método de interoperabilidade inserido "{0}" contém um corpo.
ru: Внедренный метод взаимодействия "{0}" содержит тело.
tr: Gömülü birlikte çalışma yöntemi '{0}' bir gövde içeriyor.
zh_hans: 嵌入互操作方法“{0}”包含主体。
zh_hant: 內嵌 Interop 方法 '{0}' 包含主體。

# ERR_BadWarningLevel
source: Warning level must be zero or greater
cs: Úroveň upozornění musí být nula nebo větší.
fr: Le niveau d'avertissement doit être supérieur ou égal à zéro
it: Il livello di avviso deve essere maggiore o uguale a zero
ja: 警告レベルには 0 以上を指定する必要があります
pl: Poziom ostrzeżeń musi mieć wartość zero lub większą
pt_br: O nível de aviso precisa ser igual ou superior a zero
ru: Уровень предупреждений должен быть неотрицательным.
zh_hans: 警告等级必须大于或等于零
zh_hant: 警告層級必須大於或等於零

# ERR_BadDebugType
source: Invalid option '{0}' for /debug; must be 'portable', 'embedded', 'full' or 'pdbonly'
cs: Neplatný parametr {0} pro /debug; musí být portable, embedded, full nebo pdbonly.
de: Ungültige Option "{0}" für "/debug". Die Option muss "portable", "embedded", "full" oder "pdbonly" lauten.
es: Opción '{0}' no válida para /debug; debe ser 'portable', 'embedded', 'full' o 'pdbonly'
fr: Option '{0}' non valide pour /debug ; les options valides sont 'portable', 'embedded', 'full' ou 'pdbonly'
it: L'opzione '{0}' non è valida per /debug. Specificare 'portable', 'embedded', 'full' o 'pdbonly'
ja: /debug のオプション '{0}' が無効です。'portable'、'embedded'、'full'、または 'pdbonly' を指定してください
ko: /debug에 대해 잘못된 '{0}' 옵션입니다. 'portable', 'embedded', 'full' 또는 'pdbonly'여야 합니다.
pl: Nieprawidłowa opcja „{0}” dla opcji /debug; wymagana wartość to „portable”, „embedded”, „full” lub „pdbonly”
pt_br: Opção '{0}' inválida para /debug; deve ser 'portable', 'embedded', 'full' ou 'pdbonly'
ru: Недопустимый параметр "{0}" для /debug; допустимые значения: "portable", "embedded", "full" или "pdbonly"
tr: /debug için geçersiz '{0}' seçeneği. Seçenek 'portable', 'embedded', 'full' veya 'pdbonly' olmalı
zh_hans: 用于 /debug 的选项“{0}”无效；选项必须是 "portable"、"embedded"、"full" 或 "pdbonly"
zh_hant: /debug 的選項 '{0}' 無效; 必須為 'portable'、'embedded'、'full' 或 'pdbonly'

# ERR_BadResourceVis
source: Invalid option '{0}'; Resource visibility must be either 'public' or 'private'
cs: Neplatná možnost {0}. Viditelnost zdroje musí být public nebo private.
de: Ungültige Option "{0}". Ressourcensichtbarkeit muss entweder "public" oder "private" sein.
es: Opción '{0}' no válida; la visibilidad de los recursos debe ser 'public' o 'private'
fr: Option non valide '{0}' ; la visibilité de la ressource doit être 'public' ou 'private'
it: L'opzione '{0}' non è valida. La visibilità della risorsa deve essere 'public' o 'private'
ja: 無効なオプション '{0}' です。リソースの表示範囲は 'public' または 'private' でなければなりません
ko: 잘못된 '{0}' 옵션입니다. 리소스 표시 유형은 'public' 또는 'private'이어야 합니다.
pl: Nieprawidłowa opcja „{0}”; widoczność zasobu musi mieć wartość „public” lub „private”
pt_br: Opção inválida "{0}"; Visibilidade de recursos deve ser "public" ou "private"
ru: Недопустимый параметр "{0}"; видимость ресурса должна быть либо "public", либо "private".
tr: Geçersiz seçenek '{0}'; Kaynak görünürlüğü 'public' veya 'private' olmalıdır
zh_hans: 选项“{0}”无效；资源可见性必须是“public”或“private”
zh_hant: 選項 '{0}' 無效; 資源可見度必須是 'public' 或 'private'

# ERR_DefaultValueTypeMustMatch
source: The type of the argument to the DefaultParameterValue attribute must match the parameter type
cs: Typ argumentu atributu DefaultParameterValue musí odpovídat typu parametru.
de: Der Typ des Arguments für das DefaultParameterValue-Attribut muss mit dem Parametertyp übereinstimmen.
es: El tipo de argumento para el atributo DefaultParameterValue debe coincidir con el tipo de parámetro
fr: Le type de l'argument de l'attribut DefaultParameterValue doit correspondre au type de paramètre
it: Il tipo dell'argomento dell'attributo DefaultParameterValue deve corrispondere al tipo del parametro
ja: DefaultParameterValue 属性への引数の型は、パラメーター型と一致していることが必要です
ko: DefaultParameterValue 특성에 대한 인수 형식이 매개 변수 형식과 일치해야 합니다.
pl: Typ argumentu atrybutu DefaultParameterValue musi być zgodny z typem parametru
pt_br: O tipo do argumento para o atributo DefaultParameterValue deve corresponder ao tipo de parâmetro
ru: Тип аргумента для атрибута DefaultParameterValue должен соответствовать типу параметра.
tr: DefaultParameterValue özniteliğine geçirilen bağımsız değişkenin türü parametre türüyle eşleşmelidir
zh_hans: DefaultParameterValue 特性的实参类型必须与形参类型匹配
zh_hant: DefaultParameterValue 屬性的引數類型和參數類型必須相符

# ERR_DefaultValueBadValueType
source: Argument of type '{0}' is not applicable for the DefaultParameterValue attribute
cs: Argument typu {0} není použitelný pro atribut DefaultParameterValue.
de: Ein Argument vom Typ "{0}" ist für das DefaultParameterValue-Attribut nicht zutreffend.
es: El argumento de tipo '{0}' no se puede aplicar al atributo DefaultParameterValue
fr: L'argument de type '{0}' n'est pas applicable pour l'attribut DefaultParameterValue
it: L'argomento di tipo '{0}' non è applicabile per l'attributo DefaultParameterValue
ja: 型 '{0}' の引数は DefaultParameterValue 属性には適用できません
ko: {0}' 형식의 인수는 DefaultParameterValue 특성에 사용할 수 없습니다.
pl: Argumentu typu „{0}” nie można stosować do atrybutu DefaultParameterValue
pt_br: Argumento do tipo "{0}" não é aplicável para o atributo DefaultParameterValue
ru: Аргумент типа "{0}" неприменим для атрибута DefaultParameterValue.
tr: {0}' türünün bağımsız değişkeni DefaultParameterValue özniteliği için kullanılamıyor
zh_hans: “{0}”类型的参数不适用于 DefaultParameterValue 特性
zh_hant: 類型 '{0}' 的引數不適用於 DefaultParameterValue 屬性

# ERR_MemberAlreadyInitialized
source: Duplicate initialization of member '{0}'
cs: Duplicitní inicializace členu {0}
de: Doppelte Initialisierung des Members "{0}".
es: Inicialización del miembro '{0}' duplicada
fr: Initialisation du membre '{0}' en double
it: Inizializzazione del membro '{0}' duplicata
ja: メンバー '{0}' の初期化が重複しています
ko: {0}' 멤버의 초기화가 중복되었습니다.
pl: Zduplikowana inicjacja składowej „{0}”
pt_br: Duplicar inicialização do membro "{0}"
ru: Повторная инициализация члена "{0}"
tr: {0}' üyesinin yinelenen başlatması
zh_hans: 成员“{0}”的初始化重复
zh_hant: 成員 '{0}' 的初始設定重複

# ERR_MemberCannotBeInitialized
source: Member '{0}' cannot be initialized. It is not a field or property.
cs: Člen {0} nejde inicializovat. Nejedná se o pole ani vlastnost.
de: Der Member "{0}" kann nicht initialisiert werden. Er ist kein Feld und keine Eigenschaft.
es: No se puede inicializar el miembro '{0}'. No es un campo ni una propiedad.
fr: Impossible d'initialiser le membre '{0}'. Il ne s'agit pas d'un champ ou d'une propriété.
it: Non è possibile inizializzare il membro '{0}'. Non è un campo o una proprietà.
ja: メンバー '{0}' はフィールドまたはプロパティではないため、初期化することはできません。
ko: {0}' 멤버를 초기화할 수 없습니다. 이 멤버는 필드 또는 속성이 아닙니다.
pl: Nie można zainicjować składowej „{0}”. To nie jest pole ani właściwość.
pt_br: Membro "{0}" não pode ser inicializado. Não é um campo ou propriedade.
ru: Не удается инициализировать член "{0}". Это не поле или свойство.
tr: {0}' üyesi başlatılamıyor. Bir alan veya özellik değil.
zh_hans: 成员“{0}”无法初始化。它不是字段或属性。
zh_hant: 成員 '{0}' 無法進行初始設定，它不是欄位或屬性。

# ERR_StaticMemberInObjectInitializer
source: Static field or property '{0}' cannot be assigned in an object initializer
cs: Statické pole nebo vlastnost {0} se nedá přiřadit k inicializátoru objektu.
de: Das statische Feld oder die statische Eigenschaft "{0}" kann nicht in einem Objektinitialisierer zugewiesen werden.
es: No se puede asignar la propiedad o campo estático '{0}' en un inicializador de objeto
fr: Impossible d'assigner le champ ou la propriété statique '{0}' dans un initialiseur d'objet
it: Non è possibile assegnare la proprietà o il campo statico '{0}' in un inizializzatore di oggetti
ja: 静的フィールドまたはプロパティ '{0}' をオブジェクト初期化子に割り当てることはできません
ko: 정적 필드 또는 속성 '{0}'은(는) 개체 이니셜라이저에 할당할 수 없습니다.
pl: Statycznego pola lub właściwości „{0}” nie można przypisać w inicjatorze obiektu
pt_br: Campo estático ou propriedade "{0}" não pode ser atribuído a um inicializador de objeto
ru: Статическому полю или свойству "{0}" не может быть присвоено значение внутри инициализатора объекта.
tr: Statik alan veya '{0}' özelliği bir nesne başlatıcısına atanamaz
zh_hans: 无法在对象初始值设定项中为静态字段或属性“{0}”赋值
zh_hant: 無法在物件初始設定式中指派靜態欄位或屬性 '{0}'

# ERR_ReadonlyValueTypeInObjectInitializer
source: Members of readonly field '{0}' of type '{1}' cannot be assigned with an object initializer because it is of a value type
cs: Členy vlastnosti {0} typu {1} nejde přiřadit k inicializátoru objektu, protože tento inicializátor je hodnotového typu.
de: Member des schreibgeschützten Felds "{0}" vom Typ "{1}" können nicht mit einem Objektinitialisierer zugewiesen werden, da es sich um einen Werttyp handelt.
es: Los miembros del campo de solo lectura '{0}' de tipo '{1}' no se pueden asignar con un inicializador de objeto porque es de un tipo de valor
fr: Les membres du champ readonly '{0}' de type '{1}' ne peuvent pas être assignés avec un initialiseur d'objet, car il s'agit d'un type valeur
it: Non è possibile assegnare i membri del campo di sola lettura '{0}' di tipo '{1}' con un inizializzatore di oggetto perché è di un tipo di valore
ja: 型 '{1}' の読み取り専用フィールド '{0}' のメンバーは、値の型であるため、オブジェクト初期化子と共に割り当てることはできません
ko: 형식이 '{1}'인 읽기 전용 필드 '{0}'의 멤버는 값 형식이므로 개체 이니셜라이저를 사용하여 할당할 수 없습니다.
pl: Do składowych pola tylko do odczytu „{0}” typu „{1}” nie można przypisać inicjatora obiektu, ponieważ jest ono typu wartości
pt_br: Membros do campo de somente leitura "{0}" do tipo "{1}" não podem ser atribuídos com um inicializador de objeto porque ele é de um tipo de valor
ru: Членам поля только для чтения "{0}" типа "{1}" не могут быть присвоены значения с помощью инициализатора объекта, так как они имеют тип значения.
tr: {1}' türündeki salt okunur '{0}' alanının üyeleri, değer türünde olduğundan nesne başlatıcısıyla atanamadı
zh_hans: 无法使用对象初始值设定项为类型为“{1}”的只读字段“{0}”的成员赋值，因为它是值类型
zh_hant: 類型為 '{1}' 的唯讀欄位 '{0}' 之成員，無法以物件初始設定式進行指派，因為其為實值類型
