Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_VolatileByRef
source: '{0}': a reference to a volatile field will not be treated as volatile
cs: {0}: Odkaz na pole s modifikátorem volatile se nezpracuje jako volatile.
de: '"{0}": Ein Verweis auf ein flüchtiges Feld wird nicht als flüchtig behandelt.
es: '{0}': una referencia a un campo volátil no se tratará como tal
fr: '{0}' : une référence à un champ volatile ne sera pas considérée comme volatile
it: '{0}': un riferimento a un campo volatile non verrà considerato volatile
ja: '{0}': volatile フィールドへの参照は、volatile として扱われません
ko: '{0}': volatile 필드에 대한 참조는 volatile로 처리되지 않습니다.
pl: „{0}”: odwołanie do pola nietrwałego nie będzie traktowane jako nietrwałe
pt_br: "{0}": uma referência a um campo volátil não será tratada como volátil
ru: "{0}": ссылка на временное поле не будет считаться временной.
tr: '{0}': geçici alana başvuru geçici olarak değerlendirilir
zh_hans: “{0}”: 对 volatile 字段的引用不被视为 volatile
zh_hant: '{0}': volatile 欄位的參考不會視為 volatile

# WRN_VolatileByRef_Title
source: A reference to a volatile field will not be treated as volatile
cs: Odkaz na pole s modifikátorem volatile se nezpracuje jako volatile.
de: Ein Verweis auf ein temporäres Feld wird nicht als temporär behandelt
es: Una referencia a un campo volátil no se tratará como volátil
fr: Une référence à un champ volatile ne sera pas considérée comme volatile
it: Un riferimento a un campo volatile non verrà considerato volatile
ja: volatile フィールドへの参照は、volatile として扱われません
ko: volatile 필드에 대한 참조는 volatile로 처리되지 않습니다.
pl: Odwołanie do pola nietrwałego nie będzie traktowane jak nietrwałe
pt_br: Uma referência a um campo volátil não será tratada como volátil
ru: Ссылка на поле с модификатором volatile не будет использоваться как изменяемая ссылка
tr: Geçici alana başvuru geçici olarak ele alınmayacak
zh_hans: 对可变字段的引用不被视为可变字段
zh_hant: volatile 欄位的參考不會視為 volatile

# WRN_VolatileByRef_Description
source: A volatile field should not normally be used as a ref or out value, since it will not be treated as volatile. There are exceptions to this, such as when calling an interlocked API.
cs: Pole s modifikátorem volatile by se normálně mělo používat jako hodnota Ref nebo Out, protože se s ním nebude zacházet jako s nestálým. Pro toto pravidlo platí výjimky, například při volání propojeného API.
de: Ein temporäres Feld sollte in der Regel nicht als ref- oder out-Wert verwendet werden, weil es nicht als temporär behandelt wird. Es gibt jedoch Ausnahmen dazu, wie z. B. beim Aufruf einer Interlocked-API.
es: Normalmente, no debe usarse un campo volátil como valor ref o out, porque no se tratará como volátil. Pero hay excepciones, como cuando se llama a una API entrelazada.
fr: Normalement, un champ volatile ne doit pas être utilisé en tant que valeur ref ou out, car il n'est pas considéré comme volatile. Il existe des exceptions à cette situation, par exemple l'appel d'une API à blocage.
it: Un campo volatile non deve in genere essere usato come valore out o ref dal momento che non verrà considerato come volatile. Esistono eccezioni a questo comportamento, ad esempio quando si chiama un'API con interlock.
ja: volatile フィールドは、通常は ref 値または out 値として使用しないでください。このフィールドは、volatile として扱われないためです。ただしこれには、インタロック API の呼び出しのときなど、例外もあります。
ko: 일반적으로 volatile 필드는 volatile로 처리되지 않으므로 ref 또는 out 값으로 사용해서는 안 됩니다. 단, interlocked API를 호출하는 등의 경우에는 예외입니다.
pl: Pole nietrwałe nie powinno być zwykle używane jako wartość ref ani out, ponieważ nie będzie traktowane jak pole nietrwałe. Istnieją wyjątki od tej reguły, takie jak wywołanie blokowanego interfejsu API.
pt_br: Um campo volátil não deve normalmente ser usado como um valor ref ou out, uma vez que ele não é tratado como volátil. Há exceções, como ao chamar uma API interligada.
ru: Непостоянное поле обычно не должно использоваться в качестве значения ref или out, так как оно не будет считаться непостоянным. Существуют исключения, например при вызове заблокированного API.
tr: Geçici olarak ele alınmayacağından, geçici bir alan normalde ref veya out değeri olarak kullanılmalıdır. Bunun, kenetlenmiş bir API'nin çağrılması durumunda olduğu gibi özel durumları olabilir.
zh_hans: 可变字段通常不应用作 ref 或 out 值，因为它不会被视为可变字段。这种情况存在例外情况，如调用联锁 API 时。
zh_hant: 通常不應該將 volatile 欄位用作為 ref 或 out 值，因為不會將它視為 volatile。但有例外狀況，例如呼叫連鎖 API 時。

# ERR_ComImportWithImpl
source: Since '{1}' has the ComImport attribute, '{0}' must be extern or abstract
cs: Protože {1} má atribut ComImport, {0} musí být externí nebo abstraktní.
de: Da "{1}" das ComImport-Attribut aufweist, muss "{0}" extern oder abstrakt sein.
es: Como '{1}' tiene el atributo ComImport, '{0}' debe ser externo o abstracto
fr: Comme '{1}' possède l'attribut ComImport, '{0}' doit être extern ou abstract
it: '{1}' ha l'attributo ComImport, pertanto '{0}' deve essere extern o abstract
ja: '{1}' は ComImport 属性を含むため、'{0}' は extern または abstract にする必要があります
ko: {1}'에 ComImport 특성이 있으므로 '{0}'은(는) extern 또는 abstract여야 합니다.
pl: Ponieważ element „{1}” ma atrybut ComImport, element „{0}” musi być zewnętrzny lub abstrakcyjny
pt_br: Como "{1}" tem o atributo ComImport, "{0}" deve ser extern ou abstract
ru: Поскольку "{1}" имеет атрибут ComImport, "{0}" должен быть внешним или абстрактным.
tr: {1}' öğesinde ComImport özniteliği olduğundan, '{0}' öğesi extern veya abstract olmalıdır
zh_hans: 由于“{1}”具有 ComImport 特性，因此“{0}”必须是外部的或抽象的
zh_hant: 因為 '{1}' 具有 ComImport 屬性，所以 '{0}' 必須為 extern 或 abstract

# ERR_ComImportWithBase
source: '{0}': a class with the ComImport attribute cannot specify a base class
cs: {0}: Třída s atributem ComImport nemůže určovat základní třídu.
de: '"{0}": Eine Klasse mit dem ComImport-Attribut kann keine Basisklasse angeben.
es: '{0}': una clase con el atributo ComImport no puede especificar ninguna clase base
fr: '{0}' : une classe avec l'attribut ComImport ne peut pas spécifier une classe de base
it: '{0}': una classe con l'attributo ComImport non può specificare una classe base
ja: '{0}': ComImport 属性を含むクラスは、基底クラスを指定できません
ko: '{0}': ComImport 특성이 있는 클래스는 기본 클래스를 지정할 수 없습니다.
pl: „{0}”: klasa o atrybucie ComImport nie może określać klasy bazowej
pt_br: "{0}": uma classe com o atributo ComImport não pode especificar uma classe básica
ru: "{0}": класс с атрибутом ComImport не может указывать базовый класс.
tr: '{0}': ComImport özniteliğine sahip sınıf bir temel sınıf belirtemez
zh_hans: “{0}”: 具有 ComImport 特性的类不能指定基类
zh_hant: '{0}': 具有 ComImport 屬性的類別不可指定基底類別

# ERR_ImplBadConstraints
source: The constraints for type parameter '{0}' of method '{1}' must match the constraints for type parameter '{2}' of interface method '{3}'. Consider using an explicit interface implementation instead.
cs: Omezení pro parametr typu {0} metody {1} se musí shodovat s omezeními u parametru typu {2} metody rozhraní {3}. Místo toho zvažte použití explicitní implementace rozhraní.
de: Die Einschränkungen für den "{0}"-Typparameter der "{1}"-Methode müssen mit den Einschränkungen für den "{2}"-Typparameter der "{3}"-Schnittstellenmethode übereinstimmen. Verwenden Sie stattdessen eine explizite Schnittstellenimplementierung.
es: Las restricciones para el parámetro de tipo '{0} del método '{1} deben coincidir con las restricciones del parámetro de tipo '{2} del método de interfaz '{3}. Si lo prefiere, puede usar una implementación de interfaz explícita.
fr: Les contraintes pour le paramètre de type '{0}' de la méthode '{1}' doivent correspondre aux contraintes pour le paramètre de type '{2}' de la méthode d'interface '{3}'. Utilisez plutôt une implémentation d'interface explicite.
it: I vincoli per il parametro di tipo '{0}' del metodo '{1}' devono corrispondere ai vincoli per il parametro di tipo '{2}' del metodo di interfaccia '{3}'. Provare a usare un'implementazione esplicita dell'interfaccia.
ja: メソッド '{1}' の型パラメーター '{0}' に対する制約は、インターフェイス メソッド '{3}' の型パラメーター '{2}' に対する制約と一致しなければなりません。明示的なインターフェイスの実装を使用することをお勧めします。
ko: {1}' 메서드의 '{0}' 형식 매개 변수에 대한 제약 조건이 '{3}' 인터페이스 메서드의 '{2}' 형식 매개 변수에 대한 제약 조건과 일치해야 합니다. 명시적 인터페이스 구현을 대신 사용하세요.
pl: Ograniczenia parametrów typu „{0}” metody „{1}” muszą być zgodne z ograniczeniami parametrów typu „{2}” metody interfejsu „{3}”. Rozważ użycie jawnej implementacji interfejsu.
pt_br: As restrições para parâmetro de tipo "{0}" do método "{1}" deve coincidir com as restrições para o parâmetro de tipo "{2}" do método de interface "{3}". Ao invés disso, considere usar uma implementação de interface explícita.
ru: Ограничения для параметра типа "{0}" метода "{1}" должны соответствовать ограничениям параметра типа "{2}" метода интерфейса "{3}". Рассмотрите возможность явной реализации интерфейса.
tr: {1}' yönteminin '{0}' tür parametreleri için kısıtlamalar '{3}' arabirim yönteminin '{2}' tür parametresi için kısıtlamalarla eşleşmelidir. Yerine açık arabirim uygulaması kullanmayı düşünün.
zh_hans: 方法“{1}”的类型参数“{0}”的约束必须与接口方法“{3}”的类型参数“{2}”的约束相匹配。请考虑改用显式接口实现。
zh_hant: 方法 '{1}' 之類型參數 '{0}' 的條件約束，必須符合介面方法 '{3}' 之類型參數 '{2}' 的條件約束。請考慮改用明確的介面實作。

# ERR_ImplBadTupleNames
source: The tuple element names in the signature of method '{0}' must match the tuple element names of interface method '{1}' (including on the return type).
cs: Názvy prvků řazené kolekce členů v signatuře metody {0} se musí shodovat s názvy prvků řazené kolekce členů metody rozhraní {1} (a zároveň u návratového typu).
de: Die Tupelelementnamen in der Signatur der Methode "{0}" müssen mit den Tupelelementnamen der Schnittstellenmethode "{1}" (auch für den Rückgabetyp) übereinstimmen.
es: Los nombres de elementos de tupla en la firma del método '{0}' deben coincidir con los del método de interfaz '{1}' (que se incluye en el tipo de valor devuelto).
fr: Les noms d'éléments tuples de la signature de la méthode '{0}' doivent correspondre aux noms d'éléments tuples de la méthode d'interface '{1}' (notamment pour le type de retour).
it: I nomi di elementi di tupla nella firma del metodo '{0}' devono corrispondere a quelli del metodo di interfaccia '{1}' (incluso nel tipo restituito).
ja: メソッド '{0}' のシグネチャにあるタプル要素名は、インターフェイス メソッド '{1}' のタプル要素名と (戻り値の型を含めて) 一致している必要があります。
ko: {0}' 메서드의 서명에 있는 튜플 요소 이름은 인터페이스 메서드 '{1}'의 튜플 요소 이름(반환 형식에 포함)과 일치해야 합니다.
pl: Nazwy elementów krotki w podpisie metody „{0}” muszą być zgodne z nazwami elementów krotki metody interfejsu „{1}” (w tym w zwracanym typie).
pt_br: Os nomes de elemento de tupla na assinatura do método '{0}' devem corresponder aos nomes de elemento de tupla do método de interface '{1}' (incluindo o tipo de retorno).
ru: Имена элементов кортежа в сигнатуре метода "{0}" должны совпадать с именами элементов кортежа в методе интерфейса "{1}" (включая тип возвращаемого значения).
tr: {0}' metodunun imzasındaki demet öğesi adları '{1}' arabirim metodunun demet öğesi adlarıyla eşleşmelidir (dönüş türü de dahil).
zh_hans: 方法“{0}”的签名中的元组元素名称必须与接口方法“{1}”的元组元素名称匹配(包括返回类型)。
zh_hant: 方法 '{0}' 的特徵標記中元組元素必須與介面方法 '{1}' 的元組元素名稱相符 (包括在傳回類型)。

# ERR_DottedTypeNameNotFoundInAgg
source: The type name '{0}' does not exist in the type '{1}'
cs: Název typu {0} neexistuje v typu {1}.
de: Der Typname "{0}" ist im Typ "{1}" nicht vorhanden.
es: El nombre de tipo '{0}' no existe en el tipo '{1}'
fr: Le nom de type '{0}' n'existe pas dans le type '{1}'
it: Il nome di tipo '{0}' non esiste nel tipo '{1}'
ja: 型名 '{0}' が型 '{1}' に存在しません
ko: {0}' 형식 이름이 '{1}' 형식에 없습니다.
pl: Nazwa typu „{0}” nie istnieje w typie „{1}”
pt_br: O nome de tipo "{0}" não existe no tipo "{1}"
ru: Имя типа "{0}" не существует в типе "{1}".
tr: {0}' tür adı '{1}' türünde yok
zh_hans: 类型“{1}”中不存在类型名“{0}”
zh_hant: 類型名稱 '{0}' 不存在於類型 '{1}' 中

# ERR_MethGrpToNonDel
source: Cannot convert method group '{0}' to non-delegate type '{1}'. Did you intend to invoke the method?
cs: Nejde převést skupinu metod {0} na nedelegující typ {1}. Chtěli jste volat tuto metodu?
de: Die Methodengruppe "{0}" kann nicht in den Nichtdelegattyp "{1}" konvertiert werden. Wollten Sie die Methode aufrufen?
es: No se puede convertir el grupo de métodos '{0}' en el tipo no delegado '{1}'. ¿Intentó invocar el método?
fr: Impossible de convertir le groupe de méthodes '{0}' en type non-délégué '{1}'. Souhaitiez-vous appeler la méthode ?
it: Non è possibile convertire il gruppo di metodi '{0}' nel tipo non delegato '{1}'. Si intendeva richiamare il metodo?
ja: メソッド グループ '{0}' を非デリゲート型 '{1}' に変換することはできません。このメソッドを呼び出しますか?
ko: {0}' 메서드 그룹을 비대리자 형식 '{1}'(으)로 변환할 수 없습니다. 메서드를 호출하시겠습니까?
pl: Nie można przekonwertować grupy metod „{0}” na typ niedelegowany „{1}”. Czy zamierzasz wywołać metodę?
pt_br: Não é possível converter o grupo de métodos "{0}" no tipo "{1}" não delegado. Você pretendia invocar o método?
ru: Не удается преобразовать группу методов "{0}" в тип, не являющийся делегатом "{1}". Предполагалось вызывать этот метод?
tr: {0}' yöntem grubu, temsilci olmayan '{1}' türüne dönüştürülemez. Yöntemi çağırmak mı istiyordunuz?
zh_hans: 无法将方法组“{0}”转换为非委托类型“{1}”。是否希望调用此方法?
zh_hant: 無法將方法群組 '{0}' 轉換成非委派類型 '{1}'。原本希望叫用該方法嗎?

# ERR_BadExternAlias
source: The extern alias '{0}' was not specified in a /reference option
cs: Externí alias {0} nebyl zadaný jako možnost /reference.
de: Der externe Alias "{0}" wurde nicht in einer /reference-Option angegeben.
es: El alias externo '{0}' no se especificó en una opción /reference
fr: L'alias extern '{0}' n'a pas été spécifié dans une option /reference
it: L'alias extern '{0}' non è stato specificato in un'opzione /reference
ja: extern エイリアス '{0}' は、/reference オプションで指定されませんでした
ko: /reference 옵션에 extern 별칭('{0}')을 지정하지 않았습니다.
pl: Alias zewnętrzny „{0}” nie został określony w opcji /reference.
pt_br: O alias extern "{0}" não foi especificado em uma opção /reference
ru: В параметре /reference не указан внешний псевдоним "{0}".
tr: {0}' extern diğer adı, /reference seçeneğinde belirtilmemiş
zh_hans: 在 /reference 选项中未指定外部别名“{0}”
zh_hant: /reference 選項中未指定外部別名 '{0}'

# ERR_ColColWithTypeAlias
source: Cannot use alias '{0}' with '::' since the alias references a type. Use '.' instead.
cs: Zápis aliasu {0} se dvěma dvojtečkami (::) nejde použít, protože alias odkazuje na typ. Místo toho použijte zápis s tečkou (.).
de: Der Alias "{0}" kann nicht mit "::" verwendet werden, da der Alias auf einen Typ verweist. Verwenden Sie stattdessen ".".
es: No se puede usar el alias '{0}' con '::' porque el alias hace referencia a un tipo. Use '.'.
fr: Impossible d'utiliser l'alias '{0}' avec '::', car l'alias référence un type. Utilisez plutôt '.'.
it: Non è possibile usare l'alias '{0}' con '::' perché l'alias fa riferimento a un tipo. Usare '.'.
ja: エイリアスが型を参照しているため、エイリアス '{0}' を '::' と使用できません。'.' を使用してください。
ko: {0}' 별칭은 형식을 참조하므로 '::'과 함께 사용할 수 없습니다. 대신 '.'를 사용하세요.
pl: Nie można użyć aliasu „{0}” ze znakami „::”, ponieważ alias odwołuje się do typu. Użyj znaku „.”.
pt_br: Não é possível usar o alias "{0}" com "::" porque o alias faz referência a um tipo. Ao invés disso, use ".".
ru: Не удается использовать псевдоним "{0}" с "::" так как псевдоним ссылается на тип. Вместо этого используйте объект ".".
tr: Bir türe başvurduğundan '{0}' diğer adı '::' ile kullanılamaz. Yerine '.' kullanın.
zh_hans: 无法将别名“{0}”与“::”一起使用，因为该别名引用了类型。请改用“.”。
zh_hant: 別名 '{0}' 不能搭配 '::' 一起使用，因為別名會參考類型。請改用 '.'。

# ERR_AliasNotFound
source: Alias '{0}' not found
cs: Alias {0} se nenašel.
de: Alias "{0}" nicht gefunden.
es: Alias '{0}' no encontrado
fr: Alias '{0}' introuvable
it: L'alias '{0}' non è stato trovato
ja: エイリアス '{0}' が見つかりません
ko: {0}' 별칭을 찾을 수 없습니다.
pl: Nie znaleziono aliasu „{0}”
pt_br: Alias "{0}" não encontrado
ru: Не удалось найти псевдоним "{0}"
tr: {0}' diğer adı bulunamadı
zh_hans: 找不到别名“{0}”
zh_hant: 找不到別名 '{0}'

# ERR_SameFullNameAggAgg
source: The type '{1}' exists in both '{0}' and '{2}'
cs: Typ {1} existuje v {0} i {2}.
de: Der Typ "{1}" ist in "{0}" und "{2}" vorhanden.
es: El tipo '{1}' existe en '{0}' y en '{2}'
fr: Le type '{1}' existe dans '{0}' et '{2}'
it: Il tipo '{1}' esiste sia in '{0}' che in '{2}'
ja: 型 '{1}' が '{0}' と '{2}' の両方に存在します
ko: {1}' 형식이 '{0}' 및 '{2}'에 모두 있습니다.
pl: Typ „{1}” istnieje zarówno w elemencie „{0}”, jak i „{2}”
pt_br: O tipo "{1}" existe em "{0}" e "{2}"
ru: Тип "{1}" существует как в "{0}", так и в "{2}".
tr: {1}' türü hem '{0}' hem de '{2}' öğesinde bulunur
zh_hans: 类型“{1}”同时存在于“{0}”和“{2}”中
zh_hant: 類型 '{1}' 同時存在於 '{0}' 和 '{2}' 中

# ERR_SameFullNameNsAgg
source: The namespace '{1}' in '{0}' conflicts with the type '{3}' in '{2}'
cs: Obor názvů {1} v {0} je v konfliktu s typem {3} v {2}.
de: Der Namespace "{1}" in "{0}" steht in Konflikt mit dem Typ "{3}" in "{2}".
es: El espacio de nombres '{1}' de '{0}' está en conflicto con el tipo '{3}' de '{2}'
fr: L'espace de noms '{1}' dans '{0}' est en conflit avec le type '{3}' dans '{2}'
it: Lo spazio dei nomi '{1}' in '{0}' è in conflitto con il tipo '{3}' in '{2}'
ja: '{0}' の名前空間 '{1}' が '{2}' の型 '{3}' と競合しています
ko: {0}'의 '{1}' 네임스페이스가 '{2}'의 '{3}' 형식과 충돌합니다.
pl: Przestrzeń nazw „{1}” w elemencie „{0}” powoduje konflikt z typem „{3}” w elemencie „{2}”
pt_br: O namespace "{1}" em "{0}" está em conflito com o tipo "{3}" em "{2}"
ru: Пространство имен "{1}" в "{0}" конфликтует с типом "{3}" в "{2}".
tr: {0}' öğesindeki '{1}' ad alanı '{2}' öğesindeki '{3}' türü ile çakışıyor
zh_hans: “{0}”中的命名空间“{1}”与“{2}”中的类型“{3}”冲突
zh_hant: '{0}' 中的命名空間 '{1}' 與 '{2}' 中的類型 '{3}' 相衝突

# WRN_SameFullNameThisNsAgg
source: The namespace '{1}' in '{0}' conflicts with the imported type '{3}' in '{2}'. Using the namespace defined in '{0}'.
cs: Obor názvů {1} v {0} je v konfliktu s importovaným typem {3} v {2}. Použije se obor názvů definovaný v {0}.
de: Der Namespace "{1}" in "{0}" verursacht einen Konflikt mit dem importierten Typ "{3}" in "{2}". Der in "{0}" definierte Namespace wird verwendet.
es: El espacio de nombres '{1}' de '{0}' está en conflicto con el tipo importado '{3}' de '{2}'. Se usará el espacio de nombres definido en '{0}'.
fr: L'espace de noms '{1}' dans '{0}' est en conflit avec le type importé '{3}' dans '{2}'. Utilisation de l'espace de noms défini dans '{0}'.
it: Lo spazio dei nomi '{1}' in '{0}' è in conflitto con il tipo importato '{3}' in '{2}'. Verrà usato lo spazio dei nomi definito in '{0}'.
ja: '{0}' の名前空間 '{1}' は、'{2}' のインポートされた型 '{3}' と競合しています。'{0}' で定義された名前空間を使用しています。
ko: {0}'의 '{1}' 네임스페이스가 '{2}'에서 가져온 형식 '{3}'과(와) 충돌합니다. '{0}'에 정의된 네임스페이스를 사용합니다.
pl: Przestrzeń nazw „{1}” w elemencie „{0}” powoduje konflikt z zaimportowanym typem „{3}” w elemencie „{2}”. Zostanie użyta przestrzeń nazw zdefiniowana w elemencie „{0}”.
pt_br: O namespace "{1}" em "{0}" está em conflito com o tipo importado "{3}" em "{2}". Usar o namespace definido em "{0}".
ru: Пространство имен "{1}" в "{0}" конфликтует с импортированным типом "{3}" в "{2}". Используется пространство имен, определенное в "{0}".
tr: {0}' öğesindeki '{1}' ad alanı, '{2}' öğesindeki '{3}' içeri aktarılan türü ile çakışıyor. '{0}' öğesinde tanımlanan ad alanı kullanılıyor.
zh_hans: “{0}”中的命名空间“{1}”与“{2}”中的导入类型“{3}”冲突。请使用“{0}”中定义的命名空间。
zh_hant: '{0}' 中的命名空間 '{1}' 與 '{2}' 中匯入的類型 '{3}' 相衝突。請使用 '{0}' 中定義的命名空間。

# WRN_SameFullNameThisNsAgg_Title
source: Namespace conflicts with imported type
cs: Obor názvů je v konfliktu s importovaným typem.
de: Namespacekonflikte mit importiertem Typ
es: El espacio de nombres entra en conflicto con un tipo importado
fr: L'espace de noms est en conflit avec le type importé
it: Lo spazio dei nomi è in conflitto con il tipo importato
ja: 名前空間がインポートされた型と競合しています
ko: 네임스페이스가 가져온 형식과 충돌합니다.
pl: Przestrzeń nazw powoduje konflikt z zaimportowanym typem
pt_br: Conflitos de namespace com o tipo importado
ru: Пространство имен конфликтует с импортированным типом
tr: Ad alanı içe aktarılan türle çakışıyor
zh_hans: 命名空间与导入类型冲突
zh_hant: 命名空間與所匯入的類型衝突

# WRN_SameFullNameThisAggAgg
source: The type '{1}' in '{0}' conflicts with the imported type '{3}' in '{2}'. Using the type defined in '{0}'.
cs: Typ {1} v {0} je v konfliktu s importovaným typem {3} v {2}. Použije se typ definovaný v {0}.
de: Der Typ "{1}" in "{0}" verursacht einen Konflikt mit dem importierten Typ "{3}" in "{2}". Der in "{0}" definierte Typ wird verwendet.
es: El tipo '{1}' de '{0}' está en conflicto con el tipo importado '{3}' de '{2}'. Se usará el tipo definido en '{0}'.
fr: Le type '{1}' dans '{0}' est en conflit avec le type importé '{3}' dans '{2}'. Utilisation du type défini dans '{0}'.
it: Il tipo '{1}' in '{0}' è in conflitto con il tipo importato '{3}' in '{2}'. Verrà usato il tipo definito in '{0}'.
ja: '{0}' の型 '{1}' は、'{2}' のインポートされた型 '{3}' と競合しています。'{0}' で定義された型を使用しています。
ko: {0}'의 '{1}' 형식이 '{2}'에서 가져온 형식 '{3}'과(와) 충돌합니다. '{0}'에 정의된 형식을 사용합니다.
pl: Typ „{1}” w elemencie „{0}” powoduje konflikt z zaimportowanym typem „{3}” w elemencie „{2}”. Zostanie użyty typ zdefiniowany w elemencie „{0}”.
pt_br: O tipo "{1}" em "{0}" está em conflito com o tipo importado "{3}" em "{2}". Usar o tipo definido em "{0}".
ru: Тип "{1}" в "{0}" конфликтует с импортированным типом "{3}" в "{2}". Используется тип, определенный в "{0}".
tr: {0}' öğesindeki '{1}' türü, '{2}' öğesindeki '{3}' içeri aktarılan türü ile çakışıyor. '{0}' öğesinde tanımlanan tür kullanılıyor.
zh_hans: “{0}”中的类型“{1}”与“{2}”中的导入类型“{3}”冲突。请使用“{0}”中定义的类型。
zh_hant: '{0}' 中的類型 '{1}' 與 '{2}' 中匯入的類型 '{3}' 相衝突。請使用 '{0}' 中定義的類型。

# WRN_SameFullNameThisAggAgg_Title
source: Type conflicts with imported type
cs: Typ je v konfliktu s importovaným typem.
de: Typenkonflikte mit importiertem Typ
es: El tipo entra en conflicto con un tipo importado
fr: Le type est en conflit avec le type importé
it: Il tipo è in conflitto con il tipo importato
ja: 型がインポートされた型と競合しています
ko: 형식이 가져온 형식과 충돌합니다.
pl: Typ powoduje konflikt z zaimportowanym typem
pt_br: Conflitos de tipo com o tipo importado
ru: Тип конфликтует с импортированным типом
tr: Tür içe aktarılan türle çakışıyor
zh_hans: 类型与导入类型冲突
zh_hant: 類型與所匯入的類型衝突

# WRN_SameFullNameThisAggNs
source: The type '{1}' in '{0}' conflicts with the imported namespace '{3}' in '{2}'. Using the type defined in '{0}'.
cs: Typ {1} v {0} je v konfliktu s importovaným oborem názvů {3} v {2}. Použije se typ definovaný v {0}.
de: Der Typ "{1}" in "{0}" verursacht einen Konflikt mit dem importierten Namespace "{3}" in "{2}". Der in "{0}" definierte Typ wird verwendet.
es: El tipo '{1}' de '{0}' está en conflicto con el espacio de nombres importado '{3}' de '{2}'. Se usará el tipo definido en '{0}'.
fr: Le type '{1}' dans '{0}' est en conflit avec l'espace de noms importé '{3}' dans '{2}'. Utilisation du type défini dans '{0}'.
it: Il tipo '{1}' in '{0}' è in conflitto con lo spazio dei nomi importato '{3}' in '{2}'. Verrà usato il tipo definito in '{0}'.
ja: '{0}' の型 '{1}' は、'{2}' のインポートされた名前空間 '{3}' と競合しています。'{0}' で定義された型を使用しています。
ko: {0}'의 '{1}' 형식이 '{2}'에서 가져온 네임스페이스 '{3}'과(와) 충돌합니다. '{0}'에 정의된 형식을 사용합니다.
pl: Typ „{1}” w elemencie „{0}” powoduje konflikt z zaimportowaną przestrzenią nazw „{3}” w elemencie „{2}”. Zostanie użyty typ zdefiniowany w elemencie „{0}”.
pt_br: O tipo "{1}" em "{0}" está em conflito com o namespace importado "{3}" em "{2}". Usar o tipo definido em "{0}".
ru: Тип "{1}" в "{0}" конфликтует с импортированным пространством имен "{3}" в "{2}". Используется тип, определенный в "{0}".
tr: {0}' öğesindeki '{1}' türü, '{2}' öğesindeki '{3}' içeri aktarılan ad alanı ile çakışıyor. '{0}' öğesinde tanımlanan tür kullanılıyor.
zh_hans: “{0}”中的类型“{1}”与“{2}”中的导入命令空间“{3}”冲突。请使用“{0}”中定义的类型。
zh_hant: '{0}' 中的類型 '{1}' 與 '{2}' 中匯入的命名空間 '{3}' 相衝突。請使用 '{0}' 中定義的類型。
