Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_Covariant
source: covariant
cs: kovariant
es: covariante
it: covariante
ja: 共変
ko: 공변(covariant)
pl: kowariantny
ru: ковариантный
tr: kovaryant
zh_hans: 协变

# IDS_Covariantly
source: covariantly
cs: kovariantně
de: covariant
es: de forma covariante
fr: par covariance
it: in covarianza
ja: 共変
ko: 공변(covariant) 방식
pl: kowariantnie
ru: ковариантно
tr: kovaryant olarak
zh_hans: 协变式
zh_hant: 以 Covariant 方式

# ERR_BadVisIndexerParam
source: Inconsistent accessibility: parameter type '{1}' is less accessible than indexer '{0}'
cs: Nekonzistentní dostupnost: Typ parametru {1} je míň dostupný než indexer {0}.
de: Inkonsistenter Zugriff: Parametertyp "{1}" ist weniger zugreifbar als Indexer "{0}".
es: Incoherencia de accesibilidad: el tipo de parámetro '{1}' es menos accesible que el indizador '{0}'
ja: アクセシビリティに一貫性がありません。パラメーター型 '{1}' のアクセシビリティはインデクサー '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 매개 변수 형식이 '{0}' 인덱서보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ parametru „{1}” jest mniej dostępny niż indeksator „{0}”
tr: Tutarsız erişilebilirlik: '{1}' parametre türü, '{0}' dizin oluşturucusundan daha az erişilebilir
zh_hant: 不一致的存取範圍: 參數類型 '{1}' 比索引子 '{0}' 的存取範圍小

# ERR_IntegralTypeValueExpected
source: A value of an integral type expected
cs: Očekává se hodnota integrálního typu.
de: Ganzzahlwert erwartet.
es: Se espera un valor de tipo entero
ja: 整数型の値が必要です
ko: 정수 계열 형식 값이 필요합니다.
pl: Oczekiwano wartości typu całkowitoliczbowego
tr: Tam sayı türünde bir değer bekleniyor
zh_hant: 必須是整數類型的值

# ERR_PartialMisplaced
source: The 'partial' modifier can only appear immediately before 'class', 'record', 'struct', 'interface', or a method or property return type.
pl: Modyfikator „partial” może pojawić się tylko bezpośrednio przed słowem kluczowym „class”, „record” „struct”, „interface” lub zwracanym typem metody lub właściwości.
zh_hant: 'partial' 修飾元只能直接出現在 'class'、'record'、'struct'、'interface' 或方法或屬性傳回型別之前。

# ERR_PredefinedValueTupleTypeAmbiguous3
source: Predefined type '{0}' is declared in multiple referenced assemblies: '{1}' and '{2}'
cs: Předdefinovaný typ {0} je deklarovaný v několika odkazovaných sestaveních: {1} a {2}.
de: Der vordefinierte Typ "{0}" wurde in mehreren referenzierten Assemblys deklariert: "{1}" und "{2}"
es: El tipo "{0}" predefinido se declara en varios ensamblados a los que se hace referencia: "{1}" y "{2}"
ja: 定義済みの型 '{0}' が複数の参照先アセンブリで宣言されています: '{1}' と '{2}'
ko: 미리 정의된 형식 '{0}'이(가) 여러 참조된 어셈블리('{1}' 및 '{2}')에서 선언되었습니다.
pl: Wstępnie zdefiniowany typ „{0}” jest zadeklarowany w wielu przywoływanych zestawach: „{1}” i „{2}”
tr: Önceden tanımlı '{0}' türü birden çok başvurulan bütünleştirilmiş kodda bildirildi: '{1}' ve '{2}'
zh_hant: 在多個參考組件中宣告了預先定義的類型 '{0}': '{1}' 與 '{2}'

# ERR_OperatorsMustBeStatic
source: User-defined operator '{0}' must be declared static and public
cs: Uživatelem definovaný operátor {0} musí být deklarovaný jako static a public.
de: Der benutzerdefinierte {0}-Operator muss als statisch und öffentlich deklariert sein.
es: El operador '{0}' definido por el usuario debe declararse estático y público
ja: ユーザー定義の演算子 '{0}' は static および public として宣言されなければなりません
ko: {0}' 사용자 정의 연산자는 static 및 public으로 선언해야 합니다.
pl: Operator zdefiniowany przez użytkownika „{0}” musi być zadeklarowany ze specyfikatorami static i public
tr: Kullanıcı tanımlı işleç '{0}' statik ve ortak olarak ifade edilmelidir
zh_hant: 使用者定義的運算子 '{0}' 必須宣告為 static 和 public

# ERR_DllImportOnInvalidMethod
source: The DllImport attribute must be specified on a method marked 'static' and 'extern'
cs: Pro metodu s deklarací static a extern musí být zadaný atribut DllImport.
de: Das DllImport-Attribut muss für eine Methode angegeben werden, die als "static" und "extern" markiert ist.
es: El atributo DllImport se debe especificar en un método marcado como 'static' y 'extern'
ja: static または extern に指定されているメソッドでは、DllImport 属性を指定する必要があります
ko: DllImport 특성은 'static' 및 'extern'으로 표시된 메서드에만 지정할 수 있습니다.
pl: Dla metody oznaczonej przy użyciu słów kluczowych „static” i „extern” musi zostać określony atrybut DllImport
tr: DllImport özniteliği 'static' ve 'extern' olarak işaretlenmiş bir yöntem üzerinde belirtilmelidir
zh_hant: DllImport 屬性必須指定在標記為 'static' 和 'extern' 的方法上

# ERR_EncUpdateFailedMissingAttribute
source: Cannot update '{0}'; attribute '{1}' is missing.
cs: Nelze aktualizovat {0}; chybí atribut {1}.
de: "{0}" kann nicht aktualisiert werden. Das Attribut "{1}" fehlt.
es: No se puede actualizar '{0}'; falta el atributo '{1}'.
ja: '{0}' を更新できません。属性 '{1}' がありません。
ko: {0}'을(를) 업데이트할 수 없습니다. 특성 '{1}'이(가) 없습니다.
pl: Nie można zaktualizować elementu „{0}”. Brak atrybutu „{1}”.
tr: {0}' güncelleştirilemiyor; '{1}' özniteliği eksik.
zh_hant: 無法更新 '{0}'; 缺少屬性 '{1}'。

# ERR_ErrorDirective
source: #error: '{0}'
ko: #오류: '{0}'
pl: #błąd: „{0}”
zh_hans: #错误:“{0}”

# ERR_BadTypeforThis
source: The first parameter of an extension method cannot be of type '{0}'
cs: První parametr metody rozšíření nesmí být typu {0}.
de: Der erste Parameter einer Erweiterungsmethode darf nicht den Typ "{0}" haben.
es: El primer parámetro de un método de extensión no puede ser del tipo '{0}'
ja: 拡張メソッドの最初のパラメーターを型 '{0}' にすることはできません
ko: 확장 메서드의 첫 번째 매개 변수는 '{0}' 형식이 될 수 없습니다.
pl: Pierwszy parametr metody rozszerzenia nie może być parametrem typu „{0}”
tr: Genişletme yönteminin ilk parametresi '{0}' türünde olamaz
zh_hant: 擴充方法的第一個參數不可為類型 '{0}'

# ERR_ExtensionAttrNotFound
source: Cannot define a new extension method because the compiler required type '{0}' cannot be found. Are you missing a reference to System.Core.dll?
cs: Nejde definovat novou metodu rozšíření, protože se nenašel vyžadovaný typ kompilátoru {0}. Nechybí odkaz na System.Core.dll?
de: Es kann keine neue Erweiterungsmethode definiert werden, weil der für den Compiler erforderliche Typ "{0}" nicht gefunden werden kann. Fehlt möglicherweise ein Verweis auf "System.Core.dll"?
es: No se puede definir un nuevo método de extensión porque no se encontró el tipo '{0}' requerido por el compilador. ¿Falta alguna referencia a System.Core.dll?
ja: コンパイラで必要とされる型 '{0}' が見つからないため、新しい拡張メソッドを定義できません。System.Core.dll への参照が指定されていることを確認してください。
ko: 컴파일러에 필요한 '{0}' 형식을 찾을 수 없으므로 새 확장 메서드를 정의할 수 없습니다. System.Core.dll의 참조가 있는지 확인하세요.
pl: Nie można zdefiniować nowej metody rozszerzenia, ponieważ nie można odnaleźć wymaganego przez kompilator typu „{0}”. Czy brakuje odwołania do System.Core.dll?
tr: Derleyicinin gerektirdiği '{0}' türü bulunamadığından yeni bir genişletme yöntemi tanımlanamıyor. Bir System.Core.dll başvurusu eksik olabilir mi?
zh_hant: 無法定義新的擴充方法，因為找不到編譯器的必要類型 '{0}'。是否遺漏了 System.Core.dll 的參考?

# ERR_InvalidMemberDecl
source: Invalid token '{0}' in class, record, struct, or interface member declaration
cs: Neplatný token {0} v deklaraci člena rozhraní, třídy, záznamu nebo struktury
ja: クラス、レコード、構造体、またはインターフェイス メンバーの宣言でトークン '{0}' が無効です
pl: Nieprawidłowy token „{0}” w deklaracji składowej klasy, rekordu, struktury lub interfejsu
zh_hant: 類別、記錄、結構或介面成員宣告中的語彙基元 '{0}' 無效

# ERR_MainClassIsImport
source: Cannot use '{0}' for Main method because it is imported
cs: {0} nejde použít pro metodu Main, protože je importovaný.
de: "{0}" wurde importiert und kann deshalb nicht für die Main-Methode verwendet werden.
es: No se puede usar '{0}' para el método Main porque se ha importado
ja: '{0}' はインポートされているため、Main メソッドに対して使うことはできません
ko: 가져온 것이므로 Main 메서드에 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można użyć elementu „{0}” dla metody Main, ponieważ jest on zaimportowany
tr: İçeri aktarıldığından Main yöntemi için '{0}' kullanılamıyor
zh_hant: 無法為 Main 方法使用 '{0}'，因為其為匯入物件

# WRN_BadWarningNumber
source: '{0}' is not a valid warning number
cs: {0} není platné číslo upozornění.
de: '"{0}" ist keine gültige Warnungsnummer.
es: '{0}' no es un número de advertencia válido
ja: '{0}' は有効な警告番号ではありません
ko: '{0}'은(는) 유효한 경고 번호가 아닙니다.
pl: „{0}” to nie jest prawidłowy numer ostrzeżenia
tr: '{0}' geçerli bir uyarı numarası değil
zh_hant: '{0}' 不是有效的警告編號

# WRN_BadWarningNumber_Title
source: Not a valid warning number
cs: Není platné číslo varování.
de: Keine gültige Warnungszahl.
es: Número de advertencia no válido
ja: 無効な警告番号です
ko: 올바른 경고 번호가 아닙니다.
pl: Nieprawidłowy numer ostrzeżenia
tr: Geçerli bir uyarı numarası değil
zh_hant: 不是有效的警告號碼

# WRN_BadWarningNumber_Description
source: A number that was passed to the #pragma warning preprocessor directive was not a valid warning number. Verify that the number represents a warning, not an error.
cs: Číslo, které bylo předané do direktivy preprocesoru varování #pragma, nepředstavovalo platné číslo varování. Ověřte, že číslo představuje varování, ne chybu.
de: Eine Zahl, die an die Präprozessordirektive der #pragma-Warnung übergeben wurde, war keine gültige Warnungszahl. Vergewissern Sie sich, dass die Zahl eine Warnung und keinen Fehler darstellt.
es: Un número que se aprobó en la directiva de preprocesador de advertencia #pragma no es un número de advertencia válido. Verifique que ese número representa una advertencia y no un error.
ja: #pragma 警告のプリプロセッサ ディレクティブに渡された番号は無効な警告番号です。番号がエラー番号ではなく警告番号を表していることを確認してください。
ko: #pragma 경고 전처리기 지시문에 전달된 번호는 올바른 경고 번호가 아닙니다. 번호가 오류가 아닌 경고를 나타내는지 확인하세요.
pl: Numer przekazany do dyrektywy preprocesora ostrzeżenia #pragma nie jest prawidłowym numerem ostrzeżenia. Upewnij się, że numer reprezentuje ostrzeżenie, a nie błąd.
tr: #pragma uyarı önişlemcisi yönergesine geçirilen bir sayı geçerli bir uyarı sayısı değildi. Sayının bir hatayı değil, bir uyarıyı temsil ettiğini doğrulayın.
zh_hant: 傳遞給 #pragma 警告前置處理器指示詞的號碼不是有效的警告號碼。請驗證號碼代表警告，而不是錯誤。

# WRN_FileNameTooLong
source: Invalid filename specified for preprocessor directive. Filename is too long or not a valid filename.
cs: V direktivě preprocesoru je uvedený neplatný název souboru. Název souboru je moc dlouhý nebo se nejedná o platný název souboru.
de: Ungültiger Dateiname für Präprozessordirektive angegeben. Der Dateiname ist zu lang oder kein gültiger Dateiname.
es: Nombre de archivo no válido especificado para la directiva del preprocesador. Nombre de archivo demasiado largo o no válido.
ja: プリプロセッサ ディレクティブに対して無効なファイル名が指定されました。ファイル名は長すぎるか、または有効なファイル名ではありません。
ko: 전처리기 지시문에 잘못된 파일 이름이 지정되었습니다. 파일 이름이 너무 길거나 유효한 파일 이름이 아닙니다.
pl: Określono nieprawidłową nazwę pliku dla dyrektywy preprocesora. Nazwa pliku jest za długa lub nieprawidłowa.
tr: Önişlemci yönergesi için geçersiz dosya adı belirtildi. Dosya adı çok uzun veya geçerli bir dosya adı değil.
zh_hant: 對前置處理器指示詞指定了無效的檔名。檔名太長或者不是有效的檔名。

# WRN_FileNameTooLong_Title
source: Invalid filename specified for preprocessor directive
cs: Byl zadaný neplatný název souboru pro direktivu preprocesoru.
de: Ungültiger Dateiname für Präprozessordirektive angegeben.
es: Se ha especificado un nombre de archivo no válido para la directiva de preprocesador
ja: プリプロセッサ ディレクティブに対して無効なファイル名が指定されました
ko: 전처리기 지시문에 지정한 파일 이름이 잘못되었습니다.
pl: Określono nieprawidłową nazwę pliku dla dyrektywy preprocesora
tr: Önişlemci yönergesi için belirtilen geçersiz dosya adı
zh_hant: 針對前置處理器指示詞所指定的檔名無效

# ERR_CantSetWin32Manifest
source: Error reading Win32 manifest file '{0}' -- '{1}'
cs: Chyba při čtení souboru manifestu Win32 {0} -- {1}
de: Fehler beim Lesen der Win32-Manifestdatei "{0}": {1}
es: Error al leer el archivo de manifiesto '{0}' de Win32: '{1}'
ja: Win32 マニフェスト ファイル '{0}' を読み取り中にエラーが発生しました -- '{1}'
ko: {0}' Win32 매니페스트 파일을 읽는 동안 오류가 발생했습니다. '{1}'
pl: Błąd podczas odczytywania pliku manifestu Win32 „{0}” — „{1}”
tr: {0}' Win32 bildirim dosyası okunurken hata -- '{1}'
zh_hant: 讀取 Win32 資訊清單檔 '{0}' 時發生錯誤 -- '{1}'

# ERR_MemGroupInExpressionTree
source: An expression tree lambda may not contain a method group
cs: Strom výrazu lambda nesmí obsahovat skupinu metod.
de: Ein Ausdrucksbaumstruktur-Lambda darf keine Methodengruppe enthalten.
es: Una expresión lambda de árbol de expresión no puede contener un grupo de métodos
ja: 式ツリーのラムダには、メソッド グループを含めることはできません
ko: 람다 식 트리에는 메서드 그룹을 사용할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać grupy metod
tr: Bir ifade ağacı lambdası bir yöntem grubu içeremez
zh_hant: 運算式樹狀架構 Lambda 不可包含方法群組

# ERR_CantOpenFileWrite
source: Cannot open '{0}' for writing -- '{1}'
cs: {0} se nedá otevřít pro zápis -- {1}.
de: "{0}" kann nicht zum Schreiben geöffnet werden: "{1}"
es: No se puede abrir '{0}' para escribir: '{1}'
ja: ファイル '{0}' を開いて書き込むことができません -- '{1}'
ko: {0}'을(를) 쓰기용으로 열 수 없습니다. '{1}'
pl: Nie można otworzyć „{0}” do zapisu — „{1}”
tr: {0}' yazma için açılamıyor -- '{1}'
zh_hant: 無法開啟 '{0}' 進行寫入 -- '{1}'

# WRN_AsyncLacksAwaits
source: This async method lacks 'await' operators and will run synchronously. Consider using the 'await' operator to await non-blocking API calls, or 'await Task.Run(...)' to do CPU-bound work on a background thread.
cs: V této asynchronní metodě chybí operátory await a spustí se synchronně. Zvažte použití operátoru await pro čekání na neblokující volání rozhraní API nebo vykonání činnosti vázané na procesor ve vlákně na pozadí pomocí výrazu await Task.Run(...).
de: In dieser Async-Methode fehlen die "await"-Operatoren, weshalb sie synchron ausgeführt wird. Sie sollten die Verwendung des "await"-Operators oder von "await Task.Run(...)" in Betracht ziehen, um auf nicht blockierende API-Aufrufe zu warten bzw. CPU-gebundene Aufgaben auf einem Hintergrundthread auszuführen.
es: El método asincrónico carece de operadores "await" y se ejecutará de forma sincrónica. Puede usar el operador 'await' para esperar llamadas API que no sean de bloqueo o 'await Task.Run(...)' para hacer tareas enlazadas a la CPU en un subproceso en segundo plano.
ja: この非同期メソッドには 'await' 演算子がないため、同期的に実行されます。'await' 演算子を使用して非ブロッキング API 呼び出しを待機するか、'await Task.Run(...)' を使用してバックグラウンドのスレッドに対して CPU 主体の処理を実行することを検討してください。
ko: 이 비동기 메서드에는 'await' 연산자가 없으며 메서드가 동시에 실행됩니다. 'await' 연산자를 사용하여 비블로킹 API 호출을 대기하거나, 'await Task.Run(...)'을 사용하여 백그라운드 스레드에서 CPU 바인딩된 작업을 수행하세요.
pl: W tej metodzie asynchronicznej brakuje operatorów „await”, dlatego będzie wykonywana synchronicznie. Rozważ możliwość użycia operatora „await” w celu zdefiniowania oczekiwania na nieblokujące wywołania interfejsów API albo wyrażenia „await Task.Run(...)” w celu przeniesienia wykonywania zadań intensywnie angażujących procesor do wątku w tle.
tr: Bu zaman uyumsuz yöntemde 'await' işleçleri yok ve zaman uyumlu çalışacak. 'await' işlecini kullanarak engelleyici olmayan API çağrılarını beklemeyi veya 'await Task.Run(...)' kullanarak bir arka plan iş parçacığında CPU bağlantılı iş yapmayı düşünün.
zh_hant: 這個非同步方法缺少 'await' 運算子，因此將以同步方式執行。請考慮使用 'await' 運算子等候未封鎖的應用程式開發介面呼叫，或使用 'await Task.Run(...)' 在背景執行緒上執行 CPU-bound 工作。

# WRN_AsyncLacksAwaits_Title
source: Async method lacks 'await' operators and will run synchronously
cs: V této asynchronní metodě chybí operátory await a spustí se synchronně.
de: Bei der asynchronen Methode fehlen "await"-Operatoren. Die Methode wird synchron ausgeführt.
es: El método asincrónico carece de operadores "await" y se ejecutará de forma sincrónica
ja: 非同期メソッドは、'await' 演算子がないため、同期的に実行されます
ko: 이 비동기 메서드에는 'await' 연산자가 없으며 메서드가 동시에 실행됩니다.
pl: Metoda asynchroniczna nie zawiera operatorów „await” i zostanie uruchomiona synchronicznie
tr: Zaman uyumsuz yöntemde 'await' işleçleri yok ve zaman uyumlu çalışacak
zh_hant: Async 方法缺乏 'await' 運算子，將同步執行

# ERR_NotYetImplementedInRoslyn
source: This language feature ('{0}') is not yet implemented.
cs: Tato jazyková funkce ({0}) zatím není implementovaná.
de: Diese Sprachfunktion ("{0}") ist noch nicht implementiert.
es: Esta funcionalidad de idioma ('{0}') todavía no está implementada.
ja: この言語機能 ('{0}') はまだ実装されていません。
ko: 이 언어 기능('{0}')은 아직 구현되지 않았습니다.
pl: Ta funkcja językowa („{0}”) nie jest jeszcze zaimplementowana.
tr: Bu dil özelliği ('{0}') henüz uygulanmadı.
zh_hant: 尚未實作語言功能 ('{0}')。

# ERR_InvalidDynamicCondition
source: Expression must be implicitly convertible to Boolean or its type '{0}' must define operator '{1}'.
cs: Výraz musí být implicitně převeditelný na logickou hodnotu nebo její typ {0} musí definovat operátor {1}.
de: Der Ausdruck muss implizit in einen booleschen Ausdruck konvertiert werden können, oder der Typ "{0}" muss den Operator "{1}" definieren.
es: La expresión se debe poder convertir implícitamente en 'Boolean' o su tipo '{0}' debe definir el operador '{1}'.
ja: 式はブール型に暗黙的に変換できるか、式の型 '{0}' で演算子 '{1}' を定義する必要があります。
ko: 식은 부울로 암시적으로 변환할 수 있어야 하거나 '{0}' 형식은 '{1}' 연산자를 정의해야 합니다.
pl: Wyrażenie musi umożliwiać niejawną konwersję na typ Boolean lub jego typ „{0}” musi definiować operator „{1}”.
ru: Выражение должно быть неявно преобразуемым в логическое значение, или его тип "{0}" должен определять оператор "{1}".
tr: İfade açıkça Boolean öğesine dönüştürülebilir olmalı ya da '{0}' türü '{1}' işlecini tanımlamalıdır.
zh_hant: 運算式必須可隱含轉換成布林值，或是其類型 '{0}' 必須定義運算子 '{1}'。

# WRN_CA2000_DisposeObjectsBeforeLosingScope1
source: Call System.IDisposable.Dispose() on allocated instance of {0} before all references to it are out of scope.
cs: Vyvolejte System.IDisposable.Dispose() na přidělenou instanci {0} dřív, než budou všechny odkazy na ni mimo obor.
de: Rufen Sie System.IDisposable.Dispose() für die zugeordnete Instanz von "{0}" auf, bevor alle Verweise darauf außerhalb des gültigen Bereichs liegen.
es: Llame a System.IDisposable.Dispose() en la instancia asignada de {0} antes de que todas las referencias a él estén fuera de ámbito.
ja: {0} の割り当てられたインスタンスへの参照がすべてスコープ外になる前に、そのインスタンスの System.IDisposable.Dispose() を呼び出してください。
ko: 모든 참조가 범위를 벗어나기 전에 할당된 {0} 인스턴스에서 System.IDisposable.Dispose()를 호출하세요.
pl: Wywołaj metodę Call System.IDisposable.Dispose() dla alokowanego wystąpienia elementu {0}, zanim wszystkie odwołania do niego znajdą się poza zakresem.
tr: Tüm başvuruları kapsam dışı olmadan {0} öğesinin ayrılmış örneğinde System.IDisposable.Dispose() öğesini çağırın.
zh_hant: 於配置的 {0} 執行個體的所有參考都超出範圍之前，在該執行個體上呼叫 System.IDisposable.Dispose()。

# WRN_CA2000_DisposeObjectsBeforeLosingScope1_Title
source: Call System.IDisposable.Dispose() on allocated instance before all references to it are out of scope
cs: Vyvolejte System.IDisposable.Dispose() u přidělené instance, než budou všechny odkazy na ni mimo rozsah.
de: Der Aufruf System.IDisposable.Dispose() zu der zugeordneten Instanz vor allen Verweisen dazu befinden sich außerdem des zulässigen Bereichs
es: Llame a System.IDisposable.Dispose() en una instancia asignada antes de que todas sus referencias estén fuera de ámbito
ja: 割り当てられたインスタンスへの参照がすべてスコープ外になる前に、そのインスタンスの System.IDisposable.Dispose() を呼び出します
ko: 할당된 인스턴스에 대한 모든 참조가 범위를 벗어나기 전에 System.IDisposable.Dispose()를 호출하세요.
pl: Wywołaj metodę System.IDisposable.Dispose() dla alokowanego wystąpienia zanim wszystkie odwołania do niego znajdą się poza zakresem
tr: Tüm başvuruları kapsam dışı olmadan önce ayrılmış örnekte System.IDisposable.Dispose() öğesini çağırın
zh_hant: 在所配置執行個體的所有參考超出範圍之前，對其呼叫 System.IDisposable.Dispose()

# WRN_CA2000_DisposeObjectsBeforeLosingScope2
source: Allocated instance of {0} is not disposed along all exception paths. Call System.IDisposable.Dispose() before all references to it are out of scope.
cs: Přidělená instance {0} se neuvolní v průběhu všech cest výjimky. Vyvolejte System.IDisposable.Dispose() dřív, než budou všechny odkazy na ni mimo obor.
de: Die zugeordnete Instanz von "{0}" wird nicht entlang allen Ausnahmepfaden verworfen. Rufen Sie System.IDisposable.Dispose() auf, bevor alle Verweise darauf außerhalb des gültigen Bereichs liegen.
es: La instancia asignada de {0} no se desecha en todas las rutas de acceso de excepciones. Llame a System.IDisposable.Dispose() antes de que todas las referencias a él estén fuera de ámbito.
ja: {0} の割り当てられたインスタンスが破棄されない例外パスがあります。System.IDisposable.Dispose() への参照がスコープ外になる前にこれを呼び出してください。
ko: 할당된 {0} 인스턴스는 일부 예외 경로와 함께 삭제되지 않습니다. 모든 참조가 범위를 벗어나기 전에 System.IDisposable.Dispose()를 호출하세요.
pl: Alokowane wystąpienie elementu {0} nie jest usuwane we wszystkich ścieżkach wyjątku. Wywołaj metodę System.IDisposable.Dispose(), zanim wszystkie odwołania do niego znajdą się poza zakresem.
tr: {0} öğesinin ayrılmış örneği tüm istisna yolları boyunca atılmaz. Tüm başvuruları kapsam dışı olmadan önce System.IDisposable.Dispose() öğesini çağırın.
zh_hant: 配置的 {0} 執行個體並非沿著所有例外狀況路徑處置。請在其所有參考都超出範圍之前，呼叫 System.IDisposable.Dispose()。

# WRN_CA2000_DisposeObjectsBeforeLosingScope2_Title
source: Allocated instance is not disposed along all exception paths
cs: Přidělená instance není uvolněná v průběhu všech cest výjimek.
de: Zugeordnete Instanz wird nicht zusammen mit allen Ausnahmepfaden zugeordnet
es: La instancia asignada no está eliminada en todas las rutas de acceso de excepción
ja: 割り当てられたインスタンスがすべての例外パスで破棄されていません
ko: 할당된 인스턴스는 일부 예외 경로와 함께 삭제되지 않습니다.
pl: Nie usunięto alokowanego wystąpienia ze wszystkich ścieżek wyjątków
tr: Ayrılan örnek tüm özel durum yolları boyunca atılamaz
zh_hant: 所配置的執行個體未沿著所有例外路徑處置

# WRN_CA2202_DoNotDisposeObjectsMultipleTimes
source: Object '{0}' can be disposed more than once.
cs: Objekt {0} se dá uvolnit víc než jednou.
de: Das Objekt "{0}" kann mehrere Male verworfen werden.
es: El objeto '{0}' se puede desechar más de una vez.
ja: オブジェクト '{0}' は複数回破棄することができます。
ko: {0}' 개체는 여러 번 삭제할 수 있습니다.
pl: Obiektu „{0}” nie można usunąć więcej niż raz.
tr: {0}' nesnesi birden çok kez atılabilir.
zh_hant: 可以多次處置物件 '{0}'。

# WRN_CA2202_DoNotDisposeObjectsMultipleTimes_Title
source: Object can be disposed more than once
cs: Objekt se dá uvolnit víc než jednou.
de: Objekt kann mehrmals zugeordnet werden
es: Se puede eliminar el objeto más de una vez
ja: オブジェクトは複数回破棄することができます
ko: 개체를 여러 번 삭제할 수 있습니다.
pl: Nie można usunąć obiektu więcej niż raz
tr: Nesne birden çok kez atılabilir
zh_hant: 可以多次處置物件

# IDS_Namespace1
source: <namespace>
cs: <obor názvů>
es: <espacio de nombres>
fr: <espace de noms>
it: <spazio dei nomi>
ko: <네임스페이스>
pl: <przestrzeń nazw>
ru: <пространство имен>
zh_hans: <命名空间>
zh_hant: <命名空間>

# IDS_VersionExperimental
source: 'experimental'
cs: '"experimentální"
de: '"experimentell"
fr: 'expérimental'
ja: '実験的'
ko: '실험적'
pl: „eksperymentalna”
ru: '"экспериментальный"
zh_hans: '“实验”
zh_hant: '「實驗」

# ERR_InitializerInStructWithoutExplicitConstructor
source: Structs without explicit constructors cannot contain members with initializers.
cs: Struktury bez explicitních konstruktorů nemůžou obsahovat členy s inicializátory.
de: Strukturen ohne explizite Konstruktoren können keine Member mit Initialisierern enthalten.
es: Las estructuras sin constructores explícitos no pueden contener miembros con inicializadores.
ja: 明示的なコンストラクターがない構造体には、初期化子を持つメンバーを含めることはできません。
ko: 명시적 생성자가 없는 구조체는 이니셜라이저를 사용하여 멤버를 포함할 수 없습니다.
pl: Struktury bez jawnych konstruktorów nie mogą zawierać składowych z inicjatorami.
tr: Açık oluşturucuları olmayan yapı birimleri başlatıcıları olan üyeler içeremez.
zh_hant: 沒有明確建構函式的結構，不可包含有初始設定式的成員。

# ERR_UnexpectedBoundGenericName
source: Type arguments are not allowed in the nameof operator.
cs: Argumenty typů nejsou v operátoru nameof povoleny.
de: Typargumente sind im nameof-Operator unzulässig.
es: Los argumentos de tipo no están permitidos en el nombre del operador.
ja: nameof 演算子では型の引数を使用できません。
ko: nameof 연산자에서는 형식 인수가 허용되지 않습니다.
pl: Argumenty typu nie są dozwolone w operatorze nameof.
tr: nameof işlecinde tür bağımsız değişkenlerine izin verilmez.
zh_hant: Nameof 運算子中不可使用類型引數。
