Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ExternCtorNoImplementation
source: Constructor '{0}' is marked external
cs: Konstruktor {0} je označený jako externí.
de: Der Konstruktor "{0}" ist als extern markiert.
es: El constructor '{0}' está marcado como externo
fr: Le constructeur '{0}' est marqué comme external
it: Il costruttore '{0}' è contrassegnato come esterno
ja: コンストラクター '{0}' は external に設定されています
ko: {0}' 생성자가 external로 표시되었습니다.
pl: Konstruktor „{0}” jest oznaczony jako zewnętrzny
pt_br: Construtor "{0}" está marcado como externo
ru: Конструктор "{0}" помечен как внешний
tr: {0}' oluşturucusu dış olarak işaretlendi
zh_hans: 构造函数“{0}”标记为外部对象
zh_hant: 建構函式 '{0}' 標記為外部

# WRN_ExternCtorNoImplementation_Title
source: Constructor is marked external
cs: Konstruktor je označený jako externí.
de: Konstruktor ist extern markiert
es: El constructor está marcado como externo
fr: Le constructeur est marqué comme external
it: Il costruttore è contrassegnato come esterno
ja: コンストラクターは external に設定されています
ko: 생성자가 external로 표시되었습니다.
pl: Konstruktor jest oznaczony jako zewnętrzny
pt_br: O construtor está marcado como externo
ru: Конструктор помечен как внешний
tr: Oluşturucu dış olarak işaretlendi
zh_hans: 构造函数标记为外部对象
zh_hant: 建構函式標記為外部

# ERR_TypeVarNotFound
source: The contextual keyword 'var' may only appear within a local variable declaration or in script code
cs: Kontextové klíčové slovo var se může objevit pouze v rámci deklarace lokální proměnné nebo v kódu skriptu.
de: Das kontextabhängige Schlüsselwort "var" darf nur in einer lokalen Variablendeklaration oder im Skriptcode verwendet werden.
es: La palabra clave contextual 'var' solo puede aparecer dentro de una declaración de variable local o en código de script
fr: Le mot clé contextuel 'var' ne peut apparaître que dans une déclaration de variable locale ou dans un script de code
it: La parola chiave contestuale 'var' può essere specificata solo all'interno di una dichiarazione di variabile locale o in codice script
ja: コンテキスト キーワード 'var' は、ローカル変数宣言内またはスクリプト コード内でのみ有効です
ko: 상황별 키워드 'var'는 지역 변수 선언이나 스크립트 코드에만 표시할 수 있습니다.
pl: Kontekstowe słowo kluczowe „var” może występować tylko w deklaracji zmiennej lokalnej lub kodzie skryptu
pt_br: A palavra-chave contextual "var" pode somente aparecer dentro de uma declaração de variável local ou no código de script
ru: Контекстное ключевое слово "var" может использоваться только в объявлении локальной переменной или в скрипте.
tr: Bağlamsal anahtar sözcük 'var' yalnızca yerel değişken bildiriminde veya betik kodunda görünebilir
zh_hans: 上下文关键字“var”只能出现在局部变量声明或脚本代码中
zh_hant: 內容關鍵字 'var' 只可出現在區域變數宣告或指令碼中

# ERR_ImplicitlyTypedArrayNoBestType
source: No best type found for implicitly-typed array
cs: Nebyl nalezen optimální typ pro implicitně typované pole.
de: Es wurde kein optimaler Typ für das implizit typisierte Array gefunden.
es: No se encontró el mejor tipo para la matriz con tipo implícito
fr: Aucun meilleur type trouvé pour le tableau implicitement typé
it: Impossibile trovare il tipo migliore per la matrice tipizzata in modo implicito
ja: 暗黙的に型指定された配列の最適な型が見つかりませんでした
ko: 암시적으로 형식화된 배열에 가장 적합한 형식이 없습니다.
pl: Nie odnaleziono najlepszego typu dla tablicy o typie określonym niejawnie.
pt_br: Não foi encontrado nenhum tipo melhor para a matriz do tipo implícita
ru: Нет подходящего типа для неявно типизированного массива.
tr: Türü örtük olarak belirlenmiş dizi için en iyi tür bulunamadı
zh_hans: 找不到隐式类型数组的最佳类型
zh_hant: 找不到隱含類型陣列的最佳類型

# ERR_AnonymousTypePropertyAssignedBadValue
source: Cannot assign '{0}' to anonymous type property
cs: {0} nejde přiřadit k anonymní vlastnosti typu.
de: "{0}" kann keiner Eigenschaft eines anonymen Typs zugeordnet werden.
es: No se puede asignar "{0}" a una propiedad de tipo anónimo
fr: Impossible d'assigner '{0}' à une propriété de type anonyme
it: Non è possibile assegnare '{0}' alla proprietà di tipo anonimo
ja: '{0}' を匿名型のプロパティに割り当てることはできません
ko: 무명 형식 속성에 {0}을(를) 할당할 수 없습니다.
pl: Nie można przypisać elementu {0} do właściwości typu anonimowego
pt_br: Não é possível atribuir '{0}' à propriedade de tipo anônimo
ru: Невозможно присвоить "{0}" свойству анонимного типа.
tr: {0}', anonim type özelliğine atanamıyor
zh_hans: 无法将“{0}”分配给匿名类型属性
zh_hant: 無法將 '{0}' 指派給匿名型別屬性

# ERR_ExpressionTreeContainsBaseAccess
source: An expression tree may not contain a base access
cs: Strom výrazu nesmí obsahovat základní přístup.
de: Ein Ausdrucksbaum darf keinen Basiszugriff enthalten.
es: Un árbol de expresión no puede contener un acceso base
fr: Une arborescence de l'expression ne peut pas contenir un accès de base
it: L'albero delle espressioni non può contenere un accesso di base
ja: 式ツリーは、ベース アクセスを含むことはできません
ko: 식 트리에는 기본 액세스를 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać dostępu bazowego.
pt_br: Uma árvore de expressões não pode conter um acesso de base
ru: Дерево выражения не может иметь доступ к базовым членам.
tr: İfade ağacı temel bir erişim içeremez
zh_hans: 表达式树不能包含基访问
zh_hant: 運算式樹狀結構不可包含基底存取

# ERR_ExpressionTreeContainsAssignment
source: An expression tree may not contain an assignment operator
cs: Strom výrazu nesmí obsahovat operátor přiřazení.
de: Ein Ausdrucksbaum darf keinen Zuweisungsoperator enthalten.
es: Un árbol de expresión no puede contener un operador de asignación
fr: Une arborescence de l'expression ne peut pas contenir un opérateur d'assignation
it: L'albero delle espressioni non può contenere un operatore di assegnazione
ja: 式ツリーは、代入演算子を含むことはできません
ko: 식 트리에는 대입 연산자를 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać operatora przypisania.
pt_br: Uma árvore de expressões não pode conter um operador de atribuição
ru: Дерево выражения не может содержать оператор назначения.
tr: Bir ifade ağacı bir atama işleci içeremez
zh_hans: 表达式树不能包含赋值运算符
zh_hant: 運算式樹狀結構不可包含指派運算子

# ERR_AnonymousTypeDuplicatePropertyName
source: An anonymous type cannot have multiple properties with the same name
cs: Anonymní typ nemůže mít více vlastností se stejným názvem.
de: Ein anonymer Typ kann nicht mehrere Eigenschaften mit demselben Namen haben.
es: Un tipo anónimo no puede tener varias propiedades con el mismo nombre
fr: Un type anonyme ne peut pas avoir plusieurs propriétés du même nom
it: Un tipo anonimo non può avere più proprietà con lo stesso nome
ja: 匿名型では、同じ名前を持つ複数のプロパティを含むことはできません
ko: 익명 형식에는 동일한 이름의 속성을 여러 개 사용할 수 없습니다.
pl: Typ anonimowy nie może mieć wielu właściwości o tej samej nazwie.
pt_br: Um tipo anônimo não pode ter várias propriedades com o mesmo nome
ru: Анонимный тип не может иметь несколько свойств с одинаковыми именами.
tr: Anonim türde aynı ada sahip birden fazla özellik olamaz
zh_hans: 匿名类型不能有多个同名属性
zh_hant: 匿名類型不可具有多個同名的屬性

# ERR_StatementLambdaToExpressionTree
source: A lambda expression with a statement body cannot be converted to an expression tree
cs: Výraz lambda s tělem příkazu nejde převést na strom výrazu.
de: Ein Lambdaausdruck mit einem Anweisungstext kann nicht in einen Ausdrucksbaum konvertiert werden.
es: Una expresión lambda con un cuerpo de instrucción no se puede convertir en un árbol de expresión
fr: Une expression lambda avec un corps d'instruction ne peut pas être convertie en arborescence de l'expression
it: Non è possibile convertire un'espressione lambda con il corpo di un'istruzione in un albero delle espressioni
ja: ステートメント本体を含むラムダ式は、式ツリーに変換できません
ko: 문 본문이 있는 람다 식은 식 트리로 변환할 수 없습니다.
pl: Wyrażenia lambda z treścią instrukcji nie można skonwertować na drzewo wyrażenia.
pt_br: Uma expressão lambda com um corpo de instrução não pode ser convertida em uma árvore de expressões
ru: Лямбда-выражение с телом оператора не может быть преобразовано в дерево выражения.
tr: Deyim gövdesi olan lambda ifadesi ifade ağacına dönüştürülemez
zh_hans: 无法将具有语句体的 lambda 表达式转换为表达式树
zh_hant: 具有陳述式主體的 Lambda 運算式，不可轉換成運算式樹狀架構

# ERR_ExpressionTreeMustHaveDelegate
source: Cannot convert lambda to an expression tree whose type argument '{0}' is not a delegate type
cs: Výraz lambda nejde převést na strom výrazu, jehož argument typu {0} neurčuje delegovaný typ.
de: Eine Lambdafunktion kann nur dann in einen Ausdrucksbaum konvertiert werden, wenn das Typargument "{0}" ein Delegattyp ist.
es: No se puede convertir una expresión lambda en un árbol de expresión cuyo argumento de tipo '{0}' no sea un tipo delegado
fr: Impossible de convertir une expression lambda en arborescence d'expression dont l'argument de type '{0}' n'est pas un type délégué
it: Non è possibile convertire un'espressione lambda in un albero delle espressioni in cui l'argomento '{0}' del tipo non è un tipo delegato
ja: ラムダ式を、型引数 '{0}' がデリゲート型ではない式ツリーに変換できません
ko: 람다 식을 '{0}' 형식 인수가 대리자 형식이 아닌 식 트리로 변환할 수 없습니다.
pl: Nie można skonwertować wyrażenia lambda na drzewo wyrażenia, którego argument typu „{0}” nie jest typem delegowanym
pt_br: Não é possível converter lambda em uma árvore de expressões cujo argumento de tipo "{0}" não é um tipo delegado
ru: Не удается преобразовать лямбда-выражение в дерево выражения, чей аргумент типа "{0}" не является делегатом
tr: Lambda, '{0}' bağımsız değişken türü temsilci türü olmayan bir ifade ağacına dönüştürülemez
zh_hans: 不能将 lambda 转换为类型参数“{0}”不是委托类型的表达式树
zh_hant: 如果運算式樹狀結構的類型引數 '{0}' 不是委派類型，就無法將 Lambda 轉換成運算式樹狀結構

# ERR_AnonymousTypeNotAvailable
source: Cannot use anonymous type in a constant expression
cs: V konstantním výrazu nejde použít anonymní typ.
de: In einem konstanten Ausdruck kann kein anonymer Typ verwendet werden.
es: No se puede usar un tipo anónimo en una expresión constante
fr: Impossible d'utiliser un type anonyme dans une expression constante
it: Impossibile utilizzare il tipo anonimo in un'espressione costante
ja: 定数の式では匿名型を使用できません
ko: 상수 식에서는 익명 형식을 사용할 수 없습니다.
pl: W wyrażeniu stałym nie można użyć typu anonimowego.
pt_br: Não é possível usar o tipo anônimo em uma expressão constante
ru: Невозможно использовать анонимный тип в константном выражении.
tr: Sabit ifadede anonim tür kullanılamaz
zh_hans: 无法在常量表达式中使用匿名类型
zh_hant: 在常數運算式中不可使用匿名類型

# ERR_LambdaInIsAs
source: The first operand of an 'is' or 'as' operator may not be a lambda expression, anonymous method, or method group.
cs: Prvním operandem operátoru is nebo as nesmí být výraz lambda, anonymní metoda ani skupina metod.
de: Der erste Operand des "is"- oder "as"-Operators darf kein Lambdaausdruck, keine anonyme Methode und keine Methodengruppe sein.
es: Es posible que el primer operando de un operador 'is' o 'as' no sea una expresión lambda, un método anónimo ni un grupo de métodos.
fr: Le premier opérande d'un opérateur 'is' ou 'as' ne peut pas être une expression lambda, une méthode anonyme ou un groupe de méthodes.
it: Il primo operando di un operatore 'is' o 'as' non può essere un'espressione lambda, un metodo anonimo o un gruppo di metodi.
ja: 演算子 'is' または 'as' の最初のオペランドを、ラムダ式、匿名メソッド、またはメソッドのグループにすることはできません。
ko: is' 또는 'as' 연산자의 첫 번째 피연산자는 람다 식, 무명 메서드 또는 메서드 그룹이 될 수 없습니다.
pl: Pierwszy argument operacji operatora „is” lub „as” nie może być wyrażeniem lambda, metodą anonimową ani grupą metod.
pt_br: O primeiro operando de um operador "is" ou "as" não pode ser uma expressão lambda, um método anônimo ou um grupo de métodos.
ru: Первый операнд операторов "is" или "as" не может быть лямбда-выражением, анонимным методом или группой методов.
tr: is' veya 'as' işlecinin ilk işleneni bir lambda ifadesi, anonim yöntem veya yöntem grubu olamaz.
zh_hans: “is”或“as”运算符的第一个操作数不能是 lambda 表达式、匿名方法或方法组。
zh_hant: is' 或 'as' 運算子的第一個運算元，不可為 Lambda 運算式、匿名方法或方法群組。

# ERR_TypelessTupleInAs
source: The first operand of an 'as' operator may not be a tuple literal without a natural type.
cs: První operand operátoru as nesmí být literál řazené kolekce členů bez přirozeného typu.
de: Der erste Operand eines "as"-Operators ist unter Umständen kein Tupelliteral ohne einen natürlichen Typ.
es: El primer operando de un operador "as" no puede ser un literal de tupla sin un tipo natural.
fr: Le premier opérande d'un opérateur "as" ne peut pas être un littéral de tuple sans type naturel.
it: Il primo operando di un operatore 'as' non può essere un valore letterale di tupla senza un tipo naturale.
ja: as' 演算子の最初のオペランドは、自然な型のないタプル リテラルにすることはできません。
ko: as' 연산자의 첫 번째 피연산자는 자연 형식이 없는 튜플 리터럴일 수 없습니다.
pl: Pierwszy operand operatora „as” nie może być literałem krotki bez typu naturalnego.
pt_br: O primeiro operando de um operador 'as' não pode ser uma literal de tupla sem nenhum tipo natural.
ru: Первый операнд оператора as не может быть литералом кортежа без естественного типа.
tr: Bir 'as' işlecinin ilk işleneni, doğal bir türe sahip olmayan bir demet sabit değeri olamaz.
zh_hans: "as" 运算符的第一个操作数不能是一个没有自然类型的元组字面量。
zh_hant: as' 運算子的第一運算元不得為不含自然對數的元組常值。

# ERR_ExpressionTreeContainsMultiDimensionalArrayInitializer
source: An expression tree may not contain a multidimensional array initializer
cs: Strom výrazu nesmí obsahovat inicializátor vícedimenzionálního pole.
de: Ein Ausdrucksbaum darf keinen Initialisierer mehrdimensionaler Arrays enthalten.
es: Un árbol de expresión no puede contener un inicializador de matriz multidimensional
fr: Une arborescence de l'expression ne peut pas contenir un initialiseur de tableau à plusieurs dimensions
it: L'albero delle espressioni non può contenere un inizializzatore di matrici multidimensionali
ja: 式ツリーは、多次元配列初期化子を含むことはできません
ko: 식 트리에는 다차원 배열 이니셜라이저를 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać inicjatora tablicy wielowymiarowej.
pt_br: Uma árvore de expressões não pode conter um inicializador de matriz multidimensional
ru: Дерево выражения не может содержать инициализатор многомерного массива.
tr: Bir ifade ağacı çok boyutlu bir dizi başlatıcısı içeremez
zh_hans: 表达式树不能包含多维数组初始值
zh_hant: 運算式樹狀結構不可包含多維陣列初始設定式

# ERR_MissingArgument
source: Argument missing
cs: Chybí argument.
de: Fehlendes Argument.
es: Falta un argumento
fr: Argument manquant
it: Manca l'argomento
ja: 引数がありません
ko: 인수 없음
pl: Brak argumentu
pt_br: Argumento ausente
ru: Аргумент отсутствует.
tr: Bağımsız değişken eksik
zh_hans: 缺少参数
zh_hant: 遺失引數

# ERR_VariableUsedBeforeDeclaration
source: Cannot use local variable '{0}' before it is declared
cs: Lokální proměnnou {0} nejde použít dřív, než je deklarovaná.
de: Die lokale Variable "{0}" kann erst verwendet werden, nachdem sie deklariert wurde.
es: No se puede usar la variable local '{0}' antes de declararla
fr: Impossible d'utiliser la variable locale '{0}' tant qu'elle n'est pas déclarée
it: Non è possibile usare la variabile locale '{0}' prima che sia dichiarata
ja: 宣言する前にローカル変数 '{0}' を使用できません
ko: {0}' 지역 변수는 선언되지 않으면 사용할 수 없습니다.
pl: Nie można użyć zmiennej lokalnej „{0}” przed jej zadeklarowaniem
pt_br: Não é possível usar a variável local "{0}" antes de declará-la
ru: Невозможно использовать локальную переменную "{0}" перед ее объявлением.
tr: İfade edilmeden önce '{0}' yerel değişkeni kullanılamıyor
zh_hans: 本地变量“{0}”在声明之前无法使用
zh_hant: 在宣告區域變數 '{0}' 之前，無法使用此變數

# ERR_RecursivelyTypedVariable
source: Type of '{0}' cannot be inferred since its initializer directly or indirectly refers to the definition.
cs: Typ pro {0} nejde odvodit, protože jeho inicializátor přímo nebo nepřímo odkazuje na definici.
de: Der Typ von "{0}" kann nicht abgeleitet werden, da der Initialisierer direkt oder indirekt auf die Definition verweist.
es: El tipo de '{0}' no se puede inferir porque su inicializador hace referencia, directa o indirectamente, a la definición.
fr: Impossible de déduire le type de '{0}', car son initialiseur fait directement ou indirectement référence à la définition.
it: Il tipo di '{0}' non può essere dedotto perché il relativo inizializzatore fa riferimento in modo diretto o indiretto alla definizione.
ja: 初期化子が直接的または間接的に定義を参照しているため、'{0}' の型を推論することはできません。
ko: 이니셜라이저가 직간접적으로 정의를 참조하고 있어 '{0}' 형식을 유추할 수 없습니다.
pl: Typu elementu „{0}” nie można wywnioskować, ponieważ jego inicjator bezpośrednio lub pośrednio przywołuje definicję.
pt_br: Tipo de "{0}" não pode ser inferido porque seu inicializador direta ou indiretamente refere-se à definição.
ru: Не удается получить тип "{0}", так как инициализатор прямо или косвенно ссылается на определение.
tr: {0}' öğesinin türü başlatıcısı doğrudan veya dolaylı olarak tanıma başvurduğundan gösterilemiyor.
zh_hans: 无法推理“{0}”类型，因为其初始值设定项直接或间接地引用定义。
zh_hant: 無法推斷 '{0}' 的類型，因為其初始設定式會直接或間接參考定義。

# ERR_VariableUsedBeforeDeclarationAndHidesField
source: Cannot use local variable '{0}' before it is declared. The declaration of the local variable hides the field '{1}'.
cs: Lokální proměnnou {0} nejde použít dřív, než je deklarovaná. Deklarace lokální proměnné skryje pole {1}.
de: Die lokale Variable "{0}" kann erst verwendet werden, nachdem sie deklariert wurde. Bei der Deklaration der lokalen Variablen wird das Feld "{1}" verborgen.
es: No se puede usar la variable local '{0}' antes de declararla. La declaración de la variable local oculta el campo '{1}'.
fr: Impossible d'utiliser la variable locale '{0}' tant qu'elle n'est pas déclarée. La déclaration de la variable locale masque le champ '{1}'.
it: Non è possibile usare la variabile locale '{0}' prima che sia dichiarata. La dichiarazione della variabile locale nasconde il campo '{1}'.
ja: 宣言する前にローカル変数 '{0}' を使用できません。このローカル変数の宣言は、フィールド '{1}' を非表示にします。
ko: {0}' 지역 변수는 선언되지 않으면 사용할 수 없습니다. 지역 변수를 선언하면 '{1}' 필드가 숨겨집니다.
pl: Nie można użyć zmiennej lokalnej „{0}” przed jej zadeklarowaniem. Deklaracja zmiennej lokalnej powoduje ukrycie pola „{1}”.
pt_br: Não é possível usar a variável local "{0}" antes de declará-la. A declaração da variável local oculta o campo "{1}".
ru: Невозможно использовать локальную переменную "{0}" перед ее объявлением. Объявление данной локальной переменной скрыто в поле "{1}".
tr: İfade edilmeden önce '{0}' yerel değişkeni kullanılamıyor. Yerel değişkenin bildirimi '{1}' alanını gizler.
zh_hans: 本地变量“{0}”在声明之前无法使用。声明该本地变量将隐藏字段“{1}”。
zh_hant: 在宣告區域變數 '{0}' 之前，無法使用此變數。區域變數的宣告會隱藏欄位 '{1}'。

# ERR_ExpressionTreeContainsBadCoalesce
source: An expression tree lambda may not contain a coalescing operator with a null or default literal left-hand side
cs: Strom výrazu lambda nesmí obsahovat operátor sloučení, na jehož levé straně stojí literál s hodnotou Null nebo výchozí literál.
de: Ein Ausdrucksbaumstruktur-Lambda darf keinen Zusammenführungsoperator mit einem NULL- oder Standardliteral auf der linken Seite enthalten.
es: Un elemento lambda de árbol de expresión no puede contener un operador de incorporación con un literal predeterminado o nulo en la parte izquierda
fr: Une arborescence d'expression lambda ne peut pas contenir un opérateur de fusion avec une partie gauche de littéral ayant une valeur null ou une valeur par défaut
it: Un'espressione lambda dell'albero delle espressioni non può contenere un operatore di coalescenza con un valore letterale Null o predefinito nella parte sinistra
ja: 式ツリーのラムダには、左側に null リテラルまたは既定のリテラルのある合体演算子を含めることはできません
ko: 왼쪽에 null 또는 기본 리터럴이 있는 병합 연산자를 람다 식 트리에 사용할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać operatora łączącego z literałem domyślnym lub o wartości null po lewej stronie
pt_br: Uma árvore de expressão da expressão lambda não pode conter um operador de união com um lado esquerdo literal padrão ou nulo
ru: Лямбда-выражение дерева выражений не может содержать объединяющий оператор с литералом NULL или литералом по умолчанию в качестве левого операнда.
tr: İfade ağacı lambdası, sol tarafı null veya varsayılan sabit değer olan bir birleştirme işleci içeremez
zh_hans: lambda 表达式树不能包含左侧为 null 或 default 字面量的合并运算符
zh_hant: 運算式樹狀架構 Lambda 不可包含左側為 null 或預設常值的聯合運算子

# ERR_IdentifierExpected
source: Identifier expected
cs: Očekával se identifikátor.
de: Bezeichner erwartet.
es: Se esperaba un identificador
fr: Identificateur attendu
it: È previsto un identificatore
ja: 識別子がありません
ko: 식별자가 필요합니다.
pl: Oczekiwano identyfikatora
pt_br: Identificador esperado
ru: Требуется идентификатор.
tr: Tanımlayıcı bekleniyor
zh_hans: 应输入标识符
zh_hant: 必須是識別項

# ERR_SemicolonExpected
source: ; expected
cs: Očekával se středník (;).
de: ; erwartet.
es: Se esperaba ;
fr: ; attendu
it: È previsto un punto e virgola (;)
ja: ; が必要です
ko: ;이 필요합니다.
pl: Oczekiwano średnika (;)
pt_br: ; esperado
ru: Требуется ";".
tr: ; bekleniyor
zh_hans: 应输入 ;
zh_hant: 必須是 ;

# ERR_SyntaxError
source: Syntax error, '{0}' expected
cs: Chyba syntaxe; očekávána hodnota: {0}
de: Syntaxfehler. "{0}" erwartet.
es: Error de sintaxis, se esperaba '{0}'
fr: Erreur de syntaxe, '{0}' attendu
it: Errore di sintassi. È previsto '{0}'
ja: 構文エラーです。'{0}' が必要です
ko: 구문 오류입니다. '{0}'이(가) 필요합니다.
pl: Błąd składni, oczekiwano elementu „{0}”
pt_br: Erro de sintaxe, "{0}" esperado
ru: Синтаксическая ошибка, требуется "{0}"
tr: Sözdizimi hatası, '{0}' bekleniyor
zh_hans: 语法错误，应输入“{0}”
zh_hant: 語法錯誤，必須是 '{0}'

# ERR_DuplicateModifier
source: Duplicate '{0}' modifier
cs: Duplicitní modifikátor {0}
de: Doppelter {0}-Modifizierer
es: Modificador '{0}' duplicado
fr: Modificateur '{0}' en double
it: Il modificatore '{0}' è duplicato
ja: 修飾子 '{0}' が重複しています
ko: {0}' 한정자가 중복되었습니다.
pl: Zduplikowany modyfikator „{0}”
pt_br: Duplicar modificador "{0}"
ru: Повторяющийся модификатор "{0}"
tr: Yinelenen '{0}' değiştiricisi
zh_hans: “{0}”修饰符重复
zh_hant: '{0}' 修飾元重複

# ERR_DuplicateAccessor
source: Property accessor already defined
cs: Přistupující objekt vlastnosti je už definovaný.
de: Der Eigenschaftenaccessor ist bereits definiert.
es: Ya se ha definido el descriptor de acceso de la propiedad
fr: Accesseur de propriété déjà défini
it: La funzione di accesso alla proprietà è già definita
ja: プロパティ アクセサーは既に定義されています
ko: 속성 접근자가 이미 정의되었습니다.
pl: Metoda dostępu do właściwości jest już zdefiniowana
pt_br: O acessador de propriedade já está definido
ru: Метод доступа к свойству уже определен.
tr: Özellik erişimcisi zaten tanımlı
zh_hans: 属性访问器已经定义
zh_hant: 屬性存取子已定義

# ERR_IntegralTypeExpected
source: Type byte, sbyte, short, ushort, int, uint, long, or ulong expected
cs: Očekával se typ byte, sbyte, short, ushort, int, uint, long nebo ulong.
de: Typ "byte", "sbyte", "short", "ushort", "int", "uint", "long" oder "ulong" erwartet.
es: Se esperaba el tipo byte, sbyte, short, ushort, int, uint, long o ulong
fr: Type byte, sbyte, short, ushort, int, uint, long ou ulong attendu
it: È previsto il tipo byte, sbyte, short, ushort, int, uint, long o ulong
ja: byte、sbyte、short、ushort、int、uint、long または ulong のいずれかの型を使用してください
ko: byte, sbyte, short, ushort, int, uint, long 또는 ulong 형식이 필요합니다.
pl: Oczekiwano typu byte, sbyte, short, ushort, int, uint, long lub ulong.
pt_br: Tipo byte, sbyte, short, ushort, int, uint, long ou ulong esperado
ru: Требуется тип byte, sbyte, short, ushort, int, uint, long или ulong.
tr: Tür olarak byte, sbyte, short, ushort, int, uint, long veya ulong bekleniyor
zh_hans: 应输入类型 byte、sbyte、short、ushort、int、uint、long 或 ulong
zh_hant: 必須是 byte、sbyte、short、ushort、int、uint、long 或 ulong 類型

# ERR_IllegalEscape
source: Unrecognized escape sequence
cs: Nerozpoznaná řídicí sekvence
de: Nicht erkannte Escapesequenz.
es: Secuencia de escape no reconocida
fr: Séquence d'échappement non reconnue
it: Sequenza di escape non riconosciuta
ja: 認識できないエスケープ シーケンスです
ko: 인식할 수 없는 이스케이프 시퀀스입니다.
pl: Nierozpoznana sekwencja ucieczki
pt_br: Sequência de escape não reconhecida
ru: Нераспознанная escape-последовательность
tr: Tanınmayan atlatma sırası
zh_hans: 无法识别的转义序列
zh_hant: 逸出序列無法辨認

# ERR_NewlineInConst
source: Newline in constant
cs: Konstanta obsahuje znak nového řádku.
de: Zeilenvorschub in Konstante.
es: Nueva línea en constante
fr: Saut de ligne dans la constante
it: Nuova riga nella costante
ja: 定数の 新しい行です
ko: 상수에 줄 바꿈 문자가 있습니다.
pl: W stałej występuje symbol przejścia do następnego wiersza
pt_br: Newline em constante
ru: Символ новой строки в константе.
tr: Sabitte yeni satır karakteri
zh_hans: 常量中有换行符
zh_hant: 常數中包含新行字元
