Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_FeatureExceptionFilter
source: exception filter
cs: filtr výjimky
de: Ausnahmefilter
es: filtro de excepciones
fr: filtre d'exception
it: filtro eccezioni
ja: 例外フィルター
ko: 예외 필터
pl: filtr wyjątków
pt_br: filtro de exceção
ru: фильтр исключений
tr: istisna filtresi
zh_hans: 异常筛选器
zh_hant: 例外狀況篩選條件

# IDS_FeatureTypeVariance
source: type variance
cs: odchylka typu
de: Typvarianz
es: varianza de tipo
fr: variance de type
it: varianza dei tipi
ja: 型変性
ko: 형식 가변성(variance)
pl: typ wariancji
pt_br: variância de tipo
ru: вариантность типа
tr: tür varyansı
zh_hans: 类型变型
zh_hant: 類型變異數

# NotSameNumberParameterTypesAndRefKinds
source: Given {0} parameter types and {1} parameter ref kinds. These arrays must have the same length.
cs: Předal se určitý počet parametrů ({0}) a jiný počet druhů odkazů na parametry ({1}). Tato pole musí být stejně velká.
fr: Il existe {0} types de paramètre et {1} genres de référence de paramètre. Ces tableaux doivent avoir la même longueur.
it: Sono stati specificati {0} tipi di parametro e {1} tipi di modificatore ref di parametro. Queste matrici devono avere la stessa lunghezza.
ja: 指定されたパラメーター型 {0} と {1} パラメーター参照の種類。これらの配列は同じ長さである必要があります。
pl: Podano typy parametrów: {0} i rodzaje odwołań do parametrów: {1}. Te tablice muszą mieć taką samą długość.
pt_br: Tipos de parâmetro {0} e tipos de referência de parâmetro {1} fornecidos. Essas matrizes precisam ter o mesmo tamanho.
ru: Заданные типы параметров {0} и типы ссылок на параметры {1}. Эти массивы должны иметь одинаковую длину.
zh_hans: 给定 {0} 个参数类型和 {1} 个参数引用类型。这些数组必须具有相同的长度。
zh_hant: 指定的 {0} 參數類型和 {1} 參數參考種類。這些陣列的長度必須相同。

# OutIsNotValidForReturn
source: 'RefKind.Out' is not a valid ref kind for a return type.
cs: RefKind.Out není platný druh odkazu pro návratový typ.
fr: 'RefKind.Out' n'est pas un genre de référence valide pour un type de retour.
it: 'RefKind.Out' non è un tipo di modificatore ref valido per un tipo restituito.
ja: 'RefKind.Out' は、戻り値の型に対して有効な参照の種類ではありません。
pl: Element „RefKind.Out” nie jest prawidłowym rodzajem odwołania dla zwracanego typu.
pt_br: 'RefKind.Out' não é um tipo de referência válido para um tipo de retorno.
ru: RefKind.Out не является допустимым типом ссылки для типа возвращаемого значения.
zh_hans: 对于返回类型，"RefKind.Out" 不是有效的引用类型。
zh_hant: 'RefKind.Out' 對傳回型別而言，不是有效的參考類型。

# SyntaxTreeNotFound
source: SyntaxTree is not part of the compilation
cs: SyntaxTree není součástí kompilace.
de: SyntaxTree ist kein Teil der Kompilierung.
es: SyntaxTree no forma parte de la compilación
fr: SyntaxTree ne fait pas partie de la compilation
it: L'elemento SyntaxTree non fa parte della compilazione
ja: SyntaxTree はコンパイルの一部ではありません
ko: SyntaxTree는 컴파일의 일부가 아닙니다.
pl: Element SyntaxTree nie jest częścią kompilacji
pt_br: A SyntaxTree não faz parte da compilação
ru: SyntaxTree не входит в компиляцию
tr: SyntaxTree derlemenin bir parçası değil
zh_hans: 编译中不包含 SyntaxTree
zh_hant: SyntaxTree 不屬於編譯的一部份

# SyntaxTreeNotFoundToRemove
source: SyntaxTree is not part of the compilation, so it cannot be removed
cs: SyntaxTree není součástí kompilace, takže se nedá odebrat.
de: SyntaxTree ist kein Teil der Kompilierung und kann daher nicht entfernt werden.
es: SyntaxTree no forma parte de la compilación, así que no se puede quitar
fr: SyntaxTree ne faisant pas partie de la compilation, il ne peut pas être supprimé
it: L'elemento SyntaxTree non fa parte della compilazione, di conseguenza non può essere rimosso
ja: SyntaxTree はコンパイルの一部ではないため削除できません
ko: SyntaxTree는 컴파일의 일부가 아니므로 제거할 수 없습니다.
pl: Element SyntaxTree nie jest częścią kompilacji, więc nie można go usunąć
pt_br: A SyntaxTree não faz parte da compilação, portanto, não pode ser removida
ru: SyntaxTree не входит в компиляцию, поэтому его невозможно удалить
tr: SyntaxTree derlemenin bir parçası olmadığından kaldırılamaz
zh_hans: 编译中不包含 SyntaxTree，因此无法将其删除
zh_hant: 因為 SyntaxTree 不屬於編譯的一部份，所以無法將其移除

# WRN_CaseConstantNamedUnderscore
source: The name '_' refers to the constant, not the discard pattern. Use 'var _' to discard the value, or '@_' to refer to a constant by that name.
cs: Název „_“ odkazuje na konstantu, ne na vzor discard. Zadáním „var _“ hodnotu zahodíte a zadáním „@_“ nastavíte pod tímto názvem odkaz na konstantu.
de: Der Name "_" verweist auf die Konstante, nicht auf das discard-Muster. Verwenden Sie "var _" zum Verwerfen des Werts oder "@_" zum Verweis auf eine Konstante über diesen Namen.
es: El nombre "_" hace referencia a la constante, no al patrón de descarte. Use "var _" para descartar el valor o "@_" para hacer referencia a una constante con ese nombre.
fr: Le nom '_' fait référence à la constante, pas au modèle d'abandon. Utilisez 'var _' pour abandonner la valeur, ou '@_' pour faire référence à une constante par ce nom.
it: Il nome '_' fa riferimento alla costante e non al criterio di eliminazione. Usare 'var _' per eliminare il valore oppure '@_' per fare riferimento a una costante in base a tale nome.
ja: 名前 '_' は、破棄パターンではなく定数を参照しています。値を破棄する場合には 'var _' を、そのような名前の定数を参照する場合には '@_' を使用します。
ko: '_' 이름은 상수를 참조하며, 무시 패턴은 참조하지 않습니다. 'var _'을 사용하여 값을 무시하거나 '@_'을 사용하여 해당 이름별 상수를 참조하세요.
pl: Nazwa „_” odwołuje się do stałej, a nie do wzorca odrzucania. Użyj elementu „var _”, aby odrzucić wartość, lub użyj elementu „@_”, aby odwołać się do stałej za pomocą tej nazwy.
pt_br: O nome '_' refere-se à constante, não ao padrão de descarte. Use 'var _' para descartar o valor ou '@_' para referir-se a uma constante por esse nome.
ru: Имя "_" ссылается на константу, а не на шаблон отмены. Используйте "var _", чтобы отменить значение, или "@_", чтобы сослаться на константу по этому имени.
tr: '_' adı atma desenine değil sabite başvuruyor. Değeri atmak için 'var _' adını ya da bu ada sahip bir sabite başvurmak için '@_' adını kullanın.
zh_hans: 名称 "_" 引用常量，而不引用放弃模式。请使用 "var _" 放弃该值，或使用 "@_" 来引用该名称的常量。
zh_hant: 名稱 '_' 參考常數而非捨棄模式。請使用 'var _' 來捨棄值，或使用 '@_' 來依該名稱參考常數。

# WRN_CaseConstantNamedUnderscore_Title
source: Do not use '_' for a case constant.
cs: Nepoužívejte „_“ jako konstantu case.
de: Verwenden Sie "_" nicht für eine case-Konstante.
es: No use "_" para una constante de caso.
fr: N'utilisez pas '_' pour une constante case.
it: Non usare '_' per una costante di case.
ja: case 定数に '_' を使用しないでください。
ko: case 상수에 '_'을 사용하지 마세요.
pl: Nie używaj elementu „_” dla stałej case.
pt_br: Não use '_' para uma constante de caso.
ru: Не используйте "_" для константы case.
tr: Bir case sabiti için '_' adını kullanmayın.
zh_hans: 不要对大小写常量使用 "_"。
zh_hant: 不可對 case 常數使用 '_'。

# WRN_ConstOutOfRangeChecked
source: Constant value '{0}' may overflow '{1}' at runtime (use 'unchecked' syntax to override)
cs: Konstantní hodnota {0} může při běhu přetéct {1} (pro přepis použijte syntaxi unchecked).
fr: La valeur de constante '{0}' peut dépasser '{1}' au moment de l'exécution (utilisez la syntaxe 'unchecked' pour la remplacer)
it: Con il valore di costante '{0}' può verificarsi un overflow di '{1}' in fase di esecuzione. Usare la sintassi 'unchecked' per eseguire l'override
ja: 定数値 '{0}' は実行時に '{1}' をオーバーフローする可能性があります (オーバーライドするには 'unchecked' 構文を使用してください)
pl: Wartość stałej „{0}” może przepełnić element „{1}” w czasie wykonywania (użyj składni „unchecked”, aby przesłonić)
pt_br: O valor constante '{0}' pode estourar '{1}' no runtime (use a sintaxe 'unchecked' para substituição)
ru: Константное значение "{0}" может привести к переполнению "{1}" во время выполнения (для переопределения используйте синтаксис "unchecked").
zh_hans: 常量值“{0}”可能在运行时溢出“{1}”(请使用 "unchecked" 语法替代)
zh_hant: 常數值 '{0}' 在執行階段可能會使 '{1}' 溢位 (請使用 'unchecked' 語法覆寫)

# WRN_ConstOutOfRangeChecked_Title
source: Constant value may overflow at runtime (use 'unchecked' syntax to override)
cs: Konstantní hodnota může při běhu přetéct (pro přepis použijte syntaxi unchecked)
fr: Dépassement possible de la valeur de constante au moment de l'exécution (utilisez la syntaxe 'unchecked' pour la remplacer)
it: Con il valore di costante può verificarsi un overflow in fase di esecuzione. Usare la sintassi 'unchecked' per eseguire l'override
ja: 実行時に定数値がオーバーフローする可能性があります (オーバーライドするには 'unchecked' 構文を使用してください)
pl: Wartość stałej może spowodować przepełnienie w czasie wykonywania (użyj składni „unchecked”, aby przesłonić)
pt_br: O valor constante pode estourar no runtime (use a sintaxe 'unchecked' para substituição)
ru: Константное значение может привести к переполнению во время выполнения (для переопределения используйте синтаксис "unchecked")
zh_hans: 常量值可能在运行时溢出(请使用 "unchecked" 语法替代)
zh_hant: 常數值在執行階段可能會溢位 (請使用 'unchecked' 語法覆寫)

# WRN_ConvertingNullableToNonNullable
source: Converting null literal or possible null value to non-nullable type.
cs: Literál s hodnotou null nebo s možnou hodnotou null se převádí na typ, který nemůže mít hodnotu null.
de: Das NULL-Literal oder ein möglicher NULL-Wert wird in einen Non-Nullable-Typ konvertiert.
es: Se va a convertir un literal nulo o un posible valor nulo en un tipo que no acepta valores NULL
fr: Conversion de littéral ayant une valeur null ou d'une éventuelle valeur null en type non-nullable.
it: Conversione del valore letterale Null o di un possibile valore Null in un tipo che non ammette i valori Null.
ja: Null リテラルまたは Null の可能性がある値を Null 非許容型に変換しています。
ko: null 리터럴 또는 가능한 null 값을 null을 허용하지 않는 형식으로 변환하는 중입니다.
pl: Konwertowanie literału null lub możliwej wartości null na nienullowalny typ.
pt_br: Conversão de literal nula ou possível valor nulo em tipo não anulável.
ru: Преобразование литерала, допускающего значение NULL или возможного значения NULL в тип, не допускающий значение NULL.
tr: Null sabit değeri veya olası null değeri, boş değer atanamaz türe dönüştürülüyor.
zh_hans: 将 null 文本或可能的 null 值转换为不可为 null 类型。
zh_hant: 正在將 Null 常值或可能的 Null 值轉換為不可為 Null 的型別。

# WRN_ConvertingNullableToNonNullable_Title
source: Converting null literal or possible null value to non-nullable type.
cs: Literál s hodnotou null nebo s možnou hodnotou null se převádí na typ, který nemůže mít hodnotu null.
de: Das NULL-Literal oder ein möglicher NULL-Wert wird in einen Non-Nullable-Typ konvertiert.
es: Se va a convertir un literal nulo o un posible valor nulo en un tipo que no acepta valores NULL
fr: Conversion de littéral ayant une valeur null ou d'une éventuelle valeur null en type non-nullable.
it: Conversione del valore letterale Null o di un possibile valore Null in un tipo che non ammette i valori Null.
ja: Null リテラルまたは Null の可能性がある値を Null 非許容型に変換しています。
ko: null 리터럴 또는 가능한 null 값을 null을 허용하지 않는 형식으로 변환하는 중입니다.
pl: Konwertowanie literału null lub możliwej wartości null na nienullowalny typ.
pt_br: Conversão de literal nula ou possível valor nulo em tipo não anulável.
ru: Преобразование литерала, допускающего значение NULL или возможного значения NULL в тип, не допускающий значение NULL.
tr: Null sabit değeri veya olası null değeri, boş değer atanamaz türe dönüştürülüyor.
zh_hans: 将 null 字面量或可能为 null 的值转换为非 null 类型。
zh_hant: 正在將 Null 常值或可能的 Null 值轉換為不可為 Null 的型別。

# WRN_DisallowNullAttributeForbidsMaybeNullAssignment
source: A possible null value may not be used for a type marked with [NotNull] or [DisallowNull]
cs: Možnou hodnotu null není možné použít pro typ označený jako [NotNull] nebo [DisallowNull].
de: Ein möglicher NULL-Wert darf nicht für einen mit [NotNull] oder [DisallowNull] markierten Typ verwendet werden.
es: No se puede usar un posible valor null para un tipo marcado con [NotNull] o [DisallowNull]
fr: Impossible d'utiliser une éventuelle valeur null pour un type marqué avec [NotNull] ou [DisallowNull]
it: Un possibile valore Null non può essere usato per un tipo contrassegnato con [NotNull] o [DisallowNull]
ja: [NotNull] または [DisallowNull] としてマークされた型に対して、Null の可能性がある値を使用することはできません
ko: [NotNull] 또는 [DisallowNull]로 표시된 형식에는 가능한 null 값을 사용하지 못할 수 있음
pl: Nie można użyć możliwej wartości null dla typu oznaczonego jako [NotNull] lub [DisallowNull]
pt_br: Um valor nulo possível não pode ser usado para um tipo marcado com [NotNull] ou [DisallowNull]
ru: Возможное значение NULL не может использоваться для типа, помеченного как [NotNull] или [DisallowNull]
tr: Olası bir null değer, [DisallowNull] özniteliğiyle işaretlenmiş bir hedefe geçirilemez
zh_hans: 可能的 null 值不能用于标记为 [NotNull] 或 [DisallowNull] 的类型
zh_hant: 可能的 Null 值不能用於標有 [NotNull] 或 [DisallowNull] 的類型

# WRN_DisallowNullAttributeForbidsMaybeNullAssignment_Title
source: A possible null value may not be used for a type marked with [NotNull] or [DisallowNull]
cs: Možnou hodnotu null není možné použít pro typ označený jako [NotNull] nebo [DisallowNull].
de: Ein möglicher NULL-Wert darf nicht für einen mit [NotNull] oder [DisallowNull] markierten Typ verwendet werden.
es: No se puede usar un posible valor null para un tipo marcado con [NotNull] o [DisallowNull]
fr: Impossible d'utiliser une éventuelle valeur null pour un type marqué avec [NotNull] ou [DisallowNull]
it: Un possibile valore Null non può essere usato per un tipo contrassegnato con [NotNull] o [DisallowNull]
ja: [NotNull] または [DisallowNull] としてマークされた型に対して、Null の可能性がある値を使用することはできない
ko: [NotNull] 또는 [DisallowNull]로 표시된 형식에는 가능한 null 값을 사용하지 못할 수 있음
pl: Nie można użyć możliwej wartości null dla typu oznaczonego jako [NotNull] lub [DisallowNull]
pt_br: Um valor nulo possível não pode ser usado para um tipo marcado com [NotNull] ou [DisallowNull]
ru: Возможное значение NULL не может использоваться для типа, помеченного как [NotNull] или [DisallowNull]
tr: Olası bir null değer, [DisallowNull] özniteliğiyle işaretlenmiş bir hedefe geçirilemez
zh_hans: 可能的 null 值不能用于标记为 [NotNull] 或 [DisallowNull] 的类型
zh_hant: 可能的 Null 值不能用於標有 [NotNull] 或 [DisallowNull] 的類型

# WRN_DoesNotReturnMismatch
source: Method '{0}' lacks `[DoesNotReturn]` annotation to match implemented or overridden member.
cs: Metodě {0} chybí poznámka [DoesNotReturn], která by odpovídala implementovanému nebo přepsanému členu.
fr: La méthode '{0}' n'a pas d'annotation '[DoesNotReturn]' correspondant au membre implémenté ou substitué.
it: Nel metodo '{0}' manca l'annotazione `[DoesNotReturn]` per la corrispondenza del membro implementato o di cui è stato eseguito l'override.
ja: メソッド '{0}' には、実装された、またはオーバーライドされたメンバーと一致する '[DoesNotReturn]' 注釈がありません。
pl: W metodzie „{0}” brakuje adnotacji „[DoesNotReturn]”, aby można było dopasować zaimplementowaną lub przesłoniętą składową.
pt_br: O método '{0}' não tem a anotação '[DoesNotReturn]' para corresponder ao membro implementado ou substituído.
ru: В методе "{0}" отсутствует аннотация "[DoesNotReturn]" для сопоставления реализованного или переопределенного члена.
zh_hans: 方法“{0}”缺少 "[DoesNotReturn]" 注释，无法匹配已实现的或被替代的成员。
zh_hant: 方法 '{0}' 缺少 `[DoesNotReturn]` 註釋，與實作或覆寫的成員不相符。

# WRN_DoesNotReturnMismatch_Title
source: Method lacks `[DoesNotReturn]` annotation to match implemented or overridden member.
cs: Metodě chybí poznámka [DoesNotReturn], která by odpovídala implementovanému nebo přepsanému členu
fr: La méthode n'a pas d'annotation '[DoesNotReturn]' correspondant au membre implémenté ou substitué.
it: Nel metodo manca l'annotazione `[DoesNotReturn]` per la corrispondenza del membro implementato o di cui è stato eseguito l'override.
ja: メソッドには、実装された、またはオーバーライドされたメンバーと一致する '[DoesNotReturn]' 注釈がありません。
pl: W metodzie brakuje adnotacji „[DoesNotReturn]”, aby można było dopasować zaimplementowaną lub przesłoniętą składową.
pt_br: O método não tem a anotação '[DoesNotReturn]' para corresponder ao membro implementado ou substituído.
ru: В методе отсутствует аннотация "[DoesNotReturn]" для сопоставления реализованного или переопределенного члена.
zh_hans: 方法缺少 "[DoesNotReturn]" 注释，无法匹配已实现的或被替代的成员。
zh_hant: 方法缺少 `[DoesNotReturn]` 註釋，與實作或覆寫的成員不相符。

# WRN_DuplicateInterfaceWithNullabilityMismatchInBaseList
source: '{0}' is already listed in the interface list on type '{1}' with different nullability of reference types.
cs: Položka {0} je už uvedená v seznamu rozhraní u typu {1} s různou možností použití hodnoty null u typů odkazů.
de: "{0}" wird bereits mit einer anderen NULL-Zulässigkeit oder abweichenden Verweistypen in der Schnittstellenliste für den Typ "{1}" aufgeführt.
es: "{0}" ya está en la lista de interfaces del tipo "{1}" con una nulabilidad diferente de los tipos de referencia.
fr: '{0}' figure déjà dans la liste des interfaces du type '{1}' avec différentes possibilités de valeur null des types référence.
it: '{0}' è già inclusa nell'elenco di interfacce nel tipo '{1}' con diverso supporto dei valori Null per i tipi riferimento.
ja: '{0}' は既に型 '{1}' のインターフェイス リストに存在しますが、参照型の Null 許容性が異なっています。
ko: '{0}'은(는) 다른 참조 형식 Null 허용 여부를 사용하는 '{1}' 형식에 대한 인터페이스 목록에 이미 나열되어 있습니다.
pl: Element „{0}” występuje już na liście interfejsów dla typu „{1}” z inną obsługą wartości null typów referencyjnych.
pt_br: '{0}' já está listado na lista de interfaces no tipo '{1}' com uma nulidade diferente de tipos de referência.
ru: "{0}" уже указан в списке интерфейсов типа "{1}"с другой допустимостью значений NULL ссылочных типов.
tr: '{0}', '{1}' türünün arabirim listesinde farklı başvuru türleri boş değer atanabilirliği ile zaten listelenmiş.
zh_hans: “{0}”已列入类型“{1}”的接口列表中，其中包含不同引用类型的 Null 性。
zh_hant: '{0}' 已列在類型 '{1}' 上的介面清單中，並具有不同的參考類型可 NULL 性。

# WRN_DuplicateInterfaceWithNullabilityMismatchInBaseList_Title
source: Interface is already listed in the interface list with different nullability of reference types.
cs: Rozhraní je už uvedené v seznamu rozhraní s různou možností použití hodnoty null u typů odkazů.
de: Die Schnittstelle wird bereits mit einer anderen NULL-Zulässigkeit oder abweichenden Verweistypen in der Schnittstellenliste aufgeführt.
es: La interfaz ya está en la lista de interfaces con una nulabilidad diferente de los tipos de referencia.
fr: L'interface figure déjà dans la liste des interfaces avec différentes possibilités de valeur null des types référence.
it: L'interfaccia è già inclusa nell'elenco di interfacce con diverso supporto dei valori Null per i tipi riferimento.
ja: インターフェイスは既にインターフェイス リストに存在しますが、参照型の Null 許容性が異なっています。
ko: 인터페이스가 다른 참조 형식 Null 허용 여부를 사용하는 인터페이스 목록에 이미 나열되어 있습니다.
pl: Interfejs występuje już na liście interfejsów z inną obsługą wartości null typów referencyjnych.
pt_br: A interface já está listada na lista de interfaces com uma nulidade diferente de tipos de referência.
ru: Интерфейс уже указан в списке интерфейсов с другой допустимостью значений NULL ссылочных типов.
tr: Arabirim, arabirim listesinde farklı başvuru türleri boş değer atanabilirliği ile zaten listelenmiş
zh_hans: 接口已在接口列表中列出，引用类型具有不同的 Null 性。
zh_hant: 介面已列在介面清單中，並具有不同的參考類型可 NULL 性。

# WRN_GeneratorFailedDuringGeneration
source: Generator '{0}' failed to generate source. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'. {3}
fr: Le générateur « {0} » n'a pas réussi à générer la source. Cela ne contribuera pas à la sortie et des erreurs de compilation pourraient en résulter. L'exception était de type « {1} » avec le message « {2} ». {3}
it: Il generatore '{0}' non è riuscito a generare l'origine. Non contribuirà quindi all'output ed è possibile che si verifichino errori di compilazione. Eccezione di tipo '{1}' con messaggio '{2}'. {3}
ja: ジェネレーター '{0}' でソースを生成できませんでした。出力には寄与しません。結果として、コンパイル エラーが発生する可能性があります。例外の型: '{1}'。メッセージ: '{2}'。 {3}
pl: Generator „{0}” nie mógł wygenerować źródła. W rezultacie nie będzie on współtworzyć danych wyjściowych i mogą wystąpić błędy kompilacji. Wyjątek był typu „{1}” z komunikatem „{2}”. {3}
pt_br: O gerador “{0}” não pôde gerar a origem. Isso não contribuirá para a saída e, como resultado, poderão ocorrer erros de compilação. A exceção foi do tipo “{1}” com mensagem “{2}”. {3}
ru: Генератору "{0}" не удалось создать источник. Это не повлияет на выходные данные и ошибки компиляции, которые могут возникнуть в результате. Тип возникшего исключения: "{1}", сообщение: "{2}". {3}
zh_hans: 生成器“{0}”未能生成源。它不会影响输出，因此可能会造成编译错误。异常的类型为“{1}”，显示消息“{2}”. {3}
zh_hant: 產生器 '{0}' 無法產生來源。其不會提供給輸出，並可能導致編譯錯誤。例外狀況的類型為 '{1}'，訊息為 '{2}'。 {3}

# WRN_GeneratorFailedDuringGeneration_Title
source: Generator failed to generate source.
cs: Generátoru se nepovedlo vygenerovat zdroj
fr: Le générateur n'a pas pu générer la source.
it: Il generatore non è riuscito a generare l'origine.
ja: ジェネレーターはソースを生成できませんでした。
pl: Generator nie mógł wygenerować źródła.
pt_br: O gerador não pôde gerar a origem.
ru: Генератору не удалось создать источник.
zh_hans: 生成器无法生成源。
zh_hant: 產生器無法產生來源。

# WRN_GeneratorFailedDuringInitialization
source: Generator '{0}' failed to initialize. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'. {3}
fr: Le générateur « {0} » n'a pas pu s'initialiser. Cela ne contribuera pas à la sortie et des erreurs de compilation pourraient en résulter. L'exception était de type « {1} » avec le message « {2} ». {3}
it: Non è stato possibile inizializzare il generatore '{0}'. Non contribuirà quindi all'output ed è possibile che si verifichino errori di compilazione. Eccezione di tipo '{1}' con messaggio '{2}'. {3}
ja: ジェネレーター '{0}' を初期化できませんでした。出力には寄与しません。結果として、コンパイル エラーが発生する可能性があります。例外の型: '{1}'。メッセージ: '{2}'。 {3}
pl: Generator „{0}” nie mógł przeprowadzić inicjalizacji. W rezultacie nie będzie on współtworzyć danych wyjściowych i mogą wystąpić błędy kompilacji. Wyjątek był typu „{1}” z komunikatem „{2}”. {3}
pt_br: Falha na inicialização do gerador “{0}”. Isso não contribuirá para a saída e, como resultado, poderão ocorrer erros de compilação. A exceção foi do tipo “{1}” com mensagem “{2}”. {3}
ru: Не удалось инициализировать генератор "{0}". Это не повлияет на выходные данные и ошибки компиляции, которые могут возникнуть в результате. Тип возникшего исключения: "{1}", сообщение: "{2}". {3}
zh_hans: 生成器“{0}”未能初始化。它不会影响输出，因此可能会造成编译错误。异常的类型为“{1}”，显示消息“{2}”。 {3}
zh_hant: 產生器 '{0}' 無法初始化。其不會提供給輸出，並可能導致編譯錯誤。例外狀況的類型為 '{1}'，訊息為 '{2}'。 {3}

# WRN_GeneratorFailedDuringInitialization_Title
source: Generator failed to initialize.
cs: Generátor se nepovedlo inicializovat
fr: Échec de l'initialisation du générateur.
it: Non è stato possibile inizializzare il generatore.
ja: ジェネレーターを初期化できませんでした。
pl: Generator nie mógł przeprowadzić inicjalizacji.
pt_br: Falha na inicialização do gerador.
ru: Не удалось инициализировать генератор.
zh_hans: 生成器初始化失败。
zh_hant: 產生器無法初始化。

# WRN_GivenExpressionAlwaysMatchesConstant
source: The given expression always matches the provided constant.
cs: Daný výraz vždy odpovídá zadané konstantě.
de: Der angegebene Ausdruck stimmt immer mit der angegebenen Konstante überein.
es: La expresión dada coincide siempre con la constante proporcionada.
fr: L'expression donnée correspond toujours à la constante fournie.
it: L'espressione specificata corrisponde sempre alla costante fornita.
ja: 指定された式は指定された定数と必ず一致します。
ko: 지정한 식은 항상 제공한 상수와 일치합니다.
pl: Dane wyrażenie jest zawsze zgodne z podaną stałą.
pt_br: A expressão fornecida sempre corresponde à constante fornecida.
ru: Указанное выражение всегда соответствует предоставленной константе.
tr: Belirtilen ifade her zaman sağlanan sabitle eşleşir.
zh_hans: 给定的表达式始终与提供的常量匹配。
zh_hant: 指定的運算式永遠符合提供的常數。
