Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_RefReadonlyNotVariable_Title
source: Argument should be a variable because it is passed to a 'ref readonly' parameter
fr: L’argument doit être une variable, car il est passé à un paramètre « ref readonly »
it: L'argomento deve essere una variabile perché viene passato a un parametro 'ref readonly'
ja: 引数は 'ref readonly' パラメーターに渡されるため、変数である必要があります
pl: Argument powinien być zmienną, ponieważ jest przekazywany do parametru „ref readonly”
pt_br: O argumento deve ser uma variável porque é passado para um parâmetro 'ref readonly'
ru: Аргумент должен быть переменной, так как он передается параметру "ref readonly"
zh_hans: 参数应为变量，因为它会传递给 “ref readonly” 参数
zh_hant: 引數應為變數，因為它會傳遞至 'ref readonly' 參數

# WRN_RefReadonlyParameterDefaultValue
source: A default value is specified for 'ref readonly' parameter '{0}', but 'ref readonly' should be used only for references. Consider declaring the parameter as 'in'.
fr: Une valeur par défaut est spécifiée pour le paramètre « ref readonly » « {0} », mais « ref readonly » doit être utilisé uniquement pour les références. Envisagez de déclarer le paramètre comme « in ».
it: Per il parametro 'ref readonly' viene specificato un valore predefinito '{0}', ma 'ref readonly' deve essere usato solo per i riferimenti. Provare a dichiarare il parametro come 'in'.
ja: 'ref readonly' パラメーター '{0}' に既定値が指定されていますが、'ref readonly' は参照にのみ使用する必要があります。パラメーターを 'in' として宣言することを検討してください。
pl: Dla parametru „ref readonly” „{0}” określono wartość domyślną, ale parametr „ref readonly” powinien być używany tylko dla odwołań. Rozważ zadeklarowanie parametru jako „in”.
pt_br: Um valor padrão é especificado para o parâmetro 'ref readonly' '{0}', mas 'ref readonly' deve ser usado somente para referências. Considere declarar o parâmetro como 'in'.
ru: Значение по умолчанию указано для параметра "ref readonly" "{0}", но "ref readonly" следует использовать только для ссылок. Рассмотрите возможность объявления параметра как "in".
zh_hans: 为 “ref readonly” 参数“{0}”指定了默认值，但 “ref readonly” 应仅用于引用。请考虑将参数声明为 “in”。
zh_hant: 已為 'ref readonly' 參數指定預設值 '{0}'，但 'ref readonly' 應只用於參考。請考慮將參數宣告為 'in'。

# WRN_RefReadonlyParameterDefaultValue_Title
source: A default value is specified for 'ref readonly' parameter, but 'ref readonly' should be used only for references. Consider declaring the parameter as 'in'.
fr: Une valeur par défaut est spécifiée pour le paramètre « ref readonly », mais « ref readonly » doit être utilisé uniquement pour les références. Envisagez de déclarer le paramètre comme « in ».
it: Per il parametro 'ref readonly' viene specificato un valore predefinito, ma 'ref readonly' deve essere usato solo per i riferimenti. Provare a dichiarare il parametro come 'in'.
ja: 'ref readonly' パラメーターに既定値が指定されていますが、'ref readonly' は参照にのみ使用する必要があります。パラメーターを 'in' として宣言することを検討してください。
pl: Dla parametru „ref readonly” określono wartość domyślną, ale parametr „ref readonly” powinien być używany tylko dla odwołań. Rozważ zadeklarowanie parametru jako „in”.
pt_br: Um valor padrão é especificado para o parâmetro 'ref readonly', mas 'ref readonly' deve ser usado somente para referências. Considere declarar o parâmetro como 'in'.
ru: Значение по умолчанию указано для параметра "ref readonly", но "ref readonly" следует использовать только для ссылок. Рассмотрите возможность объявления параметра как "in".
zh_hans: 为 “ref readonly” 参数指定了默认值，但 “ref readonly” 应仅用于引用。请考虑将参数声明为 “in”。
zh_hant: 已為 'ref readonly' 參數指定預設值，但 'ref readonly' 應只用於參考。請考慮將參數宣告為 'in'。

# WRN_RefReturnLocal
source: This returns local '{0}' by reference but it is not a ref local
cs: Tato funkce vrací místní {0} podle odkazu, ale nejedná se o místní odkaz
fr: Retourne une variable locale '{0}' par référence, mais il ne s'agit pas d'une variable locale de référence
it: In questo modo viene restituito il valore locale '{0}' per riferimento, ma non è un riferimento locale
ja: これは、ローカル変数 '{0}' を参照渡しで返しますが、ref ローカル変数ではありません
pl: Spowoduje to zwrócenie lokalnego elementu „{0}” przez odwołanie, ale nie jest to odwołanie lokalne
pt_br: Isso retorna o local '{0}' por referência, mas não é um local de ref
ru: Это возвращает local "{0}" по ссылке, но это не ref local
zh_hans: 这将按引用返回本地“{0}”，但它不是 ref 本地
zh_hant: 這會藉傳址方式傳回本機 '{0}'，但其非參考本機

# WRN_RefReturnLocal2
source: This returns a member of local '{0}' by reference but it is not a ref local
cs: Vrací člen místního {0} podle odkazu, ale nejedná se o místní odkaz
fr: Retourne un membre de la variable locale '{0}' par référence, mais il ne s'agit pas d'une variable locale de référence
it: Viene restituito un membro di '{0}' locale per riferimento, ma non è un ref locale
ja: これは、ローカル '{0}' のメンバーを参照渡しで返しますが、ref ローカル変数ではありません
pl: Zwraca to składową lokalnego elementu „{0}” przez odwołanie, ale nie jest odwołaniem lokalnym
pt_br: Isso retorna um membro do local '{0}' por referência, mas não é um local de ref
ru: Это возвращает элемент local "{0}" по ссылке, но это не ref local
zh_hans: 这将按引用返回本地“{0}”的成员，但它不是 ref 本地
zh_hant: 這會藉傳址方式傳回本機 '{0}' 的成員，但其非參考本機

# WRN_RefReturnLocal2_Title
source: This returns a member of local by reference but it is not a ref local
cs: Vrací místní člen podle odkazu, ale nejedná se o místní odkaz
fr: Retourne un membre de la variable locale par référence, mais il ne s'agit pas d'une variable locale de référence
it: In questo modo viene restituito un membro locale per riferimento, ma non è un riferimento locale
ja: これは、ローカルのメンバーを参照渡しで返しますが、ref ローカル変数ではありません
pl: Zwraca składową elementu lokalnego przez odwołanie, ale nie jest odwołaniem lokalnym
pt_br: Isso retorna um membro do local por referência, mas não é um local de ref
ru: Это возвращает элемент local по ссылке, но это не ref local
zh_hans: 这会按引用返回本地成员，但它不是 ref 本地
zh_hant: 這會藉傳址方式傳回本機的成員，但其非參考本機

# WRN_RefReturnLocal_Title
source: This returns local by reference but it is not a ref local
cs: Tato funkce vrací místní podle odkazu, ale nejedná se o místní odkaz
fr: Retourne une variable locale par référence, mais il ne s'agit pas d'une variable locale de référence
it: Restituisce local per riferimento, ma non è un ref locale
ja: これは、ローカル変数を参照渡しで返しますが、ref ローカル変数ではありません
pl: Spowoduje to zwrócenie wartości lokalnej przez odwołanie, ale nie jest odwołaniem lokalnym
pt_br: Isso retorna local por referência, mas não é um local de ref
ru: Это возвращает local по ссылке, но не является ref local
zh_hans: 这会按引用返回本地，但它不是 ref 本地
zh_hant: 這會藉傳址方式傳回本機，但其非參考本機

# WRN_RefReturnNonreturnableLocal
source: Local '{0}' is returned by reference but was initialized to a value that cannot be returned by reference
cs: Místní {0} je vráceno podle odkazu, ale bylo inicializováno na hodnotu, kterou není možné vrátit podle odkazu
fr: La variable local '{0}' est retournée par référence, mais elle a été initialisée à une valeur qui ne peut pas être retournée par référence
it: '{0}' locale viene restituito per riferimento ma è stato inizializzato su un valore che non può essere restituito dal riferimento
ja: ローカル変数 '{0}' は参照渡しで返されますが、参照渡しで返せない値に初期化されました
pl: Nie można zwrócić elementu „{0}” przez referencję, ponieważ został on zainicjowany przy użyciu wartości, której nie można zwrócić przez referencję
pt_br: O local '{0}' é retornado por referência mas foi inicializado com um valor que não pode ser retornado por referência
ru: Local "{0}" возвращается по ссылке, но инициализирован значением, которое не может быть возвращено по ссылке
zh_hans: 将按引用返回本地“{0}”，但它已初始化为无法按引用返回的值
zh_hant: 藉傳址方式傳回本機 '{0}'，但已將其初始化為無法藉傳址方式傳回的值

# WRN_RefReturnNonreturnableLocal2
source: A member of '{0}' is returned by reference but was initialized to a value that cannot be returned by reference
cs: Člen {0} je vrácen podle odkazu, ale byl inicializován na hodnotu, kterou není možné vrátit podle odkazu
fr: Un membre de '{0}' est retourné par référence, mais il a été initialisé à une valeur qui ne peut pas être retournée par référence
it: Un membro di '{0}' viene restituito dal riferimento ma è stato inizializzato su un valore che non può essere restituito dal riferimento
ja: '{0}' のメンバーは参照渡しで返されますが、参照渡しで返せない値に初期化されました
pl: Składowa elementu „{0}” jest zwracana przez odwołanie, ale została zainicjowana do wartości, która nie może być zwracana przez odwołanie
pt_br: Um membro de '{0}' é retornado por referência, mas foi inicializado com um valor que não pode ser retornado por referência
ru: Элемент "{0}" возвращается по ссылке, но инициализирован значением, которое не может быть возвращено по ссылке
zh_hans: 将按引用返回“{0}”的成员，但它已初始化为无法按引用返回的值
zh_hant: 藉傳址方式傳回 '{0}' 的成員，但已將其初始化為無法藉傳址方式傳回的值

# WRN_RefReturnNonreturnableLocal2_Title
source: A member is returned by reference but was initialized to a value that cannot be returned by reference
cs: Člen je vrácen podle odkazu, ale byl inicializován na hodnotu, kterou není možné vrátit podle odkazu
fr: Un membre est retourné par référence, mais il a été initialisé à une valeur qui ne peut pas être retournée par référence
it: Un membro viene restituito dal riferimento ma è stato inizializzato su un valore che non può essere restituito dal riferimento
ja: メンバーは参照渡しで返されますが、参照渡しで返せない値に初期化されました
pl: Składowa jest zwracana przez odwołanie, ale została zainicjowany do wartości, która nie może być zwracana przez odwołanie
pt_br: Um membro é retornado por referência, mas foi inicializado com um valor que não pode ser retornado por referência
ru: Элемент возвращается по ссылке, но инициализирован значением, которое не может быть возвращено по ссылке.
zh_hans: 将按引用返回成员，但它已初始化为无法按引用返回的值
zh_hant: 藉傳址方式傳回成員，但已將其初始化為無法藉傳址方式傳回的值

# WRN_RefReturnNonreturnableLocal_Title
source: Local is returned by reference but was initialized to a value that cannot be returned by reference
cs: Místní je vráceno podle odkazu, ale bylo inicializováno na hodnotu, kterou není možné vrátit podle odkazu
fr: La variable local est retournée par référence, mais elle a été initialisée à une valeur qui ne peut pas être retournée par référence
it: Locale viene restituito dal riferimento ma è stato inizializzato su un valore che non può essere restituito dal riferimento
ja: ローカル変数は参照渡しで返されますが、参照渡しで返せない値に初期化されました
pl: Nie można zwrócić elementu przez referencję, ponieważ został on zainicjowany przy użyciu wartości, której nie można zwrócić przez referencję
pt_br: Local é retornado por referência, mas foi inicializado com um valor que não pode ser retornado por referência
ru: Local возвращается по ссылке, но инициализирован значением, которое не может быть возвращено по ссылке
zh_hans: 将按引用返回本地，但它已初始化为无法按引用返回的值
zh_hant: 藉傳址方式傳回本機，但已將其初始化為無法藉傳址方式傳回的值

# WRN_RefReturnOnlyParameter
source: This returns a parameter by reference '{0}' through a ref parameter; but it can only safely be returned in a return statement
cs: Vrací parametr podle odkazu {0} prostřednictvím parametru odkazu; je možné ho však bezpečně vrátit pouze v příkazu return.
fr: Retourne un paramètre par référence '{0}' par le biais d’un paramètre ref ; mais il peut uniquement être retourné en toute sécurité dans une instruction return
it: Viene restituito un parametro per riferimento '{0}' tramite un parametro ref; ma può essere restituito in modo sicuro solo in un'istruzione return
ja: これは、ref パラメーター経由で参照渡し '{0}' でパラメーターを返しますが、安全に返すことができるのは return ステートメント内のみです
pl: Zwraca to parametr przez odwołanie „{0}” za pomocą parametru ref, ale można go bezpiecznie zwrócić tylko w instrukcji return
pt_br: Isso retorna um parâmetro por referência '{0}' por meio de um parâmetro ref, mas só pode ser retornado com segurança em uma instrução return
ru: Это возвращает параметр по ссылке "{0}" с помощью параметра ref; однако его можно безопасно вернуть только в операторе return
zh_hans: 这将通过 ref 参数按引用“{0}”来返回参数；但只能在 return 语句中安全返回
zh_hant: 這會透過 ref 參數藉傳址 '{0}' 傳回參數; 但是只能在 return 陳述式中安全地傳回

# WRN_RefReturnOnlyParameter2
source: This returns by reference a member of parameter '{0}' through a ref parameter; but it can only safely be returned in a return statement
cs: Tento příkaz vrací podle odkazu člen parametru {0} prostřednictvím parametru odkazu; je ho však možné bezpečně vrátit pouze v příkazu return
fr: Retourne par référence un membre du paramètre '{0}' via un paramètre ref ; mais il peut uniquement être retourné en toute sécurité dans une instruction return
it: Viene restituito per riferimento un membro del parametro '{0}' tramite un parametro ref; ma può essere restituito in modo sicuro solo in un'istruzione return
ja: これは、ref パラメーター経由でパラメーター '{0}' のメンバーを参照渡しで返しますが、安全に返すことができるのは return ステートメント内のみです
pl: Zwraca to przez odwołanie składową parametru „{0}” za pomocą parametru ref, ale można ją bezpiecznie zwrócić tylko w instrukcji return
pt_br: Isso retorna por referência um membro do parâmetro '{0}' por meio de um parâmetro ref; mas só pode ser retornado com segurança em uma instrução return
ru: Это возвращает по ссылке элемент параметра "{0}" через параметр ref, но его можно безопасно вернуть только в операторе return
zh_hans: 这将通过引用 ref 参数按引用返回参数“{0}”的成员；但它只能在 return 语句中安全返回
zh_hant: 這會透過 ref 參數藉傳址方式傳回參數 '{0}' 的成員; 但是只能在 return 陳述式中安全地傳回

# WRN_RefReturnOnlyParameter2_Title
source: This returns by reference a member of parameter through a ref parameter; but it can only safely be returned in a return statement
cs: Vrací podle odkazu člen parametru prostřednictvím parametru odkazy; je možné jej však bezpečně vrátit pouze v příkazu return.
fr: Retourne par référence un membre du paramètre via un paramètre ref ; mais il peut uniquement être retourné en toute sécurité dans une instruction return
it: Viene restituito per riferimento un membro di parametro tramite un parametro ref; ma può essere restituito in modo sicuro solo in un'istruzione return
ja: これは、ref パラメーター経由でパラメーターのメンバーを参照渡しで返しますが、安全に返すことができるのは return ステートメント内のみです
pl: Zwraca to przez odwołanie składową parametru za pomocą parametru ref; ale można je bezpiecznie zwrócić tylko w instrukcji return
pt_br: Isso retorna por referência um membro do parâmetro por meio de um parâmetro ref; mas só pode ser retornado com segurança em uma instrução return
ru: Это возвращает по ссылке элемент параметра через параметр ref, но его можно безопасно вернуть только в операторе return
zh_hans: 这将通过 ref 参数按引用返回参数的成员；但它只能在 return 语句中安全返回
zh_hant: 這會透過 ref 參數藉傳址方式傳回參數的成員; 但是只能在 return 陳述式中安全地傳回

# WRN_RefReturnOnlyParameter_Title
source: This returns a parameter by reference through a ref parameter; but it can only safely be returned in a return statement
cs: Vrací parametr podle odkazu prostřednictvím parametru odkazu; je možné ho však bezpečně vrátit pouze v příkazu return.
fr: Retourne un paramètre par référence par le biais d’un paramètre ref ; mais il peut uniquement être retourné en toute sécurité dans une instruction return
it: In questo modo viene restituito un parametro ref tramite un parametro di riferimento. ma può essere restituito in modo sicuro solo in un'istruzione return
ja: これは、ref パラメーター経由で参照渡しでパラメーターを返しますが、安全に返すことができるのは return ステートメント内のみです
pl: Zwraca parametr przez odwołanie za pomocą parametru ref; ale można je bezpiecznie zwrócić tylko w instrukcji return
pt_br: Isso retorna um parâmetro por referência por meio de um parâmetro ref; mas só pode ser retornado com segurança em uma instrução return
ru: Это возвращает параметр по ссылке через параметр ref, но его можно безопасно вернуть только в операторе return
zh_hans: 这将通过 ref 参数按引用返回参数；但它只能在 return 语句中安全返回
zh_hant: 這會透過 ref 參數藉傳址方式傳回參數; 但是只能在 return 陳述式中安全地傳回

# WRN_RefReturnParameter
source: This returns a parameter by reference '{0}' but it is not a ref parameter
cs: Vrací parametr podle odkazu {0}, ale nejedná se o parametr odkazu
fr: Retourne un paramètre par référence '{0}', mais il ne s’agit pas d’un paramètre ref
it: Viene restituito un parametro per riferimento '{0}' ma non è un parametro ref
ja: これは、参照返し '{0}' でパラメーターを返しますが、ref パラメーターではありません
pl: Zwraca parametr przez odwołanie „{0}”, ale nie jest to parametr ref
pt_br: Isso retorna um parâmetro por referência '{0}' mas não é um parâmetro ref
ru: Это возвращает параметр по ссылке "{0}", но это не является параметром ref
zh_hans: 这将按引用“{0}”返回参数，但它不是 ref 参数
zh_hant: 這會藉傳址方式 '{0}' 傳回參數，但其非 ref 參數

# WRN_RefReturnParameter2
source: This returns by reference a member of parameter '{0}' that is not a ref or out parameter
cs: Vrací podle odkazu člen parametru {0}, který není parametrem odkazu nebo out.
fr: Retourne par référence un membre du paramètre '{0}' qui n’est pas un paramètre ref ou out
it: Restituisce per riferimento un membro del parametro '{0}' che non è un parametro ref o out
ja: これは、ref パラメーターでも out パラメーターでもないパラメーター '{0}' のメンバーを参照渡しで返します
pl: Zwraca to przez odwołanie składową parametru „{0}”, który nie jest parametrem ref ani out
pt_br: Isso retorna por referência um membro do parâmetro '{0}' que não é um parâmetro ref ou out
ru: Это возвращает по ссылке элемент параметра "{0}", который не является параметром ref или out
zh_hans: 这将按引用返回不是 ref 或 out 参数的参数“{0}”的成员
zh_hant: 這會藉傳址方式傳回參數 '{0}' 的成員，其不是 ref 或 out 參數

# WRN_RefReturnParameter2_Title
source: This returns by reference a member of parameter that is not a ref or out parameter
cs: Vrací podle odkazu člen parametru, který není parametrem odkazu nebo out
fr: Retourne par référence un membre du paramètre qui n’est pas un paramètre ref ou out
it: Restituisce per riferimento un membro di parametro che non è un parametro ref o out
ja: これは、ref パラメーターでも out パラメーターでもないパラメーターのメンバーを参照渡しで返します
pl: Zwraca to przez odwołanie składową parametru, który nie jest parametrem ref ani out
pt_br: Isso retorna por referência um membro do parâmetro que não é um parâmetro ref ou out
ru: Это возвращает по ссылке элемент параметра, не являющийся параметром ref или out.
zh_hans: 这将按引用返回不是 ref 或 out 参数的参数成员
zh_hant: 這會藉傳址方式傳回參數的成員，其不是 ref 或 out 參數

# WRN_RefReturnParameter_Title
source: This returns a parameter by reference but it is not a ref parameter
cs: Vrací parametr podle odkazu, ale nejedná se o parametr odkazu
fr: Retourne un paramètre par référence, mais il ne s’agit pas d’un paramètre ref
it: Restituisce un parametro per riferimento, ma non è un parametro ref
ja: これは、参照返しでパラメーターを返しますが、ref パラメーターではありません
pl: Zwraca parametr przez odwołanie, ale nie jest parametrem ref
pt_br: Isso retorna um parâmetro por referência, mas não é um parâmetro ref
ru: Это возвращает параметр по ссылке, но это не параметр ref
zh_hans: 这会按引用返回一个参数，但它不是 ref 参数
zh_hant: 這會藉傳址方式傳回參數，但其非 ref 參數

# WRN_RefReturnScopedParameter
source: This returns a parameter by reference '{0}' but it is scoped to the current method
cs: Vrací parametr pomocí odkazu {0}, ale má obor vymezený na aktuální metodu
fr: Retourne un paramètre par référence '{0}' mais il est étendu à la méthode actuelle
it: Viene restituito un parametro per riferimento '{0}' ma l'ambito è impostato sul metodo corrente
ja: これは参照渡し '{0}' でパラメーターを返しますが、現在のメソッドに範囲設定されています
pl: Spowoduje to zwrócenie parametru przez odwołanie „{0}”, ale jest on ograniczony do bieżącej metody
pt_br: Isso retorna um parâmetro por referência '{0}' mas está no escopo do método atual
ru: Это возвращает параметр по ссылке "{0}", но он находится в области действия текущего метода
zh_hans: 这将按引用“{0}”返回参数，但它的作用域为当前方法
zh_hant: 這會藉傳址 '{0}' 傳回參數，但範圍限於目前的方法

# WRN_RefReturnScopedParameter2
source: This returns by reference a member of parameter '{0}' that is scoped to the current method
cs: Vrací podle odkazu člen parametru {0}, který je přiřazen k aktuální metodě
fr: Retourne par référence un membre du paramètre '{0}' qui est étendu à la méthode actuelle
it: Viene restituito per riferimento un membro del parametro '{0}' con ambito al metodo corrente
ja: これは、現在のメソッドに範囲指定されているパラメーター '{0}' のメンバーを参照渡しで返します
pl: Zwraca to przez odwołanie składową parametru „{0}” w zakresie do bieżącej metody
pt_br: Isso retorna por referência um membro do parâmetro '{0}' que está no escopo do método atual
ru: Это возвращает по ссылке элемент параметра "{0}", который имеет область действия текущего метода
zh_hans: 这将按引用返回作用域为当前方法的参数“{0}”的成员
zh_hant: 這會藉傳址方式傳回參數 '{0}' 的成員，其範圍是目前的方法

# WRN_RefReturnScopedParameter2_Title
source: This returns by reference a member of parameter that is scoped to the current method
cs: Vrací podle odkazu člen parametru, který je přiřazen k aktuální metodě.
fr: Retourne par référence un membre du paramètre qui est étendu à la méthode actuelle
it: Viene restituito per riferimento un membro del parametro con ambito al metodo corrente
ja: これは、現在のメソッドに範囲指定されているパラメーターのメンバーを参照渡しで返します
pl: Zwraca to przez odwołanie składową parametru o zakresie do bieżącej metody
pt_br: Isso retorna por referência um membro do parâmetro com escopo para o método atual
ru: Это возвращает по ссылке элемент параметра, относящийся к текущему методу
zh_hans: 这将按引用返回作用域为当前方法的参数的成员
zh_hant: 這會藉傳址方式傳回參數的成員，其範圍是目前的方法

# WRN_RefReturnScopedParameter_Title
source: This returns a parameter by reference but it is scoped to the current method
cs: Vrací parametr pomocí odkazu, ale má obor vymezený na aktuální metodu
fr: Retourne un paramètre par référence, mais il est étendu à la méthode actuelle
it: In questo modo viene restituito un parametro per riferimento, ma l'ambito è limitato al metodo corrente
ja: これは参照渡しでパラメーターを返しますが、現在のメソッドに範囲設定されています
pl: Spowoduje to zwrócenie parametru przez referencję, ale jego zakres jest ograniczony do bieżącej metody
pt_br: Isso retorna um parâmetro por referência, mas está no escopo do método atual
ru: Это возвращает параметр по ссылке, но он привязан к текущему методу.
zh_hans: 这会按引用返回一个参数，但它的作用域为当前方法
zh_hant: 這會藉傳址方式傳回參數，但範圍限於目前的方法

# WRN_RefReturnStructThis
source: Struct member returns 'this' or other instance members by reference
cs: Člen struktury vrací this nebo jiné členy instance pomocí odkazu
fr: Le membre struct retourne 'this' ou d'autres membres d'instance par référence
it: Il membro struct restituisce 'questo' o altri membri di istanza per riferimento
ja: 構造体メンバーは 'this' または他のインスタンス メンバーを参照渡しで返します
pl: Składowa struktury zwraca element „this” lub inne składowe wystąpienia według odwołania
pt_br: O membro do struct retorna 'this' ou outros membros da instância por referência
ru: Элемент структуры возвращает "этот" или другие элементы экземпляра по ссылке
zh_hans: 结构成员按引用返回“此”或其他实例成员
zh_hant: 結構成員藉傳址方式傳回 'this' 或其他執行個體成員

# WRN_RefReturnStructThis_Title
source: Struct member returns 'this' or other instance members by reference
cs: Člen struktury vrací this nebo jiné členy instance pomocí odkazu
fr: Le membre struct retourne 'this' ou d'autres membres d'instance par référence
it: Il membro struct restituisce 'questo' o altri membri di istanza per riferimento
ja: 構造体メンバーは 'this' または他のインスタンス メンバーを参照渡しで返します
pl: Składowa struktury zwraca element „this” lub inne składowe wystąpienia według odwołania
pt_br: O membro do struct retorna 'this' ou outros membros da instância por referência
ru: Элемент структуры возвращает "этот" или другие элементы экземпляра по ссылке
zh_hans: 结构成员按引用返回“此”或其他实例成员
zh_hant: 結構成員藉傳址方式傳回 'this' 或其他執行個體成員

# WRN_ReturnNotNullIfNotNull
source: Return value must be non-null because parameter '{0}' is non-null.
cs: Návratová hodnota musí být jiná než null, protože parametr {0} není null.
fr: La valeur de retour doit être non null, car le paramètre '{0}' a une valeur non null.
it: Il valore restituito deve essere non Null perché il parametro '{0}' è non Null.
ja: パラメーター '{0}' が null 以外であるため、戻り値は null 以外でなければなりません。
pl: Wartość zwracana musi być inna niż null, ponieważ parametr „{0}” ma wartość inną niż null.
pt_br: O valor retornado precisa ser não nulo porque o parâmetro '{0}' não é nulo.
ru: Возвращаемое значение должно быть отлично от NULL, так как параметр "{0}" имеет значение, отличное от NULL.
zh_hans: 返回值必须为非 null，因为参数“{0}”为非 null。
zh_hant: 因為參數 '{0}' 不是 null，所以傳回值必須非 null。
