Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DupParamMod
source: A parameter can only have one '{0}' modifier
cs: Parametr může mít jenom jeden modifikátor {0}.
de: Ein Parameter kann nur einen "{0}"-Modifizierer aufweisen.
es: Un parámetro solo puede tener un modificador '{0}'
fr: Un paramètre ne peut avoir qu'un seul modificateur '{0}'
it: Un parametro può avere un solo modificatore '{0}'
ja: パラメーターには '{0}' 修飾子を 1 つだけ指定できます
ko: 매개 변수에는 '{0}' 한정자 하나만 사용할 수 있습니다.
pl: Parametr może mieć tylko jeden modyfikator „{0}”
pt_br: Um parâmetro pode somente ter um modificador "{0}"
ru: Параметр может иметь только один модификатор "{0}".
tr: Bir parametrenin yalnızca '{0}' değiştiricisi olabilir
zh_hans: 参数只能有一个“{0}”修饰符
zh_hant: 參數只能有一個 '{0}' 修飾元

# ERR_ExtensionMethodsDecl
source: Extension methods must be defined in a top level static class; {0} is a nested class
cs: Metody rozšíření musí být definované ve statické třídě nejvyšší úrovně; {0} je vnořená třída.
de: Die Erweiterungsmethoden müssen in statischen Klassen auf oberster Ebene definiert werden. "{0}" ist eine geschachtelte Klasse.
es: Los métodos de extensión deben definirse en una clase estática de nivel superior; {0} es una clase anidada
fr: Les méthodes d'extension doivent être définies dans une classe statique de niveau supérieur ; {0} est une classe imbriquée
it: I metodi di estensione devono essere definiti in una classe statica di primo livello, mentre {0} è una classe annidata
ja: 拡張メソッドは、トップ レベルの静的クラスで定義される必要があります。{0} は入れ子にされたクラスです
ko: 확장 메서드는 최상위 정적 클래스에 정의해야 합니다. {0}은(는) 중첩된 클래스입니다.
pl: Metody rozszerzenia muszą być zdefiniowane w statycznych klasach najwyższego poziomu. „{0}” to klasa zagnieżdżona
pt_br: Métodos de extensão devem ser definidos em uma classe estática de nível superior; {0} é uma classe aninhada
ru: Методы расширения должны быть определены в статическом классе верхнего уровня; {0} является вложенным классом.
tr: Genişletme yöntemleri en üst düzey bir statik sınıfta tanımlanmalıdır; {0} iç içe yerleştirilmiş bir sınıftır
zh_hans: 扩展方法必须在顶级静态类中定义；{0} 是嵌套类
zh_hant: 擴充方法必須定義在最上層靜態類別中; {0} 為巢狀類別

# ERR_ExtensionAttrNotFound
source: Cannot define a new extension because the compiler required type '{0}' cannot be found. Are you missing a reference to System.Core.dll?
it: Non è possibile definire un nuovo metodo di estensione perché non è stato trovato il tipo '{0}' richiesto dal compilatore. Probabilmente manca un riferimento.
pt_br: Não é possível definir uma nova extensão porque o tipo necessário do compilador "{0}" não foi encontrado. Está faltando uma referência a System.Core.dll?
ru: Не удается определить новый метод расширения, так как не найден требуемый компилятором тип "{0}". Возможно, отсутствует ссылка на System.Core.dll
zh_hans: 无法定义新的扩展方法，因为找不到编译器需要的类型“{0}”。是否缺少对 System.Core.dll 的引用?

# ERR_ExplicitExtension
source: Do not use 'System.Runtime.CompilerServices.ExtensionAttribute'. Use the 'this' keyword instead.
cs: Nepoužívejte System.Runtime.CompilerServices.ExtensionAttribute. Místo toho použijte klíčové slovo this.
de: Verwenden Sie "System.Runtime.CompilerServices.ExtensionAttribute" nicht. Verwenden Sie stattdessen das Schlüsselwort "this".
es: No use 'System.Runtime.CompilerServices.ExtensionAttribute'. Use la palabra clave 'this' en su lugar.
fr: N'utilisez pas 'System.Runtime.CompilerServices.ExtensionAttribute'. Utilisez plutôt le mot clé 'this'.
it: Non usare 'System.Runtime.CompilerServices.ExtensionAttribute'. Usare la parola chiave 'this'.
ja: System.Runtime.CompilerServices.ExtensionAttribute' を使用しないでください。キーワード 'this' を使用してください。
ko: System.Runtime.CompilerServices.ExtensionAttribute' 대신 'this' 키워드를 사용하세요.
pl: Nie używaj „System.Runtime.CompilerServices.ExtensionAttribute”. Zamiast niego użyj słowa kluczowego „this”.
pt_br: Não use "System.Runtime.CompilerServices.ExtensionAttribute". Em vez disso, use a palavra-chave "this".
ru: Не используйте "System.Runtime.CompilerServices.ExtensionAttribute". Используйте вместо этого ключевое слово "this".
tr: System.Runtime.CompilerServices.ExtensionAttribute' kullanmayın. Bunun yerine 'this' anahtar sözcüğünü kullanın.
zh_hans: 不要使用“System.Runtime.CompilerServices.ExtensionAttribute”。请改用“this”关键字。
zh_hant: 請勿使用 'System.Runtime.CompilerServices.ExtensionAttribute'。請改用 'this' 關鍵字。

# ERR_ExplicitDynamicAttr
source: Do not use 'System.Runtime.CompilerServices.DynamicAttribute'. Use the 'dynamic' keyword instead.
cs: Nepoužívejte System.Runtime.CompilerServices.DynamicAttribute. Místo toho použijte klíčové slovo dynamic.
de: Verwenden Sie "System.Runtime.CompilerServices.DynamicAttribute" nicht. Verwenden Sie stattdessen das Schlüsselwort "dynamic".
es: No use 'System.Runtime.CompilerServices.DynamicAttribute'. Use la palabra clave 'dynamic' en su lugar.
fr: N'utilisez pas 'System.Runtime.CompilerServices.DynamicAttribute'. Utilisez plutôt le mot clé 'dynamic'.
it: Non usare 'System.Runtime.CompilerServices.DynamicAttribute'. Usare la parola chiave 'dynamic'.
ja: System.Runtime.CompilerServices.DynamicAttribute' は使用しないでください。キーワード 'dynamic' を使用してください。
ko: System.Runtime.CompilerServices.DynamicAttribute' 대신 'dynamic' 키워드를 사용하세요.
pl: Nie używaj „System.Runtime.CompilerServices.DynamicAttribute”. Zamiast niego użyj słowa kluczowego „dynamic”.
pt_br: Não use "System.Runtime.CompilerServices.DynamicAttribute". Em vez disso, use a palavra-chave "dynamic".
ru: Не используйте "System.Runtime.CompilerServices.DynamicAttribute". Используйте вместо этого ключевое слово "dynamic".
tr: System.Runtime.CompilerServices.DynamicAttribute' kullanmayın. Bunun yerine 'dynamic' anahtar sözcüğünü kullanın.
zh_hans: 不要使用“System.Runtime.CompilerServices.DynamicAttribute”。请改用“dynamic”关键字。
zh_hant: 請勿使用 'System.Runtime.CompilerServices.DynamicAttribute'。請改用 'dynamic' 關鍵字。

# ERR_NoDynamicPhantomOnBaseCtor
source: The constructor call needs to be dynamically dispatched, but cannot be because it is part of a constructor initializer. Consider casting the dynamic arguments.
cs: Volání konstruktoru je nutné volat dynamicky, což ale není možné, protože je součástí inicializátoru konstruktoru. Zvažte použití dynamických argumentů.
de: Der Konstruktoraufruf muss dynamisch gebunden werden. Dies ist aber nicht möglich, da er Teil eines Konstruktorinitialisierers ist. Wandeln Sie die dynamischen Argumente um.
es: La llamada de constructor debe enviarse de forma dinámica, pero no se puede porque forma parte de un inicializador de constructor. Puede convertir los argumentos dinámicos.
fr: L'appel du constructeur doit être dispatché dynamiquement, mais ne peut pas l'être car il fait partie d'un initialiseur de constructeur. Effectuez un cast des arguments dynamiques.
it: Non è possibile eseguire l'invio dinamico richiesto della chiamata al costruttore perché la chiamata fa parte di un inizializzatore del costruttore. Provare a eseguire il cast degli argomenti dinamici.
ja: コンストラクターの呼び出しは動的ディスパッチされる必要がありますが、この呼び出しはコンストラクター初期化子の一部であるためディスパッチできません。動的な引数をキャストしてください。
ko: 생성자 호출을 동적으로 디스패치해야 하지만 해당 호출이 생성자 이니셜라이저의 일부이므로 동적으로 디스패치할 수 없습니다. 동적 인수를 캐스팅하십시오.
pl: Wywołanie konstruktora musi być przydzielane dynamicznie, ale jest to niemożliwe, ponieważ jest częścią inicjatora konstruktora. Rozważ możliwość rzutowania argumentów dynamicznych.
pt_br: A chamada de construtor deve ser vinculada dinamicamente, mas isso não é possível porque ela faz parte de um inicializador de construtor. Converta os argumentos dinâmicos.
ru: Не удается выполнить требуемую для вызова конструктора динамическую диспетчеризацию, поскольку этот вызов является частью инициализатора конструктора. Попробуйте привести динамические аргументы.
tr: Oluşturucu çağrısının dinamik olarak dağıtılması gerekiyor, ancak bir oluşturucu başlatıcısının parçası olduğundan dağıtılamıyor. Dinamik bağımsız değişkenlere tür atamayı düşünün.
zh_hans: 构造函数调用需要进行动态调度，但无法如此，因为它是构造函数初始值的一部分。请考虑强制转换动态参数。
zh_hant: 建構函式呼叫必須以動態方式分派，但因為其為建構函式初始設定式的一部分，所以無法動態分派。請考慮將動態引數轉型。

# ERR_ValueTypeExtDelegate
source: Extension method '{0}' defined on value type '{1}' cannot be used to create delegates
cs: Metoda rozšíření {0} definovaná v hodnotovém typu {1} se nedá použít k vytváření delegátů.
de: Die im Werttyp "{1}" definierte Erweiterungsmethode "{0}" kann nicht zum Erstellen von Delegaten verwendet werden.
es: Los métodos de extensión '{0}' definidos en el tipo de valor '{1}' no se pueden usar para crear delegados
fr: La méthode d'extension '{0}' définie dans le type valeur '{1}' ne peut pas être utilisée pour créer des délégués
it: Non è possibile usare il metodo di estensione '{0}' definito nel tipo di valore '{1}' per creare delegati
ja: 値の型 '{1}' で定義された拡張メソッド '{0}' は、デリゲートを作成するために使用できません
ko: 값 형식 '{1}'에 정의된 확장 메서드 '{0}'은(는) 대리자를 만드는 데 사용할 수 없습니다.
pl: Metody rozszerzenia „{0}” zdefiniowanej dla typu wartości „{1}” nie można użyć do tworzenia delegatów
pt_br: Método de extensão "{0}" definido no tipo de valor "{1}" não pode ser usado para criar representantes
ru: Методы расширения "{0}", определенные на типе значения "{1}", не могут применяться для создания делегатов.
tr: {1}' değer türünde tanımlanan '{0}' genişleme yöntemi temsilci oluşturmak için kullanılamaz
zh_hans: 不能使用值类型“{1}”上定义的扩展方法“{0}”来创建委托
zh_hant: 實值類型 '{1}' 上定義的擴充方法 '{0}'，無法用以建立委派

# ERR_BadArgCount
source: No overload for method '{0}' takes {1} arguments
cs: Žádné přetížení pro metodu {0} nepřevezme tento počet argumentů: {1}.
de: Keine Überladung für die {0}-Methode nimmt {1} Argumente an.
es: Ninguna sobrecarga para el método '{0}' toma {1} argumentos
fr: Aucune surcharge pour la méthode '{0}' n'accepte les arguments {1}
it: Nessun overload del metodo '{0}' accetta {1} argomenti
ja: 引数 {1} を指定するメソッド '{0}' のオーバーロードはありません
ko: 인수 {1}개를 사용하는 '{0}' 메서드에 대한 오버로드가 없습니다.
pl: Żadne przeładowanie metody „{0}” nie pobiera następującej liczby argumentów: „{1}”
pt_br: Nenhuma sobrecarga para o método "{0}" leva {1} argumentos
ru: Ни одна из перегрузок метода "{0}" не принимает {1} аргументов.
tr: {0}' yöntemi için hiçbir tekrar yükleme {1} bağımsız değişken almaz
zh_hans: “{0}”方法没有采用 {1} 个参数的重载
zh_hant: 方法 '{0}' 沒有任何多載使用 {1} 個引數

# ERR_BadArgType
source: Argument {0}: cannot convert from '{1}' to '{2}'
cs: Argument {0}: Nejde převést z {1} na {2}.
de: Argument "{0}": Konvertierung von "{1}" in "{2}" nicht möglich.
es: Argumento {0}: no se puede convertir de '{1}' a '{2}'
fr: Argument {0} : conversion impossible de '{1}' en '{2}'
it: Argomento {0}: non è possibile convertire da '{1}' a '{2}'
ja: 引数 {0}: は '{1}' から '{2}' へ変換することはできません
ko: {0} 인수: '{1}'에서 '{2}'(으)로 변환할 수 없습니다.
pl: Argument „{0}”: nie można przekonwertować z „{1}” na „{2}”
pt_br: Argumento {0}: não é possível converter de "{1}" para "{2}"
ru: Аргумент {0}: не удается преобразовать из "{1}" в "{2}".
tr: {0} bağımsız değişkeni: '{1}' öğesinden '{2}' öğesine dönüştürülemiyor
zh_hans: 参数 {0}: 无法从“{1}”转换为“{2}”
zh_hant: 引數 {0}: 無法從 '{1}' 轉換成 '{2}'

# ERR_NoSourceFile
source: Source file '{0}' could not be opened -- {1}
cs: Zdrojový soubor {0} nešel otevřít -- {1}
de: Die Quelldatei "{0}" konnte nicht geöffnet werden: {1}
es: No se pudo abrir el archivo de origen '{0}': {1}
fr: Impossible d'ouvrir le fichier source '{0}' -- {1}
it: Non è possibile aprire il file di origine '{0}' - '{1}'
ja: ソース ファイル '{0}' を開くことができませんでした -- {1}
ko: {0}' 소스 파일을 열 수 없습니다. {1}
pl: Nie można otworzyć pliku źródłowego „{0}” — {1}
pt_br: Arquivo de origem "{0}" não pode ser aberto -- {1}
ru: Не удалось открыть исходный файл "{0}" — {1}.
tr: {0}' kaynak dosyası açılamadı -- {1}
zh_hans: 无法打开源文件“{0}”-- {1}
zh_hant: 無法開啟原始程式檔 '{0}' -- {1}

# ERR_CantRefResource
source: Cannot link resource files when building a module
cs: Při sestavování modulu nejde propojit soubory prostředků.
de: Beim Erstellen eines Moduls ist eine Verknüpfung mit Ressourcendateien nicht möglich.
es: No se puede vincular archivos de recursos al compilar un módulo
fr: Impossible de lier des fichiers de ressources lors de la création d'un module
it: Non è possibile collegare i file di risorse durante la compilazione di un modulo
ja: モジュールをビルド中にリソース ファイルにリンクできません
ko: 모듈을 빌드하는 동안 리소스 파일을 링크할 수 없습니다.
pl: Nie można połączyć plików zasobów podczas kompilowania modułu
pt_br: Não é possível vincular arquivos de recursos ao criar um módulo
ru: Не удается связать файлы ресурсов при сборке модуля.
tr: Modül oluşturulurken kaynak dosyaları bağlanamaz
zh_hans: 生成模块时，无法链接资源文件
zh_hant: 建立模組時無法連結資源檔案

# ERR_ResourceNotUnique
source: Resource identifier '{0}' has already been used in this assembly
cs: Identifikátor prostředku {0} se už v tomto sestavení používá.
de: Der Ressourcenbezeichner "{0}" wurde in dieser Assembly bereits verwendet.
es: El identificador de recurso '{0}' ya se ha usado en este ensamblado
fr: L'identificateur de ressource '{0}' a déjà été utilisé dans cet assembly
it: L'identificatore di risorsa '{0}' è già stato usato in questo assembly
ja: リソース識別子 '{0}' は既にこのアセンブリで使用されています
ko: {0}' 리소스 식별자가 이 어셈블리에 이미 사용되었습니다.
pl: Identyfikator zasobu „{0}” został już użyty w tym zestawie
pt_br: Identificador de recurso "{0}" já foi usado neste assembly
ru: Идентификатор ресурса "{0}" в этой сборке уже использован.
tr: {0}' kaynak tanımlayıcısı bu derlemede zaten kullanılmış
zh_hans: 此程序集中已使用了资源标识符“{0}”
zh_hant: 在此組件中已使用了資源識別項 '{0}'

# ERR_ResourceFileNameNotUnique
source: Each linked resource and module must have a unique filename. Filename '{0}' is specified more than once in this assembly
cs: Každý propojený prostředek a modul musí mít jedinečný název souboru, ale {0} se v tomto sestavení objevuje víc než jednou.
de: Alle verknüpften Ressourcen und Module müssen einen eindeutigen Dateinamen haben. Der Dateiname "{0}" wurde in dieser Assembly mehrfach angegeben.
es: Los recursos y módulos vinculados deben tener un nombre de archivo único. El nombre de archivo '{0}' se ha especificado más de una vez en este ensamblado
fr: Chaque ressource et module liés doivent avoir un nom de fichier unique. Le nom de fichier '{0}' est indiqué plusieurs fois dans cet assembly
it: Ogni risorsa e ogni modulo collegato devono avere un nome file univoco. Il nome file '{0}' è specificato più di una volta in questo assembly
ja: リンクされたリソースとモジュールにはそれぞれ、一意のファイル名があります。ファイル名 '{0}' はこのアセンブリで複数回指定されています。
ko: 링크된 각 리소스와 모듈에는 고유한 파일 이름이 있어야 합니다. '{0}' 파일 이름은 이 어셈블리에 두 번 이상 지정되었습니다.
pl: Nazwa pliku każdego połączonego zasobu i modułu musi być unikatowa. Nazwę pliku „{0}” określono więcej niż raz w tym zestawie.
pt_br: Cada módulo ou recurso vinculado devem ter um nome de arquivo exclusivo. Nome de arquivo "{0}" é especificado mais de uma vez neste assembly
ru: Каждый связанный ресурс и модуль должны иметь уникальное имя файла. Имя файла "{0}" определено более одного раза в этой сборке.
tr: Her bağlı kaynağın ve modülün benzersiz tanımlayıcısı olması gerekir. Dosya adı '{0}' bu derlemede birden çok kez belirtildi
zh_hans: 每个链接资源和模块必须具有唯一的文件名。在此程序集中多次指定了文件名 {0}
zh_hant: 每個連結資源與模組，都必須要有不重複的檔案名稱。在此組件中指定了一次以上的檔案名稱 '{0}'。

# ERR_ImportNonAssembly
source: The referenced file '{0}' is not an assembly
cs: Odkazovaný soubor {0} není sestavení.
de: Die referenzierte Datei "{0}" ist keine Assembly.
es: El archivo '{0}' al que se hace referencia no es un ensamblado
fr: Le fichier référencé '{0}' n'est pas un assembly
it: Il file di riferimento '{0}' non è un assembly
ja: 参照したファイル '{0}' はアセンブリではありません
ko: 참조된 '{0}' 파일은 어셈블리가 아닙니다.
pl: Przywoływany plik „{0}” nie jest zestawem
pt_br: O arquivo referenciado "{0}" não é um assembly
ru: Файл "{0}", на который дается ссылка, не является сборкой.
tr: {0}' başvurulan dosyası bir derleme değil
zh_hans: 引用的文件“{0}”不是程序集
zh_hant: 參考檔 '{0}' 不是組件

# ERR_RefLvalueExpected
source: A ref or out value must be an assignable variable
cs: Hodnotou Ref nebo Out musí být proměnná s možností přiřazení hodnoty.
de: Ein ref- oder out-Wert muss eine zuweisbare Variable sein.
es: Un valor out o ref debe ser una variable asignable.
fr: Une valeur ref ou out doit être une variable qui peut être assignée
it: Un valore out o ref deve essere una variabile assegnabile
ja: ref または out 値は、割り当て可能な変数でなければなりません
ko: ref 또는 out 값은 할당 가능한 변수여야 합니다.
pl: Wartość ref lub out musi być zmienną umożliwiającą przypisanie
pt_br: Um valor ref ou out deve ser uma variável que possa ser atribuída
ru: Значения ref или out должно быть переменной, которой можно присвоить значение
tr: Bir ref veya out değeri, atanabilir bir değişken olmalıdır
zh_hans: ref 或 out 值必须是可以赋值的变量
zh_hant: ref 或 out 值必須是可指派的值

# ERR_BaseInStaticMeth
source: Keyword 'base' is not available in a static method
cs: Klíčové slovo base není k dispozici uvnitř statické metody.
de: Das base-Schlüsselwort ist in einer statischen Methode nicht verfügbar.
es: La palabra clave 'base' no está disponible en ningún método estático
fr: Le mot clé 'base' n'est pas disponible dans une méthode statique
it: La parola chiave 'base' non è disponibile in un metodo statico
ja: キーワード 'base' は静的メソッドでは使用できません
ko: base' 키워드는 정적 메서드에서 사용할 수 없습니다.
pl: W metodzie statycznej słowo kluczowe „base” jest niedostępne.
pt_br: A palavra-chave 'base' não está disponível em um método estático
ru: Ключевое слово "base" неприменимо в статическом методе.
tr: base' anahtar sözcüğü statik yöntemde kullanılamaz
zh_hans: 关键字“base”在静态方法中不可用
zh_hant: 關鍵字 'base' 在靜態方法中無效

# ERR_BaseInBadContext
source: Keyword 'base' is not available in the current context
cs: Klíčové slovo base není k dispozici v aktuálním kontextu.
de: Das base-Schlüsselwort ist im aktuellen Kontext nicht verfügbar.
es: La palabra clave 'base' no está disponible en el contexto actual
fr: Le mot clé 'base' n'est pas disponible dans le contexte actuel
it: La parola chiave 'base' non è disponibile nel contesto corrente
ja: キーワード 'base' は現在のコンテキストでは使用できません
ko: base' 키워드는 현재 컨텍스트에서 사용할 수 없습니다.
pl: W bieżącym kontekście słowo kluczowe „base” jest niedostępne
pt_br: A palavra-chave 'base' não está disponível no contexto atual
ru: Ключевое слово "base" неприменимо в текущем контексте.
tr: base' anahtar sözcüğü bu bağlamda kullanılamaz
zh_hans: 关键字“base”在当前上下文中不可用
zh_hant: 在目前的內容中無法使用關鍵字 'base'

# ERR_RbraceExpected
source: } expected
cs: Očekával se znak }.
de: } erwartet.
es: Se esperaba }
fr: } attendue
it: È previsto il segno }
ja: } が必要です
ko: }가 필요합니다.
pl: Oczekiwano znaku }
pt_br: } esperada
ru: Требуется "}"
tr: } bekleniyor
zh_hans: 应输入 }
zh_hant: 必須是 }

# ERR_LbraceExpected
source: { expected
cs: Očekával se znak {.
de: { erwartet.
es: Se esperaba {
fr: { attendue
it: È previsto il segno {
ja: { が必要です
ko: {가 필요합니다.
pl: Oczekiwano znaku {
pt_br: { esperado
ru: Требуется "{"
tr: { bekleniyor
zh_hans: 应为 {
zh_hant: 必須是 {

# ERR_InExpected
source: 'in' expected
cs: 'Očekávalo se klíčové slovo in.
de: '"in" erwartet.
es: 'Se esperaba 'in'
fr: 'in' attendu
it: 'È previsto 'in'
ja: 'in' が必要です
ko: 'in'이 필요합니다.
pl: 'Oczekiwano słowa kluczowego „in”
pt_br: 'in' esperado
ru: 'Требуется "in"
tr: 'in' bekleniyor
zh_hans: '应为 "in"
zh_hant: '必須是 'in'

# ERR_InvalidPreprocExpr
source: Invalid preprocessor expression
cs: Neplatný výraz preprocesoru
de: Ungültiger Präprozessorausdruck.
es: Expresión de preprocesador no válida
fr: Expression de préprocesseur non valide
it: Espressione per il preprocessore non valida
ja: 無効なプリプロセッサの式です
ko: 전처리기 식이 잘못되었습니다.
pl: Nieprawidłowe wyrażenie preprocesora
pt_br: Expressão de pré-processamento inválida
ru: Недопустимое выражение препроцессора.
tr: Geçersiz önişlemci ifadesi
zh_hans: 无效的预处理器表达式
zh_hant: 前置處理器運算式無效

# ERR_InvalidMemberDecl
source: Invalid token '{0}' in a member declaration
it: Il token '{0}' nella dichiarazione del membro di classe, record, struct o interfaccia non è valido
pt_br: Token inválido "{0}" em uma declaração de membro
ru: Недопустимый токен "{0}" в объявлении класса, записи, структуры или элемента интерфейса
zh_hans: 类、记录、结构或接口成员声明中的标记“{0}”无效

# ERR_MemberNeedsType
source: Method must have a return type
cs: Metoda musí mít typ vrácené hodnoty.
de: Die Methode muss einen Rückgabetyp besitzen.
es: El método debe tener un tipo de valor devuelto
fr: La méthode doit avoir un type de retour
it: Il metodo deve avere un tipo restituito
ja: メソッドは戻り値の型を持たなければなりません
ko: 메서드에는 반환 형식이 있어야 합니다.
pl: Metoda musi mieć typ zwracany.
pt_br: O método deve ter um tipo de retorno
ru: Метод должен иметь тип возвращаемого значения
tr: Yöntemin bir dönüş türü olmalıdır
zh_hans: 方法必须具有返回类型
zh_hant: 方法必須要有傳回類型

# ERR_BadBaseType
source: Invalid base type
cs: Neplatný základní typ
de: Ungültiger Basistyp.
es: Tipo base no válido
fr: Type de base non valide
it: Il tipo di base non è valido
ja: 無効な基本型です
ko: 기본 형식이 잘못되었습니다.
pl: Nieprawidłowy typ podstawowy
pt_br: Tipo base inválido
ru: Недопустимый базовый тип.
tr: Geçersiz temel tür
zh_hans: 无效的基类型
zh_hant: 基底類型無效

# WRN_EmptySwitch
source: Empty switch block
cs: Prázdný blok switch
de: Leerer Schalterblock.
es: Bloque switch vacío
fr: Bloc switch vide
it: Il blocco switch è vuoto
ja: 空の switch ブロックです
ko: 빈 스위치 블록입니다.
pl: Pusty blok „switch”
pt_br: Bloco switch vazio
ru: Пустой блок switch
tr: Boş switch bloğu
zh_hans: 空的 switch 块
zh_hant: 空的 switch 區塊

# WRN_EmptySwitch_Title
source: Empty switch block
cs: Prázdný blok switch
de: Leerer Schalterblock.
es: Bloque switch vacío
fr: Bloc switch vide
it: Il blocco switch è vuoto
ja: 空の switch ブロックです
ko: 빈 스위치 블록입니다.
pl: Pusty blok „switch”
pt_br: Bloco switch vazio
ru: Пустой блок switch
tr: Boş switch bloğu
zh_hans: 空的 switch 块
zh_hant: 空的 switch 區塊

# ERR_ExpectedEndTry
source: Expected catch or finally
cs: Očekávalo se klíčové slovo catch nebo finally.
de: "catch" oder "finally" erwartet.
es: Se esperaba catch o finally
fr: Catch ou finally attendu
it: È previsto un blocco catch o finally
ja: catch または finally が必要です
ko: catch 또는 finally가 필요합니다.
pl: Oczekiwano instrukcji „catch” lub „finally”.
pt_br: Catch ou finally esperado
ru: Требуется catch или finally.
tr: Catch veya finally bekleniyor
zh_hans: 应输入 catch 或 finally
zh_hant: 必須是 catch 或 finally

# ERR_InvalidExprTerm
source: Invalid expression term '{0}'
cs: Neplatný výraz {0}
de: Ungültiger Ausdruck "{0}".
es: El término de expresión '{0}' no es válido
fr: Terme d'expression '{0}' non valide
it: '{0}' non è un termine valido nell'espressione
ja: '{0}' は無効です
ko: 잘못된 식의 항 '{0}'입니다.
pl: W wyrażeniu występuje nieprawidłowe określenie „{0}”
pt_br: Termo de expressão inválido "{0}"
ru: Недопустимый термин "{0}" в выражении
tr: Geçersiz ifade terimi '{0}'
zh_hans: 表达式项“{0}”无效
zh_hant: 運算式詞彙 '{0}' 無效

# ERR_BadNewExpr
source: A new expression requires an argument list or (), [], or {} after type
cs: Výraz new vyžaduje za typem seznam argumentů nebo (), [] nebo {}.
fr: Une expression new nécessite une liste d'arguments ou bien (), [] ou {} après type
it: Un'espressione new richiede un elenco di argomenti oppure (), [] o {} dopo il tipo
ja: new 式は、型の後に引数リストか、丸かっこ ()、角かっこ []、または波かっこ {} を必要とします
pl: Wyrażenie new wymaga listy argumentów lub znaków (), [] lub {} po typie.
pt_br: Uma expressão new requer uma lista de argumentos ou (), [] ou {} após o tipo
ru: В выражении new после типа требуется список аргументов либо "()", []" или "{}".
zh_hans: new 表达式要求在类型后有自变量列表或者 ()、[] 或 {}
zh_hant: new 運算式在類型後需要有引數清單或是 ()、[] 或 {}
