Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadUsingStaticType
source: '{0}' type is not valid for 'using static'. Only a class, struct, interface, enum, delegate, or namespace can be used.
fr: Le type '{0}' n'est pas valide pour 'en utilisant statique'. Seuls une classe, une structure, une interface, une énumération, un délégué ou un espace de noms peuvent être utilisés.
it: '{0}' tipo non valido per 'using static'. È possibile usare solo una classe, una struttura, un'interfaccia, un'enumerazione, un delegato o uno spazio dei nomi.
ja: '{0}' 型は 'using static' では無効です。使用できるのは、クラス、構造体、インターフェイス、列挙型、デリゲート、名前空間のみです。
pl: Typ „{0}” jest nieprawidłowy dla „using static”. Można używać tylko klasy, struktury, interfejsu, wyliczenia, delegata lub przestrzeni nazw.
pt_br: '{0}' tipo não é válido para 'using static'. Somente uma classe, struct, interface, enumeração, delegado ou namespace podem ser usados.
ru: ' {0} ' недопустим для 'использования статики'. Можно использовать только класс, структуру, интерфейс, перечисление, делегат или пространство имен.
zh_hans: “{0}”类型对于 "using static" 无效。只能使用类、结构、接口、枚举、委托或命名空间。
zh_hant: '{0}' 類型對 'using static' 無效。只能使用類別、結構、介面、列舉、委派或命名空間。

# ERR_BadVisBaseType
source: Inconsistent accessibility: type '{1}' is less accessible than class '{0}'
pt_br: Acessibilidade inconsistente: o tipo "{1}" é menos acessível do que a classe "{0}"

# ERR_BadYieldInUnsafe
source: Cannot use 'yield return' in an 'unsafe' block
fr: Désolé... Nous ne pouvons pas utiliser « yield return » dans un bloc « unsafe »
it: Non è possibile usare 'yield return' in un blocco 'unsafe'
pl: Nie można użyć instrukcji „yield return” w bloku „unsafe”
pt_br: Não é possível usar "yield return" em um bloco "unsafe"
ru: Невозможно использовать "yield return" в блоке "unsafe".
zh_hans: 不能在 "unsafe" 块中使用 "yield return"
zh_hant: 無法在 'unsafe' 區塊中使用 'yield return'

# ERR_BuilderAttributeDisallowed
source: The AsyncMethodBuilder attribute is disallowed on anonymous methods without an explicit return type.
cs: Atribut AsyncMethodBuilder je u anonymních metod bez explicitního návratového typu zakázaný.
fr: L'attribut AsyncMethodBuilder n'est pas autorisé pour les méthodes anonymes sans type de retour explicite.
it: L'attributo AsyncMethodBuilder non è consentito in metodi anonimi senza un tipo restituito esplicito.
ja: AsyncMethodBuilder 属性は、明示的な戻り値の型のない匿名メソッドでは許可されていません。
pl: Atrybut AsyncMethodBuilder jest niedozwolony w metodach anonimowych bez jawnego zwracanego typu.
pt_br: O atributo AsyncMethodBuilder não é permitido em métodos anônimos sem um tipo de retorno explícito.
ru: Атрибут AsyncMethodBuilder запрещен для анонимных методов без явного типа возвращаемого значения.
zh_hans: 没有显式返回类型的匿名方法不允许使用 AsyncMethodBuilder 属性。
zh_hant: 沒有明確傳回型別的匿名方法上不允許 AsyncMethodBuilder 屬性。

# ERR_CannotApplyOverloadResolutionPriorityToMember
source: Cannot use 'OverloadResolutionPriorityAttribute' on this member.
fr: Impossible d'utiliser « OverloadResolutionPriorityAttribute » sur ce membre.
it: Non è possibile usare 'OverloadResolutionPriorityAttribute' per questo membro.
pl: Nie można użyć atrybutu "OverloadResolutionPriorityAttribute" w tej składowej.
pt_br: Não é possível usar 'OverloadResolutionPriorityAttribute' neste membro.
ru: Невозможно использовать "OverloadResolutionPriorityAttribute" с этим членом.
zh_hans: 无法对此成员使用 'OverloadResolutionPriorityAttribute'。

# ERR_CannotApplyOverloadResolutionPriorityToOverride
source: Cannot use 'OverloadResolutionPriorityAttribute' on an overriding member.
fr: Impossible d'utiliser « OverloadResolutionPriorityAttribute » sur un membre de substitution.
it: Non è possibile usare 'OverloadResolutionPriorityAttribute' in un membro di override.
pl: Nie można użyć atrybutu „OverloadResolutionPriorityAttribute” w zastępującej składowej.
pt_br: Não é possível usar 'OverloadResolutionPriorityAttribute' em um membro que substitui outro.
ru: Невозможно использовать "OverloadResolutionPriorityAttribute" с переопределяемым членом.
zh_hans: 无法对替代成员使用 'OverloadResolutionPriorityAttribute'。

# ERR_CannotBeConvertedToUtf8
source: The input string cannot be converted into the equivalent UTF-8 byte representation. {0}
cs: Vstupní řetězec nelze převést na ekvivalentní reprezentaci bajtů UTF-8. {0}
fr: La chaîne d’entrée ne peut pas être convertie en représentation d’octet UTF-8 équivalente. {0}
it: Impossibile convertire la stringa di input nella rappresentazione di UTF-8 byte equivalente. {0}
ja: 入力文字列を同等の UTF-8 バイト表現に変換できません。{0}
pl: Nie można przekonwertować ciągu wejściowego na równoważną reprezentację bajtową UTF-8. {0}
pt_br: A cadeia de caracteres de entrada não pode ser convertida na representação equivalente em bytes UTF-8. {0}
ru: Невозможно преобразовать входную строку в эквивалентное байтовое представление UTF-8.{0}
zh_hans: 无法将输入字符串转换为等效的 UTF-8 字节表示形式。 {0}
zh_hant: 輸入字串無法轉換成對等的 UTF-8 位元組表示法。{0}

# ERR_CannotBeMadeNullable
source: '{0}' cannot be made nullable.
cs: {0} nejde nastavit tak, aby se povolovala hodnota null.
fr: '{0}' ne peut pas être null.
it: '{0}' non può essere reso nullable.
ja: '{0}' は null 許容にすることはできません。
pl: 'Nie można ustawić elementu „{0}” jako dopuszczającego wartość null.
pt_br: '{0}' não pode ser tornado anulável.
ru: "{0}" не может быть стать параметром, допускающим NULL.
zh_hans: “{0}”不可以为 Null。
zh_hant: '{0}' 不可為 Null。

# ERR_CannotClone
source: The receiver type '{0}' is not a valid record type and is not a struct type.
cs: Typ příjemce {0} není platným typem záznamu a není typem struktury.
fr: Le type de récepteur '{0}' n’est pas un type d’enregistrement valide et n’est pas un type struct.
it: Il tipo di ricevitore '{0}' non è un tipo di record valido e non è un tipo struct.
ja: レシーバーの種類 '{0}' は有効なレコード型でも構造体型でもありません。
pl: Typ odbiorcy "{0}" nie jest prawidłowym typem rekordu i nie jest typem struktury.
pt_br: O tipo de receptor '{0}' não é um tipo de registro válido e não é um tipo struct.
ru: Тип получателя "{0}" не является допустимым типом записи и не является типом структуры.
zh_hans: 接收方类型 '{0}' 非有效记录类型，且非结构类型。
zh_hant: 接收器類型 '{0}' 不是有效的記錄類型，而且不是結構類型。

# ERR_CannotConvertAddressOfToDelegate
source: Cannot convert &method group '{0}' to delegate type '{1}'.
cs: Skupina &metody {0} se nedá převést na typ delegáta {1}.
fr: Impossible de convertir le groupe de &méthodes '{0}' en type délégué '{1}'.
it: Non è possibile convertire il gruppo di &metodi '{0}' nel tipo delegato '{1}'.
ja: メソッド グループ '{0}' をデリゲート型 '{1}' に変換することはできません。(&M)
pl: Nie można przekonwertować &grupy metod „{0}” na typ delegata „{1}”.
pt_br: Não é possível converter o grupo &método '{0}' para o tipo delegado '{1}'.
ru: Невозможно преобразовать &группу методов "{0}" в тип делегата "{1}".
zh_hans: 无法将方法组“{0}”转换为委托类型“{1}”(&M)。
zh_hant: 無法將方法群組 '{0}' 轉換成委派類型 '{1}'(&M)。

# ERR_CannotDynamicInvokeOnExpression
source: Cannot perform a dynamic invocation on an expression with type '{0}'.
fr: Désolé... Nous ne pouvons pas effectuer un appel dynamique sur une expression de type « {0} ».
it: Non è possibile eseguire una chiamata dinamica su un'espressione con tipo '{0}'.
pl: Nie można wykonać wywołania dynamicznego na wyrażeniu o typie „{0}”.
pt_br: Não é possível executar uma invocação dinâmica em uma expressão com o tipo "{0}".
ru: Не удается выполнить динамический вызов для выражения с типом "{0}".
zh_hans: 无法对 "{0}" 类型的表达式执行动态调用。
zh_hant: 無法對具有類型 '{0}' 的運算式執行動態叫用。

# ERR_CannotInferDelegateType
source: The delegate type could not be inferred.
cs: Nedal se odvodit typ delegáta.
fr: Impossible de déduire le type délégué.
it: Non è possibile dedurre il tipo di delegato.
ja: デリゲート型を推論できませんでした。
pl: Nie można wywnioskować typu delegowania.
pt_br: O tipo de representante não pôde ser inferido.
ru: Не удалось вывести тип делегата.
zh_hans: 无法推断委托类型。
zh_hant: 無法推斷委派類型。

# ERR_CannotMatchOnINumberBase
source: Cannot use a numeric constant or relational pattern on '{0}' because it inherits from or extends 'INumberBase<T>'. Consider using a type pattern to narrow to a specific numeric type.
it: Non è possibile usare una costante numerica o un modello relazionale su '{0}' perché eredita da o estende 'INumberBase<T>'. Provare a usare un modello di tipo per limitare a un tipo numerico specifico.
pt_br: Não é possível usar uma constante numérica ou padrão relacional em "{0}" porque herda ou estende "INumberBase<T>". Considere usar um padrão de tipo para restringir a um tipo numérico específico.
ru: Невозможно использовать числовую константу или реляционный шаблон для "{0}", поскольку он наследует от "INumberBase<T>" или расширяет его. Рассмотрите возможность использовать шаблон типа, чтобы указать конкретный числовой тип.
zh_hans: 无法对 "{0}" 使用数值常量或关系模式，因为它继承自或扩展了 "INumberBase<T>"。请考虑使用类型模式缩小到具体的数值类型。

# ERR_CannotSpecifyManagedWithUnmanagedSpecifiers
source: 'managed' calling convention cannot be combined with unmanaged calling convention specifiers.
cs: Konvence volání managed se nedá kombinovat se specifikátory konvence nespravovaného volání.
fr: Impossible d'associer la convention d'appel 'managed' à des spécificateurs de convention d'appel non managés.
it: Non è possibile combinare la convenzione di chiamata 'managed' con identificatori di convenzione di chiamata non gestita.
ja: 'マネージド' 呼び出し規則をアンマネージド呼び出し規則指定子と組み合わせることはできません。
pl: Konwencji wywoływania „managed” nie można łączyć z niezarządzanymi specyfikatorami konwencji wywoływania.
pt_br: A convenção de chamada 'managed' não pode ser combinada com especificadores de convenção de chamada não gerenciados.
ru: Соглашение о вызовах "managed" невозможно использовать вместе с спецификаторами неуправляемых соглашений о вызовах.
zh_hans: "managed" 调用约定不能与非托管调用约定说明符一起使用。
zh_hant: 'managed' 呼叫慣例不得與未受控的呼叫慣例指定名稱並用。

# ERR_CannotUseFunctionPointerAsFixedLocal
source: The type of a local declared in a fixed statement cannot be a function pointer type.
cs: Lokální proměnná deklarovaná v příkazu fixed nemůže být typu ukazatel na funkci.
fr: Le type d'une variable locale déclarée dans une instruction fixed ne peut pas être un type de pointeur de fonction.
it: Il tipo di una variabile locale dichiarata in un'istruzione fixed non può essere un tipo di puntatore a funzione.
ja: fixed ステートメントで宣言されたローカルの型を関数ポインター型にすることはできません。
pl: Typ zmiennej lokalnej zadeklarowanej w instrukcji fixed nie może być typem wskaźnikowym funkcji.
pt_br: O tipo de um local declarado em uma instrução fixed não pode ser um tipo de ponteiro de função.
ru: Локальная переменная, объявленная в операторе fixed, не может быть указателем на функцию.
zh_hans: fixed 语句中声明的局部变量类型不能是函数指针类型。
zh_hant: 在 fixed 陳述式中宣告的區域變數類型不得為函式指標類型。

# ERR_CannotUseManagedTypeInUnmanagedCallersOnly
source: Cannot use '{0}' as a {1} type on a method attributed with 'UnmanagedCallersOnly'.
cs: V metodě, která má atribut UnmanagedCallersOnly, se nedá jako typ {1} použít {0}.
fr: Impossible d'utiliser '{0}' en tant que type {1} sur une méthode ayant pour attribut 'UnmanagedCallersOnly'.
it: Non è possibile usare '{0}' come tipo {1} in un metodo con attributo 'UnmanagedCallersOnly'.
ja: 'UnmanagedCallersOnly' という属性を持つメソッドでは、'{0}' を{1}の型として使用することはできません。
pl: Nie można użyć elementu „{0}” jako typu {1} w metodzie z atrybutem „UnmanagedCallersOnly”.
pt_br: Não é possível usar '{0}' como um tipo de {1} em um método atribuído com 'UnmanagedCallersOnly'.
ru: Невозможно использовать "{0}" как тип {1} для метода с атрибутом "UnmanagedCallersOnly".
zh_hans: 无法在使用 "UnmanagedCallersOnly" 特性化的方法上将“{0}”用作 {1} 类型。
zh_hant: 使用 'UnmanagedCallersOnly' 屬性化的方法上，不能使用 '{0}' 作為{1}型別。

# ERR_CannotUseReducedExtensionMethodInAddressOf
source: Cannot use an extension method with a receiver as the target of a '&' operator.
cs: Rozšiřující metoda, kde jako cíl je nastavený příjemce, se nedá použít jako cíl operátoru &.
fr: Impossible d'utiliser une méthode d'extension avec un récepteur en tant que cible d'un opérateur '&'.
it: Non è possibile usare un metodo di estensione con un ricevitore come destinazione di un operatore '&'.
ja: レシーバーが '&' 演算子の対象となっている拡張メソッドを使用することはできません。
pl: Nie można użyć metody rozszerzenia z odbiornikiem jako elementem docelowym operatora „&”.
pt_br: Não é possível usar um método de extensão com um receptor como destino de um operador '&'.
ru: Невозможно использовать метод расширения с приемником в качестве целевого объекта оператора "&".
zh_hans: 不可将具有接收器的扩展方法用作 "&" 运算符的目标。
zh_hant: 無法使用具有接收器的擴充方法作為 '&' 運算子的目標。

# ERR_CannotUseRefInUnmanagedCallersOnly
source: Cannot use 'ref', 'in', or 'out' in the signature of a method attributed with 'UnmanagedCallersOnly'.
cs: V signatuře metody s atributem UnmanagedCallersOnly se nedají použít hodnoty ref, in ani out.
fr: Impossible d'utiliser 'ref', 'in' ou 'out' dans la signature d'une méthode attribuée avec 'UnmanagedCallersOnly'.
it: Non è possibile usare 'ref', 'in' o 'out' nella firma di un metodo con attributo 'UnmanagedCallersOnly'.
ja: "UnmanagedCallersOnly" の属性が設定されたメソッドのシグネチャでは、"ref"、"in"、または "out" を使用できません。
pl: Nie można użyć elementów „ref”, „in” ani „out” w sygnaturze metody z atrybutem „UnmanagedCallersOnly”.
pt_br: Não é possível usar 'ref', 'in' ou 'out' na assinatura de um método atribuído com 'UnmanagedCallersOnly'.
ru: Нельзя использовать "ref", "in" или "out" в сигнатуре метода с атрибутом "UnmanagedCallersOnly".
zh_hans: 无法在具有 “UnmanagedCallersOnly” 特性的方法的签名中使用 “ref”、“in” 或 “out”。
zh_hant: 無法在具有 'UnmanagedCallersOnly' 的方法簽章中使用 'ref'、'in' 或 'out'。

# ERR_CannotUseSelfAsInterpolatedStringHandlerArgument
source: InterpolatedStringHandlerArgumentAttribute arguments cannot refer to the parameter the attribute is used on.
cs: Argumenty InterpolatedStringHandlerArgumentAttribute nemůžou odkazovat na parametr, na kterém se atribut používá.
fr: Les arguments de l'attribut InterpolatedStringHandlerArgumentAttribute ne peuvent pas faire référence au paramètre sur lequel l'attribut est utilisé.
it: Gli argomenti di InterpolatedStringHandlerArgumentAttribute non possono fare riferimento al parametro in cui viene usato l'attributo.
ja: InterpolatedStringHandlerArgumentAttribute 引数は、属性が使用されているパラメーターを参照できません。
pl: Argumenty atrybutu InterpolatedStringHandlerArgumentAttribute nie mogą odwoływać się do parametru, na podstawie którego jest używany atrybut.
pt_br: Argumentos InterpolatedStringHandlerArgumentAttribute não podem fazer referência ao parâmetro no qual o atributo é usado.
ru: Аргументы InterpolatedStringHandlerArgumentAttribute не могут ссылаться на параметр, в котором используется атрибут.
zh_hans: InterpolatedStringHandlerArgumentAttribute 参数不能引用在其上使用该属性的参数。
zh_hant: InterpolatedStringHandlerArgumentAttribute 引數無法參考屬性所使用的參數。

# ERR_CantChangeInitOnlyOnOverride
source: '{0}' must match by init-only of overridden member '{1}'
cs: {0} musí odpovídat vlastnosti jenom pro inicializaci přepsaného člena {1}.
fr: '{0}' doit correspondre par initialisation uniquement au membre substitué '{1}'
it: '{0}' deve corrispondere per sola inizializzazione del membro '{1}' di cui è stato eseguito l'override
ja: '{0}' は、オーバーライドされたメンバー '{1}' と同じく、初期化専用である必要があります
pl: Element „{0}” musi odpowiadać zmiennymi tylko do inicjowania przesłoniętej składowej „{1}”
pt_br: '{0}' precisa corresponder por somente de inicialização do membro substituído '{1}'
ru: "{0}" и переопределяемый элемент "{1}" должны соответствовать по методу доступа, вызываемому только во время инициализации.
zh_hans: “{0}”必须与重写成员“{1}”的“仅 init”匹配
zh_hant: '{0}' 必須符合被覆寫之成員 '{1}' 的僅供初始化

# ERR_CantConvAnonMethReturnType
source: Cannot convert {0} to type '{1}' because the return type does not match the delegate return type
cs: {0} nelze převést na typ {1}, protože návratový typ se neshoduje s návratovým typem delegáta.
fr: Impossible de convertir {0} en type « {1} », car le type de retour ne correspond pas au type de retour délégué
it: Non è possibile convertire {0} nel tipo ' {1}' perché il tipo restituito non corrisponde al tipo restituito del delegato
ja: 戻り値の型がデリゲート戻り値の型と一致しないため、{0} を型 '{1}' に変換できません
pl: Nie można przekonwertować {0} na typ "{1}", ponieważ zwracany typ jest niezgodny ze zwracanym typem delegowania
pt_br: Não é possível converter {0} para o tipo '{1}' porque o tipo de retorno não corresponde ao tipo de retorno delegado
ru: Невозможно преобразовать {0} в тип "{1}", поскольку возвращаемый тип не совпадает с возвращаемым типом делегата
zh_hans: 无法将 {0} 转换为类型“{1}”，因为返回类型与委托返回类型不匹配
zh_hant: 無法將 {0} 轉換成類型 '{1}'，因為傳回型別不符合委派傳回型別

# ERR_CantUseInOrOutInArglist
source: __arglist cannot have an argument passed by 'in' or 'out'
cs: __arglist nemůže mít argument předávaný pomocí in nebo out
de: "__arglist" darf kein über "in" oder "out" übergebenes Argument umfassen.
es: __arglist no puede tener un argumento que se ha pasado con "in" o "out"
fr: __arglist ne peut pas avoir un argument passé par 'in' ou 'out'
it: __arglist non può contenere un argomento passato da 'in' o 'out'
ja: __arglist では、'in' や 'out' で引数を渡すことができません
ko: __arglist는 'in' 또는 'out'으로 전달되는 인수를 가질 수 없습니다.
pl: Element __arglist nie może mieć argumentu przekazywanego przez parametr „in” ani „out”
pt_br: __arglist não pode ter um argumento passado por 'in' ou 'out'
ru: В __arglist невозможно передать аргумент с помощью in или out
tr: __arglist, 'in' veya 'out' tarafından geçirilen bir bağımsız değişkene sahip olamaz
zh_hans: __arglist 不能有 "in" 或 "out" 传递的参数
zh_hant: __arglist 不得包含 'in' 或 'out' 傳遞的引數

# ERR_ChainingToSetsRequiredMembersRequiresSetsRequiredMembers
source: This constructor must add 'SetsRequiredMembers' because it chains to a constructor that has that attribute.
cs: Tento konstruktor musí přidat SetsRequiredMembers, protože se řetězí s konstruktorem, který má tento atribut.
fr: Ce constructeur doit ajouter « SetsRequiredMembers », car il est lié à un constructeur qui possède cet attribut.
it: Questo costruttore deve aggiungere 'SetsRequiredMembers' perché è concatenato a un costruttore che ha tale attributo.
ja: このコンストラクターは、その属性を持つコンストラクターにチェーンされるため、'SetsRequiredMembers' を追加する必要があります。
pl: Ten konstruktor musi dodać element „SetsRequiredMembers”, ponieważ tworzy łańcuch z konstruktorem mającym ten atrybut.
pt_br: Este construtor deve adicionar 'SetsRequiredMembers' porque se acorrenta a um construtor que tem esse atributo.
ru: Этот конструктор должен добавлять "SetsRequiredMembers", поскольку он связан с конструктором с этим атрибутом.
zh_hans: 此构造函数必须添加 'SetsRequiredMembers'，因为它链接到具有该属性的构造函数。
zh_hant: 此建構函式必須新增 'SetsRequiredMembers'，因為它鏈結至具有該屬性的建構函式。

# ERR_CheckedOperatorNeedsMatch
source: The operator '{0}' requires a matching non-checked version of the operator to also be defined
cs: Operátor {0} vyžaduje, aby byla definována také odpovídající nezaškrtnuté verze operátoru.
fr: L’opérateur '{0}' nécessite également la définition d’une version correspondante non vérifiée de l’opérateur
it: L'operatore '{0}' richiede che sia definita anche una versione non controllata corrispondente dell’operatore
ja: 演算子 '{0}' を定義するには、チェックされていないバージョンの合致する演算子が必要です
pl: Operator „{0}” wymaga, aby była zdefiniowana również pasująca niesprawdzona wersja operatora
pt_br: O operador "{0}" requer que uma versão correspondente não verificada do operador para também ser definido
ru: Для оператора "{0}" требуется, чтобы была определена соответствующая непроверенная версия этого оператора
zh_hans: 运算符 '{0}' 需要同时定义匹配的未选中版本的运算符
zh_hant: 運算子 '{0}' 需要也同時定義運算子的相符未檢查版本

# ERR_ClassIsCombinedWithRefStruct
source: Cannot allow ref structs for a type parameter known from other constraints to be a class
fr: Désolé... Nous ne pouvons pas autoriser les structs ref pour qu’un paramètre de type connu à partir d’autres contraintes soit une classe
it: Non è possibile consentire che i ref struct per un parametro di tipo noto da altri vincoli siano una classe
pl: Nie można zezwolić strukturom ref dla parametru typu znanego z innych ograniczeń na bycie klasą
pt_br: Não é possível permitir que ref structs para um parâmetro de tipo conhecido de outras restrições sejam uma classe
ru: Невозможно разрешить использование ссылочных структур для параметра типа, известного из других ограничений как класс.
zh_hans: 无法允许从其他约束中已知的类型参数的 ref 结构作为类
zh_hant: 無法允許已知來自於其他限制式之型別參數別的 ref struct

# ERR_CloneDisallowedInRecord
source: Members named 'Clone' are disallowed in records.
cs: Členy s názvem Clone se v záznamech nepovolují.
fr: Les membres nommés 'Clone' ne sont pas autorisés dans les enregistrements.
it: Nei record non sono consentiti membri denominati 'Clone'.
ja: 'Clone' という名前のメンバーはレコードでは許可されていません。
pl: Składowe o nazwie „Clone” są niedozwolone w rekordach.
pt_br: Os membros chamados 'Clone' não são permitidos nos registros.
ru: Элементы с именем "Clone" не могут использоваться в записях.
zh_hans: 记录中不允许使用名为 "Clone" 的成员。
zh_hant: 記錄中不允許名為 'Clone' 的成員。

# ERR_CloseUnimplementedInterfaceMemberNotStatic
source: '{0}' does not implement static interface member '{1}'. '{2}' cannot implement the interface member because it is not static.
cs: {0} neimplementuje statický člen rozhraní {1}. {2} nemůže implementovat člen rozhraní, protože není statický.
fr: « {0} » n'implémente pas le membre d'interface statique« {1} ». « {2} » ne peut pas implémenter le membre d'interface, car il est n’est pas statique.
it: '{0}' non implementa il membro di interfaccia statico '{1}'. '{2}' non può implementare il membro di interfaccia perché è di tipo statico.
ja: '{0}' は、静的インターフェイス メンバー '{1}' を実装していません。'{2}' は静的ではないため、インターフェイス メンバーを実装できません。
pl: Atrybut "{0}" nie implementuje statycznej składowej interfejsu "{1}". Atrybut "{2}" nie może zaimplementować składowej interfejsu, ponieważ nie jest ona statyczna.
pt_br: '{0}' não implementa o membro da interface estática '{1}'. '{2}' não pode implementar o membro da interface porque não é estático.
ru: "{0}" не реализует элемент статический элемент интерфейса "{1}". "{2}" не может реализовать этот элемент интерфейса, поскольку он является статическим.
zh_hans: “{0}”不实现静态接口成员“{1}”。“{2}”无法实现接口成员，因为它不是静态的。
zh_hant: '{0}' 未實作靜態介面成員 '{1}'。因為 '{2}' 為靜態，所以無法實作介面成員。

# ERR_CloseUnimplementedInterfaceMemberOperatorMismatch
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement '{1}' because one of them is not an operator.
pt_br: "{0}" não implementa o membro da interface "{1}". "{2}" não pode implementar "{1}" porque um deles não é um operador.

# ERR_CloseUnimplementedInterfaceMemberWrongInitOnly
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement '{1}'.
cs: {0} neimplementuje člen rozhraní {1}. {2} nemůže implementovat {1}.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. '{2}' ne peut pas implémenter '{1}'.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare '{1}'.
ja: '{0}' は、インターフェイス メンバー '{1}' を実装していません。'{2}' は '{1}' を実装できません。
pl: Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może implementować elementu „{1}”.
pt_br: '{0}' não implementa o membro de interface '{1}'. '{2}' não pode implementar '{1}'.
ru: "{0}" не реализует элемент интерфейса "{1}". "{2}" не может реализовывать "{1}".
zh_hans: “{0}”不实现接口成员“{1}”。“{2}”无法实现“{1}”。
zh_hant: '{0}' 未實作介面成員 '{1}'。'{2}' 無法實作 '{1}'。

# ERR_CollectionBuilderAttributeInvalidMethodName
source: The CollectionBuilderAttribute method name is invalid.
fr: Le nom de la méthode CollectionBuilderAttribute n’est pas valide.
it: Il nome del metodo CollectionBuilderAttribute non è valido.
ja: CollectionBuilderAttribute メソッド名が無効です。
pl: Nazwa metody CollectionBuilderAttribute jest nieprawidłowa.
pt_br: O nome do método CollectionBuilderAttribute é inválido.
ru: Недопустимое имя метода CollectionBuilderAttribute.
zh_hans: CollectionBuilderAttribute 方法名称无效。
zh_hant: CollectionBuilderAttribute 方法名稱無效。
