Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_IllegalPPWarning_Title
source: Expected 'disable' or 'restore' after #pragma warning
cs: Po varování #pragma se očekávala hodnota disable nebo restore.
de: "disable" oder " restore" erwartet nach #pragma-Warnung
es: Se esperaba "disable" o "restore" después de la advertencia de #pragma
fr: 'disable' ou 'restore' attendu après l'avertissement #pragma
it: Dopo l'avviso della direttiva #pragma è previsto 'disable' o 'restore'
ja: #pragma 警告の後に、'disable' または 'restore' が必要です
ko: #pragma warning 뒤에 'disable' 또는 'restore'가 필요합니다.
pl: Oczekiwano elementu „disable” lub „restore” po ostrzeżeniu #pragma
pt_br: 'disable' ou 'restore' esperado após o aviso #pragma
ru: После предупреждения #pragma ожидается "disable" или "restore"
tr: #pragma uyarısından sonra beklenen: 'disable' veya 'restore'
zh_hans: #pragma 警告后应为 "disable" 或 "restore"
zh_hant: #pragma 警告後應有 'disable' 或 'restore'

# WRN_BadRestoreNumber
source: Cannot restore warning 'CS{0}' because it was disabled globally
cs: Nejde obnovit varování CS{0}, protože je globálně zakázané.
de: Die Warnung "CS{0}" kann nicht wiederhergestellt werden, da sie global deaktiviert wurde.
es: No se puede restaurar la advertencia 'CS{0}' porque estaba deshabilitada globalmente
fr: Impossible de restaurer un avertissement 'CS{0}', car il a été désactivé globalement
it: Non è possibile ripristinare l'avviso 'CS{0}' perché è stato disabilitato a livello globale
ja: 警告 'CS{0}' はグローバルで無効にされたため、復元することはできません
ko: 전역으로 사용하지 않도록 설정되었기 때문에 'CS{0}' 경고를 복원할 수 없습니다.
pl: Nie można przywrócić ostrzeżenia „CS{0}”, ponieważ zostało wyłączone globalnie
pt_br: Não é possível restaurar o aviso "CS{0}" porque ele foi desabilitado globalmente
ru: Не удается восстановить предупреждение "CS{0}", так как оно было глобально отключено.
tr: Küresel olarak devre dışı bırakıldığından 'CS{0}' uyarısı geri yüklenemedi
zh_hans: “CS{0}”警告已被全局禁用，无法还原
zh_hant: 無法還原警告 'CS{0}'，因為其已全域停用

# WRN_BadRestoreNumber_Title
source: Cannot restore warning because it was disabled globally
cs: Nejde obnovit varování, protože bylo globálně zakázané.
de: Warnung konnte nicht wiederhergestellt werden, da sie global deaktiviert wurde.
es: No se puede restaurar la advertencia porque se ha deshabilitado globalmente
fr: Désolé... Nous ne pouvons pas restaurer les avertissements, car ils ont été désactivés de façon globale
it: Non è possibile ripristinare l'avviso perché è stato disabilitato a livello globale
ja: 警告はグローバルに無効にされたため復元できません
ko: 전역으로 사용하지 않도록 설정되었기 때문에 경고를 복원할 수 없습니다.
pl: Nie można przywrócić ostrzeżenia, ponieważ zostało globalnie wyłączone
pt_br: Não é possível restaurar o aviso porque ele foi desabilitado globalmente
ru: Невозможно восстановить предупреждение, так как оно было отключено глобально
tr: Genel olarak devre dışı bırakıldığından uyarı geri yüklenemiyor
zh_hans: 警告已全局禁用，无法还原
zh_hant: 無法還原警告，因為已全域予以停用

# ERR_VarargsIterator
source: __arglist is not allowed in the parameter list of iterators
cs: Parametr __arglist není povolený v seznamu parametrů iterátorů.
de: "__arglist" ist in der Parameterliste von Iteratoren nicht zulässig.
es: __arglist no se permite en la lista de parámetros de iteradores
fr: __arglist n'est pas autorisé dans la liste de paramètres des itérateurs
it: __arglist non è consentito nell'elenco dei parametri degli iteratori
ja: __arglist は、反復子のパラメーター リストでは許可されていません
ko: __arglist는 반복기의 매개 변수 목록에 사용할 수 없습니다.
pl: Element „__arglist” jest niedozwolony w liście parametrów iteratorów.
pt_br: __arglist não é permitido na lista de parâmetros dos iteradores
ru: __arglist не разрешается использовать в списке параметров итераторов.
tr: Yineleyicilerin parametre listesinde __arglist kullanılamaz
zh_hans: 迭代器的参数列表中不允许有 __arglist
zh_hant: 迭代器的參數清單中不可有 __arglist

# ERR_UnsafeIteratorArgType
source: Iterators cannot have pointer type parameters
cs: U iterátorů nejde používat nezabezpečené parametry nebo typy yield.
fr: Les itérateurs ne peuvent pas avoir de paramètres de type pointeur
it: Gli iteratori non possono avere parametri di tipo puntatore
ja: 反復子にポインター型パラメーターを指定することはできません
pl: Iteratory nie mogą mieć parametrów typu wskaźnika
pt_br: Iteradores não podem ter parâmetros de tipo de ponteiro
ru: Итераторы не могут использовать параметры типа указателя
zh_hans: 迭代器不能具有指针类型参数
zh_hant: 迭代器不能具有指標型別參數

# ERR_BadCoClassSig
source: The managed coclass wrapper class signature '{0}' for interface '{1}' is not a valid class name signature
cs: Podpis spravované třídy obálky coclass {0} pro rozhraní {1} není platný podpis názvu třídy.
de: Die Signatur "{0}" der verwalteten Co-Klassen-Wrapperklasse für die {1}-Schnittstelle ist keine gültige Klassennamensignatur.
es: La firma de la clase contenedora de coclases administradas '{0}' para la interfaz '{1}' no es una signatura de nombre de clase válida
fr: La signature de classe wrapper de coclasse managée '{0}' pour l'interface '{1}' n'est pas une signature de nom de classe valide
it: La firma della classe wrapper '{0}' della coclasse gestita per l'interfaccia '{1}' non è valida per il nome della classe
ja: インターフェイス '{1}' のマネージ コクラス ラッパー クラス '{0}' は、有効なクラス名シグネチャではありません
ko: {1}' 인터페이스에 대해 관리되는 coclass 래퍼 클래스 시그니처 '{0}'은(는) 유효한 클래스 이름 시그니처가 아닙니다.
pl: Sygnatura „{0}” zarządzanej klasy otoki coclass dla interfejsu „{1}” nie jest prawidłową sygnaturą nazwy klasy.
pt_br: A assinatura de classe coclass wrapper gerenciada "{0}" para interface "{1}" não é uma assinatura de nome de classe válida
ru: Сигнатура управляемого класса-оболочки coclass "{0}" для интерфейса "{1}" не является допустимой сигнатурой имени класса.
tr: {1}' arabirimi için '{0}' yönetilen coclass sarmalayıcı sınıfı imzası geçerli bir sınıf adı imzası değildir
zh_hans: 接口“{1}”的托管组件类包装器类签名“{0}”不是有效的类名签名
zh_hant: 介面 '{1}' 的 Managed coclass 包裝函式類別簽章 '{0}'，不是有效的類別名稱簽章

# ERR_MultipleIEnumOfT
source: foreach statement cannot operate on variables of type '{0}' because it implements multiple instantiations of '{1}'; try casting to a specific interface instantiation
cs: Příkaz foreach nejde použít pro proměnné typu {0}, protože implementuje vytváření víc instancí {1}. Zkuste přetypování na konkrétní instanci rozhraní.
de: Die foreach-Anweisung kann für Variablen vom Typ "{0}" nicht verwendet werden, da sie mehrere Instanziierungen von "{1}" implementiert. Nehmen Sie eine Umwandlung in eine spezifische Schnittstelleninstanziierung vor.
es: La instrucción foreach no puede funcionar en variables de tipo '{0}' porque implementa varias creaciones de instancias de "{1}"; intente convertirla en una creación de una instancia de interfaz específica
fr: L'instruction foreach ne peut pas fonctionner sur des variables de type '{0}', car elle implémente plusieurs instanciations de '{1}' ; essayez d'effectuer un cast en une instanciation d'interface spécifique
it: L'istruzione foreach non può funzionare con variabili di tipo '{0}' perché implementa più creazioni di un'istanza di '{1}'. Provare a eseguire il cast su una creazione di un'istanza di interfaccia specifica
ja: '{1}' の複数のインスタンスを実装するため、foreach ステートメントは、型 '{0}' の変数では操作できません。特定のインターフェイスのインスタンス化にキャストしてください
ko: foreach 문은 '{1}'의 여러 인스턴스화를 구현하므로 '{0}' 형식의 변수에는 foreach 문을 수행할 수 없습니다. 특정 인터페이스 인스턴스화로 캐스팅하세요.
pl: Instrukcja foreach nie może używać zmiennych typu „{0}”, ponieważ implementuje wiele utworzeń wystąpienia elementu „{1}”. Spróbuj rzutowania na konkretne utworzenie wystąpienia interfejsu
pt_br: A instrução foreach não pode operar em variáveis do tipo "{0}" porque implementa várias instanciações de "{1}"; tente transmitir para uma instanciação de interface específica
ru: Оператор foreach не может использоваться с переменными типа "{0}", так как он реализует создание нескольких экземпляров "{1}". Попробуйте выполнить приведение к созданию экземпляра определенного интерфейса.
tr: foreach deyimi, '{1}' öğesinin birden çok örnek oluşturma işlemini uyguladığından '{0}' türündeki değişkenlerde çalışamaz; belirli bir arabirim örnek oluşturma işlemine atamayı deneyin
zh_hans: foreach 语句实现“{1}”的多个实例化，因此不能在“{0}”类型的变量上运行；请尝试强制转换到特定的接口实例化
zh_hant: foreach 陳述式不可用在類型 '{0}' 的變數上，因為其會實作 '{1}' 的多個具現化; 請嘗試轉型為特定的介面具現化

# ERR_FixedDimsRequired
source: A fixed size buffer field must have the array size specifier after the field name
cs: Pole vyrovnávací paměti s pevnou velikostí musí mít za názvem pole uvedený specifikátor velikosti pole.
de: Bei einem Pufferfeld fester Größe muss sich der Arraygrößenspezifizierer hinter dem Feldnamen befinden.
es: Un campo de búfer de tamaño fijo debe tener el especificador de tamaño de matriz detrás del nombre de campo
fr: Un champ de mémoire tampon de taille fixe doit utiliser le spécificateur de la taille du tableau après le nom du champ
it: In un campo buffer a dimensione fissa, l'identificatore della dimensione della matrice deve trovarsi dopo il nome del campo
ja: 固定サイズ バッファー フィールドには、フィールド名の後に配列サイズの指定子が必要です
ko: 고정 크기 버퍼 필드에는 필드 이름 뒤에 배열 크기 지정자를 사용해야 합니다.
pl: Pole buforu o ustalonym rozmiarze musi mieć specyfikator rozmiaru tablicy po nazwie pola.
pt_br: Um campo de buffer de tamanho fixo deve ter especificador de tamanho de matriz após o nome do campo
ru: Поле буфера фиксированного размера должно иметь спецификатор размера массива после имени поля.
tr: Sabit boyutlu arabellek alanında alan uzayından sonra dizi boyutu belirticisi gelmelidir
zh_hans: 固定大小缓冲区字段的字段名称后必须带有数组大小说明符
zh_hant: 固定大小緩衝區欄位在欄位名稱後面必須有陣列大小規範

# ERR_FixedNotInStruct
source: Fixed size buffer fields may only be members of structs
cs: Pole vyrovnávací paměti pevné velikosti můžou být jenom členy struktur.
de: Pufferfelder fester Größe dürfen nur Member von Strukturen sein.
es: Los campos de búfer de tamaño fijo solo pueden ser miembros de estructuras
fr: Les champs de mémoire tampon de taille fixe ne peuvent être membres que de structs
it: I campi buffer a dimensione fissa possono essere membri solo di struct
ja: 固定サイズ バッファー フィールドは、構造体のメンバーにしかなれません
ko: 고정 크기 버퍼 필드는 구조체의 멤버로만 사용할 수 있습니다.
pl: Pola buforu o ustalonym rozmiarze mogą być tylko składowymi struktur.
pt_br: Campos de buffer de tamanho fixo só podem ser membros de structs
ru: Поля буферов фиксированного размера могут быть только членами структур.
tr: Sabit boyutlu bir arabellek alanı yalnızca bir struct'ın üyesi olabilir
zh_hans: 固定大小缓冲区字段只能是结构的成员
zh_hant: 固定大小緩衝區欄位必須是結構的成員

# ERR_AnonymousReturnExpected
source: Not all code paths return a value in {0} of type '{1}'
cs: Ne všechny cesty kódu vracejí hodnotu v {0} typu {1}.
de: Nicht alle Codepfade geben einen Wert in "{0}" mit dem Typ "{1}" zurück.
es: No todas las rutas de acceso de código devuelven un valor en {0} de tipo '{1}'
fr: Les chemins du code ne retournent pas tous une valeur dans {0} de type '{1}'
it: Non tutti i percorsi del codice restituiscono un valore in {0} di tipo '{1}'
ja: 型 '{1}' の {0} に値を返さないコード パスがあります
ko: 코드 경로 중 일부에서만 '{1}' 형식의 {0}에 있는 값을 반환합니다.
pl: Nie dla wszystkich ścieżek w kodzie jest zwracana wartość w {0} typu „{1}”
pt_br: Nem todos os caminhos de código retornam um valor em {0} do tipo "{1}"
ru: Не все пути к коду возвращают значение в {0} типа "{1}.
tr: Tüm kod yolları '{1}' türünün {0} içinde bir değer döndürmez
zh_hans: 在类型“{1}”的“{0}”中，并不是所有代码路径都返回值
zh_hant: 並非所有程式碼路徑都會在類型為 '{1}' 的 {0} 中傳回值

# WRN_NonECMAFeature
source: Feature '{0}' is not part of the standardized ISO C# language specification, and may not be accepted by other compilers
cs: Funkce {0} není součástí standardizované specifikace ISO jazyka C# a možná ji nepůjde použít v ostatních kompilátorech
de: Die Funktion "{0}" ist nicht Teil der C#-Sprachspezifikation nach ISO-Norm und wird daher möglicherweise von anderen Compilern nicht akzeptiert.
es: La funcionalidad '{0}' no forma parte de la especificación de idioma C# ISO normalizado y puede que otros compiladores no la admitan
fr: La fonctionnalité '{0}' ne fait pas partie de la spécification du langage C# ISO standardisée et peut ne pas être acceptée par d'autres compilateurs
it: La funzionalità '{0}' non fa parte della specifica del linguaggio C# standard ISO e potrebbe non essere accettata da altri compilatori
ja: 機能 '{0}' は標準 ISO C# 言語仕様ではありません。別のコンパイラでは受け入れられない可能性があります
ko: {0}' 기능은 표준화된 ISO C# 언어 사양의 일부가 아니므로 다른 컴파일러에서 지원하지 않을 수도 있습니다.
pl: Funkcja „{0}” nie jest częścią specyfikacji standardu ISO języka C# i może nie być akceptowana przez inne kompilatory
pt_br: Recurso "{0}" não é parte da especificação de idioma ISO C# padronizada e não pode ser aceito por outros compiladores
ru: Возможность "{0}" не входит в спецификацию языка C#, стандартизированную ISO, и может не распознаваться другими компиляторами
tr: {0}' özelliği standartlaştırılmış ISO C# dil belirtiminin bir parçası değil ve diğer derleyiciler tarafından kabul edilmeyebilir
zh_hans: 功能“{0}”不是标准化 ISO C# 语言规范的一部分，其他编译器可能不接受它
zh_hant: '{0}' 功能不包括在標準化 ISO C# 語言規格中，在其他編譯器上可能無法接受

# WRN_NonECMAFeature_Title
source: Feature is not part of the standardized ISO C# language specification, and may not be accepted by other compilers
cs: Funkce není součástí standardizované specifikace ISO jazyka C# a možná ji nepůjde použít v ostatních kompilátorech
de: Feature ist nicht Teil der standardisierten ISO C#-Sprachspezifikation, und wird möglicherweise von anderen Compilern nicht akzeptiert.
es: La funcionalidad no es parte de la especificación de lenguaje C# estandarizada por ISO y puede no estar aceptada en otros compiladores
fr: Cette fonctionnalité ne fait pas partie de la spécification du langage C# ISO standardisée ; il est possible qu'elle ne soit pas acceptée par d'autres compilateurs
it: La funzionalità non fa parte della specifica del linguaggio C# standard ISO e potrebbe non essere accettata da altri compilatori
ja: 機能は標準 ISO C# 言語仕様の一部ではありません。別のコンパイラでは受け入れられない可能性があります
ko: 기능은 표준화된 ISO C# 언어 사양의 일부가 아니므로 다른 컴파일러에서 지원하지 않을 수도 있습니다.
pl: Funkcja nie jest częścią specyfikacji standardu ISO języka C# i może nie być akceptowana przez inne kompilatory
pt_br: O recurso não faz parte da especificação de linguagem ISO C# padronizada e pode não ser aceito por outros compiladores
ru: Компонент не является частью стандартизированной спецификации ISO языка C# и может не приниматься другими компиляторами
tr: Özellik standart hale getirilmiş ISO C# dil belirtiminin parçası değil ve diğer derleyiciler tarafından kabul edilmeyebilir
zh_hans: 功能不是标准化 ISO C# 语言规范的一部分，其他编译器可能不接受它
zh_hant: 功能不包括在標準化 ISO C# 語言規格中，在其他編譯器上可能無法接受

# ERR_ExpectedVerbatimLiteral
source: Keyword, identifier, or string expected after verbatim specifier: @
cs: Po specifikátoru verbatim se očekávalo klíčové slovo, identifikátor nebo řetězec: @
de: Schlüsselwort, Bezeichner oder Zeichenfolge erwartet nach dem ausführlichen Spezifizierer: @
es: Se esperaba una palabra clave, un identificador o una cadena detrás del especificador textual: @
fr: Mot clé, identificateur ou chaîne attendue après le spécificateur textuel : @
it: È prevista la parola chiave, l'identificatore o la stringa dopo l'identificatore verbatim: @
ja: verbatim 識別子の後にはキーワード、識別子、または文字列が必要です:@
ko: 축자 지정자 @ 뒤에는 키워드, 식별자 또는 문자열이 필요합니다.
pl: Słowo kluczowe, identyfikator lub ciąg oczekiwany po specyfikatorze kalki: @.
pt_br: Palavra-chave, cadeia de caracteres ou identificador esperado após o especificador textual: @
ru: После спецификатора verbatim (@) требуется ключевое слово, идентификатор или строка.
tr: @ düz metin belirticisinden sonra anahtar sözcük, tanımlayıcı veya dize bekleniyor
zh_hans: 原义说明符 @ 之后应为关键字、标识符或字符串@
zh_hant: 逐字規範 "@" 之後應接著關鍵字、識別項或字串

# ERR_RefReadonly
source: A readonly field cannot be used as a ref or out value (except in a constructor)
cs: Pole určené jen pro čtení nejde použít jako hodnotu Ref nebo Out (kromě případu, kdy se nachází uvnitř konstruktoru).
de: Ein schreibgeschütztes Feld kann (außer in einem Konstruktor) nicht als ref- oder out-Wert verwendet werden.
es: No se puede usar un campo de solo lectura como valor out o ref (excepto en un constructor).
fr: Impossible d'utiliser un champ readonly en tant que valeur ref ou out (sauf dans un constructeur)
it: Non è possibile usare un campo di sola lettura come valore out o ref (tranne che in un costruttore)
ja: 読み取り専用フィールドを ref 値または out 値として使用することはできません (コンストラクターでは可)
ko: 읽기 전용 필드는 ref 또는 out 값으로 사용할 수 없습니다. 단 생성자에서는 예외입니다.
pl: Pola tylko do odczytu nie można użyć jako wartości ref ani out (z wyjątkiem sytuacji, gdy znajduje się w konstruktorze)
pt_br: Um campo somente leitura não pode ser usado como um valor ref ou out (exceto em um construtor)
ru: Доступное только для чтения поле можно использовать как значение ref или out только в конструкторе
tr: Salt okunur bir alan (oluşturucu dışında) ref veya out değeri olarak kullanılamaz
zh_hans: 无法将只读字段用作 ref 或 out 值(构造函数中除外)
zh_hant: 無法將唯讀欄位用作為 ref 或 out 值 (除非在建構函式中)

# ERR_RefReadonly2
source: Members of readonly field '{0}' cannot be used as a ref or out value (except in a constructor)
cs: Členy pole jen pro čtení {0} nejde použít jako hodnotu Ref nebo Out (kromě případu, kdy se nachází uvnitř konstruktoru).
de: Member des schreibgeschützten Felds "{0}" können (außer in einem Konstruktor) nicht als ref- oder out-Wert verwendet werden.
es: No se pueden usar miembros del campo de solo lectura '{0}' como valores out o ref (excepto en un constructor).
fr: Impossible d'utiliser les membres du champ readonly '{0}' en tant que valeur ref ou out (sauf dans un constructeur)
it: Non è possibile usare i membri del campo di sola lettura '{0}' come valore out o ref (tranne che in un costruttore)
ja: 読み取り専用フィールド '{0}' のメンバーを ref 値または out 値として使用することはできません (コンストラクターでは可)
ko: 읽기 전용 필드 '{0}'의 멤버는 ref 또는 out 값으로 사용할 수 없습니다. 단 생성자에서는 예외입니다.
pl: Składowych pola tylko do odczytu „{0}” nie można użyć jako wartości ref ani out (z wyjątkiem sytuacji, gdy znajdują się w konstruktorze)
pt_br: Os membros do campo somente leitura '{0}' não podem ser usados como um valor ref ou out (a não ser em um construtor)
ru: Члены доступного только для чтения поля "{0}" можно использовать как значение ref или out только в конструкторе
tr: Salt okunur '{0}' alanının üyeleri (oluşturucu dışında) ref veya out değeri olarak kullanılamaz
zh_hans: 无法将只读字段“{0}”的成员用作 ref 或 out 值(构造函数中除外)
zh_hant: 無法將唯讀欄位 '{0}' 的成員用作為 ref 或 out 值使用 (除非在建構函式中)

# ERR_AssgReadonly
source: A readonly field cannot be assigned to (except in a constructor or init-only setter of the type in which the field is defined or a variable initializer)
cs: Do pole jen pro čtení není možné přiřazovat hodnoty (kromě případu, kdy je v konstruktoru nebo v metodě setter jen pro inicializaci typu, ve kterém je pole definované, nebo v inicializátoru proměnné).
fr: Un champ readonly ne peut pas faire l'objet d'une assignation de valeur (sauf dans un constructeur ou une méthode setter d'initialisation uniquement du type dans lequel le champ est défini ou représente un initialiseur de variable)
it: Non è possibile assegnare un valore a un campo di sola lettura, tranne che in un costruttore o un setter di sola inizializzazione del tipo in cui è definito il campo o in un inizializzatore di variabile
ja: 読み取り専用フィールドに割り当てることはできません (フィールドが定義されている型のコンストラクターか init 専用セッター、または変数初期化子では可)
pl: Nie można przypisać do pola tylko do odczytu (poza konstruktorem lub metodą ustawiającą tylko do inicjowania typu, w której pole jest zdefiniowane, lub inicjatorze zmiennej)
pt_br: Não é possível atribuir um campo somente leitura (exceto em um construtor ou em um setter somente de inicialização do tipo no qual o campo esteja definido ou em um inicializador de variável)
ru: Полю, которое доступно только для чтения, не может быть присвоено значение (значение может быть присвоено только в конструкторе типа, в методе задания значения, вызываемом только при инициализации типа, в котором определено поле, либо в инициализаторе переменной)
zh_hans: 无法分配到只读字段(除非在定义了该字段的类型的构造函数或 init-only 资源库中，或者在变量初始值设定项中)
zh_hant: 無法指派給唯讀欄位 (除非位於建構函式內; 或位於已定義此欄位的類型中，僅供初始化的 Setter 內; 或位於變數初始設定式內)

# ERR_AssgReadonly2
source: Members of readonly field '{0}' cannot be modified (except in a constructor or a variable initializer)
cs: Členy pole jen pro čtení {0} nejde měnit (kromě případu, kdy se nacházejí uvnitř konstruktoru nebo inicializátoru proměnné).
de: Member des schreibgeschützten Felds "{0}" können nicht geändert werden (außer in einem Konstruktor oder Variableninitialisierer).
es: Los miembros del campo de solo lectura '{0}' no se pueden modificar (excepto en un constructor o inicializador de variable)
fr: Impossible de modifier les membres d'un champ readonly '{0}' (sauf s'ils appartiennent à un constructeur ou un initialiseur de variable)
it: Non è possibile modificare i membri del campo di sola lettura '{0}' (tranne che in un costruttore o in un inizializzatore di variabile)
ja: 読み取り専用フィールド '{0}' のメンバーは変更できません (コンストラクターまたは変数初期化子では可)
ko: 읽기 전용 필드 '{0}'의 멤버는 수정할 수 없습니다. 단 생성자 또는 변수 이니셜라이저에서는 예외입니다.
pl: Nie można modyfikować składowych pola tylko do odczytu „{0}” (z wyjątkiem składowych w konstruktorze lub inicjatorze zmiennych).
pt_br: Os membros do campo somente leitura "{0}" não podem ser modificados (exceto em um construtor ou inicializador de variável)
ru: Члены поля "{0}", предназначенного только для чтения, могут быть изменены только в конструкторе или инициализаторе переменных.
tr: {0}' salt okunur alanın üyeleri (oluşturucu veya değişken başlatıcı dışında) değiştirilemez
zh_hans: 无法修改只读字段“{0}”的成员(在构造函数或变量初始值设定项中除外)
zh_hant: 唯讀欄位 '{0}' 的成員不可修改 (除非在建構函式或變數初始設定式中)

# ERR_RefReadonlyNotField
source: Cannot use {0} '{1}' as a ref or out value because it is a readonly variable
cs: Nejde použít {0} {1} jako hodnotu ref nebo out, protože je to proměnná jen pro čtení.
de: {0} "{1}" kann nicht als ref- oder out-Wert verwendet werden, weil es sich um eine schreibgeschützte Variable handelt.
es: No se puede usar {0} "{1}" como valor out o ref porque es una variable readonly.
fr: Impossible d'utiliser {0} '{1}' en tant que valeur ref ou out, car il s'agit d'une variable en lecture seule
it: Non è possibile usare {0} '{1}' come valore ref o out perché è una variabile di sola lettura
ja: {0} '{1}' は、読み取り専用の変数であるため、ref 値または out 値として使用することはできません
ko: {0} '{1}'은(는) 읽기 전용 변수이므로 ref 또는 out 값으로 사용할 수 없습니다.
pl: Nie można użyć elementu {0} „{1}” jako wartości ref ani out, ponieważ jest to zmienna tylko do odczytu
pt_br: Não é possível usar {0} '{1}' como um valor de referência ou out porque ela é uma variável somente leitura
ru: Невозможно использовать {0} "{1}" как значение ref или out, так как это переменная только для чтения
tr: {0} '{1}', salt okunur değişken olduğundan ref veya out değeri olarak kullanılamaz
zh_hans: 不能将 {0} '{1}' 作为 ref 或 out 值使用，因为它是只读变量
zh_hant: {0} '{1}' 無法用為 ref 或 out 值，因為它是唯讀變數
