Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ConversionWithInterface
source: '{0}': user-defined conversions to or from an interface are not allowed
cs: {0}: Uživatelem definované převody na rozhraní nebo z něho nejsou povolené.
de: '"{0}": Benutzerdefinierte Konvertierungen in eine oder aus einer Schnittstelle sind nicht zulässig.
es: '{0}': no se permiten conversiones definidas por el usuario ni a una interfaz ni desde ella
fr: '{0}' : les conversions définies par l'utilisateur vers ou à partir d'une interface ne sont pas autorisées
it: '{0}': non sono consentite conversioni definite dall'utente da o verso un'interfaccia
ja: '{0}': インターフェイスとの間におけるユーザー定義の変換は許可されていません
ko: '{0}': 인터페이스(로)부터의 사용자 정의 변환은 허용되지 않습니다.
pl: „{0}”: zdefiniowane przez użytkownika konwersje na lub z interfejsu nie są dozwolone
pt_br: "{0}": conversões definidas pelo usuário para ou de uma interface não são permitidas
ru: "{0}": не разрешено пользовательское преобразование в интерфейс или из интерфейса.
tr: '{0}': arabirime veya arabirimden kullanıcı tanımlı dönüştürmelere izin verilmiyor
zh_hans: “{0}”: 不允许进行以接口为转换源或目标用户定义转换
zh_hant: '{0}': 介面之間不可進行使用者定義的轉換

# ERR_ConversionWithBase
source: '{0}': user-defined conversions to or from a base type are not allowed
cs: {0}: Uživatelem definované převody na základní typ nebo z něj nejsou povolené.
fr: '{0}' : les conversions définies par l'utilisateur vers ou à partir d'un type de base ne sont pas autorisées
it: '{0}': le conversioni definite dall'utente da o verso un tipo di base non sono consentite
ja: '{0}': 基本データ型との間におけるユーザー定義の変換は許可されていません
pl: „{0}”: zdefiniowane przez użytkownika konwersje na lub z typu bazowego nie są dozwolone
pt_br: '{0}': as conversões definidas pelo usuário para ou de um tipo base não são permitidas
ru: "{0}": не разрешено пользовательское преобразование в базовый тип или из базового типа.
zh_hans: “{0}”: 不允许进行以基类型为转换源或目标的用户定义转换
zh_hant: '{0}': 與基底類型之間不可進行使用者定義的轉換

# ERR_ConversionWithDerived
source: '{0}': user-defined conversions to or from a derived type are not allowed
cs: {0}: Uživatelem definované převody na odvozený typ nebo z něj nejsou povolené.
fr: '{0}' : les conversions définies par l'utilisateur vers ou à partir d'un type dérivé ne sont pas autorisées
it: '{0}': le conversioni definite dall'utente da o verso un tipo derivato non sono consentite
ja: '{0}': 派生型との間におけるユーザー定義の変換は許可されていません
pl: „{0}”: zdefiniowane przez użytkownika konwersje na lub z typu pochodnego nie są dozwolone
pt_br: '{0}': as conversões definidas pelo usuário para ou de um tipo derivado não são permitidas
ru: "{0}": не разрешено пользовательское преобразование в производный тип или из производного типа.
zh_hans: “{0}”: 不允许进行以派生类型为转换源或目标的用户定义转换
zh_hant: '{0}': 與衍生類型之間不可進行使用者定義的轉換

# ERR_IdentityConversion
source: User-defined operator cannot convert a type to itself
cs: Uživatelem definovaný operátor nemůže převést typ sám na sebe.
fr: L’opérateur défini par l’utilisateur ne peut pas convertir un type en lui-même
it: L'operatore definito dall'utente non può convertire un tipo in se stesso
ja: ユーザー定義の演算子は、型をそれ自体に変換することはできません。
pl: Operator zdefiniowany przez użytkownika nie może dokonać konwersji typu na siebie
pt_br: O operador definido pelo usuário não pode converter um tipo para ele mesmo
ru: Определяемый пользователем оператор не может преобразовать тип в себя
zh_hans: 用户定义的运算符无法将类型转换为自身
zh_hant: 使用者定義的運算子無法將類型轉換成本身

# ERR_ConversionNotInvolvingContainedType
source: User-defined conversion must convert to or from the enclosing type
cs: Uživatelem definovaný převod musí převádět na nadřazený typ nebo z nadřazeného typu.
de: Die benutzerdefinierte Konvertierung muss zum oder vom einschließenden Typ konvertieren.
es: La conversión definida por el usuario debe realizarse en el tipo envolvente o desde este
fr: La conversion définie par l'utilisateur doit convertir vers le type englobant ou à partir de celui-ci
it: La conversione definita dall'utente deve eseguire la conversione verso o da un tipo di inclusione
ja: ユーザー定義の変換では、それを囲む型に/から変換しなければなりません
ko: 사용자 정의 변환은 바깥쪽 형식으로 변환하거나 바깥쪽 형식으로부터 변환해야 합니다.
pl: Zdefiniowana przez użytkownika konwersja musi dokonywać konwersji na typ otaczający lub z niego
pt_br: A conversão definida pelo usuário deve ser convertida a partir de ou em um tipo de delimitador
ru: Определенное пользователем преобразование должно осуществлять преобразование в данный включающий тип или из данного включающего типа.
tr: Kullanıcı tanımlı dönüştürme, kapsayan türe veya kapsayan türden dönüştürmelidir
zh_hans: 用户定义的转换必须是转换成封闭类型，或者从封闭类型转换
zh_hant: 使用者定義的轉換必須轉換為封入類型或從封入類型轉換

# ERR_DuplicateConversionInClass
source: Duplicate user-defined conversion in type '{0}'
cs: Duplicitní uživatelem definovaný převod v typu {0}
de: Doppelte benutzerdefinierte Konvertierung in Typ "{0}".
es: Conversión definida por el usuario duplicada en el tipo '{0}'
fr: La conversion définie par l'utilisateur dans le type '{0}' est en double
it: Conversione definita dall'utente duplicata nel tipo '{0}'
ja: 型 '{0}' で重複するユーザー定義の変換です
ko: {0}' 형식의 사용자 정의 변환이 중복되었습니다.
pl: Zduplikowana konwersja zdefiniowana przez użytkownika w typie „{0}”
pt_br: Duplicar convenção definida pelo usuário no tipo "{0}"
ru: Повторяющееся определенное пользователем преобразование в типе "{0}".
tr: {0}' türünde yinelenen kullanıcı tanımlı dönüştürme
zh_hans: 类型“{0}”中有重复的用户定义转换
zh_hant: 類型 '{0}' 中出現重複的使用者定義之轉換

# ERR_BadIncDecSignature
source: The parameter type for ++ or -- operator must be the containing type
cs: Typ parametru operátorů ++ a -- musí být nadřazeného typu.
de: Der Parametertyp für den Operator ++ oder -- muss der enthaltende Typ sein.
es: El tipo de parámetro para el operador ++ o -- debe ser el tipo contenedor
fr: Le type de paramètre pour l'opérateur ++ ou -- doit être le type conteneur
it: Il tipo di parametro per l'operatore ++ o -- deve essere il tipo che lo contiene
ja: ++ または -- 演算子のパラメーターの型は、それを含む型でなければなりません
ko: ++ 또는 -- 연산자의 매개 변수 형식은 포함하는 형식이어야 합니다.
pl: Typ parametru dla operatora ++ lub -- musi być typem zawierającym
pt_br: O tipo de parâmetro para o operador ++ ou -- deve ser do tipo recipiente
ru: Параметр для операторов ++ и -- должен иметь вмещающий тип.
tr: ++ veya -- işlecinin parametre türü, kapsayan tür olmalıdır
zh_hans: ++ 或 -- 运算符的参数类型必须是包含类型
zh_hant: ++ 或 -- 運算子的參數類型必須是包含類型

# ERR_BadUnaryOperatorSignature
source: The parameter of a unary operator must be the containing type
cs: Parametr unárního operátoru musí být nadřazeného typu.
de: Der Parameter eines unären Operators muss der enthaltende Typ sein.
es: El parámetro de un operador unario debe ser el tipo contenedor
fr: Le paramètre d'un opérateur unaire doit être le type conteneur
it: Il parametro di un operatore unario deve essere il tipo che lo contiene
ja: 単項演算子のパラメーターは、それを含む型でなければなりません
ko: 단항 연산자의 매개 변수는 포함하는 형식이어야 합니다.
pl: Parametr operatora jednoargumentowego musi być typem zawierającym
pt_br: O parâmetro de um operador unário deve ser do tipo recipiente
ru: Тип параметра унарного оператора должен быть вмещающим.
tr: Birli işleç parametresi kapsayan tür olmalıdır
zh_hans: 一元运算符的参数必须是包含类型
zh_hant: 一元運算子的參數必須為包含類型

# ERR_BadBinaryOperatorSignature
source: One of the parameters of a binary operator must be the containing type
cs: Jeden z parametrů binárního operátoru musí být nadřazeného typu.
de: Einer der Parameter eines binären Operators muss der enthaltende Typ sein.
es: Uno de los parámetros de un operador binario debe ser el tipo contenedor
fr: Un des paramètres d'un opérateur binaire doit être le type conteneur
it: Uno dei parametri di un operatore binario deve essere il tipo che lo contiene
ja: バイナリ演算子のパラメーターの 1 つはそれを含む型でなければなりません
ko: 이항 연산자의 매개 변수 중 하나는 포함하는 형식이어야 합니다.
pl: Jeden z parametrów operatora binarnego musi być typem zawierającym
pt_br: Um dos parâmetros de um operador binário deve ser do tipo recipiente
ru: Тип одного из параметров бинарного оператора должен быть вмещающим.
tr: İkili işlecin parametrelerinden biri kapsayan tür olmalıdır
zh_hans: 二元运算符的参数之一必须是包含类型
zh_hant: 二元運算子的一個參數必須為包含類型

# ERR_BadShiftOperatorSignature
source: The first operand of an overloaded shift operator must have the same type as the containing type
cs: První operand přetěžovaného operátoru shift musí být stejného typu jako obsahující typ.
fr: Le premier opérande d’un opérateur shift surchargé doit avoir le même type que le type conteneur
it: Il primo operando di un operatore di spostamento sovraccaricato deve avere lo stesso tipo del tipo contenitore
ja: オーバーロードされた shift 演算子の最初のオペランドはそれを含む型と同じ型
pl: Pierwszy operand przeciążonego operatora przesunięcia musi mieć ten sam typ co typ zawierający
pt_br: A primeira operação de um operador de deslocamento sobrecarregado deve ter o mesmo tipo que o tipo que o contém
ru: Тип первого операнда перегруженного оператора сдвига должен совпадать с содержащим типом
zh_hans: 重载移位运算符的第一个操作数的类型必须与包含类型相同
zh_hant: 多載移位 (Shift) 運算子的第一個運算元的類型必須和包含類型相同

# ERR_EnumsCantContainDefaultConstructor
source: Enums cannot contain explicit parameterless constructors
cs: Výčty nemůžou obsahovat explicitní konstruktory bez parametrů.
de: Enumerationen können keine expliziten parameterlosen Konstruktoren enthalten.
es: Las enumeraciones no pueden contener constructores explícitos sin parámetros
fr: Les enums ne peuvent pas contenir de constructeurs sans paramètre explicites
it: Le enumerazioni non possono contenere costruttori espliciti senza parametri
ja: 列挙型は明示的なパラメーターなしのコンス トラクターを含めることはできません
ko: 열거형은 명시적인 매개 변수가 없는 생성자를 포함할 수 없습니다.
pl: Wyliczenia nie mogą zawierać jawnych konstruktorów bez parametrów
pt_br: Enums não podem conter construtores explícitos sem parâmetros
ru: Перечисления не могут содержать явные конструкторы без параметров
tr: Sabit listeleri açık parametresiz oluşturucu içeremez
zh_hans: 枚举不能包含显式无参数构造函数
zh_hant: 列舉不能包含明確的無參數建構函式

# ERR_CantOverrideBogusMethod
source: '{0}': cannot override '{1}' because it is not supported by the language
cs: {0} nemůže přepsat {1}, protože ho tento jazyk nepodporuje.
de: '"{1}" wird von der Sprache nicht unterstützt und kann deshalb von "{0}" nicht überschrieben werden.
es: '{0}': no se puede invalidar '{1}' porque el lenguaje no lo admite
fr: '{0}' : impossible de substituer '{1}', car il n'est pas pris en charge par le langage
it: '{0}': non è possibile eseguire l'override di '{1}' perché non è supportato dal linguaggio
ja: '{0}': '{1}' はこの言語でサポートされていないため、オーバーライドできません
ko: '{0}': '{1}'은(는) 해당 언어에서 지원되지 않으므로 재정의할 수 없습니다.
pl: „{0}” nie może przesłonić „{1}”, ponieważ nie jest to obsługiwane przez język
pt_br: "{0}": não é possível substituir "{1}" porque não é suportado pelo idioma
ru: "{0}": невозможно переопределение "{1}", так как такая операция в данном языке не поддерживается.
tr: '{0}': dil tarafından desteklenmediği için '{1}' öğesi geçersiz kılınamıyor
zh_hans: “{0}”: 无法重写“{1}”，因为该语言不支持它
zh_hant: '{0}': 因為此語言不支援 '{1}'，所以無法覆寫

# ERR_BindToBogus
source: '{0}' is not supported by the language
cs: {0} není tímto jazykem podporovaný.
de: '"{0}" wird von der Sprache nicht unterstützt.
es: '{0}' no es compatible con el idioma
fr: '{0}' n'est pas pris en charge par le langage
it: '{0}' non è supportato dal linguaggio
ja: '{0}' はこの言語でサポートされていません
ko: '{0}'은(는) 언어에서 지원되지 않습니다.
pl: 'Element „{0}” nie jest obsługiwany przez język.
pt_br: 'O idioma não dá suporte a "{0}"
ru: '{0}' не поддерживается данным языком.
tr: '{0}' dil tarafından desteklenmiyor
zh_hans: '现用语言不支持“{0}”
zh_hant: '此語言不支援 '{0}'

# ERR_CantCallSpecialMethod
source: '{0}': cannot explicitly call operator or accessor
cs: {0}: Nejde explicitně volat operátor nebo přistupující objekt.
de: '{0}: Der Operator oder Accessor kann nicht explizit aufgerufen werden.
es: '{0}': no se puede llamar explícitamente al operador ni al descriptor de acceso
fr: '{0}' : impossible d'appeler explicitement un opérateur ou un accesseur
it: '{0}': non è possibile chiamare in modo esplicito l'operatore o la funzione di accesso
ja: '{0}': 演算子またはアクセサーを明示的に呼び出すことはできません
ko: '{0}': 연산자나 접근자를 명시적으로 호출할 수 없습니다.
pl: „{0}”: nie można jawnie wywołać operatora lub metody dostępu.
pt_br: "{0}": não é possível chamar explicitamente o operador ou acessador
ru: "{0}": явный вызов оператора или метода доступа невозможен.
tr: '{0}': işleç veya erişimciyi doğrudan çağıramaz
zh_hans: “{0}”: 无法显式调用运算符或访问器
zh_hant: '{0}': 無法明確呼叫運算子或存取子

# ERR_BadTypeReference
source: '{0}': cannot reference a type through an expression; try '{1}' instead
cs: {0}: Nemůže odkazovat na typ prostřednictvím výrazu. Místo toho zkuste {1}.
de: '"{0}": Auf einen Typ kann nicht durch einen Ausdruck verwiesen werden. Verwenden Sie stattdessen "{1}".
es: '{0}': no se puede hacer referencia a un tipo a través de una expresión; pruebe con '{1}'
fr: '{0}' : impossible de référencer un type par l'intermédiaire d'une expression ; essayez plutôt '{1}'
it: '{0}': non è possibile fare riferimento a un tipo con un'espressione. Provare con '{1}'
ja: '{0}': 式から型を参照することはできません。'{1}' を使用してください
ko: '{0}': 식을 통해 형식을 참조할 수 없습니다. 대신 '{1}'을(를) 시도하세요.
pl: „{0}”: nie można odwołać się do typu przy użyciu wyrażenia. Spróbuj użyć „{1}”
pt_br: "{0}": não é possível fazer referência a um tipo por meio de uma expressão; ao invés disso, tente "{1}"
ru: "{0}": невозможно сослаться на тип через выражение; попытайтесь использовать "{1}".
tr: '{0}': bir türe ifade üzerinden başvurulamaz; bunun yerine '{1}' deneyin
zh_hans: “{0}”: 无法通过表达式引用类型；请尝试“{1}”
zh_hant: '{0}': 不可透過運算式參考類型; 請嘗試改用 '{1}'

# ERR_BadDestructorName
source: Name of destructor must match name of type
cs: Název destruktoru musí odpovídat názvu typu.
fr: Le nom du destructeur doit correspondre au nom du type
it: Il nome del distruttore deve corrispondere al nome del tipo
ja: デストラクターの名前を型の名前と同じにしてください
pl: Nazwa destruktora musi być zgodna z nazwą typu
pt_br: O nome do destruidor precisa corresponder ao nome do tipo
ru: Имя деструктора должно соответствовать имени типа.
zh_hans: 析构函数的名称必须与类型的名称匹配
zh_hant: 解構函式的名稱必須符合類型的名稱

# ERR_OnlyClassesCanContainDestructors
source: Only class types can contain destructors
cs: Destruktor může být obsažený jenom v typu třída.
de: Nur Klassentypen können Destruktoren enthalten.
es: Solo los tipos de clase pueden contener destructores
fr: Seuls les types classe peuvent contenir des destructeurs
it: Solo i tipi classe possono contenere distruttori
ja: クラスのみがデストラクターを含むことができます
ko: 클래스 형식만 소멸자를 포함할 수 있습니다.
pl: Tylko typy klasy mogą zawierać destruktory
pt_br: Somente tipos de classe podem conter destruidores
ru: Деструкторы могут содержаться только в типах классов.
tr: Yalnızca sınıf türleri yıkıcı içerebilir
zh_hans: 只有类类型才能包含析构函数
zh_hant: 只有類別類型可以包含解構函式

# ERR_ConflictAliasAndMember
source: Namespace '{1}' contains a definition conflicting with alias '{0}'
cs: Obor názvů {1} obsahuje definici, která je v konfliktu s aliasem {0}.
de: Der Namespace "{1}" enthält eine Definition, die mit dem Alias "{0}" in Konflikt steht.
es: El espacio de nombres '{1}' contiene una definición que entra en conflicto con el alias '{0}'
fr: L'espace de noms '{1}' contient une définition en conflit avec l'alias '{0}'
it: Lo spazio dei nomi '{1}' contiene una definizione in conflitto con l'alias '{0}'
ja: 名前空間 '{1}' は、エイリアス '{0}' と競合する定義を含んでいます
ko: {1}' 네임스페이스에 '{0}' 별칭과 충돌하는 정의가 포함되어 있습니다.
pl: Przestrzeń nazw „{1}” zawiera definicję powodującą konflikt z aliasem „{0}”
pt_br: Namespace "{1}" contém uma definição em conflito com o alias "{0}"
ru: Пространство имен "{1}" содержит определение, конфликтующее с псевдонимом "{0}".
tr: {1}' ad alanı '{0}' diğer adıyla çakışan bir tanım içeriyor
zh_hans: 命名空间“{1}”包含与别名“{0}”冲突的定义
zh_hant: 命名空間 '{1}' 包含與別名 '{0}' 相衝突的定義

# ERR_ConflictingAliasAndDefinition
source: Alias '{0}' conflicts with {1} definition
cs: Alias {0} je v konfliktu s definicí {1}.
de: Der Alias "{0}" steht mit der Definition "{1}" in Konflikt.
es: El alias '{0}' entra en conflicto con {1} definición
fr: L'alias '{0}' est en conflit avec la définition de {1}
it: L'alias '{0}' è in conflitto con la definizione di {1}
ja: エイリアス '{0}' は定義 {1} と競合しています
ko: {0}' 별칭이 {1} 정의와 충돌합니다.
pl: Alias „{0}” jest w konflikcie z definicją {1}
pt_br: Alias "{0}" está em conflito com {1} definição
ru: Псевдоним "{0}" конфликтует с определением {1}.
tr: {0}' diğer adı {1} tanımıyla çakışıyor
zh_hans: 别名“{0}”与 {1} 定义冲突
zh_hant: 別名 '{0}' 與 {1} 定義相衝突

# ERR_ConditionalOnSpecialMethod
source: The Conditional attribute is not valid on '{0}' because it is a constructor, destructor, operator, lambda expression, or explicit interface implementation
cs: Atribut Conditional není pro {0} platný, protože je to konstruktor, destruktor, operátor, výraz lambda nebo explicitní implementace rozhraní.
fr: L'attribut Conditional n'est pas valide sur '{0}', car il s'agit d'un constructeur, d'un destructeur, d'un opérateur lambda ou d'une implémentation d'interface explicite
it: L'attributo Conditional non è valido per '{0}' perché è l'implementazione di un costruttore, distruttore, espressione lambda, operatore o interfaccia esplicita
ja: 条件付き属性は、コンストラクター、デストラクター、演算子、ラムダ式、明示的インターフェイスのいずれかの実装であるため、'{0}' では無効です
pl: Atrybut Conditional jest nieprawidłowy w elemencie "{0}", ponieważ jest to konstruktor, destruktor, operator, wyrażenie lambda lub wyraźna implementacja interfejsu
pt_br: O atributo Conditional não é válido em "{0}" porque é um construtor, destruidor, operado, expressão lambda ou implementação de interface explícita
ru: Атрибут Conditional недопустим для "{0}", так как это конструктор, деструктор, оператор, лямбда-выражение или явная реализация интерфейса
zh_hans: 条件属性在 '{0}' 上无效，因为它是构造函数、析构函数、运算符、Lambda 表达式或显式接口实现
zh_hant: Conditional 屬性在 '{0}' 上無效，因為其為建構函式、解構函式、運算子、Lambda 運算式或明確介面實作

# ERR_ConditionalMustReturnVoid
source: The Conditional attribute is not valid on '{0}' because its return type is not void
cs: Atribut Conditional není pro {0} platný, protože jeho návratový kód není void.
de: Das Conditional-Attribut ist für "{0}" nicht gültig, weil der Rückgabetyp nicht leer ist.
es: El atributo Conditional no es válido en '{0}' porque su tipo de valor devuelto no es void
fr: L'attribut Conditional n'est pas valide sur '{0}', car son type de retour n'est pas void
it: L'attributo Conditional non è valido per '{0}' perché il tipo restituito non è void
ja: 戻り値の型が void でないため、条件付き属性は '{0}' では無効です
ko: 반환 형식이 void가 아니므로 '{0}'에서는 Conditional 특성이 유효하지 않습니다.
pl: Atrybut Conditional jest nieprawidłowy w elemencie „{0}”, ponieważ jego typem zwracanym nie jest void
pt_br: O atributo Conditional não é válido em "{0}" porque seu tipo de retorno não é nulo
ru: Атрибут Conditional для "{0}" недопустим, так как возвращаемый тип не является недействительным.
tr: Dönüş türü geçersiz olmadığından Conditional özniteliği '{0}' üzerinde geçerli değil
zh_hans: Conditional 特性在“{0}”上无效，因为其返回类型不是 void
zh_hant: Conditional 屬性在 '{0}' 上無效，因為其傳回類型不是 void

# ERR_DuplicateAttribute
source: Duplicate '{0}' attribute
cs: Duplicitní atribut {0}
de: Doppeltes Attribut "{0}".
es: Atributo '{0}' duplicado
fr: Attribut '{0}' en double
it: L'attributo '{0}' è duplicato
ja: '{0}' 属性が重複しています
ko: {0}' 특성이 중복되었습니다.
pl: Zduplikowany atrybut „{0}”
pt_br: Duplicar atributo "{0}"
ru: Повторяющийся атрибут "{0}"
tr: Yinelenen '{0}' özniteliği
zh_hans: “{0}”特性重复
zh_hant: '{0}' 屬性重複

# ERR_DuplicateAttributeInNetModule
source: Duplicate '{0}' attribute in '{1}'
cs: Duplicitní atribut {0} v {1}
de: Doppeltes Attribut "{0}" in "{1}".
es: Atributo '{0}' duplicado en '{1}'
fr: Attribut '{0}' en double dans '{1}'
it: L'attributo '{0}' è duplicato in '{1}'
ja: '{0}' 属性が '{1}' で重複しています
ko: {1}'에서 '{0}' 특성이 중복되었습니다.
pl: Zduplikowany atrybut „{0}” w elemencie „{1}”
pt_br: Duplicar atributo "{0}" em "{1}"
ru: Повторяющийся атрибут "{0}" в "{1}"
tr: {1}' öğesindeki yinelenen '{0}' özniteliği
zh_hans: “{0}”特性在“{1}”中重复
zh_hant: '{1}' 中的 '{0}' 屬性重複

# ERR_ConditionalOnInterfaceMethod
source: The Conditional attribute is not valid on interface members
cs: Pro členy rozhraní je atribut Conditional neplatný.
de: Das Conditional-Attribut ist für Schnittstellenmember ungültig.
es: El atributo Conditional no es válido en miembros de interfaz
fr: L'attribut Conditional n'est pas valide sur les membres d'interface
it: L'attributo Conditional non è valido per i membri di interfaccia
ja: インターフェイス メンバーに対して、条件付き属性は使用できません
ko: 인터페이스 멤버에서는 Conditional 특성을 사용할 수 없습니다.
pl: Atrybut Conditional jest nieprawidłowy w składowych interfejsu
pt_br: O atributo Conditional não é válido em membros de interface
ru: Атрибут Conditional недопустим для членов интерфейса.
tr: Conditional özniteliği arabirim üyeleri üzerinde geçerli değildir
zh_hans: Conditional 特性在接口成员上无效
zh_hant: Conditional 屬性不能用在介面成員上

# ERR_OperatorCantReturnVoid
source: User-defined operators cannot return void
cs: Operátory definované uživatelem nemůžou vracet typ void.
de: Benutzerdefinierte Operatoren können nicht "void" zurückgeben.
es: Los operadores definidos por el usuario no pueden devolver un valor void
fr: Les opérateurs définis par l'utilisateur ne peuvent pas retourner void
it: Gli operatori definiti dall'utente non possono restituire void
ja: ユーザー定義の演算子は void を返すことはできません
ko: 사용자 정의 연산자는 void를 반환할 수 없습니다.
pl: Zdefiniowane przez użytkownika operatory nie mogą zwracać wartości void
pt_br: Operadores definidos pelo usuário não podem retornar void
ru: Определяемые пользователем операторы не могут возвращать значения типа void.
tr: Kullanıcı tanımlı işleçler void döndüremez
zh_hans: 用户定义的运算符不能返回 void
zh_hant: 使用者定義的運算子無法傳回 void

# ERR_BadDynamicConversion
source: '{0}': user-defined conversions to or from the dynamic type are not allowed
cs: {0}: Uživatelsky definované převody na dynamický typ nebo z dynamického typu nejsou povolené.
de: '"{0}": Benutzerdefinierte Konvertierungen in oder aus dem dynamischen Typ sind nicht zulässig.
es: '{0}': no se permiten conversiones definidas por el usuario ni al tipo dinámico ni desde él.
fr: '{0}' : les conversions définies par l'utilisateur vers ou à partir du type dynamic ne sont pas autorisées
it: '{0}': le conversioni definite dall'utente nel o dal tipo dinamico non sono consentite
ja: '{0}': 動的な型との間でユーザー定義の変換を行うことはできません
ko: '{0}': 동적 유형과의 사용자 정의 변환은 허용되지 않습니다.
pl: „{0}”: zdefiniowane przez użytkownika konwersje na lub z typu dynamicznego nie są dozwolone
pt_br: "{0}": conversões definidas pelo usuário para ou do tipo dinâmico não são permitidas
ru: "{0}": пользовательские преобразования в динамические типы или из них не разрешены.
tr: '{0}': dinamik türe veya dinamik türden kullanıcı tanımlı dönüştürmelere izin verilmiyor
zh_hans: “{0}”: 不允许对动态类型执行用户定义的转换
zh_hant: '{0}': 動態類型之間不可進行使用者定義的轉換

# ERR_InvalidAttributeArgument
source: Invalid value for argument to '{0}' attribute
cs: Neplatná hodnota pro argument u atributu {0}
de: Ungültiger Wert für das Argument zum {0}-Attribut.
es: Valor no válido para el argumento del atributo '{0}'
fr: Valeur non valide pour l'argument de l'attribut '{0}'
it: Il valore specificato per l'argomento dell'attributo '{0}' non è valido
ja: '{0}' 属性の引数の値が無効です
ko: {0}' 특성에 대해 잘못된 인수 값입니다.
pl: Nieprawidłowa wartość argumentu dla atrybutu „{0}”
pt_br: Valor inválido para o argumento ao atributo "{0}"
ru: Недопустимое значение аргумента атрибута "{0}".
tr: {0}' özniteliğine yönelik bağımsız değişken için geçersiz değer
zh_hans: “{0}”特性的参数值无效
zh_hant: '{0}' 屬性的引數值無效
