Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AssgReadonlyPrimaryConstructorParameter
source: A primary constructor parameter of a readonly type cannot be assigned to (except in init-only setter of the type or a variable initializer)
cs: Parametr primárního konstruktoru typu jen pro čtení nejde přiřadit (s výjimkou nastavovacího kódu typu jenom pro inicializaci nebo inicializátoru proměnné).
fr: Un paramètre de constructeur primaire d’un type en lecture seule ne peut pas être assigné (sauf dans le setter init-only du type ou dans un initialisateur de variable).
it: Non è assegnare un parametro del costruttore primario di un tipo di sola lettura, tranne che nel setter di sola inizializzazione del tipo o in un inizializzatore di variabile
ja: 読み取り専用型のプライマリ コンストラクター パラメーターを割り当てることはできません (型または変数初期化子の init 専用セッターを除く)。
pl: Podstawowy parametr konstruktora typu tylko do odczytu nie może być przypisany (z wyjątkiem setera inicjującego typu lub inicjalizatora zmiennej)
pt_br: Um parâmetro de construtor primário de um tipo somente leitura não pode ser atribuído (exceto no setter somente inicialização do tipo ou em um inicializador de variável)
ru: Параметр основного конструктора типа, доступного только для чтения, нельзя использовать в назначении (за исключением метода задания с типом, предназначенным только для инициализации, или инициализатора переменной)
zh_hans: 无法将只读类型的主构造函数参数分配给(在该类型的 init-only 设定子或变量初始值设定项中除外)
zh_hant: 無法指派唯讀類型的主要建構函式參數 (類型的 init-only setter 或變數初始設定式中除外)

# ERR_AssgReadonlyPrimaryConstructorParameter2
source: Members of primary constructor parameter '{0}' of a readonly type cannot be modified (except in init-only setter of the type or a variable initializer)
cs: Členy parametru primárního konstruktoru {0} typu jen pro čtení nejde změnit (s výjimkou nastavovacího kódu typu jenom pro inicializaci nebo inicializátoru proměnné).
fr: Les membres du paramètre du constructeur principal '{0}' d'un type en lecture seule ne peuvent pas être modifiés (sauf dans le setter de init-only du type ou dans l'initialiseur de variable).
it: Non è possibile modificare i membri del parametro del costruttore primario '{0}' di un tipo di sola lettura, tranne che nel setter di sola inizializzazione del tipo o in un inizializzatore di variabile
ja: 読み取り専用型のプライマリ コンストラクター パラメーター '{0}' のメンバーは変更できません (型または変数初期化子の init 専用セッターを除く)
pl: Elementy podstawowego parametru konstruktora '{0}' typu tylko do odczytu nie mogą być modyfikowane (z wyjątkiem inicjującego settera typu lub inicjalizatora zmiennej)
pt_br: Os membros do parâmetro de construtor primário "{0}" de um tipo somente leitura não podem ser modificados (exceto no setter somente inicializador init do tipo ou em um inicializador de variável)
ru: Элементы параметра основного конструктора "{0}" типа, доступного только для чтения, нельзя изменить (за исключением метода задания с типом, предназначенным только для инициализации, или инициализатора переменной)
zh_hans: 无法修改只读类型的主构造函数参数“{0}”的成员(在该类型的 init-only 设定子或变量初始值设定项中除外)
zh_hant: 無法修改唯讀類型的主要建構函式參數 '{0}' 的成員 (類型的 init-only setter 或變數初始設定式中除外)

# ERR_AssignmentInitOnly
source: Init-only property or indexer '{0}' can only be assigned in an object initializer, or on 'this' or 'base' in an instance constructor or an 'init' accessor.
cs: Vlastnost jenom pro inicializaci nebo indexer {0} se dá přiřadit jenom k inicializátoru objektu, pomocí klíčového slova this nebo base v konstruktoru instance nebo k přístupovému objektu init.
fr: La propriété ou l'indexeur d'initialisation uniquement '{0}' ne peut être assigné que dans un initialiseur d'objet, ou sur 'this' ou 'base' dans un constructeur d'instance ou un accesseur 'init'.
it: L'indicizzatore o la proprietà di sola inizializzazione '{0}' può essere assegnata solo in un inizializzatore di oggetto oppure in 'this' o 'base' in un costruttore di istanza o una funzione di accesso 'init'.
ja: init 専用プロパティまたはインデクサー '{0}' を割り当てることができるのは、オブジェクト初期化子の中か、インスタンス コンストラクターまたは 'init' アクセサーの 'this' か 'base' 上のみです。
pl: Właściwość lub indeksator „{0}” tylko do inicjowania można przypisać tylko w inicjatorze obiektu, w elemencie „this” lub „base” w konstruktorze wyrażenia albo w metodzie dostępu „init”.
pt_br: A propriedade somente de inicialização ou o indexador '{0}' só pode ser atribuído em um inicializador de objeto, em 'this' ou 'base' em um construtor de instância ou em um acessador 'init'.
ru: Значение свойства, задаваемого только при инициализации, или значение индексатора "{0}" может быть присвоено только в инициализаторе объекта, в свойствах "this" или "base" в конструкторе экземпляра или в методе доступа "init".
zh_hans: 只能在对象初始值设定项中或在实例构造函数或 "init" 访问器中的 "this" 或 "base" 上分配 init-only 属性或索引器 "{0}"。
zh_hant: 只有物件初始設定式中，或執行個體建構函式中 'this' 或 'base' 上僅供初始化的屬性或索引子 '{0}' 或 'init' 存取子可以指派。

# ERR_AttrDependentTypeNotAllowed
source: Type '{0}' cannot be used in this context because it cannot be represented in metadata.
cs: Typ {0} nelze v tomto kontextu použít, protože se nedá reprezentovat v metadatech.
fr: Le type « {0} » ne peut pas être utilisé dans ce contexte, car il ne peut pas être représenté dans les métadonnées.
it: Non è possibile usare il tipo '{0}' in questo contesto perché non può essere rappresentato nei metadati.
ja: 型 '{0}' は、メタデータで表現できないため、このコンテキストでは使用できません。
pl: Typ „{0}” nie może być używany w tym kontekście, ponieważ nie może być reprezentowany w metadanych.
pt_br: O tipo '{0}' não pode ser usado neste contexto porque ele não pode ser representado em metadados.
ru: Тип "{0}" нельзя использовать в этом контексте, так как он не может быть представлен в метаданных.
zh_hans: 类型“{0}”不能在此上下文中使用，因为它不能在元数据中表示。
zh_hant: 無法在此內容中使用類型 '{0}'，因為它無法在中繼資料中表示。

# ERR_AttrTypeArgCannotBeTypeVar
source: '{0}': an attribute type argument cannot use type parameters
cs: {0}: argument typu atributu nemůže používat parametry obecného typu.
fr: « {0} » : un argument d'attribut ne peut pas utiliser de paramètres de type
it: '{0}': un argomento di tipo di attributo non può usare parametri di tipo
ja: '{0}': 属性の型引数では型パラメーターを使用することができません
pl: "{0}": argument typu atrybut nie może używać parametrów typu
pt_br: '{0}': um argumento de tipo de atributo não pode usar parâmetro de tipo
ru: "{0}": аргумент типа атрибута не может использовать параметры типа
zh_hans: “{0}”: 特性类型参数不能使用类型参数
zh_hant: '{0}': 屬性型別引數不可使用型別參數

# ERR_AttributeCannotBeAppliedManually
source: '{0}' cannot be applied manually.
pt_br: "{0}" não pode ser aplicado manualmente.

# ERR_AttributeNotOnEventAccessor
source: Attribute '{0}' is not valid on event accessors. It is only valid on '{1}' declarations.
cs: Atribut {0} není platný pro přístupové objekty události. Je platný jenom pro deklarace {1}.
de: Das Attribut "{0}" ist für Ereignisaccessoren nicht gültig. Es gilt nur für {1}-Deklarationen.
es: El atributo "{0}" no es válido en descriptores de acceso de eventos. Solo es válido en declaraciones "{1}".
fr: L'attribut '{0}' est non valide sur les accesseurs d'événement. Il est valide uniquement sur les déclarations '{1}'.
it: L'attributo '{0}' non è valido nelle funzioni di accesso a eventi. È valido solo nelle dichiarazioni di '{1}'.
ja: 属性 '{0}' はイベント アクセサーでは無効です。'{1}' 宣言でのみ有効です。
ko: 이벤트 접근자에서 '{0}' 특성이 유효하지 않습니다. 이 특성은 '{1}' 선언에만 유효합니다.
pl: Atrybut „{0}” nie jest prawidłowy w metodach dostępu zdarzenia. Jest on prawidłowy tylko w deklaracjach „{1}”.
pt_br: O atributo '{0}' não é válido em acessadores de evento. Ele é válido somente em declarações '{1}'.
ru: Атрибут "{0}" запрещено использовать в методах доступа к событиям. Он допустим только для объявлений "{1}".
tr: '{0}' özniteliği olay erişimcilerinde geçerli değil. Bu öznitelik yalnızca '{1}' bildirimlerinde geçerlidir.
zh_hans: 特性“{0}”对事件访问器无效。它仅对“{1}”声明有效。
zh_hant: 屬性 '{0}' 在事件存取子上無效。其只有在 '{1}' 宣告上才有效。

# ERR_AttributesRequireParenthesizedLambdaExpression
source: Attributes on lambda expressions require a parenthesized parameter list.
cs: Atributy ve výrazech lambda vyžadují seznam parametrů v závorkách.
fr: Les attributs sur les expressions lambda nécessitent une liste de paramètres entre parenthèses.
it: Gli attributi nelle espressioni lambda richiedono un elenco di parametri tra parentesi.
ja: ラムダ式での属性には、かっこで囲まれたパラメーター リストが必要です。
pl: Atrybuty w wyrażeniach lambda wymagają listy parametrów ujętych w nawiasy.
pt_br: Atributos em expressões lambda exigem uma lista de parâmetros entre parênteses.
ru: Для атрибутов в лямбда-выражениях требуется указать список параметров в круглых скобках.
zh_hans: Lambda 表达式上的属性需要拥有带圆括号的参数列表。
zh_hant: Lambda 運算式上的屬性需要小括號內的參數清單。

# ERR_AutoPropertyWithSetterCantBeReadOnly
source: Auto-implemented property '{0}' cannot be marked 'readonly' because it has a 'set' accessor.
cs: Automaticky implementovanou vlastnost {0} nelze označit modifikátorem readonly, protože má přístupový objekt set.
de: Die automatisch implementierte Eigenschaft "{0}" kann nicht als "readonly" markiert werden, weil sie einen set-Accessor aufweist.
es: La propiedad implementada automáticamente "{0}" no se puede marcar como "readonly" porque tiene un descriptor de acceso "set".
fr: La propriété implémentée automatiquement '{0}' ne peut pas être marquée 'readonly', car elle a un accesseur 'set'.
it: La proprietà implementata automaticamente '{0}' non può essere contrassegnata come 'readonly' perché include una funzione di accesso 'set'.
ja: 'set' アクセサーがあるため、自動実装プロパティ '{0}' を 'readonly' とマークすることはできません。
ko: 'set' 접근자가 포함되어 있으므로 자동 구현 속성 '{0}'을(를) 'readonly'로 표시할 수 없습니다.
pl: Właściwość implementowana automatycznie „{0}” nie może być zadeklarowana jako „readonly”, ponieważ ma metodę dostępu „set”.
pt_br: A propriedade autoimplementada '{0}' não pode ser marcada como 'readonly' porque ela tem um acessador 'set'.
ru: Автоматически реализуемое свойство "{0}" не может быть помечено как readonly, так как имеет метод доступа set.
tr: Otomatik olarak uygulanan '{0}' özelliği 'set' erişimcisine sahip olduğundan 'readonly' olarak işaretlenemez.
zh_hans: 无法将自动实现的属性 "{0}" 标记为 "readonly"，因为它具有 "set" 访问器。
zh_hant: 因為自動實作屬性 '{0}' 有 'set' 存取子，所以無法將其標記為 'readonly'。

# ERR_AutoSetterCantBeReadOnly
source: Auto-implemented 'set' accessor '{0}' cannot be marked 'readonly'.
cs: Automaticky implementovaný přístupový objekt set {0} nelze označit modifikátorem readonly.
de: Der automatisch implementierte set-Accessor "{0}" kann nicht als "readonly" markiert werden.
es: El descriptor de acceso "set" implementado automáticamente "{0}" no puede marcarse como "readonly".
fr: L'accesseur 'set' '{0}' implémenté automatiquement ne peut pas être marqué 'readonly'.
it: La funzione di accesso 'set' '{0}' implementata automaticamente non può essere contrassegnata come 'readonly'.
ja: 自動実装の 'set' アクセサー '{0}' を 'readonly' とマークすることはできません。
ko: 자동 구현 'set' 접근자 '{0}'을(를) 'readonly'로 표시할 수 없습니다.
pl: Automatycznie implementowana metoda dostępu „set” „{0}” nie może być zadeklarowana jako „readonly”.
pt_br: O acessador 'set' autoimplementado '{0}' não pode ser marcado como 'readonly'.
ru: Автоматически реализуемый метод доступа set "{0}" не может быть помечен как readonly.
tr: Otomatik olarak uygulanan '{0}' 'set' erişimcisi, 'readonly' olarak işaretlenemez.
zh_hans: 自动实现的的 "set" 访问器 "{0}" 不能标记为 "readonly"。
zh_hant: 無法將自動實作 'set' 存取子 '{0}' 標記為 'readonly'。

# ERR_AwaitForEachMissingMember
source: Asynchronous foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a suitable public instance or extension definition for '{1}'
cs: Asynchronní příkaz foreach nejde použít pro proměnné typu {0}, protože {0} neobsahuje vhodnou veřejnou definici instance nebo rozšíření pro {1}.
fr: L'instruction foreach asynchrone ne peut pas fonctionner sur des variables de type '{0}', car '{0}' ne contient aucune définition d'extension ou d'instance publique appropriée pour '{1}'
it: L'istruzione foreach asincrona non può funzionare con variabili di tipo '{0}' perché '{0}' non contiene una definizione di istanza o estensione pubblica idonea per '{1}'
ja: '{0}' は '{1}' の適切なパブリック インスタンスまたは拡張機能の定義を含んでいないため、型 '{0}' の変数に対して非同期 foreach ステートメントを使用することはできません
pl: Asynchroniczna instrukcja foreach nie może operować na zmiennych typu „{0}”, ponieważ typ „{0}” nie zawiera odpowiedniego publicznego wystąpienia lub definicji rozszerzenia dla elementu „{1}”
pt_br: A instrução foreach assíncrona não pode operar em variáveis do tipo '{0}' porque '{0}' não contém uma definição de extensão ou de instância pública adequada para '{1}'
ru: Асинхронный оператор foreach не работает с переменными типа "{0}", так как "{0}" не содержит подходящее открытое определение экземпляра или расширения для "{1}".
zh_hans: “{0}”不包含“{1}”的适当公共实例或扩展定义，因此异步 foreach 语句不能作用于“{0}”类型的变量
zh_hant: 因為 '{0}' 不包含 '{1}' 的公用執行個體或延伸模組定義，所以非同步的 foreach 陳述式無法在型別 '{0}' 的變數上運作

# ERR_AwaitForEachMissingMemberWrongAsync
source: Asynchronous foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance or extension definition for '{1}'. Did you mean 'foreach' rather than 'await foreach'?
cs: Asynchronní příkaz foreach nejde použít pro proměnné typu {0}, protože {0} neobsahuje veřejnou definici instance nebo rozšíření pro {1}. Měli jste v úmyslu foreach místo await foreach?
fr: L'instruction foreach asynchrone ne peut pas fonctionner sur des variables de type '{0}', car '{0}' ne contient pas de définition d'extension ou d'instance publique pour '{1}'. Vouliez-vous dire 'foreach' plutôt que 'await foreach' ?
it: L'istruzione foreach asincrona non può funzionare con variabili di tipo '{0}' perché '{0}' non contiene una definizione di istanza o estensione pubblica per '{1}'. Si intendeva 'foreach' invece di 'await foreach'?
ja: '{0}' は '{1}' のパブリック インスタンスまたは拡張機能の定義を含んでいないため、型 '{0}' の変数に対して非同期 foreach ステートメントを使用することはできません。'await foreach' ではなく 'foreach' ですか?
pl: Asynchroniczna instrukcja foreach nie może operować na zmiennych typu „{0}”, ponieważ typ „{0}” nie zawiera publicznego wystąpienia lub definicji rozszerzenia dla elementu „{1}”. Czy planowano użyć instrukcji „foreach”, a nie „await foreach”?
pt_br: A instrução foreach assíncrona não pode operar em variáveis do tipo '{0}' porque '{0}' não contém uma definição de extensão ou de instância pública para '{1}'. Você quis dizer 'foreach' em vez de 'await foreach'?
ru: Асинхронный оператор foreach не работает с переменными типа "{0}", так как "{0}" не содержит открытое определение экземпляра или расширения для "{1}" Возможно, вы имели в виду "foreach", а не "await foreach"?
zh_hans: “{0}”不包含“{1}”的公共实例或扩展定义，因此异步 foreach 语句不能作用于“{0}”类型的变量。是否希望使用 "foreach" 而非 "await foreach"?
zh_hant: 因為 '{0}' 不包含 '{1}' 的公用執行個體或延伸模組定義，所以非同步的 foreach 陳述式無法在型別 '{0}' 的變數上運作。您指的是 'foreach' 而不是 'await foreach' 嗎?

# ERR_BadAbstractBinaryOperatorSignature
source: One of the parameters of a binary operator must be the containing type, or its type parameter constrained to it.
cs: Jeden z parametrů binárního operátoru musí být nadřazeného typu nebo jeho parametrem obecného typu, který se na něj omezuje.
fr: L’un des paramètres d’un opérateur binaire doit être le type conteneur ou son paramètre de type lui être contraint.
it: Uno dei parametri di un operatore binario deve essere il tipo che lo contiene o il relativo parametro di tipo vincolato ad esso.
ja: バイナリ演算子のパラメーターの 1 つは、それを含む型であるか、それに制約された型パラメーターである必要があります。
pl: Jeden z parametrów operatora binarnego musi być typem otaczającym lub jest parametrem typu ograniczonym do niego.
pt_br: Um dos parâmetros de um operador binário deve ser o tipo recipiente ou seu parâmetro de tipo restrito a ele.
ru: Один из параметров бинарного оператора должен быть содержащего типа, или его параметр типа должен ограничиваться содержащим типом.
zh_hans: 二元运算符的参数之一必须是包含类型或被其约束的类型参数。
zh_hant: 二元運算子的其中一個參數必須是包含類型，或其型別參數受其限制。

# ERR_BadAbstractEqualityOperatorSignature
source: One of the parameters of an equality, or inequality operator declared in interface '{0}' must be a type parameter on '{0}' constrained to '{0}'
cs: Jeden z parametrů rovnosti nebo operátor nerovnosti deklarovaný v rozhraní {0} musí být parametrem typu v objektu {0} omezeném na: {0}.
fr: L’un des paramètres d’un opérateur d’égalité ou d’inégalité déclaré dans l’interface «{0}» doit être un paramètre de type sur «{0}» limité à «{0}»
it: Uno dei parametri di un operatore di uguaglianza o disuguaglianza dichiarato nell'interfaccia '{0}' deve essere un parametro di tipo in '{0}' vincolato a '{0}'
ja: インターフェイス '{0}' で宣言されている等値演算子または非等値演算子のパラメーターの 1 つは、'{0}' に制限された '{0}' の型パラメーターである必要があります
pl: Jeden z parametrów operatora równości lub nierówności zadeklarowanego w interfejsie „{0}” musi być parametrem typu w przypadku „{0}” ograniczonego do „{0}”
pt_br: Um dos parâmetros de um operador de igualdade ou desigualdade declarado na interface '{0}' deve ser um parâmetro de tipo em '{0}' restrito a '{0}'
ru: Один из параметров оператора равенства или неравенства, объявленный в интерфейсе "{0}" должен быть параметром типа "{0}" с ограничением "{0}"
zh_hans: 在接口 "{0}" 中声明的相等或不相等运算符的参数之一必须是 "{0}" 上的类型参数，限制为 "{0}"
zh_hant: 介面 '{0}' 中宣告之等式或不等式運算子的其中一個參數在 '{0}' 必須是限制為 '{0}' 的型別參數

# ERR_BadAbstractIncDecRetType
source: The return type for ++ or -- operator must either match the parameter type, or be derived from the parameter type, or be the containing type's type parameter constrained to it unless the parameter type is a different type parameter.
cs: Návratový typ pro operátor ++ nebo -- musí odpovídat typu parametru nebo od něj musí být odvozený, nebo musí být obecným parametrem nadřazeného typu, který se na něj omezuje, pokud se nejedná o jiný parametr obecného typu.
fr: Le type de retour pour l’opérateur + + ou--doit correspondre au type de paramètre ou être dérivé du type de paramètre ou être le paramètre de type du type conteneur qui lui est contraint, sauf si le paramètre est de type différent.
it: Il tipo restituito per l'operatore ++ o -- deve corrispondere al tipo di parametro, essere derivato dal tipo di parametro oppure essere il parametro di tipo del tipo che lo contiene, a meno che il tipo di parametro non sia un parametro di tipo diverso.
ja: ++ または -- 演算子の戻り値の型は、パラメーター型と一致するか、パラメーター型から派生しているか、またはパラメーター型が異なる型パラメーターでない限りそれに制約された含んでいる型の型パラメーターである必要があります。
pl: Zwracany typ dla operatora ++ lub -- musi być zgodny z typem parametru lub być pochodną od typu parametru, bądź musi być parametrem typu typu zawierającego ograniczonego do niego, chyba że typ parametru jest innym parametrem typu.
pt_br: O tipo de retorno para o operador ++ ou -- deve corresponder ao tipo de parâmetro, ser derivado do tipo de parâmetro ou ser o parâmetro de tipo do tipo recipiente restrito a ele a menos que o tipo de parâmetro seja um parâmetro de tipo diferente.
ru: Возвращаемый тип для оператора + + или-- должен либо совпадать с типом параметра, либо быть производным от типа параметра, либо быть содержащим типом для типа параметра, ограниченного им, кроме случаев, когда параметр типа является параметром другого типа.
zh_hans: ++ 或 -- 运算符的返回类型必须与参数类型匹配，或者必须从参数类型派生，或者必须是包含类型的被其约束的类型参数，除非该参数类型是不同的类型参数。
zh_hant: ++ 或 -- 運算子的傳回型別必須符合參數類型，或是衍生自參數類型，或為包含類型的型別參數受其限制，除非參數類型是不同的型別參數。

# ERR_BadAbstractIncDecSignature
source: The parameter type for ++ or -- operator must be the containing type, or its type parameter constrained to it.
cs: Parametr operátoru ++ nebo -- musí být nadřazeného typu nebo jeho parametrem obecného typu, který se na něj omezuje.
fr: Le type de paramètre pour l’opérateur ++ ou -- doit être le type conteneur ou son paramètre de type doit lui être contraint.
it: Il tipo di parametro per l'operatore ++ o -- deve essere il tipo che lo contiene o il relativo parametro di tipo vincolato ad esso.
ja: ++ または -- 演算子のパラメーター型は、それを含む型であるか、それに制約された型パラメーターである必要があります。
pl: Typ parametru operatora ++ lub -- musi być typem zawierającym lub jest on parametrem typu ograniczonym do niego.
pt_br: O tipo de parâmetro para o operador ++ ou -- deve ser o tipo recipiente ou seu parâmetro de tipo restrito a ele.
ru: Тип параметра оператора ++ или -- должен быть содержащим типом, или параметр его типа должен ограничиваться только этим параметром.
zh_hans: ++ 或 -- 运算符的参数必须是包含类型或被其约束的类型参数。
zh_hant: ++ 或 -- 運算子的參數必須是包含類型，或其型別參數受其限制。

# ERR_BadAbstractShiftOperatorSignature
source: The first operand of an overloaded shift operator must have the same type as the containing type or its type parameter constrained to it
cs: První operand přetěžovaného operátoru shift musí být stejného typu jako obsahující typ nebo jeho parametr typu omezený na něj.
fr: Le premier opérande d’un opérateur shift surchargé doit avoir le même type que le type conteneur ou son paramètre de type lui est limité
it: Il primo operando di un operatore di spostamento sovraccaricato deve avere lo stesso tipo del tipo che lo contiene o del relativo parametro di tipo vincolato ad esso
ja: オーバーロードされたシフト演算子の最初のオペランドは、それを含む型またはそれに制約された型パラメーターと同じ型である必要があります
pl: Pierwszy operand przeciążonego operatora przesunięcia musi mieć ten sam typ co typ zawierający lub jego parametr typu musi być do niego ograniczony
pt_br: A primeira operação de um operador de deslocamento sobrecarregado deve ter o mesmo tipo que o contém ou seu parâmetro de tipo limitado a ele
ru: Тип первого операнда перегруженного оператора сдвига должен совпадать с содержащим типом или с ограниченным им параметром типа
zh_hans: 重载移位运算符的第一个操作数的类型必须与包含类型或约束为该类型的类型参数相同
zh_hant: 多載移位 (Shift) 運算子的第一個運算元的類型必須和包含的類型相同，或是其型別參數受限於該運算子

# ERR_BadAbstractStaticMemberAccess
source: A static virtual or abstract interface member can be accessed only on a type parameter.
cs: Ke statickému virtuálnímu členu abstraktního rozhraní lze přistupovat pouze přes parametr obecného typu.
fr: Un membre d’interface virtuelle ou abstraite statique est accessible uniquement sur un paramètre de type.
it: È possibile accedere a un membro di interfaccia statico virtuale o astratto solo su un parametro di tipo.
ja: 静的な仮想または抽象インターフェイス メンバーには、型パラメーターでのみアクセスできます。
pl: Dostęp do statycznej składowej interfejsu abstrakcyjnego można uzyskać tylko w przypadku parametru typu.
pt_br: Um membro de interface de abstrato ou estático virtual só pode ser acessado em um parâmetro de tipo.
ru: Доступ к статическому виртуальному или абстрактному элементу интерфейса возможен только для параметра типа.
zh_hans: 只能在类型参数上访问静态虚拟或抽象接口成员。
zh_hant: 只能在型別參數上存取靜態虛擬或抽象介面成員。

# ERR_BadAbstractUnaryOperatorSignature
source: The parameter of a unary operator must be the containing type, or its type parameter constrained to it.
cs: Parametr unárního operátoru musí být nadřazeného typu nebo jeho parametrem obecného typu, který se na něj omezuje.
fr: Le paramètre d’un opérateur unaire doit être le type conteneur ou son paramètre de type lui être contraint.
it: I parametri di un operatore unario deve essere il tipo che lo contiene o il relativo parametro di tipo vincolato ad esso.
ja: 単項演算子のパラメーターは、それを含む型であるか、それに制約された型パラメーターである必要があります。
pl: Parametr operatora jednoargumentowego musi być typem zawierającym lub jest on parametrem typu ograniczonym do niego.
pt_br: O parâmetro de um operador unário deve ser do tipo recipiente ou seu parâmetro de tipo restrito a ele.
ru: Параметр унарного оператора должен быть содержащим типом, или параметр его типа должен ограничиваться только этим параметром.
zh_hans: 一元运算符的参数必须是包含类型或被其约束的类型参数。
zh_hant: 一元運算子的其中一個參數必須是包含類型，或其型別參數受其限制。
