Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AbstractAttributeClass
source: Cannot apply attribute class '{0}' because it is abstract
cs: Nejde použít třídu atributů {0}, protože je abstraktní.
de: Die Attributklasse "{0}" kann nicht angewendet werden, da sie abstrakt ist.
es: No se puede aplicar la clase de atributo '{0}' porque es abstracta
fr: Impossible d'appliquer la classe d'attributs '{0}', car elle est abstract
it: Non è possibile applicare la classe Attribute '{0}' perché è astratta
ja: 抽象であるため属性クラス '{0}' を適用できません
ko: {0}' 특성 클래스는 abstract이므로 적용할 수 없습니다.
pl: Nie można zastosować klasy atrybutów „{0}”, ponieważ jest ona abstrakcyjna
pt_br: Não é possível aplicar classe de atributo "{0}" porque ela é abstract
ru: Не удается использовать класс атрибута "{0}", так как он является абстрактным.
tr: Soyut olduğu için '{0}' öznitelik sınıfı uygulanamıyor
zh_hans: 无法应用特性类“{0}”，因为它是抽象的
zh_hant: 無法套用屬性類別 '{0}'，因為其抽象

# ERR_BadNamedAttributeArgumentType
source: '{0}' is not a valid named attribute argument because it is not a valid attribute parameter type
cs: {0} není platný argument pojmenovaného atributu, protože se nejedná o platný typ parametru atributu.
de: '"{0}" ist kein gültiges benanntes Attributargument, da es sich nicht um einen gültigen Attributparametertyp handelt.
es: '{0}' no es un argumento de atributo con nombre válido porque no es un tipo de parámetro de atributo válido
fr: '{0}' n'est pas un argument d'attribut nommé valide, car il n'est pas un type de paramètre d'attribut valide
it: '{0}' non è un argomento di attributo denominato valido perché non è un tipo di parametro di attributo valido
ja: '{0}' は有効な名前付き属性引数ではありません。属性パラメーター型が有効ではありません
ko: '{0}'이(가) 유효한 특성 매개 변수 형식이 아니므로 잘못 명명된 특성 인수입니다.
pl: „{0}” nie jest prawidłowym argumentem nazwanego atrybutu, ponieważ nie jest to prawidłowy typ parametru atrybutu
pt_br: "{0}" não é um argumento de atributo nomeado válido porque não é um tipo de parâmetro de atributo válido
ru: "{0}" не является допустимым аргументом именованного атрибута, так как он не является допустимым типом параметра атрибута.
tr: '{0}' geçerli bir öznitelik parametresi türü olmadığından geçerli bir adlandırılmış öznitelik bağımsız değişkeni değil
zh_hans: “{0}”不是有效的特性参数类型，因此不是有效的命名特性参数
zh_hant: '{0}' 不是有效的具名屬性引數，因為其不是有效的屬性參數類型

# ERR_MissingPredefinedMember
source: Missing compiler required member '{0}.{1}'
cs: Požadovaný člen {0}.{1} kompilátoru se nenašel.
de: Der vom Compiler angeforderte Member "{0}.{1}" fehlt.
es: Falta el miembro '{0}.{1}' que requiere el compilador
fr: Membre requis par le compilateur '{0}.{1}' manquant
it: Manca il membro '{0}.{1}', necessario per il compilatore
ja: コンパイラが必要とするメンバー '{0}.{1}' がありません
ko: {0}.{1}' 멤버가 필요한 컴파일러가 없습니다.
pl: Brak wymaganej przez kompilator składowej „{0}.{1}”.
pt_br: Membro "{0}.{1}" necessário ao compilador ausente
ru: Отсутствует обязательный для компилятора член "{0}.{1}"
tr: Derleyici için gerekli olan '{0}.{1}' üyesi eksik
zh_hans: 缺少编译器要求的成员“{0}.{1}”
zh_hant: 遺漏編譯器必要成員 '{0}.{1}'

# WRN_AttributeLocationOnBadDeclaration
source: '{0}' is not a valid attribute location for this declaration. Valid attribute locations for this declaration are '{1}'. All attributes in this block will be ignored.
cs: {0} není platné umístění atributu pro tuto deklaraci. Platnými umístěními atributů pro tuto deklaraci jsou {1}. Všechny atributy v tomto bloku se budou ignorovat.
de: '"{0}" ist kein gültiger Attributpfad für diese Deklaration. Gültige Attributpfade für diese Deklaration sind "{1}". Alle Attribute in diesem Block werden ignoriert.
es: '{0}' no es una ubicación de atributos válida para esta declaración. Las ubicaciones de atributos válidas son '{1}'. Todos los atributos de este bloque se omitirán.
fr: '{0}' n'est pas un emplacement d'attribut valide pour cette déclaration. Les emplacements d'attributs valides pour cette déclaration sont '{1}'. Tous les attributs de ce bloc seront ignorés.
it: '{0}' non è una posizione valida dell'attributo per questa dichiarazione. Le posizioni valide degli attributi sono '{1}'. Tutti gli attributi in questo blocco verranno ignorati.
ja: '{0}' は、この宣言の有効な属性ではありません。宣言の有効な属性の場所は '{1}' です。このブロックの属性はすべて無視されます。
ko: '{0}'은(는) 이 선언에 유효한 특성 위치가 아닙니다. 이 선언에 유효한 특성 위치는 '{1}'입니다. 이 블록의 모든 특성이 무시됩니다.
pl: „{0}” to nie jest prawidłowa lokalizacja atrybutu tej deklaracji. Prawidłowe lokalizacje atrybutu tej deklaracji to „{1}”. Wszystkie atrybuty w tym bloku zostaną zignorowane.
pt_br: "{0}" não é um local de atributo válido para esta declaração. Locais de atributo válidos para esta declaração são "{1}". Todos os atributos neste bloco serão ignorados.
ru: "{0}" недопустимое место атрибута для этого объявления. Для этого объявления допускаются следующие места атрибутов: "{1}". Все атрибуты этого блока будут проигнорированы.
tr: '{0}' bu bildirim için geçerli bir öznitelik konumu değil. Bu bildirimle ilgili geçerli öznitelik konumları: '{1}'. Bu bloktaki tüm öznitelikler yoksayılacak.
zh_hans: “{0}”不是此声明的有效特性位置。此声明的有效特性位置是“{1}”。此块中的所有特性都将被忽略。
zh_hant: '{0}' 對此宣告而言，不是有效的屬性位置。對此宣告有效的屬性位置是 '{1}'。將會忽略此區塊中的所有屬性。

# WRN_AttributeLocationOnBadDeclaration_Title
source: Not a valid attribute location for this declaration
cs: Není platné umístění atributu pro tuto deklaraci.
de: Für diese Deklaration ist kein gültiger Atttributspeicherort vorhanden
es: No hay ninguna ubicación de atributo válida para esta declaración
fr: Ceci n'est pas un emplacement d'attribut valide pour cette déclaration
it: Non è una posizione valida dell'attributo per questa dichiarazione
ja: 属性の場所はこの宣言に対して無効です
ko: 이 선언의 올바른 특성 위치가 아닙니다.
pl: Nieprawidłowa lokalizacja atrybutu tej deklaracji
pt_br: Este não é um local de atributo para esta declaração
ru: Недопустимое расположение атрибута для объявления
tr: Bu bildirim için geçerli bir öznitelik konumu değil
zh_hans: 不是此声明的有效特性位置
zh_hant: 不是此宣告的有效屬性位置

# WRN_InvalidAttributeLocation
source: '{0}' is not a recognized attribute location. Valid attribute locations for this declaration are '{1}'. All attributes in this block will be ignored.
cs: {0} není známé umístění atributu. Platná umístění atributu pro tuto deklaraci jsou {1}. Všechny atributy v tomto bloku se budou ignorovat.
de: '"{0}" ist kein bekannter Attributspeicherort. Gültige Attributspeicherorte für diese Deklaration sind "{1}". Alle Attribute in diesem Block werden ignoriert.
es: '{0}' no es una ubicación de atributo reconocida. Las ubicaciones de atributo para esta declaración son '{1}'. Todos los atributos de este bloque se omitirán.
fr: '{0}' n'est pas un emplacement d'attribut reconnu. Les emplacements d'attributs valides pour cette déclaration sont '{1}'. Tous les attributs de ce bloc seront ignorés.
it: '{0}' non è una posizione riconosciuta dell'attributo. Le posizioni valide degli attributi sono '{1}'. Tutti gli attributi in questo blocco verranno ignorati.
ja: '{0}' は認識できる属性の場所ではありません。この宣言の属性の場所として使用できるのは '{1}' です。このブロック内の属性はすべて無視されます。
ko: '{0}'은(는) 인식할 수 있는 특성 위치가 아닙니다. 이 선언의 유효한 특성 위치는 '{1}'입니다. 이 블록의 모든 특성이 무시됩니다.
pl: „{0}” nie jest rozpoznawaną lokalizacją atrybutu. Prawidłowe lokalizacje atrybutu dla tej deklaracji to „{1}”. Wszystkie atrybuty w tym bloku zostaną zignorowane.
pt_br: "{0}" não é um local de atributo reconhecido. Locais de atributo válidso para essa declaração são '{1}'. Todos os atributos neste bloco serão ignorados.
ru: "{0}" не распознан как расположение атрибута. Допустимые расположения атрибута для этого объявления: "{1}". Все атрибуты этого блока будут проигнорированы.
tr: '{0}' bilinen bir öznitelik konumu değildir. Bu bildirim için geçerli öznitelik konumları: '{1}'. Bu bloktaki tüm öznitelikler yoksayılacak.
zh_hans: “{0}”不是可识别的特性位置。此声明的有效特性位置为“{1}”。此块中的所有特性都将被忽略。
zh_hant: '{0}' 不是可辨認的屬性位置。此宣告的有效屬性位置為 '{1}'。將會忽略此區塊中的所有屬性。

# WRN_InvalidAttributeLocation_Title
source: Not a recognized attribute location
cs: Není rozpoznané umístění atributu.
de: Kein bekannter Attributpfad
es: No es una ubicación de atributo reconocida
fr: Cet emplacement d'attribut n'est pas reconnu
it: Non è una posizione di attributo riconosciuta
ja: 認識できる属性の場所ではありません
ko: 인식할 수 있는 특성 위치가 아닙니다.
pl: Nie jest to rozpoznawana lokalizacja atrybutu
pt_br: Este não é um local de atributo reconhecido
ru: Нераспознанное расположение атрибута
tr: Tanınan bir öznitelik konumu değil
zh_hans: 不是可识别的特性位置
zh_hant: 不是可辨識的屬性位置

# WRN_EqualsWithoutGetHashCode
source: '{0}' overrides Object.Equals(object o) but does not override Object.GetHashCode()
cs: {0} přepisuje Object.Equals(object o), ale nepřepisuje Object.GetHashCode().
de: '"{0}" überschreibt Object.Equals(object o), aber nicht Object.GetHashCode().
es: '{0}' invalida Object.Equals(object o) pero no invalida Object.GetHashCode()
fr: '{0}' se substitue à Object.Equals(object o) mais pas à Object.GetHashCode()
it: '{0}' esegue l'override di Object.Equals(object o) ma non esegue l'override di Object.GetHashCode()
ja: '{0}' は Object.Equals(object o) をオーバーライドしますが、Object.GetHashCode() をオーバーライドしません。
ko: '{0}'은(는) Object.Equals(object o)를 재정의하지만 Object.GetHashCode()를 재정의하지 않습니다.
pl: 'Element „{0}” przesłania metodę Object.Equals(object o), lecz nie przesłania metody Object.GetHashCode()
pt_br: "{0}" substitui Object.Equals(object o), mas não substitui Object.GetHashCode()
ru: "{0}" переопределяет Object.Equals(object o), но не переопределяет Object.GetHashCode().
tr: '{0}' Object.Equals(object o) öğesini geçersiz kılar ancak Object.GetHashCode() öğesini geçersiz kılmaz
zh_hans: “{0}”重写 Object.Equals(object o) 但不重写 Object.GetHashCode()
zh_hant: '{0}' 會覆寫 Object.Equals(object o)，但是不會覆寫 Object.GetHashCode()

# WRN_EqualsWithoutGetHashCode_Title
source: Type overrides Object.Equals(object o) but does not override Object.GetHashCode()
cs: Typ přepisuje Object.Equals(object o), ale nepřepisuje Object.GetHashCode().
de: Typ überschreibt Object.Equals(object o), überschreibt jedoch nicht Object.GetHashCode()
es: El tipo reemplaza a Object.Equals(object o), pero no reemplaza a Object.GetHashCode()
fr: Le type se substitue à Object.Equals(object o) mais pas à Object.GetHashCode()
it: Il tipo esegue l'override di Object.Equals(object o) ma non esegue l'override di Object.GetHashCode()
ja: 型は Object.Equals(object o) をオーバーライドしますが、Object.GetHashCode() をオーバーライドしません
ko: 형식은 Object.Equals(object o)를 재정의하지만 Object.GetHashCode()를 재정의하지 않습니다.
pl: Typ przesłania metodę Object.Equals(object o), ale nie przesłania metody Object.GetHashCode()
pt_br: O tipo substitui Object. Equals (objeto o), mas não substitui o Object.GetHashCode()
ru: Тип переопределяет Object.Equals(object o), но не переопределяет Object.GetHashCode()
tr: Tür Object.Equals(object o) öğesini geçersiz kılar, ancak Object.GetHashCode() öğesini geçersiz kılmaz
zh_hans: 类型重写 Object.Equals(object o)，但不重写 Object.GetHashCode()
zh_hant: 類型會覆寫 Object.Equals(object o)，但不會覆寫 Object.GetHashCode()

# WRN_EqualityOpWithoutEquals
source: '{0}' defines operator == or operator != but does not override Object.Equals(object o)
cs: {0} definuje operátor == nebo !=, ale nepřepisuje funkci Object.Equals(object o).
de: '"{0}" definiert den Operator == oder !=, aber überschreibt Object.Equals(object o) nicht.
es: '{0}' define el operador == o el operador != pero no invalida Object.Equals(object o)
fr: '{0}' définit l'opérateur == ou l'opérateur != mais ne se substitue pas à Object.Equals(object o)
it: '{0}' definisce l'operatore == o l'operatore != ma non esegue l'override di Object.Equals(object o)
ja: '{0}' は演算子 == または演算子 != を定義しますが、Object.Equals(object o) をオーバーライドしません。
ko: '{0}'은(는) == 연산자 또는 != 연산자를 정의하지만 Object.Equals(object o)를 재정의하지 않습니다.
pl: 'Element „{0}” definiuje operator == lub !=, lecz nie przesłania metody Object.Equals(object o)
pt_br: "{0}" define o operador = = ou operador !=, mas não substitui Object.Equals(object o)
ru: "{0}" определяет оператор "==" или оператор "!=", но не переопределяет Object.Equals(object o).
tr: '{0}' işleç == veya işleç != öğesini tanımlar ancak Object.Equals(object o) öğesini geçersiz kılmaz
zh_hans: “{0}”定义运算符 == 或运算符 !=，但不重写 Object.Equals(object o)
zh_hant: '{0}' 定義了運算子 == 或運算子 !=，但不會覆寫 Object.Equals(object o)。

# WRN_EqualityOpWithoutEquals_Title
source: Type defines operator == or operator != but does not override Object.Equals(object o)
cs: Typ definuje operátor == nebo !=, ale nepřepisuje funkci Object.Equals(object o).
de: Typ definiert Operator == oder Operator !=, überschreibt jedoch nicht Object.Equals(Objekt o)
es: El tipo define operator == or operator !=, pero no reemplaza a override Object.Equals(object o)
fr: Le type définit l'opérateur == ou l'opérateur != mais ne se substitue pas à Object.Equals(object o)
it: Il tipo definisce l'operatore == o l'operatore != ma non esegue l'override di Object.Equals(object o)
ja: 型は演算子 == または演算子 != を定義しますが、Object.Equals(object o) をオーバーライドしません
ko: 형식은 == 연산자 또는 != 연산자를 정의하지만 Object.Equals(object o)를 재정의하지 않습니다.
pl: Typ definiuje operator == lub !=, ale nie przesłania metody Object.Equals(object o)
pt_br: O tipo define os operadores == ou !=, mas não substitui o Object.Equals(object o)
ru: Тип определяет оператор == или оператор !=, но не переопределяет Object.Equals(object o)
tr: Tür operator == or operator != öğesini tanımlar, ancak Object.Equals(object o) öğesini geçersiz kılmaz
zh_hans: 类型定义运算符 == 或运算符 !=，但不重写 Object.Equals(object o)
zh_hant: 類型會定義運算子 == 或運算子 !=，但不會覆寫 Object.Equals(object o)

# WRN_EqualityOpWithoutGetHashCode
source: '{0}' defines operator == or operator != but does not override Object.GetHashCode()
cs: {0} definuje operátor == nebo !=, ale nepřepisuje funkci Object.GetHashCode().
de: '"{0}" definiert den Operator == oder !=, aber überschreibt Object.GetHashCode() nicht.
es: '{0}' define el operador == o el operador != pero no invalida Object.GetHashCode()
fr: '{0}' définit l'opérateur == ou l'opérateur != mais ne se substitue pas à Object.GetHashCode()
it: '{0}' definisce l'operatore == o l'operatore != ma non esegue l'override di Object.GetHashCode()
ja: '{0}' は演算子 == または演算子 != を定義しますが、Object.GetHashCode() をオーバーライドしません。
ko: '{0}'은(는) == 연산자 또는 != 연산자를 정의하지만 Object.GetHashCode()를 재정의하지 않습니다.
pl: 'Element „{0}” definiuje operator == lub !=, lecz nie przesłania metody Object.GetHashCode()
pt_br: "{0}" define o operador = = ou operador !=, mas não substitui Object.GetHashCode()
ru: "{0}" определяет оператор "==" или оператор "!=", но не переопределяет Object.GetHashCode().
tr: '{0}' işleç == veya işleç != öğesini tanımlar ancak Object.GetHashCode() öğesini geçersiz kılmaz
zh_hans: “{0}”定义运算符 == 或运算符 !=，但不重写 Object.GetHashCode()
zh_hant: '{0}' 定義了運算子 == 或運算子 !=，但不會覆寫 Object.GetHashCode()。

# WRN_EqualityOpWithoutGetHashCode_Title
source: Type defines operator == or operator != but does not override Object.GetHashCode()
cs: Typ definuje operátor == nebo !=, ale nepřepisuje funkci Object.GetHashCode().
de: Typ definiert Operator == oder Operator !=, überschreibt jedoch nicht Object.GetHashCode()
es: El tipo define operator == or operator !=, pero no reemplaza a Object.GetHashCode()
fr: Le type définit l'opérateur == ou l'opérateur != mais ne se substitue pas à Object.GetHashCode()
it: Il tipo definisce l'operatore == o l'operatore != ma non esegue l'override di Object.GetHashCode()
ja: 型は演算子 == または演算子 != を定義しますが、Object.GetHashCode() をオーバーライドしません
ko: 형식은 == 연산자 또는 != 연산자를 정의하지만 Object.GetHashCode()를 재정의하지 않습니다.
pl: Typ definiuje operator == lub !=, ale nie przesłania metody Object.GetHashCode()
pt_br: O tipo define os operadores == ou !=, mas não substitui o Object.GetHashCode()
ru: Тип определяет оператор == или оператор !=, но не переопределяет Object.GetHashCode()
tr: Type operator == or operator != öğesini tanımlar, ancak Object.GetHashCode() öğesini geçersiz kılmaz
zh_hans: 类型定义运算符 == 或运算符 !=，但不重写 Object.GetHashCode()
zh_hant: 類型會定義運算子 == 或運算子 !=，但不會覆寫 Object.GetHashCode()

# ERR_OutAttrOnRefParam
source: Cannot specify the Out attribute on a ref parameter without also specifying the In attribute.
cs: Nejde specifikovat atribut Out pro referenční parametr, když není současně specifikovaný atribut In.
de: Das Out-Attribut kann für einen ref-Parameter nicht ohne Angabe des In-Attributs angegeben werden.
es: No se puede especificar el atributo Out en un parámetro ref sin especificar también el atributo In.
fr: Impossible de spécifier l'attribut Out sur un paramètre ref sans spécifier également l'attribut In.
it: Non è possibile specificare l'attributo Out in un parametro ref senza specificare anche l'attributo In.
ja: ref パラメーターで Out 属性を指定するには、In 属性も指定する必要があります。
ko: ref 매개 변수에 Out 특성만 지정할 수는 없습니다. In 특성도 지정해야 합니다.
pl: Nie można określić atrybutu Out dla parametru ref bez określania także atrybutu wejściowego.
pt_br: Não é possível especificar o atributo Out em um parâmetro de referência sem também especificar o atributo In.
ru: Невозможно указать атрибут Out в параметре ref, не указав также атрибут In.
tr: Bir başvuru parametresinde In özniteliği belirtilmeden Out özniteliği belirtilemez.
zh_hans: 不可在 ref 参数上指定 Out 特性，除非同时指定 In 特性。
zh_hant: 無法在 ref 參數上僅指定 Out 屬性，卻不指定 In 屬性。

# ERR_OverloadRefKind
source: '{0}' cannot define an overloaded {1} that differs only on parameter modifiers '{2}' and '{3}'
cs: {0} nemůže definovat přetíženou {1}, která se liší jenom v modifikátorech parametrů {2} a {3}.
de: '"{0}" kann kein überladenes {1}-Element definieren, das sich nur in den Parametermodifizierern "{2}" und "{3}" unterscheidet.
es: '"{0}" no puede definir un elemento {1} sobrecargado que difiere solo en los modificadores de parámetro "{2}" y "{3}".
fr: '{0}' ne peut pas définir un {1} surchargé qui se différencie uniquement par les modificateurs de paramètres '{2}' et '{3}'
it: '{0}' non può definire un elemento {1} in rapporto di overload che differisce solo per i modificatori di parametro '{2}' e '{3}'
ja: '{0}' は、パラメーター修飾子 '{2}' と '{3}' だけが異なるオーバーロードされた {1} を定義できません
ko: '{0}'은(는) 매개 변수 한정자 '{2}' 및 '{3}'만 다른 오버로드된 {1}을(를) 정의할 수 없습니다.
pl: 'Element „{0}” nie może definiować przeciążonego elementu {1}, który różni się tylko modyfikatorami parametru „{2}” i „{3}”
pt_br: '{0}' não pode definir uma sobrecarga {1} que difere somente nos modificadores de parâmetro '{2}' e '{3}'
ru: "{0}" не может определять перегруженный {1}, который отличается только модификаторами параметров "{2}" и "{3}"
tr: '{0}', yalnızca '{2}' ve '{3}' parametre değiştiricilerinde değişen aşırı yüklenmiş bir {1} tanımlayamaz
zh_hans: “{0}”不能定义仅在参数修饰符“{2}”和“{3}”上存在区别的重载 {1}
zh_hant: '{0}' 無法定義多載的 {1}，後者僅在參數修飾元 '{2}' 和 '{3}' 有所不同

# ERR_LiteralDoubleCast
source: Literal of type double cannot be implicitly converted to type '{1}'; use an '{0}' suffix to create a literal of this type
cs: Literály typu double nejde implicitně převést na typ {1}. Chcete-li vytvořit literál tohoto typu, použijte předponu {0}.
de: Literale vom Typ "double" können nicht implizit in den Typ "{1}" konvertiert werden. Verwenden Sie ein {0}-Suffix, um ein Literal mit diesem Typ zu erstellen.
es: El literal de tipo double no se puede convertir implícitamente en el tipo '{1}'; use un sufijo '{0}' para crear un literal de este tipo
fr: Impossible de convertir implicitement un littéral de type double en type '{1}' ; utilisez un suffixe '{0}' pour créer un littéral de ce type
it: Non è possibile convertire in modo implicito il valore letterale di tipo double nel tipo '{1}'. Usare un suffisso '{0}' per creare un valore letterale di questo tipo
ja: 型 double のリテラルを暗黙的に型 '{1}' に変換することはできません。'{0}' サフィックスを使用して、この型のリテラルを作成してください
ko: double 형식의 리터럴을 암시적으로 '{1}' 형식으로 변환할 수 없습니다. 이 형식의 리터럴을 만들려면 '{0}' 접미사를 사용하세요.
pl: Nie można niejawnie przekonwertować literału typu double na typ „{1}”. W celu utworzenia literału tego typu należy użyć sufiksu „{0}”.
pt_br: Literal do tipo double não pode ser convertido implicitamente no tipo "{1}"; use um sufixo "{0}" para criar um literal desse tipo
ru: Литерал с типом double не может быть неявно преобразован к типу "{1}"; используйте суффикс "{0}" для создания литерала этого типа
tr: Double türündeki sabit değer örtülü olarak '{1}' türüne dönüştürülemez; bu türde bir sabit değer oluşturmak için '{0}' soneki kullanın
zh_hans: 无法将 Double 类型隐式转换为“{1}”类型；请使用“{0}”后缀创建此类型
zh_hant: 不可將類型 double 的常值，隱含轉換成類型 '{1}'; 請使用 '{0}' 後置詞來建立此類型的常值

# WRN_IncorrectBooleanAssg
source: Assignment in conditional expression is always constant; did you mean to use == instead of = ?
cs: Přiřazení je v podmíněných výrazech vždy konstantní. Nechtěli jste spíše použít operátor == místo operátoru = ?
de: Die Zuweisung in einem bedingten Ausdruck ist immer konstant. Wollten Sie == anstelle von = verwenden?
es: La asignación en la expresión condicional siempre es constante; ¿quería utilizar == en lugar de = ?
fr: L'assignation dans une expression conditionnelle est toujours constante ; voulez-vous utiliser == au lieu de = ?
it: L'assegnazione nell'espressione condizionale è sempre costante. Si intendeva utilizzare == invece di = ?
ja: 条件式の代入は常に定数です。== を使用するつもりで = を使用しましたか?
ko: 조건식에 할당을 사용하면 항상 상수가 됩니다. = 대신 ==을 사용하세요.
pl: Przypisanie w wyrażeniu warunkowym jest zawsze stałe. Czy zamiast operatora = miał zostać użyty operator == ?
pt_br: Atribuição em expressão condicional é sempre constante. Deseja usar == em vez de = ?
ru: В условных выражениях назначение всегда постоянное. Предполагалось использовать ==, а не = ?
tr: Koşullu ifadedeki atama her zaman sabittir; = yerine == kullanmayı mı amaçlıyordunuz?
zh_hans: 条件表达式中的赋值总是常量；是否希望使用 "==" 而非 "="?
zh_hant: 條件運算式中的指派一直是常數; 這表示您要使用 == 代替 = ?

# WRN_IncorrectBooleanAssg_Title
source: Assignment in conditional expression is always constant
cs: Přiřazení je v podmíněných výrazech vždycky konstantní.
de: Zuweisung in bedingtem Ausdruck ist immer konstant
es: La asignación en una expresión condicional siempre es constante
fr: L'assignation dans une expression conditionnelle est toujours constante
it: L'assegnazione nell'espressione condizionale è sempre costante
ja: 条件式の代入は常に定数です
ko: 조건식에 할당을 사용하면 항상 상수가 됩니다.
pl: Przypisanie w wyrażeniu warunkowym jest zawsze stałe
pt_br: A atribuição em expressão condicional é sempre constante
ru: Назначение в условном выражении всегда является константой
tr: Koşullu ifadede atama her zaman sabittir
zh_hans: 条件表达式中的赋值总是常量
zh_hant: 條件運算式中的指派一律是常數

# ERR_ProtectedInStruct
source: '{0}': new protected member declared in struct
cs: {0}: Ve struktuře je deklarovaný nový chráněný člen.
de: '"{0}": In der Struktur wurde ein neuer geschützter Member deklariert.
es: '{0}': nuevo miembro protegido declarado en estructura
fr: '{0}' : nouveau membre protected déclaré dans struct
it: '{0}': in struct è stato dichiarato il nuovo membro protetto
ja: '{0}': 新規のプロテクト メンバーが構造体で宣言されました
ko: '{0}': 구조체에 새 protected 멤버가 선언되었습니다.
pl: „{0}”: nowa chroniona składowa zadeklarowana w strukturze
pt_br: "{0}": novo membro protegido declarado em struct
ru: "{0}": новый защищенный член объявлен в структуре.
tr: '{0}': yapıda ifade edilen yeni korumalı üye
zh_hans: “{0}”: 结构中已声明新的保护成员
zh_hant: '{0}': 在結構中宣告了新的 Protected 成員
