Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_CSCHelp
source: Visual C# Compiler Options - OUTPUT FILES - -out:<file> Specify output file name (default: base name of file with main class or first file) -target:exe Build a console executable (default) (Short form: -t:exe) -target:winexe Build a Windows executable (Short form: -t:winexe) -target:library Build a library (Short form: -t:library) -target:module Build a module that can be added to another assembly (Short form: -t:module) -target:appcontainerexe Build an Appcontainer executable (Short form: -t:appcontainerexe) -target:winmdobj Build a Windows Runtime intermediate file that is consumed by WinMDExp (Short form: -t:winmdobj) -doc:<file> XML Documentation file to generate -refout:<file> Reference assembly output to generate -platform:<string> Limit which platforms this code can run on: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred, or anycpu. The default is anycpu. - INPUT FILES - -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications -reference:<alias>=<file> Reference metadata from the specified assembly file using the given alias (Short form: -r) -reference:<file list> Reference metadata from the specified assembly files (Short form: -r) -addmodule:<file list> Link the specified modules into this assembly -link:<file list> Embed metadata from the specified interop assembly files (Short form: -l) -analyzer:<file list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. -embed Embed all source files in the PDB. -embed:<file list> Embed specific files in the PDB. - RESOURCES - -win32res:<file> Specify a Win32 resource file (.res) -win32icon:<file> Use this icon for the output -win32manifest:<file> Specify a Win32 manifest file (.xml) -nowin32manifest Do not include the default Win32 manifest -resource:<resinfo> Embed the specified resource (Short form: -res) -linkresource:<resinfo> Link the specified resource to this assembly (Short form: -linkres) Where the resinfo format is <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] Emit debugging information -debug:{full|pdbonly|portable|embedded} Specify debugging type ('full' is default, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the target .dll or .exe) -optimize[+|-] Enable optimizations (Short form: -o) -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -warnaserror[+|-] Report all warnings as errors -warnaserror[+|-]:<warn list> Report specific warnings as errors (use "nullable" for all nullability warnings) -warn:<n> Set warning level (0 or higher) (Short form: -w) -nowarn:<warn list> Disable specific warning messages (use "nullable" for all nullability warnings) -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -checked[+|-] Generate overflow checks -unsafe[+|-] Allow 'unsafe' code -define:<symbol list> Define conditional compilation symbol(s) (Short form: -d) -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `latest` (latest version, including minor versions), `default` (same as `latest`), `latestmajor` (latest version, excluding minor versions), `preview` (latest version, including features in unsupported preview), or specific versions like `6` or `7.1` -nullable[+|-] Specify nullable context option enable|disable. -nullable:{enable|disable|warnings|annotations} Specify nullable context option enable|disable|warnings|annotations. - SECURITY - -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key -keyfile:<file> Specify a strong name key file -keycontainer:<string> Specify a strong name key container -highentropyva[+|-] Enable high-entropy ASLR - MISCELLANEOUS - @<file> Read response file for more options -help Display this usage message (Short form: -?) -nologo Suppress compiler copyright message -noconfig Do not auto include CSC.RSP file -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<address> Base address for the library to be built -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<n> Specify the codepage to use when opening source files -utf8output Output compiler messages in UTF-8 encoding -main:<type> Specify the type that contains the entry point (ignore all other possible entry points) (Short form: -m) -fullpaths Compiler generates fully qualified paths -filealign:<n> Specify the alignment used for output file sections -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -pdb:<file> Specify debug information file name (default: output file name with .pdb extension) -errorendlocation Output line and column of the end location of each error -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -nostdlib[+|-] Do not reference standard library (mscorlib.dll) -subsystemversion:<string> Specify subsystem version of this assembly -lib:<file list> Specify additional directories to search in for references -errorreport:<string> Specify how to handle internal compiler errors: prompt, send, queue, or none. The default is queue. -appconfig:<file> Specify an application configuration file containing assembly binding settings -moduleassemblyname:<string> Name of the assembly which this module will be a part of -modulename:<string> Specify the name of the source module -generatedfilesout:<dir> Place files generated during compilation in the specified directory.
cs: Parametry kompilátoru Visual C# - VÝSTUPNÍ SOUBORY - -out:<file> Určuje název výstupního souboru (výchozí: základní název souboru s hlavní třídou nebo prvního souboru) -target:exe Vytvoří spustitelný soubor konzoly (výchozí). (Krátký formát: -t:exe) -target:winexe Vytvoří spustitelný soubor systému Windows. (Krátký formát: -t:winexe) -target:library Vytvoří knihovnu. (Krátký formát: -t:library) -target:module Vytvoří modul, který se dá přidat do jiného sestavení. (Krátký formát: -t:module) -target:appcontainerexe Sestaví spustitelný soubor kontejneru Appcontainer. (Krátký formát: -t:appcontainerexe) -target:winmdobj Sestaví pomocný soubor modulu Windows Runtime, který využívá knihovna WinMDExp. (Krátký formát: -t:winmdobj) -doc:<file> Soubor dokumentace XML, který má být vygenerován -refout:<file> Výstup referenčního sestavení, který má být vygenerován -platform:<string> Omezuje platformy, na kterých lze tento kód spustit: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred nebo anycpu. Výchozí nastavení je anycpu. - VSTUPNÍ SOUBORY - -recurse:<wildcard> Zahrne všechny soubory v aktuálním adresáři a jeho podadresářích podle zadaného zástupného znaku. -reference:<alias>=<file> Odkazuje na metadata ze zadaného souboru sestavení pomocí daného aliasu. (Krátký formát: -r) -reference:<file list> Odkazuje na metadata ze zadaných souborů sestavení (Krátký formát: -r) -addmodule:<file list> Připojí zadané moduly k tomuto sestavení. -link:<file list> Vloží metadata ze zadaných souborů sestavení spolupráce (Krátký formát: -l) -analyzer:<file list> Spustí analyzátory z tohoto sestavení. (Krátký formát: -a) -additionalfile:<file list> Další soubory, které přímo neovlivňují generování kódu, ale analyzátory můžou jejich pomocí produkovat chyby nebo upozornění. -embed Vloží všechny zdrojové soubory do PDB. -embed:<file list> Vloží konkrétní soubory do PDB. - PROSTŘEDKY - -win32res:<file> Určuje soubor prostředků Win32 (.res). -win32icon:<file> Použije pro výstup zadanou ikonu. -win32manifest:<file> Určuje soubor manifestu Win32 (.xml). -nowin32manifest Nezahrne výchozí manifest Win32. -resource:<resinfo> Vloží zadaný prostředek. (Krátký formát: -res) -linkresource:<resinfo> Propojí zadaný prostředek s tímto sestavením. (Krátký formát: -linkres) Prostředek má formát is <file>[,<string name>[,public|private]]. - GENEROVÁNÍ KÓDU - -debug[+|-] Generuje ladicí informace. -debug:{full|pdbonly|portable|embedded} Určuje typ ladění (výchozí je možnost full, portable je formát napříč platformami, embedded je formát napříč platformami vložený do cílového souboru .dll nebo .exe). -optimize[+|-] Povolí optimalizace. (Krátký formát: -o) -deterministic Vytvoří deterministické sestavení (včetně GUID verze modulu a časového razítka). -refonly Vytvoří referenční sestavení na místě hlavního výstupu. -instrument:TestCoverage Vytvoří sestavení instrumentované ke shromažďování informací o pokrytí. -sourcelink:<file> Informace o zdrojovém odkazu vkládané do souboru PDB.. - CHYBY A UPOZORNĚNÍ - -warnaserror[+|-] Hlásí všechna upozornění jako chyby. -warnaserror[+|-]:<warn list> Hlásí zadaná upozornění jako chyby. (Pro všechna upozornění na možnost použití hodnoty null použijte nullable.) -warn:<n> Nastaví úroveň pro upozornění (0 a více). (Krátký formát: -w) -nowarn:<warn list> Zakáže zadaná upozornění. (Pro všechna upozornění na možnost použití hodnoty null použijte nullable.) -ruleset:<file> Určuje soubor sady pravidel, která zakazuje specifickou diagnostiku. -errorlog:<file>[,version=<sarif_version>] Určuje soubor pro protokolování veškeré diagnostiky kompilátoru a analyzátoru. verze_sarif:{1|2|2.1} Výchozí jsou 1. 2 a 2.1. Obojí znamená SARIF verze 2.1.0. -reportanalyzer Hlásí další informace analyzátoru, např. dobu spuštění. -skipanalyzers[+|-] Přeskočí spouštění diagnostických analyzátorů. - JAZYK - -checked[+|-] Generuje kontroly přetečení. -unsafe[+|-] Povoluje nezabezpečený kód. -define:<symbol list> Definuje symboly podmíněné kompilace. (Krátký formát: -d) -langversion:? Zobrazuje povolené hodnoty pro verzi jazyka. -langversion:<string> Určuje verzi jazyka, například: latest (poslední verze včetně podverzí), default (stejné jako latest), latestmajor (poslední verze bez podverzí), preview (poslední verze včetně funkcí v nepodporované verzi preview) nebo konkrétní verze, například 6 nebo 7.1. -nullable[+|-] Určuje pro kontext s hodnotou null možnosti enable|disable. -nullable:{enable|disable|warnings|annotations} Určuje pro kontext s hodnotou null možnosti enable|disable|warnings|annotations. - ZABEZPEČENÍ - -delaysign[+|-] Vytvoří zpožděný podpis sestavení s využitím jenom veřejné části klíče silného názvu. -publicsign[+|-] Vytvoří veřejný podpis sestavení s využitím jenom veřejné části klíče silného názvu. -keyfile:<file> Určuje soubor klíče se silným názvem. -keycontainer:<string> Určuje kontejner klíče se silným názvem. -highentropyva[+|-] Povolí ASLR s vysokou entropií. - RŮZNÉ - @<file> Načte další možnosti ze souboru odpovědí. -help Zobrazí tuto zprávu o použití. (Krátký formát: -?) -nologo Potlačí zprávu o autorských právech kompilátoru. -noconfig Nezahrnuje automaticky soubor CSC.RSP. -parallel[+|-] Souběžné sestavení. -version Zobrazí číslo verze kompilátoru a ukončí se. - POKROČILÉ - -baseaddress:<address> Základní adresa pro knihovnu, která se má sestavit. -checksumalgorithm:<alg> Určuje algoritmus pro výpočet kontrolního součtu zdrojového souboru uloženého v PDB. Podporované hodnoty: SHA1 nebo SHA256 (výchozí). -codepage:<n> Určuje znakovou stránku, která se má použít při otevírání zdrojových souborů. -utf8output Určuje výstup zpráv kompilátoru v kódování UTF-8. -main:<typ> Určuje typ obsahující vstupní bod (ignoruje všechny ostatní potenciální vstupní body). (Krátký formát: -m) -fullpaths Kompilátor generuje úplné cesty. -filealign:<n> Určuje zarovnání použité pro oddíly výstupního souboru. -pathmap:<K1>=<V1>,<K2>=<V2>,... Určuje mapování pro výstup zdrojových názvů cest kompilátorem. -pdb:<file> Určuje název souboru ladicích informací (výchozí: název výstupního souboru s příponou .pdb). -errorendlocation Vypíše řádek a sloupec koncového umístění jednotlivých chyb. -preferreduilang Určuje název upřednostňovaného výstupního jazyka. -nosdkpath Zakazuje hledání cesty k výchozí sadě SDK pro sestavení standardních knihoven. -nostdlib[+|-] Neodkazuje na standardní knihovnu (mscorlib.dll). -subsystemversion:<string> Určuje verzi subsystému tohoto sestavení. -lib:<file list> Určuje další adresáře, ve kterých se mají hledat reference. -errorreport:<řetězec> Určuje způsob zpracování interních chyb kompilátoru: prompt, send, queue nebo none. Výchozí možnost je queue (zařadit do fronty). -appconfig:<file> Určuje konfigurační soubor aplikace, který obsahuje nastavení vazby sestavení. -moduleassemblyname:<string> Určuje název sestavení, jehož součástí bude tento modul. -modulename:<string> Určuje název zdrojového modulu. -generatedfilesout:<dir> Umístí soubory vygenerované během kompilace do zadaného adresáře.

# WRN_GeneratorFailedDuringGeneration
source: Generator '{0}' failed to generate source. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'
cs: Generátor {0} nemohl vygenerovat zdroj. V důsledku toho může docházet k chybám kompilace a generátor nebude přispívat na výstup. Výjimka měla typ {1} se zprávou {2}.

# WRN_GeneratorFailedDuringGeneration_Description
source: Generator threw the following exception: '{0}'.
cs: Generátor vyvolal následující výjimku: {0}.

# WRN_GeneratorFailedDuringInitialization
source: Generator '{0}' failed to initialize. It will not contribute to the output and compilation errors may occur as a result. Exception was of type '{1}' with message '{2}'
cs: Generátor {0} se nepovedlo inicializovat. V důsledku toho může docházet k chybám kompilace a generátor nebude přispívat na výstup. Výjimka měla typ {1} se zprávou {2}.

# WRN_GeneratorFailedDuringInitialization_Description
source: Generator threw the following exception: '{0}'.
cs: Generátor vyvolal následující výjimku: {0}.

# ERR_AttributeCtorInParameter
source: Cannot use attribute constructor '{0}' because it has 'in' parameters.
cs: Nejde použít konstruktor atributu {0}, protože má parametry in.

# ERR_RefReturningCallAndAwait
source: 'await' cannot be used in an expression containing a call to '{0}' because it returns by reference
cs: 'Argument await nejde použít ve výrazu obsahujícím volání do {0}, protože se vrací pomocí odkazu.
de: '"await" kann nicht in einem Ausdruck verwendet werden, der einen Aufruf von "{0}" enthält, weil die Rückgabe als Verweis erfolgt.
es: 'No se puede usar 'await' en una expresión que contiene una llamada a '{0}' porque devuelve datos por referencia.
ko: 'await'는 참조로 반환되므로 '{0}'에 대한 호출이 포함된 식에 사용할 수 없습니다.
tr: 'Await' öğesi başvuru ile döndürüldüğünden, '{0}' öğesine yönelik bir çağrı içeren ifadede kullanılamaz

# WRN_Experimental
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates.
cs: {0} slouží jen pro účely vyhodnocení a v budoucích aktualizacích může dojít ke změně nebo odebrání.
de: '"{0}" dient nur zu Testzwecken und kann in zukünftigen Aktualisierungen geändert oder entfernt werden.
es: '"{0}" se incluye con fines de evaluación y está sujeto a cambios o a que se elimine en próximas actualizaciones.
ko: '{0}'은(는) 평가 목적으로 제공되며, 이후 업데이트에서 변경되거나 제거될 수 있습니다.
tr: '{0}' yalnızca değerlendirme amaçlıdır ve gelecekteki güncelleştirmelerde değiştirilebilir veya kaldırılabilir.

# WRN_Experimental_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates.
cs: Typ slouží jen pro účely vyhodnocení a v budoucích aktualizacích může dojít ke změnám nebo odebrání.
de: Der Typ dient nur zu Testzwecken und kann in zukünftigen Aktualisierungen geändert oder entfernt werden.
es: Este tipo se incluye solo con fines de evaluación y está sujeto a cambios o a que se elimine en próximas actualizaciones.
ko: 형식은 평가 목적으로 제공되며, 이후 업데이트에서 변경되거나 제거될 수 있습니다.
tr: Tür, yalnızca değerlendirme amaçlıdır ve gelecekteki güncelleştirmelerde değiştirilebilir veya kaldırılabilir.

# ERR_InExtensionMustBeValueType
source: The first parameter of the 'in' extension method '{0}' must be a concrete (non-generic) value type.
cs: Prvním parametrem metody rozšíření in {0} musí být konkrétní (neobecný) typ hodnoty.
de: Der erste Parameter der in-Erweiterungsmethode "{0}" muss ein konkreter (nicht generischer) Werttyp sein.
es: El primer parámetro del método de extensión "in" "{0}" debe ser un tipo de valor concreto (no genérico).
ko: 'in' 확장 메서드 '{0}'의 첫 번째 매개 변수는 제네릭이 아닌 구체적인 값 형식이어야 합니다.
tr: '{0}' 'in' genişletme yönteminin ilk parametresi, somut (genel olmayan) bir değer türü olmalıdır.

# ERR_AwaitForEachMissingMember
source: Asynchronous foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a suitable public instance definition for '{1}'
de: Eine asynchrone foreach-Anweisung kann nicht für Variablen vom Typ "{0}" verwendet werden, weil "{0}" keine geeignete öffentliche Instanzdefinition für "{1}" enthält.
es: Una instrucción foreach asincrónica no puede funcionar en variables de tipo "{0}", porque "{0}" no contiene una definición de instancia pública adecuada para "{1}".
ko: '{0}' 형식 변수에서 비동기 foreach 문을 수행할 수 없습니다. '{0}'에는 '{1}'의 적합한 공용 인스턴스 정의가 없기 때문입니다.
tr: '{0}', '{1}' için uygun bir genel örnek tanımı içermediğinden zaman uyumsuz foreach deyimi '{0}' türündeki değişkenlerle çalışmaz

# ERR_AwaitForEachMissingMemberWrongAsync
source: Asynchronous foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance definition for '{1}'. Did you mean 'foreach' rather than 'await foreach'?
de: Eine asynchrone foreach-Anweisung kann nicht für Variablen vom Typ "{0}" verwendet werden, weil "{0}" keine öffentliche Instanzendefinition für "{1}" enthält. Meinten Sie "foreach" statt "await foreach"?
es: Una instrucción foreach asincrónica no puede funcionar en variables de tipo "{0}" porque "{0}" no contiene ninguna definición de instancia pública para "{1}". ¿Quiso decir “foreach” en lugar de “await foreach”?
ko: '{0}' 형식 변수에서 비동기 foreach 문을 수행할 수 없습니다. '{0}'에는 '{1}'의 공용 인스턴스 정의가 없기 때문입니다. 'await foreach' 대신 'foreach'를 사용하시겠습니까?
tr: '{0}', '{1}' için bir genel örnek tanımı içermediğinden zaman uyumsuz foreach deyimi '{0}' türündeki değişkenlerle çalışmaz. 'await foreach' yerine 'foreach' mi kullanmak istediniz?

# ERR_ForEachMissingMemberWrongAsync
source: foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance definition for '{1}'. Did you mean 'await foreach' rather than 'foreach'?
de: Eine foreach-Anweisung kann nicht für Variablen vom Typ "{0}" verwendet werden, weil "{0}" keine öffentliche Instanzendefinition für "{1}" enthält. Meinten Sie "await foreach" statt "foreach"?
es: La instrucción foreach no puede funcionar en variables de tipo "{0}" porque "{0}" no contiene ninguna definición de instancia pública para "{1}". ¿Quiso decir “await foreach” en lugar de “foreach”?
ko: '{0}' 형식 변수에서 foreach 문을 수행할 수 없습니다. '{0}'에는 '{1}'의 공용 인스턴스 정의가 없기 때문입니다. 'foreach' 대신 'await foreach'를 사용하시겠습니까?
tr: '{0}', '{1}' için bir genel örnek tanımı içermediğinden foreach deyimi '{0}' türündeki değişkenlerle çalışamaz. 'foreach' yerine 'await foreach' mi kullanmak istediniz?

# ERR_NotNullConstraintMustBeFirst
source: The 'notnull' constraint must come before any other constraints
de: Die notnull-Einschränkung muss vor allen anderen Einschränkungen stehen.
es: La restricción "notnull" debe preceder a cualquier otra restricción
ko: 'notnull' 제약 조건은 다른 모든 제약 조건보다 앞에 와야 합니다.
tr: 'notnull' kısıtlaması diğer kısıtlamalardan önce gelmelidir

# ERR_NullableUnconstrainedTypeParameter
source: A nullable type parameter must be known to be a value type or non-nullable reference type. Consider adding a 'class', 'struct', or type constraint.
de: Ein Nullable-Typparameter muss als Werttyp oder als Non-Nullable-Verweistyp bekannt sein. Sie sollten eine class-, struct- oder eine Typeinschränkung hinzufügen.
es: Debe saberse si un parámetro de tipo que acepta valores NULL es un tipo de valor o un tipo de referencia que no admite valores NULL. Considere agregar "class", "struct" o una restricción de tipo.
ko: 값 형식 또는 null을 허용하지 않는 참조 형식이 되려면 nullable 형식 매개 변수를 알려야 합니다. 'class', 'struct' 또는 형식 제약 조건 추가를 고려하세요.
tr: Boş değer atanabilir bir tür parametresi bilinen bir değer türü veya boş değer atanamayan bir başvuru türü olmalıdır. Bir 'class', 'struct' veya tür kısıtlaması eklemeyi düşünün.

# ERR_RefLocalOrParamExpected
source: The left-hand side of a ref assignment must be a ref local or parameter.
de: Die linke Seite einer ref-Zuweisung muss ein lokaler Verweis oder ein Parameter sein.
es: La parte izquierda de una asignación de referencias debe ser una referencia local o un parámetro.
ko: 참조 할당의 왼쪽은 참조 로컬 또는 매개 변수여야 합니다.
tr: ref atamasının sol tarafı, yerel ref veya parametresi olmalıdır.

# ERR_SwitchArmSubsumed
source: The pattern has already been handled by a previous arm of the switch expression.
de: Das Muster wurde bereits durch einen vorherigen Zweig des switch-Ausdrucks verarbeitet.
es: El patrón ya se ha controlado con una parte anterior de la expresión switch.
ko: 패턴이 switch 식의 이전 arm에 의해 이미 처리되었습니다.
tr: Desen zaten switch deyiminin önceki bir kolu tarafından işlendi.

# ERR_SwitchCaseSubsumed
source: The switch case has already been handled by a previous case.
de: Der Parameter wurde bereits von einem vorherigen Parameter verarbeitet.
es: El caso del modificador ya se ha gestionado en un caso anterior.
ko: Switch case가 이전 case에서 이미 처리되었습니다.
tr: Switch case, önceki bir case tarafından zaten işlendi.

# ERR_UnmanagedConstraintMustBeFirst
source: The 'unmanaged' constraint must come before any other constraints
de: Die unmanaged-Einschränkung muss vor allen anderen Einschränkungen stehen.
es: La restricción "unmanaged" debe preceder a cualquier otra restricción
ko: 'unmanaged' 제약 조건은 다른 모든 제약 조건보다 앞에 와야 합니다.
tr: 'unmanaged' kısıtlaması diğer kısıtlamalardan önce gelmelidir
