Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadVisEventType
source: Inconsistent accessibility: event type '{1}' is less accessible than event '{0}'
cs: Nekonzistentní dostupnost: Typ události {1} je míň dostupný než událost {0}.
de: Inkonsistenter Zugriff: Ereignistyp "{1}" ist weniger zugreifbar als Ereignis "{0}".
es: Incoherencia de accesibilidad: el tipo de evento '{1}' es menos accesible que el evento '{0}'
fr: Accessibilité incohérente : le type d'événement '{1}' est moins accessible que l'événement '{0}'
it: Accessibilità incoerente: il tipo di evento '{1}' è meno accessibile di '{0}'
ja: アクセシビリティに一貫性がありません。イベント型 '{1}' のアクセシビリティはイベント '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 이벤트 형식이 '{0}' 이벤트보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ zdarzenia „{1}” jest mniej dostępny niż zdarzenie „{0}”
pt_br: Acessibilidade inconsistente: tipo de evento "{1}" é menos acessível do que o evento "{0}"
ru: Несогласованность по доступности: доступность типа события "{1}" ниже доступности события "{0}"
tr: Tutarsız erişilebilirlik: '{1}' olay türü, '{0}' olayından daha az erişilebilir
zh_hans: 可访问性不一致: 事件类型“{1}”的可访问性低于事件“{0}”
zh_hant: 不一致的存取範圍: 事件類型 '{1}' 比事件 '{0}' 的存取範圍小

# ERR_NamedArgumentSpecificationBeforeFixedArgument
source: Named argument specifications must appear after all fixed arguments have been specified. Please use language version {0} or greater to allow non-trailing named arguments.
cs: Specifikace pojmenovaných argumentů musí následovat po specifikaci všech pevných argumentů. Pokud chcete povolit pojmenované argumenty, které nejsou na konci, použijte prosím jazyk verze {0} nebo vyšší.
de: Die Spezifikationen für benannte Argumente müssen nach Angabe aller festen Argumente aufgeführt werden. Verwenden Sie Sprachversion {0} oder höher, um nicht nachfolgende benannte Argumente zuzulassen.
es: Las especificaciones de argumento con nombre deben aparecer después de haber especificado todos los argumentos fijos. Use la versión {0} del lenguaje, o una posterior, para permitir argumentos con nombre que no sean finales.
fr: Les spécifications d'argument nommé doivent s'afficher après la spécification de tous les arguments fixes. Utilisez la version de langage {0} ou une version ultérieure pour autoriser les arguments nommés non placés en position de fin.
it: Le specifiche di argomenti denominati devono trovarsi dopo tutti gli argomenti fissi specificati. Usare la versione {0} o versioni successive del linguaggio per consentire argomenti denominati non finali.
ja: 名前付き引数は、すべての固定引数を指定した後に指定する必要があります。末尾以外の名前付き引数を許可するには、言語バージョン {0} 以上を使用してください。
ko: 명명된 인수 사양은 모든 고정 인수를 지정한 다음에 와야 합니다. 뒤에 오지 않는 명명된 인수를 허용하려면 {0} 이상의 언어 버전을 사용하세요.
pl: Specyfikacje argumentów nazwanych muszą występować po wszystkich stałych argumentach, które zostały określone. Użyj wersji języka {0} lub nowszej, aby zezwalać na argumenty nazwane inne niż końcowe.
pt_br: As especificações de argumentos nomeados devem aparecer depois que todos os argumentos fixos forem especificados. Use a versão de linguagem {0} ou maior permitir argumentos nomeados que não estejam à direita.
ru: Спецификации именованных аргументов должны создаваться после указания всех фиксированных аргументов. Используйте версию языка {0} или более позднюю, чтобы разрешить неконечные именованные аргументы.
tr: Adlandırılmış bağımsız değişken belirtimleri, sabit bağımsız değişkenlerin tümü belirtildikten sonra görüntülenmelidir. Sonda olmayan adlandırılmış bağımsız değişkenlere izin vermek için {0} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 命名参数规范必须出现在所有固定参数都已指定完毕后。请使用语言版本 {0} 或更高版本，以允许非尾随命名参数。
zh_hant: 必須在所有固定引數皆已指定之後，具名引數規格才可出現。請使用語言版本 {0} 或更高的版本，以允許非後置的具名引數。

# ERR_NamedArgumentSpecificationBeforeFixedArgumentInDynamicInvocation
source: Named argument specifications must appear after all fixed arguments have been specified in a dynamic invocation.
cs: Specifikace pojmenovaných argumentů musí následovat po specifikaci všech pevných argumentů v dynamickém vyvolání.
de: Die Spezifikationen für benannte Argumente müssen in einem dynamischen Aufruf nach Angabe aller festen Argumente aufgeführt werden.
es: Las especificaciones de argumento con nombre deben aparecer después de haber especificado todos los argumentos fijos en una invocación dinámica.
fr: Les spécifications d'argument nommé doivent s'afficher après la spécification de tous les arguments fixes dans un appel dynamique.
it: In una chiamata dinamica le specifiche di argomenti denominati devono trovarsi dopo tutti gli argomenti fissi specificati.
ja: 動的呼び出しでは、すべての固定引数を指定した後に名前付き引数を指定する必要があります。
ko: 명명된 인수 사양은 동적 호출에서 모든 고정 인수를 지정한 다음에 와야 합니다.
pl: Specyfikacje argumentu nazwanego muszą występować po wszystkich stałych argumentach, które zostały określone w dynamicznym wywołaniu.
pt_br: As especificações de argumentos nomeados devem aparecer depois que todos os argumentos fixos forem especificados em uma invocação dinâmica.
ru: Спецификации именованных аргументов должны создаваться после всех указанных фиксированных аргументов в динамическом вызове.
tr: Adlandırılmış bağımsız değişken belirtimleri, sabit bağımsız değişkenlerin tümü dinamik çağrıyla belirtildikten sonra yer görüntülenmelidir.
zh_hans: 命名参数规范必须出现在已在动态调用中指定所有固定参数之后。
zh_hant: 必須在所有固定引數皆已在動態引動過程中指定之後，具名引數規格才可出現。

# ERR_BadNamedArgument
source: The best overload for '{0}' does not have a parameter named '{1}'
cs: Nejlepší přetížení pro {0} neobsahuje parametr s názvem {1}.
de: Die beste Überladung für "{0}" enthält keinen Parameter mit dem Namen "{1}".
es: La mejor sobrecarga para '{0}' no tiene un parámetro denominado '{1}'
fr: La meilleure surcharge pour '{0}' n'a pas de paramètre nommé '{1}'
it: Il miglior overload per '{0}' non ha un parametro denominato '{1}'
ja: '{0}' に最も適しているオーバーロードには '{1}' という名前のパラメーターがありません
ko: {0}'에 가장 적합한 오버로드에는 '{1}' 매개 변수가 없습니다.
pl: Najlepsza metoda przeładowania dla elementu „{0}” nie ma parametru o nazwie „{1}”.
pt_br: A melhor sobrecarga de "{0}" não tem um parâmetro chamado "{1}"
ru: Наиболее подходящий перегруженный метод для "{0}" не имеет параметр с именем "{1}".
tr: {0}' için en iyi yeniden yükleme, '{1}' adlı bir parametre içermiyor
zh_hans: “{0}”的最佳重载没有名为“{1}”的参数
zh_hant: 最符合 '{0}' 的多載，沒有名稱為 '{1}' 的參數

# ERR_BadNamedArgumentForDelegateInvoke
source: The delegate '{0}' does not have a parameter named '{1}'
cs: Delegát {0} neobsahuje parametr s názvem {1}.
de: Der Delegat "{0}" enthält keinen Parameter mit dem Namen "{1}".
es: El delegado '{0}' no tiene un parámetro denominado '{1}'
fr: Le délégué '{0}' n'a pas de paramètre nommé '{1}'
it: Il delegato '{0}' non ha un parametro denominato '{1}'
ja: デリゲート '{0}' には '{1}' という名前のパラメーターがありません
ko: {0}' 대리자에는 '{1}' 매개 변수가 없습니다.
pl: Delegat „{0}” nie ma parametru o nazwie „{1}”
pt_br: O representante "{0}" não tem um parâmetro chamado "{1}"
ru: Делегат "{0}" не имеет параметра с именем "{1}".
tr: Temsilci '{0}', '{1}' adlı bir parametre içermiyor
zh_hans: 委托“{0}”没有名为“{1}”的参数
zh_hant: 委派 '{0}' 沒有名稱為 '{1}' 的參數

# ERR_DuplicateNamedArgument
source: Named argument '{0}' cannot be specified multiple times
cs: Pojmenovaný argument {0} nejde zadat víckrát.
de: Das benannte {0}-Argument kann nicht mehrmals angegeben werden.
es: El argumento con nombre '{0}' no se puede especificar varias veces
fr: Impossible de spécifier plusieurs fois l'argument nommé '{0}'
it: Non è possibile specificare più volte l'argomento denominato '{0}'
ja: '{0}' という名前付き引数が複数指定されました
ko: 명명된 인수 '{0}'을(를) 여러 번 지정할 수 없습니다.
pl: Nazwanego argumentu „{0}” nie można wprowadzać wiele razy.
pt_br: O argumento nomeado "{0}" não pode ser especificado várias vezes
ru: Нельзя указывать именованный аргумент "{0}" несколько раз.
tr: {0}' adlandırılmış bağımsız değişkeni bir kereden fazla belirtilemez
zh_hans: 不能多次指定所命名的参数“{0}”
zh_hant: 不可指定多次具名引數 '{0}'

# ERR_NamedArgumentUsedInPositional
source: Named argument '{0}' specifies a parameter for which a positional argument has already been given
cs: Pojmenovaný argument {0} určuje parametr, pro který už byl poskytnut poziční argument.
de: Das benannte {0}-Argument legt einen Parameter fest, für den bereits ein positionelles Argument angegeben wurde.
es: El argumento con nombre '{0}' especifica un parámetro para el que ya se ha proporcionado un argumento posicional
fr: L'argument nommé '{0}' spécifie un paramètre pour lequel un paramètre positionnel a déjà été donné
it: L'argomento denominato '{0}' specifica un parametro per il quale è già stato fornito un argomento posizionale
ja: 名前付き引数 '{0}' は、場所引数が既に指定されているパラメーターを指定します
ko: 명명된 인수 '{0}'은(는) 위치 인수가 이미 지정된 매개 변수를 지정합니다.
pl: Nazwany argument „{0}” określa parametr, dla którego argument pozycyjny został już wskazany.
pt_br: O argumento nomeado "{0}" especifica um parâmetro para o qual já foi atribuído um argumento posicional
ru: Именованный аргумент "{0}" задает параметр, для которого уже был установлен позиционный аргумент.
tr: {0}' adlandırılmış bağımsız değişkeni konumsal bir bağımsız değişkenin zaten verildiği bir parametreyi belirtiyor
zh_hans: 命名参数“{0}”指定的形参已被赋予位置参数
zh_hant: 具名引數 '{0}' 會指定已指定其位置引數的參數

# ERR_BadNonTrailingNamedArgument
source: Named argument '{0}' is used out-of-position but is followed by an unnamed argument
cs: Pojmenovaný argument {0} se používá mimo pozici, je ale následovaný nepojmenovaným argumentem.
de: Das benannte Argument "{0}" wird außerhalb der Position verwendet, wird jedoch von einem unbenannten Argument gefolgt.
es: El argumento "{0}" con nombre se usa fuera de posición, pero va seguido de un argumento sin nombre.
fr: L'argument nommé '{0}' est utilisé hors-position mais est suivi d'un argument sans nom
it: L'argomento denominato '{0}' viene usato nella posizione errata ma è seguito da un argomento non denominato
ja: 名前付き引数 '{0}' の場所が正しくありません。後ろに名前なし引数があります
ko: 명명된 인수 '{0}'은(는) 잘못된 위치에 사용되었지만 뒤에 명명되지 않은 인수가 옵니다.
pl: Nazwany argument „{0}” jest używany poza pozycją, ale następuje po nim nienazwany argument
pt_br: O argumento nomeado '{0}' é usado fora de posição, mas é seguido por um argumento sem nome
ru: Именованный аргумент "{0}" используется не на своем месте, но за ним следует неименованный аргумент
tr: {0}' adlandırılmış bağımsız değişkeni, pozisyonu dışında kullanıldı ancak ardından adlandırılmamış bir bağımsız değişken geliyor
zh_hans: 命名参数“{0}”的使用位置不当，但后跟一个未命名参数
zh_hant: 具名引數 '{0}' 未用在正確的位置，但後面接著未命名引數

# ERR_DefaultValueUsedWithAttributes
source: Cannot specify default parameter value in conjunction with DefaultParameterAttribute or OptionalAttribute
cs: Nejde zadat výchozí hodnotu parametru v kombinaci s atributy DefaultParameterAttribute nebo OptionalAttribute.
de: Es kann kein Standardparameterwert in Verbindung mit "DefaultParameterAttribute" oder "OptionalAttribute" angegeben werden.
es: No se puede especificar un valor de parámetro predeterminado junto con DefaultParameterAttribute u OptionalAttribute
fr: Impossible de spécifier une valeur de paramètre par défaut conjointement à DefaultParameterAttribute ou OptionalAttribute
it: Impossibile specificare un valore di parametro predefinito insieme a DefaultParameterAttribute o OptionalAttribute
ja: DefaultParameterAttribute または OptionalAttribute と共に既定パラメーター値を指定することはできません
ko: DefaultParameterAttribute 또는 OptionalAttribute와 함께 기본 매개 변수 값을 지정할 수 없습니다.
pl: Nie można określić wartości domyślnej parametru w połączeniu z klasami DefaultParameterAttribute lub OptionalAttribute
pt_br: Não é possível especificar um valor de parâmetro padrão junto com DefaultParameterAttribute ou OptionalAttribute
ru: Не удалось указать значение параметра по умолчанию вместе с DefaultParameterAttribute или OptionalAttribute.
tr: DefaultParameterAttribute veya OptionalAttribute ile birlikte varsayılan parametre değeri belirtilemez
zh_hans: 不能同时指定默认参数值与 DefaultParameterAttribute 或 OptionalAttribute
zh_hant: 不能連同 DefaultParameterAttribute 或 OptionalAttribute 一起指定預設參數值

# ERR_DefaultValueMustBeConstant
source: Default parameter value for '{0}' must be a compile-time constant
cs: Výchozí hodnota parametru pro {0} musí být konstanta definovaná při kompilaci.
de: Der Standardparameterwert für "{0}" muss eine Kompilierzeitkonstante sein.
es: El valor de parámetro predeterminado para '{0}' debe ser una constante en tiempo de compilación
fr: La valeur de paramètre par défaut pour '{0}' doit être constante au moment de la compilation
it: Il valore di parametro predefinito per '{0}' deve essere una costante in fase di compilazione
ja: '{0}' の既定のパラメーター値は、コンパイル時の定数である必要があります
ko: {0}'의 기본 매개 변수 값은 컴파일 타임 상수여야 합니다.
pl: Wartość domyślna parametru „{0}” musi być stałą czasu kompilacji
pt_br: Valor do parâmetro padrão "{0}" deve ser uma constante de tempo de compilação
ru: Значение параметра по умолчанию для "{0}" должно быть константой времени компиляции.
tr: {0}' için varsayılan parametre değeri bir derleme zamanı sabiti olmalıdır
zh_hans: “{0}”的默认参数值必须是编译时常量
zh_hant: '{0}' 的預設參數值必須是編譯時期的常數

# ERR_RefOutDefaultValue
source: A ref or out parameter cannot have a default value
cs: Parametr Ref nebo Uut nemůže mít výchozí hodnotu.
de: Ein ref- oder out-Parameter kann keinen Standardwert aufweisen.
es: Un parámetro ref o out no puede tener un valor predeterminado
fr: Un paramètre ref ou out ne peut pas avoir de valeur par défaut
it: Un parametro out o ref non può avere un valore predefinito
ja: ref パラメーターまたは out パラメーターには既定値を指定できません
ko: ref 또는 out 매개 변수에는 기본값을 사용할 수 없습니다.
pl: Parametr ref lub out nie może mieć wartości domyślnej
pt_br: Um parâmetro ref ou out não pode ter um valor padrão
ru: Параметр ref или out не может иметь значение по умолчанию.
tr: Bir ref veya out parametresinin varsayılan değeri olamaz
zh_hans: ref 或 out 参数不能有默认值
zh_hant: ref 或 out 參數不能有預設值

# ERR_DefaultValueForExtensionParameter
source: Cannot specify a default value for the 'this' parameter
cs: Nejde zadat výchozí hodnotu pro parametr this.
de: Es kann kein Standardwert für den this-Parameter angegeben werden.
es: No se puede especificar un valor predeterminado para el parámetro 'this'
fr: Impossible de spécifier une valeur par défaut pour le paramètre 'this'
it: Impossibile specificare un valore predefinito per il parametro 'this'
ja: this' パラメーターには既定値を指定できません
ko: this' 매개 변수의 기본값을 지정할 수 없습니다.
pl: Nie można określić wartości domyślnej dla parametru „this”
pt_br: Não é possível especificar um valor padrão para o parâmetro 'this'
ru: Не удалось указать значение по умолчанию для параметра this.
tr: this' parametresi için varsayılan değer belirtilemez
zh_hans: 不能为 "this" 参数指定默认值
zh_hant: 無法指定 'this' 參數的預設值

# ERR_DefaultValueForParamsParameter
source: Cannot specify a default value for a parameter collection
fr: Désolé... Nous ne pouvons pas spécifier une valeur par défaut pour une collection de paramètres
it: Impossibile specificare un valore predefinito per una raccolta di parametri
pl: Nie można określić wartości domyślnej dla tablicy parametrów
pt_br: Não é possível especificar um valor padrão para uma coleção de parâmetros
ru: Не удается указать значение по умолчанию для коллекции параметров.
zh_hans: 无法为参数集合指定默认值
zh_hant: 無法指定參數收集的預設值

# ERR_NoConversionForDefaultParam
source: A value of type '{0}' cannot be used as a default parameter because there are no standard conversions to type '{1}'
cs: Hodnotu typu {0} nejde použít jako výchozí parametr, protože neexistují žádné standardní převody na typ {1}.
de: Ein Wert vom Typ "{0}" kann nicht als Standardparameter verwendet werden, da keine Standardkonvertierungen in den Typ "{1}" vorhanden sind.
es: Un valor de tipo '{0}' no se puede usar como parámetro predeterminado porque no hay conversiones estándar al tipo '{1}'
fr: Impossible d'utiliser une valeur de type '{0}' comme paramètre par défaut, car il n'existe pas de conversion standard en type '{1}'
it: Non è possibile usare un valore di tipo '{0}' come parametro predefinito. Non sono disponibili conversioni standard nel tipo '{1}'
ja: 型 '{1}' への標準変換が存在しないため、型 '{0}' の値を既定のパラメーターとして使用できません
ko: {1}' 형식으로의 표준 변환이 없으므로 형식이 '{0}'인 값을 기본 매개 변수로 사용할 수 없습니다.
pl: Wartości typu „{0}” nie można użyć jako domyślnego parametru, ponieważ nie ma standardowych konwersji do typu „{1}”
pt_br: Um valor de tipo "{0}" não pode ser usado como um parâmetro padrão porque não há conversões padrões para o tipo "{1}"
ru: Использование значения типа "{0}" в качестве параметра по умолчанию недопустимо, так как отсутствуют стандартные методы преобразования в тип "{1}".
tr: {1}' türüne standart dönüştürme olmadığından '{0}' türünün bir değeri varsayılan parametre olarak kullanılamıyor
zh_hans: 不能将“{0}”类型的值用作默认参数，因为没有到类型“{1}”的标准转换
zh_hant: 類型 '{0}' 的值不可用做為預設參數，因為沒有標準轉換至類型 '{1}'

# ERR_NoConversionForNubDefaultParam
source: A value of type '{0}' cannot be used as default parameter for nullable parameter '{1}' because '{0}' is not a simple type
cs: Hodnotu typu {0} nejde použít jako výchozí hodnotu parametru {1} s možnou hodnotou null, protože {0} není jednoduchý typ.
de: Ein Wert vom Typ "{0}" kann nicht als Standardparameter für den Parameter "{1}", der NULL-Werte zulässt, verwendet werden, weil "{0}" kein einfacher Typ ist.
es: Un valor de tipo '{0}' no se puede usar como parámetro predeterminado para el parámetro '{1}' que acepta valores NULL porque '{0}' no es un tipo simple
fr: Impossible d'utiliser une valeur de type '{0}' comme paramètre par défaut pour le paramètre Nullable '{1}', car '{0}' n'est pas un type simple
it: Non è possibile usare un valore di tipo '{0}' come parametro predefinito per il parametro nullable '{1}' perché '{0}' non è un tipo semplice
ja: '{0}' は単純型ではないため、型 '{0}' の値を Null 許容パラメーター '{1}' の既定のパラメーターとして使用することはできません
ko: {0}'이(가) 단순 형식이 아니기 때문에 null 허용 매개 변수 '{1}'에 형식이 '{0}'인 값을 기본 매개 변수로 사용할 수 없습니다.
pl: Wartości typu „{0}” nie można użyć jako domyślnego parametru dla parametru dopuszczającego wartość null „{1}”, ponieważ typ „{0}” nie jest typem prostym
pt_br: Um valor do tipo "{0}" não pode ser usado como parâmetro padrão para parâmetro anulável "{1}" porque "{0}" não é um tipo simples
ru: Значение типа "{0}" нельзя использовать в качестве параметра по умолчанию для допускающего значение Null параметра "{1}", так как "{0}" не является простым типом
tr: {0}' basit bir tür olmadığından, '{0}' türündeki bir değer null yapılabilir '{1}' parametresi için varsayılan parametre olarak kullanılamaz
zh_hans: 无法将类型为“{0}”的值用作可以为 null 的参数“{1}”的默认参数，因为“{0}”不是简单类型
zh_hant: 類型 '{0}' 的值不可用做為可為 Null 之參數 '{1}' 的預設參數，因為 '{0}' 不是簡單類型

# ERR_NotNullRefDefaultParameter
source: '{0}' is of type '{1}'. A default parameter value of a reference type other than string can only be initialized with null
cs: {0} je typu {1}. Výchozí hodnotu parametru s jiným než řetězcovým typem odkazu jde inicializovat jenom hodnotou null.
de: '"{0}" hat den Typ "{1}". Ein standardmäßiger Parameterwert eines anderen Verweistyps als "String" kann nur mit NULL initialisiert werden.
es: '{0}' es de tipo '{1}'. Un valor de parámetro predeterminado de un tipo de referencia que no sea de cadena solo se puede inicializar con NULL
fr: '{0}' est de type '{1}'. Une valeur de paramètre par défaut d'un type référence autre que string ne peut être initialisé qu'avec null
it: '{0}' è di tipo '{1}'. Un valore di parametro predefinito di un tipo riferimento non stringa può essere inizializzato solo con Null.
ja: '{0}' の型は '{1}' です。文字列以外の参照型の既定のパラメーター値は null でのみ初期化できます。
ko: '{0}'의 형식이 '{1}'입니다. 문자열이 아닌 참조 형식의 기본 매개 변수 값은 null로만 초기화할 수 있습니다.
pl: 'Typ elementu „{0}” to „{1}”. Wartość domyślnego parametru typu referencyjnego innego niż string można zainicjować tylko przy użyciu wartości null
pt_br: "{0}" é do tipo "{1}". Um valor de parâmetro padrão de um tipo de referência diferente de cadeia de caracteres pode somente ser inicializado com null
ru: "{0}" является типом "{1}". Значение по умолчанию для параметра, имеющее ссылочный тип, который отличается от string, может инициализироваться только значением Null.
tr: '{0}', '{1}' türüne sahip. Dizeden başka bir başvuru türünün varsayılan parametre değeri yalnızca null ile başlatılabilir
zh_hans: “{0}”的类型为“{1}”。只能用 Null 对引用类型(字符串除外)的默认参数值进行初始化
zh_hant: '{0}' 為類型 '{1}'。非字串之參考類型的預設參數值，只能以 null 初始設定。

# WRN_DefaultValueForUnconsumedLocation
source: The default value specified for parameter '{0}' will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: Výchozí hodnota zadaná pro parametr {0} nebude mít žádný efekt, protože platí pro člen, který se používá v kontextech nedovolujících nepovinné argumenty.
de: Der für Parameter "{0}" angegebene Standardwert hat keine Auswirkungen, da er für einen Member gilt, der in Kontexten verwendet wird, in denen keine optionalen Argumente zulässig sind.
es: El valor predeterminado especificado para el parámetro '{0}' no tendrá efecto porque se aplica a un miembro que se usa en contextos que no permiten argumentos opcionales
fr: La valeur par défaut spécifiée pour le paramètre '{0}' n'aura aucun effet, car elle s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: Il valore predefinito specificato per il parametro '{0}' non avrà effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: パラメーター '{0}' に対して指定されている既定値は、省略可能な引数を許可しないコンテキストで使用されるメンバーに適用されるため無効となります
ko: '{0}' 매개 변수에 지정된 기본값은 선택적 인수를 허용하지 않는 컨텍스트에서 사용되는 멤버에 적용되므로 효과가 없습니다.
pl: Domyślna wartość określona dla parametru „{0}” nie odniesie żadnego skutku, ponieważ jest zastosowana dla składowej używanej w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O valor padrão especificado para o parâmetro "{0}" não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem argumentos opcionais
ru: Значение по умолчанию, указанное для параметра "{0}", не будет действовать, так как оно применяется к члену, используемому в контекстах, не допускающих необязательных аргументов.
tr: İsteğe bağlı bağımsız değişkenlere izin vermeyen bir bağlamda kullanılan bir üyeye uygulandığından '{0}' parametresi için belirtilen varsayılan değerin hiçbir etkisi olmayacak
zh_hans: 为形参“{0}”指定的默认值将不起任何作用，因为它适用于在不允许指定可选实参的上下文中使用的成员
zh_hant: 為參數 '{0}' 指定的預設值將沒有作用，因為它套用到了不允許選擇性引數的內容中所使用之成員
