Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ValueTypePropertyInObjectInitializer
source: Members of property '{0}' of type '{1}' cannot be assigned with an object initializer because it is of a value type
cs: Členy vlastnosti {0} typu {1} nejde přiřadit k inicializátoru objektu, protože tento inicializátor je hodnotového typu.
de: Member der {0}-Eigenschaft vom Typ "{1}" können nicht mit einem Objektinitialisierer zugewiesen werden, da es sich um einen Werttyp handelt.
es: Los miembros de la propiedad '{0}' de tipo '{1}' no se pueden asignar con un inicializador de objeto porque es de un tipo de valor
fr: Les membres de la propriété '{0}' de type '{1}' ne peuvent pas être assignés avec un initialiseur d'objet, car il s'agit d'un type valeur
it: Non è possibile assegnare i membri della proprietà '{0}' di tipo '{1}' con un inizializzatore di oggetto perché è di un tipo valore
ja: 型 '{1}' のプロパティ '{0}' のメンバーは、値の型であるため、オブジェクト初期化子と共に割り当てることはできません
ko: 형식이 '{1}'인 '{0}' 속성의 멤버는 값 형식이므로 개체 이니셜라이저를 사용하여 할당할 수 없습니다.
pl: Składowych właściwości „{0}” typu „{1}” nie można przypisać za pomocą inicjatora obiektu, ponieważ jest on typu wartości
pt_br: Membros da propriedade "{0}" do tipo "{1}" não podem ser atribuídos com um inicializador de objeto porque ele é de um tipo de valor
ru: Членам свойства "{0}" типа "{1}" не могут быть присвоены значения с помощью инициализатора объекта, так как они имеют тип значения
tr: Değer türüne sahip olduğundan, '{1}' türünün '{0}' özelliğinin üyeleri bir nesne başlatıcısı ile atanamaz
zh_hans: 无法使用对象初始值设定项为类型为“{1}”的属性“{0}”的成员赋值，因为它是值类型
zh_hant: 類型 '{1}' 且屬性為 '{0}' 的成員，無法以物件初始設定式進行指派，因為其為實值類型

# ERR_UnsafeTypeInObjectCreation
source: Unsafe type '{0}' cannot be used in object creation
cs: K vytvoření objektu nejde použít nezabezpečený typ {0}.
de: Der unsichere Typ "{0}" darf bei der Objekterstellung nicht verwendet werden.
es: El tipo '{0}' no seguro no se puede usar para crear un objeto
fr: Impossible d'utiliser le type unsafe '{0}' dans la création d'objet
it: Non è possibile usare il tipo unsafe '{0}' nella creazione di oggetti
ja: 安全でない型 '{0}' をオブジェクトの作成に使用することはできません
ko: 안전하지 않은 '{0}' 형식은 개체를 만드는 데 사용할 수 없습니다.
pl: Nie można użyć niezabezpieczonego typu „{0}” do tworzenia obiektów
pt_br: O tipo não seguro "{0}" não pode ser usado na criação do objeto
ru: Небезопасный тип "{0}" не может применяться при создании объекта.
tr: {0}' güvenli olmayan türü nesne oluşturmada kullanılamaz
zh_hans: 对象创建中不能使用不安全的类型“{0}”
zh_hant: 建立物件時不能使用 Unsafe 類型 '{0}'

# ERR_EmptyElementInitializer
source: Element initializer cannot be empty
cs: Inicializátor prvku nemůže být prázdný.
de: Der Elementinitialisierer darf nicht leer sein.
es: El inicializador de elemento no puede estar vacío
fr: L'initialiseur d'élément ne peut pas être vide
it: L'inizializzatore di elementi non può essere vuoto
ja: 要素初期化子を空白にはできません
ko: 요소 이니셜라이저는 비워 둘 수 없습니다.
pl: Inicjator elementu nie może być pusty
pt_br: O inicializador de elemento não pode estar vazio
ru: Инициализатор элемента не может быть пустым.
tr: Öğe başlatıcısı boş olamaz
zh_hans: 元素初始值设定项不能为空
zh_hant: 項目初始設定式不可為空白

# ERR_InitializerAddHasWrongSignature
source: The best overloaded method match for '{0}' has wrong signature for the initializer element. The initializable Add must be an accessible instance method.
cs: Odpovídající optimální přetěžovaná metoda pro {0} má nesprávný podpis prvku inicializátoru. Jako inicializovatelná metoda Add se musí používat dostupná instanční metoda.
de: Die beste Übereinstimmung für die überladene "{0}"-Methode hat eine falsche Signatur für das Initialisiererelement. Das initialisierbare "Add" muss eine Instanzmethode sein, auf die zugegriffen werden kann.
es: La mejor coincidencia de método sobrecargado para '{0}' tiene una firma errónea para el elemento inicializador. El elemento Add inicializable debe ser un método de instancia accesible.
fr: La méthode surchargée correspondant le mieux à '{0}' n'a pas la bonne signature pour l'élément initialiseur. Add initialisable doit être une méthode d'instance accessible.
it: La firma per l'elemento inizializzatore nella migliore corrispondenza del metodo di overload per '{0}' non è corretta. Il metodo Add inizializzabile deve essere un metodo di istanza accessibile.
ja: '{0}' に最も適しているオーバーロード メソッドには、初期化子要素の正しくないシグネチャが含まれます。初期化可能な Add は、アクセス可能なインスタンス メソッドでなければなりません。
ko: {0}'에 가장 일치하는 오버로드된 메서드에는 잘못된 이니셜라이저 요소의 시그니처가 있습니다. 초기화 가능한 Add는 액세스 가능한 인스턴스 메서드여야 합니다.
pl: Najlepiej dopasowana metoda przeciążona elementu „{0}” zawiera niewłaściwą sygnaturę dla elementu inicjatora. Możliwa do zainicjowania metoda Add musi być dostępną metodą wystąpienia.
pt_br: A melhor correspondência de método sobrecarregado para "{0}" tem assinatura errada para o elemento do inicializador. O Add inicializável deve ser um método de instância acessível.
ru: Наиболее подходящий перегруженный метод для "{0}" имеет неправильную сигнатуру элемента инициализатора. Инициализируемый метод Add должен быть доступным методом экземпляра.
tr: {0}' ile en iyi eşleşen tekrar yüklenen yöntem, başlatıcı öğesi için yanlış imza içeriyor. Başlatılabilir Add, erişilebilir bir örnek yöntemi olmalıdır.
zh_hans: 与“{0}”最匹配的重载方法具有对于初始值设定项元素而言错误的签名。可初始化的 Add 必须是可访问的实例方法。
zh_hant: 最符合 '{0}' 的多載方法，沒有正確的初始設定式元素簽章。可初始化的 Add 必須是可存取的執行個體方法。

# ERR_CollectionInitRequiresIEnumerable
source: Cannot initialize type '{0}' with a collection initializer because it does not implement 'System.Collections.IEnumerable'
cs: Nejde inicializovat typ {0} pomocí inicializátoru kolekce, protože neimplementuje System.Collections.IEnumerable.
de: Der Typ "{0}" kann nicht mit einem Sammlungsinitialisierer initialisiert werden, weil er nicht "System.Collections.IEnumerable" implementiert.
es: No se puede inicializar el tipo '{0}' con un inicializador de colección porque no implementa 'System.Collections.IEnumerable'
fr: Impossible d'initialiser le type '{0}' avec un initialiseur de collection, car il n'implémente pas 'System.Collections.IEnumerable'
it: Non è possibile inizializzare il tipo '{0}' con un inizializzatore di raccolta perché non implementa 'System.Collections.IEnumerable'
ja: System.Collections.IEnumerable' を実装していないため、型 '{0}' はコレクション初期化子で初期化することはできません。
ko: {0}' 형식은 'System.Collections.IEnumerable'을 구현하지 않으므로 컬렉션 이니셜라이저를 사용하여 초기화할 수 없습니다.
pl: Nie można zainicjować typu „{0}” za pomocą inicjatora kolekcji, ponieważ nie implementuje on interfejsu „System.Collections.IEnumerable”
pt_br: Não é possível inicializar o tipo "{0}" com um inicializador de coleta porque ele não implementa "System.Collections.IEnumerable"
ru: Не удается инициализировать тип "{0}" инициализатором набора, потому что он не реализует интерфейс "System.Collections.IEnumerable".
tr: System.Collections.IEnumerable' uygulamadığından '{0}' türü bir koleksiyon başlatıcısıyla başlatılamıyor
zh_hans: 无法使用集合初始值设定项初始化类型“{0}”，原因是它不实现“System.Collections.IEnumerable”
zh_hant: 無法使用集合初始設定式來初始設定類型 '{0}'，因為其未實作 'System.Collections.IEnumerable'。

# WRN_CantHaveManifestForModule
source: Ignoring /win32manifest for module because it only applies to assemblies
cs: Přepínač /win32manifest pro modul se bude ignorovat, protože se vztahuje jenom k sestavením.
de: "/win32manifest" gilt nur für Assemblys und wird für das Modul ignoriert.
es: Se omitirá /win32manifest para el módulo porque solo se aplica a ensamblados
fr: Option /win32manifest ignorée pour le module, car elle s'applique uniquement aux assemblys
it: L'opzione /win32manifest per il modulo verrà ignorata perché si applica solo agli assembly
ja: モジュールの /win32manifest は、アセンブリにのみ適用されるため、無視されます
ko: /win32manifest는 어셈블리에만 적용되므로 모듈의 경우 무시합니다.
pl: Opcja /win32manifest dla modułu zostanie zignorowana, ponieważ dotyczy tylko zestawów
pt_br: Ignore /win32manifest do módulo porque ele só se aplica aos assemblies
ru: Ключ /win32manifest для модуля пропущен, т. к. используется только для сборок
tr: Yalnızca derlemeler için geçerli olduğundan modülde /win32manifest yoksayılıyor
zh_hans: 对模块忽略 /win32manifest，因为它仅应用于程序集
zh_hant: 因為模組的 /win32manifest 僅適用於組件，因此將予以忽略

# WRN_CantHaveManifestForModule_Title
source: Ignoring /win32manifest for module because it only applies to assemblies
cs: Přepínač /win32manifest pro modul se bude ignorovat, protože se vztahuje jenom k sestavením.
de: "/win32manifest" gilt nur für Assemblys und wird für das Modul ignoriert.
es: Se omitirá /win32manifest para el módulo porque solo se aplica a ensamblados
fr: Option /win32manifest ignorée pour le module, car elle s'applique uniquement aux assemblys
it: L'opzione /win32manifest per il modulo verrà ignorata perché si applica solo agli assembly
ja: モジュールの /win32manifest は、アセンブリにのみ適用されるため、無視されます
ko: /win32manifest는 어셈블리에만 적용되므로 모듈의 경우 무시합니다.
pl: Opcja /win32manifest dla modułu zostanie zignorowana, ponieważ dotyczy tylko zestawów
pt_br: Ignore /win32manifest do módulo porque ele só se aplica aos assemblies
ru: Ключ /win32manifest для модуля пропущен, т. к. используется только для сборок
tr: Yalnızca derlemeler için geçerli olduğundan modülde /win32manifest yoksayılıyor
zh_hans: 对模块忽略 /win32manifest，因为它仅应用于程序集
zh_hant: 因為模組的 /win32manifest 僅適用於組件，因此將予以忽略

# ERR_BadInstanceArgType
source: '{0}' does not contain a definition for '{1}' and the best extension method overload '{2}' requires a receiver of type '{3}'
cs: {0} neobsahuje definici pro {1} a přetížení optimální metody rozšíření {2} vyžaduje přijímač typu {3}.
de: '"{0}" enthält keine Definition für "{1}", und die Überladung der optimalen Erweiterungsmethode "{2}" erfordert einen Empfänger vom Typ "{3}".
es: '{0}' no contiene una definición para '{1}' y la mejor sobrecarga del método de extensión '{2}' requiere un receptor del tipo '{3}'
fr: '{0}' ne contient pas de définition pour '{1}' et la meilleure surcharge de méthode d'extension '{2}' nécessite un récepteur de type '{3}'
it: '{0}' non contiene una definizione per '{1}' e il miglior overload '{2}' del metodo di estensione richiede un ricevitore di tipo '{3}'
ja: '{0}' に '{1}' の定義が含まれておらず、最も適している拡張メソッド オーバーロード '{2}' には '{3}' 型のレシーバーが必要です
ko: '{0}'에는 '{1}'에 대한 정의가 포함되어 있지 않고, 가장 적합한 확장 메서드 오버로드 '{2}'에는 '{3}' 형식의 수신기가 필요합니다.
pl: „{0}” nie zawiera definicji dla „{1}”, a najlepsze przeciążenie metody rozszerzenia „{2}” wymaga odbiorcy typu „{3}”
pt_br: "{0}" não contém uma definição para "{1}" e a melhor sobrecarga do método de extensão "{2}" requer um receptor do tipo "{3}"
ru: "{0}" не содержит определение для "{1}", и наиболее подходящий перегруженный метод расширения "{2}" требует наличия получателя типа "{3}".
tr: '{0}' bir '{1}' tanımı içermiyor ve en iyi genişletme yöntemi yeniden yüklemesi olan '{2}', '{3}' türünün bir alıcısını gerektiriyor
zh_hans: “{0}”不包含“{1}”的定义，并且最佳扩展方法重载“{2}”需要类型为“{3}”的接收器
zh_hant: '{0}' 未包含 '{1}' 的定義，且最佳擴充方法多載 '{2}' 需要類型 '{3}' 的接收器

# ERR_QueryDuplicateRangeVariable
source: The range variable '{0}' has already been declared
cs: Proměnná rozsahu {0} je už deklarovaná.
de: Die Bereichsvariable "{0}" ist bereits deklariert.
es: La variable de rango '{0}' ya se ha declarado
fr: La variable de portée '{0}' a déjà été déclarée
it: La variabile di intervallo '{0}' è già stata dichiarata
ja: 範囲変数 '{0}' は既に宣言されています
ko: {0}' 범위 변수가 이미 선언되었습니다.
pl: Zmienna zakresu „{0}” jest już zadeklarowana
pt_br: A variável de intervalo "{0}" já foi declarada
ru: Переменная диапазона "{0}" уже была объявлена.
tr: Aralık değişkeni '{0}' zaten ifade edilmiş
zh_hans: 已声明范围变量“{0}”
zh_hant: 已宣告範圍變數 '{0}'

# ERR_QueryRangeVariableOverrides
source: The range variable '{0}' conflicts with a previous declaration of '{0}'
cs: Proměnná rozsahu {0} je v konfliktu s předchozí deklarací {0}.
de: Die Bereichsvariable "{0}" verursacht einen Konflikt mit einer früheren Deklaration von "{0}".
es: La variable de rango '{0}' entra en conflicto con una declaración anterior de '{0}'
fr: La variable de portée '{0}' est en conflit avec une déclaration précédente de '{0}'
it: La variabile di intervallo '{0}' è in conflitto con una dichiarazione precedente di '{0}'
ja: 範囲変数 '{0}' が '{0}' の以前の宣言と競合しています
ko: 범위 변수 '{0}'이(가) '{0}'의 이전 선언과 충돌합니다.
pl: Zmienna zakresu „{0}” powoduje konflikt z poprzednią deklaracją zmiennej „{0}”
pt_br: A variável de intervalo "{0}" está em conflito com uma declaração anterior de "{0}"
ru: Переменная диапазона "{0}" конфликтует с предыдущим объявлением "{0}".
tr: {0}' aralık değişkeni '{0}' öğesinin önceki bildirimi ile çakışıyor
zh_hans: 范围变量“{0}”与“{0}”的以前声明冲突
zh_hant: 範圍變數 '{0}' 與之前的 '{0}' 宣告相衝突

# ERR_QueryRangeVariableAssignedBadValue
source: Cannot assign {0} to a range variable
cs: {0} nejde přiřadit k proměnné rozsahu.
de: "{0}" kann keiner Bereichsvariablen zugewiesen werden.
es: No se puede asignar {0} a una variable de rango
fr: Impossible d'assigner {0} à une variable de portée
it: Non è possibile assegnare {0} a una variabile di intervallo
ja: 範囲変数に {0} を割り当てることができません
ko: {0}을(를) 범위 변수에 할당할 수 없습니다.
pl: Nie można przypisać elementu „{0}” do zmiennej zakresu
pt_br: Não é possível atribuir {0} a uma variável de intervalo
ru: Невозможно присвоить {0} переменной диапазона.
tr: {0} bir aralık değişkenine atanamaz
zh_hans: 无法将 {0} 赋给范围变量
zh_hant: 無法指派 {0} 至範圍變數

# ERR_QueryNoProviderCastable
source: Could not find an implementation of the query pattern for source type '{0}'. '{1}' not found. Consider explicitly specifying the type of the range variable '{2}'.
cs: Nenašla se implementace vzorku dotazu pro typ zdroje {0}. Nenašel se prvek {1}. Zvažte možnost explicitního určení typu proměnné rozsahu {2}.
de: Es konnte keine Implementierung des Abfragemusters für den Quelltyp "{0}" gefunden werden. "{1}" wurde nicht gefunden. Geben Sie den Typ der Bereichsvariablen "{2}" explizit an.
es: No se encontró ninguna implementación del patrón de consulta para el tipo de origen '{0}'. No se encontró '{1}'. Puede especificar de forma explícita el tipo de la variable de rango '{2}'.
fr: Impossible de trouver une implémentation du modèle de requête pour le type source '{0}'. '{1}' introuvable. Spécifiez explicitement le type de la variable de portée '{2}'.
it: Non è stata trovata un'implementazione del modello di query per il tipo di origine '{0}'. '{1}' non è presente. Provare a specificare in modo esplicito il tipo della variabile di intervallo '{2}'
ja: ソース型 '{0}' のクエリ パターンの実装が見つかりませんでした。'{1}' が見つかりません。範囲変数 '{2}' の型を明示的に指定してください。
ko: 소스 형식 '{0}'에 대해 구현된 쿼리 패턴을 찾을 수 없습니다. '{1}'을(를) 찾을 수 없습니다. 범위 변수 '{2}'의 형식을 명시적으로 지정하세요.
pl: Nie można znaleźć implementacji wzorca zapytania dla typu źródłowego „{0}”. Nie znaleziono elementu „{1}”. Rozważ jawne określenie typu zmiennej zakresu „{2}”.
pt_br: Não foi possível encontrar uma implementação do padrão de consulta para o tipo de origem "{0}". "{1}" não encontrado. Considere especificar explicitamente o tipo da variável de intervalo "{2}".
ru: Не удалось найти реализацию шаблона запроса для исходного типа "{0}". "{1}" не найден. Попробуйте явно указать тип переменной диапазона "{2}".
tr: {0}' sorgu türü için sorgu deseninin bir uygulaması bulunamadı. '{1}' bulunamadı. '{2}' aralık değişkeninin türünü açıkça belirtmeyi düşünün.
zh_hans: 未能找到源类型“{0}”的查询模式的实现。未找到“{1}”。请考虑显式指定范围变量“{2}”的类型。
zh_hant: 找不到來源類型 '{0}' 的查詢模式實作。找不到 '{1}'。請考慮明確地指定範圍變數 '{2}' 的類型。

# ERR_QueryNoProviderStandard
source: Could not find an implementation of the query pattern for source type '{0}'. '{1}' not found. Are you missing required assembly references or a using directive for 'System.Linq'?
cs: Nenašla se implementace vzorku dotazu pro typ zdroje {0}. Nenašel se prvek {1}. Nechybí odkazy na požadovaná sestavení nebo direktiva using pro System.Linq?
fr: Impossible de trouver une implémentation du modèle de requête pour le type source '{0}'. '{1}' introuvable. Vous manque-t-il des références d'assembly requises ou une directive using pour 'System.Linq' ?
it: Non è stata trovata alcuna implementazione del modello di query per il tipo di origine '{0}'. '{1}' non è presente. Mancano i riferimenti all'assembly richiesti oppure una direttiva using per 'System.Linq'?
ja: ソース型 '{0}' のクエリ パターンの実装が見つかりませんでした。'{1}' が見つかりません。'System.Linq' の必要なアセンブリ参照か using ディレクティブが不足していないかご確認ください。
pl: Nie można znaleźć implementacji wzorca zapytania dla typu źródłowego „{0}”. Nie znaleziono elementu „{1}”. Być może brakuje wymaganych odwołań do zestawów lub używasz dyrektywy dla przestrzeni nazw „System.Linq”.
pt_br: Não foi possível encontrar uma implementação do padrão de consulta para o tipo de origem '{0}'. '{1}' não encontrado. Estão faltando referências de assembly necessárias ou um diretiva using para 'System.Linq'?
ru: Не удалось найти реализацию шаблона запроса для исходного типа "{0}". "{1}" не найден. Возможно, не хватает обязательных ссылок на сборку или используется директива для "System.Linq".
zh_hans: 未能找到源类型“{0}”的查询模式的实现。未找到“{1}”。是否缺少必需的程序集引用或用于 "System.Linq" 的 using 指令?
zh_hant: 找不到來源類型 '{0}' 的查詢模式實作。找不到 '{1}'。是否遺漏了必要的組件參考或 'System.Linq' 的 using 指示詞?

# ERR_QueryNoProvider
source: Could not find an implementation of the query pattern for source type '{0}'. '{1}' not found.
cs: Nenašla se implementace vzorku dotazu pro typ zdroje {0}. Nenašel se prvek {1}.
de: Es konnte keine Implementierung des Abfragemusters für den Quelltyp "{0}" gefunden werden. "{1}" wurde nicht gefunden.
es: No se encontró ninguna implementación del patrón de consulta para el tipo de origen '{0}'. No se encontró '{1}'.
fr: Impossible de trouver une implémentation du modèle de requête pour le type source '{0}'. '{1}' introuvable.
it: Non è stata trovata un'implementazione di un modello di query per il tipo di origine '{0}'. '{1}' non è presente.
ja: ソース型 '{0}' のクエリ パターンの実装が見つかりませんでした。'{1}' が見つかりません。
ko: 소스 형식 '{0}'에 대해 구현된 쿼리 패턴을 찾을 수 없습니다. '{1}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć implementacji wzorca zapytania dla typu źródłowego „{0}”. Nie znaleziono elementu „{1}”.
pt_br: Não foi possível encontrar uma implementação do padrão de consulta para o tipo de origem "{0}". "{1}" não encontrado.
ru: Не удалось найти реализацию шаблона запроса для исходного типа "{0}". "{1}" не найден.
tr: {0}' kaynak türü için sorgu kalıbının uygulaması bulunamadı. '{1}' bulunamadı.
zh_hans: 未能找到源类型“{0}”的查询模式的实现。未找到“{1}”。
zh_hant: 找不到來源類型 '{0}' 的查詢模式實作。找不到 '{1}'。

# ERR_QueryOuterKey
source: The name '{0}' is not in scope on the left side of 'equals'. Consider swapping the expressions on either side of 'equals'.
cs: Název {0} není v oboru levé strany operátoru equals. Zvažte možnost vzájemné záměny výrazů na obou stranách operátoru equals.
de: Der Name "{0}" ist auf der linken Seite von "equals" nicht im Bereich. Vertauschen Sie die Ausdrücke auf beiden Seiten von "equals".
es: El nombre '{0}' no está dentro del ámbito en el lado izquierdo de 'equals'. Puede intercambiar las expresiones en cualquier lado de 'equals'.
fr: Le nom '{0}' n'est pas dans la portée à gauche de 'equals'. Échangez les expressions de chaque côté de 'equals'.
it: Il nome '{0}' non si trova nell'ambito a sinistra di 'equals'. Provare a invertire le espressioni ai lati di 'equals'.
ja: 名前 '{0}' は 'equals' の左辺のスコープにありません。'equals' の両辺の式を交換してみてください。
ko: 이름 '{0}'은(는) 'equals'의 왼쪽에 올 수 있는 범위에 속하지 않습니다. 'equals'의 양쪽에 있는 식을 서로 바꾸세요.
pl: Nazwa „{0}” jest poza zakresem lewej strony operatora równości. Rozważ zamianę wyrażeń po obu stronach operatora równości.
pt_br: O nome "{0}" não está no escopo à esquerda de "equals". Considere trocar as expressões em cada lado de "equals".
ru: Имя "{0}" находится вне области левой части конструкции "equals". Возможно, требуется поменять местами выражения с обеих сторон "equals".
tr: {0}' adı, 'equals' işlecinin sol tarafındaki kapsamda değil. 'equals' işlecinin iki tarafındaki ifadeleri yer değiştirmeyi düşünün.
zh_hans: 名称“{0}”不在“equals”左侧的范围中。请考虑交换“equals”两侧的表达式。
zh_hant: 名稱 '{0}' 不在 'equals' 左側的範圍內。請考慮交換 'equals' 任一側的運算式。

# ERR_QueryInnerKey
source: The name '{0}' is not in scope on the right side of 'equals'. Consider swapping the expressions on either side of 'equals'.
cs: Název {0} není v oboru pravé strany operátoru equals. Zvažte možnost vzájemné záměny výrazů na obou stranách operátoru equals.
de: Der Name "{0}" ist auf der rechten Seite von "equals" nicht im Bereich. Vertauschen Sie die Ausdrücke auf beiden Seiten von "equals".
es: El nombre '{0}' no está dentro del ámbito en el lado derecho de 'equals'. Puede cambiar las expresiones en cualquier lado de 'equals'.
fr: Le nom '{0}' n'est pas dans la portée à droite de 'equals'. Échangez les expressions de chaque côté de 'equals'.
it: Il nome '{0}' non si trova nell'ambito a destra di 'equals'. Provare a invertire le espressioni ai lati di 'equals'.
ja: 名前 '{0}' は 'equals' の右辺のスコープにありません。'equals' の両辺の式を交換してみてください。
ko: 이름 '{0}'은(는) 'equals'의 오른쪽에 올 수 있는 범위에 속하지 않습니다. 'equals'의 양쪽에 있는 식을 서로 바꾸세요.
pl: Nazwa „{0}” jest poza zakresem prawej strony operatora równości. Rozważ zamianę wyrażeń po obu stronach operatora równości.
pt_br: O nome "{0}" não está no escopo à direita de "equals". Considere trocar as expressões em cada lado de "equals".
ru: Имя "{0}" находится вне области правой части конструкции "equals". Возможно, требуется поменять местами выражения с обеих сторон "equals".
tr: {0}' adı 'equals' öğesinin sağ tarafındaki kapsamda değil. İfadeleri 'equals' öğesinin iki tarafına değiştirmeyi düşünün.
zh_hans: 名称“{0}”不在“equals”右侧的范围中。请考虑交换“equals”两侧的表达式。
zh_hant: 名稱 '{0}' 不在 'equals' 右側的範圍內。請考慮交換 'equals' 任一側的運算式。

# ERR_QueryOutRefRangeVariable
source: Cannot pass the range variable '{0}' as an out or ref parameter
cs: Proměnnou rozsahu {0} nejde předat jako vnější nebo odkazovaný parametr.
de: Die Bereichsvariable "{0}" kann nicht als out- oder ref-Parameter übergeben werden.
es: No se puede pasar la variable de rango '{0}' como parámetro out o ref
fr: Impossible de passer la variable de portée '{0}' en tant que paramètre out ou ref
it: Non è possibile passare la variabile di intervallo '{0}' come parametro out o ref
ja: 範囲変数 '{0}' は out または ref パラメーターとして渡すことはできません
ko: 범위 변수 '{0}'을(를) out 또는 ref 매개 변수로 전달할 수 없습니다.
pl: Nie można przekazać zmiennej zakresu „{0}” jako parametru ze specyfikatorem out lub ref
pt_br: Não é possível passar a variável de intervalo "{0}" como um parâmetro out ou ref
ru: Невозможно передать переменную диапазона "{0}" как параметр с ключевыми словами out или ref.
tr: {0}' aralık değişkeni out veya ref parametresi geçemez
zh_hans: 无法作为 out 或 ref 参数传递范围变量“{0}”
zh_hant: 無法將範圍變數 '{0}' 以 out 或 ref 參數的方式傳遞

# ERR_QueryMultipleProviders
source: Multiple implementations of the query pattern were found for source type '{0}'. Ambiguous call to '{1}'.
cs: Našlo se víc implementací vzorku dotazu pro typ zdroje {0}. Nejednoznačné volání funkce {1}.
de: Für den Quelltyp "{0}" wurden mehrere Implementierungen des Abfragemusters gefunden. Mehrdeutiger Aufruf von "{1}".
es: Se encontraron varias implementaciones del patrón de consulta para el tipo de origen '{0}'. Llamada ambigua a '{1}'.
fr: Plusieurs implémentations du modèle de requête ont été trouvées pour le type source '{0}'. Appel ambigu à '{1}'.
it: Sono state trovate più implementazioni del modello di query per il tipo di origine '{0}'. Chiamata ambigua a '{1}'.
ja: ソース型 '{0}' に対してクエリ パターンの複数の実装が見つかりました。'{1}' の呼び出しがあいまいです。
ko: 소스 형식 '{0}'에 쿼리 패턴이 여러 번 구현되어 있습니다. '{1}'에 대한 호출이 모호합니다.
pl: Znaleziono wiele implementacji wzorca zapytania dla typu źródłowego „{0}”. Niejednoznaczne wywołanie elementu „{1}”.
pt_br: Várias implementações do padrão de consulta foram encontradas para o tipo de origem "{0}". Chamada ambígua para "{1}".
ru: Обнаружены повторные реализации шаблона запроса для исходного типа "{0}". Неоднозначный вызов "{1}".
tr: Sorgu kalıbının çoklu uygulamaları '{0}' kaynak türü için bulundu. Belirsiz '{1}' çağrısı.
zh_hans: 找到源类型“{0}”的多个查询模式实现。对“{1}”的调用不明确。
zh_hant: 為來源類型 '{0}' 找到多個查詢模式實作。模稜兩可的 '{1}' 呼叫。
