Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CmdOptionConflictsSource
source: Option '{0}' overrides attribute '{1}' given in a source file or added module
cs: Možnost {0} přepíše atribut {1} zadaný ve zdrojovém souboru nebo přidaném modulu.
de: Die Option "{0}" überschreibt das {1}-Attribut (in der Quelldatei oder im hinzugefügten Modul angegeben).
es: La opción '{0}' invalida el atributo '{1}' especificado en un archivo de código fuente o en un módulo agregado
fr: L'option '{0}' se substitue à l'attribut '{1}' spécifié dans un fichier source ou un module ajouté
it: L'opzione '{0}' esegue l'override dell'attributo '{1}' specificato in un file di origine o in un modulo aggiunto
ja: オプション '{0}' は、は、ソース ファイルまたは追加されたモジュールで指定された属性 '{1}' をオーバーライドします
ko: {0}' 옵션은 소스 파일 또는 추가된 모듈에 지정된 '{1}' 특성을 재정의합니다.
pl: Opcja „{0}” przesłania atrybut „{1}” podany w pliku źródłowym lub dodanym module
pt_br: Opção "{0}" substitui o atributo "{1}" fornecido em um arquivo de origem ou módulo adicionado
ru: Параметр "{0}" переопределяет атрибут "{1}", заданный в исходном файле или в добавленном модуле.
tr: {0}' seçeneği bir kaynak dosyasında veya eklenen modülde verilen '{1}' özniteliğini geçersiz kılar
zh_hans: 选项“{0}”重写源文件或添加的模块中给出的特性“{1}”
zh_hant: 選項 '{0}' 會覆寫原始程式檔或加入的模組中所指定之屬性 '{1}'

# WRN_CmdOptionConflictsSource_Title
source: Option overrides attribute given in a source file or added module
cs: Možnost přepíše atribut zadaný ve zdrojovém souboru nebo přidaném modulu.
de: Die Option überschreibt das in einer Quelldatei oder einem hinzugefügten Modul angegebene Attribut.
es: La opción reemplaza el atributo proporcionado en el archivo de origen o en el módulo añadido
fr: L'option se substitue à l'attribut spécifié dans un fichier source ou un module ajouté
it: L'opzione esegue l'override dell'attributo specificato in un file di origine o in un modulo aggiunto
ja: オプションは、ソース ファイルまたは追加されたモジュールで指定された属性をオーバーライドします
ko: 옵션은 원본 파일 또는 추가된 모듈에 지정된 특성을 재정의합니다.
pl: Opcja przesłania atrybut podany w pliku źródłowym lub dodanym module
pt_br: Esta opção substitui o atributo fornecido em um arquivo de origem ou módulo adicionado
ru: Параметр переопределяет атрибут, заданный в исходном файле или добавленном модуле
tr: Seçenek, bir kaynak dosyada veya eklenen modülde verilen özniteliği geçersiz kılar
zh_hans: 选项重写源文件或添加的模块中给出的特性
zh_hant: 選項會覆寫原始程式檔或加入的模組中所指定的屬性

# WRN_CmdOptionConflictsSource_Description
source: This warning occurs if the assembly attributes AssemblyKeyFileAttribute or AssemblyKeyNameAttribute found in source conflict with the /keyfile or /keycontainer command line option or key file name or key container specified in the Project Properties.
cs: Toto varování se objeví, pokud jsou atributy sestavení AssemblyKeyFileAttribute nebo AssemblyKeyNameAttribute nacházející se ve zdroji v konfliktu s parametrem příkazového řádku /keyfile nebo /keycontainer nebo názvem souboru klíče nebo kontejnerem klíčů zadaným ve vlastnostech projektu.
de: Diese Warnung tritt auf, wenn die in der Quelle gefundenen Assemblyattribute 'AssemblyKeyFileAttribute' oder 'AssemblyKeyNameAttribute' einen Konflikt mit der in den Projekteigenschaften angegebenen /Schlüsseldatei- oder /Schlüsselcontainer-Befehlszeilenoption, dem Schlüsseldateinamen oder Schlüsselcontainer in den Projekteigenschaften verursachen.
es: Esta advertencia se emite cuando los atributos AssemblyKeyFileAttribute o AssemblyKeyNameAttribute del ensamblador encontrados en el origen entran en conflicto con las opciones de línea de comando /keyfile o /keycontainer o con el nombre del archivo de clave o con el contenedor de claves especificados en las propiedades del proyecto.
fr: Cet avertissement survient si les attributs de l'assembly AssemblyKeyFileAttribute ou AssemblyKeyNameAttribute trouvés dans la source entrent en conflit avec l'option de ligne de commande /keyfile ou /keycontainer ou le nom de fichier clé ou le conteneur clé indiqué dans les propriétés du projet.
it: Questo avviso viene visualizzato se gli attributi di assembly AssemblyKeyFileAttribute o AssemblyKeyNameAttribute rilevati nell'origine sono in conflitto con l'opzione della riga di comando /keyfile o /keycontainer oppure con il nome del file di chiave o con il contenitore di chiavi specificato in Proprietà progetto.
ja: この警告は、ソースにあるアセンブリの属性 AssemblyKeyFileAttribute または AssemblyKeyNameAttribute が /keyfile または/keycontainer コマンド ライン オプション、キー ファイルの名前、またはプロジェクトのプロパティで指定されたキー コンテナーと競合する場合に発生します。
ko: 이 경고는 소스에 있는 AssemblyKeyFileAttribute 또는 AssemblyKeyNameAttribute 어셈블리 특성이 /keyfile 또는 /keycontainer 명령줄 옵션이나 프로젝트 속성에 지정된 키 파일 이름 또는 키 컨테이너와 충돌하는 경우에 발생합니다.
pl: To ostrzeżenie występuje, jeśli atrybut zestawu AssemblyKeyFileAttribute lub AssemblyKeyNameAttribute w źródle powoduje konflikt z opcją wiersza polecenia /keyfile lub /keycontainer albo z nazwą pliku klucza lub kontenerem określonymi we właściwościach projektu.
pt_br: Este aviso ocorre se os atributos de assembly AssemblyKeyFileAttribute ou o AssemblyKeyNameAttribute encontrados na fonte estiverem em conflito com a opção de linha de comando /keyfile ou /keycontainer ou nome do arquivo-chave ou contêiner-chave especificado nas propriedades do projeto.
ru: Это предупреждение возникает, если атрибуты сборки AssemblyKeyFileAttribute или AssemblyKeyNameAttribute в источнике конфликтуют с параметром командной строки /keyfile или /keycontainer либо с именем файла ключа или контейнером ключа, указанном в свойствах проекта.
tr: Kaynakta bulunan derleme öznitelikleri AssemblyKeyFileAttribute veya AssemblyKeyNameAttribute, Proje Özellikleri'nde belirtilen /keyfile veya /keycontainer komut satırı seçeneği veya anahtar dosya adı veya anahtar kapsayıcısı ile çakışırsa bu uyarı oluşur.
zh_hans: 如果源中出现的程序集特性 AssemblyKeyFileAttribute 或 AssemblyKeyNameAttribute 与 /keyfile 或 /keycontainer 命令行选项或是“项目属性”中指定的密钥文件名或密钥容器冲突，则会出现此警告。
zh_hant: 如果來源中所找到的組件屬性 AssemblyKeyFileAttribute 或 AssemblyKeyNameAttribute，與 [專案屬性] 中所指定的 /keyfile 或 /keycontainer 命令列選項或金鑰檔案名稱或金鑰容器衝突，則會發生此警告。

# ERR_BadCompatMode
source: Invalid option '{0}' for /langversion. Use '/langversion:?' to list supported values.
cs: Neplatný parametr {0} pro /langversion. Podporované hodnoty vypíšete pomocí /langversion:?.
de: Ungültige Option "{0}" für "/langversion". Mit "/langversion:?" können Sie eine Liste unterstützter Werte abrufen.
es: Opción "{0}" no válida para /langversion. Use "/langversion:?" para enumerar los valores admitidos.
fr: Option non valide '{0}' pour /langversion. Utilisez '/langversion:?' pour lister les valeurs prises en charge.
it: L'opzione '{0}' non è valida per /langversion. Usare '/langversion:?' per ottenere l'elenco dei valori supportati.
ja: /langversion のオプション '{0}' は無効です。サポートされている値を一覧表示するには、'/langversion:?' を使用します。
ko: {0}'은(는) /langversion의 유효한 옵션이 아닙니다. '/ langversion:?'를 사용하여 지원되는 값을 나열하세요.
pl: Nieprawidłowa opcja „{0}” dla /langversion. Użyj opcji „/langversion:?”, aby wyświetlić listę obsługiwanych wartości.
pt_br: Opção inválida '{0}' para /langversion. Use ' / langversion:?' para listar os valores com suporte.
ru: Недопустимый параметр "{0}" для /langversion. Используйте "/langversion:?" для вывода списка поддерживаемых значений.
tr: /langversion için geçersiz '{0}' seçeneği. Desteklenen değerleri listelemek için '/langversion:?' komutunu kullanın.
zh_hans: /langversion 的选项“{0}”无效。使用 "/langversion:?" 列出支持的值。
zh_hant: /langversion 的選項 '{0}' 無效。請使用 '/langversion:?' 來列出支援的值。

# ERR_DelegateOnConditional
source: Cannot create delegate with '{0}' because it or a method it overrides has a Conditional attribute
cs: Delegáta s {0} nejde vytvořit, protože ten nebo metoda, kterou přepisuje, má atribut Conditional.
de: Delegat mit "{0}" kann nicht erstellt werden, da er oder eine Methode, die er überschreibt, ein Conditional-Attribut enthält.
es: No se puede crear un delegado con '{0}' porque él mismo o un método que él invalida tiene un atributo Conditional
fr: Impossible de créer un délégué avec '{0}', car celui-ci ou une méthode qu'il remplace a un attribut Conditional
it: Non è possibile creare il delegato con '{0}' perché il delegato o un metodo di cui esegue l'override ha un attributo Conditional
ja: '{0}' またはオーバーライドされるメソッドは条件付き属性なので、この属性でデリゲートを作成できません
ko: Conditional 특성이 있으므로 '{0}'을(를) 사용하여 대리자를 만들 수 없습니다.
pl: Nie można utworzyć delegata z „{0}”, ponieważ on albo metoda, którą przesłania, ma atrybut „Conditional”
pt_br: Não é possível criar representante com "{0}" porque ele ou um método que substitui tem um atributo Conditional
ru: Не удается создать делегат с "{0}", так как он или метод, который он переопределяет, имеет атрибут Conditional.
tr: Kendisinin veya geçersiz kıldığı bir yöntemin Conditional özniteliği olduğundan '{0}' ile temsilci oluşturulamıyor
zh_hans: 无法用“{0}”创建委托，因为它或它重写的方法具有 Conditional 特性
zh_hant: 無法以 '{0}' 建立委派，因為其或其所覆寫的方法具有 Conditional 屬性

# ERR_CantMakeTempFile
source: Cannot create temporary file -- {0}
cs: Nedá se vytvořit dočasný soubor -- {0}.
de: Es kann keine temporäre Datei erstellt werden: {0}
es: No se puede crear el archivo temporal: {0}
fr: Impossible de créer le fichier temporaire -- {0}
it: Non è possibile creare il file temporaneo - {0}
ja: 一時ファイルを作成できません -- {0}
ko: 임시 파일을 만들 수 없습니다. {0}
pl: Nie można utworzyć pliku tymczasowego — {0}
pt_br: Não é possível criar arquivo temporário -- {0}
ru: Не удается создать временный файл — {0}.
tr: Geçici dosya oluşturulamıyor -- {0}
zh_hans: 无法创建临时文件 -- {0}
zh_hant: 無法建立暫存檔 -- {0}

# ERR_BadArgRef
source: Argument {0} must be passed with the '{1}' keyword
cs: Argument {0} se musí předávat s klíčovým slovem {1}.
de: Das Argument "{0}" muss mit dem Schlüsselwort "{1}" übergeben werden.
es: El argumento {0} se debe pasar con la palabra clave '{1}'
fr: L'argument {0} doit être passé avec le mot clé '{1}'
it: L'argomento {0} deve essere passato con la parola chiave '{1}'
ja: 引数 {0} はキーワード '{1}' と共に渡す必要があります
ko: {0} 인수는 '{1}' 키워드와 함께 전달해야 합니다.
pl: Argument „{0}” musi być przekazywany ze słowem kluczowym „{1}”
pt_br: Argumento {0} não deve ser transmitido com a palavra-chave "{1}"
ru: Аргумент {0} должен передаваться с ключевым словом "{1}".
tr: {0} bağımsız değişkeni '{1}' anahtar sözcüğüyle geçirilmelidir
zh_hans: 参数 {0} 必须与关键字“{1}”一起传递
zh_hant: 傳遞引數 {0} 時必須包含 '{1}' 關鍵字

# ERR_YieldInAnonMeth
source: The yield statement cannot be used inside an anonymous method or lambda expression
cs: Příkaz yield nejde používat uvnitř anonymních metod a výrazů lambda.
de: Die yield-Anweisung kann nicht in einer anonymen Methode oder einem Lambdaausdruck verwendet werden.
es: La instrucción yield no se puede usar dentro de un método anónimo o una expresión lambda
fr: L'instruction yield ne peut pas être utilisée dans une méthode anonyme ou une expression lambda
it: Non è possibile usare l'istruzione yield all'interno di un metodo anonimo o di un'espressione lambda
ja: yield ステートメントは、匿名メソッドまたはラムダ式の内部では使用できません
ko: yield 문은 무명 메서드 또는 람다 식 안에 사용할 수 없습니다.
pl: Nie można używać instrukcji yield wewnątrz metody anonimowej lub wyrażenia lambda.
pt_br: A instrução yield não pode ser usada em um método anônimo ou expressão lambda
ru: Внутри анонимного метода или лямбда-выражения нельзя использовать оператор yield.
tr: Yield deyimi bir anonim yöntemde veya lambda ifadesinde kullanılamaz
zh_hans: 不能在匿名方法或 lambda 表达式内使用 yield 语句
zh_hant: 在匿名方法或 Lambda 運算式內不可使用 yield 陳述式

# ERR_ReturnInIterator
source: Cannot return a value from an iterator. Use the yield return statement to return a value, or yield break to end the iteration.
cs: Nejde vrátit hodnotu z iterátoru. K vrácení hodnoty použijte příkaz yield return. K ukončení opakování použijte příkaz yield break.
de: Von Iteratoren kann kein Wert zurückgegeben werden. Verwenden Sie die "yield return"-Anweisung, um einen Wert zurückzugeben, oder die "yield break"-Anweisung, um die Iteration zu beenden.
es: No se puede devolver un valor a partir de un iterador. Utilice la instrucción yield return para devolver un valor o yield break para terminar la iteración.
fr: Impossible de retourner une valeur à partir d'un itérateur. Utilisez l'instruction yield return pour retourner une valeur, ou yield break pour mettre fin à l'itération.
it: Non è possibile restituire un valore da un iteratore. Usare l'istruzione yield return per restituire un valore o l'istruzione yield break per terminare l'iterazione.
ja: 反復子から値を返すことができません。yield return ステートメントを使用して値を返すか、yield break ステートメントを使用して反復子を終了してください。
ko: 반복기에서 값을 반환할 수 없습니다. yield return 문을 사용하여 값을 반환하거나 yield break 문을 사용하여 반복을 끝내세요.
pl: Nie można zwrócić wartości z iteratora. Użyj instrukcji yield return, aby zwrócić wartość, lub yield break, aby zakończyć iterację.
pt_br: Não é possível retornar um valor de um iterador. Use a instrução yield return para retornar um valor ou yield break para finalizar a iteração.
ru: Невозможно вернуть значение итератора. Используйте оператор yield return для возвращения значения или оператор yield break для окончания итерации.
tr: Bir yineleyiciden değer döndürülemez. Değer döndürmek için yield return deyimini veya yinelemeyi sonlandırmak için yield break deyimini kullanın.
zh_hans: 无法从迭代器返回值。请使用 yield return 语句返回值，或使用 yield break 语句结束迭代。
zh_hant: 無法從迭代器傳回值。請使用 yield return 陳述式傳回值，或使用 yield break 結束反覆運算。

# ERR_BadIteratorArgType
source: Iterators cannot have ref, in or out parameters
cs: U iterátorů nejde používat parametry ref, in nebo out.
de: Iteratoren dürfen keine ref-, in- oder out-Parameter aufweisen.
es: Los iteradores no pueden tener parámetros ref, in ni out
fr: Les itérateurs ne peuvent pas avoir de paramètres ref, in ou out
it: Gli iteratori non possono avere parametri in, out o ref
ja: 反復子には ref、in、out パラメーターを指定できません
ko: 반복기에는 ref, in 또는 out 매개 변수를 사용할 수 없습니다.
pl: Iteratory nie mogą mieć parametrów ref, in ani out.
pt_br: Os iteradores não podem ter parâmetros ref, in ou out
ru: Итераторы не могут иметь параметры ref, in или out
tr: Yineleyicilerin ref, in veya out parametreleri olamaz
zh_hans: 迭代器不能有 ref、in 或 out 参数
zh_hant: 迭代器不能有 ref、in 或 out 參數

# ERR_BadIteratorReturn
source: The body of '{0}' cannot be an iterator block because '{1}' is not an iterator interface type
cs: Tělo {0} nemůže být blok iterátoru, protože {1} není typ rozhraní iterátoru.
de: Der Text von "{0}" kann kein Iteratorblock sein, da "{1}" kein Iteratorschnittstellentyp ist.
es: El cuerpo de '{0}' no puede ser un bloque de iteradores porque '{1}' no es un tipo de interfaz de iteradores
fr: Le corps de '{0}' ne peut pas être un bloc itérateur, car '{1}' n'est pas un type d'interface itérateur
it: Il corpo di '{0}' non può essere un blocco iteratore perché '{1}' non è un tipo interfaccia iteratore
ja: '{1}' は反復子インターフェイス型ではないため、'{0}' の本体は反復子ブロックにできません
ko: {1}'이(가) 반복기 인터페이스 형식이 아니므로 '{0}'의 본문은 반복기 블록이 될 수 없습니다.
pl: Treść „{0}” nie może być blokiem iteratora, ponieważ „{1}” nie jest typem interfejsu iteratora
pt_br: O corpo de "{0}" não pode ser um bloco de iteradores porque "{1}" não é um tipo de interface de iterador
ru: Тело "{0}" не может быть блоком итератора, так как "{1}" не является типом интерфейса итератора.
tr: {1}' bir yineleyici arabirimi türü olmadığından '{0}' gövdesi yineleyici bloğu olamaz
zh_hans: “{1}”不是迭代器接口类型，因此“{0}”体不能是迭代器块
zh_hant: '{0}' 的主體不可是迭代區塊，因為 '{1}' 不是 Iterator 介面類型

# ERR_BadYieldInFinally
source: Cannot yield in the body of a finally clause
cs: V těle klauzule finally nejde používat příkaz yield.
de: "yield" kann nicht im Text einer finally-Klausel verwendet werden.
es: No se pueden proporcionar resultados en el cuerpo de una cláusula finally
fr: Impossible de générer dans le corps d'une clause finally
it: Impossibile eseguire la produzione nel corpo di una clausola finally
ja: finally 句の本体で生成することはできません
ko: finally 절의 본문에서는 yield를 사용할 수 없습니다.
pl: Nie można użyć instrukcji yield w treści klauzuli finally.
pt_br: Não é possível usar a instrução yield no corpo de uma cláusula finally
ru: Нельзя использовать оператор yield в теле предложения finally.
tr: Finally yan tümcesinin gövdesinden yield ile dönülemez
zh_hans: 无法在 finally 子句体中生成
zh_hant: finally 子句的主體中不可使用 yield

# ERR_BadYieldInTryOfCatch
source: Cannot yield a value in the body of a try block with a catch clause
cs: V těle bloku try s klauzulí catch nejde uvést hodnotu příkazu yield.
de: Mit "yield" kann im Text eines try-Blocks mit einer catch-Klausel kein Wert zurückgegeben werden.
es: No se puede proporcionar un valor en el cuerpo de un bloque try con una cláusula catch
fr: Impossible de générer une valeur dans le corps d'un bloc try avec une clause catch
it: Impossibile produrre un valore nel corpo di un blocco try con una clausola catch
ja: catch 句を含む try ブロックの本体で値を生成することはできません
ko: catch 절이 포함된 try 블록의 본문에서는 값을 생성할 수 없습니다.
pl: Nie można użyć instrukcji yield z wartością w treści bloku try z klauzulą catch.
pt_br: Não é possível usar a instrução yield no corpo de um bloco try com uma cláusula catch
ru: Нельзя использовать оператор yield в теле блока try, имеющего предложение catch.
tr: Catch yan tümcesi olan bir try bloğunun gövdesinde bir değer döndürülemez
zh_hans: 无法在包含 catch 子句的 Try 块体中生成值
zh_hant: 在具有 catch 子句的 try 區塊主體中不可使用 yield 產生值

# ERR_EmptyYield
source: Expression expected after yield return
cs: Po příkazu yield return se očekával výraz.
de: Ausdruck nach "yield return" erwartet.
es: Se esperaba una expresión tras la instrucción yield return
fr: Expression attendue après yield return
it: Dopo yield return è prevista l'espressione
ja: yield の戻り値の後に式が必要です
ko: yield return 다음에는 식이 필요합니다.
pl: Oczekiwano wyrażenia po instrukcji yield return
pt_br: Expressão esperada após yield return
ru: Требуется выражение после оператора yield return.
tr: Bırakma dönüşünden sonra ifade bekleniyor
zh_hans: yield return 之后应为表达式
zh_hant: yield return 之後應接著運算式

# ERR_AnonDelegateCantUse
source: Cannot use ref, out, or in parameter '{0}' inside an anonymous method, lambda expression, query expression, or local function
cs: Parametr ref, out nebo in {0} nejde použít uvnitř anonymní metody, výrazu lambda, výrazu dotazu nebo lokální funkce.
de: Der ref-, out-, oder in-Parameter "{0}" kann nicht in einer anonymen Methode, einem Lambdaausdruck, einem Abfrageausdruck oder einer lokalen Funktion verwendet werden.
es: No se puede usar el parámetro ref, out o in "{0}" dentro de un método anónimo, una expresión lambda, una expresión de consulta o una función local
fr: Impossible d'utiliser le paramètre ref, out ou in '{0}' dans une méthode anonyme, une expression lambda, une expression de requête ou une fonction locale
it: Non è possibile usare il parametro ref, out o in '{0}' all'interno di un metodo anonimo, di un'espressione lambda, di un'espressione di query o di una funzione locale
ja: ref、out、in パラメーター '{0}' は、匿名メソッド、ラムダ式、クエリ式、ローカル関数の内部では使用できません
ko: 무명 메서드, 람다 식, 쿼리 식 또는 로컬 함수 안에서는 ref, out 또는 in 매개 변수 '{0}'을(를) 사용할 수 없습니다.
pl: Nie można użyć parametru ref, out ani in „{0}” wewnątrz metody anonimowej, wyrażenia lambda, wyrażenia zapytania lub funkcji lokalnej
pt_br: Não é possível usar os parâmetro ref, out ou in '{0}' dentro de um método anônimo, de uma expressão lambda de uma expressão de consulta ou de uma função local
ru: Недопустимо использовать параметр "{0}" с модификаторами ref, out или in внутри анонимного метода, лямбда-выражения, выражения запроса или локальной функции
tr: Anonim metot, lambda ifadesi, sorgu ifadesi veya yerel işlev içinde '{0}' ref, out veya in parametresi kullanılamaz
zh_hans: 不能在匿名方法、lambda 表达式、查询表达式或本地函数中使用 ref、out 或 in 参数“{0}”
zh_hant: 無法在匿名方法、Lambda 運算式、查詢運算式或區域函式中使用 ref、out 或 in 參數 '{0}'

# ERR_BadYieldInCatch
source: Cannot yield a value in the body of a catch clause
cs: V těle klauzule catch nejde použít hodnotu získanou příkazem yield.
de: Mit "yield" kann im Text einer catch-Klausel kein Wert zurückgegeben werden.
es: No se puede proporcionar ningún valor en el cuerpo de una cláusula catch
fr: Impossible de générer une valeur dans le corps d'une clause catch
it: Impossibile produrre un valore nel corpo di una clausola catch
ja: catch 句の本体で値を生成することはできません
ko: catch 절 본문에서는 값을 생성할 수 없습니다.
pl: Nie można użyć instrukcji yield z wartością w treści klauzuli catch.
pt_br: Não é possível usar a instrução yield no corpo de uma cláusula catch
ru: Нельзя использовать оператор yield в теле предложения catch.
tr: Catch yan tümcesinin gövdesinde yield ile bir değer döndürülemez
zh_hans: 无法在 catch 子句体中生成值
zh_hant: 無法在 catch 子句主體中使用 yield 產生值

# ERR_BadDelegateLeave
source: Control cannot leave the body of an anonymous method or lambda expression
cs: Ovládací prvek nemůže opustit tělo anonymní metody nebo výrazu lambda.
de: Ein Steuerelement kann den Text einer anonymen Methode oder eines Lambdaausdrucks nicht verlassen.
es: El control no puede abandonar el cuerpo de un método anónimo o de una expresión lambda
fr: Le contrôle ne peut pas quitter le corps d'une méthode anonyme ou d'une expression lambda
it: Il controllo non può lasciare il corpo di un metodo anonimo o di un'espressione lambda
ja: コントロールを匿名メソッドまたはラムダ式の本体外に出すことはできません
ko: 제어가 무명 메서드 또는 람다 식의 본문을 벗어날 수 없습니다.
pl: Kontrolka nie może opuścić tekstu metody anonimowej lub wyrażenia lambda.
pt_br: O controle não pode sair do corpo de um método anônimo ou expressão lambda
ru: Невозможно передать управление из тела анонимного метода или лямбда-выражения.
tr: Denetim, anonim bir yöntemin veya bir lambda ifadesinin gövdesinden çıkamaz
zh_hans: 控制不能离开匿名方法体或 lambda 表达式体
zh_hant: 程式控制權不能從匿名方法或 Lambda 運算式的主體離開

# WRN_IllegalPragma
source: Unrecognized #pragma directive
cs: Nerozpoznaná direktiva #pragma
de: Unbekannte #pragma-Direktive.
es: Directiva #pragma no reconocida
fr: Directive #pragma non reconnue
it: La direttiva #pragma non è stata riconosciuta
ja: 認識できない #pragma ディレクティブです
ko: 인식할 수 없는 #pragma 지시문입니다.
pl: Nierozpoznana dyrektywa #pragma
pt_br: Diretiva #pragma não reconhecida
ru: Нераспознанная директива #pragma
tr: Tanınmayan #pragma yönergesi
zh_hans: 无法识别的 #pragma 指令
zh_hant: 無法辨認的 #pragma 指示詞

# WRN_IllegalPragma_Title
source: Unrecognized #pragma directive
cs: Nerozpoznaná direktiva #pragma
de: Unbekannte #pragma-Direktive.
es: Directiva #pragma no reconocida
fr: Directive #pragma non reconnue
it: La direttiva #pragma non è stata riconosciuta
ja: 認識できない #pragma ディレクティブです
ko: 인식할 수 없는 #pragma 지시문입니다.
pl: Nierozpoznana dyrektywa #pragma
pt_br: Diretiva #pragma não reconhecida
ru: Нераспознанная директива #pragma
tr: Tanınmayan #pragma yönergesi
zh_hans: 无法识别的 #pragma 指令
zh_hant: 無法辨認的 #pragma 指示詞

# WRN_IllegalPPWarning
source: Expected 'disable' or 'restore'
cs: Očekávala se hodnota disable nebo restore.
de: "disable" oder "restore" erwartet.
es: Se esperaba "disable" o "restore"
fr: 'disable' ou 'restore' attendu
it: È previsto 'disable' o 'restore'
ja: 'disable' または 'restore' を指定してください
ko: 'disable' 또는 'restore'가 필요합니다.
pl: Oczekiwano elementu „disable” lub „restore”
pt_br: 'disable' ou 'restore' esperado
ru: Ожидается "disable" или "restore"
tr: Beklenen: 'disable' veya 'restore'
zh_hans: 应为 disable 或 restore
zh_hant: 應為 'disable' 或 'restore'
