Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoMainOnDLL
source: Cannot specify /main if building a module or library
cs: Při vytváření modulu nebo knihovny nejde použít přepínač /main.
de: /main kann beim Erstellen eines Moduls oder einer Bibliothek nicht angegeben werden.
es: No se puede especificar /main si se compila un módulo o una biblioteca
fr: Impossible de spécifier /main en cas de génération d'un module ou d'une bibliothèque
it: Non è possibile specificare /main se si compila un modulo o una libreria
ja: モジュールまたはライブラリをビルドする場合は /main を指定できません
ko: 모듈이나 라이브러리를 빌드하고 있으면 /main을 지정할 수 없습니다.
pl: W czasie kompilowania modułu lub biblioteki nie można określić opcji /main
pt_br: Não é possível especificar /main se criar um módulo ou uma biblioteca
ru: Не допускается указывать /main при сборке модуля или библиотеки.
tr: Modül veya kitaplık oluşturuluyorsa /main belirtilemez
zh_hans: 如果生成模块或库，则无法指定 /main
zh_hant: 在建置模組或程式庫時不能指定 /main

# FTL_InvalidTarget
source: Invalid target type for /target: must specify 'exe', 'winexe', 'library', or 'module'
cs: Neplatný typ cíle pro parametr /target: Je nutné použít možnost exe, winexe, library nebo module.
de: Ungültiger Zieltyp für /target: Sie müssen "exe", "winexe", "library", oder "module" angeben.
es: Tipo de destino no válido para /target: se debe especificar 'exe', 'winexe', 'library' o 'module'
fr: Type de cible non valide pour /target : vous devez spécifier 'exe', 'winexe', 'library' ou 'module'
it: Il tipo di destinazione non è valido per /target. È necessario specificare 'exe', 'winexe', 'library' o 'module'
ja: /target のターゲット型が無効です。'exe'、'winexe'、'library'、または 'module' のいずれかを指定してください
ko: 잘못된 /target의 대상 형식입니다. 'exe', 'winexe', 'library' 또는 'module'을 지정해야 합니다.
pl: Nieprawidłowy typ elementu docelowego dla opcji /target: musisz podać typ „exe”, „winexe”, „library” lub „module”
pt_br: Tipo de destino inválido para /target: deve especificar "exe", "winexe", "library" ou "module"
ru: Недопустимый тип результата для /target: необходимо указать "exe", "winexe", "library" или "module"
tr: /target için geçersiz hedef türü: 'exe', 'winexe', 'library' veya 'module' belirtilmelidir
zh_hans: /target 的目标类型无效: 必须指定“exe”、“winexe”、“library”或“module”
zh_hant: /target: 的目標類型無效。必須指定 'exe'、'winexe'、'library' 或 'module'

# WRN_NoConfigNotOnCommandLine
source: Ignoring /noconfig option because it was specified in a response file
cs: Přepínač /noconfig se ignoroval, protože byl uvedený v souboru odpovědí.
de: Die /noconfig-Option wird ignoriert, da sie in einer Antwortdatei angegeben wurde.
es: Omitiendo la opción /noconfig porque se especificó en un archivo de respuesta
fr: Option /noconfig ignorée, car elle était spécifiée dans un fichier réponse
it: L'opzione /noconfig è stata ignorata perché è stata specificata in un file di risposta
ja: 応答ファイルで指定されているため、/noconfig オプションを無視します
ko: 지시 파일에 지정되었기 때문에 /noconfig 옵션을 무시합니다.
pl: Opcja /noconfig zostanie zignorowana, ponieważ została określona w pliku odpowiedzi
pt_br: Ignorando a opção /noconfig porque ela foi especificada em um arquivo de resposta
ru: Параметр /noconfig пропущен, т. к. он задан в файле ответов
tr: Bir yanıt dosyası içinde belirtildiğinden /noconfig seçeneği yoksayılıyor
zh_hans: /noconfig 选项是在响应文件中指定的，因此被忽略
zh_hant: 因為在回應檔中已指定 /noconfig 選項，所以將會忽略該選項

# WRN_NoConfigNotOnCommandLine_Title
source: Ignoring /noconfig option because it was specified in a response file
cs: Přepínač /noconfig se ignoroval, protože byl uvedený v souboru odpovědí.
de: Die /noconfig-Option wird ignoriert, da sie in einer Antwortdatei angegeben wurde.
es: Omitiendo la opción /noconfig porque se especificó en un archivo de respuesta
fr: Option /noconfig ignorée, car elle était spécifiée dans un fichier réponse
it: L'opzione /noconfig è stata ignorata perché è stata specificata in un file di risposta
ja: 応答ファイルで指定されているため、/noconfig オプションを無視します
ko: 지시 파일에 지정되었기 때문에 /noconfig 옵션을 무시합니다.
pl: Opcja /noconfig zostanie zignorowana, ponieważ została określona w pliku odpowiedzi
pt_br: Ignorando a opção /noconfig porque ela foi especificada em um arquivo de resposta
ru: Параметр /noconfig пропущен, т. к. он задан в файле ответов
tr: Bir yanıt dosyası içinde belirtildiğinden /noconfig seçeneği yoksayılıyor
zh_hans: /noconfig 选项是在响应文件中指定的，因此被忽略
zh_hant: 因為在回應檔中已指定 /noconfig 選項，所以將會忽略該選項

# ERR_InvalidFileAlignment
source: Invalid file section alignment '{0}'
cs: Neplatný argument výběru souboru {0}
de: Ungültige Dateiabschnittausrichtung "{0}"
es: Alineación de sección de archivo no válida "{0}"
fr: Alignement de section de fichier non valide '{0}'
it: L'allineamento '{0}' della sezione del file non è valido
ja: '{0}' は無効なファイル セクションの配置です
ko: 잘못된 파일 섹션 맞춤 '{0}'
pl: Nieprawidłowe wyrównanie sekcji pliku „{0}”
pt_br: Alinhamento de seção de arquivo inválido '{0}'
ru: Недопустимое выравнивание разделов файла "{0}"
tr: Geçersiz dosya bölümü hizalaması '{0}'
zh_hans: 无效的文件节对齐方式“{0}”
zh_hant: 無效的檔案區段記憶體對齊 '{0}'

# ERR_InvalidOutputName
source: Invalid output name: {0}
cs: Neplatný název výstupu: {0}
de: Ungültiger Ausgabename: {0}
es: Nombre de archivo salida no válido: {0}
fr: Nom de sortie non valide : {0}
it: Nome di output non valido: {0}
ja: 無効な出力名: {0}
ko: 잘못된 출력 이름: {0}
pl: Nieprawidłowa nazwa wyjścia: {0}
pt_br: Nome de saída inválido: {0}
ru: Недопустимое имя выходных данных: {0}
tr: Geçersiz çıkış adı: {0}
zh_hans: 无效输出名: {0}
zh_hant: 無效的輸出名稱: {0}

# ERR_InvalidDebugInformationFormat
source: Invalid debug information format: {0}
cs: Neplatný formát informací o ladění: {0}
de: Ungültiges Format für Debuginformationen: {0}
es: Formato de la información de depuración no válido: {0}
fr: Format des informations de débogage non valide : {0}
it: Formato delle informazioni di debug non valido: {0}
ja: 無効なデバッグ情報の形式: {0}
ko: 잘못된 디버그 정보 형식: {0}
pl: Nieprawidłowy format informacji debugowania: {0}
pt_br: Formato de informações de depuração inválidas: {0}
ru: Недопустимый формат отладочной информации: {0}
tr: Geçersiz hata ayıklama bilgisi biçimi: {0}
zh_hans: 无效的调试信息格式: {0}
zh_hant: 無效的偵錯資訊格式: {0}

# ERR_LegacyObjectIdSyntax
source: 'id#' syntax is no longer supported. Use '$id' instead.
cs: 'Syntaxe id# už není podporovaná. Použijte místo ní syntaxi $id.
de: 'Syntax "id#" wird nicht mehr unterstützt. Verwenden Sie stattdessen "$id".
es: 'Ya no se admite la sintaxis 'id#'. En su lugar, use '$id'.
fr: 'La syntaxe 'id#' n'est plus prise en charge. Utilisez '$id' à la place.
it: 'La sintassi 'id#' non è più supportata. Usare '$id'.
ja: 'id#' 構文はサポートされなくなりました。'$id' を使用してください。
ko: 'id#' 구문은 더 이상 지원되지 않습니다. '$id'를 대신 사용하세요.
pl: 'Składnia „id#” nie jest już używana. Zamiast niej użyj składni „$id”.
pt_br: 'A sintaxe de 'id#' não tem mais suporte. Use '$id'.
ru: 'Синтаксис "id#" больше не поддерживается. Вместо этого используйте "$id".
tr: 'id#' sözdizimi artık desteklenmiyor. Bunun yerine '$id' kullanın.
zh_hans: '不再支持 "id #" 语法。应使用 "$id"。
zh_hant: '不再支援 'id#' 語法。請改用 '$id'。

# WRN_DefineIdentifierRequired
source: Invalid name for a preprocessing symbol; '{0}' is not a valid identifier
cs: Neplatný název pro symbol předzpracování; {0} není platný identifikátor.
de: Ungültiger Name für ein Vorverarbeitungssymbol; "{0}" ist kein gültiger Bezeichner.
es: Nombre no válido para un símbolo de preprocesamiento; "{0}" no es un identificador válido
fr: Nom non valide pour un symbole de prétraitement. '{0}' est un identificateur non valide
it: Nome non valido per un simbolo di pre-elaborazione. '{0}' non è un identificatore valido
ja: 前処理シンボルの名前が無効です。'{0}' は有効な識別子ではありません
ko: 전처리 기호의 이름이 잘못되었습니다. '{0}'은(는) 유효한 식별자가 아닙니다.
pl: Nieprawidłowa nazwa symbolu przetwarzania wstępnego; „{0}” nie jest prawidłowym identyfikatorem
pt_br: Nome inválido para um símbolo de pré-processamento. '{0}' não é um identificador válido
ru: Недопустимое имя символа предварительной обработки. "{0}" не является допустимым идентификатором.
tr: Bir ön işleme sembolünün adı geçersiz; '{0}' geçerli bir tanımlayıcı değil
zh_hans: 预处理符号的名称无效；“{0}”不是有效的标识符
zh_hant: 前置處理符號的名稱無效; '{0}' 不是有效的識別碼

# WRN_DefineIdentifierRequired_Title
source: Invalid name for a preprocessing symbol; not a valid identifier
cs: Neplatný název pro symbol předzpracování; neplatný identifikátor
de: Ungültiger Name für ein Vorverarbeitungssymbol; kein gültiger Bezeichner
es: Nombre no válido para un símbolo de preprocesamiento; no es un identificador válido
fr: Nom non valide pour un symbole de prétraitement. Identificateur non valide
it: Nome non valido per un simbolo di pre-elaborazione. Non è un identificatore valido
ja: 前処理シンボルの名前が無効です。有効な識別子ではありません
ko: 전처리 기호의 이름이 잘못되었습니다. 유효한 식별자가 아닙니다.
pl: Nieprawidłowa nazwa symbolu przetwarzania wstępnego; nie jest prawidłowym identyfikatorem
pt_br: Nome inválido para um símbolo de pré-processamento; ele não é um identificador válido
ru: Недопустимое имя символа предварительной обработки; недопустимый идентификатор
tr: Bir ön işleme sembolünün adı geçersiz; geçerli bir tanımlayıcı değil
zh_hans: 预处理符号的名称无效；不是有效的标识符
zh_hant: 前置處理符號的名稱無效; 不是有效的識別碼

# FTL_OutputFileExists
source: Cannot create short filename '{0}' when a long filename with the same short filename already exists
cs: Nejde vytvořit krátký název souboru {0}, protože už existuje dlouhý název souboru se stejným krátkým názvem.
de: Der kurze Dateiname "{0}" kann nicht erstellt werden, wenn bereits ein langer Dateiname mit dem gleichen kurzen Dateinamen vorhanden ist.
es: No se puede crear el nombre de archivo corto '{0}' cuando ya existe un nombre de archivo largo con el mismo nombre de archivo corto
fr: Impossible de créer le nom de fichier court '{0}', car il existe déjà un nom de fichier long avec ce même nom de fichier court
it: Non è possibile creare il nome di file breve '{0}' se esiste già un nome di file lungo con lo stesso nome di file breve
ja: 同じ短いファイル名を使用している長いファイル名が既に存在するとき、短いファイル名 '{0}' を作成することはできません
ko: 약식 파일 이름이 같은 긴 파일 이름이 이미 있으면 '{0}' 약식 파일 이름을 만들 수 없습니다.
pl: Nie można utworzyć krótkiej nazwy pliku „{0}”, jeśli już istnieje długa nazwa pliku, której krótka wersja jest taka sama
pt_br: Não é possível criar nome de arquivo curto "{0}" quando já existe um nome de arquivo longo com o mesmo nome de arquivo curto
ru: Невозможно создать короткое имя файла "{0}", если уже существует длинное имя файла, содержащее это короткое имя.
tr: Aynı kısa dosya adı ile uzun bir dosya adı zaten varken '{0}' kısa dosya adı oluşturulamaz
zh_hans: 包含短文件名“{0}”的长文件名已存在，无法创建同名短文件名
zh_hant: 無法建立短的檔名 '{0}'，因為已有長檔名的名稱和該短檔名相同

# ERR_OneAliasPerReference
source: A /reference option that declares an extern alias can only have one filename. To specify multiple aliases or filenames, use multiple /reference options.
cs: Parametr /reference deklarující externí alias může mít jenom jeden název souboru. Pokud chcete zadat víc aliasů nebo názvů souborů, použijte více parametrů /reference.
de: Eine /reference-Option, die einen externen Alias deklariert, kann nur einen Dateinamen haben. Um mehrere Aliase oder Dateinamen festzulegen, verwenden Sie mehrere /reference-Optionen.
es: Una opción /reference que declara un alias externo solo puede tener un nombre de archivo. Para especificar varios alias o nombres de archivo, utilice varias opciones /reference.
fr: Une option /reference qui déclare un alias extern ne peut avoir qu'un seul nom de fichier. Pour spécifier plusieurs alias ou noms de fichiers, utilisez plusieurs options /reference.
it: Un'opzione /reference che dichiara un alias extern può avere un solo nome di file. Per specificare più alias o nomi di file, utilizzare più opzioni /reference.
ja: extern エイリアスを宣言する /reference オプションにはファイル名が 1 つだけ指定できます。複数のエイリアスまたはファイル名を指定するには、複数の /reference オプションを使用してください。
ko: extern 별칭을 선언하는 /reference 옵션에는 파일 이름을 하나만 지정할 수 있습니다. 여러 별칭 또는 파일 이름을 지정하려면 /reference 옵션을 여러 개 사용하세요.
pl: Opcja /reference, która deklaruje alias zewnętrzny, może mieć tylko jedną nazwę pliku. Aby określić wiele aliasów lub nazw plików, użyj wielu opcji /reference.
pt_br: Uma opção /reference que declara um alias externo só pode ter um nome de arquivo. Para especificar vários aliases ou nomes de arquivo, use várias opções /reference.
ru: В параметре /reference, объявляющем внешний псевдоним, можно задать только одно имя файла. Чтобы задать несколько псевдонимов или имен файлов, следует использовать несколько параметров /reference.
tr: Bir extern diğer adı bildiren /reference seçeneğinde yalnızca bir dosya adı olabilir. Birden fazla diğer ad veya dosya adı belirtmek için birden fazla /reference seçeneği kullanın.
zh_hans: 一个声明外部别名的 /reference 选项只能有一个文件名。要指定多个别名或文件名，请使用多个 /reference 选项。
zh_hant: 宣告外部別名的 /reference 選項只能有一個檔名。若要指定多個別名或檔名，請用多個 /reference 選項。

# ERR_SwitchNeedsNumber
source: Command-line syntax error: Missing ':<number>' for '{0}' option
cs: Chyba syntaxe příkazového řádku: Nenašla se hodnota :<číslo> parametru {0}.
de: Befehlszeilen-Syntaxfehler: In der Option "{0}" fehlt ":< Nummer>".
es: Error de sintaxis de línea de comandos: falta ':<número>' para la opción '{0}'
fr: Erreur de syntaxe de ligne de commande : ':<numéro>' manquant pour l'option '{0}'
it: Errore nella sintassi della riga di comando: manca ':<numero>' per l'opzione '{0}'
ja: コマンドラインの構文エラー: オプション '{0}' の ':<number>' がありません
ko: 명령줄 구문 오류: '{0}' 옵션에 대한 ':<number>'이(가) 없습니다.
pl: Błąd składni wiersza polecenia: brak elementu „:<liczba>” dla opcji „{0}”
pt_br: Erro de sintaxe de linha de comando: ":<number>" ausente para a opção "{0}"
ru: Ошибка в синтаксисе командной строки: Отсутствует ":<номер>" для параметра "{0}".
tr: Komut satırı sözdizimi hatası: '{0}' seçeneği için ':<number>' eksik
zh_hans: 命令行语法错误:“{0}”选项缺少“:<number>”
zh_hant: 命令列語法錯誤: 遺漏 '{0}' 選項的 ':<number>'

# ERR_MissingDebugSwitch
source: The /pdb option requires that the /debug option also be used
cs: Možnost /pdb vyžaduje taky použití možnosti /debug .
de: Bei Verwendung der /pdb-Option muss auch die /debug-Option verwendet werden.
es: La opción /pdb requiere que se use también la opción /debug
fr: L'option /pdb exige que l'option /debug soit également utilisée
it: L'opzione /pdb richiede che venga specificata anche l'opzione /debug
ja: /pdb オプションでは、/debug オプションも使用する必要があります
ko: /pdb 옵션은 /debug 옵션과 함께 사용해야 합니다.
pl: Opcja /pdb wymaga również użycia opcji /debug
pt_br: A opção /pdb requer que a opção /debug também seja usada
ru: Параметр /pdb требует использования параметра /debug.
tr: /pdb seçeneği /debug seçeneğinin de kullanılmasını gerektirir
zh_hans: 要使用 /pdb 选项，必须同时使用 /debug 选项
zh_hant: /pdb 選項需要同時使用 /debug 選項

# ERR_ComRefCallInExpressionTree
source: An expression tree lambda may not contain a COM call with ref omitted on arguments
cs: Strom výrazu lambda nesmí obsahovat volání COM, které v argumentech vynechává parametr Ref.
de: Ein Ausdrucksbaumstruktur-Lambda darf keinen COM-Aufruf enthalten, in dem "ref" für Argumente ausgelassen wurde.
es: Una expresión lambda de árbol de expresión no puede contener una llamada COM con ref omitido en argumentos
fr: Une arborescence d'expression lambda ne peut pas contenir un appel COM avec des arguments où ref a été omis
it: Un'espressione lambda dell'albero delle espressioni non può contenere una chiamata COM con argomenti privi di ref
ja: 式ツリーのラムダには、引数で ref を省略した COM 呼び出しを含めることはできません
ko: 람다 식 트리에는 인수에서 ref가 생략된 COM 호출을 포함할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać wywołania modelu COM z pominiętym parametrem ref przy argumentach
pt_br: Uma árvore de expressão da expressão lambda não pode conter uma chamada COM com a omissão de ref nos argumentos
ru: Дерево лямбда-выражения не может содержать вызов COM с пропущенным аргументом ref.
tr: İfade ağacı lambdası, bağımsız değişkenlerinde ref kullanılmayan bir COM çağrısı içeremez
zh_hans: 表达式树 lambda 不能包含参数中省略 ref 的 COM 调用
zh_hant: 運算式樹狀架構 Lambda 不可包含引數上省略 ref 的 COM 呼叫

# ERR_InvalidFormatForGuidForOption
source: Command-line syntax error: Invalid Guid format '{0}' for option '{1}'
cs: Chyba syntaxe příkazového řádku: Neplatný formát GUID {0} pro možnost {1}
de: Befehlszeilen-Syntaxfehler: Ungültiges GUID-Format "{0}" für die Option "{1}".
es: Error de sintaxis de línea de comandos: formato de GUID '{0}' no válido para la opción '{1}'
fr: Erreur de syntaxe de ligne de commande : format de Guid '{0}' non valide pour l'option '{1}'
it: Errore nella sintassi della riga di comando: il formato del GUID '{0}' non è valido per l'opzione '{1}'
ja: コマンドラインの構文エラー: オプション '{1}' の GUID 形式 '{0}' が無効です
ko: 명령줄 구문 오류: '{1}' 옵션에 대해 잘못된 '{0}' Guid 형식입니다.
pl: Błąd składni wiersza polecenia: nieprawidłowy format identyfikatora GUID „{0}” dla opcji „{1}”
pt_br: Erro de sintaxe de linha de comando: Formato de Guid inválido "{0}" para a opção "{1}"
ru: Ошибка в синтаксисе командной строки: Недопустимый формат Guid "{0}" для параметра "{1}".
tr: Komut satırı sözdizimi hatası: '{1}' seçeneği için geçersiz Guid biçimi '{0}'
zh_hans: 命令行语法错误: Guid 格式“{0}”对于选项“{1}”无效
zh_hant: 命令列語法錯誤: 選項 '{1}' 的 Guid 格式 '{0}' 無效

# ERR_MissingGuidForOption
source: Command-line syntax error: Missing Guid for option '{1}'
cs: Chyba syntaxe příkazového řádku: Chybí GUID pro možnost {1}.
de: Befehlszeilen-Syntaxfehler: Fehlende GUID für Option "{1}".
es: Error de sintaxis de línea de comandos: falta el GUID para la opción '{1}'
fr: Erreur de syntaxe de ligne de commande : Guid manquant pour l'option '{1}'
it: Errore nella sintassi della riga di comando: manca il GUID per l'opzione '{1}'
ja: コマンドラインの構文エラー: オプション '{1}' の GUID がありません
ko: 명령줄 구문 오류: '{1}' 옵션에 대한 Guid가 없습니다.
pl: Błąd składni wiersza polecenia: brak identyfikatora Guid dla opcji „{1}”
pt_br: Erro de sintaxe de linha de comando: falta Guid para a opção "{1}"
ru: Ошибка в синтаксисе командной строки: Отсутствует Guid для параметра "{1}".
tr: Komut satırı sözdizimi hatası: '{1}' seçeneği için Guid eksik
zh_hans: 命令行语法错误: 选项“{1}”缺少 Guid
zh_hant: 命令列語法錯誤: 遺漏選項 '{1}' 的 Guid

# WRN_CLS_NoVarArgs
source: Methods with variable arguments are not CLS-compliant
cs: Metody s proměnnými argumenty nejsou kompatibilní se specifikací CLS.
de: Methoden mit Variablenargumenten sind nicht CLS-kompatibel.
es: Los métodos con argumentos de variable no son conformes a CLS
fr: Les méthodes qui possèdent des arguments de variables ne sont pas conformes CLS
it: I metodi con argomenti variabili non sono conformi alle specifiche CLS
ja: 可変個の引数を持つメソッドは CLS に準拠していません
ko: 가변 인수가 있는 메서드가 CLS 규격이 아닙니다.
pl: Metody ze zmiennymi argumentami nie są zgodne ze specyfikacją CLS
pt_br: Métodos com argumentos de variável não estão em conformidade com CLS
ru: Методы с переменным числом аргументов не совместимы с требованиями CLS.
tr: Değişken sayıda bağımsız değişken içeren yöntemler CLS uyumlu değildir
zh_hans: 带有变量参数的方法不符合 CLS
zh_hant: 具有變數引數的方法不符合 CLS 規範

# WRN_CLS_NoVarArgs_Title
source: Methods with variable arguments are not CLS-compliant
cs: Metody s proměnnými argumenty nejsou kompatibilní se specifikací CLS.
de: Methoden mit Variablenargumenten sind nicht CLS-kompatibel.
es: Los métodos con argumentos de variable no son conformes a CLS
fr: Les méthodes qui possèdent des arguments de variables ne sont pas conformes CLS
it: I metodi con argomenti variabili non sono conformi alle specifiche CLS
ja: 可変個の引数を持つメソッドは CLS に準拠していません
ko: 가변 인수가 있는 메서드가 CLS 규격이 아닙니다.
pl: Metody ze zmiennymi argumentami nie są zgodne ze specyfikacją CLS
pt_br: Métodos com argumentos de variável não estão em conformidade com CLS
ru: Методы с переменным числом аргументов не совместимы с требованиями CLS.
tr: Değişken sayıda bağımsız değişken içeren yöntemler CLS uyumlu değildir
zh_hans: 带有变量参数的方法不符合 CLS
zh_hant: 具有變數引數的方法不符合 CLS 規範

# WRN_CLS_BadArgType
source: Argument type '{0}' is not CLS-compliant
cs: Typ argumentu {0} není kompatibilní se specifikací CLS.
de: Argumenttyp "{0}" ist nicht CLS-kompatibel.
es: El tipo de argumento '{0}' no es conforme a CLS
fr: Le type d'argument '{0}' n'est pas conforme CLS
it: Il tipo dell'argomento '{0}' non è conforme a CLS
ja: 引数型 '{0}' は CLS に準拠していません
ko: {0}' 인수 형식이 CLS 규격이 아닙니다.
pl: Typ argumentu „{0}” nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de argumento "{0}" não tem conformidade com CLS
ru: Аргумент типа "{0}" несовместим с CLS.
tr: {0}' bağımsız değişken türü CLS uyumlu değil
zh_hans: 参数类型“{0}”不符合 CLS
zh_hant: 引數類型 '{0}' 不符合 CLS 規範

# WRN_CLS_BadArgType_Title
source: Argument type is not CLS-compliant
cs: Typ argumentu není kompatibilní se specifikací CLS.
de: Argumenttyp ist nicht CLS-kompatibel
es: El tipo de argumento no es conforme a CLS
fr: Le type d'argument n'est pas conforme CLS
it: Il tipo dell'argomento non è conforme a CLS
ja: 引数型は CLS に準拠していません
ko: 인수 형식이 CLS 규격이 아닙니다.
pl: Typ argumentu nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de argumento não tem conformidade com CLS
ru: Тип аргумента несовместим с CLS
tr: Bağımsız değişken türü CLS uyumlu değil
zh_hans: 参数类型不符合 CLS
zh_hant: 引數類型不符合 CLS 規範

# WRN_CLS_BadReturnType
source: Return type of '{0}' is not CLS-compliant
cs: Typ vrácené hodnoty {0} není kompatibilní se specifikací CLS.
de: Der Rückgabetyp von "{0}" ist nicht CLS-kompatibel.
es: El tipo de valor devuelto de '{0}' no es conforme a CLS
fr: Le type de retour de '{0}' n'est pas conforme CLS
it: Il tipo restituito di '{0}' non è conforme a CLS
ja: '{0}' の戻り値の型は CLS に準拠していません
ko: {0}'의 반환 형식이 CLS 규격이 아닙니다.
pl: Zwracany typ „{0}” nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de retorno de "{0}" não tem conformidade com CLS
ru: Тип возвращаемого значения "{0}" несовместим с CLS.
tr: {0}' dönüş türü CLS uyumlu değil
zh_hans: “{0}”的返回类型不符合 CLS
zh_hant: '{0}' 的傳回類型不符合 CLS 規範

# WRN_CLS_BadReturnType_Title
source: Return type is not CLS-compliant
cs: Návratový typ není kompatibilní se specifikací CLS.
de: Rückgabetyp ist nicht CLS-kompatibel
es: El tipo de retorno no es conforme a CLS
fr: Le type de retour n'est pas conforme CLS
it: Il tipo restituito non è conforme a CLS
ja: 戻り値の型は CLS に準拠していません
ko: 반환 형식이 CLS 규격이 아닙니다.
pl: Typ zwracany nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de retorno não tem conformidade com CLS
ru: Тип возвращаемого значения несовместим с CLS
tr: Döndürme türü CLS uyumlu değil
zh_hans: 返回类型不符合 CLS
zh_hant: 傳回類型不符合 CLS 規範

# WRN_CLS_BadFieldPropType
source: Type of '{0}' is not CLS-compliant
cs: Typ {0} není kompatibilní se specifikací CLS.
de: Der Typ von "{0}" ist nicht CLS-kompatibel.
es: El tipo de '{0}' no es conforme a CLS
fr: Le type de '{0}' n'est pas conforme CLS
it: Il tipo '{0}' non è conforme a CLS
ja: '{0}' の型は CLS に準拠していません
ko: {0}' 형식이 CLS 규격이 아닙니다.
pl: Typ elementu „{0}” nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de "{0}" não tem conformidade com CLS
ru: Тип ограничения "{0}" несовместим с CLS.
tr: {0}' türü CLS uyumlu değil
zh_hans: “{0}”的类型不符合 CLS
zh_hant: '{0}' 的類型不符合 CLS 規範

# WRN_CLS_BadFieldPropType_Title
source: Type is not CLS-compliant
cs: Typ není kompatibilní se specifikací CLS.
de: Typ ist nicht CLS-kompatibel
es: El tipo no es conforme a CLS
fr: Le type n’est pas conforme CLS
it: Il tipo non è conforme a CLS
ja: 型が CLS に準拠していません
ko: 형식이 CLS 규격이 아닙니다.
pl: Typ nie jest zgodny ze specyfikacją CLS
pt_br: Tipo tem conformidade com CLS
ru: Тип несовместим с CLS
tr: Tür CLS uyumlu değil
zh_hans: 类型不符合 CLS
zh_hant: 類型不符合 CLS 規範
