Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_QueryTypeInferenceFailedMulti
source: The type of one of the expressions in the {0} clause is incorrect. Type inference failed in the call to '{1}'.
cs: Typ jednoho z výrazů v klauzuli {0} je nesprávný. Nepovedlo se odvození typu při volání funkce {1}.
de: Der Typ eines Ausdrucks in der {0}-Klausel ist falsch. Fehler beim Typrückschluss im Aufruf von "{1}".
es: El tipo de una de las expresiones de la cláusula {0} es incorrecto. No se pudo realizar la inferencia de tipos en la llamada a '{1}'.
fr: Le type de l'une des expressions dans la clause {0} est incorrect. L'inférence de type a échoué dans l'appel à '{1}'.
it: Il tipo di una delle espressioni nella clausola {0} non è corretto. L'inferenza del tipo non è riuscita nella chiamata a '{1}'.
ja: {0} 句のいずれかの式の型が正しくありません。'{1}' の呼び出しで型を推論できませんでした。
ko: {0} 절에 있는 식 중 하나의 형식이 잘못되었습니다. '{1}'에 대한 호출에서 형식을 유추하지 못했습니다.
pl: Typ jednego z wyrażeń w klauzuli {0} jest nieprawidłowy. Wnioskowanie typu nie powiodło się w wywołaniu elementu „{1}”.
pt_br: O tipo de uma das expressões na cláusula {0} está incorreto. Inferência de tipos falhou na chamada para "{1}".
ru: Тип одного из выражений в предложении {0} неверен. Ошибка определения типа при вызове в "{1}".
tr: {0} yan tümcesindeki ifadelerin birinin türü yanlış. '{1}' çağrısında anlam çıkarma başarısız oldu.
zh_hans: {0} 子句中其中一个表达式的类型不正确。在对“{1}”的调用中，类型推理失败。
zh_hant: {0} 子句中的其中一個運算式類型不正確。呼叫 '{1}' 時發生類型推斷失敗。

# ERR_QueryTypeInferenceFailed
source: The type of the expression in the {0} clause is incorrect. Type inference failed in the call to '{1}'.
cs: Typ výrazu v klauzuli {0} je nesprávný. Nepovedlo se odvození typu při volání funkce {1}.
de: Der Typ des Ausdrucks in der {0}-Klausel ist falsch. Fehler beim Typrückschluss im Aufruf von "{1}".
es: El tipo de la expresión de la cláusula {0} es incorrecto. No se pudo realizar la inferencia de tipos en la llamada a '{1}'.
fr: Le type de l'expression dans la clause {0} est incorrect. L'inférence de type a échoué dans l'appel à '{1}'.
it: Il tipo dell'espressione nella clausola {0} non è corretto. L'inferenza del tipo non è riuscita nella chiamata a '{1}'.
ja: {0} 句の式の型が正しくありません。'{1}' の呼び出しで型を推論できませんでした。
ko: {0} 절에 있는 식의 형식이 잘못되었습니다. '{1}'에 대한 호출에서 형식을 유추하지 못했습니다.
pl: Typ wyrażenia w klauzuli {0} jest niepoprawny. Wnioskowanie typu nie powiodło się w wywołaniu elementu „{1}”.
pt_br: O tipo da expressão na cláusula {0} está incorreto. Inferência de tipos falhou na chamada para "{1}".
ru: Тип выражения в предложении {0} неверен. Ошибка определения типа при вызове в "{1}".
tr: {0} yan tümcesindeki ifadenin türü yanlış. '{1}' çağrısında anlam çıkarma başarısız oldu.
zh_hans: {0} 子句中的表达式的类型不正确。在对“{1}”的调用中，类型推理失败。
zh_hant: {0} 子句中的運算式類型不正確。呼叫 '{1}' 時發生類型推斷失敗。

# ERR_QueryTypeInferenceFailedSelectMany
source: An expression of type '{0}' is not allowed in a subsequent from clause in a query expression with source type '{1}'. Type inference failed in the call to '{2}'.
cs: Není povolené použití výrazu typu {0} v následné klauzuli from ve výrazu dotazu s typem zdroje {1}. Nepovedlo se odvození typu při volání funkce {2}.
de: Ein Ausdruck vom Typ "{0}" ist in einer nachfolgenden from-Klausel in einem Abfrageausdruck mit dem Quelltyp "{1}" unzulässig. Fehler beim Typrückschluss im Aufruf von "{2}".
es: No se permiten expresiones de tipo '{0}' en una cláusula from siguiente incluida en una expresión de consulta con el tipo de origen '{1}'. No se pudo realizar la inferencia de tipos en la llamada a '{2}'.
fr: Une expression de type '{0}' n'est pas autorisée dans une clause from ultérieure dans une expression de requête avec un type source '{1}'. L'inférence de type a échoué dans l'appel à '{2}'.
it: Un'espressione di tipo '{0}' non è consentita in una clausola from successiva in un'espressione di query con tipo di origine '{1}'. L'inferenza del tipo non è riuscita nella chiamata a '{2}'.
ja: ソース型 '{1}' のクエリ式では後ろに続く from 句で型 '{0}' の式が許可されていません。'{2}' の呼び出しで型を推論できませんでした。
ko: 형식이 '{0}'인 식은 소스 형식이 '{1}'인 쿼리 식의 후속 from 절에서 사용할 수 없습니다. '{2}' 호출 시 형식을 유추하지 못했습니다.
pl: Wyrażenie typu „{0}” jest niedozwolone w kolejnej klauzuli from w wyrażeniu zapytania z typem źródłowym „{1}”. Wnioskowanie typu nie powiodło się w wywołaniu elementu „{2}”.
pt_br: Uma expressão do tipo "{0}" não é permitida em um subsequente da cláusula em uma expressão de consulta com o tipo de origem "{1}". Inferência de tipos falhou na chamada para "{2}".
ru: Выражение типа "{0}" недопустимо в последующем предложении from в выражении запроса с исходным типом "{1}". Ошибка определения типа при вызове в "{2}".
tr: Kaynak türü '{1}' olan bir sorgu ifadesinden sonraki from yan tümcesinde '{0}' türünde bir ifadeye izin verilmez. '{2}' çağrısında anlam çıkarma başarısız oldu.
zh_hans: 在源类型为“{1}”的查询表达式中，不允许在后面的 from 子句中使用类型“{0}”的表达式。在对“{2}”的调用中，类型推理失败。
zh_hant: 在具來源類型為 '{1}' 的查詢運算式內的後續 from 子句中，不可使用類型 '{0}' 的運算式。呼叫 '{2}' 時，發生類型推斷失敗。

# ERR_ExpressionTreeContainsPointerOp
source: An expression tree may not contain an unsafe pointer operation
cs: Strom výrazů nesmí obsahovat nezabezpečenou operaci s ukazatelem.
de: Ein Ausdrucksbaum darf keinen unsicheren Zeigervorgang enthalten.
es: Un árbol de expresión no puede contener una operación de puntero no segura
fr: Une arborescence de l'expression ne peut pas contenir une opération pointeur unsafe
it: Un albero delle espressioni non può contenere un'operazione di puntatore unsafe
ja: 式ツリーは、アンセーフ ポインター操作を含むことはできません
ko: 식 트리에는 안전하지 않은 포인터 연산을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać niebezpiecznej operacji wskaźnika
pt_br: Uma árvore de expressão não pode conter uma operação de ponteiro inseguro
ru: Дерево выражения не может содержать небезопасные операции над указателями.
tr: Bir ifade ağacı güvensiz işaretçi işlemi içeremez
zh_hans: 表达式树不能包含不安全的指针操作
zh_hant: 運算式樹狀結構不可包含 unsafe 指標作業

# ERR_ExpressionTreeContainsAnonymousMethod
source: An expression tree may not contain an anonymous method expression
cs: Strom výrazů nesmí obsahovat výraz anonymní metody.
de: Ein Ausdrucksbaum darf keinen anonymen Methodenausdruck enthalten.
es: Un árbol de expresión no puede contener una expresión de método anónimo
fr: Une arborescence de l'expression ne peut pas contenir une expression de méthode anonyme
it: Un albero delle espressioni non può contenere un'espressione di metodo anonimo
ja: 式ツリーは、匿名メソッド式を含むことはできません
ko: 식 트리에는 무명 메서드 식을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać wyrażenia metody anonimowej
pt_br: Uma árvore de expressão não pode conter uma expressão de método anônimo
ru: Дерево выражения не может содержать выражение анонимного метода.
tr: Bir ifade ağacı anonim bir yöntem ifadesi içeremez
zh_hans: 表达式树不能包含匿名方法表达式
zh_hant: 運算式樹狀結構不可包含匿名方法運算式

# ERR_AnonymousMethodToExpressionTree
source: An anonymous method expression cannot be converted to an expression tree
cs: Výraz anonymní metody nejde převést na strom výrazu.
de: Ein anonymer Methodenausdruck kann nicht in einen Ausdrucksbaum konvertiert werden.
es: Una expresión de método anónimo no se puede convertir en un árbol de expresión
fr: Une expression de méthode anonyme ne peut pas être convertie en arborescence de l'expression
it: Non è possibile convertire un'espressione di metodo anonimo in un albero delle espressioni
ja: 匿名メソッド式を式ツリーに変換することはできません
ko: 무명 메서드 식을 식 트리로 변환할 수 없습니다.
pl: Nie można przekonwertować wyrażenia metody anonimowej na drzewo wyrażenia
pt_br: Uma expressão de método anônimo não pode ser convertida em uma árvore de expressão
ru: Выражение анонимного метода не может быть преобразовано в дерево выражения.
tr: Anonim yöntem ifadesi ifade ağacına dönüştürülemez
zh_hans: 无法将匿名方法表达式转换为表达式树
zh_hant: 匿名方法運算式無法轉換成運算式樹狀結構

# ERR_QueryRangeVariableReadOnly
source: Range variable '{0}' cannot be assigned to -- it is read only
cs: K proměnné rozsahu {0} nejde přiřazovat – je jenom pro čtení.
de: Der Bereichsvariablen "{0}" kann nichts zugewiesen werden, sie ist schreibgeschützt.
es: La variable de rango '{0}' no se puede asignar: es de solo lectura
fr: La variable de portée '{0}' ne peut pas être assignée à -- elle est en lecture seule
it: Non è possibile assegnare la variabile di intervallo '{0}'. È di sola lettura
ja: 範囲変数 '{0}' が割り当てられません -- 読み取り専用です
ko: 범위 변수 '{0}'은(는) 읽기 전용이므로 이 변수에 값을 할당할 수 없습니다.
pl: Nie można wykonać przypisania do zmiennej zakresu „{0}” — można ją tylko odczytać
pt_br: A variável de intervalo "{0}" não pode ser atribuída a -- ela é de somente leitura
ru: Невозможно присвоить значение переменной диапазона "{0}", доступной только для чтения.
tr: {0}' aralık değişkeni atanamıyor -- salt okunur
zh_hans: 无法对范围变量“{0}”赋值 -- 它是只读的
zh_hant: 無法指派為範圍變數 '{0}' -- 其為唯讀

# ERR_QueryRangeVariableSameAsTypeParam
source: The range variable '{0}' cannot have the same name as a method type parameter
cs: Proměnná rozsahu {0} nesmí mít stejný název jako parametr typu metody.
de: Die Bereichsvariable "{0}" darf nicht denselben Namen wie der Typparameter einer Methode aufweisen.
es: La variable de rango '{0}' no puede tener el mismo nombre que un parámetro de tipo de método
fr: La variable de portée '{0}' ne peut pas avoir le même nom qu'un paramètre de type de méthode
it: La variabile di intervallo '{0}' non può avere lo stesso nome di un parametro di tipo del metodo
ja: 範囲変数 '{0}' は、メソッド型パラメーターと同じ名前を持つことができません
ko: 범위 변수 '{0}'에 메서드 형식 매개 변수와 동일한 이름을 사용할 수 없습니다.
pl: Zmienna zakresu „{0}” nie może mieć takiej samej nazwy jak parametr typu metody
pt_br: A variável de intervalo "{0}" não pode ter o mesmo nome de um parâmetro de tipo de método
ru: Переменная диапазона "{0}" не может иметь имя, совпадающее с именем параметра типа метода.
tr: {0}' aralık değişkeni, bir yöntem türü parametresi ile aynı ada sahip olamaz
zh_hans: 范围变量“{0}”的名称不能与方法类型参数相同
zh_hant: 範圍變數 '{0}' 不可與方法類型參數同名

# ERR_TypeVarNotFoundRangeVariable
source: The contextual keyword 'var' cannot be used in a range variable declaration
cs: V deklaraci proměnné rozsahu nejde použít kontextové klíčové slovo var.
de: Das kontextabhängige Schlüsselwort "var" darf nicht in der Deklaration einer Bereichsvariablen verwendet werden.
es: La palabra clave contextual 'var' no se puede usar en una declaración de variable de rango
fr: Le mot clé contextuel 'var' ne peut pas être utilisé dans une déclaration de variable de portée
it: Impossibile utilizzare la parola chiave contestuale 'var' in una dichiarazione di variabile di intervallo
ja: コンテキスト キーワード 'var' は、範囲変数宣言では使用できません
ko: 범위 변수 선언에는 상황별 키워드'var'를 사용할 수 없습니다.
pl: Nie można używać kontekstowego słowa kluczowego „var” w deklaracji zmiennej zakresu
pt_br: A palavra-chave contextual 'var' não pode ser usada em uma declaração de variável de intervalo
ru: Контекстное ключевое слово "var" не может быть использовано в объявлении переменной диапазона.
tr: var' bağlamsal anahtar sözcüğü bir aralık değişkeni bildiriminde kullanılamaz
zh_hans: 不能在范围变量声明中使用上下文关键字“var”
zh_hant: 無法在範圍變數宣告中使用內容關鍵字 'var'

# ERR_BadArgTypesForCollectionAdd
source: The best overloaded Add method '{0}' for the collection initializer has some invalid arguments
cs: Některé argumenty optimální přetěžované metody Add {0} pro inicializátor kolekce jsou neplatné.
de: Die beste Übereinstimmung für die überladene {0}-Methode für den Sammlungsinitialisierer enthält einige ungültige Argumente.
es: El mejor método Add sobrecargado '{0}' del inicializador de colecciones tiene algunos argumentos no válidos
fr: La méthode Add surchargée '{0}' correspondant le mieux à l'initialiseur de collection a des arguments non valides
it: Il miglior metodo Add di overload '{0}' per l'inizializzatore di raccolta presenta alcuni argomenti non validi
ja: コレクション初期化子に最も適しているオーバーロード Add メソッド '{0}' には無効な引数がいくつか含まれています
ko: 오버로드된 Add 메서드 중 해당 컬렉션 이니셜라이저에 가장 적합한 '{0}'에 잘못된 인수가 있습니다.
pl: Niektóre argumenty najlepiej dopasowanej przeciążonej metody Add „{0}”dla inicjatora kolekcji są nieprawidłowe.
pt_br: O melhor método Add sobrecarregado "{0}" do inicializador de coleção tem alguns argumentos inválidos
ru: Наиболее подходящий перегруженный метод Add "{0}" для инициализатора набора содержит недопустимые аргументы.
tr: Koleksiyon başlatıcısı için en iyi Add yöntemi olan '{0}' bazı geçersiz bağımsız değişkenlere sahip
zh_hans: 集合初始值设定项的最佳重载 Add 方法“{0}”具有一些无效参数
zh_hant: 集合初始設定式最符合的多載 Add 方法 '{0}'，有一些無效的引數

# ERR_ByRefParameterInExpressionTree
source: An expression tree lambda may not contain a ref, in or out parameter
cs: Strom výrazu lambda nesmí obsahovat parametr ref, in nebo out.
de: Ein Ausdrucksbaumstruktur-Lambda darf keinen ref-, in- oder out-Parameter enthalten.
es: Una expresión lambda de árbol de expresión no puede contener un parámetro ref, in ni out
fr: Une arborescence d'expression lambda ne doit pas contenir de paramètre ref, in ou out
it: Un'espressione lambda dell'albero delle espressioni non può contenere un parametro in, out o ref
ja: 式ツリーのラムダは、ref、in、out パラメーターを含むことはできません
ko: 람다 식 트리에는 ref, in 또는 out 매개 변수를 사용할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać parametrów ref, in ani out
pt_br: Uma árvore de expressão da expressão lambda não pode conter um parâmetro ref, in ou out
ru: Дерево лямбда-выражения не может содержать параметр ref, in или out
tr: İfade ağacı lambdası bir ref, in veya out parametresi içeremez
zh_hans: 表达式树 lambda 不能包含 ref、in 或 out 参数
zh_hant: 運算式樹狀架構 Lambda 不可包含 ref、in 或 out 參數

# ERR_VarArgsInExpressionTree
source: An expression tree lambda may not contain a method with variable arguments
cs: Strom výrazu lambda nesmí obsahovat metodu s proměnnými argumenty.
de: Ein Ausdrucksbaumstruktur-Lambda darf keine Methode mit Variablenargumenten enthalten.
es: Una expresión lambda de árbol de expresión no puede contener un método con argumentos variables
fr: Une arborescence d'expression lambda ne peut pas contenir une méthode avec des arguments de variables
it: Un'espressione lambda dell'albero delle espressioni non può contenere un metodo con argomenti variabili
ja: 式ツリーのラムダは、可変引数があるメソッドを含むことはできません
ko: 람다 식 트리에는 가변 인수가 있는 메서드를 사용할 수 없습니다.
pl: Drzewo wyrażenia lambda nie może zawierać metody z argumentami zmiennych
pt_br: Uma árvore de expressão da expressão lambda não pode conter um método com argumentos variáveis
ru: Дерево лямбда-выражения не может содержать метод с изменяющимся числом аргументов.
tr: Bir ifade ağacı lambdası, değişken sayıda bağımsız değişkeni olan bir yöntem içeremez
zh_hans: 表达式树 lambda 不能包含具有变量参数的方法
zh_hant: 運算式樹狀架構 Lambda 不可包含具有變數引數的方法

# ERR_InitializerAddHasParamModifiers
source: The best overloaded method match '{0}' for the collection initializer element cannot be used. Collection initializer 'Add' methods cannot have ref or out parameters.
cs: Optimální nalezenou přetěžovanou metodu {0} pro element inicializátoru kolekce nejde použít. Metody Add inicializátoru kolekce nemůžou mít parametry Ref nebo Out.
de: Die beste Übereinstimmung für die überladene {0}-Methode für das Sammlungsinitialisiererelement kann nicht verwendet werden. Die Add-Methoden von Sammlungsinitialisierern dürfen keine ref- oder out-Parameter enthalten.
es: La mejor coincidencia de método sobrecargado '{0}' para el elemento inicializador de la colección no se puede usar. Los métodos 'Add' inicializadores de colección no pueden tener parámetros out ni ref.
fr: La méthode surchargée '{0}' correspondant le mieux à l'élément de l'initialiseur de collection ne peut pas être utilisée. Les méthodes 'Add' de l'initialiseur de collection ne peuvent pas avoir de paramètres ref ou out.
it: Non è possibile usare la migliore corrispondenza '{0}' del metodo di overload per l'elemento inizializzatore di raccolta. I metodi 'Add' dell'inizializzatore di raccolta non possono avere parametri out o ref.
ja: コレクション初期化子要素の '{0}' に最も適しているオーバーロード メソッドは使用できません。コレクション初期化子 'Add' メソッドには、ref パラメーターまたは out パラメーターを使用できません。
ko: 컬렉션 이니셜라이저에 대한 '{0}'에 가장 일치하는 오버로드된 메서드를 사용할 수 없습니다. 컬렉션 이니셜라이저 'Add' 메서드에는 ref 또는 out 매개 변수를 사용할 수 없습니다.
pl: Nie można użyć najlepiej dopasowanej przeciążonej metody Match „{0}” dla elementu inicjatora kolekcji. Metody „Add” inicjatora kolekcji nie mogą mieć parametrów ref ani out.
pt_br: A melhor correspondência de método sobrecarregado "{0}" do elemento de inicializador de coleção não pode ser usada. Os métodos "Add" do inicializador de coleção não podem ter os parâmetros ref ou out.
ru: Наиболее подходящий перегруженный метод, соответствующий "{0}" для элемента инициализации коллекции, не может быть использован. Методы инициализации коллекции "Add" не имеют ссылочных и выходных параметров.
tr: Koleksiyon başlatıcı öğesi için en iyi yeniden yüklenmiş yöntem eşleşmesi olan '{0}' kullanılamıyor. Koleksiyon başlatıcı 'Add' yöntemleri ref veya out parametreleri içeremez.
zh_hans: 无法使用集合初始值设定项元素的最佳重载方法匹配项“{0}”。集合初始值设定项 "Add" 方法不能具有 ref 或 out 参数。
zh_hant: 無法使用集合初始設定式項目最符合的多載方法 '{0}'。集合初始設定式 'Add' 方法不能具有 ref 或 out 參數。

# ERR_NonInvocableMemberCalled
source: Non-invocable member '{0}' cannot be used like a method.
cs: Nevyvolatelného člena {0} nejde použít jako metodu.
de: Der nicht aufrufbare Member "{0}" kann nicht wie eine Methode verwendet werden.
es: No se puede usar como método el miembro '{0}' no invocable.
fr: Impossible d'utiliser un membre '{0}' ne pouvant pas être appelé comme une méthode.
it: Non è possibile usare come metodo il membro non richiamabile '{0}'.
ja: 実行不可能なメンバー '{0}' をメソッドのように使用することはできません。
ko: 호출할 수 없는 멤버인 '{0}'은(는) 메서드처럼 사용할 수 없습니다.
pl: Składowej „{0}”, której nie można wywoływać, nie można używać jak metody.
pt_br: O membro não invocável "{0}" não pode ser usado como um método.
ru: Невызываемый член "{0}" не может использоваться как метод.
tr: Çağrılamaz üye '{0}' yöntem gibi kullanılamaz.
zh_hans: 不可调用的成员“{0}”不能像方法一样使用。
zh_hant: 非可叫用成員 '{0}' 不能用做為方法。

# WRN_MultipleRuntimeImplementationMatches
source: Member '{0}' implements interface member '{1}' in type '{2}'. There are multiple matches for the interface member at run-time. It is implementation dependent which method will be called.
cs: Člen {0} implementuje člen rozhraní {1} v typu {2}. Za běhu existuje pro tohoto člena rozhraní víc shod. Volaná metoda závisí na konkrétní implementaci.
de: Der Member "{0}" implementiert den Schnittstellenmember "{1}" im Typ "{2}". Zur Laufzeit gibt es mehrere Übereinstimmungen für den Schnittstellenmember. Die aufgerufene Methode ist implementierungsabhängig.
es: El miembro '{0}' implementa el miembro de interfaz '{1}' en el tipo '{2}'. Hay varias coincidencias para el miembro de interfaz en tiempo de ejecución. El método que se llamará depende de la implementación.
fr: Le membre '{0}' implémente le membre d'interface '{1}' dans le type '{2}'. Il existe plusieurs correspondances pour le membre d'interface au moment de l'exécution. La méthode appelée dépend de l'implémentation.
it: Il membro '{0}' implementa il membro di interfaccia '{1}' nel tipo '{2}'. In fase di esecuzione sono presenti più corrispondenze del membro di interfaccia. Il metodo che verrà chiamato dipende dall'implementazione.
ja: メンバー '{0}' は、インターフェイス メンバー '{1}' を型 '{2}' で実装できません。実行時に一致するインターフェイス メンバーが複数あります。どのメソッドが呼び出されるかは実装に依存しています。
ko: {0}' 멤버는 '{2}' 형식의 인터페이스 멤버 '{1}'을(를) 구현합니다. 런타임에 인터페이스 멤버에 일치하는 여러 항목이 있습니다. 호출되는 메서드는 구현에 따라 다릅니다.
pl: Składowa „{0}” implementuje składową interfejsu „{1}” w typie „{2}”. W czasie wykonywania składowa interfejsu jest zgodna z wieloma metodami. Od implementacji zależy, która metoda zostanie wywołana.
pt_br: Membro "{0}" implementa membro de interface "{1}" no tipo "{2}". Há várias correspondências para o membro de interface em tempo de execução. Ele é dependente de implementação cujo método será chamado.
ru: Член "{0}" реализует интерфейсный член "{1}" в типе "{2}". Во время выполнения возникает множественное соответствие интерфейсных членов. Реализация зависит от того, какой метод будет вызван.
tr: {0}' üyesi '{2}' türündeki '{1}' arabirim üyesini uyguluyor. Çalışma zamanında arabirim üyesi için birden fazla eşleşme var. Hangi yöntemin çağrılacağı uygulamaya bağımlıdır.
zh_hans: 成员“{0}”实现类型“{2}”中的接口成员“{1}”。在运行时该接口成员有多个匹配项。此实现取决于将要调用的方法。
zh_hant: 成員 '{0}' 會實作類型 '{2}' 的介面成員 '{1}'。在執行階段發現多個相符的介面成員。實作將會視所呼叫的方法而定。

# WRN_MultipleRuntimeImplementationMatches_Title
source: Member implements interface member with multiple matches at run-time
cs: Člen za běhu implementuje člena rozhraní s více shodami.
de: Element implementiert Schnittstellenelement mit mehreren Übereinstimmungen zur Laufzeit
es: El miembro implementa el miembro de la interfaz con varias coincidencias en el tiempo de ejecución
fr: Un membre implémente un membre d'interface avec plusieurs correspondances au moment de l'exécution
it: Il membro implementa il membro di interfaccia con più corrispondenze in fase di esecuzione
ja: メンバーは、実行時に複数の一致があるインターフェイス メンバーを実装します
ko: 멤버가 런타임에 여러 개의 일치 항목을 포함하는 인터페이스 멤버를 구현합니다.
pl: Składowa implementuje składową za pomocą wielu dopasowań w czasie wykonywania
pt_br: O membro implementa o membro de interface com várias correspondências no tempo de execução
ru: Член реализует член интерфейса с несколькими совпадениями во время выполнения
tr: Üye arabirim üyesini çalışma zamanında birden çok eşleşme ile uygular
zh_hans: 成员在运行时使用多个匹配项实现接口成员
zh_hant: 成員會在執行階段實作具有多個相符項的介面成員
