Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RefReturnNonreturnableLocal
source: Cannot return '{0}' by reference because it was initialized to a value that cannot be returned by reference
cs: {0} nejde vrátit pomocí odkazu, protože bylo inicializované na hodnotu, která nemůže být vrácená pomocí odkazu.
de: "{0}" kann nicht als Verweis zurückgegeben werden, weil das Element mit einem Wert initialisiert wurde, der nicht als Verweis zurückgegeben werden kann.
es: No se puede devolver '{0}' por referencia porque se inicializó con un valor que no se puede devolver por referencia.
fr: Impossible de retourner '{0}' par référence, car il a été initialisé à une valeur qui ne peut pas être retournée par référence
it: Non è possibile restituire '{0}' per riferimento perché è stato inizializzato con un valore che non può essere restituito per riferimento
ja: '{0}' は参照渡しで返せない値に初期化されたため、参照渡しで返すことができません
ko: {0}'은(는) 참조로 반환될 수 없는 값으로 초기화되었으므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić elementu „{0}” przez referencję, ponieważ został on zainicjowany przy użyciu wartości, której nie można zwrócić przez referencję
pt_br: Não é possível retornar '{0}' por referência porque ele foi inicializado para um valor que não pode ser retornado por referência
ru: Невозможно вернуть по ссылке "{0}", так как он был инициализирован значением, которое нельзя вернуть по ссылке
tr: {0}' öğesi, başvuru ile döndürülemeyen bir değerle başlatıldığından başvuru ile döndürülemez
zh_hans: “{0}”已初始化为不能通过引用返回的值，因此无法通过引用返回
zh_hant: 無法藉傳址方式傳回 '{0}'，因為已將其初始化為無法藉傳址方式傳回的值

# ERR_RefReturnNonreturnableLocal2
source: Cannot return by reference a member of '{0}' because it was initialized to a value that cannot be returned by reference
cs: Člen pro {0} nejde vrátit pomocí odkazu, protože bylo inicializované na hodnotu, která nemůže být vrácená pomocí odkazu.
de: Ein Member von "{0}" kann nicht als Verweis zurückgegeben werden, weil er mit einem Wert initialisiert wurde, der nicht als Verweis zurückgegeben werden kann.
es: No se puede devolver por referencia un miembro de '{0}' porque se inicializó con un valor que no se puede devolver por referencia.
fr: Impossible d'effectuer un retour par référence d'un membre de '{0}', car il a été initialisé à une valeur qui ne peut pas être retournée par référence
it: Non è possibile restituire un membro di '{0}' per riferimento perché è stato inizializzato con un valore che non può essere restituito per riferimento
ja: '{0}' のメンバーは参照渡しで返せない値に初期化されたため、参照渡しで返すことができません
ko: {0}'의 멤버는 참조로 반환될 수 없는 값으로 초기화되었으므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić przez referencję składowej elementu „{0}”, ponieważ została ona zainicjowana przy użyciu wartości, której nie można zwrócić przez referencję
pt_br: Não é possível retornar por referência um membro de '{0}' porque ele foi inicializado para um valor que não pode ser retornado por referência
ru: Невозможно вернуть по ссылке член "{0}", так как он был инициализирован значением, которое нельзя вернуть по ссылке
tr: {0}' öğesinin bir üyesi, başvuru ile döndürülemeyen bir değerle başlatıldığından başvuru ile döndürülemez
zh_hans: “{0}”已初始化为不能通过引用返回的值，因此无法通过引用返回其成员
zh_hant: 無法藉傳址方式傳回 '{0}' 的成員，因為已將其初始化為無法藉傳址方式傳回的值

# ERR_RefReturnRangeVariable
source: Cannot return the range variable '{0}' by reference
cs: Proměnnou rozsahu {0} nejde vrátit pomocí odkazu.
de: Die Bereichsvariable "{0}" kann nicht als Verweis zurückgegeben werden.
es: No se puede devolver por referencia la variable de rango '{0}'.
fr: Impossible de retourner la variable de portée '{0}' par référence
it: Non è possibile restituire la variabile di intervallo '{0}' per riferimento
ja: 範囲変数 '{0}' を参照渡しで返すことはできません
ko: 범위 변수 '{0}'을(를) 참조로 반환할 수 없습니다.
pl: Nie można zwrócić zmiennej zakresu „{0}” przez referencję
pt_br: Não é possível retornar a variável de intervalo '{0}' por referência
ru: Невозможно вернуть переменную диапазона "{0}" по ссылке
tr: {0}' aralık değişkeni başvuru ile döndürülemez
zh_hans: 无法通过引用返回范围变量“{0}”
zh_hant: 無法藉傳址方式傳回範圍變數 '{0}'

# ERR_RefReturnReadonly
source: A readonly field cannot be returned by writable reference
cs: Pole jen pro čtení nejde vrátit zapisovatelným odkazem.
de: Ein schreibgeschütztes Feld kann nicht als schreibbarer Verweis zurückgegeben werden.
es: No se puede devolver un campo de solo lectura por referencia grabable.
fr: Impossible de retourner un champ readonly par référence accessible en écriture
it: Un campo di sola lettura non può restituito per riferimento scrivibile
ja: 読み取り専用フィールドを書き込み可能な参照渡しで返すことはできません
ko: 읽기 전용 필드는 쓰기 가능 참조로 반환될 수 없습니다.
pl: Nie można zwrócić pola tylko do odczytu przez zapisywalne odwołanie
pt_br: Um campo somente leitura não pode ser retornado por referência gravável
ru: Поле, доступное только для чтения, невозможно вернуть по ссылке, доступной для записи
tr: Salt okunur bir alan, yazılabilir başvuru ile döndürülemez
zh_hans: 只读字段无法通过可写的引用返回
zh_hant: 無法以可寫入傳址方式傳回唯讀欄位

# ERR_RefReturnReadonlyStatic
source: A static readonly field cannot be returned by writable reference
cs: Statické pole jen pro čtení nejde vrátit zapisovatelným odkazem.
de: Ein statisches schreibgeschütztes Feld kann nicht als schreibbarer Verweis zurückgegeben werden.
es: No se puede devolver un campo estático de solo lectura por referencia grabable.
fr: Impossible de retourner un champ readonly statique par référence accessible en écriture
it: Non è possibile restituire un campo di sola lettura statico per riferimento scrivibile
ja: 静的な読み取り専用フィールドを書き込み可能な参照渡しで返すことはできません
ko: 정적 읽기 전용 필드는 쓰기 가능 참조로 반환될 수 없습니다.
pl: Statycznego pola tylko do odczytu nie można zwrócić przez zapisywalne odwołanie
pt_br: Um campo somente leitura estático não pode ser retornado por referência gravável
ru: Статическое поле, доступное только для чтения, невозможно вернуть по ссылке для записи
tr: Statik bir salt okunur alan, yazılabilir başvuru ile döndürülemez
zh_hans: 静态只读字段无法通过可写的引用返回
zh_hant: 無法以可寫入傳址方式傳回靜態的唯讀欄位

# ERR_RefReturnReadonly2
source: Members of readonly field '{0}' cannot be returned by writable reference
cs: Členy pole jen pro čtení {0} nejde vrátit zapisovatelným odkazem.
de: Member des schreibgeschützten Felds "{0}" können nicht als schreibbarer Verweis zurückgegeben werden.
es: Los miembros del campo de solo lectura "{0}" no se pueden devolver por referencia grabable.
fr: Impossible de retourner les membres du champ readonly '{0}' par référence accessible en écriture
it: I membri del campo di sola lettura '{0}' non possono essere restituiti per riferimento scrivibile
ja: 読み取り専用フィールド '{0}' のメンバーを書き込み可能な参照渡しで返すことはできません
ko: 읽기 전용 필드 '{0}'의 멤버는 쓰기 가능 참조로 반환될 수 없습니다.
pl: Składowych pola tylko do odczytu „{0}” nie można zwrócić przez zapisywalne odwołanie
pt_br: Membros do campo somente leitura '{0}' não podem ser retornados por referência gravável
ru: Члены поля "{0}", доступного только для чтения, нельзя вернуть по ссылке, доступной для записи
tr: {0}' salt okunur alanının üyeleri, yazılabilir başvuru ile döndürülemez
zh_hans: 只读字段“{0}”的成员无法通过可写的引用返回
zh_hant: 無法以可寫入傳址方式傳回唯讀欄位 '{0}' 的成員

# ERR_RefReturnReadonlyStatic2
source: Fields of static readonly field '{0}' cannot be returned by writable reference
cs: Pole statického pole jen pro čtení {0} nejdou vrátit zapisovatelným odkazem.
de: Felder eines statischen schreibgeschützten Felds "{0}" können nicht als schreibbarer Verweis zurückgegeben werden.
es: Los campos del campo estático de solo lectura "{0}" no se pueden devolver por referencia grabable.
fr: Impossible de retourner les champs du champ readonly statique '{0}' par référence accessible en écriture
it: Non è possibile restituire i campi del campo di sola lettura statico '{0}' per riferimento scrivibile
ja: 静的な読み取り専用フィールド '{0}' のフィールドを書き込み可能な参照渡しで返すことはできません
ko: 정적 읽기 전용 필드 '{0}'의 필드는 쓰기 가능 참조로 반환될 수 없습니다.
pl: Pól statycznego pola tylko do odczytu „{0}” nie można zwrócić przez zapisywalne odwołanie
pt_br: Os campos do campo somente leitura estático '{0}' não podem ser retornados por referência gravável
ru: Поля статического поля "{0}", доступного только для чтения, нельзя вернуть по ссылке для записи
tr: {0}' statik salt okunur alanına ait alanlar, yazılabilir başvuru ile döndürülemez
zh_hans: 静态只读字段“{0}”的字段无法通过可写的引用返回
zh_hant: 無法以可寫入傳址方式傳回靜態唯讀欄位 '{0}' 的欄位

# ERR_RefReturnParameter
source: Cannot return a parameter by reference '{0}' because it is not a ref parameter
cs: Parametr nejde vrátit pomocí odkazu {0}, protože nejde o parametr Ref.
fr: Impossible de retourner un paramètre par référence '{0}', car il ne s’agit pas d’un paramètre ref
it: Non è possibile restituire un parametro '{0}' per riferimento perché non è un parametro ref
ja: 参照 '{0}' は ref パラメーターではないため、パラメーターを返すことができません
pl: Nie można zwrócić parametru przez referencję „{0}”, ponieważ to nie jest parametr referencyjny
pt_br: Não é possível retornar um parâmetro por referência '{0}' porque ele não é um parâmetro ref
ru: Невозможно вернуть параметр по ссылке "{0}" поскольку это не параметр ref
zh_hans: 无法通过引用 "{0}" 返回参数，因为它不是 ref 参数
zh_hant: 無法藉傳址 '{0}' 傳回參數，因為其非 ref 參數

# ERR_RefReturnParameter2
source: Cannot return by reference a member of parameter '{0}' because it is not a ref or out parameter
cs: Člen parametru {0} nejde vrátit pomocí odkazu, protože nejde o parametr ref nebo out.
de: Ein Member des Parameters "{0}" kann nicht als Verweis zurückgegeben werden, weil es sich nicht um einen ref- oder out-Parameter handelt.
es: No se puede devolver un miembro del parámetro "{0}" por referencia, porque no es un parámetro out o ref.
fr: Impossible de retourner par référence un membre du paramètre '{0}', car il ne s'agit pas d'un paramètre ref ou out
it: Non è possibile restituire per riferimento un membro del parametro '{0}' perché non è un parametro ref o out
ja: ref パラメーターでも out パラメーターでもないため、パラメーター '{0}' のメンバーを参照渡しで返すことはできません
ko: {0}' 매개 변수의 멤버는 ref 또는 out 매개 변수가 아니므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić składowej parametru „{0}” przez referencję, ponieważ to nie jest parametr ref ani out
pt_br: Não é possível retornar um membro do parâmetro '{0}' por referência, porque ele não é um parâmetro de referência ou out
ru: Невозможно вернуть по ссылке член параметра "{0}", так как это не параметр ref или out
tr: {0}' parametresinin üyelerinden biri, ref veya out parametresi olmadığından başvuru ile döndürülemiyor
zh_hans: 参数“{0}”不是 ref 或 out 参数，无法通过引用返回其成员
zh_hant: 無法藉傳址方式傳回參數 '{0}' 的成員，因為它不是 ref 或 out 參數

# ERR_RefReturnLocal
source: Cannot return local '{0}' by reference because it is not a ref local
cs: Lokální proměnnou {0} nejde vrátit pomocí odkazu, protože nejde o lokální proměnnou podle odkazu.
de: Das lokale Element "{0}" kann nicht als Verweis zurückgegeben werden, weil es kein lokales ref-Elelement ist.
es: No se puede devolver por referencia la variable local '{0}' porque no es de tipo ref.
fr: Impossible de retourner la variable locale '{0}' par référence, car il ne s'agit pas d'une variable locale de référence
it: Non è possibile restituire la variabile locale '{0}' per riferimento perché non è una variabile locale ref
ja: ローカル変数 '{0}' は ref ローカル変数ではないため、参照渡しで返すことはできません
ko: {0}' 로컬은 참조 로컬이 아니므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić zmiennej lokalnej „{0}” przez referencję, ponieważ to nie jest zmienna lokalna ref
pt_br: Não é possível retornar o local '{0}' por referência porque ele não é um local ref
ru: Невозможно вернуть по ссылке локальный "{0}", так как это не локальная переменная ref
tr: Bir ref yerel öğesi olmadığından, yerel '{0}' öğesi başvuru ile döndürülemez
zh_hans: 局部变量“{0}”不是 ref 局部变量，无法通过引用返回
zh_hant: 無法藉傳址方式傳回本機 '{0}'，因為其非參考本機

# ERR_RefReturnLocal2
source: Cannot return a member of local '{0}' by reference because it is not a ref local
cs: Člen lokální proměnné {0} nejde vrátit pomocí odkazu, protože nejde o lokální proměnnou podle odkazu.
de: Ein Member des lokalen Elements "{0}" kann nicht als Verweis zurückgegeben werden, weil es kein lokales ref-Elelement ist.
es: No se puede devolver por referencia un miembro de la variable local '{0}' porque no es una variable local de tipo ref.
fr: Impossible de retourner un membre de la variable locale '{0}' par référence, car il ne s'agit pas d'une variable locale de référence
it: Non è possibile restituire un membro della variabile locale '{0}' per riferimento perché non è una variabile locale ref
ja: ローカル変数 '{0}' は ref ローカル変数ではないため、そのメンバーを参照渡しで返すことはできません
ko: {0}' 로컬의 멤버는 참조 로컬이 아니므로 참조로 반환할 수 없습니다.
pl: Nie można zwrócić składowej zmiennej lokalnej „{0}” przez referencję, ponieważ to nie jest zmienna lokalna ref
pt_br: Não é possível retornar um membro do '{0}' local por referência porque ele não é um local ref
ru: Невозможно вернуть по ссылке член локального элемента "{0}", так как это не локальная переменная ref
tr: Bir ref yerel öğesi olmadığından, yerel '{0}' öğesinin üyesi başvuru ile döndürülemez
zh_hans: 局部变量“{0}”不是 ref 局部变量，无法通过引用返回其成员
zh_hant: 無法藉傳址方式傳回本機 '{0}' 的成員，因為其非參考本機

# ERR_RefReturnStructThis
source: Struct members cannot return 'this' or other instance members by reference
cs: Členy struktury nemůžou vracet this nebo jiné členy instance pomocí odkazu.
de: Strukturmember können nicht "this" oder andere Instanzmember als Verweis zurückgeben.
es: Los miembros de struct no pueden devolver 'this' ni otros miembros de instancia por referencia.
fr: Les membres struct ne peuvent pas retourner 'this' ou d'autres membres d'instance par référence
it: I membri struct non possono restituire 'this' o altri membri di istanza per riferimento
ja: 構造体メンバーは 'this' または他のインスタンス メンバーを参照渡しで返すことができません
ko: 구조체 멤버는 'this' 또는 다른 인스턴스 멤버를 참조로 반환할 수 없습니다.
pl: Składowe struktury nie mogą zwracać obiektu „this” ani innych składowych wystąpienia przez referencję
pt_br: Membros struct não podem retornar 'this' ou outros membros de instância por referência
ru: Члены структуры не могут возвращать по ссылке члены экземпляра this или другого экземпляра
tr: Yapı öğeleri 'this' veya diğer örnek üyelerini başvuru ile döndüremez
zh_hans: 结构成员无法通过引用返回 "this" 或其他实例成员
zh_hant: 結構成員無法藉傳址方式傳回 'this' 或其他執行個體成員

# ERR_EscapeOther
source: Expression cannot be used in this context because it may indirectly expose variables outside of their declaration scope
cs: V tomto kontextu nejde výraz použít, protože může nepřímo vystavit proměnné mimo jejich rozsah deklarace.
de: Der Ausdruck kann in diesem Kontext nicht verwendet werden, weil Variablen dadurch möglicherweise außerhalb ihrer Deklaration indirekt verfügbar gemacht werden.
es: No se puede usar una expresión en este contexto porque puede exponer variables indirectamente fuera de su ámbito de declaración.
fr: Impossible d'utiliser l'expression dans ce contexte, car elle peut exposer indirectement des variables en dehors de la portée de leur déclaration
it: Non è possibile usare l'espressione in questo contesto perché potrebbe esporre indirettamente variabili all'esterno del relativo ambito di dichiarazione
ja: 間接的に変数が宣言のスコープ外に公開される可能性があるため、このコンテキストで式は使用できません
ko: 식은 선언 범위 외부의 변수를 간접적으로 노출할 수 있으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: Nie można używać wyrażenia w tym kontekście, ponieważ pośrednio może ujawniać zmienne poza ich zakresem deklaracji
pt_br: A expressão não pode ser usada neste contexto porque ela pode expor indiretamente variáveis fora do seu escopo de declaração
ru: Выражение нельзя использовать в этом контексте, так как из-за этого переменные могут стать косвенно доступными за пределами их области объявления.
tr: İfade, değişkenleri kendi bildirim kapsamı dışında dolaylı olarak kullanıma sunabileceğinden bu bağlamda kullanılamaz
zh_hans: 不能在此上下文中使用表达式，因为它可能在其声明范围以外间接地公开变量
zh_hant: 無法在此內容中使用運算式，因為它會在其宣告範圍外間接公開變數

# ERR_EscapeCall
source: Cannot use a result of '{0}' in this context because it may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: V tomto kontextu nejde použít výsledek z {0}, protože může vystavit proměnné, na které odkazuje parametr {1}, mimo jejich rozsah deklarace.
de: Ein Ergebnis von "{0}" kann in diesem Kontext nicht verwendet werden, weil dadurch vom Parameter "{1}" referenzierte Variablen möglicherweise außerhalb ihres Deklarationsbereichs verfügbar gemacht werden.
es: No se puede usar un resultado de "{0}" en este contexto porque puede exponer variables a las que el parámetro "{1}" hace referencia fuera de su ámbito de declaración.
fr: Impossible d'utiliser un résultat de '{0}' dans ce contexte, car il peut exposer les variables référencées par le paramètre '{1}' en dehors de la portée de leur déclaration
it: Non è possibile usare un risultato di '{0}' in questo contesto perché potrebbe esporre variabili cui viene fatto riferimento dal parametro '{1}' all'esterno dell'ambito della dichiarazione
ja: パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があるため、このコンテキストで '{0}' の結果を使用することはできません
ko: {0}'의 결과는 선언 범위 외부의 '{1}' 매개 변수에서 참조하는 변수를 노출할 수 있으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: Nie można używać wyniku elementu „{0}” w tym kontekście, ponieważ może uwidaczniać zmienne przywoływane przez parametr „{1}” poza ich zakresem deklaracji
pt_br: Não é possível usar um resultado '{0}' nesse contexto porque ele pode expor as variáveis referenciadas pelo parâmetro '{1}' fora do seu escopo de declaração
ru: Результат "{0}" нельзя использовать в этом контексте, так как из-за этого переменные, на которые ссылается параметр "{1}", могут стать доступными за пределами их области объявления.
tr: {0}' sonucu, '{1}' parametresi tarafından başvurulan değişkenleri kendi bildirim kapsamı dışında kullanıma sunabileceğinden bu bağlamda kullanılamaz
zh_hans: 不能在此上下文中使用“{0}”的结果，因为它可能会其声明范围以外公开由参数 {1} 引用的变量
zh_hant: 無法在此內容中使用 '{0}' 的結果，因為它會將參數 '{1}' 參考的變數公開在其宣告範圍外

# ERR_EscapeCall2
source: Cannot use a member of result of '{0}' in this context because it may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: V tomto kontextu nejde použít člena výsledku z {0}, protože může vystavit proměnné, na které odkazuje parametr {1}, mimo jejich rozsah deklarace.
de: Ein Member des Ergebnisses von "{0}" kann in diesem Kontext nicht verwendet werden, weil dadurch vom Parameter "{1}" referenzierte Variablen möglicherweise außerhalb ihres Deklarationsbereichs verfügbar gemacht werden.
es: No se puede usar un miembro del resultado de "{0}" en este contexto porque puede exponer variables a las que el parámetro "{1}" hace referencia fuera de su ámbito de declaración.
fr: Impossible d'utiliser un membre du résultat de '{0}' dans ce contexte, car il peut exposer les variables référencées par le paramètre '{1}' en dehors de la portée de leur déclaration
it: Non è possibile usare un membro del risultato di '{0}' in questo contesto perché potrebbe esporre variabili cui viene fatto riferimento dal parametro '{1}' all'esterno dell'ambito di dichiarazione
ja: パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があるため、このコンテキストで '{0}' の結果のメンバーを使用することはできません
ko: {0}' 결과의 멤버는 선언 범위 외부의 '{1}' 매개 변수에서 참조하는 변수를 노출할 수 있으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: Nie można używać składowej wyniku elementu „{0}” w tym kontekście, ponieważ może uwidaczniać zmienne przywoływane przez parametr „{1}” poza ich zakresem deklaracji
pt_br: Não é possível usar um membro de resultado de '{0}' nesse contexto porque ele pode expor as variáveis referenciadas pelo parâmetro '{1}' fora do seu escopo de declaração
ru: Элемент результата "{0}" нельзя использовать в этом контексте, так как из-за этого переменные, на которые ссылается параметр "{1}", могут стать доступными за пределами их области объявления.
tr: {0}' sonucunun üyesi, '{1}' parametresi tarafından başvurulan değişkenleri kendi bildirim kapsamı dışında kullanıma sunabileceğinden bu bağlamda kullanılamaz
zh_hans: 不能在此上下文中使用“{0}”的结果的成员，因为它可能会其声明范围以外公开由参数 {1} 引用的变量
zh_hant: 無法在此內容中使用 '{0}' 結果的成員，因為它會將參數 '{1}' 參考的變數公開在其宣告範圍外

# ERR_CallArgMixing
source: This combination of arguments to '{0}' is disallowed because it may expose variables referenced by parameter '{1}' outside of their declaration scope
cs: Tato kombinace argumentů pro {0} je zakázaná, protože může vystavit proměnné, na které odkazuje parametr {1}, mimo jejich rozsah deklarace.
de: Diese Kombination von Argumenten für "{0}" ist unzulässig, weil dadurch vom Parameter "{1}" referenzierte Variablen möglicherweise außerhalb ihres Deklarationsbereichs verfügbar gemacht werden.
es: No se permite esta combinación de argumentos para "{0}" porque puede exponer variables a las que el parámetro "{1}" hace referencia fuera de su ámbito de declaración.
fr: Cette combinaison d'arguments pour '{0}' n'est pas autorisée, car elle peut exposer les variables référencées par le paramètre '{1}' en dehors de la portée de leur déclaration
it: Questa combinazione di argomenti di '{0}' non è consentita perché potrebbe esporre variabili cui viene fatto riferimento dal parametro '{1}' all'esterno dell'ambito della dichiarazione
ja: パラメーター '{1}' によって参照される変数が宣言のスコープ外に公開される可能性があるため、'{0}' に対してこの引数の組み合わせは許可されません
ko: {0}'에 대한 이 인수 조합은 선언 범위 외부의 '{1}' 매개 변수에서 참조하는 변수를 노출할 수 있으므로 사용할 수 없습니다.
pl: Ta kombinacja argumentów dla elementu „{0}” jest niedozwolona, ponieważ może uwidaczniać zmienne przywoływane przez parametr „{1}” poza ich zakresem deklaracji
pt_br: Essa combinação de argumentos para '{0}' não é permitida porque ela pode expor as variáveis referenciadas pelo parâmetro '{1}' fora do seu escopo de declaração
ru: Это сочетание аргументов для "{0}" запрещено, так как оно может делать переменные, на которые ссылается параметр "{1}", доступными за пределами их области объявления
tr: {0}', '{1}' parametresi tarafından başvurulan değişkenleri kendi bildirim kapsamı dışında kullanıma sunabileceğinden buna yönelik bağımsız değişken bileşimine izin verilmiyor
zh_hans: 不允许使用“{0}”的这种参数组合，因为它可能会在其声明范围之外公开由参数 {1} 引用的变量
zh_hant: 不允許對 '{0}' 使用此引數組合，因為它會在其宣告範圍外公開參數 '{1}' 所參考的變數

# ERR_MismatchedRefEscapeInTernary
source: Branches of a ref conditional operator cannot refer to variables with incompatible declaration scopes
cs: Větve podmíněného operátoru REF nemůžou odkazovat na proměnné s nekompatibilními obory deklarace.
de: Branches eines bedingten ref-Operators können nicht auf Variablen mit inkompatiblen Deklarationsbereichen verweisen.
es: Las ramas de un operador condicional ref no pueden hacer referencia a variables con ámbitos de declaración incompatibles
fr: Les branches d'un opérateur conditionnel ref ne peuvent pas faire référence à des variables ayant des étendues de déclaration incompatibles
it: I rami di un operatore condizionale ref non possono fare riferimento a variabili con ambiti di dichiarazione incompatibili
ja: Ref 条件演算子のブランチでは、互換性のない宣言スコープを持つ変数を参照できません
ko: ref 조건 연산자의 분기는 호환되지 않는 선언 범위가 포함된 변수를 참조할 수 없습니다.
pl: Gałęzie operatora warunkowego ref nie mogą przywoływać zmiennych z niezgodnymi zakresami deklaracji
pt_br: Ramificações de um operador condicional de referência não podem se referir a variáveis com escopos de declaração incompatíveis
ru: Ветви условного оператора ref не могут ссылаться на переменные с несовместимыми областями объявления
tr: Başvuru koşullu işlecinin dalları, uyumsuz bildirim kapsamları olan değişkenlere başvuramaz
zh_hans: ref 条件运算符的分支不能引用具有不兼容声明范围的变量
zh_hant: Ref 條件運算子的分支不能參考具有不相容宣告範圍的變數
