Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_RawStringNotInDirectives
source: Raw string literals are not allowed in preprocessor directives.
cs: Literály nezpracovaných řetězců nejsou v direktivách preprocesoru povolené.
fr: Les littéraux de chaîne brute ne sont pas autorisés dans les directives de préprocesseur.
it: I valori letterali stringa non elaborati non sono consentiti nelle direttive del preprocessore.
ja: プリプロセッサ ディレクティブでは、生文字列リテラルは使用できません。
pl: Literały nieprzetworzonego ciągu są niedozwolone w dyrektywach preprocesora.
pt_br: Literais de cadeia de caracteres bruta não são permitidas em diretivas de pré-processador.
ru: Литералы необработанных строк не разрешены в директивах препроцессора.
zh_hans: 预处理器指令中不允许使用原始字符串字面量。
zh_hant: 前置處理器指示詞中不允許原始字串常值。

# ERR_ReAbstractionInNoPIAType
source: Type '{0}' cannot be embedded because it has a re-abstraction of a member from base interface. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože má reabstrakci člena ze základního rozhraní. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Typ "{0}" kann nicht eingebettet werden, weil er eine Neuabstraktion eines Members aus der Basisschnittstelle aufweist. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf FALSE fest.
es: El tipo "{0}" no se puede insertar porque tiene una reabstracción de un miembro de la interfaz base. Puede establecer la propiedad "Incrustar tipos de interoperabilidad" en false.
fr: Impossible d'incorporer le type '{0}', car il a une nouvelle abstraction d'un membre de l'interface de base. Affectez la valeur false à la propriété 'Incorporer les types interop'.
it: Non è possibile incorporare il tipo '{0}' perché contiene una nuova astrazione di un membro dell'interfaccia di base. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' には基底インターフェイスからのメンバーの再抽象化があるため、この型を埋め込むことはできません。'相互運用型の埋め込み' プロパティを false に設定することをご検討ください。
ko: '{0}' 형식에는 기본 인터페이스 멤버의 재추상화가 있으므로 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정해 보세요.
pl: Nie można osadzić typu „{0}”, ponieważ zawiera ponowną abstrakcję składowej z interfejsu podstawowego. Rozważ ustawienie właściwości „Osadź typy międzyoperacyjne” na wartość false.
pt_br: O tipo '{0}' não pode ser inserido porque tem uma nova abstração de um membro da interface base. Considere a configuração da propriedade 'Embed Interop Types' como false.
ru: Невозможно внедрить тип "{0}", так как он переопределяет абстракцию элемента базового интерфейса. Попробуйте задать для свойства "Внедрить типы взаимодействия" значение false (ложь).
tr: '{0}' türünün temel arabirimden yeniden soyutlanmış bir üyesi olduğundan bu tür eklenemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入类型“{0}”，因为它有基本接口成员的重新抽象。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 因為類型 '{0}' 有重新抽象成員 (來自基底介面)，所以無法內嵌。請考慮將 [內嵌 Interop 類型] 屬性設為 false。

# ERR_ReadOnlyModMissingAccessor
source: '{0}': 'readonly' can only be used on accessors if the property or indexer has both a get and a set accessor
cs: {0}: U přístupových objektů se modifikátor readonly může použít jenom v případě, že vlastnost nebo indexer má přístupový objekt get i set.
de: {0}: "readonly" kann für Accessoren nur verwendet werden, wenn die Eigenschaft oder der Indexer sowohl einen get- als auch einen set-Accessor aufweist.
es: "{0}": "readonly" solo se puede usar en los descriptores de acceso si la propiedad o el indexador tienen un descriptor de acceso get y set
fr: '{0}' : 'readonly' peut uniquement être utilisé sur des accesseurs si la propriété ou l'indexeur a un accesseur get et un accesseur set
it: '{0}': 'readonly' può essere usato su funzioni di accesso solo se la proprietà o l'indicizzatore include entrambi le funzioni di accesso get e set
ja: '{0}': 'readonly' は、プロパティまたはインデクサーが get および set の両方のアクセサーを含む場合にのみ、アクセサーで使用できます
ko: '{0}': 속성 또는 인덱서에 get 접근자와 set 접근자가 둘 다 있는 경우에만 접근자에 'readonly'를 사용할 수 있습니다.
pl: „{0}”: modyfikatora „readonly” można użyć dla metod dostępu tylko wtedy, gdy właściwość lub indeksator mają metody dostępu get i set
pt_br: '{0}': 'readonly' somente pode ser usado em acessadores quando a propriedade ou o indexador tem um acessador get e um set
ru: "{0}": readonly можно использовать для методов доступа, только если свойство или индексатор имеет оба метода доступа, get и set.
tr: '{0}': 'readonly' erişimcilerde yalnızca özellik veya dizin oluşturucusu hem alma hem ayarlama erişimcisine sahipse kullanılabilir
zh_hans: “{0}”: 仅当属性或索引器同时具有 get 访问器和 set 访问器时，才能对访问器使用 "readonly"
zh_hant: '{0}': 只有在屬性或索引子同時具有 get 和 set 存取子時，才能在存取子上使用 'readonly'

# ERR_ReceiverParameterOnlyOne
source: An extension container can have only one receiver parameter
pt_br: Um contêiner de extensão pode ter apenas um parâmetro de receptor

# ERR_ReceiverParameterSameNameAsTypeParameter
source: '{0}': a receiver parameter cannot have the same name as an extension container type parameter
pt_br: "{0}": um parâmetro de receptor não pode ter o mesmo nome que um parâmetro de tipo de contêiner de extensão

# ERR_RecordAmbigCtor
source: The primary constructor conflicts with the synthesized copy constructor.
cs: Primární konstruktor je v konfliktu se syntetizovaně zkopírovaným konstruktorem.
fr: Le constructeur principal est en conflit avec le constructeur de copie synthétisée.
it: Il costruttore primario è in conflitto con il costruttore di copia sintetizzato.
ja: プライマリ コンストラクターが、合成されたコピー コンストラクターと競合しています。
pl: Konstruktor podstawowy powoduje konflikt z konstruktorem syntetyzowanej kopii.
pt_br: O construtor primário entra em conflito com o construtor de cópia sintetizado.
ru: Первичный конструктор конфликтует с синтезированным конструктором копий.
zh_hans: 主构造函数与合成的复制构造函数冲突。
zh_hant: 主要建構函式與合成的複製建構函式相衝突。

# ERR_RecordStructConstructorCallsDefaultConstructor
source: A constructor declared in a 'struct' with parameter list must have a 'this' initializer that calls the primary constructor or an explicitly declared constructor.
cs: Konstruktor deklarovaný ve „struct“ se seznamem parametrů musí mít inicializátor „this“, který volá primární konstruktor nebo explicitně deklarovaný konstruktor.
fr: Un constructeur déclaré dans un 'struct' avec une liste de paramètres doit avoir un initialiseur 'this' qui appelle le constructeur principal ou un constructeur explicitement déclaré.
it: Un costruttore dichiarato in uno “struct” con elenco di parametri deve avere un inizializzatore “this” che chiama il costruttore primario o un costruttore dichiarato in modo esplicito.
ja: パラメーター リストを使用して 'struct' で宣言されたコンストラクターには、プライマリ コンストラクターまたは明示的に宣言されたコンストラクターを呼び出す 'this' 初期化子が必要です。
pl: Konstruktor zadeklarowany w „strukturze rekordów” z listą parametrów musi mieć inicjator „this”, który wywołuje konstruktor podstawowy lub jawnie zadeklarowany konstruktor.
pt_br: Um construtor declarado em um "struct" com lista de parâmetros deve ter um inicializador "this" que chama o construtor primário ou um construtor explicitamente declarado.
ru: Конструктор, объявленный в "struct" со списком параметров, должен содержать инициализатор "this", вызывающий основной конструктор или явно объявленный конструктор.
zh_hans: 在带有参数列表的“struct”中声明的构造函数必须具有调用主构造函数或显式声明的构造函数的“this”初始化表达式。
zh_hant: 在 'struct' 中宣告、具有參數清單的建構函式，必須有呼叫主要建構函式或已明確宣告建構函式的 'this' 初始設定式。

# ERR_RefAssignNarrower
source: Cannot ref-assign '{1}' to '{0}' because '{1}' has a narrower escape scope than '{0}'.
cs: Přiřazení odkazu {1} k {0} nelze provést, protože {1} má užší řídicí obor než {0}.
de: ref-assign von "{1}" zu "{0}" ist nicht möglich, weil "{1}" einen geringeren Escapebereich als "{0}" aufweist.
es: No se puede asignar referencia "{1}" a "{0}" porque "{1}" tiene un ámbito de escape más limitado que "{0}".
fr: Impossible d'effectuer une assignation par référence de '{1}' vers '{0}', car '{1}' a une portée de sortie plus limitée que '{0}'.
it: Non è possibile assegnare '{1}' a '{0}' come ref perché l'ambito di escape di '{1}' è ridotto rispetto a quello di '{0}'.
ja: '{1}' を '{0}' に ref 割り当てすることはできません。'{1}' のエスケープ スコープが '{0}' より狭いためです。
ko: '{1}'을(를) '{0}'에 참조 할당할 수 없습니다. '{1}'이(가) '{0}'보다 이스케이프 범위가 좁기 때문입니다.
pl: Nie można przypisać odwołania elementu „{1}” do elementu „{0}”, ponieważ element „{1}” ma węższy zakres wyjścia niż element „{0}”.
pt_br: Não é possível atribuir ref '{1}' a '{0}' porque '{1}' tem um escopo de escape mais limitado que '{0}'.
ru: Не удается присвоить по ссылке "{1}" для "{0}", так как escape-область у "{1}" уже, чем у "{0}".
tr: '{1}', '{0}' öğesinden daha dar bir kaçış kapsamı içerdiğinden '{0}' öğesine '{1}' ref ataması yapılamıyor.
zh_hans: 无法将“{1}”重新赋值为“{0}”，因为“{1}”具有比“{0}”更窄的转义范围。
zh_hant: 不能將 '{1}' 參考指派至 '{0}'，因為 '{1}' 的逸出範圍比 '{0}' 還要窄。

# ERR_RefAssignReturnOnly
source: Cannot ref-assign '{1}' to '{0}' because '{1}' can only escape the current method through a return statement.
cs: Není možné znovu přiřadit {1} k {0}, protože {1} může opustit aktuální metodu pouze prostřednictvím příkazu return.
fr: Cette référence ne peut pas effectuer une attribution par référence '{1}' à '{0}', car '{1}' ne peut échapper à la méthode actuelle qu’à l’aide d’une instruction return.
it: Non è possibile assegnare un riferimento '{1}' a '{0}' perché '{1}' può eseguire l'escape solo del metodo corrente tramite un'istruzione return.
ja: '{1}' は return ステートメントを介してのみ現在のメソッドをエスケープできるため、'{1}' を '{0}' に ref 割り当てすることはできません。
pl: Nie można przypisać odwołania „{1}” do „{0}”, ponieważ „{1}” może jedynie opuścić bieżącą metodę za pomocą instrukcji return.
pt_br: Não é possível atribuir '{1}' a '{0}' porque '{1}' só pode escapar do método atual por meio de uma instrução return.
ru: Не удается присвоить по ссылкеь "{1}" для "{0}",так как "{1}" может избежать текущего метода только через оператор return.
zh_hans: 无法将“{1}”ref 分配给“{0}”，因为“{1}”只能通过 return 语句对当前方法进行转义。
zh_hant: 無法將 '{1}' 參考指派至 '{0}'，因為 '{1}' 只能透過 return 陳述式逸出目前的方法。

# ERR_RefAssignValEscapeWider
source: Cannot ref-assign '{1}' to '{0}' because '{1}' has a wider value escape scope than '{0}' allowing assignment through '{0}' of values with narrower escape scopes than '{1}'.
fr: Nous ne pouvons pas effectuer l’affectation de référence de « {1} » vers « {0} », car « {1} » a une étendue d’échappement de valeur plus large que « {0} » permettant l’affectation via « {0} » des valeurs avec des étendues d’échappement plus restreintes que « {1} ».
it: Non è possibile ref-assign '{1}' a '{0}' perché '{1}' ha un ambito di escape del valore più ampio di '{0}' consentendo l'assegnazione tramite '{0}' di valori con ambiti di escape più ristretti rispetto a '{1}'.
pt_br: Não foi possível atribuir com ref "{1}" a "{0}" porque "{1}" tem um escopo de escape mais amplo que "{0}", permitindo a atribuição por meio de "{0}" de valores com escopos de escape mais restritos que "{1}".
ru: Невозможно присвоить ссылку "{1}" на "{0}", так как "{1}" имеет более широкую область экранирования значения, чем "{0}", что позволяет назначать через "{0}" значения с более узкой областью экранирования, чем "{1}".
zh_hans: 无法将“{1}”ref-assign 给“{0}”，因为“{1}”比“{0}”具有更广的值转义范围，允许通过转义范围比“{1}”更窄的值的“{0}”进行赋值。

# ERR_RefExtensionParameterMustBeValueTypeOrConstrainedToOne
source: The 'ref' receiver parameter of an extension block must be a value type or a generic type constrained to struct.
pt_br: O parâmetro de receptor "ref" de um bloco de extensão deve ser um tipo de valor ou um tipo genérico restrito ao struct.

# ERR_RefFieldCannotReferToRefStruct
source: A ref field cannot refer to a ref struct.
cs: Pole ref nemůže odkazovat na hodnotu ref struct.
fr: Un champ ref ne peut pas faire référence à un struct ref.
it: Un campo ref non può fare riferimento a un ref struct.
ja: ref フィールドは ref 構造体を参照できません。
pl: Pole referencyjne nie może odwoływać się do struktury referencyjnej.
pt_br: Um campo ref não pode se referir a um struct ref.
ru: Поле ref не должно ссылаться на ref struct.
zh_hans: ref 字段不能引用 ref 结构。
zh_hant: ref 欄位不能參考 ref 結構。

# ERR_RefFieldInNonRefStruct
source: A ref field can only be declared in a ref struct.
cs: Pole ref lze deklarovat pouze ve struktuře ref.
fr: Un champ de référence ne peut être déclaré que dans une sructure de référence.
it: Un campo ref può essere dichiarato solo in uno struct ref.
ja: ref フィールドは ref 構造体でのみ宣言できます。
pl: Pole referencyjne można zadeklarować tylko w strukturze referencyjnej.
pt_br: Um campo ref só pode ser declarado em uma estrutura ref.
ru: Поле ссылки может быть объявлено только в структуре ссылки.
zh_hans: ref 字段只能在 ref 结构中声明。
zh_hant: ref 欄位只能在 ref 結構中宣告。

# ERR_RefLocalAcrossAwait
source: A 'ref' local cannot be preserved across 'await' or 'yield' boundary.
fr: Un « ref » local ne peut pas être conservé au-delà de la limite « await » ou « yield ».
it: Non è possibile mantenere un 'ref' locale tra 'await' o 'yield'.
pl: Nie można zachować elementu lokalnego „ref” w granicach „await” lub „yield”.
pt_br: Um local "ref" não pode ser preservado entre o limite "await" ou "yield".
ru: Локальный "ref" не может быть сохранен за границей "await" или "yield".
zh_hans: 无法跨 "await" 或 "yield" 边界保留 "ref" 局部变量。
zh_hant: 無法保留 'await' 或 'yield' 界限之間的區域 'ref '。

# ERR_RefLocalOrParamExpected
source: The left-hand side of a ref assignment must be a ref variable.
cs: Levá strana přiřazení odkazu musí být parametr Ref.
fr: Le côté gauche d’une affectation ref doit être une variable ref.
it: La parte sinistra di un'assegnazione ref deve essere una variabile ref.
ja: ref 代入の左辺は ref 変数である必要があります。
pl: Lewa strona przypisania referencyjnego musi być zmienną referencyjną.
pt_br: O lado esquerdo de uma atribuição ref deve ser uma variável ref.
ru: Левая сторона назначения ref должна быть переменной ref.
zh_hans: ref 赋值的左侧必须为 ref 变量。
zh_hant: 參考指派的左側必須為 ref 變數。

# ERR_RefReadOnlyWrongOrdering
source: 'readonly' modifier must be specified after 'ref'.
fr: Vous devez spécifier le modificateur « readonly » après « ref ».
it: È necessario specificare il modificatore 'readonly' dopo 'ref'.
ja: 'readonly' 修飾子は 'ref' の後に指定する必要があります。
pl: Modyfikator „readonly” musi być określony po znaku „ref”.
pt_br: O modificador 'readonly' deve ser especificado após 'ref'.
ru: Модификатор "readonly" должен указываться после "ref".
zh_hans: 必须在 “ref” 后指定 “readonly” 修饰符。
zh_hant: 'readonly' 修飾元必須在 'ref' 之後指定。

# ERR_RefReadonlyPrimaryConstructorParameter
source: A primary constructor parameter of a readonly type cannot be used as a ref or out value (except in init-only setter of the type or a variable initializer)
cs: Parametr primárního konstruktoru typu jen pro čtení nejde použít jako hodnotu odkazu nebo výstupu (s výjimkou nastavovacího kódu typu jenom pro inicializaci nebo inicializátoru proměnné).
fr: Un paramètre de constructeur primaire d’un type en lecture seule ne peut pas être utilisé comme valeur ref ou out (sauf dans le setter init-only du type ou dans un initialisateur de variable).
it: Non è possibile usare un parametro del costruttore primario come valore out o ref di un tipo di sola lettura, tranne che nel setter di sola inizializzazione del tipo o in un inizializzatore di variabile
ja: 読み取り専用型のプライマリ コンストラクター パラメーターは、ref または out 値として使用できません (型または変数初期化子の init 専用セッターを除く)。
pl: Podstawowy parametr konstruktora typu tylko do odczytu nie może być użyty jako wartość ref lub out (z wyjątkiem inicjującego settera typu lub inicjalizatora zmiennej)
pt_br: Um parâmetro de construtor primário de um tipo somente leitura não pode ser usado como um valor ref ou out (exceto no setter somente inicialização do tipo ou em um inicializador de variável)
ru: Параметр основного конструктора типа, доступного только для чтения, нельзя использовать как значение ref или out (за исключением метода задания с типом, предназначенным только для инициализации, или инициализатора переменной)
zh_hans: 只读类型的主构造函数参数不能用作 ref 或 out 值(在该类型的 init-only 设定子或变量初始值设定项中除外)
zh_hant: 唯讀類型的主要建構函式參數不能做為 ref 或 out 值 (類型的 init-only setter 或變數初始設定式中除外)

# ERR_RefReadonlyPrimaryConstructorParameter2
source: Members of primary constructor parameter '{0}' of a readonly type cannot be used as a ref or out value (except in init-only setter of the type or a variable initializer)
cs: Členy parametru primárního konstruktoru {0} typu jen pro čtení nejde použít jako hodnotu odkazu nebo výstupu (s výjimkou nastavovacího kódu typu jenom pro inicializaci nebo inicializátoru proměnné).
fr: Membres d’un paramètre de constructeur primaire '{0}' d’un type en lecture seule ne peut pas être utilisé comme valeur ref ou out (sauf dans le setter init-only du type ou dans un initialisateur de variable).
it: Non è possibile usare i membri del parametro del costruttore primario '{0}' come valore out o ref di un tipo di sola lettura, tranne che nel setter di sola inizializzazione del tipo o in un inizializzatore di variabile
ja: 読み取り専用型のプライマリ コンストラクター パラメーター '{0}' のメンバーを ref または out 値として使用することはできません (型または変数初期化子の init 専用セッターを除く)。
pl: Składowych podstawowego parametru konstruktora '{0}' typu tylko do odczytu nie można używać jako wartości ref ani out (z wyjątkiem inicjującego settera typu lub inicjalizatora zmiennej)
pt_br: Os membros do parâmetro de construtor primário "{0}" de um tipo somente leitura não podem ser usados como um valor ref ou out (exceto no setter somente inicialização do tipo ou em um inicializador de variável)
ru: Элементы параметра основного конструктора "{0}" типа, доступного только для чтения, нельзя использовать как значение ref или out (за исключением метода задания с типом, предназначенным только для инициализации, или инициализатора переменной)
zh_hans: 只读类型的主构造函数参数“{0}”的成员不能用作 ref 或 out 值(在该类型的 init-only 设定子或变量初始值设定项中除外)
zh_hant: 唯讀類型的主要建構函式參數 '{0}' 的成員不能做為 ref 或 out 值 (類型的 init-only setter 或變數初始設定式中除外)

# ERR_RefReturnOnlyParameter
source: Cannot return a parameter by reference '{0}' through a ref parameter; it can only be returned in a return statement
cs: Člen parametru {0} není možné vrátit podle odkazu prostřednictvím parametru odkazu; je ho možné vrátit pouze v příkazu return
fr: Ne peut pas retourner un paramètre par référence '{0}' par le biais d’un paramètre ref ; il ne peut être retourné que dans une instruction return
it: Non è possibile restituire un parametro per riferimento '{0}' tramite un parametro ref; può essere restituito solo in un'istruzione return
ja: ref パラメーター経由で参照渡し '{0}' でパラメーターを返すことはできません。返すことができるのは return ステートメント内のみです
pl: Nie można zwrócić parametru przez odwołanie „{0}” za pomocą parametru ref; można go zwrócić tylko w instrukcji return
pt_br: Não é possível retornar um parâmetro por referência '{0}' por meio de um parâmetro ref; só pode ser retornado em uma instrução return
ru: Не удается вернуть параметр по ссылке "{0}" с помощью параметра ref, его можно вернуть только в операторе return
zh_hans: 无法通过 ref 参数按引用“{0}”返回参数；它只能在 return 语句中返回
zh_hant: 無法透過 ref 參數藉傳址方式傳回參數 '{0}'; 只能在 return 陳述式中傳回

# ERR_RefReturnOnlyParameter2
source: Cannot return by reference a member of parameter '{0}' through a ref parameter; it can only be returned in a return statement
cs: Člen parametru {0} není možné vrátit podle odkazu prostřednictvím parametru odkazu; je ho možné vrátit pouze v příkazu return.
fr: Impossible de retourner par référence un membre du paramètre '{0}' par le biais d’un paramètre ref ; il ne peut être retourné que dans une instruction return
it: Non è possibile restituire per riferimento un membro del parametro '{0}' tramite un parametro ref; può essere restituito solo in un'istruzione return
ja: ref パラメーター経由で '{0}' パラメーターのメンバーを参照渡しで返すことはできません。return ステートメントでのみ返すことができます
pl: Nie można zwrócić przez odwołanie składowej parametru „{0}” za pomocą parametru ref; może on być zwracany tylko w instrukcji return
pt_br: Não é possível retornar por referência um membro do parâmetro '{0}' por meio de um parâmetro ref; só pode ser retornado em uma instrução return
ru: Не удается вернуть элемент параметра "{0}" с помощью параметра ref, его можно вернуть только в операторе return
zh_hans: 无法通过 ref 参数按引用参数“{0}”的成员返回；它只能在 return 语句中返回
zh_hant: 無法透過 ref 參數藉傳址方式傳回參數成員 '{0}'; 只能在 return 陳述式中傳回

# ERR_RefReturnPrimaryConstructorParameter
source: Cannot return primary constructor parameter '{0}' by reference.
cs: Parametr primárního konstruktoru {0} nejde vrátit pomocí odkazu.
fr: Impossible de retourner le paramètre de constructeur principal '{0}' par référence.
it: Non è possibile restituire il parametro del costruttore primario '{0}' per riferimento.
ja: 参照渡しでプライマリ コンストラクター パラメーター '{0}' を返すことはできません。
pl: Nie można zwrócić podstawowego parametru konstruktora '{0}' przez odwołanie.
pt_br: Não é possível retornar o parâmetro de construtor primário "{0}" por referência.
ru: Невозможно вернуть параметр основного конструктора "{0}" с помощью ссылки.
zh_hans: 无法按引用返回主构造函数参数“{0}”。
zh_hant: 無法依參考傳回主要建構函式參數 '{0}'。

# ERR_RefReturnReadonlyPrimaryConstructorParameter
source: A primary constructor parameter of a readonly type cannot be returned by writable reference
cs: Parametr primárního konstruktoru typu jen pro čtení nejde vrátit zapisovatelným odkazem.
fr: Un paramètre de constructeur principal d’un type en lecture seule ne peuvent pas être retournés par une référence accessible en écriture
it: Un parametro del costruttore primario di un tipo di sola lettura non può essere restituito da un riferimento scrivibile
ja: 読み取り専用型のプライマリ コンストラクター パラメーターを書き込み可能な参照で返すことはできません
pl: Podstawowy parametr konstruktora typu tylko do odczytu nie może być zwracany przez zapisywalne odwołanie
pt_br: Um parâmetro de construtor primário de um tipo somente leitura não pode ser retornado por referência gravável
ru: Параметр основного конструктора типа, доступного только для чтения, нельзя вернуть с помощью записываемой ссылки
zh_hans: 可写引用无法返回只读类型的主构造函数参数
zh_hant: 唯讀類型的主要建構函式參數無法由可寫入的參考傳回

# ERR_RefReturnReadonlyPrimaryConstructorParameter2
source: Members of primary constructor parameter '{0}' of a readonly type cannot be returned by writable reference
cs: Členy parametru primárního konstruktoru {0} typu jen pro čtení nejde vrátit zapisovatelným odkazem.
fr: Les membres du paramètre de constructeur principal '{0}' d’un type en lecture seule ne peuvent pas être retournés par une référence accessible en écriture
it: I membri del parametro del costruttore primario '{0}' di un tipo di sola lettura non possono essere restituiti da un riferimento scrivibile
ja: 読み取り専用型のプライマリ コンストラクター パラメーター '{0}' のメンバーを書き込み可能な参照で返すことはできません
pl: Składowe podstawowego parametru konstruktora '{0}' typu tylko do odczytu nie mogą być zwracane przez zapisywalne odwołanie
pt_br: Os membros do parâmetro de construtor primário "{0}" de um tipo somente leitura não podem ser retornados por referência gravável
ru: Элементы параметра основного конструктора "{0}" типа, доступного только для чтения, нельзя вернуть с помощью записываемой ссылки
zh_hans: 可写引用无法返回只读类型的主构造函数参数“{0}”的成员
zh_hant: 唯讀類型的主要建構函式參數 '{0}' 的成員無法由可寫入的參考傳回

# ERR_RefReturnScopedParameter
source: Cannot return a parameter by reference '{0}' because it is scoped to the current method
cs: Parametr není možné vrátit podle odkazu {0}, protože je přiřazen k aktuální metodě.
fr: Impossible de retourner un paramètre par référence '{0}', car il est étendu à la méthode actuelle
it: Non è possibile restituire un parametro per riferimento '{0}' perché ha come ambito il metodo corrente
ja: 現在のメソッドに範囲指定されているため、参照渡し '{0}' でパラメーターを返すことはできません
pl: Nie można zwrócić parametru przez odwołanie „{0}”, ponieważ jest on ograniczony do bieżącej metody
pt_br: Não é possível retornar um parâmetro por referência '{0}' porque ele está no escopo do método atual
ru: Не удается вернуть параметр по ссылке "{0}", так как он имеет область действия текущего метода
zh_hans: 无法按引用“{0}”返回参数，因为它的作用域为当前方法
zh_hant: 無法藉傳址方式 '{0}' 傳回參數，因為它的範圍是目前的方法
