Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_InlineArraySliceNotUsed
source: Inline array 'Slice' method will not be used for element access expression.
fr: La méthode « Slice » du tableau inlined ne sera pas utilisée pour l’expression d’accès à l’élément.
it: Il metodo 'Slice' della matrice inline non verrà usato per l'espressione di accesso agli elementi.
ja: インライン配列 'Slice' メソッドは要素アクセス式には使用されません。
pl: Metoda „Slice” tablicy wbudowanej nie będzie używana dla wyrażenia dostępu do elementu.
pt_br: O método 'Slice' da matriz em linha não será usado para a expressão de acesso ao elemento.
ru: Метод "Slice" встроенного массива не будет использоваться для выражения доступа к элементу.
zh_hans: 内联数组 “Slice” 方法将不会用于元素访问表达式。
zh_hant: 內嵌陣列 'Slice' 方法不會用於元素存取運算式。

# WRN_InlineArraySliceNotUsed_Title
source: Inline array 'Slice' method will not be used for element access expression.
fr: La méthode « Slice » du tableau inlined ne sera pas utilisée pour l’expression d’accès à l’élément.
it: Il metodo 'Slice' della matrice inline non verrà usato per l'espressione di accesso agli elementi.
ja: インライン配列 'Slice' メソッドは要素アクセス式には使用されません。
pl: Metoda „Slice” tablicy wbudowanej nie będzie używana dla wyrażenia dostępu do elementu.
pt_br: O método 'Slice' da matriz em linha não será usado para a expressão de acesso ao elemento.
ru: Метод "Slice" встроенного массива не будет использоваться для выражения доступа к элементу.
zh_hans: 内联数组 “Slice” 方法将不会用于元素访问表达式。
zh_hant: 內嵌陣列 'Slice' 方法不會用於元素存取運算式。

# WRN_HidingDifferentRefness
source: Reference kind modifier of parameter '{0}' doesn't match the corresponding parameter '{1}' in hidden member.
fr: Le modificateur de genre de référence du paramètre « {0} » ne correspond pas au paramètre « {1} » correspondant dans le membre masqué.
it: Il modificatore del tipo di riferimento del parametro '{0}' non corrisponde al parametro corrispondente '{1}' nel membro nascosto.
ja: パラメーター '{0}' の参照の種類修飾子が、非表示のメンバーの対応するパラメーター '{1}' と一致しません。
pl: Modyfikator rodzaju odwołania parametru „{0}” nie pasuje do odpowiadającego mu parametru „{1}” w ukrytej składowej.
pt_br: O modificador de tipo de referência do parâmetro '{0}' não corresponde ao parâmetro '{1}' correspondente no membro oculto.
ru: Модификатор типа ссылки параметра "{0}" не совпадает с соответствующим параметром "{1}" в скрытом элементе.
zh_hans: 参数“{0}”的引用类型修饰符与隐藏成员中的相应参数“{1}”不匹配。
zh_hant: 參數 '{0}' 的參考種類修飾元不符合隱藏成員中的對應參數 '{1}'。

# WRN_HidingDifferentRefness_Title
source: Reference kind modifier of parameter doesn't match the corresponding parameter in hidden member.
fr: Le modificateur de genre de référence du paramètre ne correspond pas au paramètre correspondant dans le membre masqué.
it: Il modificatore del tipo di riferimento del parametro non corrisponde al parametro corrispondente nel membro nascosto.
ja: パラメーターの参照の種類の修飾子が、非表示のメンバーの対応するパラメーターと一致しません。
pl: Modyfikator rodzaju odwołania parametru nie pasuje do odpowiedniego parametru w ukrytym elemencie członkowskim.
pt_br: O modificador de tipo de referência do parâmetro não corresponde ao parâmetro correspondente no membro oculto.
ru: Модификатор типа ссылки параметра не совпадает с соответствующим параметром в скрытом элементе.
zh_hans: 参数的引用类型修饰符与隐藏成员中的相应参数不匹配。
zh_hant: 參數的參考種類修飾元不符合隱藏成員中的對應參數。

# WRN_InterceptorSignatureMismatch
source: Intercepting a call to '{0}' with interceptor '{1}', but the signatures do not match.
fr: Interception d'un appel à '{0}' avec l'intercepteur '{1}', mais les signatures ne correspondent pas.
it: Intercettazione di una chiamata a '{0}' con l'intercettore '{1}', ma le firme non corrispondono.
ja: インターセプター '{1}' を使用して'{0}' への呼び出しをインターセプトしていますが、署名が一致しません。
pl: Przechwytywanie wywołania do „{0}” za pomocą interceptora „{1}”, ale sygnatury nie są zgodne.
pt_br: Interceptando uma chamada para '{0}' com interceptador '{1}', mas as assinaturas não coincidem.
ru: Перехват вызова ' {0} ' с перехватчиком ' {1} ', но подписи не совпадают.
zh_hans: 正在使用侦听器“{1}”截获对“{0}”的调用，但签名不匹配。
zh_hant: 正在使用攔截器 '{1}' 攔截對 '{0}' 的呼叫，但簽章不相符。

# WRN_InterceptorSignatureMismatch_Title
source: Signatures of interceptable and interceptor methods do not match.
fr: Les signatures des méthodes interceptable et intercepteur ne correspondent pas.
it: Le firme dei metodi intercettabili e intercettori non corrispondono.
ja: インターセプター可能なメソッドとインターセプター メソッドの署名が一致しません。
pl: Podpisy metody możliwej do przechwycenia i metody interceptora nie są zgodne.
pt_br: As assinaturas de métodos interceptáveis e interceptador não coincidem.
ru: Сигнатуры методов перехвата и перехватчика не совпадают.
zh_hans: 可截获方法和侦听器方法的签名不匹配。
zh_hant: 可攔截與攔截器方法的簽章不相符。

# WRN_InterceptsLocationAttributeUnsupportedSignature
source: 'InterceptsLocationAttribute(string, int, int)' is not supported. Move to 'InterceptableLocation'-based generation of these attributes instead. (https://github.com/dotnet/roslyn/issues/72133)
fr: 'InterceptsLocationAttribute(string, int, int)' n’est pas pris en charge. Déplacez plutôt vers la génération basée sur InterceptableLocation de ces attributs. (https://github.com/dotnet/roslyn/issues/72133)
it: 'InterceptsLocationAttribute(string, int, int)' non è supportato. Passare alla generazione di questi attributi basata su 'InterceptableLocation'. (https://github.com/dotnet/roslyn/issues/72133)
pt_br: Não há suporte para 'InterceptsLocationAttribute(string, int, int)'. Mova para a geração baseada em 'InterceptableLocation' desses atributos. (https://github.com/dotnet/roslyn/issues/72133)
ru: Атрибут InterceptsLocationAttribute(string, int, int)" не поддерживается. Вместо этого перейдите в поколение этих атрибутов на основе InterceptableLocation. (https://github.com/dotnet/roslyn/issues/72133)
zh_hans: 不支持 “InterceptsLocationAttribute(string， int， int)”。改为移动到基于 “InterceptableLocation” 的这些属性的生成。(https://github.com/dotnet/roslyn/issues/72133)

# WRN_InterceptsLocationAttributeUnsupportedSignature_Title
source: 'InterceptsLocationAttribute(string, int, int)' is not supported. Move to 'InterceptableLocation'-based generation of these attributes instead. (https://github.com/dotnet/roslyn/issues/72133)
fr: 'InterceptsLocationAttribute(string, int, int)' n’est pas pris en charge. Déplacez plutôt vers la génération basée sur InterceptableLocation de ces attributs. (https://github.com/dotnet/roslyn/issues/72133)
it: 'InterceptsLocationAttribute(string, int, int)' non è supportato. Passare alla generazione di questi attributi basata su 'InterceptableLocation'. (https://github.com/dotnet/roslyn/issues/72133)
pt_br: Não há suporte para 'InterceptsLocationAttribute(string, int, int)'. Mova para a geração baseada em 'InterceptableLocation' desses atributos. (https://github.com/dotnet/roslyn/issues/72133)
ru: Атрибут InterceptsLocationAttribute(string, int, int)" не поддерживается. Вместо этого перейдите в поколение этих атрибутов на основе InterceptableLocation. (https://github.com/dotnet/roslyn/issues/72133)
zh_hans: 不支持 “InterceptsLocationAttribute(string， int， int)”。改为移动到基于 “InterceptableLocation” 的这些属性的生成。(https://github.com/dotnet/roslyn/issues/72133)

# WRN_InterpolatedStringHandlerArgumentAttributeIgnoredOnLambdaParameters
source: InterpolatedStringHandlerArgument has no effect when applied to lambda parameters and will be ignored at the call site.
cs: Argument InterpolatedStringHandlerArgument nemá při použití u parametrů lambda žádný účinek a bude se ignorovat v lokalitě volání.
fr: InterpolatedStringHandlerArgument n’a aucun effet lorsqu’il est appliqué aux paramètres lambda et qu’il est ignoré sur le site d’appel.
it: InterpolatedStringHandlerArgument non ha alcun effetto se viene applicato ai parametri lambda e verrà ignorato nel sito di chiamata.
ja: ラムダ パラメーターに適用しても InterpolatedStringHandlerArgument は効果がありません。呼び出しサイトでは無視されます。
pl: Argument InterpolatedStringHandlerArgument nie odniesie żadnego skutku po zastosowaniu do parametrów lambda i zostanie zignorowany w lokacji wywołania.
pt_br: InterpolatedStringHandlerArgument não tem efeito quando aplicado a parâmetros lambda e será ignorado no local de chamada.
ru: Атрибут InterpolatedStringHandlerArgument не действует при применении к лямбда-параметрам и будет проигнорирован на сайте вызова.
zh_hans: 应用于 lambda 参数时，InterpolatedStringHandlerArgument 不起任何作用，并将在调用站点被忽略。
zh_hant: InterpolatedStringHandlerArgument 在套用至 Lambda 參數時沒有效果，將於呼叫網站忽略。

# WRN_InterpolatedStringHandlerArgumentAttributeIgnoredOnLambdaParameters_Title
source: InterpolatedStringHandlerArgument has no effect when applied to lambda parameters and will be ignored at the call site.
cs: Argument InterpolatedStringHandlerArgument nemá při použití u parametrů lambda žádný účinek a bude se ignorovat v lokalitě volání.
fr: InterpolatedStringHandlerArgument n’a aucun effet lorsqu’il est appliqué aux paramètres lambda et qu’il est ignoré sur le site d’appel.
it: InterpolatedStringHandlerArgument non ha alcun effetto se viene applicato ai parametri lambda e verrà ignorato nel sito di chiamata.
ja: ラムダ パラメーターに適用しても InterpolatedStringHandlerArgument は効果がありません。呼び出しサイトでは無視されます。
pl: Argument InterpolatedStringHandlerArgument nie odniesie żadnego skutku po zastosowaniu do parametrów lambda i zostanie zignorowany w lokacji wywołania.
pt_br: InterpolatedStringHandlerArgument não tem efeito quando aplicado a parâmetros lambda e será ignorado no local de chamada.
ru: Атрибут InterpolatedStringHandlerArgument не действует при применении к лямбда-параметрам и будет проигнорирован на сайте вызова.
zh_hans: 应用于 lambda 参数时，InterpolatedStringHandlerArgument 不起任何作用，并将在调用站点被忽略。
zh_hant: InterpolatedStringHandlerArgument 在套用至 Lambda 參數時沒有效果，將於呼叫網站忽略。

# WRN_LowerCaseTypeName
source: The type name '{0}' only contains lower-cased ascii characters. Such names may become reserved for the language.
cs: Název typu {0} obsahuje jenom malá písmena ASCII. Tyto názvy se můžou stát vyhrazenými pro daný jazyk.
fr: Le nom de type '{0}' contient uniquement des caractères ascii en minuscules. De tels noms peuvent devenir réservés pour la langue.
it: Il nome del tipo '{0}' contiene solo caratteri ascii minuscoli. Tali nomi possono diventare riservati per la lingua.
ja: 型名 '{0}' には、小文字の ASCII 文字のみが含まれています。このような名前は、プログラミング言語用に予約されている可能性があります。
pl: Nazwa typu „{0}” zawiera tylko małe litery ascii. Takie nazwy mogą zostać zarezerwowane dla języka.
pt_br: O nome do tipo '{0}' contém apenas caracteres ascii em caixa baixa. Esses nomes podem ficar reservados para o idioma.
ru: Имя типа "{0}" содержит только строчные символы ASCII. Такие имена могут резервироваться для языка.
zh_hans: 类型名称 "{0}" 仅包含小写 ascii 字符。此类名称可能会成为该语言的保留值。
zh_hant: 類型名稱 '{0}' 只包含小寫的 ASCII 字元。此類名稱可能保留供此語言使用。

# WRN_LowerCaseTypeName_Title
source: The type name only contains lower-cased ascii characters. Such names may become reserved for the language.
cs: Název typu obsahuje jenom malá písmena ASCII. Tyto názvy se můžou stát vyhrazenými pro daný jazyk.
fr: Le nom de type contient uniquement des caractères ascii en minuscules. De tels noms peuvent devenir réservés pour la langue.
it: Il nome del tipo contiene solo caratteri ascii minuscoli. Tali nomi possono diventare riservati per la lingua.
ja: 型名には、小文字の ASCII 文字のみが含まれています。このような名前は、プログラミング言語用に予約されている可能性があります。
pl: Nazwa typu zawiera tylko małe litery ascii. Takie nazwy mogą zostać zarezerwowane dla języka.
pt_br: O nome do tipo contém apenas caracteres ascii em caixa baixa. Esses nomes podem ficar reservados para o idioma.
ru: Имя типа содержит только строчные символы ASCII. Такие имена могут резервироваться для языка.
zh_hans: 该类型名称仅包含小写 ascii 字符。此类名称可能会成为该语言的保留值。
zh_hant: 類型名稱只包含小寫的 ASCII 字元。此類名稱可能保留供此語言使用。

# WRN_ManagedAddr
source: This takes the address of, gets the size of, or declares a pointer to a managed type ('{0}')
cs: Přebírá adresu, získává velikost nebo deklaruje ukazatel na spravovaný typ ({0})
fr: Peut prendre l'adresse, obtenir la taille ou déclarer un pointeur vers un type managé ('{0}')
it: Prende l'indirizzo di, ottiene le dimensioni di o dichiara un puntatore a un tipo gestito ('{0}')
ja: これは、マネージ型 ('{0}') のアドレスの取得、サイズの取得、またはそのマネージ型へのポインターの宣言を行います
pl: Przyjmuje adres, pobiera rozmiar lub deklaruje wskaźnik do typu zarządzanego („{0}”)
pt_br: Isso pega o endereço, obtém o tamanho ou declara um ponteiro para um tipo gerenciado ('{0}')
ru: Это принимает адрес, получает размер или объявляет указатель на управляемый тип ('{0}')
zh_hans: 这会获取托管类型(“{0}”)的地址、获取其大小或声明指向它的指针
zh_hant: 這會取得 Managed 類型 ('{0}') 的位址、大小，或宣告指向它的指標

# WRN_ManagedAddr_Title
source: This takes the address of, gets the size of, or declares a pointer to a managed type
cs: Přebírá adresu, získává velikost nebo deklaruje ukazatel na spravovaný typ
fr: Peut prendre l'adresse, obtenir la taille ou déclarer un pointeur vers un type managé
it: Prende l'indirizzo di, ottiene le dimensioni di o dichiara un puntatore a un tipo gestito
ja: これは、マネージ型のアドレスの取得、サイズの取得、またはそのマネージ型へのポインターの宣言を行います
pl: Przyjmuje adres, pobiera rozmiar lub deklaruje wskaźnik do typu zarządzanego
pt_br: Isso pega o endereço, obtém o tamanho ou declara um ponteiro para um tipo gerenciado
ru: Это принимает адрес, получает размер или объявляет указатель на управляемый тип
zh_hans: 这会获取托管类型的地址、获取其大小或声明指向它的指针
zh_hant: 這會取得 Managed 類型的位址、大小，或宣告指向它的指標

# WRN_MethGrpToNonDel
source: Converting method group '{0}' to non-delegate type '{1}'. Did you intend to invoke the method?
cs: Převádí se skupina metod {0} na nedelegující typ {1}. Chtěli jste volat tuto metodu?
fr: Impossible de convertir le groupe de méthodes '{0}' en type non-délégué '{1}'. Souhaitiez-vous appeler la méthode?
it: Conversione del gruppo di metodi '{0}' nel tipo non delegato '{1}'. Si intendeva richiamare il metodo?
ja: メソッド グループ '{0}' を非デリゲート型 '{1}' に変換中です。このメソッドを呼び出すつもりでしたか?
pl: Konwertowanie grupy metod „{0}” na typ inny niż delegowany „{1}”. Czy zamierzasz wywołać metodę?
pt_br: Convertendo grupo de métodos '{0}' em tipo não delegado '{1}'. Você pretendia invocar o método?
ru: Преобразование группы методов "{0}" в незаменяемый тип "{1}". Вы намеревались вызвать этот метод?
zh_hans: 将方法组“{0}”转换为非委托类型“{1}”。是否希望调用此方法?
zh_hant: 將方法群組 '{0}' 轉換成非委派類型 '{1}'。原本希望叫用該方法嗎?

# WRN_MethGrpToNonDel_Title
source: Converting method group to non-delegate type
cs: Převádí se skupina metod na nedelegující typ.
fr: Conversion d’un groupe de méthodes en type non-délégué
it: Conversione del gruppo di metodi in un tipo non delegato
ja: メソッド グループを非デリゲート型に変換しています
pl: Konwertowanie grupy metod na typ inny niż delegowany
pt_br: Convertendo grupo de método em tipo não delegado
ru: Преобразование группы методов в незаменямый тип
zh_hans: 将方法组转换为非委托类型
zh_hant: 將方法群組轉換為非委派類型

# WRN_MismatchedRefEscapeInTernary
source: The branches of the ref conditional operator refer to variables with incompatible declaration scopes
cs: Větve podmíněného operátoru odkazu odkazují na proměnné s nekompatibilními obory deklarací
fr: Les branches d'un opérateur conditionnel ref font référence à des variables ayant des étendues de déclaration incompatibles
it: I rami dell'operatore condizionale di riferimento fanno riferimento a variabili con ambiti di dichiarazione incompatibili
ja: ref 条件演算子のブランチでは、互換性のない宣言スコープを持つ変数を参照します
pl: Gałęzie operatora warunkowego ref nie mogą przywoływać zmiennych z niezgodnymi zakresami deklaracji
pt_br: As ramificações do operador condicional ref referem-se a variáveis com escopos de declaração incompatíveis
ru: Ветви условного оператора ref ссылаются на переменные с несовместимыми областями объявления.
zh_hans: ref 条件运算符的分支引用具有不兼容声明范围的变量
zh_hant: Ref 條件運算子的分支參考具有不相容宣告範圍的變數

# WRN_MismatchedRefEscapeInTernary_Title
source: The branches of the ref conditional operator refer to variables with incompatible declaration scopes
cs: Větve podmíněného operátoru odkazu odkazují na proměnné s nekompatibilními obory deklarací
fr: Les branches d'un opérateur conditionnel ref font référence à des variables ayant des étendues de déclaration incompatibles
it: I rami dell'operatore condizionale di riferimento fanno riferimento a variabili con ambiti di dichiarazione incompatibili
ja: ref 条件演算子のブランチでは、互換性のない宣言スコープを持つ変数を参照します
pl: Gałęzie operatora warunkowego ref nie mogą przywoływać zmiennych z niezgodnymi zakresami deklaracji
pt_br: As ramificações do operador condicional ref referem-se a variáveis com escopos de declaração incompatíveis
ru: Ветви условного оператора ref ссылаются на переменные с несовместимыми областями объявления.
zh_hans: ref 条件运算符的分支引用具有不兼容声明范围的变量
zh_hant: Ref 條件運算子的分支參考具有不相容宣告範圍的變數

# WRN_NullabilityMismatchInParameterTypeOnInterceptor
source: Nullability of reference types in type of parameter '{0}' doesn't match interceptable method '{1}'.
fr: La possibilité de nullité des types de référence dans le type de paramètre '{0}' ne correspond pas à la méthode interceptable '{1}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' non corrisponde al membro implementato '{1}'.
ja: パラメーター '{0}' の型における参照型の Null 許容性が、インターセプト可能なメソッド '{1}' と一致しません。
pl: Obsługa wartości null dla typów odwołania w typie parametru „{0}” jest niezgodna z metodą możliwą do przechwycenia „{1}”.
pt_br: A nulidade dos tipos de referência no tipo de parâmetro '{0}' não corresponde ao método interceptável '{1}'.
ru: Обнуляемость ссылочных типов в типе параметра ' {0} ' не соответствует перехватываемому методу ' {1} '.
zh_hans: 参数“{0}”的类型中引用类型的为 Null 性与可截获的方法“{1}”不匹配。
zh_hant: 參數 '{0}' 類型中參考類型的可為 Null 性與攔截的方法 '{1}' 不相符。

# WRN_NullabilityMismatchInParameterTypeOnInterceptor_Title
source: Nullability of reference types in type of parameter doesn't match interceptable method.
fr: La possibilité de nullité des types de référence dans le type de paramètre ne correspond pas à la méthode interceptable.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al metodo intercettabile.
ja: パラメーターの型における参照型の Null 許容性が、インターセプト可能なメソッドと一致しません。
pl: Obsługa wartości null dla typów odwołania w typie parametru jest niezgodna z metodą możliwą do przechwycenia.
pt_br: A anulabilidade dos tipos de referência em tipo de parâmetro não corresponde ao membro implementado.
ru: Обнуляемость ссылочных типов в типе параметра не соответствует перехватываемому методу.
zh_hans: 参数类型中引用类型的为 Null 性与可截获的方法不匹配。
zh_hant: 參數類型中參考類型的可為 Null 性與攔截的方法不相符。

# WRN_NullabilityMismatchInReturnTypeOnInterceptor
source: Nullability of reference types in return type doesn't match interceptable method '{0}'.
fr: La possibilité de nullité des types de référence dans le type de retour ne correspond pas à la méthode interceptable '{0}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato '{0}'.
ja: 戻り値の型における参照型の Null 許容性が、インターセプト可能なメソッド '{0}' と一致しません。
pl: Obsługa wartości null dla typów odwołania w typie zwracanym jest niezgodna z metodą możliwą do przechwycenia „{0}”.
pt_br: A nulidade dos tipos de referência no tipo de retorno não corresponde ao método interceptável '{0}'.
ru: Обнуляемость ссылочных типов в возвращаемом типе не соответствует перехватываемому методу ' {0} '.
zh_hans: 返回类型中引用类型的为 Null 性与可截获的方法“{0}”不匹配。
zh_hant: 傳回類型中參考類型的可為 Null 性與攔截的方法 '{0}'.不相符。

# WRN_NullabilityMismatchInReturnTypeOnInterceptor_Title
source: Nullability of reference types in return type doesn't match interceptable method.
fr: La possibilité de nullité des types de référence dans le type de retour ne correspond pas à la méthode interceptable.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al metodo intercettabile.
ja: 戻り値の型における参照型の Null 許容性が、インターセプト可能なメソッドと一致しません。
pl: Obsługa wartości null dla typów odwołania w typie zwracanym jest niezgodna z metodą możliwą do przechwycenia.
pt_br: A nulidade dos tipos de referência no tipo de retorno não corresponde ao método interceptável.
ru: Обнуляемость ссылочных типов в возвращаемом типе не соответствует перехватываемому методу.
zh_hans: 返回类型中引用类型的为 Null 性与可截获的方法不匹配。
zh_hant: 傳回類型中參考類型的可為 Null 性與攔截的方法不相符。

# WRN_ObsoleteMembersShouldNotBeRequired
source: Required member '{0}' should not be attributed with 'ObsoleteAttribute' unless the containing type is obsolete or all constructors are obsolete.
cs: Požadovaný člen {0} by neměl být přiřazen atributem ObsoleteAttribute, pokud není obsahující typ zastaralý nebo jsou zastaralé všechny konstruktory.
fr: Le membre obligatoire '{0}' ne doit pas être attribué avec 'ObsoleteAttribute', sauf si le type conteneur est obsolète ou si tous les constructeurs sont obsolètes.
it: Al membro obbligatorio '{0}' non deve essere attribuito 'ObsoleteAttribute' a meno che il tipo contenitore sia obsoleto o che tutti i costruttori siano obsoleti.
ja: 必要なメンバー '{0}' は、包含する型が古い形式であるか、すべてのコンストラクターが古い形式でない限り、属性 'ObsoleteAttribute' が必要ありません。
pl: Wymagana składowa „{0}” nie powinna mieć atrybutu „ObsoleteAttribute”, chyba że zawierający typ jest przestarzały lub wszystkie konstruktory są przestarzałe.
pt_br: Os membros requeridos '{0}' não devem ser atribuídos com 'ObsoleteAttribute', a menos que o tipo que o contém seja obsoleto ou que todos os construtores estejam obsoletos.
ru: У обязательного элемента "{0}" не должно быть атрибута "ObsoleteAttribute", если содержащий тип или все конструкторы не являются устаревшими.
zh_hans: 除非包含类型已过时或所有构造函数已过时，否则不应将所需的成员'{0}'归属于 'ObsoleteAttribute'。
zh_hant: 除非包含的類型已過時或所有建構函式已過時，否則必要成員 '{0}' 的屬性不應為 'ObsoleteAttribute'。

# WRN_ObsoleteMembersShouldNotBeRequired_Title
source: Members attributed with 'ObsoleteAttribute' should not be required unless the containing type is obsolete or all constructors are obsolete.
cs: Členy s atributem ObsoleteAttribute by se neměly vyžadovat, pokud není nadřazený typ zastaralý nebo nejsou všechny konstruktory zastaralé.
fr: Les membres attribués avec 'ObsoleteAttribute' ne doivent pas être obligatoires, sauf si le type conteneur est obsolète ou si tous les constructeurs sont obsolètes.
it: I membri con attributo 'ObsoleteAttribute' non devono essere obbligatori a meno che il tipo contenitore sia obsoleto o che tutti i costruttori siano obsoleti.
ja: 'ObsoleteAttribute' 属性を持つメンバーは、包含する型が古い形式であるか、すべてのコンストラクターが古い形式でない限り、必要ありません。
pl: Składowe z atrybutem „ObsoleteAttribute” nie powinny być wymagane, chyba że typ zawierający jest przestarzały lub wszystkie konstruktory są przestarzałe.
pt_br: Os membros atribuídos com 'ObsoleteAttribute' não devem ser requeridos, a menos que o tipo que o contém seja obsoleto ou que todos os construtores estejam obsoletos.
ru: Элементы с атрибутом "ObsoleteAttribute" не должны быть обязательными, если содержащий тип или все конструкторы не являются устаревшими.
zh_hans: 不应要求使用 'ObsoleteAttribute' 特性化的成员，除非包含类型已过时或所有构造函数已过时。
zh_hant: 除非包含的類型已過時或所有建構函式已過時，否則不應要求具有 'ObsoleteAttribute' 屬性的成員。

# WRN_OptionalParamValueMismatch
source: Parameter {0} has default value '{1:10}' in lambda but '{2:10}' in the target delegate type.
cs: Parametr {0} má výchozí hodnotu {1:10} ve výrazu lambda, ale v cílovém typu delegáta má {2:10}.
fr: Le paramètre {0} a une valeur par défaut '{1:10}' dans l’expression lambda, mais a '{2:10}' dans le type délégué cible.
it: Il parametro {0} ha il valore predefinito '{1:10}' nell'espressione lambda ma '{2:10}' nel tipo delegato di destinazione.
ja: パラメーター {0} のラムダでの既定値は '{1:10}' だが、ターゲットデリゲート型では '{2:10}' です。
pl: Parametr {0} ma wartość domyślną „{1:10}” w wyrażeniu lambda, ale wartość „{2:10}” w docelowym typie delegata.
pt_br: O parâmetro {0} tem o valor padrão '{1:10}' em lambda, mas '{2:10}' no tipo delegado de destino.
ru: Параметр {0} имеет значение по умолчанию "{1:10}" в лямбде, но "{2:10}" в типе целевого делегата.
zh_hans: 参数 {0} 在 lambda 中具有默认值 "{1:10}"，但在目标委托类型中为 "{2:10}"。
zh_hant: 參數 {0} 在 Lambda 中的預設值為 '{1:10}'，但在目標委派類型中為 '{2:10}'。
