Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_UnsupportedTransparentIdentifierAccess
source: Transparent identifier member access failed for field '{0}' of '{1}'. Does the data being queried implement the query pattern?
cs: U pole {0} v {1} selhal přístup pro členy s transparentním identifikátorem. Implementují dotazovaná data vzor dotazu?
de: Fehler beim transparenten Bezeichnermemberzugriff für Feld "{0}" von "{1}". Implementieren die abgefragten Daten das Abfragemuster?
es: Error en el acceso del miembro de identificador transparente para el campo '{0}' de '{1}'. ¿Los datos consultados implementan el patrón de consulta?
fr: Échec de l'accès de membre à identificateur transparent pour le champ '{0}' de '{1}'. Les données interrogées implémentent-elles le modèle de requête ?
it: L'accesso al membro identificatore trasparente non è riuscito per il campo '{0}' di '{1}'. I dati su cui eseguire la query implementano il modello di query?
ja: '{1}' のフィールド '{0}' で透過識別子のメンバーのアクセスに失敗しました。クエリされているデータはクエリ パターンを実装しますか?
ko: 투명 식별자 멤버가 '{1}'의 '{0}' 필드에 액세스하지 못했습니다. 데이터가 쿼리 패턴 구현에 쿼리되었습니까?
pl: Dostęp do składowej z użyciem przezroczystego identyfikatora dla pola „{0}” typu „{1}” nie powiódł się. Czy odpytywane dane implementują wzorzec zapytania?
pt_br: Falha no acesso de membro de identificador transparente para o campo "{0}" de "{1}". Os dados que estão sendo consultados implementam o padrão de consulta?
ru: Сбой при доступе к прозрачному члену идентификатора для поля "{0}" из "{1}". Запрашиваемые данные реализуют шаблон запроса?
tr: Saydam tanımlayıcı üyesi erişimi '{1}' öğesinin '{0}' alanı için başarısız oldu. Sorgulanan veriler sorgu kalıbını uyguluyor mu?
zh_hans: 针对“{1}”的字段“{0}”的透明标识符成员访问失败。所查询的数据是否实现查询模式?
zh_hant: 透明識別項成員存取 '{1}' 的欄位 '{0}' 失敗。目前正在查詢的資料是否會實作查詢模式?

# ERR_ParamDefaultValueDiffersFromAttribute
source: The parameter has multiple distinct default values.
cs: Parametr má víc odlišných výchozích hodnot.
de: Der Parameter weist mehrere eindeutige Standardwerte auf.
es: El parámetro tiene varios valores predeterminados distintos.
fr: Le paramètre contient plusieurs valeurs par défaut distinctes.
it: Il parametro ha più valori predefiniti distinct.
ja: パラメーターに複数の異なる既定値があります。
ko: 매개 변수에 고유한 기본값이 여러 개 있습니다.
pl: Parametr ma wiele różnych domyślnych wartości.
pt_br: O parâmetro tem vários valores padrão diferentes.
ru: Параметр имеет несколько различных значений по умолчанию.
tr: Parametrenin birden çok farklı varsayılan değeri var.
zh_hans: 参数具有多个不同的默认值。
zh_hant: 此參數有多個相異的預設值。

# ERR_FieldHasMultipleDistinctConstantValues
source: The field has multiple distinct constant values.
cs: Pole má víc odlišných konstantních hodnot.
de: Das Feld weist mehrere eindeutige konstante Werte auf.
es: El campo tiene varios valores constantes distintos.
fr: Le champ contient plusieurs valeurs de constante distinctes.
it: Il campo ha più valori costanti distinct.
ja: フィールドに複数の異なる定数値があります。
ko: 필드에 고유한 상수 값이 여러 개 있습니다.
pl: Pole ma wiele unikatowych wartości stałych.
pt_br: O campo tem vários valores constantes distintos.
ru: Поле имеет несколько различных константных значений.
tr: Alanın birden fazla farklı sabit değeri vardır.
zh_hans: 字段具有多个不同的常量值。
zh_hant: 此欄位有多個相異的常數值。

# WRN_UnqualifiedNestedTypeInCref
source: Within cref attributes, nested types of generic types should be qualified.
cs: V atributech cref by měly být kvalifikované vnořené typy obecných typů.
de: In cref-Attributen sollten geschachtelte, generische Typen qualifiziert werden.
es: Dentro de los atributos cref, se deben calificar los tipos anidados de los tipos genéricos.
fr: Dans les attributs cref, les types imbriqués de types génériques doivent être qualifiés.
it: Negli attributi cref è necessario qualificare i tipi annidati di tipi generici.
ja: 属性 cref 内では、入れ子型のジェネリック型を修飾する必要があります。
ko: cref 특성 내에서 제네릭 형식의 중첩 형식은 정규화되어야 합니다.
pl: W ramach atrybutów cref zagnieżdżone typy typów ogólnych powinny być kwalifikowane.
pt_br: Em atributos cref, tipos aninhados de tipos genéricos devem ser qualificados.
ru: В атрибутах cref вложенные типы универсальных типов должны быть полными.
tr: Cref öznitelikleri içinde, genel türlerin iç içe yerleştirilmiş türleri uygun bulunmalıdır.
zh_hans: 在 cref 特性中，应限定泛型类型的嵌套类型。
zh_hant: 在 cref 屬性中，泛型類型的巢狀類型必須符合規定。

# WRN_UnqualifiedNestedTypeInCref_Title
source: Within cref attributes, nested types of generic types should be qualified
cs: V atributech cref by měly být kvalifikované vnořené typy obecných typů.
de: Innerhalb von cref-Attributen sollten geschachtelte Typen von generischen Typen qualifiziert sein
es: Entre los atributos cref, los tipos anidados de tipos genéricos deberían ser cualificados
fr: Dans les attributs cref, les types imbriqués de types génériques doivent être qualifiés
it: Negli attributi cref è necessario qualificare i tipi annidati di tipi generici
ja: 属性 cref 内では、入れ子型のジェネリック型を修飾する必要があります
ko: cref 특성 내에서 제네릭 형식의 중첩 형식은 정규화되어야 합니다.
pl: W ramach atrybutów cref zagnieżdżone typy typów ogólnych powinny być kwalifikowane
pt_br: Em atributos cref, tipos aninhados de tipos genéricos devem ser qualificados
ru: Вложенные типы универсальных типов должны соответствовать в атрибутах cref
tr: Cref öznitelikleri içinde, genel türlerin iç içe geçmiş türleri belirtilmelidir
zh_hans: 在 cref 特性中，应限定泛型类型的嵌套类型
zh_hant: 在 cref 屬性中，泛型類型的巢狀類型必須符合規定

# NotACSharpSymbol
source: Not a C# symbol.
cs: Nepředstavuje symbol C#.
de: Kein C#-Symbol.
es: No es un símbolo C#.
fr: Symbole non C#.
it: Non è un simbolo di C#.
ja: C# シンボルではありません。
ko: C# 기호가 아닙니다.
pl: To nie symbol języka C#.
pt_br: Não é um símbolo C#.
ru: Не символ C# .
tr: Bir C# sembolü değil.
zh_hans: 不是 C# 符号。
zh_hant: 不是 C# 符號。

# HDN_UnusedUsingDirective
source: Unnecessary using directive.
cs: Nepotřebná direktiva using
de: Nicht erforderliche using-Direktive.
es: Directiva Using innecesaria.
fr: Directive using non nécessaire.
it: Direttiva Using non necessaria.
ja: using ディレクティブは不要です。
ko: 불필요한 using 지시문입니다.
pl: Niepotrzebna dyrektywa using.
pt_br: Diretiva de uso desnecessária.
ru: Ненужная директива using.
tr: Gereksiz using yönergesi.
zh_hans: 不需要的 using 指令。
zh_hant: 不必要的 using 指示詞。

# HDN_UnusedExternAlias
source: Unused extern alias.
cs: Nepoužívaný alias extern
de: Nicht verwendeter externer Alias.
es: Alias externo sin usar.
fr: Alias extern non utilisé.
it: Alias extern non usato.
ja: extern エイリアスは未使用です。
ko: 사용하지 않는 extern 별칭입니다.
pl: Nieużywany alias zewnętrzny.
pt_br: Alias externo não usado.
ru: Неиспользованный внешний псевдоним.
tr: Kullanılmayan extern diğer adı.
zh_hans: 未使用的外部别名。
zh_hant: 未使用的外部別名。

source: Elements cannot be null.
cs: Elementy nemůžou mít hodnotu null.
de: Elemente können nicht NULL sein.
es: Los elementos no pueden ser NULL.
fr: Les éléments ne peuvent pas avoir la valeur null.
it: Gli elementi non possono essere Null.
ja: 要素を null にすることはできません。
ko: 요소는 null일 수 없습니다.
pl: Elementy nie mogą mieć wartości null.
pt_br: Elementos não podem ser nulos.
ru: Элементы не могут иметь значение Null.
tr: Öğeler null olamaz.
zh_hans: 元素不能为 Null。
zh_hant: 項目不可為 null。

# IDS_LIB_ENV
source: LIB environment variable
cs: proměnná prostředí LIB
de: LIB-Umgebungsvariable
es: variable de entorno LIB
fr: variable d'environnement LIB
it: variabile di ambiente LIB
ja: LIB 環境変数
ko: LIB 환경 변수
pl: zmienna środowiskowa LIB
pt_br: variável de ambiente LIB
ru: Переменная окружения LIB
tr: LIB ortam değişkeni
zh_hans: LIB 环境变量
zh_hant: LIB 環境變數

# IDS_LIB_OPTION
source: /LIB option
cs: parametr /LIB
de: Option "/LIB"
es: opción /LIB
fr: option /LIB
it: opzione /LIB
ja: /LIB オプション
ko: /LIB 옵션
pl: opcja /LIB
pt_br: opção /LIB
ru: параметр /LIB
tr: /LIB seçeneği
zh_hans: /LIB 选项
zh_hant: /LIB 選項

# IDS_REFERENCEPATH_OPTION
source: /REFERENCEPATH option
cs: Možnost /REFERENCEPATH
es: opción /REFERENCEPATH
fr: option /REFERENCEPATH
it: opzione /REFERENCEPATH
ja: /REFERENCEPATH オプション
ko: /REFERENCEPATH 옵션
pl: /REFERENCEPATH opcja
pt_br: Opção /REFERENCEPATH
ru: Параметр /REFERENCEPATH
tr: /REFERENCEPATH seçeneği
zh_hans: /REFERENCEPATH 选项
zh_hant: /REFERENCEPATH 選項

# IDS_DirectoryDoesNotExist
source: directory does not exist
cs: adresář neexistuje
de: Das Verzeichnis ist nicht vorhanden.
es: el directorio no existe
fr: répertoire inexistant
it: la directory non esiste
ja: ディレクトリが存在しません
ko: 디렉터리가 없습니다.
pl: katalog nie istnieje
pt_br: diretório não existe
ru: каталог не существует
tr: dizin yok
zh_hans: 目录不存在
zh_hant: 目錄不存在

# IDS_DirectoryHasInvalidPath
source: path is too long or invalid
cs: cesta je moc dlouhá nebo neplatná.
de: Der Pfad ist zu lang oder ungültig.
es: la ruta de acceso es demasiado larga o no es válida
fr: chemin d'accès trop long ou non valide
it: il percorso è troppo lungo o non è valido
ja: パスが長すぎるか、無効です
ko: 경로가 너무 길거나 잘못되었습니다.
pl: ścieżka jest za długa lub nieprawidłowa
pt_br: o caminho é muito longo ou inválido
ru: слишком длинный или недопустимый путь.
tr: yol çok uzun veya geçersiz
zh_hans: 路径太长或无效
zh_hant: 路徑太長或無效

# WRN_NoRuntimeMetadataVersion
source: No value for RuntimeMetadataVersion found. No assembly containing System.Object was found nor was a value for RuntimeMetadataVersion specified through options.
cs: Nenašla se žádná hodnota RuntimeMetadataVersion, žádné sestavení obsahující System.Object ani nebyla v možnostech zadaná hodnota pro RuntimeMetadataVersion.
de: Für RuntimeMetadataVersion wurde kein Wert gefunden. Keine Assembly mit System.Object wurde gefunden, und es wurde auch kein Wert für RuntimeMetadataVersion mit Optionen angegeben.
es: No se encontró ningún valor para RuntimeMetadataVersion. No se encontró ningún ensamblado que contuviese System.Object ni se especificó ningún valor para RuntimeMetadataVersion a través de las opciones.
fr: Aucune valeur n'a été trouvée pour RuntimeMetadataVersion. Aucun assembly contenant System.Object n'a été trouvé et aucune valeur n'a été spécifiée pour RuntimeMetadataVersion via les options.
it: Non è stato trovato un valore per RuntimeMetadataVersion. Non è presente un assembly che contiene System.Object oppure tramite le opzioni non è stato specificato un valore per RuntimeMetadataVersion.
ja: RuntimeMetadataVersion の値が見つかりませんでした。System.Object を含むアセンブリが見つからず、オプションを使用して RuntimeMetadataVersion の値が指定されてもいませんでした。
ko: RuntimeMetadataVersion 값을 찾을 수 없습니다. System.Object가 포함된 어셈블리를 찾을 수 없고 옵션을 통해 지정된 RuntimeMetadataVersion 값이 아닙니다.
pl: Nie znaleziono wartości elementu RuntimeMetadataVersion. Nie znaleziono żadnego zestawu zawierającego element System.Object ani nie określono wartości elementu RuntimeMetadataVersion za pomocą opcji.
pt_br: Nenhum valor para RuntimeMetadataVersion encontrado. Nenhum assembly contendo System.Object foi encontrado nem foi encontrado um valor de RuntimeMetadataVersion especificado por meio de opções.
ru: Значение для RuntimeMetadataVersion не обнаружено. Не обнаружена также сборка, содержащая System.Object, или значение для RuntimeMetadataVersion не определено параметрами.
tr: RuntimeMetadataVersion için değer bulunamadı. System.Object içeren derleme ya da seçenekler yoluyla belirtilen RuntimeMetadataVersion için değer bulunamadı.
zh_hans: 找不到 RuntimeMetadataVersion 的值。找不到包含 System.Object 的程序集，或未通过选项为 RuntimeMetadataVersion 指定值。
zh_hant: 找不到 RuntimeMetadataVersion 的值。找不到任何包含 System.Object 的組件，也未透過選項指定 RuntimeMetadataVersion 的值。

# WRN_NoRuntimeMetadataVersion_Title
source: No value for RuntimeMetadataVersion found
cs: Nenašla se žádná hodnota pro RuntimeMetadataVersion.
de: Es wurde kein Wert für RuntimeMetadataVersion gefunden
es: No se encontró ningún valor para RuntimeMetadataVersion
fr: Aucune valeur détectée pour RuntimeMetadataVersion
it: Non sono stati trovati valori per RuntimeMetadataVersion
ja: RuntimeMetadataVersion の値が見つかりません
ko: RuntimeMetadataVersion에 대한 값이 없습니다.
pl: Nie odnaleziono wartości elementu RuntimeMetadataVersion
pt_br: Nenhum valor de RuntimeMetadataVersion foi encontrado
ru: Не удалось найти значение RuntimeMetadataVersion
tr: RuntimeMetadataVersion için değer bulunamadı
zh_hans: 找不到 RuntimeMetadataVersion 的值
zh_hant: 找不到 RuntimeMetadataVersion 的值

# WrongSemanticModelType
source: Expected a {0} SemanticModel.
cs: Očekával se SemanticModel {0}.
de: SemanticModel "{0}" erwartet.
es: Se esperaba un SemanticModel de {0}.
fr: SemanticModel {0} attendu.
it: È previsto un elemento SemanticModel {0}.
ja: {0} の SemanticModel が必要です。
ko: {0} SemanticModel이 필요합니다.
pl: Oczekiwano elementu SemanticModel {0}.
pt_br: Espera-se um {0} SemanticModel.
ru: Требуется {0} SemanticModel.
tr: Beklenen bir {0} SemanticModel.
zh_hans: 应为 {0} SemanticModel。
zh_hant: 必須是 {0} SemanticModel。

# IDS_FeatureLambda
source: lambda expression
cs: výraz lambda
de: Lambdaausdruck
es: expresión lambda
fr: expression lambda
it: espressione lambda
ja: ラムダ式
ko: 람다 식
pl: wyrażenie lambda
pt_br: expressão lambda
ru: лямбда-выражение
tr: lambda ifadesi
zh_hans: lambda 表达式
zh_hant: Lambda 運算式

# ERR_FeatureNotAvailableInVersion1
source: Feature '{0}' is not available in C# 1. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 1. Použijte prosím jazyk verze {1} nebo vyšší.
de: Die Funktion "{0}" ist in C# 1 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 1. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 1. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 1. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 1 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 1에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 1. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 1. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 1. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 1'de kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 1 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 1 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion2
source: Feature '{0}' is not available in C# 2. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 2. Použijte prosím jazyk verze {1} nebo vyšší.
de: Die Funktion "{0}" ist in C# 2 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 2. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 2. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 2. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 2 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 2에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 2. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 2. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 2. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 2'de kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 2 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 2 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion3
source: Feature '{0}' is not available in C# 3. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 3. Použijte prosím jazyk verze {1} nebo vyšší.
de: Die Funktion "{0}" ist in C# 3 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 3. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 3. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 3. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 3 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 3에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 3. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 3. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 3. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 3'te kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 3 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 3 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion4
source: Feature '{0}' is not available in C# 4. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 4. Použijte prosím jazyk verze {1} nebo vyšší.
de: Die Funktion "{0}" ist in C# 4 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 4. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 4. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 4. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 4 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 4에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 4. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 4. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 4. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 4'te kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 4 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 4 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion5
source: Feature '{0}' is not available in C# 5. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 5. Použijte prosím jazyk verze {1} nebo vyšší.
de: Die Funktion "{0}" ist in C# 5 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 5. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 5. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 5. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 5 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 5에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 5. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 5. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 5. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 5'te kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 5 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 5 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion6
source: Feature '{0}' is not available in C# 6. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 6. Použijte prosím jazyk verze {1} nebo vyšší.
de: Das Feature "{0}" ist in C# 6 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 6. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 6. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 6. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 6 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 6에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 6. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 6. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 6. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 6'da kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 6 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 6 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion7
source: Feature '{0}' is not available in C# 7.0. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 7.0. Použijte prosím jazyk verze {1} nebo vyšší.
de: Das Feature "{0}" ist in C# 7.0 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 7.0. Use la versión del lenguaje {1} u otra posterior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 7.0. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 7.0. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 7.0 では使用できません。{1} 以上の言語バージョンをご使用ください。
ko: {0}' 기능은 C# 7.0에서 사용할 수 없습니다. 언어 버전 {1} 이상을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 7.0. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 7.0. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 7.0. Используйте версию языка {1} или более позднюю.
tr: {0}' özelliği C# 7.0'da kullanılamıyor. Lütfen {1} veya üzeri bir dil sürümü kullanın.
zh_hans: C# 7.0 中不支持功能“{0}”。请使用 {1} 或更高的语言版本。
zh_hant: C# 7.0 中未提供功能 '{0}'。請使用語言版本 {1} 或更高版本。

# PositionNotWithinTree
source: Position must be within span of the syntax tree.
cs: Pozice musí být v rozpětí stromu syntaxe.
de: Die Position muss im Bereich des Syntaxbaums sein.
es: La posición debe estar dentro del intervalo del árbol de sintaxis.
fr: La position doit se trouver dans l'étendue de l'arborescence de syntaxe.
it: La posizione deve essere inclusa nello span dell'albero della sintassi.
ja: 場所は、構文ツリーのスパン内にある必要があります。
ko: 위치는 구문 트리 범위 내에 있어야 합니다.
pl: Pozycja musi znajdować się w zasięgu drzewa składni.
pt_br: A posição deve ser dentro do intervalo da árvore de sintaxe.
ru: Позиция должна находиться в диапазоне синтаксического дерева.
tr: Konum sözdizimi ağacı kapsamı içinde olmalıdır.
zh_hans: 位置必须处于语法树范围内。
zh_hant: 位置必須在語法樹狀結構的範圍內。

# SpeculatedSyntaxNodeCannotBelongToCurrentCompilation
source: Syntax node to be speculated cannot belong to a syntax tree from the current compilation.
cs: Uzel syntaxe určený ke spekulaci nemůže patřit do stromu syntaxe z aktuální kompilace.
de: Der zu analysierende Syntaxknoten kann nicht zum Syntaxbaum der aktuellen Kompilierung gehören.
es: El nodo de sintaxis que se va a especular no puede pertenecer a un árbol de sintaxis de la compilación actual.
fr: Le nœud de syntaxe à extrapoler ne peut pas appartenir à une arborescence de syntaxe de la compilation actuelle.
it: Il nodo della sintassi da prevedere non può appartenere a un albero della sintassi della compilazione corrente.
ja: 推測される構文ノードは、現在のコンパイルの構文ツリーに属することができません。
ko: 추측한 구문 노드는 현재 컴파일에서 구문 트리에 속할 수 없습니다.
pl: Drzewo składni do przeanalizowania nie może należeć do drzewa składni bieżącej kompilacji.
pt_br: Nó de sintaxe a ser especulado não pode pertencer a uma árvore de sintaxe da compilação atual.
ru: Предполагаемый синтаксический узел не может принадлежать синтаксическому дереву из текущей компиляции.
tr: Tahmin edilen sözdizimi düğümü geçerli derlemeden bir sözdizimi ağacına ait olamaz.
zh_hans: 要推断的语法节点不能属于来自当前编译的语法树。
zh_hant: 要推測的語法節點，不可屬於目前編譯的語法樹狀結構。
