Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CollectionBuilderAttributeInvalidType
source: The CollectionBuilderAttribute builder type must be a non-generic class or struct.
fr: Le type de générateur CollectionBuilderAttribute doit être une classe ou un struct non générique.
it: Il tipo di compilatore CollectionBuilderAttribute deve essere una classe o uno struct non generici.
ja: CollectionBuilderAttribute ビルダー型は、非ジェネリック クラスまたは構造体である必要があります。
pl: Typ konstruktora CollectionBuilderAttribute musi być klasą lub strukturą nie generycznej.
pt_br: O tipo de construtor CollectionBuilderAttribute deve ser uma classe ou estrutura não genérica.
ru: Тип построителя CollectionBuilderAttribute должен быть неуниверсальным классом или структурой.
zh_hans: CollectionBuilderAttribute 生成器类型必须是非泛型类或结构。
zh_hant: CollectionBuilderAttribute 組建器類型必須是非泛型類別或結構。

# ERR_CollectionBuilderAttributeMethodNotFound
source: Could not find an accessible '{0}' method with the expected signature: a static method whose last parameter is of type 'ReadOnlySpan<{1}>' and return type '{2}'.
pt_br: Não foi possível encontrar um método '{0}' acessível com a assinatura esperada: um método estático com um único parâmetro do tipo 'ReadOnlySpan<{1}>' e tipo de retorno '{2}'.

# ERR_CollectionBuilderNoElementType
source: '{0}' has a CollectionBuilderAttribute but no element type.
fr: « {0} » a un CollectionBuilderAttribute mais aucun type d’élément.
it: '{0}' include CollectionBuilderAttribute ma nessun tipo di elemento.
ja: '{0}' に CollectionBuilderAttribute がありますが、要素型がありません。
pl: Element „{0}” ma atrybut CollectionBuilderAttribute, ale nie ma typu elementu.
pt_br: '{0}' tem um CollectionBuilderAttribute, mas nenhum tipo de elemento.
ru: "{0}" содержит CollectionBuilderAttribute, но не имеет типа элемента.
zh_hans: “{0}”具有 CollectionBuilderAttribute，但没有元素类型。
zh_hant: '{0}' 具有 CollectionBuilderAttribute，但沒有元素類型。

# ERR_CollectionExpressionEscape
source: A collection expression of type '{0}' cannot be used in this context because it may be exposed outside of the current scope.
fr: Vous ne pouvez pas utiliser une expression de collection de type « {0} » dans ce contexte, car elle peut être exposée en dehors de l’étendue actuelle.
it: Un'espressione di raccolta di tipo '{0}' non può essere usata in questo contesto perché potrebbe essere esposta al di fuori dell'ambito corrente.
pl: Nie można użyć wyrażenia kolekcji typu „{0}” w tym kontekście, ponieważ może ono być uwidocznione poza bieżącym zakresem.
pt_br: Uma expressão de coleção do tipo '{0}' não pode ser usada nesse contexto porque ela pode ser exposta fora do escopo atual.
ru: Выражение коллекции типа "{0}" нельзя использовать в этом контексте, так как он может быть доступен вне текущей области.
zh_hans: 无法在此上下文中使用类型为“{0}”的集合表达式，因为它可能在当前范围之外公开。
zh_hant: 無法在此內容中使用類型 '{0}' 的集合運算式，因為它可能會在目前範圍外公開。

# ERR_CollectionExpressionImmutableArray
source: This version of '{0}' cannot be used with collection expressions.
fr: Cette version de « {0} » ne peut pas être utilisée avec des expressions de collection.
it: Questa versione di '{0}' non può essere utilizzata con espressioni di raccolta.
ja: このバージョンの '{0}' は、コレクション式では使用できません。
pl: Tej wersji elementu „{0}” nie można używać z wyrażeniami kolekcji.
pt_br: Esta versão de '{0}' não pode ser usada com expressões de coleção.
ru: Невозможно использовать эту версию "{0}" с выражениями коллекций.
zh_hans: “{0}”的此版本无法与集合表达式一起使用。
zh_hant: 此版本的 '{0}' 無法與集合運算式一起使用。

# ERR_CollectionExpressionMissingAdd
source: Collection expression type '{0}' must have an instance or extension method 'Add' that can be called with a single argument.
fr: Le type d’expression de collection « {0} » doit avoir une instance ou une méthode d’extension « Ajouter » qui peut être appelée avec un seul argument.
it: Il tipo di espressione della raccolta "{0}" deve avere un'istanza o un metodo di estensione "Add" da poter chiamare con un argomento singolo.
pl: Typ wyrażenia kolekcji „{0}” musi mieć wystąpienie lub metodę rozszerzenia „Dodaj”, którą można wywołać z pojedynczym argumentem.
pt_br: O tipo de expressão de coleção '{0}' deve ter uma instância ou método de extensão 'Add' que pode ser chamado com apenas um argumento.
ru: Тип выражения коллекции "{0}" должен иметь экземпляр или метод расширения "Add", который можно вызвать с помощью одного аргумента.
zh_hans: 集合表达式类型“{0}”必须具有可以使用单个参数调用的实例或扩展方法 "Add"。
zh_hant: 集合運算式類型 '{0}' 必須有可以使用單一引數來呼叫的執行個體或延伸模組方法 'Add'。

# ERR_CollectionExpressionMissingConstructor
source: Collection expression type must have an applicable constructor that can be called with no arguments.
fr: Le type d’expression de collection doit avoir un constructeur applicable que vous pouvez appeler sans argument.
it: Il tipo di espressione della raccolta deve avere un costruttore applicabile che può essere chiamato senza argomenti.
pl: Typ wyrażenia kolekcji musi mieć odpowiedni konstruktor, który można wywołać bez argumentów.
pt_br: O tipo de expressão de coleção precisa ter um construtor aplicável que possa ser chamado sem argumentos.
ru: Тип выражения коллекции должен иметь применимый конструктор, который может быть вызван без аргументов.
zh_hans: 集合表达式类型必须具有可在不带参数的情况下调用的适用构造函数。
zh_hant: 集合運算式型別必須具有可在不帶引數的情況下呼叫的適用建構函式。

# ERR_CollectionExpressionNoTargetType
source: There is no target type for the collection expression.
fr: Il n’existe aucun type cible pour l’expression de collection.
it: Nessun tipo di destinazione per l'espressione di raccolta.
pl: Brak typu docelowego dla wyrażenia kolekcji.
pt_br: Não há um tipo de destino para a expressão de coleção.
ru: Отсутствует тип целевого объекта для выражения коллекции.
zh_hans: 集合表达式没有目标类型。
zh_hant: 集合運算式沒有目標類型。

# ERR_CollectionExpressionTargetNoElementType
source: Collection expression target '{0}' has no element type.
fr: La cible « {0} » de l’expression de collection n’a aucun type d’élément.
it: La destinazione dell'espressione di raccolta '{0}' non contiene alcun tipo di elemento.
pl: Wyrażenie kolekcji docelowej „{0}” nie ma typu elementu.
pt_br: O destino da expressão de coleção "{0}" não tem nenhum tipo de elemento.
ru: У целевого объекта выражения "{0}" нет типа элемента.
zh_hans: 集合表达式目标“{0}”没有元素类型。
zh_hant: 集合運算式目標 '{0}' 沒有元素型別。

# ERR_CollectionExpressionTargetTypeNotConstructible
source: Cannot initialize type '{0}' with a collection expression because the type is not constructible.
fr: Désolé... Nous ne pouvons pas initialiser le type « {0} » avec une expression de collection, car le type n’est pas constructible.
it: Non è possibile inizializzare il tipo '{0}' con un'espressione di raccolta perché il tipo non è costruibile.
pl: Nie można zainicjować typu „{0}” z wyrażeniem kolekcji, ponieważ nie można go skonstruować.
pt_br: Não é possível inicializar o tipo '{0}' com uma expressão de coleção porque o tipo não é construível.
ru: Не удается инициализировать тип "{0}" с выражением коллекции, так как тип не является конструируемым.
zh_hans: 无法使用集合表达式初始化类型“{0}”，因为该类型不可构造。
zh_hant: 無法使用集合運算式將類型 '{0}' 初始化，因為該類型為不可建構。

# ERR_CollectionInitializerInfiniteChainOfAddCalls
source: Collection initializer results in an infinite chain of instantiations of collection '{0}'.
fr: L'initialiseur de collection donne lieu à une chaîne infinie d'instanciations de la collection « {0} ».
it: L'inizializzatore di raccolta genera una catena infinita di creazioni di istanze della raccolta '{0}'.
pt_br: O inicializador de coleção resulta em uma cadeia infinita de instanciações da coleção ''{0}''.
ru: Инициализатор коллекции приводит к созданию бесконечной цепочки экземпляров коллекции "{0}".
zh_hans: 集合初始值设定项会生成集合 ‘{0}’ 的无限实例化链。

# ERR_CompilationUnitUnexpected
source: A compilation unit cannot directly contain members such as fields, methods or properties
pt_br: Uma unidade de compilação não pode conter membros diretamente, como campos, métodos ou propriedades

# ERR_ConWithUnmanagedCon
source: Type parameter '{1}' has the 'unmanaged' constraint so '{1}' cannot be used as a constraint for '{0}'
cs: Parametr typu {1} má omezení unmanaged, takže není možné používat {1} jako omezení pro {0}.
de: Der {1}-Typparameter enthält die Einschränkung "unmanaged". "{1}" kann daher nicht als Einschränkung für "{0}" verwendet werden.
es: El parámetro de tipo "{1}" tiene la restricción "unmanaged"; por tanto, "{1}" no se puede usar como restricción para "{0}"
fr: Le paramètre de type '{1}' a la contrainte 'unmanaged'. '{1}' ne peut donc pas être utilisé comme contrainte pour '{0}'
it: Il parametro di tipo '{1}' ha il vincolo 'managed'. Non è quindi possibile usare '{1}' come vincolo per '{0}'
ja: 型パラメーター '{1}' は 'unmanaged' 制約を含むので、'{0}' の制約として '{1}' を使用することはできません
ko: 형식 매개 변수 '{1}'에 'unmanaged' 제약 조건이 있으므로 '{1}'은(는) '{0}'에 대한 제약 조건으로 사용할 수 없습니다.
pl: Parametr typu „{1}” ma ograniczenie „unmanaged”, dlatego elementu „{1}” nie można użyć jako ograniczenia dla elementu „{0}”
pt_br: O parâmetro de tipo '{1}' tem a restrição 'unmanaged' e, por isso, '{1}' não pode ser usado como uma restrição de '{0}'
ru: Параметр типа "{1}" имеет ограничение "unmanaged", поэтому "{1}" не может использоваться в качестве ограничения для "{0}".
tr: '{1}' tür parametresinde 'unmanaged' kısıtlaması olduğundan '{1}', '{0}' için kısıtlama olarak kullanılamaz
zh_hans: 类型参数“{1}”具有 "unmanaged" 约束，因此“{1}”不能用作“{0}”的约束
zh_hant: 類型參數 '{1}' 有 'unmanaged' 條件約束，因此 '{1}' 不可作為 '{0}' 的條件約束

# ERR_ConditionalOnLocalFunction
source: Local function '{0}' must be 'static' in order to use the Conditional attribute
cs: Aby bylo možné používat atribut Conditional, musí být místní funkce {0} static.
fr: La fonction locale '{0}' doit être 'static' pour pouvoir utiliser l'attribut Conditional
it: Per usare l'attributo Conditional, la funzione locale '{0}' deve essere 'static'
ja: ローカル関数 '{0}' は、条件付き属性を使用するには、'static' である必要があります
pl: Funkcja lokalna „{0}” musi być oznaczona jako „static”, aby można było używać atrybutu warunkowego
pt_br: A função local '{0}' deve ser 'static' para usar o atributo condicional
ru: Локальная функция "{0}" должна быть "static", чтобы использовать атрибут Conditional
zh_hans: 本地函数“{0}”必须为 "static" 才能使用 "Conditional" 特性
zh_hant: 區域函式 '{0}' 必須為 'static' 才能使用 Conditional 屬性

# ERR_ConstantPatternVsOpenType
source: An expression of type '{0}' cannot be handled by a pattern of type '{1}'. Please use language version '{2}' or greater to match an open type with a constant pattern.
cs: Výraz typu {0} nelze zpracovat vzorem typu {1}. Použijte prosím verzi jazyka {2} nebo vyšší, aby odpovídala otevřenému typu se vzorem konstanty.
de: Ein Ausdruck vom Typ "{0}" kann nicht von einem Muster vom Typ "{1}" behandelt werden. Verwenden Sie Sprachversion {2} oder höher, um einen offenen Typ mit einem konstanten Muster abzugleichen.
es: Un patrón de tipo "{0}" no se puede controlar por un patrón de tipo "{1}". Use la versión de lenguaje "{2}" o superior para buscar un tipo abierto con un patrón constante.
fr: Une expression de type '{0}' ne peut pas être prise en charge par un modèle de type '{1}'. Utilisez la version de langage '{2}' ou une version ultérieure pour faire correspondre un type ouvert à un modèle de constante.
it: Un'espressione di tipo '{0}' non può essere gestita da un criterio di tipo '{1}'. Usare la versione '{2}' o versioni successive del linguaggio per abbinare un tipo aperto a un criterio costante.
ja: 型 '{0}' の式を型 '{1}' のパターンで処理することはできません。オープン型と定数パターンを一致させるには、言語バージョン '{2}' 以上をご使用ください。
ko: '{0}' 형식의 식은 '{1}' 형식의 패턴으로 처리할 수 없습니다. 언어 버전 '{2}' 이상을 사용하여 개방형 형식과 상수 패턴을 일치시키세요.
pl: Wyrażenie typu „{0}” nie może być obsługiwane przez wzorzec typu „{1}”. Użyj wersji języka „{2}” lub nowszej, aby dopasować typ otwarty za pomocą wzorca stałej.
pt_br: Uma expressão do tipo '{0}' não pode ser manipulada por um padrão do tipo '{1}'. Use a versão de linguagem '{2}' ou superior para corresponder a um tipo aberto com um padrão constante.
ru: Выражение типа "{0}" не может быть обработано шаблоном типа "{1}". Используйте версию языка "{2}" или более позднюю, чтобы сопоставить открытый тип с постоянным шаблоном.
tr: '{0}' türünde bir ifade, '{1}' türünde bir desen tarafından işlenemez. Lütfen açık bir türü sabit bir desenle eşleştirmek için '{2}' veya daha yüksek bir dil sürümü kullanın.
zh_hans: "{0}" 类型的表达式不能由 "{1}" 类型的模式进行处理。请使用语言版本 "{2}" 或更高版本，将开放类型与常数模式进行匹配。
zh_hant: 類型 '{0}' 的運算式無法由類型 '{1}' 的模式處理。請使用語言 '{2}' 版或更新版本，以比對開放式類型與常數模式。

# ERR_ConstantValueOfTypeExpected
source: A constant value of type '{0}' is expected
cs: Očekává se konstantní hodnota typu „{0}“.
fr: Une valeur constante de type '{0}' est attendue
it: È previsto un valore costante di tipo '{0}'
ja: 型 '{0}' の定数値が必要です
pl: Oczekiwano stałej wartości typu '{0}'
pt_br: Um valor constante do tipo '{0}' é esperado
ru: Ожидается значение константы типа "{0}"
zh_hans: 应为 '{0}' 类型的常量值
zh_hant: 必須為 '{0}' 類型的常數值

# ERR_CopyConstructorMustInvokeBaseCopyConstructor
source: A copy constructor in a record must call a copy constructor of the base, or a parameterless object constructor if the record inherits from object.
cs: Kopírovací konstruktor v záznamu musí volat kopírovací konstruktor základní třídy, případně konstruktor objektu bez parametrů, pokud záznam dědí z objektu.
fr: Un constructeur de copie dans un enregistrement doit appeler un constructeur de copie de la base ou un constructeur d'objet sans paramètre, si l'enregistrement hérite de l'objet.
it: Un costruttore di copia in un record deve chiamare un costruttore di copia della base o un costruttore di oggetto senza parametri se il record eredita dall'oggetto.
ja: レコード内のコピー コンストラクターは、ベースのコピー コンストラクターまたはパラメーターなしのオブジェクト コンストラクター (レコードがオブジェクトから継承している場合) を呼び出す必要があります。
pl: Konstruktor kopiujący w rekordzie musi wywoływać konstruktor kopiujący elementu podstawowego lub bezparametrowy konstruktor obiektu, jeśli rekord dziedziczy z obiektu.
pt_br: Um construtor de cópia em um registro precisa chamar um construtor de cópia da base ou um construtor de objeto sem parâmetros, quando o registro é herdado do objeto.
ru: Конструктор копий в записи должен вызвать конструктор копий базового класса или конструктор объекта без параметров, если запись наследуется от объекта.
zh_hans: 如果记录继承自 object，则记录中的复制构造函数必须调用基对象的复制构造函数，或者调用无参数的对象构造函数。
zh_hant: 若記錄繼承自物件，則記錄中的複製建構函式，必須呼叫基底的複製建構函式，或未設定任何參數的物件建構函式。

# ERR_CopyConstructorWrongAccessibility
source: A copy constructor '{0}' must be public or protected because the record is not sealed.
cs: Kopírovací konstruktor {0} musí být veřejný nebo chráněný, protože záznam není zapečetěný.
fr: Un constructeur de copie '{0}' doit être public ou protégé, car l'enregistrement n'est pas sealed.
it: Un costruttore di copia '{0}' deve essere pubblico o protetto perché il record non è sealed.
ja: コピー コンストラクター '{0}' は、レコードが sealed ではないため、public または protected にする必要があります。
pl: Konstruktor kopiujący „{0}” musi być publiczny lub chroniony, ponieważ rekord nie jest zapieczętowany.
pt_br: Um construtor de cópia '{0}' precisa ser público ou protegido porque o registro não está selado.
ru: Конструктор копий "{0}" должен быть открытым или защищенным, так как запись не запечатана.
zh_hans: 复制构造函数“{0}”必须是公共的或受保护的，因为该记录未密封。
zh_hant: 因為記錄不是密封的，所以複製建構函式 '{0}' 必須是公用或受保護。

# ERR_DataSectionStringLiteralHashCollision
source: Cannot emit this string literal into the data section because it has XXHash128 collision with another string literal: {0}
pt_br: Não é possível emitir esse literal de cadeia de caracteres na seção de dados porque ele tem uma colisão XXHash128 com outro literal de cadeia de caracteres: {0}

# ERR_DeconstructParameterNameMismatch
source: The name '{0}' does not match the corresponding 'Deconstruct' parameter '{1}'.
cs: Název {0} neodpovídá příslušnému parametru Deconstruct {1}.
de: Der Name "{0}" stimmt nicht mit dem entsprechenden Deconstruct-Parameter "{1}" überein.
es: El nombre "{0}" no coincide con el parámetro de "Deconstruct" correspondiente, "{1}".
fr: Le nom '{0}' ne correspond pas au paramètre 'Deconstruct' correspondant '{1}'.
it: Il nome '{0}' non corrisponde al parametro '{1}' di 'Deconstruct' corrispondente.
ja: 名前 '{0}' は対応する 'Deconstruct' パラメーター '{1}' と一致しません。
ko: '{0}' 이름이 해당 'Deconstruct' 매개 변수 '{1}'과(와) 일치하지 않습니다.
pl: Nazwa „{0}” nie jest zgodna z odpowiednim parametrem „Deconstruct” „{1}”.
pt_br: O nome '{0}' não corresponde ao parâmetro 'Deconstruct' '{1}'.
ru: Имя "{0}" не соответствует указанному параметру "Deconstruct" "{1}".
tr: '{0}' adı ilgili '{1}' 'Deconstruct' parametresiyle eşleşmiyor.
zh_hans: 名称“{0}”与相应 "Deconstruct" 参数“{1}”不匹配。
zh_hant: 名稱 '{0}' 與對應的 'Deconstruct' 參數 '{1}' 不相符。

# ERR_DeconstructVariableCannotBeByRef
source: A deconstruction variable cannot be declared as a ref local
cs: Dekonstrukční proměnná nemůže být deklarovaná jako místní odkaz.
fr: Une variable de déconstruction ne peut pas être déclaré en tant que variable locale
it: Una variabile di decostruzione non può essere dichiarata come variabile locale di riferimento
ja: 分解変数を ref ローカルと宣言することはできません
pl: Nie można zadeklarować zmiennej dekonstrukcji jako lokalnej wartości ref
pt_br: Uma variável de desconstrução não pode ser declarada como ref local
ru: Переменная деконструирования не может быть объявлена как локальная переменная ref
zh_hans: 析构变量不能声明为 ref 局部变量
zh_hant: 解構變數不可宣告為參考本機

# ERR_DefaultConstraintOverrideOnly
source: The 'default' constraint is valid on override and explicit interface implementation methods only.
cs: Omezení default je platné jen v přepsaných metodách a metodách explicitní implementace rozhraní.
fr: La contrainte 'default' est uniquement valide sur les méthodes de substitution et d'implémentation d'interface explicite.
it: Il vincolo 'default' è valido solo in metodi di override e di implementazione esplicita dell'interfaccia.
ja: 'default' 制約は、オーバーライドおよび明示的なインターフェイスの実装メソッドでのみ有効です。
pl: Ograniczenie „default” jest prawidłowe tylko w przypadku ograniczenia dla przesłoniętych i jawnych metod implementacji interfejsu.
pt_br: A restrição 'default' é válida somente nos métodos de substituição e de implementação explícita da interface.
ru: Ограничение "default" допустимо только для переопределенных и явных методов реализации интерфейса.
zh_hans: "default" 约束仅针对替代和显式接口实现方法有效。
zh_hant: 'default' 條件約束只在覆寫和明確介面實作方法上有效。

# ERR_DefaultInterfaceImplementationInNoPIAType
source: Type '{0}' cannot be embedded because it has a non-abstract member. Consider setting the 'Embed Interop Types' property to false.
cs: Typ {0} nemůže být vložený, protože má neabstraktní člen. Zvažte nastavení vlastnosti Vložit typy spolupráce na hodnotu false.
de: Der Typ "{0}" kann nicht eingebettet werden, weil er einen nicht abstrakten Member aufweist. Legen Sie die Eigenschaft "Interoptypen einbetten" ggf. auf FALSE fest.
es: El tipo "{0}" no se puede incrustar porque tiene un miembro no abstracto. Puede establecer la propiedad "Incrustar tipos de interoperabilidad" en false.
fr: Impossible d'incorporer le type '{0}', car il a un membre non abstrait. Affectez la valeur false à la propriété 'Incorporer les types interop'.
it: Non è possibile incorporare il tipo '{0}' perché contiene un membro non astratto. Provare a impostare la proprietà 'Incorpora tipi di interoperabilità' su false.
ja: 型 '{0}' には非抽象メンバーがあるため、この型を埋め込むことはできません。'相互運用型の埋め込み' プロパティを false に設定することをご検討ください。
ko: '{0}' 형식에는 비추상 멤버가 있으므로 해당 형식을 포함할 수 없습니다. 'Interop 형식 포함' 속성을 false로 설정해보세요.
pl: Nie można osadzić typu „{0}”, ponieważ ma nieabstrakcyjną składową. Rozważ ustawienie wartości false dla właściwości „Osadź typy międzyoperacyjne”.
pt_br: O tipo '{0}' não pode ser inserido porque tem um membro que não é abstrato. Considere a definição da propriedade 'Inserir Tipos de Interoperabilidade' como false.
ru: Не удается внедрить тип "{0}", так как он имеет неабстрактный член. Попробуйте задать для свойства "Внедрить типы взаимодействия" значение false.
tr: {0}' türünün soyut olmayan bir üyesi olduğundan bu tür eklenemiyor. 'Embed Interop Types' özelliğini false olarak ayarlamayı deneyin.
zh_hans: 无法嵌入类型“{0}”，因为它有非抽象成员。请考虑将“嵌入互操作类型”属性设置为 false。
zh_hant: 因為類型 '{0}' 有非抽象成員，所以無法內嵌。請考慮將 [內嵌 Interop 類型] 屬性設為 false。

# ERR_DefaultLiteralNoTargetType
source: There is no target type for the default literal.
cs: Není k dispozici žádný cílový typ pro výchozí literál.
de: Für das Standardliteral ist kein Zieltyp vorhanden.
es: No hay ningún tipo de destino para el literal predeterminado.
fr: Il n'existe aucun type cible pour le littéral par défaut.
it: Non esiste alcun tipo di destinazione per il valore letterale predefinito.
ja: 既定のリテラルのターゲット型がありません。
ko: 기본 리터럴의 대상 형식이 없습니다.
pl: Brak typu docelowego dla literału domyślnego.
pt_br: Não há um tipo de destino para o literal padrão.
ru: Отсутствует целевой тип для литерала по умолчанию.
tr: Varsayılan değişmez değer için hedef tür yok.
zh_hans: default 字面量缺少目标类型。
zh_hant: 預設常值沒有目標類型。

# ERR_DefaultPattern
source: A default literal 'default' is not valid as a pattern. Use another literal (e.g. '0' or 'null') as appropriate. To match everything, use a discard pattern '_'.
cs: Výchozí literál default není platný jako vzor. Podle potřeby použijte jiný literál (například 0 nebo null). Pokud chcete, aby odpovídalo vše, použijte vzor discard „_“.
de: Ein Standardliteral "default" ist als Muster ungültig. Verwenden Sie ggf. ein anderes Literal (z. B. 0 oder "null"). Verwenden Sie zum Abgleich aller Elemente ein discard-Muster "_".
es: Un literal predeterminado "default" no es válido como patrón. Use otro literal (por ejemplo, "0" o "null") según corresponda. Para hacer coincidir todo, use un patrón de descarte "_".
fr: Un littéral par défaut 'default' est non valide en tant que modèle. Utilisez un autre littéral (par exemple, '0' ou 'null') selon le cas. Pour correspondre à tout, utilisez un modèle d'abandon '_'.
it: Non è possibile usare un valore letterale predefinito 'default' come criterio. Usare un altro valore letterale, ad esempio '0' o 'null'. Per abbinare tutto, usare un criterio di rimozione '_'.
ja: 既定のリテラル 'default' はパターンとして無効です。必要に応じて別のリテラル (例: '0' または 'null') をご使用ください。すべてと一致させるには、破棄パターン '_' をご使用ください。
ko: 기본 리터럴 'default'가 패턴으로 유효하지 않습니다. 다른 리터럴(예: '0' 또는 'null')을 적절하게 사용하세요. 모두 일치시키려면 무시 패턴 '_'을 사용하세요.
pl: Domyślny literał „default” nie jest prawidłowy jako wzorzec. Użyj innego odpowiedniego literału (np. „0” lub „null”). Aby dopasować wszystko, użyj wzorca odrzucania „_”.
pt_br: Um literal padrão 'default' não é válido como um padrão. Use outro literal (por exemplo, '0' ou 'null') conforme o necessário. Para corresponder a tudo, use um padrão de descarte '_'.
ru: Литерал по умолчанию "default" недопустимо использовать в качестве шаблона. Используйте другой литерал (например, "0" или "null") по мере необходимости. Чтобы задать полное совпадение, используйте шаблон отмены "_".
tr: 'default' varsayılan sabit değeri bir desen olarak geçerli değil. Uygun olan başka bir sabit değeri (ör. '0' veya 'null') kullanın. Tüm öğeleri eşleştirmek için '_' atma desenini kullanın.
zh_hans: 默认字面量“default”不能作为模式使用。请使用其他更适合的字面量（如“0”或“null”）。若要匹配任何输入，请使用放弃模式“_”。
zh_hant: 預設常值 'default' 作為模式無效。請使用另一個適當的常值 (例如 '0' 或 'null')。若要比對所有項目，請使用捨棄模式 '_'。

# ERR_DesignatorBeforePropertyPattern
source: A variable designator must come after a property pattern.
pt_br: Um designador de variável deve vir após um padrão de propriedade.
