Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ExplicitImplCollision
source: Explicit interface implementation '{0}' matches more than one interface member. Which interface member is actually chosen is implementation-dependent. Consider using a non-explicit implementation instead.
cs: Explicitní implementace rozhraní {0} odpovídá víc než jednomu členovi rozhraní. Konkrétní výběr člena rozhraní závisí na implementaci. Zvažte možnost použití neexplicitní implementace.
de: Die explizite Schnittstellenimplementierung "{0}" entspricht mehreren Schnittstellenmembern. Es hängt von der Implementierung ab, welcher Schnittstellenmember ausgewählt wird. Verwenden Sie stattdessen eine nicht explizite Implementierung.
es: La implementación de interfaz explícita '{0}' coincide con más de un miembro de interfaz. El miembro de interfaz que se elige depende de la implementación. Si quiere, puede usar una implementación no explícita.
fr: L'implémentation d'interface explicite '{0}' correspond à plusieurs membres d'interface. Le membre d'interface choisi dépend de l'implémentation. Utilisez plutôt une implémentation non explicite.
it: L'implementazione esplicita dell'interfaccia '{0}' corrisponde a più membri di interfaccia. Il membro di interfaccia scelto dipende dall'implementazione. Provare a usare un'implementazione non esplicita.
ja: 明示的なインターフェイスの実装 '{0}' に一致するインターフェイス メンバーが 2 つ以上あります。どのインターフェイスが実際選択されるかは実装に依存しています。代わりに、明示的ではない実装の使用をお勧めします。
ko: 명시적 인터페이스 구현 '{0}'에 인터페이스 멤버가 두 개 이상 일치합니다. 실제로 선택되는 인터페이스 멤버는 구현에 따라 다릅니다. 대신 비명시적 구현을 사용해 보세요.
pl: Jawna implementacja interfejsu „{0}” jest zgodna z więcej niż jedną składową interfejsu. Wybór interfejsu do użycia zależy od implementacji. Rozważ użycie zamiast niej implementacji niejawnej.
pt_br: Implementação de interface explícita "{0}" corresponde a mais de um membro de interface. Qual membro de interface é na verdade escolhido é dependente de implementação. Ao invés, considere o uso de uma implementação não explícita.
ru: Явная реализация интерфейса '{0}' соответствует более чем одному члену интерфейса. Выбор члена интерфейса зависит от реализации. Возможно, требуется использовать неявную реализацию.
tr: {0}' açık arabirim uygulaması birden çok arabirim üyesiyle eşleşiyor. Gerçekte hangi arabirim üyesinin seçildiği, uygulamaya bağlıdır. Bunun yerine açık olmayan bir uygulama kullanmayı deneyin.
zh_hans: 显式接口实现“{0}”与多个接口成员匹配。实际选择哪个接口成员取决于具体的实现。请考虑改用非显式实现。
zh_hant: 明確介面實作 '{0}' 符合多個介面成員。實際選擇的介面成員，與實作相關。請考慮改用非明確實作。

# WRN_ExplicitImplCollision_Title
source: Explicit interface implementation matches more than one interface member
cs: Explicitní implementace rozhraní se shoduje s víc než jedním členem rozhraní.
de: Explizite Schnittstellenimplementierung stimmt mit mehreren Schnittstellenelementen überein
es: La implementación de la interfaz explícita coincide con más de un miembro de la interfaz
fr: L'implémentation d'interface explicite correspond à plusieurs membres d'interface
it: L'implementazione dell'interfaccia esplicita corrisponde a più di un membro di interfaccia
ja: 明示的なインターフェイスの実装に一致するインターフェイス メンバーが複数あります
ko: 명시적 인터페이스 구현에 인터페이스 멤버가 두 개 이상 일치합니다.
pl: Implementacja interfejsu jawnego jest zgodna z więcej niż jedną składową interfejsu
pt_br: A implementação de interface explícita corresponde a mais de um membro de interface
ru: Реализация явного интерфейса совпадает больше чем с одним членом интерфейса
tr: Açık arabirim uygulaması birden fazla arabirim üyesiyle eşleşiyor
zh_hans: 显式接口实现与多个接口成员匹配
zh_hant: 明確介面實作符合多個介面成員

# ERR_AbstractHasBody
source: '{0}' cannot declare a body because it is marked abstract
cs: {0} nemůže deklarovat tělo, protože je označené jako abstraktní.
de: '"{0}" ist als abstrakt markiert und kann daher keinen Text deklarieren.
es: '{0}' no puede declarar un cuerpo porque está marcado como abstracto
fr: '{0}' ne peut pas déclarer un corps, car il est marqué comme abstract
it: '{0}' non può dichiarare un corpo perché è contrassegnato come abstract
ja: '{0}' は abstract に指定されているため本体を宣言できません
ko: '{0}'은(는) abstract로 표시되어 있으므로 본문을 선언할 수 없습니다.
pl: 'W elemencie „{0}” nie może wystąpić deklaracja treści, ponieważ jest on oznaczony jako abstrakcyjny
pt_br: "{0}" não pode declarar um corpo porque não está marcado como abstract
ru: "{0}" не может объявить тело, потому что помечен как abstract.
tr: 'Soyut olarak işaretlendiğinden '{0}' bir gövde tanımlayamıyor
zh_hans: “{0}”无法声明主体，因为它标记为 abstract
zh_hant: '因為 '{0}' 已標記為抽象，所以它無法宣告主體

# ERR_ConcreteMissingBody
source: '{0}' must declare a body because it is not marked abstract, extern, or partial
cs: {0} musí deklarovat tělo, protože je označené jako abstraktní, externí nebo částečné.
de: '"{0}" ist nicht als abstrakt, extern oder partiell gekennzeichnet und muss daher einen Text deklarieren.
es: '{0}' debe declarar un cuerpo porque no se marcó como abstracto, externo o parcial
fr: '{0}' doit déclarer un corps, car il n'est pas marqué comme abstract, extern ou partial
it: '{0}' deve dichiarare un corpo perché non è contrassegnato come abstract, extern o partial
ja: '{0}' は abstract、extern、または partial に指定されていないため、本体を宣言する必要があります
ko: '{0}'은(는) abstract, extern 또는 partial로 표시되어 있지 않으므로 본문을 선언해야 합니다.
pl: 'Element „{0}” musi zadeklarować treść, ponieważ nie jest oznaczony jako abstrakcyjny, zewnętrzny ani częściowy
pt_br: "{0}" deve declarar um corpo porque não está marcado como abstract, extern ou partial
ru: "{0}" должен объявлять тело, так как он не помечен модификатором abstract, extern или partial.
tr: '{0}' abstract, extern veya partial olarak işaretlenmediğinden gövde bildirmelidir
zh_hans: “{0}”必须声明主体，因为它未标记为 abstract、extern 或 partial
zh_hant: '{0}' 並未標記成 abstract、extern 或 partial，所以必須宣告主體

# ERR_AbstractAndSealed
source: '{0}' cannot be both abstract and sealed
cs: {0} nemůže být extern i sealed.
de: '"{0}" kann nicht gleichzeitig abstrakt und versiegelt sein.
es: '{0}' no puede ser abstracto y estar sellado a la vez
fr: '{0}' ne peut pas être à la fois abstract et sealed
it: '{0}' non può essere contemporaneamente di tipo abstract e sealed
ja: '{0}' を abstract および sealed に同時に指定することはできません
ko: '{0}'은(는) abstract 및 sealed일 수 없습니다.
pl: 'Element „{0}” nie może być zewnętrzny i zapieczętowany
pt_br: "{0}" não pode ser ambos abstract e sealed
ru: "{0}" не может быть одновременно абстрактным и запечатанным.
tr: '{0}' hem soyut hem korumalı olamaz
zh_hans: “{0}”不能既是抽象的又是密封的
zh_hant: '{0}' 不可同時為抽象與密封

# ERR_AbstractNotVirtual
source: The abstract {0} '{1}' cannot be marked virtual
cs: Abstraktní {0} {1} nelze označit jako virtuální.
de: Das abstrakte {0}-Element "{1}" kann nicht als virtuell markiert werden.
es: El objeto {0} abstracto "{1}" no se puede marcar como virtual.
fr: La {0} abstraite '{1}' ne peut pas être marquée comme étant virtual
it: L'elemento {0} astratto '{1}' non può essere contrassegnato come virtual
ja: 抽象 {0} '{1}' を virtual に指定することはできません
ko: 추상 {0} '{1}'은(는) virtual로 표시할 수 없습니다.
pl: Abstrakcyjny element {0} „{1}” nie może być oznaczona jako wirtualny
pt_br: O abstract {0} '{1}' não pode ser marcado como virtual
ru: Абстрактный метод {0} "{1}" не может быть помечен как virtual.
tr: Soyut {0} '{1}' sanal olarak işaretlenemiyor
zh_hans: 抽象 {0}“{1}”不能标记为虚拟
zh_hant: 抽象 {0} '{1}' 不可標記為虛擬

# ERR_StaticConstant
source: The constant '{0}' cannot be marked static
cs: Konstanta {0} nemůže být označená jako statická.
de: Die Konstante "{0}" kann nicht als statisch markiert sein.
es: La constante '{0}' no se puede marcar como estática
fr: La constante '{0}' ne peut pas être marquée comme static
it: La costante '{0}' non può essere contrassegnata come static
ja: 定数 '{0}' を static に設定することはできません
ko: {0}' 상수는 static으로 표시할 수 없습니다.
pl: Stałej „{0}” nie można oznaczyć jako statycznej
pt_br: A constante "{0}" não pode ser marcada como static
ru: Константа "{0}" не может быть помечена модификатором static.
tr: {0}' sabiti statik olarak işaretlenemez
zh_hans: 常量“{0}”不能标记为 static
zh_hant: 常數 '{0}' 不可標記為 static

# ERR_CantOverrideNonFunction
source: '{0}': cannot override because '{1}' is not a function
cs: {0}: Nejde přepsat, protože {1} není funkce.
de: '"{0}": Überschreiben nicht möglich; "{1}" ist keine Funktion.
es: '{0}': no se puede invalidar porque '{1}' no es una función
fr: '{0}' : substitution impossible, car '{1}' n'est pas une fonction
it: '{0}': non è possibile eseguire l'override. '{1}' non è una funzione
ja: '{0}': '{1}' は関数ではないためオーバーライドできません
ko: '{0}': '{1}'이(가) 함수가 아니므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić, ponieważ element „{1}” nie jest funkcją
pt_br: "{0}": não é possível substituir porque "{1}" não é uma função
ru: "{0}": невозможно переопределить, так как "{1}" не является функцией.
tr: '{0}': '{1}' bir işlev olmadığından geçersiz kılınamıyor
zh_hans: “{0}”: 无法重写，因为“{1}”不是函数
zh_hant: '{0}': 因為 '{1}' 不是函式，所以無法覆寫

# ERR_CantOverrideNonVirtual
source: '{0}': cannot override inherited member '{1}' because it is not marked virtual, abstract, or override
cs: {0}: Nejde přepsat zděděný člen {1}, protože není označený jako virtuální, abstraktní nebo přepis.
de: '"{0}": Der geerbte Member "{1}" kann nicht überschrieben werden, da er nicht als "virtual" , "abstract" oder "override" markiert ist.
es: '{0}': no se puede invalidar el miembro heredado '{1}' porque no está marcado como virtual, abstract ni override
fr: '{0}' : impossible de substituer le membre hérité '{1}', car il n'est pas marqué comme virtual, abstract ou override
it: '{0}': non è possibile eseguire l'override del membro ereditato '{1}' perché non è contrassegnato come virtual, abstract o override
ja: '{0}': 継承されたメンバー '{1}' は virtual、abstract または override に設定されていないためオーバーライドできません
ko: '{0}': 상속된 '{1}' 멤버는 virtual, abstract 또는 override로 표시되지 않았으므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić odziedziczonej składowej „{1}”, ponieważ nie została ona oznaczona przy użyciu słowa kluczowego „virtual”, „abstract” ani „override”
pt_br: "{0}": não é possível substituir o membro herdado "{1}" porque ele não está marcado como virtual, abstract ou override
ru: "{0}": невозможно переопределить наследуемый член "{1}", так как он не помечен как virtual, abstract или override.
tr: '{0}': sanal, özet veya geçersiz kılma olarak işaretlenmediğinden '{1}' devralınmış üyesi geçersiz kılınamaz
zh_hans: “{0}”: 继承成员“{1}”未标记为 virtual、abstract 或 override，无法进行重写
zh_hant: '{0}': 無法覆寫繼承的成員 '{1}'，因為其未標記為 virtual、abstract 或 override

# ERR_CantChangeAccessOnOverride
source: '{0}': cannot change access modifiers when overriding '{1}' inherited member '{2}'
cs: {0}: Při přepsání {1} zděděného členu {2} nejde měnit modifikátory přístupu.
de: '"{0}": Die Zugriffsmodifizierer können beim Überschreiben des geerbten {1}-Members "{2}" nicht geändert werden.
es: '{0}': no se pueden cambiar los modificadores de acceso al invalidar el miembro heredado '{2}' de '{1}'
fr: '{0}' : impossible de modifier les modificateurs d'accès en cas de substitution du membre hérité '{2}' de '{1}'
it: '{0}': non è possibile cambiare i modificatori di accesso quando viene eseguito l'override di '{1}' del membro ereditato '{2}'
ja: '{0}': '{1}' の継承メンバー '{2}' をオーバーライドするときに、アクセス修飾子を変更できません
ko: '{0}': '{1}' 상속된 '{2}' 멤버를 재정의할 때 액세스 한정자를 변경할 수 없습니다.
pl: „{0}”: nie można zmienić modyfikatorów dostępu podczas przesłaniania elementu „{1}” dziedziczoną składową „{2}”
pt_br: "{0}": não é possível alterar modificadores de acesso ao substituir "{1}" membro herdado "{2}"
ru: "{0}": невозможно изменить модификаторы доступа при переопределении "{1}", унаследованном из "{2}".
tr: '{0}': '{2}' devralınmış üyesi '{1}' geçersiz kılınırken erişim değiştiricileri değiştirilemez
zh_hans: “{0}”: 当重写“{1}”继承成员“{2}”时，无法更改访问修饰符
zh_hant: '{0}': 覆寫 '{1}' 繼承的成員 '{2}' 時，無法變更存取修飾詞

# ERR_CantChangeTupleNamesOnOverride
source: '{0}': cannot change tuple element names when overriding inherited member '{1}'
cs: {0}: při přepisu zděděného člena {1} nelze změnit prvek řazené kolekce členů.
de: '"{0}": Tupelelementnamen können nicht geändert werden, wenn der geerbte Member "{1}" überschrieben wird.
es: '{0}': no se pueden cambiar los nombres de elementos de tupla al reemplazar el miembro heredado '{1}'
fr: '{0}' : impossible de changer les noms d'éléments tuples en cas de substitution du membre hérité '{1}'
it: '{0}': non è possibile cambiare i nomi di elementi di tupla quando viene eseguito l'override del membro ereditato '{1}'
ja: '{0}': 継承されたメンバー '{1}' を上書きするときにタプル要素名を変更することはできません
ko: '{0}': 상속된 멤버 '{1}'을(를) 재정의할 때 튜플 요소 이름을 변경할 수 없습니다.
pl: „{0}”: nie można zmienić nazw elementów krotki w przypadku przesłaniania dziedziczonej składowej „{1}”
pt_br: '{0}': não pode alterar os nomes de elemento de tupla ao substituir o membro herdado '{1}'
ru: "{0}": невозможно изменить имена элементов кортежа при переопределении наследуемого элемента "{1}"
tr: '{0}': devralınan '{1}' üyesi geçersiz kılınırken demet öğesi adları değiştirilemiyor
zh_hans: '{0}': 替代继承成员“{1}”时无法更改元组元素名称
zh_hant: '{0}': 在覆寫繼承的成員 '{1}' 時無法變更元組元素名稱

# ERR_CantChangeReturnTypeOnOverride
source: '{0}': return type must be '{2}' to match overridden member '{1}'
cs: {0}: Návratový typ musí být {2}, aby odpovídal přepsanému členu {1}.
de: '"{0}": Der Rückgabetyp muss "{2}" sein, um mit dem überschriebenen Member "{1}" übereinzustimmen.
es: '{0}': el tipo de valor devuelto debe ser '{2}' para que coincida con el miembro invalidado '{1}'
fr: '{0}' : le type de retour doit être '{2}' pour correspondre au membre substitué '{1}'
it: '{0}': il tipo restituito deve essere '{2}' in modo che corrisponda al membro '{1}' sottoposto a override
ja: '{0}': オーバーライドされたメンバー '{1}' に対応するために戻り値の型は '{2}' でなければなりません
ko: '{0}': 반환 형식이 재정의된 '{1}' 멤버와 일치하려면 '{2}' 형식이어야 합니다.
pl: „{0}”: typem zwracanym musi być „{2}”, aby być zgodnym z przesłoniętą składową „{1}”
pt_br: "{0}": tipo de retorno deve ser "{2}" para corresponder ao membro substituído "{1}"
ru: "{0}": возвращаемый тип должен быть "{2}", чтобы соответствовать переопределенному члену "{1}".
tr: '{0}': '{1}' geçersiz kılınan üyesiyle eşleştirmek için dönüş türü '{2}' olmalıdır
zh_hans: “{0}”: 返回类型必须是“{2}”才能与重写成员“{1}”匹配
zh_hant: '{0}': 傳回類型必須是 '{2}' 才符合覆寫的成員 '{1}'

# ERR_CantDeriveFromSealedType
source: '{0}': cannot derive from sealed type '{1}'
cs: {0}: Nejde odvozovat ze zapečetěného typu {1}.
de: '"{0}": Vom versiegelten Typ "{1}" kann nicht abgeleitet werden.
es: '{0}': no puede derivar del tipo sellado '{1}'
fr: '{0}' : dérivation du type sealed '{1}' impossible
it: '{0}' non può derivare dal tipo sealed '{1}'
ja: '{0}': シール型 '{1}' から派生することはできません
ko: '{0}': sealed 형식 '{1}'에서 파생될 수 없습니다.
pl: „{0}”: pochodzenie od zapieczętowanego typu „{1}” jest niemożliwe
pt_br: "{0}": não é possível derivar do tipo sealed "{1}"
ru: "{0}": не может быть производным от запечатанного типа "{1}".
tr: '{0}': korumalı '{1}' türünden türetilemiyor
zh_hans: “{0}”: 无法从密封类型“{1}”派生
zh_hant: '{0}': 無法衍生自密封類型 '{1}'

# ERR_AbstractInConcreteClass
source: '{0}' is abstract but it is contained in non-abstract type '{1}'
cs: {0} je abstraktní, ale je obsažená v neabstraktním typu {1}.
fr: '{0}' est abstract, mais il est contenu dans le type non abstract '{1}'
it: '{0}' è di tipo astratto ma è contenuto nel tipo non astratto '{1}'
ja: '{0}' は抽象ですが、非抽象型の '{1}' に含まれています
pl: Element „{0}” jest abstrakcyjny, ale jest zawarty w nieabstrakcyjnym typie „{1}”
pt_br: '{0}' é abstrato, mas está contido no tipo não abstrato '{1}'
ru: "{0}" является абстрактным, но содержится в типе "{1}", который не является абстрактным.
zh_hans: “{0}”是抽象的，但它包含在非抽象类型“{1}”中
zh_hant: '{0}' 為抽象，但包含在非抽象類型 '{1}' 中

# ERR_StaticConstructorWithExplicitConstructorCall
source: '{0}': static constructor cannot have an explicit 'this' or 'base' constructor call
cs: {0}: Statický konstruktor nemůže používat explicitní volání konstruktoru this nebo base.
de: '"{0}": Ein statischer Konstruktor kann keinen expliziten this- oder base-Konstruktoraufruf enthalten.
es: '{0}': el constructor estático no puede tener ninguna llamada de constructor 'this' o 'base' explícita
fr: '{0}' : un constructeur statique ne peut pas avoir d'appel de constructeur 'this' ou 'base' explicite
it: '{0}': un costruttore statico non può avere una chiamata esplicita al costruttore 'this' o 'base'
ja: '{0}': 静的コンストラクターは、明示的な 'this' または 'base' コンストラクターの呼び出しを含むことはできません
ko: '{0}': 정적 생성자에는 명시적 'this' 또는 'base' 생성자 호출을 사용할 수 없습니다.
pl: „{0}”: konstruktor statyczny nie może zawierać jawnego wywołania konstruktora „this” lub „base”
pt_br: "{0}": construtor estático não pode ter uma chamada de construtor "this" ou "base" explícita
ru: "{0}": статический конструктор не может иметь явный вызов конструктора "this" или "base".
tr: '{0}': statik oluşturucuların açık bir 'this' veya 'base' oluşturucu çağrısı olamaz
zh_hans: “{0}”: 静态构造函数不能具有显式的“this”或“base”构造函数调用
zh_hant: '{0}': 靜態建構函式不可有明確的 'this' 或 'base' 建構函式呼叫

# ERR_StaticConstructorWithAccessModifiers
source: '{0}': access modifiers are not allowed on static constructors
cs: {0}: Modifikátory přístupu nejsou povolené pro statické konstruktory.
de: '"{0}": Zugriffsmodifizierer sind bei statischen Konstruktoren nicht zulässig.
es: '{0}': no se permiten modificadores de acceso en constructores estáticos
fr: '{0}' : les modificateurs d'accès ne sont pas autorisés sur les constructeurs statiques
it: '{0}': i modificatori di accesso non sono consentiti su costruttori statici
ja: '{0}': アクセス修飾子は静的コンストラクターでは許可されていません
ko: '{0}': 정적 생성자에서는 액세스 한정자를 사용할 수 없습니다.
pl: „{0}”: modyfikatory dostępu są niedozwolone dla konstruktorów statycznych
pt_br: "{0}": modificadores de acesso não são permitidos em construtores estáticos
ru: "{0}": модификаторы доступа для статических конструкторов не разрешены.
tr: '{0}': erişim değiştiricilerine statik oluşturucularda izin verilmez
zh_hans: “{0}”: 静态构造函数中不允许出现访问修饰符
zh_hant: '{0}': 靜態建構函式中不可使用存取修飾詞

# ERR_RecursiveConstructorCall
source: Constructor '{0}' cannot call itself
cs: Konstruktor {0} nemůže volat sám sebe.
de: Der Konstruktor "{0}" kann sich nicht selbst aufrufen.
es: El constructor '{0}' no se puede llamar a sí mismo
fr: Le constructeur '{0}' ne peut pas s'appeler lui-même
it: Il costruttore '{0}' non può chiamare se stesso
ja: コンストラクター '{0}' で、それ自体を呼び出すことはできません:
ko: {0}' 생성자는 자신을 호출할 수 없습니다.
pl: Konstruktor „{0}” nie może wywołać sam siebie
pt_br: Construtor "{0}" não pode chamar a si mesmo
ru: Конструктор "{0}" не может вызвать сам себя
tr: {0}' oluşturucusu kendisini çağıramaz
zh_hans: 构造函数“{0}”不能调用自身
zh_hant: 建構函式 '{0}' 不可呼叫其本身

# ERR_IndirectRecursiveConstructorCall
source: Constructor '{0}' cannot call itself through another constructor
cs: Konstruktor {0} nemůže volat sám sebe přes jiný konstruktor.
de: Der Konstruktor "{0}" kann sich nicht über einen anderen Konstruktor selbst aufrufen.
es: El constructor '{0}' no puede llamarse a sí mismo a través de otro constructor
fr: Le constructeur '{0}' ne peut pas s'appeler lui-même via un autre constructeur
it: Il costruttore '{0}' non può chiamare se stesso tramite un altro costruttore
ja: コンストラクター '{0}' で、それ自体を別のコンストラクターを通して呼び出すことはできません
ko: {0}' 생성자는 다른 생성자를 통해 자신을 호출할 수 없습니다.
pl: Konstruktor „{0}” nie może wywołać się za pośrednictwem innego konstruktora
pt_br: O construtor '{0}' não pode chamar a si mesmo por meio de outro construtor
ru: Конструктор "{0}" не может вызвать сам себя посредством другого конструктора
tr: {0}' oluşturucusu başka bir oluşturucu üzerinden kendisini çağıramaz
zh_hans: 构造函数“{0}”无法通过另一构造函数调用自身
zh_hant: 建構函式 '{0}' 不可透過其他建構函式呼叫自己

# ERR_ObjectCallingBaseConstructor
source: '{0}' has no base class and cannot call a base constructor
cs: {0} nemá žádnou základní třídu a nemůže volat konstruktor base.
de: '"{0}" hat keine Basisklasse und kann keinen Basiskonstruktor aufrufen.
es: '{0}' no tiene clase base y no puede llamar a un constructor base
fr: '{0}' n'a pas de classe de base et ne peut pas appeler de constructeur de base
it: '{0}' non ha una classe base e non può chiamare un costruttore base
ja: '{0}' には基底クラスがないため、基底コンストラクターを呼び出せません
ko: '{0}'에는 기본 클래스가 없으므로 기본 생성자를 호출할 수 없습니다.
pl: Element „{0}” nie ma klasy bazowej i nie może wywołać konstruktora bazowego
pt_br: "{0}" não tem classe base e não pode chamar um construtor base
ru: "{0}" не имеет базового класса и не может вызвать базовый конструктор.
tr: '{0}' temel sınıfa sahip değil ve temel oluşturucu çağıramaz
zh_hans: “{0}”没有基类，无法调用基构造函数
zh_hant: '{0}' 沒有基底類別且無法呼叫基底建構函式

# ERR_PredefinedTypeNotFound
source: Predefined type '{0}' is not defined or imported
cs: Předdefinovaný typ {0} není definovaný ani importovaný.
de: Der vordefinierte Typ "{0}" ist nicht definiert oder importiert.
es: El tipo predefinido '{0}' no está definido ni importado
fr: Le type prédéfini '{0}' n'est pas défini ou importé
it: Il tipo predefinito '{0}' non è definito né importato
ja: 定義済みの型 '{0}' は定義、またはインポートされていません
ko: 미리 정의된 형식 '{0}'을(를) 정의하지 않았거나 가져오지 않았습니다.
pl: Wstępnie zdefiniowany typ „{0}” nie został zdefiniowany ani zaimportowany.
pt_br: O tipo pré-definido "{0}" não foi definido ou importado
ru: Предопределенный тип "{0}" не определен или не импортирован
tr: Önceden tanımlanmış '{0}' türü tanımlanmamış veya içeri aktarılmamış
zh_hans: 预定义类型“{0}”未定义或导入
zh_hant: 未定義或匯入預先定義的類型 '{0}'

# ERR_PredefinedValueTupleTypeNotFound
source: Predefined type '{0}' is not defined or imported
cs: Předdefinovaný typ {0} není definovaný ani importovaný.
de: Der vordefinierte Typ "{0}" ist nicht definiert oder importiert.
es: El tipo predefinido '{0}' no está definido ni importado
fr: Le type prédéfini '{0}' n'est pas défini ou importé
it: Il tipo predefinito '{0}' non è definito né importato
ja: 定義済みの型 '{0}' は定義、またはインポートされていません
ko: 미리 정의된 형식 '{0}'을(를) 정의하지 않았거나 가져오지 않았습니다.
pl: Wstępnie zdefiniowany typ „{0}” nie został zdefiniowany ani zaimportowany.
pt_br: O tipo pré-definido "{0}" não foi definido ou importado
ru: Предопределенный тип "{0}" не определен или не импортирован
tr: Önceden tanımlanmış '{0}' türü tanımlanmamış veya içeri aktarılmamış
zh_hans: 预定义类型“{0}”未定义或导入
zh_hant: 未定義或匯入預先定義的類型 '{0}'

# ERR_PredefinedTypeAmbiguous
source: Predefined type '{0}' is declared in multiple referenced assemblies: '{1}' and '{2}'
it: Il tipo predefinito '{0}' è dichiarato in più assembly di riferimento: '{1}' e '{2}'
pt_br: O tipo predefinido ‘{0}’ é declarado em vários assemblies referenciados: ‘{1}’ e ‘{2}’
ru: Предопределенный тип "{0}" объявлен в нескольких сборках, на которые имеются ссылки: "{1}" и "{2}"
zh_hans: 已在多个引用的程序集(“{1}”和“{2}”)中声明了预定义类型“{0}”

# ERR_StructWithBaseConstructorCall
source: '{0}': structs cannot call base class constructors
cs: {0}: Struktury nemůžou volat konstruktor základní třídy.
de: '"{0}": Strukturen können keine Basisklassenkonstruktoren aufrufen.
es: '{0}': las estructuras no pueden llamar a constructores de clase base
fr: '{0}' : les structs ne peuvent pas appeler les constructeurs de classe de base
it: '{0}': le struct non possono chiamare costruttori della classe base
ja: '{0}': 構造体は、基底クラスのコンストラクターを呼び出すことができません
ko: '{0}': 구조체는 기본 클래스 생성자를 호출할 수 없습니다.
pl: „{0}”: struktury nie mogą wywoływać konstruktorów klasy bazowej
pt_br: "{0}": structs não podem chamar construtores de classe base
ru: "{0}": структуры не могут вызывать конструкторы базового класса.
tr: '{0}': yapılar temel sınıf oluşturucularını çağıramaz
zh_hans: “{0}”: 结构无法调用基类构造函数
zh_hant: '{0}': 結構無法呼叫基底類別建構函式
