Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InterpolatedStringHandlerArgumentOptionalNotSpecified
source: Parameter '{0}' is not explicitly provided, but is used as an argument to the interpolated string handler conversion on parameter '{1}'. Specify the value of '{0}' before '{1}'.
cs: Parametr {0} není explicitně zadaný, ale používá se jako argument pro převod interpolované obslužné rutiny řetězce v parametru {1}. Zadejte hodnotu {0} před {1}.
fr: Le paramètre « {0} » n’est pas fourni explicitement, mais est utilisé en tant qu’argument pour la conversion du gestionnaire de chaîne interpolé sur le paramètre « {1} ». Spécifiez la valeur de « {0} » avant « {1} ».
it: Il parametro '{0}' non è specificato in modo esplicito, ma viene usato come argomento della conversione del gestore di stringhe interpolate nel parametro '{1}'. Specificare il valore di '{0}' prima di '{1}'.
ja: パラメーター '{0}' は明示的に指定されていませんが、パラメーター '{1}' で補間された文字列ハンドラーの変換への引数として使用されています。'{1}' の前に '{0}' の値を指定してください。
pl: Parametr „{0}” nie został jawnie podany, ale jest używany jako argument konwersji interpolowanej procedury obsługi ciągów dla parametru „{1}”. Określ wartość „{0}” przed „{1}”.
pt_br: O parâmetro '{0}' não é fornecido explicitamente, mas é usado como um argumento para a conversão do manipulador de cadeia de caracteres interpolada no parâmetro '{1}'. Especifique o valor de '{0}' antes de '{1}'.
ru: Параметр "{0}" явно не указан, но он используется в качестве аргумента для преобразования обработчика интерполированной строки в параметре "{1}". Укажите значение "{0}" перед "{1}".
zh_hans: 未显式提供参数“{0}”，它用作参数“{1}”上的内插字符串处理程序转换的参数。请在“{1}”之前指定“{0}”的值。
zh_hant: 未明確提供參數 '{0}'，但做為參數 '{1}' 上插補字串處理常式轉換的引數。在 '{1}' 之前先指定 '{0}' 的值。

# ERR_InterpolatedStringHandlerCreationCannotUseDynamic
source: An interpolated string handler construction cannot use dynamic. Manually construct an instance of '{0}'.
cs: Konstrukce obslužné rutiny interpolovaného řetězce nemůže používat dynamickou hodnotu. Vytvořte instanci {0} ručně.
fr: Une construction de gestionnaire de chaîne interpolée ne peut pas utiliser Dynamic. Construisez manuellement une instance de « {0} ».
it: Per la costruzione di un gestore di stringhe interpolate non è possibile usare dynamic. Costruire manualmente un'istanza di '{0}'.
ja: 補間された文字列ハンドラー構築で動的を使用することはできません。'{0}' のインスタンスを手動で構築してください。
pl: W konstrukcji procedury obsługi ciągów interpolowanych nie można używać dynamicznych składowych. Ręcznie utwórz wystąpienie elementu "{0}".
pt_br: Uma construção de manipulador de cadeia de caracteres interpolada não pode usar dinâmica. Construa manualmente uma instância de '{0}'.
ru: Конструкция обработчика интерполированных строк не может использовать dynamic. Создайте экземпляр "{0}" вручную.
zh_hans: 内插字符串处理程序构造不能使用动态。请手动构建“{0}”的实例。
zh_hant: 差補字串處理常式建構不能使用動態。手動建構 '{0}' 的執行個體。

# ERR_InterpolatedStringHandlerMethodReturnInconsistent
source: Interpolated string handler method '{0}' has inconsistent return type. Expected to return '{1}'.
cs: Metoda obslužné rutiny interpolovaného řetězce {0} má nekonzistentní návratový typ. Očekávalo se, že se vrátí {1}.
fr: La méthode de gestionnaire de chaîne interpolée « {0} » a un type de retour incohérent. Le retour de « {1} » est attendu.
it: Il tipo restituito del metodo del gestore di stringhe interpolate '{0}' è incoerente. Dovrebbe essere restituito '{1}'.
ja: 補間された文字列ハンドラー メソッド '{0}' の戻り値の型が一致しません。'{1}' を返す必要があります。
pl: Metoda obsługi ciągu interpolowanego „{0}” ma niespójny zwracany typ. Oczekiwano zwrócenia elementu „{1}”.
pt_br: O método do manipulador de cadeias de caracteres interpolado '{0}' tem tipo de retorno inconsistente. Esperava-se retornar '{1} '.
ru: Метод обработчика интерполированной строки "{0}" имеет несогласованный тип возвращаемого значения. Ожидаемый тип возвращаемого значения "{1}".
zh_hans: 内插字符串处理程序方法“{0}”具有不一致的返回类型。预期返回“{1}”。
zh_hant: 差補字串處理常式方法 '{0}' 的傳回型別不一致。預期會傳回 '{1}'。

# ERR_InterpolatedStringHandlerMethodReturnMalformed
source: Interpolated string handler method '{0}' is malformed. It does not return 'void' or 'bool'.
cs: Metoda obslužné rutiny interpolovaného řetězce {0} je poškozená. Nevrací hodnoty void ani bool.
fr: La méthode du gestionnaire de chaînes interpolées « {0} » est incorrecte. Il ne retourne pas « void » ou « bool ».
it: Il formato del metodo di gestione delle stringhe interpolate '{0}' non è valido. Non restituisce 'void' o 'bool'.
ja: 補間された文字列ハンドラー メソッド '{0}' の形式が正しくありません。'void' または 'bool' を返すことはありません。
pl: Metoda procedury obsługi ciągu interpolowanego "{0}" ma nieprawidłową postać. Nie zwraca ona wartości "void" lub "bool".
pt_br: O método do manipulador de cadeia de caracteres interpolada '{0}' está malformado. Ele não retorna 'void' ou 'bool'.
ru: Неверный формат метода обработчика интерполированных строк "{0}". Он не возвращает значения "void" или "bool".
zh_hans: 内插字符串处理程序方法“{0}”格式错误。它不返回“void”或“bool”。
zh_hant: 差補字串處理常式方法 '{0}' 格式不正確。它不會傳回 'void' 或 'bool'。

# ERR_InterpolatedStringsReferencingInstanceCannotBeInObjectInitializers
source: Interpolated string handler conversions that reference the instance being indexed cannot be used in indexer member initializers.
cs: Převody interpolovaných obslužných rutin řetězců, které odkazují na indexovanou instanci, se nedají použít v inicializátorech členů indexeru.
fr: Les conversions de gestionnaires de chaînes interpolées qui font référence à l'instance en cours d'indexation ne peuvent pas être utilisées dans les initialiseurs de membres d'indexeur.
it: Le conversioni di gestori di stringhe interpolate che fanno riferimento all'istanza indicizzata non possono essere utilizzate negli inizializzatori di membri dell'indicizzatore.
ja: インデックス付けされているインスタンスを参照する補間された文字列ハンドラーの変換は、インデクサー メンバー初期化子では使用できません。
pl: W inicjatorach składowych indeksatora nie można używać konwersji procedury obsługi ciągów interpolowanych odwołujących się do indeksowanego wystąpienia.
pt_br: Conversões do manipulador de cadeia de caracteres interpoladas que fazem referência à instância que está sendo indexada não podem ser usadas em inicializadores de membros indexadores.
ru: Преобразования обработчика интерполированной строки, ссылающиеся на индексируемый экземпляр, нельзя использовать в инициализаторах элементов индексатора.
zh_hans: 引用要编制索引的实例的内插字符串处理程序转换不能用于索引器成员初始化表达式中。
zh_hant: 參考要編制索引的執行個體的差補字串處理常式轉換無法用於索引子成員初始化程式。

# ERR_InvalidExperimentalDiagID
source: The diagnosticId argument to the 'Experimental' attribute must be a valid identifier
fr: L’argument diagnosticId de l’attribut « Experimental » doit être un identificateur valide
it: L'argomento diagnosticId dell'attributo 'Experimental' deve essere un identificatore valido
pl: Argument diagnosticId atrybutu „Experimental” musi być prawidłowym identyfikatorem
pt_br: O argumento diagnosticId para o atributo 'Experimental' deve ser um identificador válido
ru: Аргумент diagnosticId атрибута "Experimental" должен быть допустимым идентификатором
zh_hans: “Experimental” 属性的 diagnosticId 参数必须是有效的标识符
zh_hant: 'Experimental' 屬性的 diagnosticId 引數必須是有效的識別碼

# ERR_RuntimeDoesNotSupportExtendedLayoutTypes
source: The target runtime does not support extended layout types.
pt_br: O runtime de destino não dá suporte a tipos de layout estendidos.

# ERR_InvalidExtensionParameterReference
source: Cannot use extension parameter '{0}' in this context.
pt_br: Não é possível usar o parâmetro de extensão "{0}" neste contexto.

# ERR_InvalidFuncPointerReturnTypeModifier
source: '{0}' is not a valid function pointer return type modifier. Valid modifiers are 'ref' and 'ref readonly'.
cs: {0} není platný modifikátor návratového typu ukazatele na funkci. Platné modifikátory jsou ref a ref readonly.
fr: '{0}' n'est pas un modificateur de type de retour de pointeur de fonction valide. Les modificateurs valides sont 'ref' et 'ref readonly'.
it: '{0}' non è un modificatore di tipo restituito di puntatore a funzione valido. I modificatori validi sono 'ref' e 'ref readonly'.
ja: '{0}' は有効な関数ポインターの戻り値の型修飾子ではありません。有効な修飾子は 'ref ' および 'ref readonly' です。
pl: Element „{0}” nie jest prawidłowym modyfikatorem zwracanego typu wskaźnikowego funkcji. Prawidłowe modyfikatory to „ref” i „ref readonly”.
pt_br: '{0}' não é um modificador de tipo de retorno de ponteiro de função válido. Os modificadores válidos são 'ref' e 'ref readonly'.
ru: "{0}" не является допустимым модификатором типа для возвращаемого значения указателя на функцию. Допустимые модификаторы: ref и ref readonly.
zh_hans: “{0}”不是有效的函数指针返回类型修饰符。有效的修饰符为 "ref" 和 "ref readonly"。
zh_hant: '{0}'不是有效的函式指標傳回型別修飾元。有效的修飾元為 'ref' 與 'ref readonly'。

# ERR_InvalidFunctionPointerCallingConvention
source: '{0}' is not a valid calling convention specifier for a function pointer.
cs: {0} není platný specifikátor konvence volání pro ukazatel na funkci.
fr: '{0}' n'est pas un spécificateur de convention d'appel valide pour un pointeur de fonction.
it: '{0}' non è un identificatore di convenzione di chiamata valido per un puntatore a funzione.
ja: '{0}' は関数ポインターの有効な呼び出し規則指定子ではありません。
pl: Element „{0}” nie jest prawidłowym specyfikatorem konwencji wywoływania dla wskaźnika funkcji.
pt_br: '{0}' não é um especificador de convenção de chamada válido para um ponteiro de função.
ru: "{0}" не является допустимым соглашением о вызовах для указателя на функцию.
zh_hans: “{0}”不是函数指针的有效调用约定说明符。
zh_hant: '{0}' 對函式指標而言，不是有效的呼叫慣例指定名稱。

# ERR_InvalidHashAlgorithmName
source: Invalid hash algorithm name: '{0}'
cs: Neplatný název algoritmu hash: {0}
de: Ungültiger Name für Hashalgorithmus: "{0}"
es: Nombre de algoritmo hash no válido: "{0}"
fr: Nom d'algorithme de hachage non valide : '{0}'
it: Il nome dell'algoritmo hash non è valido: '{0}'
ja: 無効なハッシュ アルゴリズム名: '{0}'
ko: 잘못된 해시 알고리즘 이름: '{0}'
pl: Nieprawidłowa nazwa algorytmu wyznaczania wartości skrótu: „{0}”
pt_br: Nome de algoritmo de hash inválido: '{0}'
ru: Недопустимое имя хэш-алгоритма: "{0}"
tr: Geçersiz karma algoritması adı: '{0}'
zh_hans: 无效的哈希算法名称:“{0}”
zh_hant: 雜湊演算法名稱無效: '{0}'

# ERR_InvalidInlineArrayFields
source: Inline array struct must declare one and only one instance field.
fr: La structure de tableau en ligne doit déclarer un et un seul champ d'instance.
it: La struttura della matrice inline deve dichiarare un solo campo di istanza.
ja: インライン配列構造体では、インスタンス フィールドを 1 つだけ宣言する必要があります。
pl: Struktura tablicy śródwierszowej musi deklarować jedno i tylko jedno pole wystąpienia.
pt_br: O struct de matriz embutido deve declarar apenas um campo de instância.
ru: Структура встроенного массива должна объявлять одно и только одно поле экземпляра.
zh_hans: 内联数组结构必须声明一个且仅声明一个实例字段。
zh_hant: 內嵌陣列結構必須宣告一個且只可有一個執行個體欄位。

# ERR_InvalidInlineArrayLayout
source: Inline array struct must not have explicit layout.
fr: La structure de tableau en ligne ne doit pas avoir de mise en page explicite.
it: La struttura di matrice inline non deve avere un layout esplicito.
ja: インライン配列構造体に明示的なレイアウトを含めることはできません。
pl: Struktura tablicy śródwierszowej nie może mieć układu jawnego.
pt_br: O struct de matriz embutido não deve ter layout explícito.
ru: Структура встроенного массива не должна иметь явного макета.
zh_hans: 内联数组结构不得具有显式布局。
zh_hant: 內嵌陣列結構不可有明確的版面配置。

# ERR_InvalidInlineArrayLength
source: Inline array length must be greater than 0.
fr: La longueur du tableau en ligne doit être supérieure à 0.
it: La lunghezza della matrice inline deve essere maggiore di 0.
ja: インライン配列の長さは、0 より大きくなければいけません。
pl: Długość tablicy śródwierszowej musi być większa niż 0.
pt_br: O comprimento da matriz embutida deve ser maior que 0.
ru: Длина встроенного массива должна быть больше 0.
zh_hans: 内联数组长度必须大于 0。
zh_hant: 內嵌陣列長度必須大於 0。

# ERR_InvalidInterpolatedStringHandlerArgumentName
source: '{0}' is not a valid parameter name from '{1}'.
cs: {0} není platný název parametru z {1}.
fr: « {0} » n’est pas un nom de paramètre valide de « {1} ».
it: '{0}' non è un nome di parametro valido da '{1}'.
ja: '{0}' は、'{1}' からの有効なパラメーター名ではありません。
pl: „{0}” nie jest prawidłową nazwą parametru z elementu „{1}”.
pt_br: '{0}' não é um nome de parâmetro válido de '{1}'.
ru: "{0}" не является допустимым именем параметра из "{1}".
zh_hans: “{0}”不是来自“{1}”的有效参数名称。
zh_hant: '{0}' 不是來自 '{1}' 的有效參數名稱。

# ERR_InvalidModifierAfterScoped
source: The '{0}' modifier cannot immediately follow the 'scoped' modifier.
pt_br: O modificador "{0}" não pode seguir imediatamente o modificador "scoped".

# ERR_InvalidModifierForLanguageVersion
source: The modifier '{0}' is not valid for this item in C# {1}. Please use language version '{2}' or greater.
cs: Modifikátor {0} není platný pro tuto položku v jazyce C# {1}. Použijte prosím verzi jazyka {2} nebo vyšší.
fr: Le modificateur '{0}' est non valide pour cet élément en C# {1}. Utilisez la version de langage '{2}' ou une version ultérieure.
it: Il modificatore '{0}' non è valido per questo elemento in C# {1}. Usare la versione '{2}' o versioni successive del linguaggio.
ja: C# {1} では、修飾子 '{0}' はこの項目に対して有効ではありません。'{2}' 以上の言語バージョンをご使用ください。
pl: Modyfikator „{0}” nie jest prawidłowy dla tego elementu w języku C# {1}. Użyj wersji języka „{2}” lub nowszej.
pt_br: O modificador '{0}' não é válido para este item no C# {1}. Use a versão de linguagem '{2}' ou superior.
ru: Модификатор "{0}" недопустим для этого элемента в C# {1}. Используйте версию языка "{2}" или более позднюю.
zh_hans: 在 C# {1} 中，修饰符 "{0}" 对此项无效。请使用语言版本 "{2}" 或更高版本。
zh_hant: 修飾元 '{0}' 在 C# {1} 中對此項目無效。請使用 '{2}' 或更高的語言版本。

# ERR_InvalidNameInSubpattern
source: Identifier or a simple member access expected.
cs: Očekával se identifikátor nebo jednoduchý přístup člena.
fr: L’identificateur ou un accès à un membre simple était attendu.
it: È previsto un accesso a un membro semplice o a un identificatore.
ja: 識別子または単純なメンバー アクセスが必要です。
pl: Oczekiwano dostępu do identyfikatora lub prostej składowej.
pt_br: Identificador ou um acesso de membro simples esperado.
ru: Ожидается доступ к идентификатору или простому элементу.
zh_hans: 应为标识符或简单成员访问权限。
zh_hant: 必須是識別碼或簡單成員存取。

# ERR_InvalidObjectCreation
source: Invalid object creation
cs: Vytvoření neplatného objektu
de: Ungültige Objekterstellung
es: Creación de objeto no válida
fr: Création d'objet non valide
it: Creazione oggetto non valida
ja: 無効なオブジェクト作成
ko: 잘못된 개체 만들기
pl: Nieprawidłowa operacja tworzenia obiektu
pt_br: Criação de objeto inválido
ru: Недопустимое создание объекта
tr: Geçersiz nesne oluşturma
zh_hans: 对象创建无效
zh_hant: 無效的物件建立

# ERR_InvalidPrimaryConstructorParameterReference
source: Cannot use primary constructor parameter '{0}' in this context.
cs: V tomto kontextu nejde použít parametr primárního konstruktoru {0}.
fr: Impossible d’utiliser le paramètre de constructeur principal '{0}' dans ce contexte.
it: Non è possibile usare il parametro del costruttore primario '{0}' in questo contesto.
ja: このコンテキストでは、プライマリ コンストラクター パラメーター '{0}' を使用できません。
pl: W tym kontekście nie można użyć podstawowego parametru konstruktora '{0}'.
pt_br: Não é possível usar o parâmetro de construtor primário "{0}" neste contexto.
ru: Невозможно использовать параметр основного конструктора "{0}" в этом контексте.
zh_hans: 无法在此上下文中使用主构造函数参数“{0}”。
zh_hant: 無法在此內容中使用主要建構函式參數 '{0}'。

# ERR_InvalidPropertyReadOnlyMods
source: Cannot specify 'readonly' modifiers on both property or indexer '{0}' and its accessor. Remove one of them.
cs: Pro vlastnost nebo indexer {0} i jejich přístupový objekt nelze zadat modifikátory readonly. Odeberte jeden z nich.
de: readonly-Modifizierer können nicht sowohl für die Eigenschaft oder den Indexer "{0}" und den zugehörigen Accessor angegeben werden. Entfernen Sie einen davon.
es: No se pueden especificar modificadores "readonly" en la propiedad o el indizador "{0}" y su descriptor de acceso. Quite uno de ellos.
fr: Impossible de spécifier des modificateurs 'readonly' sur la propriété ou l'indexeur '{0}' et son accesseur. Supprimez l'un d'entre eux.
it: Non è possibile specificare i modificatori 'readonly' nella proprietà o nell'indicizzatore '{0}' e nella relativa funzione di accesso. Rimuoverne uno.
ja: プロパティまたはインデクサー '{0}' とそのアクセサーの両方で 'readonly' 修飾子を指定することはできません。いずれかを削除してください。
ko: '{0}' 속성 또는 인덱서 및 해당 접근자 둘 다에 'readonly' 한정자를 지정할 수 없습니다. 둘 중 하나를 제거하세요.
pl: Nie można określić modyfikatorów „readonly” jednocześnie dla właściwości lub indeksatora „{0}” i jego metody dostępu. Usuń jeden z nich.
pt_br: Não é possível especificar modificadores 'readonly' na propriedade ou no indexador '{0}' e em seu acessador. Remova um deles.
ru: Запрещено указывать модификаторы readonly для свойства или индексатора "{0}" и его метода доступа. Удалите один из них.
tr: 'readonly' değiştiricileri '{0}' özelliğinin veya dizin oluşturucusunun her ikisiyle birlikte erişimcilerinde de değiştirilemez. Bunlardan birini kaldırın.
zh_hans: 不能在属性或索引器 "{0}" 及其访问器上指定 "readonly" 修饰符。请删除其中一个。
zh_hant: 無法同時在屬性或索引子 '{0}' 和其存取子上同時指定 'readonly' 修飾元。請移除其中一個。

# ERR_InvalidStackAllocArray
source: "Invalid rank specifier: expected ']'
cs: Specifikátor rozsahu je neplatný. Očekávala se pravá hranatá závorka ].
de: "Ungültiger Rangspezifizierer: Erwartet wurde ]
es: "Especificador de rango no válido: se esperaba "]""
fr: "Spécificateur de rang non valide : ']' attendu
it: "L'identificatore del numero di dimensioni non è valido: è previsto ']'
ja: "無効な次元指定子です: ']' を指定してください
ko: 잘못된 차수 지정자입니다. ']'가 필요합니다.
pl: Nieprawidłowy specyfikator rangi: oczekiwano „]”
pt_br: "Especificador de classificação inválido: era esperado ']'
ru: "Недопустимый описатель ранга: ожидается "]"
tr: "IGeçersiz sıra belirticisi: ']' bekleniyor
zh_hans: “无效的秩说明符: 应为“]”
zh_hant: "陣序規範無效: 必須是 ']'

# ERR_InvalidUnmanagedCallersOnlyCallConv
source: '{0}' is not a valid calling convention type for 'UnmanagedCallersOnly'.
cs: {0} není platný typ konvence volání pro UnmanagedCallersOnly.
fr: '{0}' n'est pas un type de convention d'appel valide pour 'UnmanagedCallersOnly'.
it: '{0}' non è un tipo di convenzione di chiamata valido per 'UnmanagedCallersOnly'.
ja: '{0}' は 'UnmanagedCallersOnly' の有効な呼び出し規則の種類ではありません。
pl: Element „{0}” nie jest prawidłowym specyfikatorem konwencji wywoływania dla atrybutu „UnmanagedCallersOnly”.
pt_br: '{0}' não é um tipo de convenção de chamada válido para 'UnmanagedCallersOnly'.
ru: "{0}" не является допустимым типом соглашения о вызовах для "UnmanagedCallersOnly".
zh_hans: 对于 "UnmanagedCallersOnly" 来说，“{0}”不是有效的调用约定类型。
zh_hant: '{0}' 對 'UnmanagedCallersOnly' 而言，不是有效的呼叫慣例類型。

# ERR_InvalidWithReceiverType
source: The receiver of a `with` expression must have a non-void type.
cs: Příjemce výrazu with musí mít neprázdný typ.
fr: Le récepteur d'une expression 'with' doit avoir un type non nul.
it: Il ricevitore di un'espressione `with` deve avere un tipo non void.
ja: 'with' 式のレシーバーは、void でない型でなければなりません。
pl: Odbiorca wyrażenia „with” musi mieć typ inny niż void.
pt_br: O receptor de uma expressão `with` precisa ter um tipo não nulo.
ru: Получатель выражения "with" должен иметь тип, отличный от void.
zh_hans: `with` 表达式的接收器必须具有非空类型。
zh_hant: 'with' 運算式的接收器不得為 void 類型。

# ERR_IsNullableType
source: It is not legal to use nullable reference type '{0}?' in an is-type expression; use the underlying type '{0}' instead.
cs: Ve výrazu is-type se nepovoluje použití typu odkazu s možnou hodnotou null {0}?; místo toho použijte základní typ {0}.
de: Es ist unzulässig, den Nullable-Verweistyp "{0}?" in einem is-Ausdruck zu verwenden. Verwenden Sie stattdessen den zugrunde liegenden Typ "{0}".
es: No se puede usar el tipo "{0}?" que acepta valores NULL en una expresión is-type; use en su lugar el tipo "{0}" subyacente.
fr: Il n'est pas correct d'utiliser le type de référence Nullable '{0}?' dans une expression is-type. Utilisez le type sous-jacent '{0}' à la place.
it: Non è consentito usare il tipo riferimento nullable '{0}?' in un'espressione is-type. Usare il tipo sottostante '{0}'.
ja: is-type 式で Null 許容参照型 '{0}?' を使用することはできません。代わりに基になる型 '{0}' をご使用ください。
ko: is-type 식에 nullable 참조 형식 '{0}?'을(를) 사용하는 것은 올바르지 않습니다. 대신 기본 형식 '{0}'을(를) 사용하세요.
pl: Użycie typu odwołania dopuszczającego wartość null „{0}?” w wyrażeniu „is-type” jest niedozwolone. Zamiast tego użyj bazowego typu „{0}”.
pt_br: É ilegal usar o tipo de referência anulável '{0}?' em uma expressão is-type; use o tipo subjacente '{0}' em seu lugar.
ru: Недопустимо использовать ссылочный тип "{0}", допускающий значения NULL, в выражении "is-type". Используйте вместо него базовый тип "{0}".
tr: Boş değer atanabilir '{0}?' başvuru türünün bir is-type ifadesinde kullanılması yasaktır; bunun yerine temel alınan '{0}' türünü kullanın.
zh_hans: 在 is-type 表达式中使用可以为 null 的引用类型“{0}?”是非法的；请改用基础类型“{0}”。
zh_hant: 在 is-type 運算式中使用可為 Null 的參考型別 '{0}' 不合法嗎? 請改用基礎類型 '{0}'。

# ERR_IsPatternImpossible
source: An expression of type '{0}' can never match the provided pattern.
cs: Výraz typu {0} nesmí nikdy odpovídat poskytnutému vzoru.
de: Ein Ausdruck vom Typ "{0}" kann niemals dem angegebenen Muster entsprechen.
es: Una expresión de tipo "{0}" no puede coincidir nunca con el patrón proporcionado.
fr: Une expression de type '{0}' ne peut jamais correspondre au modèle fourni.
it: Un'espressione di tipo '{0}' non può mai corrispondere al criterio specificato.
ja: 型 '{0}' の式は指定されたパターンと絶対に一致しません。
ko: '{0}' 형식의 식은 제공된 패턴과 일치할 수 없습니다.
pl: Wyrażenie typu „{0}” nigdy nie zostanie dopasowane do podanego wzorca.
pt_br: Uma expressão do tipo '{0}' nunca pode corresponder ao padrão fornecido.
ru: Выражение типа "{0}" невозможно сопоставить с указанным шаблоном.
tr: '{0}' türündeki bir ifade asla sağlanan desenle eşleşemez.
zh_hans: 类型“{0}”的表达式永远不会与提供的模式匹配。
zh_hant: 類型為 '{0}' 的運算式永遠無法符合提供的模式。

# ERR_IteratorMustBeAsync
source: Method '{0}' with an iterator block must be 'async' to return '{1}'
cs: Metoda {0} s blokem iterátoru musí být asynchronní, aby vrátila {1}.
de: Die Methode "{0}" mit einem Iteratorblock muss "async" lauten, um "{1}" zurückzugeben.
es: El método "{0}" con un bloqueo de iterador debe ser "asincrónico" para devolver "{1}"
fr: La méthode '{0}' avec un bloc itérateur doit être 'async' pour retourner '{1}'
it: Il metodo '{0}' con un blocco iteratore deve essere 'async' per restituire '{1}'
ja: 反復子ブロックを伴うメソッド '{0}' が '{1}' を返すには 'async' でなければなりません
ko: {1}'을(를) 반환하려면 반복기 블록이 있는 '{0}' 메서드가 '비동기'여야 합니다.
pl: Metoda „{0}” z blokiem iteratora musi być oznaczona jako „async”, aby zwrócić „{1}”
pt_br: O método '{0}' com um bloco do iterador deve ser 'async' para retornar '{1}'
ru: Чтобы возвращать "{1}", метод "{0}" с блоком итератора должен быть асинхронным ("async").
tr: Yineleyici bloku olan '{0}' yönteminin '{1}' döndürmek için 'zaman uyumsuz' olması gerekir
zh_hans: 具有迭代器块的方法“{0}”必须是“异步的”，这样才能返回“{1}”
zh_hant: 具有迭代區塊的方法 '{0}' 必須為「非同步」才能傳回 '{1}'

# ERR_IteratorRefLikeElementType
source: Element type of an iterator may not be a ref struct or a type parameter allowing ref structs
fr: Le type d’élément d’un itérateur ne peut pas être un struct ref ou un paramètre de type autorisant les structs ref
it: Il tipo di elemento di un iteratore non può essere uno struct di riferimento o un parametro di tipo che consente struct di riferimento
pt_br: O tipo de elemento de um iterador não pode ser um struct ref ou um parâmetro de tipo que permita structs ref
ru: Тип элемента итератора не может быть структурой ссылок или параметром типа, разрешая структуры ссылок
zh_hans: 迭代器的元素类型不能是 ref 结构或允许 ref 结构的类型参数
