Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_ByValArraySizeConstRequired_Title
source: Attribute parameter 'SizeConst' must be specified.
fr: Vous devez spécifier un paramètre d’attribut « SizeConst ».
it: È necessario specificare il parametro di attributo 'SizeConst'.
pl: Należy określić parametr atrybutu „SizeConst”.
pt_br: O parâmetro de atribuição 'SizeConst' deve ser especificado.
ru: Должен быть указан параметр атрибута "SizeConst".
zh_hans: 必须指定属性参数 “SizeConst”。
zh_hant: 必須指定屬性參數 'SizeConst'。

# WRN_CallerArgumentExpressionAttributeHasInvalidParameterName
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect. It is applied with an invalid parameter name.
cs: Atribut CallerArgumentExpressionAttribute použitý u parametru {0} nebude mít žádný účinek. Argument je použitý s neplatným názvem parametru.
fr: Le CallerArgumentExpressionAttribute appliqué au paramètre « {0} » n’aura aucun effet. Il est appliqué avec un nom de paramètre non valide.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto. È applicato con un nome di parametro non valido.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、無効なパラメーター名で適用されているため無効となります
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru "{0}" nie odniesie żadnego skutku. Zastosowano go z nieprawidłową nazwą parametru.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá efeito. Ele é aplicado com um nome de parâmetro inválido.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, поскольку он применен с недопустимым именем параметра.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用。它采用了无效的参数名。
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果。它套用了不正確的參數名稱。

# WRN_CallerArgumentExpressionAttributeHasInvalidParameterName_Title
source: The CallerArgumentExpressionAttribute is applied with an invalid parameter name.
cs: Atribut CallerArgumentExpressionAttribute je použitý s neplatným názvem parametru.
fr: CallerArgumentExpressionAttribute est appliqué avec un nom de paramètre non valide.
it: CallerArgumentExpressionAttribute viene applicato con un nome di parametro non valido.
ja: CallerArgumentExpressionAttribute が無効なパラメーター名で適用されています。
pl: Atrybut CallerArgumentExpressionAttribute zastosowano z nieprawidłową nazwą parametru.
pt_br: O CallerArgumentExpressionAttribute é aplicado com um nome de parâmetro inválido.
ru: Класс CallerArgumentExpressionAttribute применен с недопустимым именем параметра.
zh_hans: CallerArgumentExpressionAttribute 采用了无效的参数名。
zh_hant: CallerArgumentExpressionAttribute 套用了不正確的參數名稱。

# WRN_CallerArgumentExpressionAttributeSelfReferential
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect because it's self-referential.
cs: CallerArgumentExpressionAttribute použitý u parametru {0} nebude mít žádný vliv, protože odkazuje sám na sebe.
fr: Le CallerArgumentExpressionAttribute appliqué au paramètre « {0} » '*n’aura aucun effet, car il est auto-référentiel.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto perché è autoreferenziale.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は自己参照であるため、無効となります。
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru „{0}” nie będzie działać, ponieważ jego odwołanie jest samodzielne.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá efeito porque é de autorreferência.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, так как он ссылается сам на себя.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用，因为它是自引用的。
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，因為它是自我參考。

# WRN_CallerArgumentExpressionAttributeSelfReferential_Title
source: The CallerArgumentExpressionAttribute applied to parameter will have no effect because it's self-refential.
cs: Atribut CallerArgumentExpressionAttribute použitý u parametru nebude mít žádný účinek, protože odkazuje sám na sebe.
fr: Le CallerArgumentExpressionAttribute appliqué au paramètre n’aura aucun effet, car il est auto-référentiel.
it: CallerArgumentExpressionAttribute applicato al parametro non avrà alcun effetto perché è autoreferenziale.
ja: パラメーターに適用された CallerArgumentExpressionAttribute は自己参照であるため、無効となります。
pl: Zastosowany atrybut CallerArgumentExpressionAttribute do parametru nie odniesie żadnego skutku, ponieważ odwołuje się sam do siebie.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro não terá efeito porque é de autorreferência.
ru: Применение класса CallerArgumentExpressionAttribute к параметру не подействует, поскольку он ссылается сам на себя.
zh_hans: 应用于参数的 CallerArgumentExpressionAttribute 将不起任何作用，因为它是自引用的。
zh_hant: 套用到參數的 CallerArgumentExpressionAttribute 將沒有效果，因為它是自我參考。

# WRN_CallerArgumentExpressionParamForUnconsumedLocation
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: Atribut CallerArgumentExpressionAttribute použitý u parametru {0} nebude mít žádný účinek, protože platí pro člena, který se používá v kontextech nepovolujících volitelné argumenty.
fr: CallerArgumentExpressionAttribute, appliqué au paramètre '{0}', n'aura aucun effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas les arguments facultatifs
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、省略可能な引数を許可しないコンテキストで使用されるメンバーに適用されるため無効となります
pl: Zastosowanie atrybutu CallerArgumentExpressionAttribute do parametru "{0}" nie odniesie żadnego skutku, ponieważ dotyczy składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá efeito porque ele se aplica a um membro que é usado em contextos que não permitem argumentos opcionais
ru: Применение CallerArgumentExpressionAttribute к параметру "{0}" не подействует, поскольку он применяется к элементу, который использован в контекстах, где не разрешены необязательные аргументы.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用，因为它适用于不允许指定可选实参的上下文中使用的成员
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，因為它套用了不允許選擇性引數的內容中所使用之成員

# WRN_CallerArgumentExpressionParamForUnconsumedLocation_Title
source: The CallerArgumentExpressionAttribute will have no effect because it applies to a member that is used in contexts that do not allow optional arguments
cs: Atribut CallerArgumentExpressionAttribute nebude mít žádný účinek, protože platí pro člena, který se používá v kontextech nedovolujících nepovinné argumenty.
fr: CallerArgumentExpressionAttribute n'aura pas d'effet, car il s'applique à un membre utilisé dans des contextes qui n'autorisent pas d'arguments facultatifs
it: CallerArgumentExpressionAttribute non avrà alcun effetto perché si applica a un membro usato in contesti che non consentono argomenti facoltativi
ja: CallerArgumentExpressionAttribute は、オプションの引数を許可していないコンテキストで使用されるメンバーに適用されるため、無効になります
pl: Zastosowanie atrybutu CallerArgumentExpressionAttribute nie odniesie żadnego skutku, ponieważ dotyczy on składowej, która jest używana w kontekstach niezezwalających na argumenty opcjonalne
pt_br: O CallerArgumentExpressionAttribute não tem efeito porque ele se aplica a um membro que é usado em contextos que não aceitam argumentos opcionais
ru: Применение класса CallerArgumentExpressionAttribute не подействует, поскольку он применяется к элементу, которые использован в контекстах, где не разрешены необязательные аргументы.
zh_hans: CallerArgumentExpressionAttribute 将不起任何作用，因为它适用于不允许可选参数的上下文中使用的成员
zh_hant: CallerArgumentExpressionAttribute 將沒有效果，因為它所套用到的成員是用在不允許選擇性引數的內容

# WRN_CallerFilePathPreferredOverCallerArgumentExpression
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerFilePathAttribute.
cs: CallerFilePathAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho CallerFilePathAttribute.
fr: CallerArgumentExpressionAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerFilePathAttribute.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerFilePathAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、CallerFilePathAttribute によってオーバーライドされるため無効となります。
pl: Atrybut CallerArgumentExpressionAttribute zastosowany do parametru „{0}” nie będzie działać. Jest on zastępowany przez atrybut CallerFilePathAttribute.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá nenhum efeito. Ele é substituído pelo CallerFilePathAttribute.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" ни к чему не приведет. Он переопределяется классом CallerFilePathAttribute.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用。它由 CallerFilePathAttribute 替代。
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，CallerFilePathAttribute 會覆寫它。

# WRN_CallerFilePathPreferredOverCallerArgumentExpression_Title
source: The CallerArgumentExpressionAttribute will have no effect; it is overridden by the CallerFilePathAttribute
cs: CallerArgumentExpressionAttribute nebude mít žádný efekt. Přepisuje ho CallerFilePathAttribute.
fr: CallerArgumentExpressionAttribute n'aura pas d'effet ; il est remplacé par CallerFilePathAttribute
it: CallerArgumentExpressionAttribute non avrà alcun effetto. CallerFilePathAttribute ne eseguirà l'override
ja: CallerArgumentExpressionAttribute は、、CallerFilePathAttribute によってオーバーライドされるため無効となります
pl: Zastosowanie elementu CallerMemberNameAttribute nie odniesie żadnego skutku; zostanie on przesłonięty przez element CallerFilePathAttribute
pt_br: O CallerArgumentExpressionAttribute não terá nenhum efeito; ele é substituído pelo CallerFilePathAttribute
ru: Класс CallerArgumentExpressionAttribute не подействует. Он переопределяется классом CallerFilePathAttribute.
zh_hans: CallerArgumentExpressionAttribute 将不起任何作用；它由 CallerFilePathAttribute 替代
zh_hant: CallerArgumentExpressionAttribute 將沒有效果; CallerFilePathAttribute 會覆寫它

# WRN_CallerLineNumberPreferredOverCallerArgumentExpression
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerLineNumberAttribute.
cs: Atribut CallerArgumentExpressionAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho atribut CallerLineNumberAttribute.
fr: CallerArgumentExpressionAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerLineNumberAttribute.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、CallerLineNumberAttribute によってオーバーライドされるため無効となります。
pl: Zastosowany atrybut CallerArgumentExpressionAttribute do parametru „{0}” nie odniesie żadnego skutku. Jest on zastępowany przez atrybut CallerLineNumberAttribute.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá nenhum efeito. Ele é substituído pelo CallerLineNumberAttribute.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, он переопределен классом CallerLineNumberAttribute.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用。它由 CallerLineNumberAttribute 替代。
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，CallerLineNumberAttribute 會覆寫它。

# WRN_CallerLineNumberPreferredOverCallerArgumentExpression_Title
source: The CallerArgumentExpressionAttribute will have no effect; it is overridden by the CallerLineNumberAttribute
cs: Atribut CallerArgumentExpressionAttribute nebude mít žádný účinek. Přepisuje ho atribut CallerLineNumberAttribute.
fr: CallerArgumentExpressionAttribute n'aura pas d'effet ; il est remplacé par CallerLineNumberAttribute
it: CallerArgumentExpressionAttribute non avrà alcun effetto. CallerLineNumberAttribute ne eseguirà l'override
ja: CallerArgumentExpressionAttribute は、、CallerLineNumberAttribute によってオーバーライドされるため無効となります
pl: Atrybut CallerMemberNameAttribute nie odniesie żadnego skutku; zostanie on zastąpiony przez atrybut CallerLineNumberAttribute
pt_br: O CallerArgumentExpressionAttribute não terá nenhum efeito; ele é substituído pelo CallerLineNumberAttribute
ru: Класс CallerArgumentExpressionAttribute не подействует, он переопределен классом CallerLineNumberAttribute.
zh_hans: CallerArgumentExpressionAttribute 将不起任何作用；它由 CallerLineNumberAttribute 替代
zh_hant: CallerArgumentExpressionAttribute 將沒有效果; CallerLineNumberAttribute 會覆寫它

# WRN_CallerMemberNamePreferredOverCallerArgumentExpression
source: The CallerArgumentExpressionAttribute applied to parameter '{0}' will have no effect. It is overridden by the CallerMemberNameAttribute.
cs: Atribut CallerArgumentExpressionAttribute použitý u parametru {0} nebude mít žádný účinek. Přepíše ho atribut CallerMemberNameAttribute.
fr: CallerArgumentExpressionAttribute, qui est appliqué au paramètre '{0}', n'aura aucun effet. Il est remplacé par CallerMemberNameAttribute.
it: CallerArgumentExpressionAttribute applicato al parametro '{0}' non avrà alcun effetto. CallerMemberNameAttribute ne eseguirà l'override.
ja: パラメーター '{0}' に適用された CallerArgumentExpressionAttribute は、CallerMemberNameAttribute によってオーバーライドされるため無効となります。
pl: Zastosowany atrybut CallerArgumentExpressionAttribute do parametru "{0}" nie odniesie żadnego skutku. Jest on zastępowany przez atrybut CallerMemberNameAttribute.
pt_br: O CallerArgumentExpressionAttribute aplicado ao parâmetro '{0}' não terá nenhum efeito. Ele é substituído pelo CallerMemberNameAttribute.
ru: Применение класса CallerArgumentExpressionAttribute к параметру "{0}" не подействует, он будет переопределен классом CallerMemberNameAttribute.
zh_hans: 应用于参数“{0}”的 CallerArgumentExpressionAttribute 将不起任何作用。它由 CallerMemberNameAttribute 替代。
zh_hant: 套用到參數 '{0}' 的 CallerArgumentExpressionAttribute 將沒有效果，CallerMemberNameAttribute 會覆寫它。

# WRN_CallerMemberNamePreferredOverCallerArgumentExpression_Title
source: The CallerArgumentExpressionAttribute will have no effect; it is overridden by the CallerMemberNameAttribute
cs: Agument CallerArgumentExpressionAttribute nebude mít žádný účinek. Přepisuje ho atribut CallerMemberNameAttribute.
fr: CallerArgumentExpressionAttribute n'aura pas d'effet ; il est remplacé par CallerMemberNameAttribute
it: CallerArgumentExpressionAttribute non avrà alcun effetto. CallerMemberNameAttribute ne eseguirà l'override
ja: CallerArgumentExpressionAttribute は効果がなく、CallerMemberNameAttribute によってオーバーライドされます
pl: Atrybut CallerMemberNameAttribute nie odniesie żadnego skutku; ponieważ jest on zastąpiony przez atrybut CallerFilePathAttribute
pt_br: O CallerArgumentExpressionAttribute não terá nenhum efeito; ele é substituído pelo CallerMemberNameAttribute
ru: Класс CallerArgumentExpressionAttribute не подействует, он переопределен классом CallerMemberNameAttribute
zh_hans: CallerArgumentExpressionAttribute 将不起任何作用；它由 CallerMemberNameAttribute 替代
zh_hant: CallerArgumentExpressionAttribute 將沒有效果; CallerMemberNameAttribute 會覆寫它

# WRN_CapturedPrimaryConstructorParameterInFieldInitializer
source: Parameter '{0}' is captured into the state of the enclosing type and its value is also used to initialize a field, property, or event.
fr: Le paramètre '{0}' est capturé dans l'état du type englobant et sa valeur est également utilisée pour initialiser un champ, une propriété ou un événement.
it: Il parametro '{0}' viene acquisito nello stato del tipo di inclusione e il relativo valore viene utilizzato anche per inizializzare un campo, una proprietà o un evento.
ja: パラメーター '{0}' は外側の型の状態にキャプチャされ、その値はフィールド、プロパティ、またはイベントの初期化にも使用されます。
pl: Parametr „{0}” jest przechwytywany w stanie otaczającego typu, a jego wartość jest również używana do inicjowania pola, właściwości lub zdarzenia.
pt_br: O '{0}' é capturado no estado do tipo delimitador e seu valor também é usado para inicializar um campo, propriedade ou evento.
ru: Параметр ' {0} ' фиксируется в состоянии объемлющего типа, и его значение также используется для инициализации поля, свойства или события.
zh_hans: 参数“{0}”被捕获到封闭类型的状态，其值也用于初始化字段、属性或事件。
zh_hant: 參數 '{0}' 會擷取為封閉類型的狀態，其值也可用來初始化欄位、屬性或事件。

# WRN_CapturedPrimaryConstructorParameterInFieldInitializer_Title
source: Parameter is captured into the state of the enclosing type and its value is also used to initialize a field, property, or event.
fr: Le paramètre est capturé dans l'état du type englobant et sa valeur est également utilisée pour initialiser un champ, une propriété ou un événement.
it: Il parametro viene acquisito nello stato del tipo di inclusione e il relativo valore viene utilizzato anche per inizializzare un campo, una proprietà o un evento.
ja: パラメーターは外側の型の状態にキャプチャされ、その値はフィールド、プロパティ、またはイベントの初期化にも使用されます。
pl: Parametr jest przechwytywany w stanie otaczającego typu, a jego wartość jest również używana do inicjowania pola, właściwości lub zdarzenia.
pt_br: O parâmetro é capturado no estado do tipo delimitador e seu valor também é usado para inicializar um campo, propriedade ou evento.
ru: Параметр фиксируется в состоянии объемлющего типа, и его значение также используется для инициализации поля, свойства или события.
zh_hans: 参数被捕获到封闭类型的状态，其值也用于初始化字段、属性或事件。
zh_hant: 參數會擷取為封閉類型的狀態，其值也可用來初始化欄位、屬性或事件。

# WRN_CapturedPrimaryConstructorParameterPassedToBase
source: Parameter '{0}' is captured into the state of the enclosing type and its value is also passed to the base constructor. The value might be captured by the base class as well.
cs: Parametr {0} se zachytil do stavu nadřazeného typu a jeho hodnota se také předala základnímu konstruktoru. Hodnotu může zachytit i základní třída.
fr: Paramètre '{0}' est capturé dans l’état du type englobant et sa valeur est également passée au constructeur de base. La valeur peut également être capturée par la classe de base.
it: Il parametro '{0}' viene catturato nello stato del tipo di inclusione e il relativo valore viene passato anche al costruttore di base. Il valore potrebbe essere catturato anche dalla classe di base.
ja: パラメーター '{0}' は外側の型の状態にキャプチャされ、その値も基底コンストラクターに渡されます。この値は、基底クラスでもキャプチャされる可能性があります。
pl: Parametr '{0}' jest przechwytywane do stanu otaczającego typu, a jego wartość jest również przekazywana do konstruktora podstawowego. Wartość może zostać również przechwycona przez klasę bazową.
pt_br: O parâmetro "{0}" é capturado no estado do tipo delimitador e seu valor também é passado para o construtor base. O valor também pode ser capturado pela classe base.
ru: Параметр "{0}" записан в состоянии включающего типа, а его значение также передается базовому конструктору. Значение также может быть записано базовым классом.
zh_hans: 参数“{0}”捕获到封闭类型状态，其值也传递给基构造函数。该值也可能由基类捕获。
zh_hant: 參數 '{0}' 會擷取至包含類型的狀態，且其值也會傳遞給基礎建構函式。值也可能由基礎類別擷取。

# WRN_CapturedPrimaryConstructorParameterPassedToBase_Title
source: Parameter is captured into the state of the enclosing type and its value is also passed to the base constructor. The value might be captured by the base class as well.
cs: Parametr se zachytil do stavu nadřazeného typu a jeho hodnota se také předala základnímu konstruktoru. Hodnotu může zachytit i základní třída.
fr: Un paramètre est capturé dans l’état du type englobant et sa valeur est également passée au constructeur de base. La valeur peut également être capturée par la classe de base.
it: Il parametro viene catturato nello stato del tipo di inclusione e il relativo valore viene passato anche al costruttore di base. Il valore potrebbe essere catturato anche dalla classe di base.
ja: パラメーターは外側の型の状態にキャプチャされ、その値も基底コンストラクターに渡されます。この値は、基底クラスでもキャプチャされる可能性があります。
pl: Parametr zostaje przechwycony do stanu otaczającego typu, a jego wartość jest również przekazywana do konstruktora podstawowego. Wartość może być również przechwycona przez klasę bazową.
pt_br: O parâmetro é capturado no estado do tipo delimitador e seu valor também é passado para o construtor base. O valor também pode ser capturado pela classe base.
ru: Параметр записан в состоянии включающего типа, а его значение также передается базовому конструктору. Значение также может быть записано базовым классом.
zh_hans: 参数捕获到封闭类型状态，其值也传递给基构造函数。该值也可能由基类捕获。
zh_hant: 參數會擷取至包含類型的狀態，且其值也會傳遞給基礎建構函式。值也可能由基礎類別擷取。

# WRN_CollectionExpressionRefStructMayAllocate
source: Collection expression of type '{0}' may incur unexpected heap allocations. Consider explicitly creating an array, then converting to '{0}' to make the allocation explicit.
fr: L’expression de collection de type « {0} » peut entraîner des allocations de segment de mémoire inattendues. Envisagez de créer explicitement un tableau, puis convertissez-le en « {0} » pour rendre l’allocation explicite.
it: L'espressione di raccolta di tipo '{0}' può comportare allocazioni di heap impreviste. Provare a creare in modo esplicito una matrice, quindi a convertirla in '{0}' per rendere esplicita l'allocazione.
ja: '{0}' 型のコレクション式では、予期しないヒープ割り当てが発生する可能性があります。配列を明示的に作成してから、'{0}' に変換して割り当てを明示的にすることを検討してください。
pl: Wyrażenie kolekcji typu „{0}” może spowodować nieoczekiwane alokacje sterty. Rozważ jawne utworzenie tablicy, a następnie przekonwertowanie na „{0}”, aby jawnie utworzyć alokację.
pt_br: A expressão de coleção do tipo '{0}' pode incorrer em alocações inesperadas de heap. Considere a possibilidade de criar explicitamente uma matriz e, em seguida, converter para '{0}' para tornar a alocação explícita.
ru: Выражение коллекции типа "{0}" может привести к непредвиденным выделениям кучи. Рассмотрите возможность явного создания массива, а затем преобразования в "{0}", чтобы сделать выделение явным.
zh_hans: 类型为“{0}”的集合表达式可能会产生意外的堆分配。请考虑显式创建数组，然后转换为“{0}”以显式分配。
zh_hant: 類型 '{0}' 的集合運算式可能會產生未預期的堆積配置。請考慮明確地建立陣列，然後轉換為 '{0}' 以使配置明確化。

# WRN_CollectionExpressionRefStructMayAllocate_Title
source: Collection expression may incur unexpected heap allocations. Consider explicitly creating an array, then converting to the final type to make the allocation explicit.
fr: L’expression de collection peut entraîner des allocations de segment de mémoire inattendues. Envisagez de créer explicitement un tableau, puis convertissez-le en type final pour rendre l’allocation explicite.
it: L'espressione di raccolta può comportare allocazioni di heap impreviste. Provare a creare in modo esplicito una matrice, quindi a convertirla nel tipo finale per rendere esplicita l'allocazione.
ja: コレクション式で予期しないヒープ割り当てが発生する可能性があります。配列を明示的に作成してから、最後の型に変換して割り当てを明示的にすることを検討してください。
pl: Wyrażenie kolekcji może spowodować nieoczekiwane alokacje sterty. Rozważ jawne utworzenie tablicy, a następnie przekonwertowanie na typ końcowy, aby jawnie utworzyć alokację.
pt_br: A expressão Collection pode incorrer em alocações inesperadas de heap. Considere a possibilidade de criar explicitamente uma matriz e, em seguida, converter para o tipo final para tornar a alocação explícita.
ru: Выражение коллекции может привести к непредвиденным выделениям кучи. Рассмотрите возможность явного создания массива, а затем преобразования в конечный тип, чтобы сделать выделение явным.
zh_hans: 集合表达式可能会产生意外的堆分配。请考虑显式创建数组，然后转换为最终类型以显式分配。
zh_hant: 集合運算式可能會產生未預期的堆積配置。請考慮明確地建立陣列，然後轉換為最後類型以使配置明確化。
