Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_TopLevelNullabilityMismatchInParameterTypeOnOverride_Title
source: Nullability of type of parameter doesn't match overridden member (possibly because of nullability attributes).
cs: Možnost použití hodnoty null u typu parametru neodpovídá přepsanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité de type du paramètre ne correspond pas au membre substitué (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null del tipo del parametro non corrisponde al membro di cui è stato eseguito l'override, probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーターの型の NULL 値の許容が、オーバーライドされたメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typu parametru nie jest zgodne z przesłoniętą składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade do tipo de parâmetro não corresponde ao membro substituído (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для типа параметра не соответствует переопределенному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数类型的为 Null 性与重写成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型是否可為 NULL 的情況，與覆寫的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnExplicitImplementation
source: Nullability of reference types in return type doesn't match implemented member '{0}' (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá implementovanému členu {0} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté '{0}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato '{0}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型における参照型の NULL 値の許容が、実装されるメンバー '{0}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie zwracanym nie jest zgodne z zaimplementowaną składową „{0}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno não corresponde ao membro implementado '{0}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения не соответствует реализованному элементу "{0}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型中引用类型的为 Null 性与实现的成员“{0}”不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別中參考型別是否可為 NULL 的情況，與實作的成員 '{0}' 不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnExplicitImplementation_Title
source: Nullability of reference types in return type doesn't match implemented member (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v návratovém typu neodpovídá implementovanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato, probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型における参照型の NULL 値の許容が、実装されるメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie zwracanym nie jest zgodne z zaimplementowaną składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno não corresponde ao membro implementado (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения не соответствует реализованному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型中引用类型的为 Null 性与实现的成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別中參考型別是否可為 NULL 的情況，與實作的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnImplicitImplementation
source: Nullability of reference types in return type of '{0}' doesn't match implicitly implemented member '{1}' (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v návratovém typu {0} neodpovídá implicitně implementovanému členu {1} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type de retour de '{0}' ne correspond pas au membre implémenté implicitement '{1}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito di '{0}' non corrisponde al membro implementato in modo implicito '{1}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: '{0}' の戻り値の型における参照型の NULL 値の許容が、暗黙的に実装されるメンバー '{1}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie zwracanym „{0}” nie jest zgodne z niejawnie zaimplementowaną składową „{1}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno '{0}' não corresponde ao membro implementado implicitamente '{1}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения "{0}" не соответствует неявно реализованному элементу "{1}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: “{0}”的返回类型中引用类型的为 Null 性与隐式实现的成员“{1}”不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別 '{0}' 中參考型別是否可為 NULL 的情況，與隱含實作的成員 '{1}' 不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnImplicitImplementation_Title
source: Nullability of reference types in return type doesn't match implicitly implemented member (possibly because of nullability attributes).
cs: Typ odkazu s možnou hodnotou null v návratovém typu neodpovídá implicitně implementovanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté implicitement (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato in modo implicito, probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型における参照型の NULL 値の許容が、暗黙的に実装されるメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie zwracanym nie jest zgodne z niejawnie zaimplementowaną składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno não corresponde ao membro implementado implicitamente (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения не соответствует неявно реализованному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型中引用类型的为 Null 性与隐式实现的成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別中參考型別是否可為 NULL 的情況，與隱含實作的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnOverride
source: Nullability of return type doesn't match overridden member (possibly because of nullability attributes).
cs: Možnost použití hodnoty null u návratového typu neodpovídá přepsanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité du type de retour ne correspond pas au membre substitué (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null del tipo restituito non corrisponde al membro di cui è stato eseguito l'override, probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型の NULL 値の許容が、オーバーライドされたメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typu zwracanego nie jest zgodne z przesłoniętą składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade do tipo de retorno não corresponde ao membro substituído (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для типа возвращаемого значения не соответствует переопределенному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型的为 Null 性与重写成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別是否可為 NULL 的情況，與覆寫的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TopLevelNullabilityMismatchInReturnTypeOnOverride_Title
source: Nullability of return type doesn't match overridden member (possibly because of nullability attributes).
cs: Možnost použití hodnoty null u návratového typu neodpovídá přepsanému členu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité du type de retour ne correspond pas au membre substitué (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null del tipo restituito non corrisponde al membro di cui è stato eseguito l'override, probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型の NULL 値の許容が、オーバーライドされたメンバーと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typu zwracanego nie jest zgodne z przesłoniętą składową (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade do tipo de retorno não corresponde ao membro substituído (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для типа возвращаемого значения не соответствует переопределенному элементу (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型的为 Null 性与重写成员不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別是否可為 NULL 的情況，與覆寫的成員不相符 (可能的原因是屬性可為 NULL )。

# WRN_TupleBinopLiteralNameMismatch
source: The tuple element name '{0}' is ignored because a different name or no name is specified on the other side of the tuple == or != operator.
cs: Název elementu řazené kolekce členů {0} se ignoruje, protože na druhé straně operátoru == nebo != řazené kolekce členů je určený jiný nebo žádný název.
de: Der Tupelelementname "{0}" wird ignoriert, weil ein anderer oder gar kein Name auf der anderen Seite des ==- oder !=-Tupeloperators angegeben wurde.
es: No se tiene en cuenta el nombre de elemento de tupla "{0}" porque no se ha especificado ningún nombre, o se ha especificado uno diferente, en el otro lado del operador == o != de la tupla.
fr: Le nom d'élément de tuple '{0}' est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié de l'autre côté de l'opérateur de tuple == ou !=.
it: Il nome dell'elemento di tupla '{0}' viene ignorato perché nell'altra parte dell'operatore == o != di tupla è specificato un nome diverso o non è specificato alcun nome.
ja: タプル要素名 '{0}' は、タプルの == または != 演算子の反対側に異なる名前が指定されたか名前が指定されていないため、無視されます。
ko: 튜플 요소 이름 '{0}'은(는) 튜플 == 또는 != 연산자의 반대쪽에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki „{0}” została zignorowana, ponieważ po drugiej stronie operatora == lub != krotki określono inną nazwę lub nie określono żadnej nazwy.
pt_br: O nome do elemento da tupla '{0}' foi ignorado porque um nome diferente ou nenhum nome foi especificado no outro lado do operador == ou != de tupla.
ru: Имя элемента кортежа "{0}" игнорируется, так как на другой стороне оператора == или != кортежа имя имеет другое значение или отсутствует.
tr: Demetin == veya != işlecinin diğer tarafında farklı bir ad belirtildiğinden ya da bir ad belirtilmediğinden '{0}' demet öğesi adı yok sayıldı.
zh_hans: 由于元组 == 或 != 运算符的另一侧指定了其他名称或未指定名称，因此元组元素名称“{0}”被忽略。
zh_hant: 因為元組 == 或 != 運算子的另一端指定了不同的名稱或未指定名稱，所以會忽略元組元素名稱 '{0}'。

# WRN_TupleBinopLiteralNameMismatch_Title
source: The tuple element name is ignored because a different name or no name is specified on the other side of the tuple == or != operator.
cs: Název elementu řazené kolekce členů se ignoruje, protože na druhé straně operátoru == nebo != řazené kolekce členů je určený jiný nebo žádný název.
de: Der Tupelelementname wird ignoriert, weil ein anderer oder gar kein Name auf der anderen Seite des ==- oder !=-Tupeloperators angegeben wurde.
es: No se tiene en cuenta el nombre de elemento de tupla porque no se ha especificado ningún nombre, o se ha especificado uno diferente, en el otro lado del operador == o != de la tupla.
fr: Le nom d'élément de tuple est ignoré, car un autre nom est spécifié ou aucun nom n'est spécifié de l'autre côté de l'opérateur de tuple == ou !=.
it: Il nome dell'elemento di tupla viene ignorato perché nell'altra parte dell'operatore == o != di tupla è specificato un nome diverso o non è specificato alcun nome.
ja: タプル要素名は、タプルの == または != 演算子の反対側に異なる名前が指定されたか名前が指定されていないため、無視されます。
ko: 튜플 요소 이름은(는) 튜플 == 또는 != 연산자의 반대쪽에서 다른 이름이 지정되었거나 이름이 지정되지 않았기 때문에 무시됩니다.
pl: Nazwa elementu krotki została zignorowana, ponieważ po drugiej stronie operatora == lub != krotki określono inną nazwę lub nie określono żadnej nazwy.
pt_br: O nome do elemento da tupla foi ignorado porque um nome diferente ou nenhum nome foi especificado no outro lado do operador == ou != de tupla.
ru: Имя элемента кортежа игнорируется, так как на другой стороне оператора == или != кортежа имя имеет другое значение или отсутствует.
tr: Demetin == veya != işlecinin diğer tarafında farklı bir ad belirtildiğinden ya da bir ad belirtilmediğinden demet öğesi adı yok sayıldı.
zh_hans: 由于元组 == 或 != 运算符的另一侧指定了其他名称或未指定名称，因此元组元素名称被忽略。
zh_hant: 因為元組 == 或 != 運算子的另一端指定了不同的名稱或未指定名稱，所以會忽略元組元素名稱。

# WRN_TypeParameterSameAsOuterMethodTypeParameter
source: Type parameter '{0}' has the same name as the type parameter from outer method '{1}'
cs: Parametr typu {0} má stejný název jako parametr typu z vnější metody {1}.
de: Der Name des Typparameters "{0}" und der Name des Typparameters der äußeren Methode "{1}" sind identisch.
es: El parámetro de tipo "{0}" tiene el mismo nombre que el parámetro de tipo del método externo "{1}"
fr: Le paramètre de type '{0}' a le même nom que le paramètre de type de la méthode externe '{1}'
it: Il nome del parametro di tipo '{0}' è uguale a quello del parametro di tipo del metodo esterno '{1}'
ja: 型パラメーター '{0}' は、外のメソッドからの型パラメーター '{1}' と同じ名前です
ko: '{0}' 형식 매개 변수가 외부 메서드 '{1}'의 형식 매개 변수와 이름이 같습니다.
pl: Parametr typu „{0}” ma tę samą nazwę co parametr typu z metody zewnętrznej „{1}”
pt_br: O parâmetro de tipo ‘{0}’ tem o mesmo nome que o parâmetro de tipo do método externo '{1}'
ru: Параметр типа "{0}" имеет то же имя, что и параметр типа во внешнем методе "{1}"
tr: '{0}' tür parametresi, '{1}' dış metodundaki tür parametresi ile aynı ada sahip
zh_hans: 类型参数“{0}”与外部方法“{1}”中的类型参数同名
zh_hant: 類型參數 '{0}' 與外部方法 '{1}' 的類型參數，名稱相同

# WRN_TypeParameterSameAsOuterMethodTypeParameter_Title
source: Type parameter has the same type as the type parameter from outer method.
cs: Parametr typu má stejný typ jako parametr typu z vnější metody.
de: Der Typparameter und der Typparameter der äußeren Methode weisen denselben Typ auf.
es: El parámetro de tipo tiene el mismo tipo que el parámetro de tipo del método externo.
fr: Le paramètre de type a le même type que le paramètre de type de la méthode externe.
it: Il tipo del parametro di tipo è lo stesso del parametro di tipo del metodo esterno.
ja: 型パラメーターの型は、外のメソッドからの型パラメーターと同じ型です。
ko: 형식 매개 변수가 외부 메서드의 형식 매개 변수와 형식이 같습니다.
pl: Parametr typu ma ten sam typ co parametr typu z metody zewnętrznej.
pt_br: O parâmetro de tipo tem o mesmo tipo que o parâmetro de tipo do método externo.
ru: Параметр типа имеет то же имя, что и параметр типа во внешнем методе.
tr: Tür parametresi dış metottaki tür parametresi ile aynı türe sahip
zh_hans: 类型参数与外部方法中的类型参数有相同的类型。
zh_hant: 類型參數與外部方法的類型參數，類型相同。

# WRN_UnassignedInternalRefField
source: Field '{0}' is never ref-assigned to, and will always have its default value (null reference)
fr: Une référence n’est jamais affectée au champ « {0} » et aura toujours sa valeur par défaut (référence nulle)
it: Il campo '{0}' non è mai assegnato come riferimento e avrà sempre il valore predefinito (riferimento Null)
pt_br: O campo "{0}" nunca recebe uma atribuição com ref e sempre terá seu valor padrão (referência nula)
ru: Поле "{0}" никогда не имеет ссылки и всегда будет иметь значение по умолчанию (нулевая ссылка)
zh_hans: 字段“{0}”永远不会被 ref-assign，并且始终具有其默认值(null 引用)

# WRN_UnassignedInternalRefField_Title
source: Field is never ref-assigned to, and will always have its default value (null reference)
fr: Une référence n’est jamais affectée au champ et aura toujours sa valeur par défaut (référence nulle)
it: Il campo non è mai assegnato come riferimento e avrà sempre il valore predefinito (riferimento Null)
pt_br: O campo nunca recebe uma atribuição com ref e sempre terá seu valor padrão (referência nula)
ru: Поле не содержит ссылки и всегда будет иметь значение по умолчанию (нулевая ссылка)
zh_hans: 字段永远不会被 ref-assign，并将始终具有其默认值(null 引用)

# WRN_UnassignedThisAutoPropertySupportedVersion
source: Control is returned to caller before auto-implemented property '{0}' is explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Volajícímu se vrátí ovládací prvek před explicitním přiřazením automaticky implementované vlastnosti {0}, což způsobí předchozí implicitní přiřazení default.
fr: Le contrôle est retourné à l’appelant avant que la propriété implémentée automatiquement '{0}' soit explicitement affectée, ce qui provoque une attribution implicite précédente de 'default'.
it: Il controllo viene restituito al chiamante prima che la proprietà implementata automaticamente '{0}' sia assegnata in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: フィールド '{0}' が明示的に割り当てられる前に自動実装プロパティが呼び出し元に返され、先行する暗黙的な代入が 'default' になります。
pl: Kontrolka jest zwracana do obiektu wywołującego przed jawnym przypisaniem właściwości „{0}”, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O controle é devolvido ao chamador antes que a propriedade auto-implementada seja '{0}' explicitamente atribuída, causando uma atribuição implícita anterior de 'default'.
ru: Контроль возвращается вызывающему элементу до явного назначения автоматически реализуемого свойства "{0}", что приводит к предшествующему неявному назначению "default"
zh_hans: 在显式分配自动实现的属性'{0}'之前，将向调用方返回控件，从而导致前面隐式分配了“default”。
zh_hant: 在明確指派自動實作屬性 '{0}' 之前會先將控制項傳回呼叫者，導致先前隱含的指派為 'default'。

# WRN_UnassignedThisAutoPropertySupportedVersion_Title
source: Control is returned to caller before auto-implemented property is explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Volajícímu se vrátí ovládací prvek před explicitním přiřazením automaticky implementované vlastnosti, což způsobí předchozí implicitní přiřazení default.
fr: Le contrôle est retourné à l’appelant avant l’attribution explicite de la propriété implémentée automatiquement, ce qui entraîne une attribution implicite précédente de « default ».
it: Il controllo viene restituito al chiamante prima che la proprietà implementata automaticamente sia assegnata in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: フィールドが明示的に割り当てられる前に自動実装プロパティが呼び出し元に返され、先行する暗黙的な代入が 'default' になります。
pl: Kontrolka jest zwracana do obiektu wywołującego przed jawnym przypisaniem właściwości, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O controle é devolvido ao chamador antes que a propriedade auto-implementada seja explicitamente atribuída, causando uma atribuição implícita anterior de 'default'.
ru: Контроль возвращается вызывающему элементу до явного назначения автоматически реализуемого свойства, что приводит к предшествующему неявному назначению "default"
zh_hans: 在显式分配自动实现的属性之前，将向调用方返回控件，从而导致前面隐式分配了'default'。
zh_hant: 在明確指派自動實作屬性之前會先將控制項傳回呼叫者，導致先前隱含的指派為 'default'。

# WRN_UnassignedThisAutoPropertyUnsupportedVersion
source: Auto-implemented property '{0}' must be fully assigned before control is returned to the caller. Consider updating to language version '{1}' to auto-default the property.
cs: Před vrácením řízení volajícímu se musí plně přiřadit automaticky implementovaná vlastnost {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení vlastnosti.
fr: La propriété implémentée automatiquement '{0}' doit être entièrement affectée avant que le contrôle soit retourné à l’appelant. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement la propriété par défaut.
it: La proprietà implementata automaticamente '{0}' deve essere assegnata completamente prima che il controllo sia restituito al chiamante. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente la proprietà come predefinita.
ja: コントロールを呼び出し元に返す前に、自動実装プロパティ '{0}' を完全に割り当てる必要があります。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Automatycznie implementowana właściwość „{0}” musi być w pełni przypisana, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie do wersji językowej „{1}”, aby automatycznie ustawić domyślną właściwość.
pt_br: A propriedade auto-implementada '{0}' deve ser totalmente atribuída antes que o controle seja devolvido ao chamador. Considere atualizar para a versão de linguagem '{1}' para auto-padrão da propriedade.
ru: Автоматически реализуемое свойство "{0}" должно быть полностью назначено перед возвратом контроля вызывающему элементу. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значение по умолчанию к этому свойству.
zh_hans: 必须先完全分配自动实现的属性'{0}'，然后才能将控件返回到调用方。请考虑更新到语言版本'{1}'以自动默认属性。
zh_hant: 在控制項傳回呼叫者之前，必須先完全指派自動實作屬性 '{0}'。請考慮更新至語言版本 '{1}' 以自動預設屬性。

# WRN_UnassignedThisAutoPropertyUnsupportedVersion_Title
source: An auto-implemented property must be fully assigned before control is returned to the caller. Consider updating the language version to auto-default the property.
cs: Před vrácením řízení volajícímu se musí plně přiřadit automaticky implementovaná vlastnost. Zvažte aktualizaci jazykové verze na automatické výchozí nastavení vlastnosti.
fr: Une propriété implémentée automatiquement doit être entièrement affectée avant que le contrôle soit renvoyé à l’appelant. Envisagez de mettre à jour la version de langage pour utiliser la propriété par défaut automatique.
it: Una proprietà implementata automaticamente deve essere assegnata completamente prima che il controllo sia restituito al chiamante. Provare ad aggiornare la versione del linguaggio per impostare automaticamente la proprietà come predefinita.
ja: コントロールを呼び出し元に返す前に、自動実装プロパティを完全に割り当てる必要があります。プロパティを自動既定値にするため言語バージョンを更新することを検討してください。
pl: Automatycznie implementowana właściwość musi być w pełni przypisana, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie do wersji językowej, aby automatycznie ustawić domyślną właściwość.
pt_br: Uma propriedade auto-implementada deve ser totalmente atribuída antes que o controle seja devolvido ao chamador. Considere atualizar a versão de linguagem para auto-padrão da propriedade.
ru: Автоматически реализуемое свойство должно быть полностью назначено перед возвратом контроля вызывающему элементу. Попробуйте обновить языковую версию, чтобы автоматически применить значение по умолчанию к этому свойству.
zh_hans: 在将控件返回给调用方之前，必须完全分配自动实现的属性。请考虑更新语言版本以自动默认属性。
zh_hant: 在控制項傳回呼叫者之前，必須先完全指派自動實作屬性。請考慮更新至語言版本以自動預設屬性。
