Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DesignatorBeneathPatternCombinator
source: A variable may not be declared within a 'not' or 'or' pattern.
cs: Proměnná se nedá deklarovat ve vzoru not nebo or.
fr: Une variable ne peut pas être déclarée dans un modèle 'not' ou 'or'.
it: Non è possibile dichiarare una variabile all'interno di un criterio 'not' o 'or'.
ja: 'not' または 'or' パターンの中で変数を宣言することはできません。
pl: Nie można deklarować zmiennej we wzorcu „not” ani „or”.
pt_br: Uma variável não pode ser declarada em um padrão 'not' ou 'or'.
ru: Переменная не может быть объявлена в шаблоне "not" или "or".
zh_hans: 在“not”或“or”模式中不能声明变量。
zh_hant: 不得在 'not' 或 'or' 模式中宣告變數。

# ERR_DiscardPatternInSwitchStatement
source: The discard pattern is not permitted as a case label in a switch statement. Use 'case var _:' for a discard pattern, or 'case @_:' for a constant named '_'.
cs: Tento vzor discard není povolený jako návěstí příkazu case v příkazu switch. Použijte „case var _:“ pro vzor discard nebo „case @_:“ pro konstantu s názvem „_“.
de: Das discard-Muster ist als case-Bezeichnung in einer switch-Anweisung unzulässig. Verwenden Sie "case var _:" für ein discard-Muster oder "case @_:" für eine Konstante namens "_".
es: El patrón de descarte no se permite como etiqueta de caso en una instrucción switch. Use "case var _:" para un patrón de descarte o "case @_:" para una constante con el nombre '_'.
fr: Le modèle d'abandon n'est pas autorisé en tant qu'étiquette case dans une instruction switch. Utilisez 'case var _:' pour un modèle d'abandon, ou 'case @_:' pour une constante nommée '_'.
it: Il criterio di rimozione non è consentito come etichetta case in un'istruzione switch. Usare 'case var _:' per un criterio di rimozione oppure 'case @_:' per una costante denominata '_'.
ja: この破棄パターンは switch ステートメントの case ラベルとして許可されていません。破棄パターンに 'case var _:' を使用するか、'_' という定数に'case @_:' をご使用ください。
ko: 무시 패턴은 switch 문의 case 레이블로 사용할 수 없습니다. 무시 패턴에 대해 'case var _:'을 사용하거나 이름이 '_'인 상수에 대해 'case @_:'을 사용하세요.
pl: Wzorzec odrzucania nie jest dozwolony jako etykieta instrukcji case w instrukcji switch. Użyj instrukcji „case var _:” w przypadku wzorca odrzucania lub użyj instrukcji „case @_:” w przypadku stałej o nazwie „_”.
pt_br: O padrão de descarte não é permitido como um rótulo de caso em uma instrução switch. Use 'case var _:' para um padrão de descarte ou 'case @_:' para uma constante chamada '_'.
ru: Шаблон отмены запрещено использовать как метку case в операторе switch. Используйте "case var _:" в качестве шаблона отмены или "case @_:" в качестве константы "_".
tr: Bir switch deyiminde case etiketi olarak atma desenine izin verilmez. Atma deseni için 'case var _:' veya '_' adlı bir sabit için 'case @_:' seçeneğini kullanın.
zh_hans: 在 switch 语句中，不允许将放弃模式作为 case 标签。请使用“case var _:”以表示放弃模式、使用“case @_:”以定义名为“_”的变量。
zh_hant: 捨棄模式不可為 switch 陳述式中的 case 標籤。針對捨棄模式，請使用 'case var _:'，針對名為 '_' 的常數，則請使用 'case @_:'。

# ERR_DoesNotOverrideBaseEqualityContract
source: '{0}' does not override expected property from '{1}'.
cs: {0} nepřepisuje očekávanou vlastnost z {1}.
fr: '{0}' ne remplace pas la propriété attendue de '{1}' .
it: '{0}' non esegue l'override della proprietà prevista da '{1}'.
ja: '{0}' は、'{1}' からの想定されるプロパティをオーバーライドしていません。
pl: Element „{0}” nie przesłania oczekiwanej właściwości z elementu „{1}”.
pt_br: '{0}' não substitui a propriedade esperada de '{1}'.
ru: "{0}" не переопределяет ожидаемое свойство из "{1}".
zh_hans: “{0}”不替代“{1}”中的预期属性。
zh_hant: '{0}' 不會覆寫 '{1}' 的必要屬性。

# ERR_DoesNotOverrideBaseMethod
source: '{0}' does not override expected method from '{1}'.
cs: {0} nepřepisuje očekávanou metodu z {1}.
fr: '{0}' ne remplace pas la méthode attendue de '{1}'.
it: '{0}' non esegue l'override del metodo previsto da '{1}'.
ja: '{0}' は、'{1}' からの想定されるメソッドをオーバーライドしていません。
pl: Element „{0}” nie przesłania oczekiwanej metody z elementu „{1}”
pt_br: '{0}' não substitui o método esperado de '{1}'.
ru: "{0}" не переопределяет ожидаемый метод из "{1}".
zh_hans: “{0}”不替代“{1}”中的预期方法。
zh_hant: '{0}' 不會覆寫 '{1}' 的必要方法。

# ERR_DoesNotOverrideMethodFromObject
source: '{0}' does not override expected method from 'object'.
cs: {0} nepřepisuje očekávanou metodu z object.
fr: '{0}' ne remplace pas la méthode attendue de 'object'.
it: '{0}' non esegue l'override del metodo previsto da 'object'.
ja: '{0}' は、'object' からの想定されるメソッドをオーバーライドしていません。
pl: Element „{0}” nie przesłania oczekiwanej metody z elementu „object”.
pt_br: '{0}' não substitui o método esperado de 'object'.
ru: "{0}" не переопределяет ожидаемый метод из "object".
zh_hans: “{0}”不替代 "object" 中的预期方法。
zh_hant: '{0}' 不會覆寫 'object' 的必要方法。

# ERR_DupReturnTypeMod
source: A return type can only have one '{0}' modifier.
cs: Návratový typ může mít jen jeden modifikátor {0}.
fr: Un type de retour ne peut avoir qu'un seul modificateur '{0}'.
it: Un tipo restituito può avere un solo modificatore '{0}'.
ja: 戻り値の型には '{0}' 修飾子を 1 つだけ指定できます。
pl: Typ zwracany może mieć tylko jeden modyfikator „{0}”.
pt_br: Um tipo de retorno só pode ter um modificador '{0}'.
ru: Тип возвращаемого значения может иметь только один модификатор "{0}".
zh_hans: 返回类型只能有一个“{0}”修饰符。
zh_hant: 傳回型別只能有一個 '{0}' 修飾元。

# ERR_DuplicateExplicitImpl
source: '{0}' is explicitly implemented more than once.
cs: Položka {0} je explicitně implementována více než jednou.
de: "{0}" ist mehrfach explizit implementiert.
es: "{0}" está implementado de forma explícita más de una vez.
fr: '{0}' est implémenté explicitement plusieurs fois.
it: '{0}' è implementato più di una volta in modo esplicito.
ja: '{0}' が複数回、明示的に実装されています。
ko: '{0}'은(는) 두 번 이상 명시적으로 구현됩니다.
pl: Element „{0}” jest jawnie zaimplementowany więcej niż raz.
pt_br: '{0}' é implementado explicitamente mais de uma vez.
ru: "{0}" явно реализуется больше одного раза.
tr: '{0}' bir defadan fazla açıkça uygulanmış.
zh_hans: 多次显式实现“{0}”。
zh_hant: '{0}' 已明確實作多次。

# ERR_DuplicateInterceptor
source: The indicated call is intercepted multiple times.
fr: L'appel indiqué est intercepté plusieurs fois.
it: La chiamata indicata viene intercettata più volte.
ja: 指定された呼び出しは複数回インターセプトされています。
pl: Wskazane wywołanie jest przechwytywane wiele razy.
pt_br: A chamada indicada foi interceptada várias vezes.
ru: Указанный вызов перехватывается несколько раз.
zh_hans: 指示的调用被截获多次。
zh_hant: 對指定的呼叫進行多次攔截。

# ERR_DuplicateInterfaceWithDifferencesInBaseList
source: '{0}' is already listed in the interface list on type '{2}' as '{1}'.
cs: {0} je již uvedeno v seznamu rozhraní u typu {2} jako {1}.
fr: '{0}' est déjà listé dans la liste d'interfaces du type '{2}' en tant que '{1}'.
it: '{0}' è già incluso nell'elenco di interfacce nel tipo '{2}' come '{1}'.
ja: '{0}' は、型 '{2}' のインターフェイス リストに '{1}' として既に指定されています。
pl: Element „{0}” znajduje się już na liście interfejsów typu „{2}” jako „{1}”.
pt_br: '{0}' já está listado na lista de interfaces no tipo '{2}' como '{1}'.
ru: "{0}" уже указан в списке интерфейсов в типе "{2}" в виде "{1}".
zh_hans: “{0}”已作为“{1}”列入类型“{2}”的接口列表中。
zh_hant: '{0}' 已列於類型 '{2}' 的介面清單中，名稱為 '{1}'。

# ERR_DuplicateNullSuppression
source: Duplicate null suppression operator ('!')
cs: Duplicitní operátor potlačení hodnoty null (!)
de: Operator zum Unterdrücken von doppelten NULL-Werten ("!")
es: Duplicar el operador de supresión de tipo null ("!")
fr: Opérateur de suppression de valeur null dupliqué ('!')
it: Operatore di eliminazione Null duplicato ('!')
ja: Null 抑制演算子 ('!') が重複しています
ko: 중복 null 비표시 오류(Suppression) 연산자('!')
pl: Zduplikowany operator pomijania wartości null („!”)
pt_br: Operador de supressão nulo duplicado ('!')
ru: Оператор подавления повторяющихся значений NULL ("!")
tr: Yinelenen null gizleme işleci ('!')
zh_hans: Null 抑制运算符("!")重复
zh_hant: 重複 Null 隱藏運算子 ('!')

# ERR_DuplicatePropertyReadOnlyMods
source: Cannot specify 'readonly' modifiers on both accessors of property or indexer '{0}'. Instead, put a 'readonly' modifier on the property itself.
cs: Pro přístupové objekty vlastnosti i indexeru {0} nelze zadat modifikátory readonly. Místo toho zadejte modifikátor readonly jenom pro vlastnost.
de: readonly-Modifizierer können nicht für beide Accessoren der Eigenschaft oder des Indexers "{0}" angegeben werden. Legen Sie stattdessen einen readonly-Modifizierer für die Eigenschaft selbst fest.
es: No se pueden especificar modificadores "readonly" en ambos descriptores de acceso de la propiedad o del indizador "{0}". En su lugar, coloque un modificador "readonly" en la propiedad.
fr: Impossible de spécifier des modificateurs 'readonly' sur les deux accesseurs de la propriété ou de l'indexeur '{0}'. À la place, mettez un modificateur 'readonly' sur la propriété elle-même.
it: Non è possibile specificare i modificatori 'readonly' in entrambe le funzioni di accesso della proprietà o dell'indicizzatore '{0}'. Inserire invece un modificatore 'readonly' nella proprietà stessa.
ja: プロパティまたはインデクサー '{0}' の両方のアクセサーで 'readonly' 修飾子を指定することはできません。代わりに、プロパティ自体に 'readonly' 修飾子を指定してください。
ko: '{0}' 속성 또는 인덱서의 두 접근자에 'readonly' 한정자를 지정할 수 없습니다. 대신 속성 자체에 'readonly' 한정자를 지정하세요.
pl: Nie można określić modyfikatorów „readonly” dla obu metod dostępu właściwości lub indeksatora „{0}”. Zamiast tego dodaj modyfikator „readonly” do samej właściwości.
pt_br: Não é possível especificar modificadores 'readonly' em ambos os acessadores de propriedade ou de indexador '{0}'. Nesse caso, coloque um modificador 'readonly' na própria propriedade.
ru: Запрещено указывать модификаторы readonly для обоих методов доступа свойства или индексатора "{0}". Вместо этого укажите модификатор readonly для самого свойства.
tr: 'readonly' değiştiricileri, '{0}' özelliğinin veya dizin oluşturucusunun her iki erişimcisinde de belirtilemez. Bunun yerine özelliğin kendisine bir 'readonly' değiştiricisi koyun.
zh_hans: 不能在属性或索引器 "{0}" 的两个访问器上指定 "readonly" 修饰符。而应在属性本身上指定 "readonly" 修饰符。
zh_hant: 在屬性和索引子 '{0}' 的存取子上均無法指定 'readonly' 修飾元。請改在屬性自身上放置 'readonly' 修飾元。

# ERR_DynamicDispatchToParamsCollection
source: '{0}' is applicable only with expanded form of non-array params collection which is not supported during dynamic dispatch.
fr: « {0} » s’applique uniquement avec une forme développée de collection de paramètres autre qu’un type tableau, ce qui n’est pas pris en charge lors d’un dispatch dynamique.
it: '{0}' è applicabile solo con la forma espansa della raccolta di parametri non di matrice che non è supportata durante l'invio dinamico.
pl: Element „{0}” ma zastosowanie tylko w przypadku rozszerzonej formy kolekcji parametrów niebędących tablicami, która nie jest obsługiwana podczas wysyłania dynamicznego.
pt_br: "{0}" é aplicável somente com a forma expandida de coleção de parâmetros não de matriz, que não tem suporte durante a expedição dinâmica.
ru: "{0}" применимо только с расширенной формой коллекции параметров, не являющейся массивом, которая не поддерживается во время динамической отправки.
zh_hans: "{0}" 仅适用于在动态调度期间不受支持的非数组参数集合的扩展形式。
zh_hant: '{0}' 只適用於展開格式的非陣列參數集合，但其在動態分派期間無法使用。

# ERR_ElseCannotStartStatement
source: 'else' cannot start a statement.
cs: Příkaz nemůže začínat na else.
de: Eine Anweisung kann nicht mit "else" beginnen.
es: “else” no puede iniciar una instrucción.
fr: 'else' ne peut pas démarrer d'instruction.
it: Un'istruzione non può iniziare con 'else'.
ja: 'else' でステートメントを開始することはできません。
ko: 'else'로 문을 시작할 수 없습니다.
pl: Instrukcja nie może rozpoczynać się od elementu „else”.
pt_br: 'else' não pode iniciar uma instrução.
ru: "else" не может запускать оператор.
tr: 'else' bir deyim başlatamaz.
zh_hans: "else" 不能用在语句的开头。
zh_hant: 'else' 無法開始陳述式。

# ERR_EncUpdateFailedMissingSymbol
source: Cannot emit update; {0} '{1}' is missing.
fr: Impossible d’émettre la mise à jour ; {0} '{1}' est manquant.
it: Non è possibile creare l'aggiornamento. {0} '{1}' mancante.
pt_br: Não é possível emitir a atualização; {0} '{1}' está ausente.
ru: Не удается создать обновление; {0} '{1}' отсутствует.
zh_hans: 无法发出更新;缺少 {0} '{1}' 。

source: Update requires emitting explicit interface implementation, which is not supported by the runtime without restarting the application.
pt_br: A atualização requer a emissão de implementação explícita de interface, que não tem suporte no runtime sem reiniciar o aplicativo.

# ERR_EntryPointCannotBeUnmanagedCallersOnly
source: Application entry points cannot be attributed with 'UnmanagedCallersOnly'.
cs: Vstupní body aplikací nemůžou mít atribut UnmanagedCallersOnly.
fr: Les points d'entrée d'application ne peuvent pas être attribués avec 'UnmanagedCallersOnly'.
it: Non è possibile aggiungere ai punti di ingresso dell'applicazione l'attributo 'UnmanagedCallersOnly'.
ja: アプリケーションのエントリ ポイントに 'UnmanagedCallersOnly' 属性を設定することはできません。
pl: Punkty wejścia aplikacji nie mogą mieć atrybutu „UnmanagedCallersOnly”.
pt_br: Os pontos de entrada do aplicativo não podem ser atribuídos com 'UnmanagedCallersOnly'.
ru: Точки входа приложения не могут иметь атрибут "UnmanagedCallersOnly".
zh_hans: 无法使用 "UnmanagedCallersOnly" 对应用程序入口点进行特性化。
zh_hant: 無法使用 'UnmanagedCallersOnly' 將應用程式進入點屬性化。

# ERR_EqualityContractRequiresGetter
source: Record equality contract property '{0}' must have a get accessor.
cs: Vlastnost kontraktu rovnosti záznamu {0} musí mít přístupový objekt get.
fr: La propriété de contrat d'égalité d'enregistrement '{0}' doit avoir un accesseur get.
it: La proprietà '{0}' del contratto di uguaglianza record deve contenere una funzione di accesso get.
ja: レコードの等値コントラクト プロパティ '{0}' には get アクセサーが必要です。
pl: Właściwość kontraktu równości rekordu „{0}” musi mieć metodę dostępu get.
pt_br: A propriedade de contrato de igualdade do registro '{0}' precisa ter um acessador get.
ru: Свойство контракта на равенство записей "{0}" должно иметь метод доступа get.
zh_hans: 记录等同性合同属性“{0}”必须具有 get 访问器。
zh_hant: 記錄相等 contract 屬性 '{0}' 必須要有 get 存取子。

# ERR_EqualityOperatorInPatternNotSupported
source: The '==' operator is not supported in a pattern.
pt_br: Não há suporte para o operador "==" em um padrão.

# ERR_EscapeVariable
source: Cannot use variable '{0}' in this context because it may expose referenced variables outside of their declaration scope
cs: V tomto kontextu nejde použít proměnnou {0}, protože může vystavit odkazované proměnné mimo jejich rozsah deklarace.
fr: Impossible d’utiliser la variable '{0}' dans ce contexte, car elle peut exposer des variables référencées en dehors de leur étendue de déclaration
it: Non è possibile usare la variabile '{0}' in questo contesto perché potrebbe esporre variabili di riferimento all'esterno del relativo ambito di dichiarazione
ja: 参照される変数が宣言のスコープ外に公開される可能性があるため、このコンテキストで変数 '{0}' を使用することはできません
pl: Nie można używać zmiennej „{0}” w tym kontekście, ponieważ może uwidaczniać odwoływane zmienne poza ich zakresem deklaracji
pt_br: Não é possível usar a variável '{0}' neste contexto porque ela pode expor variáveis referenciadas fora de seu escopo de declaração
ru: Невозможно использовать переменную "{0}" в этом контексте, поскольку при этом могут быть раскрыты доступные по ссылке переменные вне их области объявления.
zh_hans: 不能在此上下文中使用变量 "{0}"，因为它可能会在其声明范围以外公开所引用的变量
zh_hant: 無法在此內容中使用變數 '{0}'，因為它會將參考的變數公開在其宣告範圍外

# ERR_ExpectedInterpolatedString
source: Expected interpolated string
fr: Chaîne interpolée attendue
it: Prevista stringa interpolata
ja: 補間された文字列 (期待値)
pl: Oczekiwany ciąg interpolowany
pt_br: Cadeia de caracteres interpolada esperada
ru: Ожидается интерполированная строка
zh_hans: 预期内插字符串
zh_hant: 預期為差補字串

# ERR_ExplicitImplementationOfOperatorsMustBeStatic
source: Explicit implementation of a user-defined operator '{0}' must be declared static
cs: Explicitní implementace uživatelem definovaného operátoru {0} musí být deklarovaná jako statická.
fr: L’implémentation explicite d’un opérateur « {0} » défini par l’utilisateur doit être déclarée comme static
it: L'implementazione esplicita di un operatore definito dall'utente '{0}' deve essere dichiarata come statica
ja: ユーザー定義演算子 '{0}' の明示的な実装は静的として宣言する必要があります
pl: Jawna implementacja operatora zdefiniowanego przez użytkownika „{0}” musi być zadeklarowana jako statyczna
pt_br: A implementação explícita de um operador definido pelo usuário '{0}' deve ser declarada estática
ru: Явная реализация определяемого пользователем оператора "{0}" должна быть объявлена статической
zh_hans: 用户定义的运算符“{0}”的显式实现必须声明为静态
zh_hant: 使用者定義的運算子 '{0}' 的明確實作必須宣告為靜態

# ERR_ExplicitInterfaceMemberReturnTypeMismatch
source: '{0}': return type must be '{1}' to match implemented member '{2}'
pt_br: "{0}": o tipo de retorno deve ser "{1}" para corresponder ao membro implementado "{2}"

# ERR_ExplicitInterfaceMemberTypeMismatch
source: '{0}': type must be '{1}' to match implemented member '{2}'
pt_br: "{0}": o tipo deve ser "{1}" para corresponder ao membro implementado "{2}"

# ERR_ExplicitNullableAttribute
source: Explicit application of 'System.Runtime.CompilerServices.NullableAttribute' is not allowed.
cs: Explicitní použití System.Runtime.CompilerServices.NullableAttribute není povolené.
de: Die explizite Anwendung von "System.Runtime.CompilerServices.NullableAttribute" ist unzulässig.
es: No se permite la aplicación explícita de "System.Runtime.CompilerServices.NullableAttribute".
fr: L'application explicite de 'System.Runtime.CompilerServices.NullableAttribute' n'est pas autorisée.
it: L'applicazione esplicita di 'System.Runtime.CompilerServices.NullableAttribute' non è consentita.
ja: 'System.Runtime.CompilerServices.NullableAttribute' の明示的な適用は許可されていません。
ko: 'System.Runtime.CompilerServices.NullableAttribute'의 명시적 적용은 허용되지 않습니다.
pl: Jawne stosowanie elementu „System.Runtime.CompilerServices.NullableAttribute” jest niedozwolone.
pt_br: Não é permitida a aplicação explícita de 'System.Runtime.CompilerServices.NullableAttribute'.
ru: Явное применение атрибута "System.Runtime.CompilerServices.NullableAttribute" не допускается.
tr: Açık 'System.Runtime.CompilerServices.NullableAttribute' uygulamasına izin verilmiyor.
zh_hans: 不允许显示应用 “System.Runtime.CompilerServices.NullableAttribute”。
zh_hant: 不允許明確應用 'System.Runtime.CompilerServices.NullableAttribute'。

# ERR_ExplicitParamArrayOrCollection
source: Do not use 'System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute'. Use the 'params' keyword instead.
fr: N’utilisez pas « System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute ». Utilisez plutôt le mot clé « params ».
it: Non usare 'System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute'. Al suo posto, usare la parola chiave 'params'.
pl: Nie używaj atrybutu „System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute”. Zamiast niego użyj słowa kluczowego „params”.
pt_br: Não use 'System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute'. Em vez disso, use a palavra-chave 'params'.
ru: Не используйте System.ParamArrayAttribute/System.Runtime.CompilerServices.ParamCollectionAttribute. Используйте ключевое слово "params".
zh_hans: Do not use 'System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute'.请改用关键字“params”。
zh_hant: 請勿使用 'System.ParamArrayAttribute'/'System.Runtime.CompilerServices.ParamCollectionAttribute'。請改用 'params' 關鍵字。

# ERR_ExplicitPropertyMismatchInitOnly
source: Accessors '{0}' and '{1}' should both be init-only or neither
cs: Přístupové objekty {0} a {1} by měly být buď oba jenom pro inicializaci, nebo ani jeden.
fr: Les accesseurs '{0}' et '{1}' doivent tous deux être initialiseurs uniquement ou ne pas l'être
it: Il tipo di sola inizializzazione può essere specificato per entrambe le funzioni di accesso '{0}' e '{1}' o per nessuna di esse
ja: アクセサー '{0}' と '{1}' は、両方 init 専用か、両方そうでないかのいずれかでなければなりません
pl: Tylko do inicjowania powinny być obie metody dostępu „{0}” i „{1}” albo żadna z nich
pt_br: Os acessadores '{0}' e '{1}' devem ser somente de inicialização ou nenhum
ru: Каждый из методов доступа "{0}" и "{1}" должен вызываться только во время инициализации либо ни один из этих методов доступа не должен вызываться таким образом.
zh_hans: 访问器 {0} 和 {1} 应同时为 init-only，或两者都不是
zh_hant: 存取子 '{0}' 與 '{1}' 不得同時是或不是僅供初始化

# ERR_ExplicitRequiredMember
source: Do not use 'System.Runtime.CompilerServices.RequiredMemberAttribute'. Use the 'required' keyword on required fields and properties instead.
cs: Nepoužívejte System.Runtime.CompilerServices.RequiredMemberAttribute. Místo toho použijte klíčové slovo required pro povinná pole a vlastnosti.
fr: N’utilisez pas « System.Runtime.CompilerServices.RequiredMemberAttribute ». Utilisez plutôt le mot clé « required » sur les champs et propriétés requis.
it: Non usare 'System.Runtime.CompilerServices.RequiredMemberAttribute'. Usare la parola chiave 'obbligatorio' nei campi e nelle proprietà obbligatori.
ja: 'System.Runtime.CompilerServices.RequiredMemberAttribute' を使用しないでください。代わりに、必須フィールドとプロパティに 'required' キーワードを使用してください。
pl: Nie używaj elementu „System.Runtime.CompilerServices.RequiredMemberAttribute”. Zamiast tego użyj słowa kluczowego „required” w wymaganych polach i właściwościach.
pt_br: Não use 'System.Runtime.CompilerServices.RequiredMemberAttribute'. Use a palavra-chave 'required' nos campos e propriedades requeridos.
ru: Не используйте "System.Runtime.CompilerServices.RequiredMemberAttribute". Вместо этого используйте ключевое слово "required" для обязательных полей и свойств.
zh_hans: 不要使用 'System.Runtime.CompilerServices.RequiredMemberAttribute'。请改为在必填字段和属性上使用 'required' 关键字。
zh_hant: 請勿使用 'System.Runtime.CompilerServices.RequiredMemberAttribute'。請改為在必要的欄位和屬性上使用 'required' 關鍵字。

# ERR_ExplicitScopedRef
source: Do not use 'System.Runtime.CompilerServices.ScopedRefAttribute'. Use the 'scoped' keyword instead.
cs: Nepoužívejte System.Runtime.CompilerServices.ScopedRefAttribute. Místo toho použijte klíčové slovo scoped.
fr: N'utilisez pas 'System.Runtime.CompilerServices.ScopedRefAttribute'. Utilisez plutôt le mot clé 'scoped'.
it: Non usare 'System.Runtime.CompilerServices.ScopedRefAttribute'. Usare invece la parola chiave 'scoped'.
ja: 'System.Runtime.CompilerServices.ScopedRefAttribute' を使用しないでください。キーワード 'scoped' を使用してください。
pl: Nie używaj atrybutu "System.Runtime.CompilerServices.ScopedRefAttribute". Zamiast tego użyj słowa kluczowego „scoped”.
pt_br: Não use 'System.Runtime.CompilerServices.ScopedRefAttribute'. Use a palavra-chave 'scoped'.
ru: Не используйте "System.Runtime.CompilerServices.ScopedRefAttribute". Вместо этого используйте ключевое слово "scoped".
zh_hans: 请勿使用 "System.Runtime.CompilerServices.ScopedRefAttribute"。请改用 "scoped" 关键字。
zh_hant: 請勿使用 'System.Runtime.CompilerServices.ScopedRefAttribute'。請改用 'scoped' 關鍵字。

# ERR_ExprCannotBeFixed
source: The given expression cannot be used in a fixed statement
cs: Daný výraz nelze použít v příkazu fixed.
de: Der angegebene Ausdruck kann nicht in einer fixed-Anweisung verwendet werden.
es: La expresión proporcionada no se puede utilizar en una instrucción "fixed"
fr: Impossible d'utiliser l'expression donnée dans une instruction fixed
it: Non è possibile usare l'espressione specificata in un'istruzione fixed
ja: 指定された式を fixed ステートメントで使用することはできません
ko: fixed 문에서는 지정된 식을 사용할 수 없습니다.
pl: Podanego wyrażenia nie można użyć w instrukcji fixed
pt_br: A expressão determinada não pode ser usada em uma instrução fixed
ru: Заданное выражение невозможно использовать в операторе fixed
tr: Belirtilen ifade, fixed deyiminde kullanılamıyor
zh_hans: 给定表达式不能用于 fixed 语句中
zh_hant: 指定運算式無法用於 fixed 陳述式中
