Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_CLS_AssemblyNotCLS2_Title
source: Type or member does not need a CLSCompliant attribute because the assembly does not have a CLSCompliant attribute
cs: Typ nebo člen nepotřebuje atribut CLSCompliant, protože sestavení nemá atribut CLSCompliant.
de: Typ oder Element benötigt kein CLSCompliant-Attribut, da die Assembly kein CLSCompliant-Attribut besitzt
es: El tipo o el miembro no necesitan un atributo CLSCompliant porque el ensamblador no tiene un atributo CLSCompliant
fr: Le type ou le membre n'a pas besoin d'un attribut CLSCompliant, car l'assembly n'a pas d'attribut CLSCompliant
it: Il tipo o il membro non necessita di un attributo CLSCompliant perché l'assembly non ha un attributo CLSCompliant
ja: アセンブリに CLSCompliant 属性がないため、型またはメンバーには CLSCompliant 属性は不要です
ko: 어셈블리에 CLSCompliant 특성이 없으므로 형식 또는 멤버에 CLSCompliant 특성이 필요하지 않습니다.
pl: Typ lub składowa nie wymaga atrybutu CLSCompliant, ponieważ zestaw nie ma atrybutu CLSCompliant
pt_br: O tipo ou membro não precisa de um atributo CLSCompliant porque o assembly não possui um atributo CLSCompliant
ru: Типу или члену не требуется атрибут, совместимый с CLS, так как сборка не содержит атрибут CLSCompliant
tr: Derlemenin CLSCompliant özniteliği olmadığından türün veya üyenin bir CLSCompliant özniteliğine ihtiyacı yoktur
zh_hans: 由于程序集没有 CLSCompliant 特性，因此类型或成员不需要 CLSCompliant 特性
zh_hant: 因為組件沒有 CLSCompliant 屬性，所以類型或成員不需要 CLSCompliant 屬性

# WRN_CLS_MeaninglessOnParam
source: CLSCompliant attribute has no meaning when applied to parameters. Try putting it on the method instead.
cs: Atribut CLSCompliant nemá žádný význam při použití u parametrů. Použijte jej místo toho u metody.
de: Das CLSCompliant-Attribut hat keine Bedeutung, wenn es auf Parameter angewendet wird. Wenden Sie es stattdessen auf die Methode an.
es: El atributo CLSCompliant no tiene ningún significado cuando se aplica a parámetros. Pruebe a incluirlo en el método.
fr: L'attribut CLSCompliant n'a pas de sens lorsqu'il est appliqué à des paramètres. Essayez de le placer dans la méthode à la place.
it: L'attributo CLSCompliant non ha significato quando applicato a parametri. Provare ad applicarlo al metodo.
ja: CLSCompliant 属性は、パラメーターに適用されても意味がありません。メソッドに適用してください。
ko: CLSCompliant 특성을 매개 변수에 적용하면 의미가 없습니다. 대신 이 특성을 메서드에 사용하세요.
pl: Atrybut CLSCompliant nie ma znaczenia, gdy jest stosowany do parametrów. Zamiast tego spróbuj umieścić go w metodzie.
pt_br: O atributo CLSCompliant não tem sentido quando aplicado a parâmetros. Tente colocá-lo no método.
ru: Атрибут CLSCompliant не применяется к параметрам. Попробуйте разместить его в методе.
tr: Parametrelere uygulandığında CLSCompliant özniteliğinin bir anlamı yoktur. Yerine bir yönteme koymayı deneyin.
zh_hans: CLSCompliant 特性在应用于参数时无意义。请尝试将该特性应用于方法。
zh_hant: CLSCompliant 屬性套用在參數上沒有意義，請改為置於方法上。

# WRN_CLS_MeaninglessOnParam_Title
source: CLSCompliant attribute has no meaning when applied to parameters
cs: Atribut CLSCompliant nemá žádný význam při použití u parametrů.
de: CLSCompliant-Attribut hat keine Bedeutung, wenn es auf die Parameter angewendet wird
es: El atributo CLSCompliant no tiene ningún significado cuando se aplica a parámetros
fr: L'attribut CLSCompliant n'a pas de sens lorsqu'il est appliqué à des paramètres
it: L'attributo CLSCompliant non ha significato quando applicato a parametri
ja: CLSCompliant 属性は、パラメーターに適用しても意味がありません
ko: CLSCompliant 특성을 매개 변수에 적용하면 의미가 없습니다.
pl: Atrybut CLSCompliant nie ma znaczenia w przypadku zastosowania go do parametrów
pt_br: O atributo CLSCompliant não tem sentido quando aplicado a parâmetros
ru: Атрибут CLSCompliant не имеет значения при применении к параметрам
tr: CLSCompliant özniteliğinin parametrelere uygulandığında anlamı yoktur
zh_hans: CLSCompliant 特性在应用于参数时无意义
zh_hant: CLSCompliant 屬性在套用至參數時沒有任何意義

# WRN_CLS_MeaninglessOnReturn
source: CLSCompliant attribute has no meaning when applied to return types. Try putting it on the method instead.
cs: Atribut CLSCompliant nemá žádný význam při použití u typů vrácených hodnot. Použijte jej místo toho u metody.
de: Das CLSCompliant-Attribut hat keine Bedeutung, wenn es auf Rückgabetypen angewendet wird. Wenden Sie es stattdessen auf die Methode an.
es: El atributo CLSCompliant no tiene ningún significado cuando se aplica a tipos de valor devuelto. Pruebe a incluirlo en el método.
fr: L'attribut CLSCompliant n'a pas de sens lorsqu'il est appliqué à des types de retour. Essayez de le placer dans la méthode à la place.
it: L'attributo CLSCompliant non ha significato quando applicato a tipi restituiti. Provare ad applicarlo al metodo.
ja: CLSCompliant 属性は、戻り値の型に適用されても意味がありません。メソッドに適用してください。
ko: CLSCompliant 특성은 반환 형식에 적용하면 의미가 없습니다. 대신 이 특성을 메서드에 사용하세요.
pl: Atrybut CLSCompliant nie ma znaczenia, gdy jest stosowany do zwracanych typów. Zamiast tego spróbuj umieścić go w metodzie.
pt_br: O atributo CLSCompliant não tem sentido quando aplicado a tipos de retorno. Tente colocá-lo no método.
ru: Атрибут CLSCompliant не применяется к возвращаемым типам. Попробуйте разместить его в методе.
tr: Dönüş türlerine uygulandığında CLSCompliant özniteliğinin bir anlamı yoktur. Yerine bir yönteme koymayı deneyin.
zh_hans: CLSCompliant 特性在应用于返回类型时无意义。请尝试将该特性应用于方法。
zh_hant: CLSCompliant 屬性套用至傳回類型沒有意義，請改為置於方法上。

# WRN_CLS_MeaninglessOnReturn_Title
source: CLSCompliant attribute has no meaning when applied to return types
cs: Atribut CLSCompliant nemá žádný význam při použití u návratových typů.
de: Das CLSCompliant-Attribut hat keine Bedeutung, wenn es auf die Rückgabetypen angewendet wird
es: El atributo CLSCompliant no tiene ningún significado cuando se aplica tipos de retorno
fr: L'attribut CLSCompliant n'a pas de sens lorsqu'il est appliqué à des types de retour
it: L'attributo CLSCompliant non ha significato quando applicato a tipi restituiti
ja: CLSCompliant 属性は、戻り値の型に適用しても意味がありません
ko: CLSCompliant 특성을 반환 형식에 적용하면 의미가 없습니다.
pl: Atrybut CLSCompliant nie ma znaczenia w przypadku zastosowania go do typów zwracanych
pt_br: O atributo CLSCompliant não tem sentido quando aplicado a tipos de retorno
ru: Атрибут CLSCompliant не имеет значения при применении к типам возвращаемых значений
tr: CLSCompliant özniteliğinin döndürme türlerine uygulandığında anlamı yoktur
zh_hans: CLSCompliant 特性在应用于返回类型时无意义
zh_hant: CLSCompliant 屬性在套用至傳回類型時沒有任何意義

# WRN_CLS_BadTypeVar
source: Constraint type '{0}' is not CLS-compliant
cs: Typ omezení {0} není kompatibilní se specifikací CLS.
de: Einschränkungstyp "{0}" ist nicht CLS-kompatibel.
es: El tipo de restricción '{0}' no es conforme a CLS
fr: Le type de contrainte '{0}' n'est pas conforme CLS
it: Il tipo di vincolo '{0}' non è conforme a CLS
ja: 制約型 '{0}' は CLS に準拠していません
ko: {0}' 제약 조건 형식이 CLS 규격이 아닙니다.
pl: Typ ograniczenia „{0}” nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de restrição "{0}" não tem conformidade com CLS
ru: Тип ограничения "{0}" несовместим с CLS.
tr: {0}' kısıtlama türü CLS uyumlu değil
zh_hans: 约束类型“{0}”不符合 CLS
zh_hant: 條件約束類型 '{0}' 不符合 CLS 規範

# WRN_CLS_BadTypeVar_Title
source: Constraint type is not CLS-compliant
cs: Typ omezení není kompatibilní se specifikací CLS.
de: Einschränkungstyp ist nicht CLS-kompatibel
es: El tipo de restricción no es conforme a CLS
fr: Le type de contrainte n'est pas conforme CLS
it: Il tipo di vincolo non è conforme a CLS
ja: 制約型が CLS に準拠していません
ko: 제약 조건 형식이 CLS 규격이 아닙니다.
pl: Typ ograniczenia nie jest zgodny ze specyfikacją CLS
pt_br: Tipo de restrição não tem conformidade com CLS
ru: Тип ограничения несовместим с CLS
tr: Kısıtlama türü CLS uyumlu değil
zh_hans: 约束类型不符合 CLS
zh_hant: 條件約束類型不符合 CLS 規範

# WRN_CLS_VolatileField
source: CLS-compliant field '{0}' cannot be volatile
cs: Pole kompatibilní se specifikací CLS {0} nemůže být typu volatile.
de: Das CLS-kompatible Feld "{0}" kann nicht flüchtig sein.
es: El campo '{0}' conforme a CLS no puede ser volátil
fr: Le champ conforme CLS '{0}' ne peut pas être volatile
it: Il campo conforme a CLS '{0}' non può essere volatile
ja: CLS 準拠フィールド '{0}' を volatile にすることはできません
ko: CLS 규격 필드 '{0}'은(는) volatile일 수 없습니다.
pl: Pole zgodne ze specyfikacją CLS „{0}” nie może mieć specyfikatora volatile
pt_br: Campo em conformidade com CLS "{0}" não pode ser volátil
ru: Поле "{0}", совместимое с CLS, не может быть временным.
tr: {0}' CLS uyumlu alanı geçici olamaz
zh_hans: 符合 CLS 的字段“{0}”不能是可变字段
zh_hant: 符合 CLS 規範的欄位 '{0}' 不可為 Volatile

# WRN_CLS_VolatileField_Title
source: CLS-compliant field cannot be volatile
cs: Pole kompatibilní se specifikací CLS nemůže být typu volatile.
de: CLS-kompatibles Feld kann nicht temporär sein
es: El campo no conforme a CLS no puede ser volátil
fr: Le champ conforme CLS ne peut pas être volatile
it: Il campo conforme a CLS non può essere volatile
ja: CLS 準拠フィールドを volatile にすることはできません
ko: CLS 규격 필드는 volatile일 수 없습니다.
pl: Pole zgodne ze specyfikacją CLS nie może być nietrwałe
pt_br: Campo em conformidade com CLS não pode ser volátil
ru: Поле, совместимое с CLS, не может иметь модификатор volatile
tr: CLS uyumlu alan geçici olamaz
zh_hans: 符合 CLS 的字段不能是可变字段
zh_hant: 符合 CLS 規範的欄位不可為 volatile

# WRN_CLS_BadInterface
source: '{0}' is not CLS-compliant because base interface '{1}' is not CLS-compliant
cs: {0} není kompatibilní se specifikací CLS, protože základní rozhraní {1} není kompatibilní se specifikací CLS.
de: '"{0}" ist nicht CLS-kompatibel, da die Basisschnittstelle "{1}" nicht CLS-kompatibel ist.
es: '{0}' no es conforme a CLS porque la interfaz base '{1}' no lo es
fr: '{0}' n'est pas conforme CLS, car l'interface de base '{1}' n'est pas conforme CLS
it: '{0}' non è conforme a CLS perché l'interfaccia di base '{1}' non è conforme a CLS
ja: '基底インターフェイス '{1}' が CLS 準拠でないため、'{0}' は CLS に準拠していません
ko: '기본 인터페이스 '{1}'이(가) CLS 규격이 아니므로 '{0}'은(는) CLS 규격이 아닙니다.
pl: 'Element „{0}” nie jest zgodny ze specyfikacją CLS, ponieważ interfejs podstawowy „{1}” nie jest zgodny ze specyfikacją CLS
pt_br: "{0}" não tem conformidade com CLS porque a interface base "{1}" não tem conformidade com CLS
ru: "{0}" несовместим с CLS, поскольку с ним несовместим базовый интерфейс "{1}".
tr: '{1}' temel arabirimi CLS uyumlu olmadığından '{0}' CLS uyumlu değil
zh_hans: “{0}”不符合 CLS，因为基接口“{1}”不符合 CLS
zh_hant: '{0}' 不符合 CLS 規範，因為基底介面 '{1}' 不符合 CLS 規範

# WRN_CLS_BadInterface_Title
source: Type is not CLS-compliant because base interface is not CLS-compliant
cs: Typ není kompatibilní se specifikací CLS, protože základní rozhraní není kompatibilní se specifikací CLS.
de: Typ ist nicht CLS-kompatibel, da die Basisschnittstelle nicht CLS-kompatibel ist
es: El tipo no es conforme a CLS porque la interfaz base no es conforme a CLS
fr: Le type n'est pas conforme CLS, car l'interface de base n'est pas conforme CLS
it: Il tipo non è conforme a CLS perché l'interfaccia di base non è conforme a CLS
ja: 基底インターフェイスが CLS に準拠していないため、型は CLS に準拠していません
ko: 기본 인터페이스가 CLS 규격이 아니므로 형식이 CLS 규격이 아닙니다.
pl: Typ nie jest zgodny ze specyfikacją CLS, ponieważ interfejs podstawowy nie jest zgodny ze specyfikacją CLS
pt_br: O tipo não tem conformidade com CLS porque a interface base não tem conformidade com CLS
ru: Тип несовместим с CLS, так как базовый интерфейс несовместим с CLS
tr: Temel arabirim CLS uyumlu olmadığından tür CLS uyumlu değil
zh_hans: 类型不符合 CLS，因为基接口不符合 CLS
zh_hant: 類型不符合 CLS 規範，因為基底介面不符合 CLS 規範

# ERR_BadAwaitArg
source: 'await' requires that the type {0} have a suitable 'GetAwaiter' method
cs: 'Operátor await vyžaduje, aby typ {0} měl odpovídající metodu GetAwaiter.
de: '"await" erfordert, dass der Typ "{0}" über eine geeignete GetAwaiter-Methode verfügt.
es: "await" requiere que el tipo {0} tenga un método "GetAwaiter" adecuado.
fr: Avec 'await', le type {0} doit avoir une méthode 'GetAwaiter' appropriée
it: Con 'await' il tipo {0} deve essere associato a un metodo 'GetAwaiter' appropriato
ja: 'await' では、型 {0} に適切な GetAwaiter メソッドがあることが必要です
ko: 'await'의 경우 {0} 형식에 적합한 GetAwaiter 메서드가 있어야 합니다.
pl: Operator „await” wymaga, aby typ {0} miał odpowiednią metodę „GetAwaiter”
pt_br: 'await' requer que o tipo {0} tenha um método 'GetAwaiter' adequado
ru: 'Для применения оператора "await" у типа {0} должен быть подходящий метод GetAwaiter.
tr: 'await' {0} türünün uygun bir GetAwaiter yöntemi olmasını gerektirir
zh_hans: '“await”要求类型 {0} 包含适当的 GetAwaiter 方法
zh_hant: 'await' 要求類型 {0} 必須要有適合的 GetAwaiter 方法

# ERR_BadAwaitArgIntrinsic
source: Cannot await '{0}'
cs: Operátor await nejde použít pro {0}.
de: Kann nicht auf "{0}" warten.
es: No se puede usar await con '{0}'
fr: Impossible d'attendre '{0}'
it: Non è possibile attendere '{0}'
ja: '{0}' を待機することができません
ko: {0}'에 대해 await를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania na „{0}”
pt_br: Não é possível aguardar "{0}"
ru: Ожидание "{0}" невозможно
tr: {0}' beklenemiyor
zh_hans: 无法等待“{0}”
zh_hant: 無法等候 '{0}'

# ERR_BadAwaiterPattern
source: 'await' requires that the return type '{0}' of '{1}.GetAwaiter()' have suitable 'IsCompleted', 'OnCompleted', and 'GetResult' members, and implement 'INotifyCompletion' or 'ICriticalNotifyCompletion'
cs: 'Operátor await vyžaduje, aby návratový typ {0} metody {1}.GetAwaiter() měl odpovídající členy IsCompleted, OnCompleted a GetResult a implementoval rozhraní INotifyCompletion nebo ICriticalNotifyCompletion.
de: "await" erfordert, dass der Rückgabetyp "{0}" von "{1}.GetAwaiter()" über die geeigneten Member IsCompleted, OnCompleted und GetResult verfügt und INotifyCompletion oder ICriticalNotifyCompletion implementiert.
es: "await" requiere que el tipo de valor devuelto "{0}" de "{1}.GetAwaiter()" tenga miembros "IsCompleted", "OnCompleted" y "GetResult" adecuados y que implemente "INotifyCompletion" o "ICriticalNotifyCompletion".
fr: Avec 'await', le type de retour '{0}' de '{1}.GetAwaiter()' doit avoir des membres 'IsCompleted', 'OnCompleted' et 'GetResult' appropriés. De plus, il doit implémenter 'INotifyCompletion' ou 'ICriticalNotifyCompletion'
it: Con 'await' il tipo restituito '{0}' di '{1}.GetAwaiter()' deve essere associato a membri 'IsCompleted', 'OnCompleted' e 'GetResult' appropriati e implementare 'INotifyCompletion' o 'ICriticalNotifyCompletion'
ja: 'await' では、'{1}.GetAwaiter()' の戻り値の型 '{0}' に適切な IsCompleted、OnCompleted、GetResult メンバーがあり、INotifyCompletion または ICriticalNotifyCompletion を実装する必要があります。
ko: 'await'의 경우 '{1}.GetAwaiter()'의 반환 형식 '{0}'에 적합한 'IsCompleted', 'OnCompleted' 및 'GetResult' 멤버가 있어야 하며 'INotifyCompletion' 또는 'ICriticalNotifyCompletion'을 구현해야 합니다.
pl: Operator „await” wymaga, aby zwracany typ „{0}” metody „{1}.GetAwaiter()” miał odpowiednie składowe „IsCompleted”, „OnCompleted” i „GetResult” oraz implementował interfejs „INotifyCompletion” lub „ICriticalNotifyCompletion”
pt_br: 'await' requer que o tipo de retorno '{0}' de '{1}.GetAwaiter()' tenha membros 'IsCompleted', 'OnCompleted' e 'GetResult' adequados e implemente 'INotifyCompletion' ou 'ICriticalNotifyCompletion'
ru: Для использования оператора "Await" необходимо, чтобы у возвращаемого типа "{0}" метода "{1}.GetAwaiter()" были соответствующие члены IsCompleted, OnCompleted и GetResult и чтобы этот тип реализовывал интерфейс INotifyCompletion или ICriticalNotifyCompletion.
tr: 'await', '{1}.GetAwaiter()' öğesinin '{0}' dönüş türünün uygun IsCompleted, OnCompleted ve GetResult üyeleri olmasını ve INotifyCompletion veya ICriticalNotifyCompletion uygulanmasını gerektirir.
zh_hans: '“await”要求“{1}.GetAwaiter()”的返回类型“{0}”包含适当的 IsCompleted、OnCompleted 和 GetResult 成员，并实现 INotifyCompletion 或 ICriticalNotifyCompletion
zh_hant: 'await' 要求 '{1}.GetAwaiter()' 的傳回類型 '{0}' 必須是適合的 IsCompleted、OnCompleted 和 GetResult 成員，且實作 INotifyCompletion 或 ICriticalNotifyCompletion。

# ERR_BadAwaitArg_NeedSystem
source: 'await' requires that the type '{0}' have a suitable 'GetAwaiter' method. Are you missing a using directive for 'System'?
cs: 'Operátor await vyžaduje, aby typ {0} měl odpovídající metodu GetAwaiter. Chybí vám direktiva using pro položku System?
de: '"await" erfordert, dass der Typ "{0}" über eine geeignete GetAwaiter-Methode verfügt. Fehlt möglicherweise eine using-Direktive für "System"?
es: "await" requiere que el tipo "{0}" tenga un método "GetAwaiter" adecuado. ¿Falta una directiva "using" para "System"?
fr: Avec 'await', le type '{0}' doit avoir une méthode 'GetAwaiter' appropriée. Est-ce qu'il vous manque une directive using pour 'System' ?
it: Con 'await' il tipo '{0}' deve essere associato a un metodo 'GetAwaiter' appropriato. Manca una direttiva using per 'System'?
ja: 'await' では、型 '{0}' に適切な GetAwaiter メソッドが必要です。'System' に使用中のディレクティブは指定されていますか?
ko: 'await'를 사용하려면 '{0}' 형식에 적합한 'GetAwaiter' 메서드가 있어야 합니다. 'System'에 대해 using 지시문이 있는지 확인하세요.
pl: Operator „await” wymaga, aby typ {0} miał przypisaną odpowiednią metodę „GetAwaiter”. Czy brakuje dyrektywy using dla elementu „System”?
pt_br: 'await' requer que o tipo '{0}' tenha um método 'GetAwaiter' adequado. Está faltando uma diretiva using para 'System'?
ru: 'Для применения оператора "await" у типа "{0}" должен быть подходящий метод GetAwaiter. Возможно отсутствует директива using для "System".
tr: 'await' '{0}' türünün uygun bir GetAwaiter yöntemi olmasını gerektirir. 'System' için using yönergesi eksik olabilir mi?
zh_hans: '“await”要求类型“{0}”包含适当的 GetAwaiter 方法。是否缺少针对“System”的 using 指令?
zh_hant: 'await' 要求類型 '{0}' 必須要有適合的 GetAwaiter 方法。是否遺漏了 'System' 的 using 指示詞?

# ERR_BadAwaitArgVoidCall
source: Cannot await 'void'
cs: Operátor await nejde použít pro void.
de: Kann nicht auf "void" warten.
es: No se puede usar await con 'void'
fr: Impossible d'attendre 'void'
it: Non è possibile attendere 'void'
ja: void' を待機することができません
ko: void'에 대해 'void'를 사용할 수 없습니다.
pl: Nie można zdefiniować oczekiwania na „void”
pt_br: Não é possível aguardar "void"
ru: Ожидание "void" невозможно
tr: void' beklenemiyor
zh_hans: 无法等待“void”
zh_hant: 無法等候 'void'

# ERR_BadAwaitAsIdentifier
source: 'await' cannot be used as an identifier within an async method or lambda expression
cs: 'Operátor Await nejde použít jako identifikátor v asynchronní metodě nebo výrazu lambda.
de: '"await" kann nicht als Bezeichner innerhalb einer Async-Methode oder eines Lambdaausdrucks verwendet werden.
es: 'await' no se puede usar como identificador dentro de un método asincrónico o expresión lambda
fr: 'await' ne peut pas être utilisé comme identificateur dans une méthode async ou une expression lambda
it: 'Non è possibile usare 'await' come identificatore all'interno di un metodo asincrono o di un'espressione lambda
ja: '非同期メソッドまたはラムダ式の内部で 'await' を識別子として使用することはできません
ko: 'await'는 비동기 메서드나 람다 식 내에서 식별자로 사용할 수 없습니다.
pl: 'Operatora „await” nie można użyć jako identyfikatora w metodzie asynchronicznej ani wyrażeniu lambda.
pt_br: 'await' não pode ser usado como um identificador em um método assíncrono ou em uma expressão lambda
ru: 'Оператор await нельзя использовать в качестве идентификатора в асинхронном методе или лямбда-выражении.
tr: 'await', zaman uyumsuz bir yöntemde veya bir lambda ifadesinde tanımlayıcı olarak kullanılamaz
zh_hans: '“await”不能用作异步方法或 lambda 表达式中的标识符
zh_hant: 'await' 不能當做非同步方法或 Lambda 運算式中的識別項使用

# ERR_DoesntImplementAwaitInterface
source: '{0}' does not implement '{1}'
cs: {0} neimplementuje {1}.
de: '"{0}" implementiert nicht "{1}".
es: '{0}' no implementa '{1}'
fr: '{0}' n'implémente pas '{1}'
it: '{0}' non implementa '{1}'
ja: '{0}' は '{1}' を実装しません
ko: '{0}'은(는) '{1}'을(를) 구현하지 않습니다.
pl: „{0}” nie implementuje „{1}”
pt_br: "{0}" não implementa "{1}"
ru: "{0}" не реализует "{1}"
tr: '{0}', '{1}' öğesini uygulamaz
zh_hans: “{0}”不实现“{1}”
zh_hant: '{0}' 未實作 '{1}'

# ERR_TaskRetNoObjectRequired
source: Since '{0}' is an async method that returns '{1}', a return keyword must not be followed by an object expression
cs: Protože {0} je asynchronní metoda, která vrací {1}, nesmí za klíčovým slovem return následovat výraz objektu.
fr: Comme « {0} » est une méthode asynchrone qui renvoie « {1} », un mot clé de retour ne doit pas être suivi d’une expression d’objet
it: Poiché '{0}' è un metodo asincrono che restituisce '{1}', una parola chiave di restituzione non deve essere seguita da un'espressione di oggetto
ja: '{0}' は '{1}' を返す非同期メソッドであるため、return キーワードの後にオブジェクト式を続けてはなりません
pl: Ponieważ „{0}” jest metodą asynchroniczną, która zwraca wartość „{1}”, po zwrotnym słowie kluczowym nie może występować wyrażenie obiektu.
pt_br: Como '{0}' é um método assíncrono que retorna '{1}', uma palavra-chave de retorno não deve ser seguida por uma expressão de objeto
ru: Поскольку "{0}" является асинхронным методом, возвращающим "{1}", за ключевым словом return не может следовать выражение объекта
zh_hans: 由于 "{0}" 是返回 "{1}" 的异步方法，因此返回关键字不得后跟对象表达式
zh_hant: 因為 '{0}' 是個會傳回 '{1}' 的非同步方法，所以傳回關鍵字之後不可接著物件運算式。

# ERR_BadAsyncReturn
source: The return type of an async method must be void, Task, Task<T>, a task-like type, IAsyncEnumerable<T>, or IAsyncEnumerator<T>
cs: Návratový typ asynchronní metody musí být void, Task, Task<T>, typ podobný úloze, IAsyncEnumerable<T> nebo IAsyncEnumerator<T>.
de: Eine asynchrone Methode kann einen der folgenden Rückgabetypen haben: void, Task, Task<T>, einen taskähnlichen Typ, IAsyncEnumerable<T> oder IAsyncEnumerator<T>
es: El tipo de valor devuelto de un método asincrónico debe ser void, Task, Task<T>, una variante del tipo Task, IAsyncEnumerable<T> o IAsyncEnumerator<T>.
fr: Le type de retour d'une méthode async doit être void, Task, Task<T>, un type de tâche, IAsyncEnumerable<T> ou IAsyncEnumerator<T>
it: Il tipo restituito di un metodo asincrono deve essere void, Task, Task<T>, un tipo simile a Task, IAsyncEnumerable<T> o IAsyncEnumerator<T>
ja: 非同期メソッドの戻り値の型は、void、Task、Task<T>、task-like 型、IAsyncEnumerable<T>、IAsyncEnumerator<T> でなければなりません
ko: 비동기 메서드의 반환 형식은 void, Task, Task<T>, task와 유사한 형식, IAsyncEnumerable<T> 또는 IAsyncEnumerator<T>여야 합니다.
pl: Typ zwracany metody asynchronicznej musi być elementem void, Task lub Task<T>, typem podobnym do zadania albo elementem IAsyncEnumerable<T> lub IAsyncEnumerator<T>
pt_br: O tipo de retorno de um método assíncrono precisa ser nulo, Task, Task<T>, um tipo semelhante à tarefa, IAsyncEnumerable<T> ou IAsyncEnumerator<T>
ru: Возвращаемым типом асинхронного метода должен быть void, Task, Task<T> или аналогичный тип, IAsyncEnumerable<T> или IAsyncEnumerator<T>.
tr: Zaman uyumsuz bir metodun dönüş türü void, Task, Task<T>, task benzeri bir tür, IAsyncEnumerable<T> veya IAsyncEnumerator<T> olmalıdır
zh_hans: 异步方法的返回类型必须为 void、Task 或 Task<T>、类似任务的类型、IAsyncEnumerable<T> 或 IAsyncEnumerator<T>
zh_hant: 非同步方法的傳回類型必須為 void、Task、Task<T>、task-like 類型、IAsyncEnumerable<T> 或 IAsyncEnumerator<T>

# ERR_CantReturnVoid
source: Cannot return an expression of type 'void'
cs: Nejde vrátit výraz typu void.
de: Es kann kein Ausdruck vom Typ "void" zurückgegeben werden.
es: No se puede devolver una expresión de tipo 'void'
fr: Impossible de retourner une expression de type 'void'
it: Non è possibile restituire un'espressione di tipo 'void'
ja: void' 型の式を返すことはできません
ko: void' 형식의 식을 반환할 수 없습니다.
pl: Nie można zwrócić wyrażenia typu „void”.
pt_br: Não é possível retornar uma expressão do tipo 'void'
ru: Невозможно вернуть выражение типа void.
tr: void' türünde bir ifade döndürülemez
zh_hans: 无法返回 "void" 类型的表达式
zh_hant: 無法傳回類型 'void' 的運算式
