Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ImplicitImplementationOfInaccessibleInterfaceMember
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implicitly implement an inaccessible member.
cs: {0} neimplementuje člen rozhraní {1}. {2} nemůže implicitně implementovat nepřístupný člen.
fr: '{0}' n’implémente pas le membre d’interface '{1}'. '{2}' ne peut pas implémenter implicitement un membre inaccessible.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare implicitamente un membro inaccessibile.
ja: '{0}' は、インターフェイス メンバー '{1}' を実装していません。'{2}' はアクセスできないメンバーを暗黙的に実装できません。
pl: Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może jawnie implementować niedostępnej składowej.
pt_br: '{0}' não implementa o membro da interface '{1}'. '{2}' não pode implementar implicitamente um membro inacessível.
ru: "{0}" не реализует член интерфейса "{1}". "{2}" не может неявно реализовать недоступный член.
zh_hans: "{0}" 不实现接口成员 "{1}"。"{2}" 无法隐式实现无法访问的成员。
zh_hant: '{0}' 未實作介面成員 '{1}'。'{2}' 無法隱含地實作無法存取的成員。

# ERR_ImplicitIndexIndexerWithName
source: Invocation of implicit Index Indexer cannot name the argument.
cs: Volání implicitního indexeru indexů nemůže pojmenovat argument.
de: Durch den Aufruf des impliziten Indexindexers kann das Argument nicht benannt werden.
es: La invocación del indizador de índices implícito no puede nombrar el argumento.
fr: L'appel de l'indexeur d'index implicite ne peut pas nommer l'argument.
it: La chiamata dell'indicizzatore di indice implicito non può assegnare un nome all'argomento.
ja: 暗黙的なインデックス インデクサーの呼び出しでは、引数に名前を付けることはできません。
ko: 암시적 인덱스 인덱서 호출로 인수 이름을 지정할 수 없습니다.
pl: W wywołaniu niejawnego indeksatora indeksu nie może być nazwy argumentu.
pt_br: A invocação do Indexador de Índice implícito não pode nomear o argumento.
ru: Вызов неявного индексатора для индекса не может присвоить аргументу имя.
tr: Örtük Dizin Oluşturucu'nun çağrılması bağımsız değişkeni adlandıramaz.
zh_hans: 无法通过对隐式索引索引器的调用为参数命名。
zh_hant: 隱含 Index 索引子的引動過程無法為引數命名。

# ERR_ImplicitObjectCreationIllegalTargetType
source: The type '{0}' may not be used as the target type of new()
cs: Typ {0} se nedá použít jako cílový typ příkazu new().
fr: Le type '{0}' ne doit pas être utilisé en tant que type cible de new()
it: Non è possibile usare il tipo '{0}' come tipo di destinazione di new()
ja: 型 '{0}' は new() のターゲット型として使用することはできません
pl: Typu „{0}” nie można używać jako typu docelowego wyrażenia new()
pt_br: O tipo '{0}' pode não ser usado como o tipo de destino de new()
ru: Тип "{0}" не может использоваться в качестве типа целевого объекта для new()
zh_hans: 类型 "{0}" 不能用作 new() 目标类型
zh_hant: new() 的目標類型不可為類型 '{0}'

# ERR_ImplicitObjectCreationNoTargetType
source: There is no target type for '{0}'
cs: Není k dispozici žádný cílový typ pro {0}
fr: Il n'existe aucun type cible pour '{0}'
it: Non esiste alcun tipo di destinazione per '{0}'
ja: '{0}' のターゲット型がありません
pl: Brak typu docelowego dla elementu „{0}”
pt_br: Não há um tipo de destino para '{0}'
ru: Отсутствует целевой тип для "{0}".
zh_hans: "{0}" 没有目标类型
zh_hant: '{0}' 沒有任何目標類型

# ERR_ImplicitObjectCreationNotValid
source: Use of new() is not valid in this context
cs: Použití new() není v tomto kontextu platné
fr: L'utilisation de new() est non valide dans ce contexte
it: Non è possibile usare new() in questo contesto
ja: new() はこのコンテキストでは使用できません
pl: Użycie wyrażenia new() jest nieprawidłowe w tym kontekście
pt_br: O uso de new() não é válido neste contexto
ru: Использование new() в этом контексте не допускается.
zh_hans: 在此上下文中使用 new() 无效
zh_hant: 此內容中不可使用 new()

# ERR_ImplicitRangeIndexerWithName
source: Invocation of implicit Range Indexer cannot name the argument.
cs: Volání implicitního indexeru rozsahů nemůže pojmenovat argument.
de: Durch den Aufruf des impliziten Bereichsindexers kann das Argument nicht benannt werden.
es: La invocación del indizador de rangos implícito no puede nombrar el argumento.
fr: L'appel de l'indexeur de plage implicite ne peut pas nommer l'argument.
it: La chiamata dell'indicizzatore di intervallo implicito non può assegnare un nome all'argomento.
ja: 暗黙的な範囲インデクサーの呼び出しでは、引数に名前を付けることはできません。
ko: 암시적 범위 인덱서 호출로 인수 이름을 지정할 수 없습니다.
pl: W wywołaniu niejawnego indeksatora zakresu nie może być nazwy argumentu.
pt_br: A invocação do Indexador de Intervalo implícito não pode nomear o argumento.
ru: Вызов неявного индексатора для диапазона не может присвоить аргументу имя.
tr: Örtük Aralık Dizin Oluşturucu'nun çağrılması bağımsız değişkeni adlandıramaz.
zh_hans: 无法通过对隐式范围索引器的调用为参数命名。
zh_hant: 隱含 Range 索引子的引動過程無法為引數命名。

# ERR_ImplicitlyTypedDefaultParameter
source: Implicitly typed lambda parameter '{0}' cannot have a default value.
cs: Implicitně zadaný parametr lambda {0} nemůže mít výchozí hodnotu.
fr: Le paramètre d’expression lambda implicitement typé '{0}' ne peut pas avoir de valeur par défaut.
it: Il parametro lambda tipizzato in modo implicito '{0}' non può avere un valore predefinito.
ja: 暗黙的に型指定されたラムダパラメーター '{0}' に既定値を指定することはできません。
pl: Niejawnie typizowany parametr wyrażenia lambda „{0}” nie może mieć wartości domyślnej.
pt_br: O parâmetro lambda '{0}' digitado implicitamente não pode ter um valor padrão.
ru: Неявно типизованный параметр "{0}" не может иметь значение по умолчанию.
zh_hans: 隐式键入的 lambda 参数 "{0}" 不能具有默认值。
zh_hant: 隱含輸入的 Lambda 參數 '{0}' 不能有預設值。

# ERR_ImplicitlyTypedParamsParameter
source: Implicitly typed lambda parameter '{0}' cannot have the 'params' modifier.
pt_br: O parâmetro lambda com tipo implícito "{0}" não pode ter o modificador "params".

# ERR_ImplicitlyTypedVariableUsedInForbiddenZone
source: Reference to an implicitly-typed variable '{0}' is not permitted in this location.
pt_br: A referência a uma variável de tipo implícito "{0}" não é permitida neste local.

# ERR_InDynamicMethodArg
source: Arguments with 'in' modifier cannot be used in dynamically dispatched expressions.
cs: Argumenty s modifikátorem in se nedají použít v dynamicky volaných výrazech.
de: Argumente mit dem Modifizierer "in" können nicht in dynamisch gebundenen Ausdrücken verwendet werden.
es: No se pueden usar argumentos con el modificador "in" en expresiones distribuidas dinámicamente.
fr: Impossible d'utiliser les arguments avec le modificateur 'in' dans les expressions dispatchées dynamiquement.
it: Non è possibile usare argomenti con il modificatore 'in' nelle espressioni inviate in modo dinamico.
ja: 'in' 修飾子を持つ引数を、動的ディスパッチされる式で使用することはできません。
ko: 동적으로 디스패치된 식에서 'in' 한정자가 있는 인수를 사용할 수 없습니다.
pl: Nie można używać argumentów z modyfikatorem „in” w wyrażeniach przydzielanych dynamicznie.
pt_br: Os argumentos com o modificador 'in' não podem ser usados em expressões vinculadas dinamicamente.
ru: Аргументы с модификатором "in" невозможно использовать в динамически диспетчеризируемых выражениях.
tr: 'in' değiştiricisine sahip bağımsız değişkenler dinamik olarak dağıtılan ifadelerde kullanılamaz.
zh_hans: 带有 "in" 修饰符的参数不能用于动态调度的表达式。
zh_hant: 具有 'in' 修飾元的引數不可用於動態分派的運算式。

# ERR_InExtensionParameterMustBeValueType
source: The 'in' or 'ref readonly' receiver parameter of extension must be a concrete (non-generic) value type.
pt_br: O parâmetro de receptor "in" ou "ref readonly" da extensão deve ser um tipo de valor concreto (não genérico).

# ERR_InequalityOperatorInPatternNotSupported
source: The '!=' operator is not supported in a pattern. Use 'not' to represent a negated pattern.
pt_br: Não há suporte para o operador "!=" em um padrão. Use "not" para representar um padrão negado.

# ERR_InheritingFromRecordWithSealedToString
source: Inheriting from a record with a sealed 'Object.ToString' is not supported in C# {0}. Please use language version '{1}' or greater.
cs: Dědění ze záznamu se zapečetěným objektem Object.ToString se v jazyce C# {0} nepodporuje. Použijte prosím jazykovou verzi {1} nebo vyšší.
fr: L’héritage d’un enregistrement avec un 'Object.ToString' scellé n’est pas pris en charge dans C# {0}. Veuillez utiliser la version linguistique '{1}' ou version supérieure.
it: L'ereditarietà da un record con un 'Object.ToString' di tipo sealed non è supportata in C# {0}. Usare la versione '{1}' o successiva del linguaggio.
ja: シールされた ' Object. ToString ' を含むレコードからの継承は、C# {0} ではサポートされていません。' {1} ' 以上の言語バージョンを使用してください。
pl: Dziedziczenie z rekordu z zapieczętowanym obiektem "Object.ToString" nie jest obsługiwane w języku C# {0}. Użyj wersji języka "{1}" lub nowszej.
pt_br: Herdar de um registro com um 'Object.ToString' selado não é compatível com C# {0}. Use a versão do idioma '{1}' ou superior.
ru: Наследование от записи с запечатанным Object. ToString не поддерживается в C# {0}. Используйте версию языка "{1}" или более позднюю.
zh_hans: C# {0} 中不支持从包含密封 'Object.ToString' 的记录继承。请使用语言版本 '{1}’ 或更高版本。
zh_hant: C # {0} 不支援從具有密封的 'Object.ToString' 的記錄繼承。請使用 '{1}' 或更高的語言版本。

# ERR_InitCannotBeReadonly
source: 'init' accessors cannot be marked 'readonly'. Mark '{0}' readonly instead.
cs: Přístupové objekty init se nedají označit jako jen pro čtení. Místo toho označte jako jen pro čtení {0}.
fr: Les accesseurs 'init' ne peuvent pas être marqués 'readonly'. Marquez '{0}' readonly à la place.
it: Non è possibile contrassegnare le funzioni di accesso 'init' come 'readonly'. Contrassegnare '{0}' come readonly.
ja: 'init' アクセサーを 'readonly' としてマークできません。代わりに '{0}' を readonly としてマークします。
pl: Metody dostępu „init” nie można oznaczyć jako „tylko do odczytu”. Zamiast tego oznacz jako tylko do odczytu element „{0}”.
pt_br: Os acessadores 'init' não podem ser marcados como 'readonly'. Em vez disso, marque '{0}' como readonly.
ru: Методы доступа "init" не могут быть помечены как доступные только для чтения. Вместо них пометьте "{0}" как доступные только для чтения.
zh_hans: "init" 访问器不能标记为“只读”。请转而将“{0}”标记为“只读”。
zh_hant: 'init' 存取子不得標記為 'readonly'。改為將 '{0}' 標記為唯讀。

# ERR_InitInExtension
source: '{0}': cannot declare init-only accessors in an extension block
pt_br: "{0}": não é possível declarar acessadores somente inicialização em um bloco de extensão

# ERR_InlineArrayAttributeOnRecord
source: Attribute 'System.Runtime.CompilerServices.InlineArray' cannot be applied to a record struct.
fr: L’attribut « System.Runtime.CompilerServices.InlineArray » ne peut pas être appliqué à une struct d’enregistrement.
it: Impossibile applicare l'attributo 'System.Runtime.CompilerServices.InlineArray' a uno struct di record.
pl: Atrybut „System.Runtime.CompilerServices.InlineArray” nie może być zastosowany do struktury rekordu.
pt_br: O atributo "System.Runtime.CompilerServices.InlineArray" não pode ser aplicado a um struct de registro.
ru: Невозможно применить атрибут "System.Runtime.CompilerServices.InlineArray" к структуре записи.
zh_hans: 属性 "System.Runtime.CompilerServices.InlineArray" 无法应用于记录结构。
zh_hant: 屬性 'System.Runtime.CompilerServices.InlineArray' 無法套用至記錄結構。

# ERR_InlineArrayBadIndex
source: Elements of an inline array type can be accessed only with a single argument implicitly convertible to 'int', 'System.Index', or 'System.Range'.
fr: Les éléments d'un type de tableau en ligne ne sont accessibles qu'avec un seul argument implicitement convertible en 'int', 'System.Index' ou 'System.Range'.
it: È possibile accedere agli elementi di un tipo matrice inline solo con un singolo argomento convertibile in modo implicito in 'int', 'System.Index' o 'System.Range'.
ja: インライン配列型の要素にアクセスできるのは、暗黙的に 'int'、'System.Index'、または 'System.Range' に変換できる 1 つの引数を使用する場合のみです。
pl: Dostęp do elementów typu tablicy śródwierszowej można uzyskiwać tylko z pojedynczym argumentem, który można niejawnie przekonwertować na wartości „int”, „System.Index” lub „System.Range”.
pt_br: Os elementos de um tipo de matriz embutida podem ser acessados somente com um único argumento implicitamente conversível em 'int', 'System.Index' ou 'System.Range'.
ru: К элементам типа встроенного массива можно получить доступ только с одним аргументом, неявно преобразуемым в «int», «System.Index» или «System.Range».
zh_hans: 只能通过可隐式转换为 "int"、"System.Index" 或 "System.Range" 的单个参数访问内联数组类型的元素。
zh_hant: 內嵌陣列類型的元素只可以隱含方式轉換為 'int'、'System.Index' 或 'System.Range' 的單一引數來存取。

# ERR_InlineArrayConversionToReadOnlySpanNotSupported
source: Cannot convert expression to '{0}' because it may not be passed or returned by reference
fr: Impossible de convertir l'expression en '{0}' car elle ne peut pas être transmise ou renvoyée par référence
it: Non è possibile convertire l'espressione in '{0}' perché non può essere passata o restituita per riferimento
ja: 式は参照渡しによって渡したり返したりできないため、式を '{0}' に変換できません。
pl: Nie można przekonwertować wyrażenia na „{0}”, ponieważ może ono nie zostać przekazane lub zwrócone przez odwołanie
pt_br: Não é possível converter a expressão em '{0}' porque ela não pode ser passada ou retornada por referência
ru: Невозможно преобразовать выражение в ' {0} ', так как оно не может быть передано или возвращено по ссылке
zh_hans: 无法将表达式转换为“{0}”，因为可能无法通过引用传递或返回它
zh_hant: 無法將運算式轉換為 '{0}'，因為它可能不會按照參考傳遞或傳回

# ERR_InlineArrayConversionToSpanNotSupported
source: Cannot convert expression to '{0}' because it is not an assignable variable
fr: Impossible de convertir l'expression en '{0}' car il ne s'agit pas d'une variable attribuable
it: Non è possibile convertire l'espressione in '{0}' perché non è una variabile assegnabile
ja: 式は割り当て可能な変数ではないため、'{0}' に変換できません
pl: Nie można przekonwertować wyrażenia na „{0}”, ponieważ nie jest to zmienna możliwa do przypisania
pt_br: Não é possível converter a expressão em '{0}' porque ela não é uma variável atribuível
ru: Невозможно преобразовать выражение в ' {0} ', так как это не присваиваемая переменная
zh_hans: 无法将表达式转换为“{0}”，因为它不是可分配的变量
zh_hant: 無法將運算式轉換為 '{0}'，因為它不是可指派的變數

# ERR_InlineArrayForEachNotSupported
source: foreach statement on an inline array of type '{0}' is not supported
fr: l’instruction foreach sur un tableau inlined de type « {0} » n’est pas prise en charge
it: L'istruzione foreach in una matrice inline di tipo '{0}' non è supportata
ja: 型 '{0}' のインライン配列の foreach ステートメントはサポートされていません
pl: instrukcja foreach w tablicy wbudowanej typu „{0}” nie jest obsługiwana
pt_br: a instrução foreach em uma matriz em linha do tipo '{0}' não é compatível
ru: Оператор foreach во встроенном массиве типа "{0}" не поддерживается
zh_hans: 不支持类型为“{0}”的内联数组上的 foreach 语句
zh_hant: 不支援類型為 '{0}' 之內嵌陣列上的 foreach 陳述式

# ERR_InlineArrayIndexOutOfRange
source: Index is outside the bounds of the inline array
fr: L'index est en dehors des limites du tableau en ligne
it: L'indice non è compreso nei limiti della matrice inline
ja: インデックスがインライン配列の範囲外です
pl: Indeks znajduje się poza granicami tablicy śródwierszowej.
pt_br: O índice está fora dos limites do texto.
ru: Индекс находится за пределами встроенного массива
zh_hans: 索引超出了内联数组的界限
zh_hant: 索引超出內嵌陣列的界限。

# ERR_InlineArrayUnsupportedElementFieldModifier
source: Inline array element field cannot be declared as required, readonly, volatile, or as a fixed size buffer.
fr: Le champ d’élément de tableau inlined ne peut pas être déclaré comme obligatoire, en lecture seule, volatile ou en tant que mémoire tampon de taille fixe.
it: Il campo dell'elemento della matrice inline non può essere dichiarato come obbligatorio, di sola lettura, volatile o come buffer a dimensione fissa.
ja: インライン配列要素フィールドは、必須、読み取り専用、揮発性、または固定サイズ バッファーとして宣言できません。
pl: Pole elementu tablicy wbudowanej nie może być zadeklarowane jako wymagane, tylko do odczytu, nietrwałe ani jako bufor o stałym rozmiarze.
pt_br: O campo de elemento da matriz em linha não pode ser declarado como obrigatório, somente leitura, volátil ou como um buffer de tamanho fixo.
ru: Поле элемента встроенного массива нельзя объявить как обязательное, доступное только для чтения, переменное или как буфер фиксированного размера.
zh_hans: 不能将内联数组元素字段声明为必需、只读、可变或固定大小缓冲区。
zh_hant: 不可將內嵌陣列元素欄位宣告為必要、readonly、易變或為固定的大小緩衝區。

# ERR_InstanceMemberWithUnnamedExtensionsParameter
source: '{0}': cannot declare instance members in an extension block with an unnamed receiver parameter
pt_br: "{0}": não é possível declarar membros de instância em um bloco de extensão com um parâmetro de receptor sem nome

# ERR_InstanceOperatorExtensionWrongReceiverType
source: Cannot declare instance extension operator for a type that is not known to be a struct and is not known to be a class
pt_br: Não é possível declarar o operador de extensão de instância para um tipo que não é conhecido como um struct e não é conhecido por ser uma classe

# ERR_InstanceOperatorStructExtensionWrongReceiverRefKind
source: Cannot declare instance operator for a struct unless containing extension block receiver parameter is a 'ref' parameter
pt_br: Não é possível declarar o operador de instância para um struct, a menos que o parâmetro de receptor de bloco de extensão contenha um parâmetro "ref"

# ERR_InstancePropertyInitializerInInterface
source: Instance properties in interfaces cannot have initializers.
cs: Vlastnosti instance v rozhraních nemůžou mít inicializátory.
fr: Les propriétés d'instance dans les interfaces ne peuvent pas avoir d'initialiseurs.
it: Le proprietà di istanza nelle interfacce non possono avere inizializzatori.
ja: インターフェイス内のインスタンス プロパティは初期化子を持つことができません。
pl: Właściwości wystąpienia w interfejsach nie mogą mieć inicjatorów.
pt_br: As propriedades da instância nas interfaces não podem ter inicializadores.
ru: Свойства экземпляра в интерфейсах не могут иметь инициализаторы.
zh_hans: 接口中的实例属性不能具有初始值设定项。
zh_hant: 介面中的執行個體屬性不可有初始設定式。

# ERR_InterceptableMethodMustBeOrdinary
source: Cannot intercept '{0}' because it is not an invocation of an ordinary member method.
fr: Impossible d'intercepter « {0} » car il ne s'agit pas d'un appel d'une méthode membre ordinaire.
it: Non è possibile intercettare '{0}' perché non è una chiamata di un metodo membro normale.
ja: 通常のメンバー メソッドの呼び出しではないため、'{0}' をインターセプトできません。
pl: Nie można przechwycić „{0}”, ponieważ nie jest to wywołanie zwykłej metody składowej.
pt_br: Não é possível interceptar '{0}' porque não é uma invocação de um método de membro comum.
ru: Невозможно перехватить "{0}", так как это не вызов обычного метода элемента.
zh_hans: 无法拦截“{0}”，因为它不是对普通成员方法的调用。
zh_hant: 無法攔截 '{0}'，因為它不是一般成員方法的叫用。

# ERR_InterceptorArityNotCompatible
source: Method '{0}' must be non-generic or have arity {1} to match '{2}'.
fr: La méthode « {0} » doit être non générique ou avoir une arité {1} pour correspondre à « {2} ».
it: Il metodo '{0}' deve essere non generico o avere un grado {1} per trovare la corrispondenza con '{2}'.
ja: メソッド '{0}' は非ジェネリックであるか、'{2}' と一致するアリティ {1} を持っている必要があります。
pl: Metoda „{0}” musi być niegeneryczna lub mieć liczbę argumentów{1}, aby pasować do „{2}”.
pt_br: O método '{0}' deve ser não genérico ou ter aridade {1} para corresponder '{2}'.
ru: Метод "{0}" должен быть неуниверсальным или иметь арность {1} для соответствия "{2}".
zh_hans: 方法“{0}”必须是非泛型方法，或者具有匹配“{2}”的参数数量 {1}。
zh_hant: 方法 '{0}' 必須是非泛型或具有 arity {1}，才能符合 '{2}'。

# ERR_InterceptorCannotBeGeneric
source: Method '{0}' must be non-generic to match '{1}'.
fr: La méthode « {0} » doit être non générique pour correspondre à « {1} ».
it: Il metodo '{0}' deve essere non generico per corrispondere a '{1}'.
ja: '{1}' に一致するには、メソッド '{0}' は非ジェネリックである必要があります。
pl: Metoda „{0}” nie może być ogólna, aby była zgodna z elementem „{1}”.
pt_br: O método “{0}” deve ser não genérico para corresponder a “{1}”.
ru: Метод "{0}" должен быть неуниверсальным, чтобы соответствовать "{1}".
zh_hans: 方法“{0}”必须是非泛型方法才能与“{1}”匹配。
zh_hant: 方法 '{0}' 必須是非泛型，才能符合 '{1}'。

# ERR_InterceptorCannotInterceptNameof
source: A nameof operator cannot be intercepted.
fr: Un opérateur nameof ne peut pas être intercepté.
it: Impossibile intercettare un operatore nameof.
ja: nameof 演算子はインターセプトできません。
pl: Nie można przechwycić operatora nameof.
pt_br: Um operador nameof não pode ser interceptado.
ru: Имя оператора не может быть перехвачено.
zh_hans: 无法截获 nameof 运算符。
zh_hant: 無法攔截 nameof 運算子。

# ERR_InterceptorCannotUseUnmanagedCallersOnly
source: An interceptor cannot be marked with 'UnmanagedCallersOnlyAttribute'.
fr: Un intercepteur ne peut pas être marqué avec 'UnmanagedCallersOnlyAttribute'.
it: Un intercettore non può essere contrassegnato con 'UnmanagedCallersOnlyAttribute'.
ja: インターセプターに 'UnmanagedCallersOnlyAttribute' を設定することはできません。
pl: Nie można oznaczyć interceptora atrybutem „UnmanagedCallersOnlyAttribute”.
pt_br: Um interceptador não pode ser marcado com 'UnmanagedCallersOnlyAttribute'.
ru: Перехватчик не может быть помечен атрибутом UnmanagedCallersOnlyAttribute.
zh_hans: 侦听器不能用 "UnmanagedCallersOnlyAttribute" 标记。
zh_hant: 攔截器不能以 'UnmanagedCallersOnlyAttribute' 標示。

# ERR_InterceptorCharacterOutOfRange
source: The given line is '{0}' characters long, which is fewer than the provided character number '{1}'.
fr: La ligne donnée contient '{0}' caractères, ce qui est inférieur au nombre de caractères fourni '{1}'.
it: La riga specificata è di '{0}' caratteri, che è inferiore al numero di caratteri specificato '{1}'.
ja: 与えられた行の長さは '{0}' 文字で、指定された文字数 '{1}' に達していません。
pl: Podany wiersz ma długość składającą się z „{0}” znaków, czyli mniej niż podana liczba znaków „{1}”.
pt_br: A linha fornecida tem '{0}' caracteres, que é menor do que o número de caracteres fornecido '{1}'.
ru: Данная строка имеет длину ' {0} ' символов, что меньше предоставленного количества символов ' {1} '.
zh_hans: 给定的行有 {0} 个字符，这"this" 参数提供的字符数“{1}”。
zh_hant: 指定的行字元長度為 '{0}'，少於提供的字元數 '{1}'。

# ERR_InterceptorContainingTypeCannotBeGeneric
source: Method '{0}' cannot be used as an interceptor because its containing type has type parameters.
fr: La méthode « {0} » ne peut pas être utilisée comme intercepteur car elle ou son type contenant a des paramètres de type.
it: Non è possibile usare il metodo '{0}' come intercettore perché il tipo contenitore include parametri di tipo.
pl: Metoda „{0}” nie może być używana jako metoda interceptora, ponieważ jej typ zawierający ma parametry typu.
pt_br: O método '{0}' não pode ser usado como interceptor porque o tipo que o contém tem parâmetros de tipo.
ru: Метод "{0}" нельзя использовать в качестве перехватчика, так как его содержащий тип имеет параметры типа.
zh_hans: 方法“{0}”不能用作侦听器，因为其包含类型具有类型参数。
zh_hant: 方法 '{0}' 無法作為攔截器，因為其包含類型具有類型參數。

# ERR_InterceptorFilePathCannotBeNull
source: Interceptor cannot have a 'null' file path.
fr: Interceptor ne peut pas avoir de chemin de fichier "null".
it: L'intercettore non può avere un percorso di file 'null'.
ja: インターセプターに 'null' ファイル パスを指定することはできません。
pl: Interceptor nie może mieć ścieżki pliku o wartości „null”.
pt_br: O interceptador não pode ter um caminho de arquivo 'null'.
ru: Перехватчик не может иметь «нулевой» путь к файлу.
zh_hans: 侦听器不能具有 "null" 文件路径。
zh_hant: 攔截器不能有 'null' 檔案路徑。

# ERR_InterceptorGlobalNamespace
source: An interceptor cannot be declared in the global namespace.
fr: Un intercepteur ne peut pas être déclaré dans l'espace de noms global.
it: Non è possibile dichiarare un intercettore nello spazio dei nomi globale.
ja: グローバル名前空間でインターセプターを宣言することはできません。
pl: Nie można zadeklarować interceptora w globalnej przestrzeni nazw.
pt_br: Um interceptor não pode ser declarado no namespace global.
ru: Перехватчик невозможно объявить в глобальном пространстве имен.
zh_hans: 无法在全局命名空间中声明拦截器。
zh_hant: 無法在全域命名空間中宣告攔截器。
