Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadEventUsageNoField
source: The event '{0}' can only appear on the left hand side of += or -=
cs: Událost {0} se může zobrazovat jenom na levé straně výrazu += nebo -=.
de: Das {0}-Ereignis kann nur links von += oder -= verwendet werden.
es: El evento '{0}' solo puede aparecer a la izquierda de += o -=.
fr: L'événement '{0}' ne peut apparaître qu'à gauche de += ou -=
it: L'evento '{0}' può essere specificato solo sul lato sinistro di += o di -=
ja: イベント '{0}' は += または -= の左側にのみ使用できます
ko: {0}' 이벤트는 += 또는 -=의 왼쪽에만 올 수 있습니다.
pl: Zdarzenie „{0}” może pojawić się tylko po lewej stronie wyrażenia += lub -=.
pt_br: O evento "{0}" só pode aparecer no lado esquerdo de += ou -=
ru: Событие "{0}" может находиться только в левой части операции += или -=
tr: {0}' olayı += veya -= işaretlerinin yalnızca sol tarafında görünebilir
zh_hans: 事件“{0}”只能出现在 += 或 -= 的左边
zh_hant: 事件 '{0}' 只可出現在 += 或 -= 的左側

# ERR_ConstraintOnlyAllowedOnGenericDecl
source: Constraints are not allowed on non-generic declarations
cs: U neobecných deklarací nejsou povolená omezení.
de: Einschränkungen sind für nicht generische Deklarationen nicht zulässig.
es: No se permiten restricciones en declaraciones no genéricas
fr: Les contraintes ne sont pas autorisées sur des déclarations non génériques
it: Vincoli non consentiti su dichiarazioni non generiche
ja: 制約は非ジェネリック宣言では許可されません
ko: 제네릭이 아닌 선언에는 제약 조건을 사용할 수 없습니다.
pl: Ograniczenia są niedozwolone w deklaracjach innych niż ogólne
pt_br: Não são permitidas restrições em declarações não genéricas
ru: Ограничения не разрешены в объявлениях, не являющихся универсальными.
tr: Genel olmayan bildirimlerde kısıtlama kullanılamaz
zh_hans: 在非泛型声明上不允许使用约束
zh_hant: 非泛型宣告中不可使用條件約束

# ERR_TypeParamMustBeIdentifier
source: Type parameter declaration must be an identifier not a type
cs: Deklarace parametru typů musí být identifikátor, ne typ.
de: Eine Typparameterdeklaration muss ein Bezeichner sein, kein Typ.
es: La declaración de parámetros de tipo debe ser un identificador, no un tipo
fr: La déclaration du paramètre de type doit être un identificateur et non un type
it: La dichiarazione del parametro di tipo deve essere un identificatore anziché un tipo
ja: 型パラメーターの宣言は型ではなく識別子でなければなりません
ko: 형식 매개 변수 선언은 형식이 아니라 식별자여야 합니다.
pl: Deklaracja parametru typu musi być identyfikatorem, a nie typem
pt_br: A declaração de parâmetro de tipo deve ser um identificador, e não um tipo
ru: Объявление параметра-типа должно быть идентификатором, а не типом.
tr: Tür parametresi bildirimi bir tür değil bir tanımlayıcı olmalıdır
zh_hans: 类型形参声明必须是标识符，不能是类型
zh_hant: 類型參數宣告必須是識別項，而非類型

# ERR_MemberReserved
source: Type '{1}' already reserves a member called '{0}' with the same parameter types
cs: Typ {1} už rezervuje člen s názvem {0} se stejnými typy parametrů.
de: Der Typ "{1}" reserviert bereits einen Member namens "{0}" mit den gleichen Parametertypen.
es: El tipo '{1}' reserva ya un miembro denominado '{0}' con los mismos tipos de parámetro
fr: Le type '{1}' réserve déjà un membre appelé '{0}' avec les mêmes types de paramètre
it: Il tipo '{1}' riserva già un membro denominato '{0}' con gli stessi tipi di parametro
ja: 型 '{1}' は、'{0}' と呼ばれるメンバーを同じパラメーターの型で既に予約しています
ko: {1}' 형식에서 매개 변수 형식이 같은 '{0}' 멤버를 이미 예약했습니다.
pl: Typ „{1}” już rezerwuje składową o nazwie „{0}” z tymi samymi typami parametrów
pt_br: Tipo "{1}" já reserva um membro chamado "{0}" com os mesmos tipos de parâmetro
ru: Тип "{1}" уже резервирует член "{0}" с такими же типами параметров.
tr: {1}' türü aynı parametre türlerine sahip '{0}' adlı bir üyeyi zaten ayırıyor
zh_hans: 类型“{1}”已保留了一个名为“{0}”的具有相同参数类型的成员
zh_hant: 類型 '{1}' 已保留了一個具有相同參數類型且名為 '{0}' 的成員

# ERR_DuplicateParamName
source: The parameter name '{0}' is a duplicate
cs: Název parametru {0} je duplicitní.
de: Der Parametername "{0}" ist ein Duplikat.
es: El nombre de parámetro '{0}' está duplicado
fr: Le nom de paramètre '{0}' est un doublon
it: Il nome di parametro '{0}' è un duplicato
ja: パラメーター名 '{0}' が重複しています
ko: {0}' 매개 변수 이름이 중복되었습니다.
pl: Nazwa parametru „{0}” jest duplikatem
pt_br: O nome do parâmetro "{0}" é uma duplicata
ru: Повторяющееся имя параметра "{0}".
tr: {0}' parametre adı bir yinelenen
zh_hans: 参数名“{0}”重复
zh_hant: 參數名稱 '{0}' 重複

# ERR_DuplicateNameInNS
source: The namespace '{1}' already contains a definition for '{0}'
cs: Obor názvů {1} už obsahuje definici pro {0}.
de: Der Namespace "{1}" enthält bereits eine Definition für "{0}".
es: El espacio de nombres '{1}' ya contiene una definición para '{0}'
fr: L'espace de noms '{1}' contient déjà une définition pour '{0}'
it: Lo spazio dei nomi '{1}' contiene già una definizione per '{0}'
ja: 名前空間 '{1}' は既に '{0}' の定義を含んでいます
ko: {0}' 네임스페이스에 이미 '{1}'에 대한 정의가 포함되어 있습니다.
pl: Przestrzeń nazw „{0}” już zawiera definicję dla „{1}”
pt_br: O namespace "{1}" já contém uma definição para "{0}"
ru: Пространство имен "{1}" уже содержит определение для "{0}".
tr: {1}' ad alanı '{0}' için zaten bir tanım içeriyor
zh_hans: 命名空间“{1}”已经包含“{0}”的定义
zh_hant: 命名空間 '{1}' 已包含 '{0}' 的定義

# ERR_DuplicateNameInClass
source: The type '{0}' already contains a definition for '{1}'
cs: Typ {0} už obsahuje definici pro {1}.
de: Der Typ "{0}" enthält bereits eine Definition für "{1}".
es: El tipo '{0}' ya contiene una definición para '{1}'
fr: Le type '{0}' contient déjà une définition pour '{1}'
it: Il tipo '{0}' contiene già una definizione per '{1}'
ja: 型 '{0}' は既に '{1}' の定義を含んでいます
ko: {0}' 형식에 이미 '{1}'에 대한 정의가 포함되어 있습니다.
pl: Typ „{0}” już zawiera definicję dla „{1}”
pt_br: O tipo "{0}" já contém uma definição para "{1}"
ru: Тип "{0}" уже содержит определение для "{1}".
tr: {0}' türü '{1}' için zaten bir tanım içeriyor
zh_hans: 类型“{0}”已经包含“{1}”的定义
zh_hant: 類型 '{0}' 已包含 '{1}' 的定義

# ERR_NameNotInContext
source: The name '{0}' does not exist in the current context
cs: Název {0} v aktuálním kontextu neexistuje.
de: Der Name "{0}" ist im aktuellen Kontext nicht vorhanden.
es: El nombre '{0}' no existe en el contexto actual
fr: Le nom '{0}' n'existe pas dans le contexte actuel
it: Il nome '{0}' non esiste nel contesto corrente
ja: 現在のコンテキストに '{0}' という名前は存在しません
ko: {0}' 이름이 현재 컨텍스트에 없습니다.
pl: Nazwa „{0}” nie istnieje w bieżącym kontekście
pt_br: O nome "{0}" não existe no contexto atual
ru: Имя "{0}" не существует в текущем контексте.
tr: {0}' adı geçerli bağlamda yok
zh_hans: 当前上下文中不存在名称“{0}”
zh_hant: 名稱 '{0}' 不存在於目前的內容中

# ERR_NameNotInContextPossibleMissingReference
source: The name '{0}' does not exist in the current context (are you missing a reference to assembly '{1}'?)
cs: Název {0} v aktuálním kontextu neexistuje. (Nechybí odkaz na sestavení {1}?)
de: Der Name "{0}" ist im aktuellen Kontext nicht vorhanden. (Möglicherweise fehlt ein Verweis auf Assembly "{1}".)
es: El nombre '{0}' no existe en el contexto actual (¿falta alguna referencia al ensamblado '{1}'?)
fr: Le nom '{0}' n'existe pas dans le contexte actuel (vous manque-t-il une référence à l'assembly '{1}' ?)
it: Il nome '{0}' non esiste nel contesto corrente. Probabilmente manca un riferimento all'assembly '{1}'.
ja: 現在のコンテキストに '{0}' という名前は存在しません (アセンブリ '{1}' に対する参照が指定されていることを確認してください)
ko: {0}' 이름이 현재 컨텍스트에 없습니다. '{1}' 어셈블리에 참조가 있는지 확인하세요.
pl: Nazwa „{0}” nie istnieje w bieżącym kontekście (brak odwołania do zestawu „{1}”?)
pt_br: O nome "{0}" não existe no contexto atual (está sem uma referência para o assembly "{1}"?)
ru: Имя "{0}" не существует в текущем контексте (возможно, отсутствует ссылка на сборку "{1}"?)
tr: {0}' adı geçerli bağlamda yok ('{1}' derlemesine başvurunuz mu eksik?)
zh_hans: 当前上下文中不存在名称“{0}”(是否缺少对程序集“{1}”的引用?)
zh_hant: 名稱 '{0}' 不存在於目前的內容中 (是否遺漏了組件 '{1}' 的參考?)

# ERR_AmbigContext
source: '{0}' is an ambiguous reference between '{1}' and '{2}'
cs: {0} je nejednoznačný odkaz mezi {1} a {2}.
de: '"{0}" ist ein mehrdeutiger Verweis zwischen "{1}" und "{2}".
es: '{0}' es una referencia ambigua entre '{1}' y '{2}'
fr: '{0}' est une référence ambiguë entre '{1}' et '{2}'
it: '{0}' è un riferimento ambiguo tra '{1}' e '{2}'
ja: '{0}' は、'{1}' と '{2}' 間のあいまいな参照です
ko: '{0}'은(는) '{1}' 및 '{2}' 사이에 모호한 참조입니다.
pl: 'Element „{0}” to niejednoznaczne odwołanie między elementem „{1}” i „{2}”
pt_br: "{0}" é uma referência ambígua entre "{1}" e "{2}"
ru: "{0}" является неоднозначной ссылкой между "{1}" и "{2}".
tr: '{0}', '{1}' ile '{2}' arasında belirsiz bir başvuru
zh_hans: “{0}”是“{1}”和“{2}”之间的不明确的引用
zh_hant: '{0}' 是 '{1}' 與 '{2}' 之間模稜兩可的參考

# WRN_DuplicateUsing
source: The using directive for '{0}' appeared previously in this namespace
cs: Direktiva using pro {0} se objevila už dřív v tomto oboru názvů.
de: Die using-Direktive für "{0}" ist bereits vorher in diesem Namespace aufgetreten.
es: La directiva using para '{0}' aparece previamente en este espacio de nombres
fr: La directive using de '{0}' est apparue précédemment dans cet espace de noms
it: La direttiva using per '{0}' è già presente in questo spazio dei nomi
ja: '{0}' の using ディレクティブは、この名前空間で既に使用されています
ko: {0}'에 대한 using 지시문을 이 네임스페이스에서 이전에 사용했습니다.
pl: Dyrektywa using dla elementu „{0}” już wystąpiła w tej przestrzeni nazw
pt_br: A diretiva using para "{0}" apareceu anteriormente neste namespace
ru: Директива using для "{0}" ранее встречалась в этом пространстве имен
tr: {0}' için using yönergesi bu ad alanında daha önce göründü
zh_hans: “{0}”的 using 指令以前在此命名空间中出现过
zh_hant: '{0}' 的 using 指示詞之前曾出現於此命名空間中

# WRN_DuplicateUsing_Title
source: Using directive appeared previously in this namespace
cs: Direktiva Using se už v tomto oboru názvů objevila dříve.
de: Direktive wird verwendet, die zuvor in diesem Namespace angezeigt wurde
es: La directiva using apareció anteriormente en este espacio de nombre
fr: La directive using est apparue précédemment dans cet espace de noms
it: La direttiva using è già presente in questo spazio dei nomi
ja: 使用中のディレクティブは、以前この名前空間に使用されています
ko: using 지시문을 이전에 이 네임스페이스에서 사용했습니다.
pl: Dyrektywa using występowała wcześniej w tej przestrzeni nazw
pt_br: Usando diretiva exibida anteriormente neste namespace
ru: Директива Using уже использовалась в этом пространстве имен
tr: Bu ad alanında daha önce görünen yönerge kullanılıyor
zh_hans: using 指令以前在此命名空间中出现过
zh_hant: Using 指示詞先前出現在此命名空間中

# ERR_BadMemberFlag
source: The modifier '{0}' is not valid for this item
cs: Modifikátor {0} není pro tuto položku platný.
de: Der "{0}"-Modifizierer ist für dieses Element nicht gültig.
es: El modificador '{0}' no es válido para este elemento
fr: Le modificateur '{0}' 'n'est pas valide pour cet élément
it: Il modificatore '{0}' non è valido per questo elemento
ja: 修飾子 '{0}' がこの項目に対して有効ではありません
ko: 이 항목의 '{0}' 한정자가 유효하지 않습니다.
pl: Modyfikator „{0}” jest nieprawidłowy dla tego elementu
pt_br: O modificador "{0}" não é válido para este item
ru: Модификатор "{0}" недопустим для этого элемента.
tr: {0}' değiştiricisi bu öğe için geçerli değil
zh_hans: 修饰符“{0}”对该项无效
zh_hant: 修飾元 '{0}' 對此項目無效

# ERR_BadMemberProtection
source: More than one protection modifier
cs: Víc než jeden modifikátor ochrany
de: Mehr als ein Schutzmodifizierer.
es: Hay más de un modificador de protección
fr: Présence de plusieurs modificateurs de protection
it: Sono presenti più modificatori di protezione
ja: 複数の保護修飾子があります
ko: 보호 한정자가 두 개 이상 있습니다.
pl: Więcej niż jeden modyfikator ochrony
pt_br: Mais de um modificador de proteção
ru: Несколько модификаторов защиты.
tr: Birden çok koruma değiştiricisi
zh_hans: 多个保护修饰符
zh_hant: 有一個以上的保護修飾元

# WRN_NewRequired
source: '{0}' hides inherited member '{1}'. Use the new keyword if hiding was intended.
cs: {0} skryje zděděný člen {1}. Pokud je skrytí úmyslné, použijte klíčové slovo new.
de: '"{0}" blendet den vererbten Member "{1}" aus. Verwenden Sie das new-Schlüsselwort, wenn das Ausblenden vorgesehen war.
es: '{0}' oculta el miembro heredado '{1}'. Use la palabra clave new si su intención era ocultarlo.
fr: '{0}' masque le membre hérité '{1}'. Utilisez le mot clé new si le masquage est intentionnel.
it: '{0}' nasconde il membro ereditato '{1}'. Se questo comportamento è intenzionale, usare la parola chiave new.
ja: '{0}' は継承されたメンバー '{1}' を非表示にします。非表示にする場合は、キーワード new を使用してください。
ko: '{0}'은(는) 상속된 '{1}' 멤버를 숨깁니다. 숨기려면 new 키워드를 사용하세요.
pl: 'Element „{0}” ukrywa odziedziczoną składową „{1}”. Użyj słowa kluczowego new, jeśli ukrycie jest zamierzone.
pt_br: "{0}" oculta o membro herdado "{1}". Use a nova palavra-chave se foi pretendido ocultar.
ru: "{0}" скрывает наследуемый член "{1}". Если скрытие было намеренным, используйте ключевое слово new.
tr: '{0}', '{1}' devralınan üyesini gizler. Gizleme isteniyorsa yeni anahtar sözcük kullanın.
zh_hans: “{0}”隐藏继承的成员“{1}”。如果是有意隐藏，请使用关键字 new。
zh_hant: '{0}' 會隱藏繼承的成員 '{1}'。若本意即為要隱藏，請使用 new 關鍵字。

# WRN_NewRequired_Title
source: Member hides inherited member; missing new keyword
cs: Člen skrývá zděděný člen. Chybí klíčové slovo new.
de: Element blendet vererbte Element aus; fehlendes 'new'-Schlüsselwort
es: El miembro oculta el miembro heredado. Falta una contraseña nueva
fr: Un membre masque un membre hérité ; le mot clé new est manquant
it: Il membro nasconde il membro ereditato. Manca la parola chiave new
ja: メンバーは継承されたメンバーを非表示にします。キーワード new がありません
ko: 멤버가 상속된 멤버를 숨깁니다. new 키워드가 없습니다.
pl: Składowa ukrywa dziedziczoną składową; brak słowa kluczowego new
pt_br: O membro oculta o membro herdado; nova palavra-chave ausente
ru: Член скрывает унаследованный член: отсутствует новое ключевое слово
tr: Üye devralınmış üyeyi gizler; yeni anahtar sözcük eksik
zh_hans: 成员隐藏继承的成员；缺少关键字 new
zh_hant: 成員隱藏所繼承的成員; 遺漏 new 關鍵字

# WRN_NewRequired_Description
source: A variable was declared with the same name as a variable in a base type. However, the new keyword was not used. This warning informs you that you should use new; the variable is declared as if new had been used in the declaration.
cs: Proměnná se deklarovala se stejným názvem jako proměnná v základním typu. Klíčové slovo new se ale nepoužilo. Toto varování vás informuje, že byste měli použít new; proměnná je deklarovaná, jako by se v deklaraci používalo new.
fr: Une variable a été déclarée avec le même nom qu'une variable dans le type de base. Cependant, le mot clé new n'a pas été utilisé. Cet avertissement vous informe que vous devez utiliser new ; la variable est déclarée comme si new avait été utilisé dans la déclaration.
it: È stata dichiarata una variabile con lo stesso nome di una variabile in un tipo di base, tuttavia non è stata usata la parola chiave new. Questo avviso informa l'utente che è necessario usare new. La variabile viene dichiarata come se nella dichiarazione fosse stata usata la parola chiave new.
ja: 基本データ型の変数と同じ名前で宣言された変数がありましたが、キーワード new は使用されませんでした。この警告は、new を使用する必要があることを通知するものです。変数は、あたかも宣言で new が使用されたかのように宣言されます。
pl: Zmienna została zadeklarowana przy użyciu tej samej nazwy co zmienna w typie bazowym. Jednak nie użyto słowa kluczowego new. To ostrzeżenie informuje o konieczności użycia słowa kluczowego new. Zmienna została zadeklarowana tak, jakby użyto słowa kluczowego new w deklaracji.
pt_br: Uma variável foi declarada com o mesmo nome que uma variável no tipo base. No entanto, a palavra-chave new não foi usada. Este aviso informa que você deve usar new. A variável foi declarada como se new tivesse sido usada na declaração.
ru: Переменная объявлена с тем же именем, что и переменная в базовом типе, однако, не было использовано ключевое слово new. Это предупреждение сообщает о том, что следует использовать ключевое слово new: переменная объявлена так, как если бы в объявлении использовалось ключевое слово new.
zh_hans: 使用与基类型中的变量相同的名称声明了变量。但是，未使用关键字 new。此警告通知应使用 new；变量如同在声明中使用了 new 一样进行声明。
zh_hant: 宣告的變數名稱與基底類型中的變數相同，但未使用 new 關鍵字。此警告是為了通知您應使用 new; 宣告變數的方式就如同宣告中使用了 new。

# WRN_NewNotRequired
source: The member '{0}' does not hide an accessible member. The new keyword is not required.
cs: Člen {0} neskrývá přístupný člen. Klíčové slovo new se nevyžaduje.
de: Das Mitglied "{0}" blendet kein verfügbares Mitglied aus. Das neue Schlüsselwort ist nicht erforderlich.
es: El miembro '{0}' no oculta un miembro accesible. La palabra clave new no es necesaria.
fr: Le membre '{0}' ne masque pas de membre accessible. Le mot clé new n'est pas nécessaire.
it: Il membro '{0}' non nasconde un membro accessibile. La parola chiave new non è obbligatoria.
ja: メンバー '{0}' はアクセス可能なメンバーを非表示にしません。新しいキーワードは不要です。
ko: {0}' 멤버는 액세스 가능한 멤버를 숨기지 않으므로 new 키워드가 필요하지 않습니다.
pl: Składowa „{0}” nie ukrywa składowej z możliwością dostępu. Słowo kluczowe new nie jest wymagane.
pt_br: O membro "{0}" não oculta um membro acessível. A palavra-chave new não é necessária.
ru: Член "{0}" не скрывает доступный член. Ключевое слово new не требуется.
tr: {0}' üyesi, erişilebilir bir üyeyi gizlemez. Yeni anahtar sözcük gerekli değil.
zh_hans: 成员“{0}”不会隐藏可访问成员。不需要关键字 new。
zh_hant: 成員 '{0}' 並未隱藏可存取的成員。不需要 new 關鍵字。

# WRN_NewNotRequired_Title
source: Member does not hide an inherited member; new keyword is not required
cs: Člen neskrývá zděděný člen. Klíčové slovo new se nevyžaduje.
de: Element blendet kein vererbtes Element aus; neues Schlüsselwort erforderlich
es: El miembro no oculta un miembro heredado. No se necesita una nueva palabra clave
fr: Un membre ne masque pas un membre hérité ; le mot clé new n'est pas requis
it: Il membro non nasconde un membro ereditato. La parola chiave new non è obbligatoria
ja: メンバーは継承されたメンバーを非表示にしません。new キーワードは不要です
ko: 멤버는 상속된 멤버를 숨기지 않으므로 new 키워드가 필요하지 않습니다.
pl: Składowa nie ukrywa dziedziczonej składowej; słowo kluczowe new nie jest wymagane
pt_br: O membro não oculta um membro herdado; não é necessária uma nova palavra-chave
ru: Член не скрывает унаследованный член: новое ключевое слово не требуется
tr: Üye devralınan üyeyi gizlemez; yeni anahtar sözcük gerekli değil
zh_hans: 成员不会隐藏继承的成员；不需要关键字 new
zh_hant: 成員未隱藏所繼承的成員; 不需要 new 關鍵字

# ERR_CircConstValue
source: The evaluation of the constant value for '{0}' involves a circular definition
cs: Vyhodnocení konstantní hodnoty pro {0} zahrnuje cyklickou definici.
de: Die Auswertung des Konstantenwerts für "{0}" bezieht eine zirkuläre Definition ein.
es: La evaluación del valor constante de '{0}' comprende una definición circular
fr: L'évaluation de la valeur de constante de '{0}' implique une définition circulaire
it: La valutazione del valore della costante per '{0}' implica una definizione circolare
ja: '{0}' の定数値の評価により、循環定義が発生します
ko: {0}'에 대한 상수 값 계산에 순환 정의가 포함되어 있습니다.
pl: Obliczanie wartości stałej dla elementu „{0}” obejmuje definicję cykliczną
pt_br: A avaliação do valor de constante para "{0}" envolve uma definição circular
ru: При оценке постоянного значения для "{0}" используется циклическое определение.
tr: {0}' için sabit değerin değerlendirilmesi döngüsel başvuru içeriyor
zh_hans: “{0}”的常量值计算涉及循环定义
zh_hant: '{0}' 常數值的運算發生循環定義

# ERR_MemberAlreadyExists
source: Type '{1}' already defines a member called '{0}' with the same parameter types
cs: Typ {1} už definuje člen s názvem {0} se stejnými typy parametrů.
de: Der Typ "{1}" definiert bereits einen Member namens "{0}" mit den gleichen Parametertypen.
es: El tipo '{1}' ya define un miembro denominado '{0}' con los mismos tipos de parámetro
fr: Le type '{1}' définit déjà un membre appelé '{0}' avec les mêmes types de paramètre
it: Il tipo '{1}' definisce già un membro denominato '{0}' con gli stessi tipi di parametro
ja: 型 '{1}' は、'{0}' と呼ばれるメンバーを同じパラメーターの型で既に定義しています
ko: {1}' 형식은 동일한 매개 변수 형식을 가진 '{0}' 멤버를 미리 정의합니다.
pl: Typ „{1}” już definiuje składową o nazwie „{0}” z tymi samymi typami parametrów
pt_br: Tipo "{1}" já define um membro chamado "{0}" com os mesmos tipos de parâmetro
ru: Тип "{1}" уже определяет член "{0}" с такими же типами параметров.
tr: {1}' türü aynı parametre türleriyle '{0}' adlı bir üyeyi zaten tanımlıyor
zh_hans: 类型“{1}”已定义了一个名为“{0}”的具有相同参数类型的成员
zh_hant: 類型 '{1}' 已定義了一個具有相同參數類型且名為 '{0}' 的成員

# ERR_StaticNotVirtual
source: A static member cannot be marked as '{0}'
cs: Statický člen není možné označit jako{0}
fr: Un membre statique ne peut pas être marqué comme « {0} »
it: Un membro statico non può essere contrassegnato come '{0}'
ja: 静的なメンバーを '{0}' とマークすることはできません。
pl: Składowa statyczna nie może być oznaczona jako „{0}”
pt_br: Um membro estático não pode ser marcado como '{0}'
ru: Статический элемент не может быть помечен как "{0}"
zh_hans: 静态成员不能标记为“{0}”
zh_hant: 靜態成員不能標記為 '{0}'

# ERR_OverrideNotNew
source: A member '{0}' marked as override cannot be marked as new or virtual
cs: Člen {0} označený jako override nejde označit jako new nebo virtual.
de: Ein Member "{0}", der als "override" markiert ist, kann nicht als "new" oder "virtual" markiert werden.
es: Un miembro '{0}' marcado como override no se puede marcar como new o virtual
fr: Un membre '{0}' marqué comme override ne peut pas être marqué comme new ou virtual
it: Un membro '{0}' contrassegnato come override non può essere contrassegnato come new o virtual
ja: override 型のメンバー '{0}' を、new または virtual にすることはできません
ko: override로 표시된 '{0}' 멤버는 new 또는 virtual로 표시할 수 없습니다.
pl: Dla składowej „{0}” ze specyfikatorem override nie można określić specyfikatora new ani virtual
pt_br: Um membro "{0}" marcado como override não pode ser marcado como new ou virtual
ru: Член "{0}", помеченный как override, не может быть помечен как new или virtual.
tr: Geçersiz kılma olarak işaretlenmiş bir '{0}' üyesi yeni veya sanal olarak işaretlenemiyor
zh_hans: 标记为 override 的成员“{0}”不能标记为 new 或 virtual
zh_hant: 標記為 override 的成員 '{0}'，不可標記為 new 或 virtual

# WRN_NewOrOverrideExpected
source: '{0}' hides inherited member '{1}'. To make the current member override that implementation, add the override keyword. Otherwise add the new keyword.
cs: 'Člen {0} skryje zděděný člen {1}. Pokud má aktuální člen tuto implementaci přepsat, přidejte klíčové slovo override. Jinak přidejte klíčové slovo new.
de: '"{0}" blendet den vererbten Member "{1}" aus. Damit der aktuelle Member diese Implementierung überschreibt, fügen Sie das override-Schlüsselwort hinzu. Ansonsten fügen Sie das new-Schlüsselwort hinzu.
es: '{0}' oculta el miembro heredado '{1}'. Para hacer que el miembro actual invalide esa implementación, agregue la palabra clave override. Si no, agregue la palabra clave new.
fr: '{0}' masque le membre hérité '{1}'. Pour que le membre actif se substitue à cette implémentation, ajoutez le mot clé override. Sinon, ajoutez le mot clé new.
it: '{0}' nasconde il membro ereditato '{1}'. Per consentire al membro corrente di eseguire l'override di tale implementazione, aggiungere la parola chiave override; altrimenti aggiungere la parola chiave new.
ja: '{0}' は継承されたメンバー '{1}' を非表示にします。現在のメンバーでその実装をオーバーライドするには、override キーワードを追加してください。オーバーライドしない場合は、new キーワードを追加してください。
ko: '{0}'은(는) 상속된 '{1}' 멤버를 숨깁니다. 현재 멤버가 해당 구현을 재정의하도록 하려면 override 키워드를 추가하세요. 그렇지 않으면 new 키워드를 추가하세요.
pl: 'Element „{0}” ukrywa odziedziczoną składową „{1}”. Aby przesłonić tę implementację bieżącą składową, dodaj słowo kluczowe override. W przeciwnym razie dodaj słowo kluczowe new.
pt_br: "{0}" oculta o membro herdado "{1}". Para que o membro atual substitua essa implementação, adicione a palavra-chave override. Caso contrário, adicione a palavra-chave new.
ru: "{0}" скрывает наследуемый член "{1}". Чтобы текущий член переопределял эту реализацию, добавьте ключевое слово override. В противном случае добавьте ключевое слово new.
tr: '{0}' devralınmış '{1}' üyesini gizliyor. Geçerli üyenin bu uygulamayı geçersiz kılması için override anahtar sözcüğünü ekleyin. Aksi takdirde new anahtar sözcüğünü ekleyin.
zh_hans: “{0}”隐藏继承的成员“{1}”。若要使当前成员重写该实现，请添加关键字 override。否则，添加关键字 new。
zh_hant: '{0}' 會隱藏繼承的成員 '{1}'。若要讓目前的成員覆寫該實作，請加入 override 關鍵字; 否則請加入 new 關鍵字。
