Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_DefaultInterfaceImplementation
source: default interface implementation
cs: implementace výchozího rozhraní
de: Standardschnittstellenimplementierung
es: implementación de interfaz predeterminada
fr: implémentation d'interface par défaut
it: implementazione di interfaccia predefinita
ja: 既定のインターフェイスの実装
ko: 기본 인터페이스 구현
pl: domyślna implementacja interfejsu
pt_br: implementação de interface padrão
ru: реализация интерфейса по умолчанию
tr: varsayılan arabirim uygulaması
zh_hans: 默认接口实现
zh_hant: 預設介面實作

# IDS_Disposable
source: disposable
cs: jednoúčelové
de: Verwerfbar
es: descartable
fr: supprimable(s)
ja: 破棄可能
ko: 삭제 가능
pl: możliwy do likwidacji
pt_br: descartável
ru: высвобождаемый
tr: atılabilir
zh_hans: 可处置的
zh_hant: 可處置

# IDS_FeatureAltInterpolatedVerbatimStrings
source: alternative interpolated verbatim strings
cs: alternativní interpolované doslovné řetězce
de: Alternative interpolierte ausführliche Zeichenfolgen
es: cadenas textuales interpoladas alternativas
fr: chaînes verbatim interpolées de remplacement
it: stringhe verbatim interpolate alternative
ja: 代替的な挿入逐語的文字列
ko: 대체 보간된 축자 문자열
pl: alternatywne interpolowane ciągi dosłowne
pt_br: cadeias de caracteres verbatim interpoladas alternativas
ru: альтернативные интерполированные буквальные строки
tr: alternatif ilişkilendirilmiş tam dizeler
zh_hans: 可选择的内插逐字字符串
zh_hant: 插入的逐字替代字串

# IDS_FeatureAndPattern
source: and pattern
cs: vzor and
fr: Modèle and
it: criterio and
ja: and パターン
pl: i wzorzec
pt_br: e o padrão
ru: и шаблон
zh_hans: "and" 模式
zh_hant: and 樣式

# IDS_FeatureAsyncUsing
source: asynchronous using
cs: asynchronní příkaz using
de: asynchrone using-Anweisung
es: using asincrónica
fr: using asynchrone
it: using asincrono
ja: 非同期 using
ko: 비동기 using
pl: asynchroniczna instrukcja using
pt_br: using assíncrona
ru: асинхронный оператор using
tr: asenkron using
zh_hans: 异步 using
zh_hant: 非同步 using

# IDS_FeatureCoalesceAssignmentExpression
source: coalescing assignment
cs: slučovací přiřazení
de: Zusammenfügungszuweisung
es: asignación de incorporación
fr: assignation de fusion
it: assegnazione di coalescenza
ja: 合体代入
ko: 병합 할당
pl: przypisanie łączące
pt_br: atribuição de união
ru: назначение объединения
tr: birleştirme ataması
zh_hans: 合并赋值
zh_hant: 聯合指派

# IDS_FeatureConstantInterpolatedStrings
source: constant interpolated strings
cs: konstantní interpolované řetězce
fr: chaînes interpolées constantes
it: stringhe interpolate costanti
ja: 定数の補間された文字列
pl: interpolowane ciągi stałych
pt_br: cadeias de caracteres interpoladas constantes
ru: константные интерполированные строки
zh_hans: 常数内插字符串
zh_hant: 常數差補字串

# IDS_FeatureDefaultTypeParameterConstraint
source: default type parameter constraints
cs: výchozí omezení parametru typu
fr: contraintes de paramètre de type par défaut
it: vincoli di parametro di tipo predefiniti
ja: 既定の型パラメーターの制約
pl: domyślne ograniczenia parametru typu
pt_br: restrições de parâmetro de tipo padrão
ru: ограничения параметров типа по умолчанию
zh_hans: 默认类型参数约束
zh_hant: 預設型別參數條件約束

# IDS_FeatureDelegateGenericTypeConstraint
source: delegate generic type constraints
cs: delegovat obecná omezení typu
de: Generische Typeneinschränkungen für Delegat
es: restricciones de tipo genérico delegate
fr: contraintes de type générique de délégué
it: vincoli di tipo generico delegato
ja: delegate ジェネリック型の制約
ko: 대리자 제네릭 형식 제약 조건
pl: ogólne ograniczenia typów delegowania
pt_br: restrições de tipo genérico delegate
ru: ограничения универсального типа для делегата
tr: delegate genel tür kısıtlamaları
zh_hans: 委托泛型类型约束
zh_hant: 委派泛型類型條件約束

# IDS_FeatureEnumGenericTypeConstraint
source: enum generic type constraints
cs: výčet obecných omezení typu
de: Generische Typeneinschränkungen für Enumeration
es: restricciones de tipo genérico enum
fr: contraintes de type générique d'enum
it: vincoli di tipo generico enumerazione
ja: enum ジェネリック型の制約
ko: 열거형 제네릭 형식 제약 조건
pl: ogólne ograniczenia typów wyliczenia
pt_br: restrições de tipo genérico enum
ru: ограничения универсального типа перечисления
tr: enum genel tür kısıtlamaları
zh_hans: 枚举泛型类型约束
zh_hant: 列舉泛型類型條件約束

# IDS_FeatureExpressionVariablesInQueriesAndInitializers
source: declaration of expression variables in member initializers and queries
cs: deklarace proměnných výrazu v inicializátorech členů a dotazech
de: Deklaration von Ausdrucksvariablen in Memberinitialisierern und Abfragen
es: declaración de variables de expresión en inicializadores y consultas de miembros
fr: déclaration de variables d'expression dans les initialiseurs de membres et les requêtes
it: dichiarazione di variabili di espressione in query e inizializzatori di membri
ja: メンバー初期化子とクエリ内の式変数の宣言
ko: 멤버 이니셜라이저 및 쿼리에서 식 변수 선언
pl: deklaracje zmiennych wyrażeń w inicjatorach elementów członkowskich i zapytaniach
pt_br: declaração de variáveis de expressão em inicializadores e em consultas do membro
ru: объявление переменных выражения в инициализаторах члена и запросах
tr: üye başlatıcılarda ve sorgularda ifade değişkenlerinin bildirimi
zh_hans: 成员初始值设定项和查询中的表达式变量声明
zh_hant: 成員初始設定式及查詢中之運算式變數的宣告

# IDS_FeatureExtendedPartialMethods
source: extended partial methods
cs: rozšířené částečné metody
fr: méthodes partielles étendues
it: metodi parziali estesi
ja: 拡張部分メソッド
pl: rozszerzone metody częściowe
pt_br: métodos parciais estendidos
ru: расширенные разделяемые методы
zh_hans: 扩展的分部方法
zh_hant: 擴充部分方法

# IDS_FeatureExtensibleFixedStatement
source: extensible fixed statement
cs: rozšiřitelný příkaz fixed
de: Erweiterbare fixed-Anweisung
es: instrucción "fixed" extensible
fr: instruction fixed extensible
it: istruzione fixed estendibile
ja: 拡張可能な fixed ステートメント
ko: 확장 가능한 fixed 문
pl: rozszerzalna instrukcja fixed
pt_br: instrução fixed extensível
ru: расширяемый оператор fixed
tr: genişletilebilir fixed deyimi
zh_hans: 可扩展 fixed 语句
zh_hant: 可延伸 fixed 陳述式

# IDS_FeatureExtensionGetAsyncEnumerator
source: extension GetAsyncEnumerator
cs: rozšíření GetAsyncEnumerator
fr: GetAsyncEnumerator de l'extension
it: GetAsyncEnumerator dell'estensione
ja: 拡張機能 GetAsyncEnumerator
pl: Element GetAsyncEnumerator rozszerzenia
pt_br: extensão GetAsyncEnumerator
ru: GetAsyncEnumerator расширения
zh_hans: 扩展 GetAsyncEnumerator
zh_hant: 延伸模組 GetAsyncEnumerator

# IDS_FeatureExtensionGetEnumerator
source: extension GetEnumerator
cs: rozšíření GetEnumerator
fr: GetEnumerator de l'extension
it: GetEnumerator dell'estensione
ja: 拡張機能 GetEnumerator
pl: Element GetEnumerator rozszerzenia
pt_br: extensão GetEnumerator
ru: GetEnumerator расширения
zh_hans: 扩展 GetEnumerator
zh_hant: 延伸模組 GetEnumerator

# IDS_FeatureExternLocalFunctions
source: extern local functions
cs: externí místní funkce
fr: fonctions locales externes
it: funzioni locali extern
ja: extern ローカル関数
pl: ustaw funkcje lokalne jako zewnętrzne
pt_br: funções locais externas
ru: Внешние локальные функции
zh_hans: 外部本地函数
zh_hant: 外部區域函式

# IDS_FeatureFunctionPointers
source: function pointers
cs: ukazatele na funkci
fr: pointeurs de fonction
it: puntatori a funzione
ja: 関数ポインター
pl: wskaźniki funkcji
pt_br: ponteiros de função
ru: указатели на функцию
zh_hans: 函数指针
zh_hant: 函式指標

# IDS_FeatureIndexOperator
source: index operator
cs: operátor indexu
es: operador de índice
fr: opérateur d'index
it: operatore di indice
ja: インデックス演算子
ko: 인덱스 연산자
pl: operator indeksowania
pt_br: operador de índice
ru: оператор index
tr: dizin işleci
zh_hans: 索引运算符
zh_hant: 索引運算子

# IDS_FeatureIndexingMovableFixedBuffers
source: indexing movable fixed buffers
cs: indexování mobilních vyrovnávacích pamětí pevné velikosti
de: Bewegliche Puffer fester Größe werden indiziert.
es: indexando búferes fijos movibles
fr: indexation de mémoires tampons fixes mobiles
it: indicizzazione di buffer fissi mobili
ja: 移動可能な固定バッファーのインデックス化
ko: 이동 가능한 고정 버퍼 인덱싱
pl: indeksowanie możliwych do przenoszenia buforów fixed
pt_br: buffers fixos móveis de indexação
ru: индексирование перемещаемых буферов фиксированного размера
tr: taşınabilir sabit arabellekler dizine alınıyor
zh_hans: 正在编制可移动固定缓冲区的索引
zh_hant: 對可移動的固定緩衝區編製索引

# IDS_FeatureInitOnlySetters
source: init-only setters
cs: metody setter jenom pro inicializaci
fr: méthodes setter d'initialisation uniquement
it: setter di sola inizializzazione
ja: init 専用セッター
pl: metody ustawiające tylko do inicjowania
pt_br: setters somente de inicialização
ru: методы задания значения, вызываемые только при инициализации
zh_hans: init-only 资源库
zh_hant: 僅供初始化 Setter

# IDS_FeatureLocalFunctionAttributes
source: local function attributes
cs: atributy místních funkcí
fr: attributs de fonction locale
it: attributi di funzione locale
ja: ローカル関数の属性
pl: atrybuty funkcji lokalnych
pt_br: atributos de função local
ru: Атрибуты локальной функции
zh_hans: 本地函数特性
zh_hant: 區域函式屬性

# IDS_FeatureLambdaDiscardParameters
source: lambda discard parameters
cs: lambda – zahodit parametry
de: Parameter zum Verwerfen von Lambdafunktion
es: parámetros de descarte de lambda
fr: paramètres d'abandon lambda
it: parametri di rimozione lambda
ja: ラムダ ディスカード パラメーター
ko: 람다 무시 항목 매개 변수
pl: parametry odrzucania wyrażenia lambda
pt_br: parâmetros de descarte de lambda
ru: Параметры удаления лямбда-выражения
tr: lambda atma parametreleri
zh_hans: lambda 放弃参数
zh_hant: lambda 捨棄參數

# IDS_FeatureMemberNotNull
source: MemberNotNull attribute
cs: Atribut MemberNotNull
fr: Attribut MemberNotNull
it: Attributo MemberNotNull
ja: MemberNotNull 属性
pl: Atrybut MemberNotNull
pt_br: Atributo MemberNotNull
ru: Атрибут MemberNotNull
zh_hans: MemberNotNull 特性
zh_hant: MemberNotNull 屬性

# IDS_FeatureModuleInitializers
source: module initializers
cs: inicializátory modulů
fr: initialiseurs de module
it: inizializzatori di modulo
ja: モジュールの初期化子
pl: inicjatory modułów
pt_br: inicializadores de módulo
ru: инициализаторы модулей
zh_hans: 模块初始值设定项
zh_hant: 模組初始設定式

# IDS_FeatureNameShadowingInNestedFunctions
source: name shadowing in nested functions
cs: skrývání názvů ve vnořených funkcích
de: Namensshadowing in geschachtelten Funktionen
es: sombreado de nombres en funciones anidadas
fr: ombrage des noms dans les fonctions imbriquées
it: shadowing dei nomi nelle funzioni annidate
ja: 入れ子になった関数での名前シャドウイング
ko: 중첩된 함수의 이름 섀도잉
pl: zasłanianie nazw w funkcjach zagnieżdżonych
pt_br: sombreamento de nome em funções aninhadas
ru: скрытие имен во вложенных функциях
tr: iç içe işlevlerde ad gölgeleme
zh_hans: 在嵌套函数中的名称映射
zh_hant: 巢狀函式中的名稱鏡像處理

# IDS_FeatureNativeInt
source: native-sized integers
cs: Celá čísla s nativní velikostí
fr: entiers de taille native
it: Integer di dimensioni native
ja: ネイティブサイズの整数
pl: liczby całkowite o wielkości natywnej
pt_br: inteiros de tamanho nativo
ru: целые числа собственного размера
zh_hans: 本机大小的整数
zh_hant: 原生大小整數

# IDS_FeatureNestedStackalloc
source: stackalloc in nested expressions
cs: stackalloc ve vnořených výrazech
de: "stackalloc" in geschachtelten Ausdrücken
es: stackalloc en expresiones anidadas
fr: stackalloc dans des expressions imbriquées
it: stackalloc in espressioni annidate
ja: 入れ子になった式の stackalloc
ko: 중첩 식의 stackalloc
pl: Element stackalloc w wyrażeniach zagnieżdżonych
pt_br: stackalloc em expressões aninhadas
ru: stackalloc во вложенных выражениях
tr: iç içe geçmiş ifadelerde stackalloc
zh_hans: 嵌套表达式中的 stackalloc
zh_hant: 巢狀運算式中的 stackalloc

# IDS_FeatureNotNullGenericTypeConstraint
source: notnull generic type constraint
cs: omezení obecného typu notnull
de: notnull-Einschränkung für generischen Typ
es: restricción de tipo genérico notnull
fr: contrainte de type générique notnull
it: vincolo di tipo generico notnull
ja: notnull ジェネリック型の制約
ko: notnull 제네릭 형식 제약 조건
pl: ogólne ograniczenie typu notnull
pt_br: restrição de tipo genérico notnull
ru: ограничение универсального типа notnull
tr: notnull genel tür kısıtlaması
zh_hans: notnull 泛型类型约束
zh_hant: notnull 泛型型別限制式

# IDS_FeatureNotPattern
source: not pattern
cs: vzor not
fr: Modèle not
it: criterio not
ja: not パターン
pl: nie wzorzec
pt_br: não contém o padrão
ru: не шаблон
zh_hans: "not" 模式
zh_hant: not 樣式

# IDS_FeatureNullPointerConstantPattern
source: null pointer constant pattern
cs: konstantní vzor nulového ukazatele
fr: modèle de constante de pointeur null
it: criterio per costante puntatore Null
ja: null ポインター定数パターン
pl: stały wzorzec pustego wskaźnika
pt_br: padrão constante de ponteiro nulo
ru: Указатель на шаблон константы имеет значение null.
zh_hans: 空指针常数模式
zh_hant: Null 指標常數模式

# IDS_FeatureNullableReferenceTypes
source: nullable reference types
cs: typy odkazů s možnou hodnotou null
de: Nullable-Verweistypen
es: tipos de referencia que aceptan valores NULL
fr: types référence Nullable
it: tipi riferimento nullable
ja: Null 許容参照型
ko: nullable 참조 형식
pl: typy referencyjne dopuszczające wartość null
pt_br: tipos de referência que permitem valor nulo
ru: ссылочные типы, допускающие значение NULL
tr: boş değer atanabilir başvuru türleri
zh_hans: 可为 null 的引用类型
zh_hant: 可為 Null 的參考型別

# IDS_FeatureObsoleteOnPropertyAccessor
source: obsolete on property accessor
cs: zastaralé u přístupového objektu vlastnosti
de: veraltet für Eigenschaftenaccessor
es: descriptor de acceso obsoleto en propiedad
fr: obsolète sur l'accesseur de propriété
it: funzionalità obsoleta nella funzione di accesso proprietà
ja: プロパティ アクセサーで廃止
ko: 속성 접근자에서 사용되지 않음
pl: przestarzałe w metodzie dostępu właściwości
pt_br: acessador obsoleto na propriedade
ru: устарело для метода доступа к свойству
tr: özellik erişimcisinde geçersiz
zh_hans: 属性访问器已过时
zh_hant: 在屬性存取子上淘汰

# IDS_FeatureOrPattern
source: or pattern
cs: vzor or
fr: Modèle or
it: criterio or
ja: or パターン
pl: lub wzorzec
pt_br: ou padrão
ru: или шаблон
zh_hans: "or" 模式
zh_hant: or 樣式

# IDS_FeatureParenthesizedPattern
source: parenthesized pattern
cs: vzor se závorkami
fr: Modèle entre parenthèses
it: criterio tra parentesi
ja: かっこで囲まれたパターン
pl: wzorzec w nawiasie
pt_br: padrão entre parênteses
ru: шаблон в круглых скобках
zh_hans: 带括号模式
zh_hant: 括弧樣式

# IDS_FeaturePragmaWarningEnable
source: warning action enable
cs: akce upozornění enable
de: Warnungsaktion "enable"
es: acción de advertencia "enable"
fr: action d'avertissement enable
it: azione di avviso enable
ja: 警告アクション enable
ko: 경고 작업 enable
pl: akcja warning: enable
pt_br: ação de aviso enable
ru: действие warning с enable
tr: enable uyarı eylemi
zh_hant: 警告動作 enable

# IDS_FeatureRangeOperator
source: range operator
cs: operátor rozsahu
de: Bereichsoperator
es: operador de intervalo
fr: opérateur de plage
it: operatore di intervallo
ja: 範囲演算子
ko: 범위 연산자
pl: operator zakresu
pt_br: operador de intervalo
ru: оператор range
tr: aralık işleci
zh_hans: 范围运算符
zh_hant: 範圍運算子

# IDS_FeatureReadOnlyMembers
source: readonly members
cs: členové s modifikátorem readonly
de: readonly-Member
es: miembros de solo lectura
fr: membres readonly
it: membri readonly
ja: 読み取り専用メンバー
ko: 읽기 전용 멤버
pl: składowe tylko do odczytu
pt_br: membros readonly
ru: члены только для чтения
tr: saltokunur üyeler
zh_hans: 只读成员
zh_hant: 唯讀成員

# IDS_FeatureRecords
source: records
cs: záznamy
fr: enregistrements
it: record
ja: レコード
pl: rekordy
pt_br: registros
ru: записи
zh_hans: 记录
zh_hant: 記錄

# IDS_FeatureRecursivePatterns
source: recursive patterns
cs: rekurzivní vzory
de: Rekursive Muster
es: patrones recursivos
fr: modèles récursifs
it: criteri ricorsivi
ja: 再帰的パターン
ko: 재귀 패턴
pl: wzorce rekursywne
pt_br: padrões recursivos
ru: рекурсивные шаблоны
tr: özyinelemeli desenler
zh_hans: 递归模式
zh_hant: 遞迴模式

# IDS_FeatureRefConditional
source: ref conditional expression
cs: referenční podmínka
de: Bedingter ref-Ausdruck
es: expresión condicional de referencia
fr: expression conditionnelle ref
it: espressione condizionale ref
ja: ref 条件式
ko: ref 조건식
pl: wyrażenie warunkowe ref
pt_br: expressão condicional ref
ru: Условное выражение ref
tr: ref koşullu ifadesi
zh_hans: ref 条件表达式
zh_hant: 參考條件運算式

# IDS_FeatureRefFor
source: ref for-loop variables
cs: Proměnné smyčky for odkazu
de: Verweis auf for-loop-Variablen
es: variables for-loop de referencias
fr: variables for loop de référence
it: variabili ciclo for ref
ja: ref for ループ変数
ko: ref for 루프 변수
pl: zmienne pętli for odwołania
pt_br: variáveis de loop ref for
ru: переменные цикла for-loop для ссылки
tr: ref for-loop değişkenleri
zh_hans: ref for 循环变量
zh_hant: 參考 for 迴圈變數

# IDS_FeatureRefForEach
source: ref foreach iteration variables
cs: Iterační proměnné foreach odkazu
de: Verweis auf foreach-Iterationsvariablen
es: variables de iteración foreach de referencias
fr: variables d'itération foreach de référence
it: variabili di iterazione foreach ref
ja: ref foreach 繰り返し変数
ko: ref foreach 반복 변수
pl: zmienna iteracji foreach odwołania
pt_br: variáveis de iteração ref foreach
ru: переменные итерации foreach для ссылки
tr: ref foreach yineleme değişkenleri
zh_hans: ref foreach 迭代变量
zh_hant: 參考 foreach 反覆運算變數

# IDS_FeatureRefReassignment
source: ref reassignment
cs: Opětovné přiřazení odkazu
de: ref-Neuzuweisung
es: reasignación de referencias
fr: réassignation de référence
it: riassegnazione ref
ja: ref 再代入
ko: ref 다시 할당
pl: ponowne przypisanie odwołania
pt_br: reatribuição de ref
ru: повторное назначение по ссылке
tr: ref yeniden ataması
zh_hans: ref 赋值
zh_hant: 參考重新指派

# IDS_FeatureRelationalPattern
source: relational pattern
cs: relační vzor
fr: Modèle relationnel
it: criterio relazionale
ja: リレーショナル パターン
pl: wzorzec relacyjny
pt_br: padrão relacional
ru: реляционный шаблон
zh_hans: 关系模式
zh_hant: 關聯性樣式

# IDS_FeatureStackAllocInitializer
source: stackalloc initializer
cs: inicializátor výrazu stackalloc
de: stackalloc-Initialisierer
es: inicializador stackalloc
fr: initialiseur stackalloc
it: inizializzatore stackalloc
ja: stackalloc 初期化子
ko: stackalloc 이니셜라이저
pl: inicjator stackalloc
pt_br: inicializador stackalloc
ru: инициализатор stackalloc
tr: stackalloc başlatıcı
zh_hans: stackalloc 初始值设定项
zh_hant: stackalloc 初始設定式

# IDS_FeatureStaticAnonymousFunction
source: static anonymous function
cs: statická anonymní funkce
fr: fonction anonyme statique
it: funzione anonima statica
ja: 静的匿名関数
pl: statyczna funkcja anonimowa
pt_br: função anônima estática
ru: статическая анонимная функция
zh_hans: 静态匿名函数
zh_hant: 靜態匿名函式

# IDS_FeatureStaticLocalFunctions
source: static local functions
cs: statické místní funkce
de: Statische lokale Funktionen
es: funciones locales estáticas
fr: fonctions locales statiques
it: funzioni locali statiche
ja: 静的ローカル関数
ko: 정적 로컬 함수
pl: statyczne funkcje lokalne
pt_br: funções locais estáticas
ru: статические локальные функции
tr: statik yerel işlevler
zh_hans: 静态本地函数
zh_hant: 靜態區域函式

# IDS_FeatureSwitchExpression
source: <switch expression>
cs: <výraz přepínače>
de: <switch-Ausdruck>
es: <expresión switch>
fr: <expression switch>
it: <espressione switch>
ja: <switch 式>
ko: <switch 식>
pl: <wyrażenie przełącznika>
pt_br: <expressão switch>
ru: <выражения для выбора вариантов>
zh_hans: <开关表达式>
zh_hant: <切換運算式>

# IDS_FeatureTargetTypedConditional
source: target-typed conditional expression
cs: podmíněný výraz s typem cíle
fr: expression conditionnelle de type cible
it: espressione condizionale con tipo di destinazione
ja: ターゲットにより型指定された条件式
pl: wyrażenie warunkowe o typie docelowym
pt_br: expressão condicional com tipo de destino
ru: условное выражение с целевым типом
zh_hans: 目标类型的条件表达式
zh_hant: 目標型別條件運算式

# IDS_FeatureTupleEquality
source: tuple equality
cs: rovnost řazené kolekce členů
de: Tupelgleichheit
es: igualdad de tupla
fr: égalité de tuple
it: uguaglianza tuple
ja: タプルの等値性
ko: 튜플 같음
pl: równość krotki
pt_br: igualdade de tupla
ru: равенство кортежей
tr: demet eşitliği
zh_hans: 元组相等
zh_hant: 元組相等

# IDS_FeatureTypePattern
source: type pattern
cs: vzor typu
fr: Modèle type
it: criterio di tipo
ja: 種類のパターン
pl: wzorzec typu
pt_br: padrão de tipo
ru: шаблон типа
zh_hans: 类型模式
zh_hant: 類型樣式

# IDS_FeatureUnconstrainedTypeParameterInNullCoalescingOperator
source: unconstrained type parameters in null coalescing operator
cs: parametry neomezeného typu v operátoru sloučení s hodnotou null
de: Uneingeschränkte Typparameter in NULL-Zusammenfügungsoperator
es: parámetros de tipo sin restricciones en operador de incorporación nulo
fr: paramètres de type sans contrainte dans un opérateur de fusion ayant une valeur null
it: parametri di tipo senza vincoli nell'operatore Null di coalescenza
ja: Null 合体演算子の中の非制約型パラメーター
ko: null 병합 연산자의 비제한 형식 매개 변수
pl: parametry typu bez ograniczeń w operatorze łączenia wartości null
pt_br: parâmetros de tipo irrestrito em operador de união nulo
ru: параметры неограниченного типа в операторе объединения со значением NULL
tr: null birleştirme işlecinde kısıtlanmamış tür parametreleri
zh_hans: 合并运算符中的无约束类型参数
zh_hant: Null 聯合運算子中的非限制式型別參數

# IDS_FeatureUnmanagedConstructedTypes
source: unmanaged constructed types
cs: nespravované konstruované typy
de: nicht verwaltete konstruierte Typen
es: tipos construidos no administrados
fr: types construits non managés
it: tipi costruiti non gestiti
ja: アンマネージド構築型
ko: 비관리형 생성된 형식
pl: niezarządzane typy konstruowane
pt_br: tipos construídos não gerenciados
ru: неуправляемые сконструированные типы
tr: yönetilmeyen oluşturulmuş türler
zh_hans: 非托管构造类型
zh_hant: 非受控建構的類型

# IDS_FeatureUnmanagedGenericTypeConstraint
source: unmanaged generic type constraints
cs: nespravovaná obecná omezení typu
de: Nicht verwaltete generische Typeneinschränkungen
es: restricciones de tipo genérico unmanaged
fr: contraintes de type générique unmanaged
it: vincoli di tipo generico unmanaged
ja: unmanaged ジェネリック型の制約
ko: unmanaged 제네릭 형식 제약 조건
pl: ogólne niezarządzane ograniczenia typów
pt_br: restrições de tipo genérico unmanaged
ru: ограничения неуправляемого универсального типа
tr: unmanaged genel tür kısıtlamaları
zh_hans: 非托管泛型类型约束
zh_hant: Unmanaged 泛型類型條件約束

# IDS_FeatureUsingDeclarations
source: using declarations
cs: deklarace using
de: Using-Deklarationen
es: declaraciones using
fr: Déclarations using
it: dichiarazioni using
ja: using 宣言
ko: using 선언
pl: deklaracje using
pt_br: declarações using
ru: объявления using
tr: using bildirimleri
zh_hans: Using 声明
zh_hant: using 宣告

# IDS_FeatureVarianceSafetyForStaticInterfaceMembers
source: variance safety for static interface members
cs: zabezpečení odchylky pro statické členy rozhraní
fr: sécurité de variance pour les membres d'interface statiques
it: sicurezza della varianza per i membri di interfaccia statici
ja: 静的インターフェイス メンバーの変性の安全性
pl: bezpieczeństwo wariancji dla elementów członkowskich interfejsu statycznego
pt_br: segurança de variância para membros de interface estática
ru: безопасность вариантности для статических элементов интерфейса
zh_hans: 静态接口成员的变型安全性
zh_hant: 靜態介面成員的變異數安全性

# IDS_NULL
source: <null>
pt_br: <nulo>

# IDS_OverrideWithConstraints
source: constraints for override and explicit interface implementation methods
cs: omezení pro metody přepsání a explicitní implementace rozhraní
de: Einschränkungen für Außerkraftsetzung und explizite Schnittstellenimplementierungsmethoden
es: restricciones para métodos de implementación de interfaz explícita e invalidación
fr: contraintes des méthodes d'implémentation d'interface par remplacement et explicites
it: vincoli per i metodi di override e di implementazione esplicita dell'interfaccia
ja: オーバーライドおよび明示的なインターフェイスの実装メソッドの制約
ko: 재정의 및 명시적 인터페이스 구현 메서드에 대한 제약 조건
pl: ograniczenia dla przesłonięć i jawnych metod implementacji interfejsu
pt_br: restrições para métodos de substituição e de implementação explícita da interface
ru: ограничения для методов переопределения и явной реализации интерфейса
tr: geçersiz kılma ve açık arabirim uygulama yöntemleri için kısıtlamalar
zh_hans: 重写和显式接口实现方法的约束
zh_hant: 適用於覆寫和明確介面實作方法的條件約束

# IDS_Parameter
source: parameter
cs: parametr
fr: paramètre
it: parametro
ja: パラメーター
pl: parametru
pt_br: parâmetro
ru: параметр
zh_hans: 参数
zh_hant: 參數
