Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_FeatureExpressionBodiedIndexer
source: expression-bodied indexer
cs: indexer s výrazem v těle
de: Ausdruckskörperindexer
es: indexador con forma de expresión
fr: indexeur expression-bodied
it: indicizzatore con corpo di espressione
ja: 式のようなインデクサー
ko: 식 본문 인덱서
pl: indeksator z wyrażeniem w treści
pt_br: indexador apto para expressão
ru: индексатор, воплощающий выражение
tr: ifade gövdeli dizin oluşturucu
zh_hans: expression-bodied 索引器
zh_hant: 運算式主體索引子

# IDS_FeatureAutoPropertyInitializer
source: auto property initializer
cs: automatický inicializátor vlastnosti
de: Automatische Eigenschafteninitialisierung
es: inicializador de propiedad automático
fr: initialiseur auto-property
it: inizializzatore di proprietà automatica
ja: 自動プロパティ初期化子
ko: 자동 속성 이니셜라이저
pl: inicjator właściwości automatycznej
pt_br: inicializador de autopropriedade
ru: автоматический инициализатор свойства
tr: otomatik özellik başlatıcısı
zh_hans: 自动属性初始值设定项
zh_hant: Auto 屬性初始設定式

# IDS_FeatureRefLocalsReturns
source: byref locals and returns
cs: lokální proměnné a vrácení podle odkazu
de: Lokale byref-Elemente und Rückgaben
es: variables locales y devoluciones por referencia
fr: variables locales et retours byref
it: variabili locali e valori restituiti per riferimento
ja: byref ローカル変数と返却
ko: byref 지역 및 반환
pl: zmienne lokalne i wartości zwracane byref
pt_br: retornos e locais de byref
ru: возвращаемые данные и локальные переменные типа ByRef
tr: byref yerel değerleri ve dönüşleri
zh_hans: byref 局部变量和返回
zh_hant: Byref 本機與傳回

# IDS_FeatureReadOnlyReferences
source: readonly references
cs: odkazy jen pro čtení
de: schreibgeschützte Verweise
es: referencias readonly
fr: références en lecture seule
it: riferimenti di sola lettura
ja: 読み取り専用の参照
ko: 읽기 전용 참조
pl: odwołania tylko do odczytu
pt_br: referências somente leitura
ru: ссылки только для чтения
tr: salt okunur başvurular
zh_hans: 只读引用
zh_hant: 唯讀參考

# IDS_FeatureRefStructs
source: ref structs
cs: struktury REF
de: Referenzstrukturen
es: estructuras ref
fr: structs par référence
it: struct ref
ja: ref 構造体
ko: ref struct
pl: struktury ref
pt_br: structs de referência
ru: ссылочные структуры
tr: başvuru yapı birimleri
zh_hans: ref 结构
zh_hant: ref struct

source: Compilation (C#):
cs: Kompilace (C#):
de: Kompilierung (C#):
es: Compilación (C#):
it: Compilazione (C#):
ja: コンパイル (C#):
ko: (C#) 컴파일:
pl: Kompilacja (C#):
pt_br: Compilação (C#):
ru: Компиляция (C#):
tr: Derleme (C#):
zh_hans: 编译(C#):
zh_hant: 編譯 (C#):

# SyntaxNodeIsNotWithinSynt
source: Syntax node is not within syntax tree
cs: Uzel syntaxe není ve stromu syntaxe.
de: Der Syntaxknoten gehört nicht zum Syntaxbaum.
es: El nodo de sintaxis no está dentro del árbol de sintaxis
fr: Le nœud de syntaxe ne se trouve pas dans l'arborescence de syntaxe
it: Il nodo Syntax non è compreso nell'albero della sintassi
ja: 構文ノードが構文ツリー内にありません
ko: 구문 노드가 구문 트리 내에 없습니다.
pl: Węzeł składni znajduje się poza drzewem składni
pt_br: Nó de sintaxe não está dentro da árvore de sintaxe
ru: Синтаксический узел не находится в синтаксическом дереве.
tr: Sözdizimi düğümü sözdizimi ağacı içinde değil
zh_hans: 语法节点不在语法树中
zh_hant: 語法節點不在語法樹狀結構內

# LocationMustBeProvided
source: Location must be provided in order to provide minimal type qualification.
cs: Musí být zadané umístění, aby se zajistila minimální kvalifikace typu.
de: Für eine minimale Typqualifizierung muss der Pfad angegeben werden.
es: La ubicación se debe indicar para proporcionar una cualificación de tipo mínima.
fr: L'emplacement doit être indiqué pour fournir une qualification de type minimale.
it: Per offrire una qualifica minima del tipo, è necessario specificare Position.
ja: 提供される型の修飾子を最小にするため、場所を提供する必要があります。
ko: 최소 형식 한정자를 제공하려면 위치를 제공해야 합니다.
pl: Lokalizacja musi być określona, aby zapewnić minimalną kwalifikację typu.
pt_br: Local deve ser fornecido para fornecer a qualificação do tipo mínimo.
ru: Чтобы выполнить минимальную квалификацию типа, необходимо указать расположение.
tr: Minimum tür özelliği sağlamak için konum verilmelidir.
zh_hans: 必须提供位置才能提供最低程度的类型限定。
zh_hant: 必須提供位置，才可提供最基本的類型限定性條件。

# SyntaxTreeSemanticModelMust
source: SyntaxTreeSemanticModel must be provided in order to provide minimal type qualification.
cs: Musí být zadaný SyntaxTreeSemanticModel, aby se zajistila minimální kvalifikace typu.
de: Für eine minimale Typqualifizierung muss SyntaxTreeSemanticModel angegeben werden.
es: Se debe indicar SyntaxTreeSemanticModel para proporcionar una cualificación de tipo mínima.
fr: SyntaxTreeSemanticModel doit être indiqué pour fournir une qualification de type minimale.
it: Per offrire una qualifica minima del tipo, è necessario specificare SyntaxTreeSemanticModel.
ja: 型の修飾子を最小にするため、SyntaxTreeSemanticModel を指定する必要があります。
ko: 최소 형식 한정자를 제공하려면 SyntaxTreeSemanticModel을 제공해야 합니다.
pl: Klasa SyntaxTreeSemanticModel musi być dostępna, aby zapewnić minimalną kwalifikację typu.
pt_br: SyntaxTreeSemanticModel deve ser fornecido para fornecer a qualificação do tipo mínimo.
ru: Чтобы выполнить минимальную квалификацию типа, необходимо использовать SyntaxTreeSemanticModel.
tr: Minimum tür özelliği sağlamak için SyntaxTreeSemanticModel verilmelidir.
zh_hans: 必须提供 SyntaxTreeSemanticModel 才能提供最低程度的类型限定。
zh_hant: 必須提供 SyntaxTreeSemanticModel，才可提供最基本的類型限定性條件。

# CantReferenceCompilationOf
source: Can't reference compilation of type '{0}' from {1} compilation.
cs: Na kompilaci typu {0} nejde odkazovat z kompilace {1}.
de: Die Kompilierung mit dem Typ "{0}" kann aus der {1}-Kompilierung nicht referenziert werden.
es: No se puede hacer referencia a la compilación de tipo '{0}' desde {1} compilación.
fr: Impossible de référencer la compilation de type '{0}' à partir de la compilation {1}.
it: Non è possibile fare riferimento alla compilazione di tipo '{0}' dalla compilazione di {1}.
ja: コンパイル {1} から '{0}' 型のコンパイルを参照できません。
ko: {1} 컴파일에서 '{0}' 형식의 컴파일을 참조할 수 없습니다.
pl: Nie można odwołać się do kompilacji typu „{0}” z kompilacji {1}.
pt_br: Não é possível fazer referência a compilação do tipo "{0}" de {1} compilação.
ru: Не удается создать ссылку на компиляцию типа "{0}" из компиляции {1}.
tr: {1} derlemesinden '{0}' türünün derlemesine başvurulamıyor.
zh_hans: 无法从 {1} 编译引用类型为“{0}”的编译。
zh_hant: 無法從 {1} 編譯來參考類型為 '{0}' 的編譯

source: Syntax tree already present
cs: Strom syntaxe už je přítomný.
de: Der Syntaxbaum ist bereits vorhanden.
es: Ya hay un árbol de sintaxis
fr: Arborescence de syntaxe déjà présente
it: L'albero della sintassi è già presente
ja: 構文ツリーが既に存在しています
ko: 구문 트리가 이미 있습니다.
pl: Drzewo składni już istnieje
pt_br: Árvore de sintaxe já está presente
ru: Синтаксическое дерево уже имеется
tr: Sözdizimi ağacı zaten var
zh_hans: 语法树已存在
zh_hant: 語法樹狀結構已存在

# SubmissionCanOnlyInclude
source: Submission can only include script code.
cs: Odeslání může zahrnovat jenom kód skriptu.
de: Es kann nur Skriptcode übermittelt werden.
es: El envío solo puede incluir código de script.
fr: Une soumission ne peut inclure que du code de script.
it: L'invio può includere solo codice script.
ja: 送信にはスクリプト コードのみを含めることができます。
ko: 스크립트 코드만 포함하여 제출할 수 있습니다.
pl: Przesłanie może zawierać tylko kod skryptu.
pt_br: Envio só pode incluir código de script.
ru: Отправка может включать только код скрипта.
tr: Gönderim yalnızca betik kodu içerebilir.
zh_hans: 提交只能包含脚本代码。
zh_hant: 提交只能包含指令碼。

# SubmissionCanHaveAtMostOne
source: Submission can have at most one syntax tree.
cs: Odeslání musí mít aspoň jeden strom syntaxe.
de: Es kann nur ein Syntaxbaum übermittelt werden.
es: El envío puede tener, como máximo, un árbol de sintaxis.
fr: Une soumission peut avoir au plus une arborescence de syntaxe.
it: L'invio può avere al massimo un albero della sintassi.
ja: 送信に含めることができる構文ツリーは 1 つのみです。
ko: 구문 트리를 최대 하나만 제출할 수 있습니다.
pl: Przesłanie może mieć co najwyżej jedno drzewo składni.
pt_br: Envio pode ter no máximo uma árvore de sintaxe.
ru: Отправка может иметь максимум одно синтаксическое дерево.
tr: Gönderim en fazla bir sözdizimi ağacına sahip olabilir.
zh_hans: 提交最多可以具有一个语法树。
zh_hant: 提交最多可以有一個語法樹狀結構。

# TreeMustHaveARootNodeWith
source: tree must have a root node with SyntaxKind.CompilationUnit
cs: strom musí mít kořenový uzel s prvkem SyntaxKind.CompilationUnit
de: Der Baum muss einen Stammknoten mit SyntaxKind.CompilationUnit aufweisen.
es: el árbol debe tener un nodo raíz con SyntaxKind.CompilationUnit
fr: l'arborescence doit avoir un nœud racine avec SyntaxKind.CompilationUnit
it: l'albero deve avere un nodo radice con SyntaxKind.CompilationUnit
ja: ツリーには、SyntaxKind.CompilationUnit を伴うルート ノードがある必要があります。
ko: 트리는 SyntaxKind.CompilationUnit을 사용하는 루트 노드여야 합니다.
pl: drzewo musi zawierać węzeł główny z elementem SyntaxKind.CompilationUnit
pt_br: árvores devem ter um nó raiz com SyntaxKind.CompilationUnit
ru: Дерево должно иметь корневой узел в SyntaxKind.CompilationUnit
tr: ağacın SyntaxKind.CompilationUnit ile bir kök düğümü olmalıdır
zh_hans: 树必须具有带 SyntaxKind.CompilationUnit 的根节点
zh_hant: 樹狀結構必須要有包含 SyntaxKind.CompilationUnit 的根節點

source: Type argument cannot be null
cs: Argument typu nemůže být null.
de: Das Typargument kann nicht NULL sein.
es: El argumento de tipo no puede ser NULL
fr: L'argument de type ne peut pas avoir la valeur null
it: L'argomento di tipo non può essere Null
ja: 型引数を null にすることはできません
ko: 형식 인수는 null일 수 없습니다.
pl: Argument typu nie może mieć wartości null
pt_br: Argumento de tipo não pode ser nulo
ru: Аргумент типа не может иметь значение Null
tr: Tür bağımsız değişkeni null olamaz
zh_hans: 类型参数不能是 null
zh_hant: 類型引數不可為 null

source: Wrong number of type arguments
cs: Chybný počet argumentů typu
de: Falsche Anzahl von Typargumenten.
es: Número de argumentos de tipo incorrecto
fr: Nombre incorrect d'arguments de type
it: Il numero di argomenti di tipo è errato
ja: 型引数の数が正しくありません
ko: 형식 인수 수가 잘못되었습니다.
pl: Nieprawidłowa liczba argumentów typu
pt_br: Número errado de argumentos de tipo
ru: Неверное число аргументов типа
tr: Tür bağımsız değişkenlerinin yanlış sayısı
zh_hans: 类型参数的数目不正确
zh_hant: 類型引數的數目錯誤

# NameConflictForName
source: Name conflict for name {0}
cs: Konflikt u názvu {0}
de: Namenskonflikt für Name {0}.
es: Conflicto de nombre en el nombre {0}
fr: Conflit de noms pour le nom {0}
it: Conflitto tra nomi per il nome {0}
ja: 名前が名前 {0} と競合しています
ko: {0} 이름에 대한 이름이 충돌합니다.
pl: Nazwa {0} powoduje konflikt nazw
pt_br: Conflito de nome para o nome {0}
ru: Конфликтующее имя {0}
tr: {0} adı için ad çakışması
zh_hans: 名称 {0} 出现名称冲突
zh_hant: 名稱 {0} 發生名稱衝突

# LookupOptionsHasInvalidCombo
source: LookupOptions has an invalid combination of options
cs: LookupOptions má neplatnou kombinaci možností.
de: LookupOptions weist eine ungültige Kombination von Optionen auf.
es: LookupOptions tiene una combinación de opciones no válida
fr: LookupOptions a une combinaison d'options non valide
it: LookupOptions contiene una combinazione di opzioni non valida
ja: LookupOptions に無効な組み合わせのオプションがあります
ko: LookupOptions의 옵션 조합이 잘못되었습니다.
pl: Kombinacja opcji elementu LookupOptions jest nieprawidłowa
pt_br: LookupOptions tem uma combinação inválida de opções
ru: LookupOptions имеет недопустимую комбинацию параметров.
tr: LookupOptions geçersiz seçenekler birleşimine sahip
zh_hans: LookupOptions 具有无效的选项组合
zh_hant: LookupOptions 的選項組合無效

source: items: must be non-empty
cs: Položky: Nesmí být prázdné.
de: Elemente: Dürfen nicht leer sein.
es: elementos: no pueden estar vacíos
fr: éléments : ne doivent pas être vides
it: elementi: non deve essere vuoto
ja: アイテム: 空にすることはできません
ko: 항목: 비워 두어서는 안 됩니다.
pl: Element items: nie może być pusty
pt_br: itens: devem ser não vazios
ru: элементы: не должно быть пустым
tr: öğeler: boş olmamalıdır
zh_hans: 项目: 不能为空
zh_hant: 項目: 不可為空白

# UseVerbatimIdentifier
source: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier or Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier to create identifier tokens.
cs: Pomocí Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier nebo Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier můžete vytvořit tokeny identifikátorů.
de: Verwenden Sie "Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier" oder "Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier" zum Erstellen von Bezeichnertoken.
es: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier o Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier para crear tokens de identificador.
fr: Utilisez Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier ou Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier pour créer des jetons d'identificateur.
it: Usare Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier o Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier per creare token di identificatore.
ja: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier や Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier を使用して、識別子トークンを作成してください。
ko: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier 또는 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier를 사용하여 식별자 토큰을 만듭니다.
pl: Użyj metody Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier lub Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier do utworzenia tokenów identyfikatorów.
pt_br: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier ou Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier para criar tokens de identificador.
ru: Чтобы создать токены идентификаторов, используйте Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier или Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier.
tr: Tanımlayıcı belirteçler oluşturmak için Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier veya Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier öğesini kullanın.
zh_hans: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier 或 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier 可创建标识符标记。
zh_hant: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Identifier 或 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.VerbatimIdentifier 來建立識別項語彙基元。

# UseLiteralForTokens
source: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal to create character literal tokens.
cs: Pomocí Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal můžete vytvořit znakové literálové tokeny.
de: Verwenden Sie "Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal" zum Erstellen von Zeichenliteraltoken.
es: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal para crear tokens literales de carácter.
fr: Utilisez Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal pour créer des jetons de littéral de caractère.
it: Usare Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal per creare token letterali di tipo carattere.
ja: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal を使用して、文字のリテラル トークンを作成してください。
ko: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal을 사용하여 문자 리터럴 토큰을 만듭니다.
pl: Użyj metody Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal do utworzenia tokenów literałów znakowych.
pt_br: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal para criar tokens literais de caracteres.
ru: Чтобы создать токены символьных литералов, используйте Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal.
tr: Değişmez değerli karakter belirteçleri oluşturmak için Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal öğesini kullanın.
zh_hans: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal 来创建字符字面量标记。
zh_hant: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal 來建立字元常值語彙基元。

# UseLiteralForNumeric
source: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal to create numeric literal tokens.
cs: Pomocí Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal můžete vytvořit numerické literálové tokeny.
de: Verwenden Sie "Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal" zum Erstellen von numerischen Literaltoken.
es: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal para crear tokens literales numéricos.
fr: Utilisez Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal pour créer des jetons de littéral numérique.
it: Usare Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal per creare token letterali di tipo numerico.
ja: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal を使用して、数値のリテラル トークンを作成してください。
ko: Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal을 사용하여 숫자 리터럴 토큰을 만듭니다.
pl: Użyj metody Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal do utworzenia tokenów literałów liczbowych.
pt_br: Use Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal para criar tokens literais numéricos.
ru: Чтобы создать токены цифровых литералов, используйте Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal.
tr: Değişmez değerli sayısal belirteçler oluşturmak için Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal öğesini kullanın.
zh_hans: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal 来创建数字字面量标记。
zh_hant: 使用 Microsoft.CodeAnalysis.CSharp.SyntaxFactory.Literal 來建立數值常值語彙基元。

# ThisMethodCanOnlyBeUsedToCreateTokens
source: This method can only be used to create tokens - {0} is not a token kind.
cs: Tato metoda se dá používat jenom k vytváření tokenů – {0} není druh tokenu.
de: Diese Methode kann nur zum Erstellen von Token verwendet werden. "{0}" ist kein Token.
es: Este método solo se puede usar para crear tokens: {0} no es un tipo de token.
fr: Cette méthode ne peut être utilisée que pour créer des jetons - {0} n'est pas un genre de jeton.
it: Questo metodo può essere usato solo per creare token - {0} non è un tipo di token.
ja: このメソッドは、トークンの作成にのみ使用できます - {0} はトークンの種類ではありません。
ko: 이 메서드는 토큰을 만드는 데만 사용할 수 있습니다. {0}은(는) 토큰 종류가 아닙니다.
pl: Tej metody można użyć tylko do tworzenia tokenów — element {0} nie jest rodzajem tokenu.
pt_br: Este método pode somente ser usado para criar tokens - {0} não é um tipo de token.
ru: Этот метод можно использовать только для создания токенов — {0} не является видом токена.
tr: Bu yöntem yalnızca belirteç oluşturmak için kullanılabilir - {0} bir belirteç türü değildir.
zh_hans: 此方法只能用于创建标记 - {0} 不出标记类型。
zh_hant: 此方法只可用以建立語彙基元 - {0} 不是語彙基元種類。

# GenericParameterDefinition
source: Generic parameter is definition when expected to be reference {0}
cs: Obecný parametr je definice, i když se očekával odkaz {0}.
de: Der generische Parameter ist eine Definition, erwartet wurde ein Verweis {0}.
es: El parámetro genérico es definición cuando se espera que sea la referencia {0}
fr: Le paramètre générique est definition alors que la référence attendue était {0}
it: Il parametro generico corrisponde alla definizione mentre dovrebbe essere il riferimento {0}
ja: ジェネリック パラメーターは、参照 {0} である必要がある場合に定義されます
ko: 제네릭 매개 변수는 {0} 참조여야 할 때의 정의입니다.
pl: Ogólny parametr jest definicją, a oczekiwano odwołania {0}
pt_br: Parâmetro genérico é definição quando é esperado que seja referência {0}
ru: Универсальный параметр является определением, а ожидается, что он будет ссылкой {0}.
tr: {0} başvurusu olması beklendiğinde genel parametre bir tanımdır
zh_hans: 泛型参数是定义，但应是引用 {0}
zh_hant: 泛型參數為定義，但其必須是參考 {0}

# InvalidGetDeclarationNameMultipleDeclarators
source: Called GetDeclarationName for a declaration node that can possibly contain multiple variable declarators.
cs: Proběhlo volání funkce GetDeclarationName kvůli uzlu deklarací, který by mohl obsahovat několik variabilních deklarátorů.
de: GetDeclarationName wurde für einen Deklarationsknoten aufgerufen, der möglicherweise mehrere Variablendeklaratoren enthalten kann.
es: Se ha llamado a GetDeclarationName para un nodo de declaración que puede contener varios declaradores de variables.
fr: GetDeclarationName appelé pour un nœud de déclaration susceptible de contenir plusieurs déclarateurs de variable.
it: È stato chiamato GetDeclarationName per un nodo di dichiarazione che può contenere più dichiarazioni di variabile.
ja: 複数の変数宣言子を含んでいる可能性がある宣言ノードに対して GetDeclarationName を呼び出しました。
ko: 여러 변수 선언자를 포함할 수 있는 선언 노드에 대해 호출된 GetDeclarationName입니다.
pl: Wywołano metodę GetDeclarationName dla węzła deklaracji, który może zawierać wiele deklaratorów zmiennych.
pt_br: GetDeclarationName chamado para um nó de declaração que possivelmente pode conter múltiplos declaradores variáveis.
ru: GetDeclarationName вызывается для узла объявления, который может содержать множество операторов объявления переменных.
tr: Birden çok değişken bildirimcisi içerebilecek bir bildirim düğümü için GetDeclarationName çağrıldı.
zh_hans: 为可能包含多个变量声明符的声明节点调用了 GetDeclarationName。
zh_hant: 為可能包含多重變數宣告子的宣告節點，呼叫了 GetDeclarationName。

# PositionIsNotWithinSyntax
source: Position is not within syntax tree with full span {0}
cs: Pozice není v rámci stromu syntaxe s plným rozpětím {0}.
de: Die Position ist nicht innerhalb des Syntaxbaums mit dem Vollbereich {0}.
es: La posición no está dentro del árbol de sintaxis con el intervalo completo {0}
fr: La position ne se trouve pas dans l'étendue complète {0} de l'arborescence de syntaxe
it: Position non è compreso nell'albero della sintassi con full span {0}
ja: 場所が全スパン {0} の構文ツリー内にありません
ko: {0} 전체 범위를 사용한 구문 트리 내에 위치가 없습니다.
pl: Pozycja nie znajduje się w drzewie składni o pełnym zasięgu {0}
pt_br: Posição não está dentro da árvore de sintaxe com intervalo total {0}
ru: Позиция не находится в пределах синтаксического дерева с полным диапазоном {0}.
tr: Konum, tam kapsam {0} ile sözdizimi ağacı içinde değil
zh_hans: 位置不在具有完整范围 {0} 的语法树中
zh_hant: 位置不在有完整範圍 {0} 的語法樹狀結構內

# WRN_BadUILang
source: The language name '{0}' is invalid.
cs: Název jazyka {0} je neplatný.
de: Der Sprachenname "{0}" ist ungültig.
es: El nombre de idioma '{0}' no es válido.
fr: Le nom de langue '{0}' n'est pas valide.
it: Il nome del linguaggio '{0}' non è valido.
ja: 言語名 '{0}' は無効です。
ko: {0}' 언어 이름이 잘못되었습니다.
pl: Nazwa języka „{0}” jest nieprawidłowa.
pt_br: O nome de idioma "{0}" é inválido.
ru: Недопустимое имя языка "{0}".
tr: Dil adı '{0}' geçersiz.
zh_hans: 语言名“{0}”无效。
zh_hant: 語言名稱 '{0}' 無效。

# WRN_BadUILang_Title
source: The language name is invalid
cs: Název jazyka je neplatný.
de: Der Sprachenname ist ungültig.
es: El nombre de idioma no es válido
fr: Le nom de ce langage n'est pas correct
it: Il nome del linguaggio non è valido
ja: 言語名が無効です
ko: 언어 이름이 잘못되었습니다.
pl: Nazwa języka jest nieprawidłowa
pt_br: O nome do idioma é inválido
ru: Имя языка недопустимо
tr: Dil adı geçersiz
zh_hans: 语言名无效
zh_hant: 語言名稱無效
