Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_LambdaExplicitReturnTypeVar
source: The contextual keyword 'var' cannot be used as an explicit lambda return type
cs: Kontextové klíčové slovo var se nedá použít jako explicitní návratový typ lambda.
fr: Le mot clé contextuel 'var' ne peut pas être utilisé comme type de retour lambda explicite
it: Non è possibile usare la parola chiave contestuale 'var' come tipo restituito dell’espressione lambda
ja: コンテキスト キーワード "var" を明示的なラムダ戻り値の型として使用することはできません
pl: Kontekstowego słowa kluczowego „var” nie można użyć jako jawnego zwracanego typu lambda
pt_br: A palavra-chave contextual 'var' não pode ser usada como um tipo de retorno de lambda explícito
ru: Контекстное ключевое слово "var" нельзя использовать в качестве явного типа возвращаемого значения лямбда-выражения
zh_hans: 上下文关键字 “var” 不能用作显式 lambda 返回类型
zh_hant: 內容關鍵字 'var' 不得做為明確的 Lambda 傳回型別

# ERR_LambdaWithAttributesToExpressionTree
source: A lambda expression with attributes cannot be converted to an expression tree
cs: Výraz lambda s atributy nejde převést na strom výrazu.
fr: Une expression lambda avec un corps d'instruction ne peut pas être convertie en arborescence de l'expression
it: Non è possibile convertire un'espressione lambda con attributi in un albero delle espressioni
ja: 属性を含むラムダ式は、式ツリーに変換できません
pl: Nie można przekonwertować wyrażenia lambda z atrybutami na drzewo wyrażeń
pt_br: Uma expressão lambda com atributos não pode ser convertida em uma árvore de expressão
ru: Невозможно преобразовать лямбда-выражение с атрибутами в дерево выражения
zh_hans: 无法将具有属性的 lambda 表达式转换为表达式树
zh_hant: 具有屬性的 Lambda 運算式，不可轉換成運算式樹狀架構

# ERR_LanguageVersionDoesNotSupportInterfaceImplementationForMember
source: '{0}' cannot implement interface member '{1}' in type '{2}' because feature '{3}' is not available in C# {4}. Please use language version '{5}' or greater.
cs: {0} nemůže implementovat člen rozhraní {1} v typu {2}, protože funkce {3} není v jazyce C# {4} k dispozici. Použijte prosím verzi jazyka {5} nebo vyšší.
fr: '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}', car la fonctionnalité '{3}' n'est pas disponible en C# {4}. Utilisez la version de langage '{5}' ou une version ultérieure.
it: '{0}' non può implementare il membro di interfaccia '{1}' nel tipo '{2}' perché la funzionalità '{3}' non è disponibile in C# {4}. Usare la versione '{5}' o versioni successive del linguaggio.
ja: 機能 '{3}' は C# {4} では使用できないため、'{0}' は型 '{2}' のインターフェイス メンバー '{1}' を実装できません。'{5}' 以上の言語バージョンをご使用ください。
pl: Element „{0}” nie może implementować składowej interfejsu „{1}” w typie „{2}”, ponieważ funkcja „{3}” nie jest dostępna w języku C# {4}. Użyj wersji języka „{5}” lub nowszej.
pt_br: '{0}' não pode implementar o membro de interface '{1}' no tipo '{2}' porque o recurso '{3}' não está disponível no C# {4}. Use a versão de linguagem '{5}' ou superior.
ru: "{0}" не может реализовать член интерфейса "{1}" в типе "{2}", так как функция "{3}" недоступна в C# {4}. Используйте версию языка "{5}" или более позднюю.
zh_hans: “{0}”无法在类型 "{2}" 中实现接口成员 "{1}", 因为功能 "{3}" 在 c # {4} 中不可用。请使用语言版本 "{5}" 或更高版本。
zh_hant: 因為功能 '{3}' 不適用於 C# {4}，所以 '{0}' 無法在類型 '{2}' 中實作介面成員 '{1}'。請使用語言 '{5}' 版或更新版本。

# ERR_LineContainsDifferentWhitespace
source: Line contains different whitespace than the closing line of the raw string literal: '{0}' versus '{1}'
cs: Řádek obsahuje jiné prázdné znaky než ukončovací řádek literálu nezpracovaného řetězce: {0} versus {1}
fr: La ligne contient un espace blanc différent de la ligne de fermeture du littéral de chaîne brute : '{0}' par rapport à '{1}'
it: La riga contiene spazi vuoti diversi rispetto alla riga di chiusura del valore letterale stringa non elaborata: '{0}' rispetto a '{1}'
ja: 行に、生文字列リテラルの終了行とは異なる空白が含まれています: '{0}'と'{1}'
pl: Wiersz zawiera inny biały znak niż wiersz zamykający literału nieprzetworzonego ciągu: „{0}” a „{1}”
pt_br: A linha contém espaços em branco diferentes dos da linha de fechamento da literal de cadeia de caracteres bruta: “{0}” x “{1}”
ru: Строка содержит пробел, отличный от пробела закрывающей строки литерала необработанной строки: {0} и {1}
zh_hans: 行包含的空格与原始字符串字面量的右行不同: '{0}' 与 '{1}'
zh_hant: 行包含與原始字串常值結尾行不同的空白: '{0}' 與 '{1}'

# ERR_LineDoesNotStartWithSameWhitespace
source: Line does not start with the same whitespace as the closing line of the raw string literal.
cs: Řádek nezačíná stejným prázdným znakem jako ukončovací řádek literálu nezpracovaného řetězce.
fr: La ligne ne commence pas par le même espace que la dernière ligne du littéral de chaîne brute.
it: La riga non inizia con lo stesso spazio vuoto della riga di chiusura del valore letterale stringa non elaborata.
ja: 行の先頭が生文字列リテラルの終了行と同じ空白ではありません。
pl: Wiersz nie rozpoczyna się od tego samego odstępu co wiersz zamykający literału nieprzetworzonego ciągu.
pt_br: A linha não começa com o mesmo espaço em branco que a linha de fechamento da literal de cadeia de caracteres bruta.
ru: Строка не начинается с того же пробела, что и закрывающая строка литерала необработанной строки.
zh_hans: 行开头的空格与原始字符串字面量的右行不相同。
zh_hant: 行開頭的空白與原始字串常值結尾行的空白不同。

# ERR_LineSpanDirectiveEndLessThanStart
source: The #line directive end position must be greater than or equal to the start position
cs: Koncová pozice direktivy #line musí být vyšší nebo rovna počáteční pozici.
fr: La position finale de la directive #line doit être supérieure ou égale à la position initiale.
it: La posizione finale della direttiva #line deve essere maggiore o uguale alla posizione iniziale
ja: #line ディレクティブの終了位置は、開始位置と同じかそれ以上でなければなりません
pl: Pozycja końcowa dyrektywy #line musi być większa lub równa pozycji początkowej
pt_br: A posição final da diretiva #line deve ser maior ou igual à posição inicial
ru: Позиция окончания директивы #line должна больше или равна позиции начала
zh_hans: #line 指令结束位置必须大于或等于起始位置
zh_hant: #line 指示詞結束位置必須大於或等於開始位置

# ERR_LineSpanDirectiveInvalidValue
source: The #line directive value is missing or out of range
cs: Hodnota direktivy #line chybí nebo je mimo rozsah.
fr: La valeur de directive #line est manquante ou hors limites
it: Il valore della direttiva #line manca oppure non è compreso nell'intervallo
ja: #line ディレクティブの値が見つからないか、範囲外です
pl: Brak wartości dyrektywy #line lub jest ona poza zakresem
pt_br: O valor da diretiva de #line está ausente ou fora do intervalo
ru: Значение директивы #line отсутствует или находится за пределами допустимого диапазона
zh_hans: #line 指令值缺失或超出范围
zh_hant: #line 指示詞值遺漏或超出範圍

# ERR_LineSpanDirectiveRequiresSpace
source: The #line span directive requires space before the first parenthesis, before the character offset, and before the file name
cs: Direktiva #line span vyžaduje mezeru před první závorkou, před posunem znaku a před názvem souboru.
fr: La directive span #line requiert un espace avant la première parenthèse, avant le décalage du caractère et avant le nom du fichier
it: La direttiva #line span richiede uno spazio prima della prima parentesi, prima dell'offset dei caratteri e prima del nome del file
ja: #line span ディレクティブには、最初のかっこの前、文字オフセットの前、ファイル名の前にスペースが必要です
pl: Dyrektywa zakresu #line wymaga spacji przed pierwszym nawiasem, przed przesunięciem znaku i przed nazwą pliku
pt_br: A #line de intervalo requer espaço antes do primeiro parêntese, antes do deslocamento do caractere e antes do nome do arquivo
ru: Для директивы диапазона #line требуется пробел перед первой скобкой. перед смещением символа и перед именем файла
zh_hans: #line span 指令要求第一个圆括号之前、字符偏移量之前和文件名之前要有空格
zh_hant: #line span 指示詞的第一個括弧前、字元位移前及檔案名前需要空格

# ERR_ListPatternRequiresLength
source: List patterns may not be used for a value of type '{0}'. No suitable 'Length' or 'Count' property was found.
cs: Vzory seznamů nelze použít pro hodnotu typu {0}. Nenašla se žádná vhodná vlastnost Length nebo Count.
fr: Les modèles de liste ne peuvent pas être utilisés pour une valeur de type '{0}'. Aucune propriété 'Longueur' ou 'Compte' appropriée n’a été trouvée.
it: I criteri di elenco non possono essere utilizzati per un valore di tipo '{0}'. Non è stata trovata alcuna proprietà 'Length' o 'Count' appropriata.
ja: リスト パターンは、型 '{0}' の値には使用できません。適切な 'Length' または 'Count' プロパティが見つかりませんでした。
pl: Wzorce listy nie mogą być używane dla wartości typu „{0}”. Nie znaleziono odpowiedniej właściwości „Długość” ani „Liczba”.
pt_br: Padrões de lista não podem ser usados para um valor do tipo “{0}”. Nenhuma propriedade “Length” ou “Count” adequada foi encontrada.
ru: Шаблоны списка не могут использоваться для значения типа {0}. Подходящее свойство \"Length\" или \"Count\" не найдено.
zh_hans: 列表模式不能用于 '{0}' 类型的值。找不到合适的 \"Length\" 或 \"Count\" 属性。
zh_hant: 清單模式不能用於型別 '{0}' 的值。找不到適當的 'Length' 或 'Count' 屬性。

# ERR_LocalSameNameAsExtensionParameter
source: '{0}': a parameter, local variable, or local function cannot have the same name as an extension parameter
pt_br: "{0}": um parâmetro, variável local ou função local não pode ter o mesmo nome que um parâmetro de extensão

# ERR_LocalSameNameAsExtensionTypeParameter
source: '{0}': a parameter, local variable, or local function cannot have the same name as an extension container type parameter
pt_br: "{0}": um parâmetro, variável local ou função local não pode ter o mesmo nome que um parâmetro de tipo de contêiner de extensão

# ERR_MemberNameSameAsExtendedType
source: '{0}': extension member names cannot be the same as their extended type
pt_br: "{0}": nomes de membros de extensão não podem ser iguais ao tipo estendido

# ERR_MethFuncPtrMismatch
source: No overload for '{0}' matches function pointer '{1}'
cs: Žádná přetížená metoda {0} neodpovídá ukazateli na funkci {1}.
fr: Aucune surcharge pour '{0}' ne correspond au pointeur de fonction '{1}'
it: Nessun overload per '{0}' corrisponde al puntatore a funzione '{1}'
ja: 関数ポインター '{1}' に一致する '{0}' のオーバーロードはありません
pl: Żadne z przeciążeń dla elementu „{0}” nie pasuje do wskaźnika funkcji „{1}”
pt_br: Nenhuma sobrecarga de '{0}' corresponde ao ponteiro de função '{1}'
ru: Нет перегруженного метода для "{0}", который соответствует указателю на функцию "{1}".
zh_hans: “{0}”没有与函数指针“{1}”匹配的重载
zh_hant: '{0}' 沒有任何多載符合函式指標 '{1}'

# ERR_MethodImplAttributeAsyncCannotBeUsed
source: 'MethodImplAttribute.Async' cannot be manually applied to methods. Mark the method 'async'.
pt_br: "MethodImplAttribute.Async" não pode ser aplicado manualmente aos métodos. Marque o método como "async".

# ERR_MisplacedExtension
source: An extension member syntax is disallowed in nested position within an extension member syntax
pt_br: Uma sintaxe de membro de extensão não é permitida na posição aninhada dentro de uma sintaxe de membro de extensão

# ERR_MisplacedRecord
source: Unexpected keyword 'record'. Did you mean 'record struct' or 'record class'?
cs: Neočekávané klíčové slovo record. Měli jste na mysli record struct nebo record class?
fr: Mot clé 'record' inattendu. Vouliez-vous dire « struct d’enregistrement » ou « classe d’enregistrement » ?
it: Parola chiave 'record' imprevista. Si intendeva 'struct record' o 'classe record'?
ja: 予期しないキーワード 'record' です。'record struct' または 'record class' のつもりでしたか?
pl: Nieoczekiwane słowo kluczowe „record”. Czy chodziło o „record struct” lub „record class”?
pt_br: Palavra-chave inesperada “record”. Você quis dizer “record struct” or “record class”?
ru: Непредвиденное ключевое слово \"record\". Возможно, вы имели в виду \"record struct\" или \"record class\"?
zh_hans: 意外的关键字 \"record\"。你的意思是 \"record struct\" 还是 \"record class\"?
zh_hant: 未預期的關鍵字 'record'。您是指 'record struct' 或 'record class'?

# ERR_MisplacedSlicePattern
source: Slice patterns may only be used once and directly inside a list pattern.
cs: Vzory řezů se dají použít jenom jednou a přímo uvnitř vzoru seznamu.
fr: Les modèles de tranche ne peuvent être utilisés qu'une seule fois et directement à l'intérieur d'un modèle de liste.
it: I modelli di sezione possono essere usati solo una volta e direttamente all'interno di un modello di elenco.
ja: スライス パターンは、1 回限り、リスト パターン内で直接使用される可能性があります。
pl: Wzorce wycinków mogą być używane tylko raz i bezpośrednio wewnątrz wzorca listy.
pt_br: Os padrões de fatia somente podem ser usados uma vez e diretamente dentro de um padrão de lista.
ru: Шаблоны среза можно использовать только один раз и непосредственно внутри шаблона списка.
zh_hans: 切片模式只能使用一次，并且直接在列表模式内使用。
zh_hant: 切片模式只能在清單模式中使用一次且直接使用。

# ERR_MisplacedUnchecked
source: Unexpected keyword 'unchecked'
cs: Neočekávané klíčové slovo unchecked
fr: Mot clé inattendu 'unchecked'
it: Parola chiave imprevista 'unchecked'
ja: 予期しないキーワード 'unchecked'
pl: Nieoczekiwane słowo kluczowe „unchecked”
pt_br: Palavra-chave inesperada 'unchecked'
ru: Непредвиденное ключевое слово "unchecked"
zh_hans: 意外的关键字“未选中”
zh_hant: 未預期的關鍵字 'unchecked'

# ERR_MissingAddressOf
source: Cannot convert method group to function pointer (Are you missing a '&'?)
cs: Skupina metod se nedá převést na ukazatel na funkci (nechybí &)?
fr: Impossible de convertir le groupe de méthodes en pointeur de fonction (manque-t-il un '&' ?)
it: Non è possibile convertire il gruppo di metodi nel puntatore a funzione. Manca un operatore '&'?
ja: メソッド グループを関数ポインターに変換できません ('&' が抜けていないか確認してください)
pl: Nie można przekonwertować grupy metod na wskaźnik funkcji (może brakuje znaku „&”?)
pt_br: Não é possível converter o grupo de métodos no ponteiro de função (Está faltando um '&'?)
ru: Не удается преобразовать группу методов в указатель на функцию. (Возможно, пропущен "&"?)
zh_hans: 无法将方法组转换为函数指针(是否缺少 "&"?)
zh_hant: 無法將方法群組轉換成函式指標 (您是否缺少 '&'?)

# ERR_MissingPattern
source: Pattern missing
cs: Chybějící vzor
de: Muster fehlt.
es: Falta un patrón.
fr: Modèle manquant
it: Criterio mancante
ja: パターンがありません
ko: 패턴이 없습니다.
pl: Brak wzorca
pt_br: Padrão ausente
ru: Отсутствует шаблон
tr: Desen eksik
zh_hans: 模式缺失
zh_hant: 缺少模式

# ERR_ModifierOnUnnamedReceiverParameter
source: Cannot use modifiers on the unnamed receiver parameter of extension block
pt_br: Não é possível usar modificadores no parâmetro de receptor sem nome do bloco de extensão

# ERR_ModuleInitializerCannotBeUnmanagedCallersOnly
source: Module initializer cannot be attributed with 'UnmanagedCallersOnly'.
cs: Inicializátor modulu nemůže mít atribut UnmanagedCallersOnly.
fr: L'initialiseur de module ne peut pas être attribué avec 'UnmanagedCallersOnly'.
it: Non è possibile aggiungere all'inizializzatore di modulo l'attributo 'UnmanagedCallersOnly'.
ja: モジュール初期化子に 'UnmanagedCallersOnly' 属性を設定することはできません。
pl: Inicjator modułu nie może mieć atrybutu „UnmanagedCallersOnly”.
pt_br: O inicializador de módulo não pode ser atribuído com 'UnmanagedCallersOnly'.
ru: Инициализатор модуля не может иметь атрибут "UnmanagedCallersOnly".
zh_hans: 无法使用 "UnmanagedCallersOnly" 对模块初始值设定项进行特性化。
zh_hant: 無法使用 'UnmanagedCallersOnly' 將模組初始設定式屬性化。

# ERR_ModuleInitializerMethodAndContainingTypesMustNotBeGeneric
source: Module initializer method '{0}' must not be generic and must not be contained in a generic type
cs: Inicializační metoda modulu {0} nemůže být obecná a nesmí obsahovat obecný typ.
fr: La méthode d'initialiseur de module '{0}' ne doit pas être générique et ne doit pas être contenue dans un type générique
it: Il metodo '{0}' dell'inizializzatore di modulo non deve essere generico e non deve essere contenuto in un tipo generico
ja: モジュール初期化子メソッド '{0}' をジェネリックにすることはできず、ジェネリック型に含めることはできません
pl: Metoda inicjatora modułu „{0}” nie może być ogólna i nie może być zawarta w typie ogólnym
pt_br: O método inicializador do módulo '{0}' não pode ser genérico e não pode estar contido em um tipo genérico
ru: Метод инициализатора модуля "{0}" не должен быть универсальным и не должен содержаться в универсальном типе.
zh_hans: 模块初始值设定项方法“{0}”不能是泛型的，且不得包含在泛型类型中
zh_hant: 模組初始設定式方法 '{0}' 不得為泛型，且不得包含在泛型型別中

# ERR_ModuleInitializerMethodMustBeAccessibleOutsideTopLevelType
source: Module initializer method '{0}' must be accessible at the module level
cs: Inicializační metoda modulu {0} musí být přístupná na úrovni modulu.
fr: La méthode d'initialiseur de module '{0}' doit être accessible au niveau du module
it: Il metodo '{0}' dell'inizializzatore di modulo deve essere accessibile a livello di modulo
ja: モジュール初期化子メソッド '{0}' はモジュール レベルでアクセス可能である必要があります
pl: Metoda inicjatora modułu „{0}” musi być dostępna na poziomie modułu
pt_br: O método inicializador do módulo '{0}' precisa estar acessível no nível do módulo
ru: Метод инициализатора модуля "{0}" должен быть доступен на уровне модуля.
zh_hans: 模块初始值设定项方法“{0}”必须可在模块级别被访问
zh_hant: 模組初始設定式方法 '{0}' 必須可在模組層級中存取

# ERR_ModuleInitializerMethodMustBeOrdinary
source: A module initializer must be an ordinary member method
cs: Inicializátor modulu musí být běžná členská metoda.
fr: Un initialiseur de module doit être une méthode membre ordinaire
it: Un inizializzatore di modulo deve essere un metodo membro normale
ja: モジュール初期化子は通常のメンバー メソッドでなければなりません
pl: Inicjator modułu musi być zwykłą metodą składową
pt_br: Um inicializador de módulo precisa ser um método de membro comum
ru: Инициализатор модуля должен быть обычным методом-элементом.
zh_hans: 模块初始值设定项必须是普通成员方法
zh_hant: 模組初始設定式必須是一般成員方法

# ERR_ModuleInitializerMethodMustBeStaticParameterlessVoid
source: Module initializer method '{0}' must be static, and non-virtual, must have no parameters, and must return 'void'
cs: Metoda inicializátoru modulu „{0}“ musí být statická a ne virtual, nesmí mít žádné parametry a musí vracet void.
fr: La méthode d’initialiseur de module '{0}' doit être statique et non virtuelle. Elle ne doit avoir aucun paramètre et doit retourner 'void'.
it: Il metodo '{0}' dell'inizializzatore di modulo deve essere statico e non virtuale, non deve contenere parametri e deve restituire 'void'
ja: モジュール初期化子メソッド '{0}' は、static でなければならず、仮想であってはならず、パラメーターを持ってはならず、'void' を返す必要があります
pl: Metoda inicjatora modułu „{0}” musi być statyczna, nie wirtualna, nie może mieć parametrów i musi zwracać typ „void”
pt_br: O método inicializador de módulo '{0}' deve ser estático e não virtual, não deve ter parâmetros e deve retornar 'void'
ru: Метод инициализатора модуля "{0}" должен быть статическим, не должен быть виртуальным, у него не должно быть параметров, он должен возвращать "void"
zh_hans: 模块初始化表达式方法 "{0}" 必须是静态且非虚拟的，不能有任何参数，必须返回 "void"
zh_hant: 模組初始設定式方法 '{0}' 必須是靜態且非虛擬，不得具有任何參數，而且必須傳回 'void'

# ERR_MultipleAnalyzerConfigsInSameDir
source: Multiple analyzer config files cannot be in the same directory ('{0}').
cs: Ve stejném adresáři nemůže být více konfiguračních souborů analyzátoru ({0}).
de: Dasselbe Verzeichnis ({0}) darf nicht mehrere Konfigurationsdateien des Analysetools enthalten.
es: No es posible que un mismo directorio ("{0}") contenga varios archivos de configuración del analizador.
fr: Plusieurs fichiers config d'analyseur ne peuvent pas figurer dans le même répertoire ('{0}').
it: La stessa directory ('{0}') non può contenere più file di configurazione dell'analizzatore.
ja: 複数のアナライザー構成ファイルを同じディレクトリに入れることはできません ('{0}')。
ko: 분석기 구성 파일 여러 개가 동일한 디렉터리('{0}')에 있을 수 없습니다.
pl: Wiele plików konfiguracji analizatora nie może znajdować się w tym samym katalogu („{0}”).
pt_br: Não é possível que haja vários arquivos de configuração do analisador no mesmo diretório ('{0}').
ru: В одном каталоге ("{0}") не может находиться несколько файлов конфигурации анализатора.
tr: Birden çok çözümleyici yapılandırma dosyası aynı dizinde ('{0}') olamaz.
zh_hans: 多个分析器配置文件不能位于同一目录({0})中。
zh_hant: 多個分析器組態檔無法處於相同目錄 ('{0}') 中。

# ERR_MultipleEnumeratorCancellationAttributes
source: The attribute [EnumeratorCancellation] cannot be used on multiple parameters
cs: Atribut [EnumeratorCancellation] nejde použít na víc parametrů.
de: Das Attribut [EnumeratorCancellation] kann nicht für mehrere Parameter verwendet werden.
es: El atributo [EnumeratorCancellation] no se puede usar en varios parámetros
fr: Impossible d'utiliser l'attribut [EnumeratorCancellation] sur plusieurs paramètres
it: Non è possibile usare l'attributo [EnumeratorCancellation] in più parametri
ja: 属性 [EnumeratorCancellation] を複数のパラメーターで使用することはできません
ko: [EnumeratorCancellation] 특성은 여러 매개 변수에 사용할 수 없습니다.
pl: Nie można użyć atrybutu [EnumeratorCancellation] w wielu parametrach
pt_br: O atributo [EnumeratorCancellation] não pode ser usado em vários parâmetros
ru: Атрибут [EnumeratorCancellation] невозможно использовать для нескольких параметров.
tr: [EnumeratorCancellation] özniteliği birden çok parametre üzerinde kullanılamaz
zh_hans: 不可在多个参数上使用 [EnumeratorCancellation] 属性
zh_hant: 無法在多個參數上使用屬性 [EnumeratorCancellation]

# ERR_MultipleFileScopedNamespace
source: Source file can only contain one file-scoped namespace declaration.
cs: Zdrojový soubor může obsahovat pouze jednu deklaraci oboru názvů pro celý soubor.
fr: Le fichier source ne peut contenir qu’une seule déclaration d’espace de noms d’étendue de fichier.
it: Il file di origine può contenere solo una dichiarazione di spazio dei nomi con ambito file.
ja: ソース ファイルには、ファイルスコープ付きの名前空間の宣言を 1 つだけ含めることができます。
pl: Plik źródłowy może zawierać tylko jedną deklarację przestrzeni nazw z określonym zakresem plików.
pt_br: O arquivo de origem só pode conter uma declaração de namespace de escopo de arquivo.
ru: Исходный файл может содержать только одно объявление пространства имен с файловой областью.
zh_hans: 源文件只能包含一个文件范围内的命名空间声明。
zh_hant: 來源檔案只能包含一個以檔案為範圍的命名空間宣告。

# ERR_MultipleRecordParameterLists
source: Only a single partial type declaration may have a parameter list
cs: Seznam parametrů může obsahovat pouze jedna deklarace částečného typu.
fr: Seule une déclaration de type partiel d’un seul enregistrement peut avoir une liste de paramètres.
it: Solo una dichiarazione parziale di singolo record può includere un elenco di parametri
ja: 単一の部分型宣言のみがパラメーター リストを持つことができます
pl: Tylko pojedyncza deklaracja typu częściowego może mieć listę parametrów
pt_br: Apenas uma declaração de tipo parcial simples pode ter uma lista de parâmetros
ru: Только отдельное объявление разделяемого типа может содержать список параметров
zh_hans: 只有一个分部类型声明可以拥有参数列表
zh_hant: 只有單一部分類型宣告可以有參數清單

# ERR_NamedArgumentForInlineArray
source: An inline array access may not have a named argument specifier
fr: Un accès au tableau en ligne peut ne pas avoir de spécificateur d'argument nommé
it: Un accesso a matrice inline non può includere un identificatore di argomento denominato
ja: インライン配列のアクセスには名前付き引数の指定子を指定できません
pl: Dostęp do tablicy śródwierszowej nie może mieć specyfikatora argumentu nazwanego
pt_br: Um acesso à matriz não pode ter um especificador de argumento nomeado
ru: Доступ к встроенному массиву может не иметь спецификатора именованного аргумента.
zh_hans: 内联数组访问可能没有命名参数说明符
zh_hant: 內嵌陣列存取不能有具名引數指定名稱

# ERR_NameofExtensionMember
source: Extension members are not allowed as an argument to 'nameof'.
pt_br: Membros de extensão não são permitidos como um argumento para "nameof".

# ERR_NewBoundWithUnmanaged
source: The 'new()' constraint cannot be used with the 'unmanaged' constraint
cs: Omezení new() nejde používat s omezením unmanaged.
de: Die new()-Einschränkung kann nicht mit der unmanaged-Einschränkung verwendet werden.
es: La restricción "new()" no se puede utilizar con la restricción "unmanaged"
fr: La contrainte 'new()' ne peut pas être utilisée avec la contrainte 'unmanaged'
it: Non è possibile usare il vincolo 'new()' con il vincolo 'unmanaged'
ja: new()' 制約は 'unmanaged' 制約と一緒には使用できません
ko: new()' 제약 조건은 'unmanaged' 제약 조건과 함께 사용할 수 없습니다.
pl: Ograniczenie „new()” nie może być używane z ograniczeniem „unmanaged”
pt_br: A restrição 'new()' não pode ser usada com a restrição 'unmanaged'
ru: Ограничение "new()" невозможно использовать вместе с ограничением "unmanaged"
tr: 'new()' kısıtlaması, 'unmanaged' kısıtlamasıyla kullanılamaz
zh_hans: "new()" 约束不能与 "unmanaged" 约束一起使用
zh_hant: new()' 條件約束不能和 'unmanaged' 條件約束一起使用
