Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_CSCHelp
source: Visual C# Compiler Options - OUTPUT FILES - -out:<file> Specify output file name (default: base name of file with main class or first file) -target:exe Build a console executable (default) (Short form: -t:exe) -target:winexe Build a Windows executable (Short form: -t:winexe) -target:library Build a library (Short form: -t:library) -target:module Build a module that can be added to another assembly (Short form: -t:module) -target:appcontainerexe Build an Appcontainer executable (Short form: -t:appcontainerexe) -target:winmdobj Build a Windows Runtime intermediate file that is consumed by WinMDExp (Short form: -t:winmdobj) -doc:<file> XML Documentation file to generate -refout:<file> Reference assembly output to generate -platform:<string> Limit which platforms this code can run on: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred, or anycpu. The default is anycpu. - INPUT FILES - -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications -reference:<alias>=<file> Reference metadata from the specified assembly file using the given alias (Short form: -r) -reference:<file list> Reference metadata from the specified assembly files (Short form: -r) -addmodule:<file list> Link the specified modules into this assembly -link:<file list> Embed metadata from the specified interop assembly files (Short form: -l) -analyzer:<file list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. -embed Embed all source files in the PDB. -embed:<file list> Embed specific files in the PDB. - RESOURCES - -win32res:<file> Specify a Win32 resource file (.res) -win32icon:<file> Use this icon for the output -win32manifest:<file> Specify a Win32 manifest file (.xml) -nowin32manifest Do not include the default Win32 manifest -resource:<resinfo> Embed the specified resource (Short form: -res) -linkresource:<resinfo> Link the specified resource to this assembly (Short form: -linkres) Where the resinfo format is <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] Emit debugging information -debug:{full|pdbonly|portable|embedded} Specify debugging type ('full' is default, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the target .dll or .exe) -optimize[+|-] Enable optimizations (Short form: -o) -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -warnaserror[+|-] Report all warnings as errors -warnaserror[+|-]:<warn list> Report specific warnings as errors (use "nullable" for all nullability warnings) -warn:<n> Set warning level (0 or higher) (Short form: -w) -nowarn:<warn list> Disable specific warning messages (use "nullable" for all nullability warnings) -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -checked[+|-] Generate overflow checks -unsafe[+|-] Allow 'unsafe' code -define:<symbol list> Define conditional compilation symbol(s) (Short form: -d) -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `latest` (latest version, including minor versions), `default` (same as `latest`), `latestmajor` (latest version, excluding minor versions), `preview` (latest version, including features in unsupported preview), or specific versions like `6` or `7.1` -nullable[+|-] Specify nullable context option enable|disable. -nullable:{enable|disable|warnings|annotations} Specify nullable context option enable|disable|warnings|annotations. - SECURITY - -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key -keyfile:<file> Specify a strong name key file -keycontainer:<string> Specify a strong name key container -highentropyva[+|-] Enable high-entropy ASLR - MISCELLANEOUS - @<file> Read response file for more options -help Display this usage message (Short form: -?) -nologo Suppress compiler copyright message -noconfig Do not auto include CSC.RSP file -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<address> Base address for the library to be built -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<n> Specify the codepage to use when opening source files -utf8output Output compiler messages in UTF-8 encoding -main:<type> Specify the type that contains the entry point (ignore all other possible entry points) (Short form: -m) -fullpaths Compiler generates fully qualified paths -filealign:<n> Specify the alignment used for output file sections -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -pdb:<file> Specify debug information file name (default: output file name with .pdb extension) -errorendlocation Output line and column of the end location of each error -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -sdkpath:<path> Path used to search for standard library assemblies. -nostdlib[+|-] Do not reference standard library (mscorlib.dll) -subsystemversion:<string> Specify subsystem version of this assembly -lib:<file list> Specify additional directories to search in for references -errorreport:<string> Specify how to handle internal compiler errors: prompt, send, queue, or none. The default is queue. -appconfig:<file> Specify an application configuration file containing assembly binding settings -moduleassemblyname:<string> Name of the assembly which this module will be a part of -modulename:<string> Specify the name of the source module -generatedfilesout:<dir> Place files generated during compilation in the specified directory. -reportivts[+|-] Output information on all IVTs granted to this assembly by all dependencies, and annotate foreign assembly accessibility errors with what assembly they came from.
it: Opzioni del Compilatore Visual C# - FILE DI OUTPUT - -out:<file> Specifica il nome del file di output (impostazione predefinita: nome di base di file con classe principale o primo file) -target:exe Consente di compilare un eseguibile della console (impostazione predefinita) (forma breve: -t:exe) -target:winexe Crea un eseguibile di Windows (forma breve: -t:winexe) -target:library Consente di compilare una libreria (forma breve: -t:library) target:module Compila un modulo che può essere aggiunto ad altro assembly (forma breve: -t:module) -target:appcontainerexe Consente di creare un eseguibile di Appcontainer (forma breve: -t:appcontainerexe) -target:winmdobj Consente di compilare un file intermedio Windows Runtime che viene utilizzato da WinMDExp (forma breve: -t:winmdobj) -doc:<file> Genera un file di documentazione XML per generare -refout:<file> Output dell'assembly di riferimento da generare -platform:<string> Limita le piattaforme in cui è possibile eseguire questo codice su x86, Itanium, x64, arm, arm64, anycpu32bitpreferred o anycpu. Il valore predefinito è anycpu. - FILE DI INPUT - -recurse:<wildcard> Include tutti i file presenti nella directory corrente e nelle relative sottodirectory in base alle specifiche dei caratteri jolly -reference:<alias>=<file> Metadati di riferimento dai file di assembly specificati usando l'alias specificato (forma breve: -r) /reference:<file list> Metadati di riferimento dai file di assembly specificati. (Forma breve: -r) -addmodule:< list> Collega i moduli specificati in questo assembly -link:<file_list> Incorpora metadati dai file dell'assembly di interoperabilità specificato. (Forma breve: -r) -analyzer:<file_list> Esegue gli analizzatori dall'assembly Forma breve: -a -additionalfile:<file list> File aggiuntivi che non influiscono direttamente sulla generazione del codice ma possono essere usati dagli analizzatori per produrre errori o avvisi. -embed Incorpora tutti i file di origine nel file PDB portabile. -embed:<file list> Incorporare file specifici nel PDB. - RISORSE - -win32res:<file> Specifica un file di risorse Win32 (.res) -win32icon:<file> Usa questa icona per l'output -win32manifest:<file> Specifica un file manifesto Win32 (con estensione xml) -nowin32manifest Non include il manifesto Win32 predefinito /resource:<resinfo> Incorpora la risorsa specificata. (Forma breve: -res) -linkresource:<resinfo> Collega la risorsa specificata a questo assembly (Forma breve: -linkres) Dove il formato resinfo è <file>[,<string name>[,public|private]] - GENERAZIONE DEL CODICE - -debug[+|-] Crea le informazioni di debug. -debug:{full|pdbonly|portable|embedded} Specificare il tipo di debug ('full' è l'impostazione predefinita, 'portable' è un formato multipiattaforma, 'embedded' è un formato multipiattaforma incorporato in DLL o EXE di destinazione. -optimize[+|-] Abilita le ottimizzazioni (forma breve: -o) -deterministic Produce un assembly deterministico (che include GUID e timestamp della versione del modulo) -refonly Produce un assembly di riferimento al posto dell'output principale -instrument:TestCoverage Produce un assembly instrumentato per raccogliere informazioni sulla copertura -sourcelink:<file> Informazioni sul collegamento all'origine da incorporare nel file PDB. - ERRORI E AVVISI - -warnaserror[+|-] Segnala tutti gli avvisi come errori. -warnaserror[+|-]:<warn list>Segnala determinati avvisi come errori (usare "nullable" per tutti gli avvisi del supporto dei valori null) -warn:<n> Imposta il livello di avviso (0 o superiore) (forma breve: -w) -nowarn:<warn list> Disabilita messaggi di avviso specifici (usare "nullable" per tutti gli avvisi del supporto dei valori null) -ruleset:<file> Consente di specificare un file di set di regole che disabilita diagnostica specifica. -errorlog:<file>[,version=<sarif_version>] Consente di specificare un file in cui registrare la diagnostica del compilatore e dell'analizzatore sarif_version:{1|2|2.1} L'impostazione predefinita è 1. 2 e 2.1 si riferiscono entrambi a SARIF versione 2.1.0. -reportanalyzer Restituisce informazioni aggiuntive dell'analizzatore, ad esempio il tempo di esecuzione. -skipanalyzers[+|-] Ignora l'esecuzione degli analizzatori diagnostici. - LINGUAGGIO - -checked[+|-] Generare controlli dell'overflow -unsafe[+|-] Consenti codice 'non sicuro' -define:<symbol_list> Dichiara simboli di compilazione (forma breve: -d) -langversion:? Visualizza i valori consentiti per la versione del linguaggio -langversion:<string> Consente di specificare la versione del linguaggio, ad esempio `latest` (ultima versione che include versioni secondarie) `default` (uguale a `latest`), `latestmajor` (ultima versione che include versioni secondarie) `preview` (versione più recente, incluse le funzionalità nell'anteprima non supportata), o versioni specifiche come `6` o `7.1` -nullable[+|-] Specificare l'opzione di contesto che ammette i valori Null enable|disable. -nullable:{enable|disable|warnings|annotations} Specifica l'opzione di contesto che ammette i valori Null enable|disable|warnings|annotations. - SICUREZZA - -delaysign[+|-] Ritarda la firma dell'assembly usando solo la parte pubblica della della chiave con nome sicuro. -publicsign[+|-] Firma pubblicamente l'assembly usando solo la parte pubblica della chiave con nome sicuro. -keyfile:<file> Consente di specificare un file di chiave con nome sicuro. -keycontainer:<string> Consente di specificare un contenitore di chiavi con nome sicuro. -highentropyva[+|-] Abilita ASLR a entropia elevata. - VARIE - @<file> Legge il file di risposta per ulteriori opzioni /help Visualizza questo messaggio relativo all'uso. La forma breve è ? -nologo Non visualizza il messaggio di copyright del compilatore -noconfig Non include automaticamente il file CSC.RSP. -parallel[+|-] Compilazione simultanea. -version Visualizza il numero di versione del compilatore ed esce. - AVANZATE - -baseaddress:<address> Indirizzo di base della libreria da compilare -checksumalgorithm:<alg> Consente di specificare l'algoritmo per calcolare il checksum del file di origine archiviato nel file PDB. I valori supportati sono: SHA1 o SHA256 (impostazione predefinita). -codepage:<n> Specifica la tabella codici da utilizzare per l'apertura dei file di origine -utf8output Messaggi del compilatore di output nella codifica UTF-8 -main:<type> Specifica il tipo contenente il punto di ingresso (ignora tutti gli altri possibili punti di ingresso) (forma breve: -m) -fullpaths Il compilatore genera percorsi completi -filealign:<n> Consente di specificare l'allineamento usato per le sezioni del file di output. -pathmap:<K1>=<V1>,<K2>=<V2>,... Consente di specificare un mapping per i nomi di percorso di origine visualizzati dal compilatore. --pdb:<file> Specifica il nome del file di informazioni di debug (impostazione predefinita: nome del file di output con estensione pdb) --errorendlocation Riga di output e colonna della posizione finale di ogni di errore -preferreduilang Consente di specificare il nome del linguaggio di output preferito. -nosdkpath Disabilita la ricerca di assembly di librerie standard nel percorso predefinito dell'SDK. -nostdlib[+|-] Omette i riferimenti alle librerie standard (mscorlib.dll) -subsystemversion:<string> Consente di specificare la versione dell'assembly -lib:<file list> Specifica directory aggiuntive in cui cercare riferimenti -errorreport:<string> Consente di specificare come gestire gli errori interni del compilatore: prompt, invio, coda o nessuno. L'impostazione predefinita è coda. -appconfig:<file> Specifica un file di configurazione dell'applicazione contenente le impostazioni di associazione dell'assembly -moduleassemblyname:<string> Nome dell'assembly di cui farà parte questo modulo -modulename:<string> Specifica il nome del modulo di origine -generatedfilesout:<dir> Inserisce i file generati durante la compilazione nella directory specificata. -reportivts[+|-] Restituisce informazioni su tutti i tipi di I/O concessi a questo assembly da tutte le dipendenze e annota gli errori di accessibilità dell'assembly esterno da cui provengono.
pt_br: Opções do Compilador do Visual C# - ARQUIVOS DE SAÍDA - -out:<file> Especificar o nome do arquivo de saída (padrão: nome base do arquivo com classe principal ou primeiro arquivo) -target:exe Compilar um executável de console (padrão) (Curto form: -t:exe) -target:winexe Compilar um executável do Windows (Forma abreviada: -t:winexe) -target:library Compilar uma biblioteca (Forma abreviada: -t:library) -target:module Compilar um módulo que pode ser adicionado a outro assembly (Forma abreviada: -t:module) -target:appcontainerexe Compilar um Appcontainer executável (Forma abreviada: -t:appcontainerexe) -target:winmdobj Compilar um Windows Runtime intermediário que seja consumido pelo WinMDExp (Forma abreviada: -t:winmdobj) -doc:<file> Arquivo de Documentação XML para gerar -refout:<file> Saída do assembly de referência para gerar -platform:<string> Limitar em quais plataformas esse código pode ser executado: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred ou anycpu. O padrão é anycpu. - ARQUIVOS DE ENTRADA - -recurse:<wildcard> Incluir todos os arquivos no diretório e e subdiretórios atuais de acordo com as especificações -reference:<alias>=<file> Metadados de referência do arquivo do assembly especificado usando o alias fornecido (Forma abreviada: -r) -reference:<file list> Metadados de referência dos arquivos do assembly (Forma abreviada: -r) -addmodule:<file list> Vincular os módulos especificados nesse assembly -link:<file list> Incorporar os metadados dos arquivos do assembly (Forma abreviada: -l) -analyzer:<file list> Executar os analisadores desse assembly (Forma abreviada: -a) -additionalfile:<file list> Arquivos adicionais que não afetam diretamente a geração do código, mas podem ser usados por analisadores para produzirem erros ou avisos. -embed Inserir todos os arquivos de origem no PDB. -embed:<file list> Inserir arquivos específicos no PDB. - RECURSOS - -win32res:<file> Especificar um arquivo de recurso win32 (.res) -win32icon:<file> Usar este ícone para a saída -win32manifest:<file> Especificar um arquivo de manifesto do Win32 (.xml) -nowin32manifest Não incluir o manifesto do Win32 padrão -resource:<resinfo> Inserir o recurso especificado (Forma abreviada: -res) -linkresource:<resinfo> Vincular o recurso especificado neste assembly (Forma abreviada: -linkres) Onde o formato resinfo é <file>[,<string name>[,public|private]] - GERAÇÃO DE CÓDIGO - -debug[+|-] Emitir informações de depuração -debug:{full|pdbonly|portable|embedded} Especificar o tipo de depuração ("full" é padrão, "portable" é um formato de multiplataforma, "embedded" é um formato de multiplataforma inserido .dll ou .exe de destino) -optimize[+|-] Habilitar as otimizações (Forma abreviada: -o) -deterministic Produzir um assembly determinístico (incluindo o GUID da versão do módulo e carimbo de data/hora) -refonly Produzir um assembly de referência no lugar da saída principal -instrument:TestCoverage Produzir um assembly instrumentado para coletar informações de cobertura -sourcelink:<file> Informações do link de origem para incorporar no PDB. - ERROS E AVISOS - -warnaserror[+|-] Tratar todos os avisos como erros -warnaserror[+|-]:<warn list> Relatar os avisos específicos como erros (usar "anulável" em todos os avisos de nulidade) -warn:<n> Definir o nível de aviso (0 ou superior) (Forma abreviada: -w) -nowarn:<warn> Desabilitar as mensagens de aviso específicas (usar "anulável" em todos os avisos de nulidade) -ruleset:<file> Especificar um arquivo de conjunto de regras que desabilita determinados compilador e do analisador. -errorlog:<file>[,version=<sarif_version>] Especificar um arquivo para registrar os diagnósticos do compilador e do analisador. sarif_version:{1|2|2.1} Padrão é 1. 2 e 2.1 e ambos significam versão SARIF 2.1.0. -reportanalyzer Relatar informações adicionais do analisador, como o tempo de execução. -skipanalyzers[+|-] Ignorar a execução dos analisadores de diagnóstico. - IDIOMA - -checked[+|-] Gerar verificações de estouro -unsafe[+|-] Permitir código "não seguro" -define:<symbol list> Declarar o(s) símbolo(s) da compilação (Forma curta: -d) -langversion:? Exibir os valores permitidos da versão do idioma -langversion:<string> Especificar a versão do idioma, como `latest` (versão mais recente, incluindo as versões secundárias), `default` (o mesmo que `latest`), `latestmajor` (versão mais recente, exceto as versões secundárias), `preview` (versão mais recente, incluindo os recursos em visualização sem suporte), ou versões específicas como `6` ou `7.1` -nullable[+|-] Especificar a opção de contexto anulável ativar|desativar. -nullable:{enable|disable|warnings|annotations} Especificar a opção de contexto anulável ativar|desativar. - SEGURANÇA - -delaysign[+|-] Atrasar a assinatura do assembly usando apenas a parte do público da chave de nome forte -publicsign[+|-] Assinar publicamente o assembly usando apenas a parte do público da chave de nome forte -keyfile:<file> Especificar um arquivo de chave de nome forte -keycontainer:<string> Especificar um contêiner de chave de nome forte -highentropyva[+|-] Habilitar as ASLR de alta entropia - DIVERSOS - @<file> Ler o arquivo de resposta para obter mais opções -help Exibir esta mensagem de uso (Forma abreviada: -?) -nologo Suprimir a mensagem de direitos autorais do compilador -noconfig Não incluir automaticamente o arquivo VBC.RSP -parallel[+|-] Compilação simultânea. -version Exibir o número da versão do compilador e sair. - AVANÇADO - -baseaddress:<address> Endereço base da biblioteca a ser criada -checksumalgorithm:<alg> Especificar o algoritmo para calcular a soma de verificação do arquivo de origem soma de verificação armazenada no PDB. Os valores suportados são: SHA1 ou SHA256 (padrão). -codepage:<n> Especificar a página de código a ser usada ao abrir os arquivos do código-fonte -utf8output Mensagens do compilador de saída na codificação UTF-8 -main:<type> Especificar o tipo que contém o ponto de entrada (ignorar todos os outros pontos de entrada possíveis) (Forma curta: -m) -fullpaths O compilador gera caminhos totalmente qualificados -filealign:<n> Especificar o alinhamento usado nas seções do arquivo de saída -pathmap:<K1>=<V1>,<K2>=<V2>,... Especificar um mapeamento da saída de nomes do caminho de origem pelo compilador. -pdb:<file> Especificar o nome do arquivo de informações de depuração (padrão: nome do arquivo de saída com extensão .pdb) -errorendlocation Linha de saída e coluna do local final de cada erro -preferreduilang Especificar o nome do idioma de saída preferido. -nosdkpath Desabilitar a pesquisa do caminho padrão do SDK nos conjuntos de bibliotecas padrão. -sdkpath:<path> Caminho usado para pesquisar assemblies de biblioteca padrão. -nostdlib[+|-] Não referenciar à biblioteca padrão (mscorlib.dll) -subsystemversion:<string> Especificar a versão do subsistema deste assembly -lib:<file list> Especificar os diretórios adicionais para pesquisar as referências -errorreport:<string> Especifica como lidar com os erros do compilador interno: prompt, enviar, enfileirar ou nenhum. O padrão é fila. -appconfig:<file> especifique um arquivo de configuração de aplicativo que contém as configurações de associação do assembly -moduleassemblyname:<string> Nome do assembly que este módulo fará parte de -modulename:<string> Especificar o nome do módulo de origem -generatedfilesout:<dir> Colocar os arquivos gerados durante a compilação no diretório especificado. -reportivts[+|-] Informações de saída sobre todos os IVTs concedidos a esse assembly por todas as dependências e anotar os erros de acessibilidade do assembly externo com qual assembly eles vieram.
ru: Параметры компилятора Visual C# - ВЫХОДНЫЕ ФАЙЛЫ - -out:<file> Укажите имя выходного файла (по умолчанию: базовое имя файл с основным классом или первый файл) -target:exe Создать исполняемый файл консоли (по умолчанию) (сокращение форма: -t:exe) -target:winexe Создать исполняемый файл Windows (краткая форма: -t:winexe) -target:library Создать библиотеку (краткая форма: -t:library) -target:module Создать модуль, который можно добавить к другому сборка (краткая форма: -t:модуль) -target:appcontainerexe Создать исполняемый файл Appcontainer (краткая форма: -t:appcontainerexe) -target:winmdobj Создать промежуточный файл среды выполнения Windows, который потребляется WinMDExp (краткая форма: -t:winmdobj) -doc:<file> Файл XML-документации для создания -refout:<file> Ссылка на выходные данные сборки для создания -platform:<string> Ограничить платформы, на которых может работать этот код: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred или любой процессор. По умолчанию используется любой процессор. - ВХОДНЫЕ ФАЙЛЫ - --recurse:<wildcard> Включить все файлы в текущем каталоге и подкаталогах в соответствии с подстановочными знаками -reference:<alias>=<file> Ссылка на метаданные из указанного файла сборки с использованием заданного псевдонима (краткая форма: -r) -reference:<file list> Ссылочные метаданные из указанных файлов сборки (краткая форма: -r) -addmodule:<file list> Связать указанные модули с этой сборкой -link:<file list> Внедрить метаданные из указанных файлов сборки взаимодействия (краткая форма: -l) -analyzer:<file list> Запустить анализаторы из этой сборки (Краткая форма: -а) -additionalfile:<file list> Дополнительные файлы, не влияющие напрямую на генерацию кода, но которые могут использоваться анализаторами для создания ошибок и предупреждений. -embed Встроить все исходные файлы в PDB. -embed:<file list> Встроить определенные файлы в PDB. - РЕСУРСЫ - -win32res:<file> Укажите файл ресурсов Win32 (.res) -win32icon:<file> Использовать этот значок для вывода -win32manifest:<file> Укажите файл манифеста Win32 (.xml) -nowin32manifest Не включать манифест Win32 по умолчанию -resource:<resinfo> Встроить указанный ресурс (краткая форма: -res) -linkresource:<resinfo> Связать указанный ресурс с этой сборкой (Короткая форма: -linkres) Где формат resinfo равен <file>[,<string name>[,public|private]] - ГЕНЕРАЦИЯ КОДА - -debug[+|-] Выдать отладочную информацию -debug:{full|pdbonly|portable|embedded} Укажите тип отладки («полный» по умолчанию, «портативный» — это кроссплатформенный формат, 'встроенный' – это кроссплатформенный формат, встроенный в целевой файл .dll или .exe) -optimize[+|-] Включить оптимизацию (краткая форма: -o) -optimize[+|-] Производство детерминированной сборки (включая GUID версии модуля и метку времени) -refonly Изготовить эталонную сборку вместо основной продукции -instrument:TestCoverage Создать сборку, предназначенную для сбора сведений об охвате -sourcelink:<file> Информация об исходной ссылке для встраивания в PDB. - ОШИБКИ И ПРЕДУПРЕЖДЕНИЯ - -warnaserror[+|-] Сообщить обо всех предупреждениях как об ошибках -warnaserror[+|-]:<warn list> Сообщать об определенных предупреждениях как об ошибках (используйте "nullable" для всех предупреждений об отсутствии значений) -warn:<n> Установить уровень предупреждения (0 или выше) (краткая форма: -w) -nowarn:<warn list> Отключить определенные предупреждающие сообщения (используйте "nullable" для всех предупреждений об отсутствии значений) -ruleset:<file> Укажите файл набора правил, который отключает определенную диагностики. -errorlog:<file>[,version=<sarif_version>] Укажите файл для регистрации всего компилятора и анализатора диагностики. sarif_version:{1|2|2.1} По умолчанию 1. 2 и 2.1 оба означают SARIF версии 2.1.0. -reportanalyzer Сообщать дополнительную информацию об анализаторе, такую как время выполнения. -skipanalyzers[+|-] Пропустить выполнение диагностических анализаторов. - ЯЗЫК - -checked[+|-] Генерировать проверки переполнения -unsafe[+|-] Разрешить «небезопасный» код -define:<symbol list> Определить символ(ы) условной компиляции (краткая форма: -d) -langversion:? Показать допустимые значения для языковой версии -langversion:<string> Укажите языковую версию, например `latest` (последняя версия, включая дополнительные версии), `default` (то же, что и `последняя`), `latestmajor` (последняя версия, исключая дополнительные версии), `preview` (последняя версия, включая функции в неподдерживаемой предварительной версии), или специальные версии, такие как «6» или «7.1» -nullable[+|-] Указать параметр контекста, допускающий значение null, enable|disable. -nullable:{enable|disable|warnings|annotations} Укажите параметр контекста, допускающий значение NULL, enable|disable|warnings|annotations. - БЕЗОПАСНОСТЬ - -delaysign[+|-] Отложить подписание сборки, используя только открытый части ключа строгого имени -publicsign[+|-] Общедоступная подпись сборки с использованием только общедоступной части ключа строгого имени -keyfile:<file> Укажите файл ключа со строгим именем -keycontainer:<string> Укажите контейнер ключей строгого имени -highentropyva[+|-] Включить высокоэнтропийный ASLR - РАЗНОЕ - @<file> Прочтите файл ответов, чтобы узнать о дополнительных параметрах -help Показать это сообщение об использовании (краткая форма: -?) -nologo Подавить сообщение об авторских правах компилятора -nologo Не включать автоматически файл CSC.RSP -parallel[+|-] Параллельная сборка. -version Показать номер версии компилятора и выйти. - РАСШИРЕННЫЙ - -baseaddress:<address> Базовый адрес для создаваемой библиотеки -checksumalgorithm:<alg> Указать алгоритм вычисления контрольной суммы исходного файла, хранящегося в PDB. Поддерживаемые значения: SHA1 или SHA256 (по умолчанию). -codepage:<n> Укажите кодовую страницу для использования при открытии исходных файлов -utf8output Выводить сообщения компилятора в кодировке UTF-8 -main:<type> Укажите тип, который содержит точку входа (игнорировать все другие возможные точки входа) (короткая форма: -m) -fullpaths Компилятор создает полные пути -filealign:<n> Укажите выравнивание, используемое для разделов выходного файла -pathmap:<K1>=<V1>,<K2>=<V2>,... Укажите сопоставление для имен исходных путей, выводимых с помощью . компилятора. -pdb:<file> Указать имя файла отладочной информации (по умолчанию: имя выходного файла с расширением .pdb) -errorendlocation Строка вывода и столбец конечного местоположения каждой ошибки -preferreduilang Укажите предпочтительное имя языка вывода. -nosdkpath Отключить поиск стандартных библиотечных сборок по пути SDK по умолчанию. -nostdlib[+|-] Не ссылаться на стандартную библиотеку (mscorlib.dll) -subsystemversion:<string> Укажите версию подсистемы этой сборки -lib:<file list> Указать дополнительные каталоги для поиска ссылок -errorreport:<string> Укажите, как обрабатывать внутренние ошибки компилятора: запросить, отправить, поставить в очередь или никаких действий. Значение по умолчанию очередь. -appconfig:<file> Указать файл конфигурации приложения содержащий параметры привязки сборки -moduleassemblyname:<string> Название сборки, частью которой будет этот модуль -modulename:<string> Укажите имя исходного модуля -generatedfilesout:<dir> Поместить файлы, сгенерированные во время компиляции, в указанный каталог. -reportivts[+|-] Вывести информацию обо всех IVT, предоставленных этой сборке по всем зависимостям и аннотировать ошибки доступности сторонних сборок с указанием того, из какой сборки они произошли..
zh_hans: Visual C# 编译器选项 - 输出文件 - -out:<file> 指定输出文件名称(默认: 具有主类的文件或 第一个文件的基础名称) -target:exe 生成控制台可执行文件(默认) (缩 写: -t:exe) -target:winexe 生成 Windows 可执行文件(缩写: -t:winexe) -target:library 生成库(缩写: -t:library) -target:module 生成可添加到其他程序集的模块 (缩写: -t:module) -target:appcontainerexe 生成 Appcontainer 可执行文件(缩写: -t:appcontainerexe) -target:winmdobj 生成 WinMDExp 使用的 Windows 运行时 中间文件(缩写: -t:winmdobj) -doc:<file> 要生成的 XML 文档文件 -refout:<file> 引用要生成的程序集输出 -platform:<string> 限制此代码可以在哪些平台上运行: x86、 Itanium、x64、arm、arm64、anycpu32bitpreferred 或 anycpu。默认平台为 anycpu。 - 输入文件 - -recurse:<wildcard> 根据通配符规范，包括 当前目录和子目录中的 所有文件 -reference:<alias>=<file> 使用给定别名从指定的程序集文件中 引用元数据(缩写: -r) -reference:<file list> 从指定的程序集文件中引用 元数据(缩写: -r) -addmodule:<file list> 将指定模块链接到此程序集 -link:<file list> 从指定的互操作程序集文件嵌入 元数据(缩写: -l) -analyzer:<file list> 从此程序集运行分析器 (缩写: -a) -additionalfile:<file list> 不直接影响代码生成，但可能 由分析器用于生成错误或警告的 其他文件。 -embed 将所有源文件嵌入 PDB。 -embed:<file list> 在 PDB 中嵌入特定文件。 - 资源 - -win32res:<file> 指定 Win32 资源文件(.res) -win32icon:<file> 对输出使用此图标 -win32manifest:<file> 指定 Win32 清单文件(.xml) -nowin32manifest 不包括默认的 Win32 清单 -resource:<resinfo> 已嵌入指定资源(缩写: -res) -linkresource:<resinfo> 将指定资源链接到此程序集 (缩写: -linkres) 其中 resinfo 格式 为 <file>[,<string name>[,public|private]] - 代码生成 - -debug[+|-] 发出调试信息 -debug:{full|pdbonly|portable|embedded} 指定调试类型(默认类型为“完整”， “可移植”是一种跨平台格式， “已签入”是嵌入到目标 .dll 或 .exe 的 一种跨平台格式。) -optimize[+|-] 启用优化(缩写: -o) -deterministic 生成确定性程序集 (包括模块版本 GUID 和时间戳) -refonly 生成引用程序集来代替主输出 -instrument:TestCoverage 生成检测到用于收集覆盖范围信息的 程序集 -sourcelink:<file> 要嵌入 PDB 的源链接信息。 - 错误和警告 - -warnaserror[+|-] 将所有警告报告为错误。 -warnaserror[+|-]:<warn list> 将特定警告报告为错误。 (对所有为 Null 性警告使用“可为空”) -warn:<n> 设置警告级别(0 或更高级别) (缩写: -w) -nowarn:<warn list> 禁用特定的警告消息 (对所有为 Null 性警告使用“可为空”) -ruleset:<file> 指定禁用特定诊断的规则集 文件。 -errorlog:<file>[,version=<sarif_version>] 指定用于记录所有编译器和分析器诊断的 文件。 sarif_version:{1|2|2.1} 默认值为 1. 2 和 2.1 均表示 SARIF 版本 2.1.0。 -reportanalyzer 报告其他分析器信息，例如 执行时间。 -skipanalyzers[+|-] 跳过诊断分析器的执行。 - 语言 - -checked[+|-] 生成溢出检查 -unsafe[+|-] 允许“不安全”代码 -define:<symbol list> 定义条件编译符号(缩 写: -d) -langversion:? 显示语言版本的允许值 -langversion:<string> 指定语言版本，例如 `latest` (最新版本，包括次要版本)、 `default` (与 `latest` 相同)、 `latestmajor` (最新版本，不包含次要版本)、 `preview` (最新版本，包含不受支持的预览版中的功能)， 或者特定版本，例如 `6` 或 `7.1` -nullable[+|-] 指定可为空的上下文选项: 启用|禁用。 -nullable:{enable|disable|warnings|annotations} 指定可为空的上下文选项: 启用|禁用|警告|注释。 - 安全性 - -delaysign[+|-] 仅使用强名称密钥的公共部分 对程序集进行延迟签名 -publicsign[+|-] 仅使用强名称密钥的公共部分 对程序集进行公共签名 -keyfile:<file> 指定强名称密钥文件 -keycontainer:<string> 指定强名称密钥容器 -highentropyva[+|-] 启用高熵 ASLR - 其他 - @<file> 读取响应文件以获取更多选项 -help 显示此用法信息(缩写: -?) -nologo 取消显示编译器版权消息 -noconfig 不自动包含 CSC.RSP 文件 -parallel[+|-] 并发生成。 -version 显示编译器版本号并退出。 - 高级 - -baseaddress:<address> 要生成的库的基址 -checksumalgorithm:<alg> 指定用于计算存储在 PDB 中的源文件 校验和的算法。支持的值为: SHA1 或 SHA256 (默认值)。 -codepage:<n> 指定在打开源文件时使用的 代码页 -utf8output 按 UTF-8 编码输出编译器消息 -main:<type> 指定包含入口点的类型 (忽略所有其他可能的入口点) (缩 写: -m) -fullpaths 编译器生成完全限定的路径 -filealign:<n> 指定用于输出文件部分的 对齐方式 -pathmap:<K1>=<V1>,<K2>=<V2>,... 通过编译器指定源路径名称输出的 映射。 -pdb:<file> 指定调试信息文件名(默认值: 扩展名为 .pdb 的输出文件名) -errorendlocation 输出每个错误的结束位置的 行和列 -preferreduilang 指定首选输出语言名称。 -nosdkpath 禁止搜索标准库程序集的默认 SDK 路径。 -nostdlib[+|-] 不引用标准库(mscorlib.dll) -subsystemversion:<string> 指定此程序集的子系统版本 -lib:<file list> 指定要在其中搜索引用的 其他目录 -errorreport:<string> 指定如何处理内部编译器错误: “提示”、“发送”、“排队”或“无”。默认设置为 “排队”。 -appconfig:<file> 指定包含程序集绑定设置的 应用程序配置文件 -moduleassemblyname:<string> 此模块将成为其一部分的程序集的 名称 -modulename:<string> 指定源模块的名称 -generatedfilesout:<dir> 将编译期间生成的文件放在 指定的目录。 -reportivts[+|-] 输出所有依赖项授予此程序集的 所有 IVT 的相关信息，并在外部程序集可访问性错误中 注释它们来自哪个程序集。
