Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DocFileGen
source: Error writing to XML documentation file: {0}
cs: Chyba při zápisu do souboru dokumentace XML: {0}
de: Fehler beim Schreiben in XML-Dokumentationsdatei: {0}
es: Error al escribir en el archivo de documentación XML: {0}
fr: Erreur d'écriture dans le fichier de documentation XML : {0}
it: Si è verificato un errore durante la scrittura nel file di documentazione XML: {0}
ja: XML ドキュメント ファイル {0} の書き込み中にエラーが発生しました
ko: XML 문서 파일 쓰기 오류: {0}
pl: Błąd zapisu w pliku dokumentacji XML: {0}
pt_br: Erro gravando no arquivo de documentação XML: {0}
ru: Ошибка при записи в XML-файл документации: {0}
tr: XML belgeleri dosyasına yazılamadı: {0}
zh_hans: 写入 XML 文档文件时出错: {0}
zh_hant: 寫入 XML 文件檔案時發生錯誤: {0}

# WRN_XMLParseError
source: XML comment has badly formed XML -- '{0}'
cs: Komentáře XML má chybně vytvořený kód -- {0}
de: Der XML-Kommentar enthält ungültigen XML-Code: "{0}"
es: El comentario XML tiene código XML con formato incorrecto: '{0}'
fr: Le code XML du commentaire XML est incorrect -- '{0}'
it: Il formato XML del commento XML è errato - '{0}'
ja: XML コメントの XML 形式が正しくありません -- '{0}'
ko: XML 주석에 잘못된 형식의 XML이 있습니다. '{0}'
pl: Komentarz XML ma nieprawidłowo sformułowany kod XML — „{0}”
pt_br: O comentário XML tem XML com formação incorreta -- "{0}"
ru: Комментарий XML содержит некорректный XML — "{0}".
tr: XML yorumu kötü biçimli XML'e sahip -- '{0}'
zh_hans: XML 注释出现 XML 格式错误 --“{0}”
zh_hant: XML 註解有格式錯誤的 XML -- '{0}'

# WRN_XMLParseError_Title
source: XML comment has badly formed XML
cs: Komentář XML má chybně vytvořený kód.
de: XML-Kommentar weist ein ungültiges Format auf
es: El comentario XML tiene XML formado incorrectamente
fr: Le code XML du commentaire XML est incorrect
it: Il formato XML del commento XML è errato
ja: XML コメントの XML 形式が正しくありません
ko: XML 주석에 잘못된 형식의 XML이 있습니다.
pl: Komentarz XML ma nieprawidłowo sformułowany kod XML
pt_br: O comentário XML tem XML possui formato incorreto
ru: Комментарий XML содержит неправильно сформированный XML
tr: XML açıklaması kötü biçimlendirilmiş XML'e sahip
zh_hans: XML 注释出现 XML 格式错误
zh_hant: XML 註解有格式錯誤的 XML

# WRN_DuplicateParamTag
source: XML comment has a duplicate param tag for '{0}'
cs: Komentář XML má duplicitní značku param pro {0}.
de: Der XML-Kommentar enthält ein doppeltes param-Tag für "{0}".
es: El comentario XML tiene una etiqueta param duplicada para '{0}'
fr: Le commentaire XML a une balise param en double pour '{0}'
it: Il commento XML contiene un tag param duplicato per '{0}'
ja: XML コメントで param タグ '{0}' が重複しています
ko: XML 주석에는 '{0}'에 중복된 param 태그가 있습니다.
pl: Komentarz XML zawiera zduplikowany tag param dla elementu „{0}”
pt_br: O comentário XML tem uma tag param duplicada para "{0}"
ru: Комментарий XML имеет повторяющийся тег param для "{0}".
tr: XML yorumunun '{0}' için yinelenen bir param etiketi var
zh_hans: XML 注释中对“{0}”有重复的 param 标记
zh_hant: XML 註解中的 '{0}' 有重複的 param 標籤

# WRN_DuplicateParamTag_Title
source: XML comment has a duplicate param tag
cs: Komentář XML má duplicitní značku param.
de: XML-Kommentar enthält ein doppeltes param-Tag
es: El comentario XML tiene una etiqueta de parámetro duplicada
fr: Le commentaire XML a une balise param en double
it: Il commento XML contiene un tag param duplicato
ja: XML コメントで param タグが重複しています
ko: XML 주석에 중복 매개 변수 태그가 있습니다.
pl: Komentarz XML zawiera zduplikowany tag param
pt_br: O comentário XML tem uma tag param duplicada
ru: Комментарий XML содержит повторяющийся тег параметра
tr: XML açıklamasının yinelenen bir param etiketi var
zh_hans: XML 注释中有重复的 param 标记
zh_hant: XML 註解中有重複的 param 標籤

# WRN_UnmatchedParamTag
source: XML comment has a param tag for '{0}', but there is no parameter by that name
cs: Komentář XML má značku param pro {0}, ale neexistuje parametr s tímto názvem.
de: Der XML-Kommentar weist ein param-Tag für "{0}" auf, es gibt aber keinen Parameter mit dem Namen.
es: El comentario XML tiene una etiqueta param para '{0}', pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML a une balise param pour '{0}', alors qu'il n'existe aucun paramètre de ce nom
it: Il commento XML ha un tag param per '{0}', ma non esiste nessun parametro con questo nome
ja: XML コメントには '{0}' の param タグがありますが、その名前に相当するパラメーターはありません
ko: XML 주석에 '{0}'에 대한 param 태그가 있지만 해당 이름의 매개 변수는 없습니다.
pl: Komentarz XML ma tag param dla elementu „{0}”, lecz nie ma parametru o takiej nazwie
pt_br: Comentário XML tem uma tag param para "{0}", mas não há parâmetro por esse nome
ru: Комментарий XML имеет тег param для "{0}", но параметр с таким именем отсутствует.
tr: XML yorumu '{0}' için bir param etiketine sahip, ancak bu adlı bir parametre yok
zh_hans: XML 注释中有“{0}”的 param 标记，但是没有该名称的参数
zh_hant: XML 註解中的 '{0}' 有 param 標籤，但沒有該名稱的參數

# WRN_UnmatchedParamTag_Title
source: XML comment has a param tag, but there is no parameter by that name
cs: Komentář XML má značku param, ale neexistuje parametr s tímto názvem.
de: XML-Kommentar besitzt ein param-Tag, es gibt jedoch keinen Parameter mit diesem Namen
es: El comentario XML tiene una etiqueta param, pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML a une balise param, alors qu'il n'existe aucun paramètre de ce nom
it: Il commento XML ha un tag param, ma non esiste nessun parametro con questo nome
ja: XML コメントに param タグが存在しますが、その名前に相当するパラメーターはありません
ko: XML 주석에 param 태그가 있지만 해당 이름의 매개 변수는 없습니다.
pl: Komentarz XML ma tag param, ale nie ma parametru o takiej nazwie
pt_br: O comentário XML tem uma tag param, mas não há nenhum parâmetro com esse nome
ru: Комментарий XML содержит тег param, но параметр с таким именем не существует
tr: XML açıklamasının bir param etiketi var, ancak bu adla hiçbir parametre yok
zh_hans: XML 注释中有 param 标记，但是没有该名称的参数
zh_hant: XML 註解具有 param 標籤，但是沒有該名稱的參數

# WRN_UnmatchedParamRefTag
source: XML comment on '{1}' has a paramref tag for '{0}', but there is no parameter by that name
cs: Komentář XML u {1} má značku paramref pro {0}, ale neexistuje parametr s tímto názvem.
de: Der XML-Kommentar für "{1}" weist ein paramref-Tag für "{0}" auf, es gibt aber keinen Parameter mit dem Namen.
es: El comentario XML de '{1}' tiene una etiqueta paramref para '{0}', pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML sur '{1}' a une balise paramref pour '{0}', alors qu'il n'existe aucun paramètre de ce nom
it: Il commento XML in '{1}' ha un tag paramref per '{0}', ma non esiste nessun parametro con questo nome
ja: '{1}' の XML コメントで、'{0}' の paramref タグが存在しますが、その名前に相当するパラメーターはありません
ko: {1}'의 XML 주석에는 '{0}'에 대한 paramref 태그가 있지만 해당 이름의 매개 변수는 없습니다.
pl: Komentarz XML elementu „{1}” ma tag paramref dla elementu „{0}”, lecz nie ma parametru o takiej nazwie
pt_br: Comentário XML em "{1}" tem uma tag de paramref para "{0}", mas não há parâmetro por esse nome
ru: Комментарий XML в "{1}" имеет тег paramref для "{0}", но параметр для этого имени отсутствует.
tr: {1}' öğesindeki XML yorumu '{0}' için paramref etiketine sahip, ancak bu adlı bir parametre yok
zh_hans: “{1}”上的 XML 注释中有“{0}”的 paramref 标记，但是没有该名称的参数
zh_hant: '{1}' 上的 XML 註解中的 '{0}' 有 paramref 標籤，但沒有該名稱的參數

# WRN_UnmatchedParamRefTag_Title
source: XML comment has a paramref tag, but there is no parameter by that name
cs: Komentář XML má značku paramref, ale neexistuje parametr s tímto názvem.
de: XML-Kommentar besitzt ein paramref-Tag, es gibt jedoch keinen Parameter mit diesem Namen
es: El comentario XML tiene una etiqueta paramref, pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML a une balise paramref, alors qu'il n'existe aucun paramètre de ce nom
it: Il commento XML ha un tag paramref, ma non esiste nessun parametro con questo nome
ja: XML コメントに paramref タグが存在しますが、その名前に相当するパラメーターはありません
ko: XML 주석에 paramref 태그가 있지만 해당 이름의 매개 변수는 없습니다.
pl: Komentarz XML ma tag paramref, ale nie ma parametru o takiej nazwie
pt_br: O comentário XML tem uma tag paramref, mas não há nenhum parâmetro com esse nome
ru: Комментарий XML содержит тег paramref, но параметр с таким именем не существует
tr: XML açıklamasının bir paramref etiketi var, ancak bu adla hiçbir parametre yok
zh_hans: XML 注释中有 paramref 标记，但是没有该名称的参数
zh_hant: XML 註解具有 paramref 標籤，但是沒有該名稱的參數

# WRN_MissingParamTag
source: Parameter '{0}' has no matching param tag in the XML comment for '{1}' (but other parameters do)
cs: Parametr {0} nemá žádnou odpovídající značku param v komentáři XML pro {1} (ale jiné parametry ano).
de: Der {0}-Parameter hat (im Gegensatz zu anderen Parametern) kein entsprechendes param-Tag im XML-Kommentar für "{1}".
es: El parámetro '{0}' no tiene la etiqueta param correspondiente en el comentario XML para '{1}' (pero otros parámetros sí)
fr: Le paramètre '{0}' n'a pas de balise param correspondante dans le commentaire XML pour '{1}' (contrairement à d'autres paramètres)
it: Il parametro '{0}', diversamente da altri parametri, non contiene tag param corrispondenti nel commento XML per '{1}'
ja: パラメーター '{0}' には '{1}' の XML コメント内に対応する param タグがありませんが、他のパラメーターにはあります
ko: {0}' 매개 변수와 짝이 맞는 매개 변수 태그가 '{1}'의 XML 주석에 없습니다. 다른 매개 변수는 짝이 맞는 태그가 있습니다.
pl: Parametr „{0}” nie ma zgodnego tagu param w komentarzu XML elementu „{1}” (lecz inne parametry mają)
pt_br: Parâmetro "{0}" não tem tag param correspondente no comentário XML para "{1}" (mas outros parâmetros têm)
ru: Параметр "{0}" не имеет совпадающего тега param в комментарии XML для "{1}" (в отличие от остальных параметров)
tr: {0}' parametresinin '{1}' için XML yorumunda eşleşen param etiketi yoktur (ancak diğer parametrelerin vardır)
zh_hans: 参数“{0}”在“{1}”的 XML 注释中没有匹配的 param 标记(但其他参数有)
zh_hant: 參數 '{0}' 在 '{1}' 的 XML 註解中沒有相符的 param 標籤 (但其他參數有)

# WRN_MissingParamTag_Title
source: Parameter has no matching param tag in the XML comment (but other parameters do)
cs: Parametr nemá odpovídající značku param v komentáři XML (na rozdíl od jiných parametrů).
de: Parameter besitzt kein übereinstimmendes param-Tag im XML-Kommentar (andere Parameter jedoch schon)
es: El parámetro no tiene una etiqueta param coincidente en el comentario XML (pero otros parámetros sí)
fr: Le paramètre n'a pas de balise param correspondante dans le commentaire XML (contrairement à d'autres paramètres)
it: Il parametro, diversamente da altri parametri, non contiene tag param corrispondenti nel commento XML
ja: パラメーターには XML コメント内に対応する param タグがありませんが、他のパラメーターにはあります
ko: 매개 변수와 짝이 맞는 매개 변수 태그가 XML 주석에 없습니다. 다른 매개 변수는 짝이 맞는 태그가 있습니다.
pl: Parametr nie ma zgodnego tagu param w komentarzu XML (ale inne parametry mają ten tag)
pt_br: O parâmetro não tem nenhuma tag param correspondente no comentário XML (mas outros parâmetros têm)
ru: Параметр не имеет соответствующий тег параметра в комментарии XML (в отличие от остальных параметров)
tr: Parametrenin XML açıklamasında eşleşen param etiketi yok (ancak diğer parametrelerin var)
zh_hans: 参数在 XML 注释中没有匹配的 param 标记(但其他参数有)
zh_hant: 在 XML 註解中，參數沒有相符的 param 標籤 (但其他參數則相反)

# WRN_BadXMLRef
source: XML comment has cref attribute '{0}' that could not be resolved
cs: Komentář XML má atribut cref {0}, který se nedal vyřešit.
de: Der XML-Kommentar enthält ein cref-Attribut "{0}", das nicht aufgelöst werden konnte:
es: El comentario XML tiene un atributo cref '{0}' que no se pudo resolver
fr: Impossible de résoudre l'attribut cref '{0}' du commentaire XML
it: Il commento XML contiene l'attributo cref '{0}' che non è stato possibile risolvere
ja: XML コメントに、解決できなかった cref 属性 '{0}' があります
ko: XML 주석에 확인할 수 없는 '{0}' cref 특성이 있습니다.
pl: Komentarz XML ma atrybut cref „{0}”, którego nie można rozpoznać
pt_br: O comentário XML tem atributo cref "{0}" que não pode ser resolvido
ru: Комментарий XML содержит атрибут cref "{0}", который не удалось разрешить.
tr: XML yorumunun, çözümlenemeyen '{0}' cref özniteliği var
zh_hans: XML 注释中有未能解析的 cref 特性“{0}”
zh_hant: XML 註解有無法解析的 cref 屬性 '{0}'

# WRN_BadXMLRef_Title
source: XML comment has cref attribute that could not be resolved
cs: Komentář XML má atribut cref, který se nedal vyřešit.
de: XML-Kommentar weist ein cref-Attribut auf, das nicht aufgelöst werden konnte.
es: El comentario XML tiene un atributo cref que no se pudo resolver
fr: Désolé... Nous ne pouvons pas résoudre l'attribut cref du commentaire XML
it: Il commento XML contiene l'attributo cref che non è stato possibile risolvere
ja: XML コメントに、解決できなかった cref 属性があります
ko: XML 주석에 확인할 수 없는 cref 특성이 있습니다.
pl: Komentarz XML zawiera atrybut cref, którego nie można rozpoznać
pt_br: O comentário XML possui um atributo cref que não pode ser resolvido
ru: Комментарий XML содержит атрибут cref, который не удалось разрешить
tr: XML açıklaması çözümlenemeyen cref özniteliğine sahip
zh_hans: XML 注释中有无法解析的 cref 特性
zh_hant: XML 註解有無法解析的 cref 屬性

# ERR_BadStackAllocExpr
source: A stackalloc expression requires [] after type
cs: Výraz stackalloc vyžaduje, aby za typem byly závorky [].
de: Ein stackalloc-Ausdruck erfordert [] nach "type".
es: Una expresión stackalloc requiere [] después del tipo
fr: Une expression stackalloc exige la présence de [] à la suite du type
it: In un'espressione stackalloc occorre specificare [] dopo il tipo
ja: stackalloc の式は型の後に角かっこ [] が必要です
ko: stackalloc 식에서 형식 뒤에는 []가 있어야 합니다.
pl: W wyrażeniu stackalloc po nazwie typu wymagane jest użycie specyfikatora [].
pt_br: Uma expressão stackalloc requer [] após o tipo
ru: В выражении stackalloc после типа требуется [].
tr: Bir stackalloc ifadesi türden sonra [] gerektirir
zh_hans: stackalloc 表达式在类型后要求有 []
zh_hant: stackalloc 運算式在類型之後需要有 []

# ERR_InvalidLineNumber
source: The line number specified for #line directive is missing or invalid
cs: Číslo řádku zadané v direktivě #line se nenašlo nebo je neplatné.
de: Die Zeilennummer, die für die #line-Direktive angegeben wurde, fehlt oder ist ungültig.
es: Falta el número de línea especificado para la directiva #line o no es válido
fr: Le numéro de ligne spécifié pour la directive #line est manquant ou non valide
it: Il numero di riga specificato per la direttiva #line manca o non è valido
ja: #line ディレクティブの行数が指定されていないか、無効です
ko: #line 지시문에 지정한 줄 번호가 없거나 잘못되었습니다.
pl: Nie określono numeru wiersza dla dyrektywy #line lub określony numer jest nieprawidłowy.
pt_br: Número de linha especificado para diretiva #line ausente ou inválido
ru: Номер строки, указанный для директивы #line, отсутствует или недействителен.
tr: #line yönergesi için belirtilen satır numarası eksik veya geçersiz
zh_hans: 为 #line 指令指定的行号缺少或无效
zh_hant: 為 #line 指示詞指定的行號遺漏或無效

# ERR_MissingPPFile
source: Quoted file name, single-line comment or end-of-line expected
cs: Očekával se citovaný název souboru, jednořádkový komentář nebo konec řádku.
de: Dateiname in Anführungszeichen, einzeilige Anmerkung oder Zeilenende erwartet.
es: Se esperaba un nombre de archivo entre comillas, un comentario de una línea o un fin de línea
fr: Nom de fichier entre guillemets, commentaire sur une seule ligne ou fin de ligne attendu
it: È previsto un nome file tra virgolette, un commento su una sola riga o la fine riga
ja: 引用符付きのファイル名、単一行コメント、または行末が必要です
ko: 따옴표 붙은 파일 이름, 한 줄로 된 주석 또는 줄의 끝이 필요합니다.
pl: Oczekiwano nazwy pliku w cudzysłowie, jednowierszowego komentarza lub końca wiersza
pt_br: Nome do arquivo entre aspas, comentário de linha única ou fim da linha é esperado
ru: Ожидается имя файла в кавычках, однострочный комментарий или признак конца строки.
tr: Alıntılanan dosya adı, tek satırlı yorum veya satır sonu bekleniyor
zh_hans: 应是应用的文件名、单行注释或行尾
zh_hant: 必須是檔案名稱、單行註解或行結尾

# ERR_ExpectedPPFile
source: Quoted file name expected
cs: Očekával se citovaný název souboru.
de: Dateiname in Anführungszeichen erwartet.
es: Se esperaba un nombre de archivo entre comillas
fr: Nom de fichier entre guillemets attendu
it: È previsto un nome file racchiuso tra virgolette
ja: ファイル名は引用符で囲まれている必要があります
ko: 따옴표 붙은 파일 이름이 필요합니다.
pl: Oczekiwano nazwy pliku w cudzysłowach
pt_br: Nome do arquivo entre aspas é esperado
ru: Требуется имя файла в кавычках
tr: Alıntılanan dosya adı bekleniyor
zh_hans: 应是引用的文件名
zh_hant: 必須是以引號括住的檔案名稱

# ERR_ReferenceDirectiveOnlyAllowedInScripts
source: #r is only allowed in scripts
cs: #r je povolený jenom ve skriptech.
de: #r ist nur in Skripts zulässig.
es: #r solo se puede usar en scripts
fr: #r n'est autorisé que dans les scripts
it: #r è consentito solo negli script
ja: #r はスクリプトでのみ許可されます
ko: #r은 스크립트에서만 허용됩니다.
pl: Dyrektywa #r jest dozwolona tylko w skryptach
pt_br: #r somente é permitido em scripts
ru: Использование #r допускается только в скриптах.
tr: #r öğesine yalnızca komut dosyalarında izin verilir
zh_hans: 仅脚本中允许使用 #r
zh_hant: #r 只可用於指令碼中

# ERR_ForEachMissingMember
source: foreach statement cannot operate on variables of type '{0}' because '{0}' does not contain a public instance or extension definition for '{1}'
cs: Příkaz foreach nejde použít pro proměnné typu {0}, protože {0} neobsahuje veřejnou definici instance nebo rozšíření pro {1}.
fr: L'instruction foreach ne peut pas fonctionner sur des variables de type '{0}', car '{0}' ne contient pas de définition d'extension ou d'instance publique pour '{1}'
it: L'istruzione foreach non può funzionare con variabili di tipo '{0}' perché '{0}' non contiene una definizione di istanza o estensione pubblica per '{1}'
ja: '{0}' は '{1}' のパブリック インスタンスまたは拡張機能の定義を含んでいないため、型 '{0}' の変数に対して foreach ステートメントを使用することはできません
pl: Instrukcja foreach nie może operować na zmiennych typu „{0}”, ponieważ typ „{0}” nie zawiera publicznego wystąpienia lub definicji rozszerzenia dla elementu „{1}”
pt_br: A instrução foreach não pode operar em variáveis do tipo '{0}' porque '{0}' não contém uma definição da extensão ou instância pública para '{1}'
ru: Оператор foreach не работает с переменными типа "{0}", так как "{0}" не содержит открытое определение экземпляра или расширения для "{1}"
zh_hans: “{0}”不包含“{1}”的公共实例或扩展定义，因此 foreach 语句不能作用于“{0}”类型的变量
zh_hant: 因為 '{0}' 不包含 '{1}' 的公用執行個體或延伸模組定義，所以 foreach 陳述式無法在型別 '{0}' 的變數上運作

# WRN_BadXMLRefParamType
source: Invalid type for parameter {0} in XML comment cref attribute: '{1}'
cs: Neplatný typ pro parametr {0} v atributu cref komentáře XML: {1}.
de: Ungültiger Typ für den {0}-Parameter im cref-Attribut des XML-Kommentars: "{1}"
es: Tipo no válido para el parámetro {0} en el atributo cref del comentario XML: '{1}'
fr: Type non valide pour le paramètre {0} dans l'attribut cref du commentaire XML : '{1}'
it: Il tipo non è valido per il parametro {0} nell'attributo cref del commento XML: '{1}'
ja: XML コメントの cref 属性 ('{1}') のパラメーター {0} の型が無効です
ko: XML 주석 cref 특성의 {0} 매개 변수에 대해 잘못된 형식입니다('{1}').
pl: Nieprawidłowy typ parametru {0} w atrybucie cref komentarza XML: „{1}”
pt_br: Tipo inválido para parâmetro {0} no atributo de cref de comentário XML: "{1}"
ru: Недопустимый тип для параметра {0} в атрибуте cref комментария XML: '{1}'
tr: XML yorumu cref özniteliğindeki {0} parametresi için geçersiz tür: '{1}'
zh_hans: XML 注释 cref 特性中参数 {0} 的类型无效:“{1}”
zh_hant: XML 註解 cref 屬性中參數 {0} 的類型無效: '{1}'

# WRN_BadXMLRefParamType_Title
source: Invalid type for parameter in XML comment cref attribute
cs: Neplatný typ pro parametr v atributu cref komentáře XML.
de: Ungültiger Typ für den Parameter im XML-Kommentar des cref-Attributs.
es: Tipo no válido para el parámetro en el atributo cref del comentario XML
fr: Type non valide pour le paramètre dans l'attribut cref du commentaire XML
it: Il tipo non è valido per il parametro nell'attributo cref del commento XML
ja: XML コメントの cref 属性のパラメーターの型が無効です
ko: XML 주석 cref 특성의 매개 변수에 대해 잘못된 형식입니다.
pl: Nieprawidłowy typ parametru w atrybucie cref komentarza XML
pt_br: Tipo inválido para o parâmetro no atributo cref do comentário XML
ru: Недопустимый тип параметра в атрибуте cref комментария XML
tr: XML yorumu cref özniteliğinde parametre için geçersiz tür
zh_hans: XML 注释 cref 特性中参数的类型无效
zh_hant: XML 註解 cref 屬性中的參數類型無效

# WRN_BadXMLRefReturnType
source: Invalid return type in XML comment cref attribute
cs: Neplatný typ vrácené hodnoty v atributu cref komentáře XML
de: Ungültiger Rückgabetyp im cref-Attribut des XML-Kommentars.
es: Tipo de valor devuelto no válido en el atributo cref del comentario XML
fr: Type de retour non valide dans l'attribut cref de commentaire XML
it: Tipo restituito non valido nell'attributo cref del commento XML
ja: XML コメントの cref 属性の戻り値の型が無効です
ko: XML 주석 cref 특성에서 반환 형식이 잘못되었습니다.
pl: Nieprawidłowy zwracany typ w atrybucie cref komentarza XML
pt_br: Tipo de retorno inválido no atributo cref do comentário XML
ru: Недопустимый тип возвращаемого значения в атрибуте cref XML-комментария
tr: XML açıklaması cref özniteliğinde geçersiz dönüş türü
zh_hans: XML 注释的 cref 特性中的返回类型无效
zh_hant: XML 註解 cref 屬性中的傳回類型無效

# WRN_BadXMLRefReturnType_Title
source: Invalid return type in XML comment cref attribute
cs: Neplatný typ vrácené hodnoty v atributu cref komentáře XML
de: Ungültiger Rückgabetyp im cref-Attribut des XML-Kommentars.
es: Tipo de valor devuelto no válido en el atributo cref del comentario XML
fr: Type de retour non valide dans l'attribut cref de commentaire XML
it: Tipo restituito non valido nell'attributo cref del commento XML
ja: XML コメントの cref 属性の戻り値の型が無効です
ko: XML 주석 cref 특성에서 반환 형식이 잘못되었습니다.
pl: Nieprawidłowy zwracany typ w atrybucie cref komentarza XML
pt_br: Tipo de retorno inválido no atributo cref do comentário XML
ru: Недопустимый тип возвращаемого значения в атрибуте cref XML-комментария
tr: XML açıklaması cref özniteliğinde geçersiz dönüş türü
zh_hans: XML 注释的 cref 特性中的返回类型无效
zh_hant: XML 註解 cref 屬性中的傳回類型無效

# ERR_BadWin32Res
source: Error reading Win32 resources -- {0}
cs: Chyba při čtení prostředků Win32 -- {0}
de: Fehler beim Lesen von Win32-Ressourcen: {0}
es: Error al leer los recursos de Win32: {0}
fr: Erreur lors de la lecture des ressources Win32 -- {0}
it: Si è verificato un errore durante la lettura delle risorse Win32 - {0}
ja: Win32 リソースの読み込み中にエラーが発生しました -- {0}
ko: Win32 리소스 읽기 오류 -- {0}
pl: Błąd odczytu zasobów Win32 — {0}
pt_br: Erro ao ler recursos do Win32 -- {0}
ru: Ошибка при чтении ресурсов Win32 — {0}.
tr: Win32 kaynaklarını okurken hata -- {0}
zh_hans: 读取 Win32 资源时出错 -- {0}
zh_hant: 讀取 Win32 資源時發生錯誤 -- {0}

# WRN_BadXMLRefSyntax
source: XML comment has syntactically incorrect cref attribute '{0}'
cs: Komentář XML má syntakticky nesprávný atribut cref {0}.
de: Der XML-Kommentar enthält ein cref-Attribut "{0}" mit falscher Syntax.
es: El comentario XML tiene un atributo cref '{0}' con sintaxis incorrecta
fr: La syntaxe de l'attribut cref '{0}' du commentaire XML est incorrecte
it: Il commento XML contiene l'attributo cref '{0}' che è sintatticamente errato
ja: XML コメントの cref 属性 '{0}' の構文が正しくありません
ko: XML 주석에 잘못된 cref 특성 '{0}' 구문이 있습니다.
pl: Komentarz XML zawiera składniowo niepoprawny atrybut cref „{0}”
pt_br: O comentário XML tem atributo cref sintaticamente incorreto "{0}"
ru: В комментарии XML имеется атрибут cref "{0}" с неверным синтаксисом.
tr: XML yorumu sözdizimsel olarak yanlış '{0}' cref özniteliğine sahip
zh_hans: XML 注释中有语法错误的 cref 特性“{0}”
zh_hant: XML 註解有句法不正確的 cref 屬性 '{0}'

# WRN_BadXMLRefSyntax_Title
source: XML comment has syntactically incorrect cref attribute
cs: Komentář XML má syntakticky nesprávný atribut cref.
de: XML-Kommentar weist ein syntaktisch falsches cref-Attribut auf.
es: El comentario XML tiene un atributo cref sintácticamente incorrecto
fr: Le commentaire XML comporte une erreur de syntaxe au niveau de l'attribut cref
it: Il commento XML contiene l'attributo cref che è sintatticamente errato
ja: XML コメントに構文的に正しくない cref 属性があります
ko: XML 주석에 잘못된 cref 특성 구문이 있습니다.
pl: Komentarz XML zawiera składniowo niepoprawny atrybut cref
pt_br: O comentário XML possui um atributo cref sintaticamente incorreto
ru: Синтаксически недопустимый атрибут cref в комментарии XML
tr: XML açıklaması sözdizimsel olarak yanlış cref özniteliğine sahip
zh_hans: XML 注释中有语法错误的 cref 特性
zh_hant: XML 註解有句法不正確的 cref 屬性
