Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_GlobalSingleTypeNameNotFound
source: The type or namespace name '{0}' could not be found in the global namespace (are you missing an assembly reference?)
cs: Typ nebo název oboru názvů {0} se nenašel v globálním oboru názvů. (Nechybí odkaz na sestavení?)
de: Der Typ- oder Namespacename "{0}" ist im globalen Namespace nicht vorhanden. (Fehlt möglicherweise ein Assemblyverweis?)
es: El nombre del tipo o del espacio de nombres '{0}' no se encontró en el espacio de nombres global (¿falta alguna referencia de ensamblado?)
fr: Nom de type ou d'espace de noms '{0}' introuvable dans l'espace de noms global (vous manque-t-il une référence d'assembly ?)
it: Il nome di tipo o di spazio dei nomi '{0}' non è stato trovato nello spazio dei nomi globale. Probabilmente manca un riferimento all'assembly.
ja: 型名または名前空間名 '{0}' がグローバル名前空間に見つかりませんでした (アセンブリ参照が存在することを確認してください)
ko: 전역 네임스페이스에 '{0}' 형식 또는 네임스페이스 이름이 없습니다. 어셈블리 참조가 있는지 확인하세요.
pl: Nie można odnaleźć nazwy typu lub przestrzeni nazw „{0}” w globalnej przestrzeni nazw (czy nie brakuje odwołania do zestawu?)
pt_br: O tipo ou nome do namespace "{0}" não pode ser encontrado no namespace global (uma referência de assembly está faltando?)
ru: Не удалось найти тип или имя пространства имен "{0}" в глобальном пространстве имен (возможно, отсутствует ссылка на сборку?)
tr: {0}' tür veya ad alanı adı genel ad alanında bulunamadı (bir derleme başvurunuz mu eksik?)
zh_hans: 未能在全局命名空间中找到类型或命名空间名“{0}”(是否缺少程序集引用?)
zh_hant: 全域命名空間中找不到類型或命名空間名稱 '{0}' (是否遺漏了組件參考?)

# ERR_NewBoundMustBeLast
source: The new() constraint must be the last restrictive constraint specified
fr: La contrainte new() doit être la dernière contrainte restrictive spécifiée
it: Il vincolo new() deve essere l'ultimo vincolo specificato
pl: Ograniczenie new() musi być ostatnim określonym ograniczeniem restrykcyjnym
pt_br: A restrição new() deve ser a última restrição restritiva especificada
ru: Ограничение new() должно быть последним указанным ограничительным ограничением.
zh_hans: new() 约束必须是指定的最后一个限制性约束
zh_hant: new() 限制式必須是最後一個指定的限制式

# WRN_MainCantBeGeneric
source: '{0}': an entry point cannot be generic or in a generic type
cs: {0}: Vstupní bod nemůže být obecný nebo v obecném typu.
de: '"{0}": Ein Einstiegspunkt kann nicht generisch sein oder sich in einem generischen Typ befinden.
es: '{0}': un punto de entrada no puede ser genérico ni estar en un tipo genérico
fr: '{0}' : un point d'entrée ne peut pas être générique ou d'un type générique
it: '{0}': un punto di ingresso non può essere generico o essere incluso in un tipo generico
ja: '{0}': エントリ ポイントがジェネリックになったり、ジェネリック型の中に存在したりすることはできません
ko: '{0}': 진입점은 제네릭 또는 제네릭 형식일 수 없습니다.
pl: „{0}”: punkt wejścia nie może być elementem ogólnym ani być typu ogólnego
pt_br: "{0}": um ponto de entrada não pode ser genérico ou estar em um tipo genérico
ru: "{0}": точка входа не может быть универсальной или находиться в универсальном типе
tr: '{0}': bir giriş noktası genel ya da genel bir türde olamaz
zh_hans: “{0}”: 入口点不能是泛型的或属于泛型类型
zh_hant: '{0}': 進入點不可為泛型，也不可為泛型類型

# WRN_MainCantBeGeneric_Title
source: An entry point cannot be generic or in a generic type
cs: Vstupní bod nemůže být obecný nebo v obecném typu.
de: Ein Einstiegspunkt kann nicht generisch sein oder sich in einem generischen Typ befinden.
es: Un punto de entrada no puede ser genérico ni estar en un tipo genérico
fr: Un point d'entrée ne peut pas être générique ou d'un type générique
it: Un punto di ingresso non può essere generico o essere incluso in un tipo generico
ja: エントリ ポイントがジェネリックになったり、ジェネリック型の中に存在したりすることはできません
ko: 진입점은 제네릭 또는 제네릭 형식일 수 없습니다.
pl: Punkt wejścia nie może być elementem ogólnym ani być typu ogólnego
pt_br: Um ponto de entrada não pode ser genérico ou estar em um tipo genérico
ru: Точка входа не может быть универсальной или иметь универсальный тип
tr: Giriş noktası genel veya genel bir türde olamaz
zh_hans: 入口点不能是泛型的或属于泛型类型
zh_hant: 進入點不可為泛型，也不可為泛型類型

# ERR_TypeVarCantBeNull
source: Cannot convert null to type parameter '{0}' because it could be a non-nullable value type. Consider using 'default({0})' instead.
cs: Hodnotu Null nejde převést na parametr typu {0}, protože by se mohlo jednat o typ, který nemůže mít hodnotu null. Zvažte možnost použití výrazu default({0}).
de: NULL kann nicht in den {0}-Typparameter konvertiert werden, weil es sich möglicherweise um einen Non-Nullable-Werttyp handelt. Verwenden Sie stattdessen ggf. default({0}).
es: No se puede convertir NULL en el parámetro de tipo '{0}' porque podría ser un tipo de valor que no acepta valores NULL. Use 'default({0})' en su lugar.
fr: Impossible de convertir null en paramètre de type '{0}' parce qu'il peut s'agir d'un type valeur non-nullable. Utilisez 'default({0})' à la place.
it: Non è possibile convertire il valore Null nel parametro di tipo '{0}' perché potrebbe essere un tipo valore che non ammette i valori Null. Provare a usare 'default({0})'.
ja: Null 非許容の値型である可能性があるため、Null を型パラメーター '{0}' に変換できません。'default({0})' を使用してください。
ko: null을 허용하지 않는 값 형식일 수 있으므로 null을 '{0}' 형식 매개 변수로 변환할 수 없습니다. 대신 'default({0})'를 사용하세요.
pl: Nie można przekonwertować wartości null na parametr typu „{0}”, ponieważ może on być nienullowalnym typem wartości. Zamiast tego rozważ użycie elementu „default({0}!)”.
pt_br: Não é possível converter um valor nulo no parâmetro de tipo "{0}" porque ele poderia ser um tipo de valor não anulável. É recomendável o uso de "default({0})".
ru: Невозможно преобразовать Null к параметру типа "{0}", так как он может быть типом значения, не допускающим значения Null. Используйте вместо этого "default({0})".
tr: Bir değer türü olabileceğinden null, '{0}' tür parametresine dönüştürülemez. Yerine 'default({0})' kullanmayı düşünün.
zh_hans: 无法将 null 转换为类型参数“{0}”，因为它可能是不可为 null 的值类型。请考虑改用“default({0})”。
zh_hant: 無法將 null 轉換成類型參數 '{0}'，因為其可能是不可為 null 的實值類型。請考慮改用 'default({0})'。

# ERR_DuplicateBound
source: Duplicate constraint '{0}' for type parameter '{1}'
cs: Duplicitní omezení {0} pro parametru typu {1}
de: Doppelte "{0}"-Einschränkung für "{1}"-Typparameter.
es: Restricción '{0}' duplicada para el tipo de parámetro '{1}'
fr: Contrainte '{0}' en double pour le paramètre de type '{1}'
it: Il vincolo '{0}' è duplicato per il parametro di tipo '{1}'
ja: 型パラメーター '{1}' に対する制約 '{0}' が重複しています
ko: {1}' 형식 매개 변수에 대한 '{0}' 제약 조건이 중복되었습니다.
pl: Zduplikowane ograniczenie „{0}” dla parametru typu „{1}”
pt_br: Duplicar restrição "{0}" para o parâmetro de tipo "{1}"
ru: Повторяющееся ограничение "{0}" для параметра типа "{1}".
tr: {1}' tür parametresi için '{0}' yinelenen kısıtlaması
zh_hans: 类型参数“{1}”的约束“{0}”重复
zh_hant: 類型參數 '{1}' 出現重複的條件約束 '{0}'

# ERR_ClassBoundNotFirst
source: The class type constraint '{0}' must come before any other constraints
cs: Omezení typu třídy {0} musí předcházet všem dalším omezením.
de: Die Klassentypeinschränkung "{0}" muss vor allen anderen Einschränkungen stehen.
es: La restricción de tipo de clase '{0}' debe preceder a cualquier otra restricción
fr: La contrainte de type classe '{0}' doit précéder toute autre contrainte
it: Il vincolo di tipo classe '{0}' deve precedere gli altri vincoli
ja: クラス型制約 '{0}' は、他の制約の前に指定されなければなりません
ko: 클래스 형식 제약 조건 '{0}'은(는) 다른 모든 제약 조건보다 앞에 와야 합니다.
pl: Ograniczenie typu klasy „{0}” musi występować przed wszystkimi innymi ograniczeniami
pt_br: A restrição de tipo de classe "{0}" deve vir antes de qualquer outra restrição
ru: Все другие ограничения должны следовать после ограничения типа класса "{0}".
tr: {0}' sınıf türü kısıtlaması tüm diğer kısıtlamalardan önce gelmelidir
zh_hans: 类类型约束“{0}”必须在其他任何约束之前
zh_hant: 類別類型條件約束 '{0}' 必須在所有其他條件約束之前

# ERR_BadRetType
source: '{1} {0}' has the wrong return type
cs: {1} {0} má nesprávný návratový typ.
de: 'Der Rückgabetyp von "{1} {0}" ist falsch.
es: '{1} {0}' tiene un tipo de valor devuelto equivocado
fr: '{1} {0}' n'a pas le type de retour correct
it: 'Il tipo restituito di '{1} {0}' è errato
ja: '{1} {0}' には、不適切な戻り値の型が指定されています
ko: '{1} {0}'에 잘못된 반환 형식이 있습니다.
pl: „{1} {0}” ma nieprawidłowy zwracany typ.
pt_br: "{1} {0}" tem o tipo de retorno incorreto
ru: '{1} {0}" имеет неправильный возвращаемый тип.
tr: '{1} {0}' yanlış dönüş türüne sahip
zh_hans: “{1} {0}”的返回类型错误
zh_hant: '{1} {0}' 的傳回類型錯誤

# ERR_DelegateRefMismatch
source: Ref mismatch between '{0}' and delegate '{1}'
cs: Mezi {0} a delegátem {1} se neshoduje odkaz.
de: Fehlende Übereinstimmung der Verweise zwischen "{0}" und dem Delegaten "{1}"
es: Referencia no coincidente entre "{0}" y el delegado "{1}"
fr: Incompatibilité de référence entre '{0}' et le délégué '{1}'
it: Riferimenti non corrispondenti tra '{0}' e il delegato '{1}'
ja: '{0}' とデリゲート '{1}' で参照が一致しません
ko: {0}'과(와) 대리자 '{1}' 사이의 참조 불일치
pl: Niezgodność odwołań między metodą „{0}” a delegatem „{1}”
pt_br: Incompatibilidade de referência entre '{0}' e o delegado '{1}'
ru: Несоответствие ссылок между методом "{0}" и делегатом "{1}"
tr: {0}' metodu ile '{1}' temsilcisi arasında başvuru uyuşmazlığı
zh_hans: “{0}”和委托“{1}”之间引用不匹配
zh_hant: '{0}' 與委派 '{1}' 之間的參考不符

# ERR_DuplicateConstraintClause
source: A constraint clause has already been specified for type parameter '{0}'. All of the constraints for a type parameter must be specified in a single where clause.
cs: Klauzule omezení už byla přidaná pro parametr typu {0}. Všechna omezení pro parametr typu musí být zadaná v jediné klauzuli where.
de: Für den "{0}"-Typparameter wurde bereits eine Einschränkungsklausel angegeben. Alle Einschränkungen für einen Typparameter müssen in einer einzigen Where-Klausel angegeben werden.
es: Ya se ha especificado una cláusula de restricciones para el parámetro de tipo '{0}'. Todas las restricciones correspondientes a un parámetro de tipo se deben especificar en una sola cláusula where.
fr: Une clause de contrainte a déjà été spécifiée pour le paramètre de type '{0}'. Toutes les contraintes spécifiées pour un paramètre de type doivent l'être dans une seule clause where.
it: È già stata specificata una clausola di vincolo per il parametro di tipo '{0}'. Tutti i vincoli per un parametro di tipo devono essere specificati in un'unica clausola where.
ja: 制約句が、型パラメーター '{0}' に既に指定されています。型パラメーターの制約のすべてが、単一の WHERE 句で指定されなければなりません。
ko: {0}' 형식 매개 변수의 제약 조건 절을 이미 지정했습니다. 형식 매개 변수의 모든 제약 조건은 하나의 where 절에 지정해야 합니다.
pl: Klauzula ograniczenia została już określona dla parametru typu „{0}”. Wszystkie ograniczenia dla parametru typu muszą być określone w jednej klauzuli where.
pt_br: Uma cláusula de restrição já foi especificada para parâmetro de tipo "{0}". Todas as restrições de parâmetro de tipo devem ser especificadas em uma única cláusula where.
ru: Для параметра типа "{0}" уже указано предложение ограничения. Все ограничения для параметра типа должны быть объявлены в одном предложении Where.
tr: {0}' tür parametresi için bir kısıtlama yan tümcesi zaten belirtilmiş. Bir tür parametresi için kısıtlamaların tümü tek bir where yan tümcesinde belirtilmelidir.
zh_hans: 已经为类型参数“{0}”指定了 constraint 子句。必须在单个 where 子句中指定类型参数的所有约束。
zh_hant: 已為類型參數 '{0}' 指定了條件約束子句。類型參數的所有條件約束，都必須在單一 where 子句中指定。

# ERR_CantInferMethTypeArgs
source: The type arguments for method '{0}' cannot be inferred from the usage. Try specifying the type arguments explicitly.
cs: Argumenty typu pro metodu {0} nejde stanovit z použití. Zadejte argumenty typu explicitně.
de: Die Typargumente der {0}-Methode können nicht per Rückschluss aus der Syntax abgeleitet werden. Geben Sie die Typargumente explizit an.
es: Los argumentos de tipo para el método '{0}' no se pueden inferir a partir del uso. Pruebe a especificar los argumentos de tipo explícitamente.
fr: Impossible de déduire les arguments de type pour la méthode '{0}' à partir de l'utilisation. Essayez de spécifier les arguments de type de façon explicite.
it: Non è possibile dedurre gli argomenti di tipo per il metodo '{0}' dall'utilizzo. Provare a specificare gli argomenti di tipo in modo esplicito.
ja: メソッド '{0}' の型引数を使い方から推論することはできません。型引数を明示的に指定してください。
ko: 사용 현황에서 '{0}' 메서드의 형식 인수를 유추할 수 없습니다. 형식 인수를 명시적으로 지정하세요.
pl: Nie można wywnioskować argumentów typu dla metody „{0}” na podstawie użytkowania. Spróbuj jawnie określić argumenty typu.
pt_br: Os argumentos de tipo do método "{0}" não podem ser inferidos com base no uso. Tente especificar explicitamente os argumentos de tipo.
ru: Аргументы типа для метода "{0}" не могут определяться по использованию. Попытайтесь явно определить аргументы типа.
tr: {0}' yönteminin tür bağımsız değişkenleri kullanımdan çıkarsanamıyor. Tür bağımsız değişkenlerini açık olarak belirtmeyi deneyin.
zh_hans: 无法从用法中推断出方法“{0}”的类型参数。请尝试显式指定类型参数。
zh_hant: 方法 '{0}' 的類型引數不可從使用方式推斷。請嘗試明確地指定類型引數。

# ERR_LocalSameNameAsTypeParam
source: '{0}': a parameter, local variable, or local function cannot have the same name as a method type parameter
cs: {0}: Parametr, místní proměnná nebo místní funkce nemůžou mít stejný název jako parametr typů metod.
de: '"{0}": Ein Parameter, eine lokale Variable oder eine lokale Funktion kann nicht denselben Namen aufweisen wie der Typparameter einer Methode.
es: '{0}': un parámetro o una variable o función local no pueden tener el mismo nombre que un parámetro de tipo de método
fr: '{0}' : un paramètre, une variable locale ou une fonction locale ne peut pas avoir le même nom qu'un paramètre de type de méthode
it: '{0}': il nome di un parametro, di una variabile locale o di una funzione locale non può essere uguale a quello di un parametro di tipo del metodo
ja: '{0}': パラメーター、ローカル変数またはローカル関数は、メソッド型のパラメーターと同じ名前を持つことができません
ko: '{0}': 매개 변수, 지역 변수 또는 지역 함수는 메서드 형식 매개 변수와 같은 이름을 사용할 수 없습니다.
pl: „{0}”: parametr, zmienna lokalna lub funkcja lokalna nie może mieć tej samej nazwy co parametr typu metody
pt_br: '{0}': um parâmetro, variável de local ou função de local não pode ter o mesmo nome que um parâmetro de tipo de método
ru: "{0}": имя параметра, локальной переменной или локальной функции не может совпадать с именем параметра типа метода.
tr: '{0}': bir parametre, yerel değişken veya yerel işlev, bir metot türü parametresi ile aynı ada sahip olamaz
zh_hans: “{0}”: 参数、局部变量或本地函数不能与方法类型参数同名
zh_hant: '{0}': 參數、區域變數或區域函式的名稱不得與方法類型參數相同

# ERR_AsWithTypeVar
source: The type parameter '{0}' cannot be used with the 'as' operator because it does not have a class type constraint nor a 'class' constraint
cs: Parametr typu {0} nejde používat s operátorem as, protože nemá omezení typu třída ani omezení class.
de: Der Typparameter "{0}" kann nicht als as-Operator verwendet werden, da er keine Klassentypeinschränkung und keine Klasseneinschränkung aufweist.
es: El parámetro de tipo '{0}' no se puede utilizar con el operador 'as' porque no tiene ninguna restricción de tipo de clase ni una restricción 'class'
fr: Impossible d'utiliser le paramètre de type '{0}' avec l'opérateur 'as', car il n'a pas de contrainte de type classe ni de contrainte 'class'
it: Non è possibile usare il parametro di tipo '{0}' con l'operatore 'as' perché non ha vincoli di tipo classe, né un vincolo 'class'
ja: 型パラメーター '{0}' にはクラス型制約も 'class' 制約も含まれないため、'as' 演算子で使用できません
ko: 형식 매개 변수 '{0}'에는 클래스 형식 제약 조건이나 'class' 제약 조건이 없으므로 'as' 연산자와 함께 사용할 수 없습니다.
pl: Parametru typu „{0}” nie można użyć z operatorem „as”, ponieważ nie ma ograniczenia typu klasy ani ograniczenia „class”
pt_br: O parâmetro do tipo "{0}" não pode ser usado com o operador "as" porque não tem uma restrição de tipo de classe nem uma restrição "class"
ru: Параметр типа "{0}" не может использоваться с оператором "as", так как он не имеет ни ограничений типа класса, ни ограничения "class".
tr: {0}' tür parametresinde sınıf tür kısıtlaması veya bir 'class' kısıtlaması olmadığından 'as' işleciyle birlikte kullanılamaz
zh_hans: 由于类型参数“{0}”既没有类类型约束也没有“class”约束，因此不能与“as”运算符一起使用
zh_hant: 類型參數 '{0}' 不可與 'as' 運算子一起使用，因為它沒有類別類型條件約束或 'class' 條件約束

# WRN_UnreferencedFieldAssg
source: The field '{0}' is assigned but its value is never used
cs: Pole {0} má přiřazenou hodnotu, ale nikdy se nepoužívá.
de: Dem Feld "{0}" wurde ein Wert zugewiesen, der aber nie verwendet wird.
es: El campo '{0}' está asignado pero su valor nunca se usa
fr: Le champ '{0}' est assigné, mais sa valeur n'est jamais utilisée
it: Il campo '{0}' è assegnato, ma il suo valore non viene mai usato
ja: フィールド '{0}' が割り当てられていますが、値は使用されていません
ko: {0}' 필드가 할당되었지만 사용되지 않았습니다.
pl: Pole „{0}” jest przypisane, lecz jego wartość nie jest nigdy używana
pt_br: O campo "{0}" é atribuído, mas seu valor nunca é usado
ru: Полю "{0}" присвоено значение, но оно ни разу не использовано.
tr: {0}' alanı atanır ancak değeri hiçbir zaman kullanılmaz
zh_hans: 字段“{0}”已被赋值，但从未使用过它的值
zh_hant: 已指派欄位 '{0}'，但從未使用過其值

# WRN_UnreferencedFieldAssg_Title
source: Field is assigned but its value is never used
cs: Pole má přiřazenou hodnotu, ale nikdy se nepoužívá.
de: Feld ist zugewiesen, der Wert wird jedoch niemals verwendet
es: El campo está asignado pero nunca se usa su valor
fr: Le champ est assigné, mais sa valeur n'est jamais utilisée
it: Il campo è assegnato, ma il suo valore non viene mai usato
ja: フィールドが割り当てられていますが、値は使用されていません
ko: 필드가 할당되었지만 사용되지 않았습니다.
pl: Pole jest przypisane, ale jego wartość nie jest nigdy używana
pt_br: O campo é atribuído, mas seu valor nunca é usado
ru: Поле назначено, но его значение не используется
tr: Alan atandı ancak değeri hiç kullanılmadı
zh_hans: 字段已被赋值，但从未使用过它的值
zh_hant: 已指派欄位，但從未使用過其值

# ERR_BadIndexerNameAttr
source: The '{0}' attribute is valid only on an indexer that is not an explicit interface member declaration
cs: Atribut {0} je platný jenom pro indexer, který nepředstavuje explicitní deklaraci člena rozhraní.
de: Das {0}-Attribut ist nur für einen Indexer gültig, bei dem es sich nicht um eine explizite Schnittstellenmemberdeklaration handelt.
es: El atributo '{0}' solo es válido en un indizador que no sea una declaración de miembro de interfaz explícita
fr: L'attribut '{0}' n'est valide que sur un indexeur qui n'est pas une déclaration de membre d'interface explicite
it: L'attributo '{0}' è valido solo in un indicizzatore che non sia una dichiarazione esplicita di un membro di interfaccia
ja: '{0}' 属性は、明示的なインターフェイス メンバー宣言ではないインデクサー上でのみ有効です
ko: {0}' 특성은 명시적 인터페이스 멤버 선언이 아닌 인덱서에서만 유효합니다.
pl: Atrybut „{0}” jest prawidłowy tylko w indeksatorze, który nie jest jawną deklaracją składowej interfejsu
pt_br: O "{0}" atributo é válido somente em um indexador que não seja uma declaração de membro de interface explícita
ru: Атрибут "{0}" применим только для индексатора, который не является явным объявлением члена интерфейса.
tr: {0}' özniteliği yalnızca açık arabirim üyesi bildirimi olmayan bir dizin oluşturucusunda geçerlidir
zh_hans: “{0}”特性仅在不是显式接口成员声明的索引器上有效
zh_hant: '{0}' 屬性只有在非明確介面成員宣告的索引子上才有效

# ERR_AttrArgWithTypeVars
source: '{0}': an attribute argument cannot use type parameters
cs: {0}: Argument atributu nemůže používat parametry typů.
de: '"{0}": Ein Attributargument kann keine Typparameter verwenden.
es: '{0}': un argumento de atributo no puede usar parámetros de tipo
fr: '{0}' : un argument d'attribut ne peut pas utiliser de paramètres de type
it: '{0}': un argomento di attributo non può usare parametri di tipo
ja: '{0}': 属性の引数は型パラメーターを使用することができません
ko: '{0}': 특성 인수는 형식 매개 변수를 사용할 수 없습니다.
pl: „{0}”: argument atrybutu nie może używać parametrów typu
pt_br: "{0}": um argumento de atributo não pode usar parâmetros de tipo
ru: "{0}": аргумент атрибута не может использовать параметры типа.
tr: '{0}': öznitelik bağımsız değişkeni tür parametreleri kullanamaz
zh_hans: “{0}”: 特性参数不能使用类型参数
zh_hant: '{0}': 屬性引數不可使用類型參數

# ERR_NewTyvarWithArgs
source: '{0}': cannot provide arguments when creating an instance of a variable type
cs: {0}: Při vytváření instance typu proměnné nejde zadat argumenty.
de: '"{0}": Beim Erstellen einer Instanz eines Variablentyps können keine Argumente bereitgestellt werden.
es: '{0}': no se pueden proporcionar argumentos al crear una instancia de un tipo variable
fr: '{0}' : impossible de fournir des arguments lors de la création d'une instance d'un type de variable
it: '{0}': non è possibile fornire argomenti quando si crea un'istanza di un tipo di variabile
ja: '{0}': 変数型のインスタンスを作成するときに、引数を指定することはできません
ko: '{0}': 변수 형식의 인스턴스를 만들 때에는 인수를 지정할 수 없습니다.
pl: „{0}”: nie można udostępnić argumentów podczas tworzenia wystąpienia typu zmiennej
pt_br: "{0}": não é possível fornecer argumentos ao criar uma instância de um tipo de variável
ru: "{0}": при создании экземпляра типа переменной не удается задать аргументы
tr: '{0}': bir değişken türünün örneği oluşturulurken bağımsız değişken sağlanamaz
zh_hans: “{0}”: 创建变量类型的实例时无法提供参数
zh_hant: '{0}': 不能在建立變數類型的執行個體時，提供引數

# ERR_AbstractSealedStatic
source: '{0}': an abstract type cannot be sealed or static
cs: {0}: Abstraktní typ nemůže být sealed ani static.
fr: '{0}' : un type abstract ne peut pas être sealed ou static
it: '{0}': un tipo astratto non può essere sealed o static
ja: '{0}': 抽象型を sealed または static に指定することはできません
pl: „{0}”: typ abstrakcyjny nie może być zapieczętowany ani statyczny
pt_br: '{0}': um tipo abstrato não pode ser selado nem estático
ru: "{0}": абстрактный тип не может быть запечатанным или статическим.
zh_hans: “{0}”: 抽象类型不能是密封的或静态的
zh_hant: '{0}': 抽象類型不可為密封或靜態

# WRN_AmbiguousXMLReference
source: Ambiguous reference in cref attribute: '{0}'. Assuming '{1}', but could have also matched other overloads including '{2}'.
cs: Nejednoznačný odkaz v atributu cref: {0}. Předpokládá se {1}, ale mohla se najít shoda s dalšími přetíženími, včetně {2}.
de: Mehrdeutiger Verweis in cref-Attribut: "{0}". "{1}" wird angenommen, es sind jedoch auch Übereinstimmungen mit anderen Überladungen einschließlich "{2}" möglich.
es: Referencia ambigua en el atributo cref: '{0}'. Se supone '{1}', pero también podría haber coincidido con otras sobrecargas que incluyen '{2}'.
fr: Référence ambiguë dans l'attribut cref : '{0}'. '{1}' pris par défaut, mais peut aussi correspondre à d'autres surcharges, notamment '{2}'.
it: Riferimento ambiguo nell'attributo cref: '{0}'. Verrà usato '{1}', ma è anche possibile che corrisponda ad altri overload, tra cui '{2}'.
ja: '{0}' は cref 属性内のあいまいな参照です。'{1}' を仮定しますが、'{2}' を含む別のオーバーロードに一致した可能性もあります。
ko: cref 특성에 모호한 참조가 있습니다. '{0}'. '{1}'(으)로 간주하지만 '{2}'을(를) 포함하여 다른 오버로드와 일치할 수도 있습니다.
pl: Niejednoznaczne odwołanie w atrybucie cref: „{0}”. Przyjęto element „{1}”, lecz inne elementy przeciążające także są zgodne, w tym „{2}”.
pt_br: Referência ambígua no atributo cref: "{0}". Supondo "{1}", mas também poderia ter correspondido a outras sobrecargas, incluindo "{2}".
ru: Неоднозначная ссылка в атрибуте cref: "{0}". Предполагается "{1}", но может также соответствовать другим перегрузкам, включая "{2}".
tr: Cref özniteliğinde belirsiz başvuru: '{0}'. '{1}' varsayılıyor, ancak '{2}' dahil diğer aşırı yüklerle de eşleşebilirdi.
zh_hans: cref 特性中有不明确的引用:“{0}”。假定为“{1}”，但可能还与其他重载匹配，包括“{2}”。
zh_hant: cref 屬性中有模稜兩可的參考: '{0}'。已假設為 '{1}'，但也可能符合其他多載，包括 '{2}'。

# WRN_AmbiguousXMLReference_Title
source: Ambiguous reference in cref attribute
cs: Nejednoznačný odkaz v atributu cref
de: Zweideutige Referenz im cref-Attribut
es: Referencia ambigua en el atributo cref
fr: La référence de l'attribut cref est ambiguë
it: Riferimento ambiguo nell'attributo cref
ja: Cref 属性の参照があいまいです
ko: cref 특성에 모호한 참조가 있음
pl: Niejednoznaczne odwołanie w atrybucie cref
pt_br: Referência ambígua no atributo cref
ru: Неоднозначная ссылка в атрибуте cref
tr: Cref özniteliğinde belirsiz başvuru
zh_hans: cref 特性中有不明确的引用
zh_hant: cref 屬性中的參考模稜兩可
