Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_TooManyOpenBracesForRawString
source: The interpolated raw string literal does not start with enough '$' characters to allow this many consecutive opening braces as content.
cs: Interpolovaný literál nezpracovaného řetězce nezačíná dostatečným počtem znaků $, aby bylo možné takový počet po sobě jdoucích počátečních složených závorek povolit jako obsah.
fr: Le littéral brut interpolé de la chaîne de caractères ne commence pas par un nombre suffisant de caractères '$' pour permettre un tel nombre d'accolades ouvrantes consécutives comme contenu.
it: Il valore letterale stringa non elaborato interpolato non inizia con un numero sufficiente di caratteri '$' per consentire questo numero di parentesi graffe di apertura consecutive come contenuto.
ja: 補間された生文字列リテラルの先頭に十分な数の '$' 文字がないため、連続した始め波かっこをコンテンツとして使用できません。
pl: Interpolowany literał nieprzetworzonego ciągu nie zaczyna się od wystarczającej liczby znaków „$”, aby zezwolić na następującą liczbę kolejnych otwierających nawiasów klamrowych jako zawartość.
pt_br: A literal da cadeia de caracteres bruta interpolada não começa com caracteres “$” suficientes para permitir esse número de chaves de abertura consecutivas como conteúdo.
ru: Интерполированный литерал необработанной строки не начинается с достаточного количества символов \"$\", чтобы разрешить использовать такое же количество последовательных открывающих фигурных скобок в качестве содержимого.
zh_hans: 内插原始字符串字面量的开头没有足够的 \"$\" 字符以允许将这么多连续的左大括号作为内容。
zh_hant: 差補原始字串常值開頭沒有足夠的 '$' 字元，因此無法允許這麼多連續的左大括弧做為內容。

# ERR_TooManyQuotesForRawString
source: The raw string literal does not start with enough quote characters to allow this many consecutive quote characters as content.
cs: Literál nezpracovaného řetězce nezačíná dostatečným počtem uvozovek, aby bylo možné tento počet po sobě jdoucích znaků uvozovek povolit jako obsah.
fr: Le littéral brut de la chaîne de caractères ne commence pas par un nombre suffisant de caractères de guillemets pour autoriser un tel nombre de caractères de guillemets consécutifs comme contenu.
it: Il valore letterale stringa non elaborato non inizia con un numero sufficiente di virgolette per consentire questo numero di virgolette consecutive come contenuto.
ja: 生文字列リテラルの先頭に十分な数の引用符文字がないため、連続した引用符文字をコンテンツとして使用できません。
pl: Nieprzetworzony literał ciągu nie rozpoczyna się od wystarczającej liczby znaków cudzysłowu, aby umożliwić używanie tak wielu kolejnych znaków cudzysłowu jako zawartości.
pt_br: A literal da cadeia de caracteres bruta não começa com caracteres de aspa suficientes para permitir esse número de caracteres de aspa consecutivos como conteúdo.
ru: Литерал необработанной строки не начинается с достаточного количества символов кавычек, чтобы разрешить использовать такое же количество последовательных символов кавычек в качестве содержимого.
zh_hans: 原始字符串字面量的开头没有足够的引号字符以允许将这么多连续的引号字符作为内容。
zh_hant: 原始字串常值開頭沒有足夠的引號字元，因此無法允許這麼多連續的引號字元做為內容。

# ERR_TooManyUserStrings_RestartRequired
source: Combined length of user strings used by the program exceeds allowed limit. Adding a string literal requires restarting the application.
pt_br: O comprimento combinado de cadeias de caracteres de usuário usado pelo programa excede o limite permitido. Adicionar um literal de cadeia de caracteres requer a reinicialização do aplicativo.

# ERR_TopLevelStatementAfterNamespaceOrType
source: Top-level statements must precede namespace and type declarations.
cs: Příkazy nejvyšší úrovně se musí nacházet před obory názvů a deklaracemi typů.
fr: Les instructions de niveau supérieur doivent précéder les déclarations d'espace de noms et de type.
it: Le istruzioni di primo livello devono precedere le dichiarazioni di tipo e di spazio dei nomi.
ja: トップレベルのステートメントは、名前空間および型の宣言の前にある必要があります。
pl: Instrukcje najwyższego poziomu muszą poprzedzać deklaracje przestrzeni nazw i typów.
pt_br: As instruções de nível superior precisam preceder as declarações de namespace e de tipo.
ru: Инструкции верхнего уровня должны предшествовать объявлениям пространств имен и типов.
zh_hans: 顶级语句必须位于命名空间和类型声明之前。
zh_hant: 最上層陳述式必須在命名空間和型別宣告之前。

# ERR_TripleDotNotAllowed
source: Unexpected character sequence '...'
cs: Neočekáváná posloupnost znaků ...
de: Unerwartete Zeichenfolge "...".
es: Secuencia de caracteres "..." inesperada.
fr: Séquence de caractères inattendue '...'
it: La sequenza di caratteri '...' è imprevista
ja: 予期しない文字シーケンス '...'
ko: 예기치 않은 '...' 문자 시퀀스입니다.
pl: Nieoczekiwana sekwencja znaków „...”
pt_br: Sequência de caracteres inesperada '...'
ru: Неожиданная последовательность символов "…"
tr: Beklenmeyen karakter sırası '...'
zh_hans: 意外的字符序列 “...”
zh_hant: 未預期的字元順序 '...'

# ERR_TupleElementNameMismatch
source: The name '{0}' does not identify tuple element '{1}'.
cs: Název {0} neidentifikuje element tuple {1}.
de: Der Name "{0}" identifiziert nicht das Tupelelement "{1}".
es: El nombre "{0}" no identifica el elemento de tupla "{1}".
fr: Le nom '{0}' n'identifie pas l'élément de tuple '{1}'.
it: Il nome '{0}' non identifica l'elemento di tupla '{1}'.
ja: 名前 '{0}' はタプル要素 '{1}' を識別しません。
ko: '{0}' 이름은 '{1}' 튜플 요소를 식별하지 않습니다.
pl: Nazwa „{0}” nie identyfikuje elementu krotki „{1}”.
pt_br: O nome '{0}' não identifica o elemento de tupla '{1}'.
ru: Имя "{0}" не определяет элемент кортежа "{1}".
tr: '{0}' adı, '{1}' demet öğesini tanımlamıyor.
zh_hans: 名称“{0}”不会标识元组元素“{1}”。
zh_hant: 名稱 '{0}' 無法識別元組元素 '{1}'。

# ERR_TupleSizesMismatchForBinOps
source: Tuple types used as operands of an == or != operator must have matching cardinalities. But this operator has tuple types of cardinality {0} on the left and {1} on the right.
cs: Typy řazené kolekce členů, které se používají jako operandy operátoru == nebo !=, musí mít odpovídající kardinality. U tohoto operátoru je ale kardinalita typů řazené kolekce členů vlevo {0} a vpravo {1}.
de: Tupeltypen, die als Operanden eines ==- oder !=-Operators verwendet werden, müssen übereinstimmende Kardinalitäten aufweisen. Dieser Operator enthält jedoch Tupeltypen der Kardinalität "{0}" auf der linken und "{1}" auf der rechten Seite.
es: Los tipos de tupla utilizados como operandos de un operador == o != deben tener cardinalidades coincidentes. Pero este operador tiene tipos de tupla de cardinalidad {0} a la izquierda y {1} a la derecha.
fr: Les types de tuple utilisés en tant qu'opérandes d'un opérateur == ou != doivent avoir des cardinalités correspondantes. Toutefois, cet opérateur a des types de tuple de cardinalité {0} à gauche et {1} à droite.
it: Le cardinalità dei tipi di tupla usati come operandi di un operatore == o != devono essere uguali, ma questo operatore presenta tipi di tupla con cardinalità {0} sulla sinistra e {1} sulla destra.
ja: 演算子 == または != のオペランドとして使用するタプルの型は、カーディナリティが一致している必要があります。しかし、この演算子は、左辺のタプルの型のカーディナリティが {0} で、右辺が {1} です。
ko: == 또는 != 연산자의 피연산자로 사용되는 튜플 형식에는 일치하는 카디널리티가 있어야 합니다. 하지만 이 연산자는 왼쪽에 {0}, 오른쪽에 {1} 카디널리티 형식의 튜플이 있습니다.
pl: Typy krotek używane jako operandy operatorów == lub != muszą mieć zgodne kardynalności. Ten operator zawiera natomiast typy krotek o kardynalności {0} z lewej strony i {1} z prawej strony.
pt_br: Os tipos de tupla usados como operandos de um operador == ou != precisam ter cardinalidades correspondentes. No entanto, este operador tem tipos de tupla de cardinalidade {0} na esquerda e {1} na direita.
ru: Типы кортежей, используемые в качестве операндов оператора == или !=, должны иметь соответствующие кратности. Однако этот оператор имеет типы кортежей с кратностью {0} слева и {1} справа.
tr: == veya != işlecinin işleneni olarak kullanılan demet türlerinin kardinalitesi eşleşmelidir. Ancak bu işleç, solda {0} ve sağda {1} demet kardinalite türlerine sahip olmalıdır.
zh_hans: 用作 == 或 != 运算符的操作数的元组类型必须具有匹配的基数。但此运算符的基数的元组类型左侧为 {0}，右侧为 {1}。
zh_hant: 作為 == 或 != 運算子之運算元使用的元組類型，必須具有相符的基數。但此運算子在左側的元組類型為基數 {0}，在右側則為 {1}。

# ERR_TypeConstraintsMustBeUniqueAndFirst
source: The 'class', 'struct', 'unmanaged', 'notnull', and 'default' constraints cannot be combined or duplicated, and must be specified first in the constraints list.
cs: Omezení class, struct, unmanaged, notnull a default se nedají kombinovat ani použít více než jednou a v seznamu omezení se musí zadat jako první.
fr: Les contraintes 'class', 'struct', 'unmanaged', 'notnull' et 'default' ne peuvent pas être combinées ou dupliquées. De plus, elles doivent être spécifiées en premier dans la liste des contraintes.
it: I vincoli 'class', 'struct', 'unmanaged', 'notnull' e 'default' non possono essere combinati o duplicati e devono essere specificati per primi nell'elenco di vincoli.
ja: 'class'、'struct'、'unmanaged'、'notnull'、'default' の制約を組み合わせたり、複製したりすることはできません。これらは制約リストの最初に指定する必要があります。
pl: Ograniczeń „class”, „struct”, „unmanaged”, „notnull” i „default” nie można łączyć ani duplikować i należy je najpierw określić na liście ograniczeń.
pt_br: As restrições 'class', 'struct', 'unmanaged', 'notnull' e 'default' não podem ser combinadas nem duplicadas e precisam ser especificadas primeiro na lista de restrições.
ru: Ограничения "class", "struct", "unmanaged", "notnull" и "default" не могут быть объединены или повторяться, поэтому они должны быть указаны первыми в списке ограничений.
zh_hans: "class"、"struct"、"unmanaged"、"notnull" 和 "default" 约束不能组合或重复，并且必须先在约束列表中进行指定。
zh_hant: 無法合併或複製 'class'、'struct'、'unmanaged'、'notnull' 以及 'default' 條件約束，而且必須先在條件約束清單中指定。

# ERR_TypeIsNotAnInterpolatedStringHandlerType
source: '{0}' is not an interpolated string handler type.
cs: {0} není typ obslužné rutiny interpolovaného řetězce.
fr: « {0} » n’est pas un type de gestionnaire de chaîne interpolé.
it: '{0}' non è un tipo di gestore di stringhe interpolate.
ja: '{0}' は、補間された文字列ハンドラー型ではありません。
pl: „{0}” nie jest interpolowanym typem obsługi ciągu.
pt_br: '{0}' não é um tipo de manipulador de cadeia de caracteres interpolado.
ru: "{0}" не является типом обработчика интерполированных строк.
zh_hans: “{0}”不是内插字符串处理程序类型。
zh_hant: '{0}' 不是差補字串處理常式類型。

# ERR_TypeMustBePublic
source: Type '{0}' must be public to be used as a calling convention.
cs: Aby se typ {0} dal použít jako konvence volání, musí být veřejný.
fr: Le type '{0}' doit être public pour être utilisé comme convention d'appel.
it: Il tipo '{0}' deve essere pubblico per poterlo usare come convenzione di chiamata.
ja: 呼び出し規則として使用する型 '{0}' はパブリックでなければなりません。
pl: Typ „{0}” musi być publiczny, aby można go było używać jako konwencji wywoływania.
pt_br: O tipo '{0}' precisa ser público para ser usado como uma convenção de chamada.
ru: Тип "{0}" должен быть открытым для использования в качестве соглашения о вызовах.
zh_hans: 类型“{0}”必须是公共的，才能用作调用约定。
zh_hant: 類型 '{0}' 必須是公用，才能用為呼叫慣例。

# ERR_TypeParameterSameNameAsExtensionParameter
source: Type parameter '{0}' has the same name as an extension parameter
pt_br: O parâmetro de tipo "{0}" tem o mesmo nome que um parâmetro de extensão

# ERR_TypeParameterSameNameAsExtensionTypeParameter
source: Type parameter '{0}' has the same name as an extension container type parameter
pt_br: O parâmetro de tipo "{0}" tem o mesmo nome que um parâmetro de tipo de contêiner de extensão

# ERR_UnassignedThisAutoPropertyUnsupportedVersion
source: Auto-implemented property '{0}' must be fully assigned before control is returned to the caller. Consider updating to language version '{1}' to auto-default the property.
cs: Před vrácením řízení volajícímu se musí plně přiřadit automaticky implementovaná vlastnost {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení vlastnosti.
fr: La propriété implémentée automatiquement '{0}' doit être entièrement affectée avant que le contrôle soit retourné à l’appelant. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement la propriété par défaut.
it: La proprietà implementata automaticamente '{0}' deve essere assegnata completamente prima che il controllo sia restituito al chiamante. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente la proprietà come predefinita.
ja: コントロールを呼び出し元に返す前に、自動実装プロパティ '{0}' を完全に割り当てる必要があります。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Automatycznie implementowana właściwość „{0}” musi być w pełni przypisana, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie do wersji językowej „{1}”, aby automatycznie ustawić domyślną właściwość.
pt_br: A propriedade auto-implementada '{0}' deve ser totalmente atribuída antes que o controle seja devolvido ao chamador. Considere atualizar para a versão de linguagem '{1}' para auto-padrão da propriedade.
ru: Автоматически реализуемое свойство "{0}" должно быть полностью назначено перед возвратом контроля вызывающему элементу. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значение по умолчанию к этому свойству.
zh_hans: 必须先完全分配自动实现的属性'{0}'，然后才能将控件返回到调用方。请考虑更新到语言版本'{1}'以自动默认属性。
zh_hant: 在控制項傳回呼叫者之前，必須先完全指派自動實作屬性 '{0}'。請考慮更新至語言版本 '{1}' 以自動預設屬性。

# ERR_UnassignedThisUnsupportedVersion
source: Field '{0}' must be fully assigned before control is returned to the caller. Consider updating to language version '{1}' to auto-default the field.
cs: Před vrácením řízení volajícímu se musí plně přiřadit pole {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení pole.
fr: Le champ '{0}' doit être entièrement attribué avant que le contrôle soit retourné à l’appelant. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement le champ par défaut.
it: Il campo '{0}' deve essere assegnato completamente prima che il controllo sia restituito al chiamante. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente il campo come predefinito.
ja: コントロールを呼び出し元に返す前に、フィールド '{0}' を完全に割り当てる必要があります。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Pole „{0}” musi być w pełni przypisane, zanim kontrolka zostanie zwrócona do obiektu wywołującego. Rozważ zaktualizowanie pola do wersji językowej „{1}”, aby automatycznie ustawić domyślne pole.
pt_br: O campo '{0}' deve ser totalmente atribuída antes que o controle seja devolvido ao chamador. Considere atualizar para a versão de linguagem '{1}' para auto-padrão do campo.
ru: Поле '{0}' должно быть полностью назначенным перед возвратом контроля вызывающему элементу. Попробуйте обновить поле до языковой версии "{1}", чтобы автоматически применить значение по умолчанию.
zh_hans: 必须先完全分配字段 '{0}' ，然后才能将控件返回给调用方。请考虑更新到语言版本 '{1}' 以自动默认字段。
zh_hant: 在控制項傳回呼叫者之前，必須先完全指派欄位 '{0}'。請考慮更新至語言版本 '{1}' 以自動預設欄位。

# ERR_UnderspecifiedExtension
source: The type parameter `{0}` is not referenced by either the extension parameter or a parameter of this member
pt_br: O parâmetro de tipo `{0}` não é referenciado pelo parâmetro de extensão ou por um parâmetro deste membro

# ERR_UnexpectedArgumentListInBaseTypeWithoutParameterList
source: Cannot pass arguments to the base type without a parameter list on the type declaration.
pt_br: Não é possível passar argumentos para o tipo base sem uma lista de parâmetros na declaração de tipo.

# ERR_UnexpectedParameterList
source: Unexpected parameter list.
cs: Neočekávaný seznam parametrů.
fr: Liste de paramètres inattendue.
it: Elenco parametri imprevisto.
ja: 予期しないパラメーター リストです。
pl: Nieoczekiwana lista parametrów.
pt_br: Lista de parâmetros inesperada.
ru: Неожиданный список параметров.
zh_hans: 意外的参数列表。
zh_hant: 未預期的參數清單。

# ERR_UnmanagedCallersOnlyMethodsCannotBeCalledDirectly
source: '{0}' is attributed with 'UnmanagedCallersOnly' and cannot be called directly. Obtain a function pointer to this method.
cs: {0} má atribut UnmanagedCallersOnly a nedá se volat napřímo. Pro tuto metodu získejte ukazatel na funkci.
fr: '{0}' est attribué avec 'UnmanagedCallersOnly' et ne peut pas être appelé directement. Obtenez un pointeur de fonction vers cette méthode.
it: '{0}', a cui è assegnato l'attributo 'UnmanagedCallersOnly', non può essere chiamato direttamente. Ottenere un puntatore a funzione per questo metodo.
ja: '{0}' は 'UnmanagedCallersOnly' 属性が設定されているため、直接呼び出すことはできません。このメソッドへの関数ポインターを取得してください。
pl: Element „{0}” ma atrybut „UnmanagedCallersOnly” i nie można go wywołać bezpośrednio. Uzyskaj wskaźnik funkcji do tej metody.
pt_br: '{0}' foi atribuído com 'UnmanagedCallersOnly' e não pode ser chamado diretamente. Obtenha um ponteiro de função para esse método.
ru: "{0}" имеет атрибут "UnmanagedCallersOnly" и не может вызываться напрямую. Получите указатель на функцию для этого метода.
zh_hans: “{0}”使用 "UnmanagedCallersOnly" 进行特性化，无法直接调用。请获取指向此方法的函数指针。
zh_hant: '{0}' 使用 'UnmanagedCallersOnly' 屬性化，因此無法直接呼叫。取得此方法的函式指標。

# ERR_UnmanagedCallersOnlyMethodsCannotBeConvertedToDelegate
source: '{0}' is attributed with 'UnmanagedCallersOnly' and cannot be converted to a delegate type. Obtain a function pointer to this method.
cs: {0} má atribut UnmanagedCallersOnly a nedá se převést na typ delegáta. Pro tuto metodu získejte ukazatel na funkci.
fr: '{0}' est attribué avec 'UnmanagedCallersOnly' et ne peut pas être converti en type délégué. Obtenez un pointeur de fonction vers cette méthode.
it: '{0}', a cui è assegnato l'attributo 'UnmanagedCallersOnly', non può essere convertito in un tipo delegato. Ottenere un puntatore a funzione per questo metodo.
ja: '{0}' は 'UnmanagedCallersOnly' 属性が設定されているため、デリゲート型に変換できません。このメソッドへの関数ポインターを取得してください。
pl: Element „{0}” ma atrybut „UnmanagedCallersOnly” i nie można go przekonwertować na typ delegowany. Uzyskaj wskaźnik funkcji do tej metody.
pt_br: '{0}' foi atribuído com 'UnmanagedCallersOnly' e não pode ser convertido em um tipo delegado. Obtenha um ponteiro de função para esse método.
ru: "{0}" имеет атрибут "UnmanagedCallersOnly" и не может быть преобразован в тип делегата. Получите указатель на функцию для этого метода.
zh_hans: “{0}”使用 "UnmanagedCallersOnly" 进行特性化，无法转换为委托类型。请获取指向此方法的函数指针。
zh_hant: '{0}' 使用 'UnmanagedCallersOnly' 屬性化，因此無法轉換為委派類型。取得此方法的函式指標。

# ERR_UnrecognizedRefSafetyRulesAttributeVersion
source: '{0}' is defined in a module with an unrecognized RefSafetyRulesAttribute version, expecting '11'.
cs: {0} se definuje v modulu s nerozpoznanou verzí RefSafetyRulesAttribute, očekává se hodnota 11.
fr: '{0}' est défini dans un module avec une version RefSafetyRulesAttribute non reconnue, '11' attendu.
it: '{0}' è definito in un modulo con una versione non riconosciuta di RefSafetyRulesAttribute. È previsto '11'.
ja: '{0}' は、認識されない RefSafetyRulesAttribute バージョンを持つモジュールで定義され、'11' が必要です。
pl: Element '{0}' jest zdefiniowany w module z nierozpoznaną wersją RefSafetyRulesAttribute, oczekiwano „11”.
pt_br: "{0}" é definido em um módulo com uma versão RefSafetyRulesAttribute não reconhecida, esperando "11".
ru: "{0}" определен в модуле с нераспознанной версией RefSafetyRulesAttribute. Ожидается "11".
zh_hans: “{0}”在具有无法识别的 RefSafetyRulesAttribute 版本(应为“11”)的模块中定义。
zh_hant: '{0}' 是在具有無法辨識的 RefSafetyRulesAttribute 版本的模組中定義，預期為 '11'。

# ERR_UnscopedRefAttributeInterfaceImplementation
source: UnscopedRefAttribute cannot be applied to an interface implementation because implemented member '{0}' doesn't have this attribute.
fr: UnscopedRefAttribute ne peut pas être appliqué à une implémentation d’interface, car le membre implémenté « {0} » n’a pas cet attribut.
it: Non è possibile applicare UnscopedRefAttribute a un'implementazione dell'interfaccia perché il membro implementato '{0}' non dispone di questo attributo.
pl: Nie można zastosować atrybutu UnscopedRefAttribute do implementacji interfejsu, ponieważ zaimplementowana składowa „{0}” nie ma tego atrybutu.
pt_br: UnscopedRefAttribute não pode ser aplicado a uma implementação de interface porque o membro implementado "{0}" não tem esse atributo.
ru: UnscopedRefAttribute нельзя применить к реализации интерфейса, поскольку реализованный элемент {0} не содержит этого атрибута.
zh_hans: UnscopedRefAttribute 无法应用于接口实现，因为实现的成员 "{0}" 没有此属性。
zh_hant: UnscopedRefAttribute 無法套用至介面實作，因為實作的成員 '{0}' 不具這項屬性。

# ERR_UnscopedRefAttributeUnsupportedMemberTarget
source: UnscopedRefAttribute can only be applied to struct or virtual interface instance methods and properties, and cannot be applied to constructors or init-only members.
fr: UnscopedRefAttribute peut uniquement être appliqué aux propriétés et méthodes d’instance d’interface virtuelle ou struct et ne peut pas être appliqué aux constructeurs ou aux membres init uniquement.
it: UnscopedRefAttribute può essere applicato solo ai metodi e alle proprietà dell'istanza di struct o di interfaccia virtuale e non può essere applicato a costruttori o membri solo init.
pl: Atrybut UnscopedRefAttribute można stosować tylko do metod i właściwości wystąpienia interfejsu wirtualnego lub struktury i nie można go stosować do konstruktorów ani składowych tylko do inicjowania.
pt_br: UnscopedRefAttribute só pode ser aplicado a métodos e propriedades de instância de interface virtual ou struct e não pode ser aplicado a construtores ou membros somente de inicialização.
ru: UnscopedRefAttribute можно применять только к методам и свойствам экземпляра структуры или виртуального интерфейса и нельзя применять к конструкторам или элементам, предназначенным только для инициализации.
zh_hans: UnscopedRefAttribute 只能应用于结构或虚拟接口实例方法和属性，不能应用于构造函数或仅初始化成员。
zh_hant: UnscopedRefAttribute 只能套用至結構或虛擬執行個體方法和屬性，而無法套用至建構函式或只為 init 的成員。

# ERR_UnscopedRefAttributeUnsupportedTarget
source: UnscopedRefAttribute cannot be applied to this parameter because it is unscoped by default.
cs: U tohoto parametru není možné použít atribut UnscopedRefAttribute, protože ve výchozím nastavení není nastaven obor.
fr: Impossible d’appliquer UnscopedRefAttribute à ce paramètre, car il n’a pas d’étendue par défaut.
it: Non è possibile applicare UnscopedRefAttribute a questo parametro perché è senza ambito per impostazione predefinita.
ja: UnscopedRefAttribute は、既定では範囲外であるため、このパラメーターに適用できません。
pl: Nie można zastosować atrybutu UnscopedRefAttribute do tego elementu, ponieważ jest on domyślnie nieobjęty zakresem.
pt_br: UnscopedRefAttribute não pode ser aplicado a este parâmetro porque não tem escopo por padrão.
ru: Не удается применить UnscopedRefAttribute к этому параметру, так как у него по умолчанию нет области действия.
zh_hans: 无法将 UnscopedRefAttribute 应用于此参数，因为默认情况下未限定其范围。
zh_hant: UnscopedRefAttribute 無法套用到此參數，因為預設是不限範圍。

# ERR_UnscopedScoped
source: UnscopedRefAttribute cannot be applied to parameters that have a 'scoped' modifier.
cs: Atribut UnscopedRefAttribute nelze použít u parametrů, které mají modifikátor scoped.
fr: UnscopedRefAttribute ne peut pas être appliqué aux paramètres qui ont un modificateur 'scoped'.
it: Impossibile applicare UnscopedRefAttribute a parametri con modificatore 'scoped'.
ja: UnscopedRefAttribute は、'scoped' 修飾子を持つパラメーターには適用できません。
pl: Nie można zastosować atrybutu UnscopedRefAttribute do parametrów, które mają modyfikator „scoped”.
pt_br: UnscopedRefAttribute não pode ser aplicado a parâmetros que tenham um modificador 'scoped'.
ru: Невозможно применить UnscopedRefAttribute к параметрам, у которых есть модификатор "scoped".
zh_hans: UnscopedRefAttribute 不能应用于具有 "scoped" 修饰符的参数。
zh_hant: UnscopedRefAttribute 無法套用至具有 'scoped' 修飾元之參數。
