Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_EmptyCharConst
source: Empty character literal
cs: Prázdný znakový literál
de: Leeres Zeichenliteral.
es: Literal de carácter vacío
fr: Littéral de caractère vide
it: Il valore letterale carattere è vuoto
ja: 空の文字リテラルです
ko: 빈 문자 리터럴입니다.
pl: Pusty literał znakowy
pt_br: Literal de caractere vazio
ru: Пустая символьная константа.
tr: Boş karakter sabiti değeri
zh_hans: 空字符
zh_hant: 空的字元常值

# ERR_TooManyCharsInConst
source: Too many characters in character literal
cs: Příliš moc znaků ve znakovém literálu
de: Zu viele Zeichen im Zeichenliteral.
es: Demasiados caracteres en literal de carácter
fr: Trop de caractères dans le littéral de caractère
it: Troppi caratteri nel valore letterale carattere
ja: 文字リテラルに文字が多すぎます
ko: 문자 리터럴에 문자가 너무 많습니다.
pl: Za wiele znaków w literale znakowym
pt_br: Número excessivo de caracteres no literal de caractere
ru: Превышение допустимого числа символов в символьной константе.
tr: Karakter sabiti değerinde çok fazla karakter var
zh_hans: 字符字面量中的字符太多
zh_hant: 字元常值中有太多字元

# ERR_InvalidNumber
source: Invalid number
cs: Neplatné číslo
de: Ungültige Zahl.
es: Número no válido
fr: Nombre non valide
it: Numero non valido
ja: 無効な数字です
ko: 잘못된 숫자입니다.
pl: Nieprawidłowy numer
pt_br: Número inválido
ru: Недопустимое число
tr: Geçersiz sayı
zh_hans: 无效数字
zh_hant: 數字無效

# ERR_GetOrSetExpected
source: A get or set accessor expected
cs: Očekával se přistupující objekt get nebo set.
de: get- oder set-Accessor erwartet.
es: Se esperaba un descriptor de acceso get o set
fr: Accesseur get ou set attendu
it: È prevista una funzione di accesso get o set
ja: get または set アクセサーが必要です
ko: get 또는 set 접근자가 필요합니다.
pl: Oczekiwano metody dostępu get lub set.
pt_br: Acessador get ou set esperado
ru: Требуется метод доступа get или set.
tr: Bir get veya set erişimcisi bekleniyor
zh_hans: 应为 get 或 set 访问器
zh_hant: 必須是 get 或 set 存取子

# ERR_ClassTypeExpected
source: An object, string, or class type expected
cs: Očekával se typ object, string nebo class.
de: Objekt, Zeichenfolge oder Klassentyp erwartet.
es: Un objeto, una cadena o un tipo de clase esperados
fr: Type objet, chaîne ou classe attendu
it: È previsto un tipo oggetto, stringa o classe
ja: オブジェクト、文字列、またはクラス型が必要です
ko: 개체, 문자열 또는 클래스 형식이 필요합니다.
pl: Oczekiwano typu object, string lub class
pt_br: Um objeto, cadeia de caracteres ou tipo de classe esperado
ru: Требуется объект, строка или тип класса.
tr: Bir nesne, dize veya sınıf türü bekleniyor
zh_hans: 应是对象、字符串或类类型
zh_hant: 必須是物件、字串或類別類型

# ERR_NamedArgumentExpected
source: Named attribute argument expected
cs: Očekával se argument pojmenovaného atributu.
de: Benanntes Attributargument erwartet.
es: Se esperaba un argumento de atributo con nombre
fr: Argument d'attribut nommé attendu
it: È previsto un argomento denominato dell'attributo
ja: 名前付き属性引数が必要です
ko: 명명된 특성 인수가 필요합니다.
pl: Oczekiwano argumentu atrybutu nazwanego
pt_br: Argumento de atributo nomeado esperado
ru: Требуется именованный аргумент атрибута.
tr: Adlandırılmış öznitelik bağımsız değişkeni bekleniyor
zh_hans: 应为命名特性参数
zh_hant: 必須是具名屬性引數

# ERR_TooManyCatches
source: Catch clauses cannot follow the general catch clause of a try statement
cs: Klauzule catch nemůžou následovat za obecnou klauzulí catch příkazu try.
de: Catch-Klauseln können nicht auf die allgemeine catch-Klausel einer try-Anweisung folgen.
es: No puede haber cláusulas catch después de la cláusula catch general de una instrucción try
fr: Des clauses Catch ne peuvent pas suivre la clause catch générale d'une instruction try
it: Le clausole catch non possono seguire la clausola catch generale di un'istruzione try
ja: catch 句を、try ステートメントの一般的な catch 句の後に置くことはできません
ko: Catch 절은 try 문의 일반 catch 절 뒤에 올 수 없습니다.
pl: Klauzule catch nie mogą następować po ogólnej klauzuli catch instrukcji try.
pt_br: As cláusulas catch não podem seguir a cláusula catch geral de uma instrução try
ru: Конструкции catch не могут использоваться после универсальной конструкции catch оператора try
tr: Catch yan tümceleri, try deyiminin genel bir catch yan tümcesini izleyemez
zh_hans: catch 子句不能跟在 try 语句的常规 catch 子句之后
zh_hant: Catch 子句無法接在 try 陳述式的一般 catch 字句之後

# ERR_ThisOrBaseExpected
source: Keyword 'this' or 'base' expected
cs: Očekávalo se klíčové slovo this nebo base.
de: Schlüsselwort "this" oder "base" erwartet.
es: Se esperaba la palabra clave 'this' o 'base'
fr: Mot clé 'this' ou 'base' attendu
it: È prevista la parola chiave 'this' o 'base'
ja: キーワード 'this' または 'base' が必要です
ko: this' 또는 'base' 키워드가 필요합니다.
pl: Oczekiwano słowa kluczowego „this” lub „base”
pt_br: Palavra-chave 'this' ou 'base' esperada
ru: Требуется ключевое слово "this" или "base".
tr: this' veya 'base' anahtar sözcüğü bekleniyor
zh_hans: 应为关键字 "this" 或 "base"
zh_hant: 應有關鍵字 'this' 或 'base'

# ERR_OvlUnaryOperatorExpected
source: Overloadable unary operator expected
cs: Očekával se přetěžovatelný unární operátor.
de: Überladbarer unärer Operator erwartet.
es: Se esperaba un operador unario sobrecargable
fr: Opérateur unaire surchargeable attendu
it: È previsto un operatore unario che supporti l'overload
ja: オーバーロード可能な単項演算子が必要です
ko: 오버로드할 수 있는 단항 연산자가 필요합니다.
pl: Oczekiwano operatora jednoargumentowego z możliwością przeciążenia.
pt_br: Operador unário que pode ser sobrecarregado é esperado
ru: Требуется перегружаемый унарный оператор.
tr: Yeniden yüklenebilir birli işleç bekleniyor
zh_hans: 应输入可重载的一元运算符
zh_hant: 必須是可多載的一元運算子

# ERR_OvlBinaryOperatorExpected
source: Overloadable binary operator expected
cs: Očekával se přetěžovatelný binární operátor.
de: Überladbarer binärer Operator erwartet.
es: Se esperaba un operador binario sobrecargable
fr: Opérateur binaire surchargeable attendu
it: È previsto un operatore binario che supporti l'overload
ja: オーバーロード可能な 2 項演算子が必要です
ko: 오버로드할 수 있는 이항 연산자가 필요합니다.
pl: Oczekiwano operatora binarnego z możliwością przeciążenia
pt_br: Operador binário que pode ser sobrecarregado é esperado
ru: Требуется перегружаемый бинарный оператор.
tr: Yeniden yüklenebilir ikili işleç bekleniyor
zh_hans: 应输入可重载的二元运算符
zh_hant: 必須是可多載的二元運算子

# ERR_IntOverflow
source: Integral constant is too large
cs: Integrální konstanta je moc velká.
de: Die integrale Konstante ist zu groß.
es: La constante integral es demasiado extensa
fr: Constante intégrale trop grande
it: La costante integrale è troppo grande
ja: 整数定数が大きすぎます
ko: 정수 계열 상수가 너무 큽니다.
pl: Za duża wartość stałej całkowitej
pt_br: Constante de integral muito grande
ru: Значение целочисленной константы слишком велико.
tr: Tam sayı sabit çok büyük
zh_hans: 整数常量太大
zh_hant: 整數常數太大

# ERR_EOFExpected
source: Type or namespace definition, or end-of-file expected
cs: Očekávala se definice typu nebo oboru názvů, nebo konec souboru.
de: Typ- oder Namespacedefinition oder Dateiende erwartet.
es: Se esperaba una definición de tipo o espacio de nombres, o el fin del archivo
fr: Définition de type ou d'espace de noms, ou fin de fichier attendue
it: È prevista la definizione del tipo o dello spazio dei nomi oppure la fine del file
ja: 型、名前空間の定義、またはファイルの終わりが必要です
ko: 형식이나 네임스페이스 정의 또는 파일 끝(EOF)이 필요합니다.
pl: Oczekiwano definicji typu lub przestrzeni nazw albo znacznika końca pliku.
pt_br: Definição de namespace ou tipo, ou final do arquivo esperado
ru: Требуется определение типа или пространства имен, либо признак конца файла.
tr: Tür veya ad uzayı tanımı ya da dosya sonu bekleniyor
zh_hans: 应输入类型、命名空间定义或文件尾
zh_hant: 必須是類型或命名空間定義，或檔案結尾

# ERR_GlobalDefinitionOrStatementExpected
source: Member definition, statement, or end-of-file expected
cs: Očekává se definice člena, příkaz nebo konec souboru.
de: Memberdefinition, Anweisung oder Dateiende erwartet.
es: Se esperaba una definición, una instrucción o un fin de archivo
fr: Définition de membre, instruction ou fin de fichier attendu
it: È prevista una definizione di membro, un'istruzione o la fine del file
ja: メンバー定義、ステートメント、またはファイルの終わりが必要です
ko: 멤버 정의, 문 또는 파일 끝(EOF)이 필요합니다.
pl: Oczekiwano definicji składowej, instrukcji albo znacznika końca pliku
pt_br: Definição de membro, instrução ou final do arquivo esperado
ru: Требуется определение члена, оператор или признак конца файла
tr: Üye tanımı, deyim veya dosya sonu bekleniyor
zh_hans: 应是成员定义、语句或文件尾
zh_hant: 必須是成員定義、陳述式或檔案結尾

# ERR_BadEmbeddedStmt
source: Embedded statement cannot be a declaration or labeled statement
cs: Vloženým příkazem nemůže být deklarace ani příkaz s návěstím.
de: Eine eingebettete Anweisung kann keine Deklaration und keine Anweisung mit Bezeichnung sein.
es: Una instrucción incrustada no puede ser una declaración o una instrucción con etiqueta
fr: L'instruction incorporée ne peut pas être une déclaration ni une instruction étiquetée
it: Un'istruzione incorporata non può essere una dichiarazione o un'istruzione con etichetta
ja: 埋め込みステートメントを宣言やラベル付きのステートメントにすることはできません
ko: 포함 문은 선언 또는 레이블 문일 수 없습니다.
pl: Osadzona instrukcja nie może być instrukcją deklaracji ani instrukcją etykiety.
pt_br: A instrução inserida não pode ser uma declaração ou uma instrução rotulada
ru: Внедренный оператор не может быть объявлением или оператором с идентификатором.
tr: Gömülü deyim bir bildirim veya etiketlenmiş deyim olamaz
zh_hans: 嵌入的语句不能是声明或标记语句
zh_hant: 內嵌的陳述式不能為宣告或標記陳述式

# ERR_PPDirectiveExpected
source: Preprocessor directive expected
cs: Očekávala se direktiva preprocesoru.
de: Präprozessordirektive erwartet.
es: Se esperaba una directiva de preprocesador
fr: Directive de préprocesseur attendue
it: È prevista la direttiva per il preprocessore
ja: プリプロセッサ ディレクティブが必要です
ko: 전처리기 지시문이 필요합니다.
pl: Oczekiwano dyrektywy preprocesora
pt_br: Diretiva de pré-processamento esperada
ru: Требуется директива препроцессора.
tr: Önişlemci yönergesi bekleniyor
zh_hans: 应输入预处理器指令
zh_hant: 必須是前置處理器指示詞

# ERR_EndOfPPLineExpected
source: Single-line comment or end-of-line expected
cs: Očekával se jednořádkový komentář nebo konec řádku.
de: Einzeiliger Kommentar oder Zeilenende erwartet.
es: Se esperaba un comentario de una línea o un fin de línea
fr: Commentaire sur une seule ligne ou fin de ligne attendue
it: È previsto un commento su una sola riga o la fine riga
ja: 単一行コメントか行末が必要です
ko: 한 줄로 된 주석이나 줄의 끝이 필요합니다.
pl: Oczekiwano jednowierszowego komentarza lub znacznika końca wiersza.
pt_br: Comentário de linha única ou fim da linha esperado
ru: Требуется однострочный комментарий или признак конца строки.
tr: Tek satırlık açıklama veya satır sonu bekleniyor
zh_hans: 应输入单行注释或行尾
zh_hant: 必須是單行註解或行結尾

# ERR_CloseParenExpected
source: ) expected
cs: Očekává se ).
de: ) erwartet.
es: Se esperaba )
fr: ) attendue
it: È previsto il segno )
ja: ) が必要です
ko: )가 필요합니다.
pl: Oczekiwano znaku )
pt_br: ) esperado
ru: Требуется ")"
tr: ) bekleniyor
zh_hans: 应输入 )
zh_hant: 必須是 )

# ERR_EndifDirectiveExpected
source: #endif directive expected
cs: Očekávala se direktiva #endif.
de: #endif-Direktive erwartet.
es: Se esperaba la directiva #endif
fr: directive #endif attendue
it: È prevista la direttiva #endif
ja: #endif ディレクティブ が必要です
ko: #endif 지시문이 필요합니다.
pl: Oczekiwano dyrektywy #endif.
pt_br: Diretiva #endif esperada
ru: Требуется директива #endif.
tr: #endif yönergesi bekleniyor
zh_hans: 应输入 #endif 指令
zh_hant: 必須是 #endif 指示詞

# ERR_UnexpectedDirective
source: Unexpected preprocessor directive
cs: Neočekávaná direktiva preprocesoru
de: Unerwartete Präprozessordirektive.
es: Directiva de preprocesador inesperada
fr: Directive de préprocesseur inattendue
it: La direttiva per il preprocessore è imprevista
ja: 不適切なプリプロセッサ ディレクティブです
ko: 예기치 않은 전처리기 지시문이 있습니다.
pl: Nieoczekiwana dyrektywa preprocesora
pt_br: Diretiva de pré-processamento inesperada
ru: Непредвиденная директива препроцессору.
tr: Beklenmeyen önişlemci yönergesi
zh_hans: 意外的预处理器指令
zh_hant: 未預期的前置處理器指示詞

# WRN_WarningDirective_Title
source: #warning directive
cs: Direktiva #warning
de: #Warnungsdirektive
es: Directiva #warning
fr: Directive #warning
it: direttiva #warning
ja: #warning ディレクティブ
ko: #warning 지시문
pl: Dyrektywa #warning
pt_br: diretiva de #aviso
ru: Директива #warning
tr: #warning yönergesi
zh_hans: #warning 指令
zh_hant: #warning 指示詞

# ERR_TypeExpected
source: Type expected
cs: Očekával se typ.
de: Typ erwartet.
es: Se esperaba un tipo
fr: Type attendu
it: È previsto un tipo
ja: 型が必要です
ko: 형식이 필요합니다.
pl: Oczekiwano typu
pt_br: Tipo esperado
ru: Требуется тип.
tr: Tür bekleniyor
zh_hans: 应输入类型
zh_hant: 必須是類型

# ERR_PPDefFollowsToken
source: Cannot define/undefine preprocessor symbols after first token in file
cs: Po prvním tokenu v souboru nejde definovat symboly preprocesoru ani rušit jejich definice.
de: Die Definition von Präprozessorsymbolen kann nur vor dem ersten Token in der Datei vorgenommen/aufgehoben werden.
es: No se puede definir o anular la definición de símbolos de preprocesador después del primer token del archivo
fr: Impossible de définir/annuler la définition des symboles de préprocesseur à la suite du premier jeton du fichier
it: Impossibile definire o annullare la definizione dei simboli del preprocessore dopo il primo token nel file
ja: ファイルの最初のトークンの後でプリプロセッサのシンボルの定義または定義の解除を行えませんでした
ko: 파일의 첫 토큰 뒤에 전처리기 기호를 정의/정의 해제할 수 없습니다.
pl: Nie można zdefiniować/usunąć definicji symboli preprocesora po pierwszym tokenie w pliku.
pt_br: Não é possível definir nem remover os símbolos de pré-processamento após o primeiro token no arquivo
ru: Невозможно определить символы препроцессора или отменить их определение где-либо, кроме начала файла.
tr: Dosyadaki ilk belirteçten sonra önişlemci sembolleri tanımlanamaz/tanımları kaldırılamaz
zh_hans: 不能在文件的第一个标记之后定义或取消定义预处理器符号
zh_hant: 於檔案第一個語彙基元後無法定義或取消定義前置處理器符號

# ERR_PPReferenceFollowsToken
source: Cannot use #r after first token in file
cs: Nejde použít #r po prvním tokenu v souboru.
de: #r kann nicht nach dem ersten Token in der Datei verwendet werden.
es: No se puede usar #r después del primer token del archivo
fr: Impossible d'utiliser #r à la suite du premier jeton du fichier
it: Non è possibile usare #r dopo il primo token del file
ja: #r をファイルの最初のトークンの後に使用することはできません
ko: 파일의 첫 토큰 뒤에 #r을 사용할 수 없습니다.
pl: Nie można użyć dyrektywy #r po pierwszym tokenie w pliku
pt_br: Não é possível usar #r após o primeiro token no arquivo
ru: Нельзя использовать #r после первой лексемы в файле.
tr: Dosyadaki ilk belirteçten sonra #r kullanılamıyor
zh_hans: 不能在文件的第一个标记之后使用 #r
zh_hant: 無法在檔案的第一個語彙基元後使用 #r

# ERR_OpenEndedComment
source: End-of-file found, '*/' expected
cs: Našel se konec souboru. Očekával se řetězec */.
de: Dateiende gefunden. "*/" erwartet.
es: Se encontró el fin del archivo y se esperaba '*/'
fr: Fin de fichier trouvée, '*/' attendu
it: Trovata la fine del file, era previsto '*/'
ja: ファイルの終わりが見つかりました。'*/' が必要です
ko: 파일 끝(EOF)이 있습니다. '*/'가 필요합니다.
pl: Napotkano znacznik końca pliku. Oczekiwano znaków "*/".
pt_br: Final do arquivo encontrado. '*/' esperado
ru: Обнаружен признак конца файла, требуется "*/".
tr: Dosya sonu bulundu, '*/' bekleniyordu
zh_hans: 发现文件尾，应输入 "*/"
zh_hant: 找到檔案結尾，必須是 '*/'

# ERR_Merge_conflict_marker_encountered
source: Merge conflict marker encountered
cs: Byla zjištěna značka konfliktu sloučení.
de: Mergekonfliktmarker gefunden
es: Se encontró un marcador de conflicto de fusión mediante combinación
fr: Marqueur de conflit de fusion rencontré
it: È stato rilevato un marcatore di conflitti di merge
ja: マージ競合マーカーが検出されました
ko: 병합 충돌 표식을 발견했습니다.
pl: Napotkano znacznik konfliktu scalania
pt_br: Marcador de conflito de mesclagem encontrado
ru: Встретилась отметка о конфликте слияния
tr: Birleştirme çakışması işaretçisiyle karşılaşıldı
zh_hans: 遇到合并冲突标记
zh_hant: 偵測到合併衝突標記

# ERR_NoRefOutWhenRefOnly
source: Do not use refout when using refonly.
cs: Když používáte refonly, nepoužívejte refout.
de: Verwenden Sie "refout" nicht, wenn Sie "refonly" verwenden.
es: No use refout si utiliza refonly.
fr: N'utilisez pas refout quand vous utilisez refonly.
it: Non usare refout quando si usa refonly.
ja: refonly を使用する場合は、refout を使用しないでください。
ko: refonly를 사용할 때 refout을 사용하면 안 됩니다.
pl: Nie używaj opcji refout, gdy używana jest opcja refonly.
pt_br: Não use refout ao usar refonly.
ru: Не используйте refout при использовании refonly.
tr: refonly kullanılırken refout kullanmayın.
zh_hans: 不要在使用 refonly 时使用 refout。
zh_hant: 使用 refonly 時，請勿使用 refout。

# ERR_NoNetModuleOutputWhenRefOutOrRefOnly
source: Cannot compile net modules when using /refout or /refonly.
cs: Když se používá přepínač /refout nebo /refonly, nejde zkompilovat síťové moduly.
de: Netzmodule können nicht mithilfe von "/refout" oder "/refonly" kompiliert werden.
es: No se pueden compilar módulos al usar /refout o /refonly.
fr: Impossible de compiler les modules net en utilisant /refout ou /refonly.
it: Non è possibile compilare i moduli .NET quando si usa /refout o /refonly.
ja: /refout または /refonly を使用する場合は、ネット モジュールをコンパイルできません。
ko: /refout 또는 /refonly를 사용할 때 NET 모듈을 컴파일할 수 없습니다.
pl: Nie można skompilować modułów sieciowych, gdy używana jest opcja /refout lub /refonly.
pt_br: Não é possível compilar módulos de rede ao usar /refout ou /refonly.
ru: Не удается скомпилировать сетевые модули при использовании /refout или /refonly.
tr: /refout veya /refonly kullanılırken net modülleri derlenemez.
zh_hans: 无法在使用 /refout 或 /refonly 时编译 Net 模块。
zh_hant: 使用 /refout 或 /refonly 時無法編譯網路模組。

# ERR_OvlOperatorExpected
source: Overloadable operator expected
cs: Očekával se přetěžovatelný operátor.
de: Überladbarer Operator erwartet.
es: Se esperaba un operador sobrecargable
fr: Opérateur surchargeable attendu
it: È previsto un operatore che supporti l'overload
ja: オーバーロード可能な演算子が必要です
ko: 오버로드할 수 있는 연산자가 필요합니다.
pl: Oczekiwano operatora z możliwością przeciążenia
pt_br: Operador que pode ser sobrecarregado é esperado
ru: Требуется перегружаемый оператор.
tr: Yeniden yüklenebilir işleç bekleniyor
zh_hans: 应输入可重载运算符
zh_hant: 必須是可多載的運算子

# ERR_EndRegionDirectiveExpected
source: #endregion directive expected
cs: Očekávala se direktiva #endregion.
de: #endregion-Direktive erwartet.
es: Se esperaba la directiva #endregion
fr: directive #endregion attendue
it: È prevista la direttiva #endregion
ja: #endregion ディレクティブが必要です
ko: #endregion 지시문이 필요합니다.
pl: Oczekiwano dyrektywy #endregion.
pt_br: Diretiva #endregion esperada
ru: Требуется директива #endregion.
tr: #endregion yönergesi bekleniyor
zh_hans: 应输入 #endregion 指令
zh_hant: 必須是 #endregion 指示詞

# ERR_UnterminatedStringLit
source: Unterminated string literal
cs: Neukončený řetězcový literál
de: Nicht beendetes Zeichenfolgenliteral.
es: Literal de cadena no terminado
fr: Littéral de chaîne inachevé
it: Valore letterale stringa non completo
ja: 未終了の文字列です
ko: 문자열 리터럴이 종료되지 않았습니다.
pl: Niezakończony literał ciągu znaków
pt_br: Literal de cadeia de caracteres não finalizado
ru: Строковая константа без признака завершения
tr: Sonlandırılmamış dize sabit değeri
zh_hans: 字符串未终止
zh_hant: 未結束的字串常值

# ERR_BadDirectivePlacement
source: Preprocessor directives must appear as the first non-whitespace character on a line
cs: Direktivy preprocesoru musí být uvedené jako první neprázdné znaky na řádku.
de: Präprozessordirektiven müssen das erste Zeichen in einer Zeile sein, das keine Leerstelle ist.
es: Las directivas de preprocesador deben ser el primer carácter de una línea que no sea un espacio en blanco
fr: Les directives du préprocesseur doivent être le premier caractère (autre qu'un espace blanc) d'une ligne
it: Le direttive per il preprocessore devono trovarsi all'inizio di una riga
ja: プリプロセッサ ディレクティブは行でスペース以外の最初の文字でなければなりません
ko: 전처리기 지시문은 줄에서 공백이 아닌 첫 번째 문자로 나타나야 합니다.
pl: Dyrektywy preprocesora muszą wystąpić w wierszu jako pierwsze znaki inne niż spacja.
pt_br: As diretivas de pré-processamento devem aparecer como o primeiro caractere que não seja espaço em branco em uma linha
ru: Перед директивами препроцессору могут находиться только пробельные знаки.
tr: Önişlemci yönergeleri satırdaki boşluk olmayan ilk karakter olmalıdır
zh_hans: 预处理器指令必须作为一行的第一个非空白字符出现
zh_hant: 前置處理器指示詞必須出現為行中第一個非空白字元

# ERR_IdentifierExpectedKW
source: Identifier expected; '{1}' is a keyword
cs: Očekával se identifikátor; {1} je klíčové slovo.
de: Bezeichner erwartet; "{1}" ist ein Schlüsselwort.
es: Se esperaba un identificador; '{1}' es una palabra clave
fr: Identificateur attendu ; '{1}' est un mot clé
it: È previsto un identificatore, mentre '{1}' è una parola chiave
ja: 識別子が必要です。'{1}' はキーワードです
ko: 식별자가 필요합니다. '{1}'은(는) 키워드입니다.
pl: Oczekiwano identyfikatora; „{1}” jest słowem kluczowym
pt_br: Identificador esperado; "{1}" é uma palavra-chave
ru: Требуется идентификатор, "{1}" является ключевым словом.
tr: Tanımlayıcı bekleniyor; '{1}' bir anahtar sözcük
zh_hans: 应为标识符；“{1}”是关键字
zh_hant: 必須是識別項; '{1}' 為關鍵字

# ERR_SemiOrLBraceExpected
source: { or ; expected
cs: Očekávala se levá složená závorka ({) nebo středník (;).
de: { oder ; erwartet.
es: Se esperaba { o ;
fr: { ou ; attendu
it: È previsto il segno { o un punto e virgola (;)
ja: { か ; が必要です
ko: { 또는 ;이 필요합니다.
pl: Oczekiwano znaku { lub ;
pt_br: { ou ; esperado
ru: Требуется "{" или ";".
tr: { veya ; bekleniyor
zh_hans: 应为 { 或 ;
zh_hant: 必須是 { 或 ;

# ERR_MultiTypeInDeclaration
source: Cannot use more than one type in a for, using, fixed, or declaration statement
cs: V příkazu deklarace for, using, fixed nebo or nejde použít více než jeden typ.
de: In einer for-, using-, fixed- oder declaration-Anweisung kann nur ein Typ verwendet werden.
es: No se puede usar más de un tipo en una instrucción for, using, fixed o de declaración
fr: Impossible d'utiliser plusieurs types dans une instruction for, using, fixed ou declaration
it: Impossibile utilizzare più di un tipo nelle istruzioni for, using, fixed e nelle dichiarazioni
ja: for、using、fixed または declaration ステートメント に 1 つ以上の型を使用することはできません
ko: for 문, using 문, fixed 문, 선언문 등에는 둘 이상의 형식을 사용할 수 없습니다.
pl: W instrukcjach deklaracji „for”, „using”, „fixed”, „or” nie można użyć większej liczby typów niż jeden.
pt_br: Não é possível usar mais de um tipo em uma instrução for, using, fixed ou or de declaração
ru: В операторах for, using, fixed и операторах объявления не может использоваться более одного типа.
tr: Bir for, using, fixed veya bildirim deyimi içinde birden çok tür kullanılamaz
zh_hans: 在 for、using、fixed 或声明语句中不能使用多个类型
zh_hant: 無法在 for、using、fixed 或宣告陳述式中使用一個以上的類型

# ERR_AddOrRemoveExpected
source: An add or remove accessor expected
cs: Očekával se přistupující objekt add nebo remove.
de: add- oder remove-Accessor erwartet.
es: Se esperaba un descriptor de acceso add o remove
fr: Un accesseur add ou remove est attendu
it: È prevista una funzione di accesso add o remove
ja: add または remove アクセサーが必要です
ko: add 또는 remove 접근자가 필요합니다.
pl: Oczekiwano metody dostępu Add lub Remove
pt_br: Acessador add ou remove esperado
ru: Требуется функция доступа add или remove.
tr: Ekleme veya kaldırma erişimcisi bekleniyor
zh_hans: 应为 add 访问器或 remove 访问器
zh_hant: 必須是 add 或 remove 存取子

# ERR_UnexpectedCharacter
source: Unexpected character '{0}'
cs: Neočekávaný znak {0}
de: Unerwartetes Zeichen "{0}".
es: Carácter '{0}' inesperado
fr: Caractère inattendu '{0}'
it: Il carattere '{0}' è imprevisto
ja: 予期しない文字 '{0}'
ko: 예기치 않은 '{0}' 문자입니다.
pl: Nieoczekiwany znak „{0}”
pt_br: Caractere inesperado '{0}'
ru: Недопустимый символ "{0}".
tr: Beklenmeyen karakter: '{0}'
zh_hans: 意外的字符“{0}”
zh_hant: 未預期的字元 '{0}'

# ERR_UnexpectedToken
source: Unexpected token '{0}'
cs: Neočekávaný token {0}
de: Unerwartetes Token "{0}"
es: Token inesperado '{0}'
fr: Jeton inattendu '{0}'
it: Token '{0}' imprevisto
ja: 予期しないトークン '{0}'
ko: 예기치 않은 토큰 '{0}'
pl: Nieoczekiwany token „{0}”
pt_br: Token inesperado '{0}'
ru: Непредвиденный токен "{0}"
tr: Beklenmeyen belirteç '{0}'
zh_hans: 意外标记“{0}”
zh_hant: 未預期的語彙基元 '{0}'
