Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_Experimental_Title
source: Type is for evaluation purposes only and is subject to change or removal in future updates. Suppress this diagnostic to proceed.
fr: Le type est utilisé à des fins d’évaluation uniquement et est susceptible d’être modifié ou supprimé dans les futures mises à jour. Supprimez ce diagnostic pour continuer.
it: Type viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri. Elimina questa diagnostica per continuare.
ja: 種類は、評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。続行するには、この診断を非表示にします。
pl: Typ jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach. Wstrzymaj tę diagnostykę, aby kontynuować.
pt_br: O tipo é apenas para fins de avaliação e está sujeito a alterações ou remoção em atualizações futuras. Suprima este diagnóstico para continuar.
ru: Тип предназначен только для оценки и может быть изменен или удален в будущих обновлениях. Чтобы продолжить, скройте эту диагностику.
zh_hans: 类型仅用于评估，在将来的更新中可能会被更改或删除。取消此诊断以继续。
zh_hant: 類型僅供評估之用，可能會在未來更新中變更或移除。抑制此診斷以繼續。

# ERR_CompilerAndLanguageVersion
source: Compiler version: '{0}'. Language version: {1}. Compiler path: '{2}'.
pt_br: Versão do compilador: "{0}". Versão do idioma: {1}. Caminho do compilador: "{2}".

# IDS_FeatureAsyncMain
source: async main
cs: Asynchronní funkce main
de: asynchrones Hauptelement
it: principale asincrono
ko: 비동기 기본
pl: asynchroniczna funkcja main
pt_br: assíncrono principal
zh_hans: 主异步
zh_hant: 非同步主要

# ERR_TupleInferredNamesNotAvailable
source: Tuple element name '{0}' is inferred. Please use language version {1} or greater to access an element by its inferred name.
cs: Název elementu řazené kolekce členů {0} je odvozený. Pokud k elementu chcete získat přístup pomocí jeho odvozeného názvu, použijte prosím jazyk verze {1} nebo vyšší.
de: Der Tupelelementname "{0}" ist abgeleitet. Verwenden Sie Sprachversion {1} oder höher, um nach dem abgeleiteten Namen auf ein Element zuzugreifen.
es: El nombre "{0}" del elemento de tupla se ha deducido. Use la versión {1} del lenguaje, o una versión posterior, para acceder a un elemento por el nombre deducido.
fr: Le nom d'élément de tuple '{0}' est déduit. Utilisez la version de langage {1} ou une version supérieure pour accéder à un élément par son nom déduit.
it: Il nome '{0}' dell'elemento di tupla è dedotto. Usare la versione {1} o una versione successiva del linguaggio per accedere a un elemento in base al relativo nome dedotto.
ja: タプル要素名 '{0}' と推測されます。推測される名前で要素にアクセスするには、言語バージョン {1} 以上をお使いください。
ko: 튜플 요소 이름 '{0}'이(가) 유추됩니다. 언어 버전 {1} 이상을 사용하여 유추된 이름으로 요소에 액세스하세요.
pl: Nazwa elementu krotki „{0}” została wywnioskowana. Użyj wersji języka {1} lub nowszej, aby uzyskać dostęp do elementu według jego wywnioskowanej nazwy.
pt_br: O nome do elemento de tupla '{0}' é deduzido. Use a versão de idioma {1} ou posterior para acessar um elemento pelo nome deduzido.
ru: Имя элемента кортежа "{0}" является выведенным. Для обращения к элементу по выведенному имени используйте версию языка {1} или более позднюю.
tr: {0}' demet öğesi adı çıkarsandı. Bir öğeye çıkarsanan adıyla erişmek için lütfen {1} veya üzeri dil sürümünü kullanın.
zh_hans: 推断出元组元素名称“{0}”。请使用语言版本 {1} 或更高版本按推断名称访问元素。
zh_hant: 元組項目名稱 '{0}' 從推斷而來。請使用語言版本 {1} 或更新版本，依推斷名稱存取項目。

# ERR_VoidInTuple
source: A tuple may not contain a value of type 'void'.
cs: Řazená kolekce členů nemůže obsahovat hodnotu typu void.
de: Ein Tupel darf keinen Wert vom Typ "void" enthalten.
es: Una tupla no puede contener un valor de tipo "void".
fr: Un tuple ne doit pas contenir de valeur de type 'void'.
it: Una tupla non può contenere un valore di tipo 'void'.
ja: タプルに型 'void' の値を含めることはできません。
ko: 튜플에 'void' 형식의 값을 포함할 수 없습니다.
pl: Spójna kolekcja nie może zawierać wartości typu „void”.
pt_br: Uma tupla não pode conter um valor do tipo 'void'.
ru: Кортеж не может содержать значение типа void.
tr: Tanımlama grubu 'void' türünde bir değer içeremez.
zh_hans: 元组不能包含类型为 "void" 的值。
zh_hant: 元組不可包含 'void' 類型的值。

# ERR_NonTaskMainCantBeAsync
source: A void or int returning entry point cannot be async
cs: Vstupní bod, který vrací void nebo int, nemůže být asynchronní.
de: Ein Einstiegspunkt, der "void" oder "int" zurückgibt, kann nicht asynchron sein.
es: Un punto de entrada de devolución void o int no puede ser asincrónico
fr: Un point d'entrée qui retourne void ou int ne peut pas être async
it: Un punto di ingresso che restituisce void o int non può essere asincrono
ja: エントリ ポイントを返す void または int を async にすることはできません
ko: 진입점을 반환하는 void 또는 int는 비동기일 수 없습니다.
pl: Punkt wejścia zwracający wartości void lub int nie może być asynchroniczny
pt_br: Um ponto de entrada que retorna void ou int não pode ser assíncrono
ru: Функция void or int, возвращающая точку входа, не может быть асинхронной
tr: Giriş noktası döndüren bir void veya int zaman uyumsuz olamaz
zh_hans: 返回入口点的 void 或 int 不能是异步的
zh_hant: 不得同步傳回進入點的 void 或 int

# ERR_PatternWrongGenericTypeInVersion
source: An expression of type '{0}' cannot be handled by a pattern of type '{1}' in C# {2}. Please use language version {3} or greater.
cs: V C# {2} nelze výraz typu {0} zpracovat vzorem typu {1}. Použijte prosím jazyk verze {3} nebo vyšší.
de: Ein Ausdruck des Typs "{0}" kann nicht von einem Muster des Typs "{1}" in C# {2} verarbeitet werden. Verwenden Sie Sprachversion {3} oder höher.
es: Un patrón de tipo "{1}" no puede controlar una expresión de tipo "{0}" en C# {2}. Use la versión {3} del lenguaje o una versión posterior.
fr: Une expression de type '{0}' ne peut pas être gérée par un modèle de type '{1}' en C# {2}. Utilisez la version de langage {3} ou une version ultérieure.
it: Un'espressione di tipo '{0}' non può essere gestita da un criterio di tipo '{1}' in C# {2}. Usare la versione {3} o versioni successive del linguaggio.
ja: 種類 '{0}' の式は、C# {2} で種類 '{1}' のパターンによって処理することができません。言語バージョン {3} 以上をお使いください。
ko: C# {2}에서는 '{0}' 형식의 식을 '{1}' 형식의 패턴으로 처리할 수 없습니다. 언어 버전 {3} 이상을 사용하세요.
pl: Wyrażenie typu „{0}” nie może być obsługiwane przez wzorzec typu „{1}” w języku C# {2}. Użyj języka w wersji {3} lub nowszej.
pt_br: Uma expressão do tipo '{0}' não pode ser manipulada por um padrão do tipo '{1}' em C# {2}. Use a versão de linguagem {3} ou superior.
ru: Выражение типа "{0}" не может быть обработано шаблоном типа "{1}" в C# {2}. Используйте версию языка {3} или более позднюю.
tr: C# {2} dilinde '{0}' türündeki bir ifade, '{1}' türündeki bir desen tarafından işlenemez. Lütfen {3} veya üzeri dil sürümünü kullanın.
zh_hans: 在 C# {2} 中，“{1}”类型的模式无法处理“{0}”类型的表达式。请使用语言版本 {3} 或更高版本。
zh_hant: 在 C# {2} 中，類型為 '{1}' 的模式無法處理類型為 '{0}' 的運算式。請使用語言版本 {3} 或更新版本。

# WRN_UnreferencedLocalFunction
source: The local function '{0}' is declared but never used
cs: Lokální funkce {0} je deklarovaná, ale vůbec se nepoužívá.
de: Die lokale Funktion "{0}" ist deklariert, wird aber nie verwendet.
es: La función local "{0}" se declara pero nunca se usa.
fr: La fonction locale '{0}' est déclarée, mais jamais utilisée
it: La funzione locale '{0}' è dichiarata, ma non viene mai usata
ja: ローカル関数 '{0}' は宣言されていますが、一度も使用されていません
ko: 로컬 함수 '{0}'이(가) 선언되었지만 사용되지 않았습니다.
pl: Funkcja lokalna „{0}” jest zadeklarowana, lecz nie jest nigdy używana
pt_br: A função local '{0}' está declarada, mas nunca é usada
ru: Локальная функция "{0}" объявлена, но не используется.
tr: {0}' yerel değişkeni tanımlı ancak hiç kullanılmadı
zh_hans: 声明了本地函数“{0}”，但从未使用过
zh_hant: 區域函式 '{0}' 已宣告，但從未使用

# WRN_UnreferencedLocalFunction_Title
source: Local function is declared but never used
cs: Lokální funkce je deklarovaná, ale vůbec se nepoužívá.
de: Die lokale Funktion ist deklariert, wird aber nie verwendet.
es: La función local se declara pero nunca se usa
fr: La fonction locale est déclarée mais jamais utilisée
it: La funzione locale è dichiarata, ma non viene mai usata
ja: ローカル関数は宣言されていますが、一度も使用されていません
ko: 로컬 함수가 선언되었지만 사용되지 않음
pl: Funkcja lokalna jest zadeklarowana, ale nie jest nigdy używana
pt_br: A função local foi declarada, mas nunca usada
ru: Локальная функция объявлена, но не используется
tr: Yerel değişken tanımlı ancak hiç kullanılmadı
zh_hans: 已声明本地函数，但从未使用过
zh_hant: 區域函式已宣告但從未使用

# ERR_LocalFunctionMissingBody
source: Local function '{0}' must declare a body because it is not marked 'static extern'.
cs: Místní funkce {0} musí deklarovat tělo, protože není označená jako static extern.
de: '"{0}" ist eine lokale Funktion und muss daher immer Text enthalten.
es: '"{0}" es una función local y, por lo tanto, siempre debe tener un cuerpo.
fr: La fonction locale '{0}' doit déclarer un corps, car il n'est pas marqué 'static extern'.
it: La funzione locale '{0}' deve dichiarare un corpo perché non è contrassegnata come 'static extern'.
ja: ローカル関数 '{0}' は、'static extern' とマークされていないため、本体を宣言しなければなりません。
ko: '{0}'은(는) 로컬 함수이므로 항상 본문이 있어야 합니다.
pl: Funkcja lokalna „{0}” musi deklarować treść, ponieważ nie jest oznaczona jako „static extern”.
pt_br: A função local '{0}' deve declarar um corpo porque não está marcado como 'static extern'.
ru: Локальная функция "{0}" должна объявить тело, так как она не помечена как "static extern".
zh_hans: 本地函数“{0}”必须声明一个正文，因为它未标记为 "static extern"。
zh_hant: 區域函式 '{0}' 必須宣告主體，原因是其未標記為 'static extern'。

# ERR_InvalidDebugInfo
source: Unable to read debug information of method '{0}' (token 0x{1:X8}) from assembly '{2}': {3}
fr: Nous ne pouvons pas lire les informations de débogage de la méthode « {0} » (jeton 0x{1:X8}) dans l’assembly « {2} » : {3}
it: Non è possibile leggere le informazione di debug del metodo '{0}' (token 0x{1:X8}) dall'assembly '{2}': {3}
pt_br: Não foi possível ler as informações de depuração do método "{0}" (token 0x{1:X8}) do assembly "{2}": {3}
ru: Не удается прочитать отладочную информацию метода "{0}"' (токен 0x{1:X8}) из сборки "{2}": {3}
zh_hans: 无法从程序集“{2}”读取方法“{0}”(令牌 0x{1:X8})的调试信息: {3}

# IConversionExpressionIsNotCSharpConversion
source: {0} is not a valid C# conversion expression
cs: Výraz {0} není platným výrazem převodu C#.
de: "{0}" ist kein gültiger C#-Konvertierungsausdruck.
es: {0} no es una expresión de conversión de C# válida.
fr: {0} n'est pas une expression de conversion C# valide
it: {0} non è un'espressione di conversione C# valida
ja: {0} は有効な C# 変換式ではありません
ko: {0}은(는) 유효한 C# 변환 식이 아닙니다.
pl: {0} nie jest prawidłowym wyrażeniem konwersji języka C#.
pt_br: {0} não é uma expressão de conversão C# válida
ru: {0} не является допустимым выражением преобразования C#
tr: {0}, geçerli bir C# dönüştürme ifadesi değil
zh_hans: {0} 不是有效的 C# 转换表达式
zh_hant: {0} 不是有效的 C# 轉換運算式

# ERR_DynamicLocalFunctionTypeParameter
source: Cannot pass argument with dynamic type to generic local function '{0}' with inferred type arguments.
cs: Obecné lokální funkci {0} s odvozenými argumenty typu nelze předat argument s dynamickým typem.
de: Ein Argument vom dynamischen Typ kann nicht an die generische lokale Funktion "{0}" mit abgeleiteten Typargumenten übergeben werden.
es: No se puede pasar un argumento con tipo dinámico a función local genérica "{0}" con argumentos de tipo inferido.
fr: Impossible de passer un argument ayant un type dynamique à une fonction locale générique '{0}' avec des arguments de type déduits.
it: Non è possibile passare l'argomento di tipo dinamico alla funzione locale generica '{0}' con argomenti di tipo dedotti.
ja: 動的な型のある引数は、推定された型の引数のある汎用ローカル関数 '{0}' に渡すことはできません。
ko: 유추된 형식 인수가 있는 제네릭 로컬 함수 '{0}'에 동적 형식의 인수를 전달할 수 없습니다.
pl: Nie można przekazać argumentu o typie dynamicznym do ogólnej funkcji lokalnej „{0}” z argumentami typu wywnioskowanego.
pt_br: Não é possível passar um argumento com tipo dinâmico para função local genérica '{0}' com argumentos de tipo inferidos.
ru: Невозможно передать аргумент с динамическим типом в универсальную локальную функцию "{0}" с выводимыми аргументами типа.
tr: Dinamik türde bağımsız değişken, gösterilen türde bağımsız değişkenleri olan genel '{0}' yerel işlevine geçirilemez.
zh_hans: 不可将动态类型的参数传递到具有推断类型参数的泛型本地函数“{0}”。
zh_hant: 無法將具有動態類型的引數傳遞到具有推斷類型引數的一般區域函式 '{0}'。

# IDS_FeatureLeadingDigitSeparator
source: leading digit separator
cs: oddělovač úvodní číslice
de: Trennzeichen für vorangestellte Ziffern
es: separador de dígito inicial
fr: séparateur numérique de début
it: separatore di cifra iniziale
ja: 先頭の桁区切り記号
ko: 선행 숫자 구분 기호
pl: wiodący separator cyfr
pt_br: separador de dígito à esquerda
ru: разделитель начальных цифр
tr: ilk basamak ayıracı
zh_hans: 前导数字分隔符
zh_hant: 前置數字分隔符號

# ERR_ExplicitReservedAttr
source: Do not use '{0}'. This is reserved for compiler usage.
cs: Nepoužívejte {0}. Je vyhrazený pro použití v kompilátoru.
de: Verwenden Sie nicht "{0}". Dies ist für die Nutzung durch den Compiler reserviert.
es: No use "{0}". Está reservado para uso del compilador.
fr: Ne pas utiliser '{0}'. Ceci est réservé au compilateur.
it: Non usare '{0}' perché è riservato al compilatore.
ja: '{0}' は使用しないでください。コンパイラの使用のために予約されています。
ko: {0}'을(를) 사용하지 마세요. 컴파일러 사용을 위해 예약되어 있습니다.
pl: Nie używaj elementu „{0}”. Jest on zarezerwowany do użycia przez kompilator.
pt_br: Não use '{0}'. Isso é reservado para uso do compilador.
ru: Не используйте "{0}". Этот атрибут зарезервирован для использования компилятором.
tr: {0}' kullanmayın. Bu, derleyici kullanımı için ayrılmıştır.
zh_hans: 请勿使用“{0}”。这是保留给编译器使用的。
zh_hant: 請勿使用 '{0}'。此保留供編譯器使用。

# ERR_TypeReserved
source: The type name '{0}' is reserved to be used by the compiler.
cs: Název typu {0} je vyhrazený pro použití kompilátorem.
de: Der Typname "{0}" ist für die Verwendung durch den Compiler reserviert.
es: El nombre de tipo "{0}" está reservado para uso del compilador.
fr: L'utilisation du nom de type '{0}' est réservée au compilateur.
it: Il nome di tipo '{0}' è riservato al compilatore.
ja: 型名 '{0}' は、コンパイラによる使用のために予約されています。
ko: 형식 이름 '{0}'은(는) 컴파일러에서 사용하도록 예약되어 있습니다.
pl: Nazwa typu „{0}” jest zarezerwowana do użycia przez kompilator.
pt_br: O nome do tipo '{0}' está reservado para ser usado pelo compilador.
ru: Имя типа "{0}" зарезервировано для использования компилятором.
tr: {0}' tür adı, derleyici tarafından kullanılmak üzere ayrılmıştır.
zh_hans: 类型名称“{0}”是保留给编译器使用的。
zh_hant: 類型名稱 '{0}' 保留供編譯器使用。

# ERR_InExtensionMustBeValueType
source: The first 'in' or 'ref readonly' parameter of the extension method '{0}' must be a concrete (non-generic) value type.
fr: Le premier paramètre 'in' ou 'ref readonly' de la méthode d'extension '{0}' doit être un type de valeur concret (non générique).
it: Il primo parametro 'in' o 'ref readonly' del metodo di estensione '{0}' deve essere un tipo di valore concreto (non generico).
ja: 拡張メソッド '{0}' の最初の 'in' または 'ref readonly' パラメーターは、具象 (非ジェネリック) の値型である必要があります。
pl: Pierwszy parametr „in” lub „ref „readonly” metody rozszerzenia „{0}” musi być konkretnym (nie ogólnym) typem wartości.
pt_br: O primeiro parâmetro 'in' ou 'ref readonly' do método de extensão '{0}' deve ser um tipo de valor concreto (não genérico).
ru: Первый параметр "in" или "readonly" метода расширения "{0}" должен быть конкретным (неуниверсальным) типом значения.
zh_hans: 扩展方法“{0}”的第一个 "in" 或 "ref readonly" 参数必须是具体(非泛型)值类型。
zh_hant: 擴充方法 '{0}' 的第一個 'in' 或 'ref readonly' 參數必須是具體 (非泛型) 數值型別。

# ERR_FieldsInRoStruct
source: Instance fields of readonly structs must be readonly.
cs: Pole instancí struktur jen pro čtení musí být jen pro čtení.
de: Instanzfelder oder schreibgeschützte Strukturen müssen schreibgeschützt sein.
es: Los campos de instancia de las estructuras readonly deben ser readonly.
fr: Les champs d'instance de structs en lecture seule doivent être en lecture seule.
it: I campi di istanza di struct di sola lettura devono essere di sola lettura.
ja: 読み取り専用の構造体のインスタンス フィールドは、読み取り専用である必要があります。
ko: 읽기 전용 구조체의 인스턴스 필드는 읽기 전용이어야 합니다.
pl: Wystąpienia pól struktur tylko do odczytu muszą być tylko do odczytu.
pt_br: Campos de instância de structs somente leitura devem ser somente leitura.
ru: Поля экземпляров в структурах только для чтения должны быть доступны только для чтения.
tr: Salt okunur yapı birimlerinin örnek alanları salt okunur olmalıdır.
zh_hans: 只读结构的实例字段必须为只读。
zh_hant: 唯讀結構的執行個體欄位必須為唯讀。

# ERR_AutoPropsInRoStruct
source: Auto-implemented instance properties in readonly structs must be readonly.
cs: Vlastnosti automaticky implementované instance ve strukturách jen pro čtení musí být jen pro čtení.
de: Automatisch implementierte Instanzeigenschaften in schreibgeschützten Strukturen müssen schreibgeschützt sein.
es: Las propiedades de instancia implementadas automáticamente en estructuras readonly deben ser readonly.
fr: Les propriétés d'instance implémentées automatiquement dans les structs en lecture seule doivent être en lecture seule.
it: Tutte le proprietà di istanza implementate automaticamente in struct di sola lettura devono essere di sola lettura.
ja: 読み取り専用の構造体に含まれる自動実装インスタンスのプロパティは、読み取り専用である必要があります。
ko: 읽기 전용 구조체에서 자동으로 구현된 인스턴스 속성은 읽기 전용이어야 합니다.
pl: Automatycznie implementowane właściwości wystąpienia w strukturach tylko do odczytu muszą być tylko do odczytu.
pt_br: Propriedades da instância autoimplementadas em structs somente leitura devem ser somente leitura.
ru: Автоматически реализуемые свойства экземпляра в структурах только для чтения должны быть доступны только для чтения.
tr: Salt okunur yapılarına otomatik olarak uygulanan örnek özellikler salt okunur olmalıdır.
zh_hans: 在只读结构中的自动实现实例属性必须为只读。
zh_hant: 使用唯讀結構的自動實作執行個體屬性必須為唯讀。

# ERR_FieldlikeEventsInRoStruct
source: Field-like events are not allowed in readonly structs.
cs: Události podobné poli nejsou povolené ve strukturách jen pro čtení.
de: Feldähnliche Ereignisse sind in schreibgeschützten Strukturen unzulässig.
es: No se admiten eventos de tipo campo en estructuras readonly.
fr: Les événements comparables à des champs ne sont pas autorisés dans les structs en lecture seule.
it: Nelle struct di sola lettura non sono consentiti eventi simili a campi.
ja: 読み取り専用の構造体では、フィールドに類似したイベントを使用することができません。
ko: 읽기 전용 구조체에는 필드와 유사한 이벤트를 사용할 수 없습니다.
pl: Zdarzenia podobne do pól nie są dozwolone w strukturach tylko do odczytu.
pt_br: Eventos semelhantes a campos não são permitidos em structs somente leitura.
ru: Подобные полям события не допускаются в структурах только для чтения.
tr: Salt okunur yapı birimlerinde alan benzeri olaylara izin verilmez.
zh_hans: 在只读结构中不允许类似字段的事件。
zh_hant: 唯讀結構中不允許欄位型的事件。

# IDS_FeatureRefExtensionMethods
source: ref extension methods
cs: rozšiřující metody REF
de: Referenzerweiterungsmethoden
es: métodos de extensión ref
fr: méthodes d'extension par référence
it: metodi di estensione ref
ja: ref 拡張メソッド
ko: ref 확장 메서드
pl: metody rozszerzenia ref
pt_br: métodos de extensão de referência
ru: ссылочные методы расширения
tr: başvuru genişletme yöntemleri
zh_hans: ref 扩展方法
zh_hant: ref 擴充方法

# ERR_StackAllocConversionNotPossible
source: Conversion of a stackalloc expression of type '{0}' to type '{1}' is not possible.
cs: Převod výrazu stackalloc typu {0} na typ {1} není možný.
de: Die Umwandlung eines stackalloc-Ausdrucks vom Typ "{0}" in den Typ "{1}" ist nicht möglich.
es: La conversión de una expresión stackalloc del tipo "{0}" al tipo "{1}" no es posible.
fr: La conversion d'une expression stackalloc de type '{0}' en type '{1}' n'est pas possible.
it: Non è possibile eseguire la conversione di un'espressione stackalloc di tipo '{0}' nel tipo '{1}'.
ja: 型 '{0}' の stackalloc 式を型 '{1}' に変換することはできません。
ko: {0}' 형식 stackalloc 식을 '{1}' 형식으로 변환할 수 없습니다.
pl: Konwersja wyrażenia stackalloc typu „{0}” na typ „{1}” nie jest możliwa.
pt_br: A conversão de uma expressão stackalloc do tipo '{0}' para o tipo '{1}' não é possível.
ru: Невозможно преобразовать выражение stackalloc типа "{0}" в тип "{1}".
tr: {0}' türünde bir stackalloc ifadesinin türü, '{1}' türüne dönüştürülemez.
zh_hans: 不能将 stackalloc 表达式的类型从“{0}”转换为“{1}”。
zh_hant: 類型 '{0}' 的 stackalloc 運算式不可能轉換成類型 '{1}'。

# ERR_RefExtensionMustBeValueTypeOrConstrainedToOne
source: The first parameter of a 'ref' extension method '{0}' must be a value type or a generic type constrained to struct.
cs: První parametr rozšiřující metody ref {0} musí být typem hodnoty nebo obecným typem omezeným na strukturu.
de: Der erste Parameter einer ref-Erweiterungsmethode "{0}" muss ein Werttyp oder ein generischer Typ sein, der auf die Struktur eingeschränkt ist.
es: El primer parámetro de un método de extensión "ref" "{0}" debe ser un tipo de valor o un tipo genérico restringido a struct.
fr: Le premier paramètre d'une méthode d'extension 'ref' '{0}' doit être un type valeur ou un type générique limité à struct.
it: Il primo parametro di un metodo di estensione 'ref' '{0}' deve essere un tipo valore o un tipo generico vincolato a struct.
ja: ref' 拡張メソッド '{0}' の最初のパラメーターは、値型または構造体に制限されたジェネリック型でなければなりません。
ko: ref' 확장 메서드 '{0}'의 첫 번째 매개 변수는 값 형식이거나 구조체의 제약을 받는 제네릭 형식이어야 합니다.
pl: Pierwszy parametr metody rozszerzenia „ref” „{0}” musi być typem wartości lub typem ogólnym ograniczonym do struktury.
pt_br: O primeiro parâmetro de um método de extensão "ref" "{0}" deve ser um tipo de valor ou um tipo genérico restrito a struct.
ru: Первый параметр метода расширения "ref" "{0}" должен иметь тип значения или универсальный тип, ограниченный структурой.
tr: ref' genişletme metodu '{0}' için ilk parametre, değer türünde veya struct ile kısıtlanmış genel türde olmalıdır.
zh_hans: "ref" 扩展方法“{0}”的第一个参数必须是值类型或受结构约束的泛型类型。
zh_hant: ref' 擴充方法 '{0}' 的第一個參數，必須是限制為結構的實值型別或泛型型別。

# ERR_OutAttrOnInParam
source: An in parameter cannot have the Out attribute.
cs: Parametr in nemůže obsahovat atribut Out.
de: Ein in-Parameter kann kein Out-Attribut aufweisen.
es: Un parámetro In no puede tener un atributo Out.
fr: Un paramètre in ne peut pas avoir l'attribut Out
it: Un parametro in non può avere l'attributo Out.
ja: in パラメーターに Out 属性を指定することはできません。
ko: in 매개 변수에는 Out 특성을 사용할 수 없습니다.
pl: W parametrze wejściowym nie może występować atrybut wyjściowy.
pt_br: Um parâmetro In não pode ter o atributo Out.
ru: Входной параметр не может иметь атрибут Out.
tr: Bir In parametresinin Out özniteliği olamaz
zh_hans: in 参数不能具有 Out 特性。
zh_hant: in 參數不能有 Out 屬性

# ICompoundAssignmentOperationIsNotCSharpCompoundAssignment
source: {0} is not a valid C# compound assignment operation
cs: {0} není platná operace složeného přiřazení jazyka C#.
de: "{0}" ist kein gültiger C#-Verbundzuweisungsvorgang.
es: {0} no es una operación de asignación compuesta de C# válida
fr: {0} n'est pas une opération d'assignation composée C# valide
it: {0} non è un'operazione valida di assegnazione composta C#
ja: {0} は有効な C# の複合代入操作ではありません
ko: {0}(은)는 유효한 C# 복합 할당 연산이 아닙니다.
pl: {0} nie jest prawidłową złożoną operacją przypisania w języku C#
pt_br: {0} não é uma operação de atribuição composta de C# válida
ru: {0} не является допустимой операцией составного назначения C#
tr: {0} geçerli bir C# bileşik atama işlemi değil
zh_hans: {0} 不是有效的 C# 复合赋值运算
zh_hant: {0} 不是有效的 C# 複合指派作業
