Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ProtectedInStatic
source: '{0}': static classes cannot contain protected members
cs: {0}: Statické třídy nemůžou obsahovat chráněné členy.
de: '"{0}": Statische Klassen dürfen keine geschützten Member enthalten.
es: '{0}': las clases estáticas no pueden contener miembros protegidos
fr: '{0}' : les classes static ne peuvent pas contenir de membres protected
it: '{0}': le classi statiche non possono contenere membri protetti
ja: '{0}': 静的クラスにプロテクト メンバーを含めることはできません
ko: '{0}': 정적 클래스는 protected 멤버를 포함할 수 없습니다.
pl: „{0}”: klasy statyczne nie mogą zawierać chronionych składowych
pt_br: "{0}": classes static não podem conter membros protegidos
ru: "{0}": статические классы не могут содержать защищенные члены.
tr: '{0}': statik sınıflar korumalı üyeler içeremez
zh_hans: “{0}”: 静态类不能包含保护成员
zh_hant: '{0}': 靜態類別不可包含 Protected 成員

# WRN_UnreachableGeneralCatch
source: A previous catch clause already catches all exceptions. All non-exceptions thrown will be wrapped in a System.Runtime.CompilerServices.RuntimeWrappedException.
cs: Předchozí klauzule catch už zachycuje všechny výjimky. Všechny vyvolané události, které nejsou výjimkami, budou zahrnuty do obálky třídy System.Runtime.CompilerServices.RuntimeWrappedException.
de: Eine vorherige Catch-Klausel hat bereits alle Ausnahmen abgefangen. Alle ausgelösten Nicht-Ausnahmen werden von einer System.Runtime.CompilerServices.RuntimeWrappedException umschlossen.
es: Una cláusula catch previa ya detecta todas las excepciones. Las no excepciones producidas se incluirán en System.Runtime.CompilerServices.RuntimeWrappedException.
fr: Une clause catch précédente intercepte déjà toutes les exceptions. Tous les objets levés autres que les exceptions seront enveloppées dans System.Runtime.CompilerServices.RuntimeWrappedException.
it: Una clausola catch precedente rileva già tutte le eccezioni. Verrà eseguito il wrapping di tutti gli oggetti generati diversi da un'eccezione in System.Runtime.CompilerServices.RuntimeWrappedException.
ja: 前の catch 句は、すべての例外を既にキャッチしています。スローされる例外以外のものはすべて System.Runtime.CompilerServices.RuntimeWrappedException にラップされます。
ko: 이전의 catch 절에서 이미 모든 예외를 catch합니다. 예외가 아닌 모든 throw된 항목은 System.Runtime.CompilerServices.RuntimeWrappedException에 래핑됩니다.
pl: Poprzednia klauzula catch przechwytuje już wszystkie wyjątki. Wszystkie wywołane elementy niebędące wyjątkami zostaną opakowane w elemencie System.Runtime.CompilerServices.RuntimeWrappedException.
pt_br: Uma cláusula catch anterior já captura todas as exceções. Todas as não exceções lançadas serão ajustadas em uma System.Runtime.CompilerServices.RuntimeWrappedException.
ru: Предыдущее предложение catch уже перехватывает все исключения. Все возникшие необработанные исключения будут перенесены в System.Runtime.CompilerServices.RuntimeWrappedException.
tr: Önceki catch yan tümcesi tüm özel durumları zaten yakalıyor. Oluşturulan özel olmayan durumlar System.Runtime.CompilerServices.RuntimeWrappedException içinde sarmalanır.
zh_hans: 上一个 catch 子句已捕获所有异常。引发的所有非异常均被包装在 System.Runtime.CompilerServices.RuntimeWrappedException 中。
zh_hant: 上一個 catch 子句已經攔截所有的例外狀況。所有擲回的非例外狀況都將包裝在 System.Runtime.CompilerServices.RuntimeWrappedException 中。

# WRN_UnreachableGeneralCatch_Title
source: A previous catch clause already catches all exceptions
cs: Předchozí klauzule catch už zachytává všechny výjimky.
de: Eine vorherige Catch-Klausel erfasst bereits alle Ausnahmen
es: Una cláusula catch ya abarca todas las excepciones
fr: Une clause catch précédente intercepte déjà toutes les exceptions
it: Una clausola catch precedente rileva già tutte le eccezioni
ja: 前の catch 句は、すべての例外を既にキャッチしています
ko: 이전의 catch 절에서 이미 모든 예외를 catch합니다.
pl: Poprzednia klauzula catch przechwytuje już wszystkie wyjątki
pt_br: Uma cláusula catch anterior já captura todas as exceções
ru: Предыдущее выражение catch уже получило все исключения
tr: Önceki catch yan tümcesi tüm özel durumları zaten yakalıyor
zh_hans: 上一个 catch 子句已经捕获了所有异常
zh_hant: 前一個 catch 子句已提取所有例外狀況

# WRN_UnreachableGeneralCatch_Description
source: This warning is caused when a catch() block has no specified exception type after a catch (System.Exception e) block. The warning advises that the catch() block will not catch any exceptions. A catch() block after a catch (System.Exception e) block can catch non-CLS exceptions if the RuntimeCompatibilityAttribute is set to false in the AssemblyInfo.cs file: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. If this attribute is not set explicitly to false, all thrown non-CLS exceptions are wrapped as Exceptions and the catch (System.Exception e) block catches them.
cs: Toto varování způsobuje, když blok catch() nemá žádný zadaný typ výjimky po bloku catch (System.Exception e). Varování informuje, že blok catch() nezachytí žádné výjimky. Blok catch() po bloku catch (System.Exception e) může zachytit výjimky, které nesouvisí se specifikací CLS, pokud je RuntimeCompatibilityAttribute nastavený na false v souboru AssemblyInfo.cs: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Pokud tento atribut není nastavený explicitně na false, všechny výjimky, které nesouvisí se specifikací CLS, se dostanou do balíčku Exceptions a blok catch (System.Exception e) je zachytí.
de: Diese Warnung wird verursacht, wenn bei einem catch()-Block nach einem catch (System.Exception e)-Block kein Ausnahmetyp angegeben ist. Die Warnung empfiehlt, dass der catch()-Block keine Ausnahmen erfasst. Ein catch()-Block nach einem catch (System.Exception e)-Block kann nicht-CLS-Ausnahmen erfassen, wenn für das RuntimeCompatibilityAttribute false in der AssemblyInfo.cs-Datei festgelegt wird: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Wenn für dieses Attribut nicht explizit false festgelegt wird, werden alle ausgelösten nicht-CLS-Ausnahmen als Ausnahmen gepackt und der catch (System.Exception e)-Block erfasst sie.
es: Esta advertencia se produce cuando un bloque catch() no tiene especificado un tipo de excepción después de un bloque catch (System.Exception e). La advertencia avisa de que el bloque catch() no abarcará ninguna excepción. Un bloque catch() después de un bloque catch (System.Exception e) puede abarcar excepciones que no sean CLS si RuntimeCompatibilityAttribute se establece como falso en el archivo AssemblyInfo.cs: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Si este atributo no se establece explícitamente como falso, todas las excepciones que no sean CLS lanzadas se ajustarán como Excepciones y el bloque catch (System.Exception e) las abarcará.
fr: Cet avertissement survient lorsqu'un bloc catch() n'a pas de type d'exception spécifié après un bloc catch (System.Exception e). L'avertissement vous informe du fait que le bloc catch() n'interceptera aucune exception. Un bloc catch() après un bloc catch (System.Exception e) peut intercepter des exceptions non-CLS si le RuntimeCompatibilityAttribute est défini sur false dans le fichier AssemblyInfo.cs : [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Si cet attribut n'est pas défini sur false de façon explicite, toutes les exceptions non-CLS levées sont enveloppées en tant qu'exceptions et le bloc catch (System.Exception e) les intercepte.
it: Questo avviso viene visualizzato quando per un blocco catch() non è stato specificato un tipo di eccezione dopo un blocco catch (System.Exception e). L'avviso indica che il blocco catch() non rileverà alcuna eccezione. Un blocco catch() dopo un blocco catch (System.Exception e) può rilevare eccezioni non CLS se RuntimeCompatibilityAttribute è impostato su false nel file AssemblyInfo.cs file: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Se questo attributo non è impostato in modo esplicito su false, verrà eseguito il wrapping di tutte le eccezioni non CLS rilevate come Exception per consentire al blocco catch (System.Exception e) di rilevarle.
ja: この警告は、catch (System.Exception e) ブロックの後に catch() ブロックに指定された例外の型がない場合に発生します。警告は、catch() ブロックが例外をキャッチしないことを通知します。 AssemblyInfo.cs ファイルで RuntimeCompatibilityAttribute が false に設定されている場合 [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]、catch (System.Exception e) ブロックの後の catch() ブロックは、CLS でない例外をキャッチできます。この属性が明示的に false に設定されていない場合、すべてのスローされた CLS でない例外は例外として折り返され、catch (System.Exception e) ブロックによってキャッチされます。
ko: 이 경고는 catch() 블록의 catch (System.Exception e) 블록 뒤에 지정된 예외 형식이 없을 때 발생합니다. 이 경고는 catch() 블록이 예외를 catch하지 않음을 알려줍니다. catch (System.Exception e) 블록 뒤의 catch() 블록은 RuntimeCompatibilityAttribute가 AssemblyInfo.cs 파일에 false로 설정되어 있는 경우 CLS가 아닌 예외를 catch할 수 있습니다. [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. 이 특성이 false로 명시적으로 설정되어 있지 않은 경우 모든 throw되는 CLS가 아닌 예외가 예외로 래핑되고 catch (System.Exception e) 블록에서 해당 예외를 catch합니다.
pl: To ostrzeżenie występuje, gdy blok catch() nie ma określonego typu wyjątku po bloku catch (System.Exception e). Ostrzeżenie zawiera zalecenie, aby blok catch() nie przechwytywało żadnych wyjątków. Blok catch() po bloku catch (System.Exception e) może przechwytywać wyjątki niezgodne ze specyfikacją CLS, jeśli element RuntimeCompatibilityAttribute ma ustawioną wartość false w pliku AssemblyInfo.cs: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Jeśli ten atrybut nie ma jawnie ustawionej wartości false, wszystkie zgłaszane wyjątki niezgodne ze specyfikacją CLS są opakowywane jako wyjątki przez blok catch (System.Exception e).
pt_br: Este aviso ocorre quando um bloco catch() não tem nenhuma exceção de tipo especificada após um bloco catch (System.Exception e). O aviso indica que o bloco de catch() não capturará exceções. Um bloco catch() depois de um bloco catch (System.Exception e) poderá capturar exceções não CLS se o RuntimeCompatibilityAttribute estiver definido como false no arquivo AssemblyInfo.cs: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Se esse atributo não for definido explicitamente como false, todas as exceções geradas não-CLS são encapsuladas como exceções e o bloco catch (System.Exception e) as captura.
ru: Это предупреждение возникает, если в блоке catch() не указан тип исключений после блока catch (System.Exception e). В предупреждении рекомендуется, чтобы блок catch() не получал исключения. В блоке catch(), находящемся после блока catch (System.Exception e), могут возникнуть исключения, не связанные с CLS, если для параметра RuntimeCompatibilityAttribute задано значение false в файле AssemblyInfo.cs: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Если для этого атрибута не задано явно значение false, все исключения, не связанные с CLS, упаковываются как исключения и их получает блок catch (System.Exception e).
tr: Bir catch() bloğunun bir catch (System.Exception e) bloğundan sonra belirtilen hiçbir özel durum türü olmadığında bu uyarı oluşur. Uyarı catch() bloğunun hiçbir özel durum yakalamayacağı konusunda bilgi verir. RuntimeCompatibilityAttribute AssemblyInfo.cs dosyasında false olarak ayarlanmışsa bir catch (System.Exception e) bloğundan sonraki bir catch() bloğu CLS olmayan özel durumları yakalayabilir: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]. Bu öznitelik açıkça false olarak ayarlanmamışsa, tüm oluşan CLS olmayan özel durumlar Özel Durumlar olarak sarmalanır ve catch (System.Exception e) bloğu bunları yakalar.
zh_hans: 当 catch() 块未在 catch (System.Exception e) 块之后指定异常类型时，会出现此警告。该警告建议 catch() 块不捕获任何异常。 如果 RuntimeCompatibilityAttribute 在 AssemblyInfo.cs 文件中设置为 false，则 catch (System.Exception e) 块之后的 catch() 块可以捕获非 CLS 异常: [程序集: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]。如果此特性未显式设置为 false，则所有引发的非 CLS 异常都包装为“异常”，catch (System.Exception e) 块可以捕获它们。
zh_hant: 如果 catch() 區塊未在 catch (System.Exception e) 區塊後面指定例外狀況類型，則會導致此警告。此警告會建議 catch() 區塊將不會擷取任何例外狀況。 如果 AssemblyInfo.cs 檔案中的 RuntimeCompatibilityAttribute 設定為 false，則 catch (System.Exception e) 區塊後面的 catch() 區塊可以擷取非 CLS 例外狀況: [assembly: RuntimeCompatibilityAttribute(WrapNonExceptionThrows = false)]。如果此屬性未明確地設定為 false，則所有擲回的非 CLS 例外狀況都會包裝為例外狀況，而 catch (System.Exception e) 區塊會加以擷取。

# ERR_IncrementLvalueExpected
source: The operand of an increment or decrement operator must be a variable, property or indexer
cs: Operandem operátoru přičtení nebo odečtení musí být proměnná, vlastnost nebo indexer.
de: Der Operand eines Inkrement- oder Dekrementoperators muss eine Variable, eine Eigenschaft oder ein Indexer sein.
es: El operando de un operador de incremento o decremento debe ser una variable, una propiedad o un indizador
fr: L'opérande d'un opérateur d'incrémentation ou de décrémentation doit être une variable, une propriété ou un indexeur
it: L'operando di un operatore di incremento o decremento deve essere una variabile, una proprietà o un indicizzatore
ja: インクリメント演算子またはデクリメント演算子のオペランドには、変数、プロパティ、またはインデクサーを指定してください
ko: 증가 연산자 또는 감소 연산자의 피연산자는 변수, 속성 또는 인덱서여야 합니다.
pl: Argument operatora zwiększania lub zmniejszania musi być zmienną, właściwością lub indeksatorem.
pt_br: O operando de aumento ou diminuição deve ser uma variável, propriedade ou indexador
ru: Операндом оператора инкремента или декремента должна быть переменная, свойство или индексатор.
tr: Artırma veya azaltma işlecinin işleyicisi bir değişken, özellik veya dizin erişimcisi olmalıdır
zh_hans: 递增或递减运算符的操作数必须是变量、属性或索引器
zh_hant: 遞增或遞減運算子的運算元必須是變數、屬性或索引子

# ERR_NoSuchMemberOrExtension
source: '{0}' does not contain a definition for '{1}' and no accessible extension method '{1}' accepting a first argument of type '{0}' could be found (are you missing a using directive or an assembly reference?)
cs: {0} neobsahuje definici pro {1} a nenašla se žádná dostupná metoda rozšíření {1}, která by přijímala první argument typu {0}. (Nechybí direktiva using nebo odkaz na sestavení?)
de: "{0}" enthält keine Definition für "{1}", und es konnte keine zugängliche {1}-Erweiterungsmethode gefunden werden, die ein erstes Argument vom Typ "{0}" akzeptiert (möglicherweise fehlt eine using-Direktive oder ein Assemblyverweis).
es: "{0}" no contiene una definición para "{1}" ni un método de extensión accesible "{1}" que acepte un primer argumento del tipo "{0}" (¿falta alguna directiva using o una referencia de ensamblado?)
fr: '{0}' ne contient pas de définition pour '{1}' et aucune méthode d'extension accessible '{1}' acceptant un premier argument de type '{0}' n'a été trouvée (une directive using ou une référence d'assembly est-elle manquante ?)
it: '{0}' non contiene una definizione di '{1}' e non è stato trovato alcun metodo di estensione accessibile '{1}' che accetta un primo argomento di tipo '{0}'. Probabilmente manca una direttiva using o un riferimento all'assembly.
ja: '{0}' に '{1}' の定義が含まれておらず、型 '{0}' の最初の引数を受け付けるアクセス可能な拡張メソッド '{1}' が見つかりませんでした。using ディレクティブまたはアセンブリ参照が不足していないことを確認してください
ko: '{0}'에는 '{1}'에 대한 정의가 포함되어 있지 않고, '{0}' 형식의 첫 번째 인수를 허용하는 액세스 가능한 확장 메서드 '{1}'이(가) 없습니다. using 지시문 또는 어셈블리 참조가 있는지 확인하세요.
pl: Element „{0}” nie zawiera definicji „{1}” i nie odnaleziono dostępnej metody rozszerzenia „{1}”, która przyjmuje pierwszy argument typu „{0}” (czy nie brakuje dyrektywy using lub odwołania do zestawu?).
pt_br: ‘{0}’ não contém uma definição para "{1}" e não foi possível encontrar nenhum método de extensão "{1}" que aceite um primeiro argumento do tipo ‘{0}’ (você está se esquecendo de usar uma diretiva ou uma referência de assembly?)
ru: "{0}" не содержит определения "{1}", и не удалось найти доступный метод расширения "{1}", принимающий тип "{0}" в качестве первого аргумента (возможно, пропущена директива using или ссылка на сборку).
tr: '{0}' bir '{1}' tanımı içermiyor ve '{0}' türünde bir ilk bağımsız değişken kabul eden hiçbir erişilebilir '{1}' genişletme yöntemi bulunamadı (bir kullanma yönergeniz veya derleme başvurunuz eksik olabilir mi?)
zh_hans: “{0}”未包含“{1}”的定义，并且找不到可接受第一个“{0}”类型参数的可访问扩展方法“{1}”(是否缺少 using 指令或程序集引用?)
zh_hant: '{0}' 未包含 '{1}' 的定義，也找不到可接受類型 '{0}' 第一個引數的可存取擴充方法 '{1}' (是否遺漏 using 指示詞或組件參考?)

# ERR_NoSuchMemberOrExtensionNeedUsing
source: '{0}' does not contain a definition for '{1}' and no extension method '{1}' accepting a first argument of type '{0}' could be found (are you missing a using directive for '{2}'?)
cs: {0} neobsahuje definici pro {1} a nenašla se žádná metoda rozšíření {1}, která by přijímala první argument typu {0}. (Nechybí direktiva using pro {2}?)
de: '"{0}" enthält keine Definition für "{1}", und es konnte keine {1}-Erweiterungsmethode gefunden werden, die ein erstes Argument vom Typ "{0}" akzeptiert (möglicherweise fehlt eine using-Direktive für "{2}").
es: '{0}' no contiene una definición para '{1}' y no se encontró ningún método de extensión '{1}' que acepte un primer argumento de tipo '{0}' (¿falta alguna directiva using para '{2}'?)
fr: '{0}' ne contient pas de définition pour '{1}' et aucune méthode d'extension '{1}' acceptant un premier argument de type '{0}' n'a été trouvée (vous manque-t-il une directive using pour '{2}' ?)
it: '{0}' non contiene una definizione di '{1}' e non è stato trovato alcun metodo di estensione '{1}' che accetta un primo argomento di tipo '{0}'. Probabilmente manca una direttiva using per '{2}'.
ja: '{0}' に '{1}' の定義が含まれておらず、型 '{0}' の最初の引数を受け付ける拡張メソッド '{1}' が見つかりませんでした ('{2}' の using ディレクティブが不足していないことを確認してください)
ko: '{0}'에는 '{1}'에 대한 정의가 포함되어 있지 않고, '{0}' 형식의 첫 번째 인수를 허용하는 확장 메서드 '{1}' 이(가) 없습니다. '{2}'에 대한 using 지시문이 있는지 확인하세요.
pl: 'Element „{0}” nie zawiera definicji elementu „{1}” i nie można znaleźć metody rozszerzenia „{1}” przyjmującej pierwszy argument typu „{0}” (brak dyrektywy using dla elementu „{2}”?)
pt_br: "{0}" não contém uma definição para "{1}" e nenhum método de extensão "{1}" aceitando um primeiro argumento do tipo "{0}" pode ser encontrado (está faltando uma diretiva using para "{2}"?)
ru: "{0}" не содержит определения для "{1}", и не удалось найти метод расширения "{1}", принимающий тип "{0}" в качестве первого аргумента (возможно, пропущена директива using для "{2}").
tr: '{0}' bir '{1}' tanımı içermiyor ve '{0}' türünde bir ilk bağımsız değişken kabul eden hiçbir '{1}' genişletme yöntemi bulunamadı ('{2}' için bir kullanma yönergeniz eksik olabilir mi?)
zh_hans: “{0}”不包含“{1}”的定义，并且找不到可接受类型为“{0}”的第一个参数的扩展方法“{1}”(是否缺少针对“{2}”的 using 指令?)
zh_hant: '{0}' 未包含 '{1}' 的定義，也找不到擴充方法 '{1}' 可接受類型 '{0}' 的第一個引數 (是否遺漏 '{2}' 的 using 指示詞?)

# ERR_BadThisParam
source: Method '{0}' has a parameter modifier 'this' which is not on the first parameter
cs: Metoda {0} má modifikátor parametru this, který není na prvním parametru.
de: Die Methode "{0}" weist einen this-Parametermodifizierer auf, der nicht für den ersten Parameter angegeben ist.
es: El método '{0}' tiene un modificador de parámetro 'this' que no está en el primer parámetro
fr: La méthode '{0}' a un modificateur de paramètre 'this' qui ne figure pas dans le premier paramètre
it: Il metodo '{0}' ha un modificatore di parametro 'this' che non si trova nel primo parametro
ja: メソッド '{0}' には、最初のパラメーターではないパラメーター修飾子 'this' が指定されています
ko: {0}' 메서드의 첫 번째 매개 변수가 아닌 매개 변수에 매개 변수 한정자 'this'가 있습니다.
pl: Metoda „{0}” zawiera modyfikator parametru „this”, który nie znajduje się w pierwszym parametrze
pt_br: Método "{0}" tem um modificador de parâmetro "this" que não está no primeiro parâmetro
ru: Метод "{0}" имеет параметр с модификатором "this", не являющийся первым параметром метода.
tr: {0}' yönteminin, ilk parametrede yer almayan bir 'this' parametre değiştiricisi var
zh_hans: 方法“{0}”具有一个参数修饰符“this”，该修饰符不在第一个参数上
zh_hant: 方法 '{0}' 具有參數修飾元 'this'，但其不在第一個參數上

# ERR_BadParameterModifiers
source: The parameter modifier '{0}' cannot be used with '{1}'
cs: Modifikátor parametru {0} nejde použít s modifikátorem {1}.
de: Der Parametermodifizierer "{0}" kann nicht mit "{1}" verwendet werden.
es: El modificador de parámetro "{0}" no se puede usar con "{1}".
fr: Impossible d'utiliser le modificateur de paramètre '{0}' avec '{1}'
it: Non è possibile usare il modificatore di parametro '{0}' con '{1}'
ja: パラメーター修飾子 '{0}' は '{1}' と一緒に使用することはできません
ko: 매개 변수 한정자 '{0}'을(를) '{1}'과(와) 함께 사용할 수 없습니다.
pl: Modyfikator parametru „{0}” nie może być używany z elementem „{1}”
pt_br: O modificador de parâmetro '{0}' não pode ser usado com '{1}'
ru: Модификатор параметра "{0}" не может использоваться с "{1}"
tr: {0}' parametre değiştiricisi, '{1}' ile kullanılamaz
zh_hans: 参数修饰符“{0}”不能与“{1}”一起使用
zh_hant: 參數修飾元 '{0}' 不可搭配 '{1}' 使用

# ERR_BadTypeforThis
source: The receiver parameter of an extension cannot be of type '{0}'
it: Il primo parametro di un metodo di estensione non può essere di tipo '{0}'
pt_br: O parâmetro de receptor de uma extensão não pode ser do tipo "{0}"
ru: Первый параметр метода расширения не может иметь тип "{0}".
zh_hans: 扩展方法的第一个参数的类型不能是“{0}”

# ERR_BadParamModThis
source: A parameter array cannot be used with 'this' modifier on an extension method
cs: V metodě rozšíření nejde použít pole parametrů s modifikátorem this.
de: Ein Parameterarray kann für eine Erweiterungsmethode nicht mit dem this-Modifizierer verwendet werden.
es: Una matriz de parámetros no se puede usar con el modificador 'this' en un método de extensión
fr: Un tableau de paramètres ne peut pas être utilisé avec le modificateur 'this' dans une méthode d'extension
it: Non è possibile usare una matrice di parametri con il modificatore 'this' in un metodo di estensione
ja: パラメーター配列は、拡張メソッドで 'this' 修飾子と共に使用することはできません
ko: 매개 변수 배열은 확장 메서드의 'this' 한정자와 함께 사용할 수 없습니다.
pl: Tablicy parametrów nie można używać z modyfikatorem „this” w metodzie rozszerzenia.
pt_br: Uma matriz de parâmetro não pode ser usada com o modificador 'this' em um método de extensão
ru: Массив параметров не может быть использован с модификатором "this" в методе расширения.
tr: Parametre dizisi, bir genişletme yönteminde 'this' değiştiricisiyle birlikte kullanılamaz
zh_hans: 参数数组不能与“this”修饰符一起在扩展方法中使用
zh_hant: 擴充方法中，參數陣列不可用於 'this' 修飾元

# ERR_BadExtensionMeth
source: Extension method must be static
cs: Metoda rozšíření musí být statická.
de: Die Erweiterungsmethode muss statisch sein.
es: Un método de extensión debe ser estático
fr: La méthode d'extension doit être statique
it: Il metodo di estensione deve essere statico
ja: 拡張メソッドはスタティックでなければなりません
ko: 확장 메서드는 정적이어야 합니다.
pl: Metoda rozszerzenia musi być statyczna.
pt_br: O método de extensão deve ser estático
ru: Метод расширения должен быть статическим.
tr: Genişletme yöntemi statik olmalıdır
zh_hans: 扩展方法必须是静态的
zh_hant: 擴充方法必須為靜態

# ERR_BadExtensionAgg
source: Extension method must be defined in a non-generic static class
cs: Metoda rozšíření musí být definovaná v neobecné statické třídě.
de: Die Erweiterungsmethode muss in einer nicht generischen statischen Klasse definiert werden.
es: Un método de extensión debe definirse en una clase estática no genérica
fr: La méthode d'extension doit être définie dans une classe statique non générique
it: Il metodo di estensione deve essere definito in una classe statica non generica
ja: 拡張メソッドは、非ジェネリック静的クラスで定義される必要があります
ko: 확장 메서드는 제네릭이 아닌 정적 클래스에 정의해야 합니다.
pl: Metoda rozszerzenia musi być zdefiniowana w nieogólnej klasie statycznej.
pt_br: O método de extensão deve ser definido em uma classe estática não genérica
ru: Метод расширения должен быть определен в неуниверсальном статическом классе.
tr: Genişletme yöntemi genel olmayan bir statik sınıfta tanımlanmalıdır
zh_hans: 扩展方法必须在非泛型静态类中定义
zh_hant: 擴充方法必須在非泛型靜態類別中定義
