Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_SingleTypeNameNotFoundFwd
source: The type name '{0}' could not be found. This type has been forwarded to assembly '{1}'. Consider adding a reference to that assembly.
cs: Název typu {0} se nenašel. Typ se předal do sestavení {1}. Zvažte přidání odkazu do tohoto sestavení.
de: Der Typname "{0}" wurde nicht gefunden. Dieser Typ wurde an Assembly "{1}" weitergeleitet. Sie sollten einen Verweis auf die Assembly hinzufügen.
es: No se encontró el nombre del tipo '{0}'. Este tipo se ha reenviado al ensamblado '{1}'. Puede agregar una referencia a ese ensamblado.
fr: Le nom de type '{0}' est introuvable. Ce type a été transmis à l'assembly '{1}'. Ajoutez une référence à cet assembly.
it: Il nome di tipo '{0}' non è stato trovato. Il tipo è stato inoltrato all'assembly '{1}'. Provare ad aggiungere un riferimento all'assembly.
ja: 型名 '{0}' が見つかりませんでした。この型はアセンブリ '{1}' に転送されています。このアセンブリに参照を追加することを検討してください。
ko: 형식 이름 '{0}'이(가) 없습니다. 이 형식은 '{1}' 어셈블리에 전달되었습니다. 해당 어셈블리에 대한 참조를 추가하세요.
pl: Nie można znaleźć nazwy typu „{0}”. Ten typ został przekazany do zestawu „{1}”. Rozważ dodanie odwołania do tego zestawu.
pt_br: O nome do tipo "{0}" não pode ser encontrado. Esse tipo foi encaminhado para o assembly "{1}". Considere adicionar uma referência a esse assembly.
ru: Не удалось найти имя типа "{0}". Этот тип был перемещен в сборку "{1}". Возможно, стоит добавить ссылку на эту сборку.
tr: {0}' tür adı bulunamadı. Bu tür '{1}' derlemesine iletilmiş. Bu derlemeye bir başvuru eklemeyi deneyin.
zh_hans: 未能找到类型名“{0}”。此类型已转发到程序集“{1}”。请考虑添加对该程序集的引用。
zh_hant: 找不到類型名稱 '{0}'。此類型已經轉送給組件 '{1}'。請考慮加入該組件的參考。

# ERR_AssemblySpecifiedForLinkAndRef
source: Assemblies '{0}' and '{1}' refer to the same metadata but only one is a linked reference (specified using /link option); consider removing one of the references.
cs: Sestavení {0} a {1} odkazují na stejná metadata, ale jenom v jednom případě je to propojený odkaz (zadaný s možností /link). Zvažte odebrání jednoho z odkazů.
de: Assemblys "{0}" und "{1}" verweisen auf die gleichen Metadaten, aber nur eine ist ein verknüpfter Verweis (angegeben mit der /link-Option). Sie sollten einen der Verweise entfernen.
es: Los ensamblados '{0}' y '{1}' hacen referencia a los mismos metadatos, pero solo uno es una referencia vinculada (especificada con la opción /link): puede quitar una de las referencias.
fr: Les assemblys '{0}' et '{1}' font référence aux mêmes métadonnées, mais un seul est une référence liée (spécifiée avec l'option using /link) ; supprimez une des références.
it: Gli assembly '{0}' e '{1}' fanno riferimento agli stessi metadati ma solo uno è un riferimento collegato (specificato con l'opzione /link). Provare a rimuovere uno dei riferimenti.
ja: アセンブリ '{0}' および '{1}' は同じメタデータを参照していますが、リンクされている参照 (/link オプションを使用して指定される) は 1 つのみです。いずれかの参照を削除することを検討してください。
ko: {0}' 및 '{1}' 어셈블리가 동일한 메타데이터를 참조하지만 하나만 링크된 참조이며 /link 옵션을 사용하여 지정되었습니다. 참조 중 하나를 제거하세요.
pl: Zestawy „{0}” i „{1}” odwołują się do tych samych metadanych, ale tylko jeden z nich jest odwołaniem połączonym (określonym za pomocą opcji /link); rozważ usunięcie jednego z odwołań.
pt_br: Assemblies "{0}" e "{1}" referem-se aos mesmos metadados, mas somente um é uma referência vinculada (especificada usando a opção /link); considere remover uma das referências.
ru: Сборки "{0}" и "{1}" ссылаются на одни метаданные, но только одна из них является связанной ссылкой (указан параметр using /link); попробуйте удалить одну из ссылок.
tr: {0}' ve '{1}' derlemeleri aynı meta veriye başvurur ancak yalnızca biri bağlantılı bir başvurudur (/link seçeneği kullanılarak belirtilir); başvurulardan birini kaldırmayı deneyin.
zh_hans: 程序集“{0}”和“{1}”引用相同元数据，但是只有一个是链接引用(使用 /link 选项指定)；请考虑删除其中一个引用。
zh_hant: 組件 '{0}' 和 '{1}' 參考相同的中繼資料，但只有一個是連結的參考 (使用 /link 選項指定); 請考慮移除其中一個參考。

# WRN_DeprecatedCollectionInitAdd
source: The best overloaded Add method '{0}' for the collection initializer element is obsolete.
cs: Optimální přetěžovaná metoda Add {0} pro element inicializátoru kolekce je zastaralá.
de: Die beste überladene Add-Methode "{0}" für das Sammlungsinitialisiererelement ist veraltet.
es: El mejor método Add sobrecargado '{0}' para el elemento inicializador de la colección está obsoleto.
fr: La meilleure méthode Add surchargée '{0}' pour l'élément initialiseur de collection est obsolète.
it: Il miglior metodo Add di overload '{0}' per l'elemento inizializzatore di raccolta è obsoleto.
ja: コレクション初期化子要素に最も適しているオーバーロード Add メソッド '{0}' は、古い形式です。
ko: 오버로드된 Add 메서드 중 해당 컬렉션 이니셜라이저 요소에 가장 적합한 '{0}'은(는) 사용되지 않습니다.
pl: Najlepsza przeciążona metoda Add „{0}” dla elementu inicjatora kolekcji jest przestarzała.
pt_br: O melhor método Add sobrecarregado "{0}" para o elemento do inicializador de coleção está obsoleto.
ru: Наиболее подходящий перегруженный метод Add "{0}" для элемента инициализатора набора устарел.
tr: Koleksiyon başlatıcı öğesi için en iyi aşırı yüklü Ekle yöntemi '{0}' artık kullanılmıyor.
zh_hans: 与集合初始值设定项元素最匹配的重载 Add 方法“{0}”已过时。
zh_hant: 集合初始設定式元素最符合的多載 Add 方法 '{0}' 已經過時。

# WRN_DeprecatedCollectionInitAdd_Title
source: The best overloaded Add method for the collection initializer element is obsolete
cs: Optimální přetěžovaná metoda Add pro element inicializátoru kolekce je zastaralá.
de: Die beste überladene Add-Methode für das Sammlungsinitialisiererelement ist veraltet.
es: El mejor método Add sobrecargado para el elemento inicializador de la colección está obsoleto
fr: La meilleure méthode Add surchargée pour l'élément initialiseur de collection est obsolète
it: Il miglior metodo Add di overload per l'elemento inizializzatore di raccolta è obsoleto
ja: コレクション初期化子要素に最も適しているオーバーロード Add メソッドは古い形式です
ko: 컬렉션 이니셜라이저 요소에 가장 적합한 오버로드된 Add 메서드는 사용되지 않습니다.
pl: Najlepsza przeciążona metoda Add dla elementu inicjatora kolekcji jest przestarzała
pt_br: O melhor método Add sobrecarregado para o elemento do inicializador de coleta está obsoleto
ru: Рекомендуемый перегружаемый метод Add для элемента инициализатора коллекции устарел
tr: Koleksiyon başlatıcı öğesi için en iyi aşırı yüklü Ekle yöntemi kullanılmıyor
zh_hans: 与集合初始值设定项元素最匹配的重载 Add 方法已过时
zh_hant: 集合初始設定式項目最符合的多載 Add 方法已經過時

# WRN_DeprecatedCollectionInitAddStr
source: The best overloaded Add method '{0}' for the collection initializer element is obsolete. {1}
cs: Optimální přetěžovaná metoda Add {0} pro element inicializátoru kolekce je zastaralá. {1}
de: Die beste überladene Add-Methode "{0}" für das Sammlungsinitialisiererelement ist veraltet. {1}
es: El mejor método Add sobrecargado '{0}' para el elemento inicializador de la colección está obsoleto. {1}
fr: La meilleure méthode Add surchargée '{0}' pour l'élément initialiseur de collection est obsolète. {1}
it: Il miglior metodo Add di overload '{0}' per l'elemento inizializzatore di raccolta è obsoleto. {1}
ja: コレクション初期化子要素に最も適しているオーバーロード Add メソッド '{0}' は古い形式です。{1}
ko: 오버로드된 Add 메서드 중 해당 컬렉션 이니셜라이저 요소에 가장 적합한 '{0}'은(는) 사용되지 않습니다. {1}
pl: Najlepsza przeciążona metoda Add „{0}” dla elementu inicjatora kolekcji jest przestarzała. {1}
pt_br: O melhor método Adicionar sobrecarregado "{0}" para o elemento do inicializador de coleção está obsoleto. {1}
ru: Наиболее подходящий перегруженный метод Add "{0}" для элемента инициализатора набора устарел. {1}
tr: Koleksiyon başlatıcı öğesi için en iyi aşırı yüklenen '{0}' Ekle yöntemi artık kullanılmıyor. {1}
zh_hans: 与集合初始值设定项元素最匹配的重载 Add 方法“{0}”已过时。{1}
zh_hant: 集合初始設定式元素最符合的多載 Add 方法 '{0}' 已經過時。{1}

# WRN_DeprecatedCollectionInitAddStr_Title
source: The best overloaded Add method for the collection initializer element is obsolete
cs: Optimální přetěžovaná metoda Add pro element inicializátoru kolekce je zastaralá.
de: Die beste überladene Add-Methode für das Sammlungsinitialisiererelement ist veraltet.
es: El mejor método Add sobrecargado para el elemento inicializador de la colección está obsoleto
fr: La meilleure méthode Add surchargée pour l'élément initialiseur de collection est obsolète
it: Il miglior metodo Add di overload per l'elemento inizializzatore di raccolta è obsoleto
ja: コレクション初期化子要素に最も適しているオーバーロード Add メソッドは古い形式です
ko: 컬렉션 이니셜라이저 요소에 가장 적합한 오버로드된 Add 메서드는 사용되지 않습니다.
pl: Najlepsza przeciążona metoda Add dla elementu inicjatora kolekcji jest przestarzała
pt_br: O melhor método Add sobrecarregado para o elemento do inicializador de coleta está obsoleto
ru: Рекомендуемый перегружаемый метод Add для элемента инициализатора коллекции устарел
tr: Koleksiyon başlatıcı öğesi için en iyi aşırı yüklü Ekle yöntemi kullanılmıyor
zh_hans: 与集合初始值设定项元素最匹配的重载 Add 方法已过时
zh_hant: 集合初始設定式項目最符合的多載 Add 方法已經過時

# ERR_DeprecatedCollectionInitAddStr
source: The best overloaded Add method '{0}' for the collection initializer element is obsolete. {1}
cs: Optimální přetěžovaná metoda Add {0} pro element inicializátoru kolekce je zastaralá. {1}
de: Die beste überladene Add-Methode "{0}" für das Sammlungsinitialisiererelement ist veraltet. {1}
es: El mejor método Add sobrecargado '{0}' para el elemento inicializador de la colección está obsoleto. {1}
fr: La meilleure méthode Add surchargée '{0}' pour l'élément initialiseur de collection est obsolète. {1}
it: Il miglior metodo Add di overload '{0}' per l'elemento inizializzatore di raccolta è obsoleto. {1}
ja: コレクション初期化子要素に最も適しているオーバーロード Add メソッド '{0}' は古い形式です。{1}
ko: 오버로드된 Add 메서드 중 해당 컬렉션 이니셜라이저 요소에 가장 적합한 '{0}'은(는) 사용되지 않습니다. {1}
pl: Najlepsza przeciążona metoda Add „{0}” dla elementu inicjatora kolekcji jest przestarzała. {1}
pt_br: O melhor método Adicionar sobrecarregado "{0}" para o elemento do inicializador de coleção está obsoleto. {1}
ru: Наиболее подходящий перегруженный метод Add "{0}" для элемента инициализатора набора устарел. {1}
tr: Koleksiyon başlatıcı öğesi için en iyi aşırı yüklenen '{0}' Ekle yöntemi artık kullanılmıyor. {1}
zh_hans: 与集合初始值设定项元素最匹配的重载 Add 方法“{0}”已过时。{1}
zh_hant: 集合初始設定式元素最符合的多載 Add 方法 '{0}' 已經過時。{1}

# ERR_SecurityAttributeInvalidTarget
source: Security attribute '{0}' is not valid on this declaration type. Security attributes are only valid on assembly, type and method declarations.
cs: Atribut zabezpečení {0} není platný u tohoto typu deklarace. Atributy zabezpečení jsou platné jenom u deklarací sestavení, typu a metody.
de: Das Sicherheitsattribut "{0}" ist für diesen Deklarationstyp nicht gültig. Sicherheitsattribute sind nur für Assembly-, Typ- und Methodendeklarationen gültig.
es: El valor '{0}' de SecurityAction no es válido en este tipo de declaración. Los atributos de seguridad solo son válidos en las declaraciones de ensamblado, de tipo y de método.
fr: L'attribut de sécurité '{0}' n'est pas valide dans ce type de déclaration. Les attributs de sécurité ne sont valides que dans les déclarations d'assembly, de type et de méthode.
it: L'attributo di sicurezza '{0}' non è valido in questo tipo di dichiarazione. Gli attributi di sicurezza sono validi solo in dichiarazioni di metodo, assembly e tipi.
ja: セキュリティ属性 '{0}' はこの宣言型では無効です。セキュリティ属性は、アセンブリ、型、メソッドの宣言でのみ有効です。
ko: 이 선언 형식에서는 '{0}' 보안 특성이 유효하지 않습니다. 보안 특성은 어셈블리, 형식 및 메서드 선언에서만 유효합니다.
pl: Atrybut zabezpieczeń „{0}” jest nieprawidłowy w tym typie deklaracji. Atrybuty zabezpieczeń są prawidłowe tylko dla deklaracji zestawu, typu i metody.
pt_br: Atributo de segurança "{0}" não é válido neste tipo de declaração. Atributos de segurança são somente válidos em declarações de assembly, tipo e método.
ru: Атрибут безопасности "{0}" не допускается для этого типа объявления. Атрибуты безопасности допустимы только в сборке, типе и объявлениях метода.
tr: {0}' güvenlik özniteliği bu bildirim türü için geçerli değil. Güvenlik öznitelikleri yalnızca derleme, tür ve yöntem bildirimlerinde geçerlidir.
zh_hans: 安全特性“{0}”对此声明类型无效。安全特性仅对程序集、类型和方法声明有效。
zh_hant: 安全屬性 '{0}' 在此宣告類型上無效。安全屬性只有在組件、類型和方法宣告上才有效。

# ERR_BadDynamicMethodArg
source: Cannot use an expression of type '{0}' as an argument to a dynamically dispatched operation.
cs: Nejde použít výraz typu {0} jako argument pro dynamicky volanou operaci.
de: Ein Ausdruck vom Typ "{0}" kann nicht als Argument für einen dynamisch gebundenen Vorgang verwendet werden.
es: No se puede usar una expresión del tipo '{0}' como argumento de una operación enviada de forma dinámica.
fr: Impossible d'utiliser une expression de type '{0}' comme argument pour une opération dispatchée dynamiquement.
it: Non è possibile usare un'espressione di tipo '{0}' come argomento per un'operazione inviata dinamicamente.
ja: 型 '{0}' の式を、動的ディスパッチされる操作の引数として使用することはできません。
ko: {0}' 형식의 식을 동적으로 디스패치된 작업의 인수로 사용할 수 없습니다.
pl: Nie można użyć wyrażenia typu „{0}” jako argumentu do operacji przydzielanej dynamicznie.
pt_br: Não é possível usar uma expressão do tipo "{0}" como um argumento para uma operação dinamicamente vinculada.
ru: Не удается использовать выражение типа "{0}" в качестве аргумента для динамически диспетчеризируемой операции.
tr: {0}' türündeki bir ifade dinamik olarak dağıtılan işlemin bağımsız değişkeni olarak kullanılamaz.
zh_hans: 无法将类型为“{0}”的表达式用作动态调度的操作的参数。
zh_hant: 無法將類型 '{0}' 的運算式用做為動態分派作業的引數。

# ERR_BadDynamicMethodArgLambda
source: Cannot use a lambda expression as an argument to a dynamically dispatched operation without first casting it to a delegate or expression tree type.
cs: Výraz lambda nejde použít jako argument dynamicky volané operace, aniž byste ho nejprve použili na typy delegát nebo strom výrazů.
de: Ein Lambdaausdruck kann nicht als Argument für einen dynamisch gebundenen Vorgang verwendet werden, ohne ihn zunächst in einen Delegat- oder Ausdrucksbaumtyp umzuwandeln.
es: No se puede usar una expresión lambda como argumento de una operación enviada de forma dinámica sin convertirla antes en un tipo delegado o de árbol de expresión.
fr: Impossible d'utiliser une expression lambda comme argument pour une opération dispatchée dynamiquement sans tout d'abord en effectuer un cast en type délégué ou en type d'arborescence de l'expression.
it: Non è possibile usare un'espressione lambda come argomento per un'operazione inviata dinamicamente senza prima eseguire il cast a un tipo di albero delle espressioni o di delegato.
ja: 最初にデリゲートまたは式ツリー型にキャストしていない場合は、ラムダ式を、動的ディスパッチされる操作の引数として使用することはできません。
ko: 람다 식을 대리자 또는 식 트리 형식으로 먼저 캐스팅하지 않고는 동적으로 디스패치된 작업의 인수로 사용할 수 없습니다.
pl: Nie można użyć wyrażenia lambda jako argumentu do operacji przydzielanej dynamicznie bez uprzedniego rzutowania go na delegata lub typ drzewa wyrażenia.
pt_br: Não é possível usar uma expressão lambda como um argumento para uma operação vinculada dinamicamente sem primeiro convertê-la para um tipo delegate ou de árvore de expressão.
ru: Не удается использовать лямбда-выражение в качестве аргумента для динамически диспетчеризируемой операции без предварительного преобразования его в делегат или тип дерева выражения.
tr: Lambda ifadesi önce bir temsilci veya ifade ağacı türüne yayınlanmadan dinamik olarak dağıtılan bir işlemin bağımsız değişkeni olarak kullanılamaz.
zh_hans: 如果不事先将 lambda 表达式强制转换为委托或表达式树类型，则无法将该表达式用作动态调度的操作的参数。
zh_hant: 無法將 Lambda 運算式用做為動態分派作業的引數，但卻未先將其轉型為委派或運算式樹狀結構類型。

# ERR_BadDynamicMethodArgMemgrp
source: Cannot use a method group as an argument to a dynamically dispatched operation. Did you intend to invoke the method?
cs: Skupinu metod nejde použít jako argument v dynamicky volané operaci. Měli jste v úmyslu tuto metodu vyvolat?
de: Eine Methodengruppe kann nicht als Argument eines dynamisch gebundenen Vorgangs verwendet werden. Wollten Sie die Methode aufrufen?
es: No se puede usar un grupo de métodos como argumento de una operación enviada de forma dinámica. ¿Quería invocar el método?
fr: Impossible d'utiliser un groupe de méthodes comme argument pour une opération dispatchée dynamiquement. Souhaitiez-vous appeler la méthode ?
it: Non è possibile usare un metodo di gruppo come argomento per un'operazione inviata dinamicamente. Si intendeva richiamare il metodo?
ja: メソッドのグループを動的ディスパッチされる操作の引数として使用することはできません。このメソッドを呼び出しますか?
ko: 메서드 그룹을 동적으로 디스패치된 작업의 인수로 사용할 수 없습니다. 메서드를 호출하시겠습니까?
pl: Nie można użyć grupy metod jako argumentu do operacji przydzielanej dynamicznie. Czy zamierzane było wywołanie metody?
pt_br: Não é possível usar um grupo de métodos como um argumento para uma operação dinamicamente vinculada. Você pretendia invocar o método?
ru: Не удается использовать группу методов в качестве аргумента для динамически диспетчеризируемой операции. Предполагалось вызывать этот метод?
tr: Bir yöntem grubu dinamik olarak dağıtılan işlemin bağımsız değişkeni olarak kullanılamaz. Yöntemi çağırmak mı istiyordunuz?
zh_hans: 无法将方法组用作动态调度的操作的参数。是否要调用该方法?
zh_hant: 無法將方法群組用做為動態分派作業的引數。原本希望叫用此方法嗎?

# ERR_NoDynamicPhantomOnBase
source: The call to method '{0}' needs to be dynamically dispatched, but cannot be because it is part of a base access expression. Consider casting the dynamic arguments or eliminating the base access.
cs: Volání do metody {0} je nutné volat dynamicky, což ale není možné, protože je součástí výrazu základního přístupu. Zvažte přetypování dynamických argumentů nebo eliminaci základního přístupu.
de: Der Aufruf von Methode "{0}" muss dynamisch gebunden werden, was jedoch nicht möglich ist, da die Methode Teil eines Basiszugriffsausdrucks ist. Wandeln Sie ggf. die dynamischen Argumente um, oder löschen Sie den Basiszugriff.
es: La llamada al método '{0}' debe enviarse de forma dinámica, pero no se puede porque forma parte de una expresión de acceso base. Puede convertir los argumentos dinámicos o eliminar el acceso base.
fr: L'appel à la méthode '{0}' doit être dispatché dynamiquement mais ne peut pas l'être, car il fait partie d'une expression d'accès de base. Effectuez un cast des arguments dynamiques ou supprimez l'accès de base.
it: Non è possibile eseguire l'invio dinamico richiesto della chiamata al metodo '{0}' perché fa parte di un'espressione di accesso di base. Provare a eseguire il cast degli argomenti dinamici o a eliminare l'accesso di base.
ja: メソッド '{0}' の呼び出しは動的ディスパッチされる必要がありますが、ベース アクセス式の一部であるためディスパッチできません。動的引数のキャストまたはベース アクセスの削除を検討してください。
ko: {0}' 메서드 호출을 동적으로 디스패치해야 하지만 해당 호출이 기본 액세스 식의 일부이므로 동적으로 디스패치할 수 없습니다. 동적 인수를 캐스팅하거나 기본 액세스를 제거하세요.
pl: Wywołanie metody „{0}” musi być przydzielane dynamicznie, lecz to nie jest możliwe, ponieważ jest ona częścią wyrażenia dostępu bazowego. Rozważ rzutowanie argumentów dynamicznych lub wyeliminowanie dostępu bazowego.
pt_br: A chamada para o método "{0}" precisa ser vinculada dinamicamente, mas não pode ser porque ela é parte de uma expressão de acesso básica. Considere converter argumentos dinâmicos ou eliminar o acesso básico.
ru: Не удается выполнить требуемую для вызова метода "{0}" динамическую диспетчеризацию в связи с тем, что этот метод является частью базового выражения доступа. Попробуйте привести типы динамических аргументов или исключить доступ к базовым членам.
tr: {0}' yöntemine yapılan çağrının dinamik olarak dağıtılması gerekiyor, ancak bir taban erişim ifadesinin bir parçası olduğundan dağıtılamıyor. Dinamik bağımsız değişkenlere tür atamayı veya taban erişimini ortadan kaldırmayı düşünün.
zh_hans: 需要动态调度对方法“{0}”的调用，但无法实现，因为该调用是基访问表达式的一部分。请考虑强制转换动态参数或消除基访问。
zh_hant: 方法 '{0}' 的呼叫必須以動態方式分派，但因為它是基底存取運算式的一部分，所以無法動態分派。請考慮將動態引數轉型，或排除基底存取。

# ERR_BadDynamicQuery
source: Query expressions over source type 'dynamic' or with a join sequence of type 'dynamic' are not allowed
cs: Výrazy dotazů se zdrojovým typem dynamic nebo se spojenou sekvencí typu dynamic nejsou povolené.
de: Abfrageausdrücke mit dem Quelltyp "dynamic" oder mit einer Joinsequenz vom Typ "dynamic" sind nicht zulässig.
es: No se permiten expresiones de consulta con el tipo de origen 'dynamic' o con una secuencia de unión de tipo 'dynamic'
fr: Les expressions de requête sur le type de source 'dynamic' ou avec une séquence de jointure de type 'dynamic' ne sont pas autorisées
it: Non sono consentite espressioni di query sul tipo di origine 'dynamic' o con una sequenza di join di tipo 'dynamic'
ja: ソース型 'dynamic' に対するクエリ式または型 'dynamic' の結合シーケンスのあるクエリ式は使用できません
ko: 소스 형식이 'dynamic'인 쿼리 식 또는 'dynamic' 형식의 조인 시퀀스가 포함된 쿼리 식은 사용할 수 없습니다.
pl: Wyrażenia zapytań w odniesieniu do typu źródła „dynamic” lub z sekwencją złączenia typu „dynamic” nie są dozwolone.
pt_br: Não são permitidas expressões de consulta no tipo de origem "dynamic" ou com uma sequência de união do tipo "dynamic"
ru: Выражения запросов по источнику типа "dynamic" или с последовательностью объединения типа "dynamic" запрещены.
tr: dynamic' kaynak türünü kapsayan veya 'dynamic' türünde bir birleştirme dizisi olan sorgu ifadeleri kullanılamaz
zh_hans: 不允许源类型 "dynamic" 上或具有类型 "dynamic" 的连接序列的查询表达式
zh_hant: 不允許透過來源類型 'dynamic' 或使用類型 'dynamic' 之聯結序列的查詢運算式

# ERR_NoDynamicPhantomOnBaseIndexer
source: The indexer access needs to be dynamically dispatched, but cannot be because it is part of a base access expression. Consider casting the dynamic arguments or eliminating the base access.
cs: Přístup indexeru je nutné volat dynamicky, což ale není možné, protože je součástí výrazu základního přístupu. Zvažte použití dynamických argumentů nebo eliminaci základního přístupu.
de: Der Indexerzugriff muss dynamisch gebunden werden. Dies ist aber nicht möglich, da er Teil eines Basiszugriffsausdrucks ist. Wandeln Sie die dynamischen Argumente um, oder löschen Sie den Basiszugriff.
es: El acceso de indizador debe enviarse de forma dinámica, pero no se puede porque forma parte de una expresión de acceso base. Puede convertir los argumentos dinámicos o eliminar el acceso base.
fr: L'accès de l'indexeur doit être dispatché dynamiquement, mais ne peut pas l'être car il fait partie d'une expression d'accès de base. Effectuez un cast des arguments dynamiques ou supprimez l'accès de base.
it: L'accesso all'indicizzatore deve essere inviato dinamicamente. Tuttavia, non è possibile perché fa parte di un'espressione di accesso di base. Provare a eseguire il cast degli argomenti dinamici o a eliminare l'accesso di base.
ja: インデクサー アクセスは動的ディスパッチされる必要がありますが、ベース アクセス式の一部であるためディスパッチできません。動的引数のキャストまたはベース アクセスの削除を検討してください。
ko: 인덱서 액세스를 동적으로 디스패치해야 하지만 해당 액세스가 기본 액세스 식의 일부이므로 동적으로 디스패치할 수 없습니다. 동적 인수를 캐스팅하거나 기본 액세스를 제거하십시오.
pl: Dostęp indeksatora musi być przydzielany dynamicznie, ale jest to niemożliwe, ponieważ jest częścią wyrażenia dostępu bazowego. Rozważ możliwość rzutowania argumentów dynamicznych lub wykluczenia dostępu bazowego.
pt_br: O acesso ao indexador deve ser vinculado dinamicamente, mas isso não é possível porque ele faz parte de uma expressão de acesso de base. Converta os argumentos dinâmicos ou elimine o acesso de base.
ru: Не удается выполнить требуемую для доступа к индексатору динамическую диспетчеризацию, поскольку он является частью базового выражения доступа. Попробуйте привести типы динамических аргументов или исключить доступ к базовым членам.
tr: Dizin erişimcisinin erişiminin dinamik olarak başlatılması gerekiyor, ancak dizin erişimci bir taban erişim ifadesinin parçası olduğundan dağıtılamıyor. Dinamik bağımsız değişkenlere tür atamayı veya taban erişimini ortadan kaldırmayı düşünün.
zh_hans: 索引器访问需要进行动态调度，但未能如此，因为它是基访问表达式的一般分。请考虑强制转换动态参数或消除基访问。
zh_hant: 索引子存取必須以動態方式分派，但因為其為基底存取運算式的一部分，所以無法動態分派。請考慮將動態引數轉型，或排除基底存取。
