Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NullabilityMismatchInConstraintsOnPartialImplementation
source: Partial method declarations of '{0}' have inconsistent nullability in constraints for type parameter '{1}'
cs: Částečné deklarace metod {0} mají nekonzistentní možnost použití hodnoty null v omezeních parametru typu {1}.
de: Partielle Methodendeklarationen von "{0}" weisen eine inkonsistente NULL-NULL-Zulässigkeit in den Einschränkungen für den Typparameter "{1}" auf.
es: Las declaraciones de métodos parciales de "{0}" tienen una nulabilidad incoherente de las restricciones para el parámetro de tipo "{1}"
fr: Les déclarations de méthodes partielles de '{0}' présentent des possibilités de valeur null incohérentes pour le paramètre de type '{1}'
it: Le dichiarazioni di metodo parziali di '{0}' contengono un supporto dei valori Null incoerente nei vincoli per il parametro di tipo '{1}'
ja: '{0}' の部分メソッド宣言には、型パラメーター '{1}' の制約に NULL 値の許容の矛盾があります
ko: '{0}'의 부분 메서드(Partial method) 선언의 형식 매개 변수 '{1}'에 대한 제약 조건에 Null 허용 여부가 일관되지 않습니다.
pl: Deklaracje metod częściowych elementu „{0}” mają niespójne opcje dopuszczania wartości null w ograniczeniach parametru typu „{1}”
pt_br: Declarações parciais de método '{0}' têm nulidade inconsistente em restrições para o parâmetro de tipo '{1}'
ru: Несогласованные ограничения допустимости значения NULL для параметра типа "{1}" в частичных объявлениях метода "{0}".
tr: '{0}' öğesinin kısmi metot bildirimleri kısıtlamalarında '{1}' tür parametresi için tutarsız boş değer atanabilirlik durumu var
zh_hans: “{0}”的分部方法声明在对类型参数“{1}”的约束中具有不一致的为空性
zh_hant: '{0}' 的部分方法宣告在類型參數 '{1}' 的限制式中，有不一致的可 NULL 性

# WRN_NullabilityMismatchInConstraintsOnPartialImplementation_Title
source: Partial method declarations have inconsistent nullability in constraints for type parameter
cs: Částečné deklarace metod mají nekonzistentní možnost použití hodnoty null v omezeních parametru typu.
de: Partielle Methodendeklarationen weisen eine inkonsistente NULL-Zulässigkeit in Einschränkungen für den Typparameter auf.
es: Las declaraciones de métodos parciales tienen una nulabilidad incoherente de las restricciones para el parámetro de tipo
fr: Les déclarations de méthodes partielles présentent des possibilités de valeur null incohérentes pour le paramètre de type
it: Le dichiarazioni di metodo parziali contengono un supporto dei valori Null incoerente nei vincoli per il parametro di tipo
ja: 部分メソッド宣言には、型パラメーターの制約に NULL 値の許容の矛盾があります
ko: 부분 메서드(Partial method) 선언의 형식 매개 변수에 대한 제약 조건에 Null 허용 여부가 일관되지 않음
pl: Deklaracje metod częściowych mają niespójne opcje dopuszczania wartości null w ograniczeniach dla parametru typu
pt_br: Declarações de método parcial têm nulidade inconsistente em restrições para o parâmetro de tipo
ru: Несогласованные ограничения допустимости значения NULL для параметра типа в частичных объявлениях метода.
tr: Kısmi metot bildirimlerinin tür parametresi kısıtlamalarında tutarsız boş değer atanabilirlik durumu var
zh_hans: 分部方法声明在对类型参数的约束中具有不一致的为 Null 性
zh_hant: 部分方法宣告在類型參數的限制式中，有不一致的可 NULL 性

# WRN_NullabilityMismatchInExplicitlyImplementedInterface
source: Nullability of reference types in explicit interface specifier doesn't match interface implemented by the type.
cs: Možnost použití hodnoty null u typů odkazů v explicitním specifikátoru rozhraní neodpovídá rozhraní implementovanému podle tohoto typu.
de: Die NULL-Zulässigkeit von Verweistypen im expliziten Schnittstellenspezifizierer entspricht nicht der vom Typ implementierten Schnittstelle.
es: La nulabilidad de los tipos de referencia del especificador de interfaz explícito no coincide con la interfaz que el tipo implementa.
fr: Les possibilités de valeur null des types référence dans le spécificateur d'interface explicite ne correspondent pas à l'interface implémentée par le type.
it: Il supporto dei valori Null dei tipi riferimento nell'identificatore di interfaccia esplicito non corrisponde all'interfaccia implementata dal tipo.
ja: 明示的なインターフェイス指定子内の参照型の Null 許容性が、型によって実装されているインターフェイスと一致しません。
ko: 명시적 인터페이스 지정자의 참조 형식 Null 허용 여부가 형식에 의해 구현된 인터페이스와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w jawnym specyfikatorze interfejsu jest niezgodna z interfejsem implementowanym przez typ.
pt_br: A nulidade dos tipos de referência no especificador de interface explícito não corresponde à interface implementada pelo tipo.
ru: Допустимость значения NULL ссылочных типов в явном указателе интерфейсов не соответствует интерфейсу, реализованному типом.
tr: Açık arabirim belirticisindeki başvuru türlerinin boş değer atanabilirliği, tür tarafından uygulanan arabirimle eşleşmiyor.
zh_hans: 显式接口说明符中引用类型的 Null 性与该类型实现的接口不匹配。
zh_hant: 明確介面指定名稱中參考類型可 NULL 性與類型所實作的介面不相符。

# WRN_NullabilityMismatchInExplicitlyImplementedInterface_Title
source: Nullability of reference types in explicit interface specifier doesn't match interface implemented by the type.
cs: Možnost použití hodnoty null u typů odkazů v explicitním specifikátoru rozhraní neodpovídá rozhraní implementovanému podle tohoto typu.
de: Die NULL-Zulässigkeit von Verweistypen im expliziten Schnittstellenspezifizierer entspricht nicht der vom Typ implementierten Schnittstelle.
es: La nulabilidad de los tipos de referencia del especificador de interfaz explícito no coincide con la interfaz que el tipo implementa.
fr: Les possibilités de valeur null des types référence dans le spécificateur d'interface explicite ne correspondent pas à l'interface implémentée par le type.
it: Il supporto dei valori Null dei tipi riferimento nell'identificatore di interfaccia esplicito non corrisponde all'interfaccia implementata dal tipo.
ja: 明示的なインターフェイス指定子内の参照型の Null 許容性が、型によって実装されているインターフェイスと一致しません。
ko: 명시적 인터페이스 지정자의 참조 형식 Null 허용 여부가 형식에 의해 구현된 인터페이스와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w jawnym specyfikatorze interfejsu jest niezgodna z interfejsem implementowanym przez typ.
pt_br: A nulidade dos tipos de referência no especificador de interface explícito não corresponde à interface implementada pelo tipo.
ru: Допустимость значения NULL ссылочных типов в явном указателе интерфейсов не соответствует интерфейсу, реализованному типом.
tr: Açık arabirim belirticisindeki başvuru türlerinin boş değer atanabilirliği, tür tarafından uygulanan arabirimle eşleşmiyor.
zh_hans: 显式接口说明符中引用类型的 Null 性与该类型实现的接口不匹配。
zh_hant: 明確介面指定名稱中參考類型可 NULL 性與類型所實作的介面不相符。

# WRN_NullabilityMismatchInInterfaceImplementedByBase
source: '{0}' does not implement interface member '{1}'. Nullability of reference types in interface implemented by the base type doesn't match.
cs: {0} neimplementuje člen rozhraní {1}. Možnost použití hodnoty null u typů odkazů v rozhraní implementovaném podle základního typu se neshoduje.
de: "{0}" implementiert den Schnittstellenmember "{1}" nicht. Die NULL-Zulässigkeit von Verweistypen in der vom Basistyp implementierten Schnittstelle stimmt nicht überein.
es: "{0}" no implementa el miembro de interfaz "{1}". La nulabilidad de los tipos de referencia de la interfaz que implementa el tipo base no coincide.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. Les possibilités de valeur null des types référence dans l'interface implémentée par le type de base ne correspondent pas.
it: '{0}' non implementa il membro di interfaccia '{1}'. Il supporto dei valori Null dei tipi riferimento nell'interfaccia implementata dal tipo di base non corrisponde.
ja: '{0}' はインターフェイス メンバー '{1}' を実装しません。基本型で実装されているインターフェイス内の参照型の Null 許容性が一致しません。
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다. 기본 형식에 의해 구현된 인터페이스의 참조 형식 Null 허용 여부가 일치하지 않습니다.
pl: Element „{0}” nie implementuje składowej interfejsu „{1}”. Obsługa wartości null dla typów referencyjnych w interfejsie implementowanym przez typ podstawowy jest niezgodna.
pt_br: '{0}' não implementa o membro da interface '{1}'. A nulidade dos tipos de referência na interface implementados pelo tipo base não corresponde.
ru: "{0}" не реализует элемент интерфейса "{1}". Допустимость значения NULL ссылочных типов в интерфейсе, реализованном базовым типом, не совпадает.
tr: '{0}', '{1}' arabirim üyesini uygulamıyor. Temel tür tarafından uygulanan arabirimdeki başvuru türlerinin boş değer atanabilirliği eşleşmiyor.
zh_hans: “{0}”不实现接口成员“{1}”。接口中基类型实现的引用类型的 Null 性不匹配。
zh_hant: '{0}' 未實作介面成員 '{1}'。基底類型所實作之介面中的參考類型可 NULL 性不相符。

# WRN_NullabilityMismatchInInterfaceImplementedByBase_Title
source: Type does not implement interface member. Nullability of reference types in interface implemented by the base type doesn't match.
cs: Typ neimplementuje člen rozhraní. Možnost použití hodnoty null u typů odkazů v rozhraní implementovaném podle základního typu se neshoduje.
de: Der Typ implementiert den Schnittstellenmember nicht. Die NULL-Zulässigkeit von Verweistypen in der vom Basistyp implementierten Schnittstelle stimmt nicht überein.
es: El tipo no implementa un miembro de interfaz. La nulabilidad de los tipos de referencia de la interfaz que implementa el tipo base no coincide.
fr: Le type n'implémente pas le membre d'interface. Les possibilités de valeur null des types référence dans l'interface implémentée par le type de base ne correspondent pas.
it: Il tipo non implementa il membro di interfaccia. Il supporto dei valori Null dei tipi riferimento nell'interfaccia implementata dal tipo di base non corrisponde.
ja: 型はインターフェイス メンバーを実装しません。基本型で実装されているインターフェイス内の参照型の Null 許容性が一致しません。
ko: 형식은 인터페이스 멤버를 구현하지 않습니다. 기본 형식에 의해 구현된 인터페이스의 참조 형식 Null 허용 여부가 일치하지 않습니다.
pl: Typ nie implementuje składowej interfejsu. Obsługa wartości null dla typów referencyjnych w interfejsie implementowanym przez typ podstawowy jest niezgodna.
pt_br: O tipo não implementa o membro da interface. A nulidade dos tipos de referência na interface implementados pelo tipo base não corresponde.
ru: Тип не реализует элемент интерфейса. Допустимость значения NULL ссылочных типов в интерфейсе, реализованном базовым типом, не совпадает.
tr: Tür, arabirim üyesini uygulamıyor. Temel tür tarafından uygulanan arabirimdeki başvuru türlerinin boş değer atanabilirliği eşleşmiyor.
zh_hans: 类型不实现接口成员。接口中基类型实现的引用类型的 Null 性不匹配。
zh_hant: 類型未實作介面成員。基底類型所實作之介面中的參考類型可 NULL 性不相符。

# WRN_NullabilityMismatchInParameterTypeOfTargetDelegate
source: Nullability of reference types in type of parameter '{0}' of '{1}' doesn't match the target delegate '{2}' (possibly because of nullability attributes).
cs: Typy odkazů s možnou hodnotou null v typu parametru {0} z {1} neodpovídají cílovému delegátu {2} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type du paramètre '{0}' de '{1}' ne correspond pas au délégué cible '{2}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' di '{1}' non corrisponde al delegato di destinazione '{2}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: '{1}' のパラメーター '{0}' の型における参照型の NULL 値の許容が、ターゲット デリゲート '{2}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru „{0}” z elementu „{1}” nie jest zgodne z docelowym delegatem „{2}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro '{0}' de '{1}' não corresponde ao delegado de destino '{2}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра "{0}" объекта "{1}" не соответствует целевому объекту делегирования "{2}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: “{1}”的参数“{0}”类型中引用类型的为 Null 性与目标委托“{2}”不匹配(可能是由于为 Null 性特性)。
zh_hant: '{1}' 的 '{0}' 參數類型中，參考型別是否可為 Null 的情況，與目標委派 '{2}' 不相符 (可能的原因是屬性可為 Null)。

# WRN_NullabilityMismatchInParameterTypeOfTargetDelegate_Title
source: Nullability of reference types in type of parameter doesn't match the target delegate (possibly because of nullability attributes).
cs: Typy odkazů s možnou hodnotou null v typu parametru neodpovídají cílovému delegátu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type du paramètre ne correspond pas au délégué cible (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al delegato di destinazione, probabilmente a causa degli attributi del supporto dei valori Null.
ja: パラメーターの型における参照型の NULL 値の許容が、ターゲット デリゲートと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w typie parametru nie jest zgodne z docelowym delegatem (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de parâmetro não corresponde ao delegado de destino (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе параметра не соответствует целевому объекту делегирования (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 参数类型中引用类型的为 Null 性与目标委托不匹配(可能是由于为 Null 性特性)。
zh_hant: 參數類型中參考型別是否可為 Null 的情況，與目標委派不相符 (可能的原因是屬性可為 Null)。

# WRN_NullabilityMismatchInParameterTypeOnExplicitImplementation
source: Nullability of reference types in type of parameter '{0}' doesn't match implemented member '{1}'.
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} neodpovídá implementovanému členu {1}.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters "{0}" entspricht nicht dem implementierten Member "{1}".
es: La nulabilidad de los tipos de referencia del tipo de parámetro "{0}" no coincide con el miembro implementado "{1}".
fr: La nullabilité des types référence dans le type de paramètre '{0}' ne correspond pas au membre implémenté '{1}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' non corrisponde al membro implementato '{1}'.
ja: パラメーター '{0}' の型における参照型の Null 許容性が、実装されるメンバー '{1}' と一致しません。
ko: '{0}' 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버 '{1}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru „{0}” jest niezgodna z implementowaną składową „{1}”.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro '{0}' não corresponde ao membro implementado '{1}'.
ru: Допустимость значения NULL для ссылочных типов в типе параметра "{0}" не совпадает с реализованным членом "{1}".
tr: '{0}' parametre türündeki başvuru türlerinin boş değer atanabilirliği, uygulanan '{1}' üyesi ile eşleşmiyor.
zh_hans: 参数“{0}”类型中引用类型的为 Null 性与实现的成员“{1}”不匹配。
zh_hant: 參數 '{0}' 型別中參考型別的可 Null 性與實作的成員 '{1}' 不符合。

# WRN_NullabilityMismatchInParameterTypeOnExplicitImplementation_Title
source: Nullability of reference types in type of parameter doesn't match implemented member.
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters entspricht nicht dem implementierten Member.
es: La nulabilidad de los tipos de referencia del tipo de parámetro no coincide con el miembro implementado
fr: La nullabilité des types référence dans le type de paramètre ne correspond pas au membre implémenté.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al membro implementato.
ja: パラメーターの型における参照型の Null 許容性が、実装されるメンバーと一致しません。
ko: 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru jest niezgodna z implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro não corresponde ao membro implementado.
ru: Допустимость значения NULL для ссылочных типов в типе параметра не совпадает с реализованным членом.
tr: Parametre türündeki başvuru türlerinin boş değer atanabilirliği, uygulanan üye ile eşleşmiyor.
zh_hans: 参数类型中引用类型的为 Null 性与实现的成员不匹配。
zh_hant: 參數型別中參考型別的可 Null 性與實作的成員不符合。

# WRN_NullabilityMismatchInParameterTypeOnImplicitImplementation
source: Nullability of reference types in type of parameter '{0}' of '{1}' doesn't match implicitly implemented member '{2}'.
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} z {1} neodpovídá implicitně implementovanému členu {2}.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters "{0}" von "{1}" entspricht nicht dem implizit implementierten Member "{2}".
es: La nulabilidad de los tipos de referencia del tipo de parámetro"{0}" de "{1}" no coincide con el miembro "{2}" implementado de forma implícita.
fr: La nullabilité des types référence dans le type de paramètre '{0}' de '{1}' ne correspond pas au membre implémenté implicitement '{2}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' di '{1}' non corrisponde al membro implementato in modo implicito '{2}'.
ja: '{1}' のパラメーター '{0}' の型における参照型の Null 許容性が、暗黙的に実装されるメンバー '{2}' と一致しません。
ko: '{1}'의 '{0}' 매개 변수 형식에 있는 참조 형식의 Null 허용 여부가 암시적으로 구현된 멤버 '{2}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru „{0}” „{1}” jest niezgodna z niejawnie implementowaną składową „{2}”.
pt_br: A nulidade de tipos de referência no tipo de parâmetro '{0}' de '{1}' não corresponde ao membro implicitamente implementado '{2}'.
ru: Допустимость значений NULL для ссылочных типов в типе параметра "{0}" объекта "{1}" не совпадает с явно реализованным членом "{2}".
tr: '{1}' içinde '{0}' parametre türündeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan '{2}' üyesi ile eşleşmiyor.
zh_hans: “{1}”的参数“{0}”类型中引用类型的为 Null 性与隐式实现的成员“{2}”不匹配。
zh_hant: 參數 '{1}' 之 '{0}' 型別中參考型別的可 Null 性與隱含實作的成員 '{2}' 不符合。

# WRN_NullabilityMismatchInParameterTypeOnImplicitImplementation_Title
source: Nullability of reference types in type of parameter doesn't match implicitly implemented member.
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá implicitně implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters entspricht nicht dem implizit implementierten Member.
es: La nulabilidad de los tipos de referencia del tipo de parámetro no coincide con el miembro implementado de forma implícita
fr: La nullabilité des types référence dans le type de paramètre ne correspond pas au membre implémenté implicitement.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al membro implementato in modo implicito.
ja: パラメーターの型における参照型の Null 許容性が、暗黙的に実装されるメンバーと一致しません。
ko: 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 암시적으로 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru jest niezgodna z niejawnie implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro não corresponde ao membro implicitamente implementado.
ru: Допустимость значения NULL для ссылочных типов в типе параметра не совпадает с явно реализованным членом.
tr: Parametre türündeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan üye ile eşleşmiyor.
zh_hans: 参数类型中引用类型的为 Null 性与隐式实现的成员不匹配。
zh_hant: 參數型別中參考型別的可 Null 性與隱含實作的成員不符合。

# WRN_NullabilityMismatchInParameterTypeOnOverride
source: Nullability of reference types in type of parameter '{0}' doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters "{0}" entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia del tipo de parámetro"{0}" no coincide con el miembro reemplazado.
fr: La nullabilité des types référence dans le type de paramètre '{0}' ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' non corrisponde al membro di cui è stato eseguito l'override.
ja: パラメーター '{0}' の型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: '{0}' 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru „{0}” jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro '{0}' não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в типе параметра "{0}" не совпадает с переопределенным членом.
tr: '{0}' parametre türündeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 参数“{0}”类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 參數 '{0}' 型別中參考型別的可 Null 性與覆寫的成員不符合。

# WRN_NullabilityMismatchInParameterTypeOnOverride_Title
source: Nullability of reference types in type of parameter doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia del tipo de parámetro no coincide con el miembro reemplazado
fr: La nullabilité des types référence dans le type de paramètre ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde al membro di cui è stato eseguito l'override.
ja: パラメーターの型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в типе параметра не совпадает с переопределенным членом.
tr: Parametre türündeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 参数类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 參數型別中參考型別的可 Null 性與覆寫的成員不符合。

# WRN_NullabilityMismatchInParameterTypeOnPartial
source: Nullability of reference types in type of parameter '{0}' doesn't match partial method declaration.
cs: Typ odkazu s možnou hodnotou null v typu parametru {0} neodpovídá deklaraci částečné metody.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters "{0}" entspricht nicht der Deklaration der partiellen Methode.
es: La nulabilidad de los tipos de referencia del tipo de parámetro"{0}" no coincide con la declaración de método parcial.
fr: La nullabilité des types référence dans le type de paramètre '{0}' ne correspond pas à la déclaration de méthode partielle.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro '{0}' non corrisponde alla dichiarazione di metodo parziale.
ja: パラメーター '{0}' の型における参照型の Null 許容性が、部分メソッド宣言と一致しません。
ko: '{0}' 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 부분 메서드(Partial Method) 선언과 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru „{0}” jest niezgodna z częściową deklaracją metody.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro '{0}' não corresponde à declaração de método parcial.
ru: Допустимость значения NULL для ссылочных типов в типе параметра "{0}" не совпадает с частичным объявлением метода.
tr: '{0}' parametre türündeki başvuru türlerinin boş değer atanabilirliği kısmi metot bildirimi ile eşleşmiyor.
zh_hans: 参数“{0}”类型中引用类型的为 Null 性与分部方法声明不匹配。
zh_hant: 參數 '{0}' 型別中參考型別的可 Null 性與部分方法宣告不符合。
