Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InvalidAnonymousTypeMemberDeclarator
source: Invalid anonymous type member declarator. Anonymous type members must be declared with a member assignment, simple name or member access.
cs: Neplatný deklarátor členu anonymního typu. Členy anonymního typu musí být deklarované přiřazením členu, prostým názvem nebo přístupem k členu.
de: Ungültiger Deklarator eines anonymen Typmembers. Anonyme Typmember müssen mit einer Memberzuweisung, einem einfachen Namen oder einem Memberzugriff deklariert werden.
es: Declarador de miembro de tipo anónimo no válido. Los miembros de tipo anónimo deben declararse con una asignación de miembro, un nombre simple o un acceso al miembro.
fr: Déclarateur de membre de type anonyme non valide. Les membres de type anonyme doivent être déclarés avec une assignation de membre, un nom simple ou un accès membre.
it: Dichiaratore di membro di tipo anonimo non valido. I membri di tipo anonimo devono essere dichiarati con una assegnazione membro, nome semplice o accesso ai membri.
ja: 匿名型のメンバー宣言子が無効です。メンバー代入、簡易名、またはメンバー アクセスを使用して、匿名型メンバーを宣言する必要があります。
ko: 잘못된 익명 형식 멤버 선언자입니다. 익명 형식 멤버는 멤버 할당, 단순한 이름 또는 멤버 액세스로 선언되어야 합니다.
pl: Nieprawidłowy deklarator składowej typu anonimowego. Składowe typu anonimowego muszą być deklarowane przy użyciu przypisania składowej, nazwy prostej lub dostępu do składowej.
pt_br: Declarador de membro de tipo anônimo inválido. Membros de tipo anônimo devem ser declarados com uma atribuição de membro, nome simples ou acesso de membro.
ru: Недопустимый оператор объявления элемента анонимного типа. Элементы анонимного типа должны быть объявлены назначением элемента, простым именем или доступом к элементу.
tr: Geçersiz anonim türdeki üye bildirimcisi. Anonim tür üyeleri bir üye ataması, basit ad veya üye erişimi ile bildirilmelidir.
zh_hans: 无效的匿名类型成员声明符。匿名类型成员必须使用成员赋值、简单名称或成员访问来声明。
zh_hant: 匿名類型成員宣告子無效。匿名類型成員必須以成員指派、簡單名稱或成員存取加以宣告。

# ERR_InvalidInitializerElementInitializer
source: Invalid initializer member declarator
cs: Neplatný deklarátor členu inicializátoru
de: Ungültiger Deklarator des Initialisierermembers.
es: Declarador de miembro de inicializador no válido
fr: Déclarateur de membre initialiseur non valide
it: Dichiaratore di membro di inizializzatore non valido
ja: 初期化子のメンバー宣言子が無効です
ko: 잘못된 이니셜라이저 멤버 선언자입니다.
pl: Nieprawidłowy deklarator inicjującej składowej
pt_br: Declarador de membro de inicializador inválido
ru: Недопустимый оператор объявления элемента инициализатора.
tr: Geçersiz başlatıcı üye bildirimcisi
zh_hans: 初始值设定项成员声明符无效
zh_hant: 初始設定式成員宣告子無效

# ERR_InconsistentLambdaParameterUsage
source: Inconsistent lambda parameter usage; parameter types must be all explicit or all implicit
cs: Nekonzistentní použití parametru lambda. Typy parametrů musí být buď všechny explicitní, nebo všechny implicitní.
de: Inkonsistente Verwendung des lambda-Parameters. Alle Parametertypen müssen entweder explizit oder implizit sein.
es: Uso incoherente del parámetro lambda; los tipos de parámetro deben ser todos explícitos o todos implícitos
fr: Utilisation du paramètre lambda incohérente ; les types de paramètres doivent être tous explicites ou tous implicites
it: Utilizzo non coerente dei parametri lambda: i parametri devono essere tutti di tipo esplicito o implicito
ja: ラムダ パラメーターの使用方法に一貫性がありません。パラメーター型はすべて明示的であるか、またはすべて暗黙的である必要があります
ko: 람다 매개 변수가 일관성 없이 사용되었습니다. 매개 변수 형식은 모두 명시적이거나 암시적이어야 합니다.
pl: Niespójne użycie parametrów lambda. Wszystkie typy parametrów muszą być albo jawne, albo niejawne.
pt_br: Utilização inconsistente do parâmetro lambda; todos os tipos de parâmetros devem ser explícitos ou implícitos
ru: Несовместимое использование лямбда-параметра; типы параметров должны быть либо все явными, либо все неявными.
tr: Tutarsız lambda parametresi kullanımı; parametre türlerinin tümü explicit veya tümü implicit olmalıdır
zh_hans: lambda 参数的用法不一致；参数类型必须全部为显式或全部为隐式
zh_hant: Lambda 參數用法不一致; 參數類型必須全部為明確類型或全部為隱含類型

# ERR_PartialMemberNotExplicit
source: A partial member may not explicitly implement an interface member
fr: Un membre partiel ne peut pas implémenter explicitement un membre d'interface
it: Un membro parziale non può implementare in modo esplicito un membro di interfaccia
pl: Częściowy element członkowski nie może wyraźnie implementować elementu członkowskiego interfejsu
pt_br: Um membro parcial não pode implementar um membro de interface explicitamente
ru: Частичный член не может явным образом реализовать член интерфейса
zh_hans: 分部成员不能显式实现接口成员
zh_hant: 部分成員不可明確地實作介面成員

# ERR_PartialMethodExtensionDifference
source: Both partial method declarations must be extension methods or neither may be an extension method
cs: Obě deklarace částečné metody musí deklarovat metody rozšíření, nebo nesmí metodu rozšíření deklarovat žádná z nich.
de: Beide partiellen Methodendeklarationen müssen Erweiterungsmethoden sein, oder keine von beiden darf eine Erweiterungsmethode sein.
es: Ambas declaraciones de método parcial deben ser métodos de extensión; si no, no puede serlo ninguna de las dos
fr: Soit les deux déclarations de méthode partielles sont des méthodes d'extension, soit aucune ne l'est
it: Entrambe le dichiarazioni di metodo parziale devono essere metodi di estensione, altrimenti nessuna delle due potrà esserlo
ja: 部分メソッド宣言は、両方とも拡張メソッドであるか、両方とも拡張メソッドでないかのいずれかである必要があります
ko: 두 부분 메서드(Partial Method) 선언 모두 확장 메서드이거나 확장 메서드가 아니어야 합니다.
pl: Obie deklaracje metody częściowej muszą być metodami rozszerzenia albo żadna z nich nie może być metodą rozszerzenia.
pt_br: As duas declarações de métodos parciais devem ser métodos de extensão ou nenhuma delas poderá ser desse tipo
ru: Разделяемый метод должен быть либо оба раза объявлен как метод расширения, либо нигде не объявлен как метод расширения.
tr: İki kısmi yöntem bildiriminin de genişletme yöntemi olması ya da hiçbirinin genişletme yöntemi olmaması gerekir
zh_hans: 两个分部方法声明都必须是扩展方法，或者都不能是扩展方法
zh_hant: 兩個部分方法宣告必須都是擴充方法，或者都不是擴充方法

# ERR_PartialMethodOnlyOneLatent
source: A partial method may not have multiple defining declarations
cs: Částečná metoda nesmí mít víc definujících deklarací.
de: Eine partielle Methode darf nicht über mehrere definierende Deklarationen verfügen.
es: Un método parcial no puede tener varias declaraciones de definición
fr: Une méthode partielle ne peut pas avoir plusieurs déclarations de définition
it: Un metodo parziale non può avere più dichiarazioni di definizione
ja: 部分メソッドには、複数の定義宣言を指定することはできません
ko: 부분 메서드(Partial Method)에는 하나의 정의 선언만 사용할 수 있습니다.
pl: Metoda częściowa nie może mieć wielu deklaracji definiujących.
pt_br: Um método parcial não pode ter várias declarações de definição
ru: Разделяемый метод не может иметь несколько определяющих объявлений.
tr: Kısmi yöntemin birden fazla tanımlama bildirimi olamaz
zh_hans: 分部方法不能有多个定义声明
zh_hant: 部分方法不可有多重定義宣告

# ERR_PartialMethodOnlyOneActual
source: A partial method may not have multiple implementing declarations
cs: Částečná metoda nesmí mít víc implementujících deklarací.
de: Eine partielle Methode darf nicht über mehrere implementierende Deklarationen verfügen.
es: Un método parcial no puede tener varias declaraciones de implementación
fr: Une méthode partielle ne peut pas avoir plusieurs déclarations d'implémentation
it: Un metodo parziale non può avere più dichiarazioni di implementazione
ja: 部分メソッドでは、複数の実装宣言を含むことができない場合があります
ko: 부분 메서드(Partial Method)에는 하나의 구현 선언만 사용할 수 있습니다.
pl: Metoda częściowa nie może mieć wielu deklaracji implementujących.
pt_br: Um método parcial não pode ter várias declarações de implementação
ru: Разделяемый метод не может иметь несколько реализующих объявлений.
tr: Kısmi yöntemin birden fazla uygulama bildirimi olamaz
zh_hans: 分部方法不能有多个实现声明
zh_hant: 部分方法不能有多重實作的宣告

# ERR_PartialMethodMustHaveLatent
source: No defining declaration found for implementing declaration of partial method '{0}'
cs: Nenašla se žádná definující deklarace pro implementující deklaraci částečné metody {0}.
de: Für die implementierende Deklaration der partiellen Methode "{0}" wurde keine definierende Deklaration gefunden.
es: No se encontró ninguna declaración de definición para la declaración de implementación del método parcial '{0}'
fr: Aucune déclaration de définition trouvée pour la déclaration d'implémentation de la méthode partielle '{0}'
it: Non sono state trovate dichiarazioni di definizione per la dichiarazione di implementazione del metodo parziale '{0}'
ja: 部分メソッド '{0}' の実装宣言に対する定義宣言が見つかりませんでした
ko: {0}' 부분 메서드(Partial Method)의 구현 선언에 대한 정의 선언이 없습니다.
pl: Nie znaleziono deklaracji definiującej na potrzeby implementowania częściowej metody „{0}”
pt_br: Nenhuma declaração de definição encontrada para implementar a declaração de método parcial "{0}"
ru: Отсутствует определяющее объявление для реализующего объявления разделяемого метода "{0}".
tr: {0}' kısmi yönteminin bildirimini uygulamak için tanımlayıcı bildirim bulunamadı
zh_hans: 没有为分部方法“{0}”的实现声明找到定义声明
zh_hant: 找不到用以實作部分方法 '{0}' 宣告的定義宣告

# ERR_PartialMethodInconsistentConstraints
source: Partial method declarations of '{0}' have inconsistent constraints for type parameter '{1}'
cs: Částečné deklarace metod {0} mají nekonzistentní omezení parametru typu {1}.
de: Partielle Methodendeklarationen von "{0}" weisen inkonsistente Einschränkungen für den Typparameter "{1}" auf.
es: Las declaraciones de métodos parciales de "{0}" tienen restricciones incoherentes para el parámetro de tipo "{1}"
fr: Les déclarations de méthodes partielles de '{0}' ont des contraintes incohérentes pour le paramètre de type '{1}'
it: Le dichiarazioni di metodo parziali di '{0}' contengono vincoli incoerenti per il parametro di tipo '{1}'
ja: '{0}' の部分メソッド宣言には、型パラメーター '{1}' に対して矛盾する制約が含まれています
ko: '{0}'의 부분 메서드(Partial method) 선언의 '{1}' 형식 매개 변수에 대한 제약 조건이 일관되지 않습니다.
pl: Deklaracje metod częściowych elementu „{0}” mają niespójne ograniczenia dla parametru typu „{1}”
pt_br: Declarações de método parciais de '{0}' têm restrições inconsistentes para o parâmetro de tipo '{1}'
ru: Несогласованные ограничения для параметра типа "{1}" в частичных объявлениях метода "{0}".
tr: '{0}' öğesinin kısmi metot bildirimleri, '{1}' tür parametresi için tutarsız kısıtlamalara sahip
zh_hans: “{0}”的分部方法声明对类型参数“{1}”的约束不一致
zh_hant: '{0}' 的部分方法宣告對型別參數 '{1}' 有不一致的條件約束

# ERR_PartialMethodToDelegate
source: Cannot create delegate from method '{0}' because it is a partial method without an implementing declaration
cs: Nejde vytvořit delegáta z metody {0}, protože se jedná o částečnou metodu bez implementující deklarace.
de: Aus der {0}-Methode kann kein Delegat erstellt werden, da es sich um eine partielle Methode ohne implementierende Deklaration handelt.
es: No se puede crear un delegado a partir del método '{0}' porque es un método parcial sin declaración de implementación
fr: Impossible de créer un délégué à partir de la méthode '{0}', car il s'agit d'une méthode partielle sans déclaration d'implémentation
it: Non è possibile creare il delegato dal metodo '{0}' perché è un metodo parziale senza una dichiarazione di implementazione
ja: メソッド '{0}' は実装宣言がない部分メソッドであるため、このメソッドからデリゲートを作成できません
ko: {0}'은(는) 구현 선언이 없는 부분 메서드(Partial Method)이므로 이 메서드로부터 대리자를 만들 수 없습니다.
pl: Nie można utworzyć delegata z metody „{0}”, ponieważ jest to metoda częściowa bez deklaracji implementującej.
pt_br: Não é possível criar representante do método "{0}" porque ele é um método parcial sem declaração de implementação
ru: Невозможно создать делегат на основе метода "{0}, так как он является разделяемым методом без реализующего объявления.
tr: Uygulama bildirimi olmayan bir kısmi yöntem olduğundan '{0}' yönteminden temsilci oluşturulamıyor
zh_hans: 无法通过方法“{0}”创建委托，因为该方法是没有实现声明的分部方法
zh_hant: 無法從方法 '{0}' 建立委派，因為它是無實作宣告的部分方法

# ERR_PartialMemberStaticDifference
source: Both partial member declarations must be static or neither may be static
fr: Les deux déclarations de membres partiels doivent être statiques ou aucune ne peut être statique
it: Entrambe le dichiarazioni di membro parziale devono essere statiche, altrimenti nessuna delle due potrà esserlo
pl: Obie deklaracje częściowych elementów członkowskich muszą być statyczne lub żadna z nich nie może być statyczna
pt_br: As duas declarações de membros parciais precisam ser estáticas ou nenhuma delas pode ser estática
ru: Оба объявления частичного члена должны быть статическими или оба не должны быть статическими
zh_hans: 这两个分部成员声明必须都是或者都不是静态声明
zh_hant: 兩個部分成員宣告都必須是靜態，或者都不是靜態

# ERR_PartialMethodInExpressionTree
source: Partial methods with only a defining declaration or removed conditional methods cannot be used in expression trees
cs: Ve stromech výrazů nejde používat částečné metody, pro které existuje jenom definující deklarace, nebo odebrané podmíněné metody.
de: In Ausdrucksbäumen dürfen weder partielle Methoden mit nur einer definierenden Deklaration noch entfernte bedingte Methoden verwendet werden.
es: En los árboles de expresión no se pueden usar métodos parciales con solo una declaración de definición ni métodos condicionales quitados
fr: Les méthodes partielles avec uniquement une déclaration de définition ou des méthodes conditionnelles supprimées ne peuvent pas être utilisées dans des arborescences d'expressions
it: Non è possibile usare negli alberi delle espressioni metodi parziali contenenti solo una dichiarazione di definizione o metodi condizionali rimossi
ja: 定義宣言だけを含む部分メソッドまたは削除された条件付きメソッドは、式ツリーで使用できません
ko: 정의 선언만 있는 부분 메서드(Partial Method) 또는 제거된 조건부 메서드는 식 트리에 사용할 수 없습니다.
pl: W drzewach wyrażeń nie można używać metod częściowych zawierających tylko deklarację definiującą ani usuniętych metod warunkowych.
pt_br: Os métodos parciais com apenas uma declaração de definição ou métodos condicionais removidos não podem ser usados em árvores de expressão
ru: В деревьях выражений не могут использоваться разделяемые методы, имеющие только определяющее объявление или только удаленные условные методы.
tr: Yalnızca bir tanımlama bildirimi olan kısmi yöntemler veya kaldırılmış koşullu yöntemler ifade ağaçlarında kullanılamaz
zh_hans: 不能在表达式树中使用只有定义声明的分部方法或已移除的条件方法
zh_hant: 在運算式樹狀結構中，不可使用只具有定義宣告或已移除條件式方法的部分方法

# WRN_ObsoleteOverridingNonObsolete
source: Obsolete member '{0}' overrides non-obsolete member '{1}'
cs: Zastaralý člen {0} potlačuje nezastaralý člen {1}.
de: Der veraltete Member "{0}" überschreibt den nicht veralteten Member "{1}".
es: El miembro obsoleto '{0}' invalida el miembro no obsoleto '{1}'
fr: Le membre obsolète '{0}' se substitue au membre non obsolète '{1}'
it: Il membro obsoleto '{0}' esegue l'override del membro non obsoleto '{1}'
ja: 旧形式のメンバー '{0}' は、旧形式でないメンバー '{1}' をオーバーライドします
ko: 사용되지 않는 '{0}' 멤버가 사용되는 '{1}' 멤버를 재정의합니다.
pl: Przestarzała składowa „{0}” przesłania nieprzestarzałą składową „{1}”.
pt_br: O membro obsoleto "{0}" substitui o membro não obsoleto "{1}"
ru: Член с атрибутом "obsolete" "{0}" переопределяет член без атрибута "obsolete" "{1}"
tr: Kullanılmayan '{0}' üyesi kullanılan '{1}' üyesini geçersiz kılar
zh_hans: 过时成员“{0}”重写未过时成员“{1}”
zh_hant: 過時的成員 '{0}' 會覆寫非過時的成員 '{1}'

# WRN_ObsoleteOverridingNonObsolete_Title
source: Obsolete member overrides non-obsolete member
cs: Zastaralý člen přepisuje nezastaralý člen.
de: Veraltetes Element überschreibt nicht veraltetes Element
es: El miembro obsoleto invalida un miembro no obsoleto
fr: Un membre obsolète se substitue à un membre non obsolète
it: Il membro obsoleto esegue l'override del membro non obsoleto
ja: 旧形式のメンバーが、旧形式でないメンバーをオーバーライドします
ko: 사용되지 않는 멤버가 사용되는 멤버를 재정의합니다.
pl: Przestarzała składowa przesłania nieprzestarzałą składową
pt_br: O membro obsoleto substitui o membro não obsoleto
ru: Устаревший член переопределяет неустаревший член
tr: Eski üye eski olmayan üyeyi geçersiz kılar
zh_hans: 过时成员重写未过时成员
zh_hant: 過時成員會覆寫非過時成員

# WRN_DebugFullNameTooLong
source: The fully qualified name for '{0}' is too long for debug information. Compile without '/debug' option.
cs: Plně kvalifikovaný název {0} je moc dlouhý pro vygenerování ladicích informací. Z kompilace vyřaďte možnost /debug.
de: Der vollqualifizierte Name für "{0}" ist für Debuginformationen zu lang. Kompilieren Sie ohne die /debug-Option.
es: El nombre completo de '{0}' es demasiado largo para la información de depuración. Compile sin la opción '/debug'.
fr: Le nom qualifié complet de '{0}' est trop long pour les informations de débogage. Compilez sans l'option '/debug'.
it: Il nome completo per '{0}' è troppo lungo per le informazioni di debug. Compilare senza l'opzione '/debug'.
ja: '{0}' の完全修飾名は、デバッグ情報に対して長すぎます。'/debug' オプションなしでコンパイルしてください。
ko: {0}'의 정규화된 이름이 디버그 정보로는 너무 깁니다. '/debug' 옵션 없이 컴파일됩니다.
pl: W pełni kwalifikowana nazwa elementu „{0}” jest za długa dla informacji debugowania. Skompiluj bez opcji „/debug”.
pt_br: O nome totalmente qualificado para "{0}" é muito longo para informações de depuração. Compile sem a opção "/debug".
ru: Слишком длинное полное имя "{0}" для отладочной информации. Компилируйте без параметра "/debug".
tr: {0}' için tamamen nitelikli ad, hata ayıklama bilgileri için çok uzun. '/debug' seçeneği olmadan derleyin.
zh_hans: “{0}”的完全限定名对于调试信息太长。请在不使用“/debug”选项的情况下编译。
zh_hant: '{0}' 的完整名稱對於偵錯資訊而言太長。在編譯時請勿使用 '/debug' 選項。

# WRN_DebugFullNameTooLong_Title
source: Fully qualified name is too long for debug information
cs: Plně kvalifikovaný název je pro ladicí informace moc dlouhý.
de: Voll qualifizierter Name ist zu lang für Debuginformationen
es: El nombre completo es demasiado largo para la información de depuración
fr: Le nom complet est trop long pour les informations de débogage
it: Il nome completo è troppo lungo per le informazioni di debug
ja: 完全修飾名が、デバッグ情報に対して長すぎます
ko: 정규화된 이름이 너무 길어서 디버그 정보에 사용할 수 없습니다.
pl: W pełni kwalifikowana nazwa jest za długa dla informacji debugowania
pt_br: O nome totalmente qualificado é muito longo para as informações de depuração
ru: Полное имя слишком длинное для сведений об отладке
tr: Tam belirtilen ad hata ayıklama bilgileri için çok uzun
zh_hans: 完全限定名对于调试信息太长
zh_hant: 偵錯資訊的完整名稱太長

# ERR_ImplicitlyTypedVariableAssignedBadValue
source: Cannot assign {0} to an implicitly-typed variable
cs: {0} nejde přiřadit k proměnné s implicitním typem.
de: "{0}" kann einer implizit typisierten Variablen nicht zugewiesen werden.
es: No se puede asignar {0} a una variable con tipo implícito
fr: Impossible d'assigner {0} à une variable implicitement typée
it: Non è possibile assegnare {0} a una variabile tipizzata in modo implicito
ja: {0} を暗黙的に型指定された変数に割り当てることはできません
ko: 암시적으로 형식화된 변수에 {0}을(를) 할당할 수 없습니다.
pl: Nie można przypisać elementu {0} do zmiennej o typie określonym niejawnie
pt_br: Não é possível atribuir {0} a uma variável de tipo implícito
ru: Не удается присвоить {0} неявно типизированной переменной.
tr: {0} öğesi açıkça yazılmış bir değişkene atanamıyor
zh_hans: 无法将 {0} 赋予隐式类型化的变量
zh_hant: 無法將 {0} 指派給隱含類型變數

# ERR_ImplicitlyTypedVariableWithNoInitializer
source: Implicitly-typed variables must be initialized
cs: Proměnné s implicitním typem musí být inicializované.
de: Implizit typisierte Variablen müssen initialisiert werden.
es: Las variables con tipo implícito se deben inicializar
fr: Les variables implicitement typées doivent être initialisées
it: Le variabili tipizzate in modo implicito devono essere inizializzate
ja: 暗黙的に型指定された変数は初期化される必要があります
ko: 암시적으로 형식화된 지역 변수는 초기화해야 합니다.
pl: Zmienne o typie określonym niejawnie muszą być inicjowane
pt_br: Variáveis de tipo implícito devem ser inicializadas
ru: Неявно типизированные переменные должны быть инициализированы
tr: Açıkça yazılmış değişkenler başlatılmalıdır
zh_hans: 隐式类型化的变量必须已初始化
zh_hant: 隱含類型變數必須經過初始設定

# ERR_ImplicitlyTypedVariableMultipleDeclarator
source: Implicitly-typed variables cannot have multiple declarators
cs: Proměnné s implicitním typem nemůžou mít víc deklarátorů.
de: Implizit typisierte Variablen dürfen nicht mehrere Deklaratoren aufweisen.
es: Las variables con tipo implícito no pueden tener varios declaradores
fr: Les variables implicitement typées ne peuvent pas avoir plusieurs déclarateurs
it: Le variabili tipizzate in modo implicito non possono avere più dichiaratori
ja: 暗黙的に型指定された変数は、複数の宣言子を持つことができません
ko: 암시적으로 형식화된 변수에는 선언자를 여러 개 사용할 수 없습니다.
pl: Zmienne o typie określonym niejawnie nie mogą mieć wiele deklaratorów
pt_br: Variáveis de tipo implícito não podem ter vários declaradores
ru: Неявно типизированные переменные не могут иметь множество операторов объявления.
tr: Açıkça yazılmış değişkenlerin birden çok bildirimcisi olamaz
zh_hans: 隐式类型化的变量不能有多个声明符
zh_hant: 隱含類型變數不可有多重宣告子

# ERR_ImplicitlyTypedVariableAssignedArrayInitializer
source: Cannot initialize an implicitly-typed variable with an array initializer
cs: Proměnnou s implicitním typem nejde inicializovat inicializátorem pole.
de: Eine implizit typisierte Variable kann nicht mit einem Arrayinitialisierer initialisiert werden.
es: Una variable con tipo implícito no se puede inicializar con un inicializador de matriz
fr: Impossible d'initialiser une variable implicitement typée avec un initialiseur de tableau
it: Non è possibile inizializzare una variabile locale tipizzata in modo implicito con un inizializzatore di matrici
ja: 配列初期化子で暗黙的に型指定された変数を初期化することはできません
ko: 암시적으로 형식화된 변수는 배열 이니셜라이저를 사용하여 초기화할 수 없습니다.
pl: Nie można zainicjować zmiennej o typie określonym niejawnie za pomocą inicjatora tablicy
pt_br: Não é possível inicializar uma variável de tipo implícito com um inicializador de matriz
ru: Невозможно инициализировать неявно типизированную переменную инициализатором массива.
tr: Bir dizi başlatıcısı ile açıkça yazılmış bir değişken başlatılamıyor
zh_hans: 无法使用数组初始值设定项初始化隐式类型化的变量
zh_hant: 無法使用陣列初始設定式來初始設定隱含類型變數

# ERR_ImplicitlyTypedLocalCannotBeFixed
source: Implicitly-typed local variables cannot be fixed
cs: Lokální proměnné s implicitním typem nemůžou být pevné.
de: Implizit typisierte lokale Variablen können nicht als "fixed" deklariert werden.
es: Las variables locales con tipo implícito no pueden ser fijas
fr: Les variables locales implicitement typées ne peuvent pas être fixed
it: Le variabili locali tipizzate in modo implicito non possono essere di tipo fisso
ja: 暗黙的に型指定されたローカル変数は修正できません
ko: 암시적으로 형식화된 지역 변수는 fixed일 수 없습니다.
pl: Zmienne lokalne o typie określonym niejawnie nie mogą być ustalone.
pt_br: Variáveis locais do tipo implícito não podem ser fixas
ru: Неявно типизированная локальная переменная не может быть фиксированной.
tr: Türü örtük olarak belirlenmiş yerel değişkenler sabitlenemez
zh_hans: 隐式类型的局部变量不能是固定值
zh_hant: 隱含類型區域變數不可為 fixed

# ERR_ImplicitlyTypedVariableCannotBeConst
source: Implicitly-typed variables cannot be constant
cs: Proměnné s implicitním typem nemůžou být konstanty.
de: Implizit typisierte Variablen können nicht konstant sein.
es: Las variables con tipo implícito no pueden ser constantes
fr: Les variables implicitement typées ne peuvent pas être constant
it: Le variabili tipizzate in modo implicito non possono essere costanti
ja: 暗黙的に型指定された変数を定数にすることはできません
ko: 암시적으로 형식화된 변수는 상수일 수 없습니다.
pl: Zmienne o typie określonym niejawnie nie mogą być stałymi
pt_br: Variáveis de tipo implícito não podem ser constantes
ru: Неявно типизированные переменные не могут быть константными
tr: Açıkça yazılmış değişkenler sabit olamaz
zh_hans: 隐式类型化的变量不能是常量
zh_hant: 隱含類型變數不可為常數
