Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_InterceptorLineCharacterMustBePositive
source: Line and character numbers provided to InterceptsLocationAttribute must be positive.
fr: Les numéros de ligne et de caractère fournis à InterceptsLocationAttribute doivent être positifs.
it: I numeri di riga e di carattere specificati per InterceptsLocationAttribute devono essere positivi.
ja: InterceptsLocationAttribute に指定する行番号と文字番号は正の値である必要があります。
pl: Liczba wierszy i znaków przekazana do atrybutu InterceptsLocationAttribute musi być dodatnia.
pt_br: Os números de linha e caractere fornecidos no InterceptsLocationAttribute devem ser positivos.
ru: Номера строк и символов, предоставляемые InterceptsLocationAttribute, должны быть положительными.
zh_hans: 提供给 InterceptsLocationAttribute 的行数和字符数必须为正数。
zh_hant: 提供給 InterceptsLocationAttribute 的行數和字元數必須是正數。

# ERR_InterceptorLineOutOfRange
source: The given file has '{0}' lines, which is fewer than the provided line number '{1}'.
fr: Le fichier donné contient '{0}' lignes, ce qui est inférieur au numéro de ligne fourni '{1}'.
it: Il file specificato contiene '{0}' righe, che sono inferiori al numero di riga specificato '{1}'.
ja: 与えられたファイルは '{0}' 行しかなく、指定された行数 '{1}' を下回っています。
pl: Podany plik zawiera następującą liczbę wierszy: „{0}”, czyli mniej niż podana liczba wierszy „{1}”.
pt_br: O arquivo fornecido tem '{0}' linhas, que é menor do que o número de linhas fornecido '{1}'.
ru: В данном файле есть строки ' {0} ', что меньше предоставленного номера строки ' {1} '.
zh_hans: 给定文件具有 {0} 行，这少于提供的行数“{1}”
zh_hant: 指定的檔案有 '{0}' 行，少於提供的行數 '{1}'。

# ERR_InterceptorMethodMustBeOrdinary
source: An interceptor method must be an ordinary member method.
fr: Une méthode interceptrice doit être une méthode membre ordinaire.
it: Un metodo intercettore deve essere un metodo membro ordinario.
ja: インターセプター メソッドは通常のメンバー メソッドである必要があります。
pl: Metoda interceptora musi być zwykłą metodą składową.
pt_br: Um método interceptor deve ser um método membro comum.
ru: Метод-перехватчик должен быть обычным методом-элементом.
zh_hans: 侦听器方法必须是普通成员方法。
zh_hant: 攔截器方法必須是一般成員方法。

# ERR_InterceptorMustHaveMatchingThisParameter
source: Interceptor must have a 'this' parameter matching parameter '{0}' on '{1}'.
fr: L'intercepteur doit avoir un paramètre 'ce' correspondant au paramètre '{0}' sur '{1}'.
it: L'intercettore deve avere un parametro 'this' corrispondente al parametro '{0}' su '{1}'.
ja: インターセプターには、'{1}' で '{0}' パラメーターと一致する 'this' パラメーターが必要です。
pl: Interceptor musi mieć parametr „this” zgodny z parametrem „{0}” w „{1}”.
pt_br: O interceptador deve ter um parâmetro 'this' correspondente '{0}' no '{1}'.
ru: Перехватчик должен иметь параметр this, соответствующий параметру ' {0} ' на ' {1} '.
zh_hans: 侦听器必须具有与“{1}”上的参数“{0}”匹配的 "this" 参数。
zh_hant: 攔截器在 '{1}' 上必須有 'this' 參數符合參數 '{0}'。

# ERR_InterceptorMustNotHaveThisParameter
source: Interceptor must not have a 'this' parameter because '{0}' does not have a 'this' parameter.
fr: Interceptor ne doit pas avoir de 'ce' paramètre car '{0}' n'a pas de 'ce' paramètre.
it: L'intercettore non deve avere un parametro 'this' perché '{0}' non ha un parametro 'this'.
ja: '{0}' に 'this' パラメーターがないため、インターセプターに 'this' パラメーターを指定することはできません。
pl: Interceptor nie może mieć parametru „this”, ponieważ „{0}” nie ma parametru „this”.
pt_br: O interceptador não deve ter um parâmetro 'this' '{0}' não tem um parâmetro 'this'.
ru: У перехватчика не должно быть параметра this, потому что у {0} нет параметра this.
zh_hans: 侦听器不能具有 "this" 参数，因为“{0}”没有 "this" 参数。
zh_hant: 攔截器不能有 'this' 參數，因為 '{0}' 沒有 'this' 參數。

# ERR_InterceptorMustReferToStartOfTokenPosition
source: The provided line and character number does not refer to the start of token '{0}'. Did you mean to use line '{1}' and character '{2}'?
fr: La ligne et le numéro de caractère fournis ne font pas référence au début du jeton '{0}'. Vouliez-vous utiliser la ligne '{1}' et le caractère '{2}' ?
it: La riga e il numero di carattere specificati non fanno riferimento all'inizio del token '{0}'. Volevi usare la riga '{1}' e il carattere '{2}'?
ja: 指定された行番号と文字番号は、トークン '{0}' の先頭を参照していません。行 '{1}' と文字 '{2}' を使用するつもりでしたか?
pl: Podana liczba wierszy i znaków nie odwołuje się do początku tokenu „{0}”. Czy chodziło Ci o użycie wiersza „{1}” i znaku „{2}”?
pt_br: O número de linha e caractere fornecido não se refere ao início do token '{0}'. Você quis usar a linha '{1}' e o caractere '{2}'?
ru: Предоставленный номер строки и символа не относится к началу токена ' {0} '. Вы хотели использовать строку ' {1} ' и символ ' {2} '?
zh_hans: 提供的行数和字符数不引用标记“{0}”的开头。你是否想要使用行“{1}”和字符“{2}”?
zh_hant: 提供的行數和字元數並未參照權杖 '{0} 的開頭。您是否要使用行 '{1}' 和字元 '{2}'?

# ERR_InterceptorNameNotInvoked
source: Possible method name '{0}' cannot be intercepted because it is not being invoked.
fr: Le nom de méthode possible '{0}' ne peut pas être intercepté car il n'est pas appelé.
it: Impossibile intercettare il possibile nome di metodo '{0}' perché non è stato richiamato.
ja: 考えられるメソッド名 '{0}' は呼び出されていないため、インターセプトすることができません。
pl: Nie można przechwycić możliwej nazwy metody „{0}”, ponieważ nie jest ona wywoływana.
pt_br: O nome do possível método '{0}' não pode ser interceptado porque não está sendo invocado.
ru: Возможное имя метода " {0} " не может быть перехвачено, так как он не вызывается.
zh_hans: 无法截获可能的方法名称“{0}”，因为未调用此方法。
zh_hant: 無法攔截可能的方法名稱 '{0}'，因為未對其叫用。

# ERR_InterceptorNonUniquePath
source: Cannot intercept a call in file with path '{0}' because multiple files in the compilation have this path.
fr: Impossible d'intercepter un appel dans le fichier avec le chemin '{0}' car plusieurs fichiers de la compilation ont ce chemin.
it: Non è possibile intercettare una chiamata nel file con percorso '{0}' perché questo percorso è presente in più file della compilazione.
ja: コンパイル内の複数のファイルにこのパスがあるため、パス '{0}' を持つファイル内の呼び出しをインターセプトできません。
pl: Nie można przechwycić wywołania w pliku ze ścieżką „{0}”, ponieważ wiele plików w kompilacji ma tę ścieżkę.
pt_br: Não é possível interceptar uma chamada no arquivo com caminho '{0}' porque vários arquivos na compilação têm esse caminho.
ru: Невозможно перехватить вызов в файле с путем ' {0} ', так как несколько файлов в компиляции имеют этот путь.
zh_hans: 无法截获路径为“{0}”的文件中的调用，因为编译中的多个文件具有此路径。
zh_hant: 無法攔截路徑為 '{0}' 的檔案中呼叫，因為編譯中的多個檔案具有此路徑。

# ERR_InterceptorNotAccessible
source: Cannot intercept call with '{0}' because it is not accessible within '{1}'.
fr: Impossible d'intercepter l'appel avec '{0}' car il n'est pas accessible dans '{1}'.
it: Non è possibile intercettare la chiamata con '{0}' perché non è accessibile in '{1}'.
ja: '{1}' 内ではアクセスできないため、'{0}' を使用して呼び出しをインターセプトできません。
pl: Nie można przechwycić wywołania z „{0}”, ponieważ nie jest ono dostępne w obrębie „{1}”.
pt_br: Não é possível interceptar a chamada com '{0}' porque ela não está acessível em '{1}'.
ru: Невозможно перехватить вызов с ' {0} ', так как он недоступен внутри ' {1} '.
zh_hans: 无法使用“{0}”截获调用，因为无法在“{1}”中访问它。
zh_hant: 無法攔截與 '{0}' 的呼叫，因為無法在 '{1}' 內存取。

# ERR_InterceptorPathNotInCompilation
source: Cannot intercept: compilation does not contain a file with path '{0}'.
fr: Impossible d'intercepter : la compilation ne contient pas de fichier avec le chemin "{0}".
it: Non è possibile intercettare: la compilazione non contiene un file con percorso '{0}'.
ja: インターセプトできません。コンパイルにパス '{0}' のファイルが含まれていません。
pl: Nie można przechwycić: kompilacja nie zawiera pliku ze ścieżką „{0}”.
pt_br: Não é possível interceptar: a compilação não contém um arquivo com caminho '{0}'.
ru: Невозможно перехватить: компиляция не содержит файла с путем ' {0} '.
zh_hans: 无法截获: 编译不包含路径为“{0}”的文件。
zh_hant: 無法攔截: 編譯未包含路徑為 '{0}' 的檔案。

# ERR_InterceptorPathNotInCompilationWithCandidate
source: Cannot intercept: compilation does not contain a file with path '{0}'. Did you mean to use path '{1}'?
fr: Impossible d'intercepter : la compilation ne contient pas de fichier avec le chemin "{0}". Vouliez-vous utiliser le chemin '{1}' ?
it: Non è possibile intercettare: la compilazione non contiene un file con percorso '{0}'. Forse volevi usare il percorso '{1}'?
ja: インターセプトできません。コンパイルにパス '{0}' のファイルが含まれていません。パス '{1}' を使うつもりでしたか?
pl: Nie można przechwycić: kompilacja nie zawiera pliku ze ścieżką „{0}”. Czy chodziło o użycie ścieżki „{1}”?
pt_br: Não é possível interceptar: a compilação não contém um arquivo com caminho '{0}'. Você quis usar o caminho '{1}'?
ru: Невозможно перехватить: компиляция не содержит файла с путем ' {0} '. Вы хотели использовать путь ' {1} '?
zh_hans: 无法截获: 编译不包含路径为“{0}”的文件。你是否想要使用路径“{1}”?
zh_hant: 無法攔截: 編譯未包含路徑為 '{0}' 的檔案。是否要使用 '{1}'?

# ERR_InterceptorPositionBadToken
source: The provided line and character number does not refer to an interceptable method name, but rather to token '{0}'.
fr: La ligne et le numéro de caractère fournis ne font pas référence à un nom de méthode interceptable, mais plutôt au jeton '{0}'.
it: La riga e il numero di caratteri specificati non fanno riferimento a un nome di metodo intercettabile, ma al token '{0}'.
ja: 指定された行番号と文字番号は、インターセプト可能なメソッド名ではなく、トークン '{0}' を参照しています。
pl: Podana liczba wierszy i znaków nie odwołuje się do nazwy metody możliwej do przechwycenia, ale do tokenu „{0}”.
pt_br: O número de linha e caracteres fornecido não se refere a um nome de método interceptável, mas sim ao token '{0}'.
ru: Предоставленная строка и номер символа относятся не к имени перехватываемого метода, а скорее к токену ' {0} '.
zh_hans: 提供的行数和字符数不引用可截获的方法名称，而是引用令牌“{0}”。
zh_hant: 提供的行數和字元數並未參照可攔截的方法名稱，而是指權杖 '{0}'。

# ERR_InterceptorScopedMismatch
source: Cannot intercept call to '{0}' with '{1}' because of a difference in 'scoped' modifiers or '[UnscopedRef]' attributes.
fr: Impossible d'intercepter l'appel à '{0}' avec '{1}' en raison d'une différence dans les modificateurs 'scoped' ou les attributs '[UnscopedRef]'.
it: Non è possibile intercettare la chiamata a '{0}' con '{1}' a causa di una differenza nei modificatori 'scoped' o negli attributi '[UnscopedRef]'.
ja: 'scoped' 修飾子または '[UnscopedRef]' 属性の違いにより、'{1}' を使用して '{0}' への呼び出しをインターセプトできません。
pl: Nie można przechwycić wywołania do „{0}” za pomocą „{1}” z powodu różnicy w modyfikatorach „scoped” lub atrybutach „[UnscopedRef]”.
pt_br: Não é possível interceptar a chamada '{0}' com '{1}' por causa de uma diferença nos modificadores 'scoped' ou atributos '[UnscopedRef]'.
ru: Не удается перехватить вызов ' {0} ' с ' {1} ' из-за разницы в модификаторах 'scoped' или атрибутах '[UnscopedRef]'.
zh_hans: 由于 "scoped" 修饰符或 "[UnscopedRef]" 属性中存在差异，无法使用“{1}”截获对“{0}”的调用。
zh_hant: 因為 'scoped' 修飾元或 '[UnscopedRef]' 屬性不同，所以無法攔截具有 '{1}' 對 '{0}' 的呼叫。

# ERR_InterceptorSignatureMismatch
source: Cannot intercept method '{0}' with interceptor '{1}' because the signatures do not match.
fr: Impossible d'intercepter la méthode '{0}' avec l'intercepteur '{1}' car les signatures ne correspondent pas.
it: Impossibile intercettare il metodo '{0}' con l'intercettore '{1}' perché le firme non corrispondono.
ja: 署名が一致しないため、インターセプター '{1}' でメソッド '{0}' をインターセプトできません。
pl: Nie można przechwycić metody „{0}” za pomocą interceptora „{1}” , ponieważ podpisy nie są zgodne.
pt_br: Não é possível interceptar o método '{0}' com o interceptador '{1}' porque as assinaturas não correspondem.
ru: Невозможно перехватить метод " {0} " с перехватчиком " {1} ", поскольку подписи не совпадают.
zh_hans: 无法使用侦听器“{1}”截获方法“{0}”，因为签名不匹配。
zh_hant: 無法攔截攔截器為 '{1}' 的方法 '{0}'，因為簽章不相符。

# ERR_InterceptorsFeatureNotEnabled
source: The 'interceptors' feature is not enabled in this namespace. Add '{0}' to your project.
fr: La fonctionnalité « intercepteurs » n'est pas activée dans cet espace de noms. Ajoutez « {0} » à votre projet.
it: La funzionalità 'intercettori' non è abilitata in questo spazio dei nomi. Aggiungere '{0}' al progetto.
pl: Funkcja eksperymentalna „interceptorów” nie jest włączona w tej przestrzeni nazw. Dodaj „{0}” do swojego projektu.
pt_br: O recurso ''interceptores'' não está habilitado nesse namespace. Adicione ''{0}'' ao seu projeto.
ru: Функция "interceptors" не включена в этом пространстве имен. Добавьте "{0}" в свой проект.
zh_hans: 此命名空间未启用“拦截器”功能。将 ‘{0}’ 添加到项目。

# ERR_InterceptsLocationDataInvalidFormat
source: The data argument to InterceptsLocationAttribute is not in the correct format.
fr: Le format de l’argument de données de InterceptsLocationAttribute n’est pas correct.
it: Il formato dell'argomento dati di InterceptsLocationAttribute non è corretto.
pl: Argument danych atrybutu InterceptsLocationAttribute ma niepoprawny format.
pt_br: O argumento de dados para InterceptsLocationAttribute não está no formato correto.
ru: Аргумент данных InterceptsLocationAttribute имеет неправильный формат.
zh_hans: InterceptsLocationAttribute 的数据参数的格式不正确。
zh_hant: InterceptsLocationAttribute 的資料引數格式不正確。

# ERR_InterceptsLocationDataInvalidPosition
source: The data argument to InterceptsLocationAttribute refers to an invalid position in file '{0}'.
fr: L’argument de données de InterceptsLocationAttribute fait référence à une position non valide dans le fichier « {0} ».
it: L'argomento dati di InterceptsLocationAttribute fa riferimento a una posizione non valida nel file '{0}'.
pl: Argument danych atrybutu InterceptsLocationAttribute odwołuje się do nieprawidłowej pozycji w pliku „{0}”.
pt_br: O argumento de dados para InterceptsLocationAttribute refere-se a uma posição inválida no arquivo "{0}".
ru: Аргумент данных InterceptsLocationAttribute ссылается на недопустимую позицию в файле "{0}".
zh_hans: InterceptsLocationAttribute 的数据参数引用文件 "{0}" 中的无效位置。
zh_hant: InterceptsLocationAttribute 的資料引數在檔案 '{0}' 中的位置無效。

# ERR_InterceptsLocationDuplicateFile
source: Cannot intercept a call in file '{0}' because it is duplicated elsewhere in the compilation.
fr: Nous ne pouvons pas intercepter un appel dans le fichier « {0} », car il est dupliqué ailleurs dans la compilation.
it: Non è possibile intercettare una chiamata nel file '{0}' perché è duplicata in un'altra posizione della compilazione.
pl: Nie można przechwycić wywołania w pliku „{0}”, ponieważ jest ono zduplikowane w innym miejscu w kompilacji.
pt_br: Não é possível interceptar uma chamada no arquivo "{0}" porque ela está duplicada em outro lugar na compilação.
ru: Не удается перехватить вызов в файле "{0}", так как он дублируется в другом месте компиляции.
zh_hans: 无法截获文件 "{0}" 中的调用，因为它在编译的其他位置重复。
zh_hant: 無法攔截檔案 '{0}' 中的呼叫，因為編譯時在他處複製了該呼叫。

# ERR_InterceptsLocationFileNotFound
source: Cannot intercept a call in file '{0}' because a matching file was not found in the compilation.
fr: Désolé... Nous ne pouvons pas intercepter un appel dans le fichier « {0} », car aucun fichier correspondant n’a été trouvé dans la compilation.
it: Non è possibile intercettare una chiamata nel file '{0}' perché nella compilazione non è stato trovato un file corrispondente.
pl: Nie można przechwycić wywołania w pliku „{0}”, ponieważ w kompilacji nie znaleziono zgodnego pliku.
pt_br: Não é possível interceptar uma chamada no arquivo "{0}" porque um arquivo correspondente não foi encontrado na compilação.
ru: Не удается перехватить вызов в файле "{0}", поскольку соответствующий файл не найден в компиляции.
zh_hans: 无法截获文件 "{0}" 中的调用，因为在编译中找不到匹配的文件。
zh_hant: 無法攔截檔案 '{0}' 中的呼叫，因為編譯時找不到相符的檔案。

# ERR_InterceptsLocationUnsupportedVersion
source: Version '{0}' of the interceptors format is not supported. The latest supported version is '1'.
fr: La version « {0} » du format des intercepteurs n’est pas prise en charge. La dernière version prise en charge est « 1 ».
it: La versione '{0}' del formato degli intercettori non è supportata. L'ultima versione supportata è '1'.
pl: Wersja „{0}” formatu interceptorów nie jest obsługiwana. Najnowsza obsługiwana wersja to „1”.
pt_br: Não há suporte para a versão "{0}" do formato de interceptores. A versão mais recente com suporte é "1".
ru: Версия "{0}" формата перехватчиков не поддерживается. Последняя поддерживаемая версия: "1".
zh_hans: 不支持拦截器格式的版本 "{0}"。支持的最新版本为 "1"。
zh_hant: 不支援 '{0}' 版的攔截器。支援的最新版本為 ‘1’。

# ERR_InterfaceImplementedByUnmanagedCallersOnlyMethod
source: 'UnmanagedCallersOnly' method '{0}' cannot implement interface member '{1}' in type '{2}'
cs: Metoda UnmanagedCallersOnly {0} nemůže implementovat člena rozhraní {1} v typu {2}.
fr: La méthode UnmanagedCallersOnly '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}'
it: Il metodo '{0}' di 'UnmanagedCallersOnly' non può implementare il membro di interfaccia '{1}' nel tipo '{2}'
ja: 'UnmanagedCallersOnly' メソッド '{0}' は、インターフェイス メンバー '{1}' を型 '{2}' で実装できません
pl: Metoda "UnmanagedCallersOnly" "{0}" nie może implementować składowej interfejsu "{1}" w typie "{2}"
pt_br: O método 'UnmanagedCallersOnly' '{0}' não pode implementar o membro de interface '{1}' no tipo '{2}'
ru: Метод UnmanagedCallersOnly "{0}" не может реализовать элемент интерфейса "{1}" в типе "{2}"
zh_hans: “UnmanagedCallersOnly”方法“{0}”无法实现类型“{2}”中的接口成员“{1}”
zh_hant: 'UnmanagedCallersOnly' 方法 '{0}' 無法在類型 '{2}' 中實作介面成員 '{1}'

# ERR_InterfaceImplementedImplicitlyByVariadic
source: '{0}' cannot implement interface member '{1}' in type '{2}' because it has an __arglist parameter
cs: {0} nemůže implementovat člen rozhraní {1} v typu {2}, protože má parametr __arglist.
de: "{0}" kann den Schnittstellenmember "{1}" in Typ "{2}" nicht implementieren, weil er einen __arglist-Parameter umfasst.
es: “{0}” no puede implementar el miembro de interfaz “{1}” en el tipo “{2}” porque tiene un parámetro __arglist
fr: '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}', car il a un paramètre __arglist
it: '{0}' non può implementare il membro di interfaccia '{1}' nel tipo '{2}' perché contiene un parametro __arglist
ja: '{0}' は、__arglist パラメーターが指定されているため、型 '{2}' のインターフェイス メンバー '{1}' を実装できません
ko: '{0}'은(는) __arglist 매개 변수가 있으므로 '{2}' 형식의 인터페이스 멤버 '{1}'을(를) 구현할 수 없습니다.
pl: Obiekt „{0}” nie może implementować elementu członkowskiego interfejsu „{1}” w ramach typu „{2}”, ponieważ zawiera on parametr __arglist
pt_br: '{0}' não pode implementar o membro de interface '{1}' no tipo '{2}' porque tem um parâmetro __arglist
ru: "{0}" не может реализовать член интерфейса "{1}" в типе "{2}" из-за наличия параметра __arglist
tr: '{0}' bir __arglist parametresine sahip olduğundan '{2}' türünde '{1}' arabirim üyesini uygulayamıyor.
zh_hans: “{0}”无法在类型“{2}”中实现接口成员“{1}”，因为它具有 __arglist 参数
zh_hant: 因為介面成員 '{1}' 包含 __arglist 參數，所以 '{0}' 無法在類型 '{2}' 中實作此介面成員

# ERR_InternalError
source: Internal error in the C# compiler.
cs: Vnitřní chyba v kompilátoru jazyka C#
de: Interner Fehler im C#-Compiler.
es: Error interno en el compilador de C#.
fr: Erreur interne dans le compilateur C#.
it: Si è verificato un errore interno nel compilatore C#.
ja: C# コンパイラで内部エラーが発生しました。
ko: C# 컴파일러의 내부 오류입니다.
pl: Błąd wewnętrzny w kompilatorze języka C#.
pt_br: Erro interno no compilador C#.
ru: Внутренняя ошибка в компиляторе C#.
tr: C# derleyicisinde iç hata oluştu.
zh_hans: C# 编译器中出现内部错误。
zh_hant: C# 編譯器中的內部錯誤。

# ERR_InterpolatedStringHandlerArgumentAttributeMalformed
source: The InterpolatedStringHandlerArgumentAttribute applied to parameter '{0}' is malformed and cannot be interpreted. Construct an instance of '{1}' manually.
cs: Atribut InterpolatedStringHandlerArgumentAttribute použitý u parametru {0} je poškozený a nedá se interpretovat. Vytvořte instanci {1} ručně.
fr: Le InterpolatedStringHandlerArgumentAttribute appliqué au paramètre « {0} » est incorrect et ne peut pas être interprété. Construisez une instance de « {1} » manuellement.
it: Il formato di InterpolatedStringHandlerArgumentAttribute applicato al parametro '{0}' non è valido e non può essere interpretato. Costruire manualmente un'istanza di '{1}'.
ja: パラメーター '{0}' に適用された InterpolatedStringHandlerArgumentAttribute の形式が正しくないため、解釈できません。'{1}' のインスタンスを手動で構築してください。
pl: Atrybut InterpolatedStringHandlerArgumentAttribute zastosowany do parametru "{0}" jest źle sformułowany i nie można go zinterpretować. Utwórz ręcznie wystąpienie "{1}".
pt_br: O InterpolatedStringHandlerArgumentAttribute aplicado ao parâmetro '{0}' está malformado e não pode ser interpretado. Construa uma instância de '{1}' manualmente.
ru: Неверный формат типа InterpolatedStringHandlerArgumentAttribute, примененного к параметру "{0}", интерпретация невозможна. Создайте экземпляр "{1}" вручную.
zh_hans: 应用于参数“{0}”的 InterpolatedStringHandlerArgumentAttribute 格式不正确，无法解释。请手动构建“{1}”的实例。
zh_hant: 套用到參數 '{0}' 的 InterpolatedStringHandlerArgumentAttribute 格式不正確，無法轉譯。手動建構 '{1}' 的執行個體。

# ERR_InterpolatedStringHandlerArgumentDisallowed
source: Interpolated string handler arguments are not allowed in this context.
pt_br: Argumentos de manipulador de cadeia de caracteres interpolados não são permitidos neste contexto.

# ERR_InterpolatedStringHandlerArgumentLocatedAfterInterpolatedString
source: Parameter '{0}' is an argument to the interpolated string handler conversion on parameter '{1}', but the corresponding argument is specified after the interpolated string expression. Reorder the arguments to move '{0}' before '{1}'.
cs: Parametr {0} je argumentem pro převod obslužné rutiny interpolovaného řetězce v parametru {1}, ale odpovídající argument je zadaný za výrazem interpolovaného řetězce události. Přeuspořádejte argumenty, pro přesunutí {0} před {1}.
fr: Le paramètre « {0} » est un argument de la conversion du gestionnaire de chaîne interpolé sur le paramètre « {1} », mais l’argument correspondant est spécifié après l’expression de chaîne interpolée. Réorganisez les arguments pour déplacer « {0} » avant « {1} ».
it: Il parametro '{0}' è un argomento per la conversione del gestore di stringhe interpolato nel parametro '{1}', ma l'argomento corrispondente viene specificato dopo l'espressione di stringa interpolata. Riordinare gli argomenti per spostare '{0}' prima di '{1}'.
ja: パラメーター '{0}' は、パラメーター '{1}' で補間された文字列ハンドラーの変換への引数ですが、対応する引数は、補間された文字列式の後に指定されています。引数を並べ替えて、'{0}' を '{1}' の前に移動します。
pl: Parametr „{0}” jest argumentem konwersji interpolowanej procedury obsługi ciągów dla parametru „{1}”, ale odpowiedni argument jest określony po wyrażeniu ciągu interpolowanego. Zmień kolejność argumentów, aby przenieść „{0}” przed „{1}”.
pt_br: O parâmetro '{0}' é um argumento para a conversão do manipulador de cadeia de caracteres interpolado no parâmetro '{1}', mas o argumento correspondente é especificado após a expressão de cadeia de caracteres interpolada. Reordene os argumentos para mover '{0}' antes de '{1}'.
ru: Параметр "{0}" является аргументом для преобразования обработчика интерполированной строки в параметре "{1}", но соответствующий аргумент указан после выражения интерполированной строки. Измените порядок аргументов, поместив "{0}" перед "{1}".
zh_hans: 参数“{0}”是参数“{1}”上的内插字符串处理程序转换的参数，但在内插字符串表达式后面指定了相应的参数。请重新排序参数以将“{0}”移到“{1}”之前。
zh_hant: 參數 '{0}' 是參數 '{1}' 上插補字串處理常式轉換的引數，但對應的引數是在插補字串運算式之後指定。重新排序引數，將 '{0}' 移動到 '{1}' 之前。
