Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_PartialMemberReadOnlyDifference
source: Both partial member declarations must be readonly or neither may be readonly
fr: Soit les deux déclarations de membres partiels sont readonly, soit aucune ne l'est
it: Entrambe le dichiarazioni di membro parziale devono essere di tipo readonly, altrimenti nessuna delle due potrà esserlo
pl: Obie deklaracje częściowych elementów członkowskich muszą być tylko do odczytu lub żadna z nich nie może być tylko do odczytu
pt_br: As duas declarações de membros parciais precisam ser readonly ou nenhuma pode ser readonly
ru: Оба объявления частичного члена должны быть доступными только для чтения или оба не должны быть доступными только для чтения
zh_hans: 这两个分部成员声明必须都是或者都不是只读声明
zh_hant: 兩個部份成員宣告都必須是唯讀，或者都不是唯讀

# ERR_PartialMemberExtendedModDifference
source: Both partial member declarations must have identical combinations of 'virtual', 'override', 'sealed', and 'new' modifiers.
fr: Les deux déclarations de membres partiels doivent présenter des combinaisons identiques de modificateurs « virtual », « override », « sealed » et « new ».
it: Entrambe le dichiarazioni di membro parziale devono contenere combinazioni identiche di modificatori 'virtual', 'override', 'sealed' e 'new'.
pl: Obie deklaracje częściowych elementów członkowskich muszą mieć identyczne kombinacje modyfikatorów „virtual”, „override”, „sealed” i „new”.
pt_br: As duas declarações de membros parciais precisam ter combinações idênticas dos modificadores "virtual", "override", "sealed" e "new".
ru: У обоих объявлений частичного члена должны быть одинаковые сочетания модификаторов "'virtual", "override", "sealed" и "new".
zh_hans: 这两个分部成员声明必须具有 "virtual"、"override"、"sealed" 和 "new" 修饰符的相同组合。
zh_hant: 兩個部分成員宣告都必須具有完全相同的 'virtual'、'override'、'sealed' 及 'new' 修飾元組合。

# ERR_PartialMemberRefReturnDifference
source: Partial member declarations must have matching ref return values.
fr: Les déclarations de membres partiels doivent avoir des valeurs de retour ref correspondantes.
it: Le dichiarazioni di membro parziale devono contenere valori restituiti di riferimento corrispondenti.
pl: Deklaracje częściowych elementów członkowskich muszą mieć pasujące wartości zwracane ref.
pt_br: As declarações de membros parciais precisam ter valores de retorno de referência correspondentes.
ru: У объявлений частичного члена должны совпадать возвращаемые значения "ref".
zh_hans: 分部成员声明必须具有匹配的引用返回值。
zh_hant: 部分成員宣告必須有相符的參考傳回值。

# ERR_PartialMemberTypeDifference
source: Both partial member declarations must have the same type.
pt_br: Ambas as declarações de membro parcial devem ter o mesmo tipo.

# ERR_PartialMemberUnsafeDifference
source: Both partial member declarations must be unsafe or neither may be unsafe
fr: Les deux déclarations partielles de membres doivent être peu sûres ou aucune ne peut l'être.
it: Entrambe le dichiarazioni di membro parziale devono essere di tipo unsafe, altrimenti nessuna delle due potrà esserlo
pl: Obie częściowe deklaracje elementów członkowskich muszą być niebezpieczne lub żadna z nich nie może być niebezpieczna
pt_br: As duas declarações de membros parciais precisam ser inseguras ou nenhuma pode ser insegura
ru: Оба объявления частичного члена должны быть небезопасными или оба не должны быть небезопасными
zh_hans: 这两个分部成员声明必须都是或者都不是不安全声明
zh_hant: 兩個部分成員宣告皆必須為非受控，或者皆不為非受控

# ERR_PartialMethodReturnTypeDifference
source: Both partial method declarations must have the same return type.
cs: Obě deklarace částečných metod musí mít stejný návratový typ.
fr: Les deux déclarations de méthodes partielles doivent avoir le même type de retour.
it: Il tipo restituito deve essere identico in entrambe le dichiarazioni di metodo parziale.
ja: 部分メソッドの両方の宣言には、同じ戻り値の型を指定しなければなりません。
pl: Obie częściowe deklaracje metod muszą mieć taki sam zwracany typ.
pt_br: As duas declarações de método parcial precisam ter o mesmo tipo de retorno.
ru: Оба объявления разделяемого метода должны иметь одинаковый тип возвращаемого значения.
zh_hans: 两个分部方法声明必须具有相同的返回类型。
zh_hant: 兩個部分方法宣告都必須有相同的傳回型別。

# ERR_PartialMethodWithAccessibilityModsMustHaveImplementation
source: Partial method '{0}' must have an implementation part because it has accessibility modifiers.
cs: Částečná metoda {0} musí mít implementační část, protože má modifikátory přístupnosti.
fr: La méthode partielle '{0}' doit avoir une partie implémentation, car elle a des modificateurs d'accessibilité.
it: Il metodo parziale '{0}' deve contenere una parte di implementazione perché include modificatori di accessibilità.
ja: 部分メソッド '{0}' にはアクセシビリティ修飾子が指定されているため、実装部分が必要です。
pl: Metoda częściowa „{0}” musi mieć część implementacji, ponieważ ma modyfikatory dostępności.
pt_br: O método parcial '{0}' precisa ter uma parte de implementação porque ele tem modificadores de acessibilidade.
ru: Разделяемый метод "{0}" должен содержать часть реализации, так как он имеет модификаторы доступа.
zh_hans: 分部方法“{0}”必须具有实现部分，因为它具有可访问性修饰符。
zh_hant: 因為部分方法 '{0}' 有存取範圍修飾詞，所以其必須有實作部分。

# ERR_PartialMethodWithExtendedModMustHaveAccessMods
source: Partial method '{0}' must have accessibility modifiers because it has a 'virtual', 'override', 'sealed', 'new', or 'extern' modifier.
cs: Částečná metoda {0} musí mít modifikátory přístupnosti, protože má modifikátor virtual, override, sealed, new nebo extern.
fr: La méthode partielle '{0}' doit avoir des modificateurs d'accessibilité, car elle a un modificateur 'virtual', 'override', 'sealed', 'new' ou 'extern'.
it: Il metodo parziale '{0}' deve contenere modificatori di accessibilità perché include un modificatore 'virtual', 'override', 'sealed', 'new' o 'extern'.
ja: 部分メソッド '{0}' には、'virtual'、'override'、'sealed'、'new'、または 'extern' 修飾子が指定されているため、アクセシビリティ修飾子が必要です。
pl: Metoda częściowa „{0}” musi mieć modyfikatory dostępności, ponieważ ma modyfikator „virtual”, „override”, „sealed”, „new” lub „extern”.
pt_br: O método parcial '{0}' precisa ter modificadores de acessibilidade porque ele tem um modificador 'virtual', 'override', 'sealed', 'new' ou 'extern'.
ru: Разделяемый метод "{0}" должен иметь модификаторы доступа, так как он содержит модификатор "virtual", "override", "sealed", "new" или "extern".
zh_hans: 分部方法“{0}”必须具有可访问性修饰符，因为它具有 "virtual"、"override"、"sealed"、"new" 或 "extern" 修饰符。
zh_hant: 因為部分方法 '{0}' 有 'virtual'、'override'、'sealed'、'new' 或 'extern' 修飾元，所以其必須有存取範圍修飾詞。

# ERR_PartialMethodWithNonVoidReturnMustHaveAccessMods
source: Partial method '{0}' must have accessibility modifiers because it has a non-void return type.
cs: Částečná metoda {0} musí mít modifikátory přístupnosti, protože má návratový typ jiný než void.
fr: La méthode partielle '{0}' doit avoir des modificateurs d'accessibilité, car elle a un type de retour non nul (void).
it: Il metodo parziale '{0}' deve contenere modificatori di accessibilità perché include un tipo restituito non void.
ja: 部分メソッド '{0}' には、void 以外の戻り値の型が指定されているため、アクセシビリティ修飾子が必要です。
pl: Metoda częściowa „{0}” musi mieć modyfikatory dostępności, ponieważ ma typ zwracany inny niż void.
pt_br: O método parcial '{0}' precisa ter modificadores de acessibilidade porque ele tem um tipo de retorno não nulo.
ru: Разделяемый метод "{0}" должен иметь модификаторы доступа, так как он возвращает значение, отличное от void.
zh_hans: 分部方法“{0}”必须具有可访问性修饰符，因为它具有非 void 返回类型。
zh_hant: 因為部分方法 '{0}' 有非 void 的傳回型別，所以其必須有存取範圍修飾詞。

# ERR_PartialMethodWithOutParamMustHaveAccessMods
source: Partial method '{0}' must have accessibility modifiers because it has 'out' parameters.
cs: Částečná metoda {0} musí mít modifikátory přístupnosti, protože má parametry out.
fr: La méthode partielle '{0}' doit avoir des modificateurs d'accessibilité, car elle a des paramètres 'out'.
it: Il metodo parziale '{0}' deve contenere modificatori di accessibilità perché include parametri 'out'.
ja: 部分メソッド '{0}' には、'out' パラメーターが指定されているため、アクセシビリティ修飾子が必要です。
pl: Metoda częściowa „{0}” musi mieć modyfikatory dostępności, ponieważ ma parametry „out”.
pt_br: O método parcial '{0}' precisa ter modificadores de acessibilidade porque ele tem parâmetros 'out'.
ru: Разделяемый метод "{0}" должен иметь модификаторы доступа, так как он содержит параметры "out".
zh_hans: 分部方法“{0}”必须具有可访问性修饰符，因为它具有 "out" 参数。
zh_hant: 因為部分方法 '{0}' 有 'out' 參數，所以其必須有存取範圍修飾詞。

# ERR_PartialPropertyDuplicateDefinition
source: A partial property may not have multiple defining declarations, and cannot be an auto-property.
fr: Une propriété partielle ne peut pas avoir plusieurs déclarations de définition et ne peut pas être une propriété automatique.
it: Una proprietà parziale non può avere più dichiarazioni di definizione e non può essere una proprietà automatica.
pl: Właściwość częściowa nie może mieć wielu deklaracji definiujących i nie może być właściwością automatyczną.
pt_br: Uma propriedade parcial pode não ter várias declarações de definição e não pode ser uma propriedade automática.
ru: У частичного свойства не может быть нескольких определяющих определений, оно не может быть автоматическим свойством.
zh_hans: 分部属性不能有多个定义声明，并且不能是自动属性。
zh_hant: 部分屬性不可具有多個定義宣告，而且不能是自動屬性。

# ERR_PartialPropertyDuplicateImplementation
source: A partial property may not have multiple implementing declarations
fr: Une propriété partielle ne peut pas avoir plusieurs déclarations d'implémentation
it: Una proprietà parziale non può avere più dichiarazioni di implementazione
pl: Właściwość częściowa nie może mieć wielu deklaracji implementujących
pt_br: Uma propriedade parcial não pode ter várias declarações de implementação
ru: У частичного свойства не может быть нескольких реализующих объявлений
zh_hans: 分部属性不能有多个实现声明
zh_hant: 部分屬性不可具有多個實作的宣告

# ERR_PartialPropertyDuplicateInitializer
source: A partial property cannot have an initializer on both the definition and implementation.
fr: Une propriété partielle ne peut pas avoir d'initialiseur à la fois sur la définition et sur l'implémentation.
it: Una proprietà parziale non può avere un inizializzatore sia nella definizione che nell'implementazione.
pt_br: Uma propriedade parcial não pode ter um inicializador na definição e implementação.
ru: Частичное свойство не может содержать инициализатор одновременно в определении и реализации.
zh_hans: 一个部分属性不能同时具有定义和实现的初始值设定项。

# ERR_PartialPropertyInitMismatch
source: Property accessor '{0}' must be '{1}' to match the definition part
fr: L’accesseur de propriété « {0} » doit être « {1} » pour correspondre à la partie définition
it: La funzione di accesso alle proprietà '{0}' deve essere '{1}' in modo che corrisponda alla parte della definizione
pl: Metoda dostępu właściwości „{0}” musi mieć wartość „{1}”, aby dopasować część definicji
pt_br: O acessador de propriedade "{0}" deve ser "{1}" para corresponder à parte da definição
ru: Метод доступа "{0}" должен быть "{1}", чтобы соответствовать части определения
zh_hans: 属性访问器“{0}”必须为“{1}”才能匹配定义部分
zh_hant: 屬性存取子 '{0}' 必須是 '{1}' 以符合定義部分

# ERR_PartialPropertyMissingAccessor
source: Property accessor '{0}' must be implemented because it is declared on the definition part
fr: L’accesseur de propriété « {0} » doit être implémenté, car il est déclaré sur la partie définition
it: La funzione di accesso alle proprietà '{0}' deve essere implementata perché è dichiarata nella parte della definizione
pl: Właściwość accessor „{0}” musi zostać zaimplementowana, ponieważ jest zadeklarowana w części definicji
pt_br: O acessador de propriedade "{0}" precisa ser implementado porque está declarado na parte de definição
ru: Метод доступа "{0}" должен быть реализован, поскольку он объявлен в части определения
zh_hans: 必须实现属性访问器“{0}”，因为它是在定义部分上声明的
zh_hant: 屬性存取子 '{0}' 必須實作，因為它是在定義部分上宣告

# ERR_PartialPropertyMissingDefinition
source: Partial property '{0}' must have a definition part.
fr: La propriété partielle « {0} » doit avoir une partie définition.
it: La proprietà parziale '{0}' deve avere una parte della definizione.
pl: Właściwość częściowa „{0}” musi mieć część definicji.
pt_br: A propriedade parcial "{0}" precisa ter uma parte de definição.
ru: У частичного свойства "{0}" должна быть часть определения.
zh_hans: 分部属性“{0}”必须具有定义部分。
zh_hant: 部分屬性 '{0}' 必須有定義部分。

# ERR_PartialPropertyMissingImplementation
source: Partial property '{0}' must have an implementation part.
fr: La propriété partielle « {0} » doit avoir une partie d’implémentation.
it: La proprietà parziale '{0}' deve avere una parte di implementazione.
pl: Właściwość częściowa „{0}” musi mieć część implementacji.
pt_br: A propriedade parcial "{0}" precisa ter uma parte de implementação.
ru: У частичного свойства "{0}" должна быть часть реализации.
zh_hans: 分布属性“{0}”必须具有实现部分。
zh_hant: 部分屬性 '{0}' 必須有實作部分。

# ERR_PartialPropertyRequiredDifference
source: Both partial property declarations must be required or neither may be required
fr: Les deux déclarations de propriété partielle doivent être obligatoires ou aucune ne peut être requise
it: Entrambe le dichiarazioni di proprietà parziale devono essere richieste, altrimenti nessuna delle due potrà esserlo
pl: Obie deklaracje właściwości częściowych muszą być wymagane lub żadna z nich nie może być wymagana
pt_br: As duas declarações de propriedades parciais precisam ser obrigatórias ou nenhuma delas pode ser obrigatória
ru: Оба объявления частичного члена должны быть обязательными или оба не должны быть обязательными
zh_hans: 这两个分部属性声明必须都是或者都不是必需声明
zh_hant: 兩個部分屬性宣告都必須是必要項，或者都不是必要項

# ERR_PartialPropertyUnexpectedAccessor
source: Property accessor '{0}' does not implement any accessor declared on the definition part
fr: L’accesseur de propriété « {0} » n’implémente aucun accesseur déclaré sur la partie définition
it: La funzione di accesso alle proprietà '{0}' non implementa alcuna funzione di accesso dichiarata nella parte della definizione
pl: Właściwość accessor „{0}” nie implementuje żadnego accessora zadeklarowanego w części definiującej
pt_br: O acessador de propriedade "{0}" não implementa nenhum acessador declarado na parte de definição
ru: Метод доступа "{0}" не реализует методы доступа, объявленные для части определения
zh_hans: 属性访问器“{0}”未实现在定义部分上声明的任何访问器
zh_hant: 屬性存取子 '{0}' 未實作定義部分上宣告的任何存取子

# ERR_PatternSpanCharCannotBeStringNull
source: A string 'null' constant is not supported as a pattern for '{0}'. Use an empty string instead.
cs: Konstanta řetězce null není podporována jako vzor pro {0}. Místo toho použijte prázdný řetězec.
fr: Une constante « null » de chaîne n’est pas prise en charge en tant que modèle pour «{0}». Utilisez plutôt une chaîne vide.
it: Una costante di tipo stringa 'null' non è supportata come criterio per ?{0}'. Usare invece una stringa vuota.
ja: 文字列 'null' 定数は、'{0}' のパターンとしてサポートされていません。代わりに空の文字列を使用してください。
pl: Stała ciągu „null” nie jest obsługiwana jako wzorzec dla „{0}”. Zamiast tego użyj pustego ciągu.
pt_br: Uma constante cadeia de caracteres 'null' não é suportada como padrão para '{0}'. Use uma cadeia de caracteres vazia em seu lugar.
ru: Строковая константа "null" не поддерживается в качестве шаблона для "{0}". Используйте вместо этого пустую строку.
zh_hans: 不支持将字符串 'null' 常量作为 '{0}' 的模式。请改用空字符串。
zh_hant: 不支援字串 'null' 常數做為 '{0}' 的模式。請改為使用空字串。

# ERR_PointerTypeInPatternMatching
source: Pattern-matching is not permitted for pointer types.
cs: Porovnávání vzorů není povolené pro typy ukazatelů.
de: Der Musterabgleich ist für Zeigertypen unzulässig.
es: No se permite la coincidencia de patrones para tipos de puntero.
fr: Les critères spéciaux ne sont pas autorisés pour les types de pointeur.
it: I criteri di ricerca non sono consentiti per i tipi di puntatore.
ja: ポインター型でパターン マッチングを使用することはできません。
ko: 포인터 형식에 대해 패턴 일치가 허용되지 않습니다.
pl: Dopasowanie wzorca jest niedozwolone dla typów wskaźnika.
pt_br: A correspondência de padrões não é permitida para tipos de ponteiro.
ru: Сопоставление шаблонов запрещено для типов указателей.
tr: İşaretçi türleri için desen eşleştirmeye izin verilmez.
zh_hans: 指针类型不允许进行模式匹配。
zh_hant: 指標類型不允許進行模式比對。

# ERR_PossibleAsyncIteratorWithoutYield
source: The body of an async-iterator method must contain a 'yield' statement.
cs: Tělo metody async-iterator musí obsahovat příkaz yield.
de: Der Text einer async-iterator-Methode muss eine yield-Anweisung enthalten.
es: El cuerpo de un método async-iterator debe contener una instrucción "yield".
fr: Le corps d'une méthode async-iterator doit contenir une instruction 'yield'.
it: Il corpo di un metodo di iteratore asincrono deve contenere un'istruzione 'yield'.
ja: 非同期反復子メソッドの本体には 'yield' ステートメントを含める必要があります。
ko: 비동기 반복기 메서드의 본문에는 'yield' 문이 포함되어야 합니다.
pl: Treść metody iteratora asynchronicznego musi zawierać instrukcję „yield”.
pt_br: O corpo de um método iterador assíncrono precisa conter uma instrução 'yield'.
ru: Текст метода асинхронного итератора должен содержать оператор "yield".
tr: Bir async-iterator metodunun gövdesi 'yield' deyimi içermelidir.
zh_hans: async-iterator 方法的主体必须包含 "yield" 语句。
zh_hant: async-iterator 方法的主體必須包含 'yield' 陳述式。

# ERR_PossibleAsyncIteratorWithoutYieldOrAwait
source: The body of an async-iterator method must contain a 'yield' statement. Consider removing 'async' from the method declaration or adding a 'yield' statement.
cs: Tělo metody async-iterator musí obsahovat příkaz yield. Zvažte odebrání položky async z deklarace metody nebo přidání příkazu yield.
de: Der Text einer async-iterator-Methode muss eine yield-Anweisung enthalten. Erwägen Sie das Entfernen von "async" aus der Methodendeklaration oder das Hinzufügen einer yield-Anweisung.
es: El cuerpo de un método async-iterator debe contener una instrucción "yield". Considere quitar "async" de la declaración del método o agregar una instrucción "yield".
fr: Le corps d'une méthode async-iterator doit contenir une instruction 'yield'. Supprimez 'async' de la déclaration de méthode, ou ajoutez une instruction 'yield'.
it: Il corpo di un metodo di iteratore asincrono deve contenere un'istruzione 'yield'. Provare a rimuovere 'async' dalla dichiarazione del metodo o ad aggiungere un'istruzione 'yield'.
ja: 非同期反復子メソッドの本体には 'yield' ステートメントを含める必要があります。メソッド宣言から 'async' を削除するか、'yield' ステートメントを追加することをご検討ください。
ko: 비동기 반복기 메서드의 본문에는 'yield' 문이 포함되어야 합니다. 메서드 선언에서 'async'를 제거하거나 'yield' 문을 추가하세요.
pl: Treść metody iteratora asynchronicznego musi zawierać instrukcję „yield”. Rozważ usunięcie modyfikatora „async” z deklaracji metody lub dodanie instrukcji „yield”.
pt_br: O corpo de um método de iterador assíncrono precisa conter uma instrução 'yield'. Considere a possibilidade de remover 'async' da declaração de método ou de adicionar a instrução 'yield'.
ru: Текст метода асинхронного итератора должен содержать оператор "yield". Попробуйте удалить "async" из объявления метода или добавить оператор "yield".
tr: Bir async-iterator metodunun gövdesi 'yield' deyimi içermelidir. Metot bildiriminden 'async' ifadesini çıkarmayı veya bir 'yield' deyimi eklemeyi deneyin.
zh_hans: async-iterator 方法的主体必须包含 "yield" 语句。请考虑从方法声明中删除 "async" 或添加 "yield" 语句。
zh_hant: async-iterator 方法的主體必須包含 'yield' 陳述式。建議將 'async' 從方法宣告移除，或新增 'yield' 陳述式。

# ERR_PropertyPatternNameMissing
source: A property subpattern requires a reference to the property or field to be matched, e.g. '{{ Name: {0} }}'
cs: Dílčí vzor vlastnosti vyžaduje odkaz na vlastnost nebo pole k přiřazení, např. „{{ Name: {0} }}“.
de: Ein Eigenschaftsteilmuster erfordert einen Verweis auf die abzugleichende Eigenschaft oder das abzugleichende Feld. Beispiel: "{{ Name: {0} }}"
es: El subpatrón de una propiedad requiere una referencia a la propiedad o al campo que debe coincidir; por ejemplo, "{{ Name: {0} }}"
fr: Un sous-modèle de propriété nécessite une correspondance de la référence à la propriété ou au champ. Exemple : '{{ Name: {0} }}'
it: Con un criterio secondario di proprietà è richiesto un riferimento alla proprietà o al campo da abbinare, ad esempio '{{ Name: {0} }}'
ja: プロパティ サブパターンには、一致させるプロパティまたはフィールドへの参照が必要です。例: '{{ Name: {0} }}'
ko: 속성 하위 패턴은 일치시킬 속성 또는 필드에 대한 참조가 필요합니다(예: '{{ Name: {0} }}')
pl: Wzorzec podrzędny właściwości wymaga odwołania do właściwości lub pola, które należy dopasować, na przykład „{{ Name: {0} }}”
pt_br: Um subpadrão de propriedade requer que uma referência à propriedade ou ao campo seja correspondida, por exemplo, '{{ Name: {0} }}'
ru: Для вложенного шаблона свойств требуется ссылка на свойство или поле для сопоставления, например, "{{ Name: {0} }}".
tr: Bir özellik alt deseni, özellik veya alan başvurusunun eşleşmesini gerektiriyor, ör. '{{ Name: {0} }}'
zh_hans: 属性子模式需要引用要匹配的属性或字段，例如，"{{ Name: {0} }}"
zh_hant: 屬性子模式需要對屬性或欄位的參考才能比對，例如 '{{ Name: {0} }}'

# ERR_ProtectedInExtension
source: '{0}': new protected member declared in an extension block
pt_br: "{0}": novo membro protegido declarado em um bloco de extensão

# ERR_RawStringDelimiterOnOwnLine
source: Raw string literal delimiter must be on its own line.
cs: Oddělovač literálu nezpracovaného řetězce musí být na vlastním řádku.
fr: Le délimiteur de littéral de chaîne brute doit se trouver sur sa propre ligne.
it: Il delimitatore di valore letterale stringa non elaborato deve essere nella relativa riga.
ja: 生文字列リテラルの区切り記号は、独自の行に置かれる必要があります。
pl: Ogranicznik literału ciągu nieprzetworzonego musi znajdować się w osobnym wierszu.
pt_br: O delimitador da cadeia de caracteres bruta deve estar em sua própria linha.
ru: Разделитель литерала необработанной строки должен находиться в отдельной строке.
zh_hans: 原始字符串字面量分隔符必须位于其自己的行上。
zh_hant: 原始字串常值分隔符號必須位於自己的行。

# ERR_RawStringInVerbatimInterpolatedStrings
source: Multi-line raw string literals are only allowed in verbatim interpolated strings.
cs: Víceřádkové literály nezpracovaných řetězců se povolují pouze v doslovných interpolovaných řetězcích.
fr: Les littéraux de chaîne brute multiligne sont uniquement autorisés dans les chaînes interpolées textuellement.
it: I valori letterali della stringa non elaborata su più righe sono consentiti solo in stringhe verbatim interpolate.
ja: 複数行の生文字列リテラルは、逐語的に補間された文字列でのみ使用できます。
pl: Wielowierszowe literały nieprzetworzonych ciągów są dozwolone tylko w interpolowanych ciągach dosłownych.
pt_br: Literais de cadeia de caracteres bruta de várias linhas só são permitidas em cadeias de caracteres verbatim interpoladas.
ru: Многострочные литералы необработанных строк разрешены только в интерполированных буквальных строках.
zh_hans: 只允许在逐字内插字符串中使用多行原始字符串字面量。
zh_hant: 多行原始字串常值只允許在逐字差補字串中。

# ERR_RawStringMustContainContent
source: Multi-line raw string literals must contain at least one line of content.
cs: Víceřádkové literály nezpracovaných řetězců musí obsahovat alespoň jeden řádek obsahu.
fr: Les littéraux de chaîne brute multiligne doivent contenir au moins une ligne de contenu.
it: I valori letterali stringa non elaborati su più righe devono contenere almeno una riga di contenuto.
ja: 複数行の生文字列リテラルには、少なくとも 1 行のコンテンツが含まれている必要があります。
pl: Wielowierszowe literały nieprzetworzonych ciągów muszą zawierać co najmniej jeden wiersz zawartości.
pt_br: Literais de cadeia de caracteres bruta de várias linhas devem conter pelo menos uma linha de conteúdo.
ru: Многострочные литералы необработанных строк должны содержать по крайней мере одну строку содержимого.
zh_hans: 多行原始字符串字面量必须至少包含一行内容。
zh_hant: 多行原始字串常值至少必須包含一行內容。
