Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IDS_CSCHelp
source: Visual C# Compiler Options - OUTPUT FILES - -out:<file> Specify output file name (default: base name of file with main class or first file) -target:exe Build a console executable (default) (Short form: -t:exe) -target:winexe Build a Windows executable (Short form: -t:winexe) -target:library Build a library (Short form: -t:library) -target:module Build a module that can be added to another assembly (Short form: -t:module) -target:appcontainerexe Build an Appcontainer executable (Short form: -t:appcontainerexe) -target:winmdobj Build a Windows Runtime intermediate file that is consumed by WinMDExp (Short form: -t:winmdobj) -doc:<file> XML Documentation file to generate -refout:<file> Reference assembly output to generate -platform:<string> Limit which platforms this code can run on: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred, or anycpu. The default is anycpu. - INPUT FILES - -recurse:<wildcard> Include all files in the current directory and subdirectories according to the wildcard specifications -reference:<alias>=<file> Reference metadata from the specified assembly file using the given alias (Short form: -r) -reference:<file list> Reference metadata from the specified assembly files (Short form: -r) -addmodule:<file list> Link the specified modules into this assembly -link:<file list> Embed metadata from the specified interop assembly files (Short form: -l) -analyzer:<file list> Run the analyzers from this assembly (Short form: -a) -additionalfile:<file list> Additional files that don't directly affect code generation but may be used by analyzers for producing errors or warnings. -embed Embed all source files in the PDB. -embed:<file list> Embed specific files in the PDB. - RESOURCES - -win32res:<file> Specify a Win32 resource file (.res) -win32icon:<file> Use this icon for the output -win32manifest:<file> Specify a Win32 manifest file (.xml) -nowin32manifest Do not include the default Win32 manifest -resource:<resinfo> Embed the specified resource (Short form: -res) -linkresource:<resinfo> Link the specified resource to this assembly (Short form: -linkres) Where the resinfo format is <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] Emit debugging information -debug:{full|pdbonly|portable|embedded} Specify debugging type ('full' is default, 'portable' is a cross-platform format, 'embedded' is a cross-platform format embedded into the target .dll or .exe) -optimize[+|-] Enable optimizations (Short form: -o) -deterministic Produce a deterministic assembly (including module version GUID and timestamp) -refonly Produce a reference assembly in place of the main output -instrument:TestCoverage Produce an assembly instrumented to collect coverage information -sourcelink:<file> Source link info to embed into PDB. - ERRORS AND WARNINGS - -warnaserror[+|-] Report all warnings as errors -warnaserror[+|-]:<warn list> Report specific warnings as errors (use "nullable" for all nullability warnings) -warn:<n> Set warning level (0 or higher) (Short form: -w) -nowarn:<warn list> Disable specific warning messages (use "nullable" for all nullability warnings) -ruleset:<file> Specify a ruleset file that disables specific diagnostics. -errorlog:<file>[,version=<sarif_version>] Specify a file to log all compiler and analyzer diagnostics. sarif_version:{1|2|2.1} Default is 1. 2 and 2.1 both mean SARIF version 2.1.0. -reportanalyzer Report additional analyzer information, such as execution time. -skipanalyzers[+|-] Skip execution of diagnostic analyzers. - LANGUAGE - -checked[+|-] Generate overflow checks -unsafe[+|-] Allow 'unsafe' code -define:<symbol list> Define conditional compilation symbol(s) (Short form: -d) -langversion:? Display the allowed values for language version -langversion:<string> Specify language version such as `latest` (latest version, including minor versions), `default` (same as `latest`), `latestmajor` (latest version, excluding minor versions), `preview` (latest version, including features in unsupported preview), or specific versions like `6` or `7.1` -nullable[+|-] Specify nullable context option enable|disable. -nullable:{enable|disable|warnings|annotations} Specify nullable context option enable|disable|warnings|annotations. - SECURITY - -delaysign[+|-] Delay-sign the assembly using only the public portion of the strong name key -publicsign[+|-] Public-sign the assembly using only the public portion of the strong name key -keyfile:<file> Specify a strong name key file -keycontainer:<string> Specify a strong name key container -highentropyva[+|-] Enable high-entropy ASLR - MISCELLANEOUS - @<file> Read response file for more options -help Display this usage message (Short form: -?) -nologo Suppress compiler copyright message -noconfig Do not auto include CSC.RSP file -parallel[+|-] Concurrent build. -version Display the compiler version number and exit. - ADVANCED - -baseaddress:<address> Base address for the library to be built -checksumalgorithm:<alg> Specify algorithm for calculating source file checksum stored in PDB. Supported values are: SHA1 or SHA256 (default). -codepage:<n> Specify the codepage to use when opening source files -utf8output Output compiler messages in UTF-8 encoding -main:<type> Specify the type that contains the entry point (ignore all other possible entry points) (Short form: -m) -fullpaths Compiler generates fully qualified paths -filealign:<n> Specify the alignment used for output file sections -pathmap:<K1>=<V1>,<K2>=<V2>,... Specify a mapping for source path names output by the compiler. -pdb:<file> Specify debug information file name (default: output file name with .pdb extension) -errorendlocation Output line and column of the end location of each error -preferreduilang Specify the preferred output language name. -nosdkpath Disable searching the default SDK path for standard library assemblies. -nostdlib[+|-] Do not reference standard library (mscorlib.dll) -subsystemversion:<string> Specify subsystem version of this assembly -lib:<file list> Specify additional directories to search in for references -errorreport:<string> Specify how to handle internal compiler errors: prompt, send, queue, or none. The default is queue. -appconfig:<file> Specify an application configuration file containing assembly binding settings -moduleassemblyname:<string> Name of the assembly which this module will be a part of -modulename:<string> Specify the name of the source module -generatedfilesout:<dir> Place files generated during compilation in the specified directory. -reportivts[+|-] Output information on all IVTs granted to this assembly by all dependencies, and annotate foreign assembly accessibility errors with what assembly they came from.
ja: Visual C# Compiler のオプション - 出力ファイル - -out:<file> 出力ファイル名を指定します (既定値: main クラスを含むファイルの ベース名また最初のファイル) -target:exe コンソール アプリケーションをビルドします (既定) (短い 形式: -t:exe) -target:winexe Windows 実行可能ファイルをビルドします (短い形式: -t:winexe) -target:library ライブラリをビルドします (短い形式: -t:library) -target:module 別のアセンブリに追加できるモジュールを ビルドします (短い形式: -t:module) -target:appcontainerexe Appcontainer 実行可能ファイルをビルドします (短い形式: -t:appcontainerexe) -target:winmdobj WinMDExp が使用する、Windows ランタイムの 中間ファイルをビルドします (短い形式: -t:winmdobj) -doc:<file> 生成する XML ドキュメント ファイルです -refout:<file> 生成する参照アセンブリ出力です -platform:<string> このコードを実行できるプラットフォームを限定します。x86、 Itanium、x64、arm、arm64、anycpu32bitpreferred、 anycpu のいずれかです。既定値は anycpu です。 - 入力ファイル - -recurse:<wildcard> ワイルドカードの仕様に従って、 現在のディレクトリとサブディレクトリ内のすべてのファイルを 含めます -reference:<alias>=<file> 指定されたエイリアスを使用して、指定されたアセンブリ ファイルからの メタデータを参照します (短い形式: -r) -reference:<file list> 指定されたアセンブリ ファイルからのメタデータを 参照します (短い形式: -r) -addmodule:<file list> 指定されたモジュールをこのアセンブリにリンクします -link:<file list> 指定された相互運用アセンブリからのメタデータを 埋め込みます (短い形式: -l) -analyzer:<file list> このアセンブリからアナライザーを実行します (短い形式: -a) -additionalfile:<file list> コードの生成に直接影響しないものの、エラーまたは警告を 生成するためにアナライザーが使用する可能性がある 追加ファイルです。 -embed PDB ファイル内にすべてのソース ファイルを埋め込みます。 -embed:<file list> PDB に特定のファイルを埋め込みます。 - リソース - -win32res:<file> Win32 リソース ファイル (.res) を指定します -win32icon:<file> 出力にこのアイコンを使用します -win32manifest:<file> Win32 マニフェスト ファイル (.xml) を指定します -nowin32manifest 既定の Win32 マニフェストを含めません -resource:<resinfo> 指定されたリソースを埋め込みます (短い形式: -res) -linkresource:<resinfo> このアセンブリに指定されたリソースをリンクします (短い形式: -linkres) resinfo の形式: <file>[,<string name>[,public|private]] - コード生成 - -debug[+|-] デバッグ情報を出力します -debug:{full|pdbonly|portable|embedded} デバッグの種類を指定します ('full' は既定、 'portable' はクロスプラットフォーム形式、 'embedded' はターゲットの .dll または .exe に埋め込まれる クロスプラットフォーム形式です) -optimize[+|-] 最適化を有効にします (短い形式: -o) -deterministic 決定論的アセンブリを生成します (モジュール バージョン GUID とタイムスタンプを含む) -refonly メイン出力の代わりに参照アセンブリを生成します -instrument:TestCoverage カバレッジ情報を収集するようにインストルメント化されたアセンブリを 生成します -sourcelink:<file> PDB に埋め込むソース リンク情報。 - エラーと警告 - -warnaserror[+|-] すべての警告をエラーとして報告します -warnaserror[+|-]:<warn list> 特定の警告をエラーとして報告します (すべての NULL 値の許容に関する警告に対して "nullable" を使用します) -warn:<n> 警告レベル (0 以上) を設定します (短い形式: -w) -nowarn:<warn list> 特定の警告メッセージを無効にします (すべての NULL 値の許容に関する警告に対して "nullable" を使用します) -ruleset:<file> 特定の診断を無効にするルールセット ファイルを 指定します。 -errorlog:<file>[,version=<sarif_version>] すべてのコンパイラとアナライザーの診断をログに記録するファイルを 指定します。 sarif_version:{1|2|2.1} 既定値は 1 です。2 と 2.1 は 両方とも SARIF バージョン 2.1.0 を意味します。 -reportanalyzer 実行時間などの追加のアナライザー情報を 報告します。 -skipanalyzers[+|-] 診断アナライザーの実行をスキップします。 - 言語 - -checked[+|-] オーバーフロー チェックを生成します -unsafe[+|-] 'unsafe' コードの使用を許可します -define:<symbol list> 条件付きコンパイル シンボルを定義します (短い 形式: -d) -langversion:? 言語バージョンに指定できる値を表示します -langversion:<string> 次のような言語バージョンを指定します。 'latest' (マイナー バージョンを含む最新バージョン)、 'default' ('latest' と同じ)、 'latestmajor' (マイナー バージョンを含まない最新バージョン)、 'preview' (サポートされていないプレビューの機能を含む最新バージョン)、 '6' や '7.1' などの特定のバージョン -nullable[+|-] Null 許容コンテキスト オプションの有効または無効を指定します。 -nullable:{enable|disable|warnings|annotations} Null 許容コンテキスト オプションの enable|disable|warnings|annotations を指定します。 - セキュリティ - -delaysign[+|-] 厳密な名前キーの公開部分のみを使用して アセンブリに遅延署名します -publicsign[+|-] 厳密な名前キーの公開部分のみを使用して アセンブリに公開署名します -keyfile:<file> 厳密な名前のキー ファイルを指定します -keycontainer:<string> 厳密な名前のキー コンテナーを指定します -highentropyva[+|-] 高エントロピ ASLR を有効にします - その他 - @<file> その他のオプションを、応答ファイルから読み取ります -help この使用法メッセージを表示します (短い形式: -?) -nologo コンパイラの著作権メッセージを表示しません -noconfig CSC.RSP ファイルを自動的に含めません -parallel[+|-] 同時にビルドします。 -version コンパイラのバージョン番号を表示して終了します。 - 詳細設定 - -baseaddress:<address> ビルドするライブラリのベース アドレス -checksumalgorithm:<alg> PDB に格納されているソース ファイル チェックサムを計算するための アルゴリズムを指定します。サポートされている値: SHA1 または SHA256 (既定値)。 -codepage:<n> ソース ファイルを開くときに使用するコードページを 指定します -utf8output UTF-8 エンコードでコンパイラのメッセージを出力します -main:<type> エントリ ポイントを含む型を指定します (他のすべてのエントリ ポイントを無視します) (短い 形式: -m) -fullpaths コンパイラは完全修飾パスを生成します -filealign:<n> 出力ファイルのセクションに使用する配置を 指定します -pathmap:<K1>=<V1>,<K2>=<V2>,... コンパイラが出力するソース パス名のマッピングを 指定します。 -pdb:<file> デバッグ情報のファイル名を指定します (既定値: 出力ファイル名と .pdb 拡張子) -errorendlocation 各エラーの終了位置の出力行と 出力列です -preferreduilang 優先する出力言語名を指定します。 -nosdkpath 標準ライブラリ アセンブリの既定の SDK パスの検索を無効にします。 -nostdlib[+|-] 標準ライブラリ (mscorlib.dll) を参照しません -subsystemversion:<string> このアセンブリのサブシステム バージョンを指定します -lib:<file list> 参照を検索する追加のディレクトリを 指定します -errorreport:<string> 内部コンパイラ エラーを処理する方法を指定します。 prompt、send、queue、none のいずれかです。既定値は queue です。 -appconfig:<file> アセンブリ バインド設定を含むアプリケーション 構成ファイルを指定します -moduleassemblyname:<string> このモジュールが属することになるアセンブリの 名前です -modulename:<string> ソース モジュールの名前を指定します -generatedfilesout:<dir> コンパイル中に生成されたファイルを指定したディレクトリに 配置します。 -reportivts[+|-] すべての依存関係によってこのアセンブリに 付与されたすべての IVT に関する情報を出力し、外部アセンブリの アクセシビリティ エラーに、発生元のアセンブリに関する注釈をつけます。
pl: Opcje kompilatora języka Visual C# - PLIKI WYJŚCIOWE - -out:<file> Określanie nazwy pliku wyjściowego (domyślnie: nazwa podstawowa pliku z klasą główną lub pierwszym plikiem) -target:exe Kompiluj plik wykonywalny konsoli (domyślnie) (skrócona postać: -t:exe) -target:winexe Kompiluj plik wykonywalny systemu Windows (skrócona postać: -t:winexe) -target:library Utwórz bibliotekę (skrócona postać: -t:library) -target:module Tworzenie modułu, który można będzie dodać do innego zestawu (skrócona postać: -t:module) -target:appcontainerexe Tworzenie pliku wykonywalnego Appcontainer (skrócona postać: -t:appcontainerexe) -target:winmdobj Tworzenie pośredniego pliku środowiska uruchomieniowego systemu Windows, który jest używany przez winMDExp (skrócona postać: -t:winmdobj) -doc:<file> Plik dokumentacji XML do wygenerowania -refout:<file> Odwołanie do danych wyjściowych zestawu do wygenerowania -platform:<string> Ograniczanie platformy, na których można uruchomić ten kod: x86, Itanium, x64, arm, arm64, anycpu32bitpreferred lub anycpu. Domyślną jest anycpu. - PLIKI WEJŚCIOWE - -recurse:<wildcard> Uwzględnianie wszystkie plików w bieżącym katalogu oraz podkatalogach zgodnie ze specyfikacjami symbolu wieloznacznego -reference:<alias>=<file> Odwołanie do metadanych z określonego pliku zestawu, używając danego aliasu (skrócona postać: -r) -reference:<file list> Odwołanie do metadanych z określonych plików zestawu (skrócona postać: -r) -addmodule:<file list> Łączenie określonych modułów w tym zestawie -link:<file_list> Osadzone metadane z określonych plików zestawu międzyoperacyjności (skrócona postać: -l) -analyzer:<file_list> Uruchamianie analizatorów z tego zestawu (skrócona postać: -a) -additionalfile:<file list> Dodatkowe pliki, które nie mają bezpośredniego wpływu na generowanie kodu, ale mogą być używane przez analizatory do generowania błędów i ostrzeżeń. -embed Osadzanie wszystkich plików źródłowych w pliku PDB. -embed:<file list> Osadzanie określonych plików w pliku PDB. - ZASOBY - -win32res:<file> Określanie plik zasobów Win32 (.res) -win32icon:<file> Używanie tej ikony dla danych wyjściowych -win32manifest:<file> Określanie plik manifestu Win32 (xml) -nowin32manifest Nie dołączaj domyślnego manifestu Win32 -resource:<resinfo> Osadzanie określonego zasobu (skrócona postać: -res) -linkresource:<resinfo> Łączenie określonego zasobu z tym zestawem (skrócona postać: -linkres) Gdzie format resinfo jest <file>[,<name>[,public|private]] - GENEROWANIE KODU - -debug[+|-] Emitowanie informacji o debugowaniu -debug:{full|pdbonly|portable|embedded} Określanie typu debugowania (wartość „full” jest domyślna, „portable” jest formatem międzyplatformowym, „embedded” jest formatem międzyplatformowym osadzonym w docelowym pliku .dll lub .exe.) -optimize[+|-] Włączanie optymalizacji (skrócona postać: -o) -deterministic Generowanie zestawu deterministycznego (w tym identyfikatora GUID i sygnatury czasowej wersji modułu) -refonly Tworzenie zestawu odwołania zamiast wyjścia głównego -instrument:TestCoverage Generowanie zestawu instrumentowanego do zbierania informacji o pokryciach -sourcelink:<file> Informacje o linku źródłowym do osadzenia w pliku PDB. - BŁĘDY I OSTRZEŻENIA - -warnaserror[+|-] Raportowanie wszystkich ostrzeżeń jako błędy. -warnaserror[+|-]:<warn list> Raportowanie określonych ostrzeżeń jako błędy (użyj wartości „nullable” dla wszystkich ostrzeżeń dotyczących dopuszczania wartości null) -warn:<n> Ustawianie poziomu ostrzeżeń (0 lub wyższy) (skrócona postać: -w) -nowarn:<warn list> Wyłączanie określonych komunikatów ostrzegawczych (użyj wartości „nullable” dla wszystkich ostrzeżeń dotyczących dopuszczania wartości null) -ruleset:<file> Określanie pliku zestawu reguł, który wyłącza określoną diagnostykę. -errorlog:<file>[,version=<sarif_version>] Określanie pliku do rejestrowania całej diagnostyki kompilatora i analizatora. sarif_version:{1|2|2.1} Wartość domyślna to 1. 2 i 2.1 obie oznaczające wersję SARIF 2.1.0. -reportanalyzer Raportowanie dodatkowych informacje analizatora, takich jak czas wykonania. -skipanalyzers[+|-] Pomijanie wykonywanie analizatorów diagnostycznych. - JĘZYK - -checked[+|-] Generowanie testów przepełnienia -unsafe[+|-] Zezwalanie na kod „unsafe” -define:<symbol list> Definiowanie symboli kompilacji warunkowej (skrócona postać: -d) -langversion:? Wyświetlanie dozwolone wartości dla wersji językowej -langversion:<string> Określanie wersji języka, na przykład „latest” (najnowsza wersja, w tym wersje pomocnicze), „default” (tak samo jak „latest”), „latestmajor” (najnowsza wersja, z wyjątkiem wersji pomocniczych), „preview” (najnowsza wersja, w tym funkcje w nieobsługiwanym wersji zapoznawczej), lub dokładnych wersji, takich jak „6” lub „7.1” -nullable[+|-] Określanie włączenia|wyłączenia opcji kontekstu dopuszczania wartości null. -nullable:{enable|disable|warnings|annotations} Określanie opcji kontekstu dopuszczania wartości null enable|disable|warnings|annotations. - ZABEZPIECZENIA - -delaysign[+|-] Podpisywanie z opóźnieniem zestawu tylko przy użyciu publicznego fragmentu silnego klucza nazwy -publicsign[+|-] Podpisywanie publiczne zestawu tylko przy użyciu publicznego fragmentu silnego klucza nazwy -keyfile:<file> Określanie pliku silnego klucza nazwy. -keycontainer:<string> Określanie kontenera silnych kluczy nazw -highentropyva[+|-] Włączanie funkcji ASLR o wysokiej entropii. - RÓŻNE - @<file> Odczytywanie pliku odpowiedzi w celu uzyskania dodatkowych opcji -help Wyświetlanie tego komunikatu o użyciu (skrócona postać: -?) -nologo Wstrzymywanie komunikatu kompilatora o prawach autorskich -noconfig Nie dołączaj automatycznie pliku CSC.RSP -parallel[+|-] Współbieżna kompilacja. -version Wyświetlanie numer wersji kompilatora i wyjście. - ZAAWANSOWANE - -baseaddress:<address> Adres podstawowy dla bibiloteki, która ma być utworzona -checksumalgorithm:<alg> Określanie algorytmu obliczania pliku źródłowego pliku źródłowego przechowywanego w pliku PDB. Obsługiwane wartości to: SHA1 lub SHA256 (wartość domyślna). -codepage:<n> Określanie strony kodowej do używania podczas otwierania plików źródłowych -utf8output Komunikaty kompilatora danych wyjściowych w kodowaniu UTF-8 -main:<type> Określanie typu zawierającego punktu wejścia (ignoruj wszystkie inne możliwe punkty wejścia) (skrócona postać: -m) -fullpaths Kompilator generuje w pełni kwalifikowane ścieżki -filealign:<n> Określanie wyrównania używanego dla sekcji pliku wyjściowego -pathmap:<K1>=<V1>,<K2>=<V2>,... Określanie mapowania dla danych wyjściowych nazw ścieżek źródłowych przez kompilatora. -pdb:<file> Określanie nazwy pliku z informacjami o debugowaniu (domyślnie: nazwa pliku wyjściowego z rozszerzeniem .pdb) -errorendlocation wiersz i kolumna danych wyjściowych lokalizacji końcowej każdego błędu -preferreduilang Określanie preferowanej nazwy języka danych wyjściowych. -nosdkpath Wyłączanie wyszukiwania domyślnej ścieżki zestawu SDK dla zestawów bibliotek standardowych. -nostdlib[+|-] Nie odwołuj do biblioteki standardowej (mscorlib.dll) -subsystemversion:<version> Określanie wersji podsystemu zestawu -lib:<file list> Określanie dodatkowych katalogów do wyszukania odwołań -errorreport:<string> Określanie sposobu obsługi wewnętrznych błędów kompilatora: monit, wysyłanie, kolejka lub brak. Wartością domyślną jest kolejka. -appconfig:<file> Określanie pliku konfiguracji aplikacji zawierającego ustawienia powiązania zestawu -moduleassemblyname:<string> Nazwa zestawu, którego częścią będzie ten moduł -modulename:<string> Określanie nazwy modułu źródłowego -generatedfilesout:<dir> Umieszczanie plików wygenerowane podczas kompilacji w określonym katalogu. -reportivts[+|-] Informacje dotyczące danych wyjściowych o wszystkich plikach IVT przyznanych temu zestawowi przez wszystkie zależności i adnotowanie błędów dotyczących dostępności zestawu, z którego one pochodzą.
zh_hant: Visual C# 編譯器選項 - OUTPUT FILES - -out:<file> 指定輸出檔案名稱 (預設: 具有主要類別或第一個檔案的檔案基礎名稱) -target:exe 建置主控台可執行檔 (預設) (簡短 形式: -t:exe) -target:winexe 建置 Windows 可執行檔 (簡短形式: -t:winexe) -target:library 建置程式庫 (簡短形式: -t:library) -target:module 建置可以新增至其他 組件的模組 (簡短形式: -t:module) -target:appcontainerexe 建置 Appcontainer 可執行檔 (簡短形式: -t:appcontainerexe) -target:winmdobj 建置由 WinMDExp 取用 的 Windows 執行階段中繼檔案 (簡短形式: -t:winmdobj) -doc:<file> 要產生的 XML 文件檔案 -refout:<file> 要產生的參考組件輸出 -platform:<string> 限制此程式碼可在哪些平台上執行: x86、 Itanium、x64、arm、arm64、anycpu32bitpreferred 或 anycpu。預設為 anycpu。 - INPUT FILES - -recurse:<wildcard> 根據萬用字元 規格 包含目前目錄和子目錄中的所有檔案 -reference:<alias>=<file> 從指定的組件 檔使用指定的別名來參考中繼資料 (簡短形式: -r) -reference:<file list> 從指定的組件檔 來參考中繼資料 (簡短形式: -r) -addmodule:<file list> 將指定的模組連結至此組件中 -link:<file list> 從指定的 Interop 組件檔來內嵌中繼資料 (簡短形式: -l) -analyzer:<file list> 從此組件執行分析器 (簡短形式: -a) -additionalfile:<file list> 不會直接影響程式碼 產生但可由分析器用來產生錯誤或警告 的其他檔案。 -embed 在 PDB 中内嵌所有來源檔案。 -embed:<file list> 在 PDB 中内嵌特定檔案。 - RESOURCES - -win32res:<file> 指定 Win32 資源檔 (.res) -win32icon:<file> 使用此圖示來進行輸出 -win32manifest:<file> 指定 Win32 資訊清單檔 (.xml) -nowin32manifest 不要包含預設的 Win32 資訊清單 -resource:<resinfo> 嵌入指定的資源 (簡短形式: -res) -linkresource:<resinfo> 將指定的資源連結到此組件 (簡短形式: -linkres) 其中 resinfo 格式 為 <file>[,<string name>[,public|private]] - CODE GENERATION - -debug[+|-] 發出偵錯資訊 -debug:{full|pdbonly|portable|embedded} 指定偵錯類型 ('full' 為預設， 'portable' 是跨平台格式， 'embedded' 是內嵌至 目標 .dll 或 .exe 中的跨平台格式) -optimize[+|-] 啟用最佳化 (簡短形式: -o) -deterministic 產生具決定性組件 (包括模組版本 GUID 和時間戳記) -refonly 產生參考組件，以取代主要輸出 strument:TestCoverage 產生檢測要收集 涵蓋範圍資訊的組件 -sourcelink:<file> 要內嵌至 PDB 中的來源連結資訊。 - ERRORS AND WARNINGS - -warnaserror[+|-] 將所有警告回報為錯誤 -warnaserror[+|-]:<warn list> 將特定的警告回報為錯誤 (針對所有可為 Null 的警告使用 "nullable") -warn:<n> 設定警告層級 (0 或更高) (簡短形式: -w) -nowarn:<warn list> 停用特定的警告訊息 (針對所有可為 Null 的警告使用 "nullable") -ruleset:<file> 指定會停用特定 診斷的規則集檔案。 -errorlog:<file>[,version=<sarif_version>] 指定用來記錄所有編譯器和分析器 診斷的檔案。 sarif_version:{1|2|2.1} 預設為1. 2 和 2.1， 都表示 SARIF 版本 2.1.0。 -reportanalyzer 回報其他分析器資訊，例如 執行時間。 -skipanalyzers[+|-] 略過診斷分析器的執行。 - LANGUAGE - -checked[+|-] 產生溢位檢查 -unsafe[+|-] 允許 'unsafe' 程式碼 -define:<symbol list> 定義條件式編譯符號 (簡短 形式: -d) -langversion:? 顯示語言版本的允許值 -langversion:<string> 指定語言版本，例如 `latest` (最新版本，包括次要版本)， 'default' (與 'latest' 相同)， `latestmajor` (最新版本，排除次要版本)， 'preview' (最新版本，包括不支援預覽中的功能)， 或特定版本，例如 `6` 或 `7.1` -nullable[+|-] 指定可為 Null 內容選項啟用|停用。 -nullable:{enable|disable|warnings|annotations} 指定可為 Null 內容選項啟用|停用|警告|註釋。 - SECURITY - -delaysign[+|-] 只使用強式名稱金鑰的公開 部分對組件進行延遲簽屬 -publicsign[+|-] 只使用強式名稱金鑰的公開 部分對組件進行公開簽屬 -keyfile:<file> 指定強式名稱金鑰檔案 -keycontainer:<string> 指定強式名稱金鑰容器 -highentropyva[+|-] 啟用高熵 ASLR - MISCELLANEOUS - @<file> 讀取回應檔以取得更多選項 -help 顯示此使用方式訊息 (簡短形式 form: -?) -nologo 隱藏編譯器著作權訊息 -noconfig 不要自動包括 CSC.RSP 檔案 -parallel[+|-] 同時建置。 -version 顯示編譯器版本號碼並結束。 - ADVANCED - -baseaddress:<address> 要建置程式庫的基底位址 -checksumalgorithm:<alg> 指定計算儲存在 PDB 中 來源檔案總和檢查碼的演算法。支援的值為: SHA1 或 SHA256 (預設)。 -codepage:<n> 指定開啟來源 檔案時所要使用的字碼頁 -utf8output 輸出編譯器訊息 (以 UTF-8 編碼) -main:<type> 指定包含進入點的類型 (略過所有其他可能的進入點) (簡短 形式: -m) -fullpaths 編譯器會產生完整路徑 -filealign:<n> 指定用於輸出檔案 區段的對齊 -pathmap:<K1>=<V1>,<K2>=<V2>,... 指定編譯器的來源路徑名稱輸出的對應 。 -pdb:<file> 指定偵錯資訊檔案名稱 (預設: 具有 .pdb 副檔名的輸出檔案名稱) -errorendlocation 輸出每個錯誤 行與資料行的結束位置 -preferreduilang 指定喜好的輸出語言名稱。 -nosdkpath 停用搜尋標準程式庫組件的預設 SDK 路徑。 -nostdlib[+|-] 不參考標準程式庫 (mscorlib.dll) -subsystemversion:<string> 指定此組件的子系統版本 -lib:<file list> 指定要在其中搜尋的其他目錄以作為 參考 -errorreport:<string> 指定如何處理內部編譯器錯誤: 提示、傳送、佇列或無。預設為 佇列。 -appconfig:<file> 指定包含組件繫結設定的 應用程式設定檔 -moduleassemblyname:<string> 此模組將成為其一部分 的組件名稱 -modulename:<string> 指定來源模組的名稱 -generatedfilesout:<dir> 將編譯期間產生的檔案放在 指定的目錄。 -reportivts[+|-] 輸出有關所有相依項授與至此 組件的所有 IVT 的資訊，並使用它們來自的組件 標註外部組件的可存取性錯誤。

# IDS_SK_NAMESPACE
source: namespace
cs: obor názvů
es: espacio de nombres
fr: espace de noms
it: spazio dei nomi
ja: 名前空間
ko: 네임스페이스
pl: przestrzeń nazw
ru: пространство имен
tr: ad alanı
zh_hans: 命名空间
zh_hant: 命名空間

# IDS_Contravariant
source: contravariant
cs: kontravariant
es: contravariante
it: controvariante
ja: 反変
ko: 반공변(contravariant)
pl: kontrawariantny
ru: контравариантный
tr: kontravaryant
zh_hans: 逆变

# IDS_Contravariantly
source: contravariantly
cs: kontravariantně
de: contravariant
es: de forma contravariante
fr: par contravariance
it: in controvarianza
ja: 反変
ko: 반공변(contravariant) 방식
pl: kontrawariantnie
ru: контравариантно
tr: kontravaryant olarak
zh_hans: 逆变式
zh_hant: 以 Contravariant 方式
