Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_AssemblyMatchBadVersion
source: Assembly '{0}' with identity '{1}' uses '{2}' which has a higher version than referenced assembly '{3}' with identity '{4}'
cs: Sestavení {0} s identitou {1} používá {2} s vyšší verzí, než jakou má odkazované sestavení {3} s identitou {4}.
de: Assembly "{0}" mit Identität "{1}" verwendet "{2}" mit einer höheren Version als die referenzierte Assembly "{3}" mit Identität "{4}".
es: El ensamblado '{0}' con la identidad '{1}' usa '{2}', que tiene una versión superior a la del ensamblado '{3}' al que se hace referencia y que tiene la identidad '{4}'
fr: L'assembly '{0}' avec l'identité '{1}' utilise '{2}' dont la version est supérieure à celle de l'assembly référencé '{3}' avec l'identité '{4}'
it: L'assembly '{0}' con identità '{1}' usa '{2}' la cui versione è successiva a quella dell'assembly '{3}' a cui viene fatto riferimento con identità '{4}'
ja: アセンブリ '{0}' (ID '{1}') は、参照されているアセンブリ '{3}' (ID '{4}') より新しいバージョンを含む '{2}' を使用します
ko: ID가 '{1}'인 '{0}' 어셈블리는 ID가 '{4}'인 참조된 어셈블리 '{3}' 이후 버전인 '{2}'을(를) 사용합니다.
pl: Zestaw „{0}” z tożsamością „{1}” używa elementu „{2}”, który ma wyższą wersję niż przywoływany zestaw „{3}” z tożsamością „{4}”
pt_br: Assembly "{0}" com identidade "{1}" usa "{2}" que tem uma versão mais recente do que o assembly referenciado "{3}" com identidade "{4}"
ru: Сборка "{0}" с удостоверением "{1}" использует "{2}" с более высокой версией, чем у сборки "{3}" с удостоверением "{4}", на которую делается ссылка.
tr: {1}' kimlikli '{0}' derlemesi, başvurulan '{4}' kimlikli '{3}' derlemesinden daha yüksek sürüme sahip '{2}' kullanıyor
zh_hans: 标识为“{1}”的程序集“{0}”所使用的“{2}”版本高于所引用的标识为“{4}”的程序集“{3}”
zh_hant: 識別為 '{1}' 的組件 '{0}' 會使用 '{2}'，而後者的版本高於識別為 '{4}' 的參考組件 '{3}'

# ERR_FixedNeedsLvalue
source: Fixed size buffers can only be accessed through locals or fields
cs: K vyrovnávacím pamětem s pevnou velikostí jde získat přístup jenom prostřednictvím lokálních proměnných nebo polí.
de: Auf Puffer fester Größe kann nur über lokale Variablen oder Felder zugegriffen werden.
es: Solo se puede tener acceso a los búferes de tamaño fijo mediante variables locales o campos
fr: Les mémoires tampons de taille fixe ne sont accessibles que via des variables locales ou des champs
it: L'accesso ai buffer a dimensione fissa è consentito solo tramite variabili locali o campi
ja: 固定サイズ バッファーには、ローカルまたはフィールドをとおしてのみアクセスできます
ko: 고정 크기 버퍼는 지역 변수 또는 필드를 통해서만 액세스할 수 있습니다.
pl: Do buforów o ustalonym rozmiarze można uzyskać dostęp tylko przez elementy lokalne lub pola
pt_br: Buffers de tamanho fixo só podem ser acessados por meio de locais ou campos
ru: Доступ к буферам фиксированного размера разрешен только через локальные переменные или поля.
tr: Sabit boyutlu arabelleklere yalnızca yerel öğeler veya alanlar üzerinden erişilebilir
zh_hans: 只能通过局部变量或字段访问固定大小缓冲区
zh_hant: 固定大小緩衝區只能透過區域變數或欄位存取

# WRN_DuplicateTypeParamTag
source: XML comment has a duplicate typeparam tag for '{0}'
cs: Komentář XML má duplicitní značku typeparam pro {0}.
de: Der XML-Kommentar enthält ein doppeltes typeparam-Tag für "{0}".
es: El comentario XML tiene una etiqueta typeparam duplicada para '{0}'
fr: Le commentaire XML a une balise typeparam en double pour '{0}'
it: Il commento XML contiene un tag typeparam duplicato per '{0}'
ja: XML コメントで '{0}' の typeparam タグが重複しています
ko: XML 주석에는 '{0}'에 중복된 typeparam 태그가 있습니다.
pl: Komentarz XML zawiera zduplikowany tag typeparam dla elementu „{0}”
pt_br: O comentário XML tem uma tag typeparam duplicada para "{0}"
ru: Комментарий XML имеет повторяющийся тег для "{0}".
tr: XML yorumunun '{0}' için yinelenen bir typeparam etiketi var
zh_hans: XML 注释中对“{0}”有重复的 typeparam 标记
zh_hant: XML 註解中的 '{0}' 有重複的 typeparam 標籤

# WRN_DuplicateTypeParamTag_Title
source: XML comment has a duplicate typeparam tag
cs: Komentář XML má duplicitní značku typeparam.
de: XML-Kommentar enthält ein doppeltes typeparam-Tag
es: El comentario XML tiene una etiqueta typeparam duplicada
fr: Le commentaire XML a une balise typeparam en double
it: Il commento XML contiene un tag typeparam duplicato
ja: XML コメントで typeparam タグが重複しています
ko: XML 주석에 중복 형식 매개 변수 태그가 있습니다.
pl: Komentarz XML zawiera zduplikowany tag typeparam
pt_br: O comentário XML tem uma tag typeparam duplicada
ru: Комментарий XML содержит повторяющийся тег параметра типа
tr: XML açıklamasının yinelenen bir typeparam etiketi var
zh_hans: XML 注释中有重复的 typeparam 标记
zh_hant: XML 註解中有重複的 typeparam 標籤

# WRN_UnmatchedTypeParamTag
source: XML comment has a typeparam tag for '{0}', but there is no type parameter by that name
cs: Komentář XML má značku typeparam pro {0}, ale neexistuje parametr typu s tímto názvem.
de: Der XML-Kommentar weist ein typeparam-Tag für "{0}" auf, es gibt aber keinen Typparameter mit dem Namen.
es: El comentario XML tiene una etiqueta typeparam para '{0}', pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML a une balise typeparam pour '{0}', alors qu'il n'existe aucun paramètre de type de ce nom
it: Il commento XML ha un tag typeparam per '{0}', ma non esiste nessun parametro di tipo con questo nome
ja: XML コメントには '{0}' の typeparam タグがありますが、その名前に相当するパラメーターはありません
ko: XML 주석에는 '{0}'에 대한 typeparam 태그가 있지만 해당 이름의 형식 매개 변수는 없습니다.
pl: Komentarz XML ma tag typeparam dla elementu „{0}”, lecz nie ma parametru typu o takiej nazwie
pt_br: Comentário XML tem uma tag typeparam para "{0}", mas não há parâmetro de tipo por esse nome
ru: Комментарий XML для "{0}" имеет тег typeparam, но тип параметра для этого имени отсутствует.
tr: XML yorumu '{0}' için bir typeparam etiketine sahip, ancak bu adlı bir tür parametresi yok
zh_hans: XML 注释中有“{0}”的 typeparam 标记，但是没有该名称的类型参数
zh_hant: XML 註解中的 '{0}' 有 typeparam 標籤，但沒有該名稱的類型參數

# WRN_UnmatchedTypeParamTag_Title
source: XML comment has a typeparam tag, but there is no type parameter by that name
cs: Komentář XML má značku typeparam, ale neexistuje parametr typu s tímto názvem.
de: XML-Kommentar besitzt ein typeparam-Tag, es gibt jedoch keinen Typparameter mit diesem Namen
es: El comentario XML tiene una etiqueta typeparam, pero no hay ningún parámetro de tipo con ese nombre
fr: Le commentaire XML a une balise typeparam, alors qu'il n'existe aucun paramètre de type de ce nom
it: Il commento XML ha un tag typeparam, ma non esiste nessun parametro di tipo con questo nome
ja: XML コメントに typeparam タグが存在しますが、その名前に相当する型パラメーターはありません
ko: XML 주석에 typeparam 태그가 있지만 해당 이름의 형식 매개 변수는 없습니다.
pl: Komentarz XML ma tag typeparam, ale nie ma parametru typu o takiej nazwie
pt_br: O comentário XML tem uma tag typeparam, mas não há nenhum parâmetro com esse nome
ru: Комментарий XML содержит тег typeparam, но параметр типа с таким именем не существует
tr: XML açıklamasının bir typeparam etiketi var, ancak bu adla hiçbir tür parametresi yok
zh_hans: XML 注释中有 typeparam 标记，但是没有该名称的类型参数
zh_hant: XML 註解具有 typeparam 標籤，但是沒有該名稱的類型參數

# WRN_UnmatchedTypeParamRefTag
source: XML comment on '{1}' has a typeparamref tag for '{0}', but there is no type parameter by that name
cs: Komentář XML u {1} má značku typeparamref pro {0}, ale neexistuje parametr typu s tímto názvem.
de: Der XML-Kommentar für "{1}" weist ein typeparamref-Tag für "{0}" auf, es gibt aber keinen Typparameter mit dem Namen.
es: El comentario XML de '{1}' tiene una etiqueta typeparamref para '{0}', pero no hay ningún parámetro con ese nombre
fr: Le commentaire XML sur '{1}' a une balise typeparamref pour '{0}', alors qu'il n'existe aucun paramètre de type de ce nom
it: Il commento XML in '{1}' ha un tag typeparamref per '{0}', ma non esiste nessun parametro di tipo con questo nome
ja: '{1}' の XML コメントで、'{0}' の typeparamref タグがありますが、その名前に相当するパラメーターはありません
ko: {1}'의 XML 주석에는 '{0}'에 대한 typeparamref 태그가 있지만 해당 이름의 형식 매개 변수는 없습니다.
pl: Komentarz XML elementu „{1}” ma tag typeparamref dla elementu „{0}”, lecz nie ma parametru typu o takiej nazwie
pt_br: Comentário XML em "{1}" tem uma tag de typeparamref para "{0}", mas não há parâmetro de tipo com esse nome
ru: Комментарий XML в "{1}" имеет тег typeparam для "{0}", но тип параметра для этого имени отсутствует.
tr: {1}' öğesindeki XML yorumu '{0}' için typeparamref etiketine sahip, ancak bu adlı bir tür parametresi yok
zh_hans: “{1}”上的 XML 注释中有“{0}”的 typeparamref 标记，但是没有该名称的类型参数
zh_hant: '{1}' 上的 XML 註解中的 '{0}' 有 typeparamref 標籤，但沒有該名稱的類型參數

# WRN_UnmatchedTypeParamRefTag_Title
source: XML comment has a typeparamref tag, but there is no type parameter by that name
cs: Komentář XML má značku typeparamref, ale neexistuje parametr typu s tímto názvem.
de: XML-Kommentar besitzt ein typeparamref-Tag, es gibt jedoch keinen Typparameter mit diesem Namen
es: El comentario XML tiene una etiqueta typeparamref, pero no hay ningún parámetro de tipo con ese nombre
fr: Le commentaire XML a une balise typeparamref, alors qu'il n'existe aucun paramètre de type de ce nom
it: Il commento XML ha un tag paramref, ma non esiste nessun parametro di tipo con questo nome
ja: XML コメントに typeparamref タグが存在しますが、その名前に相当する型パラメーターはありません
ko: XML 주석에 typeparamref 태그가 있지만 해당 이름의 형식 매개 변수는 없습니다.
pl: Komentarz XML ma tag typeparamref, ale nie ma parametru typu o takiej nazwie
pt_br: O comentário XML tem uma tag typeparamref, mas não há nenhum parâmetro de tipo com esse nome
ru: Комментарий XML содержит тег typeparamref, но параметр типа с таким именем не существует
tr: XML açıklamasının bir typeparamref etiketi var, ancak bu adla hiçbir tür parametresi yok
zh_hans: XML 注释中有 typeparamref 标记，但是没有该名称的类型参数
zh_hant: XML 註解具有 typeparamref 標籤，但是沒有該名稱的類型參數

# WRN_MissingTypeParamTag
source: Type parameter '{0}' has no matching typeparam tag in the XML comment on '{1}' (but other type parameters do)
cs: Parametr typu {0} nemá žádnou odpovídající značku typeparam v komentáři XML na {1} (ale jiné parametry typu ano).
de: Der {0}-Typparameter hat (im Gegensatz zu anderen Typparametern) kein entsprechendes typeparam-Tag im XML-Kommentar für "{1}".
es: El parámetro de tipo '{0}' no tiene ninguna etiqueta typeparam correspondiente en el comentario XML en '{1}' (pero otros parámetros de tipo sí)
fr: Le paramètre de type '{0}' n'a pas de balise typeparam correspondante dans le commentaire XML de '{1}' (contrairement à d'autres paramètres de type)
it: Il parametro di tipo '{0}', diversamente da altri parametri di tipo, non contiene tag typeparam corrispondenti nel commento XML per '{1}'
ja: 型パラメーター '{0}' には、対応する typeparam タグが '{1}' の XML コメントにありませんが、他の型パラメーターにはあります
ko: {1}'의 XML 주석에 '{0}' 형식 매개 변수와 짝이 맞는 형식 매개 변수 태그가 없습니다. 다른 형식 매개 변수는 짝이 맞는 태그가 있습니다.
pl: Parametr typu „{0}” nie ma zgodnego tagu typeparam w komentarzu XML elementu „{1}” (lecz inne parametry typu mają)
pt_br: Parâmetro de tipo "{0}" não tem tag typeparam correspondente no comentário XML para "{1}" (mas outros parâmetros têm)
ru: Параметр типа "{0}" не имеет совпадающего тега typeparam в комментарии XML для "{1}" (в отличие от остальных параметров типов)
tr: {0}' tür parametresinin '{1}' için XML yorumunda eşleşen typeparam etiketi yoktur (ancak diğer tür parametrelerinin vardır)
zh_hans: 类型参数“{0}”在“{1}”的 XML 注释中没有匹配的 typeparam 标记(但其他类型参数有)
zh_hant: 類型參數 '{0}' 在 '{1}' 的 XML 註解中沒有相符的 typeparam 標籤 (但是其他類型參數有)

# WRN_MissingTypeParamTag_Title
source: Type parameter has no matching typeparam tag in the XML comment (but other type parameters do)
cs: Parametr typu nemá odpovídající značku typeparam v komentáři XML (na rozdíl od jiných parametrů typu).
de: Typparameter besitzt kein übereinstimmendes typeparam-Tag im XML-Kommentar (andere type-Parameter jedoch schon)
es: El parámetro de tipo no tiene una etiqueta typeparam coincidente en el comentario XML (pero otros parámetros de tipo sí)
fr: Le type de paramètre n'a pas de balise typeparam correspondante dans le commentaire XML (contrairement à d'autres paramètres)
it: Il parametro di tipo, diversamente da altri parametri di tipo, non contiene tag typeparam corrispondenti nel commento XML
ja: 型パラメーターには、対応する typeparam タグが XML コメントにありませんが、他の型パラメーターにはあります
ko: 형식 매개 변수와 짝이 맞는 형식 매개 변수 태그가 XML 주석에 없습니다. 다른 형식 매개 변수는 짝이 맞는 태그가 있습니다.
pl: Parametr typu nie ma zgodnego tagu typeparam w komentarzu XML (ale inne parametry mają ten tag)
pt_br: O parâmetro de tipo não tem nenhuma tag typeparam correspondente no comentário XML (mas outros parâmetros têm)
ru: Параметр типа не имеет соответствующий тег параметра типа в комментарии XML (в отличие от остальных параметров)
tr: Tür parametresinin XML açıklamasında eşleşen typeparam etiketi yok (ancak diğer tür parametrelerinin var)
zh_hans: 类型参数在 XML 注释中没有匹配的 typeparam 标记(但其他类型参数有)
zh_hant: 在 XML 註解中，類型參數沒有相符的 typeparam 標籤 (但其他類型參數則相反)

# ERR_CantChangeTypeOnOverride
source: '{0}': type must be '{2}' to match overridden member '{1}'
cs: {0}: Typ musí být {2}, aby odpovídal přepsanému členu {1}.
de: '"{0}": Der Typ muss "{2}" sein, um mit dem überschriebenen Member "{1}" übereinzustimmen.
es: '{0}': el tipo debe ser '{2}' para que coincida con el miembro invalidado '{1}'
fr: '{0}' : le type doit être '{2}' pour correspondre au membre substitué '{1}'
it: '{0}': il tipo deve essere '{2}' in modo che corrisponda al membro '{1}' sottoposto a override
ja: '{0}': オーバーライドされたメンバー '{1}' に対応するために、型は '{2}' でなければなりません
ko: '{0}': 재정의된 '{1}' 멤버와 일치하려면 '{2}' 형식이어야 합니다.
pl: „{0}”: typ musi być „{2}”, aby być zgodnym z przesłoniętą składową „{1}”
pt_br: "{0}": tipo deve ser "{2}" para corresponder ao membro substituído "{1}"
ru: "{0}": тип должен быть "{2}", чтобы соответствовать переопределенному члену "{1}".
tr: '{0}': geçersiz kılınan '{1}' türüyle eşleşmesi için türün '{2}' olması gerekir
zh_hans: “{0}”: 类型必须是“{2}”才能与重写成员“{1}”匹配
zh_hant: '{0}': 類型必須是 '{2}' 才符合覆寫的成員 '{1}'

# ERR_DoNotUseFixedBufferAttr
source: Do not use 'System.Runtime.CompilerServices.FixedBuffer' attribute. Use the 'fixed' field modifier instead.
cs: Nepoužívejte atribut System.Runtime.CompilerServices.FixedBuffer. Místo něj použijte modifikátor pole fixed.
de: Verwenden Sie nicht das System.Runtime.CompilerServices.FixedBuffer-Attribut. Verwenden Sie stattdessen den fixed-Feldmodifizierer.
es: No utilice el atributo 'System.Runtime.CompilerServices.FixedBuffer'. En su lugar, use el modificador de campo 'fixed'.
fr: N'utilisez pas l'attribut 'System.Runtime.CompilerServices.FixedBuffer'. Utilisez le modificateur de champ 'fixed' à la place.
it: Non utilizzare l'attributo 'System.Runtime.CompilerServices.FixedBuffer'. Utilizzare il modificatore di campo 'fixed'.
ja: System.Runtime.CompilerServices.FixedBuffer' 属性を使用しないでください。'fixed' フィールド修飾子を使用してください。
ko: System.Runtime.CompilerServices.FixedBuffer' 특성을 사용하지 마세요. 대신 'fixed' 필드 한정자를 사용하세요.
pl: Nie używaj atrybutu „System.Runtime.CompilerServices.FixedBuffer”. Zamiast niego użyj modyfikatora pola „fixed”.
pt_br: Não use o atributo 'System.Runtime.CompilerServices.FixedBuffer'. Use o modificador de campos 'fixed' em seu lugar.
ru: Не используйте атрибут "System.Runtime.CompilerServices.FixedBuffer". Вместо него следует применять модификатор "fixed".
tr: System.Runtime.CompilerServices.FixedBuffer' özniteliğini kullanmayın. Yerine 'fixed' alan değiştiricisini kullanın.
zh_hans: 请不要使用 "System.Runtime.CompilerServices.FixedBuffer" 特性。请改用 "fixed" 字段修饰符。
zh_hant: 請勿使用 'System.Runtime.CompilerServices.FixedBuffer' 屬性。請改用 'fixed' 欄位修飾元。

# WRN_AssignmentToSelf
source: Assignment made to same variable; did you mean to assign something else?
cs: Přiřazení proběhlo u stejné proměnné. Měli jste v úmyslu jiné přiřazení?
de: Zuweisung zur gleichen Variablen. Wollten Sie eine andere Zuweisung durchführen?
es: Asignación a la misma variable. ¿Quería asignar otro elemento?
fr: Assignation effectuée à la même variable ; souhaitiez-vous assigner un autre élément ?
it: Assegnazione fatta alla stessa variabile. Si intendeva assegnare qualcos'altro?
ja: 同じ変数に代入られました。他の変数に代入しますか?
ko: 같은 변수에 할당했습니다. 다른 요소를 할당하시겠습니까?
pl: Wykonano przypisanie do tej samej zmiennej. Czy chcesz przypisać coś innego?
pt_br: Atribuição feita à mesma variável. Você pretendia atribuir outro elemento?
ru: Проведено присвоение той же переменной; действительно выполнить такое назначение, а не иное?
tr: Atama aynı değişkene yapıldı; başka bir öğeyi mi atamak istiyordunuz?
zh_hans: 对同一变量进行赋值；是否希望对其他变量赋值?
zh_hant: 對同一個變數進行指派; 您是否想要指派別的東西?

# WRN_AssignmentToSelf_Title
source: Assignment made to same variable
cs: Přiřazení provedené u stejné proměnné
de: Die Zuweisung wurde für dieselbe Variable durchgeführt.
es: Se ha asignado a la misma variable
fr: Assignation effectuée à la même variable
it: Assegnazione fatta alla stessa variabile
ja: 同じ変数に代入されました
ko: 같은 변수에 할당했습니다.
pl: Ustawiono przypisanie do tej samej zmiennej
pt_br: Atribuição feita à mesma variável
ru: Назначение выполнено для той же переменной
tr: Atama aynı değişkene yapıldı
zh_hans: 对同一变量进行了赋值
zh_hant: 對相同變數進行的指派

# WRN_ComparisonToSelf
source: Comparison made to same variable; did you mean to compare something else?
cs: Porovnání proběhlo u stejné proměnné. Měli jste v úmyslu jiné porovnání?
de: Der Vergleich erfolgte mit der gleichen Variablen. Wollten Sie etwas anderes vergleichen?
es: La comparación se ha hecho con la misma variable. ¿Quería comparar otro elemento?
fr: Comparaison effectuée avec la même variable ; souhaitiez-vous comparer autre chose ?
it: Confronto effettuato con la stessa variabile. Si intendeva confrontare qualcos'altro?
ja: 同じ変数と比較されました。他の変数と比較しますか?
ko: 같은 변수를 비교했습니다. 다른 요소를 비교하시겠습니까?
pl: Wykonano porównanie z tą samą zmienną. Czy chcesz porównać coś innego?
pt_br: Comparação feita com a mesma variável. Você pretendia comparar com outro elemento?
ru: Сравнение выполнено с той же переменной. Действительно следует выполнять такое сравнение?
tr: Aynı değişkenle karşılaştırma yapıldı; başka bir öğeyle mi karşılaştırmak istiyordunuz?
zh_hans: 对同一变量进行比较；是否希望比较其他变量?
zh_hant: 對同一個變數進行比較; 您是否想要比較別的東西?

# WRN_ComparisonToSelf_Title
source: Comparison made to same variable
cs: Porovnání provedené u stejné proměnné
de: Vergleich erfolgte mit derselben Variable
es: Comparación hecha a la misma variable
fr: Comparaison effectuée avec la même variable
it: Confronto effettuato con la stessa variabile
ja: 同じ変数と比較されました
ko: 같은 변수와 비교했습니다.
pl: Wykonano porównanie z tą samą zmienną
pt_br: Comparação feita com a mesma variável
ru: Выполнено сравнение с той же переменной
tr: Karşılaştırma aynı değişkenle yapıldı
zh_hans: 对同一变量进行了比较
zh_hant: 對相同變數進行的比較

# ERR_CantOpenWin32Res
source: Error opening Win32 resource file '{0}' -- '{1}'
cs: Chyba při otevírání souboru prostředků Win32 {0} -- {1}
de: Fehler beim Öffnen der Win32-Ressourcendatei "{0}": "{1}"
es: Error al abrir el archivo de recursos de Win32 '{0}': '{1}'
fr: Erreur lors de l'ouverture du fichier de ressources Win32 '{0}' -- '{1}'
it: Si è verificato un errore durante l'apertura del file di risorse Win32 '{0}' - '{1}'
ja: Win32 リソース ファイル '{0}' を開く際にエラーが発生しました -- '{1}'
ko: {0}' Win32 리소스 파일을 여는 동안 오류가 발생했습니다. '{1}'
pl: Błąd podczas otwierania pliku zasobów Win32 „{0}” — „{1}”
pt_br: Erro ao abrir o arquivo de recursos do Win32 "{0}" -- "{1}"
ru: Ошибка при открытии файла ресурсов Win32 "{0}" — "{1}"
tr: {0}' Win32 kaynak dosyası açılırken hata -- '{1}'
zh_hans: 打开 Win32 资源文件“{0}”时出错 --“{1}”
zh_hant: 開啟 Win32 資源檔 '{0}' 時發生錯誤 -- '{1}'

# WRN_DotOnDefault
source: Expression will always cause a System.NullReferenceException because the default value of '{0}' is null
cs: Výraz způsobí výjimku System.NullReferenceException, protože výchozí hodnota {0} je null.
de: Der Ausdruck führt immer zu System.NullReferenceException, da der Standardwert von "{0}" NULL ist.
es: La expresión siempre producirá System.NullReferenceException porque el valor predeterminado de '{0}' es NULL
fr: L'expression fera toujours intervenir System.NullReferenceException, car la valeur par défaut de '{0}' est null
it: L'espressione determinerà sempre un'eccezione System.NullReferenceException perché il valore predefinito di '{0}' è Null.
ja: '{0}' の既定値が Null であるため、式は常に System.NullReferenceException になります。
ko: {0}'의 기본값이 null이므로 식에서 항상 System.NullReferenceException이 발생합니다.
pl: Wyrażenie zawsze spowoduje wystąpienie wyjątku System.NullReferenceException, ponieważ domyślna wartość elementu „{0}” to null
pt_br: Expressão sempre causará uma System.NullReferenceException porque o valor padrão de "{0}" é nulo
ru: Выражение всегда будет вызывать System.NullReferenceException, поскольку значение "{0}" по умолчанию равно Null.
tr: {0}' varsayılan değeri null olduğundan, ifade her zaman bir System.NullReferenceException öğesine neden olacak
zh_hans: 由于“{0}”的默认值为 null，因此表达式总会导致 System.NullReferenceException
zh_hant: 運算式一律會造成 System.NullReferenceException，因為 '{0}' 的預設值為 null。

# WRN_DotOnDefault_Title
source: Expression will always cause a System.NullReferenceException because the type's default value is null
cs: Výraz způsobí výjimku System.NullReferenceException, protože výchozí hodnota pro typ je null.
de: Ausdruck verursacht immer eine System.NullReferenceException, da der Standardwert des Typs null lautet
es: La expresión siempre causará una excepción System.NullReferenceException porque el valor por defecto es null
fr: L'expression fera toujours intervenir System.NullReferenceException, car la valeur par défaut du type est null
it: L'espressione determinerà sempre un'eccezione System.NullReferenceException perché il valore predefinito del tipo è Null.
ja: 型の規定値が null であるため、式は常に System.NullReferenceException になります
ko: 형식의 기본값이 null이므로 식은 항상 System.NullReferenceException을 발생합니다.
pl: Wyrażenie będzie zawsze powodować wystąpienie wyjątku System.NullReferenceException, ponieważ domyślna wartość typu to null
pt_br: A expressão sempre causa uma System.NullReferenceException porque o valor padrão do tipo é nulo
ru: Выражение будет всегда вызывать исключение System.NullReferenceException, так как значение по умолчанию для типа равно NULL
tr: Türün varsayılan değeri null olduğundan, ifade her zaman System.NullReferenceException özel durumuna neden olacaktır
zh_hans: 由于类型的默认值为 null，因此表达式总会导致 System.NullReferenceException
zh_hant: 運算式一律會造成 System.NullReferenceException，因為類型的預設值為 null

# ERR_NoMultipleInheritance
source: Class '{0}' cannot have multiple base classes: '{1}' and '{2}'
cs: Třída {0} nemůže mít víc základních tříd: {1} a {2}.
de: Die {0}-Klasse kann nicht mehrere Basisklassen aufweisen: "{1}" und "{2}"
es: La clase '{0}' no puede tener varias clases base: '{1}' y '{2}'
fr: La classe '{0}' ne peut pas avoir plusieurs classes de base : '{1}' et '{2}'
it: La classe '{0}' non può contenere più classi base: '{1}' e '{2}'
ja: クラス '{0}' は複数の基底クラス ('{1}' と '{2}') を持つことができません
ko: {0}' 클래스는 기본 클래스('{1}', '{2}')를 여러 개 포함할 수 없습니다.
pl: Klasa „{0}” nie może zawierać wielu klas bazowych: „{1}” i „{2}”
pt_br: Classe "{0}" não pode ter várias classes base: "{1}" e "{2}"
ru: Класс "{0}" не может иметь несколько базовых классов: '{1}" и "{2}"
tr: {0}' sınıfının birden çok temel sınıfı olamaz: '{1}' ve '{2}'
zh_hans: 类“{0}”不能具有多个基类:“{1}”和“{2}”
zh_hant: 類別 '{0}' 不可有多重基底類別: '{1}' 和 '{2}'

# ERR_BaseClassMustBeFirst
source: Base class '{0}' must come before any interfaces
cs: Základní třída {0} musí předcházet všem rozhraním.
de: Die Basisklasse "{0}" muss vor den Schnittstellen angegeben werden.
es: La clase base '{0}' debe ir antes que cualquier interfaz
fr: La classe de base '{0}' doit précéder les interfaces
it: La classe base '{0}' deve precedere le interfacce
ja: 基底クラス '{0}' は、すべてのインターフェイスより前に指定する必要があります
ko: 기본 클래스 '{0}'은(는) 다른 모든 인터페이스보다 앞에 와야 합니다.
pl: Przed interfejsami musi występować klasa bazowa „{0}”
pt_br: Classe base "{0}" deve vir antes de quaisquer interfaces
ru: Перед интерфейсом должен быть указан базовый класс "{0}".
tr: Temel sınıf '{0}' tüm arabirimlerden önce gelmelidir
zh_hans: 基类“{0}”必须在任何接口之前
zh_hant: 基底類別 '{0}' 必須在所有介面之前
