Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_FilterIsConstantFalse
source: Filter expression is a constant 'false', consider removing the catch clause
cs: Výraz filtru je konstantní hodnota false. Zvažte odebrání klauzule catch.
de: Der Filterausdruck ist eine Konstante "false". Ziehen Sie in Betracht, die catch-Klausel zu entfernen.
es: La expresión de filtro es una constante "false", considere quitar la cláusula catch
fr: L'expression de filtre est une constante 'false' ; supprimez la clause catch
it: L'espressione di filtro è una costante 'false'. Provare a rimuovere la clausola catch
ja: フィルター式は定数 'false' です。catch 句の削除を検討してください
ko: 필터 식이 상수 'false'입니다. catch 절을 제거해 보세요.
pl: Wyrażenie filtru jest stałą wartością „false”, rozważ usunięcie klauzuli catch
pt_br: A expressão de filtro é uma constante ‘false’, considere remover a cláusula catch
ru: Выражение фильтра является константой "false", попробуйте удалить выражение catch
tr: Filtre ifadesi bir sabit ‘false’ değeri, catch yan tümcesini kaldırmayı deneyin
zh_hans: 筛选器表达式是常量 “false”，请考虑删除 catch 子句
zh_hant: 篩選條件運算式是常數 'false'，請考慮移除 catch 子句

# WRN_FilterIsConstantFalse_Title
source: Filter expression is a constant 'false'
cs: Výraz filtru je konstantní hodnota false.
de: Filterausdruck ist eine Konstante "false"
es: La expresión de filtro es una constante "false"
fr: L'expression de filtre est une constante 'false'
it: L'espressione di filtro è una costante 'false'
ja: フィルター式は定数 'false' です
ko: 필터 식이 상수 'false'입니다.
pl: Wyrażenie filtru jest stałą wartością „false”
pt_br: A expressão de filtro é uma constante ‘false’
ru: Выражение фильтра является константой "false"
tr: Filtre ifadesi bir sabit ‘false’ değeri
zh_hans: 筛选器表达式是常量 “false”
zh_hant: 篩選條件運算式是常數 'false'

# WRN_FilterIsConstantFalseRedundantTryCatch
source: Filter expression is a constant 'false', consider removing the try-catch block
cs: Výraz filtru je konstantní hodnota false. Zvažte odebrání bloku try-catch.
de: Der Filterausdruck ist eine Konstante "false". Ziehen Sie in Betracht, den try-catch-Block zu entfernen.
es: La expresión de filtro es una constante "false", considere quitar el bloqueo try-catch
fr: L'expression de filtre est une constante 'false' ; supprimez le bloc try-catch
it: L'espressione di filtro è una costante 'false'. Provare a rimuovere il blocco try-catch
ja: フィルター式は定数 'false' です。try-catch ブロックの削除を検討してください
ko: 필터 식이 상수 'false'입니다. try-catch 블록을 제거해 보세요.
pl: Wyrażenie filtru jest stałą wartością „false”, rozważ usunięcie bloku try-catch
pt_br: A expressão de filtro é uma constante ‘false’, considere remover o bloco try-catch
ru: Выражение фильтра является константой "false", попробуйте удалить блок try-catch
tr: Filtre ifadesi bir sabit ‘false’ değeri, try-catch bloğunu kaldırmayı deneyin
zh_hans: 筛选器表达式是常量 “false”，请考虑删除 try-catch 块
zh_hant: 篩選條件運算式是常數 'false'，請考慮移除 try-catch 區塊

# WRN_FilterIsConstantFalseRedundantTryCatch_Title
source: Filter expression is a constant 'false'.
cs: Výraz filtru je konstantní hodnota false.
de: Filterausdruck ist eine Konstante "false".
es: La expresión de filtro es una constante "false".
fr: L'expression de filtre est une constante 'false'.
it: L'espressione di filtro è una costante 'false'.
ja: フィルター式は定数 'false' です。
ko: 필터 식이 상수 'false'입니다.
pl: Wyrażenie filtru jest stałą wartością „false”.
pt_br: A expressão de filtro é uma constante ‘false’.
ru: Выражение фильтра является константой "false".
tr: Filtre ifadesi bir sabit ‘false’ değeri.
zh_hans: 筛选器表达式是常量 “false”。
zh_hant: 篩選條件運算式是常數 'false'。

# ERR_CantUseVoidInArglist
source: __arglist cannot have an argument of void type
cs: __arglist nemůže mít argument typu void.
de: __arglist darf kein Argument eines void-Typs aufweisen.
es: __arglist no puede tener un argumento de tipo void
fr: __arglist ne peut pas avoir un argument de type void
it: __arglist non può contenere un argomento di tipo void
ja: __arglist に void 型の引数を指定することはできません
ko: __arglist에는 void 형식의 인수가 있을 수 없습니다.
pl: Element __arglist nie może mieć argumentu typu void
pt_br: __arglist não pode ter um argumento de tipo nulo
ru: У __arglist не может быть аргумента типа void
tr: __arglist, void türünde bir bağımsız değişkene sahip olamaz
zh_hans: __arglist 不可具有 void 类型的参数
zh_hant: __arglist 不能有 void 類型的引數

# ERR_ConditionalInInterpolation
source: A conditional expression cannot be used directly in a string interpolation because the ':' ends the interpolation. Parenthesize the conditional expression.
cs: Podmíněný výraz se nedá použít přímo v interpolaci řetězce, protože na konci interpolace je dvojtečka. Dejte podmíněný výraz do závorek.
de: Ein bedingter Ausdruck kann nicht direkt in einer Zeichenfolgeninterpolation verwendet werden, weil ":" die Interpolation beendet. Setzen Sie den bedingten Ausdruck in Klammern.
es: Una expresión condicional no se puede utilizar directamente en una interpolación de cadenas porque ":" finaliza la interpolación. Ponga la expresión condicional entre paréntesis.
fr: Une expression conditionnelle ne peut pas être utilisée directement dans une interpolation de chaîne car ':' termine l'interpolation. Mettez l'expression conditionnelle entre parenthèses.
it: Non è possibile usare un'espressione condizionale in un'interpolazione di stringa perché l'interpolazione termina con ':'. Racchiudere tra parentesi l'espressione condizionale.
ja: ':' は文字列補間を終了させるため、条件式を文字列補間で直接使用することはできません。条件式をかっこで囲んでください。
ko: ':'은 보간을 끝내므로 조건식을 문자열 보간에 직접 사용할 수 없습니다. 조건식을 괄호를 묶으세요.
pl: Wyrażenie warunkowe nie może być używane bezpośrednio w interpolacji ciągu, ponieważ znak „:” kończy interpolację. Umieść wyrażenie warunkowe w nawiasie.
pt_br: Uma expressão condicional não pode ser usada diretamente em uma interpolação de cadeia de caracteres porque ‘:’ encerra a interpolação. Use parênteses na expressão condicional.
ru: Условное выражение не может использоваться напрямую в интерполяции строк, так как интерполяция заканчивается на ":". Заключите условное выражение в скобки.
tr: ':' ilişkilendirmeyi sonlandırdığından koşullu ifade bir dize ilişkilendirmesi içinde doğrudan kullanılamaz. Koşullu ifadeyi parantez içine alın.
zh_hans: 不可在字符串内插中直接使用条件表达式，因为内插已 “:” 结尾。请用括号将条件表达式括起来。
zh_hant: 因為內插補點的結尾是 ':'，所以無法直接在字串內插補點使用條件式運算式。

# ERR_DoNotUseFixedBufferAttrOnProperty
source: Do not use 'System.Runtime.CompilerServices.FixedBuffer' attribute on a property
cs: Nepoužívejte u vlastnosti atribut System.Runtime.CompilerServices.FixedBuffer.
de: Verwenden Sie das Attribut "System.Runtime.CompilerServices.FixedBuffer" nicht für eine Eigenschaft.
es: No utilice el atributo "System.Runtime.CompilerServices.FixedBuffer" en una propiedad.
fr: N'utilisez pas l'attribut 'System.Runtime.CompilerServices.FixedBuffer' sur une propriété
it: Non usare l'attributo 'System.Runtime.CompilerServices.FixedBuffer' su una proprietà
ja: プロパティでは 'System.Runtime.CompilerServices.FixedBuffer' 属性を使用しないでください
ko: 속성에서 'System.Runtime.CompilerServices.FixedBuffer' 특성을 사용하지 마세요.
pl: Nie używaj atrybutu „System.Runtime.CompilerServices.FixedBuffer” względem właściwości
pt_br: Não use o atributo 'System.Runtime.CompilerServices.FixedBuffer' em uma propriedade
ru: Не используйте атрибут "System.Runtime.CompilerServices.FixedBuffer" для свойства
tr: Bir özellikte 'System.Runtime.CompilerServices.FixedBuffer' özniteliğini kullanmayın
zh_hans: 请不要使用属性的 "System.Runtime.CompilerServices.FixedBuffer" 特性
zh_hant: 請勿在屬性 (property) 上使用 'System.Runtime.CompilerServices.FixedBuffer' 屬性 (attribute)

# ERR_FeatureNotAvailableInVersion7_3
source: Feature '{0}' is not available in C# 7.3. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 7.3. Použijte prosím jazyk verze {1} nebo vyšší.
de: Das Feature "{0}" ist in C# 7.3 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 7.3. Use la versión {1} del lenguaje o una posterior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 7.3. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile in C# 7.3. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 7.3 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: '{0}' 기능은 C# 7.3에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 7.3. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 7.3. Use a versão da linguagem {1} ou superior.
ru: Компонент "{0}" недоступен в C# 7.3. Используйте версию языка {1} или выше.
tr: '{0}' özelliği C# 7.3'te kullanılamaz. Lütfen {1} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 功能“{0}”在 C# 7.3 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: 在 C# 7.3 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# WRN_AttributesOnBackingFieldsNotAvailable
source: Field-targeted attributes on auto-properties are not supported in language version {0}. Please use language version {1} or greater.
cs: Atributy cílící na pole se u automatických vlastností v jazyku verze {0} nepodporují. Použijte prosím jazyk verze {1} nebo vyšší.
de: Auf Felder ausgerichtete Attribute für automatische Eigenschaften werden in Sprachversion {0} nicht unterstützt. Verwenden Sie Sprachversion {1} oder höher.
es: Los atributos destinados al campo en las propiedades automáticas no se admiten en la versión del lenguaje {0}. Use la versión del lenguaje {1} o una superior.
fr: Les attributs ciblés par des champs sur les propriétés automatiques ne sont pas pris en charge dans la version de langage {0}. Utilisez la version de langage {1} ou une version ultérieure.
it: Gli attributi destinati a campi su proprietà automatiche non sono supportati nella versione {0} del linguaggio. Usare la versione {1} o superiore.
ja: 自動プロパティ上でフィールドをターゲットとする属性を使用することは、言語バージョン {0} ではサポートされていません。{1} 以上の言語バージョンをお使いください。
ko: Auto 속성의 필드 대상 특성이 언어 버전 {0}에서 지원되지 않습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Atrybuty docelowe dla pól w ramach właściwości automatycznych nie są obsługiwane w języku w wersji {0}. Użyj języka w wersji {1} lub nowszej.
pt_br: Os atributos direcionados a campo em propriedades automáticas não são compatíveis com a versão da linguagem {0}. Use a versão da linguagem {1} ou superior.
ru: Ориентированные на поле атрибуты для автосвойств не поддерживаются в версии языка {0}. Используйте версию языка {1} или выше.
tr: Otomatik özelliklerdeki alan hedefli öznitelikler, {0} dil sürümünde desteklenmez. Lütfen {1} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 语言版本 {0} 中不支持自动属性的字段针对特性。请使用 {1} 或更高的语言版本。
zh_hant: 語言版本 {0} 不支援自動屬性 (property) 上以欄位為目標的屬性 (attribute)。請使用語言版本 {1} 或更高的版本。

# WRN_AttributesOnBackingFieldsNotAvailable_Title
source: Field-targeted attributes on auto-properties are not supported in this version of the language.
cs: Atributy cílící na pole se u automatických vlastností v této verzi jazyka nepodporují.
de: Auf Felder ausgerichtete Attribute für automatische Eigenschaften werden in dieser Sprachversion nicht unterstützt.
es: Los atributos destinados al campo en las propiedades automáticas no se admiten en esta versión del lenguaje.
fr: Les attributs ciblés par des champs sur les propriétés automatiques ne sont pas pris en charge dans cette version du langage.
it: Gli attributi destinati a campi su proprietà automatiche non sono supportati in questa versione del linguaggio.
ja: 自動プロパティ上でフィールドをターゲットとする属性を使用することは、このバージョンの言語ではサポートされていません。
ko: Auto 속성의 필드 대상 특성이 이 언어 버전에서 지원되지 않습니다.
pl: Atrybuty docelowe dla pól w ramach właściwości automatycznych nie są obsługiwane w tej wersji języka.
pt_br: Os atributos direcionados a campo em propriedades automáticas não são compatíveis com esta versão da linguagem.
ru: Ориентированные на поле атрибуты для автосвойств не поддерживаются в этой версии языка.
tr: Otomatik özelliklerdeki alan hedefli öznitelikler, bu dil sürümünde desteklenmez.
zh_hans: 此语言版本中不支持自动属性的字段针对特性。
zh_hant: 此語言版本不支援自動屬性 (property) 上以欄位為目標的屬性 (attribute)。

# IDS_FeatureAsyncStreams
source: async streams
cs: asynchronní streamy
de: Asynchrone Streams
es: flujos asincrónicos
fr: flux async
it: flussi asincroni
ja: 非同期ストリーム
ko: 비동기 스트림
pl: strumienie asynchroniczne
pt_br: fluxos assíncronos
tr: zaman uyumsuz akışlar
zh_hans: 异步流
zh_hant: 非同步資料流

# ERR_NoConvToIAsyncDisp
source: '{0}': type used in an asynchronous using statement must implement 'System.IAsyncDisposable' or implement a suitable 'DisposeAsync' method.
fr: '{0}' : le type utilisé dans une instruction en utilisant asynchrone doit implémenter « System.IAsyncDisposable » ou implémenter une méthode « DisposeAsync » appropriée.
it: '{0}': il tipo usato in un'istruzione using asincrona deve implementare 'System.IAsyncDisposable' o implementare un metodo 'DisposeAsync' adatto.
pl: „{0}”: typ użyty w asynchronicznej instrukcji using musi implementować typ „System.IAsyncDisposable” lub odpowiednią metodę „DisposeAsync”.
pt_br: '{0}': o tipo usado em uma instrução using assíncrona deve implementar 'System.IAsyncDisposable' ou implementar um método 'DisposeAsync' adequado.
ru: "{0}": тип, используемый в асинхронном операторе using, должен допускать реализовывать "System.IAsyncDisposable" или подходящий метод "DisposeAsync".
zh_hans: '{0}': 异步 using 语句中使用的类型必须实现 'System.IAsyncDisposable' 或实现适用的 'DisposeAsync' 方法。
zh_hant: '{0}': 在非同步 using 陳述式中使用的類型，必須可隱含地轉換為 'System.IAsyncDisposable' 或實作合適的 'DisposeAsync' 方法。

# ERR_BadGetAsyncEnumerator
source: Asynchronous foreach requires that the return type '{0}' of '{1}' must have a suitable public 'MoveNextAsync' method and public 'Current' property
cs: Asynchronní příkaz foreach vyžaduje, aby návratový typ {0} pro {1} měl vhodnou veřejnou metodu MoveNextAsync a veřejnou vlastnost Current.
de: Für asynchrones "foreach" muss der Rückgabetyp "{0}" von "{1}" über eine passende öffentliche MoveNextAsync-Methode und eine öffentliche Current-Eigenschaft verfügen.
es: Una instrucción foreach asincrónica requiere que el tipo de valor devuelto “{0}” de “{1}” tenga un método “MoveNextAsync” público y una propiedad “Current” pública.
fr: foreach asynchrone exige que le type de retour '{0}' de '{1}' ait une méthode 'MoveNextAsync' publique appropriée et une propriété 'Current' publique
it: Con l'istruzione foreach asincrona il tipo restituito '{0}' di '{1}' deve essere associato a un metodo 'MoveNextAsync' pubblico e a una proprietà 'Current' pubblica appropriati
ja: 非同期 foreach では、戻り値の型 '{1}' の '{0}' に適切なパブリック 'MoveNextAsync' メソッドおよびパブリック 'Current' プロパティが含まれている必要があります
ko: 비동기 foreach의 경우 '{1}'의 반환 형식 '{0}'에 적합한 공용 'MoveNextAsync' 메서드 및 공용 'Current' 속성이 있어야 합니다.
pl: Asynchroniczna instrukcja foreach wymaga, aby zwracany typ „{0}” elementu „{1}” miał odpowiednią metodę publiczną „MoveNextAsync” i właściwość publiczną „Current”
pt_br: A foreach assíncrona requer que o tipo de retorno '{0}' de '{1}' tenha um método 'MoveNextAsync' público adequado e a propriedade 'Current' pública
ru: Асинхронный оператор foreach требует, чтобы возвращаемый тип "{0}" для "{1}" имел соответствующий открытый метод "MoveNextAsync" и открытое свойство "Current".
tr: Zaman uyumsuz foreach, '{1}' öğesinin '{0}' dönüş türünün uygun bir genel 'MoveNextAsync' metoduna ve genel 'Current' özelliğine sahip olmasını gerektirir
zh_hans: 异步 foreach 要求“{1}”的返回类型“{0}”必须具有适当的公共 "MoveNextAsync" 方法和公共 "Current" 属性
zh_hant: 非同步的 foreach 需要 '{1}' 的傳回型別 '{0}'，必須要有合適的公用 'MoveNextAsync' 方法和公用 'Current' 屬性

# ERR_MultipleIAsyncEnumOfT
source: Asynchronous foreach statement cannot operate on variables of type '{0}' because it implements multiple instantiations of '{1}'; try casting to a specific interface instantiation
cs: Asynchronní příkaz foreach nejde použít pro proměnné typu {0}, protože implementuje vytváření víc instancí {1}. Zkuste přetypování na konkrétní instanci rozhraní.
de: Die asynchrone foreach-Anweisung kann für Variablen vom Typ "{0}" nicht verwendet werden, da sie mehrere Instanziierungen von "{1}" implementiert. Nehmen Sie eine Umwandlung in eine spezifische Schnittstelleninstanziierung vor.
es: Una instrucción foreach asincrónica no puede funcionar en variables de tipo “{0}” porque implementa varias creaciones de instancias de “{1}”; pruebe a convertirla en una creación de una instancia de interfaz específica.
fr: L'instruction foreach asynchrone ne peut pas fonctionner sur des variables de type '{0}', car elle implémente plusieurs instanciations de '{1}' ; essayez de caster en une instanciation d'interface spécifique
it: L'istruzione foreach asincrona non può funzionare con variabili di tipo '{0}' perché implementa più creazioni di un'istanza di '{1}'. Provare a eseguire il cast su una creazione di un'istanza di interfaccia specifica
ja: '{1}' の複数のインスタンスを実装するため、非同期 foreach ステートメントは、型 '{0}' の変数では操作できません。特定のインターフェイスのインスタンス化にキャストしてください
ko: 비동기 foreach 문은 '{1}'의 여러 인스턴스화를 구현하므로 '{0}' 형식의 변수에는 foreach 문을 수행할 수 없습니다. 특정 인터페이스 인스턴스화로 캐스트하세요.
pl: Asynchroniczna instrukcja foreach nie może używać zmiennych typu „{0}”, ponieważ implementuje wiele utworzeń wystąpienia elementu „{1}”. Spróbuj rzutowania na konkretne utworzenie wystąpienia interfejsu
pt_br: A instrução foreach assíncrona não pode operar em variáveis do tipo '{0}' porque implementa várias instanciações de '{1}'; tente transmitir para uma instanciação de interface específica
ru: Асинхронный оператор foreach не может использоваться с переменными типа "{0}", так как он реализует создание нескольких экземпляров "{1}". Попробуйте выполнить приведение к созданию экземпляра определенного интерфейса.
tr: Zaman uyumsuz foreach deyimi, '{0}' türündeki değişkenler '{1}' arabiriminin birden çok örnek oluşturma işlemini uyguladığından bu türdeki değişkenlerle çalışmaz. Türü, belirli bir arabirim örnek oluşturma işlemine atamayı deneyin
zh_hans: 异步 foreach 语句实现“{1}”的多个实例化，因此不能在“{0}”类型的变量上运行；请尝试强制转换到特定的接口实例化
zh_hant: 因為它實作 '{1}' 的多個具現化，所以非同步的 foreach 陳述式無法在型別 '{0}' 的變數上作業; 請嘗試轉換至特定的介面具現化

# ERR_InterfacesCantContainConversionOrEqualityOperators
source: Conversion, equality, or inequality operators declared in interfaces must be abstract or virtual
cs: Operátory převodu, rovnosti nebo nerovnosti deklarované v rozhraních musí být abstraktní nebo virtuální.
fr: Les opérateurs de conversion, d’égalité ou d’inégalité déclarés dans les interfaces doivent être abstraits ou virtuels
it: Gli operatori di conversione, uguaglianza o disuguaglianza dichiarati nelle interfacce devono essere astratti o virtuali
ja: インターフェイスで宣言された変換演算子、等値演算子、または非等値演算子は abstract または virtual である必要があります
pl: Operatory konwersji, równości lub nierówności zadeklarowane w interfejsach muszą być abstrakcyjne lub wirtualne
pt_br: Os operadores de conversão, igualdade ou desigualdade declarados em interfaces devem ser abstratos ou virtuais
ru: Операторы преобразования, равенства или неравенства, объявленные в интерфейсах, должны быть абстрактными или виртуальными
zh_hans: 在接口中声明的转换、等式或不等式运算符必须是抽象或虚拟的
zh_hant: 在介面中宣告的轉換、等式或不等式運算子必須為抽象或虛擬

# ERR_RuntimeDoesNotSupportDefaultInterfaceImplementation
source: Target runtime doesn't support default interface implementation.
cs: Cílový modul runtime nepodporuje implementaci výchozího rozhraní.
de: Die Standardschnittstellenimplementierung wird von der Zielruntime nicht unterstützt.
es: El tiempo de ejecución de destino no admite la implementación de interfaz predeterminada.
fr: Le runtime cible ne prend pas en charge l'implémentation d'interface par défaut.
it: Il runtime di destinazione non supporta l'implementazione di interfaccia predefinita.
ja: ターゲット ランタイムは、既定のインターフェイスの実装をサポートしていません。
ko: 대상 런타임이 기본 인터페이스 구현을 지원하지 않습니다.
pl: Docelowe środowisko uruchomieniowe nie obsługuje domyślnej implementacji interfejsu.
pt_br: O runtime de destino não é compatível com a implementação de interface padrão.
ru: Целевая среда выполнения не поддерживает реализацию интерфейса по умолчанию.
tr: Hedef çalışma zamanı varsayılan arabirim uygulamasını desteklemiyor.
zh_hans: 目标运行时不支持默认接口实现。
zh_hant: 目標執行階段不支援預設介面實作。

# ERR_RuntimeDoesNotSupportDefaultInterfaceImplementationForMember
source: '{0}' cannot implement interface member '{1}' in type '{2}' because the target runtime doesn't support default interface implementation.
cs: {0} nemůže implementovat člen rozhraní {1} v typu {2}, protože cílový modul runtime nepodporuje implementaci výchozího rozhraní.
de: "{0}" kann den Schnittstellenmember "{1}" im Typ "{2}" nicht implementieren, weil die Zielruntime die Standardschnittstellenimplementierung nicht unterstützt.
es: "{0}" no puede implementar el miembro de interfaz "{1}" en el tipo "{2}" porque el entorno de ejecución de destino no admite la implementación de interfaz predeterminada.
fr: '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}', car le runtime cible ne prend pas en charge l'implémentation d'interface par défaut.
it: '{0}' non può implementare il membro di interfaccia '{1}' nel tipo '{2}' perché il runtime di destinazione non supporta l'implementazione di interfaccia predefinita.
ja: ターゲットのランタイムは既定のインターフェイス実装をサポートしていないため、'{0}' は型 '{2}' のインターフェイス メンバー '{1}' を実装できません。
ko: 대상 런타임이 기본 인터페이스 구현을 지원하지 않으므로 '{0}'이(가) '{2}' 형식의 인터페이스 멤버 '{1}'을(를) 구현할 수 없습니다.
pl: Element „{0}” nie może implementować składowej interfejsu „{1}” w typie „{2}”, ponieważ docelowe środowisko uruchomieniowe nie obsługuje domyślnej implementacji interfejsu.
pt_br: '{0}' não pode implementar o membro de interface '{1}' no tipo '{2}' porque o runtime de destino não dá suporte à implementação de interface padrão.
ru: "{0}" не может реализовать член интерфейса "{1}" в типе "{2}", так как целевая среда выполнения не поддерживает реализацию интерфейса по умолчанию.
tr: Hedef çalışma zamanı varsayılan arabirim uygulamasını desteklemediğinden '{0}', '{1}' arabirim üyesini '{2}' türünde uygulayamaz.
zh_hans: “{0}”无法在类型 "{2}" 中实现接口成员 "{1}"，因为目标运行时不支持默认接口实现。
zh_hant: 因為目標執行階段不支援預設介面實作，所以 '{0}' 無法在類型 '{2}' 中實作介面成員 '{1}'。

# ERR_ImplicitImplementationOfNonPublicInterfaceMember
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implicitly implement a non-public member in C# {3}. Please use language version '{4}' or greater.
cs: {0} neimplementuje člen rozhraní{1}. {2} nemůže implicitně implementovat neveřejný člen v jazyce C# {3}. Použijte prosím verzi jazyka{4}nebo vyšší.
fr: « {0} » n’implémente pas le membre d’interface « {1} ». « {2} » ne peut pas implémenter implicitement un membre non public dans C# {3}. Utilisez la version de langue « {4} » ou une version ultérieure.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' non può implementare in modo implicito un membro non pubblico in C# {3}. Usare la versione '{4}' o versioni successive del linguaggio.
ja: '{0}' はインターフェイスメンバー '{1}' を実装しません。'{2}' は、C# {3} でパブリックでないメンバーを暗黙的に実装することはできません。'{4}' 以上の言語バージョンを使用してください。
pl: Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie może niejawnie zaimplementować niepublicznego elementu członkowskiego w języku C# {3}. Użyj wersji językowej „{4}” lub nowszej.
pt_br: '{0}' não implementa membro da interface '{1}'. '{2}' não pode implementar implicitamente um membro não público em C# {3}. Use a versão de linguagem '{4}' ou superior.
ru: "{0}" не реализует элемент интерфейса "{1}". "{2}" не может неявно реализовать непубличный элемент в C# {3}. Используйте язык версии "{4}" или более поздней.
zh_hans: “{0}”未实现接口成员“{1}”。“{2}”无法采用 C# {3} 隐式地实现非公共成员。请使用语言版本“{4}”或更高版本。
zh_hant: '{0}' 未實作介面成員 '{1}'。'{2}' 無法在 C# {3} 中隱含地實作非公用成員。請使用語言版本 '{4}' 或更新版本。
