Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_CantOpenWin32Manifest
source: Error opening Win32 manifest file {0} -- {1}
cs: Chyba při otevírání souboru manifestu Win32 {0} -- {1}
de: Fehler beim Öffnen der Win32-Manifestdatei "{0}": {1}
es: Error al abrir el archivo de manifiesto de Win32 {0}: {1}
fr: Erreur lors de l'ouverture du fichier manifeste Win32 {0} -- {1}
it: Si è verificato un errore durante l'apertura del file manifesto Win32 {0} - {1}
ja: Win32 マニフェスト ファイル {0} を開く際にエラーが発生しました -- {1}
ko: {0} Win32 매니페스트 파일을 여는 동안 오류가 발생했습니다. {1}
pl: Błąd podczas otwierania pliku manifestu Win32 {0} — {1}
pt_br: Erro ao abrir o arquivo de manifesto Win32 {0} -- {1}
ru: Ошибка при открытии файла манифеста Win32 {0} — {1}
tr: {0} Win32 bildirim dosyası açılırken hata -- {1}
zh_hans: 打开 Win32 清单文件 {0} 时出错 -- {1}
zh_hant: 開啟 Win32 資訊清單檔案 {0} 時發生錯誤 -- {1}

# ERR_ErrorBuildingWin32Resources
source: Error building Win32 resources -- {0}
cs: Chyba při sestavování prostředků Win32 -- {0}
de: Fehler beim Erstellen von Win32-Ressourcen: {0}
es: Error al compilar recursos de Win32: {0}
fr: Erreur lors de la génération des ressources Win32 -- {0}
it: Si è verificato un errore durante la compilazione delle risorse Win32 - {0}
ja: Win32 リソースのビルド中にエラーが発生しました -- {0}
ko: Win32 리소스를 만드는 동안 오류가 발생했습니다. {0}
pl: Błąd kompilacji zasobów Win32 — {0}
pt_br: Erro ao compliar recursos do Win32 -- {0}
ru: Ошибка при сборке ресурсов Win32 — {0}
tr: Win32 kaynakları oluşturulurken hata -- {0}
zh_hans: 生成 Win32 资源时出错 -- {0}
zh_hant: 建置 Win32 資源時發生錯誤 -- {0}

# ERR_DefaultValueBeforeRequiredValue
source: Optional parameters must appear after all required parameters
cs: Volitelné parametry musí následovat po všech povinných parametrech
de: Optionale Parameter müssen nach allen erforderlichen Parametern angezeigt werden.
es: Los parámetros opcionales deben aparecer después de todos los parámetros necesarios
fr: Les paramètres facultatifs doivent apparaître après tous les paramètres requis
it: I parametri facoltativi devono trovarsi dopo tutti i parametri obbligatori
ja: 省略可能なパラメーターはすべての必須パラメーターの後で指定する必要があります
ko: 선택적 매개 변수는 모든 필수 매개 변수 다음에 와야 합니다.
pl: Parametry opcjonalne muszą występować po wszystkich parametrach wymaganych
pt_br: Os parâmetros opcionais devem aparecer após todos os parâmetros necessários
ru: Необязательные параметры должны быть указаны после всех требуемых параметров.
tr: İsteğe bağlı parametreler tüm gerekli parametrelerden sonra yer almalıdır
zh_hans: 可选参数必须出现在所有必需参数之后
zh_hant: 選擇性參數必須出現在所有必要參數之後

# ERR_ExplicitImplCollisionOnRefOut
source: Cannot inherit interface '{0}' with the specified type parameters because it causes method '{1}' to contain overloads which differ only on ref and out
cs: Nejde dědit rozhraní {0} se zadanými parametry typu, protože to způsobuje, že metoda {1} obsahuje víc přetížení, která se liší jen deklaracemi ref a out.
de: Die Schnittstelle "{0}" kann nicht mit den angegebenen Typparametern vererbt werden, da dies dazu führt, dass die Methode "{1}" Überladungen enthält, die sich nur in "ref" und "out" unterscheiden.
es: No se puede heredar la interfaz '{0}' con los parámetros de tipo especificados porque da lugar a que el método '{1}' contenga sobrecargas que difieren solo en ref y out
fr: Impossible d'hériter de l'interface '{0}' avec les paramètres de type spécifiés, car cela entraîne des surcharges dans la méthode '{1}' qui diffèrent uniquement au niveau des paramètres ref et out
it: Non è possibile ereditare l'interfaccia '{0}' con i parametri di tipo specificato perché in tal caso il metodo '{1}' conterrebbe overload diversi solo in ref e out
ja: メソッド '{1}' が ref と out のみ異なるオーバーロードを含むようになるため、指定された型パラメーターではインターフェイス '{0}' を継承できません
ko: 지정한 형식 매개 변수가 있는 '{0}' 인터페이스를 사용하면 '{1}' 메서드에 ref 및 out만 다른 오버로드가 포함되므로 해당 인터페이스를 상속할 수 없습니다.
pl: Nie można dziedziczyć interfejsu „{0}” z określonymi typami parametrów, ponieważ spowoduje to, że metoda „{1}” będzie zawierać przeciążenia, które będą się różnić tylko parametrami ref i out
pt_br: Não é possível herdar a interface "{0}" com os parâmetros do tipo especificado porque isso faz com que o método "{1}" contenha sobrecargas que diferem somente em ref e out
ru: Не удается наследовать интерфейс "{0}" с указанными параметрами типов, так как из-за этого метод "{1}" содержит перегрузки, различающиеся только параметрами ref и out.
tr: {1}' yönteminin yalnızca ref ve out bakımından farklı tekrar yüklemeler içermesine neden olduğundan belirtilen tür parametreleriyle '{0}' arabirimi devralınamaz
zh_hans: 无法使用指定的类型参数继承接口“{0}”，因为它会导致方法“{1}”包含仅在 ref 和 out 上存在不同的重载
zh_hant: 無法繼承具有指定之類型參數的介面 '{0}'，因為其會讓方法 '{1}' 包含只有在 ref 和 out 上有所差異的多載

# ERR_PartialWrongTypeParamsVariance
source: Partial declarations of '{0}' must have the same type parameter names and variance modifiers in the same order
cs: Částečné deklarace {0} musí obsahovat názvy parametrů stejného typu a modifikátory odchylek ve stejném pořadí.
de: Partielle Deklarationen von "{0}" müssen die gleichen Typparameternamen und Varianzmodifizierer in der gleichen Reihenfolge aufweisen.
es: Las declaraciones parciales de '{0}' deben tener los mismos nombres de parámetro de tipo y modificadores de varianza en el mismo orden
fr: Les déclarations partielles de '{0}' doivent avoir les mêmes noms de paramètre de type et modificateurs de variance dans le même ordre
it: Le dichiarazioni parziali di '{0}' devono avere gli stessi nomi di parametro di tipo e modificatori di varianza nello stesso ordine
ja: '{0}' の partial 宣言では、同じ型パラメーター名と変性修飾子を同じ順序で指定しなければなりません
ko: {0}'의 partial 선언에는 동일한 순서로 동일한 형식 매개 변수 이름과 가변성(variance) 한정자가 있어야 합니다.
pl: Częściowe deklaracje elementu „{0}” muszą mieć takie same nazwy parametrów typu i modyfikatory wariancji w takiej samej kolejności
pt_br: Declarações parciais de "{0}" devem ter os mesmos nomes de parâmetro de tipo e modificadores de variância na mesma ordem
ru: В разделяемых объявлениях "{0}" должны быть одинаковыми имена параметров типов, модификаторы вариантности и их порядок.
tr: {0}' öğesinin kısmi bildirimleri aynı sırada aynı tür parametresi adlarına ve varyans değiştiricilerine sahip olmalıdır
zh_hans: “{0}”的分部声明必须具有相同类型的参数名和变型修饰符，同时顺序也必须相同
zh_hant: '{0}' 的部分宣告必須具有相同順序的相同類型參數名稱與變異數修飾元

# ERR_UnexpectedVariance
source: Invalid variance: The type parameter '{1}' must be {3} valid on '{0}'. '{1}' is {2}.
cs: Neplatná odchylka: Parametr typu {1} musí být {3} platný v {0}. {1} je {2}.
de: Ungültige Varianz: Der Typparameter "{1}" muss {3} und gültig für "{0}" sein. "{1}" ist {2}.
es: Varianza no válida: el parámetro de tipo '{1}' debe ser un {3} válido en '{0}'. '{1}' es {2}.
fr: Variance non valide : le paramètre de type '{1}' doit être un {3} valide sur '{0}'. '{1}' est {2}.
it: Varianza non valida: il parametro di tipo '{1}' deve essere {3} valido in '{0}'. '{1}' è {2}.
ja: 変性が無効です: 型のパラメーター '{1}' は '{0}' で有効な {3} である必要があります。'{1}' は {2} です。
ko: 잘못된 가변성(variance): '{1}' 형식 매개 변수는 '{0}'에서 유효한 {3}이어야 합니다. '{1}'은(는) {2}입니다.
pl: Nieprawidłowa wariancja: parametr typu „{1}” musi być elementem {3} prawidłowym dla elementu „{0}”. Element „{1}” to „{2}”.
pt_br: Variância inválida: O parâmetro do tipo "{1}" deve ser {3} válido em "{0}". "{1}" é {2}.
ru: Недопустимое отклонение: Параметр типа "{1}" должен быть {3}, допустимым на "{0}". "{1}" является {2}.
tr: Geçersiz varyans: '{1}' tür parametresi '{0}' öğesinde geçerli olan {3} olmalıdır. '{1}' öğesi {2} şeklindedir.
zh_hans: 变型无效: 类型参数“{1}”必须是在“{0}”上有效的 {3}。“{1}”为 {2}。
zh_hant: 變異數無效: 類型參數 '{1}' 必須是在 '{0}' 上有效的 {3}。'{1}' 是 {2}。

# ERR_DeriveFromDynamic
source: '{0}': cannot derive from the dynamic type
cs: {0}: Nejde odvozovat z dynamického typu.
de: '"{0}": Keine Ableitung vom dynamischen Typ möglich.
es: '{0}': no se puede derivar del tipo dinámico
fr: '{0}' : dérivation impossible du type dynamic
it: '{0}': non è possibile derivare dal tipo dinamico
ja: '{0}': 動的な型から派生することはできません
ko: '{0}': 동적 유형에서 파생될 수 없습니다.
pl: „{0}”: nie może pochodzić od typu dynamicznego
pt_br: "{0}": não é possível derivar do tipo dinâmico
ru: "{0}": не может наследовать от динамического типа.
tr: '{0}': dinamik türden türetilemez
zh_hans: “{0}”: 无法从动态类型派生
zh_hant: '{0}': 無法衍生自動態類型

# ERR_DeriveFromConstructedDynamic
source: '{0}': cannot implement a dynamic interface '{1}'
cs: {0}: Nemůže implementovat dynamické rozhraní {1}.
de: '"{0}": Implementierung einer dynamischen Schnittstelle "{1}" nicht möglich.
es: '{0}': no puede implementar una interfaz dinámica '{1}'
fr: '{0}' : impossible d'implémenter une interface dynamique '{1}'
it: '{0}': non è possibile implementare un'interfaccia dinamica '{1}'
ja: '{0}': 動的インターフェイス '{1}' を実装できません
ko: '{0}': 동적 인터페이스 '{1}'을(를) 구현할 수 없습니다.
pl: „{0}”: nie może implementować interfejsu „{1}”
pt_br: "{0}": não é possível implementar uma interface dinâmica "{1}"
ru: "{0}": не может реализовывать динамический интерфейс "{1}".
tr: '{0}': '{1}' dinamik arabirim uygulanamaz
zh_hans: “{0}”: 无法实现动态接口“{1}”
zh_hant: '{0}': 無法實作動態介面 '{1}'

# ERR_DynamicTypeAsBound
source: Constraint cannot be the dynamic type
cs: Omezení nemůže být dynamický typ.
de: Die Einschränkung kann nicht der dynamische Typ sein.
es: La restricción no puede ser el tipo dinámico
fr: La contrainte ne peut pas être du type dynamic
it: Il vincolo non può essere il tipo dinamico
ja: 制約を動的な型にすることはできません
ko: 제약 조건은 동적 유형일 수 없습니다.
pl: Ograniczenie nie może być typu dynamicznego
pt_br: A restrição não pode ser o tipo dinâmico
ru: Ограничение не может быть динамическим типом.
tr: Kısıtlama dinamik tür olamaz
zh_hans: 约束不能为动态类型
zh_hant: 條件約束不可為動態類型

# ERR_ConstructedDynamicTypeAsBound
source: Constraint cannot be a dynamic type '{0}'
cs: Omezení nemůže být dynamický typ {0}.
de: Die Einschränkung kann nicht der dynamische Typ "{0}" sein.
es: La restricción no puede ser un tipo dinámico '{0}'
fr: La contrainte ne peut pas être un type dynamic '{0}'
it: Il vincolo non può essere un tipo dinamico '{0}'
ja: 制約は動的な型 '{0}' にすることはできません
ko: 제약 조건은 '{0}' 동적 유형일 수 없습니다.
pl: Ograniczenie nie może być typu dynamicznego „{0}”
pt_br: Restrição não pode ser um tipo dinâmico "{0}"
ru: Ограничение не может быть динамическим типом "{0}".
tr: Kısıtlama '{0}' dinamik türü olamaz
zh_hans: 约束不能是动态类型“{0}”
zh_hant: 條件約束不可為動態類型 '{0}'

# ERR_DynamicRequiredTypesMissing
source: One or more types required to compile a dynamic expression cannot be found. Are you missing a reference?
cs: Jeden nebo více typů požadovaných pro kompilaci dynamického výrazu nejde najít. Nechybí odkaz?
de: Mindestens ein Typ, der zum Kompilieren eines dynamischen Ausdrucks erforderlich ist, wurde nicht gefunden. Fehlt möglicherweise ein Verweis?
es: No se encuentran uno o varios tipos necesarios para compilar una expresión dinámica. ¿Falta alguna referencia?
fr: Un ou plusieurs types requis pour compiler une expression dynamique sont introuvables. Une référence est-elle manquante ?
it: Non sono stati trovati uno o più tipi necessari per compilare un'espressione dinamica. Probabilmente manca un riferimento.
ja: 動的な式のコンパイルに必要な 1 つ以上の型が見つかりません。参照が指定されていることを確認してください。
ko: 동적 식을 컴파일하는 데 필요한 하나 이상의 형식을 찾을 수 없습니다. 참조가 있는지 확인하세요.
pl: Nie można odnaleźć przynajmniej jednego typu wymaganego do skompilowania wyrażenia dynamicznego. Czy nie brakuje odwołania?
pt_br: Não é possível encontrar um ou mais tipos necessários para compilar uma expressão dinâmica. Está precisando de uma referência?
ru: Не удается обнаружить один или несколько типов, необходимых для компиляции динамического выражения. Возможно, отсутствует ссылка.
tr: Dinamik bir ifadeyi derlemek için gereken bir veya daha fazla tür bulunamıyor. Bir başvuruyu eksik mi bıraktınız?
zh_hans: 找不到编译动态表达式所需的一个或多个类型。是否缺少引用?
zh_hant: 找不到編譯動態運算式所需的一或多種類型。您是否遺漏了參考?

# ERR_MetadataNameTooLong
source: Name '{0}' exceeds the maximum length allowed in metadata.
cs: Název {0} překračuje maximální délku povolenou v metadatech.
de: Der Name "{0}" überschreitet die maximal zulässige Länge in Metadaten.
es: El nombre '{0}' supera la longitud máxima permitida en los metadatos.
fr: Le nom '{0}' dépasse la longueur maximale autorisée dans les métadonnées.
it: Il nome '{0}' supera la lunghezza massima consentita nei metadati.
ja: 名前 '{0}' が、メタデータで許可されている最大文字数を超えています。
ko: {0}' 이름이 메타데이터에 허용된 최대 길이를 초과했습니다.
pl: Długość nazwy „{0}” przekracza maksymalną długość dozwoloną w metadanych.
pt_br: Nome "{0}" excede o comprimento máximo permitido em metadados.
ru: Имя "{0}" превышает максимальную длину, допустимую в метаданных.
tr: {0}' adı, meta verilerde izin verilen maksimum uzunluğu aşıyor.
zh_hans: 名称“{0}”超出元数据中允许的最大长度。
zh_hant: 名稱 '{0}' 超過中繼資料內所允許的長度上限。

# ERR_AttributesNotAllowed
source: Attributes are not valid in this context.
cs: Atributy nejsou v tomto kontextu platné.
de: Attribute sind in diesem Kontext nicht gültig.
es: Los atributos no son válidos en este contexto.
fr: Les attributs ne sont pas valides dans ce contexte
it: Gli attributi non sono validi in questo contesto.
ja: 属性は、このコンテキストでは無効です。
ko: 이 컨텍스트에서는 특성이 유효하지 않습니다.
pl: Atrybuty w tym kontekście są nieprawidłowe.
pt_br: Atributos não são válidos neste contexto.
ru: В этом контексте атрибуты недопустимы.
tr: Öznitelikler bu bağlamda geçerli değil.
zh_hans: 特性在此上下文中无效。
zh_hant: 屬性在此內容中無效。

# ERR_ExternAliasNotAllowed
source: 'extern alias' is not valid in this context
cs: 'Alias extern není v tomto kontextu platný.
de: 'Der externe Alias ist in diesem Kontext nicht gültig.
es: 'extern alias' no es válido en este contexto
fr: 'extern alias' n'est pas valide dans ce contexte
it: 'extern alias' non è valido in questo contesto
ja: 'このコンテキストでは 'extern エイリアス' は無効です
ko: '이 컨텍스트에서는 'extern 별칭'이 유효하지 않습니다.
pl: 'Alias zewnętrzny w tym kontekście jest nieprawidłowy
pt_br: "alias externo" não é válido neste contexto
ru: '"внешний псевдоним" недопустим в этом контексте.
tr: 'extern diğer ad' bu bağlamda geçerli değil
zh_hans: '“外部别名”在此上下文中无效
zh_hant: 'extern alias' 在此內容中無效

# WRN_IsDynamicIsConfusing
source: Using '{0}' to test compatibility with '{1}' is essentially identical to testing compatibility with '{2}' and will succeed for all non-null values
cs: Použití operátoru {0} pro testování kompatibility s typem {1} je v podstatě totožné s testováním kompatibility s typem {2} a bude úspěšné pro všechny hodnoty, které nejsou null.
de: Die Verwendung von "{0}" zum Testen der Kompatibilität mit "{1}" entspricht grundsätzlich dem Testen der Kompatibilität mit "{2}" und ist für alle Nicht-NULL-Werte erfolgreich.
es: Usar '{0}' para probar la compatibilidad con '{1}' es, básicamente, lo mismo que probar la compatibilidad con '{2}' y surtirá efecto para todos los valores distintos de NULL
fr: L'utilisation de '{0}' pour tester la compatibilité avec '{1}' est fondamentalement identique au test de la compatibilité avec '{2}' et elle aboutit pour toutes les valeurs non null
it: L'uso di '{0}' per la verifica della compatibilità con '{1}' corrisponde in sostanza alla verifica della compatibilità con '{2}' e verrà completato per tutti i valori non Null
ja: '{1}' との互換性をテストするために '{0}' を使用することは、 '{2}' との互換性をテストすることと実質的に同じであり、null 以外のすべての値で成功します
ko: {0}'을(를) 사용한 '{1}' 호환성 테스트는 근본적으로 '{2}' 호환성 테스트와 동일하며 null이 아닌 모든 값에서 성공합니다.
pl: Użycie elementu „{0}” do testowania zgodności z elementem „{1}” jest w zasadzie identyczne z testowaniem zgodności z elementem „{2}” i powiedzie się dla wszystkich wartości innych niż null
pt_br: Usar "{0}" para testar a compatibilidade com "{1}" é essencialmente idêntico testar compatibilidade com "{2}" e terá êxito para todos os valores não-nulos
ru: Использование "{0}" для проверки совместимости с "{1}" равнозначно проверке совместимости с "{2}" и проходит успешно для всех значений, кроме значений Null
tr: {1}' ile uyumluluğu test etmek için '{0}' kullanmak, '{2}' ile uyumluluğu test etmeye önemli ölçüde benzer ve tüm null olmayan değerler için başarılı olacaktır
zh_hans: 使用“{0}”测试与“{1}”的兼容性和测试与“{2}”的兼容性实质上是相同的，且对于所有非 null 值都将成功
zh_hant: 使用 '{0}' 測試與 '{1}' 的相容性，基本上和測試與 '{2}' 的相容性是一樣的，而且對所有非 null 值都會成功

# WRN_IsDynamicIsConfusing_Title
source: Using 'is' to test compatibility with 'dynamic' is essentially identical to testing compatibility with 'Object'
cs: Použití operátoru is pro testování kompatibility s typem dynamic je v podstatě totožné s testováním kompatibility s typem Object.
de: Das Verwenden von 'is' zum Testen der Kompatibilität mit 'dynamic' entspricht im Wesentlichen dem Testen der Kompatibilität mit 'Object'
es: Usar "is" para comprobar la compatibilidad con "dynamic" es idéntico a comprobar la compatibilidad con "Object"
fr: L'utilisation de 'is' pour tester la compatibilité avec 'dynamic' est fondamentalement identique au test de la compatibilité avec 'Object'
it: L'uso di 'is' per la verifica della compatibilità con 'dynamic' corrisponde in sostanza alla verifica della compatibilità con 'Object'
ja: is' を 'dynamic' との互換性をテストするために使用することは、'Object' との互換性をテストすることと実質的に同じです
ko: is'를 사용한 'dynamic' 호환성 테스트는 근본적으로 'Object' 호환성 테스트와 동일합니다.
pl: Testowanie zgodności z typem „dynamic” za pomocą operatora „is” jest zasadniczo identyczne z testowaniem zgodności z typem „Object”
pt_br: Usar 'is' para testar a compatibilidade com 'dynamic' é essencialmente o mesmo que o teste de compatibilidade com 'Object'
ru: Использование is для проверки совместимости с типом dynamic равнозначно проверке совместимости с типом Object
tr: dynamic' ile uyumluluğu test etmek için 'is' kullanmak, 'Object' ile uyumluluğu test etmeye büyük ölçüde benzer
zh_hans: 使用 "is" 测试与 "dynamic" 的兼容性和测试与 "object" 的兼容性实质上是相同的
zh_hant: 使用 'is' 測試與 'dynamic' 的相容性，基本上與測試與 'Object' 的相容性相同

# ERR_YieldNotAllowedInScript
source: Cannot use 'yield' in top-level script code
cs: Příkaz yield se nedá použít v kódu skriptu nejvyšší úrovně.
de: In Skriptcode der obersten Ebene darf "yield" nicht verwendet werden.
es: No se puede usar 'yield' en el código de script de nivel superior
fr: Impossible d'utiliser 'yield' dans du code de script de niveau supérieur
it: Non è possibile usare 'yield' nel codice script di primo livello
ja: 最上位のスクリプト コードで 'yield' を使用することはできません
ko: 최상위 스크립트 코드에서 'yield'를 사용할 수 없습니다.
pl: Nie można użyć instrukcji „yield” w kodzie skryptu najwyższego poziomu
pt_br: Não é possível usar 'yield' no código de script de nível superior
ru: Невозможно использовать "yield" в коде скрипта верхнего уровня
tr: Üst düzey betik kodunda 'yield' kullanılamaz
zh_hans: 无法在顶级脚本代码中使用“yield”
zh_hant: 無法在頂層指令碼中使用 'yield'

# ERR_NamespaceNotAllowedInScript
source: Cannot declare namespace in script code
cs: Obor názvů se nedá deklarovat v kódu skriptu.
de: Sie können einen Namespace nicht im Skriptcode deklarieren.
es: No se puede declarar un espacio de nombres en el código del script
fr: Impossible de déclarer un espace de noms dans le code de script
it: Non è possibile dichiarare lo spazio dei nomi nel codice script
ja: スクリプト コードで名前空間を宣言することはできません
ko: 스크립트 코드에서 네임스페이스를 선언할 수 없습니다.
pl: Nie można zadeklarować przestrzeni nazw w kodzie skryptu
pt_br: Você não pode declarar o namespace no código de script
ru: Невозможно объявить пространство имен в коде скрипта
tr: Betik kodunda ad alanı ifade edilemez
zh_hans: 无法在脚本代码中声明命名空间
zh_hant: 無法在指令碼中宣告命名空間

# ERR_GlobalAttributesNotAllowed
source: Assembly and module attributes are not allowed in this context
cs: Atributy sestavení a modulů nejsou v tomto kontextu povolené.
de: Assembly- und Modulattribute sind in diesem Kontext nicht zulässig.
es: En este contexto no se permiten atributos de ensamblado y módulo
fr: Les attributs d'assembly et de module ne sont pas autorisés dans ce contexte
it: Gli attributi di assembly e modulo non sono consentiti in questo contesto
ja: アセンブリ属性とモジュール属性は、このコンテキストでは許可されていません
ko: 이 컨텍스트에 어셈블리 및 모듈 특성이 허용되지 않습니다.
pl: Atrybuty zestawów i modułów nie są dozwolone w tym kontekście
pt_br: Atributos assembly e module não são permitidos neste contexto
ru: В данном контексте нельзя использовать атрибуты сборки и модуля
tr: Derleme ve modül özniteliklerine bu bağlamda izin verilmiyor
zh_hans: 在此上下文中不允许有程序集和模块特性
zh_hant: 此內容中不可使用組件與模組屬性

# ERR_InvalidDelegateType
source: Delegate '{0}' has no invoke method or an invoke method with a return type or parameter types that are not supported.
cs: Delegát {0} nemá žádnou metodu invoke nebo má jeho metoda invoke nepodporovaný návratový typ nebo typy parametrů.
de: Der Delegat "{0}" weist keine Invoke-Methode oder eine Invoke-Methode mit nicht unterstützten Rückgabe- oder Parametertypen auf.
es: El delegado '{0}' no tiene método 'invoke' o tiene un método 'invoke' con un tipo de valor devuelto o unos tipos de parámetro que no son compatibles.
fr: Le délégué '{0}' n'a pas de méthode invoke ou une méthode invoke avec un type de retour ou des types de paramètre non pris en charge.
it: Il delegato '{0}' non ha metodi Invoke oppure ha un metodo Invoke con un tipo restituito o tipi di parametro non supportati.
ja: デリゲート '{0}' には invoke メソッドがないか、サポートされていない戻り値の型またはパラメーター型の invoke メソッドがあります。
ko: {0}' 대리자에 invoke 메서드가 없거나 지원되지 않는 반환 형식 또는 매개 변수 형식을 사용한 invoke 메서드가 있습니다.
pl: Delegat „{0}” nie ma metody wywołania lub ma metodę wywołania z typem zwracanym lub typami parametrów, które nie są obsługiwane.
pt_br: Delegado "{0}" não tem método invoke ou um método invoke com um tipo de retorno ou tipos de parâmetros que não são suportados.
ru: Делегат "{0}" не содержит метода invoke или метода invoke с возвращаемым типом или типами параметров, которые не поддерживаются.
tr: {0}' temsilcisinin bir çağırma yöntemi yok ya da desteklenmeyen bir dönüş türü veya parametre türleri ile bir çağırma yöntemi var.
zh_hans: 委托“{0}”没有调用方法，或调用方法有不受支持的返回类型或参数类型。
zh_hant: 委派 '{0}' 沒有叫用方法，或是叫用方法包含了不支援的傳回類型或參數類型。

# WRN_MainIgnored
source: The entry point of the program is global code; ignoring '{0}' entry point.
cs: Vstupním bodem programu je globální kód. Vstupní bod {0} se ignoruje.
fr: Le point d'entrée du programme est du code global ; point d'entrée '{0}' ignoré.
it: Il punto di ingresso del programma è codice globale. Il punto di ingresso '{0}' verrà ignorato.
ja: プログラムのエントリ ポイントは、グローバル コードです。エントリ ポイント '{0}' を無視します。
pl: Punkt wejścia programu to kod globalny; punkt wejścia „{0}” jest ignorowany.
pt_br: O ponto de entrada do programa é o código global. Ignorando o ponto de entrada '{0}'.
ru: Точкой входа программы является глобальный код; игнорируется точка входа "{0}".
zh_hans: 程序的入口点是全局代码；将忽略“{0}”入口点。
zh_hant: 程式的進入點是全域程式碼; 將略過 '{0}' 進入點。

# WRN_MainIgnored_Title
source: The entry point of the program is global code; ignoring entry point
cs: Vstupním bodem programu je globální kód. Vstupní bod se ignoruje
fr: Le point d'entrée du programme est du code global ; ce point d'entrée est ignoré
it: Il punto di ingresso del programma è codice globale. Il punto di ingresso verrà ignorato
ja: プログラムのエントリ ポイントがグローバル コード、エントリ ポイントを無視
pl: Punkt wejścia programu to kod globalny; punkt wejścia jest ignorowany
pt_br: O ponto de entrada do programa é o código global. Ignorando o ponto de entrada
ru: Точкой входа программы является глобальный код; игнорируется точка входа
zh_hans: 程序的入口点是全局代码；将忽略此入口点
zh_hant: 程式的進入點是全域程式碼; 將忽略進入點
