Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ExportedTypeConflictsWithDeclaration
source: Type '{0}' exported from module '{1}' conflicts with type declared in primary module of this assembly.
cs: Typ {0} exportovaný z modulu {1} je v konfliktu s typem deklarovaným v primárním modulu tohoto sestavení.
de: Typ "{0}", der aus Modul "{1}" exportiert wurde, steht in Konflikt mit dem Typ, der im primären Modul dieser Assembly deklariert wurde.
es: El tipo '{0}' exportado del módulo '{1}' entra en conflicto con el tipo declarado en el módulo primario de este ensamblado.
fr: Le type '{0}' exporté à partir du module '{1}' est en conflit avec le type déclaré dans le module principal de cet assembly.
it: Il tipo '{0}' esportato dal modulo '{1}' è in conflitto con il tipo dichiarato nel modulo primario di questo assembly.
ja: モジュール '{1}' からエクスポートされた型 '{0}' は、このアセンブリのプライマリ モジュールで宣言した型と競合しています。
ko: {1}' 모듈에서 내보낸 '{0}' 형식이 이 어셈블리의 주 모듈에서 선언된 형식과 충돌합니다.
pl: Typ „{0}” wyeksportowany z modułu „{1}” powoduje konflikt z typem zadeklarowanym w podstawowym module tego zestawu.
pt_br: Tipo "{0}" exportado do módulo "{1}" está em conflito com tipo declarado no módulo primário deste assembly.
ru: Тип "{0}", экспортированный из модуля "{1}", конфликтует с типом, объявленным в основном модуле этой сборки.
tr: {1}' modülünden dışarı aktarılan '{0}' türü, bu derlemenin birinci modülünde ifade edilen tür ile çakışıyor.
zh_hans: 从模块“{1}”导出的类型“{0}”与此程序集主模块中声明的类型冲突。
zh_hant: 從模組 '{1}' 匯出的類型 '{0}' 與此組件的主要模組中所宣告之類型相衝突。

# ERR_ExportedTypesConflict
source: Type '{0}' exported from module '{1}' conflicts with type '{2}' exported from module '{3}'.
cs: Typ {0} exportovaný z modulu {1} je v konfliktu s typem {2} exportovaným z modulu {3}.
de: Typ "{0}", der aus Modul "{1}" exportiert wurden, steht in Konflikt mit Typ "{2}", der aus Modul "{3}" exportiert wurde.
es: El tipo '{0}' exportado del módulo '{1}' entra en conflicto con el tipo '{2}' exportado del módulo '{3}'.
fr: Le type '{0}' exporté à partir du module '{1}' est en conflit avec le type '{2}' exporté à partir du module '{3}'.
it: Il tipo '{0}' esportato dal modulo '{1}' è in conflitto con il tipo '{2}' esportato dal modulo '{3}'.
ja: モジュール '{1}' からエクスポートされた型 '{0}' は、モジュール '{3}' からエクスポートされた型 '{2}' と競合しています。
ko: {1}' 모듈에서 내보낸 '{0}' 형식이 '{3}' 모델에서 내보낸 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” wyeksportowany z modułu „{1}” powoduje konflikt z typem „{2}” wyeksportowanym z modułu „{3}”.
pt_br: Tipo "{0}" exportado do módulo "{1}" está em conflito com tipo "{2}" exportado do módulo "{3}".
ru: Тип "{0}", экспортированный из модуля "{1}", конфликтует с типом "{2}", экспортированным из модуля "{3}".
tr: {1}' modülünden dışarı aktarılan '{0}' türü, '{3}' modülünden dışarı aktarılan '{2}' türü ile çakışıyor.
zh_hans: 从模块“{1}”导出的类型“{0}”与从模块“{3}”导出的类型“{2}”冲突。
zh_hant: 從模組 '{1}' 匯出的類型 '{0}' 與從模組 '{3}' 匯出的類型 '{2}' 相衝突。

# ERR_ForwardedTypeConflictsWithDeclaration
source: Forwarded type '{0}' conflicts with type declared in primary module of this assembly.
cs: Předaný typ {0} je v konfliktu s typem deklarovaným v primárním modulu tohoto sestavení.
de: Der weitergeleitete Typ "{0}" steht in Konflikt mit dem Typ, der im primären Modul dieser Assembly deklariert wurde.
es: El tipo reenviado '{0}' entra en conflicto con el tipo declarado en el módulo primario de este ensamblado.
fr: Le type transmis '{0}' est en conflit avec le type déclaré dans le module principal de cet assembly.
it: Il tipo inoltrato '{0}' è in conflitto con il tipo dichiarato nel modulo primario di questo assembly.
ja: 転送された型 '{0}' は、このアセンブリのプライマリ モジュールで宣言した型と競合しています。
ko: 전달된 '{0}' 형식이 이 어셈블리의 주 모듈에서 선언된 형식과 충돌합니다.
pl: Typ przesłany „{0}” powoduje konflikt z typem zadeklarowanym w podstawowym module tego zestawu.
pt_br: Tipo encaminhado "{0}" está em conflito com o tipo declarado no módulo primário deste assembly.
ru: Отправленный тип "{0}" конфликтует с типом, объявленным в основном модуле этой сборки.
tr: {0}' iletilen türü bu derlemenin birincil modülünde ifade edilen türle çakışıyor.
zh_hans: 转发的类型“{0}”与此程序集主模块中声明的类型冲突。
zh_hant: 轉送的類型 '{0}' 與此組件主要模組中所宣告的類型相衝突。

# ERR_ForwardedTypesConflict
source: Type '{0}' forwarded to assembly '{1}' conflicts with type '{2}' forwarded to assembly '{3}'.
cs: Typ {0} předaný do sestavení {1} je v konfliktu s typem {2} předaným do sestavení {3}.
de: Typ "{0}", der an Assembly "{1}" weitergeleitet wurde, steht in Konflikt mit Typ "{2}", der an Assembly "{3}" weitergeleitet wurde.
es: El tipo '{0}' reenviado al ensamblado '{1}' entra en conflicto con el tipo '{2}' reenviado al ensamblado '{3}'.
fr: Le type '{0}' transmis à l'assembly '{1}' est en conflit avec le type '{2}' transmis à l'assembly '{3}'.
it: Il tipo '{0}' inoltrato all'assembly '{1}' è in conflitto con il tipo '{2}' inoltrato all'assembly '{3}'.
ja: アセンブリ '{1}' に転送された型 '{0}' は、アセンブリ '{3}' に転送された型 '{2}' と競合しています。
ko: {1}' 어셈블리로 전달된 '{0}' 형식이 '{3}' 어셈블리로 전달된 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” przesłany do zestawu „{1}” powoduje konflikt z typem „{2}” przesłanym do zestawu „{3}”.
pt_br: Tipo "{0}" encaminhado para o assembly "{1}" está em conflito com tipo "{2}" encaminhado para o módulo "{3}".
ru: Тип "{0}", отправленный в сборку "{1}", конфликтует с типом "{2}", отправленным в сборку "{3}".
tr: {1}' derlemesine iletilen '{0}' türü, '{3}' derlemesine iletilen '{2}' türü ile çakışıyor.
zh_hans: 转发到程序集“{1}”的类型“{0}”与转发到程序集“{3}”的类型“{2}”冲突。
zh_hant: 轉送到組件 '{1}' 的類型 '{0}' 與轉送到組件 '{3}' 的類型 '{2}' 相衝突。

# ERR_ForwardedTypeConflictsWithExportedType
source: Type '{0}' forwarded to assembly '{1}' conflicts with type '{2}' exported from module '{3}'.
cs: Typ {0} předaný do sestavení {1} je v konfliktu s typem {2} exportovaným z modulu {3}.
de: Typ "{0}", der an Assembly "{1}" weitergeleitet wurde, steht in Konflikt mit Typ "{2}", der aus Modul "{3}" exportiert wurde.
es: El tipo '{0}' reenviado al ensamblado '{1}' entra en conflicto con el tipo '{2}' exportado del módulo '{3}'.
fr: Le type '{0}' transmis à l'assembly '{1}' est en conflit avec le type '{2}' exporté à partir du module '{3}'.
it: Il tipo '{0}' inoltrato all'assembly '{1}' è in conflitto con il tipo '{2}' esportato dal modulo '{3}'.
ja: アセンブリ '{1}' に転送された型 '{0}' は、モジュール '{3}' からエクスポートされた型 '{2}' と競合しています。
ko: {1}' 어셈블리로 전달된 '{0}' 형식이 '{3}'에서 내보낸 '{2}' 형식과 충돌합니다.
pl: Typ „{0}” przesłany do zestawu „{1}” powoduje konflikt z typem „{2}” wyeksportowanym z modułu „{3}”.
pt_br: Tipo "{0}" encaminhado para o assembly "{1}" está em conflito com tipo "{2}" exportado do módulo "{3}".
ru: Тип "{0}", отправленный в сборку "{1}", конфликтует с типом "{2}", экспортированным из модуля "{3}".
tr: {1}' derlemesine iletilen '{0}' türü '{3}' modülünden dışarı aktarılan '{2}' türü ile çakışıyor.
zh_hans: 转发到程序集“{1}”的类型“{0}”与从模块“{3}”导出的类型“{2}”冲突。
zh_hant: 轉送到組件 '{1}' 的類型 '{0}' 與從模組 '{3}' 匯出的類型 '{2}' 相衝突。

# WRN_RefCultureMismatch
source: Referenced assembly '{0}' has different culture setting of '{1}'.
cs: Odkazované sestavení {0} má jiné nastavení jazykové verze {1}.
de: Die referenzierte {0}-Assembly besitzt eine andere Kultureinstellung: "{1}".
es: El ensamblado '{0}' al que se hace referencia tiene una configuración de referencia cultural distinta de '{1}'.
fr: L'assembly référencé '{0}' a un paramètre de culture différent : '{1}'.
it: Le impostazioni cultura dell'assembly '{0}' al quale si fa riferimento sono diverse da '{1}'.
ja: 参照アセンブリ '{0}' には '{1}' の異なるカルチャ設定があります。
ko: 참조된 어셈블리 '{0}'에 다른 '{1}' 문화권 설정이 있습니다.
pl: Przywoływany zestaw „{0}” ma inne ustawienie kultury — „{1}”.
pt_br: Assembly referenciado "{0}" tem a configuração de cultura diferente de "{1}".
ru: Сборка "{0}", на которую дается ссылка, использует другой параметр языка и региональных параметров "{1}".
tr: {0}' başvurulan derlemesinin '{1}' için farklı kültür ayarı var.
zh_hans: 引用程序集“{0}”具有不同区域性设置“{1}”。
zh_hant: 參考組件 '{0}' 有不同的文化特性設定 '{1}'。

# WRN_RefCultureMismatch_Title
source: Referenced assembly has different culture setting
cs: Odkazované sestavení má jiné nastavení jazykové verze.
de: Referenzierte Assembly hat andere Kultureinstellungen
es: El ensamblaje referenciado tiene una configuración de cultura diferente
fr: L'assembly référencé a un paramètre de culture différent
it: Le impostazioni cultura dell'assembly di riferimento sono diverse
ja: 参照されているアセンブリのカルチャ設定が異なります
ko: 참조된 어셈블리의 문화권 설정이 다릅니다.
pl: Przywoływany zestaw ma inne ustawienie kultury
pt_br: O assembly referenciado possui uma configuração de cultura diferente
ru: Сборка, на которую указывает ссылка, содержит другой параметр языка и региональных параметров
tr: Başvurulan derlemenin farklı bir kültür ayarı var
zh_hans: 引用程序集具有不同区域性设置
zh_hant: 參考的組件具有不同文化特性設定

# ERR_AgnosticToMachineModule
source: Agnostic assembly cannot have a processor specific module '{0}'.
cs: Agnostické sestavení nemůže mít modul {0} určený pro konkrétní procesor.
de: Die agnostische Assembly kann kein prozessorspezifisches Modul "{0}" aufweisen.
es: El ensamblado válido no puede tener un módulo específico de procesador '{0}'.
fr: Un assembly agnostique ne peut pas avoir un module '{0}' propre au processeur.
it: Un assembly agnostico non può avere un modulo '{0}' specifico del processore.
ja: 不明なアセンブリにプロセッサ固有モジュール '{0}' を指定することはできません。
ko: 알 수 없는 어셈블리는 프로세서의 특정 모듈('{0}')을 포함할 수 없습니다.
pl: Zestaw agnostyczny nie może mieć modułu specyficznego dla procesora „{0}”.
pt_br: Assembly desconhecido não pode ter um módulo específico de processador "{0}".
ru: Безразмерная сборка не может иметь модуль для конкретного процессора "{0}".
tr: Belirsiz derlemede '{0}' işlemciye özel modül olamaz.
zh_hans: 不可知的程序集不能具有特定于处理器的模块“{0}”。
zh_hant: 無從驗證的組件不可有處理器專屬的模組 '{0}'。

# ERR_ConflictingMachineModule
source: Assembly and module '{0}' cannot target different processors.
cs: Sestavení a modul {0} nemůžou mířit na různé procesory.
de: Die Assembly und das Modul "{0}" können nicht verschiedene Zielprozessoren haben.
es: El ensamblado y el módulo '{0}' no pueden tener como destino procesadores distintos.
fr: L'assembly et le module '{0}' ne peuvent pas cibler des processeurs différents.
it: L'assembly e il modulo '{0}' non possono essere destinati a processori diversi.
ja: アセンブリとモジュール '{0}' で異なるプロセッサを対象にすることはできません。
ko: 어셈블리 및 '{0}' 모듈은 다른 프로세서를 대상으로 할 수 없습니다.
pl: Zestaw i moduł „{0}” nie mogą wskazywać różnych procesorów.
pt_br: Assembly e módulo "{0}" não podem diferentes processadores como destino.
ru: Сборка и модуль "{0}" не могут предназначаться для разных процессоров.
tr: Derleme ve '{0}' modülü farklı işlemcileri hedefleyemez.
zh_hans: 程序集和模块“{0}”不能以不同处理器为目标。
zh_hant: 組件與模組 '{0}' 的目標處理器不可不同。

# WRN_ConflictingMachineAssembly
source: Referenced assembly '{0}' targets a different processor.
cs: Odkazované sestavení {0} míří na jiný procesor.
de: Die Assembly "{0}", auf die verwiesen wird, hat einen anderen Zielprozessor.
es: El ensamblado '{0}' al que se hace referencia está destinado a un procesador diferente.
fr: L'assembly référencé '{0}' cible un processeur différent.
it: L'assembly '{0}' a cui si fa riferimento ha come destinazione un processore diverso.
ja: 参照アセンブリ '{0}' は、異なるプロセッサをターゲットにしています。
ko: 참조된 어셈블리 '{0}'이(가) 다른 프로세서를 대상으로 합니다.
pl: Celem przywołanego zestawu „{0}” jest inny procesor.
pt_br: Assembly referenciado "{0}" destinado a um processador diferente.
ru: Сборка, на которую дана ссылка "{0}", направлена на другой процессор.
tr: {0}' başvurulan derlemesi farklı bir işlemciyi hedef alır.
zh_hans: 引用程序集“{0}”面向的是另一个处理器。
zh_hant: 參考組件 '{0}' 以不同的處理器為目標。

# WRN_ConflictingMachineAssembly_Title
source: Referenced assembly targets a different processor
cs: Odkazované sestavení míří na jiný procesor.
de: Die Assembly, auf die verwiesen wird, hat einen anderen Zielprozessor.
es: El ensamblador al que se hace referencia tiene como objetivo a otro procesador
fr: L'assembly référencé cible un processeur différent
it: L'assembly di riferimento ha come destinazione un processore diverso
ja: 参照アセンブリが異なるプロセッサを対象にしています
ko: 참조된 어셈블리가 다른 프로세서를 대상으로 합니다.
pl: Celem przywołanego zestawu jest inny procesor
pt_br: O assembly referenciado está direcionado a um processador diferente
ru: Сборка, на которую указывает ссылка, предназначена для другого процессора
tr: Başvurulan derleme farklı bir işlemciyi hedefliyor
zh_hans: 引用程序集面向的是另一个处理器
zh_hant: 參考的組件以不同的處理器為目標

# ERR_CryptoHashFailed
source: Cryptographic failure while creating hashes.
cs: Při vytváření čísel hash došlo ke kryptografické chybě.
de: Kryptografischer Fehler bei der Hasherstellung.
es: Error criptográfico al crear hashes.
fr: Échec de chiffrement pendant la création de hachages.
it: Si è verificato un errore di crittografia durante la creazione di hash.
ja: ハッシュを生成中に暗号化に失敗しました。
ko: 해시를 만드는 동안 암호화 오류가 발생했습니다.
pl: Wystąpił błąd kryptograficzny w czasie tworzenia mieszań.
pt_br: Falha na criptografia ao criar valores hashes.
ru: Сбой шифрования при создании хэшей.
tr: Karmalar oluşturulurken şifreleme hatası.
zh_hans: 创建哈希时加密失败。
zh_hant: 建立雜湊時密碼編譯失敗。

# ERR_MissingNetModuleReference
source: Reference to '{0}' netmodule missing.
cs: Chybí odkaz na netmodule {0}.
de: Ein Verweis auf NETMODULE "{0}" fehlt.
es: Falta la referencia al netmodule '{0}'.
fr: Référence à netmodule '{0}' manquante.
it: Manca il riferimento al netmodule '{0}'.
ja: '{0}' netmodule への参照がありません。
ko: {0}' netmodule에 대한 참조가 없습니다.
pl: Brak odwołania do modułu netmodule „{0}”.
pt_br: Referência a "{0}" netmodule ausente.
ru: Отсутствует ссылка на "{0}" netmodule.
tr: {0}' netmodule başvurusu eksik.
zh_hans: 缺少对“{0}”netmodule 的引用。
zh_hant: 遺漏 '{0}' netmodule 的參考。

# ERR_NetModuleNameMustBeUnique
source: Module '{0}' is already defined in this assembly. Each module must have a unique filename.
cs: Modul {0} je už v tomto sestavení definovaný. Každý modul musí mít jedinečný název souboru.
de: Das Modul "{0}" wurde in dieser Assembly bereits definiert. Alle Module müssen einen eindeutigen Dateinamen haben.
es: El módulo '{0}' ya está definido en este ensamblado. Cada módulo debe tener un nombre de archivo único.
fr: Le module '{0}' est déjà défini dans cet assembly. Chaque module doit avoir un nom de fichier unique.
it: Il modulo '{0}' è già definito in questo assembly. Ogni modulo deve avere un nome di file univoco.
ja: モジュール '{0}' は既にこのアセンブリに定義されています。各モジュールには一意のファイル名がある必要があります。
ko: {0}' 모듈이 이 어셈블리에 이미 정의되었습니다. 각 모듈에 고유한 파일 이름이 있어야 합니다.
pl: Moduł „{0}” jest już zdefiniowany w tym zestawie. Nazwa pliku każdego modułu musi być unikatowa.
pt_br: Módulo "{0}" já está definido neste assembly. Cada módulo deve ter um filename exclusivo.
ru: Модуль "{0}" уже определен в этой сборке. Каждый модуль должен иметь уникальное имя.
tr: {0}' modülü bu derlemeden zaten tanımlanmış. Her modülün benzersiz bir dosya adı olmalıdır.
zh_hans: 模块“{0}”已在此程序集中定义。每个模块必须具有唯一的文件名。
zh_hant: 模組 '{0}' 已定義在此組件中。每個模組都必須要有不重複的檔案名稱。

# ERR_CantReadConfigFile
source: Cannot read config file '{0}' -- '{1}'
cs: Nejde přečíst konfigurační soubor {0} -- {1}.
de: Die Konfigurationsdatei "{0}" kann nicht gelesen werden: "{1}"
es: No se puede leer el archivo de configuración '{0}': '{1}'
fr: Impossible de lire le fichier de configuration '{0}' -- '{1}'
it: Non è possibile leggere il file di configurazione '{0}' - '{1}'
ja: 構成ファイル '{0}' を読み取れません -- '{1}'
ko: {0}' 구성 파일을 읽을 수 없습니다. '{1}'
pl: Nie można odczytać pliku konfiguracyjnego „{0}” — „{1}”
pt_br: Não é possível ler o arquivo de configuração "{0}" -- "{1}"
ru: Не удается выполнить чтение файла конфигурации "{0}" — "{1}".
tr: {0}' yapılandırma dosyası okunamıyor -- '{1}'
zh_hans: 无法读取配置文件“{0}”--“{1}”
zh_hant: 無法讀取組態檔 '{0}' -- '{1}'

# ERR_EncNoPIAReference
source: Cannot continue since the edit includes a reference to an embedded type: '{0}'.
cs: Nedá se pokračovat, protože úprava obsahuje odkaz na vložený typ: {0}
de: Die Bearbeitung enthält einen Verweis auf einen eingebetteten Typ und kann daher nicht fortgesetzt werden: "{0}".
es: No se puede continuar porque la edición incluye una referencia a un tipo incrustado: '{0}'.
fr: Impossible de continuer, car la modification inclut une référence à un type incorporé : '{0}'.
it: Non è possibile continuare perché la modifica include un riferimento a un tipo incorporato: '{0}'.
ja: 編集に埋め込み型の '{0}' への参照が含まれるため続行できません。
ko: 편집의 포함된 형식 '{0}'에 대한 참조가 포함되어 있어 계속할 수 없습니다.
pl: Nie można kontynuować, ponieważ edycja zawiera odwołanie do typu osadzonego: „{0}”
pt_br: Não é possível continuar pois a edição inclui uma referência a um tipo incorporado: '{0}'.
ru: Не удается продолжить, так как оператор edit содержит ссылку на встроенный тип: "{0}".
tr: Düzen gömülü bir türe başvuru içerdiğinden devam edilemiyor: '{0}'.
zh_hans: 无法继续，因为编辑包括对嵌入类型的引用:“{0}”。
zh_hant: 無法繼續，因為編輯包含內嵌類型的參考: '{0}'。

# ERR_EncReferenceToAddedMember
source: Member '{0}' added during the current debug session can only be accessed from within its declaring assembly '{1}'.
cs: Ke členu {0} přidanému během aktuální relace ladění se dá přistupovat jenom z jeho deklarovaného sestavení {1}.
de: Auf das während der aktuellen Debuggingsitzung hinzugefügte Element "{0}" kann nur aus der deklarierenden Assembly "{1}" heraus zugegriffen werden.
es: Al miembro '{0}' agregado durante la sesión de depuración actual solo se puede acceder desde el ensamblado donde se declara, '{1}'.
fr: Le membre '{0}' ajouté durant la session de débogage actuelle est uniquement accessible à partir de son assembly de déclaration '{1}'.
it: Il membro '{0}' aggiunto durante la sessione di debug corrente è accessibile solo dall'interno dell'assembly '{1}' in cui viene dichiarato.
ja: 現在のデバッグ セッション中に追加されたメンバー '{0}' には、宣言しているアセンブリ '{1}' からのみアクセスできます。
ko: 현재 디버그 세션 중에 추가되는 '{0}' 멤버는 해당 선언 어셈블리 '{1}' 내에서만 액세스할 수 있습니다.
pl: Dostęp do składowej „{0}” dodanej podczas bieżącej sesji debugowania można uzyskać tylko w deklarowanym zestawie „{1}”.
pt_br: Membro '{0}' adicionado durante a sessão de depuração atual pode ser acessado somente neste assembly de declaração '{1}'.
ru: Доступ к члену "{0}", добавленному в ходе текущего сеанса отладки, возможен только из его объявляющей сборки "{1}".
tr: Geçerli hata ayıklama oturumu sırasında eklenen '{0}' üyesine, yalnızca bildirme derlemesi '{1}' içinden erişilebilir.
zh_hans: 在当前调试会话期间添加的成员“{0}”只能从其声明的程序集“{1}”中访问。
zh_hant: 在目前偵錯工作階段期間加入的成員 '{0}'，只能從其宣告組件中 '{1}' 存取。

# ERR_MutuallyExclusiveOptions
source: Compilation options '{0}' and '{1}' can't both be specified at the same time.
cs: Možnosti kompilace {0} a {1} se nedají zadat současně.
de: Die Kompilierungsoptionen "{0}" und "{1}" dürfen nicht gleichzeitig verwendet werden.
es: No se pueden especificar a la vez las opciones de compilación '{0}' y '{1}'.
fr: Les options de compilation '{0}' et '{1}' ne peuvent pas être spécifiées toutes les deux en même temps.
it: Non è possibile specificare contemporaneamente le opzioni di compilazione '{0}' e '{1}'.
ja: コンパイル オプション '{0}' と '{1}' の両方を同時に指定することはできません。
ko: 컴파일 옵션 '{0}'과(와) '{1}'을(를) 동시에 지정할 수 없습니다.
pl: Nie można równocześnie określić opcji kompilacji „{0}” i „{1}”.
pt_br: As opções de compilação '{0}' e '{1}' não podem ser especificadas ao mesmo tempo.
ru: Параметры компиляции "{0}" и "{1}" невозможно использовать одновременно.
tr: {0}' ve '{1}' derleme seçenekleri aynı anda belirtilemez.
zh_hans: 无法同时指定编译选项“{0}”和“{1}”。
zh_hant: 不得同時指定編輯選項 '{0}' 與 '{1}'。

# ERR_LinkedNetmoduleMetadataMustProvideFullPEImage
source: Linked netmodule metadata must provide a full PE image: '{0}'.
cs: Propojená metadata netmodule musí poskytovat plnou image PE: {0}.
de: Verknüpfte NETMODULE-Metadaten müssen ein vollständiges PE-Abbild bereitstellen: "{0}".
es: El metadato netmodule vinculado debe proporcionar una imagen PE completa: '{0}'.
fr: Les métadonnées netmodule liées doivent fournir une image PE complète : '{0}'.
it: I metadati del netmodule collegato devono fornire un'immagine PE completa: '{0}'.
ja: リンクされた netmodule メタデータには完全な PE イメージ '{0}' が必要です。
ko: 링크된 netmodule 메타데이터는 전체 PE 이미지를 제공해야 합니다. '{0}'
pl: Połączone metadane modułu netmodule muszą określać pełny obraz PE: „{0}”.
pt_br: Metadados netmodule vinculados devem fornecer uma imagem completa de PE: "{0}".
ru: Связанные метаданные netmodule должны обеспечивать полный образ PE: '{0}'.
tr: Bağlantılı netmodule meta verileri tam bir PE görüntüsü sağlamalıdır: '{0}'.
zh_hans: 链接 netmodule 元数据必须提供完整 PE 映像:“{0}”。
zh_hant: 連結的 netmodule 中繼資料必須提供完整的 PE 影像: '{0}'。

# ERR_BadPrefer32OnLib
source: /platform:anycpu32bitpreferred can only be used with /t:exe, /t:winexe and /t:appcontainerexe
cs: Možnost /platform:anycpu32bitpreferred jde použít jenom s možnostmi /t:exe, /t:winexe a /t:appcontainerexe.
de: /platform:anycpu32bitpreferred kann nur mit /t:exe, /t:winexe und /t:appcontainerexe verwendet werden.
es: /platform:anycpu32bitpreferred solamente se puede usar con /t:exe, /t:winexe y /t:appcontainerexe
fr: /platform:anycpu32bitpreferred ne peut être utilisé qu'avec /t:exe, /t:winexe et /t:appcontainerexe
it: /platform:anycpu32bitpreferred può essere usato solo con /t:exe, /t:winexe e /t:appcontainerexe
ja: /platform:anycpu32bitpreferred は、/t:exe、/t:winexe、/t:appcontainerexe でのみ使用できます
ko: /platform:anycpu32bitpreferred는 /t:exe, /t:winexe 및 /t:appcontainerexe에서만 사용할 수 있습니다.
pl: /platform:anycpu32bitpreferred można używać tylko z /t:exe, /t:winexe i /t:appcontainerexe
pt_br: /platform:anycpu32bitpreferred pode apenas ser usado com /t:exe, /t:winexe e /t:appcontainerexe
ru: /platform:anycpu32bitpreferred может использоваться только вместе с /t:exe, /t:winexe and /t:appcontainerexe
tr: /platform:anycpu32bitpreferred yalnızca /t:exe, /t:winexe ve /t:appcontainerexe ile kullanılabilir
zh_hans: /platform:anycpu32bitpreferred 只能与 /t:exe、/t:winexe 和 /t:appcontainerexe 一起使用
zh_hant: /platform:anycpu32bitpreferred 只可與 /t:exe、/t:winexe 和 /t:appcontainerexe 一起使用

# IDS_PathList
source: <path list>
cs: <seznam cest>
de: <Pfadliste>
es: <lista de rutas de acceso>
fr: <liste de chemins d'accès>
it: <elenco percorsi>
ko: <경로 목록>
pl: <lista ścieżek>
pt_br: <lista de caminho>
ru: <список путей>
zh_hans: <路径列表>
zh_hant: <路徑清單>

# IDS_Text
source: <text>
es: <texto>
fr: <texte>
it: <testo>
ko: <텍스트>
pl: <tekst>
pt_br: <texto>
ru: <текст>
zh_hans: <文本>
zh_hant: <文字>

# IDS_FeatureNullPropagatingOperator
source: null propagating operator
cs: operátor šířící null
de: Null-progagierender Operator
es: operador de propagación nulo
fr: opérateur de propagation null
it: operatore di propagazione Null
ja: Null を反映する演算子
ko: null 전파 연산자
pl: operator propagowania wartości null
pt_br: operador de propagação nula
ru: оператор, распространяющий значения Null
tr: null yayılma işleci
zh_hans: 空传播运算符
zh_hant: null 散佈運算子

# IDS_FeatureExpressionBodiedMethod
source: expression-bodied method
cs: metoda s výrazem v těle
de: Ausdruckskörpermethode
es: método con forma de expresión
fr: méthode expression-bodied
it: metodo con corpo di espressione
ja: 式のようなメソッド
ko: 식 본문 메서드
pl: metoda z wyrażeniem w treści
pt_br: método apto para expressão
ru: метод, воплощающий выражение
tr: ifade gövdeli yöntem
zh_hans: expression-bodied 方法
zh_hant: 運算式主體方法

# IDS_FeatureExpressionBodiedProperty
source: expression-bodied property
cs: vlastnost s výrazem v těle
de: Ausdruckskörpereigenschaft
es: propiedad con forma de expresión
fr: propriété expression-bodied
it: proprietà con corpo di espressione
ja: 式のようなプロパティ
ko: 식 본문 속성
pl: właściwość z wyrażeniem w treści
pt_br: propriedade apta para expressão
ru: свойство, воплощающее выражение
tr: ifade gövdeli özellik
zh_hans: expression-bodied 属性
zh_hant: 運算式主體屬性
