Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NullabilityMismatchInParameterTypeOfTargetDelegate
source: Nullability of reference types in type of parameter '{0}' of '{1}' doesn't match the target delegate '{2}'.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters "{0}" von "{1}" entspricht nicht dem Zieldelegaten "{2}".
es: La nulabilidad de los tipos de referencia del tipo de parámetro "{0}" de "{1}" no coincide con el delegado de destino "{2}".
ko: '{1}'의 '{0}' 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 '{2}' 대상 대리자와 일치하지 않습니다.
tr: '{1}' öğesinin '{0}' parametre türündeki başvuru türlerinin boş değer atanabilirliği '{2}' hedef temsilcisi ile eşleşmiyor.

# WRN_NullabilityMismatchInParameterTypeOfTargetDelegate_Title
source: Nullability of reference types in type of parameter doesn't match the target delegate.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters entspricht nicht dem Zieldelegaten.
es: La nulabilidad de los tipos de referencia del tipo de parámetro no coincide con el delegado de destino
ko: 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 대상 대리자와 일치하지 않습니다.
tr: Parametre türündeki başvuru türlerinin boş değer atanabilirliği hedef temsilci ile eşleşmiyor.

# WRN_NullabilityMismatchInReturnTypeOfTargetDelegate
source: Nullability of reference types in return type of '{0}' doesn't match the target delegate '{1}'.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp von "{0}" entspricht nicht dem Zieldelegaten "{1}".
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto de "{0}" no coincide con el delegado de destino "{1}".
ko: '{0}'의 반환 형식에 있는 참조 형식 Null 허용 여부가 '{1}' 대상 대리자와 일치하지 않습니다.
tr: '{0}' dönüş türündeki başvuru türlerinin boş değer atanabilirliği '{1}' hedef temsilcisi ile eşleşmiyor.

# WRN_NullabilityMismatchInReturnTypeOfTargetDelegate_Title
source: Nullability of reference types in return type doesn't match the target delegate.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem Zieldelegaten.
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el delegado de destino
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 대상 대리자와 일치하지 않습니다.
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği hedef temsilci ile eşleşmiyor.

# WRN_ParameterConditionallyDisallowsNull
source: Parameter '{0}' may not have a null value when exiting with '{1}'.
de: Der Parameter "{0}" darf beim Beenden mit "{1}" keinen NULL-Wert aufweisen.
es: El parámetro "{0}" no puede tener un valor NULL al salir con "{1}".
ko: '{1}'(으)로 종료할 때 '{0}' 매개 변수에 null 값을 사용할 수 없습니다.

# WRN_ParameterConditionallyDisallowsNull_Title
source: Parameter may not have a null value when exiting in some condition.
de: Der Parameter darf keinen NULL-Wert aufweisen, wenn er in einer Bedingung beendet wird.
es: El parámetro no puede tener un valor NULL al salir en alguna condición.
ko: 일부 조건으로 종료할 때 매개 변수에 null 값을 사용할 수 없습니다.

# WRN_SwitchExpressionNotExhaustive
source: The switch expression does not handle all possible values of its input type (it is not exhaustive).
de: Der switch-Ausdruck verarbeitet nicht alle möglichen Werte des zugehörigen Eingabetyps (nicht umfassend).
es: La expresión switch no controla todos los valores posibles de su tipo de entrada (no es exhaustiva).
ko: switch 식에서 입력 형식의 가능한 값을 모두 처리하지는 않습니다(전체 아님).
tr: Switch ifadesi giriş türünün tüm olası değerlerini işlemiyor. (İfade tam kapsamlı değil.)

# WRN_SwitchExpressionNotExhaustiveForNull
source: The switch expression does not handle some null inputs (it is not exhaustive).
de: Der switch-Ausdruck verarbeitet einige NULL-Eingaben nicht (nicht umfassend).
es: La expresión switch no controla algunas entradas de tipo NULL (no es exhaustiva).
ko: switch 식은 일부 null 입력을 처리하지 않습니다(전체 아님).
tr: Switch ifadesi bazı null girişleri işlemiyor (tam kapsamlı değil).

# WRN_UninitializedNonNullableField
source: Non-nullable {0} '{1}' is uninitialized. Consider declaring the {0} as nullable.
de: {0} "{1}" lässt keine NULL-Werte zu und ist nicht initialisiert. {0} sollte als "Nullable" deklariert werden.
es: La instancia de {0} "{1}" que acepta valores NULL está sin inicializar. Considere la posibilidad de declarar la instancia de {0} como capaz de aceptar valores NULL.
ko: null을 허용하지 않는 {0} '{1}'이(가) 초기화되지 않았습니다. {0}을(를) nullable로 선언하는 것이 좋습니다.
tr: Null değer atanamayan {0} '{1}' başlatılmadı. {0} alanını null değer atanabilir olarak tanımlamayı deneyin.

# WRN_UninitializedNonNullableField_Title
source: Non-nullable field is uninitialized. Consider declaring as nullable.
de: Das Non-Nullable-Feld ist nicht initialisiert. Deklarieren Sie das Feld ggf. als "Nullable".
es: El campo que acepta valores NULL está sin inicializar. Considere la posibilidad de declararlo como que acepta valores NULL.
ko: null을 허용하지 않는 필드가 초기화되지 않았습니다. nullable로 선언하는 것이 좋습니다.
tr: Null değer atanamayan alan başlatılmadı. Bunu null değer atanabilir olarak tanımlamayı deneyin.

# ERR_BadOpOnNullOrDefault
source: Operator '{0}' cannot be applied to operand '{1}'
de: Der Operator "{0}" kann nicht auf den Operanden "{1}" angewendet werden.
es: El operador "{0}" no se puede aplicar al operando del tipo "{1}"
ko: {0}' 연산자는 '{1}' 피연산자에 적용할 수 없습니다.
tr: {0}' işleci '{1}' türündeki işlenene uygulanamaz

# ERR_AmbigBinaryOpsOnDefault
source: Operator '{0}' is ambiguous on operands 'default' and 'default'
de: Der Operator "{0}" ist mehrdeutig bei den Operanden "default" und "default".
es: El operador "{0}" es ambiguo en los operandos "default" y "default"
ko: {0}' 연산자가 모호하여 'default' 및 'default' 피연산자에 사용할 수 없습니다.
tr: {0}' işleci 'default' ve 'default' işlenenlerinde belirsiz

# WRN_NewRequired_Description
source: A variable was declared with the same name as a variable in a base class. However, the new keyword was not used. This warning informs you that you should use new; the variable is declared as if new had been used in the declaration.
de: Eine Variable wurde mit demselben Namen deklariert wie eine Variable in einer Basisklasse. Das new-Schlüsselwort wurde jedoch nicht verwendet. Diese Warnung informiert Sie darüber, dass Sie "new" verwenden müssen; die Variable wird deklariert, als wäre "new" in der Deklaration verwendet worden.
es: Se declaró una variable con el mismo nombre como una variable en la clase base. Sin embargo, la nueva palabra clave no está en uso. Esta advertencia le informa de que debería usar new. La variable se declaró como si new se hubiera usado en la declaración.
ko: 변수가 기본 클래스의 변수와 동일한 이름으로 선언되었습니다. 그러나 new 키워드가 사용되지 않았습니다. 이 경고는 new를 사용해야 하므로 선언에 new가 사용된 경우처럼 변수가 선언됨을 알려줍니다.
tr: Temel sınıftaki değişken ile aynı adlı bir değişken bildirildi. Ancak, yeni anahtar sözcük kullanılmadı. Bu uyarı yeniyi kullanmanız gerektiğini bildirir; değişken bildirimde yeni kullanılmış gibi bildirildi.

# ERR_StaticNotVirtual
source: A static member '{0}' cannot be marked as override, virtual, or abstract
de: Ein statischer Member "{0}" kann nicht als "override" , "virtual" oder "abstract" markiert werden.
es: Un miembro estático '{0}' no se puede marcar como invalidación, virtual o abstracto
ko: {0}' 정적 멤버는 override, virtual 또는 abstract로 표시할 수 없습니다.
tr: {0}' statik üyesi geçersiz kılınan, sanal veya soyut olarak işaretlenemez

# ERR_NamespaceUnexpected
source: A namespace cannot directly contain members such as fields or methods
de: Member, wie z. B. Felder oder Methoden, können nicht direkt in einem Namespace enthalten sein.
es: Un espacio de nombres no puede contener directamente miembros como campos o métodos.
ko: 네임스페이스는 필드나 메서드와 같은 멤버를 직접 포함할 수 없습니다.
tr: Ad uzayı, alanlar veya yöntemler gibi üyeleri doğrudan içeremez

# ERR_NoNewAbstract
source: Cannot create an instance of the abstract class or interface '{0}'
de: Es konnte keine Instanz der abstrakten Klasse oder Schnittstelle "{0}" erstellt werden.
es: No se puede crear una instancia de la clase o interfaz abstracta '{0}'
ko: {0}' 추상 클래스 또는 인터페이스의 인스턴스를 만들 수 없습니다.
tr: Soyut sınıfın veya '{0}' arabiriminin bir örneği oluşturulamıyor

# ERR_CircularBase
source: Circular base class dependency involving '{0}' and '{1}'
de: Basisklassen-Ringabhängigkeit zwischen "{0}" und "{1}"
es: Dependencia de clase base circular que requiere '{0}' y '{1}'
ko: {0}' 및 '{1}'과(와) 관련된 순환 기본 클래스 종속성입니다.
tr: {0}' ve '{1}' ile ilişkili döngüsel temel sınıf bağımlılığı

# ERR_UnassignedThis
source: Field '{0}' must be fully assigned before control is returned to the caller
de: Das Feld "{0}" muss vollständig zugewiesen werden, bevor die Steuerung wieder an den Aufrufer übergeben wird.
es: El campo '{0}' debe estar totalmente asignado antes de que se devuelva el control al llamador
ko: 제어를 호출자에게 반환하려면 '{0}' 필드가 완전히 할당되어야 합니다.
tr: {0}' alanı denetim çağrı yapana döndürülmeden önce tamamen atanmalıdır

# ERR_UseDefViolationThis
source: The 'this' object cannot be used before all of its fields are assigned to
de: Das this-Objekt kann erst verwendet werden, wenn alle Felder zugewiesen wurden.
es: El objeto 'this' no se puede utilizar antes de que se hayan asignado todos sus campos
ko: 모든 필드에 값을 할당하기 전에는 'this' 개체를 사용할 수 없습니다.
tr: this' nesnesi, alanlarının tümüne atama yapılmadan kullanılamaz

# ERR_RefProperty
source: A property or indexer may not be passed as an out or ref parameter
de: Eine Eigenschaft oder ein Indexer kann nicht als out- oder ref-Parameter übergeben werden.
es: Una propiedad o un indizador no se puede pasar como parámetro out o ref
ko: 속성 또는 인덱서는 out 또는 ref 매개 변수로 전달할 수 없습니다.
tr: Bir özellik veya dizin erişimcisi, out veya ref parametresi olarak geçilemez

# ERR_ParamsLast
source: A params parameter must be the last parameter in a formal parameter list
de: Ein params-Parameter muss der letzte Parameter in einer formellen Parameterliste sein.
es: Un parámetro params debe ser el último parámetro de una lista de parámetros formales
ko: params 매개 변수는 정식 매개 변수 목록에서 마지막에 있어야 합니다.
tr: Bir params parametresi resmi bir parametre listesindeki son parametre olmalıdır

# ERR_CallingBaseFinalizeDeprecated
source: Do not directly call your base class Finalize method. It is called automatically from your destructor.
de: Rufen Sie die Finalize-Methode Ihrer Basisklasse nicht direkt auf, da sie automatisch vom Destruktor aufgerufen wird.
es: No llame directamente al método Finalize de la clase base. Se llama automáticamente desde el destructor.
ko: 기본 클래스 Finalize 메서드를 직접 호출하지 마세요. 이 메서드는 소멸자에서 자동으로 호출됩니다.
tr: Temel sınıf Finalize yönteminizi doğrudan çağırmayın. Yıkıcınızdan otomatik olarak çağrılır.

# ERR_VarargsLast
source: An __arglist parameter must be the last parameter in a formal parameter list
de: Ein __arglist-Parameter muss der letzte Parameter in einer formellen Parameterliste sein.
es: El parámetro __arglist debe ser el último en una lista de parámetros formales
ko: __arglist 매개 변수는 정식 매개 변수 목록의 마지막에 있어야 합니다.
tr: Bir __arglist parametresi, biçimsel parametre listesindeki son parametre olmalıdır

# ERR_PartialTypeKindConflict
source: Partial declarations of '{0}' must be all classes, all structs, or all interfaces
de: Partielle Deklarationen von "{0}" müssen entweder nur Klassen, nur Strukturen oder nur Schnittstellen sein.
es: Las declaraciones parciales de '{0}' deben ser todas clases, todas estructuras o todas interfaces
ko: {0}'의 partial 선언은 모두 클래스, 구조체 또는 인터페이스여야 합니다.
tr: {0}' öğesinin kısmi bildirimlerinin tümü sınıf, tümü yapı ya da tümü arabirim olmalıdır

# ERR_PartialMisplaced
source: The 'partial' modifier can only appear immediately before 'class', 'struct', 'interface', or 'void'
de: Der "partial"-Modifizierer kann nur unmittelbar vor "class", "struct", "interface" oder "void" verwendet werden.
es: El modificador 'partial' solo puede aparecer inmediatamente antes de 'class', 'struct', 'interface' o 'void'
ko: partial' 한정자는 'class', 'struct', 'interface' 또는 'void' 바로 앞에만 올 수 있습니다.
tr: partial' değiştiricisi yalnızca 'class', 'struct', 'interface' veya 'void' sözcüklerinden hemen önce gelebilir

# ERR_ImportedCircularBase
source: Imported type '{0}' is invalid. It contains a circular base class dependency.
de: Der importierte Typ "{0}" ist ungültig. Er enthält eine Basisklassen-Ringabhängigkeit.
es: El tipo importado '{0}' no es válido. Contiene una dependencia de clase base circular.
ko: 가져온 '{0}' 형식이 잘못되었습니다. 이 형식에는 기본 클래스 순환 종속성이 포함되어 있습니다.
tr: İçeri aktarılan '{0}' türü geçersiz. Döngüsel temel sınıf bağımlılığı içeriyor.

# WRN_PatternStaticOrInaccessible
source: '{0}' does not implement the '{1}' pattern. '{2}' is either static or not public.
de: '"{0}" implementiert das Muster "{1}" nicht. "{2}" ist entweder statisch oder nicht öffentlich.
es: '{0}' no implementa el patrón '{1}'. '{2}' es estático o no público.
ko: '{0}'이(가) '{1}' 패턴을 구현하지 않습니다. '{2}'이(가) public이 아니거나 static입니다.
tr: '{0}', '{1}' kalıbını uygulamaz. '{2}' statik veya ortak değil.

# WRN_PatternStaticOrInaccessible_Title
source: Type does not implement the collection pattern; member is either static or not public
de: Der Typ implementiert nicht das Sammlungsmuster. Das Element ist statisch oder nicht öffentlich.
es: El tipo no implementa la trama de colección. El miembro es estático o no es público
ko: 형식은 컬렉션 패턴을 구현하지 않습니다. 멤버가 public이 아니거나 static입니다.
tr: Tür koleksiyon desenini uygulamaz, üye statik veya genel değil

# ERR_AttributeCantBeGeneric
source: Cannot apply attribute class '{0}' because it is generic
de: Die Attributklasse "{0}" kann nicht angewendet werden, da sie generisch ist.
es: No se puede aplicar la clase de atributo '{0}' porque es genérica
ko: 제네릭이므로 '{0}' 특성 클래스를 적용할 수 없습니다.
tr: Genel olduğundan '{0}' öznitelik sınıfı uygulanamaz

# ERR_AbstractSealedStatic
source: '{0}': an abstract class cannot be sealed or static
de: '"{0}": Eine abstrakte Klasse kann nicht versiegelt oder statisch sein.
es: '{0}': una clase abstracta no puede estar sellada ni ser estática
ko: '{0}': 추상 클래스는 sealed 또는 static일 수 없습니다.
tr: '{0}': bir soyut sınıfı korumalı veya statik olamaz

# ERR_SealedStaticClass
source: '{0}': a class cannot be both static and sealed
de: '"{0}": Eine Klasse kann nicht gleichzeitig statisch und versiegelt sein.
es: '{0}': una clase no puede ser estática y sellada
ko: '{0}': 클래스는 static이면서 sealed일 수 없습니다.
tr: '{0}': bir sınıf hem statik hem korumalı olamaz

# ERR_RefValBoundMustBeFirst
source: The 'class' or 'struct' constraint must come before any other constraints
de: Die class- oder struct-Einschränkung muss vor allen anderen Einschränkungen stehen.
es: Las restricciones 'class' o 'struct' deben preceder a cualquier otra restricción
ko: class' 또는 'struct' 제약 조건은 다른 모든 제약 조건보다 앞에 와야 합니다.
tr: class' veya 'struct' kısıtlaması diğer kısıtlamalardan önce gelmelidir

# ERR_AttributeCtorInParameter
source: Cannot use attribute constructor '{0}' because it is has 'in' parameters.
de: Der Attributkonstruktor "{0}" kann nicht verwendet werden, weil er in-Parameter aufweist.
es: No se puede utilizar el constructor del atributo "{0}" porque tiene parámetros "in".
ko: 특성 생성자 '{0}'은(는) 'in' 매개 변수가 있으므로 사용할 수 없습니다.
tr: 'in' parametrelerine sahip olduğundan '{0}' öznitelik oluşturucusu kullanılamıyor.

# ERR_AbstractInConcreteClass
source: '{0}' is abstract but it is contained in non-abstract class '{1}'
de: '"{0}" ist abstrakt, ist aber in der nicht abstrakten Klasse "{1}" enthalten.
es: '{0}' es abstracto pero está contenido en la clase no abstracta '{1}'
ko: '{0}'은(는) 추상이지만 비추상 클래스인 '{1}'에 포함되어 있습니다.
tr: '{0}' soyut ancak soyut olmayan '{1}' sınıfında bulunuyor

# ERR_ExplicitInterfaceImplementationInNonClassOrStruct
source: '{0}': explicit interface declaration can only be declared in a class, struct or interface
de: {0}: Eine explizite Schnittstellendeklaration kann nur in einer Klasse, einer Struktur oder einer Schnittstelle erfolgen.
es: "{0}": la declaración explícita de la interfaz solo se puede declarar en una clase, estructura o interfaz
ko: '{0}': 명시적 인터페이스 선언은 클래스, 구조체 또는 인터페이스에서만 선언할 수 있습니다.
tr: '{0}': açık arabirim bildirimi yalnızca bir sınıf, yapı birimi veya arabirim içinde bildirilebilir

# ERR_NewVirtualInSealed
source: '{0}' is a new virtual member in sealed class '{1}'
de: '"{0}" ist ein neuer virtueller Member in einer versiegelten Klasse "{1}".
es: '{0}' es un nuevo miembro virtual en una clase sellada '{1}'
ko: '{0}'은(는) 봉인 클래스 '{1}'의 새 가상 멤버입니다.
tr: '{0}', '{1}' korumalı sınıfındaki yeni sanal üyedir

# ERR_ConversionWithBase
source: '{0}': user-defined conversions to or from a base class are not allowed
de: '"{0}": Benutzerdefinierte Konvertierungen in eine oder aus einer Basisklasse sind nicht zulässig.
es: '{0}': no se permiten conversiones definidas por el usuario ni a una clase base ni desde ella
ko: '{0}': 인터페이스(로)부터의 사용자 정의 변환은 허용되지 않습니다.
tr: '{0}': temel sınıfa veya temel sınıftan kullanıcı tanımlı dönüştürmelere izin verilmiyor

# ERR_ConversionWithDerived
source: '{0}': user-defined conversions to or from a derived class are not allowed
de: '"{0}": Benutzerdefinierte Konvertierungen in eine oder aus einer abgeleiteten Klasse sind nicht zulässig.
es: '{0}': no se permiten conversiones definidas por el usuario ni a una clase derivada ni desde ella
ko: '{0}': 파생 클래스(로)부터의 사용자 정의 변환은 허용되지 않습니다.
tr: '{0}': türetilmiş sınıfa veya türetilmiş sınıftan kullanıcı tanımlı dönüştürmelere izin verilmiyor

# ERR_IdentityConversion
source: User-defined operator cannot take an object of the enclosing type and convert to an object of the enclosing type
de: Ein benutzerdefinierter Operator kann kein Objekt vom einschließenden Typ übernehmen oder in ein Objekt des einschließenden Typs konvertieren.
es: Un operador definido por el usuario no puede adquirir un objeto de tipo envolvente ni convertirlo en un objeto de tipo envolvente
ko: 사용자 정의 연산자는 바깥쪽 형식의 개체를 가져와서 바깥쪽 형식의 개체로 변환할 수 없습니다.
tr: Kullanıcı tanımlı işleç kapsayan türdeki bir nesneyi alamaz ve kapsayan türdeki bir nesneye dönüştüremez

# ERR_BadShiftOperatorSignature
source: The first operand of an overloaded shift operator must have the same type as the containing type, and the type of the second operand must be int
de: Der erste Operand eines überladenen Schiebeoperators muss den enthaltenden Typ aufweisen, und der zweite Operand muss eine ganze Zahl sein.
es: El primer operando de un operador de desplazamiento sobrecargado debe tener el mismo tipo que el tipo contenedor, y el tipo del segundo operando debe ser int
ko: 오버로드된 시프트 연산자의 첫 번째 피연산자는 포함하는 형식과 동일한 형식이어야 하며 두 번째 피연산자는 정수 형식이어야 합니다.
tr: Tekrar yüklenen kaydırma işlecinin ilk işleneninin türü kapsayan tür ile aynı, ikinci işlenenin türü de tamsayı olmalıdır

# ERR_StructsCantContainDefaultConstructor
source: Structs cannot contain explicit parameterless constructors
de: Strukturen können keine expliziten parameterlosen Konstruktoren enthalten.
es: Los structs no pueden contener constructores explícitos sin parámetros
ko: 구조체는 매개 변수가 없는 명시적 생성자를 포함할 수 없습니다.
tr: Yapı birimleri parametresi olmayan açık oluşturucular içeremez

# ERR_FieldInitializerInStruct
source: '{0}': cannot have instance property or field initializers in structs
de: '"{0}": Instanzenfeld- oder -eigenschaftsinitialisierer können sich nicht in Strukturen befinden.
es: '{0}': no se pueden tener propiedades de instancia o inicializadores de campo en estructuras
ko: '{0}': 구조체에는 인스턴스 속성 또는 이니셜라이저를 사용할 수 없습니다.
tr: '{0}': struct'larda örnek özellik veya alan başlatıcıları olamaz

# ERR_BadDestructorName
source: Name of destructor must match name of class
de: Der Name des Destruktors muss mit dem Namen der Klasse übereinstimmen.
es: El nombre del destructor debe coincidir con el nombre de la clase
ko: 소멸자 이름은 클래스 이름과 일치해야 합니다.
tr: Yıkıcının adı sınıfın adıyla eşleşmelidir

# ERR_ConditionalOnSpecialMethod
source: The Conditional attribute is not valid on '{0}' because it is a constructor, destructor, operator, or explicit interface implementation
de: Das Conditional-Attribut ist für "{0}" nicht gültig, weil es sich hierbei um einen Konstruktor, einen Destruktor, einen Operator oder eine explizite Schnittstellenimplementierung handelt.
es: El atributo Conditional no es válido en '{0}' porque es un constructor, destructor, operador o la implementación de interfaz explícita
ko: {0}'에는 생성자, 소멸자, 연산자 또는 명시적 인터페이스 구현이기 때문에 Conditional 특성이 유효하지 않습니다.
tr: Oluşturucu, yıkıcı, işleç veya açık arabirim uygulaması olduğundan Conditional özniteliği '{0}' üzerinde geçerli değil

# WRN_ProtectedInSealed
source: '{0}': new protected member declared in sealed class
de: '"{0}": In der versiegelten Klasse wurde ein neuer geschützter Member deklariert.
es: '{0}': nuevo miembro protegido declarado en clase sellada
ko: '{0}': sealed 클래스에 새 protected 멤버가 선언되었습니다.
tr: '{0}': yeni korunan üye korumalı sınıfta belirtildi

# WRN_ProtectedInSealed_Title
source: New protected member declared in sealed class
de: Neues geschütztes Element deklariert in versiegelter Klasse
es: Nuevo miembro protegido declarado en la clase sealed
ko: sealed 클래스에 새 protected 멤버가 선언되었습니다.
tr: Korumalı sınıfta bildirilen yeni korunan üye

# ERR_GenericDerivingFromAttribute
source: A generic type cannot derive from '{0}' because it is an attribute class
de: Ein generischer Typ kann nicht von "{0}" abgeleitet werden, da dies eine Attributklasse ist.
es: Un tipo genérico no puede derivar de '{0}' porque es una clase de atributos
ko: {0}'은(는) 특성 클래스이므로 제네릭 형식을 파생시킬 수 없습니다.
tr: {0}' bir öznitelik sınıfı olduğu için genel tür buradan türetilemiyor

# ERR_LookupInTypeVariable
source: Cannot do member lookup in '{0}' because it is a type parameter
de: In "{0}" kann kein Memberlookup ausgeführt werden, da es sich um einen Typparameter handelt.
es: No se pueden buscar miembros en '{0}' porque es un parámetro de tipo
ko: {0}'은(는) 형식 매개 변수이므로 멤버를 조회할 수 없습니다.
tr: {0}' bir tür parametresi olduğundan burada üye araması yapılamıyor

# ERR_CloseUnimplementedInterfaceMemberStatic
source: '{0}' does not implement interface member '{1}'. '{2}' cannot implement an interface member because it is static.
de: '"{0}" implementiert den Schnittstellenmember "{1}" nicht. "{2}" ist statisch und kann daher keinen Schnittstellenmember implementieren.
es: '{0}' no implementa el miembro de interfaz '{1}'. '{2}' no puede implementar un miembro de interfaz porque es estático.
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다. '{2}'은(는) static이므로 인터페이스 멤버를 구현할 수 없습니다.
tr: '{0}, '{1}' arabirim üyesini uygulamıyor. '{2}' statik olduğundan bir arabirim üyesi uygulayamaz.

# ERR_PartialMethodInvalidModifier
source: A partial method cannot have access modifiers or the virtual, abstract, override, new, sealed, or extern modifiers
de: Eine partielle Methode darf keine Zugriffsmodifizierer oder die Modifizierer "virtual", "abstract", "override", "new", "sealed" oder "extern" enthalten.
es: Un método parcial no puede tener modificadores de acceso ni los modificadores virtual, abstracto, invalidación, nuevo, sellado o externo
ko: 부분 메서드(Partial Method)에는 액세스 한정자 또는 virtual, abstract, override, new, sealed나 extern 한정자를 사용할 수 없습니다.
tr: Kısmi bir yöntemin erişim değiştiricileri ya da virtual, abstract, override, new, sealed veya extern değiştiricileri olamaz

# ERR_PartialMethodOnlyInPartialClass
source: A partial method must be declared within a partial class, partial struct, or partial interface
de: Eine partielle Methode muss innerhalb einer partiellen Klasse, einer partiellen Struktur oder einer partiellen Schnittstelle deklariert sein.
es: Un método parcial debe declararse dentro de una clase parcial, una estructura parcial o una interfaz parcial
ko: 부분 메서드(Partial method)는 partial 클래스, partial 구조체 또는 partial 인터페이스 내에 선언해야 합니다.
tr: Kısmi bir yöntemin kısmi bir sınıf, kısmi bir yapı veya kısmi bir arabirim içinde bildirilmesi gerekir
