Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_MultipleRuntimeImplementationMatches_Description
source: This warning can be generated when two interface methods are differentiated only by whether a particular parameter is marked with ref or with out. It is best to change your code to avoid this warning because it is not obvious or guaranteed which method is called at runtime. Although C# distinguishes between out and ref, the CLR sees them as the same. When deciding which method implements the interface, the CLR just picks one. Give the compiler some way to differentiate the methods. For example, you can give them different names or provide an additional parameter on one of them.
cs: Toto varování se může vygenerovat, když jsou dvě metody rozhraní odlišené jenom tím, že určitý parametr je označený jednou jako ref a podruhé jako out. Doporučuje se kód změnit tak, aby k tomuto varování nedocházelo, protože není úplně jasné nebo zaručené, která metoda se má za běhu vyvolat. Ačkoli C# rozlišuje mezi out a ref, pro CLR je to totéž. Při rozhodování, která metoda má implementovat rozhraní, modul CLR prostě jednu vybere. Poskytněte kompilátoru nějaký způsob, jak metody rozlišit. Můžete například zadat různé názvy nebo k jedné z nich přidat parametr navíc.
de: Diese Warnung kann generiert werden, wenn sich zwei Schnittstellenmethoden nur dain unterscheiden, ob ein bestimmter Parameter mit Verweis oder Ausgabe markiert wird. Am besten ändern Sie Ihren Code, um diese Warnung zu vermeiden, da es nicht offensichtlich ist und nicht sichergestellt werden kann, welche Methode zur Laufzeit aufgerufen wird. Obwohl C# zwischen Ausgabe und Verweis unterscheidet, sieht CLR da keinen Unterschied. Bei der Entscheidung welche Methode die Schnittstelle implementiert, wählt CLR nur eine aus. Unterstützen Sie den Compiler bei der Unterscheidung zwischen den Methoden. Dazu können Sie beispielsweise unterschiedliche Namen vergeben oder einen zusätzlichen Parameter angeben.
es: Esta advertencia puede producirse cuando dos métodos de interfaz solo se diferencian por la marca de un parámetro particular con ref o out. Es mejor cambiar su código para evitar esta advertencia porque no es obvio ni se garantiza qué método se llamará en el tiempo de ejecución. A pesar de que C# distingue entre out y ref, el CLR los ve como iguales. Cuando decida qué método implementa la interfaz, el CLR escoge uno. Indique al compilador alguna forma de diferenciar los métodos. Por ejemplo, puede darles nombres diferentes o dar un parámetro adicional a uno de ellos.
fr: Cet avertissement peut être généré lorsque deux méthodes d'interface sont uniquement différenciées si un paramètre particulier est marqué avec ref ou avec out. Nous vous recommandons de modifier votre code pour éviter cet avertissement, car la méthode appelée au démarrage n'est ni évidente, ni garantie. Même si le langage C# permet de faire la différence entre out et ref, ce n'est pas le cas pour le CLR. Lors du choix de la méthode d'implémentation de l'interface, le CLR en sélectionne simplement une. Permettez au compilateur de différencier les méthodes. Par exemple, vous pouvez leur donner différents noms ou fournir un paramètre supplémentaire à l'une d'elles.
it: Questo avviso può essere visualizzato quando due metodi di interfaccia si differenziano solo per il fatto che un determinato parametro sia contrassegnato con ref o con out. È consigliabile modificare il codice per evitare la visualizzazione di questo avviso perché non è ovvio o garantito quale metodo venga effettivamente chiamato in fase di esecuzione. Anche in C# viene fatta distinzione tra out e ref, in CLR questi metodi sono considerati uguali. Quando si decide il metodo che implementa l'interfaccia, in CLR ne viene semplicemente scelto uno. Impostare il compilatore in modo tale da distinguere i metodi, ad esempio assegnando loro nomi diversi o specificando un parametro aggiuntivo per uno di essi.
ja: この警告は、2 つのインターフェイス メソッドが、特定のパラメーターが ref または out に設定されているかどうかのみで区別されている場合に生成されます。この警告を回避するには、コードを変更することが最善です。これは、実行時にどのメソッドが呼び出されるかが明確でないか、保証されていないためです。 C# では out と ref を区別しますが、CLR では同じと認識します。インターフェイスを実装するメソッドを決定する際、CLR がどちらか 1 つを選択します。 コンパイラにメソッドを区別する方法を与えます。たとえば、メソッドに異なる名前を付けたり、1 つのメソッドに追加のパラメーターを設けるなどです。
ko: 이 경고는 두 인터페이스 메서드에서 특정 매개 변수가 ref로 표시되는지 out으로 표시되는지 여부만 다른 경우에 생성될 수 있습니다. 런타임에 호출되는 메서드가 명확하거나 보장되지 않으므로 이 경고를 방지하도록 코드를 변경하는 것이 좋습니다. C#에서는 out과 ref를 구분하지만 CLR에서는 동일한 것으로 간주합니다. 따라서 인터페이스를 구현할 메서드를 결정할 때 CLR에서는 하나만 선택합니다. 컴파일러에서 두 메서드를 구분할 수 있는 몇 가지 방법을 지정하세요. 예를 들어 다른 이름을 지정하거나 둘 중 하나에 대해 추가 매개 변수를 제공할 수 있습니다.
pl: To ostrzeżenie może zostać wygenerowane, gdy dwie metody interfejsu różnią się tylko oznaczeniem określonego parametru specyfikatorem ref lub out. Aby zapobiec występowaniu tego ostrzeżenia, zmień kod, ponieważ nie można jednoznacznie określić ani zagwarantować, która metoda zostanie wywołana w czasie wykonywania. Język C# rozróżnia specyfikatory out i ref, jednak dla środowiska CLR są one takie same. Wybiera ono dowolny z nich podczas określania, która metoda zawiera implementację interfejsu. Musisz umożliwić kompilatorowi rozróżnienie metod. Możesz na przykład nadać im różne nazwy lub określić dla jednej z nich dodatkowy parametr.
pt_br: Esse aviso pode ser gerado quando dois métodos de interface são diferenciados somente por se um determinado parâmetro é marcado com ref ou out. É aconselhável alterar o código para evitar este aviso porque não fica óbvio ou garantido qual método é chamado no runtime. Embora C# faça a distinção entre out e ref, o CLR os vê da mesma forma. Ao decidir qual método implementa a interface, o CLR simplesmente escolhe um deles. Forneça ao compilador alguma forma de diferenciar os métodos. Por exemplo, você pode dar-lhes nomes diferentes ou fornecer um parâmetro adicional em um deles.
ru: Это предупреждение может быть создано, если два метода интерфейса различаются только по тому, помечен ли конкретный параметр как ref или как out. Рекомендуется изменить код, чтобы избежать этого предупреждения, так как неочевидно, какой метод вызывается во время выполнения, и вызов нужного метода не гарантируется. Хотя C# разделяет параметры out и ref, спецификация CLR не видит отличий и выбирает случайный метод, реализующий интерфейс. Предоставьте компилятору способ различения методов. Например, можно дать им разные имена или указать дополнительный параметр в одном из них.
tr: Bu uyarı iki arabirim yöntemi yalnızca özel bir parametrenin ref veya out ile işaretlenip işaretlenmediğine göre ayrıştırıldığında oluşturulabilir. Çalışma zamanında hangi yöntemin çağrıldığını kesin olmadığından veya garanti edilmediğinden, bu uyarıdan kaçınmak için kodunuzu değiştirmeniz en iyi çözümdür. C# out ve ref'i ayırsa da, CLR ikisini aynı görür. Hangi yöntemin arabirimi kapsadığına karar verirken, CLR yalnızca birini seçer. Derleyiciye yöntemleri ayrıştırma yolu verin. Örneğin, bunlara farklı adlar verebilir veya içlerinden biri için ek parametre sağlayabilirsiniz.
zh_hans: 两个接口方法的唯一区别是特定参数是标记为 ref 还是 out 时，可能会生成此警告。最好更改代码以避免此警告，因为运行时调用的方法不明显或不受保证。 虽然 C# 可区分 out 和 ref，但是 CLR 会将它们视为相同的。 决定实现接口的方法时，CLR 只选取一个。 为编译器提供某种方式来区分方法。例如，可以为它们提供不同名称或对其中之一提供附加参数。
zh_hant: 當兩介面方法的差異只在於特定參數的標記方式是 ref 還是 out 時，便可能產生此警告。因為在執行階段所呼叫方法既不明顯，也沒辦法預先確認，所以最好變更程式碼來避免此警告。 雖然 C# 會區分 out 與 ref，但是 CLR 會將它們視為相同。決定實作介面的方法時，CLR 只會選擇其中一個。 請為編譯器提供呼叫方法的區分方式。例如，您可以為它們指定不同的名稱，或在其上提供其他參數。

# WRN_MultipleRuntimeOverrideMatches
source: Member '{1}' overrides '{0}'. There are multiple override candidates at run-time. It is implementation dependent which method will be called. Please use a newer runtime.
cs: Člen {1} přepisuje člen {0}. Za běhu existuje více kandidátů na přepis. Volaná metoda závisí na konkrétní implementaci. Použijte prosím novější modul runtime.
fr: Le membre '{1}' se substitue à '{0}'. Il existe plusieurs candidats à la substitution au moment de l'exécution. La méthode appelée dépend de l'implémentation. Utilisez un runtime plus récent.
it: Il membro '{1}' esegue l'override di '{0}'. In fase di esecuzione sono presenti più candidati per l'override. Il metodo che verrà chiamato dipende dall'implementazione. Usare un runtime più recente.
ja: メンバー '{1}' は '{0}' をオーバーライドします。実行時にオーバーライドされる可能性のある候補は複数あります。どのメソッドが呼び出されるかは実装に依存しています。より新しいランタイムを使用してください。
pl: Składowa „{1}” przesłania element „{0}”. W czasie wykonywania jest możliwych wiele różnych przesłonięć. Od implementacji zależy, która metoda zostanie wywołana. Użyj nowszego środowiska uruchomieniowego.
pt_br: O membro '{1}' substitui '{0}. Há vários candidatos a substituição no runtime. O método que será chamado depende da implementação. Use um runtime mais recente.
ru: Элемент "{1}" переопределяет "{0}". Во время выполнения появляется множество кандидатов на переопределение. Реализация зависит от того, какой метод будет вызван. Используйте более позднюю версию среды выполнения.
zh_hans: 成员“{1}”重写“{0}”。在运行时有多个重写候选项。此实现取决于将要调用的方法。请使用较新的运行时。
zh_hant: 成員 '{1}' 會覆寫 '{0}'。在執行階段有多個覆寫候選項。呼叫的方法視實作而定。請使用較新的執行階段。

# WRN_MultipleRuntimeOverrideMatches_Title
source: Member overrides base member with multiple override candidates at run-time
cs: Člen za běhu přepíše základního člena s více kandidáty na přepsání.
de: Element überschreibt Basiselement mit mehreren Überschreibungskandidaten zur Laufzeit
es: El miembro invalida los miembros base con varios candidatos de invalidación en el tiempo de ejecución
fr: Un membre remplace un membre de base avec plusieurs candidats à la substitution au moment de l'exécution
it: Il membro esegue l'override del membro di base con più candidati di override in fase di esecuzione
ja: メンバーは、実行時に複数のオーバーライド候補がある基本メンバーをオーバーライドします
ko: 멤버가 런타임에 여러 재정의 후보로 기본 멤버를 재정의합니다.
pl: Składowa przesłania podstawową składową za pomocą wielu możliwych przesłonięć w czasie wykonywania
pt_br: O membro substitui o membro base com vários candidatos à substituição no tempo de execução
ru: Член переопределяет базовый член с помощью нескольких кандидатов переопределения во время выполнения
tr: Üye, çalışma zamanında birden çok geçersiz kılma adayı ile temel üyeyi geçersiz kılar
zh_hans: 成员在运行时使用多个重写候选项重写基成员
zh_hant: 成員會在執行階段覆寫具有多個覆寫候選項的基底成員

# ERR_ObjectOrCollectionInitializerWithDelegateCreation
source: Object and collection initializer expressions may not be applied to a delegate creation expression
cs: Výrazy inicializátoru objektu a kolekce nejde použít na výraz vytvářející delegáta.
de: Objekt- und Sammlungsinitialisiererausdrücke dürfen nicht auf einen Delegaterstellungsausdruck angewendet werden.
es: No se pueden aplicar expresiones de inicializador de objeto y colección a una expresión de creación de delegado
fr: Les expressions d'initialiseur d'objet et de collection ne peuvent pas être appliquées à une expression de création de délégué
it: Le espressioni dell'inizializzatore di oggetto e di raccolta non possono essere applicate a un'espressione di creazione del delegato
ja: オブジェクトとコレクションの初期化子式は、デリゲートの作成式には適用できません
ko: 개체 및 컬렉션 이니셜라이저 식은 대리자 생성 식에 적용할 수 없습니다.
pl: Nie można zastosować wyrażeń inicjatora obiektu i kolekcji do wyrażenia tworzenia delegata
pt_br: As expressões de objeto e de inicializador de coleção não podem ser aplicadas a uma expressão de criação de representante
ru: Выражения, инициализирующие коллекцию и объект, не могут быть применены к выражению создания делегата
tr: Nesne ve koleksiyon başlatıcı ifadeleri temsilci oluşturma ifadesine uygulanamaz
zh_hans: 对象和集合初始值设定项表达式不能应用于委托创建表达式
zh_hant: 物件與集合初始設定式運算式不可套用到委派建立運算式

# ERR_InvalidConstantDeclarationType
source: '{0}' is of type '{1}'. The type specified in a constant declaration must be sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, an enum-type, or a reference-type.
cs: {0} je typu {1}. V deklaraci konstanty musí být uvedený typ sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, výčtový typ nebo typ odkazu.
de: '"{0}" ist vom Typ "{1}". In einer Konstantendeklaration muss als Typ "sbyte", "byte", "short", "ushort", "int", "uint", "long", "ulong", "char", "float", "double", "decimal", "bool", "string", ein Enumerationstyp oder ein Verweistyp angegeben werden.
es: '{0}' es de tipo '{1}'. El tipo especificado en una declaración de constantes debe ser sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, un tipo de enumeración o un tipo de referencia.
fr: '{0}' est de type '{1}'. Le type spécifié dans une déclaration de constante doit être sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, un type enum ou un type référence.
it: '{0}' è di tipo '{1}'. Il tipo specificato in una dichiarazione di costante deve essere sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, enum-type o reference-type.
ja: '{0}' は型 '{1}' です。定数宣言で指定される型は sbyte、byte、short、ushort、int、uint、long、ulong、char、float、double、decimal、bool、string、列挙型、または参照型でなければなりません。
ko: '{0}'의 형식이 '{1}'입니다. 상수 선언에 지정되는 형식은 sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, enum-type 또는 reference-type이어야 합니다.
pl: 'Element „{0}” jest typu „{1}”. W deklaracji stałej należy określić typ sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, typ wyliczeniowy lub typ odwołania.
pt_br: "{0}" é do tipo "{1}". O tipo especificado em uma declaração constante deve ser sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, cadeia de caracteres, um tipo enum ou um tipo de referência.
ru: "{0}" является типом "{1}". Тип, заданный в объявлении константы, должен быть sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string, типом enum или ссылочным.
tr: '{0}', '{1}' türüne sahip. Sabit bir bildirimde belirtilen tür sbyte, byte, short, ushort, int, uint, long, ulong, char, float, double, decimal, bool, string bir sabit listesi türü veya bir başvuru türü olmalıdır.
zh_hans: “{0}”的类型为“{1}”。在常量声明中指定的类型必须为 sbyte、byte、short、ushort、int、uint、long、ulong、char、float、double、decimal、bool、string、枚举类型或引用类型。
zh_hant: '{0}' 為類型 '{1}'。常數宣告中指定的類型，必須為 sbyte、byte、short、ushort、int、uint、long、ulong、char、float、double、decimal、bool、string、列舉類型或參考類型。

# ERR_FileNotFound
source: Source file '{0}' could not be found.
cs: Zdrojový soubor {0} se nenašel.
de: Quelldatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de origen '{0}'.
fr: Fichier source '{0}' introuvable.
it: Il file di origine '{0}' non è stato trovato.
ja: ソース ファイル '{0}' が見つかりませんでした。
ko: {0}' 소스 파일을 찾을 수 없습니다.
pl: Nie można znaleźć pliku źródłowego „{0}”.
pt_br: Arquivo de origem "{0}" não pode ser encontrado.
ru: Не удалось найти исходный файл "{0}".
tr: {0}' kaynak dosyası bulunamadı.
zh_hans: 未能找到源文件“{0}”。
zh_hant: 找不到原始程式檔 '{0}'。

# WRN_FileAlreadyIncluded
source: Source file '{0}' specified multiple times
cs: Zdrojový soubor {0} je zadaný několikrát.
de: Quelldatei "{0}" mehrmals angegeben.
es: El archivo de código fuente '{0}' se especificó varias veces
fr: Fichier source '{0}' indiqué plusieurs fois
it: Il file di origine '{0}' è specificato più volte
ja: ソース ファイル '{0}' が複数回指定されました
ko: {0}' 소스 파일을 여러 번 지정했습니다.
pl: Plik źródłowy „{0}” jest określony wiele razy
pt_br: Arquivo de origem "{0}" especificado várias vezes
ru: Исходный файл "{0}" задан несколько раз.
tr: {0}' kaynak dosyası birden çok kez belirtildi
zh_hans: 源文件“{0}”指定了多次
zh_hant: 已指定多次原始程式檔 '{0}'

# WRN_FileAlreadyIncluded_Title
source: Source file specified multiple times
cs: Zdrojový soubor je zadaný několikrát.
de: Die Quelldatei wurde mehrere Male angegeben.
es: Se especificó el archivo de origen varias veces
fr: Le fichier source a été spécifié plusieurs fois
it: Il file di origine è specificato più volte
ja: ソース ファイルが複数回指定されました
ko: 소스 파일이 여러 번 지정되었습니다.
pl: Plik źródłowy został określony wiele razy
pt_br: Arquivo de origem especificado várias vezes
ru: Исходный файл указан несколько раз
tr: Kaynak dosya birden çok kez belirtildi
zh_hans: 多次指定源文件
zh_hant: 已指定多次原始程式檔

# ERR_NoFileSpec
source: Missing file specification for '{0}' option
cs: Pro možnost {0} chybí specifikace souboru.
de: Fehlende Dateispezifikation für die Option "{0}".
es: Falta la especificación de archivo de la opción '{0}'
fr: Spécification de fichier manquante pour l'option '{0}'
it: Manca la specifica del file per l'opzione '{0}'
ja: '{0}' オプションのファイルが指定されていません
ko: {0}' 옵션에 대한 파일 사양이 없습니다.
pl: Brak specyfikacji pliku dla opcji „{0}”
pt_br: Falta a especificação de arquivo para "{0}" opção
ru: Отсутствует спецификация файла для параметра "{0}"
tr: {0}' seçeneği için dosya özelliği eksik
zh_hans: “{0}”选项缺少文件规范
zh_hant: 遺漏 '{0}' 選項的檔案規格

# ERR_SwitchNeedsString
source: Command-line syntax error: Missing '{0}' for '{1}' option
cs: Chyba syntaxe příkazového řádku: Nenašla se hodnota {0} pro možnost {1}.
de: Befehlszeilen-Syntaxfehler: In der Option "{1}" fehlt "{0}".
es: Error de sintaxis de línea de comandos: falta '{0}' para la opción '{1}'
fr: Erreur de syntaxe de ligne de commande : '{0}' manquant pour l'option '{1}'
it: Errore nella sintassi della riga di comando: manca '{0}' per l'opzione '{1}'
ja: コマンドラインの構文エラー: オプション '{1}' の '{0}' がありません。
ko: 명령줄 구문 오류: '{0}' 옵션에 대한 '{1}'이(가) 없습니다.
pl: Błąd składni wiersza polecenia: brak elementu „{0}” dla opcji „{1}”
pt_br: Erro de sintaxe de linha de comando: "{0}" ausente para a opção "{1}"
ru: Ошибка в синтаксисе командной строки: Отсутствует "{0}" для параметра "{1}".
tr: Komut satırı sözdizimi hatası: '{1}' seçeneği için '{0}' eksik
zh_hans: 命令行语法错误:“{1}”选项缺少“{0}”
zh_hant: 命令列語法錯誤: 遺漏 '{1}' 選項的 '{0}'

# ERR_BadSwitch
source: Unrecognized option: '{0}'
cs: Nerozpoznaná možnost: {0}
de: Unbekannte Option: "{0}"
es: Opción no reconocida: '{0}'
fr: Option non reconnue : '{0}'
it: Opzione non riconosciuta: '{0}'
ja: 認識されないオプション:'{0}'
ko: 인식할 수 없는 옵션: '{0}'
pl: Nierozpoznana opcja: „{0}”
pt_br: Opção não reconhecida: "{0}"
ru: Нераспознанный параметр: "{0}"
tr: Tanınmayan seçenek: '{0}'
zh_hans: 无法识别的选项: “{0}”
zh_hant: 選項無法辨認: '{0}'

# WRN_NoSources
source: No source files specified.
cs: Nejsou zadané žádné zdrojové soubory.
de: Es wurden keine Quelldateien angegeben.
es: No se especificaron archivos de código fuente.
fr: Aucun fichier source spécifié.
it: Non sono stati specificati file di origine.
ja: ソース ファイルが指定されていません。
ko: 소스 파일을 지정하지 않았습니다.
pl: Nie określono plików źródłowych.
pt_br: Nenhum arquivo de origem especificado.
ru: Не указаны файлы с исходным кодом.
tr: Hiçbir kaynak dosya belirtilmedi.
zh_hans: 未指定源文件。
zh_hant: 未指定任何原始程式檔。

# WRN_NoSources_Title
source: No source files specified
cs: Nejsou zadané žádné zdrojové soubory.
de: Es wurden keine Quelldateien angegeben.
es: No se especificaron archivos de origen
fr: Aucun fichier source spécifié
it: Non sono stati specificati file di origine
ja: ソース ファイルが指定されていません
ko: 소스 파일을 지정하지 않음
pl: Nie określono plików źródłowych
pt_br: Nenhum arquivo de origem especificado
ru: Не указаны исходные файлы
tr: Hiçbir kaynak dosya belirtilmedi
zh_hans: 未指定源文件
zh_hant: 未指定任何原始程式檔

# ERR_ExpectedSingleScript
source: Expected a script (.csx file) but none specified
cs: Očekával se skript (soubor .csx), žádný ale není zadaný.
de: Es wurde eine Skriptdatei (CSX-Datei) erwartet, aber es wurde keine Datei angegeben.
es: Se esperaba un script (archivo .csx), pero no se especificó ninguno
fr: Un script est attendu (fichier .csx), mais aucun n'est spécifié
it: È previsto uno script (file con estensione csx) ma non ne è stato specificato nessuno
ja: スクリプト (.csx ファイル) が必要ですが、指定されていません
ko: 스크립트(.csx 파일)가 필요하지만 지정되지 않았습니다.
pl: Oczekiwano skryptu (plik CSX), ale go nie określono
pt_br: Era esperado um script (arquivo .csx), mas não há scripts especificados
ru: Ожидался скрипт (CSX-файл), но ни один не был указан
tr: Bir betik (.csx dosyası) bekleniyordu, ancak hiç belirtilmedi
zh_hans: 需要一个脚本 (.csx file) 文件，但并未指定
zh_hant: 必須是指令碼 (.csx 檔)，但未指定

# ERR_OpenResponseFile
source: Error opening response file '{0}'
cs: Chyba při otevírání souboru odpovědí {0}
de: Fehler beim Öffnen der Antwortdatei "{0}".
es: Error al abrir el archivo de respuesta '{0}'
fr: Erreur lors de l'ouverture du fichier réponse '{0}'
it: Si è verificato un errore durante l'apertura del file di risposta '{0}'
ja: 応答ファイル '{0}' を開いているときにエラーが発生しました
ko: {0}' 지시 파일을 여는 동안 오류가 발생했습니다.
pl: Błąd podczas otwierania pliku odpowiedzi „{0}”
pt_br: Erro ao abrir arquivo de resposta "{0}"
ru: Ошибка при открытии файла ответа "{0}"
tr: {0}' yanıt dosyası açılırken hata
zh_hans: 打开响应文件“{0}”时出错
zh_hant: 開啟回應檔 '{0}' 時發生錯誤

# ERR_CantOpenFileWrite
source: Cannot open '{0}' for writing -- {1}
fr: Nous ne pouvons pas ouvrir « {0} » en écriture -- {1}
it: Non è possibile aprire '{0}' per la scrittura -- {1}
pt_br: Não foi possível abrir "{0}" para escrever — {1}
ru: Не удается открыть "{0}" для записи — {1}
zh_hans: 无法打开“{0}”以进行写入 - {1}

# ERR_BadBaseNumber
source: Invalid image base number '{0}'
cs: Neplatné základní číslo obrázku {0}
de: Ungültige Bildbasisnummer "{0}"
es: El número base de la imagen '{0}' no es válido
fr: Numéro de base d'image non valide '{0}'
it: '{0}' non è un numero di base dell'immagine valido
ja: イメージの基数 '{0}' が無効です
ko: 잘못된 '{0}' 이미지 기준 번호입니다.
pl: Nieprawidłowy numer podstawowy obrazu „{0}”
pt_br: Número base de imagem inválido "{0}"
ru: Недопустимый номер базы образа "{0}'
tr: Geçersiz görüntü tabanı numarası '{0}'
zh_hans: 图像基数“{0}”无效
zh_hant: 映像基底編號 '{0}' 無效

# ERR_BinaryFile
source: '{0}' is a binary file instead of a text file
cs: {0} je binární, ne textový soubor.
de: '"{0}" ist eine Binärdatei und keine Textdatei.
es: '{0}' es un archivo binario en vez de uno de texto
fr: '{0}' est un fichier binaire et non un fichier texte
it: '{0}' è un file binario e non un file di testo
ja: '{0}' はテキスト ファイルではなくバイナリ ファイルです
ko: '{0}'은(는) 텍스트 파일이 아니라 이진 파일입니다.
pl: 'Plik „{0}” jest plikiem binarnym, a nie plikiem tekstowym
pt_br: "{0}" é um arquivo binário em vez de um arquivo de texto
ru: "{0}" является двоичным файлом, а не текстовым.
tr: '{0}' bir metin dosyası yerine bir ikili dosyadır
zh_hans: “{0}”是二进制文件而非文本文件
zh_hant: '{0}' 是二進位檔案而非文字檔

# FTL_BadCodepage
source: Code page '{0}' is invalid or not installed
cs: Znaková stránka {0} je neplatná nebo není nainstalovaná.
de: Die Codepage "{0}" ist ungültig oder nicht installiert.
es: La página de código '{0}' no es válida o no está instalada
fr: La page de '{0}' n'est pas correcte ou n'est pas installée
it: La tabella codici '{0}' non è valida o non è installata
ja: コード ページ '{0}' は無効か、インストールされていません
ko: {0}' 코드 페이지가 잘못되었거나 설치되지 않았습니다.
pl: Strona kodowa „{0}” jest nieprawidłowa lub niezainstalowana
pt_br: Página de código "{0}" é inválida ou não está instalada
ru: Кодовая страница "{0}" является недопустимой или не установлена.
tr: {0}' kod sayfası geçersiz veya yüklü değil
zh_hans: 代码页“{0}”无效或未安装
zh_hant: 字碼頁 '{0}' 無效或未安裝

# FTL_BadChecksumAlgorithm
source: Algorithm '{0}' is not supported
cs: Algoritmus {0} není podporovaný.
de: Algorithmus "{0}" wird nicht unterstützt
es: No se admite el algoritmo '{0}'
fr: Algorithme '{0}' non pris en charge
it: L'algoritmo '{0}' non è supportato
ja: アルゴリズム '{0}' はサポートされていません
ko: {0}' 알고리즘은 지원되지 않습니다.
pl: Algorytm „{0}” nie jest obsługiwany
pt_br: Algoritmo '{0}' sem suporte
ru: Алгоритм "{0}" не поддерживается
tr: {0}' algoritması desteklenmiyor
zh_hans: 不支持算法“{0}”
zh_hant: 不支援演算法 '{0}'
