Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_OptionalParamValueMismatch_Title
source: The default parameter value does not match in the target delegate type.
cs: Výchozí hodnota parametru neodpovídá v cílovém typu delegáta.
fr: La valeur du paramètre par défaut ne correspond pas au type délégué cible.
it: Il valore del parametro predefinito non corrisponde al tipo delegato di destinazione.
ja: 既定のパラメーター値がターゲット デリゲート型と一致しません。
pl: Domyślna wartość parametru nie jest zgodna w docelowym typie delegata.
pt_br: O valor do parâmetro padrão não corresponde ao tipo delegado de destino.
ru: Значение параметра по умолчанию не совпадает с типом целевого делегата.
zh_hans: 默认参数值在目标委托类型中不匹配。
zh_hant: 目標委派類型中的預設參數值不相符。

# WRN_OverridingDifferentRefness
source: Reference kind modifier of parameter '{0}' doesn't match the corresponding parameter '{1}' in overridden or implemented member.
fr: Le modificateur de genre de référence du paramètre « {0} » ne correspond pas au paramètre « {1} » correspondant dans le membre implémenté ou remplacé.
it: Il modificatore del tipo di riferimento del parametro '{0}' non corrisponde al parametro corrispondente '{1}' nel membro sovrascritto o implementato.
ja: パラメーター '{0}' の参照の種類修飾子が、オーバーライドされたメンバーまたは実装されるメンバーの対応するパラメーター '{1}' と一致しません。
pl: Modyfikator rodzaju odwołania parametru „{0}” nie jest zgodny z odpowiednim parametrem „{1}” w przesłoniętej lub zaimplementowanej składowej.
pt_br: O modificador de tipo de referência do parâmetro '{0}' não corresponde ao parâmetro '{1}' correspondente no membro substituído ou implementado.
ru: Модификатор типа ссылки параметра "{0}" не совпадает с соответствующим параметром "{1}" в переопределенном или реализованном элементе.
zh_hans: 参数“{0}”的引用类型修饰符与已替代或实现的成员中的相应参数“{1}”不匹配。
zh_hant: 參數 '{0}' 的參考種類修飾元不符合已覆寫或已實作成員中的對應參數 '{1}'。

# WRN_OverridingDifferentRefness_Title
source: Reference kind modifier of parameter doesn't match the corresponding parameter in overridden or implemented member.
fr: Le modificateur de genre de référence du paramètre ne correspond pas au paramètre correspondant dans le membre implémenté ou remplacé.
it: Il modificatore del tipo di riferimento del parametro non corrisponde al parametro corrispondente nel membro sovrascritto o implementato.
ja: パラメーターの参照の種類修飾子が、オーバーライドされたメンバーまたは実装されたメンバーの対応するパラメーターと一致しません。
pl: Modyfikator rodzaju odwołania parametru nie jest zgodny z odpowiednim parametrem w przesłoniętej lub zaimplementowanej składowej.
pt_br: O modificador de tipo de referência do parâmetro não corresponde ao parâmetro correspondente no membro substituído ou implementado.
ru: Модификатор типа ссылки параметра не совпадает с соответствующим параметром в переопределенном или реализованном элементе.
zh_hans: 参数的引用类型修饰符与已替代或实现的成员中的相应参数不匹配。
zh_hant: 參數的參考種類修飾元不符合已覆寫或已實作成員中的對應參數。

# WRN_ParameterNotNullIfNotNull
source: Parameter '{0}' must have a non-null value when exiting because parameter '{1}' is non-null.
cs: Parametr {0} musí mít při ukončení hodnotu jinou než null, protože parametr {1} není null.
fr: Le paramètre '{0}' doit avoir une valeur non null au moment de la sortie, car le paramètre '{1}' a une valeur non null.
it: Il parametro '{0}' deve avere un valore non Null quando viene terminato perché il parametro '{1}' è non Null.
ja: パラメーター '{1}' が null 以外であるため、パラメーター '{0}' には、終了時に null 以外の値が含まれている必要があります。
pl: Parametr „{0}” musi mieć wartość inną niż null podczas kończenia działania, ponieważ parametr „{1}” ma wartość inną niż null.
pt_br: O parâmetro '{0}' precisa ter um valor não nulo durante a saída porque o parâmetro '{1}' não é nulo.
ru: При выходе параметр "{0}" должен иметь значение, отличное от NULL, так как параметр "{1}" имеет значение, отличное от NULL.
zh_hans: 退出时参数“{0}”必须具有非 null 值，因为参数“{1}”是非 null。
zh_hant: 因為參數 '{1}' 不是 null，所以參數 '{0}' 在結束時必須具有非 Null 值。

# WRN_ParameterNotNullIfNotNull_Title
source: Parameter must have a non-null value when exiting because parameter referenced by NotNullIfNotNull is non-null.
cs: Parametr musí mít při ukončení hodnotu jinou než null, protože parametr, na který se odkazuje NotNullIfNotNull není null
fr: Le paramètre doit avoir une valeur non null au moment de la sortie, car le paramètre référencé par NotNullIfNotNull a une valeur non null.
it: Il parametro deve avere un valore non Null quando viene terminato perché il parametro a cui fa riferimento NotNullIfNotNull è non Null.
ja: NotNullIfNotNull によって参照されているパラメーターが null 以外であるため、パラメーターには終了時に null 以外の値が含まれている必要があります。
pl: Parametr musi mieć wartość inną niż null podczas kończenia działania, ponieważ parametr przywoływany przez element NotNullIfNotNull ma wartość inną niż null.
pt_br: O parâmetro precisa ter um valor não nulo ao sair porque o parâmetro referenciado por NotNullIfNotNull não é nulo.
ru: При выходе параметр должен иметь значение, отличное от NULL, так как параметр, на который ссылается NotNullIfNotNull, имеет значение, отличное от NULL.
zh_hans: 退出时参数必须具有非 null 值，因为由 NotNullIfNotNull 引用的参数是非 null。
zh_hant: 因為 NotNullIfNotNull 所參考的參數不是 null，所以參數在結束時必須有非 null 值。

# WRN_ParameterOccursAfterInterpolatedStringHandlerParameter
source: Parameter '{0}' occurs after '{1}' in the parameter list, but is used as an argument for interpolated string handler conversions. This will require the caller to reorder parameters with named arguments at the call site. Consider putting the interpolated string handler parameter after all arguments involved.
cs: Parametr {0} se v seznamu parametrů nachází za {1}, ale používá se jako argument pro převody obslužných rutin interpolovaných řetězců. To vyžaduje, aby volající změnil pořadí parametrů s pojmenovanými argumenty na lokalitě volání. Doporučujeme, abyste parametr obslužné rutiny interpolovaného řetězce vložili za všechny ostatní zahrnuté argumenty.
fr: Le paramètre '{0}' apparaît après '{1}' dans la liste des paramètres, mais est utilisé comme argument pour les conversions de gestionnaires de chaînes interpolées. Cela nécessitera que l'appelant réorganise les paramètres avec des arguments nommés sur le site d'appel. Envisagez de placer le paramètre de gestionnaire de chaîne interpolé après tous les arguments impliqués.
it: Il parametro '{0}' è indicato dopo '{1}' nell'elenco di parametri, ma viene usato come argomento per le conversioni del gestore di stringhe interpolate. Al chiamante verrà richiesto di riordinare i parametri con argomenti denominati nel sito di chiamata. Provare a inserire il parametro del gestore di stringhe interpolate dopo tutti gli argomenti interessati.
ja: パラメーター リスト内の '{1}' の後にパラメーター '{0}' が発生しますが、補間された文字列ハンドラーの変換の引数として使用されます。呼び出し元が呼び出しサイトで名前付き引数を使用してパラメーターを並べ替える必要があります。関係するすべての引数の後に、補間された文字列ハンドラーのパラメーターを指定することを検討してください。
pl: Parametr „{0}” występuje po elemencie „{1}” na liście parametrów, ale jest on używany jako argument dla konwersji procedury obsługi ciągów interpolowanych. Będzie to wymagać od wywołującego zmiany kolejności parametrów za pomocą nazwanych argumentów w lokacji wywołania. Rozważ umieszczenie parametru procedury obsługi ciągu interpolowanego po wszystkich zastosowanych argumentach.
pt_br: O parâmetro {0} ocorre após {1} na lista de parâmetros, mas é usado como um argumento para as conversões do manipulador de cadeia de caracteres interpolada. Isso exigirá que o chamador reordene os parâmetros com argumentos nomeados no local da chamada. Considere colocar o parâmetro do manipulador de cadeia de caracteres interpolada após todos os argumentos envolvidos.
ru: Параметр {0} указан после {1} в списке параметров, но используется в качестве аргумента для преобразований обработчика интерполированных строк. В этом случае вызывающий должен изменить порядок параметров с именованными аргументами на сайте вызова. Рекомендуем разместить параметр обработчика интерполированных строк после всех используемых аргументов.
zh_hans: 参数“{0}”出现在参数列表中的“{1}”之后，但用作内插字符串处理程序转换的参数。这将要求调用方在调用站点使用已命名参数重新排列参数。请考虑将内插字符串处理程序参数放在涉及的所有参数的后面。
zh_hant: 參數 {0} 發生在參數清單中 {1} 之後，但卻用為差補字串處理常式轉換的引數。這會要求呼叫者在呼叫網站使用具名引數重新排列參數。請考慮將差補字串處理常式參數置於所有相關的引數後面。

# WRN_ParameterOccursAfterInterpolatedStringHandlerParameter_Title
source: Parameter to interpolated string handler conversion occurs after handler parameter
cs: Po parametru obslužné rutiny dojde k převodu parametru na obslužnou rutinu interpolovaného řetězce
fr: Un paramètre de conversion de gestionnaire de chaîne interpolé a lieu après un paramètre de gestionnaire
it: Il parametro per la conversione del gestore di stringhe interpolate si trova dopo il parametro del gestore
ja: パラメーターから補間された文字列ハンドラーへの変換は、ハンドラー パラメーターの後に発生します
pl: Parametr konwersji procedury obsługi ciągu interpolowanego występuje po parametrze procedury obsługi
pt_br: O parâmetro para conversão do manipulador de cadeia de caracteres interpolada ocorre após o parâmetro de manipulador
ru: Параметр преобразования обработчика интерполированных строк находится позже параметра обработчика
zh_hans: 处理程序参数之后，要进行内插字符串处理程序转换的参数
zh_hant: 差補字串處理常式轉換的參數會在處理常式參數後發生

# WRN_ParamsArrayInLambdaOnly
source: Parameter {0} has params modifier in lambda but not in target delegate type.
cs: Parametr {0} má modifikátor params ve výrazu lambda, ale ne v cílovém typu delegáta.
fr: Le paramètre {0} a un modificateur de paramètres dans l’expression lambda mais pas dans le type délégué cible.
it: Il parametro {0} contiene un modificatore di parametri in lambda ma non nel tipo delegato di destinazione.
ja: パラメーター {0} にラムダの params 修飾子がありますが、ターゲット デリゲート型にはありません。
pl: Parametr {0} ma modyfikator params w wyrażeniu lambda, ale nie ma w docelowym typie delegata.
pt_br: O parâmetro {0} tem o modificador de parâmetros em lambda, mas não no tipo delegado de destino.
ru: У параметра {0} есть модификатор params в лямбде, но не в типе целевого делегата.
zh_hans: 参数 {0} 在 lambda 中具有参数修饰符，但在目标委托类型中没有参数修饰符。
zh_hant: 參數 {0} 在 Lambda 中具有參數修飾元，但不在目標委派類型中。

# WRN_ParamsArrayInLambdaOnly_Title
source: Parameter has params modifier in lambda but not in target delegate type.
cs: Parametr má modifikátor params ve výrazu lambda, ale ne v cílovém typu delegáta.
fr: Le paramètre a un modificateur de paramètres dans l’expression lambda mais pas dans le type délégué cible.
it: Il parametro contiene un modificatore di parametri in lambda ma non nel tipo delegato di destinazione.
ja: パラメーターにラムダの params 修飾子がありますが、ターゲット デリゲート型にはありません。
pl: Parametr ma modyfikator params w wyrażeniu lambda, ale nie ma w docelowym typie delegata.
pt_br: O parâmetro tem modificador de parâmetros em lambda, mas não no tipo delegado de destino.
ru: У параметра есть модификатор params в лямбде, но не в типе целевого делегата.
zh_hans: 参数在 lambda 中具有参数修饰符，但在目标委托类型中没有参数修饰符。
zh_hant: 參數在 Lambda 中具有參數修飾元，但不在目標委派類型中。

# WRN_PartialMemberSignatureDifference
source: Partial member declarations '{0}' and '{1}' have signature differences.
pt_br: As declarações parciais de membro "{0}" e "{1}" têm diferenças de assinatura.

# WRN_PartialMemberSignatureDifference_Title
source: Partial member declarations have signature differences.
pt_br: Declarações de membro parciais têm diferenças de assinatura.

# WRN_PrimaryConstructorParameterIsShadowedAndNotPassedToBase
source: Primary constructor parameter '{0}' is shadowed by a member from base.
fr: Le paramètre de constructeur principal « {0} » est ombré par un membre de la base.
it: Il parametro del costruttore primario '{0}' è ombreggiato da un membro della base.
ja: プライマリ コンストラクター パラメーター '{0}' は、ベースのメンバーによってシャドウされています。
pl: Podstawowy parametr konstruktora „{0}” jest w tle przez składową z bazy.
pt_br: O parâmetro '{0}' do construtor primário é sombreado por um membro da base.
ru: Параметр "{0}" первичной конструкции затемнен элементом из базы.
zh_hans: 主要构造函数参数“{0}”由基成员隐藏。
zh_hant: 主要建構函式參數 '{0}' 會伴隨著來自基底的成員。

# WRN_PrimaryConstructorParameterIsShadowedAndNotPassedToBase_Title
source: Primary constructor parameter is shadowed by a member from base
fr: Le paramètre de constructeur principal est ombré par un membre de la base
it: Il parametro del costruttore primario è nascosto da un membro della base
ja: プライマリ コンストラクター パラメーターがベースのメンバーによってシャドウされています
pl: Podstawowy parametr konstruktora jest zasłaniany przez składową z bazy
pt_br: O parâmetro do construtor primário é sombreado por um membro da base.
ru: Параметр первичной конструкции затемнен элементом из базы.
zh_hans: 主构造函数参数由基成员隐藏
zh_hant: 主要建構函式參數會伴隨著來自基底的成員

# WRN_RecordEqualsWithoutGetHashCode
source: '{0}' defines 'Equals' but not 'GetHashCode'
cs: {0} definuje Equals, ale ne GetHashCode.
fr: '{0}' définit 'Equals' mais pas 'GetHashCode'
it: '{0}' definisce 'Equals' ma non 'GetHashCode'
ja: '{0}' では 'Equals' が定義されていますが、'GetHashCode' は定義されていません
pl: Element „{0}” definiuje element „Equals”, lecz nie element „GetHashCode”
pt_br: '{0}' define 'Equals', mas não 'GetHashCode'
ru: "{0}" определяет "Equals", но не "GetHashCode"
zh_hans: “{0}”定义 "Equals"，而不定义 "GetHashCode"
zh_hant: '{0}' 會定義 'Equals' 而非 'GetHashCode'

# WRN_RecordEqualsWithoutGetHashCode_Title
source: Record defines 'Equals' but not 'GetHashCode'.
cs: Záznam definuje Equals, ale ne GetHashCode
fr: L'enregistrement définit 'Equals' mais pas 'GetHashCode'.
it: Il record definisce 'Equals' ma non 'GetHashCode'.
ja: レコードでは 'Equals' が定義されていますが、'GetHashCode' は定義されていません。
pl: Rekord definiuje element „Equals”, lecz nie element „GetHashCode”.
pt_br: O registro define 'Equals', mas não 'GetHashCode'.
ru: Запись определяет "Equals", но не "GetHashCode".
zh_hans: 记录定义 "Equals" 而不定义 "GetHashCode"。
zh_hant: 記錄會定義 'Equals' 而非 'GetHashCode'。

# IDS_FeatureMixedDeclarationsAndExpressionsInDeconstruction
source: Mixed declarations and expressions in deconstruction
cs: Smíšené deklarace a výrazy v dekonstrukci
fr: Mélange de déclarations et d'expressions dans la déconstruction
it: Dichiarazioni ed espressioni miste nella decostruzione
ja: 分解で宣言と式が混在しています
pl: Mieszane deklaracje i wyrażenia w dekonstrukcji
pt_br: Declarações e expressões mistas na desconstrução
ru: Смешанные объявления и выражения в деконструировании
zh_hans: 析构中混用的声明和表达式
zh_hant: 解構中的混合宣告與運算式

# WRN_PartialMethodTypeDifference
source: Partial method declarations '{0}' and '{1}' have signature differences.
cs: Částečné deklarace metod {0} a {1} mají rozdíly v signaturách.
fr: Les déclarations de méthode partielles « {0} » et « {1} » ont des différences de signature.
it: Le dichiarazioni di metodo parziali '{0}' e '{1}' presentano differenze di firma.
ja: 部分メソッドの宣言 '{0}' と '{1}' には、シグネチャの違いがあります。
pl: Deklaracje metody częściowej „{0}” i „{1}” mają różnice w sygnaturach.
pt_br: As declarações de método parcial ' {0} ' e ' {1} ' têm diferenças de assinatura.
ru: Объявления разделяемого метода "{0}" и "{1}" имеют различия в сигнатуре.
zh_hans: 分部方法声明“{0}”和“{1}”具有签名差异。
zh_hant: 部分方法宣告 '{0}' 和 '{1}' 有簽章差異。

# WRN_PartialMethodTypeDifference_Title
source: Partial method declarations have signature differences.
cs: Částečné deklarace metod mají rozdíly v signaturách.
fr: Les déclarations de méthode partielles ont des différences de signature.
it: Le dichiarazioni di metodo parziali presentano differenze di firma.
ja: 部分メソッドの宣言には、シグネチャの違いがあります。
pl: Deklaracje metod częściowych mają różnice w sygnaturach.
pt_br: As declarações de método parcial têm diferenças de assinatura.
ru: Объявления разделяемого метода имеют различия в сигнатуре.
zh_hans: 分部方法声明具有签名差异。
zh_hant: 部分方法宣告有簽章差異。

# WRN_RecordNamedDisallowed
source: Types and aliases should not be named 'record'.
cs: Typy a aliasy by neměly mít název record.
fr: Les types et les alias ne doivent pas porter le nom 'record'.
it: Il nome di tipi e alias non deve essere 'record'.
ja: 型およびエイリアスに 'record' という名前を指定することはできません。
pl: Typy i aliasy nie powinny mieć nazwy „record”.
pt_br: Os tipos e os aliases não devem ser nomeados como 'registro'.
ru: Типы и псевдонимы не могут иметь имя "record"
zh_hans: 类型和别名不应命名为 "record"。
zh_hant: 類型與別名不應命名為 'record'。

# WRN_RecordNamedDisallowed_Title
source: Types and aliases should not be named 'record'.
cs: Typy a aliasy by neměly mít název record
fr: Les types et les alias ne doivent pas porter le nom 'record'.
it: Il nome di tipi e alias non deve essere 'record'.
ja: 型およびエイリアスに 'record' という名前を指定することはできません。
pl: Typy i aliasy nie powinny mieć nazwy „record”.
pt_br: Os tipos e os aliases não devem ser nomeados como 'registro'.
ru: Типы и псевдонимы не могут иметь имя "record"
zh_hans: 类型和别名不应命名为 "record"。
zh_hant: 類型與別名不應命名為 'record'。

# WRN_RedundantPattern
source: The pattern is redundant.
pt_br: O padrão é redundante.

# WRN_RedundantPattern_Title
source: The pattern is redundant.
pt_br: O padrão é redundante.

# WRN_RefAssignNarrower
source: This ref-assigns '{1}' to '{0}' but '{1}' has a narrower escape scope than '{0}'.
cs: Tento odkaz přiřadí {1} k {0}, ale {1} má užší řídicí obor než {0}.
fr: Effectue une attribution par référence de '{1}' vers '{0}', mais '{1}' a une portée de sortie plus limitée que '{0}'.
it: Questo riferimento assegna '{1}' a '{0}' ma '{1}' ha un ambito di escape più ristretto di '{0}'.
ja: これは、'{1}' を '{0}' に ref 割り当てしますが、'{1}' には '{0}' より狭いエスケープ スコープがあります。
pl: To odwołanie przypisuje element „{1}” do elementu „{0}”, ale „{1}” ma węższy zakres ucieczki niż „{0}”.
pt_br: Essa referência atribui '{1}' a '{0}', mas '{1}' tem um escopo de escape mais estreito do que '{0}'.
ru: Это присваивает по ссылке "{1}" "{0}", но "{1}" имеет более узкую область выхода, чем "{0}".
zh_hans: 此 ref 将“{1}”分配给“{0}”，但“{1}”具有比“{0}”更窄的转义范围。
zh_hant: 此參考指派 '{1}' 至 '{0}'，但 '{1}' 的逸出範圍比 '{0}' 還要窄。

# WRN_RefAssignNarrower_Title
source: This ref-assigns a value that has a narrower escape scope than the target.
cs: Tento odkaz přiřadí hodnotu, která má užší řídicí obor než cíl.
fr: Cette référence attribue une valeur par référence dont l’étendue d’échappement est plus étroite que la cible.
it: In questo modo viene assegnato con ref un valore con un ambito di escape più ristretto rispetto alla destinazione.
ja: これは、ターゲットより狭いエスケープ スコープを持つ値を ref 割り当てします。
pl: To odwołanie przypisuje wartość, która ma węższy zakres ucieczki niż element docelowy.
pt_br: Essa referência atribui um valor que tem um escopo de escape mais estreito do que o destino.
ru: Это присваивает по ссылке значение с более узкой областью выхода, чем у целевого объекта.
zh_hans: 此 ref 分配的值的转义范围比目标更窄。
zh_hant: 此參考指派的值比目標的逸出範圍更窄。

# WRN_RefAssignReturnOnly
source: This ref-assigns '{1}' to '{0}' but '{1}' can only escape the current method through a return statement.
cs: Tento příkaz znovu přiřadí {1} k {0}, ale {1} může opustit aktuální metodu pouze prostřednictvím příkazu return.
fr: Cette référence effectue une attribution par référence '{1}' à '{0}', mais '{1}' ne peut échapper à la méthode actuelle qu’à l’aide d’une instruction return.
it: Questo tipo di riferimento assegna '{1}' a '{0}' ma '{1}' può solo eseguire l'escape del metodo corrente tramite un'istruzione return.
ja: これは '{1}' を '{0}' に ref 割り当てしますが、'{1}' は return ステートメントを介してのみ現在のメソッドをエスケープできます。
pl: To odwołanie przypisuje element „{1}” do „{0}”, ale „{1}” może tylko pominąć bieżącą metodę za pośrednictwem instrukcji return.
pt_br: Essa referência atribui '{1}' a '{0}' mas '{1}' só pode escapar do método atual por meio de uma instrução return.
ru: Это присваивает по ссылке "{1}" "{0}", но "{1}" может избежать текущего метода только через оператор return.
zh_hans: 此 ref 将“{1}”分配给“{0}”，但“{1}”只能通过 return 语句对当前方法进行转义。
zh_hant: 此參考指派 '{1}' 至 '{0}'，但 '{1}' 只能透過 return 陳述式逸出目前的方法。

# WRN_RefAssignReturnOnly_Title
source: This ref-assigns a value that can only escape the current method through a return statement.
cs: Tento příkaz přiřazuje hodnotu, která může opustit aktuální metodu pouze prostřednictvím příkazu return.
fr: Cette référence effectue une valeur qui ne peut échapper à la méthode actuelle qu’à l’aide d’une instruction return.
it: In questo modo viene assegnato un valore che può eseguire l'escape del metodo corrente solo tramite un'istruzione return.
ja: これは、return ステートメントを介してのみ現在のメソッドをエスケープできる値を ref 割り当てします。
pl: To odwołanie przypisuje wartość, która może tylko pomijać bieżącą metodę za pośrednictwem instrukcji return.
pt_br: Essa referência atribui um valor que só pode escapar o método atual por meio de uma instrução return.
ru: Это присваивает по ссылке значение, которое может избежать текущего метода только через оператор return.
zh_hans: 此 ref 分配的值只能通过 return 语句转义当前方法。
zh_hant: 此參考指派的值只能透過 return 陳述式逸出目前的方法。

# WRN_RefAssignValEscapeWider
source: This ref-assigns '{1}' to '{0}' but '{1}' has a wider value escape scope than '{0}' allowing assignment through '{0}' of values with narrower escape scopes than '{1}'.
fr: Cette opération effectue une affectation de référence de « {1} » vers « {0} », mais « {1} » a une étendue d’échappement de valeur plus large que « {0} » permettant l’affectation via « {0} » des valeurs avec des étendues d’échappement plus restreintes que « {1} ».
it: Questo riferimento assegna '{1}' a '{0}' ma '{1}' ha un ambito di escape del valore più ampio di '{0}' consentendo l'assegnazione tramite '{0}' di valori con ambiti di escape più ristretti rispetto a '{1}'.
pt_br: Com isso "{1}" é atribuído com ref a "{0}", mas "{1}" tem um escopo de escape mais amplo que "{0}", permitindo a atribuição por meio de "{0}" de valores com escopos de escape mais restritos que "{1}".
ru: Эта ссылка присваивает "{1}" значение "{0}", но "{1}" имеет более широкую область действия значения, чем "{0}", позволяя назначать через "{0}" значения с более узкой областью действия, чем "{1}".
zh_hans: 它会将“{1}”ref-assign 给“{0}”，但“{1}”比“{0}”具有更广的值转义范围，允许通过转义范围比“{1}”更窄的值的“{0}”进行赋值。

# WRN_RefAssignValEscapeWider_Title
source: This ref-assigns a value that has a wider value escape scope than the target allowing assignment through the target of values with narrower escapes scopes.
cs: Tento odkaz přiřazuje hodnotu, která má širší řídicí obor hodnot než cíl, který povoluje přiřazení prostřednictvím cíle hodnot s užšími řídicími obory.
fr: Cette référence affecte une valeur, mais a une étendue d’échappement de valeur plus large que la cible, ce qui permet l’affectation via la cible de valeurs avec des étendues d’échappement plus restreintes.
it: Questa funzione assegna un valore che ha un ambito di escape più ampio di quello del target, consentendo l'assegnazione attraverso il target di valori con ambiti di escape più ristretti.
ja: この参照により、ターゲットよりも広い値エスケープ スコープを持つ値が割り当てられ、より狭いエスケープ スコープを持つ値のターゲットを介して割り当てることができます。
pl: Ta wartość ref przypisuje wartość, która ma szerszy zakres ucieczki wartości niż wartość docelowa, umożliwiając przypisanie za pośrednictwem wartości docelowej wartości z węższymi zakresami ucieczki.
pt_br: Essa referência atribui um valor que tem um escopo de escape de valor mais amplo do que o destino permitindo a atribuição por meio do destino de valores com escopos de escape mais estreitos.
ru: Это присваивает по ссылке значение, которое имеет более широкую область выхода, чем цель, что позволяет присваивать через цель значения с более узкими областями выхода.
zh_hans: 它会 ref-assign 一个值转义范围大于目标的值，允许通过转义范围更窄的值的目标进行赋值。
zh_hant: 此參考指派的值比目標的逸出範圍更寬，允許透過目標的值指派，其逸出範圍更窄。

# WRN_RefReadonlyNotVariable
source: Argument {0} should be a variable because it is passed to a 'ref readonly' parameter
fr: L’argument {0} doit être une variable, car il est passé à un paramètre « ref readonly »
it: L'argomento {0} deve essere una variabile perché viene passato a un parametro 'ref readonly'
ja: 引数 {0} は 'ref readonly' パラメーターに渡されるため、変数である必要があります
pl: Argument {0} powinien być zmienną, ponieważ jest przekazywany do parametru „ref readonly”
pt_br: O argumento {0} deve ser uma variável porque é passado para um parâmetro 'ref readonly'
ru: Аргумент {0} должен быть переменной, так как он передается параметру "ref readonly"
zh_hans: 参数 {0} 应为变量，因为它会传递给 “ref readonly” 参数
zh_hant: 引數 {0} 應為變數，因為它會傳遞至 'ref readonly' 參數
