Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadAllowByRefLikeEnumerator
source: foreach statement cannot operate on enumerators of type '{0}' because it is a type parameter that allows ref struct and it is not known at compile time to implement IDisposable.
fr: l’instruction foreach ne peut pas fonctionner sur des énumérateurs de type « {0} », car il s’agit d’un paramètre de type qui autorise ref struct et il n’est pas connu au moment de la compilation pour implémenter IDisposable.
it: L'istruzione foreach non può operare su enumeratori di tipo '{0}' perché è un parametro di tipo che consente il ref struct e non è noto in fase di compilazione per implementare IDisposable.
pl: Instrukcja foreach nie może działać na modułach wyliczeniowych typu „{0}”, ponieważ jest to parametr typu, który umożliwia strukturę ref i nie jest znany w czasie kompilacji w celu zaimplementowania interfejsu IDisposable.
pt_br: A instrução foreach não pode operar em enumeradores do tipo "{0}" porque é um parâmetro de tipo que permite o ref struct e não é conhecido no tempo de compilação para implementar IDisposable.
ru: Оператор foreach не может работать с перечислителями типа "{0}", поскольку это параметр типа, который позволяет использовать структуру ref и неизвестен во время компиляции для реализации IDisposable.
zh_hans: foreach 语句无法在 "{0}" 类型的枚举器上操作，因为它是允许 ref 结构的类型参数，在编译时无法识别它来实现 IDisposable。
zh_hant: foreach 語句無法對 '{0}' 類型中的列舉值運作，因為該型別參數允許 ref struct，而且在實作 IDisposable 的編譯期間為未知。

# ERR_BadArgExtraRefLangVersion
source: Argument {0} may not be passed with the 'ref' keyword in language version {1}. To pass 'ref' arguments to 'in' parameters, upgrade to language version {2} or greater.
fr: L’argument {0} ne peut pas être passé avec le mot clé « ref » dans la version de langage {1}. Pour passer les arguments « ref » aux paramètres « in », effectuez une mise à niveau vers la version de langage {2} ou une version ultérieure.
it: Non è possibile passare l'argomento {0} con la parola chiave 'ref' nella versione del linguaggio {1}. Per passare gli argomenti 'ref' ai parametri 'in', eseguire l'aggiornamento alla versione del linguaggio {2} o versione successiva.
ja: 言語バージョン {1} では、引数 {0} を 'ref' キーワード (keyword)と共に渡すことはできません。'ref' 引数を 'in' パラメーターに渡すには、{2} 以上の言語バージョンにアップグレードしてください。
pl: Argument {0} nie może być przekazywany ze słowem kluczowym „ref” w wersji językowej {1}. Aby przekazać argumenty „ref” do parametrów „in”, uaktualnij do wersji językowej {2} lub nowszej.
pt_br: O argumento {0} não pode ser passado com o palavra-chave 'ref' na versão {1} da linguagem. Para passar argumentos 'ref' para parâmetros 'in', atualize para a versão {2} ou superior da linguagem.
ru: Аргумент {0} не может передаваться с ключевым словом "ref" в языке версии {1}. Чтобы передать аргументы "ref" в параметры "in", повысьте статус до языка версии {2} или более поздней.
zh_hans: 不能在语言版本 {1} 中使用 “ref” 关键字传递参数 {0}。要将 “ref” 参数传递给 “in” 参数，请升级到语言版本 {2} 或更高版本。
zh_hant: 引數 {0} 可能無法以語言版本 {1} 中的 'ref' 關鍵字傳遞。若要將 'ref' 引數傳遞至 'in' 參數，請升級為語言版本 {2} 或更新版本。

# ERR_BadBinaryReadOnlySpanConcatenation
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}' that are not UTF-8 byte representations
cs: Operátor {0} nejde použít pro operandy typu {1} a {2}, které nejsou bajtovým vyjádřením UTF-8.
fr: Impossible d’appliquer l’opérateur '{0}' aux opérandes de type '{1}' et '{2}' qui ne sont pas des représentations d’octets UTF-8
it: Non è possibile applicare l'operatore '{0}' a operandi di tipo '{1}' e '{2}' che non sono rappresentazioni di UTF-8 byte
ja: 演算子 '{0}' は、UTF-8 バイト表現ではない型 '{1}' および '{2}' のオペランドには適用できません
pl: Nie można zastosować operatora „{0}” do argumentów operacji typu „{1}” i „{2}”, które nie są reprezentacjami bajtów UTF-8
pt_br: O operador '{0}' não pode ser aplicado a operandos do tipo '{1}' e '{2}' que não são representações de bytes UTF-8
ru: Невозможно применить оператор "{0}" к операндам типа "{1}" и "{2}", которые не являются байтовыми представлениями UTF-8
zh_hans: 运算符 "{0}" 不能应用于类型为 "{1}" 和 "{2}" 的非 UTF-8 字节表示形式的操作数
zh_hant: 運算子 '{0}' 無法套用到型別為 '{1}' 的運算元，而 '{2}' 不是 UTF-8 位元組標記法

# ERR_BadCallerArgumentExpressionParamWithoutDefaultValue
source: The CallerArgumentExpressionAttribute may only be applied to parameters with default values
cs: CallerArgumentExpressionAttribute jde použít jenom pro parametry s výchozími hodnotami.
fr: Le CallerArgumentExpressionAttribute peut seulement être appliqué aux paramètres avec des valeurs par défaut
it: CallerArgumentExpressionAttribute può essere applicato solo a parametri con valori predefiniti
ja: CallerArgumentExpressionAttribute は、既定値を含むパラメーターにのみ適用できます
pl: Atrybut CallerArgumentExpressionAttribute można zastosować tylko do parametrów z wartościami domyślnymi
pt_br: O CallerArgumentExpressionAttribute só pode ser aplicado a parâmetros com valores padrão
ru: Класс CallerArgumentExpressionAttribute можно применять только к параметрам со значениями по умолчанию.
zh_hans: CallerArgumentExpressionAttribute 只能应用于具有默认值的参数
zh_hant: CallerArgumentExpressionAttribute 只能套用至具有預設值的參數

# ERR_BadCaseInSwitchArm
source: A switch expression arm does not begin with a 'case' keyword.
cs: Arm výrazu přepínače nezačíná klíčovým slovem case.
fr: Un bras d’expression switch ne commence pas par un mot clé 'case'.
it: Un braccio dell'espressione switch non inizia con una parola chiave 'case'.
ja: switch 式の arm が 'case' キーワードで始まりません。
pl: Ramię wyrażenia przełączające nie rozpoczyna się od słowa kluczowego „case”.
pt_br: Um braço de expressão alternar não começa com uma palavra-chave 'case'.
ru: ARM выражения переключателя не начинается с ключевого слова "case".
zh_hans: 切换表达式 arm 不以 “case” 关键字 (keyword)开头。
zh_hant: 切換運算式 ARM 不會以 'case' 關鍵字開頭。

# ERR_BadCompoundAssignmentOpArgs
source: Overloaded compound assignment operator '{0}' takes one parameter
pt_br: O operador de atribuição composta sobrecarregado "{0}" usa um parâmetro

# ERR_BadDynamicAwaitForEach
source: Cannot use a collection of dynamic type in an asynchronous foreach
cs: V asynchronním příkazu foreach nejde použít kolekce dynamického typu.
de: Eine Sammlung des dynamic-Typs kann in einem asynchronen foreach nicht verwendet werden.
es: No se puede usar una colección de tipo dinámico en una instrucción foreach asincrónica.
fr: Impossible d'utiliser une collection de type dynamique dans un foreach asynchrone
it: Non è possibile usare una raccolta di tipo dinamico in un'istruzione foreach asincrona
ja: 非同期 foreach では動的な型のコレクションを使用できません
ko: 비동기 foreach에는 동적 형식 컬렉션을 사용할 수 없습니다.
pl: Nie można użyć kolekcji typu dynamicznego w asynchronicznej instrukcji foreach
pt_br: Não é possível usar uma coleção do tipo dinâmico em uma foreach assíncrona
ru: Не удается использовать коллекцию динамического типа в асинхронном операторе foreach
tr: Zaman uyumsuz bir foreach içinde dinamik tür koleksiyonu oluşturulamaz
zh_hans: 无法在异步 foreach 中使用动态类型集合
zh_hant: 無法在非同步 foreach 中使用動態類型的集合

# ERR_BadExtensionBinaryOperatorSignature
source: One of the parameters of a binary operator must be the extended type.
pt_br: Um dos parâmetros de um operador binário deve ser o tipo estendido.

# ERR_BadExtensionContainingType
source: Extensions must be declared in a top-level, non-generic, static class
pt_br: As extensões devem ser declaradas em uma classe estática de nível superior, não genérica

# ERR_BadExtensionIncDecSignature
source: The parameter type for ++ or -- operator must be the extended type.
pt_br: O tipo de parâmetro para o operador ++ ou -- deve ser do tipo estendido.

# ERR_BadExtensionShiftOperatorSignature
source: The first operand of an overloaded shift operator must have the same type as the extended type
pt_br: O primeiro operando de um operador de deslocamento sobrecarregado deve ter o mesmo tipo que o tipo estendido

# ERR_BadExtensionUnaryOperatorSignature
source: The parameter of a unary operator must be the extended type.
pt_br: O parâmetro de um operador unário deve ser o tipo estendido.

# ERR_BadFieldTypeInRecord
source: The type '{0}' may not be used for a field of a record.
cs: Typ {0} se nedá použít pro pole záznamu.
fr: Le type '{0}' ne doit pas être utilisé pour un champ d'enregistrement.
it: Il tipo '{0}' non può essere usato per un campo di un record.
ja: レコードのフィールドに対して型 '{0}' を使用することはできません。
pl: Typ „{0}” nie może być używany dla pola rekordu.
pt_br: O tipo '{0}' não pode ser usado para um campo de um registro.
ru: Тип "{0}" не может быть использован для поля записи.
zh_hans: 类型“{0}”不能用于记录的字段。
zh_hant: 類型 '{0}' 不可用於記錄的欄位。

# ERR_BadFuncPointerArgCount
source: Function pointer '{0}' does not take {1} arguments
cs: Ukazatel na funkci {0} nepřijímá tento počet argumentů: {1}
fr: Le pointeur de fonction '{0}' n'accepte pas {1} arguments
it: Il puntatore a funzione '{0}' non accetta {1} argomenti
ja: 関数ポインター '{0}' には {1} 個の引数を指定できません
pl: Wskaźnik funkcji „{0}” nie przyjmuje argumentów {1}
pt_br: O ponteiro de função '{0}' não usa {1} argumentos
ru: Указатель на функцию "{0}" не принимает следующее число аргументов: {1}.
zh_hans: 函数指针“{0}”未采用 {1} 个参数
zh_hant: 函式指標 '{0}' 不接受 {1} 個引數

# ERR_BadFuncPointerParamModifier
source: '{0}' cannot be used as a modifier on a function pointer parameter.
cs: {0} se nedá použít jako modifikátor v parametru ukazatele na funkci.
fr: '{0}' ne peut pas être utilisé comme modificateur pour un paramètre de pointeur de fonction.
it: Non è possibile usare '{0}' come modificatore in un parametro di puntatore a funzione.
ja: 関数ポインター パラメーターでは、'{0}' を修飾子として使用することはできません。
pl: Elementu „{0}” nie można użyć jako modyfikatora w parametrze wskaźnika funkcji.
pt_br: '{0}' não pode ser usado como um modificador em um parâmetro de ponteiro de função.
ru: "{0}" не может использоваться в качестве модификатора для параметра указателя на функцию.
zh_hans: “{0}”不能作为函数指针参数上的修饰符使用。
zh_hant: '{0}' 無法作為函式指標參數上的修飾元。

# ERR_BadInheritanceFromRecord
source: Only records may inherit from records.
cs: Ze záznamů můžou dědit jenom záznamy.
fr: Seuls les enregistrements peuvent hériter d'enregistrements.
it: Solo i record possono ereditare dai record.
ja: レコードから継承できるのはレコードだけです。
pl: Tylko rekordy mogą dziedziczyć po rekordach.
pt_br: Somente os registros podem ser herdados de registros.
ru: Наследоваться от записей могут только записи.
zh_hans: 只有记录可以从记录继承。
zh_hant: 只有記錄可以繼承自記錄。

# ERR_BadInitAccessor
source: The 'init' accessor is not valid on static members
cs: Přístupový objekt init není platný pro statické členy.
fr: L'accesseur 'init' est non valide sur les membres statiques
it: La funzione di accesso 'init' non è valida nei membri statici
ja: 静的メンバー上で 'init' アクセサーは有効ではありません
pl: Metoda dostępu „init” jest nieprawidłowa w składowych statycznych
pt_br: O acessador 'init' não é válido em membros estáticos
ru: Метод доступа "init" не может использоваться для статических элементов.
zh_hans: "Init" 访问器对静态成员无效
zh_hant: 靜態成員上的 'Init' 存取子無效

# ERR_BadNonVirtualInterfaceMemberAccessOnAllowsRefLike
source: A non-virtual instance interface member cannot be accessed on a type parameter that allows ref struct.
fr: Désolé... Nous ne pouvons pas accéder à un membre d’interface d’instance non virtuelle sur un paramètre de type qui autorise ref struct.
it: Impossibile accedere a un membro dell'interfaccia dell'istanza non virtuale in un parametro di tipo che consente ref struct.
pl: Nie można uzyskać dostępu do niewirtualnej składowej interfejsu wystąpienia dla parametru typu, który zezwala na strukturę ref.
pt_br: Um membro de interface de instância não virtual não pode ser acessado em um parâmetro de tipo que permita o ref struct.
ru: Доступ к невиртуальному элементу интерфейса экземпляра невозможен для параметра типа, допускающего структуру ref.
zh_hans: 无法在允许 ref 结构的类型参数上访问非虚拟实例接口成员。
zh_hant: 允許 ref struct 的型別參數無法存取非虛擬執行個體介面成員。

# ERR_BadNullableContextOption
source: Invalid option '{0}' for /nullable; must be 'disable', 'enable', 'warnings' or 'annotations'
cs: Neplatná možnost {0} pro /nullable. Je třeba použít disable, enable, warnings nebo annotations.
de: Ungültige Option "{0}" für "/nullable". Zulässig sind nur "disable", "enable", "warnings" oder "annotations".
es: Opción no válida "{0}" para /nullable; debe ser "deshabilitar", ·"habilitar"', "advertencias" o "anotaciones"
fr: Option '{0}' non valide pour /nullable ; utilisez 'disable', 'enable', 'warnings' ou 'annotations'
it: L'opzione '{0}' non è valida per /nullable. Deve essere 'disable', 'enable', 'warnings' o 'annotations'
ja: /nullable のオプション '{0}' が無効です。'disable'、'enable'、'warnings'、'annotations' のいずれかにする必要があります
ko: /nullable의 '{0}' 옵션이 잘못되었습니다. 'disable', 'enable', 'warnings' 또는 'annotations'여야 합니다.
pl: Nieprawidłowa opcja „{0}” dla parametru /nullable; należy użyć opcji „disable”, „enable”, „warnings” lub „annotations”
pt_br: Opção inválida '{0}' para /nullable; precisa ser 'disable', 'enable', 'safeonly', 'warnings' ou 'safeonlywarnings'
ru: Недопустимый параметр "{0}" для /nullable. Допустимые значения: "disable", "enable", "warnings" или "annotations"
tr: /nullable için geçersiz '{0}' seçeneği; 'disable', 'enable', 'warnings' veya 'annotations' olmalıdır
zh_hans: /nullable 的选项“{0}”无效；必须为“禁用”、“启用”、“警告”或“注释”
zh_hant: /nullable 的選項 '{0}' 無效; 必須為 'disable'、'enable'、'warnings' 或 'annotations'

# ERR_BadNullableReferenceTypeInUsingAlias
source: Using alias cannot be a nullable reference type.
cs: Použití aliasu nemůže být odkazový typ s možnou hodnotou null.
fr: L’utilisation de l’alias ne peut pas être un type référence Nullable.
it: L'alias using non può essere un tipo riferimento nullable.
ja: Using エイリアスを NULL 許容参照型にすることはできません。
pl: Używanie aliasu nie może być typem referencyjnym dopuszczającym wartość null.
pt_br: O uso de alias não pode ser um tipo de referência anulável.
ru: Параметр использования псевдонима не может быть ссылочным типом, допускающим значение NULL.
zh_hans: 使用别名不能为可为 null 的引用类型。
zh_hant: 使用別名不可以是可為 Null 的參考型別。

# ERR_BadNullableTypeof
source: The typeof operator cannot be used on a nullable reference type
cs: Operátor typeof nejde použít na typ odkazů s možnou hodnotou null.
de: Der typeof-Operator kann nicht für einen Verweistyp verwendet werden, der NULL-Werte zulässt.
es: El operador typeof no se puede usar en un tipo de referencia que acepta valores NULL
fr: Impossible d'utiliser l'opérateur typeof sur un type référence Nullable
it: Non è possibile usare l'operatore typeof nel tipo riferimento nullable
ja: NULL 許容参照型では typeof 演算子を使用できません
ko: typeof 연산자는 nullable 참조 형식에 사용할 수 없습니다.
pl: Nie można użyć operatora typeof w przypadku typu referencyjnego dopuszczającego wartość null
pt_br: O operador typeof não pode ser usado em um tipo de referência anulável
ru: Оператор typeof невозможно использовать для ссылочного типа, допускающего значения NULL.
tr: Boş değer atanabilir tür üzerinde typeof işleci kullanılamaz
zh_hans: 不能在可为 null 的引用类型上使用 typeof 运算符
zh_hant: typeof 運算子不得用於可為 Null 的參考型別上

# ERR_BadOpOnNullOrDefaultOrNew
source: Operator '{0}' cannot be applied to operand '{1}'
cs: Operátor {0} nejde použít pro operand {1}.
fr: Impossible d'appliquer l'opérateur '{0}' à un opérande '{1}'
it: Non è possibile applicare l'operatore '{0}' all'operando '{1}'
ja: 演算子 '{0}' はオペランド '{1}' に適用できません
pl: Nie można zastosować operatora „{0}” do operandu „{1}”
pt_br: O operador '{0}' não pode ser aplicado ao operando '{1}'
ru: Оператор "{0}" невозможно применить к операнду "{1}".
zh_hans: 运算符“{0}”无法应用于操作数“{1}”
zh_hant: 運算子 '{0}' 不可套用至運算元 '{1}'

# ERR_BadPatternExpression
source: Invalid operand for pattern match; value required, but found '{0}'.
cs: Neplatný operand pro porovnávací vzorek. Vyžaduje se hodnota, ale nalezeno: {0}.
de: Ungültiger Operand für die Musterübereinstimmung. Ein Wert ist erforderlich, gefunden wurde aber "{0}".
es: Operando no válido para la coincidencia de patrones. Se requería un valor, pero se encontró '{0}'.
fr: Opérande non valide pour les critères spéciaux ; la valeur nécessaire n'est pas celle trouvée, '{0}'.
it: L'operando non è valido per i criteri di ricerca. È richiesto un valore ma è stato trovato '{0}'.
ja: パターン マッチには使用できないオペランドです。値が必要ですが、'{0}' が見つかりました。
ko: 패턴 일치에 대한 피연산자가 잘못되었습니다. 값이 필요하지만 '{0}'을(를) 찾았습니다.
pl: Nieprawidłowy operand dla dopasowania wzorca; wymagana jest wartość, a znaleziono „{0}”.
pt_br: Operando inválido para correspondência de padrão. Um valor era obrigatório, mas '{0}' foi encontrado.
ru: Недопустимый операнд для сопоставления с шаблоном. Требуется значение, но найдено "{0}".
tr: Desen eşleşmesi için işlenen geçersiz. Değer gerekiyordu ancak '{0}' bulundu.
zh_hans: 用于模式匹配的操作数无效；需要值，但找到的是“{0}”。
zh_hant: 模式比對運算元無效; 需要值，但找到 '{0}'。

# ERR_BadRecordBase
source: Records may only inherit from object or another record
cs: Záznamy můžou dědit jenom z objektu nebo jiného záznamu.
fr: Les enregistrements peuvent uniquement hériter d'un objet ou d'un autre enregistrement
it: I record possono ereditare solo dall'oggetto o da un altro record
ja: レコードの継承元にできるのは、object か別のレコードだけです
pl: Rekordy mogą dziedziczyć tylko po obiekcie lub innym rekordzie
pt_br: Os registros só podem ser herdados de um objeto ou de outro registro
ru: Записи могут наследоваться только от объекта или другой записи.
zh_hans: 记录只能从对象或另一条记录继承
zh_hant: 記錄只能繼承自物件或其他記錄

# ERR_BadRecordMemberForPositionalParameter
source: Record member '{0}' must be a readable instance property or field of type '{1}' to match positional parameter '{2}'.
cs: Člen záznamu {0} musí být čitelná vlastnost instance nebo pole typu {1}, která se bude shodovat s pozičním parametrem {2}.
fr: Le membre d'enregistrement '{0}' doit être une propriété d'instance our champ lisible de type '{1}' pour correspondre au paramètre positionnel '{2}'.
it: Il membro di record '{0}' deve essere una proprietà di istanza leggibile o campo di tipo '{1}' per corrispondere al parametro posizionale '{2}'.
ja: レコード メンバー '{0}' は、位置指定パラメーター '{2}' に一致させるための型 '{1}' の読み取り可能なインスタンス プロパティまたはフィールドである必要があります。
pl: Składowa rekordu "{0}" musi być możliwą do odczytu właściwością wystąpienia typu "{1}", aby dopasować parametr pozycyjny "{2}".
pt_br: O membro do registro '{0}' precisa ser uma propriedade de instância legível ou campo do tipo '{1}' para corresponder ao parâmetro posicional '{2}'.
ru: Элемент записи "{0}" должен быть доступным для чтения свойством экземпляра или полем типа "{1}", чтобы соответствовать позиционному параметру "{2}".
zh_hans: 记录成员 '{0}' 必须为类型 '{1}' 的可读实例属性或字段，以匹配位置参数 '{2}'。
zh_hant: 記錄成員 '{0}' 必須是類型 '{1}' 的可讀取執行個體屬性或欄位，才能符合位置參數 '{2}'。

# ERR_BadSpecialByRefParameter
source: Parameters of type '{0}' cannot be declared in async methods or async lambda expressions.
fr: Les paramètres de type « {0} » ne peuvent pas être déclarés dans des méthodes asynchrones ou des expressions lambda asynchrones.
it: Non è possibile dichiarare parametri di tipo '{0}' in metodi asincroni o espressioni lambda asincrone.
pl: Parametry typu „{0}” nie mogą być deklarowane w metodach asynchronicznych ani asynchronicznych wyrażeniach lambda.
pt_br: Parâmetros do tipo "{0}" não podem ser declarados em métodos assíncronos ou expressões lambda assíncronas.
ru: Параметры типа "{0}" не могут быть объявлены в асинхронных методах или асинхронных лямбда-выражениях.
zh_hans: 不能在异步方法或异步 lambda 表达式中声明 "{0}" 类型的参数。
zh_hant: 類型 '{0}' 的參數不得在非同步方法或非同步 Lambda 運算式中宣告。

# ERR_BadRefInUsingAlias
source: Using alias cannot be a 'ref' type.
cs: Použitý alias nemůže být typu ref.
fr: L’utilisation de l’alias ne peut pas être un type 'ref'.
it: L'alias using non può essere di tipo 'ref'.
ja: using エイリアスを 'ref' 型にすることはできません。
pl: Używanie aliasu nie może być typem „ref”.
pt_br: O uso de alias não pode ser do tipo 'ref'.
ru: Параметр использования псевдонима не может быть типом "ref".
zh_hans: 使用别名不能是 “ref” 类型。
zh_hant: 使用別名不可以是 'ref' 類型。

# ERR_BadSpreadInCatchFilter
source: Cannot use '..' spread operator in the filter expression of a catch clause
pt_br: Não é possível usar o operador de difusão ".." na expressão de filtro de uma cláusula catch

# ERR_BadStaticAfterUnsafe
source: 'static' modifier must precede 'unsafe' modifier.
cs: Modifikátor „static“ musí předcházet modifikátoru „unsafe“.
fr: Le modificateur 'static' doit précéder le modificateur 'unsafe'.
it: Il modificatore 'static' deve precedere il modificatore 'unsafe'.
ja: 'static' 修飾子は 'unsafe' 修飾子の前に指定する必要があります。
pl: Modyfikator „statyczny” musi poprzedzać modyfikator „niebezpieczny”.
pt_br: O modificador 'estático' deve preceder o modificador 'inseguro'.
ru: Модификатор "static" должен предшествовать модификатору "unsafe".
zh_hans: 'static' 修饰符必须位于 'unsafe' 修饰符之前。
zh_hant: 'static' 修飾元必須在 'unsafe' 修飾元之前。

# ERR_BadSwitchValue
source: Command-line syntax error: '{0}' is not a valid value for the '{1}' option. The value must be of the form '{2}'.
cs: Chyba syntaxe příkazového řádku: {0} není platná hodnota možnosti {1}. Hodnota musí mít tvar {2}.
de: Fehler in der Befehlszeilensyntax: "{0}" ist kein gültiger Wert für die Option "{1}". Der Wert muss im Format "{2}" vorliegen.
es: Error de sintaxis de la línea de comandos: "{0}" no es un valor válido para la opción "{1}". El valor debe tener el formato "{2}".
fr: Erreur de syntaxe de ligne de commande : '{0}' est une valeur non valide pour l'option '{1}'. La valeur doit se présenter sous la forme '{2}'.
it: Errore di sintassi della riga di comando: '{0}' non è un valore valido per l'opzione '{1}'. Il valore deve essere espresso nel formato '{2}'.
ja: コマンドライン構文エラー: '{0}' は、'{1}' オプションの有効な値ではありません。値は '{2}' の形式にする必要があります。
ko: 명령줄 구문 오류: '{0}'은(는) '{1}' 옵션에 유효한 값이 아닙니다. 값은 '{2}' 형식이어야 합니다.
pl: Błąd składni wiersza polecenia: „{0}” nie jest prawidłową wartością dla opcji „{1}”. Wartość musi mieć postać „{2}”.
pt_br: Erro de sintaxe de linha de comando: '{0}' não é um valor válido para a opção '{1}'. O valor precisa estar no formato '{2}'.
ru: Ошибка в синтаксисе командной строки: "{0}" не является допустимым значением для параметра "{1}". Значение должно иметь форму "{2}".
tr: Komut satırı söz dizimi hatası: '{0}', '{1}' seçeneği için geçerli bir değer değil. Değer '{2}' biçiminde olmalıdır.
zh_hans: 命令行语法错误:“{0}”不是“{1}”选项的有效值。值的格式必须为 "{2}"。
zh_hant: 命令列語法錯誤: '{0}' 對 '{1}' 選項而言不是有效的值。此值的格式必須是 '{2}'。

# ERR_BadUnsafeInUsingDirective
source: Only a 'using static' or 'using alias' can be 'unsafe'.
cs: Pouze „using static“ nebo „using alias“ může být „nebezpečný“.
fr: Seul un 'using static' ou 'using alias' peut être 'unsafe'.
it: Solo 'using static' o 'using alias' può essere 'unsafe'.
ja: 'unsafe' に設定できるのは、'using static' または 'using エイリアス' のみです。
pl: Tylko element „użycie statyczne” lub „użycie aliasu” może być „niebezpieczne”.
pt_br: Somente um 'usando estático' ou 'usando alias' pode ser 'inseguro'.
ru: Только параметр "using static" или "using alias" может иметь значение "unsafe".
zh_hans: 只有 “using static” 或 “using alias” 才能为 “unsafe”。
zh_hant: 只有 'using static' 或 'using alias' 可以是 'unsafe'。
