Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_StructLayoutCycle
source: Struct member '{0}' of type '{1}' causes a cycle in the struct layout
cs: Člen struktury {0} typu {1} způsobuje cyklus v rozložení struktury.
de: Der Strukturmember "{0}" vom Typ "{1}" verursacht eine Schleife im Strukturlayout.
es: El miembro de estructura '{0}' de tipo '{1}' crea un ciclo en el diseño de la estructura
fr: Le membre '{0}' de la structure de type '{1}' engendre un cycle dans la disposition de la structure
it: Il membro struct '{0}' di tipo '{1}' causa un ciclo nel layout della struct
ja: 型 '{1}' の構造体メンバー '{0}' により、構造体レイアウトで循環参照が発生します
ko: {1}' 형식의 '{0}' 구조체 멤버는 구조체 레이아웃에서 순환됩니다.
pl: Składowa „{0}” typu „{1}” powoduje wystąpienie cyklu w układzie struktury
pt_br: Membro struct "{0}" do tipo "{1}" gera um ciclo no layout de struct
ru: Член структуры "{0}" типа "{1}" приводит к циклу в этом макете структуры.
tr: {1}' türünün '{0}' yapı üyesi yapı düzeninde bir döngüye neden olur
zh_hans: “{1}”类型的结构成员“{0}”在结构布局中导致循环
zh_hant: 類型為 '{1}' 的結構成員 '{0}'，在結構配置中造成循環

# ERR_InterfacesCantContainFields
source: Interfaces cannot contain instance fields
cs: Rozhraní nemůžou obsahovat pole instance.
de: Schnittstellen können keine Instanzfelder enthalten.
es: Las interfaces no pueden incluir campos de instancia
fr: Les interfaces ne peuvent pas contenir de champs d'instance
it: Le interfacce non possono contenere campi di istanza
ja: インターフェイスにインスタンス フィールドを含めることはできません
ko: 인터페이스에는 인스턴스 필드가 포함될 수 없습니다.
pl: Interfejsy nie mogą zawierać pól wystąpienia
pt_br: As interfaces não podem conter campos de instância
ru: Интерфейсы не могут содержать поля экземпляра
tr: Arabirimler örnek alan içeremez
zh_hans: 接口不能包含实例字段
zh_hant: 介面不能包含執行個體欄位

# ERR_InterfacesCantContainConstructors
source: Interfaces cannot contain instance constructors
cs: Rozhraní nemůžou obsahovat konstruktory instance.
de: Schnittstellen können keine Instanzkonstruktoren enthalten.
es: Las interfaces no pueden incluir constructores de instancia
fr: Les interfaces ne peuvent pas contenir de constructeur d'instance
it: Le interfacce non possono contenere costruttori di istanza
ja: インターフェイスにインスタンス コンストラクターを含めることはできません
ko: 인터페이스에는 인스턴스 생성자가 포함될 수 없습니다.
pl: Interfejsy nie mogą zawierać konstruktorów wystąpienia
pt_br: As interfaces não podem conter constructors de instância
ru: Интерфейсы не могут содержать конструкторы экземпляров
tr: Arabirimler örnek oluşturucu içeremez
zh_hans: 接口不能包含实例构造函数
zh_hant: 介面不能包含執行個體建構函式

# ERR_NonInterfaceInInterfaceList
source: Type '{0}' in interface list is not an interface
cs: Typ {0} v seznamu rozhraní není rozhraní.
de: Der Typ "{0}" in der Schnittstellenliste ist keine Schnittstelle.
es: El tipo '{0}' de la lista de interfaces no es una interfaz
fr: Le type '{0}' dans la liste des interfaces n'est pas une interface
it: Il tipo '{0}' nell'elenco di interfacce non è un'interfaccia
ja: インターフェイス リストの型 '{0}' はインターフェイスではありません
ko: 인터페이스 목록에 있는 '{0}' 형식이 인터페이스가 아닙니다.
pl: Typ „{0}” na liście interfejsów nie jest interfejsem
pt_br: Tipo "{0}" na lista de interfaces não é uma interface
ru: Тип "{0}" в списке интерфейсов не является интерфейсом.
tr: Arabirim listesindeki '{0}' türü bir arabirim değildir
zh_hans: 接口列表中的类型“{0}”不是接口
zh_hant: 介面清單中的類型 '{0}' 不是介面

# ERR_DuplicateInterfaceInBaseList
source: '{0}' is already listed in interface list
cs: {0} je už uvedené v seznamu rozhraní.
de: '"{0}" ist bereits in der Schnittstellenliste aufgeführt.
es: '{0}' ya aparece en la lista de interfaces
fr: '{0}' est déjà énuméré dans la liste des interfaces
it: '{0}' è già presente nell'elenco delle interfacce
ja: '{0}' は既にインターフェイス リストに存在します
ko: '{0}'이(가) 이미 인터페이스 목록에 있습니다.
pl: 'Interfejs „{0}” już wyszczególniono na liście interfejsów
pt_br: "{0}" já está listado na lista de interfaces
ru: "{0}" уже присутствует в списке интерфейсов.
tr: '{0}' arabirim listesinde zaten listelenmiş
zh_hans: “{0}”已经在接口列表中列出
zh_hant: '{0}' 已列於介面清單中

# ERR_DuplicateInterfaceWithTupleNamesInBaseList
source: '{0}' is already listed in the interface list on type '{2}' with different tuple element names, as '{1}'.
cs: {0} je již uvedeno v seznamu rozhraní u typu {2} s jinými názvy prvků řazené kolekce členů jako {1}.
de: '"{0}" wird bereits in der Schnittstellenliste für den Typ "{2}" mit anderen Tupelelementnamen als "{1}" aufgeführt.
es: '{0}' ya se muestra en la lista de interfaces en el tipo '{2}' con nombres de elementos de tupla diferentes, como '{1}'.
fr: '{0}' est déjà listé dans la liste d'interfaces du type '{2}' avec d'autres noms d'éléments tuples, notamment '{1}'.
it: '{0}' è già incluso nell'elenco di interfacce nel tipo '{2}' con nomi di elementi di tupla diversi, come '{1}'.
ja: '{0}' は、型 '{2}' のインターフェイス リストに、異なるタプル要素名 '{1}' として既に指定されています。
ko: '{0}'은(는) 다른 튜플 요소 이름을 사용하는 '{2}' 형식에 대한 인터페이스 목록에 '{1}'(으)로 이미 나열되어 있습니다.
pl: 'Element „{0}” znajduje się już na liście interfejsów w typie „{2}” z różnymi nazwami elementów krotki jako „{1}”.
pt_br: '{0}' já está listado na lista de interface no tipo '{2}' com nomes de elemento de tupla diferentes, como '{1}'.
ru: "{0}" уже указан в списке интерфейсов типа "{2}" с другими именами элементов кортежа: "{1}".
tr: '{0}', '{2}' türünün arabirim listesinde '{1}' gibi başka demet öğesi adlarıyla birlikte zaten listelenmiş.
zh_hans: “{0}”已列入类型“{2}”的接口列表中，其中包含不同的元组元素名称，例如“{1}”。
zh_hant: '{0}' 已列於元組元素名稱不同的類型 '{2}' 介面清單中，名稱為 '{1}'。

# ERR_CycleInInterfaceInheritance
source: Inherited interface '{1}' causes a cycle in the interface hierarchy of '{0}'
cs: Zděděné rozhraní {1} způsobuje cyklus v hierarchii rozhraní {0}.
de: Die geerbte Schnittstelle "{1}" verursacht eine Schleife in der Schnittstellenhierarchie von "{0}".
es: La interfaz heredada '{1}' crea un ciclo en la jerarquía de interfaz de '{0}'
fr: L'interface héritée '{1}' provoque un cycle dans la hiérarchie des interfaces de '{0}'
it: L'interfaccia ereditata '{1}' causa un ciclo nella gerarchia delle interfacce di '{0}'
ja: 継承インターフェイス '{1}' により、'{0}' のインターフェイス階層内で循環参照が発生します
ko: 상속된 '{1}' 인터페이스는 '{0}'의 인터페이스 계층 구조에서 순환됩니다.
pl: Dziedziczony interfejs „{1}” jest przyczyną wystąpienia cyklu w hierarchii interfejsów „{0}”
pt_br: Interface herdada "{1}" gera um ciclo na hierarquia de interface de "{0}"
ru: Наследуемый интерфейс "{1}" образует циклическую ссылку в иерархии интерфейсов для "{0}".
tr: {1}' devralınan arabirimi '{0}' arabirim hiyerarşisinde bir döngüye neden oluyor
zh_hans: 继承接口“{1}”在“{0}”的接口层次结构中导致一个循环
zh_hant: 繼承的介面 '{1}' 造成 '{0}' 介面階層架構中出現循環

# ERR_HidingAbstractMethod
source: '{0}' hides inherited abstract member '{1}'
cs: {0} skryje zděděný abstraktní člen {1}.
de: '"{0}" blendet den geerbten abstrakten Member "{1}" aus.
es: '{0}' oculta el miembro abstracto heredado '{1}'
fr: '{0}' masque le membre abstrait hérité '{1}'
it: '{0}' nasconde il membro astratto ereditato '{1}'
ja: '{0}' は継承抽象メンバー '{1}' を隠します
ko: '{0}'은(는) 상속된 추상 멤버 '{1}'을(를) 숨깁니다.
pl: 'Element „{0}” ukrywa dziedziczoną, abstrakcyjną składową „{1}”
pt_br: "{0}" oculta membro abstrato herdado "{1}"
ru: "{0}" скрывает наследуемый абстрактный член "{1}".
tr: '{0}', devralınan soyut '{1}' üyesini gizliyor
zh_hans: “{0}”隐藏继承的抽象成员“{1}”
zh_hant: '{0}' 會隱藏繼承的抽象成員 '{1}'

# ERR_UnimplementedAbstractMethod
source: '{0}' does not implement inherited abstract member '{1}'
cs: {0} neimplementuje zděděný abstraktní člen {1}.
de: '"{0}" implementiert den geerbten abstrakten Member "{1}" nicht.
es: '{0}' no implementa el miembro abstracto heredado '{1}'
fr: '{0}' n'implémente pas le membre abstrait hérité '{1}'
it: '{0}' non implementa il membro astratto ereditato '{1}'
ja: '{0}' は継承抽象メンバー '{1}' を実装しません
ko: '{0}'은(는) 상속된 추상 멤버 '{1}'을(를) 구현하지 않습니다.
pl: 'Element „{0}” nie implementuje odziedziczonej abstrakcyjnej składowej „{1}”
pt_br: "{0}" não implementa membro abstrato herdado "{1}"
ru: "{0}" не реализует наследуемый абстрактный член "{1}".
tr: '{0}', devralınan '{1}' soyut üyesini uygulamaz
zh_hans: “{0}”不实现继承的抽象成员“{1}”
zh_hant: '{0}' 未實作繼承的抽象成員 '{1}'

# ERR_UnimplementedInterfaceMember
source: '{0}' does not implement interface member '{1}'
cs: {0} neimplementuje člen rozhraní {1}.
de: '"{0}" implementiert den Schnittstellenmember "{1}" nicht.
es: '{0}' no implementa el miembro de interfaz '{1}'
fr: '{0}' n'implémente pas le membre d'interface '{1}'
it: '{0}' non implementa il membro di interfaccia '{1}'
ja: '{0}' はインターフェイス メンバー '{1}' を実装しません
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다.
pl: 'Element „{0}” nie implementuje składowej interfejsu „{1}”
pt_br: "{0}" não implementa membro de interface "{1}"
ru: "{0}" не реализует член интерфейса "{1}".
tr: '{0}', '{1}' arabirim üyesini uygulamaz
zh_hans: “{0}”不实现接口成员“{1}”
zh_hant: '{0}' 未實作介面成員 '{1}'

# ERR_ObjectCantHaveBases
source: The class System.Object cannot have a base class or implement an interface
cs: Třída System.Object nemůže mít základní třídu ani nemůže implementovat rozhraní.
de: Die System.Object-Klasse kann keine Basisklasse haben oder eine Schnittstelle implementieren.
es: La clase System.Object no puede tener una clase base o implementar una interfaz
fr: La classe System.Object ne peut pas posséder de classe de base ni implémenter une interface
it: La classe System.Object non può avere una classe base o implementare un'interfaccia
ja: クラス System.Object は基底クラスを含んだり、インターフェイスを実装したりできません。
ko: System.Object 클래스는 기본 클래스를 포함할 수 없으며 인터페이스를 구현할 수 없습니다.
pl: Klasa System.Object nie może mieć klasy bazowej ani implementować interfejsu
pt_br: Classe System.Object não pode ter uma classe base nem implementar uma interface
ru: Класс System.Object не может иметь базовый класс или реализовывать интерфейс.
tr: System.Object bir temel sınıfa sahip olamaz veya arabirim uygulayamaz
zh_hans: 类 System.Object 不能有基类也不能实现接口
zh_hant: 類別 System.Object 不能有基底類別或實作介面

# ERR_ExplicitInterfaceImplementationNotInterface
source: '{0}' in explicit interface declaration is not an interface
cs: {0} v explicitní deklaraci rozhraní není rozhraní.
de: '"{0}" in der expliziten Schnittstellendeklaration ist keine Schnittstelle.
es: '{0}' en la declaración explícita de la interfaz no es una interfaz
fr: '{0}' dans une déclaration d'interface explicite n'est pas une interface
it: '{0}' nella dichiarazione esplicita dell'interfaccia non è un'interfaccia
ja: '明示的インターフェイス宣言の中の '{0}' はインターフェイスではありません
ko: '명시적 인터페이스 선언에서 '{0}'은(는) 인터페이스가 아닙니다.
pl: 'Element „{0}” w jawnej deklaracji interfejsu nie jest interfejsem
pt_br: "{0}" na declaração de interface explícita não é uma interface
ru: "{0}" в явном объявлении интерфейса не является интерфейсом.
tr: 'Açık arabirim bildirimindeki '{0}' bir arabirim değil
zh_hans: '显式接口声明中的“{0}”不是接口
zh_hant: '在明確介面宣告中的 '{0}' 不是介面

# ERR_InterfaceMemberNotFound
source: '{0}' in explicit interface declaration is not found among members of the interface that can be implemented
cs: {0} v explicitní deklaraci rozhraní se nenašel mezi členy rozhraní, které se dají implementovat.
de: "{0}" in der expliziten Schnittstellendeklaration wurde unter den implementierbaren Membern der Schnittstelle nicht gefunden.
es: No se encuentra "{0}" en la declaración de interfaz explícita entre los miembros de la interfaz que se pueden implementar
fr: '{0}' dans la déclaration d'interface explicite est introuvable parmi les membres de l'interface pouvant être implémentée
it: Nella dichiarazione di interfaccia esplicita '{0}' non è stato trovato tra i membri dell'interfaccia implementabili
ja: 明示的なインターフェイス宣言内の '{0}' が、実装可能なインターフェイスのメンバーの中に見つかりません
ko: 명시적 인터페이스 선언에서 구현할 수 있는 인터페이스 멤버 중에 '{0}'이(가) 없습니다.
pl: W jawnej deklaracji interfejsu nie znaleziono elementu „{0}” wśród składowych interfejsu, które można implementować
pt_br: '{0}' na declaração de interface explícita não se encontra entre os membros da interface que podem ser implementados
ru: Не удается найти "{0}" в явном объявлении интерфейса среди членов интерфейса, которые могут быть реализованы
tr: Açık arabirim bildirimindeki '{0}', uygulanabilecek arabirimin üyeleri arasında bulunamadı
zh_hans: 在可实现的接口的成员中找不到显式接口声明中的 "{0}"
zh_hant: 在明確介面宣告中，無法在可實作的介面成員間找到 '{0}'

# ERR_ClassDoesntImplementInterface
source: '{0}': containing type does not implement interface '{1}'
cs: {0}: Nadřazený typ neimplementuje rozhraní {1}.
de: '"{0}": Der enthaltende Typ implementiert die "{1}"-Schnittstelle nicht.
es: '{0}': el tipo contenedor no implementa la interfaz '{1}'
fr: '{0}' : le type conteneur n'implémente pas l'interface '{1}'
it: '{0}': il tipo che lo contiene non implementa l'interfaccia '{1}'
ja: '{0}': 含む型は、インターフェイス '{1}' を実装しません
ko: '{0}': 포함하는 형식이 '{1}' 인터페이스를 구현하지 않습니다.
pl: „{0}”: typ zawierający nie implementuje interfejsu „{1}”
pt_br: "{0}": tipo recipiente não implementa interface "{1}"
ru: "{0}": вмещающий тип не реализует интерфейс "{1}".
tr: '{0}': içeren tür '{1}' arabirimini uygulamıyor
zh_hans: “{0}”: 包含类型不实现接口“{1}”
zh_hant: '{0}': 包含類型未實作介面 '{1}'

# ERR_ExplicitInterfaceImplementationInNonClassOrStruct
source: '{0}': explicit interface declaration can only be declared in a class, record, struct or interface
cs: {0}: Explicitní deklaraci rozhraní se dá použít jen ve třídě, záznamu, struktuře nebo rozhraní.
fr: '{0}' : une déclaration d'interface explicite peut être déclarée uniquement dans une classe, un enregistrement, un struct ou une interface
it: '{0}': la dichiarazione esplicita dell'interfaccia può essere dichiarata sono in una classe, un record, uno struct o un'interfaccia
ja: '{0}': 明示的インターフェイス宣言はクラス、レコード、構造体、またはインターフェイスの中でのみ宣言できます
pl: „{0}”: jawna deklaracja interfejsu może występować tylko w klasie, rekordzie, strukturze lub interfejsie
pt_br: '{0}': a declaração de interface explícita pode ser declarada somente em uma classe, um registro, um struct ou uma interface
ru: "{0}": явное объявление интерфейса может содержаться только в классе, записи, структуре или интерфейсе.
zh_hans: “{0}”: 显式接口声明只能在类、记录、结构或接口中声明
zh_hant: '{0}': 明確的介面宣告只能在類別、記錄、結構或介面中宣告

# ERR_MemberNameSameAsType
source: '{0}': member names cannot be the same as their enclosing type
cs: {0}: Názvy členů nemůžou být stejné jako názvy jejich nadřazených typů.
de: '"{0}": Membernamen dürfen nicht dem einschließenden Typ entsprechen.
es: '{0}': los nombres de los miembros no pueden coincidir con sus tipos envolventes
fr: '{0}' : les noms de membres doivent être différents de leur type englobant
it: '{0}': i nomi dei membri non possono essere uguali a quelli del tipo di inclusione
ja: '{0}': メンバー名をそれを囲む型の名前と同じにすることはできません
ko: '{0}': 멤버 이름은 바깥쪽 형식과 같을 수 없습니다.
pl: „{0}”: nazwy składowych nie mogą być takie same jak nazwa zawierającego je typu
pt_br: "{0}": nomes de membro não podem ser os mesmos do seu tipo delimitador
ru: "{0}": имена членов не могут совпадать с именами типов, в которых они содержатся
tr: '{0}': üye adları kapanış türleri ile aynı olama
zh_hans: “{0}”: 成员名不能与它们的封闭类型相同
zh_hant: '{0}': 成員名稱不可與其封入類型名稱相同

# ERR_EnumeratorOverflow
source: '{0}': the enumerator value is too large to fit in its type
cs: {0}: Hodnota výčtu je pro příslušný typ moc velká.
de: '"{0}": Der Enumeratorwert ist zu groß für seinen Typ.
es: '{0}': el valor del enumerador es demasiado grande para ajustarse a su tipo
fr: '{0}' : la valeur de l'énumérateur est trop grande pour ce type
it: '{0}': il valore dell'enumeratore è troppo grande per il tipo
ja: '{0}': 列挙子の値は、型に対して大きすぎます
ko: '{0}': 열거자 값이 너무 커서 해당 형식에 맞지 않습니다.
pl: „{0}”: wartość, która wystąpiła w module wyliczającym, jest zbyt duża, aby można było ją stosować przy użyciu typu tego modułu
pt_br: "{0}": o valor do enumerador é muito grande para se ajustar ao seu tipo
ru: "{0}": значение перечислителя недопустимо велико для типа, к которому он относится.
tr: '{0}': numaralandırıcı değeri türüne sığamayacak kadar büyük
zh_hans: “{0}”: 枚举器值太大，不能适应它的类型
zh_hant: '{0}': 就其類型而言，此列舉值過大

# ERR_CantOverrideNonProperty
source: '{0}': cannot override because '{1}' is not a property
cs: {0}: Nejde přepsat, protože {1} není vlastnost.
de: '"{0}": Überschreiben nicht möglich; "{1}" ist keine Eigenschaft.
es: '{0}': no se puede invalidar porque '{1}' no es una propiedad
fr: '{0}' : substitution impossible, car '{1}' n'est pas une propriété
it: '{0}': non è possibile eseguire l'override. '{1}' non è una proprietà
ja: '{0}': '{1}' はプロパティではないためオーバーライドできません
ko: '{0}': '{1}'이(가) 속성이 아니므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić, ponieważ element „{1}” nie jest właściwością
pt_br: "{0}": não é possível substituir porque "{1}" não é uma propriedade
ru: "{0}": невозможно переопределить, так как "{1}" не является свойством.
tr: '{0}': '{1}' bir özellik olmadığından geçersiz kılınamıyor
zh_hans: “{0}”: 无法重写，因为“{1}”不是属性
zh_hant: '{0}': 因為 '{1}' 不是屬性，所以無法覆寫

# ERR_NoGetToOverride
source: '{0}': cannot override because '{1}' does not have an overridable get accessor
cs: {0}: Nejde přepsat, protože {1} neobsahuje přepsatelný přistupující objekt get.
de: '"{0}": Überschreiben nicht möglich, weil "{1}" keinen überschreibbaren get-Accessor hat.
es: '{0}': no se puede invalidar porque '{1}' no tiene un descriptor de acceso get invalidable
fr: '{0}' : substitution impossible, car '{1}' n'a pas d'accesseur get substituable
it: '{0}': non è possibile eseguire l'override perché '{1}' non ha una funzione di accesso get di cui eseguire l'override
ja: '{0}': '{1}' に、オーバーライド可能な get アクセサーがないため、オーバーライドできません
ko: '{0}': '{1}'에 재정의 가능한 get 접근자가 없으므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić, ponieważ element „{1}” nie ma metody dostępu get, którą można przesłonić
pt_br: "{0}": não pode substituir porque "{1}" não tem um acessador get substituível
ru: "{0}": переопределение невозможно, так как "{1}" не имеет функции доступа get, доступной для переопределения.
tr: '{0}': '{1}' öğesi geçersiz kılınabilir bir get erişenine sahip olmadığından geçersiz kılınamıyor
zh_hans: “{0}”: 无法重写，因为“{1}”没有可重写的 get 访问器
zh_hant: '{0}': 因為 '{1}' 沒有可覆寫的 get 存取子，所以無法覆寫

# ERR_NoSetToOverride
source: '{0}': cannot override because '{1}' does not have an overridable set accessor
cs: {0}: Nejde přepsat, protože {1} neobsahuje přepsatelný přistupující objekt set.
de: '"{0}": Überschreiben nicht möglich, weil "{1}" keinen überschreibbaren set-Accessor hat.
es: '{0}': no se puede invalidar porque '{1}' no tiene un descriptor de acceso set invalidable
fr: '{0}' : substitution impossible, car '{1}' n'a pas d'accesseur set substituable
it: '{0}': non è possibile eseguire l'override perché '{1}' non ha di una funzione di accesso set di cui eseguire l'override
ja: '{0}': '{1}' に、オーバーライド可能な set アクセサーがないため、オーバーライドできません
ko: '{0}': '{1}'에 재정의 가능한 set 접근자가 없으므로 재정의할 수 없습니다.
pl: „{0}”: nie można przesłonić, ponieważ element „{1}” nie ma metody dostępu set, którą można przesłonić
pt_br: "{0}": não pode substituir porque "{1}" não tem um acessador set substituível
ru: "{0}": переопределение невозможно, так как "{1}" не имеет функции доступа set, доступной для переопределения.
tr: '{0}': '{1}' öğesinin geçersiz kılınabilir bir set erişeni olmadığından geçersiz kılınamıyor
zh_hans: “{0}”: 无法重写，因为“{1}”没有可重写的 set 访问器
zh_hant: '{0}': 因為 '{1}' 沒有可覆寫的 set 存取子，所以無法覆寫

# ERR_PropertyCantHaveVoidType
source: '{0}': property or indexer cannot have void type
cs: {0}: Vlastnost nebo indexer nemůže být typu void.
de: '"{0}": Eigenschaften oder Indexer können nicht über einen void-Typ verfügen.
es: '{0}': la propiedad o el indizador no pueden tener el tipo void
fr: '{0}' : une propriété ou un indexeur ne peut pas être de type void
it: '{0}': la proprietà o l'indicizzatore non può avere un tipo void
ja: '{0}': プロパティまたはインデクサーに void 型を指定することはできません
ko: '{0}': 속성이나 인덱서에는 void 형식을 사용할 수 없습니다.
pl: „{0}”: właściwość ani indeksator nie mogą być typu void
pt_br: "{0}": propriedade ou indexador não pode ter tipo void
ru: "{0}": свойство или индексатор не могут иметь тип void.
tr: '{0}': özellik veya dizin oluşturucu void türüne sahip olamaz
zh_hans: “{0}”: 属性或索引器不能具有 void 类型
zh_hant: '{0}': 屬性或索引子不可有 void 類型

# ERR_PropertyWithNoAccessors
source: '{0}': property or indexer must have at least one accessor
cs: {0}: Vlastnost nebo indexer musí obsahovat aspoň jeden přistupující objekt.
de: '"{0}": Die Eigenschaft oder der Indexer muss mindestens einen Accessor haben.
es: '{0}': la propiedad o el indizador deben tener, al menos, un descriptor de acceso
fr: '{0}' : une propriété ou un indexeur doit avoir au moins un accesseur
it: '{0}': la proprietà o l'indicizzatore deve avere almeno una funzione di accesso
ja: '{0}': プロパティまたはインデクサーには少なくとも 1 つのアクセサーを指定する必要があります
ko: '{0}': 속성이나 인덱서에는 접근자가 하나 이상 있어야 합니다.
pl: „{0}”: właściwość lub indeksator musi mieć co najmniej jedna metodę dostępu
pt_br: "{0}": propriedade ou indexador deve ter no mínimo um acessador
ru: "{0}": для свойства или индексатора должен быть указан по крайней мере один метод доступа.
tr: '{0}': özellik veya dizin oluşturucu en az bir erişene sahip olmalıdır
zh_hans: “{0}”: 属性或索引器必须至少有一个访问器
zh_hant: '{0}': 屬性或索引子至少必須要有一個存取子

# ERR_NewVirtualInSealed
source: '{0}' is a new virtual member in sealed type '{1}'
cs: {0} je nový virtuální člen v zapečetěném typu {1}.
fr: '{0}' est un nouveau membre virtuel du type sealed '{1}'
it: '{0}' è un nuovo membro virtuale nel tipo sealed '{1}'
ja: '{0}' は sealed 型 '{1}' の新しい仮想メンバーです
pl: „{0}” to nowa wirtualna składowa typu zapieczętowanego „{1}”
pt_br: '{0}' é um novo membro virtual no tipo selado '{1}'
ru: "{0}" — новый виртуальный элемент в запечатанном типе "{1}".
zh_hans: “{0}”是密封类型“{1}”中新的虚拟成员
zh_hant: '{0}' 是密封類型 '{1}' 中新的虛擬成員

# ERR_ExplicitPropertyAddingAccessor
source: '{0}' adds an accessor not found in interface member '{1}'
cs: {0} přidává přistupující objekt, který se nenašel v členu rozhraní {1}.
de: '"{0}" fügt einen Accessor hinzu, der nicht im Schnittstellenmember "{1}" gefunden werden konnte.
es: '{0}' agrega un descriptor de acceso que no se encuentra en el miembro de interfaz '{1}'
fr: '{0}' ajoute un accesseur introuvable dans le membre d'interface '{1}'
it: '{0}' aggiunge una funzione di accesso non trovata nel membro di interfaccia '{1}'
ja: '{0}' はインターフェイス メンバー '{1}' にないアクセサーを追加します
ko: '{0}'이(가) '{1}' 인터페이스 멤버에서 찾을 수 없는 접근자를 추가합니다.
pl: 'Element „{0}” dodaje metodę dostępu, której nie znaleziono w składowej interfejsu „{1}”
pt_br: "{0}" adiciona um assessor não encontrado no membro de interface "{1}"
ru: "{0}" добавляет метод доступа, не обнаруженный в члене интерфейса "{1}".
tr: '{0}', '{1}' arabirim üyesinde bulunmayan bir erişen ekliyor
zh_hans: “{0}”添加了接口成员“{1}”中没有的访问器
zh_hant: '{0}' 加入了在介面成員 '{1}' 中找不到的存取子

# ERR_ExplicitPropertyMissingAccessor
source: Explicit interface implementation '{0}' is missing accessor '{1}'
cs: V explicitní implementaci rozhraní {0} chybí přistupující objekt {1}.
de: Der expliziten Schnittstellenimplementierung "{0}" fehlt der "{1}"-Accessor.
es: A la implementación de interfaz explícita '{0}' le falta el descriptor de acceso '{1}'
fr: L'accesseur '{1}' est manquant dans l'implémentation d'interface explicite '{0}'
it: Nell'implementazione esplicita dell'interfaccia '{0}' manca la funzione di accesso '{1}'
ja: 明示的なインターフェイスの実装 '{0}' にアクセサー '{1}' はありません
ko: 명시적 인터페이스 구현 '{0}'에 '{1}' 접근자가 없습니다.
pl: W jawnej implementacji interfejsu „{0}” brakuje metody dostępu „{1}”
pt_br: Implementação de interface explícita "{0}" está sem o acessador "{1}"
ru: В явной реализации интерфейса "{0}" отсутствует метод доступа "{1}".
tr: {0}' açık arabirim uygulamasında '{1}' erişeni eksik
zh_hans: 显式接口实现“{0}”缺少访问器“{1}”
zh_hant: 明確介面實作 '{0}' 遺失存取子 '{1}'
