Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_DuplicateLabel
source: The label '{0}' is a duplicate
cs: Návěstí {0} je duplicitní.
de: Die Bezeichnung "{0}" ist ein Duplikat.
es: La etiqueta '{0}' está duplicada
fr: L'étiquette '{0}' est un doublon
it: L'etichetta '{0}' è un duplicato
ja: ラベル '{0}' が重複しています
ko: {0}' 레이블이 중복되었습니다.
pl: Etykieta „{0}” jest duplikatem
pt_br: O rótulo "{0}" é uma duplicata
ru: Повторяющаяся метка "{0}".
tr: {0}' etiketi bir yinelenen
zh_hans: 标签“{0}”重复
zh_hant: 標籤 '{0}' 重複

# ERR_NoConstructors
source: The type '{0}' has no constructors defined
cs: Pro typ {0} nejsou definované žádné konstruktory.
de: Für den {0}-Typ sind keine Konstruktoren definiert.
es: El tipo '{0}' no tiene constructores definidos
fr: Aucun constructeur n'est défini pour le type '{0}'
it: Per il tipo '{0}' non sono definiti costruttori
ja: 型 '{0}' のコンストラクターが定義されていません
ko: {0}' 형식에 정의된 생성자가 없습니다.
pl: Typ „{0}” nie ma zdefiniowanego konstruktora.
pt_br: O tipo "{0}" não tem construtores definidos
ru: Для типа "{0}" не определен конструктор.
tr: {0}' türünün tanımlı bir oluşturucusu yok
zh_hans: 类型“{0}”未定义构造函数
zh_hant: 類型 '{0}' 未定義任何建構函式

# ERR_NoNewAbstract
source: Cannot create an instance of the abstract type or interface '{0}'
cs: Nejde vytvořit instanci abstraktního typu nebo rozhraní {0}.
fr: Impossible de créer une instance du type abstract ou de l'interface '{0}'
it: Non è possibile creare un'istanza dell'interfaccia o del tipo astratto '{0}'
ja: 抽象型またはインターフェイス '{0}' のインスタンスを作成できません
pl: Nie można utworzyć wystąpienia typu lub interfejsu abstrakcyjnego „{0}”
pt_br: Não é possível criar uma instância do tipo abstrato ou da interface '{0}'
ru: Не удается создать экземпляр абстрактного типа или интерфейса "{0}"
zh_hans: 无法创建抽象类型或接口“{0}”的实例
zh_hant: 無法建立抽象類型或介面 '{0}' 的執行個體

# ERR_ConstValueRequired
source: A const field requires a value to be provided
cs: Pole const vyžaduje zadání hodnoty.
de: Für ein Konstantenfeld muss ein Wert bereitgestellt werden.
es: El campo const requiere que se proporcione un valor
fr: Un champ const nécessite une valeur
it: È necessario specificare un valore nel campo const
ja: const フィールドに値を指定する必要があります
ko: const 필드에 값을 입력해야 합니다.
pl: Pole stałej wymaga podania wartości
pt_br: O campo const requer um valor a ser fornecido
ru: Требуется указать значение поля const.
tr: Const alan bir değer sağlanmasını gerektirir
zh_hans: 常量字段要求提供一个值
zh_hant: 需要為 const 欄位提供值

# ERR_CircularBase
source: Circular base type dependency involving '{0}' and '{1}'
cs: Prvky {0} a {1} jsou součástí cyklické závislosti základního typu.
fr: Dépendance de type de base circulaire impliquant '{0}' et '{1}'
it: Dipendenza circolare del tipo di base che interessa '{0}' e '{1}'
ja: '{0}' と '{1}' を含む、循環する基本データ型の依存関係です
pl: Cykliczna zależność typu bazowego obejmująca element „{0}” i „{1}”
pt_br: Dependência de tipo base circular envolvendo '{0}' e '{1}'
ru: Циклическая зависимость базового типа включает "{0}" и "{1}".
zh_hans: 涉及“{0}”和“{1}”的循环基类型依赖项
zh_hant: 循環基底類型相依性包括 '{0}' 和 '{1}'

# ERR_BadDelegateConstructor
source: The delegate '{0}' does not have a valid constructor
cs: Delegát {0} nemá platný konstruktor.
de: Der Delegat "{0}" enthält keinen gültigen Konstruktor.
es: El delegado '{0}' no tiene un constructor válido
fr: Le délégué '{0}' n'a pas de constructeur valide
it: Il delegato '{0}' non ha un costruttore valido
ja: デリゲート '{0}' には有効なコンストラクターがありません
ko: {0}' 대리자에는 유효한 생성자가 없습니다.
pl: W delegacie „{0}” brak prawidłowego konstruktora.
pt_br: O representante "{0}" não tem um construtor válido
ru: Делегат "{0}" не имеет допустимого конструктора.
tr: {0}' temsilcisinin geçerli bir oluşturucusu yok
zh_hans: 委托“{0}”没有有效的构造函数
zh_hant: 委派 '{0}' 沒有有效的建構函式

# ERR_MethodNameExpected
source: Method name expected
cs: Očekává se název metody.
de: Methodenname erwartet.
es: Se espera un nombre de método
fr: Nom de méthode attendu
it: È previsto il nome di un metodo
ja: メソッド名が必要です
ko: 메서드 이름이 필요합니다.
pl: Oczekiwano nazwy metody
pt_br: Nome de método esperado
ru: Требуется имя метода.
tr: Yöntem adı bekleniyor
zh_hans: 应输入方法名称
zh_hant: 必須是方法名稱

# ERR_ConstantExpected
source: A constant value is expected
cs: Očekává se konstantní hodnota.
de: Konstantenwert erwartet.
es: Se espera un valor constante
fr: Une valeur de constante est attendue
it: È previsto un valore costante
ja: 定数値が必要です
ko: 상수 값이 필요합니다.
pl: Oczekiwano wartości stałej
pt_br: Um valor constante é esperado
ru: Требуется постоянное значение.
tr: Sabit değer bekleniyor
zh_hans: 应输入常量值
zh_hant: 必須是常數值

# ERR_V6SwitchGoverningTypeValueExpected
source: A switch expression or case label must be a bool, char, string, integral, enum, or corresponding nullable type in C# 6 and earlier.
cs: Výraz switch nebo popisek větve musí být bool, char, string, integral, enum nebo odpovídající typ s možnou hodnotou null v jazyce C# 6 nebo starším.
de: Ein switch-Ausdruck oder eine case-Bezeichnung muss den Typ "bool", "char", "string", "integral", "enum" oder einen entsprechenden Nullable-Typ in C# 6 oder früher aufweisen.
es: Una expresión switch o etiqueta de caso debe ser del tipo bool, char, string, integral, enum o del correspondiente tipo que acepte valores NULL en C# 6 y versiones anteriores.
fr: Une expression switch ou une étiquette case doit être de type bool, char, string, integral, enum ou Nullable correspondant en C# 6 et dans les versions antérieures.
it: L'espressione switch o l'etichetta case deve essere un tipo bool, char, string, integrale, enum o un tipo nullable corrispondente in C# 6 e versioni precedenti.
ja: C# 6 以前のものにおいて、switch 式または case ラベルには、bool、char、string、integral、enum、または対応する null 許容型を使用する必要があります。
ko: C# 6 이전 버전에서 switch 식 또는 case 레이블은 bool, char, string, integral, enum 또는 해당하는 nullable 형식이어야 합니다.
pl: Wyrażenie switch lub etykieta case musi być wartością logiczną, znakiem, ciągiem, liczbą całkowitą, wyliczeniem lub odpowiadającym typem dopuszczającym wartość null w języku C# 6 i wcześniejszych wersjach.
pt_br: Uma expressão de switch ou um rótulo case deve ser um bool, char, cadeia, integral ou um tipo que permite valor nulo correspondente em C# 6 e anterior.
ru: Выражение switch или метка case должны быть логическим значением, символом, строкой, целым числом, перечислением или соответствующим типом, принимающим значение NULL, в C# 6 и более ранних версиях.
tr: Bir switch ifadesi veya case etiketi C# 6 veya daha önceki bir sürümde bool, char, string, integral, enum veya karşılık gelen null atanabilir tür olmalıdır.
zh_hans: switch 表达式或事例标签必须是 bool、char、string、integral、enum 或 C#6 及更早版本中相应的可以为 null 的类型。
zh_hant: Switch 運算式或 case 標籤必須是 bool、char、string、integral、enum 或 C# 6 及舊版中對應的可為 Null 類型。

# ERR_DuplicateCaseLabel
source: The switch statement contains multiple cases with the label value '{0}'
cs: Příkaz switch obsahuje víc případů s hodnotou návěstí {0}.
de: Die switch-Anweisung enthält mehrere case-Bezeichnungen mit dem Wert "{0}".
es: La instrucción switch contiene varios casos con el valor de etiqueta '{0}'
fr: L'instruction switch contient plusieurs cas avec la valeur d'étiquette '{0}'
it: L'istruzione switch contiene più usi di maiuscole/minuscole con il valore di etichetta '{0}'
ja: switch ステートメントに、ラベル値が '{0}' の case が複数含まれています
ko: switch 문에 '{0}' 레이블 값을 사용하는 경우가 여러 개 포함되어 있습니다.
pl: Instrukcja switch zawiera wiele etykiet case o wartości „{0}”
pt_br: A instrução switch contém vários casos com o valor de rótulo "{0}"
ru: Предложение Switch содержит несколько случаев со значением метки "{0}".
tr: Switch deyimi '{0}' etiket değeri ile birden çok durum içeriyor
zh_hans: switch 语句包含多个具有标签值“{0}”的情况
zh_hant: switch 陳述式包含多個標籤值為 '{0}' 的情況

# ERR_InvalidGotoCase
source: A goto case is only valid inside a switch statement
cs: Příkaz goto case je platný jenom uvnitř příkazu switch.
de: Eine "goto case"-Anweisung ist nur innerhalb einer switch-Anweisung gültig.
es: Una instrucción goto case solo es válida dentro de una instrucción switch
fr: Un goto case n'est valide qu'au sein d'une instruction switch
it: La sintassi goto case è valida soltanto all'interno di un'istruzione switch
ja: goto は switch ステートメント内でのみ有効です
ko: goto case는 switch 문 내부에서만 사용할 수 있습니다.
pl: Instrukcja goto case jest prawidłowa tylko wewnątrz instrukcji switch
pt_br: Um goto case só é válido dentro de uma instrução switch
ru: Оператор goto case допустим только внутри оператора выбора.
tr: Goto case yalnızca switch deyimi içinde geçerlidir
zh_hans: goto case 只在 switch 语句中有效
zh_hant: goto case 只有在 switch 陳述式中有效

# ERR_PropertyLacksGet
source: The property or indexer '{0}' cannot be used in this context because it lacks the get accessor
cs: Vlastnost nebo indexer {0} nejde v tomto kontextu použít, protože neobsahuje přistupující objekt get.
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, weil der get-Accessor fehlt.
es: La propiedad o el indizador '{0}' no se puede usar en este contexto porque carece del descriptor de acceso get
fr: Impossible d'utiliser la propriété ou l'indexeur '{0}' dans ce contexte, car il lui manque l'accesseur get
it: Non è possibile usare la proprietà o l'indicizzatore '{0}' in questo contesto perché manca la funzione di accesso get
ja: get アクセサーがないため、プロパティまたはインデクサー '{0}' をこのコンテキストで使用することはできません
ko: {0}' 속성 또는 인덱서는 get 접근자가 없으므로 이 컨텍스트에서 사용할 수 없습니다.
pl: W tym kontekście nie można użyć właściwości lub indeksatora „{0}”, ponieważ brakuje dla niej metody dostępu Get.
pt_br: A propriedade ou o indexador "{0}" não pode ser usado neste contexto porque não possui o acessador get
ru: Свойство или индексатор "{0}" не может использоваться в этом контексте, так как не имеет метода доступа get.
tr: {0}' özelliği veya dizin erişimcisi, alma erişimcisi olmadığından bu bağlamda kullanılamaz
zh_hans: 属性或索引器“{0}”不能用在此上下文中，因为它缺少 get 访问器
zh_hant: 屬性或索引子 '{0}' 無法用在此內容中，因為它缺少 get 存取子

# ERR_BadExceptionType
source: The type caught or thrown must be derived from System.Exception
cs: Zachycený nebo vyvolaný typ musí být odvozený od třídy System.Exception.
de: Der aufgefangene oder ausgelöste Typ muss von System.Exception abgeleitet werden.
es: El tipo detectado o producido debe derivarse de System.Exception
fr: Le type intercepté ou levé doit être dérivé de System.Exception
it: Il tipo rilevato o generato deve derivare da System.Exception
ja: キャッチ、または スローされた型は System.Exception から派生したものでなければなりません。
ko: Catch 또는 Throw된 형식은 System.Exception에서 파생되어야 합니다.
pl: Przechwycony lub zgłoszony typ musi pochodzić od klasy System.Exception
pt_br: O tipo caught ou thrown deve ser derivado de System.Exception
ru: Тип в операторах caught или thrown должен быть производным от System.Exception.
tr: Yakalanan veya oluşturulan tür System.Exception'dan türetilmiş olmalıdır
zh_hans: 捕获或抛出的值的类型必须从 System.Exception 派生
zh_hant: 類型 catch 或 throw 必須衍生自 System.Exception

# ERR_BadEmptyThrow
source: A throw statement with no arguments is not allowed outside of a catch clause
cs: Příkaz throw bez argumentů není povolený vně klauzule catch.
de: Eine throw-Anweisung ohne Argumente ist außerhalb einer catch-Klausel unzulässig.
es: No se permite una instrucción throw sin argumentos fuera de una cláusula catch
fr: Une instruction throw sans argument n'est pas autorisée à l'extérieur d'une clause catch
it: L'utilizzo dell'istruzione throw senza argomenti non è consentito all'esterno di una clausola catch
ja: 引数なしの throw ステートメントは catch 句以外では使えません
ko: 인수가 없는 Throw 문은 Catch 절 외부에서 사용할 수 없습니다.
pl: Instrukcja throw bez żadnych argumentów jest niedozwolona poza klauzulą catch
pt_br: Uma instrução throw sem argumentos não é permitida fora de uma cláusula catch
ru: Оператор throw без аргументов не может использоваться вне предложения catch.
tr: Bağımsız değişken içermeyen bir throw deyimi bir catch yan tümcesinin dışında kullanılamaz
zh_hans: 无参数的 throw 语句不允许在 catch 子句之外使用
zh_hant: 沒有引數的 throw 陳述式不可用於 catch 子句之外

# ERR_BadFinallyLeave
source: Control cannot leave the body of a finally clause
cs: Řízení nemůže opustit tělo klauzule finally.
de: Das Steuerelement kann den Text einer finally-Klausel nicht verlassen.
es: El control no puede salir del texto de una cláusula finally
fr: Le contrôle ne peut pas laisser le corps d'une clause finally
it: Il controllo non può lasciare il corpo di una clausola finally
ja: コントロールが finally 句の本体から出られません
ko: 제어가 finally 절의 본문을 벗어날 수 없습니다.
pl: Sterowanie nie może opuścić treści klauzuli finally
pt_br: O controle não pode sair do corpo de uma cláusula finally
ru: Управление не может быть передано из тела предложения finally.
tr: Denetim finally yan tümcesinin gövdesinden çıkamaz
zh_hans: 控制流不能从 finally 子句中离开
zh_hant: 控制項不可脫離 finally 子句的主體

# ERR_LabelShadow
source: The label '{0}' shadows another label by the same name in a contained scope
cs: Návěstí {0} stíní v obsaženém oboru jiné návěstí se stejným názvem.
de: Die Bezeichnung "{0}" führt Shadowing für eine andere Bezeichnung mit demselben Namen in einem enthaltenen Gültigkeitsbereich durch.
es: La etiqueta '{0}' oculta otra etiqueta del mismo nombre en un ámbito contenido
fr: L'étiquette '{0}' cache une autre étiquette qui porte le même nom dans une portée contenue
it: L'etichetta '{0}' è la replica di un'altra etichetta con lo stesso nome in un ambito contenuto
ja: スコープ内に、ラベル '{0}' と同じ名前のラベルが存在しますが、無視されます
ko: {0}' 레이블은 포함된 범위에서 같은 이름으로 다른 레이블을 숨깁니다.
pl: Etykieta „{0}” zasłania inną etykietę o takiej samej nazwie w zawartym zakresie
pt_br: O rótulo "{0}" é sombra de outro rótulo com o mesmo nome em um escopo contido
ru: Метка "{0}" во вложенной области видимости скрывает другую метку с тем же именем.
tr: {0}' etiketi, içerilen bir kapsam içinde aynı addaki başka bir etiketi gölgeliyor
zh_hans: 在包含的范围中标签“{0}”遮盖了具有同样名称的另一个标签
zh_hant: 標籤 '{0}' 所包含的範圍內以相同的名稱遮蔽了另一個標籤

# ERR_LabelNotFound
source: No such label '{0}' within the scope of the goto statement
cs: V rozsahu příkazu goto není žádné takové návěstí {0}.
de: Die Bezeichnung "{0}" ist im Bereich der goto-Anweisung nicht vorhanden.
es: No existe la etiqueta '{0}' en el ámbito de la instrucción goto
fr: Il n'existe pas d'étiquette '{0}' dans la portée de l'instruction goto
it: L'etichetta '{0}' non esiste nell'ambito dell'istruzione goto
ja: goto ステートメントのスコープに '{0}' というラベルはありません
ko: goto 문의 범위 내에 '{0}' 레이블이 없습니다.
pl: Brak etykiety „{0}” w zakresie instrukcji goto
pt_br: Nenhum rótulo "{0}" dentro do escopo da instrução goto
ru: В области видимости оператора goto отсутствует метка "{0}".
tr: Goto deyiminin kapsamında '{0}' etiketi yok
zh_hans: goto 语句范围内没有“{0}”这样的标签
zh_hant: goto 陳述式的範圍內沒有這種標籤 '{0}'

# ERR_UnreachableCatch
source: A previous catch clause already catches all exceptions of this or of a super type ('{0}')
cs: Předchozí klauzule catch už zachytává všechny výjimky vyvolávané tímto typem nebo nadtypem ({0}).
de: Eine vorherige Catch-Klausel hat bereits alle Ausnahmen dieses oder eines übergeordneten Typs abgefangen ("{0}").
es: Una cláusula catch previa ya detecta todas las excepciones de este tipo o de tipo superior ('{0}')
fr: Une clause catch précédente intercepte déjà toutes les exceptions de this ou d'un super type ('{0}')
it: Una clausola catch precedente rileva già tutte le eccezioni del tipo this o super ('{0}')
ja: 前の catch 句はこれ、またはスーパー型 ('{0}') の例外のすべてを既にキャッチしました
ko: 이전의 catch 절에서 이 형식이나 상위 형식('{0}')의 예외를 모두 catch합니다.
pl: Poprzednia klauzula catch przechwytuje już wszystkie wyjątki tego typu lub jego nadtypu („{0}”)
pt_br: Cláusula catch anterior já captura todas as exceções desta ou de um super tipo ("{0}")
ru: Предыдущее предложение catch уже перехватывает все исключения этого типа или супертипа ("{0}").
tr: Önceki catch yan tümcesi bunun veya bir süper türün ('{0}') tüm istisnalarını zaten yakalıyor
zh_hans: 上一个 catch 子句已经捕获了此类型或超类型(“{0}”)的所有异常
zh_hant: 之前的 catch 子句已取得所有屬於此類型或超級類型 ('{0}') 的例外狀況

# WRN_FilterIsConstantTrue
source: Filter expression is a constant 'true', consider removing the filter
cs: Výraz filtru je konstantní hodnota true. Zvažte odebrání filtru.
de: Der Filterausdruck ist eine Konstante "true". Ziehen Sie in Betracht, den Filter zu entfernen.
es: La expresión de filtro es una constante "true", puede quitar el filtro
fr: L'expression de filtre est une constante 'true' ; songez à supprimer le filtre
it: L'espressione di filtro è una costante 'true'. Provare a rimuovere il filtro
ja: フィルター式は定数 'true' です。フィルターの削除を検討してください
ko: 필터 식이 상수 'true'입니다. 필터를 제거해 보세요.
pl: Wyrażenie filtru jest stałą wartością „true”, rozważ usunięcie tego filtru
pt_br: A expressão de filtro é uma constante ‘true’, considere remover o filtro
ru: Выражение фильтра является константой "true", попробуйте удалить фильтр.
tr: Filtre ifadesi bir sabit ‘true’ değeri, filtreyi kaldırmayı deneyin
zh_hans: 筛选器表达式是常量 “true”，请考虑删除筛选器
zh_hant: 篩選條件運算式是常數 'true'，請考慮移除此篩選條件

# WRN_FilterIsConstantTrue_Title
source: Filter expression is a constant 'true'
cs: Výraz filtru je konstantní hodnota true.
de: Filterausdruck ist eine Konstante "true"
es: La expresión de filtro es una constante "true"
fr: L'expression de filtre est une constante 'true'
it: L'espressione di filtro è una costante 'true'
ja: フィルター式は定数 'true' です
ko: 필터 식이 상수 'true'입니다.
pl: Wyrażenie filtru jest stałą wartością „true”
pt_br: A expressão de filtro é uma constante ‘true’
ru: Выражение фильтра является константой "true"
tr: Filtre ifadesi bir sabit ‘true’ değeri
zh_hans: 筛选器表达式是常量 “true”
zh_hant: 篩選條件運算式是常數 'true'

# ERR_ReturnExpected
source: '{0}': not all code paths return a value
cs: {0}: Ne všechny cesty kódu vrací hodnotu.
de: '"{0}": Nicht alle Codepfade geben einen Wert zurück.
es: '{0}': no todas las rutas de acceso de código devuelven un valor
fr: '{0}' : les chemins du code ne retournent pas tous une valeur
it: '{0}': non tutti i percorsi del codice restituiscono un valore
ja: '{0}': 値を返さないコード パスがあります
ko: '{0}': 코드 경로 중 일부만 값을 반환합니다.
pl: „{0}”: nie wszystkie ścieżki w kodzie zwracają wartość
pt_br: "{0}": nem todos os caminhos de código retornam um valor
ru: "{0}": не все пути к коду возвращают значение.
tr: '{0}': tüm kod yolları bir değer döndürmez
zh_hans: “{0}”: 并非所有的代码路径都返回值
zh_hant: '{0}': 不是所有程式碼路徑都有傳回值

# WRN_UnreachableCode
source: Unreachable code detected
cs: Byl zjištěn nedosažitelný kód.
de: Unerreichbarer Code wurde entdeckt.
es: Se detectó código inaccesible
fr: Code inaccessible détecté
it: È stato rilevato codice non raggiungibile
ja: 到達できないコードが検出されました
ko: 접근할 수 없는 코드가 있습니다.
pl: Wykryto nieosiągalny kod
pt_br: Código inacessível detectado
ru: Обнаружен недостижимый код
tr: Ulaşılamayan kod algılandı
zh_hans: 检测到无法访问的代码
zh_hant: 偵測到執行不到的程式碼

# WRN_UnreachableCode_Title
source: Unreachable code detected
cs: Byl zjištěn nedosažitelný kód.
de: Unerreichbarer Code wurde entdeckt.
es: Se detectó código inaccesible
fr: Code inaccessible détecté
it: È stato rilevato codice non raggiungibile
ja: 到達できないコードが検出されました
ko: 접근할 수 없는 코드가 있습니다.
pl: Wykryto nieosiągalny kod
pt_br: Código inacessível detectado
ru: Обнаружен недостижимый код
tr: Ulaşılamayan kod algılandı
zh_hans: 检测到无法访问的代码
zh_hant: 偵測到執行不到的程式碼

# ERR_SwitchFallThrough
source: Control cannot fall through from one case label ('{0}') to another
cs: Řízení se nedá předat z jednoho návěstí příkazu case ({0}) do jiného.
de: Das Steuerelement kann nicht von einer case-Bezeichnung ("{0}") zur nächsten fortfahren.
es: El control no puede pasar explícitamente de una etiqueta case ('{0}') a otra
fr: Le contrôle ne peut pas passer d'une étiquette case ('{0}') à une autre
it: Il controllo non può passare da un'etichetta case ('{0}') a un'altra
ja: コントロールはひとつの case ラベル ('{0}') から別のラベルへ流れ落ちることはできません
ko: 한 case 레이블('{0}')에서 다른 case 레이블로 제어를 이동할 수 없습니다.
pl: Nie można przejść z jednej etykiety instrukcji case („{0}”) do innej
pt_br: Controle não pode passar através de um rótulo case ("{0}") para outro
ru: Управление не может передаваться вниз от одной метки case ("{0}") к другой.
tr: Denetim bir olay etiketinden ('{0}') diğerine düşemez
zh_hans: 控制不能从一个 case 标签(“{0}”)贯穿到另一个 case 标签
zh_hant: 程式控制權無法從一個 case 標籤 ('{0}') 繼續到另一個

# WRN_UnreferencedLabel
source: This label has not been referenced
cs: Na tuto jmenovku se neodkazuje.
de: Auf diese Bezeichnung wurde nicht verwiesen.
es: No existe ninguna referencia a esta etiqueta
fr: Cette étiquette n'est pas référencée
it: Non è stato fatto riferimento a questa etichetta
ja: このラベルは参照されていません
ko: 이 레이블은 참조되지 않았습니다.
pl: Brak odwołania do tej etykiety
pt_br: Este rótulo não foi usado como referência
ru: Отсутствует ссылка на эту метку.
tr: Bu etikete başvurulmamış
zh_hans: 这个标签尚未被引用
zh_hant: 未參考此標籤

# WRN_UnreferencedLabel_Title
source: This label has not been referenced
cs: Na tuto jmenovku se neodkazuje.
de: Auf diese Bezeichnung wurde nicht verwiesen.
es: No existe ninguna referencia a esta etiqueta
fr: Cette étiquette n'est pas référencée
it: Non è stato fatto riferimento a questa etichetta
ja: このラベルは参照されていません
ko: 이 레이블은 참조되지 않았습니다.
pl: Brak odwołania do tej etykiety
pt_br: Este rótulo não foi usado como referência
ru: Отсутствует ссылка на эту метку.
tr: Bu etikete başvurulmamış
zh_hans: 这个标签尚未被引用
zh_hant: 未參考此標籤

# ERR_UseDefViolation
source: Use of unassigned local variable '{0}'
cs: Použila se nepřiřazená lokální proměnná {0}.
de: Verwendung der nicht zugewiesenen lokalen Variablen "{0}".
es: Uso de la variable local no asignada '{0}'
fr: Utilisation d'une variable locale non assignée '{0}'
it: Uso della variabile locale '{0}' non assegnata
ja: 未割り当てのローカル変数 '{0}' が使用されました
ko: 할당되지 않은 '{0}' 지역 변수를 사용했습니다.
pl: Użyto nieprzypisanej zmiennej lokalnej „{0}”
pt_br: Uso de variável local não atribuída "{0}"
ru: Использование локальной переменной "{0}", которой не присвоено значение.
tr: Atanmayan '{0}' yerel değişkeninin kullanımı
zh_hans: 使用了未赋值的局部变量“{0}”
zh_hant: 使用未指派的區域變數 '{0}'

# WRN_UnreferencedVar
source: The variable '{0}' is declared but never used
cs: Proměnná {0} je deklarovaná, ale nikdy se nepoužívá.
de: Die Variable "{0}" ist deklariert, wird aber nie verwendet.
es: La variable '{0}' se ha declarado pero nunca se usa
fr: La variable '{0}' est déclarée, mais jamais utilisée
it: La variabile '{0}' è dichiarata, ma non viene mai usata
ja: 変数 '{0}' は宣言されていますが、使用されていません
ko: {0}' 변수가 선언되었지만 사용되지 않았습니다.
pl: Zmienna „{0}” jest zadeklarowana, lecz nie jest nigdy używana
pt_br: A variável "{0}" está declarada, mas nunca é usada
ru: Переменная "{0}" объявлена, но ни разу не использована.
tr: {0}' değişkeni ifade edilir ancak hiçbir zaman kullanılmaz
zh_hans: 声明了变量“{0}”，但从未使用过
zh_hant: 已宣告變數 '{0}'，但從未使用過它

# WRN_UnreferencedVar_Title
source: Variable is declared but never used
cs: Proměnná je deklarovaná, ale nikdy se nepoužívá.
de: Variable ist deklariert, wird jedoch niemals verwendet
es: La variable está declarada pero nunca se usa
fr: La variable est déclarée mais jamais utilisée
it: La variabile è dichiarata, ma non viene mai usata
ja: 変数は宣言されていますが、使用されていません
ko: 변수가 선언되었지만 사용되지 않았습니다.
pl: Zmienna jest zadeklarowana, ale nie jest nigdy używana
pt_br: A variável foi declarada, mas nunca foi usada
ru: Переменная объявлена, но не используется
tr: Değişken bildirildi ancak hiç kullanılmadı
zh_hans: 声明了变量，但从未使用过
zh_hant: 已宣告變數，但從未使用過它

# WRN_UnreferencedField
source: The field '{0}' is never used
cs: Pole {0} se nikdy nepoužívá.
de: Das Feld "{0}" wird nie verwendet.
es: El campo '{0}' nunca se usa
fr: Le champ '{0}' n'est jamais utilisé
it: Il campo '{0}' non viene mai usato
ja: フィールド '{0}' は使用されていません
ko: {0}' 필드가 사용되지 않았습니다.
pl: Pole „{0}” nie jest nigdy używane
pt_br: O campo "{0}" nunca é usado
ru: Поле "{0}" никогда не используется.
tr: {0}' alanı hiçbir zaman kullanılmaz
zh_hans: 从不使用字段“{0}”
zh_hant: 欄位 '{0}' 從未使用過
