Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_ExpressionTreeContainsTupleLiteral
source: An expression tree may not contain a tuple literal.
cs: Strom výrazů nesmí obsahovat literál řazené kolekce členů.
de: Ein Ausdrucksbaum darf kein Tupelliteral enthalten.
es: Un árbol de expresión no puede contener un literal de tupla.
fr: Une arborescence de l'expression ne peut pas contenir un littéral de tuple.
it: Un albero delle espressioni non può contenere un valore letterale di tupla.
ja: 式のツリーは、タプル リテラルを含むことはできません。
ko: 식 트리에는 튜플 리터럴을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać literału krotki.
pt_br: Uma árvore de expressão não pode conter um literal de tupla.
ru: Дерево выражений не может содержать литерал кортежа.
tr: İfade ağacı demet sabit değeri içeremez.
zh_hans: 表达式树不能包含元组字面量。
zh_hant: 運算式樹狀架構不得包含元組常值。

# ERR_ExpressionTreeContainsTupleConversion
source: An expression tree may not contain a tuple conversion.
cs: Strom výrazů nesmí obsahovat převod řazené kolekce členů.
de: Ein Ausdrucksbaum darf keine Tupelkonvertierung enthalten.
es: Un árbol de expresión no puede contener una conversión de tupla.
fr: Une arborescence de l'expression ne peut pas contenir une conversion de tuple.
it: Un albero delle espressioni non può contenere una conversione di tupla.
ja: 式のツリーは、タプル変換を含むことはできません。
ko: 식 트리에는 튜플 변환을 사용할 수 없습니다.
pl: Drzewo wyrażenia nie może zawierać konwersji krotki.
pt_br: Uma árvore de expressão não pode conter uma conversão de tupla.
ru: Дерево выражений не может содержать преобразование кортежа.
tr: İfade ağacı, demet dönüşümü içeremez.
zh_hans: 表达式树不能包含元组转换。
zh_hant: 運算式樹狀架構不得包含元組轉換。

# ERR_SourceLinkRequiresPdb
source: /sourcelink switch is only supported when emitting PDB.
cs: Přepínač /sourcelink je podporovaný jen při vydávání PDB.
de: Der Schalter "/sourcelink" wird nur beim Ausgeben von PDB unterstützt.
es: El modificador /sourcelink solo se admite al emitir PDB.
fr: Le commutateur /sourcelink est uniquement pris en charge durant l'émission d'un fichier PDB.
it: L'opzione /sourcelink è supportata solo quando si crea il file PDB.
ja: /sourcelink スイッチは、PDB を生成する場合にのみサポートされます。
ko: /sourcelink 스위치는 PDB를 내보낼 때만 지원됩니다.
pl: Przełącznik /sourcelink jest obsługiwany tylko w przypadku emitowania pliku PDB.
pt_br: A opção /sourcelink tem suporte apenas ao emitir o PDB.
ru: Параметр /sourcelink поддерживается только при создании данных формата PDB.
tr: /sourcelink anahtarı yalnızca PDB gösterilirken desteklenir.
zh_hans: 只在发出 PDB 时才支持 /sourcelink 开关。
zh_hant: 只有在發出 PDB 時才支援 /sourcelink 參數。

# ERR_CannotEmbedWithoutPdb
source: /embed switch is only supported when emitting a PDB.
cs: Přepínač /embed je podporovaný jen při vydávání souboru PDB.
de: Die Option "/embed" wird nur beim Ausgeben einer PDB unterstützt.
es: El modificador /embed solo se admite al emitir un PDB.
fr: Le commutateur /embed est uniquement pris en charge durant l'émission d'un fichier PDB.
it: L'opzione /embed è supportata solo quando si crea un file PDB.
ja: /embed スイッチは、PDB を生成する場合にのみサポートされます。
ko: /embed 스위치는 PDB를 내보낼 때만 지원됩니다.
pl: Przełącznik /embed jest obsługiwany tylko w przypadku emitowania pliku PDB.
pt_br: A opção /inserir tem suporte apenas ao emitir um PDB.
ru: Параметр /embed поддерживается только при создании PDB-файла.
tr: /embed anahtarı yalnızca PDB yayınlanırken desteklenir.
zh_hans: 仅在发出 PDB 时才支持 /embed 开关。
zh_hant: 只有在發出 PDB 時才支援 /embed 參數。

# ERR_InvalidInstrumentationKind
source: Invalid instrumentation kind: {0}
cs: Neplatný typ instrumentace: {0}
de: Ungültiger Instrumentierungstyp: {0}
es: Clase de instrumentación no válida: {0}
fr: Genre d'instrumentation non valide : {0}
it: Il tipo di strumentazione non è valido: {0}
ja: 無効なインストルメンテーションの種類: {0}
ko: 잘못된 계측 종류: {0}
pl: Nieprawidłowy rodzaj instrumentacji: {0}
pt_br: Variante de instrumentação inválida: {0}
ru: Недопустимый тип инструментирования: {0}
tr: Geçersiz izleme türü: {0}
zh_hans: 无效的检测类型: {0}
zh_hant: 檢測設備種類無效: {0}

# ERR_VarInvocationLvalueReserved
source: The syntax 'var (...)' as an lvalue is reserved.
cs: Syntaxe 'var (...)' jako l-hodnota je vyhrazená.
de: Die Syntax "var (...)" als lvalue ist reserviert.
es: La sintaxis 'var (...)' como valor L está reservada.
fr: La syntaxe 'var (...)' en tant que lvalue est réservée.
it: La sintassi 'var (...)' come lvalue è riservata.
ja: 左辺値としての構文 'var (...)' は予約されています。
ko: lvalue인 구문 'var (...)'가 예약되었습니다.
pl: Składnia „var (...)“ jako wartość lvalue jest zastrzeżona.
pt_br: A sintaxe 'var (...)' como um lvalue está reservada.
ru: Синтаксис "var (...)" как lvalue зарезервирован.
tr: var (...)' söz dizimi, lvalue olarak ayrıldı.
zh_hans: 语法 "var (...)" 作为左值保留。
zh_hant: 已保留作為左值的語法 'var (...)'。

# ERR_SemiOrLBraceOrArrowExpected
source: { or ; or => expected
cs: Očekávaly se znaky { nebo ; nebo =>.
de: { oder ; oder => erwartet
es: Se esperaba { o ; o =>.
fr: { ou ; ou => attendu
it: È previsto { oppure ; o =>
ja: { or ; or => 必要
ko: { 또는 ; 또는 => 필요
pl: Oczekiwano symbolu { lub ; lub =>
pt_br: { ou ; ou => esperado
ru: Ожидается "{" или ";" или "=>"
tr: { or ; or => beklenen
zh_hans: { or ; or => 预期的
zh_hant: 需要 { 或 ; 或 =>

# ERR_ThrowMisplaced
source: A throw expression is not allowed in this context.
cs: Výraz throw není v tomto kontextu povolený.
de: Ein throw-Ausdruck ist in diesem Kontext unzulässig.
es: No se permite una expresión throw en este contexto.
fr: Une expression throw n'est pas autorisée dans ce contexte.
it: Un'espressione throw non è consentita in questo contesto.
ja: このコンテキストではスロー式は許可されていません。
ko: 이 컨텍스트에서는 throw 식을 사용할 수 없습니다.
pl: Wyrażenie throw jest niedozwolone w tym kontekście.
pt_br: Uma expressão throw não é permitida neste contexto.
ru: Выражение Throw в данном контексте запрещено.
tr: Throw ifadesine bu bağlamda izin verilmez.
zh_hans: 此上下文中不允许使用 throw 表达式。
zh_hant: 此內容不允許 throw 運算式。

# ERR_DeclarationExpressionNotPermitted
source: A declaration is not allowed in this context.
cs: Deklarace není v tomto kontextu povolená.
de: Eine Deklaration ist in diesem Kontext nicht zulässig.
es: No se permite una declaración en este contexto.
fr: Une déclaration n'est pas autorisée dans ce contexte.
it: Una dichiarazione non è consentita in questo contesto.
ja: 宣言はこのコンテキストでは許可されていません。
ko: 이 컨텍스트에서 선언을 사용할 수 없습니다.
pl: Deklaracja jest niedozwolona w tym kontekście.
pt_br: Uma declaração não é permitida neste contexto.
ru: Объявление недопустимо в этом контексте.
tr: Bu bağlamda bildirime izin verilmez.
zh_hans: 此上下文中不允许使用声明。
zh_hant: 此內容中不允許宣告。

# ERR_MustDeclareForeachIteration
source: A foreach loop must declare its iteration variables.
cs: Smyčka foreach musí deklarovat své proměnné iterace.
de: Eine Foreach-Schleife muss die Iterationsvariablen deklarieren.
es: Un bucle foreach debe declarar sus variables de iteración.
fr: Une boucle foreach doit déclarer ses variables d'itération.
it: Un ciclo foreach deve dichiarare le relative variabili di iterazione.
ja: foreach ループでは繰り返し変数を宣言する必要があります。
ko: foreach 루프는 반복 변수를 선언해야 합니다.
pl: Pętla foreach musi deklarować swoje zmienne iteracji.
pt_br: Um Loop ForEach deve declarar suas variáveis de iteração.
ru: Цикл foreach должен объявлять собственные переменные итерации.
tr: Foreach döngüsünün, yineleme değişkenlerini bildirmesi gerekir.
zh_hans: foreach 循环必须声明其迭代变量。
zh_hant: Foreach 迴圈必須宣告其反覆運算變數。

# ERR_TupleElementNamesInDeconstruction
source: Tuple element names are not permitted on the left of a deconstruction.
cs: Na levé straně dekonstrukce nejsou povolené názvy prvků řazené kolekce členů.
de: Tupelelementnamen sind auf der linken Seite einer Dekonstruktion nicht zulässig.
es: No se permiten nombres de elementos de tupla en el lado izquierdo de una deconstrucción.
fr: Les noms d'élément tuple ne sont pas autorisés à gauche d'une déconstruction.
it: Nella parte sinistra di una decostruzione non sono consentiti nomi di elemento di tupla.
ja: 分解の左側でタプル要素名は許可されていません。
ko: 분해의 왼쪽에 튜플 요소 이름을 사용할 수 없습니다.
pl: Nazwy elementów krotek nie są dozwolone po lewej stronie dekonstrukcji.
pt_br: Os nomes de elemento de tupla não são permitidos à esquerda de uma desconstrução.
ru: Имена элементов кортежа не разрешены в левой части деконструирования.
tr: Ayrıştırma deyiminin sol tarafında demet öğesi adlarına izin verilmez.
zh_hans: 析构左侧不允许使用元组元素名称。
zh_hant: 解構左側不允許元組元素名稱。

# ERR_PossibleBadNegCast
source: To cast a negative value, you must enclose the value in parentheses.
cs: Pokud se má přetypovat záporná hodnota, musí být uzavřená v závorkách.
de: Negative Werte müssen in runde Klammern gesetzt werden, um umgewandelt zu werden.
es: Para convertir un valor negativo, el valor debe ir entre paréntesis
fr: Pour effectuer un cast d'une valeur négative, vous devez la mettre entre parenthèses.
it: Per eseguire il cast di un valore negativo, è necessario racchiuderlo tra parentesi.
ja: 負の値をキャストするには、値をかっこで囲んでください。
ko: 음의 값을 캐스팅하려면 값을 괄호로 묶어야 합니다.
pl: Aby rzutować wartość ujemną, musisz ją ująć w nawias.
pt_br: Para converter um valor negativo, é necessário delimitá-lo com parêntesis.
ru: Для приведения отрицательного значения следует заключить значение в круглые скобки.
tr: Eksi değerde atama yapmak için değeri parantez içine almalısınız.
zh_hans: 若要强制转换负值，必须将该值放在括号内。
zh_hant: 若要轉換負值，必須以括號括住該值。

# ERR_ExpressionTreeContainsThrowExpression
source: An expression tree may not contain a throw-expression.
cs: Strom výrazů nesmí obsahovat výraz throw.
de: Eine Ausdrucksbaumstruktur darf keinen Throw-Ausdruck enthalten.
es: Un árbol de expresión no puede contener una expresión throw.
fr: Une arborescence de l'expression ne peut pas contenir d'expression throw.
it: Un albero delle espressioni non può contenere un'espressione throw.
ja: 式ツリーにスロー式を含めることはできません。
ko: 식 트리에는 throw 식이 포함될 수 없습니다.
pl: Drzewo wyrażeń nie może zawierać wyrażenia throw.
pt_br: Uma árvore de expressão não pode conter uma expressão throw.
ru: Дерево выражений не может содержать выражение throw.
tr: İfade ağacı, throw ifadesi içeremez.
zh_hans: 表达式树不能包含 throw 表达式
zh_hant: 運算式樹狀架構不可包含 throw 運算式。

# ERR_BadAssemblyName
source: Invalid assembly name: {0}
cs: Neplatný název sestavení: {0}
de: Ungültiger Assemblyname: "{0}"
es: Nombre de ensamblado no válido: {0}
fr: Nom d'assembly non valide : {0}
it: Il nome di assembly {0} non è valido
ja: 無効なアセンブリ名: {0}
ko: 잘못된 어셈블리 이름: {0}
pl: Nieprawidłowa nazwa zestawu: {0}
pt_br: Nome de assembly inválido: {0}
ru: Недопустимое имя сборки: {0}
tr: Bütünleştirilmiş kod adı geçersiz: {0}
zh_hans: 无效的程序集名称: {0}
zh_hant: 組件名稱 {0} 無效

# ERR_BadAsyncMethodBuilderTaskProperty
source: For type '{0}' to be used as an AsyncMethodBuilder for type '{1}', its Task property should return type '{1}' instead of type '{2}'.
cs: Aby se typ {0} mohl použít jako AsyncMethodBuilder pro typ {1}, měla by jeho vlastnost Task vracet typ {1} místo typu {2}.
de: Damit der Typ "{0}" als "AsyncMethodBuilder" für den Typ "{1}" verwendet wird, muss seine Aufgabeneigenschaft den Typ "{1}" anstelle des Typs "{2}" zurückgeben.
es: Para que el tipo "{0}" se utilice como AsyncMethodBuilder para el tipo "{1}", su propiedad Task debe devolver el tipo "{1}" en lugar del tipo "{2}".
fr: Pour que le type '{0}' soit utilisé comme AsyncMethodBuilder du type '{1}', sa propriété Task doit retourner le type '{1}' à la place du type '{2}'.
it: La proprietà Task del tipo '{0}' da usare come elemento AsyncMethodBuilder per il tipo '{1}' deve restituire il tipo '{1}' invece di '{2}'.
ja: 型 '{0}' を型 '{1}' の AsyncMethodBuilder として使うには、その Task プロパティが型 '{2}' ではなく型 '{1}' を返す必要があります。
ko: {1}' 형식에 대한 AsyncMethodBuilder로 사용할 '{0}' 형식의 작업 속성은 '{2}' 형식 대신 '{1}' 형식을 반환해야 합니다.
pl: Aby typ „{0}” mógł zostać użyty jako element AsyncMethodBuilder dla typu „{1}”, jego właściwość zadania powinna zwracać typ „{1}” zamiast typu „{2}”.
pt_br: Para o tipo '{0}' a ser usado como um AsyncMethodBuilder para o tipo '{1}', sua propriedade Task deve retornar o tipo '{1}' em vez do tipo '{2}'.
ru: Чтобы тип "{0}" можно было использовать как AsyncMethodBuilder для типа "{1}", его свойство Task должно возвращать тип "{1}" вместо "{2}".
tr: {0}' türünün '{1}' türü için AsyncMethodBuilder olarak kullanılması için, Task özelliğinin '{2}' türü yerine '{1}' türü döndürmesi gerekir.
zh_hans: 对于用作类型“{1}”的 AsyncMethodBuilder 的类型“{0}”，它的任务属性应返回类型“{1}”，而不是类型“{2}”。
zh_hant: 若要讓 '{0}' 類型作為 '{1}' 類型的 AsyncMethodBuilder，其 Task 屬性應傳回 '{1}' 類型，而非 '{2}' 類型。

# ERR_TypeForwardedToMultipleAssemblies
source: Module '{0}' in assembly '{1}' is forwarding the type '{2}' to multiple assemblies: '{3}' and '{4}'.
cs: Modul {0} v sestavení {1} předává typ {2} několika sestavením: {3} a {4}.
de: Das Modul "{0}" in der Assembly "{1}" leitet den Typ "{2}" an mehrere Assemblys weiter: "{3}" und "{4}".
es: El módulo "{0}" del ensamblado "{1}" va a reenviar el tipo "{2}" a varios ensamblados: "{3}" y "{4}".
fr: Le module '{0}' dans l'assembly '{1}' transfère le type '{2}' à plusieurs assemblys : '{3}' et '{4}'.
it: Il modulo '{0}' nell'assembly '{1}' inoltra il tipo '{2}' a più assembly '{3}' e '{4}'.
ja: アセンブリ '{1}' のモジュール '{0}' によって、型 '{2}' が複数のアセンブリ '{3}' および '{4}' に転送されています。
ko: {1}' 어셈블리의 '{0}' 모듈이 여러 어셈블리 '{3}' 및 '{4}'에 '{2}' 형식을 전달하고 있습니다.
pl: Moduł „{0}” w zestawie „{1}” przekazuje typ „{2}” do wielu zestawów: „{3}” i „{4}”.
pt_br: O módulo '{0}' no assembly '{1}' está encaminhando o tipo '{2}' para vários assemblies: '{3}' e '{4}'.
ru: Модуль "{0}" в сборке "{1}" перенаправляет тип "{2}" в несколько сборок: "{3}" и "{4}".
tr: {1}' bütünleştirilmiş kodundaki '{0}' modülü, '{2}' türünü birden çok bütünleştirilmiş koda iletiyor: '{3}' ve '{4}'.
zh_hans: 程序集“{1}”中的模块“{0}”将类型“{2}”转发到多个程序集: “{3}”和“{4}”。
zh_hant: 組件 '{1}' 中的模組 '{0}' 正在將類型 '{2}' 轉送給多個組件: '{3}' 及 '{4}'。

# ERR_PatternDynamicType
source: It is not legal to use the type 'dynamic' in a pattern.
cs: Není povoleno použít typ dynamic ve vzorku.
de: Der Typ "dynamic" darf nicht in einem Muster verwendet werden.
es: No se puede utilizar el tipo "dynamic" en un patrón.
fr: Vous ne devez pas utiliser le type 'dynamic' dans un modèle.
it: Non è consentito usare il tipo 'dynamic' in un criterio.
ja: パターン内で型 'dynamic' を使用することはできません。
ko: 패턴에 'dynamic' 형식을 사용할 수 없습니다.
pl: Używanie typu „dynamic” we wzorcu nie jest dozwolone.
pt_br: É ilegal usar o tipo 'dinâmico' em um padrão.
ru: Запрещено использовать тип dynamic в шаблоне.
tr: Bir desende 'dynamic' türünün kullanılmasına izin verilmiyor.
zh_hans: 在模式中使用类型“动态”是不合法的。
zh_hant: 在模式中使用類型 'dynamic' 不合法。

# ERR_BadDocumentationMode
source: Provided documentation mode is unsupported or invalid: '{0}'.
cs: Zadaný režim dokumentace je nepodporovaný nebo neplatný: {0}.
de: Der angegebene Dokumentationsmodus wird nicht unterstützt oder ist ungültig: "{0}".
es: El modo de documentación proporcionado no se admite o no es válido: "{0}".
fr: Le mode de documentation fourni n'est pas pris en charge ou est non valide : '{0}'.
it: La modalità di documentazione specificata non è supportata o non è valida: '{0}'.
ja: 指定されたドキュメント モードがサポートされていないか無効です: '{0}'。
ko: 제공한 문서 모드가 지원되지 않거나 잘못되었습니다. '{0}'.
pl: Podany tryb dokumentacji jest nieobsługiwany lub nieprawidłowy: „{0}”.
pt_br: O modo de documentação fornecido não tem suporte ou é inválido: '{0}'.
ru: Указанный режим документации не поддерживается или недопустим: "{0}".
tr: Sağlanan belge modu desteklenmiyor veya geçersiz: '{0}'.
zh_hans: 提供的文档模式不受支持或无效:“{0}”。
zh_hant: 提供的文件模式不受支援或無效: '{0}'。

# ERR_BadSourceCodeKind
source: Provided source code kind is unsupported or invalid: '{0}'
cs: Zadaný druh zdrojového kódu je nepodporovaný nebo neplatný: {0}.
de: Der angegebene Quellcodetyp wird nicht unterstützt oder ist ungültig: "{0}".
es: El tipo de código fuente proporcionado no se admite o no es válido: "{0}"
fr: Le genre de code source fourni n'est pas pris en charge ou est non valide : '{0}'
it: Il tipo del codice sorgente specificato non è supportato o non è valido: '{0}'
ja: 指定されたソース コードの種類がサポートされていないか無効です: '{0}'
ko: 제공된 소스 코드 종류가 지원되지 않거나 잘못되었습니다. '{0}'
pl: Podany rodzaj kodu źródłowego jest nieobsługiwany lub nieprawidłowy: „{0}”
pt_br: O tipo de código-fonte fornecido não tem suporte ou é inválido: '{0}'
ru: Указанный тип исходного кода не поддерживается или недопустим: "{0}"
tr: Sağlanan kaynak kodu türü desteklenmiyor veya geçersiz: '{0}'
zh_hans: 提供的源代码类型不受支持或无效:“{0}”
zh_hant: 提供的原始程式碼類型不受支援或無效: '{0}'

# ERR_BadLanguageVersion
source: Provided language version is unsupported or invalid: '{0}'.
cs: Zadaná verze jazyka je nepodporovaná nebo neplatná: {0}.
de: Die angegebene Sprachversion wird nicht unterstützt oder ist ungültig: "{0}".
es: La versión de lenguaje proporcionada no se admite o no es válida: "{0}".
fr: La version de langage fournie n'est pas prise en charge ou est non valide : '{0}'.
it: La versione del linguaggio specificata non è supportata o non è valida: '{0}'.
ja: 指定された言語バージョンがサポートされていないか無効です: '{0}'。
ko: 제공한 언어 버전이 지원되지 않거나 잘못되었습니다. '{0}'.
pl: Podana wersja języka jest nieobsługiwana lub nieprawidłowa: „{0}”.
pt_br: A versão de linguagem fornecida não tem suporte ou é inválida: '{0}'.
ru: Указанная версия языка не поддерживается или недопустима: "{0}".
tr: Sağlanan dil sürümü desteklenmiyor veya geçersiz: '{0}'.
zh_hans: 提供的语言版本不受支持或无效:“{0}”。
zh_hant: 提供的語言版本不受支援或無效: '{0}'。

# ERR_InvalidPreprocessingSymbol
source: Invalid name for a preprocessing symbol; '{0}' is not a valid identifier
cs: Neplatný název pro symbol předzpracování; {0} není platný identifikátor.
de: Ungültiger Name für ein Vorverarbeitungssymbol; "{0}" ist kein gültiger Bezeichner.
es: Nombre no válido para un símbolo de preprocesamiento; "{0}" no es un identificador válido
fr: Nom non valide pour un symbole de prétraitement. '{0}' est un identificateur non valide
it: Nome non valido per un simbolo di pre-elaborazione. '{0}' non è un identificatore valido
ja: 前処理シンボルの名前が無効です。'{0}' は有効な識別子ではありません
ko: 전처리 기호의 이름이 잘못되었습니다. '{0}'은(는) 유효한 식별자가 아닙니다.
pl: Nieprawidłowa nazwa symbolu przetwarzania wstępnego; „{0}” nie jest prawidłowym identyfikatorem
pt_br: Nome inválido para um símbolo de pré-processamento. '{0}' não é um identificador válido
ru: Недопустимое имя символа предварительной обработки. "{0}" не является допустимым идентификатором.
tr: Bir ön işleme sembolünün adı geçersiz; '{0}' geçerli bir tanımlayıcı değil
zh_hans: 预处理符号的名称无效；“{0}”不是有效的标识符
zh_hant: 前置處理符號的名稱無效; '{0}' 不是有效的識別碼

# ERR_FeatureNotAvailableInVersion7_1
source: Feature '{0}' is not available in C# 7.1. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 7.1. Použijte prosím jazyk verze {1} nebo vyšší.
de: Das Feature "{0}" ist in C# 7.1 nicht verfügbar. Verwenden Sie die Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 7.1. Use la versión de lenguaje {1} u otra superior.
fr: La fonctionnalité '{0}' n'est pas disponible dans C# 7.1. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 7.1. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 7.1 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 7.1에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 7.1. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 7.1. Use a versão de linguagem {1} ou superior.
ru: Возможность "{0}" недоступна в C# 7.1. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 7.1'de kullanılamıyor. Lütfen {1} veya daha yüksek dil sürümünü kullanın.
zh_hans: 功能“{0}”在 C# 7.1 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 7.1 中無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_FeatureNotAvailableInVersion7_2
source: Feature '{0}' is not available in C# 7.2. Please use language version {1} or greater.
cs: Funkce {0} není dostupná v jazyce C# 7.2. Použijte prosím jazyk verze {1} nebo vyšší.
de: Das Feature "{0}" ist in C# 7.2 nicht verfügbar. Verwenden Sie Sprachversion {1} oder höher.
es: La característica "{0}" no está disponible en C# 7.2. Use la versión {1} del lenguaje o una posterior.
fr: La fonctionnalité '{0}' n'est pas disponible en C# 7.2. Utilisez la version de langage {1} ou une version ultérieure.
it: La funzionalità '{0}' non è disponibile C# 7.2. Usare la versione {1} o versioni successive del linguaggio.
ja: 機能 '{0}' は C# 7.2 では使用できません。{1} 以上の言語バージョンをお使いください。
ko: {0}' 기능은 C# 7.2에서 사용할 수 없습니다. {1} 이상의 언어 버전을 사용하세요.
pl: Funkcja „{0}” nie jest dostępna w języku C# 7.2. Użyj języka w wersji {1} lub nowszej.
pt_br: O recurso '{0}' não está disponível em C# 7.2. Use a versão de linguagem {1} ou superior.
ru: Компонент "{0}" недоступен в C# 7.2. Используйте версию языка {1} или выше.
tr: {0}' özelliği C# 7.2'de kullanılamaz. Lütfen {1} veya daha yüksek bir dil sürümü kullanın.
zh_hans: 功能“{0}”在 C# 7.2 中不可用。请使用 {1} 或更高的语言版本。
zh_hant: C# 7.2 無法使用 '{0}' 功能。請使用語言版本 {1} 或更高的版本。

# ERR_LanguageVersionCannotHaveLeadingZeroes
source: Specified language version '{0}' cannot have leading zeroes
cs: Zadaná verze jazyka {0} nemůže obsahovat úvodní nuly.
de: Die angegebene Sprachversion "{0}" darf keine führenden Nullen enthalten.
es: La versión de lenguaje especificada "{0}" no puede tener ceros al principio
fr: La version de langage spécifiée '{0}' ne peut pas avoir de zéros non significatifs
it: La versione specificata '{0}' del linguaggio non può contenere zeri iniziali
ja: 指定された言語バージョン '{0}' の先頭にゼロを含めることはできません
ko: 지정된 언어 버전 '{0}'에는 앞에 오는 0을 사용할 수 없습니다.
pl: Określona wersja „{0}” języka nie może mieć zer wiodących
pt_br: A versão de linguagem '{0}' especificada não pode ter zeros à esquerda
ru: Указанная версия языка "{0}" не может содержать начальные нули.
tr: Belirtilen dil sürümünün ('{0}') başında sıfır olamaz
zh_hans: 指定的语言版本“{0}”不能含前导零
zh_hant: 指定的語言版本 '{0}' 不可以零作為開頭

# ERR_VoidAssignment
source: A value of type 'void' may not be assigned.
cs: Hodnota typu void se nesmí přiřazovat.
de: Ein Wert vom Typ "void" darf nicht zugewiesen werden.
es: No se puede asignar un valor de tipo "void".
fr: Impossible d'assigner une valeur de type 'void'.
it: Non è possibile assegnare un valore di tipo 'void'.
ja: 型 'void' の値を割り当てることはできません。
ko: void' 형식의 값을 할당할 수 없습니다.
pl: Nie można przypisać wyrażenia typu „void”.
pt_br: Um valor do tipo 'void' não pode ser atribuído.
ru: Значение типа void нельзя назначить.
tr: void' türünde bir değer atanamaz.
zh_hans: 可能无法分配类型 "void" 的值。
zh_hant: 可能未指派 'void' 類型的值。

# WRN_Experimental
source: '{0}' is for evaluation purposes only and is subject to change or removal in future updates. Suppress this diagnostic to proceed.
fr: « {0} » est utilisé à des fins d’évaluation uniquement et est susceptible d’être modifié ou supprimé dans les futures mises à jour. Supprimez ce diagnostic pour continuer.
it: '{0}' viene usato solo a scopo di valutazione e potrebbe essere modificato o rimosso in aggiornamenti futuri. Elimina questa diagnostica per continuare.
ja: '{0}' は、評価の目的でのみ提供されています。将来の更新で変更または削除されることがあります。続行するには、この診断を非表示にします。
pl: Element „{0}” jest przeznaczony wyłącznie do celów ewaluacyjnych i może zostać zmieniony albo usunięty w przyszłych aktualizacjach. Wstrzymaj tę diagnostykę, aby kontynuować.
pt_br: '{0}'é apenas para fins de avaliação e está sujeito a alterações ou remoção em atualizações futuras. Suprima este diagnóstico para continuar.
ru: "{0}" предназначен только для оценки и может быть изменен или удален в будущих обновлениях. Чтобы продолжить, скройте эту диагностику.
zh_hans: “{0}”仅用于评估，在将来的更新中可能会被更改或删除。取消此诊断以继续。
zh_hant: '{0}' 僅供評估之用，可能會在未來更新中變更或移除。抑制此診斷以繼續。
