Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UnobservedAwaitableExpression_Title
source: Because this call is not awaited, execution of the current method continues before the call is completed
cs: Protože se toto volání neočekává, vykonávání aktuální metody pokračuje před dokončením volání.
de: Da auf diesen Aufruf nicht gewartet wird, wird die Ausführung der aktuellen Methode vor Abschluss des Aufrufs fortgesetzt.
es: Dado que no se esperaba esta llamada, la ejecución del método actual continuará antes de que se complete la llamada
fr: Dans la mesure où cet appel n'est pas attendu, l'exécution de la méthode actuelle continue avant la fin de l'appel
it: Non è possibile attendere la chiamata, pertanto l'esecuzione del metodo corrente continuerà prima del completamento della chiamata
ja: この呼び出しは待機されなかったため、現在のメソッドの実行は呼び出しの完了を待たずに続行されます
ko: 이 호출을 대기하지 않으므로 호출이 완료되기 전에 현재 메서드가 계속 실행됩니다.
pl: To wywołanie nie jest oczekiwane, dlatego wykonywanie bieżącej metody będzie kontynuowane do czasu ukończenia wywołania
pt_br: Como esta chamada não é esperada, a execução do método atual continua antes de a chamada ser concluída
ru: Так как этот вызов не ожидается, выполнение существующего метода продолжается до тех пор, пока вызов не будет завершен
tr: Bu çağrı beklenmediği için, çağrı tamamlanmadan önce geçerli yöntemin yürütülmesine devam ediliyor
zh_hans: 由于此调用不会等待，因此在调用完成前将继续执行当前方法
zh_hant: 因為未等待此呼叫，所以在完成呼叫之前會繼續執行目前方法

# WRN_UnobservedAwaitableExpression_Description
source: The current method calls an async method that returns a Task or a Task<TResult> and doesn't apply the await operator to the result. The call to the async method starts an asynchronous task. However, because no await operator is applied, the program continues without waiting for the task to complete. In most cases, that behavior isn't what you expect. Usually other aspects of the calling method depend on the results of the call or, minimally, the called method is expected to complete before you return from the method that contains the call. An equally important issue is what happens to exceptions that are raised in the called async method. An exception that's raised in a method that returns a Task or Task<TResult> is stored in the returned task. If you don't await the task or explicitly check for exceptions, the exception is lost. If you await the task, its exception is rethrown. As a best practice, you should always await the call. You should consider suppressing the warning only if you're sure that you don't want to wait for the asynchronous call to complete and that the called method won't raise any exceptions. In that case, you can suppress the warning by assigning the task result of the call to a variable.
cs: Aktuální metoda volá asynchronní metodu, která vrací úlohu nebo úlohu<TResult> a ve výsledku nepoužije operátor await. Volání asynchronní metody spustí asynchronní úlohu. Vzhledem k tomu, že se ale nepoužil žádný operátor await, bude program pokračovat bez čekání na dokončení úlohy. Ve většině případů se nejedná o chování, které byste očekávali. Ostatní aspekty volání metody obvykle závisí na výsledcích volání nebo se aspoň očekává, že se volaná metoda dokončí před vaším návratem z metody obsahující volání. Stejně důležité je i to, co se stane s výjimkami, ke kterým dojde ve volané asynchronní metodě. Výjimka, ke které dojde v metodě vracející úlohu nebo úlohu<TResult>, se uloží do vrácené úlohy. Pokud úlohu neočekáváte nebo explicitně výjimky nekontrolujete, dojde ke ztrátě výjimky. Pokud úlohu očekáváte, dojde k výjimce znovu. Nejvhodnějším postupem je volání vždycky očekávat. Potlačení upozornění zvažte jenom v případě, když určitě nechcete čekat na dokončení asynchronního volání a jste si jistí, že volaná metoda nevyvolá žádné výjimky. V takovém případě můžete upozornění potlačit tak, že výsledek úlohy volání přidružíte proměnné.
de: Die aktuelle Methode ruft eine asynchrone Methode auf, die ein Task- oder ein Task<TResult>-Objekt zurückgibt und den await-Operator nicht auf das Ergebnis anwendet. Der Aufruf der asynchronen Methode beginnt als asynchroner Task. Da kein await-Operator angewendet wird, wird das Programm jedoch fortgesetzt, ohne dass auf den Abschluss des Tasks gewartet wird. In den meisten Fällen entspricht dieses Verhalten nicht Ihren Erwartungen. Normalerweise hängen andere Aspekte der aufrufenden Methode von den Ergebnissen des Aufrufs ab, oder es wird mindestens erwartet, dass die aufgerufene Methode abgeschlossen wird, bevor die Rückgabe von der Methode erfolgt, die den Aufruf enthält. Ebenso wichtig ist, was mit Ausnahmen geschieht, die in der aufgerufenen asynchronen Methode ausgelöst werden. Eine Ausnahme, die in einer Methode ausgelöst wird, die ein Task- oder Task<TResult>-Objekt zurückgibt, wird im zurückgegebenen Task gespeichert. Wenn Sie nicht auf den Abschluss des Tasks warten bzw. keine explizite Überprüfung auf Ausnahmen ausführen, geht die Ausnahme verloren. Wenn Sie auf den Abschluss des Tasks warten, wird die Ausnahme erneut ausgelöst. Als bewährte Methode sollten Sie immer auf den Abschluss des Aufrufs warten. Sie sollten das Unterdrücken der Warnung nur in Betracht ziehen, wenn Sie sicher sind, dass Sie nicht auf den Abschluss des asynchronen Aufrufs warten möchten und die aufgerufene Methode keine Ausnahmen auslöst. In diesem Fall können Sie die Warnung unterdrücken, indem Sie das Taskergebnis des Aufrufs einer Variablen zuweisen.
es: El método actual llama a un método asincrónico que devuelve una tarea o un Task<TResult>, y no aplica el operador Await al resultado. La llamada al método asincrónico inicia una tarea asincrónica. Sin embargo, debido a que no se aplica ningún operador Await, el programa continúa sin esperar a que finalice la tarea. En la mayoría de los casos, este comportamiento no es el esperado. Generalmente, otros aspectos del método de llamada dependen de los resultados de la llamada. O bien, se espera como mínimo que el método al que se llama se complete antes de volver al método que contiene la llamada. Un problema de igual importancia es el que se genera con las excepciones que se producen en el método asincrónico al que se llama. Las excepciones que se producen en un método que devuelve una tarea o un Task<TResult> se almacenan en la tarea devuelta. Si no espera por la tarea o no realiza una comprobación explícita de excepciones, la excepción se pierde. Si espera por la tarea, su excepción se vuelve a producir. Como procedimiento recomendado, siempre debe esperar por la llamada. Considere la posibilidad de suprimir la advertencia solo si tiene la seguridad de que no desea esperar a que la llamada asincrónica se complete y que el método al que se llama no producirá excepciones. En ese caso, puede suprimir la advertencia asignando el resultado de la tarea de la llamada a una variable.
fr: La méthode actuelle appelle une méthode async qui retourne Task ou Task<TResult>. Par ailleurs, elle n'applique pas l'opérateur await au résultat. L'appel de la méthode async démarre une tâche asynchrone. Cependant, comme aucun opérateur await n'est appliqué, le programme continue sans attendre la fin de la tâche. Généralement, ce comportement n'est pas celui que vous attendez. La plupart du temps, les autres aspects de la méthode d'appel dépendent du résultat de l'appel ou, au minimum, la méthode appelée doit s'achever avant le retour de la méthode contenant l'appel. Un problème de même importance est ce qui arrive aux exceptions levées dans la méthode async appelée. Une exception levée dans une méthode qui retourne Task ou Task<TResult> est stockée dans la tâche retournée. Si vous n'attendez pas la tâche ou la vérification explicite d'exceptions, l'exception est perdue. Si vous attendez la tâche, son exception est à nouveau levée. Nous vous recommandons de toujours attendre l'appel. Supprimez l'avertissement seulement si vous êtes sûr de ne pas vouloir attendre la fin de l'appel asynchrone, et que la méthode appelée ne lèvera aucune exception. Dans ce cas, vous pouvez supprimer l'avertissement en affectant le résultat de la tâche de l'appel à une variable.
it: Il metodo corrente chiama un metodo asincrono che restituisce un elemento Task o Task<TResult> e non applica l'operatore await al risultato. La chiamata al metodo asincrono avvia un'attività asincrona. Dal momento, però, che non viene applicato alcun operatore await, l'esecuzione del programma continua senza attendere il completamento dell'attività. Nella maggior parte dei casi questo non è il comportamento previsto. In genere, altri aspetti del metodo chiamante dipendono dai risultati della chiamata o è almeno previsto che il metodo chiamato venga completato prima del termine del metodo che contiene la chiamata. Un aspetto ugualmente importante è costituito dalla gestione delle eccezioni generate nel metodo asincrono chiamato. Un'eccezione generata in un metodo che restituisce un elemento Task o Task<TResult> viene archiviata nell'attività restituita. Se non si attende l'attività o si verifica esplicitamente la presenza di eccezioni, l'eccezione viene persa. Se si attende l'attività, l'eccezione viene nuovamente generata. Come procedura consigliata, è consigliabile attendere sempre la chiamata. È opportuno eliminare l'avviso solo se si è certi che non si vuole attendere il completamento della chiamata asincrona e che il metodo chiamato non genera alcuna eccezione. In tal caso, è possibile eliminare l'avviso assegnando il risultato dell'attività della chiamata a una variabile.
ja: 現在のメソッドでは、Task または Task<TResult> を返す非同期メソッドを呼び出すため、await 演算子は結果に適用されません。非同期メソッド呼び出しにより、非同期タスクが開始されます。しかし、await 演算子が適用されないため、プログラムはタスクが完了するのを待たずに継続されます。ほとんどの場合、この動作は期待されているものではありません。通常、呼び出しているメソッドの他のアスペクトは呼び出し結果に依存します。または最低限でも、呼び出されたメソッドは、呼び出しを含んでいるメソッドから復帰する前に完了していることが必要とされます。 同様に重要な問題として、呼び出された非同期メソッドでどんな例外が発生するかということがあります。Task または Task<TResult> を返すメソッドで発生した例外は、返されたタスクに保管されます。タスクを待機しないか例外を明示的にチェックしない場合、例外は失われます。タスクを待機する場合、例外は再スローされます。 ベスト プラクティスとして、常に呼び出しを待機するようにしてください。 警告を表示しないことを考慮するのは、非同期の呼び出しの完了の待機を行う必要がなく、呼び出されたメソッドが例外を起こさないことが確実な場合だけにしてください。その場合、呼び出しのタスク結果を変数に割り当てて、警告を表示しないようにできます。
ko: 현재 메서드는 Task 또는 Task<TResult>를 반환하는 비동기 메서드를 호출하므로 await 연산자를 결과에 적용하지 않습니다. 비동기 메서드를 호출하면 비동기 작업이 시작됩니다. 그러나 await 연산자가 적용되지 않으므로 작업이 완료될 때까지 기다리지 않고 프로그램이 계속 진행됩니다. 대부분의 경우 이 동작은 예상과 다릅니다. 일반적으로 호출 메서드의 다양한 측면에 따라 호출 결과가 달라지며, 최소한 호출을 포함하는 메서드에서 반환되기 이전에 호출된 메서드가 완료되어야 합니다. 호출된 비동기 메서드에서 발생하는 예외에 대해 발생하는 문제도 중요합니다. Task 또는 Task<TResult>를 반환하는 메서드에서 발생하는 예외는 반환된 작업에 저장됩니다. 작업을 대기하지 않거나 예외를 명시적으로 확인하지 않을 경우 예외가 손실됩니다. 작업을 대기하면 예외가 다시 발생합니다. 따라서 항상 호출을 대기하는 것이 좋습니다. 비동기 호출이 완료되는 동안 대기하지 않고 호출된 메서드가 예외를 발생하지 않는 경우에만 이 경고를 무시해야 합니다. 이 경우 호출의 작업 결과를 변수에 할당하여 경고를 무시할 수 있습니다.
pl: Bieżąca metoda wywołuje metodę asynchroniczną, która zwraca zadanie lub wynik Task<TResult> i która nie stosuje operatora await do wyniku. Wywołanie metody asynchronicznej rozpoczyna zadanie asynchroniczne. Jednak ze względu na niezastosowanie operatora await działanie programu będzie kontynuowane bez oczekiwania na zakończenie zadania. W większości przypadków jest to nieoczekiwane zachowanie. Przeważnie inne aspekty metody wywołującej zależą do wyników wywołania lub przynajmniej działanie wywołanej metody powinno zakończyć się przed powrotem z metody zawierającej wywołanie. Równie ważnym problemem jest to, co dzieje się z wyjątkami zgłoszonymi przez wywołaną metodę asynchroniczną. Wyjątek zgłoszony w ramach metody zwracającej zadanie lub wynik Task<TResult> jest przechowywany w zwróconym zadaniu. Jeśli nie wykonasz operacji await dla zadania ani jawnie nie wyszukasz wyjątków, wyjątek zostanie utracony. Jeśli wykonasz operację await dla zadania, wyjątek zostanie ponownie zgłoszony. Najlepsze rozwiązanie to wykonywanie operacji await dla zadania za każdym razem. Pominięcie ostrzeżenia należy wziąć pod uwagę tylko w sytuacji, gdy na pewno nie chcesz czekać na zakończenie wywołania asynchronicznego oraz gdy wywołana metoda nie zgłosi żadnych wyjątków. W tym przypadku można pominąć ostrzeżenie, przydzielając wynik zadania wywołania do zmiennej.
pt_br: O método atual chama um método assíncrono que retorna uma Tarefa ou uma Tarefa<TResult> e não aplica o operador "await" ao resultado. A chamada ao método assíncrono inicia uma tarefa assíncrona. No entanto, como o operador "await" está aplicado, o programa continua sem aguardar a conclusão da tarefa. Na maioria dos casos, você não deseja esse comportamento. Geralmente, outros aspectos do método da chamada dependem dos resultados da chamada ou, no mínimo, espera-se que o método chamado seja concluído antes que você volte do método que contém a chamada. Outra questão importante é o que acontece com as exceções que são acionadas no método assíncrono chamado. As exceções acionadas em métodos que retornam uma Task ou Task<TResult> são armazenadas na tarefa retornada. Se você não aguardar a tarefa ou verificar explicitamente se há exceções, a exceção se perde. Se você aguardar a tarefa, a exceção é gerada novamente. Como melhor prática, recomendamos que você sempre aguarde a chamada. Você pode suprimir o aviso se tiver certeza de que não vai querer aguardar a conclusão da chamada assíncrona e de que o método da chamada não gerará exceções. Nesse caso, você pode atribuir o resultado de uma tarefa da chamada a uma variável para suprimir o aviso.
ru: Существующий метод вызывает асинхронный метод, который возвращает Task или Task<TResult> и не применяет оператор await к результату. Вызов асинхронного метода запускает асинхронную задачу. Однако, так как оператор await не применяется, программа продолжает работу, не дождавшись выполнения задачи. В большинстве случаев такое поведение не ожидается. Обычно другие аспекты вызова метода зависят от результатов вызова, или предполагается, что вызываемый метод будет завершен как минимум до возврата значения из метода, содержащего вызов. Не менее важно то, что происходит с исключениями, возникающими в вызываемом асинхронном методе. Исключение, возникающее в методе, который возвращает Task или Task<TResult>, хранится в возвращенной задаче. Если не ждать завершения задачи или не выполнить явную проверку на исключения, исключение теряется. Если подождать завершения задачи, исключение вызывается повторно. Рекомендуется всегда дожидаться вызова. Подавление предупреждений следует использовать только в том случае, если вы не хотите ждать завершения асинхронного вызова, а вызванный метод не создаст исключений. В этом случае можно подавить предупреждение, назначив результат задачи вызова для переменной.
tr: Geçerli yöntem, bir Görev veya Task<TResult> döndüren bir async metodunu çağırır ve await işlecini sonuca uygulamaz. async metodu çağrısı bir asenkron görev başlatır. Ancak, bir await işleci uygulanmadığından, program görevin tamamlanmasını beklemeden devam eder. Çoğu durumda, bu beklediğiniz davranış değildir. Genellikle çağrı metodunun diğer özellikleri o çağrının sonuçlarına bağlıdır veya en azından, çağrıyı içeren metottan dönülmeden önce çağrılan metodun tamamlanması beklenir. Aynı derecede önemli başka bir konu da çağrılan async metodunda tetiklenen özel durumlara ne olduğudur. Bir Görev veya Task<TResult> döndüren bir metotta tetiklenen özel durum döndürülen o görevde depolanır. Görevi beklemezseniz veya özel durumları açık olarak denetlerseniz özel durum kaybedilir. Görevi beklerseniz, özel durumu yeniden tetiklenir. En iyi deneyim olarak, çağrıyı her zaman beklemeniz gerekir. Yalnızca asenkron çağrının tamamlanmasını beklemek istemediğinizden ve çağrılan metodun bir özel durumu tetiklemeyeceğinden eminseniz bu uyarıyı gizlemeyi düşünmeniz gerekir. Bu durumda, çağrının görev sonucunu bir değişkene atayarak uyarıyı gizleyebilirsiniz.
zh_hans: 当前的方法调用返回一个 Task 或 Task<TResult> 的 async 方法，并且不会将 await 操作符应用到结果中。对 async 方法的调用将启动异步任务。但是，由于未应用 await 操作符，程序将继续运行而不会等待任务完成。在多数情况下，这种行为并不是你想要的。通常，调用方法的其他部分依赖调用结果，或者至少从包含此调用的方法中返回前需要完成此被调用的方法。 一个同样重要的问题是在调用的 async 方法中产生的异常将发生什么情况。在返回 Task 或 Task<TResult> 的方法中产生的异常存储在返回的任务中。如果你不等待任务完成或显式检查异常，则异常将丢失。如果你等待任务完成，则此异常将重新抛出。 最佳的做法是你应始终等待此调用完成。 仅当你确定不需要等待异步调用完成，并且调用的方法不会产生任何异常时，你可以考虑取消警告。为此，你可以通过将调用的任务结果分配给一个变量来取消警告。
zh_hant: 目前方法會呼叫傳回 Task 或 Task<TResult> 的 async 方法，而且不會將 await 運算子套用至結果。呼叫 async 方法會啟動非同步工作。不過，因為未套用 await 運算子，所以程式會繼續進行，而不會等待工作完成。在大多數情況下，該行為不會是您預期的行為。通常，calling 方法的其他層面取決於呼叫結果，或者至少必須先 called 方法，您才能從包含該呼叫的方法傳回。 另一個同樣重要的問題是，在 called async 方法中所引發的例外狀況會發生什麼情況。傳回 Task 或 Task<TResult> 之方法中所引發的例外狀況，會儲存在傳回的工作中。如果您不等待工作或明確地檢查例外狀況，則會遺失例外狀況。如果您等待工作，則會重新擲出其例外狀況。 最佳做法是一律等待呼叫。 只有在確定不想要等待非同步呼叫完成，且 called 方法不會引發任何例外狀況時，才應該考慮隱藏警告。在該情況下，將呼叫的工作結果指派給變數，即可隱藏警告。

# ERR_SynchronizedAsyncMethod
source: 'MethodImplOptions.Synchronized' cannot be applied to an async method
cs: 'Možnost MethodImplOptions.Synchronized nejde použít pro asynchronní metodu.
de: '"MethodImplOptions.Synchronized" kann nicht auf eine asynchrone Methode angewendet werden.
es: 'MethodImplOptions.Synchronized' no se puede aplicar a un método asincrónico
fr: 'MethodImplOptions.Synchronized' ne peut pas être appliqué à une méthode async
it: 'Non è possibile applicare 'MethodImplOptions.Synchronized' a un metodo asincrono
ja: 'MethodImplOptions.Synchronized' は、非同期メソッドに適用できません。
ko: 'MethodImplOptions.Synchronized'는 비동기 메서드에 적용할 수 없습니다.
pl: 'Atrybutu „MethodImplOptions.Synchronized” nie można stosować do metody asynchronicznej.
pt_br: 'Não é possível aplicar 'MethodImplOptions.Synchronized' a um método assíncrono
ru: 'Невозможно применить MethodImplOptions.Synchronized к асинхронному методу.
tr: 'MethodImplOptions.Synchronized' zaman uyumsuz bir yönteme uygulanamaz
zh_hans: '"MethodImplOptions.Synchronized" 不能应用于异步方法
zh_hant: 'MethodImplOptions.Synchronized' 無法套用至非同步方法

# ERR_NoConversionForCallerLineNumberParam
source: CallerLineNumberAttribute cannot be applied because there are no standard conversions from type '{0}' to type '{1}'
cs: CallerLineNumberAttribute nejde použít, protože neexistuje žádný standardní převod z typu {0} na {1}.
de: CallerLineNumberAttribute kann nicht angewendet werden, da keine Standardkonvertierungen von Typ "{0}" in Typ "{1}" verfügbar sind.
es: CallerLineNumberAttribute no se puede aplicar porque no hay conversiones estándar del tipo '{0}' al tipo '{1}'
fr: Impossible d'appliquer CallerLineNumberAttribute, car il n'existe pas de conversion standard du type '{0}' en type '{1}'
it: Non è possibile applicare CallerLineNumberAttribute perché non sono disponibili conversioni standard dal tipo '{0}' al tipo '{1}'
ja: 型 '{0}' を型 '{1}' に変換する標準変換が存在しないため、CallerLineNumberAttribute を適用することはできません
ko: {0}' 형식에서 '{1}' 형식으로의 표준 변환이 없기 때문에 CallerLineNumberAttribute를 적용할 수 없습니다.
pl: Klasy CallerLineNumberAttribute nie można zastosować, ponieważ nie ma standardowych konwersji z typu „{0}” do typu „{1}”
pt_br: CallerLineNumberAttribute não pode ser aplicado porque não há conversões padrões do tipo "{0}" para o tipo "{1}"
ru: Невозможно применить CallerLineNumberAttribute, так как отсутствуют стандартные преобразования из типа "{0}" в тип "{1}".
tr: {0}' türünden '{1}' türüne standart dönüştürme olmadığından CallerLineNumberAttribute uygulanamıyor
zh_hans: 无法应用 CallerLineNumberAttribute，因为不存在从类型“{0}”到类型“{1}”的标准转换
zh_hant: 無法套用 CallerLineNumberAttribute，因為沒有從類型 '{0}' 標準轉換成類型 '{1}'

# ERR_NoConversionForCallerFilePathParam
source: CallerFilePathAttribute cannot be applied because there are no standard conversions from type '{0}' to type '{1}'
cs: CallerFilePathAttribute nejde použít, protože neexistuje žádný standardní převod z typu {0} na {1}.
de: CallerFilePathAttribute kann nicht angewendet werden, da keine Standardkonvertierungen von Typ "{0}" in Typ "{1}" verfügbar sind.
es: CallerFilePathAttribute no se puede aplicar porque no hay conversiones estándar del tipo '{0}' al tipo '{1}'
fr: Impossible d'appliquer CallerFilePathAttribute, car il n'existe pas de conversion standard du type '{0}' en type '{1}'
it: Non è possibile applicare CallerFilePathAttribute perché non sono presenti conversioni standard dal tipo '{0}' al tipo '{1}'
ja: 型 '{0}' を型 '{1}' に変換する標準変換が存在しないため、CallerFilePathAttribute を適用することはできません
ko: {0}' 형식에서 '{1}' 형식으로의 표준 변환이 없기 때문에 CallerFilePathAttribute를 적용할 수 없습니다.
pl: Klasy CallerFilePathAttribute nie można zastosować, ponieważ nie ma standardowych konwersji z typu „{0}” do typu „{1}”
pt_br: CallerFilePathAttribute não pode ser aplicado porque não há conversões padrões do tipo "{0}" para o tipo "{1}"
ru: Невозможно применить CallerFilePathAttribute, так как отсутствуют стандартные преобразования из типа "{0}" в тип "{1}".
tr: {0}' türünden '{1}' türüne standart dönüştürme olmadığından CallerFilePathAttribute uygulanamıyor
zh_hans: 无法应用 CallerFilePathAttribute，因为不存在从类型“{0}”到类型“{1}”的标准转换
zh_hant: 無法套用 CallerFilePathAttribute，因為沒有從類型 '{0}' 標準轉換成類型 '{1}'

# ERR_NoConversionForCallerMemberNameParam
source: CallerMemberNameAttribute cannot be applied because there are no standard conversions from type '{0}' to type '{1}'
cs: CallerMemberNameAttribute nejde použít, protože neexistuje žádný standardní převod z typu {0} na {1}.
de: CallerMemberNameAttribute kann nicht angewendet werden, da keine Standardkonvertierungen von Typ "{0}" in Typ "{1}" verfügbar sind.
es: CallerMemberNameAttribute no se puede aplicar porque no hay conversiones estándar del tipo '{0}' al tipo '{1}'
fr: Impossible d'appliquer CallerMemberNameAttribute, car il n'existe pas de conversion standard du type '{0}' en type '{1}'
it: Non è possibile applicare CallerMemberNameAttribute perché non sono disponibili conversioni standard dal tipo '{0}' al tipo '{1}'
ja: 型 '{0}' を型 '{1}' に変換する標準変換が存在しないため、CallerMemberNameAttribute を適用することはできません
ko: {0}' 형식에서 '{1}' 형식으로의 표준 변환이 없기 때문에 CallerMemberNameAttribute를 적용할 수 없습니다.
pl: Klasy CallerMemberNameAttribute nie można zastosować, ponieważ nie ma standardowych konwersji z typu „{0}” do typu „{1}”
pt_br: CallerMemberNameAttribute não pode ser aplicado porque não há conversões padrões do tipo "{0}" para o tipo "{1}"
ru: Невозможно применить CallerMemberNameAttribute, так как отсутствуют стандартные преобразования из типа "{0}" в тип "{1}".
tr: {0}' türünden '{1}' türüne standart dönüştürme olmadığından CallerMemberNameAttribute uygulanamıyor
zh_hans: 无法应用 CallerMemberNameAttribute，因为不存在从类型“{0}”到类型“{1}”的标准转换
zh_hant: 無法套用 CallerMemberNameAttribute，因為沒有從類型 '{0}' 標準轉換成類型 '{1}'

# ERR_BadCallerLineNumberParamWithoutDefaultValue
source: The CallerLineNumberAttribute may only be applied to parameters with default values
cs: Atribut CallerLineNumberAttribute jde použít jenom pro parametry s výchozími hodnotami.
de: Das CallerLineNumberAttribute kann nur auf Parameter mit Standardwerten angewendet werden.
es: CallerLineNumberAttribute solo se puede aplicar a parámetros con valores predeterminados
fr: Le CallerLineNumberAttribute peut seulement être appliqué aux paramètres avec des valeurs par défaut
it: CallerLineNumberAttribute può essere applicato solo a parametri con valori predefiniti
ja: CallerLineNumberAttribute は、既定値を含むパラメーターにのみ適用できます
ko: CallerLineNumberAttribute는 기본값이 있는 매개 변수에만 적용할 수 있습니다.
pl: Atrybut CallerLineNumberAttribute można stosować wyłącznie do parametrów mających wartości domyślne.
pt_br: O CallerLineNumberAttribute só pode ser aplicado a parâmetros com valores padrão
ru: CallerLineNumberAttribute можно применять только к параметрам со значениями по умолчанию.
tr: CallerLineNumberAttribute yalnızca varsayılan değeri olan parametrelere uygulanabilir
zh_hans: CallerLineNumberAttribute 只能应用于具有默认值的参数
zh_hant: CallerLineNumberAttribute 只能套用至具有預設值的參數
