Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_PtrExpected
source: The * or -> operator must be applied to a pointer
cs: Operátor * nebo -> musí být použitý u ukazatele.
de: Der *-Operator oder der ->-Operator muss auf einen Zeiger angewendet werden.
es: El operador * o -> se debe aplicar a un puntero
fr: L'opérateur * ou -> doit être appliqué à un pointeur
it: L'operatore * o -> deve essere applicato a un puntatore
ja: * または -> 演算子はポインターに対して使用してください
ko: * 또는 -> 연산자는 포인터에 적용되어야 합니다.
pl: Do wskaźnika należy zastosować operator * lub ->
pt_br: O operador * ou -> deve ser aplicado a um ponteiro
ru: К указателю должен быть применен оператор * или ->.
tr: * veya -> işleci bir işaretçiye uygulanmalıdır
zh_hans: * 或 -> 运算符只能应用于指针
zh_hant: 必須對指標套用 * 或 -> 運算子

# ERR_PtrIndexSingle
source: A pointer must be indexed by only one value
cs: Ukazatel může být indexován jenom jednou hodnotou.
de: Ein Zeiger darf nur von einem Wert indiziert werden.
es: Un puntero solo puede estar indizado por un valor
fr: Un pointeur ne doit être indexé que par une seule valeur
it: Un puntatore deve essere indicizzato da un solo valore
ja: ポインターのインデックスを複数指定しないでください
ko: 포인터는 한 값에 의해서만 인덱싱되어야 합니다.
pl: Wskaźnik musi być indeksowany tylko przez jedną wartość
pt_br: Um ponteiro deve ser indexado somente por um valor
ru: Указатель должен быть проиндексирован только по одному значению.
tr: Bir işaretçi için yalnızca tek bir değere göre dizin oluşturulmalıdır
zh_hans: 指针必须只根据一个值进行索引
zh_hant: 只能使用一個值對指標編製索引

# WRN_ByRefNonAgileField
source: Using '{0}' as a ref or out value or taking its address may cause a runtime exception because it is a field of a marshal-by-reference class
cs: Použití prvku {0} jako hodnoty Ref nebo Out nebo převzetí jeho adresy může způsobit výjimku při běhu, protože se jedná o pole třídy marshal-by-reference.
de: Das Verwenden von "{0}" als ref- oder out-Wert bzw. das Annehmen der Adresse kann zu einer Laufzeitausnahme führen, weil es sich hierbei um ein Feld einer "Marshal by Reference"-Klasse handelt.
es: Si se utiliza '{0}' como valor out o ref, o se acepta su dirección, se puede producir una excepción en tiempo de ejecución porque es un campo de una clase de serialización por referencia.
fr: L'utilisation de '{0}' en tant que valeur ref ou out, ou la prise de son adresse, peut provoquer une exception runtime, car il s'agit d'un champ d'une classe de marshaling par référence
it: Se si usa '{0}' come valore out o ref oppure se ne accetta l'indirizzo, potrebbe verificarsi un'eccezione in fase di esecuzione perché è un campo di una classe con marshalling per riferimento
ja: 参照渡しのマーシャリングクラスのフィールドであるため、'{0}' を ref 値または out 値として使用したり、そのアドレスを取得したりすると、ランタイム例外が発生する可能性があります
ko: {0}'은(는) 참조로 마샬링하는 클래스의 필드이므로 ref 또는 out 값으로 사용하거나 해당 주소를 가져오면 런타임 예외가 발생할 수 있습니다.
pl: Użycie elementu „{0}” jako wartości ref lub out albo pobranie jego adresu może spowodować wyjątek czasu wykonywania, ponieważ to jest pole klasy marshal-by-reference
pt_br: Usar '{0}' como um valor ref ou out ou obter seu endereço pode gerar uma exceção de runtime porque ele é um campo de uma classe marshaling por referência
ru: Использование "{0}" в качестве значения ref или out или получение его адреса может вызвать исключение времени выполнения, поскольку это поле класса, который маршалируется по ссылке
tr: Bir başvuruya göre hazırlama sınıfının alanı olduğundan, '{0}' öğesini ref veya out değeri olarak kullanmak ya da adresini almak çalışma zamanı özel durumuna neden olabilir
zh_hans: 由于“{0}”是引用封送类的字段，将它用作 ref 或 out 值或获取它的地址可能导致运行时异常
zh_hant: 若將 '{0}' 用作為 ref 或 out 值或取得其位址，皆可能會導致執行階段例外狀況，因為其為傳址封送類別的欄位

# WRN_ByRefNonAgileField_Title
source: Using a field of a marshal-by-reference class as a ref or out value or taking its address may cause a runtime exception
cs: Použití pole třídy marshal-by-reference jako hodnoty Ref nebo Out nebo převzetí jeho adresy může způsobit běhovou výjimku.
de: Das Verwenden eines Felds einer "Marshal by Reference"-Klasse als ref- oder out-Wert bzw. das Annehmen seiner Adresse kann zu einer Laufzeitausnahme führen
es: Si se utiliza un campo de una clase de serialización por referencia como valor ref o out, o se acepta su dirección, se puede producir una excepción en tiempo de ejecución.
fr: L'utilisation d'un champ d'une classe de marshaling par référence en tant que valeur ref ou out, ou la prise de son adresse, peut provoquer une exception runtime
it: Se si usa come valore out o ref un campo di una classe con marshalling per riferimento oppure se ne accetta l'indirizzo, può verificarsi un'eccezione in fase di esecuzione
ja: 参照渡しのマーシャリングクラスのフィールドを ref 値または out 値として使用するか、そのフィールドのアドレスを取得すると、ランタイム例外が発生する可能性があります
ko: 참조로 마샬링하는 클래스의 필드를 ref 또는 out 값으로 사용하거나 해당 주소를 가져오면 런타임 예외가 발생할 수 있습니다.
pl: Użycie pola klasy marshal-by-reference jako wartości ref lub out albo pobranie jego adresu może spowodować wyjątek czasu wykonywania
pt_br: Usar um campo de uma classe marshaling por referência como um valor ref ou out ou obter seu endereço pode gerar uma exceção de tempo de execução
ru: Использование поля класса с маршалингом по ссылке в виде значения ref или out или получение его адреса может вызвать исключение времени выполнения
tr: Bir başvuruya göre hazırlama sınıfı alanını ref veya out değeri olarak kullanmak ya da adresini almak çalışma zamanı özel durumuna neden olabilir
zh_hans: 将引用封送类的字段用作 ref 或 out 值或获取其地址可能导致运行时异常
zh_hant: 若將傳址封送類別的欄位用作為 ref 或 out 值或取得其位址，皆可能會導致執行階段例外狀況

# ERR_AssgReadonlyStatic
source: A static readonly field cannot be assigned to (except in a static constructor or a variable initializer)
cs: Do statického pole určeného jen pro čtení nejde přiřazovat (kromě případu, kdy se nachází uvnitř statického konstruktoru nebo inicializátoru proměnné).
de: Einem statischen, schreibgeschützten Feld kann nichts zugewiesen werden (außer in einem statischen Konstruktor oder einem Variableninitialisierer).
es: No se puede asignar un campo de solo lectura estático (excepto en un constructor estático o inicializador de variable)
fr: Un champ readonly statique ne peut pas être assigné (sauf s'il appartient à un constructeur statique ou un initialiseur de variable)
it: Impossibile effettuare un'assegnazione a un campo statico in sola lettura (tranne che in un costruttore statico o in un inizializzatore di variabile)
ja: 静的読み取り専用フィールドへの割り当てはできません (静的コンストラクターまたは変数初期化子では可)
ko: 정적 읽기 전용 필드에는 할당할 수 없습니다. 단 정적 생성자 또는 변수 이니셜라이저에서는 예외입니다.
pl: Nie można przypisać wartości do statycznego pola tylko do odczytu (jest to możliwe tylko w konstruktorze statycznym lub w inicjatorze zmiennej).
pt_br: Um campo somente leitura estático não pode ser atribuído (exceto em um construtor estático ou inicializador de variável)
ru: Присваивание значений доступному только для чтения статическому полю допускается только в статическом конструкторе и в инициализаторе переменных.
tr: Statik salt okunur bir alana (statik oluşturucu veya değişken başlatıcı dışında) atama yapılamaz
zh_hans: 无法对静态只读字段赋值(静态构造函数或变量初始值中除外)
zh_hant: 不可指定為靜態唯讀欄位 (除非在靜態建構函式或變數初始設定式中)

# ERR_RefReadonlyStatic
source: A static readonly field cannot be used as a ref or out value (except in a static constructor)
cs: Statické pole určené jen pro čtení nejde použít jako hodnotu Ref nebo Out (kromě případu, kdy se nachází uvnitř statického konstruktoru).
de: Ein statisches schreibgeschütztes Feld kann (außer in einem statischen Konstruktor) nicht als ref- oder out-Wert verwendet werden.
es: No se puede usar un campo estático de solo lectura como valor out o ref (excepto en un constructor estático).
fr: Impossible d'utiliser un champ readonly statique en tant que valeur ref ou out (sauf dans un constructeur statique)
it: Non è possibile usare un campo di sola lettura statico come valore out o ref (tranne che in un costruttore statico)
ja: 静的な読み取り専用フィールドを ref 値または out 値として使用することはできません (静的コンストラクターでは可)
ko: 정적 읽기 전용 필드는 ref 또는 out 값으로 사용할 수 없습니다. 단 정적 생성자에서는 예외입니다.
pl: Statycznego pola tylko do odczytu nie można użyć jako wartości ref ani out (z wyjątkiem sytuacji, gdy znajduje się w konstruktorze statycznym)
pt_br: Um campo somente leitura estático não pode ser usado como um valor ref ou out (exceto em um construtor estático)
ru: Доступное только для чтения статическое поле можно использовать как значение ref или out только в статическом конструкторе
tr: Statik salt okunur bir alan (statik oluşturucu dışında) ref veya out değeri olarak kullanılamaz
zh_hans: 无法将静态只读字段用作 ref 或 out 值(静态构造函数中除外)
zh_hant: 無法將靜態唯讀欄位用作為 ref 或 out 值 (除非在靜態建構函式中)

# ERR_AssgReadonlyProp
source: Property or indexer '{0}' cannot be assigned to -- it is read only
cs: Vlastnost nebo indexer {0} nejde přiřadit – je jen pro čtení.
de: Für die Eigenschaft oder den Indexer "{0}" ist eine Zuweisung nicht möglich. Sie sind schreibgeschützt.
es: No se puede asignar a la propiedad o el indizador '{0}' porque es de solo lectura
fr: Impossible d'assigner la propriété ou l'indexeur '{0}' -- il est en lecture seule
it: Non è possibile assegnare un valore alla proprietà o all'indicizzatore '{0}' perché è di sola lettura
ja: プロパティまたはインデクサー '{0}' は読み取り専用であるため、割り当てることはできません
ko: {0}' 속성 또는 인덱서는 읽기 전용이므로 할당할 수 없습니다.
pl: Nie można przypisać wartości do właściwości lub indeksatora „{0}” – jest on tylko do odczytu
pt_br: A propriedade ou o indexador "{0}" não pode ser atribuído, pois é somente leitura
ru: Невозможно присвоить значение свойству или индексатору "{0}" — доступ только для чтения.
tr: {0}' özelliğine veya dizin oluşturucusuna, salt okunur olduğu için atama yapılamaz
zh_hans: 无法为属性或索引器“{0}”赋值 - 它是只读的
zh_hant: 無法指派為屬性或索引子 '{0}' -- 其為唯讀

# ERR_IllegalStatement
source: Only assignment, call, increment, decrement, await, and new object expressions can be used as a statement
cs: Jako příkaz jde použít jenom objektové výrazy přiřazení, volání, zvýšení nebo snížení hodnoty nebo výrazy obsahující operátor new.
de: Nur assignment-, call-, increment-, decrement-, await- und new-Objektausdrücke können als Anweisung verwendet werden.
es: Solo las expresiones de asignación, llamada, incremento, decremento, espera y objeto nuevo se pueden usar como instrucción
fr: Seuls une assignation, un appel, un incrément, un décrément et des expressions d'objet await et new peuvent être utilisés comme instruction
it: È possibile usare come istruzione solo le espressioni di assegnazione, chiamata, incremento, decremento, attesa e nuovo oggetto
ja: 代入、呼び出し、インクリメント、デクリメント、新しいオブジェクトの式のみがステートメントとして使用できます
ko: 대입, 호출, 증가, 감소 및 새 개체 식만 문으로 사용할 수 있습니다.
pl: Jako instrukcji można używać tylko wyrażeń przypisania, wywołania, zwiększenia, zmniejszenia, oczekiwania oraz utworzenia nowego obiektu.
pt_br: Somente as expressões de atribuição, chamada, incremento, diminuição, espera e novo objeto podem ser utilizadas como uma instrução
ru: В качестве оператора могут использоваться только выражения назначения, вызова, инкремента, декремента и создания нового объекта
tr: Yalnızca atama, çağrı, artırma, azaltma ve yeni nesne ifadeleri deyim olarak kullanılabilir
zh_hans: 只有 assignment、call、increment、decrement 和 new 对象表达式可用作语句
zh_hant: 只有指派、呼叫、遞增、遞減以及新的物件運算式，可以用做為陳述式

# ERR_BadGetEnumerator
source: foreach requires that the return type '{0}' of '{1}' must have a suitable public 'MoveNext' method and public 'Current' property
cs: Příkaz foreach vyžaduje, aby typ vracených hodnot {0} pro {1} měl vhodnou veřejnou metodu MoveNext a veřejnou vlastnost Current.
de: Für "foreach" muss der Rückgabetyp "{0}" von "{1}" über eine passende öffentliche MoveNext-Methode und eine öffentliche Current-Eigenschaft verfügen.
es: "foreach" requiere que el tipo de valor devuelto "{0}" de "{1}" tenga un método "MoveNext" público y una propiedad "Current" pública adecuados.
fr: Avec foreach, le type de retour '{0}' de '{1}' doit avoir une méthode 'MoveNext' publique appropriée et une propriété 'Current' publique
it: Con foreach il tipo restituito '{0}' di '{1}' deve essere associato a un metodo 'MoveNext' pubblico e a una proprietà 'Current' pubblica appropriati
ja: foreach では、戻り値の型 '{1}' の '{0}' に適切なパブリック MoveNext メソッドおよびパブリック Current プロパティが含まれている必要があります
ko: foreach의 반환 형식 '{1}'('{0}')에는 적절한 공용 MoveNext 메서드 및 공용 Current 속성이 있어야 합니다.
pl: Instrukcja foreach wymaga, aby typ zwracany „{0}” dla elementu „{1}” miał odpowiednią metodę publiczną „MoveNext” i właściwość publiczną „Current”
pt_br: foreach requer que o tipo de retorno '{0}' de '{1}' tenha um método 'MoveNext' público adequado e a propriedade 'Current' pública
ru: Оператор foreach требует, чтобы возвращаемый тип "{0}" для "{1}" имел соответствующий открытый метод MoveNext и открытое свойство Current.
tr: foreach, '{1}' öğesinin '{0}' döndürme türünde uygun bir ortak MoveNext yönteminin veya ortak Current özelliğinin olmasını gerektirir
zh_hans: foreach 要求“{1}”的返回类型“{0}”必须具有适当的公共 MoveNext 方法和公共 Current 属性
zh_hant: foreach 要求 '{1}' 的傳回類型 '{0}' 必須要有適合的公用 MoveNext 方法以及公用 Current 屬性

# ERR_TooManyLocals
source: Only 65534 locals, including those generated by the compiler, are allowed
cs: Je povolených jenom 65 534 lokálních proměnných, včetně těch, které generuje kompilátor.
de: Nur 65534 lokale Variablen, einschließlich der vom Compiler generierten, sind zulässig.
es: Solo se permiten 65534 variables locales incluyendo las generadas por el compilador
fr: Seules sont autorisées 65 534 variables locales, y compris celles générées par le compilateur
it: Sono consentite solo 65534 variabili locali, incluse quelle generate dal compilatore
ja: コンパイラが生成するものを含む 65534 のローカルのみが許可されています
ko: 지역 변수는 컴파일러가 생성한 것을 포함하여 65534개까지만 사용할 수 있습니다.
pl: Dozwolonych jest tylko 65534 elementów lokalnych, włącznie z wygenerowanymi przez kompilator
pt_br: São permitidos somente 65534 locais, incluindo os gerados pelo compilador
ru: Допускается использование только 65 534 локальных переменных с учетом тех, которые были созданы компилятором.
tr: Derleyici tarafından oluşturulanlar dahil yalnızca 65534 yerele izin verilir
zh_hans: 仅允许 65534 个局部变量，包括编译器生成的局部变量
zh_hant: 只可使用 65534 個區域變數，包括由編譯器所產生的區域變數

# ERR_AbstractBaseCall
source: Cannot call an abstract base member: '{0}'
cs: Nejde volat abstraktní základní člen: {0}.
de: Ein abstrakter Basismember kann nicht aufgerufen werden: "{0}"
es: No se puede llamar a un miembro base abstracto: '{0}'
fr: Impossible d'appeler un membre de base abstrait : '{0}'
it: Impossibile chiamare un membro di base astratto: '{0}'
ja: 抽象基本メンバーを呼び出すことはできません:'{0}'
ko: 추상 기본 멤버를 호출할 수 없습니다. '{0}'
pl: Nie można wywołać abstrakcyjnej składowej bazowej: „{0}”
pt_br: Não é possível chamar o membro de base abstrata: '{0}'
ru: Не удается вызвать абстрактный член базового класса: '{0}'
tr: Soyut bir temel üye çağrılamaz: '{0}'
zh_hans: 无法调用抽象基成员:“{0}”
zh_hant: 無法呼叫抽象基底成員: '{0}'

# ERR_RefProperty
source: A non ref-returning property or indexer may not be used as an out or ref value
cs: Vlastnost nebo indexer nevracející odkaz nejde použít jako hodnotu out nebo ref.
fr: Une propriété ou un indexeur qui ne retourne pas une référence ne peut pas être utilisé en tant que valeur ou référence de sortie
it: Una proprietà o un indicizzatore che non restituisce ref non possono essere usati come valori out o ref.
ja: 参照を返さないプロパティまたはインデクサーを out 値または ref 値として使用することはできません
pl: Nie można używać właściwości zwracającej inną wartość niż ref lub indeksatora jako wartości out lub ref
pt_br: Talvez uma propriedade ou um indexador sem retorno de ref não pode ser usado como um valor out ou ref
ru: Свойство или индексатор, не возвращающие значения, не могут использоваться в качестве значения out или ref.
zh_hans: 非引用返回属性或索引器不能用作 out 或 ref 值
zh_hant: 非參考傳回屬性或索引子不可以 out 或 ref 值形式使用

# ERR_ManagedAddr
source: Cannot take the address of, get the size of, or declare a pointer to a managed type ('{0}')
cs: Nejde převzít adresu proměnné spravovaného typu ({0}), získat její velikost nebo deklarovat ukazatel na ni.
de: Es ist nicht möglich, einen Zeiger für den verwalteten Typ ("{0}") zu deklarieren oder dessen Adresse oder Größe abzurufen.
es: No se puede adquirir la dirección, obtener el tamaño ni declarar un puntero a un tipo administrado ('{0}')
fr: Impossible de prendre l'adresse, d'obtenir la taille ou de déclarer un pointeur vers un type managé ('{0}')
it: Non è possibile accettare l'indirizzo di un tipo gestito ('{0}'), recuperarne la dimensione o dichiarare un puntatore a esso
ja: マネージ型 ('{0}') のアドレスの取得、サイズの取得、またはそのマネージ型へのポインターの宣言が実行できません
ko: 관리되는 형식('{0}')의 주소 또는 크기를 가져오거나 해당 형식에 대한 포인터를 선언할 수 없습니다.
pl: Nie można przyjąć adresu, pobrać rozmiaru lub zadeklarować wskaźnika typu zarządzanego („{0}”)
pt_br: Não é possível obter o endereço, obter o tamanho ou declarar um ponteiro para um tipo gerenciado ("{0}")
ru: Не удается получить адрес, определить размер или объявить указатель на управляемый тип ("{0}").
tr: Yönetilen türün ('{0}') adresi alınamaz, boyutu alınamaz veya işaretçisi bildirilemez
zh_hans: 无法获取托管类型(“{0}”)的地址和大小，或者声明指向它的指针
zh_hant: 無法取得 Managed 類型 ('{0}') 的位址、大小，也無法宣告指向它的指標

# ERR_BadFixedInitType
source: The type of a local declared in a fixed statement must be a pointer type
cs: Lokální proměnná deklarovaná v příkazu fixed musí být typu ukazatel.
de: Der Typ einer lokalen Variablen, die in einer fixed-Anweisung deklariert wird, muss ein Zeigertyp sein.
es: El tipo de una variable local declarado en una instrucción "fixed" debe ser un tipo de puntero
fr: Le type des variables locales déclaré dans une instruction fixed doit être un type pointeur
it: Il tipo di una variabile locale dichiarata in un'istruzione fixed deve essere un puntatore
ja: fixed ステートメントで宣言されたローカルの型は、ポインター型でなければなりません
ko: fixed 문에 선언된 지역 변수의 형식은 포인터 형식이어야 합니다.
pl: Typ zmiennej lokalnej zadeklarowanej w instrukcji fixed musi być typem wskaźnika
pt_br: O tipo de um local declarado em uma instrução fixed deve ser um tipo de ponteiro
ru: Локальная переменная, объявленная в операторе fixed, должна иметь тип указателя.
tr: Bir fixed deyiminde bildirilen yerel öğenin türü işaretçi türünde olmalıdır
zh_hans: fixed 语句中声明的局部变量类型必须是指针类型
zh_hant: 在 fixed 陳述式中宣告的區域變數類型必須為指標類型

# ERR_FixedMustInit
source: You must provide an initializer in a fixed or using statement declaration
cs: V deklaracích příkazů fixed a using je nutné zadat inicializátor.
de: Sie müssen in einer fixed- oder using-Anweisungsdeklaration einen Initialisierer bereitstellen.
es: Debe proporcionar un inicializador en una declaración de instrucción fixed o using
fr: Vous devez fournir un initialiseur dans une déclaration d'instruction fixed ou using
it: Occorre specificare un inizializzatore nella dichiarazione di un'istruzione fixed o using
ja: fixed または using ステートメントの宣言の中に、初期化子を指定してください
ko: fixed 또는 using 문 선언에 이니셜라이저를 입력해야 합니다.
pl: Inicjator musi zostać udostępniony w deklaracji instrukcji fixed lub using
pt_br: Forneça um inicializador em uma declaração de instrução fixed ou using
ru: Требуется указать инициализатор в объявлении оператора fixed или using.
tr: Bir fixed veya using deyimi bildiriminde bir başlatıcı sağlamalısınız
zh_hans: 必须在 fixed 或者 using 语句声明中提供初始值设定项
zh_hant: 在 fixed 或 using 陳述式宣告中，必須提供初始設定式

# ERR_InvalidAddrOp
source: Cannot take the address of the given expression
cs: Nejde převzít adresu daného výrazu.
de: Die Adresse des angegebenen Ausdrucks kann nicht übernommen werden.
es: No se puede adquirir la dirección de la expresión dada
fr: Impossible de prendre l'adresse de l'expression donnée
it: Non è possibile accettare l'indirizzo dell'espressione data
ja: 式のアドレスを取得できません
ko: 지정된 식의 주소를 가져올 수 없습니다.
pl: Nie można pobrać adresu podanego wyrażenia
pt_br: Não é possível obter o endereço da expressão especificada
ru: Невозможно получить адрес указанного выражения.
tr: Verili bir ifadenin adresi alınamaz
zh_hans: 无法获取给定表达式的地址
zh_hant: 無法取得指定運算式的位址

# ERR_FixedNeeded
source: You can only take the address of an unfixed expression inside of a fixed statement initializer
cs: Adresu volného výrazu jde převzít jenom uvnitř inicializátoru příkazu fixed.
de: Sie können nur die Adresse eines unfixed-Ausdrucks innerhalb eines fixed-Anweisungsinitialisierers abrufen.
es: Solo se puede adquirir la dirección de una expresión de tipo unfixed de un inicializador de instrucción "fixed"
fr: Vous ne pouvez prendre l'adresse d'une expression non fixed qu'à l'intérieur d'un initialiseur d'instruction fixed
it: È possibile accettare l'indirizzo di un'espressione unfixed solo all'interno dell'inizializzatore di un'istruzione fixed
ja: fixed ステートメントの初期化子内の fixed でない式のアドレスのみを取得できます
ko: 고정되지 않은 식의 주소는 fixed 문의 이니셜라이저를 통해서만 가져올 수 있습니다.
pl: Wewnątrz inicjatora instrukcji fixed można pobrać jedynie adres nieustalonego wyrażenia
pt_br: Só é possível obter o endereço de uma expressão unfixed dentro de um inicializador de instrução fixed
ru: Адрес нефиксированного выражения можно получить только внутри инициализатора оператора fixed.
tr: Bir fixed deyimi başlatıcısının içinde yalnızca sabitlenmemiş bir ifadenin adresini alabilirsiniz
zh_hans: 只能获取 fixed 语句初始值设定项内的未固定表达式的地址
zh_hant: 您只能取得 fixed 陳述式初始設定式中 unfixed 運算式的位址

# ERR_FixedNotNeeded
source: You cannot use the fixed statement to take the address of an already fixed expression
cs: K převzetí adresy výrazu, který je už nastavený jako pevný, nejde použít příkaz fixed.
de: Sie können nicht die fixed-Anweisung verwenden, um die Adresse eines bereits festen Ausdrucks abzurufen.
es: No se puede usar la instrucción "fixed" para adquirir la dirección de una expresión de tipo fixed
fr: Vous ne pouvez pas utiliser l'instruction fixed pour prendre l'adresse d'une expression qui est déjà fixed
it: Impossibile utilizzare l'istruzione fixed per accettare l'indirizzo di un'espressione già di tipo fixed
ja: 既に fixed が使用されている式のアドレスを取得するために、fixed ステートメントを使用することはできません
ko: 이미 고정된 식의 주소를 가져오는 데 fixed 문을 사용할 수 없습니다.
pl: Nie można użyć instrukcji fixed do pobrania adresu już ustalonego wyrażenia
pt_br: A instrução fixed não pode ser usada para obter o endereço de uma expressão fixed
ru: Получить адрес фиксированного выражения с помощью оператора fixed невозможно.
tr: Zaten sabitlenmiş bir ifadenin adresini almak için fixed deyimini kullanamazsınız
zh_hans: 不能使用 fixed 语句来获取已固定的表达式的地址
zh_hant: 您不能使用 fixed 陳述式來取得原本就是 fixed 運算式的位址

# ERR_UnsafeNeeded
source: Pointers and fixed size buffers may only be used in an unsafe context
cs: Ukazatele a vyrovnávací paměti pevné velikosti jde použít jenom v nezabezpečeném kontextu.
de: Zeiger und Puffer fester Größe können nur in einem unsicheren Kontext verwendet werden.
es: Los punteros y los búferes de tamaño fijo solo se pueden utilizar en un contexto no seguro
fr: Les pointeurs et les mémoires tampons de taille fixe ne peuvent être utilisés que dans un contexte unsafe
it: Puntatori e buffer a dimensione fissa possono essere usati solo in un contesto unsafe
ja: ポインターおよび固定サイズ バッファーは、unsafe コンテキストでのみ使用することができます
ko: 포인터와 고정 크기 버퍼는 안전하지 않은 컨텍스트에서만 사용할 수 있습니다.
pl: Wskaźniki i bufory o ustalonym rozmiarze mogą zostać użyte tylko w kontekście słowa kluczowego „unsafe”
pt_br: Ponteiros e buffers de tamanho fixo só podem ser usados em um contexto sem segurança
ru: Указатели и буферы фиксированного размера можно использовать только в небезопасном контексте.
tr: İşaretçiler ve sabit boyutlu arabellekler yalnızca güvenli olmayan bir bağlamda kullanılabilir
zh_hans: 指针和固定大小缓冲区只能在不安全的上下文中使用
zh_hant: 指標和固定大小緩衝區只能使用於 unsafe 內容中
