Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_MissingStructOffset
source: '{0}': instance field in types marked with StructLayout(LayoutKind.Explicit) must have a FieldOffset attribute
cs: {0}: Typy polí instance označené deklarací StructLayout(LayoutKind.Explicit) musí mít atribut FieldOffset.
de: {0}: Das Instanzenfeld in Typen, die mit "StructLayout(LayoutKind.Explicit)" markiert sind, muss ein FieldOffset-Attribut aufweisen.
es: "{0}": el campo de instancia en tipos marcados con StructLayout(LayoutKind.Explicit) debe tener un atributo FieldOffset
fr: '{0}' : un champ d'instance dans les types marqués avec StructLayout(LayoutKind.Explicit) doit avoir un attribut FieldOffset
it: '{0}': il campo dell'istanza nei tipi contrassegnati con StructLayout(LayoutKind.Explicit) deve contenere un attributo FieldOffset
ja: '{0}': StructLayout(LayoutKind.Explicit) でマークされた型のインスタンス フィールドには、FieldOffset 属性を指定する必要があります
ko: '{0}': StructLayout(LayoutKind.Explicit)으로 표시된 형식의 인스턴스 필드에는 FieldOffset 특성이 있어야 합니다.
pl: „{0}”: pola wystąpienia w ramach typów oznaczonych elementem StructLayout(LayoutKind.Explicit) muszą mieć atrybut FieldOffset
pt_br: '{0}': campo de instância em tipos marcados com StructLayout(LayoutKind.Explicit) precisam ter um atributo FieldOffset
ru: "{0}": поле экземпляра с типами, помеченными StructLayout(LayoutKind.Explicit), должно иметь атрибут FieldOffset
tr: '{0}': StructLayout(LayoutKind.Explicit) ile işaretlenen örnek alan türlerinin FieldOffset özniteliği olmalıdır
zh_hans: “{0}”: 标记为 StructLayout(LayoutKind.Explicit) 的实例字段类型必须具有 FieldOffset 特性
zh_hant: '{0}': 標記有 StructLayout(LayoutKind.Explicit) 之類型的執行個體欄位，必須要有 FieldOffset 屬性

# WRN_ExternMethodNoImplementation
source: Method, operator, or accessor '{0}' is marked external and has no attributes on it. Consider adding a DllImport attribute to specify the external implementation.
cs: Metoda, operátor nebo přistupující objekt {0} je označený jako externí a nemá žádné atributy. Zvažte možnost přidání atributu DllImport k určení externí implementace.
de: Die Methode, der Operator oder der Accessor "{0}" ist als extern markiert und enthält keine Attribute. Fügen Sie ein DllImport-Attribut hinzu, um die externe Implementierung anzugeben.
es: El método, operador o descriptor de acceso '{0}' está marcado como externo y no tiene atributos. Puede agregar un atributo DllImport para especificar la implementación externa.
fr: La méthode, l'opérateur ou l'accesseur '{0}' est marqué comme external et n'a pas d'attribut. Ajoutez un attribut DllImport pour spécifier l'implémentation externe.
it: Il metodo, la funzione di accesso o l'operatore '{0}' è contrassegnato come esterno e non include attributi. Provare ad aggiungere un attributo DllImport per specificare l'implementazione esterna.
ja: メソッド、演算子、またはアクセサー '{0}' は external に設定されていて属性を持っていません。外部の実装を指定するには、DllImport 属性の追加を検討してください。
ko: {0}' 메서드, 연산자 또는 접근자가 외부로 표시되었지만 특성이 없습니다. DllImport 특성을 추가하여 외부 구현을 지정하세요.
pl: Metoda, operator lub metoda dostępu „{0}” jest oznaczona jako zewnętrzna i nie ma atrybutów. Rozważ dodanie atrybutu DllImport w celu określenia implementacji zewnętrznej.
pt_br: Método, operador ou acessador "{0}" está marcado como externo e sem atributos. Considere a adição de um atributo DllImport para especificar a implementação externa.
ru: Метод, оператор или метод доступа "{0}" помечен как внешний и не имеет атрибутов. Для указания на внешнюю реализацию, возможно, следует добавить атрибут DllImport.
tr: {0}' yöntemi, işleci veya erişeni dış olarak işaretlenmiş ve hiç özniteliği yok. Dış uygulamayı belirtmek için DllImport özniteliği eklemeyi düşünün.
zh_hans: 方法、运算符或访问器“{0}”标记为外部对象并且它上面没有任何特性。请考虑添加一个 DllImport 特性以指定外部实现。
zh_hant: 方法、運算子或存取子 '{0}' 已標記為外部，但其上沒有屬性。請考慮加入 DllImport 屬性來指定外部實作。

# WRN_ExternMethodNoImplementation_Title
source: Method, operator, or accessor is marked external and has no attributes on it
cs: Metoda, operátor nebo přistupující objekt používá deklaraci external a nemá žádné atributy.
de: Methode, Operator oder Accessor ist extern markiert und weist keine Attribute auf
es: El método, el operador o el descriptor de acceso están marcados como externos y no tienen atributos
fr: La méthode, l'opérateur ou l'accesseur est marqué comme external et n'a pas d'attribut
it: Il metodo, la funzione di accesso o l'operatore è contrassegnato come esterno ed è privo di attributi
ja: メソッド、演算子、またはアクセサーは external に設定されていて属性を持っていません
ko: 메서드, 연산자 또는 접근자가 external로 표시되었지만 특성이 없습니다.
pl: Metoda, operator lub metoda dostępu są oznaczone jako zewnętrzne i nie zawierają atrybutów
pt_br: O método, operador ou assessor está marcado como externo e sem atributos
ru: Метод, оператор или метод доступа помечен как внешний и не имеет атрибутов
tr: Yöntem, işleyici veya erişimci dış olarak işaretlendi ve üzerinde hiçbir öznitelik yok
zh_hans: 方法、运算符或访问器标记为外部对象并且上面没有任何特性
zh_hant: 方法、運算子或存取子標記為外部，而且其上沒有屬性

# WRN_ProtectedInSealed
source: '{0}': new protected member declared in sealed type
cs: {0}: V zapečetěném typu je deklarovaný nový chráněný člen.
fr: '{0}' : nouveau membre protégé déclaré dans le type sealed
it: '{0}': il nuovo membro protetto è stato dichiarato nel tipo sealed
ja: '{0}': 新規の protected メンバーが sealed 型で宣言されました
pl: „{0}”: w typie zapieczętowanym została zadeklarowana nowa chroniona składowa
pt_br: '{0}': novo membro protegido declarado no tipo selado
ru: "{0}": новый защищенный элемент объявлен в запечатанном типе.
zh_hans: “{0}”: 在密封类型中声明了新的保护成员
zh_hant: '{0}': 在密封類型中宣告了新的 Protected 成員

# WRN_ProtectedInSealed_Title
source: New protected member declared in sealed type
cs: V zapečetěném typu je deklarovaný nový chráněný člen
fr: Nouveau membre protégé déclaré dans le type sealed
it: Il nuovo membro protetto è stato dichiarato nel tipo sealed
ja: 新規の protected メンバーが sealed 型で宣言されました
pl: W typie zapieczętowanym zadeklarowano nową chronioną składową
pt_br: Novo membro protegido declarado no tipo selado
ru: Новый защищенный элемент объявлен в запечатанном типе
zh_hans: 在密封类型中声明了新的保护成员
zh_hant: 在密封類型中宣告了新的 Protected 成員

# ERR_InterfaceImplementedByConditional
source: Conditional member '{0}' cannot implement interface member '{1}' in type '{2}'
cs: Podmíněný člen {0} nemůže implementovat člen rozhraní {1} v typu {2}.
de: Der bedingte Member "{0}" kann den Schnittstellenmember "{1}" im Typ "{2}" nicht implementieren.
es: El miembro condicional '{0}' no puede implementar el miembro de interfaz '{1}' en el tipo '{2}'
fr: Le membre conditionnel '{0}' ne peut pas implémenter le membre d'interface '{1}' dans le type '{2}'
it: Il membro condizionale '{0}' non può implementare il membro di interfaccia '{1}' nel tipo '{2}'
ja: 条件付きメンバー '{0}' はインターフェイス メンバー '{1}' を型 '{2}' で実装できません
ko: {0}' 조건부 멤버는 '{2}' 형식으로 '{1}' 인터페이스 멤버를 구현할 수 없습니다.
pl: Warunkowa składowa „{0}” nie może implementować składowej interfejsu „{1}” w typie „{2}”
pt_br: Membro condicional "{0}" não pode implementar membro de interface "{1}" no tipo "{2}"
ru: Условный член "{0}" не может реализовать член интерфейса "{1}" в типе "{2}".
tr: {0}' Conditional üyesi '{2}' türünde '{1}' arabirim üyesini uygulayamaz
zh_hans: 条件成员“{0}”无法实现类型“{2}”中的接口成员“{1}”
zh_hant: Conditional 成員 '{0}' 無法在類型 '{2}' 中實作介面成員 '{1}'

# ERR_IllegalRefParam
source: ref and out are not valid in this context
cs: Atributy ref a out nejsou v tomto kontextu platné.
de: "ref" und "out" sind in diesem Kontext nicht gültig.
es: ref y out no son válidos en este contexto
fr: ref et out ne sont pas valides dans ce contexte
it: ref e out non sono validi in questo contesto
ja: ref および out はこのコンテキストでは有効ではありません
ko: 이 컨텍스트에서는 ref 및 out을 사용할 수 없습니다.
pl: Parametry „ref” i „out” są nieprawidłowe w tym kontekście
pt_br: ref e out não são válidos neste contexto
ru: Ключевые слова ref и out недопустимы в этом контексте.
tr: ref ve out bu bağlamda geçerli değildir
zh_hans: ref 和 out 参数在此上下文中无效
zh_hant: ref 和 out 在此內容中無效

# ERR_BadArgumentToAttribute
source: The argument to the '{0}' attribute must be a valid identifier
cs: Argument atributu {0} musí být platný identifikátor.
de: Das Argument für das {0}-Attribut muss ein gültiger Bezeichner sein.
es: El argumento pasado al atributo '{0}' debe ser un identificador válido
fr: L'argument de l'attribut '{0}' doit être un identificateur valide
it: L'argomento dell'attributo '{0}' deve essere un identificatore valido
ja: 属性 '{0}' に対する引数は、有効な識別子である必要があります
ko: {0}' 특성의 인수에는 유효한 식별자를 사용해야 합니다.
pl: Argument atrybutu „{0}” musi być prawidłowym identyfikatorem
pt_br: O argumento para o atributo "{0}" atributo deve ser um identificador válido
ru: Аргумент для атрибута "{0}" должен быть допустимым идентификатором.
tr: {0}' özniteliğine geçirilen bağımsız değişken geçerli bir tanımlayıcı olmalıdır
zh_hans: “{0}”特性的参数必须是有效的标识符
zh_hant: '{0}' 屬性的引數必須是有效的識別項

# ERR_StructOffsetOnBadStruct
source: The FieldOffset attribute can only be placed on members of types marked with the StructLayout(LayoutKind.Explicit)
cs: Atribut FieldOffset jde použít jenom pro členy typů s deklarací StructLayout(LayoutKind.Explicit).
de: Das FieldOffset-Attribut kann nur für Member des mit "StructLayout(LayoutKind.Explicit)" markierten Typs festgelegt werden.
es: El atributo FieldOffset solo se puede colocar en miembros de tipos marcados con StructLayout(LayoutKind.Explicit)
fr: L'attribut FieldOffset ne peut être placé que sur des membres de types marqués avec StructLayout(LayoutKind.Explicit)
it: L'attributo FieldOffset può essere usato solo in membri di tipo contrassegnati con StructLayout(LayoutKind.Explicit)
ja: FieldOffset 属性は、StructLayout(LayoutKind.Explicit) でマークされた型のメンバーでのみ使用できます
ko: FieldOffset 특성은 StructLayout(LayoutKind.Explicit)으로 표시된 형식의 멤버에만 배치할 수 있습니다.
pl: Atrybut FieldOffset można umieścić tylko w składowych o typie oznaczonym przy użyciu atrybutu StructLayout(LayoutKind.Explicit).
pt_br: O atributo FieldOffset só pode ser colocado em membros de tipos marcados com StructLayout(LayoutKind.Explicit)
ru: Атрибут FieldOffset может назначаться только членам типов, для которых используется StructLayout(LayoutKind.Explicit).
tr: FieldOffset özniteliği yalnızca StructLayout(LayoutKind.Explicit) ile işaretlenmiş türlerdeki üyelere koyulabilir
zh_hans: FieldOffset 特性只能放置在标记为 StructLayout(LayoutKind.Explicit) 的类型的成员上
zh_hant: FieldOffset 屬性僅能置於標記為 StructLayout(LayoutKind.Explicit) 類型的成員上

# ERR_StructOffsetOnBadField
source: The FieldOffset attribute is not allowed on static or const fields
cs: Atribut FieldOffset není povolený pro pole typu static nebo const.
de: Das FieldOffset-Attribut ist für statische oder konstante Felder nicht zulässig.
es: El atributo FieldOffset no se permite en campos static ni const
fr: L'attribut FieldOffset n'est pas autorisé sur des champs static ou const
it: L'uso dell'attributo FieldOffset non è consentito nei campi static o const
ja: FieldOffset 属性は、static または const フィールドで使用できません
ko: static 또는 const 필드에는 FieldOffset 특성을 사용할 수 없습니다.
pl: Atrybut FieldOffset jest niedozwolony w polach typu static lub const
pt_br: O atributo FieldOffset não é permitido em campos estáticos e const
ru: Для полей static и const атрибут FieldOffset не разрешен.
tr: FieldOffset özniteliğine static veya const alanlarda izin verilmez
zh_hans: 静态字段或常量字段上不允许存在 FieldOffset 特性
zh_hant: static 或 const 欄位不能有 FieldOffset 屬性

# ERR_AttributeUsageOnNonAttributeClass
source: Attribute '{0}' is only valid on classes derived from System.Attribute
cs: Atribut {0} je platný jenom pro třídy odvozené od třídy System.Attribute.
de: Das Attribut "{0}" ist nur gültig für Klassen, die von System.Attribute abgeleitet wurden.
es: El atributo '{0}' solo es válido en clases derivadas de System.Attribute
fr: L'attribut '{0}' n'est valide que dans les classes dérivées de System.Attribute
it: L'attributo '{0}' è valido solo in classi derivate da System.Attribute
ja: 属性 '{0}' は、System.Attribute から派生したクラスでのみ有効です。
ko: {0}' 특성은 System.Attribute에서 파생된 클래스에만 유효합니다.
pl: Atrybut „{0}” jest prawidłowy tylko w klasach pochodzących od klasy System.Attribute
pt_br: Atributo "{0}" é somente válido em classes derivadas de System.Attribute
ru: Атрибут "{0}" допустим только для классов, наследуемых из System.Attribute.
tr: {0}' özniteliği yalnızca System.Attribute türevi olan sınıflarda geçerlidir
zh_hans: 特性“{0}”仅在从 System.Attribute 派生的类上有效
zh_hant: 屬性 '{0}' 只有在衍生自 System.Attribute 的類別上才有效

# WRN_PossibleMistakenNullStatement
source: Possible mistaken empty statement
cs: Možná chybný prázdný příkaz
de: Möglicherweise falsche leere Anweisung
es: Posible instrucción vacía errónea
fr: Possibilité d'instruction vide erronée
it: L'istruzione vuota è probabilmente errata
ja: empty ステートメントが間違っている可能性があります
ko: 빈 문에 오류가 있는 것 같습니다.
pl: Prawdopodobnie omyłkowo wystąpiła pusta instrukcja
pt_br: Instrução empty possivelmente incorreta
ru: Возможно, ошибочный пустой оператор
tr: Hatalı olabilecek boş deyim
zh_hans: 空语句可能有错误
zh_hant: 可能誤用了空白的陳述式

# WRN_PossibleMistakenNullStatement_Title
source: Possible mistaken empty statement
cs: Možná chybný prázdný příkaz
de: Möglicherweise falsche leere Anweisung
es: Posible instrucción vacía errónea
fr: Possibilité d'instruction vide erronée
it: L'istruzione vuota è probabilmente errata
ja: empty ステートメントが間違っている可能性があります
ko: 빈 문에 오류가 있는 것 같습니다.
pl: Prawdopodobnie omyłkowo wystąpiła pusta instrukcja
pt_br: Instrução empty possivelmente incorreta
ru: Возможно, ошибочный пустой оператор
tr: Hatalı olabilecek boş deyim
zh_hans: 空语句可能有错误
zh_hant: 可能誤用了空白的陳述式

# ERR_DuplicateNamedAttributeArgument
source: '{0}' duplicate named attribute argument
cs: 'Duplicitní argument pojmenovaného atributu {0}
de: '"{0}" ist ein doppeltes benanntes Attributargument.
es: '{0}' es un argumento de atributo con nombre duplicado
fr: 'Argument d'attribut nommé '{0}' en double
it: 'L'argomento di attributo denominato '{0}' è duplicato
ja: '{0}' 属性引数の名前が重複しています
ko: '{0}'은(는) 중복 명명된 특성 인수입니다.
pl: „{0}” zduplikowany nazwany argument atrybutu
pt_br: "{0}" duplicar argumento de atributo nomeado
ru: "{0}" повторяющийся именованный аргумент атрибута
tr: '{0}' yinelenen adlandırılmış öznitelik bağımsız değişkeni
zh_hans: “{0}”重复命名特性参数
zh_hant: '{0}' 有重複的具名屬性引數

# ERR_DeriveFromEnumOrValueType
source: '{0}' cannot derive from special class '{1}'
cs: {0} se nemůže odvozovat ze speciální třídy {1}.
de: 'Die "{0}"-Klasse kann nicht von der speziellen "{1}"-Klasse abgeleitet werden.
es: '{0}' no se puede derivar de la clase especial '{1}'
fr: '{0}' ne peut pas dériver de la classe spéciale '{1}'
it: '{0}' non può derivare dalla classe speciale '{1}'
ja: '{0}' は特殊クラス '{1}' から派生することはできません
ko: '{0}'은(는) '{1}' 특수 클래스에서 파생될 수 없습니다.
pl: „{0}” nie może pochodzić od klasy specjalnej „{1}”
pt_br: "{0}" não pode derivar de classe especial "{1}"
ru: "{0}" не может наследовать от специального класса "{1}".
tr: '{0}', '{1}' özel sınıfından türetilemez
zh_hans: “{0}”无法从特殊类“{1}”派生
zh_hant: '{0}' 不可衍生自特殊類別 '{1}'

# ERR_DefaultMemberOnIndexedType
source: Cannot specify the DefaultMember attribute on a type containing an indexer
cs: Atribut DefaultMember nejde zadat pro typ obsahující indexer.
de: Das DefaultMember-Attribut kann nicht für einen Typ angegeben werden, der einen Indexer enthält.
es: No se puede especificar el atributo DefaultMember en un tipo que contenga un indizador
fr: Impossible de spécifier l'attribut DefaultMember sur un type contenant un indexeur
it: Impossibile specificare l'attributo DefaultMember in un tipo contenente un indicizzatore
ja: インデクサーを含む型に対して DefaultMember 属性を指定できません
ko: 인덱서를 포함하는 형식에 DefaultMember 특성을 지정할 수 없습니다.
pl: Dla typu zawierającego indeksator nie można określić atrybutu DefaultMember.
pt_br: Não é possível especificar o atributo DefaultMember em um tipo que contém um indexador
ru: Невозможно указать атрибут DefaultMember для типа, содержащего индексатор.
tr: Dizin oluşturucu içeren bir tür üzerinde DefaultMember özniteliği belirtilemez
zh_hans: 不能对包含索引器的类型指定 DefaultMember 特性
zh_hant: 無法在包含索引子的類型上指定 DefaultMember 屬性

# ERR_BogusType
source: '{0}' is a type not supported by the language
cs: 'Typ {0} není tímto jazykem podporovaný.
de: '"{0}" ist ein Typ, der von der Sprache nicht unterstützt wird.
es: 'El idioma no admite el tipo '{0}'
fr: '{0}' est un type qui n'est pas pris en charge par le langage
it: '{0}' è un tipo non supportato dal linguaggio
ja: '{0}' はこの言語でサポートされていない型です
ko: '{0}'은(는) 언어에서 지원하는 형식이 아닙니다.
pl: 'Element „{0}” jest typem obsługiwanym przez język.
pt_br: "{0}" é um tipo sem suporte no idioma
ru: "{0}" является типом, который не поддерживается в данном языке.
tr: '{0}' dil tarafından desteklenmeyen bir tür
zh_hans: “{0}”不是现用语言支持的类型
zh_hant: '此語言不支援類型 '{0}'

# WRN_UnassignedInternalField
source: Field '{0}' is never assigned to, and will always have its default value {1}
cs: Do pole {0} se nikdy nic nepřiřadí. Bude mít vždy výchozí hodnotu {1}.
de: Dem Feld "{0}" wird nie etwas zugewiesen, und es hat immer seinen Standardwert von "{1}".
es: El campo '{0}' nunca se asigna y siempre tendrá el valor predeterminado {1}
fr: Le champ '{0}' n'est jamais assigné et aura toujours sa valeur par défaut {1}
it: Non è possibile assegnare un valore diverso al campo '{0}'. Il valore predefinito è {1}
ja: フィールド '{0}' は割り当てられません。常に既定値 {1} を使用します
ko: {0}' 필드에는 할당되지 않으므로 항상 {1} 기본값을 사용합니다.
pl: Do pola „{0}” nigdy nie jest przypisywana wartość i będzie ono mieć zawsze wartość domyślną {1}
pt_br: Campo "{0}" nunca é atribuído e sempre terá seu valor padrão {1}
ru: Полю "{0}" нигде не присваивается значение, поэтому оно всегда будет иметь значение по умолчанию {1}.
tr: {0}' alanı hiçbir zaman atanmaz ve her zaman varsayılan {1} değerine sahip olur
zh_hans: 从未对字段“{0}”赋值，字段将一直保持其默认值 {1}
zh_hant: 從未指派欄位 '{0}'，會持續使用其預設值 {1}

# WRN_UnassignedInternalField_Title
source: Field is never assigned to, and will always have its default value
cs: Do pole se nikdy nic nepřiřadí. Bude mít vždycky výchozí hodnotu.
de: Feld wird niemals zugewiesen, und hat immer den Standardwert
es: El campo nunca se asigna y siempre tendrá su valor predeterminado
fr: Le champ n'est jamais assigné et aura toujours sa valeur par défaut
it: Non è possibile assegnare al campo un valore diverso da quello predefinito
ja: フィールドは割り当てられません。常に既定値を使用します
ko: 필드에는 할당되지 않으므로 항상 기본값을 사용합니다.
pl: Do pola nigdy nie jest przypisywana wartość i będzie ono mieć zawsze wartość domyślną
pt_br: O campo nunca é atribuído e sempre terá seu valor padrão
ru: Поле никогда не назначается и всегда будет иметь значение по умолчанию
tr: Alan hiçbir zaman atanmaz ve her zaman varsayılan değerine sahip olur
zh_hans: 从未对字段赋值，字段将一直保持其默认值
zh_hant: 從未指派欄位，會持續使用其預設值

# ERR_CStyleArray
source: Bad array declarator: To declare a managed array the rank specifier precedes the variable's identifier. To declare a fixed size buffer field, use the fixed keyword before the field type.
cs: Chybný deklarátor pole. Při deklaraci spravovaného pole musí být specifikátor rozměru uvedený před identifikátorem proměnné. Při deklaraci pole vyrovnávací paměti pevné velikosti uveďte před typem pole klíčové slovo fixed.
de: Fehlerhafter Arraydeklarator: Beim Deklarieren eines verwalteten Arrays steht der Rangspezifizierer vor dem Variablenbezeichner. Zum Deklarieren eines Pufferfelds fester Größe verwenden Sie vor dem Feldtyp das fixed-Schlüsselwort.
es: Declarador de matriz erróneo. Para declarar una matriz administrada, el especificador de rango precede al identificador de la variable. Para declarar un campo de búfer de tamaño fijo, use la palabra clave fixed delante del tipo de campo.
fr: Déclarateur de tableau erroné. Pour déclarer un tableau managé, le spécificateur de rang précède l'identificateur de la variable. Pour déclarer un champ de mémoire tampon de taille fixe, utilisez le mot clé fixed avant le type de champ.
it: Il dichiaratore di matrice è errato: per dichiarare una matrice gestita, l'identificatore del numero di dimensioni deve precedere l'identificatore della variabile. Per dichiarare un campo buffer a dimensione fissa, usare la parola chiave fixed prima del tipo di campo.
ja: 不適切な配列の宣言子: マネージ配列を宣言するには、次元指定子を変数の識別子の前に指定します。固定サイズ バッファー フィールドを宣言するには、フィールド型の前に fixed キーワードを使用します。
ko: 배열 선언자가 잘못되었습니다. 관리되는 배열을 선언하려면 차수 지정자가 변수 식별자보다 앞에 와야 합니다. 고정 크기 버퍼 필드를 선언하려면 fixed 키워드를 필드 형식 앞에 사용하세요.
pl: Niewłaściwy deklarator tablicy. Aby zadeklarować tablicę zarządzaną, przed identyfikatorem zmiennej umieść specyfikator rangi tablicy. Aby zadeklarować pole buforu o ustalonym rozmiarze, przed typem pola użyj słowa kluczowego „fixed”.
pt_br: Declarador de matriz incorreto: para declarar uma matriz gerenciada, o especificador de classificação antecede o identificador de variável. Para declarar um campo de buffer de tamanho fixo, use a palavra-chave fixed antes do tipo de campo.
ru: Неверный оператор объявления массива. Для объявления управляемого массива спецификатор ранга должен предшествовать идентификатору переменной. Чтобы объявить поле буфера фиксированного размера, перед типом поля используйте ключевое слово fixed.
tr: Hatalı dizi bildirimcisi: Sıra belirleyicisi, yönetilen bir diziyi bildirmek için değişkenin tanımlayıcısından önce gelir. Sabit boyutlu arabellek alanı bildirmek için, alan türünden önce fixed anahtar sözcüğünü kullanın.
zh_hans: 错误的数组声明符: 要声明托管数组，秩说明符应位于变量标识符之前。要声明固定大小缓冲区字段，应在字段类型之前使用 fixed 关键字。
zh_hant: 陣列宣告子無效: 若要宣告 Managed 陣列，陣序規範必須位於變數識別項之前。若要宣告固定大小緩衝區欄位，請在欄位類型之前使用 fixed 關鍵字。

# WRN_VacuousIntegralComp
source: Comparison to integral constant is useless; the constant is outside the range of type '{0}'
cs: Porovnání s integrální konstantou je zbytečné; hodnota konstanty je mimo rozsah typu {0}.
de: Der Vergleich mit einer ganzzahligen Konstante ist nutzlos. Die Konstante befindet sich außerhalb des Bereichs vom Typ "{0}".
es: La comparación con la constante integral no es válida; la constante está fuera del intervalo del tipo '{0}'
fr: La comparaison à la constante intégrale est inutile, car la constante est en dehors de la plage du type '{0}'
it: Il confronto con la costante integrale è inutile. La costante non è inclusa nell'intervallo del tipo '{0}'
ja: 整数定数への比較ができません。定数が型 '{0}' の範囲外です
ko: 정수 계열 상수와 비교하는 것은 의미가 없습니다. 상수가 '{0}' 형식의 범위를 벗어났습니다.
pl: Porównanie ze stałą całkowitoliczbową jest bezcelowe. Stała jest poza zakresem typu „{0}”.
pt_br: Comparação com constante integral é inútil; a constante está fora do intervalo do tipo "{0}"
ru: Сравнение с целочисленной константой не имеет смысла; константа находится вне диапазона значений типа "{0}".
tr: İntegral sabitiyle karşılaştırma yararsızdır; sabit '{0}' türü aralığının dışında
zh_hans: 与整数常量比较无意义；该常量不在“{0}”类型的范围之内
zh_hant: 與整數常數比較無意義，因為此常數位於類型 '{0}' 的範圍外

# WRN_VacuousIntegralComp_Title
source: Comparison to integral constant is useless; the constant is outside the range of the type
cs: Porovnání s integrální konstantou je zbytečné; hodnota konstanty je mimo rozsah typu.
de: Der Vergleich zu einer integralen Konstante ist nutzlos; die Konstante befindet sich außerhalb des zulässigen Bereichs für den Typ
es: La comparación con la constante integral es inútil. La constante está fuera del intervalo del tipo
fr: La comparaison à la constante intégrale est inutile, car la constante est en dehors de la plage du type
it: Il confronto con la costante integrale è inutile. La costante non è inclusa nell'intervallo del tipo
ja: 整数定数への比較は無意味です。定数が型の範囲外です
ko: 정수 계열 상수와 비교하는 것은 의미가 없습니다. 상수가 형식의 범위를 벗어났습니다.
pl: Porównanie ze stałą całkowitoliczbową jest bezcelowe; stała jest poza zakresem typu
pt_br: A comparação com constante integral é inútil. A constante está fora do intervalo do tipo
ru: Сравнение с константой интеграции бесполезно: константа находится за пределами диапазона типа
tr: Tam sayı sabiti ile karşılaştırma yararsızdır, sabit türün aralığının dışında
zh_hans: 与整数常量比较无意义；该常量不在类型的范围之内
zh_hant: 與整數常數比較無意義; 此常數位於類型的範圍外
