Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_BadVisIndexerReturn
source: Inconsistent accessibility: indexer return type '{1}' is less accessible than indexer '{0}'
cs: Nekonzistentní dostupnost: Typ vrácené hodnoty indexeru {1} je méně dostupný než indexer {0}.
de: Inkonsistenter Zugriff: Indexer-Rückgabetyp "{1}" ist weniger zugreifbar als Indexer "{0}".
es: Incoherencia de accesibilidad: el tipo de valor devuelto de indizador '{1}' es menos accesible que el indizador '{0}'
fr: Accessibilité incohérente : le type de retour d'indexeur '{1}' est moins accessible que l'indexeur '{0}'
it: Accessibilità incoerente: il tipo di indicizzatore restituito '{1}' è meno accessibile dell'indicizzatore '{0}'
ja: アクセシビリティに一貫性がありません。インデクサーの戻り値の型 '{1}' のアクセシビリティはインデクサー '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 인덱서 반환 형식이 '{0}' 인덱서보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ zwracany indeksatora „{1}” jest mniej dostępny niż indeksator „{0}”
pt_br: Acessibilidade inconsistente: tipo de retorno do indexador "{1}" é menos acessível do que o indexador "{0}"
ru: Несогласованность по доступности: доступность индексатора возвращаемого типа "{1}" ниже доступности индексатора "{0}"
tr: Tutarsız erişilebilirlik: '{1}' dizin oluşturucusu dönüş türü, '{0}' dizin oluşturucusundan daha az erişilebilir
zh_hans: 可访问性不一致: 索引器返回类型“{1}”的可访问性低于索引器“{0}”
zh_hant: 不一致的存取範圍: 索引子傳回類型 '{1}' 比索引子 '{0}' 的存取範圍小

# ERR_BadVisIndexerParam
source: Inconsistent accessibility: parameter type '{1}' is less accessible than indexer or property '{0}'
it: Accessibilità incoerente: il tipo parametro '{1}' è meno accessibile dell'indicizzatore '{0}'
pt_br: Acessibilidade inconsistente: o tipo de parâmetro "{1}" é menos acessível do que o indexador ou a propriedade "{0}"
ru: Несогласованность по доступности: доступность типа параметра "{1}" ниже доступности индексатора "{0}"
zh_hans: 可访问性不一致: 参数类型“{1}”的可访问性低于索引器“{0}”

# ERR_BadVisOpReturn
source: Inconsistent accessibility: return type '{1}' is less accessible than operator '{0}'
cs: Nekonzistentní dostupnost: Typ vrácené hodnoty {1} je míň dostupný než operátor {0}.
de: Inkonsistenter Zugriff: Rückgabetyp "{1}" ist weniger zugreifbar als Operator "{0}".
es: Incoherencia de accesibilidad: el tipo de valor devuelto '{1}' es menos accesible que el operador '{0}'
fr: Accessibilité incohérente : le type de retour '{1}' est moins accessible que l'opérateur '{0}'
it: Accessibilità incoerente: il tipo restituito '{1}' è meno accessibile dell'operatore '{0}'
ja: アクセシビリティに一貫性がありません。戻り値の型 '{1}' のアクセシビリティは演算子 '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 반환 형식이 '{0}' 연산자보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ zwracany „{1}” jest mniej dostępny niż operator „{0}”
pt_br: Acessibilidade inconsistente: tipo de retorno "{1}" é menos acessível do que o operador "{0}"
ru: Несогласованность по доступности: доступность возвращаемого типа "{1}" ниже доступности оператора "{0}"
tr: Tutarsız erişilebilirlik: '{1}' dönüş türü, '{0}' işlecinden daha az erişilebilir
zh_hans: 可访问性不一致: 返回类型“{1}”的可访问性低于运算符“{0}”
zh_hant: 不一致的存取範圍: 傳回類型 '{1}' 比運算子 '{0}' 的存取範圍小

# ERR_BadVisOpParam
source: Inconsistent accessibility: parameter type '{1}' is less accessible than operator '{0}'
cs: Nekonzistentní dostupnost: Typ parametru {1} je míň dostupný než operátor {0}.
de: Inkonsistenter Zugriff: Parametertyp "{1}" ist weniger zugreifbar als Operator "{0}".
es: Incoherencia de accesibilidad: el tipo de parámetro '{1}' es menos accesible que el operador '{0}'
fr: Accessibilité incohérente : le type de paramètre '{1}' est moins accessible que l'opérateur '{0}'
it: Accessibilità incoerente: il tipo parametro '{1}' è meno accessibile dell'operatore '{0}'
ja: アクセシビリティに一貫性がありません。パラメーター型 '{1}' のアクセシビリティは演算子 '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 매개 변수 형식이 '{0}' 연산자보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ parametru „{1}” jest mniej dostępny niż operator „{0}”
pt_br: Acessibilidade inconsistente: tipo de parâmetro "{1}" é menos acessível do que o operador "{0}"
ru: Несогласованность по доступности: доступность типа параметра "{1}" ниже доступности оператора "{0}"
tr: Tutarsız erişilebilirlik: '{1}' parametre türü, '{0}' işlecinden daha az erişilebilir
zh_hans: 可访问性不一致: 参数类型“{1}”的可访问性低于运算符“{0}”
zh_hant: 不一致的存取範圍: 參數類型 '{1}' 比運算子 '{0}' 的存取範圍小

# ERR_BadVisDelegateReturn
source: Inconsistent accessibility: return type '{1}' is less accessible than delegate '{0}'
cs: Nekonzistentní dostupnost: Typ vrácené hodnoty {1} je míň dostupný než delegát {0}.
de: Inkonsistenter Zugriff: Rückgabetyp "{1}" ist weniger zugreifbar als Delegat "{0}".
es: Incoherencia de accesibilidad: el tipo de valor devuelto '{1}' es menos accesible que el delegado '{0}'
fr: Accessibilité incohérente : le type de retour '{1}' est moins accessible que le délégué '{0}'
it: Accessibilità incoerente: il tipo restituito '{1}' è meno accessibile del delegato '{0}'
ja: アクセシビリティに一貫性がありません。戻り値の型 '{1}' のアクセシビリティはデリゲート '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 반환 형식이 '{0}' 대리자보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ zwracany „{1}” jest mniej dostępny niż obiekt delegowany „{0}”
pt_br: Acessibilidade inconsistente: tipo de retorno "{1}" é menos acessível do que "{0}" delegado
ru: Несогласованность по доступности: доступность возвращаемого типа "{1}" ниже доступности делегата "{0}"
tr: Tutarsız erişilebilirlik: '{1}' dönüş türü '{0}' temsilcisinden daha az erişilebilir
zh_hans: 可访问性不一致: 返回类型“{1}”的可访问性低于委托“{0}”
zh_hant: 不一致的存取範圍: 傳回類型 '{1}' 比委派 '{0}' 的存取範圍小

# ERR_BadVisDelegateParam
source: Inconsistent accessibility: parameter type '{1}' is less accessible than delegate '{0}'
cs: Nekonzistentní dostupnost: Typ parametru {1} je míň dostupný než delegát {0}.
de: Inkonsistenter Zugriff: Parametertyp "{1}" ist weniger zugreifbar als Delegat "{0}".
es: Incoherencia de accesibilidad: el tipo de parámetro '{1}' es menos accesible que el delegado '{0}'
fr: Accessibilité incohérente : le type de paramètre '{1}' est moins accessible que le délégué '{0}'
it: Accessibilità incoerente: il tipo parametro '{1}' è meno accessibile del delegato '{0}'
ja: アクセシビリティに一貫性がありません。パラメーター型 '{1}' のアクセシビリティはデリゲート '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 매개 변수 형식이 '{0}' 대리자보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: typ parametru „{1}” jest mniej dostępny niż obiekt delegowany „{0}”
pt_br: Acessibilidade inconsistente: tipo de parâmetro "{1}" é menos acessível do que o delegado "{0}"
ru: Несогласованность по доступности: доступность типа параметра "{1}" ниже доступности делегата "{0}"
tr: Tutarsız erişilebilirlik: '{1}' parametre türü '{0}' temsilcisinden daha az erişilebilir
zh_hans: 可访问性不一致: 参数类型“{1}”的可访问性低于委托“{0}”
zh_hant: 不一致的存取範圍: 參數類型 '{1}' 比委派 '{0}' 的存取範圍小

# ERR_BadVisBaseClass
source: Inconsistent accessibility: base class '{1}' is less accessible than class '{0}'
cs: Nekonzistentní dostupnost: Základní třída {1} je míň dostupná než třída {0}.
de: Inkonsistenter Zugriff: Basisklasse "{1}" ist weniger zugreifbar als Klasse "{0}".
es: Incoherencia de accesibilidad: la clase base '{1}' es menos accesible que la clase '{0}'
fr: Accessibilité incohérente : la classe de base '{1}' est moins accessible que la classe '{0}'
it: Accessibilità incoerente: la classe base '{1}' è meno accessibile della classe '{0}'
ja: アクセシビリティに一貫性がありません。基底クラス '{1}' のアクセシビリティはクラス '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 기본 클래스가 '{0}' 클래스보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: klasa bazowa „{1}” jest mniej dostępna niż klasa „{0}”
pt_br: Acessibilidade inconsistente: classe base "{1}" é menos acessível do que a classe "{0}"
ru: Несогласованность по доступности: доступность базового класса "{1}" ниже доступности класса "{0}"
tr: Tutarsız erişilebilirlik: '{1}' temel sınıfı, '{0}' sınıfından daha az erişilebilir
zh_hans: 可访问性不一致: 基类“{1}”的可访问性低于类“{0}”
zh_hant: 不一致的存取範圍: 基底類別 '{1}' 比類別 '{0}' 的存取範圍小

# ERR_BadVisBaseInterface
source: Inconsistent accessibility: base interface '{1}' is less accessible than interface '{0}'
cs: Nekonzistentní dostupnost: Základní rozhraní {1} je míň dostupné než rozhraní {0}.
de: Inkonsistenter Zugriff: Basisschnittstelle "{1}" ist weniger zugreifbar als Schnittstelle "{0}".
es: Incoherencia de accesibilidad: la interfaz base '{1}' es menos accesible que la interfaz '{0}'
fr: Accessibilité incohérente : l'interface de base '{1}' est moins accessible que l'interface '{0}'
it: Accessibilità incoerente: l'interfaccia di base '{1}' è meno accessibile dell'interfaccia '{0}'
ja: アクセシビリティに一貫性がありません。基底インターフェイス '{1}' のアクセシビリティはインターフェイス '{0}' よりも低く設定されています
ko: 일관성 없는 액세스 가능성: '{1}' 기본 인터페이스가 '{0}' 인터페이스보다 액세스하기 어렵습니다.
pl: Niespójność dostępności: interfejs podstawowy „{1}” jest mniej dostępny niż interfejs „{0}”
pt_br: Acessibilidade inconsistente: interface base "{1}" é menos acessível do que interface "{0}"
ru: Несогласованность по доступности: доступность базового интерфейса "{1}" ниже доступности интерфейса "{0}"
tr: Tutarsız erişilebilirlik: '{1}' temel arabirimi, '{0}' arabiriminden daha az erişilebilir
zh_hans: 可访问性不一致: 基接口“{1}”的可访问性低于接口“{0}”
zh_hant: 不一致的存取範圍: 基底介面 '{1}' 比介面 '{0}' 的存取範圍小

# ERR_EventNeedsBothAccessors
source: '{0}': event property must have both add and remove accessors
cs: {0}: Vlastnost události musí obsahovat přistupující objekty add i remove.
de: '"{0}": Die Ereigniseigenschaft muss sowohl add- als auch remove-Accessoren besitzen.
es: '{0}': la propiedad del evento debe tener los descriptores de acceso add y remove
fr: '{0}' : la propriété event doit avoir des accesseurs add et remove
it: '{0}': la proprietà dell'evento deve avere entrambe le funzioni di accesso add e remove
ja: '{0}': イベント プロパティには、add および remove アクセサーの両方を指定する必要があります
ko: '{0}': 이벤트 속성에는 add 및 remove 접근자가 둘 다 있어야 합니다.
pl: '{0}': dla właściwości zdarzenia muszą istnieć metody dostępu Add i Remove
pt_br: "{0}": propriedade de evento deve ter acessadores adicionar e remover
ru: "{0}": свойство события должно иметь методы доступа для добавления и удаления.
tr: '{0}': olay özelliğinin hem ekleme hem de kaldırma erişimcileri olmalıdır
zh_hans: “{0}”: 事件属性必须同时具有 add 和 remove 访问器
zh_hant: '{0}': 事件屬性必須同時要有 add 和 remove 存取子

# ERR_EventNotDelegate
source: '{0}': event must be of a delegate type
cs: {0}: Událost musí být typu delegát.
de: '"{0}": Das Ereignis muss einen Delegattyp aufweisen.
es: '{0}': el evento debe ser de tipo delegado
fr: '{0}' : l'événement doit être de type délégué
it: '{0}': l'evento deve essere di un tipo delegato
ja: '{0}': イベントはデリゲート型である必要があります
ko: '{0}': 이벤트는 대리자 형식이어야 합니다.
pl: „{0}”: typ zdarzenia musi być zgodny z typem delegowanym
pt_br: "{0}": evento deve ser de um tipo delegado
ru: "{0}": событие должно иметь тип делегата.
tr: '{0}': olay bir temsilci türüne sahip olmalıdır
zh_hans: “{0}”: 事件必须是委托类型的
zh_hant: '{0}': 事件必須為委派類型

# WRN_UnreferencedEvent
source: The event '{0}' is never used
cs: Událost {0} se nikdy nepoužívá.
de: Das Ereignis "{0}" wird nie verwendet.
es: El evento '{0}' nunca se usa
fr: L'événement '{0}' n'est jamais utilisé
it: L'evento '{0}' non viene mai usato
ja: イベント '{0}' は使用されていません
ko: {0}' 이벤트가 사용되지 않았습니다.
pl: Zdarzenie „{0}” nie jest nigdy używane
pt_br: O evento "{0}" nunca é usado
ru: Событие "{0}" никогда не используется.
tr: {0}' olayı hiçbir zaman kullanılmaz
zh_hans: 从不使用事件“{0}”
zh_hant: 事件 '{0}' 從未使用過

# WRN_UnreferencedEvent_Title
source: Event is never used
cs: Událost se nikdy nepoužívá.
de: Ereignis wird niemals benutzt
es: Nunca se usa el evento
fr: L'événement n'est jamais utilisé
it: L'evento non viene mai usato
ja: イベントは使用されていません
ko: 이벤트가 사용되지 않습니다.
pl: Zdarzenie nie jest nigdy używane
pt_br: O evento nunca é usado
ru: Событие не используется
tr: Olay hiç kullanılmadı
zh_hans: 事件从未使用过
zh_hant: 從未使用過事件

# ERR_InterfaceEventInitializer
source: '{0}': instance event in interface cannot have initializer
cs: {0}: Událost instance v rozhraní nemůže mít inicializátor.
de: {0}: Ein Instanzereignis in einer Schnittstelle kann keinen Initialisierer aufweisen.
es: "{0}": el evento de instancia en la interfaz no puede tener un inicializador
fr: '{0}' : l'événement d'instance présent dans l'interface ne peut pas avoir d'initialiseur
it: '{0}': l'evento di istanza nell'interfaccia non può avere inizializzatori
ja: '{0}': インターフェイスのインスタンス イベントは初期化子を持つことができません
ko: '{0}': 인터페이스의 인스턴스 이벤트에는 이니셜라이저를 사용할 수 없습니다.
pl: „{0}”: zdarzenie wystąpienia w interfejsie nie może mieć inicjatora
pt_br: '{0}': o evento de instância na interface não pode ter um inicializador
ru: "{0}": событие экземпляра в интерфейсе не может иметь инициализатор.
tr: '{0}': arabirimdeki örnek olayın başlatıcısı olamaz
zh_hans: “{0}”: 接口中的实例事件不能有初始值设定项
zh_hant: '{0}': 介面中的執行個體事件不可有初始設定式

# ERR_BadEventUsage
source: The event '{0}' can only appear on the left hand side of += or -= (except when used from within the type '{1}')
cs: Událost {0} se může zobrazovat jenom na levé straně výrazu += nebo -= (s výjimkou případu, kdy se používá z typu {1}).
de: Das {0}-Ereignis kann nur links von += oder -= stehen (es sei denn, es wird innerhalb des Typs "{1}" verwendet).
es: El evento '{0}' solo puede aparecer a la izquierda de += o -= (excepto cuando se usa desde dentro del tipo '{1}')
fr: L'événement '{0}' ne peut apparaître qu'à gauche de += ou -= (sauf quand il est utilisé à partir du type '{1}')
it: L'evento '{0}' può essere specificato solo sul lato sinistro di += o di -= (tranne quando è usato dall'interno del tipo '{1}')
ja: イベント '{0}' は、+= または -= の左側にのみ表示されます (型 '{1}' 内で使用する場合を除きます)
ko: {0}' 이벤트는 += 또는 -=의 왼쪽에만 사용할 수 있습니다. 단 이 이벤트가 '{1}' 형식에서 사용될 때에는 예외입니다.
pl: Zdarzenie „{0}” może występować tylko po lewej stronie symboli += lub -= (z wyjątkiem sytuacji, w której używane jest z wnętrza typu „{1}”)
pt_br: O evento "{0}" pode apenas aparecer à esquerda de + = ou -= (exceto quando usado de dentro do tipo "{1}")
ru: Событие "{0}" может присутствовать только в левой части операций += и -= (кроме случая использования в типе "{1}").
tr: {0}' olayı += veya -= işaretlerinin yalnızca sol tarafında görünebilir ('{1}' türü içinden kullanılması durumu dışında)
zh_hans: 事件“{0}”只能出现在 += 或 -= 的左边(从类型“{1}”中使用时除外)
zh_hant: 事件 '{0}' 只可出現在 += 或 -= 的左側 (除非從類型 '{1}' 中使用)

# ERR_ExplicitEventFieldImpl
source: An explicit interface implementation of an event must use event accessor syntax
cs: Explicitní implementace rozhraní události musí používat syntaxi přistupujícího objektu události.
de: Für die explizite Schnittstellenimplementierung eines Ereignisses muss die Syntax für Ereignisaccessoren verwendet werden.
es: Una implementación de interfaz explícita de un evento debe usar la sintaxis de descriptor de acceso de eventos
fr: Une implémentation d'interface explicite d'un événement doit utiliser la syntaxe des accesseurs d'événement
it: Per l'implementazione esplicita dell'interfaccia di un evento è necessario utilizzare la sintassi della funzione di accesso agli eventi
ja: イベントのインターフェイスを明示的に実装するには、イベント アクセサーの構文を使用する必要があります
ko: 이벤트의 명시적 인터페이스를 구현할 때에는 이벤트 접근자 구문을 사용해야 합니다.
pl: Jawna implementacja interfejsu zdarzenia musi używać składni metody dostępu zdarzenia
pt_br: Uma implementação de interface explícita de um evento deve usar a sintaxe de acessador do evento
ru: Явная реализация интерфейса события должна использовать синтаксис метода доступа к событиям.
tr: Bir olayın açık bir arabirim uygulamasında olay erişimcisi sözdizimi kullanılmalıdır
zh_hans: 事件的显式接口实现必须使用事件访问器语法
zh_hant: 事件的明確介面實作必須使用存取子語法

# ERR_CantOverrideNonEvent
source: '{0}': cannot override; '{1}' is not an event
cs: {0}: Nejde přepsat; {1} není událost.
de: '"{0}": Überschreiben nicht möglich; "{1}" ist kein Ereignis.
es: '{0}': no se puede invalidar; '{1}' no es un evento
fr: '{0}' : substitution impossible ; '{1}' n'est pas un événement
it: '{0}': non è possibile eseguire l'override. '{1}' non è un evento
ja: '{0}': '{1}' はイベントではないためオーバーライドできません
ko: '{0}': 재정의할 수 없습니다. '{1}'은(는) 이벤트가 아닙니다.
pl: „{0}”: nie można przesłonić. Element „{1}” nie jest zdarzeniem
pt_br: "{0}": não é possível substituir; "{1}" não é um evento
ru: "{0}": невозможно переопределить, так как "{1}" не является событием.
tr: '{0}': geçersiz kılınamıyor; '{1}' bir olay değil
zh_hans: “{0}”: 无法重写；“{1}”不是事件
zh_hant: '{0}': 無法覆寫; '{1}' 不是事件

# ERR_AddRemoveMustHaveBody
source: An add or remove accessor must have a body
cs: Přistupující objekty add a remove musí mít tělo.
de: Ein add- oder remove-Accessor muss Text enthalten.
es: Un descriptor de acceso add o remove debe tener un cuerpo
fr: Un accesseur add ou remove doit avoir un corps
it: Una funzione di accesso add o remove deve avere un corpo
ja: add または remove アクセサーには本体が必要です
ko: add 또는 remove 접근자에는 본문이 있어야 합니다.
pl: Metoda dostępu add lub remove musi mieć treść
pt_br: Um acessador add ou remove deve ter corpo
ru: Методы доступа add и remove должны иметь тело.
tr: Ekleme veya kaldırma erişimcisinin gövdesi olmalı
zh_hans: add 访问器或 remove 访问器必须有一个主体
zh_hant: add 或 remove 存取子必須具有主體

# ERR_AbstractEventInitializer
source: '{0}': abstract event cannot have initializer
cs: {0}: Abstraktní událost nemůže mít inicializátor.
de: '"{0}": Das abstrakte Ereignis kann keinen Initialisierer aufweisen.
es: '{0}': un evento abstracto no puede tener inicializador
fr: '{0}' : un événement abstrait ne peut pas avoir d'initialiseur
it: '{0}': l'evento astratto non può avere inizializzatori
ja: '{0}': 抽象イベントは初期化子を持つことができません
ko: '{0}': 추상 이벤트에는 이니셜라이저를 사용할 수 없습니다.
pl: „{0}”: nie może istnieć inicjator zdarzenia abstrakcyjnego
pt_br: "{0}": evento abstract não pode ter inicializador
ru: "{0}": абстрактное событие не может иметь инициализатор.
tr: '{0}': soyut etkinliğin başlatıcısı olamaz
zh_hans: “{0}”: 抽象事件不能有初始值设定项
zh_hant: '{0}': 抽象事件不可有初始設定式

# ERR_ReservedAssemblyName
source: The assembly name '{0}' is reserved and cannot be used as a reference in an interactive session
cs: Název sestavení {0} je rezervovaný a nedá se použít jako odkaz v interaktivní relaci.
de: Der Assemblyname "{0}" ist reserviert und kann nicht als Verweis in einer interaktiven Sitzung verwendet werden.
es: El nombre de ensamblado '{0}' está reservado y no se puede usar como referencia en una sesión interactiva
fr: Le nom d'assembly '{0}' est réservé et ne peut pas servir de référence dans une session interactive
it: Il nome di assembly '{0}' è riservato e non può essere usato come riferimento in una sessione interattiva
ja: アセンブリ名 '{0}' は予約されており、対話形式のセッションで参照として使用することはできません
ko: {0}' 어셈블리 이름은 예약된 것이므로 대화형 세션에 참조로 사용할 수 없습니다.
pl: Nazwa zestawu „{0}” jest zarezerwowana i nie można jej użyć jako odwołania w sesji interaktywnej
pt_br: O nome do assembly "{0}" é reservado e não pode ser usado como uma referência em uma sessão interativa
ru: Имя сборки "{0}" зарезервировано и не может использоваться как ссылка в интерактивном сеансе.
tr: {0}' derleme adı ayrıldı ve etkileşimli bir oturumda başvuru olarak kullanılamıyor
zh_hans: 程序集名“{0}”保留名称，不能在交互会话中用作引用
zh_hant: 組件名稱 '{0}' 已保留，不可用做為互動工作階段中的參考

# ERR_ReservedEnumerator
source: The enumerator name '{0}' is reserved and cannot be used
cs: Název čítače výčtu {0} je rezervovaný a nedá se použít.
de: Der Enumeratorname "{0}" ist reserviert und kann nicht verwendet werden.
es: El nombre de enumerador '{0}' está reservado y no se puede usar
fr: Le nom d'énumérateur '{0}' est réservé et ne peut pas être utilisé
it: Il nome dell'enumeratore '{0}' è riservato e non può essere usato
ja: 列挙子名 '{0}' は予約されているため、使用できません
ko: {0}' 열거자 이름은 예약된 것이므로 사용할 수 없습니다.
pl: Nazwa typu wyliczeniowego „{0}” jest zarezerwowana i nie można jej użyć
pt_br: O nome de enumerador "{0}" é reservado e não pode ser usado
ru: Имя перечислителя "{0}" зарезервировано и не может использоваться.
tr: {0}' numaralandırıcı adı ayrıldı ve kullanılamıyor
zh_hans: 枚举器名“{0}”是保留名称，不能使用
zh_hant: 列舉程式名稱 '{0}' 已保留，且無法使用

# ERR_AsMustHaveReferenceType
source: The as operator must be used with a reference type or nullable type ('{0}' is a non-nullable value type)
cs: Operátor as je třeba použít s typem odkazu nebo s typem připouštějícím hodnotu null ({0} je typ hodnoty, který nepřipouští hodnotu null).
de: Der as-Operator muss mit einem Referenztyp oder einem Non-Nullable-Typ verwendet werden ("{0}" ist ein Non-Nullable-Werttyp).
es: El operador as se debe usar con un tipo de referencia o un tipo que acepte valores NULL ('{0}' es un tipo de valor que no acepta valores NULL)
fr: L'opérateur as doit être utilisé avec un type référence ou un type nullable ('{0}' est un type valeur non-nullable)
it: L'operatore as deve essere usato con un tipo riferimento o con un tipo che ammette i valori Null ('{0}' è un tipo valore che non ammette i valori Null)
ja: as 演算子は参照型または null 許容型で使用してください ('{0}' は null 非許容の値型です)
ko: as 연산자는 참조 형식 또는 null 허용 형식과 함께 사용해야 합니다. '{0}'은(는) null을 허용하지 않는 값 형식입니다.
pl: Operatora „as” należy używać z typem referencyjnym lub typem nullowalnym („{0}” jest typem nienullowalnym)
pt_br: O operador as deve ser usado com um tipo de referência ou um tipo que permite valor nulo ("{0}" é um tipo de valor que não permite valor nulo)
ru: Оператор as должен использоваться со ссылочным типом или с типом, допускающим значение Null (тип "{0}" не допускает значение Null).
tr: As işleci bir başvuru türüyle veya null olabilen bir türle birlikte kullanılmalıdır ('{0}', null olamayan bir değer türüdür)
zh_hans: as 运算符必须与引用类型或可以为 null 的类型一起使用(“{0}”是不可为 null 值的类型)
zh_hant: as 運算子必須搭配參考類型或可為 Null 的類型一起使用 ('{0}' 是不可為 Null 的實值類型)

# WRN_LowercaseEllSuffix
source: The 'l' suffix is easily confused with the digit '1' -- use 'L' for clarity
cs: Přípona l je snadno zaměnitelná s číslicí 1. V zájmu větší srozumitelnosti použijte písmeno L.
de: Das l-Suffix kann leicht mit der Zahl 1 verwechselt werden. Verwenden Sie zur deutlichen Unterscheidung das L.
es: El sufijo 'l' se confunde fácilmente con el dígito '1': utilice 'L' para mayor claridad
fr: Le suffixe 'l' risque d'être facilement confondu avec le chiffre '1' -- utilisez plutôt 'L'
it: Il suffisso 'l' è facilmente confondibile con il numero '1': per maggiore chiarezza utilizzare 'L'
ja: l' と 数字の '1' との混同を避けるため、'L' を使用してください
ko: 접미사 'l'은 숫자 '1'과 쉽게 혼동됩니다. 쉽게 구별할 수 있도록 'L'을 사용하세요.
pl: Sufiks „l” z łatwością można pomylić z cyfrą „1” — w celu zachowania jednoznaczności użyj sufiksu „L”
pt_br: O sufixo 'l' é facilmente confundido com o dígito '1' -- use 'L' para diferenciar
ru: Суффикс "l" легко спутать с цифрой "1" -- для ясности используйте "L"
tr: l' soneki '1' sayısıyla kolaylıkla karıştırılır; kolay anlaşılması için 'L' kullanın
zh_hans: “l”后缀容易与数字“1”混淆；为清楚起见，请使用“L”
zh_hant: 字尾 'l' 很容易與數字 '1' 混淆 -- 請使用 'L' 以避免困擾

# WRN_LowercaseEllSuffix_Title
source: The 'l' suffix is easily confused with the digit '1'
cs: Přípona l je snadno zaměnitelná s číslicí 1.
de: Das Suffix 'l' kann leicht mit der Ziffer '1' verwechselt werden
es: El sufijo "l" se confunde fácilmente con el número "1"
fr: Le suffixe 'l' risque d'être facilement confondu avec le chiffre '1'
it: Il suffisso 'l' è facilmente confondibile con il numero '1'
ja: l' という接尾辞は、数字の '1' と混同されることがあります
ko: 접미사 'l'은 숫자 '1'과 쉽게 혼동됩니다.
pl: Sufiks „l” można łatwo pomylić z cyfrą „1”
pt_br: O sufixo 'l'é facilmente confundido com o dígito '1'
ru: Суффикс l легко спутать с цифрой 1
tr: l' son eki '1' basamağı ile kolaylıkla karıştırılır
zh_hans: "l" 后缀容易与数字 "1" 混淆
zh_hant: 字尾 'l' 很容易與數字 '1' 混淆
