Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_NullabilityMismatchInParameterTypeOnPartial_Title
source: Nullability of reference types in type of parameter doesn't match partial method declaration.
cs: Typ odkazu s možnou hodnotou null v typu parametru neodpovídá deklaraci částečné metody.
de: Die NULL-Zulässigkeit von Verweistypen im Typ des Parameters entspricht nicht der Deklaration der partiellen Methode.
es: La nulabilidad de los tipos de referencia del tipo de parámetro no coincide con la declaración de método parcial
fr: La nullabilité des types référence dans le type de paramètre ne correspond pas à la déclaration de méthode partielle.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di parametro non corrisponde alla dichiarazione di metodo parziale.
ja: パラメーターの型における参照型の Null 許容性が、部分メソッド宣言と一致しません。
ko: 매개 변수 형식에 있는 참조 형식 Null 허용 여부가 부분 메서드(Partial Method) 선언과 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie parametru jest niezgodna z częściową deklaracją metody.
pt_br: A anulabilidade de tipos de referência em tipo de parâmetro não corresponde à declaração de método parcial.
ru: Допустимость значения NULL для ссылочных типов в типе параметра не совпадает с частичным объявлением метода.
tr: Parametre türündeki başvuru türlerinin boş değer atanabilirliği kısmi metot bildirimi ile eşleşmiyor.
zh_hans: 参数类型中引用类型的为 Null 性与分部方法声明不匹配。
zh_hant: 參數型別中參考型別的可 Null 性與部分方法宣告不符合。

# WRN_NullabilityMismatchInReturnTypeOfTargetDelegate
source: Nullability of reference types in return type of '{0}' doesn't match the target delegate '{1}' (possibly because of nullability attributes).
cs: Typy odkazů s možnou hodnotou null v návratovém typu {0} neodpovídají cílovému delegátu {1} (pravděpodobně kvůli atributům možnosti použití hodnoty null).
fr: La nullabilité des types référence dans le type de retour de '{0}' ne correspond pas au délégué cible '{1}' (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito di '{0}' non corrisponde al delegato di destinazione '{1}', probabilmente a causa degli attributi del supporto dei valori Null.
ja: '{0}' の戻り値の型における参照型の NULL 値の許容が、ターゲット デリゲート '{1}' と一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w zwracanym typie „{0}” nie jest zgodne z docelowym delegatem „{1}” (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno de '{0}' não corresponde ao delegado de destino '{1}' (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения "{0}" не соответствует целевому объекту делегирования "{1}" (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: “{0}”的返回类型中引用类型的为 Null 性与目标委托“{1}”不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別 '{0}' 中參考型別是否可為 Null 的情況，與目標委派 '{1}' 不相符 (可能的原因是屬性可為 Null)。

# WRN_NullabilityMismatchInReturnTypeOfTargetDelegate_Title
source: Nullability of reference types in return type doesn't match the target delegate (possibly because of nullability attributes).
cs: Typy odkazů s možnou hodnotou null v návratovém typu neodpovídají cílovému delegátu (pravděpodobně kvůli atributům možnosti použití hodnoty null)
fr: La nullabilité des types référence dans le type de retour ne correspond pas au délégué cible (probablement en raison des attributs de nullabilité).
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al delegato di destinazione, probabilmente a causa degli attributi del supporto dei valori Null.
ja: 戻り値の型における参照型の NULL 値の許容が、ターゲット デリゲートと一致しません。おそらく、NULL 値の許容の属性が原因です。
pl: Dopuszczanie wartości null dla typów referencyjnych w zwracanym typie nie jest zgodne z docelowym delegatem (prawdopodobnie z powodu atrybutów dopuszczania wartości null).
pt_br: A nulidade de tipos de referência no tipo de retorno não corresponde ao delegado de destino (possivelmente devido a atributos de nulidade).
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения не соответствует целевому объекту делегирования (возможно, из-за атрибутов допустимости значений NULL).
zh_hans: 返回类型中引用类型的为 Null 性与目标委托不匹配(可能是由于为 Null 性特性)。
zh_hant: 傳回型別中參考型別是否可為 Null 的情況，與目標委派不相符 (可能的原因是屬性可為 Null)。

# WRN_NullabilityMismatchInReturnTypeOnExplicitImplementation
source: Nullability of reference types in return type doesn't match implemented member '{0}'.
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá implementovanému členu {0}.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem implementierten Member "{0}".
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el miembro implementado "{0}".
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté '{0}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato '{0}'.
ja: 戻り値の型における参照型の Null 許容性が、実装されるメンバー '{0}' と一致しません。
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버 '{0}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym jest niezgodna z implementowaną składową „{0}”.
pt_br: A anulabilidade de tipos de referência em tipo de retorno não corresponde ao membro implementado '{0}'.
ru: Допустимость значения NULL для ссылочных типов в возвращаемом типе не совпадает с реализованным членом "{0}".
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği, uygulanan '{0}' üyesi ile eşleşmiyor.
zh_hans: 返回类型中引用类型的为 Null 性与实现的成员“{0}”不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與實作的成員 '{0}' 不符合。

# WRN_NullabilityMismatchInReturnTypeOnExplicitImplementation_Title
source: Nullability of reference types in return type doesn't match implemented member.
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem implementierten Member.
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el miembro implementado
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato.
ja: 戻り値の型における参照型の Null 許容性が、実装されるメンバーと一致しません。
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym jest niezgodna z implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo de retorno não corresponde ao membro implementado.
ru: Допустимость значения NULL для ссылочных типов в возвращаемом типе не совпадает с реализованным членом.
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği, uygulanan üye ile eşleşmiyor.
zh_hans: 返回类型中引用类型的为 Null 性与实现的成员不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與實作的成員不符合。

# WRN_NullabilityMismatchInReturnTypeOnImplicitImplementation
source: Nullability of reference types in return type of '{0}' doesn't match implicitly implemented member '{1}'.
cs: Typ odkazu s možnou hodnotou null v návratovém typu {0} neodpovídá implicitně implementovanému členu {1}.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp von "{0}" entspricht nicht dem implizit implementierten Member "{1}".
es: La nulabilidad de los tipos de referencia del tipo de valor devuelto de "{0}" no coincide con el miembro "{1}" implementado de forma implícita.
fr: La nullabilité des types référence dans le type de retour de '{0}' ne correspond pas au membre implémenté implicitement '{1}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito di '{0}' non corrisponde al membro implementato in modo implicito '{1}'.
ja: '{0}' の戻り値の型における参照型の Null 許容性が、暗黙的に実装されるメンバー '{1}' と一致しません。
ko: '{0}' 반환 형식에 있는 참조 형식의 Null 허용 여부가 암시적으로 구현된 멤버 '{1}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym „{0}” jest niezgodna z niejawnie implementowaną składową „{1}”.
pt_br: A nulidade de tipos de referência no tipo de retorno de '{0}' não corresponde ao membro implicitamente implementado '{1}'.
ru: Допустимость значений NULL для ссылочных типов в типе возвращаемого значения объекта "{0}" не совпадает с явно реализованным членом "{1}".
tr: '{0}' dönüş türündeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan '{1}' üyesi ile eşleşmiyor.
zh_hans: “{0}”的返回类型中引用类型的为 Null 性与隐式实现的成员“{1}”不匹配。
zh_hant: 傳回型別 '{0}' 中參考型別的可 Null 性與隱含實作的成員 '{1}' 不符合。

# WRN_NullabilityMismatchInReturnTypeOnImplicitImplementation_Title
source: Nullability of reference types in return type doesn't match implicitly implemented member.
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá implicitně implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem implizit implementierten Member.
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el miembro implementado de forma implícita
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre implémenté implicitement.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro implementato in modo implicito.
ja: 戻り値の型における参照型の Null 許容性が、暗黙的に実装されるメンバーと一致しません。
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 암시적으로 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym jest niezgodna z niejawnie implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo de retorno não corresponde ao membro implicitamente implementado.
ru: Допустимость значения NULL для ссылочных типов в возвращаемом типе не совпадает с явно реализованным членом.
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan üye ile eşleşmiyor.
zh_hans: 返回类型中引用类型的为 Null 性与隐式实现的成员不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與隱含實作的成員不符合。

# WRN_NullabilityMismatchInReturnTypeOnOverride
source: Nullability of reference types in return type doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el miembro reemplazado.
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro di cui è stato eseguito l'override.
ja: 戻り値の型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo de retorno não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в возвращаемом типе не совпадает с переопределенным членом.
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 返回类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與覆寫的成員不符合。

# WRN_NullabilityMismatchInReturnTypeOnOverride_Title
source: Nullability of reference types in return type doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null ve vráceném typu neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Rückgabetyp entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia en el tipo de valor devuelto no coincide con el miembro reemplazado
fr: La nullabilité des types référence dans le type de retour ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde al membro di cui è stato eseguito l'override.
ja: 戻り値の型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: 반환 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie zwracanym jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo de retorno não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в возвращаемом типе не совпадает с переопределенным членом.
tr: Dönüş türündeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 返回类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與覆寫的成員不符合。

# WRN_NullabilityMismatchInReturnTypeOnPartial
source: Nullability of reference types in return type doesn't match partial method declaration.
cs: Typ odkazu s možnou hodnotou null v návratovém typu neodpovídá deklaraci částečné metody.
fr: La nullabilité des types référence dans le type de retour ne correspond pas à la déclaration de méthode partielle.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde alla dichiarazione di metodo parziale.
ja: 戻り値の型における参照型の Null 値の許容が、部分メソッド宣言と一致しません。
pl: Nullowalność typów referencyjnych w zwracanym typie jest niezgodna z częściową deklaracją metody.
pt_br: A nulidade dos tipos de referência no tipo de retorno não corresponde à declaração de método parcial.
ru: Допустимость значения NULL для ссылочных типов в типе возвращаемого значения не совпадает с объявлением разделяемого метода.
zh_hans: 返回类型中引用类型的为 Null 性与分部方法声明不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與部分方法宣告不符。

# WRN_NullabilityMismatchInReturnTypeOnPartial_Title
source: Nullability of reference types in return type doesn't match partial method declaration.
cs: Typ odkazu s možnou hodnotou null v návratovém typu neodpovídá deklaraci částečné metody
fr: La nullabilité des types référence dans le type de retour ne correspond pas à la déclaration de méthode partielle.
it: Il supporto dei valori Null dei tipi riferimento nel tipo restituito non corrisponde alla dichiarazione di metodo parziale.
ja: 戻り値の型における参照型の Null 値の許容が、部分メソッド宣言と一致しません。
pl: Nullowalność typów referencyjnych w zwracanym typie jest niezgodna z częściową deklaracją metody.
pt_br: A nulidade dos tipos de referência no tipo de retorno não corresponde à declaração de método parcial.
ru: Допустимость значения NULL для ссылочных типов в типе возвращаемого значения не совпадает с объявлением разделяемого метода.
zh_hans: 返回类型中引用类型的为 Null 性与分部方法声明不匹配。
zh_hant: 傳回型別中參考型別的可 Null 性與部分方法宣告不符。

# WRN_NullabilityMismatchInTypeOnExplicitImplementation
source: Nullability of reference types in type doesn't match implemented member '{0}'.
cs: Typ odkazu s možnou hodnotou null v typu neodpovídá implementovanému členu {0}.
de: Die NULL-Zulässigkeit von Verweistypen im Typ entspricht nicht dem implementierten Member "{0}".
es: La nulabilidad de los tipos de referencia del tipo no coincide con el miembro implementado "{0}".
fr: La nullabilité des types référence dans le type ne correspond pas au membre implémenté '{0}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo non corrisponde al membro implementato '{0}'.
ja: 型における参照型の Null 許容性が、実装されるメンバー '{0}' と一致しません。
ko: 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버 '{0}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie jest niezgodna z implementowaną składową „{0}”.
pt_br: A anulabilidade de tipos de referência em tipo não corresponde ao membro implementado '{0}'.
ru: Допустимость значения NULL для ссылочных типов в типе не совпадает с реализованным членом "{0}".
tr: Türdeki başvuru türlerinin boş değer atanabilirliği, uygulanan '{0}' üyesi ile eşleşmiyor.
zh_hans: 类型中引用类型的为 Null 性与实现的成员“{0}”不匹配。
zh_hant: 型別中參考型別的可 Null 性與實作的成員 '{0}' 不符合。

# WRN_NullabilityMismatchInTypeOnExplicitImplementation_Title
source: Nullability of reference types in type doesn't match implemented member.
cs: Typ odkazu s možnou hodnotou null v typu neodpovídá implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ entspricht nicht dem implementierten Member.
es: La nulabilidad de los tipos de referencia del tipo no coincide con el miembro implementado
fr: La nullabilité des types référence dans le type ne correspond pas au membre implémenté.
it: Il supporto dei valori Null dei tipi riferimento nel tipo non corrisponde al membro implementato.
ja: 型における参照型の Null 許容性が、実装されるメンバーと一致しません。
ko: 형식에 있는 참조 형식 Null 허용 여부가 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie jest niezgodna z implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo não corresponde ao membro implementado.
ru: Допустимость значения NULL для ссылочных типов в типе не совпадает с реализованным членом.
tr: Türdeki başvuru türlerinin boş değer atanabilirliği, uygulanan üye ile eşleşmiyor.
zh_hans: 类型中引用类型的为 Null 性与实现的成员不匹配。
zh_hant: 型別中參考型別的可 Null 性與實作的成員不符合。

# WRN_NullabilityMismatchInTypeOnImplicitImplementation
source: Nullability of reference types in type of '{0}' doesn't match implicitly implemented member '{1}'.
cs: Typ odkazu s možnou hodnotou null v typu {0} neodpovídá implicitně implementovanému členu {1}.
de: Die NULL-Zulässigkeit von Verweistypen im Typ "{0}" entspricht nicht dem implizit implementierten Member "{1}".
es: La nulabilidad de los tipos de referencia del tipo de "{0}" no coincide con el miembro "{1}" implementado de forma implícita.
fr: La nullabilité des types référence dans le type de '{0}' ne correspond pas au membre implémenté implicitement '{1}'.
it: Il supporto dei valori Null dei tipi riferimento nel tipo di '{0}' non corrisponde al membro implementato in modo implicito '{1}'.
ja: '{0}' の型における参照型の Null 許容性が、暗黙的に実装されるメンバー '{1}' と一致しません。
ko: '{0}' 형식에 있는 참조 형식의 Null 허용 여부가 암시적으로 구현된 멤버 '{1}'과(와) 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie „{0}” jest niezgodna z niejawnie implementowaną składową „{1}”.
pt_br: A nulidade de tipos de referência no tipo de '{0}' não corresponde ao membro implicitamente implementado '{1}'.
ru: Допустимость значений NULL для ссылочных типов в типе объекта "{0}" не совпадает с явно реализованным членом "{1}".
tr: '{0}' türündeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan '{1}' üyesi ile eşleşmiyor.
zh_hans: “{0}”的类型中引用类型的为 Null 性与隐式实现的成员“{1}”不匹配。
zh_hant: '{0}' 的型別中參考型別的可 Null 性與隱含實作的成員 '{1}' 不符合。

# WRN_NullabilityMismatchInTypeOnImplicitImplementation_Title
source: Nullability of reference types in type doesn't match implicitly implemented member.
cs: Typ odkazu s možnou hodnotou null v typu neodpovídá implicitně implementovanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ entspricht nicht dem implizit implementierten Member.
es: La nulabilidad de los tipos de referencia del tipo no coincide con el miembro implementado de forma implícita
fr: La nullabilité des types référence dans le type ne correspond pas au membre implémenté implicitement.
it: Il supporto dei valori Null dei tipi riferimento nel tipo non corrisponde al membro implementato in modo implicito.
ja: 型における参照型の Null 許容性が、暗黙的に実装されるメンバーと一致しません。
ko: 형식에 있는 참조 형식 Null 허용 여부가 암시적으로 구현된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie jest niezgodna z niejawnie implementowaną składową.
pt_br: A anulabilidade de tipos de referência em tipo não corresponde ao membro implicitamente implementado.
ru: Допустимость значения NULL для ссылочных типов в типе не совпадает с явно реализованным членом.
tr: Türdeki başvuru türlerinin boş değer atanabilirliği, örtük olarak uygulanan üye ile eşleşmiyor.
zh_hans: 类型中引用类型的为 Null 性与隐式实现的成员不匹配。
zh_hant: 型別中參考型別的可 Null 性與隱含實作的成員不符合。

# WRN_NullabilityMismatchInTypeOnOverride
source: Nullability of reference types in type doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null v typu neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia del tipo no coincide con el miembro reemplazado.
fr: La nullabilité des types référence dans le type ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo non corrisponde al membro di cui è stato eseguito l'override.
ja: 型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в типе не совпадает с переопределенным членом.
tr: Türdeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 型別中參考型別的可 Null 性與覆寫的成員不符合。

# WRN_NullabilityMismatchInTypeOnOverride_Title
source: Nullability of reference types in type doesn't match overridden member.
cs: Typ odkazu s možnou hodnotou null v typu neodpovídá přepsanému členu.
de: Die NULL-Zulässigkeit von Verweistypen im Typ entspricht nicht dem außer Kraft gesetzten Member.
es: La nulabilidad de los tipos de referencia del tipo no coincide con el miembro reemplazado
fr: La nullabilité des types référence dans le type ne correspond pas au membre substitué.
it: Il supporto dei valori Null dei tipi riferimento nel tipo non corrisponde al membro di cui è stato eseguito l'override.
ja: 型における参照型の Null 許容性が、オーバーライドされるメンバーと一致しません。
ko: 형식에 있는 참조 형식 Null 허용 여부가 재정의된 멤버와 일치하지 않습니다.
pl: Obsługa wartości null dla typów referencyjnych w typie jest niezgodna z przesłoniętą składową.
pt_br: A anulabilidade de tipos de referência em tipo não corresponde ao membro substituído.
ru: Допустимость значения NULL для ссылочных типов в типе не совпадает с переопределенным членом.
tr: Türdeki başvuru türlerinin boş değer atanabilirliği, geçersiz kılınan üye ile eşleşmiyor.
zh_hans: 类型中引用类型的为 Null 性与重写成员不匹配。
zh_hant: 型別中參考型別的可 Null 性與覆寫的成員不符合。
