Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ERR_NoImplicitConvCast
source: Cannot implicitly convert type '{0}' to '{1}'. An explicit conversion exists (are you missing a cast?)
cs: Typ {0} nejde implicitně převést na typ {1}. Existuje explicitní převod. (Nechybí výraz přetypování?)
de: Der Typ "{0}" kann nicht implizit in "{1}" konvertiert werden. Es ist bereits eine explizite Konvertierung vorhanden (möglicherweise fehlt eine Umwandlung).
es: No se puede convertir implícitamente el tipo '{0}' en '{1}'. Ya existe una conversión explícita (compruebe si le falta una conversión)
fr: Impossible de convertir implicitement le type '{0}' en '{1}'. Une conversion explicite existe (un cast est-il manquant ?)
it: Non è possibile convertire in modo implicito il tipo '{0}' in '{1}'. È presente una conversione esplicita. Probabilmente manca un cast.
ja: 型 '{0}' を '{1}' に暗黙的に変換できません。明示的な変換が存在します (cast が不足していないかどうかを確認してください)
ko: 암시적으로 '{0}' 형식을 '{1}' 형식으로 변환할 수 없습니다. 명시적 변환이 있습니다. 캐스트가 있는지 확인하세요.
pl: Nie można niejawnie przekonwertować typu „{0}” na „{1}”. Istnieje konwersja jawna (czy nie brakuje rzutu?).
pt_br: Não é possível converter implicitamente tipo "{0}" em "{1}". Existe uma conversão explícita (há uma conversão ausente?)
ru: Не удается неявно преобразовать тип "{0}" в "{1}". Существует явное преобразование (возможно, пропущено приведение типов).
tr: {0}' türü örtülü olarak '{1}' türüne dönüştürülemez. Açık bir dönüştürme var (eksik atamanız mı var?)
zh_hans: 无法将类型“{0}”隐式转换为“{1}”。存在一个显式转换(是否缺少强制转换?)
zh_hant: 無法將類型 '{0}' 隱含轉換成 '{1}'。已存在明確轉換 (是否漏了轉型?)

# ERR_PartialMisplaced
source: The 'partial' modifier can only appear immediately before 'class', 'record', 'struct', 'interface', 'event', an instance constructor name, or a method or property return type.
it: Il modificatore 'partial' può trovarsi solo immediatamente prima di 'class', 'record', 'struct', 'interface' o del tipo restituito di un metodo o di una proprietà.
pt_br: O modificador "partial" só pode aparecer imediatamente antes de "class", "record", "struct", "interface", "event", um nome de construtor de instância ou um método ou tipo de retorno de propriedade.
ru: Модификатор "partial" может использоваться только перед ключевыми словами "class", "record", "struct" и "interface", а также перед возвращаемым типом метода или свойства.
zh_hans: "partial" 修饰符的后面只能紧跟 "class"、"record"、"struct"、"interface" 或者方法或属性返回类型。

# ERR_ImportedCircularBase
source: Imported type '{0}' is invalid. It contains a circular base type dependency.
cs: Importovaný typ {0} je neplatný. Obsahuje cyklickou závislost základních typů.
fr: Le type importé '{0}' n'est pas valide. Il contient une dépendance de type de base circulaire.
it: Il tipo importato '{0}' non è valido perché contiene una dipendenza circolare del tipo di base.
ja: インポートされた型 '{0}' は無効です。これには循環する基本データ型の依存関係が含まれています。
pl: Importowany typ „{0}” jest nieprawidłowy. Zawiera on cykliczną zależność typu bazowego.
pt_br: O tipo importado '{0}' é inválido. Ele contém uma dependência de tipo base circular.
ru: Недопустимый импортированный тип "{0}". Он содержит циклическую зависимость базового типа.
zh_hans: 导入的类型“{0}”无效。它包含循环的基类型依赖项。
zh_hant: 匯入的類型 '{0}' 無效。其包含循環基底類型相依性。

# ERR_UseDefViolationOut
source: Use of unassigned out parameter '{0}'
cs: Použil se nepřiřazený parametr out {0}.
de: Verwendung des nicht zugewiesenen out-Parameters "{0}".
es: Uso del parámetro out sin asignar '{0}'
fr: Utilisation du paramètre out non assigné '{0}'
it: Uso del parametro out '{0}' non assegnato
ja: 未割り当ての out パラメーター '{0}' が使用されました
ko: 할당되지 않은 '{0}' out 매개 변수를 사용합니다.
pl: Użycie nieprzypisanego parametru ze specyfikatorem out „{0}”
pt_br: Uso do parâmetro out não atribuído "{0}"
ru: Использование выходного параметра "{0}", которому не присвоено значение.
tr: Atanmamış '{0}' out parametresinin kullanımı
zh_hans: 使用了未赋值的 out 参数“{0}”
zh_hant: 使用未指派的 out 參數 '{0}'

# ERR_ArraySizeInDeclaration
source: Array size cannot be specified in a variable declaration (try initializing with a 'new' expression)
cs: Velikost pole nejde určit v deklaraci proměnné (zkuste inicializaci pomocí výrazu new).
de: Die Arraygröße kann in einer Variablendeklaration nicht angegeben werden. (Initialisieren Sie sie mit einem new-Ausdruck.)
es: El tamaño de la matriz no se puede especificar en una declaración de variable (intente inicializar con una expresión 'new')
fr: La taille du tableau ne peut pas être spécifiée dans une déclaration de variable (essayez d'initialiser avec une expression 'new')
it: Impossibile specificare la dimensione della matrice in una dichiarazione di variabile. Provare a inizializzare con un'espressione 'new'
ja: 配列のサイズは変数宣言の中で指定できません ('new' を使用して初期化してください)
ko: 변수 선언에는 배열 크기를 지정할 수 없습니다. 'new' 식을 사용하여 초기화해 보세요.
pl: Rozmiaru tablicy nie można określić w deklaracji zmiennej (spróbuj przeprowadzić inicjowanie przy użyciu wyrażenia „new”)
pt_br: O tamanho de matriz não pode ser especificado em uma declaração de variável (tente inicializar com uma expressão 'new')
ru: Размер массива не может быть указан в объявлении переменной (попытайтесь инициализировать его с помощью оператора new).
tr: Değişken bildiriminde dizi boyutu belirtilemez (bir 'new' ifadesiyle başlatmayı deneyin)
zh_hans: 不能在变量声明中指定数组大小(请尝试使用 "new" 表达式初始化)
zh_hant: 變數宣告中不可指定陣列大小 (請嘗試使用 'new' 運算式進行初始設定)

# ERR_InaccessibleGetter
source: The property or indexer '{0}' cannot be used in this context because the get accessor is inaccessible
cs: Vlastnost nebo indexer {0} nejde v tomto kontextu použít, protože přistupující objekt get není dostupný.
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, da nicht auf den get-Accessor zugegriffen werden kann.
es: La propiedad o el indizador '{0}' no se pueden usar en este contexto porque el descriptor de acceso get es inaccesible
fr: Impossible d'utiliser la propriété ou l'indexeur '{0}' dans ce contexte, car l'accesseur get n'est pas accessible
it: Non è possibile usare la proprietà o l'indicizzatore '{0}' in questo contesto perché la funzione di accesso get non è accessibile
ja: get アクセサーにアクセスできないため、プロパティまたはインデクサー '{0}' はこのコンテキストでは使用できません
ko: get 접근자에 액세스할 수 없으므로 '{0}' 속성 또는 인덱서는 이 컨텍스트에서 사용할 수 없습니다.
pl: Właściwości lub indeksatora „{0}” nie można użyć w tym kontekście, ponieważ metoda dostępu Get jest niedostępna.
pt_br: A propriedade ou o indexador "{0}" não pode ser usado neste contexto porque o acessador get é inacessível
ru: Свойство или индексатор "{0}" невозможно использовать в данном контексте, так как метод доступа get недоступен.
tr: Alma erişimcisine erişilemediğinden '{0}' özelliği veya dizin erişimcisi bu bağlamda kullanılamaz
zh_hans: 属性或索引器“{0}”不能用在此上下文中，因为 get 访问器不可访问
zh_hant: 無法在此內容中使用屬性或索引子 '{0}'，因為無法存取 get 存取子

# ERR_InaccessibleSetter
source: The property or indexer '{0}' cannot be used in this context because the set accessor is inaccessible
cs: Vlastnost nebo indexer {0} nejde v tomto kontextu použít, protože přistupující objekt jet není dostupný.
de: Die Eigenschaft oder der Indexer "{0}" kann in diesem Kontext nicht verwendet werden, da nicht auf den set-Accessor zugegriffen werden kann.
es: La propiedad o el indizador '{0}' no se pueden usar en este contexto porque el descriptor de acceso set es inaccesible
fr: Impossible d'utiliser la propriété ou l'indexeur '{0}' dans ce contexte, car l'accesseur set n'est pas accessible
it: Non è possibile usare la proprietà o l'indicizzatore '{0}' in questo contesto perché la funzione di accesso set è inaccessibile
ja: set アクセサーにアクセスできないため、プロパティまたはインデクサー '{0}' はこのコンテキストでは使用できません
ko: set 접근자에 액세스할 수 없으므로 '{0}' 속성 또는 인덱서는 이 컨텍스트에서 사용할 수 없습니다.
pl: Właściwości lub indeksatora „{0}” nie można użyć w tym kontekście, ponieważ metoda dostępu Set jest niedostępna.
pt_br: A propriedade ou o indexador "{0}" não pode ser usado neste contexto porque o acessador set é inacessível
ru: Свойство или индексатор "{0}" невозможно использовать в данном контексте, так как метод доступа set недоступен.
tr: Ayarlama erişimcisine erişilemediğinden '{0}' özelliği veya dizin erişimcisi bu bağlamda kullanılamaz
zh_hans: 属性或索引器“{0}”不能用在此上下文中，因为 set 访问器不可访问
zh_hant: 無法在此內容中使用屬性或索引子 '{0}'，因為無法存取 set 存取子

# ERR_InvalidPropertyAccessMod
source: The accessibility modifier of the '{0}' accessor must be more restrictive than the property or indexer '{1}'
cs: Modifikátor dostupnosti přistupujícího objektu {0} musí být více omezující než vlastnost nebo indexer {1}.
de: Der Zugriffsmodifizierer des {0}-Accessors muss restriktiver sein als die Eigenschaft oder der Indexer "{1}".
es: El modificador de accesibilidad del descriptor de acceso '{0}' debe ser más restrictivo que la propiedad o el indizador '{1}'
fr: Le modificateur d'accessibilité de l'accesseur '{0}' doit être plus restrictif que la propriété ou l'indexeur '{1}'
it: Il modificatore di accessibilità della funzione di accesso '{0}' deve essere più restrittivo della proprietà o dell'indicizzatore '{1}'
ja: '{0}' アクセサーのアクセシビリティ修飾子は、プロパティまたはインデクサー '{1}' よりも制限されていなければなりません
ko: {0}' 접근자의 액세스 가능성 한정자는 '{1}' 속성 또는 인덱서보다 제한적이어야 합니다.
pl: Modyfikator dostępności dla metody dostępu „{0}” musi być bardziej restrykcyjny niż właściwość lub indeksator „{1}”
pt_br: O modificador de acessibilidade do "{0}" acessador deve ser mais restritivo que a propriedade ou o indexador "{1}"
ru: Модификатор доступа метода доступа "{0}" должен быть более ограничивающим, чем у свойства или индексатора "{1}".
tr: {0}' erişeninin erişilebilirlik değiştiricisi özellik veya '{1}' dizin oluşturucusundan daha kısıtlayıcı olmalıdır
zh_hans: “{0}”访问器的可访问性修饰符必须比属性或索引器“{1}”具有更强的限制
zh_hant: '{0}' 存取子的存取範圍修飾元，必須比屬性或索引子 '{1}' 更嚴格

# ERR_DuplicatePropertyAccessMods
source: Cannot specify accessibility modifiers for both accessors of the property or indexer '{0}'
cs: Nejde zadat modifikátory dostupnosti pro přistupující objekty jak vlastnosti, tak i indexer {0}.
de: Es können keine Zugriffsmodifizierer für beide Accessoren der Eigenschaft oder des Indexers "{0}" angegeben werden.
es: No se pueden especificar modificadores de accesibilidad para ambos descriptores de acceso de la propiedad o del indizador '{0}'
fr: Impossible de spécifier des modificateurs d'accessibilité pour les accesseurs de la propriété ou de l'indexeur '{0}'
it: Non è possibile specificare i modificatori di accessibilità per entrambe le funzioni di accesso della proprietà o dell'indicizzatore '{0}'
ja: アクセシビリティ修飾子は、プロパティまたはインデクサー '{0}' の両方のアクセサーに指定できません
ko: {0}' 속성 또는 인덱서의 두 접근자에 대해 액세스 가능성 한정자를 지정할 수 없습니다.
pl: Nie można określić modyfikatorów dostępności dla obu metod dostępu właściwości lub indeksatora „{0}”
pt_br: Não é possível especificar modificadores de acessibilidade para os acessores da propriedade ou indexador "{0}"
ru: Не удается определить модификаторы доступа для обоих методов доступа свойства или индексатора "{0}".
tr: Özellik veya '{0}' dizin oluşturucusunun erişenleri için erişilebilirlik değiştiricileri belirtilemiyor
zh_hans: 不能为属性或索引器“{0}”的两个访问器同时指定可访问性修饰符
zh_hant: 不可同時對屬性或索引子 '{0}' 的兩個存取子，指定存取範圍修飾元

# ERR_AccessModMissingAccessor
source: '{0}': accessibility modifiers on accessors may only be used if the property or indexer has both a get and a set accessor
cs: {0}: Modifikátory přístupnosti u přistupujících objektů se můžou používat, jenom pokud vlastnost nebo indexeru má přistupující objekt get i set.
de: '"{0}": Zugriffsmodifizierer für Accessoren dürfen nur verwendet werden, wenn die Eigenschaft oder der Indexer einen get- und einen set-Accessor aufweist.
es: '{0}': los modificadores de accesibilidad de los descriptores de acceso solo se pueden usar si la propiedad o el indizador tienen un descriptor de acceso get y set
fr: '{0}' : les modificateurs d'accessibilité au niveau des accesseurs ne peuvent être utilisés que si la propriété ou l'indexeur a un accesseur get et un accesseur set
it: '{0}': i modificatori di accessibilità per le funzioni di accesso possono essere usati solo se la proprietà o l'indicizzatore ha entrambe le funzioni di accesso get e set
ja: '{0}': アクセサーのアクセシビリティ修飾子は、プロパティまたはインデクサーが get アクセサーおよび set アクセサーの両方を含む場合にのみ、使用されます
ko: '{0}': 접근자의 액세스 가능성 한정자는 속성 또는 인덱서에 get 접근자와 set 접근자가 모두 있는 경우에만 사용할 수 있습니다.
pl: „{0}”: modyfikatorów dostępności można używać tylko wtedy, gdy właściwość lub indeksator mają metody dostępu Get i Set
pt_br: "{0}": modificadores de acessibilidade nos assessores podem somente ser usados se a propriedade ou o indexador tiver um acessador get e um accessador set
ru: "{0}": модификаторы доступа для методов доступа могут использоваться, только если свойство или индексатор имеет оба метода доступа, get и set.
tr: '{0}': erişimcilerdeki erişilebilirlik değiştiricileri yalnızca özellik veya dizin oluşturucusu hem alma hem ayarlama erişimcisine sahipse kullanılabilir.
zh_hans: “{0}”: 仅当属性或索引器同时具有 get 访问器和 set 访问器时，才能对访问器使用可访问性修饰符
zh_hant: '{0}': 存取子上的存取範圍修飾元，只有在屬性或索引子同時有 get 和 set 存取子時，才可使用

# ERR_UnimplementedInterfaceAccessor
source: '{0}' does not implement interface member '{1}'. '{2}' is not public.
cs: {0} neimplementuje člen rozhraní {1}. {2} není veřejný.
de: '"{0}" implementiert den Schnittstellenmember "{1}" nicht. "{2}" ist nicht öffentlich.
es: '{0}' no implementa el miembro de interfaz '{1}'. '{2}' no es público.
fr: '{0}' n'implémente pas le membre d'interface '{1}'. '{2}' n'est pas public.
it: '{0}' non implementa il membro di interfaccia '{1}'. '{2}' è di tipo non pubblico
ja: '{0}' はインターフェイス メンバー '{1}' を実装しません。'{2}' は public ではありません。
ko: '{0}'은(는) '{1}' 인터페이스 멤버를 구현하지 않습니다. '{2}'이(가) public이 아닙니다.
pl: 'Element „{0}” nie implementuje składowej interfejsu „{1}”. Element „{2}” nie jest publiczny.
pt_br: "{0}" não implementa membro de interface "{1}". "{2}" não é público.
ru: "{0}" не реализует член интерфейса "{1}". "{2}" не открытый.
tr: '{0}', '{1}' arabirim üyesini uygulamaz. '{2}' ortak değildir.
zh_hans: “{0}”不实现接口成员“{1}”。“{2}”不是公共的。
zh_hant: '{0}' 未實作介面成員 '{1}'，因為 '{2}' 並非公用。

# WRN_PatternIsAmbiguous
source: '{0}' does not implement the '{1}' pattern. '{2}' is ambiguous with '{3}'.
cs: {0} neimplementuje vzorek {1}. {2} je nejednoznačný vzhledem k: {3}.
de: '"{0}" implementiert das Muster "{1}" nicht. "{2}" ist mit "{3}" nicht eindeutig.
es: '{0}' no implementa el patrón '{1}'. '{2}' es ambiguo con '{3}'.
fr: '{0}' n'implémente pas le modèle '{1}'. '{2}' est ambigu avec '{3}'.
it: '{0}' non implementa il modello '{1}'. '{2}' è ambiguo con '{3}'.
ja: '{0}' は、パターン '{1}' を実装しません。'{2}' は、'{3}' で不適切です。
ko: '{0}'이(가) '{1}' 패턴을 구현하지 않습니다. '{2}'이(가) '{3}'에서 모호합니다.
pl: 'Element „{0}” nie implementuje wzorca „{1}”. Elementy „{2}” i „{3}” są wzajemnie niejednoznaczne.
pt_br: "{0}" não implementa o padrão "{1}". "{2}" é ambíguo com "{3}".
ru: "{0}" не реализует шаблон "{1}". "{2}" неоднозначен с "{3}".
tr: '{0}', '{1}' kalıbını uygulamaz. '{2}', '{3}' ile belirsiz.
zh_hans: “{0}”不实现“{1}”模式。“{2}”与“{3}”一起使用时目的不明确。
zh_hant: '{0}' 未實作 '{1}' 模式，因為 '{2}' 與 '{3}' 之間模稜兩可。

# WRN_PatternIsAmbiguous_Title
source: Type does not implement the collection pattern; members are ambiguous
cs: Typ neimplementuje vzorek kolekce. Členové nejsou jednoznační.
de: Der Typ implementiert nicht das Sammlungsmuster. Die Elemente sind nicht eindeutig.
es: El tipo no implementa la trama de colección. Los miembros son ambiguos
fr: Un type n'implémente pas le modèle de la collection ; les membres sont ambigus
it: Il tipo non implementa il modello di raccolta. I membri sono ambigui
ja: 型は、コレクション パターンを実装しません。メンバーがあいまいです
ko: 형식은 컬렉션 패턴을 구현하지 않습니다. 멤버가 모호합니다.
pl: Typ nie zawiera implementacji wzorca kolekcji; składowe są niejednoznaczne
pt_br: O tipo não implementa o padrão de coleção; os membros são ambíguos
ru: Тип не реализует шаблон коллекции: члены неоднозначны
tr: Tür koleksiyon desenini uygulamaz; üyeler belirsiz
zh_hans: 类型不实现集合模式；成员不明确
zh_hant: 類型未實作集合模式; 成員模稜兩可

# WRN_PatternBadSignature
source: '{0}' does not implement the '{1}' pattern. '{2}' has the wrong signature.
cs: {0} neimplementuje vzorek {1}. {2} nemá správný podpis.
de: '"{0}" implementiert das Muster "{1}" nicht. "{2}" weist die falsche Signatur auf.
es: '{0}' no implementa el patrón '{1}'. '{2}' tiene una firma incorrecta.
fr: '{0}' n'implémente pas le modèle '{1}'. '{2}' a une signature erronée.
it: '{0}' non implementa il modello '{1}'. La firma di '{2}' è errata.
ja: '{0}' は、パターン '{1}' を実装しません。'{2}' には正しくないシグネチャが含まれます。
ko: '{0}'이(가) '{1}' 패턴을 구현하지 않습니다. '{2}'에 잘못된 시그니처가 있습니다.
pl: 'Element „{0}” nie implementuje wzorca „{1}”. Element „{2}” ma nieprawidłową sygnaturę.
pt_br: "{0}" não implementa o padrão "{1}". "{2}" tem a assinatura errada.
ru: "{0}" не реализует шаблон "{1}". "{2}" имеет неправильную сигнатуру.
tr: '{0}', '{1}' kalıbını uygulamaz. '{2}' yanlış imzaya sahip.
zh_hans: “{0}”不实现“{1}”模式。“{2}”有错误的签名。
zh_hant: '{0}' 未實作 '{1}' 模式。'{2}' 的簽章錯誤。

# WRN_PatternBadSignature_Title
source: Type does not implement the collection pattern; member has the wrong signature
cs: Typ neimplementuje vzorek kolekce. Člen nemá správný podpis.
de: Der Typ implementiert nicht das Sammlungsmuster. Das Element weist die falsche Signatur auf.
es: El tipo no implementa la trama de colección. El miembro tiene la firma incorrecta
fr: Un type n'implémente pas le modèle de la collection ; un membre n'a pas la bonne signature
it: Il tipo non implementa il modello di raccolta. La firma del membro è errata
ja: 型は、コレクション パターンを実装しません。メンバーには正しくないシグネチャが含まれます
ko: 형식은 컬렉션 패턴을 구현하지 않습니다. 멤버의 서명이 잘못되었습니다.
pl: Typ nie zawiera implementacji wzorca kolekcji; składowa ma niewłaściwą sygnaturę
pt_br: O tipo não implementa o padrão de coleção; o membro possui a assinatura incorreta
ru: Тип не реализует шаблон коллекции: член содержит неправильную подпись
tr: Tür koleksiyon desenini uygulamaz; üye yanlış imzaya sahip
zh_hans: 类型不实现集合模式；成员有错误的签名
zh_hant: 類型未實作集合模式; 成員的簽章錯誤

# ERR_FriendRefNotEqualToThis
source: Friend access was granted by '{0}', but the public key of the output assembly ('{1}') does not match that specified by the InternalsVisibleTo attribute in the granting assembly.
cs: Sestavení {0} udělilo přístup typu Friend, ale veřejný klíč výstupního sestavení ({1}) neodpovídá klíči určenému atributem InternalsVisibleTo v udělujícím sestavení.
de: Von "{0}" wurde friend-Zugriff gewährt, aber der öffentliche Schlüssel der Ausgabeassembly ({1}) stimmt nicht mit dem überein, der vom InternalsVisibleTo-Attribut in der gewährenden Assembly angegeben wird.
es: “{0}” ha concedido acceso de confianza, pero la clave pública del ensamblado de salida ({1}) no coincide con la especificada por el atributo InternalsVisibleTo en el ensamblado de concesión.
fr: Un accès Friend a été concédé par '{0}', mais la clé publique de l'assembly de sortie ('{1}') ne correspond pas à celle spécifiée par l'attribut InternalsVisibleTo dans l'assembly concédant.
it: L'accesso a Friend è stato concesso da '{0}', ma la chiave pubblica dell'assembly di output ('{1}') non corrisponde a quella specificata dall'attributo InternalsVisibleTo nell'assembly che ha concesso l'accesso.
ja: フレンド アクセスのアクセス権は '{0}' によって付与されますが、出力アセンブリ ('{1}') の公開キーは、付与するアセンブリで InternalsVisibleTo 属性によって指定される公開キーと一致しません。
ko: '{0}'에서 friend 액세스 권한을 부여했지만, 출력 어셈블리('{1}')의 공개 키가 부여한 어셈블리의 InternalsVisibleTo 특성에서 지정된 키와 일치하지 않습니다.
pl: Dostęp do przyjaznego zestawu został udzielony przez „{0}”, ale klucz publiczny zestawu wyjściowego („{1}”) nie jest zgodny z kluczem określonym przez atrybut InternalsVisibleTo w zestawie udzielającym dostępu.
pt_br: O acesso Friend foi concedido por '{0}', mas a chave pública do assembly de saída ('{1}') não corresponde àquela especificada pelo atributo InternalsVisibleTo no assembly de concessão.
ru: Дружественный доступ предоставлен "{0}", однако открытый ключ выходной сборки ("{1}") не соответствует ключу, определенному атрибутом InternalsVisibleTo предоставляющей сборки.
tr: '{0}' tarafından arkadaş erişimi izni verildi, ancak çıkış bütünleştirilmiş kodunun ('{1}') ortak anahtarı, izin veren bütünleştirilmiş koddaki InternalsVisibleTo özniteliği tarafından belirtilenle eşleşmiyor.
zh_hans: 友元访问权限由“{0}”授予，但是输出程序集('{1}')的公钥与授予程序集中 InternalsVisibleTo 特性指定的公钥不匹配。
zh_hant: '{0}' 已授與 Friend 存取權限，但輸出組件 ('{1}') 的公開金鑰，與授與之組件中 InternalsVisibleTo 屬性所指定的公開金鑰不符。

# ERR_FriendRefSigningMismatch
source: Friend access was granted by '{0}', but the strong name signing state of the output assembly does not match that of the granting assembly.
cs: Sestavení {0} udělilo přístup typu Friend, ale stav podepsání silného názvu u výstupního sestavení neodpovídá stavu udělujícího sestavení.
de: Von "{0}" wurde friend-Zugriff gewährt, aber der starke Name zum Signieren der Ausgabeassembly stimmt nicht mit dem der gewährenden Assembly überein.
es: {0}' ha concedido acceso de confianza, pero el nombre seguro que firma el estado del ensamblado de salida no coincide con el del ensamblado de concesión.
fr: Un accès Friend a été concédé par '{0}', mais l'état de signature avec nom fort de l'assembly de sortie ne correspond pas à celui de l'assembly concédant.
it: L'accesso a Friend è stato concesso da '{0}', ma lo stato di firma del nome sicuro dell'assembly di output non corrisponde a quello dell'assembly che ha concesso l'accesso.
ja: フレンド アクセスのアクセス権は '{0}' によって付与されますが、出力アセンブリにおける厳密な名前の署名の状態が付与するアセンブリと一致しません。
ko: {0}'에서 friend 액세스 권한을 부여했지만, 출력 어셈블리의 강력한 이름 서명 상태가 부여한 어셈블리의 상태와 일치하지 않습니다.
pl: Dostęp do przyjaznego zestawu został udzielony przez „{0}”, ale silna nazwa stanu podpisywania zestawu wyjściowego nie jest zgodna z nazwą określoną przez atrybut w zestawie udzielającym dostępu.
pt_br: O acesso Friend foi concedido por "{0}", mas o estado de assinatura de nome forte do assembly de saída não corresponde àquele do assembly de concessão.
ru: Дружественный доступ предоставлен "{0}", однако состояние подписи строгого имени выходной сборки не соответствует состоянию предоставляющей сборки.
tr: {0}' öğesine friend erişimi izni verildi, ancak çıkış derlemesinin kesin ad imzalama durumu, izin veren derlemeninkiyle eşleşmiyor.
zh_hans: 友元访问权限由“{0}”授予，但是输出程序集的强名称签名状态与授予程序集的强名称签名状态不匹配。
zh_hant: '{0}' 已授與 Friend 存取權限，但輸出組件的強式名稱簽署狀態不符合授與組件的強式名稱簽署狀態。
