Repository: dotnet/roslyn
Catalog: src/Compilers/CSharp/Portable/xlf/CSharpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WRN_UninitializedNonNullableField_Title
source: Non-nullable field must contain a non-null value when exiting constructor. Consider adding the 'required' modifier or declaring as nullable.
fr: Un champ non-nullable doit contenir une valeur autre que Null lors de la fermeture du constructeur. Envisagez d’ajouter le modificateur « required » ou de déclarer le champ comme pouvant accepter la valeur Null.
it: Il campo non nullable deve contenere un valore non Null all'uscita dal costruttore. Prendere in considerazione l'aggiunta del modificatore 'required' o la dichiarazione come nullable.
pl: Pole niedopuszczające wartości null musi zawierać wartość inną niż null podczas kończenia działania konstruktora. Rozważ dodanie modyfikatora „required” lub zadeklarowanie go jako dopuszczającego wartość null.
pt_br: O campo não anulável precisa conter um valor não nulo ao sair do construtor. Considere adicionar o modificador "obrigatório" ou declarar como anulável.
ru: Поле, не допускающее значения NULL, должно содержать значение, отличное от NULL, при выходе из конструктора. Рассмотрите возможность добавления модификатора "required" или объявления значения, допускающего значение NULL.
zh_hans: 在退出构造函数时，不可为 null 的字段必须包含非 null 值。请考虑添加 "required" 修饰符或声明为可为 null。
zh_hant: 退出建構函式時，不可為 Null 的欄位必須包含非 Null 值。請考慮新增 'required' 修飾元，或將欄位宣告為可以為 Null。

# WRN_UnreadPrimaryConstructorParameter
source: Parameter '{0}' is unread.
cs: Parametr {0} je nepřečtený.
fr: Paramètre '{0}' non lu.
it: Il parametro '{0}' non è stato letto.
ja: パラメーター '{0}' は未読です。
pl: Parametr '{0}' jest nieodczytany.
pt_br: O parâmetro "{0}" não está lido.
ru: Параметр "{0}" не прочитан.
zh_hans: 参数“{0}”未读。
zh_hant: 參數 '{0}' 未讀取。

# WRN_UnreadPrimaryConstructorParameter_Title
source: Parameter is unread.
cs: Parametr je nepřečtený.
fr: Paramètre non lu.
it: Il parametro non è stato letto.
ja: パラメーターが未読です。
pl: Parametr jest nieodczytany.
pt_br: O parâmetro não está lido.
ru: Параметр не прочитан.
zh_hans: 参数未读。
zh_hant: 參數未讀取。

# WRN_UnreadRecordParameter
source: Parameter '{0}' is unread. Did you forget to use it to initialize the property with that name?
cs: Parametr {0} se nepřečetl. Nezapomněli jste ho použít k inicializaci vlastnosti s daným názvem?
fr: Le paramètre '{0}' est non lu. Avez-vous oublié de l'utiliser pour initialiser la propriété portant ce nom ?
it: Il parametro '{0}' non è stato letto. Si è dimenticato di usarlo per inizializzare la proprietà con tale nome?
ja: パラメーター '{0}' は未読です。この名前のプロパティを初期化するために使用していることを確認してください。
pl: Parametr „{0}” nie został odczytany. Czy zapomniano użyć go do zainicjowania właściwości o tej nazwie?
pt_br: O parâmetro '{0}' não foi lido. Você esqueceu de usá-lo para inicializar a propriedade com esse nome?
ru: Параметр "{0}" не читается. Возможно, вы забыли использовать его для инициализации свойства с таким же именем?
zh_hans: 参数“{0}”未读。是否忘记通过它来使用该名称初始化属性?
zh_hant: 參數 '{0}' 未讀取。是否忘記使用該參數來初始化該名稱的屬性?

# WRN_UnreadRecordParameter_Title
source: Parameter is unread. Did you forget to use it to initialize the property with that name?
cs: Parametr se nepřečetl. Nezapomněli jste ho použít k inicializaci vlastnosti s daným názvem?
fr: Le paramètre est non lu. Avez-vous oublié de l'utiliser pour initialiser la propriété portant ce nom ?
it: Il parametro non è stato letto. Si è dimenticato di usarlo per inizializzare la proprietà con tale nome?
ja: パラメーターが未読のため、この名前のプロパティを初期化するために使用していることを確認する必要がある
pl: Parametr nie został odczytany. Czy zapomniano użyć go do zainicjowania właściwości o tej nazwie?
pt_br: O parâmetro não foi lido. Você esqueceu de usá-lo para inicializar a propriedade com esse nome?
ru: Параметр не читается. Возможно, вы забыли использовать его для инициализации свойства с таким же именем?
zh_hans: 参数未读。是否忘记通过它来使用该名称初始化属性?
zh_hant: 參數未讀取。是否忘記使用該參數來初始化該名稱的屬性?

# WRN_UnscopedRefAttributeOldRules
source: UnscopedRefAttribute is only valid in C# 11 or later or when targeting net7.0 or later.
fr: UnscopedRefAttribute n’est valide qu’en C# 11 ou version ultérieure, ou quand net7.0 ou version ultérieure est ciblé.
it: UnscopedRefAttribute è valido solo in C# 11 o versioni successive o se destinato a net7.0 o versione successiva.
pt_br: UnscopedRefAttribute só é válido em C# 11 ou posterior ou ao direcionar para net7.0 ou posterior.
ru: UnscopedRefAttribute допустим только в C# 11 или более поздней версии или при нацелии на net7.0 или более позднюю версию.
zh_hans: UnscopedRefAttribute 仅在 C# 11 或更高版本中或面向 net7.0 或更高版本时有效。

# WRN_UnscopedRefAttributeOldRules_Title
source: UnscopedRefAttribute is only valid in C# 11 or later or when targeting net7.0 or later.
fr: UnscopedRefAttribute n’est valide qu’en C# 11 ou version ultérieure, ou quand net7.0 ou version ultérieure est ciblé.
it: UnscopedRefAttribute è valido solo in C# 11 o versioni successive o se destinato a net7.0 o versione successiva.
pt_br: UnscopedRefAttribute só é válido em C# 11 ou posterior ou ao direcionar para net7.0 ou posterior.
ru: UnscopedRefAttribute допустим только в C# 11 или более поздней версии или при нацелии на net7.0 или более позднюю версию.
zh_hans: UnscopedRefAttribute 仅在 C# 11 或更高版本中或面向 net7.0 或更高版本时有效。

# WRN_UseDefViolation
source: Use of unassigned local variable '{0}'
cs: Použila se nepřiřazená lokální proměnná {0}.
fr: Utilisation d'une variable locale non assignée '{0}'
it: Uso della variabile locale '{0}' non assegnata
ja: 未割り当てのローカル変数 '{0}' が使用されました
pl: Użyto nieprzypisanej zmiennej lokalnej „{0}”
pt_br: Uso de variável local não atribuída "{0}"
ru: Использование локальной переменной "{0}", которой не присвоено значение.
zh_hans: 使用了未赋值的局部变量“{0}”
zh_hant: 使用未指派的區域變數 '{0}'

# WRN_UseDefViolationField
source: Use of possibly unassigned field '{0}'
cs: Použila se možná nepřiřazené pole {0}.
fr: Utilisation d'un champ potentiellement non assigné '{0}'
it: Uso del campo '{0}' probabilmente non assegnato
ja: フィールド '{0}' は、割り当てられていない可能性があります
pl: Użycie prawdopodobnie nieprzypisanego pola „{0}”
pt_br: Uso de campo possivelmente não atribuído "{0}"
ru: Использование поля "{0}", которому, возможно, не присвоено значение.
zh_hans: 使用了可能未赋值的字段“{0}”
zh_hant: 使用可能未指派的欄位 '{0}'

# WRN_UseDefViolationFieldSupportedVersion
source: Field '{0}' is read before being explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Před explicitním přiřazením se přečte pole {0}, což způsobí předchozí implicitní přiřazení default.
fr: Le champ '{0}' est lu avant d’être explicitement attribué, ce qui provoque une attribution implicite précédente de 'default'.
it: Il campo '{0}' viene letto prima di essere assegnato in modo esplicito, determinando un’assegnazione implicita precedente di 'default'.
ja: 明示的に割り当てられる前にフィールド '{0}' が読み取られ、先行する暗黙的な代入が 'default' になります。
pl: Pole „{0}” jest odczytywane przed jawnym przypisaniem, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O campo '{0}' é lido antes de ser explicitamente atribuído, causando uma atribuição implícita anterior de 'default'.
ru: Поле "{0}" прочитывается до явного назначения, что приводит к предшествующему неявному назначению "default".
zh_hans: 字段'{0}'在显式分配之前被读取，导致前面的隐式分配为 'default'。
zh_hant: 在明確指派之前會先讀取欄位 '{0}'，導致先前隱含的指派為 'default'。

# WRN_UseDefViolationFieldSupportedVersion_Title
source: Field is read before being explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Před explicitním přiřazením se přečte pole, což způsobí předchozí implicitní přiřazení default.
fr: Le champ est lu avant d’être explicitement attribué, ce qui provoque une attribution implicite précédente de « default ».
it: Il campo viene letto prima di essere assegnato in modo esplicito, determinando un’assegnazione implicita precedente di 'default'.
ja: 明示的に割り当てられる前にフィールドが読み取られ、先行する暗黙的な代入が 'default' になります。
pl: Pole jest odczytywane przed jawnym przypisaniem, co powoduje wcześniejsze niejawne przypisanie wartości „default”.
pt_br: O campo é lido antes de ser explicitamente atribuído, causando uma atribuição implícita anterior de 'default'.
ru: Это поле прочитывается до явного назначения, что приводит к предшествующему неявному назначению "default".
zh_hans: 字段在显式分配之前被读取，导致前面的隐式分配为 'default'。
zh_hant: 在明確指派之前會先讀取欄位，導致先前隱含的指派為 'default'。

# WRN_UseDefViolationFieldUnsupportedVersion
source: Use of possibly unassigned field '{0}'. Consider updating to language version '{1}' to auto-default the field.
cs: Použití potenciálně nepřiřazeného pole {0}. Zvažte aktualizaci jazykové verze {1} na automatické výchozí nastavení pole.
fr: Utilisation d’un '{0}' de champ éventuellement non attribué. Envisagez de mettre à jour vers la version de langage '{1}' pour utiliser la valeur par défaut automatique du champ.
it: Uso del campo probabilmente non assegnato '{0}'. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente il campo come predefinito.
ja: 割り当てられていない可能性のあるフィールド '{0}' を使用しています。フィールドを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanego pola „{0}”. Rozważ zaktualizowanie pola do wersji językowej „{1}”, aby automatycznie ustawić domyślne pole.
pt_br: Uso de campo possivelmente não atribuído '{0}'. Considere atualizar para a versão de linguagem '{1}' para auto-padrão do campo.
ru: Используется поле "{0}", которое может быть не назначено. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未分配的字段 '{0}'。请考虑更新到语言版本 '{1}' 以自动默认字段。
zh_hant: 使用可能未指派的欄位 '{0}'。請考慮更新語言版本 '{1}' 以自動預設欄位。

# WRN_UseDefViolationFieldUnsupportedVersion_Title
source: Use of possibly unassigned field. Consider updating the language version to auto-default the field.
cs: Použití potenciálně nepřiřazeného pole. Zvažte aktualizaci jazykové verze na automatické výchozí nastavení pole.
fr: Utilisation d’un champ éventuellement non attribué. Envisagez de mettre à jour la version du langage pour qu’elle soit automatiquement mise à jour par défaut du champ.
it: Uso di un campo probabilmente non assegnato. Provare ad aggiornare la versione della lingua per impostare automaticamente il campo come predefinito.
ja: 割り当てられていない可能性のあるフィールドを使用しています。フィールドを自動既定値にするため言語バージョンを更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanego pola. Rozważ zaktualizowanie pola do wersji językowej, aby automatycznie ustawić domyślne pole.
pt_br: Uso de campo possivelmente não atribuído. Considere atualizar a versão de linguagem para auto-padrão do campo.
ru: Используется поле, которое может быть не назначено. Попробуйте обновить языковую версию, чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未分配的字段。请考虑更新到语言版本以自动默认字段。
zh_hant: 使用可能未指派的欄位。請考慮更新語言版本以自動預設欄位。

# WRN_UseDefViolationField_Title
source: Use of possibly unassigned field
cs: Použilo se pravděpodobně nepřiřazené pole
fr: Utilisation d'un champ potentiellement non assigné
it: Uso del campo probabilmente non assegnato
ja: 割り当てられていない可能性のあるフィールドの使用
pl: Użycie prawdopodobnie nieprzypisanego pola
pt_br: Uso de campo possivelmente não atribuído
ru: Использование поля, которому, возможно, не присвоено значение
zh_hans: 使用可能未赋值的字段
zh_hant: 使用可能未指派的欄位

# WRN_UseDefViolationOut
source: Use of unassigned out parameter '{0}'
cs: Použil se nepřiřazený parametr out {0}.
fr: Utilisation du paramètre out non assigné '{0}'
it: Uso del parametro out '{0}' non assegnato
ja: 未割り当ての out パラメーター '{0}' が使用されました
pl: Użycie nieprzypisanego parametru ze specyfikatorem out „{0}”
pt_br: Uso do parâmetro out não atribuído "{0}"
ru: Использование выходного параметра "{0}", которому не присвоено значение.
zh_hans: 使用了未赋值的 out 参数“{0}”
zh_hant: 使用未指派的 out 參數 '{0}'

# WRN_UseDefViolationOut_Title
source: Use of unassigned out parameter
cs: Použil se nepřiřazený parametr out
fr: Utilisation d'un paramètre out non assigné
it: Uso del parametro out non assegnato
ja: 割り当てられていない out パラメーターの使用
pl: Użycie nieprzypisanego parametru ze specyfikatorem out
pt_br: Uso do parâmetro out não atribuído
ru: Использование параметра out, которому не присвоено значение
zh_hans: 使用未赋值的 out 参数
zh_hant: 使用未指派的 out 參數

# WRN_UseDefViolationProperty
source: Use of possibly unassigned auto-implemented property '{0}'
cs: Použití pravděpodobně nepřiřazené automaticky implementované vlastnosti {0}
fr: Utilisation d'une propriété implémentée automatiquement éventuellement non assignée : '{0}'
it: Uso della proprietà implementata automaticamente '{0}' probabilmente non assegnata
ja: 割り当てられていない可能性のある自動実装プロパティ '{0}' の使用
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości „{0}”
pt_br: Uso de propriedades autoimplementadas possivelmente não atribuídas '{0}'
ru: Использование автоматически реализованного свойства "{0}", которому, возможно, не присвоено значение
zh_hans: 使用可能未赋值的自动实现的属性“{0}”
zh_hant: 可能使用了未指派的自動實作屬性 '{0}'

# WRN_UseDefViolationPropertySupportedVersion
source: Auto-implemented property '{0}' is read before being explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Před explicitním přiřazením se přečte automaticky implementovaná vlastnost {0}, což způsobí předchozí implicitní přiřazení default.
fr: La propriété implémentée automatiquement '{0}' est lue avant d’être explicitement affectée, ce qui provoque une attribution implicite précédente de 'default'.
it: La proprietà implementata automaticamente '{0}' viene letta prima di essere assegnata in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: 明示的に割り当てられる前に自動実装プロパティ '{0}' が読み取られ、先行する暗黙的な代入が 'default' になります。
pl: Automatycznie zaimplementowana właściwość „{0}” jest odczytywana przed jawnym przypisaniem, co powoduje wcześniejsze niejawne przypisanie elementu „default”.
pt_br: A propriedade auto-implementada '{0}' é lida antes de ser explicitamente atribuída, causando uma atribuição implícita anterior de 'default'.
ru: Автоматически реализуемое свойство "{0}" прочитывается до явного назначения, что приводит к предшествующему неявному назначению "default".
zh_hans: 在显式分配之前，将读取自动实现的属性 '{0}' ，从而导致前面的隐式分配为 'default'。
zh_hant: 在明確指派之前會先讀取自動實作屬性 '{0}'，導致先前隱含的指派為 'default'。

# WRN_UseDefViolationPropertySupportedVersion_Title
source: Auto-implemented property is read before being explicitly assigned, causing a preceding implicit assignment of 'default'.
cs: Před explicitním přiřazením se přečte automaticky implementovaná vlastnost, což způsobí předchozí implicitní přiřazení default.
fr: La propriété implémentée automatiquement est lue avant d’être affectée explicitement, ce qui entraîne une attribution implicite précédente de « default ».
it: La proprietà implementata automaticamente viene letta prima di essere assegnata in modo esplicito, determinando un'assegnazione implicita precedente di 'default'.
ja: 明示的に割り当てられる前に自動実装プロパティが読み取られ、先行する暗黙的な代入が 'default' になります。
pl: Automatycznie zaimplementowana właściwość jest odczytywana przed jawnym przypisaniem, co powoduje wcześniejsze niejawne przypisanie elementu „default”.
pt_br: A propriedade auto-implementada é lida antes de ser explicitamente atribuída, causando uma atribuição implícita anterior de 'default'.
ru: Автоматически реализуемое свойство прочитывается до явного назначения, что приводит к предшествующему неявному назначению "default".
zh_hans: 在显式分配之前，将读取自动实现的属性，从而导致前面的隐式分配为 'default'。
zh_hant: 在明確指派之前會先讀取自動實作屬性，導致先前隱含的指派為 'default'。

# WRN_UseDefViolationPropertyUnsupportedVersion
source: Use of possibly unassigned auto-implemented property '{0}'. Consider updating to language version '{1}' to auto-default the property.
cs: Použití potenciálně nepřiřazené automaticky implementované vlastnosti {0}. Zvažte aktualizaci jazykové verze {1} na automaticky výchozí vlastnost.
fr: Utilisation de la propriété implémentée automatiquement «{0}» éventuellement non assignée. Envisagez de mettre à jour la version de langue «{1}» pour définir automatiquement la propriété par défaut.
it: Utilizzo della proprietà implementata automaticamente probabilmente non assegnata '{0}'. Provare a eseguire l'aggiornamento alla versione del linguaggio '{1}' per impostare automaticamente la proprietà come predefinita.
ja: 割り当てられていない可能性のある自動実装プロパティ '{0}' を使用しています。プロパティを自動既定値にするため '{1}' 言語バージョンに更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości „{0}”. Rozważ zaktualizowanie do wersji językowej „{1}”, aby automatycznie ustawić domyślną właściwości.
pt_br: O uso de propriedade auto-implementada possivelmente não atribuída '{0}'. Considere atualizar para a versão de linguagem '{1}' para auto-padrão da propriedade.
ru: Используется автоматически реализуемое свойство "{0}", которое может быть не назначено. Попробуйте обновить до языковой версии "{1}", чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未赋值的自动实现的属性 '{0}'。请考虑更新到语言版本 '{1}' 以自动默认属性。
zh_hant: 使用可能未指派的自動實作屬性 '{0}'。請考慮更新語言版本 '{1}' 以自動預設屬性。

# WRN_UseDefViolationPropertyUnsupportedVersion_Title
source: Use of possibly unassigned auto-implemented property. Consider updating the language version to auto-default the property.
cs: Použití potenciálně nepřiřazené automaticky implementované vlastnosti. Zvažte aktualizaci jazykové verze na automaticky výchozí vlastnost.
fr: Utilisation d’une propriété implémentée automatiquement éventuellement non attribuée. Envisagez de mettre à jour la version du langage pour qu’elle soit automatiquement définie par défaut sur la propriété.
it: Utilizzo di proprietà implementata automaticamente probabilmente non assegnata. Provare ad aggiornare la versione del linguaggio per impostare automaticamente la proprietà come predefinita.
ja: 割り当てられていない可能性のある自動実装プロパティを使用しています。プロパティを自動既定値にするため言語バージョンを更新することを検討してください。
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości. Rozważ zaktualizowanie do wersji językowej, aby automatycznie ustawić domyślną właściwości.
pt_br: Uso da propriedade auto-implementada possivelmente não atribuída. Considere atualizar a versão de linguagem para auto-padrão da propriedade.
ru: Используется автоматически реализуемое свойство, которое может быть не назначено. Попробуйте обновить языковую версию, чтобы автоматически применить значения по умолчанию к этому полю.
zh_hans: 使用可能未赋值的自动实现的属性。请考虑更新到语言版本以自动默认属性。
zh_hant: 使用可能未指派的自動實作屬性。請考慮更新語言版本以自動預設屬性。

# WRN_UseDefViolationProperty_Title
source: Use of possibly unassigned auto-implemented property
cs: Použily se pravděpodobně nepřiřazené automaticky implementované vlastnosti
fr: Utilisation d'une propriété implémentée automatiquement éventuellement non assignée
it: Uso della proprietà implementata automaticamente probabilmente non assegnata
ja: 割り当てられていない可能性のある自動実装プロパティの使用
pl: Użycie prawdopodobnie nieprzypisanej automatycznie implementowanej właściwości
pt_br: Uso de propriedade autoimplementada possivelmente não atribuída
ru: Использование автоматически реализованного свойства, которому, возможно, не присвоено значение
zh_hans: 使用可能未赋值的自动实现的属性
zh_hant: 使用可能未指派的自動實作屬性

# WRN_UseDefViolationRefField
source: Ref field '{0}' should be ref-assigned before use.
fr: Le champ ref « {0} »doit être assigné à ref avant son utilisation.
it: Il campo ref '{0}' deve essere assegnato come riferimento prima dell'uso.
ja: 参照フィールド '{0}' は、使用する前に参照を割り当てる必要があります。
pl: Pole odwołania „{0}” powinno zostać przypisane do odwołania przed użyciem.
pt_br: O campo ref '{0}' deve ser atribuído como referência antes do uso.
ru: Поле ссылки "{0}" должно быть назначено при помощи ref перед использованием.
zh_hans: 应在使用前 Ref 分配 Ref 字段“{0}”。
zh_hant: Ref 欄位 '{0}' 應在使用前重新指派。

# WRN_UseDefViolationRefField_Title
source: Ref field should be ref-assigned before use.
fr: Le champ ref doit être assigné à ref avant son utilisation.
it: Il campo ref deve essere assegnato come riferimento prima dell'uso.
ja: 参照フィールドは、使用する前に参照を割り当てる必要があります。
pl: Pole odwołania należy przypisać do odwołania przed użyciem.
pt_br: O campo ref deve ser atribuído como referência antes do uso.
ru: Поле ссылки должно быть назначено при помощи ref перед использованием.
zh_hans: 应在使用前 Ref 分配 Ref 字段。
zh_hant: Ref 欄位應在使用前重新指派。

# WRN_UseDefViolationThisSupportedVersion
source: The 'this' object is read before all of its fields have been assigned, causing preceding implicit assignments of 'default' to non-explicitly assigned fields.
cs: Objekt this se přečte před přiřazením všech jeho polí, což způsobí, že předchozí implicitní přiřazení default k ne explicitně přiřazeným polím.
fr: L’objet « this » est lu avant que tous ses champs aient été affectés, ce qui entraîne les affectations implicites précédentes de 'default' aux champs non explicitement attribués.
it: L'oggetto 'this' viene letto prima che tutti i relativi campi siano stati assegnati, determinando le assegnazioni implicite precedenti di 'default' ai campi non esplicitamente assegnati.
ja: 'this' オブジェクトは、すべてのフィールドが割り当てられる前に読み取られます。これにより、明示的に割り当てられていないフィールドに対する 'default' の暗黙的な割り当てが先行しています。
pl: Obiekt „this” jest odczytywany przed przypisaniem wszystkich jego pól, co powoduje, że wcześniejsze niejawne przypisania wartości „default” są przypisywane do pól nieprzypisanych jawnie.
pt_br: O objeto 'this' é lido antes que todos os seus campos tenham sido atribuídos, causando atribuições anteriores implícitas de campos 'default' a campos não explicitamente atribuídos.
ru: Объект "this" прочитывается до назначения всех его полей, что приводит к неявному назначению "default" полям, которые не назначены явным образом.
zh_hans: 分配“this”对象的所有字段之前读取该对象，从而导致对未显式分配的字段进行前面的隐式分配“default”。
zh_hant: 在指派 'this' 物件的所有欄位之前，會先讀取該物件，導致先前對未明確指派的欄位進行隱含的 'default' 指派。

# WRN_UseDefViolationThisSupportedVersion_Title
source: The 'this' object is read before all of its fields have been assigned, causing preceding implicit assignments of 'default' to non-explicitly assigned fields.
cs: Objekt this se přečte před přiřazením všech jeho polí, což způsobí, že předchozí implicitní přiřazení default k ne explicitně přiřazeným polím.
fr: L’objet « this » est lu avant que tous ses champs aient été affectés, ce qui entraîne les affectations implicites précédentes de 'default' aux champs non explicitement attribués.
it: L'oggetto 'this' viene letto prima che tutti i relativi campi siano stati assegnati, determinando le assegnazioni implicite precedenti di 'default' ai campi non esplicitamente assegnati.
ja: 'this' オブジェクトは、すべてのフィールドが割り当てられる前に読み取られます。これにより、明示的に割り当てられていないフィールドに対する 'default' の暗黙的な割り当てが先行しています。
pl: Obiekt „this” jest odczytywany przed przypisaniem wszystkich jego pól, co powoduje, że wcześniejsze niejawne przypisania wartości „default” są przypisywane do pól nieprzypisanych jawnie.
pt_br: O objeto 'this' é lido antes que todos os seus campos tenham sido atribuídos, causando atribuições anteriores implícitas de campos 'default' a campos não explicitamente atribuídos.
ru: Объект "this" прочитывается до назначения всех его полей, что приводит к неявному назначению "default" полям, которые не назначены явным образом.
zh_hans: 分配“this”对象的所有字段之前读取该对象，从而导致对未显式分配的字段进行前面的隐式分配“default”。
zh_hant: 在指派 'this' 物件的所有欄位之前，會先讀取該物件，導致先前對未明確指派的欄位進行隱含的 'default' 指派。
