Repository: dotnet/roslyn
Catalog: src/Workspaces/Core/MSBuild/xlf/WorkspaceMSBuildResources.*.xlf
Languages: es, fr, it, ko, pt_br, tr, zh_hans

source: Failed to load solution filter: '{0}'
es: No se pudo cargar el filtro de la solución: "{0}"
fr: Échec du chargement du filtre de solution : '{0}'
it: Non è stato possibile caricare il filtro soluzione: '{0}'
ko: 솔루션 필터 '{0}'을(를) 로드하지 못했습니다.
pt_br: Falha ao carregar o filtro da solução: '{0}'
tr: Çözüm filtresi yüklenemedi: '{0}'
zh_hans: 未能加载解决方案筛选器:“{0}”

source: Found project reference without a matching metadata reference: {0}
es: Se ha encontrado referencia de proyecto sin una referencia de metadatos coincidentes: {0}
fr: Référence de projet sans référence de métadonnées correspondante : {0}
it: È stato trovato un riferimento al progetto senza un riferimento corrispondente ai metadati: {0}
ko: 일치하는 메타데이터 참조가 없는 프로젝트 참조를 찾음: {0}
pt_br: Referência de projeto encontrada sem uma referência de metadados correspondentes: {0}
tr: Proje başvurusu eşleşen meta veriler başvuru olmadan bulundu: {0}
zh_hans: 找到了项目引用但没有匹配的元数据引用: {0}

source: Invalid {0} specified: {1}
es: {0} no válido especificado: {1}
fr: {0} non valide spécifié : {1}
it: {0} non valido specificato: {1}
ko: 잘못된 {0}이(가) 지정됨: {1}
pt_br: Inválido {0} especificado: {1}
tr: Geçersiz {0} belirtildi: {1}
zh_hans: 指定的 {0} 无效: {1}

source: Msbuild failed when processing the file '{0}'
fr: Échec de Msbuild pendant le traitement du fichier '{0}'
it: Errore di MSBuild durante l'elaborazione del file '{0}'
ko: '{0}' 파일 처리 시 Msbuild에서 실패했습니다.
pt_br: Falha do MSBuild ao processar o arquivo '{0}'
tr: '{0}' dosyası işlenirken MSBuild başarısız oldu
zh_hans: 处理文件“{0}”时，Msbuild 失败

source: Msbuild failed when processing the file '{0}' with message: {1}
fr: MSBuild a échoué pendant le traitement du fichier '{0}' avec le message : {1}
it: Errore di MSBuild durante l'elaborazione del file '{0}'. Messaggio: {1}
ko: '{0}' 파일 처리 시 Msbuild에서 실패했습니다. 메시지: {1}
pt_br: Falha do MSBuild ao processar o arquivo '{0}' com a mensagem: {1}
tr: MSBuild mesaj ile '{0}' dosyasını işlerken başarısız oldu: {1}
zh_hans: 处理文件“{0}”时 Msbuild 失败，出现消息: {1}

source: Parameter cannot be null, empty, or contain whitespace.
it: Il parametro non può essere null o vuoto, o contenere spazi vuoti.
ko: 매개 변수는 null이거나 비어 있거나 공백을 포함할 수 없습니다.
pt_br: O parâmetro não pode ser nulo, vazio ou conter espaços em branco.
tr: Parametre, null ve boş değeri alamaz veya boşluk içeremez.
zh_hans: 参数不能为 null、空或包含空格。

source: Path for additional document '{0}' was null}
es: Ruta de acceso del documento adicional "{0}" era null}
fr: Chemin d’accès pour le document supplémentaire « {0} » était nul}
it: Il percorso del documento aggiuntivo '{0}' è Null}
ko: 추가 문서 ‘{0}‘의 경로는 null} 입니다
pt_br: O caminho para o documento adicional '{0}' era nulo}
tr: '{0}' ek belgesinin yolu null değerini almıştı
zh_hans: 其他文件“{0}”的路径为 NULL}

source: Path for document '{0}' was null
es: La ruta de acceso del documento '{0}' era null
fr: Chemin d’accès du document '{0}' était null
it: Il percorso per il documento '{0}' è null
ko: 문서 '{0}'에 대한 경로가 null이었음
pt_br: O caminho para o documento '{0}' era nulo
tr: '{0}' belgesinin yolu null değerindeydi
zh_hans: 文档 "{0}" 的路径为 null

source: Project already added.
es: El proyecto ya se agregó.
fr: Le projet existe déjà.
it: Il progetto è già stato aggiunto.
ko: Project가 이미 추가되었습니다.
pt_br: Projeto já adicionado.
tr: Proje zaten eklenmiş.
zh_hans: 项目已添加。

source: Project does not contain '{0}' target.
it: Il progetto non contiene la destinazione '{0}'.
ko: 프로젝트에 '{0}' 대상이 포함되어 있지 않습니다.
pt_br: O projeto não contém o destino '{0}'.
tr: Proje '{0}' hedefini içermiyor.
zh_hans: 项目不包含“{0}”目标。

source: Found project with the same file path and output path as another project: {0}
es: Se encontró un proyecto con la misma ruta de acceso de archivo y la misma ruta de acceso de salida que otro proyecto: {0}
fr: Projet avec les mêmes chemin de fichier et chemin de sortie que ceux d'un autre projet : {0}
it: È stato trovato un progetto con lo stesso percorso file e lo stesso percorso di output di un altro progetto: {0}
ko: 다른 프로젝트와 파일 경로 및 출력 경로가 같은 프로젝트를 찾았습니다. {0}
pt_br: Foi encontrado um projeto com o mesmo caminho do arquivo e caminho da saída de outro projeto: {0}
tr: Başka bir proje ile aynı dosya yoluna ve çıktı yoluna sahip proje bulundu: {0}
zh_hans: 找到了文件路径和输出路径与另一个项目相同的项目: {0}

source: Duplicate project discovered and skipped: {0}
es: Se detectó un proyecto duplicado y se omitió: {0}
fr: Projet dupliqué découvert et ignoré : {0}
it: Un progetto duplicato è stato rilevato e ignorato: {0}
ko: 중복된 프로젝트가 검색되어 건너뛰었습니다. {0}
pt_br: Projeto duplicado descoberto e ignorado: {0}
tr: Yinelenen proje bulundu ve atlandı: {0}
zh_hans: 发现并跳过了重复项目: {0}

source: Project does not have a path.
es: El proyecto no tiene una ruta de acceso.
fr: Le projet n’a pas de chemin d’accès.
it: Il progetto non dispone di un percorso.
ko: 프로젝트에 경로가 없습니다.
pt_br: O projeto não tem um caminho.
tr: Proje yol içermiyor.
zh_hans: 项目不包含路径。

source: Project path for '{0}' was null
es: La ruta de acceso del proyecto para '{0}' era null
fr: Le chemin d’accès du projet pour '{0}' était null
it: Il percorso del progetto per '{0}' è null
ko: '{0}'에 대한 프로젝트 경로가 null이었음
pt_br: O caminho do projeto para '{0}' era nulo
tr: '{0}' için proje yolu null değerindeydi
zh_hans: "{0}" 的项目路径为 null

source: Unable to add metadata reference '{0}'
es: No se puede agregar la referencia de metadatos '{0}'
fr: Impossible d’ajouter une référence de métadonnées '{0}'
it: Non è possibile aggiungere il riferimento ai metadati '{0}'
ko: 메타데이터 참조 '{0}'을(를) 추가할 수 없음
pt_br: Não foi possível adicionar a referência de metadados '{0}'
tr: '{0}' meta veri başvurusu eklenemiyor
zh_hans: 无法添加元数据文件 '{0}'

source: Unable to find '{0}'
es: No se encuentra "{0}"
fr: '{0}' est introuvable
it: Non è possibile trovare '{0}'
ko: {0}을(를) 찾을 수 없습니다.
pt_br: Não é possível localizar {0}
tr: '{0}' bulunamadı
zh_hans: 找不到“{0}”

source: Unable to find a '{0}' for '{1}'
es: No se encuentra '{0}' para '{1}'
fr: Impossible de trouver un '{0}' pour '{1}'
it: Impossibile trovare un '{0}' per '{1}'
ko: '{1}'에 대한 '{0}'을(를) 찾을 수 없음
pt_br: Não foi possível encontrar um '{0}' para '{1}'
tr: '{1}' için '{0}' bulunamıyor
zh_hans: 找不到 '{1}' 的 {0}

source: Unable to remove metadata reference '{0}'
es: No se puede quitar la referencia de metadatos ' {0} '
fr: Impossible de supprimer la référence de métadonnées '{0}'
it: Non è possibile rimuovere il riferimento ai metadati '{0}'
ko: 메타데이터 참조 '{0}'을(를) 제거할 수 없음
pt_br: Não foi possível remover a referência de metadados '{0}'
tr: '{0}' meta veri başvurusu kaldırılamıyor
zh_hans: 无法删除元数据引用 "{0}"

source: Unresolved metadata reference removed from project: {0}
es: Referencia de metadatos por resolver retirada del proyecto: {0}
fr: Référence de métadonnées non résolues supprimées du projet : {0}
it: Il riferimento a metadati non risolto è stato rimosso dal progetto: {0}
ko: 확인되지 않은 메타데이터 참조가 프로젝트에서 제거됨: {0}
pt_br: Referência de metadados não resolvidos removida do projeto: {0}
tr: Çözümlenmemiş projeden meta verileri başvuru: {0}
zh_hans: 已从项目中删除未解析的元数据引用: {0}

source: MSBuild failed when processing the file '{0}'
es: Error de Msbuild al procesar el archivo "{0}"

source: MSBuild failed when processing the file '{0}' with message: {1}
es: Error de MSBuild al procesar el archivo "{0}" con el mensaje: {1}

source: The build host could not be found at '{0}'
es: No se encontró el host de compilación en '{0}'
