Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Analyzer assembly '{0}' depends on '{1}' but it was not found. Analyzers may not run correctly unless the missing assembly is added as an analyzer reference as well.
it: L'assembly '{0}' dell'analizzatore dipende da '{1}', ma non è stato trovato. Gli assembly potrebbero non funzionare correttamente a meno che l'assembly mancante non venga aggiunto anche come riferimento all'analizzatore.
ja: アナライザー アセンブリ '{0}' は '{1}' に依存しますが、見つかりませんでした。欠落しているアセンブリがアナライザー参照として追加されない限り、アナライザーを正常に実行できない可能性があります。
ru: Сборка анализатора "{0}" зависит от "{1}", но последняя не найдена. Анализаторы могут работать неправильно, если не добавить отсутствующую сборку в качестве ссылки анализатора.

source: Suppress diagnostics
cs: Potlačit diagnostiku
de: Diagnose unterdrücken
es: Suprimir diagnóstico
fr: Supprimer les diagnostics
it: Elimina la diagnostica
ja: 診断を抑制する
ko: 진단 표시 안 함
pl: Pomiń diagnostykę
pt_br: Suprimir diagnósticos
ru: Подавление диагностики
tr: Tanılamayı gizle
zh_hans: 禁止诊断
zh_hant: 隱藏診斷

source: Computing suppressions fix...
cs: Počítá se odebrání potlačení...
de: Behebung von Unterdrückungen wird berechnet...
es: Procesando corrección de supresiones...
fr: Calcul de la correction des suppressions...
it: Calcolo della correzione per le eliminazioni...
ja: 抑制の修正を計算しています...
ko: 비표시 오류(Suppression) 수정을 계산하는 중...
pl: Trwa obliczanie poprawki pominięcia...
pt_br: Calculando correção de supressões...
ru: Вычисление исправления для подавлений...
tr: Gizlemeler düzeltmesi hesaplanıyor...
zh_hans: 正在计算禁止显示修复...
zh_hant: 正在計算隱藏項目修正...

source: Applying suppressions fix...
cs: Používá se odebrání potlačení...
de: Behebung von Unterdrückungen wird angewendet...
es: Aplicando corrección de supresiones...
fr: Application de la correction des suppressions...
it: Applicazione della correzione per le eliminazioni...
ja: 抑制の修正を適用しています...
ko: 비표시 오류(Suppression) 수정을 적용하는 중...
pl: Trwa stosowanie poprawki pominięcia...
pt_br: Aplicando correção de supressões...
ru: Применяется исправление для подавлений...
tr: Gizlemeler düzeltmesi uygulanıyor...
zh_hans: 正在应用禁止显示修复...
zh_hant: 正在套用隱藏項目修正...

source: Remove suppressions
cs: Odebrat potlačení
de: Unterdrückungen entfernen
es: Quitar supresiones
fr: Retirer les suppressions
it: Rimuovi le eliminazioni
ja: 抑制の削除
ko: 비표시 오류(Suppression) 제거
pl: Usuń pominięcia
pt_br: Remover supressões
ru: Удалить подавления
tr: Gizlemeleri kaldır
zh_hans: 删除禁止显示
zh_hant: 移除隱藏項目

source: Computing remove suppressions fix...
cs: Počítá se oprava formou odebrání potlačení...
de: Entfernen der Behebung von Unterdrückungen wird berechnet...
es: Procesando corrección para quitar supresiones...
fr: Calcul de la correction de retrait des suppressions...
it: Calcolo della correzione per la rimozione delle eliminazioni...
ja: 抑制の削除の修正を計算しています...
ko: 비표시 오류(Suppression) 제거 수정을 계산하는 중...
pl: Trwa obliczanie poprawki usuwania pominięcia...
pt_br: Calculando a correção de remoção de supressões...
ru: Вычисление исправления для удаления подавлений...
tr: Gizlemeleri kaldırma düzeltmesi hesaplanıyor...
zh_hans: 正在计算删除禁止显示修复...
zh_hant: 正在計算移除隱藏項目修正...

source: Applying remove suppressions fix...
cs: Používá se oprava formou odebrání potlačení...
de: Entfernen der Behebung von Unterdrückungen wird angewendet...
es: Aplicando corrección para quitar supresiones...
fr: Application de la correction de retrait des suppressions...
it: Applicazione della correzione per la rimozione delle eliminazioni...
ja: 抑制の削除の修正を適用しています...
ko: 비표시 오류(Suppression) 제거 수정을 적용하는 중...
pl: Trwa stosowanie poprawki usuwania pominięcia...
pt_br: Aplicando correção de supressões de remoção...
ru: Применяется исправление для удаления подавлений...
tr: Gizlemeleri kaldırma düzeltmesi uygulanıyor...
zh_hans: 正在应用删除禁止显示修复...
zh_hant: 正在套用移除隱藏項目修正...

source: This workspace only supports opening documents on the UI thread.
cs: Tento pracovní prostor podporuje otevírání dokumentů jenom ve vlákně uživatelského rozhraní.
de: Dieser Arbeitsbereich unterstützt nur das Öffnen von Dokumenten für den UI-Thread.
es: El área de trabajo solo permite abrir documentos en el subproceso de interfaz de usuario.
fr: Cet espace de travail prend en charge uniquement l'ouverture de documents sur le thread d'interface utilisateur.
it: Questa area di lavoro supporta l'apertura di documenti solo nel thread dell'interfaccia utente.
ja: このワークスペースでは、UI スレッドでドキュメントを開くことしかできません。
ko: 이 작업 영역에서는 UI 스레드에서 문서를 여는 것만 지원합니다.
pl: Ten obszar roboczy obsługuje tylko otwieranie dokumentów w wątku interfejsu użytkownika.
pt_br: Este workspace só dá suporte à abertura de documentos no thread da IU.
ru: Эта рабочая область поддерживает открытие документов только в потоке пользовательского интерфейса.
tr: Bu çalışma alanı, belgelerin yalnızca kullanıcı arabirimi iş parçacığında açılmasını destekler.
zh_hans: 此工作区仅支持在 UI 线程上打开文档。
zh_hant: 此工作區僅支援在 UI 執行緒上開啟文件。

source: This workspace does not support updating Visual Basic parse options.
cs: Tento pracovní prostor nepodporuje aktualizaci možností analýzy jazyka Visual Basic.
de: Das Aktualisieren von Visual Basic-Analyseoptionen wird von diesem Arbeitsbereich nicht unterstützt.
es: Esta área de trabajo no admite la actualización de opciones de análisis de Visual Basic.
fr: Cet espace de travail ne prend pas en charge la mise à jour des options d'analyse Visual Basic.
it: Quest'area di lavoro non supporta l'aggiornamento delle opzioni di analisi di Visual Basic.
ja: このワークスペースでは、Visual Basic の解析オプションの更新はサポートされていません。
ko: 이 작업 영역은 Visual Basic 구문 분석 옵션 업데이트를 지원하지 않습니다.
pl: Ten obszar roboczy nie obsługuje aktualizowania opcji analizy programu Visual Basic.
pt_br: Este workspace não dá suporte à atualização das opções de análise do Visual Basic.
ru: Эта рабочая область не поддерживает обновление параметров синтаксического анализа Visual Basic.
tr: Bu çalışma alanı Visual Basic ayrıştırma seçeneklerinin güncelleştirilmesini desteklemiyor.
zh_hans: 此工作区不支持更新 Visual Basic 分析选项。
zh_hant: 此工作區不支援更新 Visual Basic 剖析選項。

source: Synchronize {0}
it: Sincronizza {0}
ja: {0} を同期する
ru: Синхронизировать {0}

source: Synchronizing with {0}...
cs: Probíhá synchronizace s {0}...
de: Synchronisierung mit "{0}" wird durchgeführt...
es: Sincronizando con {0}...
fr: Synchronisation avec {0}...
it: Sincronizzazione con {0}...
ja: {0} と同期しています...
ko: {0}과(와) 동기화하는 중...
pl: Trwa synchronizowanie z elementem {0}...
pt_br: Sincronizando a {0}...
ru: Синхронизация с {0}...
tr: {0} ile eşitleniyor...
zh_hans: 正在与 {0} 同步...
zh_hant: 正在與 {0} 同步...

source: Visual Studio has suspended some advanced features to improve performance.
cs: Sada Visual Studio pozastavila některé pokročilé funkce, aby se zvýšil výkon.
de: Visual Studio hat einige erweiterte Features angehalten, um die Leistung zu verbessern.
es: Visual Studio suspendió algunas características avanzadas para mejorar el rendimiento.
fr: Visual Studio a interrompu certaines fonctionnalités avancées pour améliorer les performances.
it: Per migliorare le prestazioni, Visual Studio ha sospeso alcune funzionalità avanzate.
ja: Visual Studio は、パフォーマンス向上のため一部の高度な機能を中断しました。
ko: Visual Studio에서 성능 향상을 위해 일부 고급 기능을 일시 중단했습니다.
pt_br: O Visual Studio suspendeu alguns recursos avançados para melhorar o desempenho.
ru: Visual Studio временно отключила некоторые дополнительные возможности, чтобы повысить производительность.
tr: Visual Studio, performansı artırmak için bazı gelişmiş özellikleri askıya aldı.

source: Installing '{0}'
cs: Instaluje se {0}.
de: "{0}" wird installiert
es: Instalando "{0}"
fr: Installation de '{0}'
it: Installazione di '{0}'
ja: {0}' をインストールしています
ko: '{0}' 설치 중
pl: Instalowanie składnika „{0}”
pt_br: Instalando '{0}'
ru: Идет установка "{0}"
tr: '{0}' yükleniyor
zh_hans: 正在安装“{0}”
zh_hant: 正在安裝 '{0}'

source: Installing '{0}' completed
cs: Instalace {0} je hotová.
de: Installation von "{0}" abgeschlossen
es: Instalación de "{0}" completada
fr: Installation de '{0}' terminée
it: L'installazione di '{0}' è stata completata
ja: {0}' のインストールが完了しました
ko: '{0}' 설치 완료
pl: Zakończono instalowanie składnika „{0}”
pt_br: Instalação de '{0}' concluída
ru: Установка "{0}" завершена
tr: '{0}' yüklendi
zh_hans: 安装“{0}”已完成
zh_hant: 已完成安裝 '{0}'

# Package_install_failed_colon_0
source: Package install failed: {0}
cs: Nepovedlo se nainstalovat balíček: {0}
de: Fehler bei der Paketinstallation: {0}
es: No se pudo instalar el paquete: {0}
fr: Échec de l'installation du package : {0}
it: L'installazione del pacchetto non è riuscita: {0}
ja: パッケージをインストールできませんでした: {0}
ko: 패키지 설치 실패: {0}
pl: Instalowanie pakietu nie powiodło się: {0}
pt_br: Falha na instalação do pacote: {0}
ru: Сбой при установке пакета: {0}
tr: Paket yüklenemedi: {0}
zh_hans: 包安装失败: {0}
zh_hant: 套件安裝失敗: {0}

# Unknown2
source: <Unknown>
cs: <Neznámý>
de: <Unbekannt>
es: <Desconocido>
fr: <Inconnu>
it: <Sconosciuto>
ja: <不明>
ko: <알 수 없음>
pl: <Nieznany>
pt_br: <Desconhecido>
ru: <нет данных>
tr: <Bilinmiyor>
zh_hans: <未知>
zh_hant: <未知>

source: No
cs: Ne
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
tr: Hayır

source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
tr: Evet

source: Choose a Symbol Specification and a Naming Style.
it: Scegliere una specifica simboli e uno stile di denominazione.
ja: シンボル仕様と名前付けスタイルを選択します。
ru: Выберите спецификацию символов и стиль именования.

source: Enter a title for this Naming Rule.
it: Immettere un titolo per questa regola di denominazione.
ja: この名前付けルールのタイトルを入力してください。
ru: Введите название для этого правила именования.

source: Enter a title for this Naming Style.
cs: Zadejte název tohoto stylu pojmenování.
de: Geben Sie einen Titel für diesen Benennungsstil ein.
es: Escriba un título para el estilo de nomenclatura.
fr: Entrez un titre pour ce style de nommage.
it: Immettere un titolo per questo stile di denominazione.
ja: この名前付けスタイルのタイトルを入力してください。
ko: 이 명명 스타일의 제목을 입력하세요.
pl: Wprowadź tytuł dla tego stylu nazewnictwa.
pt_br: Insira um título para esse Estilo de Nomenclatura.
ru: Введите название для этого стиля именования.
tr: Bu Adlandırma Stili için bir başlık girin.
zh_hans: 为此命名样式输入标题。
zh_hant: 輸入此命名樣式的標題。

source: Enter a title for this Symbol Specification.
it: Immettere un titolo per questa specifica simboli.
ja: このシンボル仕様のタイトルを入力してください。
ru: Введите название для этой спецификации символа.

source: Accessibilities (can match any)
cs: Přístupnosti (můžou odpovídat čemukoli)
de: Zugriffsebenen (beliebige Übereinstimmung)
es: Accesibilidades (puede coincidir con cualquiera)
fr: Niveaux d'accès (peut correspondre à n'importe quel élément)
it: Livello di accesso (qualsiasi corrispondenza)
ja: アクセシビリティ (任意のレベルと一致できます)
ko: 접근성(임의 항목과 일치 가능)
pl: Poziomy dostępu (mogą być zgodne z dowolnym elementem)
pt_br: Acessibilidades (podem corresponder a qualquer uma)
ru: Модификаторы доступности (соответствие любому)
tr: Erişim düzeyleri (herhangi biriyle eşleşebilir)
zh_hans: 可访问性(可任意匹配)
zh_hant: 存取範圍 (可符合任何項目)

# Capitalization_colon
source: Capitalization:
cs: Velká písmena:
de: Großschreibung:
es: Uso de mayúsculas:
fr: Mise en majuscules :
it: Maiuscole/minuscole:
ja: 大文字化:
ko: 대문자 표시:
pl: Wielkie litery:
pt_br: Uso de maiúsculas:
ru: Написание прописными буквами:
tr: Büyük Harfe Çevirme:
zh_hans: 大写:
zh_hant: 大小寫:

source: all lower
cs: všechna malá
de: Nur Kleinbuchstaben
es: todo en minúsculas
fr: tout en minuscules
it: tutte minuscole
ja: すべて小文字(all lower)
ko: 모두 소문자(all lower)
pl: wszystko małymi literami
pt_br: todas minúsculas
ru: все строчные
tr: tümü küçük harf
zh_hans: 全部小写(all lower)
zh_hant: 全部小寫

source: ALL UPPER
cs: VŠECHNA VELKÁ
de: Nur Großbuchstaben
es: TODO EN MAYÚSCULAS
fr: TOUT EN MAJUSCULES
it: TUTTE MAIUSCOLE
ja: すべて大文字(ALL UPPER)
ko: 모두 대문자(ALL UPPER)
pl: WSZYSTKO WIELKIMI LITERAMI
pt_br: TODAS MAIÚSCULAS
ru: ВСЕ ПРОПИСНЫЕ
tr: TÜMÜ BÜYÜK HARF
zh_hans: 全部大写(ALL UPPER)
zh_hant: 全部大寫

source: camel Case Name
cs: Název ve stylu camelCase
de: Name in CamelCase
es: Nombre en camel Case
fr: Nom en casse mixte
it: Nome notazione Camel
ja: キャメル ケース名
ko: 카멜 대/소문자 이름
pl: Nazwa z wyrazami pisanymi wielkimi literami, pierwszy z małej
pt_br: nome Em Minúsculas Concatenadas
ru: Название в "Верблюжьем" стиле c первой прописной буквой
tr: orta Harfleri Büyük Ad
zh_hans: 驼峰式大小写命名
zh_hant: 駝峰式大小寫名稱

source: First word upper
cs: První slovo velkými písmeny
de: Erstes Wort in Großschreibung
es: Primera palabra en mayúsculas
fr: Premier mot en majuscules
it: Prima lettera maiuscola
ja: 先頭文字を大文字にする
ko: 첫 번째 단어 대문자
pl: Pierwszy wyraz wielką literą
pt_br: Primeira palavra com maiúsculas
ru: Первое слово с прописной буквы
tr: İlk sözcük büyük harfle
zh_hans: 第一个单词大写(First word upper)
zh_hant: 首字大寫

source: Pascal Case Name
cs: Název ve stylu JazykaPascal
de: Name in Pascal-Schreibweise
es: Nombre en Pascal Case
fr: Nom en casse Pascal
it: Nome notazione Pascal
ja: パスカル ケース名
ko: 파스칼식 대/소문자 이름
pl: Nazwa z wyrazami pisanymi wielkimi literami, pierwszy z wielkiej
pt_br: Nome do Caso Pascal
ru: Название в регистре Pascal
tr: Baş Harfleri Büyük Ad
zh_hans: 帕斯卡式大小写命名
zh_hant: Pascal 命名法名稱

# Severity_colon
source: Severity:
it: Gravità:
ja: 重要度:
ru: Серьезность:

source: Modifiers (must match all)
cs: Modifikátory (můžou odpovídat libovolným)
de: Modifizierer (muss mit allen übereinstimmen)
es: Modificadores (deben coincidir todos)
fr: Modificateurs (doivent correspondre à tous les éléments)
it: Modificatori (corrispondenza esatta)
ja: 修飾子 (すべてと一致する必要があります)
ko: 한정자(모두와 일치해야 함)
pl: Modyfikatory (muszą być zgodne ze wszystkimi elementami)
pt_br: Modificadores (devem corresponder a todos)
ru: Модификаторы (должны соответствовать всему)
tr: Değiştiriciler (tümüyle eşleşmelidir)
zh_hans: 修饰符(必须全部匹配)
zh_hant: 修飾元 (必須符合所有項目)

# Name_colon2
source: Name:
it: Nome:
ja: 名前:
ru: Название:

source: Naming Rule
cs: Pravidlo pojmenování
de: Benennungsregel
es: Regla de nomenclatura
fr: Règle de nommage
it: Regola di denominazione
ja: 名前付けルール
ko: 명명 규칙
pl: Reguła nazewnictwa
pt_br: Regra de Nomenclatura
ru: Правило именования
tr: Adlandırma Kuralı
zh_hans: 命名规则
zh_hant: 命名規則

source: Naming Style
cs: Styl pojmenování
de: Benennungsstil
es: Estilo de nomenclatura
fr: Style de nommage
it: Stile di denominazione
ja: 名前付けスタイル
ko: 명명 스타일
pl: Styl nazewnictwa
pt_br: Estilo de Nomenclatura
ru: Стиль именования
tr: Adlandırma Stili
zh_hans: 命名样式
zh_hant: 命名樣式

# Naming_Style_colon
source: Naming Style:
it: Stile di denominazione:
ja: 名前付けスタイル:
ru: Стиль именования:

source: Naming Rules allow you to define how particular sets of symbols should be named and how incorrectly-named symbols should be handled.
it: Le regole di denominazione consentono di definire le modalità di denominazione di set di simboli specifici e di gestione dei simboli con nomi errati.
ja: 名前付けルールを使用すると、特定のシンボル セットの名前付け方法と、正しく名前付けされていないシンボルの処理方法を定義できます。
ru: Правила именования позволяют определить, как должны именоваться определенные наборы символов и как должны обрабатываться неправильно названные символы.

source: The first matching top-level Naming Rule is used by default when naming a symbol, while any special cases are handled by a matching child rule.
it: Quando si assegna un nome a un simbolo, per impostazione predefinita viene usata la prima regola di denominazione corrispondente di primo livello, mentre eventuali casi speciali vengono gestiti da una regola figlio corrispondente.
ja: シンボルに名前を付けるときには、最初に一致するトップレベルの名前付けルールが既定で使用されますが、特殊なケースの場合は一致する子ルールによって処理されます。
ru: По умолчанию при именовании символа используется первое соответствующее правило именования верхнего уровня, а все особые случаи обрабатываются соответствующим дочерним правилом.

# Naming_Style_Title_colon
source: Naming Style Title:
cs: Název stylu pojmenování:
de: Titel des Benennungsstils:
es: Título de estilo de nomenclatura:
fr: Titre du style de nommage :
it: Titolo per stile di denominazione:
ja: 名前付けスタイルのタイトル:
ko: 명명 스타일 제목:
pl: Tytuł stylu nazewnictwa:
pt_br: Título do Estilo de Nomenclatura:
ru: Название стиля именования:
tr: Adlandırma Stili Başlığı:
zh_hans: 命名样式标题:
zh_hant: 命名樣式標題:

# Parent_Rule_colon
source: Parent Rule:
it: Regola padre:
ja: 親規則:
ru: Родительское правило:

# Required_Prefix_colon
source: Required Prefix:
cs: Požadovaná předpona:
de: Erforderliches Präfix:
es: Prefijo requerido:
fr: Préfixe obligatoire :
it: Prefisso obbligatorio:
ja: 必要なプレフィックス:
ko: 필수 접두사:
pl: Wymagany prefiks:
pt_br: Prefixo Necessário:
ru: Необходимый префикс:
tr: Gerekli Ön Ek:
zh_hans: 必填前缀:
zh_hant: 必要前置詞:

# Required_Suffix_colon
source: Required Suffix:
cs: Požadovaná přípona:
de: Erforderliches Suffix:
es: Sufijo requerido:
fr: Suffixe obligatoire :
it: Suffisso obbligatorio:
ja: 必要なサフィックス:
ko: 필수 접미사:
pl: Wymagany sufiks:
pt_br: Sufixo Necessário:
ru: Необходимый суффикс:
tr: Gerekli Sonek:
zh_hans: 必填后缀:
zh_hant: 必要後置詞:

# Sample_Identifier_colon
source: Sample Identifier:
cs: Ukázkový identifikátor:
de: Stichprobenbezeichner:
es: Identificador de ejemplo:
fr: Exemple d'identificateur :
it: Identificatore di esempio:
ja: サンプル識別子:
ko: 샘플 식별자:
pl: Identyfikator przykładowy:
pt_br: Identificador de Amostra:
ru: Пример идентификатора:
tr: Örnek Tanımlayıcı:
zh_hans: 示例标识符:
zh_hant: 範例識別碼:

source: Symbol Kinds (can match any)
cs: Druhy symbolů (můžou odpovídat čemukoli)
de: Symbolarten (beliebige Übereinstimmung)
es: Tipos de símbolo (pueden coincidir con cualquiera)
fr: Genres de symboles (peuvent correspondre à n'importe quel élément)
it: Tipi di simboli (qualsiasi corrispondenza)
ja: シンボルの種類 (任意のものと一致できます)
ko: 기호 종류(임의 항목과 일치 가능)
pl: Rodzaje symboli (mogą być zgodne z dowolnym elementem)
pt_br: Tipos de Símbolo (podem corresponder a qualquer um)
ru: Виды символов (соответствие любому)
tr: Sembol Türleri (tümüyle eşleşebilir)
zh_hans: 符号种类(可任意匹配)
zh_hant: 符號種類 (可符合任何項目)

source: Symbol Specification
cs: Specifikace symbolů
de: Symbolspezifikation
es: Especificación de símbolo
fr: Spécification du symbole
it: Specifica simboli
ja: シンボル仕様
ko: 기호 사양
pl: Specyfikacja symbolu
pt_br: Especificação do Símbolo
ru: Спецификация символа
tr: Sembol Belirtimi
zh_hans: 符号规范
zh_hant: 符號規格

# Symbol_Specification_colon
source: Symbol Specification:
it: Specifica simboli:
ja: シンボル仕様:
ru: Спецификация символа:

# Symbol_Specification_Title_colon
source: Symbol Specification Title:
cs: Název specifikace symbolů:
de: Titel der Symbolspezifikation:
es: Título de especificación de símbolo:
fr: Titre de la spécification du symbole :
it: Titolo specifica simboli:
ja: シンボル仕様のタイトル:
ko: 기호 사양 제목:
pl: Tytuł specyfikacji symbolu:
pt_br: Título da Especificação do Símbolo:
ru: Название спецификации символа:
tr: Sembol Belirtimi Başlığı:
zh_hans: 符号规范标题:
zh_hant: 符號規格標題:

# Word_Separator_colon
source: Word Separator:
cs: Oddělovač slov:
de: Worttrennzeichen:
es: Separador de palabras:
fr: Séparateur de mots :
it: Separatore parole:
ja: 単語の区切り記号:
ko: 단어 구분 기호:
pl: Separator wyrazów:
pt_br: Separador de Palavras:
ru: Разделитель слов:
tr: Sözcük Ayırıcı:
zh_hans: 单词分隔符:
zh_hant: 字組分隔符號:

source: example
cs: příklad
es: ejemplo
fr: exemple
it: esempio
ja: 例
ko: 예
pt_br: exemplo
ru: пример

source: identifier
cs: identifikátor
es: identificador
fr: identificateur
it: identificatore
ja: 識別子
ko: 식별자
pt_br: identificador
ru: идентификатор

source: Install '{0}'
cs: Nainstalovat {0}
de: "{0}" installieren
es: Instalar "{0}"
fr: Installer '{0}'
it: Installa '{0}'
ja: {0}' をインストールする
ko: '{0}' 설치
pl: Zainstaluj składnik „{0}”
pt_br: Instalar '{0}'
ru: Установить "{0}"
tr: '{0}' öğesini yükle
zh_hans: 安装“{0}”
zh_hant: 安裝 '{0}'

source: Uninstalling '{0}'
cs: Odinstalovává se {0}
de: "{0}" wird deinstalliert
es: Desinstalando "{0}"
fr: Désinstallation de '{0}'
it: Disinstallazione di '{0}'
ja: {0}' アンインストールしています
ko: '{0}' 제거 중
pl: Odinstalowywanie składnika „{0}”
pt_br: Desinstalando '{0}'
ru: Идет удаление "{0}"
tr: '{0}' kaldırılıyor
zh_hans: 正在卸载“{0}”
zh_hant: 正在解除安裝 '{0}'

source: Uninstalling '{0}' completed
cs: Odinstalace {0} se dokončila.
de: Deinstallation von "{0}" abgeschlossen
es: Deinstalación de "{0}" completada
fr: Désinstallation de '{0}' terminée
it: La disinstallazione di '{0}' è stata completata
ja: {0}' のアンインストールが完了しました
ko: '{0}' 제거 완료
pl: Zakończono odinstalowywanie składnika „{0}”
pt_br: Desinstalação do '{0}' concluída
ru: Удаление "{0}" завершено.
tr: '{0}' kaldırıldı
zh_hans: 卸载“{0}”已完成
zh_hant: 已完成將 '{0}' 解除安裝

source: Uninstall '{0}'
cs: Odinstalovat {0}
de: "{0}" deinstallieren
es: Desinstalar "{0}"
fr: Désinstaller '{0}'
it: Disinstalla '{0}'
ja: {0}' をアンインストールする
ko: '{0}' 제거
pl: Odinstaluj składnik „{0}”
pt_br: Desinstalar '{0}'
ru: Удалить "{0}"
tr: '{0}' öğesini kaldır
zh_hans: 卸载“{0}”
zh_hant: 將 '{0}' 解除安裝

# Package_uninstall_failed_colon_0
source: Package uninstall failed: {0}
cs: Nepovedlo se odinstalovat balíček: {0}
de: Fehler bei der Paketdeinstallation: {0}
es: No se pudo desinstalar el paquete: {0}
fr: Échec de la désinstallation du package : {0}
it: La disinstallazione del pacchetto non è riuscita: {0}
ja: パッケージをアンインストールできませんでした: {0}
ko: 패키지 제거 실패: {0}
pl: Odinstalowywanie pakietu nie powiodło się: {0}
pt_br: Falha na desinstalação do pacote: {0}
ru: Сбой при удалении пакета: {0}
tr: Paket kaldırılamadı: {0}
zh_hans: 包卸载失败: {0}
zh_hant: 套件解除安裝失敗: {0}

source: Error encountered while loading the project. Some project features, such as full solution analysis for the failed project and projects that depend on it, have been disabled.
it: Si è verificato un errore durante il caricamento del progetto. Alcune funzionalità del progetto, come l'analisi della soluzione completa per il progetto in errore e i progetti che dipendono da essa, sono state disabilitate.
ja: プロジェクトの読み込み中にエラーが発生しました。失敗したプロジェクトとそれに依存するプロジェクトの完全なソリューション解析など、一部のプロジェクト機能が使用できなくなりました。
ru: Произошла ошибка при загрузке проекта. Некоторые возможности проекта, например полный анализ решения для неработоспособного проекта и зависящих от него проектов, были отключены.

source: Project loading failed.
it: Il caricamento del progetto non è riuscito.
ja: プロジェクトの読み込みに失敗しました。
ru: Сбой при загрузке проекта.

source: To see what caused the issue, please try below. 1. Close Visual Studio 2. Open a Visual Studio Developer Command Prompt 3. Set environment variable “TraceDesignTime” to true (set TraceDesignTime=true) 4. Delete .vs directory/.suo file 5. Restart VS from the command prompt you set the environment variable (devenv) 6. Open the solution 7. Check '{0}' and look for the failed tasks (FAILED)
it: Per individuare la causa del problema, provare a eseguire le operazioni seguenti. 1. Chiudere Visual Studio 2. Aprire un prompt dei comandi per gli sviluppatori di Visual Studio 3. Impostare la variabile di ambiente "TraceDesignTime" su true (TraceDesignTime=true) 4. Eliminare la directory .vs/il file .suo 5. Riavviare Visual Studio dal prompt dei comandi da cui è stata impostata la variabile di ambiente (devenv) 6. Aprire la soluzione 7. Controllare '{0}' e cercare le attività non riuscite (FAILED)
ja: この問題の原因を確認するには、次をお試しください。 1. Visual Studio を閉じる 2. Visual Studio 開発者コマンド プロンプトを開く 3. 環境変数 "TraceDesignTime" を true に設定する (set TraceDesignTime=true) 4. .vs directory/.suo ファイルを削除する 5. 環境変数 (devenv) を設定したコマンド プロンプトから VS を再起動する 6. ソリューションを開く 7. '{0}' を確認し、失敗したタスク (FAILED) を探す
ru: Чтобы узнать, что вызвало проблему, попробуйте сделать следующее. 1. Закройте Visual Studio. 2. Откройте командную строку разработчика Visual Studio. 3. Присвойте переменной "TraceDesignTime" значение true (set TraceDesignTime=true). 4. Удалите файл ".vs directory/.suo". 5. Перезапустите VS из командной строки, в которой вы присвоили значение переменной среды (devenv). 6. Откройте решение. 7. Проверьте "{0}" и найдите задачи, которые завершились сбоем (FAILED).
