Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Show hints for lambda parameter types
cs: Zobrazit nápovědy pro typy parametrů lambda
de: Hinweise für Lambda-Parametertypen anzeigen
es: Mostrar sugerencias para los tipos de parámetros lambda
fr: Afficher les indicateurs pour les types de paramètre lambda
ko: 람다 매개 변수 형식에 대한 힌트 표시
pl: Pokaż wskazówki dla typów parametrów funkcji lambda
pt_br: Mostrar as dicas para os tipos de parâmetro lambda
ru: Отображать подсказки для типов лямбда-параметров
tr: Lambda parametre türleri için ipuçlarını göster
zh_hans: 显示 lambda 参数类型的提示
zh_hant: 顯示 Lambda 參數類型的提示

source: Show hints for literals
cs: Zobrazit nápovědy pro literály
de: Hinweise für Literale anzeigen
es: Mostrar sugerencias para los literales
fr: Afficher les indicateurs pour les littéraux
ko: 리터럴에 대한 힌트 표시
pl: Pokaż wskazówki dla literałów
pt_br: Mostrar as dicas para os literais
ru: Отображать подсказки для литералов
tr: Sabit değerler için ipuçlarını göster
zh_hans: 显示文本提示
zh_hant: 顯示常值的提示

source: Show hints for variables with inferred types
cs: Zobrazit nápovědy pro proměnné s odvozenými typy
de: Hinweise für Variablen mit abgeleiteten Typen anzeigen
es: Mostrar sugerencias para las variables con tipos inferidos
fr: Afficher les indicateurs pour les variables ayant des types déduits
ko: 유추된 형식의 변수에 대한 힌트 표시
pl: Pokaż wskazówki dla zmiennych z wnioskowanymi typami
pt_br: Mostrar as dicas para as variáveis com tipos inferidos
ru: Отображать подсказки для переменных с выводимыми типами
tr: Çıkarsanan türlere sahip değişkenler için ipuçlarını göster
zh_hans: 显示具有推断类型的变量的提示
zh_hant: 顯示有推斷類型之變數的提示

source: Show inheritance margin
cs: Zobrazit míru dědičnosti
de: Vererbungsrand anzeigen
es: Mostrar margen de herencia
fr: Afficher la marge d’héritage
ko: 상속 여백 표시
pl: Pokaż margines dziedziczenia
pt_br: Mostrar margem de herança
ru: Показать границу наследования
tr: Devralma boşluğunu göster
zh_hans: 显示继承边距
zh_hant: 顯示繼承邊界

source: Skip analyzers for implicitly triggered builds
cs: Přeskočit analyzátory pro implicitně aktivované buildy
de: Analysetools für implizit ausgelöste Builds überspringen
es: Omitir analizadores para compilaciones desencadenadas implícitamente
fr: Ignorer les analyseurs pour les builds déclenchées implicitement
ko: 암시적으로 트리거된 빌드에 대한 분석기 건너뛰기
pl: Pomiń analizatory dla niejawnie wyzwalanych kompilacji
pt_br: Ignorar analisadores para compilações acionadas implicitamente
ru: Пропускать анализаторы для неявно запускаемых сборок
tr: Dolaylı olarak tetiklenen derlemeler için çözümleyicileri atla
zh_hans: 跳过隐式触发生成的分析器
zh_hant: 跳過隱含已觸發組建的分析器

source: Some color scheme colors are being overridden by changes made in the Environment > Fonts and Colors options page. Choose `Use Defaults` in the Fonts and Colors page to revert all customizations.
cs: Některé barvy barevného schématu se přepsaly změnami na stránce možností Prostředí > Písma a barvy. Pokud chcete zrušit všechna přizpůsobení, vyberte na stránce Písma a barvy možnost Použít výchozí.
de: Einige Farbschemafarben werden durch Änderungen überschrieben, die auf der Optionsseite "Umgebung" > "Schriftarten und Farben" vorgenommen wurden. Wählen Sie auf der Seite "Schriftarten und Farben" die Option "Standardwerte verwenden" aus, um alle Anpassungen rückgängig zu machen.
es: Algunos de los colores de la combinación se reemplazan por los cambios realizados en la página de opciones de Entorno > Fuentes y colores. Elija "Usar valores predeterminados" en la página Fuentes y colores para revertir todas las personalizaciones.
fr: Certaines couleurs du modèle de couleurs sont substituées à la suite des changements apportés dans la page d'options Environnement > Polices et couleurs. Choisissez Utiliser les valeurs par défaut dans la page Polices et couleurs pour restaurer toutes les personnalisations.
ja: 一部の配色パターンの色は、[環境] > [フォントおよび色] オプション ページで行われた変更によって上書きされます。[フォントおよび色] オプション ページで [既定値を使用] を選択すると、すべてのカスタマイズが元に戻ります。
ko: 색 구성표의 일부 색이 [환경] > [글꼴 및 색] 옵션 페이지에서 변경한 내용에 따라 재정의됩니다. 모든 사용자 지정을 되돌리려면 [글꼴 및 색] 페이지에서 '기본값 사용'을 선택하세요.
pt_br: Algumas cores do esquema de cores estão sendo substituídas pelas alterações feitas na página de Ambiente > Opções de Fontes e Cores. Escolha 'Usar Padrões' na página Fontes e Cores para reverter todas as personalizações.
ru: Некоторые цвета цветовой схемы переопределяются изменениями, сделанными на странице "Среда" > "Шрифты и цвета". Выберите "Использовать значения по умолчанию" на странице "Шрифты и цвета", чтобы отменить все настройки.
tr: Bazı renk düzeni renkleri, Ortam > Yazı Tipleri ve Renkler seçenek sayfasında yapılan değişiklikler tarafından geçersiz kılınıyor. Tüm özelleştirmeleri geri döndürmek için Yazı Tipleri ve Renkler sayfasında `Varsayılanları Kullan` seçeneğini belirleyin.

source: Sort usings
ru: Сортировать директивы using

source: Stack Trace
cs: Trasování zásobníku
de: Stapelüberwachung
es: Seguimiento de la pila
fr: Trace de la pile
ko: 스택 추적
pl: Śledzenie stosu
pt_br: Rastreamento de pilha
ru: Трассировка стека
tr: Yığın İzleme
zh_hans: 堆栈跟踪
zh_hant: 堆疊追蹤

source: Stack Trace Explorer
cs: Průzkumník trasování zásobníku
es: Explorador de seguimiento de pila
fr: Explorateur de traces de pile
ko: 스택 추적 탐색기
pl: Eksplorator śladu stosu
pt_br: Explorador de Rastreamento de Pilha
ru: Обозреватель трассировки стека
tr: Yığın İzlemesi Gezgini
zh_hans: 堆栈跟踪资源管理器
zh_hant: 堆疊追蹤總管

source: Stack Trace {0}
cs: Trasování zásobníku: {0}
de: Stapelüberwachung {0}
es: Seguimiento de la pila {0}
fr: Trace de la pile {0}
ko: 스택 추적 {0}개
pl: Ślad stosu {0}
pt_br: Rastreamento de Pilha{0}
ru: Трассировка стека {0}
tr: Yığın İzleme {0}
zh_hans: 堆栈跟踪: {0}
zh_hant: 堆疊追蹤 {0}

source: Suggestion
cs: Návrh
de: Vorschlag
es: Sugerencia
ko: 제안
pt_br: Sugestão
ru: Рекомендация
tr: Öneri

source: Suppress hints when argument matches parameter name
cs: Potlačit nápovědy, když argument odpovídá názvu parametru
de: Hinweise unterdrücken, wenn das Argument mit dem Namen des Parameters übereinstimmt
es: Suprimir las sugerencias cuando el argumento coincide con el nombre del parámetro
fr: Supprimer les conseils lorsque l'argument correspond au nom du paramètre
ko: 인수가 매개 변수 이름과 일치하는 경우 힌트 표시 안 함
pl: Pomiń wskazówki, gdy argument pasuje do nazwy parametru
pt_br: Suprimir as dicas quando o argumento corresponder ao nome do parâmetro
ru: Скрывать подсказки, когда аргумент соответствует имени параметра
tr: Bağımsız değişken parametre adıyla eşleştiğinde ipuçlarını bastır
zh_hans: 当参数与参数名称匹配时抑制提示
zh_hant: 當引數符合參數名稱時抑制提示

source: Suppress hints when parameter name matches the method's intent
cs: Potlačit nápovědy, když název parametru odpovídá záměru metody
de: Hinweise unterdrücken, wenn der Parametername mit der Methodenabsicht übereinstimmt
es: Suprimir las sugerencias cuando el nombre del parámetro coincida con la intención del método
fr: Supprimer les indicateurs quand le nom de paramètre correspond à l'intention de la méthode
ko: 매개 변수 이름이 메서드의 의도와 일치하는 경우 힌트 표시 안 함
pl: Pomiń wskazówki, gdy nazwa parametru pasuje do intencji metody
pt_br: Suprimir as dicas quando o nome do parâmetro corresponder à intenção do método
ru: Скрывать подсказки, если имя параметра соответствует намерению метода.
tr: Parametre adı metodun hedefi ile eşleştiğinde ipuçlarını gizle
zh_hans: 当参数名称与方法的意图匹配时禁止显示提示
zh_hant: 當參數名稱符合方法的意圖時，不出現提示

source: Suppress hints when parameter names differ only by suffix
cs: Potlačit nápovědy, když se název parametru liší jen předponou
de: Hinweise unterdrücken, wenn sich Parameternamen nur durch das Suffix unterscheiden
es: Suprimir las sugerencias cuando los nombres de parámetro solo se diferencien por el sufijo
fr: Supprimer les indicateurs quand les noms de paramètres ne diffèrent que par le suffixe
ko: 매개 변수 이름이 접미사만 다른 경우 힌트 표시 안 함
pl: Pomiń wskazówki, gdy nazwy parametrów różnią się tylko sufiksem
pt_br: Suprimir as dicas quando os nomes de parâmetros diferirem somente pelo sufixo
ru: Скрывать подсказки, если имена параметров различаются только суффиксом.
tr: Parametre adlarının yalnızca sonekleri farklı olduğunda ipuçlarını gizle
zh_hans: 当参数名称只有后缀不同时禁止显示提示
zh_hant: 當參數名稱只有尾碼不同時，不出現提示

source: Symbols without references
cs: Symboly bez odkazů
de: Symbole ohne Verweise
es: Símbolos sin referencias
fr: Symboles sans références
ko: 참조 없는 기호
pl: Symbole bez odwołań
pt_br: Símbolos sem referências
ru: Символы без ссылок
tr: Başvuruları olmayan semboller
zh_hans: 不带引用的符号
zh_hant: 沒有參考的符號

source: Sync Namespaces
cs: Synchronizovat obory názvů
de: Namespaces synchronisieren
es: Sincronizar espacios de nombres
fr: Synchroniser les espaces de noms
ko: 네임스페이스 동기화
pl: Synchronizuj język Namespaces
pt_br: Sincronizar Namespaces
ru: Синхронизация пространства имен
tr: Namespace Öğelerini Eşitle
zh_hans: 同步命名空间
zh_hant: 同步命名空間

source: Sync namespaces changes
cs: Synchronizovat změny oborů názvů
de: Änderungen an Synchronisierungsnamespaces
es: Sincronizar cambios de espacios de nombres
fr: Synchroniser les modifications apportées aux espaces de noms
ko: 동기화 네임스페이스 변경 내용
pl: Synchronizuj zmiany przestrzeni nazw
pt_br: Sincronizar alterações de namespaces
ru: Синхронизация изменений пространств имен
tr: Ad alanı değişikliklerini eşitle
zh_hans: 同步命名空间更改
zh_hant: 同步處理命名空間變更

# Tab_twice_to_insert_arguments
source: Tab twice to insert arguments (experimental)
cs: Stisknout dvakrát tabulátor, aby se vložily argumenty (experimentální)
de: Zweimaliges Drücken der TAB-Taste zum Einfügen von Argumenten (experimentell)
es: Presionar dos veces la tecla Tab para insertar argumentos (experimental)
fr: Appuyer deux fois sur Tab pour insérer des arguments (expérimental)
ko: 두 번 탭하여 인수 삽입(실험적)
pt_br: Pressione Tab duas vezes para inserir argumentos (experimental)
ru: Дважды нажмите клавишу TAB, чтобы вставить аргументы (экспериментальная функция)
tr: Bağımsız değişkenleri eklemek için iki kez dokunun (deneysel)

# Target_Namespace_colon
source: Target Namespace:
cs: Cílový obor názvů:
de: Zielnamespace:
es: Espacio de nombres de destino:
fr: Espace de noms cible :
it: Spazio dei nomi di destinazione:
ja: ターゲット名前空間:
ko: 대상 네임스페이스:
pl: Docelowa przestrzeń nazw:
pt_br: Namespace de Destino:
ru: Целевое пространство имен:
tr: Hedef Ad Alanı:
zh_hans: 目标命名空间:
zh_hant: 目標命名空間:

# The_generator_0_that_generated_this_file_has_been_removed_from_the_project
source: The generator '{0}' that generated this file has been removed from the project; this file is no longer being included in your project.
cs: Generátor {0}, který vygeneroval tento soubor, se odebral z projektu. Tento soubor už není součástí projektu.
de: Der Generator "{0}", der diese Datei generiert hat, wurde aus dem Projekt entfernt. Diese Datei wird nicht mehr in Ihr Projekt einbezogen.
es: El generador "{0}" que creó este archivo se ha quitado del proyecto; el archivo ya no se incluye en el proyecto.
fr: Le générateur '{0}' qui a généré ce fichier a été supprimé du projet. Ce fichier n'est plus inclus dans votre projet.
ko: 이 파일을 생성한 생성기 '{0}'이(가) 프로젝트에서 제거되었습니다. 이 파일은 프로젝트에 더 이상 포함되지 않습니다.
pl: Generator „{0}”, który wygenerował ten plik, został usunięty z projektu; ten plik nie jest już uwzględniany w Twoim projekcie.
pt_br: O gerador '{0}' que gerou esse arquivo foi removido do projeto. Esse arquivo não será mais incluído no projeto.
ru: Генератор "{0}", создавший этот файл, был удален из проекта; этот файл больше не включен в проект.
tr: Bu dosyayı oluşturan '{0}' oluşturucusu projeden kaldırıldı; bu dosya artık projenize dahil edilmiyor.
zh_hans: 生成此文件的生成器“{0}”已从项目中删除；项目中不再包含此文件。
zh_hant: 已從專案中移除產生此檔案的產生器 '{0}'; 此檔案已不再包含在您的專案中。

# The_generator_0_that_generated_this_file_has_stopped_generating_this_file
source: The generator '{0}' that generated this file has stopped generating this file; this file is no longer being included in your project.
cs: Generátor {0}, který vygeneroval tento soubor, přestal tento soubor generovat. Soubor už není součástí projektu.
de: Der Generator "{0}" hat diese Datei nicht vollständig generiert. Diese Datei wird nicht mehr in Ihr Projekt einbezogen.
es: El generador "{0}" que creaba este archivo ha dejado de generarlo; el archivo ya no se incluye en el proyecto.
fr: Le générateur '{0}' qui a généré ce fichier a arrêté de générer ce dernier. Le fichier n'est plus inclus dans votre projet.
ko: 이 파일을 생성한 생성기 '{0}'이(가) 이 파일 생성을 중지했습니다. 이 파일은 프로젝트에 더 이상 포함되지 않습니다.
pl: Generator „{0}”, który wygenerował ten plik, przestał generować ten plik; ten plik nie jest już uwzględniany w Twoim projekcie.
pt_br: O gerador '{0}' que gerou esse arquivo parou de gerá-lo. Esse arquivo não será mais incluído no projeto.
ru: Генератор "{0}", создавший этот файл, остановил создание этого файла; этот файл больше не включен в проект.
tr: Bu dosyayı oluşturan '{0}' oluşturucusu bu dosyayı oluşturmayı durdurdu; bu dosya artık projenize dahil edilmiyor.
zh_hans: 生成此文件的生成器“{0}”已停止生成此文件；项目中不再包含此文件。
zh_hant: 產生此檔案的產生器 '{0}' 已停止產生此檔案; 此檔案已不再包含在您的專案中。

source: This action cannot be undone. Do you wish to continue?
cs: Tato akce se nedá vrátit. Chcete pokračovat?
de: Diese Aktion kann nicht rückgängig gemacht werden. Möchten Sie den Vorgang fortsetzen?
es: Esta acción no se puede deshacer. ¿Quiere continuar?
fr: Il est impossible d'annuler cette action. Voulez-vous continuer ?
ko: 이 작업은 실행 취소할 수 없습니다. 계속하시겠습니까?
pl: Tej akcji nie można cofnąć. Czy chcesz kontynuować?
pt_br: Esta ação não pode ser desfeita. Deseja continuar?
ru: Это действие не может быть отменено. Вы хотите продолжить?
tr: Bu işlem geri alınamaz. Devam etmek istiyor musunuz?
zh_hans: 此操作无法撤消。是否要继续?
zh_hant: 此動作無法復原。要繼續嗎?

# This_file_is_autogenerated_by_0_and_cannot_be_edited
source: This file is auto-generated by the generator '{0}' and cannot be edited.
ru: Этот файл создан автоматически генератором "{0}" и не может быть изменен.

source: This is an invalid namespace
cs: Toto je neplatný obor názvů.
de: Dies ist ein ungültiger Namespace.
es: Este espacio de nombres no es válido
fr: Ceci est un espace de noms non valide
it: Questo è uno spazio dei nomi non valido
ja: これは無効な名前空間です
ko: 잘못된 네임스페이스입니다.
pl: To jest nieprawidłowa przestrzeń nazw
pt_br: Este é um namespace inválido
ru: Это недопустимое пространство имен.
tr: Bu geçersiz bir ad alanı
zh_hans: 这是一个无效的命名空间
zh_hant: 這是無效的命名空間

source: This rule is not configurable
cs: Toto pravidlo není konfigurovatelné.
de: Diese Regel kann nicht konfiguriert werden
es: No se puede configurar esta regla
fr: Cette règle ne peut pas être configurée
ko: 이 규칙은 구성할 수 없음
pl: Nie można konfigurować tej reguły
pt_br: Esta regra não é configurável
ru: Это правило не является настраиваемым
tr: Bu kural yapılandırılamaz
zh_hans: 此规则不可配置
zh_hant: 此規則無法設定

source: Title
cs: Název
de: Titel
es: Título
fr: Titre
ko: 제목
pl: Tytuł
pt_br: Título
ru: Название
tr: Başlık
zh_hans: 标题
zh_hant: 標題

source: Type name:
cs: Název typu:
de: Typenname:
es: Nombre de tipo:
fr: Nom du type :
ja: 種類の名前:
ko: 형식 이름:
pl: Nazwa typu:
pt_br: Nome do tipo:
ru: Имя типа:
tr: Tür adı:
zh_hans: 类型名称:
zh_hant: 類型名稱:

source: Type name has a syntax error
cs: Název typu má chybu syntaxe.
de: Der Typname weist einen Syntaxfehler auf.
es: El nombre de tipo tiene un error de sintaxis
fr: Le nom de type a une erreur de syntaxe
ja: 型名に構文エラーがあります
ko: 형식 이름에 구문 오류가 있습니다.
pl: Nazwa typu zawiera błąd składni
pt_br: O nome do Tipo tem um erro de sintaxe
ru: Имя типа содержит синтаксическую ошибку.
tr: Tür adında söz dizimi hatası var
zh_hans: 类型名称有语法错误
zh_hant: 類型名稱包含語法錯誤

source: Type name is not recognized
cs: Název typu se nerozpoznal.
de: Der Typname wurde nicht erkannt.
es: No se reconoce el nombre de tipo
fr: Le nom de type n'est pas reconnu
ja: 型名が認識されません
ko: 형식 이름을 인식할 수 없습니다.
pl: Nazwa typu nie jest rozpoznawana
pt_br: O nome do Tipo não é reconhecido
ru: Не удалось распознать имя типа.
tr: Tür adı tanınmıyor
zh_hans: 无法识别类型名称
zh_hant: 無法辨識類型名稱

source: Type name is recognized
cs: Název typu se rozpoznal.
de: Der Typname wurde erkannt.
es: Se reconoce el nombre de tipo
fr: Le nom de type est reconnu
ja: 型名が認識されます
ko: 형식 이름이 인식됩니다.
pl: Nazwa typu jest rozpoznawana
pt_br: O nome do Tipo é reconhecido
ru: Имя типа распознано.
tr: Tür adı tanınıyor
zh_hans: 已识别类型名称
zh_hant: 已辨識類型名稱

source: Underline reassigned variables
cs: Podtrhnout znovu přiřazené proměnné
de: Neu zugewiesene Variablen unterstreichen
es: Subrayar variables reasignadas
fr: Souligner les variables réaffectées
ko: 다시 할당된 변수에 밑줄 긋기
pl: Podkreślaj ponownie przypisane zmienne
pt_br: Sublinhar variáveis reatribuídas
ru: Подчеркивать переназначенные переменные
tr: Yeniden atanan değişkenlerin altını çiz
zh_hans: 为重新分配变量添加下划线
zh_hant: 為重新指派的變數加上底線

source: Unused value is explicitly assigned to an unused local
cs: Nepoužitá hodnota se explicitně přiřadí nepoužité lokální hodnotě.
de: Der nicht verwendete Wert wird explizit einer nicht verwendeten lokalen Variablen zugewiesen.
es: El valor sin usar se asigna explícitamente a una variable local sin usar
fr: La valeur inutilisée est explicitement affectée à une variable locale inutilisée
it: Il valore inutilizzato viene assegnato in modo esplicito a una variabile locale inutilizzata
ja: 未使用のローカルに未使用の値が明示的に割り当てられます
ko: 사용되지 않는 값이 사용되지 않는 로컬에 명시적으로 할당됩니다.
pl: Nieużywana wartość jest jawnie przypisywana do nieużywanej zmiennej lokalnej
pt_br: O valor não utilizado é explicitamente atribuído a um local não utilizado
ru: Неиспользуемое значение явным образом задано неиспользуемой локальной переменной.
tr: Kullanılmayan değer açıkça kullanılmayan bir yerele atandı
zh_hans: 未使用的值会显式分配给未使用的本地函数
zh_hant: 未使用的值已明確指派至未使用的區域

source: Unused value is explicitly assigned to discard
cs: Nepoužitá hodnota se explicitně přiřadí k zahození.
de: Der nicht verwendete Wert wird explizit verworfen.
es: El valor sin usar se asigna explícitamente para descartar
fr: La valeur inutilisée est explicitement affectée à une variable discard
it: Il valore inutilizzato viene assegnato in modo esplicito a discard
ja: 未使用の値が discard に明示的に割り当てられます
ko: 사용되지 않는 값이 무시 항목에 명시적으로 할당됩니다.
pl: Nieużywana wartość jest jawnie przypisywana do odrzutu
pt_br: O valor não utilizado é explicitamente atribuído ao descarte
ru: Неиспользуемое значение явным образом задано пустой переменной.
tr: Kullanılmayan değer açıkça atılmak üzere atandı
zh_hans: 未使用的值会显式分配以弃用
zh_hant: 未使用的值已明確指派至捨棄

# Updating_namspaces
source: Updating namespaces...
cs: Aktualizují se obory názvů…
de: Namespaces werden aktualisiert...
es: Actualizando espacios de nombres...
fr: Mise à jour de l'espace de noms...
ko: 네임스페이스를 업데이트하는 중...
pl: Trwa aktualizowanie języka Namespaces...
pt_br: Atualizando os namespaces...
ru: Выполняется обновление пространства имен...
tr: Namespace öğeleri güncelleniyor...
zh_hans: 正在更新命名空间...
zh_hant: 正在更新命名空間...

source: Updating project references...
cs: Aktualizují se odkazy projektů...
de: Projektverweise werden aktualisiert...
es: Actualizando las referencias del proyecto...
fr: Mise à jour des références de projet...
ko: 프로젝트 참조를 업데이트하는 중...
pl: Aktualizowanie odwołań projektu...
pt_br: Atualizando as referências do projeto...
ru: Обновление ссылок проекта…
tr: Proje başvuruları güncelleştiriliyor...
zh_hans: 正在更新项目引用…
zh_hant: 正在更新專案參考...

source: Updating severity
cs: Aktualizuje se závažnost.
de: Der Schweregrad wird aktualisiert.
es: Actualizando la gravedad
fr: Mise à jour de la gravité
ja: 重要度を更新しています
ko: 심각도를 업데이트하는 중
pl: Aktualizowanie ważności
pt_br: Atualizando a severidade
ru: Обновление уровня серьезности
tr: Önem derecesi güncelleştiriliyor
zh_hans: 正在更新严重性
zh_hant: 正在更新嚴重性

source: Use expression body for lambdas
cs: Pro výrazy lambda používat text výrazu
de: Ausdruckskörper für Lambdaausdrücke verwenden
es: Usar cuerpo de expresión para lambdas
fr: Utiliser un corps d'expression pour les expressions lambda
it: Usa il corpo dell'espressione per le espressioni lambda
ja: ラムダに式本体を使用します
ko: 람다에 식 본문 사용
pl: Użyj treści wyrażenia dla wyrażeń lambda
pt_br: Usar o corpo da expressão para lambdas
ru: Использовать тело выражения для лямбда-выражений
tr: Lambdalar için ifade gövdesi kullan
zh_hans: 使用 lambdas 的表达式主体
zh_hant: 使用 lambda 的運算式主體

source: Use expression body for local functions
cs: Pro místní funkce používat text výrazu
de: Ausdruckskörper für lokale Funktionen verwenden
es: Usar cuerpo de expresión para funciones locales
fr: Utiliser un corps d'expression pour les fonctions locales
it: Usa il corpo dell'espressione per le funzioni locali
ja: ローカル関数に式本体を使用します
ko: 로컬 함수에 식 본문 사용
pl: Użyj treści wyrażenia dla funkcji lokalnych
pt_br: Usar o corpo da expressão para funções locais
ru: Использовать тело выражения для локальных функций
tr: Yerel işlevler için ifade gövdesi kullan
zh_hans: 使用本地函数的表达式主体
zh_hant: 使用區域函式的運算式主體

source: Use named argument
cs: Použít pojmenovaný argument
de: Benanntes Argument verwenden
es: Usar argumento con nombre
fr: Utiliser un argument nommé
ja: 名前付き引数を使用する
ko: 명명된 인수 사용
pl: Użyj nazwanego argumentu
pt_br: Usar argumento nomeado
ru: Использовать именованный аргумент
tr: Adlandırılmış bağımsız değişken kullan
zh_hans: 使用命名参数
zh_hant: 使用具名引數

source: Value
cs: Hodnota
de: Wert
es: Valor
fr: Valeur
ko: 값
pl: Wartość
pt_br: Valor
ru: Значение
tr: Değer
zh_hans: 值
zh_hant: 值

source: Value Tracking
cs: Sledování hodnot
de: Wertnachverfolgung
es: Seguimiento de valores
fr: Suivi de la valeur
ko: 값 추적
pl: Śledzenie wartości
pt_br: Rastreamento de Valor
ru: Отслеживание значений
tr: Değer Takibi
zh_hans: 值跟踪
zh_hant: 值追蹤

source: Value assigned here is never used
cs: Zde přiřazená hodnota se nikdy nepoužije.
de: Der hier zugewiesene Wert wird nie verwendet.
es: El valor asignado aquí no se usa nunca
fr: La valeur affectée ici n'est jamais utilisée
it: Il valore assegnato qui non viene mai usato
ja: ここで割り当てた値は一度も使用されません
ko: 여기에 할당된 값은 사용되지 않습니다.
pl: Przypisana tu wartość nigdy nie jest używana
pt_br: O valor atribuído aqui nunca é usado
ru: Заданное здесь значение не используется.
tr: Burada atanan değer hiçbir zaman kullanılmadı
zh_hans: 此处分配的值从未使用过
zh_hant: 這裡指派的值從未使用過

# Value_colon
source: Value:
cs: Hodnota:
de: Wert:
es: Valor:
fr: Valeur :
ja: 値:
ko: 값:
pt_br: Valor:
ru: Значение:
tr: Değer:

source: Value returned by invocation is implicitly ignored
cs: Hodnota vrácená voláním je implicitně ignorována.
de: Der vom Aufruf zurückgegebene Wert wird implizit ignoriert.
es: El valor devuelto por la invocación se omite implícitamente
fr: La valeur retournée par invocation est implicitement ignorée
it: Il valore restituito dalla chiamata viene ignorato in modo implicito
ja: 呼び出しによって返された値が暗黙的に無視されます
ko: 호출로 반환된 값은 암시적으로 무시됩니다.
pl: Wartość zwracana przez wywołanie jest niejawnie ignorowana
pt_br: O valor retornado por chamada é implicitamente ignorado
ru: Значение, возвращаемое вызовом, неявным образом игнорируется.
tr: Çağrı ile döndürülen değer örtük olarak yok sayıldı
zh_hans: 已隐式忽略调用所返回的值
zh_hant: 明確地忽略引動過程傳回的值

source: Value to inject at call sites
cs: Hodnota, která se má vložit v místech volání
de: An Aufrufsites einzufügender Wert
es: Valor que se va a insertar en los sitios de llamada
fr: Valeur à injecter sur les sites d'appel
ja: 呼び出しサイトで挿入する値
ko: 호출 사이트에서 삽입할 값
pl: Wartość do iniekcji w lokalizacjach wywołania
pt_br: Valor a ser injetado nos sites de chamada
ru: Значение, которое необходимо вставить во все точки вызова
tr: Çağrı sitelerinde eklenecek değer
zh_hans: 要在调用站点插入的值
zh_hant: 要在呼叫位置插入的值

source: Visual Studio Settings
cs: Nastavení sady Visual Studio
de: Visual Studio-Einstellungen
es: Configuración de Visual Studio
fr: Paramètres de Visual Studio
ko: Visual Studio 설정
pl: Ustawienia programu Visual Studio
pt_br: Configurações do Visual Studio
ru: Параметры Visual Studio
tr: Visual Studio Ayarları
zh_hans: Visual Studio 设置
zh_hant: Visual Studio 設定

source: Warning
cs: Upozornění
de: Warnung
es: Advertencia
fr: Avertissement
ko: 경고
pt_br: Aviso
ru: Предупреждение
tr: Uyarı
