Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Prefer index operator
cs: Preferovat operátor indexu
de: Indexoperator bevorzugen
es: Preferir operador de índice
fr: Préférer l'opérateur d'index
it: Preferisci operatore di indice
ja: インデックス演算子を優先
ko: 인덱스 연산자 선호
pl: Preferuj operator indeksowania
pt_br: Preferir operador de índice
ru: Предпочитать оператор index
tr: Dizin işlecini tercih et
zh_hans: 首选索引运算符
zh_hant: 優先使用索引運算子

source: Prefer method group conversion
cs: Preferovat převod skupiny metod
de: Methodengruppenkonvertierung bevorzugen
es: Preferir la conversión de grupo de métodos
fr: Préférer la conversion de groupe de méthodes
ko: 메서드 그룹 변환 선호
pl: Preferuj konwersję grupy metod
pt_br: Preferir conversão de grupo de métodos
ru: Предпочитать преобразование группы методов
tr: Yöntem grubu dönüştürmeyi tercih et
zh_hans: 偏好方法组转换
zh_hant: 建議使用方法群組轉換

source: Prefer namespace and folder match structure
cs: Preferovat strukturu oboru názvů a shody složek
de: Namespace- und Ordnerübereinstimmungsstruktur bevorzugen
es: Preferir estructura de coincidencia de espacio de nombres y carpetas
fr: Préférer l’espace de noms et la structure de correspondance de dossier
ko: 네임스페이스 및 폴더 일치 구조 선호
pl: Preferuj strukturę dopasowania przestrzeni nazw i folderów
pt_br: Prefira espaço de nomes e estrutura de correspondência de pasta
ru: Предпочитать пространство имен и структуру совпадений папок
tr: Ad alanı ve klasör eşleşme yapısını tercih et
zh_hans: 首选命名空间和文件夹匹配结构
zh_hant: 優先使用命名空間和資料夾相符結構

source: Prefer range operator
cs: Preferovat operátor rozsahu
de: Bereichsoperator bevorzugen
es: Preferir operador de intervalo
fr: Préférer l'opérateur de plage
it: Preferisci operatore di intervallo
ja: 範囲演算子を優先
ko: 범위 연산자 선호
pl: Preferuj operator zakresu
pt_br: Preferir operador de intervalo
ru: Предпочитать оператор range
tr: Aralık işlecini tercih et
zh_hans: 首选范围运算符
zh_hant: 優先使用範圍運算子

source: Prefer read-only struct
cs: Upřednostňovat strukturu jen pro čtení
de: Schreibgeschützte Struktur bevorzugen
es: Preferir la estructura de solo lectura
fr: Préférer le struct en lecture seule
ko: 읽기 전용 구조체 선호
pl: Preferuj strukturę tylko do odczytu
pt_br: Preferir o struct somente leitura
ru: Предпочитать структуру только для чтения
tr: Salt okunur yapıyı tercih et
zh_hans: 首选只读结构
zh_hant: 偏好唯讀結構

source: Prefer read-only struct member
cs: Upřednostňovat člena struktury jen pro čtení
de: Schreibgeschützten Strukturmember bevorzugen
es: Preferir miembro de estructura de solo lectura
fr: Préférer le membre struct en lecture seule
ko: 읽기 전용 구조체 멤버 선호
pl: Preferuj składową struktury tylko do odczytu
pt_br: Preferir membro de struct somente leitura
ru: Предпочитать элемент структуры только для чтения
tr: Salt okunur yapı üyesini tercih et
zh_hans: 首选只读结构成员
zh_hant: 偏好唯讀結構成員

source: Prefer readonly fields
cs: Preferovat pole s modifikátorem readonly
de: readonly-Felder bevorzugen
es: Preferir campos de solo lectura
fr: Préférer les champs readonly
it: Preferisci campi readonly
ja: readonly フィールドを優先する
ko: 읽기 전용 필드 선호
pl: Preferuj pola tylko do odczytu
pt_br: Preferir campos readonly
ru: Предпочитать поля только для чтения
tr: Saltokunur alanları tercih et
zh_hans: 首选只读字段
zh_hant: 優先使用唯讀欄位

source: Prefer simple 'using' statement
cs: Preferovat jednoduchý příkaz using
de: Einfache using-Anweisung bevorzugen
es: Preferir la instrucción "using" sencilla
fr: Préférer une instruction 'using' simple
it: Preferisci l'istruzione 'using' semplice
ja: 単純な 'using' ステートメントを優先する
ko: 간단한 'using' 문 선호
pl: Preferuj prostą instrukcję „using”
pt_br: Preferir a instrução 'using' simples
ru: Предпочитать простой оператор using
tr: Basit 'using' deyimini tercih et
zh_hans: 首选简单的 "using" 语句
zh_hant: 優先使用簡單的 'using' 陳述式

source: Prefer simplified boolean expressions
cs: Upřednostňovat zjednodušené logické výrazy
de: Vereinfachte boolesche Ausdrücke bevorzugen
es: Preferir expresiones booleanas simplificadas
fr: Préférer les expressions booléennes simplifiées
ja: 単純なブール式を優先する
ko: 단순화된 부울 식을 기본으로 사용
pl: Preferuj uproszczone wyrażenia logiczne
pt_br: Preferir expressões boolianas simplificadas
ru: Предпочитать упрощенные логические выражения
tr: Basitleştirilmiş boolean ifadelerini tercih edin
zh_hans: 首选简化的布尔表达式
zh_hant: 建議使用簡易布林運算式

source: Prefer simplified interpolation
cs: Preferovat zjednodušenou interpolaci
de: Vereinfachte Interpolation bevorzugen
es: Preferir interpolación simplificada
fr: Préférer une interpolation simplifiée
ko: 단순화된 보간 선호
pl: Preferuj uproszczoną interpolację
pt_br: Prefira interpolação simplificada
ru: Предпочитать упрощенную интерполяцию
tr: Temel ilişkilendirmeyi tercih et
zh_hans: 首选简化内插
zh_hant: 優先使用簡易動畫插補

source: Prefer static local functions
cs: Preferovat statické místní funkce
de: Statische lokale Funktionen bevorzugen
es: Preferir funciones locales estáticas
fr: Préférer les fonctions locales statiques
it: Preferisci funzioni locali statiche
ja: 静的ローカル関数を優先する
ko: 정적 로컬 함수 선호
pl: Preferuj statyczne funkcje lokalne
pt_br: Preferir as funções locais estáticas
ru: Предпочитать статические локальные функции
tr: Statik yerel işlevleri tercih et
zh_hans: 首选静态本地函数
zh_hant: 優先使用靜態區域函式

source: Prefer top-level statements
cs: Upřednostňovat příkazy nejvyšší úrovně
de: Anweisungen der obersten Ebene bevorzugen
es: Preferir instrucciones de nivel superior
fr: Préférer les instructions de niveau supérieur
ko: 최상위 문장 선호
pl: Preferuj instrukcje najwyższego poziomu
pt_br: Preferir instruções de alto-nível
ru: Предпочитать инструкции верхнего уровня
tr: Üst düzey deyimleri tercih et
zh_hans: 首选顶级语句
zh_hant: 偏好最上層陳述式

source: Prefer tuple swap
cs: Preferovat prohození řazené kolekce členů
de: Tupeltausch bevorzugen
es: Preferir el intercambio de tupla
fr: Préférer l'échange de tuples
ko: 튜플 교환 선호
pl: Preferuj zamianę krotki
pt_br: Prefiro troca de tupla
ru: Предпочитать переключение кортежей
tr: Demet değiştirmeyi tercih et
zh_hans: 首选元组交换
zh_hant: 偏好元組交換

source: Projects
cs: Projekty
de: Projekte
es: Proyectos
fr: Projets
ko: 프로젝트
pl: Projekty
pt_br: Projetos
ru: Проекты
tr: Projeler
zh_hans: 项目
zh_hant: 專案

source: Pull Members Up
cs: Stáhnout členy
de: Member nach oben ziehen
es: Extraer miembros
fr: Élever les membres
it: Recupera membri
ja: メンバーをプルアップ
ko: 멤버 풀하기
pl: Podciągnij składowe w górę
pt_br: Levantar os membros
ru: Повышение элементов
tr: Üyeleri Yukarı Çek
zh_hans: 拉取成员
zh_hant: 提升成員

source: Quick Actions
cs: Rychlé akce
de: Schnelle Aktionen
es: Acciones rápidas
fr: Actions rapides
ko: 빠른 작업
pl: Szybkie akcje
pt_br: Ações Rápidas
ru: Быстрые действия
tr: Hızlı Eylemler
zh_hans: 快速操作
zh_hant: 快速動作

source: Refactoring Only
cs: Pouze refaktoring
de: Nur Refactoring
es: Solo refactorización
ko: 리팩터링만
pt_br: Somente Refatoração
ru: Только рефакторинг
tr: Sadece Yeniden Düzenlenme

source: Reference
cs: Odkaz
de: Verweis
es: Referencia
fr: Référence
ko: 참조
pl: Odwołanie
pt_br: Referência
ru: Ссылка
tr: Başvuru
zh_hans: 引用
zh_hant: 參考

source: Regular Expressions
cs: Regulární výrazy
de: Reguläre Ausdrücke
es: Expresiones regulares
fr: Expressions régulières
it: Espressioni regolari
ja: 正規表現
ko: 정규식
pl: Wyrażenia regularne
pt_br: Expressões regulares
ru: Регулярные выражения
tr: Normal İfadeler
zh_hans: 正规表达式
zh_hant: 規則運算式

source: Remove All
ru: Удалить все

source: Remove Unused References
cs: Odebrat nepoužívané odkazy
de: Nicht verwendete Verweise entfernen
es: Quitar referencias sin usar
fr: Supprimer les références inutilisées
ko: 사용하지 않는 참조 제거
pl: Usuń nieużywane odwołania
pt_br: Remover as Referências Não Usadas
ru: Удалить неиспользуемые ссылки
tr: Kullanılmayan Başvuruları Kaldır
zh_hans: 删除未使用的引用
zh_hant: 移除未使用的參考

source: Remove unnecessary usings
cs: Odebrat nepotřebné direktivy using
de: Nicht benötigte Using-Direktiven entfernen
es: Eliminar instrucciones Using innecesarias
fr: Supprimer les Usings inutiles
ko: 불필요한 Using 제거
pl: Usuń niepotrzebne użycia
pt_br: Remover Usos Desnecessários
ru: Удалить ненужные директивы using
tr: Gereksiz Kullanımları Kaldır
zh_hans: 删除不必要的 Using
zh_hant: 移除不必要的 Using

source: Rename
cs: Přejmenovat
de: umbenennen
es: Cambiar nombre
fr: renommer
ko: 이름 바꾸기
pt_br: renomear
ru: Переименование
tr: Yeniden adlandır

source: Rename {0} to {1}
cs: Přejmenovat {0} na {1}
de: "{0}" in "{1}" umbenennen
es: Cambiar nombre de {0} a {1}
fr: Renommer {0} en {1}
it: Rinomina {0} in {1}
ja: {0} の名前を {1} に変更
ko: {0} 이름을 {1}(으)로 바꾸기
pt_br: Renomear {0} para {1}
ru: Переименовать {0} в {1}
tr: {0} öğesini {1} olarak yeniden adlandır

source: Rename asynchronously (experimental)
cs: Asynchronní přejmenování (experimentální)
de: Asynchron umbenennen (experimentell)
es: Cambiar el nombre de forma asincrónica (experimental)
fr: Renommer de façon asynchrone (expérimentale)
ko: 비동기적으로 이름 바꾸기(실험적)
pt_br: Renomear de forma assíncrona (experimental)
ru: Асинхронное переименование (экспериментальная функция)
tr: Zaman uyumsuz olarak yeniden adlandırın (deneysel)

source: Report invalid JSON strings
cs: Nahlásit neplatné řetězce JSON
de: Ungültige JSON-Zeichenfolgen melden
es: Notificar las cadenas JSON no válidas
fr: Signaler les chaînes JSON non valides
ko: 잘못된 JSON 문자열 보고
pl: Zgłoś nieprawidłowe ciągi JSON
pt_br: Notificar cadeias de caracteres JSON inválidas
ru: Сообщить о недопустимых строках JSON
tr: Geçersiz JSON dizelerini bildir
zh_hans: 报告无效的 JSON 字符串
zh_hant: 回報告無效 JSON 字串

source: Report invalid regular expressions
cs: Nahlásit neplatné regulární výrazy
de: Ungültige reguläre Ausdrücke melden
es: Notificar expresiones regulares no válidas
fr: Signaler les expressions régulières non valides
it: Segnala espressioni regolari non valide
ja: 無効な正規表現を報告
ko: 잘못된 정규식 보고
pl: Raportuj nieprawidłowe wyrażenia regularne
pt_br: Relatar expressões regulares inválidas
ru: Сообщать о недопустимых регулярных выражениях
tr: Geçersiz normal ifadeleri bildir
zh_hans: 报告无效的正规表达式
zh_hant: 回報無效的規則運算式

source: Repository
cs: Úložiště
es: Repositorio
fr: Dépôt
ja: リポジトリ
ko: 리포지토리
pl: Repozytorium
pt_br: Repositório
ru: Репозиторий
tr: Depo
zh_hans: 存储库
zh_hant: 存放庫

source: Require accessibility modifiers
cs: Vyžadovat modifikátory dostupnosti.
de: Zugriffsmodifizierer erforderlich
es: Requerir modificadores de accesibilidad
fr: Modificateurs d'accessibilité obligatoires
ko: 접근성 한정자 필요
pl: Wymagaj modyfikatorów ułatwień dostępu
pt_br: Exigem modificadores de acessibilidade
ru: Требуются модификаторы специальных возможностей
tr: Erişilebilirlik değiştiricileri gerekli
zh_hans: 需要可访问性修饰符
zh_hant: 需要協助工具修飾元

# Require_colon
source: Require:
cs: Vyžadovat:
de: Erforderlich:
es: Requerir:
fr: Nécessite :
ko: 필요:
pl: Wymagaj:
pt_br: Exigir:
ru: Обязательно:
tr: Gerektir:
zh_hans: 需要:
zh_hant: 需要:

source: Required
cs: Požadováno
de: Erforderlich
es: Obligatorio
fr: Obligatoire
ja: 必須
ko: 필수
pl: Wymagane
pt_br: Necessário
ru: Обязательный параметр
tr: Gerekli
zh_hans: 必需
zh_hant: 必要

source: Requires 'System.HashCode' be present in project
cs: V projektu se musí nacházet System.HashCode.
de: "System.HashCode" muss im Projekt vorhanden sein.
es: Requiere que "System.HashCode" esté presente en el proyecto
fr: Nécessite la présence de 'System.HashCode' dans le projet
ja: 'System.HashCode' がプロジェクトに存在する必要があります
ko: 'System.HashCode'가 프로젝트에 있어야 합니다.
pl: Wymaga, aby element „System.HashCode” był obecny w projekcie
pt_br: Requer que 'System.HashCode' esteja presente no projeto
ru: Требуется наличие "System.HashCode" в проекте.
tr: Projede 'System.HashCode' bulunmasını gerektirir
zh_hans: 要求项目中存在 "System.HashCode"
zh_hant: 專案中必須有 'System.HashCode'

source: Reset Visual Studio default keymapping
cs: Obnovit výchozí mapování klávesnice sady Visual Studio
de: Visual Studio-Standardtastenzuordnung zurücksetzen
es: Restablecer asignaciones de teclado predeterminadas de Visual Studio
fr: Réinitialiser la configuration du clavier par défaut de Visual Studio
it: Reimposta il mapping dei tasti predefinito di Visual Studio
ja: Visual Studio の既定のキーマップをリセットします
ko: Visual Studio 기본 키 매핑을 다시 설정
pl: Zresetuj domyślne mapowanie klawiszy programu Visual Studio
pt_br: Redefinir mapeamento de teclas padrão do Visual Studio
ru: Сброс схемы назначения клавиш Visual Studio по умолчанию
tr: Visual Studio varsayılan tuş eşlemesine sıfırla
zh_hans: 重置 Visual Studio 默认项映射
zh_hant: 重設 Visual Studio 預設按鍵對應

source: Review Changes
cs: Zkontrolovat změny
de: Änderungen überprüfen
es: Revisar cambios
fr: Passer en revue les changements
it: Esamina modifiche
ja: 変更のプレビュー
ko: 변경 내용 검토
pl: Przejrzyj zmiany
pt_br: Revisar alterações
ru: Проверить изменения
tr: Değişiklikleri Gözden Geçir
zh_hans: 预览更改
zh_hant: 檢閱變更

source: Run Code Analysis on {0}
cs: Spustit analýzu kódu {0}
de: Code Analysis ausführen für "{0}"
es: Ejecutar análisis de código en {0}
fr: Exécuter une analyse du code sur {0}
ja: {0} で Code Analysis を実行
ko: {0}에서 코드 분석 실행
pl: Uruchom analizę kodu dla: {0}
pt_br: Executar Análise de Código em {0}
ru: Запустить Code Analysis для {0}
tr: {0} Öğesinde Code Analysis Çalıştır
zh_hans: 对 {0} 运行 Code Analysis
zh_hant: 對 {0} 執行 Code Analysis

# Run_background_code_analysis_for_colon
source: Run background code analysis for:
cs: Spustit analýzu kódu na pozadí pro:
de: Ausführen der Hintergrundcodeanalyse für:
es: Ejecutar el análisis del código en segundo plano para:
fr: Exécuter une analyse de code en arrière-plan pour :
ko: 다음을 위해 백그라운드 코드 분석을 실행합니다.
pl: Uruchom analizę kodu w tle dla:
pt_br: Executar análise de código em segundo plano para:
ru: Выполнить анализ кода в фоновом режиме для:
tr: Şunlar için arka plan kod analizini çalıştır:
zh_hans: 对以下项运行后台代码分析:
zh_hant: 為以下項目執行背程式碼分析:

source: Run code analysis in separate process (requires restart)
cs: Spustit analýzu kódu v samostatném procesu (vyžaduje restartování)
de: Codeanalyse in separatem Prozess ausführen (Neustart erforderlich)
es: Ejecutar el análisis de código en un proceso independiente (requiere reiniciar)
fr: Exécuter l’analyse du code dans un processus séparé (requiert un redémarrage)
ko: 별도의 프로세스에서 코드 분석 실행(다시 시작해야 함)
pt_br: Execute a análise de código em um processo separado (requer reinicialização)
ru: Запуск анализа кода в отдельном процессе (требуется перезапуск)
tr: Kod analizini ayrı bir işlemde çalıştır (yeniden başlatma gerektirir)

source: Running code analysis for '{0}'...
cs: Spouští se analýza kódu pro {0}...
de: Die Codeanalyse für "{0}" wird ausgeführt...
es: Ejecutando el análisis de código para "{0}"...
fr: Exécution de l'analyse du code pour '{0}'...
ja: '{0}' のコード分析を実行しています...
ko: '{0}'에 대한 코드 분석을 실행하는 중...
pl: Trwa analizowanie kodu dla elementu „{0}”...
pt_br: Executando a análise de código para '{0}'...
ru: Выполняется анализ кода для "{0}"…
tr: '{0}' için kod analizi çalıştırılıyor...
zh_hans: 正在为“{0}”运行代码分析…
zh_hant: 正在執行 '{0}' 的程式碼分析...

source: Running code analysis for Solution...
cs: Spouští se analýza kódu pro řešení...
de: Die Codeanalyse für die Projektmappe wird ausgeführt...
es: Ejecutando el análisis de código para la solución...
fr: Exécution de l'analyse du code pour la solution...
ja: ソリューションのコード分析を実行しています...
ko: 솔루션에 대한 코드 분석을 실행하는 중...
pt_br: Executando a análise de código para a Solução...
ru: Выполняется анализ кода для решения…
tr: Çözüm için kod analizi çalıştırılıyor...

source: Running low priority background processes
it: Esecuzione di processi in background con priorità bassa
ja: 優先度の低いバックグラウンド プロセスを実行しています
ru: Запуск фоновых процессов с низким приоритетом

# Save_dot_editorconfig_file
source: Save .editorconfig file
cs: Uložit soubor .editorconfig
de: EDITORCONFIG-Datei speichern
es: Guardar archivo .editorconfig
fr: Enregistrer le fichier .editorconfig
it: Salva file con estensione editorconfig
ja: .editorconfig ファイルの保存
ko: editorconfig 파일 저장
pl: Zapisz plik .editorconfig
pt_br: Salvar arquivo .editorconfig
ru: Сохранить файл EDITORCONFIG
tr: .editorconfig dosyasını kaydet
zh_hans: 保存 .editorconfig 文件
zh_hant: 儲存 .editorconfig 檔案

source: Search Settings
cs: Nastavení hledání
de: Sucheinstellungen
es: Buscar configuración
fr: Paramètres de recherche
ko: 검색 설정
pl: Ustawienia wyszukiwania
pt_br: Pesquisar as Configurações
ru: Параметры поиска
tr: Arama Ayarları
zh_hans: 搜索设置
zh_hant: 搜尋設定

source: Select an appropriate symbol to start value tracking
cs: Výběrem vhodného symbolu zahájíte sledování hodnot.
de: Wählen Sie ein geeignetes Symbol aus, um die Wertnachverfolgung zu starten
es: Seleccione un símbolo adecuado para iniciar el seguimiento de valores
fr: Sélectionnez un symbole approprié pour démarrer le suivi des valeurs
ko: 적절한 기호를 선택하여 값 추적 시작
pl: Wybierz odpowiedni symbol, aby rozpocząć śledzenie wartości
pt_br: Selecionar um símbolo apropriado para iniciar o rastreamento de valor
ru: Выберите соответствующий символ, чтобы начать отслеживание значений
tr: Değer takibini başlatmak için uygun bir sembol seçin
zh_hans: 选择适当的符号以启动值跟踪
zh_hant: 選取適當的符號以開始值追蹤

source: Select destination
cs: Vybrat cíl
de: Ziel auswählen
es: Seleccionar destino
fr: Sélectionner la destination
it: Seleziona destinazione
ja: 宛先の選択
ko: 대상 선택
pl: Wybierz miejsce docelowe
pt_br: Selecionar destino
ru: Выбрать место назначения
tr: Hedef seçin
zh_hans: 选择目标
zh_hant: 選取目的地

source: Select _Dependents
cs: Vybrat _závislé položky
de: Abhängige _Objekte auswählen
es: Seleccionar _dependientes
fr: Sélectionner _Dépendants
it: Seleziona _dipendenti
ja: 依存の選択(_D)
ko: 종속 항목 선택(_D)
pl: _Wybierz elementy zależne
pt_br: Selecionar _Dependentes
ru: Выбрать _зависимости
tr: _Bağımlıları Seçin
zh_hans: 选择依赖项(_D)
zh_hant: 選取相依項(_D)

source: Select _Public
cs: Vybrat _veřejné
de: Öffentliche _auswählen
es: Seleccionar _público
fr: Sélectionner _Public
it: Seleziona _pubblici
ja: パブリックの選択(_P)
ko: 공용 선택(_P)
pl: _Wybierz elementy publiczne
pt_br: Selecionar _Público
ru: Выбрать _открытые
tr: _Geneli Seçin
zh_hans: 选择公共(_P)
zh_hant: 選取公用(_P)

source: Select destination and members to pull up.
cs: Vyberte cíl a členy ke stažení.
de: Wählen Sie das Ziel und die nach oben zu ziehenden Member aus.
es: Seleccionar destino y miembros para extraer.
fr: Sélectionnez la destination et les membres à élever.
it: Selezionare la destinazione e i membri da recuperare.
ja: プルアップする宛先とメンバーを選択します。
ko: 풀할 대상 및 멤버를 선택합니다.
pl: Wybierz miejsce docelowe i składowe do podciągnięcia w górę.
pt_br: Selecionar o destino e os membros a serem exibidos.
ru: Выбрать место назначения и повышаемые в иерархии элементы.
tr: Hedef ve yukarı çekilecek üyeleri seçin.
zh_hans: 选择要拉取的目标和成员。
zh_hant: 選取要提升的目的地及成員。

# Select_destination_colon
source: Select destination:
cs: Vybrat cíl:
de: Ziel auswählen:
es: Seleccionar destino:
fr: Sélectionner la destination :
it: Selezionare la destinazione:
ja: 宛先の選択:
ko: 대상 선택:
pl: Wybierz miejsce docelowe:
pt_br: Selecionar destino:
ru: Выбрать место назначения:
tr: Hedef seçin:
zh_hans: 选择目标:
zh_hant: 選取目的地:

source: Select member
cs: Vybrat člena
de: Member auswählen
es: Seleccionar miembro
fr: Sélectionner le membre
it: Seleziona membro
ja: メンバーの選択
ko: 멤버 선택
pl: Wybierz składową
pt_br: Selecionar membro
ru: Выбрать элемент
tr: Üye seçin
zh_hans: 选择成员
zh_hant: 選取成員

# Select_members_colon
source: Select members:
cs: Vybrat členy:
de: Member auswählen:
es: Seleccionar miembros:
fr: Sélectionner les membres :
it: Selezionare i membri:
ja: メンバーの選択:
ko: 멤버 선택:
pl: Wybierz składowe:
pt_br: Selecionar membros:
ru: Выбрать элементы:
tr: Üye seçin:
zh_hans: 选择成员:
zh_hant: 選取成員:

source: Show "Remove Unused References" command in Solution Explorer (experimental)
cs: Zobrazit příkaz Odebrat nepoužívané odkazy v Průzkumníkovi řešení (experimentální)
de: Befehl "Nicht verwendete Verweise entfernen" in Projektmappen-Explorer anzeigen (experimentell)
es: Mostrar el comando "Quitar referencias sin usar" en el Explorador de soluciones (experimental)
fr: Afficher la commande Supprimer les références inutilisées dans l'Explorateur de solutions (expérimental)
ko: 솔루션 탐색기에서 "사용하지 않는 참조 제거" 명령 표시(실험적)
pt_br: Mostrar o comando "Remover as Referências Não Usadas" no Gerenciador de Soluções (experimental)
ru: Показать команду "Удалить неиспользуемые ссылки" в Обозревателе решений (экспериментальная версия)
tr: Çözüm Gezgini'nde "Kullanılmayan Başvuruları Kaldır" komutunu göster (deneysel)

# Show_UI_as_dashboard_in_top_right
source: Show UI as a dashboard in top right
cs: Zobrazit uživatelské rozhraní jako řídicí panel v pravém horním rohu
de: Benutzeroberfläche als Dashboard oben rechts anzeigen
es: Mostrar la interfaz de usuario como un panel en la parte superior derecha
fr: Afficher l’interface utilisateur en tant que tableau de bord en haut à droite
ko: 오른쪽 위에 대시보드로 UI 표시
pt_br: Mostrar interface do usuário como um painel no canto superior direito
ru: Показывать пользовательский интерфейс как информационную панель в правом верхнем углу
tr: UI öğesini sağ üstte pano olarak göster

source: Show UI Inline
cs: Zobrazit vložené uživatelské rozhraní
de: Inline der Benutzeroberfläche anzeigen
es: Mostrar interfaz de usuario insertada
fr: Afficher l’interface utilisateur inline
ko: UI 인라인 표시
pt_br: Mostrar IU Embutida
ru: Показывать встроенный пользовательский интерфейс
tr: UI Satır İçini Göster

# Show_compiler_errors_and_warnings_for_colon
source: Show compiler errors and warnings for:
cs: Zobrazit chyby a upozornění kompilátoru pro:
de: Compilerfehler und -warnungen anzeigen für:
es: Mostrar errores y advertencias del compilador para:
fr: Afficher les erreurs et avertissements du compilateur pour :
ko: 다음에 대한 컴파일러 오류 및 경고 표시:
pl: Pokaż błędy i ostrzeżenia kompilatora dla:
pt_br: Mostrar erros e alertas do compilador para:
ru: Показывать ошибки и предупреждения компилятора для:
tr: Şunun için derleyici hatalarını ve uyarılarını göster:
zh_hans: 显示以下的编译器错误和警告:
zh_hant: 顯示編譯器錯誤和警告:

source: Show completion list
cs: Zobrazit seznam pro doplňování
de: Vervollständigungsliste anzeigen
es: Mostrar lista de finalización
fr: Afficher la liste de saisie semi-automatique
it: Mostra l'elenco di completamento
ja: 入力候補一覧の表示
ko: 완성 목록 표시
pl: Pokaż listę uzupełniania
pt_br: Mostrar a lista de conclusão
ru: Показать список завершения
tr: Tamamlama listesini göster
zh_hans: 显示完成列表
zh_hant: 顯示自動完成清單

source: Show hints for everything else
cs: Zobrazit nápovědy pro všechno ostatní
de: Hinweise für alles andere anzeigen
es: Mostrar sugerencias para todo lo demás
fr: Afficher les indicateurs pour tout le reste
ko: 다른 모든 항목에 대한 힌트 표시
pl: Pokaż wskazówki dla wszystkich innych elementów
pt_br: Mostrar as dicas para tudo
ru: Отображать подсказки для всех остальных элементов
tr: Diğer her şey için ipuçlarını göster
zh_hans: 显示其他所有内容的提示
zh_hant: 顯示所有其他項目的提示

source: Show hints for implicit object creation
cs: Zobrazit tipy pro implicitní vytvoření objektu
de: Hinweise für die implizite Objekterstellung anzeigen
es: Mostrar sugerencias para la creación implícita de objetos
fr: Afficher les indicateurs pour la création d'objet implicite
ko: 암시적 개체 만들기에 대한 힌트 표시
pl: Pokazuj wskazówki dotyczące niejawnego tworzenia obiektów
pt_br: Mostrar dicas para a criação de objeto implícito
ru: Показать указания для неявного создания объекта
tr: Örtük nesne oluşturma ipuçlarını göster
zh_hans: 显示创建隐式对象的提示
zh_hant: 顯示隱含物件建立的提示

source: Show hints for indexers
cs: Zobrazit tipy pro indexery
de: Hinweise für Indexer anzeigen
es: Mostrar sugerencias para indizadores
fr: Afficher les indicateurs pour les indexeurs
ko: 인덱서에 대한 힌트 표시
pl: Pokaż wskazówki dla indeksatorów
pt_br: Mostrar dicas para indexadores
ru: Отображать подсказки для индексаторов
tr: Dizin oluşturucular için ipuçlarını göster
zh_hans: 显示索引器的提示
zh_hant: 顯示索引子的提示
