Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Prefer conditional expression over 'if' with assignments
cs: Upřednostnit podmíněný výraz před if s přiřazeními
de: Bei Zuweisungen bedingten Ausdruck gegenüber "if" bevorzugen
es: Preferir expresión condicional sobre "if" con asignaciones
fr: Préférer une expression conditionnelle à 'if' avec des affectations
it: Preferisci l'espressione condizionale a 'if' con assegnazioni
ja: 代入のある 'if' より条件式を優先する
ko: 할당이 포함된 'if'보다 조건식 선호
pl: Preferuj wyrażenia warunkowe przed instrukcjami „if” z przypisaniami
pt_br: Preferir expressão condicional em vez de 'if' com atribuições
ru: Предпочитать условное выражение оператору if в назначениях
tr: Atamalarda 'if' yerine koşullu deyim tercih et
zh_hans: 首选条件表达式而非赋值的“if”
zh_hant: 建議優先使用條件運算式 (優先於具指派的 'if')

source: Prefer conditional expression over 'if' with returns
cs: Upřednostnit podmíněný výraz před if s vrácenými hodnotami
de: Bei Rückgaben bedingten Ausdruck gegenüber "if" bevorzugen
es: Preferir expresión condicional sobre "if" con devoluciones
fr: Préférer une expression conditionnelle à 'if' avec des retours
it: Preferisci l'espressione condizionale a 'if' con valori restituiti
ja: 戻り値のある 'if' より条件式を優先する
ko: 반환이 포함된 'if'보다 조건식 선호
pl: Preferuj wyrażenia warunkowe przed instrukcjami „if” ze zwracaniem
pt_br: Preferir expressão condicional em vez de 'if' com retornos
ru: Предпочитать условное выражение оператору if в операторах return
tr: Dönüşlerde 'if' yerine koşullu deyim tercih et
zh_hans: 首选条件表达式而非带有返回结果的“if”
zh_hant: 建議優先使用條件運算式 (優先於具傳回的 'if')

source: Automatic. Run generators after any change
de: Automatisch. Generatoren nach jeder Änderung ausführen
es: Automático. Ejecutar generadores después de cualquier cambio
fr: Automatique. Exécuter les générateurs après toute modification
ko: 자동. 변경 후 생성기 실행
pl: Automatyczne. Uruchamianie generatorów po każdej zmianie
pt_br: Automáticos. Executar geradores após qualquer alteração
tr: Otomatik. Herhangi bir değişiklikten sonra oluşturucuları çalıştır
zh_hans: 自动。在任何更改后运行生成器
zh_hant: 自動。在任何變更後執行產生器

source: Balanced. Run generators after saving or building
de: Ausgeglichen. Generatoren nach dem Speichern oder Erstellen ausführen
es: Equilibrado. Ejecutar generadores después de guardar o compilar
fr: Équilibré. Exécuter les générateurs après l’enregistrement ou la génération
ko: 균형 있는. 저장 또는 빌드 후 생성기 실행
pl: Zrównoważone. Uruchamianie generatorów po zapisaniu lub skompilowaniu
pt_br: Equilibrados. Executar os geradores após salvar ou compilar
tr: Dengeli. Kaydettikten veya derledikten sonra oluşturucuları çalıştır
zh_hans: 平衡。保存或生成后运行生成器
zh_hant: 已平衡。儲存或建置後執行產生器

source: Collapse local functions when collapsing to definitions
cs: Sbalit místní funkce při sbalení do definic
de: Lokale Funktionen beim Reduzieren auf Definitionen reduzieren
es: Contraer funciones locales al contraer en definiciones
fr: Réduire des fonctions locales lors de la réduction aux définitions
ko: 정의로 축소할 때 로컬 함수 축소
pl: Zwiń funkcje lokalne podczas zwijania do definicji
pt_br: Recolher funções locais ao recolher para definições
tr: Tanımlara daraltılırken yerel işlevleri daralt
zh_hans: 折叠到定义时折叠本地函数
zh_hant: 摺疊至定義時摺疊本地函數

source: Generator running...
de: Generator wird ausgeführt...
es: Generador en ejecución...
fr: Générateur en cours d’exécution... Merci de patienter.
ko: 생성기 실행 중...
pl: Generator jest uruchomiony...
pt_br: Gerador em execução...
tr: Oluşturucu çalışıyor...
zh_hans: 生成器正在运行...
zh_hant: 產生器正在執行...

source: Not applicable
cs: Neužívá se
de: Nicht zutreffend
es: No aplicable
fr: Non applicable
ko: 해당 사항 없음
pl: Nie dotyczy
pt_br: Não aplicável
tr: Geçerli değil
zh_hans: 不适用
zh_hant: 不適用

source: Prefer collection expression
cs: Preferovat výraz kolekce
de: Sammlungsausdruck bevorzugen
es: Preferir expresión de colección
fr: Préférer une expression de collection
ko: 컬렉션 식 선호
pl: Preferuj wyrażenie kolekcji
pt_br: Preferir a expressão de coleção
tr: Koleksiyon ifadesini tercih et
zh_hans: 首选集合表达式
zh_hant: 慣用集合運算式

source: Prefer primary constructors
cs: Upřednostňovat primární konstruktory
de: Primäre Konstruktoren bevorzugen
es: Preferir constructores principales
fr: Préférez les constructeurs primaires
ko: 기본 생성자 선호
pl: Preferuj konstruktory podstawowe
pt_br: Preferir construtores primários
tr: Birincil oluşturucuları tercih et
zh_hans: 首选主构造函数
zh_hant: 偏好使用主要建構函式

source: Prefer static anonymous functions
de: Statische anonyme Funktionen bevorzugen
es: Preferir las funciones anónimas estáticas
fr: Préférer les fonctions anonymes statiques
ko: 정적 익명 함수 선호
pl: Preferuj statyczne funkcje anonimowe
pt_br: Preferir funções anônimas estáticas
tr: Statik anonim işlevleri tercih edin
zh_hans: 首选静态匿名函数
zh_hant: 偏好靜態匿名函式

source: Rerun generator
de: Generator erneut ausführen
es: Volver a ejecutar el generador
fr: Réexécuter le générateur
ko: 생성기 다시 실행
pl: Uruchom ponownie generator
pt_br: Executar o gerador novamente
tr: Oluşturucuyu yeniden çalıştır
zh_hans: 重新运行生成器
zh_hant: 重新執行產生器

source: Roslyn save command handler
es: Controlador del comando Guardar de Roslyn
ko: Roslyn 저장 명령 처리기
pt_br: Manipulador de comandos "salvar" do Roslyn

# Search_cancelled
source: Search canceled
de: Suche abgebrochen
es: Búsqueda cancelada
fr: Recherche annulée
ko: 검색 취소됨
pl: Wyszukiwanie anulowane
pt_br: Pesquisa cancelada
tr: Arama iptal edildi
zh_hans: 搜索已取消
zh_hant: 搜尋已取消

# Search_found_no_results_no_csharp_or_vb_projects_opened
source: Search found no results: no C# or Visual Basic projects are opened
de: Die Suche hat keine Ergebnisse gefunden: Es wurden keine C#- oder Visual Basic-Projekte geöffnet.
es: La búsqueda no ha encontrado resultados: no hay proyectos de C# o Visual Basic abiertos
fr: La recherche n’a trouvé aucun résultat : aucun projet C# ou Visual Basic n’est ouvert
ko: 검색 결과 없음: C# 또는 Visual Basic 프로젝트가 열려 있지 않음
pl: Wyszukiwanie nie znalazło żadnych wyników: nie otwarto projektów języka C# ani Visual Basic
pt_br: A pesquisa não encontrou resultados: nenhum projeto em C# ou Visual Basic está aberto
tr: Arama sonucu bulunamadı: C# veya Visual Basic projesi açılmadı
zh_hans: 搜索未找到任何结果: 未打开任何 C# 或 Visual Basic 项目
zh_hant: 搜尋找不到任何結果: 未開啟任何 C# 或 Visual Basic 專案

source: Semantic Search ({0})
de: Semantische Suche ({0})
es: Búsqueda semántica ({0})
fr: Recherche sémantique ({0})
ko: 의미 체계 검색({0})
pl: Wyszukiwanie semantyczne ({0})
pt_br: Pesquisa Semântica ({0})
tr: Anlamsal Arama ({0})
zh_hans: 语义搜索({0})
zh_hant: 語意搜尋 ({0})

source: Semantic Search Results
de: Semantische Suchergebnisse
es: Resultados de búsqueda semántica
fr: Résultats de la recherche sémantique
ko: 의미 체계 검색 결과
pl: Wyniki wyszukiwania semantycznego
pt_br: Resultados da Pesquisa Semântica
tr: Anlamsal Arama Sonuçları
zh_hans: 语义搜索结果
zh_hant: 語意搜尋結果

source: Source Generators
de: Quellgeneratoren
es: Generadores de origen
fr: Générateurs sources
ko: 원본 생성기
pl: Generatory źródłowe
pt_br: Geradores de Fonte
tr: Kaynak Oluşturucular
zh_hans: 源生成器
zh_hant: 來源產生器

source: Source generator execution (requires restart):
de: Ausführung des Quellgenerators (Neustart erforderlich):
es: Ejecución del generador de origen (requiere un reinicio):
fr: Exécution du générateur source (redémarrage nécessaire) :
ko: 원본 생성기 실행(다시 시작 필요):
pl: Wykonywanie generatora źródła (wymaga ponownego uruchomienia):
pt_br: Execução do gerador de fonte (requer reinicialização):
tr: Kaynak oluşturucu yürütmesi (yeniden başlatma gerektirir):
zh_hans: 源生成器执行(需要重启):
zh_hant: 來源產生器執行 (需要重新啟動):

source: Strike out obsolete symbols
de: Veraltete Symbole streichen
es: Tachado de símbolos obsoletos
fr: Symboles obsolètes barrés
ko: 사용되지 않는 기호 취소
pl: Wykreśl przestarzałe symbole
pt_br: Riscar os símbolos obsoletos
tr: Kullanımdan kaldıran sembollerin üzerini çiz
zh_hans: 划掉过时的符号
zh_hant: 刪去已淘汰的符號

source: 'System.Void' is not a valid type for a parameter
cs: System.Void není platný typ parametru
de: "System.Void" ist kein gültiger Typ für einen Parameter.
es: "System.Void" no es un tipo válido para un parámetro
fr: « System.Void » n’est pas un type valide pour un paramètre
ko: 'System.Void'는 매개 변수에 유효한 형식이 아닙니다.
pl: Element „System.Void” nie jest prawidłowym typem parametru
pt_br: 'System.Void' não é um tipo válido para um parâmetro
tr: 'System.Void', parametre için geçerli bir tür değil
zh_hans: “System.Void” 不是参数的有效类型
zh_hant: 'System.Void' 不是參數的有效類型

source: The project no longer exists
de: Das Projekt ist nicht mehr vorhanden.
es: Ya no existe el proyecto
fr: Le projet n’existe plus
ko: 프로젝트가 더 이상 존재하지 않음
pl: Projekt już nie istnieje
pt_br: O projeto não existe mais
tr: Proje artık yok
zh_hans: 该项目不再存在
zh_hant: 該專案已不存在

source: This file was generated by '{0}' at {1} and cannot be edited.
de: Diese Datei wurde von „{0}“ um {1} generiert und kann nicht bearbeitet werden.
es: "{0}"' ha generado este archivo en {1} y no se puede editar.
fr: Ce fichier a été généré par « {0} » à {1} et ne peut pas être modifié.
ko: 이 파일은 {1}의 '{0}' 의해 생성되었으며 편집할 수 없습니다.
pl: Ten plik został wygenerowany przez „{0}” o {1} i nie można go edytować.
pt_br: Esse arquivo foi gerado por "{0}" em {1} e não pode ser editado.
tr: Bu dosya, '{0}' tarafından {1} itibarıyla oluşturuldu ve düzenlenemez.
zh_hans: 此文件由 "{0}" 在 {1} 生成，无法编辑。
zh_hant: 此檔案已在 {1} 由 '{0}' 產生，並且無法編輯。

source: When types exactly match
cs: Když se typy přesně shodují
de: Wenn Typen exakt übereinstimmen
es: Cuando los tipos coinciden exactamente
fr: Lorsque les types correspondent exactement
ko: 형식이 정확히 일치하는 경우
pl: Gdy typy są dokładnie zgodne
pt_br: Quando os tipos correspondem exatamente
tr: Türler tam olarak eşleştiğinde
zh_hans: 当类型严格匹配时
zh_hant: 當類型完全相符時

source: When types loosely match
cs: Když se typy volně shodují
de: Wenn Typen lose übereinstimmen
es: Cuando los tipos coinciden ligeramente
fr: Lorsque les types correspondent peu
ko: 형식이 느슨하게 일치하는 경우
pl: Gdy typy są luźno zgodne
pt_br: Quando os tipos correspondem vagamente
tr: Türler yaklaşık olarak eşleştiğinde
zh_hans: 当类型宽松匹配时
zh_hant: 當類型鬆散相符時

source: None
cs: žádné
fr: Aucun(e)
ja: なし
pt_br: NENHUM
tr: yok

source: Prefer 'System.Threading.Lock'
de: „System.Threading.Lock“ bevorzugen
fr: Préférez 'System.Threading.Lock'
pl: Preferuj typ „System.Threading.Lock”
tr: 'System.Threading.Lock' türünü tercih edin
zh_hans: 首选 'System.Threading.Lock'
zh_hant: 偏好 'System.Threading.Lock'

source: Show hints for collection expressions
de: Hinweise für Sammlungsausdrücke anzeigen
fr: Afficher les indicateurs pour les expressions de collection
pl: Pokaż wskazówki dla wyrażeń kolekcji
tr: Koleksiyon ifadeleri için ipuçlarını göster
zh_hans: 显示集合表达式的提示
zh_hant: 顯示集合運算式的提示

source: _Always add new line on enter
pl: _Zawsze dodawaj nowy wiersz po naciśnięciu klawisza Enter
zh_hans: 始终在按下 Enter 时添加新行(_A)
zh_hant: 一律在按下 Enter 鍵時加入新行(_A)

source: Code preview
zh_hans: 代码预览

source: Display diagnostics inline
zh_hans: 内联显示诊断

source: Editor Help
pl: Pomoc edytora
zh_hans: 编辑器帮助
zh_hant: 編輯器說明

source: Enter key behavior
pl: Zachowanie klawisza Enter
zh_hans: 回车键的行为
zh_hant: ENTER 鍵行為

# Enter_key_behavior_colon
source: Enter key behavior:
pl: Zachowanie klawisza Enter:
zh_hans: 输入关键行为:
zh_hant: Enter 鍵行為:

source: Error encountered updating '{0}'
zh_hans: 更新 ‘{0}’ 时遇到错误

source: Experimental feature
pl: Funkcja eksperymentalna
zh_hans: 实验性功能
zh_hant: 實驗性功能

source: Fade out unused members
pl: Zanikanie nieużywanych elementów członkowskich
zh_hans: 淡出未使用的成员
zh_hant: 淡出未使用的成員

source: Fix text pasted into string literals
zh_hans: 修复粘贴到字符串字面量中的文本

source: Generate only <summary> tag
zh_hans: 仅生成 <summary> 标记

source: Generate <summary> on single line
zh_hans: 在单行上生成 <summary>

source: Highlight matching portions of completion list items
pl: Wyróżnij pasujące fragmenty elementów listy uzupełnień
zh_hans: 突出显示完成列表项的匹配部分
zh_hant: 醒目提示自動完成清單項目的相符部分

source: _Highlight references to symbol under cursor
pl: _Wyróżnij odwołania do symbolu pod kursorem
zh_hans: 突出显示对光标下符号的引用(_H)
zh_hant: 反白顯示資料指標下符號的參考項目(_H)

source: Highlight related _keywords under cursor
pl: Wyróżnij powiązane _słowa kluczowe pod kursorem
zh_hans: 突出显示光标下相关的关键字(_K)
zh_hant: 反白資料指標下的相關關鍵字(_K)

source: Highlighting
pl: Wyróżnianie
zh_hans: 突出显示
zh_hant: 反白

source: Ignore
zh_hans: 忽略

source: Ignore (including future errors)
zh_hans: 忽略(包括将来的错误)

source: Insert Snippet
pl: Wstaw fragment kodu
zh_hans: 插入片段
zh_hant: 插入程式碼片段

source: Large
pl: Duży
zh_hans: 大
zh_hant: 大

source: _Never add new line on enter
pl: _Nigdy nie dodawaj nowego wiersza po naciśnięciu klawisza Enter
zh_hans: 按下 Enter 时不添加新行(_N)
zh_hant: 永不在按下 Enter 鍵時加入新行(_N)

source: Never include snippets
pl: Nigdy nie dołączaj fragmentów kodu
zh_hans: 从不包含片段
zh_hant: 一律不包含程式碼片段

source: Only add new line on enter after end of fully typed word
pl: Dodaj nowy wiersz tylko po naciśnięciu klawisza Enter na końcu w pełni wpisanego wyrazu
zh_hans: 只在键入完整的单词后点击回车后才添加新行
zh_hant: 只在完整鍵入字的結尾處按 ENTER 來新增新行

source: Optimize for solution size
pl: Optymalizuj pod kątem rozmiaru rozwiązania
zh_hans: 优化解决方案大小
zh_hant: 最佳化方案大小

source: Performance
pl: Wydajność
zh_hans: 性能
zh_hant: 效能

source: Prefer simple property accessors
zh_hans: 首选简单属性访问器

source: Prefer unbound generic type in 'nameof'
pl: Preferuj niepowiązany typ ogólny w elem. "nameof"
zh_hans: 首选 “nameof” 中的未绑定泛型类型
zh_hant: 優先使用 『nameof』 中的未系結泛型型別

source: Regular
pl: Standardowy
zh_hans: 常规
zh_hant: 一般

source: Removed {0}
zh_hans: 已移除 {0}

source: Search members
zh_hans: 搜索成员

source: Show "Remove Unused References" command in Solution Explorer
pl: Pokaż polecenie „Usuń nieużywane odwołania” w Eksploratorze rozwiązań
zh_hans: 在解决方案资源管理器中显示“删除未使用的引用”命令
zh_hant: 在方案總管中顯示「移除未使用的參考」命令

source: Show completion item _filters
pl: Pokaż _filtry elementów uzupełniania
zh_hans: 显示完成项筛选器(_F)
zh_hant: 顯示完成項目篩選(_F)

source: Show completion item filters
pl: Pokaż filtry elementów uzupełniania
zh_hans: 显示完成项筛选器
zh_hant: 顯示完成項目篩選

source: Show completion list after a character is _deleted
pl: Pokaż listę _uzupełniania po usunięciu znaku
zh_hans: 删除字符后显示完成列表(_D)
zh_hant: 刪除一個字元後顯示完成清單(_D)

source: Show completion list after a character is deleted
pl: Pokaż listę uzupełniania po usunięciu znaku
zh_hans: 删除字符后显示完成列表
zh_hant: 刪除字元後顯示自動完成清單

source: Show completion list after a character is typed
pl: Pokaż listę uzupełniania po wpisaniu znaku
zh_hans: 键入字符后显示完成列表
zh_hant: 在輸入的字元後方顯示完成清單

source: Show items from unimported namespaces
pl: Pokaż elementy z nieimportowanych przestrzeni nazw
zh_hans: 显示 unimported 命名空间中的项
zh_hant: 顯示來自未匯入命名空間的項目

source: Show preview for rename _tracking
pl: Pokaż podgląd śledzenia _zmian nazw
zh_hans: 显示重命名跟踪的预览(_T)
zh_hant: 顯示預覽以追蹤重新命名(_T)

source: _Show procedure line separators
pl: _Pokaż separatory wierszy procedury
zh_hans: 显示过程行分隔符(_S)
zh_hant: 顯示程序行分隔符號(_S)

source: Show remarks in Quick Info
pl: Pokaż uwagi w szybkich podpowiedziach
zh_hans: 在快速信息中显示备注
zh_hant: 在快速諮詢中顯示備註

source: Small
pl: Mały
zh_hans: 小
zh_hant: 小

source: Snippets behavior
pl: Zachowanie fragmentów kodu
zh_hans: 片段行为
zh_hant: 程式碼片段行為

source: Tab twice to insert arguments
pl: Naciśnij dwukrotnie klawisz Tab, aby wstawić argumenty
zh_hans: 按两次 Tab 键以插入参数
zh_hant: 按鍵兩次以插入引數

source: Tab twice to insert arguments (experimental)
pl: Dwukrotnie naciśnij klawisz Tab, aby wstawić argumenty (eksperymentalna)
zh_hans: 按两次 Tab 以插入参数(实验性)
zh_hant: 按 Tab 鍵兩次可插入引數 (實驗性)

source: Unused local
pl: Nieużywane zmienne lokalne
zh_hans: 未使用的本地
zh_hant: 未使用的區域函式

source: Warning {0} does not bind to type
zh_hans: 警告 {0} 未绑定到类型

source: _Highlight matching portions of completion list items
pl: _Wyróżnij pasujące fragmenty elementów listy uzupełniania
zh_hans: 突出显示完成列表项的匹配部分(_H)
zh_hant: 反白完成清單項目的相符部分(_H)

source: _Only add new line on enter after end of fully typed word
pl: _Dodaj nowy wiersz po naciśnięciu klawisza Enter tylko po zakończeniu pełnego wpisanego wyrazu
zh_hans: _只有在完整键入的单词结尾后按下回车键时才添加新行
zh_hant: 僅在完整輸入的字結尾處按 Enter 鍵時加入新行(_O)

source: _Show completion list after a character is typed
pl: _Pokaż listę uzupełniania po wpisaniu znaku
zh_hans: 键入字符后显示完成列表(_S)
zh_hant: 輸入一個字元後顯示完成清單(_S)

source: A new .editorconfig file was detected at the root of your solution. Would you like to make it a solution item?
ja: 新しい .editorconfig ファイルがソリューションのルートで検出されました。ソリューション項目にしますか?

# Background_analysis_scope_colon
source: Background analysis scope:
ja: バックグラウンドの分析スコープ:

# CSharp_Visual_Basic_Language_Server_Client
source: C#/Visual Basic Language Server Client
ja: C#/Visual Basic 言語サーバー クライアント

# Live_Share_CSharp_Visual_Basic_Language_Server_Client
source: Live Share C#/Visual Basic Language Server Client
ja: Live Share C#/Visual Basic 言語サーバー クライアント

# Razor_CSharp_Language_Server_Client
source: Razor C# Language Server Client
ja: Razor C# 言語サーバー クライアント

source: Miscellaneous Files
it: File esterni
ja: その他のファイル

source: Get help for '{0}'
it: Visualizza la Guida per '{0}'
ja: {0}' のヘルプの表示

source: Get help for '{0}' from Bing
it: Visualizza la Guida per '{0}' disponibile in Bing
ja: Bing から '{0}' のヘルプを表示します

source: Unfortunately, a process used by Visual Studio has encountered an unrecoverable error. We recommend saving your work, and then closing and restarting Visual Studio.
it: Si è verificato un errore irreversibile in un processo usato da Visual Studio. È consigliabile salvare il lavoro e quindi chiudere e riavviare Visual Studio.
ja: Visual Studio で使用されたプロセスで、修復不可能なエラーが発生しました。作業内容を保存してから Visual Studio を終了し、再起動してください。

# Enable_navigation_to_decompiled_sources
source: Enable navigation to decompiled sources (experimental)
it: Abilita lo spostamento in origini decompilate (sperimentale)
ja: 逆コンパイルされたソースへのナビゲーションを有効にする (試験段階)

# Decompiler_Legal_Notice_Title
source: Decompiler Legal Notice
it: Note legali sul decompilatore
ja: デコンパイラの法的通知

source: Classifications
it: Classificazioni

source: Enable nullable reference analysis IDE features
it: Abilita le funzionalità IDE per l'analisi dei riferimenti nullable

# Use_editorconfig_compatibility_mode
source: Use .editorconfig compatibility mode (requires restart)
it: Usa la modalità di compatibilità di .editorconfig (richiede il riavvio)

source: Use enhanced colors for C# and Basic
it: Usa colori migliorati per C# e Basic

source: Interface name conflicts with an existing type name.
it: Il nome di interfaccia è in conflitto con un nome di tipo esistente.

source: Interface name is not a valid {0} identifier.
it: Il nome di interfaccia non è un identificatore {0} valido.

source: Error reading ruleset file {0} - {1}
it: Si è verificato un errore durante la lettura del file del set di regole {0} - {1}

source: Enable full solution _analysis
it: Abilita _analisi della soluzione completa

# Decompiler_Legal_Notice_Message
source: IMPORTANT: Visual Studio includes decompiling functionality (“Decompiler”) that enables reproducing source code from binary code. By accessing and using the Decompiler, you agree to the Visual Studio license terms and the terms for the Decompiler below. If you do not agree with these combined terms, do not access or use the Decompiler. You acknowledge that binary code and source code might be protected by copyright and trademark laws. Before using the Decompiler on any binary code, you need to first: (i) confirm that the license terms governing your use of the binary code do not contain a provision which prohibits you from decompiling the software; or (ii) obtain permission to decompile the binary code from the owner of the software. Your use of the Decompiler is optional. Microsoft is not responsible and disclaims all liability for your use of the Decompiler that violates any laws or any software license terms which prohibit decompiling of the software. I agree to all of the foregoing:
it: IMPORTANTE: Visual Studio include la funzionalità di decompilazione (“Decompilatore”) che consente di riprodurre codice sorgente da codice binario. L'accesso e l'uso del Decompilatore implica l'accettazione delle condizioni di licenza di Visual Studio e delle condizioni per l'uso del Decompilatore riportate sotto. Se non si accettano entrambi tali condizioni, non accedere o usare il Decompilatore. L'utente riconosce che il codice binario e il codice sorgente potrebbero essere protetti dalle normative su marchi e copyright. Prima di usare il Decompilatore su qualsiasi codice binario, l'utente deve: (i) confermare che le condizioni di licenza che regolano l'uso del codice binario non contengono una disposizione che impedisce la decompilazione del software; oppure (ii) ottenere l'autorizzazione alla decompilazione del codice binario dal proprietario del software. L'uso del Decompilatore è facoltativo. Microsoft non è responsabile e non riconosce alcuna responsabilità nel caso in cui l'utente usi il Decompilatore in violazione di normative o condizioni di licenza software che proibiscono la decompilazione del software. L'utente accetta le condizioni sopra riportate:
