Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Type_Parameters_colon
source: Type Parameters:
cs: Parametry typu:
de: Typparameter:
es: Parámetros de tipo:
fr: Paramètres de type :
it: Parametri di tipo:
ja: 型パラメーター:
ko: 형식 매개 변수:
pl: Parametry typu:
pt_br: Parâmetros de Tipo:
ru: Параметры типа:
tr: Tür Parametreleri:
zh_hans: 类型参数:
zh_hant: 類型參數:

source: File already exists
cs: Soubor už existuje.
de: Die Datei ist bereits vorhanden.
es: Ya existe el archivo
fr: Le fichier existe déjà
it: Il file esiste già
ja: ファイルは既に存在します
ko: 파일이 이미 존재함
pl: Plik już istnieje
pt_br: O arquivo já existe
ru: Файл уже существует.
tr: Dosya zaten var
zh_hans: 文件已存在
zh_hant: 檔案已存在

source: File path cannot use reserved keywords
cs: Cesta k souboru nemůže používat vyhrazená klíčová slova.
de: Im Dateipfad dürfen keine reservierten Schlüsselwörter verwendet werden.
es: La ruta de acceso del archivo no puede usar palabras clave reservadas
fr: Le chemin du fichier ne peut pas utiliser des mots clés réservés
it: Nel percorso file non si possono usare parole chiave riservate
ja: ファイル パスには予約されたキーワードを使用できません
ko: 파일 경로는 예약된 키워드를 사용할 수 없습니다.
pl: Ścieżka pliku nie może zawierać zastrzeżonych słów kluczowych
pt_br: O caminho do arquivo não pode usar palavras-chave reservadas
ru: В пути к файлу нельзя использовать зарезервированные ключевые слова.
tr: Dosya yolunda ayrılmış anahtar sözcükler kullanılamaz
zh_hans: 文件路径无法使用保留的关键字
zh_hant: 檔案路徑無法使用保留的關鍵字

source: DocumentPath is illegal
cs: Cesta DocumentPath není platná.
de: DocumentPath ist unzulässig.
es: El valor de DocumentPath no es válido
fr: DocumentPath n'est pas autorisé
it: Il valore di DocumentPath non è valido
ja: DocumentPath が無効です
ko: DocumentPath가 잘못되었습니다.
pl: Element DocumentPath jest nieprawidłowy
pt_br: O DocumentPath é ilegal
ru: Параметр DocumentPath недопустим.
tr: DocumentPath geçersiz
zh_hans: DocumentPath 非法
zh_hant: DocumentPath 不合法

source: Project Path is illegal
cs: Cesta k projektu není platná.
de: Der Projektpfad ist unzulässig.
es: La ruta de acceso del proyecto no es válida
fr: Le chemin du projet n'est pas autorisé
it: Il percorso del progetto non è valido
ja: プロジェクトのパスが無効です
ko: 프로젝트 경로가 잘못되었습니다.
pl: Ścieżka projektu jest nieprawidłowa
pt_br: O Caminho do Projeto é ilegal
ru: Путь проекта недопустим.
tr: Proje Yolu geçersiz
zh_hans: 项目路径非法
zh_hant: 專案路徑不合法

source: Path cannot have empty filename
cs: Cesta nemůže obsahovat prázdný název souboru.
de: Der Pfad darf keinen leeren Dateinamen enthalten.
es: La ruta de acceso no puede tener un nombre de archivo vacío
fr: Le chemin ne peut pas avoir un nom de fichier vide
it: Il percorso non può contenere nomi file vuoti
ja: パスのファイル名を空にすることはできません
ko: 경로에는 빈 파일 이름이 있을 수 없습니다.
pl: Ścieżka nie może zawierać pustej nazwy pliku
pt_br: O caminho não pode ter nome de arquivo vazio
ru: Имя файла в пути не может быть пустым.
tr: Yoldaki dosya adı boş olamaz
zh_hans: 路径中不能包含空文件名
zh_hant: 路徑檔名不得為空白

source: The given DocumentId did not come from the Visual Studio workspace.
cs: Dané DocumentId nepochází z pracovního prostoru sady Visual Studio.
de: Die angegebene DocumentId stammt nicht aus dem Visual Studio-Arbeitsbereich.
es: El DocumentId en cuestión no provenía del área de trabajo de Visual Studio.
fr: Le DocumentId donné ne provient pas de l'espace de travail Visual Studio.
it: L'elemento DocumentId specificato non proviene dall'area di lavoro di Visual Studio.
ja: 指定された DocumentId は、Visual Studio のワークスペースからのものではありません。
ko: 제공된 DocumentId는 Visual Studio 작업 영역에서 가져오지 않았습니다.
pl: Dany element DocumentId nie pochodzi z obszaru roboczego programu Visual Studio.
pt_br: O DocumentId fornecido não veio do workspace do Visual Studio.
ru: Указанный идентификатор документа DocumentId получен не из рабочей области Visual Studio.
tr: Sağlanan DocumentId değeri, Visual Studio çalışma alanında bulunmuyor.
zh_hans: 给定的 DocumentId 并非来自 Visual Studio 工作区。
zh_hant: 給定的 DocumentId 並非來自 Visual Studio 工作區。

source: Project: {0} ({1}) Use the dropdown to view and switch to other projects this file may belong to.
cs: Projekt: {0} ({1}) V rozevíracím seznamu si můžete zobrazit jiné projekty, ke kterým by tento soubor mohl patřit, a případně na ně rovnou přepnout.
de: Projekt: {0} ({1}) Verwenden Sie die Dropdownliste, um weitere zu dieser Datei gehörige Projekte anzuzeigen und zu diesen zu wechseln.
es: Proyecto: {0} ({1}) Use la lista desplegable para ver y cambiar a otros proyectos a los que puede pertenecer este archivo.
fr: Projet : {0} ({1}) Utilisez le menu déroulant pour afficher et basculer vers d'autres projets auquel ce fichier peut appartenir.
it: Progetto:{0} ({1}) Usare l'elenco a discesa per visualizzare e passare ad altri progetti a cui il file potrebbe appartenere.
ja: プロジェクト: {0} ({1}) ドロップダウンを使用して、このファイルが属している可能性のある他のプロジェクトを表示し、それらのプロジェクトに切り替えます。
ko: 프로젝트: {0}({1}) 드롭다운을 사용하여 이 파일이 속할 수 있는 다른 프로젝트를 보고 해당 프로젝트로 전환합니다.
pl: Projekt: {0} ({1}) Przy użyciu menu rozwijanego możesz przeglądać inne projekty, do których może należeć ten plik, i przełączać się na nie.
pt_br: Projeto: {0} ({1}) Use a lista suspensa para exibir e mudar entre outros projetos aos quais este arquivo possa pertencer.
ru: Проект: {0} ({1}) Используйте раскрывающийся список для просмотра других проектов, к которым может относиться этот файл, и перехода к ним.
tr: Proje: {0} ({1}) Bu dosyanın ait olabileceği diğer projeleri görüntülemek ve bunlara geçiş yapmak için açılan menüyü kullanın.
zh_hans: 项目: {0} ({1}) 使用下拉列表可查看和切换到此文件所属的其他项目。
zh_hant: 專案: {0} ({1}) 使用下拉式清單，即可檢視並切換至此檔案可能所屬的其他專案。

source: {0} Use the dropdown to view and navigate to other items in this file.
cs: {0} V rozevíracím seznamu si můžete zobrazit ostatní položky v tomto souboru a případně na ně rovnou přejít.
de: {0} Verwenden Sie die Dropdownliste, um weitere Elemente in dieser Datei anzuzeigen und zu diesen zu wechseln.
es: {0} Use el menú desplegable para ver y navegar a otros elementos de este archivo.
fr: {0} Utilisez le menu déroulant pour afficher d'autres éléments dans ce fichier, et y accéder.
it: {0} Usare l'elenco a discesa per visualizzare e spostarsi tra altri elementi in questo file.
ja: {0} ドロップダウンを使用して、このファイル内の他の項目を表示し、そこに移動します。
ko: {0} 드롭다운을 사용하여 이 파일의 다른 항목을 보고 탐색합니다.
pl: {0} Przy użyciu menu rozwijanego możesz wyświetlać inne elementy w tym pliku i przechodzić do nich.
pt_br: {0} Use a lista suspensa para exibir e navegar para outros itens neste arquivo.
ru: {0} Для просмотра других элементов в этом файле используйте раскрывающийся список.
tr: {0} Bu dosyadaki diğer öğeleri görüntülemek ve bu öğelere gitmek için açılan menüyü kullanın.
zh_hans: {0} 使用下拉列表可查看并导航到此文件中的其他项。
zh_hant: {0} 使用下拉式清單，即可檢視並巡覽至此檔案中的其他項目。

source: Project: {0} Use the dropdown to view and switch to other projects this file may belong to.
cs: Projekt: {0} V rozevíracím seznamu si můžete zobrazit jiné projekty, ke kterým by tento soubor mohl patřit, a případně na ně rovnou přepnout.
de: Projekt: {0} Verwenden Sie die Dropdownliste, um weitere zu dieser Datei gehörige Projekte anzuzeigen und zu diesen zu wechseln.
es: Proyecto: {0} Use la lista desplegable para ver y cambiar a otros proyectos a los que puede pertenecer este archivo.
fr: Projet : {0} Utilisez le menu déroulant pour afficher et basculer vers d'autres projets auquel ce fichier peut appartenir.
it: Progetto: {0} Usare l'elenco a discesa per visualizzare e passare ad altri progetti a cui questo file potrebbe appartenere.
ja: プロジェクト: {0} ドロップダウンを使用して、このファイルが属している可能性のある他のプロジェクトを表示し、それらのプロジェクトに切り替えます。
ko: 프로젝트: {0} 드롭다운을 사용하여 이 파일이 속할 수 있는 다른 프로젝트를 보고 해당 프로젝트로 전환합니다.
pl: Projekt: {0} Użyj listy rozwijanej, aby wyświetlać inne projekty, do których może należeć ten plik i przełączać się do nich.
pt_br: Projeto: {0} Use a lista suspensa para exibir e mudar entre outros projetos aos quais este arquivo possa pertencer.
ru: Проект: {0} Используйте раскрывающийся список для просмотра других проектов, к которым может относиться этот файл, и перехода к ним.
tr: Proje: {0} Bu dosyanın ait olabileceği diğer projeleri görüntülemek ve bunlara geçiş yapmak için açılan menüyü kullanın.
zh_hans: 项目: {0} 使用下拉列表可查看和切换到此文件所属的其他项目。
zh_hant: 專案: {0} 使用下拉式清單可以檢視並切換至這個檔案所屬的其他專案。

source: The analyzer assembly '{0}' has changed. Diagnostics may be incorrect until Visual Studio is restarted.
cs: Sestavení analyzátoru {0} se změnilo. Diagnostika možná nebude odpovídat skutečnosti, dokud se Visual Studio nerestartuje.
de: Die Analysetoolassembly "{0}" wurde geändert. Die Diagnose ist bis zu einem Neustart von Visual Studio möglicherweise nicht korrekt.
es: El ensamblado del analizador "{0}" cambió. Los diagnósticos podrían ser incorrectos hasta que se reinicie Visual Studio.
fr: L'assembly d'analyseur '{0}' a été modifié. Les diagnostics seront incorrects jusqu'au redémarrage de Visual Studio.
it: L'assembly '{0}' dell'analizzatore è stato modificato. È possibile che la diagnostica non sia corretta fino al riavvio di Visual Studio.
ja: アナライザー アセンブリ '{0}' が変更されました。Visual Studio を再起動するまで正しい診断ができない可能性があります。
ko: 분석기 어셈블리 '{0}'이(가) 변경되었습니다. Visual Studio를 다시 시작할 때까지 진단이 올바르지 않을 수 있습니다.
pt_br: O assembly do analisador '{0}' mudou. O diagnóstico pode estar incorreto até que o Visual Studio seja reiniciado.
ru: Сборка анализатора "{0}" была изменена. Перезапустите Visual Studio, в противном случае диагностика может быть неправильной.
tr: Çözümleyici bütünleştirilmiş kodu '{0}' değiştirildi. Visual Studio yeniden başlatılmazsa tanılama yanlış olabilir.

# CSharp_VB_Diagnostics_Table_Data_Source
source: C#/VB Diagnostics Table Data Source
it: Origine dati tabella diagnostica C#/VB
ja: C#/VB 診断テーブル データ ソース
ru: Источник данных для таблицы диагностики C#/VB

# CSharp_VB_Todo_List_Table_Data_Source
source: C#/VB Todo List Table Data Source
it: Origine dati tabella elenco TODO C#/VB
ja: C#/VB Todo リスト テーブル データ ソース
ru: Источник данных для таблицы списка задач C#/VB

source: Cancel
cs: Storno
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
tr: İptal

source: _Deselect All
cs: _Zrušit výběr
de: Auswahl _aufheben
es: _Anular toda la selección
fr: _Désélectionner tout
it: _Deseleziona tutto
ja: すべて選択解除(_D)
ko: 모두 선택 취소(_D)
pl: _Odznacz wszystkie
pt_br: _Desmarcar Tudo
ru: _Отменить все
tr: _Tüm Seçimleri Kaldır
zh_hans: 取消全选(_D)
zh_hant: 全部取消選取(_D)

source: Extract Interface
cs: Extrahovat rozhraní
de: Schnittstelle extrahieren
es: Extraer interfaz
fr: Extraire l'interface
it: Estrai interfaccia
ja: インターフェイスの抽出
ko: 인터페이스 추출
pt_br: Extrair a Interface
ru: Извлечь интерфейс
tr: Arabirimi Ayıkla

# Generated_name_colon
source: Generated name:
cs: Vygenerovaný název:
de: Generierter Name:
es: Nombre generado:
fr: Nom généré :
it: Nome generato:
ja: 生成された名前:
ko: 생성된 이름:
pl: Wygenerowana nazwa:
pt_br: Nome gerado:
ru: Созданное название:
tr: Oluşturulan ad:
zh_hans: 生成的名称:
zh_hant: 產生的名稱:

# New_file_name_colon
source: New _file name:
cs: Nový _název souboru:
de: Neuer _Dateiname:
es: Nuevo nombre de _archivo:
fr: Nouveau nom de _fichier :
it: Nome nuovo _file:
ja: 新しいファイル名(_F):
ko: 새 파일 이름(_F):
pl: Nowa nazwa _pliku:
pt_br: Nome do novo _arquivo:
ru: Новое им_я файла:
tr: Yeni _dosya adı:
zh_hans: 新文件名(_F):
zh_hant: 新檔名(_F):

# New_interface_name_colon
source: New _interface name:
cs: Nový ná_zev rozhraní:
de: Name der neuen _Schnittstelle:
es: _Nuevo nombre de interfaz:
fr: Nouveau nom d'_interface :
it: Nome nuova _interfaccia:
ja: 新しいインターフェイス名(_I):
ko: 새 인터페이스 이름(_I):
pl: Nowa nazwa _interfejsu:
pt_br: Nome da nova _interface:
ru: Новое название _интерфейса:
tr: Yeni _arabirim adı:
zh_hans: 新接口名称(_I):
zh_hant: 新介面名稱(_I):

source: OK
es: Aceptar
ko: 확인
ru: ОК
tr: Tamam
zh_hans: 确定
zh_hant: 確定

source: _Select All
cs: _Vybrat vše
de: _Alle auswählen
es: _Seleccionar todo
fr: Tout _sélectionner
it: _Seleziona tutto
ja: すべて選択(_S)
ko: 모두 선택(_S)
pl: _Zaznacz wszystko
pt_br: _Selecionar Tudo
ru: В_ыбрать все
tr: _Tümünü Seç
zh_hans: 全选(_S)
zh_hant: 全選(_S)

source: Select public _members to form interface
cs: Vybrat veřejné č_leny, ze kterých se sestaví rozhraní
de: Öffentliche _Member zum Bilden einer Schnittstelle auswählen
es: Seleccionar miembros _públicos para formar interfaz
fr: Sélectionner les _membres publics pour former l'interface
it: Seleziona i _membri pubblici per l'interfaccia
ja: インターフェイスを形成するパブリック メンバーを選択する(_M)
ko: 인터페이스를 구성할 공용 멤버 선택(_M)
pl: Wybierz publiczne _elementy członkowskie, aby utworzyć interfejs
pt_br: Selecionar _membros públicos para formar a interface
ru: Выбрать открытые _элементы для создания интерфейса
tr: Arabirim oluşturmak için ortak _üyeleri seçin
zh_hans: 选择构成接口的公共成员(_M)
zh_hant: 選取公用成員以形成介面(_M)

# Access_colon
source: _Access:
cs: _Přístup:
de: _Zugriff:
es: _Acceso:
fr: _Accès :
it: _Accesso:
ja: アクセス(_A):
ko: 액세스(_A):
pl: _Dostęp:
pt_br: _Acessar:
ru: Д_оступ:
tr: _Erişim:
zh_hans: 访问(_A):
zh_hant: 存取(_A):

source: Add to _existing file
cs: Přidat do _existujícího souboru
de: Zu _vorhandener Datei hinzufügen
es: Agregar a archivo _existente
fr: Ajouter au fichier e_xistant
it: Aggiungi a file _esistente
ja: 既存ファイルに追加(_E)
ko: 기존 파일에 추가(_E)
pl: Dodaj do _istniejącego pliku
pt_br: Adicionar ao arquivo _existente
ru: Добавить в _существующий файл
tr: _Mevcut dosyaya ekle
zh_hans: 添加到现有文件(_E)
zh_hant: 新增至現有檔案(_E)

source: Change Signature
cs: Změnit signaturu
de: Signatur ändern
es: Cambiar firma
fr: Modifier la signature
it: Cambia firma
ja: 署名の変更
ko: 시그니처 변경
pt_br: Alterar Assinatura
ru: Изменить сигнатуру
tr: İmzayı Değiştir

source: _Create new file
cs: _Vytvořit nový soubor
de: Neue Datei _erstellen
es: _Crear nuevo archivo
fr: _Créer un fichier
it: _Crea nuovo file
ja: 新しいファイルの作成(_C)
ko: 새 파일 만들기(_C)
pl: _Utwórz nowy plik
pt_br: _Criar novo arquivo
ru: _Создать файл
tr: Yeni dosya _oluştur
zh_hans: 创建新文件(_C)
zh_hant: 建立新檔案(_C)

source: Default
cs: Výchozí
de: Standard
es: Predeterminado
fr: Par défaut
it: Predefinito
ja: 既定
ko: 기본값
pl: Domyślny
pt_br: Padrão
ru: По умолчанию
tr: Varsayılan
zh_hans: 默认值
zh_hant: 預設

# File_Name_colon
source: File Name:
cs: Název souboru:
de: Dateiname:
es: Nombre de archivo:
fr: Nom du fichier :
it: Nome file:
ja: ファイル名:
ko: 파일 이름:
pl: Nazwa pliku:
pt_br: Nome do Arquivo:
ru: Имя файла:
tr: Dosya Adı:
zh_hans: 文件名:
zh_hant: 檔案名稱:

source: Generate Type
cs: Generovat typ
de: Typ generieren
es: Generar tipo
fr: Générer le type
it: Genera tipo
ja: 型の生成
ko: 형식 생성
pl: Generuj typ
pt_br: Gerar Tipo
ru: Сформировать тип
tr: Tür Oluştur
zh_hans: 生成类型
zh_hant: 產生類型

# Kind_colon
source: _Kind:
cs: _Druh:
de: _Art:
es: _Tipo:
fr: _Genre :
it: _Tipo:
ja: 種類(_K):
ko: 종류(_K):
pl: _Rodzaj:
pt_br: _Tipo:
ru: _Вид:
tr: _Tür:
zh_hans: 种类(_K):
zh_hant: 類型(_K):

# Location_colon
source: Location:
cs: Umístění:
de: Speicherort:
es: Ubicación:
fr: Emplacement :
it: Posizione:
ja: 場所:
ko: 위치:
pl: Lokalizacja:
pt_br: Local:
ru: Расположение:
tr: Konum:
zh_hans: 位置:
zh_hant: 位置:

source: Modifier
cs: Modifikátor
de: Modifizierer
es: Modificador
fr: Modificateur
it: Modificatore
ja: 修飾子
ko: 한정자
pl: Modyfikator
pt_br: Modificador
ru: Модификатор
tr: Değiştirici
zh_hans: 修饰符
zh_hant: 修飾元

# Name_colon1
source: Name:
cs: Název:
es: Nombre:
fr: Nom :
it: Nome:
ja: 名前:
ko: 이름:
pl: Nazwa:
pt_br: Nome:
ru: Название:
tr: Ad:
zh_hans: 名称:
zh_hant: 名稱:

source: Parameter
cs: Parametr
es: Parámetro
fr: Paramètre
it: Parametro
ja: パラメーター
ko: 매개 변수
pl: Parametr
pt_br: Parâmetro
ru: Параметр
tr: Parametre
zh_hans: 参数
zh_hant: 參數

# Parameters_colon2
source: Parameters:
cs: Parametry:
de: Parameter:
es: Parámetros:
fr: Paramètres :
it: Parametri:
ja: パラメーター:
ko: 매개 변수:
pl: Parametry:
pt_br: Parâmetros:
ru: Параметры:
tr: Parametreler:
zh_hans: 参数:
zh_hant: 參數:

# Preview_method_signature_colon
source: Preview method signature:
cs: Náhled signatury metody:
de: Vorschau der Methodensignatur:
es: Vista previa de signatura de método:
fr: Aperçu de la signature de méthode :
it: Anteprima firma metodo:
ja: メソッド シグネチャのプレビュー:
ko: 메서드 시그니처 미리 보기:
pl: Podgląd sygnatury metody:
pt_br: Visualizar assinatura do método:
ru: Предпросмотр сигнатуры метода:
tr: Metot imzasını önizle:
zh_hans: 预览方法签名:
zh_hant: 預覽方法簽章:

source: Preview reference changes
cs: Náhled změn odkazu
de: Vorschau der Verweisänderungen
es: Vista previa de cambios de referencia
fr: Afficher un aperçu des modifications de la référence
it: Anteprima modifiche riferimento
ja: 参照の変更のプレビュー
ko: 참조 변경 내용 미리 보기
pl: Podgląd zmian odwołania
pt_br: Visualizar alterações de referência
ru: Предпросмотр изменений в ссылках
tr: Başvuru değişikliklerini önizle
zh_hans: 预览引用更改
zh_hant: 預覽參考變更

# Project_colon
source: _Project:
cs: _Projekt:
de: _Projekt:
es: _Proyecto:
fr: _Projet :
it: _Progetto:
ja: プロジェクト(_P):
ko: 프로젝트(_P):
pl: _Projekt:
pt_br: _Projeto:
ru: _Проект:
tr: _Proje:
zh_hans: 项目(_P):
zh_hant: 專案(_P):

source: Type
cs: Typ
de: Typ
es: Tipo
it: Tipo
ja: 型
ko: 형식
pl: Typ
pt_br: Tipo
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 類型

# Type_Details_colon
source: Type Details:
cs: Podrobnosti o typu:
de: Typdetails:
es: Detalles del tipo:
fr: Détails du type :
it: Dettagli del tipo:
ja: 型の詳細:
ko: 형식 세부 정보:
pl: Szczegóły typu:
pt_br: Detalhes do Tipo:
ru: Подробности о типе:
tr: Tür Ayrıntıları:
zh_hans: 类型详细信息:
zh_hant: 類型詳細資料:

source: Re_move
cs: O_debrat
de: Ent_fernen
es: Qui_tar
fr: Suppri_mer
it: Ri_muovi
ja: 削除(_M)
ko: 제거(_M)
pl: _Usuń
pt_br: Re_mover
ru: Уд_алить
tr: _Kaldır
zh_hans: 删除(_M)
zh_hant: 移除(_M)

source: _Restore
cs: _Obnovit
de: _Wiederherstellen
es: _Restablecer
fr: _Restaurer
it: _Ripristina
ja: 復元(_R)
ko: 복원(_R)
pl: _Przywróć
pt_br: _Restaurar
ru: _Восстановить
tr: _Geri yükle
zh_hans: 还原(_R)
zh_hant: 還原(_R)

source: More about {0}
cs: Další informace o {0}
de: Weitere Informationen zu "{0}"
es: Más información sobre {0}
fr: En savoir plus sur {0}
it: Altre informazioni su {0}
ja: {0} の詳細
ko: {0}에 대한 추가 정보
pl: Więcej informacji o elemencie {0}
pt_br: Mais sobre {0}
ru: {0}: подробнее
tr: {0} hakkında daha fazla bilgi
zh_hans: 有关 {0} 的详细信息
zh_hant: 關於 {0} 的詳細資訊

source: Navigation must be performed on the foreground thread.
it: Gli spostamenti devono essere eseguiti nel thread in primo piano.
ja: ナビゲーションは、フォアグラウンドのスレッドで行う必要があります。
ru: Навигация должна осуществляться в потоке переднего плана.

source: Reference to '{0}' in project '{1}'
cs: Odkaz na {0} v projektu {1}
de: Verweis auf "{0}" in Projekt "{1}"
es: Referencia a "{0}" en el proyecto "{1}"
fr: Référence à '{0}' dans le projet '{1}'
it: Riferimento a '{0}' nel progetto '{1}'
ja: プロジェクト '{1}' 内の '{0}' に対する参照
ko: 프로젝트 '{1}'에 '{0}'에 대한 참조가 있습니다.
pl: Odwołanie do elementu „{0}” w projekcie „{1}”
pt_br: Referência a '{0}' no projeto '{1}'
ru: Ссылка на "{0}" в проекте "{1}"
tr: '{1}' adlı projedeki '{0}' öğesine yönelik başvuru
zh_hans: 项目“{1}”中对“{0}”的引用
zh_hant: 專案 '{1}' 中 '{0}' 的參考

# Unknown1
source: <Unknown>
cs: <Neznámý>
de: <Unbekannt>
es: <Desconocido>
fr: <Inconnu>
it: <Sconosciuto>
ja: <不明>
ko: <알 수 없음>
pl: <Nieznany>
pt_br: <Desconhecido>
ru: <нет данных>
tr: <Bilinmiyor>
zh_hans: <未知>
zh_hant: <未知>

source: Analyzer reference to '{0}' in project '{1}'
cs: Odkaz analyzátoru na {0} v projektu {1}
de: Analysetoolverweis auf "{0}" in Projekt "{1}"
es: Referencia del analizador a "{0}" en el proyecto "{1}"
fr: Référence d'analyseur à '{0}' dans le projet '{1}'
it: Riferimento dell'analizzatore a '{0}' nel progetto '{1}'
ja: プロジェクト '{1}' 内の '{0}' に対するアナライザー参照
ko: 프로젝트 '{1}'에 '{0}'에 대한 분석기 참조가 있습니다.
pl: Odwołanie analizatora do elementu „{0}” w projekcie „{1}”
pt_br: Referência do analisador a '{0}' no projeto '{1}'
ru: Ссылка анализатора на "{0}" в проекте "{1}"
tr: '{1}' projesindeki '{0}' öğesine yönelik çözümleyici başvurusu
zh_hans: 项目“{1}”中对“{0}”的分析器引用
zh_hant: 專案 '{1}' 中 '{0}' 的分析器參考

source: Project reference to '{0}' in project '{1}'
cs: Odkaz projektu na {0} v projektu {1}
de: Projektverweis auf "{0}" in Projekt "{1}"
es: Referencia del proyecto a "{0}" en el proyecto "{1}"
fr: Référence au projet à '{0}' dans le projet '{1}'
it: Riferimento del progetto a '{0}' nel progetto '{1}'
ja: プロジェクト '{1}' 内の '{0}' に対するプロジェクト参照
ko: 프로젝트 '{1}'에 '{0}'에 대한 프로젝트 참조가 있습니다.
pl: Odwołanie projektu do elementu „{0}” w projekcie „{1}”
pt_br: Referência do projeto a '{0}' no projeto '{1}'
ru: Ссылка проекта на "{0}" в проекте "{1}"
tr: '{1}' adlı projedeki '{0}' öğesine yönelik proje başvurusu
zh_hans: 项目“{1}”中对“{0}”的项目引用
zh_hant: 專案 '{1}' 中 '{0}' 的專案參考

source: Analyzer assemblies '{0}' and '{1}' both have identity '{2}' but different contents. Only one will be loaded and analyzers using these assemblies may not run correctly.
it: Gli assembly '{0}' e '{1}' dell'analizzatore hanno la stessa identità '{2}' ma contenuto diverso. Ne verrà caricato solo uno e gli analizzatori che usano tali assembly potrebbero non funzionare correttamente.
ja: アナライザー アセンブリ '{0}' と '{1}' は両方とも ID が '{2}' ですが、内容が異なります。読み込まれるのは 1 つだけです。これらのアセンブリを使用するアナライザーは正常に実行されない可能性があります。
ru: Сборки анализатора "{0}" и "{1}" имеют одно и то же удостоверение ("{2}"), но разное содержимое. Будет загружена только одна сборка, и анализаторы, использующие эти сборки, могут работать неправильно.

source: {0} references
cs: Počet odkazů: {0}
de: {0} Verweise
es: {0} referencias
fr: {0} références
it: {0} riferimenti
ja: {0} 個の参照
ko: 참조 {0}개
pl: Odwołania: {0}
pt_br: {0} referências
ru: Ссылок: {0}
tr: {0} başvuru
zh_hans: {0} 个引用
zh_hant: {0} 個參考

source: 1 reference
cs: 1 odkaz
de: 1 Verweis
es: 1 referencia
fr: 1 référence
it: 1 riferimento
ja: 1 個の参照
ko: 참조 1개
pl: Jedno odwołanie
pt_br: 1 referência
ru: 1 ссылка
tr: 1 başvuru
zh_hans: 1 个引用
zh_hant: 1 個參考

source: '{0}' encountered an error and has been disabled.
cs: 'U analyzátoru {0} došlo k chybě a byl zakázán.
de: "{0}" hat einen Fehler festgestellt und wurde deaktiviert.
es: "{0}" detectó un error y se ha deshabilitado.
fr: '{0}' a rencontré une erreur et a été désactivé.
it: '{0}' ha rilevato un errore ed è stato disabilitato.
ja: '{0}' でエラーが生じ、無効になりました。
ko: '{0}'에 오류가 발생하여 사용할 수 없습니다.
pt_br: '{0}' encontrou um erro e foi desabilitado.
ru: 'Произошла ошибка, и анализатор "{0}" отключен.
tr: '{0}' bir hatayla karşılaştı ve devre dışı bırakıldı.

source: Enable
cs: Povolit
de: Aktivieren
es: Habilitar
fr: Activer
it: Abilita
ja: 有効にする
ko: 사용
pt_br: Habilitar
ru: Включить
tr: Etkinleştir

source: Enable and ignore future errors
cs: Povolit a ignorovat budoucí chyby
de: Aktivieren und weitere Fehler ignorieren
es: Habilitar y omitir futuros errores
fr: Activer et ignorer les futures erreurs
it: Abilita e ignora gli errori futuri
ja: 有効化して今後のエラーを無視する
ko: 추가 오류 무시하고 사용
pt_br: Habilitar e ignorar erros futuros
ru: Включить и пропускать будущие ошибки
tr: Etkinleştir ve gelecekteki hataları yoksay

source: No Changes
cs: Beze změn
de: Keine Änderungen
es: Sin cambios
fr: Aucune modification
it: Nessuna modifica
ja: 変更なし
ko: 변경 내용 없음
pl: Brak zmian
pt_br: Nenhuma Alteração
ru: Изменений нет
tr: Değişiklik Yok
zh_hans: 未更改
zh_hant: 沒有變更

source: Current block
cs: Aktuální blok
de: Aktueller Block
es: Bloque actual
fr: Bloc actif
it: Blocco corrente
ja: 現在のブロック
ko: 현재 블록
pl: Bieżący blok
pt_br: Bloco atual
ru: Текущий блок
tr: Geçerli blok
zh_hans: 当前块
zh_hant: 目前區塊

source: Determining current block.
cs: Určuje se aktuální blok.
de: Der aktuelle Block wird bestimmt.
es: Determinando el bloque actual.
fr: Détermination du bloc actif.
it: È in corso la determinazione del blocco corrente.
ja: 現在のブロックを特定しています。
ko: 현재 블록을 확인하는 중입니다.
pl: Określanie bieżącego bloku.
pt_br: Determinando o bloco atual.
ru: Определение текущего блока.
tr: Geçerli blok belirleniyor.
zh_hans: 正在确定当前块。
zh_hant: 正在判定目前的區塊。

# CSharp_VB_Build_Table_Data_Source
source: C#/VB Build Table Data Source
it: Origine dati tabella compilazione C#/VB
ja: C#/VB ビルド テーブル データ ソース
ru: Источник данных для таблицы сборки C#/VB
