Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Keep_all_parentheses_in_colon
source: Keep all parentheses in:
cs: Zachovat všechny závorky v:
de: Alle Klammern beibehalten in:
es: Mantener todos los paréntesis en:
fr: Conserver toutes les parenthèses dans :
it: Mantieni tutte le parentesi in:
ja: すべてのかっこを保持:
ko: 모든 괄호 유지:
pl: Zachowaj wszystkie nawiasy w:
pt_br: Mantenha todos os parênteses em:
ru: Сохранять все круглые скобки в:
tr: Şunun içindeki tüm parantezleri tut:
zh_hans: 保留所有括号:
zh_hant: 以下情況保留所有括號:

source: Kind
cs: Druh
de: Art
es: Tipo
fr: Genre
it: Tipo
ja: 種類
ko: 종류
pl: Rodzaj
pt_br: Tipo
ru: Вид
tr: Tür
zh_hans: 种类
zh_hant: 種類

source: Live analysis (VSIX extension)
it: Analisi in tempo reale (estensione VSIX)
ja: ライブ分析 (VSIX 拡張機能)
ru: Динамический анализ (расширение VSIX)

source: Loaded items
cs: Načtené položky
de: Geladene Elemente
es: Elementos cargados
fr: Éléments chargés
ja: 読み込まれた項目
ko: 로드된 항목
pl: Załadowane elementy
pt_br: Itens carregados
ru: Загруженные элементы
tr: Öğeler yüklendi
zh_hans: 加载的项
zh_hant: 已載入的項目

source: Loaded solution
cs: Načtené řešení
de: Geladene Projektmappe
es: Solución cargada
fr: Solution chargée
ja: 読み込まれたソリューション
ko: 로드된 솔루션
pl: Załadowane rozwiązanie
pt_br: Solução carregada
ru: Загруженное решение
tr: Çözüm yüklendi
zh_hans: 加载的解决方案
zh_hant: 已載入的解決方案

source: Local
cs: Místní
de: Lokal
ja: ローカル
ko: 로컬
pl: Lokalne
ru: Локальное
tr: Yerel
zh_hans: 本地
zh_hant: 本機

source: Local metadata
ja: ローカル メタデータ
ru: Локальные метаданные

source: Location
cs: Lokalita
de: Speicherort
es: Ubicación
fr: Emplacement
ko: 위치
pl: Lokalizacja
pt_br: Localização
ru: Расположение
tr: Konum
zh_hans: 位置
zh_hant: 位置

source: Make '{0}' abstract
cs: Nastavit {0} jako abstraktní
de: "{0}" als abstrakt festlegen
es: Convertir "{0}" en abstracto
fr: Rendre '{0}' abstrait
it: Rendi astratto '{0}'
ja: '{0}' を抽象化する
ko: '{0}'을(를) 추상으로 지정
pl: Ustaw element „{0}” jako abstrakcyjny
pt_br: Fazer '{0}' abstrato
ru: Сделать "{0}" абстрактным
tr: '{0}' değerini soyut yap
zh_hans: 将“{0}”设为抽象
zh_hant: 將 '{0}' 抽象化

source: Make abstract
cs: Nastavit jako abstraktní
de: Als abstrakt festlegen
es: Convertir en abstracto
fr: Rendre abstrait
it: Rendi astratto
ja: 抽象化する
ko: 추상으로 지정
pl: Ustaw jako abstrakcyjny
pt_br: Fazer abstrato
ru: Сделать абстрактным
tr: Soyut yap
zh_hans: 设为抽象
zh_hant: 抽象化

source: Members
cs: Členové
de: Member
es: Miembros
fr: Membres
it: Membri
ja: メンバー
ko: 멤버
pl: Elementy członkowskie
pt_br: Membros
ru: Члены
tr: Üyeler
zh_hans: 成员
zh_hant: 成員

# Modifier_preferences_colon
source: Modifier preferences:
cs: Předvolby modifikátorů:
de: Einstellungen für Modifizierer:
es: Preferencias de modificador:
fr: Préférences de modificateur :
it: Preferenze per modificatore:
ja: 修飾子設定:
ko: 한정자 기본 설정:
pl: Preferencje modyfikatora:
pt_br: Preferências do modificador:
ru: Предпочтения модификатора:
tr: Değiştirici tercihleri:
zh_hans: 修饰符首选项:
zh_hant: 修飾元喜好設定:

# Move_static_members_to_another_type_colon
source: Move Static Members to Another Type:
cs: Přesunout statické členy do jiného typu:
de: Statische Mitglieder werden in einen anderen Typ verschoben:
es: Mover miembros estáticos a otro tipo:
fr: Déplacer les membres statiques vers un autre type :
ko: 정적 멤버를 다른 형식으로 이동:
pl: Przenieś składowe statyczne do innego typu:
pt_br: Mover Membros Estáticos para Outro Tipo:
ru: Переместить статические элементы в другой тип:
tr: Statik Üyeleri Başka Bir Türe Taşı:
zh_hans: 将静态成员移动到另一类型:
zh_hant: 將靜態成員移至其他類型:

source: Move to Namespace
cs: Přesunout do oboru názvů
de: In Namespace verschieben
es: Mover a espacio de nombres
fr: Déplacer vers un espace de noms
it: Sposta nello spazio dei nomi
ja: 名前空間に移動します
ko: 네임스페이스로 이동
pl: Przenieś do przestrzeni nazw
pt_br: Mover para o Namespace
ru: Переместить в пространство имен
tr: Ad Alanına Taşı
zh_hans: 移动到命名空间
zh_hant: 移到命名空間

source: Multiple members are inherited
cs: Více členů se dědí.
de: Mehrere Member werden geerbt.
es: Varios miembros son heredados
fr: Plusieurs membres sont hérités
ko: 여러 구성원이 상속됨
pl: Dziedziczonych jest wiele składowych
pt_br: Múltiplos membros são herdados
ru: Несколько элементов наследуются
tr: Birden fazla üye devralındı
zh_hans: 已继承多个成员
zh_hant: 已繼承多名成員

source: Multiple members are inherited on line {0}
cs: Více členů se dědí na řádku {0}.
de: In Zeile {0} werden mehrere Member geerbt.
es: Varios miembros se heredan en la línea {0}
fr: Plusieurs membres sont hérités à la ligne {0}
ko: 여러 구성원이 {0} 행에 상속됨
pl: Na linii {0} dziedziczonych jest wiele składowych
pt_br: Múltiplos membros são herdados online {0}
ru: Несколько элементов наследуются в строке {0}
tr: {0}. satırda birden fazla üye devralındı
zh_hans: 第 {0} 行继承了多个成员
zh_hant: 已在行 {0} 上繼承多名成員

source: Name conflicts with an existing type name.
cs: Název koliduje s existujícím názvem typu.
de: Der Name verursacht einen Konflikt mit einem vorhandenen Typnamen.
es: El nombre está en conflicto con un nombre de tipo que ya existía.
fr: Le nom est en conflit avec un nom de type existant.
ko: 이름이 기존 형식 이름과 충돌합니다.
pl: Wystąpił konflikt z nazwą istniejącego typu.
pt_br: O nome está em conflito com um nome de tipo existente.
ru: Имя конфликтует с существующим именем типа.
tr: Ad, mevcut bir tür adıyla çakışıyor.
zh_hans: 名称与现有类型名称相冲突。
zh_hant: 名稱與現有類型名稱衝突。

source: Name is not a valid {0} identifier.
cs: Název není platný identifikátor {0}.
de: Der Name ist kein gültiger {0}-Bezeichner.
es: El nombre no es un identificador de {0} válido.
fr: Le nom n'est pas un identificateur {0} valide.
ko: 이름이 유효한 {0} 식별자가 아닙니다.
pl: Nazwa nie jest prawidłowym identyfikatorem {0}.
pt_br: O nome não é um identificador de {0} válido.
ru: Имя не является допустимым идентификатором {0}.
tr: Ad geçerli bir {0} tanımlayıcısı değil.
zh_hans: 名称不是有效的 {0} 标识符。
zh_hant: 名稱不是有效的 {0} 識別碼。

source: Namespace
cs: Obor názvů
es: Espacio de nombres
fr: Espace de noms
it: Spazio dei nomi
ja: 名前空間
ko: 네임스페이스
pl: Obszar nazw
ru: Пространство имен
tr: Ad alanı
zh_hans: 命名空间
zh_hant: 命名空間

source: Namespace: '{0}'
cs: Obor názvů: {0}
es: Espacio de nombres: "{0}"
fr: Espace de noms : '{0}'
it: Spazio dei nomi: '{0}'
ja: 名前空間: '{0}'
ko: 네임스페이스: '{0}'
pl: Przestrzeń nazw: „{0}”
ru: Пространство имен: "{0}"
tr: Ad alanı: '{0}'
zh_hans: 命名空间:“{0}”
zh_hant: 命名空間: '{0}'

source: Namespace declarations
cs: Deklarace oboru názvů
de: Namespacedeklarationen
es: Declaraciones de espacio de nombres
fr: Déclarations d'espaces de noms
ko: 네임스페이스 선언
pl: Deklaracje przestrzeni nazw
pt_br: Declarações do namespace
ru: Объявления пространства имен
tr: Namespace bildirimleri
zh_hans: 命名空间声明
zh_hant: 命名空間宣告

# NamingSpecification_CSharp_Field
source: field
cs: pole
de: Feld
es: campo
fr: Champ
it: campo
ja: フィールド
ko: 필드
pl: pole
pt_br: Campo
ru: Поле
tr: alan
zh_hans: 字段
zh_hant: 欄位

# NamingSpecification_CSharp_Local
source: local
cs: místní
de: lokal
fr: variable locale
it: variabile locale
ja: ローカル
ko: 로컬
pl: lokalne
ru: локальный
tr: yerel
zh_hans: 局部
zh_hant: 區域

# NamingSpecification_CSharp_LocalFunction
source: local function
cs: lokální funkce
de: Lokale Funktion
es: función local
fr: fonction locale
it: funzione locale
ja: ローカル関数
ko: 로컬 함수
pl: funkcja lokalna
pt_br: função local
ru: локальная функция
tr: yerel işlev
zh_hans: 本地函数
zh_hant: 區域函式

# NamingSpecification_CSharp_Method
source: method
cs: metoda
de: Methode
es: método
fr: méthode
it: metodo
ja: メソッド
ko: 메서드
pl: metoda
pt_br: método
ru: метод
tr: yöntem
zh_hans: 方法
zh_hant: 方法

# NamingSpecification_CSharp_Parameter
source: parameter
cs: parametr
es: parámetro
fr: paramètre
it: parametro
ja: パラメーター
ko: 매개 변수
pl: parametr
pt_br: parâmetro
ru: параметр
tr: parametre
zh_hans: 参数
zh_hant: 參數

# NamingSpecification_CSharp_Property
source: property
cs: vlastnost
de: Eigenschaft
es: propiedad
fr: propriété
it: proprietà
ja: プロパティ
ko: 속성
pl: właściwość
pt_br: propriedade
ru: свойство
tr: özellik
zh_hans: 属性
zh_hant: 屬性

# NamingSpecification_CSharp_TypeParameter
source: type parameter
cs: parametr typu
de: Typparameter
es: parámetro de tipo
fr: paramètre de type
it: parametro di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: parametr typu
pt_br: parâmetro de tipo
ru: параметр типа
tr: tür parametresi
zh_hans: 类型形参
zh_hant: 類型參數

# NamingSpecification_VisualBasic_Field
source: Field
cs: Pole
de: Feld
es: Campo
fr: Champ
it: Campo
ja: フィールド
ko: 필드
pl: Pole
pt_br: Campo
ru: Поле
tr: Alan
zh_hans: 字段
zh_hant: 欄位

# NamingSpecification_VisualBasic_Local
source: Local
cs: Místní
de: Lokal
it: Locale
ja: ローカル
ko: 로컬
pl: Lokalny
ru: Локальные
tr: Yerel
zh_hans: 本地
zh_hant: 本機

# NamingSpecification_VisualBasic_Method
source: Method
cs: metoda
de: Methode
es: método
fr: méthode
it: metodo
ja: メソッド
ko: 메서드
pl: metoda
pt_br: método
ru: метод
tr: yöntem
zh_hans: 方法
zh_hant: 方法

# NamingSpecification_VisualBasic_Parameter
source: Parameter
cs: Parametr
es: Parámetro
fr: Paramètre
it: Parametro
ja: パラメーター
ko: 매개 변수
pl: Parametr
pt_br: Parâmetro
ru: Параметр
tr: Parametre
zh_hans: 参数
zh_hant: 參數

# NamingSpecification_VisualBasic_TypeParameter
source: Type Parameter
cs: Parametr typu
de: Typparameter
es: Parámetro de tipo
fr: Paramètre de type
it: Parametro di tipo
ja: 型パラメーター
ko: 형식 매개 변수
pl: Parametr typu
pt_br: Parâmetro de Tipo
ru: Параметр типа
tr: Tür Parametresi
zh_hans: 类型参数
zh_hant: 型別參數

source: Naming rules
cs: Pravidla pojmenování
de: Benennungsregeln
es: Reglas de nomenclatura
fr: Règles de nommage
ja: 名前付けルール
ko: 명명 규칙
pl: Reguły nazewnictwa
pt_br: Regras de nomenclatura
ru: Правила именования
tr: Adlandırma kuralları
zh_hans: 命名规则
zh_hant: 命名規則

# Navigate_asynchronously_exerimental
source: Navigate asynchronously (experimental)
cs: Asynchronní navigace (experimentální)
de: Asynchron navigieren (experimentell)
es: Navegar de forma asincrónica (experimental)
fr: Naviguer de façon asynchrone (expérimental)
ko: 비동기식 탐색(실험적)
pt_br: Navegar de forma assíncrona (experimental)
ru: Асинхронная навигация (экспериментальная функция)
tr: Zaman uyumsuz olarak gezin (deneysel)

source: Navigate to '{0}'
cs: Přejít na {0}
de: Zu "{0}" navigieren
es: Navegar a "{0}"
fr: Accéder à « {0} »
ko: '{0}'(으)로 이동
pl: Przejdź do pozycji „{0}”
pt_br: Navegar até '{0}'
ru: Перейти к {0}
tr: '{0}' öğesine git
zh_hans: 导航到“{0}”
zh_hant: 瀏覽至 '{0}'

source: Navigate to External Sources
cs: Přejít na externí zdroje
de: Zu externen Quellen navigieren
es: Navegar a orígenes externos
fr: Accéder aux sources externes
ko: 외부 원본으로 이동
pl: Przejdź do źródeł zewnętrznych
pt_br: Navegar para fontes externas
ru: Перейти ко внешним источникам
tr: Dış Kaynaklara Git
zh_hans: 导航到外部源
zh_hant: 瀏覽至外部來源

source: Navigating
cs: Probíhá navigace
de: Navigation
es: Navegando
fr: Navigation
ko: 탐색
pl: Nawigacja w toku
pt_br: Navegando
ru: Выполняется переход
tr: Gidiliyor
zh_hans: 正在导航
zh_hant: 正在瀏覽

source: Never
cs: Nikdy
de: Nie
es: Nunca
fr: Jamais
ko: 안 함
pl: Nigdy
pt_br: Nunca
ru: Никогда
tr: Hiçbir zaman
zh_hans: 从不
zh_hant: 永不

source: Never if unnecessary
cs: Nikdy, pokud jsou nadbytečné
de: Nie, wenn nicht erforderlich
es: Nunca si es innecesario
fr: Jamais si ce n'est pas nécessaire
it: Mai se non necessario
ja: 不必要なら保持しない
ko: 필요한 경우 사용 안 함
pl: Nigdy, jeśli niepotrzebne
pt_br: Nunca se desnecessário
ru: Никогда, если не требуется
tr: Gereksizse hiçbir zaman
zh_hans: 从不(若无必要)
zh_hant: 不需要時一律不要

# New_Type_Name_colon
source: New Type Name:
cs: Název nového typu:
de: Neuer Typname:
es: Nombre de tipo nuevo:
fr: Nouveau nom de type :
ko: 새 형식 이름:
pl: Nazwa nowego typu:
pt_br: Novo Nome de Tipo:
ru: Новое имя типа:
tr: Yeni Tür Adı:
zh_hans: 新类型名称:
zh_hant: 新的型別名稱:

# New_line_preferences_experimental_colon
source: New line preferences (experimental):
cs: Předvolby nových řádků (experimentální):
de: Einstellungen für neue Zeilen (experimentell):
es: Nuevas preferencias de línea (experimental):
fr: Préférences de nouvelle ligne (expérimental) :
ko: 새 줄 기본 설정(실험적):
pl: Preferencje nowego wiersza (eksperymentalne):
pt_br: Preferências de nova linha (experimental):
ru: Предпочтения для новых строк (экспериментальная функция):
tr: Yeni satır tercihleri (deneysel):
zh_hans: 新行首选项(实验性):
zh_hant: 新行喜好設定 (實驗性):

source: Newline (\\n)
cs: Nový řádek (\\n)
de: Zeilenumbruch (\\n)
es: Nueva línea (\\n)
fr: Nouvelle ligne (\\n)
ko: 줄 바꿈(\\n)
pl: Nowy wiersz (\\n)
pt_br: Nova linha (\\n)
ru: Новая строка (\\n)
tr: Yeni Satır (\\n)
zh_hans: 换行(\\n)
zh_hant: 新行 (\\n)

source: No namespaces needed updating.
cs: Nebylo potřeba aktualizovat žádné obory názvů.
de: Keine Namespaces vorhanden, die aktualisiert werden müssen.
es: No es necesario actualizar ningún espacio de nombres.
fr: Aucun espace de noms n’a besoin d’être mis à jour.
ko: 업데이트할 네임스페이스가 없습니다.
pl: Nie jest wymagane aktualizowanie języka Namespaces.
pt_br: Não há necessidade de atualização de namespaces.
ru: Не требуется обновлять пространства имен.
tr: Güncelleştirme gereken namespace yok.
zh_hans: 无需更新命名空间。
zh_hant: 沒有需要更新的命名空間。

source: No unused references were found.
cs: Nenašly se žádné nepoužívané odkazy.
de: Es wurden keine nicht verwendeten Verweise gefunden.
es: No se encontraron referencias sin usar.
fr: Références inutilisées introuvables.
ko: 사용되지 않는 참조가 없습니다.
pl: Nie znaleziono żadnych nieużywanych odwołań.
pt_br: Não foi encontrada nenhuma referência não usada.
ru: Неиспользуемые ссылки не найдены.
tr: Kullanılmayan başvuru bulunamadı.
zh_hans: 找不到未使用的引用。
zh_hant: 找不到任何未使用的參考。

source: Non-public methods
cs: Neveřejné metody
de: Nicht öffentliche Methoden
es: Miembros no públicos
fr: Méthodes non publiques
it: Metodi non pubblici
ja: パブリックでないメソッド
ko: public이 아닌 메서드
pl: Metody niepubliczne
pt_br: Métodos não públicos
ru: Методы, не являющиеся открытыми
tr: Ortak olmayan yöntemler
zh_hans: 非公共成员
zh_hant: 非公用方法

source: Omit if default
cs: Vynechat, pokud je výchozí
de: Bei Standardwert auslassen
es: Omitir si es el valor predeterminado
fr: Omettre si la valeur par défaut
ko: 기본값인 경우 생략
pl: Pomiń, jeśli to wartość domyślna
pt_br: Omita se for padrão
ru: Пропустить, если по умолчанию
tr: Varsayılan ise atla
zh_hans: 默认情况下省略
zh_hant: 預設為省略

source: Omit (only for optional parameters)
cs: Vynechat (jen pro nepovinné parametry)
de: Auslassen (nur bei optionalen Parametern)
es: Omitir (solo para parámetros opcionales)
fr: Omettre (uniquement pour les paramètres facultatifs)
ja: 省略 (省略可能なパラメーターの場合のみ)
ko: 생략(선택적 매개 변수에만 해당)
pl: Pomiń (tylko dla parametrów opcjonalnych)
pt_br: Omitir (somente para parâmetros opcionais)
ru: Опустить (только для необязательных параметров)
tr: Atla (yalnızca isteğe bağlı parametreler için)
zh_hans: 省略(仅对于可选参数)
zh_hant: 省略 (僅適用於選擇性參數)

source: Open documents
cs: Otevřené dokumenty
de: Geöffnete Dokumente
es: Documentos abiertos
fr: Documents ouverts
ja: 開かれているドキュメント
ko: 열린 문서
pl: Otwarte dokumenty
pt_br: Abrir documentos
ru: Открыть документы
tr: Açık belgeler
zh_hans: 打开的文档
zh_hant: 開啟的文件

source: Operator placement when wrapping
cs: Umístění operátora při zalamování
de: Operatorplatzierung beim Umschließen
es: Colocación del operador al ajustar
fr: Placement de l’opérateur lors du retour à la ligne
ko: 래핑 시 연산자 배치
pl: Umieszczanie operatora podczas opakowywania
pt_br: Posicionamento do operador a quebra de linha
ru: Размещение оператора при переносе
tr: Kaydırma sırasında operatör yerleştirme
zh_hans: 换行时运算符的位置
zh_hant: 換行時運算子的位置

source: Optional parameters must provide a default value
cs: Nepovinné parametry musí poskytovat výchozí hodnotu.
de: Optionale Parameter müssen einen Standardwert angeben.
es: Los parámetros opcionales deben proporcionar un valor predeterminado.
fr: Les paramètres facultatifs doivent fournir une valeur par défaut
ja: 省略可能なパラメーターには、既定値を指定する必要があります
ko: 선택적 매개 변수는 기본값을 제공해야 합니다.
pl: Parametry opcjonalne muszą określać wartość domyślną
pt_br: Os parâmetros opcionais precisam especificar um valor padrão
ru: Для необязательных параметров необходимо указать значение по умолчанию.
tr: İsteğe bağlı parametrelerde varsayılan değer sağlanmalıdır
zh_hans: 可选参数必须提供默认值
zh_hant: 選擇性參數必須提供預設值

# Optional_with_default_value_colon
source: Optional with default value:
cs: Nepovinné s výchozí hodnotou:
de: Optional mit Standardwert:
es: Opcional con valor predeterminado:
fr: Facultatif avec une valeur par défaut :
ja: 既定値を含むオプション:
ko: 다음 기본값을 사용하는 경우 선택적:
pl: Opcjonalne z wartością domyślną:
pt_br: Opcional com o valor padrão:
ru: Необязательный параметр со значением по умолчанию:
tr: Varsayılan değerle isteğe bağlı:
zh_hans: 默认值可选:
zh_hant: 選擇性預設值:

# Other
source: Others
cs: Jiné
de: Andere
es: Otros
fr: Autres
ja: その他
ko: 기타
pl: Inne
pt_br: Outros
ru: Другие
tr: Diğer
zh_hans: 其他
zh_hant: 其他

source: Overridden members
cs: Přepsaní členové
de: Außer Kraft gesetzte Member
es: Miembros reemplazados
fr: Membres remplacés
ko: 재정의된 구성원
pl: Zastąpione składowe
pt_br: Membros substituídos
ru: Переопределенные элементы
tr: Geçersiz kılınan üyeler
zh_hans: 替代的成员
zh_hant: 已覆寫的成員

source: Overriding members
cs: Přepsání členů
de: Member werden außer Kraft gesetzt.
es: Reemplando miembros
fr: Remplacement des membres
ko: 구성원 재정의
pl: Zastępowanie składowych
pt_br: Substituindo membros
ru: Идет переопределение элементов
tr: Üyeleri geçersiz kılma
zh_hans: 替代成员
zh_hant: 覆寫成員

source: Package install canceled
cs: Instalace balíčku se zrušila.
de: Paketinstallation abgebrochen
es: Instalación del paquete cancelada
fr: Installation du package annulée
ko: 패키지 설치가 취소됨
pl: Instalacja pakietu została anulowana
pt_br: Instalação do pacote cancelada
ru: Установка пакета отменена
tr: Paket yüklemesi iptal edildi
zh_hans: 已取消包安装
zh_hant: 套件安裝已取消

source: Package uninstall canceled
cs: Odinstalace balíčku se zrušila.
de: Paketdeinstallation abgebrochen
es: Desinstalación del paquete cancelada
fr: Désinstallation du package annulée
ko: 패키지 제거가 취소됨
pl: Odinstalowanie pakietu zostało anulowane
pt_br: A desinstalação do pacote cancelada
ru: Удаление пакета отменено
tr: Paket kaldırma iptal edildi
zh_hans: 已取消包卸载
zh_hant: 套件解除安裝已取消

source: Packages
cs: Balíčky
de: Pakete
es: Paquetes
ko: 패키지
pl: Pakiety
pt_br: Pacotes
ru: Пакеты
tr: Paketler
zh_hans: 包
zh_hant: 套件

source: Parameter Details
ja: パラメーターの詳細
ru: Дополнительные сведения о параметрах

source: Parameter name:
cs: Název parametru:
es: Nombre del parámetro:
fr: Nom du paramètre :
ja: パラメーター名:
ko: 매개 변수 이름:
pl: Nazwa parametru:
pt_br: Nome do parâmetro:
ru: Имя параметра:
tr: Parametre adı:
zh_hans: 参数名称:
zh_hant: 參數名稱:

source: Parameter information
cs: Informace o parametrech
de: Parameterinformationen
es: Información de parámetros
fr: Informations du paramètre
ja: パラメーター情報
ko: 매개 변수 정보
pl: Informacje o parametrach
pt_br: Informações do parâmetro
ru: Сведения о параметре
tr: Parametre bilgileri
zh_hans: 参数信息
zh_hant: 參數資訊

source: Parameter kind
cs: Druh parametru
de: Parameterart
es: Clase de parámetro
fr: Genre de paramètre
ja: パラメーターの種類
ko: 매개 변수 종류
pl: Rodzaj parametru
pt_br: Tipo de parâmetro
ru: Тип параметра
tr: Parametre tipi
zh_hans: 参数种类
zh_hant: 參數種類

source: Parameter name contains invalid character(s).
cs: Název parametru obsahuje neplatné znaky.
de: Der Parametername enthält ungültige Zeichen.
es: El nombre de parámetro contiene caracteres no válidos.
fr: Le nom du paramètre contient des caractères non valides.
ja: パラメーター名に無効な文字が含まれています。
ko: 매개 변수 이름에 잘못된 문자가 들어 있습니다.
pl: Nazwa parametru zawiera nieprawidłowe znaki.
pt_br: O nome do parâmetro contém caracteres inválidos.
ru: Имя параметра содержит недопустимые знаки.
tr: Parametre adı geçersiz karakterler içeriyor.
zh_hans: 参数名包含无效的字符。
zh_hant: 參數名稱包含無效字元。

# Parameter_preferences_colon
source: Parameter preferences:
cs: Předvolby parametrů:
de: Parametereinstellungen:
es: Preferencias de parámetros:
fr: Préférences relatives aux paramètres :
it: Preferenze per parametri:
ja: パラメーターの優先順位:
ko: 매개 변수 기본 설정:
pl: Preferencje dotyczące parametrów:
pt_br: Preferências de parâmetro:
ru: Предпочтения для параметров:
tr: Parametre tercihleri:
zh_hans: 参数首选项:
zh_hant: 參數喜好設定:

source: Parameter type contains invalid character(s).
cs: Typ parametru obsahuje neplatné znaky.
de: Der Parametertyp enthält ungültige Zeichen.
es: El tipo de parámetro contiene caracteres no válidos.
fr: Le type du paramètre contient des caractères non valides.
ja: パラメーターの種類に無効な文字が含まれています。
ko: 매개 변수 형식에 잘못된 문자가 들어 있습니다.
pl: Typ parametru zawiera nieprawidłowe znaki.
pt_br: O tipo de parâmetro contém caracteres inválidos.
ru: Тип параметра содержит недопустимые знаки.
tr: Parametre türü geçersiz karakterler içeriyor.
zh_hans: 参数类型包含无效的字符。
zh_hant: 參數類型包含無效字元。

# Parentheses_preferences_colon
source: Parentheses preferences:
cs: Předvolby závorek:
de: Voreinstellungen für Klammern:
es: Preferencias de paréntesis:
fr: Préférences relatives aux parenthèses :
it: Preferenze per parentesi:
ja: かっこの優先順位:
ko: 괄호 기본 설정:
pl: Preferencje dotyczące nawiasów:
pt_br: Preferências de parênteses:
ru: Параметры круглых скобок:
tr: Parantez tercihleri:
zh_hans: 括号首选项:
zh_hant: 括號喜好設定:

source: Paste
cs: Vložit
de: Einfügen
es: Pegar
fr: Coller
ko: 붙여넣기
pt_br: Colar
ru: Вставить
tr: Yapıştır

# Paste_valid_stack_trace
source: Paste a stack trace to view and navigate it's values.
cs: Pokud chcete zobrazit a procházet jeho hodnoty, vložte trasování zásobníku.
de: Fügen Sie eine Stapelüberwachung ein, und navigieren Sie durch ihre Werte.
es: Pegar un seguimiento de pila para ver y navegar sus valores.
fr: Collez une trace de pile pour afficher et parcourir ses valeurs.
ko: 값을 보고 탐색하려면 스택 추적을 붙여넣습니다.
pl: Wklej prawidłowy ślad stosu, aby wyświetlić jego wartości i nawigować po nich.
pt_br: Cole um rastreamento de pilha para exibir e navegar pelos seus valores.
ru: Вставьте трассировку стека, чтобы просмотреть ее значения и перемещаться между ними.
tr: Değerlerini görüntülemek ve gezinmek için bir yığın izi yapıştırın.
zh_hans: 粘贴堆栈跟踪以查看和导航其值。
zh_hant: 貼上堆疊追蹤以檢視及瀏覽其值。

source: Paused ({0} tasks in queue)
it: Sospeso ({0} attività in coda)
ja: 一時停止中 ({0} 個のタスクがキューにあります)
ru: Приостановлено (задач в очереди: {0})

source: Please enter a type name
cs: Zadejte prosím název typu.
de: Geben Sie einen Typnamen ein.
es: Escriba un nombre de tipo.
fr: Entrez un nom de type
ja: 型の名前を入力してください
ko: 형식 이름을 입력하세요.
pl: Wprowadź nazwę typu
pt_br: Insira um nome de tipo
ru: Введите имя типа
tr: Lütfen bir tür adı yazın
zh_hans: 请输入一个类型名称
zh_hant: 請輸入類型名稱

source: Prefer 'System.HashCode' in 'GetHashCode'
cs: Upřednostňovat System.HashCode v GetHashCode
de: "System.HashCode" in "GetHashCode" bevorzugen
es: Preferir "System.HashCode" en "GetHashCode"
fr: Préférer 'System.HashCode' dans 'GetHashCode'
ja: 'GetHashCode' の 'System.HashCode' を優先する
ko: 'GetHashCode'에서 'System.HashCode' 선호
pl: Preferuj element „System.HashCode” w metodzie „GetHashCode”
pt_br: Prefira 'System.HashCode' em 'GetHashCode'
ru: Предпочитать "System.HashCode" в "GetHashCode"
tr: 'GetHashCode' içinde 'System.HashCode' tercih et
zh_hans: 在 "GetHashCode" 中首选 "System.HashCode"
zh_hant: 建議在 'GetHashCode' 中使用 'System.HashCode'

source: Prefer UTF-8 string literals
cs: Preferovat řetězcové literály UTF-8
de: UTF-8-Zeichenfolgenliterale bevorzugen
es: Preferir literales de cadena UTF-8
fr: Préférer les littéraux de chaîne UTF-8
ko: UTF-8 문자열 리터럴 선호
pl: Preferuj literały ciągu UTF-8
pt_br: Preferir literais de cadeia de caracteres UTF-8
ru: Предпочитать строковые литералы UTF-8
tr: UTF-8 sabit değerli dizelerini tercih et
zh_hans: 首选 UTF-8 字符串文本
zh_hant: 偏好 UTF-8 字串常值

source: Prefer compound assignments
cs: Preferovat složená přiřazení
de: Zusammengesetzte Zuweisungen bevorzugen
es: Preferir asignaciones compuestas
fr: Préférer les affectations composées
it: Preferisci assegnazioni composte
ja: 複合代入を優先
ko: 복합 대입 선호
pl: Preferuj przypisania złożone
pt_br: Preferir atribuições de compostos
ru: Предпочитать составные назначения
tr: Bileşik atamaları tercih et
zh_hans: 首选复合赋值
zh_hant: 優先使用複合指派
