Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Implement Interface or Abstract Class
cs: Implementovat rozhraní nebo abstraktní třídu
de: Schnittstelle oder abstrakte Klasse implementieren
es: Implementar interfaz o clase abstracta
fr: Implémenter une interface ou une classe abstraite
it: Implementa interfaccia o classe astratta
ja: インターフェイスまたは抽象クラスの実装
ko: 인터페이스 또는 추상 클래스 구현
pl: Implementuj interfejs lub klasę abstrakcyjną
pt_br: Implementar Interface ou Classe Abstrata
ru: Реализовать интерфейс или абстрактный класс
tr: Interface veya Abstract Sınıfı Uygula
zh_hans: 实现接口或抽象类
zh_hant: 實作介面或抽象類別

source: For a given symbol, only the topmost rule with a matching 'Specification' will be applied. Violation of that rule's 'Required Style' will be reported at the chosen 'Severity' level.
cs: Pro daný symbol se použije jenom to pravidlo s odpovídající specifikací, které je nejvíce nahoře. Porušení požadovaného stylu tohoto pravidla se ohlásí na zvolené úrovni závažnosti.
de: Für ein vorgegebenes Symbol wird nur die oberste Regel mit einer übereinstimmenden Spezifikation angewendet. Eine Verletzung des erforderlichen Stils für diese Regel wird mit dem gewählten Schweregrad gemeldet.
es: Para un símbolo determinado, solo se aplicará la regla superior con una "especificación" concordante. Si se infringe el "estilo requerido" de esa regla, se informará en el nivel de "gravedad" elegido.
fr: Pour un symbole donné, seule la règle la plus élevée avec une 'Spécification' correspondante est appliquée. Toute violation du 'Style obligatoire' de cette de règle est signalée au niveau de 'Gravité' choisi.
it: Per un simbolo specifico verrà applicata solo la regola di livello superiore con il valore corrispondente a 'Specifica'. Una violazione del valore specificato per 'Stile obbligatorio' in tale regola verrà segnalata con il livello specificato in 'Gravità'.
ja: 指定されたシンボルには、一致する '仕様' を含む最上位のルールのみが適用されます。そのルールの '必要なスタイル' の違反は、選択した '重要度' レベルで報告されます。
ko: 제공된 기호의 경우, 일치하는 '사양'이 있는 최상위 규칙만 적용됩니다. 해당 규칙의 '필수 스타일' 위반은 선택한 '심각도' 수준에서 보고됩니다.
pl: Dla danego symbolu zostanie zastosowana tylko reguła najwyższego poziomu ze zgodną specyfikacją. Naruszenie wymaganego stylu tej reguły będzie raportowane na wybranym poziomie ważności.
pt_br: Para um determinado símbolo, somente a regra superior com uma 'Especificação' correspondente será aplicada. A violação do 'Estilo Necessário' da regra será reportada no nível de 'Gravidade' escolhido.
ru: Для указанного символа будет применено только самое верхнее правило соответствующей спецификации. При нарушении требуемого стиля для этого правила будет создано оповещение указанного уровня серьезности.
tr: Sağlanan bir sembolde yalnızca, eşleşen bir 'Belirtim' içeren kurallardan en üstte bulunanı uygulanır. Bu kural için 'Gerekli Stil' ihlal edilirse, bu durum seçilen 'Önem Derecesi' düzeyinde bildirilir.
zh_hans: 对于给定的符号，仅应用具有匹配“规范”的最顶端规则。对该规则的“必需样式”的违反将以所选的“严重性”级别进行报告。
zh_hant: 若為給定的符號，則只會套用最上層的規則與相符的 [規格]。若違反該規則的 [必要樣式]，將於所選 [嚴重性] 層級回報。

source: at the end
cs: na konec
de: am Ende
es: al final
fr: à la fin
it: alla fine
ja: 末尾
ko: 끝에 삽입
pl: na końcu
pt_br: no final
ru: в конец
tr: sonda
zh_hans: 在末尾
zh_hant: 結尾處

source: When inserting properties, events and methods, place them:
cs: Vlastnosti, události a metody při vkládání umístit:
de: Eingefügte Eigenschaften, Ereignisse und Methoden hier ablegen:
es: Al insertar propiedades, eventos y métodos, colóquelos:
fr: Quand vous insérez des propriétés, des événements et des méthodes, placez-les :
it: Posiziona proprietà, eventi e metodi inseriti:
ja: プロパティ、イベント、メソッドを挿入する際には、次の場所に挿入します:
ko: 속성, 이벤트 및 메서드 삽입 시 다음에 배치합니다.
pl: W przypadku wstawiania właściwości, zdarzeń i metod umieszczaj je:
pt_br: Ao inserir as propriedades, eventos e métodos, coloque-os:
ru: При вставке свойств, методов и событий помещать их:
tr: Özellik, olay ve metot eklerken, bunları şuraya yerleştir:
zh_hans: 插入属性、事件和方法时，请将其置于以下位置:
zh_hant: 插入屬性、事件與方法時，放置方式為:

source: on the right edge of the editor window
cs: na pravém okraji okna editoru
de: am rechten Rand des Editorfensters
es: En el borde derecho de la ventana del editor
fr: sur le bord droit de la fenêtre de l'éditeur
ko: 편집기 창의 오른쪽 가장자리
pl: na prawej krawędzi okna edytora
pt_br: na borda direita da janela do editor
ru: на правом краю окна редактора
tr: düzenleyici penceresinin sağ kenarına
zh_hans: 在编辑器窗口的右边缘
zh_hant: 在編輯器視窗的右邊緣

source: with other members of the same kind
cs: s ostatními členy stejného druhu
de: mit anderen Mitgliedern derselben Art
es: Con otros miembros de la misma clase
fr: avec d'autres membres du même type
it: con altri membri dello stesso tipo
ja: 同じ種類の他のメンバーと共に
ko: 같은 종류의 다른 멤버와 함께 있는 경우
pl: z innymi składowymi tego samego rodzaju
pt_br: com outros membros do mesmo tipo
ru: вместе с другими элементами того же типа
tr: aynı türden başka üyelerle birlikte
zh_hans: 与同一类型的其他成员一起
zh_hant: 與其他相同種類的成員

source: Prefer braces
cs: Preferovat složené závorky
de: Geschweifte Klammern bevorzugen
es: Preferir llaves
fr: Préférer des accolades
it: Preferisci parentesi graffe
ja: 波かっこを優先します
ko: 중괄호 기본 사용
pl: Preferuj klamry
pt_br: Preferir chaves
ru: Предпочитать фигурные скобки
tr: Küme ayraçlarını tercih et
zh_hans: 首选大括号
zh_hant: 建議使用括號

# Over_colon
source: Over:
cs: Před:
de: Gegenüber:
es: Antes que:
fr: À :
it: A:
ja: 非優先:
ko: 비선호:
pl: Przed:
pt_br: Sobre:
ru: А не:
tr: Bunun yerine:
zh_hans: 超过:
zh_hant: 勝於:

# Prefer_colon
source: Prefer:
cs: Preferovat:
de: Bevorzugen:
es: Preferir:
fr: Préférer :
it: Preferisci:
ja: 優先:
ko: 선호:
pl: Preferuj:
pt_br: Preferir:
ru: Предпочтение:
tr: Tercih edilen:
zh_hans: 首选:
zh_hant: 建議使用:

source: or
cs: nebo
de: oder
es: o
fr: ou
it: oppure
ja: または
ko: 또는
pl: lub
pt_br: ou
ru: или
tr: veya
zh_hans: 或
zh_hant: 或

source: built-in types
cs: předdefinované typy
de: integrierte Typen
es: Tipos integrados
fr: types intégrés
it: tipi predefiniti
ja: 組み込み型
ko: 기본 제공 형식인 경우
pl: wbudowane typy
pt_br: tipos internos
ru: встроенные типы
tr: yerleşik türler
zh_hans: 内置类型
zh_hant: 內建類型

source: everywhere else
cs: všude jinde
de: überall sonst
es: En cualquier otra parte
fr: n'importe où ailleurs
it: in qualsiasi altra posizione
ja: 他のすべての場所
ko: 다른 모든 위치인 경우
pl: gdziekolwiek indziej
pt_br: em todos os lugares
ru: в любое другое место
tr: diğer yerlerde
zh_hans: 其他任何位置
zh_hant: 其他各處

source: type is apparent from assignment expression
cs: typ je zřejmý z výrazu přiřazení
de: Typ geht aus Zuweisungsausdruck hervor
es: El tipo es aparente en la expresión de asignación
fr: le type est visible dans l'expression d'assignation
it: il tipo è apparente rispetto all'espressione di assegnazione
ja: 型は代入式から明確
ko: 할당 식에서 형식이 명백하게 나타나는 경우
pl: typ jest widoczny z wyrażenia przypisania
pt_br: o tipo é aparente da expressão de atribuição
ru: тип предполагается из выражения назначения
tr: tür, atama ifadesinden görünür
zh_hans: 赋值表达式中类型明显
zh_hant: 類型為來自指派運算式的實際型態

source: Move down
cs: Přesunout dolů
de: Nach unten
es: Bajar
fr: Descendre
it: Sposta giù
ja: 下へ移動
ko: 아래로 이동
pl: Przenieś w dół
pt_br: Mover para baixo
ru: Переместить вниз
tr: Aşağı taşı
zh_hans: 下移
zh_hant: 下移

source: Move up
cs: Přesunout nahoru
de: Nach oben
es: Subir
fr: Monter
it: Sposta su
ja: 上へ移動
ko: 위로 이동
pl: Przenieś w górę
pt_br: Mover para cima
ru: Переместить вверх
tr: Yukarı taşı
zh_hans: 上移
zh_hant: 上移

source: Remove
cs: Odebrat
de: Entfernen
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
ko: 제거
pl: Usuń
pt_br: Remover
ru: Удалить
tr: Kaldır
zh_hans: 删除
zh_hant: 移除

source: Pick members
cs: Vybrat členy
de: Member auswählen
es: Seleccionar miembros
fr: Choisir les membres
it: Seleziona membri
ja: メンバーの選択
ko: 멤버 선택
pl: Wybierz składowe
pt_br: Escolher membros
ru: Выбрать члены
tr: Üyeleri seçin
zh_hans: 挑选成员
zh_hant: 選取成員

source: Add a symbol specification
it: Aggiungi una specifica simboli
ja: シンボル仕様の追加
ru: Добавить спецификацию символа

source: Remove symbol specification
it: Rimuovi specifica simboli
ja: シンボル仕様の削除
ru: Удалить спецификацию символа

source: Add item
cs: Přidat položku
de: Element hinzufügen
es: Agregar elemento
fr: Ajouter l'élément
it: Aggiungi elemento
ja: 項目の追加
ko: 항목 추가
pl: Dodaj element
pt_br: Adicionar item
ru: Добавить элемент
tr: Öğe ekle
zh_hans: 添加项
zh_hant: 新增項目

source: Edit item
cs: Upravit položku
de: Element bearbeiten
es: Editar elemento
fr: Modifier l'élément
it: Modifica elemento
ja: 項目の編集
ko: 항목 편집
pl: Edytuj element
pt_br: Editar item
ru: Изменить элемент
tr: Öğeyi düzenle
zh_hans: 编辑项
zh_hant: 編輯項目

source: Remove item
cs: Odebrat položku
de: Element entfernen
es: Quitar elemento
fr: Supprimer l'élément
it: Rimuovi elemento
ja: 項目の削除
ko: 항목 제거
pl: Usuń element
pt_br: Remover item
ru: Удалить элемент
tr: Öğeyi kaldır
zh_hans: 删除项
zh_hant: 移除項目

source: Add a naming rule
cs: Přidat pravidlo pro pojmenování
de: Benennungsregel hinzufügen
es: Agregar una regla de nomenclatura
fr: Ajouter une règle de nommage
it: Aggiungi una regola di denominazione
ja: 名前付けルールの追加
ko: 명명 규칙 추가
pl: Dodaj regułę nazewnictwa
pt_br: Adicionar uma regra de nomenclatura
ru: Добавить правило именования
tr: Adlandırma kuralı ekle
zh_hans: 添加命名规则
zh_hant: 新增命名規則

source: Remove naming rule
cs: Odebrat pravidlo pojmenování
de: Benennungsregel entfernen
es: Quitar regla de nomenclatura
fr: Supprimer la règle de nommage
it: Rimuovi regola di denominazione
ja: 名前付けルールの削除
ko: 명명 규칙 제거
pl: Usuń regułę nazewnictwa
pt_br: Remover regra de nomenclatura
ru: Удалить правило именования
tr: Adlandırma kuralını kaldır
zh_hans: 删除命名规则
zh_hant: 移除命名規則

source: VisualStudioWorkspace.TryApplyChanges cannot be called from a background thread.
cs: VisualStudioWorkspace.TryApplyChanges nejde volat z vlákna na pozadí.
de: "VisualStudioWorkspace.TryApplyChanges" kann von einem Hintergrundthread nicht aufgerufen werden.
es: No se puede llamar a VisualStudioWorkspace.TryApplyChanges desde un subproceso en segundo plano.
fr: Impossible d'appeler VisualStudioWorkspace.TryApplyChanges à partir d'un thread d'arrière-plan.
it: Non è possibile chiamare VisualStudioWorkspace.TryApplyChanges da un thread in background.
ja: VisualStudioWorkspace.TryApplyChanges をバックグラウンド スレッドから呼び出すことはできません。
ko: 백그라운드 스레드에서 VisualStudioWorkspace.TryApplyChanges를 호출할 수 없습니다.
pl: Nie można wywołać elementu VisualStudioWorkspace.TryApplyChanges z wątku w tle.
pt_br: VisualStudioWorkspace.TryApplyChanges não pode ser chamado de um thread de tela de fundo.
ru: VisualStudioWorkspace.TryApplyChanges нельзя вызывать из фонового потока.
tr: VisualStudioWorkspace.TryApplyChanges bir arka plan iş parçacığından çağırılamaz.
zh_hans: VisualStudioWorkspace。TryApplyChanges 不能从后台线程调用。
zh_hant: 無法從背景執行緒呼叫 VisualStudioWorkspace.TryApplyChanges。

source: prefer throwing properties
cs: preferovat vyvolávací vlastnosti
de: ausgelöste Eigenschaften bevorzugen
es: preferir propiedades de lanzamiento
fr: préférer les propriétés de levée d'exceptions
it: preferisci proprietà generate
ja: スロー プロパティを優先する
ko: throw되는 속성 선호
pl: preferuj właściwości przerzucane
pt_br: preferir propriedades de lançamento
ru: предпочитать свойства, создающие исключения
tr: özel durum oluşturan özellikleri tercih et
zh_hans: 首选引发属性
zh_hant: 建議使用擲回屬性

source: When generating properties:
cs: Při generování vlastností:
de: Beim Generieren von Eigenschaften:
es: Al generar propiedades:
fr: Durant la génération des propriétés :
it: Durante la generazione di proprietà:
ja: プロパティの生成時:
ko: 속성을 생성하는 경우:
pl: Podczas generowania właściwości:
pt_br: Ao gerar propriedades:
ru: При создании свойств:
tr: Özellikler oluşturulurken:
zh_hans: 生成属性时:
zh_hant: 產生屬性時:

source: Options
cs: Možnosti
de: Optionen
es: Opciones
it: Opzioni
ja: オプション
ko: 옵션
pl: Opcje
pt_br: Opções
ru: Параметры
tr: Seçenekler
zh_hans: 选项
zh_hant: 選項

source: Never show this again
cs: Už znovu nezobrazovat
de: Nicht mehr anzeigen
es: No volver a mostrar
fr: Ne plus afficher
it: Non visualizzare più questo messaggio
ja: 今後は表示しない
ko: 다시 표시 안 함
pl: Nie pokazuj tego ponownie
pt_br: Nunca mostrar isso novamente
ru: Больше не показывать
tr: Bunu bir daha gösterme
zh_hans: 永不再显示
zh_hant: 永不再顯示

source: Prefer simple 'default' expression
cs: Upřednostňovat jednoduchý výraz default
de: Einfachen "default"-Ausdruck bevorzugen
es: Preferir la expresión simple "predeterminada"
fr: Préférer l'expression 'default' simple
it: Preferisci l'espressione 'default' semplice
ja: 単純な 'default' 式を優先する
ko: 간단한 'default' 식을 기본으로 사용
pl: Preferuj proste wyrażenie „default”
pt_br: Preferir a expressão 'default' simples
ru: Предпочитать простое выражение default
tr: Basit 'default' ifadesini tercih et
zh_hans: 偏爱简单的 "default" 表达式
zh_hant: 選擇精簡的 'default' 運算式

# Prefer_inferred_tuple_names
source: Prefer inferred tuple element names
cs: Preferovat odvozené názvy elementů řazené kolekce členů
de: Abgeleitete Tupelelementnamen bevorzugen
es: Preferir nombres de elementos de tupla inferidos
fr: Préférer les noms d'éléments de tuple déduits
it: Preferisci nomi di elemento di tupla dedotti
ja: 推定されたタプル要素の名前を優先します
ko: 유추된 튜플 요소 이름 선호
pl: Preferuj wywnioskowane nazwy elementów krotki
pt_br: Preferir usar nomes de elementos inferidos de tupla
ru: Предпочитать выводимые имена элементов кортежа
tr: Gösterilen demet öğesi adlarını tercih et
zh_hans: 首选推断元组元素名称
zh_hant: 優先使用推斷的元組元素名稱

source: Prefer inferred anonymous type member names
cs: Preferovat odvozené názvy členů anonymních typů
de: Abgeleitete Membernamen vom anonymen Typ bevorzugen
es: Preferir nombres de miembro de tipo anónimo inferidos
fr: Préférer les noms de membres de type anonyme déduits
it: Preferisci nomi di membro di tipo anonimo dedotti
ja: 推定された匿名型のメンバー名を優先します
ko: 유추된 무명 형식 멤버 이름 선호
pl: Preferuj wywnioskowane nazwy anonimowych składowych typu
pt_br: Prefira usar nomes de membro inferidos do tipo anônimo
ru: Предпочитать выводимые имена членов анонимного типа
tr: Gösterilen anonim tip üye adlarını tercih et
zh_hans: 首选推断匿名类型成员名称
zh_hant: 優先使用推斷的匿名型別成員名稱

source: Preview pane
cs: Podokno náhledu
de: Vorschaubereich
es: Panel de vista previa
fr: Volet d'aperçu
it: Riquadro di anteprima
ja: プレビュー ウィンドウ
ko: 미리 보기 창
pl: Okienko podglądu
pt_br: Painel de versão prévia
ru: Область просмотра
tr: Önizleme bölmesi
zh_hans: 预览窗格
zh_hant: 預覽窗格

source: Analysis
cs: Analýza
de: Analyse
es: Análisis
fr: Analyse
it: Analisi
ja: 解析
ko: 분석
pl: Analiza
pt_br: Análise
ru: Анализ
tr: Analiz
zh_hans: 分析
zh_hant: 分析

source: Fade out unreachable code
cs: Zesvětlit nedosažitelný kód
de: Unerreichbaren Code ausblenden
es: Atenuar código inaccesible
fr: Supprimer le code inaccessible
it: Applica dissolvenza a codice non eseguibile
ja: 到達できないコードをフェードアウトします
ko: 접근할 수 없는 코드 페이드 아웃
pl: Zanikanie nieosiągalnego kodu
pt_br: Esmaecer código inacessível
ru: Скрывать недостижимый код
tr: Erişilemeyen kodu soluklaştır
zh_hans: 淡出无法访问的代码
zh_hant: 淡出執行不到的程式碼

source: Fading
cs: Zesvětlení
de: Ausblenden
es: Atenuando
fr: Suppression
it: Dissolvenza
ja: フェード
ko: 페이딩
pl: Zanikanie
pt_br: Esmaecimento
ru: Исчезание
tr: Soluklaştırılıyor
zh_hans: 淡入淡出
zh_hant: 淡出

source: Prefer local function over anonymous function
cs: Preferovat lokální funkci před anonymní funkcí
de: Lokale Funktion gegenüber anonymer Funktion bevorzugen
es: Preferir una función local frente a una función anónima
fr: Préférer une fonction locale à une fonction anonyme
it: Preferisci la funzione locale a quella anonima
ja: 匿名関数よりローカル関数を優先します
ko: 익명 함수보다 로컬 함수 선호
pl: Preferuj funkcję lokalną zamiast funkcji anonimowej
pt_br: Preferir usar função anônima em vez de local
ru: Предпочитать локальную функцию анонимной функции
tr: Anonim işlevler yerine yerel işlevleri tercih et
zh_hans: 首选本地函数而不是匿名函数
zh_hant: 使用區域函式優先於匿名函式

source: Prefer deconstructed variable declaration
cs: Upřednostňovat dekonstruovanou deklaraci proměnných
de: Dekonstruierte Variablendeklaration vorziehen
es: Preferir declaración de variable desconstruida
fr: Préférer la déclaration de variable déconstruite
it: Preferisci dichiarazione di variabile decostruita
ja: 分解された変数宣言を優先する
ko: 분해된 변수 선언 사용
pl: Preferuj śródwierszową deklarację zmiennej
pt_br: Preferir declaração de variável desconstruída
ru: Предпочитать деконструированное объявление переменной
tr: Ayrıştırılmış değişken bildirimini tercih et
zh_hans: 首选析构变量声明
zh_hant: 偏好解構的變數宣告

source: External reference found
cs: Byl nalezen externí odkaz.
de: Es wurde ein externer Verweis gefunden.
es: Se encontró una referencia externa
fr: Référence externe trouvée
it: È stato trovato un riferimento esterno
ja: 外部参照が見つかりました
ko: 외부 참조가 있습니다.
pl: Znaleziono odwołanie zewnętrzne
pt_br: Referência externa encontrada
ru: Найдена внешняя ссылка.
tr: Dış başvuru bulundu
zh_hans: 找到外部引用
zh_hant: 找到外部參考

source: No references found to '{0}'
cs: Nebyly nalezeny žádné odkazy na {0}.
de: Es wurden keine Verweise auf "{0}" gefunden.
es: No se encontraron referencias a "{0}"
fr: Références introuvables pour '{0}'
it: Non sono stati trovati riferimenti a '{0}'
ja: {0}' の参照は見つかりませんでした
ko: '{0}'에 대한 참조가 없습니다.
pl: Nie znaleziono odwołań do elementu „{0}”
pt_br: Nenhuma referência encontrada para '{0}'
ru: Ссылки не найдены в "{0}".
tr: '{0}' için başvuru bulunamadı
zh_hans: 未找到对“{0}”的引用
zh_hant: 找不到 '{0}' 的參考

source: Search found no results
cs: Hledání nevrátilo žádné výsledky.
de: Es liegen keine Suchergebnisse vor.
es: No se encontraron resultados para la búsqueda
fr: La recherche n'a donné aucun résultat
it: La ricerca non ha restituito risultati
ja: 一致する検索結果はありません
ko: 검색 결과가 없습니다.
pl: Brak wyników wyszukiwania
pt_br: A pesquisa não encontrou resultados
ru: Поиск не дал результатов.
tr: Aramada sonuç bulunamadı
zh_hans: 找不到搜索结果
zh_hant: 搜尋找不到任何結果

# analyzer_Prefer_auto_properties
source: Prefer auto properties
cs: Preferovat automatické vlastnosti
de: Automatische Eigenschaften bevorzugen
es: Preferir propiedades automáticas
fr: Préférer les propriétés automatiques
it: Preferisci proprietà automatiche
ja: 自動プロパティを優先する
ko: 자동 속성 선호
pl: Preferuj właściwości automatyczne
pt_br: Preferir propriedades automáticas
ru: Предпочитать автосвойства
tr: Otomatik özellikleri tercih et
zh_hans: 首选自动属性
zh_hant: 建議使用自動屬性

# codegen_prefer_auto_properties
source: prefer auto properties
cs: preferovat automatické vlastnosti
de: automatische Eigenschaften bevorzugen
es: preferir propiedades automáticas
fr: préférer les propriétés automatiques
it: preferisci proprietà automatiche
ja: 自動プロパティを優先する
ko: 자동 속성 선호
pl: preferuj właściwości automatyczne
pt_br: preferir propriedades automáticas
ru: предпочитать автосвойства
tr: otomatik özellikleri tercih et
zh_hans: 首选自动属性
zh_hant: 建議使用自動屬性

source: Module has been unloaded.
it: Il modulo è stato scaricato.
ja: モジュールがアンロードされました。
ru: Модуль был выгружен.

source: Enable navigation to decompiled sources
cs: Povolit navigaci na dekompilované zdroje
de: Aktivieren der Navigation zu dekompilierten Quellen
es: Habilitar la navegación a orígenes decompilados
fr: Activer la navigation vers des sources décompilées
ko: 디컴파일된 원본으로의 이동을 사용하도록 설정
pl: Włącz nawigację do zdekompilowanych źródeł
pt_br: Habilitar a navegação para origens descompiladas
ru: Включить переход к декомпилированным источникам
tr: Derlenmiş kaynaklarda gezinmeyi etkinleştir
zh_hans: 支持导航到反编译源
zh_hant: 啟用到反向組譯來源的瀏覽

# Code_style_header_use_editor_config
source: Your .editorconfig file might override the local settings configured on this page which only apply to your machine. To configure these settings to travel with your solution use EditorConfig files. More info
cs: Váš soubor .editorconfig může přepsat místní nastavení nakonfigurovaná na této stránce, která platí jenom pro váš počítač. Pokud chcete tato nastavení nakonfigurovat tak, aby se přesouvala s vaším řešením, použijte soubory EditorConfig. Další informace
de: Ihre EditorConfig-Datei setzt möglicherweise die auf dieser Seite konfigurierten lokalen Einstellungen außer Kraft, die nur für Ihren Computer gelten. Verwenden Sie EditorConfig-Dateien, um diese Einstellungen für Ihre Projektmappe "mitzunehmen". Erfahren Sie mehr.
es: El archivo .editorconfig puede invalidar la configuración local definida en esta página que solo se aplica a su máquina. Para configurar estos valores de manera que se desplacen con su solución, use los archivos EditorConfig. Mas información
fr: Votre fichier .editorconfig peut remplacer les paramètres locaux configurés sur cette page, qui s'appliquent uniquement à votre machine. Pour configurer ces paramètres afin qu'ils soient liés à votre solution, utilisez les fichiers EditorConfig. En savoir plus
it: Il file con estensione editorconfig potrebbe eseguire l'override delle impostazioni locali configurate in questa pagina che si applicano solo al computer locale. Per configurare queste impostazioni in modo che siano associate alla soluzione, usare file con estensione editorconfig. Altre informazioni
ja: このページに構成されているローカル設定 (ご使用のマシンにのみ適用される) が .editorconfig ファイルによって上書きされる可能性があります。これらの設定をソリューション全体に適用するよう構成するには、EditorConfig ファイルを使用します。詳細情報
ko: .editorconfig 파일이 이 페이지에서 구성된 로컬 설정을 재정의할 수 있으며 해당 내용은 사용자의 머신에만 적용됩니다. 솔루션과 함께 이동하도록 해당 설정을 구성하려면 EditorConfig 파일을 사용하세요. 추가 정보
pl: Plik editorconfig może przesłonić ustawienia lokalne skonfigurowane na tej stronie, które mają zastosowanie tylko do maszyny. Aby skonfigurować te ustawienia w celu ich przenoszenia wraz z rozwiązaniem, skorzystaj z plików EditorConfig. Więcej informacji
pt_br: O arquivo .editorconfig pode substituir as configurações locais definidas nesta página que se aplicam somente ao seu computador. Para definir que essas configurações se desloquem com a sua solução, use arquivos EditorConfig. Mais informações
ru: Файл EditorConfig может переопределять локальные параметры, настроенные на этой странице, только для этого компьютера. Чтобы эти параметры были привязаны к решению, используйте файлы EditorConfig. Дополнительные сведения.
tr: .editorconfig dosyanız, bu sayfada yapılandırılan ve yalnızca makinenizde uygulanan yerel ayarları geçersiz kılabilir. Bu ayarları çözümünüzle birlikte hareket etmek üzere yapılandırmak için EditorConfig dosyalarını kullanın. Daha fazla bilgi
zh_hans: .editorconfig 文件可能会替代在本页上配置的仅适用于你的计算机的本地设置。要配置这些设置，使其始终随解决方案一起提供，请使用 EditorConfig 文件。详细信息
zh_hant: 您的 .editorconfig 檔案可能會覆寫於此頁面上設定的本機設定 (僅適用於您的電腦)。如果要進行設定以讓這些設定隨附於您的解決方案，請使用 EditorConfig 檔案。詳細資訊

source: Sync Class View
cs: Synchronizovat Zobrazení tříd
de: Synchronisierungsklassenansicht
es: Sincronizar vista de clases
fr: Synchroniser l'affichage de classes
it: Sincronizza visualizzazione classi
ja: クラス ビューの同期
ko: 클래스 뷰 동기화
pl: Synchronizuj widok klasy
pt_br: Sincronizar Modo de Exibição de Classe
ru: Синхронизировать представление классов
tr: Sınıf Görünümünü Eşitle
zh_hans: 同步类视图
zh_hant: 同步類別檢視

source: Analyzing '{0}'
it: Analisi di '{0}'
ja: '{0}' の分析
ru: Выполняется анализ "{0}"

source: Manage naming styles
cs: Spravovat styly pojmenování
de: Benennungsstile verwalten
es: Administrar estilos de nomenclatura
fr: Gérer les styles de nommage
it: Gestisci stili di denominazione
ja: 名前付けスタイルを管理する
ko: 명명 스타일 관리
pl: Zarządzaj stylami nazewnictwa
pt_br: Gerenciar estilos de nomenclatura
ru: Управление стилями именования
tr: Adlandırma stillerini yönetme
zh_hans: 管理命名样式
zh_hant: 管理命名樣式
