Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: A new namespace will be created
cs: Vytvoří se nový obor názvů.
de: Ein neuer Namespace wird erstellt.
es: Se creará un espacio de nombres
fr: Un espace de noms va être créé
it: Verrà creato un nuovo spazio dei nomi
ja: 新しい名前空間が作成されます
ko: 새 네임스페이스가 만들어집니다.
pl: Zostanie utworzona nowa przestrzeń nazw
pt_br: Um namespace será criado
ru: Будет создано пространство имен
tr: Yeni bir ad alanı oluşturulacak
zh_hans: 将创建一个新的命名空间
zh_hant: 將會建立新的命名空間

source: A type and name must be provided.
cs: Typ a název se musí poskytnout.
de: Typ und Name müssen angegeben werden.
es: Se debe proporcionar un tipo y un nombre.
fr: Vous devez fournir un type et un nom.
ja: 種類と名前を指定する必要があります。
ko: 형식과 이름을 지정해야 합니다.
pl: Konieczne jest podanie typu i nazwy.
pt_br: Um tipo e um nome precisam ser fornecidos.
ru: Следует указать тип и имя.
tr: Bir tür ve ad verilmesi gerekiyor.
zh_hans: 必须提供类型和名称。
zh_hant: 必須提供類型與名稱。

source: Action
cs: Akce
de: Aktion
es: Acción
ko: 작업
pl: Akcja
pt_br: Ação
ru: Действие
tr: Eylem
zh_hans: 操作
zh_hant: 動作

source: _Add
cs: _Přidat
de: _Hinzufügen
es: _Agregar
fr: _Ajouter
ja: 追加(_A)
ko: 추가(_A)
pl: _Dodaj
pt_br: _Adicionar
ru: Д_обавить
tr: _Ekle
zh_hans: 添加(_A)
zh_hant: 新增(_A)

source: Add Parameter
cs: Přidat parametr
de: Parameter hinzufügen
es: Agregar parámetro
fr: Ajouter un paramètre
ja: パラメーターの追加
ko: 매개 변수 추가
pl: Dodaj parametr
pt_br: Adicionar Parâmetro
ru: Добавить параметр
tr: Parametre Ekle
zh_hans: 添加参数
zh_hant: 新增參數

source: Add to _current file
cs: Přidat do _aktuálního souboru
de: Zu a_ktueller Datei hinzufügen
es: Agregar al archivo _actual
fr: Ajouter au fichier a_ctif
it: Aggiungi al file _corrente
ja: 現在のファイルに追加(_C)
ko: 현재 파일에 추가(_C)
pl: Dodaj do _bieżącego pliku
pt_br: Adicionar ao _arquivo atual
ru: Добавить в _текущий файл
tr: Geçerli _dosyaya ekle
zh_hans: 添加到当前文件(_C)
zh_hant: 新增至 _current 檔案

source: Added parameter.
cs: Parametr se přidal.
de: Hinzugefügter Parameter.
es: Se agregó el parámetro.
fr: Paramètre ajouté.
ja: 追加されたパラメーター。
ko: 매개 변수를 추가했습니다.
pl: Dodano parametr.
pt_br: Parâmetro adicionado.
ru: Добавлен параметр.
tr: Parametre eklendi.
zh_hans: 添加了参数。
zh_hant: 已新增參數。

source: Additional changes are needed to complete the refactoring. Review changes below.
cs: Aby bylo možné dokončit refaktoring, je nutné udělat další změny. Zkontrolujte změny níže.
de: Es sind weitere Änderungen erforderlich, um das Refactoring abzuschließen. Prüfen Sie die unten aufgeführten Änderungen.
es: Se necesitan cambios adicionales para finalizar la refactorización. Revise los cambios a continuación.
fr: Des changements supplémentaires sont nécessaires pour effectuer la refactorisation. Passez en revue les changements ci-dessous.
it: Per completare il refactoring, sono necessarie modifiche aggiuntive. Esaminare le modifiche di seguito.
ja: リファクタリングを完了するには、追加的な変更が必要です。下記の変更内容を確認してください。
ko: 리팩터링을 완료하려면 추가 변경이 필요합니다. 아래 변경 내용을 검토하세요.
pl: W celu ukończenia refaktoryzacji wymagane są dodatkowe zmiany. Przejrzyj zmiany poniżej.
pt_br: Alterações adicionais são necessárias para concluir a refatoração. Revise as alterações abaixo.
ru: Для завершения рефакторинга требуется внести дополнительные изменения. Просмотрите их ниже.
tr: Yeniden düzenlemeyi tamamlamak için ek değişiklikler gerekli. Aşağıdaki değişiklikleri gözden geçirin.
zh_hans: 需要进行其他更改才可完成重构。请在下方查看所作更改。
zh_hant: 必須進行其他變更，才能完成重構。請檢閱以下變更。

source: All methods
cs: Všechny metody
de: Alle Methoden
es: Todos los métodos
fr: Toutes les méthodes
it: Tutti i metodi
ja: すべてのメソッド
ko: 모든 메서드
pl: Wszystkie metody
pt_br: Todos os métodos
ru: Все методы
tr: Tüm yöntemler
zh_hans: 所有方法
zh_hant: 全部方法

source: All sources
cs: Všechny zdroje
de: Alle Quellen
es: Todos los orígenes
fr: Toutes les sources
ja: すべてのソース
ko: 모든 소스
pl: Wszystkie źródła
pt_br: Todas as fontes
ru: Все источники
tr: Tüm kaynaklar
zh_hans: 所有源
zh_hant: 所有來源

# Allow_colon
source: Allow:
cs: Povolit:
de: Zulassen:
es: Permitir:
fr: Autoriser :
it: Consenti:
ja: 許可:
ko: 허용:
pl: Zezwalaj:
pt_br: Permitir:
ru: Разрешить:
tr: İzin ver:
zh_hans: 允许:
zh_hant: 允許:

source: Allow multiple blank lines
cs: Povolit více než jeden prázdný řádek
de: Mehrere Leerzeilen zulassen
es: Permitir varias líneas en blanco
fr: Autoriser plusieurs lignes vides
ko: 여러 빈 줄 허용
pl: Zezwalaj na wiele pustych wierszy
pt_br: Permitir várias linhas em branco
ru: Разрешать несколько пустых строк
tr: Birden çok boş satıra izin ver
zh_hans: 允许使用多个空白行
zh_hant: 允許多個空白行

source: Allow statement immediately after block
cs: Povolit příkaz hned za blokem
de: Anweisung direkt nach Block zulassen
es: Permitir una instrucción inmediatamente después del bloque
fr: Autoriser l'instruction juste après le bloc
ko: 블록 바로 뒤에 문 허용
pl: Zezwalaj na instrukcję bezpośrednio po bloku
pt_br: Permitir uma instrução imediatamente após o bloco
ru: Разрешать помещать оператор сразу же после блока
tr: Bloktan hemen sonra deyime izin ver
zh_hans: 允许块后紧跟语句
zh_hant: 允許在區塊後面立即加上陳述式

source: Always
cs: Vždy
de: Immer
es: Siempre
fr: Toujours
ko: 항상
pl: Zawsze
pt_br: Sempre
ru: Всегда
tr: Her zaman
zh_hans: 始终
zh_hant: 一律

source: Always for clarity
cs: Vždy kvůli srozumitelnosti
de: Immer zur besseren Unterscheidung
es: Siempre por claridad
fr: Toujours pour plus de clarté
it: Sempre per chiarezza
ja: わかりやすくするために常に
ko: 명확하게 하기 위해 항상
pl: Zawsze w celu zachowania jednoznaczności
pt_br: Sempre para esclarecimento
ru: Всегда использовать для ясности
tr: Açıklık sağlamak için her zaman
zh_hans: 为始终保持清楚起见
zh_hant: 一律使用以明確表示

source: Always use default symbol servers for navigation
cs: Pro navigaci vždy používat výchozí servery symbolů
de: Immer Standardsymbolserver für die Navigation verwenden
es: Usar siempre los servidores de símbolos predeterminados para la navegación
fr: Toujours utiliser les serveurs de symboles par défaut pour la navigation
ko: 탐색에 항상 기본 기호 서버 사용
pl: Zawsze używaj domyślnych serwerów symboli na potrzeby nawigowania
pt_br: Sempre usar servidores de símbolo padrão para navegação
ru: Всегда использовать серверы символов по умолчанию для навигации
tr: Gezinti için her zaman varsayılan sembol sunucularını kullan
zh_hans: 始终使用默认符号服务器进行导航
zh_hant: 一律使用預設符號伺服器進行流覽

source: Analyze source generated files
cs: Analyzovat zdrojové soubory.
de: Analysieren der von der Quelle generierten Dateien
es: Analizar archivos generados por el origen
fr: Analyser des fichiers générés par la source
ko: 소스에서 생성된 파일 분석
pt_br: Analisar arquivos gerados pela origem
ru: Анализ сгенерированного исходного файла
tr: Kaynak tarafından oluşturulan dosyaları analiz et

source: Analyzer Defaults
cs: Výchozí hodnoty analyzátoru
de: Standardwerte des Analysetools
es: Valores predeterminados del analizador
fr: Valeurs par défaut de l’analyseur
ko: 분석기 기본값
pl: Ustawienia domyślne analizatora
pt_br: Padrões do Analisador
ru: Значения по умолчанию для анализатора
tr: Çözümleyici Varsayılanları
zh_hans: 分析器默认值
zh_hant: 分析器預設值

source: Analyzers
cs: Analyzátory
de: Analyse
es: Analizadores
fr: Analyseurs
ko: 분석기
pl: Analizatory
pt_br: Analisadores
ru: Анализаторы
tr: Çözümleyiciler
zh_hans: 分析器
zh_hant: 分析器

source: Analyzing project references...
cs: Analyzují se odkazy projektů...
de: Projektverweise werden analysiert...
es: Analizando las referencias del proyecto...
fr: Analyse des références de projet...
ko: 프로젝트 참조를 분석하는 중...
pl: Analizowanie odwołań do projektu...
pt_br: Analisando as referências do projeto...
ru: Анализ ссылок проекта…
tr: Proje başvuruları analiz ediliyor...
zh_hans: 正在分析项目引用…
zh_hant: 正在分析專案參考...

source: Apply
cs: Použít
de: Anwenden
es: Aplicar
fr: Appliquer
ko: 적용
pl: Zastosuj
pt_br: Aplicar
ru: Применить
tr: Uygula
zh_hans: 应用
zh_hant: 套用

source: Apply '{0}' keymapping scheme
cs: Použít schéma mapování klávesnice {0}
de: Tastenzuordnungsschema "{0}" anwenden
es: Aplicar esquema de asignaciones de teclado "{0}"
fr: Appliquer le modèle de configuration du clavier '{0}'
it: Applica lo schema di mapping dei tasti '{0}'
ja: '{0}' のキー マップ スキームを適用します
ko: '{0}' 키 매핑 구성표 적용
pl: Zastosuj schemat mapowania klawiszy „{0}”
pt_br: Aplicar esquema de mapeamento de teclas '{0}'
ru: Применить схему назначения клавиш "{0}"
tr: '{0}' tuş eşlemesi düzenini uygula
zh_hans: 应用“{0}”项映射计划
zh_hant: 套用 '{0}' 按鍵對應結構描述

source: Assemblies
cs: Sestavení
de: Assemblys
es: Ensamblados
fr: Assemblys
ko: 어셈블리
pl: Zestawy
ru: Сборки
tr: Derlemeler
zh_hans: 程序集
zh_hant: 組件

source: Automatically open Stack Trace Explorer on focus
cs: Automaticky otevírat Průzkumníka trasování zásobníku při fokusu
de: Stack Trace Explorer automatisch im Fokus öffnen
es: Abrir automáticamente el Explorador de seguimiento de pila al centrarse
fr: Ouvrir automatiquement l’Explorateur de traces de pile en cas de focus
ko: 포커스에서 자동으로 스택 추적 탐색기 열기
pl: Automatycznie otwieraj Stack Trace Explorer przy fokusie
pt_br: Abra automaticamente o Stack Trace Explorer em foco
ru: Автоматически открывать обозреватель трассировки стека при фокусировке
tr: Odaklanmada Yığın İzleme Gezgini'ni otomatik olarak aç
zh_hans: 在焦点上自动打开“堆栈跟踪资源管理器”
zh_hant: 在焦點時會自動開啟堆疊追蹤總管

source: Avoid expression statements that implicitly ignore value
cs: Vyhněte se výrazům, které implicitně ignorují hodnotu.
de: Ausdrucksanweisungen vermeiden, die implizit Werte ignorieren
es: Evitar instrucciones de expresión que omiten implícitamente el valor
fr: Éviter les instructions d'expression qui ignorent implicitement la valeur
it: Evita le istruzioni di espressione che ignorano il valore in modo implicito
ja: 値を暗黙的に無視する式ステートメントを指定しないでください
ko: 암시적으로 값을 무시하는 식 문을 사용하지 마세요.
pl: Unikaj instrukcji wyrażeń, które niejawnie ignorują wartość
pt_br: Evitar instruções de expressão que implicitamente ignoram valor
ru: Избегайте операторов-выражений, неявно игнорирующих значение.
tr: Değeri örtük olarak yok sayan ifade deyimlerini engelle
zh_hans: 避免会隐式忽略值的表达式语句
zh_hant: 避免會隱含地忽略值的運算陳述式

source: Avoid unused parameters
cs: Vyhněte se nepoužitým parametrům.
de: Nicht verwendete Parameter vermeiden
es: Evitar parámetros sin usar
fr: Éviter les paramètres inutilisés
it: Evita i parametri inutilizzati
ja: 使用されないパラメーターを指定しないでください
ko: 사용되지 않는 매개 변수를 사용하지 마세요.
pl: Unikaj nieużywanych parametrów
pt_br: Evitar parâmetros não utilizados
ru: Избегайте неиспользуемых параметров.
tr: Kullanılmayan parametreleri engelle
zh_hans: 避免未使用的参数
zh_hant: 避免未使用的參數

source: Avoid unused value assignments
cs: Vyhněte se přiřazení nepoužitých hodnot.
de: Zuweisungen nicht verwendeter Werte vermeiden
es: Evitar asignaciones de valores sin usar
fr: Éviter les assignations de valeurs inutilisées
it: Evita le assegnazioni di valori inutilizzati
ja: 使用されない値の代入を指定しないでください
ko: 사용되지 않는 값 할당을 사용하지 마세요.
pl: Unikaj nieużywanych przypisań wartości
pt_br: Evitar atribuições de valor não utilizadas
ru: Избегайте присваивания неиспользуемых значений.
tr: Kullanılmayan değer atamalarını engelle
zh_hans: 避免未使用的值赋值
zh_hant: 避免未使用的值指派

source: Back
cs: Zpět
de: Zurück
es: Atrás
fr: Précédent
it: Indietro
ja: 戻る
ko: 뒤로
pl: Wstecz
pt_br: Voltar
ru: Назад
tr: Geri
zh_hans: 后退
zh_hant: 返回

source: Beginning of line
cs: Začátek řádku
de: Zeilenanfang
es: Principio de línea
fr: Début de ligne
ko: 줄의 시작
pl: Początek wiersza
pt_br: Início da linha
ru: Начало строки
tr: Satır başlangıcı
zh_hans: 行首
zh_hant: 行首

# Bitness32
source: 32-bit
cs: 32b
es: 32 bits
fr: 32 bits
ko: 32비트
pl: 32-bitowa
pt_br: 32 bits
ru: 32-разрядный
zh_hans: 32 位
zh_hant: 32 位元

# Bitness64
source: 64-bit
cs: 64b
es: 64 bits
fr: 64 bits
ko: 64비트
pl: 64-bitowa
pt_br: 64 bits
ru: 64-разрядный
zh_hans: 64 位
zh_hant: 64 位元

# Build_plus_live_analysis_NuGet_package
source: Build + live analysis (NuGet package)
it: Compilazione + analisi in tempo reale (pacchetto NuGet)
ja: ビルド + ライブ分析 (NuGet パッケージ)
ru: Сборка и динамический анализ (пакет NuGet)

# CSharp_Visual_Basic_Diagnostics_Language_Client
source: C#/Visual Basic Diagnostics Language Client
ru: Языковой клиент диагностики C#/Visual Basic

source: Calculating...
cs: Probíhá výpočet…
de: Wird berechnet...
es: Calculando...
fr: Calcul...
ko: 계산 중...
pl: Trwa obliczanie...
pt_br: Calculando...
ru: Вычисление...
tr: Hesaplanıyor...
zh_hans: 正在计算...
zh_hant: 正在計算...

source: Calculating dependents...
cs: Počítají se závislosti...
de: Abhängige Objekte werden berechnet...
es: Calculando dependientes...
fr: Calcul des dépendants...
it: Calcolo dei dipendenti...
ja: 依存を計算しています...
ko: 종속 항목을 계산하는 중...
pl: Obliczanie elementów zależnych...
pt_br: Calculando dependentes...
ru: Вычисление зависимостей…
tr: Bağımlılar hesaplanıyor...
zh_hans: 正在计算依赖项...
zh_hant: 正在計算相依項...

source: Call Hierarchy
cs: Hierarchie volání
de: Aufrufhierarchie
es: Jerarquía de llamadas
fr: Hiérarchie d'appels
ko: 호출 계층 구조
pt_br: Hierarquia de Chamada
ru: Иерархия вызовов
tr: Çağrı Hiyerarşisi

source: Call site value:
cs: Hodnota lokality volání:
de: Wert der Aufrufsite:
es: Valor del sitio de llamada:
fr: Valeur du site d'appel :
ja: 呼び出しサイトの値:
ko: 호출 사이트 값:
pl: Wartość miejsca wywołania:
pt_br: Chamar valor do site:
ru: Значение места вызова:
tr: Çağrı konumu değeri:
zh_hans: 调用站点值:
zh_hant: 呼叫網站值:

source: Call site
cs: Lokalita volání
de: Aufrufsite
es: Sitio de llamada
fr: Site d'appel
ja: 呼び出しサイト
ko: 호출 사이트
pl: Miejsce wywołania
pt_br: Chamar site
ru: Место вызова
tr: Çağrı konumu
zh_hans: 调用站点
zh_hant: 呼叫網站

source: Carriage Return + Newline (\r\n)
cs: Návrat na začátek řádku + Nový řádek (\r\n)
de: Wagenrücklauf + Zeilenumbruch (\r\n)
es: CR + Nueva línea (\r\n)
fr: Retour chariot + saut de ligne (\r\n)
ko: 캐리지 리턴 + 줄 바꿈(\r\n)
pl: Powrót karetki + nowy wiersz (\r\n)
pt_br: Retorno de Carro + Nova linha (\r\n)
ru: Возврат каретки + символ новой строки (\r\n)
tr: Satır Başı + Yeni Satır (\r\n)
zh_hans: 回车 + 换行(\r\n)
zh_hant: 歸位字元 + 新行 (\r\n)

source: Carriage Return (\r)
cs: Návrat na začátek řádku (\r)
de: Wagenrücklauf (\r)
es: CR (\r)
fr: Retour chariot (\r)
ko: 캐리지 리턴(\r)
pl: Powrót karetki (\r)
pt_br: Retorno de carro (\r)
ru: Возврат каретки (\r)
tr: Satır başı (\r)
zh_hans: 回车(\r)
zh_hant: 歸位字元 (\r)

source: Category
cs: Kategorie
de: Kategorie
es: Categoría
fr: Catégorie
ko: 범주
pl: Kategoria
pt_br: Categoria
ru: Категория
tr: Kategori
zh_hans: 类别
zh_hant: 分類

source: Choose which action you would like to perform on the unused references.
cs: Zvolte, kterou akci chcete provést pro nepoužívané odkazy.
de: Wählen Sie die Aktion aus, die Sie für nicht verwendete Verweise ausführen möchten.
es: Elija la acción que quiera realizar en las referencias sin usar.
fr: Choisissez l'action à effectuer sur les références inutilisées.
ko: 사용하지 않는 참조에 대해 수행할 작업을 선택합니다.
pl: Wybierz akcję, którą chcesz wykonać na nieużywanych odwołaniach.
pt_br: Escolha qual ação você deseja executar nas referências não usadas.
ru: Выберите действие, которое необходимо выполнить для неиспользуемых ссылок.
tr: Kullanılmayan başvurularda hangi eylemi gerçekleştirmek istediğinizi seçin.
zh_hans: 选择要对未使用的引用执行的操作。
zh_hant: 選擇您要對未使用之參考執行的動作。

source: Clear
cs: Vymazat
de: Löschen
es: Borrar
fr: Effacer
ko: 지우기
pl: Wyczyść
pt_br: Limpar
ru: Очистить
tr: Temizle
zh_hans: 清除
zh_hant: 清除

source: Close Tab
cs: Zavřít kartu
de: Registerkarte schließen
es: Cerrar pestaña
fr: Fermer l'onglet
ko: 탭 닫기
pl: Zamknij kartę
pt_br: Fechar Guia
ru: Закрыть вкладку
tr: Sekmeyi Kapat
zh_hans: 关闭选项卡
zh_hant: [關閉] 索引標籤

source: Code Style
cs: Styl kódu
de: Codeformat
es: Estilo de código
fr: Style de code
ko: 코드 스타일
pl: Styl kodu
pt_br: Estilo do Código
ru: Стиль кода
tr: Kod Stili
zh_hans: 代码样式
zh_hant: 程式碼樣式

source: Code analysis completed for '{0}'.
cs: Dokončila se analýza kódu pro {0}.
de: Die Codeanalyse für "{0}" wurde abgeschlossen.
es: El análisis de código se ha completado para "{0}".
fr: Analyse du code effectuée pour '{0}'.
ja: '{0}' のコード分析が完了しました。
ko: '{0}'에 대한 코드 분석이 완료되었습니다.
pl: Ukończono analizę kodu dla elementu „{0}”.
pt_br: Análise de código concluída para '{0}'.
ru: Анализ кода для "{0}" выполнен.
tr: '{0}' için kod analizi tamamlandı.
zh_hans: “{0}”的代码分析已完成。
zh_hant: '{0}' 的程式碼分析已完成。

source: Code analysis completed for Solution.
cs: Dokončila se analýza kódu pro řešení.
de: Die Codeanalyse für die Projektmappe wurde abgeschlossen.
es: El análisis de código se ha completado para la solución.
fr: Analyse du code effectuée pour la solution.
ja: ソリューションのコード分析が完了しました。
ko: 솔루션에 대한 코드 분석이 완료되었습니다.
pt_br: Análise de código concluída para a Solução.
ru: Анализ кода для решения выполнен.
tr: Çözüm için kod analizi tamamlandı.

source: Code analysis terminated before completion for '{0}'.
cs: Analýza kódu pro {0} se ukončila dříve, než se dokončila.
de: Die Codeanalyse wurde für "{0}" vorzeitig beendet.
es: El análisis de código terminó antes de completarse para "{0}".
fr: L'analyse du code s'est terminée avant la fin de '{0}'.
ja: コード分析が、'{0}' の完了前に終了しました。
ko: '{0}' 완료 전에 코드 분석이 종료되었습니다.
pl: Analiza kodu zakończyła się przed zakończeniem dla: „{0}”.
pt_br: Análise de código terminada antes da conclusão para '{0}'.
ru: Анализ кода прерван до завершения "{0}".
tr: Kod analizi, '{0}' için tamamlanmadan önce sonlandırıldı.
zh_hans: “{0}”的代码分析在完成之前终止。
zh_hant: 程式碼分析在 '{0}' 完成前終止。

source: Code analysis terminated before completion for Solution.
cs: Analýza kódu pro řešení se ukončila dříve, než se dokončila.
de: Die Codeanalyse wurde für die Projektmappe vorzeitig beendet.
es: El análisis de código terminó antes de completarse para la solución.
fr: L'analyse du code s'est terminée avant la fin de la solution.
ja: コード分析が、ソリューションでの完了前に終了しました。
ko: 솔루션 완료 전에 코드 분석이 종료되었습니다.
pt_br: Análise de código terminada antes da conclusão da Solução.
ru: Анализ кода прерван до завершения решения.
tr: Kod analizi, Çözüm için tamamlanmadan önce sonlandırıldı.

# Collapse_metadata_signature_files_on_open
source: Collapse metadata signature files to definitions on file open
cs: Sbalit soubory s podpisy metadat do definic při otevření souboru
de: Metadatensignaturdateien beim Öffnen der Datei auf Definitionen reduzieren
es: Contraer archivos de firma de metadatos a definiciones al abrir archivos
fr: Réduire les fichiers de signature de métadonnées aux définitions à l’ouverture du fichier
ko: 파일을 열 때 메타데이터 서명 파일을 정의로 축소
pl: Zwiń pliki podpisu metadanych do definicji przy otwieraniu pliku
pt_br: Recolher arquivos de assinatura de metadados para definições no arquivo aberto
ru: Сворачивать файлы подписей метаданных в определения при открытии файлов
tr: Dosya açılırken meta veri imza dosyalarını tanımlara daralt
zh_hans: 在文件打开时将元数据签名文件折叠到定义
zh_hant: 在檔案開啟時，將中繼資料簽章檔案摺疊到定義

source: Collapse #regions on file open
cs: Sbalit #regions při otevření souboru
de: Beim Öffnen einer Datei #regions reduzieren
es: Contraer #regions al abrir archivos
fr: Réduire #regions sur le fichier ouvert
ko: 파일을 열 때 #regions 축소
pl: Zwiń #regions przy otwieraniu pliku
pt_br: Recolher #regions no arquivo aberto
ru: Сворачивать #regions при открытии файлов
tr: Dosya #regions dosyayı daralt
zh_hans: 打开文件时折叠 #regions
zh_hant: 在開啟檔案時折疊 #regions

# Collapse_sourcelink_embedded_decompiled_files_on_open
source: Collapse Source Link, Embedded, and Decompiled source to definitions on file open
cs: Sbalit Source Link, vložený a dekompilovaný zdroj do definic při otevření souboru
de: Quellverknüpfung, eingebettete und dekompilierte Quelle auf Definitionen beim Öffnen der Datei reduzieren
es: Contraer el vínculo de origen, el origen incrustado y el descompilado a las definiciones al abrir archivos
fr: Réduire Source Link, la source incorporée et décompilée aux définitions sur le fichier ouvert
ko: 파일을 열 때 소스 링크, 포함 및 디컴파일된 소스를 정의로 축소
pl: Zwiń źródło linku do źródła, osadzone i zdekompilowane źródło do definicji przy otwieraniu pliku
pt_br: Recolher o Source Link, a Fonte Integrada e Descompilada para definições no arquivo aberto
ru: Сворачивать ссылку на источник, встроенный и декомпилированный источник в определения при открытии файлов
tr: Dosya açılırken Kaynak Bağlantısı, Ekli ve Kaynak Koda Dönüştürülen kaynağı tanımlara daralt
zh_hans: 在文件打开时将源链接、嵌入和反编译的源折叠到定义
zh_hant: 在檔案開啟時，將來源連結、內嵌和反向組譯的來源摺疊到定義

source: Color hints
cs: Barevné nápovědy
de: Farbhinweise
es: Sugerencias de color
fr: Indicateurs de couleurs
ko: 색 힌트
pl: Wskazówki kolorów
pt_br: Dicas com cores
ru: Цветовые подсказки
tr: Renk ipuçları
zh_hans: 颜色提示
zh_hant: 色彩提示

source: Colorize JSON strings
cs: Obarvit řetězce JSON
de: JSON-Zeichenfolgen farblich hervorheben
es: Colorear las cadenas JSON
fr: Coloriser les chaînes JSON
ko: JSON 문자열 색 지정
pl: Koloruj ciągi JSON
pt_br: Colorizar cadeias de caracteres JSON
ru: Выделить строки JSON цветом
tr: JSON dizelerini renklendir
zh_hans: 对 JSON 字符串着色
zh_hant: 為 JSON 字串上色

source: Colorize regular expressions
cs: Obarvit regulární výrazy
de: Reguläre Ausdrücke farbig hervorheben
es: Colorear expresiones regulares
fr: Coloriser les expressions régulières
it: Colora espressioni regolari
ja: 正規表現をカラー化
ko: 정규식 색 지정
pl: Koloruj wyrażenia regularne
pt_br: Colorir expressões regulares
ru: Выделить регулярные выражения цветом
tr: Normal ifadeleri renklendir
zh_hans: 为正规表达式着色
zh_hant: 為規則運算式添加色彩

source: Combine inheritance margin with indicator margin
cs: Kombinovat okraj dědičnosti s okrajem indikátoru
de: Vererbungsrand mit Indikatorrand kombinieren
es: Combinar margen de herencia con margen de indicador
fr: Combiner la marge d’héritage avec la marge d’indicateur
ko: 상속 여백과 표시기 여백 결합
pl: Połącz margines dziedziczenia z marginesem wskaźnika
pt_br: Combinar a margem de herança com a margem do indicador
ru: Объединение поля наследования с полем индикаторов
tr: Devralma dış boşluğunu gösterge dış boşluğu ile birleştir
zh_hans: 合并继承边距与指示器边距
zh_hant: 合併繼承邊界與指標邊界

source: Comments
cs: Komentáře
de: Kommentare
es: Comentarios
fr: Commentaires
ko: 설명
pl: Komentarze
pt_br: Comentários
ru: Комментарии
tr: Açıklamalar
zh_hans: 备注
zh_hant: 註解

source: Containing Member
cs: Obsahující člen
de: Enthaltender Member
es: Miembro contenedor
fr: Membre conteneur
ja: 含んでいるメンバー
ko: 포함하는 멤버
pl: Zawierająca składowa
pt_br: Contendo Membro
ru: Содержащий член
tr: Kapsayan Üye
zh_hans: 包含成员
zh_hant: 包含的成員

source: Containing Type
cs: Obsahující typ
de: Enthaltender Typ
es: Tipo contenedor
fr: Type conteneur
ja: 含んでいる型
ko: 포함하는 형식
pl: Zawierający typ
pt_br: Contendo Tipo
ru: Содержащий тип
tr: Kapsayan Tür
zh_hans: 包含类型
zh_hant: 包含的類型

source: Current document
cs: Aktuální dokument
de: Aktuelles Dokument
es: Documento actual
fr: Document en cours
ja: 現在のドキュメント
ko: 현재 문서
pl: Bieżący dokument
pt_br: Documento atual
ru: Текущий документ
tr: Geçerli belge
zh_hans: 当前文档
zh_hant: 目前的文件

source: Current parameter
cs: Aktuální parametr
de: Aktueller Parameter
es: Parámetro actual
fr: Paramètre actuel
ja: 現在のパラメーター
ko: 현재 매개 변수
pl: Bieżący parametr
pt_br: Parâmetro atual
ru: Текущий параметр
tr: Geçerli parametre
zh_hans: 当前参数
zh_hant: 目前的參數

source: Default (Current Document)
cs: Výchozí (aktuální dokument)
de: Standard (aktuelles Dokument)
es: Predeterminado (Documento actual)
fr: Par défaut (document actif)
ko: 기본값(현재 문서)
pt_br: Padrão (documento atual)
ru: По умолчанию (текущий документ)
tr: Varsayılan (Geçerli Belge)

source: Default (Entire Solution)
cs: Výchozí (celé řešení)
de: Standard (gesamte Lösung)
es: Valor predeterminado (Toda la solución)
fr: Par défaut (solution entière)
ko: 기본값(전체 솔루션)
pt_br: Padrão (solução inteira)
ru: По умолчанию (все решение)
tr: Varsayılan (Tüm Çözüm)

source: Default (None)
cs: Výchozí (žádné)
de: Standard (keine)
es: Valor predeterminado (ninguno)
fr: Par défaut (aucun)
ko: 기본값(없음)
pt_br: Padrão (nenhum)
ru: По умолчанию (нет)
tr: Varsayılan (Yok)

source: Default (Open Documents)
cs: Výchozí (otevřené dokumenty)
de: Standard (geöffnete Dokumente)
es: Valor predeterminado (Abrir documentos)
fr: Par défaut (ouvrir les documents)
ko: 기본값(문서 열기)
pt_br: Padrão (documentos abertos)
ru: По умолчанию (открытые документы)
tr: Varsayılan (Açık Belgeler)
