Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Warning_colon_duplicate_parameter_name
source: Warning: duplicate parameter name
cs: Upozornění: duplicitní název parametru
de: Warnung: doppelter Parametername
es: Advertencia: Nombre de parámetro duplicado
fr: Avertissement : Nom de paramètre dupliqué
ja: 警告: パラメーター名が重複しています
ko: 경고: 매개 변수 이름이 중복되었습니다.
pl: Ostrzeżenie: zduplikowana nazwa parametru
pt_br: Aviso: nome de parâmetro duplicado
ru: Предупреждение: повторяющееся имя параметра.
tr: Uyarı: Yinelenen parametre adı
zh_hans: 警告: 参数名重复
zh_hant: 警告: 參數名稱重複

# Warning_colon_type_does_not_bind
source: Warning: type does not bind
cs: Upozornění: Typ se neváže
de: Warnung: Der Typ ist nicht gebunden.
es: Advertencia: El tipo no se enlaza
fr: Avertissement : Le type n'est pas lié
ja: 警告: 型はバインドしていません
ko: 경고: 형식이 바인딩되어 있지 않습니다.
pl: Ostrzeżenie: nie można powiązać typu
pt_br: Aviso: o tipo não se associa
ru: Предупреждение: привязка типа невозможна.
tr: Uyarı: Tür bağlamıyor
zh_hans: 警告: 类型未绑定
zh_hant: 警告: 類型未繫結

source: We notice you suspended '{0}'. Reset keymappings to continue to navigate and refactor.
cs: Zaznamenali jsme, že jste pozastavili: {0}. Obnovte mapování klávesnice, abyste mohli pokračovat v navigaci a refactoringu.
de: Wir haben festgestellt, dass Sie "{0}" angehalten haben. Setzen Sie die Tastenzuordnungen zurück, um Navigation und Umgestaltung fortzusetzen.
es: Observamos que ha suspendido "{0}". Restablezca las asignaciones de teclado para continuar navegando y refactorizando.
fr: Nous avons remarqué que vous avez interrompu '{0}'. Réinitialisez la configuration du clavier pour continuer à naviguer et à refactoriser.
it: È stato notato che '{0}' è stato sospeso. Reimpostare i mapping dei tasti per continuare a esplorare e a eseguire il refactoring.
ja: '{0}' が中断されました。キーマップをリセットして、移動とリファクターを続行してください。
ko: '{0}'을(를) 일시 중단하신 것으로 보입니다. 계속 탐색하고 리팩터링하려면 키 매핑을 다시 설정하세요.
pl: Zauważyliśmy, że element „{0}” został przez Ciebie wstrzymany. Zresetuj mapowanie klawiszy, aby kontynuować nawigowanie i refaktoryzację.
pt_br: Notamos que você suspendeu '{0}'. Redefina os mapeamentos de teclas para continuar a navegar e refatorar.
ru: Вы приостановили действие "{0}". Сбросьте назначения клавиш, чтобы продолжить работу и рефакторинг.
tr: '{0}' öğesini askıya aldığınızı fark ettik. Gezintiye ve yeniden düzenlemeye devam etmek için tuş eşlemelerini sıfırlayın.
zh_hans: 我们注意到你挂起了“{0}”。请重置项映射以继续导航和重构。
zh_hant: 我們發現您暫止了 '{0}'。重設按鍵對應以繼續巡覽和重構。

source: This workspace does not support updating Visual Basic compilation options.
cs: Tento pracovní prostor nepodporuje aktualizaci možností kompilace jazyka Visual Basic.
de: Das Aktualisieren von Visual Basic-Kompilierungsoptionen wird von diesem Arbeitsbereich nicht unterstützt.
es: Esta área de trabajo no admite la actualización de opciones de compilación de Visual Basic.
fr: Cet espace de travail ne prend pas en charge la mise à jour des options de compilation Visual Basic.
it: Quest'area di lavoro non supporta l'aggiornamento delle opzioni di compilazione di Visual Basic.
ja: このワークスペースでは、Visual Basic コンパイル オプションの更新がサポートされていません。
ko: 이 작업 영역은 Visual Basic 컴파일 옵션 업데이트를 지원하지 않습니다.
pl: Ten obszar roboczy nie obsługuje aktualizowania opcji kompilacji dla języka Visual Basic.
pt_br: Este workspace não é compatível com a atualização das opções de compilação do Visual Basic.
ru: Эта рабочая область не поддерживает обновление параметров компиляции Visual Basic.
tr: Bu çalışma alanı Visual Basic derleme seçeneklerinin güncelleştirilmesini desteklemiyor.
zh_hans: 此工作区不支持更新 Visual Basic 编译选项。
zh_hant: 此工作區不支援更新 Visual Basic 編譯選項。

source: Where should the rename UI be shown?
cs: Kde by se mělo zobrazit uživatelské rozhraní pro přejmenování?
de: Wo sollte die Benutzeroberfläche zum Umbenennen angezeigt werden?
es: ¿Dónde se debe mostrar la interfaz de usuario de cambio de nombre?
fr: Où l’interface utilisateur de changement de nom doit-elle être affichée?
ko: 이름 바꾸기 UI는 어디에 표시되어야 하나요?
pt_br: Onde a interface do usuário de renomeação deve ser mostrada?
ru: Где следует показывать пользовательский интерфейс переименования?
tr: Yeniden adlandırma UI öğesi nerede gösterilmeli?

source: Whitespace
cs: Prázdné znaky
de: Leerstelle
es: Espacio en blanco
fr: Espaces blancs
ko: 공백
pl: Odstępy
pt_br: Espaço em branco
ru: Пустое пространство
tr: Boşluk
zh_hans: 空格
zh_hant: 空白

source: You must change the signature
cs: Je nutné změnit signaturu
de: Sie müssen die Signatur ändern.
es: Debe cambiar la firma
fr: Vous devez changer la signature
ja: 署名を変更する必要があります
ko: 시그니처를 변경해야 합니다.
pl: Musisz zmienić sygnaturę
pt_br: Você precisa alterar a assinatura
ru: Необходимо изменить подпись
tr: İmzayı değiştirmelisiniz
zh_hans: 必须更改签名
zh_hant: 您必須變更簽章

source: You must select at least one member.
cs: Musíte vybrat aspoň jednoho člena.
de: Sie müssen mindestens einen Member auswählen.
es: Debe seleccionar al menos un miembro.
fr: Vous devez sélectionner au moins un membre.
it: È necessario selezionare almeno un membro.
ja: 少なくとも 1 人のメンバーを選択する必要があります。
ko: 멤버를 하나 이상 선택해야 합니다.
pl: Musisz wybrać co najmniej jeden element członkowski.
pt_br: Você deve selecionar pelo menos um membro.
ru: Необходимо выбрать по крайней мере один элемент.
tr: En az bir üye seçmelisiniz.
zh_hans: 必须至少选择一个成员。
zh_hant: 您必須選取至少一個成員。

source: Illegal characters in path.
cs: Cesta obsahuje neplatné znaky.
de: Unzulässige Zeichen in Pfad.
es: Caracteres no válidos en la ruta de acceso.
fr: Caractères non autorisés dans le chemin.
it: Il percorso contiene caratteri non validi.
ja: パスに無効な文字があります。
ko: 경로에 잘못된 문자가 있습니다.
pl: Niedozwolone znaki w ścieżce.
pt_br: O caminho contém caracteres inválidos.
ru: Недопустимые символы в пути.
tr: Yolda geçersiz karakterler var.
zh_hans: 路径中存在非法字符。
zh_hant: 路徑中有不合法的字元。

source: File name must have the "{0}" extension.
cs: Název souboru musí mít příponu {0}.
de: Der Dateiname muss die Erweiterung "{0}" aufweisen.
es: El nombre de archivo debe tener la extensión "{0}".
fr: Le nom de fichier doit avoir l'extension "{0}".
it: Il nome file deve avere l'estensione "{0}".
ja: ファイル名には拡張子 "{0}" が必要です。
ko: 파일 이름에 "{0}" 확장이 있어야 합니다.
pl: Nazwa pliku musi mieć rozszerzenie „{0}”.
pt_br: O nome do arquivo deve ter a extensão "{0}".
ru: Файл должен иметь расширение "{0}".
tr: Dosya adı "{0}" uzantısını içermelidir.
zh_hans: 文件名必须具有“{0}”扩展。
zh_hant: 檔案名稱必須有 "{0}" 延伸模組。

source: Debugger
cs: Ladicí program
es: Depurador
fr: Débogueur
ja: デバッガー
ko: 디버거
pl: Debuger
pt_br: Depurador
ru: Отладчик
tr: Hata Ayıklayıcı
zh_hans: 调试程序
zh_hant: 偵錯工具

source: Determining breakpoint location...
cs: Určuje se umístění zarážky...
de: Haltepunktposition wird ermittelt...
es: Determinando la ubicación del punto de interrupción...
fr: Détermination de l'emplacement du point d'arrêt...
it: Determinazione della posizione del punto di interruzione...
ja: ブレークポイントの位置を特定しています...
ko: 중단점 위치를 확인하는 중...
pl: Trwa określanie lokalizacji punktu przerwania...
pt_br: Determinando a localização do ponto de interrupção...
ru: Определение положения точки останова...
tr: Kesme noktası konumu belirleniyor...
zh_hans: 正在确定断点位置...
zh_hant: 正在判定中斷點位置...

source: Determining autos...
cs: Určují se automatické fragmenty kódu...
de: Automatische Vorgänge werden ermittelt...
es: Determinando automático...
fr: Identification automatique...
it: Determinazione dei valori automatici...
ja: 自動変数を特定しています...
ko: 자동을 확인하는 중...
pl: Trwa określanie zmiennych automatycznych...
pt_br: Determinando autos...
ru: Определение видимых переменных...
tr: İfade ve değişkenler belirleniyor...
zh_hans: 正在确定自动窗口...
zh_hant: 正在判定自動呈現的程式碼片段...

source: Resolving breakpoint location...
cs: Vyhodnocuje se umístění zarážky...
de: Haltepunktposition wird aufgelöst...
es: Resolviendo la ubicación del punto de interrupción...
fr: Résolution de l'emplacement du point d'arrêt...
it: Risoluzione della posizione del punto di interruzione...
ja: ブレークポイントの位置を解決しています...
ko: 중단점 위치를 확인하는 중...
pl: Trwa rozpoznawanie lokalizacji punktu przerwania...
pt_br: Resolvendo a localização do ponto de interrupção...
ru: Разрешение положения точки останова...
tr: Kesme noktası konumu çözümleniyor...
zh_hans: 正在解析断点位置...
zh_hant: 正在解析中斷點位置...

source: Validating breakpoint location...
cs: Ověřuje se umístění zarážky...
de: Haltepunktposition wird validiert...
es: Validando la ubicación del punto de interrupción...
fr: Validation de l'emplacement du point d'arrêt...
it: Convalida della posizione del punto di interruzione...
ja: ブレークポイントの場所を検証しています...
ko: 중단점 위치를 확인하는 중...
pl: Trwa weryfikowanie lokalizacji punktu przerwania...
pt_br: Validando localização do ponto de interrupção...
ru: Проверка положения точки останова...
tr: Kesme noktası konumu doğrulanıyor...
zh_hans: 正在验证断点位置...
zh_hant: 正在驗證中斷點位置...

source: Getting DataTip text...
cs: Získává se text Datového tipu...
de: DataTip-Text abrufen...
es: Obteniendo texto de sugerencia de datos...
fr: Obtention du texte de DataTip...
it: Recupero del testo del suggerimento dati in corso...
ja: データヒント テキストを取得しています...
ko: DataTip 텍스트를 가져오는 중...
pl: Trwa pobieranie tekstu etykietki danych...
pt_br: Obtendo texto DataTip...
ru: Получение текста подсказки (DataTip) по данным...
tr: DataTip metni alınıyor...
zh_hans: 正在获取数据提示文本...
zh_hant: 正在取得資料提示文字...

source: Preview unavailable
cs: Náhled není k dispozici.
de: Vorschau nicht verfügbar.
es: Vista previa no disponible
fr: Aperçu non disponible
it: Anteprima non disponibile
ja: プレビューを利用できません
ko: 미리 보기를 사용할 수 없음
pl: Podgląd niedostępny
pt_br: Visualização não disponível
ru: Предпросмотр недоступен.
tr: Önizleme kullanılamıyor
zh_hans: 预览不可用
zh_hant: 無法使用預覽

source: Overrides
cs: Přepisuje
de: Überschreibungen
es: Invalidaciones
fr: Substitutions
it: Esegue l'override
ja: オーバーライド
ko: 재정의
pt_br: Substitui
ru: Переопределяет
tr: Geçersiz Kılan

source: Overridden By
cs: Přepsáno čím:
de: Überschrieben von
es: Invalidado por
fr: Remplacée par
it: Sottoposto a override da
ja: オーバーライド元
ko: 재정의 수행자
pt_br: Substituído por
ru: Переопределяется
tr: Geçersiz Kılınan

source: Inherits
cs: Dědí
de: Erbt
es: Hereda
fr: Hérite
it: Eredita
ja: 継承
ko: 상속
pt_br: Herda
ru: Наследует
tr: Devralınan

source: Inherited By
it: Ereditato da
ja: 継承先
ru: Наследуется

source: Implements
cs: Implementuje
de: Implementiert
es: Implementa
fr: Implémente
it: Implementa
ja: 実装
ko: 구현
pt_br: Implementos
ru: Реализует
tr: Uygulanan

source: Implemented By
cs: Implementoval:
de: Implementiert von
es: Implementado por
fr: Implémenté par
it: Implementato da
ja: 実装先
ko: 구현자
pt_br: Implementado por
ru: Реализуется
tr: Uygulayan

source: Maximum number of documents are open.
it: È stato aperto il numero massimo di documenti.
ja: 最大数のドキュメントが開いています。
ru: Открыто предельное число документов.

source: Failed to create document in miscellaneous files project.
it: Non è stato possibile creare il documento nel progetto di file esterni.
ja: その他のファイル プロジェクトにドキュメントを作成できませんでした。
ru: Не удалось создать документ в списке прочих файлов.

source: Invalid access.
cs: Neplatný přístup
de: Ungültiger Zugriff.
es: Acceso no válido.
fr: Accès non valide.
it: L'accesso non è valido.
ja: アクセスが無効です。
ko: 액세스가 잘못되었습니다.
pl: Nieprawidłowy dostęp.
pt_br: Acesso inválido.
ru: Недопустимый доступ.
tr: Geçersiz erişim.
zh_hans: 访问无效。
zh_hant: 存取無效。

source: The following references were not found. {0}Please locate and add them manually.
cs: Následující odkazy se nenašly. {0}Najděte nebo přidejte je prosím ručně.
de: Die folgenden Verweise wurden nicht gefunden. {0}Suchen Sie nach den Verweisen, und fügen Sie sie manuell hinzu.
es: No se encontraron las siguientes referencias. {0}Búsquelas y agréguelas manualmente.
fr: Les références suivantes sont introuvables. {0}Recherchez-les et ajoutez-les manuellement.
it: I riferimenti seguenti non sono stati trovati. {0}Individuarli e aggiungerli manualmente.
ja: 次の参照が見つかりませんでした。{0}これらを検索して手動で追加してください。
ko: 다음 참조를 찾지 못했습니다. {0}수동으로 찾아 추가하세요.
pl: Nie znaleziono następujących odwołań. {0}Znajdź je i dodaj ręcznie.
pt_br: As referências a seguir não foram encontradas. {0}Localize e adicione-as manualmente.
ru: Не найдены следующие ссылки. {0} Найдите и добавьте их вручную.
tr: Aşağıdaki başvurular bulunamadı. {0}Lütfen bu başvuruları el ile bulun ve ekleyin.
zh_hans: 找不到以下引用。{0}请手动查找并添加这些引用。
zh_hant: 找不到下列參考。{0}請找出這些參考並手動新增。

source: End position must be >= start position
cs: Konečná pozice musí být >= počáteční pozici.
de: Endposition muss >= Startposition sein
es: La posición final debe ser >= que la posición de inicio
fr: La position de fin doit être >= à la position de départ
it: La posizione finale deve essere maggiore o uguale alla posizione iniziale
ja: 終了位置は、開始位置以上の値にする必要があります
ko: 끝 위치는 시작 위치보다 크거나 같아야 합니다.
pl: Pozycja końcowa musi być większa lub równa pozycji początkowej
pt_br: A posição final deve ser >= posição inicial
ru: Конечное положение не должно быть меньше начального.
tr: Bitiş konumu, başlangıç konumuna eşit veya bundan sonra olmalıdır
zh_hans: 结束位置必须 >= 开始位置
zh_hant: 結束位置必須為 > = 開始位置

source: Not a valid value
cs: Není platnou hodnotou.
de: Kein gültiger Wert.
es: No es un valor válido
fr: Valeur non valide
it: Valore non valido
ja: 有効な値ではありません
ko: 값이 잘못되었습니다.
pl: Nieprawidłowa wartość
pt_br: O valor não é válido
ru: Недопустимое значение
tr: Geçerli bir değer değil
zh_hans: 值无效
zh_hant: 值無效

source: '{0}' is inherited
cs: {0} se dědí.
de: "{0}" wird geerbt.
es: "{0}" is heredado
fr: « {0} » est hérité
ko: '{0}'이(가) 상속되었습니다.
pl: Dziedziczone: „{0}”
pt_br: '{0}' é herdado
ru: "{0}" наследуется
tr: '{0}' devralındı
zh_hans: 已继承“{0}”
zh_hant: 已繼承 '{0}'

source: '{0}' will be changed to abstract.
cs: {0} se změní na abstraktní.
de: "{0}" wird in abstrakten Wert geändert.
es: "{0}" se cambiará a abstracto.
fr: '{0}' va être changé en valeur abstraite.
it: '{0}' verrà modificato in astratto.
ja: '{0}' は抽象に変更されます。
ko: '{0}'이(가) 추상으로 변경됩니다.
pl: Element „{0}” zostanie zmieniony na abstrakcyjny.
pt_br: '{0}' será alterado para abstrato.
ru: Элемент "{0}" будет изменен на абстрактный.
tr: '{0}' soyut olacak şekilde değiştirildi.
zh_hans: “{0}”将更改为“抽象”。
zh_hant: '{0}' 會變更為抽象。

source: '{0}' will be changed to non-static.
cs: {0} se změní na nestatický.
de: "{0}" wird in nicht statischen Wert geändert.
es: "{0}" se cambiará a no estático.
fr: '{0}' va être changé en valeur non statique.
it: '{0}' verrà modificato in non statico.
ja: '{0}' は非静的に変更されます。
ko: '{0}'이(가) 비정적으로 변경됩니다.
pl: Element „{0}” zostanie zmieniony na niestatyczny.
pt_br: '{0}' será alterado para não estático.
ru: Элемент "{0}" будет изменен на нестатический.
tr: '{0}' statik olmayacak şekilde değiştirildi.
zh_hans: “{0}”将更改为“非静态”。
zh_hant: '{0}' 會變更為非靜態。

source: '{0}' will be changed to public.
cs: {0} se změní na veřejný.
de: "{0}" wird in öffentlichen Wert geändert.
es: "{0}" se cambiará a público.
fr: '{0}' va être changé en valeur publique.
it: '{0}' verrà modificato in pubblico.
ja: '{0}' はパブリックに変更されます。
ko: '{0}'이(가) 공용으로 변경됩니다.
pl: Element „{0}” zostanie zmieniony na publiczny.
pt_br: '{0}' será alterado para público.
ru: Элемент "{0}" будет изменен на открытый.
tr: '{0}' ortak olacak şekilde değiştirildi.
zh_hans: “{0}”将更改为“公共”。
zh_hant: '{0}' 會變更為公用。

source: at the end of the line of code
cs: na konci řádku kódu
de: am Ende der Codezeile
es: al final de la línea de código
fr: à la fin de la ligne de code
ko: 코드 줄의 끝에
pl: na końcu wiersza kodu
pt_br: no final da linha de código
ru: в конце строки кода
tr: kod satırı sonunda
zh_hans: 在代码行的末尾
zh_hant: 在程式碼結尾

# generated_by_0_suffix
source: [generated by {0}]
cs: [vygenerováno pomocí {0}]
de: [generiert von "{0}"]
es: [generado por {0}]
fr: [généré par {0}]
ko: [{0}이(가) 생성함]
pl: [wygenerowane przez: {0}]
pt_br: [gerado por {0}]
ru: [создан генератором {0}]
tr: [{0} tarafından oluşturuldu]
zh_hans: [由 {0} 生成]
zh_hant: [由 {0} 產生]

# generated_suffix
source: [generated]
cs: [vygenerováno]
de: [generiert]
es: [generado]
fr: [généré]
ko: [생성됨]
pl: [wygenerowane]
pt_br: [gerado]
ru: [создан генератором]
tr: [oluşturuldu]
zh_hans: [已生成]
zh_hant: [已產生]

source: given workspace doesn't support undo
cs: Daný pracovní prostor nepodporuje vrácení akce zpátky.
de: Der angegebene Arbeitsbereich unterstützt die Funktion "Rückgängig" nicht.
es: el área de trabajo determinada no permite deshacer
fr: l'espace de travail donné ne prend pas en charge la fonction Annuler
it: l'area di lavoro specificata non supporta l'annullamento di operazioni
ja: 指定されたワークスペースは元に戻す操作をサポートしていません
ko: 지정한 작업 영역에서 실행을 취소할 수 없습니다.
pl: dany obszar roboczy nie obsługuje operacji cofania
pt_br: o workspace fornecido não dá suporte a desfazer
ru: заданная рабочая область не поддерживает отмену.
tr: sağlanan çalışma alanı, geri almayı desteklemiyor
zh_hans: 给定的工作区不支持撤消
zh_hant: 指定的工作區不支援復原

source: Add a reference to '{0}'
cs: Přidat odkaz do {0}
de: Verweis auf "{0}" hinzufügen
es: Agregar una referencia a "{0}"
fr: Ajouter une référence à '{0}'
it: Aggiungi un riferimento a '{0}'
ja: 参照を '{0}' に追加
ko: '{0}'에 참조 추가
pl: Dodaj odwołanie do elementu „{0}”
pt_br: Adicionar uma referência a '{0}'
ru: Добавить ссылку на "{0}"
tr: '{0}' öğesine başvuru ekleyin
zh_hans: 添加对“{0}”的引用
zh_hant: 將參考新增至 '{0}'

source: Event type is invalid
cs: Typ události není platný.
de: Der Ereignistyp ist ungültig.
es: El tipo de evento no es válido
fr: Type d'événement non valide
it: Il tipo di evento non è valido
ja: イベントの種類が無効です
ko: 이벤트 형식이 잘못되었습니다.
pl: Typ zdarzenia jest nieprawidłowy
pt_br: O tipo de evento é inválido
ru: Тип события недопустим.
tr: Olay türü geçersiz
zh_hans: 事件类型无效
zh_hant: 事件類型無效

source: Can't find where to insert member
cs: Nejde zjistit místo, kam se má vložit člen.
de: Position zum Einfügen des Members nicht gefunden.
es: No se puede encontrar un lugar para insertar el miembro
fr: Emplacement introuvable pour insérer le membre
it: Non è stato trovato il punto in cui inserire il membro
ja: メンバーを挿入する場所を見つけることができません
ko: 멤버를 삽입할 위치를 찾을 수 없습니다.
pl: Nie można znaleźć miejsca do wstawienia składowej
pt_br: Não é possível encontrar onde inserir o membro
ru: Не удается найти место вставки элемента.
tr: Üyenin ekleneceği konum bulunamıyor
zh_hans: 无法找到插入成员的位置
zh_hant: 找不到插入成員的位置

source: Can't rename 'other' elements
cs: Elementy other nejde přejmenovat.
de: Umbenennen von other-Elementen nicht möglich.
es: No se puede cambiar el nombre de los elementos "otro"
fr: Impossible de renommer les éléments 'other'
it: Non è possibile rinominare elementi 'other'
ja: other' 要素の名前は変更できません
ko: other' 요소의 이름을 바꿀 수 없습니다.
pl: Nie można zmienić nazwy elementów „other”
pt_br: Não é possível renomear 'outros' elementos
ru: Не удается переименовать элементы "other".
tr: other' öğeleri yeniden adlandırılamıyor
zh_hans: 无法重命名 "other" 元素
zh_hant: 無法為 'other' 元素重新命名

source: Unknown rename type
cs: Neznámý typ přejmenování
de: Unbekannter Umbenennungstyp.
es: Tipo de cambio de nombre desconocido
fr: Type renommé inconnu
it: Tipo di ridenominazione sconosciuto
ja: 名前変更の型が不明です
ko: 알 수 없는 이름 바꾸기 형식
pl: Nieznany typ zmiany nazwy
pt_br: Tipo de renomeação desconhecido
ru: Неизвестный тип переименования
tr: Bilinmeyen yeniden adlandırma türü
zh_hans: 重命名类型未知
zh_hant: 未知的重新命名類型

source: IDs are not supported for this symbol type.
cs: ID se pro tento typ symbolu nepodporují.
de: IDs werden für diesen Symboltyp nicht unterstützt.
es: Los identificadores no son compatibles con este tipo de símbolo.
fr: Les ID ne sont pas pris en charge pour ce type de symbole.
it: Gli ID non sono supportati per questo tipo di simbolo.
ja: ID は、このシンボルの種類ではサポートされていません。
ko: 이 기호 형식에 대한 ID가 지원되지 않습니다.
pl: Identyfikatory są nieobsługiwane w przypadku tego typu symbolu.
pt_br: Este tipo de símbolo não dá suporte a IDs.
ru: Идентификаторы не поддерживаются для данного типа символов.
tr: Bu sembol türü için kimlikler desteklenmiyor.
zh_hans: 此符号类型不支持 ID。
zh_hant: 此符號類型不支援識別碼。

# Can_t_create_a_node_id_for_this_symbol_kind_colon_0
source: Can't create a node id for this symbol kind: '{0}'
cs: Pro tento druh symbolu nejde vytvořit ID uzlu: {0}
de: Für diese Symbolart kann keine Knoten-ID erstellt werden: "{0}"
es: No se puede crear un identificador de nodo para el tipo de símbolo: "{0}"
fr: Impossible de créer un ID de nœud pour ce genre de symbole : '{0}'
it: Non è possibile creare un ID nodo per questo tipo di simbolo: '{0}'
ja: このシンボルの種類のノード ID を作成することはできません: '{0}'
ko: '{0}' 기호 종류에 대한 노드 ID를 만들 수 없습니다.
pl: Nie można utworzyć identyfikatora węzła dla tego rodzaju symbolu: „{0}”
pt_br: Não é possível criar uma ID de nó para esse tipo de símbolo: '{0}'
ru: Не удается создать идентификатор узла для этого вида символов: "{0}".
tr: '{0}' sembol türü için düğüm kimliği oluşturulamıyor
zh_hans: 无法为此符号种类创建节点 ID:“{0}”
zh_hant: 無法建立此符號種類的節點識別碼: '{0}'

source: Project References
cs: Odkazy projektu
de: Projektverweise
es: Referencias del proyecto
fr: Références du projet
it: Riferimenti al progetto
ja: プロジェクトの参照
ko: 프로젝트 참조
pl: Odwołania projektu
pt_br: Referências do Projeto
ru: Ссылки проекта
tr: Proje Başvuruları
zh_hans: 项目引用
zh_hant: 專案參考

source: Base Types
cs: Základní typy
de: Basistypen
es: Tipos base
fr: Types de base
it: Tipi di base
ja: 基本型
ko: 기본 형식
pl: Typy podstawowe
pt_br: Tipos Base
ru: Базовые типы
tr: Temel Türler
zh_hans: 基类型
zh_hant: 基底類型

source: Could not find project '{0}'
cs: Projekt {0} nešlo najít.
de: Das Projekt "{0}" wurde nicht gefunden.
es: No se pudo encontrar el proyecto "{0}"
fr: Projet '{0}' introuvable
it: Il progetto '{0}' non è stato trovato.
ja: プロジェクト '{0}' が見つかりませんでした
ko: '{0}' 프로젝트를 찾을 수 없습니다.
pl: Nie można odnaleźć projektu „{0}”
pt_br: Não foi possível encontrar o projeto '{0}'
ru: Не удалось найти проект "{0}".
tr: '{0}' adlı proje bulunamadı
zh_hans: 无法找到项目“{0}”
zh_hant: 找不到專案 '{0}'

source: Could not find location of folder on disk
cs: Nepovedlo se najít umístění složky na disku.
de: Speicherort des Ordners wurde nicht auf dem Datenträger gefunden.
es: No se pudo encontrar la ubicación de la carpeta en el disco
fr: Emplacement introuvable du dossier sur le disque
it: Il percorso della cartella nel disco non è stato trovato
ja: ディスクにフォルダーの場所が見つかりませんでした
ko: 디스크에서 폴더의 위치를 찾을 수 없습니다.
pl: Nie można odnaleźć lokalizacji folderu na dysku
pt_br: Não foi possível encontrar o local da pasta no disco
ru: Не удалось найти путь к папке на диске.
tr: Diskte klasörün konumu bulunamadı
zh_hans: 无法在磁盘上找到文件夹的位置
zh_hant: 在磁碟上找不到資料夾的位置

source: Assembly
cs: Sestavení
es: Ensamblado
ja: アセンブリ
ko: 어셈블리
pl: Zestaw
ru: Сборка
tr: Bütünleştirilmiş Kod
zh_hans: 程序集
zh_hant: 組件

# Exceptions_colon
source: Exceptions:
cs: Výjimky:
de: Ausnahmen:
es: Excepciones:
it: Eccezioni:
ja: 例外:
ko: 예외:
pt_br: Exceções:
ru: Исключения:
tr: Özel Durumlar:

source: Member of {0}
cs: Člen v {0}
de: Member von "{0}"
es: Miembro de {0}
fr: Membre de {0}
it: Membro di {0}
ja: {0} のメンバー
ko: {0}의 멤버
pl: Składowa {0}
pt_br: Membro de {0}
ru: Элемент объекта {0}
tr: {0} üyesi
zh_hans: {0} 的成员
zh_hant: {0} 的成員

# Parameters_colon1
source: Parameters:
cs: Parametry:
de: Parameter:
es: Parámetros:
fr: Paramètres :
it: Parametri:
ja: パラメーター:
ko: 매개 변수:
pt_br: Parâmetros:
ru: Параметры:
tr: Parametreler:

source: Project
cs: Projekt
de: Projekt
es: Proyecto
fr: Projet
it: Progetto
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: Proje
zh_hans: 项目
zh_hant: 專案

# Remarks_colon
source: Remarks:
cs: Poznámky:
de: Hinweise:
es: Comentarios:
fr: Notes :
it: Commenti:
ja: コメント:
ko: 설명:
pt_br: Comentários:
ru: Примечания.
tr: Açıklamalar:

# Returns_colon
source: Returns:
cs: Vrácení:
de: Rückgabewerte:
es: Devuelve:
fr: Retourne :
it: Valori restituiti:
ja: 戻り値:
ko: 반환 값:
pt_br: Devoluções:
ru: Возврат:
tr: Döndürülenler:

# Summary_colon
source: Summary:
cs: Souhrn:
de: Zusammenfassung:
es: Resumen:
fr: Résumé :
it: Riepilogo:
ja: 概要:
ko: 요약:
pt_br: Resumo:
ru: Сводка:
tr: Özet:
