Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Derived types
cs: Odvozené typy
de: Abgeleitete Typen
es: Tipos derivados
fr: Types dérivés
ko: 파생 형식
pl: Typy pochodne
pt_br: Tipos derivados
ru: Производные типы
tr: Türetilmiş türler
zh_hans: 派生类型
zh_hant: 衍生類型

source: Disabled
cs: Zakázáno
de: Deaktiviert
es: Deshabilitado
fr: Désactivé
ko: 사용 안 함
pl: Wyłączone
pt_br: Desabilitado
ru: Отключено
tr: Devre dışı
zh_hans: 已禁用
zh_hant: 已停用

source: Display all hints while pressing Alt+F1
cs: Při podržení kláves Alt+F1 zobrazit všechny nápovědy
de: Alle Hinweise beim Drücken von ALT+F1 anzeigen
es: Mostrar todas las sugerencias al presionar Alt+F1
fr: Afficher tous les indicateurs en appuyant sur Alt+F1
ko: Alt+F1을 누른 채 모든 힌트 표시
pl: Wyświetl wszystkie wskazówki po naciśnięciu klawiszy Alt+F1
pt_br: Exibir todas as dicas ao pressionar Alt+F1
ru: Отображать все подсказки при нажатии клавиш ALT+F1
tr: Alt+F1 tuşlarına basılırken tüm ipuçlarını görüntüle
zh_hans: 按 Alt+F1 时显示所有提示
zh_hant: 按 Alt+F1 時顯示所有提示

source: Display diagnostics inline (experimental)
cs: Zobrazit vloženou diagnostiku (experimentální)
de: Diagnose inline anzeigen (experimentell)
es: Mostrar diagnósticos incorporados (experimental)
fr: Afficher les diagnostics en ligne (expérimental)
ko: 진단 인라인 표시(실험적)
pt_br: Exibir diagnósticos em linha (experimental)
ru: Отображать встроенную диагностику (экспериментальная функция)
tr: Tanılamayı satır içi görüntüle (deneysel)

source: Disp_lay inline parameter name hints
cs: Zobrazovat nápovědy k názvům v_ložených parametrů
de: Hinweise zu In_lineparameternamen anzeigen
es: _Mostrar sugerencias de nombre de parámetro insertadas
fr: Affic_her les indicateurs de noms de paramètres inline
ko: 인라인 매개 변수 이름 힌트 표시(_L)
pl: Wyś_wietl wskazówki w tekście dla nazw parametrów
pt_br: Exi_bir as dicas embutidas de nome de parâmetro
ru: Отображать п_одсказки для имен встроенных параметров
tr: Satır içi parametre adı ipuç_larını göster
zh_hans: 显示内联参数名称提示(_L)
zh_hant: 顯示內嵌參數名稱提示(_L)

source: Display inline type hints
cs: Zobrazovat vložené nápovědy k typům
de: Inlinetyphinweise anzeigen
es: Mostrar sugerencias de tipo insertado
fr: Afficher les indicateurs de type inline
ko: 인라인 유형 힌트 표시
pl: Wyświetl wskazówki w tekście dla typów
pt_br: Exibir as dicas embutidas de tipo
ru: Отображать подсказки для встроенных типов
tr: Satır içi tür ipuçlarını göster
zh_hans: 显示内联类型提示
zh_hant: 顯示內嵌類型提示

source: Document Outline
cs: Osnova dokumentu
de: Dokumentgliederung
es: Esquema del documento
fr: Structure du document
ko: 문서 개요
pl: Konspekt dokumentu
pt_br: Estrutura de Tópicos do Documento
ru: Структура документа
tr: Belge Ana Hattı
zh_hans: 文档大纲
zh_hant: 文件大綱

# Document_Outline_Search
source: Search Document Outline
cs: Prohledat osnovu dokumentu
de: Dokumentgliederung durchsuchen
es: Esquema del documento de búsqueda
fr: Rechercher dans le plan du document
ko: 문서 개요 검색
pl: Przeszukaj konspekt dokumentu
pt_br: Estrutura de Tópicos do Documento de Pesquisa
ru: Поиск структуры документа
tr: Belge Ana Hattını Ara
zh_hans: 搜索文档大纲
zh_hant: 搜尋檔大綱

source: _Edit
cs: _Upravit
de: _Bearbeiten
es: _Editar
fr: _Modifier
ja: 編集(_E)
ko: 편집(_E)
pl: _Edytuj
pt_br: _Editar
ru: _Изменить
tr: _Düzenle
zh_hans: 编辑(_E)
zh_hant: 編輯(_E)

source: Edit {0}
ja: {0} の編集
ru: Изменить {0}

source: Editor Color Scheme
cs: Barevné schéma editoru
de: Editor-Farbschema
es: Combinación de colores del editor
fr: Modèle de couleurs de l'éditeur
ja: エディターの配色
ko: 편집기 색 구성표
pt_br: Esquema de Cores do Editor
ru: Цветовая схема редактора
tr: Düzenleyici Renk Düzeni

source: Editor color scheme options are only available when using a color theme bundled with Visual Studio. The color theme can be configured from the Environment > General options page.
cs: Možnosti barevného schématu editoru jsou k dispozici jen v případě, že se používá barva motivu dodávaná spolu se sadou Visual Studio. Barva motivu se dá nakonfigurovat na stránce možností Prostředí > Obecné.
de: Optionen für das Editor-Farbschema sind nur bei Verwendung eines im Lieferumfang von Visual Studio enthaltenen Farbdesigns verfügbar. Das Farbdesign kann über die Seite "Umgebung" > "Allgemeine Optionen" konfiguriert werden.
es: Las opciones de combinación de colores del editor solo están disponibles cuando se usa un tema de color incluido con Visual Studio. Dicho tema se puede configurar desde la página de Entorno > Opciones generales.
fr: Les options relatives au modèle de couleurs de l'éditeur sont disponibles uniquement quand vous utilisez un thème de couleur fourni en bundle avec Visual Studio. Vous pouvez configurer le thème de couleur à partir de la page d'options Environnement > Général.
ja: エディターの配色オプションは、Visual Studio にバンドルされている配色テーマを使用している場合にのみ使用できます。配色テーマは、[環境] > [全般] オプション ページで構成できます。
ko: 편집기 색 구성표 옵션은 Visual Studio와 함께 제공되는 색 테마를 사용하는 경우에만 사용할 수 있습니다. 색 테마는 [환경] > [일반] 옵션 페이지에서 구성할 수 있습니다.
pt_br: As opções do esquema de cores do editor estão disponíveis somente ao usar um tema de cores agrupado com Visual Studio. O tema de cores pode ser configurado na página Ambiente > Opções gerais.
ru: Параметры цветовой схемы редактора доступны только при использовании цветовой темы, поставляемой вместе с Visual Studio. Цветовую тему можно настроить на странице "Среда" > "Общие параметры".
tr: Düzenleyici renk düzeni seçenekleri yalnızca Visual Studio ile paketlenmiş bir renk teması ile birlikte kullanılabilir. Renk teması, Ortam > Genel seçenekler sayfasından yapılandırılabilir.

source: Element is not valid.
cs: Element není platný.
de: Das Element ist ungültig.
es: El elemento no es válido.
fr: L'élément n'est pas valide.
it: L'elemento non è valido.
ja: 要素が有効ではありません。
ko: 요소가 잘못되었습니다.
pl: Element jest nieprawidłowy.
pt_br: O elemento é inválido.
ru: Элемент недопустим.
tr: Öğe geçerli değil.
zh_hans: 元素无效。
zh_hant: 元素無效。

source: Enable Razor 'pull' diagnostics (experimental, requires restart)
ru: Включить диагностику "pull" Razor (экспериментальная функция, требуется перезапуск)

source: Enable all features in opened files from source generators (experimental)
ru: Включить все функции в открытых файлах из генераторов источника (экспериментальная версия)

source: Enable document outline (experimental, requires restart)
cs: Povolit osnovu dokumentu (experimentální, vyžaduje restartování)
de: Dokumentgliederung aktivieren (experimentell, Neustart erforderlich)
es: Habilitar esquema de documento (experimental, requiere reinicio)
fr: Activer le plan du document (expérimental, nécessite un redémarrage)
ko: 문서 개요 사용(실험적, 다시 시작해야 함)
pt_br: Habilitar resumo do documento (experimental, requer reinicialização)
ru: Включить структуру документа (экспериментальная функция, требуется перезапуск)
tr: Belge ana hattını etkinleştir (deneysel, yeniden başlatma gerektirir)

# Enable_file_logging_for_diagnostics
source: Enable file logging for diagnostics (logged in '%Temp%\Roslyn' folder)
cs: Povolit protokolování souboru pro diagnostiku (protokolování ve složce '%Temp%\Roslyn')
de: Dateiprotokollierung für Diagnose aktivieren (protokolliert im Ordner "%Temp%\Roslyn")
es: Habilitar registro de archivos para el diagnóstico (registrados en la carpeta "%Temp%\Roslyn")
fr: Activer la journalisation des fichiers pour les Diagnostics (connexion au dossier « %Temp% \Roslyn »)
ko: 진단용 파일 로깅 사용('%Temp%\Roslyn' 폴더에 로그인)
pl: Włącz rejestrowanie plików w celach diagnostycznych (rejestrowane w folderze „%Temp%\Roslyn”)
pt_br: Habilite o registro de arquivos para diagnósticos (logado na pasta '%Temp%\Roslyn')
ru: Включить ведение журнала файлов для диагностики (в папке "%Temp%\Roslyn")
tr: Tanılama için dosya günlüğünü etkinleştir (oturum açan '%Temp%\Roslyn' klasörü)
zh_hans: 为诊断启用文件日志记录(记录在“%Temp%\Roslyn”文件夹中)
zh_hant: 啟用診斷的檔案記錄 (在 '%Temp%\Roslyn' 資料夾中記錄)

source: Enable navigation to Source Link and Embedded sources
cs: Povolit navigaci ke zdrojovým odkazům a vloženým zdrojům
de: Aktivieren der Navigation zu Source Links und eingebetteten Quellen
es: Habilitar la navegación a Source Link y orígenes incrustados
fr: Activer la navigation vers les sources Source Link et incorporées
ko: Source Link 및 포함된 소스 탐색 사용
pl: Włącz nawigację do źródeł linków źródłowych i osadzonych
pt_br: Habilitar a navegação para o Source Link e Fontes incorporadas
ru: Включить навигацию для ссылки на источник и внедренных источников
tr: Source Link ve Embedded kaynaklarda gezinmeyi etkinleştir
zh_hans: 启用对源链接和嵌入源的导航
zh_hant: 啟用瀏覽至 Source Link 和內嵌來源

source: Enable 'pull' diagnostics (experimental, requires restart)
ru: Включить диагностику "pull" (экспериментальная функция, требуется перезапуск)

source: Enabled
cs: Povoleno
de: Aktiviert
es: Habilitado
fr: Activé
ko: 사용
pl: Włączone
pt_br: Habilitado
ru: Включено
tr: Etkin
zh_hans: 已启用
zh_hant: 已啟用

source: End of line
cs: Konec řádku
de: Zeilenende
es: Final de línea
fr: Fin de ligne
ko: 줄의 끝
pl: Koniec wiersza
pt_br: Fim da linha
ru: Конец строки
tr: Satır sonu
zh_hans: 行尾
zh_hant: 行結尾

source: Enter a call site value or choose a different value injection kind
cs: Zadejte hodnotu místa volání, nebo zvolte jiný druh vložení hodnoty.
de: Geben Sie einen Aufrufsitewert ein, oder wählen Sie eine andere Art der Werteingabe aus.
es: Escriba un valor de sitio de llamada o elija otro tipo de inserción de valor.
fr: Entrer une valeur de site d'appel ou choisir un autre type d'injection de valeur
ja: 呼び出しサイトの値を入力するか、別の値の挿入の種類を選択してください
ko: 호출 사이트 값을 입력하거나 다른 값 삽입 종류를 선택하세요.
pl: Wprowadź wartość lokalizacji wywołania lub wybierz inny rodzaj iniekcji wartości
pt_br: Insira um valor de site de chamada ou escolha um tipo de injeção de valor diferente
ru: Введите значение места вызова или выберите другой тип введения значения
tr: Bir çağrı sitesi değeri girin veya farklı bir değer yerleştirme tipi seçin
zh_hans: 输入调用站点值或选择其他值注入类型
zh_hant: 請輸入呼叫位置值，或選擇其他值插入種類

source: Entire repository
cs: Celé úložiště
de: Gesamtes Repository
es: Todo el repositorio
fr: Dépôt entier
ja: リポジトリ全体
ko: 전체 리포지토리
pl: Całe repozytorium
pt_br: Repositório inteiro
ru: Весь репозиторий
tr: Tüm depo
zh_hans: 整个存储库
zh_hant: 整個存放庫

source: Entire solution
cs: Celé řešení
de: Gesamte Projektmappe
es: Toda la solución
fr: Solution complète
ja: ソリューション全体
ko: 전체 솔루션
pl: Całe rozwiązanie
pt_br: Solução Inteira
ru: Все решение
tr: Tüm çözüm
zh_hans: 整个解决方案
zh_hant: 整個解決方案

source: Entire Solution and External Sources
cs: Celé řešení a externí zdroje
de: Gesamte Projektmappe und externe Quellen
es: Solución completa y orígenes externos
fr: Solution entière et sources externes
ko: 전체 솔루션 및 외부 원본
pl: Całe rozwiązanie i źródła zewnętrzne
pt_br: Solução Inteira e Fontes Externas
ru: Все решение и внешние источники
tr: Tam Çözüm ve Dış Kaynaklar
zh_hans: 整个解决方案和外部源
zh_hant: 整個解決方案與外部來源

source: Error
cs: Chyba
de: Fehler
fr: Erreur
ko: 오류
pt_br: Erro
ru: Ошибка
tr: Hata

source: Error updating suppressions: {0}
cs: Chyba při aktualizaci potlačení: {0}
de: Fehler bei der Aktualisierung von Unterdrückungen: {0}
es: Actualización de errores de forma periódica: {0}
fr: Erreur lors de la mise à jour des suppressions : {0}
ko: 표시 중지를 업데이트하는 동안 오류가 발생했습니다. {0}
pl: Błąd podczas pomijania aktualizacji: {0}
pt_br: Erro ao atualizar supressões: {0}
ru: Ошибка при обновлении подавлений: {0}
tr: Gizlemeler güncellenirken hata oluştu: {0}
zh_hans: 更新抑制时出现错误: {0}
zh_hant: 更新歸併時發生錯誤: {0}

source: Evaluating ({0} tasks in queue)
it: In fase di valutazione ({0} attività in coda)
ja: 評価中 ({0} 個のタスクがキューにあります)
ru: Оценка (задач в очереди: {0})

source: External Sources
cs: Externí zdroje
de: Externe Quellen
es: Orígenes externos
fr: Sources externes
ko: 외부 원본
pl: Źródła zewnętrzne
pt_br: Fontes Externas
ru: Внешние источники
tr: Dış Kaynaklar
zh_hans: 外部源
zh_hant: 外部來源

source: Extract Base Class
cs: Extrahovat základní třídu
de: Basisklasse extrahieren
es: Extraer clase base
fr: Extraire la classe de base
ko: 기본 클래스 추출
pl: Wyodrębnij klasę bazową
pt_br: Extrair a Classe Base
ru: Извлечь базовый класс
tr: Temel Sınıfı Ayıkla
zh_hans: 提取基类
zh_hant: 擷取基底類別

source: Extract Base Record
cs: Extrahovat základní Record
de: Base Record extrahieren
es: Extraer Record base
fr: Extraire le Record de base
ko: 기본 Record 추출
pl: Wyodrębnij Record Podstawowy
pt_br: Extrair Record Base
ru: Извлечь базовый объект Record
tr: Temel Record Öğesini Ayıkla
zh_hans: 提取基本 Record
zh_hant: 擷取基底 Record

source: Finish
cs: Dokončit
de: Beenden
es: Finalizar
fr: Terminer
it: Fine
ja: 終了
ko: 마침
pl: Zakończ
pt_br: Concluir
ru: Готово
tr: Son
zh_hans: 完成
zh_hant: 完成

source: Fix text pasted into string literals (experimental)
cs: Opravit text vložený do řetězcových literálů (experimentální)
de: Korrigieren von Text, der in Zeichenfolgenliterale eingefügt wurde (experimentell)
es: Corregir texto pegado en literales de cadena (experimental)
fr: Corriger le texte collé dans des littéraux de chaîne (expérimental)
ko: 문자열 리터럴에 붙여넣은 텍스트 수정(실험)
pt_br: Corrigir texto colado em cadeia de caracteres literais (experimental)
ru: Исправлять текст, вставляемый в строковые литералы (экспериментальная функция)
tr: Sabit değerli dizelere yapıştırılan metni düzelt (deneysel)

source: Fix analyzer warnings and errors
cs: Opravit varování a chyby analyzátoru
de: Warnungen und Fehler des Analysegeräts beheben
es: Corregir errores y advertencias del analizador
fr: Corriger les erreurs et les avertissements de l’analyseur
ko: 분석기 경고 및 오류 수정
pl: Naprawianie ostrzeżeń i błędów analizatora
pt_br: Corrigir avisos e erros do analisador
ru: Исправить предупреждения и ошибки анализатора
tr: Çözümleyici uyarılarını ve hatalarını düzeltin
zh_hans: 修复分析器警告和错误
zh_hant: 修正分析器警告與錯誤

source: Fix all warnings and errors set in EditorConfig
cs: Opravit všechna varování a chyby nastavené v EditorConfig
de: Beheben Sie alle in EditorConfig festgelegten Warnungen und Fehler
es: Corregir todas las advertencias y errores establecidos en EditorConfig
fr: Corriger tous les avertissements et erreurs définis dans EditorConfig
ko: EditorConfig에 설정된 모든 경고 및 오류 수정
pl: Naprawianie wszystkich ostrzeżeń i błędów ustawionych w elemencie EditorConfig
pt_br: Corrigir todos os avisos e erros definidos no EditorConfig
ru: Исправить все предупреждения и ошибки, заданные в EditorConfig
tr: EditorConfig içinde ayarlanmış tüm uyarıları ve hataları düzeltin
zh_hans: 修复 EditorConfig 中设置的所有警告和错误
zh_hant: 修正 EditorConfig 中設定的所有警告與錯誤

source: Fix analyzer warnings and errors set in EditorConfig
cs: Opravit varování a chyby analyzátoru nastavené v EditorConfig
de: Warnungen und Fehler des Analysegeräts beheben, die in EditorConfig festgelegt wurden
es: Corregir las advertencias y errores del analizador establecidos en EditorConfig
fr: Corriger les avertissements et les erreurs définis par l’analyseur dans EditorConfig
ko: EditorConfig에 설정된 분석기 경고 및 오류 수정
pl: Naprawianie ostrzeżeń i błędów analizatora ustawionych w elemencie EditorConfig
pt_br: Corrigir avisos e erros do analisador definidos em EditorConfig
ru: Исправить предупреждения и ошибки анализатора, заданные в EditorConfig
tr: EditorConfig içinde ayarlanmış çözümleyici uyarılarını ve hatalarını düzeltin
zh_hans: 修复 EditorConfig 中设置的分析器警告和错误
zh_hant: 修正 EditorConfig 中設定的分析器警告與錯誤

source: For non interface members
cs: Pro členy mimo rozhraní
de: Für Nichtschnittstellenmember
es: Para miembros que no son de interfaz
fr: Pour les membres non d’interface
ko: 비 인터페이스 멤버의 경우
pl: Dla elementów innych niż składowe interfejsu
pt_br: Para membros sem interface
ru: Для элементов без интерфейса
tr: Arabirim olmayan üyeler için
zh_hans: 对于非接口成员
zh_hant: 對於非介面成員

source: Format document
cs: Formátovat dokument
de: Dokument formatieren
es: Dar formato al documento
fr: Mettre en forme le document
ko: 문서 서식
pl: Formatuj dokument
pt_br: Formatar o documento
ru: Форматировать документ
tr: Belgeyi biçimlendir
zh_hans: 设置文档的格式
zh_hant: 格式化文件

# Generate_dot_editorconfig_file_from_settings
source: Generate .editorconfig file from settings
cs: Generovat soubor .editorconfig z nastavení
de: EDITORCONFIG-Datei aus Einstellungen generieren
es: Generar archivo .editorconfig a partir de la configuración
fr: Générer le fichier .editorconfig à partir des paramètres
it: Genera file con estensione editorconfig dalle impostazioni
ja: 設定から .editorconfig ファイルを生成
ko: 설정에서 .editorconfig 파일 생성
pl: Wygeneruj plik .editorconfig na podstawie ustawień
pt_br: Gerar o arquivo .editorconfig das configurações
ru: Создать файл EDITORCONFIG на основе параметров
tr: Ayarlardan .editorconfig dosyası oluştur
zh_hans: 基于设置生成 .editorconfig 文件
zh_hant: 從設定產生 .editorconfig 檔案

source: Go To Definition
cs: Přejít k definici
de: Zu Definition wechseln
es: Ir a definición
fr: Accéder à la définition
ko: 정의로 이동
pl: Przejdź do definicji
pt_br: Ir para Definição
ru: Перейти к определению
tr: Tanıma Git
zh_hans: 转到定义
zh_hant: 移至定義

source: Highlight related components under cursor
cs: Zvýrazňovat související komponenty pod kurzorem
de: Zugehörige Komponenten unter dem Cursor markieren
es: Resaltar componentes relacionados bajo el cursor
fr: Surligner les composants liés sous le curseur
it: Evidenzia i componenti correlati sotto il cursore
ja: カーソルの下にある関連コンポーネントをハイライトする
ko: 커서 아래의 관련 구성 요소 강조
pl: Wyróżnij powiązane składniki pod kursorem
pt_br: Realçar componentes relacionados usando o cursor
ru: Выделить связанные компоненты под курсором
tr: İmlecin altında ilgili bileşenleri vurgula
zh_hans: 突出显示光标下的相关组件
zh_hant: 反白資料指標下的相關元件

source: Id
pl: Identyfikator
ru: ИД
tr: Kimlik
zh_hant: 識別碼

source: Implemented interfaces
cs: Implementovaná rozhraní
de: Implementierte Schnittstellen
es: Interfaces implementadas
fr: Interfaces implémentées
ko: 구현된 인터페이스
pl: Wdrożone interfejsy
pt_br: Interfaces implementadas
ru: Реализованные интерфейсы
tr: Uygulanan arabirimler
zh_hans: 实现的接口
zh_hant: 已實作的介面

source: Implemented members
cs: Implementovaní členové
de: Implementierte Member
es: Miembros implementados
fr: Membres implémentés
ko: 구현된 구성원
pl: Zaimplementowane składowe
pt_br: Membros implementados
ru: Реализованные элементы
tr: Uygulanan üyeler
zh_hans: 实现的成员
zh_hant: 已實作的成員

source: Implementing members
cs: Implementace členů
de: Member werden implementiert.
es: Implementando miembros
fr: Implémentation des membres
ko: 구성원을 구현하는 중
pl: Implementowanie składowych
pt_br: Implementando membros
ru: Реализация элементов
tr: Üyeleri uygulama
zh_hans: 正在实现成员
zh_hant: 實作成員

source: Implementing types
cs: Implementace typů
de: Typen werden implementiert
es: Tipos de implementación
fr: Types d’implémentation
ko: 구현 형식
pl: Typy wdrażania
pt_br: Tipos de implementação
ru: Реализующие типы
tr: Uygulama türleri
zh_hans: 正在实现类型
zh_hant: 正在實作類型

source: In other operators
cs: V jiných operátorech
de: In anderen Operatoren
es: En otros operadores
fr: Dans les autres opérateurs
it: In altri operatori
ja: その他の演算子内で
ko: 기타 연산자
pl: W innych operatorach
pt_br: Em outros operadores
ru: В других операторах
tr: Diğer işleçlerde
zh_hans: 在其他运算符中
zh_hant: 其他運算子中

source: Include global imports
cs: Zahrnout globální importy
de: Globale Importe einschließen
es: Incluir importaciones globales
fr: Inclure les importations globales
ko: 전역 가져오기 포함
pl: Uwzględnij globalne importy
pt_br: Incluir as importações globais
ru: Включить глобальные директивы import
tr: Genel içeri aktarmaları dahil et
zh_hans: 包括全局导入
zh_hant: 包含全域匯入

source: Index
es: Índice
ja: インデックス
ko: 인덱스
pl: Indeks
pt_br: Índice
ru: Индекс
tr: Dizin
zh_hans: 索引
zh_hant: 索引

source: Infer from context
cs: Odvodit z kontextu
de: Aus Kontext ableiten
es: Inferir del contexto
fr: Déduire à partir du contexte
ja: コンテキストから推論する
ko: 컨텍스트에서 유추
pl: Wnioskuj z kontekstu
pt_br: Inferir do contexto
ru: Вывести из контекста
tr: Bağlamdan çıkarsa
zh_hans: 从上下文推断
zh_hant: 從內容推斷

source: Indexed in organization
ja: 組織内でインデックス付け
ru: Индексированный в организации

source: Indexed in repo
ja: リポジトリ内でインデックス付け
ru: Индексированный в репозитории

source: Inheritance Margin
cs: Míra dědičnosti
de: Vererbungsrand
es: Margen de herencia
fr: Marge d’héritage
ko: 상속 여백
pl: Margines dziedziczenia
pt_br: Margem de herança
ru: Поле наследования
tr: Devralma Boşluğu
zh_hans: 继承边距
zh_hant: 繼承邊界

source: Inherited interfaces
cs: Zděděná rozhraní
de: Geerbte Schnittstelle
es: Interfaces heredadas
fr: Interfaces héritées
ko: 상속된 인터페이스
pl: Dziedziczone interfejsy
pt_br: Interfaces herdadas
ru: Унаследованные интерфейсы
tr: Devralınan arabirimler
zh_hans: 继承的接口
zh_hant: 繼承介面

source: Inline Diagnostics (experimental)
ru: Встроенная диагностика (экспериментальная функция)

source: Inline Hints
cs: Vložené nápovědy
de: Inlinehinweise
es: Sugerencias insertadas
fr: Indicateurs inline
ko: 인라인 힌트
pt_br: Dicas Embutidas
ru: Встроенные подсказки
tr: Satır İçi İpuçları

source: Inserting call site value '{0}'
cs: Vkládá se hodnota lokality volání {0}.
de: Der Wert der Aufrufsite "{0}" wird eingefügt.
es: Insertando el valor del sitio de llamada "{0}"
fr: Insertion de la valeur de site d'appel '{0}'
ja: 呼び出しサイトの値 "{0}" を挿入しています
ko: 호출 사이트 값 '{0}'을(를) 삽입하는 중
pl: Wstawianie wartości miejsca wywołania „{0}”
pt_br: Inserindo o valor do site de chamada '{0}'
ru: Вставка значения "{0}" места вызова
tr: Çağırma yeri değeri '{0}' ekleniyor
zh_hans: 正在插入调用站点值 "{0}"
zh_hant: 正在插入呼叫網站值 '{0}'

source: Install Microsoft-recommended Roslyn analyzers, which provide additional diagnostics and fixes for common API design, security, performance, and reliability issues
it: Installare gli analizzatori Roslyn consigliati da Microsoft, che offrono ulteriori funzionalità di diagnostica e correzioni per problemi comuni di sicurezza, prestazioni, affidabilità e progettazione di API
ja: Microsoft で推奨されている Roslyn アナライザーをインストールします。これにより、一般的な API の設計、セキュリティ、パフォーマンス、信頼性の問題に対する追加の診断と修正が提供されます
ru: Установите рекомендуемые корпорацией Майкрософт анализаторы Roslyn, которые предоставляют дополнительные средства диагностики и исправления для распространенных проблем, связанных с разработкой, безопасностью, производительностью и надежностью API.

source: Interface cannot have field.
cs: Rozhraní nemůže mít pole.
de: Die Schnittstelle kann kein Feld aufweisen.
es: La interfaz no puede tener campos.
fr: L'interface ne peut pas avoir de champ.
it: L'interfaccia non può contenere il campo.
ja: インターフェイスにフィールドを含めることはできません。
ko: 인터페이스에는 필드가 포함될 수 없습니다.
pl: Interfejs nie może mieć pola.
pt_br: A interface não pode ter campo.
ru: Интерфейс не может содержать поле.
tr: Arabirimde alan olamaz.
zh_hans: 接口不可具有字段。
zh_hant: 介面不得具有欄位。

source: Introduce undefined TODO variables
cs: Zaveďte nedefinované proměnné TODO.
de: Nicht definierte TODO-Variablen einführen
es: Introducir variables TODO sin definir
fr: Introduire des variables TODO non définies
ja: 未定義の TODO 変数の導入
ko: 정의되지 않은 TODO 변수 소개
pl: Wprowadź niezdefiniowane zmienne TODO
pt_br: Introduzir variáveis de TODO indefinidas
ru: Ввести неопределенные переменные TODO
tr: Tanımsız TODO değişkenlerini tanıtın
zh_hans: 引入未定义的 TODO 变量
zh_hant: 引入未定義的 TODO 變數

source: Invalid type name
cs: Neplatný název typu
de: Ungültiger Typname
es: Nombre de tipo no válido.
fr: Nom de type invalide
ko: 잘못된 형식 이름
pl: Nieprawidłowa nazwa typu
pt_br: Nome de tipo inválido
ru: Недопустимое имя типа
tr: Geçersiz tür adı
zh_hans: 类型名无效
zh_hant: 無效的類別名稱

source: Item origin
ja: 項目の送信元
ru: Источник элемента

source: JSON strings
cs: Řetězce JSON
de: JSON-Zeichenfolgen
es: Cadenas JSON
fr: Chaînes JSON
ko: JSON 문자열
pl: Ciągi JSON
pt_br: Cadeias de caracteres JSON
ru: Строки JSON
tr: JSON dizeleri
zh_hans: JSON 字符串
zh_hant: JSON 字串

source: Keep
cs: Zachovat
de: Beibehalten
es: Mantener
fr: Conserver
ko: 유지
pl: Zachowaj
pt_br: Manter
ru: Сохранить
tr: Koru
zh_hans: 保留
zh_hant: 保留
