Repository: dotnet/roslyn
Catalog: src/VisualStudio/Core/Def/xlf/ServicesVSResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Additional_information_colon
source: Additional information:
cs: Další informace:
de: Zusätzliche Informationen:
es: Información adicional:
fr: Informations supplémentaires :
it: Informazioni aggiuntive:
ja: 追加情報:
ko: 추가 정보:
pl: Informacje dodatkowe:
pt_br: Informações adicionais:
ru: Дополнительная информация:
tr: Ek bilgi:
zh_hans: 其他信息:
zh_hant: 其他資訊:

# Installing_0_failed_Additional_information_colon_1
source: Installing '{0}' failed. Additional information: {1}
cs: Nepovedlo se nainstalovat {0}. Další informace: {1}
de: Fehler bei der Installation von "{0}". Zusätzliche Informationen: {1}
es: No se pudo instalar "{0}". Información adicional: {1}
fr: Échec de l'installation de '{0}'. Informations supplémentaires : {1}
it: L'installazione di '{0}' non è riuscita. Informazioni aggiuntive: {1}
ja: {0}' をインストールできませんでした。 追加情報: {1}
ko: '{0}'을(를) 설치하지 못했습니다. 추가 정보: {1}
pl: Instalowanie składnika „{0}” nie powiodło się. Dodatkowe informacje: {1}
pt_br: Falha na Instalação de '{0}'. Informações Adicionais: {1}
ru: Сбой при установке "{0}". Дополнительная информация: {1}
tr: '{0}' yüklenemedi. Ek bilgiler: {1}
zh_hans: 安装“{0}”失败。 其他信息: {1}
zh_hant: 安裝 '{0}' 失敗 其他資訊: {1}

# Uninstalling_0_failed_Additional_information_colon_1
source: Uninstalling '{0}' failed. Additional information: {1}
cs: Nepovedlo se odinstalovat {0}. Další informace: {1}
de: Fehler bei der Deinstallation von "{0}". Zusätzliche Informationen: {1}
es: No se pudo desinstalar "{0}". Información adicional: {1}
fr: Échec de la désinstallation de '{0}'. Informations supplémentaires : {1}
it: La disinstallazione di '{0}' non è riuscita. Informazioni aggiuntive: {1}
ja: {0}' をアンインストールできませんでした。 追加情報: {1}
ko: '{0}'을(를) 제거하지 못했습니다. 추가 정보: {1}
pl: Odinstalowywanie składnika „{0}” nie powiodło się. Dodatkowe informacje: {1}
pt_br: Desinstalação do '{0}' falhou. Informações adicionais: {1}
ru: Сбой при удалении "{0}". Дополнительная информация: {1}
tr: '{0}' kaldırılamadı. Ek bilgiler: {1}
zh_hans: 卸载“{0}”失败。 其他信息: {1}
zh_hant: 將 '{0}' 解除安裝失敗。 其他資訊: {1}

source: Move {0} below {1}
cs: Přesunout {0} pod {1}
de: "{0}" unterhalb von "{1}" platzieren
es: Mover {0} bajo {1}
fr: Déplacer {0} sous {1}
it: Sposta {0} sotto {1}
ja: {0} を {1} の下に移動する
ko: {1} 아래로 {0} 이동
pl: Przenieś element {0} poniżej elementu {1}
pt_br: Mover {0} pra baixo {1}
ru: Переместить {0} под {1}
tr: {0} öğesini {1} öğesinin altına taşı
zh_hans: 将 {0} 移到 {1} 的下方
zh_hant: 將 {0} 移至 {1} 下方

source: Move {0} above {1}
cs: Přesunout {0} nad {1}
de: "{0}" oberhalb von "{1}" platzieren
es: Mover {0} sobre {1}
fr: Déplacer {0} au-dessus de {1}
it: Sposta {0} sopra {1}
ja: {0} を {1} の上に移動する
ko: {1} 위로 {0} 이동
pl: Przenieś element {0} powyżej elementu {1}
pt_br: Mover {0} pra cima {1}
ru: Переместить {0} над {1}
tr: {0} öğesini {1} öğesinin üstüne taşı
zh_hans: 将 {0} 移到 {1} 的上方
zh_hant: 將 {0} 移至 {1} 上方

source: Remove {0}
cs: Odebrat {0}
de: "{0}" entfernen
es: Quitar {0}
fr: Supprimer {0}
it: Rimuovi {0}
ja: {0} の削除
ko: {0} 제거
pl: Usuń element {0}
pt_br: Remover {0}
ru: Удалить {0}
tr: {0} öğesini kaldır
zh_hans: 删除 {0}
zh_hant: 移除 {0}

source: Restore {0}
cs: Obnovit {0}
de: "{0}" wiederherstellen
es: Restaurar {0}
fr: Restaurer {0}
it: Ripristina {0}
ja: {0} を復元する
ko: {0} 복원
pl: Przywróć element {0}
pt_br: Restaurar {0}
ru: Восстановить {0}
tr: {0} öğesini geri yükle
zh_hans: 还原 {0}
zh_hant: 還原 {0}

source: Re-enable
cs: Znovu povolit
de: Erneut aktivieren
es: Volver a habilitar
fr: Réactiver
it: Abilita di nuovo
ja: 再有効化
ko: 다시 사용
pt_br: Habilitar novamente
ru: Повторно включить
tr: Yeniden etkinleştir

source: Learn more
cs: Další informace
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細を表示
ko: 자세한 정보
pl: Dowiedz się więcej
pt_br: Saiba mais
ru: Подробнее...
tr: Daha fazla bilgi
zh_hans: 了解详细信息
zh_hant: 深入了解

source: Prefer framework type
cs: Upřednostňovat typ architektury
de: Frameworktyp vorziehen
es: Preferir tipo de marco de trabajo
fr: Préférer le type d'infrastructure
it: Preferisci tipo di framework
ja: フレームワークの型を優先する
ko: 프레임워크 형식 사용
pl: Preferuj typ struktury
pt_br: Preferir tipo de estrutura
ru: Предпочитать тип платформы
tr: Çerçeve türünü tercih et
zh_hans: 首选框架类型
zh_hant: 偏好架構類型

source: Prefer predefined type
cs: Upřednostňovat předem definovaný typ
de: Vordefinierten Typ vorziehen
es: Preferir tipo predefinido
fr: Préférer le type prédéfini
it: Preferisci tipo predefinito
ja: 定義済みの型を優先する
ko: 미리 정의된 형식 사용
pl: Preferuj wstępnie zdefiniowany typ
pt_br: Preferir tipo predefinido
ru: Предпочитать предопределенный тип
tr: Önceden tanımlanmış türü tercih et
zh_hans: 首选预定义类型
zh_hant: 偏好預先定義的類型

source: Copy to Clipboard
cs: Zkopírovat do schránky
de: In Zwischenablage kopieren
es: Copiar al Portapapeles
fr: Copier dans le Presse-papiers
it: Copia negli Appunti
ja: クリップボードにコピー
ko: 클립보드로 복사
pl: Kopiuj do Schowka
pt_br: Copiar para Área de Transferência
ru: Копировать в буфер обмена
tr: Panoya Kopyala
zh_hans: 复制到剪贴板
zh_hant: 複製到剪貼簿

source: Close
cs: Zavřít
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pl: Zamknij
pt_br: Fechar
ru: Закрыть
tr: Kapat
zh_hans: 关闭
zh_hant: 關閉

source: <Unknown Parameters>
cs: <Neznámé parametry>
de: <Unbekannte Parameter>
es: <Parámetros desconocidos>
fr: <Paramètres inconnus>
it: <Parametri sconosciuti>
ja: <不明なパラメーター>
ko: <알 수 없는 매개 변수>
pl: <Nieznane parametry>
pt_br: <Parâmetros Desconhecidos>
ru: <Неизвестные параметры>
tr: <Bilinmeyen Parametreler>
zh_hans: <未知参数>
zh_hant: <未知參數>

# End_of_inner_exception_stack
source: --- End of inner exception stack trace ---
cs: --- Konec trasování zásobníku vnitřních výjimek ---
de: --- Ende der inneren Ausnahmestapelüberwachung ---
es: --- Fin del seguimiento de la pila de la excepción interna ---
fr: --- Fin de la trace de la pile d'exception interne ---
it: --- Fine dell'analisi dello stack dell'eccezione interna ---
ja: --- 内部例外のスタック トレースの終わり ---
ko: --- 내부 예외 스택 추적 끝 ---
pl: --- Koniec śladu stosu wyjątków wewnętrznych ---
pt_br: --- Fim do rastreamento da pilha de exceções internas ---
ru: --- Конец трассировки внутреннего стека исключений ---
tr: --- İç özel durum yığın izlemesi sonu ---
zh_hans: --- 内部异常堆栈跟踪的末尾 ---
zh_hant: --- 內部例外狀況堆疊追蹤的結尾 ---

source: For locals, parameters and members
cs: Pro místní proměnné, parametry a členy
de: Für lokale Elemente, Parameter und Member
es: Para variables locales, parámetros y miembros
fr: Pour les variables locales, les paramètres et les membres
it: Per variabili locali, parametri e membri
ja: ローカル、パラメーター、メンバーの場合
ko: 로컬, 매개 변수 및 멤버의 경우
pl: Dla zmiennych lokalnych, parametrów i składowych
pt_br: Para locais, parâmetros e membros
ru: Для локальных переменных, параметров и элементов
tr: Yerel öğeler, parametreler ve üyeler için
zh_hans: 针对局部变量、参数和成员
zh_hant: 針對區域變數、參數及成員

source: For member access expressions
cs: Pro výrazy přístupu členů
de: Für Memberzugriffsausdrücke
es: Para expresiones de acceso a miembro
fr: Pour les expressions d'accès de membre
it: Per espressioni di accesso ai membri
ja: メンバー アクセス式の場合
ko: 멤버 액세스 식의 경우
pl: Dla wyrażenia dostępu do składowych
pt_br: Para expressões de acesso de membro
ru: Для выражений доступа к элементам
tr: Üye erişimi ifadeleri için
zh_hans: 针对成员访问表达式
zh_hant: 針對成員存取運算式

source: Prefer object initializer
cs: Upřednostňovat inicializátor objektu
de: Objektinitialisierer vorziehen
es: Preferir inicializador de objeto
fr: Préférer l'initialiseur d'objet
it: Preferisci inizializzatore di oggetto
ja: オブジェクト初期化子を優先する
ko: 개체 이니셜라이저 사용
pl: Preferuj inicjator obiektu
pt_br: Preferir inicializador de objeto
ru: Предпочитать инициализатор объекта
tr: Nesne başlatıcısını tercih et
zh_hans: 首选对象初始值设定项
zh_hant: 偏好物件初始設定式

# Expression_preferences_colon
source: Expression preferences:
cs: Předvolby výrazu:
de: Ausdruckseinstellungen:
es: Preferencias de expresión:
fr: Préférences en matière d'expressions :
it: Preferenze per espressioni:
ja: 式の優先順位:
ko: 식 기본 설정:
pl: Preferencje wyrażeń:
pt_br: Preferências de expressão:
ru: Предпочтения в отношении выражения:
tr: İfade tercihleri:
zh_hans: 表达式首选项:
zh_hant: 運算式喜好設定:

source: Block Structure Guides
cs: Vodítka pro strukturu bloku
de: Führungslinien für Blockstruktur
es: Guías de estructura de bloque
fr: Repères de structure de bloc
it: Guide per strutture a blocchi
ja: ブロック構造のガイド
ko: 블록 구조 가이드
pl: Prowadnice struktury blokowej
pt_br: Guias de Estrutura de Bloco
ru: Направляющие для структуры блоков
tr: Blok Yapısı Kılavuzları
zh_hans: 块结构指南
zh_hant: 區塊結構輔助線

source: Outlining
cs: Sbalení
de: Gliederung
es: Esquematización
fr: Mode plan
it: Struttura
ja: アウトライン
ko: 개요
pt_br: Estrutura de Tópicos
ru: Структура
tr: Ana Hat

source: Show guides for code level constructs
cs: Zobrazit vodítka pro konstrukty na úrovni kódu
de: Führungslinien für Konstrukte auf Codeebene anzeigen
es: Mostrar guías para construcciones a nivel de código
fr: Afficher les repères pour les constructions au niveau du code
it: Mostra le guide per i costrutti a livello di codice
ja: コード レベルのコンストラクトのガイドを表示する
ko: 코드 수준 구문에 대한 가이드 표시
pl: Pokaż przewodniki dla konstrukcji na poziomie kodu
pt_br: Mostrar guias para construções de nível de código
ru: Показывать направляющие для конструкций уровня кода
tr: Kod düzeyinde yapılar için kılavuzları göster
zh_hans: 显示代码级别构造的指南
zh_hant: 顯示程式碼層級建構的指南

source: Show guides for comments and preprocessor regions
de: Führungslinien für Kommentare und Präprozessorregionen anzeigen
es: Mostrar guías para regiones de preprocesador y comentarios
fr: Afficher les repères pour les commentaires et les régions du préprocesseur
it: Mostra le guide per i commenti e le aree del preprocessore
ja: コメントとプリプロセッサ領域のガイドを表示する
ko: 설명 및 전처리기 영역에 대한 가이드 표시
pl: Pokaż prowadnice dla regionów komentarzy i preprocesora
pt_br: Mostrar guias para regiões do pré-processador e comentários
ru: Показывать направляющие для комментариев и областей препроцессора
tr: Açıklamalar ve ön işlemci bölgeleri için kılavuzları göster
zh_hans: 显示注释和预处理器区域的指南
zh_hant: 顯示註解及前置處理器區域的指南

source: Show guides for declaration level constructs
cs: Zobrazit vodítka pro konstrukty na úrovni deklarace
de: Führungslinien für Konstrukte auf Deklarationsebene anzeigen
es: Mostrar guías para construcciones a nivel de declaración
fr: Afficher les repères pour les constructions au niveau des déclarations
it: Mostra le guide per i costrutti a livello di dichiarazione
ja: 宣言レベルのコンストラクトのガイドを表示する
ko: 선언 수준 구문에 대한 가이드 표시
pl: Pokaż przewodniki dla konstrukcji na poziomie deklaracji
pt_br: Mostrar guias para construções de nível de declaração
ru: Показывать направляющие для конструкций уровня объявления
tr: Bildirim düzeyinde yapılar için kılavuzları göster
zh_hans: 显示声明级别构造的指南
zh_hant: 顯示宣告層級建構的指南

source: Show outlining for code level constructs
cs: Zobrazit sbalení pro konstrukty na úrovni kódu
de: Gliederung für Konstrukte auf Codeebene anzeigen
es: Mostrar esquematización para construcciones a nivel de código
fr: Afficher le mode Plan pour les constructions au niveau du code
it: Mostra la struttura per i costrutti a livello di codice
ja: コード レベルのコンストラクトのアウトラインを表示する
ko: 코드 수준 구문에 대한 개요 표시
pl: Pokaż konspekt dla konstrukcji na poziomie kodu
pt_br: Mostrar estrutura de tópicos para construções de nível de código
ru: Показывать структуру для конструкций уровня кода
tr: Kod düzeyinde yapılar için ana hattı göster
zh_hans: 显示代码级别构造的大纲
zh_hant: 顯示程式碼層級建構的大綱

source: Show outlining for comments and preprocessor regions
cs: Zobrazit sbalení pro komentáře a oblasti pro preprocesor
de: Gliederung für Kommentare und Präprozessorregionen anzeigen
es: Mostrar esquematización para regiones de preprocesador y comentarios
fr: Afficher le mode Plan pour les commentaires et les régions du préprocesseur
it: Mostra la struttura per i commenti e le aree del preprocessore
ja: コメントとプリプロセッサ領域のアウトラインを表示する
ko: 설명 및 전처리기 영역에 대한 개요 표시
pl: Pokaż konspekt dla regionów komentarzy i preprocesora
pt_br: Mostrar estrutura de tópicos para regiões de pré-processador e comentários
ru: Показывать структуру для комментариев и областей препроцессора
tr: Açıklamalar ve ön işlemci bölgeleri için ana hattı göster
zh_hans: 显示注释和预处理器区域的大纲
zh_hant: 顯示註解及前置處理器區域的大綱

source: Show outlining for declaration level constructs
cs: Zobrazit sbalení pro konstrukty na úrovni deklarace
de: Gliederung für Konstrukte auf Deklarationsebene anzeigen
es: Mostrar esquematización para construcciones a nivel de declaración
fr: Afficher le mode Plan pour les constructions au niveau des déclarations
it: Mostra la struttura per i costrutti a livello di dichiarazione
ja: 宣言レベルのコンストラクトのアウトラインを表示する
ko: 선언 수준 구문에 대한 개요 표시
pl: Pokaż konspekt dla konstrukcji na poziomie deklaracji
pt_br: Mostrar estrutura de código para construções de nível de declaração
ru: Показывать структуру для конструкций уровня объявления
tr: Bildirim düzeyinde yapılar için ana hattı göster
zh_hans: 显示声明级别构造的大纲
zh_hant: 顯示宣告層級建構的大綱

# Variable_preferences_colon
source: Variable preferences:
cs: Předvolby proměnných:
de: Variableneinstellungen:
es: Preferencias de variable:
fr: Préférences en matière de variables :
it: Preferenze per variabili:
ja: 変数の優先順位:
ko: 변수 기본 설정:
pl: Preferencje zmiennej:
pt_br: Preferências de variáveis:
ru: Предпочтения в отношении переменных:
tr: Değişken tercihleri:
zh_hans: 变量首选项:
zh_hant: 變數喜好設定:

source: Prefer inlined variable declaration
cs: Upřednostňovat vloženou deklaraci proměnných
de: Inlinevariablendeklaration vorziehen
es: Preferir declaración de variable insertada
fr: Préférer la déclaration de variable inlined
it: Preferisci dichiarazione di variabile inline
ja: インライン変数宣言を優先する
ko: 인라인 변수 선언 사용
pl: Preferuj śródwierszową deklarację zmiennej
pt_br: Preferir declaração de variável embutida
ru: Предпочитать встроенное объявление переменной
tr: Satır içine alınmış değişken bildirimini tercih et
zh_hans: 首选内联的变量声明
zh_hant: 偏好內置變數宣告

source: Use expression body for methods
cs: Pro metody používat text výrazu
de: Ausdruckskörper für Methoden verwenden
es: Usar cuerpo de expresiones para los métodos
fr: Utiliser un corps d'expression pour les méthodes
it: Usa il corpo dell'espressione per i metodi
ja: メソッドに式本体を使用する
ko: 메서드에 식 본문 사용
pl: Użyj treści wyrażenia dla metod
pt_br: Usar o corpo da expressão para métodos
ru: Использовать тело выражения для методов
tr: Metotlar için ifade gövdesi kullan
zh_hans: 使用方法的表达式主体
zh_hant: 使用方法的運算式主體

# Code_block_preferences_colon
source: Code block preferences:
cs: Předvolby bloku kódu:
de: Codeblockeinstellungen:
es: Preferencias de bloque de código:
fr: Préférences en matière de blocs de code :
it: Preferenze per blocchi di codice:
ja: コード ブロックの優先順位:
ko: 코드 블록 기본 설정:
pl: Preferencje bloku kodu:
pt_br: Preferências do bloco de código:
ru: Предпочтения в отношении блока кода:
tr: Kod bloğu tercihleri:
zh_hans: 代码块首选项:
zh_hant: 程式碼區塊喜好設定:

source: Use expression body for accessors
cs: Pro přístupové objekty používat text výrazu
de: Ausdruckskörper für Accessoren verwenden
es: Usar cuerpo de expresiones para los descriptores de acceso
fr: Utiliser un corps d'expression pour les accesseurs
it: Usa il corpo dell'espressione per le funzioni di accesso
ja: アクセサーに式本体を使用する
ko: 접근자에 식 본문 사용
pl: Użyj treści wyrażenia dla metod dostępu
pt_br: Usar o corpo da expressão para acessadores
ru: Использовать тело выражения для методов доступа
tr: Erişimciler için ifade gövdesi kullan
zh_hans: 使用访问器的表达式主体
zh_hant: 使用存取子的運算式主體

source: Use expression body for constructors
cs: Pro konstruktory používat text výrazu
de: Ausdruckskörper für Konstruktoren verwenden
es: Usar cuerpo de expresiones para los constructores
fr: Utiliser un corps d'expression pour les constructeurs
it: Usa il corpo dell'espressione per i costruttori
ja: コンストラクターに式本体を使用する
ko: 생성자에 식 본문 사용
pl: Użyj treści wyrażenia dla konstruktorów
pt_br: Usar o corpo da expressão para construtores
ru: Использовать тело выражения для конструкторов
tr: Oluşturucular için ifade gövdesi kullan
zh_hans: 使用构造函数的表达式主体
zh_hant: 使用建構函式的運算式主體

source: Use expression body for indexers
cs: Pro indexery používat text výrazu
de: Ausdruckskörper für Indexer verwenden
es: Usar cuerpo de expresiones para los indizadores
fr: Utiliser un corps d'expression pour les indexeurs
it: Usa il corpo dell'espressione per gli indicizzatori
ja: インデクサーに式本体を使用する
ko: 인덱서에 식 본문 사용
pl: Użyj treści wyrażenia dla indeksatorów
pt_br: Usar o corpo da expressão para indexadores
ru: Использовать тело выражения для индексаторов
tr: Dizin oluşturucular için ifade gövdesi kullan
zh_hans: 使用索引器的表达式主体
zh_hant: 使用索引子的運算式主體

source: Use expression body for operators
cs: Pro operátory používat text výrazu
de: Ausdruckskörper für Operatoren verwenden
es: Usar cuerpo de expresiones para los operadores
fr: Utiliser un corps d'expression pour les opérateurs
it: Usa il corpo dell'espressione per gli operatori
ja: オペレーターに式本体を使用する
ko: 연산자에 식 본문 사용
pl: Użyj treści wyrażenia dla operatorów
pt_br: Usar o corpo da expressão para operadores
ru: Использовать тело выражения для операторов
tr: İşleçler için ifade gövdesi kullan
zh_hans: 使用运算符的表达式主体
zh_hant: 使用運算子的運算式主體

source: Use expression body for properties
cs: Pro vlastnosti používat text výrazu
de: Ausdruckskörper für Eigenschaften verwenden
es: Usar cuerpo de expresiones para las propiedades
fr: Utiliser un corps d'expression pour les propriétés
it: Usa il corpo dell'espressione per le proprietà
ja: プロパティに式本体を使用する
ko: 속성에 식 본문 사용
pl: Użyj treści wyrażenia dla właściwości
pt_br: Usar o corpo da expressão para propriedades
ru: Использовать тело выражения для свойств
tr: Özellikler için ifade gövdesi kullan
zh_hans: 使用属性的表达式主体
zh_hant: 使用屬性的運算式主體

source: Some naming rules are incomplete. Please complete or remove them.
cs: Některá pravidla pojmenování nejsou hotová. Dokončete je, nebo je prosím odeberte.
de: Einige Benennungsregeln sind unvollständig. Vervollständigen oder entfernen Sie die Regeln.
es: Algunas reglas de nomenclatura están incompletas. Complételas o quítelas.
fr: Certaines règles de nommage sont incomplètes. Complétez-les ou supprimez-les.
it: Alcune regole di denominazione sono incomplete. Completarle o rimuoverle.
ja: 一部の名前付けルールが不完全です。不完全なルールを完成させるか削除してください。
ko: 일부 명명 규칙이 불완전합니다. 완전하게 만들거나 제거하세요.
pl: Niektóre reguły nazewnictwa są niekompletne. Uzupełnij je lub usuń.
pt_br: Algumas regras de nomenclatura são incompletas. Complete ou remova-as.
ru: Некоторые правила именования являются неполными. Дополните или удалите их.
tr: Bazı adlandırma kuralları eksik. Lütfen bunları tamamlayın veya kaldırın.
zh_hans: 一些命名规则不完整。请完善这些命名规则或将其删除。
zh_hant: 部分命名規則不完整。請予以完成或移除。

source: Manage specifications
cs: Spravovat specifikace
de: Spezifikationen verwalten
es: Administrar especificaciones
fr: Gérer les spécifications
it: Gestisci specifiche
ja: 仕様の管理
ko: 사양 관리
pl: Zarządzaj specyfikacjami
pt_br: Gerenciar especificações
ru: Управление спецификациями
tr: Belirtimleri yönet
zh_hans: 管理规范
zh_hant: 管理規格

source: Reorder
cs: Přeskupit
de: Neu anordnen
es: Reordenar
fr: Réorganiser
it: Riordina
ja: 並べ替え
ko: 다시 정렬
pl: Zmień kolejność
pt_br: Reordenar
ru: Переупорядочить
tr: Yeniden sırala
zh_hans: 重新排序
zh_hant: 重新排序

source: Severity
cs: Závažnost
de: Schweregrad
es: Gravedad
fr: Gravité
it: Gravità
ja: 重要度
ko: 심각도
pl: Ważność
pt_br: Gravidade
ru: Серьезность
tr: Önem Derecesi
zh_hans: 严重性
zh_hant: 嚴重性

source: Specification
cs: Specifikace
de: Spezifikation
es: Especificación
fr: Spécification
it: Specifica
ja: 仕様
ko: 사양
pl: Specyfikacja
pt_br: Especificação
ru: Спецификация
tr: Belirtim
zh_hans: 规范
zh_hant: 規格

source: Required Style
cs: Požadovaný styl
de: Erforderlicher Stil
es: Estilo requerido
fr: Style obligatoire
it: Stile obbligatorio
ja: 必要なスタイル
ko: 필수 스타일
pl: Wymagany styl
pt_br: Estilo Necessário
ru: Необходимый стиль
tr: Gerekli Stil
zh_hans: 必填样式
zh_hant: 必要樣式

source: This item cannot be deleted because it is used by an existing Naming Rule.
cs: Položku nejde odstranit, protože ji používá některé existující pravidlo pojmenování.
de: Dieses Element kann nicht gelöscht werden, weil es von einer vorhandenen Benennungsregel verwendet wird.
es: No se puede eliminar este elemento porque una regla de nomenclatura existente lo usa.
fr: Impossible de supprimer cet élément car il est utilisé par une règle de nommage existante.
it: Non è possibile eliminare questo elemento perché è già usato da una regola di denominazione esistente.
ja: このアイテムは既存の名前付けルールで使用されているため、削除できませんでした。
ko: 이 항목은 기존 명명 규칙에서 사용되기 때문에 삭제할 수 없습니다.
pl: Nie można usunąć tego elementu, ponieważ jest on używany przez istniejącą regułę nazewnictwa.
pt_br: Este item não pode ser excluído porque é usado por uma Regra de Nomenclatura existente.
ru: Невозможно удалить этот элемент, так как он используется существующим правилом именования.
tr: Öğe, mevcut bir Adlandırma Kuralı tarafından kullanıldığından silinemiyor.
zh_hans: 无法删除该项，因为它由现有的命名规则使用。
zh_hant: 由於現有命名規則正在使用此項目，因此無法加以刪除。

source: Prefer collection initializer
cs: Upřednostňovat inicializátor kolekce
de: Auflistungsinitialisierer vorziehen
es: Preferir inicializador de colección
fr: Préférer l'initialiseur de collection
it: Preferisci inizializzatore di insieme
ja: コレクション初期化子を優先する
ko: 컬렉션 이니셜라이저 사용
pl: Preferuj inicjator kolekcji
pt_br: Preferir o inicializador de coleção
ru: Предпочитать инициализатор коллекции
tr: Koleksiyon başlatıcısını tercih et
zh_hans: 首选集合初始值设定项
zh_hant: 偏好集合初始設定式

source: Prefer coalesce expression
cs: Upřednostňovat sloučený výraz
de: COALESCE-Ausdruck vorziehen
es: Preferir expresión de fusión
fr: Préférer l'expression coalesce
it: Preferisci espressione COALESCE
ja: 合体式を優先する
ko: coalesce 식 사용
pl: Preferuj wyrażenie łączące
pt_br: Preferir a expressão de união
ru: Предпочитать объединенное выражение
tr: Birleştirme ifadesini tercih et
zh_hans: 首选联合表达式
zh_hant: 偏好聯合運算式

source: Collapse #regions when collapsing to definitions
cs: Při sbalování na definice sbalovat oblasti (#regions)
de: #regions beim Reduzieren auf Definitionen zuklappen
es: Contraer #regions cuando se contraiga a las definiciones
fr: Réduire #regions lors de la réduction aux définitions
it: Comprimi #regions durante la compressione delle definizioni
ja: 定義を折りたたむときに #regions を折りたたむ
ko: 정의로 축소할 때 #regions 축소
pl: Zwiń bloki #regions podczas zwijania do definicji
pt_br: Recolher #regions ao recolher para definições
ru: Сворачивать #regions при сворачивании в определения
tr: Tanımlara daraltırken #regions öğelerini daralt
zh_hans: 折叠到定义时可折叠 #regions
zh_hant: 摺疊至定義時摺疊 #regions

source: Prefer null propagation
cs: Upřednostňovat šíření hodnoty null
de: NULL-Weitergabe vorziehen
es: Preferir propagación nula
fr: Préférer la propagation nulle
it: Preferisci propagazione Null
ja: null 値の反映を優先する
ko: null 전파 사용
pl: Preferuj propagację wartości null
pt_br: Preferir tratamento simplificado de nulo
ru: Предпочитать распространение значений NULL
tr: Null yaymayı tercih et
zh_hans: 首选 null 传播
zh_hant: 偏好 null 傳播

source: Prefer explicit tuple name
cs: Preferovat explicitní název řazené kolekce členů
de: Expliziten Tupelnamen bevorzugen
es: Preferir nombre de tupla explícito
fr: Préférer un nom de tuple explicite
it: Preferisci nome di tupla esplicito
ja: 明示的なタプル名を優先します
ko: 명시적 튜플 이름 기본 사용
pl: Preferuj jawną nazwę krotki
pt_br: Preferir nome de tupla explícito
ru: Предпочитать явное имя кортежа
tr: Açık demet adını tercih et
zh_hans: 首选显式元组名称
zh_hant: 建議使用明確的元組名稱

source: Description
cs: Popis
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pl: Opis
pt_br: Descrição
ru: Описание
tr: Açıklama
zh_hans: 说明
zh_hant: 描述

source: Preference
cs: Předvolba
de: Einstellung
es: Preferencia
fr: Préférence
it: Preferenza
ja: 優先順位
ko: 기본 설정
pl: Preferencja
pt_br: Preferência
ru: Предпочтения
tr: Tercih
zh_hans: 首选项
zh_hant: 喜好設定
