Repository: dotnet/roslyn
Catalog: src/Workspaces/VisualBasic/Portable/xlf/VBWorkspaceResources.*.xlf
Languages: cs, de, fr, it, pl, pt_br, tr, zh_hans

source: Namespace can not be added in this destination.
cs: Obor názvů nejde přidat do tohoto cílového umístění.
de: Namespace kann zu diesem Ziel nicht hinzugefügt werden.
fr: L'espace de noms ne peut pas être ajouté dans cette destination.
it: Non è possibile aggiungere lo spazio dei nomi in questa destinazione.
pl: Do tego miejsca docelowego nie można dodać przestrzeni nazw.
pt_br: Namespace não pode ser adicionado nesse destino.
tr: Ad alanı bu hedefe eklenemez.
zh_hans: 不能在此目标中添加命名空间。

source: Only attributes, expressions or statements can be made explicit
cs: Jako explicitní jde nastavit jenom atributy, výrazy nebo příkazy.
de: Nur Attribute, Ausdrücke oder Anweisungen können explizit gemacht werden
fr: Seuls les attributs, les expressions ou les déclarations peuvent être rendus explicites
it: È possibile rendere espliciti solo attributi, espressioni o istruzioni
pl: Jako jawne można ustawić tylko atrybuty, wyrażenia lub instrukcje
pt_br: Somente atributos, expressões ou instruções podem ser tornados explícitos
tr: Yalnızca öznitelikler, ifadeler veya deyimler açık hale getirilebilir
zh_hans: 只有属性、表达式或语句可以变得明显

source: <event>
cs: <událost>
de: <Ereignis>
fr: <événement>
it: <evento>
pl: <zdarzenie>
zh_hans: <事件>

source: <handler>
cs: <obslužná_rutina>
fr: <gestionnaire>
it: <gestore>
pl: <proceduraObsługi>
pt_br: <manipulador>
tr: <işleyici>
zh_hans: <处理程序>

source: The expression to be evaluated and converted.
cs: Výraz k vyhodnocení a převedení
de: Der auszuwertende und zu konvertierende Ausdruck.
fr: Expression à évaluer et à convertir.
it: Espressione da valutare e convertire.
pl: Wyrażenie, które ma zostać obliczone i przekonwertowane.
pt_br: A expressão a ser avaliada e convertida.
tr: Değerlendirilecek ve dönüştürülecek ifade.
zh_hans: 要进行计算和转换的表达式。

source: The name of the data type to which the value of expression will be converted.
cs: Název datového typu, na který se převede hodnota výrazu
de: Der Name des Datentyps, zu dem der Wert des Ausdrucks konvertiert wird.
fr: Nom du type de données dans lequel la valeur de l'expression sera convertie.
it: Nome del tipo di dati in cui verrà convertito il valore dell'espressione.
pl: Nazwa typu danych, na który zostanie skonwertowana wartość wyrażenia.
pt_br: O nome do tipo de dados para o qual o valor da expressão será convertido.
tr: İfade değerinin dönüştürüleceği veri türünün adı.
zh_hans: 表达式的值将转换成的数据类型的名称。

source: <expression>
cs: <výraz>
de: <Ausdruck>
it: <espressione>
pl: <wyrażenie>
pt_br: <expressão>
tr: <ifade>
zh_hans: <表达式>

source: Associates an event with an event handler, delegate or lambda expression at run time.
cs: Za běhu přidruží událost k obslužné rutině události, delegátu nebo lambda výrazu.
de: Ordnet ein Ereignis während der Laufzeit einem Ereignishandler, Delegat oder Lambdaausdruck zu.
fr: Associe un événement à un gestionnaire d'événements, un délégué ou une expression lambda au moment de l'exécution.
it: Associa un evento a un gestore eventi, un delegato o un'espressione lambda in fase di esecuzione.
pl: Kojarzy zdarzenie z procedurą obsługi zdarzeń, delegatem lub wyrażeniem lambda w czasie wykonywania.
pt_br: Associa um evento a um manipulador de eventos, delegado ou expressão lambda em tempo de execução.
tr: Çalışma zamanında bir olayı olay işleyicisi, temsilci veya lambda ifadesi ile ilişkilendirir.
zh_hans: 在运行时将事件与事件处理程序、委托或 lambda 表达式关联。

source: The event to associate an event handler, delegate or lambda expression with.
cs: Událost, ke které se má přidružit obslužná rutina události, delegát nebo lambda výraz
de: Das Ereignis, dem ein Ereignishandler, Delegat oder Lambdaausdruck zugeordnet wird.
fr: Événement à associer à un gestionnaire d'événements, un délégué ou une expression lambda.
it: Evento da associare a un gestore eventi, un delegato o un'espressione lambda.
pl: Zdarzenie, z którym ma zostać skojarzona procedura obsługi zdarzeń, delegat lub wyrażenie lambda.
pt_br: O evento ao qual associar um manipulador de eventos, delegado ou expressão lambda.
tr: Bir olay işleyicisi, temsilci veya lambda ifadesinin ilişkilendirileceği olay.
zh_hans: 事件处理程序、代理或 lambda 表达式将关联的事件。

source: The event handler to associate with the event. This may take the form of { AddressOf <eventHandler> | <delegate> | <lambdaExpression> }.
cs: Obslužná rutina události, která se má přidružit k události. Může být ve tvaru { AddressOf <eventHandler> | <delegate> | <lambdaExpression> }.
de: Der Ereignishandler, dem das Ereignis zugeordnet wird. Dies kann die Form { AddressOf <Ereignishandler> | <Delegat> | <Lambdaausdruck> } haben.
fr: Gestionnaire d'événements à associer à l'événement. Celui-ci peut prendre la forme suivante : { AddressOf <eventHandler> | <delegate> | <lambdaExpression> }.
it: Gestore eventi da associare all'evento. Il formato può essere { AddressOf <eventHandler> | <delegate> | <lambdaExpression> }.
pl: Procedura obsługi zdarzeń, która ma zostać skojarzona ze zdarzeniem. Może wyglądać następująco { AddressOf <proceduraObsługiZdarzeń> | <delegat> | <wyrażenieLambda> }.
pt_br: O manipulador de eventos para associar com o evento. Isso pode assumir a forma de { AddressOf <eventHandler> | <delegate> | <lambdaExpression> }.
tr: Olay ile ilişkilendirilecek olay işleyicisi. Bu { AddressOf <eventHandler> | <delegate> | <lambdaExpression> } biçimini alabilir.
zh_hans: 将与事件关联的事件处理程序。这可能采用 { AddressOf <eventHandler> | <delegate> | <lambdaExpression> } 的形式。

source: If <expression> evaluates to a reference or Nullable value that is not Nothing, the function returns that value. Otherwise, it calculates and returns <expressionIfNothing>.
cs: Pokud se <výraz> vyhodnotí jako odkaz nebo hodnota s možnou hodnotou null, která není Nothing, funkce vrátí tuto hodnotu. Jinak vypočítá a vrátí <výraz_pokud_Nothing>.
de: Falls <Ausdruck> sich als Referenz oder Nullable-Wert herausstellt, der nicht Nothing ist, gibt die Funktion diesen Wert zurück. Andernfalls berechnet sie <expressionIfNothing> und gibt es zurück.
fr: Si <expression> correspond à une référence ou une valeur Nullable autre que Nothing, la fonction retourne cette valeur. Sinon, elle calcule et retourne <expressionIfNothing>.
it: Se <espressione> viene valutato in un riferimento o un valore Nullable diverso da Nothing, la funzione restituisce tale valore. In caso contrario, viene calcolato e restituisce <espressioneIfNothing>.
pl: Jeśli wynikiem obliczenia <wyrażenia> jest odwołanie lub wartość dopuszczająca wartość null inną niż Nothing, funkcja zwraca tę wartość. W przeciwnym razie oblicza ona i zwraca <wyrażenieObliczoneWPrzypadkuWartościNothing>.
pt_br: Se <expression> é avaliada como uma referência ou um valor Anulável que não é Nothing, a função retorna esse valor. Caso contrário, ela calcula e retorna <expressionIfNothing>.
tr: <expression> bir başvuru veya Nothing olmayan Boş Değer Atanabilir değer olarak değerlendirilirse, işlev bu değeri döndürür. Aksi durumda <expressionIfNothing> hesaplar ve döndürür.
zh_hans: 如果 <表达式> 的计算结果为引用值或 Nothing 以外的可以为 null 的值，函数会返回该值。否则，计算并返回 <expressionIfNothing>。

source: Returned if it evaluates to a reference or nullable type that is not Nothing.
cs: Vrátí se, pokud se vyhodnotí na odkaz nebo typ s možnou hodnotou null, který není Nothing.
de: Wird zurückgegeben, wenn er als Verweis oder Wert, der NULL-Werte zulässt, ausgewertet wird, der ungleich "Nothing" ist.
fr: Valeur retournée si elle correspond à une référence ou un type Nullable autre que Nothing.
it: Viene restituito se viene valutato come riferimento o tipo nullable diverso da Nothing.
pl: Ten element jest zwracany, jeśli wynikiem jego obliczenia jest odwołanie lub typ dopuszczający wartość null inny niż Nothing.
pt_br: Retornado se ele for avaliado como uma referência ou um tipo anulável que não é Nada.
tr: Bir başvuru ya da Nothing olmayan boş değer atanabilir bir tür olarak değerlendirilirse döndürülür.
zh_hans: 在计算结果为引用类型或者 Nothing 以外的可以为 null 的类型时返回。

source: Evaluated and returned if <expression> evaluates to Nothing.
cs: Vyhodnotí se a vrátí se, pokud se <výraz> vyhodnotí jako Nothing.
de: Wird ausgewertet und zurückgegeben, wenn <Ausdruck> nicht als "Nothing" ausgewertet wird.
fr: Évaluée et retournée si <expression> a la valeur Nothing.
it: Valutata e restituita se <condizione> restituisce Nothing.
pl: Ten element jest obliczany i zwracany, jeśli wynikiem obliczenia <wyrażenia> jest Nothing.
pt_br: Avaliado e retornado se <expression> for avaliada como Nada.
tr: <expression> Nothing olarak değerlendirilirse, değerlendirilir ve döndürülür.
zh_hans: 在 <表达式> 的计算结果为 Nothing 时进行计算并返回。

source: <expressionIfNothing>
it: <espressioneIfNothing>
pl: <wyrażenieObliczoneWPrzypadkuWartościNothing>

source: Returns the result of explicitly converting an expression to a specified data type.
cs: Vrací výsledek explicitně převedeného výrazu na zadaný datový typ, objekt, strukturu, třídu nebo rozhraní.
de: Gibt das Ergebnis einer expliziten Konvertierung eines Ausdrucks in einen angegebenen Datentyp zurück.
fr: Retourne le résultat d'une conversion explicite d'une expression en un type de données spécifié.
it: Restituisce il risultato della conversione esplicita di un'espressione in un tipo di dati specificato.
pl: Zwraca wynik jawnej konwersji wyrażenia na określony typ danych.
pt_br: Retorna o resultado da conversão explícita de uma expressão a um tipo de dados especificado.
tr: Bir ifadenin belirtilen bir veri türüne açıkça dönüştürülme sonucunu döndürür.
zh_hans: 返回表达式显式转换为指定的数据类型的结果。

source: Introduces a type conversion operation similar to CType. The difference is that CType succeeds as long as there is a valid conversion, whereas DirectCast requires that one type inherit from or implement the other type.
cs: Zavádí operaci převodu typu podobnou k CType. Rozdíl je v tom, že CType uspěje, pokud existuje platný převod, zatímco DirectCast vyžaduje, aby jeden typ dědil z dalšího typu nebo implementoval další typ.
de: Führt eine Typkonvertierungsoperation ähnlich "CType" ein. Der Unterschied liegt darin, dass "CType" erfolgreich ist, solange eine gültige Konvertierung vorliegt, während für "DirectCast" ein Typ von dem anderen Typ erben oder diesen implementieren muss.
fr: Introduit une opération de conversion de type similaire à CType. La différence entre les deux mots clés est que CType réussit tant qu'une conversion valide est possible, alors que DirectCast requiert qu'un type hérite de l'autre type ou implémente ce dernier.
it: Introduce un'operazione di conversione di tipo simile a CType. La differenza consiste nel fatto che CType ha esito positivo se è presente una conversione valida, mentre DirectCast richiede che un tipo erediti da o implementi l'altro tipo.
pl: Wprowadza operację konwersji typu podobną do CType. Różnica polega na tym, że do pomyślnego działania funkcji CType wymagana jest prawidłowa konwersja, a funkcja DirectCast wymaga, aby jeden typ dziedziczył lub implementował z innego typu.
pt_br: Apresenta uma operação de conversão de tipo semelhante a CType. A diferença é que CType tem êxito desde que haja uma conversão válida, enquanto DirectCast exige que um tipo herda de ou implementa o outro tipo.
tr: CType işlevine benzer bir tür dönüştürme işlemini ortaya çıkarır. Aradaki fark, CType geçerli bir dönüşüm olduğu sürece başarılı olur; DirectCast için ise bir tür diğer türden devralınmalı ya da diğer türü uyguluyor olmalıdır.
zh_hans: 引入与 CType 类似的类型转换运算。二者的区别在于，只要存在有效转换，CType 即可成功，而 DirectCast 则要求一个类型继承自另一个类型或实现另一个类型。

source: The type name to return a System.Type object for.
cs: Název typu, pro který se má vrátit objekt System.Type
de: Der Typname, für den ein System.Type-Objekt zurückgegeben wird.
fr: Nom de type pour lequel un objet System.Type est retourné.
it: Nome di tipo per cui restituire un oggetto System.Type.
pl: Nazwa typu, dla którego ma zostać zwrócony obiekt System.Type.
pt_br: O nome de tipo para retornar um objeto System.Type.
tr: System.Type nesnesinin döndürüleceği tür adı.
zh_hans: 要为其返回 System.Type 对象的类型名称。

source: Returns a System.Type object for the specified type name.
cs: Vrátí objekt System.Type pro zadaný název typu.
de: Gibt ein System.Type-Objekt für den angegebenen Typnamen zurück.
fr: Retourne un objet System.Type pour le nom de type spécifié.
it: Restituisce un oggetto System.Type per il nome di tipo specificato.
pl: Zwraca obiekt System.Type dla określonej nazwy typu.
pt_br: Retorna um objeto System.Type para o nome de tipo especificado.
tr: Belirtilmiş tür adı için System.Type nesnesi döndürür.
zh_hans: 为指定的类型名称返回 System.Type 对象。

source: The XML namespace prefix to return a System.Xml.Linq.XNamespace object for. If this is omitted, the object for the default XML namespace is returned.
cs: Předpona názvového prostoru XML, pro kterou se má vracet objekt System.Xml.Linq.XNamespace. Pokud není určená, vrátí se objekt pro výchozí názvový prostor XML.
de: Das XML-Namespacepräfix, für das ein System.Xml.Linq.XNamespace-Objekt zurückgegeben wird. Falls dies ausgelassen ist, wird das Objekt für den Standard-XML-Namespace zurückgegeben.
fr: Préfixe de l'espace de noms XML pour lequel un objet System.Xml.Linq.XNamespace est retourné. S'il est omis, l'objet de l'espace de noms XML par défaut est retourné.
it: Prefisso dello spazio dei nomi XML per cui restituire un oggetto System.Xml.Linq.XNamespace. Se viene omesso, verrà restituito l'oggetto per lo spazio dei nomi XML predefinito.
pl: Prefiks przestrzeni nazw XML, dla której ma zostać zwrócony obiekt System.Xml.Linq.XNamespace. W przypadku jego pominięcia zostaje zwrócony obiekt dla domyślnej przestrzeni nazw XML.
pt_br: O prefixo do namespace XML para retornar um objeto System.Xml.Linq.XNamespace. Se isso for omitido, o objeto para o namespace XML padrão é retornado.
tr: System.Xml.Linq.XNamespace nesnesinin döndürüleceği XML ad alanı ön eki. Bu atlanırsa, varsayılan XML ad alanına yönelik nesne döndürülür.
zh_hans: 要为其返回 System.Xml.Linq.XNamespace 对象的 XML 命名空间前缀。如果省略，则返回默认 XML 命名空间的对象。

source: <xmlNamespacePrefix>
cs: <předpona_názvového_prostoru_XML>
de: <xmlNamespacepräfix>
it: <prefissoSpazioNomiXml>
pl: <prefiksPrzestrzeniNazwXml>

source: Returns the System.Xml.Linq.XNamespace object corresponding to the specified XML namespace prefix.
cs: Vrátí objekt System.Xml.XLinq.XNamespace odpovídající zadané předponě názvového prostoru XML.
de: Gibt das System.Xml.Linq.XNamespace-Objekt zurück, das dem angegebenen XML-Namespacepräfix entspricht.
fr: Retourne l'objet System.Xml.Linq.XNamespace correspondant au préfixe de l'espace de noms XML spécifié.
it: Restituisce l'oggetto System.Xml.Linq.XNamespace corrispondente al prefisso dello spazio dei nomi XML specificato.
pl: Zwraca obiekt System.Xml.Linq.XNamespace odpowiadający określonemu prefiksowi przestrzeni nazw XML.
pt_br: Retorna o objeto System.Xml.Linq.XNamespace correspondente para o prefixo de namespace XML especificado.
tr: Belirtilen XML ad alanı ön ekine karşılık gelen System.Xml.Linq.XNamespace nesnesini döndürür.
zh_hans: 返回对应于指定 XML 命名空间前缀的 System.Xml.Linq.XNamespace 对象。

source: Replaces a specified number of characters in a String variable with characters from another string.
cs: Nahradí určitý počet znaků v proměnné typu Řetězec znaky z jiného řetězce.
de: Ersetzt eine angegebene Anzahl von Zeichen in einer Zeichenfolgenvariablen durch Zeichen aus einer anderen Zeichenfolge.
fr: Remplace un nombre spécifié de caractères dans une variable String par des caractères d'une autre chaîne.
it: Sostituisce un numero specificato di caratteri in una variabile String con caratteri di un'altra stringa.
pl: Zastępuje określoną liczbę znaków w zmiennej ciągu znakami z innego ciągu.
pt_br: Substitui um número especificado de caracteres em uma variável de Cadeia de Caracteres com caracteres de outra cadeia de caracteres.
tr: Bir String değişkeni içinde belirtilen sayıda karakteri, başka bir dizeden karakterlerle değiştirir.
zh_hans: 用另一字符串中的字符替换 String 变量中指定数量的字符。

source: The name of the string variable to modify.
cs: Název proměnné řetězce k úpravě
de: Der Name der zu ändernden Zeichenfolgenvariable.
fr: Nom de la variable chaîne à modifier.
it: Nome della variabile di tipo stringa da modificare.
pl: Nazwa zmiennej ciągu, która ma zostać zmodyfikowana.
pt_br: O nome da variável da cadeia de caracteres para modificar.
tr: Değiştirilecek dize değişkeninin adı.
zh_hans: 要修改的字符串变量的名称。

source: The one-based character position in the string where the replacement of text begins.
cs: Pozice znaku se základem 1 v řetězci, kde začne nahrazování textu
de: Die einsbasierte Zeichenposition in der Zeichenfolge, wo das Ersetzen des Texts beginnt.
fr: Position de caractère de base un dans la chaîne où commence le remplacement de texte.
it: Posizione del carattere basata su uno nella stringa in cui inizia la sostituzione del testo.
pl: Pozycja znaku (pierwszym indeksem jest jeden) w ciągu, w którym rozpoczyna się zastępowanie tekstu.
pt_br: A posição do caracteres com base um na cadeia de caracteres onde a substituição de texto começa.
tr: Metin değiştirmesinin başladığı dizedeki bir tabanlı karakter konumu.
zh_hans: 开始进行文本替换的字符串中从 1 开始的字符位置。

source: The number of characters to replace. If omitted, the length of <stringExpression> is used.
cs: Počet znaků k nahrazení. Pokud není určený, použije se délka <výraz_řetězce>.
de: Die Anzahl der zu ersetzenden Zeichen. Falls dies fehlt, wird die Länge von <Zeichenfolgenausdruck> verwendet.
fr: Nombre de caractères à remplacer. S'il est omis, la longueur de <stringExpression> est utilisée.
it: Numero di caratteri da sostituire. Se omesso, verrà usata la lunghezza di <espressioneStringa>.
pl: Liczba znaków do zastąpienia. W przypadku pominięcia zostanie użyta długość <wyrażeniaCiągu>.
pt_br: O número de caracteres a substituir. Se omitido, o comprimento de <stringExpression> é usado.
tr: Değiştirilecek karakterlerin sayısı. Atlanırsa <stringExpression> uzunluğu kullanılır.
zh_hans: 要替换的字符数目。如果省略，则使用 <stringExpression> 的长度。

source: <stringName>
it: <nomeStringa>
pl: <nazwaCiągu>

source: <startIndex>
it: <indiceIniziale>
pl: <indeksPoczątkowy>

source: <length>
cs: <délka>
de: <Länge>
fr: <longueur>
it: <lunghezza>
pl: <długość>
zh_hans: <长度>

source: <stringExpression>
cs: <výraz_řetězce>
de: <Zeichenfolgenausdruck>
it: <espressioneStringa>
pl: <wyrażenieCiągu>

source: Converts an expression to the {0} data type.
cs: Převede výraz na datový typ {0}.
de: Konvertiert einen Ausdruck in einen Wert vom Datentyp {0}.
fr: Convertit une expression en type de données {0}.
it: Converte un'espressione nel tipo di dati {0}.
pl: Konwertuje wyrażenie na typ danych {0}.
pt_br: Converte uma expressão para o {0} tipo de dados.
tr: Bir ifadeyi {0} veri türüne dönüştürür.
zh_hans: 将表达式转换为 {0} 数据类型。

source: Removes the association between an event and an event handler or delegate at run time.
cs: Za běhu odebere přidružení mezi událostí a obslužnou rutinou události nebo delegátem.
de: Entfernt die Zuordnung zwischen einem Ereignis und einem Ereignishandler oder Delegat zur Laufzeit.
fr: Supprime l'association entre un événement et un gestionnaire d'événements ou un délégué au moment de l'exécution.
it: Rimuove l'associazione tra un evento e un gestore eventi o un delegato in fase di esecuzione.
pl: Usuwa skojarzenie między zdarzeniem i procedurą obsługi zdarzeń lub delegatem w czasie wykonywania.
pt_br: Remove a associação entre um evento e um manipulador de eventos ou delegado em tempo de execução.
tr: Çalışma zamanında bir olay ve olay işleyicisi veya temsilci arasındaki ilişkiyi kaldırır.
zh_hans: 在运行时删除事件和事件处理程序或委托之间的关联。

source: The event to disassociate an event handler or delegate from.
cs: Událost, u které se má zrušit přidružení obslužné rutiny události nebo delegáta
de: Das Ereignis, von dem ein Ereignishandler oder Delegat getrennt wird.
fr: Événement à dissocier d'un gestionnaire d'événements ou d'un délégué.
it: Evento da disassociare da un gestore eventi, un delegato o un'espressione lambda.
pl: Zdarzenie, którego skojarzenie z procedurą obsługi zdarzeń lub delegatem ma zostać usunięte.
pt_br: O evento para desassociar um manipulador de eventos ou delegado dele.
tr: Bir olay işleyicisi veya temsilci ilişkilendirmesinin kaldırılacağı olay.
zh_hans: 事件处理程序或委托将解除关联的事件。

source: The event handler to disassociate from the event. This may take the form of { AddressOf <eventHandler> | <delegate> }.
cs: Obslužná rutina události, jejíž přidružení k události se má zrušit. Může být ve tvaru { AddressOf <eventHandler> | <delegate> }.
de: Der Ereignishandler, von dem das Ereignis getrennt wird. Dies kann die Form { AddressOf <Ereignishandler> | <Delegat> } haben.
fr: Gestionnaire d'événements à dissocier de l'événement. Celui-ci peut prendre la forme suivante : { AddressOf <eventHandler> | <delegate> }.
it: Gestore eventi da disassociare dall'evento. Il formato può essere { AddressOf <eventHandler> | <delegate> }.
pl: Procedura obsługi zdarzeń, której skojarzenie ze zdarzeniem ma zostać usunięte. Może wyglądać następująco { AddressOf <proceduraObsługiZdarzeń> | <delegat> }.
pt_br: O manipulador de eventos para desassociar a partir do evento. Isso pode assumir a forma de { AddressOf <eventHandler> | <delegate> }.
tr: Olay ile ilişkilendirilmesi kaldırılacak olay işleyicisi. Bu { AddressOf <eventHandler> | <delegate> } biçimini alabilir.
zh_hans: 将解除与事件的关联的事件处理程序。这可能采用 { AddressOf <eventHandler> | <delegate> } 的形式。

source: If <condition> returns True, the function calculates and returns <expressionIfTrue>. Otherwise, it returns <expressionIfFalse>.
cs: Pokud <condition> vrátí True, funkce vypočítá a vrátí <expressionIfTrue>. Jinak vrátí <expressionIfFalse>.
de: Falls <condition> True zurückgibt, berechnet die Funktion <expressionIfTrue> und gibt es zurück. Andernfalls gibt sie <expressionIfFalse> zurück.
fr: Si <condition> retourne la valeur True, la fonction calcule et retourne <expressionIfTrue>. Sinon, elle retourne <expressionIfFalse>.
it: Se <condizione> restituisce True, la funzione calcola e restituisce <espressioneIfTrue>. In caso contrario, restituisce <espressioneIfFalse>.
pl: Jeśli w wyniku obliczenia <warunku> zostanie zwrócona wartość True, funkcja obliczy i zwróci <wyrażenieObliczoneWPrzypadkuWartościTrue>. W przeciwny razie zwróci <wyrażenieObliczoneWPrzypadkuWartościFalse>.
pt_br: Se <condition> retorna Verdadeiro, a função calcula e retorna <expressionIfTrue>. Caso contrário, ela retorna <expressionIfFalse>.
tr: Eğer <condition> True değer döndürürse, işlev <expressionIfTrue> hesaplar ve döndürür. Aksi durumda <expressionIfFalse> döndürür.
zh_hans: 如果 <条件> 返回 True, 则函数会计算并返回 <expressionIfTrue>。否则，返回 <expressionIfFalse>。

source: The expression to evaluate.
cs: Výraz k vyhodnocení
de: Der auszuwertende Ausdruck.
fr: Expression à évaluer.
it: Espressione da valutare.
pl: Wyrażenie, które ma zostać obliczone.
pt_br: A expressão a ser avaliada.
tr: Değerlendirilecek ifade.
zh_hans: 要计算的表达式。

source: Evaluated and returned if <condition> evaluates to True.
cs: Vyhodnotí se a vrátí se, pokud se <podmínka> vyhodnotí jako True.
de: Wird überprüft und zurückgegeben, falls <Bedingung> in True ausgewertet wird.
fr: Évaluée et retournée si <condition> a la valeur True.
it: Valutata e restituita se <condizione> restituisce True.
pl: Ten element jest obliczany i zwracany, jeśli wynikiem obliczenia <warunku> jest wartość True.
pt_br: Avaliado e retornado se <condition> for avaliada como Verdadeiro.
tr: <condition> True olarak değerlendirilirse, değerlendirilir ve döndürülür.
zh_hans: 在 <条件> 的计算结果为 True 时进行计算并返回。
