Repository: dotnet/roslyn
Catalog: src/Workspaces/VisualBasic/Portable/xlf/VBWorkspaceResources.*.xlf
Languages: cs, de, fr, it, pl, pt_br, tr, zh_hans

source: Evaluated and returned if <condition> evaluates to False.
cs: Vyhodnotí se a vrátí se, pokud se <podmínka> vyhodnotí jako False.
de: Wird überprüft und zurückgegeben, falls <Bedingung> in False ausgewertet wird.
fr: Évaluée et retournée si <condition> a la valeur False.
it: Valutata e restituita se <condizione> restituisce False.
pl: Ten element jest obliczany i zwracany, jeśli wynikiem obliczenia <warunku> jest wartość False.
pt_br: Avaliado e retornado se <condition> for avaliada como Falso.
tr: <condition> False olarak değerlendirilirse, değerlendirilir ve döndürülür.
zh_hans: 在 <条件> 的计算结果为 False 时进行计算并返回。

source: <condition>
cs: <podmínka>
de: <Bedingung>
it: <condizione>
pl: <warunek>
zh_hans: <条件>

source: <expressionIfTrue>
it: <espressioneIfTrue>
pl: <wyrażenieObliczoneWPrzypadkuWartościTrue>

source: <expressionIfFalse>
it: <espressioneIfFalse>
pl: <wyrażenieObliczoneWPrzypadkuWartościFalse>

source: Introduces a type conversion operation that does not throw an exception. If an attempted conversion fails, TryCast returns Nothing, which your program can test for.
cs: Zavádí operaci převodu typu, která nevyvolá výjimku. Pokud se pokus o převod nezdaří, TryCast vrací hodnotu Nothing, kterou může váš program testovat.
de: Führt eine Typenkonvertierungsoperation ein, die keine Ausnahme auslöst. Wenn beim Versuch einer Konvertierung ein Fehler auftritt, gibt "TryCast" den Wert "Nothing" zurück, auf den das Programm eine Überprüfung durchführen kann.
fr: Introduit une opération de conversion de type qui ne lève pas d'exception. En cas d'échec d'une tentative de conversion, TryCast retourne Nothing, qui peut être testé par votre programme.
it: Introduce un'operazione di conversione di tipo che non genera un'eccezione. Se un tentativo di conversione ha esito negativo, TryCast restituisce Nothing, che può essere verificato dal programma.
pl: Wprowadza operację konwersji typu, która nie zgłasza wyjątku. Jeśli próba konwersji nie powiedzie się, element TryCast zwróci wartość Nothing, którą Twój program może użyć do testów.
pt_br: Apresenta uma operação de conversão de tipo que não gera uma exceção. Se uma tentativa de conversão falhar, TryCast retorna Nothing, para a qual seu programa pode testar.
tr: Özel durum oluşturmayan bir tür dönüştürme işlemini ortaya çıkarır. Eğer denenen bir dönüştürme başarısız olursa, TryCast programınızın test edebileceği Hiçbir Değer döndürmez.
zh_hans: 引入一个不引发异常的类型转换运算。如果尝试执行的转换失败，TryCast 会返回空值，程序可对此进行测试。

source: Node does not descend from root.
cs: Uzel nesestupuje z kořene.
de: Knoten steigt nicht vom Stamm ab.
fr: Le nœud ne provient pas de la racine.
it: Il nodo non discende dalla radice.
pl: Węzeł nie jest elementem podrzędnym elementu głównego.
pt_br: Nó não deriva da raiz.
tr: Düğüm kökten azalmaz.
zh_hans: 节点并非源自根。

source: Node not in parent's child list
cs: Uzel není v seznamu podřízených položek u nadřazené položky.
de: Knoten befindet sich nicht in der untergeordneten Liste des übergeordneten Elements
fr: Le nœud ne figure pas dans la liste des enfants du parent
it: Il nodo non è incluso nell'elenco degli elementi figlio dell'elemento padre
pl: Węzeł nie znajduje się na liście elementów podrzędnych elementu nadrzędnego
pt_br: Nó não está na lista de filhos do pai
tr: Düğüm üst öğenin alt öğe listesinde değil
zh_hans: 不在父级的子列表中的节点

source: Trivia is not associated with token
cs: Triviální prvek není přidružený k tokenu.
de: Trivia ist nicht dem Token zugeordnet
fr: Trivia non associé au jeton
it: Gli elementi semplici non sono associati al token
pl: Elementy towarzyszące składni nie są skojarzone z tokenem
pt_br: Trívia não está associada a token
tr: Meraklısına Notlar belirteç ile ilgili değil
zh_hans: 琐事与标记不相关联

source: <typeOrMember>
fr: <typeOuMembre>
it: <tipoOMembro>

source: The type of member to return the name of.
cs: Typ člena, jehož název se má vrátit
de: Der Typ oder Member, dessen Name zurückgegeben werden soll.
fr: Le type de membre dont le nom doit être retourné.
it: Tipo di membro di cui restituire il nome.
pl: Typ składowej, której nazwa ma zostać zwrócona.
pt_br: O tipo de membro para retornar o nome.
tr: Adı döndürülecek üye türü.
zh_hans: 要返回其名称的成员的类型。

source: Produces a string for the name of the specified type or member.
cs: Vytvoří řetězec názvu určeného typu nebo člena.
de: Erzeugt eine Zeichenfolge für den Namen des angegebenen Typs oder Members.
fr: Produit une chaîne pour le nom du type ou du membre spécifié.
it: Produce una stringa pe ril nome del tipo o del membro specificato.
pl: Tworzy ciąg nazwy określonego typu lub składowej.
pt_br: Produz uma cadeia de caracteres para o nome do tipo ou do membro especificado.
tr: Belirtilen tür veya üye adı için bir dize üretir.
zh_hans: 为指定类型或成员的名称生成字符串。

source: <result>
cs: <výsledek>
de: <Ergebnis>
fr: <résultat>
it: <risultato>
pl: <wynik>
pt_br: <resultado>
tr: <sonuç>
zh_hans: <结果>

source: <typeName>
pl: <nazwaTypu>

source: R&emove and Sort Imports
cs: &Odebrat a seřadit importy
de: Import-Direktiven &entfernen und sortieren
tr: Import'ları Kaldır &ve Sırala

source: &Sort Imports
cs: &Seřadit importy
de: Importe &sortieren
tr: İçeri Aktarmaları &Sırala

source: VB Coding Conventions
cs: Konvence kódování ve VB
