Repository: dotnet/roslyn
Catalog: src/EditorFeatures/Core.Wpf/xlf/EditorFeaturesWpfResources.*.xlf
Languages: fr, it, ja, ko, pl, ru, tr, zh_hans

source: Building Project
fr: Génération du projet
it: Compilazione progetto
ja: プロジェクトのビルド
ko: 프로젝트 빌드 중
pl: Trwa kompilowanie projektu
ru: Сборка проекта
tr: Proje Oluşturuluyor
zh_hans: 正在生成项目

source: Copying selection to Interactive Window.
fr: Copie de la sélection dans la fenêtre interactive.
it: Copia della selezione nella finestra interattiva.
ja: インタラクティブ ウィンドウに選択内容をコピーしています。
ko: 선택 영역을 대화형 창으로 복사하는 중입니다.
pl: Kopiowanie zaznaczenia do okna Interactive.
ru: Копирование выделенного фрагмента в интерактивное окно.
tr: Seçim, Etkileşimli Pencere'ye kopyalanıyor.
zh_hans: 将所选内容复制到交互窗口。

source: Enter to rename, Shift+Enter to preview
fr: Entrez pour renommer, Maj+Entrée pour afficher un aperçu.
it: INVIO per rinominare, MAIUSC+INVIO per visualizzare l'anteprima
ja: Enter キーを押して名前を変更、Shift + Enter キーを押してプレビュー
ko: 이름을 바꾸려면 Enter 키를, 미리 보려면 Shift+Enter 키를 누르세요.
pl: Naciśnij klawisz Enter, aby zmienić nazwę, Shift+Enter, aby wyświetlić podgląd
ru: Нажмите ВВОД для переименования. Нажмите SHIFT+ВВОД для предварительного просмотра.
tr: Yeniden adlandırmak için Enter, önizleme için Shift+Enter
zh_hans: Enter 重命名，Shift+Enter 预览

# Enter_to_rename_shift_enter_to_preview_ctrl_space_for_ai_suggestion
source: Enter to rename, Shift+Enter to preview, Ctrl+Space for rename suggestions
it: INVIO per rinominare, MAIUSC+INVIO per visualizzare l'anteprima, CTRL+SPACE per i suggerimenti di ridenominazione
pl: Klawisz Enter, aby zmienić nazwę, klawisze Shift+Enter, aby wyświetlić podgląd, klawisze Ctrl+Spacja, aby zmienić nazwy sugestii
zh_hans: 按 Enter 可重命名，按 Shift+Enter 可预览，按 Ctrl+空格键可获取重命名建议

source: Error performing rename: '{0}'
fr: Erreur au moment du renommage : '{0}'
it: Si è verificato un errore durante la ridenominazione: '{0}'
ja: 名前変更の実行でエラーが発生しました: '{0}'
ko: 이름 바꾸기 수행 중 오류 발생: '{0}'
pl: Błąd podczas wykonywania operacji zmiany nazwy: „{0}”
ru: Ошибка при выполнении переименования: "{0}"
tr: Yeniden adlandırma işlemi gerçekleştirilirken hata oluştu: '{0}'
zh_hans: 执行重命名时出错:“{0}”

source: Executing selection in Interactive Window.
fr: Exécution de la sélection dans la fenêtre interactive.
it: Esecuzione della selezione nella finestra interattiva.
ja: インタラクティブ ウィンドウで選択を実行します。
ko: 선택 영역을 대화형 창에서 실행하는 중입니다.
pl: Wykonywanie zaznaczenia w oknie Interactive.
ru: Выполнение выделенного фрагмента в Интерактивном окне.
tr: Seçim, Etkileşimli Pencere'de yürütülüyor.
zh_hans: 在交互窗口中执行所选内容。

source: Generating suggestions...
it: Generazione di suggerimenti in corso
pl: Generowanie sugestii...
zh_hans: 正在生成建议...

# Get_AI_suggestions
source: Get AI-powered rename suggestions (Ctrl+Space)
it: Ottieni suggerimenti di ridenominazione basati sull'intelligenza artificiale (CTRL+BARRA SPAZIATRICE)
pl: Uzyskaj funkcję Zmień nazwy sugestii obsługiwane przez sztuczną inteligencję (Ctrl+Spacja)
zh_hans: 获取 AI 支持的重命名建议(Ctrl+空格键)

source: Interactive host process platform
fr: Plateforme de processus hôte interactive
it: Piattaforma interattiva per processi host
ja: 対話型ホスト プロセス プラットフォーム
ko: 대화형 호스트 프로세스 플랫폼
pl: Platforma procesu hosta interaktywnego
ru: Интерактивная платформа хост-процесса
tr: Etkileşimli ana işlem platformu
zh_hans: 交互式主机进程平台

source: Reset the execution environment to the initial state and keep history, with the option to switch the runtime of the host process.
fr: Réinitialisez l’environnement d’exécution à l’état initial et conservez l’historique, avec l’option permettant de changer le runtime du processus hôte.
it: Reimpostare lo stato iniziale dell'ambiente di esecuzione e mantenere la cronologia, con l'opzione per cambiare il runtime del processo host.
ja: ホスト プロセスのランタイムを切り替えるオプションを使用して、実行環境を初期状態にリセットし、履歴を保持します。
ko: 호스트 프로세스의 런타임을 전환하는 옵션을 사용하여 실행 환경을 초기 상태로 다시 설정하고 기록을 유지합니다.
pl: Zresetuj środowisko wykonawcze do stanu początkowego i zachowaj historię z opcją przełączenia środowiska uruchomieniowego procesu hosta.
ru: Сброс окружения выполнения в исходное состояние и сохранение журнала с возможностью переключения среды выполнения хост-процесса.
tr: Yürütme ortamını başlangıç durumuna sıfırlayın ve ana bilgisayar işleminin çalışma zamanını değiştirme seçeneğiyle geçmişi tut.
zh_hans: 通过选择切换主机进程的运行时，将执行环境重置为初始状态并保留历史记录。

source: Reset to a clean environment (only mscorlib referenced), do not run initialization script.
fr: Rétablir un environnement propre (seul mscorlib est référencé), ne pas exécuter de script d'initialisation.
it: Esegue il ripristino a un ambiente pulito (solo con riferimenti a mscorlib), senza eseguire lo script di inizializzazione.
ja: クリーンな環境 (mscorlib のみを参照) にリセットし、初期化スクリプトは実行しません。
ko: 정리된 환경(mscorlib만 참조됨)으로 다시 설정하고 초기화 스크립트를 실행하지 않습니다.
pl: Przywróć czyste środowisko (tylko z odwołaniem do elementu mscorlib), nie uruchamiaj skryptu inicjowania.
ru: Сброс до состояния чистого окружения (есть только ссылка на mscorlib) без запуска скрипта инициализации.
tr: Temiz bir ortama sıfırlayın (yalnızca mscorlib öğesine başvurulur), başlatma betiğini çalıştırmayın.
zh_hans: 重置为干净环境(仅引用 mscorlib)，不要运行初始化脚本。

source: Resetting Interactive
fr: Réinitialisation interactive
it: Reimpostazione di Interactive
ja: 対話をリセットしています
ko: 대화형을 다시 설정하는 중
pl: Resetowanie trybu interaktywnego
ru: Сброс интерактивного режима
tr: Etkileşimli Sıfırlama
zh_hans: 正在重置交互

source: Resetting execution engine.
fr: Réinitialisation du moteur d'exécution.
it: Il motore di esecuzione verrà reimpostato.
ja: 実行エンジンをリセットしています。
ko: 실행 엔진을 다시 설정하는 중입니다.
pl: Resetowanie aparatu wykonywania.
ru: Идет сброс подсистемы выполнения.
tr: Yürütme altyapısı sıfırlanıyor.
zh_hans: 正在重置执行引擎。

source: The CurrentWindow property may only be assigned once.
fr: La propriété CurrentWindow ne peut être assignée qu'une seule fois.
it: La proprietà CurrentWindow può essere assegnata una sola volta.
ja: CurrentWindow プロパティは 1 回のみ割り当てることができます。
ko: CurrentWindow 속성은 한 번만 할당될 수 있습니다.
pl: Właściwość CurrentWindow można przypisać tylko raz.
ru: Свойство CurrentWindow может быть назначено только один раз.
tr: CurrentWindow özelliği yalnızca bir kez atanabilir.
zh_hans: 只能对 CurrentWindow 属性进行一次赋值。

# Toggle_AI_suggestions
source: Toggle rename suggestions (Ctrl+Space)
it: Attiva/Disattiva i suggerimenti di ridenominazione (CTRL+BARRA SPAZIATRICE)
pl: Przełącz zmiany nazwy sugestii (Ctrl+Spacja)
zh_hans: 切换重命名建议(Ctrl+空格)

source: Print a list of referenced assemblies.
fr: Affichez la liste des assemblys référencés.
ja: 参照アセンブリの一覧を印刷します。
ko: 참조된 어셈블리의 목록을 인쇄합니다.
ru: Печать списка сборок, на которые указывают ссылки.
tr: Başvurulan bütünleştirilmiş kodların listesini yazdırın.

source: The references command is not supported in this Interactive Window implementation.
fr: La commande references n'est pas prise en charge dans cette implémentation de fenêtre interactive.
ja: このインタラクティブ ウィンドウの実装で、参照コマンドはサポートされていません。
ko: 참조 명령은 이 대화형 창 구현에서 지원되지 않습니다.
ru: Команда, на которую указывает ссылка, не поддерживается в этой реализации Интерактивного окна.
tr: Başvurular komutu bu Etkileşimli Pencere uygulamasında desteklenmiyor.
