Repository: dotnet/roslyn
Catalog: src/Workspaces/MSBuild/Core/xlf/WorkspaceMSBuildResources.*.xlf
Languages: cs, de, ja, pl, ru, zh_hant

source: Failed to load solution: '{0}'
cs: Nepovedlo se načíst řešení: {0}

source: Failed to load solution filter: '{0}'
cs: Nepovedlo se načíst filtr řešení: {0}
de: Fehler beim Laden des Projektmappenfilters: "{0}"
ja: ソリューション フィルター '{0}' を読み込めませんでした
pl: Nie można załadować filtru rozwiązań: „{0}”
ru: Не удалось загрузить фильтр решений: "{0}"
zh_hant: 無法載入解決方案篩選: '{0}'

source: Found project reference without a matching metadata reference: {0}
cs: Našel se odkaz na projekt bez odpovídajícího odkazu na metadata: {0}
de: Projektverweis ohne passenden Metadatenverweis gefunden: {0}
ja: 一致するメタデータ参照が含まれないプロジェクト参照が見つかりました: {0}
pl: Znaleziono odwołanie projektu bez zgodnego odwołania metadanych: {0}
ru: Обнаружена ссылка на проект без соответствующей ссылки на метаданные: {0}
zh_hant: 發現沒有相符中繼資料參考的專案參考: {0}

source: Invalid {0} specified: {1}
cs: Neplatné zadané {0}: {1}
de: {0} wurde ungültig angegeben: {1}
ja: 無効な {0} が指定されました: {1}
pl: Określono nieprawidłowy plik {0}” {1}
ru: Указан недопустимый элемент {0}: {1}
zh_hant: 指定了無效的 {0}: {1}

source: Msbuild failed when processing the file '{0}'
cs: Při zpracovávání souboru {0} došlo k chybě MSBuildu.
de: MSBuild-Fehler beim Verarbeiten der Datei "{0}"
ja: ファイル '{0}' の処理中に MSBuild が失敗しました
pl: Operacja programu MSBuild nie powiodła się podczas przetwarzania pliku „{0}”
ru: Сбой Msbuild при обработке файла "{0}"
zh_hant: Msbuild 在處理檔案 '{0}' 時失敗

source: Msbuild failed when processing the file '{0}' with message: {1}
cs: Při zpracovávání souboru {0} došlo k chybě MSBuildu s touto zprávou: {1}
de: MSBuild-Fehler beim Verarbeiten der Datei "{0}" mit der Meldung: {1}.
ja: ファイル '{0}' の処理中に MSBuild が次のメッセージで失敗しました: {1}
pl: Operacja programu MSBuild nie powiodła się podczas przetwarzania pliku „{0}”, komunikat: {1}
ru: Сбой Msbuild при обработке файла "{0}" с сообщением: {1}
zh_hant: 處理檔案 '{0}' 時 Msbuild 失敗，訊息: {1}

source: Path for additional document '{0}' was null}
cs: Cesta k dalšímu dokumentu {0} byla null}
de: Der Pfad für das Zusatzdokument '{0}' war nicht vorhanden}.
ja: 追加文書 '{0}' のパスが null です}
pl: Ścieżka dla dodatkowego dokumentu "{0}" miała wartość null}
ru: Путь к дополнительному документу "{0}" имел значение NULL}
zh_hant: 其他文件 '{0}' 的路徑為 null}

source: Path for document '{0}' was null
cs: Cesta pro dokument {0} byla null.
de: Der Pfad für das Dokument "{0}" war NULL
ja: ドキュメント ' {0} ' のパスが null でした
pl: Ścieżka dokumentu "{0}" miała wartość null
ru: Путь для документа "{0}" имел значение NULL
zh_hant: 文件 '{0}' 的路徑為 null

source: Project already added.
cs: Projekt se už přidal.
de: Projekt bereits hinzugefügt.
ja: プロジェクトが既に追加されました。
pl: Projekt już został dodany.
ru: Проект уже добавлен.
zh_hant: 專案已新增。

source: Found project with the same file path and output path as another project: {0}
cs: Byl nalezen projekt, který má stejnou cestu k souboru a výstupní cestu jako jiný projekt: {0}
de: Projekt mit demselben Datei- und Ausgabepfad wie ein anderes Projekt gefunden: {0}
ja: 同じファイル パスと出力パスを持つ別のプロジェクト {0} が見つかりました
pl: Znaleziono projekt, który ma taką samą ścieżkę pliku i ścieżkę wyjściową co inny projekt: {0}
ru: Найден проект, путь к файлу и выходной путь которого совпадают с путями другого проекта: {0}
zh_hant: 偵測到專案的檔案路徑及輸出路徑，與另一個專案 {0} 相同

source: Duplicate project discovered and skipped: {0}
cs: Byl zjištěn a vynechán duplicitní projekt: {0}
de: Doppeltes Projekt ermittelt und übersprungen: {0}
ja: 見つかってスキップされた、重複するプロジェクト: {0}
pl: Wykryto i pominięto zduplikowany projekt: {0}
ru: Обнаружен и пропущен повторяющийся проект: {0}
zh_hant: 發現重複的專案，將予跳過: {0}

source: Project does not have a path.
cs: Projekt nemá cestu.
de: Das Projekt hat keinen Pfad.
ja: プロジェクトにパスが存在しません。
pl: Projekt nie ma ścieżki.
ru: У проекта нет пути.
zh_hant: 專案沒有路徑。

source: Project path for '{0}' was null
cs: Cesta projektu pro {0} byla null.
de: Der Projektpfad für "{0}" war NULL
ja: ' {0} ' のプロジェクト パスが null でした
pl: Ścieżka projektu dla pliku "{0}" miała wartość null
ru: Путь проекта для "{0}" имел значение NULL
zh_hant: '{0}' 的專案路徑為 null

source: The build host could not be found at '{0}'
cs: V {0} se nepovedlo najít hostitele sestavení.
de: Der Buildhost wurde unter „{0}“ nicht gefunden.
ja: ビルド ホストが '{0}' で見つかりませんでした
pl: Nie można odnaleźć hosta kompilacji w lokalizacji „{0}”
ru: Не удалось найти узел сборки в "{0}"
zh_hant: 在 '{0}' 找不到組建主機

source: Unable to add metadata reference '{0}'
cs: Nedá se přidat odkaz na metadata {0}.
de: Der Metadaten-Verweis "{0}" wurde nicht hinzugefügt
ja: メタデータ参照 "{0}" を追加できません。
pl: Nie można dodać odwołania do metadanych "{0}"
ru: Не удается добавить ссылку на метаданные "{0}"
zh_hant: 無法新增中繼資料參照 '{0}'

source: Unable to find '{0}'
cs: Nedá se najít {0}.
de: "{0}" wurde nicht gefunden
ja: '{0}' が見つかりません
pl: Nie można znaleźć pliku "{0}"
ru: Не удается найти "{0}"
zh_hant: 找不到 '{0}'

source: Unable to find a '{0}' for '{1}'
cs: Nedá se najít {0} pro {1}.
de: "{0}" für "{1}" wurde nicht gefunden
ja: '{1}' の ' {0} ' が見つかりません
pl: Nie można znaleźć pliku "{0}"dla "{1}"
ru: Не удается найти "{0}" для "{1}"
zh_hant: 找不到 '{1}' 的 {0}

source: Unable to remove metadata reference '{0}'
cs: Nedá se odebrat odkaz na metadata {0}.
de: Der Metadaten-Verweis "{0}" wurde nicht entfernt
ja: メタデータ参照 ' {0} ' を削除できません
pl: Nie można usunąć odwołania do metadanych "{0}"
ru: Не удается удалить ссылку на метаданные "{0}"
zh_hant: 無法移除中繼資料參照 '{0}'

source: Unresolved metadata reference removed from project: {0}
cs: Nevyřešený odkaz na metadata se odebral z projektu: {0}.
de: Nicht aufgelöster Metadatenverweis aus Projekt entfernt: {0}.
ja: 未解決のメタデータ参照がプロジェクトから削除されます: {0}
pl: Nierozpoznane odwołanie metadanych zostało usunięte z projektu: {0}
ru: Неразрешенная ссылка на метаданные удалена из проекта: {0}
zh_hant: 從專案中移除的未解析中繼資料參考: {0}
