Repository: dotnet/roslyn
Catalog: src/Features/LanguageServer/Microsoft.CodeAnalysis.LanguageServer/xlf/LanguageServerResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pt_br, tr

source: Aborted!
cs: Přerušeno!
de: Abgebrochen!
ko: 중단됨!
pt_br: Anulado!

source: Attaching debugger to process {0}
cs: Připojování ladicího programu k procesu {0}
de: Debugger wird an Prozess "{0}" angefügt
es: Asociando el depurador al {0} de procesos
fr: Attachement du débogueur au processus {0}
ja: デバッガーをプロセス {0} にアタッチしています
ko: 프로세스 {0}에 디버거를 연결하는 중
pt_br: Anexar o depurador ao processo {0}
tr: Hata ayıklayıcısı işlemeye {0}

source: Building project...
cs: Vytváří se sestavení projektu…
de: Projekt wird erstellt...
ko: 프로젝트를 빌드하는 중...
pt_br: Compilando o projeto...

source: Canceled!
cs: Zrušeno!
de: Abgebrochen!
ko: 취소됨!
pt_br: Cancelado!

source: Client failed to attach the debugger
cs: Klientovi se nepodařilo připojit ladicí program
de: Fehler beim Anfügen des Debuggers durch den Client.
es: El cliente no pudo asociar el depurador
fr: Le client n’a pas pu attacher le débogueur
ja: クライアントはデバッガーをアタッチできませんでした
ko: 클라이언트가 디버거를 연결하지 못함
pt_br: Falha do cliente ao conectar o depurador
tr: İstemci hata ayıklayıcıyı ekleyemedi

source: Completed (re)load of all projects in {0}
cs: Dokončilo se (opětovné) načtení všech projektů v čase {0}
de: Abgeschlossenes (erneutes) Laden aller Projekte in {0}
es: Carga completada (re)de todos los proyectos en {0}
ko: {0}에 있는 모든 프로젝트의 (재)로드가 완료됨
pt_br: (Re)carregamento concluído de todos os projetos em {0}
tr: Projedeki tüm projelerin yüklemesi tamamlandı (yeniden {0}

source: Debugger attached
cs: Připojený ladicí program
es: Depurador asociado
fr: Débogueur attaché
ja: デバッガーがアタッチされました
tr: Hata ayıklayıcı eklendi

source: Debugging tests...
cs: Ladí se testy…
de: Debugging von Tests wird ausgeführt...
ko: 테스트를 디버그하는 중...
pt_br: Depurando testes...

source: Discovering tests...
cs: Hledají se testy…
de: Tests werden ermittelt...
ko: 테스트를 찾는 중...
pt_br: Detectando os testes...

source: Exception thrown while loading {0}
cs: Při načítání {0} došlo k výjimce
es: Se produjo una excepción al cargar {0}
tr: Yükleme sırasında özel durum {0}

source: Failed!
cs: Nezdařilo se!
de: Fehlgeschlagen!
ko: 실패함!
pt_br: Falhou!

source: Failed: {0}, Passed: {1}, Skipped: {2}, Total: {3}, Duration: {4}
cs: Neúspěšné: {0}, Úspěšné: {1}, Přeskočeno: {2}, Celkem: {3}, Doba trvání: {4}
de: Fehlgeschlagen: {0}, erfolgreich: {1}, übersprungen: {2}, gesamt: {3}, Dauer: {4}
es: Error: {0}, correcto: {1}, omitido: {2}, total: {3}, duración: {4}
fr: Échec : {0}, Réussite : {1}, Ignoré : {2}, Total : {3}, Durée : {4}
ja: 失敗: {0}、成功: {1}、スキップ: {2}、合計: {3}、期間: {4}
ko: 실패: {0}, 통과: {1}, 건너뜀: {2}, 합계: {3}, 기간: {4}
pt_br: Falhou: {0}, Passou: {1}, Ignorado: {2}, Total: {3}, Duração: {4}
tr: Başarısız: {0}, Başarılı: {1}, Atlandı: {2}, Toplam: {3}, Süre: {4}

source: Failed to read .runsettings file at {0}:{1}
cs: Čtení souboru .runsettings na {0} se nezdařilo:{1}
es: No se pudo leer el archivo .runsettings en {0}:{1}
fr: Échec de la lecture du fichier .runsettings à l'adresse {0} :{1}
ja: {0}:{1} の .runsettings ファイルを読み取れできませんでした
tr: Şu konumdaki .runsettings dosyası okunamadı: {0}:{1}

source: Failed to run restore on {0}
cs: Nepovedlo se spustit obnovení u {0}
de: Fehler beim Ausführen der Wiederherstellung auf "{0}"
es: No se pudo ejecutar la restauración en {0}
ko: {0}에서 복원을 실행하지 못함
pt_br: Falha ao executar a restauração em {0}
tr: Geri yükleme şu sunucuda çalıştırılamadı{0}

source: Found {0} tests in {1}
cs: Nalezené testy: {0} v {1}
de: In {1} wurden {0} Tests gefunden.
es: Se encontraron pruebas {0} en {1}
fr: Tests {0} trouvés dans {1}
ja: {1} で {0} テストが見つかりました
ko: {0} 테스트를 {1}에서 찾았습니다.
pt_br: Foram encontrados {0} testes em {1}
tr: Bu {0} testler {1}

source: Loading {0}...
cs: Načítá se {0}…
de: {0} wird geladen...
ko: {0} 로드 중...
pt_br: Carregando {0}...

source: Message
cs: Zpráva
de: Meldung
es: Mensaje
ja: メッセージ
ko: 메시지
pt_br: Mensagem
tr: İleti

source: No test methods found in requested range
cs: V požadovaném rozsahu se nenašly žádné testovací metody
de: Im angeforderten Bereich wurden keine Testmethoden gefunden.
es: No se encontraron métodos de prueba en el intervalo solicitado
fr: Méthodes de test introuvables dans la plage demandée
ja: 要求された範囲内にテスト メソッドが見つかりません
ko: 요청된 범위에서 테스트 메서드를 찾을 수 없습니다.
pt_br: Não foram encontrados métodos de teste no intervalo solicitado
tr: İstenen aralıkta test yöntemi bulunamadı

source: Nothing found to restore
cs: Nenašlo se nic, co by se dalo obnovit
de: Es wurde nichts zum Wiederherstellen gefunden.
es: No se encontró nada para restaurar
ko: 복원할 항목이 없음
pt_br: Nada encontrado para restaurar
tr: Geri yüklenecek öğe bulunamadı

source: Passed!
cs: Úspěch!
de: Erfolgreich!
ko: 통과함!
pt_br: Passou!

source: Project {0} has unresolved dependencies
cs: Projekt {0} obsahuje nevyřešené závislosti
de: Projekt {0} weist nicht aufgelöste Abhängigkeiten auf.
es: El proyecto {0} tiene dependencias sin resolver
ko: 프로젝트 {0}에 확인되지 않은 종속성이 있습니다.
pt_br: O projeto {0} tem dependências não resolvidas

# Project_0_loaded_by_CSharp_Dev_Kit
source: Project {0} loaded by C# Dev Kit
cs: Projekt {0} se načetl sadou C# Dev Kit
de: Das Projekt "{0}" von C# Dev Kit geladen.
es: Project {0} cargado por el Kit de desarrollo de C#
ko: C# Dev Kit에서 로드한 프로젝트 {0}
pt_br: Projeto {0} carregado pelo C# Dev Kit
tr: Proje {0} C# Geliştirme Seti tarafından yüklendi

# Projects_failed_to_load_because_MSBuild_could_not_be_found
source: Projects failed to load because the .NET Framework build tools could not be found. Try installing Visual Studio or the Visual Studio Build Tools package, or check the logs for details.
cs: Projekty se nepovedlo načíst, protože se nepovedlo najít nástroje pro sestavení .NET Framework. Zkuste nainstalovat Visual Studio nebo balíček Visual Studio Build Tools, nebo si projděte podrobnosti v protokolech.
de: Projekte konnten nicht geladen werden, weil die .NET Framework-Buildtools nicht gefunden wurden. Versuchen Sie, Visual Studio oder das Visual Studio Build Tools-Paket zu installieren, oder überprüfen Sie die Protokolle auf Details.
es: No se pudieron cargar los proyectos porque no se encontraron las herramientas de compilación .NET Framework. Intente instalar Visual Studio o el paquete Visual Studio Build Tools, o compruebe los registros para obtener más detalles.
ko: .NET Framework 빌드 도구를 찾을 수 없으므로 프로젝트를 로드하지 못했습니다. Visual Studio 또는 Visual Studio Build Tools 패키지를 설치하거나 로그에서 자세한 내용을 확인하세요.
pt_br: Os projetos não foram carregados porque as ferramentas de compilação do .NET Framework não puderam ser encontradas. Tente instalar o Visual Studio ou o pacote de Ferramentas de Build do Visual Studio, ou verifique os logs para obter detalhes.
tr: Derleme araçları bulunamadığından .NET Framework projeler yüklenemedi. Bu paketi Visual Studio pakete Visual Studio Derleme Araçları deneyin veya ayrıntılar için günlüklere bakın.

# Projects_failed_to_load_because_Mono_could_not_be_found
source: Projects failed to load because the Mono could not be found. Ensure that Mono and MSBuild are installed, and check the logs for details.
cs: Načtení projektů se nezdařilo, protože se nenašel objekt Mono. Ujistěte se, že jsou nainstalované Mono a MSBuild. Podrobnosti najdete v protokolech.
de: Die Projekte konnten nicht geladen werden, weil Mono nicht gefunden wurde. Stellen Sie sicher, dass Mono und MSBuild installiert sind, und überprüfen Sie die Protokolle auf Details.
es: No se pudieron cargar los proyectos porque no se encontró Mono. Asegúrese de que Mono y MSBuild están instalados y compruebe los registros para obtener más detalles.
ko: Mono를 찾을 수 없어 프로젝트를 로드하지 못했습니다. Mono 및 MSBuild가 설치되어 있는지 확인하고 로그에서 자세한 내용을 확인하세요.
pt_br: Os projetos não foram carregados porque o Mono não pôde ser encontrado. Certifique-se de que o Mono e o MSBuild estejam instalados e verifique os logs para obter detalhes.
tr: Mono bulunamadığından projeler yüklenemedi. Mono ve MSBuild'in yüklü olduğundan emin olun ve ayrıntılar için günlüklere bakın.

source: Restore
cs: Obnovit
de: Wiederherstellen
es: Restaurar
ko: 복원
pt_br: Restaurar
tr: Geri Yükle

source: Restore complete
cs: Obnovování se dokončilo
de: Wiederherstellung abgeschlossen
ko: 복원 완료
pt_br: Restauração concluída

source: Restore started
cs: Obnovení bylo zahájeno
de: Wiederherstellung gestartet
ko: 복원 시작됨
pt_br: Restauração iniciada

source: Restoring {0}
cs: Obnovování {0}
de: "{0}" wird wiederhergestellt
ko: {0}을(를) 복원하는 중
pt_br: Restaurando {0}

source: Running dotnet restore on {0}
cs: Spouští se dotnet restore u {0}
de: "dotnet restore" wird auf "{0}" ausgeführt
ko: {0}에서 dotnet restore를 실행하는 중
pt_br: Executando dotnet restore em {0}

source: Running tests...
cs: Spouštějí se testy…
de: Tests werden ausgeführt...
ko: 테스트를 실행하는 중...
pt_br: Executando os testes...

source: .runsettings file does not exist at {0}
cs: Soubor .runsettings v {0} neexistuje.
de: Die RUNSETTINGS-Datei ist unter {0} nicht vorhanden.
es: El archivo .runsettings no existe en {0}
fr: Le fichier .runsettings n’existe pas sur {0}
ja: {0} に .runsettings ファイルが存在しません
ko: .runsettings 파일이 {0}에 없습니다.
pt_br: O arquivo .runsettings não existe em {0}
tr: .runsettings dosyası şu konumda yok: {0}

# Show_csharp_logs
source: Show C# logs
cs: Zobrazit protokoly jazyka C#
de: C#-Protokolle anzeigen
es: Mostrar registros de C#
fr: Afficher les journaux C#
ja: C# ログの表示
ko: C# 로그 표시
pt_br: Mostrar logs de C#
tr: C# günlüklerini göster

source: Stack Trace
cs: Trasování zásobníku
de: Stapelüberwachung
es: Seguimiento de la pila
fr: Trace de la pile
ja: スタック トレース
ko: 스택 추적
pt_br: Rastreamento de pilha
tr: Yığın İzleme

source: Starting test discovery
cs: Spouštění zjišťování testů…
de: Testermittlung wird gestartet
ko: 테스트 검색을 시작하는 중
pt_br: Iniciando a detecção de testes

source: Starting test run
cs: Spouštění testovacího běhu…
de: Testlauf wird gestartet
es: Iniciando serie de pruebas
fr: Démarrage de la série de tests
ja: テストの実行を開始しています
ko: 테스트 실행을 시작하는 중
pt_br: Iniciando a execução de teste
tr: Test çalıştırması başlatılıyor

source: Successfully completed load of {0}
cs: Načtení {0} se úspěšně dokončilo
de: Laden von "{0}" erfolgreich abgeschlossen
es: Carga de {0} completada correctamente
ko: {0}의 로드가 완료됨
pt_br: Carregamento de {0} concluído com sucesso
tr: Dosya yüklemesi başarıyla {0}

source: Summary
cs: Souhrn
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
ja: 概要
ko: 요약
pt_br: Resumo
tr: Özet

source: Test discovery aborted
cs: Zjišťování testů se přerušilo
de: Testermittlung abgebrochen
es: Detección de pruebas anulada
fr: Test de découverte abandonné
ja: テスト検出が中止されました
ko: 테스트 검색이 중단됨
pt_br: Detecção de teste abortada
tr: Test bulma durduruldu

# Test_run_error
source: Test run error: {0}
cs: Chyba testovacího běhu: {0}
de: Testlauffehler: {0}
es: Error de serie de pruebas: {0}
fr: Erreur de série de tests : {0}
ja: テストの実行エラー: {0}
ko: 테스트 실행 오류: {0}
pt_br: Erro de execução de teste: {0}
tr: Test çalıştırması hatası: {0}

source: There were problems loading project {0}. See log for details.
cs: Při načítání projektu {0} došlo k potížím. Podrobnosti najdete v protokolu.
de: Beim Laden des Projekts "{0}" sind Probleme aufgetreten. Weitere Informationen finden Sie im Protokoll.
es: Hubo problemas al cargar el {0} del proyecto. Consulte el registro para obtener más detalles.
fr: Des problèmes se sont produits lors du chargement des {0} du projet. Pour plus d’informations, consultez le journal.
ja: プロジェクト {0} の読み込み中に問題が発生しました。詳細については、ログを参照してください。
ko: {0} 프로젝트를 로드하는 동안 문제가 발생했습니다. 자세한 내용은 로그를 참조하세요.
pt_br: Houve problemas ao carregar o projeto {0}. Consulte o log para obter detalhes.
tr: Proje ayarları yüklenirken sorun {0}. Ayrıntılar için günlüğe bakın.

source: Using .runsettings file at {0}
cs: Použití souboru .runsettings v {0}
de: Verwenden der RUNSETTINGS-Datei unter {0}
es: Uso del archivo .runsettings en {0}
fr: Utilisation du fichier .runsettings sur {0}
ja: {0} の runsettings ファイルを使用しています
ko: {0}에서 runsettings 파일을 사용하는 중
pt_br: Usando o arquivo .runsettings em {0}
tr: Şu konumdaki .runsettings dosyası kullanılıyor: {0}

source: Exception thrown: {0}
de: Ausgelöste Ausnahme: „{0}“
ko: 예외 throw됨: {0}
pt_br: Exceção gerada: {0}

source: Failed to read .runsettings file at {0}:{1}
de: Fehler beim Lesen der RUNSETTINGS-Datei unter {0}:{1}
ko: {0}:{1}에서 .runsettings 파일을 읽지 못했습니다.
pt_br: Falha ao ler o arquivo .runsettings em {0}:{1}

# There_were_problems_loading_solution_0_See_log_for_details
source: There were errors loading solution {0}. See log for details.
fr: Des erreurs se sont produites lors du chargement de la solution {0}. Pour plus d’informations, consultez le journal.
ja: ソリューション {0} の読み込み中にエラーが発生しました。詳細については、ログを参照してください。

source: There were problems loading your projects. See log for details.
fr: Des problèmes se sont produits lors du chargement de vos projets. Pour plus d’informations, consultez le journal.
ja: プロジェクトの読み込み中に問題が発生しました。詳細については、ログを参照してください。
