Repository: dotnet/roslyn
Catalog: src/Features/CSharp/Portable/SyncedSource/FileBasedPrograms/xlf/FileBasedProgramsResources.*.xlf
Languages: cs, fr, it, ko, ru, tr, zh_hant

# CannotConvertDirective
source: Some directives cannot be converted. Run the file to see all compilation errors. Specify '--force' to convert anyway.
cs: Některé direktivy nelze převést. Spuštěním souboru zobrazíte všechny chyby kompilace. Zadejte „--force“, pokud chcete přesto provést převod.
fr: Vous ne pouvez pas convertir certaines directives. Exécutez le fichier pour voir toutes les erreurs de compilation. Spécifiez « --force » pour convertir quand même.
it: Non è possibile convertire alcune direttive. Eseguire il file per visualizzare tutti gli errori di compilazione. Specificare '--force' per eseguire comunque la conversione.
ko: 일부 지시문을 변환할 수 없습니다. 파일을 실행하여 모든 컴파일 오류를 확인하세요. 변환을 강제로 진행하려면 '--force'를 지정하세요.
ru: Некоторые директивы невозможно преобразовать. Запустите файл, чтобы увидеть все ошибки компиляции. Укажите параметр "--force", чтобы выполнить преобразование, невзирая на ошибки.
tr: Bazı yönergeler dönüştürülemez. Tüm derleme hatalarını görmek için dosyayı çalıştırın. Yine de dönüştürmek için '--force' belirtin.
zh_hant: 無法轉換某些指示詞。執行檔案以查看所有編譯錯誤。指定 '--force' 以繼續轉換。

# CouldNotFindAnyProjectInDirectory
source: Could not find any project in `{0}`.
cs: V {0} se nenašel žádný projekt.
fr: Projet introuvable dans '{0}'.
it: Non è stato trovato alcun progetto in `{0}`.
ko: '{0}'에서 프로젝트를 찾을 수 없습니다.
ru: Не удалось найти проекты в "{0}".
tr: `{0}` içinde proje bulunamadı.
zh_hant: 在 `{0}` 中找不到任何專案。

# CouldNotFindProjectOrDirectory
source: Could not find project or directory `{0}`.
cs: Nenašel se projekt ani adresář {0}.
fr: Projet ou répertoire '{0}' introuvable.
it: Non sono stati trovati progetti o directory `{0}`.
ko: 프로젝트 또는 디렉터리 {0}을(를) 찾을 수 없습니다.
ru: Не удалось найти проект или каталог "{0}".
tr: `{0}` projesi veya dizini bulunamadı.
zh_hant: 找不到專案或目錄 `{0}`。

# DirectiveError
source: error
cs: chyba
fr: erreur
it: errore
ko: 오류
ru: ошибка
tr: hata
zh_hant: 錯誤

# DuplicateDirective
source: Duplicate directives are not supported: {0}
cs: Duplicitní direktivy nejsou podporovány: {0}
fr: Les directives dupliquées ne sont pas prises en charge : {0}
it: Le direttive duplicate non supportate: {0}
ko: 중복 지시문은 지원되지 않습니다. {0}
ru: Повторяющиеся директивы не поддерживаются: {0}
tr: Yinelenen yönergeler desteklenmez: {0}
zh_hant: 不支援重複的指示詞: {0}

# EmptyTempPath
source: Unable to determine a temporary directory path. Consider configuring the TEMP environment variable on Windows or local app data folder on Unix.
cs: Nelze určit cestu k dočasnému adresáři. Zvažte konfiguraci proměnné prostředí TEMP v systému Windows nebo místní datové složky aplikace v systému Unix.
fr: Impossible de déterminer un chemin d’accès pour le répertoire temporaire. Nous vous recommandons de configurer la variable d’environnement TEMP sous Windows ou le dossier des données d’application locale sous Unix.
it: Non è possibile determinare un percorso per la directory temporanea. Considerare la configurazione della variabile di ambiente TEMP in Windows o della cartella dei dati locali dell'app in Unix.
ko: 임시 디렉터리 경로를 확인할 수 없습니다. Windows에서는 TEMP 환경 변수를, Unix에서는 로컬 앱 데이터 폴더를 설정하는 것이 좋습니다.
ru: Не удалось определить путь к временному каталогу. Рассмотрите возможность настроить переменную среды TEMP в Windows или папку локальных данных приложений в Unix.
tr: Geçici dizin yolu saptanamıyor. Windows'da TEMP ortam değişkenini veya Unix'te yerel uygulama verileri klasörünü yapılandırmayı göz önünde bulundurun.
zh_hant: 無法判斷暫存 目錄路徑。考慮在 Windows 上或 Unix 上的本機應用程式資料資料資料夾上設定 TEMP 環境變數。

# InvalidDirectiveName
source: The directive should contain a name without special characters and an optional value separated by '{1}' like '#:{0} Name{1}Value'.
cs: Direktiva by měla obsahovat název bez speciálních znaků a volitelnou hodnotu oddělenou znakem {1}, například #:{0} Název{1}Hodnota.
fr: La directive dans doit contenir un nom sans caractères spéciaux et une valeur facultative séparée par « {1} » comme « # :{0} Nom{1}Valeur ».
it: La direttiva deve contenere un nome senza caratteri speciali e un valore facoltativo delimitato da '{1}' come '#:{0}Nome {1}Valore'.
ko: 지시문에는 특수 문자가 없는 이름과 '#:{0} 이름{1}값'과 같이 '{1}'(으)로 구분된 선택적 값이 포함되어야 합니다.
ru: Директива должна содержать имя без специальных символов и необязательное значение, разделенные символом-разделителем "{1}", например "#:{0} Имя{1}Значение".
tr: Yönerge, özel karakterler içermeyen bir ad ve ‘#:{0} Ad{1}Değer’ gibi '{1}' ile ayrılmış isteğe bağlı bir değer içermelidir.
zh_hant: 指示詞應包含不含特殊字元的名稱，以及 '{1}' 分隔的選用值，例如 '#:{0} Name{1}Value'。

# InvalidProjectDirective
source: The '#:project' directive is invalid: {0}
cs: Direktiva #:project je neplatná: {0}
fr: La directive « #:project » n’est pas valide : {0}
it: La direttiva '#:project' non è valida: {0}
ko: '#:p roject' 지시문이 잘못되었습니다. {0}
ru: Недопустимая директива "#:project": {0}
tr: ‘#:project’ yönergesi geçersizdir: {0}
zh_hant: '#:project' 指示詞無效: {0}

# MissingDirectiveName
source: Missing name of '{0}'.
cs: Chybí název pro: {0}.
fr: Nom manquant pour « {0} ».
it: Manca il nome di '{0}'.
ko: '{0}' 이름이 없습니다.
ru: Отсутствует имя "{0}".
tr: '{0}' adı eksik.
zh_hant: 缺少 '{0}' 的名稱。

# MoreThanOneProjectInDirectory
source: Found more than one project in `{0}`. Specify which one to use.
cs: V {0} se našlo několik projektů. Vyberte, který z nich chcete použít.
fr: Plusieurs projets dans '{0}'. Spécifiez celui à utiliser.
it: Sono stati trovati più progetti in `{0}`. Specificare quello da usare.
ko: '{0}'에서 프로젝트를 두 개 이상 찾았습니다. 사용할 프로젝트를 지정하세요.
ru: Найдено несколько проектов в "{0}". Выберите один.
tr: `{0}` içinde birden fazla proje bulundu. Hangisinin kullanılacağını belirtin.
zh_hant: 在 `{0}` 中找到多個專案。請指定要使用的專案。

# PropertyDirectiveInvalidName
source: Invalid property name: {0}
cs: Neplatný název vlastnosti: {0}
fr: Nom de propriété non valide : {0}
it: Nome proprietà non valido: {0}
ko: 잘못된 속성 이름: {0}
ru: Недопустимое имя свойства: {0}
tr: Geçersiz özellik adı: {0}
zh_hant: 屬性名稱無效: {0}

# PropertyDirectiveMissingParts
source: The property directive needs to have two parts separated by '=' like '#:property PropertyName=PropertyValue'.
cs: Direktiva property musí mít dvě části oddělené znakem =, například #:property PropertyName=PropertyValue.
fr: La directive de propriété doit avoir deux parties séparées par '=' comme '#:property PropertyName=PropertyValue'.
it: La direttiva di proprietà deve avere due parti delimitate da '=', come '#:property PropertyName=PropertyValue'.
ko: property 지시문에는 '#:property PropertyName=PropertyValue'와 같이 '='로 구분된 두 부분이 있어야 합니다.
ru: Директива свойства должна иметь две части, разделенные символом "=", например "#:property PropertyName=PropertyValue".
tr: Özellik yönergesi, ‘#:property PropertyName=PropertyValue’ gibi ‘=’ ile ayrılmış iki bölümden oluşmalıdır.
zh_hant: 屬性指示詞必須有兩個部分，其以 '=' 分隔，例如 '#:property PropertyName=PropertyValue'。

# QuoteInDirective
source: Directives currently cannot contain double quotes (").
cs: Direktivy v současné době nemůžou obsahovat dvojité uvozovky (").
fr: Les directives ne peuvent actuellement pas contenir de guillemets doubles (").
it: Le direttive attualmente non possono contenere virgolette doppie (").
ko: 지시문은 현재 큰따옴표(")를 포함할 수 없습니다.
ru: В директивах пока нельзя использовать двойные кавычки (").
tr: Yönergeler şu anda çift tırnak (") içeremez.
zh_hant: 指令目前不能包含雙引號 (")。

# StaticGraphRestoreNotSupported
source: Static graph restore is not supported for file-based apps. Remove the '#:property'.
cs: Statické obnovení grafu se pro souborové aplikace nepodporuje. Odeberte #:property.
fr: La restauration de graphique statique n’est pas prise en charge pour les applications basées sur des fichiers. Supprimer la « #:property ».
it: Il ripristino statico del grafo non è supportato per le app basate su file. Rimuovere '#:property'.
ko: 정적 그래프 복원은 파일 기반 앱에서 지원되지 않습니다. '#:property'를 제거합니다.
ru: Восстановление статического графа не поддерживается для приложений на основе файлов. Удалите "#:property".
tr: Dosya tabanlı uygulamalar için statik grafik geri yükleme desteklenmemektedir. ‘#:property’i kaldırın.
zh_hant: 檔案型應用程式不支援靜態圖表還原。移除 ''#:property'。

# UnrecognizedDirective
source: Unrecognized directive '{0}'.
cs: Nerozpoznaná direktiva {0}.
fr: Directive « {0} » non reconnue.
it: Direttiva non riconosciuta '{0}'.
ko: 인식할 수 없는 지시문 '{0}'입니다.
ru: Нераспознанная директива "{0}".
tr: Tanınmayan yönerge '{0}'.
zh_hant: 無法識別的指示詞 '{0}'。
