Repository: dotnet/roslyn
Catalog: src/Dependencies/Collections/Internal/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidOperation_ConcurrentOperationsNotSupported
source: Operations that change non-concurrent collections must have exclusive access. A concurrent update was performed on this collection and corrupted its state. The collection's state is no longer correct.
cs: Operace, které mění nesouběžné kolekce, musí mít výhradní přístup. U této kolekce se provedla souběžná aktualizace, která poškodila její stav. Stav kolekce už není správný.
de: Vorgänge, die nicht parallele Sammlungen ändern, müssen exklusiven Zugriff besitzen. Für diese Sammlung wurde ein paralleles Update durchgeführt, das einen Statusfehler ausgelöst hat. Der Status der Sammlung ist nicht mehr korrekt.
es: Las operaciones que cambian las colecciones no simultáneas deben tener acceso exclusivo. Se realizó una actualización simultánea en esta colección y se dañó su estado. El estado de la colección ya no es correcto.
fr: Les opérations qui changent des collections non concurrentes doivent avoir un accès exclusif. Une mise à jour simultanée a été effectuée sur cette collection et l'a endommagée. L'état de la collection n'est plus correct.
it: Le operazioni che modificano raccolte non simultanee devono avere accesso esclusivo. Un aggiornamento simultaneo eseguito su questa raccolta ne ha danneggiato lo stato. Lo stato della raccolta non è più corretto.
ja: 非同時実行コレクションを変更する操作には、排他アクセスが必要です。このコレクションに対して同時更新が実行され、その状態が破壊されました。コレクションの状態は正しくなくなりました。
ko: 비동시 컬렉션을 변경하는 작업에는 단독 액세스 권한이 있어야 합니다. 이 컬렉션에 대해 동시 업데이트가 수행되어 해당 상태가 손상되었습니다. 컬렉션의 상태가 더 이상 올바르지 않습니다.
pl: Operacje, które zmieniają niewspółbieżne kolekcje, muszą mieć wyłączny dostęp. Wykonano współbieżną aktualizację tej kolekcji, która uszkodziła jej stan. Stan kolekcji nie jest już prawidłowy.
pt_br: As operações que alteram coleções não simultâneas precisam ter acesso exclusivo. Uma atualização simultânea foi executada nesta coleção e corrompeu o estado dela. O estado da coleção não está mais correto.
ru: Операции, которые изменяют коллекции, не обрабатываемые параллельно, должны иметь монопольный доступ. В этой коллекции было выполнено параллельное обновление, и ее состояние повреждено. Состояние коллекции больше не является достоверным.
tr: Eşzamanlı olmayan koleksiyonları değiştiren işlemler özel erişime sahip olmalıdır. Bu koleksiyonda eşzamanlı bir güncelleştirme gerçekleştirildi ve durumu bozuldu. Koleksiyonun durumu artık doğru değil.
zh_hans: 更改非并发集合的操作必须具有独占访问权限才能成功。某操作对此集合执行了并发更新，并已损坏其状态。该集合的状态不再正确。
zh_hant: 變更非並行集合的作業必須具有獨佔存取權。並行更新已在此集合上執行，並已損毀其狀態。集合的狀態已不再正確。

# InvalidOperation_EnumFailedVersion
source: Collection was modified; enumeration operation may not execute.
cs: Kolekce byla upravena. Operace výčtu pravděpodobně nebude spuštěna.
de: Die Sammlung wurde geändert. Der Enumerationsvorgang kann möglicherweise nicht ausgeführt werden.
es: Colección modificada; puede que no se ejecute la operación de enumeración.
fr: La collection a été modifiée ; l'opération d'énumération peut ne pas s'exécuter.
it: La raccolta è stata modificata. L'operazione di enumerazione potrebbe non essere eseguita.
ja: コレクションが変更されました。列挙操作は実行されない可能性があります。
ko: 컬렉션이 수정되었습니다. 열거 작업이 실행되지 않을 수도 있습니다.
pl: Zmodyfikowano kolekcję. Nie można wykonać operacji wyliczania.
pt_br: A coleção foi modificada. A operação de enumeração pode não ser executada.
ru: Коллекция была изменена; невозможно выполнить операцию перечисления.
tr: Koleksiyon değiştirildi; sabit listesi işlemi yürütülemeyebilir.
zh_hans: 集合已修改；可能无法执行枚举操作。
zh_hant: 集合已修改; 列舉作業可能尚未執行。

# InvalidOperation_EnumOpCantHappen
source: Enumeration has either not started or has already finished.
cs: Výčet buď nebyl spuštěn, nebo již byl dokončen.
de: Entweder wurde die Enumeration noch nicht gestartet oder bereits beendet.
es: La enumeración no ha empezado o ya ha finalizado.
fr: L'énumération n'a pas commencé ou est déjà terminée.
it: Enumerazione non avviata o già terminata.
ja: 列挙が開始していないか、または既に完了しています。
ko: 열거가 시작되지 않았거나 이미 완료되었습니다.
pl: Wyliczanie nie zostało uruchomione lub zostało już zakończone.
pt_br: A enumeração não foi iniciada ou já foi concluída.
ru: Перечисление не запущено или уже завершено.
tr: Sabit listesi işlemi başlamamış ya da zaten bitmiş.
zh_hans: 枚举尚未开始或者已经结束。
zh_hant: 列舉尚未啟動或已經完成。

# InvalidOperation_IComparerFailed
source: Failed to compare two elements in the array.
cs: Porovnání dvou prvků v poli se nezdařilo.
de: Fehler beim Vergleichen von zwei Elementen im Array.
es: No se pudieron comparar dos elementos en la matriz.
fr: Impossible de comparer deux éléments dans le tableau.
it: Non è stato possibile confrontare due elementi nella matrice.
ja: 配列にある 2 つの要素を比較できませんでした。
ko: 배열의 두 요소를 비교하지 못했습니다.
pl: Nie można porównać dwóch elementów w tablicy.
pt_br: Falha ao comparar dois elementos na matriz.
ru: Сбой при сравнении двух элементов массива.
tr: Dizideki iki öğe karşılaştırılamadı.
zh_hans: 未能比较数组中的两个元素。
zh_hant: 無法比較陣列中的兩個元素。

# NotSupported_FixedSizeCollection
source: Collection was of a fixed size.
cs: Velikost kolekce byla pevně stanovena.
de: Die Liste hatte eine feste Größe.
es: La colección tiene un tamaño fijo.
fr: La collection était d'une taille fixe.
it: La raccolta è a dimensione fissa.
ja: コレクションは固定サイズです。
ko: 컬렉션이 고정 크기입니다.
pl: Rozmiar kolekcji jest stały.
pt_br: Coleção tinha tamanho fixo.
ru: Коллекция имела фиксированный размер.
tr: Koleksiyon sabit bir boyuta sahipti.
zh_hans: 集合的大小是固定的。
zh_hant: 集合屬於固定大小。

# NotSupported_KeyCollectionSet
source: Mutating a key collection derived from a dictionary is not allowed.
cs: Mutace kolekce klíčů odvozené od slovníku nejsou povoleny.
de: Das Mutieren einer von einem Wörterbuch abgeleiteten Schlüsselsammlung ist nicht zulässig.
es: No se permite cambiar una colección de clave derivada de un diccionario.
fr: La mutation d'une collection de clés dérivée d'un dictionnaire n'est pas autorisée.
it: Impossibile cambiare una raccolta di chiavi derivata da un dizionario.
ja: ディクショナリから派生したキー コレクションの変化は許可されていません。
ko: 사전에서 파생된 키 컬렉션은 변경할 수 없습니다.
pl: Mutacja kolekcji kluczy pochodzącej od słownika nie jest dozwolona.
pt_br: A mutação de uma coleção de chaves derivada de um dicionário não é permitida.
ru: Изменение коллекции ключей, полученных из словаря, запрещено.
tr: Bir sözlükten türetilmiş anahtar koleksiyonunu değiştirilmesine izin verilmiyor.
zh_hans: 不允许对从字典派生的键集合进行转变。
zh_hant: 不允許變動衍生自字典的索引鍵集合。

# NotSupported_ValueCollectionSet
source: Mutating a value collection derived from a dictionary is not allowed.
cs: Mutace kolekce hodnot odvozené od slovníku nejsou povoleny.
de: Das Mutieren einer von einem Wörterbuch abgeleiteten Wertsammlung ist nicht zulässig.
es: No se permite variar una colección de valores derivada de un diccionario.
fr: La mutation d'une collection de valeurs dérivée d'un dictionnaire n'est pas autorisée.
it: Impossibile cambiare una raccolta di valori derivata da un dizionario.
ja: ディクショナリから派生した値コレクションの変化は許可されていません。
ko: 사전에서 파생된 값 컬렉션은 변경할 수 없습니다.
pl: Mutacja kolekcji wartości pochodzącej od słownika nie jest dozwolona.
pt_br: A mutação de uma coleção de valores derivada de um dicionário não é permitida.
ru: Изменение коллекции значений, полученных из словаря, запрещено.
tr: Bir sözlükten türetilmiş değer koleksiyonunun değiştirilmesine izin verilmiyor.
zh_hans: 不允许对从字典派生的值集合进行转变。
zh_hant: 不允許變動衍生自字典的值集合。

# Rank_MustMatch
source: The specified arrays must have the same number of dimensions.
cs: Určená pole musí mít stejný počet rozměrů.
de: Die angegebenen Arrays müssen die gleiche Dimensionsanzahl aufweisen.
es: Las matrices especificadas deben tener las mismas dimensiones.
fr: Les tableaux spécifiés doivent avoir le même nombre de dimensions.
it: Le matrici specificate devono avere lo stesso numero di dimensioni.
ja: 指定された配列の次元数は同じでなければなりません。
ko: 지정한 배열의 차수가 같아야 합니다.
pl: Liczba wymiarów musi być taka sama dla wszystkich określonych tablic.
pt_br: As matrizes especificadas devem ter o mesmo número de dimensões.
ru: Число измерений заданных массивов должно совпадать.
tr: Belirtilen diziler aynı sayıda boyuta sahip olmalıdır.
zh_hans: 指定的数组必须具有相同的维数。
zh_hant: 指定的陣列必須擁有相同維度數。

# ArgumentOutOfRange_Index
source: Index was out of range. Must be non-negative and less than the size of the collection.
es: El índice estaba fuera del intervalo. Debe ser un valor no negativo e inferior al tamaño de la colección.
fr: L'index était hors limites. Il ne doit pas être négatif et doit être inférieur à la taille de la collection.
tr: Dizin aralık dışındaydı. Negatif bir değer olmamalı ve koleksiyonun boyutundan daha küçük olmalıdır.
zh_hant: 索引超出範圍。必須為非負數且小於集合的大小。

# Argument_InvalidArrayType
source: Target array type is not compatible with the type of items in the collection.
es: El tipo de matriz de destino no es compatible con el tipo de elementos de la colección.
fr: Le type de tableau cible n'est pas compatible avec le type des éléments de la collection.
tr: Hedef dizi türü, koleksiyondaki öğelerin türüyle uyumlu değil.
zh_hant: 目標陣列類型與集合中項目的類型不相容。
