Repository: dotnet/roslyn
Catalog: src/Dependencies/Collections/Internal/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Arg_ArrayPlusOffTooSmall
source: Destination array is not long enough to copy all the items in the collection. Check array index and length.
cs: Cílové pole není dostatečně dlouhé, aby bylo možné zkopírovat všechny položky v kolekci. Zkontrolujte index a délku pole.
de: Das Zielarray ist nicht lang genug, um alle Elemente in der Sammlung zu kopieren. Prüfen Sie den Index und die Länge des Arrays.
es: La matriz de destino no es lo suficientemente larga para copiar todos los elementos de la colección. Compruebe el índice y la longitud de la matriz.
fr: La taille du tableau de destination ne permet pas de copier tous les éléments de la collection. Vérifiez l'index et la longueur du tableau.
it: La lunghezza della matrice di destinazione non è sufficiente per copiare tutti gli elementi della raccolta. Controllare l'indice e la lunghezza della matrice.
ja: ターゲット配列の長さが不足しているため、コレクション内のすべての項目をコピーできません。配列のインデックスと長さをご確認ください。
ko: 대상 배열이 컬렉션의 모든 항목을 복사하기에 충분히 길지 않습니다. 배열 인덱스와 길이를 확인하세요.
pl: Tablica docelowa ma zbyt małą długość, aby móc skopiować wszystkie elementy kolekcji. Sprawdź indeks tablicy i jej długość.
pt_br: A matriz de destino não é longa o suficiente para copiar todos os itens da coleção. Verifique o índice e o tamanho da matriz.
ru: Длина конечного массива недостаточна для копирования всех элементов коллекции. Проверьте индекс и длину массива.
tr: Hedef dizi, koleksiyondaki tüm öğeleri kopyalamak için yeterince uzun değil. Dizi dizinini ve uzunluğunu denetleyin.
zh_hans: 目标数组不够长，无法复制集合中的所有项。请检查数组索引和长度。
zh_hant: 目的地陣列的長度不足以複製集合中的所有項目。請檢查陣列索引以及長度。

# Arg_BogusIComparer
source: Unable to sort because the IComparer.Compare() method returns inconsistent results. Either a value does not compare equal to itself, or one value repeatedly compared to another value yields different results. IComparer: '{0}'.
cs: Řazení není možné, protože metoda IComparer.Compare() vrací nekonzistentní výsledky. Buď není výsledkem porovnání hodnoty samé se sebou rovnost, nebo opakované porovnání jedné hodnoty s jinou hodnotou vrací různé výsledky. IComparer: {0}
de: Sortieren nicht möglich, da die IComparer.Compare()-Methode inkonsistente Ergebnisse zurückgibt. Entweder ist ein Wert nicht mit sich identisch, oder ein wiederholt mit einem anderen Wert verglichener Wert gibt verschiedene Ergebnisse aus. IComparer: '{0}'.
es: No se puede ordenar porque el método IComparer.Compare() devuelve resultados incoherentes. No se compara un valor igual a sí mismo, o bien un valor comparado repetidamente con otro proporciona resultados diferentes. IComparer: '{0}'.
fr: Impossible d'effectuer le tri, car la méthode IComparer.Compare() retourne des résultats incohérents. Une valeur comparée n'est pas égale à elle-même ou une valeur comparée de manière répétée à une autre valeur donne des résultats différents. IComparer : '{0}'.
it: Impossibile eseguire l'ordinamento. Il metodo IComparer.Compare() restituisce risultati incoerenti. Un valore non viene confrontato uguale a se stesso oppure un valore confrontato ripetutamente con un altro valore restituisce risultati diversi. IComparer: '{0}'.
ja: IComparer.Compare() メソッドから矛盾する結果が返されたため、並べ替えできません。値をそれ自体と比較したときに等しい結果にならないか、またはある値を別の値と繰り返し比較したときに異なる結果が生じます。IComparer: '{0}'。
ko: IComparer.Compare() 메서드가 일관성 없는 결과를 반환하므로 정렬할 수 없습니다. 값이 자신과 같은지 비교하지 않거나 한 값이 다른 값과 반복해서 비교되어 다른 결과를 생성합니다. IComparer: '{0}'.
pl: Nie można wykonać sortowania, ponieważ metoda IComparer.Compare() zwraca niespójne wyniki. Albo porównanie wartości z samą sobą nie daje w wyniku równości, albo jedna wartość porównywana wielokrotnie z inną wartością daje różne wyniki. IComparer: „{0}”.
pt_br: Não é possível classificar porque o método IComparer.Compare() retorna resultados inconsistentes. Um valor não se compara igual a ele mesmo ou um valor comparado repetidas vezes a outro valor apresenta resultados diferentes. IComparer: '{0}'.
ru: Не удалось выполнить сортировку, поскольку метод IComparer.Compare() вернул несовместимые результаты. Значение не равно самому себе при сравнении, либо многократное сравнение одного значения с другим значением дает разные результаты. IComparer: "{0}".
tr: IComparer.Compare() metodu tutarsız sonuçlar döndürdüğünden sıralanamıyor. Bir değer kendisiyle karşılaştırıldığında eşit olmuyor veya bir değer başka bir değerle art arda karşılaştırıldığında farklı sonuçlar oluşuyor. IComparer: '{0}'.
zh_hans: 无法排序，原因是 IComparer.Compare() 方法返回不一致的结果。一个值与本身比较不相等，或者一个值与另外一个值重复比较生成不同的结果。IComparer:“{0}”。
zh_hant: 無法排序，因為 IComparer.Compare() 方法傳回不一致的結果。可能是某個值與自己比較卻不相等，或是一個值反覆與另一個值比較但產生不同的結果。IComparer: '{0}'。

# Arg_HTCapacityOverflow
source: Hashtable's capacity overflowed and went negative. Check load factor, capacity and the current size of the table.
cs: Kapacita tabulky hash přetekla a přešla do záporných hodnot. Zkontrolujte faktor zaplnění, kapacitu a aktuální velikost tabulky.
de: Die Kapazität einer Hashtabelle ist negativ, da sie übergelaufen ist. Überprüfen Sie den Lastfaktor, die Kapazität und die aktuelle Tabellengröße.
es: Se ha desbordado la capacidad de la tabla hash (actualmente es negativa). Compruebe el factor de carga, la capacidad y el tamaño actual de la tabla.
fr: La capacité de la table de hachage a été dépassée et est devenue négative. Contrôlez le facteur de chargement, la capacité et la taille actuelle de la table.
it: Overflow capacità hashtable. Il valore è diventato negativo. Controllare la capacità, il fattore di carico e la dimensione corrente della tabella.
ja: ハッシュテーブルの容量がオーバーフローし、負の値になりました。テーブルの占有率と容量、および現在のサイズを確認してください。
ko: 해시 테이블 용량에 오버플로가 발생하여 음수가 되었습니다. 로드 비율, 용량 및 테이블의 현재 크기를 확인하십시오.
pl: Nastąpiło przepełnienie tabeli generowania skrótu i wystąpiły wartości ujemne. Sprawdź współczynnik i pojemność ładowania oraz bieżący rozmiar tabeli.
pt_br: A capacidade da tabela de hash estourou e se tornou negativa. Verifique o fator de carga, a capacidade e o tamanho atual da tabela.
ru: Хэш-таблица переполнена и ее емкость стала отрицательной. Проверьте коэффициент загрузки, емкость и текущий размер таблицы.
tr: Karma tablosunun kapasitesi taştı ve negatif oldu. Yükleme faktörünü kapasitesini ve tablonun geçerli boyutunu denetleyin.
zh_hans: 哈希表的容量溢出并且为负。检查加载因子、容量以及表的当前大小。
zh_hant: Hashtable 的容量溢位，並且成為負值。請檢查載入因數、容量，以及表格目前的大小。

# Arg_KeyNotFoundWithKey
source: The given key '{0}' was not present in the dictionary.
cs: Daný klíč {0} není ve slovníku k dispozici.
de: Der angegebene Schlüssel "{0}" war nicht im Wörterbuch vorhanden.
es: La clave "{0}" especificada no estaba presente en el diccionario.
fr: La clé spécifiée '{0}' n'est pas présente dans le dictionnaire.
it: La chiave specificata '{0}' non è presente nel dizionario.
ja: 指定されたキー '{0}' がディクショナリにありませんでした。
ko: 지정된 키 '{0}'이(가) 사전에 없습니다.
pl: Podanego klucza „{0}” nie było w słowniku.
pt_br: A chave fornecida '{0}' não estava presente no dicionário.
ru: Указанный ключ "{0}" отсутствует в словаре.
tr: Verilen '{0}' anahtarı sözlükte yoktu.
zh_hans: 字典中不存在给定的键“{0}”。
zh_hant: 指定的索引鍵 '{0}' 不在字典中。

# Arg_LongerThanDestArray
source: Destination array was not long enough. Check the destination index, length, and the array's lower bounds.
cs: Cílové pole není dostatečně veliké. Zkontrolujte prosím cílový index, délku a spodní hranice pole.
de: Das Zielarray war nicht lang genug. Überprüfen Sie den Zielindex, die Länge und die Untergrenze des Arrays.
es: La matriz de destino no tiene la longitud suficiente. Compruebe el índice de destino, la longitud y los límites inferiores de la matriz.
fr: Le tableau de destination n'est pas assez long. Vérifiez l'index, la longueur ainsi que les limites inférieures du tableau de destination.
it: Lunghezza della matrice di destinazione insufficiente. Controllare l'indice di destinazione, la lunghezza e i limiti inferiori della matrice.
ja: ターゲット配列の長さが足りません。ターゲットのインデックス、長さ、および配列の最小値を確認してください。
ko: 대상 배열의 길이가 짧습니다. 대상 인덱스, 길이, 배열의 하한을 확인하세요.
pl: Tablica docelowa nie była wystarczająco długa. Sprawdź indeks docelowy, długość i dolną granicę tablicy.
pt_br: A matriz de destino não era longa o suficiente. Verifique o índice, o tamanho e os limites inferiores da matriz de destino.
ru: Длина результирующего массива недостаточна. Проверьте индекс, длину и нижние границы результирующего массива.
tr: Hedef dizi yeterince uzun değildi. Hedef dizini, uzunluğu ve dizinin alt sınırını kontrol edin.
zh_hans: 目标数组不够长。请检查目标索引、长度以及数组的下限。
zh_hant: 目的陣列長度不足。請檢查目的索引、長度及陣列的下限。

# Arg_LongerThanSrcArray
source: Source array was not long enough. Check the source index, length, and the array's lower bounds.
cs: Zdrojové pole není dostatečně veliké. Zkontrolujte prosím zdrojový index, délku a spodní hranice pole.
de: Das Quellarray war nicht lang genug. Überprüfen Sie den Quellindex, die Länge und die Untergrenze des Arrays.
es: La matriz de origen no tiene la longitud suficiente. Compruebe el índice de origen, la longitud y los límites inferiores de la matriz.
fr: Le tableau source n'est pas assez long. Vérifiez l'index, la longueur ainsi que les limites inférieures du tableau source.
it: Lunghezza della matrice di origine insufficiente. Controllare l'indice di origine, la lunghezza e i limiti inferiori della matrice.
ja: ソース配列の長さが足りません。ソースのインデックス、長さ、および配列の最小値を確認してください。
ko: 소스 배열의 길이가 짧습니다. 소스 인덱스, 길이, 배열의 하한을 확인하세요.
pl: Tablica źródłowa nie była wystarczająco długa. Sprawdź indeks źródłowy, długość i dolną granicę tablicy.
pt_br: A matriz de origem não era longa o suficiente. Verifique o índice de origem, o tamanho e os limites inferiores da matriz.
ru: Длина исходного массива недостаточна. Проверьте индекс, длину и нижние границы исходного массива.
tr: Kaynak dizi yeterince uzun değildi. Kaynak dizini, uzunluğu ve dizinin alt sınırını kontrol edin.
zh_hans: 目标数组不够长。请检查源索引、长度以及数组的下限。
zh_hant: 來源陣列長度不足。請檢查來源索引、長度及陣列的下限。

# Arg_NonZeroLowerBound
source: The lower bound of target array must be zero.
cs: Dolní mez cílového pole musí být nula.
de: Die Untergrenze des Zielarrays muss bei null liegen.
es: El límite inferior de la matriz de destino debe ser cero.
fr: La limite inférieure du tableau cible doit être égale à zéro.
it: Il limite inferiore della matrice di destinazione deve essere zero.
ja: ターゲット配列の下限にはゼロを指定してください。
ko: 대상 배열의 하한은 0이어야 합니다.
pl: Dolna granica tablicy docelowej musi mieć wartość zero.
pt_br: O limite inferior da matriz de destino deve ser zero.
ru: Нижняя граница целевого массива должна равняться нулю.
tr: Hedef dizinin alt sınırı sıfır olmalıdır.
zh_hans: 目标数组的下限必须为零。
zh_hant: 目標陣列的下限必須為零。

# Arg_RankMultiDimNotSupported
source: Only single dimensional arrays are supported for the requested action.
cs: Pro požadovanou akci jsou podporována pouze jednorozměrná pole.
de: Nur eindimensionale Arrays werden für die angeforderte Aktion unterstützt.
es: Sólo se admiten matrices de una sola dimensión para la acción solicitada.
fr: Seuls les tableaux unidimensionnels sont pris en charge pour l'action demandée.
it: Per l'azione richiesta sono supportate solo matrici unidimensionali.
ja: 要求されたアクションに対しては、1 次元配列のみがサポートされます。
ko: 요청한 동작에 대해 1차원 배열만 지원됩니다.
pl: Dla żądanej akcji są obsługiwane tylko tablice jednowymiarowe.
pt_br: A ação solicitada oferece suporte somente a matrizes unidimensionais.
ru: Для запрашиваемого действия поддерживаются только одномерные массивы.
tr: Yalnızca tek boyutlu diziler, istenen eylem için destekleniyor.
zh_hans: 请求的操作仅支持一维数组。
zh_hant: 所要求的動作只支援一維陣列。

# Arg_WrongType
source: The value "{0}" is not of type "{1}" and cannot be used in this generic collection.
cs: Hodnota {0} není typu {1} a nelze ji použít v obecné kolekci.
de: {0} ist kein Wert des Typs {1} und kann in dieser generischen Sammlung nicht verwendet werden.
es: El valor "{0}" no es del tipo "{1}" y no se puede utilizar en esta colección genérica.
fr: La valeur "{0}" n'est pas de type "{1}" et ne peut pas être utilisée dans cette collection générique.
it: Il valore "{0}" non è di tipo "{1}" e non può essere utilizzato in questa raccolta generica.
ja: 値 "{0}" は型 "{1}" ではなく、この汎用コレクションでは使用できません。
ko: "{0}" 값은 "{1}" 형식이 아니므로 이 제네릭 컬렉션에 사용할 수 없습니다.
pl: Wartość „{0}” nie jest typu „{1}” i nie może być użyta w tej kolekcji rodzajowej.
pt_br: O valor "{0}" não é do tipo "{1}" e não pode ser usado nesta coleção genérica.
ru: Типом значения "{0}" не является "{1}", поэтому оно не может быть использовано в данной базовой коллекции.
tr: "{0}" değeri "{1}" türünde değil ve bu genel koleksiyonda kullanılamaz.
zh_hans: 值“{0}”不是“{1}”类型，不能在此泛型集合中使用。
zh_hant: 值 "{0}" 的類型不是 "{1}"，因此，無法用在此泛型集合。

# ArgumentException_OtherNotArrayOfCorrectLength
source: Object is not a array with the same number of elements as the array to compare it to.
cs: Objekt není pole se stejným počtem elementů jako pole, se kterým se má porovnat.
de: Das Objekt ist kein Array mit derselben Anzahl an Elementen wie das Array, mit dem es verglichen wird.
es: El objeto no es una matriz con el mismo número de elementos que la matriz con la que se va a comparar.
fr: L'objet n'est pas un tableau avec le même nombre d'éléments que celui auquel il doit être comparé.
it: L'oggetto non è una matrice con lo stesso numero di elementi della matrice a cui confrontarlo.
ja: オブジェクトは、比較対象の配列と同じ数の要素を含む配列ではありません。
ko: 개체가 비교할 배열과 요소 수가 같은 배열이 아닙니다.
pl: Obiekt nie jest tablicą zawierającą tę samą liczbę elementów co tablica, z którą ma on być porównany.
pt_br: O objeto não é uma matriz com o mesmo número de elementos da matriz à qual será comparado.
ru: Объект не является массивом с тем же количество элементов, как сравниваемый массив.
tr: Nesne, karşılaştırılacağı dizi ile aynı sayıda öğeye sahip bir dizi değil.
zh_hans: Object 数组中元素的数目与要进行比较的数组中的元素数目不相同。
zh_hant: 物件不是一個與相比較陣列具有相同元素數目的陣列。

# ArgumentOutOfRange_ArrayLB
source: Number was less than the array's lower bound in the first dimension.
cs: Číslo bylo menší než dolní mez prvního rozměru pole.
de: Die Zahl war kleiner als die Untergrenze des Arrays in der ersten Dimension.
es: El número es menor que el límite inferior de la matriz en la primera dimensión.
fr: Le nombre est inférieur à la limite inférieure du tableau dans la première dimension.
it: Il valore del numero è minore del limite inferiore della matrice nella prima dimensione.
ja: 最初の次元で、数字が配列の下限を下回っています。
ko: 숫자가 첫째 차원에서 배열의 하한보다 작습니다.
pl: W pierwszym wymiarze liczba była mniejsza niż wartość dolnej granicy tablicy.
pt_br: O número era menor que o limite inferior da matriz na primeira dimensão.
ru: Число было меньше нижней границы массива в первом измерении.
tr: Sayı, dizinin ilk boyutunun alt sınırından daha küçüktü.
zh_hans: 数字小于数组第一维的下限。
zh_hant: 號碼小於第一個維度中陣列的下限。

# ArgumentOutOfRange_BiggerThanCollection
source: Larger than collection size.
cs: Hodnota je větší než velikost kolekce.
de: Größer als die Kollektionsgröße.
es: Mayor que el tamaño de la colección.
fr: Plus grand que la taille de la collection.
it: Più grande della dimensione della raccolta.
ja: コレクション サイズを超えています。
ko: 컬렉션 크기보다 큽니다.
pl: Większy niż rozmiar kolekcji.
pt_br: Maior que tamanho da coleção.
ru: Больше размера коллекции.
tr: Koleksiyon boyutundan daha büyük.
zh_hans: 大于集合大小。
zh_hant: 大於集合大小。

# ArgumentOutOfRange_Count
source: Count must be positive and count must refer to a location within the string/array/collection.
cs: Počet musí být kladný a musí odkazovat na umístění v řetězci, v poli nebo v kolekci.
de: Die Anzahl muss positiv sein und auf eine Position in der dem Zeichenfolge/Array/Sammlung verweisen.
es: El recuento debe ser positivo y debe hacer referencia a una ubicación en la cadena, matriz o colección.
fr: Le compte doit être positif et faire référence à un emplacement de la chaîne/du tableau/de la collection.
it: Il contatore deve avere valore positivo e fare riferimento a una posizione all'interno della stringa, della matrice o della raccolta.
ja: カウントは正の数で、文字列/配列/コレクション内の場所を参照しなければなりません。
ko: 개수는 양수여야 하고 문자열/배열/컬렉션 내의 위치를 참조해야 합니다.
pl: Wartość licznika musi być dodatnia i musi odwoływać się do lokalizacji w ciągu/tablicy/kolekcji.
pt_br: A contagem deve ser positiva e deve se referir a um local dentro da cadeia de caracteres/matriz/coleção.
ru: Номер должен быть положительным и указывать на местоположение внутри строки/массива/коллекции.
tr: Sayı pozitif olmalı ve dize/dizi/koleksiyon içinde bir konuma başvurmalıdır.
zh_hans: 计数必须为正，且计数必须引用 string/array/collection 内的位置。
zh_hant: 計數必須為正且計數必須參考字串/陣列/集合中的位置。

# ArgumentOutOfRange_IndexMustBeLess
source: Index was out of range. Must be non-negative and less than the size of the collection.
it: Indice non compreso nell'intervallo consentito. Deve essere non negativo e minore della dimensione della raccolta.
pt_br: O índice estava fora do intervalo. Deve ser não-negativo e menor do que o tamanho da coleção.
ru: Индекс за пределами диапазона. Индекс должен быть положительным числом, а его размер не должен превышать размер коллекции.

# ArgumentOutOfRange_IndexMustBeLessOrEqual
source: Index was out of range. Must be non-negative and less than or equal to the size of the collection.
it: L'indice non è compreso nell'intervallo. Deve essere non negativo e minore o uguale alle dimensioni della raccolta.
pt_br: O índice estava fora do intervalo. Deve ser não negativo e menor ou igual ao tamanho da coleção.
ru: Индекс вне диапазона. Это должно быть неотрицательное значение меньше размера коллекции или равное ему.

# ArgumentOutOfRange_ListInsert
source: Index must be within the bounds of the List.
cs: Index musí být v rozsahu objektu List.
de: Der Index muss sich innerhalb der Listenbegrenzung befinden.
es: El índice debe estar dentro de los límites de la lista.
fr: L'index doit être dans les limites de la List.
it: L'indice deve essere compreso nei limiti dell'elenco.
ja: インデックスは一覧の範囲内になければなりません。
ko: 인덱스는 목록의 범위 내에 있어야 합니다.
pl: Indeks i długość muszą mieścić się w granicach elementu Lista.
pt_br: O índice deve estar dentro dos limites da Lista.
ru: Индекс должен находиться в границах этого списка.
tr: Dizin, Liste sınırları içinde olmalıdır.
zh_hans: 索引必须位于该列表的界限内。
zh_hant: 索引必須在清單的界限之內。

# ArgumentOutOfRange_NeedNonNegNum
source: Non-negative number required.
cs: Vyžaduje se nezáporné číslo.
de: Nicht negative Zahl erforderlich.
es: Número no negativo requerido.
fr: Nombre non négatif obligatoire.
it: È richiesto un numero non negativo.
ja: 負でない数値が必要です。
ko: 음수가 아닌 수가 필요합니다.
pl: Wymagana jest liczba nieujemna.
pt_br: É necessário um número não negativo.
ru: Требуется неотрицательное число.
tr: Negatif olmayan sayı gerekiyor.
zh_hans: 需要提供非负数。
zh_hant: 需要非負數。

# ArgumentOutOfRange_SmallCapacity
source: capacity was less than the current size.
cs: kapacita je menší než aktuální velikost.
de: Kapazität lag unter der aktuellen Größe.
es: capacidad menor que el tamaño actual.
fr: La capacité était inférieure à la taille actuelle.
it: capacità inferiore alla dimensione corrente.
ja: 容量が現在のサイズより小さい値です。
ko: 용량이 현재 크기보다 작습니다.
pl: pojemność była mniejsza niż bieżący rozmiar.
pt_br: a capacidade era menor que o tamanho atual.
ru: емкость меньше текущего размера.
tr: kapasitesi geçerli boyuttan küçüktü.
zh_hans: 容量小于当前大小。
zh_hant: 容量小於目前大小。

# Argument_AddingDuplicateWithKey
source: An item with the same key has already been added. Key: {0}
cs: Položka se stejným klíčem již byla přidána. Klíč: {0}
de: Es wurde bereits ein Element mit dem gleichen Schlüssel hinzugefügt. Schlüssel: {0}
es: Ya se agregó un elemento con la misma clave. Clave: {0}
fr: Un élément avec la même clé a déjà été ajouté. Clé : {0}
it: È stato già aggiunto un elemento con la stessa chiave. Chiave: {0}
ja: 同一のキーを含む項目が既に追加されています。キー: {0}
ko: 동일한 키를 사용하는 항목이 이미 추가되었습니다. 키: {0}
pl: Element o tym samym kluczu został już dodany. Klucz: {0}
pt_br: Já foi adicionado um item com a mesma chave. Chave: {0}
ru: Элемент с таким же ключом уже добавлен. Ключ: {0}
tr: Aynı anahtara sahip bir öğe zaten eklenmiş. Anahtar: {0}
zh_hans: 已添加了具有相同键的项。键: {0}
zh_hant: 已經新增具有相同索引鍵的項目。索引鍵: {0}

# Argument_IncompatibleArrayType
source: Target array type is not compatible with the type of items in the collection.
it: Il tipo di matrice di destinazione non è compatibile con il tipo di elementi della raccolta.
pt_br: O tipo da matriz de destino não é compatível com o tipo dos itens na coleção.
ru: Тип целевого массива несовместим с типом элементов в коллекции.

# Argument_InvalidOffLen
source: Offset and length were out of bounds for the array or count is greater than the number of elements from index to the end of the source collection.
cs: Posun a délka byly mimo rozsah pro dané pole nebo je počet vyšší než počet elementů z indexu do konce zdrojové kolekce.
de: Offset und Länge für das Array liegen außerhalb des gültigen Bereichs, oder die Anzahl ist größer als die Anzahl der Elemente vom Index bis zum Ende der Quellsammlung.
es: El desplazamiento y la longitud estaban fuera de los límites para esta matriz o el recuento es superior al número de elementos desde el índice al final de la colección de origen.
fr: Offset et length étaient hors limites pour ce tableau ou bien le nombre est supérieur au nombre d'éléments de l'index à la fin de la collection source.
it: Offset e lunghezza eccedono i limiti della matrice oppure il conteggio è maggiore del numero di elementi presenti dall'indice alla fine della raccolta di origine.
ja: 配列のオフセットおよび長さが制限を超えているか、カウンターがソース コレクションのインデックスから最後までの要素の数より大きい値です。
ko: 오프셋 및 길이가 배열의 범위를 벗어났거나 카운트가 인덱스부터 소스 컬렉션 끝까지의 요소 수보다 큽니다.
pl: Wartości przesunięcia i długości są spoza zakresu tablicy lub liczba przekracza liczbę elementów znajdujących się miedzy indeksem a końcem kolekcji źródłowej.
pt_br: O deslocamento e o comprimento estavam fora dos limites para a matriz ou a contagem é maior do que o número de elementos do índice até o fim da coleção de origem.
ru: Смещение и длина вышли за границы массива или значение счетчика превышает количество элементов от указателя до конца исходной коллекции.
tr: Uzaklık ve uzunluk dizi sınırlarının dışındaydı veya sayı, dizinden kaynak koleksiyonun sonuna kadar olan öğe sayısından daha büyük.
zh_hans: 偏移量和长度超出数组的界限，或者计数大于从索引到源集合结尾处的元素数量。
zh_hant: 位移和長度超過陣列的界限或計數大於從索引至來源集合尾端的項目數。

# CannotFindOldValue
source: Cannot find the old value
cs: Nepovedlo se najít starou hodnotu.
de: Der alte Wert wurde nicht gefunden.
es: No se puede encontrar el valor antiguo
fr: Impossible de trouver l’ancienne valeur
it: Non è possibile trovare il valore precedente
ja: 古い値が見つかりません
ko: 이전 값을 찾을 수 없음
pl: Nie można znaleźć starej wartości
pt_br: Não consigo encontrar o valor antigo
ru: Не удается найти старое значение
tr: Eski değer bulunamıyor
zh_hans: 找不到旧值
zh_hant: 找不到舊值
