Repository: dotnet/roslyn
Catalog: src/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, pt_br, zh_hans, zh_hant

# TestExportsShouldNotBeDiscoverableTitle
source: Test exports should not be discoverable
cs: Testovací exportování by se neměla dát zjistit
de: Testexporte dürfen nicht ermittelbar sein
ja: テスト エクスポートは検出可能であってはなりません
ko: 테스트 내보내기는 검색 가능해서는 안 됨
pl: Odnajdywanie eksportów testowych nie powinno być możliwe
pt_br: As exportações de teste não devem ser detectáveis
zh_hans: 测试导出应该不可被发现
zh_hant: 測試匯出不應為可搜尋的

# UseSpecializedCollectionsEmptyEnumerableTitle
source: Use 'SpecializedCollections.EmptyEnumerable()'
cs: Použít SpecializedCollections.EmptyEnumerable()
de: SpecializedCollections.EmptyEnumerable() verwenden
ja: SpecializedCollections.EmptyEnumerable() を使用します
ko: 'SpecializedCollections.EmptyEnumerable()'을 사용하세요.
pl: Użyj metody SpecializedCollections.EmptyEnumerable()
pt_br: Usar 'SpecializedCollections.EmptyEnumerable()'
zh_hans: 使用 "SpecializedCollections.EmptyEnumerable()"
zh_hant: 使用 'SpecializedCollections.EmptyEnumerable()'

# UseSpecializedCollectionsEmptyEnumerableMessage
source: Use 'SpecializedCollections.EmptyEnumerable()'
cs: Použijte SpecializedCollections.EmptyEnumerable().
de: SpecializedCollections.EmptyEnumerable() verwenden
ja: SpecializedCollections.EmptyEnumerable() を使用します
ko: 'SpecializedCollections.EmptyEnumerable()'을 사용하세요.
pl: Użyj metody SpecializedCollections.EmptyEnumerable()
pt_br: Usar 'SpecializedCollections.EmptyEnumerable()'
zh_hans: 使用 "SpecializedCollections.EmptyEnumerable()"
zh_hant: 使用 'SpecializedCollections.EmptyEnumerable()'

# UseSpecializedCollectionsSingletonEnumerableTitle
source: Use 'SpecializedCollections.SingletonEnumerable()'
cs: Použít SpecializedCollections.SingletonEnumerable()
de: SpecializedCollections.SingletonEnumerable() verwenden
ja: SpecializedCollections.SingletonEnumerable() を使用します
ko: 'SpecializedCollections.SingletonEnumerable()'을 사용하세요.
pl: Użyj metody SpecializedCollections.SingletonEnumerable()
pt_br: Usar 'SpecializedCollections.SingletonEnumerable()'
zh_hans: 使用 "SpecializedCollections.SingletonEnumerable()"
zh_hant: 使用 'SpecializedCollections.SingletonEnumerable()'

# UseSpecializedCollectionsSingletonEnumerableMessage
source: Use 'SpecializedCollections.SingletonEnumerable()'
cs: Použijte SpecializedCollections.SingletonEnumerable().
de: SpecializedCollections.SingletonEnumerable() verwenden
ja: SpecializedCollections.SingletonEnumerable() を使用します
ko: 'SpecializedCollections.SingletonEnumerable()'을 사용하세요.
pl: Użyj metody SpecializedCollections.SingletonEnumerable()
pt_br: Usar 'SpecializedCollections.SingletonEnumerable()'
zh_hans: 使用 "SpecializedCollections.SingletonEnumerable()"
zh_hant: 使用 'SpecializedCollections.SingletonEnumerable()'

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsTitle
source: Invoke the correct property to ensure correct use site diagnostics
cs: Zavolat správnou vlastnost, aby se zajistilo správné použití diagnostiky webu
de: Rufen Sie die richtige Eigenschaft auf, um eine korrekte Nutzung der Sitediagnose sicherzustellen.
ja: 正しいサイト診断が使用されるように、正しいプロパティを呼び出します。
ko: 올바른 속성을 호출하여 사이트 진단을 올바르게 사용하는지 확인하세요.
pl: Wywołaj odpowiednią właściwość, aby upewnić się, że diagnostyka witryny jest używana prawidłowo.
pt_br: Invoque a propriedade correta para assegurar o uso correto de diagnósticos do site
zh_hans: 调用正确的属性以确保正确使用站点诊断
zh_hant: 請叫用正確的屬性，確保網站診斷的使用正確

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsMessage
source: Invoke the correct property to ensure correct use site diagnostics
cs: Vyvoláním správné vlastnosti zajistěte správné použití diagnostiky webu.
de: Rufen Sie die richtige Eigenschaft auf, um eine korrekte Nutzung der Sitediagnose sicherzustellen.
ja: 正しいサイト診断が使用されるように、正しいプロパティを呼び出します。
ko: 올바른 속성을 호출하여 사이트 진단을 올바르게 사용하는지 확인하세요.
pl: Wywołaj odpowiednią właściwość, aby upewnić się, że diagnostyka witryny jest używana prawidłowo.
pt_br: Invoque a propriedade correta para assegurar o uso correto de diagnósticos do site
zh_hans: 调用正确的属性以确保正确使用站点诊断
zh_hant: 請叫用正確的屬性，確保網站診斷的使用正確

# DoNotUseGenericCodeActionCreateToCreateCodeActionTitle
source: Do not use generic 'CodeAction.Create' to create 'CodeAction'
cs: K vytvoření CodeAction nepoužívat obecnou metodu CodeAction.Create
de: Generisches CodeAction.Create nicht zum Erstellen von CodeAction verwenden
ja: CodeAction を作成するために、ジェネリック CodeAction.Create を使用しないでください
ko: 제네릭 'CodeAction.Create'를 사용하여 'CodeAction'을 만들지 마세요.
pl: Nie używaj ogólnej metody CodeAction.Create do tworzenia elementu CodeAction
pt_br: Não use um 'CodeAction.Create' genérico para criar o 'CodeAction'
zh_hans: 不要使用通用的 "CodeAction.Create" 来创建 "CodeAction"
zh_hant: 請勿使用泛型 'CodeAction.Create' 來建立 'CodeAction'

# DoNotUseGenericCodeActionCreateToCreateCodeActionMessage
source: Do not use generic 'CodeAction.Create' to create 'CodeAction'
cs: K vytvoření CodeAction nepoužívejte obecnou metodu CodeAction.Create.
de: Generisches CodeAction.Create nicht zum Erstellen von CodeAction verwenden
ja: CodeAction を作成するために、ジェネリック CodeAction.Create を使用しないでください
ko: 제네릭 'CodeAction.Create'를 사용하여 'CodeAction'을 만들지 마세요.
pl: Nie używaj ogólnej metody CodeAction.Create do tworzenia elementu CodeAction
pt_br: Não use um 'CodeAction.Create' genérico para criar o 'CodeAction'
zh_hans: 不要使用通用的 "CodeAction.Create" 来创建 "CodeAction"
zh_hant: 請勿使用泛型 'CodeAction.Create' 來建立 'CodeAction'

# OverrideObjectEqualsObjectWhenImplementingIequatableTitle
source: Override 'Object.Equals(object)' when implementing 'IEquatable'
cs: Při implementaci IEquatable přepsat Object.Equals(object)
de: "Object.Equals(object)" bei Implementierung von "IEquatable" außer Kraft setzen
ja: Iequatable を実装するときに Object.Equals(object) をオーバーライドします
ko: IEquatable을 구현할 때 Object.Equals(개체)를 재정의하세요.
pl: Przesłoń metodę Object.Equals(object) przy implementowaniu interfejsu Iequatable
pt_br: Substitua 'Object.Equals(object)' ao implementar 'IEquatable'
zh_hans: 当实现 "IEquatable" 时，重写 "Object.Equals(object)"
zh_hant: 實作 'IEquatable' 時覆寫 'Object.Equals(object)'

# OverrideObjectEqualsObjectWhenImplementingIequatableMessage
source: Override 'Object.Equals(object)' when implementing 'IEquatable'
cs: Při implementaci IEquatable přepište Object.Equals(object).
de: "Object.Equals(object)" bei Implementierung von "IEquatable" außer Kraft setzen
ja: Iequatable を実装するときに Object.Equals(object) をオーバーライドします
ko: IEquatable을 구현할 때 Object.Equals(개체)를 재정의하세요.
pl: Przesłoń metodę Object.Equals(object) przy implementowaniu interfejsu Iequatable
pt_br: Substitua 'Object.Equals(object)' ao implementar 'IEquatable'
zh_hans: 当实现 "IEquatable" 时，重写 "Object.Equals(object)"
zh_hant: 實作 'IEquatable' 時覆寫 'Object.Equals(object)'

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsTitle
source: 'SymbolDeclaredEvent' must be generated for source symbols
cs: Pro zdrojové symboly musí být vygenerována událost SymbolDeclaredEvent
de: SymbolDeclaredEvent muss für Quellsymbole generiert werden
ja: ソース シンボルに対して SymbolDeclaredEvent を生成する必要があります
ko: 'SymbolDeclaredEvent'는 소스 기호에 대해 생성되어야 합니다.
pl: Element SymbolDeclaredEvent musi być generowany dla symboli źródłowych
pt_br: 'SymbolDeclaredEvent' precisa ser gerado para símbolos de origem
zh_hans: 必须为源符号生成 "SymbolDeclaredEvent"
zh_hant: 必須為來源符號產生 'SymbolDeclaredEvent'

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsDescription
source: Compilation event queue is required to generate symbol declared events for all declared source symbols. Hence, every source symbol type or one of its base types must generate a symbol declared event.
cs: Vyžaduje se, aby fronta událostí kompilace vygenerovala symbolem deklarované události pro všechny deklarované zdrojové symboly. Každý typ zdrojového symbolu nebo jeden z jeho základních typů proto musí vygenerovat symbolem deklarovanou událost.
de: Die Warteschlange für das Kompilierungsereignis ist erforderlich, um für alle deklarierten Quellsymbole Symboldeklarationsereignisse zu generieren. Daher muss jeder Quellsymboltyp oder einer der zugehörigen Basistypen ein Symboldeklarationsereignis generieren.
es: Se requiere la cola del evento de compilación para generar eventos declarados de símbolos para todos los símbolos de origen declarados. Por lo tanto, todos los tipos de símbolos de origen de uno de sus tipos base debe generar un evento declarado de símbolos.
fr: Une file d'attente d'événements de compilation est nécessaire afin de générer les événements de déclaration de symbole pour tous les symboles sources déclarés. Ainsi, chaque type de symbole source ou l'un de ses types de base doit générer un événement de déclaration de symbole.
ja: すべての宣言済みソース シンボルのシンボル宣言イベントを生成するには、コンパイル イベント キューが必要です。そのため、各ソース シンボル型、またはその基本型の 1 つは、シンボル宣言イベントを生成する必要があります。
ko: 선언된 모든 소스 기호에 대해 기호가 선언된 이벤트를 생성하는 데 컴파일 이벤트 대기열이 필요합니다. 그러므로 모든 소스 기호 형식 또는 소스 기호의 기본 형식 중 하나는 기호가 선언된 이벤트를 생성해야 합니다.
pl: Kolejka zdarzeń kompilacji jest wymagana do generowania zdarzeń deklarowanych przy użyciu symboli dla wszystkich deklarowanych symboli źródłowych. Dlatego każdy typ symbolu źródłowego lub jeden z jego typów bazowych musi generować zdarzenie deklarowane przy użyciu symbolu.
pt_br: A fila de eventos de compilação deve gerar eventos declarados por símbolo para todos os símbolos de origem declarados. Portanto, cada tipo de símbolo de origem ou um de seus tipos base deve gerar um evento declarado por símbolo.
zh_hans: 要为声明的所有源符号生成符号声明事件，需使用编译事件队列。因此，每个源符号类型或其任一基类型必须生成符号声明事件。
zh_hant: 必須要有編譯事件佇列，才可為所有宣告的來源符號產生符號宣告事件。因此，每個來源符號類型或它的其中一個基底類型，必須產生符號宣告事件。

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsMessage
source: 'SymbolDeclaredEvent' must be generated for source symbols
cs: Pro zdrojové symboly musí být vygenerována událost SymbolDeclaredEvent.
de: SymbolDeclaredEvent muss für Quellsymbole generiert werden
ja: ソース シンボルに対して SymbolDeclaredEvent を生成する必要があります
ko: 'SymbolDeclaredEvent'는 소스 기호에 대해 생성되어야 합니다.
pl: Element SymbolDeclaredEvent musi być generowany dla symboli źródłowych
pt_br: 'SymbolDeclaredEvent' precisa ser gerado para símbolos de origem
zh_hans: 必须为源符号生成 "SymbolDeclaredEvent"
zh_hant: 必須為來源符號產生 'SymbolDeclaredEvent'

# DoNotMixAttributesFromDifferentVersionsOfMEFTitle
source: Do not mix attributes from different versions of MEF
cs: Nekombinujte atributy z různých verzí rozhraní MEF.
de: Keine Attribute aus verschiedenen Versionen des MEF kombinieren
ja: 複数のバージョンの MEF の属性を混用しないでください
ko: 다른 버전의 MEF 특성을 조합하지 마세요.
pl: Nie mieszaj atrybutów z różnych wersji MEF
pt_br: Não combinar atributos de versões diferentes de MEF
zh_hans: 切勿混合不同版本 MEF 中的属性
zh_hant: 請勿混合來自不同 MEF 版本的屬性

# DoNotMixAttributesFromDifferentVersionsOfMEFDescription
source: Do not mix attributes from different versions of MEF.
cs: Nekombinujte atributy z různých verzí rozhraní MEF.
de: Keine Attribute aus verschiedenen Versionen des MEF kombinieren
ja: 複数のバージョンの MEF の属性を混用しないでください
ko: 다른 버전의 MEF 특성을 조합하지 마세요.
pl: Nie mieszaj atrybutów z różnych wersji MEF
pt_br: Não combine os atributos de versões diferentes do MEF.
zh_hans: 切勿混合不同版本 MEF 中的属性。
zh_hant: 請勿混合來自不同 MEF 版本的屬性。

# DoNotMixAttributesFromDifferentVersionsOfMEFMessage
source: Attribute '{0}' comes from a different version of MEF than the export attribute on '{1}'
cs: Atribut {0} pochází z jiné verze rozhraní MEF než atribut exportu u {1}.
de: Das Attribut "{0}" stammt aus einer anderen Version des MEF als das Exportattribut für "{1}".
ja: 属性 '{0}' は、'{1}' のエクスポート属性とは別のバージョンの MEF の属性です
ko: '{0}' 특성은 '{1}'의 export 특성이 아닌 다른 버전의 MEF에서 가져온 것입니다.
pl: Atrybut „{0}” pochodzi z innej wersji MEF niż atrybut eksportu „{1}”
pt_br: O atributo '{0}' vem de uma versão diferente de MEF do que o atributo de exportação em '{1}'
zh_hans: 属性“{0}”来自与“{1}”上的导出属性不同的 MEF 版本
zh_hant: 屬性 '{0}' 來自與 '{1}' 上的匯出屬性不同的 MEF 版本

# PartsExportedWithMEFv2MustBeMarkedAsSharedTitle
source: Parts exported with MEFv2 must be marked with 'SharedAttribute'
cs: Části exportované pomocí rozhraní MEFv2 musí být označené atributem SharedAttribute
de: Mit MEFv2 exportierte Teile müssen als "Shared" markiert werden
ja: MEFv2 でエクスポートされたパーツは、共有としてマークする必要があります
ko: MEFv2를 통해 내보낸 파트는 'SharedAttribute'로 표시해야 합니다.
pl: Części wyeksportowane z MEFv2 muszą być oznaczone jako udostępnione
pt_br: As partes exportadas com MEFv2 precisam ser marcadas como 'SharedAttribute'
zh_hans: 通过 MEFv2 导出的部件必须使用 "SharedAttribute" 标记
zh_hant: 使用 MEFv2 匯出的組件，必須標記為 'SharedAttribute'

# PartsExportedWithMEFv2MustBeMarkedAsSharedDescription
source: Part exported with MEFv2 must be marked with the 'SharedAttribute'.
cs: Část exportovaná pomocí rozhraní MEFv2 musí být označená atributem SharedAttribute.
de: Ein mit MEFv2 exportiertes Teil muss mit dem Shared-Attribut markiert werden.
ja: MEFv2 でエクスポートされたパーツは、共有属性でマークする必要があります。
ko: MEFv2를 통해 내보낸 파트는 'SharedAttribute'로 표시해야 합니다.
pl: Część wyeksportowana z MEFv2 musi być oznaczona atrybutem Shared.
pt_br: A parte exportada com MEFv2 precisa ser marcada com 'SharedAttribute'.
zh_hans: 通过 MEFv2 导出的部件必须使用 "SharedAttribute" 标记。
zh_hant: 使用 MEFv2 匯出的組件，必須標記為 'SharedAttribute'。

# PartsExportedWithMEFv2MustBeMarkedAsSharedMessage
source: '{0}' is exported with MEFv2 and hence must be marked with 'SharedAttribute'
cs: Část {0} je exportovaná pomocí rozhraní MEFv2, musí být proto označená atributem SharedAttribute.
de: "{0}" wurde mit MEFv2 exportiert und muss daher als "Shared" markiert werden.
ja: '{0}' は MEFv2 でエクスポートされるため、共有としてマークする必要があります
ko: '{0}'을(를) MEFv2를 통해 내보냈으므로 'SharedAttribute'로 표시해야 합니다.
pl: Element „{0}” jest eksportowany z MEFv2, a więc musi być oznaczony jako udostępniony
pt_br: '{0}' é exportado com MEFv2 e, portanto, precisa ser marcado com 'SharedAttribute'
zh_hans: “{0}”是通过 MEFv2 导出的，因此必须使用 "SharedAttribute" 标记
zh_hant: 匯出 '{0}' 時使用的是 MEFv2，因此必須標記為 'SharedAttribute'

# WrapStatementsMessage
source: Statements must be placed on their own line
cs: Každý příkaz musí mít svůj vlastní řádek.
ko: 문은 고유한 줄에 배치해야 합니다.
pt_br: As instruções precisam ser colocadas em suas próprias linhas
zh_hans: 语句必须放在其自己的行上
zh_hant: 陳述式必須位於自己的行中

# UseSpecializedCollectionsEmptyEnumerableDescription
source: #N/A
cs: Není k dispozici
de: #Nicht zutreffend
es: #N/D
pl: ND
pt_br: #N/D

# UseSpecializedCollectionsSingletonEnumerableDescription
source: #N/A
cs: Není k dispozici
de: #Nicht zutreffend
es: #N/D
pl: ND
pt_br: #N/D

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsDescription
source: #N/A
cs: Není k dispozici
de: #Nicht zutreffend
es: #N/D
pl: ND
pt_br: #N/D

# DoNotUseGenericCodeActionCreateToCreateCodeActionDescription
source: #N/A
cs: Není k dispozici
de: #Nicht zutreffend
es: #N/D
pl: ND
pt_br: #N/D

# OverrideObjectEqualsObjectWhenImplementingIequatableDescription
source: #N/A
cs: Není k dispozici
de: #Nicht zutreffend
es: #N/D
pl: ND
pt_br: #N/D

# DoNotInvokeDiagnosticDescriptorTitle
source: Do not invoke 'Diagnostic.Descriptor'
de: Diagnostic.Descriptor nicht aufrufen
ja: Diagnostic.Descriptor を呼び出さないでください
pl: Nie wywołuj metody Diagnostic.Descriptor

# DoNotInvokeDiagnosticDescriptorDescription
source: Accessing the 'Descriptor' property of 'Diagnostic' in compiler layer leads to unnecessary string allocations for fields of the descriptor that are not utilized in command line compilation. Hence, you should avoid accessing the 'Descriptor' of the compiler diagnostics here. Instead you should directly access these properties off the 'Diagnostic' type.
de: Der Zugriff auf die Descriptor-Eigenschaft der Diagnose auf Compilerebene führt zu unnötigen Zeichenfolgenzuweisungen für Felder des Deskriptors, die bei der Befehlszeilenkompilierung nicht verwendet werden. Vermeiden Sie daher an dieser Stelle den Zugriff auf den Deskriptor der Compilerdiagnose. Greifen Sie stattdessen direkt vom Diagnosetyp aus auf diese Eigenschaften zu.
ja: コンパイラ レイヤーで診断の Descriptor プロパティにアクセスすると、コマンド ライン コンパイルでは使用されない、記述子のフィールドに不要な文字列が割り当てられます。そのため、ここではコンパイラ診断の Descriptor にアクセスしないようにする必要があります。代わりに、Diagnostic 型のこれらのプロパティに直接アクセスする必要があります。
pl: Uzyskiwanie dostępu do właściwości Descriptor elementu Diagnostic w warstwie kompilatora prowadzi do niepotrzebnych alokacji ciągów dla pól deskryptora, które nie zostały użyte w kompilacji wiersza polecenia. Dlatego należy unikać uzyskiwania dostępu do elementu Descriptor diagnostyki kompilatora w tym miejscu. Zamiast tego należy bezpośrednio uzyskiwać dostęp do tych właściwości typu Diagnostic.

# DoNotInvokeDiagnosticDescriptorMessage
source: Do not invoke property '{0}' on type '{1}', instead directly access the required member{2} on '{1}'
de: Rufen Sie nicht die Eigenschaft "{0}" für den Typ "{1}" auf. Greifen Sie stattdessen direkt auf den erforderlichen Member "{2}" in "{1}" zu.
es: No invoque a la propiedad "{0}" en el tipo "{1}", acceda directamente en su lugar al miembro requerido {2} en "{1}".
fr: N'appelez pas la propriété '{0}' sur le type '{1}'. À la place, accédez directement au membre nécessaire {2} sur '{1}'
ja: 型 '{1}' のプロパティ '{0}' を呼び出さないでください。代わりに、'{1}' の必要なメンバー {2} に直接アクセスしてください
pl: Nie wywołuj właściwości „{0}” typu „{1}”. Zamiast tego uzyskuj bezpośrednio dostęp do wymaganego elementu członkowskiego {2} w elemencie „{1}”

# UseSpecializedCollectionsEmptyEnumerableTitle
source: Use SpecializedCollections.EmptyEnumerable()
es: Usar SpecializedCollections.EmptyEnumerable()
fr: Utiliser SpecializedCollections.EmptyEnumerable()

# UseSpecializedCollectionsEmptyEnumerableMessage
source: Use SpecializedCollections.EmptyEnumerable()
es: Usar SpecializedCollections.EmptyEnumerable()
fr: Utiliser SpecializedCollections.EmptyEnumerable()

# UseSpecializedCollectionsSingletonEnumerableTitle
source: Use SpecializedCollections.SingletonEnumerable()
es: Usar SpecializedCollections.SingletonEnumerable()
fr: Utiliser SpecializedCollections.SingletonEnumerable()

# UseSpecializedCollectionsSingletonEnumerableMessage
source: Use SpecializedCollections.SingletonEnumerable()
es: Usar SpecializedCollections.SingletonEnumerable()
fr: Utiliser SpecializedCollections.SingletonEnumerable()

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsTitle
source: Invoke the correct property to ensure correct use site diagnostics.
es: Invoque la propiedad correcta para garantizar el diagnóstico de uso de sitio correcto.
fr: Appelez la propriété appropriée pour garantir l'utilisation adéquate des diagnostics de site.

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsMessage
source: Invoke the correct property to ensure correct use site diagnostics.
es: Invoque la propiedad correcta para garantizar el diagnóstico de uso de sitio correcto.
fr: Appelez la propriété appropriée pour garantir l'utilisation adéquate des diagnostics de site.

# DoNotUseGenericCodeActionCreateToCreateCodeActionTitle
source: Do not use generic CodeAction.Create to create CodeAction
es: No utilizar CodeAction.Create genérico para crear CodeAction
fr: Ne pas utiliser de CodeAction.Create générique pour créer CodeAction

# DoNotUseGenericCodeActionCreateToCreateCodeActionMessage
source: Do not use generic CodeAction.Create to create CodeAction
es: No utilizar CodeAction.Create genérico para crear CodeAction
fr: Ne pas utiliser de CodeAction.Create générique pour créer CodeAction

# OverrideObjectEqualsObjectWhenImplementingIequatableTitle
source: Override Object.Equals(object) when implementing Iequatable
es: Reemplazar Object.Equals(object) al implementar Iequatable
fr: Remplacer Object.Equals(object) au moment d'implémenter Iequatable

# OverrideObjectEqualsObjectWhenImplementingIequatableMessage
source: Override Object.Equals(object) when implementing Iequatable
es: Reemplazar Object.Equals(object) al implementar Iequatable
fr: Remplacer Object.Equals(object) au moment d'implémenter Iequatable

# DoNotInvokeDiagnosticDescriptorTitle
source: Do not invoke Diagnostic.Descriptor
es: No invocar Diagnostic.Descriptor
fr: Ne pas appeler Diagnostic.Descriptor

# DoNotInvokeDiagnosticDescriptorDescription
source: Accessing the Descriptor property of Diagnostic in compiler layer leads to unnecessary string allocations for fields of the descriptor that are not utilized in command line compilation. Hence, you should avoid accessing the Descriptor of the compiler diagnostics here. Instead you should directly access these properties off the Diagnostic type.
es: El acceso a la propiedad Descriptor de Diagnostic en la capa del compilador provoca asignaciones de cadena innecesarias para los campos del descriptor que no se utilizan en la compilación de la línea de comandos. Por lo tanto, debe evitar el acceso a Descriptor del diagnóstico del compilador aquí. En su lugar, debe acceder directamente a estas propiedades desde fuera del tipo de Diagnostic.
fr: L'accès à la propriété Descriptor de Diagnostic dans la couche du compilateur entraîne des allocations de chaînes inutiles pour les champs du descripteur qui ne sont pas utilisés durant la compilation de la ligne de commande. Vous devez donc éviter d'accéder au descripteur des diagnostics du compilateur ici. À la place, accédez directement à ces propriétés hors du type Diagnostic.

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsTitle
source: SymbolDeclaredEvent must be generated for source symbols
es: Debe generarse SymbolDeclaredEvent para los símbolos de origen.
fr: SymbolDeclaredEvent doit être généré pour les symboles sources

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsMessage
source: SymbolDeclaredEvent must be generated for source symbols
es: Debe generarse SymbolDeclaredEvent para los símbolos de origen.
fr: SymbolDeclaredEvent doit être généré pour les symboles sources

# DeclarePublicApiTitle
source: Add public types and members to the declared API
es: Agregar tipos y miembros públicos a la API declarada
fr: Ajouter des types et membres publics à l'API déclarée

# DeclarePublicApiMessage
source: Symbol '{0}' is not part of the declared API.
es: El símbolo "{0}" no forma parte de la API declarada.
fr: Le symbole '{0}' ne fait pas partie de l'API déclarée.

# DeclarePublicApiDescription
source: All public types and members should be declared in PublicAPI.txt. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
es: Todos los tipos y miembros públicos deben declararse en PublicAPI.txt. Esto llama la atención sobre los cambios de la API en las revisiones del código y el historial de control de código fuente, y ayuda a evitar cambios rupturistas.
fr: Tous les types et membres publics doivent être déclarés dans PublicAPI.txt. Cela attire l'attention sur les changements apportés à l'API dans les revues du code et l'historique du contrôle de code source. De plus, cela permet d'éviter les ruptures.

# RemoveDeletedApiTitle
source: Remove deleted types and members from the declared API
es: Quite tipos y miembros eliminados de la API declarada.
fr: Enlever les types et membres supprimés de l'API déclarée

# RemoveDeletedApiMessage
source: Symbol '{0}' is part of the declared API, but is either not public or could not be found
es: El símbolo "{0}" forma parte de la API declarada, pero no es público o no se encuentra.
fr: Le symbole '{0}' fait partie de l'API déclarée, mais il n'est pas public ou est introuvable
