Repository: dotnet/roslyn
Catalog: src/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, pt_br, zh_hans, zh_hant

# AvoidOptSuffixForNullableEnableCodeCodeFixTitle
source: Remove the 'Opt' suffix
ko: 'Opt' 접미사 제거
pt_br: Remover o sufixo 'Opt'
zh_hant: 移除 'Opt' 尾碼

# AvoidOptSuffixForNullableEnableCodeDescription
source: Avoid the 'Opt' suffix in a nullable-enabled code.
ko: nullable 지원 코드에서는 'Opt' 접미사를 사용하지 마세요.
pt_br: Evite o sufixo 'Opt' em um código habilitado para anulável.
zh_hant: 避免在可為 null 的程式碼中使用 'Opt' 尾碼。

# AvoidOptSuffixForNullableEnableCodeMessage
source: Avoid the 'Opt' suffix in a nullable-enabled code
ko: nullable 지원 코드에서는 'Opt' 접미사를 사용하지 마세요.
pt_br: Evite o sufixo 'Opt' em um código habilitado para anulável
zh_hant: 避免在可為 null 的程式碼中使用 'Opt' 尾碼

# AvoidOptSuffixForNullableEnableCodeTitle
source: Avoid the 'Opt' suffix
ko: 'Opt' 접미사 사용 방지
pt_br: Evite o sufixo 'Opt'
zh_hant: 避免 'Opt' 尾碼

# BlankLinesMessage
source: Avoid multiple blank lines
cs: Nepoužívejte několik prázdných řádků.
ko: 여러 빈 줄 방지
pt_br: Evite várias linhas em branco
zh_hans: 避免出现多个空白行
zh_hant: 避免多個空白行

# BlankLinesTitle
source: Avoid multiple blank lines
pt_br: Evite várias linhas em branco
zh_hant: 避免多個空白行

# BracePlacementMessage
source: Braces must not have blank lines between them
cs: Závorky nesmí mít mezi sebou prázdné řádky.
ko: 중괄호 사이에는 빈 줄이 없어야 합니다.
pt_br: As chaves não podem ter linhas em branco entre elas
zh_hans: 括号之间不能有空白行
zh_hant: 括號之間不能有空白行

# CreateTestAccessorDescription
source: This is a refactoring which simplifies the process of creating test accessors using the 'TestAccessor' pattern.
cs: Toto je refaktoring, který zjednodušuje proces vytváření testovacích přístupových objektů pomocí vzoru TestAccessor.
de: Dies ist eine Umgestaltung, die den Prozess zum Erstellen von Testzugriffsmethoden mithilfe des TestAccessor-Musters vereinfacht.
ja: これは、TestAccessor パターンを使用してテスト アクセサーを作成するプロセスを簡略化するリファクタリングです
ko: 'TestAccessor' 패턴을 사용하여 테스트 접근자를 만드는 프로세스를 간소화하는 리팩터링입니다.
pl: Jest to refaktoryzacja upraszczająca proces tworzenia testowych metod dostępu przy użyciu wzorca TestAccessor
pt_br: Esta é uma refatoração que simplifica o processo de criação de acessadores de teste usando o padrão 'TestAccessor'.
zh_hans: 这是一种重构，它简化了使用 "TestAccessor" 模式创建测试访问器的过程。
zh_hant: 此為重構作業，可簡化使用 'TestAccessor' 模式建立測試存取子的流程。

# CreateTestAccessorMessage
source: Create test accessor
cs: Vytvořit testovací přístupový objekt
de: Testzugriffsmethode erstellen
ja: テスト アクセサーの作成
ko: 테스트 접근자 만들기
pl: Utwórz testową metodę dostępu
pt_br: Criar acessador de teste
zh_hans: 创建测试访问器
zh_hant: 建立測試存取子

# CreateTestAccessorTitle
source: Create test accessor
cs: Vytvořit testovací přístupový objekt
de: Testzugriffsmethode erstellen
ja: テスト アクセサーの作成
ko: 테스트 접근자 만들기
pl: Utwórz testową metodę dostępu
pt_br: Criar acessador de teste
zh_hans: 创建测试访问器
zh_hant: 建立測試存取子

# DefaultableTypeShouldHaveDefaultableFieldsDescription
source: Defaultable types should have defaultable fields.
cs: Typy, které se dají nastavit jako výchozí, by měly mít pole, která se tak dají nastavit taky.
de: Auf den Standard festlegbare Typen müssen auf den Standard festlegbare Felder aufweisen.
ja: 既定に設定可能な型には、既定に設定可能なフィールドが必要です
ko: 기본값 설정 가능 형식에는 기본값 설정 가능 필드가 있어야 합니다.
pl: Typy dopuszczające wartość domyślną powinny mieć pola z wartościami domyślnymi
pt_br: Os tipos usados como padrão devem ter campos usados como padrão.
zh_hans: 可默认类型应具有可默认字段。
zh_hant: 可設為預設的類型應具有可設為預設的欄位。

# DefaultableTypeShouldHaveDefaultableFieldsMessage
source: Defaultable type '{0}' has a non-defaultable field or auto-property '{1}'
cs: Typ {0}, který se dá nastavit jako výchozí, má pole nebo automatickou vlastnost {1}, které se jako výchozí nastavit nedají.
de: Der den Standard festlegbare Typ "{0}" weist ein nicht auf den Standard festlegbares Feld oder die automatische Eigenschaft "{1}" auf.
ja: 既定に設定可能な型 '{0}' に、既定に設定できないフィールドまたは自動プロパティ '{1}' が含まれています
ko: 기본값 설정 가능 형식 '{0}'에 기본값 설정 불가능 필드 또는 자동 속성 '{1}'이(가) 있습니다.
pl: Typ „{0}” dopuszczający wartość domyślną ma pole niedopuszczające wartości domyślnej lub automatyczną właściwość „{1}”
pt_br: O tipo usado como padrão '{0}' tem um campo não usado como padrão ou a propriedade automática '{1}'
zh_hans: 可默认类型“{0}”具有不可默认字段或自动属性“{1}”
zh_hant: 可設定預設值的類型 '{0}'，有無法設定預設值的欄位或自動屬性 '{1}'

# DefaultableTypeShouldHaveDefaultableFieldsTitle
source: Defaultable types should have defaultable fields
cs: Typy, které se dají nastavit jako výchozí, by měly mít pole, která se tak dají nastavit taky
de: Auf den Standard festlegbare Typen müssen auf den Standard festlegbare Felder aufweisen.
ja: 既定に設定可能な型には、既定に設定可能なフィールドが必要です
ko: 기본값 설정 가능 형식에는 기본값 설정 가능 필드가 있어야 함
pl: Typy dopuszczające wartość domyślną powinny mieć pola z wartościami domyślnymi
pt_br: Os tipos usados como padrão devem ter campos usados como padrão
zh_hans: 可默认类型应具有可默认字段。
zh_hant: 可設定預設值的類型應要有可設定預設值的欄位

# DoNotCallGetTestAccessorDescription
source: 'GetTestAccessor()' is a helper method reserved for testing. Production code must not call this member.
cs: GetTestAccessor() je pomocná metoda vyhrazená pro testování. Produkční kód tento člen nesmí volat.
de: GetTestAccessor() ist eine für Tests reservierte Hilfsmethode. Der Produktionscode darf diesen Member nicht aufrufen.
ja: GetTestAccessor () は、テスト用に予約されているヘルパー メソッドです。運用コードでこのメンバーを呼び出さないでください。
ko: 'GetTestAccessor()'는 테스트용으로 예약된 도우미 메서드입니다. 프로덕션 코드는 이 멤버를 호출해서는 안 됩니다.
pl: GetTestAccessor() to metoda pomocnicza zarezerwowana do testowania. Kod produkcyjny nie może wywoływać tego elementu członkowskiego.
pt_br: 'GetTestAccessor()' é um método auxiliar reservado para testes. O código de produção não deve chamar este membro.
zh_hans: "GetTestAccessor()" 是保留用于测试的 helper 方法。生产代码不得调用此成员。
zh_hant: 'GetTestAccessor()' 是保留供測試的協助程式方法。實際執行程式碼不得呼叫此成員。

# DoNotCallGetTestAccessorMessage
source: Do not call 'GetTestAccessor()' from production code
cs: Nevolejte GetTestAccessor() z produkčního kódu.
de: GetTestAccessor() nicht aus Produktionscode aufrufen
ja: GetTestAccessor() を運用コードから呼び出さないでください
ko: 프로덕션 코드에서 'GetTestAccessor()'를 호출하지 마세요.
pl: Nie wywołuj metody GetTestAccessor() z kodu produkcyjnego
pt_br: Não chamar o 'GetTestAccessor()' no código de produção
zh_hans: 请勿从生产代码中调用 "GetTestAccessor()"
zh_hant: 請勿從實際執行程式碼呼叫 'GetTestAccessor()'

# DoNotCallGetTestAccessorTitle
source: Do not call 'GetTestAccessor()'
cs: Nevolat GetTestAccessor()
de: GetTestAccessor() nicht aufrufen
ja: GetTestAccessor() を呼び出さないでください
ko: 'GetTestAccessor()' 호출 금지
pl: Nie wywołuj metody GetTestAccessor()
pt_br: Não chamar o 'GetTestAccessor()'
zh_hans: 请勿调用 "GetTestAccessor()"
zh_hant: 請勿呼叫 'GetTestAccessor()'

# DoNotCopyValueAvoidNullableWrapperDescription
source: Avoid nullable wrapper.
cs: Nepoužívejte obálky s možnou hodnotou null.
ko: nullable 래퍼를 사용하지 마세요.
pt_br: Evite o wrapper anulável.
zh_hans: 避免可为 null 的包装器。
zh_hant: 避免使用可為 Null 的包裝函式。

# DoNotCopyValueAvoidNullableWrapperMessage
source: Do not wrap non-copyable type '{0}' in '{1}' operation
cs: Neobalujte nekopírovatelný typ {0} do operace {1}.
ko: '{1}' 작업에서 복사할 수 없는 형식 '{0}' 래핑 안 함
pt_br: Não encapsular o tipo não copiável '{0}' na operação '{1}'
zh_hans: 请勿包装“{1}”操作中不可复制的类型“{0}”
zh_hant: 請勿在 '{1}' 作業中包裝無法複製的類型 '{0}'

# DoNotCopyValueDescription
source: Do not copy value.
cs: Nekopírujte hodnotu.
ko: 값을 복사하지 마세요.
pt_br: Não copie o valor.
zh_hans: 不复制值。
zh_hant: 請勿複製值。

# DoNotCopyValueMessage
source: Do not copy value
cs: Nekopírujte hodnotu.
ko: 값 복사 안 함
pt_br: Não copiar o valor
zh_hans: 不复制值
zh_hant: 請勿複製值

# DoNotCopyValueNoAssignValueFromReferenceDescription
source: Cannot assign a value from a reference to a non-copyable type.
zh_hant: 無法將參考的值指派到無法複製的類型。

# DoNotCopyValueNoAssignValueFromReferenceMessage
source: Cannot assign a value from a reference to non-copyable type '{0}'
zh_hant: 無法將參考的值指派到無法複製的類型 '{0}'

# DoNotCopyValueNoBoxingDescription
source: Do not box non-copyable value types.
cs: Nebalte nekopírovatelné typy hodnot.
ko: 복사할 수 없는 값 형식을 boxing하지 않습니다.
pt_br: Não demarque tipos de valor não copiáveis.
zh_hans: 请勿对不可复制的值类型装箱。
zh_hant: 請勿對無法複製的值類型進行 Box 處理。

# DoNotCopyValueNoBoxingMessage
source: Do not box non-copyable type '{0}'
cs: Nebalte nekopírovatelný typ hodnoty {0}.
ko: 복사할 수 없는 형식 '{0}' boxing 안 함
pt_br: Não demarcar o tipo não copiável '{0}'
zh_hans: 请勿对不可复制的类型“{0}”装箱
zh_hant: 請勿對無法複製的類型 '{0}' 進行 Box 處理

# DoNotCopyValueNoReturnValueFromReferenceDescription
source: Cannot return a value from a reference to a non-copyable type.
zh_hant: 無法將參考的值傳回無法複製的類型。

# DoNotCopyValueNoReturnValueFromReferenceMessage
source: Cannot return a value from a reference to non-copyable type '{0}'
zh_hant: 無法將參考的值傳回無法複製的類型 '{0}'

# DoNotCopyValueNoUnboxingDescription
source: Do not unbox non-copyable value types.
cs: Nerozbalujte nekopírovatelné typy hodnot.
ko: 복사할 수 없는 값 형식을 unboxing하지 않습니다.
pt_br: Não converta tipos de valor não copiáveis.
zh_hans: 请勿对不可复制的值类型取消装箱。
zh_hant: 請勿對無法複製的值類型進行 Unbox 處理。

# DoNotCopyValueNoUnboxingMessage
source: Do not unbox non-copyable type '{0}'
cs: Nerozbalujte nekopírovatelný typ hodnoty {0}.
ko: 복사할 수 없는 형식 '{0}' unboxing 안 함
pt_br: Não converter o tipo não copiável '{0}'
zh_hans: 请勿对不可复制的类型“{0}”取消装箱
zh_hant: 請勿對無法複製的類型 '{0}' 進行 Unbox 處理

# DoNotCopyValueTitle
source: Do not copy value
cs: Nekopírovat hodnotu
ko: 값 복사 안 함
pt_br: Não copiar o valor
zh_hans: 不复制值
zh_hant: 請勿複製值

# DoNotCopyValueUnsupportedUseDescription
source: Unsupported use of non-copyable type.
cs: Nepodporované použití nekopírovatelného typu
ko: 복사할 수 없는 형식의 사용이 지원되지 않습니다.
pt_br: Não há suporte para o uso do tipo não copiável.
zh_hans: 不支持使用不可复制的类型。
zh_hant: 不支援使用無法複製的類型。

# DoNotCopyValueUnsupportedUseMessage
source: Unsupported use of non-copyable type '{0}' in '{1}' operation
cs: Nepodporované použití nekopírovatelného typu {0} v operaci {1}
ko: '{1}' 작업에서 복사할 수 없는 형식 '{0}'의 사용이 지원되지 않습니다.
pt_br: Não há suporte para o uso do tipo não copiável '{0}' na operação '{1}'
zh_hans: 不支持在“{1}”操作中使用不可复制的类型“{0}”
zh_hant: 不支援在 '{1}' 作業中使用無法複製的類型 '{0}'

# ExportedPartsShouldHaveImportingConstructorCodeFix_ImplicitConstructor
source: Explicitly define the importing constructor
cs: Explicitně definujte importující konstruktor.
de: Importierenden Konstruktor explizit definieren
ja: インポート コンストラクターを明示的に定義します
ko: 명시적으로 가져오기 생성자 정의
pl: Jawnie zdefiniuj konstruktor importujący
pt_br: Definir explicitamente o construtor de importação
zh_hans: 显式定义导入构造函数
zh_hant: 明確定義匯入建構函式

# ExportedPartsShouldHaveImportingConstructorCodeFix_MissingAttribute
source: Add 'ImportingConstructor' attribute
cs: Přidejte atribut ImportingConstructor.
de: Attribut "ImportingConstructor" hinzufügen
ja: 'ImportingConstructor' 属性の追加
ko: 'ImportingConstructor' 특성 추가
pl: Dodaj atrybut „ImportingConstructor”
pt_br: Adicionar atributo 'ImportingConstructor'
zh_hans: 添加 "ImportingConstructor" 特性
zh_hant: 新增 'ImportingConstructor' 屬性

# ExportedPartsShouldHaveImportingConstructorCodeFix_NonPublicConstructor
source: Make constructor public
cs: Nastavit konstruktor jako veřejný
de: Konstruktor als öffentlich festlegen
ja: コンストラクターを公開します
ko: 생성자를 public으로 만들기
pl: Ustaw konstruktor jako publiczny
pt_br: Tornar o construtor público
zh_hans: 使构造函数成为公共构造函数
zh_hant: 將建構函式設為公用

# ExportedPartsShouldHaveImportingConstructorDescription
source: Exported parts should be marked with 'ImportingConstructorAttribute'.
cs: Exportované cesty by se měly označit atributem ImportingConstructorAttribute.
de: Exportierte Teile müssen "[ImportingConstructor]" umfassen
ja: エクスポートされたパーツには [ImportingConstructor] が必要です
ko: 내보낸 파트는 'ImportingConstructorAttribute'로 표시해야 합니다.
pl: Eksportowane części powinny mieć atrybut [ImportingConstructor]
pt_br: As partes exportadas devem ser marcadas com 'ImportingConstructorAttribute'.
zh_hans: 导出的部件应使用 "ImportingConstructorAttribute" 标记。
zh_hant: 匯出的組件應標記為 'ImportingConstructorAttribute'。

# ExportedPartsShouldHaveImportingConstructorMessage
source: '{0}' is MEF-exported and should have a single importing constructor of the correct form
cs: {0} se exportovalo pomocí MEF a mělo by mít jeden importující konstruktor ve správném tvaru.
de: "{0}" ist MEF-exportiert und muss einen einzelnen importierenden Konstruktor der richtigen Form aufweisen.
ja: '{0}' は MEF でエクスポートされており、正しい形式の単一のインポート コンストラクターが含まれている必要があります
ko: '{0}'은(는) MEF 내보내기이며 올바른 형식의 단일 가져오기 생성자가 있어야 합니다.
pl: Element „{0}” jest eksportowany przez strukturę MEF i powinien mieć pojedynczy konstruktor importujący o właściwej postaci
pt_br: '{0}' é exportado pelo MEF e deve ter um construtor de importação única do formato correto
zh_hans: “{0}”是 MEF 导出的，应具有正确形式的单个导入构造函数
zh_hant: '{0}' 屬於 MEF 匯出，應有格式正確的單一匯入建構函式

# ExportedPartsShouldHaveImportingConstructorTitle
source: Exported parts should be marked with 'ImportingConstructorAttribute'
cs: Exportované cesty by se měly označit atributem ImportingConstructorAttribute
de: Exportierte Teile müssen "[ImportingConstructor]" umfassen
ja: エクスポートされたパーツには [ImportingConstructor] が必要です
ko: 내보낸 파트는 'ImportingConstructorAttribute'로 표시해야 합니다.
pl: Eksportowane części powinny mieć atrybut [ImportingConstructor]
pt_br: As partes exportadas devem ser marcadas com 'ImportingConstructorAttribute'
zh_hans: 导出的部件应使用 "ImportingConstructorAttribute" 标记
zh_hant: 匯出的組件應標記為 'ImportingConstructorAttribute'

# ExposeMemberForTestingDescription
source: Expose member for testing.
cs: Zpřístupnit člen pro testování
de: Member für Tests verfügbar machen
ja: テストのためにメンバーを公開します
ko: 테스트를 위해 멤버를 노출합니다.
pl: Udostępnij element członkowski do testowania
pt_br: Exponha o membro para teste.
zh_hans: 公开要进行测试的成员。
zh_hant: 公開要進行測試的成員。

# ExposeMemberForTestingMessage
source: Expose member for testing
cs: Zpřístupnit člen pro testování
de: Member für Tests verfügbar machen
ja: テストのためにメンバーを公開します
ko: 테스트용 멤버 노출
pl: Udostępnij element członkowski do testowania
pt_br: Expor membro para teste
zh_hans: 公开要进行测试的成员
zh_hant: 公開要測試的成員

# ExposeMemberForTestingTitle
source: Expose member for testing
cs: Zpřístupnit člen pro testování
de: Member für Tests verfügbar machen
ja: テストのためにメンバーを公開します
ko: 테스트용 멤버 노출
pl: Udostępnij element członkowski do testowania
pt_br: Expor membro para teste
zh_hans: 公开要进行测试的成员
zh_hant: 公開要測試的成員

source: Fix numbered comments
cs: Opravit očíslované komentáře
de: Nummerierte Kommentare korrigieren
ja: 番号付きのコメントの修正
ko: 번호가 매겨진 주석 수정
pl: Popraw numerowane komentarze
pt_br: Corrigir comentários numerados
zh_hans: 修复带编号的注释
zh_hant: 修正已編號的註解

# ImportingConstructorShouldBeObsoleteCodeFix_ErrorSetToFalse
source: Set 'ObsoleteAttribute.Error' to 'true'
cs: Nastavte ObsoleteAttribute.Error na true.
de: Legen Sie "ObsoleteAttribute.Error" auf TRUE fest.
ja: ObsoleteAttribute.Error を true に設定してください
ko: 'ObsoleteAttribute.Error'를 'true'로 설정
pl: Ustaw parametr ObsoleteAttribute.Error na wartość true
pt_br: Defina 'ObsoleteAttribute.Error' como 'true'
zh_hans: 将 "ObsoleteAttribute.Error" 设置为 "true"
zh_hant: 將 'ObsoleteAttribute.Error' 設定為 'true'

# ImportingConstructorShouldBeObsoleteCodeFix_IncorrectDescription
source: Use correct 'ObsoleteAttribute' message.
cs: Použijte správnou zprávu ObsoleteAttribute.
de: Korrekte ObsoleteAttribute-Nachricht verwenden
ja: 正しい ObsoleteAttribute メッセージを使用します
ko: 올바른 'ObsoleteAttribute' 메시지를 사용하세요.
pl: Użyj poprawnego komunikatu ObsoleteAttribute
pt_br: Use a mensagem 'ObsoleteAttribute' correta.
zh_hans: 使用正确的 "ObsoleteAttribute" 消息。
zh_hant: 使用正確的 'ObsoleteAttribute' 訊息。

# ImportingConstructorShouldBeObsoleteCodeFix_MissingAttribute
source: Add 'ObsoleteAttribute'
cs: Přidejte ObsoleteAttribute.
de: "ObsoleteAttribute" hinzufügen
ja: ObsoleteAttribute の追加
ko: 'ObsoleteAttribute' 추가
pl: Dodaj atrybut ObsoleteAttribute
pt_br: Adicionar 'ObsoleteAttribute'
zh_hans: 添加 "ObsoleteAttribute"
zh_hant: 新增 'ObsoleteAttribute'

# ImportingConstructorShouldBeObsoleteCodeFix_MissingDescription
source: Configure 'ObsoleteAttribute' for importing constructor.
cs: Nakonfigurujte ObsoleteAttribute pro importující konstruktor.
de: "ObsoleteAttribute" für importierenden Konstruktor konfigurieren
ja: インポート コンストラクターの ObsoleteAttribute を構成します
ko: 가져오기 생성자를 위해 'ObsoleteAttribute'를 구성합니다.
pl: Skonfiguruj atrybut ObsoleteAttribute dla konstruktora importującego
pt_br: Configure 'ObsoleteAttribute' para o construtor de importação.
zh_hans: 配置 "ObsoleteAttribute" 以导入构造函数。
zh_hant: 請設定 'ObsoleteAttribute' 以匯入建構函式。

# ImportingConstructorShouldBeObsoleteCodeFix_MissingError
source: Set 'ObsoleteAttribute.Error' to 'true'
cs: Nastavte ObsoleteAttribute.Error na true.
de: Legen Sie "ObsoleteAttribute.Error" auf TRUE fest.
ja: ObsoleteAttribute.Error を true に設定してください
ko: 'ObsoleteAttribute.Error'를 'true'로 설정
pl: Ustaw parametr ObsoleteAttribute.Error na wartość true
pt_br: Defina 'ObsoleteAttribute.Error' como 'true'
zh_hans: 将 "ObsoleteAttribute.Error" 设置为 "true"
zh_hant: 將 'ObsoleteAttribute.Error' 設定為 'true'

# ImportingConstructorShouldBeObsoleteDescription
source: Importing constructor should be marked with 'ObsoleteAttribute'.
cs: Importující konstruktor by se měl označit atributem ObsoleteAttribute.
de: Importierender Konstruktor muss "[Obsolete]" lauten
ja: インポート コンストラクターは [Obsolete] にする必要があります
ko: 가져오기 생성자는 'ObsoleteAttribute'로 표시해야 합니다.
pl: Konstruktor importujący powinien być oznaczony jako [Obsolete]
pt_br: O construtor de importação deve ser marcado com 'ObsoleteAttribute'.
zh_hans: 导入构造函数应使用 "System.obsoleteattribute" 标记。
zh_hant: 匯入的建構函式應標記為 'ObsoleteAttribute'。

# ImportingConstructorShouldBeObsoleteMessage
source: Importing constructor should be marked with 'ObsoleteAttribute'
cs: Importující konstruktor by se měl označit atributem ObsoleteAttribute.
de: Importierender Konstruktor muss "[Obsolete]" lauten
ja: インポート コンストラクターは [Obsolete] にする必要があります
ko: 가져오기 생성자는 'ObsoleteAttribute'로 표시해야 합니다.
pl: Konstruktor importujący powinien być oznaczony jako [Obsolete]
pt_br: O construtor de importação deve ser marcado com 'ObsoleteAttribute'
zh_hans: 导入构造函数应使用 "ObsoleteAttribute" 标记
zh_hant: 匯入的建構函式應標記為 'ObsoleteAttribute'

# ImportingConstructorShouldBeObsoleteTitle
source: Importing constructor should be marked with 'ObsoleteAttribute'
cs: Importující konstruktor by se měl označit atributem ObsoleteAttribute
de: Importierender Konstruktor muss "[Obsolete]" lauten
ja: インポート コンストラクターは [Obsolete] にする必要があります
ko: 가져오기 생성자는 'ObsoleteAttribute'로 표시해야 합니다.
pl: Konstruktor importujący powinien być oznaczony jako [Obsolete]
pt_br: O construtor de importação deve ser marcado com 'ObsoleteAttribute'
zh_hans: 导入构造函数应使用 "ObsoleteAttribute" 标记
zh_hant: 匯入的建構函式應標記為 'ObsoleteAttribute'

source: Place statement on following line
cs: Umístit příkaz na následující řádek
ko: 다음 줄에 문 배치
pt_br: Colocar a instrução na linha seguinte
zh_hans: 将语句另起一行
zh_hant: 將陳述式放在下一行

# NamedTypeFullNameNotNullSuppressorJustification
source: The 'Type.FullName' property is never null when using the syntax 'typeof(T).FullName'
ko: 'typeof(T).FullName' 구문을 사용하는 경우 'Type.FullName' 속성은 null일 수 없습니다.
pt_br: A propriedade 'Type.FullName' nunca é nula quando a sintaxe 'typeof(T).FullName' é usada
zh_hant: 使用語法 'typeof(T).FullName' 時，'Type.FullName' 屬性絕不會為 Null

# PreferNullLiteralCodeFix
source: Use 'null' instead of 'default'
cs: Místo default použijte null.
de: "null" anstelle von "default" verwenden
ja: 'default' の代わりに 'null' を使用する
ko: 'default' 대신 'null'을 사용합니다.
pl: Użyj wartości „null” zamiast „default”
pt_br: Use 'null' em vez de 'default'
zh_hans: 使用 "null" 而不是“默认值”
zh_hant: 使用 'null'，而不要使用 'default'

# PreferNullLiteralDescription
source: Use 'null' instead of 'default' for nullable types.
cs: Pro typy s možnou hodnotou null místo default použijte null.
de: Verwenden Sie für Nullable-Typen "null" anstelle von "default".
ja: Null 許容型には、'default' の代わりに 'null' を使用します。
ko: Null 허용 형식에 'default' 대신 'null'을 사용합니다.
pl: Użyj wartości „null” zamiast „default” dla typów dopuszczających wartość null.
pt_br: Use 'null' em vez de 'default' para tipos que permitem valor nulo.
zh_hans: 对可为 null 类型使用 "null" 而不是默认值。
zh_hant: 對可為 Null 的型別使用 'null'，而不要使用 'default'。

# PreferNullLiteralMessage
source: Use 'null' instead of 'default' for nullable types
cs: Pro typy s možnou hodnotou null místo default použijte null.
de: Für Nullable-Typen "null" anstelle von "default" verwenden
ja: Null 許容型には、'default' の代わりに 'null' をお使いください
ko: Null 허용 형식에 'default' 대신 'null'을 사용합니다.
pl: Użyj wartości „null” zamiast „default” dla typów dopuszczających wartość null
pt_br: Use 'null' em vez de 'default' para tipos que permitem valor nulo
zh_hans: 对可为 null 类型使用 "null" 而不是默认值
zh_hant: 對可為 Null 的型別使用 'null'，而不要使用 'default'

# PreferNullLiteralTitle
source: Prefer null literal
cs: Upřednostňovat literál null
de: NULL-Literal bevorzugen
ja: null リテラルを優先
ko: null 리터럴을 기본으로 사용
pl: Preferuj literał o wartości null
pt_br: Preferir literal nulo
zh_hans: 首选 null 文本
zh_hant: 建議使用 Null 常值

# RelaxTestNamingSuppressorJustification
source: Asynchronous test methods do not require the 'Async' suffix
cs: Asynchronní testovací metody nevyžadují příponu Async.
de: Für asynchrone Testmethoden ist das Suffix "Async" nicht erforderlich.
ja: 非同期テスト メソッドには 'Async' サフィックスが不要です。
ko: 비동기 테스트 메서드에는 'Async' 접미사가 필요하지 않습니다.
pl: Asynchroniczne metody testowe nie wymagają sufiksu „Async”.
pt_br: Os métodos de teste assíncronos não exigem o sufixo 'Async'
zh_hans: 异步测试方法不需要 "Async" 后缀
zh_hant: 非同步測試方法不需要 'Async' 尾碼

source: Remove blank lines between braces
cs: Odebrat prázdné řádky mezi závorkami
ko: 중괄호 간의 빈 줄 제거
pt_br: Remover as linhas em branco entre as chaves
zh_hans: 删除括号之间的空白行
zh_hant: 移除括號之間的空白行

source: Remove extra blank lines
cs: Odebrat nadbytečné prázdné řádky
ko: 여분의 빈 줄 제거
pt_br: Remover as linhas em branco extras
zh_hans: 删除多余的空白行
zh_hant: 移除額外的空白行

# TemporaryArrayAsRefDescription
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable.
zh_hant: TemporaryArray<T>.AsRef() 的執行個體必須是 'using' 變數。

# TemporaryArrayAsRefMessage
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable
zh_hant: TemporaryArray<T>.AsRef() 的執行個體必須是 'using' 變數

# TemporaryArrayAsRefTitle
source: Instance of TemporaryArray<T>.AsRef() must be a 'using' variable
zh_hant: TemporaryArray<T>.AsRef() 的執行個體必須是 'using' 變數

# TestExportsShouldNotBeDiscoverableCodeFix
source: Apply 'PartNotDiscoverableAttribute'
cs: Použijte PartNotDiscoverableAttribute.
de: "PartNotDiscoverableAttribute" anwenden
ja: PartNotDiscoverableAttribute の適用
ko: 'PartNotDiscoverableAttribute' 적용
pl: Zastosuj atrybut PartNotDiscoverableAttribute
pt_br: Aplicar 'PartNotDiscoverableAttribute'
zh_hans: 应用 "PartNotDiscoverableAttribute"
zh_hant: 套用 'PartNotDiscoverableAttribute'

# TestExportsShouldNotBeDiscoverableDescription
source: Test exports should not be discoverable.
cs: Testovací exportování by se neměla dát zjistit.
de: Testexporte dürfen nicht ermittelbar sein
ja: テスト エクスポートは検出可能であってはなりません
ko: 테스트 내보내기는 검색할 수 없습니다.
pl: Odnajdywanie eksportów testowych nie powinno być możliwe
pt_br: As exportações de teste não devem ser detectáveis.
zh_hans: 测试导出应该不可发现。
zh_hant: 應無法搜尋到測試匯出。

# TestExportsShouldNotBeDiscoverableMessage
source: '{0}' is exported for test purposes and should be marked with 'PartNotDiscoverableAttribute'
cs: {0} se exportovalo pro účely testování a mělo by se označit atributem PartNotDiscoverableAttribute.
de: "{0}" wird zu Testzwecken exportiert und muss als "PartNotDiscoverable" gekennzeichnet werden.
ja: '{0}' はテスト用にエクスポートされており、PartNotDiscoverable としてマークされている必要があります
ko: '{0}'은(는) 테스트용으로 내보냈으며 'PartNotDiscoverableAttribute'로 표시해야 합니다.
pl: Element „{0}” jest eksportowany do celów testowych i powinien być oznaczony jako PartNotDiscoverable
pt_br: '{0}' é exportado para fins de teste e deve ser marcado como 'PartNotDiscoverableAttribute'
zh_hans: 导出“{0}”以用于测试，并且应使用 "PartNotDiscoverableAttribute" 将其进行标记
zh_hant: 匯出 '{0}' 之目的僅供測試之用，因此應標記為 'PartNotDiscoverableAttribute'
