Repository: dotnet/roslyn
Catalog: src/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, pt_br, zh_hans, zh_hant

# RemoveDeletedApiDescription
source: When removing a public type or member the corresponding entry in PublicAPI.txt should also be removed. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
es: Al quitar un tipo o miembros público, debe quitarse también la entrada correspondiente en PublicAPI.txt. Esto llama la atención sobre los cambios de la API en las revisiones del código y el historial de control de código fuente, y ayuda a evitar cambios rupturistas.
fr: Quand vous supprimez un type ou un membre public, l'entrée correspondante dans PublicAPI.txt doit également être supprimée. Cela attire l'attention sur les changements apportés à l'API dans les revues du code et l'historique du contrôle de code source. De plus, cela permet d'éviter les ruptures.

# ExposedNoninstantiableTypeMessage
source: Constructor makes its noninheritable base class inheritable, thereby exposing its protected members.
es: El constructor convierte su clase base no heredable en heredable, exponiendo así a sus miembros protegidos.
fr: Le constructeur fait de sa classe de base non héritable une classe héritable, exposant ainsi ses membres protégés.

# ExposedNoninstantiableTypeTitle
source: Constructor make noninheritable base class inheritable
es: El constructor convierte en heredable su clase base no heredable
fr: Le constructeur fait de la classe de base noninheritable une classe inheritable

# PublicApiFilesInvalidTitle
source: The contents of the public API files are invalid
es: El contenido de los archivos de la API pública no son válidos.
fr: Le contenu des fichiers de l'API publique est non valide

# PublicApiFilesInvalidMessage
source: The contents of the public API files are invalid: {0}
es: El contenido de los archivos de la API pública no son válidos: {0}.
fr: Le contenu des fichiers de l'API publique est non valide : {0}

# DuplicateSymbolsInPublicApiFilesTitle
source: Do not duplicate symbols in public API files
es: No duplicar los símbolos en los archivos de la API pública
fr: Ne pas dupliquer les symboles dans les fichiers d'une API publique

# DuplicateSymbolsInPublicApiFilesMessage
source: The symbol '{0}' appears more than once in the public API files.
es: El símbolo "{0}" aparece más de una vez en los archivos de la API pública.
fr: Le symbole '{0}' apparaît plusieurs fois dans les fichiers de l'API publique.

# PublicImplicitConstructorErrorMessageName
source: implicit constructor for {0}
es: constructor implícito para {0}
fr: constructeur implicite pour {0}

# AvoidMultipleOverloadsWithOptionalParametersTitle
source: Do not add multiple public overloads with optional parameters
es: No agregar múltiples sobrecargas públicas con parámetros opcionales
fr: Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels

# AvoidMultipleOverloadsWithOptionalParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Do not add multiple overloads with optional parameters'. See '{1}' for details.
es: El símbolo "{0}" no cumple con el requisito de compatibilidad con versiones anteriores: "No agregar múltiples sobrecargas públicas con parámetros opcionales". Vea "{1}" para obtener más información.
fr: Le symbole '{0}' viole l'exigence de compatibilité descendante : 'Ne pas ajouter plusieurs surcharges publiques avec des paramètres optionnels'. Pour plus d'informations, consultez '{1}'.

# OverloadWithOptionalParametersShouldHaveMostParametersTitle
source: Public API with optional parameter(s) should have the most parameters amongst its public overloads.
es: La API pública con parámetros opcionales debe tener la mayoría de parámetros entre sus sobrecargas públicas.
fr: L'API publique avec un ou plusieurs paramètres optionnels doit avoir le plus de paramètres possibles parmi ses surcharges publiques.

# OverloadWithOptionalParametersShouldHaveMostParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Public API with optional parameter(s) should have the most parameters amongst its public overloads'. See '{1}' for details.
es: El símbolo "{0}" no cumple con el requisito de compatibilidad con versiones anteriores: "La API pública con parámetros opcionales debe tener la mayoría de parámetros entre sus sobrecargas públicas". Vea "{1}" para obtener más información.
fr: Le symbole '{0}' viole l'exigence de compatibilité descendante : 'L'API publique avec un ou plusieurs paramètres optionnels doit avoir le plus de paramètres possibles parmi ses surcharges publiques'. Pour plus d'informations, consultez '{1}'.
