Repository: dotnet/roslyn
Catalog: src/Compilers/Core/Rebuild/xlf/RebuildResources.*.xlf
Languages: cs, es, ko, pl, pt_br, ru, zh_hans, zh_hant

source: '{0}' exists '{1}' times in compilation options.
cs: {0} existuje v možnostech kompilace {1}krát.
es: '{0}' existe '{1}' en opciones de diálogo.
ko: '{0}'이(가) 컴파일 옵션에 '{1}'번 있습니다.
pl: "{0}" istnieje "{1}" razy w opcjach kompilacji.
pt_br: '{0}' existe '{1}' vezes nas opções de compilação.
ru: "{0}" встречается "{1}" раз в параметрах компиляции.
zh_hans: '{0}' 在编译选项中存在 '{1}' 次。
zh_hant: '{0}' 在編譯選項中已存在 '{1}' 次。

source: A non-null PDB stream must be provided because the compilation does not have an embedded PDB.
cs: Je třeba zadat nenulový datový proud PDB, protože kompilace nemá vložený soubor PDB.
es: Debe proporcionarse un flujo de PDB que no sea nulo porque el problema no tiene insertado un PDB.
ko: 컴파일에 포함된 PDB가 없으므로 null이 아닌 PDB 스트림을 제공해야 합니다.
pl: Należy podać strumień PDB, który nie ma wartości null, ponieważ kompilacja nie ma osadzonego pliku PDB.
pt_br: Um fluxo PDB não nulo deve ser fornecido porque a compilação não contém um PDB inserido.
ru: Необходимо указать поток PDB со значением, отличным от NULL, поскольку компиляция не содержит внедренного PDB-файла.
zh_hans: 必须提供非 NULL PDB 流，因为编译没有嵌入的 PDB。
zh_hant: 必須提供非 Null 的 PDB 資料流程，因為編譯沒有內嵌的 PDB。

source: Cannot create compilation options: {0}
cs: Nejde vytvořit možnosti kompilace: {0}
es: No se pueden crear opciones de diseño: {0}
ko: 컴파일 옵션을 만들 수 없습니다. {0}
pl: Nie można utworzyć opcji kompilacji: {0}
pt_br: Não é possível criar opções de compilação: {0}
ru: Не удается создать параметры компиляции: {0}
zh_hans: 无法创建编译选项: {0}
zh_hant: 無法建立編譯選項: {0}

source: Could not get PDB file path.
cs: Nepovedlo se získat cestu k souboru PDB.
es: No se pudo obtener la ruta de acceso al archivo PDB.
ko: PDB 파일 경로를 가져올 수 없습니다.
pl: Nie można uzyskać ścieżki do pliku PDB.
pt_br: Não foi possível obter o caminho do arquivo PDB.
ru: Не удалось получить путь к PDB-файлу.
zh_hans: 未能获取 PDB 文件路径。
zh_hant: 無法取得 PDB 檔案路徑。

source: Does not contain metadata compilation options.
cs: Neobsahuje možnosti kompilace metadat.
es: No contiene opciones de repositorio de metadatos.
ko: 메타데이터 컴파일 옵션을 포함하지 않습니다.
pl: Nie zawiera opcji kompilacji metadanych.
pt_br: Não contém opções de compilação de metadados.
ru: Не содержит параметров компиляции метаданных.
zh_hans: 不包含元数据编译选项。
zh_hant: 不包含中繼資料編譯選項。

source: Encountered null or empty key for compilation options pairs.
cs: Pro páry možností kompilace byl zjištěn klíč s hodnotou null nebo prázdný klíč.
es: Se ha encontrado una clave nula o vacía para los pares de opciones de este tipo.
ko: 컴파일 옵션 쌍에 대해 null 또는 빈 키가 발견되었습니다.
pl: Napotkano wartość null lub pusty klucz dla par opcji kompilacji.
pt_br: Chave nula ou vazia encontrada para pares de opções de compilação.
ru: Обнаружено значение NULL или пустой ключ для пар параметров компиляции.
zh_hans: 编译选项对遇到 NULL 或空键。
zh_hant: 編譯選項群組遇到 Null 或空的金鑰。

source: Encountered unexpected byte '{0}' when expecting a null terminator.
cs: Při očekávání nulového zakončení došlo k neočekávanému bajtu {0}.
es: Byte inesperado '{0}' cuando se espera un terminador nulo.
ko: null 종결자가 필요한 경우에 예기치 않은 바이트 '{0}'이(가) 발생했습니다.
pl: Napotkano nieoczekiwany bajt "{0}", gdy oczekiwano terminatora o wartości null.
pt_br: Byte '{0}' inesperado encontrado ao esperar um terminador nulo.
ru: Обнаружен непредвиденный байт "{0}" при ожидании терминатора NULL.
zh_hans: 应为 NULL 终止符时遇到意外的 '{0}' 字节。
zh_hant: 預期 Null 結束字元時遇到未預期的位元組 '{0}'。

source: Invalid language name.
cs: Neplatný název jazyka.
es: Tipo de lenguaje no válido.
ko: 잘못된 언어 이름입니다.
pl: Nieprawidłowa nazwa języka.
pt_br: Nome de idioma inválido.
ru: Недопустимое имя языка.
zh_hans: 语言名称无效。
zh_hant: 無效的語言名稱。

source: PDB stream must be null because the compilation has an embedded PDB.
cs: Datový proud PDB musí mít hodnotu null, protože kompilace má vložený soubor PDB.
es: El flujo PDB debe ser nulo porque la incrustación tiene un PDB insertado.
ko: 컴파일에 포함된 PDB가 있으므로 PDB 스트림은 null이어야 합니다.
pl: Strumień pliku PDB musi mieć wartość null, ponieważ kompilacja ma osadzony plik PDB.
pt_br: O fluxo PDB deve ser nulo porque a compilação contém um PDB inserido.
ru: Поток PDB должен иметь значение NULL, поскольку компиляция включает внедренный PDB-файл.
zh_hans: PDB 流必须为 NULL，因为编译具有嵌入的 PDB。
zh_hant: PDB 資料流程必須為 Null，因為編譯具有內嵌的 PDB。

source: Unexpected value for EmbedInteropTypes/MetadataImageKind '{0}'.
cs: Neočekávaná hodnota pro EmbedInteropTypes/MetadataImageKind {0}.
es: Valor inesperado para EmbedInteropTypes/MetadataImageType '{0}".
ko: EmbedInteropTypes/MetadataImageKind '{0}'에 대한 예기치 않은 값입니다.
pl: Nieoczekiwana wartość dla EmbedInteropTypes/MetadataImageKind "{0}".
pt_br: Valor inesperado para EmbedInteropTypes/MetadataImageKind '{0}'.
ru: Непредвиденное значение EmbedInteropTypes/MetadataImageKind "{0}".
zh_hans: EmbedInteropTypes/MetadataImageKind '{0}' 的意外值。
zh_hant: EmbedInteropTypes/MetadataImageKind '{0}' 未預期的值。
